{
  "id": 17556,
  "mediaId": 8407,
  "date": "2022-03-03",
  "headline": "Business Buzz: Scottsdale’s Young Paris Launches NFT Projects",
  "image": "https://www.phoenixmag.com/wp-content/uploads/2022/03/paris-rising-1280x853.jpg",
  "link": "https://www.phoenixmag.com/2022/03/03/business-buzz-scottsdales-young-paris-launches-nft-projects/",
  "mediaOutlet": "phoenixmag.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’ve been enjoying hanging out with locals and also just kind of playing in different industries and real estate and learning about finance.” His release of an NFT project called the Syndicated Cat Club, based around 999 cat characters, will be released soon.",
    "Young Paris – born Milandou Badila in Paris – signed to Jay Z’s record label Roc Nation in 2016 on the strength of a unique Afrobeat-style sound influenced by his Congolese heritage.",
    "Like many New Yorkers during the pandemic, rapper, fashion designer and entrepreneur Young Paris left the city, settling in Scottsdale as COVID-19 canceled live performances.",
    "Fans and investors can buy one to help an artist raise money for a project, and in turn, the buyer owns something they can later sell, too.",
    "“Just imagine all these artists that can now have their fans buying their music before it’s even out,” he says.",
    "“I’m still kind of figuring out the vibe, where my place and my brain really fits in the city,” he says.",
    "In a twist that bodes well for the Valley’s creative economy, the musician wasn’t sidelined by the move.",
    "It’s just going to make the art world and music and entertainment way better.”\n— Rachel Leingang",
    "NFTs, for the uninitiated, are pieces of data – images or audio files – stored on a blockchain.",
    "Republican U.S. Senate hopeful Blake Masters launched a collection as a campaign fundraiser.",
    "“And then having the money to reinvest into way better music videos and way better concerts.",
    "NFTs allow artists to create a direct relationship with their supporters, Young Paris says.",
    "Scottsdale multihyphenate Young Paris launches NFT projects for local artists.",
    "Recently, he branched out into cryptocurrency and non-fungible tokens.",
    "(He speaks three languages and records most of his music in French.)",
    "Arizona Pest Control created a collection of pest-inspired NFTs.",
    "Young Paris sees them as the future for artists like him.",
    "But his non-musical endeavors are compelling, too.",
    "He isn’t the only Arizonan venturing into NFTs.",
    "In fact, he found ways to expand his empire.",
    "One is called Arnold Roachenegger."
  ]
}