{
  "id": 2193,
  "mediaId": 2526,
  "date": "2022-02-04",
  "headline": "UPDATE: GoFundMe Relents After Backlash, Will Refund All Donors to Canadian Trucker Fund",
  "image": "https://media.breitbart.com/media/2021/10/GoFundMe-CEO-Tim-Cadogan-640x335.jpg",
  "link": "https://www.breitbart.com/tech/2022/02/04/highway-robbery-gofundme-to-redirect-10m-canadian-trucker-fund-to-verified-charities/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allum Bokhari",
  "authorUrl": "https://www.breitbart.com/author/allum-bokhari/",
  "termIds": [
    5675,
    5101,
    3005,
    1520,
    1394,
    550,
    6029
  ],
  "sentences": [
    "But, because the fundraiser was held on a far-left platform known for shutting down fundraisers and even freezing funds destined for causes popular with conservatives, a large portion of that money (maybe even most of it, if donors aren’t alerted to the situation, and the refund deadline) is likely to be redirected to causes and charities that are vetted by GoFundMe.",
    "The Company claims it reversed course due to “donor feedback” after it announced it would “redirect” donations intended for the Canadian Freedom Convoy to “credible and established charities” that are chosen by Freedom Convoy organizers and “verified by GoFundMe.”\nGoFundme’s update was released on Twitter at 11:56 p.m. Pacific time on Friday via Twitter.",
    "— GoFundMe (@gofundme) February 5, 2022\nThe original story continues below:\nIn what is likely to go down in history as one of the most brazen actions ever taken by a Big Tech platform, money sent by small donors to the Freedom Convoy will be redirected to causes that the donors never intended to support, unless they request a refund before February 19.",
    "The same platform that allows users to solicit donations for violent BLM-supporting felons who assaulted police officers says it took the decision because of “police reports of violence and other unlawful activity.”\nGoFundMe’s decision to effectively steal the funds was welcomed by the Ottawa police and by the city’s left-wing mayor, Jim Watson.",
    "The platform also banned a fundraiser for a Texas nurse seeking to overturn an employee vaccine mandate, an election integrity project launched shortly after the 2020 election, and a fundraiser launched by conservative commentator Candace Owens for a café owner who criticized George Floyd and BLM protesters during the 2020 summer riots.",
    "Via GoFundMe:\nGiven how this situation has evolved, no further funds will be directly distributed to the Freedom Convoy organizers — we will work with organizers to send all remaining funds to credible and established charities chosen by the Freedom Convoy 2022 organizers and verified by GoFundMe.",
    "Galvanized by their effective, peaceful resistance against two years of government restrictions on everyday activities, people around the world pledged over $10 million in small donations to the Canadian truckers through GoFundMe.",
    "— Ottawa Police (@OttawaPolice) February 5, 2022\nNEW:\nI want to sincerely thank the team at @gofundme for listening to the plea made by the City and the Ottawa Police to no longer provide funds to the convoy organizers.",
    "— Blake Masters (@bgmasters) February 5, 2022\nGoFundMe has a long history of bias, including banning a legal fundraiser for Kyle Rittenhouse before the teenager, now cleared of all charges,was ever convicted of a crime.",
    "— GoFundMe (@gofundme) February 5, 2022\nThe update we issued earlier enabled all donors to get a refund and outlined a plan to distribute remaining funds to verified charities selected by the Freedom Convoy organizers.",
    "UPDATE: Following the publication of this article and an intense backlash against the company, GoFundMe has announced that all donors to the fundraiser for the Canadian Freedom Convoy will be “automatically” refunded.",
    "It is the latest in a long line of politically biased decisions by the platform which has driven many conservative activists to alternative platforms, such as the Christian-owned competitor GiveSendGo.",
    "Arizona senate candidate and former venture capitalist Blake Masters said GoFundMe executives should be arrested for “fraud and theft” if the money is sent to left-wing nonprofits.",
    "Update — Following the publication of this article, GoFundMe announced that it would refund all donors to the Freedom Convoy instead of “redirecting” their donations.",
    "The Freedom Convoy, which was created by Canadian truckers to protest draconian coronavirus restrictions in the country, has captured attention around the world.",
    "If GoFundMe steals the truckers’ money & sends it to left-wing non-profits, the company’s executives should be arrested and tried for fraud and theft.",
    "The decision to withhold funding for these unlawful demonstrations is an important step and we call on all crowdfunding sites to follow.",
    "1/3\n— Jim Watson (@JimWatsonOttawa) February 4, 2022\nThe move drew political condemnation from across the border.",
    "To simplify the process for our users, we will be refunding all donations to the Freedom Convoy 2022 fundraiser.",
    "All donors may submit a request for a full refund until February 19th, 2022 using this dedicated refund form.",
    "However, due to donor feedback, we are simplifying the process and automatically refunding donations.",
    "He is the author of #DELETED: Big Tech’s Battle to Erase the Trump Movement and Steal The Election.",
    "We want to thank @gofundme for listening to our concerns as a City and a police service.",
    "This refund will happen automatically—you do not need to submit a request.",
    "Allum Bokhari is the senior technology correspondent at Breitbart News.",
    "Donors can expect to see refunds within 7-10 business days.",
    "The story has been updated with this information."
  ]
}