{
  "id": 2290,
  "mediaId": 2644,
  "date": "2022-02-07",
  "headline": "Peter Thiel leaving Meta board, will reportedly focus on pro-Trump advocacy",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/peter-thiel-meta-trump-99.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/07/peter-thiel-leaving-meta-board-will-reportedly-focus-on-pro-trump-advocacy/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Theo Wayt",
  "authorUrl": "",
  "termIds": [
    5660,
    3706,
    4306,
    3005,
    2765,
    1005,
    641,
    468,
    339,
    5949
  ],
  "sentences": [
    "“Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions.”\nThiel likewise praised Zuckerberg for his “intelligence, energy, and conscientiousness.”\n“His talents will serve Meta well as he leads the company into a new era,” Thiel said\nThiel is now reportedly expected to focus more of his time on conservative political causes, including senate bids by two of his proteges, Blake Masters and JD Vance, according to the WSJ report.",
    "“His focus will be on supporting Blake Masters, JD Vance and others who support the Trump agenda.”\nThiel spokesman Jeremiah Hall did not immediately respond to a request for comment.",
    "“He thinks that the Republican Party can advance the Trump agenda and he wants to do what he can to support that,” a source close to Thiel told Bloomberg.",
    "Conservative tech mogul Peter Thiel is leaving the board of Facebook and Instagram parent company Meta after nearly two decades, the company said Monday.",
    "The tech founder — who has an estimated worth of $2.6 billion — became Facebook’s first outside investor in 2004 and joined the company’s board in 2005.",
    "Thiel is stepping down to focus on advancing his pro-Trump political agenda in the 2022 campaign cycle, Bloomberg and The Wall Street Journal reported.",
    "“Peter has been a valuable member of our board and I’m deeply grateful for everything he has done for our company,” Zuckerberg said.",
    "The co-founder of PayPal and Palantir plans to leave Meta following its annual meeting in May, Meta said in a press release.",
    "His endorsement of Trump at the 2016 Republican National Convention ruffled the feathers of some Facebook staffers.",
    "Thiel has spent millions of dollars supporting their candidacies and held fundraising dinners for both candidates.",
    "In the press release confirming Thiel’s exit, Mark Zuckerberg lavished praise on the conservative mogul.",
    "Masters and Vance are running the Republican Senate primaries in Arizona and Ohio, respectively."
  ]
}