{
  "id": 3169,
  "mediaId": 2643,
  "date": "2022-01-27",
  "headline": "For Some, Biden's Pledge of SCOTUS Nominee Puts Race Above Achievement",
  "image": "",
  "link": "https://www.newsweek.com/some-bidens-pledge-scotus-nominee-puts-race-above-achievement-1673808",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Thomas",
  "authorUrl": "https://www.newsweek.com/authors/jake-thomas",
  "termIds": [
    5699,
    5138,
    4905,
    4788,
    3509,
    2767,
    2859,
    1126,
    1394,
    1489,
    1269
  ],
  "sentences": [
    "\"President Biden has many highly qualified candidates to consider, but we hope he takes this opportunity to not only make good on his commitment to increase the Court's racial diversity, but also his vision for professional diversity,\" Brian Fallon, executive director of advocacy group Demand Justice, said in a statement on Wednesday.",
    "The article also noted how Sonia Sotomayor, the first Latina on the court, was treated as an unqualified \"affirmative action\" pick after being nominated by President Barack Obama in 2009 despite graduating summa cum laude and Phi Beta Kappa from Princeton University and Yale Law School and serving as a federal judge.",
    "Retiring Supreme Court Justice Stephen Breyer's potential replacement won't be named for a month, but President Joe Biden's pledge to nominate a Black woman has already sparked attacks from Republicans that the pick could be unqualified if chosen based on gender and race.",
    "An associate justice on the California Supreme Court, Kruger worked in the Obama administration as deputy assistant attorney general for the Office of Legal Counsel, assistant to the solicitor general and acting deputy solicitor general.",
    "\"The president's intention is to consult with members of both parties, and his intention is to nominate a qualified candidate after completing a rigorous process who is worthy of the excellence and decency of Breyer's legacy.\"",
    "In a now-deleted tweet, Ilya Shapiro, who has been hired as executive director of Georgetown's Center for the Constitution, wrote that Biden should pick federal Judge Sri Srinivasan, according to The Daily Beast.",
    "Senator Rick Scott, a Florida Republican heading the party's efforts to retake the Senate, said in a tweet that Democrats will be forced to \"walk the plank in support of a radical liberal with extremist views.\"",
    "Republican politicians and conservative commentators flooded Twitter with reactions suggesting Biden is more interested in shoring up his political base than finding the best qualified candidate.",
    "A graduate of Harvard and Harvard Law School, Jackson clerked for Breyer, in addition to serving as vice-chair of the United States Sentencing Commission and as a district judge.",
    "\"Will this deeply unpopular & divisive president finally reject the radical elements of his party and nominate someone who loves America and believes in the Constitution?\"",
    "Blake Masters, Republican Senate candidate in Arizona, said on Twitter that Biden will nominate drag performer RuPaul, adding, \"you'll be expected to take it seriously.\"",
    "Writing in Slate on Thursday, Dahlia Lithwick and Mark Joseph Stern pointed out that Republican presidents have also made Supreme Court picks based on demographics.",
    "White House press secretary Jen Psaki on Wednesday confirmed Biden would stick to the campaign promise he made in February 2020 before the South Carolina primary.",
    "Ambassador and Republican South Carolina Governor Nikki Haley tweeted that it \"would be nice\" if Biden picked a nominee without \"a race/gender litmus test.\"",
    "Psaki shot back, telling Forbes that Republican lawmakers had \"obliterated their own credibility\" by criticizing the yet-to-be-named nominee.",
    "More recently, President Donald Trump said he would pick a woman to replace Ruth Bader Ginsburg before nominating Amy Coney Barrett.",
    "Jackson was confirmed last June by the Senate with three Republican votes for a vacancy on the U.S. Court of Appeals for the D.C.",
    "Fox News personality Sean Hannity tweeted, \"Race and gender have nothing to do with being a SCOTUS justice!\"",
    "\"But alas doesn't fit into last intersectionality hierarchy so we'll get lesser black woman,\" he wrote.",
    "Republican senators who will vote on the nominee have already raised alarms about Biden's unnamed pick.",
    "Two names among those mentioned as possible nominees are Ketanji Brown Jackson and Leondra Kruger.",
    "President Ronald Reagan picked Antonin Scalia because he wanted an Italian-American on the court.",
    "\"Whomever he selects, we know that the bad-faith attacks are coming from Republicans.\"",
    "\"Or will he continue to tear apart this country w/ a woke activist?\"",
    "Newsweek has reached out to the Senate Republicans for a response.",
    "All but seven Supreme Court justices have been white men.",
    "She holds degrees from Yale Law School and Harvard.",
    "\"Our intention is to not play games,\" Psaki said.",
    "Senator Josh Hawley, R-Missouri, said on Twitter.",
    "Former U.N.",
    "Circuit."
  ]
}