{
  "id": 4372,
  "mediaId": 2570,
  "date": "2022-01-27",
  "headline": "White House Says Republicans Have ‘Obliterated Their Own Credibility’ By Attacking Biden’s — Still Unnamed — Supreme Court Nominee",
  "image": "",
  "link": "https://www.forbes.com/sites/alisondurkee/2022/01/27/white-house-says-republicans-have-obliterated-their-own-credibility-by-attacking-bidens---still-unnamed---supreme-court-nominee/?sh=112d294961ec",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alison Durkee",
  "authorUrl": "https://www.forbes.com/sites/alisondurkee/",
  "termIds": [
    0
  ],
  "sentences": [
    "Key Facts\nBiden will “work in good faith with senators of both parties” to choose a Supreme Court nominee, Psaki said Thursday, and slammed Republicans characterizing Biden’s nominee as “radical, before they know literally anything about who she is.”\nShe also hit back at Republicans who have criticized Biden’s commitment to nominating the first Black woman to the court, saying suggestions that Black female candidates are somehow less qualified are “ludicrous.”\nSen. Josh Hawley (R-Mo.)",
    "She is also related through marriage to former House Speaker Paul Ryan (R-Wis.), who testified to the Senate in 2012 his “praise for Ketanji's intellect, for her character, for her integrity … is unequivocal.” California Supreme Court Justice Leondra Kruger is viewed as a moderate on that court, Reuters reports, noting she holds more conservative-leaning views on criminal cases.",
    "Rep. Lauren Boebert (R-Colo.) presdicted Biden will “try to appoint a radical leftist,” while Senate candidate Blake Masters tweeted Biden would “nominate [drag queen] RuPaul to SCOTUS and you’ll be expected to take it seriously.”\n“Our intention is to not play games,” Psaki said Thursday after chiding Republicans who claimed Biden will nominate a radical.",
    "Topline\nWhite House Press Secretary Jen Psaki criticized Republicans who have already started attacking President Joe Biden over his first Supreme Court nomination before he’s even named anyone, saying Thursday that GOP lawmakers who have suggested Biden will pick an “extreme” far-left nominee have “obliterated their own credibility” by doing so.",
    "“The president’s intention is to consult with members of both parties, and his intention is to nominate a qualified candidate after completing a rigorous process who is worthy of the excellence and decency of [Justice Stephen] Breyer’s legacy.”\nThe judges viewed as leading contenders for the Supreme Court spot could garner Republican support.",
    "During Donald Trump’s presidency, the GOP-controlled Senate confirmed three controversial Supreme Court nominees, after stalling filling the seat vacated by Justice Antonin Scalia until after President Barack Obama left office and Trump could nominate Scalia’s successor.",
    "House Majority Whip Rep. James Clyburn (D-S.C.) is pushing U.S. District Court Judge J. Michelle Childs to the White House as a potential nominee and has said he believes she could get Republican votes, telling ABC News Wednesday that GOP Sens.",
    "Biden has long pledged to nominate the court’s first Black female justice, and liberal activists had been publicly pressuring Breyer to retire so Biden could have a nominee confirmed while the Senate is under Democratic control.",
    "said on Twitter Wednesday he was afraid Biden would choose a “woke activist” who holds liberal views on issues like immigration and vaccine mandates, saying to “expect a major battle in the Senate” if he does.",
    "Democrats hold a slim Senate majority of 50 votes plus Vice President Kamala Harris as a tiebreaker—though whether she can break ties for Supreme Court votes could be a matter of debate.",
    "Republicans on the Senate Judiciary Committee, who hold the same number of seats as Democrats, could try to slow down the process, however, Democratic aides noted to the Washington Post.",
    "Biden said Thursday he intends to announce a nominee by the end of February, and Senate Majority Leader Chuck Schumer (D-N.Y.) has said the chamber intends to move swiftly to confirm.",
    "The first Supreme Court vacancy of Biden’s presidential tenure opened up on Thursday as Justice Stephen Breyer announced his retirement after more than 25 years on the bench.",
    "(New York Times)\nDemocrats rejoice, Republicans cast any new Supreme Court nominee as radical as election-year fight begins (Washington Post)",
    "Susan Collins (Maine), Lisa Murkowski (Alaska) and Lindsey Graham (S.C.)—when she was confirmed by the Senate last year.",
    "It’s unlikely Republicans will be able to block confirmation as long as all Democrats are in favor of the nominee.",
    "Judge Ketanji Brown Jackson, who serves on the U.S. Court of Appeals for the D.C.",
    "Which Republicans might support a Biden nominee for the Supreme Court?",
    "Graham and Tim Scott are “very high” on the judge.",
    "Circuit, received three GOP votes—from Sens.",
    "Few, if any."
  ]
}