{
  "id": 5289,
  "mediaId": 2578,
  "date": "2022-04-13",
  "headline": "Blake Masters: “FBI Was Too Busy Kidnapping the Michigan Governor” to Keep Tabs on Black Nationalist NYC Subway Shooter Who Was on Their Radar",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/AA8156C9-7FF3-4862-8A98-560428332A93.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/04/blake-masters-fbi-busy-kidnapping-michigan-governor-keep-tabs-black-nationalist-nyc-subway-shooter-radar/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/jim-hoft/",
  "termIds": [
    4782,
    1394,
    474,
    6386,
    6442
  ],
  "sentences": [
    "He was known to the FBI, but FBI was too busy kidnapping the Michigan governor.pic.twitter.com/LFXCCAbQmh\n— Blake Masters (@bgmasters) April 13, 2022\nHopefully, the FBI will not raid Blake’s home with armed SWAT teams following this tweet.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nArizona senatorial candidate Blake Masters wins the internet for this tweet earlier today.",
    "At least 10 people were shot and 6 others were injured on Tuesday when James fired at least 30 rounds rounds inside the subway station, officials said.",
    "The NY subway shooter went on YouTube rants against white people and was a black supremacist… so that’ll be the last we hear about it!",
    "But the FBI was too busy concocting a plot to kidnap the Michigan Governor and had little time to keep tabs on the NYC subway shooter.",
    "We now know that Frank James was a black nationalist and posted several videos on the oppression of black people.",
    "In fact, they still haven’t caught him after the shooting yesterday.",
    "Five victims are in critical condition but are expected to survive.",
    "Frank James was previously on the FBI terrorist radar until 2019.",
    "New York City subway shooter Frank James is still on the loose.",
    "Then they stopped watching him."
  ]
}