{
  "id": 5813,
  "mediaId": 4067,
  "date": "2022-04-13",
  "headline": "Political Campaigns Are Facing Risks With Crypto Donations On Coinbase And BitPay",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-03/17/18/asset/baba97c21d21/sub-buzz-2979-1647543149-2.jpg?crop=1600:838;0,14%26downsize=1250:*",
  "link": "https://www.buzzfeednews.com/article/emilybakerwhite/coinbase-bitpay-campaign-donations-cryptocurrency",
  "mediaOutlet": "buzzfeednews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Baker-White",
  "authorUrl": "https://www.buzzfeednews.com/author/emilybakerwhite",
  "termIds": [
    3005,
    5089,
    871,
    476,
    163,
    303,
    19
  ],
  "sentences": [
    "“I can only see the number increasing.”\nEven though crypto advocates are already shaping legislation and pouring money into elections, so far much of the money changing hands is in fiat: A recent analysis by Bloomberg found that while crypto industry leaders have donated $7.3 million to political campaigns this cycle, only $580,000 of that money has actually been donated in cryptocurrency.",
    "When asked about the risk of fraud in donations, Hamilton said taking crypto isn’t so different from taking donations of fiat currency: “Any financial transaction or financial-related entity is always going to be at risk for fraud.”\nThe rise of crypto campaign donations comes at a moment of historic weakness for the FEC, which has been hamstrung by partisan gridlock.",
    "I’m just grateful that we had the courage to explore it and offer it and put it out there.”\nAarika Rhodes, a progressive pro-crypto Congressional candidate who accepts donations via BitPay and the Lightning Network, told BuzzFeed News that she had received “thousands” of donations in cryptocurrency.",
    "That’s because when cryptocurrency is transferred from one digital wallet to another, there is a public, permanent, unmodifiable record of the transaction showing the amount of money transferred, and the wallet IDs that it was transferred to and from.",
    "Most — but not all — wallet providers in the US, including Coinbase, BitPay, FTX, and Binance, are subject to anti–money laundering and “know your customer” laws, which require that providers verify the identity of the people using their services.",
    "Moreover, in the past 15 years, the Supreme Court has substantially weakened campaign finance laws, enabling corporations to spend extensively on lobbying without having to disclose their involvement in various political efforts to the public.",
    "Moreover, even when a wallet provider has verified a user’s identity, the provider will generally share that information only in response to a subpoena — which a campaign wouldn’t obtain in the course of a routine due diligence check.",
    "“Evidence has suggested that crypto isn’t going anywhere, and so we’re just starting to see the beginning of these donations hit the campaign finance world,” said Sarah Bryner, research director at the Center for Responsive Politics.",
    "By contrast, Mike Naple, a spokesperson for the progressive payment processor ActBlue, told BuzzFeed News that the company “employs multiple checks” to “detect financial fraud.” Coinbase did not respond to a request for comment.",
    "While it has been legal to donate to campaigns using cryptocurrency since 2014, the floodgates opened last June, when the National Republican Congressional Committee announced that it would begin accepting donations in crypto.",
    "The Federal Election Commission requires candidates to collect and disclose donors’ names, addresses, and employers, which they can normally do by matching a donor’s name to the name on a check or the address on a credit card.",
    "But with intentionally obscured wallets and no such verification available through BitPay and Coinbase, campaigns must rely on crypto donors truthfully filling out a simple web form with few mechanisms to ensure it’s accurate.",
    "The two largest cryptocurrency platforms in the space, BitPay and Coinbase, anonymize transactions by creating a new “wallet address” (a random string of numbers and letters) for each user each time they transfer money.",
    "Several of the providers that partner with BitPay to facilitate campaign donations are not subject to anti–money laundering and “know your customer” requirements, including Trust Wallet, BlueWallet, and Samourai Wallet.",
    "Bryner of the Center for Responsive Politics said the challenge posed by crypto donations is primarily one of enforcement — and in some ways, crypto donations pose similar challenges to donations made in cash.",
    "Georgia secretary of state candidate David Belle Isle, a conservative who takes donations via BitPay, said doing so was an “easy thing\" to make it “convenient for those who believe in” the promise of crypto.",
    "But because the feature is opt-in, it’s likely that few donors have it enabled — which means campaigns would not be able to corroborate a donor’s statement of identity with their public blockchain activity.",
    "But the platforms intentionally obscure the identities of people using their services, which makes it harder for campaigns to find out if donors are who they say they are — and follow campaign finance laws.",
    "This poses the risk that crypto donors could engage in fraudulent or otherwise illegal giving, leading campaigns to fail to report the cryptocurrency given to them, whether negligently or nefariously.",
    "I think we should have full transparency about where [candidates] get their money.”\nThe candidates that BuzzFeed News spoke to expressed the desire to be fully transparent about their campaign donors.",
    "Digital forensics investigators can often track down anonymous actors using cryptocurrency, even those using platforms that aren’t subject to anti–money laundering and “know your customer” rules.",
    "Wendy Hamilton, a progressive candidate for Congress who takes donations via BitPay, Coinbase, and the Lightning Network, said that her campaign hasn’t yet received many donations in crypto yet.",
    "According to the Daily Beast, QAnon hero and congressional candidate Ron Watkins received several cryptocurrency donations that lost 27% of their value before he could convert them to cash.",
    "Rhodes employs an accountant to scrutinize these donations, and her campaign has twice refunded money to donors who were ineligible because they listed addresses outside the United States.",
    "BitPay spokesperson Jan Jahosky declined to answer questions about whether the platform conducts any identity verification checks on people donating to campaigns through its platform.",
    "Untraceable donations provide a mechanism that could enable foreign actors to influence our elections, an inevitable threat that must be constantly monitored and countered.",
    "“I don’t think the average consumer — or the average congressperson — is going to be able to buy the services of cryptocurrency tracking firms on a regular basis,” he said.",
    "This is a common feature of cryptocurrency platforms, intended to prevent observers from using public blockchain explorers to identify the people behind each transaction.",
    "Since then, candidates from across the ideological spectrum have embraced crypto donations, and pro-crypto PACs have announced ambitious spending goals for 2022.",
    "Blake Masters, a conservative candidate for Senate, recently told supporters on Twitter to “DM me to donate in crypto\" and has sold NFTs to support his bid.",
    "While the anonymity of crypto can benefit private individuals, she said, “I don’t think that should be true for people like myself who are running.",
    "With crypto, a record exists — but tying that record to a specific donor, or a specific recipient, requires significant expense and expertise.",
    "But William Magnuson, a law professor and cryptocurrency expert at Texas A&M University, said those investigators can be hard to come by.",
    "Though anonymity has been entwined with cryptocurrency since its inception, in reality few US cryptocurrency users are fully anonymous.",
    "Proponents of cryptocurrency have long argued that its blockchain technology makes it more transparent than traditional banking.",
    "BitPay does offer an opt-in system for any transparency-minded users who wish to keep one consistent, auditable wallet address.",
    "However, the record does not show who each wallet belongs to, providing a measure of anonymity to those doing the transaction.",
    "This means that candidates with Coinbase and BitPay wallets had to prove their identity to the platform when they signed up.",
    "Plus, candidates must also pay Coinbase and BitPay processing fees to exchange crypto for dollars they can actually spend.",
    "In preparation for the 2022 midterm elections, more candidates than ever have begun accepting donations in cryptocurrency.",
    "But the FEC prohibits cash contributions to campaigns in amounts over $100, and no such limit exists for crypto.",
    "These challenges mean that some candidates are mostly accepting crypto donations as a political statement.",
    "As a result, major crypto platforms have begun marketing themselves to candidates as donation processors.",
    "But the feature can also prevent campaigns from verifying that their donors are who they claim to be.",
    "Campaigns, which register with BitPay as “business accounts,” also have consistent wallet addresses.",
    "That’s because, with cash, “there is no paper trail unless the candidate reports one,” Bryner said.",
    "That might be because cryptocurrencies are extremely volatile, making them a risky way to donate.",
    "But the people sending money to candidates’ wallets aren’t always required to do the same.",
    "“They’re not gonna go hunt down a donation worth $500 when there are bigger fish to fry.”",
    "That expense and expertise may be beyond the limited resources of the FEC, Bryner said.",
    "But none seemed uniquely concerned about the verification challenges posed by crypto.",
    "Masters did not respond to a request for comment.",
    "Rhodes raised concerns about donor anonymity.",
    "“Have we been awash in it?",
    "Not necessarily.",
    "Rev."
  ]
}