{
  "id": 7670,
  "mediaId": 2636,
  "date": "2022-04-06",
  "headline": "Dissatisfied With Their Party, Wealthy Republican Donors Form Secret Coalitions",
  "image": "https://static01.nyt.com/images/2022/04/06/us/politics/06dc-donors-1/merlin_200210907_9b45b302-4baa-424f-a4ba-c3f7b1dc4f15-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/06/us/politics/republican-donors-rockbridge-network-trump.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The brochure, which circulated in Republican finance circles this year, calls Rockbridge “a kind of political venture capital firm” that will “leverage our investors’ capital with the right political expertise” to “replace the current Republican ecosystem of think tanks, media organizations and activist groups that have contributed to the Party’s decline with better action-oriented, more effective people and institutions that are focused on winning.”\nAmong the initiatives cited in the Rockbridge brochure are media-related functions — including public relations, messaging, polling, “influencer programs” and investigative journalism — with a combined budget of $8 million.",
    "A “lawfare and strategic litigation” effort with a projected cost of $3.75 million is intended to use the courts “to hold bad actors, including the media, accountable.” A “transition project,” with an estimated price tag of $3 million, is intended to assemble policy experts and plans to create a “government-in-waiting” to “staff the next Republican administration.”\nA “red state project” is intended to mimic a model pioneered by the left in which strategists coordinate the efforts of an array of movement groups to complement one another and avoid overlap.",
    "The Conservative Partnership Institute, has sought to become “the hub of the conservative movement.” It claimed in its 2021 annual report to have played a role in the creation of several new conservative nonprofits, including America First Legal, which is led by former Trump aide Stephen Miller; the Center for Renewing America, led by another Trump alumnus, Russ Vought; and the American Cornerstone Institute, led by Ben Carson, the former secretary of housing and urban development.",
    "Mr. Schlapp, who helped expand the Koch brothers’ political operation more than 15 years ago, said he created the Chestnut Street Council because donors approached him after the 2020 election “expressing frustration with the more normal routes for funding political operations.”\n“We decided that it made sense to work with these donors to find better investment opportunities,” he said.",
    "Ms. Wren, who helped raise money for many Trump political initiatives, including the rally that preceded the Jan. 6 attack on the Capitol, said the right should try to replicate the left’s system of donor alliances and nonprofit funding hubs to incubate new groups and increase cooperation between existing ones, according to a person familiar with the presentation.",
    "Funding hubs like the Conservative Partnership Institute and another nonprofit network shaped by the judicial activist Leonard A. Leo are required to disclose their grants to other groups, but not the donors who supplied the cash, while donor coalitions like the Rockbridge Network and Chestnut Street Council will likely not be required to disclose either.",
    "A new coalition of wealthy conservative benefactors that says it aims to “disrupt but advance the Republican agenda” gathered this week for a private summit in South Florida that included closed-door addresses from former President Donald J. Trump and an allied Senate candidate at Mr. Trump’s Mar-a-Lago club, according to documents and interviews.",
    "The coalition, called the Rockbridge Network, includes some of Mr. Trump’s biggest donors, such as Peter Thiel and Rebekah Mercer, and has laid out an ambitious goal — to reshape the American right by spending more than $30 million on conservative media, legal, policy and voter registration projects, among other initiatives.",
    "The Mar-a-Lago dinner occurred just before another event there that drew Trump loyalists — the premiere of a movie critical of Mark Zuckerberg, the chief executive of Facebook parent company Meta, for providing grants in 2020 to election administrators struggling to cover the costs of holding an election amid a pandemic.",
    "The emergence of Rockbridge, the existence of which has not previously been reported, comes amid escalating jockeying among conservative megadonors to shape the 2022 midterms and the future of the Republican Party from outside the formal party machinery, and often with little disclosure.",
    "Taken together, the jockeying highlights frustration on the right with the political infrastructure that surrounds the Republican Party, and, in some cases, with its politicians, as well as disagreements about its direction as Mr. Trump teases another presidential run.",
    "The willingness of donors to organize on their own underscores the migration of power and money away from the official organs of the respective parties, which are required to disclose their donors, to outside groups that often have few disclosure requirements.",
    "The group also houses the Election Integrity Network, which is led by Cleta Mitchell, the conservative lawyer who was on the hourlong call with Georgia officials and Mr. Trump when the then-president pressured them to “find” enough votes to flip the result.",
    "A person familiar with Rockbridge described those projects, and their fund-raising goals, as aspirational, and said the coalition had so far focused on allocating donor funds to pre-existing groups to accomplish its goals, rather than creating new ones.",
    "An analysis by The New York Times found that 15 of the most politically active nonprofit organizations that generally align with the Democratic Party spent more than $1.5 billion in 2020 in funds for which the donors’ identities are not disclosed.",
    "One, Blake Masters, a former employee of Mr. Thiel’s who is running for Senate in Arizona, spoke at the Rockbridge dinner reception at Mar-a-Lago on Tuesday night before Mr. Trump, and conceivably could benefit from Rockbridge’s efforts.",
    "In February, another previously unreported coalition of donors, the Chestnut Street Council, organized by the Trump-allied lobbyist Matt Schlapp, held a meeting to hear a pitch for new models for funding the conservative movement.",
    "The efforts to harness the fortunes of the party’s richest activists could help it capitalize on a favorable electoral landscape headed into this year’s midterm elections, and — potentially — the 2024 presidential campaign.",
    "Eager to offset a Democratic advantage among so-called dark money groups, wealthy pro-Trump conservatives like Peter Thiel are involved in efforts to wield greater influence outside the traditional party machinery.",
    "The surge in secretive fund-raising does not end there — a number of nonprofit groups with varying degrees of allegiance to Mr. Trump are also vying to become leading distributors of donor funds to the right.",
    "“We need to show our side is organized and has the necessary institutional know-how and financial support, in order to have any shot at winning future elections,” reads a brochure for the Rockbridge Network.",
    "The effort to close that gap — and to make gains in political consulting and technology that undergirds the right’s political infrastructure — has been a major subject of discussion among these coalitions.",
    "It was not clear whether Mr. Thiel or Ms. Mercer attended the Rockbridge gathering this week, which included sessions at another hotel in addition to the dinner reception at Mar-a-Lago Tuesday night.",
    "It also reflects a concern among some influential Republicans that the political right faces a disadvantage when it comes to nonprofit groups that support the candidates and causes of each party.",
    "Recent private gatherings hosted in Colorado and Palm Beach, Fla., by Mr. Singer’s coalition, the American Opportunity Alliance, drew appearances by former Secretary of State Mike Pompeo, Gov.",
    "If those upstart coalitions gain momentum, they will likely have to vie for influence among conservatives with existing donor networks that have been skeptical of or agnostic toward Mr. Trump.",
    "The willingness of Mr. Trump and other officials and prospective presidential candidates to engage with these coalitions is a testament to their increasing centrality in American politics.",
    "Representative Tom Emmer of Minnesota, the chairman of the National Republican Congressional Committee, was expected to speak at the Rockbridge Network meeting in Palm Beach this week.",
    "He and Ms. Mercer, the daughter of the hedge fund magnate Robert Mercer, were among Mr. Trump’s biggest donors in 2016, and worked closely together on his presidential transition team.",
    "The person said that the coalition had tested some of its plans, including a voter registration initiative, last year in Arizona, which is identified in the brochure as a case study.",
    "The Conservative Partnership Institute received a $1 million infusion from Mr. Trump’s PAC last summer and held a donor retreat at Mar-a-Lago, Mr. Trump’s private club, last spring.",
    "Rockbridge was founded by Christopher Buskirk, who is the editor and publisher of the pro-Trump journal American Greatness and has advised a super PAC supporting Mr. Masters.",
    "A Modern-Day Party Boss: Hoarding cash, doling out favors and seeking to crush rivals, Mr. Trump is behaving like the head of a 19th-century political machine.",
    "Since then, Mr. Thiel has emerged as a key kingmaker, supporting 16 Senate and House candidates, some of whom have also been backed by Ms. Mercer.",
    "While new funding hubs have emerged on the right in recent years, none have matched the sophistication or spending levels of those on the left.",
    "Just the Beginning: For many Trump supporters who marched on Jan. 6, the day was not a disgraced insurrection but the start of a movement.",
    "It is estimated to cost $6 million to $8 million per state, and is initially focused on the swing states of Arizona, Nevada and Michigan.",
    "At a Chestnut Street Council meeting in February, donors heard a presentation from the veteran Republican fund-raiser Caroline Wren.",
    "That compared to roughly $900 million in so-called dark money spent by a comparable sample of 15 groups aligned with Republicans.",
    "Mr. Thiel has been a board member at Meta, but is leaving that position to focus on trying to influence the midterm elections.",
    "Power Struggle: Led by Senator Mitch McConnell, a band of anti-Trump Republicans is maneuvering to thwart the ex-president.",
    "Conversely, the party’s prospects could be dimmed if the moneyed class invests in competing candidates, groups and tactics.",
    "One that was created by the billionaire industrialists Charles G. and David H. Koch spent more than $250 million in 2020.",
    "Another, spearheaded by the New York hedge fund billionaire Paul Singer, hosted top Republican politicians in February.",
    "Ron DeSantis of Florida, former Vice President Mike Pence and Nikki Haley, a former United Nations ambassador.",
    "Post-Presidency Profits: Mr. Trump is melding business with politics, capitalizing for personal gain.",
    "Such groups have far fewer disclosure requirements than campaigns and political action committees.",
    "His involvement in Rockbridge suggests he could be branching into dark-money nonprofit spending.",
    "Many of their candidates have embraced the lie that Mr. Trump won the 2020 election.",
    "Mr. Thiel donated $10 million each to super PACs supporting Mr. Masters and J.D.",
    "Arizona was the site of Rockbridge’s first summit, which was held last year.",
    "He suggested that the group would support legal battles over voting rules.",
    ": Mr. Trump remains the most powerful figure in the Republican Party.",
    "It featured a speech by Mr. Thiel, the billionaire tech investor.",
    "However, there are signs his control is loosening.",
    "Efforts to reach Ms. Mercer were not successful.",
    "A spokesman for Mr. Thiel declined to comment.",
    "How Donald J. Trump Still Looms\nGrip on G.O.P.",
    "Vance, an Ohio Senate candidate."
  ]
}