{
  "id": 10939,
  "mediaId": 8405,
  "date": "2022-03-09",
  "headline": "Wendy Rogers v. Kelly Townsend? Get ready, Arizona, for a race for the ages",
  "image": "https://www.gannett-cdn.com/presto/2022/03/09/PPHX/da5b6e29-e90a-4720-8f69-9707b7939a39-king_kong.jpg?crop=1022,575,x0,y70&width=1022&height=575&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/03/09/wendy-rogers-v-kelly-townsend-get-ready-arizona-race-ages/9442037002/",
  "mediaOutlet": "Phoenix Arizona News: Breaking news, local headlines - azcentral.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    2765,
    3471,
    2915,
    4591,
    4039,
    1489,
    5943,
    5949,
    6426
  ],
  "sentences": [
    "Through a twist of fate and a fair amount of behind-the-scenes GOP maneuvering to protect Rogers from having to run in a Democratic district, the Arizona Independent Redistricting Commission drew the two women into the same legislative district — a safely Republican T-shaped district that sprawls across four counties, from Coconino and Navajo down through Gila to Pinal.",
    "Rogers, meanwhile, calls white nationalists “patriots” and reveres Nick Fuentes, the flamboyantly racist, misogynistic and anti-Semitic head of the white nationalist America First movement – a Holocaust denier who opened his recent conference by leading a cheer for Vladimir Putin.",
    "That powerful groups like the Arizona Chamber of Commerce & Industry — which last week repudiated Rogers, warning that \"elected officials who spread this kind of hateful and divisive rhetoric will have to answer to the voters” — would take a pass from taking a stand.",
    "But Rogers’ outrageous conduct of late, combined with Trump’s no-show on a congressional endorsement, prompted Townsend on Monday to announce she’ll take on Rogers in the Aug. 2 primary that almost certainly will decide Legislative District 7’s Senate seat.",
    "She capitalized on the Senate’s election audit to raise an un-heard of $2.5 million last year and still had $1.6 million in her campaign treasury as of Jan. 1 (having burned through hundreds of thousands of dollars in 2021, a non-election year).",
    "It took Rogers six tries to get elected to anything but she spent more than a million dollars to win a state Senate seat in 2020, ousting one of the Legislature's most conservative members who, in Rogers' view, \"wasn't conservative enough.\"",
    "'Repulsive and un-American' conduct\nEarly on, the prospect of running against Rogers, a Trump favorite who is a money-raising machine, was enough to push Townsend into announcing she would instead run for an open seat in Congress in Tucson.",
    "Doug Ducey may have spent nearly $500,000 from his PAC to get Rogers elected in 2020 because she is, as he put it a few weeks ago, “still better than” a Democrat but I doubt he or anyone else thinks she’s better than Townsend now.",
    "“But good and decent people are also free to find it repulsive and un-American.”\nThe question is, will good and decent Republican voters stand with Townsend on the line that Rogers has so blatantly and delightedly crossed?",
    "“Hanging out with white supremacists, endorsing them, and declaring them the finest patriots is all something Wendy Rogers has a constitutional right to do,” Townsend wrote, in announcing her bid.",
    "(And no, Sen. Rogers, we shouldn’t long for a return to the days of Sen. Joe McCarthy, whose dogged hunt to root out communists led to the widespread persecution of thousands of innocent people.)",
    "Since then, Rogers has become a rock star on the right, spreading outlandish lies from coast to coast about Arizona's \"stolen\" election, and now conservative candidates seek out her endorsement.",
    "From Townsend’s home in Apache Junction up to Rogers’ trailer in Flagstaff, the one the longtime Tempe resident moved into two years ago to run for the state Senate.",
    "It seems doubtful, to me at least, that establishment Republicans would stand silently by and watch Rogers get re-elected when there is an acceptable alternative.",
    "But the hesitation of the former president to endorse state Sen. Kelly Townsend’s run for Congress has given the state of Arizona a chance to redeem itself.",
    "But Townsend, at least, does draw the line at antisemitism (though she’s not above trivializing the Holocaust with inane comparisons to vaccines and such).",
    "Only two senators — Republicans Nancy Barto of Phoenix and Warren Petersen of Gilbert — sided with Rogers to vote against her censure last week.",
    "(No, Sen. Townsend, Biden’s short-lived vaccine mandate was not the same as the Nazi mandate that Jews wear the yellow Star of David.)",
    "But Townsend can point to nice things Trump has said about her to show she also should be acceptable to her fellow MAGA diehards.",
    "Meanwhile, key allies like Kari Lake, the Rogers-endorsed candidate for governor, seem to be standing upwind of the woman.",
    "And unlike Rogers, Townsend can point to the fact that she never has been censored by her fellow senators.",
    "They’re both far right conservatives who believe the election was stolen and COVID vaccines are suspect.",
    "A chance to send packing one of the kookiest characters ever to warm a seat in the Arizona Legislature.",
    "Townsend is Rogers, except for one thing\nThere’s no difference, policy wise, between the two senators.",
    "Or will they send a loud message that Rogers is now what the Republican Party is really all about?",
    "OPINION: Conventional wisdom says Sen. Wendy Rogers will wipe the floor with Sen. Kelly Townsend.",
    "Her usual diatribes about RINOs and George Soros-backed ringers won’t work against Townsend.",
    "Get ready, Arizona, for the state Senate race for the ages: Kelly Townsend v. Wendy Rogers.",
    "Meanwhile, Lake’s most conservative opponent, Matt Salmon, has called on Rogers to resign.",
    "Or even much different, policy wise, once you strip away Rogers’ racism and antisemitism.",
    "In fact, no other senator in Arizona history has been censured by his or her peers.",
    "That her sizable bank account and her Trump stamp of approval will be enough.",
    "Townsend, meanwhile, had just $13,000 in the bank as the year began.",
    "This “sweet grandma” may be in for the race of her political life.",
    "And they both have a tendency to say the most astonishing things.",
    "OK, I’ll bet you never expected me to write those four words.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "Rogers has been thus far mum on Townsend’s challenge.",
    "Picture King Kong v Godzilla, the mud pit version.",
    "On paper, Rogers is a clear favorite in the race.",
    "Surely, Republican voters are better than that.",
    "It’s a safe bet that Rogers won’t resign.",
    "But you know what isn’t a safe bet?",
    "Rogers has been endorsed by Trump.",
    "Is Rogers really destinted to win?",
    "But really, what can she say?",
    "Thank you, Donald Trump.",
    "Yeah, it’s like that.",
    "That Rogers will win.",
    "Gov."
  ]
}