{
  "id": 10988,
  "mediaId": 2593,
  "date": "2022-03-14",
  "headline": "Kari Lake Storms off Set of '60 Minutes' Australia: 'That Guy Is a Complete Nut'",
  "image": "https://ijr.com/wp-content/uploads/2022/03/Screenshot-9.jpg",
  "link": "https://ijr.com/kari-lake-storms-off-set-60-minutes-australia/",
  "mediaOutlet": "IJR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Savannah Rychcik",
  "authorUrl": "https://ijr.com/author/savannah/ ",
  "termIds": [
    0
  ],
  "sentences": [
    "'”\nBartlett noted Trump endorsed her personally, adding, “He said a few days ago that those people at the Capitol should be pardoned.”\nWhen asked if the accused rioters should be pardoned, Lake responded, “I’m still amazed that you say, ‘Your man Donald.’ That’s just so disrespectful.”\nThe former news anchor continued, “It’s just the flippant attitude.",
    "It’s obvious that you’ve come into this interview and you don’t like President Donald Trump.”\nLake accused Bartlett of “trying to twist this interview” and trying to make her “look bad.”\nWatch the video below:\nTrump-endorsed AZ Gov candidate Kari Lake sat down for interview with ‘60 Minutes Australia,’ which aired tonight.",
    "(@RonFilipkowski) March 14, 2022\nTransitioning to the accused January 6 rioters, Lake told Bartlett she does not like “that people are being held in prison without being charged.”\nCommenting on the Second Amendment, Lake explained, “We will never ever let that go.”\nThe interview took a turn as Lake grew more frustrated.",
    "Arizona gubernatorial candidate Kari Lake made headlines after storming off the set of “60 Minutes” Australia over questions about former President Donald Trump and the January 6 riot at the U.S. Capitol.",
    "Lake grew frustrated during the interview that aired on Sunday when journalist Liam Bartlett called the former president “your man Donald.”\nShe responded, “Why would you say that sir?",
    "“She is strong on Crime, will protect our Border, Second Amendment, Military, and Vets, and will fight to restore Election Integrity (both past and future!",
    "She will do a far better job than RINO Governor Doug Ducey–won’t even be a contest!”\nWe are committed to truth and accuracy in all of our journalism.",
    "He continued, “She is against Covid lockdowns, Cancel Culture, and will end ‘woke’ curriculum in our schools.",
    "Things when downhill fast when she was asked if she agreed with Trump that J6 defendants should get pardoned.",
    "Storming off the set, she could be heard saying, “That guy is a complete nut.",
    "Seriously, a complete insane person.”\nIn September 2021, Trump endorsed Lake.",
    "CNN noted she has repeated his false claims about election fraud.",
    "pic.twitter.com/Jmat6BTS1l\n— Ron Filipkowski ????",
    "It’s obvious that you’ve come into this.",
    "She ends up storming off the set.",
    "),” Trump said in a statement.",
    "Read our editorial standards.",
    "‘Your man Donald?"
  ]
}