{
  "id": 149,
  "mediaId": 2520,
  "date": "2022-02-25",
  "headline": "Ducey voices support for Sen. Wendy Rogers, who is set to speak at white nationalist conference",
  "image": "https://www.gannett-cdn.com/presto/2022/01/16/PPHX/639ac325-2486-4688-b1f8-a5be8dd84edc-Trump_in_Florence_Drop_4_031.JPG?crop=983,553,x0,y56&width=983&height=553&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/02/25/arizona-gov-doug-ducey-criticized-comments-sen-wendy-rogers/6943981001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stacey Barchenger",
  "authorUrl": "https://www.azcentral.com/staff/2646476001/stacey-barchenger/",
  "termIds": [
    0
  ],
  "sentences": [
    "She also gave an interview to an antisemitic news outlet whose founder claims that the country has been “taken over by a Jewish cabal.”\nLawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nRogers received top-billing at the Florida conference, alongside Nick Fuentes, the head of the American First Foundation that is hosting the event.",
    "\"What I need as a governor are governing majorities so that I can pass dollars into our social safety net, so we can provide programs like this that will help children from all over our state,\" the governor said following a Thursday event announcing partially state-funded scholarships for foster children to attend Grand Canyon University, a private Christian school.",
    "Last year, a Jewish group accused Rogers of \"thinly veiled hate speech\" after she posted a missive on Twitter that echoed sentiments of the “great replacement,” a white supremacist conspiracy theory that claims white people around the world are being systematically replaced by people of color.",
    "Karamargin pointed to Ducey's statements condemning racist and white supremacy groups after the deadly \"Unite the Right\" rally in Charlottesville, Virginia, in 2017, and decrying antisemitism after the mass shooting at a synagogue in Pittsburgh, Pennsylvania, in 2018.",
    "Rogers words, deeds draw scrutiny\nRogers has drawn scrutiny several times during her 14 months in office, largely for embracing Trump's stolen election theory — which dozens of lawsuits and a ballot review in Arizona that cost over $4 million have failed to prove.",
    "The comments came the day before Rogers, a Flagstaff Republican, was scheduled to speak at an America First Political Action Conference in Florida, hosted by a group whose leader has been criticized as espousing extremist ideologies.",
    "Doug Ducey is facing backlash for saying this week that state GOP Sen. Wendy Rogers, a major source of election disinformation who has ties to white nationalists, was preferable to having a Democrat in office.",
    "His role in organizing and attending multiple events spreading false claims that the 2020 election was stolen from Trump prompted a subpoena from the select committee investigating the Jan. 6 insurrection.",
    "Sen. Wendy Rogers has not only consistently expressed hate speech and a reactionary, right-wing ideology, but she’s sowed mistrust in the results of an election that Ducey himself certified.\"",
    "Former Maricopa County Sheriff Joe Arpaio and GOP gubernatorial candidate Kari Lake were also listed as speakers; but Lake said last week she was not taking part in the conference.",
    "Doug Ducey must stand with the people he swore an oath to represent and stop catering to the hate that he feels is necessary to advancing his own agenda,\" a joint statement reads.",
    "Rogers has repeatedly referenced her membership in the Oath Keepers, a far-right militia group whose members were involved in the Jan. 6 insurrection at the U.S. Capitol.",
    "Several groups — including the Southern Poverty Law Center and Anti-Defamation League — have labeled Fuentes a white nationalist and white supremacist, respectively.",
    "Rogers defeated French, a Democrat, in 2020 for the Senate seat in Legislative District 6 in northern Arizona, which stretches from Tusayan to Payson and Snowflake.",
    "Ducey's political action committee gave a significant boost to Rogers' campaign as part of its efforts to help the GOP maintain control of the state Legislature.",
    "Fuentes' organization promotes \"conservative values based on principles of American Nationalism, Christianity, and Traditionalism.\"",
    "Fuentes is a Trump acolyte who marched at the deadly \"Unite the Right\" rally in Charlottesville, Virginia, in 2017.",
    "The progressive groups Advancing Arizona and Progress Now Arizona chastised Ducey for his comments.",
    "And for people who are suggesting otherwise, they're just attempting to score political points.\"",
    "Reach reporter Stacey Barchenger at stacey.barchenger@arizonarepublic.com or 480-416-5669.",
    "It went on to say the governor's comments \"should cause everyone to ask exactly who Gov.",
    "\"That's what I've wanted to do, is move my agenda forward,\" Ducey said.",
    "And she's still better than her opponent, Felicia French.\"",
    "In response to the criticism, Ducey spokesman C.J.",
    "\"I'm proud of what we've been able to accomplish.",
    "Follow her on Twitter @sbarchenger.",
    "That should be pretty clear.",
    "Ducey thinks he represents.",
    "Ducey is not about hate.",
    "Karamargin said, \"Gov.",
    "Republican Gov.",
    "\"Gov."
  ]
}