{
  "id": 1560,
  "mediaId": 2690,
  "date": "2022-02-16",
  "headline": "Team McConnell Scared Of MAGA's Rise",
  "image": "https://storage.ning.com/topology/rest/1.0/file/get/4287750681?profile=UPSCALE_320x240",
  "link": "https://teapartyorg.ning.com/forum/team-mcconnell-scared-of-maga-s-rise?commentId=7928364%3AComment%3A2995066",
  "mediaOutlet": "teapartyorg.ning.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Admin Melony B. DeFord",
  "authorUrl": "https://teapartyorg.ning.com/members/AdminMelonyBDeFord",
  "termIds": [
    0
  ],
  "sentences": [
    "We then traveled the state’s northern New Castle County and adjacent PA visiting several duPont estates including Pierre's internationally famous \"Longwood Gardens:\" Longwood Gardens We also went to visit the house that Éleuthère Irénée du Pont built for my great-grandfather.",
    "https://longwoodgardens.org/\nExperience the world of Longwood Gardens…a place to see dazzling displays that elevate the art of horticulture …a place to enjoy performances that in…",
    "I just returned home from our drive from S-Central PA to DE, the trip's purpose was to place flowers on my wife’s grave (7/31/20).",
    "Constant Joseph Grandhomme made all the cheese products for the French royalty: duPont the black powder.",
    "Yes, the person who shaped the green fir bushes, still has them shaped to form the name \"TRUMP.\"",
    "Some had anti-Biden signs on them such as \"The Green New Deal is America's off-switch!\"",
    "I will get back in touch with you about the billboard costs, et al.",
    "We went on Barley Mill Road, but did not pass Joe Biden's house.",
    "We visited with the staff at the DE Republican Hdqtrs.",
    "I would not recommend that Donald hold a rally in DE.",
    "and \"I won't donate my salary, I'll donate yours!\"",
    "We gathered the names of some billboard companies.",
    "They were neighbors and best friends in France.",
    "It is 12:50 AM Saturday morning.",
    "They believe DE needs RINOs.",
    "I did not want to vomit.",
    "I was so angry.",
    "Sad, very sad.",
    "Really bad."
  ]
}