{
  "id": 184,
  "mediaId": 8251,
  "date": "2022-02-22",
  "headline": "No, 12 News no impidió que el anuncio de campaña de Kari Lake saliera al aire",
  "image": "https://media.12news.com/assets/KPNX/images/4ed4386e-663a-4fde-81fb-b384fb924026/4ed4386e-663a-4fde-81fb-b384fb924026_1140x641.jpg",
  "link": "https://www.12news.com/article/syndication/spanish/no-12-news-no-censuro-el-anuncio-de-campania-de-kari-lake/75-1a0646de-9b6c-4822-ab93-0fdbc0aa7da5",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Si la estación no corre un anuncio de campaña de un candidato u ofrece la misma oportunidad de comprar tiempo al aire, la Comisión Federal de Comunicaciones (FCC por sus siglas en inglés) puede tomar acción en contra de la licencia de la estación.",
    "Lake después publicó otro tuit diciendo que el anuncio saldría al aire el martes por la noche, aunque nunca puso en contexto el hecho de que su campaña hizo una orden de compra que no especificaba que el anuncio debía correr el lunes por la noche.",
    "Una vez que 12 News permite a un candidato a la gobernatura comprar tiempo al aire, se le requiere a la estación, bajo las regulaciones del FCC, que de la misma oportunidad a los demás candidatos de correr anuncios.",
    "Lake, quien ha trabajado en noticias televisivas por más de 20 años, ya sacó su anuncio de campaña de televisión que alienta a sus televidentes a “apagar” las “noticias corrompidas”.",
    "La expresentadora de noticias sugirió por medio de Twitter que 12 News podría haber violado las reglas federales que obligan a la estación a transmitir anuncios de campañas.",
    "PHOENIX — La candidata a la gobernatura, Kari Lake, afirma que uno de sus anuncios de campaña que debió salir al aire en 12 News durante la programación de la noche.",
    "La empresa encargada de comprar publicidad para Lake, Strategic Media Placement Inc. Compró un comercial en 12 News para la semana del 21 al 27 de febrero.",
    "La orden indica que ese comercial pude correr lunes o martes durante el noticiero de las 10 p.m.\nLa compra se realizó el viernes 18 de febrero.",
    "Archivos del FCC\nNo, la campaña de Lake compró un anuncio político para que corriera al aire el lunes o martes por la noche.",
    "El FCC no permite que las estaciones se nieguen a correr anuncios debido al contenido del anuncio del candidato político.",
    "La candidata a la gobernatura preguntó en Twitter porqué su anuncio de campaña no salió al aire el lunes por la noche.",
    "Lake es uno de los varios candidatos a la nominación republicana para la carrera de la gobernatura del 2022.",
    "¿Fue intencional que el anuncio de campaña de Kari Lake no saliera al aire por 12 News?",
    "Descargue la aplicación 12 News KPNX para recibir notificaciones en español:",
    "Su campaña compró para el lunes o martes."
  ]
}