{
  "id": 1858,
  "mediaId": 2662,
  "date": "2022-02-07",
  "headline": "EXCLUSIVE – ELECTION FRAUD ON VIDEO: Maricopa County Election Workers CAUGHT RED-HANDED Deleting “Archived” Files From Server Before Delivery To Auditors",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/az-footage-.jpg",
  "link": "https://www.thegatewaypundit.com/2022/02/exclusive-election-fraud-video-maricopa-county-election-workers-caught-red-handed-deleting-archived-files-server-delivery-auditors/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    2370,
    2706,
    4066,
    443,
    1394,
    5949,
    6360
  ],
  "sentences": [
    "Maricopa County officials previously admitted to deleting these files in a Congressional hearing but later walked it back, claiming that the files were “archived.”\nTRENDING: VIDEO INTERVIEW: Gateway Pundit and 100% Fed Up to Interview Investigators Catherine Engelbrecht and Gregg Phillips Behind Upcoming “2000 Mules” Movie\nWHAT?",
    "The full forensic audit of Maricopa County concluded hundreds of thousands of ballot discrepancies and elections law violations, including the deletion of election files before providing the machines to auditors.",
    "We reported earlier that Arizona State Representative and candidate for Secretary of state Mark Finchem presented a bombshell resolution to decertify three county elections and reclaim Arizona’s electors.",
    "Today, We The People AZ Alliance released the actual footage from the Maricopa County Tabulation and Election Center server room when these exact files were deleted from the server.",
    "The video evidence of this occurrence was redacted from the public report to maintain confidentiality and protect the individuals who deleted the files.",
    "Shady Maricopa County Official Claims They Had to Secretly Delete Information from Servers Under Subpoena to Make Room for the Next Election?",
    "Contact Arizona Attorney General Mark Brnovich to demand accountability for the criminals who ordered the deletion of elections data.",
    "WATCH:\nhttps://twitter.com/KariLake/status/1490801991169105921\nAnd here is the video by We The People USA Alliance on YouTube.",
    "(Video)\nThe Arizona Attorney General is currently conducting a criminal investigation with the full, unredacted report.",
    "Arizona gubernatorial candidate Kari Lake called for perp walks after seeing this video.",
    "Identities have been blurred to protect the integrity of the ongoing investigation."
  ]
}