{
  "id": 1875,
  "mediaId": 8350,
  "date": "2022-02-04",
  "headline": "Kari Lake says homelessness plan would get people off streets ‘one way or another’",
  "image": "https://ktar.com/wp-content/uploads/2022/01/ap_f8b7507fb4ad4c1b99ac4ab3b0b2b7d3-e1644003805645.jpg",
  "link": "https://ktar.com/story/4872017/kari-lake-says-homelessness-plan-would-get-people-off-streets-one-way-or-another/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KEVIN STONE",
  "authorUrl": "https://ktar.com/story/author/kstone/",
  "termIds": [
    0
  ],
  "sentences": [
    "PHOENIX – Republican Arizona gubernatorial candidate Kari Lake said Thursday her plan to curb homelessness would get “these people off the streets one way or another.”\nLocal governments can’t legally prohibit sleeping on public property — so-called urban camping — unless they provide enough indoor options for the homeless population.",
    "“So my proposal calls for creating a glut of of shelter beds for people, and then we will ban urban camping.”\nAccording to the city of Phoenix Human Services Department data from a year ago, Maricopa County had about 1,800 shelter beds and an estimated 7,500 people experiencing homelessness.",
    "“Sometimes when there’s a problem, an industry is created around it,” she said, “and unfortunately there has been an industry created around homelessness where municipalities and states pour money into solving the problem … but that money just keeps going down the drain with no results.”",
    "“And we’re going to start actually, once we ban urban camping, arresting people who are continuing to cause these blight problems, public lewdness problems, public intoxication problems,” said Lake, the Donald Trump-endorsed former Fox 10 news anchor.",
    "“We’re going to be getting these people off the streets one way or another.”\nDetails of Lake’s homelessness policy are posted on her campaign website.",
    "“They basically said you can’t ban camping on public property unless you have enough shelter beds available to those who want them,” Lake said.",
    "They’re choosing to use drugs and cause problems, and that’s not going fly in Arizona when I’m governor,” Lake said.",
    "“We need to get people help, but a lot of the people on the streets right now … are choosing to be there.",
    "So Lake told KTAR News 92.3 FM’s The Mike Broomhead Show she would first create “a glut” of shelter beds.",
    "Lake said her policy would also take away funds from service organizations that can’t show results.",
    "As it notes, Arizona is subject to a 2018 decision on the matter by the 9th U.S.",
    "Circuit Court of Appeals in a case against the city of Boise, Idaho."
  ]
}