{
  "id": 1888,
  "mediaId": 2578,
  "date": "2022-02-05",
  "headline": "DEATH CULT: Democratic Arizona Senator Lupe Contreras Argues in Hearing That His Four Foster Kids Should Have Been Aborted",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/C6C182B8-9B47-4441-A8CC-54C756BA579E.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/party-genocide-democratic-arizona-senator-lupe-contreras-argues-hearing-four-foster-kids-aborted/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    3868,
    4066,
    2706,
    1394,
    1126,
    1489,
    392,
    5949
  ],
  "sentences": [
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nTrump-endorsed Arizona Gubernatorial Candidate Kari Lake shared this video to expose their evil agenda.",
    "On Friday in the Arizona Senate Judiciary Committee, State Senator Lupe Contreras argued that his own foster kids should have been aborted.",
    "Lake has vowed to sign an executive order banning abortion after six weeks, similar to the Texas Heartbeat Law.",
    "Between @SenContreras & @KatieHobbs, the @azdemparty is rocketing past infanticide towards full-blown eugenics.",
    "Watch this chilling video of this wicked Democrat championing genocide for Arizona’s 30,000 foster Children.",
    "pic.twitter.com/zVXtH251ta\n— Kari Lake for AZ Governor (@KariLake) February 5, 2022\nThese people are sick.",
    "Watch this chilling video of an Arizona Senator champion Genocide for Arizona’s 30,000 Foster Children.",
    "They were kids from parents that probably should have, probably had an abortion.",
    "Contreras made the comments in opposition to Republican abortion legislation.",
    "The bill would put some restrictions on abortions after 15 weeks.",
    "SB1164 passed through the committee along party lines.",
    "Contreras: I have four foster kids at my house.",
    "How absolutely wicked!",
    "It’s a death cult!"
  ]
}