{
  "id": 2107,
  "mediaId": 8476,
  "date": "2022-02-10",
  "headline": "The Daily Agenda: We Have So Many Questions",
  "image": "https://media2.fdncms.com/tucsonweekly/imager/u/slideshow/31952849/screen_shot_2018-09-06_at_2.19.02_pm.png",
  "link": "https://www.tucsonweekly.com/TheRange/archives/2022/02/10/the-daily-agenda-we-have-so-many-questions",
  "mediaOutlet": "tucsonweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Leingang and Hank Stephenson",
  "authorUrl": "https://www.tucsonweekly.com/author/rachel-leingang-and-hank-stephenson",
  "termIds": [
    0
  ],
  "sentences": [
    "Leg Council director Mike Braun told me they’re going to “pray to God it works, because if it doesn’t, if you call this number again, I’m sure you won’t get me.” https://t.co/EAFrRUAOCi\n— Wayne Schutsky (@WayneSchutsky) February 9, 2022\nBack at it again with a bill roundup:\nTeachers say a bill requiring them to put curriculum online and institute parental reviews for certain materials will make their work harder and increase scrutiny.",
    "https://t.co/1dZKa4Xtsg pic.twitter.com/BakeowW1op\n— Jen Fifield (@JenAFifield) February 9, 2022\nSpeed racers no more: Phoenix Police say they’re seeing less street racing in town these days, and their officers spend less time on the problem since they formed a street racing task force and the city passed an ordinance to seize cars used in such racing last year, KJZZ’s Christina Estes reports.",
    "Politico yesterday shed some additional light on those never-enacted executive orders pushed by Michael Flynn and his crew of Arizona audit-funding cronies to have the military seize voting machines, including one fascinating Arizona detail: “Metadata on the document says it was created by a user named Christina Bobb.”\nYes, it seems like it’s that Christina Bobb.",
    "Like finding water in the desert: Part of a massive development 20 years in the making is being built now on state trust land called the Superstition Vistas, but finding enough water to serve the full development, which could be as large as 900,000 people, makes the project and its expansion more difficult, the Republic’s Joshua Bowling reports.",
    "Of course, all that brings into question whether Brnovich can handle the pressure placed upon him from Trump and the GOP base to “put the nunchucks down and pick up the handcuffs and arrest people” for election fraud, as Kari Lake once put it, while trying to impartially investigate the claims in the state Senate’s audit of the 2020 election.",
    "Everyone’s blaming everyone else: A notice of claim filed by three former assistant police chiefs in Phoenix who were demoted alleges that Phoenix Police Chief Jeri Williams lied when she said she wasn’t aware of plans to charge protesters as a street gang, ABC15’s Dave Biscobing reports.",
    "What’s his is yours: Mohave County Supervisor and former best-mustache-in-the-Legislature Ron Gould took his allotment of federal pandemic relief funds and doled them back out to the public in the form of $165 checks, the Associated Press reports.",
    "The website he directs people to, cmz.army, goes even further to clarify his army is not an army: “CMZ ARMY is not associated with, or sponsored by, any national or international government agency or branch of the armed forces in any nation.”",
    "Doug Ducey can use war powers to send troops to the U.S.-Mexico border, and his tweets in solidarity with Canadian truckers who have been illegally shutting down major U.S.-Canada crossings in defiance of that country’s vaccine mandates.",
    "(The Republic had previously noted that former Trump Chief of Staff Mark Meadows attempted to contact Brnovich after the election through a member of Congress, but Brnovich’s office dodged questions about whether they actually spoke.)",
    "?“cats are not citizens.”\nQAnon dude Ron Watkins plays cowboy in a new video about his campaign for Congressional District 2, and if you’ve been an Agenda reader for more than five minutes, you know this is something we love/hate.",
    "https://t.co/9dgmJCeX4p\n— Brahm Resnik (@brahmresnik) February 9, 2022\nThe timing of Brnovich’s White House visit is important to note: Arizona’s fake electors sent their fake documents to Congress four days after that meeting.",
    "Senate candidate Mark Brnovich showing he was, in fact, at the White House on December 10 and 11, 2020, with a crew of Republican attorneys general who had backed a Texas lawsuit seeking to decertify the 2020 election.",
    "Smoke safely: If you’re curious about what the weed you smoke is tested for before you consume it, the Arizona Daily Star’s Edward Celaya walks you through the state requirements for testing on potency and safety.",
    ": Arizona isn’t doing full-on contract tracing of all COVID-19 positives these days because cases are so high and the public’s response to efforts to reach out have declined, KJZZ’s Katherine Davis-Young reports.",
    "Citizenship and Immigration Services will extend the length of time that six types of permits remain valid in order to reduce the number of applications and wait times, the Republic’s Rafael Carranza reports.",
    "Shiva” Ayyadurai, who was also on contract in the Arizona audit and shared easily debunked findings, got the contract, which the actual state auditor is now investigating, the Daily Beast reports.",
    "New details are trickling out as reporters, investigators and prosecutors continue their quest to piece together who was doing what, where and when in the weeks between the election and Jan. 6.",
    "Government at the speed of government: If you’re a regular watcher of the Arizona Legislature, you probably noticed that the Request to Speak system is melting down more than usual this year.",
    "Animal veterinarians explained to the committee how declawing involves more than just cutting a cat’s nails: You have to amputate a piece of their fingers, and it can really mess them up.",
    "Legislative Council, the nonpartisan group that keeps the trains running at the Capitol, plans to repair the system sometime soon, possibly by the time you read today’s newsletter.",
    "It’s a pain for people who want to track bills and register their support or opposition to them because RTS is a critical tool for public engagement in the legislative process.",
    "Meanwhile, Arizona Daily Star columnist Tim Steller penned a scathing piece in which he became the second major newspaper columnist in the state to call on Brnovich to resign.",
    "Prankster who went viral for city council rap about vaccinations (@alexstein99) called in to Phoenix this morning to say a council member is having an affair with his wife.",
    "pic.twitter.com/2gFmjY2ybx\n— 2022 Karma (@2022_Karma) February 9, 2022\nHe helpfully notes in the video that his “army” is nonviolent and made up of grassroots volunteers.",
    "Steller focused on Brnovich’s most recent attempts to use “the power of the position he holds to establish himself as a super-Trump Republican” in the Senate race.",
    "https://t.co/DWD5W6AWUy\n— Tim Steller (@senyorreporter) February 9, 2022\n“If he doesn’t bring an indictment, some Republican voters and interests will punish him.",
    "In a cowboy hat, wearing jeans and a suit jacket, standing in front of a barbed wire fence, Watkins does his best “The Good, the Bad and the Ugly” impression.",
    "Capitol Media Services’ Howie Fischer has all the “gruesome” details, but the highlight is probably Republican Rep. Frank Carroll’s astute declaration that ?",
    "A state committee called the Arizona Power Plant and Line Siting Committee should reject the utility’s plans, Ryan Bentz argues in an op-ed for the Republic.",
    "House Bill 2224, which would make it a crime to declaw a cat, passed the House Government Committee and is heading to the House floor for a vote.",
    "He implores supporters to sign up as volunteers with the “CMZ Army,” presumably a reference to CodeMonkeyZ, Watkins’ handle on several platforms.",
    "New Mexico’s conservative Otero County is paying $50,000 to audit, via door-to-door canvassing, its own election, which Trump won in a landslide.",
    "A crazy thing about the case I made today for @generalbrnovich to resign is all the stuff I had to leave out, but which make the case stronger.",
    "The bill that would’ve required a “harmful content” filter on devices died in committee yesterday (story complete with wretched stock image).",
    "Instead, tracing focuses on schoolchildren and people over age 80 because contact tracing in those populations has a higher impact.",
    "Still two years away: One group is already raring to go for the eventual 2024 Democratic primary against U.S. Sen. Kyrsten Sinema.",
    "?¡Adiós Sinema!” campaign to try to raise money for a Sinema opponent in the 2024 cycle, the Republic’s Javier Arce reports.",
    "Redo it: Critics of a natural gas plant expansion in Coolidge want the Salt River Project to start over with its proposal.",
    "Arizona Sen. Tyler Pace helped stop a bill in committee yesterday that would have banned gender-affirming health care.",
    "Then there’s yesterday’s scoop from the Yellow Sheet Report, which dug up public records from attorney general/U.S.",
    "Is that why he’s not investigating fake electors while he’s chasing the Cyber Ninjas conspiracies down the drain?",
    "For a roundup within this roundup, here’s a rundown of the environmental bills moving through the Legislature.",
    "If you’re one of Gould’s constituents, you’ll be getting an application in the mail to apply for the check.",
    "It’s one of many lawsuits stemming from the fallout of the gang charges and Biscobing’s reporting on them.",
    "Fingers crossed that director Mike Braun gets to keep his job:\nLooks like system is going online now.",
    "OAN’s Christina Bobb was go-between for Guiliani & AZ Senate President Karen Fann, per emails.",
    "Which raises all sorts of questions, like what exactly was Brnovich doing at the White House?",
    "All the best grifters are moving to New Mexico ... From Adios Arpaio to Adios Sinema ...",
    "The group says Sinema’s actions have had a negative effect on the Latino community.",
    "One way to clear a backlog: To manage lengthy waits for work permits, the U.S.",
    "It’s a no-win situation that neither he, nor we as Arizonans, should be in.",
    "of political stories, sign up below to subscribe to our daily newsletter.",
    "If he does, any charges will appear to be political performance.",
    "A voucher expansion bill is trucking along on party lines.",
    "And speaking of the audit, it seems the grift continues.",
    "The solution is for Brnovich to resign,” Steller wrote.",
    "And, of course, how’s that audit investigation coming?",
    "To keep track of all the Arizona angles (so many!)",
    "And of course, there’s always an Arizona angle.",
    "I can’t even take this seriously at this point.",
    "But as usual, Brnovich’s office isn’t talking.",
    "That included his recent opinion that Gov.",
    "What did he speak to the president about?",
    "Also raised money for partisan AZ audit.",
    "She’s also an ASU grad (go Sun Devils!).",
    "Ron Watkins has just posted a new video.",
    "Did Brnovich know that was coming?",
    "It's a nonviolent army, he swears.",
    "Did the fake electors come up?",
    "They let him talk the Full.",
    "Voto Latino started an “?",
    "Also chief propagandist.",
    "Were we ever, though?",
    "Let’s hope!",
    "Minutes.",
    "Three.",
    "“Dr."
  ]
}