{
  "id": 2328,
  "mediaId": 2746,
  "date": "2022-02-08",
  "headline": "Abbott, Biden face off in vaccine wars over National Guard",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/08/BELTWAY_virus_outbreak_54980_c0-208-5000-3124_s1200x700.jpg?74d48b7b24509088c15947da9892024c1a07cb57",
  "link": "https://www.washingtontimes.com/news/2022/feb/8/inside-beltway-greg-abbott-joe-biden-face-vaccine-/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Harper",
  "authorUrl": "https://www.washingtontimes.com/staff/jennifer-harper/",
  "termIds": [
    5078,
    4905,
    4325,
    4327,
    2765,
    2706,
    1453,
    861,
    6653
  ],
  "sentences": [
    "The motto has surfaced in a campaign video released Monday — which affirms that the active U.S. Navy Reserve Officer, business executive, wife and mother of a toddler has the “complete and total endorsement” of Mr. Trump — who called her “strong and impressive.”\nMs. Ortagus, by the way, describes her young daughter Adina as “the light of our lives.”\nFind her campaign at MorganOrtagus.com\nADVICE FROM KARI LAKE\nNow here’s an intriguing thought.",
    "Every single American should be concerned by Big Tech’s manipulation of the free market to exploit consumers, censor conservatives, target children, expand chilling surveillance programs, and selectively limit access to the modern public square,” Heritage Foundation President Kevin Roberts said in a statement.",
    "The conservative think tank has released an authoritative assessment documenting how Big Tech has “weaponized unprecedented power and influence to silence Americans, undermine freedom, and fundamentally reshape American society,” according to advance material shared with Inside the Beltway.",
    "The network’s late-night program “Gutfeld!” earned its highest-rated week of the year so far, pulling in an audience of 2 million viewers and vanquishing ABC’s “Jimmy Kimmel Live!” with 1.5 million viewers and NBC’s “The Tonight Show with Jimmy Fallon” with 1.6 million.",
    "The motion argues that President Biden’s attempt to commandeer Mr. Abbott’s status as commander in chief of the state’s Guard threatens to “undermine his chain of command, blur the lines of accountability, and endanger millions of Texans.”\nIt’s complicated.",
    "Greg Abbott has asked the U.S. District Court for the Eastern District of Texas to issue a preliminary injunction motion protecting nonfederalized members of the Texas National Guard from the Biden administration’s COVID-19 vaccine mandate.",
    "These powerful corporations’ undeniable service to leftist ideology eerily mirrors oppressive behavior by totalitarian governments to silence opposition and relegate those with whom they disagree to second-class citizens.",
    "She’ll fight for Tennessee.”\nThis is the new campaign motto of Morgan Ortagus, a former State Department spokeswoman in the Trump administration, now running for Congress in Tennessee’s 5th Congressional District.",
    "The aforementioned motion explains that because Mr. Biden has not formally federalized the Texas National Guard, he has no constitutional or statutory authority to control, punish, or discharge its members.",
    "POLL DU JOUR\n• 21% of U.S. adults say the nation should open up and get back to life as usual with no coronavirus mandates or requirements; 43% of Republicans, 20% of independents and 3% of Democrats agree.",
    "“It’s going to take all of us to fight back against Big Tech and ensure these companies are held to account for their unchecked, flagrant abuses of power and undermining of the common good,” he said.",
    "• 29% overall say the nation should “move towards opening up” during the coronavirus pandemic, but still take some precautions; 29% of Republicans, 32% of independents and 25% of Democrats agree.",
    "• 23% overall say we should mostly keep coronavirus precautions and requirements in place; 14% of Republicans, 23% of independents and 34% of Democrats agree.",
    "“President Biden must be held accountable for his unconscionable willingness to hollow out the Texas National Guard with another illegal vaccine mandate.",
    "The Heritage Foundation says yes, you should absolutely worry about those gargantuan providers of internet access, social media and online commerce.",
    "1 network across the entire cable realm with an average 2.5 million primetime viewers — and airing 75 of the top 100 cable telecasts for the week.",
    "• 21% overall say we should increase masks mandates and vaccine requirements; 7% of Republicans, 21% of independents and 32% of Democrats agree.",
    "Our Founding Fathers never envisioned career politicians in office — they envisioned citizen politicians — like Ronald Reagan and Donald Trump.",
    "A Fox News standout is “Jesse Watters Primetime,” which has drawn an average 3.1 million viewers since debuting on the network two weeks ago.",
    "The report, titled “Combating Big Tech’s Totalitarianism: A Road Map,” lays out a roadmap of the reforms necessary to counter this trend.",
    "Mr. Abbott has issued a straightforward order to his chain of command not to punish those Guardsmen who have opted out of the vaccine.",
    "Our government belongs to us.”\nSo says Kari Lake, a Republican now running for governor of Arizona, in a tweet on Tuesday.",
    "As the commander-in-chief of Texas’ militia, I will deploy every legal tool in defense of these American heroes,” he said.",
    "“The Five” was the most watched program, with 3.7 million viewers, followed by “Tucker Carlson Tonight” (3.6 million).",
    "“The Governor of Texas does not take orders from the President of the United States,” Mr. Abbott said in a statement.",
    "In contrast, cable news rivals MSNBC and CNN attracted audiences of 1.2 million and 555,000, respectively.",
    "This marks the 25th consecutive week in which Fox News drew a larger audience than CNN and MSNBC combined.",
    "• 6% don’t know what we should do; 6% of Republicans, 4% of independents and 6% of Democrats agree.",
    "A HAIR-RAISING ROADMAP\nSo should you worry about the ever-growing influence of Big Tech on America?",
    "SOURCE: An Axios/Ipsos Coronavirus Index poll of 1,049 U.S. adults conducted Feb. 4-7.",
    "“I want to see more cowboys, cops, veterans, farmers and moms running for office.",
    "NEWS AND OPINION:\nThe vaccine battleground has extended into the Lone Star State.",
    "MORGAN’S MOTTO OF THE DAY\n“She fought for President Trump.",
    "• Follow Jennifer Harper on Twitter @HarperBulletin.",
    "Find the complete report at Heritage.org/technology.",
    "“Big Tech is the enemy of the people.",
    "Find her campaign at KariLake.com.",
    "FOXIFIED\nFox News was the No.",
    "This country belongs to us!",
    "Curious — or uneasy?",
    "Texas Gov."
  ]
}