{
  "id": 2454,
  "mediaId": 2593,
  "date": "2022-02-04",
  "headline": "ABC Reporter Tries Gotcha Question on Kari Lake, So She Flips the Script in Brutal Take Down of MSM",
  "image": "https://ijr.com/wp-content/uploads/2022/02/Kari-Lake-interview-screen-shot.jpg",
  "link": "https://ijr.com/abc-reporter-tries-gotcha-question-kari-lake-flips-script/",
  "mediaOutlet": "IJR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Randy DeSoto",
  "authorUrl": "https://ijr.com/author/wj/ ",
  "termIds": [
    0
  ],
  "sentences": [
    "In the trailer, D’Souza says, “We tracked 2,000 mules making multiple ballot drops, leaving no fingerprints, snapping photos to get paid, a coordinated ring of illegal vote harvesting in all the key states where the election was decided.”\n“There is no evidence of widespread voter fraud.”\n— Liz Harrington (@realLizUSA) January 30, 2022\nThe trailer highlights the states of Arizona, Wisconsin, Michigan, Pennsylvania and Georgia places where this alleged illegal conduct occurred.",
    "“I find it frankly laughable to suggest that a county in response to a subpoena could say, ‘We will delete files from the hard drives and materials that we give to the auditors because we have those files archived on data that we did not give to the auditors,’ when the subpoena said, ‘Turn over all the records related to the election,’” Bennett said.",
    "Senate President Karen Fann’s letter to Arizona Attorney General Mark Brnovich, concerning the Maricopa County Forensic Audit pic.twitter.com/TYOb1zRiEr\n— Republican Party of Arizona (@AZGOP) September 25, 2021\nFann added that the county also failed to provide “documentation sufficient to reconcile duplicated ballots to corresponding original” ones.",
    "“True the Vote’s complaint offered Raffensperger’s office access to what are characterized as detailed phone records and surveillance video it said would show as many as 242 people repeatedly made trips to the drop boxes to deliver ballots in what it described as a mass ‘ballot trafficking operation,’” Just the News reported.",
    "The group said it had “assembled evidence that scores of activists worked with nonprofit groups to collect and deliver thousands of absentee ballots, often during wee-hour operations, to temporary voting drop boxes distributed around the state during the pandemic,” Just the News reported.",
    "In a document released following the audit, Maricopa County responded, saying the duplicate ballot envelopes the auditors discovered were actually multiple scans of the same envelopes, which occurs when a voter “cures” issues — such as the envelope lacking a signature.",
    "Further, Arizona Senate President Karen Fann highlighted in a September letter to the state’s Attorney General Mark Brnovich that the auditors found that Maricopa County overwrote the Election Management System’s security logs showing activity on the server.",
    "Lake first responded to the ABC News reporter’s Biden inquiry saying, “Well, he’s obviously sitting in the White House.”\nThe reporter followed up by asking if Lake believes the election was stolen — is Biden really the legitimate president?",
    "Meanwhile, Georgia Secretary of State Brad Raffensperger confirmed last month that his office was investigating allegations that large-scale illegal ballot harvesting took place during the 2020 general election in his state.",
    "Ballot harvesting is illegal under Georgia law, which requires absentee ballots to be either mailed in or personally delivered unless the voter is disabled, in which case a family or household member can deliver the ballot.",
    "The auditors raised concerns about the existence of 34,448 duplicate ballot envelopes from 17,126 unique voters, raising the specter that approximately 17,000 voters may have cast two or more ballots.",
    "Lake knew this full-well, having been an anchor for the Fox affiliate KSAZ-TV in Phoenix for over 20 years before leaving last year out of frustration with the biased direction the outlet had taken.",
    "An ABC News reporter sought to corner Arizona gubernatorial candidate Kari Lake with one of the left’s favorite gotcha questions for Republicans: Do you think Joe Biden is the legitimate president?",
    "At a rally former President Donald Trump held outside of Phoenix last month, Lake called the 2020 race “rotten to its core,” adding, “You don’t steal our vote” and just expect people to accept it.",
    "“This was accomplished by churning more than 37,000 identical queries several days after the court ordered Maricopa County to produce the election materials to the Arizona Senate,” she wrote.",
    "pic.twitter.com/KnDC2jHXVB\n— Kari Lake for AZ Governor (@KariLake) February 3, 2022\nLake turned the tables on the ABC reporter, asking, “Do you think that Joe Biden garnered 81 million votes?",
    "They’re not reporting on these ballot traffickers that are being paid to drop off ballots.”\nThe Maricopa County, Arizona, audit team delivered its report to the state Senate in September.",
    "The county explained the churning of the logs was part of “standard archival steps” and preparation for a March 2021 local election and was in compliance with the Senate’s subpoena.",
    "True the Vote, which worked with D’Souza for the film, says on its website that in addition to Georgia, it will be releasing “shockingly similar findings” in five other states.",
    "Having worked as press secretary for multiple U.S. Senate candidates, I admire both Lake’s handling of the question and her media team for separately videoing the exchange.",
    "During a U.S. House hearing in October, Arizona Rep. Andy Biggs pressed Maricopa County officials over their failure to turn over all the materials sought by auditors.",
    "The interview was clearly not a live shot, meaning the reporter would have been able to cut footage to tell the story she wanted to portray about the candidate.",
    "Maricopa County bro 2: Uh…\n— Cernovich (@Cernovich) October 8, 2021\n“OK, so you didn’t feel obligated to turn that over, then?” the congressman queried.",
    "Some of the video apparently will be featured in conservative filmmaker Dinesh D’Souza’s upcoming documentary “2,000 Mules,” due out this spring.",
    "During the ABC News interview, Lake predicted that the American people will eventually get the full story of what happened in the 2020 election.",
    "True the Vote reportedly obtained access to some of the video footage through an open records request when it began its investigation.",
    "Biggs confirmed with Maricopa Board of Supervisors member Bill Gates that the archived files were not turned over to the audit team.",
    "Biggs then turned to Senate audit liaison and former Arizona Secretary of State Ken Bennett for his reaction to Gates’ explanation.",
    "She noted that outlets like ABC, CNN and MSNBC spun the false narrative that Trump colluded with Russia to steal the election.",
    "“The problem is that the American people don’t have all the answers because the media is part of the problem,” Lake continued.",
    "Duplicate ballots are those created by election officials when the originals are unreadable by the ballot counting machines.",
    "The county said many election database files had been archived and not specifically requested in the Senate’s subpoenas.",
    "(This does not mean that any of these votes was counted twice, but experts suggested it be investigated further.)",
    "We need an honest assessment of what happened in 2020, so the needed changes can be made to prevent fraud.",
    "Georgia law required the drop boxes to be under 24-hour video surveillance, according to Raffensperger.",
    "“When you’re lying to the people and you’re in media, that’s a bad business model.”\nBravo!",
    "The investigation came in response to complaints filed by True the Vote in November.",
    "Rep Biggs: You tweeted out that you deleted the 2020 files as is standard practice.",
    "I did an interview with @ABC… will they include this portion of it in their piece?",
    "By the official count, Biden won the Grand Canyon State in 2020 by 10,457 votes.",
    "They continue to try and stump me, but I know their game better than they do.",
    "We have evidence of corruption in our election, and they refuse to cover it.",
    "According to the county, nearly 28,000 ballots were sent for duplication.",
    "They refuse to be honest with the people of this country,” Lake said.",
    "We are committed to truth and accuracy in all of our journalism.",
    "That is correct,” Gates said, drawing a chuckle from Biggs.",
    "This article appeared originally on The Western Journal.",
    "Only one ballot is counted per voter, the county said.",
    "Why won’t they just do their job and report the truth?",
    "They’re not reporting what’s happening in Georgia.",
    "Media’s never reported our forensic audit fairly.",
    "“We responded to the subpoena,” Gates reiterated.",
    "WATCH: The Media just won’t learn their lesson.",
    "Now that you’re under oath, will you say that?",
    "Do you think the elections were fair?",
    "“And now they’re doing the opposite.",
    "We don’t have that answer for you.",
    "“They did not subpoena those.",
    "Read our editorial standards.",
    "Maricopa County bro 1: Uh….",
    "“Media’s not reporting it.",
    "Biggs: What you you?"
  ]
}