{
  "id": 2581,
  "mediaId": 8251,
  "date": "2022-02-07",
  "headline": "Brnovich dice que Arizona tiene derecho de defenderse en contra de una ‘invasión’ fronteriza",
  "image": "https://media.12news.com/assets/KPNX/images/9a791794-c540-4bce-940b-567ad2568708/9a791794-c540-4bce-940b-567ad2568708_1140x641.jpg",
  "link": "https://www.12news.com/article/news/regional/la-frontera/procurador-dice-que-arizona-tiene-derecho-de-defenderse-en-contra-de-invasion-fronteriza/75-d8d036a1-cd7b-45c8-8d6c-e59bb743c4c8",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“…cualquier tipo de uso de fuerza defensiva para proteger al estado en contra de una invasión también debe consistir con las leyes federales y se tiene que prestar atención particularmente a la relación del estado con las tribus nativo-americanas con reservaciones en la frontera Arizona-México”, opina el procurador.",
    "https://t.co/VqOCI9qGHk\n— Mark Brnovich (@GeneralBrnovich) February 7, 2022\nBrnovich le escribió al gobernador para determinar el tipo de fuerza defensiva que deben usar y el gobernador debe tomar en consideración otras partes interesadas localizadas en Arizona quienes se verían afectadas.",
    "TODAY our office issued a legal opinion determining the current crisis at Arizona’s southern border, fueled by violence and lawlessness of cartels & gangs, legally qualifies as an “invasion” under the U.S. Constitution, & AZ has the power to defend itself.",
    "El Procurador General de Arizona, quien correrá para un puesto en el senado, cree que Arizona se encuentra bajo invasión y tiene el derecho de defenderse\nPHOENIX — Nota del editor: El video de arriba es de un noticiero previo.",
    "La candidata a la gobernatura, Kari Lake, una republicana, prometa declaras una invasión, si es elegida, para así poder defenderse de la invasión en la frontera sur en ausencia de protección federal”, según su sitio web.",
    "El Procurador General de Arizona, Mark Brnovich, cree que el estado se encuentra bajo invasión y tiene derecho legal de usar la fuerza en contra de los “cárteles y pandillas multinacionales” que operan en la frontera.",
    "Brnovich, quien esta corriendo para el puesto en el Senado federal, cree que la actividad reciente en la frontera de Arizona y México le permitiría al gobernador Doug Ducey constitucionalmente tomar acción.",
    "El gobierno federal generalmente tiene la autoridad para declara guerra o iniciar fuerza en contra de un enemigo, pero Brnovich piensa que Arizona están en posición de tomar acción.",
    "El problema viene de la complejidad de la Constitución de Estados Unidos y si los estados individuales tienen soberanía para involucrarse en un conflicto con poderes foráneos.",
    "Una cláusula de la constitución da a los estados la habilidad de involucrarse en una guerra sin el consentimiento del Congreso si están siendo “invadidos actualmente”.",
    "El problema constitucional de la seguridad fronteriza se ha convertido en problema de política entre los candidatos que esperan remplazar a Ducey en el 2023.",
    "“Una invasión actual permite al estado tomar acción defensiva dentro de su propio territorio en o cerca de su frontera”, dice la opinión del procurador.",
    "“La falla del gobierno federal en asegurar la frontera y proteger a Arizona de una invasión es peligrosa y sin precedente”, opinó Brnovich.",
    "Descargue la aplicación 12 News KPNX para recibir notificaciones en español:"
  ]
}