{
  "id": 2917,
  "mediaId": 8476,
  "date": "2022-01-31",
  "headline": "The Daily Agenda: Florida Man Shows Up in Arizona Court",
  "image": "https://media2.fdncms.com/tucsonweekly/imager/u/slideshow/31907868/111806541_l.jpg",
  "link": "https://www.tucsonweekly.com/TheRange/archives/2022/01/31/the-daily-agenda-florida-man-shows-up-in-arizona-court",
  "mediaOutlet": "tucsonweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Leingang and Hank Stephenson",
  "authorUrl": "https://www.tucsonweekly.com/author/rachel-leingang-and-hank-stephenson",
  "termIds": [
    5160,
    4905,
    3669,
    3758,
    3401,
    102,
    5949,
    6406
  ],
  "sentences": [
    "A bill that would expand the study of missing and murdered indigenous women to people of all genders\nOne that would put more information about discipline against massage therapists online\nA proposal that would require government employees, like teachers, to out LGBTQ+ kids to their families\nMore lawmakers please, says one lawmaker\nHypocrisy, thy name is #azleg\nA Democratic proposal actually getting some bipartisan support for low-income tax credits\nThere are a lot of \"someone introduced a bill in a state legislature\" tweets that don't convey very much information about the bill's actual level of support.",
    "The New York Congresswoman said she would support U.S. Rep. Ruben Gallego over Sinema in a head-to-head battle, and it’d be “the easiest decision I would ever have to make.”\nThe Global Wildcats: The University of Arizona will fully absorb its Global Campus offshoot into the university instead of having it as a separate entity after the U.S. Department of Education said the Global brand could lose federal aid, the Arizona Daily Star’s Kathryn Palmer reports.",
    "Meet @KariLake:\n- Leading AZ Republican candidate for governor\n- Enemy of democracy\nWatch the ad during the Suns/Nets game on Tuesday, February 1. pic.twitter.com/5ilJ0S1Bfv\n— The Republican Accountability Project (@AccountableGOP) January 27, 2022\nElsewhere on the airwaves: The National Republican Congressional Committee put out a new ad attacking U.S. Rep. Tom O’Halleran over inflation.",
    "File enough lawsuits and you’ll eventually win one: U.S. District Judge (and former Ducey staffer) Michael Liburdi ruled against the Biden administration on a case brought by Arizona Attorney General Mark Brnovich over vaccine mandates for federal contractors, echoing federal rulings in other states, Capitol Media Services Howie Fischer reports.",
    "We’re sure he’ll resign because you tweeted about it, Doug: Border agents who met with Homeland Security Secretary Alejandro Mayorkas in Yuma last week shared their beefs with the Biden administration’s handling of the border, which prompted Ducey to call for Mayorkas’ resignation, the Republic’s Clara Migoya reports.",
    "https://t.co/BvVRj7EzX9 pic.twitter.com/1lZ4zX6VrP\n— Jen Fifield (@JenAFifield) January 28, 2022\nWant to stay up to date on the Arizona legislative session, federal news that affects Arizona, statewide issues and some city-level happenings, all in one place, without getting bored?",
    "(1/3)https://t.co/SuR3Lxkoib\n— Will Humble (@willhumble_az) January 26, 2022\nWe’ve said it before, we’ll say it again: Making fun of people for misspelling or mispronouncing words is a dick move (and we say that as people who regularly make typos in our daily newsletter).",
    "Our list of backlogs is even backlogged: A backlog of toxicology cases at the Department of Public Safety’s crime lab and some poor communication led to delayed justice for the families of three teens who died in a crash in Glendale, ABC15’s Zach Crenshaw reports.",
    "Two Arizonans were among a list of 14 people across seven states who were subpoenaed by the Congressional committee investigating the Jan. 6 insurrection at the U.S. Capitol for signing on to slates of fake electors saying Trump won their states instead of Biden.",
    "YIMBY all day every day: A newly formed advocacy group of business leaders called Home Arizona wants more affordable housing and less backlash from people who don’t want affordable housing near their homes, the Republic’s Catherine Reagor reports.",
    "Nobody tell John Kavanagh: Around 60 female refugees who fled Afghanistan now are studying at Arizona State University, starting with classes to work on their English before taking more courses, the State Press’ Morgan Fischer reports.",
    "On Mike Broomhead’s show, he said the Biden administration has told him to “pound sand” on most issues (and vice versa), so people with concerns about the fake electors should address them to the Department of Justice instead of him.",
    "— Matthew Yglesias (@mattyglesias) January 28, 2022\nIt’s getting hot(ter) in here: The Guardian figured out that Phoenix is very hot in the summers and spoke with the city’s new “heat tsar” David Hondula about ways to mitigate heat.",
    "Eating their own: An anti-Trump GOP group known for negative ads about far-right candidates set its sights on Kari Lake with an ad noting her false claims about election fraud and interest in overturning the 2020 election results.",
    "But the desalination: Conservative columnist Robert Robb says Ducey should throw the $1 billion he wants for unspecified water projects at the unfunded pension debt that plagues all levels of Arizona government instead.",
    "Arizona Daily Star columnist Tim Steller pointed it out, and Republic columnist Laurie Roberts boosted it, prompting Lamon to actually respond, pivoting himself back to the actual points he was trying to make.",
    "Elections already have checks and balances, but because of the intense falsehoods around the 2020 elections, some kind of additional post-election checks will probably become the norm going forward.",
    "#Arizona would have been better off for most of 2021 if @dougducey, @drcarachrist, & Herrington had ZERO public health emergency authority - they've been abusing it to harm, not help, the response.",
    "Republic reporter Maritza Dominguez got some details about what former city manager Charles Montoya did to get fired, like irregular tuition and vehicle reimbursement and not living in the city.",
    "We encourage them to cooperate with the Select Committee's investigation to get answers about January 6th for the American people and help ensure nothing like that day ever happens again.\"",
    "As with a lot of pressing problems, we already know the things we need to help with heat — like shade trees and less concrete — but there’s little political will to do anything about it.",
    "— U.S. Rep. Bennie Thompson, chairman of the Jan. 6 committee\nBut don’t expect Arizona Attorney General Mark Brnovich to get involved in the fake electors issue, unlike the Michigan AG.",
    "He put three technology experts in place to look into the issue of whether ballot tabulation machines were connected to the Internet and gave them a detailed list of questions.",
    "He wants a “clear” ruling that he can then appeal to a higher court, apparently something clearer than one telling him to turn over records or face $50,000 in daily fines.",
    "(OK, we’ll stop doing this, it’s only funny once, maybe twice, that this all is conveyed via a game of telephone because the deposition wasn’t open to the general public.)",
    "Other signees included Arizona Rep. Jake Hoffman and candidates for public office Jim Lamon and Anthony Kern, as well as Arizona GOP Chair Kelli Ward and her husband.",
    "The Jan. 6 Arizona ties keep growing … The number of bills filed by the Arizona Legislature does, too … And we're going to act like we've never committed a typo.",
    "Help us with … something: The Avondale City Council wants Brnovich’s office to look into some undefined issues about its city manager, who was fired in December.",
    "But sometimes, these misspellings point to larger issues, like a campaign that might not know its cities or state very well, or a campaign run by out-of-towners.",
    "It’s the latest move the university has made with the beleaguered former Ashford University project, which has angered faculty since its announcement in 2020.",
    "pic.twitter.com/s5utcx53wG\n— Tim Steller (@senyorreporter) January 30, 2022\nLike U.S. Senate candidate Jim Lamon misspelling Tucson twice in one tweet.",
    "And in case you forgot, former Congressman John Shadegg snagged that new highly paid job as special master, and now he’s done some special master-ing.",
    "\"We believe the individuals we have subpoenaed today have information about how these so-called alternate electors met and who was behind that scheme.",
    "Still, if you’re starting to think this audit business is all behind us and you’ll have something else to talk about someday soon, you’d be mistaken.",
    "But Liburdi said Brnovich didn’t have the authority to sue over a similar mandate for federal workers because he didn’t have standing on that part.",
    "Republican Sen. Michelle Ugenti-Rita’s Senate Bill 1009 would cap public health emergencies at 120 days unless the Legislature agrees to extend it.",
    "Similar language made it into last year’s budget, but the Battle of the BRBs struck down that portion (and many others) of several budget bills.",
    "In other pandemic news: If you changed your name and need to update your vaccine card, you can, but it’ll cost you some bureaucracy-navigating.",
    "And Maricopa County is using some of that sweet federal cheddar on a new program that puts nursing students into clinical experiences earlier.",
    "He’s still not turning over records, he told the judge at a deposition last week, according to the Republic’s attorney who told the Republic.",
    ": Potential primary challengers to U.S. Sen. Kyrsten Sinema can count Democratic firebrand Alexandria Ocasio-Cortez among their supporters.",
    "Most importantly, his name is Mr. Goodbar: A Mexican gray wolf known for his border adventures was shot in the leg (presumably by a human).",
    "War, armies, phalanxes: If there’s a topic that doesn’t warrant a whole smattering of militaristic metaphors, it is government regulation.",
    "Members of Congress want to talk to Republicans Nancy Cottle and Lorraine Pellegrino, which the fake slate listed as chair and secretary.",
    "And the Democratic Congressional Campaign Committee added U.S. Rep. Greg Stanton to its list of vulnerable members after redistricting.",
    "Surprising no one: Arizona Sen. Wendy Rogers topped the national list of extremist politicians put out by the Anti-Defamation League.",
    "The Arizona Supreme Court will conference about the audit records on Feb. 15 and issued a temporary stay until that can happen.",
    "It looks like Arizona Senate President Karen Fann can take a breather until mid-February about some of the unreleased records.",
    "And speaking of the election that happened two calendar years ago, Cyber Ninjas owner Doug Logan finally showed up in court.",
    "Unlike many of the bills we’ve highlighted here, SB1009 doesn’t face long odds or grab headlines for its outlandishness.",
    "Her response to the top dishonor was predictably gross, though she later admitted she basically has no power anyway.",
    "Attorneys got a partial answer out of Cyber Ninjas' CEO Doug Logan: Ask the guy that took the data there, not me.",
    "But the records aren’t at risk and are all backed up, he said, according to the lawyer who told the Republic.",
    "I get about the AZ election review is what happened to the election data the guy took to the Montana cabin.",
    "An effort to curb the emergency powers that Arizona governors get is back in the Legislature this session.",
    "But maybe they’ll be better ones — or at least the people who accept the 2020 election results hope so.",
    "Bills, bills, bills: Lots of stories about bills these days, of course, so let’s just round them up.",
    "The case shows how backlogs at labs beyond just DPS have effects on people waiting for resolutions.",
    "He hopes the issue should be investigated in a month, he told the Republic’s Mary Jo Pitzl.",
    "He’s instead relying on his longtime friend, the federal government, to sort out the issue.",
    "It is, at best, uncharitable to tease a regular person in real life for such an error.",
    "It’s not quite a “Yosemite” level error, but it’s a classic thorn for Tucson locals.",
    "And, as you know by now, we have no qualms about making fun of politicians ever.",
    "This is that issue where you hear the phrase “Splunk logs,” which is fun to say.",
    "They’re proposing ideas like ballot images and additional independent reviews.",
    "The bill already cleared the Senate Government Committee on a party-line vote.",
    "Sign up below to get the Arizona Agenda in your email Monday through Friday.",
    "Spelling “Tucson” right is the first step toward winning it, @jim_lamon .",
    "Ducey has kept Arizona under a public health emergency since March 2020.",
    "The ad will run during a basketball game on Feb. 1, the group said.",
    "The bill conveniently begins this new practice in 2023, after Gov.",
    "Initial emergencies would come only in 30-day increments.",
    "We’re probably going to have more audits in the future.",
    "He’s expected to survive and go back to the wild.",
    "What will Ruben wear to the 2024 Met Gala?",
    "The bar is so low, it’s on the floor.",
    "Have we got the newsletter for you!",
    "And it has some unexpected support.",
    "Do we all have better things to do?",
    "The most common outstanding ?",
    "Doug Ducey leaves office.",
    "Almost certainly.",
    "(It’s this one.)",
    "??"
  ]
}