{
  "id": 2952,
  "mediaId": 8476,
  "date": "2022-02-03",
  "headline": "The Daily Agenda: We're Naive Enough To Be Optimistic",
  "image": "https://media2.fdncms.com/tucsonweekly/imager/u/slideshow/31921369/151605499_m.jpg",
  "link": "https://www.tucsonweekly.com/TheRange/archives/2022/02/03/the-daily-agenda-were-naive-enough-to-be-optimistic",
  "mediaOutlet": "tucsonweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Leingang and Hank Stephenson",
  "authorUrl": "https://www.tucsonweekly.com/author/rachel-leingang-and-hank-stephenson",
  "termIds": [
    5057,
    2706,
    3922,
    5046,
    102,
    392,
    5949,
    6515
  ],
  "sentences": [
    "A bill that would require more technical expertise and qualifications for Arizona Corporation Commission candidates\nA set of bills that conservative Republic columnist Robert Robb thinks will make work even less tolerable for teachers\nMore types of hazing could be considered crimes under this bill\nBasketballer Steve Nash opposes the bill that would require teachers to out their LGBTQ students\nThe pandemic grift: A company from Illinois that ran COVID-19 testing centers in the Valley closed down some of its sites after the company’s owners allegedly bought a bunch of luxury items and didn’t do a great job at actually testing for COVID-19, the Republic’s Rebekah Sanders and Grace Hauck report.",
    "Funny/not funny: While we were chuckling at House Speaker Rusty Bowers assigning Stop the Steal legislation to a dozen committees, one source noted that while the bill certainly can’t run the gauntlet of every House committee, the move opens the opportunity for a dozen committee chairs the opportunity to create their own circus by putting it up for a vote.",
    "THANK YOU to the House Clerk's Office and their IT pros for creating this list of the bills that have been assigned to an unusually high number of House committees since 1991. pic.twitter.com/2FBpMpV4GU\n— ItalicizedConsulting (@ItalicizedAZ) February 2, 2022\nSomething Arizona Sen. Kelly Townsend doesn’t believe in: Seceding from the United States.",
    "Politico yesterday broke the story that the January 6 Committee has subpoenaed phone records from AZGOP Chair Kelli Ward and her husband, accused eye-spitter Michael Ward, seeking details on their attempts to drum up fake electors to sign documents falsely claiming Donald Trump won Arizona.",
    "The bill offers both a Republican and Democratic approach to the problem by imposing a host of rules cramping cities’ abilities to regulate residential housing, while offering a generational investment in the Arizona Housing Trust Fund, which helps promote affordable housing development.",
    "@CodyLillich and I analyzed real estate data and found something else nobody’s talking about.#azfamily #Rent #inflation https://t.co/Stfhlh7m82\n— Morgan Loew (@morganloewcbs5) February 2, 2022\nIt’s all, in short, a mess — the kind that both parties know affects their constituents.",
    "We’re in this position now because of a heap of problems: investors buying up homes to flip or turn into short-term rentals, an in-demand market that brings in more people than it can house, stagnant wages set by bosses that still see Phoenix as a cheap city.",
    "The Arizona Legislature could, maybe, finally act on Arizona’s affordable housing crisis with a bipartisan compromise bill from Arizona Reps. Steve Kaiser and César Chávez that attempts to peel back some barriers to affordable housing.",
    "In a broad sense, the state has mostly stayed out of housing beyond some specific laws that restrict cities from regulating the price of rental homes and some lackluster funding for affordable or emergency housing projects.",
    "Another tough job: KJZZ’s Kathy Ritchie goes inside long-term care facilities to understand how these homes, which were the deadliest places for COVID-19 especially early on, are coping now, two years into the pandemic.",
    "As we reported at the time, Adel didn’t willingly tell the public about her struggles with addiction, and she asked for people’s understanding while her office didn’t often provide it to the people it prosecutes.",
    "(@NolanWilliamsAZ) February 2, 2022\nLet’s repeat this whole news cycle: People who work with Maricopa County Attorney Allister Adel question whether she is still sober, months after her time in rehab facilities.",
    "So we see one-off initiatives like the Tempe one we mentioned yesterday, and efforts by the City of Phoenix to entice landlords to rent to low-income tenants by giving them some additional money.",
    "But now, county leaders like Maricopa Board of Supervisors Chairman Bill Gates say she’s missing from meetings and not involved on major legal issues, the Republic’s Robert Anglen reports.",
    "Doug Ducey has signaled his support in previous years for reducing the training hours for these positions, and reducing occupational licenses in general is a pet area for the governor.",
    "House Bill 2674 declares housing affordability as a “matter of statewide concern,” which is legislative-speak for preempting local entities from regulating in ways that defy the state.",
    "Some lawmakers want to find a path to address the problem, and other wannabe-politicians like Kari Lake create “housing” plans that are nothing more than criminalizing homelessness.",
    "Ward, who is perhaps Arizona’s most vociferous wannabe politician, has so far been silent about the subpoenas, which is a welcome reprieve that we don’t expect will last for long.",
    "But don’t expect any investigations just yet: In a different part of Smith’s media tour, he told the Republic the office wouldn’t start any investigations for another six months.",
    "If, like us, you survived the Blow-Drying Wars of 2019 (preceded by the Haircut Wars of 2017), you see the word “cosmetologists” in a bill’s short title and reflexively recoil.",
    "Expect a full @YIMBYTempe writeup of the bill, but highlights include\n-Upzoning\n-Faster permitting\n-No arbitrary design control https://t.co/GQ6QG2YKD6\n— Nolan Williams ??????",
    "A fitting legacy: Veterans and Gold Star families will be able to go to national parks for free now that the Alexander Lofgren Veterans in Parks Act has been signed into law.",
    "At first brush, anything that further restricts cities — something our Legislature does as a pastime — will encounter criticism from the left and from local entities.",
    "Besides the usual losing arguments questioning the legitimacy of the committee, she’s arguing that data will contain privileged information about her patients.",
    "So far, the bill got strong support from the Arizona Multihousing Association and the Home Builders Association of Central Arizona, which isn’t surprising.",
    "And unfortunately for Ward, she’s being represented by Alex Kolodin, who is such a skilled lawyer that the Cyber Ninjas fired him nearly without notice.",
    "If your rent went up and you couldn’t afford to move, or if you had to move but only found more expensive places, email us at rachel@arizonaagenda.com.",
    "Some Democrats are already grumbling about taking away power from cities, and Kaiser described it as a “caucus cutter” at a press conference yesterday.",
    "Also, the case was assigned to federal District Court Judge Susan Brnovich — yeah, AG Mark Brnovich’s wife — who couldn’t recuse herself fast enough.",
    "Also, she got COVID-19 in January, and “missed a few key meetings that I would have liked to attend in person.”\n\"I said to her, 'I've got concerns.",
    "Tough job: Get to know the City of Phoenix’s new director of the Office of Accountability and Transparency, Roger Smith, in this KTAR interview.",
    "And the federal COVID-19 relief packages infused some money into local rental markets, but didn’t remove barriers to accessing that money.",
    "But so far, HB2399 has been held on the House Commerce Committee’s schedule, the only committee (aside from Rules) where it’s assigned.",
    "Lofgren, who was a veteran and congressional staffer to U.S. Rep. Raúl Grijalva, died last year in Death Valley during a hiking trip.",
    "But if an eventual housing bill like this constitutes a true bipartisan compromise, everyone will find something to hate about it.",
    "While some policies, like rent control, are a complete non-starter in the Republican-led Legislature, this at least has a chance.",
    "We expect to see pushback and more compromises if the Legislature actually intends to help on the housing affordability crisis.",
    "If you don’t subscribe for the low price of $80 per year, Rogers will be dancing on the grave of this publication someday soon.",
    "The office is tasked for police oversight work like investigating complaints about officer misconduct and in-custody deaths.",
    "How to find the things you need: If you need N95 masks for free, the Republic has a list of where to find them around town.",
    "The lack of state action has left cities and towns to manage the affordable housing crisis in whatever manner they see fit.",
    "First off, Ward is suing to block T-Mobile from turning over her cell phone records, claiming that because she’s a doctor.",
    "You can expect members of both parties, cities, housing advocates, landlords and renters to try to put their mark on it.",
    "PBS Newshour’s Casey Kuhn will move to Washington D.C. to continue working with the show as a digital video producer.",
    "If it passes in it's current form, rent costs in Arizona will plummet and housing availability will soar.",
    "AZ Law has copies of Ward’s lawsuit attempting to quash the subpoena, which provide even more laughs.",
    "It’s not just the housing shortage that is causing Phoenix’s huge rise in rent and home sale prices.",
    "The bill would reduce training hours for a cosmetologist’s license from 1,500 hours to 1,000 hours.",
    "There have been concerns raised to me that you've been drinking again,'\" Gates told the Republic.",
    "If you need a date for Valentine’s Day, please refer to a newspaper ad from the early 1900s.",
    "House Bill 2399, sponsored by Republican Rep. Timothy Dunn, revives the cosmetology battles.",
    "KJZZ’s Rocio Hernandez is leaving the station to go to the Nevada Independent in Las Vegas.",
    "Kuhn got a classic Arizona sendoff: a mean tweet from Arizona Sen. Wendy Rogers.",
    "Bon voyage: Two local journalists announced their departures on Wednesday.",
    "It’s a highly complex problem, and piecemeal approaches aren’t solving it.",
    "In case you missed it yesterday, we want to hear your rent hike stories.",
    "For hairstylists, training hours would drop from 1,000 hours to 600.",
    "On a matter this significant, the filed bill is the starting point.",
    "Though of course those aren’t the texts the committee is after.",
    "We’re probably missing some stuff here, but you get the idea.",
    "How many ways are there to say this is a bill roundup?",
    "Adel said in a statement that she’s working on it.",
    "This is the best bill in the session so far.",
    "Now we want to see how everyone else reacts.",
    "Fill out the form here for the sticker swag.",
    "Which, honestly, would be a fitting end.",
    "If you pay, you can get a free sticker!",
    "But hopefully something to like, too.",
    "#AZLeg staff is amazing.",
    "This is a bill roundup.",
    "\"She did not deny it.\"",
    "It’s not working.",
    ": Not that many.",
    "Gov."
  ]
}