{
  "id": 3424,
  "mediaId": 2512,
  "date": "2022-01-31",
  "headline": "Trump’s pro-vaccine message is putting him at odds with far-right MAGA anti-vaxxers he has endorsed: report",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29206174&width=1200&coordinates=0%2C106%2C0%2C107&height=600",
  "link": "https://www.alternet.org/2022/01/anti-vaxxers-2656519191/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    4951,
    4144,
    2765,
    2706,
    5928,
    6689
  ],
  "sentences": [
    "“While Trump has recently taken aim at vaccine skepticism — rejecting concerns about its efficacy in a December interview with far-right commentator Candace Owens and revealing that he received a booster dose — some of his top proxy candidates are promoting a contrary message on the campaign trail.”\nNEW: Many Trump-endorsed candidates who have blindly embraced his claims about the 2020 election are showing a rare willingness to challenge him on Covid-19 vaccines.https://www.cnn.com/2022/01/31/politics/trump-candidates-covid-vaccines/index.html\\u00a0\\u2026\n— Gabby Orr (@Gabby Orr) 1643645160\nThose GOP anti-vaxxers, according to Orr, range from Arizona gubernatorial hopeful Kari Lake to Joe Kent — who is giving Rep. Jaime Herrera Beutler a primary challenge in Washington State.",
    "Although former President Donald Trump often downplayed the severity of the coronavirus pandemic during his last year in the White House, he has recently been encouraging Republicans to receive COVID-19 vaccines and booster shots — noting that he got a booster shot himself and that vaccines are saving lives.",
    "“Many Donald Trump-backed candidates who have blindly embraced his falsehoods about the 2020 election are showing a rare willingness to buck the former president on a most controversial question: whether or not Americans of all ages should get vaccinated against COVID-19,” Orr explains.",
    "And Tuesday, he is due to headline a fundraiser for Kent at Mar-a-Lago.”\nOther Trump-endorsed candidates who have been pushing an anti-vaxxer message include Steve Carra (who is challenging Rep. Fred Upton in a congressional primary in Michigan) and Rep. Mo Brooks of Alabama.",
    "“At recent campaign rallies, he has slammed vaccine mandates as a form of heavy-handed government intervention and celebrated the Supreme Court's decision to block a vaccine-or-testing mandate for large private companies that the Biden Administration had hoped to implement.”",
    "“To placate his base without alienating pro-vaccine Republicans, Trump has been road-testing a new message that promotes COVID-19 vaccines while leaving ample room for criticism of mandated vaccinations,” Orr notes.",
    "“He praised Lake at his Arizona rally on January 15, just days after the GOP gubernatorial candidate said she ‘wonder(s) about the efficacy of the vaccine’ during a podcast interview.",
    "That messaging, reporter Gabby Orr stresses in an article published by CNN’s website on January 31, is putting him at odds with all the MAGA anti-vaxxers in the Republican Party.",
    "The American people have been lied to.”\nTrump, in contrast, has been saying that COVID-19 vaccines work well and are saving countless lives.",
    "“So far, Trump has made no effort to distance himself from candidates who undermine his pro-vaccine message,” Orr observes.",
    "At a recent townhall event in Vancouver, Washington, Kent falsely claimed, “We’ve seen that the vaccines don't work.",
    "We've seen that masks don't work."
  ]
}