{
  "id": 3685,
  "mediaId": 2578,
  "date": "2022-01-22",
  "headline": "URGENT CALL TO ACTION! Critical Election Reform To Be Considered On AZ Senate Floor: Bills Make Ballot Images Public Record and Ballot Currency-Grade Fraud Countermeasures",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/Screenshot_20210924-205039_Twitter.jpg",
  "link": "https://www.thegatewaypundit.com/2022/01/urgent-call-action-critical-election-reform-considered-az-senate-floor-bills-make-ballot-images-public-record-ballot-currency-grade-fraud-countermeasures/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    5007,
    4267,
    135,
    1489,
    5949,
    6360
  ],
  "sentences": [
    "Senate Government Committee\nSB1008\nelections; recount margin (Ugenti-Rita)\nSB1009\nstate of emergency; executive powers (Ugenti-Rita)\nSB1012\nregistration database; federal voters; report (Townsend)\nSB1013\nsecretary of state; federal form (Townsend)\nSB1028\nballot paper; security measures (Rogers)\nSB1054\nelection equipment; security; legislative review (Townsend)\nSB1055\nelection process; contractors and contracts (Townsend)\nSB1056\nmisplaced ballots; invalidity; misdemeanor; damages (Townsend)\nSB1119\nelectronic ballot images; public record.",
    "The Maricopa County audit is still ongoing due to delays caused by Maricopa County and the mainstream media attempting to hinder any investigation into their “most secure election in U.S. History.”\nThe Gateway Pundit recently interviewed Arizona Senate President Karen Fann for an exclusive update on the ongoing audit investigation and Brnovich’s criminal investigation.",
    "(Borrelli: Barto, Fann, et al)\nSB1133\nschools; cities; all mail prohibited (Rogers)\nSCR1005\nfederal ballot voters; identification (Townsend)\nThe Arizona audit concluded as many as 700,000 ballot discrepancies in the 2020 election, and Republican Arizona State Legislators are determined to prevent this in 2022.",
    "We must be there!https://t.co/kz60KhXOvj pic.twitter.com/pZv2NIWyCK\n— Kari Lake for AZ Governor (@KariLake) January 21, 2022\nArizona State Senator Wendy Rogers also called Arizona audit volunteers and Patriots alike to come to the Senate hearing room this coming Monday.",
    "The Arizona Senate Government Committee will meet Monday to consider critical election reform, including legislation to make ballot images public records available to voters and to require that counties use ballot paper to include 19 specified fraud countermeasures.",
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nPatriots have been called to rally at the capitol before and during the meeting to pass these critical measures.",
    "MUST SEE: Arizona Senate President Karen Fann Gives Exclusive Update On Maricopa County Router Audit – AZ Attorney General Has Pulled Numerous People For Questioning\nTGP will provide on the ground coverage of this important meeting.",
    "Senator Rogers: AZ Auditors and all patriots – We need you to get as many conservatives to come down to the Senate Hearing Room on Monday at 2 PM to speak two minutes apiece on each of these election integrity bills.",
    "After the historic full forensic audit of Maricopa County’s 2020 election, GOP State Legislators are leading the charge to fix the vulnerabilities and strengthen election laws in Arizona.",
    "Trump-endorsed Arizona Gubernatorial Candidate Kari Lake put out an urgent call to action for proponents of election integrity to show up and show their support.",
    "All evidence and more has been delivered to Arizona Attorney General Mark Brnovich and he has opened a criminal investigation into the 2020 election fraud.",
    "We need ALL HANDS ON DECK to show up & support ALL these Election Reform Bills on Monday (1/24 2pm)\nPlease Request to Speak in Favor of these Bills.",
    "The 2022 elections are coming up, and Arizona leftists are preparing to execute another stolen election.",
    "(Borrelli: Fann, Townsend, et al)\nSB1120\nballot fraud countermeasures; paper; ink.",
    "Rogers will sit on the Government Committee this Monday, replacing Senator J.D.",
    "Show your support for election integrity on Monday at the Arizona Capitol.",
    "Those who support corrupt elections will show up en masse to defeat them.",
    "Contact Arizona Attorney General Mark Brnovich now to demand justice!",
    "Monday is a big day in the Arizona Senate for election integrity.",
    "Lake will be there to show her support.",
    "Mesnard, who is unavailable.",
    "URGENT!!"
  ]
}