{
  "id": 3778,
  "mediaId": 8251,
  "date": "2022-01-16",
  "headline": "Some in GOP begin testing party's lockstep loyalty to Trump",
  "image": "https://media.12news.com/assets/KPNX/images/203a5d25-d0ee-4af8-a501-f76d632339d5/203a5d25-d0ee-4af8-a501-f76d632339d5_1140x641.jpg",
  "link": "https://www.12news.com/article/news/politics/national-politics/some-gop-begin-testing-partys-lockstep-loyalty-trump/75-1da096fa-9f38-459d-a161-710e727844fa",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "FLORENCE, Ariz. — Former President Donald Trump stepped up his election-year effort to dominate the Republican Party with a Saturday rally in Arizona.",
    "A generally unassuming senator from South Dakota, Mike Rounds, is perhaps the boldest in acknowledging the reality that the election was in fact fair.",
    "GOP candidate for governor, Kari Lake responded to a personal endorsement from Trump with a speech similar to the former president's in past years.",
    "Trump released a statement Friday announcing he'd never support Ducey's possible ambitions to run for a seat in the U.S. Senate.",
    "But 2,000 miles to the east in Washington, there are small signs that some Republicans are tiring of the charade.",
    "He castigated anyone who dares to question his lie that the 2020 presidential election was stolen, including Gov.",
    "But their relationship soured after Ducey started to distance himself from Trump's fraud conspiracies.",
    "Lake incited the crowd about continuing to build the wall and even locking up Dr. Anthony Fauci.",
    "Ducey had been a supporter of Trump's during the election and campaigned for him in 2020.",
    "Track all of our current updates with Arizona politics on our 12 News YouTube channel.",
    "On the Contrary, some fellow party members are trying to follow in Trump's footsteps.",
    "\"...And when I'm elected, we will finish your big beautiful wall,\" Lake said.",
    "Rounds has drawn Trump's ire but also support from some fellow Republicans.",
    "Subscribe for updates on all of our new uploads.",
    "Doug Ducey."
  ]
}