{
  "id": 3820,
  "mediaId": 2540,
  "date": "2022-01-27",
  "headline": "Fact check: Right-wing website falsely claims Wisconsin assembly voted to withdraw its Biden electoral votes",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/220120151941-02-electors-plot-jan-6-joint-session.jpg?c=16x9&q=w_800,c_fill",
  "link": "https://www.cnn.com/2022/01/27/politics/fact-check-gateway-pundit-wisconsin-electors-2020-biden/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Dale",
  "authorUrl": "https://www.cnn.com/profiles/daniel-dale",
  "termIds": [
    4905,
    2706,
    99,
    613,
    1458,
    6729,
    6292
  ],
  "sentences": [
    "Edward Foley, director of the election law program at Ohio State University, said in an email on Wednesday: \"It's not possible to change the identity of a state's appointed electors after they have cast their electoral votes -- and certainly not after Congress has confirmed the winner of an Electoral College majority in the Twelfth Amendment joint session and then the elected president has been inaugurated two weeks later on January 20.\"",
    "The assembly's presiding officer at the time, Republican Speaker Pro Tempore Tyler August, quickly referred the resolution to the assembly's rules committee -- because referral to committee is a required step, under assembly rules, for \"privileged\" resolutions that the assembly is not taking up immediately.",
    "Washington (CNN)The Gateway Pundit, a right-wing website known for peddling conspiracy theories, published another inaccurate article related to the 2020 election on Tuesday -- and its false claims were echoed on Twitter by some Republican figures with substantial followings.",
    "The false Gateway Pundit story circulated online on the same day that Deputy US Attorney General Lisa Monaco told CNN that federal prosecutors were reviewing fake Electoral College certifications in which Trump allies deemed Trump the winner of states he had actually lost.",
    "The Milwaukee Journal Sentinel reported that Assembly Speaker Robin Vos dismissed Ramthun's proposal in comments to reporters last week, saying that \"every lawyer that we have worked with in Wisconsin says we cannot undo the 2020 elections.\"",
    "One Republican member of the assembly, state Rep. Timothy Ramthun, introduced a \"privileged\" resolution in favor of \"reclaiming\" the state's 10 Biden electoral votes, which the resolution falsely claims were \"fraudulent.\"",
    "Lake -- who has been endorsed by former President Donald Trump, has more than 100,000 Twitter followers, and has repeatedly promoted lies about the 2020 election -- wrote in her tweet: \"Arizona should be next!\"",
    "Rep. Jim Steineke, the assembly majority leader and rules committee chair (who is not running for reelection), posted a series of fact checks on Twitter after The Gateway Pundit's claims started spreading.",
    "Lawful electors, including the 10 Biden electors from Wisconsin, cast their votes in the Electoral College on December 14, 2020, formalizing Biden's 306-232 win over Trump.",
    "Contrary to the text of the revised Gateway Pundit article, it's not true that the assembly \"voted unanimously in a voice vote\" to \"move forward\" Ramthun's resolution.",
    "Arizona Republican Party Chair Kelli Ward, who has more than 178,000 Twitter followers, then amplified Lake's tweet and added of Arizona, \"We should have been first!\"",
    "The revised headline said the \"HUGE BREAKING NEWS\" was that the Wisconsin assembly had voted to \"advance\" a lawmaker's resolution to withdraw the state's electors.",
    "The Gateway Pundit, Ramthun's office, Lake's campaign and the Arizona Republican Party did not respond on Wednesday to CNN's requests for comment.",
    "And Steineke wrote of Ramthun's proposal itself: \"Rep Ramthun just attempted to pass an Assembly resolution to recall WI's presidential electors.",
    "Ongoing right-wing efforts to \"decertify\" the results in key states won by Biden -- like the effort Lake supports in Arizona -- are hopeless.",
    "The Wisconsin state assembly did not vote to withdraw its 2020 electors and did not vote to advance a resolution to withdraw these electors.",
    "In fact, the very video clip that Gateway Pundit embedded in the article, and touted in the headline, proves that this claim is wrong.",
    "It read: \"**HUGE BREAKING NEWS** -- Wisconsin Assembly Votes to Withdraw Its 10 Electors for Joe Biden in 2020 Election -- VIDEO.\"",
    "The committee's Republican chair, who is also the assembly's majority leader, accurately says it is unconstitutional.",
    "The video shows that Ramthun introduced the election resolution just before a vote on an entirely unrelated bill.",
    "Wisconsin was one of the seven states for which a list of phony Trump electors was sent to the National Archives.",
    "After August referred the resolution to the rules committee, the assembly went on with the unrelated vote.",
    "When The Gateway Pundit updated its article on Tuesday, it changed the headline to make a narrower claim.",
    "As the Milwaukee Journal Sentinel has reported, Republican assembly leaders have dismissed the proposal.",
    "Rather, the resolution was referred to an assembly committee, where it is overwhelmingly likely to die.",
    "An unconstitutional proposal\nRamthun's resolution will almost certainly fail in the rules committee.",
    "There is no constitutional way for Wisconsin or any other state to take back its 2020 electors.",
    "The headline was repeated on Twitter by Kari Lake, a Republican candidate for Arizona governor.",
    "There is no legal way for Wisconsin or any other state to withdraw its 2020 electors in 2022.",
    "As chair of the Rules Committee, there is ZERO chance I will advance this illegal resolution.",
    "The 2020 presidential election process is, simply, over -- and has been for more than a year.",
    "Congress affirmed Biden's victory when it counted the electoral votes on January 6, 2021.",
    "That unrelated vote is the voice vote shown in the video posted by The Gateway Pundit.",
    "After Biden beat Trump in Wisconsin by more than 20,000 votes, Democratic Gov.",
    "Tony Evers certified Biden's victory in the state on November 30, 2020.",
    "In fact, the assembly did not hold a vote on this resolution at all.",
    "Facts First: The Gateway Pundit's claims were entirely inaccurate.",
    "Steineke isn't the only Wisconsin Republican leader who agrees.",
    "The saga began with The Gateway Pundit's initial headline.",
    "Not only is it illegal, it's just plain unconstitutional.",
    "Biden was inaugurated as president on January 20, 2021.",
    "No vote was held on the election resolution itself.",
    "But the narrower claim was false, too.",
    "Steineke was right.",
    "#EndofStory.\""
  ]
}