{
  "id": 3869,
  "mediaId": 8350,
  "date": "2022-01-25",
  "headline": "Arizona GOP election rules advance, include releasing ballot images",
  "image": "https://ktar.com/wp-content/uploads/2022/01/voting-voter-absentee-ballot-ap1.jpg",
  "link": "https://ktar.com/story/4855742/arizona-gop-election-rules-advance-include-releasing-ballot-images/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/ap_override/",
  "termIds": [
    0
  ],
  "sentences": [
    "In a series of party-line votes, Republicans on the committee voted to advance bills that would make pictures of all ballots publicly accessible after an election; end all-mail elections for cities and school boards and require extensive security requirements on ballot paper akin to those used to prevent and detect counterfeit money.",
    "And the vote was taken from us.”\nElection and national security experts say there was no widespread fraud that could affect the outcome of the election, but former President Donald Trump and many of his supporters have continued to spread the false narrative that the race was stolen from them.",
    "PHOENIX — Lawmakers considering election bills heard Monday from a leading Republican candidate for Arizona governor and a number of people who worked on the Senate GOP’s partisan 2020 ballot review who urged the Legislature to adopt a series of bills changing the way elections are conducted.",
    "“And it’s our job as members to focus on reality.”\nMost of the state’s voting rights advocacy groups boycotted the meeting, and the room was dominated by Trump supporters who laughed when Democratic lawmakers vouched for the election’s legitimacy.",
    "Republican Sen. Sonny Borrelli’s ballot paper bill would require 19 specific security features similar to those found on money including holographic foil, watermarks, special inks and “stealth numbering” visible under an ultraviolet light.",
    "Officials said they were looking for watermarks — which do not exist on Maricopa County ballots — and bamboo fibers in the paper stock to test a conspiracy theory that fake ballots were surreptitiously flown to Arizona from Asia.",
    "But critics said it risked violating voters’ privacy and secret ballot, and election officials said voters sometimes sign their name or write their address on their ballot even though that’s strongly discouraged.",
    "Most restrictions on individuals have now ended, but the emergency declaration continues to block cities and counties from enacting their own public health measures that are more stringent than the governor’s.",
    "Doug Ducey leaves office, health emergency declarations could not last longer than 120 days without the approval of the Legislature, which would have to sign off every 30 days on a continuance.",
    "The review concurred with the official presidential election result — a narrow victory for Joe Biden in Maricopa County — but raised a number of discredited allegations of fraud and wrongdoing.",
    "In Arizona, an extensive review by The Associated Press found 230 cases of potential fraud, including 151 in Pima County where prosecutors found no criminal charges were merited.",
    "In addition to the seven election bills passed Monday, the committee also backed a bill to put new limits on the emergency powers of future governors during public health crises.",
    "The Senate Government Committee advanced seven election bills in its first meeting since the conclusion of the Senate’s unprecedented ballot review last year.",
    "Lawmakers heard a steady stream of false claims about the election, including that the use of Sharpie pens to mark ballots led to miscounted ballots.",
    "“Saying that the election was stolen, that’s great for a campaign speech but that’s not reality,” said Sen. Martin Quezada, a Democrat from Glendale.",
    "Workers waved ballots under an ultraviolet light in search of watermarks and took high definition images of the paper to look at its composition.",
    "“I’m talking to people every day around this state,” said Kari Lake, a former television news anchor now seeking the GOP nomination for governor.",
    "Proponents said releasing all ballot images would improve transparency, allowing anyone to check the official count after the election.",
    "Democrats said the election bills were a response to false conspiracies and promote false narratives about the security of elections.",
    "They also voted to change the threshold that triggers an automatic recount, from a margin of 0.1 percentage points to 0.5 points.",
    "Critics cited the large costs, noting there’s only one known company capable of producing the proprietary security features.",
    "Ducey’s health emergency for COVID-19, which was issued nearly two years ago, has still not lapsed.",
    "The proposed security features bring to mind widely mocked elements of the Senate’s ballot review.",
    "Borrelli said the ballots would cost about 25 cents each and the state would pay the higher cost.",
    "He used the emergency powers early in the pandemic to close some businesses.",
    "The public images would not be tied to the voter who filled them out.",
    "Only 10 Arizona cases have so far led to criminal charges.",
    "Biden won Arizona by just under 10,500 votes.",
    "“They’re so concerned about the elections.",
    "This last election was shady.",
    "After Republican Gov.",
    "It was corrupt.",
    "Share\nComments",
    "It was shoddy."
  ]
}