{
  "id": 4348,
  "mediaId": 2748,
  "date": "2022-01-20",
  "headline": "WATCH: Arizona Gubernatorial Candidate Kari Lake: “DAY ONE – We Will Issue A Declaration Of Invasion”, Plans An Interstate Compact To Secure Southern Border",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4ExGyblJXdLW2ubENIjTJM23pPKGbxDA1Yr_vzOsenswRjyAhWW4AHpGa2xTLDvJFr2bvDhAVuR7PRgXpycBFdfvujeFujSqlRS0StRciyPQOBzPbBXvuUbzl_hCiZkqHaryNfEPgG0mzvYUZCPTelly1xGECQg36ldatxKkYZk3pA=w1200-h630-p-k-no-nu",
  "link": "http://www.yourdestinationnow.com/2022/01/watch-arizona-gubernatorial-candidate.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In her official policy release, Kari established, “Any budget that fails to fully fund the border wall’s completion will be vetoed.”\nOn day one, Lake promises to issue a declaration of invasion to prevent the millions of illegal immigrants, cartel members, and trafficking victims, as well as the drugs that kill our communities, from pouring across our border.",
    "And I say it’s time we abandoned Brandon and start taking control of our state once again and making sure that our citizens are safe so that our kids can go out on the street and play like we did when we were kids, and they can be safe when they walk down the street.",
    "They can send their National Guard, they can send their police, and they can send, you know, just security and help for us and resources because we need to protect our border here in Arizona to protect the people in every state.",
    "Part of the border in Yuma, Arizona, doesn’t even have a barrier, and illegal immigrants just walk into our country so that Border Patrol can pick them up, process them, and send them into America with a court date.",
    "The fraudulent Biden regime has turned every state into a border state by shipping illegal immigrants as far as New York on airplanes, busses, and other means of public transportation.",
    "We’re not going to take this influx of people, many of them criminals, terrorists coming across, cartel operatives, they’re going back, and we have every right to protect our state.",
    "Lake: Yeah, well, First of all, it’ll start on day one, and I will take my hand off the Bible after taking the oath of office, and we will issue a declaration of invasion.",
    "We don’t need to ask permission from the federal government who’s dropped the ball, turned their backs on us, and I think they’ve done it intentionally under Joe Biden.",
    "Every state’s affected by this, and I think there will be a real push from governors across this country to say we’re going to protect our citizens as well.",
    "So first of all, we’re going to work by starting up an interstate compact with other states, and we’ll work together, pool resources, pool intelligence.",
    "And I will allow them to start stopping people at the border, arresting them for trespassing, processing them, and sending them back across the border.",
    "Article four, section four requires that they protect us from invasion, and they’re not doing that, and there’s a remedy in the US Constitution.",
    "They are sending them all across the nation, putting them on planes, processing them, giving them court dates four to five years away.",
    "The Gateway Pundit reported on this area and even captured video of illegal immigrants literally running to the Border Patrol agents.",
    "There is a crisis at Arizona’s southern border with Mexico, and Trump-endorsed Gubernatorial Candidate Kari Lake has a bold solution.",
    "So can you tell us more about what that means, the wall, and how you will ensure these criminals get arrested and actually deported?",
    "Taking all of the people coming here illegally, many of them dangerous people, and they’re shipping them all over the country.",
    "Article I Section 10 allows us to take control and fight back and protect our citizens from an invasion, and we will do that.",
    "I’m tired of what’s happening in this state, and I think the moms and dads and citizens of Arizona are tired of it as well.",
    "And I think we’re going to be able to find a lot of states that want to join that interstate compact with us to help us.",
    "The Gateway Pundit reported that Kari Lake announced plans to finish President Trump’s wall as Governor of Arizona.",
    "Lake urges Arizona Governor Doug Ducey to take action immediately and enact these changes before he leaves office.",
    "It’s destroying our country because what happens in Arizona as it pertains to the border doesn’t stay here.",
    "Lake will draft an interstate compact with other states to protect our nation from this foreign threat.",
    "And we will allow our Arizona National Guard, which I, as Governor, would be the commander in chief of.",
    "We’ll let the federal government know what’s going on, but we’re not going to wait for their approval.",
    "We have deadly drugs coming across in record numbers, and it’s destroying our state.",
    "Lake recently spoke at President Trump’s Save America rally in Florence, Arizona.",
    "States like New York and Pennsylvania will be able to send aid to the border.",
    "An interstate compact to do what the federal government basically won’t.",
    "Read Kari Lake’s plan to defend Arizona from the invasion here.",
    "Conradson: That’s right, and this is a national security issue.",
    "We will do that, and we will embolden our law enforcement.",
    "And it’s not just people coming across who are unvetted.",
    "And we’re going to process these people coming across.",
    "Lake: You’re right, and Joe Biden is behind this.",
    "Every right, and we need to start doing it now.",
    "Conradson: Let’s talk about your border policy.",
    "So in effect, every state is a border state.",
    "We have an invasion going on at our border.",
    "It’s almost as if they saw this day coming.",
    "Their court dates are often years away.",
    "South Dakota, Iowa, Wyoming, Florida.",
    "Our forefathers were brilliant.",
    "They have dropped the ball.",
    "It’s a dereliction of duty."
  ]
}