{
  "id": 5559,
  "mediaId": 2589,
  "date": "2022-04-20",
  "headline": "TN GOP kicks 3 candidates off ballot, including Trump and Pompeo endorsee",
  "image": "https://media.townhall.com/townhall/reu/o/2020/120/20cbe6af-5ca6-4775-af0a-1571df32936a-1110x740.jpg",
  "link": "https://hotair.com/karen-townsend/2022/04/20/tn-gop-kicks-3-candidates-off-ballot-including-trump-and-pompeo-endorsee-n463572",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Townsend",
  "authorUrl": "https://hotair.com/author/karen-townsend",
  "termIds": [
    2407,
    4327,
    2765,
    3332,
    5507,
    5155,
    1126,
    1294,
    6650
  ],
  "sentences": [
    "ROBBY HAS BEEN ENDORSED BY SENATOR RAND PAUL, CANDACE OWENS, CHARLIE KIRK, CONGRESSMAN MADISON CAWTHORN, CONGRESSMAN THOMAS MASSIE, CONGRESSWOMAN MARJORIE TAYLOR GREENE, TURNING POINT ACTION, LEXIT, PRESIDENT TRUMP’S LAWYER JENNA ELLIS, WILLIAMSON COUNTY SHERIFF DUSTY RHOADES, SEBASTIAN GORKA, CONGRESSMAN RALPH NORMAN, NYC MAYOR RUDY GUILIANI, CONGRESSMAN KEN BUCK, REPUBLICANS FOR NATIONAL RENEWAL, AZ GOP CHAIR KELLI WARD, BIENVENIEDO, BULL MOOSE PROJECT, AZ GOV CANDIDATE KARI LAKE AND MANY MORE\nStarbuck says a full statement is coming soon.",
    "In a statement ahead of the vote, Ortagus said she spent several weeks speaking with members of the State Executive Committee “about my core conservative beliefs, my background serving in the Trump Administration and the U.S. Navy Reserves, and my conservative vision for our state and our country.”\n“President Donald Trump believes I’m the best person to fight for his America First agenda and Middle Tennessee in Congress, and I’m working hard to ensure that my fellow Tennesseans, including TNGOP SEC members, understand why,” she said.",
    "The General Assembly last month passed legislation to enact residency requirements in congressional primaries, implicitly targeting transplant candidates mounting campaigns after recent moves to the state.",
    "Ortagus’ campaign argued that she met all of the state party’s bylaws — voting in enough recent GOP primaries, participating in Republican women’s groups and contributing to the state party.",
    "“I’m further disappointed that the party insiders at the Tennessee Republican Party do not seem to share my commitment to President Trump’s America First policies.",
    "— Robby Starbuck (@robbystarbuck) April 20, 2022\nThe three most prominent candidates left in the GOP primary are Nashville lawyer and retired National Guard Brig.",
    "It looks like the most established of the candidates found a way to cull the group and rid themselves of a Trump endorsee, at least in the case of Morgan Ortagus.",
    "Baxter Lee was removed from the ballot because he hadn’t voted in three of the last four Republican primaries, according to his campaign manager, Chip Saltsman.",
    "The primary race for the 5th Congressional District has been culled and included in the removals is a candidate endorsed by both Donald Trump and Mike Pompeo.",
    "Saltsman argues that Lee voted in 10 of the last 12 Republican primaries and had given almost $100,000 to Republican candidates over the last 10 years.",
    "The Secretary of State’s office last week confirmed the requirements cannot be applied retroactively to anyone who qualified by the filing deadline.",
    "Bill Lee effectively pocket-vetoed the bill, allowing the legislation to linger unsigned on his desk past the April 7 candidate filing deadline.",
    "— Robby Starbuck (@robbystarbuck) April 20, 2022\nIn Cuba they have sham elections where the party decides which candidates are allowed to run.",
    "As I have said all along, I believe that voters in Middle Tennessee should pick their representative – not establishment party insiders.",
    "When Pompeo was questioned about the possibility of ineligibility due to residence requirements, Pompeo stood by his endorsement.",
    "We can’t let RINO’s destroy our party.”\nOrtagus expressed disappointment with the vote and said her team is looking into options.",
    "pic.twitter.com/5LylmJUHV0\n— Mike Pompeo (@mikepompeo) February 22, 2022\nOrtagus said she met the qualifications as a candidate.",
    "Official challenges had been filed against all three and that triggered a technical removal from the ballot under party bylaws.",
    "It looks like the party was trying to use a residency requirement against Starbuck, the candidate with so many endorsements.",
    "Legislation establishing a three-year residency requirement for candidates running in a primary recently went into effect.",
    "Our team is evaluating the options before us.”\nAs mentioned above, Ortagus has the endorsements of both Trump and Pompeo.",
    "“There was no good reason to kick off some someone who’s been a good Republican for 20 plus years,” Saltsman said.",
    "On Tuesday, the Tennessee Republican Party voted to remove three congressional candidates from the primary ballot.",
    "They were voted off by the party’s executive committee, according to Tennessee Republican Chairman Scott Golden.",
    "Ortagus, who moved to Nashville last year, would not have qualified under the three-year residency requirement.",
    "Sadly in Tennessee candidates are NOT elected, they’re SELECTED by a tiny group of establishment RINO hacks.",
    "According to Starbuck’s campaign website, he has lots of endorsements from a large group of conservatives.",
    "“I’m a bonafide Republican by their standards, and frankly, by any metric,” Ortagus said in a statement.",
    "I worked with @MorganOrtagus at the State Dept to put American greatness at the forefront of all we do.",
    "Ortagus is a former State Department spokesperson, having served during the Trump administration.",
    "There will be no better representative than her for the 5th Congressional District in Tennessee!",
    "The first reaction from Starbuck on social media was made using a classic Andrew Breitbart gif.",
    "She announced her campaign earlier this year after receiving Trump’s preemptive endorsement.",
    "Reactions from the three range from expressions of disappointment to a declaration of war.",
    "“War.” “The corruption will be exposed,” Starbuck posted on social media after the vote.",
    "Gen. Kurt Winstead, former House Speaker Beth Harwell and Maury County Mayor Andy Ogles.",
    "Some of the friction from the state party comes from accusations of carpetbagging.",
    "That’s what we have in Tennessee now thanks to the State Executive Committee.",
    "Starbuck, who moved to Tennessee in 2019, was just eligible under the bill.",
    "It’s not about me, it’s about YOU and I’ll fight for your right to vote.",
    "The three candidates are Morgan Ortagus, Baxter Lee and Robby Starbuck.",
    "Lee sent the bill back last week unsigned, allowing it to become law.",
    "My family didn’t come from Cuba just to watch America become Cuba.",
    "We’ll fight this with every ounce of fight we have.",
    "They declared war on TN voters yesterday.",
    "“The fight has only just begun.",
    "@CAV_PAC is #TeamOrtagus.",
    "Not without a fight.",
    "Freedom matters.",
    "But Gov."
  ]
}