{
  "id": 6580,
  "mediaId": 8476,
  "date": "2022-04-14",
  "headline": "The Daily Agenda: We Have an Eggclusive",
  "image": "https://media1.fdncms.com/tucsonweekly/imager/u/slideshow/32252372/127060761_l.jpg",
  "link": "https://www.tucsonweekly.com/TheRange/archives/2022/04/14/the-daily-agenda-we-have-an-eggclusive",
  "mediaOutlet": "tucsonweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Leingang and Hank Stephenson",
  "authorUrl": "https://www.tucsonweekly.com/author/rachel-leingang-and-hank-stephenson",
  "termIds": [
    0
  ],
  "sentences": [
    "Here’s a picture of one of the species endangered by grazing:\nMECHANICAL TREE ALERT: In its continuing quest to innovate our dystopian future, Arizona State University has invented mechanical trees that look nothing like trees but are full of discs that scrub carbon dioxide, which will come in handy when we finally kill off all tree trees that are supposed to do that, Emma VandenEinde of Cronkite News reports.",
    "https://t.co/kpEsZChRze\n— Ryan Randazzo (@utilityreporter) April 13, 2022\nWe’ll be calling them “Sinema Republicans” soon: U.S. Sen. Kyrsten Sinema pledged to her fan club at the Arizona Chamber of Commerce yesterday that she would continue to kill President Biden’s Build Back Better plan, should negotiations on it emerge from the shallow grave where she left them, the Republic’s Tara Kavaler reports.",
    "What a guy: Pinal County is facing a pair of potential lawsuits seeking $13 million total after two county employees claimed Supervisor Kevin Cavanaugh spread lies that Garland Shreves, an activist, one-time legislative candidate, body donation magnate and chief of staff to the Pinal County Attorney, hired Amanda Stanford, formerly the Pinal Superior Court Clerk, in exchange for sexual favors.",
    "Capitol Media Services’ Howie Fischer notes that the measure is pushed just by Uber, though it would affect any of these “transportation network companies.”\nWayne Schutsky, the editor of the Yellow Sheet Report, refuses to forget about the missing Carl Hayden bust that will likely never be recovered despite being caught on film, and for that, we appreciate him.",
    "“When we are able to review the official, approved regulations we will assess the need for our measure as well as further opportunities to advocate for farmed animal welfare standards and greater consumption of plant-based foods across the state,” World Animal Protection’s programs director Cameron Harsh told us in an emailed statement.",
    "They pointed to a part of state statute that gives the department authority to make rules about “poultry husbandry and the production of eggs sold in this state.” And while GRRC went into an executive session to get legal advice about its authority here, they ultimately sided with the egg people.",
    ": One-term former Arizona Superintendent of Public Instruction Diane Douglas, last spotted comparing gay people to pedophiles, is running for the Peoria City Council in a special election this November for the Mesquite District seat vacated by Bridget Binsbacher, who is running for mayor.",
    "Fish and Wildlife Service and the U.S. Forest Service after records revealed the agencies’ own scientists warned that allowing grazing in Coronado National Forest would harm several endangered species, but the agencies have allowed grazing anyway, the Republic’s Lindsey Botts reports.",
    "When your voice is raw from not speaking for so long: The Republic’s editorial board used its rarely-heard and almost-never-heeded voice to call on lawmakers in the Arizona Senate to kill House Bill 2319, which would ban videotaping police activity within 8 feet.",
    "“Seeing that a ballot initiative has become the justification for an agency to take regulatory action is very troublesome,” the Arizona Farm Bureau’s director of government relations, Chelsea McGuire, said at a GRRC study session last month.",
    "The state has a perpetual “rulemaking moratorium” under Ducey, which calls on agencies to limit the regulations they put in place, requiring them to fall under specific purposes like for public health and safety and to promote job creation.",
    "In case you’re wondering how dead the Capitol is on a weekend, the guy who stole the Carl Hayden bust just climbed up on the monument, kicked it off, and walked away with it at 1 pm on Sunday in September, according to security cam footage.",
    "The $1.7 million she received in retirement credits and unused leave wasn’t noted in public employment records, and may constitute a violation of the state constitution’s gift clause, auditors told the Arizona Attorney General’s Office.",
    "But it also provides a window into a relatively unknown and rarely observed part of the political process, and a way that a big business with political clout can use that rare process when a bill at the Legislature doesn’t work.",
    "The regulation, which egg farmers and the Humane Society of the United States hailed as a grand compromise, was strange for a number of reasons, chief among them: It’s not clear GRRC has the authority to pass such a rule.",
    "At the behest of a politically connected egg farm, an obscure but powerful Arizona government agency last week neutered a ballot measure designed to protect animals by adopting a new but legally questionable regulation.",
    "It’s also worth noting that Cavanaugh has been among the chief local proponents of recruiting challengers to the incumbent Republicans in the new Legislative District 16, including Agenda favorite Daniel Wood.",
    "And lots of businesses are already committed to using cage-free eggs without any kind of rule in places, the Humane Society of the United States’ vice president of farm animal protection Josh Balk told us.",
    "https://t.co/XhihUY2tmP\n— Josh Balk (@joshbalk) April 12, 2022\nBalk said the Humane Society helped broker the compromise between the egg industry and the ballot measure proponents, World Animal Protection.",
    "For one, in our very first newsletter we wrote that state policymakers “decide how old the eggs on the shelf at the local store can be.” Now, they’re deciding what eggs can even be on those shelves.",
    "At a GRRC study session, Glenn Hickman, the president and CEO, said he has about 3 million birds in cages now and has “well north of $100 million” to spend to change the operation to be cage-free.",
    "And the ballot measure the regulation attempted to head off, while clearly seen as a threat to the business for egg producers, does not appear to be actively gathering signatures.",
    "The fines would be per person for anyone who even flies over “Arizona airspace.” Tomorrow, maybe she’ll propose fining gas stations with “no shoes, no shirts, no service” signs.",
    "And while the issue was discussed at length in a GRRC study session, no one voted against it, or even spoke about it further, when it came time to vote at a subsequent meeting.",
    "A substantial change to the way a business can legally operate in the state should probably be something the Legislature, our body tasked with making laws, has purview over.",
    "Inflation in the Phoenix area hit nearly 11%, mostly driven by home and gas prices, which is far above the national average of 8.5%, the Republic's Russ Wiles reports.",
    "“Police advocates like (bill sponsor, Republican Rep. John) Kavanagh believe they have a right to regulate the time and place of such speech intruding on officers.",
    "Nothing shady here: The Arizona Auditor General’s Office flagged a huge payday that Buckeye Elementary School District handed to Superintendent Kristi Wilson.",
    "Be honest with yourselves: Where else would you get this kind of content that blends insider political knowledge with the price of eggs on your shelves?",
    "And the Arizona Farm Bureau opposed the regulation on those grounds — they believe the Department of Agriculture isn’t allowed to make a rule like this.",
    "And the move was openly and explicitly in response to a ballot measure that was less-favorable to Hickman’s Family Farms, a big-name Arizona business.",
    "The regulation wasn’t something the Legislature would’ve done; in fact, the Legislature considered but didn’t pass a similar bill along these lines.",
    "World Animal Protection wouldn’t say whether they’re abandoning the ballot measure now, though the group said they welcome the cage-free regulation.",
    "There’s some big news in the Arizona egg world, facilitated by a wonky process that takes some words to explain, and a lot of people were involved.",
    "Shreves claims Cavanaugh continued spreading the lies even after an internal investigation deemed them bunk, Pinal Central’s Mark Cowling reports.",
    "Editor's note: The Arizona Agenda is a Substack newsletter about Arizona government and politics run by Rachel Leingang and Hank Stephenson.",
    "You won’t see our morning emails in your inboxes on Monday because we’re taking Easter Sunday off, but we have a big story for you tomorrow.",
    "We’re old enough to remember when ride-share apps like Uber and Lyft were illegal in Arizona and the biggest topic of debate at the Capitol.",
    "We promise that's the only egg pun ... Diane Douglas makes her triumphant return ... And the Carl Hayden statue is probably gone forever.",
    "Under House Bill 2273, drivers whose cars are less than 10 years old would just have to submit an attestation that their cars are safe.",
    "Crowding hens into small cages where they can’t move around or, really, act like hens, constitutes cruelty for animal welfare groups.",
    "“Ballot measure or not, we want to work with egg producers to create a clear, sustainable path forward as they convert to cage-free.",
    "The trends in the market are heading toward cage-free anyway — about a third of chickens used for egg production now are cage-free.",
    "Doug Ducey’s signature could get rid of a requirement that drivers for these apps get annual inspections of their brakes and tires.",
    "Videotaping police amounts to neither an imposition of unwanted speech nor a threat to police work,” the editorial board wrote.",
    "The school board is defending its decision to pay Wilson $3.3 million over five years, the Republic’s Yana Kunichoff reports.",
    "Meanwhile, teachers in the district earn an average of $45,000, or about 15% less than the state average, Kunichoff notes.",
    "Cage-free states include Arizona, California, Oregon, Washington, Michigan, Nevada, Utah, Massachusetts, and Rhode Island.",
    "The very fact that there’s been legislation on the topic indicates it’s a job for policymakers, not appointed bureaucrats.",
    "The bureau also pointed to a U.S. Supreme Court case about pig farms that they think could affect the egg regulation.",
    "The Governor’s Regulatory Review Council decides what state agency and board rules and regulations go into practice.",
    "It’s like leading the nation in spreading COVID: Prices in Arizona are inflating higher than the national average.",
    "The Arizona Secretary of State’s website shows just one circulator signed up as a gatherer for that initiative.",
    "Arizona just became the latest state to mandate that all eggs sold have to be cage-free (by January 1, 2025).",
    "The timing of this was not intentional, but ahead of Easter Weekend, we’re going long on egg content today.",
    "That's the most interesting advice I see in this story about social-equity marijuana licenses in Arizona.",
    "But the ballot measure would’ve required him to do it by 2023; the regulation buys him much-needed time.",
    "So today’s top story is longer than usual, and the rest of our daily rundown is shorter to compensate.",
    "The hearings on the issue were packed with more lobbyists than one GRRC observer had ever seen there.",
    "If you buy eggs, you might only be wondering if it’ll cost you more when the regulation hits in 2025.",
    "No egg producers opposed the rule, and public comments were overwhelmingly in favor of it, too.",
    "The City Council will appoint an interim member and Douglas has not applied, the city told us.",
    "The initiative backers wouldn’t tell us how many signatures, if any, they’ve gathered so far.",
    "Today in Kari Lake news: Kari Lake wants to fine airlines for requiring people to wear masks.",
    "If the Legislature passes laws, agencies, using GRRC, then figure out how to implement them.",
    "The Department of Agriculture, Hickman’s Eggs and the United Egg Producers all disagreed.",
    "So certainly for us, we'd want to do this with or without a ballot measure,” Balk said.",
    "We would have facilities that would no longer be producing eggs,” Hickman told GRRC.",
    "To support our particular brand of political journalism, become a paid subscriber.",
    "The city's review of zoning rules will push 26 new licenses to other locations.",
    "Watch where you step, cows: Environmentalists are threatening to sue the U.S.",
    "The rule exempts egg producers that have less than 20,000 egg-producing hens.",
    "Cage-free eggs cost about a penny or two more on average than caged eggs.",
    "We’ve said it all along: the weirder a story, the more we’re interested.",
    "This all occurred in a state that typically is light on regulation.",
    "(A call to Hickman Family Farms wasn’t returned by our deadline.)",
    "By 2025, all eggs produced and sold in Arizona must be cage-free.",
    "You can find their archives and subscribe at arizonaagenda.com.",
    "Hickman’s is the only Arizona farm affected by the regulation.",
    "(As the name suggests, all members are appointed by Gov.",
    "You probably eat eggs, so this affects you directly.",
    "Why are you writing so much about eggs, you may ask.",
    "— Wayne Schutsky (@WayneSchutsky) April 13, 2022",
    "GRRC basically installs the guts of government.",
    "“I simply couldn’t get it done by July 2023.",
    "The deadline is July 7 for the 2022 ballot.",
    "Probably not enough to notice.",
    "And now, a bill awaiting Gov.",
    "And that’s a fair question.",
    "Those days are long gone.",
    "Avoid @cityoftucson.",
    "Big win for animals!",
    "They’re wrong.",
    "Doug Ducey.)",
    "She’s back!"
  ]
}