{
  "id": 7163,
  "mediaId": 2526,
  "date": "2022-04-06",
  "headline": "Exclusive — Trump at ‘Rigged’ Premiere: ‘It Shouldn’t Be Allowed’ for Mark Zuckerberg to Privately Finance Election Operations",
  "image": "",
  "link": "https://www.breitbart.com/politics/2022/04/06/exclusive-trump-rigged-premiere-shouldnt-be-allowed-mark-zuckerberg-privately-finance-election-operations/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Boyle",
  "authorUrl": "https://www.breitbart.com/author/matthew-boyle/",
  "termIds": [
    2379,
    4119,
    4315,
    3706,
    3865,
    3067,
    2765,
    4905,
    5802,
    1126,
    748,
    6498
  ],
  "sentences": [
    "This movie delivers that evidence for the American people.”\nNunes, who now leads Trump’s social media platform TruthSocial and was previously the top Republican on the House Intelligence Committee, told Breitbart News at the premiere that the film was a “good overview of how the Trump campaign successfully used Facebook in 2016 to win the election.”\n“Facebook–they faced the wrath of the left and the censorship began, followed by the shakedown of $400 million given by Facebook to well-known Democrat operatives to harvest ballots,” Nunes said, adding that the “history of the 2020 election is being buried” but “this film begins to shed the light on what really happened.”\nConway, during a brief interview after the screening of the film, said that while the Democrats did this in 2020, they will have a tough time replicating it down the road.",
    "Trump’s son Donald Trump Jr. and his fiancee Kimberly Guilfoyle were also present, as were conservative movement leaders like Rep. Jody Hice (R-GA), Louisiana Attorney General Jeff Landry, former Ohio Secretary of State Ken Blackwell, conservative attorney Cleta Mitchell, TruthSocial CEO former Rep. Devin Nunes (R-CA), Winning Team Publishing’s Sergio Gor, Fox News contributor Katie Pavlich, and Florida GOP vice chairman Christian Ziegler.",
    "I think Cleta Mitchell put it best which is you don’t have to look at China, you don’t even have to look at Dominion voting machines, you just have to look in the eyes of Mark Zuckerberg.”\nConway also recounted how during the 2016 campaign Facebook was neutral between Trump and Democrat Hillary Clinton, and since then there seems to have been “guilt” that prodded Zuckerberg to spend big to help Biden in 2020.",
    "“Plouffe says in the documentary, ‘There are more conservatives than liberals in these counties and states and we have to be smart about it and make sure the liberals turn out.’ He also said, ‘Look at Wisconsin—Trump won Wisconsin with 1.6 [million] and change in 2016, he’s going to get a little bit more than that and we have to make sure we get even more.’ He says it.",
    "The film demonstrates that former President Barack Obama’s former campaign manager David Plouffe—among many other hard-left Democrat operatives—oversaw the distribution and spending of the money, and that while some Trump counties and precincts got some grants, the overwhelmingly vast majority of the cash flowed into inner cities that boosted Democrat turnout.",
    "We need to stop Mark Zuckerberg and we need to stop people like him—any gazillionaire—from pumping in money and trying to change the election.”\nLake added, when asked what should be done to stop this in the future, that America needs more laws to block private financing of election operations and that she thinks Zuckerberg should be charged with a crime.",
    "He said, ‘What do you think?’ I think in Washington there is some shock he won Mississippi.”\nTrump Jr., the former president’s eldest son, echoed his father telling Breitbart News at the premiere that this film exposed Big Tech for the Zuckerberg “electioneering operation.”\n“What Big Tech did in 2020 was a disgrace,” Trump Jr. said.",
    "It’s based on the fact that people who were supposed to be following the law were directed not to follow the law and it resulted in an enormous amount of ballots being cast that should have never been cast.”\nPriebus added that Wisconsin, in his view, needs a constitutional amendment passed to prevent this from ever happening again.",
    "“We believe it’s illegal, and that’s why we filed suit back in Louisiana back in October before the November election and we just won at the Louisiana third circuit in a 3-0 decision and we’re going back to the trial court because we believe current Louisiana law prohibits this kind of gifting directly into our election system.",
    "The film explores, too, the justification for the issuance of the grants, which was supposedly to have “safe” elections as the coronavirus pandemic raged in the United States—even though no medical experts were ever employed by the array of nonprofits that Zuckerberg and his wife Priscilla Chan used to pump the money out.",
    "Mark Zuckerberg spent $400 million to put his thumb on the scale to make sure that Joe Biden won the election.”\nA stunning 92 percent of the Zuckerberg cash in 160 different large grants totaling over $400,000 per grant—$270 million of the money in total—went to areas that now-President Joe Biden, a Democrat, won.",
    "PALM BEACH, Florida — Former President Donald Trump told Breitbart News exclusively that states and the federal government should ban private financing of election operations, and make it illegal for people like Facebook’s Mark Zuckerberg to funnel hundreds of millions of dollars into election offices.",
    "Otherwise, you aren’t going to have honest elections.”\nTrump’s comments came during an exclusive interview here at his Mar-a-Lago resort on Tuesday evening when Citizens United president David Bossie premiered his group’s new documentary film Rigged: The Zuckerberg Funded Plot to Defeat Donald Trump.",
    "“Every American needs to see in order to take away the education that this film provides so that every American understands how Donald Trump didn’t lose the election but how it was for months beforehand set up for him to not be able to win,” Bossie told Breitbart News at the premiere.",
    "The work that Dave and his team have done to bring to light what one person who has unlimited resources and the potentially legal ability to do—taking over $400 million and putting it into a system very systematically and doing it under the guise of COVID—is phenomenal.",
    "Others included then-campaign manager Kellyanne Conway, communications adviser Hope Hicks, former Republican National Committee (RNC) chairman and Trump’s first White House chief of staff Reince Priebus, Trump’s other 2016 campaign manager Corey Lewandowski, and more.",
    "That’s what Mark Zuckerberg did and I think there should be serious repercussions and what we’re seeing now is states across the country are passing laws to make sure that never happens again.”\nConway added that Plouffe knows what he’s doing in politics for the left.",
    "Between the rigged elections and the open borders and all the other things happening to this country, including inflation, it’s just a disaster.”\nTrump also called on Republicans to “get a lot tougher.”\n“They’re going to have to get a lot tougher,” Trump said.",
    "Rigged does the job the establishment media refuses to do and exposes Big Tech’s electioneering operation for the scam that it is.”\nGuilfoyle noted that the film is fact-heavy, and is filled with evidence—something critics will have a hard time refuting.",
    "Most of that went to districts, precincts, and counties that Biden won overwhelmingly.”\nPriebus, the former White House chief of staff who hails from Wisconsin, told Breitbart News that what he saw specifically about Wisconsin in the movie troubled him.",
    "“These are battle-hardened activists that were brought together, Obama-experienced partisans that came together to move this thing forward.”\nLewandowski and Conway both agreed that the hiring of Plouffe and other Democrats was particularly troubling.",
    "All 50 states should make a law that prevents that.”\nLandry, Louisiana’s Attorney General, told Breitbart News that he believes that what Zuckerberg did is illegal—and he filed suit before the election, and that case is moving to discovery soon.",
    "They have no approval whatsoever of the jobs Biden and Harris are doing but on the other hand, the issue is for the Democrats either they have to find a way to get rid of them or they have to find a creative way to get them back in there.",
    "“It’s documented in the tax filings of the two 501c3s that the Chan-Zuckerberg Initiative ran their money through claiming it was going to be nonpartisan and we’ve proven in this movie it was the furthest thing from that,” Bossie said.",
    "What took place during this election is sinful.”\nSome of the facts in the film are explosive—including the revelation that Zuckerberg’s spending amounted to a total near the full 2020 cycle spending by the entire Democrat Party.",
    "The Trump-backed gubernatorial candidate in Arizona’s 2022 election, former TV news anchor Kari Lake, told Breitbart News at the premiere that the film “was one of the most important movies I’ve ever seen.”\n“Americans are busy.",
    "This, again, what this movie is about—it’s really a beautiful movie, I’ve seen just a part of it and I’m looking forward to seeing the whole thing—but it’s really something that reveals what went on in one aspect of the theft.",
    "The only reason we found out about it was because of the IRS tax filings.”\nThe facts in this film are irrefutable, too, Bossie said, because they are based on tax documents that Zuckerberg’s organizations filed with the IRS.",
    "Thanks but no thanks.’ After Donald Trump won and shocked the system, including the Facebook infrastructure system, Mark Zuckerberg took a lot of heat internally from many of his colleagues in Silicon Valley and elsewhere.",
    "‘We’ll give you someone who’s embedded in the campaign and will help you with your digital footprint.’ I said yes right away—we were the ones who were underestimated, the underdog under-resourced and understaffed.",
    "Now even the New York Times came out and said they didn’t report the Hunter Biden story because of the fact that if they had done so before–let’s face it–it would have amounted to 17 points in the polling.",
    "“It’s a law that one form or another—whether it’s state or federal—it shouldn’t be allowed,” Trump said when asked about the Zuckerberg cash that flowed into election offices nationwide.",
    "“I think the legislature has to pass a constitutional amendment to bypass the governor to make sure that the Wisconsin Election Commission can’t do that ever again,” Priebus said.",
    "Landry’s litigation could, Bossie told Breitbart News, serve as “the blueprint investigation for how things should move forward” and could be replicated by many other states soon.",
    "That movie laid out what happened in one of the big thefts of our election, which was Mark Zuckerberg getting involved and trying to buy that election in a very sinister way.",
    "When I first watched this movie several months ago—I happened to be here at Mar-a-Lago for something—and we were sitting with the president and there were six or seven of us.",
    "I encourage our Democrat friends, our independent friends, and our Republican friends to sit down and watch that movie because we can’t have our elections bought like that.",
    "“The Democrat National Committee in 2019 and 2020, a two-year presidential cycle, spent $460 million over two years on ads, offices, staff,” Bossie told Breitbart News.",
    "Look, if somebody, if a rich guy out there wants to give Corey Lewandowski $400 million to oversee, I think I could probably have an impact on some of these elections.",
    "“I think this film needed to happen because it leads with the facts and the evidence about what happened and what transpired during the 2020 election,” Guilfoyle said.",
    "“By banning the practice of ZuckerBucks, and having these private individuals funding public entities and helping with elections across the country is very concerning.",
    "What’s more, the hiring of not just Plouffe but several other hardcore leftist Democrat staffers to run the distribution of the cash is exposed in the film as well.",
    "“‘Send us a check and we’ll run your ads on Facebook.’ We had 10 times the ads that Hillary Clinton did on Facebook at any given time in those crucial last months.",
    "The film analyzes the approximately $400 million that Zuckerberg funneled to local election offices in predominantly Democrat areas in swing states nationwide.",
    "That’s exactly what happened.”\nOther states are fighting back too, and many have either passed measures banning this practice, or are trying to do so.",
    "Wisconsin was one of the three major states that the film argues the Zuckerberg cash particularly targeted, the other two being Arizona and Georgia.",
    "“He hired David Plouffe, who was Barack Obama’s campaign manager, and he hired Joel Benenson who was the chief strategist to the Clinton campaign.",
    "Certainly, if they didn’t break any of those states’ laws then that means it was awful but lawful—and then those states should change their laws.",
    "I’ll tell you what else shouldn’t be allowed–is mail-in ballots, because nobody knows where they’re coming from and how they’re getting there.",
    "“The American people deserve to have that transparency and to understand what happened so it never happens again in political history.",
    "“So he turns around and spends more than $400 million that we know of—it could be closer to half a billion—and you see the statistics.",
    "“They silenced conservatives, censored stories that would hurt Joe Biden and spent millions of dollars to turn out Democrat voters.",
    "“What I learned about Wisconsin is that the Wisconsin Election Commission directed municipalities to break the law,” Priebus said.",
    "Mark Zuckerberg donated $400 million, or half a billion almost, and injected it into Democrat strongholds to affect our election.",
    "“Now we have $400 million in private money in the last four months of the election and totally off the books and non-disclosable.",
    "Every day, look at what’s going on in Wisconsin, look at what’s going on in Pennsylvania, look at what’s going on in Arizona.",
    "His interview with Breitbart News came right before the screening of the film, after he took photos with many of the guests.",
    "The same two people who ran as the presidential and vice presidential nominees in 2020 could be running again,” Conway said.",
    "Trump stayed and watched the full film with the approximately 100 or so present, and spoke to the attendees multiple times.",
    "There’s an expression that the vote counters are more important than the candidate and you could use that expression here.",
    "We’re busy, we’re trying to raise our kids, we’re trying to deal with Joe Biden’s inflation, we’re trying to get through.",
    "We need more laws that prevent people like Mark Zuckerberg or anyone else on either side—nobody should be able to this.",
    "“David Plouffe is a smart guy and helped Barack Obama get that White House over Hillary Clinton in 2008,” Conway said.",
    "But I think there was a certain level of guilt.”\nMore than $400 million is “big guilt, a lot of guilt,” Conway added.",
    "“That’s why I think what happened in Wisconsin is something that isn’t outlandish, it’s not wild, it’s not fiction.",
    "Because she had all the king’s horses and all the king’s money and they were running ads on cable and broadcast TV.",
    "“States should do an audit to find out who got money and what that money was spent on and how did it affect it.",
    "All of that is public and done by the public and in Florida they’re all elected and accountable to the people.",
    "But it happened.”\nThe right-wing-star-studded premiere of the film felt almost like a 2016 Trump team reunion.",
    "Frankly, they should stop with the mail-in ballots and they should have one-day elections like they used to.",
    "You vote on one day and you can only use a mail-in if you’re in the military and away or if you’re very ill.",
    "“We already know that the Democrats have a very poor hand to play in whom the country lacks confidence.",
    "Not just that, but the movie will articulate and you will see who Zuckerberg hired to spend that money.",
    "Bossie, a 2016 Trump campaign aide, was hardly the only Trump 2016 crew member there on Tuesday night.",
    "Ziegler, the vice chair of the Florida GOP, told Breitbart News that states should follow Florida Gov.",
    "In my race right now, if you wanted to donate–which I would love it if you did–you can donate $5,300.",
    "“Citizens United, they’re a very strong and very smart group of people,” Trump told Breitbart News.",
    "The number of ballots we had this year as opposed to any other year—who knows where they came from?",
    "It’s a whole other thing when they’re putting money into the operations of how elections are done.",
    "“I can tell you as the 2016 campaign manager, Mark Zuckerberg and Facebook stayed out of our way.",
    "When you look at this Dave Bossie documentary Rigged: 2020 you look at a few different things.",
    "We have tax dollars that fund these supervisors of elections and the operations for elections.",
    "“I think that every state should do an audit at the minimum,” Landry told Breitbart News.",
    "“A lot of political correctness—a lot of cancel or potentially be canceled,” Conway said.",
    "Guests gathered at Mar-a-Lago for a reception, dinner, and then a screening of the movie.",
    "Landry also said every state should be auditing the Zuckerberg cash in their elections.",
    "It’s one thing to go to a campaign and a candidate who is an option on the ballot.",
    "Think about it—if you go $100 more than the $5,600 they do very bad things to you.",
    "So nobody has ever heard of a thing like this where they put in $417 million.",
    "They cast their vote and they think they’re being good citizens and they are.",
    "What they’ve done is revealed one of the many ways they rigged the election.",
    "We all love our kids—I don’t care if you’re liberal or you’re conservative.",
    "Then you run that audit over their laws to find out if they broke any laws.",
    "‘You helped Donald Trump get elected—how can you do that?’ He didn’t help.",
    "We can’t have people meddling in our elections and putting this money in.",
    "You donate one penny more than that and you are in trouble with the law.",
    "“This is somebody that put up $417 million,” Trump told Breitbart News.",
    "You have seen the numbers and you saw the kind of enthusiasm we had.",
    "Thankfully we have some great lawmakers in this country,” Lake said.",
    "Facebook also in 2016 offered us and the Hillary campaign an embed.",
    "If they get away with this, it will be a true disgrace to America.",
    "“It’s all not just Democrats—but hardcore Democrats,” Bossie said.",
    "They allowed us to compete in a free market system,” Conway said.",
    "He’s hiding in plain sight in terms of what their intentions are.",
    "We have some people who are working to try to save this republic.",
    "Many people got two ballots, three ballots, or more than that.",
    "I think every American needs to watch that with an open mind.",
    "We split ours 50-50 between TV and social media and Facebook.",
    "He didn’t hire Johnny Smith or Billy Bob,” Lewandowski said.",
    "Mail-in ballots are rife for fraud and that’s what happened.",
    "“Dave Bossie has done a wonderful job, and all of the board.",
    "If we don’t have honest elections, we won’t have a country.",
    "We don’t want oligarchs of Big Tech rigging our elections.",
    "“The Republicans are going to have to get a lot tougher.",
    "There’s so many ways this happened and it’s a disgrace.",
    "Yet if you go more than $5,600 they put you in jail.",
    "Frankly, he should be charged with a crime for that.",
    "“We already have some laws that are being enacted.",
    "It’s a disgrace and they shouldn’t be allowed to.",
    "“I think all states have to do is watch what Gov.",
    "They used COVID as just another way of cheating.",
    "“They took 40 or 50 minutes and laid it all out.",
    "Do you want your children to have a country?",
    "“Nobody has ever heard of a thing like that.",
    "One aspect—there were many aspects of it.",
    "“He says it was stolen or rigged—it is.",
    "Those are just two of many other ways.",
    "We need to stop that kind of activity.",
    "These are known Democratic operatives.",
    "Ron DeSantis is doing,” Ziegler said.",
    "Ron DeSantis’s lead in stopping this.",
    "He just kept the playing field even.",
    "It’s a confusing topic,” Lake said.",
    "“Not everybody in politics is bad.",
    "The vote counters were a disaster.",
    "You see a lot of the votes we had.",
    "That’s what Mark Zuckerberg did.",
    "It’s disgraceful what happened.",
    "It is a problem,” Landry said.",
    "The Hillary people said, ‘No.",
    "It’s shocking what happened.",
    "They’re running their lives.",
    "“This should not be allowed.",
    "This was a rigged election.",
    "“The movie is incredible.",
    "“Past is always prologue.",
    "That’s very concerning.”",
    "You love your children.",
    "That is sinister.",
    "It’s un-American.",
    "It’s disgusting.",
    "We played on it.",
    "Nobody knows.",
    "Why?"
  ]
}