{
  "id": 7419,
  "mediaId": 2562,
  "date": "2022-04-06",
  "headline": "New Organization Recruits More Female Republicans to Be Governor",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid48CADF46-8736-4694-B152-DF4BC9426697.jpg",
  "link": "https://donaldjtrumppolls.com/new-organization-recruits-more-female-republicans-to-be-governor/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "Its national co-chairs are Annie Dickerson, founder of the Winning for Women Action Fund, which has worked to elect Republican women to federal office since the 2018 cycle, and Marie Sanderson, one-time policy director of the Republican Governors Association, CNN reported.",
    "(Eduardo Munoz Alvarez/Getty)\nBy Peter Malbin | Wednesday, 06 April 2022 11:48 AM\nA group of veteran political operatives has launched an organization to help recruit and support Republican women seeking to run for governor in 2022 and in the future, CNN reported.",
    "In Arizona, several Republican women have declared runs, including state Treasurer Kimberly Yee, Secretary of the Arizona Board of Regents Karrin Taylor Robson and former TV anchor Kari Lake, CNN reported.",
    "Olivia Perez-Cubas, vice president of communications for GOP group Winning for Women, observed that 11 of the 15 seats flipped by Republicans in the House in 2020 were Republican women, Politico reported.",
    "\"2022 holds a crucial opportunity for Republicans to not only flip the House and Senate, but also elect conservative women as chief executive of their states,\" Sanderson said in a statement.",
    "\"Right Direction Women will quickly become a key player in continuing to break glass ceilings for conservative women across the country, and I’m honored to be a part of it.\"",
    "\"I’ve personally seen the power of a great team, and know we must do more to support strong women leaders in their races for governor,\" Martinez added in a statement.",
    "\"The women we are looking to support are talented and credentialed, and Right Direction Women is excited to get involved in these critically important campaigns.\"",
    "There are currently three Republican female governors in the United States: Kay Ivey of Alabama, Kim Reynolds of Iowa, and Kristi Noem of South Dakota.",
    "\"As the number of Republican women in both state and federal offices increase, the bench for female governors will inevitably grow,\" she told Politico.",
    "Rebecca Kleefisch and former Trump White House press secretary Sarah Huckabee Sanders are competing in their respective state primaries for governor.",
    "Huckabee Sanders is widely expected to take the Arkansas governorship next year, according to Politico.",
    "\"That’s proof that when we invest in strong, qualified female candidates, they win,\" Perez-Cubas said.",
    "Nikki Haley commended the group’s desire to \"take on the good ol' boys’ club across the country.\"",
    "New Organization Recruits More Female Republicans to Be Governor Former New Mexico Gov.",
    "The organization, Right Direction Women, is chaired by former New Mexico Gov.",
    "Susana Martinez, the first Hispanic female governor in U.S. history.",
    "In a statement to CNN, former South Carolina Gov.",
    "In Wisconsin and Arkansas, former Lt. Gov.",
    "There are six female Democrat governors.",
    "Susana Martinez.",
    "Original Article"
  ]
}