{
  "id": 7567,
  "mediaId": 2642,
  "date": "2022-04-08",
  "headline": "President Trump Just Discovered The GOP’s New SUPER Star",
  "image": "https://waynedupree.com/wp-content/uploads/2022/04/TRUMP-GOP-RISING-STAR-01.jpg",
  "link": "https://waynedupree.com/2022/04/trump-gop-rising-star/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sophie O’Hara",
  "authorUrl": "https://waynedupree.com/author/sophieohara/",
  "termIds": [
    2088,
    2706,
    2765,
    1126,
    392,
    6386
  ],
  "sentences": [
    "But there’s another woman, who you may not have heard a lot about yet, but she’s so electric and wonderful, I have a feeling you’ll be hearing a lot more about her in the months to come.",
    "Kristina said these women, including the current secretary of state, are not even “Democrats.” They’re radical elites who treat the good people of Michigan like filthy unwashed peasants.",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of WayneDupree.com\nDEAR MEMBERS,\nAre you sick of seeing ads?",
    "pic.twitter.com/sKLnIwkcXM\n— Liz Harrington (@realLizUSA) April 4, 2022\nNow, THIS is the type of America First candidate we need to have in a position like secretary of state.",
    "I love her message because it’s so true – she’s calling out Whitmer and her team of female shrews, who have driven Michigan into the ground.",
    "WayneDupree.com is proud to offer a PREMIUM VIP MEMBERSHIP that eliminates ads and gives you the BEST browsing experience.",
    "Her name is Kristinia Karamo, and she’s President Trump’s pick for Michigan’s secretary of state… and what a pick she is!",
    "Kari Lake is one of my favorites, she’s running for governor of Arizona, and she’ll do a stellar job.",
    "Promoted Content\nPresident Trump has backed some amazing America First candidates for 2022.",
    "We got a chance to meet Kristina at President Trump’s recent Michigan rally.",
    "You can watch the video below:\n“Who do these people think they are?",
    "This woman is remarkable and has “superstar” written all over her.",
    "Kristina asks, “Who do these people think they are?",
    "Nobody will pull off cheating under her watch.",
    "They work for us.” @KristinaKaramo ??????",
    "Well then it's time to get rid of them!",
    "Dem elites have forgotten their place.",
    "We need a lot more like Kristina.",
    "She brought the house down!",
    "They work for us!”\nAmen.",
    "Follow Wayne on Rumble!"
  ]
}