{
  "id": 7608,
  "mediaId": 2745,
  "date": "2022-04-06",
  "headline": "False election claims dominate party for Trump, allies at Mar-a-Lago",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OQAGMOELNYI6ZA4PBT67NHGOHQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/04/06/2020-election-claims-dominate-lively-night-trump-allies-mar-a-lago/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Dawsey",
  "authorUrl": "https://www.washingtonpost.com/people/josh-dawsey/",
  "termIds": [
    0
  ],
  "sentences": [
    "Zuckerberg said in a statement last week to Fox News, through a spokesperson: “When our nation’s election infrastructure faced unprecedented challenges in 2020 due to the pandemic, and the federal government failed to provide adequate funds to allow states and localities to conduct elections, Mark Zuckerberg and [his wife] Priscilla Chan stepped up to close that funding gap with two independent, nonprofit organizations to help the American people vote.”\nAdvertisement\nTrump, in the film, alleged that Zuckerberg was afraid of his employees and people on the left.",
    "Trump spoke both at the dinner and before the premiere — repeatedly telling the crowd that Russia would not have invaded Ukraine if he was president, that there would be fewer civilian deaths, and that inflation and gas prices would be lower if the election was not “rigged.”\n“It just would have never happened,” he said, after describing grim civilian deaths in Ukraine that he had seen on television and saying the “rigged” election fueled it.",
    "If we don’t prove what happened in 2020, how can we stop it from happening again.”\nA who’s who of prominent advisers and election deniers and prominent challengers in his campaign to overturn the 2020 election gathered for the affair — along with random donors at the club for another event who spilled in, some hangers-on and Washington operatives looking for business, and candidates seeking his endorsement or help.",
    "PALM BEACH — Former president Donald Trump and a coterie of his top allies, donors and paying club members gathered at his palatial beachfront club Tuesday night for a reunion of sorts: to sip Trump-branded wine, snack on an amuse-bouche of fried shrimp and pastry-wrapped hot dogs on the Mar-a-Lago patio and, most importantly, relitigate parts of the 2020 election that he lost 17 months ago.",
    "Advertisement\nNothing has animated Trump over the past two years like his efforts to overturn the 2020 election, and he seemed particularly ebullient before watching the film, saying he was looking forward to its screening more than “Citizen Kane,\" \"Titanic” and “Gone with the Wind.”\n“Would you like some Trump wine?” a Mar-a-Lago employee cooed to every guest as they entered the patio.",
    "The occasion: The debut of a 42-minute film called “Rigged: The Zuckerberg Funded Plot to Defeat Donald Trump\" from Citizens United President and Trump ally David Bossie that stars a range of Trump advisers and alleges Facebook helped Democrats by pouring money into states for voter turnout and education efforts.",
    "When Peter Navarro, the former Trump adviser who posited some of the most extreme theories on overturning the election and is now under contempt proceedings by the House of Representatives, barreled into the room late, longtime Trump adviser Corey Lewandowski hollered out “Doctor!” and embraced him.",
    "The fraud fete on a sweltering spring night showed how much Trump and the ecosphere around him remain focused on the last election and his false claims of fraud — and how he now inhabits a cosseted club life where he is the roundly cheered, and rarely challenged, star who everyone pays to see.",
    "Advertisement\nThere was lawyer Cleta Mitchell, who closely worked with Trump’s White House Chief of Staff Mark Meadows to push fraud claims after the 2020 election and appeared with Trump on the call in which he demanded Georgia’s election officials “find” votes to overturn the results.",
    "Lewandowski, who was ousted temporarily from Trump’s orbit after allegations of inappropriate conduct from a Trump donor last year, engaged in fiery television hits from the back of the ballroom with Newsmax and Stephen K. Bannon’s podcast — and was greeted warmly by Trump and others.",
    "Advertisement\nHope Hicks, one of Trump’s longest-serving advisers who reportedly broke with him over election fraud claims in 2020 and resigned before he left office, was present for the event, sitting near the front of the ballroom and chatting with Priebus and hugging others.",
    "Advertisement\nAt the gilded Mar-a-Lago, where an Air Force One model sat on a table and hundreds of photos and tributes to Trump hung on the wall, there was no talk of the Jan. 6 commission probing the pro-Trump mob that ransacked the Capitol after his false claims of fraud.",
    "The outside world — where he has often struggled to break 40 percent in popularity, and his grip on the Republican Party has faded some — seemed planets away from the mangrove bushes, palm trees and ostentatiously gold rooms of Mar-a-Lago.",
    "The evening marked a homecoming of sorts for some Trump aides, who angled to see the boss and greet one another — such as former spokesman Hogan Gidley, with a caramel tan, who said he was at Mar-a-Lago for the first time in a year.",
    "Trump once bragged about having a close relationship with Zuckerberg — who has received considerable criticism from the left for not doing more to temper Trump’s rhetoric on Facebook — and even had him for dinner at the White House.",
    "Guests walked past Trump’s private quarters as they moved from one small, crystal-chandelier-packed ballroom for dinner through an outdoor concourse to another crystal-chandelier-packed, larger ballroom for the movie screening.",
    "Kari Lake, a prominent Republican candidate for Arizona governor and supporter of Trump’s claims, approached reporters and called the “mainstream media” the “enemy of the people,” urging them to quit and expose their owners.",
    "Kellyanne Conway, who starred in the movie, stood near the front of the ballroom and playfully ribbed other Trump advisers about how they might come off negatively in her upcoming book, scheduled to be released this spring.",
    "Advertisement\n“Oh that vote,” Navarro said dismissively of the contempt proceedings against him, as he walked into the ballroom for the screening before all other guests, seeming a man without a care in the world.",
    "He attacked Republicans for not doing enough to help him on the election results and ticked through a number of theories about the election and claims about various states, such as Wisconsin and Arizona.",
    "A hyperbolic poster advertising the movie, with Facebook CEO Mark Zuckerberg devilishly grabbing cash, was perched by the pool for a cinematic sunset as guests strutted about clinking glasses.",
    "His inquiry has made little pretense of neutrality and was led by figures who have shown allegiance to Trump or embraced false claims of fraud, and its findings were criticized.",
    "The video shows how a foundation partially run by Zuckerberg funded efforts that were designed to drive up turnout and help with coronavirus protections related to the election.",
    "As he traversed the club, he repeatedly asked guests and members about fraud in certain states and offered vague claims of explosive findings that he said were still to come.",
    "Advertisement\nBossie and others said they were not attempting to litigate some of Trump’s more incendiary theories, such as the falsehoods about Dominion voting machines.",
    "A makeshift wall separated the makeshift movie theater from the ballroom dining area, where employees cleaned up from the nightly dinner for the club’s paying members.",
    "As the movie ended, Trump greeted throngs of guests who waited for him on a red rope line and walked the few steps to his quarters, his Secret Service retinue in tow.",
    "Advertisement\nTrump promised that next week, the crowd would see levels of “ballot harvesting they never thought possible” as part of a report from an outside group.",
    "Instead, they said, the film showed that much of the money from the Zuckerberg foundation went to areas where Biden won, and turnout climbed in the 2020 election.",
    "Devin Nunes, the CEO of the struggling Truth Social, Trump’s new social media platform, walked through the room and was later spotted on the patio with Priebus.",
    "It does not accuse Zuckerberg of doing anything illegal but says instead that he packed his foundation with prominent partisan Democrats, giving examples.",
    "Christina Bobb, the One America News anchor who has pushed some of Trump’s claims and regularly talked to Trump, mingled with guests without a camera.",
    "Hicks has lobbied Trump to endorse David McCormick, a Senate candidate she is working for in Pennsylvania, and has partially returned to his orbit.",
    "“A tickle,” she said to one, promising him the ribbing would be “gentle.” “Should I curtsy?” she said walking into the premiere, before doing so.",
    "Michael Gableman, the retired Wisconsin Supreme Court justice who oversaw a criticized voter audit in that state, appeared in person and on film.",
    "Trump drew lusty standing applauses every time he walked in — and before and after every time he spoke — and made money from every guest there.",
    "Trump’s false claims about the election have unsettled American democracy and driven much of his party not to trust the results in 2020.",
    "), who lost to Trump in a vicious 2016 primary in which Trump insulted his wife’s appearance, and former House speaker Newt Gingrich.",
    "He credited Susie Wiles, who runs his PAC, and Reince Priebus, his former chief of staff, for working on the issue, among others.",
    "And they have been largely debunked — with even many Republicans urging him to move forward and focus on President Biden.",
    "Conway and Priebus stood around afterward and could be overheard discussing who shivved who in the Trump White House.",
    "“Some of the people here say we shouldn’t be talking about 2020,” said Bossie, the convener of the evening.",
    "Trump repeatedly signaled to the crowd he might run for president again, and they whooped and hollered.",
    "When he came to the second room, he gave a similar but shorter speech to largely the same audience.",
    "The movie repeatedly referenced how the coronavirus led state officials to change voting laws.",
    "It was unclear what he meant, but he said his advisers had been working with the project.",
    "“Michael, you’ve been unbelievable,” Trump said, thanking Gableman and bringing applause.",
    "They, at least in part, fueled the deadly attack on the U.S. Capitol on Jan. 6, 2021.",
    "As guests strolled through, they posed for pictures with Trump, who grinned widely.",
    "Among those starring in the project and attacking Zuckerberg: Sen. Ted Cruz (R-Tex.",
    "“It could be scorched earth, baby,” Bossie said, with a laugh, of her book.",
    "“Zuckerbucks,” person after person on the film said, describing his money.",
    "He now works on “election integrity” efforts for a Trump-related group.",
    "Advertisement\nAdvertisement\n3:43 PM\nAdvertisement\nAdvertisement",
    "No one challenged any of Trump’s claims about the election.",
    "That is now under criminal investigation in Georgia.",
    "He said the budget for the film was about $500,000.",
    "\"We'll make America great again, again,\" he said.",
    "Bossie was the main emcee of the video.",
    "She declined to speak on the record.",
    "Trump credited her from the podium.",
    "Guests swelled to greet Gableman.",
    "“I think it’s vital that we do.",
    "“We love Hope!” he said."
  ]
}