{
  "id": 8922,
  "mediaId": 2618,
  "date": "2022-03-19",
  "headline": "Millions of Americans will have their medical debt WIPED from credit reports: Equifax, Experian and TransUnion to strip billions of dollars from record - allowing people to get home and car loans previously denied",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/19/millions_of_americans_will_have_their_medical_debt_wiped_from_credit_reports_equifax_experian_and_transunion_to_strip_billions_of_dollars_from_record_-_allowing_people_to_get_home_and_car_loans_previously_denied_81523.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Hammer",
  "authorUrl": "",
  "termIds": [
    4794,
    3037,
    465,
    1381,
    6678
  ],
  "sentences": [
    "“I mean this sincerely — name me something\nThe shocking announcement that CNN+ would be shutting down operations less than a month after it launched has left out-of-work staffers “aghast and furious” over the company’s handling of what sources inside the network call “an absolute debacle.”“This is f–king crazy, it is nuts,” a CNN insider told The Post.“This literally rivals the epic disaster of Quibi,” the insider said, referring to Jeffrey Katzenberg’s short-lived streaming platform that went out of business just seven months after it launched in April 2020.CNN+ — which one insider estimated the network spent $300 million launching and between $100 million and $200 million advertising —\nIn a leaked recording of Kevin McCarthy on a call with Liz Cheney and other House Republicans, the Minority Leader told Cheney that he would counsel Trump to resign back on January 10, 2021.",
    "3 House Republican, and McCarthy was posted Thursday night\nMitt Romney’s going to need a good lawyer: Tulsi Gabbard is coming after him with a vengeance for the libelous lies he spread about her, having just sent a cease-and-desist letter to Mitt demanding that he stop spreading the “treasonous lies” lie about her.The brilliant, strongly worded letter (perhaps Romney could learn a thing or two about how to have a spine by reading through it a few times), starts on an unapologetically strong note, saying:Dear Senator Romney: Our firm represents former Representative and Lieutenant Colonel Tulsi Gabbard (“Representative Gabbard”) regarding false and defamatory statements you made about Representative Gabbard on Twitter.",
    "It was only a matter of time before the corporate elite started to worry about Americans not buying cars and homes and not paying credit card debt...so they made the offer to wipe away debt reports so Americans could rack up more debt...the message here is...THEY need US to keep buying so they can make more money...and with inflation out of control...they're getting worried...and besides...it's all insured and they are covered with substantial insurance coverage...it's a game to them as Americans suffer...\nObamacare, now Bidencare, takes care of so little of medical expenses that millions of working Americans are saddled with massive debt to hospitals for what would be considered routine care.",
    "Mitt Romney’s going to need a good lawyer: Tulsi Gabbard is coming after him with a vengeance for the libelous lies he spread about her, having just sent a cease-and-desist letter to Mitt demanding that he stop spreading the “treasonous lies” lie about her.The brilliant, strongly worded letter (perhaps Romney could learn a thing or two about how to have a spine by reading through it a few times), starts on an unapologetically strong note, saying:Dear Senator Romney: Our firm represents former Representative and Lieutenant Colonel Tulsi Gabbard (“Representative Gabbard”) regarding false and defamatory statements you made about Representative Gabbard on Twitter.",
    "“Ads shouldn’t detract from important conversations about the climate crisis,” the company said in a statement outlining its new policy Friday.There was no indication that the change would affect what users post on the social media site, which along with Facebook has been targeted by groups seeking to promote misleading claims about climate change.The announcement coinciding with Earth Day\nJoe Biden was filmed shaking hands this week with a dangerous felon who lied to authorities about carrying an illegal firearm and tried to murder Kyle Rittenhouse.He’s a good Democrat.Via Michael Gallas.",
    "“That’s how badly white guys want to use the ‘N-word.’”“Honestly, I don’t understand why Elon even wants\nIn an interesting chain of events, Clarence Thomas, the senior Associate Justice of the Supreme Court of the United States, part of the conservative majority, was almost prevented from serving due to “a high-tech lynching,”, led by then-Senate Judiciary Committee Chairman Joseph R Biden Jr.As part of President Biden’s campaign pitch in 2019, the former Vice-President under Barack Obama said his administration would work to protect abortion “rights” and Roe.",
    "Elon Musk ribbed “Saturday Night Live” right back after the show mocked the tech billionaire’s intentions to take over Twitter and restore the kind of free speech he believes the platform has abandoned.“Weekend Update” segment regulars Colin Jost and Michael Che joked in the skit about Musk being a poor businessman and only wanting to buy the platform to allow white guys to say “the n-word.”“Elon Musk offered to buy Twitter for over $40 billion so he can loosen its free speech restrictions,” Che began the segment, The Daily Wire reported.",
    "This letter concerns an urgent matter\nCNN political analyst David Axelrod said Friday on “Anderson Cooper 360” that the lawsuit attempting to disqualify Rep. Marjorie Taylor Greene (R-GA) from reelection ballot access over her comments and tweets surrounding the January 6, 2021 riot at the Capitol will fail and increase her fundraising.Cooper said, “Do you think the case brought against Greene would be successful?” CNN legal analyst Jeffrey Toobin said, “No, I don’t.",
    "President Joe Biden will reportedly address these issues – amongst many more – dogging his administration in an election year with the simple mantra: “It’s not my fault, blame the Republicans.” According to an Associated Press (AP) report Friday, the president will seek to portray himself as a man of action stymied at every turn by the GOP in a spectacular attempt at electoral blame shifting in the run up to the midterm elections come November.",
    "It started with military benefits you make toooo many $$ you are ineligible, social security... if you are low income you get $$$ added back to social security to pay your supplement, rich people pay into social security they are ineligible for ss & medicare if they are in a certain income ...so what's the point working when the government gives it to you free!",
    "Jamie Raskin, who serves on the January 6th Committee, recently claimed while speaking at Georgetown University that he and his colleagues will present “evidence” that Donald Trump coordinated with white nationalist and fascist groups “in order to support the coup.” This comes via NBC News, which reported on Raskin’s comments.",
    "Every Federal smackdown of any segment of the economy should always include a smackdown on the legal profession, and the only reason I say that is because the Federal Congress-Judicial System-Legal System are connected at the hip and can ruin lives of citizens with the stroke of a pen and the $400 per manhour lawyer rate.",
    "So, the goal here is the irresponsible/immature or both incur huge medical bills... and it is non-reportable on their credit score and thus there are no negative consequences for not paying their bills so the responsible suckers with expensive good health insurance or who pay out the ying yang are on the hook once again.",
    "“The Republicans know enough to insist on a clean extension of Title 42, not one encumbered with the Democrats’ wish list items,” she said, adding:\nSoaring gas prices, historic inflation, supply chain bottlenecks, lifting crime rates, a porous southern border, and increasing U.S. absences on the global diplomatic stage.",
    "(Snip) “We have to put the industry on notice: You’ve got six years, eight years, no more than 10 years or so, within which you’ve got to come up with a means by which you’re going to capture, and if you’re not capturing, then we have to deploy alternative sources of energy,” the one-time presidential candidate said.",
    "The New York Times reported:Former President Barack Obama on Thursday called for greater regulatory oversight of the country’s social media giants, saying their power to curate the information that people consume has “turbocharged” political polarization and threatened the pillars of democracy across the globe.",
    "According to Fox News: “Today marks 25 consecutive years, six months, and 15 days...\"\nUniversities are increasingly offering graduation events focused on participants’ identities and segregated by race, ethnicity, sexual orientation and even income, according to a report by a conservative education publication.",
    "NBC 10 noted that those who violate the proposed mandate would “face a civil penalty of $50 and shall owe twice the amount of personal income taxes.” Employers would be responsible to enforce the mandate and require vaccine proof from employees or face a $5,000 fine for each worker who is unvaccinated.",
    "The gloat fest over CNN+ becoming the sinking Titanic of leftist media continued for a second day on Friday as Fox News hosts Greg Gutfeld and Tucker Carlson skewered former Fox anchor Chris Wallace for jumping ship to the new streaming network only to find himself out of a job, at least temporarily.",
    "From the article: \"New Mexico mom Adriann Barboa, currently the chair of the state's Bernalillo County Board of Commissioners, for instance, saw her credit score plummet in 2014 after incurring a $15,000 bill when her then 14-year-old daughter, Amarisa, underwent surgery for appendicitis.\"",
    "While Hannity’s accomplishment is indeed impressive, when we consider that Hannity is still only 61-years-old and that Larry King continued hosting Larry King Live into his late-70s, the milestone becomes even more remarkable and leaves us to wonder: For how long can Sean go?",
    "This letter concerns an urgent matter\nAccording to a press release from Fox News, with last night’s broadcast legendary conservative talk radio and cable TV host Sean Hannity surpassed the late Larry King as the longest-running host of a primetime show in television history.",
    "Campus Reform, which is published by the Leadership Institute in Arlington, Virginia, reported last week that more than three dozen colleges and universities are holding graduation events this summer to recognize groups based on race, gender and sexual orientation.",
    "President Joe Biden tore into the GOP as the 'MAGA party' following the release of an explosive tape of House Minority Leader Kevin McCarthy in the days after the Capitol riot, termed a party dominated by figures like Ted Cruz as a 'different breed of cat.",
    "At least when inability to pay used to trigger the Hill-Burton proviso which had the Government pick up the tab for the indigent, and financelly strapped working families, having a child with a broken limb didn't automatically trigger bankruptcy.",
    "“I don’t think there’s any incentive for the Republicans to deal,” amid Democratic threats to lift the Title 42 border barrier against migration, responded Jessica Vaughan, the policy studies director at the Center for Immigration Studies.",
    "Republican Rep. Liz Cheney is denying she leaked a tape of a conversation with House Minority Leader Kevin McCarthy in which he says he'll push former President Donald Trump to resign from office after the January 6 Capitol attack.",
    "The natural gas industry sees itself in a continuing\nDemocrats and their business-backed allies are hinting they want the Republicans to okay more legal migration in exchange for keeping border barriers against illegal migration.",
    "(Tweet) During the trial of Kyle Rittenhouse in Wisconsin witness Gaige Grosskreutz was forced to admit that he was pointing a loaded gun at Kyle Rittenhouse while Rittenhouse was on the ground before he got his arm blown off.",
    "Wallace reportedly left because he didn’t like the opinions of other hosts on the network.Carlson appeared on “The Five” to promote an upcoming episode from his “Originals” series and was drawn into mocking Wallace by Gutfeld.",
    "President Biden’s climate envoy, John Kerry, says he’s putting the natural gas industry “on notice,” suggesting it has a decade at most to solve for the emissions that are driving Earth’s temperature dangerously higher.",
    "Having had CASH PAY plastic surgery for reconstruction after weight loss let me tell you, that surgeon and my hospital stay was a REQUIRED upfront pay, no payment plan, no half now, half later, no credit.",
    "What he did is unacceptable,' McCarthy can be heard telling fellow House leaders\nBefore his untimely death ten years ago, Andrew Breitbart's most famous quote was \"politics is downstream from culture.\"",
    "I think this is an embarrassment for Congresswoman Greene.”Cooper said, “David, does this just help her with her base?”Axelrod said, “Yeah, I totally agree with Jeff’s analysis except for one point.",
    "State lawmakers in Rhode Island are pushing legislation that would require every person in the state 16 years of age and older to be vaccinated against COVID-19 and punish those who refuse to do so.",
    "But more importantly, culture is downstream from religion.Andrew Breitbart was born in 1969, when the fundamental destruction of the unifying American religious narrative and morality had begun.",
    "Columbia University, Harvard University, Ohio State University, Illinois State University and the University of Texas at Austin are among those offering special ceremonies for Black graduates.",
    "The debt doesn't go away, but someone relying on the credit report sees a person who appears more credit-worthy than they really are and may grant them credit, or let them move into a rental.",
    "“The hearings will tell a story that will really blow the roof off the House,” Raskin said Thursday at an event hosted by Georgetown University’s Center on Faith and Justice in Washington.",
    "Supreme Court Justice Clarence Thomas has again gone on the record saying that he believes the Roe v. Wade ruling from 1973 that allowed virtually unlimited abortions should be overturned.",
    "That concept is the basis for what is called the Breitbart Doctrine, which holds that in order to change politics, it is first necessary to change culture.Breitbart was partially correct.",
    "I was still billed for small incidentals post op but the 99% of the bill was clear as glass before I signed anything, no surprise bills and I could shop around for both quality and price.",
    "Rep. Alexandra Ocasio-Cortez slammed the Supreme Court on Thursday as 'imperialist' after it ruled that Puerto Ricans were not entitled to the same access to benefits as other Americans.",
    "“I think [impeachment resolutions] will pass, and it would be my recommendation you should resign,” McCarthy said he would tell Trump before further adding, “what he did is unacceptable.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Going to a free market, cash pay, customer driven system with universal catastrophic insurance coverage only and tax incentives for personal medical saving accounts is however.",
    "Grosskreutz, 27, who had his gun in his hand as he stepped toward Rittenhouse, was severely wounded moments after Rittenhouse fatally shot two others in the streets of Kenosha.",
    "They’re going to try to play the Jan. 6 committee for all its worth, in the hopes that they find things to hurt Republicans with, like the tape of Rep. Kevin McCarthy (R-CA).",
    "(Tweet) In a speech at Stanford, Obama called for more government oversight over the Big Tech industry that is already trampling all over Americans’ rights to free speech.",
    "Even though the Democrats probably plan to steal the next election by fraud, they need to build some metrics in the media that make it seem plausible that they could win.",
    "Nobody can defend that and nobody should defend it.”Liz Cheney had pressed McCarthy about whether Trump could possibly choose to resign on his own: “Is there any chance?",
    "This along with the patient doctor hospital distrust sowed during Covid is an attempt to crash the healthcare system and create the government run single payer system.",
    "'The president referenced newly revealed audiotapes of McCarthy (R-Calif.) fuming about Trump and claiming he admonished the former president in a private phone call.",
    "But ... unbeknownst to me ... you're really in hock up to your eyeballs from the facelift & tummy-tuck you got for $100,000 and for which you now refuse to pay.",
    "The junior lawyers in every firm are under tremendous pressure to make as many hours billable as possible because they pay the salaries of the senior partners.",
    "Twitter says it will no longer allow advertisers on its site who deny the scientific consensus on climate change, echoing a policy already in place at Google.",
    "But it’s well deserved because of the horrible policies they’ve put forth, and the terrible job that Joe Biden has done.So, they don’t have too many options.",
    "The verdict provoked outrage in Puerto Rico and disbelief among campaigners.Ocasio-Cortez, whose father's family came from the island, made her anger clear.",
    "Bottom line: If the Feds are gonna screw over bankers, medical doctors, or education lenders, then they MUST screw the legal profession by the same measure.",
    "In a cohesive, functional society whose members generally understand assumptions regarding faith and moral ideals, politics does indeed flow from culture.",
    "The court voted 8-1 that Congress had the power to exclude them from a benefits program that's available in all 50 states and the District of Columbia.",
    "Sooo you can buy a car & a house but you cannot pay your medical bills...you can afford cable, a cell phone but you can't pay you utility bills.????",
    "However, the doctor/hospital finally wins a judgement against you and you now must pay him/it in full ... and so you decide not pay another bill!",
    "Democrats are making loud noises about January 6th again, claiming that coming revelations will “blow the roof” off the House of Representatives.",
    "Representative Cheney did not record or leak the tape and does not know how the reporters got it,' Cheney's spokesperson said, according to CNN.",
    "Anyone remember what happened in 2008 when all of those mortgages were being given to people who couldn’t pay the monthly bill?",
    "When they fail to pay their bills or rent because they're overextended, the responsible among us will be left holding the bag.",
    "I'm a bank or credit agency and I lend you money to buy a car or a house based on your recently attained decent credit score.",
    "Tried to dispute a medical over billing for a year until they terminated conversations and sent me to a collections agency.",
    "(Snip)Other schools are hosting special graduations to recognize LGBTQ, first-generation immigrants, women and low-income",
    "We are officially known as chumps - - people who pay their own way - - without demanding that other people pay for them.",
    "Imagine if Rudy Giuliani, Sydney Powell, or Gen. Flynn were to get their legal fees expunged from their credit history?",
    "Once that is complete, the communists will have achieved almost all their goals with the exception of GUN confiscation.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "This will probably result in a tightening of credit rather than a loosening and hurt the people it’s trying to help.",
    "Local outlet NBC 10 reported Tuesday that two state Senators have removed their names from the bill, Bill S.2552.",
    "This is part of a concerted effort to boost the credit scores of irresponsible people beyond what they deserve.",
    "She may not be able to afford the $15,000 debt but many of us can't either and we set up monthly payment plans.",
    "The legal profession is in dire need of reform but it's difficult because, by definition, they control the law.",
    "That's why the ridiculous hourly fees for what is nothing more than historical research that anybody could do.",
    "What it will do is make it harder for a lender to assess the credit worthiness of someone applying for a loan.",
    "'The select committee has asked Kevin McCarthy to speak with us about these events but he has so far declined.",
    "I paid, because I was changing jobs and didn’t want the ‘ding’ on my credit to be a reason not to get hired.",
    "I am all for getting a handle on the outrageous cost of medical treatment BUT this is not the way to do it.",
    "One excerpt has McCarthy claiming that Trump 'told me he does have some responsibility for what happened.",
    "Interest rates are up near 7% now, the highest rates in years and still they are way behind inflation.",
    "That is why you see stories that show more support for their candidates than you believe is possible.",
    "Elective medicine that is cash pay is the way to go if you actually want to make money as a doctor.",
    "Poster #6: \"What about those of us who have managed to pay our own medical bills all these years?\"",
    "Failing to consider unpaid medical bills in credit scores masks the total indebtedness of people.",
    "Gutfeld has been on a tear, gleefully mocking Wallace at every opportunity for quitting Fox News.",
    "Inflation is at an all-time high by some measurements and at 50-year highs by other measurements.",
    "The Government takes that debt off of your credit rating, but they don't pay that debt for you.",
    "If you don't whine and cry and scream nowadays - - you're a certified Chump from Chumpsville.",
    "They’re trying the redistricting game in the hopes that they can steal some seats that way.",
    "So now we’re going to give car and home loans to people who can’t pay their medical bills?",
    "After denying he made such comments, audio of a conversation between Cheney, then the No.",
    "These programs have large deductibles, which make the insurance plans virtually useless.",
    "This means more credit will be extended to high risk borrowers who will later default.",
    "What's wrong with deleting this debt from a person's credit record after its paid off?",
    "I don’t have dental insurance but this last week had to have root canals in two teeth.",
    "The Dow dropped nearly 1,000 points today – the worst day for the Dow since June 2020.",
    "What about those of us who have managed to pay our own medical bills all these years?",
    "This sounds like a scheme by the Democrats to boost the economy before the election.",
    "And they absolutely will not stop... ever, until you are turned over to collections.",
    "Did Adriann Barboa think spending the night in the hospital was going to be free?",
    "Doctors, clinics and hospitals have gone overboard in their cost of medical care.",
    "But they have as much chance of reforming their profession as Congress does.",
    "Democrats are up a creek without a paddle as we head toward the midterms.",
    "We are told healthcare is a necessity, but the prices make it a luxury.",
    "I just had an injection of \"monovisc\" into a bum knee...it cost $2,000!",
    "What right does Government have to erase the debt that people owe me.",
    "Your donation helps keep our discussions going and our voices heard.",
    "(Snip) With inflation at all-time highs, Biden’s economy is a mess.",
    "People won't pay their medical bills if there are no consequences.",
    "The debtor still owes the money and is responsible for re-payment.",
    "The debt is not erased, it is just not reported in credit checks.",
    "Why don't they do something about the excessive fees of LAWYERS?",
    "The majority of personal debt in America is from medical bills.",
    "Barack Obama and Hillary are pushing for government censorship.",
    "They know that they are quite likely to get slaughtered badly.",
    "Dying from appendicitis is absurd, but so is the medical bill.",
    "This unpaid \"medical debt\" is not noted on your credit score.",
    "This is how a previous housing bubble was created and busted.",
    "Realize that hospitals billings departments are out there!",
    "There are too many lawyers but they are not all good ones.",
    "Sooooo now the credit agencies are political...unreal!!!",
    "To hell with individual rights and the Constitution.",
    "This all happened due to Biden’s reckless spending.",
    "Anybody have any ideas on how to stop this tyranny?",
    "This is no different than the college loans idiocy.",
    "Income inequality is worse than one sided justice.",
    "The Biden economy is doing bad and getting worse.",
    "The cost of gasoline has reached all-time highs.",
    "The check had cleared before I went into the OR.",
    "One step closer to government run healthcare.",
    "I am a private company and you owe me money.",
    "Don't get sick, but if you do, die quickly.",
    "They don’t feel pity, or remorse, or fear.",
    "What happened to going on a payment plan?",
    "And I paid for them out of my own pocket.",
    "This is just the beginning....just wait!",
    "Obama was a big part of this censorship.",
    "I wonder what bill you won't pay next??",
    "Can't I still make attempts to collect.",
    "Does DC ever learn from their fiascos?",
    "I have been preaching this forever!",
    "That encourages inflation of hours.",
    "We are heading in that direction.",
    "#35.. point of clarification.",
    "They can't be bargained with.",
    "Don't you still owe it to me?",
    "They can't be reasoned with.",
    "People cut back on luxuries.",
    "''I've had it with this guy.",
    "Whisky Tango Foxtrot!",
    "Explain this to me.",
    "Great point, #12.",
    "#14 is correct.",
    "Which is it?",
    "Thank you.",
    "H-m-m ...",
    "So ...",
    "F 'em!"
  ]
}