{
  "id": 9243,
  "mediaId": 2618,
  "date": "2022-03-19",
  "headline": "Longest-serving US congressman Don Young dies aged 88 midair on flight from LA to Seattle: Republican Alaska representative served his state for 25 years and filed for reelection",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/19/longest-serving_us_congressman_don_young_dies_aged_88_midair_on_flight_from_la_to_seattle_republican_alaska_representative_served_his_state_for_25_years_and_filed_for_reelection_81527.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Staff",
  "authorUrl": "",
  "termIds": [
    2678,
    2617,
    4794,
    1477,
    1126,
    1433,
    66,
    6596,
    5930
  ],
  "sentences": [
    "Now we're begging for oil from Iran and Venezuela, hamstrung because of natural gas sanctions against Russia, held captive to precious metals from China, and entangled with other hostile regimes in the oil-rich Middle East.",
    "Jack Ferguson, who had served as Young's chief of staff, told the Anchorage Daily News that Young lost consciousness on a flight from Los Angeles to Seattle and could not be resuscitated.",
    "(He was a Jeb/Kasich guy...not conservative enough for me on National/social/economic Issues, but mirrored the electorate of his home state)\nDoes anyone proofread anything anymore?",
    "It's a good thing that they religiously clean out planes after every flight because Don could have spent a couple of weeks in that seat before anybody noticed he was not breathing.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Republican Representative Don Young, who was first elected to Congress in 1973 and was its longest-serving current member, died on Friday, his office said in a statement.",
    "Doug Scott of the Sierra Club pushed for the Act saying, \"You may never be able to visit [the pristine natural wilderness preserved by the Act], but you can dream of it.\"",
    "He called the locking up of \"millions of acres of timber, oil, and mineral resources for a playground\" as \"the most asinine thing I've ever heard of.\"",
    "I first became aware of Don Young because of his impassioned speech on the House floor speaking against the passage of the Alaskan Lands Act of 1980.",
    "Yes, we would lose some good ones, but term limits would allow us to flush the toilet every now and then and get rid of the Maxine Waters types.",
    "People can stay in Congress until they die because they are not required to do any actual work for their $174K (soon to be $200K) salary.",
    "Isn't the year a certain long-serving [i.e., self-serving] Senator got sworn in in Delaware after his election in Nov 1972?",
    "Lisa Murkowski is a prime example, but she got her corruption directly from her corrupt father, another Alaska GOP fraud.",
    "Lots of Congressmen like Young start off good, but get infected with so much Swamp Fever they become unrecognizable.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "'Don Young's legacy as a fighter for the state will live on, as will his fundamental goodness and honor.",
    "It takes a while to document incompetence, so they are usually bought out of their employment contracts.",
    "#5, the Age Discrimination In Employment Act of 1967, as amended,allows most employees to work forever.",
    "Is it not strange....EVERY story about his death mentions that he downplayed Covid, then caught it.",
    "None mention that he was only sick for about a week...bounced right back to Life as Normal.",
    "People like Fat Teddy even slept in their chairs all day long and kept getting re-elected.",
    "We will miss him dearly,' the statement said.His office did not give the cause of death.",
    "If you aren't into fishing, Congress is a great place to spend your retirement years.",
    "The flight attendant must have noticed that his glass of Scotch had gone untouched.",
    "(love me some Church Lady) As noted, at 88, the cause of death is self-explanatory.",
    "The 88-year-old congressman died while traveling home to Alaska, his office said.",
    "That causes some interesting problems for professors who lose their marbles.",
    "I doubt it's because they envy its pristine \"Designated Wilderness Areas.\"",
    "Go dream of a United States where its citizens vote to put America First.",
    "It's ridiculous that we have people dying from old age in our Congress.",
    "Your donation helps keep our discussions going and our voices heard.",
    "Now, the Russians are talking about taking Alaska back.",
    "The article says they don't know what he died from.",
    "Brings to mind the old saying \"Use it or lose it.\"",
    "Many lines of work have mandatory retirement ages.",
    "1973... that is longer than I have been alive!!",
    "Many examples—and Alaska has its fair share.",
    "Yet another perfect excuse for term limits.",
    "25 TERMS actually, not years.",
    "Term limits and age limits.",
    "Could it be...SATAN???",
    "He died from old age.",
    "He was 88 years old.",
    "We need term limits.",
    "Sounds familiar.",
    "Who could it be?",
    "Totally insane.",
    "Don Young.",
    "Thank you.",
    "R.I.P.",
    "1973?"
  ]
}