{
  "id": 940,
  "mediaId": 8475,
  "date": "2022-02-11",
  "headline": "Arizona GOP gov candidates embrace Brnovich’s opinion on using troops to repel border 'invasion'",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/soldiers-border-wall-wire-1024x681.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/021122_az_gov_border/arizona-gop-gov-candidates-embrace-brnovichs-opinion-using-troops-repel-border-invasion/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    2706,
    2915,
    3401,
    4052,
    1126,
    98,
    99,
    5949,
    6667
  ],
  "sentences": [
    "\"The Biden Administration is not fulfilling its obligations under Article IV Section 4 of the Constitution, so Arizona has the right and the responsibility to protect our citizens by leveraging our law enforcement capabilities and moving forward without them,\" Salmon said in a statement provided to the Arizona Mirror.",
    "That plan states that she'll not only increase the National Guard presence on the border to monitor smuggling routes, but to destroy tunnels used for smuggling, shoot down drones that enter Arizona's air space from Mexico and grant troops authority to arrest suspected cartel operatives and illegal immigrants.",
    "McGuire agreed that Ducey has the authority to do what Brnovich said in his opinion, and though he feels the National Guard's role is more appropriate to provide support for law enforcement entities, he was confident that the National Guard could successfully carry out such a mission.",
    "Ducey and previous Arizona governors from both parties, along with their counterparts in other border states, have sent National Guard troops to the border to provide support services for Customs and Border Protection, county sheriff's offices and other law enforcement organizations.",
    "Brnovich's opinion states that Arizona's governor can go further, using the National Guard or the Arizona State Guard — essentially a state-run military unit that a governor has the authority to form, but that Ducey hasn't authorized — to engage the \"invaders\" in a military capacity.",
    "As governor, Lake would \"invoke our inherent power to fend off the invasion at our southern border in the absence of federal protection,\" while Robson would \"move swiftly and in concert with our fellow states to finally bring law and order to the border.",
    "Gaynor praised Brnovich's use of the word \"invasion\" to describe the situation at the border, and said Arizona needs a funding increase for the National Guard, Department of Public Safety and sheriff's offices to deal with the problem.",
    "\"The attorney general's opinion is potentially a game-changer in terms of the role that National Guard and other authorities under the governor's command can play in securing the border and combating the cartels,\" Benson said.",
    "Robson's border security plan already included a \"surge\" of National Guard troops to the border to provide support to federal and local law enforcement, as well as to physically patrol areas where CBP is thin on the ground.",
    "At the request of state Rep. Jake Hoffman, Brnovich issued an opinion declaring that incursions by drug cartels, human smuggling organizations and other criminal groups into Arizona from Mexico qualifies as an invasion.",
    "\"We will not continue to stand idly by while Arizona being overrun by an organized narco-terrorist invasion that was invited by the failing Biden Administration,\" Lake said in a statement provided to the Mirror.",
    "The attorney general's opinion is potentially a game-changer in terms of the role that National Guard and other authorities under the governor's command can play in securing the border and combating the cartels.",
    "In addition, Salmon said he would push the legislature to pass laws allowing law enforcement to arrest illegal immigrants for trespassing, and to declare areas of the border to be disaster areas, as Texas Gov.",
    "The issue of financial resources is a significant one to Michael \"Mick\" McGuire, the former head of the Arizona National Guard and currently a Republican candidate for U.S. Senate, as is Brnovich.",
    "It has also been used by white supremacist terrorists like the El Paso shooter, who targeted Mexicans at a Walmart, and the Christchurch, gunman who killed Muslims at two mosques in New Zealand.",
    "And he said he'll open a state version of former Maricopa County Sheriff Joe Arpaio's notorious Tent City jail, which he plans to use in partnership with counties that are short on jail space.",
    "But McGuire warned that it would be \"very, very expensive,\" and worried about setting a precedent that the state will pay for border security that the federal government is responsible for.",
    "Salmon said the cost of deploying the National Guard to the border in a more active role would be worth it because the cost of not addressing the problem in the long term would be greater.",
    "And during a January visit to the border in Yuma, Steve Gaynor said the Biden administration has failed to halt the \"invasion\" at the border, saying that, when he's governor, \"This ends.\"",
    "According to internet archives, Matt Salmon updated his website in December to reference Article IV, Section 4 of the Constitution and to decry the situation at the border as an invasion.",
    "\"If the word gets out that the Arizona border is no longer open for business to the cartels, then I think you'll see some of that traffic flow elsewhere,\" Benson, her spokesman, said.",
    "As to whether he'd use the National Guard in a direct law enforcement capacity on the border, as Brnovich's opinion encourages, Gaynor told the Mirror, \"All options are on the table.",
    "Salmon's answer to whether he would send National Guard troops to the border to directly engage with cartels and smuggling organizations is a \"resounding yes,\" his campaign said.",
    "Because the federal government has failed in that responsibility, the governor has the authority to take action, including by using the Arizona National Guard, Brnovich wrote.",
    "Local\nAttorney General Mark Brnovich's recent opinion declaring that transnational criminal activity at the U.S.-Mexico border constituted an invasion of Arizona and that Gov.",
    "Kari Lake and Karrin Taylor Robson's websites also proclaim that the federal government has failed to meet its constitutional responsibilities to repel invasion.",
    "Doug Ducey has powers under the U.S. Constitution to go to war to repel it was welcome news to the leading Republican candidates vying to replace him next year.",
    "Now, given Brnovich's opinion, Robson plans to use the National Guard \"in as active a capacity as possible,\" said campaign spokesman Matthew Benson.",
    "In an op-ed he wrote for the Washington Times on Tuesday, Gaynor said, \"I will take aggressive action to the limits of my constitutional authority.\"",
    "Greg Abbott did last year, which he said would allow for more severe criminal penalties for people who are caught entering the country illegally.",
    "– Matthew Benson, spokesman for Karrin Taylor Robson\nLake welcomed Brnovich's opinion, but for her it doesn't change much.",
    "But he followed that by emphasizing that Arizona's resources are \"quite limited\" in comparison to the federal government.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "He doesn't think there was any question about the governor's authority even before the attorney general's opinion.",
    "Article IV, Section 4 of the Constitution charges the federal government with protecting the states from invasion.",
    "She also plans to constitute the Arizona State Guard to augment the National Guard presence at the border.",
    "All four candidates have made border security and illegal immigration focal points of their campaigns.",
    "For most of the GOP candidates, Brnovich's opinion echoes rhetoric they've been using for months.",
    "The \"invasion\" terminology has long been used by the nativist movement in Arizona and elsewhere.",
    "Robson's campaign didn't believe it would be much of a drain on the state's financial resources.",
    "Her border security plan has always included sending troops to the border, her campaign said.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "Ducey last year deployed about 150 National Guard troops to the border.",
    "My actions will depend on the situation on the ground at the time.\"",
    "Concerned about keeping quality reporting alive in Tucson?",
    "Support TucsonSentinel.com with a contribution today!",
    "- 30 -"
  ]
}