{
  "id": 8432,
  "mediaId": 261,
  "date": "d2022-05-29T02:39",
  "headline": "Former Detroit Police Chief James Craig files lawsuit over removal from August ballot",
  "image": "https://www.gannett-cdn.com/authoring/video-thumbnails/f6b3ac1b-76b2-4d1d-bf48-60013625da27_poster.jpg?width=660&height=371&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/elections/2022/05/28/james-craig-republican-gov-candidate-files-lawsuit/9967691002/",
  "sentiment": "0.0",
  "mediaOutlet": "Detroit Free Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Egan",
  "authorUrl": "https://www.freep.com/staff/2646657001/paul-egan/",
  "termIds": [
    651,
    1645,
    1844,
    3099,
    308,
    428,
    2645,
    2791,
    2842,
    6087
  ],
  "sentences": [
    "Elections staff found names of dead voters, voters who no longer lived at the address listed, multiple names clearly written in the same handwriting, and evidence of \"round tabling\" or \"round robining,\" in which multiple circulators pass around sheets, taking turns signing names so that the handwriting and ink does not match, according to reports released Monday.",
    "The tie votes had the effect of leaving five Republican candidates for governor off the ballot, based on determinations by Bureau of Elections staff that too many of the signatures each of them submitted with their nominating petitions were forged.",
    "Instead, they should have checked each signature against the Qualified Voter File and only thrown out those signatures that did not match, lawyers for some of the candidates, plus the Michigan Republican Party, argued Thursday before the board.",
    "The candidates' suits requested expedited consideration and alleged the Board of State Canvassers failed in its \"clear legal duty\" to check challenged signatures against the state's Qualified Voter File before disqualifying them as fraudulent.",
    "Front-running gubernatorial candidate and former Detroit Police Chief James Craig filed a lawsuit Saturday challenging the action of the Michigan Board of State Canvassers that took him off of the August primary ballot.",
    "The candidates blame hired signature collectors for the fraud, but also say state elections staff should not have discarded all signatures those circulators submitted.",
    "Craig's suit, filed with the Michigan Court of Claims, is the second lawsuit filed following Oakland County businessman, Perry Johnson, who filed Friday.",
    "The suits occurred after five Republican candidates for governor were excluded from the August primary ballot because of alleged fraudulent signatures.",
    "Election staff and the two Democratic board members countered that the onus is on candidates to vet signatures before submitting them.",
    "More lawsuits are expected from up to two of the three other Republican candidates for governor who were kept off the ballot.",
    "The presumption that signatures are valid is forfeited when a signature circulator intentionally commits fraud, they said.",
    "Those candidates are Byron Center businesswoman Donna Brandenburg and Grand Haven financial adviser Michael Markey.",
    "Additionally, the suits asked the courts to order the board to place Craig's and Johnson's names on the ballot.",
    "In a series of votes Thursday, the Board of State Canvassers deadlocked along partisan lines.",
    "Mike Brown, of Stevensville, has withdrawn from the race and said he will not go to court.",
    "Free Press breaking news intern Layla McMurtrie contributed to this report.",
    "Read more on Michigan politics and sign up for our elections newsletter.",
    "Contact Paul Egan: 517-372-8660 or pegan@freepress.com.",
    "A fourth candidate, Michigan State Police Capt.",
    "Follow him on Twitter @paulegan4."
  ]
}