{
  "id": 8663,
  "mediaId": 238,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Mich. GOP candidate ruled ineligible for ballot after fraudulent petitions",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/06/01/perry-johnson-michigan-governor-fraud-appeals/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amy B Wang",
  "authorUrl": "https://www.washingtonpost.com/people/amy-b-wang/",
  "termIds": [
    651,
    1147,
    1682,
    1844,
    2002,
    2171,
    2298,
    3075,
    3095,
    3099,
    5506,
    5546,
    311,
    428,
    6118,
    2645,
    2791
  ],
  "sentences": [
    "The elections bureau said it did not have reason to believe specific candidates or campaigns were aware that their petitions were being fraudulently circulated, but made their recommendations to disqualify five of them based on whether a candidate met the 15,000-signature threshold after invalid signatures were removed from their petitions.",
    "The disqualifications and legal challenges have upended the Republican primary race for Michigan governor two months before the August primary  and the reports of petition signature fraud come as former president Donald Trump relentlessly perpetuates the debunked, baseless claim that widespread voter fraud cost him reelection in 2020.",
    "The Wednesday ruling means Johnson cannot appear on the Aug. 2 primary ballot, and it probably does not bode well for the other would-be candidates  including former Detroit police chief James Craig and businessman Michael Markey  who had filed similar legal challenges to try to continue their campaigns.",
    "The bureau's investigation also found that Brandenburg's campaign submitted 11,144 invalid signatures and 6,634 facially valid ones; Brown's campaign submitted 13,809 invalid signatures and 7,091 facially valid ones; and Markey's campaign submitted 17,374 invalid signatures and 4,430 facially valid ones.",
    "Some of the fraudulent petition sheets tended to show no evidence of normal wear, or showed evidence of having been round-tabled, a practice in which each person in a group takes turns signing one line of a petition in an attempt to make the signatures appear authentic, the bureau said.",
    "The Michigan Court of Appeals has unanimously rejected a legal challenge from Perry Johnson, a former leading GOP candidate for Michigan governor, who was one of five Republicans disqualified from the ballot because of invalid signatures on their nominating petitions.",
    "Because Johnson bears the burden of demonstrating his entitlement to the requested writ  we conclude that his failure to show that the act requested is ministerial and his failure to show a clear legal duty on the part of the Board are fatal to his claim.",
    "According to the elections bureau, Craig's campaign submitted 11,113 invalid signatures and 10,192 facially valid ones, while Johnson's campaign submitted 9,393 invalid signatures and 13,800 facially valid ones, leaving both below the required threshold.",
    "In a May 23 report, the Michigan elections bureau found that five GOP candidates for the gubernatorial nomination were ineligible to appear on the primary ballot because they had submitted thousands of invalid signatures on their nominating petitions.",
    "Likewise, because the Board had the discretion to not check each and every signature submitted by the fraudulent-petition circulators, the act Johnson is seeking to compel defendants to perform is not ministerial in nature, the ruling stated.",
    "Democrats criticized the findings as proof  of a massive forgery scheme, while the campaigns for Johnson and Craig cast themselves as victims of signature gatherers who had circulated their petitions fraudulently without their knowledge.",
    "Last Thursday, the Board of State Canvassers, composed of two Democrats and two Republicans, met to discuss the elections bureau's report and deadlocked on a decision, resulting in the five candidates being disqualified for the ballot.",
    "Craig has sought to distance himself more from Trump's voter-fraud claims but has said he would support a thorough audit of the 2020 election results and would accept Trump's endorsement if it were offered to him.",
    "In its decision Wednesday, the Michigan Court of Appeals ruled that the Board of State Canvassers did not have a clear legal duty to check every single signature against the qualified voter file.",
    "State investigators identified 36 people who circulated petitions for their campaigns who submitted fraudulent petition sheets consisting entirely of invalid signatures, the bureau said.",
    "Johnson, Craig and Markey filed lawsuits with the appeals court afterward, arguing that all of the signatures on their petitions needed to be scrutinized individually.",
    "Johnson has said he shares Trump's concern about election security and attended a fundraiser with the former president for a fellow Republican at Mar-a-Lago in March.",
    "For five of the 10 GOP candidates, the fraudulent petition sheets meant they fell below the threshold of 15,000 valid signatures required to appear on the ballot.",
    "The elections bureau noted that this level of fraud  both in the number of invalid signatures submitted and the number of campaigns affected  was unprecedented.",
    "Those deemed ineligible included Johnson, Craig, Markey, Donna Brandenburg and Michael Brown, who immediately withdrew from the governor's race.",
    "A representative for Craig's campaign declined to comment Wednesday, saying they would do so when a decision on their own case came down.",
    "In a Twitter post, Brandenburg said she had been unlawfully removed from the ballot and solicited donations for help to fight this.",
    "The five remaining GOP gubernatorial candidates include Tudor Dixon, Ryan Kelley, Ralph Rebandt, Kevin Rinke and Garrett Soldano.",
    "Johnson's campaign did not immediately respond to a request for comment Wednesday.",
    "The family of former education secretary Betsy DeVos endorsed Dixon last week.",
    "Gretchen Whitmer (D), who is seeking another term.",
    "The Republican nominee will face Gov."
  ]
}