{
  "id": 8668,
  "mediaId": 261,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Disqualified Republican governor hopefuls battle it out in court",
  "image": "https://www.gannett-cdn.com/presto/2022/05/26/PDTF/19dc1eef-8d5a-4497-bcec-fe38c08ea5f0-candidates2.jpg?crop=723,407,x405,y550&width=723&height=407&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/2022/06/01/heres-where-republican-governor-candidates-appeals-stand-court/7459331001/",
  "sentiment": "0",
  "mediaOutlet": "Detroit Free Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arpan Lobo",
  "authorUrl": "https://www.freep.com/staff/4448999001/arpan-lobo/",
  "termIds": [
    651,
    1844,
    2171,
    3099
  ],
  "sentences": [
    "Here is where each remaining candidate's challenge currently stands:\nPerry Johnson\nJohnson filed a lawsuit Friday in the Michigan Court of Appeals alleging that the review of the signatures he submitted to qualify for the primary ballot violated state election law because a signature-by-signature review comparing the one on the petition with the one on the voter's registration file was not carried out.",
    "Because the board cannot verify every signature before the list of candidates must be finalized it must either declare the petitions are sufficient despite evidence that they contain thousands of fraudulent signatures or kick candidates off the ballot without having a chance to confirm the validity of each signature, the response states.",
    "Former Detroit Police Chief James Craig, Oakland County businessman Perry Johnson, Grand Haven financial adviser Michael Markey and Byron Center businesswoman Donna Brandenburg all failed to submit enough valid signatures to appear on the primary ballot, the Michigan Bureau of Elections concluded May 23.",
    "James Craig\nFollowing Johnson, Craig filed his lawsuit Friday night in the Michigan Court of Claims accusing the Bureau of Elections of engaging in illegal sampling by comparing some but not all of the suspected fraudulent signatures on the petition forms against the state's voter database.",
    "In the lawsuit filed with the Court of Appeals, Markey's campaign argues that the Bureau of Elections did not compare each of the 21,804 signatures submitted for the ballot with Michigan's Qualified Voter File, saying \"it cut corners,\" similar to the complaint filed by Johnson's campaign.",
    "Donna Brandenburg\nIn an email to the Free Press, attorney Daniel Hartman said the Brandenberg campaign will file a challenge to get on the August primary ballot, but as of 5:30 p.m. Tuesday, no such case could be located in either the Court of Appeals or Court of Claims online systems.",
    "More:State elections report: James Craig and Perry Johnson filed too few signatures for ballot\nAfter the Michigan Board of State Canvassers deadlocked 2-2 across party lines Thursday, the four candidates are currently slated not to appear on the primary ballot in August.",
    "Its members \"have, in good faith, reached different conclusions about the proper course to take in response to this novel and unprecedented situation\" and are \"prepared to follow the direction and determination of this Court.\"",
    "Michael Markey\nMarkey filed a lawsuit with the Michigan Court of Appeals Sunday to try and get on the primary ballot, naming the Secretary of State, Bureau of Elections and Board of State Canvassers as defendants.",
    "The race for four Republican governor hopefuls to be on the Aug. 2 primary ballot is hitting a crucial stretch as the Michigan Bureau of Elections aims to finalize the candidates appearing on the ballot by Friday.",
    "The board must declare the validity of nominating petitions submitted by candidates to qualify for the primary ballot and canvass those petitions to determine whether a sufficient number of voters signed them.",
    "If the board does not have time to carry out a more extensive signature review in time for the deadline to print ballots, Craig's lawsuit asks the court to order his name be placed on the primary ballot.",
    "\"The Board is not aware of any prior occasion upon which so many candidates for office submitted petitions containing so many apparently fraudulent signatures,\" the response states.",
    "Markey has asked the Court of Appeals to issue a relief injunction by Thursday  a day before the deadline set by the Bureau of Elections to finalize ballots for the August primary.",
    "In its response, the Board of State Canvassers called on the court to determine whether it has a legal duty to certify Craig for the primary ballot.",
    "Each of the four campaigns has either filed a legal challenge or has signaled intent to file a legal challenge in hopes of getting on the ballot.",
    "According to a report from the Bureau of Elections, more than 17,000 of the over 21,000 signatures submitted by Markey's campaign were invalid.",
    "Hartman said Monday the campaign challenges the Bureau of Election's claim that the campaign submitted more than 11,000 fraudulent signatures.",
    "\"...the Board requires direction from this Court as to how that duty is to be performed in this unprecedented situation.\"",
    "Johnson can reply to the board's response but the court may not wait for him to do so before ruling on the lawsuit.",
    "The Bureau of Elections also found issues with the signatures of a fifth candidate, Michigan State Police Capt.",
    "His lawsuit asks the court to direct state election officials to place his name on the primary ballot.",
    "In its response to the lawsuit, the Board of State Canvassers said it faces \"conflicting duties.\"",
    "The court indicated that the matter will be submitted for a decision without oral argument.",
    "He said the campaign's ongoing review has found some of the signatures to be valid.",
    "Craig has until 9 a.m. Wednesday to file a brief replying to the board's response.",
    "Michael Brown of Stevensville, but Brown has since dropped out of the race.",
    "Free Press staff writer Paul Egan contributed to this report.",
    "\"What is the Board to do?\"",
    "it asks in its response."
  ]
}