{
  "id": 1040,
  "mediaId": 2664,
  "date": "2022-02-16",
  "headline": "Jan. 6 panel subpoenas six people tied to pro-Trump fake electors plan",
  "image": "https://www.rawstory.com/media-library/arizona-republican-kelli-ward.jpg?id=24816075&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/bank/jan-6-panel-subpoenas-six-people-tied-to-pro-trump-fake-electors-plan/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Shutt",
  "authorUrl": "https://www.rawstory.com/u/jennifershutt-statesnewsroom",
  "termIds": [
    5846,
    2246,
    4539,
    4617,
    4905,
    3332,
    99,
    5949,
    6506,
    6386
  ],
  "sentences": [
    "The committee wrote that he claimed the election was “rigged;” helped arrange an event at a Phoenix hotel where he reportedly said “not only do we have ballots that are improper but we have an election system that’s been hacked;” and while in Washington, D.C. around the time of the Jan. 6 attack said he wanted “to deliver an evidence book and letter to Vice President Pence showing key evidence of fraud in the Arizona Presidential Election, and asking him to consider postponing the award of electors.”\nThe panel wrote to Cox that it would like information about how she reportedly witnessed Trump lawyer Rudy Giuliani pressuring “state lawmakers to disregard election results in Michigan” and saying that “certifying the election results would be a ‘criminal act.’”\nMastriano, who is running in Pennsylvania’s Republican gubernatorial primary, reportedly spoke with Trump following the election while Mastriano was participating in plans to select alternate electors to falsely claim the state’s Electoral College votes belonged to Trump.",
    "In the letter to Ward, the select committee said she “apparently spoke with former President Trump and members of his staff about election certification issues in Arizona.”\nShe also allegedly sent text messages to an Arizona election official stating “we need you to stop the counting” and telling the person to contact a lawyer for the Trump campaign after The Associated Press and Fox News declared President Joe Biden the winner of its Electoral College votes.",
    "“We understand you participated in these activities based on assertions of voter fraud and other asserted irregularities and based on a stated belief that under the U.S. Constitution the ‘state legislature has the sole authority to direct the manner of selecting delegates to the Electoral College,’” the committee wrote.",
    "The subpoenas are part of the Select Committee to Investigate the January 6th Attack on the United States Capitol’s efforts to gain a clearer understanding of why GOP officials and politicians in states Trump lost signed certificates for fake electors who attempted to declare Trump the victor.",
    "“We have an interest in understanding these activities and the theories that motivated them.”\nThe select committee wrote to Brown and Roman that it would like to discuss various false statements they made about Trump winning the 2020 election as well as their efforts to select fake electors.",
    "The select committee investigating the Jan. 6 attack on the U.S. Capitol issued subpoenas Tuesday for six people — including prominent Republicans in Arizona, Michigan and Pennsylvania — involved in planning slates of fake electors for former President Donald Trump.",
    "“The Select Committee has heard from more than 550 witnesses, and we expect these six individuals to cooperate as well as we work to tell the American people the full story about the violence of January 6th and its causes,” the Mississippi Democrat said.",
    "Chairman Bennie G. Thompson said in a statement the panel is “seeking records and testimony from former campaign officials and other individuals” who had relevant information about plans to select alternative electors.",
    "The six subpoenas issued Tuesday come less than a month after the select committee issued subpoenas for 14 people from seven states who participated as fake electors following the 2020 presidential election.",
    "Among those subpoenaed are Arizona Republican Party Chairwoman Kelli Ward, Arizona state Rep. Mark Finchem, former Michigan Republican Chair Laura Cox and Pennsylvania GOP state Sen. Doug Mastriano.",
    "Finchem, who was outside the Capitol on Jan. 6 and attended a QAnon conspiracy theory convention in Las Vegas, was allegedly involved in an array of activities following the 2020 election.",
    "The panel also issued subpoenas for Michael Roman and Gary Michael Brown, who were director and deputy director of Trump’s election day operations team.",
    "Louisiana Illuminator is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "The select committee has already issued a subpoena for Ward and her husband’s cell phone records from Nov. 1, 2020, through Jan. 31, 2021.",
    "Ward has sued in federal court in an attempt to block her cell phone company, T-Mobile, from turning over the records.",
    "Contact Editor Jarvis DeBerry for questions: info@lailluminator.com.",
    "Those bogus electors claimed Trump won states he had, in fact, lost.",
    "Louisiana Illuminator maintains editorial independence.",
    "Follow Louisiana Illuminator on Facebook and Twitter."
  ]
}