{
  "id": 11010,
  "mediaId": 2578,
  "date": "2022-03-07",
  "headline": "(VIDEO) Interview With Mike Lindell At Arizona Gubernatorial Candidate Kari Lake’s Rodeo Rally: “You Legislators Out there, You’re Going to Be a Traitor or a Hero”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/6A1769B1-10AE-4FFF-934F-572A0185C91F.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/03/video-interview-mike-lindell-arizona-gubernatorial-candidate-kari-lakes-rodeo-rally-legislators-going-traitor-hero/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    2706,
    4267,
    4669,
    2370,
    5949
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\n***To support Mike Lindell and benefit Gateway Pundit, use promo code TGP at MyPillow.com — and get up to 75% off!",
    "My Pillow founder and CEO Mike Lindell spoke to thousands of patriots on Saturday at Trump-endorsed Arizona gubernatorial candidate Kari Lake’s rock and roll rodeo rally in Morristown, Arizona.",
    "Citing the massive evidence of fraud and doubt in elections, Arizona State Representative Mark Finchem introduced a resolution to decertify the fraudulent 2020 election in Arizona last month.",
    "Because if you’re not gonna pull down these states, if you’re not going to do your job, you had a chance a year over a year ago, you’ve got a second chance now.",
    "Following his statewide investigation, former Wisconsin Supreme Court Justice Michael Gableman also called to decertify the fraudulent Wisconsin 2020 election.",
    "I tell him it’s been a miracle that it didn’t get overturned way back a year ago because if it did, we wouldn’t have found all these great new candidates.",
    "All this stuff is bubbling up, and what I say about the legislators is that you’re either going to be two things, a traitor, or you’re going to be a hero.",
    "And also, if you’re a county clerk or commissioner, or you know of one, have them fill out the form there because they can be a plaintiff on this lawsuit.",
    "I can be out there on the frontlines of getting rid of these machines and getting new candidates that are going to come in and help get our country back.",
    "I know others of you out there want to help out with the offense fund, you can go to Lindelllegalfund.org and you can help out there.",
    "Lindell: Well, then we’ve got a class-action lawsuit that I’ve been working on for five months, and all these machines are defective!",
    "Kari, I mean, she used to work for terrible Fox News who doesn’t say anything, and she just got tired of not being able to talk.",
    "People that quit their job sacrifice everything because they need to do what’s right, and that’s what I really like about Kari.",
    "***\nThe Arizona election audit discovered evidence of hundreds of thousands of illegitimate votes and election law violations.",
    "Lake is the only candidate for governor who is America first and has the courage to speak about the stolen 2020 election.",
    "Like if you buy a car and you’re driving a car, and you go turn to the right, and it turns to the left, that’s a defect.",
    "Lindell: You can support the lawsuit by going to frankspeech.com, going there, and going down and signing the petition.",
    "The Gateway Pundit reported on Kari Lake’s rodeo rally, and her promise to get to the bottom of what happened in 2020.",
    "The most important lawsuit ever, because it’s going to get rid of the machines, they’re going to be deemed defective.",
    "But you guys have all been great out there because I’ll tell you, my 2700 employees thank each and every one of you.",
    "Within about two weeks, it’ll be launched, the biggest class-action lawsuit in American history and world history.",
    "You guys are great supporters of My Pillow, use promo code TGP, and you can save up to 66% on all the products.",
    "Everyone knows everything’s there, all the crime’s there, the crimes are in front of them, they’ve seen it all.",
    "And if they don’t, they’re as guilty as the cover-up as the people that did this to our states and our country.",
    "All evidence has been delivered to the Arizona Attorney General, and Arizona is waiting for arrests.",
    "Lindell: When I talked to him, we talk about this all the time, and we say what a miracle it’s been.",
    "Lindell spoke about the stolen election in Arizona and his lawsuit to ban machines from elections.",
    "TGP correspondent Jordan Conradson spoke to Mike Lindell about the fight for decertification.",
    "What has President Trump said to you about these brave state legislators across the country?",
    "They’re supposed to give you elections, a fair election, a one vote, one in one out.",
    "And I look at what they’ve done for this country with the election that was stolen.",
    "And I think it’s amazing that she, in spite of quitting her job, she quits her job.",
    "If you just want to help out, everyone you can buy My Pillows, all my products.",
    "And I’m grateful that I don’t have to sit and worry about my company.",
    "Conradson: We have a lot of traitors, a lot of treasonists out there.",
    "Lindell: Because she’s got common sense, and she’s an amazing person.",
    "Conradson: Arizona is getting ready to decertify, so is Wisconsin.",
    "There’s no in-between this time, you legislators out there.",
    "We wouldn’t have found all the cowards that are out there.",
    "It’s traitors vs. heroes in the fight to decertify 2020.",
    "You guys have one right there at The Gateway Pundit.",
    "The RINOs, we wouldn’t have found out the criminals.",
    "And they got to do it, they got to pull them down.",
    "This is gonna be the biggest class-action lawsuit.",
    "Conradson: We’re here at Kari Lake’s Rodeo Rally.",
    "What’s next if we can’t get the RINOs on board?",
    "None of them, no Dominion, ESNS, Smartmatic.",
    "Conradson: How can we help your lawsuit?",
    "That is why Lindell endorsed Kari Lake.",
    "They were built to steal your country.",
    "How can we support you, Mr. Lindell?",
    "And I’ve endorsed seven candidates.",
    "She’s gonna make a great governor.",
    "Zero in-between, traitor or hero.",
    "Why do you support Kari Lake?",
    "You’ve helped out so much.",
    "This is a product defect.",
    "None of them do that.",
    "They’re all the same.",
    "Recent Posts\nContact",
    "Use the promo code.",
    "I think it’s TGP."
  ]
}