{
  "id": 1129,
  "mediaId": 8475,
  "date": "2022-02-15",
  "headline": "Finchem, Ward subpoenaed by Congress over Trump efforts to overturn election",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/021522finchem_ward.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/021522_finchem_ward_jan6/finchem-ward-subpoenaed-by-congress-over-trump-efforts-overturn-election/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dylan Smith",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/1",
  "termIds": [
    0
  ],
  "sentences": [
    "According to the Select Committee to Investigate the January 6th Attack on the United States Capitol, Finchem was subpoenaed because he \"advanced unsubstantiated claims about the election and helped organize an event in Phoenix, Arizona on November 30th, 2020 at which former President Trump's legal team and others spoke and advanced unproven claims of election and voter fraud.",
    "Ward \"apparently acted as a purported Electoral College elector,\" wrote U.S. Rep. Bennie Thompson, chair of the Jan. 6 Committee, in a letter sent to Ward on Tuesday about the new subpoena, as well as reportedly encouraging an election official to \"stop the counting\" so that the result would favor Trump.",
    "The individuals included in the latest batch of subpoenas for records and interviews were reportedly among the Donald Trump supporters involved in sending slates of so-called \"alternate electors\" to Congress to be included in the electoral votes cast for president in the 2020 election.",
    "Ward was subpoenaed because she \"reportedly spoke to the former president and members of his staff about election certification issues in Arizona and acted to transmit documents claiming to be an 'alternate' Electoral College elector from Arizona,\" the committee said.",
    "Finchem has acknowledged being present at the U.S. Capitol around the time of the violent riot that caused a temporary halt to the formal tally of votes for president, although he has said he did not join those who entered the building.",
    "Both Finchem and Ward have been outspoken Trump supporters and backed the drawn-out and bumbling \"audit\" of the election in Maricopa County, hewing to the conspiracist line that the election was \"stolen\" from the former president.",
    "Two Arizona Republicans are among six people issued subpoenas Tuesday by the House Jan. 6 Committee, with state Rep. Mark Finchem and state GOP Chair Kelli Ward told to turn over documents and appear for depositions next month.",
    "Laura Cox, the former chair of the Michigan GOP, who reportedly witnessed Rudy Giuliani pressure Michigan lawmakers to disregard election results and say that certifying the election results there would be a \"criminal act.\"",
    "The Select Committee has heard from more than 550 witnesses, and we expect these six individuals to cooperate as well as we work to tell the American people the full story about the violence of January 6th and its causes.\"",
    "\"We're seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans.",
    "Ward, who served a single term in the state Senate before twice unsuccessfully seeking the nod from GOP voters in U.S. Senate primaries, has been the chair of the state Republican Party since 2019.",
    "\"The Select Committee is seeking information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election,\" Thompson said in a news release.",
    "Douglas V. Mastriano, who was part of a plan to arrange for an \"alternate\" slate of Trump electors from Pennsylvania, who reportedly spoke with Trump about post-election activities.",
    "The others subpoenaed Tuesday are:\nMichael A. Roman and Gary Michael Brown, as the director and deputy director of Election Day Operations for Trump's 2020 campaign.",
    "Finchem, a member of the state House from Oro Valley, is running in the Republican primary to be Arizona secretary of state — the office that oversees elections.",
    "He was in Washington on January 6th, 2021 and stated that he had evidence to deliver to Vice President Pence in an effort to postpone the awarding of electors.\"",
    "Finchem was instructed to appear for a deposition on March 15, with Ward told to appear to be questioned on March 8.",
    "The phone records of Ward and her husband were already subpoenaed earlier this month by the committee.",
    "Neither Ward nor Finchem made a public response to the subpoenas on Tuesday afternoon.",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "Join James Standring, David & Joy Schaller, and Robert Rogers and contribute today!",
    "They filed suit to block those documents from being turned over.",
    "- 30 -"
  ]
}