{
  "id": 11405,
  "mediaId": 2520,
  "date": "2022-03-12",
  "headline": "I'm a Democrat who infiltrated the Republicans",
  "image": "https://www.gannett-cdn.com/presto/2022/01/22/NOKL/b34a7967-6788-4bec-a2c0-f6932b753096-elephantfam.jpg?crop=1289,725,x102,y143&width=1289&height=725&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/2022/03/12/democrat-republican-politics-elections-government/9442030002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Grodsky",
  "authorUrl": "",
  "termIds": [
    5525,
    5037,
    3838,
    4325,
    3294,
    2246,
    1126,
    392
  ],
  "sentences": [
    "So I went to engage with Republicans in hopes of identifying collaborative ways to elevate moderates in their party primaries - funding PACs, working together to dismantle radical candidates and elected officials, establishing sound communications strategies, nationwide candidate recruitment, and more.",
    "Why this Democratic Party official attend a Republican-leaning conference: I wanted to help\nBy Matt Grodsky\nWith the threat of authoritarianism looming and a hostile faction threatening a democratic nation, it is incumbent upon us to support and coordinate with the insurgency.",
    "The event included Rep. Adam Kinzinger, David Frum, Bill Kristol, Charlie Sykes, Maricopa County Recorder Stephen Richer, and it honored heroes like U.S. Capitol Police Officer Harry Dunn and Lt. Col. Alexander Vindman.",
    "That’s why I traveled to Washington, D.C., to take part in the Principles First conference, a gathering of moderate Republicans many of whom are actively working to restore the GOP and cleanse it of Trumpism.",
    "Most of the people I interacted with identified themselves as being lost in the political wilderness, cut out of today’s GOP but still beholden to the traditional principles of their pre-Trump party.",
    "I am describing Democrats supporting Republican refugees within the insurgency of the GOP, people who belonged to the party of Reagan and now find themselves impressed into the party of Trump.",
    "I’m not doing this because I support the policies of the traditional Republican Party, nor am I doing this because I want more obstructionists in moderate clothing (see our senior senator).",
    "When I asked people why they didn’t just leave their party to become Democrats or independents, many of them, like my Republican colleague Adrian Bakke, answered “Because I was here first.",
    "In fact, when I was the director of communications for the Arizona Democratic Party in 2020, speaking to this audience, was a key component of our strategy and it paid off.",
    "It impairs our ability to legislate and puts us on a burning high-wire every election cycle, repeatedly presenting the stark choice between authoritarianism and democracy.",
    "I don’t root for GOP to self-destruct\nSome of my Democratic colleagues might wonder why this was a worthwhile endeavor for someone working to elect Democrats?",
    "But our most concrete areas of common ground were that Jan. 6 was an insurrection, Trumpism is bad, Putin is evil, and “Let’s go Brandon” is a dumb slogan.",
    "We need to help them reclaim their party so that we can get back to competing against people we disagree with, not people hell bent on upending democracy.",
    "Political parties have shifted and evolved throughout our history, but members of both sides ultimately always worked together for our common interests.",
    "Had someone like Arizona state Rep. Mark Finchem been handling things in Georgia, 2020 would have ended with substantially more drama.",
    "I want us to have a voter registration advantage in Arizona, I want our commonsense policies adopted at the state and federal level.",
    "Yet that’s what we have been seeing in our elections – one party endeared to our democratic norms, the other overrun by fanatics.",
    "In that scenario, we had better be sure the right kind of Republican is holding key elected offices when democracy is threatened.",
    "In the event the Trump fever doesn’t break before 2024, forgotten Republicans in their party should reach out to Democrats.",
    "He is a Democratic precinct committeeman in Legislative District 28 and an Arizona Democratic Party state committee member.",
    "I want to elevate GOP moderates\nIt is not inevitable that the Republicans of yore will reclaim their party without help.",
    "Our democracy works best with a two-party system, in which both bodies operate in good-faith for the best of our nation.",
    "This is my party, I can’t abandon it to this.”\nI had plenty of disagreements with attendees on a myriad of issues.",
    "He previously served as the director of communications for the Arizona Democratic Party from 2019 to 2021.",
    "You wouldn’t want a professional basketball team to play in the finals against a team of suicide bombers.",
    "They have isolated the moderates in their ranks who still believe in our democratic-republic.",
    "Matt Grodsky is vice president and director of public affairs at Matters of State Strategies.",
    "So while I work to elect Democrats, I also want to help eliminate extremists from the GOP.",
    "We have never had one party with such blatant anti-American sentiment as the modern GOP.",
    "Many Republicans are being held hostage within their party by radical elements.",
    "This has led to the Democratic Party being the only safe option for voters.",
    "Both parties have their bad eggs, but only one has been hijacked by them.",
    "Several voiced support for President Joe Biden and democratic policies.",
    "Bush has been overrun by Putinites, insurrectionists and conspirators.",
    "Most notably, they recognized the value of a strong two-party system.",
    "Yes, there has been political warfare since the founding of America.",
    "Most of these hostages are willing and able to build a coalition.",
    "One bad performance for Democrats could send us into the abyss.",
    "But I also want what’s best for our republic in the long term.",
    "Coalitions are what bring change, not one-party messaging.",
    "There were many like-minded people at Principles First.",
    "It should not be assumed that they identify with them.",
    "I encourage Democrats to reach back across the chasm.",
    "Shouldn’t I be enjoying the implosion of the GOP?",
    "This is not sustainable for our government.",
    "The reality is the GOP is not a monolith.",
    "One-party dominance is not the answer.",
    "Trust me, I want Democrats to win.",
    "Follow him Twitter: @mattgrodsky.",
    "What’s happens when Dems lose?",
    "I’m not talking about Ukraine.",
    "The party of George H.W.",
    "No."
  ]
}