{
  "id": 1219,
  "mediaId": 8295,
  "date": "2022-02-16",
  "headline": "Finchem, Ward targets of new subpoenas by committee probing Jan. 6 attack",
  "image": "https://cronkitenews.azpbs.org/wp-content/uploads/2020/02/KelliWard-800.jpg",
  "link": "https://cronkitenews.azpbs.org/2022/02/16/finchem-ward-targets-of-new-subpoenas-by-committee-probing-jan-6-attack/",
  "mediaOutlet": "cronkitenewsonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Sacia",
  "authorUrl": "https://cronkitenews.azpbs.org/people/emily-sacia/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I think it’s a command that you appear before them.”\nThe committee said the latest subpoenas targeted people who knew of plans to send lists of false electors to Congress, in hopes they would be counted for Trump instead of President Joe Biden, or who “participated in efforts to … otherwise delay or interfere with the certification of the legitimate 2020 election results.”\nThe Finchem subpoena mentioned his organization of “a purported hearing” where a handful of state lawmakers listened to Trump campaign officials and supporters spin “unproven claims of election and voter fraud.” It also noted that in the days and weeks after the election, Finchem, a Tucson Republican, repeatedly “advanced unsubstantiated claims” about the election being rigged, hacked, swayed by foreign powers and that voters had been “robbed.”\nThe subpoena also noted that Finchem was in Washington on Jan. 6, and asked about his communication with rally planners and statements that he hoped to deliver an “evidence book and letter” to urge former Vice President Mike Pence to delay certification of Biden’s win.",
    "WASHINGTON – The committee investigating the Jan. 6 attack on the Capitol subpoenaed Arizona Republican leader Kelli Ward and Rep. Mark Finchem for “information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election.”\nBesides public statements by the two that the election was stolen, the committee said it is interested in Ward’s communications with the White House, and Finchem’s involvement in the planning of the Jan. 6 rally that led to the attack.",
    "In a statement released by his legislative office just days after the Capitol attack, Finchem confirmed his presence in Washington but said claims that he was involved in the assault were “wildly fictitious and a slanderous fabrication.” He said he was at the back of the crowd marching toward the Capitol, where he planned to speak, and was not even aware there had been a violent breach until several hours later.",
    "Handing records of GOP officials and supporters over to a committee “formed and chaired by political rivals” at a highly partisan time would chill the right to associate “not just of the plaintiffs but of the entire Republican Party in Arizona.”\nLawyers representing the Wards said earlier this month that they would not comment on the suit.",
    "“The Select Committee has heard from more than 550 witnesses, and we expect these six individuals to cooperate as well as we work to tell the American people the full story about the violence of January 6th and its causes,” said Rep. Bennie Thompson, D-Miss., in a statement released Tuesday.",
    "Send the elector choice back to the legislatures.”\nOn Jan. 19, the committee subpoenaed T-Mobile phone records from Nov. 1, 2020, to Jan. 31, 2021, for a number used by Ward, her husband and Mole Medical Services P.C., the medical business owned by the Wards.",
    "The couple filed suit in federal district court on Feb. 1, claiming that the subpoena should be quashed because it would expose medical records of their patients and because it would infringe on their First Amendment right to freely associate.",
    "Besides Ward and Finchem, the committee subpoenaed Michael Roman and Gary Michael Brown, campaign officials for former President Donald Trump, Pennsylvania state Sen. Doug Mastriano and former Michigan Republican Chair Laura Cox.",
    "It also said she texted Arizona election officials in the aftermath of the election in an attempt to get them to stop counting and that she was in contact with Trump and his staff about ballot certification in Arizona.",
    "The subpoena said that Ward met on Dec. 14, 2020, with other Trump supporters who posed as electors, sending Congress their names and claiming to be the proper Electoral College representatives of Arizona.",
    "“There’s a big portion of the Republican right, who doesn’t view this commision as legitimate.”\nBender said that will be of little help to Ward and Finchem, who are faced with congressional subpoenas.",
    "He said it could be particularly helpful for Finchem, a secretary of state candidate who is currently “the front-runner on the Republican side.” Finchem’s candidacy has been endorsed by Trump.",
    "They were two of six subpoenas issued Tuesday, and not the first directed at Ward, who has gone to court to block release of her phone records in response to a subpoena last month.",
    "“That’s a confrontation in which the public official is likely to lose because these committees have an enormous amount of authority to inquire into these things.”",
    "“Honestly, I wouldn’t be surprised if this has the effect of helping him out even more with some of those Trump voters in his primary,” Coleman said.",
    "All six have until March 1 to produce documents requested in the subpoenas, which then set dates in early March for them to appear for depositions.",
    "While Ward has challenged the subpoena of her phone records, one legal expert said it might be harder for her to stall the latest round.",
    "Far from harming Ward and Finchem, the subpoenas against them could end up painting the two as “martyrs” to Arizona Republicans, said J.",
    "But the chairman of the House Select Committee investigating the Jan. 6 attack said he expects compliance with the latest subpoenas.",
    "“It’s rare that a public official will say to the committee, ‘We’re not going to do what you asked us to do,'” Bender said.",
    "“It’s a request and I think it’s more than a polite request,” said Paul Bender, an Arizona State University law professor.",
    "Trump supporters had hoped to call the election into question and then use the false electors to deny Biden the win.",
    "The Ward subpoena claims she made the same repeated false assertions of election fraud as Finchem and the others.",
    "T-mobile said it would turn the records over by Feb. 4 unless the Wards took legal action to block the subpoena.",
    "Miles Coleman, an analyst with Sabato’s Crystal Ball at the University of Virginia Center for Politics.",
    "The committee said it wanted to “better understand these and other statements” attributed to Finchem.",
    "The subpoena noted that as the Capitol was under attack, Ward tweeted that “Congress is adjourned.",
    "Calls Wednesday to Ward’s and Finchem’s offices were not immediately returned.",
    "Ward is scheduled for deposition on March 8, Finchem on March 15.",
    "No action had been taken on that complaint by Wednesday.",
    "They were not."
  ]
}