{
  "id": 1272,
  "mediaId": 2636,
  "date": "2022-02-11",
  "headline": "The Traveling Trump Show",
  "image": "https://static01.nyt.com/images/2022/02/11/multimedia/11onpolitics-photo01/11onpolitics-photo01-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/11/us/politics/trump-rally-texas.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5207,
    5531,
    2240,
    2246,
    4571,
    4905,
    2765,
    5949,
    6222
  ],
  "sentences": [
    "In Hidalgo, there were FJB bumper stickers in the parking lot — JB for Joe Biden, F for an expletive — along with flags proclaiming “Stolen, Rigged, Fraud, Election 2020.” T-shirts read, “Don’t California My Texas.”\nOne speaker referred to President Biden as “this freak in the White House,” adding that the “people in charge hate you and hate freedom.”\nChristie Hutcherson, one of the organizers, described the event as nonpolitical, claiming the focus was on the “humanitarian effort” to save children who were crossing the border illegally with the help of coyotes, as human smugglers are called in the border region.",
    "She claimed, without evidence, that young children were being kidnapped and killed for “organ harvesting.”\nMs. Hutcherson, the founder of Women Fighting for America, a group that describes part of its mission as protecting values and spreading “biblical truth,” referred to herself as a “mama bear.” Countless other speakers and attendees embraced the moniker.",
    "‘Don’t poke the mama bears’\nThe event held late last month in the Rio Grande Valley — which featured a parade of conservative stars, including Ted Nugent and Michael Flynn, Trump’s former national security adviser — was just one of many right-wing symposiums and conferences that are happening across the country on a nearly weekly basis.",
    "I am here for the unborn and born babies.”\nAnother woman who declined to give her name as she marched said she was “disgusted by open-border Democrats who don’t care about what is happening to the children.”\nThe group was accompanied by one man with a military-style rifle strapped across his chest.",
    "On a stage in the South Texas border city of Hidalgo, they blamed the lackluster crowd on liberal media and activists, claiming that they maliciously swiped up the free tickets that had been intended for veterans and law enforcement officials to keep the seats empty.",
    "On Thursday, once we had landed following the 20-minute flight from Joint Base Andrews, we lined up against the edge of the tarmac to capture the president’s arrival on Marine One, which is one of three identical Sikorsky VH-3D Sea Kings.",
    "Although President Biden typically flies on Air Force One, when we travel to smaller regional airports that are too small to handle the big plane or are close enough to Washington, the presidential envoy will use a series of helicopters.",
    "You aren’t supposed to know which helicopter the president is riding, so I photographed a series of images as people pressed up against the glass with their cameras and smartphones as Marine One began to approach.",
    "Thousands of people throughout France, motivated by demonstrations in Canada, have traveled to Paris “to protest the country’s vaccine pass and other grievances like rising gas prices,” Aurelien Breeden reports.",
    "HIDALGO, Texas — Organizers of the three-day We Stand America gathering were clearly frustrated on Day Two: In an arena built to accommodate thousands of spectators, only a few hundred people had shown up.",
    "“We’re fed up and you’ve messed with the wrong people.”\nRepublican gains\nRepublicans have been making inroads in South Texas, a majority-Hispanic region that had been a Democratic stronghold for decades.",
    "On Thursday, Al Drago watched Marine One, the presidential helicopter, arrive at a regional airport in Brandy Station, Va., as President Biden traveled to an event about prescription drug prices.",
    "The Republicans who were outraged over Hillary Clinton’s private email server have been silent on Donald Trump’s handling of government records, report Lisa Lerer and Katie Rogers.",
    "Maria Elena Veliz, a resident of nearby Edinburg and one of the local conservatives in the crowd at the Sunday protest, sat on a chair at the edge of the scene.",
    "Typically, Secret Service, White House staff and the press pool will fly ahead in four V-22 Nighthawk Ospreys, operated by Marine Helicopter Squadron One.",
    "“Not since Hitler himself have we seen evil come across the country,” said Mark Finchem, an Arizona lawmaker who is running for secretary of state there.",
    "And while Biden won in other more populous counties along the South Texas border, including Hidalgo County, many voters swung sharply toward Trump.",
    "She said she has attended protests at a local abortion clinic weekly for more than a decade in her own effort to stop women from having abortions.",
    "The crowd at the We Stand America events, however, seemed to have more out-of-towners than locals and more white participants than Hispanic ones.",
    "The center, the victim of right-wing misinformation spreading online, had closed down that weekend because of threats and security concerns.",
    "The Traveling Trump Show\nPro-Trump rallies and conferences have taken on the flavor of religious revival, a mix between protest and party.",
    "What to read\nThe Biden administration warned that Russia could “mount a major assault on Ukraine at any time,” Katie Rogers reports.",
    "Here’s the story behind this image:\nThe president usually travels with multiple helicopters, in part as a security measure.",
    "In 2020, Trump won Starr County, a rural community along the border that he had lost back in 2016 by 33 percentage points.",
    "He described Arizona’s current top elections official as both a “demon” and “a plant” (and not the horticultural variety).",
    "The conferences illustrate how Trump and his false claims about the election have become a culture as much as a cause.",
    "There are tailgate parties and barbecues and prayer services, the threads that make up the social fabric of Trumpism.",
    "“I am not one of these people who thinks anything you do is right, that we can make excuses for it,” she said.",
    "Many attendees flew in from Albuquerque and Phoenix, or drove down from Dallas and Oklahoma City.",
    "The highlight of the three days for many of them was a Sunday morning march to the border fence.",
    "Protesters prayed to “stop slave trading on our borders.” Some raised their hands in the air.",
    "viewfinder\nWatching the president\nOn Politics regularly features work by Times photographers.",
    "They prayed when they arrived at the fence, in an area near the National Butterfly Center.",
    "I joked to a fellow photographer that the small boy probably had a better camera than me.",
    "Within minutes, there were multiple false claims that the 2020 election had been stolen.",
    "These events are something akin to religious revivals, a mix between protest and party.",
    "The press pool cast a shadow on the terminal windows, giving us a glimpse inside.",
    "I noticed a bit of cloud cover, causing the light to change every few moments.",
    "“Don’t poke the mama bears,” said one woman, who declined to give her name.",
    "With their massive rotating turboprops, they make for quite the spectacle.",
    "1 issue and I will do anything to support people who agree with me.",
    "It was only the first conspiracy theory of the day.",
    "A few got down on their knees on the dirt hill.",
    "And they closed by singing Amazing Grace.",
    "There’s anger, but also celebration.",
    "Others held American flags.",
    "“That is my No."
  ]
}