{
  "id": 1328,
  "mediaId": 8350,
  "date": "2022-02-15",
  "headline": "Jan. 6 panel subpoenas Arizona Republicans Finchem, Ward in fake electors scheme",
  "image": "https://ktar.com/wp-content/uploads/2022/02/MicrosoftTeams-image-100.jpg",
  "link": "https://ktar.com/story/4890630/jan-6-panel-subpoenas-arizona-republicans-finchem-ward-in-fake-electors-scheme/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KTAR.COM",
  "authorUrl": "https://ktar.com/story/author/ktar-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Select Committee issued 6 subpoenas:\n•Michael A. Roman\n•Gary Michael Brown\n•Douglas V. Mastriano\n•Laura Cox\n•Mark W. Finchem\n•Kelli Ward\n— January 6th Committee (@January6thCmte) February 15, 2022\n“The Select Committee is seeking information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election,” Mississippi Rep. Bennie Thompson, the committee’s Democratic chairman, said in a statement.",
    "“We’re seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans.”\nThe individuals subpoenaed also include Michael Roman and Gary Michael Brown, who served as directors for Trump’s 2020 reelection campaign.",
    "The latest subpoenas come more than a month after the committee issued subpoenas to 14 people over the submission of false Electoral College certificates declaring Trump the winner of Arizona, Georgia, Michigan, New Mexico, Nevada, Pennsylvania and Wisconsin.",
    "PHOENIX — The House committee investigating the U.S. Capitol insurrection subpoenaed two Arizona Republicans on Tuesday over the efforts to falsely declare Donald Trump the winner of the 2020 election in several swing states.",
    "The panel is seeking testimony and records from several individuals who they say had knowledge of or participated in efforts to send false “alternate electors” in seven of the states President Joe Biden rightfully won.",
    "State Rep. Mark Finchem and GOP Chair Kelli Ward were among the six former Trump campaign members as well as state elected officials singled out in the latest round of subpoenas.",
    "The committee believes the two men reportedly promoted allegations of election fraud as well as encouraged state legislators to appoint false slates of electors.",
    "The Select Committee demands info on efforts to send false \"alternate electors\" and otherwise interfere with election certification.",
    "The Associated Press contributed to this report.",
    "Share\nComments"
  ]
}