{
  "id": 1399,
  "mediaId": 2520,
  "date": "2022-02-16",
  "headline": "Jan. 6 congressional committee subpoenas Kelli Ward, Mark Finchem",
  "image": "https://www.gannett-cdn.com/presto/2022/02/15/PPHX/ba4e37b8-5700-4d7a-a43c-11b2671a8f9c-pjimage_2.jpg?crop=1274,717,x5,y0&width=1274&height=717&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/02/15/jan-6-committee-subpoenas-kelli-ward-mark-finchem-over-2020-election/6804440001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Richard Ruelas",
  "authorUrl": "https://www.azcentral.com/staff/2646488001/richard-ruelas/",
  "termIds": [
    0
  ],
  "sentences": [
    "The subpoena to Ward mentions a text message she sent in the days after the election asking a Maricopa County Supervisor to “stop the counting.”\nIt also asserts that she spoke with Trump and members of his staff about “election-certification issues in Arizona.” The subpoena says the committee knows that because of documents in possession of the Select Committee.",
    "The U.S. House committee investigating the Jan. 6, 2021, incursion of the U.S. Capitol issued subpoenas on Tuesday to state Rep. Mark Finchem and Kelli Ward, the chair of the Republican Party of Arizona, asking for documents and testimony related to their efforts to upend the 2020 election results.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nInstead, Finchem held an unofficial meeting on Nov. 30 at the Phoenix Hyatt Regency.",
    "News of that reverberated through the crowd that was marching from a Trump speech nearby to the U.S. Capitol leading to chants of “hang Mike Pence.”\nPence and other lawmakers were hustled out of the chambers and into secure areas as rioters breached the Capitol buildings.",
    "She said that the 11 electors who met at the state party headquarters were the “only slate of 11 you need to worry about—ignore the ‘others.’”\nWard, in a video that was posted on the state party’s YouTube channel the day after the ceremony, explained the process.",
    "Bowers, in a statement, called the proposal “obviously unconstitutional and profoundly unwise.”\nThe Select Committee on Tuesday issued subpoenas to two Trump campaign officials, as well as people involved in decertification efforts in Pennsylvania and Michigan.",
    "The two Trump campaign officials, Michael Roman and Gary Michael Brown were, according to the subpoena, part of a \"coordinated strategy\" to ask Republican lawmakers in certain states to \"reclaim\" their authority by sending alternate slates of electors.",
    "The subpoenas mark the latest efforts by the Select Committee to unearth the behind-the-scenes machinations, in Arizona and other states, meant to engineer a second term as president for Donald Trump despite his loss in the 2020 election.",
    "In early February, Finchem introduced a resolution that, if passed by the Legislature, would have decertified the election results in the three Arizona counties that encompass the metropolitan areas of Phoenix, Tucson and Yuma.",
    "Ward was among 11 Republicans who signed their names to a document falsely asserting they represented Arizona’s official votes in the Electoral College, the mechanism set out in the U.S. Constitution that picks the president.",
    "Ward, and the other 10 Arizona Republicans, filed suit against Pence, asking the courts to require him to hew to what they saw as his Constitutional authority to decide which electors to count.",
    "It was after that hearing that Giuliani pitched Arizona legislative leaders on the idea of casting out the election results and voting to simply appoint the Republican electors.",
    "Arizona’s alternate slate of electors represented the 11 Republicans who would have been the state’s official electors had former President Donald Trump carried Arizona.",
    "Finchem helped organize an unofficial marathon hearing at a downtown Phoenix hotel that included testimony from Trump attorney and former New York Mayor Rudy Giuliani.",
    "The subpoena to Finchem mentions communications he had with organizers of a “Stop The Steal” rally that had been planned at the U.S. Capitol on Jan. 6, 2021.",
    "Ward, in statements in December 2020, signaled that she expected the document to be part of a plan that could have reversed President Joe Biden’s victory.",
    "Still, all 11 Republicans met at the state Republican Party headquarters on Dec. 14, 2020, to cast a shadow vote for Trump and Vice President Mike Pence.",
    "Finchem was one of the earliest and loudest proponents of false claims of irregular election activity, what coalesced as the “Stop the steal” movement.",
    "Jake Angeli, who would become infamous as he stormed the Capitol on Jan. 6 bare-chested and with a horned hat, attended in a suit and tie.",
    "The Jan. 6 Select Committee has also subpoenaed the two Republicans who signed the false elector document as the chair and secretary.",
    "That document was sent to the U.S Senate avowing that those who signed it were Arizona’s “duly elected and qualified” electors.",
    "Ward, in a video posted on Dec. 29, 2020, described the lawsuit as a “friendly” gesture that aimed to clarify Pence’s powers.",
    "She and her husband, Michael Ward, who also was one of the 11 Trump electors, filed a lawsuit looking to block that subpoena.",
    "Pence announced on Jan. 6 that he would count the official votes sent to him and that he had no power to do so otherwise.",
    "“What happens when the People feel they have been ignored, and Congress refuses to acknowledge rampant fraud,” he wrote.",
    "The day after that hearing, Giuliani asked Bowers to call a special session to overturn the certified election results.",
    "The subpoena says the committee also knows about those communications because of documents it has in its possession.",
    "The committee had previously sought cell phone records of Ward from her cell phone service provider, T-Mobile.",
    "A second group of Republicans also met in early December and falsely declared themselves the Arizona electors.",
    "Hours later, after the buildings were cleared, Pence finished the official certification of Biden’s victory.",
    "Arizona was among seven states that sent two slates of electors to the U.S. Senate and National Archives.",
    "In March, Finchem announced his candidacy for Secretary of State, the position that oversees elections.",
    "They sent their document, which featured the state seal, to the U.S. Senate and National Archives.",
    "The state lawmaker who represented rural southern Arizona became a national political figure.",
    "“We believe that we are the electors for the legally cast votes here in Arizona,\" she said.",
    "Nancy Cottle and Loraine Peligrino faced a deadline last week to turn over documents.",
    "He posted a photo of himself on the east end of the Capitol looking over the crowd.",
    "That riot halted the joint session of Congress that Pence was presiding over.",
    "Finchem pressed for official legislative hearings into the 2020 elections.",
    "The documents the states sent had similar formats, fonts and language.",
    "“and we have this lawsuit to assist him in being able to do his job.\"",
    "“It's all on the shoulders of Vice President Mike Pence,” Ward said.",
    "Neither Ward nor Finchem could be immediately reached for comment.",
    "Ward said the group represented the “true electors” from Arizona.",
    "But those requests were denied by House Speaker Rusty Bowers.",
    "Finchem was in Washington, D.C., on Jan. 6, 2020.",
    "It is not clear if either had turned over papers.",
    "Joe Biden won the state by a razor-thin margin.",
    "Trump has already endorsed his candidacy.",
    "Ward, in a Tweet, denounced that effort.",
    "They were ordered to testify this week.",
    "It was canceled after the rioting.",
    "Nor if either planned to testify.",
    "Subscribe to azcentral.com today.",
    "Lawmakers declined to do so.",
    "Bowers declined to do so.",
    "Support local journalism.",
    "Congressmen attended.",
    "Trump called into it.",
    "He did not.",
    "Two U.S."
  ]
}