{
  "id": 1516,
  "mediaId": 4040,
  "date": "2022-02-17",
  "headline": "‘Constitutional Sheriff’ Richard Mack to Meet With Illinois Gubernatorial Candidate Gary Rabine",
  "image": "https://files.rightwingwatch.org/uploads/24913521769_9222a883ee_c.jpg",
  "link": "https://www.rightwingwatch.org/post/constitutional-sheriff-richard-mack-to-meet-with-illinois-gubernatorial-candidate-gary-rabine/",
  "mediaOutlet": "Right Wing Watch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristen Doerer",
  "authorUrl": "https://www.rightwingwatch.org/post_author/kristen-doerer/",
  "termIds": [
    0
  ],
  "sentences": [
    "J.B. Pritzker in February of last year, “the unsafety law.”\nThe legislation, which was authored by the Illinois Legislative Black Caucus, brought significant changes to police accountability and transparency in law enforcement, though some of its reach was scaled back in June after law enforcement groups and police unions successfully lobbied to “remove reforms that would have eliminated qualified immunity for cops and barred police union contract negotiators from bargaining over discipline,” according to reporting from Injustice Watch.",
    "“And we’re going we’re going to get the 1,000 sheriffs, we’re going to have at least 700 sheriffs there, sheriff candidates there from all over the country, so that we can unify in this movement, and so that we can get a plan of action that is going to be implemented in 1,000 counties across this country to save America, take back our Constitution, and restore liberty county by county, sheriff by sheriff.",
    "Mack is the founder of the Constitutional Sheriffs and Peace Officers Association, which teaches that “the power of the sheriff even supersedes the powers of the president” and trains local law enforcement officials to resist federal and state “tyranny.” Mack also said he is hoping to get 1,000 sheriffs to attend a CSPOA a gathering this fall.",
    "Mack spoke with Sam Bushman, also of CSPOA, on Tuesday’s episode of “The Sheriff Mack Show,” which was simulcast with “Liberty Roundtable Live.” He did not say exactly when his meeting with Rabine would happen but indicated it would happen in a couple of days and said that 15 to 20 sheriffs would also be participating.",
    "And we the people working with our sheriffs to do this training and this convention will be the seminal moment for restoring liberty to America.”\nMack has also endorsed Oath Keeper, QAnon promoter, and Stop the Steal activist Mark Finchem, who is running for Arizona secretary of state.",
    "Mack announced a “seminal” event to be held Sept. 30 – Oct. 1 in Las Vegas with the goal of getting in attendance 1,000 sheriffs—a third of sheriffs in the U.S.—adding that already the group has as many as “200, 300” sheriffs who are members.",
    "A member of the Republican Governors Association, Rabine is also an advisory board member and donor for Turning Point USA, an organization founded by Christian nationalist Charlie Kirk that trains and mobilizes right-wing college students.",
    "On Tuesday’s “The Sheriff Mack Show,” Mack also shared his group’s strategy to recruit people, “county by county, sheriff by sheriff.” As of 2021 CSPOA has been recruiting county governments as well as sheriffs.",
    "On Wednesday, Rabine’s event calendar had him attending a TPUSA “No Forced Masks” event in St. Charles, Illinois (at which Kirk likened a restaurant asking him for his vaccine status to living in Nazi Germany).",
    "“Constitutional sheriff” Richard Mack said Tuesday he’s scheduled to meet with Gary Rabine, a Republican gubernatorial candidate in Illinois, in the coming days.",
    "Mack was a longtime board member of the far-right militia group the Oath Keepers, a position he held until 2015, and he has associated with white supremacists.",
    "In the past year, he’s joined Clay Clark’s ReAwaken America Tour, a cross-country traveling cavalcade of election, COVID-19, and QAnon conspiracy theorists.",
    "“Crime has bubbled to the top,” he told radio host John Williams Wednesday on “The John Williams Show,” broadcast on Chicago’s WGN Radio.",
    "We received an initial response from Rabine’s Twitter account and will update this story should Rabine respond to our questions.",
    "Rabine, a 58-year-old suburban businessman, joined the race for the Republican nomination in March last year.",
    "He dubbed Illinois House Bill 3653, also known as the SAFE-T Act, which was signed into law by Gov.",
    "Right Wing Watch reached out to Rabine’s campaign for comment regarding his meeting with Mack.",
    "Rabine has vowed to repeal the SAFE-T Act should he be elected governor.",
    "Rabine has made crime a key issue in his campaign for governor.",
    "“So, we’re going to have a huge convention,” Mack said.",
    "The GOP gubernatorial primary will be held in June.",
    "Rabine also joined Kirk on his podcast."
  ]
}