{
  "id": 1526,
  "mediaId": 2547,
  "date": "2022-02-16",
  "headline": "Jan. 6th Committee Subpoenas Six GOPers In Fake Elector Plot",
  "image": "https://crooksandliars.com/files/embeds/2022/02/49240.jpg",
  "link": "https://crooksandliars.com/2022/02/jan-6th-committee-subpoenas-six-gopers",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susie Madrak",
  "authorUrl": "https://crooksandliars.com/team/susie-madrak",
  "termIds": [
    1954,
    2246,
    2008,
    3332,
    4905,
    4617,
    4539,
    474,
    6506,
    5949
  ],
  "sentences": [
    "Sam Lazar attended a Mastriano / Rudy Giuliani event when he was featured on the FBI’s website: https://t.co/TW6T8rXLmR\n— Ryan J. Reilly (@ryanjreilly) February 15, 2022\n“Campaign finance records show that State Sen Doug Mastriano’s campaign spent thousands…on charter buses ahead of the Washington DC rally that ended with supporters of Pres Trump violently storming the halls of Congress last week during an insurrection.”https://t.co/BdnpIr6Lp6\n— Paul Morrison (@chessclubgringo) February 16, 2022",
    "The Jan. 6 committee issued subpoenas late yesterday to Arizona GQP Chairwoman Kelli Ward (who you saw here recently kicking a cop during her arrest on a semi-unrelated charge), GOP State Sen. Doug Mastriano of Pennsylvania (who's a leading candidate for the PA gubernatorial nomination) and four others over their scheme to use fake electors to overturn Joe Biden's election.",
    "That includes Ward, who also “apparently spoke with former President Trump and members of his staff about election certification issues in Arizona,” committee Chair Bennie Thompson, D-Miss., said in a letter, citing documents on file with his investigation.",
    "Via CNBC.com:\nIndividuals included in the latest batch of subpoenas allegedly tried to send “alternate electors” to Washington to vote for then-President Donald Trump in key swing states won by President Joe Biden, the select committee said.",
    "[...] The other subpoenas were issued to Michael Roman and Gary Michael Brown, who led Election Day operations for Trump’s 2020 campaign; Michigan GOP Chair Laura Cox; and Arizona State Representative Mark Finchem.",
    "— Eric A (@culdesacfan) February 16, 2022\nIf you can find a Jan. 6 rioter from Pennsylvania, there’s a pretty solid chance they’ve got a link to Doug Mastriano.",
    "Kelli Ward will be taking the 5th Amendment more times than you have to re-inflate your Ashli Babbitt love doll on a Saturday Night.",
    "Yeah...sure."
  ]
}