{
  "id": 1631,
  "mediaId": 2539,
  "date": "2022-02-15",
  "headline": "House probe of Jan. 6 Capitol riot subpoenas Arizona GOP leader Kelli Ward, 5 others over ‘alternate electors’",
  "image": "https://image.cnbcfm.com/api/v1/image/107015841-1644959671988-gettyimages-1330464466-dsc_1601_2021072485522468.jpeg?v=1644959737&w=1920&h=1080",
  "link": "https://www.cnbc.com/2022/02/15/jan-6-capitol-riot-probe-subpoenas-arizona-gop-chair-kelli-ward-5-others-.html",
  "mediaOutlet": "CNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Breuninger",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In a letter to Mastriano, Thompson wrote, “we understand that you spoke with former President Trump about your post-election activities.”\nCNBC Politics\nRead more of CNBC’s politics coverage:\nThe U.S. wants to see Russia ‘weakened’; Blinken says Moscow has ‘already failed’\nNew York judge holds Donald Trump in contempt for failing to comply with subpoena for business documents\nPennsylvania’s GOP Senate primary draws backing from some of Wall Street’s biggest billionaires, making it one of the most expensive midterm races\nThe other subpoenas were issued to Michael Roman and Gary Michael Brown, who led Election Day operations for Trump’s 2020 campaign; Michigan GOP Chair Laura Cox; and Arizona State Representative Mark Finchem.",
    "The Republican National Committee, in censuring GOP Reps. Liz Cheney and Adam Kinzinger for participating in the House probe, approved a resolution that appeared to describe the events of Jan. 6 as “legitimate political discourse.” RNC Chairwoman Ronna McDaniel later sought to clarify that that language applied not to the violent Trump supporters who attacked Capitol police officers, but rather to the GOP activists who purported to be “alternate electors.”\nFederal prosecutors are reviewing those fake certifications, a senior Biden administration Department of Justice official told CNN last month.",
    "Brandon Bell | Getty Images\nThe House select committee investigating the Jan. 6 Capitol riot issued subpoenas Tuesday to Arizona Republican Party Chairwoman Kelli Ward, GOP State Sen. Doug Mastriano of Pennsylvania and four others over their alleged efforts to interfere with the certification of the 2020 election results.",
    "That includes Ward, who also “apparently spoke with former President Trump and members of his staff about election certification issues in Arizona,” committee Chair Bennie Thompson, D-Miss., said in a letter, citing documents on file with his investigation.",
    "The House panel wants the six individuals to produce documents and sit for depositions as part of the probe into Jan. 6, 2021, when a violent mob of Trump’s supporters stormed the Capitol and temporarily derailed the transfer of power to Biden.",
    "Individuals included in the latest batch of subpoenas allegedly tried to send “alternate electors” to Washington to vote for then-President Donald Trump in key swing states won by President Joe Biden, the select committee said.",
    "“We expect these six individuals to cooperate as well as we work to tell the American people the full story about the violence of January 6th and its causes,” Thompson said in a press release.",
    "The panel intends to hold public hearings later this year, laying out a definitive report on the facts and causes surrounding the Jan. 6 invasion.",
    "Earlier this month, Ward and her husband, Michael Ward, sued to block the select committee from obtaining their phone records, NBC News reported.",
    "Arizona Chairwoman Kelli Ward speaks during the Rally To Protect Our Elections conference on July 24, 2021 in Phoenix, Arizona.",
    "The attempt to submit false Electoral College certifications for Trump has become an increasingly prominent issue.",
    "The Arizona Republican Party did not immediately respond to CNBC’s request for comment on the subpoena.",
    "The committee has announced 80 subpoenas and received 63,000 documents, an aide to the panel told NBC.",
    "Thompson said that as of Tuesday, the committee has heard from more than 550 witnesses."
  ]
}