{
  "id": 1702,
  "mediaId": 2790,
  "date": "2022-02-15",
  "headline": "GOP candidates and leaders subpoenaed as Jan. 6 panel dives into fake electors scheme",
  "image": "https://media.npr.org/assets/img/2022/02/15/image-from-ios-3-_wide-5e8bc7ee4954059c24ffd41df25a981461088e1d.jpg?s=1400",
  "link": "https://www.npr.org/2022/02/15/1080932901/gop-candidates-and-leaders-subpoenaed-as-jan-6-panel-dives-into-fake-electors-sc",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Claudia Grisales",
  "authorUrl": "https://www.npr.org/people/731633770/claudia-grisales",
  "termIds": [
    0
  ],
  "sentences": [
    "The Democratic-led House select committee investigating the Jan. 6 attack on the U.S. Capitol is expanding its probe into false electors tied to the 2020 election, issuing six new subpoenas, including to two Republicans currently running for statewide offices.",
    "The new testimony demands come after revelations that about a month after the 2020 election, Republicans in seven key states met and signed documents falsely asserting that Trump was or may be the winner of their state's Electoral College votes.",
    "In all, the committee has issued 86 subpoenas publicly, in addition to other subpoenas seeking phone and banking records, as well as quiet demands for testimony from other targets who were not announced by the committee at the time of issuance.",
    "And with the panel's charge to get all the facts tied to the Jan. 6 riot and the events leading up to it, it's clear that the fake electors scheme was a key part of the plot to overturn the election's results, Lofgren said.",
    "\"The Select Committee is seeking information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election,\" select panel Chair Rep. Bennie Thompson, D-Miss., said in a statement.",
    "Finally, the panel said they hope to talk to former Michigan GOP chair Laura Cox after she reportedly witnessed former Trump personal lawyer Rudy Giuliani pressure state lawmakers to reject election results in Michigan.",
    "Finchem was also in Washington, D.C., on the day of the Capitol attack, claiming he had to deliver \"evidence\" to Vice President Mike Pence to postpone the certification of the election results, the panel said.",
    "The Republican gubernatorial candidate, Mastriano, was part of a plan to arrange for a fake slate of electors from Pennsylvania and reportedly spoke with Trump about post-election activities, the panel said.",
    "Ward, the panel said, reportedly spoke to Trump and his staff about election certification issues in Arizona and worked to transmit documents claiming an \"alternate\" Electoral College elector from Arizona.",
    "California Democratic Rep. Zoe Lofgren, who sits on the committee, said investigators need to follow the probe where it leads them, even if that entails subpoenas for individuals currently seeking office.",
    "\"We're seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans.\"",
    "Roman, as director of Election Day operations, and Brown, as deputy director, both promoted false claims of election fraud and encouraged state officials to appoint fake electors, the committee said.",
    "The subpoenas issued Tuesday mark the panel's growing look into an effort to put forth false electors for former President Donald Trump as he sought to stay in office after losing the 2020 election.",
    "Committee investigators say the Arizona GOP candidate, Finchem, helped organize an event in Phoenix where Trump's legal team and others shared false claims of voter fraud.",
    "\"The subpoenas that were issued were not issued because they're candidates; it's because they were part of the false slate elector plot in 2020,\" Lofgren said.",
    "The new subpoena demands on Tuesday ask for testimony by mid-March, and come on the heels of multiple criminal investigations looking into the same concerns.",
    "The new wave of subpoena targets includes Kelli Ward, the chair of the Arizona Republican Party, in addition to two GOP political candidates in swing states.",
    "State Sen. Doug Mastriano is a candidate for Pennsylvania governor, and state Rep. Mark Finchem is running to be the next secretary of state in Arizona.",
    "\"So some of the false electors are candidates — most of them are not — but it's related to their past activities, not their current activities.\"",
    "Thompson noted the panel has now interviewed more than 550 witnesses, and expects the six new witnesses to join that list.",
    "This is in addition to more than 66,000 pages of documents and 400 tips to the committee that are now part of the probe.",
    "The new subpoena targets also include two officials for Trump's 2020 reelection campaign: Michael Roman and Gary Brown.",
    "Last month, the committee issued a first wave of 14 subpoenas tied to the scheme.",
    "The documents were then sent to federal officials."
  ]
}