{
  "id": 1707,
  "mediaId": 2580,
  "date": "2022-02-17",
  "headline": "BACK TO THE BASICS: Arizona Lawmakers Seek to Return to Paper Ballots, Hand Counts",
  "image": "https://www.gopusa.com/wp-content/uploads/2020/10/ballot_box_flag.jpg",
  "link": "https://www.gopusa.com/back-to-the-basics-arizona-lawmakers-seek-to-return-to-paper-ballots-hand-counts/",
  "mediaOutlet": "GOPUSA ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "GOPUSA",
  "authorUrl": "",
  "termIds": [
    2246,
    1489,
    81,
    6432,
    6517,
    5949,
    5970
  ],
  "sentences": [
    "– I don’t think we should go backward in terms of voting even though we obviously recognize that voting is an incredibly crucial piece of the way our country functions.”\nAs previously reported by Human Events News, Arizona state Rep. Mark Finchem took his Arizona Ballot Integrity Project (BIP) national in October when he and approximately 30 others from around the country gathered at the suburban Dallas offices of international authentication leader, Authentix, to create a process for introducing a highly counterfeit-resistant paper ballot.",
    "In January, Human Events News reported on the effort to remove vote counting machines in New Hampshire where the Marigold Coffee Club and its members managed to submit the paperwork necessary through the use of warrant articles to force referendums in 30 cities, towns, and villages across the state to decide if ballots in future elections will be counted by machine or by hand.",
    "In December, also as previously reported by Human Events News, Pima County, Arizona held an election integrity hearing following an allegation that 35,000 fake votes had been entered into the Pima County election, related by an individual who claimed to be in the room when the plan was revealed to lower level Pima County Democratic Party leaders.",
    "Blazek anticipated the now present pushback to the warrant articles adding: “We know our rights, and we know we have met the state requirements in terms of signatures and timely submission.”\nThe Marigold effort led to legislation being introduced by New Hampshire State Representative Mark Alliegro to remove vote counting machines statewide.",
    "Of the effort that started all this out of New England, New Hampshire State Senator Robert Giuda, the man instrumental in getting special legislation passed to allow the Windham audit to move forward said, “This all grew out of the Windham audit which was not moving forward until I got the bill pushed through.",
    "“There would be enough people volunteering around the state to come to your district and mine, if necessary.”\nAs reported by Just the News, Jen Marson with the Arizona Association of Counties told the committee that moving back to paper ballots would be a step in the wrong direction.",
    "Using a provision of law unique to New Hampshire relating to warrant articles, the group set out to collect signatures from enough town residents in locales where machines are used for vote counting to trigger an automatic referendum.",
    "The audit itself was surrounded with controversy but ultimately concluded that the 10 percent across the board discrepancy in vote counts was the result of machine error and not the result of any form of election tampering.",
    "The Marigold group organized the effort to have machines removed in the wake of the audit, reported on extensively by Human Events, which took place in the southeast town of Windham after the 2020 election.",
    "Arizona lawmakers gave early approval to a bill that would ban the use of voting machines and require millions of the state’s electoral ballots to be hand-counted.",
    "The people need to work as a team.”\nHuman Events will continue to cover ongoing efforts at various state and local levels to provide for election integrity.",
    "We must do this.”\nRogers insisted that despite the hard work of counting millions of ballots, they would have plenty of volunteers to complete the task.",
    "The first portion of the meeting had experts from Authentix making various presentations to the group detailing the technology involved in the process.",
    "We were able to get cooperation from people from all walks of life and across the entire state,” Marigold founder Felisa Blazek said at the time.",
    "“This has been a collaborative effort that started back at the end of August with conception and launched publicly in September.",
    "As reported on at the time by Human Events, this legislative effort is the forerunner to the current initiative in Arizona.",
    "The post BACK TO THE BASICS: Arizona Lawmakers Seek to Return to Paper Ballots, Hand Counts appeared first on Human Events.",
    "The Senate Government Committee voted along party lines Monday to advance Senate Bill 1338, sponsored by Sen. Wendy Rogers.",
    "The legislation would ban the use of electronic voting and electronic or other tabulating devices in any Arizona election.",
    "It would also require precinct polling places, forbidding the current system of more consolidated voting centers.",
    "The second half was a working white board session where the group collaborated in designing the rollout process.",
    "Attendees were a mix of technology experts, politicians, election officials, and election integrity activists.",
    "That initiative is now in the process of being either accepted or challenged by the various municipalities.",
    "“There is nothing more important than the preservation of our democracy,” Rogers told the committee.",
    "States represented included Arizona, Michigan, Virginia, Tennessee, and New Hampshire among others.",
    "“We use technology in our everyday lives and other very sensitive areas – banking, medical, etc.",
    "New Hampshire has been ground zero in the fight to remove vote counting machinery.",
    "Ultimately this needed to be left to the people and the people have to work at it.",
    "The Marigold response was to then launch an effort to remove machines.",
    "Our state allows for the citizens to decide how votes get counted.",
    "“They’re willing to go anywhere in the state,” Rogers said.",
    "“This is brave what we’re trying to do here.",
    "© Copyright 2022 HUMAN EVENTS.",
    "All Rights Reserved."
  ]
}