{
  "id": 17329,
  "mediaId": 8475,
  "date": "2022-03-03",
  "headline": "Gates expresses ‘great concerns’ about future of Arizona election integrity",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/030322-audit-gates.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/030322_threatened_elections/gates-expresses-great-concerns-future-arizona-election-integrity/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camila Pedrosa",
  "authorUrl": "",
  "termIds": [
    5909,
    3922,
    2765,
    2246,
    2014,
    769,
    5949,
    6667
  ],
  "sentences": [
    "In the frenzy that followed Trump’s charges, election officials found themselves and their families the targets of threats and needing police protection for doing a job that the moderator said is “supposed to be relatively boring.”\n“This isn’t a partisan issue at all, this is a leadership issue,” Gates said about the decision to support Arizona election workers’ certification of the election.",
    "That was echoed by Gates, who pointed to Rep. Mark Finchem, R-Tucson, a Trump-endorsed candidate for the elections job who Gates said “has made it very clear what his intent will be if he is elected secretary of state.”\nAll three panelists said they and their colleagues experienced threats on their homes, families and lives in the months following the election.",
    "Local\nMaricopa County Board of Supervisors Chairman Bill Gates told a national panel Wednesday he has “great concerns about the future” of election integrity in Arizona, after threats following the 2020 election and as election deniers run for Secretary of State in 2022.",
    "Becker, executive director of the Center for Election Innovation and Research, asked at one point, “What would John McCain do?” He praised the three officials on the panel for showing “a raw courage that this job is not supposed to require,” in the face of such threats.",
    "The other panelists – Michigan Secretary of State Jocelyn Benson and Pasco County, Florida, Elections Supervisor Brian Corley – said they faced similar issues in their states, both of which were subject to far-reaching challenges to the 2020 results.",
    "That is a sharp change from what has traditionally been a low-profile and thankless job, said David Becker, moderator of the session that was held to look at the threat to democracy of local election officials do not feel safe or appreciated.",
    "Gates was joined on the McCain Institute panel by local officials from other states that became the focus of election challenges in 2020, after former President Donald Trump pushed baseless claims that election fraud cost him a second term.",
    "“You never get that pat on the back, you know, a simple ‘thank you’ … you don’t even get that.”\nInstead, Gates has received hate mail and accusations of lying in front of Congress during testimony last year on the Arizona audit.",
    "As Trump supporters stormed the U.S. Capitol on Jan. 6, 2021, Gates said he was forced to evacuate his family to an Airbnb in order to avoid any protesters that may have showed up at his house.",
    "There’s a weariness and … that’s really troubling.”\nGates said he is proud of election officials who stood up for the truth in states and counties that faced pushback from Republicans in 2020.",
    "When the Arizona Senate voted to not hold the Board of Supervisors in contempt, Gates said he saw people set up guillotines meant for supervisors on the lawn of the state Capitol in response.",
    "“Democracy will prevail if citizens on both sides of the aisle and people of integrity make defending democracy the most important issue of our moment,” Benson said.",
    "“Election officials have cried at times when I’ve spoken and asked to give me a hug, which is not a normal thing that happens at my speeches,” Becker said.",
    "Benson said she is concerned about the rise in election-denying candidates running for secretary of state, the chief election officer in most states.",
    "He recounted a conversation in which someone told Corley he would be called “a patriot” if he spoke out against the legitimacy of the election.",
    "“That’s a troubling sign for our future quite honestly, when we can’t rise above politics and across politics for truth and reality,” he said.",
    "“There’s never a headline on the Wednesday after an election that everything went great,” Becker said.",
    "Corley said confirmation bias toward far-right ideology is a major problem with voters in his county.",
    "She also noted an increase in vitriol and death threats toward current secretaries of state.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "“It’s critical that these conversations be nonpartisan and be bipartisan.”\n- 30 -",
    "And Benson said she remains confident in the state of American democracy.",
    "Like what you're reading?",
    "“But they’re there."
  ]
}