{
  "id": 1934,
  "mediaId": 2590,
  "date": "2022-02-07",
  "headline": "Arizona Republican Says His Daughter Got Text Calling Him 'N-Word' RINO",
  "image": "https://img.huffingtonpost.com/asset/6201ccf22700006b27457934.jpeg?cache=mFp8ln7Wpz&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/gop-arizona-walter-blackman_n_6201cb6be4b05004243174ee",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    4312,
    111,
    1126,
    1312,
    891,
    5949,
    6360,
    6517,
    6745
  ],
  "sentences": [
    "On Monday, Arizona state Rep. Mark Finchem (Trump’s endorsed candidate for secretary of state) introduced a resolution seeking to decertify the results in Maricopa, Pima and Yuma counties — more than a year after the presidential election and following numerous fruitless attempts at digging up evidence that a massive voter fraud scheme cost Trump the presidency.",
    "Advertisement\n“Your [N-word] dad is RINO,” the text read, referring to the acronym for “Republican in Name Only.”\nThe text came last month after a far-right site, The Gateway Pundit, reported that Blackman said it would be impossible to decertify an election, an idea that’s been floated in the Arizona legislature.",
    "Even after a Republican-backed audit failed to turn up evidence that Joe Biden’s presidential win in 2020 was compromised - and, in fact, showed a gain in votes for Donald Trump’s Democratic rival - GOP lawmakers are still looking for excuses to overturn the presidential results in the state election.",
    "Walter Blackman, the first Black Republican elected to the Arizona legislature and a 2022 congressional candidate, claims that after an interview in which he poured cold water on the idea that lawmakers could overturn the election, his daughter received a text message calling him a racial slur.",
    "Ross D. Franklin/Associated Press\nA Republican state legislator from Arizona said he and his family members are the victims of a racist smear campaign driven by right-wing media after he pushed back against claims that state lawmakers could “decertify” the 2020 presidential election.",
    "After Blackman’s wife on Facebook appeared to blame the Gateway Pundit piece for emboldening whoever sent the text, the reporter posted a video purporting to show him dialing the number it came from and getting Blackman’s voicemail.",
    "This is what happens when your opponents can’t run a campaign on the issues, they resort to disgusting smear attacks with a word that has no place in our Republican Party or society in general,” Blackman said.",
    "Advertisement\nLoyalty to Trump and his election lies is a defining issue in Arizona’s races this cycle, from U.S. Senate and secretary of state posts to down-ballot races like Blackman’s.",
    "Blackman’s opponent, former Navy SEAL and business owner Eli Crane, posted a link to the Gateway Pundit story being covered by One America News Network, Trump’s preferred news station.",
    "While their investigation is ongoing, they have determined that the text messages did not in any way, shape or form originate with my cell phone.",
    "Blackman’s congressional campaign shared a video Monday that showed the number was disconnected and could not access Blackman’s voicemail.",
    "Trump’s most fervent supporters are still holding out hope that not only will he run again in 2024 but that he can return to power.",
    "The campaign didn’t respond to HuffPost’s request for comment but in a statement said that police are investigating the incident.",
    "Advertisement\n“It is illogical and crazy to think I would send this vile text message to my daughter or know anything about it.",
    "Blackman is running in the GOP primary for Arizona’s 2nd Congressional District, the northeast corner of the state.",
    "State Rep. Walter Blackman is sworn in during the opening day of the Arizona General Assembly in 2021.",
    "I have been in contact with the state police who are investigating the origin of these messages.",
    "It became even more red after this year’s redistricting, spurring a competitive GOP primary.",
    "It didn’t offer any specifics about who might have sent the text message.",
    "The seat is held by Democrat Tom O’Halleran but leans Republican.",
    "“You just can’t make this stuff up,” he wrote."
  ]
}