{
  "id": 2728,
  "mediaId": 2540,
  "date": "2022-01-28",
  "headline": "An Arizona Republican just unveiled the most brazen election bill yet",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/211014130256-people-voting-2020.jpg?q=x_5,y_233,h_2526,w_4490,c_crop/w_800",
  "link": "https://www.cnn.com/2022/01/28/politics/arizona-john-fillmore-gop-election-results-bill/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    1690,
    108,
    392,
    542,
    1126,
    1312,
    5949
  ],
  "sentences": [
    "GOP state Rep. John Fillmore introduced legislation this week that would, among other things, get rid of almost all absentee and early voting in the state and mandate all votes be HAND-counted within 24 hours of polling sites being closed.",
    "\"The ballots that were provided to us to count in the coliseum very accurately correlate with the official canvass numbers,\" said one of the men charged with overseeing the so-called audit.",
    "That legislation like this is even proposed, however, speaks to how far down the rabbit hole Republicans have gone when it comes to Trump's conspiracy theories about the last election.",
    "As CNN's Fredreka Schouten reports:\n\"Under [Fillmore's] proposal, lawmakers would meet to either 'accept or reject election results' following primary and general elections.",
    "\"We should have voting, in my opinion, in person, one day on paper, with no electronic means and hand counting that day,\" Fillmore said on Wednesday in support of his bill.",
    "Despite the many irregularities in the process, it still failed to produce any evidence that the result -- Joe Biden beat Trump by just under 11,000 votes -- was incorrect.",
    "If legislators reject the results, any qualified voter 'may file an action in the Superior Court to request that a new election be held,' according to the bill.",
    "Fifteen Republican legislators have signed on to Fillmore's bill, including Rep. Mark Finchem, the Trump-endorsed candidate for Arizona secretary of state.",
    "It's not clear whether Fillmore's bill can pass either chamber; Republicans hold single-seat edges in both the state House and state Senate.",
    "Remember too that this is Arizona, the state in which Trump-aligned Republicans pushed a sham audit of the 2020 presidential election vote.",
    "But even amid this cavalcade of voter restrictions, a new bill proposed by a GOP legislator in Arizona stands out -- and not in a good way.",
    "(CNN)In the wake of the 2020 election, a number of Republican-controlled state legislatures have made moves to make it harder to vote.",
    "Doug Ducey is a Republican, he has not been someone willing to go along with Trump's lie that the 2020 election was stolen.",
    "The legislature would be able to overturn the election results based only on an ill-defined review of the process?",
    "Fillmore said lawmakers should possess authority as 'representatives of the people' to review the vote count.\"",
    "Uh, ok. Worth noting here: So-called \"literacy tests\" were still legal in the late 1950s, as were poll taxes.",
    "The potential to abjure the will of the people in order to advance a partisan agenda seems vast.",
    "But Fillmore's bill would go even further than putting strictures on when and how you can vote.",
    "It would also empower the state legislature to accept or reject election results in the state.",
    "Both measures were aimed at limiting the votes -- and influence -- of African American voters.",
    "Lest you think Fillmore is on a lonely quest to subvert democracy, well, he's not.",
    "Er, that feels, how to say it, totally un-democratic?",
    "\"We need to get back to 1958-style voting.\"",
    "And while Gov.",
    "Yes, really."
  ]
}