{
  "id": 2783,
  "mediaId": 2520,
  "date": "2022-02-02",
  "headline": "House Speaker Rusty Bowers didn't just kill a bill to veto our vote. He stoned the thing",
  "image": "https://www.gannett-cdn.com/presto/2022/01/11/PPHX/cf736cc6-73c5-4c90-bbd2-e05e7241255d-_RS19686.JPG?crop=2999,1687,x0,y91&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/02/01/ahouse-speaker-just-killed-arizonas-most-outrageous-election-reform/9307151002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    3813,
    3019,
    2246,
    1690,
    102,
    84,
    1126
  ],
  "sentences": [
    "But this is Bowers killing the bill, chopping it up, setting the pieces on fire, then digging up the ashes and throwing them into the ocean.”\nBowers has kept up the fight since 2020\nBowers has been one of the few Republicans at the Capitol who declined to give in to the collective psychosis that has infected some of the baser portions of his political base – including a depressingly large percentage of the Legisalture – since Donald Trump lost the 2020 election.",
    "Here is a list of Republican legislators who signed on as co-sponsors to Rep. Fillmore’s bill:\nReps. Brenda Barton of Payson, Leo Biasiucci of Lake Havasu City, Walter Blackman of Snowflake, Judy Burges of Skull Valley, Neal Carter of Queen Creek,\nJoseph Chaplik of Scottsdale, David Cook of Globe, Lupe Diaz of Benson, Mark Finchem of Oro Valley, Jake Hoffman of Mesa, Teresa Martinez of Casa Grande, Jacqueline Parker of Mesa and Beverly Pingerelli of Peoria.",
    "But I cannot and will not entertain a suggestion that we violate current law to change the outcome of a certified election.”\nWhile Senate President Karen Fann, R-Prescott, was bowing to Team Trump and the Senate’s cuckoo squad by hiring an unqualified Trump supporter to conduct what she called an “independent” audit of the election, Bowers took a pass.",
    "“I will follow the Constitution.”\nFor standing on principle, Bowers was targeted by the Arizona Patriot Party for recall and Trump supporters cruised his neighborhood, using a loudspeakers to call him a pedophile.",
    "“You are giving me nothing but conjecture and asking me to break my oath and commit to doing something I cannot do because I swore I wouldn’t,” he said, recounting the phone call to The Arizona Republic.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Trump and his lawyer, Rudy Giuliani, called Bowers in November 2020 to regale him about the many ways in which the election was stolen and to suggest that the Legislature choose its own electors.",
    "Since then, his fellow Republcian legislators have introduced no fewer than 70 bills to “reform” our elections, the worst of them being Fillmore’s scheme to essentially take away our vote.",
    "And to his 15 far-right fellow legislators who co-sponsored the bill, including none other than Rep. Mark Fiinchem, who is hoping to be Arizona’s next secretary of state.",
    "As a longtime Capitol reporter, Arizona Mirror’s Jeremy Duda, put it:\n“I’ve never seen a speaker or Senate president kneecap a bill as aggressively as this,” he tweeted.",
    "He refused early on to entertain schemes by Finchem and others to overturn the election results or call into question the integrity of the vote absent actual facts.",
    "In fact, he assigned it to every one of the House’s standing committees – all 12 of them, reports the Arizona Capitol Times’ Nathan Brown.",
    "You remember that ridiculous bill to allow the Arizona Legislature to toss out our vote if our leaders don’t like the election results?",
    "“As a conservative Republican, I don’t like the results of the presidential election,” this Mesa Republican said in December 2020.",
    "There’s a message in there from Bowers to Rep. John Fillmore, the Apache Junction Republican who dreamed up this abomination.",
    "That would require that all ballots – all three or four million of them – be counted by hand within 24 hours of an election?",
    "The one that would kill the state’s wildly popular early voting program used by nearly 90% of voters?",
    "No one assigns bills to 12 committees\nYou assign a bill to one committee if you want it to pass.",
    "These are the people who wanted to give the Legislature the right to throw out your vote.",
    "You assign it two committees or three even if you want to roughen up the road a bit.",
    "House Speaker Rusty Bowers has once again saved Republicans from themselves.",
    "One horrible voting bill down, 69 to go\nBowers told them to get lost.",
    "Now Bowers has made an unmistakable statement without saying a word.",
    "Well, Bowers on Tuesday assigned House Bill 2596 to committee.",
    "“I voted for President Trump and worked hard to reelect him.",
    "David Gowan of Sierra Vista and Vince Leach of Saddlebrooke.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "Btw, who co-sponsored HB 2596?",
    "One down, and 69 more to go.",
    "“Triple-assignments?",
    "You assign it to 12?",
    "And good riddance.",
    "Twelve committees?",
    "RIP, HB 2596.",
    "Been there.",
    "Also Sens.",
    "Sure.",
    "12?"
  ]
}