{
  "id": 309,
  "mediaId": 2720,
  "date": "2022-02-21",
  "headline": "AZ Rep Turns to Voters for Help as Pelosi's Goons Drag Him to DC for Interrogation Over Jan. 6",
  "image": "https://thefederalistpapers.org/wp-content/uploads/2020/07/Speaker-Representative-Nancy-pelosi.jpg",
  "link": "https://thefederalistpapers.org/us/az-rep-turns-voters-help-pelosis-goons-drag-dc-interrogation-jan-6",
  "mediaOutlet": "thefederalistpapers.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Landry",
  "authorUrl": "https://thefederalistpapers.org/author/wj",
  "termIds": [
    0
  ],
  "sentences": [
    "He has made “unsubstantiated claims” about the 2020 election and helped organize an event in Phoenix on Nov. 30, 2020, “at which former President Trump’s legal team and others spoke and advanced unproven claims of election and voter fraud,” according to a statement Tuesday by the Jan. 6 committee’s chairman, Democratic Rep. Bennie Thompson of Mississippi.",
    "A constant critic of the handling of the 2020 presidential election of Joe Biden over Donald Trump, Finchem has been subpoenaed by what he labeled “the so-called U.S. House Select Committee to Investigate the January 6th Attack on the United States Capitol.”\nFinchem’s offense?",
    "Well, I’m just not that kind of guy.”\nIn an election, Finchem said, it should be “easy to vote and hard to cheat.”\nBesides objecting to what occurred in the 2020 election, the GOP legislator already has been working to protect the integrity of future elections.",
    "“When people give their consent to be governed, they do not surrender their right to hold the government accountable for counting the vote.”\n“Yet, it seemed like there was this growing number of political types that wanted the people to sit down and shut up.",
    "After Republicans on the Arizona Senate Committee on Government successfully passed items for election reform, a sponsor for one aspect of ballot integrity credited Finchem with doing the background work to find a vendor for certified ballots.",
    "Finchem also was in Washington on Jan. 6, 2021, the day of the Capitol incursion, and “stated that he had evidence to deliver to Vice President [Mike] Pence in an effort to postpone the awarding of electors,” Thompson said.",
    "If you’re a state representative questioning what went on in your state’s election, the kangaroos will haul you to Washington, turn you upside down and shake you to see if they can make anything — anything — fall out.",
    "Arizona state Rep. Reginald Bolding, the Democrat who is running against Finchem, said his opponent’s candidacy “should terrify not just Arizona, but the entire nation,” according to the U.K.’s Guardian.",
    "Meanwhile, Laurie Roberts of The Arizona Republic declared Finchem had “no shame” for questioning the election on the Democrat high holy day of the first anniversary of the Capitol incursion.",
    "The kangaroos in Washington are after him, so he has set up a GiveSendGo fundraising account to keep legal fees from crushing him and his $24,000 annual legislator’s salary.",
    "In the eyes of the kangaroos, Finchem’s real crime might have been declaring that he’s running for Arizona secretary of state in order to ensure honest elections.",
    "The Jan. 6 committee, created by House Speaker Nancy Pelosi and consisting of seven Democrats and two anti-Trump Republicans, would not be amused by that.",
    "In Washington, the select committee is seeking Finchem’s phone records and all documentation regarding communications he had about the election.",
    "Finchem told The Epoch Times last month the 2020 election is what prompted him to run for Arizona secretary of state.",
    "That despite the establishment’s continual repeating that everything is OK, there’s nothing to see here.",
    "Because not only do we need election integrity, but we also need the appearance of election integrity.",
    "Finchem, of course, is not the only one who has doubts about the 2020 election.",
    "Polls show that millions of Americans do not believe Biden won fair and square.",
    "“Elections belong to the people, not the government,” he said.",
    "This article appeared originally on The Western Journal.",
    "Stray from the narrative and they will punish you.",
    "They’re big, powerful and can critically maul you.",
    "Ask Arizona Republican state Rep. Mark Finchem.",
    "Kangaroo courts can be a hazard, too.",
    "Kangaroos can be dangerous.",
    "Are you getting this?",
    "Tsk, tsk."
  ]
}