{
  "id": 3167,
  "mediaId": 2578,
  "date": "2022-01-27",
  "headline": "Arizona State Senator Wendy Rogers on Recalling Electors: “If Wisconsin Can Do It, Arizona Should Have Been FIRST”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/990D72B6-579C-46AA-B3C7-2564E37BF223.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/01/arizona-state-senator-wendy-rogers-recalling-electors-wisconsin-can-arizona-first/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    5007,
    3401,
    1458,
    1489,
    1586,
    100,
    5949,
    6729
  ],
  "sentences": [
    "WATCH: AZ State Rep. Mark Finchem Expects Arrests in Arizona: “Maricopa County Isn’t The Only County – We Are Waiting for Indictments”\nThe Gateway Pundit correspondent Jordan Conradson spoke to Senator Rogers about Arizona Attorney General Mark Brnovich’s investigation and decertification in Arizona.",
    "EXCLUSIVE: AZ State Rep. Mark Finchem Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nArizona State Senator Wendy Rogers has also called to decertify, and she has launched a multitude of election integrity bills this session.",
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nArizona State Representative Mark Finchem told The Gateway Pundit that he is already working on a resolution to reclaim Arizona’s electors.",
    "Rogers: It’s hard to say how it’ll affect him, but I can tell you what my constituents are telling me from Northern Arizona and really all over from all over Arizona, that if Wisconsin can do it, Arizona should have been first.",
    "The Gateway Pundit reported that the Wisconsin State Assembly voted to move forward Rep. Ramthun’s resolution to reclaim Wisconsin’s 10 electors for US President and Vice President who were certified under fraudulent purposes.",
    "I’ve just been appointed, thankfully, as a permanent member of the government committee, which makes me on four committees, but it’s my honor to serve and to be able to vote on four different committees.",
    "This last Monday evening, we had so many people testify for these election integrity bills, and they had cogent concrete points, facts to support their willingness to get behind the bill.",
    "I think Brnovich is going to be put in a place where he has to do something because of all these bills worth doing that indicate where the fraud and corruption have been.",
    "Legislators in Arizona and Wisconsin are pushing to decertify their states’ fraudulent 2020 elections with promised resolutions to reclaim the Presidential electors.",
    "As far as Attorney General Brnovich is concerned, it’s really important that he starts making progress because we’re putting bills through right and left.",
    "Arizona’s full forensic audit of Maricopa County’s 2020 election found evidence of elections law violations and hundreds of thousands of fraudulent votes.",
    "And we’re having to do a supplemental government committee meeting because we have over 70 , Seven- Zero, 70 election integrity bills.",
    "Conradson: So do you think the recent move by Wisconsin pushing to reclaim their 2020 electors will get him moving a little bit?",
    "Many of them were auditors, volunteers who worked at the audit, and it was an incredible outpouring of truth-telling.",
    "All evidence was delivered to the Arizona Attorney General, and some legislators are ready to decertify Arizona.",
    "Some RINOs in the Arizona Legislature either think it is impossible to decertify, or they lack the courage.",
    "In the meantime, Arizona awaits the results of Attorney General Mark Brnovich’s criminal investigation.",
    "No matter what state you live in, Contact Arizona legislators and demand their support.",
    "Arizona citizens need to come to every Senate hearing and have their voices heard.",
    "Rogers: Keep showing up to the government committee meeting.",
    "Conradson: There are some RINOs in the Arizona Legislature.",
    "Rogers: We’ve done a ton of bills just here in week three.",
    "It’s every Monday it goes into the evening.",
    "How can citizens put pressure on them?",
    "So back to your question."
  ]
}