{
  "id": 3218,
  "mediaId": 8416,
  "date": "2022-02-02",
  "headline": "Arizona lawmakers look to curb government’s emergency powers",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/02/02/arizona-lawmakers-look-to-curb-governments-emergency-powers/?utm_source=rss&utm_medium=rss&utm_campaign=arizona-lawmakers-look-to-curb-governments-emergency-powers",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan J. Cooper | Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Sen. Michelle Ugenti-Rita, a Scottsdale Republican who introduced the bill, said Ducey’s emergency powers “have been misused and abused.”\nOther proposals would:\n— Eliminate the governor’s power to order vaccines for “a highly contagious and highly fatal disease with transmission characteristics similar to smallpox.”\n— Require hospitals and nursing homes to allow clergy to visit patients, unless it’s prohibited by the federal government.",
    "Rep. Leo Biasucci, a Republican from Lake Havasu City who introduced the House version, said he was appalled that mom-and-pop business were forced to close during the early days of the pandemic while big chains like Walmart were allowed to keep their doors open.",
    "Several of the proposals advanced through House and Senate committees this week, including bills in both chambers eliminating the authority for mayors and county supervisors to order businesses closed during an emergency.",
    "Ducey last year signed a budget bill that included similar provisions, but they were later thrown out when the Supreme Court ruled lawmakers can’t stuff the budget with policies unrelated to the state’s spending plan.",
    "Last week, a Senate committee voted to put limits on the governor’s authority to declare a public health emergency, which opens broad powers to spend money and impose emergency restrictions on people and businesses.",
    "“I believe all emergencies are local and we ought to allow the local agency or government to make those decisions because they’re closer to the situation,” said Sen. Sally Ann Gonzales, a Democrat from Tucson.",
    "“And it was selective.”\nThere’s a difference between a life-threatening situation and “something that will go on for years under the guise of a pandemic,” said Rep. Mark Finchem, a Republican from Oro Valley.",
    "Injuries linked to COVID-19 vaccines have been extremely rare with just under 540 million doses administered in the United States, according to the Centers for Disease Control and Prevention.",
    "Arizona Republicans are looking to curtail the government’s emergency powers, which they say were abused by elected officials from the governor on down in response to the COVID-19 pandemic.",
    "Other proposals look to enhance the rights of individuals to resist health protocols, such as treating vaccination status the same as race or sex in employment nondiscrimination laws.",
    "After 120 days, the governor would have to get approval from the Legislature to continue the emergency declaration, and lawmakers would have to approve its extension every 30 days.",
    "Democrats, echoing the sentiments of local government officials, said the measure would take away important authority that leaders need to respond to extraordinary emergencies.",
    "Employers also could face hefty fines if they fire a worker for refusing to get vaccinated, or if an employee is injured from a vaccine they get due to a job mandate.",
    "A House committee on Tuesday advanced a bill requiring employers to rehire or pay a year’s salary to people fired for refusing to comply with a vaccine mandate.",
    "Their ideas range from eliminating the power to shutter businesses or churches to requiring legislative approval for emergencies lasting longer than 120 days.",
    "Some Republican lawmakers have been highly critical of Ducey’s use of emergency powers, which they say went too far in limiting personal freedoms.",
    "“That was the first time I think we’ve seen in history that businesses were told, ‘You must shut down,’” Biasucci said during a committee hearing.",
    "Now, the emergency declaration allows him to prohibit local governments from closing businesses or enacting their own mask or vaccine mandates.",
    "Meanwhile, many Democrats say his response was far too tepid, allowing Arizona to have some of the highest case numbers in the country.",
    "Ducey’s emergency declaration has been in place for nearly two years, though his restrictive orders have expired.",
    "— Classify religious services as essential services that can’t be closed in the event of a health emergency.",
    "Walmart stayed open because it sells essential items such as groceries.",
    "The measure would apply retroactively to people fired since Dec. 1.",
    "The measure would take effect next year as Republican Gov.",
    "Doug Ducey leaves office."
  ]
}