{
  "id": 3415,
  "mediaId": 2629,
  "date": "2022-01-31",
  "headline": "Nevada Candidate For Secretary Of State Vows To ‘Fix 2020 Like Trump Said'",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTIwODAwNC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3MzI0Nzg2MX0.8AYiTIJIFP7i7FplGIW1Blhbb0KqYj2W-g4Yh3cSleg/img.jpg?width=1200&coordinates=0%2C46%2C0%2C47&height=600",
  "link": "https://www.nationalmemo.com/nevad",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Axelrod",
  "authorUrl": "https://www.nationalmemo.com/u/joshaxelrod",
  "termIds": [
    0
  ],
  "sentences": [
    "\"In 2004, the Democrats — specifically George Soros, Harry Reid, and others of their ilk — hatched a plan, called the Secretaries of State project, and it was designed to get progressive liberal secretaries of states elected in all the key swing states like Wisconsin, Pennsylvania, Georgia, Arizona, Nevada, Colorado and they succeeded,\" Marchant told right-wing radio host Eddie Floyd in a January 19 interview.",
    "Kristina Karamo, a Republican running to be Michigan's next secretary of state with Trump's backing, has falsely claimed antifascist protesters were behind the January 6, 2021, insurrection at the U.S. Capitol in Washington, D.C.\nBiden won Michigan by more than 154,000 votes, flipping it from red to blue after Trump won the state in 2016.",
    "In a recent interview, Marchant promoted a baseless conspiracy theory claiming that Democrats -- including former Senate Majority Leader Harry Reid (D-NV) and billionaire mega-donor George Soros -- hatched a scheme almost 20 years ago to elect progressive secretaries of state as part of an effort to undermine U.S. elections.",
    "These candidates, who all have ties to the fringe conspiracy theory movement QAnon, including Marchant, are running to promote the \"Big Lie\" — a baseless conspiracy theory that claims former President Donald Trump won the 2020 election, even though Biden won the race by seven million more votes.",
    "Former Nevada Secretary of State Dean Heller said he told Trump, \"the only way we can guarantee that, in 2024, we have a Republican president is we need a leader here in the state of Nevada that understands our election laws and [is] willing to change them.\"",
    "If elected as Nevada's top elections official, Marchant said he would get rid of the state's voting machines entirely and would do away with early voting and mail-in voting while installing \"our people\" to oversee polling locations on Election Day.",
    "In a January 4 interview with former Trump campaign chief Steve Bannon, Marchant called himself part of \"a coalition of American First secretary of state candidates\" who are working \"behind the scenes to try to fix 2020 like President Trump said.\"",
    "A Nevada candidate jockeying to run the state's elections is pledging to help overturn the 2020 election results, all while promoting an anti-Semitic conspiracy theory that George Soros and his \"cabal\" are to blame for election losses.",
    "Marchant added that Trump loyalists like himself are running to be top elections officials in Michigan, Georgia, and Arizona — all of which will likely be crucial battleground states in the 2024 presidential election.",
    "Anti-Semites have long used the word \"cabal\" as a dog-whistle to refer to a small, secretive, powerful group of Jews who they claim manipulate global affairs from behind the scenes.",
    "And Mark Finchem, an Arizona state lawmaker who stood near the Capitol as insurrectionists smashed windows on January 6, is running to be Arizona's next secretary of state.",
    "And one of his opponents, Las Vegas Councilwoman Michele Fiore called the 2020 presidential election \"perhaps the most poorly administered election in American history.\"",
    "Rep. Jody Hice (R-GA) intends to primary Georgia Secretary of State Brad Raffensperger, who Trump tried to intimidate with his call to \"find 11,780\" votes last January.",
    "Anti-Semitic conspiracy theories often invoke Soros, a billionaire philanthropist and Holocaust survivor, as proof of outsized Jewish influence.",
    "While Reid himself was Mormon, he upheld his wife's family's Jewish faith while raising their five children together for more than 60 years.",
    "He's already racked up endorsements from Reps. Paul Gosar (R-AZ) and Andy Biggs (R-AZ), and former White House Chief of Staff Mark Meadows.",
    "Currently, pollsters view the Nevada gubernatorial race as a toss-up with Heller seen as a Republican front-runner in the primary.",
    "He is now running for secretary of state in Nevada, where President Joe Biden defeated Trump by more than 33,000 votes in 2020.",
    "Marchant, a former member of the Nevada state Assembly, is the sole Republican candidate for secretary of the Silver State.",
    "Jim Marchant is an avid supporter of former President Donald Trump who ran an unsuccessful campaign for Congress in 2020.",
    "\"That's why George Soros, Harry Reid, and the cabal — they understood how important the secretary of state races were.\"",
    "At the top of the state ticket, two gubernatorial candidates have staked their candidacies on the Big Lie too.",
    "Still, he attempted to challenge the results, claiming election fraud, despite lacking any material evidence.",
    "Adam Laxalt, Nevada's former attorney general who is now running for Senate, endorsed Marchant last week.",
    "In a viral ad, she used a gun holstered to her hip to shatter a beer bottle labeled “voter fraud.\"",
    "Marchant isn't the only Nevada Republican looking to wield influence over the 2024 election.",
    "Soros is a Hungarian Jew who survived the Holocaust and emigrated to America in 1956.",
    "Marchant ran for Congress in 2020 and lost his bid by more than 16,000 votes.",
    "\"And the election of 2020 is a direct result of that plan,\" he added.",
    "Reid, who died in December, married his wife, Landra Gould, in 1959.",
    "A judge threw out the case.",
    "Nevada"
  ]
}