{
  "id": 3480,
  "mediaId": 8475,
  "date": "2022-01-28",
  "headline": "Arizona businesses with vaccine mandates would face $500K lawsuits under GOP proposal",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/012822_vax_protest_081421.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/012822_gop_mandate_lawsuit_bill/arizona-businesses-with-vaccine-mandates-would-face-500k-lawsuits-under-gop-proposal/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gloria Gomez",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110050",
  "termIds": [
    0
  ],
  "sentences": [
    "Local\nEmployees who aren’t granted religious exemptions could file suit alleging injury\nArizonan businesses would be on the hook for half a million dollars in damages if they refuse a religious exemption from an employee who later experiences significant injury as a result of getting vaccinated under a proposal advancing in the GOP-controlled legislature.",
    "Sherbert v. Verner, in which the Supreme Court determined a Seventh-Day Adventist was unfairly denied unemployment benefits because of her religious practice of not working on Saturday, opened the door for religious exemptions to laws that trespass on sincerely held beliefs.",
    "Tom Savage, a lobbyist for the League of Arizona Cities and Towns, noted that the bill isn’t clear about what constitutes a “significant injury” related to a vaccination, which could lead to costly litigation because it’s left open to interpretation.",
    "Donny Rodenkirk, from Nguyen’s district, told the committee that his wife’s employer denied her religious exemption request, which forced her to take a vaccine that he claimed negatively impacted her health, resulting in the sudden onset of seizures.",
    "The number of deaths, meanwhile, is inflated by the fact that health care providers are required to report any death after vaccination to the VAERS system, even if it was clearly unrelated, as in the case of a heart attack or car accident.",
    "One case study of a man with sudden onset non-motor seizures after being vaccinated was unable to link the two, and posited instead that the condition may have been caused by genetic factors and might be entirely unrelated to the vaccine.",
    "A religious exemption, however, doesn’t cover political or philosophical objections to the vaccine — objections which have become increasingly common, particularly as the COVID-19 pandemic became politically polarized.",
    "Nguyen questioned why hospitals couldn’t be satisfied with implementing PPE policies instead of requiring vaccinations and ignoring religious exemptions — requirements the U.S. Supreme Court upheld earlier this month.",
    "“Legislation providing new ways to sue businesses during the pandemic reverses course and hurts the policy progress we have made to date,” she said, referencing a bill that had been brought up as a concern previously.",
    "The Brush & Nib Studio v. City of Phoenix case, in which a business refused to provide custom invitations for same-sex weddings, set a precedent for private businesses to make rules that best fit them, he said.",
    "This information is taken from the Vaccine Adverse Event Reporting System, or VAERS, available on the CDC website — but anyone can submit an unverified claim about side effects to the system.",
    "Rep. Melody Hernandez, D-Tempe, had noted a potential conflict with last year’s Senate Bill 1377, which protects entities from lawsuits relating to damages incurred by the pandemic.",
    "Blackman said that the Civil Rights Act of 1964 protected the religious rights of all citizens and Parker said that the bill helped enshrine their “sacred” First Amendment rights.",
    "Employers who both deny a religious exemption and require a vaccination for continued employment would open themselves up to lawsuits from employees who report adverse effects.",
    "Nguyen brought up the concerns of hospitals and waved a hand across the room towards his Democratic colleagues on the committee, all four of whom wore masks.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "Both the federal Civil Rights Act and the Arizona Civil Rights Act require employers to reasonably accommodate the religious beliefs of their employees.",
    "Rep. Mark Finchem, R-Oro Valley, responded by asking if it was moral to hold someone’s job “hostage” until they were vaccinated against their will.",
    "Mike Huckins, the chief lobbyist for the Greater Phoenix Chamber of Commerce, said approving the bill would have consequences for local businesses.",
    "The bill, he said, isn’t about punishing businesses, but rather about encouraging them to consider very seriously requests for religious exemption.",
    "Nguyen’s HB2043 doesn’t define what a religious exemption is, nor does it solve the problem of what to do with petitions on non-religious grounds.",
    "Committee Chairman Walt Blackman, R-Snowflake, and Vice Chairwoman Jacqueline Parker, R-Mesa, both invoked the Constitution in their explanations.",
    "Legislators, Coolidge said, had already decided to leave pandemic-related injury claims under the purview of the worker’s compensation program.",
    "The UA School of Journalism started the fellowship in 1977 to honor Don Bolles, an Arizona Republic reporter killed in a 1976 car bombing.",
    "House Bill 2043, introduced by Prescott Republican Rep. Quang Nguyen, was approved by the House Judiciary Committee on Wednesday morning.",
    "An investigation of more than 19,500 recently vaccinated adults found the incidence of very serious adverse effects to be extremely low.",
    "Nguyen’s bill does not indicate who decides whether the reported injury was the result of vaccination or how that determination is made.",
    "HB2043 allows for damages awarded in addition to any worker’s compensation the employee may pursue — it doesn’t rule out access to it.",
    "If employees sue, they stand to gain a minimum of $500,000 — more if the court finds the damages and costs of the lawsuit are higher.",
    "Deciding which injuries are caused by the vaccine is also muddy, given injuries could arise from a host of unrelated factors.",
    "“Why not create an environment where they can continue to work, and not lose their income, their livelihood?” Nguyen asked.",
    "He added that the recent U.S. Supreme Court ruling partially upheld an employer’s right to implement vaccination mandates.",
    "Huckins said he recognized there were very personal beliefs at stake, but his organization is defending employer’s rights.",
    "This new bill would instead add another system for claims to fall under, doubling the potential impact on businesses.",
    "Rep. Shawnna Bolick, R-Phoenix, asked if the Phoenix Chamber tracks how many religious exemptions have been denied.",
    "“If you look across over there, everyone is wearing a mask — it doesn’t prohibit them from working today,” he said.",
    "In spite of scarce evidence that the COVID-19 vaccine causes adverse effects, skepticism about its safety persists.",
    "In a state of more than 7 million, that’s a little over 800,000 Arizonans who have reservations about the vaccine.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "Other Republicans said they viewed the legislation as purely punitive for businesses — and that’s a good thing.",
    "Gloria Gomez is a senior at the University of Arizona and the 2022 UA School of Journalism’s Don Bolles Fellow.",
    "Rep. Domingo DeGrazia, D-Tucson, voted against the bill based on structural issues and historical conflicts.",
    "Among this subgroup, 58.8% didn’t trust the vaccines themselves and 50.2% cited mistrust of the government.",
    "A Census Bureau survey found that vaccine hesitancy in Arizona was around 11.1% in October of last year.",
    "Nguyen stated that one million side effects for the vaccine and 21,000 deaths were reported by the CDC.",
    "He likened this to hospitals and medical staff using personal protective equipment, or PPE, like masks.",
    "Hospitals could, he suggested, instead require employees to wear two masks or two sets of gloves.",
    "The potential harm makes no distinction between a business of two people and a business of 5,000.",
    "“We believe this bill could subject taxpayers to pay for unsubstantiated injury claims,” he said.",
    "The $500,000 in damages would be a sizable financial burden for most businesses, Huckins said.",
    "Nguyen took issue with Huckins’ claim that the bill would have profound effects on businesses.",
    "Members who voted in favor of it made a point of stating their support for small businesses.",
    "Arizona Chamber of Commerce & Industry lobbyist Courtney Coolidge echoed Huckins’ concerns.",
    "“I am pro-business, but somebody has to be held liable for these injuries,” Nguyen said.",
    "Committee members shared their thoughts on the bill before voting 6-4 to approve it.",
    "“Employees already have a remedy through the worker’s compensation fund,” he said.",
    "An October 2021 poll found 60% of unvaccinated people identified as Republican.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson!",
    "Allergic reactions occurred in just 0.3% of participants after the first dose.",
    "From there, it’ll move to the full House of Representatives for consideration.",
    "Employees’ religious beliefs are already protected under state law, he noted.",
    "By contrast, the average worker’s compensation settlement is around $20,000.",
    "These are actually misrepresented CDC data about adverse events.",
    "Serious adverse effects from the vaccine are incredibly rare.",
    "Committee staff said they would follow up on the concern.",
    "No medical diagnosis is required to sue an employer.",
    "It’s to send a message,” Finchem said.",
    "Donate to TucsonSentinel.com today!",
    "Huckins replied that it does not.",
    "Yeah, I think it’s meant to be.",
    "“Do I think it’s excessive?",
    "- 30 -"
  ]
}