{
  "id": 3636,
  "mediaId": 2662,
  "date": "2022-01-26",
  "headline": "EXCLUSIVE: AZ State Rep. Mark Finchem Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/9A725E7F-05E2-434F-96DE-FD5B9D5CE8BC.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/01/exclusive-az-state-rep-mark-finchem-working-resolution-reclaim-arizonas-2020-electors-actually-resolution-markup-right-now-video/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    3401,
    2246,
    1394,
    1458,
    105,
    37,
    613,
    5949,
    6729
  ],
  "sentences": [
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nArizona State Representative and Trump-endorsed candidate for Secretary of State Mark Finchem told The Gateway Pundit that he is already working on a five-page resolution to reclaim Arizona’s electors.",
    "**HUGE BREAKING NEWS** — Wisconsin Assembly Votes to Advance Rep. Ramthun’s Resolution to Reclaim Wisconsin’s Electors For President and Vice President That Were Certified Under Fraudulent Purposes — VIDEO\nThe Arizona Legislature is also drafting new laws to secure elections and following Wisconsin’s lead on the 2020 election.",
    "BREAKING: Arizona Senate Committee Passes SEVEN Election Integrity Bills – Including Ballot Fraud Countermeasures, Ballot Images Will Be Public Records\nThe Gateway Pundit correspondent Jordan Conradson spoke to Rep. Finchem about new election laws, Arizona’s fraudulent electors, and his upcoming event in McAllen, Texas.",
    "“We have a mountain of evidence,” said Finchem, and more is being delivered to Attorney General Mark Brnovich daily.”\nThe Gateway Pundit reported that The Arizona Senate Government Committee recently passed seven sweeping election security measures.",
    "MUST SEE: Arizona Senate President Karen Fann Gives Exclusive Update On Maricopa County Router Audit – AZ Attorney General Has Pulled Numerous People For Questioning\nContact Arizona Attorney General Mark Brnovich to demand justice.",
    "Here in Arizona, we have a mountain of evidence, in fact, the resolution that I’m putting together right now we have five pages, and that is growing because more evidence is being turned over to our attorney general’s office.",
    "The Wisconsin General Assembly voted on Tuesday to advance Rep. Tim Ramthun’s resolution to reclaim the 2020 electors for President and Vice President who were certified under fraudulent purposes.",
    "The mountain of evidence was delivered to Attorney General Brnovich four months ago and Arizona tirelessly awaits the results of his investigation and the ongoing audit of the election routers.",
    "Contact Arizona Legislators and demand a yes vote to reclaim Arizona’s fraudulently certified 2020 electors.",
    "I was just reviewing some of the case law that supports the duty of the legislature to act.",
    "Finchem revealed that he is working on a resolution to reclaim Arizona’s 2020 electors!",
    "In fact, in the history of our nation, this has not happened more than just a handful.",
    "The Gateway Pundit reported on this huge breaking news yesterday.",
    "Finchem: Well, I actually have a resolution in markup right now.",
    "We just want to make sure, I mean, this is historic.",
    "We are dotting our T’s, crossing our I’s.",
    "of times over the entire 250 plus years.",
    "It’s beyond clear and convincing.",
    "It doesn’t happen very often.",
    "It’s not an option.",
    "We have a duty.",
    "It’s a duty."
  ]
}