{
  "id": 3969,
  "mediaId": 2627,
  "date": "2022-01-25",
  "headline": "In Trump’s honor, Arizona Republicans approve conspiracy-based election bills",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-01/220125-one-time-use-arizona-election-trump-supporters-cs-48e6b4.jpg",
  "link": "https://www.msnbc.com/the-reidout/reidout-blog/arizona-republicans-approve-election-bills-echo-trumps-baseless-claims-rcna13499",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ja'han Jones",
  "authorUrl": "https://www.msnbc.com/author/ja-jones-ncpn371241",
  "termIds": [
    2246,
    2765,
    2706,
    4905,
    1489,
    1126,
    1312,
    5949,
    6515
  ],
  "sentences": [
    "Among them are provisions that would widen the margin of votes that can trigger a recount (Trump wasn't within 0.1 percent of Biden's total, which is the current requirement); mandates to audit voting machines and use new “anti-fraud” paper for ballots (Trump and other conspiracy theorists falsely claimed Arizona’s machines and ballots were rigged to hurt Republicans); and a ban on cities and school boards hosting mail-in elections (Trump has flat-out stated that easier access to voting hurts Republicans).",
    "The committee also approved measures that would require the state to keep and publish pictures of each ballot, purge voters from the voter rolls and request approval from the federal government to institute new requirements for voters to prove their citizenship.",
    "The bills are yet another example of the ways Republicans inside and outside Arizona, including Trump himself, have made the state a petri dish for right-wing conspiracy theorists to watch their lies proliferate and — potentially — become policy.",
    "In advancing these irrational election bills, Arizona Republicans are making it abundantly clear that they’re eager to do their part in hurtling the state toward antidemocratic rule, all in the name of their unrelenting worship of Trump.",
    "An Arizona Senate committee led by Republicans approved a series of conspiratorial election measures on Monday apparently inspired by former President Donald Trump’s baseless claim that he lost re-election due to voter fraud.",
    "That news would be worrying enough on its own, but it comes during a time when Trump loyalists are looking to maximize his influence by embedding themselves in some of Arizona’s most powerful positions.",
    "Mark Finchem, a QAnon conspiracy theorist with ties to the extremist group Oath Keepers, is Trump’s chosen candidate for Arizona secretary of state.",
    "Arizona Republicans are essentially responding to Trump's tantrums by passing election laws that affirm his delusional claims about why he lost.",
    "Kari Lake, an avowed conspiracy theorist and a former anchor for Phoenix’s Fox affiliate, is Trump’s chosen candidate for governor.",
    "The Arizona Republic spotlighted the seven bills passed along party lines by Arizona's Senate Government Committee.",
    "The bills now advance to the Senate Rules Committee before heading to the state Senate for approval.",
    "If passed, the state House of Representatives will consider them."
  ]
}