{
  "id": 4040,
  "mediaId": 2748,
  "date": "2022-01-27",
  "headline": "BREAKING: Arizona Senate Committee Passes SEVEN Election Integrity Bills – Including Ballot Fraud Countermeasures, Ballot Images Will Be Public Records",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4Ey7gjR2hPNf_Ou6n_q-6gEafoKFfYjVlbGpeRabwJWm2me7gdpgXmKN2Z9HazshDyUCQWPYRza66nObwFsRPouVCaSdjdd4Al1MTb4V2s-SJh0rjU7kvgLWdI_TDJxmqqiYoUojSnpfZWh0NErWe_OG_DnianiZ8NaeSsZ-PhpTX8hdPWf9Aw=w1200-h630-p-k-no-nu",
  "link": "http://www.womensystems.com/2022/01/breaking-arizona-senate-committee.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Women System",
  "authorUrl": "https://www.blogger.com/profile/03123176379654101986",
  "termIds": [
    0
  ],
  "sentences": [
    "The Arizona audit discovered evidence of over 700,000 ballot discrepancies and law violations that occurred during the 2020 Presidential Election, and the Arizona Legislature is working to secure elections in 2022 and beyond.",
    "The newly passed legislation covers recount margins, adds currency grade fraud measures to ballots, makes ballot images public records, prevents elections by mail, and fights illegal voters using the “federal only” loophole.",
    "Gubernatorial Candidate Kari Lake also commented on this bill, saying,\nLake: I’m going to be on the ballot, and I’m worried about what happened to President Trump happening to me and others, Democrat and Republican.",
    "The Gateway Pundit reported on the call to action days before the Government Committee considered twelve bills, eight of which passed and will now move to the Senate floor after additional hearings.",
    "The Gateway Pundit reported on these election integrity measures unveiled by Arizona State Representative and Trump-endorsed candidate for Secretary of State Mark Finchem.",
    "After The Gateway Pundit reported on the meeting, Patriots filled the room to show their support for election integrity and request to speak on the newly proposed bills.",
    "“We vote in private, but we count in public, and your ballot is a public record, and it should be made that transparent,” said Arizona State Senator Sonny Borrelli.",
    "Ballots do not contain voters’ personal information, and they will remain anonymous but publicly available for the 22-month record retention period under SB1119.",
    "The audit is still ongoing, but The Arizona Senate delivered election-changing evidence of fraud to Arizona Attorney General Mark Brnovich four months ago.",
    "If passed in full, SB1119 and SB1120 will make ballot images available to voters and require ballots to be printed with ballot fraud countermeasures.",
    "SB11120 will require counties to use standardized ballots with 19 different security features, including a holographic design and watermarks.",
    "The Arizona Senate-led audit of Maricopa County discovered that the County used ten different paper types in the 2020 election.",
    "Seven critical election integrity bills were passed by Republicans on the Arizona Senate Government Committee Monday.",
    "Many in the legislature look to recall the fraudulent 2020 Presidential and Vice Presidential Electors this session.",
    "Attendees of the meeting were asked to do “jazz hands” instead of clapping to keep order in the meeting room.",
    "These bills are designed to make elections fully transparent with an auditable trail of secure ballots.",
    "The new ballots will also have QR codes that enable voters to track their votes using a smartphone.",
    "Republicans on this committee outnumbered Democrats 4:3, and every bill passed on party lines.",
    "Trump-endorsed Arizona Gubernatorial Candidate Kari Lake was also there to speak on a bill.",
    "And I urge you to support this bill and any other bill that would shore up our elections.",
    "Arizona Senate Majority Whip Sonny Borrelli introduced these bills in the Senate.",
    "The bill will standardize the ballots and make it easier to audit the vote.",
    "The brand new election security measures received loud rounds of applause.",
    "Democrats voted no on these bills citing bandwidth and price concerns.",
    "Arizona anxiously awaits the results of his criminal investigation.",
    "The remaining bills were rescheduled for the committee due to time.",
    "Ballots should be standardized in a way that cannot be replicated.",
    "Democrats did not vote for a single election integrity measure.",
    "The estimated cost is a mere 25 cents per ballot.",
    "Seven bills passed concentrated on elections.",
    "Free and fair elections are priceless."
  ]
}