{
  "id": 4063,
  "mediaId": 2550,
  "date": "2022-01-24",
  "headline": "Newly uncovered MAGA emails show a sinister conspiracy to refute Biden's win and bestow it on Trump",
  "image": "https://images.dailykos.com/images/1030127/story_image/GettyImages-1364898453.jpg?1643050868",
  "link": "https://www.dailykos.com/stories/2076481",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebekah Sager",
  "authorUrl": "/users/rebekah sager",
  "termIds": [
    5292,
    5114,
    2246,
    2765,
    3037,
    4411,
    3922,
    4832,
    4905,
    5949
  ],
  "sentences": [
    "Three days later, on Dec. 11, Waldron emailed three Arizona Republican lawmakers—Borrelli, Finchem, and Sen. Eddie Farnsworth, a Republican who chaired the judiciary committee—offering pages of “evidence” to use to prove the Dominion Voting Systems were creating “fraudulent” ballots or ballots that “were not cast by voters.” Despite the fact that Gates, found errors in the emails, Sen. Farnsworth decided to subpoena information about Maricopa County’s software and hardware provided by Dominion.",
    "The gist of his plan, Waldron wrote, was this: “This will allow us to pull invalid votes out of the totals ‘By Candidate’ so that your state can certify normal elections and potentially not have to take extra legislative action.”\nSen. Borrelli forwarded the email to every Republican in the Arizona Senate, Rolling Stone reports.",
    "But, as we’re learning more every day, despite the fact that Trump lost most of the 62 lawsuits filed in one of six states—Arizona, Georgia, Michigan, Nevada, Pennsylvania, and Wisconsin—the point wasn’t ever to overturn Biden’s win but to set the stage for an elaborate excuse to disenfranchise Black and brown voters.",
    "The infamous PowerPoint presentation explained how Republicans could overthrow the elected government of the U.S.\nAs reported by Daily Kos’ Mark Sumner, Waldron’s 36-slide PowerPoint presentation was made to Republicans in Congress.",
    "Waldron appeared on a conservative Christian podcast and told the podcast hosts the usual conspiracy nonsense—cabals of evil organ snatchers, George Soros, hacked voting machines in the U.S.—blah, blah, blah.",
    "“This is obviously people from outside, along with Trump and his lieutenants, pushing this.”\nThe emails are primarily crafted by a man named James P. “Phil” Waldron, a retired Army colonel, and bar owner.",
    "The emails show involvement by numerous MAGA crew, including Mark Finchem, a candidate for secretary of State in Arizona, which is terrifying because should he win, he would oversee elections in Arizona.",
    "“Trump’s ‘big lie’ has given Republicans in the states a permission framework to try to gain an advantage by changing the rules,” said Chris Sautter, a Democratic election lawyer based in Washington, DC.",
    "Bill Gates, the Republican chairman of the Maricopa County Board of Supervisors, stood his ground following Biden’s win, much to the danger of himself and his family, who were threatened and harassed.",
    "Ellis was a ubiquitous figure at Trump rallies, standing alongside Trump attorney Rudy Guiliani, while Kerik played a more underground role in records showing his determination to find election fraud.",
    "First obtained by the watchdog group American Oversight and then provided to Rolling Stone magazine, the emails reveal a labyrinth plan for MAGA cronies to attempt to undermine the 2020 election.",
    "On Dec. 8, Waldon emailed Arizona state Sen. Sonny Borrelli, a Republican, telling him, “We have the capability to identify fraudulent ballots via optical scanning technology,” Waldron wrote.",
    "House committee subpoenaed him, demanding information about a damning PowerPoint he crafted and then circulated on Capitol Hill and to Mark Meadows, Trump’s former chief of staff.",
    "According to Rolling Stone, after Gates reviewed the emails he said they showed MAGA supporters and lawmakers “trying to figure out that hail-mary pass” to overturn the election.",
    "In response to this, Congressmembers not only texted Meadows in apparent eagerness to comply but provided their own suggestions for how events could be accelerated.",
    "But equally important the emails attempted to make the case to GOP lawmakers in Arizona about how to find alleged election crimes and how to challenge the outcome.",
    "Newly released emails reveal a sinister conspiracy to overthrow President Joe Biden’s win in Arizona and bestow it upon his unworthy opponent.",
    "All of this forced the Arizona Senate to hand-count over 2 million ballots in 2020, costing millions and ultimately ensuring Biden’s victory.",
    "“This is all about Republicans creating a more favorable playing field for them to win in ‘22 and ‘24,” Sautter told Al Jazeera.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Two Trump advisors, in particular, campaign lawyer Jenna Ellis and legal adviser Bernie Kerik, appear to be on multiple emails.",
    "In the new emails, Waldron then reached out to multiple Republican Arizona lawmakers, pushing them to find evidence of fraud.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "“This is part and parcel of it.”\nGates also acknowledged that the efforts came from outside of the state.",
    "“They’re drawing up the hail-mary pass that obviously culminated on January 6,” he adds.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Both have been subpoenaed by the Jan. 6 select committee.",
    "Not a single voice was raised in protest.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Trump rally in Arizona.",
    "Please read it.",
    "The Jan. 6."
  ]
}