{
  "id": 4822,
  "mediaId": 2766,
  "date": "2022-04-23",
  "headline": "Democrats Attempt to Disqualify Reps Gosar, Biggs, Finchem; Court Dismissed the Attempt.",
  "image": "https://conservativefiringline.com/wp-content/uploads/2022/04/Screenshot-619.png",
  "link": "https://conservativefiringline.com/democrats-attempt-to-disqualify-reps-gosar-biggs-finchem-court-dismissed-the-attempt/",
  "mediaOutlet": "conservativefiringline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Faye Higbee",
  "authorUrl": "https://conservativefiringline.com/author/fhigbee/",
  "termIds": [
    5399,
    2246,
    2443,
    2426,
    3172,
    1489,
    1433,
    1126,
    392
  ],
  "sentences": [
    "No person shall be a Senator or Representative in Congress, or elector of President and Vice-President, or hold any office, civil or military, under the United States, or under any State, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.",
    "“Congress has not created a civil private right of action to allow a citizen to enforce the Disqualification Clause by having a person declared to be ‘not qualified’ to hold public office…\nIn sum, even assuming arguendo that the court were to accept plaintiffs’ argument that Arizona (and not just Congress) had the power to create a private right of action to enforce the Disqualification Clause, A.R.S.",
    "Facebook, Google, and other members of the Silicon Valley Axis of Evil are now doing everything they can to deliberately silence conservative content online, so please be sure to check out our MeWe page here, check us out at ProAmerica Only and follow us at Parler, Social Cross and Gab.",
    "To expand the inquiry to include disqualifications—or who is proscribed from holding office—would re-write the applicable statute and create a cause of action and remedy in a statutorily-created body of law.",
    "This would be contrary to established precedent.”\nJudge Christopher Coury (The Epoch Times)\nDemocrats tried to disqualify Rep Madison Cawthorn from the ballot in a similar filing, and failed.",
    "While you’re at it, be sure to check out our friends at Whatfinger News, the Internet’s conservative front-page founded by ex-military!And be sure to check out our friends at Trending Views:",
    "They filed a lawsuit to stop Reps Paul Gosar, Andy Biggs, and State House Rep Mark Finchem alleging that they participated in an “insurrection” stemming from the Jan 6 riot.",
    "The section clearly states that Congress has the say in determining whether to disqaulify someone, not the individual, and it must be by a 2/3 majority of BOTH houses.",
    "Section 3, 14th amendment (A civil war section)\nThe lawsuit to disqualify these Reps was filed by members of two leftist groups linked to Socialist Bernie Sanders.",
    "The judge tossed the leftist lawsuit, stating that the Constitution doesn’t give individuals the right to enforce Section 3 of the 14th Amendment.",
    "The Kangaroo court will be resolved by a judge who will turn over the findings to Georgia Secretary of State Brad Raffensberger.",
    "Democrats have been doing everything in their power to disqualify any Republican they don’t like from running for office again.",
    "You can also follow us on Twitter at @co_firing_line, and at the new social media site set up by members of Team Trump, GETTR.",
    "(The Epoch Times)\nThe purpose of all these Democrat leftist dirty tricks is to stop Trump from running again.",
    "H/T Uncle Sam’s Misguided Children\nTurn your back on Big Tech oligarchs and join the New Resistance NOW!",
    "Currently Rep Marjorie Green is also under a filing, but the judge allowed the case to proceed.",
    "Three judges: two conservatives, one liberal who is related to an NPR correspondent.",
    "It will be up to him to decide her fate, in spite of the Constitution or its intent.",
    "But Congress may by a vote of two-thirds of each House, remove such disability.",
    "Two of the three lawsuits were dumped by the courts.",
    "Greene testified on Friday in an Atlanta courtoom.",
    "The third is purely a political s***show.",
    "§ 16-351(B) does not do this."
  ]
}