{
  "id": 6051,
  "mediaId": 2668,
  "date": "2022-04-22",
  "headline": "Effort to Block GOP Reps From Running Because of Jan. 6 Goes Down to Withering Defeat",
  "image": "https://media.townhall.com/townhall/reu/o/2022/39/0e25cc49-be67-4cb8-8555-e2494b428c70-1110x740.jpg",
  "link": "https://redstate.com/nick-arama/2022/04/22/effort-to-block-gop-reps-from-running-because-of-jan-6-goes-down-to-withering-defeat-n554723",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Arama",
  "authorUrl": "https://redstate.com/author/nick-arama",
  "termIds": [
    2187,
    2246,
    4905,
    4066,
    2426,
    2443,
    1126,
    392,
    99,
    5949
  ],
  "sentences": [
    "The plaintiffs in the case, the group Free Speech for the People (more irony), are trying to use Section 3 of the 14th Amendment to the Constitution, which prohibits elected officials from engaging in an insurrection or rebellion to knock Rep. Paul Gosar (R-AZ), Rep. Andy Biggs (R-AZ) and state Rep. Mark Finchem (who’s running for Secretary of State) off the ballot in Arizona.",
    "In his advisory opinion, Coury noted that Finchem, Gosar and Biggs have not been “charged with or convicted of any state or federal crime that relates to insurrection or rebellion.”\nBoth Biggs and Gosar argued that only Congress has the constitutional power to judge the qualifications of its members, an argument that Coury found persuasive.",
    "“Moreover, a state judicial trial relating to the qualifications of Rep. Biggs and Rep. Gosar arguably implicates the doctrines of federalism and separation of powers between the branches of the government.”\nThere’s also a case currently ongoing against Rep. Marjorie Taylor Greene (R-GA).",
    "“It would contradict the plain language of the United States Constitution for this Court to conduct any trial over the qualifications of a member of Congress,” Coury’s opinion said.",
    "They’re going to try to play the Jan. 6 committee for all its worth, in the hopes that they find things to hurt Republicans with, like the tape of Rep. Kevin McCarthy (R-CA).",
    "But the effort to block out the Republicans didn’t fly in court, and the case was booted by the Arizona judge, who found they didn’t have a private right of action.",
    "They’re also trying the gambit of trying to block out some Republicans by accusing them of being “insurrectionists” and filing cases to keep them off the ballot.",
    "Gosar and Biggs did vote to not accept the electoral count from some states — much the same way as many Democrats have done after prior presidential elections.",
    "Now, that case should have already been booted for the same reasons, but ultimately she should prevail (assuming the court is paying attention to the law).",
    "Except there were a few problems with the argument — none of the three were involved in the Jan. 6 riot that Democrats have tried to call an insurrection.",
    "When the Democrats did it, they claimed they were preserving democracy, but when Republicans did it, the Democrats claimed they were attacking democracy.",
    "But it’s well deserved because of the horrible policies they’ve put forth, and the terrible job that Joe Biden has done.",
    "That’s not an “insurrection” — indeed, that’s part of their power as members of Congress to accept the count (or not).",
    "Yet, it’s Democrats who are pre-emptively trying to keep Republicans off the ballot so the voters can’t vote for them.",
    "Anyone trying to block out the GOP like this doesn’t believe in allowing the voters to decide for themselves.",
    "The irony of that is that they’re claiming that the Republicans were behind efforts to overcome the election.",
    "They’re trying to block the will of the people — while hypocritically pretending to protect it.",
    "They’re trying the redistricting game in the hopes that they can steal some seats that way.",
    "Democrats are up a creek without a paddle as we head toward the midterms.",
    "A similar case against Rep. Madison Cawthorn (R-NC) was also dismissed.",
    "Plaintiffs tried to claim they had involvement in the rally on Jan. 6.",
    "They know that they are quite likely to get slaughtered badly.",
    "But the rally and the riot are two separate things.",
    "So, they don’t have too many options.",
    "Talk about losing the plot.",
    "Such hypocrisy."
  ]
}