{
  "id": 7305,
  "mediaId": 2688,
  "date": "2022-04-08",
  "headline": "Manhattan DA Wants You To Know His Trump Probe Isn’t Dead, Okay???",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/04/GettyImages-1238117395.jpg",
  "link": "https://talkingpointsmemo.com/morning-memo/manhattan-district-attorney-alvin-bragg-trump-organization-criminal-investigation-continue?utm_source=rss&utm_medium=rss&utm_campaign=manhattan-district-attorney-alvin-bragg-trump-organization-criminal-investigation-continue",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Cabrera",
  "authorUrl": "https://talkingpointsmemo.com/profile/cristina_cabrera",
  "termIds": [
    0
  ],
  "sentences": [
    "At Least 30 Killed By Russian Airstrike On Train Station, Ukraine Says\nNew York Times: “At Least 39 Killed in Strike on Train Station, Ukraine Says, as Thousands Flee From East”\nThe Guardian: “Kramatorsk mayor: 4,000 people were at Kramatorsk train station when it was struck”\nCNN: “EU’s top diplomat and European Council president condemn Kramatorsk railway strike”\nDem Sen. Schatz Dresses Down Hawley\nSen. Brian Schatz (D-HI) took to the Senate floor and ripped Sen. Josh Hawley (R-MO) a new one on Thursday for holding up Biden’s civilian nominations to the Pentagon and State Department until Defense Secretary Lloyd Austin and Secretary of State Antony Blinken resign:\nMcConnell Argues He Has Absolutely No Choice But To Support Trump, None At All\nSenate Minority Leader Mitch McConnell (R-KY) told Axios on Thursday that he has an “obligation” to support a Republican presidential nominee, including Trump, who by McConnell’s own admission was “morally responsible” for the Jan. 6 Capitol attack.",
    "Trump’s legal team called James’ request “baseless” and (predictably) complained that the investigation was a “witch hunt.”\nJackson Confirmed In Historic First\nAfter enduring a series of long and truly ugly Senate hearings, Ketanji Brown Jackson was confirmed as the first Black woman Supreme Court.",
    "New York AG Now Seeking To Hold Trump In Contempt\nNew York Attorney General Letitia James (D) asked a state judge to hold Trump in contempt yesterday, saying the former president has refused to give her the documents she requested eight times in her civil investigation into the Trump Organization.",
    "Maybe Just A Tad Defensive\nClearly sick of being pushed on the criminal investigation into the Trump Organization that he seemed to have unraveled, Manhattan District Attorney Alvin Bragg put out a somewhat irritated announcement on Thursday clarifying that the probe is still going on.",
    "Legal Effort To Disqualify Jan. 6 GOPers Expands\nFree Speech For People, the nonpartisan good governance group that’s been leading voters’ lawsuits to get several Trump goons in Congress kicked off the ballot for helping Trump fuel the Jan. 6 Capitol attack, has expanded the effort.",
    "One of the prosecutors wrote in his resignation letter that the former president was guilty of “numerous felony violations,” and argued that Bragg’s decision “will doom any future prospects” of Trump being prosecuted for the alleged crimes the investigators uncovered.",
    "The Justice Department is gearing up to investigate Trump taking 15 boxes of White House records, which included classified material, to his Mar-A-Lago resort in Florida, according to the Washington Post and the New York Times.",
    "Even though Jackson’s appointment obviously won’t change conservatives’ current 6-3 majority on the court, the dissents she’s likely to pen as her right-wing colleagues chip away at abortion rights and others will matter.",
    "Pelosi Gets COVID\nHouse Speaker Nancy Pelosi (D-CA) tested positive for COVID-19 but is asymptomatic, her deputy chief of staff announced on Thursday.",
    "Two other lawmakers are already facing similar challenges to their candidacy: Reps. Madison Cawthorn (R-NC) and Marjorie Taylor Greene (R-GA).",
    "Two leading prosecutors in the investigation quit out of frustration in February when Bragg decided not to seek an indictment against Trump.",
    "The group filed separate state lawsuits in Arizona against Reps. Paul Gosar (R-AZ), Andy Biggs (R-AZ), and Mark Finchem (R-AZ) on Thursday.",
    "Susan Collins (R-ME), Lisa Murkowski (R-AK) and Mitt Romney (R-UT)\nIt’ll be several months before Jackson actually gets sworn in, however.",
    "It’s focused on trying to enforce 14th Amendment’s Disqualification Clause for members of Congress who engage in insurrection.",
    "Outgoing Supreme Court Justice Stephen Breyer will stay until the end of the court’s current term in the summer.",
    "James also requested that the judge slap Trump with a $10,000 fine every day until he hands over the documents.",
    "WTF Read Of The Day\nDo you like Morning Memo?",
    "Only three Republicans voted for her: Sens.",
    "TPM’s Kate Riga explains why here.",
    "Here are some of the things.",
    "This is TPM’s Morning Memo.",
    "A lot of things happened.",
    "And Moar Trump Probes!",
    "Let us know!"
  ]
}