{
  "id": 7795,
  "mediaId": 2664,
  "date": "2022-04-05",
  "headline": "Florida GOP candidate runs from QAnon after he got burned: 'You guys are stupid'",
  "image": "https://www.rawstory.com/media-library/conspiracy-theorists-are-hindering-real-world-efforts-to-combat-child-sex-trafficking-in-battleground-state-report.jpg?id=24821951&width=1200&coordinates=0%2C13%2C0%2C14&height=600",
  "link": "https://www.rawstory.com/qanon-candidate-flees-movement/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    2246,
    3220,
    3565,
    4083,
    1126,
    1127,
    1093,
    1101,
    392,
    500
  ],
  "sentences": [
    "\"Wuertz even helped organize fundraising and awareness efforts for Operation Underground Railroad, an anti-trafficking organization whose CEO has legitimized certain QAnon conspiracies—like the lie that online furniture retailer Wayfair was a front to buy and sell children—while failing to overtly disavow QAnon the way other groups in the space have,\" said the report.",
    "“Those kinds of theories, they only hurt the mission of ending human trafficking.”\nNOW WATCH: Right-wing host tells Trump to 'face reality' because his Georgia candidate is losing\nRight-wing host tells Trump to 'face reality' because his Georgia candidate is losing\nStories Chosen For You",
    "Wuertz is also accused of leaving a WWE meeting over inclusiveness in a huff and was also called out by David Bixenspan's infamous newsletter Babyface v. Heel after he liked and shared posts from Proud Boys-affiliated accounts.",
    "“It causes people to be what I call couch patriots, where they just sit on the couch, sit on Facebook, and they don't get up and take action, take responsibility, and accountability,” Wuertz said of the conspiracy movement.",
    "“The post on Parler I ‘liked’ and followed was a repost of the Proud Boys account detailing a human trafficking bust,” Wuertz explained away in an interview with Vice.",
    "Drake Wuertz is running for a seat in the Florida State Legislature, but he's telling the QAnon crowd that \"The storm is never coming.",
    "I have met Enrique Tarrio, who founded the group, at several conservative events before, but I am not in close contact with him.\"",
    "There are Republican candidates like Mark Finchem in Arizona and Kristina Karamo in Michigan who are running on the QAnon brand.",
    "A GOP candidate once toyed with QAnon conspiracies and the Proud Boys, but now he's running from them, Vice News reported.",
    "They promote the theory that Democrats are running a cabal of traffickers selling children and worshiping Satan.",
    "He has posted photos of a woman holding a flag saying \"WWG1WGA,\" the QAnon slogan \"Where we go one, we go all.\"",
    "The former WWE wrestler-turn-referee used to attack “fake news and Marxist left” after he was \"canceled.\"",
    "Tarrio frequently notes that he's not the founder of the Proud Boys, just a leader in the movement.",
    "“I am not affiliated with the Proud Boys.",
    "Now Wuertz is turning on them all.",
    "You guys are stupid.\""
  ]
}