{
  "id": 9577,
  "mediaId": 2710,
  "date": "2022-03-25",
  "headline": "Keith Mines: To protect democracy we must protect our institutions",
  "image": "https://www.sltrib.com/resizer/WKt_wt0HafYXBELXzIGjVEbTGGk=/1200x630/cloudfront-us-east-1.images.arcpublishing.com/sltrib/UX64TBE56BGC5OSBL6A6S4LGUQ.jpg",
  "link": "https://www.sltrib.com/opinion/commentary/2022/03/25/keith-mines-protect/",
  "mediaOutlet": "The Salt Lake Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5280,
    2246,
    3089,
    1313,
    5963,
    6678
  ],
  "sentences": [
    "Mark Finchem from Arizona is one example, he rallied with the “patriots” on January 6, 2021, at the Capitol and is now running for secretary of state with a hefty war chest and strong endorsement from the former president, who said at a rally that Finchem, “would find the underlying cause of everything.” Finchem, true to the script, replied “ladies and gentlemen, we know it and they know it: Donald Trump won!”\n“What’s at stake,” Colorado’s secretary of state recently told a Washington Post reporter, “is the future of democracy in this country.",
    "Secretary of state races boil down to a very simple choice in 2022: Do we as a nation believe that American voters should be able to choose their elected officials?”\nWill the institutions endure, or will the extremists on both sides make a hash of them and we’ll be back to the place where most of the world is, without the means to make collective decisions, without trust, without a way to channel aspirations – a world with high walls topped with broken glass?",
    "Mark Bowden and Matthew Teague write about it in their new book “The Steal: The Attempt to Overturn the 2020 Election and the People Who Stopped It.” Bowden brings us mostly dark American adventure history — “Killing Pablo,” “Guests of the Ayatollah,” “Black Hawk Down,” “Hue 1968\" — sketching the quiet courage and determination of Americans doing the right thing in impossible places.",
    "I mean, you just put the journals of the House and Senate on the shelf and if they say, ‘Hey, do you happen to have the journals?’ you bring them over.” But Republicans, recognizing that this is where the rubber hits the road if you want to overturn an election, have now put these positions front and center, in what can only be a plan to win at all costs in 2024.",
    "On the right, the attacks on institutions have moved from trying to control democratic outcomes through morally questionable but technically legal means, (e.g., gerrymandering, legal shenanigans, bullying) to a wholesale effort to overturn an election, by violence if needed.",
    "On the left, when a judicial outcome doesn’t meet expectations, city blocks are burned and in response to police abuse, law enforcement institutions in some cities have been defunded, according to many local officials a void that has led to increases in violence and crime.",
    "He sees this work in a similar vein, crediting the many officials who stood up to Donald Trump’s bullying and the threats to their families by fellow Republicans who could not accept an electoral loss and would resort to any means to overturn it.",
    "Trump called him an “enemy of the people.”\nWe traditionally look to congressional and Senate races as charting the future, perhaps we need to start looking at these election officials, now a point of intense competition.",
    "I am starting to wonder if we don’t have this polarization thing all wrong – Republicans vs. Democrats, liberals vs. conservatives, city mouse vs. country mouse, it all seems so 2016.",
    "During this collective attack on our institutions, recent reporting highlights the courage and heroism of one group that stood in the breach, state election officials.",
    "Perhaps a more useful division of our society, one worth being polarized over, is institutionalists vs. anti-institutionalists.",
    "He is a conservative Republican and a structural engineer by training, who voted for Trump, but duly certified Biden’s victory.",
    "He is the author of “Why Nation-building Matters” and splits his time between Salt Lake City and Alexandria, Virginia.",
    "Georgia Secretary of State Brad Raffensperger was the most prominent of the hundreds of these stand-up officials.",
    "Keith Mines is a former Special Forces officer and diplomat who has served on the margins of nine conflicts.",
    "If there is any unity left in our country, it should start with protecting the institutions.",
    "Michael Dunlap said of his 14 years as Maine’s secretary of state “it’s a pretty light lift.",
    "Who would have thought?"
  ]
}