{
  "id": 11214,
  "mediaId": 2537,
  "date": "2022-03-08",
  "headline": "Opinion: Muslim girls just want to be treated like other athletes",
  "image": "https://www.gannett-cdn.com/presto/2021/05/27/NCOD/a77c4ca7-110a-4272-9fc1-00fd8dd92d72-Noor_Alexandria_Abukaram_hajib-wearing_running.JPG?crop=285,161,x0,y0&width=285&height=161&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/03/08/opinion-muslim-girls-just-want-treated-like-other-athletes/9339935002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Samina Sohail",
  "authorUrl": "",
  "termIds": [
    1649,
    3376,
    6159,
    6474
  ],
  "sentences": [
    "Decades after my childhood experience, I am truly inspired by the progress we have made when I see confident young Muslim American girls dressing modestly, some wearing the headscarf, and participating in so many sports.",
    "After garnering national attention, Senator Theresa Gavarone (R- Bowling Green), sponsored Senate Bill 181, which was passed unanimously by both chambers and signed into law by Governor Mike DeWine on Feb. 28.",
    "Whether they were tennis skirts, bathing suits, or shorts and tees, by the time I reached middle school, I was unable to participate any longer primarily because of what I was expected to wear.",
    "Recreation involved riding bikes with friends through neighborhood streets, running through sprinklers to cool down, and pure celebration when someone on the street got a swimming pool.",
    "The fact that the interfaith community of Christian, Jewish, Muslim and other groups came together to garner this support is a testimony to the endless possibilities of collaboration.",
    "Noor Alexandria Abukaram, a high school athlete from Sylvania, Ohio, was disqualified from her high school’s cross country meet in 2019 despite having beat her own personal 5K record.",
    "Aside from the physical benefits of exercise, multiple studies have shown how participating in youth team sports builds leadership skills, teamwork, confidence and self-esteem.",
    "My high school niece recently relayed, \"Muslim girls who wear the hijab just want to be treated like other athletes and get the opportunity to play the sports that we love.\"",
    "Even though I did not wear the hijab (headscarf) at the time, the dress code was different enough that ultimately my days of athletic extracurriculars were over.",
    "During this month of celebrating women, kudos to Noor Abukaram, Senator Gavarone, and the countless women who choose to stand up and make a difference.",
    "Dr. Samina Sohail is a board member at the Islamic Center of Greater Cincinnati and a member of Equasion's \"A Mighty Stream\" Racial Justice Initiative.",
    "Opinion contributor\nGrowing up in the scorching Florida heat during the 1980s was not always easy for a dark-skinned daughter of immigrants.",
    "As a Muslim American woman who now chooses to wear the headscarf, I am so proud of my country, which unequivocally affords me this right.",
    "It relays how important it is for us to persistently counter discriminatory practices and advocate to ensure our freedoms are protected.",
    "The disappointment led Noor to begin a movement \"in an effort to prohibit organizations from implementing discriminatory policies.\"",
    "As the years progressed, school sports – swimming, tennis, track, basketball and others – required certain attire to participate.",
    "I am not sure how many other pieces of legislation have had this unchallenged course during these otherwise polarizing times.",
    "The new law ensures that Ohio school athletic programs will not prohibit wearing of religious apparel during participation.",
    "As a mother, I am filled with such hope for my own 10-year-old daughter who loves basketball, swimming and gymnastics.",
    "As a Muslim, the codes of modesty set in around this time (puberty), and they were in contrast to the norms.",
    "The camaraderie of finding ways to have fun despite the heat set the stage for a memorable childhood.",
    "This is especially poignant when the hijab is being banned in parts of Europe, Asia, and even Canada.",
    "The passage of such legislation with unanimous bipartisan congressional support is truly remarkable.",
    "The focus has shifted to performance rather than a dress code which is not appropriate for all.",
    "Allowing all American youth this access is one of the many opportunities this country affords.",
    "It never occurred to me to challenge the norms, as fitting in was already hard enough.",
    "The reason she was disqualified was because she wore a hijab, which was not approved.",
    "The freedom to practice one’s religion is the foundation of our nation’s existence.",
    "Recently, this access was challenged in Ohio."
  ]
}