{
  "id": 1174,
  "mediaId": 8433,
  "date": "2022-02-17",
  "headline": "House passes Gavarone bill to protect freedom of religious expression",
  "image": "https://bloximages.chicago2.vip.townnews.com/sent-trib.com/content/tncms/assets/v3/editorial/3/f8/3f86d68a-0258-11eb-a564-c7e375d2c251/5f733784ac940.image.jpg?crop=600%2C315%2C0%2C293&resize=600%2C315&order=crop%2Cresize",
  "link": "https://www.sent-trib.com/news/house-passes-gavarone-bill-to-protect-freedom-of-religious-expression/article_344cdcf8-8ff9-11ec-9228-f7d15ac01ac0.html",
  "mediaOutlet": "sent-trib.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“With SB 181 I’m confident organizations in the state of Ohio will start to work towards a more inclusive experience for all interscholastic activities.”\nAccording to Ohio High School Athletic Association rules, participants were banned from wearing religious apparel unless the athlete has been granted special permission by the official prior to the event.",
    "No student in Ohio should have to choose between their religious beliefs or the sport they love, and because of this legislation, they will not have to anymore.”\nSenate Bill 181 will now be sent to the governor for consideration.",
    "Senate Bill 181 is inspired by Noor Alexandria Abukaram, a Sylvania Northview athlete who was disqualified from a high school cross-country race because she wore her hijab during the competition.",
    "“As an athlete I put my faith in the organizations to make the rule book fair and unbiased,” Abukaram said during testimony in front of the House Primary and Secondary Education Committee.",
    "COLUMBUS, Ohio — The Ohio House of Representatives has passed Senate Bill 181, sponsored by State Sen. Theresa Gavarone, R-Huron, to protect freedom of religious expression for athletes.",
    "Senate Bill 181 prevents OHSAA and other organizations from adopting rules that prohibit student athletes from wearing religious apparel while competing in sports.",
    "“I am in public service because I want to get things done for my constituents, and today we did just that,” Gavarone said.",
    "“I have always been a staunch advocate of religious freedom and this is just the latest example.",
    "The bill received strong support from Christian, Jewish, and Muslim communities."
  ]
}