{
  "id": 10710,
  "mediaId": 2664,
  "date": "2022-03-18",
  "headline": "WATCH: Ted Lieu hilariously shames GOP's failure to discipline members who attended white nationalist conference",
  "image": "https://www.rawstory.com/media-library/ted-lieu-shames-gop-s-failure-to-discipline-members-who-attended-white-nationalist-conference.jpg?id=29560261&width=1200&coordinates=0%2C0%2C0%2C80&height=600",
  "link": "https://www.rawstory.com/ted-lieu-2656987580/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    2443,
    3722,
    1126,
    1477,
    392
  ],
  "sentences": [
    "Ted Lieu shames GOP's failure to discipline members who attended white nationalist conference\nNOW WATCH: Missouri Republican faces backlash after grilling 14-year-old trans girl about getting ‘the procedure’\nMissouri Republican faces backlash after grilling 14-year-old trans teen",
    "Rep. Ted Lieu (D-CA) on Friday took some time on the House floor to shame his Republican colleagues for failing to do anything to discipline Reps. Marjorie Taylor Greene (R-GA) and Paul Gosar (R-AZ) for being featured speakers at a white nationalist conference last month.",
    "Lieu started out his speech by touting the Democrats' passage last year of the American Rescue Plan, which he credited for helping create millions of jobs and lowering unemployment to under 4 percent.",
    "And let me now tell you all the actions that House Republican leadership took against these two Republican members who attended and spoke at a white nationalist conference last month.\"",
    "Lieu then stood in complete silence for more than 15 seconds before saying, \"I yield back.\"",
    "\"But I do know that two of them attended a white nationalist conference last month.",
    "He then turned his attention to the GOP.",
    "\"What are Republicans doing?",
    "I don't know,\" he said.",
    "Watch the video below."
  ]
}