{
  "id": 10717,
  "mediaId": 2550,
  "date": "2022-03-07",
  "headline": "Kevin McCarthy's failure to act on Gosar and Greene's white nationalist flirtation says it all",
  "image": "https://images.dailykos.com/images/1043320/story_image/GettyImages-1357738668.jpg?1646092659",
  "link": "https://www.dailykos.com/stories/2022/3/7/2084427/-Gosar-and-Greene-spoke-at-a-white-nationalist-event-They-re-not-facing-consequences-from-the-GOP?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Clawson",
  "authorUrl": "/users/laura clawson",
  "termIds": [
    2187,
    2443,
    4039,
    4066,
    1477,
    520,
    6569
  ],
  "sentences": [
    "Related:\nWhite nationalists flaunt their traction within Republican Party at annual gathering in Florida\nMarjorie Taylor Greene's speed walk through the Holocaust Museum didn't teach her anything\nHouse votes to strip Rep. Marjorie Taylor Greene of committee assignments\nRep. Paul Gosar is censured by U.S. House; removed from committees\nThis is a short blurb about Daily Kos.",
    "“Dealing with dumb, stupid things people do in Congress should probably go down — and go pretty far down — on the list when you’ve got peacekeeping tanks rolling into a country that was not in conflict, when you’ve got record inflation, when you’ve got all of these things,” Rep. Kelly Armstrong told Politico.",
    "The far-right House Freedom Caucus “aired frustrations” with Gosar and Greene about their Fuentes association, sources told Politico, but McCarthy hasn’t gotten around to it yet, and some of his allies are defending him because he has so many more important things to deal with.",
    "He can carve out a little time to say “Let’s not tie our party to Nazis.”\nHere’s Nick Fuentes: “We can’t play this game of, ‘We disavow white supremacy.’ Notice how the claws come out.”\nHere’s Nick Fuentes again: “You can call us racists, white supremacists, Nazis, & bigots.",
    "Reps. Marjorie Taylor Greene and Paul Gosar spoke at the far-far-right America First Political Action Conference, with Greene’s appearance following a “round of applause for Russia” led by conference organizer Nick Fuentes.",
    "Paul Gosar and Marjorie Taylor Greene\nA couple of House Republicans spoke at a white nationalist conference, and the top member of their party in Congress seems ready to just wait for it to blow over.",
    "“But in the long run, I’ve always found that backfires, so they’re playing with fire by doing that.”\nIt backfires the Republican Party ever closer to the white supremacists it doesn’t disavow.",
    "It requires a two-thirds vote to expel someone from the House, and McCarthy either doesn’t think he could get enough votes on top of the Democrats or he just plain doesn’t want to do it.",
    "So even this person who wants them to “shut up” isn’t talking about the step that would decisively say that the Republican Party rejects lawmakers who associate with white nationalists.",
    "You know, actually, when you’re a leader of a party looking at two members of your conference having spoken at a white nationalist event, that should be high on the list of priorities.",
    "Some Republicans anonymously lamented to Politico that, since Democrats stripped Greene and Gosar of their committee assignments, McCarthy doesn’t have much left to threaten.",
    "“There is a strategy of, ‘If we don’t talk about it, it will go away, and it won’t get attention.’ And sometimes that works,” another anonymous Republican told Politico.",
    "McCarthy could back expelling Greene and Gosar from Congress—but that wouldn’t be through the Republican conference, it would involve the entire House.",
    "House Minority Leader Kevin McCarthy called Greene and Gosar’s participation in the event “appalling,” but that seems to be as far as he’s going.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "What else can Kevin do officially through the conference?”\nNote that “through the conference” part.",
    "And at a certain point, you have to figure McCarthy knows that that’s what he’s doing.",
    "The rootless transnational elite knows that a tidal wave of white identity is coming.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "The fire rises!”\nSeparating the Republican Party from this could be a priority.",
    "It’s not like he’s out there singlehandedly dealing with Russia and inflation.",
    "And they know that once the word gets out, they will not be able to stop us.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "You can disavow us on social media from your cushy Campus Reform job.",
    "McCarthy said he would have a talk with Gosar and Greene about it.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Some Republicans think McCarthy’s silence is a mistake.",
    "McCarthy is the minority leader in the House.",
    "What the hell is she thinking?” one said.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "“[But] there’s nothing else.",
    "But you will not replace us.",
    "He’s in no hurry, though.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "“I want them to shut up.",
    "Daily Kos is different.",
    "Donate $5 monthly",
    "Please read it.",
    "Just stop it.",
    "Yet it’s not."
  ]
}