{
  "id": 10744,
  "mediaId": 2594,
  "date": "2022-03-16",
  "headline": "Six things to watch for when Ukraine’s president Zelensky addresses Congress",
  "image": "https://static.independent.co.uk/2022/03/15/15/SEI92922285.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/zelensky-address-today-congress-ukraine-b2036998.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Bowden",
  "authorUrl": "https://www.independent.co.uk/author/john-bowden",
  "termIds": [
    3702,
    4905,
    4591,
    5399,
    1433,
    6569,
    6672,
    6286
  ],
  "sentences": [
    "One area that could be addressed by Mr Zelensky is the issue of his own country’s air force: The US recently came out against a deal to provide Ukraine with MiG-29 aircraft from Poland due to concerns over the transfer of offensive weaponry through a US airbase in Germany, but it remains an open question as to whether the Biden administration could support future weapons or vehicle shipments to Ukraine from Nato allies.",
    "Recommended\nThe GOP split\nThe far-right’s fascination with Vladimir Putin mentioned above is one of the most interesting dynamics in the Republican Party right now, as the divide between support for Russia and support for Ukraine has split the party’s typically Trump-loyal establishment from the far-right base whose support carried Mr Trump to victory over his GOP rivals in 2016.",
    "Sanctions against Russia’s economy have widespread support on Capitol Hill but have seen some resistance from a small group of progressives in the House who have warned that US policies are hurting Russia’s populace and economy while having measurably lighter effects on the top officials and oligarchic allies of Vladimir Putin responsible for Russian foreign policy.",
    "He has sought to maintain a facade of comity with Mr Zelensky despite his own efforts to bully Mr Zelensky into supporting a criminal investigation of Joe Biden in 2020 with the intention of hurting the Democratic then-candidate’s public image, and joined in the argument that a Russian invasion of Ukraine would not have occurred were he president.",
    "Mr Zelensky has already shown a willingness to mitigate his government’s policies and ambitions to meet the political reality of his situation, and on Tuesday declared that his country would have to likely accept that it would not be allowed entry into the Nato defensive pact as a condition of peace with Russia should a deal be struck.",
    "The Ukrainian leader’s speech to US lawmakers will come as the Biden administration attempts to tread a fine line on the issue of support for his country; President Joe Biden has declared that US troops will not fight to defend Ukrainian soil while Washington approves billions of dollars in humanitarian and military aid to Kyiv.",
    "Statements made by leadership and rank-and-file members like Mr Cawthorn or Ms Greene in the hours before and after Mr Zelensky’s speech could reignite the conflict between the party’s two wings, particularly if the party’s more conservative members choose this week to turn their fire publicly on the Ukrainian president.",
    "It will be interesting this week to see if Mr Zelensky’s remarks trigger anything beyond more compliments for Mr Putin from the former president, who was accused of being a Russian asset by Democrats throughout his presidency and famously won the 2016 election in part due to the interference of Russian operatives.",
    "Some members of the far-right wing of the GOP (which in recent years seems more like the party’s centre) have openly attacked Mr Zelensky and Ukraine’s government while at the same time expressing everything from tacit admiration to outright support for Vladimir Putin and his decision to invade.",
    "Mr Trump’s statements amid the invasion have ranged from simply untrue to baffling, as he has asserted that the movement of Russian troops into contested separatist regions in the hours preceding the attack was “genius” and doubled down on his praise of Russia’s strategy in later comments.",
    "Mr Zelensky’s address is likely then to reignite the calls from centrist Democrats and Republicans for a no-fly-zone to be established or for Washington to take some other tangible steps against Russia or in support of Ukraine as the invasion progresses.",
    "The speech by Mr Zelensky will be the first major opportunity since the government funding bill passed last week for lawmakers to show their support for Ukraine and, crucially, what they want to see the Biden administration do in the days ahead.",
    "Some have even called for the establishment of a Nato no-fly-zone in Ukraine’s airspace that experts argue would lead the US into a scenario where it may have to decide whether to fire on Russian aircraft, potentially starting a major war.",
    "Mr Cawthorn was discovered in a recent video to have referred to Mr Zelensky as a “thug”; it’s an open question as to whether he will attend Wednesday’s speech and, if he does, whether the Ukrainian leader will address his insult.",
    "Among those voices on the right challenging their party’s establishment is Rep Madison Cawthorn, a freshman congressman from North Carolina known for spreading wild conspiracies and far-right views verging on white nationalism.",
    "None of the Democrats who have opposed recent sanctions against Russia such as Rep Ilhan Omar have indicated that they have any plans to miss the address, or that they do not support Mr Zelensky’s remarks.",
    "The latest aid package came in the form of a government funding bill that passed the House and Senate last week with little drama, a sign of the bipartisan support that aiding Ukraine has on Capitol Hill.",
    "Now as he addresses the US Congress, his speech represents an opportunity for the president to shift his goal towards other actions that the Biden administration and lawmakers may find easier to support.",
    "Other far-right members could also skip the event: Reps Marjorie Taylor Greene and Paul Gosar both recently attended an event hosted by a white nationalist where guests broke into a chant of “Putin!",
    "Their political positions represent some of the strongest resistance to his requests on Capitol Hill, however, particularly when it comes to issues like a no-fly-zone or further military aid.",
    "That action could mean more economic measures targeting Moscow itself, or potentially more actions taken to ramp up the pressure on Russia’s dwindling list of economic and military partners.",
    "Donald Trump has remained an ever-present figure in the background of Joe Biden’s presidency and the Ukraine crisis is no different than any issue Mr Biden has faced thus far in that regard.",
    "Ukraine’s President Volodymyr Zelensky will deliver a historic early-morning address to Congress on Wednesday morning as his government continues to battle a brutal Russian invasion.",
    "Check the guest list\nWhile admiration for Mr Zelensky and his government’s efforts to resist Russia’s advance is certainly widespread on Capitol Hill, it’s not universal.",
    "Their attendance at the speech could be awkward, given the efforts of their party to tamp down on the view that the GOP is becoming a “pro-Putin” party.",
    "Recommended\nAs lawmakers gather for the speech tomorrow, there are a few key things to look out for:\nWhere does Washington go from here?",
    "Ukraine’s president has been calling for weeks, without success, for the establishment of a no-fly-zone.",
    "Putin!” and the conference’s host appeared to favourably compare Mr Putin to Adolf Hitler.",
    "Many of those same lawmakers are now calling for the Biden administration to go further.",
    "Will Zelensky change his requests?",
    "Resistance to sanctions?",
    "Will Trump comment?"
  ]
}