{
  "id": 10884,
  "mediaId": 2512,
  "date": "2022-03-18",
  "headline": "Twitter torches Idaho's Republican lieutenant governor for kanoodling with White supremacists",
  "image": "https://www.alternet.org/media-library/image.png?id=29559405&width=1200&coordinates=0%2C0%2C0%2C64&height=600",
  "link": "https://www.alternet.org/2022/03/idaho-lieutenant-governor-white-supremacists/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandon Gage",
  "authorUrl": "https://www.alternet.org/author/brandongage",
  "termIds": [
    2765,
    5039,
    3596,
    4039,
    2994,
    1126,
    1394,
    6238,
    5996
  ],
  "sentences": [
    "On Twitter Michelle Malkin posted this photo of herself with Marjorie Taylor Greene and Nick Fuentes.pic.twitter.com/IgTQ9iDuDB\n— Eyes on the Right (@Eyes on the Right) 1645886913\n\"So yes, I did know who I was talking to, who had invited me to speak at that conference, and so I don't think, you know, if you know who Michelle Malkin is, she's a [unintelligible] woman.",
    "But in a conversation with Jack Holmes of Valiant News that was released on Thursday, McGeachin doubled down on her justifications for coddling perpetrators of hate and admitted that she was fully aware of who her audience was, signaling a reversal from her remarks two days earlier.",
    "What I’m still not clear on is when, if ever, leaders of the Idaho Republican Party will say ‘enough is enough’ and call on her to resign.”\nMeanwhile, the Twitterverse made it abundantly clear that the GOP and McGeachin's coziness with the alt-right will forever define them.",
    "“I thank you all for your efforts, I thank you for joining our efforts, and together we will fight to make Idaho great again,” she said in a recorded address to the America First Political Action Conference, which was held in Orlando, Florida on February 27th.",
    "Janice McGeachin now says, \"Yes, I did know who I was talking to\" when she addressed the white nationalist AFPAC conference and she stands by it: \"I'm not going to back off from the opportunity to talk to other conservatives ... about America First policies.",
    "McGeachin, whose primary challenge to incumbent GOP Governor Brad Little earned the endorsement of former President Donald Trump, has been facing calls for her resignation from members of both political parties over her participation in Fuentes' gathering.",
    "Even when that means fighting among our own ranks, because too many Republicans don’t exhibit the courage today.”\nMcGeachin shut down an interview with KTVB7 on Tuesday when Boise reporter Brian Holmes grilled her on why she accepted Fuentes' invitation.",
    "\"pic.twitter.com/EcbL4onfLC\n— Right Wing Watch (@Right Wing Watch) 1647611041\nCNN Editor-at-Large Chris Cillizza noted on Thursday that McGeachin's excuses do not add up:\nUnder the BEST-case scenario for her, this is what happened:\n1.",
    "\"I was invited to present a video of my commitment to the 'Idaho First' policies and my vision for the state of Idaho and for America to these – to thousands of young conservatives,\" said McGeachin.",
    "Her family immigrated from The Philippines and she happens to be married to a Jewish man,\" McGeachin continued, implying that Malkin's husband's religion justifies their alignment with Fuentes.",
    "\"It's just the double-speak that the illiberal left likes to talk – and it doesn't – we're not gonna back off,\" McGeachin added before suggesting that she would show face at future bigot fests.",
    "She tweeted a photograph at AFPAC with Fuentes and United States Representative Marjorie Taylor Greene (R-Georgia), who along with Congressman Paul Gosar (R-Arizona) was a guest of honor.",
    "Idaho's Republican Lieutenant Governor Janice McGeachin has defended her virtual speech at an event that was organized by White supremacist conspiracy theorist Nick Fuentes.",
    "— Cooper Dog (@Cooper Dog) 1647622416\nThank you for confirming @JaniceMcGeachin that there is a direct correlation between today's idea of conservatism and white ideology.",
    "When pressed on why she didn't know who she was speaking to, McGeachin said that she can't be held responsible for who she associates with.",
    "On Friday, a spokesperson for the Idaho Democratic Party told The Daily Beast that \"when someone shows you who they are, believe them.",
    "\"I'm not going to back off from the opportunity to talk to other conservatives across the country about America First policies.\"",
    "She denied having any knowledge about Fuentes and insisted that she was merely trying to stand up for conservative principles.",
    "Janice McGeachin’s support of the extreme right and white nationalists is blatantly clear, and it has been for years.",
    "Malkin is a conservative political commentator for Newsmax TV, a right-wing propaganda outlet on cable television.",
    "After all, the nationalist \"America First\" dogma was first adopted and very publicly touted by the Ku Klux Klan.",
    "McGeachin also called upon “freedom fighters all over this country that are willing to stand up and fight….",
    "She did zero due diligence -- and by that I mean going to Google and typing in the name 'Nick Fuentes.'",
    "She agreed to record a video for an event organized by a high-profile White nationalist.",
    "She delivered the speech and, after it created controversy, decided to look him up.",
    "This is the base, metastasizing after decades of right-wing media saturation.",
    "In other words governor you and conservatives really do support racism.",
    "— \\ud83d\\udda4Carly Lehwald (@\\ud83d\\udda4Carly Lehwald) 1647612237",
    "They are the only form of modern conservatism with any real sway.",
    "At present, they have full control of the conservative movement.",
    "Watch below via Right Wing Watch:\nIdaho Lt. Gov.",
    "\"I was invited by Michelle Malkin.\"",
    "Got it, thank you for clarifying!",
    "4.",
    "3.",
    "2."
  ]
}