{
  "id": 10922,
  "mediaId": 2664,
  "date": "2022-03-10",
  "headline": "Jan. 6 committee reveals why it subpoenaed RNC fundraising records",
  "image": "https://www.rawstory.com/media-library/the-house-select-committee-to-investigate-the-january-6th-attack-on-the-u-s-capitol.jpg?id=29220921&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/capitol-riot-committee-2656901113/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    4617,
    2765,
    1125,
    1394,
    1169,
    1126
  ],
  "sentences": [
    "\"Investigators in recent months have increased their focus on the vast digital fundraising efforts around overturning the election, trying to pinpoint if the Trump campaign and allied Republicans were engaged in a coordinated effort to raise money on fraudulent and misleading appeals, according to people involved in the probe.",
    "\"The Select Committee issued a subpoena to an email fundraising vendor in order to help investigators understand the impact of false, inflammatory messages in the weeks before January 6th, the flow of funds, & whether contributions were actually directed to the purpose indicated.\"",
    "The Select Committee issued a subpoena to an email fundraising vendor in order to help investigators understand the impact of false, inflammatory messages in the weeks before January 6th, the flow of funds, & whether contributions were actually directed to the purpose indicated.",
    "\"The Select Committee is seeking information from Salesforce regarding whether and how the Trump campaign used Salesforce’s platform to disseminate false statements about the 2020 election in the weeks leading up to the January 6th attack.",
    "Accordingly, the Select Committee seeks documents and a deposition regarding these and other matters that are within the scope of the Select Committee’s inquiry,\" select committee chairman Bennie Thompson (D-MS) said in a Feb. 23 subpoena.",
    "The House Select Committee to Investigate the January 6th Attack on the U.S. Capitol on Wednesday shed new light as to why it subpoenaed Salesforce over fundraising records for the Republican National Committee.",
    "\"In the months after Trump’s election loss, the Trump campaign, the RNC, Trump Make America Great Again Committee and Save America PAC raised more than $200 million through a joint fundraising committee.\"",
    "A number of individuals from the Trump campaign, the RNC and digital firms involved with post-election fundraising practices have been cooperating with the green team,\" the newspaper reported.",
    "\"Between Election Day 2020 and January 6th, the RNC and the Trump campaign solicited donations by pushing false claims that the election was tainted by widespread fraud.",
    "These emails encouraged supporters to put pressure on Congress to keep President Trump in power,\" the committee said.",
    "On Tuesday, The Washington Post reported the committee has created a \"green team\" to follow the money.",
    "The select committee addressed the information in a thread posted to Twitter on Wednesday evening.",
    "The RNC has filed a lawsuit to block the select committee from obtaining the Salesforce records.",
    "— January 6th Committee (@January 6th Committee) 1646876785"
  ]
}