{
  "id": 11042,
  "mediaId": 2664,
  "date": "2022-03-10",
  "headline": "A group of Republicans is still trying to stop aid to Ukraine",
  "image": "https://www.rawstory.com/media-library/matt-gaetz.jpg?id=27264089&width=1200&coordinates=0%2C17%2C0%2C18&height=600",
  "link": "https://www.rawstory.com/republicans-hold-up-ukraine-funding/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    2443,
    4905,
    4591,
    5174,
    1126,
    6672,
    6709
  ],
  "sentences": [
    "“I would like to jump off a bridge headfirst into a pile of rocks after seeing the good ol’ boy system and fucked up leadership I have witnessed here.”\nIt turns out not only did the Republicans send the men to the border without the necessary equipment, but they also \"only assisted in less than one in every five apprehensions.\"",
    "“As heartbreaking as it is, Ukrainian borders are not vital to our nation.”\nBiden's administration is going back to the strategy that was working six years ago when he and other global leaders were able to fix the problems leading to people fleeing their countries for America.",
    "\"Three soldiers had died in three months, the most recent in an alleged DUI just five days earlier, and more than a dozen troops from the mission had been arrested or confined for drugs, sexual assault and manslaughter,\" the Army Times reported last December.",
    "\"The arch-conservative group even sent a letter to House Minority Leader Kevin McCarthy (R-CA) and Senate Minority Leader Mitch McConnell (R-KY) on Tuesday requesting that the omnibus bill not include Ukrainian aid at all,\" said the Beast.",
    "\"The Freedom Caucus also made demands that border security provisions be included in the omnibus bill, and it seems that conservatives intend to vote against the spending measure if it doesn’t address the southern border.\"",
    "We should be doing everything we can as fast as we can to get that into their hands.”\nRepublicans are already suffering after it became clear that their support of Russia in the fight was not the direction Americans went.",
    "“There are very serious implications of what will happen if we delay or deny Ukraine some of these weapons systems and support, so we shouldn’t be conditioning the provision of those on partisan political issues.",
    "So, when the Freedom Caucus starts a hostage crisis holding up Ukraine aid and demanding nebulous border action, they're facing off against a crowd of Americans demanding action in Ukraine as soon as possible.",
    "“It’s really important that lawmakers understand the gravity of the situation and not try to score cheap political points at a time when the global stability and security are so endangered,” he said.",
    "“No matter what side you’re on, if it’s horrible, or if you think it’s a necessary evil … neither of those sides are actually having to do it,” Wesley Farris told PBS for a Frontline special in 2020.",
    "Rep. Paul Gosar (R-AZ), a recent speaker to a group of white supremacists who cheered Vladimir Putin, echoed the demand for Ukraine to take care of itself while Washington deals with the border.",
    "NOW WATCH: CIA director outlines four reasons why China is ‘unsettled’ by Putin’s invasion of Ukraine4\nCIA director outlines four reasons why China is ‘unsettled’ by Putin’s invasion of Ukraine",
    "Republican governors have tried to score cheap points by claiming that they're taking matters into their own hands, and sending their national guard troops down to the border to protect it.",
    "Brett Bruen, a former U.S. diplomat and former director of global engagement at the White House said that the Republicans trying to create the false equivalences are deserving of ridicule.",
    "While the lead-up to the Russian invasion had GOP officials dominating the conversation with isolationism and GRU propaganda, everything changed when the war began.",
    "So, while some are squabbling over the continuing budget resolution adding to the deficit, others want to spend ever more on performative action over immigration.",
    "After watching the aftermath of bombs falling on a children's hospital, one would assume that any partisan squabble would have come to an end in Washington.",
    "A small group of Republican lawmakers attempted to tie any Ukraine funding passed by Congress to military action on the U.S.-Mexico border.",
    "“We still should today declare we're going to secure our own border, not just saying it during [a] speech, but actually do it,” Good said.",
    "In 2019, Congress gave the U.S. Customs and Border Patrol the funding necessary to hire the people to staff up what they said they needed.",
    "Fortune and Civis Analytics conducted a poll at the end of February that showed 67 percent supported hefty sanctions against Russia.",
    "Eighty percent of Americans are behind giving up Russian oil and 62 percent said they're fine paying more in gasoline to do it.",
    "“I remain firmly convinced that our open southern border… is the greatest threat to our prosperity and security,” Gosar said.",
    "Former President Donald Trump claimed he would build a \"big beautiful wall,\" but only resulted in a few miles of fencing.",
    "He explained that even though funding to help Ukraine is incredibly important, he wants military action at the border.",
    "He went on to claim that President Joe Biden should handle the southern border before even thinking about Ukraine.",
    "“Someone please wave the white flag and send us all home,” an anonymous letter pleaded with military commanders.",
    "That was the most horrible thing I’ve ever done.”\nBuying the way out of the crisis doesn't appear to be working.",
    "The hope was that 21,370 agents would be added to their ranks, but they've had a tough time filling the jobs.",
    "Still, officials like Rep. Ralph Norman (R-SC) want aid to Ukraine only if aid is being sent to the border.",
    "The administration wants to crack down on the latter and help with humanitarian assistance for the former.",
    "The problem is that the move turned out to be a disaster, not to mention a PR nightmare for Republicans.",
    "It also shows 74 percent want to see NATO do a no-fly zone over Ukraine so Russian bombings will stop.",
    "When the bill's sponsor Rep. Matt Rosendale (R-MT) was asked about it, he refused to answer.",
    "A Reuters poll taken at the beginning of March showed a huge shift in support for Ukraine.",
    "It's just another in a long line of Republicans on the wrong side of the issue.",
    "Central America is facing a climate crisis and a flood of organized crime.",
    "Rep. Matt Gaetz (R-FL) wouldn't even make eye contact, scurrying away.",
    "Some 74 percent of Americans want the US to take Ukrainian refugees.",
    "A whopping 72 percent wants the US to send over military equipment.",
    "It can easily be cut through using a circular saw from Home Depot.",
    "Neither he nor his GOP allies specify what it is that is needed.",
    "However, I support this,” Good said, according to the Beast.",
    "According to one Daily Beast report, there's no such luck.",
    "“The answer is, we should secure our border,” Good said.",
    "Rep. Bob Good (R-VA) is one of the first cosponsors.",
    "“I had to separate children from their parents.",
    "Still, the so-called Freedom Caucus presses on.",
    "See the full report from the Daily Beast.",
    "“I do support aid for Ukraine."
  ]
}