{
  "id": 11045,
  "mediaId": 2746,
  "date": "2022-03-07",
  "headline": "Offensive tweets force South Dakota Democrat out of House race after one day",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/10/twitter-results_23263_c0-236-5659-3537_s1200x700.jpg?90ebfd7f05659b53f33808f391ae1b0f9348693f",
  "link": "https://www.washingtontimes.com/news/2022/mar/7/offensive-tweets-force-ryan-ryder-south-dakota-dem/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kerry Picket",
  "authorUrl": "https://www.washingtontimes.com/staff/kerry-picket/",
  "termIds": [
    2443,
    3223,
    3049,
    1218,
    1477,
    1394,
    392,
    1126,
    6615,
    5949
  ],
  "sentences": [
    "“The South Dakota Democratic Party has determined it is not appropriate for Mr. Ryder to continue in this race and requested that he end his candidacy, which he has agreed to,” South Dakota Democratic Party Chairman Randy Seiler said in a statement on Thursday.",
    "“A lot of these had important context on them.”\n“Ryan’s lifetime of service and commitment to his community speaks louder than some poorly-worded tweets,” said South Dakota Democratic Party Executive Director Berk Ehrmantraut to the outlet at the time.",
    "However, by Thursday, two of Mr. Ryder’s tweets — including one that suggested he should make an animated video of Mr. Johnson’s family getting killed — came to light, which caused the state Democratic Party to pressure Mr. Ryder to leave the primary.",
    "“These statements from Mr. Ryder do not live up to the values of the South Dakota Democratic Party, and we do not support this type of language.”\nThe Washington Times reached out to Mr. Ryder but did not immediately hear back.",
    "In a second tweet, Mr. Ryder wrote that he hoped the Jan. 6, 2021, U.S. Capitol rioters had captured Mr. Johnson, and a third tweet referenced a sexual act accompanying a photo of South Dakota Gov.",
    "Ryan Ryder, an Air Force veteran and attorney from Black Hawk, launched his campaign on Wednesday to run for the state’s single at-large congressional seat against Republican incumbent Rep.",
    "“I expect Ryan to be the Democratic nominee for Congress.”\nThe support from the party only lasted one day for Mr. Ryder, whose personal Twitter account has now been deactivated.",
    "A South Dakota Democrat withdrew from a congressional race just one day after he announced his candidacy, after a series of disturbing posts from his Twitter account was found.",
    "“A lot of these were basically just biting sarcasm, just flippant and rude,” Mr. Ryder told Dakota News Now on Wednesday, when the state party still supported his candidacy.",
    "Mr. Ryder told The Associated Press that the tweet was a reaction to Mr. Johnson’s November 2021 House vote against censuring fellow Republican Rep. Paul Gosar of Arizona.",
    "Mr. Gosar was disciplined for an animated video he had posted showing him killing a character that looked like Rep. Alexandria Ocasio-Cortez, New York Democrat.",
    "South Dakota Democrats, who are struggling to get a foothold in a bright red state, called on Mr. Ryder to leave the race the following day and he complied.",
    "Mr. Ryder was the only Democratic challenger for South Dakota’s only congressional district presently.",
    "Kristi Noem, a Republican.",
    "Dusty Johnson."
  ]
}