{
  "id": 11415,
  "mediaId": 2746,
  "date": "2022-03-18",
  "headline": "McCarthy pledges to boot Schiff off intel committee in a GOP majority",
  "image": "https://twt-thumbs.washtimes.com/media/image/2020/09/23/democrats_presidential_abuses_47779_c0-184-4427-2766_s1200x700.jpg?632655642ab60b5c33a845e8888ff267d2edca11",
  "link": "https://www.washingtontimes.com/news/2022/mar/18/mccarthy-pledges-boot-schiff-intel-committee-gop-m/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kerry Picket",
  "authorUrl": "https://www.washingtontimes.com/staff/kerry-picket/",
  "termIds": [
    0
  ],
  "sentences": [
    "You cannot use a position of a chairman to lie and you should be focused on what the American people want you to be focused on around the world.”\nThe information in the younger Biden’s laptop, first reported on by the New York Post in October 2020, contained email exchanges, text messages, photos and financial documents showing how the president’s son used his father as political leverage to score overseas business deals.",
    "Mr. McCarthy, California Republican, accused Mr. Schiff, a California Democrat who currently chairs the Intelligence Committee, of “politicizing” the panel and not paying attention to the threats against the U.S.\nMr. McCarthy pointed to Mr. Schiff’s conduct regarding Hunter Biden’s laptop, which was found during the 2020 presidential election and revealed potentially embarrassing information for President Biden.",
    "It was an unprecedented move for the majority to remove a member of the minority party from their committee assignment when it was first applied to Mrs. Greene in Feb. 2021 for Facebook posts deemed offensive before her time in office.",
    "Mr. Schiff “lied to Americans … again,” because he previously said the emails “were all a ‘whole smear on Joe Biden comes from the Kremlin,’ a dishonest attempt to help then candidate-Biden,” said Mr. McCarthy.",
    "Two other Democratic lawmakers he wants to see gone from their committee assignments are Reps. Eric Swalwell of California from Intel and Ilhan Omar of Minnesota from the Foreign Relations Committee.",
    "He noted that emails found in the laptop were authenticated by The New York Times on Thursday, though the New York Post and other news outlets previously verified the laptop’s authenticity.",
    "House Minority Leader Kevin McCarthy plans to eject Rep. Adam Schiff from his seat on the Permanent Select Committee on Intelligence if Republicans take back the majority in November.",
    "The GOP wants retribution since House Democrats used their majority to remove two Republicans, Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona from their committees.",
    "And we should be able to trust the chair of the Intel Committee, to be honest with the American public, regardless of what political realm is in,” he added.",
    "Mr. McCarthy blamed Mr. Schiff’s focus on impeaching former President Donald Trump for “missing” Afghanistan’s collapse and Russia’s invasion of Ukraine.",
    "It is not the first Mr. McCarthy said he wants to see Mr. Schiff removed from the Intelligence Committee.",
    "Mr. McCarthy asked, “Why is he still chair of the committee?",
    "In a new Congress, if it’s a new majority, he will not be.",
    "You cannot make this committee political.",
    "And why is he even on the committee?",
    "“That’s not your job.",
    "That’s not your role."
  ]
}