{
  "id": 11529,
  "mediaId": 2646,
  "date": "2022-03-09",
  "headline": "NAZIS WELCOME: House GOP leader promises reward for racist Representatives",
  "image": "https://occupydemocrats.com/wp-content/uploads/mtg-loves-neo-nazis-faces-no-consequences-kevin-mccarthy.jpg",
  "link": "https://occupydemocrats.com/2022/03/09/nazis-welcome-house-gop-leader-promises-reward-for-racist-representatives/",
  "mediaOutlet": "occupydemocrats.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thomas Kennedy",
  "authorUrl": "https://occupydemocrats.com/author/thomaskennedy/",
  "termIds": [
    2443,
    3049,
    4066,
    212,
    1126,
    1477,
    6678
  ],
  "sentences": [
    "Kevin McCarthy promised his Republican colleagues Greene and Gosar the “ability” to affect legislation again by giving them back their committee assignments next year, after being ingloriously stripped of their seats this past year due to their previously unhinged behavior and threats which are beneath the dignity of a United States Member of Congress.",
    "The failure to deliver any sort of repercussion for GOP Reps. Greene and Gosar conferencing with neo-Nazis are outrageous considering that minority leader McCarthy has threatened to strip committee assignments from any Republican who participates in the special committee investigating the January 6th riots.",
    "Here’s a video of mealy-mouthed Kevin McCarthy saying anything to get out of a press conference:\nHere's where we're at in 2022: House Minority Leader Kevin McCarthy says he talked to Rep. Marjorie Taylor Greene (R-GA) about not attending any *more* white nationalist conferences.",
    "Rep. Greene in the past blamed wildfires in California on “Jewish space lasers”, suggested Muslims should not be involved in the U.S. government, and said that those supporting refugees are using “immigrant pawns” to commit “the biggest genocide in human history”.",
    "Supposed Republican party leaders like McCarthy have a responsibility – if such a thing exists in the former “Party of Personal Responsibility” – to intervene when members of his caucus ally themselves with literal neo-nazis and racists.",
    "We recently wrote about pariah members of Congress, Rep. Marjorie Taylor Greene (R-GA), and Paul Gosar’s (R-AZ) appearances at the American First Political Action Conference, an event organized by neo-nazis and white nationalists.",
    "Sponsored Links\nProgressive champion Rep. Alexandria Ocasio-Cortez only needed two words to make McCarthy’s shame go viral:\nSponsored Links\nSponsored Links\nBoth Greene and Gosar are no strangers to being horrible people.",
    "Following their appearances, GOP minority “leader” McCarthy has refused to condemn their appearances or bring any repercussions on the pair that show his caucus doesn’t stand with bigots and white nationalists.",
    "In addition to being stripped of his Congressional posts, Rep. Gosar was censured by the full House of Representatives after posting an edited clip depicting him killing Congresswoman Alexandria Ocasio-Cortez.",
    "He’s especially afraid of the crazed right-wing, pro-Trump neo-Nazis in his caucus who hold votes in the race for Speaker of the House, which is the only life goal the California Republican cares about.",
    "Advertisement Above\nTwo racist GOP Representatives spoke to a conference of America First neo-Nazis but won’t face any consequences from squeamish Republican House minority leader Kevin McCarthy (R-CA).",
    "Instead, the Republican party’s House minority leader says the two neo-Nazi caucus members be rewarded if his party takes back control of the House in the midterm elections this November.",
    "Kevin McCarthy has also flip-flopped from admitting Donald Trump incited the assault on the Capitol that day to somehow blaming the incident on Congressional Democrats.",
    "Because we all know the Republican party’s complicity to neo-Nazis is just as much a requirement as their obligation to swear undying loyalty to Donald Trump.",
    "pic.twitter.com/D86ckJlhWS\n— The Recount (@therecount) March 9, 2022\nThomas Kennedy is an elected Democratic National Committee member representing Florida.",
    "Unfortunately, Kevin McCarthy is a dreadful coward who lives life terrified of his own shadow and won’t do anything that upsets Republican primary voters.",
    "And although she agreed to “not go again”, the top elected Republican government in official in America has caused no consequences for her actions.",
    "After nearly a week since the news broke, McCarthy says that he has finally spoken to Marjorie Taylor Greene.",
    "It was the first House censure since 2010 and only the 24th in American history.",
    "McCarthy then dodges a @mkraju follow-up about any repercussions for Greene.",
    "Add your name to call on prosecutors to ARREST DONALD TRUMP for his crimes!",
    "If silence is complicity when the Nazis show up, this is far far worse.",
    "GOP Reps. Marjorie Taylor Greene and Paul Gosar are unhinged lunatics.",
    "They are racist, bigoted, hateful individuals.",
    "It’s tantamount to an endorsement of hate.",
    "He’s a bizarre man and he is sad to watch.",
    "We can’t expect any better from them.",
    "He tweets from @tomaskenn.",
    "What does that mean?",
    "Advertisements",
    "None."
  ]
}