{
  "id": 1223,
  "mediaId": 8322,
  "date": "2022-02-11",
  "headline": "Rep. Fallon introduces bill to scrap diversity visa lottery, limit asylum claims",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/05/US-Capitol-Congress-AP.jpg",
  "link": "https://www.foxnews.com/politics/rep-fallon-introduces-bill-diversity-visa-lottery-limit-asylum-claims",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    2443,
    4992,
    3176,
    4050,
    3578,
    1126,
    1477,
    628
  ],
  "sentences": [
    "The bill has eight co-sponsors: Reps. Ronny Jackson, R-Texas, Jake Ellzey, R-Texas, Ted Budd, R-N.C., Dan Bishop, R-N.C., Scott DesJarlais, R-Tenn., Clay Higgins, R-La., Bill Pose, R-Fla., and Paul Gosar, R-Ariz.\nFallon cited the ongoing crisis at the southern border and said that \"the enforcement of our immigration laws is not necessarily the root cause of this crisis – it is the laws themselves.\"",
    "REP. ROSENDALE INTRODUCES BILL TO BLOCK MILITARY ASSISTANCE TO UKRAINE UNTIL US BORDER IS SECURED\nThe bill was praised by immigration hawk groups Numbers USA and the Federation for American Immigration Reform (FAIR), which praised the bill for tackling \"a deeply-flawed legal immigration program, the most overlooked method of illegal entry, and humanitarian loopholes that drive the border crisis.\"",
    "\"Specifically, the ALIEN Act reforms these distinct but interconnected issues by eliminating the unnecessary visa lottery, cracking down on visa overstays, and by making desperately needed changes to our asylum process,\" FAIR President Dan Stein said in a statement.",
    "FLORIDA GOP LAWMAKER INTRODUCES SWEEPING IMMIGRATION BILL WITH ‘DIGNIFIED’ PATHWAY FOR LEGALIZATION\nSome Republicans have opposed the visa lottery, arguing that picking immigrants at random isn’t the best way to pick the best immigrants from across the globe.",
    "FIRST ON FOX: Rep. Pat Fallon, R-Texas, introduced legislation on Friday that would scrap the diversity visa lottery and impose penalties on immigrants who have overstayed their visas -- and it includes provisions to prevent asylum fraud.",
    "This week, Rep. Maria Salazar, R-Fla., introduced a sweeping immigration reform bill that would grant illegal immigrants a pathway to citizenship while requiring them to pay for border security and American worker retraining programs.",
    "The bill would first seek to scrap the controversial Diversity Immigrant Visa Program, known commonly as the visa lottery, which hands out visas based on random selection to countries with low rates of immigration to the U.S.",
    "Former President Trump called for the program to be scrapped after a 2017 terrorist attack in New York City, where the suspect was a visa lottery recipient from Uzbekistan.",
    "Separately, the legislation would impose a fine of up to $1,000 a day and potential jail time for immigrants who came in on temporary visas but overstayed those visas.",
    "The Abolishing the Lottery and Immigration Enforcement Now (ALIEN) Act looks to tackle drivers of mass legal immigration and the migrant surge at the southern border.",
    "That can be established based on a number of categories -- including race, religion, nationality, membership in a particular social group, or political opinion.",
    "It starts by building a merit-based immigration system, by strengthening visa overstay penalties, and by eliminating the fraud in our asylum program.",
    "The ALIEN Act would remove \"membership in a particular social group,\" noting that courts have found the phrase to be ambiguous and open-ended.",
    "\"It is yet another shovel-ready solution to address an unprecedented crisis that those across the aisle on Capitol Hill continue to ignore.",
    "Rep. Matt Rosendale, R-Mont., this week introduced legislation that would bar funding to Ukraine until the border is operationally secure.",
    "The bill marks the latest Republican effort to tackle immigration issues, including those related to the crisis at the southern border.",
    "It would place a five-year bar on legal reentry, a 10-year bar on asylum and a 15-year ban for green card applications.",
    "The FY2020 entry/exit overstay report found there were nearly 585,000 in-country visa overstays that year.",
    "Currently, a migrant must show they have \"credible fear\" of persecution if they are returned home.",
    "\"We need to close loopholes and eliminate drivers of illegal immigration.",
    "This legislation is a crucial first step in the right direction.\"",
    "It would also bar permanently anyone who overstayed a visa twice.",
    "\"It's time for substantive change,\" he said in a statement.",
    "\"Diversity lottery -- sounds nice,\" he said at the time.",
    "Approximately 50,000 are made available each year.",
    "Will Speaker Pelosi finally step up to the plate?\"",
    "Finally, the legislation targets asylum fraud.",
    "We’ve been against it.\"",
    "It hasn’t been good.",
    "\"It’s not nice.",
    "It’s not good."
  ]
}