{
  "id": 12483,
  "mediaId": 2658,
  "date": "2022-02-28",
  "headline": "Fence up, masks off at the Capitol",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/02/28/fence-up-masks-off-at-the-capitol-00012226",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2443,
    2327,
    4195,
    4873,
    5699,
    4983,
    5024,
    5152,
    5299,
    4032,
    1429,
    226,
    6672
  ],
  "sentences": [
    "Capitol Police began erecting perimeter fencing around the Capitol on Sunday ahead of President Joe Biden’s State of the Union address and expected protests in Washington, D.C. “Out of an abundance of caution, and in conjunction with the United States Secret Service, a plan has been approved to put up the inner-perimeter fence around the Capitol building for the State of the Union Address,” Capitol Police Chief Thomas Manger said in a statement.",
    "Senate Majority Leader Chuck Schumer (D-N.Y.) will meet with Jackson on Wednesday at 10 a.m.\nICYMI on Friday, Burgess previewed the grueling six weeks ahead for Jackson: KBJ all the way: Supreme Court pick reinvigorates Schumer\n‘I’VE GOT MORONS ON MY TEAM’ — Rep. Marjorie Taylor Greene (R-Ga.) spoke at the America First Political Action Conference over the weekend, hosted by far-right activist and white supremacist Nick Fuentes.",
    "QUICK LINKS\nThe left gears up to grow its numbers in Congress, from Holly Otterbein and Elena Schneider\nHow Putin made the EU great again, from POLITICO Europe\n‘Blood Red’: How Lopsided New District Lines Are Deepening America’s Divide, from The New York Times\nTRANSITIONS\nOUR FEARLESS LEADER — POLITICO Congress Editor Elana Schor is being promoted to deputy managing editor for Congress.",
    "Fence up, masks off at the Capitol\nBy KATHERINE TULLY-MCMANUS\n02/28/2022 07:28 AM EST\nPresented by Connected Commerce Council\nHERE COMES TROUBLE— It’s fly-in day on Capitol Hill and lawmakers return to a Capitol enclosed by fencing (once again,) mask mandates lifted and feeling the weight of a war that started halfway across the world while Congress was in recess.",
    "“What’s happening in Texas—banning abortion before some people even know they’re pregnant, vigilante lawsuits against private citizens, women’s lives on the line, and chaos for health care providers—is appalling, and to be clear, the Republican Party wants to replicate it across the country,” Sen. Patty Murray (D-Wash.) said in a statement to POLITICO.",
    "Here are the expected briefers: Secretary of State Antony Blinken, Defense Secretary Lloyd Austin, Director of National Intelligence Avril Haines, Homeland Security Secretary Alejandro Mayorkas, Energy Secretary Jennifer Granholm, Commerce Secretary Gina Raimondo, Deputy Treasury Secretary Wally Adeyemo and USAID Deputy Administrator Isobel Coleman.",
    "Sen. Mitt Romney (R-Utah) offered this on CNN Sunday: “You know, Marjorie Taylor Greene and Paul Gosar, I don't know them, but I'm reminded of that old line for the Butch Cassidy the Sundance Kid movie where one character says, 'Morons, I've got morons on my team.’” More from The Atlanta Journal Constitution and The Wall Street Journal.",
    "Your Huddle host dug into the new guidance last night: Capitol leaders rescind mask mandate ahead of State of the Union\nThe move happens to match the narrative that many Democrats would like to project heading into the midterm elections (and for Biden to highlight on Tuesday,) that the country is moving forward past the pandemic.",
    "That’s what Monday’s vote is about and that’s what we are going to keep fighting for.”\nKETANJI COMES CALLING — Judge Ketanji Brown Jackson heads to Capitol Hill this week to meet with senators for “courtesy calls,” which in reality are sometimes dense conversations about legal issues and judicial philosophy (plus a photo opp.)",
    "The 2018 Jeopardy champion will lead plans to “expand and evolve our editorial ambitions on Capitol Hill through our existing products (and the exploration of new ones).” The newsroom memo\nChris D’Aloia is Rep. Josh Gottheimer’s (D-N.J.) new D.C. press secretary.",
    "Covid on Capitol Hill\nNEW MASK, TESTING GUIDANCE— The Office of the Attending Physician announced last night that masks are now optional across Capitol Hill, including in the House chamber during President Joe Biden’s State of the Union address on Tuesday.",
    "INTO THE THICK OF IT — The Senate will vote Monday night on the Women’s Health Protection Act, a bill progressive lawmakers have been pushing since 2013 that would bar states from enacting restrictions on abortion, our Alice Miranda Ollstein reports.",
    "ICYMI… Lawmakers are considering including the White House’s $6.4 billion request for aide to Ukraine to fend off the Russian invasion into the broader spending package that leaders are working to finalize by the March 11 funding deadline.",
    "The measure narrowly passed the House last year and it is expected to come up short in the Senate with unanimous opposition from Republicans as well Sen. Joe Manchin (D-W.Va.) and potentially other conservative Democrats.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Monday, February 28, where we’ll hear Sen. Patrick Leahy (D-Vt.) deliver the classic George Washington farewell address this afternoon.",
    "Eleanor Holmes Norton (D-D.C.) says she will “ensure that the fencing comes down as soon as possible to restore freedom of movement for District of Columbia residents and the general public.”\nGOOD MORNING!",
    "WHAT’S NEXT ON UKRAINE— Both the House and Senate are set to receive classified briefings on Ukraine late today, building on the unclassified calls each chamber had late last week on the Russian invasion.",
    "Talks begin: Negotiations between delegations from Ukraine and Russia have begun at the Ukraine-Belarus border, but there is little confidence that peace or agreement will emerge from the meetings.",
    "Greene defended her appearance Sunday: “I won’t cancel others in the conservative movement, even if I find some of their statements tasteless, misguided or even repulsive at times,” she said.",
    "TRIVIA\nFRIDAY’S WINNER: Jack Howard correctly answered that the Adams Sofa is where John Quincy Adams was laid and eventually died after suffering a stroke at his desk on the House floor.",
    "changed his Twitter bio to quote the last communications from 13 Ukrainian defenders of an island approached by the Russian navy: \"Russian warship, go fuck yourself.\"",
    "The Senate convenes at 3 p.m.\nAROUND THE HILL\n10 a.m. Pelosi hosts a statue dedication ceremony for D.C.'s second statue in Capitol, honoring Pierre L'Enfant.",
    "The positive test rate over the last two weeks at the Capitol Visitors Center testing site is 2.7 percent, which is lower than D.C., Maryland and Virginia.",
    "Shana Mansbach has been promoted to be deputy communications director and Joy Lee to be national press secretary for Speaker Nancy Pelosi (D-Calif.).",
    "“Democrats, on the other hand, want to make sure no matter where you live, your decision about pregnancy isn’t up to some extreme politician.",
    "and House Judiciary Chair Jerry Nadler (D-N.Y.) hold a press conference on the Emmett Till Antilynching Act (HVC Studio B).",
    "Mansbach most recently was director of speechwriting for Pelosi and Lee most recently was press secretary in the office.",
    "Lawmakers will likely press administration officials on what comes next, contingency plans and how to move more swiftly.",
    "The ask includes $3.5 billion in Pentagon funding and $2.9 billion for foreign security and humanitarian assistance.",
    "TODAY’S QUESTION: What current member of Congress and leap-year baby won’t get another birthday until February 2024?",
    "4 p.m. House Freedom Caucus holds a press conference on the Biden administration’s policies (House Triangle).",
    "She spent seven years on the hill, most recently as communications director for Sen. Chris Murphy (D-Conn.).",
    "And that’s all before President Joe Biden stops by Tuesday night to deliver his State of the Union address.",
    "The delegation from Kyiv is pushing for an immediate ceasefire and the withdrawal of troops from Ukraine.",
    "The distribution of at-home testing kits will pause starting March 7 only to resume if cases rise again.",
    "Lydia Hubert-Peterson has been promoted to be director of scheduling for Sen. Amy Klobuchar (D-Minn.).",
    "Rachael Hartford is headed to Precision Strategies to be associate vice president for communications.",
    "Graeme Crews is now press secretary for the House coronavirus crisis select subcommittee.",
    "Regarding your Moscow Mule…If you were staying away from Stoli or Smirnoff, check again.",
    "Jamie Geller is joining Purple Strategies as a senior director and communications lead.",
    "She most recently was legislative intern for Rep. Debbie Wasserman Schultz (D-Fla.).",
    "She was previously deputy communications director for Sen. Sherrod Brown (D-Ohio).",
    "If you’ve deescalated interpersonal conflicts on the Hill, you might be qualified.",
    "3967, a bill that would seek to improve health care for veterans (H-313 Capitol).",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "He previously was a senior media strategist for the Southern Poverty Law Center.",
    "Glen Younkin ordered Russian vodka pulled from the state-owned liquor stores.",
    "4:30 p.m. Rep. Bobby Rush (D-Ill.), House Majority Leader Steny Hoyer (D-Md.)",
    "\"We are back, we've got a lot more work to do, but we're on the right track.\"",
    "\"The overall theme should be we're beating this pandemic, we're moving on.",
    "The site, which offers free PCR tests to Hill employees, will remain open.",
    "Fish and Wildlife Service is looking for a Grizzly Bear Conflict Manager.",
    "got into the NFT game this weekend (but it might not be what you think.)",
    "TODAY IN CONGRESS\nThe House convenes at 2 p.m. for legislative business.",
    "And the economy is in good shape,\" Sen. Chris Van Hollen told POLITICO.",
    "Margaret M. Madsen is now scheduler for Rep. Donald Norcross (D-N.J.).",
    "He was most recently an senior account executive at PR firm LEVICK.",
    "(Also, those guys might not be dead, as earlier reports suggested).",
    "Rep. Paul Gosar (R-Ariz.) appeared via taped remarks at the event.",
    "Smirnoff is made in Illinois these days (and Stoli in Latvia.)",
    "Nicholas has more on the security preparations for this week.",
    "Virginia ABC stores will be doing some research after Gov.",
    "How are other Republicans responding to Greene and Gosar?",
    "She most recently was a special assistant for Klobuchar.",
    "DON’T FENCE ME IN— It’s too late for that classic tune.",
    "2 p.m. House Rules Committee business meeting on H.R.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "GET HUDDLE emailed to your phone each morning.",
    "Sasse has sass… Sen. Ben Sasse (R-Neb.)",
    "Send your answers to ktm@politico.com.",
    "More for your happy hour knowledge.",
    "HUDDLE HOTDISH\nNFTs in MT….Sen.",
    "Jon Tester (D-Mont.)",
    "Sign me up… U.S.",
    "Del."
  ]
}