{
  "id": 12559,
  "mediaId": 2664,
  "date": "2022-03-01",
  "headline": "GOP leaders condemn Greene and Gosar for appearing at white nationalist event – but it's not enough: op-ed",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29450412&width=1200&coordinates=0%2C44%2C0%2C6&height=600",
  "link": "https://www.rawstory.com/gop-leaders-need-to-forcefully-condemn-greene-and-gosar-for-appearing-at-white-nationalist-event-not-just-give-them-a-stern-talking-to-op-ed/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sky Palma",
  "authorUrl": "https://www.rawstory.com/u/sky_palma",
  "termIds": [
    2443,
    4066,
    3181,
    4267,
    1126,
    1125,
    6488
  ],
  "sentences": [
    "This is, after all, the same House Republican leader who vowed in November to reward Greene and Gosar with new committee assignments in the new Congress, if there’s a GOP majority in the chamber,\" Benen writes.",
    "But as MSNBC's Steven Benen points out, McConnell's statement, much like Republican National Committee Chair Ronna McDaniel's statement to reporters two days prior, did not mention Greene or Gosar by name.",
    "“McCarthy could even announce that he’s changed his mind about what he said four months ago, and he will no longer support giving Greene and Gosar committee assignments in the next Congress,” he added.",
    "After GOP Rep. Marjorie Taylor Greene and Paul Gosar both spoke at a white nationalist event in Orlando over the weekend, GOP leaders were quick to condemn their attendance.",
    "Senate Minority Leader Mitch McConnell chimed in as well, saying in a written statement, “There’s no place in the Republican Party for white supremacists or anti-Semitism.\"",
    "Benen said that Republicans could boot Gosar and Greene out of the GOP conference or refuse to support their re-election.",
    "\"This is not a situation in which McCarthy will make the questions go away by giving his members a stern talking to.",
    "\"With this in mind, what Republican leaders intend to do is more important than what they say.\"",
    "Stories Chosen For You"
  ]
}