{
  "id": 12550,
  "mediaId": 2594,
  "date": "2022-02-26",
  "headline": "Marjorie Taylor Greene defends speaking at white supremacist event saying she didn’t know what it was",
  "image": "https://static.independent.co.uk/2022/01/02/18/CORONAVIRUS-TWITTER-GREENE_38777.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/marjorie-taylor-greene-white-supremacist-b2024182.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Bowden",
  "authorUrl": "https://www.independent.co.uk/author/john-bowden",
  "termIds": [
    2443,
    3246,
    4039,
    883,
    1126,
    6159,
    6175
  ],
  "sentences": [
    "The Georgia congresswoman has been chastised by her own party for her past views but now is largely embraced by the GOP establishment including former anti-Trump Republican candidate JD Vance, who is running for Senate in Ohio and recently celebrated being endorsed by Ms Greene.",
    "RNC Chairwoman Ronna Romney McDaniel added: “White supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.”\nMs Greene has a history of embracing both conspiracy theories and calls for violence against liberals.",
    "He has made numerous antisemitic comments over the years, and is a prominent pusher of the “white genocide” conspiracy theories which posit that liberals are trying to forcibly destroy white people as a race.",
    "Rep Marjorie Taylor Greene waded into newfound controversy on Friday when she attended a white nationalist convention in Florida and tried to claim afterwards that she didn’t know what she was doing.",
    "Amusingly, the latest controversy involving Ms Greene occurred less than a week after she appeared on the show of InfoWars host and conspiracy theorist Alex Jones to complain about her public image.",
    "“I do not know Nick Fuentes; I’ve never heard him speak, I’ve never seen a video, I don’t know what his views are, so I’m not aligned with anything that may be controversial,” she said.",
    "On Saturday, Ms Greene initially attempted to dodge questions about the event, but addressed reporters after it became clear that her attendance at the event was not a guarded secret.",
    "“As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "She saw herself stripped of committee assignments in 2021 after her past support for violence against Nancy Pelosi and sharing of 9/11 conspiracy theories were unveiled.",
    "“It bothers me so much — they treat me as if I'm some kind of crazy person, or like I have three horns coming out of my head,” she told Mr Jones on last Sunday.",
    "Her remarks came hours after she shared a stage with him and even went on Twitter to defend her efforts as aimed at reaching young conservatives.",
    "The Georgia congresswoman attended an event hosted by Nick Fuentes, one of the US’s most well-known white nationalists and far-right figures.",
    "Mr Fuentes is one of the most prominent white nationalists in America and has a well-documented history of making deeply offensive remarks.",
    "Mr Fuentes attended the 2017 “Unite the Right” rally during which neo-Nazis and far-right activists clashed with counterprotesters.",
    "She wasn’t the only Republican to take a hard stance against Ms Greene and the CPAC alternative that she attended on Friday.",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now,” tweeted Ms Cheney.",
    "But Ms Cheney wasn’t buying it, as reporters who questioned Ms Greene also refused to do.",
    "During her brief remarks, she claimed to have never heard of Mr Fuentes or his beliefs."
  ]
}