{
  "id": 12683,
  "mediaId": 2919,
  "date": "2022-02-28",
  "headline": "'I've got morons on my team': Romney blasts GOP members who attended white nationalist event",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/1fb577c/2147483647/strip/true/crop/750x394+0+53/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F59%2Fd2%2F38dc03724738b87247f191304723%2Fap22011628213308.jpg",
  "link": "https://www.news5cleveland.com/news/national/ive-got-morons-on-my-team-romney-blasts-gop-members-who-attended-white-nationalist-event",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Dewberry",
  "authorUrl": "https://www.news5cleveland.com/sarah-dewberry",
  "termIds": [
    0
  ],
  "sentences": [
    "The Wall Street Journal reported that Illinois Rep. Adam Kinzinger and Wyoming Rep. Liz Cheney also criticized Greene and Gosar for attending an event organized by white nationalist Nick Fuentes, who the US Department of Justice and the Anti-Defamation League have labeled a white supremacist.",
    "The Utah Republican made his opinion known Sunday during an interview on CNN's \"State of the Union\" when he was asked about the pro-Russian sentiment held by some members of the Republican Party, including former President Donald Trump, the New York Times reported.",
    "\"(Rep.) Marjorie Taylor Greene and (Rep.) Paul Gosar, I don't know them, but I'm reminded of that old line from the \"Butch Cassidy and the Sundance Kid\" movie where - where one character says, 'Morons, I've got morons on my team.'",
    "The former GOP Presidential nominee also did not mince words when it came to two Republican House members, Marjorie Taylor Greene and Paul Gosar, who attended a white nationalist rally Saturday.",
    "\"Well, a lot of those people are changing their stripes as they're seeing the response of the world and the political response here in the U.S.,\" Romney told CNN's, Dana Bash.",
    "Sen. Mitt Romney did not hold back his feelings when he condemned fellow GOP members on Sunday to attend a White nationalist event and support Russia's invasion of Ukraine.",
    "And I have to think anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points.\"",
    "He also couldn't understand how anyone in the U.S. who says they love freedom can side with Russian President Vladimir Putin.",
    "\"Look, there is no place in either political party for this white nationalism or racism.",
    "Romney wasn't the only GOP member to voice his criticism about Greene and Gosar.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "\"He's been an adversary of America at every chance he's had.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "It's simply wrong ... it's evil as well,\" Romney said.",
    "It's almost treasonous,\" Romney said.",
    "It's unthinkable to me."
  ]
}