{
  "id": 12749,
  "mediaId": 2614,
  "date": "2022-03-03",
  "headline": "Rep Gosar Owns RINO Kinzinger For Crying On Twitter Over Ukraine Support Resolution Vote Differences",
  "image": "https://www.lifezette.com/wp-content/uploads/2018/01/Paul-Gosar-illegals-capitol-police-arrest2.jpg",
  "link": "https://www.lifezette.com/2022/03/rep-gosar-owns-rino-kinzinger-for-crying-on-twitter-over-ukraine-support-resolution-vote-differences/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Voice Media",
  "authorUrl": "https://www.lifezette.com/author/redvoicemedia/",
  "termIds": [
    2443,
    5037,
    5645,
    3618,
    1126,
    1470,
    1394,
    6672,
    5980
  ],
  "sentences": [
    "Per the resolution, it asserts that the House “stands steadfastly, staunchly, proudly, and fervently behind the Ukrainian people in their fight against the authoritarian Putin regime.”\nWhat is also included in this resolution is a call to action for both the United States and our allies “to deliver additional and immediate defensive security assistance to help Ukraine address the armored, airborne, and other threats Ukraine is currently facing from Russian forces.”\nBut it doesn’t stop there, as the resolution also added that U.S. legislators “will never recognize or support any illegitimate Russian-controlled leader or government installed through the use of force.”\nThe House passed the resolution in a vote of 426-3, with the three Republicans voting against it being Rep. Gosar, Rep. Thomas Massie, and Rep. Matt Rosendale.",
    "We should not be seeking to name new enemies or committing to overturning other governments.”\nFurther, Rep. Massie pointed out that continued “sanctions could also drive Putin to become more desperate, inciting him to resort to drastic measures such as escalating the weapons employed or the people targeted.”\nStill, Rep. Kinzinger seemed unable to confront such nuance, engaging in a bit of moral posturing to call it “unreal” that some of his Republican colleagues would vote against the House resolution.",
    "Rep. Massie noted in a Twitter thread that he supports “the right of the people of Ukraine to self-determination” but decried how “broad” the resolution is and the unintended consequences that broadness could produce.",
    "WASHINGTON, DC – RINO Rep. Adam Kinzinger took to Twitter on March 2nd to whine about how three Republican representatives didn’t vote in favor of a House resolution voicing support for Ukraine.",
    "Unreal.”\nIn his typical, quick-witted fashion, Rep. Gosar responded to Rep. Kinzinger with, “Talk to me when our border is secure.”\nTalk to me when our border is secure.",
    "One of the three Republicans in question, Rep. Paul Gosar, delivered a clapback to Rep. Kinzinger that reiterated his America first stance.",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "https://t.co/0OXQ8wQVqo\n— Rep. Paul Gosar, DDS (@RepGosar) March 2, 2022\nThis piece was written by Gregory Hoyt on March 3, 2022.",
    "“Paul Gosar, Rosendale, and Thomas Massie just voted NO in the house of reps on a resolution supporting the people of Ukraine.",
    "This resolution came from Democrat Rep. Gregory Meeks, who serves as the Chairman of the House Foreign Affairs Committee.",
    "“It expands the geographic scope of the US commitment to the conflict in Ukraine by condemning the country of Belarus.",
    "It originally appeared in RedVoiceMedia.com and is used by permission."
  ]
}