{
  "id": 12774,
  "mediaId": 2672,
  "date": "2022-03-01",
  "headline": "Paul Gosar Just Promoted a Conspiracy Theory That He Built His Career Fighting Against",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/03/Paul-Gosar.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/paul-gosar-fluoride-conspiracy-theory-1314975/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hunter Walker",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In that clip, Gosar presented charts showing fluoridated water can cause a “loss of 6 IQ points” in children, and he suggested studies provide “some evidence that fluoride exposure during the early years of your life can damage a child’s developing brain.”\nHowever, as NBC News reported in 2018, “many dental experts dismiss such studies as bogus, particularly because many of them were done in other countries, where natural fluoride levels are far higher than in the U.S. and there may be other factors, like polluted water.”\nIn his clip, which was part of an ongoing “Mineral Monday’s” series, Gosar acknowledges “there is evidence that fluoride helps strengthen tooth enamel,” which “helps to prevent tooth decay.” However, he argues this could be outweighed by unspecified “health concerns.”\n“From a public policy perspective, the issue is this, is the prophylactic use of fluoride to improve oral health outweighed by any other health risk caused by the fluoride?",
    "In 2010, when Gosar first ran for Congress, the Arizona Daily Sun noted he “has been involved in politics with his work as a dentist and campaigning for the addition of fluoride to area water.”\nGosar’s office did not respond to a request for comment about his shift on the issue.",
    "“When we go back to the basics of prevention, if the fluoride ion has been proven — scientifically proven in well-versed, peer-reviewed science — to reduce decay by strengthening teeth, why not?” Gosar asked in the March 18, 2001 edition of the Arizona Daily Sun.",
    "At the time, one of the siblings, Dave Gosar, told The New York Times he stopped speaking to his brother in 2010 when the future congressman promoted false “birther” conspiracies that former President Barack Obama was born outside of the United States.",
    "“Gosar said very young children with such problems are often anesthetized, which presents even more dangers.”\nGosar, who supported efforts to put fluoride in Flagstaff’s water since as early as 1997, was ultimately defeated in his push.",
    "He was quoted in the Nov. 7, 2001 issue of the Arizona Daily Sun describing the vote against fluoridation as “kind of disturbing.”\nDespite the defeat, the fluoride push was a key part of his early political career.",
    "Faced with fierce opposition, Gosar called anti-fluoride conspiracy theories “disturbing,” suggested they could harm children, and vowed to “flood” the City Council chambers with people who supported fluoridation.",
    "“Here is somebody that spent decades of his life dedicated to peoples’ oral health and has … degraded to an absolute challenge to the science that was the basis of his ability to have this career,” Jennifer said.",
    "On Feb. 25, Gosar delivered remarks along with Rep. Marjorie Taylor Greene (R-Ga.) at the America First Political Action Conference, a white nationalist event where the host praised Hitler from the stage.",
    "The fluoride flip flop fits with the Republican Party’s increasing embrace of conspiracy theories in the decade since Gosar and other far-right figures were propelled to power by the Tea Party wave.",
    "Dave said his brother was adamant that opposition to fluoride was “absolutely insane.”\n“He was really involved and thought all these anti-fluoride conspiracy theorists were just nutty,” Dave said.",
    "Fast forward roughly 21 years and Gosar, now a Republican congressman in the state, made the exact opposite argument in a video posted on his Twitter page Monday night.",
    "According to the Arizona Daily Sun, Gosar dismissed other potential health concerns by pointing to the serious consequences children could face from tooth decay.",
    "Jennifer suggested her brother had fallen prey to “fanaticism, fascism, and an addiction to power.”\n“He’ll do anything at this point,” she said of Rep. Gosar.",
    "“I remember that distinctly.”\nDave attributed his brother’s changing opinion to “pandering to his base.”\n“Also, maybe he’s losing his mind,” Dave added.",
    "This debate is ongoing,” Gosar declared in the clip against a backdrop that included footage of brain scans and a man with a snake around his neck.",
    "In 2001, Paul Gosar was a local dentist who passionately led a campaign to put fluoride in the drinking water in the Arizona city of Flagstaff.",
    "In a phone conversation on Tuesday, Dave Gosar told Rolling Stone he vividly recalled his brother’s work for fluoridation.",
    "In the 1960s, Ronald Reagan and other GOP leaders purged far-right activists who spread outlandish fluoride conspiracies.",
    "Since that day, Gosar has repeatedly defended the rioters who stormed the Capitol in an effort to overturn the election.",
    "Amid controversy over his positions last year, Gosar lost the financial support of the American Dental Association.",
    "Gosar worked with pro-Trump activists on demonstrations promoting conspiracy theories about the 2020 election.",
    "More recently, some of Gosar’s siblings have publicly decried his efforts to challenge the 2020 election.",
    "Now, Republican legislators and officials have led opposition to fluoridation on multiple occasions.",
    "He also helped lead the objection to certifying the results at the U.S. Capitol on Jan. 6, 2021.",
    "Gosar directly refuted that same argument during his Flagstaff fluoridation campaign.",
    "Jennifer Gosar, the congressman’s sister, agreed in a phone call with Rolling Stone.",
    "“Gosar said he has treated patients with tooth decay who were less than a year old.",
    "… Surgery is time-consuming, expensive, and painful,” the newspaper reported.",
    "It’s also in keeping with Gosar’s own embrace of the far-right fringe.",
    "In 2018, six of his siblings appeared in an ad endorsing his opponent.",
    "“He parrots his base, he plays to them, he siphons money off them.",
    "Gosar has also been opposed by members of his own family.",
    "This is a person without scruples and without ethics.”"
  ]
}