{
  "id": 12815,
  "mediaId": 2520,
  "date": "2022-02-28",
  "headline": "The Arizona Republican Party is so scared of you that it's suing to outlaw early voting",
  "image": "https://www.gannett-cdn.com/presto/2020/10/30/PPHX/a0248f7f-b733-4ef6-b9f1-21ffe8403d2d-MaricopaBallot1.jpg?crop=5413,3045,x0,y162&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/02/28/arizona-republican-party-scared-voters-suing-end-early-voting/9321257002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    2443,
    3019,
    2915,
    3332,
    1126,
    392,
    99,
    1312,
    5949
  ],
  "sentences": [
    "We watch that fear in action every day at the Capitol, as Republican legislators scheme to put up all manner of new and inventive roadblocks to make it more difficult to vote, in the name of “election integrity.”\nWe see it on the campaign trail as various Republican candidates for the Senate (Jim Lamon) and governor (Kari Lake and Matt Salmon) have pledged to put an end to early voting.",
    "He knows this because the state Constitution talks about providing ballots in “such manner that the electors may express at the polls their approval or disapproval of [a] measure.”\nSo, the Republican Party has filed a lawsuit\nApparently, the kitchen table that serves as the polling place for nearly three million Arizona voters is downright unconstitutional.",
    "Senate lacks the votes to end early voting\nWhich matters not a hoot to the Republican Party because this isn’t really about “election integrity.” It isn’t about “restoring voter confidence” in elections that Ward, Senate President Karen Fann, Rep. Paul Gosar, Sen. Wendy Rogers and other GOP leaders have sought at every turn to undermine.",
    "So much corruption and cheating, in fact, that the Arizona Senate’s Cyber Ninja auditors couldn’t find any actual widespread evidence of corruption or cheating – only “anomalies” that are quickly cleared up if you take the time to read Maricopa County’s rebuttal of their findings.",
    "So much corruption, the Ninjas couldn't find it\nSo the Arizona Republican Party is asking the Arizona Supreme Court to end the wildly popular program used by nearly 90% of voters who cast ballots in the 2020 presidential election that Trump lost.",
    "Never mind that the program has worked so well for Republicans that in 2007, the GOP-controlled Legislature made it even easier to vote early, allowing voters to sign up to automatically get an early ballot in the mail.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Funny, I don’t recall ever hearing the party make the argument that early voting was illegal in all the years that Republicans dominated early balloting, giving them a leg up in every election.",
    "It's about fear\nNow, however, the drive is underway in all fronts to end an insanely popular program that for 30 years has boosted turnout and served the state well.",
    "The Arizona Republican Party, unable to get over the fact that Donald Trump lost the 2020 election, on Friday filed a lawsuit to outlaw early voting in Arizona.",
    "Meanwhile, moderate Republicans and independents in recent years have helped Democrats take both of Arizona’s U.S. Senate seats and the presidential election.",
    "I don’t recall hearing it after the 2020 primary election when 88% of voters cast early ballots and not a single one of our esteemed leaders cried fraud.",
    "All this, because one sore loser can’t accept defeat and too darned few of our so-called leaders will tell the emperor to put on some freaking clothes.",
    "“There’s so much corruption and cheating in our elections and much of it is coming from mail-in voting … ,” Lake told me last fall, via her spokesman.",
    "Never mind that Arizona has allowed early voting for 30 years, during which time Republicans have dominated statewide and legislative elections.",
    "In a special action filed Friday, the party’s attorney Alexander Kolodin contends the only legal way to vote is in person and on Election Day.",
    "“Because no-excuse mail-in voting is not exercised at the polls, it is unconstitutional,” he told Capitol Media Services’ Howard Fischer.",
    "(In fact, most of them won their seats that night given the way most legislative and congressional districts are gerrymandered.)",
    "In 2020, it backfired on them, as Democrats turned out in record numbers to vote early and well, you know the result.",
    "Just on Monday, Maricopa County Recorder Stephen Richer announced that independents now outnumber Republicans.",
    "Now, suddenly, the state’s long-lauded early voting program is apparently a hotbed of fraud and corruption.",
    "Opinion: The Arizona Republican Party is suing to end the state's wildly popular early voting program.",
    "It’s about election survival for a party that has been taken over by the far-right fringe.",
    "And if its leaders somehow succeed in killing early voting, they’ll have reason to be.",
    "Instead, it's decided to do whatever it takes to get voters to sit elections out.",
    "And so comes the party’s appeal to the Supreme Court to outlaw early voting.",
    "I’d ask what state GOP Chairwoman Kelli Ward and her cohorts are afraid of.",
    "But it became clear last week that the votes aren’t there in the Senate.",
    "Which, I suppose, would mean that Ducey is no longer our governor.",
    "The Arizona Republican Party is scared stiff of Arizona voters.",
    "Doug Ducey and the Legislature could simply end early voting.",
    "This, in a state that is turning a distinct shade of purple.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "Of course, the party could respond by broadening its base.",
    "At least, if you go by the Republican Party’s logic.",
    "Which brings us to the plan to outlaw early voting.",
    "In fact, there are several bills to do just that.",
    "But this isn't about 'election integrity.'",
    "And unconstitutional, too, they cry.",
    "That bunch of bums are all usurpers.",
    "It's about a fear of voters.",
    "This isn’t about fraud.",
    "It's not about fraud.",
    "And our Legislature?",
    "but I already know.",
    "It’s about fear.",
    "Gov."
  ]
}