{
  "id": 12859,
  "mediaId": 2584,
  "date": "2022-02-27",
  "headline": "Romney: Marjorie Taylor Greene a ‘moron’ for speaking at white nationalist event",
  "image": "https://i.guim.co.uk/img/media/b812dd00407915121c5108de8a0392fa51710feb/0_327_4200_2521/master/4200.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=21ae2bc402a135db85845420dbca6231",
  "link": "https://www.theguardian.com/us-news/2022/feb/27/mitt-romney-marjorie-taylor-greene-paul-gosar-morons",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Martin Pengelly",
  "authorUrl": "https://www.theguardian.com/profile/martin-pengelly",
  "termIds": [
    0
  ],
  "sentences": [
    "“[House speaker] Nancy Pelosi decided to strip her of her rights as a congressperson to serve on these committees and Twitter has decided to shut her down.”\nHillyard said: “But you’re inviting legitimacy to that white nationalist movement that was just down the road when a member of Congress from the Republican party appears at that event and you bring her here.”\nSchlapp said: “I’m providing legitimacy to you and your network by being allowed to be in this room.",
    "“Quite simply, the longer [House Republican leader] Kevin McCarthy gives Marjorie Taylor Greene an unfettered platform and promises to elevate her, the more complicit he is.”\nThe Republican party chair, Ronna McDaniel, said: “White supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican party.”\nBut McDaniel and McCarthy lead a party in which the far right is strong, former president Donald Trump its figurehead.",
    "Ammar Moussa, a spokesperson for the Democratic National Committee, said: “In any other world, Greene speaking at a white supremacist conference where attendees have defended Vladimir Putin and praised Adolf Hitler would warrant expulsion from the caucus, to say nothing of her advocacy for violence and consistent antisemitism is disgusting.",
    "I’ve got morons on my team.’ I have to think anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points.”\nGreene, from Georgia, and Gosar, from Arizona, spoke at the America First Political Action Conference, or AFPAC, organised by the far-right activist Nick Fuentes.",
    "In video posted online, Vaughn Hillyard, a reporter for NBC, asked CPAC organiser Matt Schlapp why Greene had been invited despite her long record of extremist behaviour and her participation in the white nationalist event.",
    "Marjorie Taylor Greene and Paul Gosar, members of Congress who spoke at a white nationalist event in Florida this week, are “morons” with no place in the Republican party, Mitt Romney said on Sunday.",
    "On CNN, Romney mentioned McDaniel’s statement about Greene and Gosar as well as strong words from Liz Cheney, the Wyoming Republican congresswoman and Trump critic.",
    "If I had said you couldn’t come into this room, how would that make America better?”\nHillyard asked: “Did you extend an invite to Liz Cheney?”\nSchlapp said: “No.”",
    "“Talking about how repugnant these white nationalists are,” Romney said, “look, there’s no place in either political party for this white nationalism or racism.",
    "“I’m reminded of that old line from the Butch Cassidy and the Sundance Kid movie,” the Utah senator and 2012 presidential nominee told CNN’s State of the Union.",
    "“I think it’s great that Marjorie Taylor Greene was on this stage because she was elected by her constituents to have a vote in Congress,” Schlapp said.",
    "And, you know, Marjorie Taylor Greene and Paul Gosar, I don’t know them.”\nCheney is a stringent conservative but remains at odds with her party.",
    "Calls for the censure of the two Republicans, familiar from previous instances of extreme behaviour, rang out again on Saturday.",
    "It’s called the first amendment and you are a member of the press and you have a right to be in this room.",
    "She was not invited to CPAC, the larger conservative event in Florida at which Trump and Greene appeared.",
    "McDaniel is Romney’s niece, though she reportedly stopped using his name at Trump’s request.",
    "Greene defended her attendance, saying she did not know Fuentes or endorse his views.",
    "“Speaking of evil, it’s evil as well.",
    "“One character says, ‘Morons.",
    "it’s simply wrong."
  ]
}