{
  "id": 12866,
  "mediaId": 2643,
  "date": "2022-02-27",
  "headline": "Mitt Romney Blasts Greene, Gosar: 'Missing a Few IQ Points'",
  "image": "",
  "link": "https://www.newsweek.com/mitt-romney-blasts-greene-gosar-missing-few-iq-points-1683040",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    2443,
    4039,
    5583,
    1312,
    1477,
    1126,
    6569,
    6672,
    6175
  ],
  "sentences": [
    "Representative Liz Cheney, of Wyoming tweeted: \"As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.\"",
    "In a statement to Newsweek on Sunday, Greene said, \"I am not going to play the guilt by association game in which you demand every conservative should justify anything ever said by anyone they've ever shared a room with.",
    "He said he believes those who have sided with Putin are doing so to \"get them more eyeballs\" or \"maybe make a little more money for them or their network,\" adding that he hopes they are realizing how wrong they are.",
    "She wrote that she would not \"turn down the opportunity to speak to 1,200 young America First patriots\" over \"a few off-color remarks by another speaker, even if I find those remarks unsavory.\"",
    "Greene, a Georgia Republican, attended the American First Political Action Conference on Friday, while Gosar, an Arizona Republican, who previously attended the event, spoke by video link.",
    "Their attendance sparked criticism from some members of the Republican Party, with Romney, a Utah senator who was the GOP presidential nominee in 2012, being the latest to condemn them.",
    "Romney went on to call out some Republicans who have praised Russian President Vladimir Putin as he invades Ukraine, threatening to upend the lives of millions of Ukrainians.",
    "Republican Senator Mitt Romney called out GOP Representatives Marjorie Taylor Greene and Paul Gosar for attending a far-right rally while appearing on CNN Sunday morning.",
    "\"Now they're going on about Russia and Vladimir Putin is Hitler—they say that's not a good thing,\" he said, before adding that he \"shouldn't have said that.\"",
    "And I have to think anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points.\"",
    "He also faced criticism for remarks he made during the conference when he asked attendees to \"give a round of applause for Russia.\"",
    "The conference was founded by Nick Fuentes, who has been described as a \"white supremacist\" by the Anti-Defamation League (ADL).",
    "Newsweek also reached out to Gosar's office for comment Sunday morning, but did not hear back by publication.",
    "Fuentes has long faced criticism for remarks, which were dubbed \"racist and antisemitic\" by the ADL.",
    "But I'm reminded of that Butch Cassidy and the Sundance Kid movie where one character says 'Morons.",
    "Greene also sought to distance herself from Fuentes when pressed by CBS News about the event.",
    "\"There's no place in either political party for this white nationalism or racism.",
    "It just makes me ill to to see some of these people do that.\"",
    "Other Republicans criticized Greene and Gosar for attending.",
    "\"Marjorie Taylor Greene and Paul Gosar—I don't know them.",
    "This story will be updated with any response.",
    "I don't know what his views are,\" she said.",
    "I'm not going to be drawn into that.",
    "I'm only responsible for what I say.",
    "\"It's unthinkable to me,\" he said.",
    "I talked about God and Liberty.\"",
    "It's simply wrong,\" he said.",
    "\"I don't know Nick Fuentes.",
    "I've never seen him speak.",
    "So ask me about my speech.",
    "I have morons on my team.'",
    "\"It's almost treasonous.",
    "I've never seen a video."
  ]
}