{
  "id": 12886,
  "mediaId": 2584,
  "date": "2022-03-03",
  "headline": "USA Rugby World Cup bid attracts bipartisan support in Congress",
  "image": "https://i.guim.co.uk/img/media/4c0bc23930a7fc14ec58610ecfc744c212dae55a/0_188_4500_2700/master/4500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=853d257b88141a87cbc9937a8a19bfa0",
  "link": "https://www.theguardian.com/sport/2022/mar/03/usa-rugby-world-cup-bid-congress-resolution",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Martin Pengelly",
  "authorUrl": "https://www.theguardian.com/profile/martin-pengelly",
  "termIds": [
    5885,
    2489,
    2276,
    5024,
    1524,
    1600,
    5966,
    5949
  ],
  "sentences": [
    "On Thursday, the chair of the USA bid, Jim Brown, said: “Today’s resolution demonstrates a clear commitment to growing the game of rugby and advancing the United States’ Rugby World Cup bid – which will have important economic and cultural benefits at both the domestic and international level.”\nUSA Rugby said that “in addition to conveying congressional enthusiasm for the bid”, the resolution “encourages President Joe Biden and relevant federal agencies to support the bid committee in their ongoing efforts.",
    "Mooney said: “As a former college rugby player at Dartmouth College, I continue to enjoy watching the sport … as co-chairman of the Congressional Rugby Caucus, I am proud to be an advocate for the Rugby World Cup.”\nHolmes Norton said: “Rugby has made a difference to the youth of the District of Columbia and across the country in terms of health, self-esteem, teamwork and social skills.",
    "The bid leadership team has been in close contact with officials across all levels of government to discuss the commercial and cultural value of bringing one of the world’s largest sporting events to US soil for the first time.”\nThere is a rugby fan in the White House.",
    "I am proud to support the US bids to host the men’s and women’s Rugby World Cup tournaments.”\nSean Casten, an Illinois Democrat, and two Republicans, Richard Hudson from North Carolina and Paul Gosar from Arizona, also co-sponsored the measure.",
    "US hopes of hosting men’s and women’s Rugby World Cups in 2029 and 2031 got a boost from Capitol Hill on Thursday, with the introduction of a bipartisan congressional resolution expressing support for the bid.",
    "The resolution was introduced by the co-chairs of the Congressional Rugby Caucus, Alex Mooney, a West Virginia Republican, and Eleanor Holmes Norton, a Democrat from Washington DC.",
    "He said: “The huge attraction of a World Cup coming here is rugby really starting to unlock, or using this 10-year pathway to unlock, the biggest media market in the world.",
    "They’re not going to announce anyone else.”\nRussia also launched a bid – before the invasion of Ukraine and the political, business and sporting pariah status it brought.",
    "Some around the world saw a Test between the US Eagles and New Zealand in Maryland last October – won 104-14 by the All Blacks – as a reversal for the US World Cup bid.",
    "In December, USA Rugby chief executive Ross Young told the Guardian: “We’ll either be awarded the World Cup in ’31 in May, or they’ll go back to the drawing board.",
    "In November, however, Biden both wished Ireland’s men luck before their game against the All Blacks in Dublin and celebrated the stirring victory which followed.",
    "It also pledges that Congress will give full consideration to legislative proposals or other requests to support preparations for these important events”.",
    "Biden has said he played at law school, and spoken of following an All Blacks tour in Ireland when he was a young senator.",
    "The US will compete at the next women’s event, in New Zealand this October, a tournament delayed by the Covid pandemic.",
    "England is World Rugby’s preferred host for the women’s tournament in 2025 while the US is in exclusive talks for 2029.",
    "The administration has not responded to Guardian requests for comment about the president’s playing and touring days.",
    "The governing body also said: “Co-ordination across local, state and federal government agencies is … ongoing.",
    "Australia has preferred candidate status for 2027 while the US is in “exclusive targeted dialogue” for 2031.",
    "Or unlock the potential for that media market.”\nThe US bid includes NFL and college football stadiums.",
    "The US men’s professional competition, Major League Rugby, is in its fifth season.",
    "He also has a commerce secretary, Gina Raimondo, who played the game at Harvard.",
    "The next men’s Rugby World Cup will be played in France in 2023.",
    "The US will face Chile in a two-legged qualifier this year.",
    "Young disagreed."
  ]
}