{
  "id": 12890,
  "mediaId": 2540,
  "date": "2022-02-28",
  "headline": "5 things to know for Feb. 28: Ukraine, EPA, Covid-19, State of the Union, North Korea",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220228042104-apc-ukraine-02272022-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/28/us/five-things-february-28-trnd/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexandra Meeks",
  "authorUrl": "",
  "termIds": [
    5891,
    3702,
    4039,
    2377,
    300,
    5949,
    6459,
    6569,
    6672
  ],
  "sentences": [
    "North Korea launched a ballistic missile off the east coast of the Korean Peninsula yesterday -- an \"undesirable\" move for peace stabilization while the world is trying to resolve the Ukraine war, South Korea's National Security Council said in a statement.",
    "Meanwhile, Western sanctions are beginning to take effect, with the Russian Central Bank announcing it would raise its key interest rate from 9.5% to 20% because \"external conditions for the Russian economy have drastically changed.\"",
    "Observers say the outcome of this case is tough to predict, but a ruling that would shift the authority to regulate greenhouse gas emissions from power plants to Congress would be the worst-case scenario for the EPA.",
    "North Korea has ramped up its missile testing in 2022, announcing plans to bolster its defenses against the United States and evaluate \"restarting all temporally suspended activities,\" according to state media.",
    "A Supreme Court decision siding with coal companies could undercut the Biden administration's plans to slash planet-warming emissions at a time when scientists are sounding the alarm about climate change.",
    "The Environmental Protection Agency faces a Supreme Court case today that could challenge the federal government's ability to fight the climate crisis and prevent its worst outcomes.",
    "Republican Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona received criticism for speaking at the America First Political Action Conference in Orlando, Florida.",
    "Elon Musk activates SpaceX satellite internet service in Ukraine\nUkraine asked Musk to provide internet service to the country amid Russian attacks, and Musk delivered.",
    "-- Republican Sen. Mitt Romney of Utah, blasting his fellow GOP members who attended a White nationalist event and those who support Russian President Vladimir Putin.",
    "The launch is North Korea's eighth test this year and comes nearly a month after Pyongyang fired what it claimed was its longest range ballistic missile since 2017.",
    "Blake Lively and Ryan Reynolds pledge to match donations for Ukrainian refugees up to $1 million\nWe now have another reason to admire this amazing power couple.",
    "Monoclonal treatments serve as a different avenue for protection and are popular among immunocompromised people who cannot be vaccinated for medical reasons.",
    "People who have received a dose of Evusheld, the monoclonal antibody drug against Covid-19, should get an additional dose as soon as possible, the FDA says.",
    "The event was organized by White supremacist Nick Fuentes, who has been banned from most major social media platforms for his White nationalist rhetoric.",
    "It's also an option for individuals who have been advised not to get a vaccine because of a severe reaction to a Covid-19 vaccine or its components.",
    "Google is the latest platform to ban the outlets from running ads on their content, following similar decisions by YouTube and Meta in recent days.",
    "Russian and Ukrainian delegations are meeting for talks today on the Ukraine-Belarus border as Moscow continues to ramp up its assault on Kyiv.",
    "(CNN)Big tech companies are clamping down on Russian state media outlets by cutting off their ad revenue during the ongoing crisis in Ukraine.",
    "New satellite imagery shows a miles-long convoy of Russian military vehicles bearing down on the Ukrainian capital despite the negotiations.",
    "Russia's currency also hit a record low against the US dollar today as the country's financial system reeled from the crushing sanctions.",
    "Experts say it's going to be difficult to get the word out to everyone who received a dose, and access to the product remains limited.",
    "The speech is a National Special Security Event, according to officials, and the Secret Service has been placed in charge of planning.",
    "This comes just one day after Russian President Vladimir Putin put his deterrence forces, which includes nuclear arms, on high alert.",
    "Capitol Police will once again erect a fence on Capitol grounds ahead of President Joe Biden's State of the Union address tomorrow.",
    "BP, which had called itself \"one of the biggest foreign investors in Russia,\" will lose about $2 billion as a result of the move.",
    "The agency revised the emergency use authorization because the drug may be less active against certain Omicron subvariants.",
    "The fencing is an effort to heighten security and prepare for possible protests by big rig truckers in the coming days.",
    "\"The Batman\" hits theaters Friday\nLadies and gentlemen... Robert Pattinson is Batman and Zoë Kravitz is Catwoman.",
    "Outside law enforcement agencies as well as the National Guard have been brought in to assist during the event.",
    "Republicans are expected to argue that the EPA has no authority to regulate emissions from the power sector.",
    "The British company said yesterday it is dumping that stake in response to Russia's invasion of Ukraine.",
    "Why not kick off your Monday with warm coffee and toast this morning -- and learn how bread is made.",
    "\"Look, there is no place in either political party for this White nationalism or racism.",
    "That's the size of the stake that BP holds in Rosneft, Russia's state-owned oil giant.",
    "(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily.",
    "If you're searching for a top-tier TV series or movie to watch, look no further.",
    "The revision of the emergency use authorization presents challenges, though.",
    "Here are the winners of the year's best television and film performances.",
    "Here's what you need to know to Get Up to Speed and On with Your Day.",
    "Let's talk about \"Euphoria\" and that second-season finale\nWarning!",
    "Spoiler alerts -- and a double dose of teen drama -- are this way.",
    "Follow CNN's full coverage of Russia's attack on Ukraine here.",
    "Instead, they say that authority should be given to Congress.",
    "You can watch the State of the Union address on CNN at 9 p.m.",
    "A toast to better days ahead\nRyes and shine.",
    "It's simply wrong ... it's evil as well.\"",
    "ET tomorrow or stream it live here.",
    "(Click here to view)",
    "Sign up here.)",
    "Intrigued?"
  ]
}