{
  "id": 12944,
  "mediaId": 8387,
  "date": "2022-03-03",
  "headline": "Matt Salmon blasts Wendy Rogers as unfit to serve. Where you been, Matt?",
  "image": "https://www.gannett-cdn.com/presto/2022/01/16/PPHX/639ac325-2486-4688-b1f8-a5be8dd84edc-Trump_in_Florence_Drop_4_031.JPG?crop=983,553,x0,y56&width=983&height=553&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/03/03/matt-salmon-blasts-wendy-rogers-unfit-serve-finally/9367486002/",
  "mediaOutlet": "Northwest Valley Republic: Local news headlines for Surprise, Anthem, Sun City, Sun City West and Youngtown Arizona - azcentral.",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    2756,
    2706,
    4312,
    5292,
    5315,
    3471,
    1489,
    1126,
    5949
  ],
  "sentences": [
    "Salmon called on state Sen. Wendy Rogers to resign, saying her “dismissive response” of the Senate’s censure earlier this week “indicates a level of misjudgment and a failure of character so outrageous that more stringent action is needed.”\nHe was referring to her, well, let’s just call it her less-than-chastened response to the Senate’s public slap on the wrist earlier this week after her speech to white nationalists on Friday and her threats to ruin the careers of any of her colleagues who challenged her.",
    "Rogers has used antisemitic tropes before\nIt’s no surprise that Rogers would revere Joe McCarthy, the 1950s era witch hunter who ruined thousands of lives with unproven accusations that they were communists or that she would long for McCarthysim, which is defined as “a campaign or practice that endorses the use of unfair allegations and investigations.”\nShe has spent most of the last 16 months screaming, without evidence, that the 2020 presidential election was stolen.",
    "She spent more than a million dollars to win her seat by running a slash-and-burn campaign against then-Sen. Sylvia Allen, charging that one of the most conservative members of the Legislature was “not conservative enough.”\nRogers’ campaign was so obnoxious that her now-seatmate, state Rep. Walter Blackman, a staunch conservative from Snowflake, told the Arizona Capitol Times after the primary election that he would not campaign with her.",
    "\"At times like this, I believe that it requires someone seeking high office to make use of their voice and platform to say what is necessary: Sen. Rogers must resign her seat in the legislature for the greater good of Arizona and so that LD6 can be effectively represented on issues of public policy, which her ongoing conduct and associations make her incapable of doing,\" Salmon said on Thursday.",
    "She’s more likely to send out yet another fundraising plea saying the RINOs like Salmon (a hard-core conservative) are out to get a “sweet grandma who loves Jesus and America.”\nBut it’s nice to know there are a few Republicans possessing of some starch in their spines, even if it is newly applied stiffener.",
    "“Integrity,” he said, “is a big deal.”\nSince coming to the Legislature, Rogers has distinguished herself as easily the kookiest legislator ever elected in Arizona, one who will pretty much say anything to get noticed and gain traction on the steep and often slimy political slope.",
    "“Given the uptick of antisemitism and extremism in our state, and across the country, Rogers’ use of thinly-veiled hate speech is dangerous and has no place in the rhetoric of Arizona’s elected officials,” the council’s executive director, Paul Rockower, said at the time.",
    "Doesn’t matter that even the Senate’s Trump-friendly auditors have acknowledged they found no evidence of widespread fraud or that decertification isn’t actually a thing or that here in America you need actual evidence in order to throw someone in jail.",
    "Last summer, she was called out by the Jewish Community Relations Council of Greater Phoenix, which said it was “deeply concerned with Sen. Rogers’ use of extremist terms that have inspired some of the worst atrocities in recent history.",
    "If Rogers is out of line for speaking at Fuentes’ America First Political Action Committee last week, what about Gosar, who recorded a message for Friday's gathering and delivered the keynote address at last year’s conference?",
    "Genesis 12:3”\nFuentes is the flamboyantly racist, misogynistic and antisemitic head of the white nationalist America First movement – a guy who checks nearly every mark on the list of vile characteristics.",
    "It’s refreshing that a Republican candidate for governor would call out one of the MAGA’s biggest rock stars – and it certainly doesn’t hurt that his opponent Kari Lake is one Rogers’ big admirers.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "It also would be nice to hear from Karrin Taylor Robson, who last summer pronounced herself “proud” to support Rogers, whose election allowed Republicans to maintain control of the state Senate.",
    "And from Lake, who has been endorsed by Rogers, but who unlike Rogers had the good sense to avoid the America First conference, despite being initially announced as a featured speaker.",
    "She spent a decade trying to convince voters to send her to Congress, going so far as to baselessly accuse a Republican rival of having ties to a sex-trafficking ring in 2018.",
    "Doug Ducey, who despite all his condemnation of antisemitism this week still apparently is happy to have spent nearly $500,000 from his PAC to get Rogers elected.",
    "Far right Republican candidates across the nation now seek the endorsement of this one-note politician whose only musical instrument is the dog whistle.",
    "And you, Sen. Kelly Townsend, who on Thursday called out Rogers after she refused to denounce antisemitic diatribes by white nationalist Nick Fuentes.",
    "Opinion: Credit to Republican gubernatorial candidate Matt Salmon for calling on Sen. Wendy Rogers to resign due to her 'failure of character'.",
    "She tosses out antisemitic tropes – including the “they are coming to replace us” warnings so popular with white supremacists – with abandon.",
    "She was calling for Arizona’s election to be decertified even before the audit was complete and for elections officials to be thrown in jail.",
    "When that didn’t work, she moved from Tempe to a trailer in Flagstaff in 2020, hoping the Legislature would be a springboard to Congress.",
    "By their silence, they have allowed an ugliness to creep in from the fringes, further and further into the once-Grand Old Party.",
    "Stilll, credit to Townsend and to Salmon for waking up and saying what so many of his fellow Republicans have refused to say.",
    "Heaven forbid, for Ducey to have found himself find with a deadlocked Senate and actually to have to deal with Democrats.",
    "Rogers' character has long been on display\nRogers’ “failure of character” has been on public display for years.",
    "Anyone who disagrees with her is either in cahoots with George Soros or a communist or a traitor.",
    "I do not wish to accept financial donations that she solicited & will respectfully return them.",
    "“She’s still better than her opponent Felicia French,” Ducey told reporters last week.",
    "Matt Salmon just borrowed Kari Lake’s sledgehammer to take aim at one of Lake’s pals.",
    "“I emphatically reject @WendyRogersAZ endorsement of my campaign for Congress.",
    "I continue to call on her to end her support of an open antisemite.",
    "There is a a political career to be built and she is building it.",
    "A creeper for whom Rogers has repeatedly expressed admiration.",
    "Where are the condemnations for this man who sits in Congress?",
    "Support local journalism: Subscribe to azcentral.com today.",
    "A guy, by the way, who Rep. Paul Gosar calls a friend.",
    "There is money to be made and she is making it.",
    "Why aren't they also condemning Gosar?",
    "Still, credit them for speaking up.",
    "But where have you been, Matt?",
    "But, Matt, where’ve you been?",
    "She won’t resign, of course.",
    "Where were you then, Matt?",
    "Or possibly all three.",
    "And from Gov.",
    "Will others?"
  ]
}