{
  "id": 12958,
  "mediaId": 2643,
  "date": "2022-03-01",
  "headline": "GOP Senators Censure Colleague for Speaking at White Nationalist Conference",
  "image": "",
  "link": "https://www.newsweek.com/gop-senators-censure-colleague-speaking-white-nationalist-conference-1683907",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Villarreal",
  "authorUrl": "https://www.newsweek.com/authors/daniel-villarreal",
  "termIds": [
    2240,
    2443,
    4039,
    3019,
    1489,
    392,
    1126,
    1477,
    6678,
    5949
  ],
  "sentences": [
    "In a weekend post, Rogers wrote that Ukrainian President Volodymyr Zelensky \"is a globalist puppet for [Jewish billionaire donor George] Soros and the Clintons,\" referring to former President Bill Clinton and former presidential candidate and Secretary of State Hillary Clinton.",
    "Rogers has made headlines for social media posts pushing antisemitic conspiracy theories and supporting former President Donald Trump's baseless claims that the 2020 election was stolen from him through an unprecedented nationwide conspiracy of voter fraud.",
    "\"I do not apologize, I will not back down and I am sorely disappointed in the leadership of this body for colluding with the Democrats to attempt to destroy my reputation,\" Rogers wrote via Twitter.",
    "He has spoken favorably of Adolf Hitler, believes people of color are conducting a \"white genocide\" and has been banned from most social media platforms for violating their hate speech policies.",
    "Rogers' censure follows rebukes by national Republican leaders against U.S. GOP Representatives Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona who also spoke at the conference.",
    "Republican Arizona state senators voted to censure fellow GOP Senator Wendy Rogers for speaking at the America First Political Action Conference, an event organized by a white nationalist.",
    "\"What I need as a governor is governing majorities so that I can pass dollars into our social safety net so we can provide programs...that will help children from all over our state.",
    "The morning before the vote, Rogers wrote via Twitter, \"So today is the day where we find out if the Communists in the GOP throw the sweet grandma under the bus for being white.\"",
    "In late February, Arizona's Republican Governor Doug Ducey said he preferred Rogers, even with her white nationalist sentiments, over having a Democrat in the state Senate.",
    "\"In the end, I rejoice in knowing I do and say what is right and I speak as a free American regardless of the actions of this corrupted process today.\"",
    "In her speech at the conference, Rogers called for gallows to be built to hang \"high-level criminals\" and \"traitors who have betrayed our country.\"",
    "In response to Rogers' posts, Republican Senate President Karen Fann said, \"We do support First Amendment freedom of speech.",
    "She also expressed respect for the conference's organizer, Nick Fuentes, calling him \"the most persecuted man in America.\"",
    "Fuentes is a right-wing media figure whom the Anti-Defamation League (ADL) has labeled a white supremacist.",
    "After the vote, Rogers said that she considered the censure vote as an attack on her freedom of speech.",
    "The fact that we can pass budgets that will put 8.67 billion additional dollars into K-12 education.",
    "All of the chamber's Democrats and most of its Republicans voted in support of her censure.",
    "On Tuesday, the Arizona Senate voted to censure Rogers by a vote of 24 to three.",
    "\"But what we do not condone is members threatening each other,\" Fann continued.",
    "So that's what I wanted to do, is move my agenda forward,\" Ducey said.",
    "Rogers herself was one of the three Republicans who voted against it.",
    "\"Globalist\" is a word often used by antisemites to disparage Jews.",
    "\"And [Rogers] is still better than her opponent Felicia French.\"",
    "\"I'm proud of what we've been able to accomplish,\" he added.",
    "We fight battles over it,\" the Associated Press reported.",
    "Newsweek contacted Rogers' office for comment.",
    "We don't do that to each other.\"",
    "We absolutely support it.",
    "To call us communists.",
    "\"To ruin each other.",
    "To incite violence."
  ]
}