{
  "id": 13031,
  "mediaId": 2748,
  "date": "2022-03-01",
  "headline": "Marjorie Taylor Greene downplays speaking at a conference founded by white nationalist",
  "image": "https://www.cracknewz.com/favicon.ico",
  "link": "https://www.cracknewz.com/2022/03/marjorie-taylor-greene-downplays.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Blarp Blog",
  "authorUrl": "",
  "termIds": [
    2895,
    1477,
    6488,
    6175
  ],
  "sentences": [
    "Greene, who was in Orlando, Florida, to attend and speak at the Conservative Political Action Conference (CPAC), was also a surprise guest miles away at the America First Political Action Conference (AFPAC).",
    "Congresswoman Marjorie Taylor Greene of Georgia on Sunday downplayed her attendance and speaking slot at a fringe right-wing conference with ties to white nationalists earlier this weekend.",
    "Video of the conference on Saturday showed Fuentes and attendees cheering for Russian President Vladimir Putin, as well as approving of comparisons between Putin and Adolf Hitler.",
    "Video of the conference on Saturday showed Fuentes and attendees cheering for Russian President Vladimir Putin, as well as approving of comparisons between Putin and Adolf Hitler.",
    "Former Congressman Steve King of Iowa, who was taken off the U.S. House committees for racist remarks, also spoke at this year's conference.",
    "Congressman Paul Gosar of Arizona spoke at the same event in 2021 and sent in a pre-record 30-second clip to AFPAC this year.",
    "She first told CBS News that she didn't know who the organizers of the event were and their views.",
    "That event was organized by Nick Fuentes, a white nationalist who started the event in 2020.",
    "Fuentes also called the attack on the U.S. Captiol on January 6 \"awesome.",
    "Fuentes also called the attack on the U.S. Captiol on January 6 \"awesome.",
    "Fuentes attended the \"Unite the Right\" rally in Charlottesville in 2017.",
    "Idaho Lieutenant Governor Janice McGeachin also attended.'"
  ]
}