{
  "id": 13061,
  "mediaId": 2595,
  "date": "2022-02-27",
  "headline": "Romney Calls Reps MTG & Gosar “Morons,” Praises Biden, Trashes DJT",
  "image": "https://www.independentsentinel.com/wp-content/uploads/2019/10/romney-1.jpg",
  "link": "https://www.independentsentinel.com/romney-calls-reps-mtg-gosar-morons-praises-biden-trashes-djt/",
  "mediaOutlet": "independentsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "M Dowling",
  "authorUrl": "https://www.independentsentinel.com/author/freebird/",
  "termIds": [
    2443,
    2187,
    2765,
    4905,
    5583,
    164,
    6678
  ],
  "sentences": [
    "'” pic.twitter.com/c7BOtff0kQ\n— Justin Baragona (@justinbaragona) February 27, 2022\nRomney, a BLM marcher:\nBlack Lives Matter chant in DC:\n“Israel we know you — you murder children, too!”\nI wonder if all the GOP senators (@MittRomney & @SenatorBraun) and corporations who support and endorse BLM also support the idea that Israel “murders children?”\n— Benny (@bennyjohnson) July 2, 2020",
    "It’s ironic hearing him say these things when he was marching with the violent, communist organization Black Lives Matter, even as they were burning buildings down, and demanding Americans defund the police.",
    "Romney was interviewed by CNN’s Dana Bash and used the time to blast Margorie Taylor Greene (MTG) for speaking at the AFPAC summit — video below.",
    "I’m reminded of the old line from the Butch Cassidy and Sundance Kid movie where one character says, ‘Morons, I have morons on my team.",
    "I’m reminded of the old line from the Butch Cassidy and Sundance Kid movie where one character says, ‘Morons, I have morons on my team.",
    "Watch:\nMitt Romney rebukes MTG attending white supremacist event:\n“Marjorie Taylor Greene and Paul Gosar, I don’t know them.",
    "'”\nHe likes to give Democrats talking points and he did during this interview and one he gave to the far-Left the Atlantic.",
    "Romney also portrayed Trump as the authoritarian, even as Biden mandates Americans out of their Bill of Rights.",
    "He used the opportunity to blame Donald Trump for Ukraine and to praise colossally inept Joe Biden.",
    "Romney said Marjorie Taylor Greene is “missing a few IQ points” for having spoken at the event.",
    "Romney has been blaming Donald Trump, America First, and conservatives for years now.",
    "He trashed some of his party members as “fringe” because they don’t agree with him.",
    "“Marjorie Taylor Greene and Paul Gosar, I don’t know them.",
    "He’s a globalist."
  ]
}