{
  "id": 1309,
  "mediaId": 2580,
  "date": "2022-02-16",
  "headline": "AOC: Democrats ‘have too few stones’ and GOP loves to hate her",
  "image": "https://www.gopusa.com/wp-content/uploads/2021/12/aoc_hands.jpg",
  "link": "https://www.gopusa.com/aoc-democrats-have-too-few-stones-and-gop-loves-to-hate-her/",
  "mediaOutlet": "GOPUSA ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "GOPUSA",
  "authorUrl": "",
  "termIds": [
    3049,
    3260,
    392,
    1126
  ],
  "sentences": [
    "I think it’s a larger question of conditions and circumstance.”\nAOC also spoke frankly about how she balances her idealism — the “big, beautiful Nobel Prize-winning” stuff like fighting for action on climate change — with the in-the-trenches work of negotiating legislation and strategy with a Congress that is overwhelmingly older and more pragmatic.",
    "For example, she admits that some on the progressive left cringed at her appearance at the 2021 Met Gala in a figure-hugging dress emblazoned with the slogan “Tax the Rich.”\nBut she insists that attention-grabbing stunts give her a stronger platform to fight for her base among working people.",
    "“Sometimes you just need to have that moment.”\nAOC has said she feels uncomfortable with some of her “creepy” older male colleagues like Rep. Paul Gosar (R-Ariz.), who posted an anime fantasy video depicting him killing her.",
    "Rep. Alexandria Ocasio-Cortez (D-N.Y.) gave a candid assessment of her growing power inside the Democratic Party and her increasing role as a lightning rod in the national culture wars in a new interview with the New Yorker.",
    "“I wish our party was capable of truly supporting bold leadership that can address root causes.”\nThe 32-year-old Bronx native said she’s everything that a Republican Party dominated by older white men loves to hate.",
    "The progressive firebrand mixed plainspoken observations about her role in American political culture to diplomatic understatements about potential clashes on the horizon with fellow Democrats and Republicans alike.",
    "Ocasio-Cortez refused to take the bait when it comes to the futures of President Biden, House Speaker Nancy Pelosi or Democrats’ aging leadership team in Congress.",
    "Ocasio-Cortez frankly admitted that her role as a political pop cultural figure can drive reactions to her from both the right and left.",
    "I’m the red meat for their base.”\nAOC’s wide-ranging interview with New Yorker editor David Remnick went live on Monday.",
    "“I believe that, at the end of the day, there’s going to be a generational change in our leadership,” AOC said.",
    "And Republicans hate her because she’s a young and outspoken woman of color with social media star power.",
    "This content is published through a licensing agreement with Acquire Media using its NewsEdge technology.",
    "“I ate s— when I was a waitress and a bartender, and I eat s— as a member of Congress.",
    "“Sometimes you just need to give a little Bronx jeer to the rich and to the spectacle.",
    "AOC says Democrats don’t always have the cojones to fight for what’s right.",
    "I’m young, I’m a woman, I’m a woman of color,” she said.",
    "“I wish the Democratic Party had more stones,” AOC said.",
    "“The day-to-day of my day job is frustrating.",
    "Distributed by Tribune Content Agency, LLC.",
    "You need to puncture the façade,” she said.",
    "Now, when that particular moment happens?",
    "“There’s just some surface-level stuff….",
    "So is everyone else’s,” she said.",
    "“I’m everything that they need.",
    "“That is just a simple fact.",
    "It’s called a job, you know?",
    "©2022 New York Daily News.",
    "Visit nydailynews.com."
  ]
}