{
  "id": 13095,
  "mediaId": 2672,
  "date": "2022-02-27",
  "headline": "‘I Have Morons on My Team’: Romney Takes on Gosar, Marjorie Taylor Greene Over White Nationalist Ties",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/02/Romney.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/romney-taylor-greene-gosar-afpac-iq-1313352/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Wade",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“But I’m reminded of the old line from Butch Cassidy where one character says, ‘Morons, I have morons on my team.’ I think anybody who would sit down with white nationalists at their conference is missing a few IQ points.”\nSen. Mitt Romney reacts to his now-prescient 2012 statement that Russia was and continues to be a major geopolitical foe of the US: https://t.co/S6ESuaj46b #CNNSOTU pic.twitter.com/nzx7FEnMBN\n— State of the Union (@CNNSotu) February 27, 2022\nRomney later added, “How anybody in this country, which loves freedom, can side with Vladimir Putin, which is an oppressor, a dictator — he kills people.",
    "Even Ronna McDaniel, chair of the Republican National Committee, condemned — albeit indirectly — Greene’s AFPAC appearance, telling The Washington Post’s Josh Dawsey, “White supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.”\nWhen confronted at CPAC about her AFPAC appearance, Greene implausibly claimed she was ignorant of the repulsive views.",
    "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\nIn the video of his speech introducing Greene, Fuentes — who has been labeled a “white supremacist” by the Anti-Defamation League — said, “And now they’re going on about Russia, and ‘Vladimir Putin is Hitler’ — and they say that’s not a good thing… Can we get a round of applause for Russia?",
    "“All Americans should renounce this garbage and reject the Putin wing of the GOP now.”\nAs Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "Two prominent Republicans, Sen. Mitt Romney and Rep. Liz Cheney, are calling out members of their own party for speaking at America First Political Action Conference (AFPAC), a white nationalist answer to the Conservative Political Action Conference (CPAC).",
    "“As Rep. Marjorie Taylor Greene and Rep. Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,” Cheney wrote.",
    "It’s almost treasonous.”\nCheney expressed her displeasure in a tweet accompanied by a video of Nick Fuentes praising Hitler on the same stage from which Greene addressed the crowd.",
    "“[Reps.] Marjorie Taylor Greene and [Paul] Gosar, I don’t know them,” Romney said on CNN’s State of the Union Sunday.",
    "Yes!”\nGosar made an AFPAC appearance as well, speaking to the crowd via a pre-recorded video.",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now.",
    "He has been an adversary of America at every chance he’s had.",
    "He imprisons his political opponents.",
    "It’s unthinkable to me."
  ]
}