{
  "id": 13115,
  "mediaId": 2702,
  "date": "2022-03-02",
  "headline": "The Hill’s Morning Report – Biden goes after Putin, stresses unity",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/newsletter-open_030222ap.jpg?w=1280",
  "link": "https://thehill.com/homenews/morning-report/596471-the-hills-morning-report/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The House Democrat added that the address included “a lot of solid remarks but not exceptional.”\nA second House Democrat gave the president high marks for his Ukraine remarks and his four-point call for bipartisanship at the end but said that the middle of his speech, which included the meat and potatoes of his domestic plans, was “weaker.”\nThe Hill: Biden pushes clean energy tax credits amid stalled spending agenda.",
    "The agency, responding to supply concerns and oil prices exceeding $100 a barrel, said the aim was to send “a unified and strong message to global oil markets that there will be no shortfall as a result of Russia’s invasion of Ukraine.”\nThe IEA said that the release was the fourth in its history and would provide the equivalent of 2 million barrels a day, or about 2 percent of global consumption, for 30 days.",
    "We will focus instead on what the American people are concerned about: inflation, energy, defense, the border and crime.”\nPreviously, McConnell told reporters that the Senate GOP would not be releasing an agenda before the midterm elections, instead keeping the attention on the troubles facing Biden and Democrats, who are seeing their hopes of maintaining their grip on Congress dwindle.",
    "The president also used the opportunity to pinball his way from topic to topic, including his administration’s handling of the COVID-19 pandemic, the economy, infrastructure and inflation in an attempt to hit back at an onslaught of GOP criticism, especially over rising prices, by touting the 6.5 million in jobs gains last year.",
    "> Congress & Ukraine: Senators during a Tuesday committee hearing debated whether U.S. intelligence forces should be sent into Ukraine to provide more direct covert assistance to the Ukrainian military, including potentially on-the-ground operatives to help stop a Russian military column near Kyiv (The New York Times).",
    "Biden spoke early Tuesday with Ukrainian President Volodymyr Zelensky, who continued pleading with the United States and European allies to bolster Ukraine’s defenses with a no-fly zone to stop the Russian air force, a request by a non-NATO member that has no takers for fear of escalating the conflict with Moscow.",
    "COURTS: The Supreme Court on Tuesday grappled with the convictions of a pair of doctors who were found to have been running opioid “pill mills,” a case where the justices are being asked to find the line between legitimate medical practice and criminal drug distribution that has contributed to a nationwide crisis.",
    "The terms of some sanctions require severing ties, he said, adding, “But even if they don’t have to drop them, to me there is a huge reputational cost right now to working on behalf of Russian interests.”\nApple has stopped selling its products at its Apple Store in Russia, the company confirmed on Tuesday.",
    "On Wednesday evening, a Russian delegation will be ready to resume talks with Ukrainian officials about the war in Ukraine, according to Kremlin spokesman Dmitry Peskov, who told reporters, “our delegation will be in place to await Ukrainian negotiators.” He did not indicate a location.",
    "> GOP infighting: Tensions between Senate Majority Leader Mitch McConnell (R-Ky.) and Sen. Rick Scott (R-Fla.) spilled into public view on Tuesday as the GOP leader batted away a tax proposal by the Florida senator in an unusual airing of grievances between the two top Republicans.",
    "Thirty million barrels will come from the U.S. Strategic Petroleum Reserve, and another 30 million barrels will come from allies in Europe and Asia (Germany, the United Kingdom, Italy, the Netherlands and other major European countries as well as Japan and South Korea) (CNN).",
    ": MLB Commissioner Rob Manfred on Tuesday announced that the first two series of the 2022 season have been canceled after MLB and team owners were unable to strike a deal by Tuesday’s deadline on a collective bargaining agreement and end the MLB-imposed lockout.",
    "The doctors, both sentenced to more than 20 years in prison, are challenging their convictions, arguing that medical professionals should not be tried as drug dealers when they believe they are prescribing medication for a legitimate medical purpose (The Hill).",
    "McConnell and other top Republicans have leveled intense criticisms of Reps. Marjorie Taylor Greene (R-Ga.) and Paul Gosar (R-Ariz.) for speaking at a white nationalist event last week, using the opportunity to pan them for pro-Putin stances in recent years.",
    "As Biden spoke, Ukraine’s military struggled into a seventh day under a Russian bombardment that forced him to devote the initial 20 percent of his speech to condemnations of Putin’s “unprovoked” aggression and praise for the “fearlessness” of Ukrainians.",
    "> Study session: The Centers for Disease Control and Prevention estimated on Tuesday that about 140 million Americans were infected with the COVID-19 through the end of January and that 43 percent of the total population has antibodies for the virus.",
    "Rep. Henry Cuellar (D-Texas) holds a narrow lead over progressive Jessica Cisneros and has, at the very least, clinched a runoff contest in late May, with the possibility of reaching the 50 percent threshold to win the Democratic nomination outright.",
    "… He has no idea what’s coming.”\nAs of this writing on Wednesday, Russia accelerated its push to seize key Ukrainian cities and its military claims to be in control of Kherson, a port city with a strategically important location near the Black Sea.",
    "LEADING THE DAY\nUKRAINE CRISIS: On the sixth day of war between Russia and Ukraine on Tuesday, questions in Washington remained the same: How long can Kyiv and the country’s major cities hold out under increasingly powerful Russian bombardments?",
    "As of Wednesday, a miles-long Russian convoy of reinforcements continued to slowly approach Kyiv’s doorstep following explosions Tuesday that struck official government structures, knocked out a TV tower and left behind civilian casualties.",
    "Such heightened security, which inspired a short-lived TV series in 2016, has been a practice during State of the Union addresses, inaugurations and presidential speeches to joint sessions of Congress (History.com and Constitution Center).",
    "> Capitol COVID: Five Democratic lawmakers tested positive for COVID-19 ahead of Biden’s appearance on Capitol Hill for the State of the Union address, which lawmakers were required to submit a negative test result in order to attend.",
    "McConnell and GOP leaders questioned Scott, who chairs the National Republican Senatorial Committee (NRSC), during a Monday night meeting over his 11-point proposal that has opened the door to a cavalcade of Democratic attacks.",
    "Zelensky, who has barely slept and gave an interview to CNN and Reuters on Tuesday from his undisclosed and guarded bunker, on Wednesday used Facebook to try to rally Ukrainians and those in explosion-rattled Kyiv to fight on.",
    "Biden and many of the lawmakers and attendees in the chamber were unmasked after the Capitol physician deemed face coverings optional following the Centers for Disease Control and Prevention’s change in guidelines last week.",
    "“We will take the most popular aspects from it, slim it down and rebrand it.”\nA rebrand could be necessary for Biden to shepherd any portion of the initial bill through Congress, especially with his low job approval ratings.",
    "Two years ago, he defeated Cisneros by a 3.6-point margin, but since then things have become complicated for Cuellar, whose house was raided by the FBI in late January as part of an ongoing investigation (The Texas Tribune).",
    "“A symbol that people in any country can become the best people on earth at any moment.”\nNATO scheduled an emergency meeting Friday in Brussels of foreign ministers to discuss the crisis and implications for the alliance.",
    "“The next few days, weeks and months will be hard on them.” He assured Americans they will be “OK” despite rising gasoline prices and worries that U.S. forces could be dragged into another international confrontation.",
    "“We’ve reached a new moment in the fight against COVID-19,” Biden declared, noting that Americans are moving “back to more normal routines.”\nThe Hill: Justice Department to name a chief prosecutor for pandemic fraud.",
    "The president signaled that updated guidelines for indoor masks, omicron’s ebb nationwide and access to effective vaccines, tests and treatments mark a turning point, including for schools and workplaces (The Hill).",
    "While recent data indicates nearly 6 million Americans currently live with the disease, some estimates suggest that number could triple by 2060, causing yearly treatment costs in the hundreds of billions of dollars.",
    "Sen. John Cornyn (R-Texas), a top McConnell ally, told Politico that his NRSC position “makes it a little confusing.”\nThe Hill: Biden rejects executive privilege for ex-Trump advisers Michael Flynn, Peter Navarro.",
    "To ensure continuity of government in the event of a calamity, the designated survivor instructed to shelter last evening accompanied by security was Commerce Secretary Gina Raimondo (pictured below) (The Hill).",
    "He and first lady Jill Biden will travel to Superior, Wis., to speak about infrastructure funding and domestic economic priorities during a 2:15 p.m. visit to the University of Wisconsin (Duluth News Tribune).",
    "> Establishment fights back: The Russian invasion of Ukraine is giving fresh momentum to the U.S. foreign policy hawks and the pro-NATO wing of the GOP after years of broadsides from the America First crowd.",
    "“The free world is holding [Putin] responsible” and stands united to aid Ukraine, punish Russia with sanctions and defend “every single inch” of NATO countries against Moscow’s might, the president said.",
    "President Biden used his first State of the Union speech on Tuesday to warn Russian President Vladimir Putin and to reassure Americans worried about inflation, the economy and their future with COVID-19.",
    "Vice President Harris will travel to Durham, N.C., and receive a morning tour of the International Brotherhood of Electrical Workers local 553 apprentice program at Durham Technical Community College.",
    "During an hourlong address, the president asked Congress to unite to send him elements of a domestic agenda he rebranded as “Building a Better America” after a year of struggles to pass any of it.",
    "Kim Reynolds delivered the official GOP rebuttal, knocking the president for what she called “weakness on the world stage,” the troop pullout in Afghanistan in August and the crisis in Ukraine.",
    "The New York Times: Iowa governor uses GOP response to blast Biden over “runaway inflation.”\nThe Hill: Michigan progressive Rep. Rashida Tlaib delivers stinging critique of centrist Democrats.",
    "According to the latest RealClearPolitics average of polls, only 40.6 percent approve of Biden’s job in office, with only 29 percent saying that the U.S. is heading in the right direction.",
    "Tuesday marked the first time MLB games have been canceled as part of a labor dispute since the strike that wiped out the 1994 World Series and the beginning of the 1995 season (ESPN).",
    "Paxton pulled in 42.7 percent of the vote on Tuesday, one of the loudest voices in the GOP to contest Trump’s electoral loss in 2020, followed by Bush with 22.8 percent (The Hill).",
    "“What we’re seeing here is a forcing mechanism,” Benjamin Freeman, a research fellow at the Quincy Institute who focuses on the influence of foreign money, told The New York Times.",
    "Secretary of State Antony Blinken will attend in person, meet with European Union officials, and travel to Moldova and the three Baltic countries of Estonia, Latvia and Lithuania.",
    "The International Energy Agency (IEA) announced that member countries, including the United States, had agreed to release 60 million barrels of oil from their emergency reserves.",
    "As of this writing, the United Nations estimates that at least 677,000 people have fled Ukraine, a country of 44 million people, into neighboring countries (The New York Times).",
    "Some private companies and U.S. legal and lobbying firms rushed to shed associations with Russia, drop contracts, divest holdings tied to Russia and block sales to the country.",
    "If Russia’s oil and gas economic lifeblood is not more assertively blocked by the U.S. and other countries, can Moscow muscle through international sanctions, and for how long?",
    "Will billions of dollars in proposed U.S. assistance to Ukraine, still being debated in Congress, be an empty gesture if the Kremlin controls Ukraine’s government within weeks?",
    "As of this morning, Cuellar leads with exactly 50 percent of the vote to 45.4 percent for Cisneros (26,016 votes to 23,620 votes), with 99 percent of precincts reporting.",
    "“We will not have as part of our agenda a bill that raises taxes on half the American people and sunsets Social Security and Medicare within five years,” McConnell said.",
    "The ritual, which originated during the Cold War but was not publicly acknowledged until 1981, took on a more serious air after 9/11 and again after the Jan. 6 attacks.",
    "The Washington Post: Some lawmakers are proposing $10 billion in U.S. emergency assistance to Ukraine, still being drafted with the aim of passage later this month.",
    "What innovations show the most promise for early detection and treatment for this disease that takes a crushing toll on patients, their loved ones and caregivers?",
    "THE CLOSER\nAnd finally … The Capitol during Biden’s speech was fortified behind temporary fencing and ringed with National Guard troops and police — just in case.",
    "The CDC also estimated that roughly 58 percent of children have previously been infected, with only 23 percent of those over the age of 65 having had the virus.",
    "Scott has maintained that the proposal came in his capacity as a rank-and-file senator rather than his perch atop the NRSC, but some senators did not buy that.",
    "Across the aisle, Texas Attorney General Ken Paxton, the Trump-endorsed candidate, advanced to a runoff against George P. Bush, the state’s land commissioner.",
    "INTERNATIONAL: Pope Francis on Tuesday amended the Vatican’s family leave policy, granting three days of paternity leave to employees who become new fathers.",
    "In addition, former President Trump’s praise of Putin last week has also backfired as lawmakers roundly blame Putin for the situation in Ukraine (The Hill).",
    "While Zelensky continued to work the phones and social media, he also told Russia to stop its bombing in order to conduct cease-fire negotiations (Reuters).",
    "The claim could not immediately be verified and Ukrainian officials said the battle for Kherson continued (The New York Times and The Associated Press).",
    "IN FOCUS/SHARP TAKES\nCORONAVIRUS: Total U.S. coronavirus deaths reported each morning this week: Monday, 948,397; Tuesday, 950,481; Wednesday, 952,509.",
    "DCist: Washington, D.C., Mayor Muriel Bowser (D) says no decision yet to remove mask mandate at schools; lifts directive for students while outdoors.",
    "In total, the domestic section represented a “greatest hits” type of speech that Biden has delivered dating back to his successful presidential bid.",
    "She will speak at 11 a.m. about the administration’s investments in U.S. workers, accompanied by Labor Secretary Marty Walsh, who will also speak.",
    "Cuellar, a nine-term lawmaker, is the highest-ranking moderate remaining in a race that became a proxy battle between centrists and progressives.",
    "House Democrats insist the stalled Build Back Better social spending and climate bill can be reworked for passage before the November elections.",
    "The results came as part of a study of data that was collected from late December to late January and relied on tests of nearly 72,000 samples.",
    "Former National Institutes of Health Director Elias Zerhouni, Alzheimer’s Association’s Maria Carrillo and more join The Hill’s Steve Clemons.",
    "ET, “Breaking New Ground: Innovations in Alzheimer’s Research.” Alzheimer’s disease is currently the sixth-leading cause of death in the U.S.",
    "The company said it also removed Russian state-controlled outlets RT News and Sputnik News from the Apple App Store around the world (CNBC).",
    "The Atlanta Journal-Constitution: Herschel Walker pulls out of event featuring Greene after she spoke at pro-Putin, white nationalist rally.",
    "https://bit.ly/3vsYeOl\nMLB’s owners had every advantage, and still it wasn’t enough for them, by Ken Rosenthal, senior writer, The Athletic.",
    "“The concerns of our fans are at the very top of our consideration list,” Manfred told reporters when announcing the cancellation of games.",
    "SIGN UP NOW\nStay ahead of the news cycle with The Hill’s new Evening Report, featuring the day’s top stories and a look ahead to tomorrow.",
    "Biden previously said his moribund agenda could be carved into “chunks.”\n“That bill is dead,” one House Democrat told the Morning Report.",
    "“That’s why my top priority is getting prices under control.”\nThe Hill: Biden: Inflation “robbing” benefits of strong U.S. economy.",
    "Let’s get this done!” Biden said, promising more details “later” drawn from his once-familiar $2 trillion Build Back Better plan.",
    "https://nyti.ms/3K6dAMM\n“We are going to be OK”: The world according to Biden, by Susan B. Glasser, staff writer, The New Yorker.",
    "The CDC estimated the total of those with antibodies by collecting about 1,750 blood tests at 52 sites roughly every four weeks.",
    "The Wall Street Journal and The Associated Press: The United States will ban Russian flights from American airspace, Biden says.",
    "Satellite broadcaster DirectTV in the U.S. also stopped carrying RT broadcasts “effective immediately” (Hollywood Reporter).",
    "In the past, some leaders in Congress were also instructed to skip the State of the Union as a legislative branch safeguard.",
    "“We are inflicting pain on Russia and supporting the people of Ukraine,” Biden said during his State of the Union address.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "), Suzan DelBene (Wash.), Pete Aguilar (Calif.) and Ted Deutch (Fla.) all revealed their COVID-19 infections on Tuesday.",
    "Previously, the law only provided paid maternity leave of up to six months for expectant mothers (The Associated Press).",
    "The Financial Services Committee hears testimony at 10 a.m. from Federal Reserve Chairman Jerome Powell (The Hill).",
    "Alexander Bolton, The Hill: Sen. Joe Manchin (D-W.Va.) pours water on Biden’s attempt to revive Build Back Better.",
    "The Hill: No matter how Ukraine is governed in the days ahead, the country could face environmental catastrophes.",
    "Reuters: Australian Prime Minister Scott Morrison tests positive for COVID-19, is experiencing flu-like symptoms.",
    "Hill.TV’s “Rising” program features news and interviews at http://thehill.com/hilltv or on YouTube at 10:30 a.m.",
    "Reid Wilson, The Hill: Rising number of families struggle to meet expenses after expiration of child tax credit.",
    "The war has led to the largest migration of refugees seen in Europe in many decades, mostly women and children.",
    "The Hill: Biden announces “test to treat” COVID-19 initiative, free anti-viral treatment after positive test.",
    "The attacks continued on Tuesday with McConnell taking a two-by-four to two of Scott’s proposals (Axios).",
    "All five lawmakers said they were vaccinated, with four noting they had receive booster doses (The Hill).",
    "We get you up to speed on the most important developments in politics and policy, plus trends to watch.",
    "Exxon Mobil said it will exit Russia, leaving $4 billion in oil and gas operations in doubt (Reuters).",
    "The Senate convenes at 11 a.m. and will resume consideration of the Postal Service Reform Act of 2022.",
    "OPINION\nBiden has the right idea, but the wrong words, by Ezra Klein, columnist, The New York Times.",
    "His words brought lawmakers of both parties to their feet in a rare moment of bipartisan applause.",
    "We invite you to share The Hill’s reporting and newsletters, and encourage others to SUBSCRIBE!",
    "*****\nPOLITICS: The contest in Texas’s 28th Congressional District may head into extra innings.",
    "Business Insider: What some past designated survivors did during State of the Union addresses.",
    "Biden’s address was followed by official responses from all corners of the political universe.",
    "The New York Times: How immigration politics drives some Hispanic voters to the GOP in Texas.",
    "Specimens were collected from all 50 states, Washington, D.C., and Puerto Rico (The Hill).",
    "German company DHL said it has stopped making deliveries in Russia and Belarus (AFP).",
    "Apple products were listed as “unavailable” for purchase or delivery in the country.",
    "The two sides last negotiated on Sunday with no breakthrough (The Associated Press).",
    "The percentage of those with antibodies to the virus was lower in older age groups.",
    "The Associated Press: Elizabeth II holds virtual audiences after COVID-19 symptoms.",
    "The law will allow new fathers to be compensated with full pay during that period.",
    "The Hill: Rep. Lauren Boebert (R-Colo.) shocks Democrats with speech interruption.",
    "Partisanship and COVID-19 have also thinned in-person attendance in recent years.",
    "The Morning Report is created by journalists Alexis Simendinger and Al Weaver.",
    "Please recommend the Morning Report to friends and let us know what you think.",
    "The Hill: Biden condemns Putin, projects unity in State of the Union address.",
    "The Hill: Biden calls on Congress to pass the pending China competition bill.",
    "The Texas Tribune: Parties’ activist wings see mixed results in Texas as Gov.",
    "“We are clear-eyed,” Biden added, referring to Ukrainians’ uncertain future.",
    "The Associated Press: Biden in speech vows to check Russia, tame inflation.",
    "What’s the immediate response if Russia strikes out against a NATO country?",
    "There was no immediate word from Ukrainian authorities about their plans.",
    "The Hill: Biden praises Ukrainians as “wall of strength” against Putin.",
    "It is believed the president selects the Cabinet member who is absent.",
    "Brian Kemp (R), former Sen. David Perdue (R-Ga.) sparks GOP concerns.",
    "Global efforts to offset some of the war’s economic impacts continue.",
    "The president will receive the President’s Daily Brief at 9:15 a.m.",
    "“Inflation is robbing them of the gains they might otherwise feel.",
    "The Associated Press: Mexico will not impose sanctions on Russia.",
    "Take our newsletter survey to provide feedback on our offerings.",
    "“Today you, Ukrainians, are a symbol of invincibility,” he said.",
    "https://bit.ly/3Mc9vsp\nWHERE AND WHEN\nThe House meets at 10 a.m.",
    "“That will not be part of the Republican Senate Majority agenda.",
    "Biden described a new U.S. stage in the fight against COVID-19.",
    "INVITATION to The Hill’s Virtually Live event TODAY at 1 p.m.",
    "Readers can find us on Twitter @asimendinger and @alweaver22.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Our forces are not engaged and will not engage,” Biden said.",
    "Greg Abbott (R) advances, progressives fall short of goals.",
    "Email: asimendinger@thehill.com and aweaver@thehill.com.",
    "Sen. Alex Padilla (Calif.) and Reps. Jamie Raskin (Md.",
    "Talks could continue as early as Thursday in New York.",
    "“Putin is now isolated from the world more than ever.",
    "Alexis Simendinger and Al Weaver are the co-creators.",
    "The Hill: Five takeaways from the Texas primaries.",
    "Harris will return to Washington this afternoon.",
    "They will return to the White House tonight.",
    "Runoff elections are scheduled May 24.",
    "Biden asked Congress for $6.4 billion.",
    "Welcome to The Hill’s Morning Report.",
    "The Hill: Clash between Georgia Gov.",
    "TEXT of the president’s speech.",
    "Also, we want to hear from you!",
    "Roku did the same (The Hill).",
    "“What are we waiting for?",
    "We want to hear from you!",
    "ET at Rising on YouTube.",
    "CLICK HERE to subscribe!",
    "I get it,” Biden said.",
    "“Let me be clear.",
    "It is Wednesday!",
    "See all Video",
    "WHAT PASTIME?",
    "ELSEWHERE\n?",
    "RSVP today.",
    "Iowa Gov.",
    "?",
    "?",
    "?"
  ]
}