{
  "id": 13122,
  "mediaId": 2514,
  "date": "2022-03-03",
  "headline": "U.S. House 'staunchly, proudly' passes resolution for Ukraine",
  "image": "https://s.yimg.com/ny/api/res/1.2/bbeZM6T1UPX35zAxbkTgKg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/n43AU2G8JQTGdyKLLpIUxg--~B/aD00MDAwO3c9NjAwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/ad8946c28dfe83828298d8de8cb81602",
  "link": "https://www.aol.com/news/us-house-staunchly-proudly-passes-224555379-093053915.html",
  "mediaOutlet": "AOL",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The resolution approved by the House says it “stands steadfastly, staunchly, proudly and fervently behind the Ukrainian people in their fight against the authoritarian Putin regime.”\nIt calls for an immediate cease-fire and the removal of Russian forces from Ukraine, pledges U.S. support for the Ukrainian resistance and vows to provide “significant additional aid and humanitarian relief to Ukrainian refugees fleeing Russia’s aggression.”\nAmid criticism over his vote, Gosar tweeted: “Talk to me when our border is secure.” Along a similar line, Rosendale has proposed banning aid to Ukraine until the U.S.-Mexico border is secured.",
    "Meeks urged his colleague to provide a unanimous vote to overwhelmingly show “whether or not we stood up and stood out to protect freedom.”\nThe resolve comes after the blue and yellow colors of the Ukraine flag were on view in the House chamber for President Joe Biden’s State of the Union speech Tuesday night, a display of bipartisan common ground for the often divided Congress.",
    "'Enough of the murder, enough of the destruction and carnage'\nGraham said Wednesday that he is introducing a new resolution to hold Putin and those around him accountable for the assault on Ukraine in international courts.",
    "Massie, in tweets citing several concerns with the resolution, said its call for additional and immediate “defensive security assistance” could include American boots on the ground or U.S. enforcement of a no-fly zone.",
    "While resolutions do not carry the force of law, Congress is working quickly to produce a supplemental funding package of at least $6.4 billion of military and humanitarian aid for Ukraine.",
    "In the Senate, Lindsey Graham, R-S.C., was also introducing a resolution that would back Ukraine’s claim in international court that Putin and his “cronies” have committed war crimes.",
    "WASHINGTON (AP) — The House has overwhelmingly approved a resolution “steadfastly, staunchly, proudly and fervently” in support of Ukraine — although three GOP Reps voted against.",
    "Lawmakers warned the war was taking an ominous turn as Russian troops encircled Kyiv and other major Ukraine cities, and citizens took up arms to stop the invasion.",
    "“The camera of history is rolling on all of us today,” Rep. Gregory Meeks, D-N.Y., the chairman of the Foreign Affairs Committee, said during a House floor debate.",
    "Lawmakers said Wednesday that history was watching the way the world responds as Ukrainians fight to save their Western-style democracy from invasion by Russia.",
    "With intensifying urgency, many in Congress said more must be done to help Ukraine and cut off Russian President Vladimir Putin’s ability to wage war.",
    "A former military lawyer, Graham is introducing a measure that would back Ukraine’s claim in international court of war crimes by Putin.",
    "He is joined by Ukraine-born Rep. Victoria Spartz, R-Ind., who has spoken passionately in favor of a U.S. role in saving her country.",
    "Republicans Paul Gosar of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana prevented the vote from being unanimous.",
    "“Enough of the murder, enough of the destruction and carnage,” Graham said Wednesday in a press conference at the Capitol.",
    "Many want Biden to cut off Russian oil exports to the U.S. as a way to clip Putin's economy and deprive him of resources.",
    "Lawmakers of both parties want to send Ukraine more ammunition, anti-aircraft weapons and other military and relief aid.",
    "Congress largely backs Biden’s strategy of economic sanctions against Russia, even as lawmakers push for more.",
    "The Senate unanimously approved a similar measure in support of Ukraine last month.",
    "Graham said of Putin: \"The world has let him get away with too much for too long.\""
  ]
}