{
  "id": 13329,
  "mediaId": 2644,
  "date": "2022-02-28",
  "headline": "‘The View’: Sunny Hostin and Ana Navarro Spar Over Racism In Ukraine Amid Russian Invasion",
  "image": "https://decider.com/wp-content/uploads/2022/02/Sunny-Ana-The-View.jpg?quality=75&strip=all&w=1200",
  "link": "https://decider.com/2022/02/28/the-view-sunny-hostin-ana-navarro-ukraine-argument/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fletcher Peters",
  "authorUrl": "https://decider.com/author/fletcher-peters/",
  "termIds": [
    0
  ],
  "sentences": [
    "The bottom line is: what the people are doing is they’re standing up and helping folks trying to get out.”\nEven though Goldberg successfully averted a big blow-up argument in the first segment, that didn’t stop Hostin from coming for Navarro all over again as The View rounded the corner into their second hot topic.",
    "I think it’s because the Ukraine invites and encourages a lot of Nigerian students and Indian students to come for affordable medical school.”\nHer co-host still wasn’t convinced on the brewing racial tensions at the Ukrainian borders, demanding that war, holistically, is just all bad.",
    "He’s meeting with people, he’s interviewing with them, he’s not saying that’s happening!”\nSuddenly, The View erupted into a chaotic spiral of arguments, with Hostin and Navarro continuing to trade barbs over their respective points as Goldberg attempted to shut them both down.",
    "“One of the reports, though, that’s coming out of the Ukraine that I’ve found particularly upsetting is that there are a lot of African students, Nigerian medical students that are being denied passage out of the country,” Hostin said.",
    "That is, up until Hostin brought up the apparent racism at the border, calling out Ukrainian police for their mistreatment of Nigerian residents, even though Navarro claimed it was a non-issue.",
    "“Unfortunately, a lot of the Ukrainian border guards are sort of letting women and children, and then men, and then the Nigerian students.”\nBut Navarro wasn’t going down without a fight.",
    "“That’s one of the big stories: it’s the level of resistance, the level of defiance, the level of courage shown by the Ukrainians and the people around the world supporting them.",
    "I don’t know what’s true.”\nHostin shot right back: “Well, I spoke to a friend of mine who was on the Polish border working with attorneys and she assured me that it is happening.",
    "As the co-hosts discussed Trumps’ CPAC speech, Hostin slammed Navarro’s wavering allegiance to the Republican Party, targeting her directly while she ranted about conservatives.",
    "While the co-hosts deliberated on Russia’s invasion of Ukraine, most of the ladies agreed that Ukraine was doing a stellar job at coming together in their time of crisis.",
    "After moderator Whoopi Goldberg presented the issue, Joy Behar began by applauding Ukrainians like president Volodymyr Zelenskyy for their commitment to the country.",
    "“The response, to quote Mitt Romney from this weekend when he got asked about Marjorie Taylor Greene and Paul Gosar: ‘I got morons in my party,'” Navarro responded.",
    "The View‘s Sunny Hostin and Ana Navarro have bickered a bit in the past, and the pair saddled up for yet another argument (or two) during today’s panel.",
    "War is chaos.”\nNavarro continued: “Yesterday, it gave me some comfort to see José Andrés, who tweeted out he was there with a Nigerian woman.",
    "She didn’t quite seem to agree with Hostin, though her co-host did pull some receipts with videos and photos of the issue at hand.",
    "If these two can’t get along, what in the world will Sunny Hostin do when controversial guest Michele Tafoya returns tomorrow?",
    "“But listen, Sunny, my point is that war is chaos,” Navarro countered as Hostin attempted to butt in with another argument.",
    "José Andrés, the chef, is at the border right now, feeding people with World Central Kitchen, getting so much support.",
    "After celebrating some of the Ukrainian people, she called them out for racism as folks attempt to flee the country.",
    "He said he had spoken to people from India and Congo, African countries and Jamaica, that that was not happening.",
    "I’ve had to flee my country to the neighboring country, it was Honduras, when we fled Nicaragua.",
    "“The Ukrainians have heart.”\nWhile Hostin agreed at first, she had something else bugging her.",
    "“You’ve got a lot of morons,” Hostin roasted Navarro, earning some laughter from the audience.",
    "“I had seen the same reports, which I thought were troublesome, too,” Navarro acknowledged.",
    "“José Andrés is on the ground — he’s not in a suit, he’s on the ground.",
    "It’s turning, almost, into a David vs. Goliath thing,” Navarro said.",
    "“You’re both right, but there are boneheads on both sides.",
    "“You’re both right!” Goldberg shouted over the bickering.",
    "People are able to get out, and a lot of people are not.",
    "Navarro chimed in right after in total agreement.",
    "There’s plenty of video that it is happening.",
    "Watch the full segment in the video above.",
    "The View airs weekdays on ABC at 11/10c.",
    "So yeah, both things are happening.",
    "“Look: I’ve been a refugee of war.",
    "There are boneheads everywhere!"
  ]
}