{
  "id": 15378,
  "mediaId": 8345,
  "date": "2022-03-10",
  "headline": "Rants and Raves | March 11, 2022",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2020/09/21/KDM-Rants-And-Raves_thumbnail.jpg",
  "link": "https://kdminer.com/news/2022/mar/10/rants-and-raves-march-11-2022/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3787,
    2443,
    1126,
    203,
    6281
  ],
  "sentences": [
    "City of Kingman driveway paving – How about our county supervisors over Kingman areas direct a good portion of the federal monies allotted for COVID to pay for driveway paving recently required by the Kingman City Council.",
    "New York City man rescued twice in two consecutive days – I hope this guy is billed for the costs of his rescues as he is apparently too dumb to learn from his mistakes unless some penalty is attached to his behavior.",
    "U.S. Rep. Paul Gosar (R-Prescott), who represents the Kingman area in Congress, needs to be ejected from the GOP if they are interested in the survival of this country as a democracy.",
    "Maggie Craft letter: Reduce dependence on fossil fuels – America has the largest reserves of coal anywhere and abundant supplies of natural gas and oil.",
    "Cynical protest rant – It’s sad to see folks so full of anger and hate they can’t see the importance of support for those who are suffering!",
    "Also copper, lead, iron, uranium, timber and bauxite, all generously given by God on whom we are founded.",
    "My husband and I eat a complete breakfast with coffee there for less than two cups of coffee at Denny’s.",
    "84 pounds of cocaine seized on I-40 – Happy birthday to Mohave County Sheriff’s Office K9 deputy Grimm!",
    "GOP torn over Gosar, Greene – “With liberty and justice for all,” not just white supremacists.",
    "Republicans don’t need Green and her ilk, just as Dems don’t need Tlaib, Omar and their ilk.",
    "He signed the executive order stopping the pipeline, increasing dependence on Russian fuel.",
    "GOP torn as Green, Gosar speak to far right group – Radicals are hurting both parties.",
    "Submit Rants and Raves at kdminer.com/rants-and-raves or email editorial@kdminer.com.",
    "He was the K-9 deputy who assisted MAGNET with the recent bust of cocaine on I-40.",
    "Gas prices – I bet a lot of people now wish the pipeline from Canada was open.",
    "Burger King, thank you for the senior discount and the 50-cent senior coffee.",
    "They don’t care about World War III because they’re not long for this world.",
    "People believe the rhetoric that spills from his and Jen Psaki’s mouths.",
    "If your rant/rave is about a specific story please mention the headline.",
    "They ran this country into the ground with their greed and entitlement.",
    "White supremacists and socialists/communists are not needed in America.",
    "How else can low-income people pay without a property lien placement?",
    "People worldwide are holding vigils for Ukraine and peace.",
    "We receive many more rants and raves than we can print.",
    "Let us know what’s on your mind in 40 words or less.",
    "Now they want another war which they won’t fight in.",
    "Rants and raves must be original; not plagiarized.",
    "Biden warns “Putin Price Hike” at the pump.",
    "The total resource value is $45 trillion.",
    "Local rants and raves are preferred.",
    "You have to love the baby boomers!",
    "– Put the blame where it belongs.",
    "This is Biden’s price hike.",
    "Incredible."
  ]
}