{
  "id": 15534,
  "mediaId": 8345,
  "date": "2022-03-12",
  "headline": "Rants and Raves | March 13, 2022",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2020/09/21/KDM-Rants-And-Raves_thumbnail.jpg",
  "link": "https://kdminer.com/news/2022/mar/12/rants-and-raves-march-13-2022/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    3787,
    3756,
    3702,
    2443,
    1126
  ],
  "sentences": [
    "Stop buying Chinese goods – We should stop buying Chinese goods for our own good as in bringing production back to America and Buy American as Trump was working out.",
    "Republicans Club to host Kingman mayoral candidate Watkins – Once again the Republican Party is charging a fee for us to hear from our candidates.",
    "Price hikes at the pumps – Anyone notice that the price of gas went up immediately after the president announced sanctions?",
    "Biden warns of Putin price hike at pumps – I am more than happy to pay more for gas to send Putin and his troops packing!",
    "How is it we don’t have world peace after changing the name on pancake boxes, high schools and syrup bottles?",
    "Daniel Wood letter: A couple of questions for Paul Gosar – Daniel Wood wants Gosar to answer a few questions.",
    "Do not support any political activity that charges fees to hear from our candidates or elected officials.",
    "Are Kingman City Council members voting to allow wheeled vehicles (other than wheelchairs) on sidewalks?",
    "Zelenskyy political cartoon - Ukraine President Zelenskyy is someone American politicians should admire.",
    "Paul Gosar and Marjorie Taylor Greene are an embarrassment to the concept of intelligent public service.",
    "If skateboards, etc., are allowed on sidewalks require that they announce their approach to walkers.",
    "Mom and Dad married, Dad provided finances, Mom provided a clean home environment, meals and love?",
    "Why did you call the insurrectionists “patriots?” Patriots works within the law to change laws?",
    "It’s manipulation of prices by companies, and of course, our “friends” (NOT) the Saudis.",
    "Children that age don’t need to be in school; they need to be home with their mother.",
    "Submit Rants and Raves at kdminer.com/rants-and-raves or email editorial@kdminer.com.",
    "Given the facts revealed recently, will you now call these traitors, traitors?",
    "Putin hitting a maternity hospital is a step too far; may he rot in hell.",
    "If your rant/rave is about a specific story please mention the headline.",
    "I’m a walker nearly knocked over by bicyclists racing up behind me.",
    "Democrat running for governor proposes free Pre-K – What bull!",
    "Americans used to be tough when coming up against dictators.",
    "We receive many more rants and raves than we can print.",
    "Let us know what’s on your mind in 40 words or less.",
    "Rants and raves must be original; not plagiarized.",
    "They did not run low on gas that fast!",
    "Local rants and raves are preferred.",
    "The time has come to be tough again!",
    "Here’s a couple more.",
    "Remember those days?",
    "I’m confused again!",
    "Free pre-K?"
  ]
}