{
  "id": 1652,
  "mediaId": 2535,
  "date": "2022-02-12",
  "headline": "Over 14,000 Sign Prayer Pledge for Finnish MP on Trial for Sharing Biblical Views on Marriage, Sexuality",
  "image": "https://media.swncdn.com/via/12410-lgbt-court-gettyimages-adragan.jpg",
  "link": "https://www.christianheadlines.com/contributors/milton-quintanilla/over-14000-sign-prayer-pledge-for-finnish-mp-on-trial-for-sharing-biblical-views-on-marriage-sexuality.html",
  "mediaOutlet": "christianheadlines.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Milton Quintanilla",
  "authorUrl": "https://www.christianheadlines.com/author/milton-quintanilla/",
  "termIds": [
    5805,
    1800,
    490,
    6148,
    6156
  ],
  "sentences": [
    "During closing arguments in the trial on Monday, the Prosecutor General accused the MP of engaging in hate speech for creating the pamphlet, criticizing the leadership of the Finnish Lutheran Church for supporting Pride Month in a tweet and making comments about homosexuality during a 2019 interview on a radio show.",
    "\"These criminal prosecutions raise serious questions regarding the extent of Finland's commitment to protecting freedom of religion for its citizens, as agreed to with its participation in the organization for Security and Cooperation in Europe (OSCE) and other multi-lateral organizations,\" they wrote.",
    "No matter the outcome of your case, may the Lord's peace surround you as you stand upon His promise in Romans 8:28 'that in all things God works for the good of those who love him, who have been called according to his purpose,'\" the letter concluded.",
    "\"I, the undersigned want you to be encouraged that I am praying for you and Bishop Juhana Pohjola as you are being persecuted and attacked for sharing the truth of Scripture regarding God's design for marriage and sexuality,\" the letter states.",
    "According to Alliance Defending Freedom International, during closing arguments, the prosecutor called Räsänen's remarks on homosexuality \"degrading\" and asserted that calling homosexuality sinful can have a \"harmful\" effect.",
    "Räsänen's trial grabbed the attention of six U.S. House Representatives, causing them to send a letter to the U.S. Commission on International Religious Freedom arguing that the trial is a violation of religious freedom.",
    "Lorcan Price of ADF International, who argued for the defense, told the court that \"this prosecution for hate speech has turned into a theological trial of what Christian beliefs can and cannot be expressed in Finland.\"",
    "Nadine Maenza, who received the letter, called on the USCIRF chair to consider adding Finland to the U.S. State Department's Special Watch List for state actors infringing on religious liberty.",
    "Finnish Parliament Member Says She Will Not 'Renounce' Her Views on Sexuality despite Criminal Charges\nPhoto courtesy: ©Getty Images/ADragan\nMilton Quintanilla is a freelance writer.",
    "If committed civil servants like Paivi Räsänen are criminally charged for voicing their deeply held beliefs, it creates a chilling effect for everyone's right to speak freely.\"",
    "On Monday, well-known religious freedom advocate Pastor Andrew Brunson delivered a letter of support to Räsänen outside the courtroom where the closing arguments took place.",
    "Meanwhile, ADF International Executive Director Paul Coleman warned that the possible conviction of the Finnish MP could have a ripple effect across Western civilization.",
    "As reported by The Christian Post, Bishop Juhana Pohjola of the Evangelical Lutheran Mission Diocese of Finland was charged alongside Räsänen for issuing the pamphlet.",
    "\"Your bold stand to live out Acts 5:29 by obeying God rather than man is inspiring to Christians in Finland, the United States, and around the world,\" the letter says.",
    "The case involves Finnish MP Päivi Maria Räsänen, who faces prosecution over a pamphlet she created in 2004 outlining the biblical teachings of marriage and sexuality.",
    "The letter was signed by Reps. Chip Roy (R-TX), Michael Cloud (R-TX), Byron Donalds (R-FL), Paul Gosar (R-AZ), Jody Hice (R-GA) and Doug Lamborn (R-CO).",
    "More than 14,000 people have expressed their support for a Finnish Member of Parliament who is standing trial for speaking on biblical sexuality.",
    "The letter was crafted by the Family Research Council and was signed by 14,341 people who pledged their support through prayer.",
    "\"The Finnish Prosecutor General's decision to bring these charges against Dr. Räsänen creates a culture of fear and censorship.",
    "He is also the co-hosts of the For Your Soul podcast, which seeks to equip the church with biblical truth and sound doctrine.",
    "\"It is incredible this trial is happening in a modern European Country and not in a religious theocracy,\" Price continued.",
    "\"I am praying that the Lord Jesus will give you favor in the courtroom where you are on trial for your faith.",
    "May God open the eyes of those deceived by the culture to the truth of His Word.",
    "\"Freedom of speech is one of the cornerstones of democracy,\" Coleman said.",
    "The verdict in Räsänen's case is expected to be given next month.",
    "If convicted, Räsänen faces up to two years in prison and a fine.",
    "He also argued that \"the Bible cannot overrule Finnish law.\"",
    "Visit his blog Blessed Are The Forgiven."
  ]
}