{
  "id": 17198,
  "mediaId": 8475,
  "date": "2022-03-02",
  "headline": "Some Arizona downwinders who blame illnesses on nuclear testing remain uncompensated",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/03022_Apud-Downwinders2.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/030222_downwinder_compensation/some-arizona-downwinders-who-blame-illnesses-nuclear-testing-remain-uncompensated/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eryka Forquer",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110119",
  "termIds": [
    2443,
    5949,
    6678,
    6431,
    6403,
    6071,
    6281,
    6180
  ],
  "sentences": [
    "“I am an educator, and history will repeat itself unless we stand up and say, ‘This is what happened.’”\nSponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nIn addition to being left out of RECA, some downwinders struggle with establishing their eligibility for compensation, Arizona lawyer George Daranyi said.",
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nIn 1990, nearly 30 years after testing went underground, Congress approved the Radiation Exposure Compensation Act, or RECA, to pay victims of radiation exposure around the world, including members of the military, miners and downwinders.",
    "“Regrettably, the radioactive fallout not only impacted our family but families for hundreds of miles surrounding the test site.”\nLike other “downwinders,” who lived near the test site and developed cancers they attribute to the testing, Bishop and her family faced multiple cancer diagnoses throughout the years.",
    "From 1951 until 1963, 100 nuclear weapons were detonated above ground at the Nevada Test Site, sending radioactive material high into the atmosphere that fell on unsuspecting Americans downwind in Nevada, Arizona and Utah.",
    "“They watched the explosions numerous times and thought it was a patriotic thing that the government was doing, and they were proud to be able to witness it,” said Bishop, who now is a supervisor for Mohave County.",
    "“We were victimized by the government, purposely or accidentally, it doesn’t really matter.”\nHer father, Eddie Pattillo, was born in Kingman in 1939 and remembers being in grade school when the testing began.",
    "“Unfortunately, we were blind for the fact that the radioactive fallout would kill and sicken numerous members of our family,” Bishop said in testimony before the House Judiciary Committee in March 2021.",
    "With encouragement from the government, Americans celebrated the advances of the government as nuclear bombs were detonated above the desert floor at a testing site 65 miles northwest of Las Vegas.",
    "Daranyi said ranchers and people who had vacation homes in other parts of Arizona would be in downwind areas for only a portion of the year, which might make it more difficult to establish a claim.",
    "“I didn’t think that Congress was going to do anything.”\nAlthough Kingman residents aren’t eligible for RECA, Eddie Patillo said he’s thankful for the lawmakers who have advocated for them.",
    "“Everybody just thought those (mushroom) clouds were neat in the sky,” said Pattillo, who received his first cancer diagnosis in 1997 and his second, for colon cancer, in 2014.",
    "KINGMAN – Standing on the front porch of their home south of Las Vegas, Jean Bishop’s family peered up as a mushroom cloud towered in the distance and dust choked the sky.",
    "With RECA set to sunset this year, Daranyi thought retirement was in his future, but if new legislation is passed, he said, he’s going to keep helping downwinders.",
    "Gosar and Rep. Greg Stanton, D-Phoenix, introduced separate legislation last year that would extend and expand RECA to include all of Clark and Mohave counties.",
    "He spends his time working in his backyard garden and adding to the collection of novelties he’s amassed from family members, yard sales and secondhand stores.",
    "Another challenge is establishing evidence of a qualified cancer diagnosis because many hospitals don’t maintain patients’ records long enough.",
    "“We tried to correct it every which way … but, administratively, they don’t want to take ownership of it.”\nRECA is scheduled to expire in July.",
    "Rep. Paul Gosar, R-Prescott, said the exclusion of parts of Mohave County and Clark County, Nevada, was the result of an unintentional mistake.",
    "Under the Atomic Energy Commission and later the Department of Energy, all testing was moved underground at the Nevada Testing Site in 1963.",
    "“It just feels like Mohave County has been forgotten,” said Kim Pattillo of Kingman, which is south of the Colorado River in Mohave County.",
    "“The timeline issue has been the most difficult for many of those folks,” said Daranyi, who has been working with downwinders since 1998.",
    "“The compensation is acknowledgement,” said Kim Patillo, who is principal of Black Mountain Elementary School and Middle School.",
    "“I never let the disability of the illnesses slow me down much, I don’t think, but I have to use a cane now,” Pattillo said.",
    "“Clark County, Nevada, and Mohave County, Arizona, were to be done, but it was an administrative error,” Gosar said.",
    "It was an exciting, awe-inspiring sight, and one that stirred their pride in American power during the Cold War.",
    "However, the southern part of Mohave County, which is just 190 miles south of the testing site, was excluded.",
    "The program later was amended to include downwinders in Apache, Coconino, Gila, Navajo and Yavapai counties.",
    "Since 1963, 828 underground tests have occurred at the site, which now is the Nevada National Security Site.",
    "“I don’t think any amount of money can replace my aunt or the pain that my dad is going through,” she said.",
    "Kim Pattillo said she, her mother and her brother have thyroid issues, and an aunt died of breast cancer.",
    "His treasures include shovels, spurs, bits, a painted washing board and lumberjack saw, and horseshoes.",
    "At last count, Bishop said, 32 members of her husband’s family had died from various types of cancer.",
    "“For the first time in five years, I actually have some optimistic view about that,” Daranyi said.",
    "But for Kim Pattillo, she wants the government to acknowledge the community harm.",
    "Although he said the nuclear testing has impacted his health, he remains active.",
    "The family attributes their illnesses to the Cold War testing in Nevada.",
    "Qualified downwinders were eligible for a one-time payment of $50,000.",
    "But it came at a terrible cost, one that’s still being borne today.",
    "It was “family entertainment,” Bishop said.",
    "- 30 -"
  ]
}