{
  "id": 1762,
  "mediaId": 8344,
  "date": "2022-02-14",
  "headline": "Dems, GOP both hosting fund-raising meals this weekend",
  "image": "https://gilavalleycentral.net/wp-content/uploads/2021/02/Political-Parties.jpg",
  "link": "https://gilavalleycentral.net/dems-gop-both-hosting-fund-raising-meals-this-weekend/?utm_source=rss&utm_medium=rss&utm_campaign=dems-gop-both-hosting-fund-raising-meals-this-weekend",
  "mediaOutlet": "KATO",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Bell",
  "authorUrl": "https://gilavalleycentral.net/author/davidbell/",
  "termIds": [
    0
  ],
  "sentences": [
    "The luncheon will take place from noon to 2 p.m. and the featured guest will be Republican U.S. Rep. Paul Gosar, whose current district includes Prescott and the northwestern quadrant of Arizona.",
    "The Graham County Republican Party takes center stage Presidents’ Day, Monday, Feb. 21, for its annual Lincoln Day Luncheon at the Hoopes Activity Center at Eastern Arizona College.",
    "Things start at 4 p.m. with an open house and tours of the new party headquarters on 5th Avenue, followed by cocktails at 6 p.m. at The Venue.",
    "Dinner at 7 p.m. features a choice of four entrees — steak ranchero, cilantro lime chicken, mango salsa haddock and mushroom enchiladas.",
    "The Graham County Democratic Party will host the Rose Mofford Fund-raising Dinner Saturday, Feb. 19, at The Venue on Main in Safford.",
    "SAFFORD — The political season will get an official kick-off in the Gila Valley with not one, but two events this holiday weekend.",
    "Cost is $100 per person and tickets can be purchased at Graham County Democratic Committee (AZ) — Donate via ActBlue.",
    "The featured guest is Aaron Lieberman, former member of the state Legislature and Democratic candidate for governor.",
    "Both events will also feature candidates for office at the federal, state and local levels.",
    "Tickets are $35 per person and can be purchased by calling 928-651-2520 or 928-215-2118.",
    "comments"
  ]
}