{
  "id": 2029,
  "mediaId": 2625,
  "date": "2022-02-04",
  "headline": "There’s a Big Tent Opposing US Intervention in Ukraine. Tucker Carlson Is Stretching Its Limits.",
  "image": "https://www.motherjones.com/wp-content/uploads/2022/02/0204_ukraine_limits_1.jpg?w=1200&h=630&crop=1",
  "link": "https://www.motherjones.com/politics/2022/02/tucker-carlson-ukraine-russia-invasion-intervention-biden-putin/",
  "mediaOutlet": "Mother Jones",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Spinelli",
  "authorUrl": "https://www.motherjones.com/author/dan-spinelli/",
  "termIds": [
    4905,
    3639,
    3049,
    2945,
    1708,
    2556,
    157,
    6569,
    6672
  ],
  "sentences": [
    "Carlson has spent weeks talking about Ukraine on his show, saying in as early as December that Putin was massing troops near Ukraine “to keep his western borders secure.” He recently said that “no rational person could defend a war with Russia over Ukraine.”\n“For any progressive open to neutrality for Ukraine,” Beinart, a former New Republic editor with a large social-media following, tweeted on Thursday, “it’s unpleasant to share common ground with authoritarian bigots like Hawley + Carlson.”\n“For any progressive open to neutrality for Ukraine, it’s unpleasant to share common ground with authoritarian bigots like Hawley + Carlson.”\nOthers opposing a military intervention were more willing to isolate Carlson’s impact as useful to the movement.",
    "Republican campaign staff working on midterm election races operatives told Axios, “They worry they’ll alienate the base if they push to commit American resources to Ukraine or deploy US troops to eastern Europe.”\nBut it does not appear that either party—or the broader electorate—is in the middle of some grand, dovish reckoning: Even as US voters tired of the wars in Afghanistan and Iraq, polling suggests that Americans are significantly more likely to support using troops against aggressors like Russia and China.",
    "On December 21, Secretary of State Antony Blinken said that it’s Biden’s view that “one country does not have the right to change by force the borders of another; that one country does not have the right to dictate the policies of another or to tell that country with whom it may associate; one country does not have the right to exert a sphere of influence.”\nBeinart, who famously came to regret his early support for the Iraq war, was quick to point out the contradiction embedded in Blinken’s statement.",
    "On Wednesday, when asked about Hawley’s public statement calling on Ukraine to be denied NATO membership, White House Press Secretary Jen Psaki said, “If you are digesting Russian disinformation and parroting Russian talking points, you are not aligned with longstanding, bipartisan American values.” Psaki’s black-and-white statement troubled non-interventionists, including many like Beinart who are sympathetic to the Biden administration.",
    "“The more willing the Biden administration is to admit that it, too, expects a sphere of influence in its corner of the globe, the better able it will be to ensure that Russia’s sphere of influence doesn’t destroy Ukraine or plunge Europe into war.” (In a sign of ideological cross-pollination, Beinart’s piece cited an article co-written by Rajan Menon, who is affiliated with the Koch-backed think tank Defense Priorities.)",
    "After the January 6 insurrection, Rep. Alexandria Ocasio-Cortez (D-N.Y.) shot down a chance to partner with Sen. Ted Cruz (R-Texas) on a financial policy issue by tweeting, “Happy to work w/ almost any other GOP that aren’t trying to get me killed.” Hawley, an instigator of the insurrection, would presumably fit into that category and, notably, most progressives have refrained from chiming in on Ukraine.",
    "“I think liberal restrainers should welcome individuals like Tucker Carlson activating their followers in support of stopping another pointless war—just like Tucker did in regards to the push for a war with Iran in 2019 and 2020,” said Dan Caldwell, vice president of foreign policy at Stand Together, the philanthropic organization founded by conservative megadonor Charles Koch.",
    "Biden has all but made clear that Ukraine is not high on his list of priorities, drawing criticism last month for suggesting that a “minor incursion” by Russia would receive a lighter response—and leading Ukrainian President Volodymyr Zelenskyy to reject the notion of a “minor” invasion in a tweet.",
    "“An effective coalition to move American foreign policy away from primacy cannot be built with a narrow slice of the liberal left and the conservative right that check all the appropriate ideological boxes.”\nOf course, that’s not the easiest position for many progressive Democrats to get behind.",
    "In criticizing the Biden administration’s tough talk, the antiwar coalition has been accused by both Democrats and Republicans of tacitly supporting Russian President Vladimir Putin, the murderous autocrat who meddled in the 2016 election on Donald Trump’s behalf.",
    "“If you are digesting Russian disinformation and parroting Russian talking points, you are not aligned with longstanding, bipartisan American values,” White House Press Secretary Jen Psaki said Wednesday, angering some who oppose sending troops to defend Ukraine.",
    "But at the same time Biden’s team seems reluctant to grant any quarter to Russia’s designs on regional control, which makes sense as diplomatic practice but creates moments where the White House appears to conflate de-escalation with being pro-Russia.",
    "The foreign policy writers and lawmakers who make up the less-crazy part of the coalition are more concerned with whether Ukraine should be part of NATO; the alliance agreed in 2008 that it would be added at some unspecified future date.",
    "At the same time, progressives have found themselves in the uncomfortable position of being on the same side of the debate as Hawley and Fox News’ Tucker Carlson, perhaps the most malignant presence in US politics today.",
    "Tobita Chow, director of Justice is Global, which is affiliated with progressive advocacy group People’s Action, tweeted that it is “very dangerous that Democrats are accusing foreign policy critics of disloyalty.",
    "Since the Biden administration began negotiating with Putin’s representatives, the two sides have been at an impasse over that exact point, with Putin demanding Ukraine be barred from joining.",
    "Only Rep. Ro Khanna (D-Calif.) has echoed Hawley’s view that Ukraine should remain neutral and not a part of NATO, the trans-Atlantic alliance that served to counteract the Soviet Union.",
    "), liberal journalist Peter Beinart, and guerrilla activist group Code Pink, but the looming possibility of a war between the United States and Russia over Ukraine is one of them.",
    "(Biden also has already ruled out sending US troops to Ukraine, and given Germany’s reliance on Russian oil, it’s not clear whether NATO members will agree on sanctions, either.)",
    "Right-wing white nationalists like Rep. Paul Gosar (R-Ariz.) see Ukraine as an irrelevant distraction from, as he put it, “dangerous drugs and violent crime” in his district.",
    "Even when it is someone as vile as Hawley.”\nPerhaps all that can be said about Hawley and certainly Carlson is that they have shifted the debate within their own party.",
    "“It’s a noble principle, just not one the United States abides by,” Beinart wrote in a New York Times op-ed, citing the long history of US meddling in Latin America.",
    "The foreign policy writers and lawmakers who make up the less-crazy part of the coalition are more concerned with whether Ukraine should be part of NATO.",
    "Libertarian Republicans, for example, have long allied with progressive Democrats against the hawkish members of both their parties.",
    "“We’re really going to fight a war over some corrupt Eastern European country that is strategically irrelevant to us?",
    "A staffer for a progressive member of Congress told me “it’s become weirdly taboo” to comment on the Ukraine crisis.",
    "That kind of alliance isn’t all that unusual in debates over the United States’ military-heavy foreign policy.",
    "US officials have made clear that they have no desire to give Putin veto power over who joins NATO.",
    "With everything else that’s going on right now in our own country?” he said last month.",
    "Not all non-interventionists share the same reasons for opposing US escalation.",
    "But the Ukraine crisis is fraught and complicated in new and unusual ways.",
    "Facts matter: Sign up for the free Mother Jones Daily newsletter.",
    "There are not many issues that can unite Sen. Josh Hawley (R-Mo.",
    "That’s in line with what Carlson has said about Ukraine.",
    "Support our nonprofit reporting.",
    "Subscribe to our print magazine."
  ]
}