{
  "id": 2096,
  "mediaId": 2528,
  "date": "2022-02-04",
  "headline": "GOP Rep. Adam Kinzinger said the RNC's vote to censure him and fellow GOP Rep. Liz Cheney shows how 'frigging crazy the Republican Party has become'",
  "image": "https://i.insider.com/61fdaac2bd5041001918e08b?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/adam-kinzinger-rnc-censure-vote-shows-frigging-crazy-gop-become-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lauren Frias",
  "authorUrl": "https://www.businessinsider.com/author/lauren-frias",
  "termIds": [
    0
  ],
  "sentences": [
    "During its winter meeting on Friday, the RNC approved a resolution, which describes the House select committee as a \"Democrat-led persecution of ordinary citizens engaged in legitimate political discourse,\" to censure Kinzinger and Cheney, who are the only two Republicans serving on the panel.",
    "\"The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy,\" Cheney tweeted following the Thursday vote.",
    "GOP Rep. Adam Kinzinger said the Republican National Committee's vote to censure him and Rep. Liz Cheney for serving on the House committee investigating the events of January 6, 2021, shows how \"frigging crazy the Republican Party has become.\"",
    "\"Madison Cawthorn can invoke coming bloodshed, and Paul Gosar can flirt with white nationalism, and they're signing a letter asking to have me kicked out of the caucus,\" Kinzinger told Goldberg.",
    "Kinzinger cited his Republican colleagues who expressed concern over his participation on the majority-Democratic House committee, including Rep. Madison Cawthorn and Rep. Paul Gosar.",
    "In remarks to Jeffrey Goldberg, the editor-in-chief of The Atlantic, ahead of the vote, Kinzinger said he doesn't \"have a tribe,\" but \"the good thing is, I don't really care.\"",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "On Thursday, the RNC's resolutions committee unanimously voted to advance the censure resolution to the entire body, prompting Cheney to skewer members of the committee.",
    "\"I'm a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump,\" she added.",
    "\"The only reason this hurts me is that it reminds me of how frigging crazy the Republican Party has become,\" he said, according to Goldberg.",
    "Drew Angerer/Getty Images\nRep. Adam Kinzinger said the vote to censure him shows \"frigging crazy the Republican Party has become.\"",
    "Republican Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois at a January 6 committee hearing on December 1, 2021.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "The RNC voted to censure him and Rep. Liz Cheney for their participation on the January 6 House committee.",
    "\"They call me a RINO (Republican In Name Only), but I haven't changed,\" Kinzinger added.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "\"The Republican Party has changed into an authoritarian Trump organization.",
    "\"It's not my tribe anymore,\" Kinzinger said in remarks to The Atlantic.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "I will never stop fighting for our constitutional republic.",
    "\"This is how far the Republican Party has fallen.\"",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "\"History will be their judge.",
    "Loading Something is loading.",
    "\"It's not my tribe anymore.\"",
    "They're the RINOs.",
    "Trump is a RINO.\"",
    "No matter what.\""
  ]
}