{
  "id": 2330,
  "mediaId": 2533,
  "date": "2022-02-10",
  "headline": "BREAKING: New Bill Introduced Is Dr. Fauci’s Worst Nightmare",
  "image": "https://www.analyzingamerica.org/wp-content/uploads/2022/02/Screen-Shot-2022-02-09-at-11.36.03-AM.jpg",
  "link": "https://www.chicksonright.com/blog/2022/02/10/breaking-new-bill-introduced-is-dr-faucis-worst-nightmare-5/",
  "mediaOutlet": "chicksontheright.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "To explain his flip-flops, Fauci said, “When you have an evolving situation and data are rapidly evolving in something that is unprecedented and unknown, you have to evolve with it and look at the data as it exists now and make to the best of your ability a decision, a recommendation, all the kinds of things that go into the evolution.”\n“It’s just a fact that Tony Fauci, not the guy I’m talking with but Tony Fauci- the person in people’s minds, is now an impediment to public health because people won’t listen to you,” Hewitt said.",
    "Here’s the new bill:\nHuge thanks to @RepGosar for his leadership in taking the Public Health Protection Pledge to Congress and holding Dr. Fauci accountable for his incompetence and deception — make sure to tag your congressman, and tell him to sign on as a cosponsor!https://t.co/MvZp4cPsAj\n— Michael Knowles (@michaeljknowles) February 9, 2022\nAppearing on Hugh Hewitt’s show in 2021, Fauci was aghast to learn Americans do not trust him.",
    "President, I think my time is up as a successful and effective spokesperson?’”\nFauci responded, “You know, with all due respect… I just completely disagree with that premise because there are an awful lot of people who do listen, who do the right thing from a public health standpoint.”\n“So because there are a lot of people who have ideas of conspiracies and changing minds and flip-flopping, that’s not a reason to step down.",
    "Hewitt told Fauci directly, “I have lost confidence in the CDC and the FDA and I actually believe a lot of Americans, a significant part of America now have lost confidence in you, Dr. Fauci.”\nHe asked, “Is there a point where you will say, ‘I do more harm than good because people don’t listen to me anymore,’ and step aside?”\n“No.",
    "Referring to bill “H.Con.Res.71”, political commentator Michael Knowles said, “Huge thanks to @RepGosar for his leadership in taking the Public Health Protection Pledge to Congress and holding Dr. Fauci accountable for his incompetence and deception.",
    "Bombshell emails released in January proved the nation’s top doctor is guilty of concealing critical information about coronavirus from Americans and intentionally downplayed the role played by the Wuhan lab in China.",
    "In a fact-check article, Forbes magazine has confirmed, “No, Fauci’s records aren’t available online.”\n“Why won’t NIH immediately release them?” Forbes’ senior contributor Adam Andrzejewski asks.",
    "@hughhewitt challenges Dr. Fauci on why he doesn’t resign seeing as his history of hypocrisy, flip-flops, and failed predictions have destroyed his value as a public-health official.",
    "A new bill introduced to Congress by Republican congressman Paul Gosar of Arizona seeks to issue a subpoena to Fauci and reduce his salary as Chief Medical Advisor to Joe Biden.",
    "“They actively reject what Tony Fauci says for reasons which are complicated… but can you accept that if that’s just the fact, you ought to respond to it and say ‘Mr.",
    "“I’m trying to explain to you the truth,” Hewitt fired back, arguing that Fauci’s hypocrisy have widely destroyed his value as a public-health official.",
    "Americans have become increasingly frustrated with Fauci following a long history of hypocrisy, flip-flops, and failed predictions.",
    "Hewitt asked why he hasn’t resigned since critics view him as a deterrent in the ongoing effort to vaccinate more Americans.",
    "In January, Fauci falsely claimed that his recent financials are already available to the American public.",
    "For example, Americans do not know what Dr. Fauci’s salary was last year (2021) or this year (2022).",
    "The pretentious doctor has been caught in another major lie in front of the American people.",
    "“Make sure to tag your congressman, and tell him to sign on as a cosponsor!” Knowles added.",
    "It’s also not public what stocks and bonds Dr. Fauci bought and sold in 2020 or 2021.",
    "Fauci, unsurprisingly, is aghast & refuses to take the suggestion seriously.",
    "pic.twitter.com/tzV7ckfP4T\n— Tom Elliott (@tomselliott) September 30, 2021",
    "Dr. Anthony Fauci’s “worst nightmare” is becoming a reality.",
    "Fauci’s financials have also come under major scrutiny.",
    "“Are you kidding me, Hugh?” Fauci said at one point.",
    "The latest published salary is from 2020.",
    "Absolutely, unequivocally no, Hugh.",
    "Watch the fiery exchange:\nFinally!",
    "Not at all,” Fauci added.",
    "Sorry,” Fauci reacted."
  ]
}