{
  "id": 2509,
  "mediaId": 8326,
  "date": "2022-02-09",
  "headline": "Peter Navarro, former Trump White House adviser, subpoenaed by Jan. 6 committee",
  "image": "https://www.gannett-cdn.com/presto/2020/07/14/USAT/3408ef02-48ec-44f9-9317-b5b3f0085fa6-Peter_Navarro.jpg?crop=5363,3017,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/02/09/former-trump-white-house-aide-peter-navarro-subpoenaed-jan-6-panel/6727034001/",
  "mediaOutlet": "Gilbert Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chelsey Cox",
  "authorUrl": "https://www.usatoday.com/staff/4553285002/chelsey-cox/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"More than 500 witnesses have provided information in our investigation, and we expect Mr. Navarro to do so as well.”\nThe committee is seeking documents and information pertaining to plans implemented with former White House chief of staff Steve Bannon and others to delay certification of and ultimately change the election results.",
    "\"I refer this tribunal to Chapter 21 of In Trump Time for what is in the public record about the Green Bay Sweep plan to insure election integrity – the last three people on God’s good earth who wanted chaos and violence on Capitol Hill were President Trump, Steve Bannon, and I,\" Navarro said.",
    "Navarro, who served as a senior trade adviser under the former president, was allegedly involved in efforts to delay the certification of the 2020 presidential election results during a special session of Congress and sought to change the results, according to a committee press release.",
    "Navarro also documented in his 2021 book \"In Trump Time: My Journal of America's Plague Year\" a plan known as the \"Green Bay Sweep,\" and described it as the \"last, best chance to snatch a stolen election from the Democrats' 'jaws of deceit.'\"",
    "Committee Chair Rep. Bennie Thompson, D-Miss., said Navarro \"hasn't been shy\" about his role in attempting to overturn the election results and even referenced Trump's support for his plans in interviews and in his own book.",
    "A three-part report, dubbed the \"Navarro Report,\" released on Navarro's website also outlined repeated claims of purported fraud discredited by state officials, courts and in public reporting, according to the subpoena.",
    "Reps. Paul Gosar, R-Ariz., and Ted Cruz, R-Texas, were also named in the subpoena as two of \"more than 100\" members of Congress who were \"on board\" with the plans to overturn the election results.",
    "WASHINGTON — The House select committee investigating events surrounding the Jan. 6 insurrection at the U.S. Capitol subpoenaed former Trump White House trade adviser Peter Navarro Wednesday.",
    "Navarro appears to have information directly relevant to the Select Committee’s investigation into the causes of the January 6th attack on the Capitol, Thompson said in a statement.",
    "\"This was a screwjob to every reporter who didn’t get the leak and it underscores the political and partisan nature of an inquiry which discredits itself on a daily basis.\"",
    "In a statement released Wednesday, Navarro said the subpoena is part of a \"partisan witch hunt\" and said Trump has \"invoked Executive Privilege.\"",
    "The subpoena directs Navarro to submit the requested documents to the committee by Feb. 23 and appear for a deposition on March 2.",
    "\"I note for the record, the subpoena was leaked to key members of the press well before I received it,\" he continued.",
    "The former trade adviser is the 80th individual or organization subpoenaed by the select committee.",
    "A federal judge blocked Trump's request to block a release of documents to the committee last year.",
    "\"Why did Pelosi, the Capitol Hill police, and the Pentagon leave the perimeter unguarded?\"",
    "Reach out to Chelsey Cox on Twitter at @therealco.",
    "“Mr."
  ]
}