{
  "id": 2945,
  "mediaId": 2520,
  "date": "2022-02-03",
  "headline": "Head of Arizona Republican Party fights Jan. 6 committee subpoena for cellphone records",
  "image": "https://www.gannett-cdn.com/presto/2021/09/25/PPHX/870365d8-0116-4689-bf37-8f14d2f5a6a4-cent02-7hoqit4dr9t153bj088w_original.jpg?crop=3599,2025,x0,y183&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/02/02/arizona-gop-chair-kelli-ward-fights-jan-6-committee-subpoena-phone-records/6642838001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Richard Ruelas",
  "authorUrl": "https://www.azcentral.com/staff/2646488001/richard-ruelas/",
  "termIds": [
    0
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nAnother signee, former state Rep. Anthony Kern, in an interview with Epoch Times on Dec. 15, 2020, also said he expected the document he signed to end up before Pence as he presided in the typically ceremonial counting of Electoral College ballots.",
    "For subscribers: How Ariz.'s slate of electors planned to deliver Trump a 2nd presidential term\nCourt filings, press releases and interviews from some of the Arizona signees, suggested the document was part of a multipart plan that would have Pence disregard the official electoral slate from the seven states and, following a procedures outlined in the U.S. Constitution, pave the way for a second Trump term.",
    "“So, both those slates of electors went to the Capitol,” Kern said, “and on Jan. 6, Vice President Mike Pence gets a choice on which electors he’s going to choose.”\nKern said the election would then be thrown to the U.S. House of Representatives with each state, under a process outlined in the Constitution, casting one vote, decided upon by each state’s House delegation.",
    "Handing call information from the contentious postelection time frame, the lawsuit said, would “chill the First Amendment associational rights not just of the (Wards) but of the entire Republican Party in Arizona.”\nThe lawsuit also asserts the Select Committee’s subpoena didn’t follow procedural rules.",
    "The Wards were among 11 Republicans who met on Dec. 14, 2020, at the state Republican Party headquarters to ceremoniously sign a document falsely asserting they had the power to cast Arizona’s electoral votes for President Donald Trump and Vice President Mike Pence.",
    "The head of Arizona’s Republican Party and her husband, both of whom were among the signers of a document falsely declaring them the state’s presidential electors, have filed a lawsuit looking to block a congressional subpoena for their cellphone records.",
    "“And if that happens,” Kern said, “President Trump will serve another four years as our president of the United States.”\nKern said the process would not only bring the benefit of a second Trump term, but also serve as an education for most U.S. residents.",
    "For subscribers: Ducey says he wasn't told in advance about Republican plans for fake Arizona electors\nThe Wards’ lawsuit contends that the phone records sought by the House committee would contain information on calls the two made with medical patients.",
    "Arizona House Speaker Rusty Bowers had said previously that Trump attorney and former New York Mayor Rudy Giuliani had asked him and other Arizona leaders in early December to overturn the certified results and install Trump electors instead.",
    "The subpoena was sent to Kelli Ward, chairperson of the Republican Party of Arizona, and her husband, Michael Ward, in January by the House Select committee looking into the U.S. Capitol riot on Jan. 6, 2021, according to the lawsuit.",
    "The invasion of the U.S. Capitol interrupted the House session just as Rep. Paul Gosar, R-Ariz., was objecting to Arizona's electoral vote, which, according to the plan outlined by a Trump attorney, was the first step of the process.",
    "In a press release the day the Republican electors signed the document, Kelli Ward said that she thought it was “imperative that the proper electors are counted by Congress.”\nHow the scheme came together was unclear.",
    "Two of the Arizona signees, Nancy Cottle, who signed the document as chairperson, and Loraine Pelligrino, who signed as secretary, have been subpoenaed to provide documents and testimony to the committee in February.",
    "That news release said the Republicans’ electoral votes would be sent to the U.S. Senate “where they are to be opened and counted beginning on January 6.”\nA video of the signing was posted on social media.",
    "He said the Biden administration \"has essentially told us to pound sand on almost everything related to, you know, our desire to enforce the Constitution and protect Arizonans, even on border security.\"",
    "“As we speak, today, an alternate slate of electors in the contested states is going to vote and we are going to send those results up to Congress,” Miller said during the “Fox and Friends” interview.",
    "And a Trump adviser, Stephen Miller, said during an interview on the Fox News Network the day the documents were signed that he knew that alternate slates of electors were being prepared.",
    "Two of the states’ documents contained language that specified that the electoral votes for Trump and Pence would only be valid should the official results be overturned.",
    "The genesis of the documents sent by the seven states is being investigated by the congressional committee looking into the violent incursion at the U.S. Capitol.",
    "Further, Kelli Ward asserted in the lawsuit that the seeking of her phone records infringes on her constitutional right of free political association.",
    "It occurred on the day the Electoral College votes were counted by Pence, who did not go along with the plan pushed by Trump attorneys and advisers.",
    "The documents filed by the falsely declared Republican electors in the seven states appeared to come from a template with similar fonts and formats.",
    "The subpoena asked T-Mobile for documents pertaining to a phone number used by the Wards' business, Mole Medical, the lawsuit said.",
    "The committee made similar requests to those who signed the documents in the other six states as chairperson or secretary.",
    "Mark Brnovich said in a Jan. 28 interview on KTAR-FM that he was not investigating the false assertation by the electors.",
    "The case was assigned at first to U.S. District Judge Susan Brnovich, the wife of Arizona Attorney General Mark Brnovich.",
    "That meant that the only valid electors came from the 11 Arizona Democrats who met in downtown Phoenix on the same date.",
    "The document from Arizona simply declared the 11 signees were the “duly elected and qualified” electors from the state.",
    "Six other states sent similar documents to the U.S. Senate with lists of electors that could potentially be counted.",
    "Kern, who has not returned requests for comment, lost his seat in the 2020 election and is running again in 2022.",
    "The documents requested were supposed to cover the dates from Nov. 1, 2020, to Jan. 31, 2021, the lawsuit said.",
    "This is at least the second subpoena sent by the Select Committee regarding the Arizona GOP elector document.",
    "The complaint, filed Tuesday in federal court in Prescott, was first reported on Wednesday by Politico.",
    "A request for comment from the couple sent through the Arizona Republican Party was also not returned.",
    "Senate candidate speaks out: Jim Lamon explains why he falsely claimed to be an Arizona elector\nGov.",
    "Doug Ducey had certified the victory of the Joe Biden and Kamala Harris ticket on Nov. 30, 2020.",
    "Brnovich said that he understood the matter was being looked at by federal prosecutors.",
    "“It’s going to be just a nice constitutional lesson for all America to see,” Kern said.",
    "Judge Brnovich recused herself on Wednesday in a filing that did not give a reason.",
    "But the documents from Arizona and four other states contained no such wording.",
    "Kern was photographed on the steps of the U.S. Capitol on Jan. 6, 2021.",
    "Kelli Ward did not return a message requesting comment.",
    "A video of the signing was posted on social media.",
    "But those 11 Republicans had no such authority.",
    "She asked the case to be randomly reassigned.",
    "News of it was sent out in a press release.",
    "What the Republicans did was no secret."
  ]
}