{
  "id": 3156,
  "mediaId": 2564,
  "date": "2022-02-02",
  "headline": "Matt Gaetz campaign donations shrivel up as prosecutors intensify his sex trafficking investigation",
  "image": "https://i.dailymail.co.uk/1s/2022/02/02/14/53684609-0-image-a-2_1643813155727.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10468281/Matt-Gaetz-campaign-donations-shrivel-prosecutors-intensify-sex-trafficking-investigation.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Drudge Report",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Elkind",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Elizabeth+Elkind,+Politics+Reporter",
  "termIds": [
    1880,
    2474,
    2443,
    5596,
    3514,
    3049,
    2765,
    6159
  ],
  "sentences": [
    "In the middle of the year one of his close associates pled guilty to sex trafficking charges and alleged to federal investigators that Gaetz had sexual relations with a 17-year-old girl\nRep. Matt Gaetz saw the cash flow to his re-election campaign dry up by more than half in the final months of 2021 as a federal sex trafficking investigation into the once-promising GOP rising star intensifies.",
    "+4\nView gallery\nGaetz's fundraising dried up and he wound up spending nearly $100,000 more than his campaign brought in last year\nIn August the law firm Zuckerman Spaeder LLP returned a $25,000 payment to Gaetz's campaign just two months after it was made, apparently cutting ties with the Republican lawmaker.",
    "NBC News reported in January that his ex-girlfriend, whose name was withheld to protect her privacy, has been in talks with federal prosecutors for months to avoid prosecution for obstruction of justice in return for testifying in an investigation into whether he paid for sex with a 17-year-old.",
    "+4\nView gallery\nGaetz came to the notice of investigators through his friendship with former Seminole County tax collector Joel Greenberg, who pleaded guilty to six counts of fraud and sexual offenses\nInstead, he has dismissed the investigation as a 'witch hunt.'",
    "The Gaetz campaign's most recent disclosures show $50,000 paid to criminal defense lawyer Marc Fernich in October\nThe only other political campaign the Florida Republican has donated to in the last three months of 2021 was fellow GOP Rep. Paul Gosar.",
    "Gaetz gave Gosar's Arizona re-election campaign $2,000 on October 22, less than a month before Gosar was censured in a House-wide vote over sharing a violent video depicting himself attacking Biden and Democrat Rep. Alexandria Ocasio-Cortez.",
    "Investigators are reportedly examining a phone call between Gaetz, his ex and another woman - who recorded the call and was cooperating with federal investigators - to establish whether it amounted to obstructing justice.",
    "Gaetz has also used his campaign funds to patronize Trump businesses -- spending $729 at Mar-a-Lago in early November and racking up a $445 bill at Trump International Hotel in DC shortly before that in late October.",
    "Gaetz's campaign ended the year spending $94,838.65 more than it took in -- a worrying sign for any incumbent lawmaker, but a particularly stark change for one who netted nearly $2 million hot off his 2020 victory.",
    "The campaign also spent more than $800,000 on public relations firm Logan Circle Group across all of 2021, though in the last three months of the year it shrunk to just a $2,750 payment in October.",
    "NBC also reported that prosecutors were investigating three separate crimes: Sex trafficking; violating the Mann Act, which bans taking prostitutes across state lines; and obstructing justice.",
    "And his campaign, Friends of Matt Gaetz paid $75,000 to sex crimes lawyer Marc Fernich last year -- more than the roughly $73,000 it paid in all legal fees from 2016 through 2020 combined.",
    "The probe, first reported at the end of March, heated up with allegations that Gaetz had sex with a 17-year-old and whether he paid for women to travel across state lines to have sex.",
    "Gaetz, a close ally of former President Donald Trump had been on track for a record-setting year after another successful quarter of $1.4 million raised from April through June.",
    "The criminal defense attorney is not known for representing political campaigns, but boasts infamous clients such as Jeffrey Epstein and Joaquin 'El Chapo' Guzman.",
    "Previous reporting revealed that investigators believe Gaetz's former girlfriend is key to unraveling transaction records that allegedly reveal payments for sex.",
    "In May, his associate Joel Greenberg pled guilty to sex trafficking charges and told investigators that Gaetz had sex with the teen, among other serious claims.",
    "Gaetz's campaign spending dwindled significantly during that time, as donations dried up, mostly issuing checks for political consultancy and campaign mail.",
    "Her attorney Tim Jansen declined to comment on case when he was approached by a reporter as he entered the federal courthouse in Orlando with his client.",
    "The most recent financial disclosures for Gaetz's 2022 campaign show the Florida congressman raked in just $534,000 in the last quarter of 2021.",
    "Isabelle Kirshner, one of his lawyers, told DailyMail.com on Wednesday: 'We have seen no credible basis for a charge against Congressman Gaetz.",
    "Greenberg pleaded guilty to identity theft, stalking, wire fraud, conspiracy to bribe a public official and sex trafficking of a minor.",
    "Meanwhile Gaetz's ally Greenberg told investigators that Gaetz and at least two other men had sexual contact with a 17-year-old girl.",
    "He also reportedly revealed that Gaetz paid prostitute Megan Zalonka after a cocaine-fueled party at a Trump fundraiser.",
    "+4\nView gallery\nMegan Zalonka (right) is pictured with Gaetz, who is said to have snorted cocaine and had sex with her",
    "It's more than $1 million less than the hefty $1.8 million sum he raised in the first three months of last year.",
    "However he ended the year with about $1.5 million cash-in-hand in an apparent hefty war chest of his own money.",
    "Rep. Matt Gaetz was on track to have a record fundraising year in the first two quarters of 2021.",
    "The congressman's third quarter fundraising, July through September, netted just about $527,000.",
    "'We remain steadfast in our commitment to challenge any allegations with the facts and law.'",
    "It was revealed on Monday that Friends of Matt Gaetz paid Fernich $50,000 on October 4.",
    "Both of them had voted to overturn President Joe Biden's 2020 electoral victory.",
    "She is a former Capitol Hill staffer who has known the congressman since 2017.",
    "He has told them that they both gave women cash and gifts in exchange for sex.",
    "Gaetz has not been charged with any crime and has denied all the accusations.",
    "Meanwhile Gaetz started the year with feds' investigation closing further in.",
    "Fernich is reportedly representing the campaign in the sex trafficking probe.",
    "It suggests the investigation into Gaetz is entering a new, decisive phase.",
    "They previously handed the lawyer $25,000 in June of last year."
  ]
}