{
  "id": 3339,
  "mediaId": 8290,
  "date": "2022-02-01",
  "headline": "Send Troops To Southern Border - Not Ukraine",
  "image": "https://static.wixstatic.com/media/7d0df7_3b58caaf175c42ceb2ce5bef2afadd7c~mv2.jpg/v1/fit/w_575%2Ch_315%2Cal_c%2Cq_80/file.jpg",
  "link": "https://www.conservativehq.org/post/send-troops-to-southern-border-not-ukraine",
  "mediaOutlet": "conservativehq.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Rasley",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Reuters reports U.S. border officials are preparing for as many as 9,000 border arrests per day by the spring, according to two Department of Homeland Security officials, which would be significantly larger than last year's peak and could cause a headache for the Democratic administration ahead of midterm elections.",
    "You can add them all - everybody was doing better than ever before.”\nFormer President Trump is right, and MAGA Members of Congress, such as Reps Paul Gosar and Thomas Massie, are already picking up the cue and issuing statements demanding Biden stay out of Ukraine and protect our southern border.",
    "Donald Trump was regularly bashed by the DC war party for his America First foreign policy, but at his rally by contrasting Biden's foreign policy with the crisis at the border, Mr. Trump laid out a winning Republican platform for the 2022 midterm elections.",
    "“The state is getting killed.”\nThe former President was right of course: Almost 2 million people entered the United States without authorization in the fiscal year ending on Sept. 30, 2021 the U.S. government reported.",
    "It is time for Republicans to stop chalking up what’s going on at the southern border to Biden’s incompetence and to embrace the Donald Trump message to put troops on the border to stop illegal border crossing.",
    "During his massive weekend rally at Conroe, Texas former President Donald Trump drew thunderous applause when he said, \"...the most important border right now for us not Ukraine's border but America's border.\"",
    "The crowd erupted into dueling chants of “Build the wall,” and “Protect the border.”\nTrump also used his speech to contrast the Biden's administration's multiple crises with his own time in power.",
    "Donald Trump\nTexas Trump rally\nUkraine Russia\nJoe Biden send troops to Ukraine\nillegal immigration\ndrug cartels\nBorder Patrol\nAmerica First foreign policy\n2024 platform\ntroops on southern border",
    "As Victor Joecks of the Las Vegas Review-Journal wrote in a January 27, 2022 column, \"No matter how bad you think the situation is on the southern border, you’re wrong.",
    "And we're going to take back America.”\nThe White House will follow in 2024, he added according to the UK’s Daily Mail, without specifying who the candidate would be.",
    "Greg Abbott joined former President Trump and ridiculed Biden for preparing to send troops to protect Ukraine's border rather than America's border with Mexico.",
    "“We created over 7 million new jobs and achieved the lowest unemployment rates for African-Americans, Hispanic-Americans and Asian-Americans ever recorded.",
    "“Before Joe Biden sends any troops to defend a border in Europe he should be sending troops to defend our border right here in Texas,” Mr. Trump continued.",
    "The toll-free Capitol Switchboard (1-866-220-0044), call your Senators and Representative today to tell them you oppose sending American troops to Ukraine.",
    "“And you could add women, you could add high school diplomas, non-high school diplomas, diplomas from MIT, Harvard, Yale, the Wharton School of Finance.",
    "Biden has put 8,500 troops on standby to strengthen U.S. allies in Europe as Russia masses more than 100,000 soldiers on the Ukrainian border.",
    "The rally marked Trump's first visit to Texas in two years, to the reddest county in a state where Democrats are trying to make inroads.",
    "“President Trump did a better job than any president in the history of the United States in protecting our border,” said Gov.",
    "Son Don Jr. teed-up his father’s remarks by noting Russia had invaded the Crimea when Barack Obama was in the White House.",
    "But mere ineptness doesn’t explain contracting charter flights or releasing illegal immigrants with criminal records.",
    "They don't respect someone who can't walk up a flight of stairs to Air Force One,” the younger Trump concluded.",
    "The numbers only got worse after that with some 2.3 million illegal aliens recorded by the end of the year.",
    "It would be easy to chalk this up to Biden’s incompetence, which he has amply demonstrated on many fronts.",
    "Trump exercised great message discipline hammering Democrats on the border crisis at every opportunity.",
    "“Texas is one of the great losers on that one,” he told the Houston radio station KTRH Friday.",
    "A more likely explanation is that flooding the US with illegal aliens is Biden’s plan.",
    "Instead of defending Ukraine’s border you want American troops to defend OUR border.",
    "That takes planning, especially the effort to keep these actions under wraps.",
    "Russia wasn't taking over its neighbor,” remarked the former President’s son.",
    "“There was a strange four-year pause where Russia wasn't an aggressor.",
    "“We built the greatest economy in the history of the world,” he said.",
    "“This is the year we are going to take back the House,” he said.",
    "“You know what a bully like Russia respects?",
    "It’s worse\" and the Democrats know it.",
    "We're going to take back the Senate.",
    "And it is only going to get worse.",
    "Texas Gov.",
    "Strength.",
    "Abbott."
  ]
}