{
  "id": 3404,
  "mediaId": 2605,
  "date": "2022-01-28",
  "headline": "Column: Alaska just changed its election system to weed out hard-liners. Maybe other states should too",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/6c0085b/2147483647/strip/true/crop/3000x1575+0+214/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fee%2Faa%2F55c62bd248e5ba28ee34324760b6%2Fla-photos-handouts-la-tr-alaska-009.JPG",
  "link": "https://www.latimes.com/politics/story/2022-01-28/alaska-ranked-choice-voting-political-polarization",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3147,
    3718,
    4064,
    1245,
    6026,
    5930,
    5938,
    6270
  ],
  "sentences": [
    "Eliminating that threat “really does allow someone to say, ‘I’m voting for this because I think this benefits all Alaskans,’” Grenn said, “instead of being punished for working with someone not in their party.”\nOther states, including California, operate under a primary system that allows the top two vote-getters to advance to a runoff, regardless of affiliation.",
    "A study of four Bay Area cities that have adopted the system since 2000 — San Francisco, Oakland, Berkeley and San Leandro — found an increase in the percentage of candidates of color seeking office, as well as an increased probability of female candidates and female candidates of color being elected.",
    "The idea is to reward candidates who show broad appeal and to undermine the hard-liners on both sides, resulting — in theory — in lawmakers more willing to get stuff done and leave the noxious political antics to the noisemakers on cable news and talk radio and the rabble on social media.",
    "(David Swanson)\nAlaska is a place both physically and psychically removed from the rest of America, which folks there refer to as “Outside.”\nNote the capital “O,” as it appears in newspapers, which reflects both standardization and a proud embrace of the state’s apartness.",
    "Ranked-choice voting (which, incidentally, is how the Oscars work) is used statewide in Maine and more than 50 other jurisdictions across the country, including New York City, San Francisco, Minneapolis and St. Paul, Minn.\nOthers are eyeing the system.",
    "There are nearly 20 states, including Oregon and Nevada, where legislation has been introduced or advocates are pushing ballot measures to institute ranked-choice voting, according to FairVote, a nonpartisan organization that promotes the change.",
    "“When candidates compete not just against one another but also to become the second choice of those voting first for an opponent, it creates incentives for collaboration and consensus you don’t find in a top-two system,” Grenn said.",
    "He recalled talking with colleagues who recognized the merits of a policy proposal but shrank from public support for fear their vote would stir up their party base and result in a primary challenge from either the left or right.",
    "“It’s very difficult for you to be a real hard-liner and scorched-earth candidate and alienate the supporters of every other candidate ... because you often may need some of the second-choice rankings” to win election.",
    "And ranked-choice voting requires a good deal more thoughtfulness and engagement on the part of voters who must consider not just their first choice but second (and, in Alaska, third and fourth) preference.",
    "Four slots are preferable, Grenn said, to give independent and third-party contestants a better shot at advancing and to further motivate candidates to reach out to different kinds of voters.",
    "Grenn said his time in the Legislature “served as a front seat on political division and fighting” in Juneau, the state capital, and the chronic allergy many lawmakers had to bipartisanship.",
    "Isolation aside, Alaska has changed its elections in way that may be a model for the rest of the country as the U.S. sinks ever lower into a slough of political nihilism and dysfunction.",
    "Can ranked-choice voting also lessen polarization and reduce the number of crazies — think Reps. Paul Gosar and Marjorie Taylor Greene — elected to office, as supporters in Alaska hope?",
    "But, that said, a little less time, say, watching reality TV and a little more focused on civic responsibility doesn’t seem like much to ask to improve our blighted political system.",
    "He spoke this week from his home in Anchorage, days after the state’s Supreme Court upheld the new system, which voters narrowly approved in 2020.",
    "Starting this year, candidates will run in a one-of-a-kind system that starts by placing all of them on the same ballot, regardless of party.",
    "Benjamin Reilly, a political scientist and ranked-choice voting expert at the University of Western Australia, offers an emphatic yes.",
    "Jason Grenn helped promote the ballot initiative after serving a term as an independent in Alaska’s House of Representatives.",
    "Then the top four vote-getters advance to the general election, at which point voters will rank them in order of preference.",
    "In most elections in America, the candidate with the most votes wins office, even if he or she falls short of a majority.",
    "New York City, which used ranked-choice voting for the first time in last year’s mayoral race, saw turnout rise by 13%.",
    "Some believe Australia’s politics are too geared toward the center, “too Tweedledum and Tweedledee.” as Reilly put it.",
    "The candidate with the poorest showing is eliminated and those votes are reallocated to supporters’ second pick.",
    "But if no candidate receives a majority of first-choice votes, a new round of tabulation begins.",
    "It’s “a big change to the way a lot of people have been thinking about politics,” Reilly noted.",
    "It will be used starting with the August primary for governor, U.S. Senate and other offices.",
    "One in an occasional series on proposals to fix our politics and strengthen democracy.",
    "Under that system, a candidate who wins more than 50% support is elected outright.",
    "What’s unique is Alaska’s top-four system, combined with ranked-choice voting.",
    "(This is not the place to get into a discussion of the electoral college.)",
    "The process continues until someone receives a majority of votes.",
    "The limited practice has already produced positive results.",
    "“You just cannot get elected as an extremist,” Reilly said.",
    "(Australia has used the system for more than 100 years.)",
    "Ranked-choice voting is different.",
    "There are, he said, downsides."
  ]
}