{
  "id": 3438,
  "mediaId": 8263,
  "date": "2022-01-28",
  "headline": "Here's how a Nixon-era environmental law could curb US immigration",
  "image": "",
  "link": "https://www.arizonaherald.com/news/272241346/heres-how-a-nixon-era-environmental-law-could-curb-us-immigration",
  "mediaOutlet": "arizonaherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "That suit followed a demand letter sent to Department of Homeland Security Secretary Alejandro Mayorkas by Arizona Republican Representative Paul Gosar and Natural Resources committee ranking member Representative Bruce Westerman to deliver any studies conducted by his agency about the environmental effects of illegal border-crossing.",
    "In the same year President Nixon signed the National Environmental Policy Act (NEPA) into law (1970) - a statute that recognizes \"the profound influences of population growth [on] the natural environment\" - he also convened the Rockefeller Commission on Population Growth and the American Future.",
    "While today's conservative and liberal critics are apparently perplexed by the far-left's newfound deference toward Corporate America or their replacement of 'class-' with 'race-struggle', for many seasoned environmentalists, it's a painful trend that goes back decades.",
    "Although largely forgotten now, figures like Garrett Hardin, Paul Ehrlich, Stewart Udall, Gaylord Nelson, David Brower, Fairfield Osborn, William Vogt, Walter Youngquist, and Albert Bartlett garnered serious attention in left-wing periodicals and speaking circuits.",
    "For instance, according to the latter group of claimants, starting from 1981 onward, the federal government's immigration agencies have implemented no fewer than 80 programs which have facilitated the settlement of over 40 million foreign nationals.",
    "Unfortunately, Nixon would reject the advice, reportedly due to pressure from the Catholic church, which didn't like the 'pro-abortion-feel' of the panel's recommendations, despite US population growth being, then as now, largely immigration-based.",
    "Following two years of testimony from experts and open deliberation on the issue, Nixon's blue-ribbon panel recommended that the government get far more serious about stabilizing the population - which was a little over half what it is today.",
    "Soon, the federal district court in Phoenix will be ruling on a lawsuit brought by the state of Arizona last April, demanding the government to abide by its NEPA obligations and take seriously the effects of runaway population growth.",
    "Human beings, of course, are agents of pollution, and many concerned Americans at the time drew reasonable parallels between events like the Cuyahoga River fire, LA's smog crisis, and our then-as-now galloping growth in population.",
    "Elsewhere, it notes that considering the size of your average American's carbon footprint, the emissions resulting from immigration since 1980 are equal to around five percent of the growth in CO2 emissions globally.",
    "And not coincidentally, says the complaint, during this same period, over 40 million acres of previously undeveloped urban land was built on and paved over around the country - an area roughly the size of Florida.",
    "That they begin to do so, and allow the American public to fully understand what our immigration trajectory portends for the environment, is behind a few efforts which should come to the fore this year.",
    "Instead, they punted with various versions about what the \"real threat\" to the environment was - as if the issue isn't made up of numerous contributing factors; overpopulation clearly being a major one.",
    "Now might be the time to push the environmental movement (as well as the federal government) into taking seriously, once more, the reality of mass population growth and America's environmental future.",
    "Should the House turn red this year, congressmen Gosar and Westerman might also consider re-introducing a bill more clearly outlining DHS's immigration agencies environmental reporting under NEPA.",
    "In spite of this clear mandate on federal activity, federal immigration agencies have never conducted a single NEPA analysis when it comes to the short- and long-term effects of mass immigration.",
    "Also expected is the DC District Court's response to another NEPA/immigration lawsuit; this one filed by a nonprofit immigration reform organization and a group of individual environmentalists.",
    "That's over 10 percent of the population currently, and it doesn't even take into account these migrants' children or the three to four relatives they later bring over on average.",
    "Still, as a policy concern, population growth was taken seriously throughout the '70s by both the left in general and top experts in the environmental and biological sciences.",
    "When Arizona's suit dropped last year, Fox News approached a slew of establishment environmental groups asking their opinion about population growth's environmental effects.",
    "An advocate against mass immigration throughout his career, he would retire frustrated, penning a heart-felt lamentation on the issue just prior to his retirement in 1992.",
    "Younger green-activists may be surprised to learn that a core, perhaps the core, issue at the start of the environmental movement in the 1970s was overpopulation.",
    "The response is also expected this year, and with the GOP looking likely to take the House, the congressmen will be able to push even harder next post-midterms.",
    "(RT.com)\nGet a daily dose of Arizona Herald news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.",
    "Each of these efforts are accompanied with factual claims and supporting data certain to tie today's pro-open-borders environmental establishment in knots.",
    "Publish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Arizona Herald.",
    "Surely, one would think this is an area of discussion that deserves something more than moral derision from today's progressive climate activists.",
    "Among them was the late Congressman James H. Scheuer (D-NY), who held one of the first congressional hearings on climate change in 1981.",
    "The graveyard of progressive fads is a vast one - if you can remember the \"Free Tibet\" or \"Kony 2012\" movements, you know what I mean.",
    "As it requires, before a federal agency undertakes an action, the environmental impact of that action must be fully considered.",
    "Such a bill was actually introduced by former Congressman Tom Tancredo (R-CO) in 2004.",
    "Again, people, especially Americans, are agents of pollution.",
    "But, as shown above, this wasn't always the case.",
    "We may now be witnessing Scheuer's vindication.",
    "Nixon's NEPA is a simple law on its face.",
    "Each failed to respond directly.",
    "More Information"
  ]
}