{
  "id": 3812,
  "mediaId": 2729,
  "date": "2022-01-23",
  "headline": "Election fraud belief undimmed for Trump fans, despite party hopes",
  "image": "https://www.towleroad.com/wp-content/uploads/2022/01/482929-origin_1.jpg",
  "link": "https://www.towleroad.com/2022/01/election-fraud-belief-undimmed-for-trump-fans-despite-party-hopes/",
  "mediaOutlet": "towleroad.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Towleroad",
  "authorUrl": "https://www.towleroad.com/author/towleroad/",
  "termIds": [
    2765,
    2340,
    4905,
    4267,
    3625,
    5949,
    6158,
    6515
  ],
  "sentences": [
    "Published by\nAFP\nJonathan Riches, who has attended 40 Trump events, joined thousands of other supporters of the former president for a rally in Arizona on January 15, 2021\nFlorence (United States) (AFP) – Jonathan Riches has been to 40 Donald Trump rallies and fervently believes the last US presidential election was stolen.",
    "When Trump took to the stage, he set about a binary classification of people — those who signed on to his theories about fraud were “smart” and “tough,” while those who didn’t were “horrible” and “weak.”\nThe message was clear: without getting in line on election fraud claims, no-one will get Trump’s endorsement.",
    "Everybody is like family.”\nThe reunion was treated to a greatest hits of Trumpism, as speaker after speaker blasted President Joe Biden as “deranged,” hit out at the “lamestream media,” lamented supposedly “open borders” and railed against Covid-19 masking and vaccines.",
    "With the 2022 midterm elections in focus, McConnell wants to concentrate his fire on Biden’s record after a difficult first year in office, with Covid surging, inflation skyrocketing and grocery shelves hit by supply chain difficulties.",
    "Like thousands of others who spent hours in a dusty field in Arizona this weekend to watch the former president speak, that belief is a bedrock — no matter how much the Republican Party leadership wishes otherwise.",
    "Some had arrived days in advance and traveled long distances — Riches is from Tampa, Florida — and were getting together in a party atmosphere with friends from all over the country.",
    "“And I agree with him.”\nMcConnell has gently tried to pivot the Republican Party away from a fixation on re-litigating 2020, which Biden won by millions of votes.",
    "Pivot\nSenate Minority Leader Mitch McConnell this week came to the defense of fellow Senator Mike Rounds, who earned Trump supporters’ ire by saying he lost.",
    "“And if we simply look back and tell our people don’t vote because there’s cheating going on, then we’re going to put ourselves in a huge disadvantage.”",
    "But Trump’s hold on a significant proportion of the Republican Party base — and the demand that the 2020 election be re-fought — makes that difficult.",
    "I mean, it’s crystal clear.”\n‘Refocus’\nWhile that view was consistent in Florence on Saturday, it is not what the country at large thinks.",
    "Dozens of legal attempts to overturn part of the ballot have failed and no credible evidence of significant voter fraud has emerged.",
    "An Axios-Momentive opinion poll published this month found that around 40 percent of Americans believe the vote was compromised.",
    "And you don’t get to go away scot-free.”\nSpeakers were introduced as “Trump-endorsed” and all of them cast doubt on 2020.",
    "That leaves a majority who want to move on, and for Senator Mike Rounds, the party’s inability to do so could hurt them.",
    "But the dominant theme was debunked theories about electoral fraud and the illegitimacy of the 2020 presidential poll.",
    "“If you really pay attention to the facts to various audits, various information that’s coming out, you see it.",
    "Riches was among fellow believers in Florence, 60 miles (100 kilometers) outside Phoenix for Saturday’s rally.",
    "“Moving forward, we have to refocus once again on what it’s going to take to win the presidency,” he added.",
    "We simply did not win the election as Republicans for the presidency,” Rounds told ABC News last week.",
    "“I think Senator Rounds told the truth about what happened in the 2020 election,” McConnell told CNN.",
    "I call him President Trump because I still consider him my president,” Riches, 44, told AFP.",
    "It was music to the ears for Will Garrity, who had traveled from Houston, Texas.",
    "“That election was rotten to the core,” Congressman Paul Gosar told the crowd.",
    "“It’s awesome,” said Jennifer Winterbauer, who had journeyed from Texas.",
    "Because just like he (Trump) says, when you rob a bank, you get caught.",
    "“You can’t tell me that it was a legit election,” he said.",
    "“We have to address 2020,” Winterbauer, 49, told AFP.",
    "“The election was fair — as fair as we’ve seen.",
    "“I have better friends here than I do at home.",
    "Senior Republicans wish it was different.",
    "“You’re gonna have the same problem.",
    "You don’t get to keep the money.",
    "“We love our president."
  ]
}