{
  "id": 396,
  "mediaId": 6676,
  "date": "2022-02-20",
  "headline": "AOC claps back after Tucker Carlson calls her ‘entitled white lady’",
  "image": "https://www.wkrg.com/wp-content/uploads/sites/49/2022/02/Rep.-Alexandria-Ocasio-Cortez.jpg?w=1280",
  "link": "https://www.wkrg.com/national/aoc-claps-back-after-tucker-carlson-calls-her-entitled-white-lady/",
  "mediaOutlet": "wkrg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Hill via Nexstar Media Wire",
  "authorUrl": "https://www.nxsttv.com/nmw/?post_type=profile&p=173669",
  "termIds": [
    3049,
    1708,
    1477,
    1394,
    514,
    392,
    6541,
    6442,
    6621
  ],
  "sentences": [
    "“She’s the pampered obnoxious ski bunny in the matching snowsuit who tells you to pull up your mask while you’re standing in the lift line at Jackson Hole,” Carlson said during a segment in which he touched on a new book called “Take Up Space: The Unprecedented AOC,” according to Newsweek.",
    "The New York Democrat also called the Fox News host a “creep” and referred to him as “basura,” Spanish for “trash,” after Carlson also claimed that she might have been making a “booty call” while making a social media video after reading from one excerpt of the book, Newsweek reported.",
    "(The Hill) — Rep. Alexandria Ocasio-Cortez (D-N.Y.) rebuked Fox News host Tucker Carlson on Twitter after he referred to her as a “rich, entitled white lady” during a Friday segment on his show.",
    "“This is the type of stuff you say when your name starts with a P and ends with dejo,” Ocasio-Cortez tweeted, referring to “pendejo,” which means “idiot” or “a–hole” in Spanish.",
    "Last November, the House voted to censure Rep. Paul Gosar (R-Ariz.) after he released an amine video on social media that showed him attacking President Biden and Ocasio-Cortez.",
    "Ocasio-Cortez, whose mother is from Puerto Rico, quote-tweeted a clip of Carlson’s remarks and clapped back, referring to him with a Spanish insult.",
    "If you’re this easy w/ sexual harassment on-air, how are you treating your staff?”\n“Any man that talks like this will treat any woman like this.",
    "Doesn’t matter if you’re Republican, Democrat, or neither, this is clearly not a safe person to leave alone w/ women,” she continued.",
    "And this one is basura.”\nOcasio-Cortez has been a frequent target among Republicans and conservatives like Carlson.",
    "“Remember when the right-wing had a meltdown when I suggested they exhibit obsessive impulses around young women?",
    "Well now Tucker Carlson is wishing for… this on national TV,” Ocasio-Cortez tweeted.",
    "“Once again, the existence of a wife or daughters doesn’t make a man good.",
    "Doesn’t matter what shade they are,” he added.",
    "“They’re all the same.",
    "“You’re a creep bro."
  ]
}