{
  "id": 4674,
  "mediaId": 8345,
  "date": "2022-04-21",
  "headline": "Rants and Raves | April 22, 2022",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2020/09/21/KDM-Rants-And-Raves_thumbnail.jpg",
  "link": "https://kdminer.com/news/2022/apr/21/rants-and-raves-april-22-2022/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Mohave County Supervisors discuss joining proposed lawsuit banning electronic voting machines – This was just another embarrassing dog and pony show sponsored by Ron Gould that further demonstrates his intent on dragging Mohave County residents down the rabbit hole with his dictatorial politics and delusions of voter fraud.",
    "Ukrainian Officials: Russian Strikes Kill At Least 7 In Lviv - Biden leftists are suggesting putting U S troops in Ukraine which would cover up the Biden corruption/close ties with Ukraine; also cover for Hillary’s Russian lies against President Trump.",
    "Don Martin opinion column: Launch conditions continue to deteriorate at South Cove – Unless the lake stops deteriorating, fixing the boat ramp is a short-term solution to a long-term problem.",
    "Mohave County Supervisors discuss joining proposed lawsuit banning electronic voting machines – Republicans like Mohave County Supervisor Ron Gould keep inventing problems where none exist.",
    "Don Martin opinion column: Launch conditions continue to deteriorate at South Cove – Being concerned about launch ramps at Lake Mead is like rearranging the deck chairs on the Titanic.",
    "Mohave County Supervisors discuss joining proposed lawsuit banning electronic voting machines – These sue-happy politicians are working for Putin and don’t even know it.",
    "Mohave County Supervisors discuss joining proposed lawsuit banning electronic voting machines – Hand counting is less accurate and less secure.",
    "Electric car denier rant – On sunless and windless days, electric cars (and other things) can make use of these magic things called batteries.",
    "Important Primary - Congressional District 9 election will be decided in the primaries since no Democrat qualified for the general election.",
    "Speaking of water, the city wants us to save but allow the people with the trees out by the airport to pump all the water they want.",
    "Consider changing to Independent immediately to request a Republican ballot and vote for Adam Morgan as he defeats Paul Gosar.",
    "He is hard working and does a great job, but receives little recognition, in consistently tackling many important issues.",
    "AG Brnovich wants death-row prisoner’s mental fitness exam called off – Of course he is mentally incompetent.",
    "Expect more errors than voting machines not to mention taking weeks and more money to tabulate results.",
    "Mohave County Supervisors discuss joining proposed lawsuit banning electronic voting machines – Hmmm?",
    "Oatman Highway could get $2 million in federal funds for improvements – Highways are not dangerous.",
    "Why would our county supvervisors think about joining when the problem is in Maricopa County?",
    "Hitting the rub-strip (or guard rail) could make a driver overcorrect into oncoming traffic.",
    "Clown show – U.S. Rep. Marjorie Taylor Greene (R-Georgia) will not show to testify Friday.",
    "Our supervisors shouldn’t cater to conspiracists, another embarrassment to Mohave County.",
    "Every voter needs to subscribe to Congressman Gosar’s weekly newsletter and be informed,.",
    "Submit Rants and Raves at kdminer.com/rants-and-raves or email editorial@kdminer.com.",
    "Population stagnation leads to bankruptcy and highlights our economic problems.",
    "If your rant/rave is about a specific story please mention the headline.",
    "Just with Republicans who keep sending in their dead relatives’ ballots.",
    "If she shows up it will be devastating for the MAGA/Q-tip movement.",
    "She’s too stupid to keep her story straight under examination.",
    "Electric cars are priced the same as many gas luxury vehicles.",
    "“With water a problem, why are we still building homes?” rant.",
    "We pay for what we spend today speculating tomorrow’s growth.",
    "We receive many more rants and raves than we can print.",
    "Let us know what’s on your mind in 40 words or less.",
    "There hasn’t been an issue with the voting machines.",
    "Rants and raves must be original; not plagiarized.",
    "Because our economy is based on population growth.",
    "Thanks Supervisor Bishop for having common sense.",
    "Proposed improvements could make accidents worse.",
    "No evidence of voter fraud has been presented.",
    "Seventy-five percent of Americans oppose this.",
    "Why else would you sexually assault and kill?",
    "Some will feel “safer” and use less caution.",
    "Local rants and raves are preferred.",
    "That’s why technology was developed.",
    "Meanwhile, our border’s wide open.",
    "It will be great television.",
    "It is the drivers on them!",
    "Congressman Paul Gosar.",
    "Step into the future.",
    "Hand count ballots?",
    "Flip the switch.",
    "I hope she does.",
    "HE HAS MY VOTE!",
    "Makes no sense.",
    "Less accuracy!"
  ]
}