{
  "id": 4733,
  "mediaId": 2642,
  "date": "2022-04-24",
  "headline": "AZ Judge Kicks Out Disqualification Complaints For Two GOP Representatives",
  "image": "https://waynedupree.com/wp-content/uploads/2022/04/sd-1200x675.jpg",
  "link": "https://waynedupree.com/2022/04/arizona-judge-disqualifies-lawsuits-against-gop-reps/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WD Staff",
  "authorUrl": "https://waynedupree.com/author/wd-staff/",
  "termIds": [
    2187,
    2246,
    2427,
    2426,
    2013,
    3172,
    5399,
    5949
  ],
  "sentences": [
    "Law says that “Any elector may challenge a candidate for any reason related to his or her qualifications for the office he or she is running for as set out in law.”\nBecause even if the court were to say that Arizona, not just Congress, could make a private right of action for the Disqualification Clause, the law doesn’t do this: “Arizona Code Section 16-351(B) does not do this.” Expanding the question to include disqualifications, or who isn’t allowed to run for office, would change the applicable statute and create a cause of action and remedy in a law that was made by law.",
    "In March, he put a temporary injunction on a state law that allows qualified voters who live in a district where an office candidate is running to challenge the candidate’s constitutional or statutory qualifications for office, including the Disqualification Clause, if the candidate is running for office in that district.",
    "Another judge has already ruled on complaints from a group called Free Speech for the People, which says its goal is to “fight for free and fair elections, for reliable and secure voting systems.” Coury is the third judge who has decided on the group’s complaints.",
    "According to the complaints, Gosar, Biggs, and Finchem violated the clause because they “helped facilitate” the breach of the U.S. Capitol on January 6, 2021, by two groups linked to Vermont Senator Bernie Sanders (I-Vt).",
    "Superior Court Judge Christopher Coury ruled that the Constitution does not allow for private action to enforce Section 3 of the 14th Amendment of the U.S. Constitution, which was also targeted by the suits.",
    "An argument like that was made by Rep. Marjorie Taylor Greene (R-Ga.) when she asked for an injunction in the case against her, but U.S. District Judge Amy Totenberg turned it down.",
    "Totenberg, an Obama appointee and the sister of NPR legal analyst Nina Totenberg, said that the Amnesty Act only applied to people who were already in the U.S. when it was passed.",
    "The section, known as the Disqualification Clause, states that anyone who has “engaged in insurrection or rebellion” against the government is ineligible to hold a federal office.",
    "A judge in Arizona has thrown out lawsuits that sought to disqualify Reps. Paul Gosar (R-Ariz.) and Andy Biggs (R-Ariz.) from serving in their current capacities in Congress.",
    "Coury noted that the clause makes it clear that Congress has authority to enforce the section, a conclusion that was detailed in one of the few cases that dealt with it.",
    "Plaintiffs, who were hoping for this kind of a ruling, also said that citizens have the right to challenge candidates because of a state law, but Coury disagreed.",
    "In the Arizona Constitution, the requirements for people in the state’s Executive Branch, like Finchem, who wants to be secretary of state.",
    "Each chamber of Congress decides what kind of person should be in Congress, according to Article 1, Section 5 of the U.S. Constitution.",
    "When Rep. Madison Cawthorn (R-N.C.) tried to use the Disqualification Clause, a judge named by President Trump did something similar.",
    "To enforce the Disqualification Clause, a citizen can’t get someone declared “not qualified” to be in public office, the judge said.",
    "The 14th Amendment lets the House of Representatives, not some left-wing, radical, or special interest group, decide who can serve.",
    "She also disagreed with Greene’s claim that the Georgia law the challenge used violated her constitutional rights.",
    "“The plain language of the statute shows that Section 3 cannot apply to any member of Congress,” the judge said.",
    "“All political disabilities” imposed by the clause no longer apply to people, with some exceptions, says Myers.",
    "The Amnesty Act of 1872 and the Amnesty Act of 1898 say that the clause no longer applies to everyone.",
    "The group’s main goal is to make sure that former President Trump can’t win the 2024 election.",
    "In the last few years, the group started a campaign against people who were linked to Jan. 6.",
    "No current member of Congress can be disabled by Section 3, the judge said.",
    "I think that today’s decision is a good thing for the Constitution.",
    "Challengers didn’t answer when we asked them for comment.",
    "They wanted to stop them from running for office.",
    "This would be against the rules of the game."
  ]
}