{
  "id": 5250,
  "mediaId": 2662,
  "date": "2022-04-19",
  "headline": "Kevin McCarthy Says GOP Could Strip Crooked Democrats from Committee Leadership Positions — DON’T BELIEVE IT",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/young-guns-mccarthy-.jpg",
  "link": "https://www.thegatewaypundit.com/2022/04/kevin-mccarthy-says-gop-strip-crooked-democrats-committee-leadership-positions-dont-believe/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/jim-hoft/",
  "termIds": [
    2742,
    2443,
    2020,
    2187,
    4554,
    4066,
    3246,
    1126,
    1116,
    392
  ],
  "sentences": [
    "If the proposal is followed through; Democrat Reps. Maxine Waters of California, Bennie Thompson of Mississippi, Frank Pallone of New Jersey, Adam Smith of Washington, Nydia Velazquez and Jerry Nadler of New York, and Richie Neal of Massachusetts would be stripped of their top-ranked positions in the Financial Services, Homeland Security, Energy and Commerce, Armed Services, Small Business, Judiciary, and Ways and Means Committees, respectively.",
    "HERE IS THE SILLY VIDEO Rep. Paul Gosar Posted that Tyrant Pelosi Is Using to Demand He is Removed from His Congressional Committees — What a Joke\nNow Republicans are weighing in on imposing term limits on committee leadership positions if the GOP retakes the House of Representatives next year.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nKevin McCarthy told Breitbart back in January that he would kick Democrats off committees in retaliation for the historic moves by tyrant Pelosi.",
    "Newsmax reported:\nIn the event Republicans take back the House in November, the party is weighing a chamber-wide imposition of term limits on committee leadership that would lead to the demotion of many influential Democrat ranking members, Punchbowl News reported on Monday.",
    "In a January Breitbart interview, House Minority Leader Kevin McCarthy, R-Calif, said he would kick controversial Democratic congress members off committees in retaliation if Republicans take the chamber.",
    "However, the outlet noted Democrats broke the dynamic over the past year by booting Reps. Paul Gosar of Arizona and Marjorie Taylor Greene of Georgia out of committees for allegedly insensitive remarks.",
    "Nancy Pelosi and Democrats booted Republican Marjorie Taylor Greene from her committee assignments in 2017 over comments she made years earlier on the Q movement on social media.",
    "Nancy Pelosi and Democrats then booted Republican Rep. Paul Gosar from his committee assignment for tweeting out an innocuous joke they claimed threatened Democrat AOC.",
    "Several other Democrats would have been impacted under this rule, such as Reps. Peter DeFazio of Oregon and Eddie Bernice Johnson of Texas, but they are retiring.",
    "The House Republican Conference already sets a term limit for committee leadership among its own members, but the Democratic Caucus does not.",
    "“This potential move by Republicans would have a seismic impact on the House and would be a huge breach of tradition,” Punchbowl claimed.",
    "Conservative voters better act now to pressure their party leaders or we will get more of the same in 2023.",
    "Kevin McCarthy comes from the same mold as Speaker John Boehner and Speaker Paul Ryan.",
    "That would be a tragedy for this country.",
    "He won’t allow this to happen.",
    "He won’t even impeach Biden.",
    "But don’t get your hopes up.",
    "Just watch."
  ]
}