{
  "id": 5342,
  "mediaId": 2730,
  "date": "2022-04-17",
  "headline": "Outgoing GOP Rep Says It Will Be 'Hard to Govern' Without a Large Republican House Majority",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2022/6/c6e66fbb-d44f-4c9d-890c-899051b5d8c5.jpg",
  "link": "https://townhall.com/tipsheet/landonmion/2022/04/17/outgoing-gop-rep-says-it-will-be-hard-to-govern-without-a-large-republican-house-majority-n2605978",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Landon Mion",
  "authorUrl": "https://townhall.com/tipsheet/landonmion/",
  "termIds": [
    0
  ],
  "sentences": [
    "Scott Applewhite\nOutgoing moderate GOP Rep. Fred Upton (MI) said Sunday that it will be difficult for the Republican Party to govern if the party does not have 230 seats in the House following the midterm elections, calling into question whether House Minority Leader Kevin McCarthy (R-CA) would have enough votes to become Speaker if the party does not reach that number.",
    "\"He doesn't have the votes that are there, because there's many of us that are very unhappy about the failure to hold Republicans accountable, while conservatives like me, Paul Gosar, and many others just constantly take the abuse by the Democrats,\" she continued.",
    "And last month, the minority leader said that he was not concerned about the possibility of another GOP representative becoming Speaker should Republicans take back the House.",
    "Upton responded, \"It will be very hard to govern for Republicans if we're under 230 knowing that we've got the MTG element that’s really not a part of a governing majority.\"",
    "\"If you're a minority leader the day of the election, you win, and you win the majority, you're probably going to be the Speaker,\" McCarthy told Punchbowl News at the time.",
    "Greene has previously suggested that McCarthy \"doesn't have the votes\" to become Speaker if Republicans regain control of the House following November's elections.",
    "Upton was asked on NBC's \"Meet the Press\" if McCarthy could represent a moderate like himself and someone like Georgia Republican Rep. Marjorie Taylor Greene.",
    "Host Chuck Todd then pressed Upton on if he believes McCarthy will not be the Speaker if Republicans have less than 230 seats in the House.",
    "McCarthy said Sunday on \"Fox News Sunday\" that he sees an \"opportunity\" to become Speaker if the GOP wins back the House in November.",
    "He was one of 10 House Republicans to vote to impeach former President Donald Trump following the Jan. 6, 2021, Capitol riot.",
    "He doesn't have the full support to be speaker,\" Greene said on Florida Rep. Matt Gaetz's \"Firebrand\" podcast in November.",
    "There are five vacant seats in the House, with four of them previously being held by Republicans.",
    "Upton announced earlier this month that he would be retiring at the end of his current term.",
    "\"They're not going to change the coach between the playoff and the Super Bowl.\"",
    "\"That's why this over-under number is so important,\" Upton explained.",
    "Currently, Republicans hold 209 House seats and Democrats have 221.",
    "\"We know that Kevin McCarthy has a problem in our conference.",
    "Upton said the minority leader could \"if he gets the margin.\"",
    "Source: AP Photo/J."
  ]
}