{
  "id": 536,
  "mediaId": 2664,
  "date": "2022-02-22",
  "headline": "Biden needs to stop seeking bipartisanship as Republicans abandon democracy: historian",
  "image": "https://www.rawstory.com/media-library/president-joe-biden.jpg?id=25792612&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/biden-needs-to-stop-seeking-bipartisanship-as-republicans-abandon-democracy-historian/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    2443,
    3246,
    4267,
    4905,
    5802,
    392,
    1126
  ],
  "sentences": [
    "Republicans immediately derided Biden’s pledge to nominate a Black woman to the Supreme Court – while Democratic leaders are hoping for bipartisan support; House Speaker Nancy Pelosi insists the nation needs a strong Republican party – meanwhile radicals like Marjorie Taylor Greene and Paul Gosar, who fantasize about committing acts of violence against Democrats, are embraced by fellow Republicans, proving they are not just a extremist fringe that has 'hijacked' the Party, as Pelosi suggested.\"",
    "\"Republicans could not be clearer about the fact that they consider Democratic governance fundamentally illegitimate, yet some establishment Democrats act as if politics as usual is still an option and a return to 'normalcy' imminent,\" he wrote.",
    "It’s the manifestation of a specific worldview that makes it nearly impossible to acknowledge the depths of Republican radicalization – a perspective that severely hampers the fight for the survival of American democracy,\" he wrote.",
    "Going back to the Obama era, McConnell has led the Republican Party in a strategy of near-total obstruction which he has pursued with ruthless cynicism,\" he wrote.",
    "President Joe Biden needs to stop seeking bipartisanship with Republicans as the GOP abandons democracy, historian Thomas Zimmer wrote in The Guardian on Tuesday.",
    "Zimmer noted Biden referred to GOP Leader Mitch McConnell (R-KY) as a \"man of honor\" during remarks at the National Prayer Breakfast.",
    "\"The distinct asymmetry in the way the two sides treat each other extends well beyond Biden and McConnell.",
    "Zimmer worried about the response to GOP anti-majoritarian rule by establishment Democrats.",
    "\"Biden’s publicly professed affinity is weirdly at odds with the political situation.",
    "\"No matter what they do, underneath they’re good guys, they’ll snap out of it.",
    "Zimmer wrote the statement provided a window into how Biden sees Republicans.",
    "He noted Biden recently said \"I actually like Mitch McConnell.\"",
    "Promise."
  ]
}