{
  "id": 5434,
  "mediaId": 2662,
  "date": "2022-04-16",
  "headline": "Barbara Boyd: It Looks Like the War Will Come Home for the Midterms",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/joe-biden-defends-his-sons-ukraine-dealings-he-did-not-do-a-single-thing-wrong-640x360-1.jpg",
  "link": "https://www.thegatewaypundit.com/2022/04/barbara-boyd-looks-like-war-will-come-home-midterms/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/joehoft/",
  "termIds": [
    5802,
    2765,
    2411,
    2107,
    4153,
    4591,
    5079,
    5071,
    2887,
    6672
  ],
  "sentences": [
    "The Atlantic has been a major purveyor of the Russiagate hoax and other defamation campaigns against Trump and others who they accuse of “wrong think.”\nMajor speakers included Anne Applebaum who writes for the Atlantic and is also a critical player in the globalist push to strengthen “democracy” against “autocrats’ –the current Manichean framework backed by the US nuclear arsenal for establishing a “New World Order.” Applebaum got exposed back in 2018 as a key player in the British Integrity Initiative, an organization funded by the British government and NATO to produce black propaganda against Russia and to sell the idea of a war with Russia to the American population.",
    "Obama is close fellow traveler of Cass Sunstein who worked in the Obama Administration on shutting down free speech on the internet under the rubric of preventing “disinformation.” Sunstein has argued for using the FBI to covertly enter internet chatrooms and steer the conversation in the “right direction.” That is what Obama means by “better angels”—covert actions by government actors for the proper “thought.”\nAll of this is a hysterical and defensive response to a citizenry which has had enough of the present rulers of this nation.",
    "There is a potential for a third American economic revolution once this aroused and awake population discovers the unique American System of economy –created and implemented by Alexander Hamilton, used fully again by Abraham Lincoln to win the Civil War and launch a scientific and industrial revolution in its wake, and employed against the oligarchy and its central bankers by Franklin Roosevelt in his war mobilization.",
    "In their infantile arrogance they have absolute disdain for the American population and aspire to turn this country more “European.”\nThe false claims cited by the NBC report include claims about impending chemical weapons attacks, about Russian plans to orchestrate a false flag in the Donbas to justify an invasion, about Putin’s advisors misinforming him, and about Russia seeking arms from China.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nNeo-Cons like Robert Kagan, Victoria Nuland’s husband, argue that re-discovering our role as the hegemon, the ruler of the world, means escalating in Ukraine and a direct war with Russia, a policy the British have been trying to sell to us for years.",
    "With respect to the Ukraine crisis itself, on April 6th, senior U.S. intelligence officials admitted to NBC News that much of the intelligence “leaked” and published to the world and the American public about the war in Ukraine is false or “low confidence” and based in the psywar mind games the British and American intelligence services imagine they are playing with Vladimir Putin.",
    "As we develop below, full-spectrum information warfare –fake narratives coupled with absolute censorship of opposing views and targeting of key individuals for harassment, social ostracism, and prosecution—psywar techniques which amount to an attempt at mind control—are the central part of their strategy, The same “strategy” is being used right now in Ukraine with lethal results.",
    "The AP leak about the midterms followed a week in which the premier prosecution of the Biden Justice Department, the so-called Gretchen Whitmer kidnapping plot, went down in flames when a jury in Michigan acquitted two of four defendants and could not reach a verdict on the other two once the trial judge allowed the defense to tell the jury about FBI entrapment in the case.",
    "Following this format, the New York Times Sunday Magazine on April 11th, published a long interview with Trump NSC traitor Fiona Hill which simply repeats every claim made in Russiagate without the qualification that all of these claims have been proven to be lies invented by the Clinton Campaign in conjunction with British and Obama Administration intelligence officials.",
    "Right on cue, Barack Obama danced fully back into public view last week, claiming the recent discovery that Russian and other “disinformation” is the major crisis of our time and, accordingly, his major preoccupation, and that it requires even more censorship and “help” for beleaguered and allegedly stupid Americans to properly frame their thoughts.",
    "Reposted with permission from Barbara Boyd\nOn April 9th, the Associated Press was leaked a story from the national security state which has the following narrative legend: Vladimir Putin will interfere in the 2022 U.S. midterm elections against the Democrats because of the Biden Administration’s support for Ukraine.",
    "Future historians will find, at the very least, that these Uniparty Washington politicians and their British intellectual masters– the ones who posture endlessly about Ukrainian bravery and supplying more arms, engineered the slaughter of the Ukrainian people while risking the nuclear obliteration of the human race.",
    "You can add to NBC’s staged confession, just about every major report alleging Russian atrocities against civilians in Ukraine, from the Mariupol hospital attack, to the alleged Bucha massacre which even the Pentagon refused to confirm, to the atrocity story du jour, the Kramatorsk railway station attack.",
    "Against this backdrop, with the revolt in the population only increasing in intensity and the apparent failure of every operation they have thrown against Trump and the millions of Americans who support him to date, it’s clear why Biden and the British needed and provoked the Ukraine war.",
    "None of this, of course, is noted by the so-called “newspaper of record.”\nBut none of this will work, if it is exposed and if Trump and his allies succeed in building a constituency for American System economics among the thousands of potential leaders who are now mobilizing themselves.",
    "To those who have followed this saga since the 2014 Ukraine coup, this leak means an operation by the national security state to minimize Democratic losses in the midterms while securing the election of Uniparty Republicans and crippling Donald Trump’s MAGA movement is already underway.",
    "Section 3 of the 14th Amendment which barred Confederates who previously served in the U.S. military, were federal officers or state officials from serving in public office unless the U.S. Congress removed their disability is the central legal peg for this concoction.",
    "The idea is that appeals to patriotism in the base coupled with a parade of Russian atrocities will forever recapture Trump’s voters for Washington or, at the least, by demoralizing Trump supporters, destroy the possibility of a Republican sweep in the midterms.",
    "Actual Nazis in Ukraine who key members of Congress and even Facebook condemned as the British and the CIA trained and funded for the purpose of running a long insurgency against Russia, are now hailed as the heroes of Mariupol, their actual headquarters.",
    "As the British House of Lords put it in their 2018 screed, “British Foreign Policy in a Shifting World Order,” the London centered modern British Empire could contain and handle Trump for one term, but all bets were off if Trump secured a second term.",
    "New York State Attorney General Letica James, who campaigned for her office almost solely on the claim that she would prosecute Trump is seeking $10,000 a day fines against Trump for alleged failures to cooperate in her parallel civil investigation.",
    "Domestically, the war furthers the “split” in the Republican party between those in Washington who seem to seek war almost by reflex and the base of the Party which responded enthusiastically to Trump’s call to end all of America’s forever wars.",
    "The initial effort against Cawthorn was blocked by a federal judge in North Carolina but the effort against Greene is now proceeding in a federal court in Georgia with a liberal federal judge who has “doubts” about the North Carolina ruling.",
    "Simultaneously, Manhattan DA Alvin Bragg announced that his investigation of Donald Trump on various state charges was proceeding, despite the resignation of the two mercenary prosecutors former DA Cyrus Vance brought in to create the case.",
    "Obama is hardly a newly serious student of the business of pushing lies and government created propaganda to the population, although his PR handlers attempted to portray him as a fascinated student of foreign disinformation techniques.",
    "So, resorting to the tried and true tactic of all failing empires throughout history, the British and their American satraps have manufactured a ”vile,” “demonic” and “foreign” enemy who the population should target with their rage.",
    "The lawfare Democrats are trying to use the same concocted reading of the 14th Amendment in these disqualification cases that they tried to use in Donald Trump’s second impeachment trial where they sought Trump’s disqualification.",
    "The problem is that the complete information warfare operation being waged by the United States, Britain, and the information warriors of Ukraine make it impossible for any neutral party to investigate or to ascertain the truth.",
    "When a University of Chicago student, Daniel Schmidt, asked Applebaum about the censorship of the Hunter Biden laptop story, she blew him off, saying she found the entire laptop “uninteresting” as a political or social issue.",
    "But most of all, the cascading inflation flowing from the Biden/Federal Reserve money printing, the Biden war on energy, and, now, the Ukraine sanctions has made them question whether they or their families can even survive.",
    "At the same time, the first outright acquittal of a January 6th defendant occurred in a bench trial in Washington, D.C., based on videos showing Capitol police waving the defendant, Matthew Martin, into the Capitol.",
    "As we have previously reported, the current NATO playbook says that “cognitive warfare” against both foreign enemies and domestic populations –open attempts at mind control –is the premier game in modern warfare.",
    "They know they were lied to about COVID and their kids suffer from psychological and learning difficulties both from the lockdowns and the decadent gender fluidity and other propaganda dominating the schools.",
    "As Abraham Lincoln famously said, you can’t fool all the people all the time, particularly with an aroused population declaring that they have had it with the current leaders of both parties in Washington.",
    "As Caitlin Johnstone documents over at Consortium News, the reason for this extraordinary confession seems to be to condition the population to cheer about being lied to as a necessary part of warfare.",
    "What can be said definitively is that those who provoked the war in Ukraine imagine that country’s future solely as a vassal state in a permanent war with Russia down to the last Ukrainian.",
    "That same New Jersey election also saw the victory of an unknown and unfinanced candidate, Ed Durr, over NJ Senate leader Steve Sweeney, the second most powerful politician in that state.",
    "NATO, in turn, is led by the British whose 77th Military Brigade, focused on perception management and psychological warfare has been operating on the ground in Ukraine since 2015.",
    "Liz Cheney appeared on CNN’s State of the Union on Sunday April 10th to proclaim that the January 6th Committee had enough evidence to refer Donald Trump for criminal prosecution.",
    "Representatives Madison Cawthorn of North Carolina, Marjorie Taylor Greene of Georgia, and, as of last week, Andy Biggs and Paul Gosar from Arizona, from running for re-election.",
    "Hill herself is an appropriate subject for investigation by John Durham as she is personal friends with MI6’s Christopher Steele, who authored the dirty dossier against Trump.",
    "The same is true of the Ukrainians and their allies in the State Department and in that part of the Ukrainian diaspora retaining their allegiance to the Nazi, Stepan Bandera.",
    "It is this revolt which produced the upsets in the 2021 Virginia governors’ race, and almost saw a Republican win the race for governor in the deep blue state of New Jersey.",
    "Bragg had previously expressed his discomfort about where the two clearly biased prosecutors were going and disagreed with their strategy, resulting in their resignations.",
    "He directly and successfully intervened there to ensure that his candidates for Attorney General and Secretary of State were not derailed by Republican turncoats.",
    "It is not accidental that the two doyens of Biden’s “foreign policy,” Jake Sullivan and Tony Blinken, are firmly in the grip of the European globalist agenda.",
    "The Michigan rally, and its significance in this battleground state produced hysterical press coverage in both the Washington Post and London’s Guardian.",
    "As with the Russiagate hoax, the British went all in to defeat Trump and have interfered in our domestic affairs far more than Russia could even imagine.",
    "Attempts to prosecute Donald Trump, both through the rogue January 6th Committee and through the ongoing investigations in New York are being geared up.",
    "They see rampant crime and what appears to be the deliberate targeted poisoning of the young by Fentanyl, a byproduct of the now open southern border.",
    "She didn’t tell Schmidt that she was a key figure in quashing the laptop story—a characteristic of almost all the people at Obama’s coming out party.",
    "Substantively advanced by Lyndon LaRouche’s writings and discoveries, the American System is the unique and only key to rapid economic recovery now.",
    "Both rags claimed that a plot by Trump was underway to place compliant citizens into the election machinery in order to rig the midterm elections.",
    "Obama staged his public coming out party through a conference on disinformation at the University of Chicago, cosponsored by Atlantic Magazine.",
    "In North Carolina, Trump’s endorsed candidate for the U.S. Senate, Ted Budd, has come from behind and is now the front runner in the state.",
    "Before his current gig at the NSC, Sullivan worked for Macro Advisory Partners, a British firm led by the former head of MI6, John Sawers.",
    "This report was reposted with permission from Barbara Boyd – the original piece was reported at LaRouche PAC\nSummary\nRecent Posts\nContact",
    "The hyperbolic claim is that by challenging the election, the lawmakers participated in an “insurrection” against the U.S. government.",
    "Put simply, rev up popular rage at Putin and then run a repeat of all of the Russiagate lies about Trump in this changed context.",
    "Central to the psywar strategy is the idea that humans exhibit fixed and static behaviors which can be predicted and controlled.",
    "Not logistics in depth, not strong economies, not superior culture and intellect, the actual sources of victories in war.",
    "Steele’s main subsource Ihor Danchenko, now indicted by Durham, worked closely with Hill at the Brookings Institute.",
    "Patrick Lawrence has documented this mind control strategy straight out of the NATO manual announcing the doctrine.",
    "Both rags have been central to the effort to destroy Trump and his MAGA movement ever since the 2016 election.",
    "Since the current NATO countries display none of these traits, they have resorted to fantasy and fairy tales.",
    "Matt Taibbi has listed all the recent pronouncements of this madness from Washington over at Substack.",
    "At the same time a campaign began against Attorney General Merrick Garland by Democratic activists.",
    "It seems that accepting bushels of lies from your own government is part of being a worthy citizen.",
    "The missile utilized is exclusive to the Ukrainian arsenal and was fired from Ukrainian territory.",
    "LaRouche PAC covered the Ukrainian side of the operations against Trump extensively back in 2019.",
    "Senator who supported Donald Trump’s challenge to the electoral college vote on January 6, 2021.",
    "They believe the country is being deliberately destroyed by Washington and they have to step up.",
    "They called for his firing because he has not prosecuted Donald Trump already for January 6th.",
    "All across the country, citizens are getting active in politics, many for the first time.",
    "Recent surveys posit that “food stamps” is the most popular search term on the internet.",
    "That is not to say that Russians in Ukraine have not committed civilian atrocities.",
    "LaRouche PAC covered this topic extensively back in 2019 in a three part series.",
    "On April 9th, Trump’s rally in Selma, North Carolina again attracted thousands.",
    "The disqualification effort is set to expand to any U.S. Representative or U.S.",
    "Also in Michigan on April 2nd, Donald Trump held a rally involving thousands.",
    "You can read LaRouche PAC’s coverage of the Integrity Initiative here.",
    "Barack Obama will be the public face for popularizing this operation.",
    "They must all be changed or defeated if this nation is to be saved.",
    "Other aspects of this operation are also rapidly becoming visible.",
    "It is well worth paying the money to get beyond his paywall.",
    "In addition, efforts are underway to disqualify sitting U.S.",
    "Blinken is famously a francophone and committed globalist.",
    "They are blocking any attempt at negotiations for peace.",
    "They know the November 2020 election was rigged.",
    "Lincoln is right because humans are not beasts.",
    "Joe Biden’s coterie of fools can’t sell it.",
    "They can change their habits and thoughts.",
    "Hill introduced Danchenko to Steele.",
    "The latter is exemplary.",
    "War is like that."
  ]
}