{
  "id": 5486,
  "mediaId": 2672,
  "date": "2022-04-22",
  "headline": "‘I Don’t Remember’: Marjorie Taylor Greene Comes Down With Case of Jan. 6 Amnesia While Under Oath",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/AP22112558456391c.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/marjorie-taylor-greene-testimony-jan-6-protests-1341795/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Bort",
  "authorUrl": "https://www.rollingstone.com/author/ryan-bort/",
  "termIds": [
    3246,
    5461,
    4905,
    2013,
    1965,
    2187
  ],
  "sentences": [
    "The conspiracy theorist from Georgia has long engaged with some of the most extreme corners of conservative media, pushing lies about Democratic colleagues, hate speech, and calls for violence, and on Friday she seemed well aware of how bad her record looks when it’s removed from the cesspool of right-wing demagoguery on the internet and laid bare in a court of law.",
    "Greene: No that’s not accurate pic.twitter.com/9aKJqZkodl\n— Acyn (@Acyn) April 22, 2022\nGreene also flat-out denied that she said she believes in QAnon, despite plenty of evidence to the contrary, or that she said House Speaker Nancy is a traitor to the United States, despite the fact that she has explicitly described her as such.",
    "Greene also alluded to history last October when she defended the Capitol rioters, referring to how the Declaration of Independence says to “overthrow tyrants.”\nMarge Greene has no memory of saying, “this is our 1776 moment” in a Newsmax interview on J5, and no memory of talking to Lauren Boebert about that.",
    "That’s pretty much all I remember.”\n“Pretty much, but your testimony as you sit here today under oath is that you didn’t talk to anybody in government about the fact that there were going to be large protests in Washington on Jan. 6?” Fein asked.",
    "— CSPAN (@cspan) April 22, 2022\nRolling Stone reported in October that Greene was one of several Republican lawmakers who participating in the organization of the rally near the White House that preceded the Capitol attack.",
    "“I don’t remember.”\nShe was asked if she talked to Rep. Andy Biggs (R-Ariz.)\n“I don’t remember.”\nShe was asked if she talked to Rep. Paul Gosar (R-Ariz.)\n“Sorry, I don’t remember.”\nWhat about anyone in the White House?",
    "Greene has consistently and very publicly pushed conspiracy theories about the 2020 election, while rilling up her supporters to descend on Washington, D.C., ahead of the election’s certification last Jan. 6.",
    "The court appearance follows U.S. District Court Judge Amy Totenberg’s ruling earlier this week that a case seeking to disqualify Greene from office for “engaging in insurrection or rebellion” could proceed.",
    "The topic came up on Friday, of course, and instead of denying her involvement, Greene repeatedly said she didn’t recall any conversations she might have had regarding what was to come on Jan. 6.",
    "“Is it fair to say that from Election Night until January 6th, your personal opinion and your wish was that Congress not certify Joe Biden as the winner of the 2020 election?” she was asked.",
    "I’m interested in that you said she’s a traitor to our country.”\nQuestion to Rep. Marjorie Taylor Greene: \"In fact, you think that Speaker Pelosi is a traitor to the country, right?\"",
    "Greene was confronted with several of her social media posts on the issue while on the stand, but she was hesitant to take ownership of the views she’s pushed in the past.",
    "It stands to reason that she may been refraining from admitting to copping to her comments of fear that networks would “click and cut and paste” them for what they are.",
    "Greene in media appearances earlier this week seemed worried that the media would zero in on specific clips and sound bites from her testimony on Friday.",
    "“We were mostly reading information about election fraud and people signed affidavits what they’d witnessed with voter fraud, and preparing to object.",
    "Greene ultimately said of Pelosi that by “not securing the border that violates her oath of office,” but declined to admit she called her a traitor.",
    "Question: Is it fair to say that from election night until January 6th, your personal opinion and your wish was that Congress not certify Joe Biden?",
    "“They’re going to click and cut and paste so they can sell a lie on their networks every night,” she said during an appearance on One America News.",
    "“I don’t remember.”\nGreene also said she didn’t remember calling the attack “our 1776 moment” on Newsmax the day before the attack on the Capitol.",
    "(@RonFilipkowski) April 22, 2022\nGreene talked on Friday about how much she and the people of Georgia appreciate American history.",
    "She may not have remembered the interview, but she seemed to feel the same about Jan. 6 in the months following the attack.",
    "“I don’t have the history books in front of me,” Greene said before wondering about which book he was speaking.",
    "She was first asked if she talked to anyone in the government about whether there would be protests on Jan. 6.",
    "Marjorie Taylor Greene is testifying under oath on Friday about her alleged role in the events of last Jan. 6.",
    "“Fair enough,” Ron Fein, the attorney representing Free Speech for People, which brought the case, replied.",
    "Fein asked her whether the Declaration of Independence refers to King George as a tyrant.",
    "“I don’t remember.”\nDid she hear anyone mention the potential for violence on Jan. 6?",
    "Greene: \"I'm not answering that question…I haven't said that.\"",
    "pic.twitter.com/JwDqq43Low\n— Ron Filipkowski ????",
    "“The Declaration of Independence,” he said.",
    "“I’m not interested in her oath of office.",
    "“No, that’s not accurate,” she replied.",
    "Q: \"Put up plaintiff's exhibit 5.\"",
    "“I don’t remember,” she said."
  ]
}