{
  "id": 561,
  "mediaId": 2752,
  "date": "2022-02-25",
  "headline": "Arizona Gov Happy That Q-Anon Humping Racist Isn't A Democrat, At Least",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTQyNzcyOC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2NDgxNDQ3M30.VfTVU29W58n4TOMeKwCROEBZ7inRQryKLCZ0w8JyNHI/img.jpg?width=1200&coordinates=0%2C53%2C0%2C168&height=600",
  "link": "https://www.wonkette.com/arizona-governor-happy-that-q-anon-humping-racist-isn-t-a-democrat-at-least",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gary Legum",
  "authorUrl": "https://www.wonkette.com/u/gary_legum",
  "termIds": [
    0
  ],
  "sentences": [
    "Rogers has spent a great deal of her time since then hitting all the wingnut Stations of the Cross: questioning the integrity of the presidential election, praising the January 6 rioters, appearing on the podcast of sentient infected skin tag Steve Bannon, and cuddling up to anti-semitic Holocaust-denying racist Nick Fuentes and his \"groyper\" army of anti-semitic racist Holocaust deniers.",
    "Doug Ducey, a man who vaguely resembles Charles Grodin if Grodin had been made of Legos, is totes fine with embracing the Q-Anon branch of his party so long as he gets a few legislative wins he can tout whenever he runs for president.",
    "In fact, Rogers is speaking Friday at a Florida conference organized by Fuentes, in keeping with the tradition of lunatic white nationalist Arizona lawmakers giving talks to the organization.",
    "Nope, not the one who wanted to arrest an entire election board for refusing to investigate whether a bunch of ballot-eating chickens self-immolated to cover up their crime.",
    "None of this answers the question, which was essentially whether Ducey regrets empowering Wendy Rogers, even if she did give his party a slim 16-14 majority in the Senate.",
    "Doug Ducey can't bring himself to denounce a prominent insane female Q-Anon-humping politician in the state government, you might need multiple tries to guess which one!",
    "In 2020 a PAC that Ducey helped start spent about half a million dollars to help Rogers beat a Democrat named Felicia French for a seat in the Arizona state Senate.",
    "A reporter this week asked Ducey if he is still happy with his PAC's investment in Rogers, given her open embrace of people who are A Bit Much, Even for Arizona.",
    "That leaves Wendy Rogers, the lady with the Robert E. Lee ornament on her Christmas tree and the children being eaten by cannibal Democrats in her heart.",
    "For her part, Rogers went right out and proved the reporter's point that she's infested with brainworms:\nSoros!",
    "Nor is it the lady determined to make sure that the children do not engage in Marxist sex, whatever that is.",
    "Something fun about Arizona (state motto: The Taint of Utah) is that if we told you that Republican Gov.",
    "Oh sure, Republicans are big on funding the social safety net, this doesn't sound disingenuous at all.",
    "You'll never guess what he said:\n\"What I need as a governor are governing majorities.\"",
    "(Presumably no missionary position, the opiate of the masses of sexual positions.)",
    "\"And she's still better than her opponent, Felicia French.\"",
    "\"So that's what I wanted to do, is move my agenda forward.",
    "\"So that I can pass dollars into our social safety net.\"",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "I'm proud of what we've been able to accomplish.\"",
    "How often would you like to donate?",
    "Any old racist port in a storm!",
    "(Last year it was Paul Gosar.)",
    "Help us pay Gary.",
    "Ah, there it is.",
    "Hey it's Gary!",
    "Drink!"
  ]
}