{
  "id": 5693,
  "mediaId": 4040,
  "date": "2022-04-22",
  "headline": "Marjorie Taylor Greene Says Legal Challenge to Take Her Off the Ballot Is a ‘Globalist’ Ploy for a ‘One World Government’",
  "image": "https://files.rightwingwatch.org/uploads/Marjorie-Taylor-Greene-Alex-Jones-e1648835460954.jpg",
  "link": "https://www.rightwingwatch.org/post/marjorie-taylor-greene-says-legal-challenge-to-take-her-off-the-ballot-is-a-globalist-ploy-for-a-one-world-government/",
  "mediaOutlet": "Right Wing Watch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristen Doerer",
  "authorUrl": "https://www.rightwingwatch.org/post_author/kristen-doerer/",
  "termIds": [
    2187,
    2969,
    5292,
    5280,
    1598,
    6175
  ],
  "sentences": [
    "In preparation, she spent the day prior with Alex Jones—the radical conspiracy theorist who is under investigation for his role in the Jan. 6 insurrection—insisting that the legal challenge to disqualify her candidacy is all part of the “globalist” ploy for a “One World Government.”\nGeorgia voters and a supporting legal group, Free Speech For People, filed the challenge against Greene, winning a victory last week when a federal judge ruled that the case could proceed.",
    "Greene claimed that the attorney group lodging the challenge “is totally funded by George Soros dark-money groups.”\n“They hope that we have a civil war,” Jones said, adding that it was the “devil system.”\nEarlier in the show, Jones also compared Greene’s hearing to his own legal troubles stemming from comments he made about the 2012 Sandy Hook mass shooting.",
    "In addition to being investigated by both the House select committee and the Department of Justice for his role in instigating the Jan. 6 attack on the Capitol, Jones is facing multiple defamation lawsuits after he called the 2012 Sandy Hook mass shooting a “hoax” and accused the parents mourning the death of their children of being paid actors.",
    "In making their case, lawyers for Free Speech For People point to evidence like a Jan. 5 tweet by Greene calling Jan. 6 a “1776 moment.” The judge on the case will make a recommendation to Georgia Secretary of State Brad Raffensperger, who will then decide whether Greene remains on the ballot.",
    "“Well, I’m dealing with the same thing where I was found in default in a case of not giving them documents, but they have all the documents, and then I’m supposed to have a jury trial about how guilty I am but were not even allowed to speak at that trial,” Jones protested.",
    "“So these globalists that are completely trying to destroy our country and move us into their global economy and their One World Government to where NATO is telling us what, who they should go to war with, and the UN is running the entire world.",
    "At the heart of the case is a provision in the 14th Amendment that forbids any member of Congress who has “engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof” from serving in office.",
    "“That is their big lie.”\nJones agreed that the challenge was “so villainous,” declaring, “this is next level tyranny.”\n“Clearly the globalists want to implode the country, Cloward and Piven to make us dependent and take control.",
    "Rep. Marjorie Taylor Greene testifies in a Georgia courtroom today in a hearing to determine whether the far-right congresswoman can be barred from running for reelection for her role in the Jan. 6 insurrection.",
    "That’s why they’re coming after me, and they’re coming after Andy Biggs, Paul Gosar, they went after Madison [Cawthorn].”\nAnd who does Greene believe is behind it?",
    "“How do you think the Democrats and the deep state are going to try to stop this populist peaceful uprising?”\n“They don’t want me in there,” Greene said.",
    "On Jones’ “InfoWars” Thursday, Greene insisted that the hearing was a “show trial” that has “nothing to do with Jan. 6,” and that she did nothing wrong.",
    "The provision was passed years after the Civil War to prevent former Confederates from returning to their seats in Congress.",
    "Jones failed to turn over documents to the judge in one of those cases and failed to show up to a hearing.",
    "And all the polls show a total collapse and realignment of Republicans,” Jones said.",
    "They know to achieve these goals they have to get the strongest fighters out.",
    "Toward the end of the show, Greene expressed her admiration of Jones.",
    "“I love those T-shirts, ‘Alex Jones was right,’” Greene said.",
    "“They know there was no insurrection,” she told Jones.",
    "“I need to get one of those.”",
    "This is what Democrats want."
  ]
}