{
  "id": 5760,
  "mediaId": 2716,
  "date": "2022-04-18",
  "headline": "House GOP reportedly considering term limits for all committee leaders",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1650289526/GettyImages-1239809671.jpg",
  "link": "https://theweek.com/congress/1012664/house-gop-reportedly-considering-term-limits-for-all-committee-leaders",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    2176,
    4617,
    3115,
    3266,
    392,
    1126,
    1477
  ],
  "sentences": [
    "But traditional dynamics in the House have already begun to shift — consider how Democrats kicked Rep. Majorie Taylor Greene (R-Ga.) off her committees over past comments, or censured and removed Rep. Paul Gosar (R-Ariz.) from his assignments after he promoted an animated video depicting violence against Democrats, including President Biden.",
    "House Republicans are reportedly considering imposing term limits for all committee chairs and ranking members should the party take back the lower chamber in November, Punchbowl News reports.",
    "That system has been seen and utilized by Democrats as an \"especially powerful tool for minority lawmakers, giving them access to committee gavels or ranking members posts.\"",
    "But Democrats don't abide by those limitations, and any such change in the chamber rules package would \"drastically alter the makeup of the House,\" Punchbowl News writes.",
    "The lawmakers are the top Democrats on the Financial Services, Homeland Security, Energy and Commerce, Armed Services, and Small Business Committees, respectively.",
    "The Republican term limits plan would also deal a \"huge blow\" to the chamber's seniority system, \"a bedrock of internal House politics,\" Punchbowl News writes.",
    "), Frank Pallone (N.J.), Adam Smith (Wash.), and Nydia Velázquez (N.Y.) would all be affected, among others for whom the change would alter future prospects.",
    "For example, should a GOP majority actually enact this plan, Democratic Reps. Maxine Waters (Calif.), Bennie Thompson (Miss.",
    "Republican members are already limited (by their own doing) to three consecutive terms at the helm of any committee."
  ]
}