{
  "id": 6072,
  "mediaId": 2629,
  "date": "2022-04-17",
  "headline": "Is There Any Way To Isolate Political Extremists? Yes",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNzA0MzMzNi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2ODU5MTMwNH0.a6BE2efpjlrdWneecyIOxp8Ud4wBZGD_qrsk_Si7SRU/img.jpg?width=1200&coordinates=0%2C140%2C0%2C140&height=600",
  "link": "https://www.nationalmemo.com/ranked-choice-voting",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mona Charen",
  "authorUrl": "https://www.nationalmemo.com/u/monacharen",
  "termIds": [
    2443,
    2187,
    4431,
    4596,
    5252,
    5690,
    5699,
    3514,
    3946
  ],
  "sentences": [
    "Unable to control fundraising due to the rise of small-dollar, internet contributions, and stripped even of the formerly coveted power of attaching earmarks to legislation, the parties, as Yuval Levin has argued, are mere soapboxes that permit members to flaunt their personal brands.",
    "Murkowski could uphold the norm of confirming the other party's qualified nominee and not fear a Trumpist primary challenger because Alaska now holds an open primary in which anyone from any party can participate.",
    "Not only does the ranked-choice system disempower party extremists; it also discourages candidates from savage personal attacks, the persistence of which arguably keeps some fine people out of politics altogether.",
    "In Virginia, the Republican Party used a ranked-choice system to choose its gubernatorial candidate in 2021, with the result that Glenn Youngkin rather than Amanda Chase (\"Trump in heels\") secured the nomination.",
    "In the 2020 presidential primaries, for example, progressive activists pushed candidates to impose a moratorium on deportations, to abolish private health insurance and to ban fracking, among other demands.",
    "The term \"primary\" became a verb only in the last decade or so, as the power of the party zealots became a cudgel to use against any member who even considered compromising with the other party.",
    "As Katherine Gehl, founder of the Institute for Political Innovation, notes, about 10 percent of voters (those who vote in primaries) determine the outcome of 83 percent of congressional races.",
    "She's a repellent clown whose presence on the national stage has yielded nothing but degradation — except for the guffaw she afforded us when denouncing Nancy Pelosi's \"Gazpacho police.\"",
    "There's one more factor aggravating the lurch to extremism, at least among Republicans (Democrats have different rules), and that's the winner-take-all system in presidential primaries.",
    "The party duopoly empowers the most extreme voters and leaves the vast middle unrepresented and feeling that in general elections they must choose the lesser of two evils.",
    "And even among the members who probably do know the difference between the Nazi secret police and a summer soup, there are alarming numbers who are extremist-adjacent.",
    "There are, for example, more sitting GOP congressmen who voted not to certify the 2020 election than there are Republicans who voted for a resolution to support NATO.",
    "Among the three GOP senators who voted to confirm Ketanji Brown Jackson to the Supreme Court, only one is up for reelection in 2022 — Lisa Murkowski of Alaska.",
    "And because primary voters tend to be more ideological and extreme than others, candidates pander to them to get elected and then to remain in office.",
    "It's possible, but then again, one reform that seems to be getting traction is ranked-choice voting (also known as instant runoff elections).",
    "If not, the bottom polling candidate is dropped, and the second choices on ballots are distributed, and so on until someone has a majority.",
    "It's already the law in Alaska and Maine for state, congressional, and presidential contests and has been adopted by more than 20 cities.",
    "In New York City, predictions that the city's 5.6 million voters would find the ranked-choice system confusing were not borne out.",
    "To read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate webpage at www.creators.com.",
    "While the Democratic Party hasn't lost its bearings in the way the Republican Party has, it is skewed by its own zealots.",
    "Her colleagues in the House include Paul Gosar and Matt Gaetz and Lauren Boebert and Louie Gohmert and, sigh, many more.",
    "There were no differences among ethnic groups in understanding the system, and the winner was a moderate former cop.",
    "Turnout was up compared with the last contested mayoral primary, and 95 percent of voters said the system was easy.",
    "There are many different approaches to ranked-choice voting, and experimentation will determine which is best.",
    "Rather than forming, directing and discipling their members, these institutions have become hollow shells.",
    "Her most recent book is Sex Matters: How Modern Feminism Lost Touch with Science, Love, and Common Sense.",
    "In 2016, Donald Trump lost Iowa and then won New Hampshire with 35 percent of the vote.",
    "But even with the small sample we have, we can judge that the incentives seem better.",
    "Those issues weren't top of mind for average Democrats, let alone for average voters.",
    "In the pre-Internet era, our political parties seemed to be bulwarks of stability.",
    "Mona Charen is policy editor of The Bulwark and host of the Beg to Differ podcast.",
    "The two-party system has not proven to be a solid foundation for democracy.",
    "The four candidates who win the most votes go on to the general election.",
    "There is probably no easy cure for the Marjorie Taylor Greene phenomenon.",
    "A solid majority, 57 percent, was divided among five other candidates.",
    "If one candidate gets over 50 percent, he or she is the winner.",
    "So, are we doomed to be at the mercy of the mad and bad?",
    "Democrats are not immune to the extremism virus either.",
    "But that has long since ceased to be the case.",
    "And she has lots of company.",
    "Time to disarm the crazies.",
    "Voters rank their choices.",
    "ranked choice voting"
  ]
}