{
  "id": 6109,
  "mediaId": 2732,
  "date": "2022-04-17",
  "headline": "Mona Charen: How to disarm the crazies",
  "image": "",
  "link": "https://triblive.com/opinion/mona-charen-how-to-disarm-the-crazies/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mona Charen",
  "authorUrl": "https://triblive.com/author/mona-charen/",
  "termIds": [
    2443,
    4431,
    4596,
    5690,
    5252,
    3514,
    3246,
    1126,
    392
  ],
  "sentences": [
    "Unable to control fundraising due to the rise of small-dollar, internet contributions, and stripped even of the formerly coveted power of attaching earmarks to legislation, the parties, as Yuval Levin has argued, are mere soapboxes that permit members to flaunt their personal brands.",
    "She’s a repellent clown whose presence on the national stage has yielded nothing but degradation — except for the guffaw she afforded us when denouncing Nancy Pelosi’s “Gazpacho police.”\nAnd she has lots of company.",
    "Not only does the ranked-choice system disempower party extremists; it also discourages candidates from savage personal attacks, the persistence of which arguably keeps some fine people out of politics altogether.",
    "In Virginia, the Republican Party used a ranked-choice system to choose its gubernatorial candidate in 2021, with the result that Glenn Youngkin rather than Amanda Chase (“Trump in heels”) secured the nomination.",
    "In the 2020 presidential primaries, for example, progressive activists pushed candidates to impose a moratorium on deportations, to abolish private health insurance and to ban fracking, among other demands.",
    "The term “primary” became a verb only in the last decade or so, as the power of the party zealots became a cudgel to use against any member who even considered compromising with the other party.",
    "There’s one more factor aggravating the lurch to extremism, at least among Republicans (Democrats have different rules), and that’s the winner-take-all system in presidential primaries.",
    "As Katherine Gehl, founder of the Institute for Political Innovation, notes, about 10% of voters (those who vote in primaries) determine the outcome of 83% of congressional races.",
    "The party duopoly empowers the most extreme voters and leaves the vast middle unrepresented and feeling that in general elections they must choose the lesser of two evils.",
    "And even among the members who probably do know the difference between the Nazi secret police and a summer soup, there are alarming numbers who are extremist-adjacent.",
    "There are, for example, more sitting GOP congressmen who voted not to certify the 2020 election than there are Republicans who voted for a resolution to support NATO.",
    "And because primary voters tend to be more ideological and extreme than others, candidates pander to them to get elected and then to remain in office.",
    "It’s possible, but then again, one reform that seems to be getting traction is ranked-choice voting (also known as instant runoff elections).",
    "Her books include “Do-Gooders: How Liberals Harm Those They Claim to Help — and the Rest of Us.”\nCategories: Mona Charen Columns | Opinion",
    "It’s already the law in Alaska and Maine for state, congressional and presidential contests and has been adopted by more than 20 cities.",
    "In New York City, predictions that the city’s 5.6 million voters would find the ranked-choice system confusing were not borne out.",
    "While the Democratic Party hasn’t lost its bearings in the way the Republican Party has, it is skewed by its own zealots.",
    "Her colleagues in the House include Paul Gosar and Matt Gaetz and Lauren Boebert and Louie Gohmert and, sigh, many more.",
    "There were no differences among ethnic groups in understanding the system, and the winner was a moderate former cop.",
    "A syndicated columnist since 1987, she has worked in the White House under President Reagan and at National Review.",
    "Turnout was up compared with the last contested mayoral primary, and 95% of voters said the system was easy.",
    "Rather than forming, directing and discipling their members, these institutions have become hollow shells.",
    "In the pre-internet era, our stable political parties seemed to be bulwarks of stability.",
    "Those issues weren’t top of mind for average Democrats, let alone for average voters.",
    "In 2016, Donald Trump lost Iowa and then won New Hampshire with 35% of the vote.",
    "The two-party system has not proven to be a solid foundation for democracy.",
    "There is probably no easy cure for the Marjorie Taylor Greene phenomenon.",
    "A solid majority, 57%, was divided among five other candidates.",
    "So, are we doomed to be at the mercy of the mad and bad?",
    "Democrats are not immune to the extremism virus either.",
    "Mona Charen is policy editor of TheBulwark.com.",
    "But that has long since ceased to be the case.",
    "Time to disarm the crazies."
  ]
}