{
  "id": 6255,
  "mediaId": 2699,
  "date": "2022-04-17",
  "headline": "GOP Lawmaker: Republican Party in ‘Troubled Waters’ Due to MTG and Lauren Boebert",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_720,w_1280,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1650216336/meet-press_34_adxb7n",
  "link": "https://www.thedailybeast.com/rep-fred-upton-says-republican-party-in-troubled-waters-due-to-mtg-and-lauren-boebert?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Justin Baragona",
  "authorUrl": "https://www.thedailybeast.com/author/justin-baragona",
  "termIds": [
    0
  ],
  "sentences": [
    "The Michigan congressman was also one of only 13 House Republicans to vote for President Joe Biden’s $1.2 trillion infrastructure plan last year, prompting Greene to publicly target him as an “American job & energy killer.” Upton would later share terrifying voice mails in which callers labeled him a “fucking piece of shit traitor” while wishing death upon his family.",
    "Are we going to be over or under 230 [House Republicans]?”\nTodd then wondered aloud if Upton felt that McCarthy might not even be elected speaker if the GOP takes the majority, considering that a number of pro-Trump lawmakers have already expressed reservations about his leadership.",
    "Appearing on NBC’s Meet the Press, the conservative lawmaker said that while he does believe the House is going to flip to Republicans after the midterm elections, he doesn’t think “it’s going to be this wild swing” and that the GOP isn’t going to have an overwhelming majority.",
    "Earlier this month, Upton announced he would retire rather than seek reelection, joining a growing list of GOP House members who voted to impeach former President Donald Trump over the Jan. 6 insurrection who’ve since decided to exit Congress.",
    "While acknowledging that Congress has always “wild types of members” among its ranks, Upton indicated that Greene, Boebert, and Rep. Paul Gosar (R-AZ)—who was formally censured last year for sharing a violent video—are in a class of their own.",
    "NBC News anchor Chuck Todd eventually asked Upton if he felt House Minority Leader Kevin McCarthy could “both represent you and Marjorie Taylor Greene” if he were to become House speaker, prompting the congressman to cast serious doubts.",
    "Rep. Fred Upton (R-MI) worried on Sunday morning that the Republican Party is currently in “troubled waters” because of the growing influence of far-right conspiracists such as Congresswomen Lauren Boebert and Marjorie Taylor Greene.",
    "“It will be very hard to govern for Republicans if we’re under 230, knowing that we’ve got the MTG element that’s really not a part of a governing majority,” Upton responded.",
    "“I don’t think we’ve had as many folks in that sort of wing of the party elected as we have before, but I think they’re very popular back at home,” he sighed.",
    "“Troubled waters, I guess you could say, and that’s why the margin is going to be so [close],” Upton replied.",
    "“Right now, look, [House Speaker] Pelosi has got the votes, particularly with the use of the proxy vote.",
    "She’s not going to lose a vote, and I don’t think she really has the last year and a half.",
    "“I mean, what does that tell you about the Republican Party?” Todd pressed.",
    "“That’s why this over/under number is so important.",
    "“He can if he gets the margin,” Upton said.",
    "We’re not going to have proxy votes.",
    "Kevin has made that very clear.”"
  ]
}