{
  "id": 7358,
  "mediaId": 2664,
  "date": "2022-04-07",
  "headline": "Two more GOP ‘insurrectionists’ face ballot challenges as voters seek to disqualify them from office",
  "image": "https://www.rawstory.com/media-library/rep-paul-gosar-r-az.jpg?id=27365744&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/paul-gosar-andy-biggs-insurrection/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    2426,
    2443,
    2765,
    5399,
    4006,
    1126,
    1433,
    5949
  ],
  "sentences": [
    "All candidates in Arizona must file nomination papers with the Secretary of State that requires they declare they “will be qualified at the time of election to hold the office the person seeks.” According to the Free Speech for the People group, to enforce that requirement, “any elector” may challenge a candidate’s nomination “for any reason relating to qualifications for the office sought as prescribed by law.” That is the rule under which they are issuing the suits.",
    "\"The voters are represented by Free Speech For People, a nonpartisan, non-profit legal advocacy organization with constitutional law expertise, which is serving as co-lead counsel in the matter, alongside the Tempe-based election law firm Barton Mendez Soto and the New York-based firm Emery Celli Brinckerhoff Abady Ward & Maazel,\" the group said.",
    "In the case of Cawthorn, U.S. District Judge Richard E. Myers II claimed that The Amnesty Act of 1872 eliminated the section of the law by declaring \"all political disabilities imposed by the third section\" of the 14th Amendment were \"hereby removed from all persons whomsoever.\"",
    "Activists have challenged whether Rep. Madison Cawthorn (R-NC) can run for reelection after his alleged participation in the Jan. 6 attempt to stop the certification of the 2020 election and overthrow the result for President Donald Trump.",
    "To pass an amendment to the Constitution, the document outlines, \"Congress may submit a proposed constitutional amendment to the states, if the proposed amendment language is approved by a two-thirds vote of both houses.",
    "The Amnesty Proclamation of December 1863 gave blanket pardons to all those who had not held a Confederate civil office, would sign the oath of allegiance to the United States and who hadn't abused prisoners.",
    "NOW WATCH: GOP lawmaker mocked for his murder analogy during hearing on Congress members owning stocks\nGOP lawmaker mocked for his murder analogy during hearing on Congress members owning stocks",
    "While The Amnesty Act may have given an agreed-upon pass to Confederate Soldiers, the legal argument is that without amending the 14th Amendment, the act technically is unconstitutional.",
    "Amendments proposed by Congress or convention become valid only when ratified by the legislatures of, or conventions in, three-fourths of the states (i.e., 38 of 50 states).\"",
    "Congress must call a convention for proposing amendments upon application of the legislatures of two-thirds of the states (i.e., 34 of 50 states).",
    "The problem that Cawthorn, and now Gosar and Biggs, will likely face is that there can't be an amendment to the Constitution by a law alone.",
    "There are three lawsuits that were filed on Thursday over the Republican members' alleged participation in the Jan. 6 attack.",
    "The argument is that a clause in the 14th Amendment stops “insurrectionists” from running for Congress.",
    "So, the question is whether a judge in another district court would rule differently.",
    "Now Reps. Andy Biggs (R-AZ) and Paul Gosar (R-AZ) are getting the same challenge."
  ]
}