{
  "id": 7362,
  "mediaId": 2520,
  "date": "2022-04-02",
  "headline": "'Nick's got a problem with his mouth': Rep. Paul Gosar seeks distance from white nationalist",
  "image": "https://www.gannett-cdn.com/presto/2021/11/14/PPHX/babbc096-e588-4992-b8ea-a2ae86463af2-cent02-7fwcrs3x3yc2282ghle_original.jpg?crop=2399,1349,x1,y242&width=2399&height=1349&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/04/02/rep-paul-gosar-seeks-distance-white-nationalist-nick-fuentes/7252224001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald J. Hansen",
  "authorUrl": "https://www.azcentral.com/staff/2647673001/ronald-j-hansen/",
  "termIds": [
    2187,
    1811,
    2443,
    4039,
    4066,
    5399,
    1126,
    340,
    6488
  ],
  "sentences": [
    "In addition to Gosar's video appearance, Rep. Marjorie Taylor Greene, R-Ga., appeared in person at AFPAC, bringing a fresh round of questions about Republicans condoning white nationalism to House Minority Leader Kevin McCarthy, R-Calif.\nMcCarthy reportedly discussed the issue with Greene after the February conference, only to be blindsided this week by comments from Rep. Madison Cawthorn, R-N.C., suggesting in a podcast interview that unnamed GOP members had invited him to cocaine-fueled orgies in Washington.",
    "Gosar's rhetorical shift comes as Republicans on Capitol Hill sense political momentum in their bid to retake one or both chambers of Congress in the midterm elections, but are also battling controversies that distract from their attacks on President Joe Biden and Democrats over inflation, gas prices, illegal immigration at the southern border and other matters.",
    "Supreme Court won't let Arizona voters weigh in on tax cut Brnovich takes election manual fight with Hobbs to court Karrin Taylor Robson drops fundraising tactic after questions AZ House Speaker Rusty Bowers wins award for courage\nThat, too, prompted a private discussion with McCarthy, who told reporters on Wednesday that Cawthorn had \"lost my trust.\"",
    "Gosar's presence at AFPAC in 2021 put him alongside other far-right provocateurs, such as former Rep. Steve King, R-Iowa, whose political career ended after Republicans stripped him of committee duties after he questioned why \"white supremacist\" was considered an offensive term.",
    "Politico reported that Gosar, R-Ariz., blamed a staffer for providing a welcome message for Fuentes' America First Political Action Conference in Orlando that should have gone instead to American Principles and the Conservative Political Action Conference, also in Orlando.",
    "\"We want to keep our brave soldiers in the white, blue and red in our prayers and in our thoughts as they continue to liberate Ukraine from the Great Satan and from the evil empire in the world, which is the United States,\" Fuentes said on his \"America First\" show.",
    "Rep. Paul Gosar sought to distance himself from Nick Fuentes in remarks Friday, saying he didn't intend to make a videotaped greeting for the white nationalist's annual conference in February, though he appeared in person at the gathering last year.",
    "That came after Gosar and Greene were reportedly linked to an \"America First Caucus\" with a focus on keeping the nation loyal to an Anglo-Saxon past and ending immigration as we know it.",
    "The Daily Beast has quoted Fuentes as saying: \"White people are done being bullied\" and praised the deadly Jan. 6, 2021, riot at the U.S. Capitol as \"awesome.\"",
    "Gosar also said he didn't know about Fuentes' divisive background before appearing at AFPAC in 2021, when he was the first sitting member of Congress to do so.",
    "Nick's got a problem with his mouth.”\nNeither Van Flein nor a spokesperson for Gosar could be immediately reached for comment late Friday.",
    "For many, Fuentes first drew attention for attending the 2017 white nationalist rally in Charlottesville that led to a woman's death.",
    "In June, Fuentes and his organization were reportedly set to hold a fundraiser for Gosar that ultimately didn't happen.",
    "\"The young people that were being misled by somebody — we should be trying to mentor, trying to change them.",
    "Amid a flurry of condemnation from the left and right, Gosar denied being part of such an effort.",
    "Reach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493.",
    "More recently, he has flippantly noted his support for Russia in its war with Ukraine.",
    "He said the staffer “misconstrued” directions from Tom Van Flein, his chief of staff.",
    "“It wasn't supposed to go to Nick’s group,” Gosar told Politico.",
    "Subscribe to our free political podcast, The Gaggle.",
    "Greene said it was considered, but didn't happen.",
    "McCarthy said Cawthorn had \"exaggerated.\"",
    "I've given up … on dealing with Nick.",
    "Follow him on Twitter @ronaldjhansen.",
    "Subscribe to azcentral.com today.",
    "Support local journalism."
  ]
}