{
  "id": 7385,
  "mediaId": 2664,
  "date": "2022-04-05",
  "headline": "Republicans shredded for voting against Ukraine relief: They 'love Russia and hate America'",
  "image": "https://www.rawstory.com/media-library/thomas-massie-slammed-for-gun-toting-christmas-tweet-after-school-shooting.jpg?id=28166396&width=1200&coordinates=0%2C85%2C0%2C85&height=600",
  "link": "https://www.rawstory.com/republicans-shredded-for-voting-against-ukraine-relief-they-love-russia-and-hate-america/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    2443,
    2765,
    3618,
    5002,
    5174,
    1477,
    1126,
    6672,
    6569,
    6678
  ],
  "sentences": [
    "\"Since Russia invaded Ukraine, the House of Representatives has voted on three measures specific to the war,\" noted Saletan: a resolution to endorse sanctions against Russia, a bill to ban oil and gas imports from Russia, and a bill to end favorable trade relations with Russia.",
    "On Tuesday, writing for The Bulwark, Will Saletan demolished the handful of House Republicans who have consistently refused to support any effort to aid Ukraine against the brutal Russian invasion — a conflict rapidly escalating to murderous war crimes.",
    "Moreover, some Republicans are introducing their own anti-Ukraine legislation — for instance, Cawthorn and many others are sponsoring a bill that requires no more troops be deployed \"by reason of the situation in Ukraine\" than are at the Mexican border.",
    "Many of those who opposed at least one of the bills were frequent far-right allies of former President Donald Trump, like Reps. Paul Gosar (R-AZ), Lauren Boebert (R-CO), Marjorie Taylor Greene (R-GA), and Madison Cawthorn (R-NC).",
    "They believe America doesn't have any responsibility to intervene, that the war may be a plot to hurt Americans economically, and that perhaps we should even allow Russia to do whatever it wants.",
    "And \"10 Republicans have signed on to a bill that would bar any delivery of military aid to Ukraine until 'a border wall system along the United States-Mexico border is completed.'",
    "\"Leftist Democrats generally oppose armed intervention, yet nearly all of them voted for sanctions against Russia and military aid for Ukraine.",
    "In all, this group includes 21 Republicans, wrote Saletan — and the contrast with the Democratic Party is striking.",
    "They denounce 'war hawks on both sides of the aisle,' and they protest that 'the left is so addicted to war.'",
    "They’ve swallowed a cocktail of isolationism, defeatism, partisan paranoia, and Russian disinformation.\"",
    "It’s nihilism, cynicism, cowardice, partisan derangement, and a loathing of contemporary America.\"",
    "The cosponsors include Reps. Bob Good, Jody Hice, Mary Miller, Ralph Norman, and Randy Weber.\"",
    "It’s because they recognize the war as a showdown between right and wrong,\" wrote Saletan.",
    "\"This is the reality of the partisan divide in Congress today,\" concluded Saletan.",
    "One Republican, Rep. Thomas Massie (R-KY), voted against every single one.",
    "On the sanctions and trade bills, only Republicans voted against it.",
    "\"Many of the 21 House Republicans, however, don’t see it that way.",
    "\"Some of these Republicans see themselves as an antiwar caucus.",
    "Each time, several Republicans voted against it.",
    "But what they’re preaching isn’t pacifism.",
    "You can read more here.",
    "Why is that?"
  ]
}