{
  "id": 7454,
  "mediaId": 2745,
  "date": "2022-04-07",
  "headline": "Paul Gosar’s office denies role in far-right event after group publicized it",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ICXVQ2HNN4I6XANSTNYGDJMC3A.jpg&w=1440",
  "link": "https://www.washingtonpost.com/nation/2022/04/07/paul-gosar-american-populist-union/?utm_source=rss&utm_medium=referral&utm_campaign=wp_national",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1640,
    2616,
    2443,
    3682,
    4066,
    4257,
    72,
    1359
  ],
  "sentences": [
    "“The only event we have that day is a farm tour.”\nThe ticketed event in Tempe is hosted by the American Populist Union, a group the Anti-Defamation League says “champions anti-immigration and anti-LGBTQ+ sentiments and regards the modern GOP as a corrupt, globalist conservative establishment.” The nonprofit organization with mostly college-aged members, according to the ADL, is “Groyper-esque” — a reference to a white supremacist group.",
    "Gosar’s expected presence at the event brought a new wave of backlash after the congressman made a video appearance at a February conference organized by Nicholas Fuentes, a white-nationalist activist who attended the deadly 2017 Unite the Right rally in Charlottesville.",
    "Organizers say more guests will be announced, and attendees will have “a chance to meet some of the best legislatures, best people running for office, and media personalities in the country!”\nArizona state Sen. Warren Petersen was also listed as a featured guest.",
    "After Gosar’s office denied his involvement in the group’s event, the American Populist Union’s chief operating officer, CJ Trapeur, said in a statement to The Post that “there seems to be a misunderstanding and scheduling conflict” with the congressman’s office.",
    "Senate Minority Leader Mitch McConnell (R-Ky.) also issued a statement in response to the event, saying, “There’s no place in the Republican Party for white supremacists.”\nTickets for this month’s American Populist Social range from $45 to $59.99.",
    "He claimed women should not be allowed to vote and that Martin Luther King Jr. and the civil rights movement had “terrible legacies.”\nTrapeur, in his statement, denied reports that the American Populist Union has white nationalist ties.",
    "Fuentes has inspired a large following of people who deem themselves the “Groyper Army.” With an active online presence, the “America First”-aligned group caters to a growing number of young Republicans edging further to the right.",
    "Gosar was billed to appear alongside John Doyle, a host of a YouTube channel called “Heck Off, Commie!” In his show, Doyle has often decried President Biden’s election as “fraudulent” and said liberalism is connected to satanism.",
    "Doyle, whom the ADL calls “a prominent figure of the American Populist Union,” has over 330,000 subscribers on YouTube — a platform in which he has made racist, misogynist and antisemitic remarks, Insider reported.",
    "Hours after Gosar’s office disputed his involvement, the American Populist Union removed mentions of the congressman from its Eventbrite listing — though a tweet promoting his attendance remains on Twitter.",
    "He also disputed claims that the group scheduled its event on April 20 to coincide with Adolf Hitler’s birthday — a date often commemorated by neo-Nazi and white supremacist groups, according to the ADL.",
    "The American Populist Union has promoted a takeover of the Republican Party on its website and praised foreign populist strongmen such as Hungary’s Prime Minister Viktor Orbán on Twitter.",
    "Over the weekend, the Arizona Republican shared details for the American Populist Union mixer on his Instagram account, according to the Arizona Mirror, which first reported on the event.",
    "However, the Republican lawmaker told the Arizona Mirror that he had “respectfully declined to speak” after realizing the gathering was hosted by an organization unfamiliar to him.",
    "House Minority Leader Kevin McCarthy (R-Calif.) said he met privately with Gosar and Greene, deeming their involvement in the conference “unacceptable,” The Post reported.",
    "In bright blue and red letters, Rep. Paul A. Gosar is billed as a “featured guest” on a promotion for a far-right group’s April 20 event in his home state.",
    "“It wasn’t supposed to go,” Gosar told the outlet, saying the video was supposed to be a general “welcome video” for other events.",
    "“I never approved this event and have never spoken to this group,” Rory McShane, Gosar’s campaign consultant, told The Post.",
    "But in emails to The Washington Post, Gosar’s office denied that the congressman will be participating.",
    "Rep. Marjorie Taylor Greene (R-Ga.) also spoke in person at that event."
  ]
}