{
  "id": 7573,
  "mediaId": 2594,
  "date": "2022-04-09",
  "headline": "Pro-Trump ‘Stop the Steal’ organiser co-operating with Capitol riot investigation",
  "image": "https://static.independent.co.uk/2022/04/09/14/GettyImages-1358125201.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/ali-alexander-stop-the-steal-trump-b2054628.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Woodward",
  "authorUrl": "https://www.independent.co.uk/author/alex-woodward",
  "termIds": [
    0
  ],
  "sentences": [
    "“I denounce anyone who planned to subvert my permitted event and the other permitted events of that day on Capitol grounds to stage any counterproductive activities.”\nA grand jury impaneled by federal prosecutors is reviewing how rallies that amplified a baseless narrative that the 2020 election was stolen from the former president were funded and organised before erupting into an assault on the halls of Congress in an attempt to stop the certification of Joe Biden’s election.",
    "He also has filed a lawsuit to block his phone service provider from providing phone records, revealing in court documents that Verizon was subpoenaed for “nine categories of information associated with Alexander’s personal cell phone number”,\nThe filings reveal that he was in contact on 6 January with Kimberly Guilfoyle, the fiancee of Donald Trump Jr who helped organise the Women For America First rally.",
    "In the lead up to the 2020 election, Mr Alexander – who rose to prominence among far-right circles in the wake of the Tea Party movement before leading election-related conspiracy theorist communities – participated in two “Stop the Steal” events in Washington DC, in November and December, and in other election rallies in other states.",
    "Ali Alexander – who previously claimed he “schemed up” with a group of House Republicans to put “maximum pressure” on Congress as it convened to certify the results of the 2020 presidential election – is the first high-profile figure to confirm their cooperation with the government probe.",
    "A key figure behind the “Stop the Steal” movement that fuelled protests, conspiracy theories and violence to reject the outcome of the 2020 presidential election will cooperate with the US Department of Justice in its investigation of the attack on the US Capitol on 6 January, 2021.",
    "In a statement through his lawyer, first reported by The New York Times, Mr Alexander said a federal grand jury subpoena does not indicate that he is a “target” but seeks information about a rally supporting Donald Trump that preceded the attack on the Capitol.",
    "“The data sought is not pertinent to the investigation and sweeps up privileged communications between Alexander and clergy, Alexander and people he spiritually counsels and Alexander and his respective attorneys,” according to the filing.",
    "Last year, Mr Alexander gave hundreds of text messages and other communications with members of Congress and people close to Trump to a separate probe led by a House select committee investigating the attack, according to court filings.",
    "“1776 is *always* an option.”\nIn another video filmed during the riots, he said “I don’t disavow this” and “I do not denounce this”\nMr Alexander, who has since been banned from the platform, has denied any connections to violence.",
    "“We could change the hearts and the minds of Republicans who were in that body, hearing our loud roar from outside.”\nReps Biggs and Brooks have repeatedly denied having ties to Mr Alexander.",
    "“They’re either mistaken or lying.”\n“I did nothing wrong and I am not in possession of evidence that anyone else had plans to commit unlawful acts,” he said in his statement this week.",
    "At that same event, Mr Alexander played a message recorded by Mr Biggs, who called Mr Alexander a “friend” and a “hero” before vowing to challenge the electoral count in Congress.",
    "“I don’t believe I have information that will be useful to them but I’m cooperating as best I can further reiterating that I’m not a target because I did nothing wrong,” he said.",
    "On 6 November, 2020, Rep Gosar or Arizona said on Twitter that Mr Alexander was a “true patriot working his butt off for America” following a “Stop the Steal” rally in Phoenix.",
    "“I denounce anyone who planned to subvert my permitted event and the other permitted events of that day on Capitol grounds to stage any counterproductive activities.”",
    "In a since-deleted video, Mr Alexander claims to have talked with Republican US Reps Andy Biggs, Mo Brooks and Paul Gosar about potential 6 January events.",
    "During that event, Mr Alexander vowed that “we’ll shut down this country if we have to” and led a crowd to chants of “1776”.",
    "“Everyone can guess what me and 500,000 others will do to that building,” Mr Alexander said on Twitter in December 202.",
    "“Anyone who suggests I had anything to do with the unlawful activities on Jan 6 is wrong,” he wrote to the committee.",
    "“We four schemed up of putting maximum pressure on Congress while they were voting,” he said.",
    "That rally was organised by Women For America First.",
    "In December, he sat for several hours of testimony."
  ]
}