{
  "id": 7588,
  "mediaId": 2676,
  "date": "2022-03-31",
  "headline": "Jan. 6 DOJ probe expands to Trump “VIPs” — and maybe members of Congress: report",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2021/09/merrick-garland-0909211.jpg",
  "link": "https://www.salon.com/2022/03/31/doj-jan-6-criminal-expands-to-vips-and-potential-involvement-of-members-of-congress-report/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    2443,
    2451,
    2765,
    2151,
    2035,
    5592,
    4905,
    4596,
    1442
  ],
  "sentences": [
    "Two people involved in planning pro-Trump rallies ahead of the attack last year told Rolling Stone that they had \"dozens\" of planning briefings ahead of the events that included Reps. Marjorie Taylor Greene, R-Ga., Lauren Boebert, R-Colo., Madison Cawthorn, R-N.C., Louie Gohmert, R-Texas, and the three lawmakers named by Alexander.",
    "Several federal prosecutors wanted to use subpoenas and search warrants to investigate rally organizers but Trump-appointed investigation chief Michael Sherwin and other FBI and DOJ officials resisted the idea, concerned that such moves could violate First Amendment rights, according to the Post.",
    "RELATED: Jan. 6 committee calls on Merrick Garland to act: \"Do your job so we can do ours\"\nThe reports come after Democrats investigating the Jan. 6 attack roundly criticized Garland and the DOJ for not doing enough to pressure Trump's inner circle to cooperate with their probe.",
    "The Justice Department has expanded its criminal investigation into the Jan. 6 Capitol riot amid Democratic criticism that Attorney General Merrick Garland hasn't been aggressive enough in pursuing prosecutions of those who planned or participated in the attempted insurrection.",
    "The subpoena also sought information about Trump supporters' fake elector scheme, in which Trump allies assembled so-called alternate slates of electors who planned to cast Electoral College votes for Trump in states actually won by President Joe Biden, according to the Times.",
    "The subpoena also requested information about other members of the Trump administration, or members of Congress, who may have been involved in the \"planning or execution of any rally or any attempt to obstruct, influence, impede or delay\" the certification of election results.",
    "The committee has also subpoenaed a number of Trump administration officials and allies involved with his failed effort to overturn his election loss, including attorney John Eastman, who wrote memos plotting to block the certification of the election in Congress.",
    "The planners, who have already testified before the House committee investigating the Jan. 6 attack, also said that Gosar even floated the prospect of \"blanket pardons\" and that former Trump chief of staff Mark Meadows was \"100% made aware of what was going on.\"",
    "The House Jan. 6 committee has already sent subpoenas to Alexander, Kremer and her daughter Kylie, former Trump campaign spokeswoman Katrina Pierson, former chief of staff Mick Mulvaney's niece Maggie, and others involved in the rally planning.",
    "A federal grand jury in Washington has issued subpoenas to Trump World officials who assisted with \"planning, funding, and executing\" then-President Trump's rally at the Ellipse before the riot, according to the Washington Post.",
    "They could \"reveal if members of Congress were in on the plot, and objected to ballots intending to extend the process out purposefully to allow time for the assault on the Capitol to disrupt the ballot count,\" he tweeted.",
    "\"The illegality of the plan was obvious,\" wrote Judge David Carter of the Central District of California, adding that Trump \"more likely than not\" committed federal crimes in his effort to block Biden's win.",
    "A federal judge this week ordered Eastman to turn over more than 100 emails to the panel, writing that the actions taken by Eastman and Trump were effectively a \"coup in search of a legal theory.\"",
    "The latest subpoenas show that the DOJ has quietly expanded its probe, which has already led to charges against more than 770 people, beyond those who stormed the Capitol and committed violence.",
    "\"Attorney General Garland, do your job so that we can do ours,\" Rep. Elaine Luria, D-Va., said Monday as the panel voted to hold former Trump aides Dan Scavino and Peter Navarro in contempt.",
    "But that could be a complicated task, since investigators have to distinguish between constitutionally protected First Amendment rights and actions that may be criminal.",
    "Rally organizer Ali Alexander previously alleged that Reps. Mo Brooks, R-Ala., Paul Gosar, R-Ariz., and Andy Biggs, R-Ariz., helped plan the march to the Capitol.",
    "Multiple committee members on Monday criticized the DOJ for not charging Meadows after the House voted to hold him in contempt for refusing to cooperate.",
    "\"One solution is sending out the US Marshals with handcuffs to bring in recalcitrant witnesses who miss their date, which means witnesses usually don't.\"",
    "Several groups, including Alexander's \"Stop the Steal\" and Amy Kremer's Women for America First, organized large caravans ahead of the Jan. 6 rally.",
    "While the committee has had trouble getting witnesses to cooperate, legal experts say the DOJ is unlikely to face similar resistance.",
    "One of the subpoenas sought information about people \"classified as VIP attendees\" at the rally, according to The New York Times.",
    "Ahead of the one-year anniversary of the attack, Garland vowed that the Justice Department would \"follow the facts\" of the case.",
    "\"Unlike Congress, DOJ has the authority to enforce its own subpoenas,\" tweeted former federal prosecutor Joyce White Vance.",
    "Prosecutors have since asked witnesses about who paid for their lodging and travel to Washington, according to the Post.",
    "Sen. Sheldon Whitehouse, D-R.I., who sits on the Judiciary Committee, said the latest subpoenas were \"really important.\"",
    "At least one person involved in the logistics of the Ellipse rally has also been asked to appear before the grand jury.",
    "But the subpoenas mark a shift in strategy from the early days of the probe.",
    "\"But most important, we follow the facts — not an agenda or an assumption.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "\"I hope that's not true, but it needs to be settled.\"",
    "Subscribe to our morning newsletter, Crash Course.",
    "The facts tell us where to go next.\"",
    "\"We follow the physical evidence.",
    "Both have denied any wrongdoing.",
    "We follow the digital evidence.",
    "We follow the money,\" he said.",
    "Read more:"
  ]
}