{
  "id": 7729,
  "mediaId": 2550,
  "date": "2022-04-01",
  "headline": "Republicans aren't happy Madison Cawthorn spilled the beans about cocaine orgies",
  "image": "https://images.dailykos.com/images/921502/story_image/GettyImages-1304245873.jpg?1614365486",
  "link": "https://www.dailykos.com/stories/2022/4/1/2089440/-Cawthorn-s-cocaine-orgies-talk-draws-more-Republican-rage-than-Greene-s-white-nationalism?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Clawson",
  "authorUrl": "/users/laura clawson",
  "termIds": [
    2443,
    3418,
    3049,
    4066,
    4992,
    5441,
    5399,
    1489,
    1126
  ],
  "sentences": [
    "I can tell you that they continue to happen.”\nLet’s recap what Cawthorn did say about “these parties.”\n”The sexual perversion that goes on in Washington ... being kind of a young guy in Washington, where the average age is probably 60 or 70—[you] look at all these people, a lot of them that I've looked up to through my life, I've always paid attention to politics ... Then all of a sudden you get invited—'We're going to have a sexual get-together at one of our homes, you should come.'",
    "There’s also Rep. Ronny Jackson, whose habit of handing out pills in his former capacity as a White House doctor led to the nickname “candy man.” And, uh, a former White House photographer recently tweeted at Jackson, “Remember that time you told me you shaved your pubic hair to make your penis look bigger?",
    "You weren’t misspeaking; I heard you tell that story to others.” If Jackson is walking around talking about the state of his pubic hair and its relation to his perceived penis size, he has to go on the list of Republican lawmakers who might not be strictly faithful to their spouses.",
    "And when Cawthorn attended a Wednesday night fundraiser for Harriet Hageman, Rep. Liz Cheney’s primary challenger, his “own GOP colleagues spent some of the fundraiser, feet away, quietly joking at his expense, according to people in the room,” Politico’s Olivia Beavers reports.",
    "Reps. Marjorie Taylor Greene and Paul Gosar spoke at a white nationalist event and McCarthy had a private chat with them, then went to reporters and explicitly promised that they’d get their committee assignments back if Republicans take the House.",
    "As Hunter also pointed out, reports that Gaetz wanders around the floor of the House showing other lawmakers nude pictures of his sexual partners suggest that there’s a … certain level of comfort among House Republicans with that sort of thing.",
    "“But when you’re in Congress, you should respect the institution, and you should focus on the work that you should do.”\nAgain, McCarthy showed none of this anger when two members of his conference spoke at a white nationalist event.",
    "RELATED STORIES:\nRepublicans freaking out about Madison Cawthorn's allegations of 'cocaine' and 'orgies'\nGreene and Gosar won't face punishment for speaking at white nationalist event\nThis is a short blurb about Daily Kos.",
    "RELATED STORY: Madison Cawthorn vows to keep talking about Republican cocaine use and orgies\n“The Constitution gives you the age when you can serve in Congress,” McCarthy also said after his conversation with Cawthorn.",
    "Cawthorn’s claims that other Republicans have invited him to cocaine orgies are, apparently, what it takes to get House Minority Leader Kevin McCarthy to issue a public rebuke to a member of his party.",
    "Then again, as young as Cawthorn is, neither Gaetz nor Jackson would seem to fit the description of “a lot of them that I've looked up to through my life.” So who knows who else is out there?",
    "And it's like, this is wild.”\nIn his meeting with McCarthy, Cawthorn apparently tried to claim he didn’t say “orgy,” only to have it pointed out to him where on the tape he said exactly that.",
    "But whatever Cawthorn’s story is at any given moment, or whatever McCarthy would like to portray it as being, there are definitely candidates among House Republicans that fit the bill.",
    "At the top of the list is Rep. Matt Gaetz, who is currently under investigation for sex trafficking a minor and who has been reported having attended … parties with cocaine and sex.",
    "As Hunter pointed out Thursday, though, what no one is really saying is that Cawthorn’s claims are implausible, and one prominent, though not elected, Republican is backing him up.",
    "Appearing on Alex Jones’ Infowars, Roger Stone said that Cawthorn wasn’t retracting and was telling the truth: “I can tell you first hand that these parties happen.",
    "Some of the people leading on the movement to try and remove addiction in our country, and then you watch them do a key bump of cocaine right in front of you.",
    "Listen and subscribe to Daily Kos Elections’ The Downballot podcast with David Nir and David Beard\nx\nx\nYou need to enable JavaScript to run this app.",
    "McCarthy also said Cawthorn denied knowing what cocaine even is, despite his use of “key bump” to describe a very specific way of using cocaine.",
    "Or when one of those members tweeted an edited video showing himself murdering Rep. Alexandria Ocasio-Cortez and attacking President Joe Biden.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nIt’s not just McCarthy, either.",
    "“This is unacceptable and there is no evidence to this, he changes what he tells and that’s not becoming of a congressman.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Something that suggests they may, in their private lives, be doing things that wouldn’t look good in a campaign ad?",
    "It’s a virtual certainty they were linked to McCarthy and speaking with his permission to further trash Cawthorn.",
    "Sen. Thom Tillis—who, like Cawthorn, represents North Carolina—has endorsed a primary challenger to Cawthorn.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWe open our mailbag and answer your questions!",
    "He did not tell the truth.”\nUnnamed Republicans also lavishly dished on what happened at the meeting.",
    "Or, for that matter, when Cawthorn was credibly accused of sexual misconduct by dozens of people.",
    "Something that implicates their entire party’s ideological underpinnings as fundamentally racist?",
    "Now he’s saying it wasn’t so much an orgy as a sex party with a member of Congress and his wife.",
    "But Gaetz is younger than what Cawthorn implied with his mention of the average age of 60 or 70.",
    "Either way, Cawthorn’s public accusations have shown us where senior Republicans draw the line.",
    "Cawthorn, on the other hand, got not just the private chat but a public tongue-lashing.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "“I mean he’s got to turn himself around,” McCarthy told reporters on Wednesday.",
    "Social media posts featuring fantasies of assassinating Democratic colleagues?",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Rep. Madison Cawthorn’s fellow Republicans are very unhappy with him.",
    "It’s at suggesting that other Republicans are having cocaine orgies.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Republicans may be trying to cancel Madison Cawthorn after all.",
    "And then you realize they're asking you to come to an orgy ...",
    "It’s not at associating with white nationalists.",
    "... What did you just ask me to come to?",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Donate $5 monthly",
    "Please read it.",
    "Rage.",
    "Meh.",
    "Eh."
  ]
}