{
  "id": 7746,
  "mediaId": 2528,
  "date": "2022-04-06",
  "headline": "GOP congressman was promoted as a 'featured guest' at upcoming far-right group's event scheduled on Hitler's birthday",
  "image": "https://i.insider.com/624e3903f0e4a00018c3f9ac?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/paul-gosar-white-nationalist-event-on-hitlers-birthday-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Erin Snodgrass",
  "authorUrl": "https://www.businessinsider.com/author/erin-snodgrass",
  "termIds": [
    0
  ],
  "sentences": [
    "Rep. Marjorie Taylor Greene of Georgia also spoke at the gathering, prompting House Minority Leader Kevin McCarthy to decry Gosar and Greene's association with the group as \"appalling\" and unacceptable,\" though the Republican leader declined to take any punitive action against his members.",
    "The announcement of Gosar's expected appearance at the event comes just days after the conservative lawmaker finally addressed his participation in a right-wing event held in Florida in February called the America First Political Action Conference, which was founded by Fuentes.",
    "Rep. Paul Gosar was being promoted as a guest at an upcoming far-right event scheduled for Adolf Hitler's birthday — a venerated date among neo-Nazis and alt-right devotees — according to a ticketing website for the gathering.",
    "Up until Thursday, however, Gosar was being heralded as a \"featured guest\" at the upcoming American Populist Social, hosted by the ultra-conservative political group American Populist Union in Tempe, Arizona, later this month.",
    "Over the weekend, the Arizona Republican even shared details about the event on his social media, according to The Arizona Mirror, which was first to report on the gathering.",
    "Per the Anti-Defamation League, \"groypers are a loose network of alt-right figures who are vocal supporters of white supremacist and 'America First' podcaster Nick Fuentes.\"",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Venues tend to be easier to acquire on weekdays, which is why we ended up with the date,\" Vince Dao, Chairman of American Populist Union said in a statement to Insider.",
    "Fuentes is known for promoting racist and antisemitic views, and the ADL has called the 23-year-old Fuentes a \"well-known white supremacist pundit and organizer.\"",
    "The lawmaker said his staffer \"misconstrued\" directions from his chief of staff and claimed the tape was intended to go to another conservative gathering.",
    "But following media reports on the event Wednesday evening, the congressman's office told The Washington Post that the lawmaker would not be attending.",
    "\"Our team was not even aware that April 20 was Hitler's birthday, and we were not intending to honor or acknowledge Hitler or Nazism in any way.\"",
    "American Populist Union, according to its website, champions Christian and family values, an \"America first\" mentality, and protectionism.",
    "When the outlet asked about Gosar reportedly promoting the event on Instagram, McShane said: \"I don't know, but I didn't approve it.\"",
    "The April 20 event is also set to feature far-right YouTuber John Doyle, who has espoused racist, misogynist, and antisemitic views.",
    "The Mirror reported that the American Populist Union has ties to Fuentes both in ideology and through many of its young members.",
    "\"I never approved this event and have never spoken to this group,\" Rory McShane, Gosar's campaign consultant, told The Post.",
    "Following the outcry, Gosar blamed his participation in the event, via a pre-recorded welcome message, on a staff error.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Update 4/7/2022: This story was updated to include a response from the American Populist Movement and Rep. Gosar.",
    "The ADL calls the group \"groyper-esque\" — linking them to groups who want to \"normalize white nationalism.\"",
    "The group said in a statement to Insider that they are not affiliated with white nationalists or neo-Nazis.",
    "After Gosar reportedly promoted the event on social media, his campaign denied that he would be attending.",
    "Fuentes later claimed in a livestream that he and Gosar would continue to \"collaborate behind the scenes.\"",
    "Reuters\nRep. Paul Gosar was being promoted as a 'featured guest' at a far-right group's event in Arizona.",
    "\"We chose the date April 20 based on venue pricing, availability, and logistics — and nothing more.",
    "The nonprofit has ties to a group of white nationalists known as groypers, according to The Mirror.",
    "Gosar was previously scrutinized for participating in a white nationalist event earlier this year.",
    "As of Thursday, the ticketing website no longer lists Gosar as a special guest.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Gosar's office did not immediately respond to Insider's request for comment.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Gosar also denounced Fuentes, saying he was done with the organizer.",
    "\"The only event we have that day is a farm tour.\"",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "Arizona Rep. Paul Gosar."
  ]
}