{
  "id": 7834,
  "mediaId": 2528,
  "date": "2022-04-02",
  "headline": "I spent a week on Trump's new social media app Truth Social. I felt like I was exploring a ghost town.",
  "image": "https://i.insider.com/624710977bf4e6001936afb4?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/trump-truth-social-media-app-review-ghost-town-overrun-bots-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rosie Bradbury",
  "authorUrl": "https://www.businessinsider.com/author/rosie-bradbury",
  "termIds": [
    1708,
    2178,
    4266,
    2765,
    2767,
    514,
    468,
    6277
  ],
  "sentences": [
    "Big news stories like the Russia-Ukraine war seemed to be getting minimal engagement\n Rosie Bradbury/Insider\nI could search for topic hashtags, but even hashtags you'd think would generate a lot of user engagement, like those related to the Russian invasion of Ukraine, were barely getting any traction.",
    "Trump Media & Technology Group, the company behind Truth Social, pitches its app as an alternative to the big social media platforms, which banned Trump for inciting violence during the US Capitol insurrection on January 6, 2021.",
    "And another was the account of Kyle Rittenhouse (269,000), who in November last year was acquitted of all charges after fatally shooting two people during protests over the police shooting of Jacob Blake in Kenosha, Wisconsin.",
    "My suggested follows were sometimes weird, and my feed didn't contain much original content\n Rosie Bradbury/Insider\nAfter completing the setup process for new users, I was prompted to follow 50 suggested accounts.",
    "But other mainstream news organizations were missing: CNN, NBC, The New York Times, and The Wall Street Journal weren't there (though there was no shortage of parody accounts for these publications).",
    "Fox News didn't appear to have an account\n Rosie Bradbury/Insider\nA few media outlets, including Fox-owned tabloid TMZ and right-wing UK newspaper The Daily Mail, had Truth Social presences.",
    "And other apps that attract right-wing audiences, like Gettr, a \"cancel-free\" app founded last year by former Trump aide Jason Miller, have more users and are getting more daily engagement.",
    "A host of prominent Republicans and conservative commentators — including Ben Shapiro and Infowars host and conspiracy theorist Alex Jones — weren't anywhere to be seen.",
    "Other suggested follows included the meme account \"Cats with Jobs\" (38,000), an account entitled \"Hot Chicks Golfing\" (61,000), and the official NASA account (113,000).",
    "Even if Trump was posting frequently on Truth Social, he still wouldn't be generating anything like the level of engagement he enjoyed on Twitter before he was banned.",
    "The direct message function wasn't working\n Rosie Bradbury/Insider\nTruth Social's user interface closely resembles Twitter's but has several gaps in functionality.",
    "But even when I got off the waitlist and into the app, followed the app's most popular users, and scrolled through my feed, there still wasn't much to see or do.",
    "Trump had posted just once\n Rosie Bradbury/Insider\nEven the people you'd expect to be avid users of Truth Social, like Trump himself, are barely active.",
    "Former Alaska governor Sarah Palin appears to have a Truth Social account, with one \"truth\" posted and 5,010 followers, but her page wasn't verified.",
    "There was an RSS aggregating bot for Fox Sports' website, which had 76,300 followers, but the account didn't appear to be affiliated with Fox itself.",
    "As of April 1, 2022, Trump had just around 823,000 followers on Truth Social — compared with 88 million followers on Twitter in early January 2021.",
    "After being kicked off Twitter, Facebook, and YouTube early in 2021, former president Donald Trump pledged to launch his own social media platform.",
    "Brandon Bell/Getty Images/Christoph Dernbach/picture alliance via Getty Images\nI spent a week on Truth Social, Donald Trump's new social media app.",
    "Once I'd followed these accounts, my feed of \"truths\" — what Truth Social calls posts — started filling up, but with very little original content.",
    "Representatives Byron Donalds and Lisa McClain were there, with 1,000 and 233 followers respectively — but neither had posted any \"truths.\"",
    "I downloaded the Truth Social app on launch day and created an account – only to be told I'd been put on a waitlist in spot number 157,120.",
    "Marjorie Taylor Greene and Sean Hannity were on there\n Rosie Bradbury/Insider\nA few prominent conservatives were active on Truth Social.",
    "As I scrolled through my feed, I found that most posts were just linked-out articles on websites, posted automatically via RSS feeds.",
    "It has slumped from being the number one download on Apple's US App Store to number 173, according to an analysis by Similarweb.",
    "There's a debunked conspiracy theory that Ukraine is engaging in clandestine bio weapons testing, funded by the United States.",
    "Through the app's profile finder, I couldn't find any verified US Senators, or Democrats from either congressional chamber.",
    "The app was overrun with bots\n Brandon Bell/Getty Images\nTruth Social was meant to be a haven for conservative discussion.",
    "There was an account called @FoxNewsChannel but it only had 5,920 followers, and has only posted 30 \"truths\" altogether.",
    "Congresswoman Marjorie Taylor Greene and congressman Paul Gosar respectively had 71,600 followers and 12,400 followers.",
    "For now, though, it's some way off becoming the social media platform of choice for Trump and his supporters.",
    "Interestingly, Fox News, which was once Trump's news network of choice, didn't appear to have a presence.",
    "Still, the conspiracy theory has been spread by sites like Infowars and Russian disinformation channels.",
    "Truth Social seems to have a service for verifying users with a red check mark, but few profiles had it.",
    "Much of the content in my news feed was auto-generated and many of the app's functions didn't work.",
    "Lots of prominent right-wingers, like Tucker Carlson and Ben Shapiro, weren't anywhere to be seen.",
    "You can reply, reblog, and like \"truths\" but you can't add your own comments in quote-tweet style.",
    "Fox News host Sean Hannity had racked up 372,000 followers and was posting several \"truths\" a day.",
    "For example, many of the replies to Trump's solitary post were adverts for a niche cryptocurrency.",
    "That's partly down to the app's lengthy waitlist, which keeps wannabe users locked out for weeks.",
    "About 13 months later, on February 21, 2022, he did just that with the launch of Truth Social.",
    "And even popular hashtags turned up mainly bot-generated posts or non-organic content.",
    "It was also mentioned on three separate Fox News segments hosted by Tucker Carlson.",
    "There's a direct messages feature but it hadn't been activated when I used the app.",
    "It's not impossible that Truth Social could take off at some point in the future.",
    "There isn't much happening on Donald Trump's new social media app Truth Social.",
    "Since it launched, downloads and time spent on the app have trended downwards.",
    "A \"truth\" from Trump's account, posted about a month prior, said: \"Get Ready!",
    "Representative Clay Higgins was also there, with 4,320 users and seven posts.",
    "Still, the hashtag linked to very few posts and had limited engagement.",
    "One Ukraine-related hashtag I surfaced on the app was #Ukrainebiolabs.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Three weeks later, on March 14, I was finally allowed to use the app.",
    "It was like a conservative ghost town that had been overrun by bots.",
    "For example, only 1,320 people were using the #Ukraine hashtag.",
    "But these accounts were the exception rather than the rule.",
    "Of course, one was Trump's account (823,000 followers).",
    "Another was Fox News anchor Sean Hannity (372,000).",
    "The signs so far are that Truth Social is a flop.",
    "I did find a few Republican lawmakers, though.",
    "Close icon Two crossed lines that form an 'X'.",
    "Your favorite President will see you soon!\"",
    "The former president hadn't posted since.",
    "You can however block and mute users.",
    "It felt more like Bot Social.",
    "And I found…not very much.",
    "It was like a ghost town.",
    "Here's what I found."
  ]
}