{
  "id": 7838,
  "mediaId": 2676,
  "date": "2022-04-06",
  "headline": "GOP Rep. Paul Gosar promoted appearance at white nationalist event, but now says he is not attending",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/04/paul-gosar-0407221.jpg",
  "link": "https://www.salon.com/2022/04/06/congressman-paul-gosar-scheduled-for-nationalist-event-on-hitlers-birthday/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelly McClure",
  "authorUrl": "https://www.salon.com/writer/kelly-mcclure",
  "termIds": [
    2240,
    2616,
    2443,
    3682,
    4039,
    1489,
    97,
    1126,
    1477
  ],
  "sentences": [
    "What will be served:\nSoft Pretzels - served with House-made Cheese\nPotato Tacos - Seasoned Potatoes fried in crispy corn tortillas\nChef's Choice Pizza - Fresh hand-tossed Pizza\nAccording to the AZ Mirror, the American Populist Union is aligned with a group of white nationalists known as \"groypers\" whose main goal is for their ideals to become cemented within the \"Republican mainstream\" way of thinking.",
    "A young white nationalist who hopes to pull the GOP all the way to Hitler\nThe details of the night's event is broken down as such:\nThe Social will be served with dinner and a chance to meet some of the best legislatures, best people running for office, and media personalities in the country!",
    "Gosar promoted this event on social media, but his campaign office told the Arizona Mirror after publication of their initial report that he is not scheduled to attend and doesn't know how he was listed as a guest of honor.",
    "According to AZ Mirror's report Doyle has previously organized a \"Stop the Steal\" rally with Fuentes, has spoken negatively of the life and work of Martin Luther King, and believes that \"liberalism is linked to satanism.\"",
    "UPDATE: A representative of Congressman Paul Gosar's campaign spoke with the Arizona Mirror after publication of their story to say the congressman would not be attending the white nationalist group's event on April 20.",
    "Recently Gosar made the press rounds claiming that his attendance at white nationalist Nick Fuentes' AFPAC conference was due to a \"miscommunication\" of some sort, which he credited to his staff.",
    "McShane did not immediately respond to questions from the Mirror about why Gosar promoted his planned appearance at the American Populist Union event on his official Instagram account.",
    "According to the Mirror, Rory McShane said American Populist Union never contacted Gosar, who did not respond to the paper's requests for comment before publication, or his campaign.",
    "The April 20 event in question is the The American Populist Social, hosted by the American Populist Union with John Doyle, host of \"Heck Off, Commie!\"",
    "\"When they first contacted me, I thought it was a County Young Republican event,\" Petersen said in a quote used by AZ Mirror.",
    "Republican Congressman Paul Gosar was announced as a guest at a white nationalist event set for April 20, Hitler's birthday.",
    "Arizona state Sen. Warren Petersen, R-Gilbert was initially tied to the April 20 event, but has since backed out.",
    "Doyle, a listed guest at the event, is a known ally of \"groypers,\" and has promoted their agenda in the past.",
    "\"After I realized it was an organization I was unfamiliar with, I respectfully declined to speak.\"",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Gosar was pictured on the event's ticket link as a special guest.",
    "The night will also include addresses from our special guests!",
    "There will be dinner served at the price of a ticket!",
    "Subscribe to our morning newsletter, Crash Course.",
    "Related: Who is Nick Fuentes?",
    "This story has been updated.",
    "Read more:"
  ]
}