{
  "id": 8165,
  "mediaId": 8475,
  "date": "2022-04-06",
  "headline": "Campaign denies Az. Rep. Gosar set to attend white nationalist event on Hitler’s birthday, despite billing",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/040622_Gosarmask111721.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/040622_gosar_white_nationalists/campaign-denies-az-rep-gosar-set-attend-white-nationalist-event-hitlers-birthday-despite-billing/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerod MacDonald-Evoy",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/65775",
  "termIds": [
    0
  ],
  "sentences": [
    "He distanced himself from Fuentes, telling Politico that the young Holocaust-denying racist \"has a problem with his mouth..\nSponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nFuentes shared the story on the encrypted messaging app Telegram with the message \"April Fool's!\"",
    "The American Populist Union is closely aligned with groypers, a group of white nationalists who strive for their ideas to become a part of the Republican mainstream and are largely followers of 23-year-old white nationalist Nick Fuentes.",
    "Doyle has also posted highly misogynistic content, such as saying that women shouldn't be allowed to vote, and he once called for \"low IQ offenders\" to be executed in response to a story about a Black man committing a violent crime.",
    "Prescott Republican Congressman Paul Gosar was listed as a \"special guest\" with the white nationalist American Populist Union at an event that will be on a date popular among white nationalists and Neo-Nazis: Hitler's birthday.",
    "Update: Three hours after this story was published, U.S. Rep. Paul Gosar's campaign consultant told the Arizona Mirror that the congressman would not be attending the white nationalist group's event on April 20.",
    "and later said in a livestream that he and Gosar will continue to \"collaborate behind the scenes..\nAmerican Populist Union has connections to Fuentes ideologically and through its members.",
    "After this story was published, Gosar's campaign consultant told the Arizona Mirror that the congressman would not be attending the white nationalist group's event on April 20.",
    "The group hobnobbed with Arizona politicians in December when it held an event across the street from Turning Point USA that attracted a slew of fringe activists and groypers.",
    "But Gosar's campaign says he isn't attending and it doesn't know how he was listed as a guest of honor, even though Gosar promoted his scheduled appearance on social media.",
    "McShane did not immediately respond to questions about why Gosar promoted his planned appearance at the American Populist Union event on his official Instagram account.",
    "Doyle, along with other members of APU, were also in attendance at the first 76Fest which was dubbed \"Hitler Youth, without the Hitler\" by one of its organizers.",
    "The other featured guest at the event, John Doyle, has allied with and promoted groypers, and he organized a \"Stop the Steal\" rally in Michigan with Fuentes.",
    "Earlier this month, Gosar said his March video message to attendees of AFPAC was the fault of a staffer who sent his video message to the wrong group.",
    "Arizona state Sen. Warren Petersen, R-Gilbert, is also listed as a featured guest, but he told the Arizona Mirror he is not attending.",
    "McShane didn't immediately respond to requests about what Gosar did that if he had no idea he was scheduled to attend it.",
    "In 2021, Gosar was the first elected official to speak at Fuentes' America First Political Action Conference in 2021.",
    "The American Populist Social will be held in Tempe on April 20, a date revered by white supremacists and Neo-Nazis.",
    "As noted below, Gosar's office did not respond to multiple requests for comment before the story was published.",
    "Doyle, a YouTube personality who runs a show called \"Heck off Commie,\" regularly advocates far-right ideology.",
    "He has said that Martin Luther King was \"not a hero\" and has claimed that liberalism is linked to satanism.",
    "On April 2, Gosar promoted the American Populist Union event, and his appearance, in an Instagram story.",
    "APU did not respond to a request for comment asking it chose April 20 — a Wednesday — for its event.",
    "\"After I realized it was an organization I was unfamiliar with, I respectfully declined to speak.\"",
    "Rory McShane said that American Populist Union never contacted Gosar, his staff or his campaign.",
    "\"When they first contacted me, I thought it was a County Young Republican event,\" Petersen said.",
    "This year, the conference saw speeches by Gosar, Rogers and U.S. Rep. Marjorie Taylor Greene.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "Rory McShane said that American Populist Union never contacted Gosar or his campaign.",
    "The organization still lists Petersen as a \"special guest\" at the event.",
    "Gosar's office did not respond to multiple requests for comment.",
    "Instead, he said Gosar had a \"farm tour\" scheduled for that day.",
    "Instead, he said Gosar had a \"farm tour\" scheduled for that day.",
    "This story has been updated to reflect the latest developments.",
    "Like what you're reading?",
    "- 30 -"
  ]
}