{
  "id": 824,
  "mediaId": 2646,
  "date": "2022-02-26",
  "headline": "COMPLICITY: Kevin McCarthy silent when Marjorie Taylor Greene speaks at white supremacist conference",
  "image": "https://occupydemocrats.com/wp-content/uploads/Marjorie-Taylor-Green-AFPAC-white-nationalist-conference.jpg",
  "link": "https://occupydemocrats.com/2022/02/26/complicity-kevin-mccarthy-silent-when-marjorie-taylor-greene-speaks-at-white-supremacist-conference/",
  "mediaOutlet": "occupydemocrats.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thomas Kennedy",
  "authorUrl": "https://occupydemocrats.com/author/thomaskennedy/",
  "termIds": [
    2187,
    2443,
    4039,
    4066,
    3217,
    3024,
    883,
    1126
  ],
  "sentences": [
    "A speaker, formerly affiliated with the white supremacist “Rise Above Movement,” claimed that white people are being replaced and that “Western white culture is the majority culture, to which even non-whites assimilate into today — and they’re better off for it.”\nIn other words, it’s a lot like a live performance of the venomous racism and allegiance with foreign powers you hear on Tucker Carlson and Fox News Entertainment.",
    "In the past, MTG has blamed wildfires in California to “Jewish space lasers”, has suggested Muslims should not be involved in U.S. government, and said that those supporting refugees are using “immigrant pawns” to commit “the biggest genocide in human history.” If you’re keeping track, that last quote is a white supremacist conspiracy theory which is the basis for Tucker Carlson’s mainstreaming of hate on Fox.",
    "Sponsored Links\nMarjorie Taylor Greene was introduced at the event by Fuentes, himself, where she told attendees known for throwing up Nazi salutes that they were “canceled Americans.” Because of that, she said they had a responsibility to “stop the Democrats” who she falsely (as always) accused of being communists.",
    "Extremists like Marjorie Taylor Greene and Rep. Paul Gosar (R-AZ) are enabled by craven politicians like House GOP leader McCarthy, a man so scared of his own voters he can’t be found for comment when his caucus members appear alongside white supremacists.",
    "Sponsored Links\nWhen New York Magazine tried to find out what the biggest ranking Republican elected official in America thinks about two of his members attending a love great with Putin-worshipping neo-Nazis, it didn’t go far with the GOP House leader.",
    "Advertisement Above\nTwo House Republicans spoke at a white nationalist political conference, including the infamously anti-Semitic Rep. Marjorie Taylor Greene (R-GA), and the GOP House Minority “leader” refused to condemn their appearance.",
    "Until Republican Party leadership begin forcefully condemning the extremists within their ranks and they begin making them suffer real consequences for their actins, the GOP will continue to be hijacked and run by these forces of bigot.",
    "Another AFPAC speaker called for Dr. Anthony Fauci to be executed by hanging after claiming he “literally unleashed a bio weapon on the world.” (The civilized world refers to that as a lifesaving vaccine against covid.)",
    "The day following her appearance with white nationalists, Greene appeared at CPAC where she participated in a panel a few hours before Donald Trump was scheduled to speak and she was treated as a celebrity by attendees.",
    "Paul Gosar is an original member of the Tea Party, and he’s the racist Republican that Democrats have decried four years, but he followed the rules of Congress until becoming unhinged completely in the Trump era.",
    "The far right AFPAC event happened in Orlando, Florida and was organized by far-right activist Nick Fuentes to coincide with CPAC, an input slightly less explicit platform for hate and demagoguery by Republicans.",
    "Greene also griped to the assembly of Brown shirts about being banned from Twitter for repeatedly violating the platform’s public health community guidelines for spreading vaccine misinformation.",
    "They spoke at the America First Political Action Conference, an event hosted by white nationalists and explicit supporters of Russian President Vladimir Putin’s invasion of Ukraine.",
    "Last year, Gosar was censured by the House of Representatives after posting an edited clip depicting him killing Rep. Alexandria Ocasio-Cortez’s (D-NY) Joe Biden’s face.",
    "The Republican Party and white nationalist extremist groups in the United States are increasingly aligned and whatever line separating them is being blurred.",
    "It’s no surprise, since both Green and the Arizona dentist-turned-insurrection-supporter Gosar both have a long history of hateful and bigoted comments.",
    "Both GOP Congress people have been stripped of their committee assignments for abhorrent behavior, rendering them useless in the halls of Congress.",
    "He attended the 2017 white supremacist rally in Charlottesville, Virginia and is currently facing a subpoena for his role in the January 6th riots.",
    "He’s also under criminal investigation for discussing murdering state legislators who would not overturn the 2020 election results.",
    "Both Reps. Greene and Gosar spoke at the America First Political Action Conference prior to her appearance at CPAC.",
    "Noe, Green is disingenuously claiming that she had no idea about Fuentes or his long history of past comments.",
    "Fuentes has expressed extreme antisemitic views, is a Holocaust denier, and opposes women’s right to vote.",
    "The rest of the program for the event was made up by racist and hateful speeches by conspiracy theorists.",
    "They reported:\nSponsored Links\nA spokesperson for McCarthy did not respond to a request for comment.",
    "Republicans are now facing criticism and calls to expel Greene and Gosar from their caucus.",
    "Thomas Kennedy is an elected Democratic National Committee member representing Florida.",
    "Add your name to call on prosecutors to ARREST DONALD TRUMP for his crimes!",
    "But here, they say 100% of the quiet parts out loud.",
    "He Tweets from: @tomaskenn.",
    "Advertisements"
  ]
}