{
  "id": 855,
  "mediaId": 8338,
  "date": "2022-02-23",
  "headline": "GOP candidates stepping forward for state races",
  "image": "https://www.inmaricopa.com/wp-content/uploads/2022/02/GOP-candidates2-scaled-e1645647266588.jpeg",
  "link": "https://www.inmaricopa.com/gop-candidates-stepping-forward-for-state-races/",
  "mediaOutlet": "inmaricopa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Effective March 1, 2022, I will be stepping down from the Apache Junction City Council, relocating to the city of Maricopa and running for the Arizona House of Representatives in the newly formed Legislative District 16.”\nAt just 29, Biggs is in his first term in public service, having won election to the Apache Junction City Council in 2020.",
    "The candidates announced thus far are – TJ Shope of Coolidge for State Senate (currently the incumbent in District 8); Teresa Martinez, who is serving out the balance of Bret Roberts’ term in LD 11; and Braden Biggs, who is resigning his seat on the Apache Junction City Council and moving to Maricopa to run for a seat in LD 16.",
    "The boundaries of that district are yet to be officially determined, but proposals currently show it covering most of Maricopa – except for Tortosa and the surrounding areas east of town – and moving south as far as Saddlebrooke on the northern edge of Tucson.",
    "“This was not something that I had planned to do at this juncture in my life, but the world is opening a door and clearing the path and it is time for me to follow this path and find out where it leads,” he said.",
    "“This district is predominately a Pinal County district that does touch parts of Pima County, including Maricopa, Casa Grande, Eloy, Coolidge, Florence, Arizona City, Sacaton and the outskirts of western Tucson.",
    "I am no stranger to this area as I have spent much of my professional career working in these communities and have gained the support of many local leaders.”\nShope said he sees Biggs as a strong candidate.",
    "She has worked for two U.S. Representative Paul Gosar and served as the political director of the Arizona Republican Party as well as working for four years for Arizona Secretary of State Michele Reagan.",
    "I don’t ever want to lose focus that I am there on the people’s behalf, not for my personal agenda or gain.”\nAs she sees it, those issues include water, transportation, and economic development.",
    "Shope is the veteran of the group, having served eight years in the Arizona House from 2012-20 before being term limited and winning a Senate seat in 2020.",
    "The Republican slate of candidates for State Legislature to represent Maricopa is filling up less than six months shy of the August 2 primary election.",
    "He currently is Vice Chair of three senate committees: Natural Resources, Energy & Water; Transportation & Technology; and Education.",
    "“I am most definitely running for re-election and am in the midst of collecting signatures to qualify for the ballot,” he said.",
    "Three candidates have announced their candidacy to represent the newly drawn Legislative District 16.",
    "Martinez said she will try to put aside her own positions and focus on those of her constituents.",
    "“I think Braden is a great guy and would be a tremendous asset to the Legislature,” Shope said.",
    "Biggs is the newcomer to the area but said it’s a step he felt it was the right time to make.",
    "Martinez is in her first term in public office but has a lengthy political resume.",
    "One of the seats in the district will be unoccupied at the time of the election.",
    "“It’s not about me and my issues or what I want,” she said.",
    "He sees his experience there helping him in the LD 16 race.",
    "Shope recently told InMaricopa he is seeking re-election.",
    "He also sits on the Health & Human Services committee.",
    "“We need more and better of all three,” she said.",
    "“It’s about what Pinal County wants."
  ]
}