{
  "id": 875,
  "mediaId": 2596,
  "date": "2022-02-26",
  "headline": "A man with a PhD in memes says they have the power to 'overwrite history'",
  "image": "https://www.indy100.com/media-library/meme-investing-from-gamestop-to-amc-did-wall-street-still-win.png?id=29369241&width=1200&coordinates=0%2C12%2C0%2C114&height=600",
  "link": "https://www.indy100.com/lifestyle/interview-jamie-cohen-memes",
  "mediaOutlet": "indy100.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Students learned how to literally make weekly content, grow an audience, upgrade their aesthetic choices, and increase their presentation skills all along with learning how YouTube as a mega corporation works, how creators feel, and what rights they are afforded on the platform.",
    "Below, read our interview with Dr. Cohen and all he has to say about the world of memes:\nWe think of memes as a relatively recent phenomenon, but are there any historical examples of them?",
    "Some are leveraging off of Trump's meme culture and now empowering bad actors and white nationalists to meme their way into political discourse (see Paul Gosar and the far right).",
    "He then pivoted to in-depth research of memes because of his media archaeological approach to memes and meaning in 2015, conductive extensive research on Pepe the Frog.",
    "In an effort to learn more about how digital culture (and the real world) is influenced by memes, Indy100 spoke to an actual meme doctor: Dr. Jamie Cohen.",
    "Video\nOver the last decade, memes have taken over the internet, sparking conversations that only those who are aware of its meaning can understand.",
    "A meme can be remixed and remade so much that we forget the original meaning of a word or idea and only reference the meme rather than the origin.",
    "We can use previous frameworks of media analysis on memes, but we need to treat memes a bit more stratigraphically, sort of like archaeology.",
    "What I've learned the most is that no meme is static, it changes because of the culture around and in turn, shapes the culture in reaction.",
    "Sort of like how the Drake no/yes meme is the same format as the car going off the exit, the bus meme from 2021, and distracted boyfriend.",
    "Currently, he is an assistant professor at CUNY Queens College where he teaches Digital Activism, Social Media and Advertising Aesthetics.",
    "In other words, because memes are graphical, some savvy meme makers know how to embed dangerous rhetoric into seemingly innocuous images.",
    "Because of this though, there's been some complicated connections to early memes that Qanon adherents use to validate their wild ideas.",
    "He was eventually given the amazing opportunity to start an Internet Studies degree at a college and created a YouTubers course there.",
    "We need to dig into their references and learn the subtext of the memes so we don't accidentally share memes loaded with dog whistles.",
    "My focus at the time was about appropriation by corporations, but in the end, it was a political culture that appropriated the image.",
    "Simple formats that allow people to participate without too much work are usually much more enduring than complicated nuanced memes.",
    "In a way, memes are the internet's inside joke, but even something as attached to the online world has had implications offline.",
    "I study it because we need to read memes and YouTube as we read traditional media like television, film, newspapers, radio etc.",
    "But the trend of our current memes stems from the 70s and a big proponent of memes as trends and ideas was Terrence McKenna.",
    "Technically, a meme is any type of referential nuanced material, so it's very possible that some cave paintings were memes.",
    "I founded an internet studies degree at a small college and I created a YouTubers course there that's still being offered.",
    "See Doge meme (the dog) versus Doge the Venetian aristocratic duke (big explainer in this essay I wrote for OneZero).",
    "But to be honest, I like when people curate memes on their stories, it gives me a better sense of what's funny.",
    "The energy is usually spent simply by sharing, but sometimes, the energy can be converted into kinetic energy.",
    "Understand how influencers are paid and see that YouTube labor is often underpaid by comparison to mainstream.",
    "Memes are a form of graphical communication and like any form of visual culture, they can be propagandized.",
    "The reason some memes are sticky happens to do with shapes and forms that are easy to see from a distance.",
    "His original research project was about YouTube and he began studying the platform academically in 2006.",
    "I love teaching more than anything in the world and deploy a lot of my scholarly work in the classroom.",
    "More so, we've seen memes manifest into politics and used every day by people like Donald Trump Jr.",
    "Truly a master and expert of all things online, Dr. Cohen also holds a Master's degree in YouTube.",
    "Second, (and I know this is going long) we have to be aware of how ideas can become commoditized.",
    "Many politicians have Millennials and Gen Z folk on staff to help engage audiences through memes.",
    "When people make YouTube content or memes, they are creating in a space that is wildly unlimited.",
    "Finally, I want to add that we need to incorporate meme literacies into media literacy education.",
    "Pepe is also a case study for how memes and symbols are used in different geographical locales.",
    "Pepe means different things to different movements and to me, that's really exciting to study.",
    "In my meme studies courses, we learn a lot about semiotics, cultural studies, and art history.",
    "Who knows what goes viral and becomes part of the larger cultural and political conversation.",
    "It's important to learn to read memes and talk to young people about memes in a serious way.",
    "As far as a format, I really like the wojak at the party meme \"They don't know...\" format.",
    "Elected representatives use memes and reaction culture to keep their audiences engaged.",
    "He holds a PhD in Media and Cultural Studies with a focus on memes and digital culture.",
    "It was during the era of the \"rare pepe\" where false scarcity was causing valuation.",
    "On January 6th, a man wearing a Pepe mask and Kekistan Flag stormed the Capitol.",
    "I started my research on Pepe the Frog before he was co-opted by the far right.",
    "I also really like odd creative content like what Savanah Moss does as well.",
    "Why are some meme formats so enduring, when many are typically fleeting?",
    "Memes are powerful because they have the ability to overwrite history.",
    "Dr. Cohen is a digital media writer, speaker, researcher and educator.",
    "User generated content is culture creation and often contains energy.",
    "They are critical thinking courses that merge creativity and making.",
    "Meme Investing: From GameStop to AMC, Did Wall Street Still Win?",
    "He related memes to art and psychedelics and community sharing.",
    "My Instagram and Twitter feeds are littered with meme accounts.",
    "Arguably, YouTube isn't a culture factory, YouTube is culture.",
    "Pepe represents the framework for meme cycles but at scale.",
    "See how memes inspired the Jan 6 insurrection for example.",
    "Again, this is why we need to talk about memes seriously.",
    "Labor and commodification are a huge part of my studies.",
    "Why did you choose to specialize in YouTube and memes?",
    "Many formats are the same, but are just derivatives.",
    "MemeMeme\nHow are memes currently affecting politics?",
    "You researched Pepe the Frog - what did you learn?",
    "This needs to be studied and taken seriously.",
    "Do you have a favorite meme format/account?",
    "It has to do with form and function.",
    "What do your courses look like?",
    "This is the crux of my work.",
    "Why are memes so powerful?",
    "Anyone can shift that.",
    "This is a long story.",
    "We'll never know.",
    "Same with memers.",
    "Great question.",
    "SO MUCH."
  ]
}