{
  "id": 8940,
  "mediaId": 2550,
  "date": "2022-03-24",
  "headline": "Spare a thought for the Jan. 6 committee, Mr. Brooks?",
  "image": "https://images.dailykos.com/images/1051878/story_image/MoANDTrump.jpg?1648146389",
  "link": "https://www.dailykos.com/stories/2022/3/24/2087875/-Spare-a-thought-for-the-Jan-6-Committee-Mr-Brooks?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    5592,
    2765,
    2749,
    5928
  ],
  "sentences": [
    "In his speech on Jan. 6, Brooks told those gathered to “start taking down names and kicking ass” and asked: “Are you willing to do what it takes to fight for America?”\n“Carry the message to Capitol Hill,” Brooks exclaimed after pontificating to the overwhelmingly white crowd about how “our ancestors” had “sacrificed blood, their sweat, their tears, their fortunes and sometimes their lives.”\nx\nx\nRep. Eric Swalwell of California, a Democrat, sued Brooks for inciting the crowd but a federal judge dismissed the case, finding Brooks’ comments were protected under the First Amendment.",
    "RELATED: Mo Brooks dismissed from Jan. 6 civil conspiracy lawsuit\nAn extensive report produced by Rep. Zoe Lofgren compiling all of the social media messages posted by sitting lawmakers endorsing Trump’s lies about the 2020 election exposed the congressman’s body of remarks around the November 2020 election at length.",
    "RELATED: A social media field guide to the lawmakers who pushed Trump’s election lies before, on and after Jan. 6\nOn Wednesday, Trump officially pulled his endorsement of Brooks, an outcome that was forecast after Trump gave an exclusive interview to the right-leaning Washington Examiner expressing doubt in him.",
    "Brooks publicly supported the unconstitutional alternate elector theory two weeks after the election and 30 days afterward, Brooks was still spewing conspiracy theories about fraud, this time extending the blame to Biden, who he claimed was “buying illegal alien block votes” with promises of U.S. citizenship.",
    "Now, as Brooks guns for a Senate seat in Alabama and hopes to shift the trajectory of his career in the House to that more exclusive body, he finds himself without Trump’s endorsement and on the receiving end of the twice-impeached ex-president’s font of vitriol and vengeance.",
    "The panel has no shortage of reasons to question him in theory and this has never been more true than now in light of his recent statements that Trump, until this day, pushes Brooks to advance the same dangerous election fraud conspiracy that incited a violent insurrection.",
    "Notably, Brooks was chief among Republican lawmakers who promoted theories about uncounted ballots in Georgia, a hotbed of subversion activity by the Trump administration and campaign, according to hundreds of interviews and records already obtained by the Jan. 6 committee.",
    "He spent weeks accusing Democrats of election fraud and theft and echoed similar slogans shared by extreme right-wing activists—including those who organized the rally at the Ellipse that eventually exploded into a deadly riot at the Capitol.",
    "“President Trump asked me to rescind the 2020 elections, immediately remove Joe Biden from the White House, immediately put President Trump back in the White House, and hold a new special election for the presidency,” Brooks said Wednesday.",
    "On Jan. 6, at 1:16 PM just after rioters had begun to breach the Capitol, Brooks tweeted, “Battle is joined!” as he and other Trump cronies like Rep. Paul Gosar of Arizona and Sen. Ted Cruz of Texas prepared to lodge their objections.",
    "The bouncing ball the public should study is what Brooks says and does today compared to what he so doggedly defended well after the nation and the Electoral College made clear that Trump was no longer welcome in the White House.",
    "That stemmed from the congressman’s remarks at a rally last August where Brooks said people should forget about what happened with the 2020 election and focus instead on the upcoming midterms and the 2024 presidential election.",
    "Just Security put together a chronology of Brooks’ comments on the anniversary of the 2020 election, as it was being reported at the time that the congressman could soon find himself under the scrutiny of the Jan. 6 committee.",
    "He continued: “As a lawyer, I’ve repeatedly advised President Trump that Jan. 6 was the final election contest verdict and neither the U.S. Constitution nor the U.S. Code permit what President Trump asks.",
    "Throwing his full-throated support behind outgoing President Donald Trump, Rep. Mo Brooks of Alabama was the first lawmaker to object to the certification of the 2020 election on Jan. 6.",
    "I am always going to choose the Constitution because that’s what my oath of office is to.”\nBrooks pinned the former president’s recent rebuke on the advice he said he gave him.",
    "“Because it’s not what he wanted to hear and I knew it would put my endorsement at risk, but I thought it was the honorable thing to do, so I did it,” Brooks said Thursday.",
    "We gotta take Joe Biden out and put me in now.”\nx\nx\nWhen the news anchor asked him to clarify if Trump was asking that of him today, Brooks sounded momentarily exasperated.",
    "Period.”\nPunctuation on that point aside, Brooks made no less than five speeches to Congress advancing Trump’s ‘election fraud’ agenda starting a week after the election.",
    "Brooks reacted Wednesday to the reversal, striking out at Trump while trying to create distance between himself and the historic factual record of the 2020 election.",
    "His gradual departure from Trump on this matter is, objectively, a remarkably different position than the servile one the former president has known Brooks to take.",
    "It is a safe assumption that endorsement of this increasingly tired conspiracy theory will be chief among the foul centerpieces dotting a likely 2024 run by Trump.",
    "In an interview with a CBS affiliate in Alabama, Brooks said Trump is still asking him to “rescind the election of 2020.”\n“That’s unconstitutional,” Brooks said.",
    "Not to mention, this bunk is still seized upon by several of Trump’s remaining allies in Congress, and some of them are white nationalist-friendly.",
    "And given a choice between Donald Trump—who I respect, who had a lot of great policies while he was president—and the U.S. Constitution?",
    "“And I’m going, Mr. President—I’m giving him advice, I’m an attorney, I’ve read the law, I’ve read the conditions, I know it—Mr.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Congressman Paul Gosar (R, AZ) & Sen. Ted Cruz (R, TX) join to object to the electoral college submission of Arizona.",
    "Daily Kos unraveled the guide to make it more digestible, but the section for Brooks alone is daunting.",
    "Brooks has played down his reported interaction with ‘Stop the Steal’ movement founder Ali Alexander.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "— Mo Brooks (@RepMoBrooks) January 6, 2021\nThis is a short blurb about Daily Kos.",
    "Brooks was a particular fan of the Breitbart website, Steve Bannon’s brainchild.",
    "Now we will find who supports, and who fights, voter fraud & election theft!",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It is unclear if he has been asked to voluntarily cooperate, either.",
    "But on Thursday morning, Brooks played the role of the white hat.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Brooks has not been subpoenaed by the committee publicly.",
    "“He always brings up: We’ve gotta rescind the election.",
    "But Trump’s turning on Brooks is not the trick here.",
    "His honor will be left up to voters to decide.",
    "FIGHT FOR AMERICA’S REPUBLIC IS ON!",
    "It “perturbed” Trump, Brooks said.",
    "Brooks was booed by that crowd.",
    "President, you can’t do that.",
    "x\nBREAKING FROM HOUSE FLOOR!",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "It’s unconstitutional.",
    "BATTLE IS JOINED!",
    "Please read it.",
    "“Yes,” he said."
  ]
}