{
  "id": 8990,
  "mediaId": 2520,
  "date": "2022-03-30",
  "headline": "Congress OKs Sandra Day O'Connor, Ruth Bader Ginsburg statues at US Capitol",
  "image": "https://www.gannett-cdn.com/-mm-/ddd0b2811a3d2803941cfede52153a27f42fef6a/c=0-257-3652-2320/local/-/media/2017/05/10/Phoenix/Phoenix/636300543496711381-2011-12-08-sandra-day-oconnor.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/03/30/congress-approves-sandra-day-oconnor-ruth-bader-ginsburg-supreme-court-statues-us-capitol/7220487001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cami Parrish",
  "authorUrl": "https://www.azcentral.com/staff/6528856001/cami-parrish/",
  "termIds": [
    2443,
    2526,
    2426,
    4905,
    4277,
    2938,
    1433,
    1269,
    6126
  ],
  "sentences": [
    "Supreme Court won't let Arizona voters weigh in on tax cut Brnovich takes election manual fight with Hobbs to court Karrin Taylor Robson drops fundraising tactic after questions AZ House Speaker Rusty Bowers wins award for courage\nRuth Bader Ginsburg was nominated to the Supreme Court by President Bill Clinton in 1993 and served until her death in September 2020.",
    "Though Ginsburg was known throughout her career for her efforts to promote gender equality in Social Security and in wages, she also was known for her famed dissents in Shelby County v. Holder (2013) and Bush v. Gore (2000).",
    "Statues of Supreme Court Justices Sandra Day O’Connor of Arizona and Ruth Bader Ginsburg would rise on the U.S. Capitol grounds under a Congress-passed bill that is awaiting President Joe Biden's signature.",
    "The bill requires that statues honoring the two justices must be featured in a prominent spot on the U.S. Capitol grounds, and they must be built within two years of the legislation's authorization.",
    "Only three other women since have been confirmed to the high court, though a potential fourth, Ketanji Brown Jackson, is now going through the Senate confirmation process.",
    "Her 25 years of court experience were filled with landmark cases such as Bush v. Gore (2000); Planned Parenthood v. Casey (1992) and McConnell v. FEC (2003).",
    "Republican Reps. Andy Biggs and Paul Gosar of Arizona voted against the measure, which the House of Representatives passed Tuesday on a 349-63 vote.",
    "The other seven members of Arizona's House delegation supported the legislation, which the Senate passed late last year via unanimous consent.",
    "Nominated in 1981 by President Ronald Reagan, she served until 2006 when she stepped down to tend to family health matters.",
    "O’Connor was born in El Paso, Texas, but spent a large portion of her childhood on a family-owned ranch in Duncan, Arizona.",
    "The justices are being honored for being the first two women to serve on the highest court in the United States.",
    "Sandra Day O’Connor, who turned 92 on March 26, was the first woman to serve on the Supreme Court.",
    "She was the first Jewish American to lie in the U.S. Capitol."
  ]
}