{
  "id": 9049,
  "mediaId": 2520,
  "date": "2022-03-19",
  "headline": "It does real damage when Sen. Wendy Rogers spews hate and claims to love Jesus",
  "image": "https://www.gannett-cdn.com/presto/2022/03/02/PPHX/11a8bb38-7aae-477a-926a-ad6f16818338-a805116889ef4e7c867becf711874531.jpg?crop=3599,2025,x0,y183&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/2022/03/19/war-christianity-waged-wendy-rogers-nick-fuentes-paul-gosar/7064465001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Wright",
  "authorUrl": "",
  "termIds": [
    2443,
    4039,
    4234,
    1489,
    6678
  ],
  "sentences": [
    "Over the years the war on Christmas has morphed into an apparent nonstop war on Christianity: Prayer banned from schools; plaques containing the Ten Commandments removed from some public courthouses; the occasional lawsuit to remove “under God” from the pledge or “In God we Trust” from our currency; and the perceived unraveling of Christian values and morals, the legalization of gay marriage being the tip of the iceberg for many.",
    "Under the threat of censure from some of her colleagues (who did censure her) she wrote on Twitter, “I stand with the Christians worldwide not the global bankers who are shoving godlessness and degeneracy in our face.”\nAnd in another tweet: “I’m just a sweet grandma who loves Jesus and America.”\nThat's not what Jesus sounded like\nBut Wendy Rogers, Nick Fuentes and Paul Gosar sound nothing like Jesus.",
    "He has sent me to proclaim release to the captives, and recovery of sight to the blind, to let the oppressed go free, to proclaim the year of the Lord’s favor.”\n“Do to others as you would have them do to you.”\n“Love your enemies and pray for those who persecute you.”\n“Love the Lord your God with all your heart, soul, mind, and strength.",
    "And it’s this hatred in the name of Jesus, unchecked and unchallenged, that damages Christian goodwill in the U.S.\nJust look at the numbers of young people walking away from the church and Christianity because the Jesus of people like Rogers and Fuentes and Gosar is of no interest to them.",
    "It’s being waged by people vomiting hate-filled rhetoric in the name of Jesus and/or by people who wrap that hate-filled speech in Christian clothes and/or by far too many Christians who fail to stand up and say that this is not who Jesus is.",
    "If there is going to be a war on Christianity, then it should be a war against all forms of hate, violence, racism, anti-Semitism and nationalism done in the name of Jesus (or any other name, for that matter).",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "The Founders never intended for America to be a refugee camp for nonwhite people.”\nFuentes “jokingly” denied the Holocaust and compared Jews burned in concentration camps to cookies in an oven.",
    "It’s time for Christians of all theological, political and ideological persuasions to stand on the side of Jesus, the side of grace and show our neighbors the real face of Christianity.",
    "Opinion: The worst offenders in the War on Christianity are people like state Sen. Wendy Rogers and U.S. Rep. Paul Gosar, who spew hate while claiming to follow Jesus.",
    "We must stand up to those who speak hate\nThe war against Christianity is not being waged by anti-Christian elites or the politically correct or the Woke crowd.",
    "This war should use the tools of Jesus: grace, unconditional love, uncompromising kindness, lavish generosity, transformative justice and radical forgiveness.",
    "opinion contributor\nEvery Christmas since I was a kid, warnings have been issued by certain segments of Christianity that Christmas is under attack.",
    "It’s not my job to say whether or not Wendy Rogers is a sweet grandma who loves Jesus, or if Nick Fuentes is a young conservative Christian man.",
    "Here’s what Jesus sounds like:\n“The Spirit of the Lord is upon me, because he has anointed me to bring good news to the poor.",
    "And even non-Christian people celebrate the spirit of Jesus through gift-giving and the spreading of joy and glad tidings.",
    "For all the fear, hand-wringing and warnings, Christmas is still freely celebrated by Christians as the birth of Jesus.",
    "Because their words and actions not only do not represent Jesus, they are the destructive opposite of who Jesus is.",
    "Wendy Rogers’ AFPAC speech, presented as Christian ideology, was littered with anti-Semitic statements.",
    "Fuentes views societal change in the U.S. as the “bastardized Jewish subversion of the American creed.",
    "This is the person Arizona U.S. Rep. Paul Gosar calls a young conservative Christian man.",
    "Recently, state Sen. Wendy Rogers spoke at the America First Political Action conference.",
    "Rogers, Fuentes may call themselves Christians\nLet me use an example from Arizona.",
    "It says that hatred, violence or condemnation in the name of Jesus will not stand.",
    "She called for her enemies (those who disagree with her) to be hanged on gallows.",
    "America First was founded by Nick Fuentes, labeled a white nationalist.",
    "Every year a call to arms is sounded to put Christ back into Christmas.",
    "Tim Wright is pastor of Community of Grace Lutheran Church in Peoria.",
    "Grace will have the final word, even in the lives of those who hate.",
    "Jesus didn’t come to break things but to put things back together.",
    "Jesus didn’t vent hatred at the enemies of his people, the Jews.",
    "And love your neighbor as yourself.”\nJesus didn’t condemn.",
    "Jesus didn’t feed into the anger and grievances of people.",
    "The cross of Jesus stands as the line in the sand.",
    "It’s just not coming from where we think it is.",
    "There is, however, a real War on Christianity.",
    "But they don’t seem to know it or believe it.",
    "She praised white nationalists as patriots.",
    "He held up love and grace as alternatives.",
    "He treated them with dignity and respect.",
    "Reach him at Tim@boldrecklessgrace.org.",
    "I do believe that Jesus loves them.",
    "Because that Jesus doesn’t exist.",
    "He built an inclusive tent.",
    "He spoke grace and truth.",
    "Jesus didn’t exclude.",
    "Jesus didn’t lie.",
    "Nor should he be.",
    "He restored."
  ]
}