{
  "id": 9051,
  "mediaId": 2522,
  "date": "2022-03-25",
  "headline": "Girl, you mad? Cheney blasts McCarthy for not rejecting MAGA candidates, and ultimate snub",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/03/SG-SG-Kevin-McCarthy-Liz-Cheney-split.jpg",
  "link": "https://www.bizpacreview.com/2022/03/25/girl-you-mad-cheney-blasts-mccarthy-for-not-rejecting-maga-candidates-and-endorsing-her-challenger-1217127/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "https://www.bizpacreview.com/author/terresa-monroe-hamilton/",
  "termIds": [
    2443,
    1761,
    5209,
    2765,
    2887,
    4066,
    1126,
    6056
  ],
  "sentences": [
    "Cheney retweeted his sentiments in apparent approval of his phrasing and linked to a CNN story it first appeared in where McCarthy called his endorsement of Harriet Hageman, Cheney’s Trump-endorsed GOP challenger, a “special case.”\nMcCarthy has decided to endorse only one primary challenger ahead of the 2022 midterms… Liz Cheney’s.",
    "SIGN UP HERE\nAn angry and desperate Rep. Liz Cheney (R-WY) unleashed her spokesperson Jeremy Adler on House GOP Leader Kevin McCarthy (R-CA) Thursday, who excoriated him for endorsing her 2022 midterm election opponent and not rejecting right-wing, Trump supporters in the Republican Party.",
    "\"A leader with honor would be rejecting — not protecting — the pro-Putin, anti-Semitic, white nationalist members of the party, instead of fighting against Liz Cheney for telling the truth,\" Jeremy Adler, Cheney's spokesman, said in a statement to CNN.",
    "The GOP leader is hosting a fundraiser on March 30 for Hageman at the home of his longtime friend and adviser Jeff Miller, with over 100 House Republicans topping the invite list in a huge show of support, according to The Daily Caller.",
    "“A leader with honor would be rejecting – not protecting – the pro-Putin, anti-Semitic, white nationalist members of the party, instead of fighting against Liz Cheney for telling the truth,” Adler proclaimed via Twitter.",
    "Both Cheney and Rep. Adam Kinzinger (R-IL) were censored by Republicans for aligning with the Democrats on the Jan. 6 investigation that is pursuing Trump supporters as well as the former president himself.",
    "He has also thrown his political weight behind Reps. Marjorie Taylor Greene, Madison Cawthorn, and Paul Gosar, who are very popular in the Republican Party, not so much in Democratic circles.",
    "McCarthy has given his endorsement to Harriet Hageman, a Trump-backed congressional candidate in Wyoming and an attorney who specializes in water and natural resources issues.",
    "https://t.co/8qqF31hn7b\n— Liz Cheney (@Liz_Cheney) March 24, 2022\nNews of the fundraiser for Hageman comes as House Republicans gather in Florida for their annual retreat.",
    "(Video Credit: NBC News)\nThe left is seizing on McCarthy’s support of Greene and Gosar, who both appeared remotely at a so-called white nationalist conference in February.",
    "Greene also got attention when she criticized Ukrainian forces, claiming they are filled with “Nazis.” She also allegedly asserted that they can’t win a war with Russia.",
    "McCarthy is focusing on unifying members ahead of the 2022 midterm elections where the GOP is hoping to recapture its majority in the House and possibly in the Senate.",
    "Since Republicans in her state are overwhelmingly against her now, Cheney is hoping that Democrats and Independents will support her and help win her reelection.",
    "McCarthy also told CNN he is still supporting the other nine Republicans who joined Liz Cheney in voting to impeach former President Donald Trump.",
    "A few Cheyenne Wyoming Republicans posted that they expect to be bombarded very soon by out of town Democrats to help Liz Cheney in Wyoming.",
    "She replaced the Wyoming congresswoman as the chair of the House Republican Conference after Cheney was ousted for being too anti-Trump.",
    "— Catturd ™ (@catturd2) March 25, 2022\nNext year at this time you’ll be asking people if they want fries with that shake?",
    "Greene contends that she did not know the background and history of the event’s host, political commentator Nick Fuentes.",
    "Kinzinger announced he will retire from politics after this year, but Cheney is running again to keep her House seat.",
    "Cawthorn reportedly called Ukrainian President Volodymyr Zelenskyy a “thug.” McCarthy denounced that claim.",
    "— Kevin Booker (@Booker10038) March 24, 2022\nEight more months before you lose your primary by 40 points.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "— Vince Langman (@LangmanVince) March 25, 2022\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "Wyoming allows voters to register for a political party on election day.",
    "Rep. Elise Stefanik of New York will also headline the event.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "The public will not see it and we do not share it.",
    "Enjoy."
  ]
}