{
  "id": 9190,
  "mediaId": 2724,
  "date": "2022-03-21",
  "headline": "McCarthy Vows To Kick Adam Schiff Off Intel Committee If GOP Wins Back The House",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/03/2022.03.21-09.39-thepoliticalinsider-623847d80c094.jpg",
  "link": "https://thepoliticalinsider.com/mccarthy-vows-to-kick-adam-schiff-off-intel-committee-if-gop-wins-back-the-house/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rusty Weiss",
  "authorUrl": "https://thepoliticalinsider.com/author/rusty-weiss/",
  "termIds": [
    4066,
    3858,
    3953,
    3448,
    4905,
    2441,
    1708,
    2187,
    1478,
    1126,
    392
  ],
  "sentences": [
    "“That’s been clear for well over a year now that they’ve been pushing this false narrative about the vice president and his son.”\n“This whole smear on Joe Biden comes from the Kremlin,” says House Intelligence Chairman Adam Schiff, reacting to the FBI leading an investigation into whether unverified emails about Hunter Biden are tied to a Russian disinformation effort targeting his father’s campaign.",
    "[…] In a new Congress, he will not be.” https://t.co/Y3XoXlIgr5 pic.twitter.com/NQZx8XnuMI\nRELATED: Report: McCarthy Will Oust Omar, Schiff, And Swalwell From Committee Assignments If GOP Wins The House\nMcCarthy Vows to Oust Adam Schiff\nMcCarthy noted how as Intel Committee chairman, Adam Schiff helped peddle the false narrative that Hunter Biden’s laptop was little more than Russian disinformation.",
    "Intelligence officials believe” that a suspected Chinese spy “had a sexual relationship with” Democrat Rep. Eric Swalwell (CA) and that Swalwell’s office couldn’t comment on it because they said that info might be “classified”pic.twitter.com/biV78uVZHB\n— Ryan Saavedra (@RealSaavedra) December 9, 2020\nMcCarthy also hinted at Omar’s (D-MN) ouster in the same interview.",
    "pic.twitter.com/DMSaw5MdSf\n— The Situation Room (@CNNSitRoom) October 16, 2020\nSchiff doubled down in the same interview: “Clearly, the origins of this whole smear are from the Kremlin, and the president [Trump] is only too happy to have Kremlin help and try to amplify it.”\nMcCarthy said Schiff is only motivated by politics.",
    "https://t.co/fagwsPPs1U\n— Breitbart News (@BreitbartNews) January 10, 2022\nMcCarthy has also insisted that Republicans who have been removed from their committee assignments by Democrats for political reasons over controversial comments will be restored to committees, perhaps even finding themselves in better roles.",
    "“This is a new level of what the Democrats have done.”\nAdam Schiff’s office said it would be “catastrophic” if Republicans take the House in 2022 and remove him from the intelligence committee, as Minority Leader Kevin McCarthy told Breitbart News he would do in an exclusive interview.",
    "“They may have other committee assignments.”\nIn fact, he added, “They may have better committee assignments.”\nGreene was removed from the Education and Labor Committee as well as the Budget Committee for ill-advised social media posts made prior to her election to office.",
    "“You cannot make this committee political, you cannot use it as a position of chairman to lie, and you should be focused on what the American people want you to be focused on around the world,” McCarthy continued.",
    "Earlier this year, the Republican leader said he plans to remove Schiff and fellow Democrat Representatives Ilhan Omar and Eric Swalwell from their committee assignments should the GOP win back the House in 2022.",
    "He noted that Swalwell (CA) cannot get a security clearance in the private sector and should therefore not be serving on any committees, a reference to the Democrat’s alleged relationship with a Chinese spy.",
    "— Kevin McCarthy (@GOPLeader) March 20, 2022\nRELATED: McCarthy May Give Marjorie Taylor Greene, Paul Gosar ‘Better’ Committee Assignments If GOP Takes Back Congress\nWill McCarthy Boot Omar and Swalwell Too?",
    "Republican House Minority Leader Kevin McCarthy vowed to remove Democrat Adam Schiff of Russiagate fame from the House Intelligence Committee should Republicans win back the majority in the midterms.",
    "This isn’t the first time McCarthy has vowed to remove Adam Schiff from the House Intelligence Committee, though the Hunter Biden laptop episode adds more fuel to the fire.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "Schiff, like many who supported Joe Biden’s candidacy leading up to the election, told the American people not to believe reports regarding Hunter’s laptop.",
    "McCarthy, during a press conference on Friday, accused Schiff of undermining the integrity of the committee by using it as a political football.",
    "Gosar was removed from the Committee on Oversight and Reform and the Natural Resources Committee after posting a parody cartoon video.",
    "“Two years ago, Schiff stated the emails found from Hunter Biden were all a whole smear on Joe Biden that comes from the Kremlin.",
    "The Political Insider reported last week that the New York Times had “authenticated” emails from the President’s son’s laptop.",
    "“They’ll have committees,” McCarthy vowed of Representatives Marjorie Taylor Greene (R-GA) and Paul Gosar (R-AZ).",
    "Sign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "“We know that this whole smear on Joe Biden comes from the Kremlin,” he said in an interview with CNN.",
    "In a new Congress, if it’s a new majority, he will not be,” the California Republican openly wondered.",
    "“The worst part of it is, you cannot trust what he tells you, that he lies to us,” said McCarthy.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "“Why is he still chair of the committee and why is he still even on the committee?",
    "Schiff has been serving as the House Intelligence Committee chairman since 2019.",
    "Why is Speaker Pelosi still allowing him to be on the Intelligence Committee?",
    "@GOPLeader: “What did we just find out yesterday from the New York Times?",
    "About meeting with the “whistleblower.” And about Hunter Biden’s laptop.",
    "“Ilhan Omar should not be serving on Foreign Affairs,” McCarthy said.",
    "That’s what the head of the Intel said,” McCarthy explained.",
    "“Adam Schiff lied to us one more time.”\nAdam Schiff lied.",
    "Why is he still chair of the Intelligence Committee?",
    "And yes, Adam Schiff lied to us one more time.",
    "Yes, it is Joe Biden’s laptop.",
    "Tucker Carlson says that “U.S.",
    "About Russian collusion.",
    "."
  ]
}