{
  "id": 9226,
  "mediaId": 8484,
  "date": "2022-03-24",
  "headline": "Cheney knocks McCarthy for backing her rival but not those of 'pro-Putin' lawmakers",
  "image": "https://i.dailymail.co.uk/1s/2022/03/24/22/55770629-0-image-a-159_1648160955128.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10649763/Cheney-knocks-McCarthy-backing-rival-not-pro-Putin-lawmakers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "whatdoesitmean.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nikki Schwab",
  "authorUrl": "",
  "termIds": [
    1761,
    2187,
    2765,
    2443,
    5037,
    2887,
    4066,
    3702,
    1126,
    6569
  ],
  "sentences": [
    "+6\nView gallery\nA spokesperson for Republican Rep. Liz Cheney slammed the House's GOP Leader Kevin McCarthy for endorsing Cheney's primary challenger instead of condemning the right-wing members of his party\n+6\nView gallery\nCheney shared Adler's statement in a tweet and linked it to the CNN story it appeared in that called McCarthy's endorsement of Harriet Hageman, Cheney's Trump-backed GOP challenger, a 'special case'\nThe story notes that McCarthy has backed only one primary challenger ahead of the 2022 midterms - that of Cheney's - and not anyone trying to take out controversial Republican members including Reps. Marjorie Taylor Greene or Paul Gosar.",
    "She's one of two Republicans serving on the House's select committee on January 6, with the other GOP lawmaker, Rep. Adam Kinzinger, retiring\n+6\nView gallery\nRep. Marjorie Taylor Greene (pictured) has been criticized for comments she's made about Ukraine, has been accused of pushing anti-Semitic conspiracy theories and recently spoke at a white nationalist gathering, which she said was a mistake\nGreene was seen not clapping when Ukraine's President Volodymyr Zelensky addressed Congress last week.",
    "'A leader with honor would be rejecting - not protecting - the pro-Putin, anti-Semitic, white nationalist members of the party, instead of fighting against Liz Cheney for telling the truth,' spokesman Jeremy Adler said Thursday.",
    "Greene also continued to turn heads this week by criticizing the Ukrainian forces - suggesting they're filled with 'Nazis,' and won't be able to win the war against Russian President Vladimir Putin's forces.",
    "Cheney, however, is attempting to keep her House seat - and hoping her state's law that allows voters to register for a political party on election day will have Democrats and independents coming to her aid.",
    "Cheney shared Adler's statement in a tweet and linked it to the CNN story it appeared in that called McCarthy's endorsement of Harriet Hageman, Cheney's Trump-backed GOP challenger, a 'special case.'",
    "A spokesperson for Republican Rep. Liz Cheney slammed the House's GOP Leader Kevin McCarthy for endorsing Cheney's primary challenger instead of condemning the right-wing members of his party.",
    "McCarthy told CNN he still supported the other nine Republican lawmakers who voted for the second impeachment of former President Donald Trump alongside Cheney.",
    "Putin has pushed that Russia invaded Ukraine to 'denazify' the country and has tried to characterize the Ukrainians as the aggressors.",
    "+6\nView gallery\nMcCarthy (pictured) has singled out Cheney as the only lawmaker in his caucus he won't support for re-election.",
    "The other Republican lawmaker on the committee, Rep. Adam Kinzinger, has already announced his retirement after this year.",
    "Additionally, Republican Rep. Madison Cawthorn called Zelensky a 'thug,' which McCarthy criticized and said was 'wrong.'",
    "Cheney has received his ire, however, for her participation on the Democrat-led January 6 select committee.",
    "On multiple occassions, McCarthy has had to condemn Greene for spouting anti-Semitic conspiracy theories.",
    "Both Greene and Gosar, who appeared virtually, addressed a white nationalist conference in February.",
    "She also said that Ukraine 'poked the bear' of Russia, which is why the country was invaded.",
    "Greene later said she didn't know the backstory of the organizer."
  ]
}