{
  "id": 9289,
  "mediaId": 2643,
  "date": "2022-03-30",
  "headline": "McCarthy Slammed for Being Harsher on Cawthorn Than Marjorie Taylor Greene",
  "image": "",
  "link": "https://www.newsweek.com/mccarthy-slammed-being-harsher-cawthorn-marjorie-taylor-greene-1693534",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexandra Hutzler",
  "authorUrl": "https://www.newsweek.com/authors/alexandra-hutzler",
  "termIds": [
    4066,
    4039,
    5357,
    5575,
    5399,
    2187,
    1394,
    1126,
    128,
    6456
  ],
  "sentences": [
    "\"I reaaaally don't want to sound like I'm defending Cawthorn here, but does anyone find it weird how much angrier McCarthy sounds about a backbencher mouthing off about some blow than he ever did about Marjorie Taylor Greene publicly embracing a neo-Nazi??\"",
    "\"I mean, being kind of a young guy in Washington, where the average age is probably 60 or 70—you know, I look at all these people, a lot of them that I've always looked up to through my life, always paid attention to politics, guys that, you know.",
    "McCarthy said Wednesday he met with Cawthorn after the freshman lawmaker from North Carolina said he's been invited by his colleagues in Washington, D.C., to orgies and witnessed some politicians doing cocaine.",
    "The House minority leader's remarks were met with backlash on social media as users quickly noted that he was less severe in his response to Greene's attendance at a white nationalist event in late February.",
    "Cawthorn made the controversial claims during an appearance on the Warrior Poet Society podcast, describing Capitol Hill as similar to the television drama series House of Cards.",
    "Favreau tweeted, \"Note that Kevin McCarthy did not say Marjorie Taylor Greene lost his trust after she attended a white nationalist rally where they cheered Putin.\"",
    "\"You can't make statements like that as a member of Congress, it affects everybody else and the country as a whole,\" McCarthy said, per Politico's Olivia Beavers.",
    "Republican House Minority Leader Kevin McCarthy is being criticized for appearing to come down harder on Rep. Madison Cawthorn than Rep. Marjorie Taylor Greene.",
    "\"McCarthy laying down the law against Cawthorn—in a way he's resisted doing against MTG or Gosar,\" National Journal columnist Josh Kraushaar wrote on Twitter.",
    "He's going to have to earn it back,\" McCarthy told reporters, adding that he laid out during the conversation everything he found \"unbecoming.\"",
    "McCarthy said at the time he had spoken with Greene and that \"she will not go again\" to the conference, but he declined to punish her further.",
    "Then all of the sudden you get invited to, like, 'Oh hey, we're going to have kind of a sexual get-together at one of our homes.",
    "McCarthy also told reporters Wednesday that Cawthorn admitted to exaggerating some of his claims about orgies and cocaine use.",
    "Arizona Republican Paul Gosar was also at the America First Political Action Conference (AFPAC) in Florida.",
    "AFPAC was founded by Nick Fuentes, who the anti-defamation league describes as a \"white supremacist.",
    "Newsweek reached out to McCarthy's office for comment but didn't immediately receive a response.",
    "Jon Favreau, co-host of the podcast Pod Save America, had a similar reaction.",
    "Axios reported that McCarthy also threatened further action against Cawthorn.",
    "Tiana Lowe, a commentary writer at the Washington Examiner, posted online.",
    "ET: This story was updated with more information and background.",
    "\"There's a lot of different things that can happen,\" he said.",
    "You should come,'\" Cawthorn said.",
    "Update 03/30/22, 4:50 p.m.",
    "\"He's lost my trust."
  ]
}