{
  "id": 9511,
  "mediaId": 2872,
  "date": "2022-03-30",
  "headline": "Madison Cawthorn’s coke orgy comments earned him a very stern talking-to",
  "image": "https://imgix.bustle.com/uploads/getty/2022/3/30/9a46edf9-32a1-4588-b2ff-9aee5ab1ebbd-getty-1236654227.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg",
  "link": "https://www.mic.com/impact/madison-cawthorns-cocaine-orgy-kevin-mccarthy",
  "mediaOutlet": "Mic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rafi Schwartz",
  "authorUrl": "https://www.mic.com/profile/rafi-schwartz-21790733",
  "termIds": [
    4066,
    4698,
    5399,
    1126,
    1270,
    6456
  ],
  "sentences": [
    "In regards to Cawthorn’s allegations that he’d witnessed a conservative figure doing a “key bump,” McCarthy told a gaggle of congressional reporters that Cawthorn told him that he actually “thinks he saw maybe a staffer in a parking garage maybe 100 yards away” and isn’t totally sure of what he’d actually seen.",
    "On Wednesday, McCarthy followed up on his promise to have a little chat with the freshman congressman from North Carolina, nearly a week after Cawthorn claimed he’d witnessed conservatives he’d once looked up to in Washington doing “a key bump of cocaine” and had even been invited to an orgy by one of them.",
    "And so, like a moody high schooler hauled into the principal’s office, Cawthorn met with McCarthy, along with Republican whip Rep. Steve Scalise, on Wednesday, where McCarthy claims Cawthorn walked back some of the more salacious elements of his allegations and generally endured a real stern talkin’-to.",
    "“It affects everybody else and the country as a whole.”\nMcCarthy added that he’d warned Cawthorn that he needed to take concrete action both professionally and in “his own life” in order to earn his trust back, and that failure to do so could lead to further consequences.",
    "McCarthy’s pull-up-a-chair-“now-listen-here-son” shtick doesn’t carry nearly as much weight as it might coming from someone who actually seemed interested in upholding the spotless moral reputation of the Republican Party.",
    "about murdering their Democratic colleagues — to say nothing of the fact that Greene, Gosar, Cawthorn, and plenty of others have still faced zero repercussions for helping instigate a full-blown attempted coup.",
    "Sure, as the most powerful Republican in the House, he embodies a laundry list of abhorrent policies that appeal to the worst, most xenophobic, avaricious, hypocritical impulses in this country.",
    "This is a man, after all, who vowed to re-seat Reps. Marjorie Taylor Greene and Paul Gosar after they were stripped of their committee assignments for palling around with Nazis and joking (??)",
    "After Cawthorn said he had been invited to drug-fueled “sexual get-togethers” by conservatives, House Minority Leader Kevin McCarthy had a little chat with him.",
    "Cawthorn, for his part, probably shouldn’t expect to be invited to any more high-profile Republican orgies — real or imaginary — anytime soon.",
    "That the claims were fairly ridiculous on their face seems to have been less of a concern to McCarthy (why didn’t Cawthorn name names, huh?)",
    "We may never know) considering how little credibility McCarthy has when it comes to actually disciplining members of his own caucus.",
    "It’s hard to imagine Cawthorn worrying too much about McCarthy’s implied threats (of what?",
    "“You can’t make statements like that as a member of Congress,” McCarthy told the press.",
    "Tom Williams/CQ-Roll Call, Inc./Getty Images\nAt a certain point, I almost – almost!",
    "But on the other hand, he also has to deal with Madison Cawthorn.",
    "embarrassed the GOP in the service of boosting his own profile.",
    "— feel sorry for House Minority Leader Rep. Kevin McCarthy.",
    "than the fact that Cawthorn had inadvertently (?)",
    "More lectures?"
  ]
}