{
  "id": 11391,
  "mediaId": 2589,
  "date": "2022-03-11",
  "headline": "Congressional delegation did what Kamala did not do - they went to the border of Poland and Ukraine",
  "image": "https://media.townhall.com/townhall/reu/o/2016/8/5425bf2d-44cf-45b5-a4d6-485f7b4d76bf-1110x740.jpg",
  "link": "https://hotair.com/karen-townsend/2022/03/11/congressional-delegation-did-what-kamala-did-not-do-they-went-to-the-border-of-poland-and-ukraine-n454698",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Townsend",
  "authorUrl": "https://hotair.com/author/karen-townsend",
  "termIds": [
    0
  ],
  "sentences": [
    "“War in Europe has focused the energies of Congress to getting something done and getting it done fast,” said Senate Majority Leader Chuck Schumer, D-N.Y.\nSenate Minority Leader Mitch McConnell, R-Ky., said the measure would provide loan guarantees to Poland to help it replace aircraft it is sending Ukraine.",
    "“I decided that I had a responsibility as the chair of this committee to go, and I went to Mr. McCaul and he felt the same way.”\n“He came across and he was just talking about how they will fight and they will never give up and they’re going to win,” Meeks said of Kozytskyy.",
    "Another $6.7 billion was for the deployment of U.S. troops and equipment to the region and to transfer American military items to Ukraine and U.S. allies, and there was economic aid and money to enforce economic sanctions against Russia as well.",
    "The delegation didn’t go into Ukraine, they stayed on the Polish side of the border, but the governor of Lviv, Maksym Kozytskyy, left his city to go and talk to them on the border.",
    "It needs to be passed quickly.”\nPerhaps one day Kamala will travel closer to the epicenter of the humanitarian crisis and see for herself what is going on if the war lasts longer.",
    "A bipartisan delegation of congressional lawmakers traveled to the border of Poland and Ukraine to see for themselves the plight of Ukrainians as Putin continues his invasion.",
    "“It made me and a number of others almost want to break down in tears.”\nMeeks travels frequently and was in Ukraine less than a month ago before Putin invaded the country.",
    "The trip was organized by Rep. Gregory Meeks (D-NY), chair of the House Foreign Affairs Committee and the top Republican on the committee, Rep. Michael McCaul (R-TX).",
    "And he’s going to get his in the end.”\nThe amount of aid in the $10B bill is a small amount, relatively speaking, but Ukrainians will need all the help they can get.",
    "The House passed $13.6 billion in Ukraine aid– more than the $10 billion the Biden administration requested as part of a $1.5 trillion spending bill on Thursday.",
    "Over $4 billion of the Ukraine aid was to help the country and Eastern European nations cope with the 2 million refugees who’ve already fled the fighting.",
    "Poland was the first border country to offer its hospitality to Ukrainians looking to leave as the country came under attack by Putin’s forces.",
    "The delegation also met with Secretary of State Blinken, local officials, and received briefings from the U.S. Army 82nd Airborne Division.",
    "The lawmakers did what the vice-president did not do on her two-day NATO tour this week – they went to the border and she did not.",
    "I didn’t know what else to do.”\nOther members of Congress on the trip were Reps Victoria Spartz,(R-IN); David Cicilline,(D-R.I.).",
    "…There’s only one person that’s responsible for the tragedy that’s taking place right now … and his name is Vladimir Putin.",
    "That trip made him go back and talk to McCaul about helping to organize a bipartisan congressional delegation.",
    "But he was just saying ‘we are not ever going to give up.’ When he was finished, he moved me so much.",
    "I couldn’t sleep at night,” Meeks said of images of destruction he saw from the news reports of war.",
    "Meeks thinks the trip brought both sides together to work on passing an aid package for Ukrainians.",
    "“It’s been like pulling teeth” to get Democrats to agree to some of the defense spending, he said.",
    "Putin will likely continue to destroy Ukraine and people are now refugees in bordering countries.",
    "“It’s just horrific,” Meeks told Fox News Digital of the scenes at the Poland-Ukraine border.",
    "; Brian Fitzpatrick, (R-PA); Raul Ruiz,(D-CA), Susan Wild, (D-PA); and Gerry Connolly,(D-VA).",
    "In the $13.6 is loan guarantees to Poland to replace aircraft it is sending to Ukraine.",
    "Kamala avoids borders whenever possible when it comes to human beings crossing them.",
    "They witnessed the humanitarian crisis of Ukrainian refugees fleeing into Poland.",
    "“… It is a betrayal of mankind for him to do what he’s doing.",
    "Spartz is the first Ukrainian-American to serve in Congress.",
    "“They wanted to get the ammunition that was needed.",
    "“Putin is a brutal, evil person,” Meeks said.",
    "But he added, “It’s an important step.",
    "She was born and raised there.",
    "It needs to be passed.",
    "I had to hug him.",
    ".",
    "."
  ]
}