{
  "id": 11549,
  "mediaId": 2644,
  "date": "2022-03-14",
  "headline": "Bipartisan group of lawmakers urge Biden to send jets to Ukraine",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/congress-ukraine-wepaons-comp.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/14/bipartisan-group-of-lawmakers-urge-biden-to-send-jets-to-ukraine/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Moore",
  "authorUrl": "",
  "termIds": [
    4591,
    4905,
    5051,
    3702,
    3942,
    1755,
    6672,
    6526,
    6569
  ],
  "sentences": [
    "Risch of Idaho said the US has to be careful about directly confronting Russia, but “I wouldn’t call it World War III,” he said on “Fox News Sunday.”\n“I think if the thing did get away there, I think it would end pretty quickly because with the conventional forces that he’s had there, you know, we haven’t seen this kind of ineptness in a long, long time,” he said.",
    "Ukraine President Volodymyr Zelensky has repeatedly pleaded with the US and its allies to allow Poland to deploy the aircraft to help repel Russia’s invasion, but Biden warned that the planes could provoke Russian leader Vladimir Putin and potentially expand the war into Europe and even spark World War III.",
    "“The idea that we’re going to send in offensive equipment and have planes and tanks and trains going in with American pilots and American crews — just understand, don’t kid yourself, no matter what y’all say, that’s called World War III,” Biden told a gathering of Democrats last Friday in Philadelphia.",
    "“Providing Soviet-era platforms that Ukrainian servicemembers have previously operated and maintained will be essential to their success on the battlefield and will also protect U.S. defense technology from falling into the hands of the Russians,” the caucus wrote.",
    "The group, led by Reps. Brian Fitzpatrick (R-Pa.) and Josh Gottheimer (D-NJ), called for sending Stinger surface-to-air missiles to help Ukraine combat Russian aircraft as well as drones that have been found to be particularly effective against ground troops.",
    "The White House, along with its Western allies, has targeted Russian banks, Putin and his circle of oligarchs with severe sanctions that have caused the value of the ruble to plummet to record lows and put the Russian economy on the verge of collapse.",
    "Addressing Poland’s offer, they wrote: “We urge assistance to help facilitate this deal, commit to replenishing our allies’ fleets with American-made aircraft and help advance the transfer of Su-25 aircraft to Ukraine as well.",
    "It has also authorized more than $2 billion in security assistance to Ukraine since January 2021 and recently said it would rush $200 million in small arms, anti-tank and anti-aircraft weapons.",
    "?Two Republican senators, during appearances on Sunday news shows, disputed Biden’s contention that sending the planes into a war zone would set off World War III or a nuclear conflagration.",
    "?A bipartisan group of congressional lawmakers are urging President Biden ?to ?stop being a stumbling block to Poland’s offer to send MiG-29 jet fighters to the “heroic” Ukrainian forces.",
    "The refusal to send the planes to Ukraine stirred the ire of many lawmakers, who accused Biden of kowtowing to Putin and abandoning fighters in Ukraine trying to save their homeland.",
    "The 58 members of the House Problem Solvers Caucus called the transfer of the Soviet-era MiG fighters necessary for Ukrainians to help control the skies and defend their country.",
    "This is a pragmatic solution to expeditiously provide the Ukrainians with aircraft that Ukrainian pilots have flown and their servicemembers can maintain,” the lawmakers said.",
    "Russia’s advantage in this domain could soon develop into air dominance if the Ukrainians do not receive necessary military aid,” the lawmakers wrote in a statement Sunday.",
    "But while it was unclear whether Polish or American pilots would fly the planes into Ukraine, the Biden administration feared adding them to the conflict would escalate it.",
    "Sen. Jim Risch, the ranking Republican on the Senate Foreign Relations Committee, also said the fighting in Ukraine is unlikely to escalate into World War III.",
    "I think you always have to be wary of that.”\nBut he was critical of the Biden administration for being too slow in providing military assistance to Ukraine.",
    "The pols urged Biden to take immediate steps to supply Ukraine with missile defense systems and drones as well in their fight against the Russian invasion.",
    "Sen. Mitt Romney of Utah ?joined with other Republicans last week to sign a letter calling on the administration to “expedite the transfer” of the planes.",
    "Poland, a NATO member, ?proposed flying the 28 MiGs to Ramstein Air Base in Germany, from where the US would deliver them to Ukraine.",
    "“It’s not going to be World War III,” Sen. Lindsey Graham (R-SC) said on Fox News’ “Sunday Morning Futures.”\n“This is all a bluff.",
    "“By blocking Polish MiG-29s, Biden is allowing Vladimir Putin to define what is ?’?escalatory,'” Sen. Tom Cotton (R-Ark.)",
    "And the only way this war ends is with Putin either going to jail or be taken out by his own people,” the senator said.",
    "“I’m calling for the crushing of the Russian economy, even though our war and fight is not with the Russian people.",
    "So, if he ordered a preemptive strike on the United States, some general would shoot him in the head,” Graham said.",
    "“Despite heroic and skillful resistance by Ukrainian forces, Russia currently retains air superiority over Ukraine.",
    "Get the latest updates in the Russia-Ukraine conflict with The Post’s live coverage.",
    "But the administration has remained resolute against transferring the fighter jets.",
    "Get them the MiGs?,” he said during a news conference on Capitol Hill.",
    "It will only encourage Putin’s aggression?,” he continued in the post.",
    "People say, well maybe that’s not the ideal weapon for them.",
    "It’s been too little, too late from the beginning,” he said.",
    "“The administration has projected weakness throughout this.",
    "Putin knows that no one wins a nuclear exchange.",
    "They have the eyes to determine what they want.",
    "Send them the planes that they need.",
    "“So I’m not as concerned about that.",
    "That is what they say they want.",
    "“?This weakness is pathetic.",
    "They say they need MiGs.",
    "wrote on Twitter.??",
    "People are dying.",
    "It is with Putin.",
    "They are there.",
    "They want MiGs.",
    "“Enough talk.",
    "?"
  ]
}