{
  "id": 12464,
  "mediaId": 8412,
  "date": "2022-03-23",
  "headline": "Lawmakers, Yellen mull freezing Russian gold reserves",
  "image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/02/0/0/Janet-Yellen-Inflation-AP.jpg?ve=1&tl=1",
  "link": "https://www.foxbusiness.com/politics/lawmakers-yellen-mull-freezing-russian-gold-reserves",
  "mediaOutlet": "Pocono News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Megan Henney",
  "authorUrl": "https://www.foxbusiness.com/person/h/megan-henney",
  "termIds": [
    0
  ],
  "sentences": [
    "The raft of sanctions from the West includes cutting off a key part of the Central Bank of Russia by preventing it from selling dollars, euros and other foreign currencies in its roughly $630 billion reserve stockpile; blocking certain financial institutions from the Swift messaging system for international payments; and sanctioning some of the Russian elites who have close ties to President Vladimir Putin.",
    "A bipartisan group of House lawmakers, including Reps. Elissa Slotkin, D-Mich, Mikie Sherrill, D-N.J., Peter Meijer, R-Mich., Susie Lee, D-Nev., Joe Wilson, R-S.C., and Brian Fitzpatrick, R-Pa., have introduced a companion bill to freeze Russian gold.",
    "There is concern that Russia could use its gold reserves to shore up the ruble and evade the global sanctions intended to penalize the Kremlin over its invasion of Ukraine nearly one month ago, the biggest attack on a European state in decades.",
    "A bipartisan group of senators is working with the Treasury Department to prevent Russia from liquidating its giant stash of gold, potentially blocking one of the Kremlin's last methods for circumventing punishing financial sanctions.",
    "Angus King, I-Maine, John Cornyn, R-Texas, Bill Hagerty, R-Tenn., and Maggie Hassan, D-N.H., to discuss the legislation that would target Russia's ability to sell gold reserves, a Treasury spokesperson told FOX Business.",
    "\"By sanctioning these reserves, we can further isolate Russia from the world’s economy and increase the difficulty of Putin’s increasingly-costly military campaign,\" King said in a statement.",
    "(AP Photo/Jacquelyn Martin / AP Newsroom)\nThe legislation under consideration would impose secondary sanctions on any American entities knowingly buying or selling Russian gold.",
    "Moscow stopped buying gold in 2020 when the COVID-19 pandemic pushed prices sky-high, but announced last month that it would resume buying from domestic producers.",
    "If the U.S. moves to crack down on gold transactions, it could deter banks in places like China or India from buying or lending against Russia's reserves.",
    "Russia began furiously stockpiling gold in 2014, when the U.S. sanctioned the Kremlin over its annexation of Crimea, more than doubling its holdings.",
    "Russia’s gold stockpile was estimated to be worth $132.3 billion as of the end of January – the world's fifth-biggest stockpile.",
    "\"Secretary Yellen regularly meets with members of Congress to discuss legislation,\" the person said.",
    "\"Additionally, Treasury staff frequently provide technical assistance on sanctions bills.\"",
    "Lawmakers originally wanted to include it as part of a must-pass omnibus spending bill.",
    "The senators have suggested the bill could pass as soon as this week.",
    "Treasury Secretary Janet Yellen will meet this week with Sens.",
    "The U.S. also ordered a ban on Russian oil imports.",
    "The news was first reported by Axios."
  ]
}