{
  "id": 12586,
  "mediaId": 2746,
  "date": "2022-03-03",
  "headline": "Biden faces bipartisan pressure to ban Russian oil and ramp up U.S. production",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/03/Russia_Ukraine_War_Congress_Energy_46270.jpg-fdc72_c0-305-4701-3047_s1200x700.jpg?3ace1ddc608f6944ca6a373baa5a8a40f8ba395f",
  "link": "https://www.washingtontimes.com/news/2022/mar/3/biden-faces-bipartisan-pressure-ban-russian-oil-an/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ramsey Touchberry",
  "authorUrl": "https://www.washingtontimes.com/staff/ramsey-touchberry/",
  "termIds": [
    5510,
    3246,
    2976,
    2859,
    6569,
    6678,
    6672
  ],
  "sentences": [
    "“That is certainly a big factor for the president at this moment.”\nThe opposition from the White House toward a ban appeared to shock and anger Sen. Joe Manchin III, who learned of Ms. Psaki’s comments while speaking with reporters about the bipartisan effort to prohibit Russian imports.",
    "“It will have a major impact on prices, and for politicians to take that responsibility against Putin for what he’s doing is one of the greatest and heroic actions of this century.”\nHouse Speaker Nancy Pelosi, California Democrat, on Thursday endorsed banning Russian oil imports.",
    "But not if we just continue to say, ‘Well, we’re just going to keep doing what we’ve been doing’ and effectively reward Putin.”\nThe list of lawmakers who support the bipartisan legislation to ban Russian oil continued to grow Thursday and spanned across the ideological spectrum.",
    "Despite the opinion among energy strategists and the White House that domestic production would not be able to immediately fill the void left by a ban on Russia, the lawmakers remained hopeful that their bipartisan endeavor could help to end the war.",
    "But the White House remained opposed over concerns that gasoline prices would further rise and that the move would “pad the pockets” of Russian President Vladimir Putin, who could simply sell the oil elsewhere with a higher price tag.",
    "Russia’s invasion of Ukraine has driven lawmakers in Washington from both sides of the aisle to demand what energy market strategists just weeks ago considered unimaginable: a ban on Russian energy imports.",
    "“I would have never thought in my entire lifetime that the U.S. government — in any form — would band together on banning Russian oil supplies,” veteran oil strategist Dan Dicker told The Washington Times.",
    "An embargo on the hundreds of thousands of barrels of Russian oil that the U.S. receives each day would represent a seismic shift in energy policy, likely causing repercussions for Americans’ fuel costs.",
    "“[Putin], you’ve done something nobody else can do.”\nThe list also included House Problem Solvers Caucus leaders Josh Gottheimer, New Jersey Democrat, and Brian Fitzpatrick, Pennsylvania Republican.",
    "The group said American energy companies have the capability to mitigate a spike in gasoline prices by aggressively ramping up production to backfill the deficit left by the lack of Russian energy.",
    "Still, the idea has gained major bipartisan support among lawmakers in recent days, stunning energy market strategists as Moscow’s war on Ukraine has caused the globe to ratchet up its response.",
    "This is life or death.”\nOn Capitol Hill, the bulk of the uncertainty or opposition to a ban lies among Democrats, including Senate Majority Leader Charles E. Schumer of New York.",
    "Last year, about 8% of America’s oil imports came from Russia, or roughly 672,000 barrels a day, according to the Energy Information Administration.",
    "Jon Tester, Montana Democrat; John Hickenlooper, Colorado Democrat; Lindsey Graham, South Carolina Republican; and Rob Portman, Ohio Republican.",
    "I don’t want U.S. dollars to be funding this carnage in Ukraine led by Putin,” said Sen. Lisa Murkowski, Alaska Republican, who backs a ban.",
    "In addition, a bipartisan and bicameral group of lawmakers unveiled an emergency measure that would cease all Russian energy imports.",
    "Proponents of the ban hope that other countries would follow America’s lead, further constricting Mr. Putin‘s ability to fund war.",
    "They have also questioned the degree to which it would impact Mr. Putin because of Russia’s ability to sell to other countries.",
    "That would raise prices at the gas pump for the American people,” White House press secretary Jen Psaki told reporters.",
    "The U.S. accounted for 13% of Russia’s oil exports, which total about 5 million barrels per day across the globe.",
    "“We can help ameliorate the pressure on us, we can help ameliorate the pressure on our allies.",
    "The centrist West Virginia Democrat called the remarks “irresponsible.”\n“They are so wrong.",
    "“So, Nancy Pelosi is with us, which made me wonder: what am I doing?” Mr. Graham quipped.",
    "That equates to the U.S. providing Russia with tens of millions of dollars per day.",
    "“When we talk about an inconvenience, can you imagine living in Ukraine right now?",
    "“We don’t have a strategic interest in reducing the global supply of energy.",
    "Fears about rising costs at the pump have primarily fueled their concerns.",
    "In addition to Mr. Manchin and Ms. Murkowski, it included Sens.",
    "“I think that there is a moral obligation here.",
    "So wrong,” Mr. Manchin said of the White House."
  ]
}