{
  "id": 13057,
  "mediaId": 2740,
  "date": "2022-03-04",
  "headline": "They adopted their son, but then war began. Now the teen waits in Ukraine hoping to get out before call to serve.",
  "image": "https://www.gannett-cdn.com/presto/2022/03/01/NBCC/c2f8238e-76a9-40d4-80c2-70323af4abce-Ukrainian_family_2.jpg?crop=960,540,x0,y192&width=960&height=540&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/world/2022/03/04/ukraine-war-adoption-separation/9359484002/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatodaycomworld-topstories",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peg Quann",
  "authorUrl": "https://www.buckscountycouriertimes.com/staff/3330957001/peg-quann/",
  "termIds": [
    3942,
    3988,
    5595,
    6526,
    6506,
    6309,
    6569,
    6678,
    6672
  ],
  "sentences": [
    "Through that obedience we gained a new son.”\nThe couple is not sure now how they will get Maksym here as the two men who worked with the adoption agency are now in military service in Ukraine, but they remain hopeful and have received some help from the United States Department of State, as well as financial support from two agencies that help families with adoption expenses.",
    "Live updates:Russian troops seize site of nuclear plant fire; Western leaders condemn latest attacks\n“If needed, they will be asking him to fight,” said Yana Osipenko, a friend of Maryana’s who has organized a Facebook campaign to help the couple seek support for an emergency visa for their son.",
    "They are now seeking help from Congressman Brian Fitzpatrick and Pennsylvania Senators Bob Casey and Pat Toomey to ask the Ukrainian government for an expedited visa for their boy “that would increase the chance of our son not only coming home to us but remaining alive,” Maryana said.",
    "The Kravchenkos, who were both born in Ukraine but moved here as children, can only do what they have been doing since they first met Maksym more than three years ago: pray for his safety until he can be reunited with them again.",
    "The Pennsylvania couple adopted the 16-year-old boy last week in Ukraine but because of a 30-day period that a judge ruled needed to be fulfilled before they could take him out of the country, Maksym couldn’t leave with them.",
    "Both my husband and I were born in Ukraine and felt especially drawn to this program.”\nThe couple have three younger children of their own and are devout Christians and members of the Calvary Chapel of Philadelphia.",
    "“When we were told to travel for court, after many delays, our court date fell on the 24th of February, at which point Ukraine was already experiencing attacks from Russian forces and war had broken out,” she said.",
    "Fleeing Ukraine:Black and brown refugees are once again being turned away in Europe amid Ukraine migrant crisis\n“He wants to be in a family and with this comes a move to America, which he doesn’t mind at all.",
    "“Our story has been one of simple faith where God has led us over the course of 3.5 years as we acted in obedience to His Word, which calls us to care for orphans.",
    "LEVITTOWN, Pa. – As they flew back to the United States Monday night from Poland, Dmitriy and Maryana Kravchenko could only pray they would see their son again.",
    "The Kravchenkos had to leave Maksym behind as they traveled two-and-a-half days by car to Poland and safety, so they could return to their three children here.",
    "Maksym is always willing to help and always tries to do the right thing.”\nAnd he’s taken a real liking to America, she said.",
    "They took the Biblical advice to care for a “fatherless child” seriously and decided to open their own home to Maksym.",
    "He has been an orphan for many years and told us he prayed to find a family while traveling to that first host trip.",
    "“We met our son Maksym in 2018 through a program called Open Hearts and Homes for Children,” Maryana said.",
    "“We were literally hearing bombs,” Maryana said of their journey out of the country under siege.",
    "The couple hoped the judge would allow them to take Maksym with them, but it wasn’t to be.",
    "“Our son needs to be with his family.”\nFollow Peg Quann on Twitter: @pegquann.",
    "Fitzpatrick confirmed his office has been in contact with the family.",
    "Casey's office spokesperson said the family was welcome to reach out.",
    "“For years, he waited for us to get him and not once did he complain.",
    "She is a doctor of optometry and her husband is a general contractor.",
    "'A new reality':Ukrainian couple married the day Russia invaded.",
    "“He meshed so well with our family right away,” Maryana said.",
    "He loves America, especially the yummy food and kind people.",
    "The bond only grew through the course of four hostings.",
    "“We’re trying to raise a quiet ruckus,” Maryana said.",
    "“This program hosts orphans from Latvia and Ukraine.",
    "Maksym is now in a bomb shelter with older men.",
    "It’s hard to put into words but he just fit in.",
    "“It felt like he was ours even then.",
    "All three of our children love him.",
    "Then the Russians invaded Ukraine.",
    "Now, they've joined the fight.",
    "He’s very positive."
  ]
}