{
  "id": 1663,
  "mediaId": 8253,
  "date": "2022-02-16",
  "headline": "Local members of Ukrainian, Russian communities worry attack could be near",
  "image": "https://cdn.abcotvs.com/dip/images/11571762_ukraine-russia-crisis.jpg?w=1600",
  "link": "https://6abc.com/russia-ukraine-invasion-philadelphia-residents-iryna-mazur-honorary-consulate/11571366/",
  "mediaOutlet": "6abc.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "TaRhonda Thomas",
  "authorUrl": "https://6abc.com/about/newsteam/tarhonda-thomas",
  "termIds": [
    0
  ],
  "sentences": [
    "MORE: Biden pledges US ready to defuse Russia-Ukraine crisis\n\"Every reasonable person, it doesn't matter where they come from, realizes that what the Russian government does is actually inhumane,\" Mazur said.",
    "\"I still have grandparents who are in Ukraine,\" Grosh said, adding that they live in the central part of the country but are so used to threats by Russia that they are going on about their daily lives.",
    "Pennsylvania Congressman Brian Fitzpatrick, who is co-chair of the Congressional Ukrainian Caucus, is among the lawmakers who introduced a bill calling for sanctions against Russia right now.",
    "The international influence of the area is also a reason why so many people there are invested in what happens as Russian troops continue to position themselves along the borders of Ukraine.",
    "SEE ALSO: Some Russian troops moved to firing positions near Ukraine, Putin said be ready by Feb. 16: Sources\n\"When Putin grabbed Crimea I thought what's going to be the next step?",
    "Mazur says Philadelphia Councilmember David Oh recently hosted an event bringing together people from a number of Eastern European countries as tensions with Russia mount.",
    "Russian President Vladimir Putin insists some troops are moving away from the Ukrainian border\n\"You can never believe anything said by the Russian government,\" said Mazur.",
    "Philadelphia's Honorary Consulate to Ukraine is even affected by the rapidly-changing situation, which has seen tensions ramp up in the past two days.",
    "Signs inside the business are printed in both Ukrainian and Russian, as the agency helps the few people trying to travel to those areas right now.",
    "PHILADELPHIA (WPVI) -- As he loads green grocery bags into his car, Taras Grosh is particularly excited about two of the items he's bringing home.",
    "Bell's Market on Bustleton Avenue is one of the few places he can find the treats since the store caters to both Ukrainian and Russian residents.",
    "\"These are the things I had as a kid,\" he said while holding two pre-packaged vanilla ice cream cones made by a company in his native Ukraine.",
    "On Sunday, busloads of people will travel from Philadelphia to Washington, D.C. to show their support for the legislation and for Ukraine.",
    "At the same time, Victor Makshyshyn, who is from Ukraine, was sending money to his grandmother who lives in the western part of Ukraine.",
    "On Wednesday afternoon, one woman came in to ship a large box, stating it was filled with clothes and shoes for her family in Russia.",
    "The business serves as a travel agency as well as a place where people can ship goods to countries including Ukraine and Russia.",
    "The U.S. warns Russia could invade Ukraine any day, but President Joe Biden says a diplomatic solution is still on the table.",
    "The concern is only made better by the support Ukrainian Americans have gotten from members of the local Russian community.",
    "It's the type of hope that keeps people coming into the Office of Universal Travel, which is not far from Bell's Market.",
    "\"Ukrainian people are willing and capable to defend their land,\" she said\nThey just hope it doesn't come to that.",
    "\"When I wake up, I'm afraid to open the news,\" said Iryna Mazur, Honorary Consul of Ukraine to Philadelphia.",
    "Under threats from Russian forces for the last eight years, she says people in Ukraine are ready to fight.",
    "\"Too many times, Russia and Putin have threatened and threatened, trying to flex their muscle,\" he said.",
    "\"I actually fully support all diplomatic negotiations,\" said Mazur.",
    "It's a concern David Davudov shares even though he is from Russia.",
    "Grosh was born there and came to the U.S. when he was 7 years old.",
    "It's something Grosh hopes will happen instead of an invasion.",
    "Northeast Philadelphia is home to a large population of both.",
    "\"She's sort of nervous, but she's OK,\" Makshyshyn said.",
    "He's going after more and more,\" said Grosh.",
    "\"I'm just getting sick and tired of it.\"",
    "His concern is for Ukrainian troops.",
    "\"It's something, a political game.",
    "Big game,\" he said.",
    "\"I don't like it.\""
  ]
}