{
  "id": 17430,
  "mediaId": 8409,
  "date": "2022-02-27",
  "headline": "Editorial: Congressional redistricting amounts to mixed bag",
  "image": "https://www.pottsmerc.com/wp-content/uploads/2022/02/41e1a025d845b5b74d9b2b91caf12141.jpg?w=1024&h=683",
  "link": "https://www.pottsmerc.com/2022/02/27/editorial-congressional-redistricting-amounts-to-mixed-bag/",
  "mediaOutlet": "phoenixvillenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reading Eagle",
  "authorUrl": "https://www.pottsmerc.com/author/reading-eagle/",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s yet another reminder that we need a better system of determining who represents us.For years advocates for fair redistricting have been trying to get lawmakers to adopt a system that puts the decision in the hands of an independent citizens’ commission.",
    "Republicans are objecting to the map, but it’s hard to take that seriously considering that the last time they had full control of the redistricting process, they created maps that gave them a 13-5 advantage in congressional seats.",
    "The northern Pennsylvania district represented by Snyder County Republican Rep. Fred Keller has been eliminated, and he is planning to battle fellow Rep. Dan Meuser for the Republican nomination in the 9th District.",
    "In the meantime, we’re eager to see this year’s redistricting process put behind us so voters and candidates finally can focus on the primary election, which will be here in less than three short months.",
    "The new map provides eight Republican-leaning districts, six Democratic-leaning districts and three closely divided districts, according to an analysis by the FiveThirtyEight website.",
    "After all the debate surrounding the latest process for redrawing Pennsylvania’s congressional district, the apparent end result is a map quite similar to what’s in place now.",
    "The good news is that it offers a strong possibility of a congressional delegation that reflects the close political division in our state along with some competitive races.",
    "We need a better way of doing this, and we urge lawmakers to finally address this problem before another 10 years pass and we wind up in the same position again.",
    "While Houlahan continues to represent Reading and some other parts of Berks, Dean’s district is to contain more territory in the county than it does now.",
    "The Pennsylvania Supreme Court backed a plan submitted by Democrats that promised to keep change to a minimum, even though the state is losing a seat.",
    "As usual, we are disappointed to see Berks County divided into three districts, with Reading and some of its suburbs represented by different people.",
    "The people may not have a say in determining the district in which they vote, but they still have the last word on who gets to represent them.",
    "A portion of the 9th District is to remain in Berks, though it’s a considerably smaller part of the county than what’s on the current map.",
    "The public, not the politicians or the courts, should be the ones who decide how congressional seats are distributed in Pennsylvania.",
    "The 1st Disrict, now represented by Republican Rep. Brian Fitzpatrick, still covers Bucks County and a portion of Montgomery County.",
    "Assuming this ruling holds up in the face of legal challenges, most voters in the Philadelphia suburbs won’t see major changes.",
    "The court ruled that those maps were unconstitutional and developed new ones that resulted in a far more appropriate 9-9 split.",
    "We do regret that once again the court had to intervene in a process that should have been completed without their involvement.",
    "Be sure to study up, make sure you know in which district you reside and learn about the candidates who will be on your ballot.",
    "And the 6th District, now represented by Democratic Rep. Chrissy Houlahan, remains heavily concentrated in Chester County.",
    "The 4th District, now represented by Democratic Rep. Madeleine Deane takes up most of Montgomery County.",
    "And the new 9th District is a monstrosity, extending from Berks all the way to the New York state line.",
    "The justices stepped in because Democrats and Republicans could not reach an agreement on a map.",
    "The 5th District, now represented by Democratic Rep. Mary Gay Scanlon, covers Delaware County.",
    "There will be 17 in the Pennsylvania congressional delegation instead of 18 starting in 2023.",
    "And Berks is impacted by the biggest change of all on the congressional map.",
    "It’s hard to imagine getting good representation in such a scenario.",
    "We have mixed feelings about the map as a whole.",
    "Berks County is seeing more significant changes.",
    "This dilutes the region’s influence."
  ]
}