{
  "id": 2,
  "mediaId": 2572,
  "date": "2022-02-22",
  "headline": "Pompeo endorses former State Department spokesperson Ortagus in Tennessee House race",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/06/Morgan-Orgagus-press-conference-Washington-DC.jpg",
  "link": "https://www.foxnews.com/politics/ortagus-pompeo-house-endorsement-tennessee",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    2765,
    3942,
    4327,
    4835,
    5507,
    514,
    1126,
    1433,
    6650,
    6678
  ],
  "sentences": [
    "He'll make yet another trip to Iowa on Wednesday for a panel focusing on the importance of U.S. engagement and strength abroad and how that impacts Americans back at home.",
    "Glenn Youngkin and Attorney General Jason Miyares to Arkansas Senate candidate Sarah Huckabee Sanders and House Problem Solvers Caucus Co-Chair Brian Fitzpatrick, R-Pa.",
    "FIRST ON FOX: Former Secretary of State Mike Pompeo is endorsing his department's former spokesperson, Morgan Ortagus, in her run for Congress in Tennessee Tuesday.",
    "\"She has served her country honorably in the executive branch and in our military, and I know she'll continue to champion the American values we share in Congress.\"",
    "\"Morgan played a critical role in our administration's efforts to put America first and to restore American greatness to our foreign policy,\" Pompeo added.",
    "PENNSYLVANIA SENATE GOP CLASH: BARTOS TAKES AIM AT OZ, MCCORMICK FOR SKIPPING DEBATE\nRep. Jim Cooper, D-Tenn., represents Tennessee's fifth district.",
    "Democrat Odessa Kelly appears to be the likely Democrat nominee for the seat, while Ortagus faces several other GOP candidates in the GOP primary.",
    "The former secretary is considered one of several potential 2024 Republican presidential candidates if former President Trump does not run.",
    "Pompeo is very involved in national elections this cycle, backing a variety of GOP incumbents and challengers in state and federal races.",
    "\"In Tennessee's Fifth Congressional District, I can't think of a stronger candidate than Morgan Ortagus,\" Pompeo said in a statement.",
    "\"I'm humbled to be endorsed by Secretary Pompeo, a man I was honored to work for on behalf of the American people,\" Ortagus said.",
    "\"Together, we stood firmly against authoritarian regimes like China, Russia, Iran and Cuba both at home and around the world.",
    "The backing from Pompeo gives Ortagus her second major Trump administration endorsement after the former president himself.",
    "But he's retiring after the Tennessee legislature's redistricting turned his district to a GOP-majority district.",
    "After leaving the State Department, Ortagus appeared regularly on Fox News' \"Outnumbered\" last year.",
    "In Congress, I'll continue to fight for freedom and to preserve the American Dream.\"",
    "She was also backed by the Republican PAC Winning for Women last week.",
    "Fox News' Paul Steinhauser contributed to this report.",
    "Those range from new Virginia Gov."
  ]
}