{
  "id": 6455,
  "mediaId": 8441,
  "date": "2022-04-10",
  "headline": "Yardley Scout advances to the rank of Eagle during Court of Honor in Newtown",
  "image": "https://www.thereporteronline.com/wp-content/uploads/2022/04/Eagle10.jpg?w=1024&h=746",
  "link": "https://www.thereporteronline.com/2022/04/10/yardley-scout-advances-to-the-rank-of-eagle-during-court-of-honor/",
  "mediaOutlet": "Springfield Sun - United States - Pennsylvania",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Werner",
  "authorUrl": "https://www.thereporteronline.com/author/jeff-werner/",
  "termIds": [
    0
  ],
  "sentences": [
    "Please, provide an email address to continue reading free articles\nMost Popular\nAbington police announce arrest of serial robber\nMorning Briefing: 12-year old child dead in murder-suicide; Another community hospital may be closing; Bad signs for 76ers after loss\nMorning Briefing: Innovations helped businesses survive pandemic; Fired police chief suing town; Another pitiful offensive night for Phillies\nWe invite you to use our commenting platform to engage in insightful conversations about issues in our community.",
    "We reserve the right at all times to remove any information or materials that are unlawful, threatening, abusive, libelous, defamatory, obscene, vulgar, pornographic, profane, indecent or otherwise objectionable to us, and to disclose any information necessary to satisfy the law, regulation, or government request.",
    "Bucks County\nNEWTOWN >> Colin Wisniewski, a junior at Saint Joseph’s Preparatory High School in Philadelphia, advanced to the rank of Eagle Scout during a Court of Honor held at Olde Saint Andrew Church on April 3.",
    "Family, friends, Scouts and leaders from Troop 29, along with Congressman Brian Fitzpatrick, State Senator Steve Santarsiero and State Rep. Perry Warren joined Colin in celebrating his major accomplishment.",
    "We might permanently block any user who abuses these conditions.",
    "“Becoming an Eagle Scout means so much more ...",
    "More in Yardley Area"
  ]
}