{
  "id": 7238,
  "mediaId": 2526,
  "date": "2022-04-08",
  "headline": "House Republicans, Democrats Beg Biden to Open U.S. Borders to Ukrainians",
  "image": "https://media.breitbart.com/media/2022/04/GettyImages-1389824998-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/08/house-republicans-democrats-beg-biden-to-open-u-s-borders-to-ukrainians/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    3942,
    5060,
    4905,
    1119,
    387,
    6678,
    6657,
    6672
  ],
  "sentences": [
    "“As the conflict continues, we urge you to modify the physical presence eligibility date for TPS from March 1st to the publication date of the forthcoming Federal Register notice, thereby making any Ukrainian in the United States on that date eligible for Temporary Protected Status,” the lawmakers write:\nThis technical update could provide significant relief for Ukrainians who recently entered, as they cannot—and should not—return to a war zone right now.",
    "Last month, Biden’s Department of Homeland Security (DHS) announced that the administration would extend the quasi-amnesty program known as Temporary Protected Status (TPS) to about 75,000 Ukrainians already living in the United States.",
    "Now, Reps. Andy Harris (R-MD) and Brian Fitzpatrick (R-PA) are joining a swath of House Democrats to ask Biden to extend TPS to potentially tens of thousands more Ukrainians who are arriving at the border.",
    "[Emphasis added]\nThe effort comes as Biden’s administration prepares for a “mass migration event” at the border as a result of the president’s plans to end the Title 42 border control on May 23.",
    "As a result, Ukrainians have started piling up at the U.S.-Mexico border in the hopes of being released into the U.S. interior while their asylum claims are adjudicated.",
    "It will also allow these Ukrainians to work and attend school, contribute economically to the United States and support themselves, while they await the end of this war.",
    "TPS allows eligible foreign nationals to avoid deportation for an extended period of time despite possibly having previously skirted federal immigration laws.",
    "Title 42, for more than two years, has allowed federal immigration officials to quickly return nearly two million illegal aliens to their native countries.",
    "Specifically, Biden officials say a foreign population the size of Atlanta, Georgia — roughly half a million — could arrive at the border every month.",
    "A handful of House Republicans have joined House Democrats in pleading with President Joe Biden to further open the nation’s borders to Ukrainians.",
    "All hope to be released into the U.S. interior.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here."
  ]
}