{
  "id": 7247,
  "mediaId": 2621,
  "date": "2022-04-03",
  "headline": "Tiger King’s Carole Baskin Gave More Than $30,000 to Congressional Candidates in 2021",
  "image": "https://www.mediaite.com/wp-content/uploads/2021/11/Screen-Shot-2021-11-19-at-10.33.16-AM-scaled-e1637336036406.jpg",
  "link": "https://www.mediaite.com/politics/tiger-kings-carole-baskin-gave-more-than-30000-to-congressional-candidates-in-2021/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Huggins",
  "authorUrl": "https://www.mediaite.com/author/katherine-huggins/",
  "termIds": [
    4864,
    2196,
    3942,
    2349,
    2244,
    2403,
    1489,
    154,
    392,
    476
  ],
  "sentences": [
    "Moore’s campaign website describes him as “the most conservative lawmaker in Alabama,” while Harshbarger’s says she is “an unapologetic conservative Trump Republican.”\nHere is a complete breakdown of the other members of Congress who received $1,000 in contributions from Baskin in 2021, according to the FEC:\nSen. John Cornyn (R-TX)\nSen. Mike Crapo (R-ID)\nSen. Tommy Tuberville (R-AL)\nRep. Tim Burchett (R-TN)\nRep. Ken Calvert (R-CA)\nRep. Jerry Carl (R-AL)\nRep.",
    "Buddy Carter (R-GA)\nRep. Jim Clyburn (D-SC)\nRep. Tom Cole (R-OK)\nRep. Rodney Davis (R-IL)\nRep. Dave Joyce (R-OH)\nRep. Claudia Tenney (R-NY)\nBaskin’s giving in 2021 is markedly higher than in past years, though she has consistently given to PACs supporting animal protection laws, namely the Humane Society Legislative Fund.",
    "The FEC’s records show other contributions from Baskin that include $2,500 to Rep. Nancy Mace (R-SC), $2,000 to Sen. John Boozman (R-AR), and $1,500 each to Sen. Steve Daines (R-MT), Rep. Barry Moore (R-AL), and Rep. Diana Harshbarger (R-TN).",
    "(The FEC limits individuals to donating a maximum $2,900 per candidate per election, and thus Baskin reached the limit when accounting for both the primary and general election).",
    "He had hoped for a pardon from former President Donald Trump and has asked President Joe Biden to pardon him in order to get “proper medical care” for his prostate cancer.",
    "Tiger King’s Carole Baskin was a relatively prolific political donor last year, contributing more than $30,000 to multiple congressional candidates, FEC records show.",
    "Baskin, an animal rights activist and CEO of the non-profit Big Cat Rescue, is best known for her appearance on Netflix’s documentary series Tiger King.",
    "According to data from the FEC, Baskin gave about $31,000 to congressional candidates last year, with the majority of that money going to Republicans.",
    "Exotic is currently serving a 21-year sentence on charges related to animal endangerment and the attempted murder for hire of Baskin.",
    "The biggest congressional recipient of her generosity in 2021 was Rep. Brian Fitzpatrick (R-PA), who received a total of $5,800.",
    "In 2019, Baskin contributed to three senators: Pat Toomey (R-PA), John Barrrasso (R-WY), and Susan Collins (R-MN).",
    "Baskin gave a total of $2,900 to Rep. Kathy Castor (D-FL), whose Tampa-area district includes Baskin’s residence.",
    "Post-Tiger King frenzy, it appears as though Baskin has become somewhat of a prolific political donor.",
    "In 2020, Baskin contributed to only two members of Congress — giving $1,000 each to Sens.",
    "The series began by focusing on her feud with Joe Exotic, a private zoo owner.",
    "Based on the FEC numbers, only about $6,000 of that figure went to Democrats.",
    "In 2018, she did not contribute to any candidates.",
    "Richard Burr (R-NC) and Cory Booker (D-NJ)."
  ]
}