{
  "id": 732,
  "mediaId": 8376,
  "date": "2022-02-24",
  "headline": "Pa. Supreme Court picks new Congressional map",
  "image": "https://s24527.pcdn.co/wp-content/uploads/2022/02/128242126_web1_MATT-CARTWRIGHT-NEW-MUGCMYK.jpg.webp",
  "link": "https://www.mydallaspost.com/news/44634/pa-supreme-court-picks-new-congressional-map-2",
  "mediaOutlet": "mydallaspost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Levy and Mark Scolforo Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Also: Court suspends primary calendar for state legislative candidates amid map challenges\nHARRISBURG — Pennsylvania’s highest court broke a partisan deadlock Wednesday over a new map of congressional districts by selecting boundaries that broadly adhere to the outlines of current districts, even as the state loses one seat because of sluggish population growth.",
    "Former U.S. Attorney General Eric Holder, who leads the National Democratic Redistricting Committee and whose affiliate organization, the National Redistricting Action Fund, backed the court-selected map, called it a “substantial win for Pennsylvanians who now get to vote for the candidate of their choosing in fair, lawful districts for the next decade.”\nGov.",
    "Although I am not happy with many aspects of the map, I do look forward to running for re-election in Pa 9.”\nBig shift unlikely\nThe Democratic-majority state Supreme Court in a 4-3 decision picked a 17-district map that had been proposed by a group of Democratic Party-aligned voters who sued last year in an effort to get the court involved.",
    "Pennsylvania’s national Republican committee member, Andrew Reilly, said it was unfortunate that the court majority chose a map that combines two safe Republican districts into one, makes a suburban Pittsburgh seat friendlier for Democrats and was represented in part by the firm of a “partisan” Democratic Party-aligned lawyer.",
    "It is unlikely to create a big shift in the makeup of the congressional delegation, as the state loses a seat, going from 18 to 17, to account for relatively stagnant population growth in census findings over the past decade, particularly in rural white areas predominantly represented by Republicans.",
    "More importantly, they are all places that have been part of my life the last 34 years, places and I will campaign happily in and represent proudly if successful.”\nMeuser said, “It looks like over 70% of my current district, Pa-9, has remained intact, which I am grateful.",
    "It had some wins for Republicans and some wins for Democrats on a map whose stated aim was to stick as closely as possible to districts drawn by the high court in 2018 to replace a six-year-old map it found to be unconstitutionally gerrymandered by Republicans.",
    "The map’s swing districts are held by Allentown-area Democrat Susan Wild and Republican Brian Fitzpatrick of suburban Philadelphia’s Bucks County, while one in suburban Pittsburgh is empty since Democrat Conor Lamb is running instead for U.S. Senate.",
    "The new map provides eight Republican-leaning districts, six Democratic-leaning districts and three closely divided districts, according to an analysis by FiveThirtyEight, a website that focuses on opinion poll analysis, politics and sports.",
    "“Despite that partisan choice, Pennsylvania Republicans will be ready to favorably compete in these districts to assist the National Republican Campaign Committee in taking back the U.S. House in November,” Reilly said in a statement.",
    "The map appears to show Luzerne County and Northeastern Pennsylvania continuing to be divided between the 8th and 9th districts, currently represented by Matt Cartwright, D-Moosic, and Dan Meuser, R-Dallas, respectively.",
    "Some Republicans had hoped Meuser would move over to challenge Scranton-area Democrat Matt Cartwright in the Republican-leaning 8th District, whose boundary is a few blocks from Meuser’s Luzerne County home.",
    "It draws each Democratic incumbent into their own district and it keeps the metropolitan Harrisburg area in one district with York, instead of splitting it into several districts, as Republicans had sought.",
    "It keeps the city of Pittsburgh in one district, helping maintain a competitive district for Republicans in its suburbs, and it keeps all of Bucks County in one district, helping protect Fitzpatrick.",
    "The court also adjusted the petition gathering schedule — starting this Friday going until March 15 — but left the May 17 primary date intact for congressional races and statewide contests.",
    "The court has selected boundaries twice before in the past three decades, and it’s decision is expected to be the final word, although a federal court challenge by Republicans is pending.",
    "However, the court on Wednesday suspended the primary election calendar for state legislative candidates, because new state House and Senate district maps are being challenged in court",
    "Pennsylvania’s delegation is currently split evenly, nine Republicans and nine Democrats, in a state where registered Democrats outnumber Republicans by 4 million to 3.4 million.",
    "Four of five Democrats on the court formed the majority in Wednesday’s decision, while one Democrat, Justice Debra Todd, sided with the court’s two Republicans in opposing it.",
    "“I think the Pennsylvania Supreme Court chose a fair map with sensible districts, not some kind of outrageous gerrymander for one side or the other,” Cartwright said.",
    "In picking the new map, the justices also rejected a lower court judge’s recommendation of a map backed by Republican lawmakers that Democrats had opposed.",
    "But two Republican incumbents — Fred Keller and Meuser — were poised Wednesday to run in the same northeastern district against each other.",
    "But Meuser said in an interview that it makes more sense for him to run in the 9th District, which contains 72% of his existing district.",
    "However, instead of challenging Thompson, Keller said Wednesday that he will run in the new 9th District next door, where Meuser lives.",
    "Still, the map will put more pressure on Wild to get reelected, drawing her new district to include conservative Carbon County.",
    "That is because the new map lumps two Republican incumbents — Glenn Thompson and Keller — into a sprawling northern district.",
    "“It is a fair map that will result in a congressional delegation mirroring the citizenry of Pennsylvania,” Wolf wrote.",
    "The court ended up with the decision after Wolf and the Republican-controlled Legislature deadlocked on a new plan.",
    "Two Pittsburgh-area districts where incumbents are not running again will provide opportunities for newcomers.",
    "In fact, I have already represented almost all of these areas in previous Congresses.",
    "“For my own part, I am very pleased with the new 8th Congressional District.",
    "Both local incumbents issued statements on the new district lines.",
    "Democrats pleased, GOP not so much\nDemocrats applauded the map.",
    "Tom Wolf, a Democrat, said he was pleased with the decision.",
    "The map also sides with Democrats on certain aspects.",
    "The map sides with Republicans on two big issues.",
    "The new areas are places that I know well.",
    "Republican response was critical."
  ]
}