{
  "id": 837,
  "mediaId": 8469,
  "date": "2022-02-23",
  "headline": "Pa. Supreme Court picks new Congressional map",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2022/02/128239602_web1_128239602-f513a189e77c482f89efce3e8d8dc3ec.jpg.optimal.jpg",
  "link": "https://s24526.pcdn.co/news/1541231/pa-supreme-court-picks-new-congressional-map",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Levy and Mark Scolforo Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Also: Court suspends primary calendar for state legislative candidates amid map challenges\nHARRISBURG — Pennsylvania’s highest court broke a partisan deadlock Wednesday over a new map of congressional districts by selecting boundaries that broadly adhere to the outlines of current districts, even as the state loses one seat because of sluggish population growth.",
    "It is unlikely to create a big shift in the makeup of the congressional delegation, as the state loses a seat, going from 18 to 17, to account for relatively stagnant population growth in census findings over the past decade, particularly in rural white areas predominantly represented by Republicans.",
    "However, the map also aides Democrats by ensuring each Democratic incumbent has their own district and keeping the metropolitan Harrisburg area in one district with York, instead of splitting it into several districts, as Republicans had sought.",
    "The map provides eight Republican-leaning districts, six Democratic-leaning districts and three closely divided districts, according to an analysis by FiveThirtyEight, a website that focuses on opinion poll analysis, politics and other topics.",
    "It lumps two Republican incumbents — U.S. Reps. Glenn Thompson and Fred Keller — into a sprawling northern district, and draws two Pittsburgh-area districts where there will be no sitting incumbents running for another term.",
    "It keeps the city of Pittsburgh in one district, helping maintain a competitive district for Republicans in its suburbs, and it keeps all of Bucks County in one district, helping protect Republican Rep. Brian Fitzpatrick.",
    "The map appears to show Luzerne County and Northeastern Pennsylvania continuing to be divided between the 8th and 9th districts, currently represented by Matt Cartwright, D-Moosic, and Dan Meuser, R-Dallas, respectively.",
    "The Democratic-majority state Supreme Court in a 4-3 decision picked a 17-district map that had been proposed by a group of Democratic-aligned voters who sued last year in an effort to get the court involved.",
    "However, the court on Wednesday also issued an order that suspended the primary election calendar for state legislative candidates, because new state House and Senate maps are being challenged in court.",
    "The court also adjusted the petition gathering schedule — starting this Friday going until March 15 — but left the May 17 primary date intact for congressional races and statewide contests.",
    "Pennsylvania’s delegation is currently split evenly, nine Republicans and nine Democrats, in a state where registered Democrats outnumber Republicans by 4 million to 3.4 million.",
    "Four of five Democrats on the court formed the majority in Wednesday’s decision, while one Democrat, Justice Debra Todd, sided with the court’s two Republicans in opposing it.",
    "Still, the map will put more pressure on Rep. Susan Wild to get re-elected, drawing the Allentown Democrat’s new district to include conservative Carbon County.",
    "In picking the new map, the justices also rejected a lower court judge’s recommendation of a map backed by Republican lawmakers that Democrats had opposed.",
    "Tom Wolf, a Democrat, and the Republican-controlled Legislature deadlocked on a new plan.",
    "The map sides with Republicans on two big issues.",
    "The court ended up with the decision after Gov."
  ]
}