{
  "id": 8745,
  "mediaId": 8412,
  "date": "2022-04-07",
  "headline": "Lawmakers introduce no-fly list legislation to protect airline crews from abusive passengers",
  "image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/02/0/0/iStock-690187168.jpg?ve=1&tl=1",
  "link": "https://www.foxbusiness.com/lifestyle/lawmakers-introduce-no-fly-list-legislation-protect-airline-crews-abusive-passengers",
  "mediaOutlet": "Pocono News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Musto",
  "authorUrl": "https://www.foxbusiness.com/person/m/julia-musto",
  "termIds": [
    3942,
    3953,
    4292,
    2550,
    667,
    112,
    45,
    1228,
    1380
  ],
  "sentences": [
    "GET FOX BUSINESS ON THE GO BY CLICKING HERE\nThe bill is supported by American Airlines, Delta Air Lines, Southwest Airlines, the Air Line Pilots Association, the Association of Flight Attendants-CWA, the Association of Professional Flight Attendants, the Transportation Trades Department-AFL-CIO and the Transport Workers Union of America-AFL-CIO.",
    "JETBLUE OFFERS TO BUY SPIRIT AIRLINES FOR ABOUT $3.6 BILLION CASH\nIn a Tuesday release, Rep. Eric Swalwell, D-Calif., Sen. Jack Reed, D-R.I., and Rep. Brian Fitzpatrick, R-Penn., said that the Protection from Abusive Passengers Act could stiffen penalties against offenders.",
    "Under the legislation, violent offenders convicted of assaulting flight crew aboard an aircraft could be placed on the TSA-managed list, with advanced notice, guidelines for removal and the ability to appeal.",
    "\"Unfortunately, too many of our pilots, flight attendants and crew members are dealing with unacceptable abuse from passengers – everything from kicking to spitting to biting,\" Swalwell said in a statement.",
    "The TWU strongly believes this Banned Passenger List will ease some of the pain our members are experiencing and make our skies safer,\" TWU International President John Samuelsen said in a statement.",
    "The rate of unruly passengers is down to 3.8 incidents per 10,000 flights in 2020, but Swalwell said it still indicates air crews have been experiencing \"historic levels of abuse.\"",
    "The bill is aimed at protecting travelers and frontline air crew members from \"the appalling pattern of physical abuse that seems to have become more frequent during flights.\"",
    "\"Right now, a passenger can be fined or convicted, and may be banned on an individual airline – but that does not prevent this violent offender from flying another airline.",
    "The station noted that a February effort to put any person convicted of a disruption on a flight on a national no-fly list did not pass, with GOP senators in opposition.",
    "The Transport Workers Union of America said it was \"encouraged\" by the introduction of the act, and had been calling for such a list since the fall of 2021.",
    "The TSA would flag ineligible passengers and the lawmakers said the enhanced penalty would serve as a \"strong deterrent\" against the passengers.",
    "It’s really just a handful of bad actors who need to be grounded and face consequences for their violent actions,\" she said in a statement.",
    "I’m proud to join Senator Reed in introducing this bill to help protect everyone aboard aircraft and to help ensure flights are safe.\"",
    "Swalwell's office told KTVU on Tuesday that passengers are currently subject to $36,516 of civil penalties for misconduct on a flight.",
    "Recently, the number of airline employees who have reported incidents of harassment, abuse, and assault in the workplace has climbed.",
    "A bipartisan group of lawmakers introduced legislation that would put violent passengers on a lifetime commercial no-fly list.",
    "\"I’d like to thank Rep. Swalwell, Sen. Reed and Rep. Fitzpatrick for introducing this very important piece of legislation.\"",
    "The bill would also ban abusive passengers from participating in the TSA PreCheck or Customs’ Global Entry programs.",
    "According to the Federal Aviation Administration (FAA) there were 5,981 unruly passenger incidents reported in 2021.",
    "Sara Nelson, president of the Association of Flight Attendants-CWA, commended the lawmakers for taking action.",
    "\"Violence and disruptions put everyone at risk and disrupts the safety of flight,\" Nelson said.",
    "\"This behavior is not only inappropriate, but it also puts other crew and passengers at risk.",
    "Hold violent passengers accountable, protect aviation workers and improve aviation safety.\"",
    "We urge members of Congress to co-sign this bill and pass this legislation without delay.",
    "\"Our members have had to deal with this violent, full moon atmosphere for far too long.",
    "The list would be managed by the Transportation Security Administration (TSA).",
    "We've been punched, kicked, spit on, and sexually assaulted.",
    "This bill would change that.",
    "\"That is never acceptable."
  ]
}