{
  "id": 8810,
  "mediaId": 8418,
  "date": "2022-04-08",
  "headline": "Local officials break ground on 309 Connector second phase",
  "image": "https://www.thereporteronline.com/wp-content/uploads/2022/04/309connector1.jpg?w=1024&h=768",
  "link": "https://www.thereporteronline.com/2022/04/08/local-officials-break-ground-on-309-connector-second-phase/",
  "mediaOutlet": "Publicspirit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Sokil",
  "authorUrl": "https://www.thereporteronline.com/author/dan-sokil/",
  "termIds": [
    0
  ],
  "sentences": [
    "Projects ongoing during 2022 in PennDOT’s southeast region include: two U.S. 1 corridor widening and improvement projects in Bucks County ($207.9 million); County Line Road reconstruction in Bucks County, Montgomery County ($11.2 million); U.S. 30 intelligent transportation system enhancements in Chester County ($8.1 million); Interstate 95 pavement preservation in Delaware County ($72.6 million); four U.S. 202 widening and improvement projects in Montgomery County ($178.8 million); the U.S. 1 Wayne Junction Viaduct rehabilitation project in Philadelphia ($91.8 million); and three mainline I-95 reconstruction projects in Philadelphia ($490.4 million).",
    "PennDOT projects slated to begin this year include the Headquarters Road bridge replacement in Bucks County ($2.1 million); U.S. 1 corridor improvements in Chester County ($7.3 million estimate); I-476 pavement preservation in Delaware County ($15 million estimate); U.S. 422 reconstruction in Montgomery County ($73 million estimate); Route 309 Five Points intersection improvements in Montgomery County ($8.7 million estimate); I-95 Bridge Street reconstruction in Philadelphia ($262 million estimate); and I-95 CAP reconstruction in Philadelphia ($226 million estimate), according to PennDOT.",
    "The southern phase of the connector featuring capacity upgrades along Wambold Road in Towamencin was completed in 2012, the second phase between Allentown Road north to Township Line Road near Souderton Pike in Hatfield began preconstruction work in January, and a third phase is planned to add more new roadway north from Souderton Pike to a new interchange with 309 in Hatfield and Hilltown townships.",
    "During the press conference and groundbreaking at the construction site, PennDOT officials highlighted more than 200 projects anticipated to start and continue this year in the five-county Philadelphia region and discussed the benefits coming to regional roads and bridges due to the federal Bipartisan Infrastructure Law, according to PennDOT.",
    "“Great to see more investment in infrastructure in Hatfield Township,” said the township, thanking U.S. Rep. Brian Fitzpatrick (R-1st), state Sen. Maria Collett (D-12th), state Rep. Steve Malagari (D-53rd) and Montgomery County Commissioners Chairwoman Val Arkoosh for attending the groundbreaking and for their support of the project.",
    "“As the 2022 construction season kicks off with more than $2.8 billion of infrastructure projects in District 6, we know that we are making a positive impact through modernizing our transportation system,” said Transportation Acting Executive Deputy Secretary Melissa Batula.",
    "Known as “Section HT2,” the project runs 2.3 miles and includes building a new roadway alignment from Allentown Road to Cowpath Road and reconstructing Township Line Road from Cowpath Road to Hatfield/Souderton Pike in Hatfield and Franconia, according to PennDOT.",
    "HATFIELD TWP — State and local officials marked a milestone on Friday morning, officially breaking ground on the next phase of the long-awaited Route 309 Connector while discussing hundreds of transportation projects coming across Pennsylvania.",
    "At the groundbreaking ceremony on Friday morning, PennDOT and Hatfield and Towamencin officials along with local elected officials ceremonially turned shovels of soil to mark the start of construction on that second phase.",
    "“It is vital that we continue to invest in projects like the 309 Connector project to improve, strengthen, and secure our vast transportation network in this region,” said Acting District 6 Executive Louis Belmonte.",
    "The Route 309 Connector is a planned highway connection running through Hatfield, between Route 309 in Hilltown Township and Route 476, the Northeast Extension of the Pennsylvania Turnpike, in Towamencin.",
    "“The Bipartisan Infrastructure Law will be a dramatic impact for our state highways and investing in our infrastructure is critical to safely moving people and supporting our economy,” Batula said.",
    "“With adequate funding and investments, we hope to accelerate future projects like the third phase of the 309 Connector project, Section HT3, that is currently in design,” he said.",
    "The purpose of the connection is to get trucks off of the local roads and out of the neighborhoods,” Hatfield Township said in a statement Friday afternoon.",
    "For more information about infrastructure in District 6, including completed work and significant projects, visit www.penndot.pa.gov/D6Results.",
    "“After being planned and debated for decades, the second phase of the Sumneytown Pike/PA 309 Connector Road has officially begun."
  ]
}