{
  "id": 9087,
  "mediaId": 8322,
  "date": "2022-03-21",
  "headline": "US showed China its hand after Russia invasion, needs more than sanctions to deter Taiwan aspirations: experts",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/AP19205126652939.jpg",
  "link": "https://www.foxnews.com/world/china-taiwan-economic-sanctions-full-spectrum-approach",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Aitken",
  "authorUrl": "https://www.foxnews.com/person/a/peter-aitken",
  "termIds": [
    5979,
    6260,
    6509,
    6569,
    6672,
    6644,
    6645
  ],
  "sentences": [
    "A White House spokesperson told Fox News Digital that the U.S. will continue \"efforts to shape the environment around China by building resilience and competitiveness at home, diversifying markets, limiting the impact of Beijing’s harmful practices, working with allies and partners, and using the full range of tools we have to defend American economic interests.\"",
    "\"The other issues is … it’s very clear that increased air defense capabilities and anti-armor – the things that have proven to be so effective for the Ukrainian forces – I think we need to take a little more risk in upping the air defense and anti-armor and anti-drone capabilities in a potential Taiwan scenario,\" he added.",
    "BIDEN UNDER GROWING BIPARTISAN PRESSURE TO SANCTION CHINESE BANKS TO DETER AGGRESSION ON TAIWAN\nJames Anderson, former undersecretary of defense for policy under former President Trump, also underscored the need to bolster Taiwan’s capabilities in the same way that NATO allies did with Ukraine ahead of Russia’s invasion.",
    "\"We did a great job of exposing the intelligence, the planning that Putin was doing, which obviously in a Taiwan scenario is going to be very critical about what we know and how we share what we know,\" McInnis explained, but he continued to press the need to make clear how far the U.S. and allies will go to deter China.",
    "CHINA'S NUCLEAR THREATS ARE FOLLOWING ON THE HEELS OF RUSSIA'S THREATS SHOULD BE A US WAKE-UP CALL\nChina may also think twice about an invasion after nations around the world united in opposition and condemnation of Russia’s actions, leading to crippling economic sanctions at every level of Russian society.",
    "Matthew McInnis from the Institute for the Study of War stressed that any sanctions will not prove effective unless they're accompanied by a \"full-spectrum campaign\" that includes the threat of use of force, effective political and diplomatic maneuvers, information sharing and increased weapons supplies.",
    "CLICK HERE TO GET THE FOX NEWS APP\nWhite House Press Secretary Jen Psaki said that national security adviser Jake Sullivan spoke with his Beijing counterpart to make clear the international attention to China’s actions, with sanctions against China on the table should it directly assist Russia.",
    "Some critics say that the U.S. showed China – through its response to Russia – what to expect should China increase its aggression against Taiwan, but experts argue that the U.S. also got to see what worked and has an opportunity to refine its approach.",
    "\"The good news here is that Japan is acutely aware of what it means to them if Taiwan falls to the PRC, because then Japan will be very much economically at the mercy of Beijing and its potential ability to cut of Japan’s maritime lifelines.\"",
    "Andrei Kozyrev, Russia’s foreign minister from 1990-1996, believes that while Russia engages in \"military adventures\" to \"prove its status,\" China tries to prove itself equal to America by \"achievements in economy.\"",
    "The U.S. must learn from its failed attempts to deter Russia’s invasion of Ukraine and refine its approach if it hopes to avoid similar Chinese aggression against Taiwan, experts told Fox News Digital.",
    "\"We’ve been working with them for a long time, via the Taiwan Relations Act … we ought to be thinking of ways to very robustly re-interpret the Relations Act and provide assistance to Taipei.\"",
    "\"The key in the Indo-Pacific region is this series of bilateral relationships, and in the context of the Taiwan scenario, our most important bilateral treaty is going to be Tokyo,\" he said.",
    "Without NATO’s involvement, such assistance may prove difficult: Individual NATO allies can provide assistance but will not likely match the level of investment that went into Ukraine.",
    "\"If we’re talking about Taiwan, there are a lot of capabilities that can and should be strengthened with respect to their ability to defend themselves,\" Anderson said.",
    "\"Economic sanctions simply do not work on their own,\" McInnis said, citing his experience managing maximum pressure campaigns for the State Department.",
    "\"That makes them more like … a competitor, and the response is American competitiveness, while the response to Russia is of military nature.\"",
    "\"They don’t look for military confrontation with America,\" he added, noting that military campaigns waste enormous amounts of resources.",
    "\"They want Taiwan, but it’s a little different from Russia, who has nothing but aggressive policies.\"",
    "\"China wants economic success, and that’s different,\" Kozyrev said.",
    "Instead, Indo-Pacific region allies will need to fill that gap."
  ]
}