{
  "id": 9050,
  "mediaId": 2551,
  "date": "2022-03-26",
  "headline": "It’s official - Wests WERE ripped off: NRL confirms referee made horror stuff-up by not checking whether his no-try call was correct… and it could have cost the Tigers the match",
  "image": "https://i.dailymail.co.uk/1s/2022/03/26/06/55825719-0-image-a-68_1648277384845.jpg",
  "link": "https://www.dailymail.co.uk/sport/nrl/article-10654417/Its-official-Wests-ripped-NRL-confirms-referee-horror-stuff-cost-Wests.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Alston For Daily Mail Australia",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Josh+Alston+For+Daily+Mail+Australia",
  "termIds": [
    3923,
    1993,
    1999,
    3152,
    5456,
    1578,
    876,
    906,
    407
  ],
  "sentences": [
    "+3\nView gallery\nThe NRL has admitted that referee Przeklasa-Adamski should have sent the Leilua try attempt to the Bunker - and by not doing so, he could've costs Wests a win\n'By no means am I trying to justify it, but he’s only in his third game as a single referee, but the only way people get experience is to bring them into play – much like a player.",
    "Roach added: 'The fans are blowing up too and rightfully so,'\n+3\nView gallery\nTigers coach Mcguire believed Leilua had scored the try and questioned why the video referee was not called on to adjudicate\nUnder-fire Wests coach Mcguire said he believed it was a try in the post-match media conference.",
    "There was plenty of evidence to suggest that Leilua may have grounded the ball and scored a potentially match-winning try for the Tigers\nCommentators Warren Smith and Steve 'Blocker' Roach were stunned as the incident played out in front of them.",
    "MATCH CENTRE: https://t.co/glI2HlyC6F pic.twitter.com/vv8MkCBTwG\n— Fox League (@FOXNRL) March 25, 2022\n'He (Przeklasa-Adamski) thought he saw it clearly and made a judgment call,' Annesley said.",
    "The NRL has admitted referee Ziggy Przeklasa-Adamski made a mistake by not reviewing a potential Luciano Leilua try, but it will come as cold comfort for Tigers supporters.",
    "'He’s going to learn a pretty hard lesson out of this, a self-inflicted lesson because he’s doing it quite tough this morning, knowing full-well he’s made the wrong call.",
    "Leilua thought he had scored in the 20th minute but Przeklasa-Adamski ruled no try on the spot without sending it to the NRL Bunker, instead ordering a Warriors restart.",
    "This incident won't make them any happier, with the ref's blunder potentially the difference after the Tigers lost 16-12 to the Warriors.",
    "He should’ve referred the decision, he didn’t refer it and we’ll never know what decision the bunker would’ve made.",
    "'I know that is no consolation to anyone that is a Tigers official, fan or player, but he realises his error.",
    "The Tigers - and their coach Michael Mcguire - are under enormous pressure after a 0-3 start to the season.",
    "Warren Smith then quickly interjected as the slow motion replay showed that it might have been a fair try.",
    "'When you’ve got that much technology in our game that you can’t go back and see it.",
    "'He thought he was in a good position, had a clear view of it and made the call.",
    "The game changes as we know and yeah, we had an opportunity at the back end.",
    "'And that’s why we have technology to be able to work through those things.'",
    "'They’re big moments for teams that are going through a period like we are.",
    "'He didn’t think it was as close as what it ultimately turned out to be.",
    "'He gets there first to the ball, he's knocked it on anyway, has he?",
    "NRL head of football Graham Annesley said it was 'the wrong call'.",
    "502\nor stream on Kayo: https://t.co/pURKzgY0ZC\n??",
    "'No one goes out there trying to make errors.'",
    "'They've got have a look at it, haven't they?'",
    "That certainly had to be looked at,' he said.",
    "Did Luciano Leilua get this one down or not?",
    "But it changes the mentality within a game.",
    "I really don’t understand,' Maguire said.",
    "It looked very close watching it live.",
    "'Yeah, I just don’t understand that.",
    "+3\nView gallery\nDid he or didn't he?",
    "Watch #NRLTigersWarriors LIVE on ch.",
    "BLOG: https://t.co/clFs2xLLlr\n??",
    "It’s ridiculous really.",
    "On the way down.'",
    "'He was wrong.",
    "I don't know.",
    "Roach asked.",
    "'Did he?",
    "??"
  ]
}