[
  {
    "id": 4124,
    "mediaId": 2605,
    "date": "2022-01-23",
    "sentence": "On the very next play, Rams quarterback Matthew Stafford, in shotgun formation, is surveying Tampa Bay’s coverage when center <span class='selected-term'>Brian Allen</span> unexpectedly snaps the ball.",
    "author": "",
    "title": "‘This is officially lunacy’: The eight crazy plays that capped the Rams’ win"
  },
  {
    "id": 3701,
    "mediaId": 2746,
    "date": "2022-01-23",
    "sentence": "Kupp, who had nine catches for 183 yards, lost a fumble, and the offense failed to take advantage of Miller sacking Brady to a force a fumble at the Tampa Bay 25 when center <span class='selected-term'>Brian Allen</span> snap sailed past Stafford in shotgun formation and recovered by the Bucs.",
    "author": "Fred Goodall",
    "title": "Last-second FG lifts Rams over Brady, Buccaneers"
  },
  {
    "id": 758,
    "mediaId": 2523,
    "date": "2022-02-22",
    "sentence": "There are several appealing center options in free agency, including Ryan Jensen of the Tampa Bay Buccaneers, Ben Jones of the Tennessee Titans and <span class='selected-term'>Brian Allen</span> of the Los Angeles Rams.",
    "author": "Alex Ballentine",
    "title": "NFL Starters Who Could Have Their Jobs Stolen by Free-Agent Signings in 2022"
  },
  {
    "id": 11120,
    "mediaId": 2523,
    "date": "2022-03-13",
    "sentence": "Both have free agents of their own to worry about, whether it's edge-rusher Von Miller and center <span class='selected-term'>Brian Allen</span> in Los Angeles or linebacker De'Vondre Campbell and cornerback Rasul Douglas in Green Bay.",
    "author": "Gary Davenport",
    "title": "Tom Brady Is Back, but the Buccaneers Are Far from Super Bowl Favorites"
  },
  {
    "id": 11110,
    "mediaId": 2586,
    "date": "2022-03-14",
    "sentence": "With <span class='selected-term'>Brian Allen</span>, Joe Noteboom and Coleman Shelton resigning with the champs, it’s the latter who is projected to slide into Corbett’s vacated spot.",
    "author": "Lorenzo Reyna",
    "title": "Rams Losing $2.6 Million Lineman & Another Trench Standout: Report"
  },
  {
    "id": 6082,
    "mediaId": 2523,
    "date": "2022-04-21",
    "sentence": "“Coming off of an Achilles’, six months, and doing what he can to help our football team win, just having him back was awesome,” Rams center <span class='selected-term'>Brian Allen</span> said Thursday.",
    "author": "Kevin Modesti",
    "title": "Super wasn’t good enough for Rams’ Cam Akers"
  }
]