{
  "id": 3471,
  "mediaId": 136,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Trumpism Is Moving Beyond Trump and That's Good News for Ron DeSantis",
  "image": "https://d.newsweek.com/en/full/2040318/trump-trumpism-desantis-barnette.webp?w=790&f=86b13030071cd11cd6ea9d6ae0960b7c",
  "link": "https://www.newsweek.com/trumpism-moving-beyond-trump-thats-good-news-ron-desantis-1707478",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Fung",
  "authorUrl": "https://www.newsweek.com/authors/katherine-fung",
  "termIds": [
    661,
    879,
    946,
    1147,
    1653,
    1839,
    2303,
    2491,
    3103,
    4545,
    571
  ],
  "sentences": [
    "But no MAGA candidate proved to be as much of a threat to Trump's pick than conservative commentator Kathy Barnette, who gained late momentum in one of the most expensive and most watched primaries of this midterms cycleand who has said that \"MAGA does not belong to President Trump.\"",
    "And while the Republican has been careful to not completely abandon Trump, Barnette's strong showing during the campaign suggests that candidates courting MAGA voters no longer have to secure a Trump endorsement in order to wina shift Florida's governor is likely to embrace.",
    "Asked about his White House ambitions earlier this month, DeSantis told podcaster Lisa Boothe, \"My goal would be, if we win the election really big, people like you who analyze these things are going to say, 'The days of Florida being a swing state are over.",
    "Walker, a self-described \"conservative champion\" who was endorsed by Trump allies Mike Huckabee and Madison Cawthorn (who lost his House seat in North Carolina Tuesday), was competing with Budd for the most conservative, pro-Trump voters in North Carolina.",
    "The rise of multiple MAGA (Make America Great Again) candidates in this year's crowded primary races suggests that a new group of America First Republicans could be on the horizonand they won't need a blessing from the \"MAGA king\" to build their campaigns.",
    "On Tuesday, Barnettewho has been described as \"ultra-MAGA\" by right-wing strategist Steve Bannoncame in third behind front-runners Mehmet Oz and David McCormick in the tight race, whose winner was still not known by early Wednesday afternoon.",
    "Some Republicans have been hopeful that a potential Trump-DeSantis ticket could excite voters in huge numbers, but the governor's growing popularity across the country might be enough to convince him to seek the White House himself.",
    "Although Barnette's performance could be troubling for Trump, it may bode well for another prominent Republican, Florida Governor Ron DeSantis, who is emerging as a leading contender for the GOP's presidential nomination in 2024.",
    "In North Carolina's GOP Senate primary, Trump's backing of Representative Ted Budd wasn't enough to persuade former congressman Mark Walker to drop out of the race, despite Trump's criticism of him.",
    "Vance didn't stop former State Treasurer Josh Mandel, one of the other front-runners in Ohio's GOP Senate primary, from campaigning on promises to \"drain the swamp\" and \"take on the radical left.\"",
    "DeSantis, whose political success Trump has taken credit for, has become critical of the former president in recent months over things like Trump's early handling of the coronavirus pandemic.",
    "Republican hopefuls trying to clinch their party's nomination in Ohio's, North Carolina's and Pennsylvania's Senate races all chased after former President Donald Trump's endorsement.",
    "Before Tuesday's voting, Republican strategist Jay Townsend told Newsweek, \"It is ironic that Trump has endorsed the moderate in the PA Senate race, rather than the 'ultra-MAGA.'\"",
    "And although Vance has said Ohio's elections are \"pretty gold standard,\" some of his opponents wanted an audit of the votes cast in the 2020 presidential race.",
    "In the days leading up to the election, Barnette barreled ahead, despite spending just over 1 percent of what Oz and McCormick shelled out on TV ads.",
    "\"He is smart, sitting back, not challenging Trump directly and allowing Trump to willfully take the slings and arrows of this cycle,\" he said.",
    "But it wasn't the amount of money Barnette spent on her campaign that made her an unlikely challenger to Trump and his list of endorsements.",
    "\"Although he coined the word, MAGA actually belongs to the people,\" she said at a recent debate before Pennsylvania's GOP Senate primary.",
    "But even when his coveted stamp of approval was finally doled out to his favorites, other candidates never abandoned the MAGA playbook.",
    "Townsend suspects the governor is likely welcoming Barnette's showing in Pennsylvania as proof that Trump's power is beginning to wane.",
    "\"All right, we gotta get Walker out of that race,\" Trump told North Carolina GOP Chairman Michael Whatley at a donor dinner in March.",
    "Patton agrees, saying, \"When everyone is bloody and tired of the fighting, DeSantis is positioned to swoop in and 'save the day.'\"",
    "The governor has suggested he is waiting for a \"big\" reelection win this year before he makes any decision on a presidential bid.",
    "He added that Barnette's rise during the campaign could \"be an indication Trump is losing a grip on the cult he created.\"",
    "\"Kathy Barnette will never be able to win the General Election against the Radical Left Democrats,\" Trump said last week.",
    "Townsend predicts that at this rate, Trump and DeSantis are likely on a \"collision course\" heading toward 2024.",
    "Notably, the far-right candidate was publicly opposed by Trump, who had endorsed Oza more moderate candidate.",
    "DeSantis is positioning himself as the next step, the iteration,\" GOP strategist Alex Patton told Newsweek.",
    "\"Dr. Oz is the only one who will be able to easily defeat the Crazed, Lunatic Democrat in Pennsylvania.",
    "Without officially throwing their hat in the ring, both Republicans have teased a presidential bid.",
    "That tactic is why DeSantis hasn't made any endorsements outside his home state, Patton noted.",
    "A vote for anyone else in the Primary is a vote against Victory in the Fall!\"",
    "\"DeSantis is not refuting Trump, Trumpism or the America First policies.",
    "\"The competition playing out right now isn't about ideas or policies.",
    "It was President Trump who shifted and aligned with our values.\"",
    "He added, \"I think that's because of a lot of what we've done.\"",
    "\"Our values never, never shifted to President Trump's values.",
    "It is about political power and who will wield it.\"",
    "\"Get him out of the race, Michael, right?\"",
    "Trump's endorsement of J.D.",
    "Florida is a red state.'\""
  ]
}