{
  "id": 5483,
  "mediaId": 195,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Republicans could nominate stronger Senate candidates with ranked choice voting",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/4fce37806d7a42b0939494ae94407613-1.jpg?w=2560&h=1440&crop=1",
  "link": "https://thehill.com/opinion/campaign/3491701-republicans-could-nominate-stronger-senate-candidates-with-ranked-choice-voting/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rob Richie",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "Instead of the constructive campaign we saw in Virginia, the race has devolved to what undecided Republican voters call mean,? a circus,? and disappointing.?\nMcCormick, Oz, and Barnette have already found themselves in multiple controversies, and could be liabilities against a more experienced candidate in a highly contested general election.",
    "If no candidate wins a majority of voters first choices, the race goes to an instant runoff? that counts the backup choices of voters whose first choice trailed the field  until a candidate gets to 50 percent and wins.",
    "It also encourages more civil campaigns, in line with Reagans 11th Commandment that Republicans shall not speak ill of any fellow Republican.? Our current system is a zero-sum, dog-eat-dog fight for every vote.",
    "This change gives candidates incentives to build enough deep support to be among the top candidates as well as broad support, so they can break the 50 percent threshold against their strongest opponent.",
    "Meanwhile, the years most competitive Senate race is in Pennsylvania  where an untested candidate like Dr. Oz, David McCormick, or Kathy Barnette could win with less than 25 percent of primary votes.",
    "It increases voter buy-in, with more primary voters having a personal stake in the nominee  even if they didnt rank the nominee first, they likely ranked that candidate somewhere on their ballot.",
    "Pat McCrory (who lost his re-election attempt in 2016, running 60,000 votes behind President Trump) are the favorites in a divisive, personal campaign also featuring Congressman Mark Walker.",
    "Holding a separate runoff election has traditionally been the vehicle to help parties nominate stronger candidates, but fewer states use runoffs due to costs, delays and low turnout.",
    "While Democrats began their general election campaign wounded from a hard-fought primary, Republicans were united behind a consensus ticket and swept all three statewide races.",
    "Vance could win a Republican primary in Ohio this month with 32 percent of the vote, after a nasty campaign in which one primary debate nearly broke into a fistfight.",
    "Ranked choice voting is a simpler, faster, cheaper alternative that elects party nominees with strong primary support going into the general election.",
    "All of these controversial figures won crowded primaries with 45 percent of the vote or less  even the majority of Republicans didnt support them!",
    "These crowded candidate fields can bring out more voters  but also might hurt the GOPs chances this fall because of our current voting rules.",
    "Primaries have started, and crowded fields of Republicans are running in states like North Carolina, Pennsylvania, Missouri, and Arizona.",
    "The presidents party has lost Senate seats in seven of the last 10 midterm elections, and Joe Bidens approval ratings are underwater.",
    "But politically damaged former governor Eric Greitens could get the nomination if his five opponents split the anti-Greitens vote.",
    "Democrats have their own split vote outcomes to watch out for, of course, and also would benefit from a better voting system.",
    "With ranked choice voting, you have an incentive to engage your opponents base and seek their second- and third-choice votes.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "These nominees sneak through a crowded field with 30 or 40 percent of votes, and then lose winnable seats in the fall.",
    "One major candidate shared reasons he liked his competitors, and publicly asked their supporters to rank him second.",
    "No wonder Virginia Republicans are using ranked choice voting again this cycle to pick two congressional nominees.",
    "Heres the problem: Republicans have a history of nominating weak candidates in primaries with lots of candidates.",
    "With control of the Senate hanging by a thread, just one misstep could be fatal for the Republicans chances.",
    "All went on to lose winnable races; in 2012, Akin underperformed Mitt Romney by 25 points in Missouri.",
    "Weak nominees  and nomination processes  could spoil the party for Republicans on Election Night.",
    "He is co-author of Every Vote Equal? and Whose Votes Count?? Follow him on Twitter @Rob_Richie.",
    "Remember Senators Corey Stewart of Virginia, Todd Akin of Missouri or Sharron Angle of Nevada?",
    "Embracing ranked choice voting in primaries is truly a win-win for both voters and parties.",
    "We saw all these benefits in Virginias 2021 Republican nomination for governor.",
    "If Vance loses in November, the nature of this primary will be a big reason.",
    "In particular, heavily Republican Missouri shouldnt have a competitive race.",
    "Similar dynamics are in play in August primaries in Arizona and Missouri.",
    "Republicans need just one seat to win back the Senate this fall.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "In North Carolina, Congressman Ted Budd and former Gov.",
    "Upcoming primaries underscore the value of change.",
    "Voters rank candidates in order of preference.",
    "Rob Richie is president and CEO of FairVote.",
    "Thats how J.D.",
    "Neither do we."
  ]
}