{
  "id": 5489,
  "mediaId": 195,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "The Memo: Democrats cross their fingers in Pennsylvania",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/FettermanLambKenyatta_AP.png?w=645&h=363&crop=1",
  "link": "https://thehill.com/news/administration/3490493-the-memo-democrats-cross-their-fingers-in-pennsylvania/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Niall Stanage",
  "authorUrl": "https://thehill.com/author/niall-stanage/",
  "termIds": [
    1092,
    1147,
    1376,
    1653,
    1770,
    2491,
    3103,
    146,
    428,
    571,
    2862
  ],
  "sentences": [
    "But Nevins also warned  citing former President Trump as an example  that there are dangers in underestimating an opponent who you think is the person you want.?\nJoe Trippi, a veteran Democratic strategist, was even more bullish on his partys chances.",
    "But its not an argument of If this one wins, it would be a big problem for us. Its more of an argument over who is more vulnerable than the others.?\nTrippi said he himself is leaning toward Barnette as the weakest candidate for Democrats to face.",
    "President Bidens approval ratings are mediocre at best, inflation has soared to its highest levels in four decades and, historically, the party that holds the White House struggles in the first midterms after a presidential election.",
    "The top tier of the GOP field is comprised of TV personality Mehmet Oz, conservative commentator Kathy Barnette and businessman David McCormick  all of whom Democrats believe have potentially fatal flaws.",
    "The fierce nature of the primary, meanwhile, is gladdening Democratic hearts  even as party strategists know there are no easy general election wins amid such a challenging political landscape.",
    "So by some basic, fundamental measures, it looks to be a very tough case.?\nSalvation for Democrats  or at least avoidance of a worst-case scenario  could come from weak GOP candidates.",
    "A super PAC supporting Oz is airing an ad blasting her, McCormick has noted her heavy defeat in a 2020 House race and Trump  who has endorsed Oz  has also said she is not electable.",
    "Fetterman says he is on the road to recovery and that he did not suffer any cognitive damage.? But the development, so close to the primary, has jangled Democratic nerves.",
    "Barnette has alleged that gay men are not normal,? falsely stated that former President Obama is Muslim and asserted that pedophilia is a cornerstone? of Islam.",
    "A stroke over the weekend is not good, but we dont know how bad it was except for him saying he will be up and about,? said Democratic strategist Jerry Austin.",
    "Oz has a history of appearing to advocate less conservative positions than he now claims to hold, while McCormicks critics charge that he lacks charisma.",
    "Barnettes rise appears to be driven by her appeal to GOP base voters as the most authentic and compelling representative of MAGA-style populism.",
    "The poll had just 6 percentage points separating Oz, Barnette and McCormick, who were on 32 percent, 27 percent and 26 percent, respectively.",
    "Administration\nDemocratic hopes are on a knife-edge in the U.S. Senate race in Pennsylvania, where both parties hold their primaries Tuesday.",
    "The leading Republican candidates have spent an enormous amount of money chewing each other up,? said Democratic strategist Mark Longabaugh.",
    "Vance in Ohio.?\nFetterman has a large polling lead over U.S. Rep. Conor Lamb and state Rep. Malcolm Kenyatta in the Democratic primary.",
    "Austin said the 68? Fetterman, with his shaved head and penchant for shorts and hoodies over suits and ties, is a strong candidate.",
    "On the other hand, the shock has not yet faded in Democratic circles that the clear front-runner in their Senate primary, Lt. Gov.",
    "On one hand, Democrats believe Republican voters could do them an unintentional favor in whomever they choose as their nominee.",
    "I am not sure they put up their A-list for this,? said Mark Nevins, a Philadelphia-based Democratic consultant, with a laugh.",
    "Each of them has some real flaws, so we are having arguments over which one is the weakest,? Trippi said of the GOP field.",
    "Pennsylvania gives the Democrats a rare chance to pick up a Senate seat at a time when the upper chamber is split 50-50.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Barnette has surged in the last couple of weeks before primary day, despite being vastly outspent by Oz and McCormick.",
    "Thats why party strategists are so eagerly waiting for Tuesdays results from the other side of the partisan divide.",
    "It is a tough and competitive state.?\nLongabaugh made no attempt to minimize the problems Democrats face.",
    "Fettermans stroke was the latest dramatic development in one of the most intriguing races in the country.",
    "He may be our Hillbilly Elegy but in a more positive sense in Pennsylvania than [GOP Senate nominee] J.D.",
    "Her primary opponents have seized on the idea that Barnette could be a disaster in a general election.",
    "A new Emerson College poll on Monday underlined that the GOP primary is a three-way jump ball.",
    "Her new prominence has brought scrutiny, uncovering many problematic comments in her past.",
    "Yet Democrats are buoyed when they look at the GOP field in the Keystone State.",
    "Democrats cant deny they face a very challenging environment nationwide.",
    "The seat is currently held by Sen. Pat Toomey (R), who is retiring.",
    "John Fetterman, suffered a stroke on Friday at the age of 52.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Obviously, the generic polling numbers do not look great.",
    "Inflation and the rocky economy is number one,? he said.",
    "But I still think it is going to be a tough environment.",
    "I think anytime you see a party do that, it is helpful.",
    "The presidents job approval does not look great.",
    "The Memo is a reported column by Niall Stanage."
  ]
}