{
  "id": 5510,
  "mediaId": 195,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Democrats hit GOP over replacement theory",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/buffalo_shooting_051622ap_lead.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/house/3490520-dems-hit-gop-over-replacement-theory/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Lillis",
  "authorUrl": "https://thehill.com/author/mike-lillis/",
  "termIds": [
    683,
    1147,
    1248,
    1341,
    3094,
    3103,
    3917,
    146,
    428,
    2825,
    2945
  ],
  "sentences": [
    "The list includes the 2017 marches in Charlottesville, Va., where white supremacists yelled that Jews will not replace us;? the 2018 shooting at a synagogue in Pittsburgh, where Jews were targeted for supporting immigrants; and the 2019 massacre at a Walmart in Texas, where the shooter said he feared a Hispanic invasion.?\nThe suspect in Saturdays shooting in Buffalo, Payton Gendron, had aired similar grievances, writing online that the Black shoppers he targeted were a threat to my own people?  a threat he equated to genocide.",
    "Despite sickening and false reporting, Congresswoman Stefanik has never advocated for any racist position or made a racist statement.?\nStefaniks team also pointed to New York City approving a measure to allow noncitizens to vote in municipal elections, falsely saying that it would allow illegal immigrants? to vote when the measure would apply to legal permanent residents and so-called Dreamers who were brought to the U.S. as children but legally allowed to remain under the DACA program.",
    "Kinzinger resurfaced those posts in the wake of the shooting on Saturday, asserting that Stefanik pushes white replacement theory.?\nThose figures vigorously deny that their rhetoric is inherently racist or promotes the same kinds of worldviews as the Buffalo shooter, saying there exists a clear distinction between opposing legal rights for undocumented immigrants and elevating hatred toward minorities.",
    "Tucker Carlson, the popular Fox News host, has led that charge, saying on his show last year that demographic change is the key to the Democratic Partys political ambitions.? He then accused Democrats of trying to replace the current electorate? with more obedient voters from the third world.?\nI have less political power because they are importing a brand new electorate,? he said.",
    "The same year, the liberal Center for American Progress said that supporting real immigration reform that contains a pathway to citizenship for our nations 11 million undocumented immigrants is the only way to maintain electoral strength in the future.?\nThose arguments, from Stefanik and others, have done nothing to satisfy their critics, some of whom are calling them out by name.",
    "But it gained a recent mainstream foothold under former President Trump, whose Make America Great Again? campaign launched with a blanket attack on Mexican immigrants, won legions of followers across the country and remains the single most animating force in the GOP even more than a year after Trumps departure from public office.",
    "Senate Majority Leader Charles Schumer (D-N.Y.) lamented that such views have become more mainstream in recent years, blaming some MAGA Republicans and cable news pundits? for lending the theory a purported legitimacy.?\nThe message is not always explicit, but weve all seen the pattern,? he said Monday on the chamber floor.",
    "House Minority Leader Kevin McCarthy (R-Calif.) brushed off criticism from Cheney and others about replacement theory, telling reporters Monday that the GOP has have never supported white supremacy.?\nSame thing Cheney always does, just trying to play a political game when she knows somethings not true,? McCarthy said.",
    "In the wake of Saturdays massacre in Buffalo, MAGA-loyal Republicans and their allies are now under sharp scrutiny for past comments suggesting, to various degrees, that Democrats and other elites have sought to empower minorities  largely through immigration policy  at the expense of white people.",
    "For many Americans, what seems to be happening or what they believe right now is happening is  what appears to them is  were replacing national-born Americans, native-born Americans to permanently transform the landscape of this very nation,? Perry said in a committee hearing last year.",
    "Stefanik was accused in a hometown paper editorial of subtly parroting tenets of replacement theory with Facebook ads in September 2021 that said Democrats were plotting a PERMANENT ELECTION INSURRECTION? with the plan to give amnesty to undocumented immigrations for electoral purposes.",
    "Carlson said on his show that critics were trying to make a racial issue out of it,? but that it is a voting right question.?\nStefanik adviser Alex deGrasse said in a statement that she is credited with diversifying the GOP and supports legal immigration, but opposes amnesty.",
    "Vance said that Democrats have decided that they cant win reelection in 2022 unless they bring in a large number of new voters to replace the voters that are already here.?\nAnd Rep. Scott Perry (R-Pa.), a close Trump ally, has issued similar warnings about immigrants.",
    "The suspect, an 18-year-old from Conklin, N.Y., a small rural town 200 miles east, had reportedly posted a long, online screed voicing fears that Americas white population is being overrun by growing numbers of minorities.",
    "Democrats are taking Republicans to task this week following a racist mass shooting in western New York, accusing GOP lawmakers of fomenting violence by embracing the same white nationalist views as the alleged gunman.",
    "Any implication or attempt to blame the heinous shooting in Buffalo on the Congresswoman is a new disgusting low for the Left, their Never Trump allies, and the sycophant stenographers in the media,? deGrasse said.",
    "GOP Rep Elise Stefanik ran ads promoting it,? tweeted Rep. Ted Lieu (D-Calif.)\nRep @EliseStefanik has now issued a statement and nowhere does she say I condemn replacement theory. Why??\nMychael Schnell contributed.",
    "@GOP leaders must renounce and reject these views and those who hold them.?\nThe debate over replacement theory has been thrust into the national spotlight following a string of violent episodes in recent years.",
    "Lawmakers in both parties have been horrified by the massacre in Buffalo, where a lone gunman shot 13 people  10 of them fatally  at a supermarket in a predominantly Black neighborhood on Saturday afternoon.",
    "That conspiracy, known as replacement theory,? has a long history at the fringes of American politics, reverberating for decades within the underground worlds of white nationalism and white supremacy.",
    "Some of those conservative commentators have embraced replacement theory by name; others have avoided the term, but warn of an immigrant insurrection? designed to keep Democrats perpetually in power.",
    "What truly needs to be replaced in this country is ignorance and hate, which is driving division, perpetuating lies, and killing our neighbors,? Rep. Brian Higgins (D-N.Y.), said in a statement.",
    "In Trumps absence from Washington, other prominent conservatives have stepped up their fight against what they perceive as a threat to Americas national identity.",
    "And among the loudest voices denouncing the GOPs flirtation with fringe nationalism are a pair of Capitol Hill Republicans  Reps. Liz Cheney (Wyo.)",
    "A 2013 article on a failed Gang of Eight immigration proposal said that its amnesty provisions would create an electoral bonanza? for Democrats.",
    "In either case, the critics say such rhetoric contributes directly to acts of nationalist violence, including Saturdays massacre in Buffalo.",
    "GOP defenders also cite older research and news articles asserting that immigration is likely to lead to electoral gains for Democrats.",
    "Among the lawmakers under the brightest spotlight since Saturdays shooting is Rep. Elise Stefanik (N.Y.), a member of GOP leadership.",
    "and Adam Kinzinger (Ill.)  who accused their own leadership of doing far too little to combat the bigotry in their own ranks.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Great Replacement Theory is a vile, racist and false conspiracy theory that the Buffalo murderer relied upon.",
    "Why should I sit back and take that??\nAppearing on Carlsons show in March, GOP Ohio Senate nominee J.D.",
    "History has taught us that what begins with words ends in far worse,? Cheney wrote on Twitter.",
    "The House GOP leadership has enabled white nationalism, white supremacy, and anti-semitism.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Higgins is hardly alone.",
    "Updated 7:50 p.m."
  ]
}