{
  "id": 5594,
  "mediaId": 323,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "West Virginia Republican Primary: Infrastructure Votes, Trump Endorsement Take Center Stage",
  "image": "https://images.wsj.net/im-540823/?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/west-virginia-republican-primary-infrastructure-votes-trump-endorsement-take-center-stage-11652188236",
  "sentiment": "0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joshua Jamerson",
  "authorUrl": "https://www.wsj.com/news/author/joshua-jamerson",
  "termIds": [
    1147,
    1332,
    2087,
    3103,
    4438,
    146,
    428,
    562,
    571,
    3173,
    2969
  ],
  "sentences": [
    "Really, what its coming down to is ethics questions versus [some voters] feel like David McKinley, when he voted, gave Biden a win,? she said, adding later: That is a problem down there.?\nAsked if he would appear at an event such as a ribbon cutting for a new infrastructure project that he voted against funding, Mr. Mooney said: It would depend on the project, I guess.?",
    "The two are facing each other because West Virginias congressional delegation will shrink from three seatsall currently held by the GOPto two after the midterm elections because of the once-a-decade reapportionment of House districts, and Rep. Carol Miller (R., W.Va.) is expected to retain her seat.",
    "In the Nebraska governor race, the Trump-endorsed candidate, businessman and GOP donor Charles Herbster, is in a close contest with University of Nebraska Board of Regents member Jim Pillen and state lawmaker Brett Lindstrom, according to public opinion polls from April.",
    "Public polls have been scant but show Mr. Mooney leading a race that has focused heavily on the bipartisan infrastructure bill, which passed in the House largely with Democratic votes but was supported by several Republicans in the House and Senate.",
    "Thats what I would say.?\nSarah Chamberlain, the head of Republican Main Street Partnership, a group that backs GOP centrists including Mr. McKinley, said the Trump endorsement happened so long ago that it shouldnt shake up the race.",
    "The Office of Congressional Ethics, a nonpartisan agency that investigates allegations of wrongdoing by members of Congress, found that Mr. Mooney improperly used campaign cash for personal expenses, including family vacations.",
    "If this had failed, as it should have, we couldve gone back to the drawing board.?\nSen. Joe Manchin (D., W.Va.), in a rare move across party lines, cut a television ad for Mr. McKinley saying the law will help West Virginia.",
    "Mr. Mooney, in turn, noted that Mr. McKinley was himself publicly reprimanded in a letter by the ethics committee in 2016 for failing, upon his election to Congress, to remove his name from a private company he had owned.",
    "Asked if he denied all wrongdoing, he said: Im going to stick with that statement, that theyre just full of misrepresentations and unsupported allegations, and Im going to work with the committee to answer the questions.",
    "The reports are full of misrepresentations and unsupported allegations,\" Mr. Mooney said, declining to comment on the details while saying he was cooperating with the committee to answer their questions.",
    "Mr. McKinley, who declined an interview request, has said millions from the infrastructure bill are slated to shore up the states watersheds, abandoned wells, roads and bridges, after years of neglect.",
    "Mr. McKinley and his allies have focused on Mr. Mooneys out-of-state rootshe was originally a politician and chair of the state GOP in Maryland, whereas Mr. McKinley is a lifelong West Virginian.",
    "Part of his argument is the infrastructure bill deviated from a pure roads-and-bridges bill, handing Democrats a political win they might not have been able to earn without some GOP support.",
    "The strength of former President Donald Trumps backing in Republican primaries will get a fresh test Tuesday, including in a heated matchup between two incumbent lawmakers in West Virginia.",
    "I think its unfair to attack people who vote against these big trillion dollar spending bills, even though theres things in there we supportI support roads and bridges,? Mr. Mooney said.",
    "In addition to West Virginia, several other May primaries will further test the Trump endorsement, including in Nebraska on Tuesday and in Pennsylvania and Georgia in subsequent weeks.",
    "An aide to McKinley said Mr. Mooneys criticisms have made traction with voters, causing Mr. McKinley to explain his vote and tout the money being steered toward West Virginia.",
    "Its only bipartisan because 13 sellout Republicans voted for it,? Mr. Mooney said in an interview, referring to Mr. McKinley and other House Republicans who joined the effort.",
    "In the interview, Mr. Mooney noted that Mr. Trump had twice endorsed himonce on Nov. 15, the day Mr. Biden signed the infrastructure bill into law; and again in late April.",
    "That matter has been referred to the House Ethics Committee, a panel of five Republicans and five Democrats, which will decide whether to discipline Mr. Mooney.",
    "The primary in West Virginia follows a hotly contested Senate primary in Ohio last week, when the Trump-backed candidate, author and venture capitalist J.D.",
    "Ive waited 12 years now to be able to vote on infrastructure to take care of our sewer, our water lines, our roads and bridges, our broadbandon and on.",
    "His opponent is a RINO who supported the Unfrastucture Bill and the Sham January 6 Unselect Committee,? Mr. Trump said in a statement last month.",
    "The West Virginia race offers a glimpse at GOP sentiment toward the infrastructure law and the broader idea of compromising with Democrats.",
    "Rep. Alex Mooney earned an endorsement from Mr. Trump after Rep. David McKinley voted for last years $1 trillion infrastructure package.",
    "House Speaker Nancy Pelosi then set up a select committee, which didnt require a vote to create and Mr. McKinley isnt a member of it.",
    "Evan Berryhill, an aide to Mr. McKinley, said a settled matter from six years ago isnt comparable to Mr. Mooneys looming matter.",
    "Mr. McKinley voted in 2021 for a commission on the Jan. 6 riots at the Capitol but that effort failed in the Senate.",
    "The Democrats, at the time, had been splintered by the best way to proceed with President Bidens legislative agenda.",
    "The winner of the McKinley-Mooney contest is heavily favored to prevail in November and keep the seat in GOP hands.",
    "Mr. Herbster faces allegations of groping women, including by a GOP state senator; he has denied the allegations.",
    "We know that its an issue that people have some misconceptions about, so we try to clear that up,? the aide said.",
    "Mr. Trump held a rally for Mr. Herbster earlier this month, calling him badly maligned? by the allegations.",
    "Congressman Alex Mooney is a conservative warrior running in West Virginias 2nd Congressional District.",
    "The winner of Tuesdays race is likely to win the heavily Republican states general election this fall.",
    "We had to do something,? Mr. McKinley said during a radio debate with Mr. Mooney last week.",
    "They have also highlighted his alleged ethics violations while in Congress.",
    "An aide didnt respond to a request for comment.",
    "Hes a good man,? the former president said.",
    "I defend people when I know theyre good.",
    "Vance, won in a crowded field."
  ]
}