{
  "id": 5602,
  "mediaId": 881,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Racist Replacement Theory Is Bleeding Into GOP Senate Campaigns",
  "image": "https://video-images.vice.com/articles/627a75ffbcca36009c69eab9/lede/1652193162082-gettyimages-1240433455.jpeg?crop=1xw:0.8425xh;0xw,0xh&resize=1800:*",
  "link": "https://www.vice.com/en_us/article/n7nxmk/gop-great-replacement-theory",
  "sentiment": "0",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1550,
    1801,
    2524,
    3103,
    3803,
    3926,
    428,
    571
  ],
  "sentences": [
    "A few days later, Pennsylvania GOP Rep. Scott Perry claimed in a committee hearing that many Americans were concerned that were replacing national-born Americans, native-born Americans to permanently transform the landscape of this very nation.?\nCarlson went even further in September, claiming Biden wanted to reduce the political power of people whose ancestors lived here and dramatically increase the proportion of Americans newly arrived from the Third World,? before explicitly using the term great replacement.?\nA handful of Republicans defended Carlsons comments then, including Florida GOP Rep. Matt Gaetz:\nThis theory, which largely focuses on Latino immigrants, ignores the reality that immigrants are far from monolithic in their political views, as well as the fact that non-citizens cannot vote in the U.S. Republicans, including Trump, have also pushed a related but different conspiracy theory for years that non-citizen immigrants vote in huge numbers.",
    "An Associated Press-NORC poll released on Monday showed that fully one-third of Americans, and almost half of Republicans, believe that there is a group of people in this country who are trying to replace native-born Americans with immigrants who agree with their political view.?\nTheres what you could call a partisan variation of the Great Replacement theory, a partisan argument that sounds similar but isnt quite the same, that Democrats are letting in migrants to become Democratic voters and control the country that way,? said Mark Pitcavage, of the American Defamation League.",
    "The murderers who killed 11 worshippers at Pittsburghs Tree of Life Synagogue in 2018 and 23 mostly Mexican-American shoppers in El Paso, Texas in 2019 promoted versions of the theory, as did the man who shot up two mosques in Christchurch, New Zealand in 2019.\nA lot of people are articulating this conspiracy theory, which is not only unfair to Democrats but more importantly dangerous for immigrants,? said Pitcavage.",
    "And he may soon have more colleagues in the Senate who believe that Democrats plan is to import enough eventual voters to take over control of the electorate for good: At least a half-dozen Republican Senate candidates have voiced similar sentiments on the campaign trail in recent weeks, a sign of how mainstream and deeply ingrained in modern Republican orthodoxy this conspiracy theory has become.",
    "Masters has been pushing rhetoric like this for months, claiming in an October video that Democrats want to change the demographics of this country? in order to consolidate power so they can never lose another election.?\nVances closest rival in his primary, former Ohio Treasurer Josh Mandel, was more explicit in embracing the great replacement? theory.",
    "Iowa GOP Rep. Steve Kings 2017 tweet that We cant restore our civilization with somebody elses babies,? and this rhetoric isnt that different from that used by nativist conservatives from Pat Buchanan in the 1990s to Colorado Rep. Tom Tancredo in the 2000s to some of former President Donald Trumps rhetoric on the campaign trail and in the White House.",
    "Given this atmosphere, this miasma of hate and intolerance, it doesnt take much to push someone over the cliff, where theyll act on this.?\nBy signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "At one September rally, Mandel claimed that the plot was to have immigrants move in and out-breed native Americans and use their constitution and use their laws against them.?\nWhat Biden is doing at the border, which I think is funded by Soros and coordinated by the Obama cabal, they're intentionally violating the rule of law.",
    "Miami-Dade County in south Florida, which has a massive population of Cuban-Americans, gave Joe Biden just a seven-point win in 2020 after breaking for Hillary Clinton by a 30-point margin in 2016.\nUsing identity politics like this is dangerous and extreme,? said GOP strategist Leslie Sanchez, the author of Los Republicanos.",
    "I think it's an electoral plan.?\nIf you connect the dots as a candidate for office and say, Look, obviously the Democrats, they hope to just change the demographics of our country, they hope to import an entirely new electorate, man, they call you a racist and a bigot,? Masters said on another podcast a few days later.",
    "Eric Greitens, one of Schmitts primary opponents, recently claimed that Joe Biden's policies are an assault on the entire idea of America? and that the president is wiping out the distinction between citizens and non-citizens, and he's doing it on purpose.?\nThis isnt new to American politicians, either.",
    "I know that the left and all the little gatekeepers on Twitter become literally hysterical if you use the term replacement if you suggest that the Democratic Party is trying to replace the current electoratethe voters now casting ballotswith new people, more obedient voters from the Third World.",
    "Vance, who won his primary last Tuesday, argued on multiple occasions over the past month that the reason President Biden wanted to end Title 42, which automatically sends immigrants who cross the border back to Mexico, was because he and Democrats see them as guaranteed future votes.",
    "At a late-April town hall, Vance claimed that lifting Title 42 would mean 250,000 immigrants entering the U.S. every month, allowing Democrats to import 10 million to 15 million future voters, 70 percent of whom he claimed, without offering evidence, would vote Democratic.",
    "That so many statewide candidates who may soon have the national stage are pushing this conspiracy theory shows the political potency they see in this messageand will further entrench it in the pantheon of conspiracies believed by a significant portion of conservatives.",
    "When Wisconsin Republican Sen. Ron Johnson was recently asked on Fox News about immigration reform, he floated a conspiracy theory thats quickly becoming gospel on the right: that Democrats want a flood of immigrants to remake America and keep them in power.",
    "Mandel, who is Jewish, claimed on multiple occasions without offering any evidence that efforts to expand immigration were being funded by George Soros, a frequent bogeyman for anti-Semites who claim Jews are behind Great Replacement efforts.",
    "Missouri Attorney General Eric Schmitt, whos running for the Senate, claimed on Glenn Becks show in late April that Democrats are fundamentally trying to change this country through their illegal immigration policy.?\nFormer Missouri Gov.",
    "So youre talking about a shift in the democratic makeup of this country that would mean we never win, meaning Republicans would never win a national election in this country ever again,? Vance said in Portsmouth, Ohio.",
    "Most Republican candidates arent going that deep into the fever swampsbut are pushing a similar claim, swapping in Democrats for elites and focusing on political domination instead of cultural replacement.",
    "The theory posits that non-white immigrants are trying to replace white, native-born citizens in the U.S. and Europe by flooding into those countries and having more children than the native population.",
    "They think that if they can bring in millions and millions and millions of illegal aliens, someday they'll be able to grant them amnesty to grant them citizenship and make them reliable Democrat voters.",
    "Joe Bidens open border is killing Ohioans, with more illegal drugs and more Democrat voters pouring into this country.?\nVances primary win last week makes him the favorite to replace retiring GOP Sen.",
    "At the Unite the Right? rally in Charlottesville in 2017, tiki torch-wielding white supremacists chanted You will not replace us? and Jews will not replace us,? just one day before they rioted.",
    "Its also ironic that this GOP rhetoric is resurgent from GOP candidates now, given that Republicans made massive gains in some Latino and Asian-American communities during the last election.",
    "Sanchez added that candidates who incorrectly assume immigrants are all zombies that are going to vote collectively? threaten the inroads that Republicans are making with Latinos.",
    "Its similar to, though not exactly the same as, the great replacement? theory, a white supremacist conspiracy theory thats been popularized by the alt-right over the past decade.",
    "Is it [that] really they want to remake the demographics of America to ensure that they stay in power forever??\nHes far from the only Republican who espouses these beliefs.",
    "Extremism experts warn great replacement rhetoric has inspired violence against immigrants and Jewsand the more it is mainstreamed, the more dangerous it becomes.",
    "And you have to ask yourself, why?? Johnson asked during an April 15 appearance with Larry Kudlow, suggesting an idea that has its roots in white nationalism.",
    "Tejano-heavy South Texas, a Democratic bastion for generations, swung hard to the right in 2020some counties swung as much as 50 points towards the GOP.",
    "Multiple Republican Senate candidates have pushed claims that sound awfully like the white supremacist great replacement? theory.",
    "And then there's the broad great replacement argument itself, which basically is that nonwhites are coming in to replace whites.",
    "Vance got a big early boost in his race from billionaire PayPal founder Peter Thiel, who gave $10 million to his super PAC.",
    "They're trampling the rule of law and they're intentionally flouting the border,? he said on Breitbart News last October.",
    "Many adherents of this false, racist theory claim its being orchestrated by a secret cabal of wealthy elitesoften Jews.",
    "But its become an increasingly common talking point over the past yearwith Fox News Tucker Carlson playing a key role.",
    "Thiels other major campaign investment was to his former employee Blake Masters, whos running for Senate in Arizona.",
    "Thats the one thats most connected to white supremacy and the most problematic.?\nOhio GOP Senate nominee J.D.",
    "The Democrats want to change the demographics of this country,? Masters said on a podcast in late April.",
    "This is all about power.?\nOther GOP Senate candidates have voiced similar views in recent weeks.",
    "Do you hate Mexicans?? Vance asked with a smirk in one ad that his team released last month.",
    "They are trying to change our culture, change our demographics and change our electorate.",
    "This is about changing the face of America, figuratively and literally.",
    "But they become hysterical because thats whats happening actually.",
    "The media calls us racist for wanting to build Trumps wall.",
    "Masters has floated similar rhetoric for months.",
    "This administration wants complete open borders.",
    "They censor us, but it doesnt change the truth.",
    "Hes even put it in his campaign advertising.",
    "Thats true,? Carlson declared last April.",
    "Rob Portman in Republican-leaning Ohio.",
    "Are you a racist?",
    "Lets just say it."
  ]
}