{
  "id": 5628,
  "mediaId": 238,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Can Democrats win back working-class voters? Watch Ohio.",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/07/ohio-senate-race-sundaytake/",
  "sentiment": "0.544",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    781,
    1147,
    1801,
    2524,
    3103,
    146,
    428,
    571,
    3158,
    2845
  ],
  "sentences": [
    "From the viewpoint of his campaign team, the core appeal will be to voters who they believe have lost trust and faith, who feel not just economically stressed but, more important, left behind and disrespected by the ruling political powers in Washington and the cultural and economic elite  what one Vance adviser called government, media, big business, universities and nonprofits.",
    "Democratic pollster Stan Greenberg said Ryan has the potential both to win support from working-class White voters who have drifted away from the Democratic Party and potentially gain support from establishment Republicans who have become disenchanted with a party dominated by Trump.",
    "Its just, You really dont care about us.?\nVances advisers do not think the candidates conversion from Trump foe to Trump acolyte will be an issue of concern in the general election, although they anticipate that the news media and Democrats will try to keep it in focus.",
    "Still, there will be few races that will more fully explore the issue of why Democrats have lost ground with voters who once were an essential part of their coalition, and whether theres any way to halt and reverse those trends.",
    "The Democratic nominee is Rep. Tim Ryan, a 10-term House member who represents a district in northeast Ohio that has suffered through the decline of manufacturing in the United States and the shipment of jobs overseas.",
    "The shift has come in the areas outside the major cities, in the northeastern part of the state, in Appalachian counties in eastern and southeastern Ohio, and in the rural areas in the western portions of the state.",
    "And he will try to portray Vance as the elitist in the race, someone who had left Ohio to make his money and whose candidacy was aided by millions of dollars from the billionaire venture capitalist Peter Thiel.",
    "Thats the challenge for Ryan, to find some way to appeal to and connect with voters whove lost faith in the Democratic Party and who feel the party no longer reflects either their values or their interests.",
    "Unlike neighboring Michigan and Pennsylvania, which share some of its demographics but have been friendlier to Democrats overall, Ohio has appeared out of reach for Democratic candidates running statewide.",
    "He has consistently opposed free-trade agreements that have hurt his district and the whole state and has come out of the gate denouncing those in his party who have called for defunding the police.",
    "The middle class and working middle class feel like everyone has turned their back on them,? said the Vance adviser, who spoke on the condition of anonymity to talk about campaign strategy.",
    "Some Democratic strategists say Ryan will have to make the issue of money and corporate power a central part of his message against Vance to appeal to disaffected working-class voters.",
    "But if both Vance and Ryan will make the claim that they best represent the working-class voters, they are likely to do it from different perspectives and with different emphases.",
    "The possible overturning of Roe v. Wade will inject the issue into virtually every campaign this fall, and both the Vance and Ryan teams will have to navigate the new landscape.",
    "Ryan once challenged House Speaker Nancy Pelosi (D-Calif.) for the post of House Democratic leader and unsuccessfully sought the Democratic presidential nomination in 2020.",
    "But, like others, Greenberg sees Ohios overall landscape as challenging for a Democrat and the national trends in this election year as formidable for Ryans candidacy.",
    "The author of a best-selling book, Hillbilly Elegy,? Vance had pilloried Trump back in 2016 but learned to see Trump in a new light as a candidate for the Senate.",
    "And I take on whoever needs to be taken on  China, corporate interests, anybody whos coming after my people.?\nThe two will be competing to succeed Republican Sen.",
    "Vance, a Yale-educated, Silicon Valley venture capitalist who surged at the end of the campaign after securing the endorsement of former president Donald Trump.",
    "Theres no question that those folks have drifted away,? said a Ryan adviser who also spoke on the condition of anonymity to talk candidly about the campaign.",
    "In his victory speech Tuesday night, Vance said: The people who are caught between the corrupt political class of the left and the right, they need a voice.",
    "But he will need to raise buckets of money, find consistency in his campaign message and hope that voters find him more personally appealing than Vance.",
    "Rob Portman, who is retiring after two terms in Senate and a long career in Washington that has included service in the House and the executive branch.",
    "Ohio Republicans have just come off one of the most expensive Senate primaries in history, with a fractured field and a fractious, months-long debate.",
    "Given those two factors, Vance begins the general election campaign as a narrow favorite, although both sides expect a tough and competitive race.",
    "Ryan appears better positioned than some others in his party to bid for the support of voters whom the Democratic Party has lost over the years.",
    "As the race sets up today, it will feature two candidates who both will try to claim the mantle of populist ally of the working-class voter.",
    "Democratic presidential nominees generally saw their vote percentages in Ohio fall only a couple of points below their national percentage.",
    "Even as urban and suburban areas were shifting toward the Democrats, the other parts of the state were more than compensating.",
    "The former president twice carried Ohio by margins of eight percentage points, which by the states standards is a landslide.",
    "Few issues have vexed Democrats more than the long-running defection of White, working-class voters to the Republican Party.",
    "Beyond the issue of crime and funding the police, he will highlight problems on the border and the issue of immigration.",
    "Ryan also hopes to skirt the issue that has been a major reason Democrats have lost support among working-class voters.",
    "He will try to separate himself from those aspects of the Democratic Party that have alienated working-class voters.",
    "But that doesnt mean cultural issues wont be part of the campaign and potentially to the detriment of the Democrat.",
    "The lone exception is Sen. Sherrod Brown (D), whose progressive populism has helped him to counter the trends.",
    "He is a centrist who has become more progressive, once was opposed to abortion rights and now supports them.",
    "And thats going to be me.?\nThe next morning, Ryan told CBS News: Im from just outside of Youngstown.",
    "Which brings the story back to the Senate race and the populist rhetoric that will be featured.",
    "Ohios upcoming Senate race will test whether Democrats have a formula to win some of them back.",
    "Ohio once was a swing state in presidential campaigns, although with a slight Republican tilt.",
    "Their view is that the media and Democrats are out of touch with those disaffected voters.",
    "Ryan once called himself pro-life but gradually shifted to support abortion rights.",
    "He is a graduate of Bowling Green University and Franklin Pierce School of Law.",
    "Trump rolled up huge margins in those counties and juiced turnout as well.",
    "Vance.?\nRyan already has signaled in his ads how he hopes to do this.",
    "People need to feel that he has their interests and their backs.",
    "Since Trump arrived on the scene, that has changed dramatically.",
    "He will run hard against China and free-trade pacts generally.",
    "For Ryan, its a potential help in the states suburban areas.",
    "Even then, hell have to execute everything with precision.",
    "Vance has become a disciple of Trumps anti-elite posture.",
    "Its not just stupid decisions [by government and others].",
    "We have to be there, we have to talk with these folks.",
    "Some Democrats now consider Ohio a red state.",
    "Im not your guy,? he says in one of his ads.",
    "The one wild card there will be abortion.",
    "His ads have to be on target.",
    "They need a representative.",
    "We have to contrast J.D.",
    "You want culture wars?",
    "They have to meet Tim.",
    "The winner was J.D."
  ]
}