{
  "id": 5678,
  "mediaId": 136,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "How To Watch Donald Trump's Pennsylvania Rally For Dr. Mehmet Oz",
  "image": "https://d.newsweek.com/en/full/2032096/oz-speak-trump-rally.webp?w=790&f=c7ecf91128b855a702cdd20b5100762a",
  "link": "https://www.newsweek.com/donald-trump-rally-pennsylvania-mehmet-oz-primary-1704117",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    1147,
    1576,
    1653,
    1850,
    3103,
    201,
    571,
    2682,
    2845,
    2862
  ],
  "sentences": [
    "The former president will take the stage at Westmoreland Fairgrounds in Greensburg on Friday night at around 8 p.m.\nOz, who is taking part in a too-close-to-call race alongside former hedge fund CEO David McCormick and political commentator Kathy Barnette, is set to speak at the rally in order to drum up support from Trump's base ahead of the May 17 vote.",
    "The survey notes that Oz did not receive a major bump following Trump's endorsement and only gained two more percent points from the previous poll conducted in early April, before the former president chose the television personality as his preferred choice.",
    "\"This Save America rally is a continuation of President Trump's unprecedented effort to advance the MAGA agenda by energising voters and highlighting America First candidates and causes,\" a statement released via Trump's Save America PAC said.",
    "Dinesh D'Souza, the political commentator and director of the documentary 2,000 Mules, which Trump recently held a special screening of at his Mar-al-lago resort in Florida, is also scheduled to speak at the Westmoreland Fairgrounds event.",
    "The doors for the rally will open at 3 p.m., with the guest speakers starting at 5 p.m.\nHow to Watch Donald Trump Rally in Pennsylvania\nIt is unclear if any television channels will be broadcasting the event live.",
    "Unlike his endorsement of Vance in Ohio, which helped push the Hillbilly Elegy author from third in the polls to clear the winner, Trump's backing of Oz is not shown to be such a deciding factor for voters.",
    "There will also be a live stream on the rally in Greensburg on Trump's Rumble channel, the video-sharing platform similar to YouTube beloved by right-wing and Republican figures.",
    "Vance, the candidate who won the GOP Senate primary in Ohio after getting Trump's much sought after endorsement, will also be a guest speaker at the event.",
    "Donald Trump is due to hold a rally in Pennsylvania to campaign for his pick in the state's GOP Senate primary, celebrity heart surgeon Dr. Mehmet Oz.",
    "According to a recent Franklin & Marshall College poll, Oz currently has a slight lead over McCormick, at 18% to 16%, with Barnette third on 12%.",
    "Others guests at the Pennsylvania rally include MyPillow CEO Mike Lindell, and Pennsylvania congressmen John Joyce, Mike Kelly and Jim Bogent.",
    "In comparison, Barnette saw the biggest increase compared to the previous survey, increasing her support by five percentage points.",
    "As with all Trump rallies, the rally will be streamed live on Right Side Broadcasting Network's YouTube channel.",
    "Trump will be hoping the rally will help Oz increase his chances in the Pennsylvania primary.",
    "On Thursday, it was confirmed that J.D."
  ]
}