{
  "id": 5715,
  "mediaId": 136,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Donald Trump Warns Republican Candidates Against Crossing Him",
  "image": "https://d.newsweek.com/en/full/2031906/donald-trump-endorsements-republicans.webp?w=790&f=e856f59ebb9e901fe538eff3522bac81",
  "link": "https://www.newsweek.com/donald-trump-warns-republican-candidates-against-crossing-him-1703818",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Fung",
  "authorUrl": "https://www.newsweek.com/authors/katherine-fung",
  "termIds": [
    1147,
    1801,
    2027,
    2087,
    2524,
    3103,
    428,
    571
  ],
  "sentences": [
    "Vance, a venture capitalist backed by billionaire Peter Thiel, eventually secured the coveted Trump endorsement in mid-April, which not only gave him a massive boost in the polls but led to his victory Tuesday night, with more than 32 percent of the Republican vote.",
    "Asked if Republicans should be afraid of not being aligned with Trump's agenda, the former president told CNB News on Tuesday, \"Well, if they want to win politically, probably, because if I endorsed them, they win and if I don't endorse them, they don't win.",
    "In response to Vance's victory, Donald Trump Jr., who was the key Trump campaigner in Ohio, declared that \"the GOP is now the MAGA party\"a view even President Joe Biden appeared to agree with last month.",
    "Former President Donald Trump has warned Republicans not to cross him if they're running for office, saying it will be impossible for them to win an election without his endorsement.",
    "Meanwhile, the GOP is aiming to gain control of one or both houses of Congress in the midterms, which historically lead to a sitting president's party losing seats.",
    "Trump's influence over voters was only further highlighted by the performance of one of Vance's opponents for the Republican nomination, state Senator Matt Dolan.",
    "Throughout his campaign, Dolan unabashedly criticized Trump and condemned the former president's claims about voter fraud in the 2020 presidential election.",
    "Biden doubled down on that rhetoric Wednesday when addressing the economic plan proposed by Senate Republicans, saying, \"It's a MAGA agenda all right.",
    "The first test of Trump's political power in influencing the outcome of races came Tuesday during Ohio's May 3 GOP primary.",
    "The high-profile Senate race featured a crowded field of candidates fighting for the former president's support.",
    "As of this week, Trump has a 55-0 streak when it comes to picking the winning candidates in primaries.",
    "On Tuesday, Trump said Biden's missteps have proved that he was correct on a variety of issues.",
    "And I've had many people say as good as I think we were, they said, you were the best at it.",
    "He has endorsed over 150 Republican candidates for a variety of offices across the country.",
    "He went on, \"When I said that during debates and elsewhere, people sort of weren't sure.",
    "Let me tell you about this ultra-MAGA agenda: It's extreme, as most MAGA things are.\"",
    "He added, \"My record is unparalleled, my endorsements, it's totally unparalleled.",
    "Republicans are closely watching to see if Trump can continue to be a kingmaker.",
    "Dolan received the third-highest number of votes, gaining 23 percent.",
    "MAGA refers to Trump's \"Make America Great Again\" campaign slogan.",
    "\"I'm not just talking about energy or on the border.",
    "I said they're against organized religion, frankly.\"",
    "I mean, that's almost 100 percent of the case.\"",
    "Not a joke,\" Biden said in an April 22 speech.",
    "I said these people are against evangelicals.",
    "\"This ain't your father's Republican Party.",
    "\"Everything I said was right,\" Trump said.",
    "You were the best, and they want me back.\"",
    "These guys are a different breed of cat.\"",
    "Nobody's ever had a record like this.",
    "\"This is the MAGA party now....",
    "I said they're against Israel.",
    "I'm talking about religion.",
    "I turned out to be right.",
    "I'm almost unblemished.\"",
    "J.D."
  ]
}