{
  "id": 5744,
  "mediaId": 157,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Trump to hold follow-up call with voters after Nebraska rally for Charles Herbster",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29766051&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/trump-to-hold-follow-up-call-with-voters-after-nebraska-rally-for-charles-herbster/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron Sanderford",
  "authorUrl": "https://www.rawstory.com/u/aaronsanderford-nebraskaexaminer",
  "termIds": [
    1147,
    1801,
    1839,
    1909,
    3010,
    3103,
    2816,
    2845
  ],
  "sentences": [
    "Herbster is in a competitive race for the states Republican nomination for governor with University of Nebraska Regent Jim Pillen and State Sen. Brett Lindstrom headng into Tuesdays primary election.",
    "Four days after hosting more than 3,000 people at a rally in eastern Nebraska, former President Donald Trump is dialing back into the states GOP primary race for governor.",
    "Herbster, in a podcast interview Wednesday with former Trump adviser Steve Bannon, said his internal polling shows him maintaining? a slight lead.",
    "Nebraska Examiner is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "In another twist that might skew polling results, 8,400 Nebraskans have registered as Republicans since the beginning of March.",
    "By contrast, his endorsement of Herbster in Nebraska came in October, which Herbster has promoted heavily for months.",
    "Political observers have questioned how many GOP primary voters didnt already know Trumps choice.",
    "The number of registered Democrats and independents dropped by nearly the same number.",
    "Trump is hosting a telephone rally? Thursday with Conklin Co. CEO Charles Herbster.",
    "Most political observers expect a close race, swayed by still-undecided voters.",
    "Trump held a similar phone rally in Ohio for U.S. Senate candidate J.D.",
    "Contact Editor Cate Folsom for questions: info@nebraskaexaminer.com.",
    "The phone number for the Trump-Herbster rally is (308) 210-7274.",
    "Other candidates recent polls have shown different leaders.",
    "Only registered Republicans can vote in the GOP primary.",
    "Nebraska Examiner maintains editorial independence.",
    "Follow Nebraska Examiner on Facebook and Twitter.",
    "Vance, who won the GOP nomination there Tuesday.",
    "Trumps team has scheduled a call at 6 p.m. CDT.",
    "Trump endorsed Vance late in the race."
  ]
}