{
  "id": 5765,
  "mediaId": 65,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Democrat Tim Ryan dodges question on whether he'll let Biden campaign for him in Ohio Senate race",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/9d0fb576-6c22-4ef3-ac64-088eaa168c3e/41074fd1-a9dc-48fd-b53f-ab9735abd828/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/democrat-tim-ryan-dodges-question-whether-hell-let-biden-campaign-him-ohio-senate-race",
  "sentiment": "-0.819",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    781,
    1147,
    1220,
    1801,
    2087,
    3103,
    146,
    380,
    428,
    571,
    2845
  ],
  "sentences": [
    "FORMER CBS ABORTION REPORTER FLIPS OUT OVER ROE V WADE LEAK: 'F--- YOU' TO THOSE WHO SAID I WAS OVERREACTING\nThe specific Biden question came at the end of the segment between Berman and Ryan, with the anchor asking, \"Will you invite President Biden to come campaign for you?\"",
    "\"And we welcome support from all corners, like I said, Democrats, Republicans and independents, were going to have a big Republicans for Ryan initiative with elected officials, Republican elected officials in Ohio supporting us,\" he added.",
    "\"This is what the American people want, this is what Ohioans want, build a community of people who really care about Ohio, care about the country and want to put this partisan stuff behind us.",
    "During a Wednesday interview on CNNs New Day, Ryan did his best to dodge whether he would allow Biden to come out and campaign for him against Republican Senate candidate J.D.",
    "In an awkward deflection, Ryan told anchor John Berman that he would be the face of his own campaign and wasnt enthusiastic about the idea of \"surrogates\" running with him.",
    "The Senate candidate agreed and said his campaign is \"not about being a Democrat or being a Republican, I think, this is about being an American.\"",
    "Earlier in the segment Berman had commented that since Trump had won Ohio by eight points in 2020, Ryan would need to bring in the MAGA crowd.",
    "Ryan even mentioned that there would be Trump voters supporting him, adding, \"Veterans who are two-time Trump voters who are in our camp.\"",
    "He then seemed to try to soften the blow to Biden by saying hed welcome any support from anyone, including Democrats and even Republicans.",
    "It doesnt appear Rep. Tim Ryan, D-Ohio, is that interested in President Joe Biden helping out his Senate campaign in Ohio.",
    "\"I want people to get to know me, I want to control my message, I want it to be my face and my background, my record.",
    "\"If youre going to win this Senate race, you need to create something of a Trump-Ryan voter,\" Berman said.",
    "He stated, \"Look, we welcome everybodys support, but I will be the face of this campaign.",
    "I dont think, you know, surrogates are going to play a huge role here.\"",
    "The lawmaker then discussed how he wanted the message to stay his own.",
    "Ryan stressed his desire for bipartisan unity under his campaign.",
    "Ryan paused for a moment before giving his winding answer.",
    "The age of stupidity behind us,\" he finished, laughing.",
    "He explained that he welcomed support from all sources.",
    "But Ryan did not mention Biden once in his answer.",
    "Thats what were going to push,\" he stated.",
    "Vance."
  ]
}