{
  "id": 5768,
  "mediaId": 195,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "The Trump-endorsed candidates who have won their primaries",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/trumpdonaldlouisianarally6_101119screenshot.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3477112-the-trump-endorsed-candidates-that-have-won-their-primaries/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Vakil",
  "authorUrl": "https://thehill.com/author/caroline-vakil/",
  "termIds": [
    1095,
    1115,
    1147,
    1434,
    1801,
    3103,
    3981,
    4498
  ],
  "sentences": [
    "Dan Patrick (incumbent)\nTexas Attorney General Ken Paxton is heading into a runoff with challenger George P. Bush\nHouse races\nRep. Pat Fallon (TX-4; incumbent)\nRep. Lance Gooden (TX-5; incumbent)\nRep. Jake Ellzey (TX-6; incumbent): Trump endorsed Ellzey in February after he beat Trump-endorsed challenger Susan Wright (R-Texas) in a runoff last summer.",
    "Rep. Mike Carey (OH-15, incumbent)\nINDIANA (May 3)\nRep. Jackie Walorski (IND-2, incumbent)\nRep. Jim Banks (IND-3, incumbent)\nRep. Jim Baird (IND-4, incumbent)\nRep. Greg Pence (IND-6, incumbent): Pence, whose brother is former Vice President Mike Pence, won his primary with 78 percent of the vote.",
    "Rep. Michael McCaul (TX-10; incumbent): Trump backed McCaul last November, despite the congressmans moves to certify the 2020 presidential election results and previously saying there may have been impeachable offenses committed leading up to? the Capitol riot that took place on Jan. 6, 2021.",
    "House races\nRep. Steve Chabot (OH-1, incumbent)\nRep. Brad Wenstrup (OH-2, incumbent)\nRep. Jim Jordan (OH-4, incumbent)\nRep. Robert Latta (OH-5, incumbent)\nRep. Bill Johnson (OH-6, incumbent)\nMax Miller (OH-7): A former Trump aide, Miller won his GOP primary against three other opponents.",
    "Dawn Buckingham, who is running for Texas land commissioner (currently held by George P. Bush, who is running for Texas attorney general)\nTexas Comptroller Glenn Hegar (incumbent)\nTexas Agriculture Commissioner Sid Miller (incumbent)\nTexas Lt. Gov.",
    "Troy Balderson (OH-12, incumbent)\nMadison Gesiotto Gilbert (OH-13): In addition to being endorsed by Trump, the House candidate also received backing from House Republican Conference Chairwoman Elise Stefaniks (R-N.Y) super PAC in March.",
    "Rob Portmans (R-Ohio) Senate seat: In what was considered the largest test of Trumps endorsement in a competitive Republican primary thus far, Vance won his primary and is now set to challenge Rep. Tim Ryan (D) for the seat.",
    "Below is a list of Trump-backed candidates who won their respective Republican primaries so far this year:\nOHIO (May 3)\nStatewide races\nTreasurer Robert Sprague (incumbent)\nAuditor Keith Faber (incumbent)\nSenate race\nJ.D.",
    "His campaign told The Hill back in March that he would be making checks out to more than a dozen Republican House candidates in an effort to get more GOP members elected in the upcoming midterms.",
    "Troy Nehls (TX-22; incumbent)\nRep. Beth Van Duyne (TX-24; incumbent)\nRep. Roger Williams (TX-25; incumbent)\nRep. Michael Cloud (TX-27; incumbent)\nRep. John Carter (TX-31; incumbent)\nRep.",
    "Rob Portmans (R-Ohio) seat; former Trump aide Max Miller, who won the Republican primary for Ohios 7th Congressional District; and incumbent Rep. Greg Pence (R-Ind.",
    "The effect of former President Trumps endorsements was on full display Tuesday as each of the 22 candidates he backed won their primaries in Ohio and Indiana.",
    "Rep. August Pfluger (TX-11; incumbent)\nRep. Randy Weber (TX-14; incumbent)\nMonica De La Cruz (TX-15): De La Cruz won with more than 55 percent of the vote.",
    "Trump endorsed her in February despite allegations from her estranged husband that she verbally abused her 14-year-old made, which she has denied.",
    "The win was an example of how the onetime Trump critic could later clench the former presidents endorsement and win the competitive GOP primary.",
    "Brain Babin (TX-36; incumbent)\nWesley Hunt (TX-38): Hunt received more than 55 percent of the vote, according to The Texas Tribune.",
    "The results underscore the weight the former presidents endorsements hold within the GOP, though a bigger test looms in November.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "2 have broken with each other over certifying the 2020 presidential election results.",
    "Rep. Warren Davidson (OH-8, incumbent)\nRep. Michael Turner (OH-10, incumbent)\nRep.",
    "Trumps endorsement came despite the fact that Trump and his former No.",
    "Some of the most notable included Trump critic-turned acolyte J.D.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "), the brother of Trumps former vice president.",
    "Rep. Jodey Arrington (TX-19; incumbent)\nRep.",
    "TEXAS (March 1)\nStatewide races\nState Sen.",
    "Vance, who is running for retiring Sen.",
    "Vance, running for Sen."
  ]
}