{
  "id": 5770,
  "mediaId": 151,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Biden: MAGA is the most extreme political organization in recent U.S. history",
  "image": "https://www.politico.com/dims4/default/2e08c06/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1155968404%2Fce8ad8c7-555b-4a91-a5ae-550ccd1193c9%2F9742534a-2c7a-4cda-af83-c7562caa924c%2F1280x720%2Fmatch%2Fimage.jpg",
  "link": "https://www.politico.com/news/2022/05/04/biden-maga-extreme-political-organization-00029969",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1765,
    2087,
    2305,
    3103,
    338,
    428
  ],
  "sentences": [
    "Speaking at the White House, Biden described his personal economic philosophy as in sharp contrast to what todays Republican Party is offering  and if they hadnt put this in print, youd think I was making it up.?\nSenator Rick Scott of Florida  released what he calls the ultra-MAGA agenda.",
    "And the people who know better are afraid to act correctly, because they know theyll be primaried.?\nIn recent months, Republican-controlled states have approved numerous laws regulating the teaching of critical race theory, targeting transgender rights and restricting abortion access.",
    "Its extreme, as most MAGA things are.?\nResponding to Bidens remarks, Scott told Fox News that almost every sentence was a complete lie.? He went on to accuse the president of passing the buck? on financing federal programs such as Medicare and Social Security.",
    "Bidens remarks underscore broader efforts by Democrats  who are facing significant political headwinds ahead of the midterm elections in November  to highlight Scotts unpopular economic proposals and Republicans emphasis on divisive cultural politics.",
    "By Quint Forgey\n 05/04/2022 12:10 PM EDT\nUpdated: 05/04/2022 01:34 PM EDT\nPresident Joe Biden on Wednesday escalated his rhetorical attacks on the Republican Party and rebuked former President Donald Trumps enduring grip on the GOP.",
    "This MAGA crowd is really the most extreme political organization thats existed in American history, in recent American history,? Biden told reporters at the White House, referring to Trumps Make America Great Again? movement.",
    "In prepared remarks on the economy, Biden also referenced Sen. Rick Scott (R-Fla.) by name, criticizing his 11 Point Plan to Rescue America?  which proposed, in part, raising income taxes on low-income Americans.",
    "But the messaging document was quickly rejected even by Senate Minority Leader Mitch McConnell and fellow Republicans, who viewed it as detrimental to GOP candidates across the country.",
    "On Wednesday, Biden also reiterated his concerns about the Supreme Court draft majority opinion  published by POLITICO on Monday  that would strike down Roe v. Wade.",
    "Vance, won the contentious GOP primary on Tuesday in what was widely viewed as an early test of the former presidents political staying power.",
    "What happens if you have states change the law saying that children who are LGBTQ cant be in classrooms with other children?? Biden said.",
    "Scott, the chair of the National Republican Senatorial Committee, unveiled his conservative campaign blueprint in February.",
    "Such a ruling, he warned, would endanger other fundamental rights related to Americans privacy.",
    "Meanwhile, Trumps strength within the Republican Party has shown no sign of diminishing.",
    " These guys are a different breed of cat,? Biden said in Seattle earlier this month.",
    "What are the next things that are going to be attacked??",
    "His preferred candidate in Ohios open Senate race, J.D.",
    "Theyre not like what I served with for so many years.",
    "Is that legit under the way the decision is written?",
    "Let me tell you about this ultra-MAGA agenda.",
    "Its a MAGA agenda all right,? Biden said.",
    "This is the MAGA party now."
  ]
}