{
  "id": 5780,
  "mediaId": 238,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "4 takeaways from the Ohio primaries",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/04/ohio-2022-primaries-takeaways/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    648,
    684,
    946,
    1147,
    1801,
    2005,
    3103,
    428,
    571,
    2845
  ],
  "sentences": [
    "Its very rare for incumbent governors to struggle that much; only five have been defeated in a primary since 1996, according to the Crystal Ball, and they often did so under special circumstances such as a scandal or having ascended to the job rather than being elected to it.",
    "Former Trump White House aide Max Miller won a primary and is likely to join Congress in a GOP-leaning seat, after being helped by Republican Rep. Bob Gibbss late exit from the race due to huge changes in the boundaries  and thus the makeup  of his district.",
    "Vance won anyway and now presents a significant opportunity for Trump to show former critics what he can do for their political careers if they pull a 180 on him  as Vance very much did  or how he can help others who never criticize him in the first place.",
    "The takeaway seems to be that failing to toe the bases line on things such as the coronavirus (or a stolen election) is a recipe for problems  which is surely a lesson that has become clear to lots of Republicans, including in other races Tuesday night.",
    "Vance had called Trump cultural heroin? and sharply criticized him in 2016, but he took pains to appeal to Trump and his base in the 2022 race, including by embracing Trumps false and disproved claims of massive voter fraud.",
    "Just like King James, LeBron James, decided to take his skills to South Beach, what Sister Turner is gonna do is continue taking my skills all over this nation,? Turner said, per The Washington Posts Dave Weigel.",
    "Majewski now faces Rep. Marcy Kaptur (D-Ohio) and has a decent chance of joining Congress in a district that leans slightly Republican, though his primary win could imperil that seat for the GOP.",
    "But this was also an incumbent taking less than 50 percent of the vote, coming in at 48 percent in a race in which his opponents largely argued he went too far on coronavirus mitigation efforts.",
    "What some of these other races demonstrate is that while Trump clearly maintains influence over primaries, his candidates will surely be tested on the general election ballot, too.",
    "And despite trying very hard to secure the affections of Trump and his supporters, Mandel lost again, by about eight points, just edging out the third-place candidate, Matt Dolan.",
    "Unlike other secretary of state races in which Trump has tried to install election truthers, the former president declined to back LaRoses challenger and actually endorsed LaRose.",
    "Similar to Vance, LaRoses trajectory suggests catering to Trump and his claims about a stolen election help, even as this was merely an incumbent defeating a primary challenger.",
    "He seemed to hedge his bets  something he has done before when his candidate wasnt necessarily looking like a winner  by emphasizing that he liked multiple candidates.",
    "Trump-backed Madison Gesiotto Gilbert won a primary in another congressional district in northeastern Ohio, defeating a former aide to Sen. Tim Scott (R-S.C.).",
    "Majewski was featured on Fox News wearing a Q? shirt and has employed QAnon slogans in the past (though he later distanced himself from the extremist group).",
    "Turner lost a Democratic rematch with Rep. Shontel M. Brown, stretching her six-point primary loss in last years special election to a whopping 30 points.",
    "Mike DeWine (R) is that he survived relatively easily, winning by 20 points after all and defeating former congressman James B. Renacci (R), among others.",
    "If you needed any indication of that things mightve been a little uncertain for Vance, you need only look to Trumps post-endorsement comments.",
    "He was also present for the Jan. 6, 2021, Stop the Steal? rally in Washington but says he didnt take part in the Capitol riot that followed.",
    "He ultimately got 32 percent, suggesting Trump indeed pushed him over the top  just like Trump quite possibly wouldve done with Mandel.",
    "Despite playing down claims of widespread fraud after the 2020 election, he later leaned into the idea of rooting out supposed fraud.",
    "It was her third loss since 2014, when she lost a secretary-of-state race by 24 points (in admittedly tough year for Democrats).",
    "Nearly 7 in 10 voters picked someone besides Trumps endorsed candidate, but it was a crowded primary full of Trump-y candidates.",
    "Trump didnt endorse anyone in the race but in 2020 did hail J.R. Majewski after he painted Trumps campaign banner on his lawn.",
    "He defeated a state House lawmaker backed by more-establishment Republicans and another backed by Rep. Jim Jordan (R-Ohio).",
    "(He also criticized Trump over Jan. 6, and Trump suggested he might back a primary challenger, though he ultimately didnt.)",
    "Vance winning the Ohio GOP Senate primary and being on course to join the Senate, representing an increasingly red state.",
    "The second major primary date of 2022 is in the books, with the headlines coming by virtue of Donald Trump-backed J.D.",
    "Mandel (R), a former state treasurer, lost a 2012 Senate race by six points, underperforming Mitt Romney in the state.",
    "Turner was undeterred, though, not very subtly pointing to a potential 2024 presidential campaign after her loss.",
    "But even shortly before Trump endorsed him April 15, a poll already showed him near the top at 23 percent.",
    "Tuesday handed both yet another loss that could severely stifle what remains of their political careers.",
    "Rep. Anthony Gonzalez (R-Ohio) also could have run, but he retired after supporting Trumps impeachment.",
    "In her concession speech, she mentioned a number of key primary states, including Iowa and Nevada.",
    "He pulled out of a rematch with Sen. Sherrod Brown (D-Ohio) in 2018 but tried again this year.",
    "Josh Mandel and Nina Turner were once hailed as the futures of their parties in Ohio.",
    "In another competitive district, the GOP produced a particularly extreme candidate.",
    "Well have to await more data on how much of a kingmaker Trump is in big races.",
    "And Im gonna see some folks in 2024.?\nThe surface-level verdict for Ohio Gov.",
    "May is chock-full of competitive races in which Trump has picked a side.",
    "Lucky for us, theres plenty on that front over the next few weeks.",
    "Ohio Secretary of State Frank LaRose (R) easily won his primary.",
    "Exactly how much Trump helped is a valid subject of debate.",
    "Vance was languishing in the polls until late in the race.",
    "She, however, faces a tough race in the general election.",
    "That came right after he inadvertently called Vance J.D.",
    "Mandel? (Vances top opponent was Josh Mandel)."
  ]
}