{
  "id": 5810,
  "mediaId": 151,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Here are the Trump-backed candidates who won Tuesday's primaries",
  "image": "https://www.politico.com/dims4/default/e51426e/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Faf%2F9e%2Fdc2d4eb2484c8c3936cc1d08c368%2F20220504-trump-ap-773.jpg",
  "link": "https://www.politico.com/news/2022/05/04/trump-backed-candidates-that-won-ohio-indiana-primaries-00029645",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    819,
    1131,
    1147,
    1434,
    2087,
    3103,
    4797,
    2672,
    2845
  ],
  "sentences": [
    "| Kenneth Ferriera/Lincoln Journal Star via AP, File\nBy Marissa Martinez\n 05/04/2022 01:19 AM EDT\nWith a roster of more than 130 endorsements in midterm races to date, Donald Trump has put his political capital on the line in dozens of states and scores of primaries.",
    "In the March Texas primaries, his first true test of 2022, all of Trumps chosen congressional and statewide candidates won their races with the exception of scandal-plagued state Attorney General Ken Paxton, who is in a runoff later this month.",
    "Last year, in special Senate and House elections, the former presidents record was mixed: Kelly Loeffler of Georgia and Susan Wright of Texas lost their bids, while Mike Carey of Ohio and Julia Letlow of Louisiana won.",
    "But LaRose took a more partisan turn in the last few months, tweeting that President Trump is right to say voter fraud is a serious problem,? despite no evidence of widespread malpractice.",
    "His conversion to full-throated Trump supporter paid off as Trump delivered his stamp of approval not long before the primary  an endorsement that helped power Vance to victory.",
    "He captured it a second time in April, as Trump noted, With my endorsement, Mike resoundingly won his special election last year.?\nIndiana wins\nIN-02\nJackie Walorski\nUnopposed.",
    "He threw his support behind almost every House GOP incumbent running for reelection  and a few hopefuls in open seat primaries  and his preferred candidate won in every case.",
    "Vance, the author of the book Hillbilly Elegy,? once referred to Trump as an idiot,? called himself a Never Trump guy? and said he considered voting for Hillary Clinton.",
    "He was originally endorsed by Trump to take on Rep. Anthony Gonzalez, who was one of 10 House Republicans to vote for Trumps impeachment before he decided to retire.",
    "The incumbent secretary of state was an ardent defender of the 2020 election process, saying both Trump and Biden needed to stop questioning election integrity.",
    "Trump also didnt back Rep. David Joyce, the incumbent in Ohios 14th District, who issued a statement last year denying that the 2020 election was stolen.",
    "Trump bypassed the Indiana Senate race as well, where Sen. Todd Young  who said Trump bears responsibility for the January 6 attacks  won renomination.",
    "His pick in the the highest profile race of the day, the Ohio Senate GOP primary, also won the nomination largely due to Trumps endorsement power.",
    "Greg is working hard to reverse Joe Bidens disastrous record of out-of-control Inflation and restore the respect our Country deserves from abroad.",
    "He is Strong on the Border, Protects Life, Defends the Second Amendment, and Supports our brave Military and Vets,? Trump said in a statement.",
    "Of course, the bar for success wasnt that high: Trump backed numerous incumbents who faced token primary opposition or were unopposed.",
    "Mike DeWine  one of the first prominent Republicans to acknowledge President Joe Bidens victory  fended off a stiff primary challenge.",
    "Carey, a former coal lobbyist, got Trumps endorsement last year during a special election to replace Republican Rep. Steve Stivers.",
    "Gesiotto Gilbert is a conservative commentator and attorney who served as co-chair of the Women for Trump advisory board.",
    "The head of the Republican Study Committee, the House GOPs largest caucus, Banks voted to overturn 2020 election results.",
    "In Tuesdays Indiana and Ohio primaries, Trump once again ran the table: All 22 of his endorsed candidates won.",
    "Miller, a former Trump aide, was by far the highest fundraiser in the race for the solid Republican district.",
    "The older brother of former Vice President Mike Pence, Greg Pence voted to overturn 2020 election results.",
    "Former President Donald Trump speaks from the podium during a rally on May 1, 2022, in Greenwood, Neb.",
    "In his endorsement, Trump made no mention of his strained relationship with Pences younger brother.",
    "Notably, Trump did not endorse in the Ohio governors race, where Republican Gov.",
    "But he changed his tune once he began his pursuit of the Senate nomination.",
    "Ohio wins\nSecretary of State\nFrank LaRose\nWon with 65 percent of the vote.",
    "Here is a look at the 22 Trump-endorsed candidates who won Tuesday.",
    "OH-13\nMadison Gesiotto Gilbert\nWon with 29 percent of the vote.",
    "Vance will face Democratic nominee Tim Ryan in November.",
    "OH-08\nWarren Davidson\nWon with 71 percent of the vote.",
    "OH-12\nTroy Balderson\nWon with 82 percent of the vote.",
    "OH-02\nBrad Wenstrup\nWon with 78 percent of the vote.",
    "OH-06\nBill Johnson\nWon with 77 percent of the vote.",
    "OH-07\nMax Miller\nWon with 72 percent of the vote.",
    "Davidson voted to overturn 2020 election results.",
    "Walorski voted to overturn 2020 election results.",
    "IN-06\nGreg Pence\nWon with 78 percent of the vote.",
    "Johnson voted to overturn 2020 election results.",
    "Jordan voted to overturn 2020 election results.",
    "Chabot voted to overturn 2020 election results.",
    "Baird voted to overturn 2020 election results.",
    "This year, his record is considerably better.",
    "Vance\nWon with 32 percent of the vote.",
    "Attorney General\nDave Yost\nUnopposed.",
    "Treasurer\nRobert Sprague\nUnopposed.",
    "IN-05\nVictoria Spartz\nUnopposed.",
    "OH-10\nMichael Turner\nUnopposed.",
    "Auditor\nKeith Faber\nUnopposed.",
    "IN-08\nLarry Bucshon\nUnopposed.",
    "OH-01\nSteve Chabot\nUnopposed.",
    "OH-05\nRobert Latta\nUnopposed.",
    "IN-04\nJames Baird\nUnopposed.",
    "OH-15\nMike Carey\nUnopposed.",
    "OH-04\nJim Jordan\nUnopposed.",
    "IN-03\nJim Banks\nUnopposed.",
    "U.S. Senate\nJ.D."
  ]
}