{
  "id": 5834,
  "mediaId": 124,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Vance leads in Ohio Republican Senate primary, remains too early to call",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-05/220503-ohio-election-vance-mandel-main-2x1-cs-d65c92.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/polls-close-ohio-gop-primaries-test-trumps-influence-rcna26336",
  "sentiment": "0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    648,
    781,
    819,
    1801,
    2027,
    2466,
    3103,
    428,
    571,
    2609,
    2845
  ],
  "sentences": [
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nMeanwhile, polls over the last week showed state Sen. Matt Dolan, who ran his campaign as an antidote to Trump's personality-driven politics and didn't court the former president's endorsement, rising.",
    "Ohio primary is first test of Trumps influence post-presidency\nMay 3, 202201:52\nVance, a best-selling author and venture capitalist who had no political roots in Ohio, spent the early days of his campaign apologizing for his extensive criticism of Trump in 2016.",
    "Polls have closed in Ohio, where a marquee Republican Senate primary  which remains too early to call  and other races offer an early test of former President Donald Trump's influence and the overall mood of the electorate ahead of November's midterm elections.",
    "The Democrats clashed last year in a bitter special election that dwelt on Turners past criticisms of President Joe Biden, whom she worked against as a co-chair and prominent surrogate for Sen. Bernie Sanders 2020 White House campaign.",
    "The Club for Growth, a conservative advocacy group that had been close with Trump, backed his campaign through a super PAC that spent millions of dollars attacking other candidates, including Vance, for his past criticisms of Trump.",
    "But Timken's pitch was complicated by kind words she had for Rep. Anthony Gonzalez, R-Ohio, in an interview with Cleveland.com and The Plain Dealer shortly after Gonzalez was one of 10 House Republicans who voted to impeach Trump.",
    "But Gibbons' unpolished speaking style  he is not, he and his advisers would constantly remind reporters, a politician  hurt him in the early debates, details of which allies to other candidates gleefully reported back to Trump.",
    "But while Dolan's approach caught the former president's attention  twice Trump issued statements blasting the baseball team for changing its name from Indians to Guardians  he was never attacked heavily in TV ads.",
    "Trumps endorsement of Vance, the author of Hillbilly Elegy,\" over former state Treasurer Josh Mandel and others last month upended a contest that had revolved around a very public audition for his support.",
    "DeWine  once popular with voters in both parties because of decisive early leadership during the Covid pandemic  was fighting for renomination against several challengers running to his right.",
    "But three others who had presented themselves as the purest pro-Trump candidates  Mandel, former state party leader Jane Timken and investment banker Mike Gibbons  remained in the race.",
    "And Trump  drawn to the idea of elevating a convert, particularly one who shared his populist and nationalist instincts  shrugged off the \"not so great things\" that Vance had said.",
    "Dolan, whose family owns the Cleveland Guardians, invested more than $10 million of his money, running ads that promoted a conservative policy agenda without promoting Trump.",
    "Timken earned Portman's endorsement and hired former Trump advisers like Kellyanne Conway and Corey Lewandowski, but none of it was enough to impress the former president.",
    "Trump's endorsement helped Vance, whose campaign was only beginning to advertise on TV and attract institutional support in Ohio, quickly climb to the top of the polls.",
    "Timken came close to landing Trump's early endorsement, given that he had handpicked her to run the state party and, with her guidance, won Ohio by 8 points in 2020.",
    "The more than $16 million he loaned his campaign helped pay for a crush of TV ads that boosted his name-recognition and elevated him into a polling tie with Mandel.",
    "It didn't hurt that Vance had a champion in Peter Thiel, the Trump-friendly tech entrepreneur who has poured more than $13 million into a pro-Vance super PAC.",
    "Vance is leading Ohios competitive Republican Senate primary, NBC News projects, while Democratic Rep. Tim Ryan has secured his party's nomination Tuesday.",
    "As of Tuesday, the GOP candidates and the outside groups supporting them had spent a combined $70 million, according to the ad tracking firm AdImpact.",
    "Mandel, twice elected to statewide office and a losing Senate candidate in 2012, was the early GOP front-runner based largely on name-recognition.",
    "Republicans are favored in both statewide contests in November's general election as Ohio has shifted deeper into the GOP column in recent years.",
    "Mike DeWine secured the nomination in his bid for re-election, NBC News projects, while former Dayton Mayor Nan Whaley won the Democratic nod.",
    "And although Timken put some of her own money into the campaign, it was no match for other self-funders and super PACs playing in the race.",
    "A rematch between Rep. Shontel Brown and former state Sen. Nina Turner in Ohios 11th Congressional District also has captured attention.",
    "Kornacki: Where the Ohio primary election stands\nMay 3, 202203:16\nGibbons, for example, briefly bought himself front-runner status.",
    "And a near-physical confrontation instigated by Mandel at their first debate ultimately reflected poorly on both candidates.",
    "He also was the only primary hopeful to unequivocally say the 2020 presidential election was not stolen from Trump.",
    "Overall, the Republican Senate primary is the most expensive race, in terms of advertising, so far in 2022.",
    "On the Democratic side, Ryan, who briefly ran for president in 2020 easily defeated his opponents.",
    "But it's the GOP Senate primary that has become a closely watched barometer of national politics.",
    "Rob Portman, a Republican who decided against seeking a third term this year.",
    "Trump's advisers encouraged him to wait and see how the field developed.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Meanwhile, Whaley defeated former Cincinnati mayor John Cranley.",
    "Vance spent the closing days swinging at Mandel and Dolan.",
    "In the gubernatorial contest, incumbent Republican Gov.",
    "Other candidates showed flashes of promise.",
    "Alex Seitz-Wald reported from Washington.",
    "Henry J. Gomez reported from Cincinnati.",
    "The winner in November will succeed Sen.",
    "CINCINNATI  J.D."
  ]
}