{
  "id": 5839,
  "mediaId": 395,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "State Department Declares WNBA Star Brittney Griner to Be Wrongfully Detained in Russia",
  "image": "https://www.democracynow.org/images/headlines/26/62626/quarter_hd/HL11-BrittneyGriner.jpg",
  "link": "https://www.democracynow.org/2022/5/4/headlines/state_department_declares_wnba_star_brittney_griner_to_be_wrongfully_detained_in_russia",
  "sentiment": "0",
  "mediaOutlet": "Democracy Now!",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    895,
    1341,
    2087,
    2505,
    3103,
    3817,
    4193,
    4685,
    551,
    3660,
    2888
  ],
  "sentences": [
    "And our low-income communities, our Black and Brown communities, our LGBTQ communities will be the ones who pay the steepest price, because abortion wont go away, but safe and legal abortion will, endangering millions of people.?\nWithout Filibuster Reform, Democratic Efforts to Codify Abortion Rights Will Fail\nOn Capitol Hill, Senate Majority Leader Chuck Schumer said the Senate will soon vote to codify abortion rights into law, but the effort is expected to fail even though Democrats control both houses and the presidency.",
    "Vice President Kamala Harris: If the court overturns Roe v. Wade, it will be a direct assault on freedom, on the fundamental right of self-determination, to which all Americans are entitled.?\nLegal Experts: Overturning Roe Could Lead to Ending Same-Sex Marriage & Access to Contraceptives\nLegal experts are warning the overturning of Roe could pave the way for the conservative justices to also end same-sex marriage and access to contraceptives.",
    "We either back the Ukrainian people as they defend their country or we stand by as Russia continues its atrocities and aggression.?\nNATOs Barking at Russias Gate?: Pope Francis Partially Blames West for War in Ukraine\nPope Francis has revealed that he asked to meet with Russian President Vladimir Putin in Moscow three weeks ago in an effort to end the war, but the pope says he has not received a response.",
    "The pope said Putin may have been reacting to NATOs barking at Russias gate.? The pope went on to say, I wouldnt know if this provoked an ire, but perhaps it facilitated it.?\nU.N.: 4.5 Tons of Grain Stuck in Ukraine Due to Russian Blockade\nThe U.N. World Food Programme says about 4.5 million tons of grain are stuck in Ukraine due to Russias blockade of Ukrainian ports on the Black Sea.",
    "Guterres made the remarks during a trip to West Africa, where he also called for debt relief for African nations and for the military juntas in Burkina Faso, Guinea and Mali to hand over power to civilians as soon as possible.? The head of the military government in Guinea recently said a 39-month transition period is needed before civilian rule returns.",
    "VP Harris: Overturning Roe v. Wade Would Be Direct Assault on Freedom?\nProtests are continuing to take place across the country following the publication of a leaked Supreme Court opinion that reveals the court is preparing to overturn Roe v. Wade, the landmark decision that established a constitutional right to abortion in the United States.",
    "The sites editor-in-chief, Joe Lauria, said, Given the current political climate it is more than conceivable that PayPal is reacting to Consortium News coverage of the war in Ukraine, which is not in line with the dominant narrative that is being increasingly enforced.? Paypal also recently froze the account of another site, MintPress News.",
    "Trump on Black Lives Matter Protesters: Cant You Just Shoot Them??\nFormer Defense Secretary Mark Esper says that former President Donald Trump wanted Black Lives Matter protesters to be shot in 2020 as protests calling for racial justice spread across the country following the police killing of George Floyd.",
    "Just shoot them in the legs or something??\nGuterres Warns Africa Is Facing Triple Crisis; Calls for Military Juntas to Hand Over Power\nU.N. Secretary-General Antnio Guterres has warned the war in Ukraine is aggravating a food, energy and financial crisis across Africa.",
    "And Ive got to say, a lot of the fake news media out there  and there are some good ones in the back there; there are some bad ones, too, lets be honest  but they wanted to write a story that this campaign would be the death of Donald Trumps 'America First' agenda.",
    "Philadelphia Police Officer Charged with Murder for Fatally Shooting 12-Year-Old Boy\nA former Philadelphia police officer has been charged with murder and is being held without bail for fatally shooting an unarmed 12-year-old boy named Thomas Siderio in March.",
    "Parts of Lviv Without Power or Water After Russian Missile Strikes\nParts of the western Ukrainian city of Lviv remain without power and water after Russian missiles hit three electrical substations on Tuesday in the first attacks on the city in over a week.",
    "This comes about a week after North Korean leader Kim Jong-un vowed to develop the countrys nuclear arsenal at the fastest possible speed.? Todays test also comes just days before the May 10 inauguration of South Koreas new president, Yoon Suk-yeol.",
    "This will be  this will be a complete import ban on all Russian oil, seaborne and pipeline, crude and refined.?\nThe EU is planning to give exemptions to Hungary and Slovakia to allow them to keep importing Russian oil for a longer period of time.",
    "Report: CIA Director Made Secret Trip to Saudi Arabia to Meet MBS in April\nThe Wall Street Journal has revealed CIA Director William Burns made a secret trip to Saudi Arabia last month where he met with Crown Prince Mohammed bin Salman.",
    "EU Unveils Proposal to Ban All Russian Oil Imports by End of Year\nThe European Union has unveiled a proposal to ban all Russian oil imports by the end of the year as part of a new round of sanctions over Russias invasion of Ukraine.",
    "PayPal Freezes Funds for Consortium News, An Outlet Critical of U.S. Policy on Ukraine\nPayPal has canceled the account and frozen the funds of the independent news outlet Consortium News, which has criticized U.S. policy on Ukraine.",
    "Ex-NYPD Officer Convicted for Assaulting D.C. Cop During Jan. 6 Insurrection\nA former New York City police officer has been convicted of assaulting a D.C. police officer during the deadly January 6 insurrection at the U.S. Capitol.",
    "Politico reports Thiel spent more than $15 million to back Vance, who will face Democratic Congressmember Tim Ryan in Novembers election to fill the seat currently held by Republican Senator Rob Portman.",
    "Biden Visits Lockheed Martin Plant to Push for Passage of $33B for Ukraine\nOn Tuesday, President Biden visited a Lockheed Martin plant in Alabama where Javelin anti-tank missile systems are made.",
    "Military in Belarus Begins Large-Scale Military Drills to Test Combat Readiness\nThe Belarusian military has just begun large-scale military drills to test its army vehicles for combat readiness.",
    "The U.S. State Department has declared that WNBA superstar Brittney Griner is being wrongfully detained? in Russia, in a sign the Biden administration may begin to press harder for her release.",
    "As a member of Congress, he pushed for the passage of the Civil Liberties Act of 1988 to grant reparations to Japanese Americans who were interned by the U.S. government during World War II.",
    "Vance Wins GOP Senate Primary in Ohio with Help from Trump & Peter Thiel\nVoters in Ohio and Indiana went to the polls Tuesday for two of the first primaries of this midterm election cycle.",
    "In another closely watched race, Democratic Congressmember Shontel Brown has defeated challenger Nina Turner, the former co-chair of Bernie Sanderss 2020 presidential campaign.",
    "Philadelphia District Attorney Larry Krasner accused the officer, Edsaul Mendoza, of shooting the 12-year-old while the boy was face down on the sidewalk after a foot chase.",
    "In the southeastern city of Mariupol, there are reports Russian tanks are storming the Azovstal steel plant where Ukrainian fighters and civilians have been holed up.",
    "Oklahoma Governor Signs Six-Week Abortion Ban\nOn Tuesday, Oklahomas Republican Governor Kevin Stitt signed a law banning abortions after just six weeks of pregnancy.",
    "Palestinians are often arrested on secret evidence and not given a chance to defend themselves in court while being held in whats known as administrative detention.",
    "Report: Israel Is Holding 600 Palestinians Without Charge or Trial\nIsrael is now holding 600 Palestinians without charge or trial  the highest number since 2016.",
    "Oklahomas new law allows any state resident to sue doctors who perform abortions or anyone who aids or abets? an abortion  with rewards of at least $10,000.",
    "Vance is a venture capitalist and author of the best-selling book Hillbilly Elegy.? He was heavily backed by the right-wing tech billionaire Peter Thiel.",
    "This is in part because Democratic Senator Joe Manchin of West Virginia and Kyrsten Sinema of Arizona continue to oppose changing the filibuster rules.",
    "The original content of this program is licensed under a Creative Commons Attribution-Noncommercial-No Derivative Works 3.0 United States License.",
    "Rep. Pramila Jayapal: There is a straight line from upending abortion rights to getting rid of access to contraception, to banning gay marriage.",
    "According to the Guttmacher Institute, Oklahoma is one of 26 states where abortions could be banned once the Supreme Court overturns Roe.",
    "On Tuesday, Supreme Court Chief Justice John Roberts confirmed the leaked document is authentic, but said it is only a draft opinion.",
    "She was jailed in February after cannabis oil was found in her luggage when she flew into Russia to play during the WNBAs offseason.",
    "The office played a key role in securing the recent prisoner swap with Russia that led to the release of former marine Trevor Reed.",
    "Biden called on Congress to approve his request for $33 billion more for Ukraine, including over $20 billion in military funding.",
    "The company made $6.2 billion in profits in the first three months of the year  thats almost $3 million in profit every hour.",
    "Prosecutors say the 12-year-old had fired a gun at one point but had discarded it about 40 feet away from where he was shot.",
    "Prosecutors accused Webster of attacking a D.C. police officer with a flag pole and then tackling the officer to the ground.",
    "North Korea Launches Suspected Ballistic Missile\nNorth Korea has launched a suspected ballistic missile off its east coast.",
    "BP Records $6.2 Billion in Profits over Past Three Months\nBP has become the latest oil giant to announce massive profits.",
    "Norman Mineta, 90, Dies; Helped Win Reparations for Interned Japanese Americans\nNorman Mineta has died at the age of 90.",
    "In an interview with an Italian newspaper, the pope appeared to lay some of the blame for the Ukraine conflict on NATO.",
    "The State Department has now transferred her case to the Office of the Special Presidential Envoy for Hostage Affairs.",
    "The U.N. has been warning for weeks that the war in Ukraine could lead to a spike in global hunger and famine.",
    "In eastern Ukraine, local authorities in Donetsk say 21 civilians have died after Russian attacks on Tuesday.",
    "President Biden and Vice President Kamala Harris both spoke out in defense of reproductive rights on Tuesday.",
    "He was the first Asian American cabinet secretary, serving under Presidents Bill Clinton and George W. Bush.",
    "And lets be clear: It will not be easy, because some member states are strongly dependent on Russian oil.",
    "Some of the work(s) that this program incorporates, however, may be separately licensed.",
    "President Joe Biden: As I said from the beginning, this fight is not going to be cheap.",
    "The meeting came as the Biden administration is pushing the Saudis to pump more oil.",
    "Vance won the Republican Senate primary after securing the backing of Donald Trump.",
    "Belarus is a close ally of Russia and shares a nearly 700-mile border with Ukraine.",
    "European Commission President Ursula von der Leyen spoke earlier today in Brussels.",
    "Brittney Griner is a two-time Olympic gold medalist and seven-time WNBA all-star.",
    "It was a rematch of last years special election that brought Brown to Congress.",
    "The bill is modeled on Texass anti-abortion law that took effect in September.",
    "Ursula von der Leyen: Today we are addressing our dependency on Russian oil.",
    "Ladies and gentlemen, it aint the death of the 'America First' agenda.?\nJ.D.",
    "Vance praised the former president during his victory rally Tuesday night.",
    "He used to work on former New York Mayor Mike Bloombergs security detail.",
    "On Tuesday, Congressmember Pramila Jayapal spoke at a protest in Seattle.",
    "As a child, he spent two years living in an internment camp in Wyoming.",
    "She is also a Black lesbian who has been outspoken for LGBTQ+ rights.",
    "In his new book, Esper quotes Trump saying, Cant you just shoot them?",
    "This according to a report by the Israeli human rights group HaMoked.",
    "In recent days over 100 civilians were able to evacuate the plant.",
    "Vance: Thanks to the president for everything, for endorsing me.",
    "Please attribute legal copies of this work to democracynow.org.",
    "For further information or additional permissions, contact us.",
    "So, today, we will propose to ban all Russian oil from Europe.",
    "We will have more on the Ohio election later in the program.",
    "We're hiring a Part-Time Broadcast News Writer/Producer.",
    "Roberts has launched an investigation into the leak.",
    "But caving to aggression would be even more costly.",
    "Thomas Webster was found guilty on six counts.",
    "Harris spoke at a gala hosted by Emilys List.",
    "Mineta was the son of Japanese immigrants.",
    "Webster retired from the NYPD in 2011.",
    "But we simply have to do it.",
    "Learn more and apply today!",
    "In Ohio, J.D.",
    "J.D.",
    "J.D."
  ]
}