{
  "id": 5901,
  "mediaId": 223,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "J.D. Vance Wins Ohio GOP Senate Primary",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/117/b4457ba2-116c-44e4-b4d9-4cb8b57f97e1.jpg",
  "link": "https://townhall.com/tipsheet/spencerbrown/2022/05/03/we-have-a-winner-in-the-ohio-gop-senate-primary-n2606727",
  "sentiment": "0.916",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Spencer Brown",
  "authorUrl": "https://townhall.com/tipsheet/spencerbrown/",
  "termIds": [
    1054,
    1115,
    1147,
    1710,
    1801,
    2027,
    3103,
    379,
    428,
    571,
    2845
  ],
  "sentences": [
    "Decision Desk HQ projects J.D Vance (@JDVance1) has won the OH GOP Senate Nomination\nRace Call At: May 3rd 9:09pm edt\nMore results here: https://t.co/MOUZI5gypR\n Decision Desk HQ (@DecisionDeskHQ) May 4, 2022\nAs Guy pointed out earlier on Tuesday as polls across Ohio opened, the contest to choose the Republican candidate for U.S. Senate was not just important as holding the seat is key to the GOP's goal of taking control of the Senate in November  it was also a key test for Donald Trump and his influence in Republican politics.",
    "The Republican candidates' fight to replace retiring GOP Senator Rob Portman drew power players from across the Republican party  most notably former President Donald Trump who endorsed Vance, Senator Ted Cruz (R-TX) who endorsed Mandel, and Senator Rand Paul (R-KY) who endorsed Gibbons  weigh in with their endorsements.",
    "Decision Desk HQ projects Tim Ryan (@TimRyan) has won the OH Democratic Senate Nomination\nRace Call At: May 3rd at 7:54 pm edt\nMore results here: https://t.co/MOUZI5gypR\n Decision Desk HQ (@DecisionDeskHQ) May 3, 2022\nFull GOP and Democrat primary results are below:",
    "In the final weeks of the contest  and following Trump's endorsement  Vance more than doubled his support according to a Fox News poll, surging from a third-place 11 percent to a first-place 23 percent between March and April.",
    "Vance prevailed over challengers Josh Mandel, Matt Dolan, Mike Gibbons, and Jane Timken on Tuesday to win Ohio's GOP Senate primary following a hotly contest campaign.",
    "The Hillbilly Elegy author will face Democrat primary winner and current U.S. Rep. Tim Ryan in November's general election contest barely six months away.",
    "It was a fast and furious race, one that had its share of...messy moments.",
    "Author and venture capitalist J.D."
  ]
}