{
  "id": 5905,
  "mediaId": 136,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Trump Worried Tim Ryan's Cash Puts J.D. Vance's Senate Shot at Risk",
  "image": "https://d.newsweek.com/en/full/2030542/former-president-donald-trump-jd-vance.webp?w=790&f=a2588531d7fabb9a5fa97423b59f5864",
  "link": "https://www.newsweek.com/donald-trump-tim-ryan-jd-vance-ohio-senate-race-money-1703140",
  "sentiment": "-0.824",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Staten",
  "authorUrl": "https://www.newsweek.com/authors/adam-staten",
  "termIds": [
    717,
    781,
    946,
    1147,
    1801,
    3103,
    571
  ],
  "sentences": [
    "In a response to Newsweek regarding Trump's comments on Tuesday, Tim for Ohio spokesperson Izzi Levy said: \"Whichever out-of-touch millionaire limps out of tonight's primary should be worried about a lot more than moneyTim welcomes the opportunity to compare his lifelong record of fighting for Ohio workers with whatever these flawed and phony candidates have to offer.\"",
    "Following Trump's endorsement of Vance's candidacy in April, an old text from 2016 resurfaced in which Vance reportedly worried that Trump could be \"America's Hitler\" and allegedly wrote that the GOP \"has only itself to blame\" for Trump's rise.",
    "The latest polls from Real Clear Politics on the Republican Senate race in the state have Vance leading the pack at 26 percent of the vote with Josh Mandel not trailing too far behind at 22.5 percent.",
    "Trump, as he mentioned Ryan's past presidential campaign, again talked about the kind of money he believes Ryan's U.S. Senate campaign will have for the race in the fall.",
    "Trump's comments about the race on Tuesday came after a rally on Sunday in Nebraska where the former president mixed up Vance's name with his GOP primary opponent Mandel.",
    "During his appearance, Trump mentioned that the finances of Democrat Congressman Tim Ryan have caught his attention regarding a possible race with Republican Vance.",
    "And I don't think he's a great candidate, but I think he's going to have $50, $60 million to spend and that's a lot of money,\" Trump said on the radio program.",
    "When asked about Vance, Trump explained his reason for endorsing the author of the popular Hillbilly Elegy over the other candidates in the race.",
    "Former President Donald Trump said the money situation in a potential match-up for a United States Senate seat in the Midwest has his attention.",
    "He agreed with everything that we've done and very, very importantly, he became, I think, very pro-Trump and very 'America first,'\" Trump said.",
    "But the fact is he did very poorly in that one, and I think he'll do pretty poorly here, but he's going to have a lot of money to spend.",
    "While on The Bruce Hooley Show on Tuesday, Trump talked about a possible U.S. Senate race in Ohio involving J.D.",
    "Also in 2016, Vance allegedly referred to Trump as an \"idiot\" and stated that he was a \"Never Trump\" person.",
    "Vance, a candidate Trump has endorsed despite Vance's earlier criticisms of the former president.",
    "They all were really, but I would say he was pretty normal rough, relatively speaking.",
    "Newsweek reached out to a representative for Trump and the Vance campaign for comment.",
    "He actually got zero, and I was surprised because I think he is better than that.",
    "'s best suited to win the election because it's not going to be an easy election.",
    "On Tuesday, voters in Ohio head to the polls to vote in their party's primary.",
    "In addition to Ohio, voters in Indiana also go to the polls on Tuesday.",
    "It'll probably be Ryan, and Ryan's going to have a lot of money.",
    "\"I think, look, Ryan went for president and he didn't register.",
    "\"I liked him, but he was rough on me but so was everybody else.",
    "\"You know, we've endorsed Dr. Oz, we've endorsed J.P., right?",
    "So, we'll see what happens, Bruce,\" Trump said.",
    "They're all doing good,\" Trump told the crowd.",
    "I just thought he was very exceptional.",
    "He came back a long way, as you know.",
    "He said he agreed with my policy.",
    "Mandel, and he's doing great.",
    "He retracted everything.",
    "\"I think J.D.",
    "J.D."
  ]
}