{
  "id": 5917,
  "mediaId": 136,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "The White House's Response to the Fentanyl Crisis Falls Short | Opinion",
  "image": "https://d.newsweek.com/en/full/2030271/jd-vance.webp?w=790&f=efac8ad37c90d8175243ac568e352d8f",
  "link": "https://www.newsweek.com/white-houses-response-fentanyl-crisis-falls-short-opinion-1703082",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1801,
    2087,
    3103,
    2845
  ],
  "sentences": [
    "While there's no evidence the president is actually trying to \"punish\" conservative voters by spreading fentanyl, as Vance perhaps glibly suggests, the Ohio candidate is perfectly justified in his criticism of the Biden administration's handling, or lack thereof, of a crisis that has hurt residents of Vance's home state of Ohio to an outsized degree.",
    "One would think such information would be pertinent; in fact, a 2019 report by the president's Council of Economic Advisers provides estimates of purity-adjusted seizures and purity-adjusted black-market prices, illustrating how those estimates can be used to understand the effects of federal policies.",
    "The NDCS acknowledged that a crisis existsafter all, the number of predicted American deaths related to opioids reached a staggering 80,000 for the year ending in November 2021but failed to offer much hope for overall reduction in the supply of illicit opioids, which is key to reducing harm.",
    "In fact, the opioid death toll for the year ending in November 2021 is up by about 55 percent compared to the year ending in November 2019, an alarming two-year rise demonstrated in recent provisional data from the Centers for Disease Control and Prevention.",
    "The 2018 SUPPORT Act requires that the administration report the \"total amount\" and particularities of illicit drugs \"seized and disrupted in the calendar year and each of the previous 3 calendar years\" via a Drug Control Data Dashboard.",
    "That report made empty promises about seven major drug priorities, including treatment, harm-reduction efforts, prevention, employment and recovery support services, in addition to the aforementioned racial-equity concerns.",
    "The next time Vance discusses this issue with the press, he could mention that a report the White House quietly published last monththe National Drug Control Strategy (NDCS)offers one glaring example of limp leadership.",
    "Nora Kenney is deputy director of media relations at the Manhattan Institute, which will publish an issue brief (\"Fighting Fentanyl: The Biden Administration's Failure of Leadership\") on the opioid crisis this week.",
    "But unlike data for other popular drugs like cocaine and ecstasy, the current data for manufactured fentanyl and fentanyl analogues is lacking and out of datea problem not remedied in the new drug control strategy.",
    "In Ohio, long a hotbed for the opioid crisis, the problem has slowed modestly, but those same numbers still predict a 6.5 percent rise in overdose deaths between November of 2020 and the same month in 2021.",
    "Vance has made fentanyl overdosing a signature issue of his campaign, going so far as to claim, last Friday, that President Joe Biden is intentionally \"targeting\" flyover conservatives with the deadly drug.",
    "Synthetic opioids, which include fentanyl, were involved in more than 70,000 of all predicted opioid overdose deaths for the year ending in November 2021, an increase of about 90 percent in just two years.",
    "\"Racial equity\" was just one of many buzzwords that found its way into a report the White House released in April 2021 which also failed to provide a concrete strategy to reduce illicit drug supply.",
    "Apparently, the White House aims to reduce supply of fentanyl, the biggest cause of growth in recent overdose deaths, without the use of critical data about purity, price and volume.",
    "The NDCS also neglects to provide data on opioid seizures and illicit opioid pricesand does not make any commitment to greater development or disclosure of such data for the future.",
    "Vance said during an interview with Jim Hoft of Gateway Pundit, suggesting the administration's mismanagement of the southern border is a primary factor in the drug's spread.",
    "Nor does it commit the White House to a specific and measurable reduction in the supply for a future, offering only a handful of process-oriented performance \"objectives.\"",
    "Sadly, the new NDCS repeats these same shortfalls, and fails to inspire confidence that the Biden administration understands the severity or scope of the fentanyl crisis.",
    "As a Manhattan Institute issue brief forthcoming this week suggests, the NDCS does not report any measure of the reduction in the fentanyl supply over the last year.",
    "\"If you wanted to kill a bunch of MAGA voters in the middle of the heartland, how better than to target them and their kids with this deadly fentanyl?\"",
    "Without meaningful strategies and concrete goals for cutting supply, more Americans will continue to die from widespread drug overdose.",
    "But only one of those seven focused on reducing the actual supply of illicit opioids, largely entering the U.S. from Mexico and China.",
    "And unfortunately, no measures or standards for tracking the administration's effectiveness in reaching their goal were provided.",
    "When it comes to the fentanyl crisis, Vance's language may be hyperbolic, but his concerns are devastatingly appropriate.",
    "For example, the White House's NDCS is willfully ignorant of current trends in fentanyl's dissemination.",
    "Meanwhile, the White House is concerned about the racial-equity implications of the crisis.",
    "Clearly, efforts to reduce this grim toll are falling short.",
    "The views expressed in this article are the writer's own.",
    "Follow her on Twitter at @NoraKenney_.",
    "Ohio Republican Senate candidate J.D.",
    "But the NDCS falls short."
  ]
}