{
  "id": 5937,
  "mediaId": 124,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Ohio primaries to test Trumps power over the GOP base",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-05/220502-ohio-election-vance-mandel-walkup-2x1-cs-5612dc.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/ohio-primaries-test-trumps-power-gop-base-rcna26335",
  "sentiment": "0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1147,
    1801,
    2027,
    2087,
    2466,
    3103,
    4766,
    428,
    2845
  ],
  "sentences": [
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nTheres less suspense on the Democratic side of the Senate contest, where Rep. Tim Ryan is expected to claim his partys nomination, but he would head into November as an underdog in a state Democrats have struggled to win in recent years.",
    "Further down the ballot, Democrats are watching a competitive congressional primary where Rep. Shontel Brown is once again facing progressive former state Sen. Nina Turner, who led Sen. Bernie Sanders 2020 presidential campaign before entering last years special election against Brown for the Cleveland-area House.",
    "Vance, the Hillbilly Elegy? author and venture capitalist, is seen as the candidate to beat after he earned Trumps coveted endorsement, but former state Treasurer Josh Mandel and self-funding businessman Mike Gibbons have remained competitive while each claiming to be the only real conservatives in the race.",
    "Meanwhile, state Sen. Matt Dolan, whose family owns the Cleveland Guardians, has stayed relevant while running as a more traditional conservative in the mold of Portman by trying to position himself above the fray, with TV ads urging voters to ignore the nonsense? and name-calling? of his opponents.",
    "While Vance ultimately won it, Mandel, who is backed by Texas Sen. Ted Cruz and other conservatives, pitched himself in a recent ad as Pro-GOD, Pro-TRUMP, Pro-LIFE.?\nTrump himself seemed to have difficulty distinguishing the two, saying at a rally in Nebraska on Sunday that he had endorsed J.D.",
    "The race, which has been marked by ugly attacks and mutual accusations of phony fealty to Trump, is seen as a key test of the former presidents continued political strength and ability to bend his party to his will ahead of a potential 2024 presidential run.",
    "It is a politics of grievance.\nMay 2, 202208:42\nA Fox News poll released last week showed Vance at 23 percent, Mandel at 18 percent, Gibbons at 13 percent, Dolan at 11 percent and former GOP Chair Jane Timken at 6 percent  with 25 percent still undecided.",
    "WASHINGTON  Voters are heading to the polls Tuesday in Ohio, where the years second statewide primary contests will offer insights into former President Donald Trumps influence and the mood of the electorate ahead of Novembers midterm elections.",
    "The special election became a high-profile clash between the so-called Democratic establishment and the partys insurgent left wing, with each candidate spending over $3 million before Brown prevailed by about 5 percentage points.",
    "Brown is seen as stronger now, thanks to the power of incumbency and recent endorsements from both President Joe Biden and the Congressional Progressive Caucus, which Brown joined after entering Congress.",
    "Mike DeWines path to re-election was complicated after Trump and others on the right criticized him over his Covid lockdowns and for refusing to join Trumps push to overturn the 2020 election.",
    "And polls suggest the two candidates running to DeWines right, former Rep. Jim Renacci and restaurateur Joe Blystone, are splitting the anti-DeWine vote, giving the governor a consistent lead.",
    "The latest polls show no runaway leader and plenty of undecided voters after the candidates and their allies spent more than $73 million on ads, per ad tracking firm AdImpact.",
    "But, as with the Senate race, the GOP is favored to keep the governors mansion in November as Ohio, once the quintessential swing state, drifts further into the GOP column.",
    "Democrats are choosing between two former mayors, John Cranley of Cincinnati and Nan Whaley of Dayton, to go up against DeWine or whomever Republicans nominate.",
    "The marquee contest is the five-way Republican free-for-all for the Senate seat being vacated by retiring GOP Sen.",
    "But Trump never made DeWine a target like he did other Republican officials who crossed him.",
    "Mandel.?\nGet the Morning Rundown\nGet a head start on the morning's top stories.",
    "Sam Stein: GOP candidates in contortions to secure Trump endorsement.",
    "Meanwhile, both parties in Ohio have primaries for governor.",
    "Vance and Mandel openly competed for Trumps endorsement.",
    "This years race has drawn less attention.",
    "Trump won Ohio that year.",
    "Republican Gov.",
    "Rob Portman.",
    "J.D."
  ]
}