{
  "id": 5948,
  "mediaId": 129,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "What Were Watching in Tuesdays Primary Elections in Ohio and Indiana",
  "image": "https://static01.nyt.com/images/2022/05/02/multimedia/02pol-whattowatch-photo/02pol-whattowatch-photo-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/03/us/politics/ohio-indiana-primary-elections.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    1115,
    1147,
    2027,
    3103,
    380,
    571,
    2689,
    2710,
    2845
  ],
  "sentences": [
    "More so than many other contests across the nation, the Ohio Senate race to replace Rob Portman, an establishment Republican who is retiring, will test former President Donald J. Trumps influence on his party, and whether Republican voters have an appetite for hard-right, anti-establishment figures in his mold  or only for those with his seal of approval.",
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering, though this years map is poised to be surprisingly fair\nGovernors Races: Georgias contest will be at the center of the political universe, but there are several important races across the country.",
    "The rematch between Nina Turner and Shontel Brown\nRepresentative Shontel Brown narrowly defeated Nina Turner, a former state senator and a top surrogate for Bernie Sanders, in a Democratic primary last year that was seen as somewhat of a proxy battle between the partys progressive and establishment wings.",
    "A venture capitalist and the author of the best-selling 2016 memoir Hillbilly Elegy,? Mr. Vance has been heavily backed by Mr. Thiel, the Fox News host Tucker Carlson and Donald Trump Jr.\nOn the campaign trail, Mr. Vance has sought to atone for his past negative comments about Mr. Trump.",
    "Other Republican Senate hopefuls include Jane Timken, a former chairwoman of the Ohio Republican Party, who has been endorsed by Mr. Portman and has campaigned with the former Trump aide Kellyanne Conway, and Mike Gibbons, a financier who has outspent all of the candidates in the race.",
    "Major donors include the Protect Ohio Values PAC, largely funded by the billionaire Peter Thiel, who is supporting Mr. Vance, and the Buckeye Leadership Fund, which is backing Matt Dolan, a former Ohio state senator whose family owns the Cleveland Guardians baseball team.",
    "Success for Mr. Ryan in the fall could carry lessons for Democrats across the Midwest on how to counter the appeal of Trumpism and the erosion of support for the party among the white working-class  voters who once formed a loyal part of the Democratic base.",
    "North of Indianapolis, in Hamilton County, the re-election campaign of the prosecutor D. Lee Buckingham against Greg Garrison, a conservative talk-show host, is garnering outsize attention: Mr. Buckingham has the support of former Vice President Mike Pence.",
    "This year, more incumbents at the state level are facing primary challengers from the right than in at least a decade, according to a review by The Indianapolis Star, potentially resulting in an even more conservative legislative supermajority.",
    "The race attracted big Democratic names and millions of dollars, with Ms. Brown, then a Cuyahoga County councilwoman, drawing support from Hillary Clinton and the highest-ranking Black member of the House, James E. Clyburn of South Carolina.",
    "Mr. Ryan has been visiting with voters across the state in a bet that they have had enough of the extremism in American politics and might be willing to elect a Democrat to a seat formerly held by a Republican.",
    "In the Democratic primary, two former mayors  John Cranley of Cincinnati and Nan Whaley of Dayton  are facing off, with Ms. Whaley seeking to become the first woman elected governor in the state.",
    "Once considered a national bellwether in the industrial heart of the country, Ohio has tilted Republican in the last two presidential elections, and Republicans control all levels of government.",
    "Senate candidates from both parties have been aggressively courting the white working-class voters who have left the Democratic Party in droves since Mr. Trump was first on the ballot in 2016.",
    "Ms. Turner previously was attacked for taking anti-Israel positions  and for using language that some said echoed anti-Semitic tropes  as well as for a crass denunciation of President Biden.",
    "group has put its support behind Josh Mandel, a former Ohio state treasurer, who went from reluctant Trump supporter in 2016 to one of the nations most ardent backers of Trumpism.",
    "He is seeking to appeal to the exhausted majority,? a phrase coined by researchers to describe the estimated two-thirds of voters who are less polarized and who feel overlooked.",
    "He faces a challenge from the left by Morgan Harper, a progressive lawyer and a senior adviser at the Consumer Financial Protection Bureau under former President Barack Obama.",
    "And in last-hour negotiations, elections officials took all of the statehouse races off the May 3 primary ballot, leaving them to be decided at a later date.",
    "It will be interesting to see if such an electorate manifests itself in Ohio  and if it goes for Mr. Ryan or for Mr. Dolan on the other side of the aisle.",
    "She has the ground-game support of Our Revolution, a progressive political action organization that emerged from Mr. Sanderss 2016 presidential campaign.",
    "The former congressman Jim Renacci is one of several Republican candidates who are trying to seize on their partys internal divisions to unseat G.O.P.",
    "Cash has poured into the race  from major super PACs and from candidates personal coffers  making it one of the most expensive of this election cycle.",
    "He has at times been at the top of the polls with a sales pitch similar to Mr. Trumps, reminding audiences he is not a politician but a businessman.",
    "The only Republican running in this lonely lane has been Mr. Dolan, who says he supports Mr. Trump but has made him less of a focus in the campaign.",
    "Trumps role as kingmaker\nMr. Trump rocked the Senate race landscape in Ohio last month when he threw his highly coveted endorsement behind J.D.",
    "But all eyes remain on the state, with one marquee matchup at the top of the list: the crowded, heated and expensive Republican Senate primary.",
    "The two were vying for a seat vacated by Marcia L. Fudge after President Biden appointed her as the secretary of housing and urban development.",
    "David McIntoshs anti-tax Club for Growth, which had first opposed Mr. Trumps 2016 before supporting him, is pitching for a battle.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycles defining topics.",
    "The groups 150 volunteers have centered on building support for Ms. Turner through one-on-one conversations with voters.",
    "Mike DeWine, a longtime Ohio politician who has been working to attract the support of Mr. Trumps most loyal supporters.",
    "A heated and confusing legal battle over the redrawing of congressional districts kept voters waiting for a final map.",
    "This year, major establishment figures have once more endorsed Ms. Brown, including President Biden and Mr. Clyburn.",
    "Indianas primary also features some notable elections with implications for the direction of the Republican Party.",
    "The results could also give Democrats a better idea of their chances to secure the open seat in November.",
    "Unlike the top candidates in the race, he recognizes President Biden as the nations legitimate leader.",
    "On the Democratic side of the Senate race, Representative Tim Ryan is considered the front-runner.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "Polls have shown a significant bump for Mr. Vance, but no clear front-runner has emerged.",
    "Still, Ohio voters might decide they do not want a Trump-centered candidate at all.",
    "She now also has the backing of the Congressional Progressive Caucus PAC.",
    "See the full primary calendar and a detailed state-by-state breakdown.",
    "But Mr. Renacci seems to be gaining little traction against Gov.",
    "Ohios primary elections almost werent going to happen Tuesday.",
    "This time around, she has aggressively courted Jewish voters.",
    "Midterms Begin: The 2022 election season is underway.",
    "The campaign has been at times contentious and ugly.",
    "Will Ohio have a shot at a female governor?",
    "Here are the four incumbents most at risk.",
    "Is there an exhausted majority?",
    "It has also been high-priced.",
    "The G.O.P.",
    "governors.",
    "Vance."
  ]
}