{
  "id": 5969,
  "mediaId": 19,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Trump-Backed J.D. Vance Projected Winner of Ohios Republican Senate Primary",
  "image": "https://media.breitbart.com/media/2022/04/AP21183828334156-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/03/trump-backed-j-d-vance-projected-winner-of-ohios-republican-senate-primary/",
  "sentiment": "0.81",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    946,
    1147,
    1801,
    2027,
    3103,
    380,
    428,
    571,
    2845
  ],
  "sentences": [
    " pic.twitter.com/0IYf0aCJxb\n Election Wizard gg (@ElectionWiz) May 4, 2022\nHis surge to victory came weeks after former President Trump endorsed the national populist in the Senate primary race, deeming Vance the most likely to take out the weak, but dangerous, Democrat opponent.?\nTrump expressed confidence that Vance will destroy him in the debates and will fight for the MAGA Movement in the Senate.?\nHes strong on the Border, tough on Crime, understands how to use Taxes and Tariffs to hold China accountable, will fight to break up Big Tech, and has been a warrior on the Rigged and Stolen Presidential Election,? Trump added in his endorsement.",
    "Vance rose to the top of the GOP primary in recent weeks, besting his closest competitors, never-Trump Ohio Senate candidate Matt Dolan and Ohio state treasurer Josh Mandel:\nDecision Desk HQ projects J.D Vance (@JDVance1) has won the OH GOP Senate Nomination\nRace Call At: May 3rd 9:09pm edt\nMore results here: https://t.co/MOUZI5gypR\n Decision Desk HQ (@DecisionDeskHQ) May 4, 2022\nI've seen enough: J.D.",
    "Vance spoke to Breitbart News Saturday following the endorsement, calling it hugely important and powerful? and noting that Trumps support served as an incredible boost for us coming down the stretch.?\nTrump sees me as a guy who actually carries on his agenda,? Vance said.",
    "His Democrat challenger, by contrast, is now calling for the end of the filibuster rule, as members of the far left seek to codify Roe into law to protect abortion  a contentious subject that will surely become a centerpiece in the general election.",
    "Vances purported victory serves as another blow to the GOP establishment heading into the midterms, as he will now face off against Democrat Rep. Tim Ryan (D-OH), who won his partys primary Tuesday night.",
    "Indeed, following the endorsement, Vance surged in the polls, with the final RealClearPolitics average showing Vance leading the pack by an average of 3.5 percent.",
    "Vance is the projected winner of the Republican Senate primary in Ohio, marking a major victory for former President Trump and the America First agenda.",
    "The fact that things like this are leaking suggests the elites of the left dont care about norms or anything else besides winning.",
    "Vance (R) wins the Republican nomination for #OHSEN and will face Tim Ryan (D) in the fall.",
    "More recently, Vance said it would be an amazing victory? for the.",
    "They have declared full scale culture war on multiple fronts.",
    "Conservatives should wake up to this new reality,? he warned.",
    " Dave Wasserman (@Redistrict) May 4, 2022\nBREAKING: J.D.",
    "Vance projected to win GOP nomination for Ohio Senate.",
    "U.S if the Supreme Court overturns Roe v. Wade.",
    "J.D."
  ]
}