{
  "id": 5973,
  "mediaId": 98,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Trumps endorsement of Hillbilly Elegy writer tested his power in the GOP",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/39286d0/2147483647/strip/true/crop/3600x2400+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1f%2Fa4%2F09e6b6094da1950ac82dbac5a369%2Feeuu-2022-trump-suma-o-resta-60520.jpg",
  "link": "https://www.latimes.com/politics/story/2022-05-03/ohio-primary-tested-trumps-endorsement-power-heres-what-to-know",
  "sentiment": "-0.487",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melanie MasonStaff Writer",
  "authorUrl": "https://www.latimes.com/people/melanie-mason",
  "termIds": [
    781,
    946,
    1147,
    1801,
    2027,
    3103,
    4179,
    428,
    2845
  ],
  "sentences": [
    "A native of the Mahoning Valley, one of the regions hardest hit by the decline in the manufacturing industry, Ryan is hoping a blue-collar campaign that promises tough action on China and a rejection of his partys most progressive policies will help him overcome the odds.",
    "Now, the authors win will add another notch to Trumps tally of winners hes endorsed  a favorite metric of his  and more broadly, reinforce that his influence remains strong in a state he won handily in both 2016 and 2020.",
    "[In] fact, if I went by that standard, I dont think I would have ever endorsed anybody in the country.?\nTrumps backing undercut the key message from Vances opponents  that he was a traitor to the Trump movement.",
    "Conservative groups such as Club for Growth spent millions to attack Vance on the airwaves, accusing him of disloyalty, only to find themselves crosswise with the president they were purporting to defend.",
    "A victory for Vance\nVance, a venture capitalist, was once a vocal Trump critic who later recanted those views and adopted Trumps policy positions and pugnacious personality on the campaign trail.",
    "Mike DeWine fended off challenges from three Trump-supporting candidates running to his right and is set to face Nan Whaley, the Democratic former mayor of Dayton, in the general election.",
    "Mandel was also caught up in one of the most contentious moments of an unusually heated campaign  a debate stage confrontation with businessman Mike Gibbons that nearly led to blows.",
    "Their decision to change the teams name from the Indians to the Guardians earned scorn from Trump, who said anyone supporting such a rebranding is not fit to serve? in the Senate.",
    "The runners-up\nJosh Mandel, formerly the states treasurer, and state Sen. Matt Dolan were in second and third place, respectively, with votes still being counted.",
    "Vance, whose memoir, Hillbilly Elegy,? was made into a movie, scored the former presidents coveted backing, winning out over a crowded field of Trump acolytes.",
    "Trumps decision to endorse Vance was a blow to Mandel, who had actively courted Trump and his voters, promising he would be a loyal acolyte in the Senate.",
    "The endorsement immediately propelled Vance to the front of the pack, illustrating the continuing sway Trump commands among party faithful.",
    "Indiana also held a primary Tuesday, with Republican challengers in legislative races aiming to push the statehouse further to the right.",
    "Publicly, Trumps displeasure with Dolan stems from sports  specifically, Clevelands major league baseball club, which Dolans family owns.",
    "As such, the results of Tuesdays primary are now closely watched as a predictor of former President Trumps grip on the Republican Party.",
    "The conversion apparently won over the former president, who held an Ohio rally featuring Vance soon after issuing his endorsement.",
    "Ryan, who mounted a short-lived presidential campaign in 2020, faces an uphill battle in his increasingly red home state.",
    "Vance had struggled in the polls, prompting his rivals to mount a last-ditch attempt to deter Trump from weighing in.",
    "Once a swing-state and bellwether for Americas presidential picks, Ohio now tilts more solidly toward Republicans.",
    "Dolan, who only recently surged in the polls, had represented a greater threat to Trumps influence over the GOP.",
    "Rep. Tim Ryan wins Democratic primary\nVance will now take on the Democratic nominee, Rep. Tim Ryan.",
    "Hes a guy that said some bad sh about me  he did,? Trump said at an April rally in Delaware, Ohio.",
    "Dolan was the sleeper in this race, catching little flak while his rivals tore into one another.",
    "Vance claiming victory in the GOP Senate primary, signs are that Trumps hold is strong as ever.",
    "Once again, the eyes of a nation  or at least those of its political junkies  are on Ohio.",
    "Other primaries Tuesday included the race for Ohio governor, where GOP incumbent Gov.",
    "But the endorsement provided a clear jolt to Vances standing.",
    "Times staff writer Seema Mehta contributed to this report.",
    "But he had one important detractor: Trump.",
    "Every one of the others did also.",
    "Heres what you need to know.",
    "But, you know what?",
    "And with J.D."
  ]
}