{
  "id": 5992,
  "mediaId": 195,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Vance waves off Trump fumbling his name: Im not worried about it at all",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/MR_trumpdonald-vancejd_042422_ap-joe-maiorana.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3474330-vance-waves-off-trump-fumbling-his-name-im-not-worried-about-it-at-all/",
  "sentiment": "-0.643",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    946,
    1054,
    1147,
    1801,
    2495,
    3103,
    4105,
    428,
    571,
    2816,
    2845
  ],
  "sentences": [
    "He is our best chance for victory in what could be a very tough race.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Vance on Monday brushed off former President Trump mixing up his name at a rally over the weekend, saying it was understandable Trump would sometimes misspeak on the campaign trail.",
    "Ohios Republican Senate primary, which is taking place on Tuesday, had largely been a race for Trumps backing until the former president announced last month he was endorsing Vance.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,? Trump said in a statement after he endorsed him.",
    "And lets see what happens.?\nMike Gibbons, who is also running in the GOP primary, pounced on Trumps fumble in a statement released shortly after the rally.",
    "Even after his endorsement, JD Vance is clearly irrelevant to President Trump, so much so he botched Vances name at his rally today in Nebraska.",
    "When the former president brought up the candidates he endorsed, he mixed up Vance and fellow Ohio GOP Senate candidate Josh Mandel.",
    "Trump fumbled Vances name at a campaign rally for Nebraska Republican gubernatorial candidate Charles Herbster on Saturday.",
    "Everybodys going to do that.?\nVance added Trump is hosting a tele-town hall in Ohio for his campaign on Monday evening.",
    "Vances opponents frequently bring up his past criticism of Trump during Trumps 2016 presidential bid.",
    "He gives, what, thousands of words of speeches every single week,? Vance told CBS News.",
    "The former president has appeared to move past Vances past criticism publicly.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Quite the ringing endorsement, eh?? Gibbons asked.",
    "So Im not worried about it at all,? Vance said.",
    "Ohio Republican Senate candidate J.D.",
    "Theyre all doing good,? Trump said.",
    "Sometimes hes going to misspeak.",
    "Mandel, and hes doing great.",
    "Weve endorsed J.P.  right?",
    "Like some others, J.D.",
    "J.D."
  ]
}