{
  "id": 5999,
  "mediaId": 136,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Matt Dolan Gains Ground Ahead of Ohio Primary in Threat to Trump's Power",
  "image": "https://d.newsweek.com/en/full/2029245/matt-dolan-surges-ohio-gop-primary.webp?w=790&f=4ba10d3434979fa0883cf972d30e322a",
  "link": "https://www.newsweek.com/ohio-senate-republican-primary-matt-dolan-jd-vance-donald-trump-endorsement-1702599",
  "sentiment": "-0.695",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    781,
    946,
    1147,
    1801,
    2027,
    3103,
    428,
    2536,
    2614,
    2845
  ],
  "sentences": [
    "Meanwhile, Representative Tim Ryan, who represents a district containing Youngstown and parts of Akron, appears to be the favorite to win the Democratic primary and will likely face off against the GOP primary winner.",
    "During a debate in March, Dolan was the only candidate who said it was time for Trump to move on from the 2020 presidential election, which the former president claims was stolen despite a lack of evidence.",
    "He notably polled well among Republican voters who said Trump's endorsement makes them less likely to support a candidate, as he received support from 56 percent of those voters.",
    "This indicates that if Dolan continues to make gains among undecided voters, as well as Trump-skeptical Republicans, he could continue to gain more ground on Vance.",
    "However, when undecided Republican voters were asked who they were leaning toward, Vance's lead narrowed to five points over Dolan, at 26 percent to 21 percent.",
    "Vance, as well as against Josh Mandel, a former state treasurer who has aligned himself with former President Donald Trump's wing of the Republican Party.",
    "His Vance endorsement did, however, draw criticism from some Trump supporters over Vance's previous comments condemning the former president.",
    "Dolan, unlike other candidates in the race, did not vie for the endorsement of the former president, opting not to run a nationalized race.",
    "Ohio state Senator Matt Dolan, a Republican candidate for U.S. Senate, is surging in the days leading up to the state's primary elections.",
    "Should he eke out a surprise victory in the primary, set to take place on Tuesday, his win could threaten Trump's power over the GOP.",
    "Whoever wins the Republican primary will be considered the favorite in the general election, as Ohio has trended red in recent years.",
    "Dolan, who represents the suburbs near Cleveland in the state Senate, has seen a significant jump in support in the past few months.",
    "Vance still receives the most support, winning 24 percent, while Dolan is in third place with 18 percent, according to the poll.",
    "The Cook Political Report classifies the race as \"leans Republican,\" meaning it is competitive, but the GOP has an advantage.",
    "The Emerson College poll, released over the weekend, showed Dolan climbing in his support from Ohio's Republican voters.",
    "He has also been critical of Trump's claims of widespread election fraud during the 2020 presidential election.",
    "The recent Emerson College poll found that Trump's endorsement of Vance compelled Trump voters to back him.",
    "Sixty-three percent of Vance's supporters said Trump's endorsement made them more likely to vote for him.",
    "A February poll from Emerson College showed him only garnering support from 6 percent of Ohio voters.",
    "Trump, in a statement last Tuesday, wrote Dolan \"is not fit to serve in the United States Senate.\"",
    "A new Emerson College poll shows Dolan gaining ground against Trump-endorsed J.D.",
    "\"Elections are a state issue,\" Dolan said, local news station WDTN reported.",
    "There have been two audits done and it showed that it had no problems.\"",
    "Newsweek reached out to the Dolan campaign for comment.",
    "Trump won the state by about eight points in 2020.",
    "Mandel remained in second place at 24 percent.",
    "Mandel is in second place with 22 percent.",
    "\"In Ohio, we have very secure elections."
  ]
}