{
  "id": 6062,
  "mediaId": 129,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "In Trumps Shadow, Ohio Republicans Campaign Ahead of Tuesdays Primary.",
  "image": "https://static01.nyt.com/images/2022/05/01/us/01pol-ohio-1/01pol-ohio-1-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/01/us/politics/josh-mandel-vance-ohio-senate.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1115,
    1147,
    1801,
    2027,
    2466,
    3103,
    428,
    2623,
    2845
  ],
  "sentences": [
    "He castigated both parties for free trade agreements that he said had sent Ohio manufacturing to Mexico and China, for the bipartisan decision to allow American Wall Street firms to get rich off the growth of China and not off the growth of the American middle class.? He also accused financial firms of allowing the Chinese into this country, buying up our farmland, buying up our single-family homes, making it impossible for young families to buy a home, to own a stake in their own country.?\nThat is the game they play, and Im running for the U.S. Senate to go and play a different game, a game where we put our citizens and the people in this room first,? he said to cheers.",
    "The crowd of about 75 in the bar and restaurant of a well-manicured country club had been warmed up by Mr. Gaetz and Ms. Greene, who ticked through the talking points of the fringe right: medical tyranny,? open borders,? gender pediatric clinics? turning boys into girls, men in womens bathrooms and womens sports, The Walt Disney Company grooming? children into homosexuals and transgender people.",
    "I was shocked,? Mr. Gibbons said of Mr. Trumps endorsement of Mr. Vance, referring to his opponent as someone who flew in from the West Coast.? He added: Ohioans should be insulted.?\nOutside, a couple of volunteers mingled in a grocery store parking lot near Columbus, picking up Gibbons swag and eating pizza, before fanning out to knock on doors.",
    "One pastor present, Dan Wolvin, said he felt sorry? for Mr. Trump over the Vance endorsement, saying he was listening to the wrong people.? Still, Mr. Wolvin predicted the Trump nod would gain Mr. Vance about five points? on Election Day, while conceding, its a lot for Josh to make up.?\nSpurned or not, Mr. Mandel was still flying the Trump flag.",
    "The people in that room  just off a verdant golf course, far away from the illegal immigrant, drug-infested cities that Mr. Vance speaks of on the stump  were hardly the down-and-out white workers central to his memoir, Hillbilly Elegy.? But an unspoken truth is, his audience is the true core of the pro-Trump vote in Ohio.",
    "But on Jan. 6, Mr. Dolan did not shy away from criticizing Mr. Trump for spreading lies about the results of the November 2020 election, writing on Twitter, Real leaders lead not manipulate.? Unlike the other leading Republican candidates in the race, he also acknowledges President Biden is the nations legitimate leader.",
    "At a Baptist church in Columbus on Saturday, Mr. Mandel took aim at popular targets of the right, including transgender people, Republicans with jelly knees? like Senator Mitt Romney of Utah and the liberal media in the back of the room? (just minutes after greeting reporters amicably by name in a private room).",
    "He added for emphasis, Im not going to disavow them because some scumbag who doesnt have the best interest of Ohio at heart wants me to.?\nMike Gibbons in Dublin, Ohio\nMr. Gibbons likes to sport a navy blue suit coat and red tie reminiscent of Mr. Trump.",
    "Mr. Vance, who had been trailing in polls and running low on money, has seen a surge in donations and support since Mr. Trumps embrace, as the first major Senate midterm primary election entered its final weekend before Tuesdays voting.",
    "Ms. Timken has solid Trump-era credentials  she chaired the state party while Mr. Trump was in office  but she does not mimic the former presidents aggrieved style, which has been a key to unlocking the most fervent Republican voters.",
    "To longtime acquaintances and observers of Mr. Mandel, 44, who early in his career promoted civility and bipartisanship, his unrequited embrace of Trumpism and divisiveness suggested there was a price on political calculation.",
    "But imitation did not win Mr. Gibbons the endorsement of the former president he so sought to emulate, and he is closing out the final stretch of the primary much the way he started: with his own gumption and personal wealth.",
    "So, Mr. Mandel said of Black Lives Matter activists, They are the racists, not us.? He stirred animosity toward migrants, including refugees from Afghanistan, and falsely claimed the 2020 election was stolen from Mr. Trump.",
    "I like that he is from Parma, Ohio  real down-to-earth kind of guy who worked hard for everything he has in life and earned his way,? said Michael Palcisko, 54, a schoolteacher and military veteran in Cleveland.",
    "COLUMBUS, Ohio  Josh Mandels wager was simple: No one would outflank him in mirroring Donald J. Trump, either on hard-right America First positions or the bellicose, come-at-me style of the former president.",
    "Vance, the author and venture capitalist, bounded onto the stage at the Trout Club in Newark, Ohio, with the confidence of the nominal front-runner, a status bestowed by Mr. Trumps endorsement on April 15.",
    "He said he voted for Mr. Trump in the last presidential election, opposed both impeachment cases against him and has said he would support the former president should he become the 2024 Republican nominee.",
    "The Jewish grandson of a Holocaust survivor whose website features a Christian cross, Mr. Mandel stumped mostly in evangelical churches, claiming theres no such thing? as separation of church and state.",
    "He drew some scrutiny in March for comments he made in 2013 on China and Asian people that used offensive stereotypes and was later criticized for the heated debate stage encounter with Mr. Mandel.",
    "But in one crucial way, his supporters say, his path has sharply diverged from Mr. Trumps: Mr. Gibbons did not receive a multimillion-dollar loan from his father to launch his business empire.",
    "All I have to do to become the nominee is to become the most like Trump.?\nThe candidate most left on the sidelines since Mr. Trumps nod at Mr. Vance, according to polls, has been Jane Timken.",
    "There is nothing more disgusting in politics than the way that leadership asks you to stab your friends in the back,? he said before heading with them to West Chester, outside Cincinnati.",
    "But two weeks ago, the one person he sought most to impress  the former president himself  spurned Mr. Mandel, a former state treasurer, and bestowed his coveted endorsement on J.D.",
    "And around the state, Republicans including Mr. Mandel; Mr. Vance; Mike Gibbons, a self-funded businessman; and State Senator Matt Dolan fanned out in a preview of national G.O.P.",
    "From the beginning, Mr. Dolan, who has served in the statehouse since 2017 and whose family owns the Cleveland Guardians baseball team, has been walking in his own lonely lane.",
    "And he speaks often of how, in 1989, he started his investment banking and financial advisory firm in a small Cleveland office with nothing but a desk and a phone.",
    "Mr. Vance breezed through some of the same themes, but he appeared more intent on previewing the larger issues he planned to argue in the general election to come.",
    "He ran unsuccessfully for the Senate in 2018, and this time has pumped roughly $17 million into his campaign, making him the largest self-funder in the race.",
    "I see the desperation there these last few months,? said Matt Cox, a former Republican operative who was an early adviser to Mr. Mandel before a falling-out.",
    "Mr. Vance was asked by a reporter why he invited Ms. Greene and Mr. Gaetz to barnstorm through Ohio with him on the closing weekend of the primary campaign.",
    "He predicted the former president would return to the White House, and I look forward to working with him.?\nThe candidates, to varying degrees, all concur.",
    "In an interview on his campaign bus Saturday, Mr. Gibbons emphasized his lifelong Ohio roots and business credentials as the best fit for Ohio voters.",
    "Standing at his front door, Ryan, who considers himself a Democrat, said he planned to vote in the Republican primary this year because of Mr. Dolan.",
    "Mr. Mandel hopscotched across the states big cities  Toledo, Columbus and Cincinnati  with a conservative ally of his own, Senator Ted Cruz of Texas.",
    "If it has to be a Republican, I hope it is you,? Rich Evans, 69, a retired educator, told him, as he stopped manicuring his lawn to shake hands.",
    "Matt Dolan in North Royalton, Ohio\nOn an overcast Saturday morning, Mr. Dolan knocked on doors in an affluent suburb just south of Cleveland.",
    "He was making a last-minute push to get voters to the polls, and on his target list were registered Republicans who had yet to cast a ballot.",
    "Like the other Republicans in the race, he said he wants to secure the border, cut the flow of fentanyl into the state and tackle inflation.",
    "But he also said he could do more than his competitors to bring workers to the state and put together a unique economic development agenda.",
    "But on his route, he was just as likely to encounter Democrats and independents who were backing his candidacy  or simply cheering him on.",
    "She has set herself apart from rivals who she says seek every day to get themselves canceled on Twitter? with their statements and antics.",
    "The only woman running, Ms. Timken was endorsed by Ohios retiring senator, Rob Portman, a center-right throwback to an earlier Ohio G.O.P.",
    "Fitting the setting, the largely older crowd in the pews called out encouraging amens!? or groaned audibly when Mr. Mandel named enemies.",
    "On Saturday, Mr. Vance campaigned with two far-right members of Congress, Marjorie Taylor Greene of Georgia and Matt Gaetz of Florida.",
    "The reason that were going to win on Tuesday is because we have this army of Christian warriors throughout the state, he pledged.",
    "He is the only Republican candidate who supports Mr. Trump but has attempted to put some distance between himself and Mr. Trump.",
    "The one income group that President Biden won in this state in 2020 was that of voters who earn less than $50,000.",
    "Thats in the DNA in Ohio,? said Representative Tim Ryan, the likely Democratic nominee for the coming Senate race.",
    "He wanted to get back to discussing policy, and he certainly did not want to re-litigate the last election.",
    "Mr. Mandel was the presumed front-runner in the crowded Republican field for U.S. senator from Ohio.",
    "He was a one-time professional football player, and at 37, he founded Brown Gibbons Lang & Company.",
    "In a debate in March, Mr. Mandel nearly got into a physical confrontation with Mr. Gibbons.",
    "But economic themes in general  and the China threat in particular  resonated.",
    "He has a habit of reminding voters that he is a businessman, not a politician.",
    "Mr. Gibbons grew up in Parma, a working-class suburb outside of Cleveland.",
    "I think his strategy was: All right, Trump won Ohio by eight points twice.",
    "I support him today, and Ill continue to support him tomorrow,? he said.",
    "who voted with Senate Democrats for the bipartisan infrastructure bill.",
    "Here are snapshots from around Ohio in the last weekend of campaigning.",
    "I looked at all the candidates, and hes the most honest one,? he said.",
    "Mr. Gibbons served as Mr. Trumps Ohio fundraising co-chair in 2016.",
    "But he said he wanted his own campaign to remain focused on Ohio.",
    "Vance, the Hillbilly Elegy? author, remaking the race overnight.",
    "Mr. Trump did a lot of good things for Ohio,? Mr. Dolan said.",
    "politics to come  different moons circling Mr. Trumps sun.",
    "It was a stance that Pat Ryan, 64, said he respected.",
    "More affluent voters went for Mr. Trump.",
    "I supported President Trump yesterday.",
    "I am not looking backwards,? he said.",
    "Hes hardly a never Trumper.",
    "For a long time, it worked.",
    "Vance in Newark, Ohio\nJ.D.",
    "J.D."
  ]
}