{
  "id": 6071,
  "mediaId": 65,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "JD Vance: Will there be America-first Republicans or 'same old' Republicans in Congress after midterms?",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/19075388-de15-44c6-9bed-f6d9b23ae8d6/d780c03a-13cd-483c-8355-ef893ef4b049/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/jd-vance-america-first-republicans-same-old-republicans-congress-2022",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fox News Staff",
  "authorUrl": "https://www.foxnews.com/person/s/fox-news-staff",
  "termIds": [
    1801,
    2087,
    3103,
    380,
    428,
    545,
    2945
  ],
  "sentences": [
    "An America-first government, an America-first Republican Congress, or the same old thing that just sits on its hands and doesn't do anything to fight back against the radicalism of the Left.",
    "Because are we going to send establishmentarian Republicans, are we going to send people who are actually going to push for stronger trade policies and for a reasonable foreign policy?",
    "I can't tell whether to be angry at it or sad for  a guy who clearly doesn't seem to be totally with it, but his administration is filled with radicals.",
    "We're in store for a really good year as Republicans, which, by the way, is why Republican primaries like mine are so important.",
    "VANCE: I'm really shaking in my boots that Joe Biden, who doesn't know where he is half the time, is going to come after me.",
    "Vance clarified the choice awaiting Republican voters in the midterm elections on \"The Ingraham Angle\" Friday.",
    "We're going to get a Republican Congress; Joe Biden's mismanagement, his terrible governance has ensured that.",
    "But I really think a big question is, what kind of a Republican government are we going to get in 2022?",
    "But it is extraordinary what's happening in the Biden administration.",
    "That really is the question, I think.",
    "That to me is the big question.",
    "WATCH THE FULL INTERVIEW BELOW:",
    "Ohio Senate candidate J.D.",
    "It's weird too.",
    "J.D."
  ]
}