{
  "id": 6111,
  "mediaId": 157,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Trump decided to endorse JD Vance after hearing rumor of rival conservative's 'disgusting' sex life: report",
  "image": "https://www.rawstory.com/media-library/donald-trump-points-and-shouts-at-what-he-calls-the-dishonest-media-during-a-speech-shutterstock-com.jpg?id=29693112&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/trump-ohio-senate-2657227473/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    683,
    946,
    1147,
    1801,
    2215,
    3103,
    200,
    2845
  ],
  "sentences": [
    "\"Trump had already displayed a long, abiding interest in Mandels own sex life, having already spent months privately regurgitating and spreading salacious, unverified rumors that hes heard about 'f*cking weird' Mandels supposed debauched ongoings,\" writes Rolling Stone.",
    "\"During that phone call, the twice-impeached former president spent a notable amount of time gossiping and laughing about the prominent Republicans penis and how 'f*cking disgusting' and 'f*cking gross' he allegedly was.\"",
    "Trump had just gotten off of a call with McIntosh before speaking with Carlson, and he decided afterward that he didn't want to hear anything from the Club for Growth president about the Ohio Senate race.",
    "Multiple sources tell Rolling Stone that it was Fox News host Tucker Carlson who spilled the dirt to Trump about McIntosh as evidence that Trump shouldn't trust him.",
    "Vance after hearing lurid rumors about David McIntosh, the president of the conservative Club for Growth who is backing Vance rival Josh Mandel.",
    "A new report from Rolling Stone claims that former President Donald Trump decided to endorse Ohio Senate hopeful J.D.",
    "Additionally, reports Rolling Stone, Trump also suspected that there was something wrong with Mandel's sexual habits.",
    "\"Carlson asserted... that McIntosh has an embarrassing and 'chronic' personal sexual habit,\" the publication writes.",
    "\"Carlsons comments about the proclivities of Mandels patron threw both Trump and his son into fits of laughter.\"",
    "Shortly afterward, he publicly endorsed Vance."
  ]
}