{
  "id": 6138,
  "mediaId": 157,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Republican candidates left reeling after Club for Growth chief gets cast out of Trump World: report",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29732410&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/trump-war-with-club-for-growth/",
  "sentiment": "-0.463",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Evans",
  "authorUrl": "https://www.rawstory.com/u/timothyevans",
  "termIds": [
    946,
    1053,
    1115,
    1147,
    1801,
    1839,
    2215,
    3103,
    105,
    428
  ],
  "sentences": [
    "In his opinion, the Club's \"globalist elitist agenda that is night to the day of ... Donald Trump and the MAGA movement,\"\nAnother person close to Trump, who requested anonymity to speak candidly to CNN, said the group's firm resistance to protectionist trade and industrial policies doesn't align with the MAGA platform.",
    "IN OTHER NEWS: Ted Cruz rages at Biden nominee for refusing to say if anti-gay Family Research Council is equivalent to the KKK\nBut former White House senior adviser and right-wing podcaster Steve Bannon sees no reason for Trump to reach out to McIntosh and his Club for Growth.",
    "Trump had his assistant send McIntosh a text saying, \\u201cGo f*^% yourself.\\u201d\n Maggie Haberman (@Maggie Haberman) 1650569014\nNot surprisingly, the two men haven't spoken since, according to a person close to Trump who spoke with CNN.",
    "People familiar with the situation told CNN the Club for Growth is trying to deal with frustrated board members and donors who are concerned it will slip into irrelevance if it doesn't repair relations with Trump.",
    "And on Wednesday, the Club launched a new ad again targeting Vance for his past criticism of Trump and highlighting Trump's past endorsement of Mitt Romney's 2018 Senate campaign in Utah.",
    "Last week, however, that relationship dissolved when McIntosh and his Club for Growth refused to call a halt to its negative ad campaign against Trump-endorsed GOP Senate candidate J.D.",
    "If you just go down the list of any policy that is at the core of Trump's economic plan -- except for corporate tax cuts -- they oppose it,\" said Bannon.",
    "McIntosh's group supports former Ohio state treasurer Josh Mandel in the GOP primary for the seat being vacated by Sen.",
    "In OHSEN, Trump had expected McIntosh from the Club for Growth to stop supporting Mandel after Trump backed Vance.",
    "However, \"McIntosh's swift exile from Trump World has now left some Republican candidates reeling,\" CNN reported.",
    "\"The Club for Growth is the single most destructive force among these outside groups in Republican politics.",
    "On April 9, former President Donald Trump could not have been more effusive in his praise of David McIntosh.",
    "In fact, the Club for Growth has turned up its volume with new ads pillorying the \"Hillbilly Elegy\" author.",
    "Through an intermediary on Twitter, the former president told the candidate to \"Go f--- yourself.\"",
    "McIntosh tossed the platitudes right back at the former president, saying, \"You are a great man.",
    "At a rally that day in North Carolina, Trump said of the Club for Growth head: \"He's a winner.",
    "\"Trump has been fooled by McIntosh, and I think he's realizing that,\" this person said.",
    "The Club aired a new spot today featuring Vance quotes criticizing Trump in the past.",
    "Donald Trump, Jr. has publicly attacked McIntosh for backing Mandel in the primary.",
    "Trump's response to McIntosh's refusal to tow the Trump party line was classic.",
    "Rob Portman, who is retiring from Congress.",
    "We are undefeated when we work together.\"",
    "I am proud to partner with you.\"",
    "Vance, according to CNN.",
    "He's a fighter."
  ]
}