{
  "id": 6171,
  "mediaId": 165,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Trump Squeezes In J.D. Vance Endorsement Between Rants About Water Pressure in Ohio",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/AP22114026137231.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-news/ohio-election-trump-voters-jd-vance-1342287/",
  "sentiment": "0",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Crosbie",
  "authorUrl": "",
  "termIds": [
    946,
    1054,
    1147,
    3103,
    4274,
    2643,
    2845,
    2945,
    5089
  ],
  "sentences": [
    "The vibes at a Trump rally are equal parts music festival and sporting event with a dash of church service thrown in: Thousands of garishly-dressed fans tromping through a swampy grass field, standing in massive lines for $16 brisket sandwiches at food trucks, weaving through mazes of metal fencing under the watchful eye of impossibly-buff security guards in inconceivably-tight polo shirts, while a smattering of Vance campaign ads, trailers for Dinesh DSouzas new voter fraud documentary, and sizzle reels on traitorous RINOs blast out of speakers at an ear-jostling volume.",
    "Vance ended his speech with an emphatic statement, telling the crowd that if they send him to Washington, I will not serve the donors of the Republican Party, and I will not serve the Big Tech Execs!? which is a very bold thing to say when your campaigns biggest Super PAC is exclusively bankrolled by a big tech exec.",
    "is supported by me,? Trump says later in his speech.After the not-exactly-glowing introduction, Vance comes back onstage and stumps again, before handing the mic back to Trump so he can repeat the process with a few Trump-approved House candidates and send the whole rally off with shout outs and thank yous.",
    "and everybody is going to be fighting on that.?\nThere are cheers, but the crowd is obviously a bit confused because even among this group I dont think anyone was expecting The Democrats will turn off your sinks? to be a problem theyd have to grapple with tonight.",
    "Most of this is white noise at this point, but theres a particularly ugly moment when Trump bellows no teacher should ever be allowed to teach transgender  trans gender  to our children without parental consent,? and the crowd erupts in a Save Our Kids? chant.",
    "The president is right  I wasnt always nice, but the simple fact is hes the best president of my lifetime, and he revealed the corruption in this country like nobody else!?\nThe latter point, at least, is something no one is likely to contest.",
    "We made it so that when you have a sink you can wash your hands normally, and you can take a shower, and you can do that other thing, normally, that third element of the bathroom and Im happy to have done it,? Trump said.",
    "Now let me give you the bad news: theyre trying to undo all of those regulations?  he pauses for boos  so that when you go into a house you cant get any water, so were going to fight on that and J.D.",
    "DELAWARE, Ohio  The sun was setting behind Donald Trump, a blazing smear of bronze across the sky, piercing through the ethereal wisps of hair on his head and lighting them in brilliant gold.",
    "She doesnt think too much of the other candidates  Mike Gibbons and Josh Mandel  who, she says, did not act very gentlemanly when they almost came to blows on a debate stage last month.",
    "The point is to lock up Rob Portmans vacant seat and give d Trump a deep-red legislature when he runs in 2024, (which he technically has not said he will do yet, but, come on.)",
    "Moore doesnt have to wait too long: the rally plows through speakers, and Vance comes up to take his swing at the crowd more than two hours before Trump is set to arrive.",
    "The 45th President was wrapping up a lengthy bit about Whirlpool washing machines and Americas great water pressure crisis when he remembered he needed to talk about J.D.",
    "His stump is a bit broader than prior stops, hitting and familiar themes of January 6 and law enforcement persecuting good patriots and not targeting Democrats in power.",
    "I think he needs to explain himself a little bit more,? Toni Moore from Pataskala, says of Vance, while waiting in line for the lemonade and cajun food cart.",
    "Ohios next Senator has received his divine mandate: Hes the guy who Trump has decided can win, or rather, the guy who Trump has decided should win.",
    "He starts off slow, breathily winding through the Whirlpool bit and a long anecdote about taking a cognitive test to prove how smart he is.",
    "The question that remains is whether Trump can still pick a winner, in a race that is chaotic, contentious, and still relatively wide open.",
    "Ohios primary is the first in a massive election year and its Senate race could help swing the balance of power back toward Republicans.",
    "Eventually everything comes back around to the man of the hour, which, despite all appearances, is not supposed to be Donald Trump.",
    "But it scores him some cheers, and then Vance retreats, settling in to wait for the man that this is all about like everyone else.",
    "Trump isnt the biggest gentleman either, of course, but she says she knows he had Americas best interests in mind.",
    "Mostly, though, Trump jumps around between his hits: rigged election, illegal immigration, critical race theory.",
    "In fact if I went by that standard I dont think I would have ever endorsed anybody in the country, you know!",
    "Im waiting to hear about Vance, but Im open to him because of Trump,? Edna Neiser, 76, tells me.",
    "Fortunately for them, everyones sink is safe  because Donald Trump says he is going to send J.D.",
    "I want to pick someone whos going to win, and this man is going to win.?\nThere you have it.",
    "That is supposed to be the point of this rally at the Delaware County fairgrounds Right?",
    "Vance sticker on her purse, which they were giving out to anyone who would take one.",
    "But when the one person that you trust, when he endorses, you feel a little better.",
    "I trust in God to take care of things.?\nThis is a common sentiment  wait and see.",
    "By the way hes been incredible the last period of time, a long period of time.",
    "But I have to do what I have to do, and I have to pick somebody that can win.",
    "Hes a guy that said some bad shit about me,? Trump says, introducing J.D.",
    "When Trump does take the stage, at around 6:45 p.m., the place goes wild.",
    "What he said in 16 well,? she says of Vances statements about Trump.",
    " Trump is here for Vance because the people will come to see Trump.",
    "If hes not elected again this countrys going down the tubes.",
    "But you know what, every one of the others did also.",
    "He was tough  but ultimately, I put that aside.",
    "Vance gives up the mic, he gets one last line.",
    "What it isnt, at least thus far, is tested.",
    "I trust the president,? Edna says.",
    "It is not a complicated plan.",
    "Most importantly, J.D.",
    "Vance to the Senate.",
    "The sun beats down.",
    "And you know what?",
    "But Im not afraid.",
    "But before J.D.",
    "She has a J.D.",
    "Vance.",
    "Vance."
  ]
}