{
  "id": 6186,
  "mediaId": 19,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "J.D.! J.D.! J.D.!: Ohio Rally-Goers Cheer Trump-Endorsed Senate Candidate J.D. Vance",
  "image": "https://media.breitbart.com/media/2022/04/trump-endorses-jd-vance-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/24/j-d-j-d-j-d-ohio-rally-goers-cheer-trump-endorsed-senate-candidate-j-d-vance/",
  "sentiment": "-0.87",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristina Wong",
  "authorUrl": "https://www.breitbart.com/author/kristina-wong/",
  "termIds": [
    946,
    1147,
    1801,
    3103,
    571,
    2643,
    2845
  ],
  "sentences": [
    "#OHSen https://t.co/zAfvxfg5aS\n Andrew Surabian (@Surabees) April 23, 2022\nVance, a 37-year-old Marine veteran, author and tech entrepreneur, noted he was not a Trump supporter at first, saying, My family, a lot of them were with Donald Trump from the moment that he came down the [escalator], it took me a little bit longer to come alongbut I got to say, two reasons why Donald Trump is the best president in my lifetime.?\nHe continued: The first is all the policies we love  the fact that he fought back against the Chinese for the first time in my life, the fact that he actually cut taxes, the fact that he was the most pro-life president of the past 50 years, but ladies and gentlemen, the thing that Trump revealed more than any other policy achievement is that we are living in an incredibly corrupt country.?\nWho would have believed that the Federal Bureau of Investigation  our FBI  would have gotten an illegal wiretap on a U.S. president?",
    "Its time for consequences and its time for action.?\nHe called for finishing Trumps border wall on the southern border, prompting the crowd to chant, Build that wall!?\nThe candidate called for taking power away from corrupt public health bureaucrats? and from a government refusing to shut down Big Tech but shutting down thousands of small Ohio businesses during the pandemic.",
    "Vance also called for accountability for RINOs, a pejorative acronym for Republicans in Name Only, in D.C.\nWe have Republicans right now in Washington, D.C., who are fighting back against Donald Trumps tough on China policies instead of doubling down on it?",
    "Who would have believed that the January 6th protesters  many of whom are not even accused of a violent crime  would still be rotting in prison without an ounce of due process which is required under our Constitution?? he added.",
    "is also supported by the right peopleTucker Carlson, Senator Josh Hawley, Ohio Right to Life, Ric Grenell, Bob Lighthizer, Stephen Miller, my son Don, and most importantly, me,? he said.",
    "Im sick of knowing that our own FBI is more concerned about arresting American citizens than it is about stopping the drug and sex trafficking across our Southern border,? he said.",
    "J.D is being attacked by sleazebags and losers like Bill Kristol, cryin Adam Kinzinger, little Ben Sasse, CNN, MSDNC, the New York Times, and the Washington Post,? he said.",
    "Im sick of the Big Tech companies censoring conservatives, shutting us up, and lets be honest ladies and gentlemen, stealing the 2020 election,? he continued to cheers.",
    "Weve got Republicans in Washington, D.C., who refuse to hold these bureaucrats before Congress and say, Why do you have your job, why are you not in prison?",
    "When you cast your vote, I want you to imagine all of the liberal tears that will be cried, and all of the RINO tears that will be shed, when J.D.",
    "He called for breaking up Big Tech corrupt scumbags who take their marching orders form the Communist Chinese? on censoring Americans.",
    "Im sick of not living in a country that makes its own stuff that relies on the Communist Chinese to make the things that we need.",
    "wins on Election Dayand all the good conservatives who will be celebrating when he defeats Tim Ryan this November,? Trump added.",
    "Why is it that the FBI, who we knowillegally spied on Donald Trump, why havent a single one of them gone to prison?? he asked.",
    "Rally-goers at the Trump rally in Delaware, Ohio, broke out in cheers Saturday for Trump-endorsed Ohio Senate candidate J.D.",
    "I came from the people right out here,? he said, adding a personal commitment to challenge the corruption in Washington.",
    "Vance promised to fight for and represent Ohioans in the U.S. Senate and to not forget where he came from.",
    "The cheering was despite Vances Republican challenger, Josh Mandel, predicting the crowd would boo him.",
    "'?\nIf you broke the law in this country, you ought to go to jail, I dont care how powerful you are.",
    "I am the America First candidate,? he said, saying the time for talking in Washington is over.",
    "is an America First warrior because all the right people are trying to stop him.",
    "'?\nTrump called Vance a MAGA fighter? when he took the stage later.",
    "The crowd chanted his name again two more times during his speech.",
    "Vance said he was honored to receive Trumps endorsement.",
    "Big league cheers at the trump rally for @JDVance1.",
    "The next Senator from Ohio, ladies and gentlemen.",
    "Ladies and gentlemen, I am sick of it.",
    "!? they chanted as he took the stage.",
    "\"JD\" chants throughout his speech.",
    "You know J.D.",
    "Vance.",
    "J.D.!",
    "J.D.!",
    "J.D.",
    "J.D."
  ]
}