{
  "id": 6232,
  "mediaId": 238,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Opinion: Will Trumps base ever turn on him? Look to Ohio.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/22/will-trumps-base-ever-turn-him-look-ohio/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1053,
    1147,
    2466,
    2495,
    2524,
    3103,
    4744,
    428,
    2590,
    2845
  ],
  "sentences": [
    "For example, Paulette Donley, GOP chair in Highland County in southwest Ohio, declined to sign the letter  not because she supports Vance, she told me, but because Trump has had an uncanny sense of picking winners and losers.? Still, Donley acknowledged, it might hurt him.?\nTom Zawistowski, the well-known leader of an Ohio tea party group who has endorsed Gibbons, was pointed in his criticism, saying conservatives do not accept this endorsement.? He added, Mr.",
    "Other leading candidates, such as former state treasurer Josh Mandel, former state Republican Party chair Jane Timken and wealthy businessman Mike Gibbons, have aggressively sought Trumps blessing, and when reports first circulated that Trump would endorse Vance  who had criticized Trump multiple times in 2016 and 2017  disbelief and panic ensued among many of the states Republicans.",
    "A more likely explanation is the involvement of venture capitalist Peter Thiel, a Trump supporter who the New York Times reported in February is spending millions backing 16 Senate and House candidates, many of whom have embraced the lie that Mr. Trump won the election.? One of those candidates is Vance, who worked for Thiel before opening his own Ohio-based investment fund.",
    "A letter to Trump eventually signed by more than 40 county party chairs and state GOP committee members was hurriedly composed, pointing out Vances past criticisms of Trump and his lack of history in Republican politics.",
    "While his unfiltered persona was often frustrating, I never considered abandoning him until he refused to accept defeat and instigated an attack on the U.S. Capitol to disrupt a constitutional count of electoral votes.",
    "Everyone has long known that Trumps endorsement could make the difference, and watching such a late, important nod go to Vance angers the other campaigns more than if it had gone to a different competitor.",
    "We the people worked our asses off and elected you twice.?\nSo fierce was the backlash from some Republicans that Trump reportedly delayed the endorsement, initially planned for Thursday last week.",
    "After Trumps endorsement, Thiel dumped another $3.5 million  on top of a $10 million initial donation  into a PAC supporting Vance, and Trump Jr. made a beeline for Ohio to campaign with him.",
    "People who cannot fathom the depth of loyalty to Donald Trump often ask, Is there anything Trump could do that would cause his base to abandon him??\nIt has been tough to think of anything.",
    "Or perhaps the reaction will be lukewarm, or even hostile  finally providing an affirmative answer to the eternal question of whether theres anything Trump can do to alienate his base.",
    "Mandel and Gibbons have been leading most polls, and the Club for Growth, a PAC supporting Mandel, was doubling down on ads reminding voters of Vances past disparagements of Trump.",
    "Donald Trump Jr., who has long been in Vances corner, argued this week that his father picked Vance after a debate confrontation between Mandel and Gibbons nearly got physical.",
    "Trump phoned at least one other contender that evening to discuss the pushback, leaving the impression that he was reconsidering, a source close to the candidate told me.",
    "Most of the scandals of his presidency were shrugged off by supporters, including me, as media bias and lasting bitterness over a shocking 2016 election result.",
    "Endorsing Vance, the signatories warned Trump, cuts against your support and legacy in Ohio.?\nNot everyone agreed with asking Trump to stay quiet.",
    "Theories abound as to how Vance won the nod despite his previous attacks on Trump and poor performance in recent polls.",
    "As this week wore on and the May 3 primary approached, anger was giving way to desperation among the other candidates.",
    "Though outside forces have worked tirelessly to topple him, the biggest threat to Trump has always been Trump.",
    "They also see Ohios Senate seat being bought by Thiel, a California billionaire, with Trumps help.",
    "Maybe all will be forgiven, with the crowd welcoming Vance as the new Trumpian standard-bearer.",
    "The implication that the famously combative former president was offended seems improbable.",
    "But late on Good Friday  after ignoring further pleas  he announced his backing of Vance.",
    "Trump is holding a rally in Ohio on Saturday, with Vance now added to the program.",
    "Many Republicans dont buy Vances claims to have had a change of heart about Trump.",
    "They see him as an opportunist pandering for votes, and Trump falling for it.",
    "An example emerged last week, when he endorsed Hillbilly Elegy? author J.D.",
    "President, you claim you won Ohio twice but let me be clear.",
    "Vance in the GOP primary for the open Senate seat in Ohio.",
    "But even that didnt do the trick for most of his devotees.",
    "You didnt win Ohio."
  ]
}