{
  "id": 6366,
  "mediaId": 151,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Trump gives Vance coveted endorsement in Ohio Senate race",
  "image": "https://www.politico.com/dims4/default/19ea268/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F83%2Ffa%2Fc2c00f8141a5a35c7211ccc7c677%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1239922215",
  "link": "https://www.politico.com/news/2022/04/15/trump-vance-endorsement-ohio-senate-race-00025667",
  "sentiment": "0.769",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    781,
    1147,
    1801,
    2005,
    2466,
    2524,
    3103,
    380,
    428,
    571,
    2845
  ],
  "sentences": [
    "Vance, a venture capitalist and the author of Hillbilly Elegy,? spent more than a year battling for Trumps endorsement alongside a handful of other candidates  including a March 2021 Apprentice?-style boardroom sit-down with the former president where they auditioned for him.",
    "When Trump was running for president in 2016, Vance described himself as a Never Trump guy? and called Trump an idiot? and offensive.? The anti-tax Club for Growth, which is backing Mandel, has aired TV ads reminding voters of Vances comments.",
    "Trump also received encouragement from several Vance allies, including Fox News host Tucker Carlson, conservative activist Charlie Kirk, Missouri Sen. Josh Hawley and Trumps son, Donald Trump Jr.\nVance hasnt always been a Trump supporter.",
    "This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race  theyve said great things about Trump and, like me, they love Ohio and love our country,? Trump said in a statement.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent  dangerous because they will have so much money to spend,? Trump added, referring to the expected Democratic nominee, Rep. Tim Ryan.",
    "As the months wore on, Trump met with other candidates who made pilgrimages to Mar-a-Lago, including Mandel, Gibbons and Vance, who was accompanied by his top donor, billionaire tech investor Peter Thiel.",
    "Early on, he came close to endorsing former Ohio GOP Chair Jane Timken, but he scrapped the idea after she appeared to defend Republican Rep. Anthony Gonzalez over his support for Trumps impeachment.",
    "Trumps endorsement isnt without risk: Most polls have consistently shown Vance trailing his Republican rivals, including Mandel, the former state treasurer and investment banker Mike Gibbons.",
    "The scramble culminated with rival campaigns racing to stop a Vance endorsement ahead of the May 3 primary, as word that Trump was approaching a decision circulated over the past week.",
    "On Thursday morning, Josh Mandels campaign distributed to top Republicans a memo arguing that a Trump endorsement of Vance would do little to raise Vances standing in the polls.",
    "The cable news-watching former president told others he thought Vance was good on TV and was enamored with his policy platform, including battling large tech companies.",
    "But Vance allies argue that the endorsement from Trump  who polls show remains popular with Republican voters in the state  will catapult him into serious contention.",
    "Vance may have said some not so great things about me in the past,? Trump said in his statement, but he gets it now, and I have seen that in spades.?",
    "Vance on Friday afternoon, potentially shaking up a major primary and capping a long and contentious fight for the former presidents support.",
    "| Gaelen Morse/Getty Images\nBy Alex Isenstadt\n 04/15/2022 06:06 PM EDT\nDonald Trump endorsed Ohio Republican Senate candidate J.D.",
    "But Trump  who phoned Vance on Friday afternoon to inform him of his endorsement  appeared unmoved.",
    "Vance speaks with prospective voters on the campaign trail on April 11, 2022, in Troy, Ohio.",
    "Trump in recent weeks warmed to the idea of endorsing Vance.",
    "Trump had spent months mulling over his endorsement.",
    "Ive studied this race closely and I think J.D.",
    "U.S. Senate candidate J.D.",
    "Like some others, J.D."
  ]
}