{
  "id": 6370,
  "mediaId": 238,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Trump endorses J.D. Vance in Ohios crowded GOP primary for Senate",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/15/trump-endorses-vance/",
  "sentiment": "-0.368",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    781,
    1115,
    1147,
    1801,
    2466,
    2470,
    3103,
    428,
    571,
    2845
  ],
  "sentences": [
    "He is our best chance for victory in what could be a very tough race.?\nWhen Trump first ran for the White House in 2016, Vance, author of the bestseller Hillbilly Elegy,? called the New York businessman and reality TV star cultural heroin,? said his policies ranged from immoral to absurd? and labeled him unfit for our nations highest office.?\nSince then, Vance has fully embraced the former presidents politics as he pursued the GOP nomination to replace Republican Sen.",
    "In a statement, Timken expressed her disappointment with Trumps decision but reminded voters that Trump endorsed her for state party chairman, a position in which she was incredibly proud to have dismantled the Never-Trump Kasich establishment and turned Ohio into a pro-Trump, conservative stronghold.?\nThis race is about who can defeat Tim Ryan and retake the Republican Senate majority in November,? she said.",
    "In his endorsement, Trump described Vance as strong on the Border, tough on Crime, understands how to use Taxes and Tariffs to hold China accountable, will fight to break up Big Tech, and has been a warrior on the Rigged and Stolen Presidential Election.? The former president continues to perpetuate his baseless claims that widespread voter fraud cost him reelection.",
    "Trump advisers working for other candidates, along with more than two dozen county party chairs, tried to talk the former president out of the endorsement after it was reported to be imminent, according to officials who spoke on the condition of anonymity to freely describe private talks.",
    "I am that candidate and I look forward to having President Trumps endorsement in the General Election.?\nRyan, a congressman who ran for president in 2020, is seeking the Democratic nomination in a state that has leaned heavily Republican, strongly backing Trump in 2016 and 2020.",
    "The endorsement may also plunge Trump into another risky primary race  he already raised eyebrows in the party last week when he endorsed fellow television celebrity-turned-politician Mehmet Oz in the contested GOP primary of a Senate race in Pennsylvania.",
    "Trump was lobbied aggressively by David McIntosh, the president of the Club for Growth, not to endorse Vance, and received so many calls on Friday about the endorsement that he stopped taking calls,? an adviser said.",
    "There is no clear favorite in the Ohio race, and the endorsement of Vance, backed by billionaire Peter Thiel and supported by Donald Trump Jr., among others, gives the candidate momentum against other Republicans.",
    "Others opposed to the Vance endorsement included longtime Trump advisers Corey Lewandowski and Kellyanne Conway, who are backing Jane Timken, the former chair of the Ohio Republican Party.",
    "He will be again, and Ill fight for the America First Agenda in the Senate.?\nVance has noticeably changed his positions to become a candidate more aligned with the former presidents views.",
    "A second person close to Trump said he dictated the statement about Vance himself because he wanted to explain to others he had thought through the race and heard their arguments.",
    "Online, hes become more willing to engage in the sort of attacks that were common in Trumps now-shuttered Twitter feed, trolling Democratic politicians and liberals.",
    "Vance opponents also released polling showing him losing  and likely to lose with Trumps backing  though the aggressive move seems to have backfired.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,? Trump said in a statement.",
    "In a tweet, Vance happily accepted the endorsement, saying he was honored? to have it and voicing support if Trump makes another White House bid.",
    "Former Ohio treasurer Josh Mandel, who has the endorsement of Sen. Ted Cruz (R), and financier Mike Gibbons also are seeking the nomination.",
    "Vance in the Republican primary for a Senate seat in Ohio, a move likely to give the first-time candidate a boost in the crowded field.",
    "I look forward to earning his endorsement in the general election and working with him to defeat Tim Ryan in November,? Mandel wrote.",
    "Just six years ago, when he was considered a never Trump? Republican, Vance criticized Trump for targeting immigrants and Muslims.",
    "But as recently as last year, he lashed out against Republican Sen. Ben Sasses embrace of refugees from Afghanistan.",
    "The candidate with the most votes will move on to the general election, without need of a runoff.",
    "He was an incredible fighter for hard working Americans in the White House,? Vance said.",
    "Former president Donald Trump on Friday endorsed venture capitalist and author J.D.",
    "I continue to be a proud supporter of President Trump and the America First agenda.",
    "There was incredibly intense lobbying on all sides,? the adviser said.",
    "The Ohio primary is May 3 and early voting began on April 5.",
    "Rob Portman, who is retiring.",
    "Portman has endorsed Timken.",
    "Like some others J.D."
  ]
}