{
  "id": 6391,
  "mediaId": 19,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "MAGA Crowd Praises Trumps Endorsing J.D. Vance in Ohio: The Right Choice!",
  "image": "https://media.breitbart.com/media/2022/04/GettyImages-1239309885-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/15/maga-crowd-praises-trumps-endorsing-j-d-vance-in-ohio-the-right-choice/",
  "sentiment": "0.91",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    781,
    946,
    1147,
    1801,
    2379,
    2466,
    3103,
    3720,
    571,
    2845
  ],
  "sentences": [
    "We should forcibly break them up and create more competition in the same way that Teddy Roosevelt created competition in the steel industry.?\nVances speech at the Conservative Political Action Conference (CPAC) assailed elected politicians who are helping fund the United States involvement in the Ukraine-Russia conflict even as the U.S.-Mexico border has seen record-breaking illegal immigration and drug trafficking over the last year.",
    "pic.twitter.com/ysbxeUo58i\n Kurt Schlichter (@KurtSchlichter) April 14, 2022\nVances candidacy has represented the populist-nationalist-wing of the GOP with policy prescriptions for reducing the social and market power of giant tech corporations, punishing multinational companies that outsource American jobs, and critiquing the political establishments lust for foreign interventionism.",
    "Rep. Matt Gaetz (R-FL) wrote that Trump made the right choice!? and that Republicans need [Vance] in Washington to fight back against those who put America last.?\nLikewise, Rep. Jim Banks (R-IN)  who also heads the National Republican Study Committee (NRSC)  called on Ohio Republican primary voters to join Trump and back Vance in the race.",
    "Vance, whose best-selling memoir Hillbilly Elegy was adapted into a movie in 2020, received Trumps complete and total endorsement? in the crowded race that also includes former Ohio State Treasurer Josh Mandel, investment banker Mike Gibbons, and former Ohio Republican Party chairwoman Jane Timken.",
    " Josh Hawley (@HawleyMO) April 15, 2022\nRepublican Bernie Moreno, who dropped out of the race in February, called on GOP primary voters to rally around Vance in an effort to coalesce support against Rep. Tim Ryan (D-OH), the likely Democrat nominee for Senate.",
    "https://t.co/3n20kOcjIN\n Arthur Schwartz (@ArthurSchwartz) April 15, 2022\nNothing would make me happier than @JDVance1 repping my home state of Ohio in the Senate except JD being cloned and JDVance2 running against and crushing Sherrod \"Buckeye Bernie\" Brown.",
    "[Vance is] strong on the border, tough on crime, understands how to use taxes and tariffs to hold China accountable, will fight to break up Big Tech, and has been a warrior on the rigged and stolen presidential election,? Trump wrote in his endorsement.",
    "One of the biggest ways that the Democrats have failed the working class, have failed the citizens of this country, is that they dont even care about their citizens compared to the illegal aliens flowing across the U.S. southern border,? Vance said.",
    "Vance has even gone after BlackRock, the Wall Street multinational investment firm, for buying up single-family homes across the U.S. at above-market prices, resulting in first-time homeowners and young Americans getting shut out of home ownership.",
    "Political consultant Arthur Schwartz wrote that Vance is the only candidate in the Ohio GOP Senate primary that is pretty much guaranteed to win the general? Conservative Kurt Schlichter similarly heaped praise on Trump for the endorsement.",
    "Lets go @JDVance1 https://t.co/WiDhvDxc6f\n Richard Grenell (@RichardGrenell) April 15, 2022\nOther former Trump administration officials like Cliff Sims, Darren Beattie, and Stephen Miller suggested support for the endorsement.",
    "In an exclusive interview with Breitbart News from January, for instance, Vance said Big Tech companies are simply too big and too powerful and that conservatives must get behind efforts to cut their control over Americans.",
    "[Vance] will make that happen.?\nFormer Trump administration official Ric Grenell, a one-time supporter of Moreno, suggested he too is fully behind Vance now that Trump has endorsed him.",
    "The Left will ignore this because Blackrock has committed to racial audits and other diversity BS.?\nThe Ohio Republican Senate primary election is set for May 3.",
    "Theres only one candidate in the OH GOP senate primary that is pretty much guaranteed to win the general, and that candidate is America First warrior JD Vance.",
    "He was an incredible fighter for hard working Americans in the White House, he will be again, and I'll fight for the America First Agenda in the Senate.",
    "He was an incredible fighter for hard working Americans in the White House, he will be again, and Ill fight for the America First Agenda in the Senate.",
    "Trump made the right choice endorsing JD Vance- hell be excellent in the Senate https://t.co/E6RGlrk6oI\nDJT nails it with this one, big time.",
    "As we have seen [Tim Ryan] is a shallow, useless, and tired career D.C. bureaucrat who has done nothing for the people he was paid to serve.",
    "Former President Donald Trumps most ardent supporters of America First? policies are praising his endorsement of best-selling author J.D.",
    "As we have seen @TimRyan is a shallow, useless, and tired career DC bureaucrat who has done nothing for the people he was paid to serve.",
    "A big part of, whats a driving the censorship machine with Big Tech is these companies are just too big, and they are too powerful.",
    "Sen. Josh Hawley (R-MO), a longtime supporter of Vances Senate campaign, wrote On to victory!? following news of the endorsement.",
    "Those should be at least three separate companies.?\nAmazon controls the entire modern hardware infrastructure of the Internet.",
    "Christopher Rufo of the Manhattan Institute called Trumps endorsement of Vance a big moment? for the Republican Party.",
    "Blackrock is pursuing an investment strategy that will make it harder for young Americans to own homes,? Vance wrote.",
    "Vance thanked Trump for the endorsement, writing:\nIm incredibly honored to have President Trumps support.",
    "Vance (@JDVance1) April 15, 2022\nIn response, Trumps most influential backers praised the endorsement.",
    "Ohio Republicans: Lets unite & make certain we keep the seat in Republican hands,? Moreno wrote.",
    "https://t.co/nleIWJbNZy\n Cliff Sims (@Cliff_Sims) April 15, 2022\nFantastic endorsement from DJT.",
    "Ohio Republicans: lets unite & make certain we keep the seat in Republican hands.",
    "We need @JDVance1 in Washington to fight back against those who put America Last.",
    "https://t.co/iweTdkaoBF\n Matt Gaetz (@mattgaetz) April 15, 2022\nOn to victory!",
    "[Emphasis added]\nI'm incredibly honored to have President Trump's support.",
    "Vance, a national populist, in the Ohio Republican Senate primary race.",
    "When you have that much concentrated power, it leads to censorship.",
    "Facebook, Instagram, WhatsApp is actually the same company.",
    "I think we should break these companies up,? Vance said.",
    "We should not allow that to happen,? Vance continued.",
    "John Binder is a reporter for Breitbart News.",
    "Trump made the right choice endorsing J.D.",
    "President Trump made the right choice!",
    "Email him at jbinder@breitbart.com.",
    "@JDVance1 will make that happen.",
    "https://t.co/cf5e0M9wvy\nIm in.",
    "Support [Vance] for US Senate!",
    "https://t.co/s3d3JhTgBC\n J.D.",
    "Go win this thing, @JDVance1!",
    "Follow him on Twitter here.",
    "Time for him to go home.",
    "Time for him to go home.",
    "Vance,? Beattie wrote.",
    "#MAGA,? Banks wrote.",
    "It leads to control."
  ]
}