{
  "id": 6409,
  "mediaId": 124,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Trump plans J.D. Vance endorsement in crowded Ohio senate race, sources say",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220414-jd-vance-jm-1313-a1fd67.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/trump-plans-jd-vance-endorsement-crowded-ohio-senate-race-rcna24449",
  "sentiment": "-0.925",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    799,
    946,
    1147,
    1801,
    2027,
    2429,
    2466,
    3103,
    428,
    2845
  ],
  "sentences": [
    "A source close to Mandels campaign acknowledged Thursday that Trump's press shop had already written up an endorsement of Vance, but it threw up a last-minute obstacle for the former president to consider: an internal Republican poll conducted by his campaign showing Mandel in front with 33 percent of the vote, followed by Matt Dolan and Mike Gibbons tied at 15 percent.",
    "In recent days, Trump began calling donors and advisers to get their opinion endorsing on the Hillbilly Elegy? author, but he held off under intense pressure from the rival Republican campaigns of Josh Mandel and Jane Timken, the sources said.",
    "Vance's supporters, who include the former president's son and namesake, were hoping Trump would have made the endorsement Thursday, when his office announced he was holding an Ohio rally on April 23, 10 days before the primary.",
    "\"The Mandel people hit the roof,\" one Republican with knowledge of the discussions told NBC News, noting that Ohio Republican Rep. Jim Jordan tried to dissuade Trump on behalf of Mandel, whom the congressman supports.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nDolan is the only candidate who is running on a platform that does not seem to be courting the support of the former president.",
    "Vance is also running in about third or fourth place in recent public polling and has barely cracked double digits  a major worry for Trump who doesnt want to waste his endorsement, the sources said.",
    "That has bothered Trump immensely and has pushed him to want to pick a winner to ensure that a non-Trump acolyte doesn't win a state that he won handily in 2020 and 2016.",
    "Exclusive: Obama on issues that will impact midterm elections\nApril 12, 202200:58\nThe May 3 primary is winner take all  meaning the candidate with the plurality wins.",
    "And those who have spoken to Trump or his advisers in recent days say he sees the most growth opportunity with Vance and a chance to make a real difference.",
    "So Trump can always change his mind,? said one source who had spoken recently to Trump about the Ohio race.",
    "Vance in Ohio's crowded senate GOP primary, according to three sources with knowledge of his decision.",
    "In public poling, Mandel and Gibbons lead the pack with roughly 20 percent of the vote each.",
    "Trump has been concerned with Vance, who criticized the former president bitterly in 2016.",
    "And its only nobody if somehow the other campaigns can get him to hold off.?",
    "But he already kicked the tires on everyone and hes ready to go with Vance.",
    "But Vance isnt so far behind in the public polling that he cant catch up.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Vance and Jane Timken were tied at 9 percent in the Mandel poll.",
    "A spokesperson for Trump could not be reached for comment.",
    "Former President Trump is planning to endorse J.D.",
    "Nothing is final until its final.",
    "Its either Vance or nobody."
  ]
}