{
  "id": 6543,
  "mediaId": 223,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "It's Not Exactly Trump's Republican Party",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/270/148aff45-d5bf-43b5-8bc5-4d77be7169b1.jpg",
  "link": "https://townhall.com/columnists/michaelbarone/2022/05/20/its-not-exactly-trumps-republican-party-n2607543",
  "sentiment": "0.656",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Barone",
  "authorUrl": "https://townhall.com/columnists/michaelbarone/",
  "termIds": [
    800,
    821,
    1147,
    1404,
    1801,
    1878,
    2136,
    2250,
    2303,
    3103,
    146,
    428
  ],
  "sentences": [
    "Primary polling is not an exact science, but the numbers support the conclusion that Trump jumped on the bandwagon of a candidate who had performed well in debates about as well as the conclusion that he swung thousands of voters in Vance's direction.",
    "More Republican ballots have been cast than Democratic ones in every primary state so far except Oregon, with Republicans casting 65% and 67% of ballots in solid Republican Ohio and Texas and 53% and 55% in marginal Pennsylvania and North Carolina.",
    "A look back at the last three Republican presidential primaries shows a party moving toward populism on trade, immigration and entitlements, with the party's constituency including more noncollege graduates and nonmetropolitan residents.",
    "Trump will claim credit for the party's victories, but Republicans may not renominate this former president in 2024, just as they declined to renominate Ulysses S. Grant in 1880 and Theodore Roosevelt in 1912.",
    "Similarly, in the May 5-10 NBC News poll, only 34% of Republicans characterized themselves \"more of a supporter of Donald Trump,\" while 58% said they were \"more of a supporter of the Republican Party.\"",
    "Earlier NBC polls showed more Republicans identifying with the party rather than the former president starting in April 2021, but the gap has risen from 6 percentage points then to 24 points now.",
    "View Cartoon\nIn Tuesday's North Carolina primary, Trump's endorsement back in June 2021 of Rep. Ted Budd may have been decisive not just in gaining generating support but in winnowing the field.",
    "In primaries and caucuses up through April 5, by which time Trump eliminated all but one opponent, he won 36% of the votes -- a steady progression from Huckabee's 22% and Santorum's 28%.",
    "Michael Barone is a senior political analyst for the Washington Examiner, resident fellow at the American Enterprise Institute and longtime co-author of The Almanac of American Politics.",
    "Certainly, all three candidates (who, oddly in a state with a high percentage of residents born there, all made most of their careers elsewhere) strove to echo his stands on the issues.",
    "Their perhaps opportunistic Trumpishness is in line with results of a recent New York Times focus group of Republican voters, moderated by Republican pollster Kristen Soltis Anderson.",
    "Pennsylvania also voted Tuesday, and, as I write, Trump-endorsed TV doctor Mehmet Oz leads former hedge funder David McCormick by just 2,672 votes out of 1.3 million cast.",
    "But it's not an airtight case, and Trump's batting average is inflated by the dozens of endorsements he has made of incumbents with no significant primary opposition.",
    "Vance jumped from 8% to 15% in previous polling to 23% in a Trafalgar poll conducted between April 13 and April 14, and he had similar numbers in later polls.",
    "In the West Virginia race between two incumbent congressmen, Trump endorsee Alex Mooney won a solid victory in a district Trump carried 67% to 31% in 2020.",
    "You can make the case it is, as partisan Democrats do, from the victories of various candidates endorsed by the former president in Republican primaries.",
    "Back in 2008, the little-known, lightly financed Mike Huckabee won 22% of the votes in contests until John McCain clinched the nomination on March 4.",
    "In 2016, Trump faced no single establishment candidate but a field full of rivals afraid to criticize him and bent on undercutting each other.",
    "In Ohio, Trump disappointed several pro-Trump Senate candidates when he endorsed \"Hillbilly Elegy\" author and onetime Trump skeptic J.D.",
    "In the Nebraska governor race, his candidate Charles Herbster lost to Jim Pillen, a state university regent endorsed by incumbent Gov.",
    "Vance ended up winning the May 5 primary with 32% to 24% for former state Treasurer Josh Mandel and 23% for state Sen. Matt Dolan.",
    "and Charlotte Mayor Pat McCrory in a party whose primary electorate is increasingly nonmetropolitan, and Budd won 59% to 25%.",
    "In 2012, the sweater vest-clad Rick Santorum won 28% of the votes until Mitt Romney clinched the nomination on April 3.",
    "Eight out of 10 members raised their hands when asked if they'd support a candidate \"who embraces Mr. Trump's agenda.\"",
    "But incumbent Attorney General Ken Paxton, endorsed by Trump last July, was forced into a runoff by George P. Bush.",
    "But controversial Rep. Madison Cawthorn, despite Trump's endorsement, lost to local legislator Chuck Edwards.",
    "But only 1 in 10 did so when asked about a candidate with \"the same style and personality of Mr.",
    "It's also a party on the brink of a big midterm victory, judging from primary turnout so far.",
    "If Oz's lead holds up in the full tabulation and likely recount, Trump might claim credit.",
    "April polling showed Budd, from rural Davie County, pulling well ahead of former Gov.",
    "Paxton leads in runoff polling, but one survey shows his margin narrowing.",
    "Each is at 31%, not too far ahead of Trump supporter Kathy Barnette's 25%.",
    "My conclusion: It's a Trumpish party, but not exactly Trump's party.",
    "Greg Abbott and many other easy winners in Texas's Tuesday primary.",
    "Trump endorsements had mixed success in the May 10 primaries.",
    "But Herbster's personal problems may have been decisive.",
    "So did Trump create MAGA, or did MAGA create Trump?",
    "Trending\nIs it Donald Trump's Republican Party?",
    "This is perhaps a natural development.",
    "Vance on Good Friday, April 15.",
    "But was Trump's nod pivotal?",
    "Thus Trump endorsed Gov.",
    "Pete Ricketts.",
    "Trump.\""
  ]
}