{
  "id": 8567,
  "mediaId": 151,
  "date": "5/27/2022 12:00:00 AM",
  "headline": "MAGA's would-be Millennial heir",
  "image": "https://static.politico.com/bd/74/1565da954b6b8b9672eb86f13546/blake-masters.jpeg",
  "link": "https://www.politico.com/newsletters/politico-weekend/2022/05/27/magas-would-be-millennial-heir-00035489",
  "sentiment": "0.871",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1292,
    1801,
    2524,
    3103,
    6163,
    6212,
    6217,
    562,
    6143,
    2725
  ],
  "sentences": [
    "In this rubber-laying trip down memory lane, Adam Wren takes us to the 2011 Indy 500, when an offer to let Trump drive the pace car  a ceremonial role that typically elides politics  set off a backlash that ultimately ended in the future president pulling out, allowing the race to remain one of the last bipartisan bastions in American professional sports.",
    "MAGA's would-be Millennial heir\nBy POLITICO MAGAZINE\n05/27/2022 09:17 AM EDT\nThe battle for the future of MAGA is playing out in the Arizona Republican Senate primary, and while Donald Trump looms large, there's another big figure at play: tech billionaire Peter Thiel, who's pumped millions of dollars into the Blake Masters campaign.",
    "But now, as the end of Roe v. Wade looms, she's opening up about her own experience of having two abortions in her 20s, exploring the role of Black women in the fight for reproductive rights and wondering why there's yet to be an in-the-streets, pro-choice backlash on the scale of #MeToo or Black Lives Matter.",
    "With the House Oversight Committee looking into the NFL's handling of sexual harassment claims at the Commanders' front office as well as accusations of financial impropriety, Snyder's turning Congressional polarization into partisan support, forming a tacit alliance with committee Republicans.",
    "So begins this unbelievable tale of homophobic paranoia over a supposed gay cabal controlling  and possibly even including  the leader of the Republican Party, adapted from Jamie Kirchick's new book, Secret City: The Hidden History of Gay Washington.",
    "Despite Trump's four years in the White House and his enduring dominance over the GOP, Trumpism as an ideology is still largely inchoate, writes Hank Stephenson in this sweeping profile of the would-be Millenial heir to MAGA.",
    "Snyder Tries a New Play  Democrat or Republican, local or federal, Marylander or Virginian or D.C. resident  in a polarized capital, all were united by one thing: despising Washington Commanders owner Dan Snyder.",
    "The former president may be nervous about extending an endorsement in the race following the failure of Trump-backed Dr. Mehmet Oz to net a decisive win in Pennsylvania  a race that is still up in the air.",
    "It was the summer of 1980, and Congressman Bob Livingston was wasted, hiding in the gym beneath the Rayburn House Office Building, terrified that a team of gay, right-wing assassins was going to kill him.",
    "Masters is a thin, almost eerie presence who films dark campaign videos of himself alone in the desert, staring into the camera lens as he delivers monologues about the psychopaths running the country.",
    "Vance in Ohio, Masters, the 35-year-old who co-wrote Thiel's best-selling book, Zero to One, is running to realign the Republican Party with a hard-line nationalism.",
    "Sure, but it reminds you of what the Forum was like a decade ago when you first started coming  before all the hanger-on hotel badge holders ruined the place.",
    "- Mention how impressed you were by Paul Ryan  still obviously hitting the gym, and cheerfully refusing to cut the line for The Mooch's wine tasting evening.",
    "The press had fun with the wardrobe mishap: Some holdover Nixon aides sent them out with the money to be laundered, wrote the Chicago Tribune's Jim Squires.",
    "- Remind everyone that you hardly missed the 19 leaders from the G-20 who skipped the Forum  you had back-to-back meetings all week long.",
    "In fact, Ford had modeled the suit barefoot for his wife, Betty, before his trip but had failed to properly adjust the suspenders.",
    "answer: President Franklin Delano Roosevelt said this in a radio address to the New York Herald Tribune Forum in October 1939.",
    "When the Indy 500 Shunned Trump  As a presidential candidate, Donald Trump would set the pace for the rest of the field.",
    "But his meeting with Emperor Hirohito was overshadowed by a sartorial sin: Ford's pants were several inches too short.",
    "Every week, The Weekend inserts a question in a POLITICO/Morning Consult poll and see what the crosstabs yield.",
    "And he rails against the techno-dystopia he claims we inhabit, where Big Tech ruthlessly censors conservatives.",
    "The Masters and Vance candidacies offer an opportunity to flesh out Trumpism  or Thielism  and reshape the GOP.",
    "He spoke about propaganda, extremist threats to democracy and the value of the democratic middle course.",
    "Still, Democrats certainly take the notion of a Sen. Masters seriously, even as it makes them shudder.",
    "A conservative is a man with two perfectly good legs who, however, has never learned to walk forward.",
    "48 percent  of ideological conservatives strongly or somewhat support a ban on assault-style weapons.",
    "The Schatzalp is breathtaking in winter, but who knew the Stromback Penthouse would be so much fun?",
    "Here's how to pass yourself off as a Davos badge holder without ever leaving your living room.",
    "A liberal is a man who uses his legs and his hands at the behest, at the command, of his head.",
    "In 1974, Gerald R. Ford made history as the first sitting American president to visit Japan.",
    "Now, a man who's had two decades of comically bad PR has a shot at making allies.",
    "And Masters isn't sure he can win without the coveted Trump stamp of approval.",
    "- Wasn't it tacky for Filecoin to rent the local church for its parties?",
    "Except on Capitol Hill, Mike Schaffer writes in his latest column.",
    "Writer Erin Aubry Kaplan has mostly avoided the topic of abortion.",
    "The trousers were really a pair of Rockefeller hand-me-downs.",
    "A radical is a man with both feet firmly planted  in the air.",
    "The question is, can he get elected without Donald Trump?",
    "Following the victory of Thiel-backed Republican J.D.",
    "And this is where Thiel, Vance and Masters come in.",
    "A reactionary is a somnambulist walking backwards.",
    "- Would you go back for a summer Davos in 2023?",
    "Email us at politicoweekend@email.politico.com.",
    "He says he takes his swagger from Kanye West.",
    "Will that be enough to avoid accountability?",
    "Can you guess who said this in October 1939?",
    "Can Black Women Reboot the Abortion Fight?",
    "But as a racecar driver, not so much.",
    "Scroll to the bottom for the answer.",
    "- Did it seem quieter this year?",
    "Why spend $100k going to Davos?",
    "Ronald Reagan's Gay Assassins?",
    "(From POLITICO's Ryan Heath.)",
    "Read Stephenson's story.",
    "Business is booming!",
    "Got any suggestions?",
    "**Who Dissed?",
    "Follow Us",
    "Yes!"
  ]
}