{
  "id": 1040,
  "mediaId": 2746,
  "date": "2022-04-04",
  "headline": "Rep. Raskin says Jan. 6 panel is a ‘model, bipartisan committee’",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/04/Capitol_Riot_Contempt_14913.jpg-b76ff_c0-250-6000-3750_s1200x700.jpg?2cb823f519263a3e55a419724463fd44fb7f7c61",
  "link": "https://www.washingtontimes.com/news/2022/apr/4/jamie-raskin-says-jan-6-panel-model-bipartisan-com/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mica Soellner",
  "authorUrl": "https://www.washingtontimes.com/staff/mica-soellner/",
  "termIds": [
    1390,
    2298,
    4087,
    878
  ],
  "sentences": [
    "“We’re rolling up our sleeves and getting down to work … not only is this a bipartisan committee, it is a model, bipartisan committee and one that other committees can learn from.”\nThe Jan. 6 committee is made up of seven Democrats, and two Republican — Reps. Adam Kinzinger of Illinois and Liz Cheney of Wyoming — both of whom are major critics of former Donald Trump.",
    "Rep. Jamie Raskin said Monday that the panel investigating the pro-Trump attack at the U.S. Capitol on Jan. 6, 2021, is a “model, bipartisan committee,” hitting back at Republicans’ accusations of political motivations.",
    "House Republicans have distanced themselves from the panel, attacking it as a political ploy after Speaker Nancy Pelosi rejected two GOP lawmakers chosen by House Minority Leader Kevin McCarthy to serve on the panel.",
    "Mr. Raskin, Maryland Democrat who sits on the committee, said the rest of Congress should follow the lead of the Jan. 6 committee when it comes to bipartisanship.",
    "Mrs. Pelosi rejected Reps. Jim Banks of Indiana and Jim Jordan of Ohio over their votes to reject certifying the 2020 presidential election results.",
    "Republicans have dubbed the Jan. 6 committee as a partisan panel, investigating the Capitol riot because of their disdain for Mr. Trump.",
    "She said she is “extremely proud” of the nonpartisan work the committee was doing to find out how the riot played out last year.",
    "Ms. Cheney rejected that notion, saying her GOP colleagues are the ones who “played politics” over the attack.",
    "“It is the most bipartisan committee I’ve ever been on,” Mr. Raskin said."
  ]
}