{
  "id": 1041,
  "mediaId": 2664,
  "date": "2022-04-07",
  "headline": "Marjorie Taylor Greene's latest screed about Democrats destroyed in 'Daily Show' supercut",
  "image": "https://www.rawstory.com/media-library/marjorie-taylor-greene.jpg?id=29649448&width=1200&coordinates=0%2C0%2C0%2C133&height=600",
  "link": "https://www.rawstory.com/marjorie-taylor-greene-2657113839/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Evans",
  "authorUrl": "https://www.rawstory.com/u/timothyevans",
  "termIds": [
    1670,
    2407,
    2514,
    2923,
    3290,
    4145,
    305,
    878,
    4814
  ],
  "sentences": [
    "In a new supercut video set to The Tings Tings hit “That’s Not My Name”, The Daily Show's Trevor Noah takes her to school, trotting out the list of Republicans who have been exposed for proven or alleged sexual liaisons with underage people: former House Speaker Dennis Hastert, Florida Rep. Matt Gaetz, former Rep. Mark Foley of Massachusetts, Alabama's Roy Moore and Rep. Jim Jordan of Ohio.",
    "Greene's accusation that those who support Jackson's nomination are \"pro pedophile\" is borne from a line of attack by Missouri GOP Sen. Josh Hawley during Jackson's confirmation hearing in which he baselessly accused the judge of being too lenient when sentencing child sex offenders.",
    "Hawley's claims were widely labeled as misleading by fact checkers, with Andrew C. McCarthy, a former federal prosecutor and contributing editor at the conservative magazine National Review, describing Hawley's line of questioning as \"meritless to the point of demagoguery.\"",
    "If she was the Georgia Republican wouldn't have labeled Democrats as the \"party of pedophiles\" when she denounced their support of Ketanji Brown Jackson's Supreme Court nomination.",
    "You can watch The Daily Show's video takedown here:\n— The Daily Show (@The Daily Show) 1649280815",
    "Rep. Marjorie Taylor Greene clearly isn't a student of history."
  ]
}