{
  "id": 1054,
  "mediaId": 2526,
  "date": "2022-04-01",
  "headline": "Poll: 76 Percent Disapprove of Democrat-Controlled Congress",
  "image": "https://media.breitbart.com/media/2018/12/Schumer-Pelosi-stares-getty.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/01/poll-76-percent-disapprove-democrat-controlled-congress/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    1670,
    2576,
    2599,
    3975,
    302,
    305,
    414,
    878,
    1124,
    5407
  ],
  "sentences": [
    "Other than impeaching Biden, if Republicans assume congressional power after the midterms, they will also likely conduct probes into Hunter Biden’s laptop, Joe Biden’s relationship with corruption in China and Ukraine, and Dr. Anthony Fauci’s role in funding the Wuhan lab in China.",
    "Likely reflecting some legislative delays in passing Democratic initiatives on infrastructure, social spending and voting rights bills, Democrats’ approval sank to 38% by June 2021 and to 26% at the start of 2022.",
    "This spanned the Democratic Party securing majority control in both the House and Senate for the first time in over a decade, as well as Biden being sworn in as president.",
    "The midterm outlook is so grim for Democrats that 55 powerful House Democrats are reportedly stiffing the Democratic Congressional Campaign Committee (DCCC).",
    "As a result of the low approval rating, Democrats are struggling to maintain control of the chambers heading into the midterm elections.",
    "In April of 2021, Congress held a 31 percent approval rating amid President Biden’s costly spending package meant to combat coronavirus.",
    "Rep. Nancy Pelosi (D-CA) has reportedly attempted to collect the dues from her members, but Pelosi is struggling with her own problems.",
    "While the Democrats struggle to collect dues to fight Republicans, many Republicans believe the midterms will yield fantastic results.",
    "Top Republicans are already speaking up about potentially impeaching Biden if they successfully retake both congressional chambers.",
    "Her approval rating makes her the most unpopular Democrat politician, according to the National Republican Congressional Committee.",
    "According to Gallup:\nBetween December 2020 and February 2021, Democrats’ approval of Congress surged 50 percentage points to 61%.",
    "The members are failing to pay the dues they owe, likely because of the chances Republicans will retake the chamber.",
    "Seventy-six percent of Americans disapprove of the Democrat-controlled Congress, a Friday Gallup poll revealed.",
    "The Democrats’ 35 percent approval of Congress is higher than how independents view the legislative chambers.",
    "“I think that’s definitely a discussion we have to have,” Rep. Jim Jordan speculated last week.",
    "The poll surveyed 1,017 adults from March 1-18 with a ±4 percentage point margin of error.",
    "Yet the Democrat-led Congress is not struggling to overcome its self-inflicted challenges.",
    "Congress’s declining support is a result of Democrats bucking their own party.",
    "Congressional approval among Democrats has since partially rebounded to 35%.",
    "Just 21 percent approve of the way Democrats are running Congress.",
    "That package is widely believed to have fueled inflation instead.",
    "Among independents, only 18 percent approve of Congress.",
    "Congress’s approval has tanked in the last year.",
    "Only eight percent of Republicans approve."
  ]
}