{
  "id": 1062,
  "mediaId": 2528,
  "date": "2022-04-07",
  "headline": "Trump denies using burner phones on January 6: 'Why would I care about who called me?'",
  "image": "https://i.insider.com/5bf6e14d9e8c534a4c64d872?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/trump-denies-using-burner-phones-january-6-there-was-no-secret-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grace Panetta",
  "authorUrl": "https://www.businessinsider.com/author/grace-panetta",
  "termIds": [
    0
  ],
  "sentences": [
    "The Post and CBS News previously reported that the official White House switchboard records of Trump's phone calls on January 6 contain a more than a seven-hour gap from 11:27 am to 6:54 pm, a crucial period of time during which Trump spoke to supporters at a rally at the Ellipse, pressured Vice President Mike Pence to overturn the 2020 election, and recorded a video urging his supporters to stop their siege of the US Capitol.",
    "Axios further reported that Trump's then-executive assistant Molly Michael, who played a key role in documenting and keeping handwritten notes and records of Trump's daily schedule, calls, and meetings, was also out of office for most of January 6, undercutting the official documentation of his communications that day.",
    "Trump would normally place calls directly from a landline or cell phone and not through the official White House switchboard while in the Oval Office, CNN reported, a habit he developed to circumvent the watchful eye of former White House chief of staff John Kelly, who would often monitor Trump's calls.",
    "Reports in CNN and Axios suggest, however, that the missing seven hours of White House switchboard records were more likely a function of Trump's personal phone habits and the Trump White House's inconsistent record-keeping practices than a nefarious coverup to hide records.",
    "During that seven-hour gap of missing call log records, Trump also attempted to call Sen. Tommy Tuberville but instead called Sen. Mike Lee, the Guardian reported on the call that may have been placed directly from an Oval Office landline.",
    "The House select committee is probing whether Trump may have used aides' phones, burner phones, and other back channels to place and receive calls on January 6 that aren't documented in the official White House call records from that day.",
    "The official White House call logs, however, show that Trump was on the phone with numerous top aides, advisers, and lawyers on the morning of January 6 before heading to the Ellipse to speak at the \"Save America\" rally.",
    "Trump has consistently denied using burner phones, previously telling The Post and CBS that he had \"no idea\" what a burner phone was and, to the best of his knowledge, \"had never heard of the term.\"",
    "Trump spoke to Rep. Jim Jordan, former Sen. David Perdue, and Sen. Kelly Loeffler the morning before the riots, according to the records, and also unsuccessfully attempted to reach Sens.",
    "But Trump's former national security adviser John Bolton told The Post that Trump did, in fact, know what a burner phone was and had brought up the term multiple times in conversations.",
    "Former President Donald Trump denied using burner phones to conceal his call record on January 6, 2021, according to a Washington Post interview that was published on Thursday.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Mark Wilson/Getty Images\nIn a new Washington Post interview, Trump denied using burner phones to communicate on January 6.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "The House select committee is probing a seven-hour gap in White House phone records on the day of the Capitol riot.",
    "President Donald Trump is seen through a window speaking on the phone in the Oval Office of the White House.",
    "\"From the standpoint of telephone calls, I don't remember getting very many,\" Trump told The Post.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "If congressmen were calling me, what difference did it make?",
    "Stay up to date with what you want to know.",
    "There was no secret,\" Trump told The Post.",
    "Sign up for notifications from Insider!",
    "\"There was nothing secretive about it.",
    "\"Why would I care about who called me?",
    "There was nothing secretive about it.",
    "Mitch McConnell and Josh Hawley.",
    "Loading Something is loading.",
    "There was no secret.\""
  ]
}