{
  "id": 1069,
  "mediaId": 2664,
  "date": "2022-04-07",
  "headline": "Ted Cruz called out for his 'fake worrying about pretend pedophiles' as GOP becomes the QAnon party",
  "image": "https://www.rawstory.com/media-library/ted-cruz.jpg?id=28125365&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/republican-ted-cruz/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1603,
    1672,
    2943,
    3151,
    4628,
    4768,
    860,
    878,
    996
  ],
  "sentences": [
    "\"There's really no good reason not to confirm Judge Jackson to the Supreme Court, but that's just fine with republicans because they have no problem making up a bunch of absolutely f*cking goat sh*t,\" she said, airing a clips of Sens.",
    "\"Fake worrying about pretend pedophiles is an easy way for Republicans to score points with their base, especially with the recent rise of debunked, child abuse conspiracy theories,\" she said with a clip on QAnon.",
    "Sen. Ted Cruz (R-TX) was once again an object of derision on national television for his antics during his unsuccessful effort to stop the nomination of Judge Ketanji Brown Jackson to the U.S. Supreme Court.",
    "— Full Frontal with Samantha Bee (@Full Frontal with Samantha Bee) 1649383672\nWatch:\nNOW WATCH: Democratic senator brings receipts of Josh Hawley's record in epic floor speech\nStories Chosen For You",
    "\"It is absurd and infuriating to have to say this, but she — like every other person who has faced this recent allegation of choice from conservatives — is- in no way supportive of pedophiles.",
    "But, as much as QAnon has been debunked, it's still going strong, which means Republicans are more than comfortable Q-whistling to the stupidest people on the planet,\" she said.",
    "\"People like Ted Cruz and Lindsey Graham may cynically use this as a ploy, but there are scum-holes like Marjorie Taylor Greene (R-GA) who are true believers,\" Bee explained.",
    "Even though they don't believe a word they are saying, they know it's a winning strategy that has nothing to do with protecting kids, but everything to do with getting votes.",
    "Look, if Donald Trump was going to save us all from a cabal of satanic pedophiles, he could have knocked it out literally at any time in the four years of his presidency.",
    "Republicans are making baseless accusations because they have nothing else on which to fault her and they know they're acting in bad faith.",
    "She played a clip of Cruz talking over Jackson and said the Texas Republican was \"absolutely incapable of getting a woman to finish.\"",
    "It\\u2019s absolutely vital that the 83% of Americans who aren\\u2019t batshit insane make sure it doesn\\u2019t work.",
    "\"But the most hypocritical part of it is there are actually people in their own party who are endangering kids.\"",
    "\"Perhaps the most batsh*t part of all of this is Q-believers think only Donald Trump can put a stop it.",
    "\"Republicans are horrifically and disrespectfully attempting to twist Jackson's record,\" she explained.",
    "Otherwise, they wouldn't have acted to lose their damn minds every time Jackson tried to respond.\"",
    "She then played clips of Reps. Matt Gaetz (R-FL), Jim Jordan (R-OH), and Tennessee Republicans.",
    "Comedian Samantha Bee went after Cruz and Republicans on the TBS show \"Full Frontal.\"",
    "Which, if true, means this man is sure taking his f*cking time getting around to it.",
    "Marsha Blackburn (R-TN), Tom Cotton (R-AR), and Lindsey Graham (R-SC)."
  ]
}