{
  "id": 1076,
  "mediaId": 2745,
  "date": "2022-04-09",
  "headline": "House GOP leaders lack insight into Jan. 6 committee’s inner workings",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/H4LTNIRRJAI6ZABWPWZFLP7ROY.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/04/09/gop-jan-6/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Republicans have refrained from second-guessing House Minority Leader Kevin McCarthy (R-Calif.), publicly supporting his decision to pull out entirely from the Jan. 6 panel’s work once House Speaker Nancy Pelosi (D-Calif.) rejected two of his initial five choices for the committee.",
    "Even more important to their own personal interests, dozens of GOP lawmakers are left in the dark about what evidence the committee has collected involving their own contacts with Trump and his senior advisers in the run up to, and during, the attack on the Capitol.",
    "One by one, Republicans eviscerated the work of the House committee investigating the Jan. 6, 2021, attack on the Capitol, each one bemoaning the fact that the chief congressional security officials had not been subpoenaed to examine that day’s security lapses.",
    "\"Only democracies have real opportunity for the opposition to be heard.”\nIssa first rose to fame as the loyal opposition on the House Oversight and Reform Committee, the ranking Republican in the first two years of Barack Obama’s presidency.",
    "They point to how Democrats handled the whistleblower from the intelligence community who prompted the 2019 impeachment investigation into Trump, keeping the intelligence officer’s identity and communications shielded from Republicans.",
    "During the first Trump impeachment investigation, conducted by the intelligence committee in the fall of 2019, each side got one hour to question a witness, then 45 minutes per side, until all questions were asked.",
    "Republicans also complained that Democrats selectively released witness testimony that bolstered their case for impeachment while other transcripts that contradicted that case remained under seal for weeks.",
    "When Republicans created a select committee to investigate the 2012 attack on the U.S. Consulate in Benghazi, some pushed Pelosi to boycott — she instead chose Cummings to run point on the panel.",
    "Republicans think Pelosi and Democrats on the Jan. 6 committee were always going to bend precedents to drive this investigation wherever they wanted, leaving GOP members somewhat in the dark.",
    "As originally conceived, the 10-member panel of nongovernment officials would have been evenly divided with five appointments each coming from Democratic and Republican congressional leaders.",
    "McCarthy, rather than promising a clean slate next year if Republicans win the majority, has already laid out a plan of vengeance and promised to throw some Democrats off their committees.",
    "Almost always the minority has decided it was better to be on the inside scrapping with the majority — rather than standing on the outside wondering what was happening behind closed doors.",
    "“The rules have to work the best in the hardest cases, not change the rules in the hardest cases, and that’s exactly what happened,” Armstrong, a former federal public defender, said.",
    "In hindsight, McCarthy’s biggest mistake might have been backing away from creating an independent commission to investigate the Capitol attack along the lines of the 9/11 commission.",
    "“That is a decision that, I hope, no speaker will ever do again,” Issa said, “but if another speaker does it, and says that’s the precedent, then this body will be less good for it.”",
    "His feisty work drew attention to scandals from conservative activists and, once the GOP took the majority in early 2011, gave Issa a platform to explore those investigations.",
    "Cummings and his staff had similar access during the Benghazi probe and gave the Maryland Democrat a chance to forcefully challenge Republican attacks during public hearings.",
    "Without knowing precisely what the committee is doing and who it is talking to, Republicans have struggled to prepare lines of defense for former president Donald Trump.",
    "Under normal committee investigations, the minority party gets full participation in witness interviews and an open window into the documents turned over to the panel.",
    "Some Republicans believe that nothing would be different if any McCarthy picks served on the panel other than giving the investigation a more bipartisan appearance.",
    "“I think the biggest mistake has been turning against the independent commission,” Kinzinger said of McCarthy, noting the commission would have already disbanded.",
    "Pelosi broke all precedent in that move, as the majority and minority party have traditionally always picked their own slates for congressional committees.",
    "The legislation creating the commission passed the House in May, with just 35 GOP votes, then died in the Senate as Republicans filibustered the proposal.",
    "“In a democracy the opposition is more important than the management, because every government has people in charge,\" said Rep. Darrell Issa (R-Calif.).",
    "Jordan has publicly discussed that he was in contact with Trump on Jan. 6 and, some believe, should be a fact witness in the probe, not an investigator.",
    "Cummings, who died in 2019, paid a funny tribute to Issa when the Oversight Committee unveiled Issa’s portrait to go on its wall of former chairs.",
    "“They came voluntarily.”\nThe moment served as a reminder for Republicans that they have no insight into this powerful committee’s inner workings.",
    "Not interviewing these key officials was proof, they suggested, that the committee was just out to score political points against Republicans.",
    "With more than 60 percent of his conference voting against certifying President Biden’s victory, he picked three who voted that way on Jan. 6.",
    "But replacing the two staunch conservatives aligned with Trump would have set a bad precedent that silenced conservative voters, she said.",
    "Every few years the House minority has been tempted to boycott seemingly partisan investigations of a president from its party.",
    "“We have in fact interviewed precisely the people they set up as a test for the validity of our investigation,” Raskin said.",
    "Some members of the committee think McCarthy got a short-term morale boost with his decision but lost out in the long run.",
    "His other two picks — Rep. Kelly Armstrong (N.D.) and Rep. Rodney Davis (R-Ill.) — voted to certify Biden’s clear victory.",
    "Subpoenas would have required bipartisan support, and the panel would have had until Dec. 31, 2021, to finish its work.",
    "McCarthy’s picks included three members who voted against certifying President Biden’s victory: Reps. Jim Banks (Ind.",
    "“There was only one decision, which was her decision to throw our selections off — which is unprecedented,” he said.",
    "Those top security officials “didn’t need a subpoena” to testify about that horrible day’s events, Raskin said.",
    "“He made a huge mistake pulling everybody off, from a strategy perspective,” said Rep. Adam Kinzinger (R-Ill.).",
    "“That man done made you famous.”\nBut Issa blamed Pelosi for starting this new fight over the Jan. 6 committee.",
    "shut down that line of debate on Wednesday with some information these Republicans did not seem to know.",
    "“You’d end up with a report, it wouldn’t be in the public eye as much, it wouldn’t be as political.\"",
    "He decided to submit the original five names, trying to compile a cross section of his conference.",
    "Last summer McCarthy weighed the same considerations as Pelosi did over the Benghazi panel.",
    "into the top Democratic spot on the oversight panel, giving Obama a counterbalance to Issa.",
    "), two anti-Trump Republicans, to serve on the committee to give it a bipartisan veneer.",
    "“Could you have made an argument that we should have submitted a second set of names?",
    "“Don’t be mad at that man,” Cummings recalled his 88-year-old mother telling him.",
    "Pelosi rejected Jordan and Banks without ever giving a full explanation.",
    "Pelosi handpicked Kinzinger and Rep. Liz Cheney (R-Wyo.",
    "Pelosi moved then-Rep. Elijah E. Cummings (Md.)",
    "), Jim Jordan (Ohio) and Troy E. Nehls (Tex.).",
    "Finally, Rep. Jamie Raskin (D-Md.)",
    "Possibly,” said Armstrong."
  ]
}