{
  "id": 1097,
  "mediaId": 2745,
  "date": "2022-03-31",
  "headline": "McCarthy tries to navigate splintering divide among House Republicans",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MJTNL4UZQII6ZGMHTXHO4YVD6Y.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/31/mccarthy-cawthorn/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2298,
    2817,
    2976,
    3267,
    4384,
    872,
    878,
    4887,
    5390
  ],
  "sentences": [
    "“When you actually run on a platform, here’s what we care about, here’s what we’re going to do because the American people care about that —- that will help keep the team together and accomplishing what we told the people we were going to do when we ran for the job and the reason why they’re gonna put us in the majority and make Kevin speaker,” Rep. Jim Jordan (R-Ohio) said last Friday in Ponte Vedra, Fla.\nFor Sen. Thom Tillis (R-N.C.) Cawthorn’s latest comments were not the tipping point for him.",
    "I mean, a lot of people say things up here that are just kind of crazy talk.”\nHe told all his colleagues that they all better prioritize behaving from now to the midterms, noting their singular focus should be on “not bringing negative attention to ourselves.”\nA Republican in the room said that when Womack spoke up, members audibly groaned and grumbled, expressing that they too were upset by Cawthorn’s remarks and how it implicated them.",
    "Cawthorn responded by talking about the “sexual perversion that goes on in Washington.”\n“I mean, being kind of a young guy in Washington, where the average age is probably 60 or 70 — you know, I look at all these people, a lot of them that I’ve always looked up to through my life, always paid attention to politics, guys that, you know.",
    "We don’t need to literally destroy the possibilities of really making some positive change.”\nGOP members and aides, most of whom spoke on the condition of anonymity to discuss private conversations, noted that McCarthy is publicly more vocal when a majority of his conference is united against the behavior of a particular colleague.",
    "“As far as some of this goes — which sometimes is nonsensical, sometimes it’s personality conflict, sometimes it’s just some folks that are a little weird, I don’t know how else to say it — I think it’s best to try and deal with it internally and see if you can bridge those gaps,” Rep. Jeff Van Drew (R-N.J.) said.",
    "McCarthy listed other unbecoming behavior that Cawthorn has displayed: driving on a suspended license earlier this month, calling Ukrainian President Volodymyr Zelensky a “thug” amid Russia’s violent invasion and lying to a Capitol Police officer in an attempt to sneak a GOP candidate onto the House floor.",
    "McCarthy has hosted similar private meetings after other Republican members aligned with former president Donald Trump stole attention away from his agenda — for example, when two members recently addressed a white nationalist event — but this time, he did something different: He talked openly about it.",
    "“The fact that he would leave, move on to another district 11 months into his current tenure; and some of his comments, at the worst possible time on Ukraine, calling Zelensky a thug; they just speak to a lack of judgment that I expect more of a member in our congressional delegation,” Tillis said.",
    "“And then you realize they’re asking you to come to an orgy.”\nCawthorn also claimed that he had witnessed “people that are leading on the movement to try and remove addiction in our country” consume “a key bump of cocaine right in front of you.”\nRep. Steve Womack (R-Ark.)",
    "Rep. Madison Cawthorn (R-N.C.) was called into a private meeting with House Minority Leader Kevin McCarthy (R-Calif.) this week to discuss his outlandish accusation that prominent political players had invited him to orgies and done “a key bump of cocaine” as he watched.",
    "Some of his critics say that McCarthy’s approach is based on his ambitions to be speaker if Republicans regain control of the House in the midterm election this fall and the need to appease a majority of his conference, including the most rambunctious members.",
    "He did not tell the truth.”\nMcCarthy has made clear that he believes the pathway to regaining the majority requires Republicans to present a united front and keep the public focused on the Democrats’ intraparty fights rather than those within his own party.",
    "When members began to complain that Cheney’s constant criticism about Trump was becoming too much of a distraction about a year ago, McCarthy endorsed the movement to remove her as conference chair, as she no longer resonated with her colleagues.",
    "But there’s a splintering divide among House Republicans between staunch Trump allies who tend to offend more than legislate and members who have grown restless over McCarthy’s lack of an upper hand with the former group.",
    "He did not publicly condemn Greene when she posted the office number of 13 Republican colleagues who voted for the infrastructure bill, which led to members receiving violent threats against them and their families.",
    "McCarthy has also met privately with Rep. Marjorie Taylor Greene (R-Ga) and Rep. Paul A. Gosar (R-Ariz.) following their numerous offenses, most recently when both addressed attendees at a white nationalist event.",
    "Republicans also demurred that Cawthorn’s remarks brought unwanted attention to the conference just days after retreat in Florida, where members worked to finalize issue policies they believe would unite them.",
    "Cawthorn, who on Friday was announced as a speaker at a Trump rally on April 9 in Selma, N.C., has remained defiant and has not recanted his tale of a Washington filled with “sexual perversion” and drugs.",
    "Many Republican members have a similar mentality to McCarthy, saying that dealing with intraparty riffs behind closed doors diminishes the chances of giving even more oxygen to a colleague’s bad behavior.",
    "In an interview last week with the “Warrior Poet Society” podcast, Cawthorn was asked whether the hit television show “House of Cards” was an accurate reflection of life in the nation’s capital.",
    "I’m not going anywhere.”\nMcCarthy met privately with Rep. Matt Gaetz (R-Fla.), a Trump ally who is being investigated for potentially violating sex-trafficking laws, accusations he has denied.",
    "He listed multiple reasons Cawthorn lost his trust, including the congressman’s decision to declare he would compete in a neighboring district, only to jump back into his race weeks later.",
    "He wants to focus on telling voters exactly how Republicans will introduce needed legislation and hold the Biden administration accountable, and he doesn’t want that message overshadowed.",
    "McCarthy acknowledged the same, telling reporters that Cawthorn’s repeated patterns and consistent lying to spin his way out of problems is not the way to behave on Capitol Hill.",
    "“The radical left, the establishment, and the media want to take me down,” Cawthorn tweeted on Thursday, even though the challenges have been coming from within his own party.",
    "He’s told me he’s innocent of the accusations,” McCarthy told reporters last year after previously pledging to remove Gaetz from committees if the allegations proved true.",
    "He said that during their meeting, Cawthorn denied knowing what cocaine is after suggesting he had seen a congressional staffer using the drug in a garage 100 yards away.",
    "A similar scenario played out with Cawthorn as members, including those who typically do not complain, expressed their outrage when they returned to Washington this week.",
    "During the retreat in Florida last week, McCarthy often touted the need to not just win the majority next year, but to ensure that a “governing majority” is prioritized.",
    "Members and aides privately acknowledged that also means electing candidates who prioritize legislating over publicity that could make a potential speakership difficult.",
    "Instead, McCarthy told colleagues at a weekly conference meeting to stop attacking one another and drawing unwanted attention, according to numerous aides in the room.",
    "“Those remarks were very unfortunate, a terrible exaggeration of the truth, and that if you’re going to make an accusation like that, name names; just name names.",
    "Fed up with the antics, Tillis on Thursday endorsed state senator Chuck Edwards over Cawthorn in primary race in North Carolina’s 11th Congressional District.",
    "He said Tuesday was only the third time during his decade-long career on Capitol Hill that he stood up during a weekly GOP conference to say something.",
    "“I’ve not had anything really get to me quite like the remarks made by my colleague from North Carolina in the time that I’ve been here,” he said.",
    "But he has also promised to reassign both members to committees after Democrats stripped them of that right following numerous controversies.",
    "“It’s not because there haven’t been other things said, by him or anybody else, that would be judged as nonsensical or out of line.",
    "Then all of the sudden you get invited to, like, ‘Oh hey, we’re going to have kind of a sexual get-together at one of our homes.",
    "“This is unacceptable and there is no evidence to this, he changes what he tells and that’s not becoming of a congressman.",
    "“I mean he’s got to turn himself around,” McCarthy told reporters on Wednesday, soon after the closed-door meeting.",
    "For months, McCarthy has proudly punished those who voted to impeach Trump, particularly Reps. Liz Cheney (R-Wyo.)",
    "And spare the people like me who kind of live boring lives, I’m in bed by 9 o’clock every night,” Womack added.",
    "“In the process, there was just no evidence that he provided that make me think that that story is right.",
    "McCarthy called their attendance “unacceptable,” stressing that the party does not embrace those values.",
    "You should come,’ ” Cawthorn, 26, said in the interview, which was reported Sunday by Business Insider.",
    "McCarthy previously said he still supported Cawthorn’s reelection following his anti-Ukraine remarks.",
    "But the Republican leader stopped short of punishing Cawthorn, allowing him to remain on committees.",
    "does not consider himself one to call out his own colleagues or cause much of a stir.",
    "It struck some members as McCarthy needing to do more to discipline the group.",
    "But when pressed on it Thursday, McCarthy dodged the question.",
    "“We talked about Madison yesterday,” McCarthy told reporters.",
    "They want to silence the America First movement.",
    "“I’ve spoken to Mr. Gaetz about the accusations.",
    "He continued, “You know what we don’t need?",
    "We don’t need a circular firing squad.",
    "We don’t need to beat each other up.",
    "“Their attacks have been relentless.",
    "It’s not that he doesn’t know how.",
    "We’re going to get the majority.",
    "This time it was about Cawthorn.",
    "and Adam Kinzinger (R-Ill.).",
    "I won’t bow to the mob.",
    "I won’t stop fighting."
  ]
}