{
  "id": 1105,
  "mediaId": 2746,
  "date": "2022-04-07",
  "headline": "GOP: Move by ex-WH lawyer raises questions about dividing Taliban assets among 9/11 victims",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/07/AP19325552911097_c0-213-5098-3186_s1200x700.jpg?f3fb5d326948c8f3203009c3a23e72a344652028",
  "link": "https://www.washingtontimes.com/news/2022/apr/7/gop-move-ex-wh-lawyer-raises-questions-about-divid/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Mordock",
  "authorUrl": "https://www.washingtontimes.com/staff/jeff-mordock/",
  "termIds": [
    1670,
    2857,
    3077,
    3975,
    878,
    1003,
    4811,
    5046
  ],
  "sentences": [
    "Republicans say the administration’s decision has the “perception of impropriety.”\n“There are also serious questions about the Biden White House’s four-month employment of an attorney who now, as a counsel for the Havlish Plaintiffs in private practice, stands to reap a windfall in attorney’s fees,” the lawmakers wrote.",
    "Given his past representation of the victims of 9/11, he was specifically recused and walled off from any and all discussions related to any litigation related to the victims of 9/11, including but not limited to the disposition of the Afghan reserves at the Federal Reserve Bank of New York,” the statement said.",
    "House Republicans are urging President Biden to equally divide the $3.5 billion in assets seized from the Taliban among 9/11 victims, after reports surfaced that a former White House lawyer has moved to secure the bulk of the funds for his clients.",
    "The letter calls on Mr. Biden to rescind his Feb. 11 executive order, which split $7 billion in seized Afghan reserves between those suffering from the humanitarian crisis in Taliban-controlled Afghanistan and victims of the 9/11 attacks.",
    "In September, a federal judge approved a writ of execution to the Federal Reserve in New York to seize the $7 billion to cover the judgment the plaintiffs had won nearly a decade earlier.",
    "The group is represented by Lee Wolosky, a lawyer with Jenner & Block who advised the White House during a four-month stint as a special counsel to the National Security Council.",
    "The Havlish plaintiffs won a default judgment against the Taliban in 2011, but their claim languished for years because the Taliban was out of reach of the U.S. and had no money.",
    "The Republicans have asked the White House for documents related to the distribution of the seized funds and all materials related to Mr. Wolosky’s work for the administration.",
    "But a group known as the Havlish plaintiffs, which include those injured or who lost a loved one on 9/11, could wind up with most of the funds.",
    "After the militant group rose to power in Afghanistan last August, the Havlish plaintiffs reasserted their claim to the funds.",
    "The Biden administration intervened and said it would decide how to disburse the money in the best interests of the nation.",
    "Within days of leaving the White House, Mr. Wolosky appeared in a court filing as an attorney for the Havlish plaintiffs.",
    "Republican Reps. Jim Jordan of Ohio, Nicole Malliotakis of New York and Mike Johnson of Louisiana signed the letter.",
    "In February, it decided the money will be split between the Havlish plaintiffs and aid for Afghans.",
    "“Lee Wolosky’s service as an SGE at the White House Counsel’s Office ended on January 6, 2022.",
    "Lee was formally recused from all matters related to Jenner & Block during his time as an SGE.",
    "A spokesperson for Mr. Wolosky referred to a White House statement issued several weeks ago.",
    "Mr. Wolosky would potentially reap millions in legal fees under the decision."
  ]
}