{
  "id": 1144,
  "mediaId": 2526,
  "date": "2022-04-04",
  "headline": "Democrat Strategist: U.S. Has ‘Lost Confidence’ in Joe Biden, ‘Heading into a Recession’",
  "image": "https://media.breitbart.com/media/2022/01/president-joe-biden-jan-21-2022-dc-getty-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/04/democrat-strategist-us-lost-confidence-joe-biden-heading-recession/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    3575,
    3975,
    4711,
    305,
    878,
    1171,
    5371
  ],
  "sentences": [
    "During Biden’s presidency, more than two million migrants have been apprehended at the southern border, fentanyl became the greatest killer among 18- to 45-year-olds, gas prices increased to all-time highs, weekly wages shrank, supply chain woes have persisted, and the deadly Afghan withdrawal deeply embarrassed the nation.",
    "“But with only a quarter of the country believing things are headed in the right direction, the president sitting at a 40 or 42 [percent] approval and inflation at a 40-year high, the atmosphere clearly is not promising for Democrats to buck historical trends.”\nBiden is not just suffering from inflation.",
    "Biden’s administration has coined the terms “Putin’s price hike” and “Putin’s gas hike.” But those communication gimmicks have not improved America’s economic position or Biden’s approval rating.",
    "“At least going into the midterm, these poor perceptions of his leadership and the inflationary pressures will weigh him and the Democrats down.”\nPolls show that Zelizer is correct.",
    "Inflation, which has reached a 40-year-high, the worst in a generation, is costing American households on average an extra $5,200 in 2022, or $433 per month, according to Bloomberg.",
    "Americans are so pessimistic about the direction of the country that Republicans have begun to weigh if Biden is weak enough to impeach for failing to enforce border security laws.",
    "“At times it feels like we’re spinning our wheels.”\nWith the midterms in November, Biden is in a race against the clock to restore the nation from his failed economic policies.",
    "“In terms of Biden, I think these can only be called rough political times,” Julian Zelizer, a Princeton University professor of history and public affairs, said.",
    "President Joe Biden is taking heat from his own party on Monday over fears that inflation will destroy Democrats’ majorities in the House and Senate.",
    "The American people have lost confidence in him.”\nBiden has blamed the massive price hikes on Russian President Putin’s war in Ukraine.",
    "“I think that’s definitely a discussion we have to have,” Rep. Jim Jordan said two weeks ago in relation to winning back the House.",
    "Polls show Biden’s average approval ratings are in the high thirties, a very low number heading into the midterm elections.",
    "The poll is significant because it reveals the party for which Americans will vote without knowing the specific candidate.",
    "Biden also kept coronavirus restrictions on businesses throughout 2021, further hurting the economy’s supply chain.",
    "“You have an energy crisis that’s paralyzing and inflation is at a 40-year high and we’re heading into a recession.",
    "Last year, Biden and the Democrats passed a massive stimulus package, which many experts believe fueled inflation.",
    "“For whatever reason, the messaging hasn’t gotten through,” an administration official acknowledged to the Hill.",
    "“Things could change,” David Axelrod, an adviser to former President Barack Obama, told Politico.",
    "According to a January poll, Republicans led Democrats on a generic ballot by 12 points.",
    "Seventy-one percent of Americans believe the nation is headed in the wrong direction.",
    "“It’s bad,” a Democrat strategist told the Hill.",
    "The problem is simple."
  ]
}