{
  "id": 1187,
  "mediaId": 2641,
  "date": "2022-04-07",
  "headline": "Trump: I Wanted to March to the Capitol on Jan. 6",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=dcd1faaf-2887-4c4c-b80f-d7b80bb9312f&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/trump-jan-6-march-capitol/2022/04/07/id/1064702/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeffrey Rodack",
  "authorUrl": "",
  "termIds": [
    2201,
    2599,
    3267,
    3299,
    3434,
    4109,
    180
  ],
  "sentences": [
    "Drew Hammill, a spokesman for Pelosi, responded, telling the Post: “The former president’s desperate lies aside, the speaker was no more in charge of the security of the U.S. Capitol that day than Mitch McConnell.\"",
    "And I said, ‘It’s got to be taken care of,’ and I assumed they were taking care of it.”\nThe Post noted that Pelosi shares control of the Capitol with the Senate majority leader.",
    "There was no secret.”\nMeanwhile, a review of Trump's Jan. 6, phone logs found that a seven-hour gap likely is not as eye-opening as critics claimed, CNN reported Friday.",
    "Trump claimed the panel’s interview with his daughter, Ivanka, was a “shame and harassment.” However, he insisted he did not know what committee members had asked her.",
    "“From the standpoint of telephone calls, I don’t remember getting very many,” he said, later adding, \"Why would I care about who called me?",
    "Former President Donald Trump said he wanted to march to the Capitol after his rally on Jan. 6, 2021, but Secret Service stopped him.",
    "A source told CNN that six pages of White House switchboard logs for Jan. 6 were complete based on an official review of records.",
    "Trump said he remembered talking to House Minority Leader Kevin McCarthy, R-Calif., and Rep. Jim Jordan, R-Ohio, and others.",
    "“I would have gone there in a minute.”\nSome of the marchers stormed the Capitol as violence broke out outside the building.",
    "The Post said it came 187 minutes after he had urged them to march to the Capitol during a rally near the White House.",
    "Trump said he does not recall “getting very many” phone calls on Jan. 6 and insisted he did not remove any call logs.",
    "But this was a tremendous crowd.”\nTrump said the select committee probing the Jan. 6 events has not contacted him.",
    "“I thought it was a shame, and I kept asking why isn’t she doing something about it?” he said.",
    "The violence at the Capitol came shortly after the rally, where Trump spoke to a large crowd.",
    "Trump blamed House Speaker Nancy Pelosi, D-Calif., for letting things get out of hand.",
    "Trump’s comments in the interview with The Washington Post were published Thursday.",
    "He said he didn't know what he would do if the panel did request his assistance.",
    "They don’t want to show pictures; the fake news doesn’t want to show pictures.",
    "Trump eventually released a video asking supporters to go home.",
    "I don’t know what that means, but you see very few pictures.",
    "If congressmen were calling me, what difference did it make?",
    "“ I believe it was the largest crowd I’ve ever spoken to.",
    "“The crowd was far bigger than I even thought,” he said.",
    "“The mayor of D.C. and Nancy Pelosi are in charge.",
    "“Why isn’t Nancy Pelosi doing something about it?",
    "“Secret Service said I couldn’t go,” Trump said.",
    "“It depends what the request is,” he said.",
    "There was nothing secretive about it.",
    "And the mayor of D.C. also.",
    "I hated seeing it.",
    "I hated seeing it.",
    "Special Links:"
  ]
}