{
  "id": 1255,
  "mediaId": 2550,
  "date": "2022-04-08",
  "headline": "Trump Jr. pitched 'very simple' plan to White House to overturn 2020 election",
  "image": "https://images.dailykos.com/images/1041831/story_image/GettyImages-1155197246.jpg?1645814981",
  "link": "https://www.dailykos.com/stories/2022/4/8/2090900/-Trump-Jr-pitched-very-simple-plan-to-White-House-to-overturn-2020-election?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1886,
    1902,
    2201,
    2851,
    2906,
    3051,
    3975,
    4599
  ],
  "sentences": [
    "In a series of messages exclusively obtained and reviewed by CNN on Friday, Donald Trump Jr. reportedly sent texts to former White House chief of staff Mark Meadows with ideas about how his father, Donald Trump, could stay in power even before the official results of the 2020 election were called.",
    "The president’s son wanted Ric Grenell to replace Wray despite having zero experience and Attorney General Bill Barr to serve as a “special prosecutor on HardDrivefromHell Biden crime family,” the text shows\nBarr ultimately refused to investigate the Bidens.",
    "“We either have a vote WE control and WE win OR it gets kicked to Congress 6 January 2021.”\nIf the alternate elector bid didn’t work, Trump Jr. made the baldly unconstitutional proposal that Congress simply hold a vote on Jan. 6 to reinstall Trump.",
    "RELATED STORY: Trump led a criminal conspiracy, Jan. 6 lawyers say in court\nAccording to CNN, the Nov. 5 text from Trump Jr. echoed similar strategies put forward by election subversion strategist and conservative attorney John Eastman.",
    "[Punctuation original]\nRELATED STORY: More evidence of Jan. 6 election subversion scheme mounts\nHe also allegedly called for FBI Director Christopher Wray and Anthony Fauci, Trump’s White House adviser on the pandemic, to be fired.",
    "In Trump Jr.’s reported text, he too said that key battleground states must be recounted and recertified with “Trump electors.”\n“Republicans control 28 states Democrats 22 states.",
    "Eastman urged the Trump White House to have then-Vice President Mike Pence stop the counting of electoral votes and consider “alternate electors” for Trump.",
    "Incidentally, when the Jan. 6 committee exposed text messages sent by Rep. Jim Jordan of Ohio to Mark Meadows, Jordan said the same had occurred.",
    "RELATED STORY: Witness: Meadows and Jan. 6 rally organizers had deliberate scheme in place\nThis is a short blurb about Daily Kos.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Alan Futerfas, an attorney for the president’s eldest son, told CNN the message to Meadows was a forward.",
    "Given the date, this message likely originated from someone else and was forwarded,” Futerfas said.",
    "It is unclear if the Jan. 6 Committee had previously obtained the text messages reported on by CNN.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "President-elect Joe Biden would not be declared the official winner until Nov. 7.",
    "“After the election, Don received numerous messages from supporters and others.",
    "We control them all,” Trump Jr. reportedly wrote to Meadows on Nov. 5, 2020.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "A spokesman did not immediately return a request for comment Friday.",
    "Notably, Barr did not find fraud had occurred in the 2020 election.",
    "Moral High Ground POTUS must start 2nd term now,” Trump Jr. wrote.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "He resigned about a month after Trump Jr’s text.",
    "“We have operational control Total leverage.",
    "Once again Trump wins,” the message said.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "We have multiple paths.",
    "“It’s very simple.",
    "Please read it."
  ]
}