{
  "id": 1259,
  "mediaId": 2662,
  "date": "2022-03-31",
  "headline": "House Judiciary Republicans Launch Investigation Into Facebook and Twitter For Blocking Links to Hunter Biden’s Laptop From Hell Story",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/IMG_9031.jpg",
  "link": "https://www.thegatewaypundit.com/2022/03/house-judiciary-republicans-launch-investigation-facebook-twitter-blocking-links-hunter-bidens-laptop-story/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Laila",
  "authorUrl": "https://www.thegatewaypundit.com/author/cristina/",
  "termIds": [
    3102,
    3267,
    3975,
    364,
    878,
    1094,
    1161
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nRepublican lawmakers accused Twitter and Facebook of helping shield Joe Biden from “increased scrutiny about the impropriety detailed in the Post article.”\n“Shortly before the 2020 election, Twitter suppressed an explosive New York Post article detailing how Hunter Biden used the position and influence of his father, now-President Biden, for personal gain, with the apparent awareness of President Biden.",
    "Now, with even the New York Times confirming the accuracy of the Post’s reporting,2 we are investigating Twitter’s actions to interfere in free and fair election-related public discourse on its platform to the benefit of President Biden and the detriment of former President Trump.” the Republicans wrote in a letter to Twitter CEO Parag Agrawal.",
    "“Big Tech, Big Democrat Party and Big Media all colluded to keep critical information from the American people in the run up to the most important election we have — the presidential election, so we’re launching an investigation,” Jim Jordan said.",
    "House Judiciary Republicans launched an investigation into Twitter and Facebook for blocking links to articles about Hunter Biden’s laptop from hell shortly before the 2020 election.",
    "Recall, the New York Post was locked out of Twitter and unable to post stories after they dropped an October surprise on the Biden campaign one month before the 2020 election.",
    "The New York Post obtained a hard drive from Hunter Biden’s abandoned laptop and Big Tech went into overdrive to suppress the story in an effort to protect Joe Biden.",
    "Ranking Member Jim Jordan (R-OH) said Big Media deliberately suppressed the Hunter Biden laptop from hell story Thursday morning on Fox Business.",
    "We wrote to Twitter at the time with important questions about Twitter’s knowing suppression of First-Amendment protected activity.",
    "Twitter ignored our letter and, in the months since, has avoided any meaningful accountability for its actions.",
    "Emails found on Hunter Biden’s laptop show the inner workings of the Biden crime family.",
    "A similar letter was also sent to Facebook CEO Mark Zuckerberg."
  ]
}