{
  "id": 1264,
  "mediaId": 2570,
  "date": "2022-04-06",
  "headline": "House Holds Ex-Trump Officials Peter Navarro And Dan Scavino In Contempt—Criminal Charges Could Follow",
  "image": "",
  "link": "https://www.forbes.com/sites/annakaplan/2022/04/06/house-holds-ex-trump-officials-peter-navarro-and-dan-scavino-in-contempt-criminal-charges-could-follow/?sh=47d4619cbb52",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Kaplan",
  "authorUrl": "https://www.forbes.com/sites/annakaplan/",
  "termIds": [
    0
  ],
  "sentences": [
    "A lawyer for Scavino declined to comment to Forbes, but he said remarks by House Minority Leader Kevin McCarthy (R-Calif.)—who called the January 6 committee’s investigation a “political show trial” prior to the vote—“summarize our position fairly well.”\nA representative for Navarro referred Forbes to a statement last week in which Navarro said he had not broken any laws and insisted what happened on January 6 was “the last outcome Donald Trump and I wanted.”\nThe contempt resolution will be sent to the Department of Justice for possible criminal charges.",
    "That’s the point we’re trying to make… Democrats are leading by example, the select committee is leading by example, by bringing these two gentlemen who broke the law, who decided that it’s better to deal with the law of Donald Trump rather than the Constitution of the United States of America.”\nSome Republican legislators attempted to cast the vote as a referendum on broader partisan issues.",
    "Topline\nThe House of Representatives voted Wednesday to recommend that the Justice Department bring contempt charges against former White House trade advisor Peter Navarro and director of social media Dan Scavino Jr. for failing to comply with subpoenas issued by the January 6 committee investigating the riot at the Capitol.",
    "In a six-minute address, Rep. Jim Jordan (R-Ohio) raised in rapid succession the topics of inflation, crime rates, immigration from Mexico, gas prices, police funding, the Mueller report, the origins of Covid-19, Hunter Biden’s laptop, Black Lives Matter, big tech influence on the media and the effectiveness of vaccines.",
    "After Navarro was subpoenaed in February, his legal team contended he could not cooperate with the committee because of former President Donald Trump’s invocation of executive privilege, a legal doctrine that allows presidents to keep some internal communications secret.",
    "The January 6 committee has expressed interest in hearing from Navarro, as he published details of a plan to “snatch a stolen election” in his book, In Trump Time, though the committee alleged he “stonewalled” their attempts to contact him.",
    "The vote comes after members of the January 6 committee unanimously voted last week to hold the two former Trump officials in contempt after they failed to follow subpoenas issued by the committee to appear and provide information.",
    "Navarro wrote in a letter to a separate House committee investigating the Covid-19 pandemic that he considered Trump’s directive to protect executive privilege as “a direct order,” even though he no longer works for Trump.",
    "The DOJ indicted Bannon on two counts of criminal contempt charges in November—making him the first person charged with contempt of Congress since 1983—while Meadows has not been charged with a crime.",
    "The January 6 committee has interviewed more than 800 witnesses and subpoenaed dozens of former Trump officials as the panel investigates the events leading up to, and after, the riot at the Capitol.",
    "Witnesses who refuse to comply with congressional subpoenas can face up to one year in prison and up to a $100,000 fine, according to federal law, if they are found guilty of the crime.",
    "Scavino was subpoenaed in September over “materials relevant to his videotaping and tweeting” messages on the day of the attack, but Committee chair Rep. Bennie Thompson (D-Miss.)",
    "While the committee has said federal prosecutors have a duty to present contempt of Congress charges to a grand jury, the DOJ has not always filed charges against witnesses.",
    "Thompson dismissed Republicans’ objections, remarking that it was “absurd” that there should be any disagreement about the purpose of the resolution.",
    "The first two were sent to former White House strategist Steve Bannon and former White House Chief of Staff Mark Meadows last year.",
    "Key Facts\nThe House voted 220-203 to recommend charges for Navarro and Scavino, with two Republicans joining 218 Democrats.",
    "That’s how many contempt referrals the House has sent to the Department of Justice stemming from the January 6 probe.",
    "said Scavino “strung us along for months” before refusing to cooperate.",
    "President Joe Biden waived executive privilege for Navarro last month.",
    "“If they break the law, they break the law,” Thompson said.",
    "Bannon has pleaded not guilty.",
    "“No one’s above the law.",
    "4."
  ]
}