{
  "id": 1279,
  "mediaId": 2699,
  "date": "2022-04-06",
  "headline": "Republicans Are Clueless About Living in a Glass House",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1649297583/210406-gop-glass-houses-tease-01_d4a2ai",
  "link": "https://www.thedailybeast.com/republicans-are-clueless-about-living-in-a-glass-house?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Margaret Carlson",
  "authorUrl": "https://www.thedailybeast.com/author/margaret-carlson",
  "termIds": [
    1670,
    2166,
    2338,
    2407,
    2514,
    3007,
    4628,
    878,
    1171
  ],
  "sentences": [
    "How could Republicans (including Trump and Senate Minority Leader Mitch McConnell) endorse the bid of former NFL star and reputed serial domestic abuser Herschel Walker’s to unseat Sen. Rafael Warnock in Georgia, unless they're blinded by needing to prove they’re not racist by backing a Black celebrity?",
    "There’s no record of Huckabee’s forgiveness, or not, when six years later Duggar was arrested on child pronography charges for content the arresting agent called among the “worst of the worst\" he’d ever seen, featuring as it did a baby just 18 months old.",
    "Meanwhile Rep. Marjoie Taylor Greene—notorious before she even took office for her QAnon sympathies—is screaming that anyone who votes for the confirmation of Judge Ketanji Brown Jackson is “pro-pedophile,” including three Republicans.",
    "In 1997, House Speaker Newt Gingrich tried to drive Bill Clinton from the Oval Office for having an affair with an intern—all while Gingrich himself was having an affair with a committee staffer.",
    "Do they not remember Dennis Hastert—who was House Speaker for eight years—went to prison for abusing four boys and attempting to defraud a bank out of $3.5 million to keep one of them silent?",
    "Team captain Adam DiSabato testified before the Ohio legislature that Jordan called him “crying, groveling, begging me to go against my brother, begging me, crying for a half-hour.",
    "What about Judge Roy Moore, who pursued girls as young as 13 when he was in his thirties so flagrantly that, according to numerous sources, he was banned from a local mall?",
    "Mike Huckabee “forgave” Josh Duggar, family values activist and star of 19 Kids and Counting after he admitted to molesting five young girls, two of them his own sisters.",
    "When a lawsuit against Ohio State, brought by nearly 300 plaintiffs, goes to trial, the congressman may be called to account under oath for his actions, or lack of them.",
    "They’re widely expected to win big in the midterm elections, but if they stick with this crackpot strategy, they’re going to snatch defeat from the jaws of victory.",
    "That would be an unusual strategy under any circumstances, but truly bizarre considering the folks in politics most-associated with pedophilia are all Republicans.",
    "Almost as crazy as accusing Democrats of what they’ve been doing themselves, is putting up candidates accused of different, but just as disturbing offenses.",
    "(Even after the allegations against Moore were made public, then-President Donald Trump still backed him in his losing race for U.S. Senate from Alabama.)",
    "Walker’s been credibly accused by his wife and girlfriend of threatening their lives—with his wife saying the Senate hopeful even put a gun to her head.",
    "Members of those teams charged Jordan with refusing their appeals to stop Dr. Richard Strauss from sexually abusing them (Jordan denies these charges).",
    "It was clear that the party had dispensed with any coherent ideology on which to run when they declined to even put forward a platform in 2016.",
    "According to the AP, there were 2,200 instances of fondling and 127 instances of rape attributed to Strauss, who died in 2005.",
    "Have they forgotten former Rep. Mark Foley, who tried to seduce teenage boys whom he met when they were congressional pages?",
    "Sitting Ohio Rep. Jim Jordan, a MAGA favorite, was once an assistant wrestling coach at Ohio State University in the 1990s.",
    "Maybe Republicans know something we don’t, have something up their sleeve we can’t see, or have nothing else to say.",
    "The party has decided to make the midterms all about wild accusations surrounding pedophilia.",
    "Republicans are projecting so loudly, no one can hear anything else they’re saying.",
    "Republicans’ race to take back the House and Senate has taken the strangest twist.",
    "That’s the kind of cover-up that’s going on there.\"",
    "Republicans don’t shrink from hypocrisy.",
    "Former Arkansas Gov.",
    "Have at it."
  ]
}