{
  "id": 1284,
  "mediaId": 6676,
  "date": "2022-04-06",
  "headline": "Trump gets attention for saying he lost election",
  "image": "https://www.wkrg.com/wp-content/uploads/sites/49/2022/04/Trump-speaks.jpg?w=1280",
  "link": "https://www.wkrg.com/national/trump-gets-attention-for-saying-he-lost-election/",
  "mediaOutlet": "wkrg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelsey Carolan",
  "authorUrl": "https://www.nxsttv.com/nmw/?post_type=profile&p=173669",
  "termIds": [
    1355,
    2201,
    2202,
    3975,
    4599,
    4984,
    5145,
    5402
  ],
  "sentences": [
    "“I didn’t win the election,” Trump, who has repeatedly rejected President Joe Biden’s victory, said while speaking in July to a panel of historians convened by Julian Zelizer, a Princeton professor and editor of “The Presidency of Donald Trump: A First Historical Assessment.”\nHowever, Trump falsely also said the vote was “rigged and lost,” adding that Iran, China and South Korea were happy to see Biden in office.",
    "… We won by a lot, not just a little.”\nTrump has repeatedly made the claim that there were fraudulent votes in states such as Pennsylvania, Wisconsin, Michigan and Georgia that would change the outcome of the election.",
    "In June, he told Fox News’s Sean Hannity that he “didn’t win.”\n“Shockingly, we were supposed to win easily at 64 million votes, and we got 75 million votes, and we didn’t win,” Trump said in a phone interview.",
    "“But let’s see what happens on that.”\nHis first apparent acceptance of defeat was on Jan. 7, 2021, the day after the Capitol riot, when he acknowledged that Biden would take office on Inauguration Day.",
    "(The Hill) — Former President Donald Trump is raising eyebrows after he seemingly admitted to losing the 2020 presidential election in a video published by The Atlantic on Monday.",
    "A December poll conducted by the University of Massachusetts at Amherst found that only 21 percent of voting-age Republicans believe Biden won the election legitimately.",
    "The comments came eight months after the election and six months after the Jan. 6, 2021, riot at the Capitol by Trump supporters who sought to overturn his defeat.",
    "Then-Attorney General William Barr rejected Trump’s claims in December 2020, saying that the Department of Justice hadn’t uncovered any widespread voter fraud.",
    "“The presidential election was rigged and stolen, and because of that our country is being destroyed,” Trump said at a Michigan rally just last week.",
    "In December, he also made the comment of “if we had won the election” in an interview, making some wonder if he was actually admitting defeat.",
    "), Paul Gosar (Ariz.), and Marjorie Taylor Greene (Ga.), have continued to embrace the false narrative about irregularities at the polls.",
    "A vast majority of Republican voters agree with Trump’s claims that the election was stolen, according to surveys.",
    "But many of Trump’s Republican allies in Congress, including Reps. Jim Jordan (Ohio), Jim Banks (Ind.",
    "Experts and elections officials have found no evidence to support such allegations.",
    "Trump at times has appeared to admit to losing the election.",
    "“We did win.",
    "We did win."
  ]
}