{
  "id": 1315,
  "mediaId": 2679,
  "date": "2022-04-01",
  "headline": "House votes to decriminalize cannabis",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/house-votes-to-decriminalize-cannabis/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Weisman",
  "authorUrl": "https://www.seattletimes.com/author/cap-jonathan-weisman/",
  "termIds": [
    1860,
    2360,
    2371,
    2805,
    2936,
    255,
    305,
    1171,
    5223,
    5390
  ],
  "sentences": [
    "After its passage, he said, “the time has come for comprehensive reform of federal cannabis laws.”\nHe added, “Of course, we will need Republicans to pass a legalization bill in the Senate, and we will be working hard to try and get them.”\nMace, backed by four other Republicans, has her own bill, with a lower tax rate to discourage an illicit cannabis trade and other measures to discourage youth consumption.",
    "“However, one major hurdle continues to stand in the way of states’ ability to make their own decisions about cannabis — the continued prohibition of marijuana at the federal level.”\nMace said the Democrats with whom she had been negotiating needed to pass their version of a legalization bill before getting serious about talks on a bipartisan bill, with buy-in from the Senate.",
    "Advertising\n Skip Ad\n“If states are the laboratories of democracy, it is long past time for the federal government to recognize that legalization has been a resounding success and that the conflict with federal law has become untenable,” said Rep. Jerrold Nadler, D-N.Y., chair of the House Judiciary Committee.",
    "Advertising\n Skip AdSkip AdSkip Ad\n“The left will not let the Democrats do what needs to be done with the inflation problem, the energy problem, the illegal immigration problem on the southern border,” said Rep. Jim Jordan of Ohio, the senior Republican on the House Judiciary Committee.",
    "WASHINGTON — The House passed legislation Friday to decriminalize marijuana at the federal level as Democrats and three Republicans banded together to capitalize on the political resonance of legalized cannabis as an issue of economic growth, racial justice and states’ rights.",
    "The Democrats’ bill would remove marijuana from the federal government’s list of controlled substances, impose an 8% tax on cannabis products, allow some convictions on cannabis charges to be expunged and press for sentencing reviews at the federal and state levels.",
    "“Make no mistake: This is a racial justice bill,” said Rep. Barbara Lee, D-Calif.\nDuring the debate Friday, House Republicans raised concerns that the bill would expose more children to cannabis and that it ignored mental health issues in adult users.",
    "But supporters of marijuana decriminalization — even some Republicans who voted against the Democratic legislation — said Friday that the vote was a necessary step toward building consensus on something that can become law.",
    "People care about it; the vast majority of Americans care about it.”\nBy lowering law enforcement and incarceration costs and imposing new taxation, the bill would save the government hundreds of millions of dollars.",
    "But because cannabis remains a federally controlled substance on par with heroin, banks insured by the federal government have been loath to make their services available to the burgeoning marijuana industry.",
    "The Marijuana Opportunity Reinvestment and Expungement Act, which passed 220-204, is unlikely to secure 60 votes to pass the Senate, despite the backing of the majority leader, Sen. Chuck Schumer, D-N.Y.",
    "But other Republicans have signed on to a similar bill by Rep. Nancy Mace, R-S.C. (Two Democrats, Reps. Henry Cuellar of Texas and Chris Pappas of New Hampshire, voted against the legislation Friday.)",
    "The Congressional Budget Office estimated that the bill’s provision to expunge marijuana convictions and lower sentences would reduce time served by current and future inmates by 37,000 years.",
    "“I’m respecting the process that the Democrats want to go through,” said Mace, who has made marijuana decriminalization a central issue but voted against the Democratic bill.",
    "“This is an issue of individual freedom and basic fairness that clearly transcends party lines,” Schumer, Wyden and Booker wrote in a letter to fellow senators in February.",
    "She has used the issue to distinguish herself from her Republican primary opponent, Katie Arrington, whom former President Donald Trump has endorsed.",
    "Rep. Andy Biggs, R-Ariz., mocked a Democratic colleague, Rep. Steve Cohen of Tennessee, for mistaking today’s potent strains with those of his youth.",
    "Even as states move forward with legalization, people convicted on marijuana offenses — disproportionately people of color — remain imprisoned.",
    "But they generally skirted the issue, which is broadly popular in both parties, accusing Democrats of failing to address more pressing topics.",
    "Thirty-seven states have legalized cannabis for medical use, and 15 have granted adults legal access for purely recreational purposes.",
    "It would also make Small Business Administration loans and services available to cannabis businesses while setting standards for them.",
    "The Congressional Budget Office estimated that the act would reduce the federal deficit by nearly $3 billion over the next decade.",
    "With 47 states and the District of Columbia having relaxed marijuana laws in some way, the federal government is far behind.",
    "“I hope that I can be forgiven for voting against it,” Mace said Friday before casting her vote against the Democrats’ bill.",
    "Advertising\n Skip AdSkip AdSkip Ad\nSimilar legislation passed in 2020 but went nowhere in the Republican-controlled Senate.",
    "The Republicans voting for the measure were Reps. Matt Gaetz and Brian Mast of Florida and Tom McClintock of California.",
    "Sales in that industry totaled $20 billion in 2020 and are projected to more than double by 2025, according to the bill.",
    "I want to work on this issue, but we have to work on it together.”\nThis story was originally published at nytimes.com.",
    "Cory Booker of New Jersey and Ron Wyden of Oregon have written a marijuana decriminalization measure with Schumer.",
    "“He’s thinking pot is a drug where people get goofy and eat Cheetos,” Biggs said of Cohen.",
    "Wow.”\nThat opposition belied the issue’s popularity with Democratic and Republican voters.",
    "“You can save the federal government $600 million over five years, and it saves lives.",
    "Kansas is the latest state on the verge of legalizing cannabis for medical use.",
    "The vote Friday was the first since Schumer elevated the issue in that chamber.",
    "Some deeply Republican states like Oklahoma have become marijuana boom states.",
    "But those transactions are by and large in cash, without banking services.",
    "Federal law is far out of step.",
    "“Because I want to continue.",
    "It’s an important issue.",
    "“So what do they do?",
    "They legalize drugs.",
    "And Democratic Sens.",
    "Read it here."
  ]
}