{
  "id": 1351,
  "mediaId": 6627,
  "date": "2022-04-01",
  "headline": "Inflation, Immigration, Mass Destruction: DEMS FINALLY HAVE A PLAN!",
  "image": "",
  "link": "https://theblacksphere.net/2022/04/inflation-immigration-mass-destruction-dems-finally-have-a-plan/",
  "mediaOutlet": "theblacksphere.net",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    2453,
    2569,
    2698,
    2936,
    3098,
    3280,
    4887,
    4977,
    5351
  ],
  "sentences": [
    "Fox adds:\nCliff Bentz continued, “What’s deeply and truly disturbing, however, about this bill is its failure to address the clear consequences of legalization, such as what this drug does to children, to drivers on our highways, to the mental health of up to 30 percent of those adults who choose to use marijuana to communities inundated with hundreds, if not thousands of foreign cartel operated, unlicensed out of control marijuana grows.”\nBentz disagreed with Rep. Conor Lamb, D-Pa., who spoke in favor of the decriminalization bill.",
    "“Yet because of the way the federal criminal laws are written in the way that cannabis is placed in schedule one, it is very easy for a marijuana offense to actually get someone a worse sentence than an opioid offense like overprescribing OxyContin or selling fentanyl or a firearms.”\nRep. Jim Jordan voiced outrage at the marijuana bill’s timing, saying that issues such as crime, inflation, and illegal immigration should be taking precedence.",
    "Fox News elaborates:\nThe House heard a slew of proposed amendments for the bill, including measures to track and prevent impaired driving under the influence of marijuana, as well as carve-outs for law enforcement to restructure around the decriminalized substance.",
    "Rep. Cliff Bentz, R-Ore., spoke against the bill on the basis of possible spikes in impaired driving without first providing the research into the possible ramifications of the decriminalization.",
    "Because I got high, Because I got high, Because I got high.”\nFor the record, this legislation stalled when it got to the senate, so don’t roll those fat ones just yet.",
    "“Marijuana just didn’t register in terms of the risk that it posed to people on a day to day basis compared to those two things.,” Lamb continued.",
    "According to the Centers for Disease Control and Prevention (CDC), marijuana is the most commonly used federally illegal drug in the U.S.",
    "And the biggest law enforcement challenges that we had then and really still have today are opioids and gun violence,” said Lamb.",
    "But I’ve engrained that philosophy so deeply within myself, that legal or not, I’m just not gonna buy a dime bag any time soon.",
    "Unfortunately, this kind of major change without a real step-by-step logistical layout will result in nothing short of deaths.",
    "“It’s been obvious for years that at some point marijuana was going to be formally legalized,” Bentz said on the floor.",
    "Hungry people driving to the store, on fumes, looking for quarters to buy some Twinkies– this could go down in flames.",
    "“Record crime, record inflation, record gas prices, record number of illegal immigrants crossing our southern border.",
    "“Legalizing drugs, legalizing drugs and using American tax dollars to kick-start and prop up the marijuana industry.",
    "They can’t afford to drive to the beach between the gas prices and the cost of filling up the cooler for the day.",
    "Three Republicans voted yes: Matt Gaetz of Florida, Tom McClintock of California and Brian Mast of Florida.",
    "With each passing decade, it becomes more clear that younger generations embrace cannabis in all it forms.",
    "Not to mention that our president is a wienie, completely incapable of foreign relations on any level.",
    "But what I find particularly interesting right now is the timing of the latest Democrat proposal.",
    "The agency said 48.2 million people, or about 18% of Americans, used it at least once in 2019.",
    "And Congress has no plans to address that, so might as well tell America to just get stoned.",
    "The House of Representatives just voted to decriminalize marijuana on the federal level.",
    "They wreak havoc, and pray to God they can blame it on someone else, like Donald Trump.",
    "However, it was the first time that attitudes shifted enough to make a drastic change.",
    "Immigration and border security make for some of the biggest disasters we’re facing.",
    "“Before I came to Congress, I was a federal prosecutor in my hometown of Pittsburgh.",
    "That doesn’t mean I haven’t conceded to some of the health benefits of CBD or hemp.",
    "Two Democrats voted no: Chris Pappas of New Hampshire and Henry Cuellar of Texas.",
    "Bentz stated that the relevant data should be provided before the bill is passed.",
    "In layman’s terms, I think it goes a little more like this: people are miserable.",
    "Call me Nancy Reagan, but I just never feel the need to alter my state of mind.",
    "They’re just looking for some feel-good public relations in time for 2024.",
    "But hey, maybe Afroman can come out with a re-mix of his iconic song.",
    "Lamb cited his time as an assistant attorney general in Pittsburgh.",
    "The arguments against legalizing marijuana struggle to stay alive.",
    "It wasn’t the first time decriminalizing marijuana hit the floor.",
    "And what are Democrats doing today?” Jordan asked on the floor.",
    "Of course, they failed to factor in the cost of the munchies.",
    "Sure, we could bank some tax dollars on it, that’s a given.",
    "Such a deal for the American people.”\nMy thoughts exactly!",
    "“I was gonna run the government, but then I got high.",
    "And I pressured all seven of my kids to just say no.",
    "I was gonna rescue Ukrainians, but then I got high.",
    "Now it’s nothing but inflation, and I know why.",
    "Democrats want this to seem like a master plan.",
    "Thus, I’m open to the debates on legalization.",
    "The worst we’ve seen in more than 40 years.",
    "The bill passed with a vote of 220 to 204.",
    "I’ve never hit a bong or rolled a blunt.",
    "Personally, I’ve never smoked weed.",
    "And what do Democrats come up with?",
    "Gas prices are at an all time high.",
    "And that’s the real problem here.",
    "Yet, the left doesn’t make plans.",
    "Who knows, maybe I’m missing out.",
    "A real fix for whatever ails us.",
    "Democrats don’t have a plan.",
    "Bidenflation is a nightmare.",
    "Groceries have skyrocketed.",
    "It’s just not me.",
    "Joe Biden style.",
    "Let’s face it.",
    "Legalization.",
    "Or ever.",
    "Wow."
  ]
}