{
  "id": 1360,
  "mediaId": 2629,
  "date": "2022-04-09",
  "headline": "'Total Control': Trump Jr. Pushed Coup Plot In November 2020 Texts To Meadows",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY2MDA4Ny9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY3OTM5NTEzM30.j822HoPA8FM_fUxdk3VwJOMmqc-0YYLC4XPKfyzXjkc/img.png?width=1200&coordinates=0%2C75%2C0%2C353&height=600",
  "link": "https://www.nationalmemo.com/total-control-trump-jr-pushed-coup-plot-in-november-2020-texts-to-meadows",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandi Buchman",
  "authorUrl": "https://www.nationalmemo.com/u/brandibuchman",
  "termIds": [
    1670,
    1886,
    1902,
    2201,
    2851,
    2906,
    3051,
    3975,
    4599
  ],
  "sentences": [
    "The president’s son wanted former Director of National Intelligence and Internet troll Ric Grenell to replace Wray, despite having zero experience, and Attorney General Bill Barr to serve as a “special prosecutor on HardDrivefromHell Biden crime family,” the text shows\nBarr ultimately refused to investigate the Bidens.",
    "In a series of messages exclusively obtained and reviewed by CNN on Friday, Donald Trump Jr. reportedly sent texts to former White House chief of staff Mark Meadows with ideas about how his father, Donald Trump, could stay in power even before the official results of the 2020 election were called.",
    "“We either have a vote WE control and WE win OR it gets kicked to Congress 6 January 2021.”\nIf the alternate elector bid didn’t work, Trump Jr. made the baldly unconstitutional proposal that Congress simply hold a vote on January 6 to reinstall Trump.",
    "In Trump Jr.’s reported text, he too said that key battleground states must be recounted and recertified with “Trump electors.”\n“Republicans control 28 states Democrats 22 states.",
    "According to CNN, the November 5 text from Trump Jr. echoed similar strategies put forward by election subversion strategist and conservative attorney John Eastman.",
    "Eastman urged the Trump White House to have then-Vice President Mike Pence stop the counting of electoral votes and consider “alternate electors” for Trump.",
    "Incidentally, when the Jan. 6 committee exposed text messages sent by Rep. Jim Jordan of Ohio to Mark Meadows, Jordan said the same had occurred.",
    "He also allegedly called for FBI Director Christopher Wray and Anthony Fauci, Trump’s White House adviser on the pandemic, to be fired.",
    "It is unclear whether the House Select Committee on January 6 had previously obtained the text messages reported on by CNN.",
    "Alan Futerfas, an attorney for the president’s eldest son, told CNN the message to Meadows was a forward.",
    "Given the date, this message likely originated from someone else and was forwarded,” Futerfas said.",
    "Moral High Ground POTUS must start 2nd term now,” Trump Jr. wrote [punctuation in original].",
    "President-elect Joe Biden would not be declared the official winner until November 7.",
    "We control them all,” Trump Jr. reportedly wrote to Meadows on November 5, 2020.",
    "“After the election, Don received numerous messages from supporters and others.",
    "A committee spokesman did not immediately return a request for comment Friday.",
    "Notably, Barr did not find fraud had occurred in the 2020 election.",
    "He resigned about a month after Trump Jr’s text.",
    "“We have operational control Total leverage.",
    "Once again Trump wins,” the message said.",
    "We have multiple paths.",
    "“It’s very simple."
  ]
}