{
  "id": 1365,
  "mediaId": 2576,
  "date": "2022-04-03",
  "headline": "Editorial: Will we ever learn what happened on Jan. 6?",
  "image": "https://www.gannett-cdn.com/presto/2022/04/02/PDTF/33826f54-752a-4768-801a-b5e666c274d7-dickerson_collage.jpg?crop=1799,1012,x0,y630&width=1799&height=1012&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/opinion/columnists/brian-dickerson/2022/04/03/jan-6-panel-capitol-attack/7248863001/",
  "mediaOutlet": "freep.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Detroit Free Press Editorial Board",
  "authorUrl": "",
  "termIds": [
    1670,
    2201,
    2298,
    2599,
    2851,
    3267,
    3434,
    878,
    1132,
    1163
  ],
  "sentences": [
    "The committee won an important legal victory earlier this year when the Supreme Court rejected Trump's bid to block the National Archives and Records Administration from releasing 800 pages of White House communications that could reveal what the former president and subordinates trying to stop certification of Biden's victory did on Jan.6.",
    "The U.S. House of Representatives voted to establish the committee, whose formal name is the Select Committee to investigate January 6 Attack on the U.S. Capitol, last summer after Republicans in the House and Senate backed out a bipartisan agreement to create an independent commission modeled on the one that investigated the 9/11 attacks.",
    "Individual witnesses likely have a wide variety of personal motives, but all cite Trump's argument that executive privilege protects the confidentiality of his communications with White House staff, and that future presidents won't be able to get candid counsel if their conversations are subject to public disclosure.",
    "But the investigation has already set some important precedents for the future of congressional oversight and the relationship among the executive, legislative and judicial branches going forward — and those will continue to resonate long after Washington finally closes the books on Jan. 6.",
    "But last month, in a court filing opposing Trump attorney Eastman's attempt to withhold his correspondence with Trump from congressional investigators, the committee's lawyers asserted they had \"a good-faith basis\" for concluding that Trump and Eastman had conspired to violate federal law.",
    "Committee investigators have interviewed more than 800 witnesses and secured more than 35,000 pages of evidence in its effort to find out how those who entered the Capitol planned, financed and executed the attack and how federal law enforcement agencies and local police responded to it.",
    "With its investigation accelerating on multiple fronts, let's review what the Jan. 6 committee has done so far, where it's investigation is headed, and why the panel's work is so important for the future of the U.S. government:\nWhat is Jan. 6 Committee, and what is its mission?",
    "And there are signs that the Justice Department, which has so far charged only those who participated in the rioting at the Capitol, is actively seeking evidence about the roles played by Trump staffers and supporters, including members of Congress.",
    "The committee says it has since learned that Jordan, who tried to block Biden's election on Jan. 6, was in communication with Trump that day, and it is seeking to interview the Ohio congressman under oath as a material witness in its probe.",
    "Biden doesn't agree with his predecessor's view, and has generally supported turning over executive branch communications the committee is seeking,\nDoes the committee have any recourse against witnesses who've defied its subpoenas?",
    "The seven Democrats and two Republicans on the committee say their purpose is to find out everything they can about the January 2021 attack on the Capitol and consider what can be done to prevent a similar attack in the future.",
    "The committee has subpoenaed two Michigan GOP officials, members of the Republican National Committee, Kathy Berden and Mayra Rodriguez, who spearheaded an initiative to substitute \"a false slate of electors\" pledged to Trump.",
    "Other Republicans, including Senate GOP leader Mitch McConnell and House minority leader Kevin McCarthy, maintain that the committee's real mission is to embarrass former President Donald Trump and his Republican supporters.",
    "A House committee investigating the Jan. 6, 2021, attack on the U.S. Capitol is getting closer to finding out exactly what then-President Donald Trump and his inner circle did that day — and the U.S. Justice Dept.",
    "Investigative teams have also been assigned to scrutinize efforts in states like Michigan to delay the certification of electors or pressure officials to recognize alternative slates of electors pledged to Trump.",
    "Sometime after the hearings, the panel will publish its conclusions about the attack and any changes it believes are needed to protect the Capitol and the presidential election process going forward.",
    "But members of the committee have publicly urged U.S. Attorney General Merrick Garland to assist their investigation by bringing contempt charges against Meadows and other recalcitrant witnesses.",
    "When House Speaker Nancy Pelosi rejected two of the five — Reps. Jim Jordan (R-Ohio) and Jim Banks (R-Ohio) — McCarthy decreed that his caucus would boycott the Jan. 6 committee altogether.",
    "U.S. District Judge David O. Carter said attorney John Eastman's emails could shed light on what Carter called an illegal \"coup\" designed to overturn the 2020 presidential election.",
    "The claim is critical, because a lawyer who actively abets a client's criminal scheme forfeits the attorney-client privilege that typically shields their discussions.",
    "If Democrats retain control, the committee is likely to recommend changes designed to protect and strengthen the process of allocating and certifying electoral votes.",
    "But federal prosecutors are expected to decide any day now whether to charge Meadows, and the House is poised to recommend that Scavino and Navarro be prosecuted.",
    "And White House phone records furnished to the Jan. 6 committee reportedly contain a 7-hour gap spanning the afternoon and early evening of the Capitol attack.",
    "The Justice Department has yet to decide whether it will press criminal charges against Trump's former chief of staff, Mark Meadows, for refusing to testify.",
    "Last week a federal judge ordered one of Trump's lawyers to turn over more than 100 emails the Trump team had sought to withhold from the committee.",
    "But two House Republicans, Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois, defied McCarthy to join the committee at Pelosi's request.",
    "If Republicans win a majority in the House, they'll probably try to bring the Jan. 6 investigation to a swift conclusion, maybe by defunding it.",
    "What impact will Jan. 6 committee's work have if neither the former president or anyone in his inner circle is ever charged and convicted?",
    "The committee has also subpoenaed dozens of key figures in Trump's inner circle who balked at testifying voluntarily.",
    "The committee hopes to hear testimony from key witnesses in public hearings that could begin as early as next month.",
    "So far, the committee has cited four witnesses for contempt, and the full House has asked the Justice Dept.",
    "The committee has yet to reveal publicly what the documents and sworn testimony it has obtained so reveal.",
    "Back in July, Republican House Leader McCarthy picked five GOP House members to serve on the committee.",
    "That may depend on whether Democrats lose control of Congress before the committee concludes its work.",
    "sought funding for 131 additional prosecutors to work on its investigation into the Jan. 6 attack.",
    "The judge sided with the committee, citing evidence that Trump and Eastman had committed felonies.",
    "Contempt of congress is a is a crime that could subject violators to prosecution and jail time.",
    "(Only Justice Clarence Thomas supported Trump's contention that the documents were privileged.)",
    "to file criminal charges against two: former Trump strategist Steve Bannon and Meadows.",
    "But congressional investigators have been frustrated in their quest for other evidence.",
    "The court described the pair's collaboration as \"a coup in search of a legal theory.\"",
    "is expanding its own criminal probe into the planning and financing of the attack.",
    "Could the committee really charge Trump and his aides with crimes?",
    "In its recent budget request to Congress, the Justice Dept.",
    "Why are so many of Trump's aides refusing to participate?",
    "Why are there only two Republicans on the committee?",
    "What do we know about the evidence uncovered so far?",
    "and what evidence has it gathered so far?",
    "What evidence is the committee seeking?",
    "Only a federal prosecutor can do that.",
    "So far, only Bannon has been indicted.",
    "Yes.",
    "No."
  ]
}