{
  "id": 1368,
  "mediaId": 2753,
  "date": "2022-04-05",
  "headline": "Expect many more illegals as Biden ends Title 42",
  "image": "https://www.wnd.com/wp-content/uploads/2018/04/immigrant-caravan.jpg",
  "link": "https://www.wnd.com/2022/04/expect-many-illegals-biden-ends-title-42/",
  "mediaOutlet": "WorldNetDaily",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Schlafly",
  "authorUrl": "https://www.wnd.com/author/aschlafly/",
  "termIds": [
    0
  ],
  "sentences": [
    "Already Biden's Justice Department is refusing to honor a judge's order to reinstate President Trump's most successful border policy, which required all illegal migrants to \"remain in Mexico\" until their bogus claims for asylum are heard and rejected.",
    "\"Today's decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border,\" Kyrsten Sinema stated candidly about her own party's president.",
    "\"Based on these projections,\" the document says, the newly established Southwest Border Coordination Center \"is currently planning for 6,000, 12,000 (high) and 18,000 (very high) encounters per day.\"",
    "Section 265 of Title 42 of the United States Code authorizes the federal government to exclude persons at the border whose admission would endanger the public health from a communicable disease.",
    "To make room for this massive increase in illegals, Biden ordered ICE to dismiss up to 700,000 or 40% of the 1,700,000 cases that are pending for deportation orders by immigration courts.",
    "At this Michigan rally Trump predicted we will be \"deluged by illegal immigration\" amounting to \"10 to 12 million\" new illegal aliens, because of Biden ending Title 42 restrictions.",
    "Senseless liberal logic welcomes COVID-infected illegal aliens, while imposing burdensome vaccination requirements on Americans and those who enter our country lawfully.",
    "These drugs imported by illegal aliens include 634 pounds of lethal fentanyl and 12,500 pounds of life-threatening methamphetamine that were seized in February alone.",
    "When asked about this contradiction, Biden press secretary Jen Psaki absurdly responded last year that the illegals do not intend to remain here for a long time.",
    "On Tuesday, the fourth of the 10 House Republicans who voted with liberals to impeach Trump, Rep. Fred Upton, R-Mich., announced he would not run for reelection.",
    "Last Friday the Centers for Disease Control and Prevention (CDC) announced that Trump's proper use of this law to stem illegal immigration would end on May 23.",
    "\"Title 42 has been an essential tool in combating the spread of COVID-19 and controlling the influx of migrants at our southern border,\" objected Sen. Manchin.",
    "The entrenched, 18-term incumbent's announcement comes three days after Trump held a massive rally in Michigan that attracted 10,000 conservative supporters.",
    "That throws our border wide open by repealing Trump's only remaining border security policy that was still being enforced by the Biden administration.",
    "\"We are already facing an unprecedented increase in migrants this year, and that will only get worse if the administration ends the Title 42 policy.\"",
    "ABC News reports that DHS has prepared a 16-page strategic plan that includes frightening projections for post-Title 42 southwest border encounters.",
    "Biden, wanting illegals as future Democrat voters, vastly increases the illegal border crossings by allowing the Title 42 restrictions to expire.",
    "A thousand miles from our southern border, even West Virginia Democratic Sen. Joe Manchin is shocked, calling this \"a frightening decision.\"",
    "A record 1.7 million illegal aliens had encounters with our courageous Border Patrol agents in the fiscal year ending Sept. 30, 2021.",
    "Democrats see a new voter for their side in every new illegal alien, no matter how much harm that causes to the United States.",
    "In addition, the number of known \"gotaways\" has exceeded 2,000 per day in recent months, plus many more who evade detection.",
    "Amid this crisis, Biden opens the floodgates further to double or triple the influx, by terminating Trump's Title 42 policy.",
    "The monthly seizure at our border of fentanyl exceeded 100 million fatal doses, while far more probably slipped through.",
    "The strain of Ukrainian refugees on Europe dominates the media, while it ignores similar hordes of illegals here.",
    "The reality, as stated by Rep. Jim Jordan, R-Ohio, yesterday, is that \"This is deliberate, this is intentional.\"",
    "This means nearly a million of these illegals will also get a free ticket to stay and collect benefits here.",
    "The flood of people crossing our southern border is not some natural disaster beyond anyone's control.",
    "They certainly do plan to stay, and consume billions of dollars in benefits while they are here.",
    "To put this in perspective, merely one kilogram of fentanyl amounts to 500,000 lethal doses.",
    "The illegal drugs they bring into our country are enough to kill every single American.",
    "In the last month alone, our border agents had 165,000 encounters with illegal aliens.",
    "The numbers this year are far higher than the record-breaking totals of last year.",
    "18,000 per day is more than 500,000 per month, and more than 6 million per year.",
    "That case, Biden v. Texas, will be argued in the Supreme Court on April 26.",
    "It is intentional, to replenish the shrinking number of liberal voters.",
    "The sports arena booked for Trump's rally quickly overflowed.",
    "Arizona's Democratic senators are complaining too.",
    "Many additional illegals are never caught.",
    "Let those numbers sink in."
  ]
}