{
  "id": 1373,
  "mediaId": 6512,
  "date": "2022-04-05",
  "headline": "Donald Trump Admits He Didn't Win Presidential Election 2020 During Interview With Presidential Historians",
  "image": "https://1622179098.rsc.cdn77.org/data/images/full/142724/donald-trump-admits-he-didn-t-win-presidential-election-2020-during-interview-with-presidential-historians.jpg",
  "link": "https://www.latinpost.com/articles/154763/20220405/donald-trump-admits-didnt-win-presidential-election-2020-interview.htm",
  "mediaOutlet": "Latin Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Webber",
  "authorUrl": "",
  "termIds": [
    1355,
    2201,
    4599,
    4754,
    4984,
    5371
  ],
  "sentences": [
    "READ NEXT: Donald and Melania Trump Marriage: How Do the Former White House Couple Manage to Stay Together for Over a Decade\nDonald Trump's Interview With Presidential Historians\nThe former president described the presidential historians assembled by Zelizer as \"tremendous group of people,\" adding that he appreciates that the group heard him out, according to The Guardian News report.",
    "Presidential Election 2020\nTrump has repeatedly claimed that there were fraudulent votes in states such as Pennsylvania, Wisconsin, Michigan, and Georgia that change the result of the election, according to The Hill report.",
    "Princeton Professor and editor of the upcoming \"The Presidency of Donald J. Trump: A First Historical Assessment,\" Julian Zelizer, convened the interview with a panel of presidential historians.",
    "Many of Trump's Republican allies have continued to prompt such narrative about the Presidential Election 2020, namely Reps. Jim Jordan, Jim Banks, Paul Gosar, and Marjorie Taylor Greene.",
    "Zelizer also noted that shortly after the session with the presidential historians, the former president said that he would give no more interviews for books about his presidency.",
    "READ MORE: Donald Trump Mocks Joe Biden After Being Sanctioned by Russia, Says He Could Talk to Vladimir Putin to Prevent World War III\nThis article is owned by Latin Post.",
    "Former U.S. President Donald Trump has admitted that he did not win the Presidential Election 2020 after claiming for years to have won a second term in the White House.",
    "The former president has defended his leadership during the interview as his claims that the Presidential Election 2020 was stolen continue to affect U.S. politics.",
    "Trump said during the interview that he did not win the election, which contracted his repeated claims of the Presidential Election 2020 being stolen from him.",
    "Zelizer said that when Trump learned about the book, the former president reached out to its author hoping to offer his perspective on his presidency.",
    "In July 2021, Trump earlier said that meetings with authors of the \"ridiculous\" number of books being written about him are a \"total waste of time.\"",
    "Zelizer wrote that Trump \"seemed to want the approval of historians,\" without any knowledge of how historians collect evidence or render judgments.",
    "Trump admitted his defeat during an interview with a panel of presidential historians working on a book about his presidency.",
    "He added that rather than being critical, he would rather have the group hear him out, according to a People News report.",
    "However, experts and election officials have not found any evidence to support Trump's claims of fraudulent votes.",
    "Written by: Mary Webber\nWATCH: Trump admits defeat after Congress certifies Joe Biden's victory - from ANI News",
    "He added at the time that those writers are \"often bad people\" who write whatever \"fits their agenda.\"",
    "The interview was published on Monday by The Atlantic, according to a Newsweek News report.",
    "Trump said that those being written about him have \"nothing to do with facts or reality.\"",
    "Elsewhere in the interview, Trump described the 2020 election as being \"rigged and lost.\"",
    "In December 2020, former Attorney General William Barr has turned down Trump's claims.",
    "He said that the Justice Department had not discovered any widespread voter fraud.",
    "He recognized that U.S. President Joe Biden would take office on Inauguration Day.",
    "He acknowledged his defeat on Jan. 7, 2020, a day after the Capitol riot.",
    "Trump said during the call that the book \"is a very important book.\""
  ]
}