{
  "id": 1422,
  "mediaId": 2730,
  "date": "2022-04-02",
  "headline": "Jordan Says Marijuana Shouldn't Be Legalized Because the FBI Is Monitoring Parents at School Board Meetings",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/295/d5056100-32b0-4b88-a8b1-67f9496b02ef.jpg",
  "link": "https://townhall.com/tipsheet/landonmion/2022/04/02/jordan-says-marijuana-shouldnt-be-legalized-because-the-fbi-is-monitoring-parent-n2605405",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Landon Mion",
  "authorUrl": "https://townhall.com/tipsheet/landonmion/",
  "termIds": [
    1670,
    1934,
    370,
    868,
    878,
    1132
  ],
  "sentences": [
    "Jim Jordan is against legalizing marijuana because “we have a justice department that is treating parents like domestic terrorists” pic.twitter.com/UOW67rSnlu\n— Acyn (@Acyn) April 1, 2022\nThe Congressman's comment about the Department of Justice treating parents as domestic terrorists was in reference to Attorney General Merrick Garland's Oct. 4 memo issued in response to a Sept. 29 letter from the National School Boards Association asking for federal assistance to deal with violence and threats from parents at school board meetings that the NSBA likened to \"a form of domestic terrorism and hate crimes.\"",
    "Source: Michael Reynolds/Pool via AP\nDuring debate on the House Floor Friday regarding legislation to decriminalize possession of marijuana at the federal level, Ohio GOP Rep. Jim Jordan attempted to compare marijuana legalization to the Federal Bureau of Investigations' actions against parents protesting at school board meetings.",
    "Other priorities Jordan outlined as items that Congress should focus on instead of marijuana legislation include record-high crime rates in urban areas, record-high inflation rates across the country and the surge in migrants entering the U.S. through the southern border.",
    "The bill would clear marijuana-related convictions from a person's criminal record, would formally remove the substance from the federal list of controlled substances and would impose a federal tax on marijuana sales.",
    "Parents across the U.S. had taken to school board meetings to express frustration with mask mandates, critical race theory instruction and transgender bathroom policies being carried out at their children's schools.",
    "But Garland has yet to retract his memo, which directed the FBI to \"address threats against school administrators, board members, teachers and staff,\" because he did not adopt the same language as the NSBA.",
    "States across the nation have worked to decriminalize marijuana at the state level over the past decade, with 18 states and Washington, D.C. enacting laws to decriminalize the substance.",
    "But Jordan, who voted against the legislation, argued that Congress should not pass the bill because \"we have a justice department that is treating parents like domestic terrorists.\"",
    "In 2019, more than 500,000 people were arrested for the possession of marijuana while 45,000 were arrested for selling or manufacturing the substance, according to FBI data.",
    "\"We have a Justice Department that is treating parents as domestic terrorists spying on moms and dads who simply show up at school board meetings,\" Jordan said.",
    "Absent from Jordan's comments is the acknowledgment that Americans have also been the target of law enforcement agencies for marijuana-related offenses.",
    "Marijuana remains illegal at the federal level and the MORE Act is not expected to clear the 60-vote threshold needed to pass the Senate.",
    "He did, however, testify in front of Congress last year that his memo was crafted in response to the NSBA's letter.",
    "He appeared to be outlining an agenda he believed should be prioritized over passing marijuana legislation.",
    "The Marijuana Opportunity, Reinvestment and Expungement Act passed the House Friday by a vote of 220-204.",
    "And Democrats are focused on legalizing drugs and helping the cannabis industry.\"",
    "This designation, this label on moms and dads simply standing up for their kids.",
    "Three Republicans voted for the bill while two Democrats opposed it.",
    "The NSBA has since apologized for the language used in its letter.",
    "\"We know that's going on, putting a threat tag label on parents."
  ]
}