{
  "id": 1423,
  "mediaId": 2672,
  "date": "2022-04-07",
  "headline": "Trump Says He Wanted to March to Capitol on Jan. 6, Blames Everyone But Himself for Carnage",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/Donald-Trump-1.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/trump-march-capitol-jan-6-blame-nancy-pelosi-1334098/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "William Vaillancourt",
  "authorUrl": "",
  "termIds": [
    1440,
    2201,
    2202,
    2599,
    3267,
    180,
    4887,
    5390
  ],
  "sentences": [
    "The former president, who may have violated the Presidential Records Act, claims he didn’t destroy any call logs or speak on “burner phones.” But he said he did remember talking to House Minority Leader Kevin McCarthy (R-Calif.), Rep. Jim Jordan (R-Ohio), and others during that time.",
    "Donald Trump says he regrets not marching to the Capitol on Jan. 6, and once again tried to blame House Speaker Nancy Pelosi (D-Calif.) and Washington, D.C., Mayor Muriel Bowser for the violence, according to a new interview with The Washington Post.",
    "“But this was a tremendous crowd.”\nOnce Trump was back at the White House and became aware of the violence at the Capitol, he told the Post he thought it “was a shame.”\n“And I kept asking why isn’t she doing something about it?” he said.",
    "In a chummy interview with Sean Hannity in January, he repeated the debunked claim that Pelosi “turned down” the National Guard he summoned, and insisted that “we would have had no Jan. 6 as we know it” if not for her and Bowser.",
    "And I said, ‘It’s got to be taken care of,’ and I assumed they were taking care of it.”\nTrump has been attempting to shift responsibility to Pelosi and Bowser for more than a year now.",
    "They don’t want to show pictures, the fake news doesn’t want to show pictures,” he said, in effect bookending his presidency with complaints about coverage of his crowd sizes.",
    "I would have gone there in a minute,” Trump claimed in the interview, adding that he isn’t getting the credit he deserves for the amount of supporters of his who showed up.",
    "Trump also insisted to the Post that there is nothing suspicious about the seven-hour gap in his White House phone logs last Jan. 6.",
    "“From the standpoint of telephone calls, I don’t remember getting very many,” Trump said.",
    "If congressmen were calling me, what difference did it make?",
    "I don’t know what that means, but you see very few pictures.",
    "I believe it was the largest crowd I’ve ever spoken to.",
    "“Why isn’t Nancy Pelosi doing something about it?",
    "The mayor of D.C. and Nancy Pelosi are in charge.",
    "“The crowd was far bigger than I even thought.",
    "“Why would I care about who called me?",
    "There was nothing secretive about it.",
    "“Secret Service said I couldn’t go.",
    "And the mayor of D.C. also.",
    "There was no secret.”",
    "I hated seeing it.",
    "I hated seeing it."
  ]
}