{
  "id": 143,
  "mediaId": 2664,
  "date": "2022-04-21",
  "headline": "Experts say Kevin McCarthy ‘stepped on a rake’ and ‘Greene, Gosar and Jordan are licking their chops’",
  "image": "https://www.rawstory.com/media-library/rep-kevin-mccarthy.jpg?id=27614364&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/kevin-mccarthy-lying-scandal/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1670,
    1726,
    1926,
    2201,
    2343,
    2694,
    3116,
    3267,
    80,
    878
  ],
  "sentences": [
    "\"House GOP Leader Kevin McCarthy refused to testify to the Jan. 6 committee, saying all his statements were already public — except they weren’t, and through Liz Cheney, the committee has known all along that he said Trump should resign,\" noted Guardian reporter Hugo Lowell.",
    "Maddow, who expects calls for McCarthy to resign in response, obtained the audio of a call between McCarthy and Rep. Liz Cheney (R-WY) from reporters Alexander Burns and Jonathan Martin of The New York Times.",
    "\"I think there would be no more fitting end to Kevin McCarthy’s dream of becoming Speaker than the 'scandal' of him being exposed as privately believing the right and moral thing,\" he wrote.",
    "House GOP Leader Kevin McCarthy (R-CA) is embroiled in a major scandal after MSNBC anchor Rachel Maddow played audio proving he lied about saying he would ask Donald Trump to resign.",
    "Lincoln Project co-founder Reed Galen suggested that Reps. Marjorie Taylor Greene (R-GA), Paul Gosar (R-AZ), and Jim Jordan (R-OH) were imagining themselves holding McCarthy's job.",
    "\"McCarthy pining for Big Tech to take away some of his members' Twitter accounts may be a more egregious sin than the Trump stuff,\" wrote David Weigel of The Washington Post.",
    "\"McCarthy stepped on a rake with a denial - question now is how his conference and Trump react,\" wrote New York Times reporter Maggie Haberman.",
    "McCarthy literally today said this was a lie and just a few hours later the tape with his voice from his mouth proves THAT was a lie.",
    "\"What’s wild is that a lot of people knew that McCarthy was lying about that call but he did it anyway.",
    "The conspiracy of silence in the GOP around private dissent with Trump is extraordinary,\" she wrote.",
    "Jonah Goldberg, editor-in-chief of The Dispatch, suggested there might be some poetic justice.",
    "McCarthy also wanted Twitter to suspend accounts of some of the members of his caucus.",
    "CNN's Abby Phillip zeroed in on what McCarthy's lie says about the Republican Party.",
    "One McCarthy lie proving another lie was also noted by Politico's Kyle Cheney.",
    "[McCarthy] ought to be ashamed,\" said Rep. Adam Kinzinger (R-IL).",
    "Experts explained why it is such a big scandal for McCarthy.",
    "\"Greene, Gosar and Jordan are licking their chops,\" he said.",
    "\"Republicans, your leaders think you are dumb.",
    "Let’s be done with them.\"",
    "Incredible.",
    "\"Wow."
  ]
}