{
  "id": 1439,
  "mediaId": 2744,
  "date": "2022-04-07",
  "headline": "GOP takes aim at Mickey Mouse copyright over Disney opposition to Florida bill",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/b39cd3e/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F09%2F6e%2F3ef7d9454ccc8e7d94764176e744%2Fmickey-mouse.jpg",
  "link": "https://www.washingtonexaminer.com/policy/economy/gop-takes-aim-at-mickey-mouse-copyright-over-disney-opposition-to-florida-bill",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Halaschak",
  "authorUrl": "https://www.washingtonexaminer.com/author/zachary-halaschak",
  "termIds": [
    1670,
    2291,
    878,
    1066,
    4977,
    5037,
    5371
  ],
  "sentences": [
    "Detractors of the latter bill branded it the “Mickey Mouse Protection Act.”\nWhile the 2024 expiration just applies to the 1924 Steamboat Willie version of Mickey Mouse, and other depictions of the famous rodent would be protected, it would still represent a major blow for Disney and allow other companies to use Mickey’s likeness with no strings attached and without paying Disney royalties.",
    "“We oppose any legislation that infringes on basic human rights, and stand in solidarity and support our LGBTQIA+ cast, crew, guests and fans who make their voices heard today and every day.”\nWith the copyright deadline approaching in less than two years, more Republicans than just Banks are now looking to use the expiration to exact political revenge against Disney.",
    "The copyright on Disney’s well-known Steamboat Willie Mickey Mouse, the first iteration of the company’s signature character, is set to expire on Jan. 1, 2024, and Rep. Jim Banks has written a letter to Disney CEO Bob Chapek that says he and other lawmakers oppose “further extensions applicable” to the company’s copyrights, which he said should become public domain.",
    "The letter accuses Disney of “kowtowing” to China and cites the company’s ties to the country, along with its public lobbying against the Florida legislation, which is called the Parental Rights in Education bill but has been branded the “Don't Say Gay” bill by detractors.",
    "Rep. Jim Jordan, a fellow Republican from Ohio, told National Review that Disney appears to have bent to the “woke mob.” He asserted that Disney will be unlikely to appeal to Republicans in stopping its copyrights from expiring given its recent political dalliances.",
    "“Disney Parks, Experiences and Products is committed to creating experiences that support family values for every family, and will not stand for discrimination in any form,” a statement from Disney read.",
    "“It’s unfortunate that Disney, once an American success story, has allied with a hostile foreign regime and domestic ideologues who seek to tear our country apart,” wrote Banks, an Indiana Republican.",
    "The GOP hopes to regain majorities in the House and Senate this year, and polling indicates a high likelihood of that occurring, a prospect that gives the plan not to extend the copyright some teeth.",
    "America’s strong copyright protections helped make America great … But Congress should not add to Disney’s 90+ years of federal copyright protection to incentivize its new far-left agenda,” he said.",
    "“It’s hard to believe that anyone would have considered extending the already lengthy term, but there’s no way they will get the ear of any Republicans after their radical political activism.",
    "Initially, Disney did not take a position on the legislation, and Chapek said in a memo to staff that “corporate statements do very little to change outcomes” and are often divisive.",
    "“Disney’s profits will give the woke left more control over our kids and conservatives in Congress should oppose any legislation that would unfairly advantage Disney,” said Banks.",
    "Republican lawmakers might try to use an expiring copyright on Mickey Mouse to punish Disney for its vocal opposition to controversial Florida education legislation.",
    "But after employee outrage, including walkouts, the company relented and came out in full-throated opposition to the legislation, which was signed by Florida Gov.",
    "It was part of the driving force in passing the Copyright Act of 1976 and then worked again to get the Copyright Term Extension Act of 1998 past the finish line.",
    "The legislation bans classroom instruction of sexual orientation and gender identity through the third grade.",
    "“Next year, the woke Disney lobbyists will ask Congress to extend Micky Mouse’s trademark.",
    "Disney has been wildly successful in lobbying for copyright extensions in the past.",
    "I think not,” tweeted GOP Rep. Lauren Boebert of Colorado.",
    "Ron DeSantis."
  ]
}