{
  "id": 1441,
  "mediaId": 2553,
  "date": "2022-04-01",
  "headline": "House Votes To Legalize Marijuana; Dems Applaud It As ‘Racial Justice Bill’",
  "image": "https://dw-wp-production.imgix.net/2022/04/CE896F96-D971-4E52-8DF6-54FCB80EBE7C_1_201_a.jpeg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/house-votes-to-legalize-marijuana-dems-applaud-it-as-racial-justice-bill",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charlotte Pence Bond",
  "authorUrl": "https://www.dailywire.com/author/charlotte-pence-bond",
  "termIds": [
    2371,
    2698,
    2805,
    2817,
    3324,
    552,
    878,
    1163,
    1171
  ],
  "sentences": [
    "The New York Times reported that the bill would “remove marijuana from the federal government’s list of controlled substances, impose an 8 percent tax on cannabis products, allow some convictions on cannabis charges to be expunged and press for sentencing reviews at the federal and state levels.”\nRegarding small business loans, the bill stated that the administrator of the Small Business Administration “shall establish and carry out a program, to be known as the ‘Cannabis Restorative Opportunity Program’, to provide loans and technical assistance…to assist small business concerns owned and controlled by socially and economically disadvantaged individuals that operate in eligible States or localities.”\nIt also stated that the administrator will create and operate a grant program called the “‘Equitable Licensing Grant Program,’ to provide any eligible State or locality funds to develop and implement equitable cannabis licensing programs that minimize barriers to cannabis licensing and employment for individuals adversely impacted by the War on Drugs…”\nThe Washington Post reported that the Act would allow for legal cannabis sales to be regulated and taxed.",
    "These arrests can have a detrimental impact on a person’s quality of life and can lead to difficulty finding employment, securing housing and accessing other benefits.”\nThe leading sponsor of the bill, Representative Jerrold Nadler (D-NY), said it “would set a new path forward and would begin to correct some of the injustices of the last 50 years.”\n“Whatever one’s views are on the use of marijuana for recreational or medicinal use, the policy of arrests, prosecution, and incarceration at the federal level has proven both unwise and unjust,” he said.",
    "… Let’s focus on the things that matter.”\nMany states have moved to change their laws regarding marijuana, with the bill noting that:\n37 States, the District of Columbia, Puerto Rico, Guam, and the U.S. Virgin Islands have adopted laws allowing legal access to cannabis, and 15 States, the District of Columbia, the Commonwealth of the Northern Mariana Islands, and Guam have adopted laws legalizing cannabis for adult recreational use.",
    "It added that “[a] total of 47 States have reformed their laws pertaining to cannabis despite the Schedule I status of marijuana and its Federal criminalization.”\nThe Daily Wire is one of America’s fastest growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "I want to work on this issue, but we have to work on it together.”\nDemocrats are framing the legislation as one that promotes “racial justice.”\nOn Thursday, House Speaker Nancy Pelosi (CA) said, “This landmark legislation is one of the most important criminal justice reform bills in recent history.”\n“Make no mistake: Yes, it is a racial justice bill,” Representative Barbara Lee (D-CA) said.",
    "“It also would provide for the expungement of federal marijuana convictions dating to 1971 and bars the denial of federal public benefits or security clearances on the basis of marijuana offenses,” the outlet noted.",
    "On Friday, House Republicans reportedly debated the legislation, saying it would result in more kids being exposed to the substance, and noted how it didn’t address mental health problems in adults who use it.",
    "“The left will not let the Democrats do what needs to be done with the inflation problem, the energy problem, the illegal immigration problem on the southern border,” Representative Jim Jordan (R-OH) said.",
    "People care about it; the vast majority of Americans care about it.”\nShe voted against the Democratic measure, reportedly stating before she did so, “I hope that I can be forgiven for voting against it.",
    "It is reportedly unlikely to get enough support to make it past the Senate — a threshold of 60 votes — but Senate Majority Leader Chuck Schumer (NY) supports the legislation.",
    "“According to the ACLU, Black Americans are nearly four times more likely to be arrested for cannabis and related crimes than White Americans, despite equal rates of use.",
    "On Friday, the House of Representatives voted to decriminalize cannabis and take marijuana off of the federal government’s list of controlled substances.",
    "The Marijuana Opportunity Reinvestment and Expungement Act passed the lower chamber with a 220-204 vote, gaining some Republican votes.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "Republicans who voted for the bill were Representatives Matt Gaetz (FL), Brian Mast (FL), and Tom McClintock (CA).",
    "She added, “You can save the federal government $600 million over five years, and it saves lives.",
    "However, other Republicans have supported a similar bill by Representative Nancy Mace (R-SC).",
    "“I’m respecting the process that the Democrats want to go through,” Mace said, per The Times.",
    "The point was also made how the country has deeper issues that need to be fixed.",
    "Wow.”\nHe added, “This is wrong and everybody knows it.",
    "Create a free account to join the conversation!",
    "Become a member now and join our mission.",
    "Because I want to continue.",
    "It’s an important issue.",
    "“So what do they do?",
    "They legalize drugs.",
    "Believe the same?"
  ]
}