{
  "id": 1571,
  "mediaId": 2634,
  "date": "2022-04-08",
  "headline": "January 6 Recap: Exactly What Did Ivanka Trump Talk About for Eight Long Hours?",
  "image": "https://images.newrepublic.com/9b0d19a1e43aeed9eb22b6e0c5c4435087e81196.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/166061/jan-6-committee-recap-ivanka-trump-testimony",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Strauss",
  "authorUrl": "https://newrepublic.com/authors/daniel-strauss",
  "termIds": [
    1440,
    1694,
    1934,
    2140,
    2201,
    2599,
    2737,
    4109,
    4319,
    1068
  ],
  "sentences": [
    "The House voted this week that Dan Scavino and Peter Navarro, both high-level Trump administration officials, were in contempt of Congress for refusing to comply with the subpoenas issued by the committee as part of its investigation.",
    "Ivanka’s husband, Jared Kushner, who was also a senior adviser to Trump while in office and was in communication with him on January 6, has already talked to the committee—and, like his wife, did so of his own volition.",
    "They don’t want to show pictures, the fake news doesn’t want to show pictures.”—Former President Donald Trump on the crowd he addressed at the rally that preceded the deadly attack on the Capitol.",
    "Some Democrats have expressed frustration with Garland and the department for not acting on the referral of former Trump chief of staff Mark Meadows, which the House passed in December.",
    "Elsewhere, a U.S. district judge shot down former Trump chief strategist Steve Bannon’s argument for making his case against two charges of contempt of Congress in front of a jury.",
    "Trump has repeatedly argued that Pelosi and Bowser were ultimately responsible for security failures at the Capitol, even though Pelosi is not in charge of security at the Capitol.",
    "Here’s what happened this week\nThe big news about the January 6 committee came not from inside the Capitol or from investigators or attorneys but from Donald Trump himself.",
    "In an expansive interview with The Washington Post from Mar-a-Lago, the former president said he wished he could have marched with the protesters who assaulted the Capitol.",
    "Now that the House has referred Navarro and Scavino to the Justice Department for criminal contempt of Congress, all eyes will be on Attorney General Merrick Garland.",
    "But it’s extremely important that his daughter, one of the most influential people in the Trump administration, spoke with investigators for eight long hours.",
    "The Justice Department has charged hundreds of people in connection to the riot, presenting a challenge for the federal grand jury investigating the attack.",
    "Trump has also falsely claimed that Pelosi denied a request for thousands of National Guard troops to secure the Capitol ahead of the certification vote.",
    "If the Justice Department does not act on the Navarro and Scavino referrals, expect Democrats to become a bit more vocal in their complaints.",
    "It appears she did not invoke her Fifth Amendment right against self-incrimination or cite executive privilege in response to any questions.",
    "It’s also somewhat surprising that someone so close to Trump did not fight talking to the committee, as some of his lower-level allies have.",
    "Further reading\nThe committee has, at long last, obtained Trump attorney John Eastman’s emails, which he sought to shield from the panel.",
    "A federal judge found Matthew Martin not guilty on misdemeanor charges, making him the first Capitol riot defendant to be acquitted.",
    "Other Trump allies, like Congressmen Jim Jordan and Scott Perry, have refused the committee’s invitation to sit down for interviews.",
    "If there’s any emerging pattern here, it’s that some Trump allies know it’s better to comply with the committee than to defy it.",
    "That’s eight hours of probing questions and responses that will be examined over and over again and lead to more inquiries.",
    "In the interview with the Post, Trump said he knew little about what his daughter or son-in-law said to the committee.",
    "Nonsensically though, he also blamed House Speaker Nancy Pelosi and D.C. Mayor Muriel Bowser for the invasion.",
    "Plus, Daddy T tells the Post that he ached to join the marchers; and all eyes turn toward Merrick Garland.",
    "And assuming she spoke truthfully to the committee, now the January 6 committee knows those things too.",
    "Some of the panel’s members are skeptical, according to Politico’s Nicholas Wu and Kyle Cheney.",
    "Trump’s comments will only fuel more interest by the committee in speaking with him directly.",
    "The consequences of refusing to comply with the committee were on display this week as well.",
    "Should the committee issue a criminal referral to the Justice Department for Trump?",
    "Best quote of the week on January 6\n“The crowd was far bigger than I even thought.",
    "Trump said he has not been asked by the committee to sit down for an interview.",
    "Notably, Ivanka Trump this week testified before the committee for eight hours.",
    "I don’t know what that means, but you see very few pictures.",
    "I believe it was the largest crowd I’ve ever spoken to.",
    "He did not say whether he would agree to a request.",
    "“It depends what the request is,” Trump said.",
    "They have not been subpoenaed though.",
    "Ivanka knows things.",
    "Whom to watch?"
  ]
}