{
  "id": 1597,
  "mediaId": 2547,
  "date": "2022-04-01",
  "headline": "Jim Jordan Spreads More Lies About Public Education To Attack Pot Bill",
  "image": "https://crooksandliars.com/files/mediaposters/2022/04/49876.jpg",
  "link": "https://crooksandliars.com/2022/04/jim-jordan-lies-about-dhs-stopping-threats",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Amato",
  "authorUrl": "https://crooksandliars.com/team/john-amato",
  "termIds": [
    0
  ],
  "sentences": [
    "The DHS sent a National Terrorism Advisory in February because of the proliferation of misinformation being spread by right-wingers on social media and elsewhere..\nViolence directed at school boards and teachers became so severe that the DHS considered some of the more outlandish people as a real threat.",
    "During the House floor debate today on whether to federally legalize marijuana, (The bill passed in the House afterwards) Rep. Jim Jordan defended all the crazy parents who attacked and threatened school board members and teachers over the nonexistent teaching of critical race theory.",
    "Garland’s Oct. 4 memo ordered the FBI to work with state and local officials to brainstorm ways to address \"threats against school administrators, board members, teachers, and staff,\" and to establish procedures for threat \"reporting, assessment and response.\"",
    "He continued,\"Putting a threat tag label on parents, this designation, this label on moms and dads simply standing up for their kids, and Democrats are focusing on legalizing drugs...\"\nLie!",
    "\"We have a Justice Department that is treating parents as domestic terrorists, spying on moms and dads who simply show up at school board meetings, we know that's going on,\" Jordan whined.",
    "In a statement, the Justice Department clarified that the overall effort was \"designed to address the rise in criminal conduct directed toward school personnel.\"",
    "In addition, Garland clearly indicated that parents can challenge school curriculums or voice opinions that differ from that of their local school officials.",
    "One issue does not relate to the other, but Republicans always find the time to whine about their right-wing phony grievances.",
    "The word \"terrorist\" did not appear in either the memo or the Justice Department statement.",
    "Rep. Jordan actually put on a jacket today to rain down some wingnut performance art.",
    "None of that is actually happening, but it'll play well on Newsmax.",
    "Bus as usual, Gym Jordan lies about it.",
    "Topics:"
  ]
}