{
  "id": 1607,
  "mediaId": 4024,
  "date": "2022-04-05",
  "headline": "US lawmakers call for DC mayor, Dept. of Justice to investigate abortions of late-term babies",
  "image": "https://www.lifesitenews.com/wp-content/uploads/2021/03/GettyImages-1248782237.jpg",
  "link": "https://www.lifesitenews.com/news/us-lawmakers-call-for-dc-mayor-dept-of-justice-to-investigate-abortions-of-late-term-babies/",
  "mediaOutlet": "LifeSiteNews",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1370,
    1440,
    1715,
    4375,
    282,
    556,
    559
  ],
  "sentences": [
    "In light of the refusal of the D.C. police to investigate potential violations of federal law, the Republican lawmakers wrote in their letter, according to The Daily Wire, that they “demand that a thorough investigation is conducted into the death of each child.” They added that “in order to accomplish such [an] investigation, we request and fully expect the city to preserve all of the children’s remains as evidence and conduct autopsies.”\nLed by James Lankford of Oklahoma and Jim Jordan of Ohio, the letter also was signed by Thom Tillis of North Carolina, James Risch of Idaho, Mike Braun of Indiana, Jim Inhofe of Oklahoma, Roger Marshall of Kansas, Josh Hawley of Missouri, and Mike Crapo of Idaho.",
    "Also, one of the late-term babies seemed very obviously a victim of partial-birth abortion, and so we were concerned from that moment on [about] preserving this evidence and of attempting to get justice for them, and to hopefully bring accountability to Santangelo.”\nHowever, Bukovinac attested that the day after they “made arrangements through an attorney to hand them over to the medical examiner to make this determination about whether or not federal crimes had been committed,” Handy and eight other pro-lifers were arrested for blocking the entrances to the same D.C. abortion facility about two years prior, in an effort to save babies’ lives.",
    "In a letter exclusively obtained by The Daily Wire, the U.S. legislators said the aborted babies who were discovered “deserve to have their deaths investigated to ensure that no D.C. or federal laws were broken.”\nLive Action posted images of the aborted babies in question on Twitter (Warning: Post contains graphic and disturbing images)\nLauren Handy and Terrisa Bukovinac, members of the Progressive Anti-Abortion Uprising (PAAU), told LifeSiteNews in an exclusive interview that on March 25 they planned a “pink rose rescue” to save babies at the Washington Surgi-Center, a D.C. abortion mill.",
    "They noted that “one baby girl has significant damage to her head, with deep lacerations at the back of the neck, and may have been victim of an illegal partial birth abortion,” and that “another baby was found in its amniotic sac and could have been born alive,” but that without an autopsy, they cannot ascertain how “each child died.”\n“Instead of ensuring that the horrific deaths of these children were properly investigated, Metropolitan Police made the assumption that each child died as the result of a legal abortion,” the lawmakers wrote.",
    "This is completely unacceptable.”\nAccording to The Daily Wire, the lawmakers asked Bowser to explain, by April 6, how police concluded that the babies in question were legally aborted, and also asked her preserve the babies’ bodies as evidence, and to direct the city medical examiner and an independent pathologist to perform autopsies on the children.",
    "The legislators acknowledged possible violations of both the Partial-Birth Abortion Ban Act of 2003 and the Born Alive Infants Protection Act, writing in their letter:\nWhile other horrific methods of abortion unfortunately remain legal for the time being, killing a child through a partial-birth abortion is a crime under federal law.",
    "Under the Partial-Birth Abortion Ban Act of 2003, a partial-birth abortion occurs when a physician partially delivers a living child for the purpose of performing an overt act that intentionally takes the life of the child.The U.S. Supreme Court upheld the federal ban on partial-birth abortions in Gonzales v. Carhart in 2007[2].",
    "“Regrettably, though, the D.C. police has already made a statement saying they don’t believe any crimes have been committed here, that the babies were aborted according to D.C. law, and that they are not pursuing an investigation as to how these babies died, and how we acquired the fetuses,” Bukovianc said.",
    "Help these pro-life heroes continue their work: LifeFunder.com\n(LifeSiteNews) — Republican lawmakers have written to the Department of Justice and Washington D.C. Mayor Muriel Bowser, urging them to investigate the abortions of five babies whose bodies were recovered by pro-life activists.",
    "“If any autopsy suggests any of the children were victims of criminal activity, will you immediately refer the evidence to both the Department of Justice and the Attorney General for the District of Columbia for criminal prosecution,” the lawmakers wrote.",
    "Catholic Vote and other groups, including Live Action, Concerned Women for America Legislative Action Committee, March for Life, Students for Life Action, the Susan B. Anthony List and Americans United for Life, voiced support of the letter.",
    "That means that the likelihood of a late-term baby being born alive is extremely high … ”\nBukovinac continued, “We knew right away that there was evidence here of federal crimes, like [against] the Born-Alive Infant Protection Act.",
    "If the bodies of other babies who were not aborted were recovered in a similar fashion, it would be hard to imagine Metropolitan Police declining to conduct a thorough investigation into the deaths of each child.",
    "Bukovinac told John-Henry Westen that the driver agreed to give to them the bodies of the aborted babies after Handy assured him their intent was to give the babies a “proper burial” and a funeral.",
    "She explained that they “know from undercover footage that’s been released by Live Action” that the facility’s abortionist, Cesare Santangelo, “does not use feticide when doing abortions.",
    "Upon arrival, they saw a Curtis Bay Medical Waste Services truck parked outside the facility and confirmed that the driver was loading “waste” from the abortion mill.",
    "In the box they were given, they found over 115 unborn children, five of whom were “extremely late term.”\n“And then our lives were changed forever,” Bukovinac said.",
    "Washington Surgi Clinic, which says it performs abortions up to the second trimester, “declined to comment on the aborted fetal remains” to The Daily Wire.",
    "Additionally, Congress passed the Born Alive Infants Protection Act to provide equal protections for children who are born alive during an abortion.",
    "We also understand from press reports that the D.C. medical examiner does not plan to perform autopsies on the children.",
    "“It is our understanding that this assumption was made without conducting any medical evaluations.",
    "Washington, D.C. effectively allows abortion all through nine months of pregnancy.",
    "“It definitely seems like a wild coincidence,” Bukovianc acknowledged to Westen.",
    "Help these pro-life heroes continue their work: LifeFunder.com"
  ]
}