{
  "id": 1685,
  "mediaId": 2746,
  "date": "2022-04-01",
  "headline": "House passes bill to legalize marijuana, setting up long-shot bid in Senate",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/01/Congress_Marijuana_Legalization_89161.jpg-30238_c0-250-6000-3750_s1200x700.jpg?2cb823f519263a3e55a419724463fd44fb7f7c61",
  "link": "https://www.washingtontimes.com/news/2022/apr/1/house-passes-bill-legalize-marijuana-setting-long-/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haris Alic",
  "authorUrl": "https://www.washingtontimes.com/staff/haris-alic/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Our goal must be to end [the] country’s militarized ‘jail first, ask questions later,’ approach to addiction and to stop trying to solve social problems with more criminalization.”\nOutside of the criminal justice system, the legislation would impose a new excise tax on marijuana products produced or imported for commercial sale.",
    "Democratic Sen. Jon Tester, whose home state of Montana approved the recreational sale of marijuana in 2020, says federal legalization would “cause more problems than it solves.”\nWhile the bill ends the federal prohibition on marijuana, it does not overrule state laws concerning the drug.",
    "“We’re in the middle of an opioid epidemic, and the research that I’ve seen suggests that that is a way that more people get into drugs.”\nOpposition to the legislation also comes from lawmakers representing states that have legalized the drug.",
    "The bill also would eliminate federal penalties for the distribution and possession of marijuana, while expunging criminal records and slashing prison sentences for individuals convicted of such crimes.",
    "Several states use a mixed approach to marijuana, with some embracing full legalization and others only decriminalizing the drug or allowing its use for medicinal purposes.",
    "“Record crime, record inflation, record gas prices, a record number of illegal immigrants crossing our southern border,” said Rep. Jim Jordan, Ohio Republican.",
    "Three Republicans — Reps. Matt Gaetz and Brian Mast of Florida, as well as Tom McClintock of California — joined with 217 Democrats to help pass the bill.",
    "In a 220-204 vote, the House passed legislation removing the drug from the purview of the Controlled Substances Act, legalizing its manufacture and sale.",
    "Some opponents questioned in particular the timing and priority of the push, given the crises facing the Biden administration at home and abroad.",
    "The House passed a bill to end the federal prohibition on marijuana and kicked the issue to the Senate, where it faces long odds to succeed.",
    "Meanwhile, two Democrats, Reps. Chris Pappas of New Hampshire and Henry Cuellar of Texas, joined 202 Republicans in opposing the bill.",
    "It also would make federally subsidized small business loans available for businesses selling marijuana and its related products.",
    "In 2017, for instance, 92 out of 20,000 drug offenders were in federal prison for marijuana possession, according to the U.S.",
    "Legalizing drugs.”\nThe bill now heads to the Senate, where it faces long odds of getting the 60 votes needed for it to pass.",
    "Opponents note that the federal prison population includes very few individuals convicted for the possession of marijuana.",
    "“I have not changed my position on it.”\nOther lawmakers worry that legalization could make the opioid epidemic worse.",
    "Eighteen states, including Alaska, Michigan and Virginia, have legalized the recreational use of marijuana.",
    "“I think this is a terrible public policy,” said Sen. Mike Rounds, South Dakota Republican.",
    "Similarly, 37 states have passed laws to allow marijuana to be used for medicinal reasons.",
    "Only three states — Idaho, Nebraska and Kansas — still ban the drug for all purposes.",
    "“I don’t support legalizing marijuana,” Sen. Jeanne Shaheen, New Hampshire Democrat.",
    "Republicans and even moderate Democrats in the chamber say the bill goes too far.",
    "“We must be bold,” said Rep. Rashida Tlaib, Michigan Democrat.",
    "Friday’s vote saw defection from both sides.",
    "“What are Democrats doing today?",
    "Sentencing Commission."
  ]
}