{
  "id": 1692,
  "mediaId": 6687,
  "date": "2022-04-02",
  "headline": "Chairman of House Freedom Caucus endorses Mo Brooks – He ‘fights unwaveringly for our conservative values’",
  "image": "https://yellowhammernews.com/wp-content/uploads/2022/04/Scott-Perry-Mo-Brooks.jpg",
  "link": "https://yellowhammernews.com/chairman-of-house-freedom-caucus-endorses-mo-brooks-he-fights-unwaveringly-for-our-conservative-values/?utm_source=rss&utm_medium=rss&utm_campaign=chairman-of-house-freedom-caucus-endorses-mo-brooks-he-fights-unwaveringly-for-our-conservative-values",
  "mediaOutlet": "yellowhammernews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yaffee",
  "authorUrl": "https://yellowhammernews.com/author/Yaffee/",
  "termIds": [
    2140,
    3654,
    3942,
    4537,
    409,
    1163,
    4814,
    5239
  ],
  "sentences": [
    "I pray Alabama will not be misled by the millions backing the “Pretenders” and do the homework necessary to figure out that there is only one proven conservative in this race, and that proven conservative is Mo Brooks,” he said.",
    "“People in Congress, from Senators Rand Paul and Ted Cruz to Congressmen Marjorie Taylor Greene, Brian Babin, Thomas Massie, Jim Jordan, Scott Perry and many, many others know Alabama’s Senate race is a no-brainer.",
    "“If border security, moral values, lower taxes, America’s financial stability, pro-Life, right to Bear Arms, and a strong military are important to you, you should vote for Mo Brooks for US Senate,” he explained.",
    "Brooks joins Congressmen Gary Palmer (R-Hoover) and Barry Moore (R-Enterprise) as representatives of Alabama’s congressional delegation who are currently members of the conservative group of legislators.",
    "Wednesday, retired U.S. Army Brigadier General and chairman of the House Freedom Caucus Congressman Scott Perry (R-Pa.) endorsed Mo Brooks (R-Huntsville) for the United States Senate.",
    "He’s a man of integrity who fights unwaveringly for our conservative values – regardless of the dishonest, personal attacks of Socialist Democrats and RINOs alike,” he said.",
    "If you want Mitch McConnell, the Establishment and Open Borders Special Interest Groups to rule Washington, vote Katie Britt.",
    "Yaffee is a contributing writer to Yellowhammer News and hosts “The Yaffee Program” Weekdays 9-11am on WVNN.",
    "Brooks put out a statement touting the endorsements of Perry and other well-known conservative lawmakers.",
    "I wholeheartedly endorse Mo Brooks for US Senate, and I hope you will, too,” he concluded.",
    "The Pennsylvania congressman also acknowledged Brooks’ conservative record in Washington.",
    "Brooks was a founding member of the Freedom Caucus in 2015 and is still a member.",
    "If you are a Never Trump, Lincoln Project liberal, vote Mike Durant.",
    "In a press release, Perry praised Brooks’ conservative credentials.",
    "“The enemy is within, and America is in the fight for her life.",
    "Mo Brooks is the man we need in the Senate to win that fight.",
    "“I’ve served with Congressman Mo Brooks for almost a decade.",
    "Perry argued that the Senate needed a fighter like Brooks.",
    "If you are a principled conservative, vote Mo Brooks.",
    "Perry was elected as chairman in 2021.",
    "You can follow him on Twitter @Yaffee"
  ]
}