{
  "id": 1693,
  "mediaId": 2724,
  "date": "2022-04-06",
  "headline": "Never Trumper Adam Kinzinger Falls For Fake Tucker Carlson Quote Shared By Fellow ‘Never Trumper’ Joe Walsh",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/04/2022.04.06-12.33-thepoliticalinsider-624d889ea1a7d.jpg",
  "link": "https://thepoliticalinsider.com/never-trumper-adam-kinzinger-falls-for-fake-tucker-carlson-quote-shared-by-fellow-never-trumper-joe-walsh/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rusty Weiss",
  "authorUrl": "https://thepoliticalinsider.com/author/rusty-weiss/",
  "termIds": [
    1328,
    1604,
    1924,
    3227,
    4087,
    4364,
    404,
    1163,
    5287,
    5366
  ],
  "sentences": [
    "Why can’t we ask these questions?”\n— Joe Walsh (@WalshFreedom) April 4, 2022\nRELATED: Never Trumper Kinzinger Chickens Out Of Interview Invite From Tucker Carlson: Says He’s Too ‘Hostile’\nJoe Walsh Fakes Tucker Carlson Quotes\nDespite the obviously manufactured comments, the use of, and apparent misunderstanding by Walsh of what quotation marks are, had some people believing it to be an actual statement on the part of the Fox News personality.",
    "Breaking: Following @FDRLST reporting that Adam Schiff and his staff doctored a text message between Jim Jordan and former WH chief of staff Mark Meadows, the House Jan. 6 committee has just admitted that it did, in fact, doctor the text message.https://t.co/78aRNyOib7\n— Mollie (@MZHemingway) December 15, 2021\nIt seems there isn’t much that Kinzinger isn’t willing to believe if it casts a negative pall on his political adversaries.",
    "The incomparably dumb and unhinged @AdamKinzinger took a fabricated quote from long-time-deadbeat-dad-turned-liberal-hero @WalshFreedom, believed it true, and used it to declare a journalist a “Russian asset” – just as hordes of dumb liberals did with @TheRickWilson‘s fake quote.",
    "Share\nTweet\nShare\nShare\nFlip It\nComment\nEmail\nSoon-to-be-former Illinois Congressman Adam Kinzinger shared a fake quote posted by fellow anti-Trumper Joe Walsh, suggesting Fox News host Tucker Carlson questioned whether Ukraine had staged deaths during the Russian invasion.",
    "Schiff presented the text message as having come from Jordan himself, rather than having been forwarded information, reduced the summary to one paragraph which itself was truncated, and added a period to create the illusion of it being the full statement.",
    "She shared Walsh’s tweet adding, “It’s almost like Tuckums is getting his show scripts straight from the Kremlin or the GRU.”\nJoyums, of course, is the same MENSA candidate who wrote homophobic blog posts – allegedly – then claimed she was hacked.",
    "Just weeks ago, the lawmaker showed support for the so-called “Ghost of Kyiv” – only what he shared was a long-running joke meme of a character known as “Samuel Hyde.”\nHe quickly deleted the poorly photoshopped tweet hoping nobody would notice.",
    "My video statement: pic.twitter.com/plfOhh6bNb\n— Adam Kinzinger (@AdamKinzinger) March 14, 2022\n“His show is full of Russian propaganda and not news, and I will not validate his show by making an appearance,” Kinzinger claimed.",
    "“The incomparably dumb and unhinged @AdamKinzinger took a fabricated quote from long-time-deadbeat-dad-turned-liberal-hero @WalshFreedom, believed it true, and used it to declare a journalist a ‘Russian asset,'” he fumed.",
    "(@JoyAnnReid) April 4, 2022\nKinzinger is Easily Duped\nThere were a handful of others who were duped by the Joe Walsh tweet, desperately wanting a cudgel to use against the successful Fox News host.",
    "I don’t know, just asking questions https://t.co/1Vw4zYAMpD\n— Adam Kinzinger (@AdamKinzinger) April 5, 2022\nJoining the crowd was another expected addition – MSNBC host Joy Reid.",
    "“I do not want to be associated with it in any way.”\n“When Tucker interviews someone in a hostile way, he interrupts and laughs when he’s been caught in a lie,” he whined.",
    "“I sent that tweet b4 Tucker’s show, said ‘tonight’ predicting what he’d say.”\n“And btw, @AdamKinzinger is a great public servant & patriot.”\nThat is also fake news.",
    "(@MrAndyNgo) April 5, 2022\nWhat makes Kinzinger’s comments of interest is the fact he currently serves on the House select committee investigating the Capitol riot.",
    "“I gotta say, if [Tucker Carlson] is not a Russian asset he should be, he is absolutely over-qualified for the job,” he said retweeting the manufactured comments.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "“What if these bodies of tortured, dead civilians were staged?” the former congressman tweeted, alleging these were, or would be, questions asked by Carlson.",
    "Of course, had there been any question as to the authenticity of Walsh’s “quote” from Tucker Carlson, Kinzinger could have asked the Fox News host himself.",
    "Walsh, meanwhile, refused to apologize for publishing the fake quotes and suggested the real story is that there are people dumb enough to believe them.",
    "I don’t know, just asking questions.”\nI gotta say, if @TuckerCarlson is not a Russian asset he should be, he is absolutely over-qualified for the job.",
    "The committee even created a graphic complete with a logo bearing similarities to a chat icon to make it appear as if it was a singular text message.",
    "I was predicting what @TuckerCarlson would say “tonight.” Here’s what’s funny: So many people read this tweet & believed Tucker had already said it.",
    "It’s almost like Tuckums is getting his show scripts straight from the Kremlin or the GRU… https://t.co/slVQfnqV5e\n— Joy-Ann (Pro-Democracy) Reid ??",
    "Prior to that, the same select committee Kinzinger serves admitted to altering a text message presented by Representative Adam Schiff as evidence.",
    "Walsh, previously a Tea Party Congressman from Illinois turned virulent Never Trumper, posted comments he labeled as coming from Carlson’s show.",
    "With that in mind, the cast of gullible rubes you’d expect came along, sharing Walsh’s tweet and offering their take on what they were reading.",
    "In its original form, the text was a three-paragraph summation of a legal briefing by lawyer Joseph Schmitz to Meadows, as forwarded by Jordan.",
    "pic.twitter.com/vhRaKDy6wE\n— Glenn Greenwald (@ggreenwald) April 5, 2022\nThis isn’t the first time Kinzinger has fallen for manufactured news.",
    "@WalshFreedom fabricated a quote attributed to Tucker Carlson that went viral & was quoted as real by journalists & influencers on Twitter.",
    "“Which is understandable becuz it’s EXACTLY the kind of thing Putin-lover Tucker would [and] has said.”\nI tweeted this out this morning.",
    "Meaning, that he’ll desperately want you to believe the biased committee’s findings even as he is spreading obviously fake news.",
    "https://t.co/dxDLDjOPK1\n— Joe Walsh (@WalshFreedom) April 5, 2022\nWalsh predictably praised Kinzinger for sharing the fake news.",
    "“Here’s what’s funny: So many people read this tweet [and] believed Tucker had already said it,” Walsh said of the controversy.",
    "Read this Next on ThePoliticalInsider.com\nElon Musk May Be ‘Strange’ – But That’s Why He Could Be Our Free Speech Champion",
    "“I didn’t fabricate a thing,” Walsh claimed, suggesting his quotes weren’t meant to be read as actual quotes.",
    "The message was allegedly between former White House chief of staff Mark Meadows and Rep. Jim Jordan (R-OH).",
    "Keep in mind, Kinzinger serves on the House Foreign Affairs Committee, and still fell for a hilarious joke.",
    "Sign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "Which is understandable becuz it’s EXACTLY the kind of thing Putin-lover Tucker would & has said.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "@TuckerCarlson tonight: “What if these bodies of tortured, dead civilians were staged?",
    "Carlson recently put out an open invitation for the congressman to appear on his show.",
    "While he echoes Putin’s lies, I’ll remain focused on supporting the Ukrainian people.",
    "Tucker Carlson invited me on his show tonight, but that’s not going to happen…ever.",
    "Carlson last week joked about whether or not Vladimir Putin had been the hacker.",
    "Mr. Tough Guy.”\nKinzinger instead put out a statement declining the invitation.",
    "Many of them involved even less relevant people than Kinzinger and Reid.",
    "Journalist Glenn Greenwald ended Kinzinger for falling for the hoax.",
    "I’m not saying any of this is true, I’m just asking the questions.",
    "I’m not saying any of this is true, I’m just asking the questions.",
    "What if the Ukrainian military killed them & then blamed Russia?",
    "What if the Ukrainian military killed them & then blamed Russia?",
    "“Adam Kinzinger is always invited on the show,” he said.",
    "pic.twitter.com/43nfeurT0R\n— Andy Ngô ??????",
    "Why can’t we ask these questions?”\n.",
    "Enter Adam Kinzinger (R-IL).",
    "We will give him the hour.",
    "“Is he a Russian asset?",
    "Is he a Russian asset?",
    "“What if they’re fake?",
    "What if they’re fake?",
    "“Any time.",
    "."
  ]
}