{
  "id": 1717,
  "mediaId": 4032,
  "date": "2022-04-06",
  "headline": "U.S. Legislators Demand #JusticeForTheFive",
  "image": "https://thenewamerican.com/assets/sites/2/lankford-2.jpg",
  "link": "https://thenewamerican.com/u-s-legislators-demand-justiceforthefive/?pk_campaign=feed&pk_kwd=u-s-legislators-demand-justiceforthefive",
  "mediaOutlet": "New American",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Terrell",
  "authorUrl": "https://thenewamerican.com/editor/rebecca-terrell/",
  "termIds": [
    1440,
    1670,
    1715,
    54,
    609,
    1163,
    5390
  ],
  "sentences": [
    "In order to accomplish such investigation, we request and fully expect the city to conduct autopsies on\nthe remains of each child that all of the children died as the result of a legal abortio\nIn order to ensure that no child was subjected to a partial birth abortion and that no child was born\nalive and left to die, will you commit to conducting a thorough investigation of the death of each\nWill you direct the Chief Medical Examiner to perform an autopsy on each child to determine the",
    "One of the children was still in the amniotic sac, indicating that it “may have been born alive.” They also cite video evidence that one of the infants fell victim to an “illegal partial birth abortion.”\n“If the bodies of other babies who were not aborted were recovered in a similar fashion, it would be hard to imagine the Metropolitan Police declining to conduct a thorough investigation into the death of each child,” reads the letter.",
    "If the bodies of other babies who were not aborted were recovered in\na similar fashion, it would be hard to imagine the Metropolitan Police declining to conduct a thorough\nthese children appear to have developed well past the point of viability, and likely suffered severely painful\ngirl has significant damage to her head, with deep lacerations at the back of the neck, and may have been\nvictim of an illegal partial birth abortion.",
    "While other horrific methods of abortion unfortunately remain legal for the time being, killing a child through\nbirth abortion occurs when a physician partially delivers a living child for the purpose of performing an\nAdditionally, Congress passed the Born Alive Infants Protection Act to provide equal protections for children\ne during an abortion.",
    "As Members of Congress, we have an obligation to conduct oversight over the District of Columbia (D.C.),\nto ensure D.C. upholds laws enacted by Congress, particularly those enacted to protect and uphold the\nMetropolitan Police made the assumption that each child died as the result of a legal abortion.",
    "The signatories request an answer from Bowser and Contee by late Wednesday to seven demands, including commitments to “properly and respectfully burying each child” after thorough investigations of each corpse to determine if federal laws were violated in their slayings.",
    "Senator James Lankford (R-Okla.) and U.S. Representative Jim Jordan (R-Ohio), along with 21 of their congressional colleagues, signed an April 5 letter to D.C. Mayor Muriel Bowser and metropolitan police chief Robert J. Contee about the remains.",
    "They turned the bodies over to the D.C. medical examiner, who Lankford and his colleagues say decided not to conduct autopsies, simply assuming without medical evaluation that the children died in legal abortion procedures.",
    "But at a minimum, they deserve to have their deaths investigated to ensure that no D.C. or federal laws\nIn light of this information, we demand that a thorough investigation is conducted into the death of each\nchild.",
    "The lawmakers charge, “This is completely unacceptable.”\nThe legislators cite the Born Alive Infants Protection Act, which requires doctors to help a baby who survives abortion to live.",
    "Members of Congress are demanding an investigation into the “horrific deaths” of five babies, whose bodies were recovered from a Washington, D.C., abortion mill.",
    "Pro-life activists discovered the discarded bodies of the pre-born infants on March 25 outside the Washington Surgi-Clinic in the district’s northwest section.",
    "Another baby was found in its amniotic sac and could\nThese five children, like all children, have inherent value and deserved better than abortion\nlife.",
    "They accuse the abortionist, Dr. Cesare Santangelo, of performing illegal late-term and live-birth abortions there.",
    "U.S."
  ]
}