{
  "id": 1720,
  "mediaId": 2636,
  "date": "2022-03-31",
  "headline": "Can Republicans Win by Just Saying No?",
  "image": "https://static01.nyt.com/images/2022/03/31/us/politics/THEPOWEROFNO/THEPOWEROFNO-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/03/31/us/politics/republican-midterm-strategy.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“It was so bad for Truman that people were saying he should resign,” said Jeffrey Frank, author of “The Trials of Harry S. Truman.”\nThis was the year that a young Richard Nixon won his first congressional election, defeating a five-term Democratic incumbent in suburban Los Angeles by running against New Deal “socialism” and for what he called the “forgotten man.” His campaign literature asked: “Are you satisfied with present conditions?",
    "Meat was scarce and expensive — so much so that Republican candidates patrolled city streets in trucks booming out the message, “Ladies, if you want meat, vote Republican.” They slapped President Harry Truman with the moniker “Horsemeat Harry.”\n“This is going to be a damned beefsteak election!” Sam Rayburn, the Democratic speaker of the House, privately fumed.",
    "At campaign stops, Truman called Republicans names like “bloodsuckers” and a “bunch of old mossbacks still living back in 1890.” At one appearance in Roseville, Calif., he said the “do-nothing Congress tried to choke you to death in this valley.” In Fresno, Calif., he said: “You have got a terrible congressman here in this district.",
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering, though this year’s map is poised to be surprisingly fair\nGovernors’ Races: Georgia’s contest will be at the center of the political universe, but there are several important races across the country.",
    "“McConnell understands this better than anyone of the last 15 years.”\nSo Democrats have taken to Scott’s plan like a drowning man to a life preserver, highlighting his call for every American to have “skin in the game” by paying taxes and accusing him of wanting to cut Medicare and Social Security.",
    "At the recent policy retreat for House Republicans, McCarthy explained his hope of presenting Biden with legislation “so strong it could overcome all the politics that other people play.”\n‘Just criticize rather than be specific’\nAs a political strategy, though, no plan probably beats a plan.",
    "Or from another Democratic ad that Senator Mark Kelly of Arizona began running in late February that acknowledged “families are working hard to get by right now.”\nGovernors might have a little more room to highlight state and local achievements than members of Congress.",
    "A federal judge in Florida said that sections of the state’s election law were unconstitutional, the first federal court ruling striking down key parts of a major Republican voting law since the 2020 election, Reid J. Epstein and Patricia Mazzei report.",
    "Senate Democrats are running a paid ad on Scott’s plan this week in key swing states, and on Thursday they bought a geo-targeted ad around the Heritage Foundation in Washington, during a speech that Scott gave at the conservative think tank.",
    "Senator Rick Scott, the head of the Republican Senate campaign arm, has an 11-point plan to “rescue America.” House Republicans are working on their “Commitment to America,” a political and policy agenda they plan to release in late summer.",
    "According to Alan Feuer, Katie Benner and Maggie Haberman, the Justice Department has widened its investigation into the Jan. 6 attack on the Capitol to encompass possible involvement of other government officials.",
    "What to read tonight\nBiden announced he would tap the Strategic Petroleum Reserve once again, Clifford Krauss and Michael D. Shear report, in a move intended to lower gasoline prices for American consumers.",
    "Democrats’ two paths\nThere’s a lot of doom and gloom across America, something Republican campaigns have leveraged to try to persuade voters to change the status quo and oust Democrats from Congress.",
    "Michael Barone, the founding editor of the Almanac of American Politics, said he expected Republicans to win back the House and “probably” the Senate, regardless of how specific their plans were.",
    "Still, by trying to prove that they’ve improved conditions since the coronavirus pandemic began, Democrats may run the risk of seeming out of touch with their constituents’ day-to-day struggles.",
    "If they do win one or both branches of Congress, Democrats will be able to draw on a playbook made famous by the same president who was so humbled by the slogan “Had enough?” in 1946.",
    "Two years after his midterm drubbing, Truman mounted a comeback often hailed as the greatest in American political history, using the “do-nothing Congress” as his political foil.",
    "End of discussion.”\n‘What’s Mitch for?’\nDemocrats are eager to turn this fall’s elections into a choice between the two parties rather than a referendum on their own performance.",
    "Never mind that Congress had been extraordinarily productive, passing more than 900 bills that included landmark legislation such as the Marshall Plan and the Taft-Hartley Act.",
    "Senator Lindsey Graham, Republican of South Carolina, announced he would vote against the confirmation of Judge Ketanji Brown Jackson to the Supreme Court, Annie Karni reports.",
    "“If I were the Republicans, I would just criticize rather than be specific about my remedies, unfortunately,” said Geoffrey Kabaservice, a historian of the Republican Party.",
    "It’s an article of faith among many on the right that the 1994 “Contract With America” led by Newt Gingrich was responsible for that year’s Republican takeover of Congress.",
    "In the 1946 midterms, Republicans united around a simple but powerful mantra: “Had enough?”\nThe slogan was the brainchild of Karl Frost, an advertising executive in Boston.",
    "Representative Kevin McCarthy of California, who hopes to become speaker of the House, shares Scott’s view that a plan is necessary, though they may differ on the details.",
    "But Republicans in the Senate, led by Bob Dole of Kansas, never embraced it, while polls at the time showed that only a minority of voters had ever heard of the idea.",
    "“The fundamentals of a midterm election hold: It’s about the party in power,” said Zack Roday, a Republican strategist who is working on several Senate campaigns.",
    "All they need to do to win back power is point to voters’ frustrations with the high prices of gasoline and groceries and say, essentially: Had enough?",
    "He is one of the worst.” And in Iowa, he said the Republican Congress had “stuck a pitchfork in the farmer’s back.”\nThe rest, as they say, is history.",
    "It’s a sharp departure from a Democratic ad we highlighted last month from Senator Raphael Warnock of Georgia, in which the sun was noticeably absent.",
    "He’s said his focus is “100 percent” on “stopping this new administration” and has avoided presenting ideas that Democrats might be able to attack.",
    "In two short words, it promised a rejection of both New Deal liberalism and the monopoly of power Democrats had held in Washington since the 1930s.",
    "Some voters in North Carolina think Representative Madison Cawthorn has finally gone too far, Trip Gabriel reports from Cawthorn’s district.",
    "In his first ad of the cycle, he paints a sunny picture, smiling as he strolls through suburban neighborhoods and talks with constituents.",
    "Democrats would later exploit Gingrich’s unpopularity to gain seats in the 1998 midterms, a rare victory for the president’s party.",
    "And Republicans, as our colleague Jonathan Weisman reports today, are debating just how forthcoming to be about their own plans.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycle’s defining topics.",
    "At times, President Biden has tried to corral Mitch McConnell, the Senate’s top Republican, into defining the party’s agenda.",
    "It leaves Democrats with a tough decision: empathize with voters’ hardships or put forward a different narrative entirely?",
    "World War II had just ended, and supply chains were going haywire as the U.S. emerged from wartime price controls.",
    "“The midterms are a referendum on one thing and one thing only: Joe Biden and the Democrats’ failed leadership.",
    "Republicans picked up 55 seats in the House and 12 in the Senate, taking power for the first time since 1932.",
    "Inflation is way up, some goods are hard to find and Democrats are staring at a similar wipeout in November.",
    "He boasts that he turned the state’s deficit into a surplus, while lowering taxes and investing in schools.",
    "“A balanced budget, lower taxes — our state is strong and getting stronger,” Lamont declares to the camera.",
    "“He had just one strategy — attack, attack, attack,” writes David McCullough, another Truman biographer.",
    "Four months before Election Day, with his job approval rating stuck in the 30s, Truman went on offense.",
    "A policy agenda, he said, is more important for determining “how you want to govern” once in power.",
    "Ned Lamont, a Democrat who is up for re-election this year, seems to be taking the second approach.",
    "And today, Mike Pence, the former vice president, unveiled a 28-page “Freedom Agenda” platform.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "A choice.”\nMidterms Begin: The Texas primaries officially opened the 2022 election season.",
    "Can you buy meat, a new car, a refrigerator, clothes you need?”\nWhat’s old is new again.",
    "What’s he proposing?” Biden said in late January, adding: “What are they for?",
    "For Republican leaders today, being in power poses a dilemma of its own.",
    "“This isn’t rocket science,” said Corry Bliss, a Republican strategist.",
    "By Election Day, Truman’s approval rating was just 33 percent.",
    "Some Republicans argue that none of it is really necessary.",
    "— Blake & Leah\nIs there anything you think we’re missing?",
    "It helped Republicans that the economy was in chaos.",
    "“The fundamental question is, what’s Mitch for?",
    "Here are the four incumbents most at risk.",
    "Thousands of workers went on strike.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "McConnell never took the bait.",
    "See the full primary calendar.",
    "What’s he for on immigration?",
    "We’d love to hear from you.",
    "So everything’s a choice.",
    "We’ll see you tomorrow.",
    "In Connecticut, Gov.",
    "Thanks for reading.",
    "What’s he for?",
    "Period."
  ]
}