{
  "id": 1734,
  "mediaId": 2664,
  "date": "2022-03-31",
  "headline": "Trump's executive assistant was out of office during 7-hour gap in call logs: report?",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=25146311&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/trump-phone-records-2657074860/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    2201,
    2752,
    2918,
    781
  ],
  "sentences": [
    "\"Though sources said the Trump White House's already spotty record-keeping operation had virtually collapsed by the final weeks of his presidency, Michael's absence is a previously unreported detail that may play a role in explaining the incomplete records for a key stretch of time,\" reported Jonathan Swan and Alayna Treene.",
    "According to the report, she was out for \"personal reasons\" — and \"in her absence, the two staffers there during the critical hours of the Capitol siege were Nick Luna, the head of Oval Office Operations, who served as Trump's body man, and Austin Ferrer, a young staffer who assisted Michael in her administrative duties.",
    "On Thursday, Axios reported that Molly Michael, the executive assistant to former President Donald Trump, was absent for most of the day of the January 6 Capitol insurrection — coinciding with the 7 hour and 37 minute gap in White House call records that House investigators are trying to piece together.",
    "\"Her absence — coupled with the already shambolic state of record-keeping in the Outer Oval — also could complicate efforts to piece those details back together 14 months after that fateful day.\"",
    "So far, Republicans known to have been in contact with Trump, like Rep. Jim Jordan (R-OH), have been evasive when asked by reporters about the nature of their discussions around that time.",
    "One former White House official had previously suggested the executive assistant could have been a witness to these conversations, but her absence could eliminate that as an option.",
    "It remains unclear whom Trump contacted during that 7-hour gap, and investigators are reportedly looking into whether he used \"burner phones\" during that period.",
    "By the time Michael arrived, late that afternoon, the White House was a \"'sh-tshow' in the words of one official who was there,\" writes Axios."
  ]
}