{
  "id": 1786,
  "mediaId": 2548,
  "date": "2022-04-05",
  "headline": "Video Reportedly Shows ‘Mass Release’ Of Illegal Migrants Into Texas City",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/04/IMG-6564-e1649175054572.jpg",
  "link": "https://dailycaller.com/2022/04/05/video-shows-mass-release-illegal-migrants-texas/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Silverio",
  "authorUrl": "https://dailycaller.com/author/nicole.dcnf@gmail.com",
  "termIds": [
    1670,
    3975,
    4133,
    404,
    1098,
    4875,
    5352
  ],
  "sentences": [
    "I’m told several hundred are released here every day, mostly via parole @FoxNews pic.twitter.com/4ZC9MeFoio\n— Bill Melugin (@BillFOXLA) April 5, 2022\nWith parole releases, the migrants are supposed to turn themselves into Immigration and Customs Enforcement (ICE) in a city of their choice, Melugin said.",
    "These numbers are expected to largely stem from the Centers of Disease Control and Prevention (CDC) announcing an end to a Trump-era policy Title 42, which allowed for the expulsion of 1.7 million migrants to protect against COVID-19.",
    "(RELATED: ‘This Is Intentional’: Rep. Jim Jordan Rips Biden Administration’s Handling Of Southern Border, COVID-19)\nSources tell me w/ parole releases, the migrants are asked to turn themselves into ICE in a city of their choice.",
    "pic.twitter.com/tAogWloQgy\n— Bill Melugin (@BillFOXLA) April 5, 2022\nThe Department of Homeland Security (DHS) is reportedly preparing for 18,000 apprehensions per day, nearly triple the current number.",
    "I’m told many of them are given these phones by the government to track them and allow them to communicate w/ ICE, but there’s no way to stop them from being tossed.",
    "Footage reportedly shows a mass release of several hundred migrants into Brownsville, Texas, Fox News national correspondent Bill Melugin reported Tuesday.",
    "NEW: We are in Brownsville, TX where we are once again witnessing the mass release of single adult migrants from federal custody.",
    "The migrants are given smartphones in order for the government to track them and allow them to communicate with ICE.",
    "The migrants were reportedly dropped off the bus Tuesday morning and left a non-governmental organization (NGO).",
    "Border Patrol agents reportedly encountered 164,973 migrants along the Southwest border in February alone.",
    "Migrant apprehension has nearly doubled since the beginning of President Joe Biden’s administration.",
    "This group was dropped off on a bus 2 hours ago and just left a NGO.",
    "Several hundred are reportedly released everyday via parole."
  ]
}