{
  "id": 1818,
  "mediaId": 2663,
  "date": "2022-04-08",
  "headline": "Eric Trump is trending because of Jim Jordan so you know something stupid happened",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/04/Screen-Shot-2022-04-08-at-10.23.12-AM.png?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/eric-trump-trending-jim-jordan-know-something-stupid-happened-20220408",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Graham Gremore",
  "authorUrl": "https://www.queerty.com/author/graham-gremore",
  "termIds": [
    1670,
    2040,
    2201,
    3975,
    4109,
    5371
  ],
  "sentences": [
    "pic.twitter.com/eF3Jq1taXC\n— Q Ball Corner Pocket (@Pawlectro) April 8, 2022\nLast week, Jordan told reporters that if Republicans take back the House in the 2022 midterm elections, they might consider impeaching President Biden, though he couldn’t actually say what the president did that would merit impeachment, only that it was “definitely a discussion we have to have.”",
    "The media is the propaganda wing of the left-wing party!”\nHere’s how people responded to Gym’s tweet in defense of Eric yesterday…\ncool story bro, remember when Hunter Biden was ordered by a court to take a class in “how not to steal money from a charity” after getting caught doing exactly that?",
    "“The mainstream media hasn’t mentioned Hunter Biden’s name in 258 days,” Eric claimed, before going on a tangent about how unfairly he and his family are treated, how the media constantly covers up President Biden and his family’s alleged crimes, and blah, blah, blah, blah, blah.",
    "— Rep. Jim Jordan (@Jim_Jordan) April 7, 2022\nJordan, who recently won Donald Trump‘s endorsement in his bid for re-election, was quoting an interview Eric gave earlier this week to NDT’s “Capitol Report” about Hunter Biden’s laptop.",
    "“If I did 1/100 of what Hunter Biden did, I’d be in jail for the rest of my life.”\nLater, Eric conflated media coverage with justice, whining, “You don’t have equal scales of justice in this country!",
    "— Bruno in the Bay (@BrunoTheGreat32) April 8, 2022\nEric Trump invoked his Fifth Amendment rights more than 500 times during depositions with the New York AG’s office, Gym.",
    "— LINDZEE (@WVUMAMA2) April 8, 2022\nWho else wants to hear Jim Jordan testify about his 10 minute phone call with Donald Trump during the deadly insurrection???????",
    "Eric Trump is trending this morning because of something Jim Jordan tweeted last night, so you know something very stupid must have happened… And it did!",
    "— Lara reads banned books in Florida (@MadeInTheUSANJ) April 7, 2022\nJust look the other way, Jim, you know, like you did in the locker room at OSU.",
    "oh wait, that wasn’t Hunter Biden, that was Ivanka, Individual-1 Junior and Eric Trump\n— Jeff Tiedrich (@itsJeffTiedrich) April 8, 2022\nLol.",
    "And his foundation told it’s donors that their money went to kids with cancer, only to then give that money to other trump friendly causes.",
    "Americans have had it with the double standard.”\nEric Trump: “If I did 1/100 of what Hunter Biden did, I’d be in jail.”\nHe’s not wrong.",
    "Yesterday evening, Jordan tweeted: “Eric Trump: ‘If I did 1/100 of what Hunter Biden did, I’d be in jail.’ He’s not wrong.",
    "https://t.co/oUK4FVsY45\n— PoliticOhMyGawd (@PoliticOhMyGawd) April 8, 2022\nEric Trump pled the fifth over 500 times.",
    "— Lara reads banned books in Florida (@MadeInTheUSANJ) April 7, 2022\nDo you miss the locker room showers, Gym?",
    "— soitbegins (@csparks17) April 8, 2022\nJim Jordan quoting Eric Trump is probably enough Internet for today.",
    "(@JoJoFromJerz) April 8, 2022\nWas he talking about the amount of cocaine he does on a daily basis?",
    "Eric was charged and found guilty of stealing money from a children’s cancer charity.",
    "(@IncognitoBanski) April 8, 2022\nHunter hasn’t been charged with anything.",
    "Can anyone actually explain what Hunter supposedly did?",
    "Americans have had it with the double standard.",
    "You don’t have equal media coverage!",
    "Other than owning a laptop?",
    "Then came the kicker.",
    "Which isn’t a crime?",
    "So have a seat.",
    "It sure did!",
    "— Sue ????",
    "— Jo ??",
    "(Yawn.)"
  ]
}