{
  "id": 1832,
  "mediaId": 2572,
  "date": "2022-04-06",
  "headline": "HHS Secretary Becerra refuses to admit partial-birth abortions are illegal in House testimony",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/04/Xavier-becerra.png",
  "link": "https://www.foxnews.com/politics/hhs-xavier-becerra-partial-birth-abortion-illegal-house-testimony",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "As secretary of HHS I will not only comply with the law, but enforce it, and when it comes to issues that sometimes we hold different and sometimes very deeply held beliefs I will respect where people's opinion is, but my job is to make sure I'm enforcing the law.\"",
    "Health and Human Services Secretary Xavier Becerra refused to admit that partial-birth abortions are illegal in a heated exchange with Republican Indiana Rep. Jim Banks on Wednesday.",
    "\"Under the Supreme Court decision in Roe vs. Wade, women have reproductive rights that they are entitled to enforce and that they are entitled to have the government respect.",
    "Banks pressed Becerra on whether his department would aggressively enforce the federal ban on partial-birth abortions, but the secretary refused to acknowledge the ban.",
    "\"Do you concede that partial-birth abortion, as defined in 18 U.S. code, section 1531, is illegal and punishable by fine, imprisonment or both?\"",
    "He claimed during a 2021 hearing before the same committee that \"there is no law that deals specifically with the term \"partial-birth abortion.\"",
    "Banks then repeatedly pressed Becerra to answer the \"simple question,\" repeatedly cutting the secretary off as he began vague answers.",
    "\"And that's to say that having been a former attorney general, I know how important it is to not only follow the law, but enforce it.",
    "This is false, as Congress passed the Partial-Birth Abortion Ban Act in 2003 and President George W. Bush signed it into law.",
    "Becerra appeared before the House Committee on Education and Labor to discuss the policy priorities of his department.",
    "I will do everything I can to make sure a woman's rights and reproductive care are defended,\" Becerra responded.",
    "Becerra himself was a sitting member of Congress at the time representing California.",
    "Becerra has a history of denying that the U.S. ban on partial birth abortions exists.",
    "\"So I take that as no, you don't concede that that is the law,\" Banks stated.",
    "\"Congressman, I'll try to respond to this as best I can,\" Becerra began.",
    "\"Do you concede that partial birth abortion is illegal per the law?\"",
    "\"I gave you the answer,\" Becerra said.",
    "He voted against the bill.",
    "Banks pressed.",
    "Banks asked."
  ]
}