{
  "id": 186,
  "mediaId": 2746,
  "date": "2022-04-22",
  "headline": "Widow seeks to replace late husband in Congress but is dogged by scandal, ‘dirty politics’",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/18/Election_2022_Congress_Minnesota_20130.jpg-2bf4f_c0-126-3000-1876_s1200x700.jpg?c43a07717e3ee86bc399e882f94c372f2973a480",
  "link": "https://www.washingtontimes.com/news/2022/apr/22/widow-seeks-replace-late-husband-congress-dogged-s/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mica Soellner",
  "authorUrl": "https://www.washingtontimes.com/staff/mica-soellner/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We need to be focusing on the good that has come from my leadership at the state party for four and a half years and all of the Republicans that I helped and gave my personal time to.”\nMs. Carnahan is running on a platform focused on securing borders, election integrity, and bringing outsourced jobs back to the United States.",
    "“I think that when folks actually look at Jeremy’s legislative records, they will see that he has let his constituents down serving in the Minnesota House.”\nMr. Munson responded by citing his high-profile supporters and accused Ms. Carnahan of distorting his conservative record.",
    "“He felt that my leadership of the state party and how much I was a voice and leader for the people that I would be able to continue to fight for southern Minnesotans and the country and be the right voice to carry his legacy forward,” Ms. Carnahan told The Washington Times.",
    "“My record of standing up for Constitutional principles even when it was politically inconvenient is why I earned the unwavering support of conservative stalwarts like Congressman Jim Jordan, Congressman Scott Perry, and Congressman Thomas Massie.",
    "Asked about the recording, Ms. Carnahan said it was illegally conducted and that invoking it as an attack on her candidacy is “dirty politics.”\nShe added that she filed a police report in Florida where the recording took place.",
    "Democrats running include former Hormel Foods CEO Jeffrey Ettinger, ex-political consultant Sarah Brakebill-Hacke and Rick DeVoe, a bookstore owner and former political director for a local building trades union.",
    "Other women who succeeded their late husbands in Congress include Republican former Sen. Margaret Chase Smith, who took her husband’s seat in 1940 and became the first woman to serve in the House and Senate.",
    "Other Republicans vying for the seat are agricultural attorney Matthew Benda and Brad Finstad, a former state lawmaker and U.S. Department of Agriculture’s director of rural development for Minnesota.",
    "Ms. Carnahan defended her record as chair, saying she helped expand the party’s reach, flip three congressional seats in Minnesota and won back more seats in the statehouse.",
    "“Dirty politics is what people hate about Washington, D.C., and this has no place in the conversation.”\nMs. Brannon did not immediately respond to a request for comment.",
    "A disgraced former Minnesota GOP chair is seeking a political comeback by running for her late husband’s congressional seat, and she’s insisting it is what he wanted.",
    "Rep. Julia Letlow, Louisiana Republican, in March filled the seat that would have gone to her late husband, Luke Letlow, who died from COVID-19 complications.",
    "She resigned as chair of the state party last year over a scandal that started with a Republican donor being charged with multiple counts of sex trafficking.",
    "Jennifer Carnahan, 46, said her campaign is inspired by the wishes of Rep. Jim Hagedorn, to whom she was married for four years until his death in February.",
    "He also received endorsements from Reps. Jim Jordan of Ohio, Thomas Massie of Kentucky and Scott Perry of Pennsylvania, who chairs the House Freedom Caucus.",
    "Rep. Mary Bono took singer Sonny Bono’s congressional seat, going on to serve 15 years representing Palm Springs, California, and much of Riverside County.",
    "As Mr. Hagedorn’s widow, Ms. Carnahan should have an advantage but national GOP support has gone largely to her chief rival, state Rep. Jeremy Munson.",
    "Then, in an audio recording that surfaced late last year, an apparently intoxicated Ms. Carnahan was flippant about her husband’s terminal prognosis.",
    "Ms. Carnahan served as the Minnesota Republican Party’s chair from 2017 to 2021, becoming the first Asian American woman to hold that position.",
    "They intuitively recognize those who live their conservative principles rather than just campaigning on them,” Mr. Munson said in an interview.",
    "Mr. Munson is leading the crowded Republican primary field in fundraising, mostly because of spending $200,000 of his own money in his race.",
    "She also accused Rebecca Brannon, the self-described independent journalist who shared the audio, of having a “weird obsession” with her.",
    "Susan Wright last year sought the seat of her late husband Rep. Ron Wright, who died of cancer and COVID complications.",
    "He announced his diagnosis in July 2021 and checked into a medical center in January after contracting the coronavirus.",
    "Ms. Carnahan attacked Mr. Munson as being weak on election integrity and accused him of running for personal gain.",
    "She also was named to serve on Mr. Trump’s advisory commission on Asian Americans and Pacific Islanders in 2020.",
    "“The difference between Jeremy and I is that I truly am here to fight for the country and fight for the people.",
    "This week, former Minnesota Republican Party Chair Keith Downey, also announced his support for the candidate.",
    "The candidate said she thinks people should forget about the negatives and focus on what she accomplished.",
    "I’m not just in this for personal gain, and to promote myself on different channels,” Ms. Carnahan said.",
    "“I think it’s outrageous that people are even discussing that illegal recording,” Ms. Carnahan said.",
    "She is the third spouse of a deceased lawmaker that’s sought to replace them in the past year.",
    "Despite being endorsed by former President Donald Trump, Mrs. Wright lost to Rep. Jake Ellzey.",
    "Ms. Carnahan announced her campaign not long after Mr. Hagedorn died of cancer on Feb. 17.",
    "The seat is rated as being “likely Republican” by the nonpartisan Cook Political Report.",
    "Minnesota’s primary will be on May 24 and the special general election on Aug. 9.",
    "The race for Minnesota’s first district seat is crowded on both sides.",
    "“It’s far beyond time for people to move on,” Ms. Carnahan said.",
    "Still, Ms. Carnahan is running with a lot of political baggage.",
    "Republicans have an advantage in Minnesota’s first district.",
    "So, be it,” Ms. Carnahan is heard saying in the tape.",
    "Jim’s going to die of cancer in two years.",
    "“I don’t care."
  ]
}