{
  "id": 1871,
  "mediaId": 2526,
  "date": "2022-03-29",
  "headline": "Lindsey Graham Backs Democrat Led Bailout for Corporate Media",
  "image": "https://media.breitbart.com/media/2018/01/Lindsey-Graham-Andrew-Harnik-AP.png",
  "link": "https://www.breitbart.com/tech/2022/03/29/lindsey-graham-backs-democrat-led-bailout-for-corporate-media/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allum Bokhari",
  "authorUrl": "https://www.breitbart.com/author/allum-bokhari/",
  "termIds": [
    2047,
    2403,
    2462,
    2943,
    3709,
    43,
    305,
    878,
    5189,
    5287
  ],
  "sentences": [
    "Despite the fact that tech companies have disrupted virtually every major industry over the past decade, from high street retail stores to taxi services, Big Media has used its megaphone to create the impression that they face a unique peril from Big Tech and therefore deserve special government protections — even though tech companies have consistently rigged their platforms to favor the establishment media.",
    "“But oftentimes it’s the media itself, it’s journalists themselves who are demanding that that power be exercised in a censorious way in a way that undermines a free and diverse press.”\nAccording to the Electronic Frontier Foundation, a leading advocacy organization promoting online freedom, the JCPA will empower “media near-monopolies,” and does nothing to curb the monopoly power of Big Tech.",
    "Sen. Lindsey Graham (R-SC), already under fire from all sides for his bellicose statements on the Ukraine-Russia conflict, has now risked angering conservative voters across the country by backing a bill that would give legal sanction to collusion between Big Media and Big Tech, empowering corporate media giants like CNN and the New York Times at the expense of independent creators.",
    "Big Tech companies are directly funding the establishment media — both Google and Facebook are paying hundreds of millions of dollars to the largest and wealthiest media companies, despite the fact that they are far less trusted than independent journalists and podcasters.",
    "If the bill passes, big media companies would be able to strike deals with Facebook, Google, Twitter, and other tech giants that would prioritize their content to the detriment of podcasters, YouTubers, Substack authors, and other forms of independent media.",
    "The bill, called the Journalism Competition and Preservation Act (JCPA), does the opposite of what it promises: it protects discredited media companies from competition by allowing them to form a legal cartel to collectively bargain with Silicon Valley.",
    "Sen. Graham’s co-sponsorship of the bill earlier this month comes at a time when the South Carolina senator is facing across-the-aisle accusations of recklessness, including from his own Republican colleagues, for his bellicose statements on Russia.",
    "With public trust in the media near all-time lows, a genuine free market of information sources on major tech platforms would likely result in establishment media outlets like CNN being eclipsed by newer and more trusted competitors.",
    "Sen. Graham did receive support from one Republican politician — notorious Trump-hater Rep. Adam Kinzinger (R-IL), the only Republican other than Rep. Liz Cheney on the Jan 6th committee.",
    "“I do absolutely believe that the problem of Silicon Valley monopolistic power and its ability to interfere in our politics and impede a free press is a very serious one,” said Greenwald.",
    "GOP leader Rep. Kevin McCarthy (R-CA) has called the JCPA “the antithesis of conservatism,” while Rep. Jim Jordan (R-OH) has warned it would give the media “cartel power.”\nSens.",
    "Favoritism by Big Tech has a similar effect, forcing establishment media content into the news feeds and search results of a public that no longer trusts the industry.",
    "Cynthia Lummis, Susan Collins, Rand Paul, and John Kennedy, are now backing a bill that would give big news corporations an unfair advantage over their competitors.",
    "Notoriously, CNN’s ratings are boosted by the large number of deals the network has to continuously broadcast in airports, hotel lobbies, and other public venues.",
    "According to Pew, just 35 percent of Republicans say they have “a lot” or “some” trust in national news organizations, compared to 78 percent of Democrats.",
    "Republican FCC commissioner Nathan Simington has warned that the bill would empower national media monopolies at the expense of local journalism.",
    "At a hearing about the House’s version of the bill last year, independent journalist Glenn Greenwald warned that the JCPA empowers media titans.",
    "Big Tech favors the establishment media in its algorithms, boosting handpicked sources in search results and suppressing independent media.",
    "Rubio has warned it would deepen “collusion between Big Media and Big Tech,” while Blackburn has said it would empower Big Tech’s censors.",
    "By backing the JCPA, Sen. Graham also finds himself on the opposite side of Republican leaders in the House of Representatives.",
    "Even if ignored, the media’s content is still seen, boosting the numbers and satisfying advertisers and business partners.",
    "Big Tech elevates establishment media to the status of “fact checkers,” allowing them to suppress their competitors.",
    "Sen. Ted Cruz (R-TX) recently rebuked Graham after the latter called for the assassination of Vladimir Putin.",
    "He is the author of #DELETED: Big Tech’s Battle to Erase the Trump Movement and Steal The Election.",
    "The JCPA would give big media special legal privileges enjoyed by no other industry.",
    "Yet Sen. Graham, as well as a number of other Republican senators including Sens.",
    "Despite these advantages, the establishment media wants even more from Big Tech.",
    "Republican politicians regularly criticize the liberal media for its bias.",
    "Allum Bokhari is the senior technology correspondent at Breitbart News.",
    "Marco Rubio (R-FL) and Marsha Blackburn (R-TN) also oppose the bill.",
    "The corporate media is highly unpopular with Republican voters.",
    "Big Tech bans the establishment media’s competitors."
  ]
}