{
  "id": 1886,
  "mediaId": 2526,
  "date": "2022-03-26",
  "headline": "Top Republicans Consider Impeaching Joe Biden After Midterm Elections",
  "image": "https://media.breitbart.com/media/2022/02/President-Joe-Biden-departs-on-Marine-One-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/26/top-republicans-consider-impeaching-joe-biden-midterm-elections/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    1670,
    2201,
    3151,
    3975,
    878,
    1161,
    1171,
    4977
  ],
  "sentences": [
    "“Though Pelosi’s House will not hold @POTUS accountable, it’s incumbent upon House Republicans to call out his egregious violations of his oath of office.”\nIn August, Sen. Lindsey Graham (R-SC) noted if Americans were stranded behind enemy lines after the deadly evacuation from Afghanistan, it would be a “?",
    "Other than impeaching Biden, if Republicans assume congressional power after the midterms, they will also be able to conduct investigations into Hunter Biden’s laptop, Joe Biden’s relationship with corruption in China and Ukraine, and Dr. Anthony Fauci’s role in funding the Wuhan lab in China.",
    "And one of the real disadvantages of doing that … is the more you weaponize it and turn it into a partisan cudgel, you know, what’s good for the goose is good for the gander.”\nCruz and Jordan are not the only Republicans talking about impeachment.",
    "His decision to just defy federal immigration laws and allow 2 million people to come here unimpeded in direct contravention of his obligation under Article 2 of the Constitution to take care that the laws be faithfully executed.",
    "“You have to have complete buy-in from the entire conference and the leadership of our conference.”\n“Just look at the border,” Jordan said about the more than two million migrants have been apprehended at the southern border.",
    "If an impeachment trial does ensue, Jordan would head the House Judiciary Committee’s hearing of the impeachment case before potentially conveying the articles of impeachment of the Senate.",
    "“The president of the United States is supposed to enforce the laws along the border and they’re not doing it.”\nThere are other reasons Republicans may want to impeach Biden.",
    "“I think that’s definitely a discussion we have to have,” Rep. Jim Jordan (R-OH) told the Washington Times at the Republican retreat in Florida this week.",
    "“It’s clear the President is not up to the job, that his entire administration is willing to thumb its nose at the Constitution,” Gibb’s tweeted.",
    "Sen. Ted Cruz (R-TX) said on his Verdict with Ted Cruz podcast in January that he believes there is a “chance” Republicans may impeach Biden.",
    "Top Republicans are speaking about potentially impeaching President Joe Biden if they successfully retake both congressional chambers.",
    "Reps. Bob Gibbs (R-OH), Andy Biggs (R-AZ), Brian Babin (R-TX), and Randy Weber (R-TX) have also filed articles of impeachment.",
    "Cruz explained:\nProbably the most compelling is the utter lawlessness of President Biden’s refusal to enforce the border.",
    "“That is probably the strongest grounds right now for impeachment, but there may be others,” the senator stated.",
    "Jordan also noted any impeachment articles against Biden must have full support among the Republican caucus.",
    "In Biden’s first year as president, fentanyl has become the greatest killer among 18- to 45-year-olds.",
    "Rep. Marjorie Taylor Greene (R-GA) has introduced three impeachment resolutions against Biden.",
    "?high crime and misdemeanor under the Constitution” and should result in Biden’s impeachment.",
    "Cruz added that impeachment could be weaponized as a “partisan cudgel” but noted that “?",
    "“They used it for partisan purposes to go after Trump because they disagreed with him.",
    "And the deadly Afghan withdrawal deeply embarrassed the nation.",
    "?Democrats weaponized impeachment” to combat Donald Trump.",
    "Gas prices have increased to all-time record highs.",
    "“The conference has to decide,” Jordan added.",
    "Inflation has soared to a 40-year high.",
    "Supply chain woes have persisted.",
    "Weekly wages have shrunk."
  ]
}