{
  "id": 1903,
  "mediaId": 2740,
  "date": "2022-03-29",
  "headline": "House Jan. 6 panel discusses seeking testimony from Ginni Thomas about texts with Mark Meadows, but makes no decision",
  "image": "https://www.gannett-cdn.com/presto/2022/03/28/USAT/05468552-6b21-4b66-819e-7692758a354e-AP_Supreme_Court_Thomas_Wife.jpg?crop=4372,2460,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/03/29/ginni-thomas-capitol-attack-january-6-house-panel/7198057001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatodaycomwashington-topstories",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bart Jansen",
  "authorUrl": "https://www.usatoday.com/staff/2648278001/bart-jansen/",
  "termIds": [
    0
  ],
  "sentences": [
    "WASHINGTON – The House committee investigating the Capitol attack discussed Monday whether to seek testimony from Virginia “Ginni” Thomas, the wife of Supreme Court Associate Justice Clarence Thomas, about her text message exchanges about the 2020 presidential election with former White House chief of staff Mark Meadows.",
    "'I THINK THAT'S A PROBLEM':Ginni Thomas' revelation she went to Jan. 6 rally puts squishy Supreme Court rules in spotlight\nThe committee hasn't decided yet whether to subpoena lawmakers or former top administration officials such as Trump or former Vice President Mike Pence.",
    "“It takes time for the army who is gathering for his back.”\nHer political activism has raised concerns in the past about possible influence on Justice Clarence Thomas and prompted calls for him to recuse himself from cases dealing with the Capitol attack.",
    "Among the 29 messages, Ginni Thomas urged Meadows to fight the 2020 election results she called “the greatest Heist of our History” in a text on Nov. 10, 2020, according to The Washington Post.",
    "The committee and its staffers have met with hundreds of witnesses while gathering information about what led to the Capitol attack on Jan. 6, 2021, almost all of them behind closed doors.",
    "The committee has invited several conservative lawmakers, including House Minority Leader Kevin McCarthy, R-Calif., and Rep. Jim Jordan, R-Ohio, who each spoke with Trump on Jan. 6.",
    "He said the panel has no additional meetings scheduled but is discussing many potential witnesses, \"not just Ms. Thomas because she's not the focus\" of the investigation.",
    "But the invitation could be provocative because her political activism has already provoked calls for Justice Thomas to recuse himself from cases dealing with the riot.",
    "Ginni Thomas recently acknowledged attending Trump’s rally Jan. 6, 2021, before a mob of his supporters attacked the Capitol.",
    "But Ginni Thomas said she doesn’t discuss cases with her husband and he hasn’t commented on possible conflicts.",
    "But the chairman, Rep. Bennie Thompson, D-Miss., said the panel made no decision during the private meeting.",
    "But she said she left the rally because it was cold and never went to the Capitol.",
    "\"No decision,\" Thompson told reporters as he left the meeting.",
    "But they have declined and called the investigation partisan.",
    "“Do not concede,” Thomas wrote on Nov. 6, 2020.",
    "\"We're still just looking on everything.\""
  ]
}