{
  "id": 1917,
  "mediaId": 2745,
  "date": "2022-03-29",
  "headline": "The people to whom Trump talked on the day of the Capitol riot",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HM52LRQMWYI6VPM5YYUP2SFTUA.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/29/who-trump-talked-day-capitol-riot/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2202,
    2280,
    2378,
    2422,
    3500,
    4319,
    180
  ],
  "sentences": [
    "As The Washington Post reported Tuesday, call logs obtained by the House select committee investigating the day’s violence track Trump’s conversations that morning, before he spoke at a rally near the White House, and in the evening after the worst of the violence occurred.",
    "(11:17 a.m., three minutes)\nThe newly obtained documents refer nebulously to a conversation that took place with an “unknown” person at 11:17 a.m. Politico’s Kyle Cheney noted that a previously released document showed a call with Loeffler at that time.",
    "(9:51 a.m., 28 minutes)\nMiller was one of Trump’s primary speechwriters, so it’s likely that his lengthy call with the president on the morning of Jan. 6 centered heavily on the speech that Trump would give at the Ellipse a few hours later.",
    "Meadows has emerged as a locus of efforts to contact Trump as the riot unfolded, in part because of that proximity and, in part, because we know more about his contacts that day, compared with those of other Trump allies and advisers.",
    "As the weeks passed after the 2020 election, Trump increasingly emphasized a lawsuit filed by Texas Attorney General Ken Paxton (R) that sought to force the Supreme Court to reject the vote results in a number of states Trump lost.",
    "He told Politico at the time that he believed one of the calls occurred after legislators had been moved to a secure location during the riot — meaning that he spoke with Trump during the window for which no call logs exist.",
    "She was on Trump’s call with Georgia Secretary of State Brad Raffensperger a few days before Jan. 6, the call during which Trump tried to cajole Raffensperger into belatedly “finding” enough votes for Trump to win the state.",
    "That Trump spoke with Martin that evening may reflect Trump’s ongoing hope that members of Congress could be persuaded to block the finalization of the electoral college vote even after the Capitol had been cleared.",
    "“I guess these people” — that is, the rioters — “are more upset about the election than you are,” Trump told the House leader, according to those with whom McCarthy shared details of the call at the time.",
    "Later, Giuliani would try to reach Tuberville to encourage the senator to drag out the vote-counting process “until the end of tomorrow” so that other legislators could be persuaded to join the effort.",
    "(7:08 p.m., eight minutes; 9:55 p.m., 16 minutes)\nThe first outreach on the Jan. 6 call log is from Trump to his longtime aide Scavino, the person largely in charge of Trump’s social media accounts.",
    "There are only two recorded calls between Giuliani and Trump, which may be in part because Giuliani was at the rally on the morning of Jan. 6, where he would have seen the president face-to-face.",
    "His text messages to Trump staffers have been obtained by the House select committee and made public, revealing a divergence between his private exhortations and his on-air commentary that night.",
    "(10:32 a.m., two minutes)\nTrump’s quick call with his assistant is one of the last recorded on the morning of Jan. 6, shortly before he went out to speak to the audience outside the White House.",
    "(Logged calls: 8:37 a.m. for about two minutes; 10:19 p.m. for about eight minutes)\nBannon is a familiar name, having been part of Trump’s campaign team in 2016 and, briefly, his administration.",
    "An aide to McConnell told Costa on Monday that the leader “declined the call.”\nMcEnany would later receive an outline from Hannity delineating how Trump should move forward on his fraud claims.",
    "On Jan. 6 itself, Bannon was seen at the Willard Hotel, where Trump’s closest advisers were gathering to try to pressure members of Congress to reject the cast electoral college votes.",
    "Trump’s robust effort to overturn the election results in the weeks after Nov. 3, 2020, included assistance from Mitchell, who elevated various dubious claims about fraud to Meadows.",
    "He would later be mentioned in an unknown context as part of a document that MyPillow CEO Mike Lindell took to the White House outlining a last-ditch plan for Trump to retain power.",
    "(8:42 a.m., four minutes; 9:41 a.m., seven minutes)\nGiuliani is probably the best-known of Trump’s legal team and played a key role in the weeks leading up to the Jan. 6 riot.",
    "Hawley was the first Republican senator to announce his intent to object to the submitted electoral college votes on Jan. 6 — an objection he maintained even after the riot.",
    "(10:45 a.m., two minutes)\nSpeaking to CBS News’s Robert Costa, who helped break the story about the phone logs, Bennett said he didn’t “recall” his conversation with Trump.",
    "(7:01 p.m., seven minutes)\nTrump’s conversation with his lead government counsel was the first one indicated in the evening hours logged in the newly obtained documents.",
    "(11:08 p.m., nine minutes)\nAs the riot was underway, Hannity (like many others close to Trump) encouraged the White House to more aggressively renounce the violence.",
    "What the logs do reveal, though, is itself illuminating: whom Trump spoke with, who is omitted from the logs and who is not shown to have returned his outreach.",
    "His conversations triggered concerns about the security of his wireless devices and numerous reports about newsworthy statements offered to random Americans.",
    "The White House contacted him in the morning, and the call logs record that he had tried to reach Trump by the early evening, but no conversation is logged.",
    "On Jan. 5, for example, his podcast focused on the events that would unfold the following day as Congress convened to count electoral votes in the Capitol.",
    "This was the plan all along, after all: get Congress to throw up roadblocks and, potentially, have the House or the Supreme Court adjudicate a new winner.",
    "Olsen, Bannon, Giuliani and Meadows are the only individuals known to have spoken to Trump both before and after the period in which no calls were logged.",
    "While many of the names might not be immediately familiar, we’ve included information about who they are and the likely reason that Trump reached out.",
    "This is intriguing, given that there were already reports about White House staffers tendering their resignations as a result of the day’s violence.",
    "But it’s Trump’s calls on one particular day — Jan. 6, 2021, the day of the riot at the U.S. Capitol — that are of the most interest at the moment.",
    "Bennett served as education secretary in Ronald Reagan’s second term in office and has written extensively through a conservative political lens.",
    "In January, he told reporters that the conversation “was very short, that he was advising the president what was happening” in the building.",
    "(9:03 a.m., five minutes; 10:11 p.m., nine minutes)\nMeadows probably spent much of the day with Trump, obviating the need for regular calls.",
    "A previous version of this post incorrectly said that then-Vice President Mike Pence was evacuated from the House chamber on Jan. 6, 2021.",
    "Tuberville, newly elected to his position, committed to objecting to the submitted electoral votes before Jan. 6 and subsequently did so.",
    "He left at least one message for a senator, Tommy Tuberville (R-Ala.), asking that the final count of electoral college votes be delayed.",
    "He stayed at the White House, popping up later in the year as part of an effort to spread negative stories about Joe Biden’s son Hunter.",
    "Martin was also reportedly one of those advocating that Vice President Mike Pence simply reject cast electoral college votes on Jan. 6.",
    "(10:50 p.m., six minutes)\nHerschmann was a member of Trump’s legal team during his first, Ukraine-related impeachment trial in 2020.",
    "By Jan. 6, Bannon had transitioned back into the media world, hosting a podcast in which he hyped pro-Trump positions and rhetoric.",
    "Mitchell was also in contact with members of Congress about her claims, which is probably why Trump spoke with her that day.",
    "Miller worked on both of Trump’s presidential campaigns and would continue to serve the former president until last summer.",
    "The conversation occurred shortly before Trump’s Twitter account published a second video addressing the events of the day.",
    "One of the last recorded calls Trump made on Jan. 6 was to McEntee, the person in charge of staffing at the White House.",
    "We know that the two spoke at 11:20 a.m., shortly before Pence headed to Capitol Hill to lead the electoral vote count.",
    "It’s not the first attempted call, though; Trump reached out to Dan Scavino (see below) before speaking with Cipollone.",
    "Originally part of the group who planned to object to the electoral-vote results, she changed her mind after the riot.",
    "The first such video, released hours earlier, was criticized for the generous tone it used in describing the rioters.",
    "Trump had the White House switchboard contact Hagerty, his former ambassador to Japan, but no response is recorded.",
    "As he campaigned to keep his job, he had expressed support for objecting to the submitted electoral college votes.",
    "That call apparently included a last-ditch attempt by Trump to cajole Pence into rejecting the vote results.",
    "Calling it a long shot is overly generous; it was a mishmash of spurious claims and dubious legal arguments.",
    "(Tuberville reportedly told Trump during the call that Pence was being evacuated from the Senate chamber.)",
    "He was also the target of multiple calls on Jan. 6 itself, including one from Trump early that afternoon.",
    "(8:34 a.m., three minutes; 7:17 p.m., 12 minutes)\nOlsen was the attorney for Texas in its doomed lawsuit.",
    "McCarthy is known to have spoken with Trump on the day of the riot, after legislators had been evacuated.",
    "Hannity and Trump often spoke on the phone; in this case, it was well after Hannity’s program aired.",
    "Unfortunately, Giuliani accidentally left that message on the voice mail of Sen. Mike Lee (R-Utah).",
    "Below, listed in alphabetical order, are those Trump tried to speak with or spoke with on Jan. 6.",
    "The hours between, though, are empty — despite reported conversations between Trump and others.",
    "(11:04 a.m., three minutes)\nLike Loeffler, Perdue had lost his reelection bid the night before.",
    "In August, he acknowledged that he and the president had spoken more than once on that day.",
    "It’s likely that, like Meadows, Scavino spent much of the day in Trump’s direct company.",
    "They spoke later, including shortly before the second video message was released.",
    "For months, Jordan faced questions about his contacts with Trump on Jan. 6.",
    "As president, Donald Trump spent a remarkable amount of time on the phone.",
    "Dan Scavino, White House deputy chief of staff for communications.",
    "Trump tried to reach Pence at 9:02 a.m. on Jan. 6, without luck.",
    "William Bennett, former Cabinet official; conservative pundit.",
    "To Republicans at the time, though, he offered more detail.",
    "Martin was part of the team that helped develop that suit.",
    "Trump tried to reach McConnell on the morning of Jan. 6.",
    "As the riot unfolded, Giuliani was at the Willard Hotel.",
    "He tried to reach Scavino at 8:23 a.m., without luck.",
    "It’s not clear why Bennett would have been contacted.",
    "Stephen K. Bannon, former adviser and podcast host.",
    "It’s not clear why he spoke with Trump on Jan. 6.",
    "Eric Herschmann, lawyer and White House adviser.",
    "It’s not clear what the two discussed on Jan. 6.",
    "She had lost her reelection bid the day prior.",
    "Hagerty was first elected the prior November.",
    "He called legislators, he called reporters.",
    "He was evacuated from the Senate chamber.",
    "He called friends, he called supporters.",
    "Nick Luna, Trump’s personal assistant.",
    "Kelly Loeffler, senator from Georgia.",
    "Stephen Miller, senior Trump adviser.",
    "David Perdue, senator from Georgia.",
    "Pat Cipollone, White House counsel.",
    "This post has been corrected.",
    "Mark Meadows, chief of staff.",
    "Sean Hannity, Fox News host.",
    "Rudy Giuliani, attorney.",
    "Kurt Olsen, lawyer.",
    "It didn’t work."
  ]
}