{
  "id": 1955,
  "mediaId": 2526,
  "date": "2022-03-29",
  "headline": "Poll: Trump Leads Biden by 6 Points in 2024 Potential Matchup",
  "image": "https://media.breitbart.com/media/2022/01/GettyImages-1364875196-inset-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/29/poll-trump-leads-biden-6-points-2024-potential-matchup/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    1670,
    1951,
    2201,
    3975,
    305,
    696,
    4811,
    5371
  ],
  "sentences": [
    "With more than two million migrants being apprehended at the southern border, fentanyl becoming the greatest killer among 18- to 45-year-olds, inflation soaring to a 40-year high, gas prices increasing to all-time record highs, weekly wages shrinking, supply chain woes persisting, and the deadly Afghan withdrawal deeply embarrassing the nation, some top Republicans want to impeach the president if they successfully retake both congressional chambers in the midterms.",
    "“The president of the United States is supposed to enforce the laws along the border and they’re not doing it.”\nA late January poll suggests that 50 percent of voters want Biden impeached.",
    "The hypothetical matchup polling comes as an NBC News poll revealed on Sunday that 71 percent of Americans believe Biden’s America is headed in the wrong direction.",
    "If Biden was impeached, Harris would assume the Oval Office and would likely be the Democrat nominee in 2024, a matchup that favors Trump at the moment.",
    "Fifty-two percent said Biden should resign, while 39 percent said he should not, according to a September poll after the deadly Afghan evacuation.",
    "Donald Trump leads President Biden by six points in a 2024 potential matchup, a Monday Harvard CAPS-Harris poll revealed.",
    "In January, a McLaughlin & Associates poll showed Trump favored by five percentage points to defeat Biden in 2024.",
    "Forty-nine percent selected Trump in that 2024 hypothetical matchup, while only 38 percent supported Harris.",
    "In a Thursday McLaughlin & Associates poll, Trump led Biden by three points and Harris by eight points.",
    "“I think that’s definitely a discussion we have to have,” Rep. Jim Jordan (R-OH) said last week.",
    "Trump’s lead widens if Vice President Kamala Harris is the Democrat nominee.",
    "Trump’s lead over Biden and Harris is consistent with other recent polls.",
    "The Harvard CAPS-Harris poll surveyed 1,990 voters from March 23-24.",
    "“Just look at the border,” he continued.",
    "Only 45 percent do not."
  ]
}