{
  "id": 2083,
  "mediaId": 2557,
  "date": "2022-03-27",
  "headline": "WATCH: World leader joins lawmakers scolding Biden for escalating tensions with Russia",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/03/GettyImages-1234884965-e1630076850825-4.jpg",
  "link": "https://dennismichaellynch.com/watch-world-leader-scolds-biden-for-saying-butcher-putin-cannot-remain-in-power/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    1370,
    1951,
    2201,
    2440,
    3375,
    3709,
    3975,
    5254,
    5287
  ],
  "sentences": [
    "Full stop.” pic.twitter.com/KDL1r3BmDV\n— The Recount (@therecount) March 27, 2022\nRepublican Rep. Jim Jordan said Biden’s speech in Poland Saturday night was “more than confusing, it’s dangerous.”\n“Here’s the president potentially having more war-triggering type language than probably any president in American,” Jordan warned.",
    "But the media has his back…\n— Clint Ehrlich (@ClintEhrlich) March 26, 2022\nFrance’s Macron warns against escalation after Biden says Putin ‘cannot remain in power’ https://t.co/PNnmm33Fg9\n— Fox News (@FoxNews) March 27, 2022\nListen to the latest daily DML podcasts below!",
    "“Please, Mr. President, stay on script.”\nSen. Jim Risch (R-ID) reacts to President Joe Biden saying Russian President Vladimir Putin “cannot remain in power,” telling @DanaBashCNN the remark could cause problems in Ukraine as the US tries to de-escalate the conflict.",
    "“We need to be careful and precise in things we say, particularly as commander in chief of our country.”\nSen. James Risch (R-Idaho) on Sunday said Biden’s comment that Putin should not remain in power was “a horrendous gaffe.”\n“I wish he would stay on script.",
    "If a ceasefire is to be brokered, we must not escalate — neither through words nor actions.” pic.twitter.com/REzBTzJWc5\n— Visegrád 24 (@visegrad24) March 27, 2022\nMacron was not alone in his criticism of Biden’s comments during his trip overseas.",
    "“As you know, and as you have heard us say repeatedly, we do not have a strategy of regime change in Russia – or anywhere else, for that matter.”\nSecretary Blinken’s comments come after President Biden’s remarks during his trip in Poland.",
    "“I think the president, the White House, made the point last night that, quite simply, President Putin cannot be empowered to wage war or engage in aggression against Ukraine or anyone else,” Blinken said during a visit to Jerusalem.",
    "#CNNSOTU pic.twitter.com/PcylOrnQ23\n— CNN (@CNN) March 27, 2022\nFollowing the two major gaffes during his trip, social media has been buzzing about invoking the 25th Amendment over Biden’s “dangerous” rhetoric.",
    "Recall, the media called for the 25th amendment when Trump sipped water or walked down ramps carefully.”\nYesterday, Biden said American troops have been fighting in Ukraine & more are headed to fight there.",
    "— David Limbaugh (@DavidLimbaugh) March 26, 2022\n“Yesterday, Biden said American troops have been fighting in Ukraine & more are headed to fight there,” author Max Abrahms also tweeted on Saturday.",
    "Full stop.”\nAfter Biden said “This man cannot remain in power” about Putin on Saturday, @DanaBashCNN asks U.S. Rep to NATO Julianne Smith whether that was “a mistake”:\n“No, as you heard from Sec.",
    "Almost immediately after Biden’s controversial address, the White House appeared to walk back his comments, denying that Biden was calling for regime change.",
    "1) His handlers are running things anyway, and 2) [Vice President] Kamala [Harris], though not mentally incompetent — just stupid — could be worse.",
    "“Honestly, the 25th Amendment was crafted for just such a situation as we are now in with Biden,” columnist and author David Limbaugh asserted.",
    "pic.twitter.com/9FxTEtyh3G\n— USA TODAY (@USATODAY) March 27, 2022\nU.S. Rep to NATO Julianne Smith also said Sunday, “As you heard from Sec.",
    "Macron added that he will continue discussions with Putin in effort to spearhead evacuations from the besieged Ukrainian city of Mariupol.",
    "— Max Abrahms (@MaxAbrahms) March 26, 2022\nImagine President Trump had inexplicably told U.S. troops they were deploying to fight Russia.",
    "Lawmakers from both sides of the aisle disputed the “dangerous” statements- even the White House walked back the escalating rhetoric.",
    "1) His handlers are running things anyway, and 2) Kamala, though not mentally incompetent — just stupid — could be worse.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "Secretary of State Antony Blinken also told reporters Sunday that the US has no plans for regime change in Russia.",
    "“The President’s point was that Putin cannot be allowed to exercise power over his neighbors or the region.",
    "Recall, the media called for the 25th amendment when Trump sipped water or walked down ramps carefully.",
    "Honestly, the 25th Amendment was crafted for just such a situation as we are now in with Biden.",
    "He was not discussing Putin’s power in Russia, or regime change,” a White House official said.",
    "All we’d be hearing is that he’s mentally unfit and must be removed under the 25th Amendment.",
    "Blinken and others, the U.S. does not have a policy of regime change in Russia.",
    "Blinken and others, the U.S. does not have a policy of regime change in Russia.",
    "WATCH:\nBREAKING:\nMacron is criticizing Biden for calling Putin “a butcher”.",
    "“Today, Biden said the goal of U.S. policy to Russia is regime change.",
    "Today, Biden said the goal of U.S. policy to Russia is regime change.",
    "To get more information about this article, please visit Fox News.",
    "But my gosh, I wish they would keep him on script,” Risch said.",
    "“Yet at least two things militate against this from happening.",
    "Yet at least two things militate against this from happening.",
    "Whoever wrote that speech did a good job for him.",
    "The French president says it’s not constructive.",
    "“I would not use that kind of language.",
    "Joe Biden did the same thing today.",
    "Then please share.",
    "Really imagine it!"
  ]
}