{
  "id": 2087,
  "mediaId": 2570,
  "date": "2022-03-19",
  "headline": "#CovidIsNotOver Trends Over Concerns About Covid-19 Complacency, Over-Relaxation Of Precautions",
  "image": "",
  "link": "https://www.forbes.com/sites/brucelee/2022/03/19/covidisnotover-trends-over-concerns-about-covid-19-complacency-over-relaxation-of-precautions/?sh=52c4888555b0",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bruce Y. Lee",
  "authorUrl": "https://www.forbes.com/sites/brucelee/",
  "termIds": [
    1670,
    2822,
    117,
    1054,
    1094
  ],
  "sentences": [
    "Moreover, various folks on Twitter used #CovidIsNotOver to emphasize the benefits of continuing face mask use:\nIn fact, some have expressed concerns about being stigmatized when they try to continue wearing face masks:\nAnd now that many organizations are returning to in-person meetings, there are questions as to whether such meetings will maintain an appropriate level of precautions:\nOthers have used the hashtag to point out what’s been happening in other countries that have maintained greater levels of Covid-19 precautions such as Spain:\nSome emphasized that face mask use doesn’t mean that you can’t resume most regular activities such as @thedivine_mrs_s:\nAnd @kellsley:\nThroughout the pandemic, a number of countries have gone through this premature relaxation followed by Covid-19 surge and then Covid-19 precaution reinstitution cycle.",
    "For example, here’s what Nili Kaplan-Myrth, MD, PhD, a family doctor in Ottawa, Canada, and host of the Rx Advocacy podcast, tweeted:\nAnd @MeetJess may have been referring to previous premature relaxations that occurred in 2021 with this tweet:\nOthers complained about getting peer pressure to not take Covid-19 precautions, perhaps reminiscent of high school days.",
    "Our joint PHICOR and National School of Tropical Medicine at the Baylor College of Medicine team study recently published in The Lancet Public Health did show both the costs, hospitalizations, and deaths that could be averted if face mask wearing were maintained until higher levels of Covid-19 vaccination were reached.",
    "In fact, as I covered for Forbes on March 12, multiple countries in Europe have been experiencing upswings in Covid-19 cases and hospitalizations over the past couple week, which raises the possibility of yet another impending Covid-19 surge in not only Europe but also other countries such as the U.S.",
    "And typically people shouldn’t need reminders that they are still amidst an emergency such as “hey, did you know that you are still on fire?”\nAlas, some politicians, TV personalities, and anonymous social media accounts have continued to push the narrative that the pandemic is somehow over.",
    "It’s not clear whom exactly Jordan was referring to when he used the term “Real America.” Regardless, perhaps he should have taken a peek at the real data and checked with some real scientists before making a statement that ended up being real premature.",
    "For example, apparently when @tamalama67 declined a lunch invitation, a friend responded by asking when @tamalama67 will “start living life again”:\nNow, taking Covid-19 precautions doesn’t necessarily mean that you can’t go to a restaurant.",
    "As Baseball Hall-of-Famer Yogi Berra once said, “It ain't over till it's over.” And recently the hashtag #CovidIsNotOver has trended on Twitter to remind everyone that the Covid-19 coronavirus pandemic is certainly not over.",
    "Such a divide could’ve been fine if taking Covid-19 precautions were simply a “personal choice.” But it’s not like choosing to wear butt-boosting underwear where your choices in theory do not affect those around you.",
    "Abdu Sharkawy, MD, an infectious disease physicians at the University of Toronto, warned about not learning from recent history:\nIndeed, the Covid-19 coronavirus pandemic won’t be over until it’s actually over.",
    "That’s why a number of folks have used the hashtag #CovidIsNotOver to express concerns about what may be premature relaxation of Covid-19 precautions such as face mask wearing indoors.",
    "For example, here’s what Representative Jim Jordan (R-Ohio) tweeted back on December 2, 2022:\nIf you recall, December 2, 2022, was before the peak of the latest Covid-19 Winter surge.",
    "The U.S. has still had averages of over 29,000 Covid-19-related hospitalizations and over 1,100 deaths per day over the past 14 days, based data from The New York Times.",
    "In reality, each person’s individual actions can in turn affect everyone’s risk of getting infected with the severe acute respiratory syndrome coronavirus (SARS-CoV-2).",
    "However, if the restaurant is indoors and people aren’t maintaining precautions there, then you could see why someone may be hesitant to accept such an invitation.",
    "So the continuing question is will this latest round of relaxation of Covid-19 precautions be, in the words of Berra, like déjà vu all over again?",
    "After all, no major legitimate public health or other relevant scientific organization has officially declared the pandemic over.",
    "All of this “Covid is done” talk has created a seemingly big divide between the have-reality-in-minds and the have-nots.",
    "One clear divide is between those who are continuing to wear face masks in indoor public locations and those who aren’t.",
    "In fact, when Jordan posted that “Real America is done #COVID19” statement Covid-19 cases were already on the upswing.",
    "Political agendas won’t trump science and nature, so to speak.",
    "This has happened pretty much throughout the pandemic.",
    "So why might a #CovidIsNotOver reminder be needed?",
    "This isn’t a mind over matter situation."
  ]
}