{
  "id": 2130,
  "mediaId": 2664,
  "date": "2022-03-29",
  "headline": "'How can you forget a call that long?' Reporter hounds Jim Jordan about his infamous Jan. 6 Trump phone call",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29610802&width=1200&coordinates=0%2C0%2C0%2C49&height=600",
  "link": "https://www.rawstory.com/jim-jordan-capitol-riot-2657060487/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    1670,
    2201,
    2854,
    3409,
    4784
  ],
  "sentences": [
    "Spectrum\\u2019s @TaylorPopielarz asks Jordan about his 10-minute Jan. 6 call with Trump and the latest CBS-Post report\\u2026pic.twitter.com/YdvM9xa1NJ\n— Robert Costa (@Robert Costa) 1648588235\nNOW WATCH: Bob Woodward: Unlikely that 'telephone addict' Trump didn’t call anyone for 7 hours during Jan. 6\nBob Woodward: Unlikely that 'telephone addict' Trump didn’t call anyone for 7 hours during Jan. 6",
    "The video shows Popielarz following Jordan around the United States Capitol building and asking Jordan about the seven-and-a-half-hour gap in White House call logs that occurred on January 6th, including the time when Trump supporters were violently rioting at the Capitol.",
    "Spectrum News reporter Taylor Popielarz on Tuesday filmed himself hounding Rep. Jim Jordan (R-OH) about the infamous phone call he had on January 6th, 2021 with former President Donald Trump.",
    "Popielarz grilled Jordan about having a ten-minute call with Trump that morning and claiming to not remember the contents of what was discussed.",
    "Jordan then declined to say whether he would cooperate with a subpoena from the House Select Committee investigating the riots.",
    "\"What do you say to constituents who question... how do you forget a call that long on a day as significant as that?\"",
    "\"But you said you didn't remember, you initially told me you didn't remember if it happened before.\"",
    "\"Do you think your constituents deserve to know what you talked about?\"",
    "\"We got all the answers in our letter we sent two months ago.\"",
    "\"Right and that's old news,\" Jordan shot back.",
    "\"You can look at our letter,\" Jordan replied.",
    "\"I said I talked to him,\" Jordan replied.",
    "\"I talked to the president on that day.\"",
    "\"I know,\" said Popielarz.",
    "Watch the video below.",
    "asked Popielarz.",
    "he asked."
  ]
}