{
  "id": 2202,
  "mediaId": 2540,
  "date": "2022-03-29",
  "headline": "Washington Post and CBS News: White House records of January 6 show more than seven-hour gap in Trump’s calls",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/220329081521-jan-6-donald-j-trump-washington.jpg?c=16x9&q=w_800,c_fill",
  "link": "https://www.cnn.com/2022/03/29/politics/trump-january-6-phone-records/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Veronica Stracqualursi",
  "authorUrl": "https://www.cnn.com/profiles/veronica-stracqualursi",
  "termIds": [
    0
  ],
  "sentences": [
    "From the documents obtained by the Post and CBS, the next event listed in the presidential diary is Trump heading to the Rose Garden at 4:03 p.m. to record a video message, in which he told the mob attacking the Capitol to “go home” and “we love you.” The records say Trump returned to the Oval Office at 4:07 p.m and then went to the Second Floor Residence at 6:27 p.m., the Post and CBS reported.",
    "CNN —\nOfficial White House records from January 6, 2021, show a gap of more than seven hours in phone calls placed to or from then-President Donald Trump, and do not list calls between Trump and lawmakers while the attack at the US Capitol was ongoing that were later widely reported, The Washington Post and CBS News reported.",
    "The 11 pages of the White House presidential diary, which is a record of the President’s daily activities, and White House switchboard call logs show phone calls Trump had with at least eight people the morning of January 6 and 11 people that night – with no notation of calls from 11:17 a.m.",
    "Tuberville spoke with Trump for less than 10 minutes that day, with the President trying to convince the senator to make additional objections to the Electoral College vote to try and block Congress’ certification of President-elect Joe Biden’s win, a source familiar with the call told CNN.",
    "CNN first reported in February that the records turned over earlier this year from the National Archives to the House select committee investigating the January 6 attack showed no record of phone calls for several hours made to or from Trump as the violence unfolded on Capitol Hill.",
    "The call records obtained by the Post and CBS show Trump held brief calls with his former White House chief strategist Stephen Bannon, who promoted the upcoming DC protests on January 6 and often spewed conspiracy theories of election fraud on his podcast, the Post and CBS reported.",
    "Among the other people Trump called on January 6 were Kurt Olsen, who was advising Trump on legal challenges to the election; Trump senior adviser Stephen Miller; Senate Republican leader Mitch McConnell; and Republican Sen. Josh Hawley of Missouri, the Post and CBS reported.",
    "According to the Post and CBS, Trump’s calls listed that night were to aides and advisers, including Daniel Scavino Jr., White House counsel Pat Cipollone, White House press secretary Kayleigh McEnany and political adviser Jason Miller, with whom he spoke for 18 minutes.",
    "Private cell phone use common\nSources told CNN that Trump had a habit of asking aides to call certain people on his behalf and January 6 committee chair Rep. Bennie Thompson has acknowledged that the use of private cell phones was common in the Trump White House.",
    "The morning of January 6 Trump gave a speech at the “Save America Rally” on the National Mall and urged his followers to march to the Capitol and “fight like hell” to stop lawmakers from certifying the 2020 election results.",
    "Trump also spoke with lawyers supporting his fight against the 2020 election results, including conservative attorney Cleta Mitchell, who worked with Trump to contest Biden’s victory in Georgia, the Post and CBS reported.",
    "The daily presidential diaries were compiled with information provided by White House staffers for the Archives while the presidential call log has information provided by the White House switchboard and aides.",
    "Notable calls\nThe White House logs also note that Trump spoke with others, including then-Republican Sen. David Perdue of Georgia, conservative commentator William J. Bennett and Fox News host Sean Hannity.",
    "CNN previously reported that McCarthy and Trump had an expletive-laced phone call while the Capitol was under attack in which Trump said the rioters cared more about the election results than McCarthy did.",
    "The White House daily diary also includes a call Trump made the morning of January 6 to an “unidentified person” – the last call he had until the night of January 6, according to the two news outlets.",
    "House investigators are now looking into whether Trump communicated on January 6 through backchannels, aides’ phones or burner phones, two people with knowledge of the probe told the Post and CBS.",
    "Christie previously told CNN about his multiple efforts to reach Trump by phone during the riot through the White House switchboard, the President’s assistant, body man and personal cell phone.",
    "At 9:02 a.m., Trump had tried to place a call to then-Vice President Mike Pence and the operator told Trump a message was left for Pence, the Post and CBS reported.",
    "A Trump spokeswoman told the Post and CBS that Trump had nothing to do with the White House records and assumed his calls were recorded and preserved.",
    "The lack of documentation of Trump’s calls leaves congressional investigators with holes so far in their understanding of what transpired on January.",
    "The records note that Trump returned to the White House at 1:19 p.m. and “met with his valet” at 1:21 p.m., according to the Post and CBS.",
    "The White House records did not list notable phone calls Trump had placed to House Minority Leader Kevin McCarthy and Republican Sens.",
    "CNN first reported that the records show that Trump had a phone call with Ohio Republican Rep. Jim Jordan the morning of January 6.",
    "The records also list two phone calls between Trump and his personal lawyer Rudy Giuliani, according to the Post and CBS.",
    "One former Trump White House staffer told CNN that Trump’s calls on personal cell phones were rarely tracked or recorded.",
    "The two spoke the morning of January 6 for about a minute and later at 10:19 p.m. that night, the Post and CBS reported.",
    "To the best of my knowledge, I have never even heard the term,” Trump told the Post and CBS in a statement Monday.",
    "The Post and CBS reported that Trump’s final call with Pence on January 6 is also not listed in the call log.",
    "The committee is also investigating whether it received the full logs, according to the Post and CBS.",
    "The call logs obtained by the Post and CBS did not show the multiple calls former New Jersey Gov.",
    "Mike Lee of Utah and Tommy Tuberville of Alabama, which were widely reported by CNN and others.",
    "An aide to McConnell told the outlets that the Kentucky Republican declined Trump’s call.",
    "That call was not included in the switchboard logs the Post and CBS obtained.",
    "ET to 6:54 p.m., according to the Post and CBS, which obtained the records.",
    "Bannon declined to comment to the news outlets through a representative.",
    "The committee has subpoenaed the phone records of more than 100 people.",
    "It’s unclear if Trump reached Hawley, according to the Post and CBS.",
    "Giuliani did not reply to the Post and CBS’ request for comment.",
    "They did not respond to Post and CBS’ requests for comment.",
    "This story has been updated with additional details.",
    "Chris Christie attempted to make to Trump.",
    "“I have no idea what a burner phone is."
  ]
}