{
  "id": 2244,
  "mediaId": 2512,
  "date": "2022-03-22",
  "headline": "Jim Jordan's latest 'total bullsh*t' Twitter swipe at Ketanji Brown Jackson backfires spectacularly",
  "image": "https://www.alternet.org/media-library/image.jpg?id=23473109&width=1200&coordinates=0%2C60%2C0%2C60&height=600",
  "link": "https://www.alternet.org/2022/03/jim-jordan-tweet-backfires-spectacularly/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandon Gage",
  "authorUrl": "https://www.alternet.org/author/brandongage",
  "termIds": [
    1670,
    4118,
    4628,
    878,
    996,
    1094,
    5212
  ],
  "sentences": [
    "— Rep. Jim Jordan (@Rep. Jim Jordan) 1647972355\nThe problem with the first part of Jordan's complaint is that it makes no sense because coverage of Senate hearings happens in real-time, astute Twitter users pointed out...",
    "— GravyJosh (@GravyJosh) 1647972689\n...no matter who the nominee is or the office that they are hoping to hold...\n...or the double standards certain right-wing politicians apply to the circumstances.",
    "The January 6th Capitol insurrection participant and alleged college sex abuse cover-upper clearly enjoys the attention that his posts receive; as they say, there is no such thing as bad press.",
    "Others noted that a nominee's qualifications, as well as the contents of their characters, are supposed to have an impact – but not on how confirmation hearings are broadcast to the public.",
    "In only 20 words, Jordan all but accused the media of rigging the SCOTUS confirmation process and completely undermined the GOP's opposition to and suspicion of Jackson.",
    "Geeze, no wonder you couldn't pass the Ohio Bar Exam.pic.twitter.com/I74MI2BVRs\n— Raymond Zbikowski (@Raymond Zbikowski) 1647972708\nWhat feed you watching jimbo?",
    "But his most recent tweet attacking Supreme Court nominee Judge Kentaji Brown Jackson on Tuesday afternoon may just give that adage a serious run for its money.",
    "The Twitter account belonging to Republican United States Representative Jim Jordan of Ohio is a treasure trove of tidbits into his inner-most mental musings.",
    "\\n\\nJust watch Supreme Court nomination coverage when it\\u2019s a conservative versus when it\\u2019s a liberal.",
    "<i>Editor's Note: An earlier version of this article misspelled Ketanji Brown Jackson's first name</i>.",
    "Jackson, however, has already been confirmed by the Senate to the second-highest court in the country.",
    "— Third Coast (@Third Coast) 1647972475\nI watch ABC World News Tonight and I've never seen any bias.",
    "\"Just watch Supreme Court nomination coverage when it’s a conservative versus when it’s a liberal.\"",
    "The networks (abc, cbs, nbc) employ journalists who investigate and report the news.",
    "Mine is just a camera going from the person asking a question to her answering.",
    "FOX is an infotainment outlet similar to TMZ and the National Enquirer.",
    "CNN and MSNBC provide expert commentary/analysis of the news.",
    "I also read Newsday which I find to be non-partisan as well.",
    "People see through Jordan's grandstanding.",
    "It's basically sharks vs. bottom feeders.",
    "What you are watching, Gymbo isn't news.",
    "It's a summary of the day's events.",
    "Explain how that\\u2019s media bias.",
    "And they have a word for it.",
    "Jordan asked the audience.",
    "It's political commentary.",
    "\"Want to see media bias?\"",
    "Want to see media bias?",
    "I\\u2019ll wait."
  ]
}