{
  "id": 2257,
  "mediaId": 2710,
  "date": "2022-03-22",
  "headline": "Paul Gibbs: McMullin’s health care views are a pleasant surprise",
  "image": "https://www.sltrib.com/resizer/7KRprz4UWCHWJP-OVHo3NW_Tot8=/1200x630/cloudfront-us-east-1.images.arcpublishing.com/sltrib/E7UGHPVVTNHLBNFB3X7LQR3FWQ.jpg",
  "link": "https://www.sltrib.com/opinion/commentary/2022/03/22/paul-gibbs-mcmullins/",
  "mediaOutlet": "The Salt Lake Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    3196,
    3459,
    366,
    493,
    600,
    891,
    1197
  ],
  "sentences": [
    "Since 2014 I’ve partnered with local and national politicians, advocates, and organizations like Families USA, the Robert Wood Johnson Foundation and Utah Health Policy Project on issues ranging from expanding Medicaid in Utah and other states to protecting the Patient Protection and Affordable Care Act to adding dental coverage to Medicare.",
    "McMullin’s priorities include bringing down health care costs, allowing Medicare to negotiate lower prescription drug prices, working to reduce premiums and expanding telemedicine — which has been an absolute necessity to immunocompromised people like me during the pandemic.",
    "In 2019 I testified to the U.S. House Committee on Oversight and Reform on the importance of preserving ACA protections and called out Rep. Jim Jordan and others on their false promises to protect pre-existing condition coverage when their votes and records said otherwise.",
    "I decided to dig as deep as I could into McMullin’s positions, which led me down a road ending in a lengthy conversation with McMullin himself; one of multiple such conversations I’ve had with candidates in this critical race.",
    "I consider myself a pragmatic idealist, in that I’ll work with people of any political affiliation to find common ground and bring people access to health care, but there are some lines I absolutely will not cross.",
    "While there are opponents of McMullin’s out there who want you to believe that Evan opposes the ACA, it is clear to me that he believes the way forward is to improve the ACA, not repeal it.",
    "That includes refusing to support anyone who won’t protect the ACA, which I credit with keeping my transplanted kidney going and giving my children the chance to be born.",
    "Like me, he believes we have a moral obligation to make sure every American has access to quality, affordable healthcare, and that government has a role to play in that.",
    "As a health care activist and kidney transplant recipient, a candidate’s views on health care issues are critical to my choice of whether to support or oppose them.",
    "Paul Gibbs is an independent filmmaker, health care activist and Utahn who cares deeply about the future of health care and democracy in the United States.",
    "On the other end of the party spectrum, in 2012 I refused to vote for Democrat Jim Matheson for re-election because of his votes to repeal the ACA.",
    "When Evan McMullin announced his candidacy for U.S. Senate, I was skeptical as to whether I could support him given his conservative background.",
    "I was relieved and energized by his sincerity and happy to discover that he and I were on the same page to a degree I never imagined.",
    "But our common ground on health care is more than enough to assuage my concerns and convince me he’ll work to protect what we have.",
    "“In retrospect, I find it difficult to believe that America ever allowed shutting out pre-existing conditions,” McMullin told me.",
    "Of all the many health care advocates I’ve worked with across the country, none of us ever believed it was perfect as it is.",
    "And thankfully, Evan’s ideas to improve it coincide with mine in that they center around expanding access to care.",
    "And let’s be honest, nobody in our current congressional delegation is representing us well on health care issues.",
    "McMullin also repeatedly expressed a desire to represent those in Utah who are not currently represented.",
    "Frankly, there is no one in Congress I agree with 100% of the time, including on health care issues.",
    "Independent Senate candidate takes positions that will make health care more available to all.",
    "Even when I found out he had pledged not to join either caucus, I wasn’t convinced.",
    "Health care is an issue of great concern to many Utah voters, and rightly so.",
    "He lives with his wife and two sons in West Valley City.",
    "We all know the ACA needs fixing and improving.",
    "I probably won’t always agree with McMullin.",
    "RELATED STORIES"
  ]
}