{
  "id": 2258,
  "mediaId": 2724,
  "date": "2022-03-22",
  "headline": "Bill Barr: Joe Biden ‘Lied To The American People’ About Hunter’s Laptop Being ‘Russian Disinformation’",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/03/2022.03.22-11.49-thepoliticalinsider-6239b7d4ca047.jpg",
  "link": "https://thepoliticalinsider.com/bill-barr-joe-biden-lied-to-the-american-people-about-hunters-laptop-being-russian-disinformation/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rusty Weiss",
  "authorUrl": "https://thepoliticalinsider.com/author/rusty-weiss/",
  "termIds": [
    0
  ],
  "sentences": [
    "Still, Fox News reports that “Trump was upset with [Barr] for not refuting a claim now-President Biden made about emails on the laptop possibly being part of a Russian disinformation campaign.”\nIf Bill Bar was so disturbed by what was on Hunter Biden’s laptop- then why didn’t he do anything about it when he was in office?https://t.co/4tCEuARkBf\n— NYChick (@Tough_N_Tender) March 22, 2022\nBiden repeated the ‘Russian disinformation’ canard well after the election.",
    "This is INTERFERENCE in the election” pic.twitter.com/doOFbOaJtd\n— Benny (@bennyjohnson) March 21, 2022\nRELATED: NY Post Slams Intel Officials Who Claimed Hunter’s Laptop Was ‘Russian Disinformation’: Desperate To Get Biden Elected\nBill Barr: ‘Shocked’ Joe Biden Lied About Hunter’s Laptop\nSign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "Former Attorney General Bill Barr says he was “shocked” and “disturbed” that Joe Biden lied to the American people about his son Hunter’s infamous laptop being ‘Russian disinformation.’\nIn an interview with Fox News reporter John Roberts, the AG under Trump was confronted by comments he made regarding the many scandals that erupted from the Hunter Biden laptop.",
    "https://t.co/xreUKIkQaD\n— Alex Bruesewitz (@alexbruesewitz) March 22, 2022\nRELATED: Joe Rogan Hammers Media For Covering Up Hunter Biden Story: ‘They Ignore Facts To Push A Narrative’\nAs for keeping up the ‘tough against Trump’ persona, Bill Barr’s commentary on the Hunter Biden laptop scandal was far more muted when the former President asked him about it.",
    "You’re a one horse pony.” pic.twitter.com/x8HEvPjpFn\n— Daily Caller (@DailyCaller) December 22, 2020\nWhen asked about the revelation that the Hunter Biden laptop is real, White House press secretary Jen Psaki, who also felt compelled to comment on it being ‘Russian disinformation,’ suddenly couldn’t remark on the matter.",
    "The Times discussed having “obtained” and “authenticated” emails from “files that appear to have come from a laptop abandoned by [Hunter] Biden.”\nBarr ripped Joe Biden for, during a presidential debate, lying to the American people when he dismissed his son’s laptop as ‘Russian disinformation.’\n?",
    "“Let’s get to the facts, let’s figure out exactly how much Joe Biden knew about this,” Representative Jim Jordan (R-OH) told Fox News at the time as he called for a special counsel investigation into the business dealings revealed by the discovery of the device.",
    "The Justice Department, according to a Daily Mail report, had a “policy against taking actions that would interfere in an election.”\nBased on Barr’s comments in the present, they would have actually been taking action to prevent interference in the election.",
    "He doesn’t work for the United States.” pic.twitter.com/ONq0TPyF1i\n— Greg Price (@greg_price11) March 17, 2022\nIf Bill Barr was so shocked and disturbed by the lies being told by Biden and the media back in October of 2020, why didn’t he say anything?",
    "AUDIT ALL 50 STATES (@FoxNewsMom) March 2, 2022\nIn his book, Barr did note that Biden’s claims that the laptop story was ‘Russian disinformation’ amounted to a “bogus statement” and “deception” on the part of his campaign and the media.",
    "“He [was] squarely confronted with the laptop and suggested it was Russian disinformation and pointed to the letter written by intelligence people, it was baseless, which he knew was a lie, and I was shocked by that,” Barr continued.",
    "President-elect, do you still think that the stories from the fall about your son Hunter were Russian disinformation and a smear campaign like you said?” Fox News reporter Peter Doocy asked at a press conference in late December.",
    "“I’m a spokesperson for the United States; he doesn’t work for the United States.”\nPsaki is asked if she stands by calling the Hunter Biden laptop Russian disinfo:\n“I’d point you to the DOJ and Hunter Biden’s representatives.",
    "Nowhere is this more evident than in what Barr is saying now about the Hunter Biden laptop story and what he allegedly told President Trump at the time, according to excerpts from his new book.",
    "‘If only Trump had said, “You’re Fired.”\n– Diana West (Gab)\nBarr recalls yelling at Trump over Hunter Biden in last conversation before 2020 electionhttps://t.co/OVydgUcFwT\n— Anita Miller ?",
    "Biden replied, “Yes, yes, yes.”\nJoe Biden laughs when Fox News’ Peter Doocy asks if he still thinks the allegations against Hunter Biden are Russian disinformation:\n“Yes, yes, yes.",
    "Barr has been walking a tightrope of trying to appease those who view him as a formidable figure and trying to appear “reasonable” in contrast with former President Donald Trump.",
    "The New York Times recently admitted the laptop and its contents were real in a story on Hunter’s tax bill and the federal investigation into his business dealings.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "“You know this stuff from Hunter Biden’s laptop?” Trump asked Barr, according to his book, “One Damn Thing After Another.”\n“Mr.",
    "“I was very disturbed during the debate when candidate Biden lied to the American people about the laptop,” Barr told Roberts.",
    "“Fortunately the DNI came out and said no it’s not (Russian disinformation), and FBI said the same thing, media ignored it.",
    "Several Republican lawmakers and aides to President Trump at the time called on him to investigate the Hunter Biden laptop.",
    "I was disturbed that Joe Biden would stand up and lie to the American people when confronted about it in the debates.",
    "He even went so far as to suggest the Biden campaign and the media had colluded to ‘interfere’ in the election.",
    "“I’d point to the Department of Justice and Hunter Biden’s representatives,” she said when asked for comment.",
    "So when you are talking about interference in an election, can’t think of anything more…” he added.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "“You know, if that was one of my kids,” Trump again pressed before being cut off.",
    "He sat on the Hunter Biden laptop and he did nothing about the 2020 election.",
    "President, I can’t talk about that, and I am not going to,” Barr replied.",
    "“Dammit, Mr. President, I am not going to talk to you about Hunter Biden.",
    "Read this Next on ThePoliticalInsider.com\nMama Grizzly Comeback?",
    "Sarah Palin Says She May Run For Open Seat In Congress",
    "?BILL BARR:\n“Joe Biden knew the laptop was real.",
    "Bill Barr failed to do the right thing as AG.",
    "Period!” Barr fired back in a raised voice.",
    "I’m a spokesperson for the United States.",
    "The Intelligence letter was a baseless.",
    "Joe Biden knew it was a lie.",
    "God love you, man.",
    "Go away, hack.",
    "“Mr."
  ]
}