{
  "id": 2270,
  "mediaId": 2877,
  "date": "2022-03-25",
  "headline": "Top J6 Staffer Is a Russian Disinformationer",
  "image": "https://img.patriotpost.us/01FZ0RZBP38RGVFQ8S7C6DEZB2.jpeg?w=1200&h=600",
  "link": "https://patriotpost.us/articles/87204-top-j6-staffer-is-a-russian-disinformationer-2022-03-25",
  "mediaOutlet": "patriot post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    2201,
    2599,
    3102,
    4803,
    204,
    5287
  ],
  "sentences": [
    "That’s when “more than 50 former senior intelligence officials” sacrificed their ostensibly good names by signing a letter attesting to their belief that the New York Post’s blockbuster story about Hunter Biden’s laptop and its deeply incriminating emails “has all the classic earmarks of a Russian information operation.”\n“If we are right,” the signers added, “this is Russia trying to influence how Americans vote in this election, and we believe strongly that Americans need to be aware of this.”\nTalk about chutzpah.",
    "You know — the committee that kicked Republican Congressmen Jim Jordan and Jim Banks off of it because, as Pelosi put it, “With respect for the integrity of the investigation, with an insistence on the truth and with concern about statements made and actions taken by these Members, I must reject the recommendations of Representatives Banks and Jordan to the Select Committee.”\nYeah, because nothing says “integrity” and “truth” like a committee stacked with partisan hacks and liars.",
    "Meanwhile, the committee’s staff director intentionally lied to the public to keep President Trump out of the White house.”\nLast week, 17 months late and 24 paragraphs deep, The New York Times finally came clean about what the rest of us have known since mid-October of 2020: that deeply disturbed and woefully corrupt Hunter Biden’s pornography-saturated, influence-peddling, Big Guy-incriminating MacBook was authentic in every way.",
    "Nancy Pelosi’s “National Commission to Investigate the January 6 Attack on the United States Capitol Complex,” colloquially known as “The Rigged J6 Committee,” is still months away — perhaps even years away — from issuing its final report on the events of that day, but we already have a good sense of what the end product will be: deep state disinformation.",
    "So the next time Joe and Nancy and their fellow Democrats try to distract you from their miserable failures by talking about January 6, just remember: What they’re telling you has all the classic earmarks of a deep state information operation.",
    "As The Federalist notes: “While claims of Russian disinformation about the laptop were delegitimized with forensic analyses of its hard drive, it wasn’t until September of last year that Politico acknowledged the computer’s authenticity.",
    "The only thing that changed to cause legacy outlets to acknowledge the laptop’s legitimacy was Joe Biden’s status change from Democrat candidate for president to commander in chief.”\nTrue enough.",
    "That’s right: A guy who took part in a naked election interference scheme — a guy who put his thumb on the electoral scale in favor of Joe Brandon — is now on Nancy Pelosi’s J6 committee.",
    "“The laptop lie did enormous damage to the credibility of ‘ex-intelligence officials,’ just like the J6 witch-hunt has hurt the credibility of congressional investigations,” said Banks.",
    "And now we learn that one of those 51 Trump-hating deep state leftist stooges, former CIA Inspector General David Buckley, is a key senior staffer on Pelosi’s J6 committee.",
    "Poll after poll indicates he’s among the least popular presidents in American history, and without a doubt the most cognitively challenged.",
    "If that “all the classic earmarks” language sounds familiar to you, it’s because you heard it used just prior to the 2020 election.",
    "In doing so, the Times quietly tried to get on the right side of history and restore its damaged reputation.",
    "He’s become an embarrassment to the Left, and it no longer feels such a Praetorian need to protect him.",
    "“Speaker Pelosi blocked me from serving on the Committee because of ‘ridiculous’ statements I made.",
    "Democrats and leftists reflexively blame others for that which they themselves are guilty of doing.",
    "But something else about Biden’s status has changed: his standing with the American people.",
    "Well, because it has “all the classic earmarks” of a deep state information operation.",
    "The New York Times took longer, waiting until last week to follow suit.",
    "Is this a great country or what?",
    "Good luck w’ that.",
    "How do we know?"
  ]
}