{
  "id": 2296,
  "mediaId": 2726,
  "date": "2022-03-24",
  "headline": "Clarence Thomas' wife urged Mark Meadows to rally Republicans around Trump after the 2020 election and get those who hung on Trump's 'coattails' to pitch in",
  "image": "https://i.insider.com/623d1f4c093c4d001804f0ff?width=1200&format=jpeg",
  "link": "https://www.insider.com/clarence-thomas-wife-mark-meadows-rally-republicans-trump-coattails-2022-3",
  "mediaOutlet": "thisisinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cheryl Teh",
  "authorUrl": "https://www.insider.com/author/cheryl-teh",
  "termIds": [
    1680,
    1886,
    2201,
    2818,
    3712,
    3975,
    4462,
    878
  ],
  "sentences": [
    "Per the outlet, Thomas also suggested that Meadows should \"Help This Great President stand firm\" and stop the \"greatest Heist of our History\" — an apparent reference to Trump's baseless claim that votes had been switched en-masse in the 2020 election to give President Joe Biden the win.",
    "Thomas, a longtime conservative activist, recently admitted that she was present at the \"Stop the Steal\" rally at the Ellipse on January 6, 2021, but claimed she left before Trump took the stage and also denied having any ties to the event's organizers.",
    "\"House and Senate guys are pathetic too ... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy,\" wrote Thomas, appearing to refer to Reps. Louie Gohmert, Jim Jordan, Paul Gosar, and Chip Roy.",
    "Virginia \"Ginni\" Thomas, the wife of Supreme Court Justice Clarence Thomas, repeatedly urged Trump's chief of staff Mark Meadows to get Republicans to rally around former President Donald Trump after the 2020 election.",
    "In a text message sent a week after the election, Thomas suggested that Meadows should gather a group of Republicans around Trump by reminding them of his political strength, per The Post.",
    "According to an article by The Washington Post published on Thursday, Thomas had sent multiple text messages to Meadows encouraging the latter to help Trump overturn the election results.",
    "Her husband, Justice Clarence Thomas, was the sole dissenter in the Supreme Court's dismissal of Trump's bid to prevent the January 6 committee from obtaining White House records.",
    "According to the messages viewed by the Post, Thomas also expressed her disappointment in Republican lawmakers who were more reticent about their support for Trump.",
    "The Post obtained 29 of these text messages, which were among the thousands that Meadows provided to the January 6 committee investigating the Capitol riot.",
    "Justice Clarence Thomas' wife asked former White House chief of staff Mark Meadows to rally GOP support for Trump after the 2020 election.",
    "In a text message to Meadows, Virginia Thomas wrote: \"Where the heck are all those who benefited by Presidents coattails?!!!\"",
    "Thomas also expressed her feelings about those who had profited from their association with Trump.",
    "she said in a text message to Meadows late on November 10, 2020, according to the outlet.",
    "She also called Republican lawmakers who didn't show their support for Trump \"pathetic.\"",
    "Virginia Thomas did not immediately respond to a request for comment from Insider.",
    "\"Where the heck are all those who benefited by Presidents coattails?!!!\""
  ]
}