{
  "id": 2330,
  "mediaId": 2642,
  "date": "2022-03-26",
  "headline": "Jim Jordan is Getting Very Serious About Impeaching Joe Biden",
  "image": "https://waynedupree.com/wp-content/uploads/2022/03/Untitled-819-conflict-5-21.jpg",
  "link": "https://waynedupree.com/2022/03/jim-jordan-impeaching-joe-biden/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sophie O’Hara",
  "authorUrl": "https://waynedupree.com/author/sophieohara/",
  "termIds": [
    1670,
    2201,
    3151,
    3975,
    305,
    878,
    1039,
    1171
  ],
  "sentences": [
    "MORE NEWS: Dems Seethe After SCOTUS Sides With Republicans On Major Voting Map Issue\nAnd this definitely isn’t the first time the GOP has discussed impeaching Biden, as Ted Cruz is already promising the same thing as Jordan is once the Republicans take back the House and hopefully the Senate as well.",
    "You have to have complete buy-in from the entire conference and leadership of our conference.”\nRepublican Texas Sen. Ted Cruz said Biden could be impeached if Republicans regain control of the House after the 2022 midterm elections “whether it’s justified or not,” the Texas Tribune reported.",
    "And one of the real disadvantages of doing that…is the more you weaponize it and turn it into a partisan cudgel, you know, what’s good for the goose is good for the gander.”\nDemocrats definitely had to know that this ticket was coming due.",
    "The Daily Caller reported that Rep. Jordan, the top Republican on the House Judiciary Committee, cited Biden’s inability to handle the large influx of migrants at the U.S.-Mexico border, The Washington Times reported.",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of WayneDupree.com\nDEAR MEMBERS,\nAre you sick of seeing ads?",
    "After Democrats spent the last four years weaponizing impeachment, it’s no surprise that Republicans are gearing up to serve them a dose of their own medicine.",
    "See, unlike Trump, there’s actually a case for Biden to be impeached and Jim Jordan is practically drafting up the documents as we speak.",
    "He states that Biden’s complete ineptitude at the border is a basis for impeachment, which has been getting steadily worse every month.",
    "“Democrats weaponized impeachment,” he said, referencing the House Democrats twice impeaching former President Donald Trump.",
    "WayneDupree.com is proud to offer a PREMIUM VIP MEMBERSHIP that eliminates ads and gives you the BEST browsing experience.",
    "I mean, that’s just one issue, there’s literally a laundry list they can choose from to impeach this senile buzzard.",
    "The Ohio representative said a possible impeachment would have to be agreed upon by every House Republican.",
    "“They used it for partisan purposes to go after Trump because they disagreed with him.",
    "And rightfully so… no so-called “president” deserves to be impeached more than Mr.",
    "“I think that’s definitely a discussion we have to have,” Jordan told the outlet.",
    "Better buckle up, it’s gonna be one hell of a ride after November!",
    "Would be nice to get this clown quickly out of office.",
    "Well then it's time to get rid of them!",
    "“The conference has to decide.",
    "Follow Wayne on Rumble!",
    "Compromised Joe."
  ]
}