{
  "id": 2431,
  "mediaId": 2728,
  "date": "2022-03-23",
  "headline": "Mo Brooks says Donald Trump asked him to illegally ‘rescind’ the 2020 election",
  "image": "https://images.thestar.com/GuUuv71QaIzneikcH-_GPV15_8o=/1200x800/smart/filters:cb(1648079888010)/https://www.thestar.com/content/dam/thestar/news/world/uselection/2022/03/23/mo-brooks-says-donald-trump-asked-him-to-illegally-rescind-the-2020-election/donald_trump.jpg",
  "link": "https://www.thestar.com/news/world/uselection/2022/03/23/mo-brooks-says-donald-trump-asked-him-to-illegally-rescind-the-2020-election.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luke Broadwater",
  "authorUrl": "",
  "termIds": [
    2201,
    3975,
    4146,
    4537,
    878,
    4814,
    5371
  ],
  "sentences": [
    "“Very sad but, since he decided to go in another direction, so have I.”\nAfter Brooks released his statement, Trump responded with a second statement in which he did not address Brooks’ allegations but said the congressman “went ‘woke’ and decided to drop everything he stood for.”\nTrump said he would endorse another candidate in the race to replace Sen. Richard Shelby, who is retiring.",
    "“The only legal way America can prevent 2020’s election debacle is for patriotic Americans to focus on and win the 2022 and 2024 elections so that we have the power to enact laws that give us honest and accurate elections.”\nHe added, “I’ve told President Trump the truth knowing full well that it might cause President Trump to rescind his endorsement.",
    "Rep. Mo Brooks, R-Ala., who was deeply involved in former President Donald Trump’s effort to use Congress to upend the 2020 election and stay in office, claimed Wednesday that the former president had asked him repeatedly in the months since to illegally “rescind” the election, remove President Joe Biden and force a new special election.",
    "Game over after January 6.”\nBrooks’ high-profile break with Trump raised the possibility that he might cooperate with the House committee investigating the Jan. 6 attack, providing information the panel has so far been unable to secure about what Trump told his allies in Congress before, during and after the riot.",
    "On Jan. 6, he wore body armor as he addressed the throng of Trump supporters who gathered at the Ellipse near the White House, telling them to “start taking down names and kicking ass.”\n“Are you willing to do what it takes to fight for America?” Brooks said, prodding the crowd to cheer more loudly.",
    "Looking straight into the camera, Brooks said in the ad, “On Jan. 6, I proudly stood with President Trump in the fight against voter fraud.”\nBrooks has repeatedly defended his actions in challenging the legitimacy of the 2020 election and attempting to overturn its results.",
    "“President Trump asked me to rescind the 2020 elections, immediately remove Joe Biden from the White House, immediately put President Trump back in the White House, and hold a new special election for the presidency,” Brooks said in a statement Wednesday.",
    "“Noncitizens overwhelmingly voted for Joe Biden in exchange for the promised amnesty and citizenship and, in so doing, helped steal the election from Donald Trump, Republican candidates and American citizens all across America,” Brooks said at the time.",
    "He also spread false claims that people who identify with antifa, a loose collective of anti-fascist activists, might have been responsible for the violence, and he gave a speech on the floor falsely claiming the election was stolen from Trump.",
    "In his statement, he said he had fought on behalf of Trump “between Nov. 3 and Jan. 6” — “when it counted.”\nOn Dec. 21, 2020, Brooks and other House Republicans met with Trump at the White House to discuss plans to object to the election.",
    "In retracting his endorsement of Brooks on Wednesday, Trump abandoned one of his most loyal acolytes in the House after months of simmering frustration and as polls showed Brooks falling behind in his state’s Republican primary.",
    "The former president has privately met with both of the other leading candidates: Katie Britt, a former top aide to Shelby, and Mike Durant, who was in one of the Black Hawk helicopters that was shot down in Somalia in 1993.",
    "He said he had initially hoped the requests were not connected to his endorsement in the Senate race but now believes that Trump was dangling public support of Brooks’ candidacy as leverage to try to get a new election.",
    "But the account from the Alabama congressman, who played a central role in challenging electoral votes for Biden on Jan. 6, 2021, suggested that Trump has continued his efforts to overturn his defeat and be reinstated.",
    "Durant was in Mar-a-Lago, Trump’s residence in Palm Beach, Florida, for a meeting with him this week, according to a person with knowledge of the meeting who spoke about it on the condition of anonymity.",
    "His statement came after Trump withdrew his endorsement of Brooks in the Republican primary for Alabama’s Senate seat, undercutting the congressman’s already slim chances in a crowded intraparty race.",
    "It marked the first time a lawmaker who was involved in Trump’s attempts to invalidate his election defeat has said that Trump asked for actions that, were they possible, would violate federal law.",
    "Shelby recently told Politico that he planned to use his leftover campaign funds — as much as $6 million — to help Britt, a financial infusion that further narrowed Brooks’ pathway to victory.",
    "“As a lawyer, I’ve repeatedly advised President Trump that Jan. 6 was the final election contest verdict and neither the U.S. Constitution nor the U.S. Code permit what President Trump asks.",
    "Brooks made the extraordinary charge as the two onetime allies were engaged in a bitter political feud, and it was not immediately clear how their falling out related to the accusation.",
    "Other Republicans involved in the effort to overturn the 2020 election — Reps. Jim Jordan of Ohio and Scott Perry of Pennsylvania — have refused requests from the panel for interviews.",
    "“Will you fight for America?”\nLater on Capitol Hill, after a pro-Trump mob rampaged through the building, Brooks tried to object to electoral votes from several states for Biden.",
    "In a sign of the former president’s continued focus on the 2020 election, he cited Brooks’ remarks at a rally last summer urging voters to move on from Trump’s 2020 defeat.",
    "Rep. Mo Brooks claimed the former president had asked him repeatedly to illegally “rescind” the election, remove President Joe Biden and force a new special election.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "“When I heard his statement, I said, ‘Mo, you just blew the election, and there’s nothing you can do about it,’” Trump said in a statement Wednesday.",
    "He said the former president did not specify how exactly Congress would reinstall him as president, and Brooks repeatedly told him it was impossible.",
    "In a last-ditch effort to keep Trump in his corner, Brooks released a television ad last week that used footage from his speech at the Jan. 6 rally.",
    "The Trump endorsement has been so central to the Brooks candidacy that his official campaign logo included the fact that Trump had endorsed him.",
    "I break my sworn oath for no man.”\nSHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "“There is one and only one per the Constitution and U. S. Code and it occurs on the first Jan. 6 after each presidential election.",
    "Period.”\nIn a subsequent text message, Brooks said Trump had made the request of him on “multiple occasions” since Sept. 1, 2021.",
    "“For emphasis, the conversations about Jan. 6, 2021 being the only 2020 remedy have been going off and on for 6+ months.",
    "“I know what the legal remedy for a contested presidential election is,” he continued.",
    "Brooks has struggled to raise money and has seen his support in the contest evaporate.",
    "“I told President Trump that ‘rescinding’ the 2020 election was not a legal option.",
    "Brooks said Trump brought up the matter to him repeatedly over the past six months.",
    "“I repeat what has prompted President Trump’s ire,” he said in his statement.",
    "“I hoped not but you’ve seen what happened today,” Brooks said in a text.",
    "But I took a sworn oath to defend and protect the U.S. Constitution.",
    "Brooks did not immediately respond to further questions.",
    "Some private surveys had Brooks sagging to third place.",
    "The Star does not endorse these opinions.",
    "But Wednesday, he lashed back at Trump.",
    "Period,” Brooks wrote.",
    "That is the way I am.",
    "I honor my oath.",
    "Period."
  ]
}