{
  "id": 2469,
  "mediaId": 2679,
  "date": "2022-03-29",
  "headline": "Call logs underscore Trump’s efforts to sway lawmakers on Jan. 6",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/nation-politics/call-logs-underscore-trumps-efforts-to-sway-lawmakers-on-jan-6/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luke Broadwater",
  "authorUrl": "https://www.seattletimes.com/author/cap-luke-broadwater/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’m calling you because I want to discuss with you how they’re trying to rush this hearing and how we need you, our Republican friends, to try to just slow it down.”\nThe news of the call logs came the same day that the White House said Biden would not extend executive privilege to cover any testimony to the committee by Ivanka Trump and Jared Kushner, Trump’s daughter and son-in-law, who worked as his advisers.",
    "“And he’s been quite clear that they posed a unique threat to our democracy and that the constitutional protections of executive privilege should not be used to shield, from Congress or the public, information about an attack on the Constitution itself.”\nKushner is scheduled to testify before the committee this week, while Ivanka Trump has been negotiating the terms of her potential cooperation.",
    "The logs, reported earlier by The Washington Post and CBS and authenticated by The New York Times, indicated that Trump had called Republican members of Congress, including Sen. Mitch McConnell of Kentucky, Sen. Josh Hawley of Missouri and Rep. Jim Jordan of Ohio, as he sought to pressure Vice President Mike Pence to reject electoral votes from several states.",
    "During that call, Trump was said to have sided with the rioters, telling the top House Republicans that members of the mob who had stormed the Capitol were “more upset about the election than you are.”\nRudy Giuliani, Trump’s personal lawyer, was also calling lawmakers that day and continued to do so even after rioters laid siege to the building.",
    "“I publicly congratulated President Biden on his victory and received a phone call after that from President Trump and that’s the last time we’ve spoke.”\nThe logs also show Trump reached out on the morning of Jan. 6 to Jordan, who had been among members of Congress organizing objections to Joe Biden’s election on the House floor.",
    "WASHINGTON — As part of his frenzied attempt to cling to power, President Donald Trump reached out repeatedly to members of Congress on Jan. 6, 2021, both before and during the siege of the Capitol, according to White House call logs and evidence gathered by the House committee investigating the attack.",
    "It is well known that Trump routinely used his personal cellphone, and those of his aides, to talk with other aides, congressional allies and outside confidants, bypassing the normal channels of presidential communication and possibly explaining why the calls were not logged.",
    "For instance, Trump mistakenly called the phone of Sen. Mike Lee, R-Utah, thinking it was the number of Sen. Tommy Tuberville, R-Ala. Lee then passed the phone to Tuberville, who said he had spoken to Trump for less than 10 minutes as rioters were breaking into the building.",
    "“The president has spoken to the fact that Jan. 6 was one of the darkest days in our country’s history, and that we must have a full accounting of what happened to ensure that it never occurs again,” said White House spokesperson Kate Bedingfield.",
    "Advertising\n Skip Ad\nThe logs show Trump and Jordan spoke from 9:24 a.m. to 9:34 a.m. Jordan has acknowledged speaking with Trump on Jan. 6, although he has said he cannot remember how many times they spoke that day or when the calls occurred.",
    "He would occasionally use it from the Oval Office, the former officials said, but more often he would make calls through the assistants sitting outside the office, as well as from his cellphone or an aide’s cellphone.",
    "Advertising\n Skip AdSkip AdSkip Ad\nThe president also fielded a call from Rep. Kevin McCarthy of California, the top House Republican, who told Trump that people were breaking into his office on Capitol Hill.",
    "Advertising\n Skip AdSkip AdSkip Ad\nPeople trying to reach Trump sometimes called the cellphone of Dan Scavino, former deputy chief of staff and omnipresent aide, one of the former officials said.",
    "Tuberville, or I should say Coach Tuberville, this is Rudy Giuliani, the president’s lawyer,” Giuliani said in a voicemail message intended for Tuberville, but mistakenly left on Lee’s phone.",
    "(The House committee investigating the attack recommended Monday evening that Scavino be charged with criminal contempt of Congress for refusing to cooperate with a subpoena from the panel.)",
    "The logs also show that Trump spoke from 11:04 a.m. to 11:06 a.m. with former Sen. David Purdue, R-Ga., who had recently lost his reelection campaign to Sen. Raphael Warnock.",
    "The Washington Post and CBS reported Tuesday that a gap in the phone logs amounted to 7 hours and 37 minutes, including the period when the building was being assaulted.",
    "Despite the lack of call records from the White House, the committee has learned that Trump spoke on the phone with other Republican lawmakers on the morning of Jan. 6.",
    "One of the calls made by Trump on Jan. 6, 2021 — at 9:16 a.m. — was to McConnell, the Senate’s top Republican, who refused to go along with Trump’s pressure campaign.",
    "Three former officials who worked under Trump said that he mostly used the switchboard operator for outgoing calls when he was in the residence.",
    "The New York Times reported last month that the committee had discovered gaps in official White House telephone logs from the day of the riot.",
    "The call logs were among documents turned over by the National Archives to the House committee examining the attack last year on the Capitol.",
    "But the logs also have a large gap with no record of calls by Trump from critical hours when investigators know that he was making them.",
    "“The last time I spoke to the president was the day after the Electoral College declared President Biden the winner,” McConnell said.",
    "In an evening phone call, he made clear that the effort to fight the result of the election was still alive even after the riot.",
    "Trump checked with the White House switchboard operator at 10:40 a.m. to make sure a message had been left for McConnell.",
    "A spokesperson for Sen. Bill Hagerty, R- Tenn., confirmed he had called Trump on Jan. 6 but said they did not connect.",
    "But the call logs nevertheless show how personally involved Trump was in his last-ditch attempt to stay in office.",
    "The assistants were supposed to keep records of the calls, but officials said the record keeping was not thorough.",
    "A spokesperson for Hawley said Tuesday that the two men did not connect and did not speak until March.",
    "Investigators have not uncovered evidence that any official records were tampered with or deleted.",
    "The logs appear to have captured calls that were routed through the White House switchboard.",
    "McConnell declined to return the president’s calls, he told reporters Tuesday.",
    "Trump called Hawley at 9:39 a.m., and Hawley returned his phone call.",
    "This story was originally published at nytimes.com.",
    "Most Read Nation & World Stories\n“Sen.",
    "Hagerty declined to comment.",
    "Read it here."
  ]
}