{
  "id": 2520,
  "mediaId": 2746,
  "date": "2022-03-21",
  "headline": "Lawmakers question if FBI director misled Congress after audit revealed agents’ rule-breaking",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/11/cybersecurity_reporting_congress_63642_c0-0-5744-3350_s1200x700.jpg?89e52eb311680b34c7d6fb40b8dcb6856b18b3bd",
  "link": "https://www.washingtontimes.com/news/2022/mar/21/lawmakers-question-if-fbi-director-misled-congress/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Lovelace",
  "authorUrl": "https://www.washingtontimes.com/staff/ryan-lovelace/",
  "termIds": [
    1390,
    1670,
    1911,
    2780,
    370,
    1124,
    1161
  ],
  "sentences": [
    "Rep. Jamie Raskin, a Maryland Democrat who chairs the Oversight and Reform subcommittee on civil rights and civil liberties, requested that the Government Accountability Office review the FBI’s surveillance of groups and individuals through “assessments.”\nAssessments may lead to investigations, and they can use surveillance not requiring a court order, the usage and recruitment of human sources and the examination of publicly available information, among other things, according to the Attorney General’s Guidelines for Domestic FBI Operations signed in September 2008.",
    "The lawmakers’ letter asked Mr. Wray for an unredacted copy of the 2019 audit, all documents and communications relating to the 2019 audit, a description of the predicate needed to open sensitive investigative matters, an explanation of whether the FBI has resolved compliance issues, and unredacted copies of all other internal reviews since November 2019.",
    "The letter said portions of the audit that are redacted concerning search warrants and investigative methods suggest “there could be additional misconduct that the FBI continues to shield from public scrutiny.”\nThe lawmakers requested the information and a briefing within two weeks, before 5 p.m. on April 4.",
    "Mr. Wray told the committee last year that the FBI investigates individuals “with proper predication” or a basis for doing so, and that the bureau does not probe “First Amendment groups” for speech, association, assembly or membership in those groups, according to the lawmakers’ letter.",
    "The 2019 audit did not identify the people and groups investigated by the FBI but provided a categorical breakdown showing dozens of cases involving religious groups or their prominent members and dozens of cases involving political organizations and individuals.",
    "The review also showed agents failing to receive approval before starting investigations, agents failing to document a necessary legal review before opening an investigation, and agents failing to tell prosecutors what they were doing, among other things.",
    "“The committee must examine whether the FBI is taking seriously its compliance with its own rules intended to protect American civil liberties.”\nThey said they were concerned that the audit found other misconduct that the FBI is keeping from the public.",
    "House Judiciary Committee Republicans on Monday demanded that FBI Director Christopher A. Wray explain potential discrepancies between his testimony last year to Congress and the findings of a 2019 agency audit that revealed rules-breaking by agents.",
    "“This internal review — which you never disclosed and which shows fundamental errors with FBI investigations touching on sensitive political and constitutional matters — calls into question the reliability of your statements,” the lawmakers wrote.",
    "In a letter to Mr. Wray, the lawmakers asked for information about the bureau’s misconduct in investigations involving politicians, candidates, religious groups and others detailed in the audit first reported by The Washington Times.",
    "A sensitive investigative matter, or SIM, is an action that may affect Americans’ constitutional rights because they involve people engaged in activities such as politics, government, news media or religious expression.",
    "Previously, the FBI told The Times that the audit’s 2019 findings were “unacceptable,” that the bureau took compliance seriously and that it attempted to fix the rule-breaking by changing its agents’ training.",
    "“There’s a lot of concern among Republicans about the politicization of the FBI and its out-of-control nature.”\nDemocrats have concerns about the FBI’s domestic operations, too.",
    "The panel is waiting for the GAO’s report and is engaged directly with the FBI on its use of assessments, according to a spokesperson for the committee.",
    "FBI auditors discovered a ratio of slightly more than two “compliance errors” per SIM that the auditors examined from Jan. 1, 2018, to June 30, 2019.",
    "It was signed by Judiciary Committee ranking member Jim Jordan of Ohio and committee members Mike Johnson of Louisiana and Andy Biggs of Arizona.",
    "Cato Institute senior fellow Patrick Eddington uncovered the 2019 audit in litigation against the FBI for access to government records.",
    "For example, 35 full investigations and four preliminary investigations did not have the approval of an FBI special agent in charge.",
    "In total, the 2019 audit showed agents violating FBI rules 747 times in 18 months while conducting sensitive investigations.",
    "Russell Dye, a spokesman for the committee’s Republicans, said the lawmakers expect the FBI will answer its questions.",
    "Mr. Raskin made the request with Rep. Nancy Mace of South Carolina, the top Republican on the subcommittee.",
    "“Director Wray was brought in to clean up FBI abuses, but we keep seeing the same things,” Mr. Dye said.",
    "The FBI said it received the lawmakers’ letter on Monday but declined to comment further.",
    "Ten cases involved political candidates and 11 cases involved news media.",
    "The auditors reviewed a small portion of the bureau’s total portfolio.",
    "Most of the cases examined, 191, involved domestic public officials.",
    "He thinks more FBI wrongdoing remains unexamined.",
    "The Times obtained a copy of the letter."
  ]
}