{
  "id": 2545,
  "mediaId": 2641,
  "date": "2022-03-23",
  "headline": "Rep. Jim Jordan: 'Pattern of Misconduct and Mismanagement Within the FBI'",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=dec18adc-e86f-4b6a-a3f5-5e158fe041f6&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/jim-jordan-fbi-internal-audit-rules/2022/03/23/id/1062594/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Malbin",
  "authorUrl": "",
  "termIds": [
    1670,
    1934,
    2780,
    370,
    404,
    1132,
    1163
  ],
  "sentences": [
    "\"While the number of deviations from FBI approval, notification, and administrative requirements noted in the report is unacceptable, we began implementing important changes in training and raising awareness even prior to issuance of the report, and we remain committed to ensuring all personnel adhere to our internal investigative and operational guidelines,\" the FBI told Newsweek.",
    "\"And oh, by the way, I didn't even mention that just a few months ago we had a whistleblower come forward, and he had talked about an email he received from the FBI, went out to FBI agents across the country that said 'Put this label on moms and dads' ... this whole domestic terrorism concern that Merrick Garland said wasn't happening but sure looks like it is.",
    "Jordan and two other GOP representatives sent a letter to Wray on Monday asking for more information about the 2019 audit, following a recent report which said the audit showed the FBI \"violated agency rules at least 747 times in 18 months while conducting investigations involving politicians, candidates, religious groups, news media, and others.\"",
    "Rep. Jim Jordan, R-Ohio, says FBI Director Christopher Wray needs to explain why an internal audit of the FBI has found violations of its own policies when conducting surveillance investigations, The Washington Examiner reported.",
    "\"This internal audit and the staggering number of errors it found suggest a pattern of misconduct and mismanagement within the FBI in failing to uphold internal rules for its most sensitive cases,\" the letter read.",
    "The FBI has reportedly said it conducted the 2019 audit because it \"takes compliance very seriously, especially when it comes to sensitive investigative matters.\"",
    "\"When you put all this together, this is why we are concerned, and we want to see that audit in its un-redacted form,\" Jordan said in the interview.",
    "\"This is the Federal Bureau of Investigation, part of the Justice Department, not following their own rules,\" Jordan said in a Fox News interview.",
    "\"This internal review documented systemic FBI failures to follow its own rules and procedures.\"",
    "This is the same agency.\"",
    "All rights reserved.",
    "© 2022 Newsmax."
  ]
}