{
  "id": 2608,
  "mediaId": 2909,
  "date": "2022-03-20",
  "headline": "Liberal Media Silent Over Hunter Biden Laptop – Again",
  "image": "https://deneenborelli.com/wp-content/uploads/2022/03/Screen-Shot-2020-10-14-at-5.03.04-PM-1200x630-copy.jpg",
  "link": "https://deneenborelli.com/2022/03/liberal-media-silent-over-hunter-biden-laptop-again/",
  "mediaOutlet": "deneenborelli.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Deneen Borelli",
  "authorUrl": "https://deneenborelli.com/author/deneenborelli/",
  "termIds": [
    3975,
    1054,
    5371
  ],
  "sentences": [
    "During the 2020 presidential election, major news outlets described Hunter’s laptop as “Russian disinformation” and the New York Post notes it took The New York Times “nearly 17 months” to acknowledge Hunter’s numerous controversies.",
    "Major liberal media outlets are silent over The New York Times reporting about Hunter Biden’s emails, laptop, and questions over foreign business deals that leveraged his father’s name.",
    "The media played a significant role in silencing the revelation of the laptop at the end of the 2020 presidential election and they are carrying through now.",
    "The contents of Hunter’s laptop was a real and legitimate issue in the 2020 presidential election but the media did it’s best to keep it under the rug.",
    "The New York Times published the story this week verifying these concerns surrounding Hunter including an investigation by the Justice Department.",
    "Soon after, the New York Post’s Twitter account was blocked for promoting its bombshell news about Hunter and former Vice President Joe Biden.",
    "Senior former intelligence officials signed a letter refuting allegations and concerns about Hunter’s laptop and emails.",
    "Even now, with the New York Times verifying the legitimacy of the laptop, the media are largely ignoring it.",
    "After the first revelation about the laptop, the media had backup from former members of U.S. intelligence.",
    "In October 2020, the New York Post broke the story about Hunter’s laptop.",
    "Critics commented on social media."
  ]
}