{
  "id": 2625,
  "mediaId": 2753,
  "date": "2022-03-28",
  "headline": "Again I ask: Why wait for 2024 for Trump?",
  "image": "https://www.wnd.com/wp-content/uploads/2020/12/white-house-building-marine-one-helicopter.jpg",
  "link": "https://www.wnd.com/2022/03/ask-wait-2024-trump/",
  "mediaOutlet": "WorldNetDaily",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Farah",
  "authorUrl": "https://www.wnd.com/author/jfarah/",
  "termIds": [
    0
  ],
  "sentences": [
    "I thought, with Trump's popularity among most Republicans, the new GOP majority in the House could elect him speaker in January 2023 since the job doesn't constitutionally require, as most people think, election to the House of Representatives itself.",
    "A couple weeks after I wrote the first piece, Steve Bannon, the former chief strategist in the early days of the Trump administration, gave a speech to Boston Republicans that turned into a headline in the Boston Herald.",
    "After Republicans win the House and Senate back, and name Trump as speaker of the House, they could turn the tables on Biden and Kamala and impeach them for the \"illegitimate activities of stealing the presidency.\"",
    "I knew the only way I could figure out a plan depended on getting him up to six years as president – two if he assumed the presidency after a brief time as speaker of the House, followed by another four-year term.",
    "\"Trump is a disrupter, but he has a long-term vision because I absolutely believe in the marrow of my bones that he will be our nominee in 2024,\" Bannon said at a Lincoln Day Breakfast.",
    "He said Trump could have a \"major role in the upcoming 2022 congressional elections, with a potential payoff that would greatly impact the future of President Biden's term in office.\"",
    "You may have heard Matt Gaetz, the renegade Florida congressman, once again vowing publicly to nominate Trump for speaker of the House – at Saturday's Trump rally in Georgia.",
    "The worst thing he has ever done was to commit a high crime against America by perpetuating election fraud against the greatest country the world as ever known.",
    "He could take part in what should be the first order of business by the House of Representatives – the anticipated impeachment of Biden and Kamala Harris.",
    "And if it helps the GOP regain the majority, there is growing support for installing Trump as House speaker, allowed under House rules,\" the report said.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "It will be a little more difficulty to get the two-thirds vote to get the Senate to go along, but Trump could then switch jobs to the presidency.",
    "His achievements in four years exceeded that of George Washington, Thomas Jefferson, Abraham Lincoln, Theodore Roosevelt and Ronald Reagan.",
    "But Trump was one of a kind – a Republican and a fighter for America and the Constitution, just like Washington, Jefferson and John Adams.",
    "All I want for my role in this is a \"thank you\" note from Trump, and to be a semi-regular attendee at his White House press conferences.",
    "I mean use the impending 2022 expected \"red wave\" that's coming in the midterm election to get him almost two more years as president.",
    "Biden is sullen, his voice hurts my ears, he's cognitively challenged, he's incoherent, he falls a lot – and, worst of all, he's mean.",
    "That would be poetic justice for him – more time total in the White House than winning won reelection, which he actually did in 2020.",
    "Since the earliest days of the Biden occupation, I have been dreaming, fantasizing and thinking about what might be coming next.",
    "They know that Joe Biden is simply serving the ruling class he has so loyally served to undo everything Trump put into place.",
    "With the possibility of having Donald Trump as speaker, conservative voter turnout would be through the roof nationwide.\"",
    "When Joe Biden took the oath of office to become president – or, should we say, presidential pretender – I was morose.",
    "Disrn.com's Peter Heck wrote: \"Odds are increasing that Donald Trump could be the next speaker of the House.\"",
    "\"House rules allow for the majority to select someone from the outside to serve in the position,\" wrote Heck.",
    "Paul Bedard took up the idea in his recent Washington Examiner column headlined \"Trump for speaker.\"",
    "Don't get me started trying to recall everything he's done to date that has hurt average Americans.",
    "Do you really think Biden got an astonishing record 81,284,666 votes – more than Barack Obama did?",
    "If he doesn't get it, he could resign the speakership in favor of Kevin McCarthy or Jim Jordan.",
    "He said the latest to join the campaign is Ed Martin, president of Phyllis Schlafly Eagles.",
    "He pointed out that a GOP majority in the House following 2022 could elect Trump speaker.",
    "I believe Donald Trump was the greatest president in the history of the United States.",
    "For licensing opportunities of our original content, please contact [email protected].",
    "Aides said that he is focused on electing friendly Republicans in the 2022 election.",
    "So, immediately I started calculating how to get him more time to complete the job.",
    "It led to more than 150,000, at least, to enter the country every month since.",
    "That's what he called for during the Democratic debates, believe it or not.",
    "Four days to get it in print – Jan. 24, 2021, to be exact, at 5:48 p.m.",
    "While Trump was the greatest president ever, Biden has been the worst.",
    "I believe the last three numbers – but no way did he win legitimately.",
    "He started by leading the \"surge\" on the border with illegal aliens.",
    "Three days after Biden became the Impostor in Chief, it came to me.",
    "We'll have a sweeping victory in 2022, and he'll lead us in 2024.\"",
    "Then he attacked the oil industry in the name of \"climate change.\"",
    "It only requires nomination by a member of the House – and a vote.",
    "He not only made America great again, he gave America hope again.",
    "The true uprising Donald Trump began will not simply fade away.",
    "Since my first column on the subject, the idea has gone viral.",
    "I texted Bannon a message asking if he had read my column.",
    "What do I mean by \"a brief time as speaker of the House\"?",
    "He lies on a grand scale, and he's hopelessly immoral.",
    "There's been more interest in the idea since then.",
    "It's the only gambit that gets Trump six years.",
    "\"And what about former President Donald Trump?",
    "It was not an easy rigged election to take.",
    "Sounds like he is entertaining the notion.",
    "Trump is seemingly more popular than ever.",
    "Nobody but Trump is up to the challenge.",
    "Martin told \"Secrets\": \"I'm serious.",
    "Let's make it a real big \"red wave.\"",
    "He's beloved by ordinary Americans.",
    "It was called \"Why wait for 2024?\"",
    "This might be a magic MAGA moment!",
    "He didn't counter Gaetz's remark.",
    "He probably got half that many.",
    "Then out-of-control inflation.",
    "Trump was right next to him.",
    "That was not easy to accept.",
    "Reagan changed my politics.",
    "We need the Trump voters.",
    "He didn't even campaign.",
    "He never left his house.",
    "Then it was Afghanistan.",
    "\"He'll come back to us.",
    "\"I loved it,\" he said.",
    "And on and on it goes.",
    "Then the supply chain.",
    "The Ukraine disaster.",
    "I loved them all.",
    "Ride the wave.",
    "That's right!",
    "Come on, man!",
    "He heard it."
  ]
}