{
  "id": 2652,
  "mediaId": 2627,
  "date": "2022-03-29",
  "headline": "Why it matters that Jim Jordan is talking about impeaching Biden",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220329-Jim-Jordan-al-0855-f788d8.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/matters-jim-jordan-talking-impeaching-biden-rcna21970",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    1670,
    2299,
    3975,
    4711,
    878,
    1161,
    5040,
    5063,
    5366
  ],
  "sentences": [
    "But after Biden’s inauguration, several House Republicans filed articles of impeachment against the Democratic president, and in January, Republican Sen. Ted Cruz of Texas added that he believes a Republican-led House would likely consider impeaching Biden on “multiple grounds.”\nNow, Jordan is describing impeachment as “a discussion we have to have” — and the more prominent GOP voices promote such an idea, the more traction it’s likely to gain among Republican lawmakers, aligned media outlets, and the party’s base.",
    "As House Republicans huddled in south Florida this past weekend for a planning retreat, Jordan told the conservative newspaper, in reference to presidential impeachment, “I think that’s definitely a discussion we have to have.”\nAt first blush, it may be tempting to roll one’s eyes at such rhetoric and move on, but there are a few reasons not to brush past this too quickly.",
    "Circling back to our earlier coverage, the first Republican senator to broach the subject of impeaching Joe Biden was Iowa’s Joni Ernst, who raised the prospect two years ago — long before the Delaware Democrat had even secured his party’s nomination.",
    "It was a straightforward calculus: The more voters on the left believed Republicans might actually try to impeach the Democratic president, the more motivated Democratic voters would be to open their wallets and show up on Election Day.",
    "As regular readers may recall, ahead of the 2014 midterm elections, more than a few Republicans talked up the idea of impeaching then-President Barack Obama for reasons they struggled to articulate.",
    "It reached the point that GOP leaders had to start downplaying the talk — not because they felt the need to defend Obama, but because they feared the effects of a Democratic backlash.",
    "But given the radicalization of Republican politics, it’s not premature to wonder about the kind of priorities a GOP majority might pursue if given the opportunity.",
    "The chatter grew loud enough that Democrats started fundraising on the issue — which proved to be a good idea when the Democratic base had a strong response.",
    "On the contrary, the Ohio Republican would likely be the chairman of the House Judiciary Committee if there’s a GOP majority in the House next year.",
    "The GOP senator said at the time that the impeachment door “has been opened” and pointed to conspiracy theories about Burisma and Ukraine.",
    "Eight years later, Republicans are well positioned to make gains on Capitol Hill, as frustrated voters look for a change.",
    "It’s a little too soon to start making predictions about what a Republican majority on Capitol Hill would do with power.",
    "The conservative Washington Times reported, for example, on one goal some in the party appear to be taking seriously.",
    "After all, the midterm elections are still 223 days away, and a lot can (and will) happen between now and then.",
    "But much of the electorate is probably thinking GOP lawmakers intend to focus on gas prices and inflation.",
    "Recommended\nFinally, let’s not forget that Democrats might be eager to take advantage of such radicalism.",
    "Such chatter was far too ridiculous to be sustained, and even Ernst stopped talking about the idea.",
    "Don’t be surprised if Democrats remind voters that Republicans’ interests appear to lie elsewhere.",
    "And which congressional panel is responsible for initiating presidential impeachment proceedings?",
    "First, Jordan isn’t just some random far-right legislator of little consequence.",
    "Jordan’s opinions may be ridiculous, but that doesn’t mean they’re irrelevant.",
    "Second, the Ohioan isn’t the only Republican making such noises.",
    "The House Judiciary Committee."
  ]
}