{
  "id": 2657,
  "mediaId": 2746,
  "date": "2022-03-25",
  "headline": "Jim Jordan prods GOP colleagues to consider impeaching Biden",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/16/Russia_Ukraine_War_Congress_95611.jpg-fe5ab_c0-205-4934-3083_s1200x700.jpg?9143f55e6c9d8a5527d73a789361f6a72fcb6e49",
  "link": "https://www.washingtontimes.com/news/2022/mar/25/jim-jordan-prods-gop-colleagues-consider-impeachin/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Ferrechio",
  "authorUrl": "https://www.washingtontimes.com/staff/susan-ferrechio/",
  "termIds": [
    0
  ],
  "sentences": [
    "Mr. Biden reversed other Trump-era immigration restrictions that were sending more than 1,000 people a day back to Mexico and discouraging others from making illegal crossings into the U.S.\nA federal judge forced the Biden administration to restart the program, but the Biden administration is sending about eight people a day back to Mexico out of the nearly 5,000 encounters with border jumpers daily.",
    "In September, four House Republicans said they planned to file articles of impeachment against Mr. Biden, citing the ongoing flood of migrants crossing the border illegally and Mr. Biden’s chaotic U.S. withdrawal from Afghanistan, which resulted in the deaths of 13 service members killed by a bomb while guarding the Kabul airport.",
    "“The president of the United States is supposed to enforce the laws along the border and they’re not doing it.”\nMr. Cruz said during his podcast Republicans would be more eager to launch a Biden impeachment trial because Democrats spent four years targeting Mr. Trump.",
    "PONTE VEDRA BEACH, Fla. — Rep. Jim Jordan of Ohio, the top Republican on the House Judiciary Committee who is poised to control the panel if the GOP takeover next year, said Republicans must consider impeaching President Biden.",
    "Critics blame Mr. Biden’s policies, such as allowing migrants traveling with children to remain in the country while awaiting asylum hearings, rather than maintaining the policy of returning them to Mexico.",
    "Campaign analysts predict the House GOP will pick up enough seats to win back the gavel and could flip dozens of blue districts as voters sour on Mr. Biden and an increasingly left-wing Democratic agenda.",
    "More than 1.7 migrants were encountered by border agents along the southwestern border in 2021, nearly four times the number of illegal crossings the previous year, when Mr. Trump was president.",
    "He said the GOP should weigh impeaching Mr. Biden for failures in office, most notably his administration’s inability to stop a massive influx of illegal immigration through the southern border.",
    "“You have to have complete buy-in from the entire conference and the leadership of our conference.”\nSome Republicans have already signaled an appetite for removing Mr. Biden from office.",
    "“The more you weaponize it and turn it into a partisan cudgel,” Mr. Cruz said, “you know, what’s good for the goose is good for the gander.”\n• Stephen Dinan contributed to this report.",
    "Mr. Biden’s refusal to enforce immigration laws is in defiance of Article 2 of the Constitution and “is probably the strongest grounds right now” for impeachment, the senator said.",
    "The first impeachment, in 2019, charged him with corruption over his attempt to get Ukrainian President Volodymyr Zelenskyy to investigate the Bidens.",
    "“Yeah, I do think there’s a chance of that, whether it’s justified or not,” Mr. Cruz said earlier this year on his “Verdict with Ted Cruz” podcast.",
    "“I think that’s definitely a discussion we have to have,” Mr. Jordan told The Washington Times at a Republican planning retreat in Florida.",
    "But the lawmaker said the decision to try to remove the president from office would have to be agreed upon by every House Republican.",
    "Republicans believe Democrats politicized the impeachment process to damage Mr. Trump and may be eager to strike back, Mr. Cruz said.",
    "Sen. Ted Cruz, Texas Republican, said he believes the GOP would impeach Mr. Biden if they regain control of Congress.",
    "The Senate is now evenly split but controlled by Democrats thanks to Vice President Kamala Harris’ tie-breaking vote.",
    "Democrats impeached Mr. Trump a second time after the Jan. 6, 2021, riot at the Capitol, which they said he incited.",
    "Mr. Jordan said the illegal immigration surge is “one of the issues” that makes Mr. Biden a target for impeachment.",
    "Republicans would be turning the tables on Democrats if they launch impeachment proceedings against Mr. Biden.",
    "In both impeachment trials, the Senate failed to garner the two-thirds majority needed to convict Mr. Trump.",
    "Republicans need a net gain of five seats to take majority control of the House.",
    "Senate Republicans may also gain enough seats to reclaim the majority.",
    "The Democratic-controlled House twice impeached President Trump.",
    "Ten Republicans also voted to impeach Mr. Trump in 2021.",
    "Mr. Jordan’s committee would lead an impeachment trial.",
    "Democrats control the House now by a slim majority.",
    "“The conference has to decide,” Mr. Jordan said.",
    "“Just look at the border,” Mr. Jordan said."
  ]
}