{
  "id": 2659,
  "mediaId": 2689,
  "date": "2022-03-29",
  "headline": "FBI Made Mistakes Across Hundreds Of Cases, But Here’s What Republicans Have Found Out…",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/fbi-made-mistakes-across-hundreds-of-cases-but-heres-what-republicans-have-found-out-473917/",
  "mediaOutlet": "teaparty.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    1911,
    1934,
    2640,
    2780,
    4063,
    370,
    878
  ],
  "sentences": [
    "The FBI made a statement to Fox News, saying, “The FBI takes compliance very seriously, especially when it comes to sensitive investigative matters, which is why, in 2019, we conducted an internal audit of those matters.”\n“While the number of deviations from FBI approval, notification and administrative requirements noted in the report is unacceptable, we began implementing important changes in training and raising awareness even prior to issuance of the report, and we remain committed to ensuring all personnel adhere to our internal investigative and operational guidelines,” it said.",
    "“And oh, by the way,” the congressman said, “I didn’t even mention that just a few months ago we had a whistleblower come forward, and he had talked about an email he received from the FBI, went out to FBI agents across the country, that said, ‘Put this threat tag designation, put this label on moms and dads,’ this whole domestic terrorism concern that Merrick Garland said wasn’t happening but sure looks like it is.",
    "Now, House Republicans are seeking answers after an FBI audit found 747 compliance errors in cases that involved political groups, religious organizations and others in the bureau’s “sensitive” category over an 18-month timespan during President Trump’s term.",
    "“The Judiciary Committee will have oversight in the next session of Congress.”\nBiggs and fellow Republican Reps. Jim Jordan of Ohio and Mike Johnson of Louisiana have written a letter to FBI Director Christopher Wray for an unredacted copy of the audit.",
    "“However, this internal review — which you never disclosed and which shows fundamental errors with FBI investigations touching on sensitive political and constitutional matters — calls into question the reliability of your statements.",
    "Errors found in the audit include failure to obtain approval from senior agency officials to start an investigation, failure to document a necessary legal review, and failure to tell prosecutors about the investigation.",
    "“This internal audit and the staggering number of errors it found suggest a pattern of misconduct and mismanagement within the FBI in failing to uphold internal rules for its most sensitive cases,” the letter said.",
    "The Committee must examine whether the FBI is taking seriously its compliance with its own rules intended to protect American civil liberties,” the letter said.",
    "So this is the same agency.”\n“When you put all this together, this is why we are concerned, and we want to see that audit in its unredacted form,” Jordan said.",
    "“This is the Federal Bureau of Investigation, part of the Justice Department, not following their own rules,” Jordan said in a recent interview on Fox News.",
    "“When they open investigations without authorization, to me, that’s about as radical as it gets,” Cato Institute senior fellow Patrick Eddington said.",
    "I suspect this conduct goes back for multiple administrations and has been an ongoing problem affecting members of both parties,” he said.",
    "The other cases involved religious organizations or key members, domestic political organizations and individuals, and the media.",
    "The letter noted that Wray had assured Congress last year the FBI had strict limits on what it would or would not investigate.",
    "“It possibly includes information about the surveillance of candidate Trump and later President Trump.",
    "No names were given in the audit report, but 191 of the 353 cases involved domestic public officials.",
    "Republican Rep. Andy Biggs of Arizona said the American people need to know what the FBI did wrong.",
    "According to The Washington Times, the time period covered from Jan. 1, 2018, to June 30, 2019.",
    "(TeaParty.org Exclusive) – The FBI has long been used as an arm of the radical left.",
    "But this is almost 750 compliance problems in 350 cases,” Biggs told Fox News.",
    "“The next step is to call on the committee to have a hearing on this.",
    "If I was in the majority, I would want to get to the bottom of this.",
    "Ten of the cases involved political candidates, the Times reported.",
    "We’ve got to get to the bottom of it,” Biggs said.",
    "The FBI has been compromised for years.",
    "This should surprise no one.",
    "It’s an important issue.",
    "“We can’t let this go.",
    "Copyright 2022.",
    "TeaParty.org"
  ]
}