{
  "id": 2662,
  "mediaId": 2694,
  "date": "2022-03-30",
  "headline": "A Glimpse Into a Fearful, Angry, Imaginary World",
  "image": "https://cdn.theatlantic.com/thumbor/yYy_GLK7JEIEyWv04QgiwmOosdo=/0x83:2000x1125/1200x625/media/img/mt/2022/03/Atl_gini_v1/original.png",
  "link": "https://www.theatlantic.com/ideas/archive/2022/03/ginni-thomas-mark-meadows-republican-religion/629415/?utm_source=feed",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Wehner",
  "authorUrl": "https://www.theatlantic.com/author/peter-wehner/",
  "termIds": [
    1886,
    2201,
    2378,
    2854,
    3975,
    4293,
    4462,
    229,
    996,
    5371
  ],
  "sentences": [
    "Striking the right balance in this inflamed political era—combining a fierce resolve to defend what is true and honorable with civic grace and a measure of charity; confronting those who spread lies that inflict deep wounds on our republic without adopting their “no rules in war” tactics; seeing the damage that fanatics are doing without dehumanizing them; believing that people can hold misguided and even harmful ideas without being irredeemable—isn’t easy.",
    "And she believed that Joe Biden and the left were “attempting the greatest Heist of our History.”\nThe text exchanges revealed Thomas’s belief that America was “at the precipice” and faced an “existential threat”—and that a Trump victory was the only thing that would “save us from the left taking America down.” In January, Thomas was more desperate still: “We are living through what feels like the end of America,” she wrote to Meadows.",
    "What these texts reveal isn’t the White House chief of staff telling Thomas, politely or not, that she’s spreading crazed conspiracy theories and needs to accept that Trump lost the election fair and square; his responses suggest that he either buys into those conspiracy theories or is willing to play along.",
    "Although not a dominant figure on the American right, she has for decades now been well known—and, as these texts show, she was a highly influential figure during the Trump era, with a direct line to the White House chief of staff, one of the most important individuals in American government.",
    "And it’s not simply that Meadows and Thomas share an affinity for freakish conspiracy theories; it is that they believe we’re engaged in a war without rules—that anything goes because Trump’s victory was stolen and he was all that stood between America and its destruction.",
    "President Donald Trump’s chief of staff, Mark Meadows, and the right-wing political activist Virginia “Ginni” Thomas, the wife of Supreme Court Justice Clarence Thomas, texted each other at least 29 times in the aftermath of the 2020 presidential election.",
    "Thomas thought that the attorney Sidney Powell—who at a December press conference blamed Cuba, Venezuela, the Clinton Foundation, George Soros, and antifa for making Trump votes disappear—should be “the lead and the face” of Trump’s legal challenge.",
    "The texts, which were first reported by The Washington Post’s Bob Woodward and CBS’s Robert Costa, were among the 2,320 that Meadows provided to the House Select Committee investigating the January 6 attack on the Capitol by insurrectionists.",
    "“I think I am done with politics, and I don’t think I am alone, Mark.” Meadows replied three minutes later: “I don’t know what you mean by caving to the elites,” to which Thomas responded, “I can’t see Americans swallowing the obvious fraud.",
    "For example, she was intrigued by the idea that Trump and others in his orbit might have set up an elaborate sting operation in which millions of secretly watermarked ballots would catch Democrats in the act of stealing the election.",
    "As for Meadows, he frames it as “a fight of good versus evil.” And then he invokes Jesus (“the King of Kings”) not just to ratify his political ideology, which is bad enough, but to advance a lie in order to overturn an election.",
    "They aren’t necessarily at the same points on the continuum as Thomas and Meadows; they may not buy into the watermarked-ballots story or view Sidney Powell as a great legal mind, but they do believe that the election was stolen.",
    "PSYOP.”\nThe communications between Meadows and Thomas disclosed her anger that so few Republicans were rallying behind Trump in the way that Representatives Louie Gohmert, Jim Jordan, Paul Gosar, and Chip Roy were.",
    "We were witnessing “the end of Liberty.”\nWe learned from the texts that Thomas agreed that “the most important thing you can realize right now is that there are no rules in war.” And: “This war is psychological.",
    "Thomas believed that the “Biden crime family & ballot fraud co-conspirators” were being arrested and detained for ballot fraud before being shipped to Guantánamo Bay for military tribunals.",
    "In the case of Ginni Thomas and Mark Meadows, we are able to glimpse a fearful, angry, imaginary world that a significant part of our country, including America’s 45th president, inhabits.",
    "The first was sent on November 5, 2020; the last on January 10, 2021, four days after the “Stop the Steal” rally, which Thomas said she attended, and the violent assault on the Capitol.",
    "The fact that the chief of staff and the president were on the same page as an activist with rabid political views was a distinct and distinctly terrifying feature of the Trump years.",
    "And what becomes really dangerous is when people with power—of whatever party or ideology—don’t just enter a hall of mirrors but try to force the rest of us to follow them there.",
    "We must distinguish between those who can’t be reached by reality and those whose partisan passions are inflamed but who can—over time, if dealt with in the right way—be reached.",
    "We need to learn from social psychologists such as NYU’s Jonathan Haidt and Columbia University’s Peter Coleman, the author of The Way Out: How to Overcome Toxic Polarization.",
    "The incandescent words of Martin Luther King Jr. are worth holding close to our hearts: “I’ve seen too much hate to want to hate, myself … Hate is too great a burden to bear.”",
    "That would be worrisome enough, but what makes it doubly so is the arguments invoked, the sources cited, and the mindset revealed in these raw, unfiltered texts.",
    "Reality is always interpreted, at least in part, through the prism of our own lives, our own experiences, the communities we have been and are now a part of.",
    "!” Thomas also expressed concern that the Trump team might “cave to the elites” and that millions, including herself, might simply walk away from politics.",
    "Thankfully, there’s a rich and growing body of work on the cognitive reasons people adopt rigid ideologies and on how to overcome virulent polarization.",
    "But reality is also independent of subjective human experiences, and when people superimpose an imaginary world on the real world, bad things happen.",
    "Just going with one more thing with no frickin consequences ... the whole coup and now this ... we just cave to people wanting Biden to be anointed?",
    "(Committee members and aides told Woodward and Costa that they believe the messages may be just a portion of the pair’s total exchanges.)",
    "To assume that the majority of Republicans hold all the same views that Thomas and Meadows expressed in their texts would be a mistake.",
    "There have always been people with bizarre ideas at the fringes of politics, but Ginni Thomas is hardly relegated to the fringes.",
    "As a result, fanatics took power, and as the events since November 3, 2020, have shown, they don’t give it up without violence.",
    "Plenty of people on the right, although not as radical as Thomas and Meadows, share their basic attitudes, at least for now.",
    "And although one person acting alone might not make much of a difference, a lot of people acting together create a culture.",
    "Thomas in particular wasn’t just skeptical about the election results but fully marinated in QAnon conspiracy theories.",
    "It’s difficult to sustain a democracy when there aren’t shared truths, when false perceptions become false gods.",
    "Over the past decade, too many people who knew better didn’t speak up and too many institutions didn’t step up.",
    "It’s a complicated question, of course, but for now let me suggest that part of the answer is disaggregation.",
    "They disdain Republicans who don’t share their fervor, especially those who have spoken critically of Trump.",
    "They see themselves, too, as God’s instruments—his foot soldiers—in this great political-spiritual battle.",
    "This approach won’t work with everyone, but it will probably work with more people than you might imagine.",
    "But it is urgent that we try, because we can’t keep going down the road of indiscriminate mutual contempt.",
    "“It takes time for the army who is gathering for his back.”\nWe witness, too, her contempt for Mike Pence.",
    "There are things we can do, including, on an individual level, listening well and berating others less.",
    "“Polarization creates a substrate that’s favorable to propaganda,” the author Jonathan Rauch told me.",
    "“Most of us are disgusted with the VP and are in listening mode to see where to fight with our teams.",
    "Many of us can’t continue the GOP charade.” Meadows later told her, “You’re preaching to the choir.",
    "Very demoralizing.”\nWe learned that Mark Meadows believed, “This is a fight of good versus evil.",
    "Those who attacked the Capitol are not representative of our great teams of patriots for DJT!",
    "And a world that has largely influenced and defined the American right during the Trump era.",
    "They view the Democratic Party as an existential threat, and regard Democrats with contempt.",
    "So in light of this, how do we repair the breach and achieve some measure of social peace?",
    "Their purpose was not to lament the result; it was to encourage efforts to overturn it.",
    "This plus a conversation with my best friend just now … I will try to keep holding on.",
    "Meadows and Thomas are aligned, allies in the same cause, speaking the same language.",
    "One senses from both Thomas and Meadows not just fear of the left, but hatred for it.",
    "They have to be resisted by individuals who speak out and institutions that step up.",
    "It is one reason our political culture is so damaged, why dialogue is often so hard.",
    "It has been said that we do not see things as they are; we see them as we are.",
    "Ginni Thomas’s texts offer a window into a dark and conspiratorial mindset.",
    "All of us do this to some degree; it is part of what it means to be human.",
    "Well at least my time in DC on it.” To which Thomas replied, “Thank you!!",
    "It was, by any measure, an extraordinary and unsettling set of exchanges.",
    "The former need to be defeated; the harm they do needs to be contained.",
    "Evil always looks like the victor until the King of Kings triumphs.",
    "They are a window into a very distorted, very disturbed world.",
    "Twenty-one of the texts were sent by Thomas, eight by Meadows.",
    "And they view our politics as a battle between good and evil.",
    "The latter need to be provided an on-ramp back to reality.",
    "So what did the texts between Thomas and Meadows disclose?",
    "America is worth it!”\nWhat are we to make of all this?",
    "I struggle with achieving that balance all the time.",
    "They fear that America is on the edge of the abyss.",
    "But they don’t have to for there to be a problem.",
    "“Do not concede,” Thomas told Meadows.",
    "Do not grow weary in well doing.",
    "I have staked my career on it.",
    "A world of true believers.",
    "The fight continues.",
    "Needed that!"
  ]
}