{
  "id": 2670,
  "mediaId": 2676,
  "date": "2022-03-29",
  "headline": "“Possible coverup”: Trump's Jan. 6 call logs have a mysterious 7-hour gap",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2020/11/donald-trump-phone-1119201.jpg",
  "link": "https://www.salon.com/2022/03/29/possible-coverup-jan-6-call-logs-have-a-mysterious-7-hour-gap/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    1896,
    2201,
    2378,
    2854,
    2906,
    3118,
    3500,
    3833,
    4654
  ],
  "sentences": [
    "The gap in Trump's records is \"25 times as big as the gap in the Nixon tapes that figured so largely [in] Watergate,\" wrote Rep. Don Beyer, D-Va. \"Trump made several calls that we already know about during this gap, as he watched the attack on the Capitol unfold without lifting a finger to stop it for several crucial hours.\"",
    "A federal judge overseeing a case related to the release of emails by Trump ally John Eastman, who wrote legal memos seeking to justify Trump's attempts to overturn the election, said on Monday that Trump had \"more likely than not\" committed federal crimes in his efforts to remain in office.",
    "White House phone logs turned over to House investigators show a mysterious gap in then-President's Donald Trump's calls of nearly eight hours on Jan. 6, 2021, including during the invasion of the Capitol, according to documents obtained by The Washington Post and CBS News.",
    "The committee this week voted to hold Scavino and fellow former Trump adviser Peter Navarro in contempt and demanded that the Justice Department act on its contempt referral against Meadows, who has not been charged even though he was referred for prosecution in December.",
    "Sen. Mike Lee of Utah, said last year that Trump had called him during the Senate session to certify President Joe Biden's electoral victory, apparently believing he was calling Sen. Tommy Tuberville of Alabama, who objected to the certification of electoral results.",
    "Call logs turned over by the National Archives to the House committee investigating the Capitol riot show no calls placed to or by Trump for seven hours and 37 minutes, between 11:17 am and 6:54 pm, according to the joint report from Robert Costa and Bob Woodward.",
    "Sources familiar with the discussions told the outlets that Bannon urged Trump to continue to pressure then-Vice President Mike Pence to block the certification of Biden's victory at a breakfast meeting ahead of the congressional session.",
    "Trump supporters overwhelmed police at the Capitol at around 1:30 p.m. that day, and then stormed through the halls of Congress, hunting lawmakers and committing acts of vandalism, until police cleared the Capitol around 6 p.m.",
    "The gap in the records, which were turned over by the archives earlier this year after Trump failed to block the release, means that investigators have no record of Trump's phone conversations during the Capitol attack itself.",
    "The Jan. 6 committee said in a court filing earlier this month that it has \"a good-faith basis for concluding that the President and members of his Campaign engaged in a criminal conspiracy to defraud the United States.\"",
    "Trump repeatedly fought in court to block the National Archives from turning the records over to the committee but his bid was rejected by the Supreme Court, with only Justice Clarence Thomas dissenting.",
    "The gap drew comparisons to former President Richard Nixon's 18.5-minute gap in White House recordings amid the Watergate break-in, and not just because Bob Woodward was involved in reporting both.",
    "Existing phone records show that Trump twice spoke with former White House strategist Steve Bannon, who said a day before the riot on his podcast that \"all hell is going to break loose tomorrow.\"",
    "The House committee is investigating whether Trump used intermediaries, phones belonging to his aides or disposable \"burner\" phones to communicate throughout the day, according to the report.",
    "Bannon, who met with Trump's allies at the Willard Hotel on Jan. 5, was indicted last year by a grand jury for contempt of Congress after refusing to cooperate with the House investigation.",
    "\"Without enforcement of congressional subpoenas, there is no oversight, and without oversight, no accountability — for the former president, or any other president, past, present or future.",
    "The call logs also show that Trump on Jan. 6 spoke with his election lawyers, former Georgia Sen. David Perdue, conservative commentator William Bennett and Fox News host Sean Hannity.",
    "He also had a lengthy with former senior adviser Stephen Miller, who had publicly pushed a plot to throw the election to \"alternate slates of electors\" who would then elect Trump.",
    "Minutes after his call with Bannon, Trump spoke with attorney Rudy Giuliani, who was leading his post-election legal challenges, and then-White House chief of Staff Mark Meadows.",
    "The archives has also suggested that Trump may have violated federal laws by improperly taking White House records to his home in Mar-a-Lago, including classified materials.",
    "The Post and CBS News last week published text messages showing that Ginni Thomas, the justice's wife, had urged Meadows to fight what she described as a stolen election.",
    "A Trump spokeswoman told the outlets that Trump had nothing to do with the phone records and had assumed \"any and all of his phone calls were records and preserved.\"",
    "On the morning of Jan. 6 Trump also spoke with Rep. Jim Jordan, R-Ohio, a key figure in pushing House Republicans to object to the certification of Biden's victory.",
    "The Jan. 6 committee's work has been hamstrung by resistance from Trump allies, many of whom have refused to turn over records or cooperate with investigators.",
    "\"The Department of Justice has a duty to act on this referral and others that we have sent,\" Rep. Adam Schiff, D-Calif., a member of the panel, told Politico.",
    "Trump's lengthy gap, tweeted former Harvard law professor Laurence Tribe, \"makes the infamous 18-minute gap in Nixon's tapes look like nothing in comparison.\"",
    "Another person close to the committee told the outlets that there is \"intense interest\" among members to get to the bottom of the gap in the records.",
    "The 11 pages of records obtained by the committee show that Trump spoke with at least eight people in the morning and 11 people later that evening.",
    "Trump claimed in a statement on Monday that \"I have no idea what a burner phone is, to the best of my knowledge I have never even heard the term.\"",
    "At 11:17 a.m., the last listing in the log before the gap, the White House diary says that Trump spoke on the phone with an \"unidentified person.\"",
    "The next entry after Trump returned from the rally was at around 4 p.m., when Trump filmed a Rose Garden video urging his supporters to \"go home.\"",
    "Trump later made calls to Senate Republican Leader Mitch McConnell and Sen. Josh Hawley, R-Mo., though it's unclear whether he reached either.",
    "Fellow member Rep. Zoe Lofgren, D-Calif., added that the committee was doing its job, and now \"the Department of Justice needs to do theirs.\"",
    "Trump responded that Pence was not scheduled to come to the White House after a \"heated meeting\" the previous night, according to the report.",
    "Pence told Trump just before the rally that preceded the Capitol that he intended to \"do my job\" and certify the election results.",
    "House Minority Leader Kevin McCarthy, also said he spoke with Trump during the attack and urged him to accept his election loss.",
    "The White House diary has limited information on Trump's actions during the day, after his trip to the rally at the Ellipse.",
    "In the evening of Jan. 6, after the rioters had been dispersed, Hawley led objections to the electoral votes in the Senate.",
    "That was to former aide Dan Scavino, who is now facing contempt charges for refusing to cooperate with the investigation.",
    "Trump then called Pence minutes after his call with Meadows and left a message with his office, according to the report.",
    "The National Archives previously said that some White House records had been torn up and had to be taped back together.",
    "Trump later spoke with White House counsel Pat Cipollone, press secretary Kayleigh McEnany and adviser Jason Miller.",
    "A growing number of Democrats have called on Thomas to recuse himself from any further election-related cases.",
    "But Trump had another call with Pence that was not included in the call log, according to the report.",
    "If you don't do it, I picked the wrong man four years ago,\" Trump insisted, according to the report.",
    "Without enforcement of its lawful process, Congress ceases to be a co-equal branch of government.\"",
    "One lawmaker told the Post and CBS News that the panel is investigating a \"possible coverup.\"",
    "But the logs do not include publicly reported calls that Trump had with Republican lawmakers.",
    "At 6:54 p.m., Trump made his first recorded phone call in more than seven hours.",
    "He later called attorneys who were helping him contest his election loss.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "A Trump spokesman called the ruling \"absurd and baseless.\"",
    "Subscribe to our morning newsletter, Crash Course.",
    "The length of that call is not specified.",
    "Read more on the Jan. 6 investigation:",
    "I'm counting on you to do it.",
    "\"You're going to wimp out!\"",
    "\"Mike you can do this."
  ]
}