{
  "id": 2716,
  "mediaId": 2589,
  "date": "2022-03-24",
  "headline": "Ginni Thomas asked Mark Meadows to 'release the kraken'",
  "image": "https://media.townhall.com/townhall/reu/o/2020/303/8c134878-0ee4-4926-8406-5963666f450e-1110x740.jpg",
  "link": "https://hotair.com/john-s-2/2022/03/24/ginni-thomas-asked-mark-meadows-to-release-the-kraken-n457889",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Sexton",
  "authorUrl": "https://hotair.com/author/john-s-2",
  "termIds": [
    0
  ],
  "sentences": [
    "“Van Jones spins interestingly, but shows us the balls being juggled too,” Thomas said, referring to the prominent CNN commentator…\nShe wrote, “House and Senate guys are pathetic too… only 4 GOP House members seen out in street rallies with grassroots… Gohmert, Jordan, Gosar, and Roy.” She appeared to be referring to Republican House members Louie Gohmert of Texas, Jim Jordan of Ohio, Paul A. Gosar of Arizona and Chip Roy of Texas.",
    "The NY Times has a bit more, including the kraken quote:\nIn one message sent in the days after the election, she urged the chief of staff, Mark Meadows, to “release the Kraken and save us from the left taking America down,” invoking a slogan popular on the right that refers to a web of conspiracy theories that Trump supporters believed would overturn the election.",
    "Thomas sent 29 text messages to then Chief of Staff Mark Meadows asking him to stand up against “the greatest Heist of our History.”\nOn Nov. 10, after news organizations had projected Joe Biden the winner based on state vote totals, Thomas wrote to Meadows: “Help This Great President stand firm, Mark!!",
    "“It is likewise a ‘well recognized principle that political statements are inherently prone to exaggeration and hyperbole.’”\nReasonable people may have understood it but it appears that Ginni Thomas didn’t see it that way.",
    "The majority knows Biden and the Left is attempting the greatest Heist of our History.”\nWhen Meadows wrote to Thomas on Nov. 24, the White House chief of staff invoked God to describe the effort to overturn the election.",
    "The report says none of the tweets “directly reference Justice Thomas or the Supreme Court” but the way the story is written they clearly want to raise the question of whether the best friend could have been Thomas.",
    "“Sidney Powell & improved coordination now will help the cavalry come and Fraud exposed and America saved.”\nObviously the kraken didn’t do much damage to anyone except maybe some of the lawyers who promoted it.",
    "“Reasonable people understand that the ‘language of the political arena, like the language used in labor disputes … is often vituperative, abusive and inexact,’” her motion to dismiss argues.",
    "The Washington Post has a story by Bob Woodward and Robert Costa about text messages sent after the 2020 election by Virginia Thomas, wife of Supreme Court Justice Clarence Thomas.",
    "In defending herself against a lawsuit even Sidney Powell admitted this was political hyperbole:\nIn her motion to dismiss, Powell does not argue that the statements were true.",
    "Many of us can’t continue the GOP charade.”…\nThe text traffic also suggests that Ms. Thomas was in contact with Jared Kushner, the former president’s son-in-law and adviser.",
    "This story is making a big splash but so far there’s no evidence this was part of some deep state plot connecting Trump to the Supreme Court.",
    "Keep in mind the standard the left has set for family members wielding influence because of their closeness to politically powerful people.",
    "But we spent a year where liberal media said Hunter Biden was irrelevant…well, if family is irrelevant, then they are irrelevant.",
    "Later in the Post story we learn that some of the 29 messages were just commentary on whatever was running on the news networks.",
    "Just going with one more thing with no frickin consequences.” She added: “We just cave to people wanting Biden to be anointed?",
    "!…You are the leader, with him, who is standing for America’s constitutional governance at the precipice.",
    "America is worth it!”…\nThe Post says it doesn’t know who the best friend mentioned in the text was.",
    "She wrote to Mr. Meadows: “Just forwarded to yr gmail an email I sent Jared this am,” she wrote.",
    "She claims they are not actionable because they are protected statements of political opinion.",
    "Later that night, Ginni Thomas messaged Meadows seeming to react to a cable news segment.",
    "This plus a conversation with my best friend just now… I will try to keep holding on.",
    "In another, she wrote: “I can’t see Americans swallowing the obvious fraud.",
    "“Evil always looks like the victor until the King of Kings triumphs.",
    "Well at least my time in DC on it.”\nThomas replied: “Thank you!!",
    "If she committed a crime, she should be held to account.",
    "“This is a fight of good versus evil,” Meadows wrote.",
    "— Pradheep J. Shanker (@Neoavatara) March 25, 2022",
    "Is there any crime here or the suggestion of one?",
    "If they are relevant…then they are relevant.",
    "Do not grow weary in well doing.",
    "I have staked my career on it.",
    "Doesn't sound like it here.",
    "The fight continues.",
    "Needed that!"
  ]
}