{
  "id": 2717,
  "mediaId": 2637,
  "date": "2022-03-29",
  "headline": "Where was Donald Trump for seven hours during the Jan. 6 Capitol riot?",
  "image": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2021/02/us-capitol-protest-jan-6.jpg",
  "link": "https://nationalpost.com/news/where-was-donald-trump-for-seven-hours-during-the-jan-6-captol-riot",
  "mediaOutlet": "news.nationalpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Billy House",
  "authorUrl": "",
  "termIds": [
    1670,
    2201,
    2906,
    3267,
    3731,
    4043,
    4109
  ],
  "sentences": [
    "“We need to know, as we have said consistently, what was happening in that period of time.”\nThe select committee is focusing on whether Trump or any of his aides and advisers had a role in efforts to overturn the results of the 2020 presidential election or organizing the events that preceded the storming of the Capitol by Trump supporters as Congress was certifying the Electoral College results.",
    "Article content\nHouse GOP leader Kevin McCarthy told CBS News on the day of the riot that he had spoken with Trump and asked him “to talk to the nation and tell them to stop this.”\nRepresentative Jim Jordan, one of Trump’s highest-profile congressional allies, also has publicly acknowledged talking on the phone with the former president the day rioters stormed the Capitol building.",
    "Article content\n(Bloomberg) — The House committee investigating last year’s insurrection at the Capitol has uncovered a more than seven-hour gap in White House telephone logs of former President Donald Trump calls during the riot — a period when lawmakers were urgently trying to get him to quell the mob.",
    "Committee Chair Bennie Thompson and other committee members have characterized Trump’s records as key to the panel’s investigation, and the former president has sought to block access to documents and attempted to assert executive privilege to prevent some former advisers from testifying to the panel.",
    "But evidence presented during Trump’s second impeachment trial on charges of stoking the riot, public statements from officials and published reports detail Trump’s conversations with members of Congress as the Capitol was stormed and lawmakers and Vice President Mike Pence were being evacuated.",
    "Article content\nThere are “quite a few gaps” in the logs provided to the committee by the National Archives, Democratic Representative Pete Aguilar, a member of the panel said Tuesday, confirming the contours of a report from the Washington Post and CBS News.",
    "Article content\nThe White House telephone logs show no calls placed by or to Trump from 11:17 a.m. to 6:54 p.m., the Washington Post and CBS News reported, citing documents they obtained.",
    "The committee also has reported that it has testimony that Ivanka Trump was present in the Oval Office the morning of Jan. 6 when her father had a phone conversation with Pence.",
    "Aguilar said he wouldn’t speculate about what Trump was doing at the time or why there was no record of any calls he might have made in official White House logs.",
    "Aguilar noted that McCarthy’s call “doesn’t show up on those logs.”\nMcCarthy and Jordan have declined requests from the committee to sit for interviews.",
    "In addition, the House committee has text messages that lawmakers and others exchanged with then-White House Chief of Staff Mark Meadows.",
    "Among the questions being pursued by the committee is whether Trump used aides’ phones or a disposable “burner” phone for calls.",
    "The logs, which were turned over to the Jan. 6 committee earlier this year, do show calls before and after that period.",
    "“Clearly, there’s a lot that’s missing that deserves the truth.”\n©2022 Bloomberg L.P.\nBloomberg.com",
    "The panel is negotiating conducting an interview with Ivanka Trump.",
    "Jordan has not said precisely when that call, or calls, occurred.",
    "“But we know he was communicating, right?” Aguilar said."
  ]
}