{
  "id": 2731,
  "mediaId": 2526,
  "date": "2022-03-23",
  "headline": "House Republican Leadership Announces Taskforce Leaders to Fix Biden’s Failures",
  "image": "https://media.breitbart.com/media/2021/05/Elise-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/23/house-republican-leadership-announces-taskforce-leaders-to-fix-bidens-failures/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    2159,
    2689,
    3267,
    3746,
    3797,
    3975,
    305,
    878,
    1163,
    5371
  ],
  "sentences": [
    "“Can we afford their foreign policy,” the Republican leader added before turning it over to Scalise, who noted that Americans everywhere are “talking about the same things” — angry about high prices and the far-left policies that “got us to this point.”\nIt was Biden who said, “no new pipelines, no new drilling for oil and gas in America,” Scalise said, adding that is comes as no surprise that a year and a half later, prices skyrocketed “well over 50 percent.” That is why Republicans are creating these task forces to solve these problems — fixing gas increases, securing the border, addressing inflation, and allowing parents to have a role in their children’s education.",
    "She added that Republicans plan to fire “lame duck” House Speaker Nancy Pelosi (D-NY) “once and for all.”\nThe Task Force Leaders of each topic are as follows:\nJobs and the Economy: Rep. Patrick McHenry (R-NC)\nBig Tech Censorship and Data: Rep. Cathy Rodgers (WA)\nFuture of American Freedoms: Rep. Jim Jordan (R-OH)\nEnergy, Climate and Conservation: Rep. Garret Graves (R-LA)\nAmerican Security: Rep. John Katko (R-NY)\nHealthy Futures: Rep. Brett Guthrie (R-KY) and Rep. Vern Buchanan (R-FL)\nChina Accountability: Rep. Michael McCaul (R-TX)\nDuring the press conference, each Republican member provided a brief preview of the agenda items of their task force .",
    "PONTE VEDRA, Florida — House Republican leaders, including Leader Kevin McCarthy (R-CA), Whip Steve Scalise (R-LA), and Conference Chairwoman Elise Stefanik (R-NY) ) on Wednesday announced the House Republican Taskforce Leaders who will focus on key issues leading up to the midterm elections, as they hope to retake the majority in the lower chamber and address President Biden’s failures.",
    "Rep. Jordan of the “Future of American Freedoms” task force vowed that a Judiciary Committee led by Republicans will focus on defending and respecting the Bill of Rights, the Constitution, and America’s liberties.",
    "The GOP is here, McCarthy said, to listen to the America public and find solutions to problems “that Democrats created.” That includes one of the central concerns ignored by Democrats — rising gas prices.",
    "Republicans also vowed to lay out a plan to address China’s threats, secure the border, fix the drug problem, and stop Washington DC’s one size fits all, “government knows best” approach to healthcare.",
    "Rep. Graves of the “Energy, Climate and Conservation” task force noted that Biden has focused on the best interest of “other countries” on energy, deeming him a “complete failure” in this realm.",
    "Rep. Rodgers of the “Big Tech Censorship and Data” task force, for example, called Big Tech a “destructive force” and used the censorship of Hunter Biden’s “Laptop From Hell” as an example.",
    "But first, Republican leaders detailed the dire reality of the Biden administration’s failed agenda, pointing directly to skyrocketing gas prices, inflation, and an insecure border.",
    "Republicans, who are gearing up for the midterms, are creating task forces to focus on a variety of issues, including the economy, American security, and China accountability.",
    "Rep. Stefanik added that the “stakes could not be higher” for Americans, who are facing the worst inflation crisis in 40 years and paying the highest gas prices in history.",
    "McCarthy noted that Americans will end up paying thousands more due to Biden’s failed policies with the continually rising prices of homes and consumer goods.",
    "“Can we afford their policies when it comes to the border?” he continued, mentioning fentanyl pouring across the border.",
    "What will Biden do when they are in the majority and they send these solutions to his desk, Scalise pondered.",
    "He cited the spike in greenhouse gas emissions as well as the abandonment of America energy independence.",
    "The bottom line is this, McCarthy said: Can America afford Democrat policies any longer?",
    "And those are not the only things rising, he said.",
    "Crime is also rising due to Democrat policies."
  ]
}