{
  "id": 274,
  "mediaId": 2532,
  "date": "2022-04-21",
  "headline": "Fauci fears judge's ruling on travel mask mandate may set \"dangerous precedent\"",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/04/21/66e18f2e-0e02-46b5-b56f-55d8a26a3ae4/thumbnail/1200x630/a834f30f26c71e2b7d56d6f09eaccace/fauci.jpg",
  "link": "https://www.cbsnews.com/news/anthony-fauci-covid-mask-mandate-judge/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexander Tin",
  "authorUrl": "",
  "termIds": [
    1877,
    2378,
    2576,
    3975,
    107,
    200,
    4977
  ],
  "sentences": [
    "appeals mask ruling after CDC says mandate still needed\n As mask mandate is struck down, immunocompromised people contemplate travel plans\n Shanghai allows 4 million people to leave their homes as virus rules ease\n More\nIn:\nCOVID-19\nMask Guidelines\n Alexander Tin\nCBS News reporter covering public health and the pandemic.",
    "The decision by a federal judge in Florida to block the Biden administration's mask requirement on planes and public transit was \"disturbing,\" Dr. Anthony Fauci told CBS News on Thursday, saying that the Biden administration worried it would set a \"dangerous precedent.\"",
    "Asked about President Biden recently saying that masking while flying was \"up to them,\" White House principal deputy press secretary Karine Jean-Pierre told reporters on Thursday that the president backed the CDC's guidance.",
    "Citing data from abroad and the Northeast, which has seen the most BA.2 cases so far, Fauci said the variant did not \"appear to be associated with an increase in hospitalizations and severe disease.\"",
    "Far more than a judge with no experience in public health,\" Fauci, the president's chief medical adviser, told CBS News chief election and campaign correspondent Robert Costa on \"Red & Blue.\"",
    "The Biden administration moved Wednesday to appeal the decision, which came as the agency has been closely tracking an uptick in COVID-19 cases driven by the BA.2 subvariant of Omicron.",
    "Fauci also reflected on his at-times \"uncomfortable\" work under Biden's predecessor, recalling \"tough times\" when he had to publicly disagree with President Trump and his top officials.",
    "Coronavirus Crisis\n More\n Fauci fears judge's mask ruling could set \"dangerous precedent\"\n Airlines to allow certain passengers banned for violating mask policy to return\n Justice Dept.",
    "Anna Moneymaker/Getty Images\nBut Fauci also acknowledged that Americans would \"have to make their own individual choice\" around the risks of skipping masks while traveling.",
    "\"There are going to be plenty of people who are 25 years old, healthy, and say, 'no, as far as I'm concerned, I don't like the discomfort of a mask,'\" said Fauci.",
    "\"On a day-by-day basis\"\nFauci told Costa he was unsure if he would remain in his post for a \"long time,\" saying that he was taking \"things on a day-by-day basis.\"",
    "Fauci rejected the broadsides as \"the most ridiculous thing,\" later lamenting how political divisiveness had hampered the country's pandemic response.",
    "He and President Biden still have a \"very, very good relationship,\" Fauci said, one that existed \"long before he was president of the United States.\"",
    "\"The CDC has the capability, through a large number of trained epidemiologists, scientists, to be able to make projections and make recommendations.",
    "Fauci said he had urged the president to follow the CDC's recommendations, and for now the agency has continued to urge all travelers to wear masks.",
    "We may be closer to that now,\" said Fauci, who also serves as the long-time head of the National Institutes of Allergy and Infectious Diseases.",
    "Following the court decision blocking the CDC's mask order in transportation, Ohio Republican Congressman Jim Jordan tweeted that \"Fauci lost.",
    "\"So as the CDC recommends, the president thinks you should mask right now, especially as they learn more about BA.2,\" said Jean-Pierre.",
    "Hospitalizations are also accelerating around the country, though far short of the record surge seen during the winter wave.",
    "More than 9 in 10 new infections in the current wave are from the BA.2 subvariant, the CDC estimated this week.",
    "Some Republicans on Capitol Hill have renewed their criticism of Fauci ahead of the looming midterm elections.",
    "North Carolina Republican Congressman Madison Cawthorn has repeatedly called for Fauci to be fired or jailed.",
    "I'm obviously 81 years old, at the point in my career where I'm going to have to sit down at some time.",
    "\"When you have a common enemy in the virus, you've got to all pull together, fight that common enemy.",
    "And the degree of profound divisiveness in the country has really hindered that,\" said Fauci.",
    "Dr. Anthony Fauci speaks at a press briefing at the White House on December 1, 2021.",
    "Whether or not that will result in an increase in hospitalizations, we don't know.",
    "Fauci said he personally planned to don a highly-protective N95 mask when flying.",
    "But I never said to myself, 'I want to walk away from it,'\" added Fauci.",
    "\"It's obvious to everyone we're seeing that infections are on the rise.",
    "But I would want it to be when we get this under better control.",
    "\"I've always said we've got to get this thing under control.",
    "And we may be coming to that point right now.",
    "I am very respectful of the presidency.",
    "I do not like having to do that.",
    "\"I did not like that.",
    "We hope not,\" Fauci.",
    "Freedom won.\""
  ]
}