{
  "id": 2759,
  "mediaId": 2572,
  "date": "2022-03-17",
  "headline": "Over 50 House Republicans back Banks' resolution opposing Iran nuclear deal amid Russia-Ukraine war",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Biden-Russian-Oil-Import-Ban-2.jpg",
  "link": "https://www.foxnews.com/politics/house-republicans-resolution-biden-iran-deal-russia",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    3475,
    3975,
    472,
    630,
    884,
    5041,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "(Vahid Reza Alaei/Iranian Defense Ministry, via AP, File)\nIRANIAN DISSIDENTS WARN THAT REMOVING IRGC'S TERROR DESIGNATION WILL LEAD TO ‘TERRORISM AND MAYHEM’\nEarlier this week, 49 Republican senators vowed that they will \"reverse\" an Iran deal that weakens sanctions or nuclear restrictions against the rogue state.",
    "The RSC resolution opposes \"engaging Russia as a main intermediary for reviving any nuclear agreement,\" \"giving Russia any sanctions exemption or waiver\" in a deal, and calls a nuclear deal not ratified by Congress \"illegitimate.\"",
    "Taken together, Republicans say, these efforts make clear that any Biden agreement with Iran will be rolled back by the next GOP president, and opposed firmly if Republicans take the congressional majority next year.",
    "But Biden administration negotiators now appear to be moving full-steam ahead toward a deal that may even remove Iran's Islamic Revolutionary Guards Corps (IRGC) from the Foreign Terrorist Organization (FTO) list.",
    "FIRST ON FOX: Dozens of House Republicans are backing a resolution disapproving of any new nuclear deal with Iran amid the Russia-Ukraine war and following a recent Iranian missile attack near a U.S. consulate.",
    "\"Just days ago, Iranian terrorists threatened to kill American citizens on U.S. soil and the Iranian government openly took credit for a missile attack near the US consulate in Iraq,\" Banks added.",
    "All that aside, the process in Vienna would be a deal-breaker for any normal administration,\" Republican Study Committee (RSC) Chairman Jim Banks, R-Ind., who is leading the resolution, said.",
    "Scott Applewhite)\nBIDEN ADMIN CONSIDERING REMOVING IRAN'S IRGC FROM TERROR LIST AS PART OF IRAN DEAL TALKS: SOURCES\nFifty-two House Republicans co-sponsor the resolution, including Banks.",
    "Among them are Reps. Dan Crenshaw, R-Texas, Don Bacon, R-Neb., Claudia Tenny, R-N.Y., and Kat Cammack, R-Fla. House Minority Whip Steve Scalise, R-La., also supports the resolution.",
    "There was a brief pause in the Russia-mediated U.S.-Iran talks after Russian President Vladimir Putin's military invaded U.S. ally Ukraine in a brutal war that's only escalating.",
    "One notable supporter of the resolution is former Secretary of State Mike Pompeo, who's widely considered a potential 2024 presidential candidate.",
    "(AP Photo/Andrew Harnik)\n\"President Trump and I threw out the JCPOA and brought Iran to heel through a successful maximum pressure campaign.",
    "\"I mean, if you look at the Iran — the missile strike that we saw over the weekend, no U.S. facilities were hit, no personnel were harmed.",
    "There are also 124 House GOP co-sponsors for the \"Maximum Pressure Act\" – which would effectively codify the Trump-era approach to Iran.",
    "Ambassador to the United Nations Nikki Haley's group Stand For America are also supporting the resolution, Fox News is told.",
    "\"Let’s be clear: Joe Biden isn’t just negotiating with terrorists, he’s sending terrorists billions in sanctions relief.\"",
    "The White House, meanwhile, downplayed the Iranian missile attack and said the administration is pushing toward a deal.",
    "We gave successive administrations a roadmap to ensure our allies’ security and bring stability to the Middle East.",
    "\"A renewed JCPOA would increase the risk of a nuclear Iran, enrich terrorists and destabilize the entire region.",
    "\"We continue to believe that, you know, obviously, a diplomatic path forward is the best path forward.\"",
    "Fox News' Adam Shaw, Brooke Singman, Chad Pergram and Rich Edson contributed to this report.",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "We were not the targets of that,\" White House press secretary Jen Psaki said this week.",
    "Former national security adviser Robert C. O’Brien, and former U.S.",
    "The Biden administration plans to throw it all away,\" Pompeo said.",
    "Rep. Joe Wilson, R-S.C., is the co-leader of the resolution.",
    "\"Any deal that enriches Iranian terrorists won’t last. \"",
    "Tyler Olson covers politics for Fox News Digital.",
    "(AP Photo/J."
  ]
}