{
  "id": 3001,
  "mediaId": 2578,
  "date": "2022-03-08",
  "headline": "EXCLUSIVE: Roger Stone Strikes Back at Washington Post Attack – Calls out Deep Fake Video",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/Roger-Stone-with-President-Trump.jpg",
  "link": "https://www.thegatewaypundit.com/2022/03/exclusive-roger-stone-strikes-back-washington-post-attack-calls-deep-fake-video/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/joehoft/",
  "termIds": [
    1872,
    1890,
    1924,
    2201,
    2292,
    2434,
    3467,
    4278,
    1068,
    5145
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe same Washington Post who insisted for two years that I was a Russian intelligence asset collaborating with WikiLeaks, who lied to us about Covid, lied to us about Ivermectin, lied to us about election fraud, lied to us about Trump colluding with the Russians, lied about the Clinton Campaign NOT spying on Trump are now trying, yet again, to tie me falsely to the illegal events of January 6 and convince you that I don’t love Donald Trump.",
    "In their efforts to smear me and renew investigators’ interest in my activities on January 6th the Washington Post attempts to connect me to Stewart Rhodes the founder of the Oath Keepers who I have never spoken to in my life but who may have been part of an online chat that included hundreds which has most certainly already been examined by the FBI and is benign, as well as Enrique Tarrio President of the Proud Boys who as we know was not present on January 6.",
    "The Washington Post dedicated four full pages to their latest assault on me which gives you some idea how apoplectic they still are that I, by the grace of God, avoided the clever and deadly snare set for me by Adam Schiff and Robert Mueller when President Trump had the strength and courage to grant me a full pardon thus saving me from dying in a Covid-19 infested prison.",
    "Just to be clear, I never took a penny from anyone for assistance in lobbying for a pardon even though doing so would have been perfectly legal and yes, I was disappointed that the President did not pardon Julian Assange who, contrary to what CIA Director Mike Pompeo says is NOT a Russian asset but a journalist who exposed the Deep State’s epic corruption.",
    "In fact, those misguided souls who stormed the Capitol destroyed a perfectly legal effort to secure a 10-day delay in the certification of Joe Biden’s election to allow time for a more thorough examination of the substantial irregularities in the results in Arizona, Michigan, Wisconsin, Nevada and elsewhere.",
    "Guest post by Roger Stone\nRoger Stone Strikes Back at Washington Post Attack – Calls out Deep Fake Video\nNever underestimate the Democrat/FakeNewsMedia cabal’s ability to re-cycle the same BS and pretend it’s “news” and then have the leftist maggots on Twitter insist it’s all fact.",
    "The efforts of the “Stop the Steal” movement eschewed violence or lawlessness and were neither a secret nor illegal although Washington Post strains to imply otherwise,\nSadly, I did foresee the Democrats’ attempt to criminalize any opposition to their theft of the 2020 election.",
    "Patriots who want to see Hillary forced to answer for her crimes can help finance this lawsuit at StoneDefensefund.com\nFor two years I was vilified, smeared, hunted, threatened, gagged, framed, bankrupted, lynched, censored, deplatformed and my wife’s health was destroyed.",
    "The most dangerous trend is the effort by the Democrats and their handmaidens in the media, like the Washington Post, to criminalize perfectly legal, constitutionally protected political activities such as peacefully protesting the fraud surrounding the 2020 election.",
    "Ignored, of course, are the hundreds of speeches and videos I have made calling Donald Trump the greatest President since Abraham Lincoln and making it clear that I strongly support a candidacy by President Trump over my home state Governor Ron DeSantis in 2024.",
    "I also proposed a pardon for every US citizen in prison for the first time non-violent crime of possession of small amounts of drugs which would have freed hundreds of thousands of African-Americans who belong in drug treatment programs rather than in prison.",
    "The Post inaccurately says that “a handful of Democratic congressmen” made such an effort when in fact Clinton manager John Podesta was demanding such a presentation with the promise that he would produce evidence of Russian collusion in Trump’s election.",
    "One of the major reasons for this renewed attack on me is my announcement last week that I will file a class-action lawsuit against Hillary Clinton, John Podesta, Huma Abedin, Michael Sussman, Jake Sullivan and Hillary’s entire criminal cabal.",
    "Not strangely, the Washington Post also omits my advocacy for Demetrious Flenory also known as “Big Meech ” an African-American from Detroit who is unfairly incarcerated while his co-conspirators for financial crimes were released long ago.",
    "The more novel part of the Washington Post attack on me is supplied in one particular video produced by a team of Danish globalists manipulated to give the impression that I have broken with the President I LOVE, Donald J. Trump.",
    "Last Sunday’s assault on me in the Washington Post, however, breaks new ground in its use of a clever blend of ‘guilt by association,’ insinuations, half-truths, anonymous claims, falsehoods, and out of context trick questions.",
    "It’s almost laughable how the Washington Post attempts to minimize the fact that Hillary Clinton actually wanted to make a presentation to the electoral college to thwart the certification of Donald Trump’s election in 2016.",
    "Flenory who has served 17 of a 30-year sentence is in poor health and the government’s repeated claims that he was convicted of violent crimes every time the question of his parole comes up is a racist lie.",
    "I was concerned that vocal proponents who exposed voter fraud like Matt Gaetz, Jim Jordan, Ted Cruz, Paul Gosar, Andy Biggs, Louie Gohmert, Mo Brooks, Bernard Kerik and I would later be targeted.",
    "This time their assault on me included a high-tech deep fake video provided by foreign actors who admit they are bitter over my refusal to grant them the rights to make a documentary trashing me.",
    "It’s sad that I have to say it again but any claim, accusation or implication that I knew about, participated in or condoned the illegal acts at the Capitol on January 6 is categorically false.",
    "These filmmakers with ties to Denmark’s Socialist Government who funded their attack on me, launched their attack after I refused to sign over exclusive film rights for a documentary.",
    "“Guilt by association” is the favorite tactic of the Washington Post propagandists who have only served to make me more famous than ever before with this over-the-top attack on me.",
    "Needless to say, Trump-hating “news outlets” like Rolling Stone and the Business Insider as well as the Guardian bought this particular deep fake video hook, line, and sinker.",
    "Once you have a recording of a person’s voice a simple computer program makes it possible to create a video that appears to make a person say anything.",
    "Reuters reported accurately months ago that an FBI investigation into the riot at the Capitol turned up no evidence of my involvement.",
    "I was prepared to die in prison before I would have given in to pressure from Mueller to testify falsely against the President.",
    "Mueller succeeded in keeping me off the battlefield in 2020- now they don’t want me on the battlefield for Trump in 2024.",
    "If held to the standard Democrats are seeking to apply today, Podesta should have been arrested for sedition and treason.",
    "Anyone who takes the time to study this most obvious deep fake video will note you can’t actually see my mouth move.",
    "I will seek a legal injunction against their defamatory “documentary” being shown in the United States.",
    "They know that I both have standing and that my lawsuit will expose all their criminal activities.",
    "Given the politicization of the Biden DOJ, such pardon would have been both legal and prudent.",
    "Why, given their track record, would anyone believe anything reported by the Washington Post?",
    "You can help Roger with his legal fees here so he can sue the crooks destroying our country.",
    "In fact, they are a threat to our Republic and they will be brought to justice.",
    "Those who continue to smear me keep saying I am “threatening our democracy”.",
    "Through the healing power of Jesus Christ, her cancer is in remission.",
    "To my knowledge, there is no evidence tying him to January 6 misdeeds.",
    "The law and the Constitution take a backseat to their blood lust.",
    "The idea that I would attack Trump is not even logical.",
    "The Washington Post did not mention that.",
    "They are desperate to stop this lawsuit.",
    "Together we will continue to fight.",
    "I did propose a blanket pardon.",
    "Summary\nRecent Posts\nContact",
    "Yes."
  ]
}