{
  "id": 3029,
  "mediaId": 2745,
  "date": "2022-03-17",
  "headline": "Tensions in House GOP over how to go after Big Tech are boiling over",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AV2DVQUXJII6ZOZROT6ANQFDUU.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/17/tensions-house-gop-over-how-go-after-big-tech-are-boiling-over/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1286,
    1670,
    2689,
    3267,
    3975,
    878,
    1161,
    1163,
    4887
  ],
  "sentences": [
    "Rep. Cathy McMorris Rodgers (R-Wash.), who leads the task force, said they had “a great meeting” Wednesday that featured “a lot of consensus and enthusiasm.” She added in a statement, “There is still more work to do, and I look forward to continuing at next week’s issue conference.”\nRussell Dye, a spokesperson for Jordan, said, “Everything is on the table when it comes to antitrust issues, and Republicans have put forth a robust framework that will actually tackle Big Tech’s censorship of conservatives rather than give more power to President Biden’s liberal bureaucrats.”\nBuck said while the briefing touched on efforts to make sure antitrust enforcement is “streamlined,” the bipartisan campaign to beef up antitrust laws and curtail alleged abuses by the tech giants that he’s been championing was “not addressed.”\n“The working group focused on issues other than antitrust, and I think they did that on purpose and I think that they … have not been directed to make antitrust one of the tools that they are looking at,” Buck said.",
    "“Facebook and Twitter in particular have historically argued that keeping official government accounts active serves the public interest, at times exempting them from fact checks and enforcement actions.”\nThe war in Ukraine “raises a complicated set of challenges in how we handle the accounts — our goal is to consistently enforce our rules while balancing the public interest,” Twitter spokesperson Katie Rosborough said.",
    "He added, “The best we can hope for with antitrust in the future is either a watered-down version or trying to perhaps address some other area that hasn’t been raised yet.”\nWith Republican leadership not prioritizing — and at times directly countering — those efforts, the success of the campaign will hinge on Republicans like Buck persuading others to come into the tent.",
    "Facebook parent Meta spokesman Drew Pusateri said the platform takes action on accounts that break its rules, and “the world deserves the opportunity to hear and scrutinize the content of Russian leaders at this moment.” YouTube spokesperson Ivy Choi and TikTok pointed to their existing rule books.",
    "“They could also prove ineffective due to the force and speed with which the Kremlin has worked to sever millions of Russians from the open Internet.”\nNetflix is preparing to test a prompt that will let people pay for users outside their households who they share accounts with, Variety reports.",
    "Rep. Ken Buck (R-Colo.), the most outspoken proponent in his caucus of tougher competition rules for Silicon Valley, said he walked away frustrated that the push is getting little-to-no attention from the group, launched last year by House Minority Leader Kevin McCarthy (R-Calif.).",
    "Buck and his allies on the House Judiciary Committee have been working for months to build support for their antitrust proposals, which together would block Silicon Valley’s most powerful companies from scooping up budding rivals and giving their own services preferred treatment.",
    "Social media consultant and industry analyst Matt Navarra:\nNBC News's Ben Collins:\nThese companies are begging Gen Z to learn how to pirate stuff without any modicum of shame in the way millennials did.https://t.co/uc9wDBq8Zt\n— Ben Collins (@oneunderscore__) March 16, 2022",
    "“Social media companies’ delicate handling of Russian officials resurfaces long-standing questions about their role in hosting and moderating the speech of controversial public figures, from Donald Trump to Iran’s supreme leader to military officials in Myanmar,” we write.",
    "And when House Republican leaders released a “Big Tech Accountability Platform” last year, the only mention of competition was on the need to make sure that “innovation is unleashed, not quashed.” Still, Republican leaders had indicated competition would be a focus.",
    "“As the Conservative government attempts to balance freedom of expression with some of the toughest restrictions in the world on online abuse, it risks frustrating both the tech industry and safety campaigners as well as some Tory MPs,” they write.",
    "Instead, Buck said, the session focused largely on concerns about data privacy and efforts to revamp the tech industry’s liability protections, which Republicans have pursued as a way to target social media platforms over allegations of bias.",
    "“The antitrust bills that we are currently considering will not move forward under Republican leadership, and that’s been a very clear signal that has been sent, and I believe the tech companies are trying to run out the clock,” Buck said.",
    "The Online Safety Bill would require social media companies to police “legal but harmful” content and gives U.K. regulators the power to audit social media algorithms, the Financial Times’s Tim Bradshaw and Jasmine Cameron-Chileshe report.",
    "The remarks show frustrations among Republicans at the vanguard of the antitrust movement are starting to spill over into public view as House GOP leaders hold fast in their opposition to sweeping competition changes.",
    "“But some of the initiatives also could backfire due to their reliance on the personal data of Russians, many of whom are disconnected from the war effort and face grave risks for public protest,” Drew writes.",
    "First:\nA task force launched by House Republican leaders to go after tech giants like Facebook and Google briefed congressional members about the next steps in their game plan Wednesday.",
    "Another key figure in the push, Rep. Jim Jordan (Ohio), top Republican on the House Judiciary Committee, has been a vocal critic of the most aggressive antitrust bills on the table.",
    "Facebook, Twitter, YouTube and TikTok have largely treated the Russian government’s official accounts like civilian users, taking action only when specific rules have been violated.",
    "The website for the “Big Tech Censorship and Data Task Force,” set up by McCarthy’s office, outlines “three pillars” in their efforts: privacy, content moderation and competition.",
    "They could be fined up to 10 percent of their annual global turnover for noncompliance, and some executives could even be jailed if they don’t comply with some parts of the bill.",
    "Teams of computer programmers are helping people contact Russian citizens and, in some cases, share information about civilian deaths or photos of the war, Drew Harwell reports.",
    "Lawmakers in both parties have sharply criticized Twitter and other social networks for keeping the accounts online amid Russia’s war with Ukraine, Will Oremus and I report.",
    "But due to resistance from a group of moderate Democrats, winning over more House Republicans will be key to getting the legislation to the House floor and signed into law.",
    "In an unusually frank assessment, Buck acknowledged that the most aggressive antitrust proposals will go nowhere if his party retakes the House in the upcoming midterms.",
    "“I’m disappointed that this effort has not focused more on competition and antitrust,” he told The Technology 202 in a phone interview Wednesday.",
    "“I will continue to be a thorn in the side of many of my leadership friends and will continue to advocate for antitrust legislation,” he said.",
    "McCarthy’s office last year spoke out against a raft of antitrust proposals advanced by a bipartisan group of lawmakers that includes Buck.",
    "Below: Why the Russian government's accounts are still on social media, and U.K. lawmakers introduce their Online Safety Bill.",
    "Free-speech advocates have criticized the bill, arguing that it would force social media companies to censor their users.",
    "One of the group’s programmers said they have sent millions of messages to Russian numbers in less than two weeks.",
    "But according to a top GOP lawmaker who attended, one major policy area notably got short shrift: antitrust.",
    "If you've got tips on training a new puppy, send those (and any news tips) to: cristiano.lima@washpost.com.",
    "Lawmakers published a draft of the bill last year but have made changes to the proposal since then.",
    "The focus of the briefing, as outlined by Buck, isn’t entirely surprising.",
    "He said he plans to charge ahead, even if it ruffles some feathers.",
    "The bill would impose stiff penalties on tech companies.",
    "The bill still has to be approved by Parliament.",
    "Twitter users shared criticism and warnings.",
    "Happy Thursday!"
  ]
}