{
  "id": 3049,
  "mediaId": 2664,
  "date": "2022-03-08",
  "headline": "GOP lawmaker rips into extremist 'wacky conference' and predicts worse antics to come",
  "image": "https://www.rawstory.com/media-library/paul-gosar-marjorie-taylor-greene-matt-gaetz-louie-gohmert.jpg?id=29500823&width=1200&coordinates=0%2C0%2C0%2C42&height=600",
  "link": "https://www.rawstory.com/gop-lawmaker-rips-into-far-right-wacky-conference-and-predicts-worse-antics-to-come/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1373,
    1670,
    1726,
    2599,
    3267,
    3975,
    242,
    878,
    1161
  ],
  "sentences": [
    "Rep. Don Bacon (R-NE) cited a recent appearance by Rep. Marjorie Taylor Greene (R-GA) -- as well and Paul Gosar (R-AZ) -- at a white nationalist convention in Florida, explaining, \"A lot of them disagree with what she did,\" before conceding, \"I don't know that they're unified on that.\"",
    "Noting some members of the Freedom Caucus who are not known for grandstanding like some of their conservative colleagues, the GOP lawmaker added, \"If you're Mark Green or Jeff Duncan or Ben Cline, do you really want to be associated with either Marjorie Taylor Greene or Gosar?",
    "With Melanie Zanona's report pointing out that bombastic Rep. Jim Jordan (R-OH) is slated to take over the powerful House Judiciary Committee's chairmanship, the report adds that some Republicans are not pleased with the direction the party is going.",
    "One House member was less sanguine about Taylor Greene and Rep. Lauren Boebert (R-CO) whose shouting at President Joe Biden during his State of the Union speech dominated the headlines the day after.",
    "The House member also predicted they will grow worse if the GOP reclaims control of the chamber and House Minority Leader Kevin McCarthy (R-CA) takes the gavel from Speaker Nancy Pelosi (D-CA).",
    "In a CNN report on the growing influence of the far-right House Freedom Caucus, one Republican ripped into the group and said they are embarrassing his fellow GOP colleagues.",
    "Speaking with Zanona and asking to remain anonymous, the lawmaker complained, \"It's one thing to be a troublemaker, like a maverick brand, right?",
    "\"I mean, just the State of the Union alone, Marjorie, Lauren, their antics were embarrassing for all of us.",
    "So what's that going to be like next term, when it gets even worse?\"",
    "It's another thing to be the wacky conference.\"",
    "I wouldn't think so.\"",
    "they predicted."
  ]
}