{
  "id": 3081,
  "mediaId": 2746,
  "date": "2022-03-08",
  "headline": "Capitol Hill’s dangerous kangaroo court",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/08/B1-Navarro1_c0-88-1800-1138_s1200x700.jpg?d6bbe4bf9cb3fbf0cbe362bcd88c54c7b7edd5d9",
  "link": "https://www.washingtontimes.com/news/2022/mar/8/capitol-hills-dangerous-kangaroo-court/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Navarro",
  "authorUrl": "",
  "termIds": [
    1390,
    1670,
    1924,
    2201,
    2298,
    3267,
    3500,
    4087,
    4895
  ],
  "sentences": [
    "OPINION:\nThe U.S. House Select Committee to Investigate the January 6th Attack on the United States Capitol should get to the bottom of why the attack occurred, who may have instigated that attack (including possible ANTIFA anarchists, FBI informants and left-wing agitators), and why the Capitol Hill Police and National Guard failed to protect the Capitol perimeter despite ample warnings from the White House and intelligence community.",
    "Based on these reports and numerous other information, Mr. Trump firmly believed the Nov. 3 election was unfair and that, as in Bush v. Gore, he had a firm obligation to the more than 74 million Americans who voted for him to challenge the results in all ways legally possible.",
    "Instead of doing that, the committee has conspired with the White House to assert the novel and dangerous principle that a sitting president in Mr. Biden can strip his predecessor of executive privilege — and thereby compel me and others to appear before their Star Chamber.",
    "It rests on the deeply flawed presumptions that the Nov. 3 presidential election was fair, that Mr. Trump knew he lost the election fair and square, and that, despite this, Mr. Trump sought to abusively use the powers of government to overturn a legal result.",
    "Accordingly, under the very real threat of arrest and possible imprisonment, I have informed the committee that it is their responsibility to contact the president and his attorneys directly if they want me to cooperate with their investigation.",
    "These reports reveal a disturbing pattern of election irregularities across the six battleground states where President Biden allegedly won the election — Arizona, Georgia, Michigan, Nevada, Pennsylvania and Wisconsin.",
    "Collaterally, the committee is using coercive tactics, including the threat of jail, to silence those such as me, Steve Bannon, John Eastman and others who firmly believe that the 2020 election was likely rigged.",
    "When House Speaker Nancy Pelosi rejected Ohio’s Jim Jordan and Indiana’s Jim Banks, Mr. McCarthy should have called a strike against the House until his selections were seated — or at least offered replacements.",
    "Instead, this rabidly partisan committee has weaponized its subpoena powers and is pursuing a mission that, with no small irony, severely threatens the election integrity of the 2024 presidential race.",
    "This kangaroo committee now seeks to prevent Mr. Trump from running for president in 2024 by saddling him with criminal charges and a possible felony conviction that would preclude him from running.",
    "In the aftermath of the Nov. 3 election, I produced a three-volume “Navarro Report” based on thousands of affidavits and thousands more pages of court testimony, news articles and other documents.",
    "Any fool can see this — even a member of Congress; and the Supreme Court needs to rule forthwith on this matter, not duck the issue as it has been wont to do on election integrity issues.",
    "Until then, we can expect Mrs. Pelosi’s Democrat Congress to do what it has done since 2018: waste time and resources on partisan witch hunts while ignoring the real people’s business.",
    "Stripped of rhetoric, the committee is now engaged in nothing less than a full-blown assault on executive privilege — a key constitutional pillar of presidential decision-making.",
    "If, however, sitting presidents are allowed to destroy the executive privilege of their predecessors for partisan ends, this will destroy executive privilege itself.",
    "Ultimately, the only way this out-of-control committee will be reined in will be through a resounding Republican victory in the 2022 Congressional elections.",
    "• Peter Navarro is the former assistant to the president for trade and manufacturing policy in the Trump White House and author of “The Navarro Report.”",
    "That is exactly what Mr. Trump peacefully did, and that is why there is no possible civil, much less criminal, cause of action against him.",
    "Seven of the nine members of this Kangaroo Court are Democrats while Republican Reps. Liz Cheney and Adam Kinzinger are rabidly anti-Trump.",
    "Instead, playing checkers in a chess world, Mr. McCarthy played right into the hands of Mrs. Pelosi by refusing to seat any Republicans.",
    "In either case, there would have been near partisan balance and ample opportunity for Republicans to keep Democrats in check.",
    "In fact, on Jan. 6, 2021, Mr. Trump had a reasonable presumption that the election may well have been stolen from him.",
    "Democrat Reps. Adam Schiff and Jamie Raskin along with Ms. Cheney played key roles in the impeachment circus.",
    "Mrs. Pelosi countered by seating the RINOs Ms. Cheney and Mr. Kinzinger, and the “Never Trump” game was on.",
    "When it was first established, House Minority Leader Kevin McCarthy proposed five Republican members.",
    "Mr. Raskin sponsored legislation that would have removed former President Donald Trump from office.",
    "Ms. Cheney and Mr. Kinzinger were among only 10 House Republicans who voted to impeach Mr. Trump.",
    "In fact, the number of possible illegal votes dwarfed the narrow alleged Biden victory margins.",
    "In my case, Mr. Trump has asserted executive privilege, and that is not my privilege to waive.",
    "The criminal case against Mr. Trump is as flimsy as it is fanciful.",
    "This rabidly partisan committee is a bipartisan failing."
  ]
}