{
  "id": 3147,
  "mediaId": 2664,
  "date": "2022-03-09",
  "headline": "'Bootlicker' Jim Jordan soundly mocked for one-word 'Trump' tweet: 'Really? That's the tweet?'",
  "image": "https://www.rawstory.com/media-library/jim-jordan.jpg?id=27161537&width=1200&coordinates=0%2C41%2C0%2C42&height=600",
  "link": "https://www.rawstory.com/jim-jordan-twitter-2656890931/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    1670,
    1982,
    2201,
    3065,
    3709,
    3975,
    5371
  ],
  "sentences": [
    "— man woman person camera tv (@man woman person camera tv) 1646846307\n— Allen Glines (@Allen Glines) 1646846298\n— Real Housecat Hans (@Real Housecat Hans) 1646847049\n— Penelope \\ud83d\\udc99\\ud83d\\udc9b (@Penelope \\ud83d\\udc99\\ud83d\\udc9b) 1646845412\n— PlantManager013013 (@PlantManager013013) 1646846451\n— Deborah Harris (@Deborah Harris) 1646847338\nSay it loud and there's music playing,\\nSay it soft and it's almost like praying\n— Steven Eads (@Steven Eads) 1646846758\n— Brian Bullard (@Brian Bullard) 1646847422\nNOW WATCH: Pulitzer Prize-winning historian explains Putin's miscalculation of NATO: 'He was listening to Trump'\nPulitzer Prize-winning historian explains Putin's miscalculation NATO: 'He was listening to Trump'\nStories Chosen For You\nShould Donald Trump be charged?",
    "According to a report from the Wall Street Journal, Rep. Madison Cawthorn's re-election is no longer a certainty as North Carolina Republican voters who supported him in 2020 are looking elsewhere because he's more interested in grandstanding than he is in serving their needs.",
    "While the Republican nominee for the district that the freshman lawmaker now represents will likely win in the 2020 midterm, the Journal's Natalie Andrews reports that Cawthorn is currently reeling as local and national Republicans criticize his antics.",
    "James Phillip Mault pleaded guilty during Friday's court proceedings, with the Observer reporting he had been charged with assaulting, resisting or impeding officers during the riot that sent lawmakers fleeing for their lives.",
    "The Charlotte Observer is reporting that a 30-year-old Fayetteville man confessed on Friday that he used a chemical spray on Capitol police officers while taking part in the Jan 6th insurrection.",
    "\"The Washington Post is wrong,\" Maher said, \"Democracy doesn't die in darkness, it dies in plain sight, because enough people think democracy is a luxury that America can no longer afford.\"",
    "The Ohio Republican tweeted out the last name of President Joe Biden's predecessor, but the response from other social media was more amused than triggered.",
    "\\n\\n\"Which U.S. President had discussions with Jim Jordan just prior to his supporters attacking the U.S. Capitol in an attempted coup?\"",
    "Bill Maher spoke on the subject of democracy during a rather somber segment of Friday's episode of \"Real Time With Bill Maher.\"",
    "— farting koala bear (@farting koala bear) 1646845672\n— OutdoorDad (@OutdoorDad) 1646845651\nOh, so we are playing Jeopardy.",
    "Rep. Jim Jordan (R-OH) tweeted out a single word in an attempt at provocation that was instead met with mockery.",
    "I need to answer in the form of a question."
  ]
}