{
  "id": 3269,
  "mediaId": 2631,
  "date": "2022-03-18",
  "headline": "House passes Crown Act banning discrimination against Black hairstyles",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/190715-natural-hair-cs-1221p-5c5f23.jpg",
  "link": "https://www.nbcnews.com/politics/politics-news/house-passes-crown-act-banning-discrimination-black-hairstyles-rcna20617",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "House passes act banning discrimination against Black hairstyles\nMarch 18, 202201:26\n\"Here we are today, standing on behalf of those individuals — whether my colleagues on the other side recognize it or not — who are discriminated against as children in school, as adults who are trying to get jobs, individuals who are trying to get housing, individuals who simply want access to public accommodations and to be beneficiaries of federally funded programs,\" Watson Coleman said in remarks on the House floor Friday morning.",
    "This demonstrates the bill's necessity, she said, because there are people in positions of authority \"who think because your hair is kinky, it is braided, it is in knots or it is not straight and blonde and light brown, that you somehow are not worthy of access to those issues.\"",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nThe Biden administration this week said it \"strongly supports\" the Crown Act and \"looks forward to working with the Congress to enact this legislation and ensure that it is effectively implemented.\"",
    "The legislation states that \"routinely, people of African descent are deprived of educational and employment opportunities\" for wearing their hair in natural or protective hairstyles such as locs, cornrows, twists, braids, Bantu knots, or Afros.",
    "Like Watson Coleman, other proponents of the bill mentioned a number of children — directly and indirectly — who drew national attention after they were reprimanded for wearing their hair in braids, dreadlocks or other protective styles.",
    "\"It's important to the young girls and the young boys who have to cut their hair in the middle of a wrestling match in front of everyone because some white referee says that your hair is inappropriate to engage in your match.\"",
    "It was introduced by Rep. Bonnie Watson Coleman, D-N.J.\nCrown stands for Creating a Respectful and Open World for Natural Hair, and the act prohibits \"discrimination based on an individual's texture or style of hair.\"",
    "Without naming him, she referred to Andrew Johnson, a Black varsity high school wrestler in New Jersey with dreadlocks who was forced in 2018 to make a choice: cut his hair or forfeit his match.",
    "Jordan said Friday that he wanted to focus on gas prices, inflation and issues of importance \"to the American people\" and accused Democrats of distracting from those issues.",
    "\"There's no logical reason that anyone should be discriminated against on any level because of the texture of their hair or the style of their hair,\" Watson Coleman said.",
    "She accused some of her colleagues, such as Rep. Jim Jordan, R-Ohio, of avoiding a conversation about discrimination that disproportionately affects Black people.",
    "\"As a Black woman who loves my braids, I know what it's like to feel isolated because of how I wear my hair,\" Rep. Cori Bush, D-Mo., said on the House floor.",
    "He said it was disappointing that 188 Republicans opposed the legislation when it was recently brought to the floor under an expedited process.",
    "Before a vote was taken, a number of Black and African American legislators spoke of having been discriminated against because of their hair.",
    "\"This is the last time we say no more to Black people being made to feel like we have to straighten our hair to be deemed professional.\"",
    "Rep. Gwen Moore, D-Wis., said someone had told a previous employer that she was \"an embarrassment\" because of the way her hair looked.",
    "House Majority Leader Steny Hoyer, a Democrat from Maryland, told his colleagues Friday that the bill should have unanimous support.",
    "In response to Jordan's remarks, Rep. Al Green, D-Texas, said: \"Black people are American people, too.",
    "More than a dozen states, including New Jersey and New York, have passed versions of the Crown Act.",
    "\"If anybody thinks this isn't a real issue, obviously the military thought it was an issue.",
    "\"Our military took steps to end hair discrimination last year,\" said Hoyer, who is white.",
    "The House on Friday passed the Crown Act, which would ban hair-related discrimination.",
    "And when you say the American people don't want it, you cannot exclude Black people.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "And it was an important enough issue they took action.\"",
    "2116, passed in a vote of 235-189 along party lines.",
    "This is a kitchen table issue in Black households.\"",
    "Black people would have this be on the floor.",
    "\"This bill is vitally important,\" she said.",
    "\"Well,\" she added, \"that's discrimination.\"",
    "California was the first state to do so.",
    "Fourteen Republicans voted for the bill.",
    "The bill now goes to the Senate.",
    "The measure, H.R."
  ]
}