{
  "id": 3279,
  "mediaId": 2664,
  "date": "2022-03-08",
  "headline": "Freedom Caucus plans to 'elevate' Taylor Greene and Boebert on committees after GOP retakes the House: report",
  "image": "https://www.rawstory.com/media-library/lauren-boebert-marjorie-taylor-greene.jpg?id=29500360&width=1200&coordinates=0%2C42%2C0%2C8&height=600",
  "link": "https://www.rawstory.com/house-freedom-caucus-2656871974/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    0
  ],
  "sentences": [
    "According to a report from CNN's Melanie Zanona, the 40-member House Republican Freedom Caucus expects to gain new adherents in the November midterm election and is making plans to flex their muscle by demanding the Republican Leadership place members on key committees.",
    "\"McCarthy also publicly defended Greene and Gosar when Democrats kicked them off their committees for inflammatory rhetoric, promising to give them new assignments -- and potentially even better ones -- if Republicans win back the majority,\" the report states.",
    "Past iterations of the group -- which was formed as an ultra-conservative alternative to the Republican Study Committee but has since become more of a Trump loyalty club -- were more focused on process and transparency concerns, as well as fiscal conservatism.",
    "With Republicans expected to take control of the chamber, new Freedom Caucus leader, Rep. Scott Perry (R-PA) was upfront about what he expects from current House Minority Leader Kevin McCarthy (R-CA) when he starts approving committee assignments.",
    "Among those they hope to \"elevate\" to more prominent positions are Reps. Marjorie Taylor Greene (GA), Lauren Boebert (CO), Madison Cawthorn (NC) and Paul Gosar of Arizona who is tightly aligned with the white supremacist movement.",
    "CNN's Zanona is also reporting that McCarthy is already making overtures to the group -- likely in an effort to keep his leadership job after the takeover -- and has been having sit-down meetings with key members.",
    "As CNN's Zanona points out, controversial Rep. Jim Jordan (R-OH) is already in line to take over the chairmanship of the powerful House Judiciary Committee \"with all the subpoena power that comes with it.\"",
    "\"Key to the Freedom Caucus' ability to hold sway in the majority is its strength in numbers and willingness to stick together, though its power ultimately depends on the size of the GOP's majority.",
    "\"And whenever Freedom Caucus members cause trouble, McCarthy prefers to deal with them behind the scenes, like when Greene complained about him on a podcast on Thanksgiving last year.",
    "That's because on any given day, it seems this extremist crew is making headlines -- and creating headaches for GOP leadership -- with their behavior,\" the CNN report states.",
    "That, the report notes, is only that start for the members of the far-right caucus who have been avid supporters and defenders of former president Donald Trump.",
    "The band of roughly 40 rabble-rousers added nearly a dozen members to its ranks in the last election, and is hoping to expand its troops even more this fall.\"",
    "According to one member, Rep. Andy Biggs of Arizona, \"Don't forget that we added 11 new members to the Freedom Caucus from the last election.",
    "\"The party's most prominent provocateurs have even earned a private new nickname from some of their colleagues: 'the trending caucus.'",
    "Some of the more veteran members of the group are still emphasizing that as a top priority,\" the CNN report adds.",
    "Freedom Caucus members don't seem to have much of a place in a lot of the larger decision-making,\" he explained.",
    "\"We're going to be pushing for a fair process; we're going to be pushing for more participation.",
    "\"There's no Freedom Caucus member on the Select Committee on Intelligence.",
    "\"It's unclear how the Freedom Caucus plans to wield its likely influence.",
    "Seems to be that there should be a Freedom Caucus member on that.\"",
    "If we don't pick up five or six (next year), I'd be surprised.\"",
    "The next day, McCarthy called up Greene to hash things out.\"",
    "Stories Chosen For You"
  ]
}