{
  "id": 3292,
  "mediaId": 2644,
  "date": "2022-03-10",
  "headline": "GOP Rep. Madison Cawthorn slams Zelensky as a ‘thug’ overseeing ‘evil’ government",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/cawthorne-zelensky-278.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/10/rep-madison-cawthorn-slams-zelensky-as-a-thug-ruling-evil-government/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Evan Simko-Bednarski",
  "authorUrl": "",
  "termIds": [
    1670,
    2201,
    2976,
    3975,
    4384,
    878,
    5287,
    5366
  ],
  "sentences": [
    "During the 2019 impeachment proceedings — which culminated with Trump being acquitted in a party-line vote — Rep. Jim Jordan (R-Ohio) said Ukraine was regarded by accounting firm Ernst & Young as “one of the three most corrupt countries on the planet.”\nCawthorn is running for re-election in North Carolina’s 11th District, where he is facing seven Republican primary challengers.",
    "“Remember that the Ukrainian government is incredibly corrupt, and it is incredibly evil, and it has been pushing ‘woke’ ideologies.”\nCawthorn’s comments stand in stark contrast to the bipartisan support that’s grown around Zelensky and the Ukrainian military since the start of Russia’s brutal invasion last month.",
    "The Republican from North Carolina was caught on tape at a campaign rally over the weekend attacking the Ukrainian president — who, according to his aide, has survived more than a dozen assassination attempts in the first two weeks of the war.",
    "But they echo the Republican line from 2019, when then-President Donald Trump was impeached for allegedly threatening to withhold military aid from Zelensky’s government unless the Ukrainian government investigated then-candidate Joe Biden.",
    "He called Russian President Vladimir Putin’s invasion “disgusting,” and said he is “praying for Ukraine and the Ukrainian people.”\nHe did not walk back his attack on the Ukrainian leader, however.",
    "Cawthorn linked to a substack article characterizing the Ghost of Kyiv and the survival of Ukrainian troops on Snake Island as instances of Ukrainian disinformation.",
    "Rep. Madison Cawthorn labeled Volodymyr Zelensky a “thug” and his government “incredibly evil” amid Russia’s blood-soaked invasion of Ukraine.",
    "“Pray also we are not drawn into conflict based on foreign leaders pushing misinformation,” Cawthorn wrote.",
    "“Remember that Zelensky is a thug,” Cawthorn said, according to a video obtained by North Carolina’s WRAL.",
    "“Leaders, including Zelensky, should NOT push misinformation on America,” he said.",
    "Cawthorn took to Twitter on Thursday after taking heat for bashing Zelensky."
  ]
}