{
  "id": 3326,
  "mediaId": 2866,
  "date": "2022-03-11",
  "headline": "RNC Sues Nancy Pelosi and Jan. 6 Committee for Overreach!",
  "image": "https://www.fixthisnation.com/wp-content/uploads/2022/03/nancy-1024x576.jpg",
  "link": "https://www.fixthisnation.com/rnc-sues-nancy-pelosi-and-jan-6-committee-for-overreach/",
  "mediaOutlet": "fixthisnation.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Sheridan",
  "authorUrl": "https://www.fixthisnation.com/author/bill-sheridan/",
  "termIds": [
    1670,
    2599,
    2726,
    3267,
    180,
    877,
    878,
    916,
    5371
  ],
  "sentences": [
    "In a counter-statement, Jan. 6 committee spokesperson Tim Mulvey responded that the subpoena has “absolutely nothing to do with getting the private information of voters or donors.”\n“Claims about a stolen election motivated rioters who stormed the Capitol on Jan. 6,” he said, adding that the subpoena is intended “to help investigators understand the impact of false, inflammatory messages in the weeks before Jan. 6, the flow of funds, and whether contributions were actually directed to the purpose indicated.”\nHowever, the RNC maintains that “This information has nothing to do with Jan. 6, and there is simply no reason the committee needs personal and private information on millions of Americans.",
    "Pelosi’s committee is unconstitutionally attempting to exercise law enforcement authority, with even the left-leaning New York Times reporting that the committee “is employing techniques more common in criminal cases than in congressional inquiries.”\nIn addition, the committee has dramatically exceeded its scope, issuing hundreds of wide-ranging subpoenas, such as this one, and demanding records well beyond the scope of the events of Jan. 6, 2021, in disregard of the checks and balances and the rule of due process.",
    "In a statement to the press, the RNC said it filed suit to keep the committee “from unlawfully seizing confidential information about the internal activities of the Republican Party and millions of its supporters which is completely unrelated to the attack on the Capitol,” calling the subpoena “overly broad” and accusing Pelosi and the committee of “weaponizing” their investigative powers.",
    "Pelosi and the committee are weaponizing and abusing Congress’ investigatory power.”\nWe here have long maintained that Pelosi’s committee is illegitimate, having rejected two Republicans that McCarthy appointed to the Committee – Reps. Jim Jordan (R-OH) and Jim Banks (R-IN) – an abuse of power for purely political reasons.",
    "“Salesforce collects and maintains significant amounts of RNC data,” the RNC said, and the subpoena “jeopardizes exposing the personal and private data of up to 60 million Americans” as well as GOP strategy.",
    "The subpoena, issued on Feb. 23, seeks evidence that Republican fundraising efforts that spread falsehoods that the 2020 election was stolen contributed to the Capitol riot of Jan. 6.",
    "The Republican National Committee (RNC) says that Nancy Pelosi and the Jan. 6 committee have gone too far in subpoenaing Salesforce records involving RNC fundraising efforts.",
    "However, the RNC has filed a lawsuit to block the subpoena, saying that Pelosi’s committee has subpoenaed Salesforce for the RNC’s data without any legitimate basis.",
    "“The RNC had nothing to do with the violence that occurred at the Capitol and has repeatedly condemned it,” they said.",
    "The RNC’s fundraising platform is hosted by software giant Salesforce, Inc.",
    "To read the RNC’s full lawsuit, click here."
  ]
}