{
  "id": 3327,
  "mediaId": 2744,
  "date": "2022-03-10",
  "headline": "Garland says Capitol riot investigation is ‘most urgent’ in DOJ’s history",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/6f841ac/2147483647/strip/true/crop/6791x3565+0+457/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F0c%2F8f%2Fee0ee02a427cb5b7e8756cd340e9%2Fap22061159452807.jpg",
  "link": "https://www.washingtonexaminer.com/news/justice/garland-says-capitol-riot-investigation-is-most-urgent-in-dojs-history",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerry Dunleavy",
  "authorUrl": "https://www.washingtonexaminer.com/author/jerry-dunleavy",
  "termIds": [
    1934,
    2780,
    180,
    370,
    1132
  ],
  "sentences": [
    "The claim by President Joe Biden's chief law enforcement officer comes as Republicans have said the Biden DOJ has not put the same effort into prosecutions tied to the violent riots of 2020 as the storming of the Capitol and have criticized the department for its decision to shutter the China Initiative despite a growing threat posed by the Chinese Communist Party.",
    "The attorney general indicated in May the DOJ was prioritizing prosecutions related to the siege of the Capitol over those tied to the 2020 summer riots because the events of Jan. 6 were “the most dangerous threat to our democracy.”\nWray said last month the growing economic and national security threat posed by China is graver than ever.",
    "Just In...\nAttorney General Merrick Garland says the Justice Department’s investigation into the Capitol riot is the “most urgent” in DOJ history, more than a year after the U.S. Capitol Building was stormed on Jan. 6, 2021.",
    "It famously sought to stop Nazi saboteurs during World War Two, established a Ten Most Wanted Fugitives List, enforces civil rights laws, and is tasked with stopping cartels and other criminal organizations.",
    "People are working every day, 24/7, and are fully aware of how important this is.”\nGarland added: “This had to do with the interference with the peaceful transfer of power from one administration to another.",
    "The DOJ said Wednesday that 775 defendants have been arrested in relation to crimes at the Capitol riot, including more than 245 charged with assaulting or impeding law enforcement.",
    "Director of National Intelligence Avril Haines said Tuesday that the CCP remains the “absolutely unparalleled” long-term priority for the U.S. intelligence community.",
    "FBI Director Christopher Wray claimed in January that the FBI is working just as hard to punish participants in the 2020 riots as those involved in the Capitol riot.",
    "We have thrown 70 prosecutors from the District of Columbia and another 70 around the country,” Garland said of the Capitol riot in an NPR interview on Thursday.",
    "We've issued thousands of subpoenas, seized and examined thousands of electronic devices, examined terabytes of data, thousands of hours of videos.",
    "The DOJ and FBI were deeply involved in investigating the 9/11 attacks and are responsible for preventing and prosecuting terrorist attacks.",
    "When asked if he will investigate Trump, he replied: “We follow the law, and we follow the facts, and we follow them wherever we go.",
    "John Durham’s special counsel criminal investigation is scrutinizing the origins and conduct of the Trump-Russia investigation.",
    "The DOJ unveiled a domestic terrorism unit in January and announced a special task force to target Russian oligarchs in March.",
    "The Justice Department was established in 1870 to enforce the 13th, 14th, and 15th Amendments after the Civil War.",
    "The department deals with foreign espionage cases, prosecutes assassination efforts, and goes after violent crime.",
    "This assessment comes after the Justice Department shut down the Trump-era China Initiative in February.",
    "The attorney general's claim that the Capitol riot inquiry is the most urgent in DOJ history is notable.",
    "Garland said in January “there is no higher priority” at DOJ than prosecuting the Capitol riot cases.",
    "Garland promised that “we hold everyone accountable who committed criminal acts with respect to Jan.",
    "What we are avoiding is making decisions on a political basis, on a partisan basis,” Garland said.",
    "“Every FBI office, almost every U.S. attorney's office in the country is working on this matter.",
    "“We are not avoiding cases that are political or cases that are controversial or sensitive.",
    "He compared the deadly Oklahoma City bombing of 1995 to the Capitol riot in June.",
    "\"This is the most urgent investigation in the history of the Justice Department.",
    "And it doesn't get more important than that.\"",
    "It is the most resource-intensive.",
    "That’s our one rule.”",
    "6.\""
  ]
}