{
  "id": 3375,
  "mediaId": 2512,
  "date": "2022-03-18",
  "headline": "The House just passed a bill forbidding hairstyle discrimination. Most Republicans voted against it",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29558993&width=1200&coordinates=0%2C106%2C0%2C107&height=600",
  "link": "https://www.alternet.org/2022/03/house-passes-banning-hairstyle-discrimination/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    1373,
    1670,
    2360,
    3975,
    878,
    1163,
    1171,
    5212
  ],
  "sentences": [
    "But it’s about the reaction, the inequality, the discrimination, the ‘you’re not welcome here’ if your hair texture is different.”\nHow the bill will do in the Senate, Smith notes, remains “uncertain.” Sen. Cory Booker of New Jersey has introduced a companion bill, but so far, the only Senate Republican who has supported the House version, according to Smith, is Sen. Don Bacon of Nebraska.",
    "“The bill would bar discrimination against locs, braids, Bantu knots, and other hairstyles to make uniform the hodgepodge of state laws against this form of bias, as well as competing court rulings weighing in on bias against specific styles,” Smith reports.",
    "In a policy statement released on March 15, the Biden Administration said, “Such discrimination has imposed significant economic costs, learning disruption, and denial of economic opportunities for people of color.",
    "Black women, for example, experience discrimination in hiring because of natural hair styles, and Black girls experience disproportionate rates of school discipline, sometimes for discriminatory hair violations.”",
    "What the United States still doesn’t have is a federal law that prohibits discrimination against hairstyles, but on Friday, March 18, the U.S. House of passed a federal hairstyle discrimination bill.",
    "In February, Rep. Jim Jordan of Ohio, a far-right MAGA Republican, criticized the bill as “unnecessary,” but House Majority Leader Steny Hoyer totally disagreed — saying, “This bill….",
    "If a hairstyle discrimination bill did get passed in the Senate, Biden would have the power to veto it — although he would be almost certain to sign it into law.",
    "In order to become federal law, however, it would also need to pass in the U.S. Senate and, after that, be signed into law by President Joe Biden.",
    "At the state and local levels in the U.S., one finds a variety of laws that address hairstyle discrimination.",
    "The bill, according to Bloomberg News reporter Paige Smith, passed 235-189 in the House.",
    "is not about hair."
  ]
}