{
  "id": 3377,
  "mediaId": 6551,
  "date": "2022-03-15",
  "headline": "Immigration Arrests and Deportations Plummet During Biden's First Year",
  "image": "https://www.numbersusa.com/sites/default/files/public/assets/news/2015.09.01_ICE_Badge_1.jpg",
  "link": "https://www.numbersusa.com/news/immigration-arrests-and-deportation-plummet-during-bidens-first-year",
  "mediaOutlet": "numbersusa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    2201,
    3975,
    4711,
    305,
    472,
    1098
  ],
  "sentences": [
    "Representative Claudia Tenny (R-N.Y.) added that the administration is attempting to create stressors within the U.S. immigration enforcement agencies and inhumane conditions for detained aliens \"simply to fulfill its ideological goal of flooding America with migrants who will be hard to remove,\" reports Just the News.",
    "On Saturday, the administration announced another policy change that would further increase the number of illegal aliens allowed to stay in the country - stating that they will no longer expel unaccompanied alien minors under the public health order Title42.",
    "Representative Darrell Issa (R-Calif.) compared the astounding drop in arrests and deportations to a \"slow march to abolish ICE,\" reminding Americans that many Democrats had not only run on the issue but lobbied for it too.",
    "It is important to note that the Biden administration delayed the release of these statistics for three months and celebrated the shift toward fewer overall actions, mainly targeting illegal aliens with felony records.",
    "And by the way, some of these people are being flown into New York state in the dark of night and being brought into our communities without even our knowledge, and New York state taxpayers are paying for this.",
    "U.S. Immigration and Customs Enforcement reported late last week that immigration arrests fell sharply to just 74,082 in FY21; for context, this is down from 103,000 in FY20 and 143,000 two fiscal years ago.",
    "Representative Jim Jordan (R-Ohio) said that the decision would undoubtedly lead to more chaos and harm at the border:\nDemocrats want to end Title 42 at the southern border.",
    "Even more shockingly, deportation fell 70% to just 59,011 in FY21, representing the lowest number in 26 years, despite a historic year of illegal aliens entering the U.S.",
    "According to the report, \"Approximately 49 percent of all arrests were of convicted criminals,\" this included \"495 noncitizen sex offenders from 54 different countries.",
    "They don't have the resources to treat these people even the way that they should be treated or send them back.",
    "Under both the Obama and Trump administrations, deportations often exceed 300,000 per year.",
    "Of particular note, 80 percent of those noncitizens had victimized children.\"",
    "The report also noted the deportation of 34 known or suspected terrorists.",
    "It's one of our last lines of defense against illegal immigration.",
    "Even the other neighboring countries are concerned about it.",
    "If they nix the program now, expect immediate chaos.",
    "For the complete story, please click here.",
    "Updated: Tue, Mar 15th 2022 @ 3:24pm EDT",
    "American citizens are paying the price.",
    "We're not doing anything about it.",
    "The system is being overwhelmed.",
    "We're not solving this problem."
  ]
}