{
  "id": 3407,
  "mediaId": 2727,
  "date": "2022-03-15",
  "headline": "AIPAC takes a giant step in the wrong direction",
  "image": "https://static.timesofisrael.com/blogs/uploads/users/Doug-BloomfieldDEC2016-1530953303-400x400.jpeg",
  "link": "https://blogs.timesofisrael.com/aipac-takes-a-giant-step-in-the-wrong-direction/",
  "mediaOutlet": "Time of Israel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "These are the same people who stood silently by as the former president tried to blackmail Ukrainian President Volodymyr Zelensky and gushed over Vladimir Putin as his “friend” and a “genius.”\nTopping the list is minority leader Rep. Kevin McCarthy, who is in line to be the next Speaker of his party wins in November.",
    "The New York Times has reported that he was said he was like KKK leader David Duke “without the baggage.”\nMost outrageous may be the bombastic Jordan, who has refused to testify before the January 6 investigating committee and joined failed lawsuits to block certification of Biden’s election.",
    "The American Israel Public Affairs Committee (AIPAC)’s endorsement of one of the most extreme partisan and divisive rightwing Members of Congress, Rep. Jim Jordan of Ohio, suggests it was never serious about mending fences with Democrats and Jews that the group has alienated over many years.",
    "AIPAC, through its Political Action Committee, just announced it has endorsed and will be making campaign contributions those three and 34 other Republicans who tried to trash the Constitution and overthrow the 2020 presidential election on January 6, 2001.",
    "He voted to overturn the election, has said the Democratic party has fallen under the “antisemitic influence of their radical members” and has failed to do anything to curb extremists, anti-Semites and white supremacists in his caucus.",
    "Known for his disruptive antics at hearings, he is one of Trump’s fiercest attack dogs, which may explain why he took the senior Republican seat on the House Judiciary Committee in time for the former president’s second impeachment.",
    "Perry has compared Democrats to Nazis and Babin said in a Newsmax interview, the majority party “want to replace the American electorate with a Third World electorate that will be on welfare.”\nThe problem goes deeper – or higher .",
    "There’s no need to plunge Israel deeper into the partisan morass by telling half (probably more) of its donors their money is going to help elect people who oppose just about everything they stand for.",
    "Jews voted three-to-one for Biden, and they differ fundamentally from most Republicans on issues like climate change, guns, health care, race, LGBQT rights, voting rights and abortion to name a few.",
    "Very few Jewish voters put Israel at the top of their priority list when going to the polls, and those who do are largely, though not exclusively, on the right and among the Orthodox.",
    "AIPAC also endorsed two far right Republican nativists who tout white supremacist population replacement conspiracies, Reps. Scott Perry of Pennsylvania, and Brian Babin of Texas.",
    "Endorsing those who sided with the insurrectionists, opposed certification of Biden’s election and question the legitimacy of his presidency is a blunder of the first order.",
    "That makes a mockery of the AIPAC’s attempts to claim neutrality and undercuts any talk of repairing damaged relations with Democrats and the majority of Jewish voters.",
    "Minority whip Steve Scalise backs Trump’s bogus claims about a stolen election, according to the Associated Press, Fox News and other media reports.",
    "This raises serious questions about the sincerity of AIPAC’s talk after last November about repairing its frayed relations with the Democrats.",
    "AIPAC’s claims to be a one-issue group that doesn’t care about anything, but US-Israel relations won’t wash. That boat sailed long ago.",
    "It is time to return to the longstanding policy of “we don’t rate and endorse” and allow people to make their own decisions.",
    "A total of 147 Republicans voted to overturn the election, even after the sacking of the Capitol by Donald Trump’s mob.",
    "This decision is also unlikely to play well with those American Jews who fear for the future of our democracy.",
    "He is tangled in a sexual misconduct scandal dating to his tenure as an assistant college wrestling coach.",
    "He’d likely have backing from Trump, who is said to feel McCarthy is not sufficiently tough or loyal.",
    "About the Author\nDouglas M. Bloomfield is a syndicated columnist, Washington lobbyist and consultant.",
    "Jordan is a founder of the ultra-conservative House Freedom Caucus; Perry is its current chair.",
    "The current chair, Rep. Jerry Nadler (D-NY), has accused him of publishing antisemitic tweets.",
    "Telling AIPAC members their money is going to help elect such extremists doesn’t make sense.",
    "Jordan may challenge McCarthy for the speakership if Republicans are victorious this fall.",
    "He may face challenges for the Speakership from two other AIPAC-endorsed rejectionists.",
    "The notorious 37 were among 61 Republicans and 59 Democrats to get AIPAC’s blessing.",
    "That may explain AIPAC’s cynical rationale for endorsing the three rejectionists.",
    "He spent nine years as the legislative director and chief lobbyist for AIPAC.",
    "The majority of Jewish voters are on the opposite side of the 37.",
    "Some still refuse to acknowledge President Joe Biden’s election.",
    "Right into the House Republican leadership.",
    "Scalise may also seek the leadership.",
    "It’s time to send the PAC packing."
  ]
}