{
  "id": 3409,
  "mediaId": 2738,
  "date": "2022-03-09",
  "headline": "Jim Jordan Got Dunked On By Social Media Over A Tweet That Only Has One Word (And Is About You Know Who)",
  "image": "https://uproxx.com/wp-content/uploads/2021/07/jim-jordan.jpg?w=1024",
  "link": "https://uproxx.com/viral/jim-jordan-tweet-trump-twitter-reactions/",
  "mediaOutlet": "uproxx.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Prigge",
  "authorUrl": "https://uproxx.com/author/matt-prigge/",
  "termIds": [
    1670
  ],
  "sentences": [
    "And derided they are, with everyone hopping on such classics as him claiming that Dr. Fauci will “ban” people saying “Merry Christmas,” that the GOP had become more blue collar, and his state of Ohio should “ban all vaccines mandates,” including the many ones that aren’t controversial with anyone.",
    "In any case, Jordan is busy trying to dodge the House Select committee investigating the Jan. 6 Capitol attack, probably because he’s done such a poor job pretending he wasn’t involved in it.",
    "Instead he appears to spend most of his time spouting pro-Trump talking points on TV, being a nuisance during congressional hearings, and making dunkable tweets.",
    "Was it the former president “joking” about a plan to turn Russia and China on each other that was so moronic not even a child would say it in public?",
    "Was it his effusive praise for a wildly unpopular world leader who launched a baseless invasion on a neighboring country?",
    "His viral tweets follow a similar pattern: He writes something short yet combative, all but begging for derision.",
    "Was it because he was begging his supporters for money again, this time because his private plane went kaput?",
    "Jim Jordan is an elected lawmaker, but he doesn’t appear to do much lawmaking.",
    "His tweet had but one word: “Trump.”\nWhat was the occasion?",
    "On Wednesday, he outdid himself, by doing next to nothing.",
    "Who knows how the mind of Matt Gaetz’s bestie works?",
    "Others inferred meaning he may not have intended.",
    "Like clockwork, everyone made fun of Jim Jordan.",
    "Some responded with their own one-word tweets.",
    "Whatever the intention, it worked.",
    "There were other jokes."
  ]
}