{
  "id": 3428,
  "mediaId": 6545,
  "date": "2022-03-18",
  "headline": "House passes the CROWN Act, a bill banning race-based hair discrimination",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/03/18/b64f3604-a4f7-42df-b666-eb3217f65b5f/thumbnail/1200x630/87938ec44890bd56568acd4df4f4393f/gettyimages-1239187103.jpg",
  "link": "https://www.cbsnews.com/newyork/news/hair-discrimination-bill-protects-hairstyles/",
  "mediaOutlet": "newyork.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zak Hudak",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"It's important to the young girls and the young boys who have to cut their hair in the middle of a wrestling match in front of everyone because some White referee says that your hair is inappropriate to engage in your match,\" she said.",
    "Democratic leaders tried to expedite passage of the legislation last month by voting on it as a suspension bill, a House rule that allows non-controversial measures to be considered in an expedited manner, without amendments.",
    "The CROWN Act, which was introduced by Congresswoman Bonnie Watson Coleman, would prohibit hair-based discrimination \"if that hair texture or that hairstyle is commonly associated with a particular race or national origin.\"",
    "In a speech from the House floor Friday, Watson Coleman listed cases of Black Americans losing job opportunities, being denied federal assistance or otherwise being treated unfairly based on their hair.",
    "Congressman Jim Jordan, a Republican from Ohio, argued on the floor that the Constitution already bans race-based discrimination, and that this bill was superfluous.",
    "Hairstyles the legislation would protect include those \"in which hair is tightly coiled or tightly curled, locs, cornrows, twists, braids, Bantu knots and Afros.\"",
    "\"Natural Black hair is often deemed 'unprofessional' simply because it does not conform to white beauty standards,\" Watson Coleman said in a statement.",
    "\"This is the last time we say no more to Black people being demeaned and discriminated against for the same hairstyles that corporations profit from.\"",
    "In a rebuttal, Congressman Al Green, a Democrat from Texas, later charged that Jordan's assessment of the bill ignored what Black Americans want.",
    "However, passing bills under suspension of the rules requires the support of two-thirds of the members present, and the CROWN bill fell short.",
    "\"I think the American people expect more from their Congress … I hope we can actually focus on the things that matter to the American people.\"",
    "I'm proud to have played a part to ensure that we end discrimination against people for how their hair grows out of their head.\"",
    "\"As a black woman who loves my braids, I know what it's like to feel isolated because of how I wear my hair,\" she said.",
    "Congresswoman Cori Bush, a freshman Democrat from Missouri, spoke about hair discrimination from personal experience.",
    "The measure passed by a vote of 235-189, with 14 Republicans joining Democrats in support of the legislation.",
    "The House on Friday passed legislation that would ban discrimination based on hairstyle and hair texture.",
    "\"When you say the American people don't want it, you cannot exclude Black people.",
    "A companion bill introduced by Senator Cory Booker has yet to move forward.",
    "In:\nUnited States Congress\n Zak Hudak\nCBS News reporter covering the House.",
    "\"Discrimination against Black hair is discrimination against Black people.",
    "\"Fourteen months of chaos and we're doing a bill on hair,\" Jordan said.",
    "This is a kitchen table issue in Black households,\" he said.",
    "More than a dozen states have passed similar measures.",
    "Black people would have this be on the floor."
  ]
}