{
  "id": 3433,
  "mediaId": 2754,
  "date": "2022-03-07",
  "headline": "GOP Says It'll Investigate Fauci If It Retakes House in 2022",
  "image": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2022-03/GettyImages-1231789830-700x420.jpeg?h=96bbde6f&itok=k4GemwkQ",
  "link": "https://www.zerohedge.com/covid-19/gop-says-itll-investigate-fauci-if-it-retakes-house-2022",
  "mediaOutlet": "Zero Hedge",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Durden",
  "authorUrl": "",
  "termIds": [
    1670,
    2576,
    2818,
    305,
    878,
    1043,
    1163,
    5026,
    5407
  ],
  "sentences": [
    "“And if you’re watching this, Dr. Fauci, look out because when the Americans give us control in the House of Representatives, God willing, we’re going to get some answers on behalf of the American people.”\nRoy’s remark came just a few days after Rep. Jim Jordan (R-Ohio), the ranking Republican on the House Judiciary Committee, confirmed to Just The News that the GOP will attempt to investigate Fauci and other federal health officials over how they responded to the COVID-19 pandemic.",
    "In October, Lawrence Tabak, then the NIH’s principal deputy director, said that EcoHealth provided a five-year report on bat coronavirus research under an NIH grant, finding that “in this limited experiment, laboratory mice infected with the SHC014 WIV1 bat coronavirus became sicker than those infected with the WIV1 bat coronavirus.”\nFauci told Sen. Rand Paul (R-Ky.) during a hearing in early 2021 that he “never lied before the Congress” and that the NIH didn’t fund the research.",
    "Fauci was pressed during congressional hearings last year about what some critics say are false or misleading statements about whether his agency, the National Institute of Allergy and Infectious Diseases (NIAID), as well as the National Institutes of Health (NIH), steered taxpayer money to the nonprofit EcoHealth Alliance, which provided funds to scientists at the Wuhan Institute of Virology to research bat coronaviruses.",
    "“That is because they knew from the get-go [that COVID-19] … likely came from a lab, [with] gain-of-function likely done, and our tax dollars were used,” Jordan said, referring to “gain-of-function,” a controversial form of research that alters an organism in a way that may enhance biological functions such as altered transmissibility, pathogenesis, and host range.",
    "Several Republican lawmakers indicated that if the GOP regains a majority in the House of Representatives in the 2022 midterm elections, they plan to open investigations on White House COVID-19 adviser Dr. Anthony Fauci, the Epoch Times reported.",
    "“The framework under which we have guidance about the conduct of research that we fund, the funding at the Wuhan Institute was to be able to determine what is out there in the environment, in bat viruses in China,” Fauci said.",
    "And under those conditions which we have explained very, very clearly, does not constitute research of gain of function of concern.”\nOfficials at NIAID didn’t respond by press time to a request by The Epoch Times for comment.",
    "Jordan added that Republicans, namely, will attempt to obtain information from the federal government and Fauci’s agency on whether COVID-19 had its origins in a lab in Wuhan, in China’s central Hubei Province.",
    "Last September, more than 900 pages of documents detailing the use of federal money by EcoHealth were obtained and published by The Intercept.",
    "Critics said the documents suggest Fauci misled Congress when he said that his agency never funded gain-of-function research in the Wuhan lab.",
    "In October of last year, Fauci told ABC News that he stood by his assertion that the NIH didn’t fund gain-of-function research.",
    "“When are we going to have accountability for Anthony Fauci?” Rep. Chip Roy (R-Texas) said on Fox News over the weekend.",
    "“Look, he’s missing right now for one reason, and one reason only: The Democrats are looking at the polls.\"",
    "“And the research was very strictly under what we call a framework of oversight of the type of research.",
    "“You do not know what you’re talking about, quite frankly,” he told Paul at the time.",
    "“It wasn’t dead Americans that made Democrats move.",
    "It wasn’t dead Americans that made Fauci go away.",
    "And I want to hold Anthony Fauci accountable.",
    "It was polls."
  ]
}