{
  "id": 3461,
  "mediaId": 2764,
  "date": "2022-03-18",
  "headline": "U.S. House Passes CROWN Act to Ban Race-Based Hair Discrimination",
  "image": "https://images.complex.com/complex/images/c_fill,f_auto,g_center,w_1200/fl_lossy,pg_1/kkkluzymn5ofus2cko3b/us-house-passes-crown-act-to-ban-race-based-hair-discrimination",
  "link": "https://www.complex.com/life/us-house-passes-crown-act-to-ban-race-based-hair-discrimination",
  "mediaOutlet": "complex.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joshua Espinoza",
  "authorUrl": "https://www.complex.com/author/joshua-espinoza",
  "termIds": [
    1670,
    3404,
    333,
    1163,
    4887,
    4915,
    5130,
    5382,
    5390
  ],
  "sentences": [
    "Proponents of the CROWN (Creating a Respectful and Open World for Natural Hair) Act say the move will provide more protections for those who are often treated unfairly because of their natural hair texture and/or hairstyles, such as locs, braids, twists, cornrows, and Afros.",
    "“Well, that’s discrimination.”\nA number of states, including California, New York, Washington, Maryland, Virginia, and Colorado, have adopted the CROWN Act, which bans hair discrimination in employment, schools, public accommodations, federally assisted programs, and more.",
    "“The President believes that no person should be denied the ability to obtain a job, succeed in school or the workplace, secure housing, or otherwise exercise their rights based on a hair texture or hair style,” the White House said in a statement this week.",
    "“There are folks in this society who think because your hair is kinky, it is braided, it is in knots or it is not straightened blonde and light brown, that you somehow are not worthy of access,” said Rep. Bonnie Watson Coleman (D-N.J.), the bill’s sponsor.",
    "Several proponents pointed to a 2019 Dove study that found one in five Black women working in an office setting have faced this type of discrimination, and had to alter the hairstyles to feel more comfortable in the workplace.",
    "Pernicious forms of systemic racism persist when dress and grooming codes, for example, prohibit hair texture or hairstyle that is commonly associated with a particular race or national origin.",
    "“Over the course of our Nation’s history, society has used hair texture and hairstyle — along with race, national origin and skin color— to discriminate against individuals.",
    "All but 14 Republicans voted in favor of the CROWN Act, with some calling it unnecessary as well as a distraction from more pressing issues.",
    "Such discrimination has imposed significant economic costs, learning disruption, and denial of economic opportunities for people of color.”",
    "The U.S. House of Representatives has officially passed the CROWN Act, legislation that seeks to prohibit race-based hair discrimination.",
    "“Fourteen months of chaos and we’re doing a bill on hair.”\nThe bill is now headed to the Senate for approval.",
    "It will need to receive support from at least 10 Republicans in order to overcome a legislative filibuster.",
    "According NBC News, lawmakers approved the bill Friday with a vote of 235-189 largely along party lines.",
    "President Joe Biden has urged Congress to pass the bill and send it to his desk.",
    "“This is what the Democrats are focused on,” said Rep. Jim Jordan (R-OH)."
  ]
}