{
  "id": 3477,
  "mediaId": 2626,
  "date": "2022-03-11",
  "headline": "Suns’ Chris Paul Joins Forces With Obamas To Fight ‘Voter Suppression’",
  "image": "https://cdn.mrctv.org/files/styles/large/s3/2022-03/Chris%20Paul_0.jpg?itok=F2scHfCn",
  "link": "https://www.mrctv.org/blog/suns-chris-paul-joins-forces-obamas-fight-voter-suppression",
  "mediaOutlet": "mrctv.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jay Maxson",
  "authorUrl": "https://www.mrctv.org/author/jay-maxson",
  "termIds": [
    1522,
    1670,
    2431,
    2764,
    3070,
    3321,
    3975,
    121,
    458
  ],
  "sentences": [
    "Also, Rep. Jim Jordan (R-Ohio) said last year, \"We know that five states, some of the five key states that were critical in this election, changed their election law in an unconstitutional fashion.”\nIn Arizona, an Obama-appointed judge extended the registration date 18 days despite state law in \"an end-run around the Constitution.\"",
    "Johnson added that “opposite forces” (Republicans) are “afraid of the power of the black vote.”\n“I’m angry that politicians want to silence us — the new voter suppression law in Texas caused thousands of mail-in ballots to be rejected,” Paul said.",
    "When we sit out, someone else is out organizing people or communities who don’t represent us.”\nObama, Paul and company are targeting 30 HBCU campuses in this get out the vote effort, clearly designed to benefit Democrats.",
    "The black-themed ESPN blog, Andscape, reported that Paul will co-chair “a new initiative geared toward increasing voter engagement” at HBCU’s and surrounding black communities ahead of the 2022 mid-term elections.",
    ":\n“This squad challenge, and everything we do at When We All Vote, is about empowering voters — especially young black voters who have historically been left out of the political process.",
    "Her organization will donate up to $3,000 to each student group for voter education initiatives, including so-called “nonpartisan registration drives and canvassing” wink wink.",
    "If there is any doubt about this being an effort to benefit Democrats, Andscape’s social justice warrior/writer Martenzie Johnson dispelled that.",
    "It’s called the “Vote Loud HBCU Squad Challenge,” and it’s connected to the organization Michelle Obama created in in 2018 -- When We All Vote.",
    "We’re seeing voter suppression across the country targeting our community and we know that we have to engage young voters even more right now.",
    "Kool-aid drinker Paul said fighting voter suppression “can be discouraging,” and he won’t let politicians dictate the right of blacks to vote.",
    "That’s why NBA all-star Chris Paul has begun working with the Obamas and Historically Black Colleges and Universities (HBCU’s) to fight what?",
    ":\n“After a 2020 election that featured record voter turnouts, Republicans crafted hundreds of pieces of voter suppression legislation.",
    "The effort is also receiving support from black media companies HBCU Buzz, Watch The Yard and Black Entertainment Television.",
    "That legislation included the purging of voter rolls and implementation of stringent voter ID laws.”\nReally?",
    "Never mind the facts, the Obamas and their basketball pals will forever screech about “voter suppression.”",
    "Democrats used that template “in state after state, setting aside state and constitutional rules,” Cong.",
    "Well Pennsylvania, which went for Joe Biden in 2020, purged 21,000 dead people from its voter rolls.",
    "and Janelle Monae are adding their celebrity power to the Vote Loud HBCU Squad Challenge.",
    "The strategy helped flip Arizona from reliable red state to a Biden win.",
    "Ballot harvesting didn’t help the Democrats enough in 2020.",
    "Paul sent an email to Andscape explaining the challenge.",
    "Nor did a record minority voter turnout in 2020 matter.",
    "The 2020 election broke records for minorities voting.",
    "We all gotta lean in now.”\nNow the rest of the story.",
    "Stephen Curry, Jennifer Lopez and musicians H.E.R.",
    "Neither did the unconstitutional changing of laws.",
    "“I’m frustrated that more people aren’t angry.",
    "That old nemesis: voter suppression.",
    "“Voting is not a spectator sport.",
    "Now is not the time to look away.",
    "Jordan said."
  ]
}