{
  "id": 3481,
  "mediaId": 2548,
  "date": "2022-03-11",
  "headline": "‘You Keep Attacking Me’: Ana Navarro And Stephanie Grisham Share Heated Exchange Over Working For The Trump Admin",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/03/IMG-6291-e1647028679285.jpg",
  "link": "https://dailycaller.com/2022/03/11/ana-navarro-stephanie-grisham-heated-exchange-trump-admin/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Silverio",
  "authorUrl": "https://dailycaller.com/author/nicole.dcnf@gmail.com",
  "termIds": [
    1428,
    2062,
    2201,
    3270,
    354,
    1061,
    1148
  ],
  "sentences": [
    "“I worked for Mrs. Trump, I moved to the West Wing, I saw things I hated, by that time I wanted to leave and I knew—because I’m sorry, people like yourself are so against me that I would not be able to get a job anywhere … I think when you keep attacking me, you’re attacking a lot of people out there who might want an off-ramp.”\nNavarro argued that those who worked and supported Trump need to be held accountable, to which Grisham agreed and said she is trying to change and make sure the former president does not get re-elected.",
    "Grisham, who also served as White House press secretary and communications director, claimed that Trump takes advantage and laughs “behind closed doors” at the people “who truly believe in him.” Navarro objected by pointing out that she remained in his administration for several years.",
    "After ‘there were good people on both sides,’ after the way he treated immigrants, after what he said about Mexicans, after hearing the sexual assault boasts on tape, after seeing him make fun of a disabled reporter?",
    "But I’m sorry, I’m sorry and I want him to be never elected again.”\n“Well, listen, maybe for me, it’s a little personal because I took attacks for four years from people who worked in that White House,” Navarro said.",
    "“The View” co-host Ana Navarro and Stephanie Grisham, who served as Melania Trump’s chief of staff, sparred Friday over previously working for former President Donald Trump’s administration.",
    "(RELATED: ‘The View’ Uses Cuomo Accusations To Bash Trump And Jim Jordan: ‘Enough Is Enough’)\n“I gave it, I gave Tuesday, I will give it again today, that is fine by me,” Grisham replied.",
    "“And I think when you have a party that is so sick, and so divisive, and so harmful to this country, I think standing in that party makes you complicit.”",
    "She said former President George W. Bush supported her community and she hopes for “two healthy parties” who compete for the Hispanic vote.",
    "Co-host Sunny Hostin chimed in, asking how both Navarro and Grisham are still associated with the Republican Party.",
    "Co-host Joy Behar interjected, suggesting to Navarro that change throughout the course of four years is possible.",
    "Navarro then stated that Republicans “antagonize” and Democrats “take advantage” of the Hispanic community.",
    "“So let’s not waste time repeating myself—”\n“I believe people deserve an explanation,” Navarro said.",
    "She then questioned the former chief of staff as to why anyone should believe her after four years.",
    "“You also don’t know the things I stayed in there and stopped,” Grisham responded.",
    "“So if we want to fight this out for the rest of this I’m good to go.",
    "The former chief of staff argued Trump is not a true Republican.",
    "“You know, I think there’s a time to cut bait,” Hostin replied.",
    "“I did cover this, but I’m happy to do it again,” Grisham said.",
    "“For years you heard him do this, right?” Navarro began.",
    "So why did it take so long to find it so objectionable?",
    "You need four years?” Navarro argued.",
    "“Laugh behind closed doors.",
    "“Four years later?"
  ]
}