{
  "id": 3486,
  "mediaId": 2525,
  "date": "2022-03-18",
  "headline": "House passes bill to prohibit discrimination based on hair",
  "image": "https://www.bostonherald.com/wp-content/uploads/2022/03/Congress_Hair_Discrimination_06480.jpg?w=1024&h=683",
  "link": "https://www.bostonherald.com/2022/03/18/house-passes-bill-to-prohibit-discrimination-based-on-hair/",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.bostonherald.com/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "Rep. Ilhan Omar of Minnesota, who is the first Somali-American lawmaker in Congress, called the opposition from her GOP colleagues “quite disheartening.”\nIn addition to Afros, cornrows and twists, the bill mentions protections for other hairstyles and textures of styles that often draw prejudice against Black people.",
    "“There are folks in this society who think because your hair is kinky, it is braided, it is in knots or it is not straightened blonde and light brown, that you somehow are not worthy of access,” Democratic Rep. Bonnie Watson Coleman, the lead sponsor of the bill, said during debate on the House floor.",
    "School administrators told them that the ban on hair extensions had been designed to “foster a culture that emphasizes education rather than style, fashion or materialism.”\nFor refusing to comply, Deanna, a runner who had qualified for the state finals, was kicked off the school track team.",
    "WASHINGTON (AP) — Black people who wear hairstyles like Afros, cornrows or tightly coiled twists should not face bias in society, school and the workplace, the U.S. House said Friday in voting to make it explicit that such discrimination is a violation of federal civil rights law.",
    "“Fourteen months of chaos, and we’re doing a bill on hair.”\nBut House Democrats noted that, in several instances, judges have dismissed civil rights cases on the basis that the law does not directly cover discrimination on the basis of hair.",
    "Supporters pointed to a 2019 study by Dove that showed that 1 in 5 Black women working in office or sales settings have said they had to alter their natural hair.",
    "“Well, that’s discrimination.”\nThe House voted 235-to-189 to prohibit discrimination on the basis of hair texture and hairstyles.",
    "Coleman, a New Jersey Democrat, began to work on the proposal after two incidents of discrimination made national headlines.",
    "The study also found Black students are far more likely to be suspended for dress code or hair violations.",
    "President Joe Biden has already said he would sign the bill, known as the Crown Act, into law.",
    "All but 14 Republicans voted against the measure, calling it unnecessary and a distraction.",
    "In 2017, the twin sisters were told by their high school staff to remove their box braids.",
    "They said protections against hair discrimination already exist in several federal laws.",
    "“This is what the Democrats are focused on,” Ohio Republican Rep. Jim Jordan said.",
    "Mya was removed from the softball team and told she couldn’t attend the prom.",
    "They refused, saying the policy was discriminatory and unevenly enforced.",
    "The bill now goes to the Senate, where its fate is uncertain.",
    "The House bill makes clear that hair is in fact included.",
    "One involved Mya and Deanna Cook of Malden, Mass."
  ]
}