{
  "id": 3490,
  "mediaId": 2747,
  "date": "2022-03-18",
  "headline": "Legislation prohibiting discrimination against Black hair passed by House",
  "image": "https://media.wfaa.com/assets/CCT/images/d3849a5a-81b4-4fe7-b9fb-7f46cc0a3c7f/d3849a5a-81b4-4fe7-b9fb-7f46cc0a3c7f_1140x641.jpg",
  "link": "https://www.wfaa.com/article/news/nation-world/house-passes-crown-act/507-a1652236-c226-429b-8bb5-fc6c86c5c4cb",
  "mediaOutlet": "WFAA ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1864,
    3404,
    3856,
    4427,
    4915,
    5390
  ],
  "sentences": [
    "The bill states that \"people of African descent are deprived of educational and employment opportunities.”\nBlack hair's tight curls and kinks means that many Black Americans choose to wear their hair naturally or in distinctive protective styles such as locs, cornrows, twists, braids, Bantu knots, or Afros.",
    "\"It's important to the young girls and the young boys who have to cut their hair in the middle of a wrestling match in front of everyone because some white referee says that your hair is inappropriate to engage in your match,\" Watson said.",
    "Before the vote, Watson outlined her reasoning for the bill, invoking memories of Andrew Johnson, a New Jersey high school wrestler who was forced to cut his dreadlocks by a referee in 2019 if he wished to continue competing in a match.",
    "\"Fourteen months of chaos and we're doing a bill on hair,\" Rep. Jim Jordan, R-Ohio, said Friday, adding, \"I hope we can actually focus on the things that matter to the American people.\"",
    "But nationwide, there have been several instances of schools banning these hairstyles or employees losing their jobs for refusing to cut their hair.",
    "WASHINGTON — The House of Representatives approved new legislation on Friday that would ban discrimination based on hair texture and style.",
    "Republican Lauren Boebert of Colorado had previously described the legislation as the \"bad hair bill,\" leading to widespread criticism.",
    "Gwen Moore, D-Wisconsin, described how someone had told a previous employer that she was \"an embarrassment\" because of her hairstyle.",
    "Boebert's office later said that the congresswoman meant to label it as a \"bad, hair bill,\" the comma being the key difference.",
    "Several Black and African-American House members described their own experiences with hair discrimination before the vote.",
    "The bill passed along party lines with a vote of 235-189, and was introduced by Rep. Bonnie Watson Coleman, D-N.J.",
    "2116, is known as the CROWN Act 2021, an acronym for \"Creating a Respectful and Open World for Natural Hair.\"",
    "In recent years, several states have enacted their own CROWN acts or have introduced similar legislation.",
    "Republican lawmakers have been critical of the legislation.",
    "It now heads to the Senate floor for consideration.",
    "The measure, H.R."
  ]
}