{
  "id": 3498,
  "mediaId": 2771,
  "date": "2022-03-18",
  "headline": "AIPAC’s far-right endorsements show how out of touch they are with American Jews",
  "image": "https://images.forwardcdn.com/image/1300x/center/images/cropped/aipac-pompeo-2019-1647621051.jpg",
  "link": "https://forward.com/opinion/484198/aipacs-far-right-endorsements-show-out-of-touch-with-american-jews/",
  "mediaOutlet": "Forward",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Wolfson",
  "authorUrl": "https://forward.com/authors/nathan-wolfson/",
  "termIds": [
    1670,
    2201,
    41,
    515,
    5049,
    5371
  ],
  "sentences": [
    "I know firsthand from working in the Israel advocacy space that American Jews largely support liberal values: Polling has shown that our community broadly would like to see a reentry to the Iran nuclear deal, yet AIPAC has spent much of their political capital opposing it while championing the disastrous ‘maximum pressure’ policies of President Donald Trump.",
    "When AIPAC recently released its first slate of endorsements for the 2022 elections, even some of the group’s own former leaders and supporters were stunned to see the inclusion of 37 representatives who had voted to overturn the results of the 2020 election immediately after insurrectionists attacked the Capitol on Jan 6.",
    "Now, AIPAC’s new Political Action Committee has formally endorsed dozens of right-wing members of Congress whose actions and rhetoric target American democracy and pluralism itself, endangering minority populations including American Jews and almost everything we hold dear.",
    "Polling also shows a clear majority of American Jews support strong U.S. leadership toward a two-state solution, yet AIPAC works to ensure blanket support for Israeli government policies that entrench the conflict and undermine the prospects for peace.",
    "That’s why I cannot stand idly by when an organization that claims to speak for me — and claims to support American and Israeli democracy — endorses candidates such as Jim Jordan of Ohio who have excused and justified insurrection.",
    "Over the years, I have watched as AIPAC, an organization that touts itself as pro-Israel, has taken actions that are contrary to what the majority of pro-Israel American Jews actually believe in, and to the values we hold.",
    "AIPAC has defended the decision to endorse antidemocratic candidates by stating that they are “a single-issue organization” which cannot be expected to care about anything besides support for Israel (as AIPAC defines it).",
    "By Jim Watson/AFP via Getty Images\nAs the grandchild of Holocaust survivors, I’ll never forget seeing insurrectionists with Nazi regalia marching 20 feet from my home during the Jan. 6 insurrection at the Capitol.",
    "Yet they have now endorsed some of the most virulently anti-gay lawmakers in the entire country — Members of Congress who belittle and discriminate against LGBTQ+ people through rhetoric and legislation.",
    "No one can stop AIPAC from endorsing antidemocratic, bigoted extremists like Jim Jordan simply because those members are willing to defend the occupation and attack the Iran nuclear agreement.",
    "They have hosted receptions for the LGBTQ+ community, and are currently running ads on social media that call on supporters to stand up for gay rights by supporting the US-Israel relationship.",
    "Those of us who are prepared to stand up and fight for democracy, justice and equality in the U.S. and in Israel should continue to make clear that AIPAC does not speak for us.",
    "It’s shocking to see a prominent pro-Israel organization endorse and fundraise for candidates who endorse Trump’s ‘Big Lie’ and voted to reject the will of the people.",
    "But they cannot do so while also claiming to care about democracy or basic human rights — or while claiming to represent the American Jewish or pro-Israel community.",
    "Yet standing against our democracy itself isn’t another mere policy choice by these lawmakers — it’s a rejection of our entire system of free and open government.",
    "In reality, AIPAC’s claim to be a “single issue” organization has not stopped them from claiming to care about other important concerns, like LGBTQ+ rights.",
    "My wife did not leave the apartment for four days, and didn’t feel comfortable walking in our neighborhood after dark for three months.",
    "The shared values that are meant to undergird the U. S-Israel relationship are built on the foundation of a stable democracy.",
    "The views and opinions expressed in this article are the author’s own and do not necessarily reflect those of the Forward.",
    "American Jews know all too well where this horrifying brand of antidemocratic, ethnonationalist politics can lead.",
    "I’ll never forget locking myself in my apartment with my wife and dog, unsure whether we’d have to flee the city.",
    "The vast majority of American Jews despised, feared and voted against former president Trump (twice).",
    "Whether in our own country or elsewhere around the world, we know we can never ignore or excuse it.",
    "There can be no reasonable explanation for endorsing and funding extremists who threaten it.",
    "These are not the “shared values” that create the foundation of the US-Israel relationship.",
    "Yet when he spoke at AIPAC’s conference in 2016, he was greeted with a standing ovation.",
    "At a pivotal moment in American and Jewish history, AIPAC has failed a key moral test.",
    "Discover more perspective in Opinion."
  ]
}