{
  "id": 3591,
  "mediaId": 2690,
  "date": "2022-03-13",
  "headline": "FBI Whistleblower Raises Questions About Pipe Bombs Set Near DNC, RNC Headquarters: Jim Jordan",
  "image": "https://www.nydailynews.com/resizer/l2qBZ9IJ4a2p11cUULpGXBaJp6U=/800x450/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/UZQ7XGLXFVEP3A7VMOUUYLEECU.jpg",
  "link": "https://teapartyorg.ning.com/forum/fbi-whistleblower-raises-questions-about-pipe-bombs-set-near-dnc-?commentId=7928364%3AComment%3A3003090",
  "mediaOutlet": "teapartyorg.ning.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Admin Dee",
  "authorUrl": "https://teapartyorg.ning.com/members/AdminDee",
  "termIds": [
    1670,
    2780,
    304,
    370,
    877,
    1161,
    1220
  ],
  "sentences": [
    "'”\nJordan said the special agent had described the request as “unusual” because it “was transmitted more than a year after the FBI had begun the investigation, and it raises questions about the progress and extent of the FBI’s investigation.”\nread more:\nhttps://www.theepochtimes.com/republicans-request-fbi-briefing-after-whistleblower-raises-questions-about-investigation-of-pipe-bombs-set-near-dnc-rnc-headquarters_4328482.html?utm_medium=social&utm_source=twitter&utm_campaign=digitalsub",
    "Rep. Jim Jordan (R-Ohio) says that he has requested a briefing with the FBI after a whistleblower allegedly disclosed information regarding the bureau’s investigation into pipe bombs planted near the Democratic National Committee and Republican National Committee headquarters in Washington on the night before the Jan. 6, 2021, breach of the U.S. Capitol.",
    "“According to the special agent, on February 7, 2022—over a year after the placement of the bombs—the FBI’s Washington Field Office asked FBI field offices to canvass all confidential human sources nationwide for information about the individual and the crime,” Jordan wrote in the letter.",
    "Jordan, the ranking Republican member of the House Judiciary Committee, sent a letter to FBI Director Christopher Wray on March 9 after a senior FBI special agent came forward with information regarding an “unusual” request from the FBI’s Washington Field Office.",
    "“In part, the message asked that the canvass ‘include sources reporting on all [types of] threats’ because the suspect’s ‘motive and ideology remain unknown."
  ]
}