{
  "id": 3627,
  "mediaId": 4038,
  "date": "2022-03-10",
  "headline": "GOP: A Trump Investigation From Biden Will Result In Political Civil War",
  "image": "https://patriotnewsdaily.com/wp-content/uploads/2022/03/download-65-620x330.jpg",
  "link": "https://patriotnewsdaily.com/gop-a-trump-investigation-from-biden-will-result-in-political-civil-war/",
  "mediaOutlet": "patriotnewsdaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Sheridan",
  "authorUrl": "https://patriotnewsdaily.com/author/bill-sheridan/",
  "termIds": [
    1934,
    2201,
    2599,
    3975,
    4412,
    3,
    878,
    1132
  ],
  "sentences": [
    "The GOP has laid down the gauntlet and says that any attempt to open a criminal investigation by the Biden Justice Department into former president Donald Trump will result in all-out political “civil war.”\nLeading Republican lawmakers have said that any Department of Justice prosecution of former President Trump will turn into a major political battle, setting a high bar for Attorney General Merrick Garland to act on an expected criminal referral from the House’s Jan. 6 committee.",
    "Nobody is proud of what happened on Jan. 6, but people are like, ‘With all the problems we have going on in the country right now, this is going to be the focus of the Democrats?’ “\nThe likelihood of stirring up a major political firestorm with a federal investigation of Trump could serve as a powerful disincentive for the Justice Department moving forward if it does indeed receive a recommendation to prosecute Trump from the Jan. 6 committee.",
    "“The bar that the House committee has is far lower than anything that would ultimately result in moving forward with a federal investigation and a conviction.”\nRepublican strategists close to Trump are predicting a battle royale if the Department of Justice moves to indict the former president – one that would ultimately bite the Dems in their collective political posteriors.",
    "But Republican lawmakers and strategists warn that any federal prosecution of Trump will be accused of being politically motivated, only boost Trump’s standing within the GOP and turn into a partisan “civil war” at a time when President Biden is trying to keep his 2020 campaign promise to unify the country while his poll numbers steadily drop.",
    "The House select committee investigating the Jan. 6 attack on the Capitol previewed its likely referral to the Justice Department in a court filing recently made public, and experts say the evidence assembled by House investigators could provide a strong impetus for prosecutors to act.",
    "They worry that the former president would seize on an acquittal as complete vindication, much like he did after former special counsel Robert Mueller declined to bring charges after investigating allegations of collusion between Russian officials and the Trump campaign in 2016.",
    "Doing so would likely be a mistake, one that would totally scuttle the Democrats’ already sinking chances in the midterms and would likely only further tank Biden’s rapidly plummeting popularity – and in that case, I say, “bring it on!”",
    "Sen. Thom Tillis (R-N.C.) said, “the Department of Justice has a high bar” to clear before launching an investigation of Trump and raised concerns over the partisan fighting that surrounded the formation of the Jan. 6 committee.",
    "Biden privately told advisers after his victory in the 2020 election that he didn’t want his presidency consumed by investigations of Trump, NBC News reported at the time, citing five people familiar with the discussions.",
    "Braun said Democrats are scrambling to change up the political narrative in response to Biden’s dismal job approval ratings and predicted launching a federal prosecution of Trump would be viewed along partisan lines.",
    "“It’s going to be perceived as political.”\n“Everybody is going to perceive the referral as a conviction on one side, and they’re going to view it as the continuation of a witch hunt on the other side,” he added.",
    "Tillis recalled how Speaker Nancy Pelosi (D-Calif.) blocked House Minority Leader Kevin McCarthy’s (R-Calif.) picks to serve on the panel, Reps. Jim Jordan (R-Ohio) and Jim Banks (R-Ind.).",
    "“I don’t mind looking into the events, but I think that Speaker Pelosi did not do the process justice by the way the members were ultimately seated,” Tillis said.",
    "said any criminal referral from the House “would probably have as much political taint on it as you can get.”\n“To me, it’s clearly politically driven,” he said.",
    "Furthermore, many Democratic senators privately caution that should Garland decide to move forward; he needs to win any case that he brings against Trump.",
    "So, Garland has much to consider when weighing the risks vs. the benefits of bringing any kind of criminal charges against Donald Trump regarding Jan. 6.",
    "Promoted Content\n“I think it could backfire in a way that they have no clue,” said Republican pollster Jim McLaughlin.",
    "“I think it’s going to backfire because it’s just so political, and it’s tainted.",
    "“At least half the country would say it’s all politically motivated,” he said.",
    "“The country wants to move on.",
    "Sen. Mike Braun (R-Ind.)"
  ]
}