{
  "id": 3631,
  "mediaId": 2744,
  "date": "2022-03-15",
  "headline": "WATCH: GOP lawmakers say Democrats playing 'out of touch' political games",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/c616e61/2147483647/strip/true/crop/4974x2611+0+353/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fc0%2F57%2F6764d61547138a71b2dab734ccd8%2Fap19302706982538.jpg",
  "link": "https://www.washingtonexaminer.com/news/watch-gop-lawmakers-say-democrats-playing-out-of-touch-political-games",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather Hamilton",
  "authorUrl": "https://www.washingtonexaminer.com/author/heather-hamilton",
  "termIds": [
    1584,
    1670,
    2201,
    3797,
    3975,
    305,
    878
  ],
  "sentences": [
    "Congress needs to lead the way, not follow and be the very last to do it.”\nJordan said Democrats don't want to show up for work even though workers have to show up for “first, second, and third shifts.”\n“Democrats have closed the Capitol, allowed proxy voting, kicked Republicans off committees, won’t allow Republicans to serve on the select committee, for the first time in history trying to end the Electoral College, trying to end the filibuster, trying to pack the court, and they have the nerve to say that it’s Republicans and Donald Trump who are who are a threat to democracy,” Jordan said.",
    "“I want that kind of guy back in the Oval Office, particularly now, when we see that the Biden administration hasn’t done one thing right in the 14 months that they have run the government.”\nJordan said he believes Trump would not only win the Republican presidential primary but also the general election, should he choose to run.",
    "When asked by Fox News’s Laura Ingraham about the slow reopening of the U.S. Capitol, the transportation mask mandate, and congressional proxy voting Monday, the congressmen said the Democratic policies are nothing more than a string of power grabs.",
    "I mean, this is how out of touch they are with normal Americans.”\nJordan argued that the partial reopening of the Capitol on March 28 is a political ploy, as the timing coincides with the kickoff of campaign season for the midterm elections.",
    "“[Trump] has proven that he can go to the swamp, do what he said he’d do, get things done for ‘We the People’ — not for the swamp, but for the American people — and he did it with everyone in that town against him,” Jordan said.",
    "That’s why I think a big change is coming this fall.”\nIngraham sarcastically blamed all of Jordan’s concerns on Russian President Vladimir Putin and the war in Ukraine, alluding to a White House defense for rising gas prices.",
    "We could have lower gas prices tomorrow and take money out of Putin’s pocket so he won’t have the ability to fund this war.”\nJordan added that he hopes and believes Trump will run again for president in 2024.",
    "“They want to control people’s lives.”\nScalise noted that mask mandates have been lifted in many states, regardless of the party in power, and that the majority of the country’s venues have reopened.",
    "Just In...\nRepublican Reps. Steve Scalise and Jim Jordan blasted Democrats for their handling of COVID-19, the economy, and the war in Ukraine.",
    "“[Biden] could open up the spigots tomorrow for American energy and undermine Putin’s leverage on oil and gas,” Scalise said in response.",
    "“They still can’t let go of the power,” Scalise said, referring to President Joe Biden and Democratic members of Congress.",
    "However, the Capitol will only open later this month and with a limited number of people allowed to enter.",
    "Let the public back in.”\nJordan told Ingraham that the Democrats are “out of touch” with the public.",
    "The idea of continuing the House's proxy voting also drew Scalise's and Jordan’s ire.",
    "He loves getting oil from dictators, whether it’s Putin, Iran, Venezuela.",
    "Stop dealing with dictators and just look at what’s beneath our feet.",
    "“They still want to keep things closed in D.C.,” Scalise added.",
    "“And now that they’ve made gas $5 a gallon, what do they do?",
    "As Jordan said, they’re doing it all across the country.",
    "They’ve canceled pipelines,” Jordan rattled off.",
    "“It’s time to open up the People’s House.",
    "Make everyone show up for work again.",
    "People are so sick of their baloney.",
    "“We need to end this,” Scalise said.",
    "They tell us all to go buy a Tesla.",
    "He’s begging other dictators.",
    "“Give me a stinking break.",
    "“Make Congress work again.",
    "“They defunded the police.",
    "They’ve opened the border.",
    "Open up American energy.",
    "They’ve closed schools.",
    "“He won’t do it."
  ]
}