{
  "id": 3684,
  "mediaId": 2664,
  "date": "2022-03-01",
  "headline": "Jim Jordan promises to investigate Dr. Fauci if GOP retakes the House this year",
  "image": "https://www.rawstory.com/media-library/trump-loving-congressman-jim-jordan-suggests-ohio-state-sex-abuse-scandal-is-a-left-wing-conspiracy.jpg?id=24479973&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/jim-jordan-promises-to-investigate-dr-fauci-if-gop-retakes-the-house-this-year/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.rawstory.com/u/jonskolniksalon",
  "termIds": [
    1670,
    2201,
    2403,
    2576,
    878,
    1163,
    1181,
    1248
  ],
  "sentences": [
    "At the center of this theory is the allegation that the National Institutes of Health (NIH) at one point provided a grant to the Wuhan Institute of Virology for \"gain-of-function\" research, a process in which a virus is genetically altered in order to anticipate ways it may mutate in the future.",
    "\"What happens when [Paul] gets out and accuses me of things that are completely untrue is that all of a sudden that kindles the crazies out there, and I have threats upon my life, harassment of my family and my children, with obscene phone calls because people are lying about me.\"",
    "Jordan, an ardent supporter of Donald Trump, has been one of the leading Republican proponents of the \"lab leak\" theory, the unproven and dubious notion that the coronavirus was leaked, accidentally or otherwise, from the Wuhan Institute of Virology in China.",
    "Supporters of the lab leak theory contend, by that logic, that the coronavirus which causes COVID-19 is a man-made \"supervirus,\" generated in a lab, whose origins have been covered up by leading health officials, including Fauci.",
    "Rep. Jim Jordan, R-Ohio, on Tuesday said that investigating Dr. Anthony Fauci, the country's leading expert on infectious disease, will be one of his top priorities if the GOP retakes the House in this year's midterm elections.",
    "\"When you look at all of the evidence together, it's an extraordinarily clear picture that the pandemic started at the Huanan market,\" said Michael Worobey, an evolutionary biologist at the University of Arizona.",
    "The probe, Jordan told Just the News, will aim to untangle \"all the lies [and] the misinformation, the disinformation\" that he claims Fauci has spread about the origins of the COVID-19 virus.",
    "During a Senate hearing just last month, Fauci and Sen. Rand Paul, R-Ky., got into a heated exchange over the matter, with Fauci accusing Paul of promoting the theory for political reasons.",
    "\"That is because they knew from the get-go [coronavirus] came from the lab, likely came from a lab, gain-of-function likely done, and our tax dollars were used,\" the lawmaker added.",
    "This 'new' info is from the same crew that told Fauci it came from a lab but suspiciously changed their tune and were rewarded with a 9 million dollar grant.\"",
    "According to the Times, the two novel studies have been verified by multiple independent experts, which renders the lab leak increasingly unlikely.",
    "On Sunday, the New York Times cited two extensive new studies backing the idea that COVID-19 originated from a live animal market in Wuhan, China.",
    "The dearth of evidence for the claim hasn't stopped conservatives from repeatedly accusing Fauci of masterminding the pandemic.",
    "Furthermore, most scientists have concluded that the lab leak theory is unlikely, although it cannot entirely be ruled out.",
    "Jordan appeared unconvinced, writing of the report this week: \"These aren't new facts or new studies.",
    "\"You are making a catastrophic epidemic for your political gain,\" Fauci told the senator at the time.",
    "According to the Washington Post, there is no clear evidence that the NIH funded any such research.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "This was largely the consensus earlier into the pandemic.",
    "Subscribe to our morning newsletter, Crash Course."
  ]
}