{
  "id": 3760,
  "mediaId": 2745,
  "date": "2022-03-04",
  "headline": "The Roger Stone tapes",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5CS6ENE2QEI6ZGMHTXHO4YVD6Y.jpg&w=1200",
  "link": "https://www.washingtonpost.com/investigations/interactive/2022/roger-stone-documentary-capitol-riot-trump-election/?utm_source=rss&utm_medium=referral&utm_campaign=wp_national",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Stone said in his statement to The Post that its questions for this article were “typical of the Washington Post’s coverage over the last two years in which your newspaper insisted that I was a Russian Intelligence asset in league with Wikileaks to aide the Trump campaign — a lie.”\nA day before the announcement that Stone’s sentence was commuted, the Danish filmmakers’ footage shows, he told his staffer Enrique Alejandro that Trump should use the powers of his office to reject official results in that year’s election and secure victory in the courts with help from federal judges who owed him fealty.",
    "Stone was transported and guarded on Jan. 5 by multiple Oath Keepers, the filmmakers’ footage and other video posted online show, and four Oath Keepers escorted Stone back to the Willard after his speech at about 8 p.m.\nTwo of the Oath Keepers who were with Stone, Joshua James and Brian Ulrich, were later charged with seditious conspiracy after allegedly storming the Capitol.",
    "A federal judge considering lawsuits filed against Trump by Democrats and Capitol Police officers over the Jan. 6 riot said in an order in February that Stone’s connection to Trump, the Proud Boys and the Oath Keepers may prove to be “an important one.”\nStone did not permit the filmmakers to record him for a 90-minute period covering the height of the violence on Jan. 6.",
    "Without providing specifics, Stone accused The Post of employing “a clever blend of ‘guilt by association,’ insinuations, half truths, anonymous claims, falsehoods and out of context trick questions.” He suggested that video clips of him reviewed for this article could be “deep fakes.”\n“You attribute things to me I never said,” Stone wrote, without citing any examples.",
    "He predicted to another aide that his brand was about to be “quite a bit hotter” as a result, adding, “We’re going to raise money from Stop the Steal — it will be like falling off a log.”\nThat day, working from a desk in his office and surrounded by Nixon memorabilia, Stone directed aides to recruit retired military and law enforcement officials for Stop the Steal.",
    "In his statement to The Post, Stone wrote, “Your assertions regarding my text messages or Signal messages only proves the leaking of the partisan Jan 6 witch hunt or illegal methods of collection on your part.”\nOn Nov. 5, Stone drew up a Stop the Steal action plan that was visible on Alejandro’s laptop in footage captured by the filmmakers.",
    "“Those who make peaceful progress impossible make violent revolution inevitable.”\nStone had said he expected to attend a meeting with administration officials on pardons that had been pushed back to 6 p.m. because Trump had “ruined the schedule for the day.” But following the riot, Stone and Davis left D.C. for the private flight.",
    "After he left Washington, Stone lobbied for Trump to enact the “Stone Plan” — a blanket presidential pardon to shield himself, Trump’s allies in Congress and “the America First movement” from prosecution for trying to overturn the election, according to the footage and additional documents reviewed by The Post.",
    "Schoen reported back that he spoke with both Trump and White House Chief of Staff Mark Meadows, saying the president telephoned him for what he called a “long call” and a “great call.”\nSchoen told The Post that the calls with Trump and Meadows were focused on him joining Trump’s impeachment defense team.",
    "And Stone unloaded on Donald Trump, saying he had betrayed his friends, deserved to be impeached and was the “greatest single mistake in American history.”\nStone added that Trump might be vulnerable to prosecution by federal authorities in Manhattan after declining to preemptively pardon himself.",
    "“When you can’t get a fair and honest judicial opinion, when you can’t get a fair, honest and transparent election, when your legislative process is constipated by fear and threat,” he said, trailing off for a moment before slightly misquoting former president John F. Kennedy.",
    "Stone said Kushner needed to be “punished in the most brutal possible way” and would be “brain dead when I get finished with him.”\nStone told Tom that Cipollone was “a target” and that he would spend money to advertise Cipollone’s home address, which he apparently did not do.",
    "In addition to interviews and moments when Stone spoke directly to the camera, they also captured fly-on-the-wall footage of his actions, candid off-camera conversations from a microphone he wore and views of his iPhone screen as he messaged associates on an encrypted app.",
    "(Frederik Marbell/\"A Storm Foretold\")\nIn early January, the filmmakers rejoined Stone as he and thousands of others poured into D.C. for rallies aimed at pressing Vice President Mike Pence and Republicans in Congress to block the certification of Joe Biden’s victory.",
    "He also lamented the president’s refusal to pardon the former Colombo crime family members, noting they had been “vocal Trump supporters.”\nSchoen told The Post that he never asked Trump to pardon anyone and was not aware of Stone’s plan for multiple pardons.",
    "The footage, along with other reporting by The Post, provides the most comprehensive account to date of Stone’s involvement in the former president’s effort to overturn the election and in the rallies in Washington that spilled over into violence on Jan. 6.",
    "['My heart stopped beating for three minutes': How the filmmakers secured Stone's cooperation]\nStone has refused to give testimony and evidence to the House committee investigating the Jan. 6 attack, citing his rights under the Fifth Amendment.",
    "James, one of the Oath Keepers seen guarding Stone, told a fellow Oath Keeper late on the morning of Jan. 6 that the speaker he was protecting was “angry because he was not getting VIP treatment,” according to an FBI report filed to court.",
    "The filmmakers told The Post that Stone appeared to change his plans after an encounter in the Willard lobby around 10 a.m. with Bernard Kerik, a former New York City police commissioner working in Giuliani’s command center at the hotel.",
    "And you either fight with us or you get slashed.”\nAn attorney for Alexander, Paul Kamenar, told The Post that Alexander and Stone were “friends and brothers-in-Christ” but had no part in the violence on Jan. 6 and did not anticipate it.",
    "He privately strategized with former national security adviser Michael Flynn and rally organizer Ali Alexander, who visited Stone’s home in Fort Lauderdale, Fla., in late November 2020 for a dinner where Stone served pasta and martinis.",
    "“I just told her, ‘You spent 300 grand and neither Jones nor I are speaking.’ ”\nFancelli gave $300,000 to Women for America First, The Post previously reported, along with another $350,000 to two other groups that promoted the events.",
    "Stone’s relationship with Trump took on a lower profile after it came under scrutiny by special counsel Robert S. Mueller III, who probed Stone’s communications regarding Wikileaks after it published hacked Democratic Party emails.",
    "He became notorious for dishonest political attacks when Watergate investigators revealed he was paid to carry out “dirty tricks” for President Richard M. Nixon’s 1972 reelection campaign, though he was not charged with any crime.",
    "“One man’s dirty trickster is another man’s freedom fighter,” he wrote in his 2018 book “Stone’s Rules,” a collection of career lessons including how voters will believe a “big lie” if it is kept simple and repeated often enough.",
    "“Now he didn’t want to go to the Ellipse to see Trump speak.”\nAfter Kerik left, the footage shows, Davis griped that Kerik had previously misled her by saying he would be dealing with a personal matter away from D.C. that day.",
    "Stone privately coordinated post-election protests with prominent figures, and in January he communicated by text message with leaders of far-right groups that had been involved in the attack on the Capitol, the footage shows.",
    "But the plan, along with a bid by Stone to win pardons for other Trump backers including convicted mobsters, was ultimately thwarted by White House counsel Pat Cipollone, Stone said in several conversations that were filmed.",
    "Jordan has never spoken to Roger Stone about pardons and he never sought a pardon because he did nothing wrong.”\nMonths later, Gaetz’s campaign paid $20,000 to a Delaware firm formed by Stone, campaign finance reports show.",
    "A second person, who was an administration official at the time, said Trump was considering at least some of Stone’s pardons, but added that Stone’s candidates were among many Trump was considering during a frenzied time.",
    "In an Inauguration Day call with a friend, Stone directed his rage at the man who had confided in him and consulted with him for decades, denouncing Trump as “a disgrace” and expressing support for him to be impeached.",
    "“Any claim, assertion or implication that I knew about, was involved in or condoned the illegal acts at the Capitol on Jan 6 is categorically false and there is no witness or document that proves otherwise,” he wrote.",
    "Stone used an encrypted messaging app later in January to communicate with Oath Keepers leader Stewart Rhodes, who is also charged with seditious conspiracy, and Proud Boys leader Enrique Tarrio, the footage shows.",
    "He wrapped his tailored suits in trash bags, reversed his black face mask so its “Free Roger Stone” logo was hidden, then slipped out of town for a hastily arranged private flight from Dulles International Airport.",
    "As the filmmakers drove him to his makeshift office space in a strip mall near his home, Stone told one associate to create an account for hunting election fraud on an encrypted email service to avoid surveillance.",
    "Later in 2021, Greenberg agreed to a plea deal and to cooperate with investigators on inquiries into possible sex offenses allegedly involving Gaetz, previously a friend of his, The Post and other outlets reported.",
    "During a small Stop the Steal protest in Atlanta on Nov. 20, Alexander patched Stone in via phone for a speech in which he thanked “my friend there, Ali,” cellphone video from the scene reviewed by The Post shows.",
    "Stone reminded Trump that he had asked for names of clemency candidates who had been “persecuted because of their support for Trump.” Brown served as a labor coordinator for Trump’s 2016 campaign, Stone explained.",
    "The person who confirmed Cipollone’s opposition to the plan said he particularly objected to preemptive pardons for Republicans in Congress who had not been charged with crimes nor sought pardons themselves.",
    "Alexander celebrated on a live stream, promoting the Jan. 6 rally and boasting of what he and Stone could achieve “now that we can work together publicly.”\n“Roger’s fully in the fight now,” Alexander said.",
    "The funds were directed to an online account in the name of a lawyer who has worked extensively with Stone, according to the person, who spoke on the condition of anonymity to discuss confidential matters.",
    "As a mob ransacked the Capitol on Jan. 6, 2021, Roger Stone, Donald Trump’s longest-serving political adviser, hurried to pack a suitcase inside his elegant suite on the fifth floor of the Willard hotel.",
    "On Jan. 15, Stone told the filmmakers he endorsed a proposal — one that was then not publicly known — for Trump to install Jeffrey Clark, a loyal senior Justice Department official, as attorney general.",
    "Stone was filmed telling a friend over the phone that he had pressed Trump to enact the plan in two telephone conversations, adding that he raised the cases of “Gaetz and others” during the second call.",
    "His aide Kristin M. Davis was filmed apparently struggling to reach organizers by phone to secure VIP access, and Stone said in footage that they could not otherwise get from the Willard to the stage.",
    "At about 8:50 p.m. on Jan. 5, after the Danish filmmakers had left him, Stone exited the Willard again with his bodyguard, off-duty New York City police officer Sal Greco, a live-stream video shows.",
    "Early on Jan. 6, as thousands gathered on the Ellipse just south of the White House, Stone tended to a side business: helping felons get requests for pardons on Trump’s desk before he left office.",
    "Stone frequently complained to the Danish filmmakers about reports that inaccurately called him a “self-described” dirty trickster, but he remains unapologetic for doing whatever necessary to win.",
    "“At this point I’d be happy if he pardoned me and Kerik again,” Stone told Schoen later in the same exchange, claiming Trump “would take no heat for it whatsoever” as he had pardoned them before.",
    "Cipollone was aware of Stone’s requests for pardons and opposed them, according to a person familiar with the situation, who spoke on the condition of anonymity to discuss confidential matters.",
    "A few hours before the Jan. 6 attack, the video shows, a member of the far-right Oath Keepers group — who has since pleaded guilty to seditious conspiracy — was in Stone’s suite at the Willard.",
    "Stone’s plan also proposed a pardon for former Seminole County, Fla., tax collector Joel Greenberg (R), who had been indicted on charges that included the sex trafficking of an underage girl.",
    "Stone’s top priority was protection for himself and Kerik, who had been previously pardoned by Trump for felonies including tax fraud before he worked on the effort to overturn the election.",
    "Stone’s pardon wish list also included Michael Sessa and Victor Orena, former members of the Colombo crime family serving life sentences for murder and racketeering convictions in the 1990s.",
    "In a recorded conversation, as an aide spoke of driving trucks into crowds of racial justice protesters, Stone said: “Once there’s no more election, there’s no reason why we can’t mix it up.",
    "In a social media post soon after their Dec. 27 meeting, Stone wrote that he had advised Trump on “exactly how” he could remain in power and prosecute Democrats for stealing the election.",
    "Other rooms in the same hotel were used as a “command center” by Trump’s personal lawyer Rudolph W. Giuliani and other advisers involved in the fractious battle to overturn the election.",
    "Much media focus instead fell on Alexander, a young right-wing operative who had launched his own Stop the Steal effort and was traveling the country addressing crowds with a bullhorn.",
    "After an inaudible response from Flynn, Stone replied: “Well, we both know he often does things he shouldn’t do.”\nThat evening, Trump gave a speech from the White House briefing room.",
    "Stone was added to the top tier of the lineup for Alexander’s Wild Protest, which eventually joined forces with a parallel Jan. 6 organizing effort led by Women for America First.",
    "“When Hillary Clinton sought to stop the certification of Trump’s election by the Electoral College in 2017 the Washington Post found it neither seditious or illegal,” he wrote.",
    "The filmmakers did not capture conversations between Stone and Trump, but on several occasions, Stone told them or his associates that he remained in contact with the president.",
    "The man said they were “willing to pay up to $100,000,” but stressed: “Everything would have to be legal.”\n“Actually, it is legal,” Stone said of such arrangements, accurately.",
    "I’m challenging all of it, and the judges we’re going to are judges I appointed.’ ”\nOn election night, Nov. 3, Stone attended a party in Fort Lauderdale thrown by an associate.",
    "That evening, as the filmmakers recorded him puffing on a cigar in a smoke-filled Fort Lauderdale bar, Macabi Havana Lounge, Stone commiserated via Signal with an associate.",
    "“If I didn’t have a really good chance of getting this done, I wouldn’t take the money,” Stone said, claiming he was to meet officials involved in the process that evening.",
    "Around noon, as Trump began his 71-minute rally speech, Stone watched on TV in his hotel suite with a group of guests including Pastor Mark Burns, a faith adviser to Trump.",
    "That year, Stone founded the “Stop the Steal” initiative to fight efforts by some Republicans to wrest the presidential nomination from Trump at their national convention.",
    "Stone, who was then still seeking a pardon, wrote in a Nov. 30 blog post that he was “not a participant” in any of the organizations using the Stop the Steal name in 2020.",
    "“If the electors show up at the electoral college, armed guards will throw them out,” he said, apparently referring to ceremonial meetings of electors in state capitals.",
    "Stone’s activity was part of a bustling market at the time, in which well-connected lobbyists, lawyers and others brokered large fees to seek clemency for their clients.",
    "Reporters from The Washington Post reviewed more than 20 hours of video filmed for the documentary, “A Storm Foretold,” which is expected to be released later this year.",
    "“I really want to get out of here,” Stone told an aide, as they were filmed at the hotel by a Danish camera crew for a documentary on the veteran Republican operative.",
    "Kushner and his wife, Ivanka Trump, had recently bought a $32 million lot on Indian Creek Island, a gated village in Biscayne Bay off Miami, and rented a condo nearby.",
    "Stone argued Brown’s case in a letter to Trump that he began drafting soon after the two met at the president’s golf club in West Palm Beach, Fla., on Dec. 27, 2020.",
    "Among the organizers were associates of former Trump adviser Stephen K. Bannon, who had angered Stone by testifying against him at his trial in the obstruction case.",
    "I’m not sure what they thought they were going to achieve.”\nIn the same breath, however, he suggested that the violence was the inevitable result of election theft.",
    "Speaking to the filmmakers, Stone likened Trump’s obligation to his followers to Franklin D. Roosevelt’s responsibility to rescue Jewish people from the Holocaust.",
    "Stone told Davis he had complained to Julie Fancelli, the Publix supermarket heiress, that organizers had prevented him and Infowars’ Jones from making it onstage.",
    "“Clearly, Cipollone f---ed everybody,” Stone told Steven Brown, a friend then in federal prison in Oregon for a fraud conviction, during a call on Jan. 19, 2021.",
    "The previous month, Greenberg had written to Stone to ask for help securing a pardon and they discussed a potential $250,000 fee, the Daily Beast has reported.",
    "Stone drew up a detailed proposal for Trump to pardon Brown, the friend then in federal prison with whom he spoke about Cipollone in front of the filmmakers.",
    "Alex Jones, the Infowars founder, was in one of the Willard’s higher-end suites, where he met with Flynn and Stone on Jan. 5, photographs posted online show.",
    "Stone told the filmmakers he hoped to persuade Trump to hire Schoen to represent him in his Senate impeachment trial on charges of inciting an insurrection.",
    "“A good, long sentence in prison will give him a chance to think about it, because the Southern District is coming for him, and he did nothing,” Stone said.",
    "Stone moved quickly after Trump’s defeat to help mobilize the protest movement that drew thousands to the nation’s capital on Jan. 6, 2021, The Post found.",
    "(After Trump left office, Schoen did join his defense, and Trump was acquitted when less than the required two-thirds of the Senate voted to convict him.)",
    "Elsewhere in the hotel, Trump’s outside lawyers, including Giuliani and John C. Eastman, ran their separate command center from another one-bedroom suite.",
    "A third, Mark Grods, admitted in a plea deal that he traveled to the D.C. area from Alabama with two guns and joined fellow members in the Capitol riot.",
    "The Danish filmmakers’ footage shows James inside Stone’s suite and in the hotel lobby with Stone’s bodyguard, Greco, during the hours before the riot.",
    "At home on Inauguration Day, wearing a microphone but out of view, Stone ranted to Alejandro about Kushner, whom he also blamed for his plan’s failure.",
    "On the day of the attack, as he packed his bags, Stone told the filmmakers the riot was a mistake and would be “really bad” for the pro-Trump movement.",
    "He told Flynn they could “document an overwhelming and compelling fraud” in each battleground state and urged him to spread the word on social media.",
    "Stone acknowledged in his post that he had met Alexander, but he stressed that he was merely talking to anybody who could help fight election fraud.",
    "Stone outlined a scenario in which Trump would order acting attorney general Jeffrey A. Rosen to appoint a special prosecutor to investigate Biden.",
    "“Maybe one reason I wanted him to see the article was so that he could have the people who handle pardons look into it,” Schoen said in an email.",
    "Stone was not part of their effort, the footage indicates, and he said he feared that top organizers were trying to exclude him from the rally.",
    "Stone and Flynn discussed the need to coordinate with the White House and oppose demands by Republicans in some states to stop counting votes.",
    "Around 2:30 p.m., Guldbrandsen headed out to capture the scene while Frederik Marbell, the director of photography, rushed to Stone’s room.",
    "In his Willard suite, away from the camera but still wearing a mic, Stone spoke on the phone with a man representing someone named Henry.",
    "In an October 2020 call with one prisoner’s representative, Stone stressed the influence of Jared Kushner, Trump’s son-in-law and aide.",
    "On the evening of Dec. 23, the White House announced that Trump had pardoned Stone for his convictions in the case brought by Mueller.",
    "On Nov. 5, as vote counts in key states slipped away from Trump, Stone coordinated a response during a rapid-fire succession of calls.",
    "and Reps. Matt Gaetz (Fla.) and Jim Jordan (Ohio), all of whom tried on Jan. 6 to delay or block the certification of Biden’s victory.",
    "(Frederik Marbell/\"A Storm Foretold\") RIGHT: Stone smokes a cigar at Macabi Havana Lounge in Fort Lauderdale, Fla., on Jan. 19, 2021.",
    "“He started to go down that road, but stopped,” Schoen wrote, adding that Trump “sees he is stymied by cip,” referring to Cipollone.",
    "By Dec. 30, Stone had launched a Jan. 6 fundraising drive, urging supporters to help fund the rallies and pay for private security.",
    "Before Stone left the Willard for Dulles around 5 p.m., he paused for a photo in front of a hotel TV showing coverage of the riot.",
    "Schoen said he did try to get Trump to read an article he’d written that said the former Colombo family members deserved pardons.",
    "Stone was eventually convicted on charges of impeding a congressional investigation of Russian interference in the 2016 election.",
    "He told the crowd he would stand with them “shoulder to shoulder” the next day, in what he called a fight between good and evil.",
    "In a brief interview with The Post, Kerik said Stone told him that Stone was “not invited” to the rally and did not want to go.",
    "“It’s going to be really nasty,” Stone said at home on July 9, 2020, predicting that Democrats would try to steal the election.",
    "The following afternoon, Schoen sent Stone a link to a new CNN report: Trump had been talked out of issuing preemptive pardons.",
    "Though months later he would support a possible Trump bid for the White House in 2024, on Inauguration Day he mocked the idea.",
    "Stone stationed himself close to the White House at the five-star Willard, which at the time was a hive of pro-Trump activity.",
    "Stone told aides he was not paid to lobby for Brown, who ultimately was not pardoned but has since been released from prison.",
    "Later that day, in a car with the filmmakers, Stone returned to the subject of Kushner during a call with a friend named Tom.",
    "Later that night, the White House confirmed it: Trump had pardoned Bannon, who was under indictment on federal fraud charges.",
    "Back in Florida, Stone lobbied for the Stone Plan, which called for Trump to preemptively pardon Republicans including Sens.",
    "Brown had been sentenced in 2018 to more than five years in prison over a $12.5 million scheme to defraud film investors.",
    "He worked as a consultant to Trump’s businesses in the 1980s and served as an informal adviser to Trump’s 2016 campaign.",
    "But, he said, the plan faced resistance from “lily-livered, weak-kneed” officials in the White House Counsel’s Office.",
    "“Now hearing that Bannon [is] getting one,” the associate wrote to Stone in a message that was visible in the footage.",
    "Schoen told Stone in a text exchange on Jan. 18 that Trump had called him again but was hesitant to commit to pardons.",
    "Kerik told The Post he did not know about Stone’s effort and did not need a pardon because he had done nothing wrong.",
    "Kerik said that the trip out of town was actually on Jan. 5, the previous day, and that Davis may have been mistaken.",
    "A Stone aide blocked a cameraman from entering his hotel suite, claiming that Stone was napping, the cameraman said.",
    "Last week, he sued members of the panel to try to block them from using a subpoena to obtain his telephone records.",
    "On the eve of the 2020 election, however, he seemed to welcome the prospect of clashes with left-wing activists.",
    "“Kristin Davis opened the door and said that Roger was taking a nap, so I couldn’t film,” Marbell told The Post.",
    "Though he had privately ordered a revival of his Stop the Steal initiative, Stone publicly played down his role.",
    "Demonstrations spread while Trump and his advisers lobbied state lawmakers to intervene, as Stone had proposed.",
    "Over the previous several months, the filmmakers had recorded Stone working to obtain pardons for other felons.",
    "A Cruz spokesman said, “Senator Cruz has no idea what Roger Stone says or does.” A Jordan spokesman said, “Mr.",
    "Next time we’re killing you.’ ” Aware the filmmakers were nearby, Alejandro urged Stone to say he was joking.",
    "“In two weeks he’s moving to Miami,” Stone told Alejandro, before whispering: “He’s going to get a beating.",
    "Stone condemned the riot to the filmmakers at 4:18 p.m., saying: “I think it’s really bad for the movement.",
    "The reports said the payments were for “strategic campaign consulting” but did not give additional details.",
    "The filmmakers returned to Denmark on Nov. 5 and were away from Stone as Trump’s efforts gathered momentum.",
    "In a speech, Stone urged Trump supporters to prepare for a disputed result, echoing Trump’s own statements.",
    "As protesters were mobilized, the plan said, state lawmakers would be lobbied to reject official results.",
    "But as the filmmakers ate in their hotel room, they saw news footage of a riot escalating at the Capitol.",
    "The filmmakers recorded Stone as he typed, and his screen and a draft of the letter were briefly visible.",
    "In his statement to The Post, Stone defended the efforts to press Congress to reject the election result.",
    "In the evening on Jan. 5, Stone appeared at the Rally to Save America at Freedom Plaza, near the Willard.",
    "The decision enraged Stone, who called Bannon a “grifter scumbag” and two expletives while he was filmed.",
    "Stone allowed the filmmakers to document his activities during extended periods over more than two years.",
    "That day, Flynn, Trump’s campaign and his sons Donald Jr. and Eric began using #StopTheSteal on Twitter.",
    "He was sentenced to three years and four months in prison, but Trump commuted the sentence in July 2020.",
    "On Dec. 19, Trump announced on social media that a “big protest” would be held in Washington on Jan. 6.",
    "Their destination was unclear, though Stone had said he had a 9 p.m. appointment to have his hair dyed.",
    "A handful of House Democrats unsuccessfully raised objections to the certification of Trump’s 2016 win.",
    "The messages went unanswered for 24 minutes, when Stone responded and offered to go to Marbell’s room.",
    "These people are going to get what they’ve been asking for.”\nStone declined requests for an interview.",
    "Prosecutors have said that Rhodes erased some messages from his phone before it was taken by the FBI.",
    "The next day, WildProtest.com, a site Alexander used to promote plans for the rally, was registered.",
    "“When we stepped outside, Roger had changed his mind,” said Christoffer Guldbrandsen, the director.",
    "A spokesman for Trump acknowledged questions from The Post but did not provide responses to them.",
    "Stone did not say whether he had consulted the lawmakers, and some told The Post that he did not.",
    "“Clark, I think, would carry out the order of the commander in chief,” Stone told the filmmakers.",
    "Stone’s team and the filmmakers agreed to separate for lunch and then reconvene two hours later.",
    "Stone was billed by organizers as a top-tier speaker at the main rally on Jan. 6 at the Ellipse.",
    "So, you know, it’s a knife fight, and your two knife fighters are Ali Alexander and Roger Stone.",
    "But as Biden’s inauguration neared, Stone’s plan met stiff opposition from White House lawyers.",
    "News that Trump had indeed considered replacing Rosen with Clark was made public a week later.",
    "Tarrio of the Proud Boys was among the group’s members, a later shot of Stone’s phone showed.",
    "In response to questions, he said in an email that he had no involvement in the Jan. 6 riot.",
    "He told them to monitor a group chat on the app Signal titled “F.O.S.” — friends of Stone.",
    "Stone claimed to aides that organizers he did not identify were conspiring to exclude him.",
    "“They conned her.”\nA representative for Fancelli did not respond to a request for comment.",
    "By about 4 p.m., with the Capitol in chaos, Stone had still not arrived at Marbell’s room.",
    "The filmmakers began recording their conversation but were forced to leave by hotel staff.",
    "Josh Dawsey, Spencer S. Hsu, Jacqueline Alemany and Emma Brown contributed to this report.",
    "“This was a free home run that could have saved a lot of loyal lives,” Schoen complained.",
    "He said copies of the plan were given to Trump and banner-name right-wing media figures.",
    "Outside the room, Marbell attempted to reach Stone by text message starting at 3:03 p.m.",
    "The fundraising page suggested donations of up to $2,500, which could be made to recur.",
    "The Post reviewed a Jan. 16 draft of Stone’s plan, which he shared with the filmmakers.",
    "Profiles of three involved in the attack: A horn-wearing ‘shaman.’ A cowboy evangelist.",
    "“Ali has never participated in a literal knife fight nor advocated one,” said Kamenar.",
    "“See you in prison,” Stone wrote that evening in a message to another Trump associate.",
    "Dictating text messages, Stone told an aide to resurrect his Stop the Steal campaign.",
    "The pair had been photographed together at several Republican events in prior years.",
    "“One of my biggest donors financed this whole thing,” Stone explained to one guest.",
    "The person spoke on the condition of anonymity to discuss government deliberations.",
    "Stone said he feared prosecution by the incoming attorney general, Merrick Garland.",
    "On Jan. 17, Stone and Schoen exchanged text messages about their talks with Trump.",
    "About five minutes later, room service arrived and Marbell snuck inside, he said.",
    "Stone planned to speak at a smaller rally near the Capitol later that afternoon.",
    "“I’ve got to know that Jared’s got the paperwork and he ‘gets it,’ ” Stone said.",
    "James pleaded guilty this week and agreed to cooperate with federal prosecutors.",
    "Stone, 69, has been a combative Republican strategist for almost half a century.",
    "In his remarks, Alexander thanked “my friend Roger Stone” for his guidance.",
    "“I am here to say it couldn’t be done without Roger Stone,” Alexander said.",
    "“I just caused a little problem for them with Julie Fancelli,” Stone said.",
    "“I believe the president is for it,” Stone told the filmmakers on Jan. 15.",
    "With Schoen advising Trump, “all that pardon stuff is easy,” Stone said.",
    "“Our slogan should be ‘count every legal ballot.’ Much better messaging.",
    "The effort raised about $40,000, according to a person familiar with it.",
    "“I’m going to have a little bit of input into the final list,” he said.",
    "When Rosen refused, Stone said, Trump would oust him and appoint Clark.",
    "The Jan. 6 committee: What it has done and where it is headed\nShow More",
    "Stone appeared to fear he would be publicly snubbed by the organizers.",
    "Also that day, Stone had a 15-minute call with Flynn, the video shows.",
    "So, this is something Roger and I have been planning for a long time.",
    "The report said that Stone denied interceding on Greenberg’s behalf.",
    "A spokeswoman for Bannon did not respond to a request for comment.",
    "You don’t want to reach for something and not get it,” Stone said.",
    "A spokesman for Meadows did not respond to a request for comment.",
    "“I think you will hear from the president shortly,” Stone wrote.",
    "A spokesman for Gaetz did not respond to a request for comment.",
    "“This proves we had nothing to do with this today,” Greco said.",
    "When he eventually got inside, Stone was speaking on his phone.",
    "“Obviously if you use any of that, I’ll murder you,” he said.",
    "For some, the Capitol attack was a kind of Christian revolt.",
    "Their attorney, David I. Schoen, has also represented Stone.",
    "Eight days later, Alexander visited Stone’s home for dinner.",
    "At about 12:40 p.m., some of Stone’s guests left his suite.",
    "He took Room 500, a one-bedroom suite with a living room.",
    "“ ‘You’re not stealing Florida, you’re not stealing Ohio.",
    "Stone has been friends with Trump for more than 30 years.",
    "The filmmakers followed Stone as he sought a full pardon.",
    "And needs to be told, ‘This time we’re just beating you.",
    "Gaetz denies any improper activity with underage girls.",
    "LEFT: Stone dines at the Palm restaurant in Washington.",
    "“If you count the legal votes, I easily win,” he began.",
    "That tactic later proved central to Trump’s efforts.",
    "Marbell returned to Stone’s room and began knocking.",
    "You’ll get your f---ing brains beat in,” Stone said.",
    "After ending the call, he turned to the filmmakers.",
    "F--- you,’ ” Stone said, imagining Trump’s remarks.",
    "Greenberg’s attorney said he declined to comment.",
    "He was on the phone with someone,” Marbell said.",
    "“Roger wasn’t allowed to be fully in the fight.",
    "Their connection ran deeper than Stone let on.",
    "The speaker’s name was redacted in the report.",
    "“The point is, I don’t want to be turned away.",
    "An attorney for Greco declined to comment.",
    "“But time is running out,” Schoen wrote.",
    "We’ve taken the leash off the pit bull.",
    "“He betrayed everybody,” Stone said.",
    "“Be there, will be wild!” he wrote.",
    "But in the end, he did not appear.",
    "And, finally, he’s off the leash.",
    "“He is not a friend,” Stone said.",
    "It’s not a joke,” Stone replied.",
    "The post was erased on Dec. 28.",
    "It is unclear what was said.",
    "“Roger was not taking a nap.",
    "More positive,” Stone said.",
    "He needs to have a beating.",
    "The Stone Plan had failed.",
    "It hurts, it doesn’t help.",
    "Brown declined to comment.",
    "“No, no, it isn’t joking.",
    "That’s what they want.",
    "“ ‘I’m the president.",
    "and Josh Hawley (Mo.)",
    "Ted Cruz (Tex.)",
    "Not joking.",
    "“Run again!"
  ]
}