{
  "id": 3791,
  "mediaId": 2564,
  "date": "2022-02-25",
  "headline": "Republican Senator Ben Sasse tears into 'evil' Putin and tells Biden to sanction 'lifestyles of the rich and famous a**hole mobsters and oligarchs' who enable the Russian leader's 'madness'",
  "image": "https://i.dailymail.co.uk/1s/2022/02/25/14/54649725-0-image-a-2_1645799443557.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10551641/Ben-Sasse-tears-evil-Putin-tells-Biden-sanction-hole-mobsters-oligarchs.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Drudge Report",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morgan Phillips",
  "authorUrl": "",
  "termIds": [
    2434,
    2542,
    3709,
    3975,
    437,
    1171,
    5287,
    5366
  ],
  "sentences": [
    "+6\nView gallery\nA man clears debris at a damaged residential building at Koshytsa Street, a suburb of the Ukrainian capital Kyiv, where a military shell allegedly hit, on February 25\n+6\nView gallery\nA soldier walks past the debris of a military plane that was shot down overnight in Kiev, Ukraine, 25\n+6\nView gallery\nAftermath of an overnight shelling at a residential area in Kiev, Ukraine, 25 February\n'Their kids should be kicked out of the country and they should go back and live in Moscow's hell holes with Putin because they are the ones enabling him.",
    "They will now be subject to 'full blocking sanctions' meaning they are cut off from the U.S. financial system, any assets they hold in the United States are frozen, and they are barred from entering the U.S.\nSasse said that while many Americans 'could not find Ukraine on a map,' he believes 'ultimately Americans are going to make a wise and smart choice about understanding why our rooting interest here should be against the evil Vladimir Putin because the guy's got big-a** weapons, and he's evil.'",
    "+6\nView gallery\n'We need to have targeted sanctions on the 16 oligarchs, the mobster cronies who enable Putin's madness,' Sen. Ben Sasse said\n+6\nView gallery\nSasse said Americans are going to understand why the U.S. needs to support Ukraine because Putin is 'evil' and has 'big-a** weapons'\n'The strength & resolve we have seen from the Ukrainian people is incredible, but the U.S. must do more.",
    "He said this week the invasion 'has nothing to do with our national security' and it is 'distracting our idiot 'leaders' from focusing on the things that actually do matter to our national security, like securing the border & stopping the flow of Fentanyl that's killing American kids.'",
    "On Thursday Biden announced his sanction tranche of sanctions as Russian troops descended on Ukraine and missiles and bombs hailed down from the sky and Ukrainians were forced to take cover for the night in bomb shelters and underground subway stations.",
    "After the criticism, Johnson got tougher Friday as he announced 10 separate strands of measures to inflict 'significant' impact on Moscow's economy on Thursday - with officials saying they should knock several percentage points off its GDP.",
    "'We need the Brits, who have been great allies in general, to step up and acknowledge there's a ton of Russian billionaire money bouncing all over London and we ought to perp walk them out of the country,' he said.",
    "GOP Sen. Ben Sasse urged President Biden to get tougher with sanctions on the 'mobster cronies' who 'enable Putin's madness' as lawmakers have urged the president to sanction the Russian leader's riches personally.",
    "They need to pay a price, whether their yachts are seized or their homes are seized...This is a critical moment, and we've got to bring maximum pressure on Putin as quickly as possible,' she said on Morning Joe.",
    "The assets of all major Russian banks - including VTB - will be frozen, while new legislation will block the state and all the country's major firms from being able to raise money on London markets.",
    "Maybe, before starting a war that could kill thousands and displace millions, he might worry more about the people of Ukraine and Russia and less about his precious super-yacht,' Sanders wrote.",
    "The ship is leaving its German port before possible sanctions\nThe Nebraska Republican also went after those who are arguing for non-interventionism, some of whom are within his own party.",
    "There will be travel bans and asset restrictions on five more named individuals - including Kirill Shamalov, Russia's youngest billionaire and previously married to Putin's daughter.",
    "'We need to have targeted sanctions on the 16 oligarchs, the mobster cronies who enable Putin's madness,' Sasse, R-Neb., said on MSNBC's Morning Joe on Friday.",
    "'There is not nearly the urgency at the Treasury Department and the State Department that there is at the Intel community and at the Pentagon,' he said.",
    "Putin is rumored to have a personal fortune of hundreds of billions, possibly making him the richest man in the world, but it has never been confirmed.",
    "We must issue devastating personal sanctions on Putin & his cronies & focus on crippling the Russian economy & the oligarchy,' he wrote on Twitter.",
    "Sen. Bernie Sanders, I-Vt., went after Putin's 'greed' after news that the Russian president's $81 million yacht was hightailing out of Germany.",
    "Members of Boris Johnson's own Tory Party accused the Prime Minister of 'encouraging' Putin's invasion with his 'pathetic sanctions' on Monday.",
    "Sasse also called out the United Kingdom, saying that London needs to do more to crack down on Russian wealth 'bouncing all over London.'",
    "'Those advocating for indifference [toward Russia's invasion of Ukraine] are wrong,' and not all are taking that stand 'in good faith.'",
    "He said that sanctioning Putin's personal assets was 'on the table' but did not answer a question as to why he hadn't done so yet.",
    "The government says over 100 people, entities and subsidiaries will be subject to sanctions, including defense giant Rostec.",
    "The sanctions targeted the families of those close to Vladimir Putin as well as senior executives at Kremlin-linked banks.",
    "Meanwhile, Sen. Rick Scott, R-Fla., joined the sea of voices calling on President Biden to sanction Putin personally.",
    "Vance represented a small-but-vocal wing of the GOP that believes the U.S. should stay out of the conflict.",
    "'These guys, we need a made-for-TV 'Lifestyles of the Rich and Famous A**holes,'' he suggested.",
    "Hillary Clinton agreed that Biden must more aggressively attack the wealth of Putin's cronies.",
    "As he made his argument for tougher sanctions, Sasse detailed discord between U.S. agencies.",
    "Johnson pointed out that half Russia's trade is currently in dollars and sterling.",
    "+6\nView gallery\nVladimir Putin's superyacht 'The Graceful' in the Kiel Canal.",
    "'We've got to go after those oligarchs who are supporting Putin financially.",
    "Biden curiously left out sanctions on the mega-wealthy leader of Russia.",
    "'Putin, a multi-billionaire, is the poster boy for greed and oligarchy.",
    "There need to be more consequences for them and we need to act faster.'",
    "Forbes recently called it 'the most elusive riddle in wealth hunting.'",
    "They don't want to live with him but they love to make money off him.",
    "Many are 'trying to score cheap political points,' he said.",
    "'Why not personally sanction Vladimir Putin?'",
    "Rep. Jim Jordan, R-Ohio, added on Twitter.",
    "Most notably Ohio Senate candidate J.D.",
    "Former Sec."
  ]
}