{
  "id": 3869,
  "mediaId": 2584,
  "date": "2022-03-02",
  "headline": "Keyword list for Trump lawyer hints at focus of US Capitol attack investigation",
  "image": "https://i.guim.co.uk/img/media/e92511b5b7baca3a8c88514e317a5fd2dc05f640/0_96_3500_2099/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=50b3107bd02651e0a1ee8f7fccbc8084",
  "link": "https://www.theguardian.com/us-news/2022/mar/02/us-capitol-attack-john-eastman-keyword-list",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hugo Lowell",
  "authorUrl": "https://www.theguardian.com/profile/hugo-lowell",
  "termIds": [
    0
  ],
  "sentences": [
    "The House select committee investigating the January 6 attack on the US Capitol is asking the former Trump lawyer John Eastman to prioritize turning over records with certain keywords as he complies with his subpoena – a list of terms that reveal the panel’s focus as it investigates a potential conspiracy.",
    "The keywords include a Gmail address used by Donald Trump’s former chief of staff Mark Meadows and the names of various individuals involved in the effort to overturn the 2020 election, from top Trump aides to Republican members of Congress to the former justice department official Jeffrey Clark.",
    "The select committee is examining Eastman’s records about Republican federal and state legislators including Andy Biggs, Mo Brooks, Ted Cruz, Louie Gohmert, Paul Gosar, Josh Hawley, Cindy Hyde-Smith, Jim Jordan, Cynthia Lummis, Roger Marshall, Doug Mastriano, Scott Perry and Tommy Tuberville.",
    "At the same time, the select committee has taken a broad view of its mandate: to investigate whether there was any coordination between the “political elements” of Trump’s plan to obstruct the certification of Biden’s election win in addition to the Capitol attack itself.",
    "Taken together, the source said, the keywords reflect the panel’s suspicion that Eastman was at the heart of what could amount to an unlawful conspiracy between the Trump White House, GOP members of Congress and Trump loyalists at DoJ to obstruct Congress on 6 January.",
    "The select committee’s addition of “congressnc@gmail.com” – a sometime email address used by Meadows, who was a House Republican representing North Carolina before he became Trump’s final chief of staff – indicates it also wants messages not in official email records.",
    "But the keywords also reveal the current investigative focus of the panel and the role Eastman played as one of the leading members of the Trump “war room” at the Willard hotel in Washington that coordinated Trump’s plan to return himself to office on 6 January 2021.",
    "The list is intended to act as a dragnet to catch his records from 4 to 7 January about efforts to overturn the 2020 election results between Eastman and individuals in different “centres of gravity”, according to a source with direct knowledge of the investigation.",
    "One focus for the select committee is Eastman’s records concerning Donald Trump, former vice-president Mike Pence and top Trump officials, where keywords include items as simple as “Trump”, or “EOP”, the government acronym for the executive office of the president.",
    "For witnesses that might prove problematic, the chairman of the panel, Bennie Thompson, has moved to issue automatic subpoenas compelling documents and testimony, often before committee counsel has taken the customary step of first requesting voluntary cooperation.",
    "The search terms list – which the select committee transmitted to Eastman – provides a glimpse of what House investigators suspect might be contained among the thousands of emails and documents that Eastman is being forced to review to comply with his subpoena.",
    "Eastman did not respond to a request for comment ahead of a hearing next week where he will attempt to withhold from the select committee documents he believes are protected by executive and attorney-client privilege.",
    "In seeking Eastman’s messages with former Trump White House counsel Pat Cipollone, for instance, the panel included misspellings of his name they have found in other documents, from “Cippolone” to “Cippollone”.",
    "The panel is cognizant of how its investigators have managed to upend Washington with aggressive subpoena tactics more commonly seen in criminal prosecutions than congressional inquiries.",
    "The list of keywords for Eastman also reflects the new urgency that has gripped the panel in recent weeks as it races to complete the evidence-gathering phase of the investigation.",
    "That has increased the panel’s workload and pushed back the timeline, Thompson told the Guardian on Monday, though he said he still hoped for public hearings in April.",
    "The list of terms is speculative insofar as it amounts only to what the select committee hopes are among Eastman’s most sensitive records and messages.",
    "The list includes the domains “usdoj.gov” and “justice.gov” for the justice department, “senate.gov” for the Senate, and “house.gov” for the House.",
    "Another priority for the panel is messages between Eastman and those he communicated with across the federal government.",
    "But the keywords are there because the panel has reason to believe such communications exist, the source said.",
    "An earlier version referred to Doug Mastriano, a Pennsylvania legislator, as a member of Congress.",
    "“We keep adding to the list of people we need to talk to.",
    "A spokesperson for the panel declined to comment.",
    "This article was amended on 3 March 2022.",
    "That’s grown the body of work,” he said.",
    "The keywords also account for typos."
  ]
}