{
  "id": 3943,
  "mediaId": 2724,
  "date": "2022-03-01",
  "headline": "Joy Behar Claims Trump Supports Russia And It’s Because Of ‘White Supremacy’",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/02/2022.02.28-09.13-thepoliticalinsider-621d3ae89d19a.jpg",
  "link": "https://thepoliticalinsider.com/joy-behar-claims-trump-supports-russia-and-its-because-of-white-supremacy/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Hanson",
  "authorUrl": "https://thepoliticalinsider.com/author/john-hanson/",
  "termIds": [
    1428,
    2201,
    3608,
    3709,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "But what really jumped out were comments made by Joy Behar, that Trump “supports Putin” because of “white supremacy.”\nBehar made her remarks during a discussion on her program “The View.”\nJoy Behar: Trump's support for Russia is \"about white supremacy\" https://t.co/LlKQ6z4lwp pic.twitter.com/t4S50QE2Pb\n— The Hill (@thehill) February 28, 2022\nRELATED: New Poll: Significant Majority Says Putin Wouldn’t Have Invaded Ukraine If Trump Were President\nBehar: ‘A lot of this support for Russia and Putin is about white supremacy’\nAfter several minutes of the hosts claiming that there are ‘pro-Putin’ Republicans – a narrative that has been flying full steam through segments of the media – and seeming to argue that Americans are not allowed to criticize their own leaders lest foreign adversaries use it to their advantage, Behar postulated that “white supremacy” is behind it all.",
    "I don’t agree, but that’s me.”\nBehar’s belief that Trump is somehow supporting or siding with Putin and Russia appears to come from the former president’s recent interview last week on “The Clay Travis and Buck Sexton Show.”\nIn that interview, Trump called Putin’s recognition of the Donetsk and Luhansk people’s republics in eastern Ukraine “savvy” considering that he invaded Ukraine afterward.",
    "— Sahil Kapur (@sahilkapur) February 22, 2022\nRELATED: Video: Jim Jordan Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nTrump and other conservatives have been accused of supporting Russia\n“We could use that on our southern border.",
    "Many establishment and left-leaning pundits have accused Trump, Fox News’ Tucker Carlson and other conservatives of allying with Russia because these figures do not support the U.S. getting into a direct war with nuclear Russia.",
    "“A lot of this support for Russia and Putin is about white supremacy.”\nSign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "On Monday, “The View” continued to run with a dubious media narrative that recent sarcastic comments made by former President Trump amount to “support” for Vladimir Putin.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "Behar asked, “What do you think is behind it, though?”\n“Because I was reading an article that a lot of it is about white supremacy,” Behar said.",
    "Whoopi Goldberg interjected, saying, “There are a lot of folks who think it would be a better country if it were more like Russia.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "“That’s the strongest peace force.”\nTrump says Putin's military move on Ukraine is \"genius.\"",
    "And he’s gonna go in and be a peacekeeper… We could use that on our southern border.\"",
    "“I said, ‘How smart is that?’ He’s going to go in and be a peacekeeper,” Trump said.",
    "Behar did not cite the article she claimed to get this information from.",
    "Further, Ukraine is a very, very white country made up of ethnic Slavs.",
    "\"Putin is now saying, 'It’s independent,' a large section of Ukraine.",
    "They’re going to keep peace, all right,” Trump said sarcastically.",
    "The Political Insider broke down that media narrative here.",
    "That’s the strongest peace force I’ve ever seen.",
    "There were more army tanks than I’ve ever seen.",
    "I said, 'How smart is that?'"
  ]
}