{
  "id": 4130,
  "mediaId": 2746,
  "date": "2022-03-06",
  "headline": "Harris compares Republicans to 1960s Alabama state troopers on ‘Bloody Sunday’",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/06/Selma_Commemoration_Harris_44569.jpg-b4e62_c0-250-6000-3750_s1200x700.jpg?2cb823f519263a3e55a419724463fd44fb7f7c61",
  "link": "https://www.washingtontimes.com/news/2022/mar/6/harris-compares-republicans-1960s-alabama-state-tr/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kerry Picket",
  "authorUrl": "https://www.washingtontimes.com/staff/kerry-picket/",
  "termIds": [
    1670,
    1951,
    3975,
    873,
    878,
    1171,
    4984,
    5308
  ],
  "sentences": [
    "The vice president characterized them as “laws that, put simply, make it much more difficult for people to vote.”\nMs. Harris included Senate Republicans in her remarks as being as guilty as the GOP state lawmakers who passed the election laws, for filibustering the Democrats’ voting legislation.",
    "“And on the night of Jan. 19, every Republican senator in the United States Senate voted to block passage of this law.”\nHouse Democrats named one of the pair of election overhaul bills after Lewis, a longtime Georgia lawmaker who was on the “Bloody Sunday” bridge and died in July 2020.",
    "Vice President Kamala Harris used her visit to Selma, Alabama, as an opportunity to compare state Republicans who passed new election laws to 1960s state troopers who attacked Black civil rights protesters as they crossed the Edmund Pettus Bridge.",
    "Ms. Harris made the trip Sunday to commemorate the 57th anniversary of “Bloody Sunday,” the day in 1965 when White state troopers assaulted Black voting-rights demonstrators trying to cross the historic bridge in Selma.",
    "The bill would require jurisdictions to get “approval from unelected people in the Justice Department before changing its election process — that’s some scary stuff,” Rep. Jim Jordan, Ohio Republican, said last August.",
    "The legislation would reestablish pre-clearance requirements for certain states’ voting-regulation changes under the 1965 Voting Rights Act, which the U.S. Supreme Court eliminated in 2013 as ahistoric relics.",
    "Nineteen states have passed election reform laws since the 2020 presidential election that focuses on measures including absentee ballots, ballot drop boxes, early voting days and voter ID.",
    "“Nowhere is that more clear,” she said, “than when it comes to the ongoing fight to secure the freedom to vote.”\n“A record number of people cast their ballots in the 2020 elections.",
    "We again, however, find ourselves caught in between injustice and justice, between disappointment and determination, still in a fight, to form a more perfect union,” she said.",
    "House and Senate Republicans have voted against the legislation, claiming the bill federalizes elections and politicizes enforcement of the Voting Rights Act.",
    "Ms. Harris described the marchers on that day as “preparing for the worst” and were kneeling in prayer as the state troopers charged at them.",
    "And so as powerful people have done many times in our nation’s history, they launched an assault on the freedom to vote,” Ms. Harris said.",
    "We brought the freedom to vote act, yes, the John Lewis Voting Rights Advancement Act to the floor of the United States Senate,” she said.",
    "We locked arms and lifted our voices and fought to pass Federal Voting rights legislation.",
    "The right to vote is the most fundamental,” Mr. Biden said in a White House statement.",
    "President Biden on Sunday reiterated his call for the passage of voting legislation.",
    "“Those brave marches continued to push forward to secure the freedom to vote.",
    "Senate GOP lawmakers successfully blocked both bills.",
    "“The battle for the soul of America has many fronts.",
    "Today we stand on this bridge at a different time.",
    "It was a triumph of democracy in many ways.",
    "“So last year, we all joined together.",
    "But not everyone saw it that way.",
    "And they were pushed back.",
    "Some saw it as a threat."
  ]
}