{
  "id": 4136,
  "mediaId": 2724,
  "date": "2022-03-03",
  "headline": "Rep. Jim Jordan Says ‘Radical Left’ Won’t Let Biden Reverse ‘Crazy’ Energy Policies",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/03/2022.03.02-06.05-thepoliticalinsider-621fb1f5a51ba.jpg",
  "link": "https://thepoliticalinsider.com/rep-jim-jordan-says-biden-and-the-radical-left-wants-to-push-gas-to-8-a-gallon/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Hanson",
  "authorUrl": "https://thepoliticalinsider.com/author/john-hanson/",
  "termIds": [
    1670,
    2201,
    3975,
    4448,
    305,
    878,
    1163
  ],
  "sentences": [
    "pic.twitter.com/Z5fclkBs5d\n— Daily Caller (@DailyCaller) March 2, 2022\nRELATED: Far-Left Rep. Cori Bush Fumes At Biden For Not Mentioning ‘Black Lives’ During State Of The Union\nRep. Jordan: ‘The left actually wants to destroy the oil and gas industry’\nResponding to a question about how many European countries are reliant on Russia for oil, and what steps America can take to become energy independent, Jordan said we need to “reverse the crazy policies of the Biden administration” and do a total 180 from what is being done now.",
    "Jordan criticized Biden for getting rid of the Keystone XL Pipeline, stopping oil and gas companies from beginning new drilling on federal lands, and other “crazy policies of the Biden administration.”\nJust last week, the Biden administration froze new oil and gas leases after a federal court blocked them from considering “climate change” in cost estimates.",
    "The Long Game\n“They want to drive the oil and gas business out of business, and it just shows how out of touch they are.”\nThe Republican said Biden didn’t have the guts to stand up to the extremists in his own party.",
    "On Wednesday, Republican Congressman Jim Jordan argued that President Biden was essentially being held hostage policy-wise by the far-left wing of the Democrat Party – particularly when it comes to energy policy.",
    "#SOTUinCrisis\n— Rep. Jim Jordan (@Jim_Jordan) March 1, 2022\nRELATED: Members of Congress Received 8,000+ Free Trips—Including Hundreds Paid for by Non-Profits Who Pocketed $100+ Million in Federal Funding",
    "“He may want to change, who knows, but his party won’t let him and that’s why, I think, this fall there is going to be a big change in the midterm election,” Jordan said.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "“It would be nice if Joe Biden wanted to reverse policies but I don’t think he can because the radical left controls his party,” Jordan claimed.",
    "“We had a hearing a few months ago where my Democrat colleague Ro Khanna said, in that hearing, with executives from the oil and gas companies.",
    "“His party is controlled by the left.”\n“The left actually wants to destroy the oil and gas industry,” Jordan contended.",
    "Jordan said that even if Biden wanted to right these wrongs, the left flank of his party would not allow it.",
    "He went down the line and badgered each witness and said ‘Will you pledge today to decrease production.",
    "Sign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "Jordan made his remarks during an interview on “The National Desk,” a local show in Columbus, Ohio.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "Jim Jordan: Even if Joe Biden Wanted To Reverse His Energy Policies \"His party won’t let him.",
    "“I asked him after his comments and after his questioning, I said ‘What do you guys want?",
    "“Even if Joe Biden wanted to do that, his party won’t let him,” Jordan said.",
    "The importance of energy has shot to the forefront amid the war in Ukraine.",
    "The left actually wants to destroy the oil and gas industry.\"",
    "'”\n“I mean, think about that,” Jordan exclaimed.",
    "And the truth is they do,” Jordan said.",
    "His party is controlled by the left.",
    "Trump gave us energy independence.",
    "Trump gave us record job growth.",
    "Biden gave us record inflation.",
    "Trump gave us a secure border.",
    "Biden gave us expensive gas.",
    "Biden gave us chaos.",
    "$8 gas?"
  ]
}