{
  "id": 4185,
  "mediaId": 2779,
  "date": "2022-03-03",
  "headline": "Biden Signs Law Banning Forced Arbitration — but Only Over Sexual Misconduct",
  "image": "https://theintercept.imgix.net/wp-uploads/sites/1/2022/02/GettyImages-1238357497-FAIR-Biden-Me-Too.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800",
  "link": "https://theintercept.com/2022/03/03/sexual-harassment-forced-arbitration-fair-act/",
  "mediaOutlet": "Intercept",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sara Sirota",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Powerful business interests in Washington lobby very hard against legislation that changes this forced arbitration and they’re very successful oftentimes in killing good bills,” Rep. Matt Gaetz, R-Fla., the only Republican co-sponsor of the comprehensive reform in either the House or Senate who himself has been accused of sex trafficking, told The Intercept on February 7, specifically acknowledging the Chamber’s influence.",
    "“Once you have this to expose how much harassment is going on in the workplace, I think you will be able to continue to amend the law to protect all plaintiffs.”\nDemocrats have already introduced some single issue-focused measures that have been unsuccessful in the past but could ride on the coattails of Gillibrand’s bill: Rep. David Cicilline, D-R.I., with the support of Pennsylvania Republican Rep.",
    "The new law faced some dissent from Republicans: House Judiciary Committee Ranking Member Jim Jordan, R-Ohio, himself accused of ignoring sexual abuse on the Ohio State University wrestling team, laundered Chamber of Commerce talking points and dubiously argued on the House floor that litigation can be longer, costlier, and more traumatic than arbitration before voting no.",
    "“I do think that there are issues like racial discrimination that would rise to the level of eliminating mandatory arbitration, but most others I really would have to look at on a case-by-case basis,” he told The Intercept on February 11, adding that he has not spoken to his GOP colleagues about the idea.",
    "“President Biden has long spoken against forced arbitration clauses in employment contracts and today marks an important milestone in empowering survivors of sexual assault and sexual harassment and protecting employee rights,” White House press secretary Jen Psaki said during a press briefing Thursday.",
    "Despite opposition from Jordan and some of his colleagues, the majority of Republicans in the House of Representatives ultimately joined all Democrats to vote in favor of the reform on February 7, and the following day, it passed the Senate in a voice vote without any objections, including from Ernst.",
    "Gretchen Carlson’s influential nonprofit Lift Our Voices, which played a pivotal role advocating for the sexual assault-focused bill, is continuing its fight against forced arbitration clauses and nondisclosure agreements in workplace conflicts — but not in consumer disputes.",
    "Big corporations may view reform for sexual assault cases as a no-brainer, but once tort claims and unemployment discrimination come into play, “Woah, that hurts our bottom line,” he said, mimicking business owner fears about restoring public justice to workers and consumers.",
    "The Chamber over the past year has also spent hundreds of thousands of dollars, if not millions, to send dozens of lobbyists to undermine the FAIR Act and narrower bills, in addition to the Ending Forced Arbitration in Sexual Assault and Sexual Harassment Act.",
    "Sexual assault and harassment “really is something where this particular group of individuals have suffered greatly,” Buck said, though he acknowledged that he would be open to similar one-off legislation to ban these clauses in certain workplace disputes.",
    "Major corporations have independently paid lobbyists to hinder the broad FAIR Act as well, including AT&T, whose 2011 Supreme Court case opened the floodgates for businesses to insert these clauses into contracts and obstruct access to transparent trials.",
    "Kirsten Gillibrand, D-N.Y., and Lindsey Graham, R-S.C., first teamed up to introduce an early version of what’s now called the Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act during the height of the #MeToo movement in December 2017.",
    "How can corporate lobbyists continue to argue with a straight face that forced arbitration clauses are good for the American public, in fact so great that for their own good, people must be forced to agree to them?”\nUpdate: March 3, 2022, 6:16 p.m.",
    "“The broader the prohibition against forced arbitration, the [more] difficult it is to defeat the armies of lobbyists and lawyers,” Sen. Richard Blumenthal, D-Conn., original sponsor of the FAIR Act, told The Intercept in February.",
    "Guy Reschenthaler, has sponsored the Justice for Servicemembers Act, which would effectively nullify forced arbitration clauses in employment contracts that prey on troops and reservists who have to suddenly depart for active duty.",
    "Sen. Joni Ernst, R-Iowa, who has spoken publicly about experiencing sexual harassment while serving in the U.S. military, sought to undermine the bill by crafting a watered-down alternative that the Chamber could stomach.",
    "Though Biden and Harris called on Congress to pass the FAIR Act during Thursday’s signing ceremony, it still faces significant opposition, as do two other consumer-focused bills that could reform the law incrementally.",
    "And a number of Senate Republicans who were particularly outspoken in support of the narrow legislation told The Intercept they hadn’t reviewed the FAIR Act, including Graham, who co-sponsored the bill with Gillibrand.",
    "Lawmakers could protect workers from forced arbitration in these cases by passing more sweeping legislation, like the Forced Arbitration Injustice Repeal, or FAIR, Act, which seeks to bar these clauses more broadly.",
    "Pending a challenge in the courts, clauses in employee contracts mandating the use of arbitration to resolve sexual assault and harassment-related workplace conflicts will be unenforceable, effectively banning them.",
    "Additionally, Sen. Jeff Merkley, D-Ore., and Rep. Bill Foster, D-Ill., have introduced the Investor Choice Act, which would ban investment advisers and broker-dealers from mandating arbitration with clients.",
    "Businesses have long put arbitration mandates into contracts without the knowledge of employees and consumers, leaving them with little choice to seek justice in public court when a dispute arises.",
    "Even Rep. Ken Buck, R-Colo., one of eight Republican House co-sponsors of the sexual assault-targeted bill, told The Intercept he does not support eliminating mandatory arbitration completely.",
    "ET\nThis story has been updated to reflect that Biden signed the Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act into law and include comments from the signing ceremony.",
    "Spokespersons for the seven other House Republican co-sponsors of the sexual assault-targeted legislation did not respond to emailed questions about whether their bosses back the FAIR Act.",
    "But investment advisers, which are becoming more frequent, are not regulated by FINRA, so their clients often have no choice but to resolve complaints at cost-forbidding private forums.",
    "President Joe Biden signed a groundbreaking bill Thursday, effectively banning employers from forcing workers to resolve sexual assault and harassment complaints behind closed doors.",
    "Pre-dispute forced arbitration agreements still constrain workers who are seeking adjudication of discrimination on the basis of race, sexual orientation, and other types of claims.",
    "BEFORE YOU GO on about your day, ask yourself: How likely is it that the story you just read would have been produced by a different news outlet if The Intercept hadn’t done it?",
    "According to a study from the American Association of Justice, forced consumer and employment arbitrations jumped in 2020 — and only 4 percent of claimants won monetary awards.",
    "However, employee and consumer rights advocates like Joanne Doroshow, executive director at New York Law School’s Center for Justice & Democracy, share Gillibrand’s optimism.",
    "Currently, claimants against the latter can seek recourse at the Financial Industry Regulatory Agency, or FINRA, which provides an industry subsidized arbitration forum.",
    "Democrats first introduced the bill in 2017, and it passed the House in 2018, but it didn’t have the support of a Republican-led Senate to leave the Judiciary Committee.",
    "They also pervade contracts between seniors and nursing homes, individuals and their financial advisers, military troops and employers, borrowers and lenders, and more.",
    "The new law is a victory for employee rights, as well as for advocates hoping to loosen the hold that special interests have over Congress, but it’s a modest reform.",
    "No Republicans have co-sponsored these two single-issue bills; consumer rights measures may go too far for conservatives compared to workplace and troop protection.",
    "Some corporate giants see more of these cases than others: One in three employment-based cases was filed against Family Dollar or its owner Dollar Tree alone.",
    "Members of Congress could ban most arbitration mandates by passing the FAIR Act, but they appear unlikely to earn the bipartisan support required to do so.",
    "Some, like Sen. Shelley Moore Capito, R-W.Va., explicitly closed the door to supporting other forced arbitration reforms at this time.",
    "Rep. Linda Sánchez, D-Calif., also has the Fairness in Nursing Home Arbitration Act to protect elders in long-term care facilities.",
    "How many covert wars, miscarriages of justice, and dystopian technologies would remain hidden if our reporters weren’t on the beat?",
    "She notably did not mention such predatory clauses in consumer agreements, which Democratic advocates are striving to ban too.",
    "Upon signing the legislation, Biden and Vice President Kamala Harris called for an end to forced arbitration writ large.",
    "Joining is simple and doesn’t need to cost a lot: You can become a sustaining member for as little as $3 or $5 a month.",
    "“This first bill was the first crack in the forced arbitration wall,” she told The Intercept in an email.",
    "The measure languished under a GOP-controlled Senate and White House but finally passed in February.",
    "The kind of reporting we do is essential to democracy, but it is not easy, cheap, or profitable.",
    "“All the other kinds of discrimination [have] had less visibility,” she told The Intercept.",
    "“Giving the employer absolute power to decide isn’t how justice is supposed to work.”\nSens.",
    "Oftentimes, these clauses are accompanied by restrictions on class action lawsuits as well.",
    "We don’t have ads, so we depend on our members to help us hold the powerful to account.",
    "Who would hold party elites accountable to the values they proclaim to have?",
    "Consider what the world of media would look like without The Intercept.",
    "“I think it’s all wrong,” Biden said of mandatory arbitration clauses.",
    "That’s all it takes to support the journalism you rely on.",
    "The Intercept is an independent nonprofit news outlet.",
    "“Now, other efforts get easier and easier.",
    "Nevertheless, Gillibrand is optimistic.",
    "Become a Member",
    "WAIT!"
  ]
}