{
  "id": 4371,
  "mediaId": 2682,
  "date": "2022-03-03",
  "headline": "The Show Must Go On: CPAC Brings You the Same Clowns with the Same Empty Promises",
  "image": "https://sonsoflibertymedia.com/wp-content/uploads/2022/03/clowns.jpg",
  "link": "https://sonsoflibertymedia.com/the-show-must-go-on-c-pac-brings-you-the-same-clowns-with-the-same-empty-promises/",
  "mediaOutlet": "sonsoflibertymedia.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bradlee Dean",
  "authorUrl": "https://sonsoflibertymedia.com/author/bradleedean/",
  "termIds": [
    1670,
    1902,
    2047,
    3003,
    3151,
    3331,
    4464,
    275
  ],
  "sentences": [
    "With all of the information available concerning those who are out in front of you as your said representatives in this government, one must ask the question, “What don’t you get?” (Mark 3:25)\nThe same clowns that are sold to you, by the mainstream media that you say you do not trust, are the best options that you have and yet, that is all they do is magnify the crimes of those that they fail to prosecute (Psalm 94:20).",
    "When the American people figure out that that these are controlled opposition, who are installed and placed, to lead the people astray (Amos 2:4) and return to the God that they have wickedly forsaken (Isaiah 55:7-9), then, and only then, will the people find the answers for which they have been looking, and not until then.",
    "CPAC 2022 Speakers, in part, were the following:\nDonald Trump\nTed Cruz\nMarco Rubio\nRon DeSantis\nKristi Noem\nDonald Trump Jr.\nMike Pompeo\nTulsi Gabbard\nMatt Gaetz\nRick Scott\nCandace Owens\nJim Jordan\nConclusion: Oh, how these installed appeasers are laughing at the people who support them (Ephesians 4:14).",
    "Moving forward into the new year again, CPAC did not fail to provide you the same vain actors and appeasers to deliver promises that will, once again, never be delivered.",
    "Instead, there are just more excuses as to why Americans are losing their country in the face of a party system that does not exist constitutionally.",
    "There is no reformation that stems from the rule of law, nor is there justice.",
    "These actors are accumulating wealth from the performances that they put on.",
    "CPAC reflects what it is that the people tolerate."
  ]
}