{
  "id": 4372,
  "mediaId": 2563,
  "date": "2022-02-28",
  "headline": "WATCH FULL SPEECH: President Donald J. Trump at CPAC 2022",
  "image": "https://drrichswier.com/wp-content/uploads/TRUMP-CPAC-2022.jpg",
  "link": "https://drrichswier.com/2022/02/28/watch-full-speech-president-donald-j-trump-at-cpac-2022/",
  "mediaOutlet": "drrichswier.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dr. Rich Swier",
  "authorUrl": "https://drrichswier.com/author/drswier/",
  "termIds": [
    0
  ],
  "sentences": [
    "I’ve said to some of them, I said, “You know, during the Obama years, and now during Biden, if you spent the same energy on attacking them, you’d actually be successful as you do on attacking me in many cases.”\nThe Democrats don’t have grand-standers like Mitt Romney, little Ben Sasse, Richard Burr, Bill Cassidy, Susan Collins, Lisa Murkowski, Pat Toomey; and in the House, Tom Rice, South Carolina, Adam Kinzinger, Dan Newhouse, Anthony Gonzalez.",
    "The Biden administration is now actively expediting the admission of illegal migrants, enabling them to lodge, frivolous asylum claims and admitting them by the thousands and thousands and thousands a day, crowded together in unsanitary conditions despite the ongoing economic and public health crisis, COVID-19, or as I call it the China virus.",
    "And when illegal aliens came across our border they were rapidly deported and lovingly accepted by those countries from where they came and it worked, so they accept the people and we ultimately got along very well with those countries, those three countries, and many countries throughout the world, because they respected us again.",
    "If you look at Venezuela, you look at some of these countries, that’s why some of our biggest supporters are from South America, Latin America, because they’ve seen what goes on with all of this cancel culture and you can’t speak it, and let’s cut them off, and let’s not give them words.",
    "The Democrat immigration bill is a globalist corp. You take a look at the corporatists, big tech attack on hard working citizens of every race, religion, color, and creed and Republicans must ensure that it never is allowed to become federal law, which is what they want to do.",
    "That together and I say it actually and I say for them, and I say it for our country, what the Biden administration is doing to push young migrants into the hands of human traffickers and coyotes is dangerous, immoral and indefensible, hard to believe it’s happening.",
    "The Biden administration is actually bragging about the classroom education they are providing to migrant children on the border while at the same time, millions of American children are having their futures destroyed by Joe Biden’s anti-science school closures.",
    "And if the federal government refuses to act, then every state in the union where we have the votes… which is a lot of them… Big tech giants, like Twitter, Google and Facebook should be punished with major sanctions whenever they silence conservative voices.",
    "We signed an order to conduct politically correct, far-left indoctrination trainings in every department of the federal government, including the U S military, after I had terminated these horrible things that were being preached to our military.",
    "Even if you consider nothing else, it is undeniable that election rules were illegally changed at the last minute in almost every swing state with the procedures rewritten by local politicians … you’re not allowed to do that … and local judges.",
    "And in November, 18 of 19 Bellwether County’s… You heard about the Bellwether County’s… 18 of 19 Bellwether County’s that have correctly predicted every Presidential election for decades, many decades, voted for Trump, not for Biden.",
    "By recklessly eliminating our border security measures, controls, all of the things that we put into place, Joe Biden has triggered a massive flood of illegal immigration into our country the likes of which we have never seen before.",
    "Perhaps worst of all, Joe Biden’s decision to cancel border security has single handedly launched a youth migrant crisis that is enriching child smugglers, vicious criminal cartels, and some of the most evil people on the planet.",
    "We greatly limited drug and human trafficking to a level that nobody actually thought was possible and the wall helped us a lot and we protected vulnerable people from the ravages of dangerous predators and that’s what they are.",
    "The Biden policy of releasing criminals into the U.S. interior is making America into a sanctuary nation where criminals, illegal immigrants, including gang members and sex offenders are set free into American communities.",
    "For the next four years, the brave Republicans in this room will be at the heart of the effort to oppose the radical Democrats, the fake news media and their toxic cancel culture, something new to our ears, cancel culture.",
    "This issue is being studied and examined, but the reality is you cannot have a situation where ballots are indiscriminately pouring in from all over the country, tens of millions of ballots, where are they coming from?",
    "Military, law and order, great trade deals, great education.” – President Donald J. Trump, CPAC 2022\nPresident Donald Trump addressed the annual Conservative Political Action Conference being held in Orlando, Florida.",
    "They have no idea and remember with the caravans, these countries, not only the three of them, but many, many countries all over the world, they’re not giving us the best and their finest because they’re intelligent.",
    "We cannot have leaders who show more passion for condemning their fellow Americans than they have ever shown for standing up to Democrats, the media and the radicals who want to turn America into a socialist country.",
    "So no matter how much the Washington establishment and the powerful, special interests may want to silence us, let there be no doubt we will be victorious and America will be stronger and greater than ever before.",
    "We will summon the spirit of generations of American patriots before us, like those heroes who crossed the Delaware, conquered the Rockies, stormed the beaches, won the battles and tamed the unknown frontiers.",
    "Instead of attacking me and more importantly, the voters of our movement, top establishment Republicans in Washington should be spending your energy and opposing Biden, Pelosi, Schumer, and the Democrats.",
    "We won a landslide, Iowa, because our farmers know, and they put up with it and we did a lot of work with the tariffs and all these things that we had to do to get it, and now the farmers are doing great.",
    "Not only did we push the FDA far beyond what the bureaucrats wanted to do, we also put up billions and billions of dollars, 10 billion, to produce the vaccines before we knew they were going to work.",
    "We built the strongest economy in the history of the world, raised wages, and achieved the lowest African American, Hispanic American, Asian American unemployment rates ever, ever, ever recorded.",
    "And restricting our law enforcement professionals and they are great professionals, you have many of them represented here today, from conducting almost any immigration enforcement of any kind.",
    "You family still cannot go out to eat at local restaurants, but Joe Biden is bringing in thousands upon thousands of refugees from all over the world, people that nobody knows anything about.",
    "Fortunately for the Republican party, the Democrats have horrible policies like open borders, sanctuary cities, defunding the police and the ridiculous, totally ridiculous Green New Deal.",
    "The mission of our movement and of the Republican Party must be to create a future of good jobs, strong family, safe communities, a vibrant culture, and a great nation for all Americans.",
    "We had built almost 500 miles of great border wall that helped us with these numbers because once it’s up, they used to say, “The wall doesn’t work.” Well you know what I’ve always said?",
    "Just like the Iran and the World Health Organization, Joe Biden put the United States back into the very unfair and very costly Paris climate accord without negotiating a better deal.",
    "Their bill would drastically restrict political speech, empower the federal government to shut down dissent and turn the federal election commission into a partisan political weapon.",
    "I said, “Okay, we aren’t going to pay them anymore because they wouldn’t take back the criminals.” And this was true with the Obama administration, it was true for many, many years.",
    "Joe Biden defunded the border wall and stopped all future construction even on small open sections that just needed to be finished up, routine little work it’s already been bought.",
    "At the same time, the new administration unilaterally withdrew our crippling sanctions on Iran, foolishly giving away all of America’s leverage before negotiations have even begun.",
    "We believe in standing up to China, shutting down outsourcing, bringing back our factories and supply chains, and ensuring that America not China dominates the future of the world.",
    "The former president spoke about the achievements of his administration, which included tax legislation, making the United States energy independent and addressing border security.",
    "The future of the Republican Party is as a party that defends the social, economic, and cultural interests and values of working American families of every race, color, and creed.",
    "But the Biden administration is put the vile coyotes back in business and has done so in a very, very big way under the new administration, catch and release has been restored.",
    "It’s amazing considering that the Democrats’ number one priority was to make sure that the wall would never, ever get built, would never, ever happen, would never get financed.",
    "As we gather this week, we’re in the middle of a historic struggle for America’s future, America’s culture and America’s institutions, borders, and most cherished principles.",
    "Nancy Pelosi and the Democrats in Congress are racing to pass a flagrantly unconstitutional attack on the First Amendment and the integrity of our elections known as HR One.",
    "And I said, “They’re great.” And I want to thank everybody in this room and everybody all throughout the country, throughout the world if you want to really know the truth.",
    "The people, the spirit, and there are, as you probably heard a little while ago, I mean, there’s more spirit now than there’s ever been, including even before the election.",
    "Wait until the contractors get to them and they say, “No, it costs this much more money not to finish the small sections than if we finished it,” that’s going to be nice.",
    "But the press refused to ask the questions and when I asked the questions on television, on the debate, Chris Wallace, in this case, and others refused to let him answer.",
    "His first priority was to open up borders to unvetted travelers from Libya, Yemen, Syria, Somalia [inaudible 00:33:14] other countries where strict vetting cannot occur.",
    "So they come in and they can help us as opposed to coming here and not being good for us, including criminals, of which there are many, it means no riots in the streets.",
    "And the only people that should be allowed to vote by mail are people that can be proven to be either very sick or out of the country or military where they can’t do it.",
    "And now we have to use Republicans to take care of the election frauds and all of the other things that are happening that shouldn’t be allowed to happen in our country.",
    "We’re educating students on the [inaudible 00:23:55] but our own people, children of our citizens, citizens themselves are not getting the education that they deserve.",
    "And when we do, history will show that this was the moment when we could have given up, when we could have despaired, but instead we chose to keep on pushing forward.",
    "You catch them, you take their name, they may be killers, they may be rapists, they may be drug smugglers, you take their name and you release them into our country.",
    "And I said, “We’re not going to pay them anymore.” So after I said that, and I stopped payment, like a term that we use in the world of business, let’s stop payment.",
    "But I said, “Did anybody ever say that to Ronald Reagan or to any of our great … .” And to the best of all of these political professionals’ knowledge and pollsters.",
    "Some people are irreplaceable as Sean Hannity would say, and he said, “Rush is replaceable,” but his spirit lives on and that’s something that we need and we love.",
    "When illegal aliens trespass across our borders, they were prominently caught, detained and sent back home and these were some rough customers, I want to tell you.",
    "I started that hearing, we really where … we’re getting word of that, hearing that during some of the rallies, especially the latter rallies where we set records.",
    "Joe Biden has shamefully betrayed America’s youth and he is cruelly keeping our children locked in their homes, no reason for it whatsoever, they want to get out.",
    "Can you imagine if you had to go through what all of the countries of the world who are now getting the vaccine or soon will be getting it from various companies.",
    "I’d grow out and I’d watch somebody who came in second in New Hampshire or first in Iowa and that was the end and they became famous for the rest of their lives.",
    "It took them the new administration only a few weeks to turn this unprecedented accomplishment into a self inflicted humanitarian and national security disaster.",
    "The democrats use the China virus as an excuse to change all of the election rules without the approval of their state legislatures, making it therefore illegal.",
    "There should be a 100 percent requirement to verify the citizenship of every person who votes and there must be a chain of custody protections for every ballot.",
    "Thanks to my coattails, democrats failed to flip a single state legislature… Think of it… Or a legislative chamber because Republicans came out to vote for me.",
    "To top it all off, the Biden people are pushing a bill that would grant mass amnesty for millions of illegal aliens while massively expanding chain migration.",
    "Last year, I predicted to you that the extremist corruption and incompetence of the Biden administration would be literally unprecedented in American history.",
    "As you can see, the early weeks of the Biden administration of nothing less than they’ve been a catastrophe for American workers and for American families.",
    "If they do what they’re doing, Florida… And that legislation will pass and Texas and others will have tremendous power to do what’s right and what’s fair.",
    "So dumb.”\nFormer President Trump talked about 2020 election and called for election reform as he spoke about what the country needs to do moving forward.",
    "This alone should be reason enough for Democrats to suffer withering losses in the midterms and to lose the white house decisively four years from now.",
    "When I came into office, those countries were refusing to take back illegal alien gang members, including MS13, the most vicious probably of them all.",
    "They are around, they won’t be around long because they’re going to have a big problem when their record is… We’re 0 and 16, but we’re getting better.",
    "We all knew that the Biden administration was going to be bad, but none of us even imagined just how bad they would be and how far left they would go.",
    "You know they kept saying, “He’s going to start a brand new party.” We have the Republican party it’s going to unite and be stronger than ever before.",
    "And then what happened is one in particular told me from a great swing state said, “You know, I thought I was going to lose my position, lose my race.",
    "If Republicans can be censored for speaking the truth and calling out corruption, we will not have democracy and we will have only left wing tyranny.",
    "That’s because the financial and economic foundation we built was so strong that unlike other countries, who are having a hard time, we didn’t break.",
    "I didn’t come up with it, but what it means is great deals, great trade deals, great ones, not deals where we give away everything, our jobs, money.",
    "Two vaccines produced in record [inaudible 00:26:51] others on the way, including the Johnson and Johnson vaccine that was approved just yesterday.",
    "Their callous indifference to working families is equally clear when it comes to the critical matter of getting Americans’ children back to school.",
    "Automatically registers every welfare recipient to vote and puts unaccountable unelected bureaucrats in charge of drawing congressional districts.",
    "Biden’s radical immigration policies aren’t just illegal, they’re immoral, they’re heartless and they are a betrayal of our nation’s core values.",
    "All of the things we just talked about, you better go out and do it because this country has not been treated fairly by you for many, many years.",
    "That’s where you come in and everybody comes in, your grandmother, your father, your mother, your brother, your cousins, they come in so easily.",
    "Talked about energy, I said, “This guy actually he’s okay with energy.” He wasn’t okay with energy, he wants to put you all out of the business.",
    "Standing before you today, I am supremely confident that for our movement, for our party and for our country, our brightest days are just ahead.",
    "You had free oil almost for a period of time and one way I was proud of it, but we also had to save the energy industry and it worked out well.",
    "And by the way, we took in hundreds of billions of dollars from China during my administration, hundreds of … and they never gave us 25 cents.",
    "And the republicans don’t get this, and the other things I’m going to say, that you should, like the supreme court, be ashamed of yourselves.",
    "Illegal immigrants are now being apprehended and released along the entire Southern border, just the opposite of what it was two months ago.",
    "I said that a long time ago when I made the first remarks, when I came down the escalator with our great future first lady, who says hello.",
    "But I said, so if we went in, we could get it for 39 million, which is what China, not 500 million, which is what we were stupidly paying.",
    "Now they know it’s … just like with the wall, just like with voter ID, when you need to go into anything that’s Democrat run, you need it.",
    "They’re pouring fumes and we’re trying to protect everything and building products for three times more than [inaudible 00:40:26] say no.",
    "Already the Biden administration has proved that they are anti-jobs, anti-family anti-borders, anti-energy, anti-women, and anti-science.",
    "And I had no idea how popular was… I didn’t even know if I would be able to politically because people were so happy when I did get out.",
    "And they’re already doing what they were doing before, and they’re taking the money and that’s just a small portion of what’s going on.",
    "What coach, as an example, wants to recruit a young woman to compete if her record can easily be broken by somebody who was born a man.",
    "We believe in law and order and we believe that the men and women of law enforcement are heroes who truly deserve our absolute support.",
    "We took in hundreds of billions and during negotiations, they would say, “Look, the one thing, we don’t want any more of these tariffs.",
    "We are gathered this afternoon to talk about the future of our movement, the future of our party and the future of our beloved country.",
    "Brought him from one point down to 20 points up and he won his race in the great state and actually the great Commonwealth of Kentucky.",
    "We’re illegal aliens and dead people are voting, and many other horrible things are happening that are too voluminous to even mention.",
    "The Democrats now say we have to pass their $1.9 trillion boondoggle to open schools, but a very small part of it has to do with that.",
    "And it means a strong military and taking care of our vets, but a strong military, which we have totally rebuilt, we have rebuilt it.",
    "All done by local politicians or local judges, as opposed to state legislatures as required by the Constitution of the United States.",
    "Yet all of the election integrity measures in the world will mean nothing if we don’t have free speech and that’s where we’re at now.",
    "With the talent and dedication of everyone here today … And you have tremendous, not only dedication, tremendous talent in this room.",
    "But it’s time that we have to put forces together because these people with their big tech and the fake news media right back there.",
    "“How did you do?” “Well we did much better the second time.” “Oh, you did, really?”\nWhat a disgrace, what a disgrace to our country.",
    "They didn’t have the courage, the supreme court, they didn’t have the courage to act, but instead used process and lack of standing.",
    "We had almost 25 … if you think of it … we had almost 20 states go into the supreme court so that we didn’t have a standing problem.",
    "Companies that leave America to create jobs in China and other countries that have ripped us off for years, should not be rewarded.",
    "The RINOs that we’re surrounded with will destroy the Republican Party and the American worker and will destroy our country itself.",
    "But now it’s going the opposite because now they’re taking this incredible energy independence away from the people of our country.",
    "The only reason that most parents do not have that choice is because Joe Biden sold out America’s children to the teacher’s unions.",
    "Tragically suicide attempts have skyrocketed and student depression is now commonplace and at levels that we’ve never seen before.",
    "The only division is between a handful of Washington, DC, establishment, political hacks, and everybody else all over the country.",
    "Today I want to outline the steps that we must take to have an election system in this country that is honest, fair, and accurate.",
    "This should never be allowed to happen to another presidential candidate or presidential race, should never be allowed to happen.",
    "They ripped up the diplomatic agreements we negotiated with Honduras, Guatemala and El Salvador to shut down illegal immigration.",
    "It was so great for everybody of all backgrounds that even after the China virus, we are leading the world, nobody’s even close.",
    "You saw that more people … you take a look at the votes, when you have more votes than you have people, that’s a problem, right?",
    "We’d fly them in, they wouldn’t let the plane land, we’d bus them and they wouldn’t let the buses get anywhere near the border.",
    "Remember I used to say don’t go in, but if you’re going to go in, keep the oil [inaudible 00:35:09] but we didn’t keep the oil.",
    "By the time I left that magnificent house at 1600 Pennsylvania Avenue, almost 20 million Americans had already been vaccinated.",
    "And once COVID happened, I no longer cared so much about the great deal, because what happened with that was just disgraceful.",
    "If you wanted to go back in [inaudible 00:39:58] the cleanest air, the cleanest water and everything else that we’ve ever had.",
    "They just followed now, they’re following our plan, but this has been something that they really call it an absolute miracle.",
    "A lot of things going on to so many wonderful friends, Conservatives and fellow citizens in this room all across our country.",
    "I stand before you today to declare that the incredible journey we begun together we went through a journey like nobody else.",
    "And democrats even admitted in Time-\nAnd Democrats even admitted in Time Magazine, which is, I would say on the liberal side.",
    "I also want to pay my love and respect to the great Rush Limbaugh [applause] who is watching closely and smiling down on us.",
    "So we’d catch a murderer we’d want to bring them back to Guatemala or Honduras or El Salvador, they wouldn’t take them back.",
    "Over the past four years my administration delivered for Americans of all backgrounds like never before, like never before.",
    "We came roaring back and now our stock market and your 401ks are again at record levels, higher than ever before actually.",
    "On top of all of that, we have even created the Space Force, the first new branch of the United States in nearly 75 years.",
    "He has effectively ordered a shutdown of ICE, halting virtually all deportations, everyone, murderers, everybody, no more.",
    "So on behalf of the moms, dads and children of America, I call on Joe Biden to get the schools open and get them open now.",
    "What has taken place over the last year under our administration would have taken any other president at least five years.",
    "“We want Republican leaders who are loyal to the voters and who will work proudly for the vision that I’ve laid out today.",
    "[Addressing a member in the audience] We will be united and strong like never before, we will save and strengthen America.",
    "We are committed to defending innocent life and to upholding the Judeo-Christian values of our founders and our founding.",
    "I should have said, “We will not have a wall.” And then they would have said, “Let’s build a wall.” I made a big mistake.",
    "Another one of the most urgent issues facing the Republican Party is that of ensuring fair, honest, and secure elections.",
    "We want Republican leaders who are loyal to the voters and who will work proudly for the vision that I’ve laid out today.",
    "We, we got more votes than any incumbent, any incumbent president in the history of our country, almost 75 million votes.",
    "Border security is just one of the many issues on which the new administration has already betrayed the American people.",
    "We had a call recently just before leaving office, the vets had a 91% approval rating for the way we took care of them.",
    "19 years in Afghanistan, we have it down to almost [inaudible 00:35:00] left and I hear they might want to go back in.",
    "What the Trump administration has done with vaccines has in many respects, perhaps saved large portions of the world.",
    "He also addressed Russia’s invasion of Ukraine calling President Putin “smart” and criticizing NATO and U.S. leaders.",
    "In the history of our country, and it has taken place for years in Pennsylvania and Detroit and various other places.",
    "And solar, I love solar [inaudible 00:43:25] have the capacity to do what we have to do to make America great again.",
    "The task for our movement and our party is to stand up to this destructive agenda with confidence and with resolve.",
    "But can you imagine if all of those countries had to go through what they’ve been going through over the last year?",
    "We have to stand tall as the [inaudible 00:22:10] for law abiding Americans and others when they’re in our country.",
    "But in effect, it will soon be hundreds of times as millions of people flow up through our soon to be open borders.",
    "Republicans should be the party of honest elections that can give everyone confidence in the future of our country.",
    "They would have local courts and local politicians change the rules in some cases a day or two before the election.",
    "And that’s why I’m announcing that I will be actively working to elect strong, tough and smart Republican leaders.",
    "It even requires that the U.S. government provide a illegal border crossings with taxable funded lawyers, lawyers.",
    "Young girls and women are in sex that they are now being forced to compete against those who are biological males.",
    "The hardest working people, hard working American patriots, it’s just getting started and in the end we will win.",
    "These are the convictions that define our movement today and must define the Republican Party in the years ahead.",
    "This alone would have easily changed the outcome of the election at levels that you wouldn’t have even believed.",
    "And no President has ever, ever… We’re talking about a much lower number than we got… Has ever lost an election.",
    "We had the military, what they’ve done, our generals and all of the people what [inaudible 00:31:30] incredible.",
    "There’s no reason whatsoever why the vast majority of young Americans should not be back in school immediately.",
    "It’s a terrible thing that’s happening\nThe Republican party must hold Joe Biden and the Democrats accountable.",
    "Within his first few hours Biden eliminated our national security travel bans on nations plagued by terrorism.",
    "They’re talking about it all over the world man, I know you don’t like that but that’s OK. All over the world.",
    "And I was told by John McLaughlin that if… a great poster… That if you get to – we had 63 in 2016, 63 million.",
    "Once they think they can get in, they’re coming and they are coming at levels that you haven’t even seen yet.",
    "When I left office, and we’re very proud of this because this was something that they said could not be done.",
    "And that means that 100% of the increased availability that we have now was initiated by our administration.",
    "We will fight the onslaught of radicalism, socialism, and indeed it all leads to communism once and for all.",
    "Our security, our prosperity, and our very identity as Americans is at stake, like perhaps at no other time.",
    "If you just take that one element where they didn’t go through a legislature, it’s illegal, you can’t do it.",
    "Now more than ever is the time for tough, strong, and energetic Republican leaders who have spines of steel.",
    "They’re all coming to take advantage of the things that he said that’s luring everybody to come to America.",
    "But billions of dollars for schools remain unspent from the COVID relief bills that were passed last year.",
    "And they were doing great, they were doing great before that horrible thing from China came in and hit us.",
    "The greater the challenge and tougher the task, the more determined we must be to pull through to triumph.",
    "“Sir, if you get to 66 million you have it made.” We got to almost 75 million and what the hell happened?",
    "And that together we will make America prouder, freer, stronger and greater than it ever has been before.",
    "Now it’s higher in many ways, certainly in the stock pocket, it’s higher in many ways than it was before.",
    "We built a then and then like every other country in the world, it went down and then we built it again.",
    "And again, I want to thank Rush and Kathryn because what he did to get the word out has been incredible.",
    "And we started hearing, “We love you.” And I asked somebody because we really like Ronald Reagan, right?",
    "Our party is based on love for America and the belief that this is an exceptional nation blessed by God.",
    "Yet Biden said just a few days ago that when he got here, meaning the white house, there was no vaccine.",
    "Already, as president, Biden has urged [inaudible 00:32:19] legislation shredding your second amendment.",
    "They want to pass a bill where you don’t have to match signatures, where signatures don’t mean anything.",
    "They have millions and millions of ballots sitting around all over the place for long periods of time.",
    "It’s a scandal of the highest order and one of the most graven acts by any president in our lifetimes.",
    "In fact, the director of national institutes of health, Francis Collins, he’s Fauci’s boss, actually.",
    "Had we had a fair election, the results would have been much different, and we would have had a deal.",
    "But that’s one of the things, that’s one of the reasons that right now our farmers are doing so good.",
    "And now we have the best brand new equipment ever made and it was all produced right here in the USA.",
    "Under the radical Democrat policies, the price of gasoline has already surged 30% since the election.",
    "We will lead the conservative movement and the Republican Party back to a totally conclusive victory.",
    "This election was rigged and the supreme court and other courts didn’t want to do anything about it.",
    "It means support for the forgotten men and women who have been taken advantage of for so many years.",
    "And in addition to that, we were taking in billions and billions and billions of dollars from China.",
    "We believe in patriotic education and strongly oppose the radical indoctrination of Americans youth.",
    "And in one of his first official acts, which was incredible, because again, he talked about energy.",
    "Republicans, conservatives must open up more platforms and repeal Section 230 Liability Protection.",
    "There’s only one way to contribute to our efforts, to elect America first Republican conservatives.",
    "It has just been stated that President Trump’s endorsement is the most powerful asset in politics.",
    "To get into the Democratic National Convention, when they had the convention, you needed voter ID.",
    "Joe Biden has had the most disastrous first month of any president in modern history, that’s true.",
    "It was all worked, nobody’s ever seen anything like we did and now he wants it all to go to hell.",
    "They don’t want to complete little sections in certain little areas, they don’t want to complete.",
    "Mr McLaughlin just gave me numbers that nobody’s ever heard of before, more popular than anybody.",
    "We have raised free thought, we stand up to political correctors, and we reject left wing lunacy.",
    "And you saw what happened in Detroit and Philadelphia and many other places, swing states mostly.",
    "No incumbent President who received more than 75% of the primary vote has ever lost an election.",
    "And the next day I was right.” He said he won the election by a lot, “And you lost the election.",
    "That’s because of the foundation and no country comes even close to competing with our comeback.",
    "The records that stood for years, even decades, are now being smashed with [inaudible 00:46:00].",
    "No matter where you go in the world, MS13, they do things that even the worst don’t think about.",
    "You know, I was… Remember they were going to give you 37 a barrel, but you got to take it away.",
    "You are the person that brought everybody out to vote.” And I happen to agree with that 1,000%.",
    "We seem to have more votes than we have people, a lot more votes, and election changing number.",
    "We’re not talking about a number where you can’t … no, these aren’t election changing numbers.",
    "I received almost 1.5 million more votes than all of the Republican House candidates combined.",
    "And what good does it do when we’re clean, but China’s not, and Russia’s not, and India’s not.",
    "I mean, it’s peanuts compared to the way other countries rip us off but that’s a lot of money.",
    "And I’ll bet you a lot of the people within that union, they agree with everything I’m saying.",
    "We ended catch and release, ended asylum fraud and brought illegal crossings to historic lows.",
    "When I left office just six weeks ago, we had created the most secure border in U.S. history.",
    "But if the Democrats have their way, we are heading from energy dominance to energy disaster.",
    "It means very strong protection for the second amendment and the right to keep and bear arms.",
    "With me at the top of the ticket, not a single Republican member of Congress lost their race.",
    "We need your help to win and to fight big tech and the radical left and the DC establishment.",
    "These aren’t little numbers, these are numbers that in each state is a transformative number.",
    "And that’s on top of all of these other forms of cheating, but this is the most basic of all.",
    "But now there isn’t a debate because they refuse to allow our side to even speak or be heard.",
    "And many legislators, many legislators told me, they said, they’re going to lose their race.",
    "It’s not good for women’s sports, which worked so long and so hard to get to where they are.",
    "Under my administration, we stopped the child smugglers, we dismantled the criminal cartels.",
    "To each and every one of you here at CPAC I am more grateful to you than you will ever know.",
    "It’s been incredible and little sections of it to complete, they don’t want to complete it.",
    "We stopped payment and they very quickly came to the table and we made a deal very quickly.",
    "We had made historic peace deals in the Middle East like nobody thought were even possible.",
    "When I withdrew from the WHO, and you know the whole story with that, they called it badly.",
    "And in her state, her poll numbers have dropped faster than any human being I’ve ever seen.",
    "And the supreme court, again, didn’t have the guts or the courage to do anything about it.",
    "In Pennsylvania, they had hundreds of thousands of more votes than they had people voting.",
    "So go out there and do whatever you can because we’re going to help a lot of great people.",
    "So that it’s now 50/50, instead of Republicans being down anywhere from eight to 10 seats.",
    "And if you compare that to his other elections, I’m sure you’ll see something interesting.",
    "And the two that lost were beaten by people claiming to be more Trump than their opponent.",
    "In another horrendous surrender, he agreed to get back into the World Health Organization.",
    "I actually believe he said that because he didn’t really know what the hell was happening.",
    "There’s no masks, there’s no double masks, that was a new one that came out two weeks ago.",
    "I handed the new administration what everyone is now calling a modern day medical miracle.",
    "And we’re one country, we can’t afford the problems of the world as much as we’d love to.",
    "When you talk about… They probably have them going, because they also care about ratings.",
    "But for voting, which is our most sacred institution, they don’t want to let you have it.",
    "And of course the warmonger, a person that loves seeing our troops fighting, Liz Cheney.",
    "Including, I guess on December 21st, we took care of Joe Biden, because he got his shot.",
    "Joe Biden and the Democrats are even pushing policies that would destroy women’s sports.",
    "He never talked about that during a debate because he wouldn’t have gotten away with it.",
    "One of my proudest accomplishments as president was to make America energy independent.",
    "Surrendering millions of jobs and trillions of dollars to all of these other countries.",
    "It means strong borders, but people coming into our country based on a system of merit.",
    "And we affirm that the constitution means exactly what it says, as written, as written.",
    "We honor George Washington, Abraham Lincoln, Thomas Jefferson, and all national heroes.",
    "It’s horrible the way they treat the legacy of our country, the culture of our country.",
    "And by the way, not one American soldier has been killed in Afghanistan in over a year.",
    "And they decide, now to go back into the World Health Organization and pay 500 million.",
    "You’ll be hearing more and more about that as we go along, but that’s what it leads to.",
    "WATCH: President Donald J. Trump at CPAC 2022\nTRANSCRIPT\nWell thank you very much CPAC.",
    "They don’t want debate because we have easy victories in a debate, very easy victories.",
    "Regardless of your political views, this should concern you as a constitutional matter.",
    "There should be a legitimate reason for someone to vote absentee, has to have a reason.",
    "We can never let this or other abuses of the 2020 election be repeated or happen again.",
    "As we discussed earlier, we’re in a struggle for the survival of America as we know it.",
    "And instead we won 15 seats and almost… Oh, why couldn’t we have done a couple of more?",
    "And sir, it’s not possible that you lost because you’ve got a lower number than I did.",
    "But there’s tremendous, never like this, because they used COVID as a way of cheating.",
    "And by the way, the border patrol and ICE are some of the great heroes of our country.",
    "They’re cheating the next generation of Americans out of the future that they deserve.",
    "But in all fairness to China, we made a trade deal with them, this was prior to COVID.",
    "As long as these guys have their say, because you know, it’s a shame what’s happening.",
    "I could have made an unbelievable deal and got back in, but I didn’t want to do that.",
    "First Fauci said, you don’t need masks, no masks, no good, now he wants double masks.",
    "Biden has failed in his number one duty as chief executive, enforcing America’s laws.",
    "But of course, as you know, they have a very close, personal relationship with China.",
    "I believe your numbers are bigger than their numbers, but you’re nicer than they are.",
    "And I saw all these Trump signs and the American flags and the spirit on the streets.",
    "'”He said, “But you were far, far, far more popular than me.” They do lots of polls.",
    "We held rallies for some of the senators that went down and nobody talks about that.",
    "Well, he would have because they cheated so much it probably wouldn’t have mattered.",
    "All of a sudden somebody comes along and beats it by a hundred [inaudible 00:45:36].",
    "Their party is based upon unvarnished disdain for America, its past, and its people.",
    "NAFTA was one of the worst deals ever made, probably the worst trade deal ever made.",
    "Maybe we could have found something, or if the media did its job, which they don’t.",
    "Some say it’s the greatest thing to happen in hundreds of years, hundreds of years.",
    "There is no better example than the new and horrible crisis on our Southern border.",
    "But he went from one point down to 20 points up very quickly, immediately actually.",
    "If you want to help us take back the future of our country, go to donaldjtrump.com.",
    "Together, in the coming years, we will carry forward the torch of American liberty.",
    "And Governor Ron DeSantis of Florida, and in Texas and other states are doing this.",
    "“Of course he’s smart,” Trump said, “But the real problem is our leaders are dumb.",
    "We took a risk because if we didn’t do that, you still wouldn’t have the vaccines.",
    "The mental and physical health of these young people is reaching a breaking point.",
    "And when they wear out all over the country, you see them, nobody takes them down.",
    "More sprit now than we’ve ever seen, because people are seeing how bad it can be.",
    "There’s never been a journey like it, there’s never been a journey so successful.",
    "We have a very sick and corrupt electoral process that must be fixed immediately.",
    "It’s a disaster for our country that we can allow something so corrupt to happen.",
    "And then a Republican President will make a triumphant return to the White House.",
    "And thank God we’ve rebuilt our military, but it’s a tremendous economic threat.",
    "Our election process is worse than that in many cases of a third world country.",
    "The time has come to break up big tech monopolies and restore fair competition.",
    "I got over 11 million, very close to 12 million more votes than we got in 2016.",
    "Hate to say that ladies, but got a lot of new records, they’re being shattered.",
    "Wait till you see what happens and we cannot let this stuff continue to go on.",
    "Destroying [inaudible 00:40:47] or the 9,000 or the 11,000 jobs that you hear.",
    "They want to promote socialism, ultimately leading unfortunately to communism.",
    "And I want you to know that I’m going to continue to fight right by your side.",
    "No President has ever lost an election after carrying Florida, Ohio, and Iowa.",
    "The people that did this to our country, they should be ashamed of themselves.",
    "We should eliminate the insanity of the mass and very corrupt mail-in voting.",
    "That’s why the party is growing so rapidly and is becoming a different party.",
    "Many people have asked what is Trumpism, a new term being used more and more.",
    "And I dealt with Russia [inaudible 00:44:39] and they cut back on production.",
    "Actually, as you know, they just lost the white house, but it’s one of those.",
    "How much do we pay them?” Sir, we pay them approximately $500 million a year.",
    "Let’s start a new party and let’s divide our vote so that you can never win.",
    "They knew the wall would work, but didn’t want to have it because we wanted.",
    "They had to brag about it, because what they did, they had to brag about it.",
    "I mean it’s being studied and the level of dishonesty is not to be believed.",
    "And I said, “I wonder if I’m doing the right thing here?” But you know what?",
    "They say, “Despite how well they did, Trump didn’t win.” That’s such a lie.",
    "“We will not have a wall … We need a wall immediately,” said Chuck Schumer.",
    "People don’t know he was a great wrestler, tremendous numbers of victories.",
    "We not only didn’t release them, we had them brought back to their country.",
    "But they could have made a great deal instead of just saying we’re back in.",
    "As soon as he got through that, he said, no, of course everybody can frack.",
    "It’s incredible what it’s done for our farmers who are doing fantastically.",
    "In addition, he’s already increased refugee admissions by nearly 10 times.",
    "They should be ashamed of themselves for what they’ve done to our country.",
    "In the Senate, I was undefeated in endorsements with a record of 21 and 0.",
    "Even with COVID, even with all of the things, the numbers are staggering.",
    "Fred Upton, Jamie Herrera Butler, Peter Meyer, John Katko, David Valadeo.",
    "We took this bet, we made a bet because we feel we’re on a certain track.",
    "Many, many years.” We used to lose $504 billion trade deficit with China.",
    "Became number one, bigger than Saudi Arabia, bigger than Russia by a lot.",
    "And you’re going to see costs go like you have never seen them go before.",
    "And the American Conservative Union for hosting this extraordinary event.",
    "In just one short month we have gone from America first to America last.",
    "They’re not giving us their best and their finest, remember I said that?",
    "He revoked the executive order cracking down on deadly sanctuary cities.",
    "Recently said that our operation warp speed was absolutely breathtaking.",
    "We need to help protect funding for our military and for our great vets.",
    "For the first time in decades, we won 26 of 26 toss up races, toss ups.",
    "We let them attack our businesses and we don’t attack their businesses.",
    "We’ve been set back so greatly with other countries and with the world.",
    "We don’t want people coming in where they had an ideology or a problem.",
    "The Biden policies are a massive win for other oil producing countries.",
    "The FDA said it, everybody said it, any article that you read said it.",
    "We would have those wonderful debates, he would never talk about this.",
    "In addition, it virtually eliminates voter ID requirements nationwide.",
    "And I helped keep many senators in their seats and they will admit it.",
    "We will do what we’ve done right from the beginning, which is to win.",
    "We didn’t know all about him and the press because they’re fake news.",
    "You see it every day, just turn on the news, you’ll see it every day.",
    "And for four years, I fought like hell to save your second amendment.",
    "Never let them take the credit because they don’t deserve the credit.",
    "For approximately $500 million a year, which is what we were paying.",
    "And it costs many, many times more than natural gas, which is clean.",
    "You’ll go to the… Remember they used to go to the little small vans.",
    "You know, the world is actually a small [inaudible 00:40:18], right?",
    "When you’re saying that about … I hate to say it, am I a politician?",
    "It means low taxes and eliminated job killing regulations, Trumpism.",
    "Republicans believe that the deeds of every citizen must come first.",
    "I came here and he was giving me 95 percent, 97 percent, 92 percent.",
    "They didn’t have the guts or the courage to make the right decision.",
    "They used it as a way of getting what they’ve wanted for many years.",
    "We did even better in the second election than we did in the first.",
    "I think we can probably say, never been seen anywhere in the world.",
    "No, you do that, you make a deal, and then you do what they wanted.",
    "I don’t know, Matt Schlapp, I don’t think you would have done that.",
    "Why would China pay 39 million and we’re paying almost 500 million?",
    "It takes 60 to a hundred days to manufacture and inspect new doses.",
    "And as conservatives and Republicans, never forget that we did it.",
    "I said that a long time ago, and we turned out to be 100% correct.",
    "We began it together four years ago and it is far from being over.",
    "Because of my efforts campaigning, we had huge gains in the House.",
    "My endorsement of Mitch McConnell, at his request… It’s all right.",
    "We must pass comprehensive election reforms and we must do it now.",
    "Again, you have to go to the legislatures to get these approvals.",
    "When you look at the crowds outside that want your seat so badly.",
    "Who knows, I may even decide to beat them for a third time, okay?",
    "It’s the teacher’s union, it’s the votes and it shouldn’t happen.",
    "It went all the way up to the Supreme Court of the United States.",
    "Did you see grain prices and grain sales are at an all time high?",
    "If this does not change, women’s sports, as we know it, will die.",
    "It costs many more… And can fuel our great [inaudible 00:43:20].",
    "To go back in, they wanted us so badly, you could’ve negotiated.",
    "The blackouts we saw in California last summer and all the time.",
    "By the hundreds of thousands, by the millions they’ll be coming.",
    "If you include them, you’ll see numbers that are much different.",
    "And we have a lot of people in our party that like to win, Jim.",
    "We would have had a deal with Iran within [inaudible 00:36:51].",
    "I would go to Dover and I would see caskets, coffins coming in.",
    "Remember last year, I said, we’re going to watch the president.",
    "Russia goes by an old standard, which was not a clean standard.",
    "Would have cost us hundreds of thousands and millions of jobs.",
    "They wanted those sanctions off of… Took them off for nothing.",
    "Walls and wheels, those are two things that will never change.",
    "I was told the President of the United States has no standing.",
    "And that doesn’t include the votes and ballots they threw out.",
    "But when they talk about election, they turn off the cameras.",
    "They’ve got everything going, but their policies are no good.",
    "Your second amendment is in far bigger trouble than you know.",
    "Joe Biden is only implementing the plan that we put in place.",
    "And other countries, but we get hit right from the beginning.",
    "And remember, these are structural columns with fans on them.",
    "We will now be relying on Russia and the Middle East for oil.",
    "So what happened with the people, they wouldn’t go to China.",
    "Now I don’t think he said that, frankly, in a malicious way.",
    "When I left office, we had virtually ended the endless wars.",
    "But it’s had an impact that nobody would have even believed.",
    "So they’re all coming because of promises and foolish words.",
    "In last year’s congressional primaries, 120… Listen to this.",
    "Military, law and order, great trade deals, great education.",
    "So hopefully, they’ll get rid of her with the next election.",
    "We need to save your Second Amendment, which is under siege.",
    "Because the fake news doesn’t ever talk about these numbers.",
    "And it was a shocker to those people that go for the stats.",
    "We need election integrity and election reform immediately.",
    "It took us a year and a half extra because of that mistake.",
    "We didn’t know what the hell he was talking about actually.",
    "I want to thank my great friends, Matt and Mercedes Schlap.",
    "I said why are we paying 500 million and they’re paying 39.",
    "And the distribution is moving along according to our plan.",
    "And I have, nobody has more respect for teachers than I do.",
    "These tariffs … .” Those tariffs, we took in so much money.",
    "I used to tell China, “Look, look, go and get lot of wheat.",
    "And our military has never been stronger than it is today.",
    "The mission of the Democrat Party is to promote socialism.",
    "Somebody said well, that’s going to be very controversial.",
    "The United States became the number one energy superpower.",
    "They’re going to grow up and they’re going to have a scar.",
    "But now Joe Biden has wrecked this great deal, wrecked it.",
    "1.5 million doses were administered on my final day alone.",
    "Those are great numbers and I want to thank you very much.",
    "And I went out with my wife the night before the election.",
    "What happened when they closed all of the counting booths?",
    "And that’s through Save America PAC and donaldjtrump.com.",
    "But once we got it done, I said I now love you very much.",
    "And they must get back and get back right now, right now.",
    "I pushed the FDA like they have never been pushed before.",
    "It’s a very sad and very stupid thing that they’re doing.",
    "I had oil where they were actually paying you to take it.",
    "I hate to admit it, but it’s an honor that you would say.",
    "So many elements of farms and farmers, and they love me.",
    "And a loss for the United States and our great citizens.",
    "A lot of new records are being broken in women’s sports.",
    "We told those countries, sorry, straighten out your act.",
    "He’s watching and he’s loving it and he loves Catherine.",
    "So hence we have, congratulations, the Republican Party.",
    "It’s called other things, but it’s called common sense.",
    "I said, ‘You know, darling, I think we’re going to win.",
    "And that the Trump administration deserves full credit.",
    "They said, well, we’re going to not have any sanctions.",
    "If you’re sick, we have things now that are incredible.",
    "They couldn’t believe what they were getting away with.",
    "What coach, if I’m a coach, I want to be a great coach.",
    "They’ll say, that’ll be about $200 to fill up your van.",
    "We know that the rule of law is the ultimate safeguard.",
    "It was absolutely insane that this could keep going on.",
    "We celebrate our rich heritage and national traditions.",
    "They got away from the big ones that everybody wanted.",
    "You wait till you see what happens with your gasoline.",
    "They got a fortune, they got paid $500 million a year.",
    "Not only our country, but large portions of the world.",
    "Even the New York Times is calling out the Democrats.",
    "The windmill calamity that we’re witnessing in Texas.",
    "What’s better than what this guy has done for Russia?",
    "Remember we would kid, but I wasn’t actually kidding.",
    "And I won them all and I won them by a lot, by a lot.",
    "Speaking of that, I heard Jim Jordan did a great job.",
    "He’s a winner and a leader and he doesn’t play games.",
    "So many people told me, “You can’t get in that place.",
    "They want more time, they want this, they want that.",
    "They didn’t have the guts to do what should be done.",
    "For some reason we just don’t… we don’t get it done.",
    "We’d be down eight to 10 seats if I didn’t campaign.",
    "We’re going back into the World Health Organization.",
    "You know that through the World Health Organization.",
    "It’s the highest number in the history of the polls.",
    "It was called a calculated bet or a calculated risk.",
    "So we could have made the same deal that China had.",
    "The good news is in her state, she’s been censured.",
    "Who would’ve thought that was going to happen, Jim?",
    "After this, they may not stick with those policies.",
    "“You don’t have standing.” Let’s not talk about it.",
    "And that’s what the Biden administration is doing.",
    "And the republicans have to do something about it.",
    "He was college champion for a long period of time.",
    "If you think about it, we built the economy twice.",
    "And remember, it’s going to be very close in Iowa.",
    "And of course, we respect our great American flag.",
    "And now they’re starting to do really well again.",
    "Like the USMCA replacement of the horrible NAFTA.",
    "First of all, China doesn’t kick in for 10 years.",
    "How this is environmentally good for our country.",
    "Because the people that made the deal are stupid.",
    "It’s going to bail out badly run Democrat cities.",
    "They weren’t coming because they couldn’t get in.",
    "The windmills that don’t work when you need them.",
    "The path ahead will not be easy, but we will win.",
    "And when you talk about election, they turn off.",
    "That’s almost as good as Jim’s wrestling record.",
    "Very simple, it’s really quite simple, isn’t it?",
    "We had the case led by the great State of Texas.",
    "Wait until you see those bills start pouring in.",
    "So I asked, “How much do we pay these countries?",
    "It shows you how unpainful that vaccine shot is.",
    "That includes any bill having to do with energy.",
    "We must protect the integrity of women’s sports.",
    "As I said, a movement, like has never been seen.",
    "It’s amazing that you still have a country left.",
    "500, not million, $504 million is a lot, right?",
    "It was tired, it was depleted, it was obsolete.",
    "Every ounce was like a big deal for many years.",
    "Energy prices are going to go through the roof.",
    "I was getting called from all of the countries.",
    "So I talk about it all the time at CPAC, right?",
    "They have never been pushed like I pushed them.",
    "Well, there is evil there, but they’re vicious.",
    "This is a terrible, terrible, painful struggle.",
    "The press, the fake news spins it differently.",
    "What happened at three o’clock in the morning?",
    "Who would’ve thought that was going to happen?",
    "Gee, I wonder what happens with those ballots?",
    "They should be tarriffed, fined, and punished.",
    "Hundreds of thousands and millions of ballots.",
    "We have a little problem adjusting in Detroit.",
    "But remember, we took care of a lot of people.",
    "And if we had an honest media, which we don’t.",
    "If they were going to go back in, that’s fine.",
    "You know, a lot of people forget, we ended it.",
    "And what happened is they became competitive.",
    "No, but that was not a topic of conversation.",
    "And they talked about Russia, Russia, Russia.",
    "And I don’t even know, is that controversial?",
    "Countries with tremendous terrorism problems.",
    "A much larger in terms of population country.",
    "Does anybody understand what I’m saying here?",
    "But you’d be starting to make them right now.",
    "And therapeutic relief, also, if you’re sick.",
    "They refused to let him answer the questions.",
    "No social distancing, no nothing, no nothing.",
    "He loved you Catherine, I will tell you that.",
    "Without honest elections, who has confidence?",
    "And these are just numbers that are massive.",
    "Effectively ends all registration deadlines.",
    "So how the hell is it possible that we lost?",
    "With your help, we will take back the House.",
    "So we stopped payment, they were delinquent.",
    "Not too many of those coaches around, right?",
    "And nobody’s ever seen a movement like this.",
    "They built a lot of it back in our country.",
    "Now take 504 million, make it $504 billion.",
    "And in particular we reject cancel culture.",
    "And nobody’s ever had anything that we had.",
    "And we’ll go to $5, $6, $7 and even higher.",
    "I don’t believe we’ll have any electricity.",
    "What he signed with those executive orders.",
    "I’d see the parents and wives and husbands.",
    "We could have had it for the same as China.",
    "Unfortunately, he has proven me 100% right.",
    "They’re coming up by the tens of thousands.",
    "It’s a shame because it really is a threat.",
    "Requires states to give ballots to felons.",
    "The debate and discourse would take place.",
    "But the Republicans do not stick together.",
    "You don’t have Mitt Romney’s in the group.",
    "Congratulations on getting in, by the way.",
    "120 of 122 candidates I endorsed won… 120.",
    "So I like those two people very much also.",
    "Some rough customers entering our country.",
    "They called and they wanted us to stay in.",
    "You’d lose hundreds of millions of people.",
    "We still didn’t pay it but we made a deal.",
    "Our economic comeback has been incredible.",
    "Nobody’s ever heard that yet before, man.",
    "You must come back into the Paris accord.",
    "Almost all of them that were in the deal.",
    "I think it’s just crazy what’s happening.",
    "I just heard this one for the first time.",
    "I received almost… Listen to this number.",
    "And in turn, to make America great again.",
    "You know that, you saw what was going on.",
    "You couldn’t get it unless you had an ID.",
    "It had a massive impact on the election.",
    "They will take your seat in two seconds.",
    "And then somebody would make a decision.",
    "It’d be a long time before you ever saw.",
    "They weren’t things that were discussed.",
    "Countries that have tremendous problems.",
    "We got it approved and he terminates it.",
    "I think he’s a Democrat too, by the way.",
    "So it wasn’t very traumatic, obviously.",
    "But never let them forget, this was us.",
    "Now you watch how tough they negotiate.",
    "And they just say, we’re going back in.",
    "These endless wars, they go on forever.",
    "You wouldn’t have them for a long time.",
    "[inaudible 00:45:28] the weightlifting.",
    "We’d love to help but we can’t do that.",
    "It changes the outcome of the election.",
    "When I say, “I,” I am talking about we.",
    "Those are races that could go any way.",
    "There’s never been anything like that.",
    "So enjoy that when you go to the pump.",
    "It’s such an expensive form of energy.",
    "And that includes your electric bills.",
    "And we just said, we’re going back in.",
    "He never said he was going to do this.",
    "They were all on [inaudible 00:42:02].",
    "We had 56 unbelievable packed rallies.",
    "Now we have the USMCA, Mexico, Canada.",
    "But it’s a tremendous amount of money.",
    "Everyone says five years, five years.",
    "They’re the biggest fakers there are.",
    "He canceled the Keystone XL Pipeline.",
    "[Applause] And you know what this is?",
    "What happened at 3:02 in the morning?",
    "We need universal signature matching.",
    "They should be ashamed of themselves.",
    "We need one election day, not 45, 30.",
    "It’s my election, it’s your election.",
    "I made one big mistake in the world.",
    "“You were way, way ahead of me, sir.",
    "We will persist and we will prevail.",
    "God bless you and God bless America.",
    "Catherine, thank you for being here.",
    "But it’s so sad when you look at it.",
    "[inaudible 00:47:23] of our mission.",
    "You have to see outside the streets.",
    "I’m hearing that term more and more.",
    "They want to get rid of it, frankly.",
    "His position is morally inexcusable.",
    "Who loves you as much as I love you.",
    "But compared to trillions, it’s not.",
    "Those troops have largely come home.",
    "What are they bringing in with them?",
    "And it’s good that he got his shot.",
    "Are there any good business people?",
    "They get the lawyers, they lawyers.",
    "We take great pride in our country.",
    "Now it’s a party that’s incredible.",
    "And we’ve had tremendous victories.",
    "We’ll do that the next time around.",
    "The RINOs, Republican in name only.",
    "But the Republican Party is united.",
    "The public would make up its mind.",
    "You’re not as vicious as they are.",
    "All over, but swing states mostly.",
    "Nobody had ID.” You need voter ID.",
    "They better do something about it.",
    "They didn’t want to talk about it.",
    "It’s a tremendous economic threat.",
    "They’re coming all over the place.",
    "We were expected to lose 25 seats.",
    "Thanks to my coattails… Thank you.",
    "And it’s becoming a party of love.",
    "When you think about, we love you.",
    "They could have made a great deal.",
    "We don’t have favorable treatment.",
    "And we got it done in nine months.",
    "Are there any bad business people?",
    "It’s a tremendous amount of money.",
    "They really are puppets for China.",
    "And they said, we can make a deal.",
    "And it’s moving along really well.",
    "We’ve been doing a lot of winning.",
    "He wants windmills, the windmills.",
    "That’s all of us, it’s all of us.",
    "No, we’re not interested in that.",
    "They would say it loud and clear.",
    "What the hell is wrong with that?",
    "There’s not a drop of blood shed.",
    "They told me that loud and clear.",
    "So they have favorable treatment.",
    "We teach the truth about history.",
    "In fact, America must come first.",
    "We’re leading it in the comeback.",
    "We have to have a sense of humor.",
    "We know the right people to help.",
    "So I don’t expect much to happen.",
    "I think we have tremendous unity.",
    "Jim Jordan, great, great athlete.",
    "No, their policies are horrible.",
    "That’s going to be a lot of fun.",
    "Can never let that happen again.",
    "That is exactly what we will do.",
    "And you were so far ahead of me.",
    "Almost cost Crazy Nancy her job.",
    "The press doesn’t talk about it.",
    "We are not defunding the police.",
    "They would make it here instead.",
    "They wanted us so badly back in.",
    "You have to see what’s going on.",
    "During the primary, no fracking.",
    "It’s so bad for the environment.",
    "And they do deserve this future.",
    "He didn’t talk about this stuff.",
    "We must stand tall in the party.",
    "But we could have had it for 39.",
    "Sir, they’re paying $39 million.",
    "Leave the sanctions, negotiate.",
    "They took off of the sanctions.",
    "Dangerous, dangerous predators.",
    "So I don’t know why we have to.",
    "And that’s what we’re creating.",
    "You haven’t heard anything yet.",
    "I mean you know think about it.",
    "We’re not starting new parties.",
    "Never forget that conversation.",
    "And I’ve it from more than one.",
    "I heard that from Mark Meadows.",
    "In fact, I hated to follow you.",
    "I want to follow other people.",
    "I like to follow other people.",
    "You’ve got to hand it to them.",
    "You’ve seen me for many years.",
    "They just couldn’t hold it in.",
    "You’ve got to read this story.",
    "I won 94% of the primary vote.",
    "And I wonder who that will be?",
    "I am not starting a new party.",
    "That was fake news, fake news.",
    "Thank you Catherine very much.",
    "Mercedes, thank you very much.",
    "Get a lot of different things.",
    "They go back in, they pay 500.",
    "Alice, the wind isn’t blowing.",
    "Sorry it just doesn’t have it.",
    "And for us, it’s our movement.",
    "Catch, you know where that is?",
    "They’re probably very good to.",
    "I said how much are we paying?",
    "So everybody go get your shot.",
    "And he wants it to go forward.",
    "We don’t have health records.",
    "I got to know them very well.",
    "How it worked was incredible.",
    "He wasn’t talking about this.",
    "Everything’s being closed up.",
    "We left them all in the dust.",
    "I’ll tell you they wanted us.",
    "But 42,000 great paying jobs.",
    "On just about day one, right?",
    "And we take care of our vets.",
    "Those are incredible numbers.",
    "We’re stronger than they are.",
    "They don’t like that subject.",
    "And neither did other judges.",
    "In the past, we would debate.",
    "So they don’t want to debate.",
    "This monster must be stopped.",
    "It cannot be allowed to pass.",
    "But they would have an idea.",
    "We’re smarter than they are.",
    "We’re tougher than they are.",
    "They know the wall was good.",
    "They should not be rewarded.",
    "And that’s what we’re doing.",
    "We’re tougher than they are.",
    "Now they say it differently.",
    "We got a Republican elected.",
    "He asked for my endorsement.",
    "But they’re setting records.",
    "They went to the small ones.",
    "It would be years and years.",
    "It’d be a great thing to do.",
    "These are incredible people.",
    "We don’t have crime records.",
    "They took off the sanctions.",
    "You don’t have to be a good.",
    "Approximately $500 million.",
    "And I decided not to do it.",
    "He said there’s no vaccine.",
    "Anybody need a good lawyer?",
    "Probably a good investment.",
    "It destroys the landscapes.",
    "These [inaudible 00:40:35].",
    "We had deficits with China.",
    "We don’t defund the police.",
    "Wouldn’t that be brilliant?",
    "He never talked about this.",
    "And which it isn’t just me.",
    "Do you know what HR one is?",
    "They always stick together.",
    "They always stick together.",
    "But I heard you were great.",
    "The NC… He was a champion.",
    "Thank you, Jim, very much.",
    "We need strong leadership.",
    "They’re conning everybody.",
    "It’s an absolute disgrace.",
    "You saw what was going on.",
    "And he won it very easily.",
    "I wonder who that will be.",
    "His campaign was all lies.",
    "He’s not okay with energy.",
    "The wall has been amazing.",
    "Believe me, it’s an honor.",
    "We won the election twice.",
    "I mean, there’s such love.",
    "That’ll just be the start.",
    "You know where it’s going.",
    "I didn’t like them at all.",
    "We had to get it approved.",
    "It was a real achievement.",
    "I will tell you something.",
    "How much is China paying?",
    "We just couldn’t have it.",
    "So they’re pouring fumes.",
    "It means law enforcement.",
    "He was a great president.",
    "18 of 19 voted for Trump.",
    "Ultimately we always win.",
    "We will go on to victory.",
    "It’s a very sore subject.",
    "It’s in the constitution.",
    "We have no time to waste.",
    "The public would hear it.",
    "It’s called common sense.",
    "One day, like it’s been.",
    "You see what’s going on.",
    "We have to have triumph.",
    "We have to have victory.",
    "Think of that, 26 of 26.",
    "I did… I did what I did.",
    "It was a one-way street.",
    "So it’s going to happen.",
    "They don’t put it first.",
    "Give me one good reason.",
    "That’s what’s happening.",
    "It’s not good for women.",
    "This is just emblematic.",
    "We still kept the money.",
    "Let’s not deport people.",
    "That’s what it leads to.",
    "We did such a good job.",
    "They didn’t respect us.",
    "No, we don’t want them.",
    "Let’s negotiate a deal.",
    "Mercedes wouldn’t have.",
    "No, I think it’s crazy.",
    "They want to change it.",
    "They want to change it.",
    "Maybe I’m a politician.",
    "You see that happening.",
    "And those are toss ups.",
    "Sort of strange, right?",
    "And yet, did Biden win?",
    "He couldn’t believe it.",
    "Wasn’t going to happen.",
    "We will win the Senate.",
    "And everybody knows it.",
    "I really encourage you.",
    "I heard you were great.",
    "I heard you were great.",
    "So they stick together.",
    "And they do one thing.",
    "How did that work out?",
    "We have to be careful.",
    "I could name them too.",
    "They see what happens.",
    "Democrats are vicious.",
    "Democrats are vicious.",
    "That’s another beauty.",
    "You read that article.",
    "What’s that all about?",
    "What’s that all about?",
    "You needed an ID card.",
    "We must have voter ID.",
    "You saw what happened.",
    "I wonder what happens.",
    "Who, who will that be?",
    "I had a record number.",
    "We don’t put it first.",
    "Well, it wasn’t close.",
    "And we got it back up.",
    "How bad is wind power?",
    "Do you think so, Matt?",
    "And it was incredible.",
    "That’s a lot of money.",
    "Think about it, right?",
    "And he terminated it.",
    "And we saved it 100&.",
    "1.5 million in a day.",
    "I would see the kids.",
    "We want you to go in.",
    "Great state of Texas.",
    "Oh, we love fracking.",
    "Wheat, all time high.",
    "And that will happen.",
    "That’s a great honor.",
    "They voted for Trump.",
    "I’ve never done this.",
    "Nobody wants to talk.",
    "And they’ll admit it.",
    "Don’t ever forget it.",
    "I made a big mistake.",
    "That’s what happened.",
    "Can you believe this?",
    "They throw something.",
    "They would disagree.",
    "Get rid of them all.",
    "Thank you very much.",
    "Does anybody get it?",
    "What are they doing?",
    "Does anybody get it?",
    "They want your seat.",
    "They couldn’t do it.",
    "We have no standing.",
    "All rights reserved.",
    "And he won his race.",
    "We are going to win.",
    "Thank you very much.",
    "Thank you very much.",
    "Thank you very much.",
    "The flags … Amazing.",
    "I said, tell me why.",
    "But they go back in.",
    "I said, that’s okay.",
    "Well, you know what?",
    "But he got his shot.",
    "We did a travel ban.",
    "We did the opposite.",
    "We got it, financed.",
    "Thank you Catherine.",
    "Thank you, darling.",
    "Do you miss me yet?",
    "You can’t have one.",
    "So crazy, so crazy.",
    "We have to do this.",
    "He got his vaccine.",
    "We can make a deal.",
    "I can tell you why.",
    "They go on forever.",
    "It kills the birds.",
    "I know many of you.",
    "This is a struggle.",
    "We did much better.",
    "Who has confidence?",
    "And it’s not close.",
    "Who knows who wins?",
    "And we can do this.",
    "Defund the police.",
    "Read that article.",
    "Cheating they say.",
    "Is that a problem?",
    "This is a con job.",
    "18 States went in.",
    "It’s common sense.",
    "We won the second.",
    "It’s not possible.",
    "But you know what?",
    "He made a request.",
    "It was a disaster.",
    "Say it again, Joe.",
    "We worked so hard.",
    "So think of that.",
    "Couldn’t be done.",
    "I don’t think so.",
    "We can’t do that.",
    "Our biggest cost.",
    "So it’s an honor.",
    "It’s very simple.",
    "I got more votes.",
    "It was a shocker.",
    "They rejected it.",
    "They rejected it.",
    "Yeah, I’d say so.",
    "You believe that?",
    "He likes to win.",
    "He likes to win.",
    "They’re vicious.",
    "Congratulations.",
    "Oh, there he is.",
    "I would have it.",
    "It’s a disaster.",
    "It’s a disaster.",
    "It’s a disgrace.",
    "But people know.",
    "Never forget it.",
    "Such a disgrace.",
    "Such a disgrace.",
    "Such a disgrace.",
    "I don’t do this.",
    "I won the first.",
    "Thank you, CPAC.",
    "And we ended it.",
    "Isn’t that nice?",
    "They’re rotting.",
    "They’re rusting.",
    "You could track.",
    "It’s a disaster.",
    "We went to CPAC.",
    "Can you imagine?",
    "Matt, thank you.",
    "Do you miss me?",
    "And what is it?",
    "I really don’t.",
    "It’s all right.",
    "They know that.",
    "They know that.",
    "How about that?",
    "We can do this.",
    "You would lose.",
    "I’m very proud.",
    "And what is it?",
    "They’re smart.",
    "You would win.",
    "Remember this.",
    "They’re smart.",
    "And he won it.",
    "What happened?",
    "What happened?",
    "Thank you all.",
    "And I said it.",
    "Think of that.",
    "But who knows?",
    "So much of it.",
    "I debated him.",
    "You know that.",
    "We love Texas.",
    "They wear out.",
    "The vet polls.",
    "We had others.",
    "It’s horrible.",
    "You know that.",
    "America last.",
    "I don’t know.",
    "That’s right.",
    "So important.",
    "It is so sad.",
    "Endless wars.",
    "You know why?",
    "He said evil.",
    "Look at that.",
    "I don’t know.",
    "Every ballot.",
    "You need ID.",
    "Think of it.",
    "They debate.",
    "For nothing.",
    "We did this.",
    "Which we do.",
    "We saved it.",
    "It’s insane.",
    "Think of it.",
    "No fracking.",
    "They’ll end.",
    "Great honor.",
    "We will win.",
    "Number one.",
    "That’s why.",
    "39 million.",
    "I heard it.",
    "It’s crazy.",
    "I got more.",
    "Rich Swier.",
    "Thank you.",
    "Thank you.",
    "So simple.",
    "So simple.",
    "So simple.",
    "People go.",
    "They vote.",
    "It’s true.",
    "I’m sorry.",
    "He forgot.",
    "He forgot.",
    "It’ll end.",
    "Thank you.",
    "Thank you.",
    "Thank you.",
    "So simple.",
    "So simple.",
    "Thank you.",
    "Fantastic.",
    "So great.",
    "Remember?",
    "Fracking.",
    "Terrible.",
    "Terrible.",
    "voter ID.",
    "I debate.",
    "I debate.",
    "I wonder.",
    "One day.",
    "One day.",
    "One day.",
    "Oh good.",
    "Not one.",
    "Have to.",
    "Smashed.",
    "So nice.",
    "No, no.",
    "We did.",
    "Hi Jim.",
    "Right?",
    "Crazy.",
    "Okay.",
    "Iraq.",
    "100%.",
    "Okay.",
    "Dumb.",
    "Okay?",
    "Okay.",
    "©Dr.",
    "Why?",
    "No.",
    "No."
  ]
}