{
  "id": 4376,
  "mediaId": 2724,
  "date": "2022-03-01",
  "headline": "ABC’s George Stephanopoulos Breaks The News To Psaki That A Majority Of Americans ‘Question The President’s Mental Capacity’",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/02/2022.02.28-04.39-thepoliticalinsider-621cfabdb86c4.jpg",
  "link": "https://thepoliticalinsider.com/stephanopoulos-tells-psaki-that-a-majority-of-americans-question-the-presidents-mental-capacity/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Hanson",
  "authorUrl": "https://thepoliticalinsider.com/author/john-hanson/",
  "termIds": [
    2277,
    2338,
    3862,
    3975,
    4711,
    7,
    33,
    5371
  ],
  "sentences": [
    "Stephanopoulos, a former aide to President Bill Clinton, posed this sentiment to Psaki during an interview with her on ABC’s news program “This Week.”\nGeorge Stephanopoulos confronts Jen Psaki about a disastrous new Biden poll that shows a majority of Americans \"question the president's mental capacity\" pic.twitter.com/ws9E8jt8b9\n— The Post Millennial (@TPostMillennial) February 27, 2022\nRELATED: Trump Responds To Putin’s Attack On Ukraine: This Never Would Have Happened if I Were President\nStephanopoulos: ‘A majority in our recent poll out this morning even question the president’s mental capacity.’\nIn the surprising segment, in which Stephanopoulos parroted a new narrative that Russian President Vladimir Putin is mentally unstable, he also trained fire at the White House.",
    "Stephanopoulos said, “The president is approaching his State of the Union in a pretty difficult political position right now, 37% approval rating, Democrats trailing badly in the midterm polling.”\nStephanopoulos then addressed Biden’s “mental capacity.”\n“A majority in our recent poll out this morning even question the president’s mental capacity,” Stephanopoulos said.",
    "On Sunday, ABC News’ George Stephanopoulos questioned White House Press Secretary Jen Pskai about a new ABC News/Washington Post poll showed that 54 percent of Americans do not believe President Joe Biden is on top of things mentally.",
    "https://t.co/rJ4GDf6hlH\n— Gary Weiss (@gary_weiss) February 28, 2022\nRELATED: Video: Jim Jordan Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nPsaki then touted Biden’s leadership abilities.",
    "When President Bush gave his first State of the Union, it was shortly after 9/11.”\nPsaki ignored the Biden mental capacity question, and Stephanopoulos let her get away with it.",
    "And how much has his State of the Union been changed by this war in Ukraine?”\nPsaki blew off the question, and merely previewed what Biden would say during his address.",
    "Psaki replied, “You know, George, from covering State of the Unions for some time, that it is about delivering a message to the public at a moment in time.",
    "And if you look back when President Obama gave his first State of the Union, it was during the worst financial crisis in a generation.",
    "He’ll speak to that, but he’s also going to speak about his optimism about what’s ahead and what we all have to look forward to.”",
    "“How is he going to turn that around on Tuesday night?",
    "She didn’t receive any pushback from Stephanopoulos.",
    "“That’s exactly what President Biden is doing.",
    "“Leaders lead during crises,” Psaki said."
  ]
}