{
  "id": 4398,
  "mediaId": 2548,
  "date": "2022-03-02",
  "headline": "Gutfeld Says US Government Is ‘Acting Like White Knights’ As They Purchase Russian Oil",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/03/IMG-6212-e1646270652592.jpg",
  "link": "https://dailycaller.com/2022/03/02/hands-clean-greg-gutfeld-white-knights-russian-oil/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Silverio",
  "authorUrl": "https://dailycaller.com/author/nicole.dcnf@gmail.com",
  "termIds": [
    1479,
    2576,
    3975,
    4110,
    373,
    404,
    1247,
    5287,
    5366
  ],
  "sentences": [
    "(RELATED: Rep. Jim Jordan Says Biden Might Want To Change His Policies, But The ‘Radical Left’ In His Party Will Never Let Him)\nSanctioning Russian energy has gained bipartisan support from lawmakers, political commentators and elites.",
    "The administration invoked the Keystone XL Pipeline, which intended to carry 8,000 barrels of oil from Canada to Texas, then paused oil and gas companies from drilling on federal lands and receiving federal leases.",
    "Fox News host Greg Gutfeld said the U.S. government is “playing both sides” as they purchase Russian oil during a Wednesday appearance on “The Five.”\n“Who is buying Russian oil right now?” Gutfeld began.",
    "President Joe Biden’s administration implemented their first round of sanctions on a small portion of the Russian oil and gas sector Wednesday to restrict U.S. oil refining technology exports to Russia.",
    "The White House confirmed the restrictions will not immediately have an impact on Russian energy, but will “overtime.”\nThe country’s energy industry makes up about 40% of Russia’s economy.",
    "The National Institutes of Health (NIH) admitted to funding the procedure in October, despite repeated denial from White House senior medical advisor Anthony Fauci.",
    "Democratic West Virginia Sen. Joe Manchin criticized the U.S. for continuing to allow imports of crude oil and petroleum from Russia, while Republican Florida Gov.",
    "MSNBC’s Joe Scarborough said Wednesday that Democrats need to reverse their domestic energy policies in order to stop U.S. dependency on Russian oil.",
    "The U.S. imported more than 670,000 barrels of oil daily from Russia in 2021, according to U.S. Energy Information Administration full-year data.",
    "Ron DeSantis called for Biden and European allies to “hit” Russian President Vladimir Putin “where it counts” by harming Russia’s energy sector.",
    "We’re playing both sides.”\n“We were there in Ukraine, too, so let’s not pretend like our hands are clean on this,” he continued.",
    "Gufeld said it is similar to the U.S. government’s knowledge of gain-of-function research at the Wuhan Institute of Technology.",
    "Because we’re sitting here acting like we’re the white knights and what are we doing?",
    "Is the price bottoming out, who’s keeping them afloat?",
    "If it’s us, if it’s our government, that sucks.",
    "“And how much is Russian oil?"
  ]
}