{
  "id": 4438,
  "mediaId": 2699,
  "date": "2022-03-04",
  "headline": "Revealed: Roger Stone’s Bonkers Pardon Plan for Jan. 6 Lawmakers",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1080,w_1920,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1646418023/pjimage_-_2022-03-04T132018.876_psrhyo",
  "link": "https://www.thedailybeast.com/roger-stone-crafted-pardon-plan-for-lawmakers-after-capitol-riot-including-ted-cruz-josh-hawley?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Corbin Bolies",
  "authorUrl": "https://www.thedailybeast.com/author/corbin-bolies",
  "termIds": [
    1670,
    1911,
    1926,
    2201,
    2292,
    2923,
    3151,
    3975,
    4537,
    1068
  ],
  "sentences": [
    "Others who were wrapped up in Stone’s pardon crusade included the Florida-based tax collector and Gaetz wingman Joel Greenberg, who was under investigation for sex trafficking an underage girl; Colombo crime family members Michael Sessa and Victor Orena; Rudy Giuliani, the former New York City mayor and Trump acolyte; and a man named Henry, whose lawyer was heard in the footage offering Stone $100,000 to advocate for presidential leniency.",
    "Once he arrived back in Florida after the Capitol riot, Stone began lobbying for a wide range of pardons, including preemptive pardons for lawmakers who tried to delay or block the certification of Joe Biden’s electoral win—and a blanket pardon for himself, of course.",
    "The nail in the coffin came when David I. Schoen, a lawyer for the Colombo family members who Stone wanted to represent Trump in his second impeachment trial, sent Stone a CNN report detailing Trump’s choice not to issue preemptive pardons.",
    "“Senator Cruz has no idea what Roger Stone says or does,” a Cruz spokesperson told the Post, while a spokesperson for Jordan said he “has never spoken to Roger Stone about pardons and he never sought a pardon because he did nothing wrong.”",
    "A former official told the Post that Pat Cipollone, the former White House counsel, took particular issue with the preemptive pardons for lawmakers, as they hadn’t been suspected of a crime and had not asked for pardons themselves.",
    "Roger Stone’s unhinged quest to overturn the 2020 election for Donald Trump involved a sizable side hustle of lobbying for presidential pardons—including preemptive pardons for lawmakers like Sens.",
    "The vast “Stone Plan” was detailed for the first time on Friday by The Washington Post, which reviewed more than 20 hours of footage from a documentary crew who trailed Stone for two years.",
    "He detailed his plan in a five-page memo to the president, urging him to “pardon a movement” and “give the Deep State the finger,” according to a copy obtained by the Post.",
    "In conversations with the filmmakers, the pompous Republican strategist said the plan had been given to Trump and conservative media—and, according to him, Trump was game.",
    "“Clearly, Cipollone fucked everybody,” Stone was filmed saying on a phone call to a friend who was in prison for fraud and was hoping to get a pardon through Stone.",
    "The footage also covered Stone’s involvement in the “Stop the Steal” movement and his mad dash to leave Washington, D.C., after the Jan. 6 attack on the Capitol.",
    "(Stone’s prison sentence for impeding a congressional investigation into Russian interference in the 2016 election had been commuted by Trump in 2020.)",
    "Stone said the “lily-livered, weak-kneed” lawyers in the White House counsel’s office pushed back on the plan, which ended up not materializing.",
    "Other lawmakers named in the plan included Reps. Paul Gosar (R-AZ), Andy Biggs (R-AZ), and Rep. Mo Brooks (R-AL), the Post reported.",
    "“This was a free home run that could have saved a lot of loyal lives,” Schoen complained.",
    "Ted Cruz (R-TX) and Josh Hawley (R-MO) and Reps. Matt Gaetz (R-FL) and Jim Jordan (R-OH).",
    "“I believe the president is for it,” Stone said on Jan. 15, according to the footage.",
    "He ended up pardoning Stone and a bunch of other allies, friends, and crooked pols.",
    "Some of the lawmakers implicated in Stone’s plan denied ever knowing about it.",
    "“Everything would have to be legal,” the lawyer could be heard insisting.",
    "But Stone’s grand vision came into conflict with a brick wall: the law.",
    "Trump had considered some of the pardons, another person told the Post."
  ]
}