{
  "id": 4607,
  "mediaId": 2550,
  "date": "2022-02-18",
  "headline": "U.S. Capitol Police watchdog: Long way to go on security improvements",
  "image": "https://images.dailykos.com/images/1038911/story_image/Bolton.jpg?1645137903",
  "link": "https://www.dailykos.com/stories/2022/2/17/2080885/-U-S-Capitol-Police-watchdog-Long-way-to-go-on-security-improvements?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1549,
    1670,
    2599,
    3021,
    3267,
    3519,
    3704,
    171,
    180,
    1123
  ],
  "sentences": [
    "“Although there is more work to do, the Department has made immense progress in first addressing the specific failures that led to the January 6 attack, such as improving the way the USCP gathers, analyzes and distributes intelligence, professionalizing major event planning, implementing joint exercises ahead of events, conducting in-person briefings for uniformed officers prior to events, developing a process to get assistance from partnering agencies.",
    "Where USCP officers once merely compiled reports assessing factors like logistics for congressional events and meetings on and off-campus, because of the attack on Jan. 6, the Defense Department has demanded more be done to understand who is visiting or working in the complex.",
    "As for the preparedness for Jan. 6, Bolton told the committee that a review of USCP’s K-9 related training programs, as well as its hazardous device training programs, were less than optimal during the attack and likely hampered the efficiency of the department’s response.",
    "While improvements have been made, Bolton said, there are still areas that need to be addressed around police training, management of intelligence information, and, critically, improvements to leadership culture which, Bolton noted, woefully lacks transparency.",
    "Michael Bolton, inspector general for the U.S. Capitol Police\nMichael Bolton, the top watchdog for the U.S. Capitol Police came before Congress on Thursday with a progress update on security improvements made since the Jan. 6 attack on the U.S. Capitol.",
    "Schuman highlighted Thursday that the practice could run afoul of privacy protections and he questioned how information was obtained if there was a warrant acquired, and if there was a screening process that would filter some of the information out.",
    "Ordering additional equipment, holding dozens of training sessions, expanding the Wellness Division, and adding a new external communication plan to improve the speed and accuracy of information for the public and journalists,” the department said.",
    "Davis was one of the first Republicans picked last year by GOP House Leader Kevin McCarthy when McCarthy and Speaker of the House Nancy Pelosi were engaged in negotiations over the formation of a select committee to investigate the attack.",
    "In the meantime, Davis, Jordan, Banks, and a handful of other Republicans denied a seat on the committee, including Kelly Armstrong of North Dakota and Troy Nehls of Texas, have been conducting a “shadow probe” of Jan. 6, 2021.",
    "Both Lofgren and Davis were adamant that the recommendations and calls for USCP improvement institutionally were not intended to diminish the “courage and valor” of those officers who defended the Capitol on Jan. 6.",
    "Bolton testified before the Committee on House Administration Thursday which is chaired by Rep. Zoe Lofgren, a California Democrat who also sits on the select committee investigating the attack on the U.S. Capitol.",
    "The department’s intelligence division head, Julie Farnham, recently made changes, based on security recommendations, to how public information for members, visitors, staff, and donors is handled.",
    "Historically, when recommendations or new training protocols are issued, Bolton explained, the new guidance is implemented for a few weeks and then things go back to what they were before.",
    "Farnham also directed analysts to review “information about lawmakers’ opponents and their opponents’ supporters … to see if they or their followers intend to attend or disrupt” an event.",
    "We need to make sure training is continuous, not ‘We’ll just satisfy the inspector general and then as soon as everyone’s happy, we’ll go back to not doing the training,” Bolton said.",
    "— Brandi Buchman (@Brandi_Buchman) February 17, 2022\nThe committee’s ranking member Rodney Davis, an Iowa Republican, expressed frustration with the Capitol’s overall security status.",
    "Rep. Pete Aguilar, a California Democrat and member of the Jan. 6 committee, asked Bolton what the most effective tool would be to achieve follow-through on all 104 recommendations.",
    "A “handful of people” at the top of USCP’s leadership, he added, “kind of protect each other.”\n“This is something we can’t have if we want to protect the Congress,” Schuman added.",
    "Nehls left his door open and per protocol, Manger said, the officer entered, made sure the room was secure, and took pictures that would later be shared with the congressman.",
    "In December, after Bolton pored over recommendations for improvements to the force with the Senate, U.S. Capitol Police responded publicly and aligned itself with Bolton.",
    "While it runs counter to the official investigation, the shadow probe has made noise about new review processes put into place among the USCP’s intelligence division.",
    "But for the record, I want you to reassure us Mr. Bolton that you’re investigating this so we can make sure we know the truth of what happened,” Lofgren said.",
    "When asked if the rate was so low because officers feared internal retaliation, the inspector general quickly replied that officers should not feel that way.",
    "Jordan and Banks, among Trump’s most staunch defenders on Capitol Hill, were rejected because of their statements attacking the probe before it even began.",
    "We don’t use their names in our report nor identify the division they serve or whether they serve [on the] House or Senate [side of the Capitol,” he said.",
    "Bolton also disclosed Thursday that of the 200 separate “security enhancements” the force said it would make, just 61 appear to have been completed.",
    "Since the inspector general was first asked to conduct his assessment last year, Bolton has issued eight “flash reports” detailing recommendations.",
    "As things currently stand, the chief of U.S. Capitol Police has the ability to control the inspector general’s work and is not fully independent.",
    "x\nU.S. Capitol Police Inspector General Michael Bolton confirms to Rep. Zoe Lofgren this afternoon that he will look into allegations by Rep.",
    "Schuman suggested lawmakers should address this by nixing the U.S. Capitol Police Board altogether or removing the chief from the board.",
    "A representative for the force did not immediately return a request for comment about Bolton’s appearance on Thursday in the House.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Nehls recently accused U.S. Capitol Police of breaking into his office and taking photos of sensitive legislative materials.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "“Some of the recommendations are long term, like training … some we could make now, like the cultural change,” he said.",
    "The shadow committee has no subpoena power and allegedly relies on willing Capitol Police for its primary sourcing.",
    "“The U.S. Capitol Police Board is the least accountable and least transparent body in federal government,” he said.",
    "Bolton and Schuman both agreed another key issue plaguing the department is its hiring and reporting structure.",
    "But his nomination was also accompanied by McCarthy’s picks, Reps. Jim Jordan of Ohio and Jim Banks of Indiana.",
    "All told, 104 recommendations were made and in December, he told the Senate that just 30 had been implemented.",
    "When Pelosi rejected Banks and Jordan, McCarthy took his ball and went home, refusing to negotiate further.",
    "“Just like journalists, we do research with public information,” the agency said in a statement last month.",
    "Farnham ordered USCP department analysts to conduct background checks on those who come to visit.",
    "Daniel Schuman, the policy director for Demand Progress Education Fund, also testified Thursday.",
    "Questions from Republicans on the House Administration Committee swirled primarily around Rep.",
    "Tom Manger, the department’s current chief of police, vehemently denied the accusation.",
    "Bolton said the department conducted voluntary interviews with members of the force.",
    "Bolton vowed he would investigate further and produce a report in the weeks ahead.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Pelosi had approved Davis to sit on the panel and was ready to seat him.",
    "“The Capitol is no better off today than it was on Jan. 6,” Davis said.",
    "Troy Nehls that a USCP officer broke into his office and spied on him.",
    "“There’s always been an understanding that they would be protected.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "“We just don’t do training for the sake of doing training.",
    "Those checks include scans of their social media feeds.",
    "Nehls pushed back and insisted foul play was afoot.",
    "They invited 80 officers but just 36 participated.",
    "The USCP police chief has denied all accusations.",
    "He had harsh words for the Capitol Police Board.",
    "Chief Manger has endorsed the program.",
    "This is a short blurb about Daily Kos.",
    "“That’s about normal,” Bolton said.",
    "“This allegation is very serious.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "The police chief has denied it.",
    "There’s still a long way to go.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Troy Nehls of Texas.",
    "Donate $5 monthly",
    "The bottom line?",
    "Please read it."
  ]
}