{
  "id": 4620,
  "mediaId": 2641,
  "date": "2022-02-16",
  "headline": "Trump Endorses Texas GOP Reps. Nehls, Gooden, Weber",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=1a2d13fa-e24b-482d-a84b-e16cacc19f90&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/troy-nehls-lance-gooden-texas-gop/2022/02/16/id/1057180/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Mack",
  "authorUrl": "",
  "termIds": [
    1670,
    2201,
    2599,
    3141,
    3267,
    3975,
    4234,
    878,
    881,
    5351
  ],
  "sentences": [
    "Gooden has been a whistleblower on the Biden administration's resettling of border migrants in secret overnight flights around the U.S.\n\"Congressman Lance Gooden is a phenomenal representative of the people of Texas' 5th Congressional District,\" Trump wrote in a statement.",
    "Pelosi did not object to Nehls, but McCarthy pulled all of his nominees when Pelosi rejected Reps. Jim Jordan, R-Ohio, and Jim Banks, R-Ind., because they had worked to defend Trump on the House Judiciary Committee during House Democrat-led impeachment inquiries.",
    "Troy Nehls, R-Texas; Lance Gooden, R-Texas; and Randy Weber, R-Texas, in three statements from his Save America PAC, just days after Rep. Alexandria Ocasio-Cortez, D-N.Y., said Texas will ultimately \"turn blue\" as merely a matter of \"when.\"",
    "Former President Donald Trump threw his coveted endorsement behind a trio of Texas Republicans seeking reelection to the House in the November midterms, including one who has alleged to have been spied on by Capitol Police.",
    "Also, weeks before the alleged USCP spying on Nehls, the Texas Republican had spoke about House GOP plans for its own Jan. 6 investigation, including probing Pelosi's authority over Capitol security.",
    "\"Given his support for our America First movement, it's no surprise Nancy Pelosi and the Radical Left are doing everything they can to stop him, but we will defeat the Democrats this November.",
    "He is fighting to secure our border, uphold the rule of law, support our military and vets, protect the Second Amendment and hold the Biden administration accountable for their failures.",
    "In his Nehls endorsement, Trump pointed to House Speaker Nancy Pelosi, D-Calif., after Nehls has alleged Capitol Police (USCP) officials entered his office and illegally snapped photos.",
    "Despite AOC's recent remarks about Texas will eventually \"turn blue,\" Trump held a January rally in Conroe, Texas, and declared the largest red state \"will never, ever turn blue.\"",
    "\"Randy is tirelessly working to secure our border, grow our economy, cut regulations, champion American energy, support our military and vets, and defend the Second Amendment.",
    "Notably, Nehls was one of the House GOP members Minority Leader Kevin McCarthy, R-Calif., originally nominated for the Jan. 6 Select Committee.",
    "\"Congressman Randy Weber is doing a fantastic job representing the people of Texas' 14th Congressional District,\" Trump wrote in a statement.",
    "Weber was one of 17 Texans in Congress who had voted to debate the certification of President Joe Biden's on Jan. 6, 2021.",
    "\"Congressman Troy Nehls is doing a terrific job in Congress for the great people of Texas,\" Trump wrote in a statement.",
    "He is working hard to secure our border, champion American energy, and protect and defend the Second Amendment.",
    "\"A former sheriff, Troy is a strong advocate for our brave law enforcement, military, and vets.",
    "Troy is a winner and has my complete and total endorsement!\"",
    "\"Lance is a steadfast supporter of our America First agenda.",
    "Randy is a strong advocate for our America First agenda.",
    "Lance has my complete and total endorsement!\"",
    "He has my complete and total endorsement!\"",
    "Trump enthusiastically endorsed Reps."
  ]
}