{
  "id": 4644,
  "mediaId": 2550,
  "date": "2022-02-16",
  "headline": "'You better grow eyes in the back of your head': Death threats to school boards are very real",
  "image": "https://images.dailykos.com/images/959525/story_image/BF75D37D-3545-4D75-B681-3ACE2BD94C4B_1_201_a.jpeg?1624453613",
  "link": "https://www.dailykos.com/stories/2022/2/16/2080621/-Republicans-howled-about-silencing-parents-as-school-boards-have-been-deluged-with-threats?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Clawson",
  "authorUrl": "/users/laura clawson",
  "termIds": [
    1301,
    1388,
    1670,
    1672,
    2923,
    878,
    1132,
    4977,
    5106
  ],
  "sentences": [
    "If she doesn’t quit or resign before the end of the year, we will kill her, but first, we will kill you!”\nBut when the Justice Department says it’s going to track such threats, here’s what Sen. Tom Cotton had to say: “Is it domestic extremism for a parent to advocate for their child’s best interests?”\n”You better grow eyes in the back of your head motherf---er,” said a threat to the school board in Pennsbury, Pennsylvania.",
    "Ron DeSantis, among others, any federal attempt to protect school board members, school administrators, and teachers from violence and intimidation was “weaponizing the DOJ,” or an attempt to “silence parents.” Poor innocent parents, these Republicans insisted, merely trying to look out for their children by exercising their First Amendment rights, and finding themselves targets of government oppression.",
    "School board members across the country have received hundreds of threats, a Reuters investigation finds: “Reuters documented the intimidation through contacts and interviews with 33 board members across 15 states and a review of threatening and harassing messages obtained from the officials or through public records requests.",
    "The FBI's definition of domestic terrorism is, “Violent, criminal acts committed by individuals and/or groups to further ideological goals stemming from domestic influences, such as those of a political, religious, social, racial, or environmental nature.” That is, in fact, what school boards in many areas are facing.",
    "A parent who runs an anti-mask Facebook group posted a video of himself firing a gun to prove he wasn’t just a “digital soldier.” In that district, the police assigned to provide security at school board meetings became concerned that the meetings were too dangerous.",
    "Brenda Sheridan in Loudoun County, Virginia, got threats including: “Brenda, I am going to gut you like the fat f---ing pig you are when I find you.” One of her adult children even got a letter threatening, “It is too bad that your mother is an ugly communist whore.",
    "School officials or parents in 15 different counties received or witnessed threats they considered serious enough to report to police.”\nAccording to Republicans from state attorneys general to Rep. Jim Jordan to Sen. Josh Hawley and Florida Gov.",
    "“They will fucking see your head swinging from a pole.”\nIn Northwest Allen County, Indiana, someone called on people to get “firearms, ammunition and extensive training” to fight the “tyranny” of the school board.",
    "But there’s no guarantee it will stop there—and Republicans are actively seeking to cover up the crimes being committed and lift up the perpetrators as heroic parents just looking out for their kids.",
    "Another said, “This why hitler threw you c--ts in a gas chamber.”\n”Mass of people who know who you are,” according to a threat to board members in nearby North Penn.",
    "Remember all that Republican outrage about the Justice Department attempting to “chill lawful dissent by parents” by tracking threats against education officials?",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "“I truly am concerned for the safety of everyone at those meetings as are the other officers who have worked them,” Sgt.",
    "At least one meeting ended with the school superintendent having to be escorted to his car by half a dozen officers.",
    "Kevin Neher wrote to the board president, calling on the board to take steps to rein things in.",
    "The news organization found more than 220 such messages in this sampling of districts.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "So far it’s been threats and some outbreaks of fighting at school board meetings.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Here’s a sampling of what school board members actually faced.",
    "This is a short blurb about Daily Kos.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Donate $5 monthly",
    "Please read it.",
    "About that."
  ]
}