{
  "id": 4649,
  "mediaId": 2658,
  "date": "2022-02-14",
  "headline": "What's happening with the Canadian trucker convoy? Here's what you need to know",
  "image": "https://static.politico.com/9a/69/8bc97e31450d9a5f8d6cfc280f18/https-delivery.gettyimages.com/downloads/1238210778",
  "link": "https://www.politico.com/news/2022/02/14/canadian-truckers-block-bridge-strike-protests-00008620",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1471,
    1481,
    1981,
    2202,
    4843,
    4890,
    5220,
    5229,
    5357
  ],
  "sentences": [
    "Key organizers of the “Freedom Convoy” include Tamara Lich, who previously worked as the secretary of the Maverick party, a far-right group launched to promote the separation of the country’s three western Prairie Provinces; Maxime Bernier, who leads the far-right People’s Party of Canada; and James and Sandra Bauder, who lead a group calling itself Canada Unity.",
    "The two leaders have discussed the global and American influences fueling the demonstrations, as well as Americans’ involvement in the protests — including U.S. citizens flooding 911 phone lines in Ottawa, Americans participating in the protests, and the large amounts of foreign cash funneled to protesters, with 50 percent of the funds coming from U.S. donors.",
    "| Minas Panagiotakis/Getty Images\nBy Myah Ward\n 02/14/2022 03:18 PM EST\nUpdated: 02/15/2022 02:28 PM EST\nSince late January, truck drivers have wreaked havoc on Canadian cities, occupying parts of Ottawa and ultimately blocking the country’s most vital trade route to the U.S. in protest of Covid restrictions and vaccine mandates.",
    "Protesters are still disrupting daily life and affecting businesses throughout Ottawa this week, leading Trudeau to invoke the Emergencies Act, a powerful, never-used legislation that grants authorities temporary powers during a crisis, such as prohibiting public assembly that continues to disrupt the peace.",
    "“Freedom Convoy” protesters blocked traffic in Paris over the weekend, and police in New Zealand tried to disperse protesters by blasting hit songs of Barry Manilow, James Blunt and the “Macarena.”\nU.S. officials are bracing for an American version of the protests.",
    "How it started — and evolved\nOn Jan. 28, a group of truckers traveled to Ottawa, Canada’s capital, in protest of Prime Minister Justin Trudeau’s vaccine mandates for truckers traveling into the country from the United States.",
    "The prime minister early on dismissed the truckers as a “fringe minority” of people who don’t align with Canadian views, but the government has struggled to contain the protesters through three straight weekends of protests.",
    "The protests continued to escalate over the weekend after Ontario’s premier declared a state of emergency on Friday and a judge ordered an end to the blockade on the Ambassador Bridge, which connects Michigan and Ontario.",
    "God bless those truckers for standing firm.”\nAnd Fox News hosts have spent a good deal of time commenting on the “Freedom Convoy.” Sean Hannity cheered the protesters on while broadcasting live reports from the scene.",
    "A larger movement\nWhile the “Freedom Convoy” began as a group of Canadian truckers protesting cross-border vaccine mandates, it’s become a rallying cry for far-right grievances in the U.S. and around the globe.",
    "On Sunday, White House homeland security adviser Liz Sherwood-Randall announced Canadian officials would reopen the Ambassador Bridge, suggesting the most intense of the protests might be over.",
    "Other administration officials like Transportation Secretary Pete Buttigieg and Homeland Security Secretary Alejandro Mayorkas have also been in close contact with their Canadian counterparts.",
    "Here’s what else you need to know about the protests that are garnering international attention and their potential to further fuel the anti-government movement across the globe.",
    "The once-narrow protest, dubbed the “Freedom Convoy,” has spiraled into a broader movement of the far right as some protesters waive Confederate and Nazi flags in the streets.",
    "Only a small amount was actually dispersed to organizers since GoFundMe shut down the campaign after police cited “violence and unlawful activity” during the protests.",
    "The protest organizers have raised about $10 million Canadian dollars, or $7.8 million U.S. dollars, through GoFundMe for their “Freedom Convoy” protests.",
    "Ottawa’s police chief also resigned on Tuesday, as the department faces criticism from city residents for failing to get the demonstrations under control.",
    "First blocking traffic in Ottawa, the protests have expanded, with similar demonstrations in Toronto, Quebec City, Calgary and on the Ambassador Bridge.",
    "James Bauder reportedly supports QAnon conspiracy theories and has called for Trudeau to be put on trial for treason because of his pandemic policies.",
    "Police arrested multiple remaining protesters over the weekend, and Canadian authorities were able to reopen the Ambassador Bridge late Sunday.",
    "The demonstrations have caught the attention of conservative politicians in the U.S. who have praised the truckers as advocates of freedom.",
    "What the White House is doing\nThe Biden administration worked with Canadian officials to reopen the key trade route over the weekend.",
    "U.S. conservatives weigh in\nThe protests have caught the attention of U.S. conservatives from members of Congress to media figures.",
    "Peaceful protest, clog things up, make people think about the mandates,” Paul said last week in an interview with The Daily Signal.",
    "Tucker Carlson’s online store is selling “I [heart] Truckers” shirts, edited from his standard “I [heart] Tucker” tee.",
    "“Send our solidarity, love and support to all of the brave people who are there,” Hannity said on his show last week.",
    "More protests could be coming, as anti-restriction conservatives in both the U.S. and Europe cheer on the truckers.",
    "Truckers lineup their trucks on Metcalfe Street as they honk their horns on February 5, 2022 in Ottawa, Canada.",
    "“Civil disobedience is a time-honored tradition in our country, from slavery to civil rights, you name it.",
    "The protests have already sparked copycat “Freedom Convoy” protests in France, Australia and New Zealand.",
    "Sen. Rand Paul of Kentucky is one of multiple Republicans who have said they support the protests.",
    "President Joe Biden and Trudeau have stayed in touch to coordinate a response to the protests.",
    "The protesters have said they won’t stop until the mandates are lifted.",
    "Meanwhile, Rep. Jim Jordan (R-Ohio) defended the truckers on Fox News.",
    "“They are so sick of the double standard, so sick of the mandates.",
    "Others have said the protests won’t end until Trudeau resigns.",
    "What they want is what God gave them.",
    "“They’ve had it,” Jordan said.",
    "That’s what this is all about.",
    "Freedom."
  ]
}