{
  "id": 4884,
  "mediaId": 2746,
  "date": "2022-02-14",
  "headline": "Durham’s bombshell court filing ignored by mainstream media",
  "image": "https://twt-thumbs.washtimes.com/media/dupe--age/2019/11/01/trump_russia_probe_prosecutor_08539.jpg_2021.10.21-2021.i.1634865728.4_c0-395-3180-2250_s1200x700.jpg?30e4cb1880eb76c426777a8a12e8f44b7a99b863",
  "link": "https://www.washingtontimes.com/news/2022/feb/14/john-durhams-bombshell-court-filing-ignored-mainst/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Mordock",
  "authorUrl": "https://www.washingtontimes.com/staff/jeff-mordock/",
  "termIds": [
    0
  ],
  "sentences": [
    "He also accused press outlets of a double standard, saying that if the situation were reversed and the Trump campaign had been accused of hacking a political rival, “we wouldn’t be able to talk about anything else.”\nCartoonist Scott Adams quipped Sunday on Twitter: “True or false: CNN is literally having meetings this morning to strategize how to NOT cover the biggest story today.”\nThe countdown was still going Monday afternoon until CNN’s “The Lead with Jake Tapper” did a segment on the Durham filing.",
    "I don’t think any of the Sunday shows mentioned it.”\nHe said if the Durham allegations are proven true, “it would be one of the biggest scandals in American history.”\n“It would be a crime, no doubt about it, and it would tell you why these people think they can get away with it.",
    "On ABC’s “This Week,” host and former Clinton White House Communications Director George Stephanopoulos also ignored the story, never broaching the subject in his interviews with House Speaker Nancy Pelosi and Sen. Lindsey Graham, South Carolina Republican.",
    "There was even an opening: Former Trump White House aide Alyssa Farah Griffin compared the alleged paper-flushing to then-Secretary of State Hillary Clinton’s use of a private server for government business, which included classified information.",
    "Mr. Tapper was mum on the Durham claims, although the show’s political panel did have time to discuss New York Times reporter Maggie Haberman’s new book claiming that staffers suspected then-President Trump of flushing papers down the toilet.",
    "“Kind of amazing that neither the @nytimes nor @washingtonpost have run a news story on John Durham since December, unless I’m using their search tools incorrectly,” tweeted conservative author and columnist Jonah Goldberg, a CNN contributor.",
    "“The media is completely ignoring this story after banging the drums for years regarding Trump and Russia.”\nCorrection: A previous version of this story erroneously put quotations marks around a word that was not used in the Durham filing.",
    "Network and some print media outlets were slammed Monday for ignoring special counsel John Durham’s bombshell court filing that alleges the Clinton campaign paid technology experts to infiltrate servers at Trump Tower and the White House.",
    "In August 2020, when Mr. Durham reached a plea agreement with a former FBI lawyer who admitted to falsifying documents, CBS and ABC combined for 48 seconds of coverage on the news, according to Media Research Center’s data.",
    "The exception was Fox News, where Maria Bartiromo, host of “Sunday Morning Futures,” tackled the stunning disclosures with Rep. Michael Turner, Ohio Republican, the ranking member of the House Intelligence Committee.",
    "“The fact that a story so big, so powerful and so important for the future of the nation is getting zero coverage from lamestream [media], is being talked about all over the world,” Mr. Trump said in a statement.",
    "In contrast, the three major network news shows dedicated 2,634 minutes to special counsel Robert Mueller’s probe into alleged links between Mr. Trump and Russia from its start in 2017 until it concluded in 2019.",
    "A debate then ensued about whether Mrs. Clinton actually “mishandled” classified information, but none of the panelists picked up the Durham thread, despite its direct connection to the 2016 Clinton campaign.",
    "Shortly before her show aired, “Fox & Friends” reported on the Durham allegations and brought in for commentary Rep. Jim Jordan of Ohio, the top Republican on the House Judiciary Committee.",
    "CBS’ “Face the Nation” host Margaret Brennan discussed the latest on Jan. 6 in her interview with Rep. Adam Kinzinger, Illinois Republican, without mentioning the Durham filing.",
    "He said the lack of coverage was a “scandal” itself, singling out The New York Times, The Washington Post, ABC, NBC, CBS, CNN and MSNBC for not mentioning it over the weekend.",
    "Much of the Sunday news focus was on Russian aggression toward Ukraine, but there was also time for another swing at the Jan. 6, 2021, U.S. Capitol riots on both ABC and CBS.",
    "“As of this writing, there is nothing on CNN, MSNBC, The New York Times, or The Washington Post,” conservative radio host Erick Erickson said in a Monday email post.",
    "“When it’s news unfavorable to Democrats, it’s not news,” said Tim Graham, director of media analysis for the Media Research Center, a conservative media watchdog.",
    "A Washington Times review of major media websites found no mention of Mr. Durham’s revelations by The New York Times, The Washington Post, CNN, MSNBC, ABC or CBS.",
    "”It’s one thing to put it on A26, but it’s another thing to pretend it doesn’t exist.”\nAmong those surprised by the lack of media coverage was Sen. Marco Rubio.",
    "“This is a big deal,” the Florida Republican said Monday on Fox’s “Special Report.” “It’s shocking to me that this is not receiving more coverage in the press.",
    "That accounted for one-fifth of all the time spent on the evening news, according to Media Research Center’s data.",
    "The story broke Saturday, but the Sunday talk shows proceeded as if the Durham filing never happened.",
    "They think they can get away with it because the media will not report on it,” Mr. Rubio said.",
    "NBC’s “Meet the Press” was preempted for Super Bowl LVI coverage.",
    "Mr. Trump himself slammed the major media for ignoring the story.",
    "Elsewhere, it was crickets on the bombshell court document.",
    "The lack of coverage for the Durham probe is not unusual.",
    "NBC ignored it altogether."
  ]
}