{
  "id": 4904,
  "mediaId": 2643,
  "date": "2022-02-20",
  "headline": "Jim Jordan Should Be Disqualified From Ballot Over Jan. 6: Protestors",
  "image": "",
  "link": "https://www.newsweek.com/jim-jordan-should-disqualified-ballot-over-jan-6-protestors-1680969",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    1330,
    1670,
    2201,
    4432,
    4756,
    305,
    878,
    1124,
    1163,
    5072
  ],
  "sentences": [
    "The 14th Amendment, Section 3 states:\n\"No person shall be a Senator or Representative in Congress, or elector of President and Vice President, or hold any office, civil or military, under the United States, or under any State, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.\"",
    "\"McGovern's statement is straight from the Select Committee's dirty playbook of leaking and misleading information, because Mr. Jordan told McGovern's committee that he may have spoken to President Trump on the morning of January 6th but didn't remember for sure,\" Dye told Newsweek at the time.",
    "Although Jordan previously suggested that he only spoke to Trump after the riot began, phone records first reported by CNN in early February showed that the congressman talked to Trump for about 10 minutes on the morning of January 6 before the assault against the federal legislative building.",
    "Jordan, a staunch supporter of former President Donald Trump, has received substantial backlash from Democrats, and some Republicans, over his support for Trump's efforts to overturn the 2020 election results.",
    "Hometown Stations (WLIO) in Lima, Ohio, reported on Saturday that Democratic demonstrators gathered outside Jordan's office and demanded he be removed from the ballot over his actions related to January 6.",
    "Protestors in Ohio rallied outside of GOP Representative Jim Jordan's local office, urging the secretary of state to remove him from the ballot and prevent him from seeking another term in Congress.",
    "It's past time for you to go before the @January6thCmte and speak honestly about what happened that awful day,\" Representative Jim McGovern, a Massachusetts Democrat, tweeted on February 4.",
    "It was a violent insurrection for the purpose of trying to prevent the peaceful transfer of power after a legitimately certified election, from one administration to the next.",
    "After news broke of Jordan's 10-minute phone call with Trump ahead of the violent Capitol assault, some Democrats quickly suggested he was hiding something.",
    "They argued that Ohio's Secretary of State Frank LaRose, a Republican, can remove the GOP congressman from the ballot—citing the 14th Amendment, Section 3.",
    "\"He needs to take a look at this and do what is right and make sure that the people that are running for office are actually qualified to run for office.",
    "He also forwarded a controversial text message before that day, which laid out a strategy to overturn President Joe Biden's Electoral College victory.",
    "The Ohio Republican spoke with the former president on the phone multiple times on January 6, 2021—when pro-Trump rioters attacked the U.S. Capitol.",
    "Rob Nichols, press secretary for LaRose, told Newsweek: \"The Secretary has no legal authority to do that, and these people should know that.\"",
    "\"Frank LaRose can disqualify him from being on the ballot,\" Taft Mangas, an organizer of the anti-Jordan rally, told the local news channel.",
    "Some also held posters laying out the 14th Amendment and their argument that Jordan should be blocked from running for office again.",
    "Senator Minority Leader Mitch McConnell, a Kentucky Republican, used that term in recent remarks about the Capitol attack as well.",
    "Newsweek reached out to the Ohio Democratic Party for comment, but did not immediately receive a response.",
    "They pointed out that he previously suggested he spoke with the then president after the attack.",
    "The protestors held signs with messages including, \"Stop the Big Lie\" and \"Never Forget Jan.",
    "Trump and Jordan critics routinely refer to the events of January 6 as an \"insurrection.\"",
    "@Jim_Jordan, this report directly contradicts what you said before the Rules Committee.",
    "\"Nothing says Democracy like keeping someone's name off the ballot,\" he told Newsweek.",
    "That's what it was,\" the top Senate Republican told reporters earlier this month.",
    "Russell Dye, Jordan's communications director, rejected McGovern's assessment.",
    "This article was updated with comment from spokespeople for Jordan and LaRose",
    "A spokesperson for Jordan responded sarcastically to the protesters demands.",
    "That they are legitimately allowed to run for office.\"",
    "What are you trying to hide?",
    "We saw what happened.",
    "\"We all were here.",
    "6.\"",
    "\"."
  ]
}