{
  "id": 4969,
  "mediaId": 2584,
  "date": "2022-02-14",
  "headline": "Congressman echoes Trump’s claim that Clinton aides deserved to die",
  "image": "https://i.guim.co.uk/img/media/23075c41efda98bc30e25c1ea5cdef2e972b85bd/0_159_4156_2493/master/4156.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=23b97ddd9ff2f8d35cac412f99b4e78e",
  "link": "https://www.theguardian.com/us-news/2022/feb/14/us-congressman-jim-jordan-echoes-trump-clinton-aides-executed",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Richard Luscombe",
  "authorUrl": "https://www.theguardian.com/profile/richardluscombe",
  "termIds": [
    0
  ],
  "sentences": [
    "Jim Jordan’s statement on Fox News is another example of violent rhetoric entering the Republican mainstream, analysts say\nAnti-hate speech activists have condemned the Republican US congressman Jim Jordan for his apparent endorsement of Donald Trump’s declaration that members of Hillary Clinton’s campaign staff should have been executed.",
    "But the position of the Ohio rightwinger and fierce Trump loyalist, who is resisting efforts from a congressional committee to explain his own role in the deadly 6 January Capitol riot that Trump incited, serves only to stoke further the country’s volatile political divisions and promote more violence, the groups say.",
    "Trump, who continues to promote the baseless “big lie” that the 2020 presidential election was stolen from him, even as he mulls another run for the White House in 2024, was no stranger to inciting his supporters to violence, or the threat of it, long before the attack on the US Capitol that claimed five lives.",
    "Any language that normalizes violence is simply dangerous.”\nJordan appeared on Fox & Friends to discuss a filing by justice department special investigator John Durham, a Trump appointee, that alleged operatives paid by the Clinton campaign had accessed White House servers in an effort to “dig up dirt”.",
    "“The bottom line is that people pay attention to what is being said in the public square, whether it’s sitting presidents, former presidents, or other elected officials,” said Oren Segal, vice-president for the Anti Defamation League’s center on extremism.",
    "“Trump and Jordan are escalating tensions at a time when this country sorely needs healing,” Michael Edison Hayden, senior investigative journalist with the Southern Poverty Law Center’s intelligence project, told the Guardian.",
    "Jordan asserted on Fox & Friends that the former president was “right on target” when he accused Clinton’s aides of spying on him, and that in another time in US history their “crime would have been punishable by death”.",
    "“Couple those words with Marjorie Taylor Greene’s statements about breaking apart the country and you can pretty easily see how integrated the extreme far-right fringe has become in the contemporary Republican party.",
    "During the Fox interview, Jordan was not asked directly about Trump’s allusion to executions, but over the weekend he retweeted a Fox News article about it that included the “punishable by death” comments in full.",
    "In linking the specter of execution to campaign workers for Clinton, a familiar target of his ire despite his victory over her in the 2016 election, Trump is blowing on a familiar dog whistle, some analysts say.",
    "During his four years in the White House he failed to condemn white supremacists at a rally in Charlottesville, in which a protester was murdered, insisting there were “very fine people on both sides”.",
    "During the first presidential debate with Joe Biden in 2020, Trump urged the extremist Proud Boys, notorious for street brawls, to “stand back and stand by” during a segment on political violence.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "This is truly unprecedented, truly something that has never happened in the history of our great country.”\nTo Segal, the episode is a further example of extremism masquerading as mainstream.",
    "It’s no longer fringe commentary that one would expect, it’s part of the broader public discussion, which only serves to animate the extremes more.”\n… we have a small favour to ask.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "“That sort of language about people should be put to death, or that there should be violent consequences to people’s actions, is quite common among extremist circles.",
    "And politicians such as Jordan endorsing or amplifying his words merely continue to ingrain violence into the political mainstream, they add.",
    "“And yet it’s not just limited to extremist discussions online, it’s now part of the public discussion amplified by elected officials.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "“In a stronger period of time in our country, this crime would have been punishable by death,” Trump’s statement said, in part.",
    "“Some of these politicians sound more like 8chan posters, or Daily Stormer commenters, than leaders,” he added.",
    "And he told the 6 January rioters “we love you” in a video address after they ransacked the Capitol building.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "It’s the lifeblood of social media, the propaganda we see in so many different spaces,” he said.",
    "“[We’re] in a time where we are seeing extremists feel that their agendas are legitimized.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "“We’ve never seen anything like this in history,” Jordan said.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "“So President Trump’s statement is right on target.",
    "If there were ever a time to join us, it is now.",
    "This is why it is so dangerous.",
    "Thank you.",
    "?"
  ]
}