{
  "id": 4973,
  "mediaId": 2553,
  "date": "2022-02-17",
  "headline": "McCarthy Endorses Cheney’s Republican Challenger",
  "image": "https://dw-wp-production.imgix.net/2022/01/Untitled-design-17-3.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/mccarthy-endorses-cheneys-republican-challenger",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Zeisloft",
  "authorUrl": "https://www.dailywire.com/author/benjamin-zeisloft",
  "termIds": [
    2201,
    2298,
    2599,
    3267,
    3671,
    472,
    878,
    5408
  ],
  "sentences": [
    "Harriet Hageman adores the Great State of Wyoming, is strong on Crime and Borders, powerfully supports the Second Amendment, loves our Military and our Vets, and will fight for Election Integrity and Energy Independence (which [President Joe] Biden has already given up).”\n“Unlike RINO Liz Cheney, Harriet is all in for America First,” he continued.",
    "She has objected to two members and the rhetoric around this from the Minority Leader and from those two members has been disgraceful.”\n“This must be an investigation that is focused on facts and the idea that any of this has become politicized is really unworthy of the office that we all hold and unworthy of our Republic,” she added.",
    "“After spending time with Harriet, it is readily apparent she will always listen and prioritize the needs of her local communities and is focused on tackling our nation’s biggest problems,” McCarthy told the outlet.",
    "In comments made to The Federalist, McCarthy said that Harriet Hageman — who has received former President Donald Trump’s endorsement — will seek to represent residents of Wyoming.",
    "“I strongly endorse Republican House of Representatives Candidate Harriet Hageman from Wyoming who is running against warmonger and disloyal Republican, Liz Cheney,” Trump said.",
    "Make America Great Again!”\nWhen Pelosi launched her January 6 committee, McCarthy recommended that Rep. Jim Banks (R-IN) and Rep. Jim Jordan (R-OH) serve as Republican members.",
    "“I am absolutely confident that we will have a nonpartisan investigation, that it will look at the facts, that it will go wherever the facts may lead,” Cheney told reporters.",
    "“I look forward to serving with Harriet for years to come.”\nMcCarthy’s endorsement reflects rising animosity between Cheney and other Republican leaders.",
    "“I agree with what the Speaker has done.”\nThe Daily Wire’s first original film, Shut In, has made its cinematic debut, being met with rave reviews.",
    "In his endorsement message for Hageman, Trump blasted Cheney as “disloyal” and a “warmonger” — a reflection of her hawkish foreign policy views.",
    "“Harriet is a fourth-generation daughter of Wyoming, a very successful attorney, and has the support and respect of a truly great U.S.",
    "Cheney was one of 10 House Republicans to vote in favor of impeaching former President Donald Trump following the events of January 6.",
    "In addition to being replaced as chair of the House Republican Conference last year, Cheney was censured by her state party and RNC.",
    "House Minority Leader Kevin McCarthy (R-CA) is tossing his weight behind a challenger attempting to unseat Rep. Liz Cheney (R-WY).",
    "“Harriet has my Complete and Total Endorsement in replacing the Democrats number one provider of sound bites, Liz Cheney.",
    "Pelosi, however, rejected both picks, and Cheney insisted that the probe would nevertheless remain nonpartisan.",
    "The Daily Wire is building an alternative to the leftist entertainment industry, one gripping movie at a time.",
    "Cheney also serves on the committee launched by House Speaker Nancy Pelosi (D-CA) to examine January 6.",
    "In a Wyoming state straw poll conducted last month, Hageman defeated Cheney in a 59 to six vote.",
    "“There are three members that the Minority Leader proposed that [the] Speaker did not object to.",
    "Join us in this mission and stream Shut In today by becoming a Daily Wire member.",
    "Voters also appear to desire a replacement for Cheney.",
    "Create a free account to join the conversation!",
    "Senator, Wyoming’s own Cynthia Lummis."
  ]
}