{
  "id": 499,
  "mediaId": 2658,
  "date": "2022-04-14",
  "headline": "Conservatives embrace Elon Musk as their Twitter savior",
  "image": "https://static.politico.com/54/52/afff12b741c6afa653f20e1dffd4/musk-twitter-93446.jpg",
  "link": "https://www.politico.com/news/2022/04/14/conservatives-elon-musk-twitter-00025447",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Rep. Darrell Issa (R-Calif.) told POLITICO that Musk “could take the company in a far better direction” for those he claimed have been “unfairly silenced or censored by Twitter’s assault on conservative free speech and ideas it doesn’t like.”\nOther GOP lawmakers took to the very platform at play — Twitter — to praise Musk’s free-wielding content moderation philosophies and admonish his critics.",
    "But a former Trump adviser said the former president would get back on Twitter, if allowed, “in a heartbeat.”\n“Twitter was his megaphone and Twitter was his way of controlling the press, and it was his way to disseminate information and needle opponents and it was a way for him to connect with his base,” said the individual, who was granted anonymity to talk freely about the former president.",
    "It’s clear big tech can’t handle people with a different viewpoint.”\nConservative firebrand Rep. Jim Jordan (R-Ohio) told Fox Business — and then shared as a video clip on Twitter — “let’s hope this goes through and we have free speech on Twitter again.”\nTwitter has given no sign whether it’s accepting the offer.",
    "The Tesla CEO and self-proclaimed “free-speech absolutist” has offered to buy Twitter for $43 billion — a potential takeover that could lead to more controversial content allowed on the site, and be a boon for Republicans who allege Twitter censors their views.",
    "For years, many Republicans have argued that the social media platforms disproportionately stifle conservative speech, even though the top platforms dispute these claims and research finds conservative content is some of the most widely shared on the platforms.",
    "We’re not a place for celebrity press releases.”\nEven so, Jason Miller, another former Trump adviser and the current CEO of GETTR — another conservative-world social media site — embraced the possibility of a Musk takeover as a welcome shake-up for Twitter.",
    "“There’s too much concentration and we need a world where social media is not structured in a way where one person can have a tremendous impact over people’s ability to express themselves — or not — in this space.”\nVictoria Guida contributed to this report.",
    "| Patrick Pleul/Pool Photo via AP, File\nBy Rebecca Kern and Meridith McGraw\n 04/14/2022 09:12 PM EDT\nConservatives are heralding Elon Musk’s bid to buy Twitter as a salve for years of feeling slighted and sidelined by the platform for their political views.",
    "“Musk has made clear that in order to be saved, Twitter needs a wholesale teardown to the foundation, its leadership must be removed, and the politically discriminating ideologues running day to day operations must be replaced,” Miller said in a statement.",
    "But it fell apart by April 10, when Agrawal tweeted that Musk wouldn’t be joining the board, saying “there will be distractions ahead, but our goals and priorities remain unchanged.” Next came Musk’s offer to buy out the platform.",
    "Evan Greer, the director of digital rights nonprofit Fight for the Future, called Musk “an epic and talented distraction” from a larger problem: that only a few companies control most of the world’s social media platforms.",
    "“A good sign as to whether there is free speech is if someone you don’t like is allowed to say something you don’t like,” Musk said during an interview at a TED event Thursday after he submitted the offer to Twitter.",
    "The offer — and Musk’s tweets regarding it — once again puts the spotlight on him with the SEC, which is grappling with whether he ran afoul of SEC rules while acquiring a sizable share of Twitter’s stock recently.",
    "Democratic Rep. Jan Schakowsky (Ill.), who chairs the House Energy and Commerce Committee’s consumer protection panel, argued that Twitter needs to be responsible to its users — not just its shareholders.",
    "Musk also tweeted on Thursday about keeping as many shareholders in privatized Twitter “as allowed by law.” He’s gotten in trouble in the past with the SEC for tweets about taking Tesla private.",
    "Musk also said he wanted to be “very cautious with permanent bans” on users — a sign that a Musk-owned Twitter could mean the potential return of former President Donald Trump to the platform.",
    "Tesla’s CEO became the largest shareholder of Twitter — purchasing nearly 10 percent of the company’s stock — in March, drawing an invitation from Agrawal to join the board on April 5.",
    "When Twitter permanently banned Trump after the Jan. 6 attack on the Capitol for violating its policy against inciting violence, it incensed many conservatives even further.",
    "They’ve gotten rid of a lot of their good voices on Twitter — a lot of their conservative voices,” Trump added in an interview with Americano Media on Wednesday.",
    "Late on Thursday, he tweeted to his more than 81 million followers that the decision on whether to sell should be up to the Twitter shareholders, not the board.",
    "“While my hope would be that they would enforce those terms better, I can’t see those users reacting well if they are suddenly, dramatically changed,” she said.",
    "Musk’s takeover is subject to approval by Twitter’s board, and it remains unclear how specifically he plans to finance his purchase of the company.",
    "Though Musk’s wealth far exceeds his $43 billion valuation of Twitter, he’d need to liquidate assets like his Tesla stock to pay for it on his own.",
    "Truth Social’s CEO, former California congressman Devin Nunes, told Fox News on Wednesday that he doesn’t see why Musk would want to own Twitter.",
    "The board will review and act in the “best interest of the company and all Twitter stockholders.”\nMusk himself even indicated some doubts.",
    "And while Trump has previously said he wouldn’t rejoin Twitter, one former adviser said Trump would jump at the chance to get back on.",
    "Before news broke of Musk’s bid to buy Twitter, Trump himself said he “probably wouldn’t have any interest” in rejoining the platform.",
    "Sen. Marsha Blackburn (R-Tenn.) tweeted out: “Twitter’s censors are freaking out about Elon Musk because they can’t buy his silence.",
    "Even though Twitter has not said whether it will accept the offer, a number of Republican lawmakers quickly applauded Musk’s bid.",
    "Under former CEO Jack Dorsey and current CEO Parag Agrawal, the company said it was committed to keeping that ban in place.",
    "Board members have special obligations to the company and to shareholders when determining whether to approve a sale.",
    "We will hold whoever accepts that responsibility accountable to the American people, including Elon Musk,” she said.",
    "Trump has been struggling to find a replacement to Twitter and Facebook, where he has been suspended for two years.",
    "“I don’t understand why you’d want to invest that much money unless you have some grander plan for it,” Nunes said.",
    "The company acknowledged it received an “unsolicited, non-binding proposal” from Musk for $54.20 per share in cash.",
    "He was late in filing notice of his purchases and initially submitted the wrong form, according to experts.",
    "The alternative he launched — Truth Social — has largely failed at attracting his base to join.",
    "At the moment, the back-and-forth between Musk and Twitter is becoming its own sideshow.",
    "“Timeouts I think are better than permanent bans,” Musk told the TED crowd Thursday.",
    "To achieve this, his takeover bid would’ve had to have been structured differently.",
    "Musk has said that if his bid is accepted, he wants to take the company private.",
    "She noted that Twitter has spent years developing content moderation rules.",
    "“Compared to what we’re doing at Truth, we’re building a community.",
    "“I’m not sure that I will actually be able to acquire it,” he said.",
    "Tesla CEO Elon Musk has offered to buy Twitter for $43 billion.",
    "“Shepherding a social media platform is a huge responsibility.",
    "Trump’s business partners were less enthusiastic.",
    "Musk is striking a very different tone.",
    "“Twitter’s become very boring."
  ]
}