{
  "id": 4999,
  "mediaId": 2746,
  "date": "2022-02-14",
  "headline": "Michele Tafoya leaves sports, jumps into politics",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/14/Tafoya_c0-45-1089-680_s1200x700.jpg?2cb03c9ccf507d3766605ee851de3a9b5e892793",
  "link": "https://www.washingtontimes.com/news/2022/feb/14/inside-beltway-michele-tafoya-jumps-politics/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Harper",
  "authorUrl": "https://www.washingtontimes.com/staff/jennifer-harper/",
  "termIds": [
    1479,
    1722,
    2202,
    2508,
    2840,
    3975,
    4516,
    4768
  ],
  "sentences": [
    "Mr. Axelrod had taken notice of Mr. Biden’s tone-deaf news conference last month which found the president “pitching his successes and touting progress” to a national audience with “grinding concerns.”\nSuch lousy optics result in lousy opinion ratings; indeed, 54% of Americans currently disapprove of the job Mr. Biden is doing according to a RealClear Politics average of 10 major polls.",
    "“Former Vice President Mike Pence will deliver remarks at a private Christian university’s commencement ceremony when he returns in late April to South Carolina, the state that holds the third contest in the Republican Party’s presidential nominating calendar,” Mr. Steinhauser said.",
    "Ms. Tafoya has informed the Athletic — a sports news website — that she is taking on the role of co-chair of a political campaign for Republican businessman and Army veteran Kendall Qualls, who announced Jan. 9 that he is running as a Republican candidate for governor in Minnesota.",
    "“Since the end of former President Donald Trump’s administration just over a year ago, Pence has made three trips to South Carolina, which for decades has played a pivotal role in deciding the eventual Republican standard-bearer,” the analyst also noted.",
    "Marsha Blackburn, Bill Hagerty, James Lankford and Marco Rubio; and Reps. Andy Biggs, Lauren Boebert, Ken Buck, Madison Cawthorn, Byron Donalds, Matt Gaetz, Jody Hice, Ronny Jackson, Jim Jordan, Billy Long, Barry Loudermilk, Scott Perry and Greg Steube.",
    "She is also set to appear at this month’s Conservative Political Action Conference in Florida, and is scheduled to join the podcast of former Fox News anchor Megyn Kelly and visit the Fox News late-night show hosted by Greg Gutfeld, the Athletic said.",
    "RESTLESS DEMOCRATS\nPresident Biden has previously suggested he was interested in running for reelection in 2024, though he tempered that statement by suggesting another campaign would be in the making should his health be in good shape.",
    "Sean Hannity is the keynote speaker for that particular gathering — which features a live band, dancing and a menu that includes braised short ribs and Chilean sea bass with truffled mashed potatoes plus key lime pie.",
    "NEWS AND OPINION:\nLongtime NBC sports broadcaster Michele Tafoya has ended her full-time career in the broadcast business with Sunday’s Super Bowl — this after delivering sideline commentary for 327 NFL games.",
    "“Polls show that the vast majority of Americans believe we are on the wrong track, and people will have little patience for lavish claims of progress that defy their lived experiences,” Mr. Axelrod warned.",
    "“Biden says he’s running in 2024, but 2020 Democratic presidential candidates keep coming to New Hampshire,” observed Paul Steinhauser, a Fox News political reporter based in the Granite State.",
    "Former President Donald J. Trump will be our keynote speaker, and his talk is guaranteed to be one of the most-discussed political speeches of the year,” Mr. Schlapp said in an advisory.",
    "“I got to a point in my life where I wanted to try other things, and there are some things that are really important to me,” Ms. Tafoya told the news organization.",
    "So says David Axelrod, an adviser to former President Barack Obama, is now offering his advice to Mr. Biden, who has a State of the Union speech coming up soon.",
    "POLL DU JOUR\n• 58% of U.S. adults are “looking forward” to the 2024 presidential election; 83% of Republicans, 48% of independents and 47% of Democrats agree.",
    "Find the lowdown on CPAC at Conservative.org\nBIDEN IN NEED OF HUMILITY\nBrash posturing is not the road to political glory at the moment for President Biden.",
    "Don’t forget to get your ticket for the Reagan Dinner on Saturday night — the highlight of the weekend for many past attendees,” Mr. Schlapp adds.",
    "Vice President Kamala Harris, Sen. Cory Booker of New Jersey and Transportation Secretary Pete Buttigieg have also paid a call.",
    "We have a full line-up of great speakers, breakout sessions, and opportunities to get involved in the conservative movement.",
    "LAST CALL FOR CPAC\nYes indeed, the aforementioned Conservative Political Action Conference is indeed just around the corner.",
    "President, it is time for a little humility,” Mr. Axelrod wrote in an essay for The New York Times, published Monday.",
    "• 41% overall are “dreading” the 2024 election; 17% of Republicans, 52% of independents and 53% of Democrats agree.",
    "“Talk about the things you and Congress have done to help meet the challenges Americans are facing, for sure.",
    "Ms. Klobuchar is far from the only 2020 Democratic presidential contender to return to the state, he said.",
    "SOURCE: A CNN poll of 1,527 U.S. adults conducted Jan. 10 and Feb. 6, and released Sunday.",
    "Matt Schlapp, chair of the American Conservative Union, has a friendly but terse message.",
    "• 61% of people of color, 58% of Blacks, 58% of whites and 63% of Hispanics also agree.",
    "• 39% of people of color, 42% of Blacks, 42% of whites and 37% of Hispanics also agree.",
    "Tickets are almost sold out, and I know you will not want to miss this exciting event.",
    "For example, Sen. Amy Klobuchar of Minnesota heads for New Hampshire in early March.",
    "The speakers’ roster for the entire event includes — among many others — Sens.",
    "Glenn Beck, Mark Levin, Mike Pompeo, Rio Grennell, Candace Owens and J.D.",
    "Sixty high-profile speakers will be featured during the four-day event.",
    "Some wonder, though, about the political climate at the moment.",
    "If you have not yet booked your ticket, don’t wait any longer.",
    "Ron DeSantis and so many other conservative thought-leaders.",
    "• Follow Jennifer Harper on Twitter @HarperBulletin.",
    "Mr. Pence will return to the Palmetto State in May.",
    "Lay out your goals for the future, absolutely.",
    "One prominent Republican is also on the move.",
    "• 70% of men and 50% of women agree as well.",
    "• 30% of men and 50% of women agree as well.",
    "Offer realistic hope for better days ahead.",
    "“CPAC kicks off next week, on February 24.",
    "We desperately need it,” he said.",
    "The political world is calling.",
    "“We will hear from Florida Gov.",
    "Vance will also have a say.",
    "“Mr."
  ]
}