{
  "id": 5014,
  "mediaId": 2584,
  "date": "2022-02-19",
  "headline": "Renewed opposition to Trump stirs among establishment Republicans",
  "image": "https://i.guim.co.uk/img/media/b13766e1ca66e632ed1459628195d3a5d7e408ce/0_66_2000_1201/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1bafe3eafb468fe3196ccce957a65c29",
  "link": "https://www.theguardian.com/us-news/2022/feb/19/republicans-split-fealty-donald-trump",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Smith",
  "authorUrl": "https://www.theguardian.com/profile/davidsmith",
  "termIds": [
    2117,
    2201,
    2245,
    2906,
    3231,
    3434,
    3975,
    4087,
    878
  ],
  "sentences": [
    "Frank Luntz, a pollster and strategist, said: “It’s now over a year since January 6 and support for Trump has decreased a little but those who have stayed with him are even more passionate and that’s what is going to characterise the next 12 months.”\nAn NBC News poll last month found that 56% of Republicans now define themselves more as supporters of the party than of Trump, compared with 36% who are first and foremost committed to the former president (this marked a reversal from October 2020 when 54% put Trump above party).",
    "He would have his hat handed to him because he’s not a conservative of any stripe and the Republican party is still a conservative party of some stripe or another, whether it is a Trump personality aspect or pre-Trump movement conservatism or something in between.”\nThe challenge for any future standard bearer may be to create a coalition that links these different blocs.",
    "Republicans’ recent ceasefire between Trumpists and not-Trumpists ended when Pence, who served as Trump’s loyal deputy for four years, uttered four words that few imagined they would ever hear: “President Trump is wrong.” It was a reference to Trump’s false claim that his vice-president could have overturned the 2020 election.",
    "They tend to be on various sides of what we would have recognised pre-Trump as establishment Republicans.”\nBut, notably, even Trump’s Republican critics rarely denounce his policies on border security, crime, immigration, taxes, voting rights or issues such as abortion or how race is taught in schools.",
    "The senator from Kentucky also recently condemned the Republican National Committee for censuring Representatives Liz Cheney of Wyoming and Adam Kinzinger of Illinois for sitting on the January 6 committee, which is led by Democrats and has subpoenaed many in the former president’s inner circle.",
    "Last month Mike Rounds of South Dakota rejected his false claim of widespread voter fraud, prompting Trump to lash out: “He is a weak and ineffective leader, and I hereby firmly pledge that he will never receive my endorsement again!”\nBut House Republicans are more tightly in Trump’s grip.",
    "He declared: “Mitch McConnell does not speak for the Republican Party, and does not represent the views of the vast majority of its voters.” Like other Trump antagonists before him, McConnell, who turns 80 on Sunday, has even suffered the indignity of a Trump nickname – “Old Crow”.",
    "McConnell has made clear that he approves of Pence’s actions on January 6 and refused to amplify Trump’s bogus claims of voter fraud, even as opinion polls suggest a huge majority of the Republican electorate wrongly believes that Biden did not legitimately win the 2020 election.",
    "McConnell is reportedly manoeuvring to recruit Republican candidates who reject the baseless assault on American democracy, with limited success so far, but is working behind the scenes rather than offering the kind of full-throated repudiation of Trump that some would like.",
    "There are different constellations in the Never Trump firmament and it’s unclear if they can unite\nAs Joe Biden lurched from crisis to crisis with plummeting approval ratings, the Republican party seemed largely content to bury its internal differences and enjoy the show.",
    "Kevin McCarthy, the minority leader, frequently breaks with McConnell in his expressions of fealty, in part because his caucus includes “Make America great again” extremists such as Madison Cawthorn, Matt Gaetz, Ronny Jackson, Jim Jordan and Marjorie Taylor Greene.",
    "Then come out and say that.”\nIf McConnell, McCarthy and Republican governors held a joint press conference to declare that Trump lost, denounce his lies and set out their governing principles, “then it begins to move the needle inside the party”, Steele added.",
    "Michael Steele, former chairman of the Republican National Committee, said: “If you’re trying to achieve real change inside the party, if you’re trying to take the party back or you want to move off of Trumpism, you’ve got to make it very clear.",
    "Earlier this month Alyssa Farah Griffin, once communications director for President Donald Trump, made clear that her loyalties have shifted to former vice-president Mike Pence and the Senate minority leader, Mitch McConnell.",
    "Olsen argues that the Florida governor, Ron DeSantis, a co-founder of the conservative House Freedom Caucus, has shown an ability to adapt to the new Trumpist Republican party and is widely seen as an heir apparent.",
    "Olsen, author of The Working Class Republican, added: “Centrist Republicans have to ask whether or not they want to be leaders of this Republican party or of the Republican party they wish they had.",
    "Add in vociferous groups of disaffected alumni such as the Lincoln Project and the Republican Accountability Project and it is clear there are different constellations in the Never Trump firmament.",
    "Next week’s Conservative Political Action Conference in Orlando, Florida, is expected to be another show of strength, with speakers including Trump, DeSantis, Cawthorn, Gaetz, Jackson and Jordan.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "It is expected to regain the House and possibly the Senate but Trump’s obsession with the “big lie” of a stolen election could prove a dangerous liability among votes focused on the future.",
    "The centre of the Republican party today is broadly pro-Trump policies, but preferring to move beyond Trump personally.”\n“A lot of these people still have problems with Trump policies.",
    "The comment was endorsed by Pence’s former chief of staff, Marc Short, who has also testified to the House of Representatives select committee investigating the January 6 insurrection.",
    "Defeats for Trump’s champions in marquee races such as Georgia would revive the perennial question – asked every year since 2015 – of whether his command of the party is declining.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "Tim Miller, writer-at-large for the Bulwark and former political director for Republican Voters Against Trump, said: “I think the problem is bottom up, not top down.",
    "Trump remains dominant but, with elections in 2022 and 2024 concentrating minds, fragments of the establishment wing are stirring and probing for signs of weakness.",
    "But his favorability remains high among registered Republicans – just under 80% in an Economist-YouGov tracking poll – and he is the clear frontrunner for 2024.",
    "The voters want Trump and crazy and so the politicians that are giving it to them are doing the best.”\nEven so, the midterms could give Trump a black eye.",
    "He has showered endorsements on dozens of candidates, some of them long shots who trail their establishment counterparts in the polls and in fundraising.",
    "Should Pence challenge Trump for the Republican nomination in 2024, he would have a ready-made entourage, including Short and Farah Griffin.",
    "“Certain denunciations must be unequivocal.”\nThis drew a sharp retort from Keith Kellogg, who served as Pence’s national security adviser.",
    "But as the centrist leader of a Democratic-leaning state, Hogan has little affinity with hardline conservatives such as Pence or Cheney.",
    "Larry Hogan is definitely not somebody who is national material for the Republican party, which is why I don’t think he’s going to run.",
    "Michael D’Anonio, a political author and commentator, added: “He does still have a death grip on the party and I don’t see that fading.",
    "“For me – it is Trump.”\nThe exchange was a microcosm of factional struggles once again boiling to the surface of the Republican party.",
    "What is unclear, however, is how much these disparate forces have in common and whether they are willing to make sacrifices to unite.",
    "Trump, by contrast, retains a fervent fanbase in the Republican grassroots, as evidenced by the big crowds at his campaign rallies.",
    "Then there are Republican state governors who, typically more pragmatic, have shown greater willingness to speak out against Trump.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Henry Olsen, a senior fellow at the Ethics and Public Policy Center thinktank, said: “There’s not really a Never Trump movement.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "They include Larry Hogan of Maryland, who said on Sunday he is “certainly going to take a look” at a presidential bid in 2024.",
    "As much as people who I admire want that to happen, I don’t think it’s at hand just yet.”\n… we have a small favour to ask.",
    "“As midterms draw close and 2024 looms large, choices will have to be made and lines will be drawn,” he tweeted.",
    "Pence, for example, tempers his rare dissent with paeans to the accomplishments of the Trump administration.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "There is a collection of people who aren’t for Trump’s continued domination of the Republican party.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "Mitch McConnell no more wants Donald Trump to be the nominee of the party in 2024 than I do.",
    "McConnell is not a figure of mass popular appeal and his powers as a kingmaker are limited.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "“Put me squarely in the Pence/ McConnell camp,” Farah Griffin wrote on Twitter.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "What they are against is self-evident; what they are for is more ambiguous.",
    "But first the party must navigate the midterm elections in November.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "Seven voted to convict him at last year’s impeachment trial.",
    "Senate Republicans have never entirely yielded to Trump.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "If there were ever a time to join us, it is now.",
    "Such an act seems unlikely, to put it mildly.",
    "Mitt Romney of Utah is a trenchant critic.",
    "Such positions have earned Trump’s wrath.",
    "But not for long.",
    "Thank you.",
    "?"
  ]
}