{
  "id": 5015,
  "mediaId": 2547,
  "date": "2022-02-18",
  "headline": "John Durham Flip Flops On Friday - Go Figure",
  "image": "https://crooksandliars.com/files/primary_image/22/02/durham_flip_flop.jpg",
  "link": "https://crooksandliars.com/2022/02/john-durham-flip-flops-friday-go-figure",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Sumner",
  "authorUrl": "https://crooksandliars.com/team/mark-sumner",
  "termIds": [
    2060,
    2201,
    2434,
    3192,
    4168,
    4609,
    4952,
    4953
  ],
  "sentences": [
    "But in explaining why the information was slipped in despite the CIA meeting not being the subject of any charge or connected to any claim against Sussman, Durham said this:\n“… the Government included these paragraphs to apprise the Court of the factual basis for one of the potential conflicts described in the Government’s Motion, namely, that a member of the defense team was working for the Executive Office of the President of the United States (“EOP”) during relevant events that involved the EOP.”\nSince the original motion was a claim of potential conflict of interest by a member of the law firm representing Sussman, and that member worked with the White House during the term of President Barack Obama, this is a clear statement that the connection with the EOP that Durham is alleging took place before Trump took office.",
    "But instead of negotiating, Durham filed a “motion of inquiry,” the entire point of which appears to have been so that he could include this sentence: “The government’s evidence at trial will also establish that among the internet data Tech Executive-1 and his associated exploited was domain name system (DNS) traffic pertaining to a particular healthcare provider, Trump Tower, Donald Trump’s Central Park West apartment building, and the Executive Office of the President of the United States (EOP).”\nThe implications of that sentence have generated a faux scandal that is running 24/7 on Fox News and dominating other right-wing media.",
    "Here’s Sen. Rick Scott holding a press event to claim that the Clinton campaign “actually spied on the president of the United States.” Or how about Rep. Kevin McCarthy hitting up Twitter with the claim that “Democrats got caught spying, first on candidate Trump and then when he was President IN THE WHITE HOUSE.”\nThe idea that Clinton’s campaign had spied on Trump in office was enough for Trump to issue a statement declaring that “in a stronger period of time in our country, this crime would have been punishable by death” within two hours of Durham’s filing.",
    "In this latest filing, Durham says that he included “limited additional factual detail” in that earlier motion for “valid and straightforward reasons.” Durham argues that there’s no reason to strike any part of his earlier motion despite how these claims “could garner media attention.” He goes on to cite several cases in which evidence was admitted in spite of it being misinterpreted by the media … which may not be the great defense of this action that Durham seems to believe it to be.",
    "Durham then included in the document the claim connecting the “executive office of the president” to the information collected without making it clear that this information did not involve any sort of illegal (or even legal) “hacking,” that it was restricted to DNS entries and didn’t involve reading a single text or email, and that it all took place before Trump took office.",
    "“If third parties or members of the media have overstated, understated or otherwise misinterpreted facts contained in the government’s motion, that does not in any way undermine the valid reasons for the government’s inclusion of this information.”\nAll of which would seem to suggest that more charges should be filed in this case.",
    "Patel then tweeted out a claim that the “Hillary Clinton campaign and her lawyers masterminded the most intricate and coordinated conspiracy against Trump when he was both a candidate and later President of the United States.”\nPatel then went on Fox News to talk about how Clinton’s team had worked to “infiltrate” the White House.",
    "He did so needlessly in a document that begins by admitting, “The government has discussed these matters with the defense and believes that any potential conflicts likely could be addressed with a knowing and voluntary waiver by the defendant ...”\nDurham does not indicate that he asked for that waiver, or that Sussman refused.",
    "It was a complaint about possible conflict of interest by the attorneys defending Michael Sussman from the one (1) charge that Durham has filed across the entire multiyear course of his globe-spanning effort—a potential conflict that Durham admitted could easily be resolved through negotiations with the attorneys.",
    "In his final response, Durham refused to take responsibility for how the claim was being used to generate a “scandal” on the right, to sway public opinion about both his investigation and earlier investigations, and continued to obscure the fact that none of this took place after Trump was in office.",
    "Why Durham’s latest filing confirms that Trump was never ‘spied on’\nThe information contained in that sentence and one other inserted as “factual background” were pointedly not part of the evidence on which Sussman was indicted, and it’s unclear that either was ever seen by the grand jury.",
    "But this new sentence relates to a meeting that Sussman had with a CIA official in February 2017, and the inclusion of “and the Executive Office of the President of the United States” was swiftly spun into a claim that the Clinton campaign “spied on Trump” after he was elected.",
    "How these filings show Durham is working to create news, not justice\nThe indictment exclusively concerned a September 2016 meeting between Sussman and the FBI in which he indicated that he was not there as a representative of the Democratic Party or the Clinton campaign.",
    "On Thursday, Sussman’s attorneys filed a motion to dismiss the case, accusing Durham of \"extraordinary prosecutorial overreach\" and saying the charge is about an incident which is \"immaterial and cannot give rise to criminal liability.\"",
    "On Feb. 7, Patel and Donald Trump were on Epoch Times TV for an interview in which Trump said there was “a lot coming” from Durham, and that the special counsel was about to “fully expose” the truth about the Clinton campaign.",
    "One week after that interview, Durham issued a pointless document in which the only new information was a sentence pointing to the meeting that Patel had attended, and the answer to the question he had asked.",
    "First, there’s a strong series of “coincidences” connecting the filing to the former Devin Nunes aide and eventually the chief of staff to the acting secretary of defense, Kash Patel.",
    "And since the data involved was only searching for DNS connections, not accessing a single byte of information exchanged, there is not—and has not been—any allegation of spying.",
    "An unnecessary document and a purposely misleading claim\nDurham gave Republicans a misleading statement they could use to allege a conspiracy to spy on the White House.",
    "Earlier this week, special counsel John Durham filed a new document as part of his never-ending “investigation” into the origins of the Trump-Russia investigation.",
    "This is what he had to say about his own nonresponsibility for how his deliberately vague additions are being used to generate a media firestorm on the right.",
    "Patel did nothing in response to this knowledge, which was recorded in transcripts but didn’t even merit mention in Nunes’ eventual report on his findings.",
    "Topics:\nFor 17 years we have been exposing Washington lies and untangling media deceit, but now Facebook is drowning us in an ocean of right wing lies.",
    "In 2017, Patel questioned Sussman as part of Nunes’ House investigation and asked about meetings Sussman may have had with officials outside the FBI.",
    "Neither Sussman nor any of the technical advisers involved in the filing have ever faced any charge of wrongdoing related to the data they accessed.",
    "“Durham’s filing makes it clear,” said Grenell, that the Clinton campaign was “infiltrating the White House, the executive office of the president.",
    "Rep. Jim Jordan hurried to agree that the death penalty was completely appropriate for this crime of … of … they’d figure that out later.",
    "Since the meeting with the CIA official took place only days after Trump took office, it never made any sense to believe otherwise.",
    "But if there’s any actual scandal here, none of it is on the part of Hillary Clinton, her campaign, or even Michael Sussman.",
    "They were spying not only on the campaign of Donald Trump but Donald Trump as president.”\nGrenell was far from the only one.",
    "Speaking on Newsmax, former acting Director of National Intelligence Ric Grenell summed up the fire and fury on the right.",
    "Still, don’t expect Durham’s confirmation that Trump was not “spied on in the White House” to be made clear on Fox News.",
    "He just filed his document, giving him an excuse to slide in the lines that had Jordan demanding the death penalty.",
    "Please give a one-time or recurring donation, or buy a year's subscription for an ad-free experience.",
    "Sussman informed Patel of the CIA meeting, what had been shared, and the date of the meeting.",
    "On Thursday, Durham filed another motion defending his filing from earlier in the week.",
    "Sussman has pleaded not guilty to the single charge of lying to the FBI.",
    "Durham believes that was a lie, which is why there is an indictment.",
    "But now Durham himself appears to be running away from this claim.",
    "It was them and Russia, they worked with Russia,” said Trump.",
    "That document appeared to be utterly pointless.",
    "Republished with permission from Daily Kos.",
    "Or Epoch Times TV, whatever that is.",
    "Just not against Sussman.",
    "“It was them and Russia.",
    "Or News Max.",
    "Thank you."
  ]
}