{
  "id": 5040,
  "mediaId": 2664,
  "date": "2022-02-21",
  "headline": "'Cowardly' Jim Jordan accused of putting party above country in scathing letter to the editor",
  "image": "https://www.rawstory.com/media-library/jim-jordan.jpg?id=27161537&width=1200&coordinates=0%2C41%2C0%2C42&height=600",
  "link": "https://www.rawstory.com/ohio-reader-slams-cowardly-jim-jordan-for-putting-party-above-country/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.rawstory.com/u/alex_henderson_alternet",
  "termIds": [
    1670,
    1886,
    2422,
    2599,
    3500,
    3776,
    3911
  ],
  "sentences": [
    "“Now, we witness Ohio Republican U.S. Rep. Jim Jordan and Mark Meadows, the former chief of staff for ex-President Donald Trump, along with Trump political strategist Steve Bannon, attorney Rudy Giuliani, and others all too cowardly to testify before the Select House Committee investigating the insurrection of Jan. 6, 2021.”\nKorobij goes on to describe January 6 as a “date that will live in infamy,” using the words that President Franklin Delano Roosevelt used to describe the December 7, 1941 attack on the U.S.",
    "Korobij says of the MAGA Republicans who are refusing to help Pelosi’s January 6 select committee, “They fear incurring the wrath of Trump, joining the sycophants, toadies and groveling/quaking Republican congressional minions crawling down to Mar-a-Lago to pledge fealty to a man devoid of loyalty, integrity or honor.”",
    "“History notes that just seven months after witnessing the assassination of President John F. Kennedy, his widow, Jacqueline Bouvier Kennedy, had the strength and courage to testify before the Warren Commission,” Tina Korobij of Strongsville, Ohio writes in her letter.",
    "Rep. Jim Jordan of Ohio is among the far-right MAGA Republicans who is refusing to testify before House Speaker Nancy Pelosi’s select committee on the January 6, 2021 insurrection.",
    "And a Cleveland.com reader, in a biting letter published on February 20, called Jordan out for putting his party before his country.",
    "Jordan, very much a Donald Trump loyalist, isn’t about to say or do anything that might offend the former president.",
    "Naval Base at Pearl Harbor by Japanese forces."
  ]
}