{
  "id": 5070,
  "mediaId": 2730,
  "date": "2022-02-17",
  "headline": "Hillary Clinton Has Finally Responded to Durham Probe Bombshell. Here's What She Said.",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2019/152/cea83425-e3b2-40b3-96cf-39536a859e60.png",
  "link": "https://townhall.com/tipsheet/leahbarkoukis/2022/02/17/hillary-response-durham-n2603416",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Leah Barkoukis",
  "authorUrl": "https://townhall.com/tipsheet/leahbarkoukis/",
  "termIds": [
    2434,
    2543,
    4609,
    304
  ],
  "sentences": [
    "“Contrary to the allegations in [the special counsel’s] recent filing, Mr. Joffe is an apolitical internet security expert with decades of service to the U.S. Government who has never worked for a political party, and who legally provided access to DNS data obtained from a private client that separately was providing DNS services to the Executive Office of the President (EOP),” a spokesperson for Joffe said, adding that under the contract’s terms, “the data could be accessed to identify and analyze any security breaches or threats.”\n“As a result of the hacks of EOP and [Democratic National Committee] servers in 2015 and 2016, respectively, there were serious and legitimate national security concerns about Russian attempts to infiltrate the 2016 election,” the spokesperson continued.",
    "“Upon identifying DNS queries from Russian-made Yota phones in proximity to the Trump campaign and the EOP, respected cyber-security researchers were deeply concerned about the anomalies they found in the data and prepared a report of their findings, which was subsequently shared with the CIA.”\nThe Russians were a legitimate 2016 electoral threat, but Mr. Joffe’s statement doesn’t explain how or why he cooperated with Clinton representatives.",
    "For those interested in reality, here's a good debunking of their latest nonsense.https://t.co/iYY8Uxuogx\n— Hillary Clinton (@HillaryClinton) February 16, 2022\nDurham’s court filing on Friday alleged a Clinton campaign lawyer had a tech executive tap into communications data from Trump servers and the White House in order establish a narrative tying Trump to Russia.",
    "“For those interested in reality, here's a good debunking of their latest nonsense,” she added, linking to a Vanity Fair story titled, “You’ll Never Believe It But Hillary Clinton Did Not, In Fact, Spy On Trump’s White House.”\nTrump & Fox are desperately spinning up a fake scandal to distract from his real ones.",
    "Source: AP Photo/Mary Altaffer\nFormer Democratic presidential candidate Hillary Clinton finally broke her silence Wednesday over the latest bombshell allegations made in special counsel John Durham’s recent court filing.",
    "If the contractor’s job was to monitor security threats to the U.S., then the responsibility was to report any suspicious activity to the government—immediately and in a classified manner.",
    "But according to Mr. Durham’s filing, Mr. Joffe took his information to others—namely, lawyers for the Clinton campaign, who also brought in the oppo-research hit squad Fusion GPS.",
    "As The Wall Street Journal’s editorial board points out, more questions have been raised by tech executive Rodney Joffe’s statement in response to the court filing.",
    "(WSJ)\nIf Republicans retake the House after the midterm elections, Ohio Rep. Jim Jordan, among other GOP lawmakers, have vowed to launch an investigation.",
    "We doubt government contracts include: “In case of threats, first call Democrats.”\nMr. Joffe’s statement raises more questions than it answers.",
    "This partisan team spent months writing anti-Trump white papers full of unproven claims that they spread to the media.",
    "\"Trump & Fox are desperately spinning up a fake scandal to distract from his real ones,\" Clinton tweeted.",
    "Who in government provided the contract that gave him such access to White House records?",
    "How did he come to hire the same lawyer who worked for the Clinton campaign?",
    "\"The more his misdeeds are exposed, the more they lie,\" she continued.",
    "Why did he cooperate with Clinton campaign operatives?",
    "The more his misdeeds are exposed, the more they lie.",
    "“So it’s a day that ends in Y.\"",
    "So it's a day that ends in Y."
  ]
}