{
  "id": 5081,
  "mediaId": 2676,
  "date": "2022-02-24",
  "headline": "Trump hosting fundraiser for Republican lawmakers at Mar-a-Lago estate",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2017/03/trump-mar-a-lago.jpg",
  "link": "https://www.salon.com/2022/02/24/hosting-fundraiser-for-lawmakers-at-mar-a-lago-estate_partner/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandon Gage",
  "authorUrl": "https://www.salon.com/writer/brandon-gage",
  "termIds": [
    0
  ],
  "sentences": [
    "Invitees include Trump-endorsed challengers to incumbents who voted to impeach and convict Trump for inciting the January 6th, 2021 insurrection at the United States Capitol as well as individuals hoping to unseat Trump foes that serve on the House Select Committee investigating the attack.",
    "The \"Take Back Congress Candidate Forum\" will be littered with 10 congressional Trump acolytes like Representative Jim Jordan of Ohio and 13 hopefuls such as United States Senate candidate Herschel Walker of Georgia.",
    "super political action committee will host a major fundraiser for Republican lawmakers and candidates for public office at his Palm Beach, Florida Mar-a-Lago estate on Wednesday.",
    "The event is the brainchild of Florida's Republican Attorney General Pam Bondi, who along with Trump's eldest son Donald Jr. will be there, an unnamed source told NBC.",
    "\"The cost of admission ranges from $3,000 per individual for basic access to as much as $250,000 per couple for full VIP treatment and access,\" the outlet reported.",
    "But there is an almost universal expectation that he will, and Wednesday's right-wing cotillion may be a way to butter up crucial allies should he decide to run.",
    "Because he's not an announced federal candidate, Trump has more latitude in raising and spending the money.\"",
    "Trump has avoided indicating whether or not he intends to mount a third bid for the White House in 2024.",
    "Trump's self-proclaimed role as kingmaker and his desire to oust his detractors will be on full display.",
    "\"This probably won't be the last time you see an event like this from Trump,\" the person said.",
    "No press will be allowed inside, NBC News pointed out, and tickets are not cheap.",
    "Former President Donald Trump and his \"Make America Great Again, Again!\"",
    "\"All the money is for the super PAC, not the candidates.",
    "\"It's like Magapalooza One.\"",
    "For now, at least."
  ]
}