{
  "id": 5141,
  "mediaId": 2702,
  "date": "2022-02-16",
  "headline": "Republican voters split over RNC censure of Cheney and Kinzinger: poll",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2021/12/cheneyliz_kinzingeradam_101921_ap_jscottapplewhite.jpeg?w=1280",
  "link": "https://thehill.com/homenews/house/594656-republican-voters-nearly-split-over-rnc-censure-of-cheney-and-kinzinger-poll/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell/",
  "termIds": [
    2298,
    3267,
    3434,
    4087,
    305,
    877,
    878,
    4887
  ],
  "sentences": [
    "Senate Minority Leader Mitch McConnell (R-Ky.) broke with the committee, calling Jan. 6 a “violent insurrection” and saying that it is “not the job of the RNC” to be “singling out members of our party who may have different views from the majority.”\nHouse Minority Leader Kevin McCarthy (R-Calif.) said rioters who stormed the building that day were not engaging in “legitimate discourse.”\nHe did, however, clarify that he believes the RNC resolution was not talking about the rioters themselves but instead was referring to the subpoenas issued to so-called alternate electors who were not present in Washington the day of the attack.",
    "The survey, conducted by Politico and Morning Consult, found that 40 percent of Republicans strongly or somewhat support the RNC’s censure of Cheney and Kinzinger for their participation in the House select committee’s investigation into the Jan. 6, 2021, attack on the Capitol, while 34 percent of GOP respondents said they strongly or somewhat oppose the censure.",
    "The censure resolution said the two lawmakers “are participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse,” a line that drew criticism from both sides of the aisle for its characterization of the deadly riot.",
    "Politico and Morning Consult’s poll found that 47 percent of GOP respondents strongly or somewhat support the RNC’s label of the attack as “legitimate political discourse,” while 34 percent of Republicans strongly or somewhat oppose the description.",
    "The RNC voted to censure Cheney and Kinzinger earlier this month for their criticisms of former President Trump and their participation in the congressional investigation of the Jan. 6 attack.",
    "Thirty-five percent of Republicans said they strongly or somewhat support McConnell criticizing the censure, while 37 percent said they strongly or somewhat oppose his stance.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "GOP voters are split over the Republican National Committee’s (RNC) censure of Reps. Liz Cheney (R-Wyo.)",
    "Twenty-seven percent of Republicans polled said they did not know or had no opinion.",
    "Cheney and Kinzinger are the only two Republicans who sit on the panel.",
    "The poll surveyed 2,005 registered voters between Feb. 12 and Feb. 13.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Twenty percent said they do not know or remain unsure.",
    "and Adam Kinzinger (R-Ill.), according to a new poll.",
    "The margin of error is 2 percentage points."
  ]
}