{
  "id": 5144,
  "mediaId": 2642,
  "date": "2022-02-18",
  "headline": "[VIDEO] Lou Dobbs is Back, and He’s Got a Serious Message For MAGA… If We Don’t Listen, We Can’t Win",
  "image": "https://waynedupree.com/wp-content/uploads/2022/02/lou-dobbs-warning-maga-01.jpg",
  "link": "https://waynedupree.com/2022/02/lou-dobbs-maga-message/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sophie O’Hara",
  "authorUrl": "https://waynedupree.com/author/sophieohara/",
  "termIds": [
    0
  ],
  "sentences": [
    "“It’s outrageous, he is too much of a, I’ll be kind, if not RINO, a middle-of-the-roader,” he said, “I personally believe him to be outright a RINO and the party needs strength, it needs vision, it needs energy, vibrancy and new blood in leadership, it’s that simple.”\nYou can watch the video below:\nLou Dobbs says there is no way Kevin McCarthy should be Speaker if the GOP retakes the majority, and that only the “brightest” conservatives should be considered like Jim Jordan and Matt Gaetz.",
    "Dobbs chatted with Gaetz on the latest edition of the Florida Republican’s “Firebrand” podcast where the two America First conservatives discussed topics including Pelosi’s sham 1/6 committee, President Joe Biden’s stunning abuses of power, the national debt and the direction of GOP leadership if Democrats are held accountable by voters in November.",
    "He’s right…\nBizpacreview reported that One of those vehemently against the squishy California Republican’s ascendance to the powerful position is Lou Dobbs and the legendary commentator shared his views about the future of the GOP during a wide-ranging interview with Rep. Matt Gaetz.",
    "MORE NEWS: Photo of Kamala With Two Young Black Girls Sparks Major Outrage\nThat’s exactly why Lou Dobbs is warning MAGA about McCarthy… Lou says if Kevin becomes Speaker, we’ll never win and we’ll never advance our agenda.",
    "pic.twitter.com/yKuLLtkid0\n— Ron Filipkowski (@RonFilipkowski) February 17, 2022\nIf Kevin McCarthy weasels his way back into the Speakership, it will completely stall our America First agenda.",
    "Speaking of the current House Minority Leader and the idea that he could assume the speakership, Dobbs gave McCarthy a resounding thumbs down.",
    "And he will never work for us and he will never fight for the America First agenda.",
    "He probably celebrated with champagne when they forced Trump out of office.",
    "That’s the same position we’ll be in if we allow this to happen.",
    "Lou’s on our side, let’s make sure we heed his warning.",
    "He’s not like Liz Cheney, who can’t control her TDS.",
    "Kevin McCarthy is a RINO and a #NeverTrumper.",
    "He does a good job of covering it up, though.",
    "But never be fooled, he’s not on our side.",
    "McCarthy’s power is that he controls his.",
    "We might as well bring back Paul Ryan.",
    "McCarthy is an establishment hack."
  ]
}