{
  "id": 5151,
  "mediaId": 2746,
  "date": "2022-02-14",
  "headline": "White House adviser Sullivan gets fresh scrutiny for role in false Trump-Russia collusion claims",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/04/16/US_Japan_54384.jpg-ea075_c0-0-3875-2260_s1200x700.jpg?07a0ebbf5a7db73172dbd0508e4dc509e62cbeb4",
  "link": "https://www.washingtontimes.com/news/2022/feb/14/white-house-adviser-sullivan-gets-fresh-scrutiny-r/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Boyer",
  "authorUrl": "https://www.washingtontimes.com/staff/dave-boyer/",
  "termIds": [
    0
  ],
  "sentences": [
    "“And anyone that was aware that this campaign plan was going to be falsely pitched to the FBI or the CIA or law enforcement or intelligence authorities would be subject to criminal prosecution for any number of criminal crimes: mail fraud, wire fraud, lying under oath, congressional testimony, false testimony to prosecutors, all of those things.”\nA spokesman for Alfa Bank said the bank had no comment on Mr. Durham’s latest disclosures.",
    "The indictment says Mr. Sussmann and technology experts recruited for the operation “coordinated with representatives and agents of the Clinton campaign with regard to the data and written materials that Sussmann gave to the FBI and the media.”\nSen. Josh Hawley, Missouri Republican, tweeted about the special counsel’s revelations: “Now we know.",
    "Mr. Durham’s filing on Friday indicates he has uncovered evidence that Democratic lawyers with connections to the Clinton campaign worked with others to infiltrate servers belonging to Trump Tower and later the Trump White House in attempts to establish a “narrative” linking Mr. Trump to Russia.",
    "The good news is, everybody is talking about not only this atrocity against our nation, but that the press refuses to even mention the major crime that took place.”\nCorrection: A previous version of this story erroneously put quotations marks around a word that was not used in the Durham filing.",
    "“Marc [Elias] … would occasionally give us updates on the opposition research they were conducting, but I didn’t know what the nature of that effort was — inside effort, outside effort, who was funding it, who was doing it, anything like that,” Mr. Sullivan testified.",
    "… We can only assume that federal authorities will now explore this direct connection between Trump and Russia as part of their existing probe into Russia’s meddling in our elections.”\nMrs. Clinton tweeted his statement a few days before the election.",
    "Mr. Durham’s court filing late last week, which glimpsed the extent of Democrats’ dirty tricks campaign against Mr. Trump before and after he took office, has renewed speculation that the special counsel could soon put Mr. Sullivan in the hot seat.",
    "The role of White House National Security Adviser Jake Sullivan in promoting the false claims that Donald Trump had links to a Russian bank is coming under increasing scrutiny after the latest revelations by special counsel John Durham.",
    "Mr. Elias was a partner of Democratic lawyer Michael Sussmann, who has been indicted for lying to the FBI in the Durham probe on charges of hiding his connection to the Democratic Party in providing information to the FBI and CIA.",
    "“Jake Sullivan and those involved in those should not be speaking on behalf of the United States until we find out exactly what happened and if these actions, as alleged, did actually take place,” Mrs. Blackburn said.",
    "Time for someone to go to jail.”\nMr. Sullivan also is under scrutiny for his testimony under oath to Congress in 2017 about the extent of his knowledge of the opposition research into Mr. Trump and Alfa Bank.",
    "Mr. Sullivan was a top foreign policy adviser to Hillary Clinton’s presidential campaign in 2016 when he publicized bogus dirt on Mr. Trump dug up by Democratic operatives who are now in Mr. Durham’s sights.",
    "The FBI concluded in February 2017 that there was no back channel between Mr. Trump and Alfa Bank, Russia’s largest commercial lender, which is controlled by oligarchs close to President Vladimir Putin.",
    "But according to Mr. Durham’s filings, Clinton campaign officials also were receiving emails about the Russian bank accusations from a Democratic lawyer, identified by Fox News sources as Marc Elias.",
    "“This could be the most direct link yet between Donald Trump and Moscow,” Mr. Sullivan said at the time, referring to a news report claiming that Trump Tower was communicating covertly with Russia.",
    "Former Director of National Intelligence John Ratcliffe said Monday on Fox News that he has briefed Mr. Durham about what he considers a “broad and deep” conspiracy among Democrats.",
    "“Can you imagine if the roles were reversed and the Republicans, in particular President Donald Trump, got caught illegally spying into the office of the president?” Mr. Trump said.",
    "We’ll have to wait and see.”\nSen. Marsha Blackburn, Tennessee Republican, said the scandal should disqualify Mr. Sullivan from serving in his White House role, at least for now.",
    "“I would expect and anticipate, based on the intelligence that I’ve seen, that there would be quite a few more indictments relating to this,” Mr. Ratcliffe said.",
    "He also testified that he didn’t know that Fusion GPS, the “investigative firm” cited in Mr. Durham’s latest filing, was involved in the Alfa Bank research.",
    "That probe turned into the long-running investigation by special counsel Robert Mueller, which also found no link between the Trump campaign and Moscow.",
    "“Computer scientists have apparently uncovered a covert server linking the Trump Organization to a Russian-based bank,” the tweet said.",
    "“He may be,” Rep. Jim Jordan of Ohio, the top Republican on the House Judiciary Committee and a Trump ally, said Monday on Fox News.",
    "Mr. Garland controls Mr. Durham’s budget and will decide whether the special counsel’s final report is released to the public.",
    "“This pleading alleges or alludes to a conspiracy, meaning two or more people in furtherance of a crime,” Mr. Ratcliffe said.",
    "“Computer scientists have apparently uncovered a covert server linking the Trump Organization to a Russian-based bank.",
    "Mr. Trump said the scandal is worse than Watergate, involving the opposition party spying on a sitting president.",
    "White House deputy press secretary Karine Jean-Pierre refused to answer questions about Mr. Durham’s filing.",
    "A spokeswoman for Mr. Sullivan at the National Security Council didn’t respond to a request for comment.",
    "He testified that he didn’t know in 2016 that Perkins Coie was working for the Clinton campaign.",
    "Mr. Sullivan’s wife, Margaret Goodlander, is an adviser to Attorney General Merrick Garland.",
    "The information would then be given to federal agencies to spur investigations of Mr. Trump.",
    "Mr. Sullivan was publicly pushing a media report about Mr. Trump’s suspected ties to Russia.",
    "“All hell would break loose and the electric chair would immediately come out of retirement.",
    "This secret hotline may be the key to unlocking the mystery of Trump’s ties to Russia.",
    "One of those was the FBI’s Crossfire Hurricane investigation of the Trump campaign.",
    "There are calls for her to recuse herself from any involvement in the Durham probe.",
    "The firm represented the Clinton campaign and the Democratic National Committee.",
    "He also complained Monday that the mainstream media is ignoring the story.",
    "The Justice Department has said she has no role in the investigation.",
    "Paying tech executives to infiltrate Trump servers & the White House.",
    "Mr. Durham has not identified Mr. Sullivan as a target of his probe.",
    "“We don’t know where Mr. Durham will go with the investigation.",
    "• Haris Alic and Bill Gertz contributed to this report.",
    "The 2016 Clinton campaign was a criminal enterprise.",
    "Perkins Coie hired Fusion to seek dirt on Mr. Trump.",
    "He was also working for the firm of Perkins Coie.",
    "He may in fact be looking at Mr. Sullivan.",
    "All of it was false."
  ]
}