{
  "id": 5162,
  "mediaId": 2701,
  "date": "2022-02-15",
  "headline": "What We Learned From Michael Sussmann’s Response To The Spygate Special Counsel",
  "image": "https://thefederalist.com/wp-content/uploads/2022/02/michaelsussmann2.15.jpg",
  "link": "https://thefederalist.com/2022/02/15/what-we-learned-from-michael-sussmanns-response-to-the-spygate-special-counsel/?utm_source=rss&utm_medium=rss&utm_campaign=what-we-learned-from-michael-sussmanns-response-to-the-spygate-special-counsel",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Margot Cleveland",
  "authorUrl": "https://thefederalist.com/author/margotcleveland/",
  "termIds": [
    1670,
    2434,
    2747,
    4711,
    4952,
    4953
  ],
  "sentences": [
    "Yesterday’s motion then revisited the special counsel’s decision to file a 27-page indictment for a single-count, false statement case, as well as Durham’s filing of a “Discovery Update.” In the “Discovery Update,” Sussmann charged Durham “went out of his way to include uncharged and inflammatory allegations,” including what Sussmann called “the gratuitous claim that his Office had an ‘active, ongoing criminal investigation of the defendant’s conduct and other matters.”\nGiven that Durham had alerted Sussmann in the Discovery Update that his conduct remains under investigation by the special counsel’s office, it was rather foolhardy for the former Clinton attorney to complain that the indictment “reads as though there was a vast conspiracy, involving the Clinton Campaign and Mr. Sussman” while not charging a conspiracy.",
    "He claimed it “unnecessarily includes prejudicial—and false—allegations that are irrelevant to his Motion and to the charged offense.” Those extra details, Sussmann argued, were “plainly intended to politicize this case, inflame media cover, and taint the jury pool.”\nIn other words, the media has finally begun covering the special counsel’s investigation and the indictment against Sussmann, and he is none too happy.",
    "On the other hand, if the campaign completely denies Sussmann was acting on its behalf in meeting with Baker, that will make for a much more interesting trial, with the Clinton campaign representatives subject to cross-examination by Durham’s team concerning exactly what authority Sussmann had and when he needed approval from above; and exactly what Sussmann was authorized by the campaign to do.",
    "The more significant revelations from the filing, however, concerned the charged offense, namely that Sussmann lied to the FBI’s James Baker when he told Baker on September 19, 2016, that he was not representing any client in bringing to the government’s attention the data and analysis supposedly showing Trump had a secret communication channel with the Russian Alfa Bank.",
    "Sussmann proceeded next to claim that the special counsel’s motion succeeded in “instigat[ing] unfair and prejudicial media coverage of Mr. Sussmann’s case.” Without detailing how the coverage was “unfair,” the motion cited online articles at Fox News, The New York Post, the Washington Examiner, Breitbart, and The Daily Mail.",
    "For instance, Sussmann claims that while the special counsel’s office implied he had provided the CIA data related to Domain Name System lookups in the Executive Office of the President from after Donald Trump took office, Sussmann maintains that the data only pertained to the period when Barack Obama was president.",
    "That Sussmann opted to file the motion to strike, even with the above negatives cautioning against such an approach, suggests the coverage—even when coming from mainly conservative-leaning outlets—is starting to break through the media blackout and is preventing him from controlling the narrative.",
    "In the six-page memo filed in the D.C. federal court, Sussmann’s Latham and Watkins attorneys informed the court they had previously advised the special counsel that Sussman understood his right to consult with independent counsel and intended to waive any potential conflicts of interest.",
    "“It was not until November 2021—two months after Mr. Sussmann was indicted—that the Special Counsel bothered to interview any individual who worked full-time for the Campaign to determine” if Sussmann had met with the FBI on behalf of the Clinton campaign, the motion read.",
    "After highlighting these complaints, Sussmann asked the court to “strike” the special counsel’s “Factual Background” portion of its motion, which, if granted, merely means the court would treat it as if those sections of the motion were not filed with the court.",
    "Sussmann further claimed in his motion that a full-time employee of the Clinton campaign told the special counsel that when Sussmann met with Baker on September 19, 2016, he was not acting on behalf of the campaign.",
    "Now that Sussmann has made it an issue, we may get some clarity from Durham’s office on what the Clinton campaign is claiming concerning the September 19, 2016, meeting when it responds to Monday’s filing.",
    "Second, Sussmann’s filing will prompt even more coverage of Durham’s various filings, whereas if he had said nothing the complicit media would have likely dropped coverage of the case after a day or two.",
    "Trump seized upon the Special Counsel’s filing” to call the scandal “far greater in scope and magnitude than Watergate.” Rep. Jim Jordan soon “endorsed Mr. Trump’s position,” Sussmann also complained.",
    "Late yesterday, Michael Sussmann filed a response to John Durham’s Friday court filing that set off a media buzz over the criminal case against the former Hillary Clinton campaign attorney.",
    "First, a careful reading of the lawyerly wordsmithing suggests a different Clinton campaign representative indicated that Sussmann had in fact met with Baker on behalf of the campaign.",
    "First, it provides Durham an opportunity to respond both to Sussmann’s complaints that the details are extraneous and to respond to the counterpoints Sussmann included in his motion.",
    "“The Special Counsel persists in alleging Mr. Sussmann billed the Clinton Campaign for his meeting with the FBI in September 2016, when that is false,” Sussmann’s motion maintained.",
    "The most likely answer is that someone else connect to the Clinton campaign confirmed the special counsel’s charge—that Sussmann met with Baker on behalf of the Clinton campaign.",
    "The media has finally begun covering the special counsel’s investigation and indictment against former Clinton campaign lawyer Michael Sussmann, and he is none too happy.",
    "She is also a contributor to National Review Online, the Washington Examiner, Aleteia, and Townhall.com, and has been published in the Wall Street Journal and USA Today.",
    "As a stay-at-home homeschooling mom of a young son with cystic fibrosis, Cleveland frequently writes on cultural issues related to parenting and special-needs children.",
    "That’s a strange argument, though, given that the data was intended to show connections between Trump and his affiliates and the supposedly rare Russian cell phones.",
    "Sussmann, however, is likely hoping his Motion to Strike prompts the judge to caution the special counsel’s office to limit any extraneous details in future filings.",
    "Third, Durham’s filings provided Sussmann a heads up on the special counsel’s strategy—likely intentionally so, with the hope that Sussmann may decide to cooperate.",
    "Likely, then, the data concerned the transition period, which is consistent with the concerns the special counsel’s office detailed in its motion.",
    "Cleveland is a lawyer and a graduate of the Notre Dame Law School, where she earned the Hoynes Prize—the law school’s highest honor.",
    "She later served for nearly 25 years as a permanent law clerk for a federal appellate judge on the Seventh Circuit Court of Appeals.",
    "So, in his filing, in addition to seeking to strike the special counsel’s “Factual Background,” Sussmann attempts to refute it.",
    "Omitted was The Federalist’s detailed coverage, clearly a grudging admission of this outlet’s detailed and accurate analysis.",
    "But even if Sussmann opts to continue fighting the charges, he is better off knowing what Durham has in store for him.",
    "Sussmann’s filing added that he does not oppose Durham’s request that he waive those issues on the record.",
    "Cleveland is a former full-time university faculty member and now teaches as an adjunct from time to time.",
    "Sussmann then spent the next five pages complaining about the special counsel’s filing.",
    "Sussmann may soon regret his strategy in filing this motion, for several reasons.",
    "The views expressed here are those of Cleveland in her private capacity.",
    "Be careful, or you might just get what you ask for, as they say.",
    "Margot Cleveland is The Federalist's senior legal correspondent.",
    "“Worse still,” in Sussmann’s estimation, was the fact that “Mr.",
    "That latter detail proves fascinating for two reasons.",
    "But why specify “full-time” in this assertion?",
    "Cleveland is on Twitter at @ProfMJCleveland.",
    "The court may well do that.",
    "So stay tuned."
  ]
}