{
  "id": 5163,
  "mediaId": 2692,
  "date": "2022-02-14",
  "headline": "Honest or arrogant? U.S. Rep. Dan Crenshaw’s brand of conservatism divides some Republicans",
  "image": "https://thumbnails.texastribune.org/jgaMfpT6uthGxP2xnq2kMe5yHG8=/1200x630/filters:quality(95)/static.texastribune.org/media/files/732617c096edbc5c5339cdbd5568298e/Crenshaw%20REUTERS%20TT%2002.jpg",
  "link": "https://www.texastribune.org/2022/02/14/dan-crenshaw-2022-reelection/",
  "mediaOutlet": "Texas Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Zhang",
  "authorUrl": "https://www.texastribune.org/about/staff/andrew-zhang/",
  "termIds": [
    0
  ],
  "sentences": [
    "1 warrior, far and away … because I actually try to persuade people to think like us, which is unfortunately something that’s becoming more and more rare.”\nDisclosure: Southern Methodist University and Texas Southern University - Barbara Jordan-Mickey Leland School of Public Affairs have been financial supporters of The Texas Tribune, a nonprofit, nonpartisan news organization that is funded in part by donations from members, foundations and corporate sponsors.",
    "It feels like you’re being further victimized.”\nCrenshaw faces three opponents in next month’s primary: Jameson Ellis, who describes himself as a “self-employed small business owner, public speaker, and family man;” Milam Langella, a Marine Corps veteran; and Martin Etwop, a student at Texas Southern University Thurgood Marshall School of Law.",
    "“He understands that I’m not always going to see eye to eye with him and that I’m a pretty straightforward and honest guy about what I think is true and what is not true.”\nCrenshaw doesn’t place himself along a spectrum within the GOP, reasoning that there isn’t as big of a spread among conservatives as there is among Democrats.",
    "So Dan Crenshaw is really up against the extreme of his party because of what his party has ensured via gerrymandering.”\nCrenshaw headed into the final stretch of the primary season with more than $4.5 million in cash on hand at the end of 2021 and remains well known and liked among Republicans in the area.",
    "A more conservative district\nWhen Texas’ GOP-controlled Legislature redrew the state’s political maps during redistricting last year, lawmakers fortified Crenshaw’s 2nd Congressional District for the state’s majority party, which also dominates Texas’ congressional delegation.",
    "The Houston Republican had a growing social media following and garnered a sudden national profile after he appeared on Saturday Night Live to accept an apology about an ill-received joke — and take his own swipes at cast member Pete Davidson.",
    "His recent comments warning about “grifters” within the conservative base and pointedly criticizing the Republican National Committee’s censure of GOP colleagues investigating the Jan. 6 Capitol insurrection have cost him supporters.",
    "Corbin Casteel, a political consultant who was briefly the Texas director of Trump’s 2016 presidential campaign, said Crenshaw has remained no nonsense and has not shown himself to toe any line during his time in Congress.",
    "We’re worried about what people are gonna do to us, what they’re gonna infringe upon us.”\nDefenders of the Freedom Caucus took his comments to mean he was referencing the GOP’s most conservative bloc in the U.S. House.",
    "“He absolutely, positively, beyond a shadow of a doubt is the most arrogant politician I’ve ever seen,” conservative political radio host Michael Berry, a former Crenshaw backer, said on his podcast last month.",
    "One of his most vocal primary opponent’s chief complaints is that Crenshaw accurately rebuts Republican former President Donald Trump’s baseless claims that widespread voter fraud cost him reelection in 2020.",
    "“I think the tone was inappropriate.”\nBut David Rogers, chair of the board of directors for the Texas Liberty Alliance, said he still backs Crenshaw, citing his support of gun rights and border security.",
    "He faces three challengers in the March 1 GOP primary — and an erosion of support from some former backers who take issue with how he conducts himself, particularly when he calls out fellow Republicans.",
    "In introducing two other congressional candidates, Crenshaw sought to differentiate them from what he called “performance artists” in Congress — those he said say what conservative voters want to hear.",
    "There’s no logic to it whatsoever.”\nCampaigning after Trump\nThis year’s midterm elections are the first time Republicans have had to chart a political path for themselves since voters ousted Trump.",
    "And the denunciations also fall as a fractured media landscape can create an echo chamber of inaccurate information for GOP voters, depending on the avenues through which they access information.",
    "“Conservatives live in a box — like there’s not a big ideological difference between me and Jim Jordan,” Crenshaw said, referring to the Ohio Republican who helped found the House Freedom Caucus.",
    "He insists he remains a principled conservative, citing his 98% session score from Heritage Action and his A ratings from the National Rifle Association and the National Right to Life Committee.",
    "“I think the way that I do it is in the most truthful and honest way.”\nObservers say that Crenshaw remains a party favorite, and he’s still expected to clinch the nomination without a runoff.",
    "U.S. Rep. Dan Crenshaw was 34 as he entered his first congressional term in 2019 amid buzz that he could be the future of a Republican Party searching for a younger generation of lawmakers.",
    "But doing so requires trying not to alienate the former president’s base while grappling with Trump’s firebrand legacy as his role in the violent 2021 Capitol riot is being investigated.",
    "“What I have a problem with is when you have Republicans like Dan Crenshaw who act and vote like Democrats, and that’s why I believe that we’re in the mess that we’re in,” Ellis said.",
    "But as Crenshaw now seeks a third term, critics from his right are portraying his style of using sharp retorts to call things as he sees them as a sign that he’s not a party loyalist.",
    "“What I see all over the place, not just in person whenever I’m meeting with constituents, not just online on social media — everywhere — people are fed up with Crenshaw,” Ellis said.",
    "Ellis is the most vocal challenger of the trio: He frequently calls Crenshaw a RINO — Republican in name only — and rejects the idea that the incumbent is a pro-liberty conservative.",
    "Crenshaw was among 79 Republicans who voted with every Democrat in the chamber to pass House Resolution 550, which supports improving data security of existing vaccine registries.",
    "“To suggest, as Crenshaw typically does, that he is above being questioned by his constituents is a pattern — and a troubling pattern,” said Berry, the conservative radio host.",
    "Crenshaw later clarified that he was referencing Republicans who pushed falsehoods about topics like HR 550 to attract support, not specifically the Freedom Caucus at large.",
    "However, Casteel said Crenshaw is being faced with rhetoric from some conservatives who think they need to be vocal to hold on to political office or keep their standing.",
    "Martin, the political communication expert, said a byproduct of making the district a GOP stronghold is that it also opens the door to more pitched intraparty battles.",
    "It also means the winner of next month’s primary is expected to handily defeat Robin Fulford, the only Democrat running for the seat, in November’s general election.",
    "There’s kind of a politics of victimhood,” said Stephanie Martin, a Southern Methodist University professor who focuses on discourse in conservative movements.",
    "In December 2020, Crenshaw briefly joined a lawsuit to overturn the 2020 presidential election results, but admitted later that month that Biden duly won.",
    "Crenshaw connects the backlash he faces to right-wing radio hosts and influencers who are “monetizing outrage and division” to increase audience members.",
    "“We normally talk about gerrymandering as something that is dangerous, because it ensures one party or the other wins the election,” Martin said.",
    "Then last month, Crenshaw drew ire when he told a young woman to not question his faith after she asked him to clarify a quote from a podcast.",
    "“So when Crenshaw says, point of fact, the election wasn’t stolen, it doesn’t just feel like you’re being told a truth you don’t want to hear.",
    "Some of his colleagues, he said, buy into this “political theater.”\n“The incentive structure is as such: You gain by tearing others down.",
    "But Ellis thinks the new district lines will work against Crenshaw because he’s suddenly representing a more conservative constituency.",
    "That resolution came up at a candidate forum in Cypress hosted by the conservative Texas Liberty Alliance Political Action Committee.",
    "And it’s because people won’t stand up.”\nYet Crenshaw’s acceptance of the 2020 election results isn’t the only thing drawing ire.",
    "The new district configuration is more compact and centers around the Houston suburbs like The Woodlands, Spring and Kingwood.",
    "But criticisms from within his party come as experts say last year’s redistricting process enables more polarizing politics.",
    "Ellis, one of those challengers, told the Tribune he doesn’t believe the incumbent makes a strong enough stand for freedom.",
    "“Those who used to be considered fringe far-right conservatives are now being called moderates by some,” Casteel said.",
    "He cited Crenshaw’s 74% rating from Liberty Score, which evaluates members of Congress based on their voting record.",
    "“When Dan Crenshaw was elected, he was considered one of the next true conservative fighters alongside Ted Cruz.",
    "On a policy level, Crenshaw and Ellis both support gun rights, oppose abortion and want to secure the border.",
    "Some conservatives claimed the resolution would create a new vaccine database, something PolitiFact debunked.",
    "“If you’re inside the Republican media ecosystem, it’s almost impossible to find evidence that you’re wrong.",
    "Sign up for The Brief, our daily newsletter that keeps readers up to speed on the most essential Texas news.",
    "He said these candidates are the ones who tout “crazy” ideas, like the idea that the election was stolen.",
    "Crenshaw said he’s stayed true to his conservative roots, a sentiment with which many supporters agree.",
    "“I’ve stood up for conservatism in ways that have actually brought people to the party,” Crenshaw said.",
    "“But the other thing that happens with gerrymandering is that it also ensures radicalism in parties.",
    "You tear them down by calling them a RINO or a neocon or some other stupid word,” Crenshaw said.",
    "The previous boundaries charted a long arc from western Houston to its northeastern suburbs.",
    "Backlash against the resolution prompted Crenshaw to explain the bill in a Twitter thread.",
    "But it was Crenshaw’s comments on another matter that sparked a new wave of criticism.",
    "Trump won the previous configuration of the district by 1.3 percentage points in 2020.",
    "The new map likely gives Republicans an advantage in the district for the next decade.",
    "“I’ve always supported the agenda, and we have a good relationship,” Crenshaw said.",
    "“I’m doing it in my own way,” Crenshaw said in an interview with The Texas Tribune.",
    "“I think he’s stayed true to his word and he’s not wavered at all,” Rogers said.",
    "“Unfortunately, many Republicans you trust are lying to you,” Crenshaw tweeted.",
    "His three challengers collectively had less than $15,000 on hand in December.",
    "Because they know something psychologically about the conservative heart.",
    "“We have grifters in our midst,” Crenshaw said in a clip that went viral.",
    "“I also believe that that’s why we allowed … the election to be stolen.",
    "Ellis echoes Trump’s false claims about the 2020 election results.",
    "Now, somehow, Dan Crenshaw is considered not conservative enough.",
    "He said the differences among Republicans comes from personality.",
    "Financial supporters play no role in the Tribune's journalism.",
    "He also says he remains supportive of the former president.",
    "If Crenshaw is feeling the pressure, he isn’t showing it.",
    "Read More\nLoading recommendations for further reading",
    "Under the new map, he would have won by 22.8 points.",
    "Langella and Etwop did not respond for comment.",
    "“I mean in the conservative movement.",
    "Find a complete list of them here.",
    "Lie after lie after lie.",
    "“I’m their No.",
    "And it’s nuts."
  ]
}