{
  "id": 5171,
  "mediaId": 2730,
  "date": "2022-02-14",
  "headline": "Jim Jordan Blasts Durham Probe's Bombshell Revelation",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/295/d5056100-32b0-4b88-a8b1-67f9496b02ef.jpg",
  "link": "https://townhall.com/tipsheet/leahbarkoukis/2022/02/14/jim-jordan-on-durham-investigation-n2603262",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Leah Barkoukis",
  "authorUrl": "https://townhall.com/tipsheet/leahbarkoukis/",
  "termIds": [
    0
  ],
  "sentences": [
    "Source: Michael Reynolds/Pool via AP\nOhio Rep. Jim Jordan blasted the bombshell revelation from special counsel John Durham’s investigation that Clinton campaign lawyers paid to have Trump Tower servers, and later the White House, “infiltrated.”\nJordan called the plot, which was meant to support the narrative that President Trump had ties to Russia, “as wrong as it gets.”\n“They were creating the very news they were then tweeting about and trying to get the media to write about,” the Ohio Republican told Fox News.",
    "It's the same thing that happened four months ago when we found out the Department of Education went out and solicited the letter from the National School Board Association so they could do what they wanted to do, namely spy on parents.”\nHe continued: “They spied on a presidential campaign.",
    "— Rep. Jim Jordan (@Jim_Jordan) February 14, 2022\nJordan vowed that if Republicans retake control of the House of Representatives after the midterm elections, they will launch an investigation.",
    "pic.twitter.com/Wz9gTEUIpj\n— RNC Research (@RNCResearch) February 14, 2022\nThink the media will go back and correct all their stories on Russian collusion?",
    "— Rep. Jim Jordan (@Jim_Jordan) February 14, 2022\nWATCH: @Jim_Jordan says the illegal spying on President Trump \"was worse than we thought.\"",
    "So, this is just simply as wrong as it can possibly be.”\nA tech company hacked the White House and spied on a sitting President.",
    "But then we found out from this filing that they actually spied on a sitting president, which is even worse.",
    "It's the template that the left uses, that the Democrats use.",
    "But the mainstream media refuses to cover it.",
    "“This is, frankly, it's no different.",
    "This should concern everyone.",
    "\"President Trump was right!\"",
    "That's as wrong as it gets."
  ]
}