{
  "id": 5220,
  "mediaId": 2642,
  "date": "2022-02-16",
  "headline": "[VIDEO] Jim Jordan Visibly Shaken Over Durham Allegations “Worse Than We Thought”",
  "image": "https://waynedupree.com/wp-content/uploads/2022/02/Untitled-819-conflict-21.jpg",
  "link": "https://waynedupree.com/2022/02/jim-jordan-shaken-durham/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sophie O’Hara",
  "authorUrl": "https://waynedupree.com/author/sophieohara/",
  "termIds": [
    1670,
    2434,
    4952,
    4953
  ],
  "sentences": [
    "MORE NEWS: [VIDEO] Clever Trump Supporter Morphs Biden and Bush Together to Create Warmonger “Joe W. Bush”\nNow that a lot of the evidence is out on the table, do you think the media will pay attention now?",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of WayneDupree.com\nDEAR MEMBERS,\nAre you sick of seeing ads?",
    "Promoted Content\nJim Jordan has certainly read through many damning documents, so there’s definitely a lot to be said when he’s actually shaken up over something.",
    "But what Jim says about how much worse everything actually is than they even thought it would be – that’s what’s shocking and powerful.",
    "WayneDupree.com is proud to offer a PREMIUM VIP MEMBERSHIP that eliminates ads and gives you the BEST browsing experience.",
    "And it’s not just the media who needs to report on it…\nThe GOP is just as responsible for taking action as the media is.",
    "— Benny (@bennyjohnson) February 15, 2022\nThis report is certainly one of the most damning we’ve seen in quite a while.",
    "Watch the video:\nJim Jordan Visibly SHOOK on LIVE TV Over Durham Report: \"Was Worse Than we Thought… Trump was Right!\"",
    "As Jordan points out, this is something Trump himself has been saying since 2017 and the media chastised him for it.",
    "The entire GOP should be gnashing teeth and foaming at the mouth over this – and anyone who doesn’t needs to go.",
    "As you likely know by now, the newest Durham indictment alleges that Hillary Clinton’s campaign spied on Trump.",
    "And that “something” that’s gotten Jim riled up is the Durham investigation.",
    "Well then it's time to get rid of them!",
    "Follow Wayne on Rumble!",
    "Don’t hold your breath."
  ]
}