{
  "id": 5239,
  "mediaId": 2671,
  "date": "2022-02-15",
  "headline": "NBC News finally covers John Durham news, but guess which name barely gets mentioned…",
  "image": "",
  "link": "https://therightscoop.com/nbc-news-finally-covers-john-durham-news-but-guess-which-name-barely-gets-mentioned/",
  "mediaOutlet": "Right Scoop",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Right Scoop",
  "authorUrl": "https://therightscoop.com/author/therightscoop/",
  "termIds": [
    1670,
    2201,
    2434,
    4599,
    4609,
    404,
    695,
    696
  ],
  "sentences": [
    "“And it goes right to the Clinton campaign.” In a statement Monday, Trump said the alleged spying was “the biggest story of our time, bigger than Watergate.”\nThe filing does not allege that the content of any communications from the Executive Office of the President, or EOP, or any parties were compromised or read, and there is no indication that data collection went beyond identifying where the internet traffic came from and where it went.",
    "According to prosecutors, Sussmann gave the data to an unnamed federal agency at a meeting on Feb. 9, 2017, 20 days into the Trump administration, and said the data “demonstrated that Trump and/or his associates were using supposedly rare, Russian-made wireless phones in the vicinity of the White House and other locations.”\n“The Special Counsel’s Office has identified no support for these allegations,” the filing said.",
    "John Durham, appointed by then-Attorney General William Barr in 2020 to probe the origins of the FBI’s investigation of Russian election interference, said “Tech Executive-1,” not named in the filing but first identified by The New York Times as Rodney Joffe, used his access to domain name system, or DNS, data to compile information about which computers and servers the White House servers were communicating with.",
    "The disclosure about Joffe, who has not been charged, came in a filing in the court case of Michael Sussmann, a lawyer whom Durham’s office indicted in September in connection with allegations of lying about his relationship with the 2016 Hillary Clinton presidential campaign.",
    "In the filing Friday, prosecutors said “Tech Executive-1” gave Sussmann data about communications between computer servers at the EOP, two Trump-owned buildings in New York and an unrelated medical firm in Michigan with Russian-made cellphones near the White House.",
    "NBC NEWS – A tech executive “exploited” his access to computer data at the Trump White House to find “derogatory information” about President Donald Trump, a special counsel appointed during the Trump administration said in a court filing Friday.",
    "According to prosecutors, Sussmann did not disclose to the agency, identified by The New York Times as the CIA, that he was working for a client when he provided the report, when he was actually representing “Tech Executive-1,” aka Joffe.",
    "NBC News finally covered the big John Durham news on the tech officials exploiting their relationship with the White House to try and dig up dirt on Trump for the Hillary campaign.",
    "Hillary only gets mentioned by NBC News reporter Tom Winter incidentally in reference to Sussmann’s September indictment, and once in a quote from Jim Jordan.",
    "Otherwise, NBC News doesn’t make any attempt to connect these nefarious deeds to Hillary Clinton at all, when it was her campaign that was behind it.",
    "Legal experts said Sussmann could face additional legal exposure if he failed to disclose his relationship to Joffe.",
    "“They were spying on the sitting president of the United States,” Rep. Jim Jordan, R-Ohio, told Fox News on Sunday.",
    "Trump and his allies said the disclosure was proof that Trump was under surveillance while he was in office.",
    "The information collected dated from 2014, during the Obama administration, to February 2017.",
    "The ironic thing is that NBC News put this story under the topic of “Hillary Clinton”.",
    "But guess whose name barely gets mentioned?",
    "This is why they are the garbage media.",
    "That’s right, Hillary Clinton.",
    "Notice the top left corner:"
  ]
}