{
  "id": 5249,
  "mediaId": 6512,
  "date": "2022-02-15",
  "headline": "Tech Exec Admitted Using Access to White House Computer Data to Find \"Derogatory Information\" on Donald Trump | Were the Information Shared With CIA?",
  "image": "https://1622179098.rsc.cdn77.org/data/images/full/141965/tech-exec-admitted-using-access-to-white-house-computer-data-to-find-derogatory-information-on-donald-trump-were-the-information-shared-with-cia.jpg",
  "link": "https://www.latinpost.com/articles/154093/20220215/tech-exec-admitted-using-access-white-house-computer-data-find.htm",
  "mediaOutlet": "Latin Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Webber",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "READ NEXT: Florida: Melania Trump Event That Costs up to $50,000 per Ticket Under Investigation, Ex-First Lady Slams 'Dishonest Reporting'\nDonald Trump on Tech Executive \"Exploiting\" Access\nThe New York Times identified the Tech Executive as Rodney Joffe.",
    "Durham said in a new court filing lawyers for the Clinton campaign paid a tech company to \"infiltrate\" servers belonging to Trump Tower and the Trump White House to establish an \"interference\" and \"narrative\" that connects Trump to Russia.",
    "Prosecutors said that Joffe gave Sussman data about communications between computer servers at the office of the president, two Trump-owned buildings in New York, and a medical firm with Russian-made cellphones near the White House.",
    "The New York Times reported that Sussman told the CIA about odd internet data suggesting that someone using a Russian-made smartphone may have been connecting to networks at Trump Tower and the White House.",
    "He was appointed during the Trump administration by former Attorney General William Bar in 2020 to launch a probe on the Federal Bureau of Investigation's probe of Russian election interference.",
    "Ohio Rep. Jim Jordan said that they were spying on the \"sitting president of the United States,\" adding that it goes right to \"the Clinton campaign,\" according to an NBC News report.",
    "Now, the tech executive identified as \"Tech Executive 1\" appears to admit that he shared data that was collected on Trump with the CIA, according to The Daily Wire report.",
    "The court filing was made late last week and centered on potential conflicts of interest connected to the representation of former Clinton campaign lawyer Michael Sussman.",
    "Joffe was accused of using access to domain name system data to compile information about which computers and servers the White House servers were communicating with.",
    "READ MORE: Donald Trump Urges Supporters to Hold Nationwide Protests if Prosecutors Investigating Him 'Do Anything Illegal'\nThis article is owned by Latin Post.",
    "A tech executive had used his access to computer data at the White House to find any \"derogatory information\" about former President Donald Trump.",
    "He added that he had lawful access under a contract to work with others to analyze DNS data to look for security breaches or threats.",
    "The former president and his allies noted that the disclosure was \"proof\" that Trump was under surveillance while he was in office.",
    "Westby and Rasch said cybersecurity researchers were investigating malware in the White House, not \"spying on the Trump campaign.\"",
    "However, the filing does not specify whether any of the data collection occurred while Trump was sitting as the U.S. president.",
    "Legal experts noted that Sussman could face additional legal exposure if he failed to open his connection to Joffe.",
    "Prosecutors further alleged that Sussman gave the data to an unnamed federal agency at a meeting in February 2017.",
    "Trump then alleged the spying as \"the biggest story of our time,\" noting that it was bigger than Watergate.",
    "Written by: Mary Webber\nWATCH: John Durham Knows This Data Precedes Trump, Says Journalist - from MSNBC",
    "Joffe has not been charged, but his case went into light after a court case was filed against Sussman.",
    "Meanwhile, Jody Westby and Mark Rasch said that what Trump and news outlets are saying is wrong.",
    "The two are lawyers for David Dagon, a data scientist who helped develop the so-called DNS logs.",
    "Joffe, on the other hand, said that he was apolitical and did not work for any political party.",
    "Special counsel, John Durham, made the claims in a court filing on Friday.",
    "Sussman has been charged with allegedly lying to the FBI."
  ]
}