{
  "id": 5276,
  "mediaId": 2560,
  "date": "2022-02-23",
  "headline": "Jan. 6 committee seeks meeting with Rep. Jim Jordan over conversations with Trump, allies",
  "image": "https://www.gannett-cdn.com/presto/2022/02/23/PDTN/af04082d-038d-4269-aa07-bcad36aea5e0-GettyImages-1236025563.jpg?crop=924,520,x99,y59&width=924&height=520&format=pjpg&auto=webp",
  "link": "https://www.detroitnews.com/story/news/politics/2022/02/23/jan-6-committee-seeks-meeting-jordan-over-talks-trump/6912772001/",
  "mediaOutlet": "Detroit News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley Bemiller",
  "authorUrl": "",
  "termIds": [
    1670,
    1886,
    2201,
    2906,
    3731,
    878,
    4916,
    5212
  ],
  "sentences": [
    "“We would like to discuss each such communication with you in detail.”\nJordan said during a hearing earlier this year that he talked to Trump on Jan. 6 but “did not speak to the president during the attack.” He had previously told Spectrum News 1 he couldn’t remember when the two spoke that day.",
    "All I’m saying is I had nothing to do with any of this.”\nSince then, CNN reported that Jordan forwarded a text message on Jan. 5 to Trump chief of staff Mark Meadows regarding a legal argument that suggested then-Vice President Mike Pence could block the certification of results.",
    "“We would also like to ask you about any discussions involving the possibility of presidential pardons for individuals involved in any aspect of January 6th or the planning for January 6th.”\nA spokesman for Jordan did not immediately respond to a reporter’s questions.",
    "“Public reporting suggests that you may also have information about meetings with White House officials and the then-President in November and December 2020, and early-January 2021, about strategies for overturning the results of the 2020 election,” Thompson wrote.",
    "The Select Committee to Investigate the January 6th Attack on the United States Capitol sent a letter to the Ohio Republican on Wednesday requesting a meeting to discuss his conversations with former President Donald Trump that day.",
    "The Select Committee also aims to discuss any communications Jordan had with White House staff, Trump’s legal team and “others involved in organizing or planning the actions and strategies for January 6th,” Thompson wrote.",
    "“We understand that you had at least one and possibly multiple communications with President Trump on January 6th,” wrote U.S. Rep. Bennie Thompson, chairman of the committee.",
    "Jordan, a close ally of Trump, has come under a microscope in recent weeks as the committee probes who played a role in efforts to overturn the 2020 election.",
    "The Columbus Dispatch\nColumbus, Ohio – A committee investigating the Jan. 6 attack on the U.S. Capitol has turned its attention to U.S. Rep. Jim Jordan.",
    "The committee also sought an interview this week with Pennsylvania Rep. Scott Perry, a request Perry has since declined.",
    "My understanding is, from my memory, I talked to him after the attack happened, and we were moved to the chamber.",
    "They also plan to inquire about Jordan’s dealings with Trump and his allies before the attack.",
    "“I talk to the president all the time,” Jordan told the House Rules Committee in October.",
    "I may have talked to him before.",
    "“I talked to him that day.",
    "I don’t know."
  ]
}