{
  "id": 5294,
  "mediaId": 2748,
  "date": "2022-02-16",
  "headline": "GOP leader Kevin McCarthy promises a congressional investigation into Durham's claim Hillary's campaign spied if GOP takes the House as Trump says there is even MORE to come",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4EyTM79dViiyMdo_c8reWn4TK8CLK2PEm_sZTAbnttcj4Tt63CbDoFeBOqCy80D--5jehMJqiiN7eGSZILFhNLEIWtn3tTCN5bo00hghT8gyg1IR4hUVD-KUQvEh0d-VnAdj3CNyYtGAnj_EXjnDOV9jPMJbsmn3Pd-Egeds=w1200-h630-p-k-no-nu",
  "link": "http://www.womensystems.com/2022/02/gop-leader-kevin-mccarthy-promises.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Women System",
  "authorUrl": "https://www.blogger.com/profile/03123176379654101986",
  "termIds": [
    0
  ],
  "sentences": [
    "'Special Counsel John Durham's continued investigation into the Russia hoax is essential to getting to the truth and protecting our democracy, and because he has already uncovered several troubling findings, it's clear that Congress must exercise its oversight responsibilities as well,' McCarthy said in a statement to Fox News on Tuesday.",
    "'If these allegations prove true, I would find it hard to believe that there was potentially some type of collusion with a tech company that had access to servers and computers to spy on the Trump campaign - and potentially the White House - without authorization from top officials in the Clinton campaign,' Waltz said.",
    "'It looks like this is just the beginning, because, if you read the filing and have any understanding of what took place, and I called this a long time ago, you're going to see a lot of other things happening, having to do with what, really, just is a continuation of the crime of the century,' Trump told Fox News.",
    "In Durham's filing on Friday, he revealed how Sussman 'had assembled and conveyed the allegations to the FBI on behalf of at least two specific clients, including a technology executive (Tech Executive 1), named as Rodney Joffe, at a U.S.-based internet company (Internet Company 1) and the Clinton campaign.'",
    "It comes after a Friday court filing by Special Counsel John Durham which alleged Clinton's 2016 campaign paid a tech firm to infiltrate Trump Tower servers and later White House servers in a bid to establish an 'inference' or 'narrative' between Trump and Russia to show to government agencies.",
    "Clinton lawyer Sussman's 27-page indictment says he told then-FBI General Counsel James Baker that he was not working for a client when he asked for a meeting in which he offered evidence of what he claimed was a secret communication channel between Donald Trump and a Russian bank.",
    "He said that if Republicans win the majority in November, they will look into whether 'federal funds were used, whether federal office-holders abused their power, and investigate other disturbing elements of this spying scheme to ensure nothing like it ever happens again.'",
    "Republicans are also calling for increased scrutiny on President Joe Biden's National Security Adviser Jake Sullivan after the longtime Democratic operative's links to Special Counsel John Durham's investigation were revived in the wake of a bombshell new court filing.",
    "'On or about September 15 , 2016, Campaign Lawyer-1 exchanged emails with the Clinton Campaign's campaign manager, communications director, and foreign policy adviser concerning the Russian Bank-1 allegations that SUSSMANN had recently shared with Reporter1,' it says.",
    "Durham's probe into the origins of the Russian investigation moved closer to the White House late last year with a report that Sullivan was the 'foreign policy adviser' mentioned in the indictment of former Clinton presidential campaign lawyer Michael Sussmann.",
    "Between a historical trend where the party in the White House suffers losses in the midterms and President Biden's low poll numbers, Republicans' chances to take back the House look increasingly likely- 29 Democrats have already announced retirement.",
    "'Court filings by Special Counsel Durham suggesting the Clinton campaign may have engaged in an orchestrated effort to infiltrate the Trump campaign are unacceptable and should not be swept under the rug,' Graham said on Tuesday.",
    "'Jake Sullivan's involvement in the Russia collusion hoax is a clear conflict of interest, and he should not be allowed to speak on behalf of the U.S. as Russia-Ukraine tensions heighten,' Blackburn told DailyMail.com on Tuesday.",
    "GOP leader Kevin McCarthy vowed to investigate a finding from Special Counsel Robert Durham that Hillary Clinton was linked to the origin of the Russia collusion probe if Republicans take back the House in November.",
    "The filing also reveals how Joffe worked with Sussman at the instruction of the Clinton campaign to 'assemble the purported data and white papers' - essentially to gather information that would tie Trump to Russia.",
    "Amid outrage over the new spying allegations, a past tweet from Clinton has ignited a firestorm and renewed attention on Sullivan's role in potentially pushing lies about then-candidate and later President Trump.",
    "Blackburn called the White House out over dodging questions on the matter Monday evening: 'Why is the White House refusing to comment about Jake Sullivan's role in fabricating evidence against President Trump?'",
    "In a response to the most recent accusations filed by Durham, Sussmann's legal team said Durham 'seems to be succeeding in his effort to instigate unfair and prejudicial media coverage of Mr. Sussmann's case.'",
    "When asked about the revelations on Monday, White House deputy press secretary Karine Jean-Pierre repeatedly said she 'can't speak to' Durham's filing and referred questions to the Justice Department.",
    "Without naming Sullivan, Rep. Mike Waltz of Florida told DailyMail.com it was 'hard to believe' such a high level of privacy invasion could have taken place without the Clinton campaign's knowledge.",
    "Clinton continued to stonewall questions later the same day as she and Chelsea emerged from a Filipino restaurant in Queens after approximately three hours during which they appeared to be filming.",
    "'With the revelations that Trump was indeed spied on during 2016 and deep into his presidency it is time for anyone complicit in this crime resign from the Biden Administration and be charged.",
    "Sullivan has been a key figure in Democratic circles since 2008 when he was foreign policy adviser to Hillary Clinton's presidential run, before joining Barack Obama's general election team.",
    "Jake Sullivan is already a notorious partisan and if he participated in Clinton's illicit spying on President Trump, he must be removed from office and held responsible,' Banks said.",
    "Top Republicans are now questioning whether the Biden official with a heavy hand in US foreign policy knowingly promoted faulty information while hiding his boss's link to it.",
    "It was in response to an article in Slate covering a team of computer scientists who claimed to have discovered a link between Trump and Russia-based Alfa Bank.",
    "Exclusive pictures and video obtained by DailyMail.com show a stoney faced Clinton silently waving away repeated questions of whether she spied on Donald Trump.",
    "Hillary Clinton refused to answer questions about allegations that her allies spied on the Trump campaign as the controversy continued to engulf her Tuesday.",
    "But the document goes on to allege in fact he was being paid by at least two clients - a U.S. technology executive and the Clinton presidential campaign.",
    "The timing of the matter raises particular concerns about Sullivan's role in the US response to the rapidly worsening crisis between Russia and Ukraine.",
    "Clinton shared a statement from Sullivan, a top foreign policy adviser on her campaign, on October 31, 2016, just days before the presidential election.",
    "Senator Marsha Blackburn of Tennessee accused Sullivan of a 'conflict of interest' in his current efforts trying to de-escalate with Moscow.",
    "Texas Senator Ted Cruz called out the Clinton campaign as well as mainstream media outlets that have largely been ignoring the filing.",
    "Rep. Jim Banks of Indiana told DailyMail.com Sullivan should be removed from office if the allegations were proven to be true.",
    "Conservative Political Action Conference chair Matt Schlapp demanded that Sullivan quit his role in the Biden administration.",
    "'Computer scientists have apparently uncovered a covert server linking the Trump Organization to a Russian-based bank.'",
    "'The corrupt corporate media breathlessly covered every contour of the Russia lies spread by Hillary & her cronies.",
    "South Carolina Senator Lindsey Graham said that if proven true, the Clinton campaign's actions are 'unacceptable.'",
    "The foreign policy adviser is Sullivan, 44, according to Fox News, which cited two well-placed sources.",
    "He added, 'This secret hotline may be the key to unlocking the mystery of Trump's ties to Russia.'",
    "Sussmann was charged in September with allegedly lying to the FBI, and has pleaded not guilty.",
    "Now it's reported that Hillary's team paid to hack the White House & Trump Tower, crickets!",
    "He now works in the Biden White House,' Rep. Jim Jordan of Ohio wrote on Twitter Monday.",
    "She also said Sullivan 'lied to the American people in hopes of winning an election.'",
    "'This could be the most direct link yet between Trump and Moscow,' Sullivan said.",
    "'No one who has spied on the White House is fit to serve in the White House.",
    "Trump said the latest findings are 'just the beginning' of what is to come.",
    "Sullivan had been a top foreign policy adviser to Clinton's campaign.",
    "The lawyer slammed the special counsel's allegations as 'false.'",
    "'This is such a big event, nobody's seen anything like this.'",
    "Zero coverage on NBC, ABC, & CBS morning shows.",
    "Jake Sullivan must step down,' Schlapp said.",
    "'Jake Sullivan pushed the Russia hoax.",
    "Cruz said on Monday night.",
    "The silence is damning!'",
    "He knew it was a lie."
  ]
}