{
  "id": 5363,
  "mediaId": 6513,
  "date": "2022-02-14",
  "headline": "Ingraham: Lessons From Up North",
  "image": "https://lauraingraham.com/wp-content/uploads/2022/02/lessons-from-the-north-canada-truckers.jpg",
  "link": "https://lauraingraham.com/2022/02/ingraham-lessons-from-up-north/",
  "mediaOutlet": "Laura's Official Home On The Web",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "LauraIngraham.com Staff",
  "authorUrl": "https://lauraingraham.com/author/staffeditor/",
  "termIds": [
    0
  ],
  "sentences": [
    "“The situation in Canada is a preview of what would have happened here if we didn’t have a strong populist movement that listens to America’s working class voters — In Canada, workers have a lot less hope than we have here, so they’re turning to more radical actions.”\nIngraham added that in the recent federal elections in Canada, the right-leaning Conservative Party was trounced by Trudeau’s liberals, after they put forward a “Mitt Romney”-like moderate in the form of Ontario MP Erin O’Toole.",
    "But they’re scared because if usually mild-mannered Canadians have figured things out – that most of what their governments did to fight COVID was insanely destructive, then how can liberals here possibly think for one second that they’re going to keep this COVID theater going on in the United States for much longer?”\nIngraham called the style of reporting on the freedom convoy a “huge mistake” because many North Americans will or have already figured out the truth about what is going on.",
    "Now note the reporters, exasperated tone and pained expressions,” she said, comparing statements about the Ottawa convoy as a threat to democracy, while one report on left-wing rioters causing property damage at CNN’s Georgia HQ cited “a bit of the outrage being expressed across the country.”\n“The regime media knows exactly what’s happening in Canada and it scares the heck out of them,” Ingraham said.",
    "In her “Ingraham Angle” commentary on Monday, host Laura Ingraham illustrated how Canadian truckers are teaching “lessons from up north” as they converge on Ottawa and have been met with fierce resistance by that city’s mayor, police chief and Prime Minister Justin Trudeau – the latter of whom has reportedly left the city.",
    "They are so lazy, so unimaginative and so bereft of fresh thinking that now they just cut and paste their scripts about January 6th and apply them to any protest or rally against left-wing government overreach,” she said.",
    "Ingraham said the media coverage in both countries glaringly conflicts with the softer reporting on the BLM and Antifa riots, including one that occurred at CNN’s world headquarters in Atlanta.",
    "“Out-of-touch provincial governments drunk on their own power thought that they could keep Canadians subdued with these COVID rules forever, but they were wrong,” she said.",
    "Ingraham said that in the U.S., the GOP – except for people like Romney, a Utah senator, and Rep. Liz Cheney of Wyoming – has largely rejected the Bush-era “old guard.”",
    "Democrats don’t like that ‘old normal’ where Americans enjoyed their freedoms\n“Just when you think that CNN can’t sink lower, they surprise you.",
    "“Now it’s not because they think the truckers or the truckers supporters are terrorists: They know they’re not.",
    "“Case in point is their coverage of Canada’s expanding freedom convoy."
  ]
}