{
  "id": 5420,
  "mediaId": 2781,
  "date": "2022-02-16",
  "headline": "IGNORED: Reporter Confronts Hillary Clinton On Whether She Spied On Trump’s Campaign (VIDEO)",
  "image": "https://joemiller.us/wp-content/uploads/R-2022-02-15T212036.100.jpeg",
  "link": "https://joemiller.us/2022/02/ignored-reporter-confronts-hillary-clinton-on-whether-she-spied-on-trumps-campaign-video/?utm_source=rss&utm_medium=rss&utm_campaign=ignored-reporter-confronts-hillary-clinton-on-whether-she-spied-on-trumps-campaign-video",
  "mediaOutlet": "joemiller.us",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "News Editor",
  "authorUrl": "https://joemiller.us/author/joe-miller/",
  "termIds": [
    2201,
    2434,
    4599,
    4609,
    285,
    370,
    696
  ],
  "sentences": [
    "John Durham, appointed by then-Attorney General William Barr in 2020 to probe the origins of the FBI’s investigation of Russian election interference, said “Tech Executive-1,” not named in the filing but first identified by The New York Times as Rodney Joffe, used his access to domain name system, or DNS, data to compile information about which computers and servers the White House servers were communicating with.",
    "“And it goes right to the Clinton campaign.” In a statement Monday, Trump said the alleged spying was “the biggest story of our time, bigger than Watergate.” (Read more from “Tech Exec Used Access to White House Computers to Look For Dirt on Trump, Says Special Counsel” HERE)\nDelete Facebook, Delete Twitter, Follow Restoring Liberty and Joe Miller at gab HERE.",
    "pic.twitter.com/q351KxGO43\n— X Strategies LLC (@XStrategiesLLC) February 15, 2022\nAccording to a new filing from Special Counsel John Durham released Friday, the Clinton campaign paid a tech company that “exploited” their access to servers at both the Trump Tower and the White House.",
    "(Read more from “Reporter Confronts Hillary Clinton on Whether She Spied on Trump’s Campaign” HERE)\n____________________________________________________\nTech Exec Used Access to White House Computers to Look For Dirt on Trump, Says Special Counsel\nBy NBC News.",
    "A tech executive “exploited” his access to computer data at the White House to find “derogatory information” about President Donald Trump, a special counsel appointed during the Trump administration said in a court filing Friday.",
    "“When are you going to comment on the spying allegations, Hillary?” the reporter questioned again, receiving no response from the former Secretary of State and 2016 Democrat presidential candidate.",
    "BREAKING: Hillary Clinton ignores questions from a Daily Mail reporter about revelations from Durham that her 2016 campaign paid for illegal spying on Donald Trump.",
    "Hillary Clinton ignored a Daily Mail reporter Tuesday when asked if her campaign had paid to illegally spy on Donald Trump in 2016.",
    "“They were spying on the sitting president of the United States,” Rep. Jim Jordan, R-Ohio, told Fox News on Sunday.",
    "Trump and his allies said the disclosure was proof that Trump was under surveillance while he was in office.",
    "The transactions were part of an ongoing effort at the time to link the Trump campaign to Russia.",
    "“Did you pay to spy on the Trump campaign?” the reporter asked Clinton in New York City.",
    "By Daily Caller."
  ]
}