{
  "id": 5421,
  "mediaId": 2548,
  "date": "2022-02-17",
  "headline": "Lou Dobbs Calls Kevin McCarthy A ‘RINO,’ Says Jim Jordan Or Matt Gaetz Would Be Better As Potential Speaker Of House",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/02/dobbs_gaetz-scaled-e1645130519259.jpg",
  "link": "https://dailycaller.com/2022/02/17/lou-dobbs-kevin-mccarthy-rino-jim-jordan-matt-gaetz-speaker-2022-midterms/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christine Sellers",
  "authorUrl": "https://dailycaller.com/author/C.Sellers",
  "termIds": [
    0
  ],
  "sentences": [
    "I really believe that the brightest, hardest working conservative leaders we have in the House should be leading the House and I believe most of the members would agree with me on that.” (RELATED: Unpopular Kamala Harris Could Be A Thorn In The Side Of Democrats’ Midterm Elections)\nRepublican South Dakota Sen. John Thune was previously named as a possible successor for McConnell should he choose not to seek reelection, according to The New York Times.",
    "Lou Dobbs called Republican House Minority Leader Kevin McCarthy a “RINO” and said he has two other people in mind for speaker of the House if Republicans retake the majority in the November midterm elections.",
    "Dobbs spoke with Republican Florida Rep. Matt Gaetz during a Thursday episode of the congressman’s show, “Firebrand,” about a variety of topics, including how to take back the Republican party.",
    "I personally believe him to be outright, a RINO.”\nWATCH:\nDobbs continued, saying the Republican party needs “new blood” and “vibrancy” in leadership.",
    "“It’s a shame, in my opinion, that Kevin McCarthy wants to be Speaker when the Republicans win in November,” Dobbs said.",
    "“You bet I could be excited about [Republican Ohio Rep.] Jim Jordan,” Dobbs said.",
    "“Could you be excited about a Speaker Jim Jordan?” Gaetz then asked in response.",
    "He is too much of a, I’ll be kind, if not RINO, then a middle-of-the-roader.",
    "“As you well know, I think highly of him.",
    "I think you should be in there as well.",
    "I think highly of you.",
    "“It’s outrageous."
  ]
}