{
  "id": 5433,
  "mediaId": 2746,
  "date": "2022-02-13",
  "headline": "Republicans vow to ‘get to the truth’ after Durham reports Democrat-linked spying on Trump",
  "image": "https://twt-thumbs.washtimes.com/media/image/2020/09/29/image_c0-109-2000-1275_s1200x700.jpg?603e226ea9de50ae9351a33ee17c3ee4c5567d2f",
  "link": "https://www.washingtontimes.com/news/2022/feb/13/republicans-vow-get-truth-after-durham-reports-dem/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Mordock",
  "authorUrl": "https://www.washingtontimes.com/staff/jeff-mordock/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Yep, there was spying going on, and it was worse than we thought because they were spying on the sitting president of the United States, and it goes right to the Clinton campaign,” Rep. Jim Jordan, Ohio Republican, said Sunday on “Fox & Friends.”\nHouse Minority Leader Kevin McCarthy, California Republican, tweeted Saturday that “Democrats got caught spying, first on candidate Trump and then when he was President IN THE WHITE HOUSE.”\n“The Russia hoax was a lie from day one — manufactured by his political enemies — and every person involved with this un-American activity must be brought to justice,” he said.",
    "We’ve never seen anything like that in history.”\nKash Patel, a chief investigator of the Trump-Russia collusion probe for Devin Nunes, who was chairman of the House intelligence committee, said the filing “definitively shows that the Hillary Clinton campaign directly funded and ordered its lawyers at Perkins Coie to orchestrate a criminal enterprise to fabricate a connection between President Trump and Russia.”\nMr. Sussmann is among three people indicted by Mr. Durham, who was tasked in 2019 to investigate the FBI’s actions in the early stages of the Trump-Russia probe.",
    "“Tech Executive-1 also enlisted the assistance of researchers at a U.S.-based university who were receiving and analyzing large amounts of Internet data in connection with a pending federal government cybersecurity research contract.”\nMr. Durham said the tech executive used the researchers to “mine internet data” to establish “an inference” and “narrative” tying Mr. Trump to Russia.",
    "Time for serious consequences.”\nIn the filing, Mr. Durham says the government has evidence that an unidentified technology executive “exploited” an arrangement with the government to monitor Mr. Trump’s internet traffic at Trump Tower, Mr. Trump’s Central Park West apartment, the Executive Office of the President and an unidentified health care provider.",
    "This is so wrong, and allegations of such a level of illegal activity that goes directly to our faith in our own government, that the truth must be found.”\nHouse Minority Whip Steve Scalise, Louisiana Republican, called the details “shocking.” He said in a tweet: “if they can do this to a president, imagine what they can do to you.",
    "‘Serious consequences’\nRep. Michael Turner of Ohio, the ranking Republican on the House Permanent Select Committee on Intelligence, said Sunday that he and Mr. Jordan, the ranking House Judiciary Committee member, would use “every aspect of congressional power to get to the bottom of this.”\n“We have to get to the truth.",
    "Special counsel John Durham alleged in a court filing Friday that a tech company working with an attorney for the Clinton campaign exploited its access to servers for Mr. Trump’s residence, Trump Tower and the White House to mine data that would establish an “inference” and a “narrative” connecting Mr. Trump to Russia.",
    "“In a stronger period of time in our country, this crime would have been punishable by death.”\nMr. Dunham’s stunning accusations were included in a court filing claiming former Clinton campaign lawyer Michael Sussmann has a conflict of interest with his attorneys.",
    "Stunned Republicans demanded answers Sunday after an explosive court filing linked the 2016 Hillary Clinton campaign to a purported surveillance operation aimed at digging up dirt on Donald Trump both before and after he won the presidential election.",
    "‘Russian phones’ debunked\nMr. Durham said Mr. Sussmann relied on the purported domain name system traffic from Trump Tower, Mr. Trump’s apartment building and the health care provider to give the FBI additional accusations about Mr. Trump.",
    "“In truth and in fact, the defendant was representing Tech Executive-1 — a fact the defendant subsequently acknowledged under oath in December 2017 testimony before Congress, without identifying the client by name,” the filing said.",
    "The filing says the tech executive had come to access and maintain dedicated services for the Executive Office of the President as “part of a sensitive arrangement, whereby it provided [domain name system] resolution services.",
    "“This is a scandal far greater in scope and magnitude than Watergate and those who were involved in and knew about this spying operation should be subject to criminal prosecution,” Mr. Trump said in a statement.",
    "Those accusations sent to the FBI included claims that Mr. Trump and his associates were using rare, Russian-made wireless phones in the vicinity of the White House and other locations, Mr. Durham wrote.",
    "Court filings identified the tech executive only as “Tech Executive-1.” In previous filings by Mr. Durham, “Tech Executive-1” referred to Rodney Joffe, an internet entrepreneur and internet data expert.",
    "Democrats and mainstream media figures have dismissed that claim as a conspiracy theory, but Republicans said this weekend’s bombshell filing shows the spying was even more extensive than they thought.",
    "This is a threat to our democracy itself,” Mr. Turner said on Fox News Channel’s “Sunday Morning Futures.” “It doesn’t matter really which political campaign this is or which political party this is.",
    "“Tech Executive-1 and his associates exploited this arrangement by mining the [president’s office] for the purpose of gathering derogatory information about Donald Trump,” Mr. Durham writes.",
    "The tech executive’s claims that Mr. Trump and his associates were using rare Russian phones were suspicious domain name system lookups affiliated with a Russian mobile phone provider.",
    "Mr. Sussmann has been charged with making a false statement to the FBI about a now-debunked claim of a secret communication channel between the Trump Organization and a Russian bank.",
    "The special counsel said, like Mr. Sussmann’s meeting with the FBI, he claimed he was not representing a client when, in fact, he was there on behalf of the Clinton campaign.",
    "Mr. Trump said Mr. Durham, who is investigating the origins of the Trump-Russia collusion probe, has revealed the depth of the Democrats’ scheme to undermine his presidency.",
    "“In doing so, Tech Executive-1 indicated that he was seeking to please certain ‘VIPs,’ referring to individuals at Law Firm-1 and the Clinton campaign,” Mr. Durham wrote.",
    "“In his meeting with Agency-2 employees, the defendant also made a substantially similar false statement as he made to the FBI General Counsel,” Mr. Durham wrote.",
    "investigative firm” hired by “Law Firm 1” on behalf of the Clinton campaign worked with researchers at internet companies to put together data and white papers.",
    "The filing says Mr. Sussmann worked with a technology executive, an internet company and the Clinton campaign to assemble and convey the claims to the FBI.",
    "“You had the government working with the Clinton campaign to go after the Republican Party’s nominee for president, to spy on that campaign.",
    "“In connection with these efforts Tech Executive-1 exploited his access to non-public and/or proprietary Internet data,” Mr. Durham wrote.",
    "He was sentenced to one year of probation for altering an email that made it easier for the FBI to surveil a member of the Trump campaign.",
    "Former FBI lawyer Kevin Clinesmith pleaded guilty to one count of making a false statement, a charge that arose from the Durham probe.",
    "In October, Mr. Durham indicted Igor Danchenko, a Washington-based analyst who was a key source for the Christopher Steele dossier.",
    "Mr. Danchenko is charged with five counts of lying to the FBI about where he obtained his information for the anti-Trump dossier.",
    "That puts some of the fiercest critics of the Democrats’ collusion claims in position to take over key investigative committees.",
    "Mr. Durham said Mr. Sussmann took these claims to a second government agency after bringing them to the attention of the FBI.",
    "He said more than 3 million lookups of Russian phone IP addresses from 2014 to 2017 originated with U.S.-based IP addresses.",
    "Mr. Durham said records show Mr. Sussmann “repeatedly billed the Clinton campaign” for his work on Russian bank accusations.",
    "“In particular, the defendant asserted that he was not representing a particular client in conveying the above allegations.",
    "He said the filing provides “indisputable evidence” that Clinton campaign operatives spied on his campaign and presidency.",
    "Fewer than 1,000 of these lookups originated with IP addresses affiliated with Trump Tower, Mr. Durham said.",
    "“Another fact which the allegation omitted,” Mr. Durham wrote about the lookups during the Obama era.",
    "The lookups near the White House began as early 2014, during the Obama administration.",
    "The 13-page document was filed in U.S. District Court for the District of Columbia.",
    "The Republican Party is widely expected to retake control of the House in November.",
    "Mr. Trump has long accused the Clinton campaign of spying on him.",
    "The special counsel said he found no support for this accusation.",
    "In July 2016, Mr. Sussmann, the tech executive and “U.S.",
    "“That is what is so frightening here,” said Mr. Jordan.",
    "House Republicans are poised to do more than bluster.",
    "Mr. Durham said those lookups were far from rare.",
    "He has pleaded not guilty.",
    "Scary."
  ]
}