{
  "id": 5442,
  "mediaId": 2627,
  "date": "2022-02-15",
  "headline": "The new ‘spying’ story is clearly not what Trump thinks it is",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/69-MB-Trump-Spying-Investigation-jg-fa623d.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-spying-story-clearly-not-trump-thinks-rcna16370",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    0
  ],
  "sentences": [
    "On Saturday, Trump issued a written statement claiming that John Durham has presented “indisputable evidence that my campaign and presidency were spied on by operatives paid by the Hillary Clinton Campaign.” The former president’s statement added that the controversy, such as it is, should be seen as “far greater” than Watergate, adding, “In a stronger period of time in our country, this crime would have been punishable by death.”\nNo, seriously, that’s what he put in writing.",
    "Republican Rep. Jim Jordan of Ohio declared today, “If they can spy on a sitting United States President, they can spy on anyone.”\nIn reality, “they” didn’t spy on a sitting president, but if House Republicans take back the majority, and Jordan becomes the chairman of the House Judiciary Committee, it’s a safe bet a congressional investigation into this nonsense will be a top priority.",
    "Even putting aside the fact that Durham has an unfortunate habit of presenting provocative ideas that don’t stand up well to scrutiny — which helps explain why news organizations were cautious about pouncing on the so-called “controversy” — in this matter, there’s still no evidence of “infiltration,” “hacking,” or “spying,” all words used by Trump and conservative media this week.",
    "The New York Times explained:\nWhen John H. Durham, the Trump-era special counsel investigating the inquiry into Russia’s 2016 election interference, filed a pretrial motion on Friday night, he slipped in a few extra sentences that set off a furor among right-wing outlets about purported spying on former President Donald J. Trump.",
    "Eventually, the Republican started issuing statements complaining that journalists weren’t paying enough attention to his hysterical whining about Team Clinton getting caught “illegally spying into the Office of the President.”\nAs is often the case, the trouble is that Trump doesn’t understand the story that sparked his tantrum.",
    "As regular readers may recall, the investigations into Trump’s Russia scandal led to a series of striking findings: The former president’s political operation in 2016 sought, embraced, capitalized on, and lied about Russian assistance — and then took steps to obstruct the investigation into the foreign interference.",
    "Another paragraph in the court filing said that Mr. Joffe’s company, Neustar, had helped maintain internet-related servers for the White House, and that he and his associates “exploited this arrangement” by mining certain records to gather derogatory information about Mr. Trump.",
    "The Republican called it “Spygate.”\nIf you’re struggling to remember the details of the manufactured controversy, don’t feel too bad about it: Trump also had a hard time explaining exactly what he thought the story was all about.",
    "Even congressional Republicans distanced themselves from the absurdities, and eventually, the nonsense faded away — though Trump would nevertheless declare periodically that the Obama administration had spied on him.",
    "This, of course, only served to outrage Trump even more, so then-Attorney General Bill Barr tapped a federal prosecutor — U.S. Attorney John Durham — to conduct his own investigation into the investigation.",
    "What we actually have is old news about Sussman and a superfluous story about cybersecurity researchers at Joffe's company examining malware in the White House — from Obama’s term, not Trump’s.",
    "But the entire narrative appeared to be mostly wrong or old news — the latest example of the challenge created by a barrage of similar conspiracy theories from Mr. Trump and his allies.",
    "Either way, when your weird uncle who consumes conservative media all day sent you all-caps emails about Trump being “spied” on, he was pushing a story with no real basis in fact.",
    "What's more, Trump's website moved some links around without explanation, so I've swapped out one of the above links to the Wayback Machine so readers can see the original text.",
    "about odd internet data suggesting that someone using a Russian-made smartphone may have been connecting to networks at Trump Tower and the White House, among other places.",
    "It was against this backdrop that prosecutors had another court filing late last week, which Trump and the right seized on in ways that don’t stand up well to scrutiny.",
    "The Trump White House wasn’t pleased, and the Justice Department’s inspector general conducted a lengthy probe of Special Counsel Robert Mueller’s investigation.",
    "Soon thereafter, evidence emerged that Durham’s indictment was misleading, relying on selective quotes and omitting relevant details from their proper context.",
    "Maybe Durham and his team didn’t realize their court filing would be exploited as part of a public-deception campaign launched by Trump and his media cohorts.",
    "Trump has periodically blurted out the prosecutor’s name, hoping Durham would bolster the Republican’s conspiracy theories, but little has come of the probe.",
    "Sussman met with the FBI nearly six years ago to discuss alleged connections between the Trump Organization’s computers and the Kremlin-linked Alfa Bank.",
    "What's more, Neustar had lawful access to the relevant information, and there doesn't appear to be any connection between Joffe's firm and Clinton.",
    "In 2018, after the then-president said the FBI had spied on his campaign, GOP lawmakers made clear they wanted nothing to do with Trump’s nonsense.",
    "The former president and conservative media went from zero to hyperventilating with surprising speed, overlooking all kinds of relevant details.",
    "Four years later, the now-former president has apparently decided to tweak his conspiracy theory, swapping out one central detail for another.",
    "Over the course of his presidency’s first year, Donald Trump came up with a conspiracy theory he seemed quite excited about.",
    "In December, Sussman’s lawyers disclosed evidence that raised additional doubts about the reliability of Durham’s charges.",
    "Sussman’s defense team has said he never claimed not to have clients, and it didn’t much matter who he worked for anyway.",
    "Last September, the prosecutor indicted cybersecurity attorney Michael Sussmann for allegedly having lied to the FBI.",
    "In 2017, for example, Trump invested a fair amount of energy pretending that Barack Obama had wiretapped Trump Tower.",
    "Also, Julian Sanchez had a worthwhile Twitter thread on the story, and emptywheel's coverage is well worth your time.",
    "A year later, “Spygate” involved an imagined scheme in which the FBI put a spy in his 2016 political operation.",
    "But it also recounted a meeting at which Mr. Sussmann had presented other suspicions to the government.",
    "Mr. Sussmann had obtained that information from a client, a technology executive named Rodney Joffe.",
    "According to Durham, he claimed he wasn’t acting on Clinton’s behalf when he secretly was.",
    "From the Times’ article:\nThe filing was ostensibly about potential conflicts of interest.",
    "Recommended\nThat said, it would be an overstatement to say Durham hasn’t charged anyone.",
    "The original “Spygate” story was a sad joke, and its third iteration is no better.",
    "This week, congressional Republicans are taking the fake scandal very seriously.",
    "Update: I originally misspelled Durham's name, and the text has been corrected.",
    "In the new iteration, Barack Obama didn’t spy on him, but Hillary Clinton did.",
    "A day later, Trump issued another statement, repeating the “spying” claim.",
    "The difference, however, is the reaction from congressional Republicans.",
    "Perhaps Durham and his team knew what would happen and didn’t care.",
    "It’s probably worth pausing to review how we arrived at this point.",
    "Not surprisingly, the IG’s office found nothing improper.",
    "In February 2017, Mr. Sussmann told the C.I.A.",
    "Indeed, the whole case is terribly odd.",
    "Then he issued another statement.",
    "(There was no such wiretapping.)",
    "(That didn’t happen, either.)",
    "And then another.",
    "It wasn’t true.",
    "He didn’t care."
  ]
}