{
  "id": 5460,
  "mediaId": 2572,
  "date": "2022-02-06",
  "headline": "Jim Jordan: Gerrymandering apparently only exists when GOP does it",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/Jim-Jordan-CC-3.jpg",
  "link": "https://www.foxnews.com/media/jim-jordan-democrats-gerrymandering-gop-levin",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    2222,
    3231,
    3346,
    4104,
    4486,
    305,
    878,
    4887,
    5130
  ],
  "sentences": [
    "Jordan added there are a multitude of things Republicans could do as the majority party with Biden in the White House, including investigate Dr. Anthony Fauci in terms of his claims about coronavirus and the revelations about gain-of-function research funding, as well as probe the NIH and CDC.",
    "Looking ahead to November's elections, host Mark Levin said it is important that Republicans continue to press the issues that have proven successful in off-year races in Virginia and New Jersey, such as banning critical race theory and drawing attention to President Biden's border crisis.",
    "Larry Hogan, a Republican, has urged the federal government to sue his state to stop such gerrymandering, calling that state's map a \"far more egregious civil rights violation\" of Marylanders than a Republican-drawn Texas map that drew a federal lawsuit from Biden's Justice Department.",
    "\"Unfortunately, this year’s Legislative Reapportionment Commission appears to have wholly disregarded existing communities of interest, making massive changes in a number of districts across the state,\" the Pennsylvania House Republican caucus said in a recent statement on the matter.",
    "Levin pointed to New York state, where Democrats in control of redrawing that map after the state lost a congressional district are being accused of trying to draw out Republican Reps. Lee Zeldin, Nicole Malliotakis and Claudia Tenney.",
    "Besides Maryland, California appears to also be slightly weighted toward Democrats, taking into account the fact it is already heavily Democratic, Jordan said, as Sacramento Democrats are also in charge of drawing that state's map.",
    "Tom Wolf and the Republican legislature again ended up deadlocked on that state's new map, the Democratic-majority Supreme Court announced Wednesday that it will take over the duty of redrawing the state's congressional map.",
    "Wolf recently vetoed a \"citizens' congressional redistricting map\" presented by the legislature, which the relevant state House committee's chairman, Rep. Seth Grove, R-York, called \"political brinkmanship.\"",
    "Democrats often cry foul on alleged Republican gerrymandering, but they are silent as they engage in similar conduct on a larger scale, Rep. Jim Jordan, R-Ohio, said this week on \"Life, Liberty & Levin.\"",
    "Hogan's predecessor, Democrat Martin O'Malley, admitted in 2017 that he was intentionally trying to turn Maryland's map bluer, despite the heavily-Republican western panhandle and Eastern Shore.",
    "Jordan agreed, saying it is \"only gerrymandering when Republicans control the state legislature and draw the districts, but not when Democrats do it in, like, New York, Maryland, California.\"",
    "A spokesperson for state Senate Minority Leader Jay Costa, D-Pittsburgh, told Fox News \"he believes that these maps are the preliminary product of a very transparent and inclusive process.\"",
    "The commission was made up of majority and minority leaders of both chambers, plus a court-appointed chairman, University of Pittsburgh Institute of Politics director Mark Nordenberg.",
    "We've got to tell them how bad the Biden administration is, what we'll do if, in fact, we get power, the investigations, the oversight we'll do so the American people get the truth.\"",
    "Maryland Democrats, who hold majorities in both chambers in Annapolis, have been trying to draw out the state's last remaining Republican congressman, Rep. Andy Harris, Levin said.",
    "\"So there's all kinds of things that the American people want answers to, namely the attacks on their First Amendment rights that we need to have investigations on,\" he said.",
    "State Senate Redistricting Commission Chairman Michael Gianaris, D-Queens, said attorneys analyzed the new map and that he is \"confident that all requirements have been met.\"",
    "All western Maryland districts now bend southward to include heavily-Democratic Washington suburbs, while in the east, all but Harris's touch Baltimore City.",
    "\"These things are going on in New Mexico, they're going on in California, and I feel that Democrats are better at this sort of thing than the Republicans.\"",
    "\"There's still a lot of Republicans in California, but you look at the General Assembly in California — it's dominated by Democrats,\" he said.",
    "In a deposition, O'Malley said \"that was my hope\" to oust then-Rep. Roscoe Bartlett, R-Md., from the \"Mountain Maryland\" region.",
    "\"In other words, the Democrats are better at being scandalous … and the Republicans better wake the hell up,\" the host said.",
    "He noted to Jordan that Democrats do a much better job of crafting some less-apparent aspects of elections in their favor.",
    "Jordan added that, redistricting aside, Republicans should continue to push their issues ahead of the midterm elections.",
    "We always say, ‘Never be overconfident, just be confident’ — so we can't be overconfident.",
    "Malliotakis is the only remaining GOP member of New York City's congressional delegation.",
    "That particular redrawn district is now represented by Democratic Rep. David Trone.",
    "\"They're trying to wipe out the one Republican congressman they have,\" Levin said.",
    "\"You see what's going on in New York,\" Levin said.",
    "Meanwhile, in Pennsylvania, after Democratic Gov.",
    "\"We've got to go talk to the American people.",
    "We've got to do the work,\" Jordan said.",
    "\"My background [is] wrestling.",
    "Outgoing Gov."
  ]
}