{
  "id": 5467,
  "mediaId": 2572,
  "date": "2022-02-10",
  "headline": "Canada’s trucker protests and history’s parallels",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/Canada-THUMB.jpg",
  "link": "https://www.foxnews.com/politics/reporters-notebook-canada-trucker-protests-historys-parallels",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1499,
    2116,
    2380,
    3427,
    4594,
    4927,
    5382,
    5387
  ],
  "sentences": [
    "Farmers stormed out of a meeting with House Agriculture Committee Chairman and future House Speaker Tom Foley, D-Wash. Foley told them he favored legislation to help boost prices for agricultural commodities - couldn’t guarantee a bill would turn higher profits for farmers.",
    "(Jeff McIntosh /The Canadian Press)\n‘FREEDOM CONVOY’ PROTESTERS CAUSE MILES-LONG TRAFFIC JAM NEAR US-CANDA BORDER IN MICHIGAN\nMultiple Capitol Hill sources tell Fox News they are unaware of any plan for truckers to duplicate anything in Washington.",
    "And, if the O’s are in a rain delay, you too can learn about Pierre Trudeau, the October Crisis – and simultaneously follow the post-season exploits of Brooks Robinson and Johnny Bench in the Fall Classic.",
    "All I can say is ‘go on and bleed.’ But it’s more important to keep law and order in this society than to be worried about weak-kneed people who don’t like the looks of a soldier’s helmet,\" said Trudeau.",
    "Thousands of farmers lumbered down I-270 and the Beltway toward the heart of the city, driving tractors, combines and hauling everything from planters to balers.",
    "Anyway…\nGIVESENDGO CFO RIPS GOFUNDME FOR BLOCKING CANADA TRUCKER DONATIONS: ‘STANDS IN THE FACE OF ALL FREEDOMS’\nTrudeau was quick to move against the FLQ.",
    "So here’s a question:\nCould the truckers who iced Parliament Hill in Ottawa over vaccine and mask mandates also freeze Capitol Hill and Washington, D.C.?",
    "JIM JORDAN: DEMOCRATS ARE RELAXING COVID MANDATES BECAUSE THE POLLS HAVE CHANGED\nThe farmers then unloaded goats to graze on the Capitol grounds.",
    "An aside…\nBelieve it or not, there is a great accounting of this event if you ever tune in to a Baltimore Orioles game and there is a rain delay.",
    "There has been increased surveillance around the Capitol for potential \"truck bombs\" and other threats after the 1995 Oklahoma City bombing.",
    "French Canadian separatists (known as the Front de liberation du Quebec, or FLQ) agitated for years to make Quebec an independent nation.",
    "For starters, the U.S. Capitol Police have prohibited large trucks from creeping anywhere near the Capitol complex since just after 9/11.",
    "Pierre Trudeau garnered his share of criticism in later years for abusing civil liberties in an effort to get after the FLQ terrorists.",
    "(Jeff McIntosh /The Canadian Press)\nThere are comparisons between the farmers coming to Washington and the truckers parking in Ottawa.",
    "(Adrian Wyld/The Canadian Press)\nCANADA TRUCKERS FEEL VILIFIED BY TRUDEAU\nTrudeau’s \"just watch me\" quip fueled a national sensation.",
    "Capitol Police brought in extra officers to deal with the farmers and barred their agricultural implements from the Capitol grounds.",
    "Some longtime observers of Canadian politics have suggested that the younger Trudeau channel his father to deal with the truckers.",
    "But in 1970, it was his father, legendary Canadian Prime Minister Pierre Trudeau, who had to wrestle with a violent uprising.",
    "Still, Fox is told there have been conversations about what would happen if 18-wheelers and other rigs paralyzed the Capitol.",
    "The farmers created chaos for weeks in Washington, D.C. Ottawa is now dealing with the truckers – with no end in sight.",
    "Around the fourth inning, the CBC breaks into the 1970 broadcast with a special report about the kidnapping of Laporte.",
    "The Canadian government beefed up security and dispatched police in riot gear around Montreal and other major cities.",
    "In the winter of 1978, thousands of farmers rode their tractors to Washington, snarling traffic on I-66 in Virginia.",
    "That said, there is historic precedent for an over-the-road, over-the-top, motorized demonstration in Washington.",
    "That includes Game 2 of the 1970 World Series between the triumphant Orioles and vanquished Cincinnati Reds.",
    "The farmers actually came in handy when a blizzard blasted Washington with 2 feet of snow in late February.",
    "Farmers routinely began jamming up traffic in Washington, D.C., to protest farm prices in the late 1970s.",
    "This essentially repealed many civil liberties in an effort to quash the FLQ uprising and restore order.",
    "The farmers reaped very little in return despite their \"plow on Washington\" more than four decades ago.",
    "It’s unclear if the U.S. will see any sort of demonstrations about masks and vaccines like in Canada.",
    "What remains to be seen is if the truckers gain any political mileage from their protest in Ottawa.",
    "Of course, you can’t really pull over every truck if a convoy of trucks rolled toward Capitol Hill.",
    "The tactics of the farmers were so aggressive that the stunt turned off lawmakers to their plight.",
    "The Canadian government cut a deal with the FLQ in exchange for Cross after more than two months.",
    "\"There’s a lot of bleeding hearts around who just don’t like to see people with helmets and guns.",
    "In October 1970, the FLQ kidnapped British Trade Commissioner James Cross and held him hostage.",
    "There has been chatter about truckers protesting the Super Bowl in Los Angeles this weekend.",
    "The Washington Post characterized the farmers as \"growing more militant\" in their approach.",
    "CBC reporter Tim Ralfe caught up with Trudeau as he arrived on Parliament Hill one morning.",
    "The Baltimore broadcasters have been known to play \"Orioles Classics\" during rain delays.",
    "The FLQ is responsible for dozens of bombings, assaults and bank robberies in the 1960s.",
    "Many Canadians embraced Trudeau’s hard line in an effort to restore calm from the chaos.",
    "But so far, Justin Trudeau has taken a hands-off approach and encouraged \"free speech.\"",
    "It was the only time that the Canadians ever applied the War Measures Act in peacetime.",
    "So the broadcast Orioles fans see is from the Canadian Broadcasting Corporation (CBC).",
    "Many turned to the farmers to dig out roads and vehicles, debilitated by the snow.",
    "Canadian Prime Minister Justin Trudeau faces a conundrum with the truckers today.",
    "Officials declared that the farmers created a \"monstrous rush-hour traffic jam.\"",
    "The Capitol Police didn’t have the wherewithal to quell thousands of protesters.",
    "Trudeau, who was actually a staunch defender of civil rights, pulled no punches.",
    "Ralfe suggested that Trudeau went too far by having \"people with guns around.\"",
    "Police routinely divert or pull over trucks that roll onto prohibited streets.",
    "A few days later, the FLQ kidnapped Canadian Labour Minister Pierre Laporte.",
    "Choruses of \"Let’s go get ‘em out\" of jail echoed through the D.C. streets.",
    "Undaunted, the caravans of tractors returned to Washington in January 1979.",
    "But Washington already encountered this kind of protest back in the 1970s.",
    "A confrontation between seven farmers and police prompted seven arrests.",
    "A group of farmers set off on foot, marching along Pennsylvania Avenue.",
    "There has also been discussion of a caravan beginning in early March.",
    "But for whatever reason, the NBC tape of the game isn’t around today.",
    "The prime minister implemented the War Measures Act three days later.",
    "The farmers finally settled on a plot of land on the National Mall.",
    "But Laporte was found dead in the trunk of a car a few days later.",
    "And so far, the son is unwilling to impinge on civil liberties.",
    "The storm overwhelmed operations in the District of Columbia.",
    "Officials estimated damage to the Mall at $2 million.",
    "This began what Canadians call the \"October Crisis.\"",
    "More often than not, history doesn’t repeat itself.",
    "Police arrested 400 people – many without charges.",
    "Military troops rolled through the streets.",
    "The trucker protest is about civil rights.",
    "Sometimes there are parallels in history.",
    "The tractors chewed up the sod and turf.",
    "But its echoes resonate loud and clear.",
    "To be clear, there is no plan to do so.",
    "\"Well, just watch me,\" warned Trudeau.",
    "Authorities raided hundreds of homes.",
    "NBC broadcast the 1970 World Series.",
    "McCall and Rubber Duck just yet.",
    "Tractors putted along at 15 mph.",
    "That was the problem on Jan. 6.",
    "They stayed for months.",
    "\"How far would you go?\"",
    "Don’t call C.W.",
    "parried Ralfe."
  ]
}