{
  "id": 5531,
  "mediaId": 2643,
  "date": "2022-02-08",
  "headline": "Jim Jordan Rails Against Jan. 6 Committee Having So Many Prosecutors",
  "image": "",
  "link": "https://www.newsweek.com/jim-jordan-jan6-laura-ingraham-panel-1677101",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    1584,
    1670,
    4319,
    4405,
    404,
    1163,
    4890,
    5371,
    5382
  ],
  "sentences": [
    "\"It's really about making sure this town doesn't have someone like President Trump come back and disrupt the cozy relationship the establishment and the elite have here in Washington, D.C.\"\nJordan went on to suggest that the outrage from parents in Virginia over the apparent teaching of Critical Race Theory in schools, the jury clearing Kenosha shooter Kyle Rittenhouse of murder, and the ongoing vaccine mandate protests in Canada are examples of people pushing back against the \"elite mindset that says we're all dumb and they're all smart.\"",
    "Jordan, who is refusing to cooperate with the inquiry after being asked to voluntarily detail the nature of his conversations with Donald Trump ahead of the Capitol riot, was responding to a New York Times article which stated that the inquiry is using techniques similar to aggressive tactics employed federal prosecutions while targeting mobsters and terrorists.",
    "These tactics include targeting lower-level Trump staff members to provide information about the former president and his allies who have also signaled they will not cooperate with the investigation, and offering immunity to those who have invoked the Fifth Amendment to try and persuade them to testify.",
    "Speaking to The New York Times, Stanley Brand, a Democrat and the former top lawyer for the House who is now representing Trump ally Dan Scavino in the investigation, also said the Democrats may regret the scale and political fallout of the January 6 investigation after the midterms.",
    "\"Having lived through and been a part of every major congressional investigation over the past 50 years from Iran-Contra to Whitewater to everything else, this is the mother of all investigations and a quantum leap for Congress in a way I've never seen before,\" Brand said.",
    "\"If your whole focus is a legislative purpose, as it's supposed to be under our Constitution, do you really need 14 former prosecutors to figure out what you might do or might not do with the electoral Count Act, or whatever?\"",
    "Rep. Jim Jordan has questioned why the House Select Committee investigating the January 6 attack has more than a dozen former prosecutors and attorneys on its panel when it is not a criminal inquiry.",
    "Speaking to Fox News' Laura Ingraham, Jordan questioned if the congressional probe is reaching too far, considering it does not have the authority to pursue criminal charges.",
    "The article notes that the January 6 committee has hired more than a dozen former prosecutors, with two former attorneys also forming key parts of the panel.",
    "\"Americans have had it with all this and I think you're gonna see it manifest itself in a big way come this November's election.\"",
    "And now after he left office, they're trying to make sure he doesn't run again,\" Jordan said.",
    "The congressman added that the goal of the committee is \"all about getting President Trump.\"",
    "They think they're fighting for the survival of democracy and the ends justify the means.",
    "\"They spent four years while he was in office trying to get rid of him.",
    "The January 6 committee has been contacted for comment.",
    "\"When a frontier is pushed back, it doesn't recede.",
    "Just wait if the Republicans take over.\"",
    "Jordan said."
  ]
}