{
  "id": 5589,
  "mediaId": 2643,
  "date": "2022-02-04",
  "headline": "Jim Jordan Spoke With Trump in 10-Minute Phone Call on 1/6, Records Show",
  "image": "",
  "link": "https://www.newsweek.com/jim-jordan-spoke-trump-10-minute-phone-call-1-6-records-show-1676483",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Villarreal",
  "authorUrl": "https://www.newsweek.com/authors/daniel-villarreal",
  "termIds": [
    1670,
    1886,
    2201,
    2906,
    3975,
    234,
    878
  ],
  "sentences": [
    "However, Democratic House Speaker House Nancy Pelosi rejected Jordan and another of McCarthy's picks, Indiana Representative Jim Banks, over worries that they would compromise the \"integrity of the investigation.\"",
    "When the committed was first being formed in July 2021, Jordan was named by House Minority Leader Kevin McCarthy as one of five Republican members serving on the committee.",
    "When asked previously about his discussions with Trump on that day, Jordan has replied inconsistently and said he couldn't remember the exact times when the calls occurred.",
    "Republican Ohio Representative Jim Jordan talked with President Donald Trump on the phone during the morning of January 6, 2021, during the Capitol riots, according to CNN.",
    "Jordan objected to certifying Biden's electoral victory over Trump on January 6, 2021, and voted to overturn the election results in Arizona and Pennsylvania.",
    "Jordan later claimed that the message had been \"doctored\" when the text was read aloud by committee member, Democratic California Representative Adam Schiff.",
    "\"Mr. Jordan forwarded the text to Mr. Meadows, and Mr. Meadows certainly knew it was a forward,\" Russell Dye, Jordan's spokesperson told the news network.",
    "The White House call logs are among the many documents recently handed over by the National Archives to the House Select Committee on the January 6 riot.",
    "The committee is currently contemplating whether to issue a subpoena to get Jordan to testify before them after he refused to voluntarily do so.",
    "Trump had tried to block the committee from receiving the records, but the Supreme Court ruled against Trump on the matter last month.",
    "The text message outlined a legal theory that Pence could choose not to certify current President Joe Biden's 2020 election victory.",
    "The committee is curious about meetings Jordan had with Trump between the November 2020 election and the January 6 Capitol riots.",
    "Jordan met with Trump in a December 2020 meeting alongside then-Vice President Mike Pence and other congressional Republicans.",
    "The committee also has a text message that Jordan sent to then-White House chief of staff Mark Meadows on January 5.",
    "However, Schiff merely read a portion of the message and didn't alter its contents in any other significant way.",
    "Two entries on the White House call records showed that Trump called Jordan using a White House telephone.",
    "Pence said on Friday that he didn't have the power to do such a thing.",
    "They discussed how to overturn the election results, CNN reported.",
    "The call lasted about 10 minutes, the records showed.",
    "Newsweek contacted Jordan's office for comment."
  ]
}