{
  "id": 5590,
  "mediaId": 2594,
  "date": "2022-02-04",
  "headline": "Trump and Jim Jordan spoke for 10 minutes on the morning of Jan 6, new documents reveal",
  "image": "https://static.independent.co.uk/2021/12/22/22/EEUU-ASALTO_AL_CAPITOLIO_85722.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/jan-6-committee-trump-jordan-b2008098.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Garcia",
  "authorUrl": "https://www.independent.co.uk/author/eric-garcia",
  "termIds": [
    1670,
    2201,
    2906,
    3267,
    4432
  ],
  "sentences": [
    "When CNN asked Mr Jordan if he spoke with the former president before the riot began, he said “I don't recall” and added “I know I talked to him after we left off the floor.”\nPreviously, Mr Jordan had told Rep Jim McGovern, the chairman of the House Rules Committee, that he had spoken to the president after the attack.",
    "The House select committee investigating the riot on January 6 obtained documents showing that former presidentDonald Trump spoke with arch-conservative Rep Jim Jordan for 10 minutes the morning of the insurrection, CNN reported.",
    "Mr Jordan was also identified as one of the people who communicated with White House Chief of Staff Mark Meadows to propose a way for Vice President Mike Pence to prevent the certification of the election results.",
    "But what I know is that I spoke with him all the time.”\nThe committee had previously requested that Mr Jordan voluntarily provide information about his communication with the former president, which he rejected.",
    "One piece of information shows that the then-president tried to get Mr Jordan on the phone from the White House residence the morning of January 6, with a second entry showing that the call lasted 10 minutes.",
    "The new information comes as the committee debates whether to subpoena the OhioRepublican who is a major ally of the former president.",
    "Republican Reps Liz Cheney and Adam Kinzinger are the committee’s sole Republicans, with Ms Cheney service as vice chairwoman.",
    "House Minority Leader Kevin McCarthy had initially selected Mr Jordan to join the select committee.",
    "Later, he told Spectrum News “I don't know if I spoke with him in the morning or not.",
    "But House Speaker Nancy Pelosi vetoed his and Rep Jim Banks’s joining the committee.",
    "In response, Mr McCarthy pulled all five of his selections.",
    "I mean I don't know when those conversations happened.",
    "I'd have to go back.",
    "I just don't know."
  ]
}