{
  "id": 5592,
  "mediaId": 2526,
  "date": "2022-02-05",
  "headline": "Axios: Breitbart News Readers, Trump’s Small-Dollar Donors Steer ‘Modern’ GOP as Corporate Class Fades",
  "image": "https://media.breitbart.com/media/2022/02/breitbart-populism-getty-ap-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/05/axios-breitbart-news-readers-trumps-small-dollar-donors-steer-modern-gop-as-corporate-class-fades/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    1328,
    2201,
    3159,
    3466,
    3746,
    3975,
    104,
    151,
    878,
    934
  ],
  "sentences": [
    "For the 2022 midterms, nearly 100 Republican lawmakers have accepted donations from the Koch Industries PAC, including Reps. Liz Cheney (R-WY), Jeff Duncan (R-SC), Don Bacon (R-NE), Tony Gonzalez (R-TX), Adam Kinzinger (R-IL), Ashley Hinson (R-IA), Julia Letlow (R-LA), Jackie Walorski (R-IN), Garret Graves (R-LA), Jim Banks (R-IN), Byron Donalds (R-FL), Yvette Herrell (R-NM), and Jim Jordan (R-OH), among others.",
    "Andrew McCarthy, running in New York’s 24th congressional district, told Breitbart News that he, Joe Kent, running in Washington’s 3rd congressional district, and Anthony Sabatini, running in Florida’s 7th congressional district, are just a handful of some of the new blood campaigning to offer voters an “America First approach to policy” with teeth.",
    "Fourteen of the top GOP consultants and operatives detail how the Republican Party has shifted away from the Chamber of Commerce, the Koch brothers’ network of donor class organizations, National Review, and economic libertarian groups toward Trump’s small-dollar donors, populist-nationalist outlets like Breitbart News, and Tucker Carlson.",
    "Whereas Republicans once vied for campaign cash from the Kochs, major backers of mass immigration and job-killing free trade, candidates try to steer clear of the network while running against open borders and in support of industrial policy to reshore America’s manufacturing base.",
    "“We all owe Donald Trump a great deal for singlehandedly destroying the corrupt globalist and corporatist orthodoxies that previously defined the Republican Party, in favor of a new Republican Party, that is pro-worker and always puts America first,” Vance told Breitbart News.",
    "These days, it is Trump’s voters, Breitbart News readers, and Carlson viewers that Republicans hope to win over in elections rather than seeking out corporate campaign contributions through endorsements from Heritage Action, FreedomWorks, and the Senate Conservatives Fund.",
    "Patrick Witt, running in Georgia’s 10th congressional district, told Breitbart News that the shift is a “recognition that beltway conservatives hide behind free market ideology while supporting anti-free market practices.” Big Tech, Witt said, is just one example.",
    "“Academic research has found, time and again, that immigration, especially illegal immigration, has a direct, negative impact on the Americans we should be trying to help get ahead — the working class.”\nJohn Binder is a reporter for Breitbart News.",
    "Chuck Grassley (R-IA), Todd Young (R-IN), John Thune (R-SD), and Mike Lee (R-UT), as well as to Reps. Vern Buchanan (R-FL), Ashley Hinson (R-IA), Dan Crenshaw (R-TX), Maria Salazar (R-FL), and Don Bacon (R-NE), among others.",
    "The “modern Republican” Party is scrapping its old-guard corporate ties and business special interests, an Axios report details, as Breitbart News and small-dollar donors to former President Trump steer the party’s future.",
    "Vance, the New York Times best-selling author now running for Senate in Ohio, said the party’s shift comes as beltway conservative orthodoxy has been busted through by the likes of Trump, Breitbart News, and Carlson.",
    "In West Virginia last year, Delegate Riley Keaton led a group of the state’s House delegates in demanding Sen. Joe Manchin (D-WV) oppose immigration provisions included in Biden’s Build Back Better Act.",
    "Ron DeSantis (R), for instance, has laid out an ambitious legislative agenda that includes blacklisting companies from receiving state licenses if they are found to facilitate illegal immigration.",
    "That shift seeks to increasingly align Republican lawmakers and those running for office with the nation’s largest voting bloc: economic populists who are socially conservative.",
    "Most recently, the Chamber urged President Joe Biden and Congress to double legal immigration levels and provide amnesty to the nation’s 11 to 22 million illegal aliens.",
    "Masters’ central issue is advocating for domestic economic policy that ensures working- and middle-class Americans can support their families on a single income.",
    "“If the U.S. Chamber of Commerce calls you and says ‘We want to endorse,’ You’re like, ‘Please don’t,'” a high-profile GOP political consultant told Axios.",
    "He is currently trying to get conservative lawmakers on board with plans to break up giant tech conglomerates with vigorous antitrust enforcement.",
    "Those are monopolies.”\nOn the campaign trail, Witt said Republican primary voters are not interested in endorsements from beltway think tanks.",
    "The shift is not just occurring in Washington, D.C.\nAt the state level, Republican legislators and governors are charting a similar course.",
    "“Amnesty for illegal immigrants redistributes wealth from working class Americans through increased economic competition,” they wrote.",
    "The Republican Party’s connections to the Chamber, while financially still tied, have faded dramatically in recent election years.",
    "Likewise, Rep. Matt Gaetz (R-FL) made headlines in 2020 when he vowed never to take donations from corporate-funded PACs.",
    "The shift, he said, can be seen in endorsements that long-established groups like the Club for Growth have recently made.",
    "In Alabama, the Club for Growth is backing Rep. Mo Brooks (R-AL) — an avid opponent of mass immigration — for Senate.",
    "“… none of the operatives we interviewed considered Koch support to be important in 2022,” the Axios report notes.",
    "“You’re getting policy that is untainted and untouched by these beltway, second-tier groups,” McCarthy said.",
    "“The Republican Party needs a big wake-up call if they think big business is their friend,” Witt said.",
    "The wake-up call is long overdue.”\nIn Congress, Sen. Josh Hawley (R-MO) has embodied the shift.",
    "A new wave of Republicans, though, are fiercely breaking all ties with the old guard.",
    "Last year, the Chamber’s political action committee (PAC) donated thousands to Sens.",
    "Last month, Hawley introduced a bill to ban members of Congress from trading stocks.",
    "Their focus: Mass immigration boosts corporate profits at the expense of Americans.",
    "Voters, he said, want fighters for their economic and social interests.",
    "In Arizona, the organization just endorsed Blake Masters for Senate.",
    "“You don’t want Breitbart on your ass,” a GOP operative told Axios.",
    "Hawley and Sen. Ted Cruz (R-TX) have since followed.",
    "“It is often an enemy of social conservatism.",
    "Email him at jbinder@breitbart.com.",
    "The same goes for the Koch network.",
    "“Those are not free markets.",
    "Follow him on Twitter here.",
    "Florida Gov.",
    "J.D."
  ]
}