{
  "id": 5597,
  "mediaId": 2614,
  "date": "2022-02-13",
  "headline": "Durham Exposed Hillary’s Treason? Trump, Russia Collusion? – ‘Worse Than We Thought’ – Jim Jordan [VIDEO]",
  "image": "https://www.lifezette.com/wp-content/uploads/2020/03/2020.03.02-11.23-lifezette-5e5d9564b646d.png",
  "link": "https://www.lifezette.com/2022/02/durham-exposed-hillarys-treason-trump-russia-collusion-worse-than-we-thought-jim-jordan-video/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Voice Media",
  "authorUrl": "https://www.lifezette.com/author/redvoicemedia/",
  "termIds": [
    1670,
    2201,
    2434,
    3975,
    4609,
    761,
    1259,
    5287
  ],
  "sentences": [
    "He noted, “Yep, there was spying going on, and it was worse than we thought because they were spying on the sitting president of the United States, and it goes right to the Clinton campaign.”\nIn the video above, Jordan added, “That is what is so frightening here.",
    "After the 2020 election results were posted, former President Donald Trump accused the democratic process of being tampered with and manipulated in a way that allowed Joe Biden to become the most voted for president in America’s history.",
    "And while they were once accused, thanks to a filing from the Special Counsel, John Durham stated former Clinton campaign lawyer, Michael Sussmann, paid a technology company to spy on Trump by hacking into the Trump Tower servers.",
    "But what is so interesting is how the Democrats were eager to accept the results in 2020, but in 2016, Democratic candidate Hillary Clinton accused Trump of working with Russia to rig the election.",
    "With the bombshell news that Hillary was purposely trying to spy on then-President Trump, Ohio Representative Jim Jordan spoke on Fox News about the accusations.",
    "You had the government working with the Clinton campaign to go after the Republican Party’s nominee for president, to spy on that campaign.",
    "Although Trump has been de-platformed and censored for his stance, Hillary Clinton remains unscathed by the accusations made against her.",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "Democrats and the Biden administration, with the help from the media, blasted Trump for not accepting the results.",
    "We’ve never seen anything like that in history.”\nThis piece was written by Zach Heilman on February 13, 2022.",
    "According to the report, this was all done to find a connection between Trump and Russia.",
    "This would go a step further when they tapped into the White House as well.",
    "It originally appeared in RedVoiceMedia.com and is used by permission."
  ]
}