{
  "id": 560,
  "mediaId": 6687,
  "date": "2022-04-15",
  "headline": "AL-5 candidate Casey Wardynski: We need a ‘special counsel to get to the bottom of’ Hunter Biden’s emails",
  "image": "https://yellowhammernews.com/wp-content/uploads/2022/04/Casey-Wardynski-1.jpg",
  "link": "https://yellowhammernews.com/al-5-candidate-casey-wardynski-we-need-a-special-counsel-to-get-to-the-bottom-of-hunter-bidens-emails/?utm_source=rss&utm_medium=rss&utm_campaign=al-5-candidate-casey-wardynski-we-need-a-special-counsel-to-get-to-the-bottom-of-hunter-bidens-emails",
  "mediaOutlet": "yellowhammernews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yaffee",
  "authorUrl": "https://yellowhammernews.com/author/Yaffee/",
  "termIds": [
    1670,
    1934,
    2201,
    2583,
    3102,
    878,
    4815
  ],
  "sentences": [
    "“You’ll remember the Ukraine deal that the Vindman brothers were pulling that led to the impeachment of President Trump, not the conviction, but the bogus impeachment proceeding, Hunter Biden was the focus of that.”\nWasdynski then explained how Trump was merely trying to look into the Hunter Biden allegations during his presidency.",
    "Who did you communicate with?’ We can to know because you put this letter out just before the most important election, election of the commander-n-chief, and that letter was used as the basis for the whole conspiracy to keep this information from the American people,” he outlined.",
    "“Well, that didn’t happen, so now the United States can look into it when the Republicans take over and have a special counsel to get to the bottom of it.”\nThe candidate was joined by U.S. Rep. Jim Jordan (R-Ohio) during the interview, who endorsed Wardynski earlier this week.",
    "“Eighteen months ago, we had 51 former intel officials, the so-called experts, that the Hunter laptop wasn’t real, that the eyewitness wasn’t real, that the email weren’t real, that it was a ‘Russian disinformation campaign’ and that was garbage.",
    "Casey Wardynski, Republican candidate for Alabama’s open fifth congressional district seat, on Thursday called for a special counsel to be put in charge of the investigation into Hunter Biden’s finances.",
    "During an interview on WVNN’s “The Yaffee Program,” Wardynski emphasized why Attorney General Merrick Garland should appoint a “special counsel to get to the bottom” of Hunter Biden’s emails.",
    "So yeah, we need to get to the bottom of this”\nJordan then explained some of the answers he’s looking for in regards to some of the misinformation surrounding the investigation.",
    "“[W]e sent letters to each of these 51 former intel officials including six of them who were former heads of the CIA asking, ‘How did you come up with this letter?",
    "The U.S. Attorney’s Office for the District of Delaware is currently investigating Hunter Biden’s business activities with foreign countries.",
    "“President Trump was asking the Ukrainians that if there was nefarious activity that it ought to be looked into,” he argued.",
    "Yaffee is a contributing writer to Yellowhammer News and hosts “The Yaffee Program” Weekdays 9-11am on WVNN.",
    "Jordan agreed with Wardynski on the need for a special counsel.",
    "“This was a major aspect of the election,” he said.",
    "“Think about what happened,” Jordan said.",
    "You can follow him on Twitter @Yaffee",
    "What was the basis of it?"
  ]
}