{
  "id": 5617,
  "mediaId": 2748,
  "date": "2022-02-03",
  "headline": "Exclusive — Rep. Jim Jordan: Joe Biden’s ‘Deliberate’ Support of Illegal Immigration Could Lead to Impeachment",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4EzYbxlwJNBs6ygtyxI_M_Xr2GrNfPHGrtYBtGQYsfo-Az_S2X9NV4L7BokXvm2qd3w8Zy2SJEp0Jrt8SJVACpt2c_D7oMWLNWPmHpLCD8fDtzMViQkdAsGm3yCG2bnAKHrKdYUTGgTe=w1200-h630-p-k-no-nu",
  "link": "https://www.cracknewz.com/2022/02/exclusive-rep-jim-jordan-joe-bidens.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Blarp Blog",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“It is intentional, and the idea that they’re doing it in the dark of the night so that that the country doesn’t fully know and see what’s going on is wrong … This is deliberate, what they’re doing.”\nJordan warned of the Biden administration’s development of and advocacy for a federal database of firearm ownership records.",
    "Rep. Jim Jordan (R-OH) said on Wednesday’s edition of the Breitbart News Daily podcast that President Joe Biden’s “deliberate” and “intentional” facilitation of illegal immigration across the southern border by millions of foreign nationals may lead to impeachment if Republicans win majorities in Congress.",
    "It’s intentional.”\nThe Ohio representative said impeaching the president “is something that our conference is going to have to look at closely and make a decision on, but it’ll be a conference-wide decision” if Republicans secure a majority in the House of Representatives.",
    "That’s a scary thing.”\nJordan said the Journalism Competition and Preservation Act (JCPA), pending legislation in the House and Senate, would facilitate further political coordination between technology and news media companies to marginalize dissident information sources.",
    "He said a “gun registry” is being built with records of “law-abiding Americans who purchase a firearm.”\nHe added, “Those records are now being kept in what has to be — by any definition now — a gun registry that the Biden administration is putting together.",
    "Jordan stated, “The [JCPA] is big tech, big media coming together, colluding so that, I think, they can further stick it to conservative outlets that are getting the truth to the American people, like your network, and that is what scares me.”",
    "Jordan remarked, “When you intentionally allow 1.9 million people in one year’s time to come across your border, there’s no other way you can interpret this other than it’s deliberate.",
    "“It is so big and it is deliberate,” Jordan said of the status quo of illegal immigration across the U.S.-Mexico border.",
    "“The ATF is keeping this registry of hundreds of millions of gun purchases over the last 20-some years,” Jordan stated.",
    "Breitbart News would be among news media outlets undermined by the JCPA, he added."
  ]
}