{
  "id": 5619,
  "mediaId": 2707,
  "date": "2022-02-10",
  "headline": "White House phone records show gaps during Jan 6 violence",
  "image": "https://www.ocregister.com/wp-content/uploads/2022/02/Capitol_Breach_Trump_47496.jpg-81081_1050456481.jpg?w=1024&h=683",
  "link": "https://www.ocregister.com/2022/02/10/white-house-phone-records-show-gaps-during-jan-6-violence/",
  "mediaOutlet": "The Orange County Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cnn Com",
  "authorUrl": "https://www.ocregister.com/author/cnn-com/",
  "termIds": [
    2201,
    2906,
    3267,
    3731,
    3888,
    4109,
    1163
  ],
  "sentences": [
    "When asked about a heated phone conversation House Minority Leader Kevin McCarthy reportedly had with Trump, or another phone conversation with Republican Sen. Mike Lee of Utah that’s been previously reported, one source familiar with the investigation said: “There are a lot of things like that, that I’ll say we’re having to learn from them about them from a lot of different sources to piece all of the data together.”\nIn some cases, the committee has already been able to fill in the gaps.",
    "By Ryan Nobles, Zachary Cohen, Annie Grayer and Jamie Gangel | CNN\nWhite House call records now in possession of congressional investigators do not reflect calls made to or from then-President Donald Trump as the violence unfolded on Capitol Hill on January 6, 2021, leaving them with gaps so far in their understanding of what transpired that day, three sources familiar with the House investigation into the insurrection tell CNN.",
    "Two of the sources, who have also reviewed the presidential diary from that day, say it contains scant information and no record of phone calls for several hours after Trump returned to the Oval Office after giving a speech to his supporters at the Ellipse until he emerged to address the nation in a video from the Rose Garden.",
    "As CNN reported last week, they show that Trump spoke on the phone at the White House residence with key Hill ally GOP Rep. Jim Jordan of Ohio for 10 minutes on the morning of the January 6 — before Jordan took to the House floor to object to the certification of President Joe Biden’s Electoral College win.",
    "Chris Christie, the former New Jersey governor and once a Trump ally, previously told CNN about multiple efforts to get through to the then-President during the riot, through the White House switchboard, his assistant, body man and personal cell phone — without any luck.",
    "“We know that President Trump had a highly unorthodox style of communication using his own personal cell phones but even in the normally weird practices of the Trump White House, this gap raises some serious questions,” CNN legal analyst Norm Eisen said.",
    "Sources familiar with the investigation say they haven’t drawn any final conclusions, suggesting the gaps in the records may be explained by the use of personal cell phones, or because Trump was simply not making or receiving many calls during the riot.",
    "“The gaps in in the call logs and the ancillary records raises a set of very serious concerns, including the question whether there was an intentional effort to circumvent the usual system, and if so, who directed it and for what purpose,” Eisen said.",
    "“Whether it is the absence of data or phone logs or willing testimony, inevitably, we have different sources to get that information because these are conversations that require more than one participant,” committee member Rep. Stephanie Murphy said.",
    "Thompson, a Mississippi Democrat, has said that their efforts to obtain information from a wide variety of sources is a key to getting to the bottom of what happened even as some witnesses refuse to cooperate or fight them in court.",
    "The investigative techniques the committee is using in spite of Trump administration’s lack of careful record-keeping, is similar to a process House investigators used during their impeachment probe of Trump shortly after the riot.",
    "But the committee has learned the pair did talk that morning from interviewing Pence’s then-national security adviser Keith Kellogg, according to a letter sent to Ivanka Trump by the committee requesting her voluntary cooperation.",
    "As the situation quickly deteriorated on Capitol Hill, Ivanka Trump told her father at least twice that he needed to intervene as he watched cable news coverage of the attack, according to testimony obtained by the committee.",
    "The panel has already obtained records of phone numbers associated with one of the former President’s sons, Eric Trump, as well as Kimberly Guilfoyle, who is engaged to Donald Trump Jr., CNN reported last month.",
    "“So even if there is one node that isn’t forthcoming, there are inevitably other points of information that we can use to build a more fulsome picture of what happened on January 6,” the Florida Democrat said.",
    "The panel also obtained Meadows’ text messages, showing that Fox News personalities, GOP officials and prominent Republicans desperately tried to reach Trump to tell him to publicly call off the mob.",
    "The committee has not requested Trump’s personal phone records, according to the committee’s chairman, Rep. Bennie Thompson, who noted the panel could always revisit that possibility.",
    "Scavino has been subpoenaed by the select committee, and he’s also among several Trump loyalists who have sued to prevent the committee from obtaining his personal cell phone records.",
    "Thompson also acknowledged that the use of private cell phones was common in the Trump White House, including by senior officials like Trump’s former chief of staff Mark Meadows.",
    "The revelation in the request, underscoring the importance of hundreds of depositions already conducted and potentially reams of phone records that the committee has subpoenaed.",
    "“If this person sent a message to Meadows, then we will debate the policy question of maybe we need to get the phone records of that person and compare the two,” Thompson said.",
    "The records the House select committee has obtained do not contain entries of phone calls between the President and lawmakers that have been widely reported in the press.",
    "Former White House deputy chief of staff Dan Scavino was among those whose cell phone would be commandeered by the President to make calls, sources tell CNN.",
    "Sources who reviewed the records say there is an entry showing Trump trying to get former Vice President Mike Pence on the phone before the Capitol siege.",
    "The committee had asked the National Archives for all call logs and telephone records for Trump and top aides as well as daily presidential diaries.",
    "The House select committee has received hundreds of White House records since Trump lost a legal fight at the Supreme Court to keep them secret.",
    "Compiled with information provided by White House staffers for the Archives, they are meant to chronicle the President’s activities.",
    "Meadows has refused to cooperate and been referred to the Justice Department for possible criminal contempt of Congress charges.",
    "Jordan as well as McCarthy have so far declined an invitation to voluntarily cooperate with the investigation.",
    "Scavino initially attempted to file the suit anonymously, but the judge in the case required him to go public.",
    "One former Trump White House staffer said calls on personal cell phones were rarely tracked or recorded.",
    "Pence didn’t answer the call, and the committee does not have a record of Pence returning Trump’s call.",
    "The committee has asked Ivanka Trump to come in for an interview, and she has not responded publicly.",
    "Sources also tell CNN that Trump had a habit of asking aides to call certain people on his behalf.",
    "There is also the possibility the Archives will find more records that can explain the gaps.",
    "Trump was known to make calls using personal cell phones, which could account for those.",
    "A spokesperson and an attorney for Trump did not respond to requests for comment.",
    "That same staffer said Trump routinely used his personal cell phone, too.",
    "The committee has subpoenaed the phone records of more than 100 people.",
    "He also sued to keep his phone records out of the committee’s hands.",
    "Diaries from past administrations have been rife with information.",
    "The official White House call logs do provide some information.",
    "An attorney for Scavino declined to comment."
  ]
}