{
  "id": 5646,
  "mediaId": 2621,
  "date": "2022-02-06",
  "headline": "Mark Levin Claims Democrats Are ‘Better at Being Scoundrels’ Than GOP at Gerrymandering: ‘Republicans Better Wake the Hell Up’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/02/Screen-Shot-2022-02-06-at-9.27.52-PM.png",
  "link": "https://www.mediaite.com/tv/mark-levin-claims-democrats-are-better-at-being-scoundrels-than-gop-at-gerrymandering-republicans-better-wake-the-hell-up/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Huggins",
  "authorUrl": "https://www.mediaite.com/author/katherine-huggins/",
  "termIds": [
    1670,
    2599,
    3346,
    3975,
    305,
    878,
    4887
  ],
  "sentences": [
    "So we’ve got to do the work, we’ve got to go talk to the American people, we’ve got to tell them how bad the Biden administration is…”\nLevin then added that beyond just gerrymandering, “Democrats are better at the structural stuff: going into the courts, changing our election laws, getting all kinds of dark money — far more than the Republicans do — to fund their operations, basically taking public election offices with Zuckerberg’s money.”\nLevin claimed that Republicans should employ the tactics he described the Democrats as using.",
    "“It’s only gerrymandering when Republicans control the state legislature and draw the districts, but when Democrats do it in like New York, Maryland, California for goodness sake — there’s a lot of Republicans in California but you look at the general assembly in California it’s dominated, dominated by Democrats — but no, no we never hear about that,” Jordan said.",
    "That’s not supposed to happen in America, how did that happen?”\nJordan continued to move away from the issue of gerrymandering and rambled about investigating DOJ’s position on investigating parent threats to school boards, the lab leak theory, and illegal border crossings.",
    "Levin soon added that “unless and until the Republicans do to Joe Biden and to Nancy Pelosi and to the others what was done to President [Donald] Trump and you folks…this is going to get worse not better.”\nJordan then chimed in, changing the topic.",
    "“In other words, the Democrats are better at being scoundrels than Republicans and Republicans better wake the hell up.”\nRep. Jim Jordan (R-OH) then said Democrats are frequently hypocritical when it comes to the issue of gerrymandering.",
    "“If the Republicans and Republican leadership don’t do to the Democrats what the Democrats did to the Republicans, and the Donald Trump and the conservatives this will not stop,” he said.",
    "He went on to echo Levin’s comments about not getting too cocky, saying: “My background’s the sport of wrestling; we always say never be over-confident just be confident.",
    "These things are going on in New Mexico, they’re going on in California.”\n“I feel that Democrats are better at this sort of thing than the Republicans,” Levin added.",
    "Subscribe to\nFox News’ Mark Levin on Sunday asserted that Democrats are better than Republicans at gerrymandering districts and changing rules to be in their favor.",
    "“I get a little nervous when conservatives and Republicans get cocky,” Levin said, noting the recent wins in Virginia could be attributed to the GOP base rising up.",
    "“Think about this, the ways and means committee needs to figure out how in the world did thousands of Americans’ tax returns get public.",
    "You see what’s going on in New York, they’re trying to wipe out half at least of the Republican congressmen there,” Levin said.",
    "“We have to do the investigations, get the truth out to the American people,” Jordan said.",
    "“And in Maryland, they’re trying to wipe out the one Republican congressman they have.",
    "Watch above, via Fox News\nHave a tip we should know?",
    "“But there’s also a lot of gerrymandering going on.",
    "Want to avoid video ads?",
    "tips@mediaite.com"
  ]
}