{
  "id": 5658,
  "mediaId": 2569,
  "date": "2022-02-11",
  "headline": "Lincoln Project ad goes for gold, skewers Republicans in ‘Coward Olympics’",
  "image": "https://floridapolitics.com/wp-content/uploads/2022/02/coward.jpg",
  "link": "https://floridapolitics.com/archives/495938-lincoln-project-ad-goes-for-gold-skewers-republicans-in-coward-olympics/",
  "mediaOutlet": "floridapolitics.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    2287,
    2298,
    3267,
    3975,
    4087,
    878,
    5390
  ],
  "sentences": [
    "The Lincoln Project celebrates The Olympic Winter Games with a new ad skewering congressional Republicans for participating in Washington’s 2022 “Coward Olympics.”\nIt’s the latest tongue-in-cheek campaign to attack Republicans who continue to promote falsehoods about the Jan. 6 Capitol riots, stand up for Donald Trump’s “big lie” that the 2020 General Election was stolen, and falsely claim that Joe Biden is an illegitimate President.",
    "“Some ads are more fun to make than others, and our team had a really good time showing what a eunuch Kevin McCarthy actually is.”\n“Coward Olympics” comes as the Republican National Committee (RNC) voted this week to censure GOP Reps. Liz Cheney and Adam Kinzinger for sitting on the House Select Committee formed to investigate the Jan. 6, 2020, riot at the U.S. Capitol.",
    "One part shows “muli-medalist D.C. veteran” McCarthy dodging questions in a Capitol hallway while the voice-over describes the move as “showing perfect form” in an Olympic-style “1,000-meter downhill moral collapse.”\n“Kevin McCarthy is a colossal tool bag with the political prowess of a slug,” said Rick Wilson, co-founder of The Lincoln Project.",
    "Lincoln Project, the anti-Trump group made up of mostly traditionally conservative Republicans, is best-known for flooding television and the internet with snarky, sarcastic ads targeting Trump and other Republican candidates supporting the former President.",
    "It will continue all weekend on broadcast TV, during the Sunday political shows, Fox News, and local stations covering Mar-a-Lago in Palm Beach — Trump’s home base — and Bakersfield, California, all day Sunday.",
    "Senate Minority Leader Mitch McConnell has denounced the censure, saying, “that’s not the job of the RNC.”\nThe ad starts running digitally at RNC Headquarters and the Capitol Complex in Washington.",
    "Explicitly named in the minute-long spot are House Minority Leader Kevin McCarthy, Rep. Jim Jordan of Ohio, and Rep. Marjorie Taylor Greene of Georgia.",
    "To watch “Coward Olympics,” click on the image below:"
  ]
}