{
  "id": 5764,
  "mediaId": 2643,
  "date": "2022-02-09",
  "headline": "White House Says Crack Pipes Never Included in Safe Smoking Kits",
  "image": "",
  "link": "https://www.newsweek.com/white-house-says-crack-pipes-never-included-safe-smoking-kits-1677757",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexandra Hutzler",
  "authorUrl": "https://www.newsweek.com/authors/alexandra-hutzler",
  "termIds": [
    1670,
    2277,
    2720,
    4624,
    4768,
    1067
  ],
  "sentences": [
    "HHS Secretary Xavier Becerra and Rahul Gupta, director of the Office of National Drug Control Policy, said in a separate statement Wednesday that \"no federal funding will be used directly or through subsequent reimbursement of grantees to put pipes in safe smoking kits.\"",
    "\"Americans deserve health services that address the full range of drug use and addiction issues, and this funding will help provide those services in the neighborhoods in which they live,\" Becerra said in a statement while announcing the grant program.",
    "Recipients of the grants must use them to support harm reduction services and materials such as overdose prevention kits, safe sex kits, safe smoking kits, medication lockboxes, prevention education about synthetic opioids and medical services.",
    "Press secretary Jen Psaki told reporters Wednesday that the pipes were never included in the kits, which are part of a $30 million grant program to support community-based overdose prevention programs and other harm reduction services.",
    "Republicans like Representative Jim Jordan, Senator Marsha Blackburn and Florida congressional candidate Lavern Spicer reacted on social media to the story, with Blackburn tweeting, \"End government-funded crack pipes.\"",
    "But HHS told Fox News that the Beacon's report was \"blatant misinformation\" and that the kit recipients \"must adhere to relevant federal, state, and local laws or regulations,\" as with all grant programs.",
    "The story reported that an unidentified Health and Human Services Department (HHS) spokesperson said the kits included pipes for users of cocaine, crystal methamphetamine and \"any illicit substance.\"",
    "\"The priority populations for this program are underserved communities that are greatly impacted by [substance use disorders],\" according to a 75-page description of the project.",
    "Psaki told reporters that the kits may contain alcohol swabs, lip balm and other materials to promote hygiene and reduce the transmission of HIV and diseases like hepatitis.",
    "President Joe Biden called the 100,000 overdose deaths a \"tragic milestone\" and vowed to do \"everything in our power to address addiction.\"",
    "The White House is firing back against \"false\" reports that crack pipes will be included in safe smoking kits funded by the administration.",
    "The White House's clarification comes after a conservative backlash against the program following a Washington Free Beacon article.",
    "State, local and tribal governments, as well as tribal organizations and community-based organizations, can apply for funding.",
    "She added that the misinformation has \"really clouded over what is a hugely important issue in this country.\"",
    "The kits, she said, were part of steps the Biden administration is taking to combat the opioid crisis.",
    "\"It was inaccurate reporting, and we wanted to put out information to make that clear,\" she said.",
    "The grant program will distribute $30 million to eligible communities over the next three years.",
    "For the first time in 2021, drug overdose deaths exceeded 100,000 over a 12-month period.",
    "Applications were due by February 7, and the agency predicts 25 grants will be awarded.",
    "The number of overdose deaths increased almost 30 percent from the year before.",
    "?was opioids, including the powerful drug fentanyl.",
    "A big driver of these deaths ?"
  ]
}