{
  "id": 5779,
  "mediaId": 2528,
  "date": "2022-02-05",
  "headline": "Donald Trump and Rep. Jim Jordan spoke for 10 minutes on the morning of the Capitol insurrection, records obtained by the Jan. 6 committee show: CNN",
  "image": "https://i.insider.com/61fe6821fa4f1f0018262c67?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/trump-jim-jordan-spoke-10-minutes-jan-6-morning-cnn-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alia Shoaib",
  "authorUrl": "https://www.businessinsider.com/author/alia-shoaib",
  "termIds": [
    0
  ],
  "sentences": [
    "The select committee previously wrote to Jordan to ask to discuss his communications with Trump \"in detail,\" as well as any communications he had with individuals at the Willard Hotel in Washington, DC, and Trump's legal team.",
    "Jordan, an ardent supporter of Trump, has accused the committee of being \"partisan\" and said he has \"no confidence that the Select Committee will fairly or accurately represent\" any information he gives them.",
    "Records obtained by the House select committee investigating the Capitol riot show that former President Donald Trump spoke to Rep. Jim Jordan for 10 minutes on the morning of the insurrection, CNN reported.",
    "The afternoon of January 6, Republican congressman Jordan took to the House floor to object to the certification of President Joe Biden's Electoral College win, and Trump supporters stormed the Capitol.",
    "Jacquelyn Martin - Pool/Getty Images (L), Erin Schaff/Getty Images (R)\nThe Jan. 6 committee obtained records of Trump and Jim Jordan speaking on the morning of the insurrection, CNN said.",
    "The call logs are among documents turned over by the National Archives to the House committee after the US Supreme Court rejected Trump's bid to block their release last month.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "A spokesman for Rep. Jordan told Insider, \"Mr. Jordan has always maintained that he doesn't remember when he spoke to the President that day (as he told CNN yesterday).\"",
    "However, two sources who viewed the call records told CNN that Trump called Jordan that morning from the White House and that the two spoke for 10 minutes.",
    "The January 6 committee has been trying to obtain the records to gain a fuller picture of the president's communications on the day of the riot.",
    "The new details about the call come as the committee considers whether to issue a subpoena for Jordan after he refused to appear voluntarily.",
    "In October, he told a House Rules Committee hearing that he only remembered speaking to Trump after the attack, not before or during.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Jordan told CNN on Friday that he spoke with Trump \"multiple times\" on January 6 but did not recall the timings.",
    "The committee has been considering whether to subpoena Jordan after he refused to voluntarily cooperate.",
    "Jordan has previously claimed that he only spoke to Trump on January 6 after the attack, not before.",
    "Jordan has previously been evasive about his communications with Trump on the day.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Ohio Rep. Jim Jordan (L), former President Donald Trump (R).",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}