{
  "id": 5793,
  "mediaId": 2664,
  "date": "2022-02-06",
  "headline": "Jan. 6 committee has acquired 'voluminous' documents from Trump White House: Congresswoman",
  "image": "https://www.rawstory.com/media-library/mike-pence-is-trying-to-distance-himself-from-trumps-ukraine-scandal.jpg?id=24834724&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/trump-documents-obtained-congress/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    2187,
    2201,
    2817,
    2906,
    4417,
    878
  ],
  "sentences": [
    "We, as you know, invited our colleague from Ohio [Jim Jordan] to come in and talk to us, and I think as information continues to come forward through other sources, he may feel a need to come forward and tell his side of the story.\"",
    "She also responded to recent comments by Rep. Matt Gaetz (R-FL), who admitted that the Republicans were looking for ways that state legislatures could swoop in and declare former President Donald Trump the winner.",
    "Lofgren began by explaining that the committee isn't sure whether or not they'd need testimony from former Vice President Mike Pence since they have his aides and documents.",
    "Acosta asked if she would like to have Gaetz testify before the committee, but she explained that Gaetz seems to have confessed all that was necessary publicly already.",
    "Rep. Zoe Lofgren (D-CA) told CNN host Jim Acosta that the Jan. 6 committee that the documents they've obtained from the Trump administration are \"voluminous.\"",
    "\"Most Americans may not realize that every call made from the White House is logged, who was called, how long did it take.",
    "Every single person who goes into the Oval Office and out is noted how long did they stay, who were they?",
    "\"Let me just say the call records that we got from the National Archives are voluminous,\" said Lofgren.",
    "You know, not in the private residences but in the West Wing, the official section.",
    "See the interview below:\nCongress has the dirt -- all of it\nStories Chosen For You",
    "I mean, it's a complete record of everything about the president's activities.",
    "\"Certainly, what could he add to what he's already just said in public?\"",
    "There are a lot of questions, and we hope to get to the bottom of them.",
    "The only way to do that is for Pence to declare the election undecided.",
    "\"I can't think of anything more damning than that.\"",
    "So, there's a lot of information.",
    "she asked."
  ]
}