{
  "id": 5834,
  "mediaId": 2540,
  "date": "2022-02-07",
  "headline": "5 things to know for Feb. 7: Covid, Capitol riot, Electoral count, Jubilee, Joe Rogan",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220207043705-canada-protest-police-02052022-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/07/us/five-things-february-7-trnd/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexandra Meeks",
  "authorUrl": "",
  "termIds": [
    2819,
    2896,
    3428,
    4040,
    234,
    5129,
    5366
  ],
  "sentences": [
    "The key is making sure key Democrats feel like their issues are represented, like Sen. Tom Carper, who has concerns over lack of funding for water projects, while appeasing as many Republicans as possible – who are generally grumbling over the cost.",
    "– JewBelong, a non-profit organization created to welcome and inspire Jewish people, put up four billboards with striking messages throughout South Florida last week to raise awareness about anti-Semitism and make people think about its effects.",
    "The US Attorney’s Office of Massachusetts has filed a request to have that stimulus payment and other funds in Tsarnaev’s inmate trust account turned over to his victims while he serves a life sentence in Colorado.",
    "The bipartisan effort is one part of a two-track strategy to advance the White House’s sweeping economic agenda, as Democrats lay the groundwork to advance a $3.5 trillion package expanding the social safety net.",
    "After a federal judge struck down the mask mandate on Monday, the Justice Department filed an appeal to bring mask requirements back inside airplanes and other public transportation methods.",
    "After an exhaustive search, the Nevada Gaming Control Board identified the winner by combing through hours of surveillance videos, interviewing witnesses and analyzing ride share data.",
    "However, journalists on the ground have documented the hasty burial of civilians in the city, and images have surfaced on social media showing bodies apparently left for collection.",
    "Biden thoroughly denounced participants in the riot and made the rare move of denouncing former President Donald Trump as a threat to democracy – without naming him outright.",
    "If you saw a shooting star last night, it might have been from the Lyrid meteor shower – a collection of bright and fast meteors that reached its peak overnight.",
    "Ukraine\nUkrainian officials say they have identified mass graves outside the city of Mariupol, which they say adds to mounting proof of Russian war crimes.",
    "New satellite images appear to show more than 200 new graves at a site on the northwestern edge of Manhush, a town about 12 miles to the west of Mariupol.",
    "Four people were killed and hundreds of others were injured after Tsarnaev and his brother set off two bombs near the Boston Marathon finish line in 2013.",
    "But with the mandate no longer in effect, at least temporarily, many US airlines have already dropped their mask requirements for the foreseeable future.",
    "This comes as an estimated 100,000 people remain trapped in Mariupol, which has been under siege since it was surrounded by Russian forces on March 1.",
    "Why it feels like movies are getting longer\nAt least warm popcorn can help distract you from the pain of sitting in theater seats for nearly 3 hours.",
    "Disney\nA group of senators held a flurry of meetings over the weekend in hopes of getting a viable bipartisan infrastructure bill done today.",
    "CNN —\nIf your day doesn’t start until you’re up to speed on the latest headlines, then let us introduce you to your new favorite morning fix.",
    "Delta Air Lines, United Airlines and American Airlines said they will allow passengers back on their flight rosters on a case-by-case basis.",
    "Coronavirus\nThree major US airlines announced yesterday they will let some passengers banned for mask violations back on their flights.",
    "Bengals’ viral sensation ‘The Cart’ is heading to the Super Bowl\nBengals fans have a quirky affection for this three-tiered metal cart.",
    "That’s how much a tourist in Las Vegas won at a slot machine last month, but was never informed due to a malfunction in the machine.",
    "Nominees announced for SAG Awards\nThat’s the amount Boston Marathon bomber Dzhokhar Tsarnaev received in a federal stimulus payment.",
    "Billie Eilish paused her concert to help a fan get an inhaler\nCheck out how the popular singer handled the situation so gracefully.",
    "TODAY’S WEATHER\nAND FINALLY\nYou’ve made it to the finish line of the week, which is not unlike this thrilling little corgi race.",
    "The decision was sparked by rulings and countermoves this week on the federal mask mandate for public transportation.",
    "President Joe Biden, in a fiery speech yesterday commemorating the anniversary of the January 6 insurrection.",
    "CNN+\nKylie Jenner and Travis Scott welcome their second child\nAre you still keeping up with the Kardashians?",
    "CNN cannot independently verify claims Russians have disposed of bodies in mass graves at that location.",
    "You may have an opportunity to catch an even better glimpse of the meteor shower later this evening!",
    "(Click here to view)\nEnjoy this stunning time-lapse footage our planet earth as seen from space.",
    "Gaming officials said the lucky winner will return to Vegas to collect his overdue prize.",
    "Kelly Slater wins surfing competition days shy of his 50th birthday\nAge is just a number!",
    "The elite competitor scored another career victory, beating out guys half his age.",
    "(You can get “5 Things You Need to Know Today” delivered to your inbox daily.",
    "For those who missed the exciting moment, we have good news!",
    "Fans are celebrating the new celebrity baby born on 2/2/22!",
    "We’re sending you air-hugs for this, Billie.",
    "Sign up here for the ‘5 Things’ newsletter.",
    "It even has a dramatic hype video!",
    "(Click here to view)",
    "Immigration\n3.",
    "Sign up here.)",
    "1.",
    "2.",
    "4.",
    "5."
  ]
}