{
  "id": 5851,
  "mediaId": 4032,
  "date": "2022-02-10",
  "headline": "Probe Into China Virus Lab Leak Expands. House GOPers Demand Answers From Top Scientists",
  "image": "https://thenewamerican.com/assets/sites/2/covid_omicron.jpg",
  "link": "https://thenewamerican.com/probe-into-china-virus-lab-leak-expands-house-gopers-demand-answers-from-top-scientists/",
  "mediaOutlet": "New American",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Veronika Kyrylenko",
  "authorUrl": "https://thenewamerican.com/contributor/veronika-kyrylenko/",
  "termIds": [
    1670,
    2576,
    3269,
    3797,
    4154,
    4473,
    1212,
    5240
  ],
  "sentences": [
    "https://t.co/0vSmU1ehzy\n— Rep. James Comer (@RepJamesComer) February 3, 2022\nThe Letter\n“Documents in the custody of the National Institutes of Health (NIH) reveal how a group of scientists — including you — initially believed COVID-19 to be man-made before reversing course and claiming otherwise following discussions with senior government health officials,” the congressmen wrote:\nThis sequence of events suggests a possible coordinated effort to conceal evidence pointing to a lab leak in Wuhan, China, and make your cooperation vital to our investigation.",
    "“Before, during, and after the call, some scientists expressed grave concerns that COVID-19 may have leaked out of the Wuhan Institute of Virology and that COVID-19 may have been partially engineered,” the congressmen wrote:\nOn January 31, 2020, Dr. Kristian Andersen wrote in an email to Dr. Fauci and others: “The unusual features of the virus make up a really small part of the genome (<0.1%) so one has to look really closely at all the sequences to see that some of the features (potentially) look engineered….",
    "Top oversight Republicans call on 7 scientists to testify on COVID origins, Wuhan lab leak https://t.co/5a9tFEaK5J\n— Fox News (@FoxNews) February 3, 2022\nYet frighteningly, led by Collins and Fauci, the group crushed that idea in the piece for Nature Medicine, “The Proximal Origin of SARS-CoV-2.”\nIt was “written by February 4, 2020, less than 48 hours after each of the authors privately expressed concern on the teleconference that COVID-19 originated in a lab,” the congressmen explained.",
    "Eddie [Holmes], Bob [Garry], Mike [Farzan], and myself all find the genome inconsistent with expectations from evolutionary theory.”\nOn February 2, 2020, Dr. Robert Garry similarly wrote, “I really can’t think of a plausible natural scenario.… I just can’t figure out how this gets accomplished in nature.… Of course, in the lab it would be easy.”\nOther scientists also favored the lab leak hypothesis.",
    "In a letter to Jeremy Farrar of Britain’s Wellcome Trust and six others, Representatives James Comer of Kentucky, Steve Scalise of Louisiana and Jim Jordan of Ohio asked for details about a teleconference in February 2020 that included Farrar, Francis Collins of the National Institutes of Health, and Anthony Fauci, head of the National Institute of Allergy and Infectious Diseases, an NIH subsidiary.",
    "NIH funded the construction of viruses that “combined [a] spike gene of one SARS-related coronavirus with rest of genetic information of another, and that yielded viruses that exhibited 10,000-fold higher viral load and higher pathogenicity in humanized mice,” he wrote:\nThe NIH — specifically, Collins, Fauci, and Tabak — lied to Congress, lied to the press, and lied to the public.",
    "“Alarmingly, it appears that the decision to suppress the lab-leak hypothesis was rooted in political calculations rather than scientific principles,” congressmen continued:\nNIH documents show that scientists on the February 1, 2020, teleconference pushed the natural evolution theory because they believed the lab-leak hypothesis could direct too much scrutiny toward China.",
    "For example, in one email, Dr. Collins claimed a lab-leak hypothesis would do “great potential harm to science and international Harmony.” Similarly, Dr. Ron Fouchier claimed a lab-leak hypothesis would do “unnecessary harm to science in general and science in China in particular.” In fact, Dr. Garry later stated the consensus on the teleconference was “1.",
    "Letters were sent to:\nKristian Andersen\nJeremy Farrar\nMichael Farzan\nRobert Garry\nEdward Holmes\nW. Ian Lipkin\nAndrew Rambaut\n— Richard H. Ebright (@R_H_Ebright) February 3, 2022\nGain-of-Function Lie\nYet squelching discussion about the lab leak wasn’t the only role Fauci and Collins played to keep the public in the dark about the virus’ origin.",
    "Republicans on the House Committee on Oversight and Reform have expanded their probe into the conspiracy to squelch the truth about the origin of the China Virus to include top scientists who expressed grave concerns that the pathogen leaked from the Wuhan Institute of Virology in China.",
    "The NIH funded the construction of novel chimeric coronaviruses that combined spike gene of one SARS-related coronavirus with rest of genetic information of another, and that yielded viruses that exhibited 10,000-fold higher viral load and higher pathogenicity in humanized mice.",
    "Documents also show that Fauci, Collins, and Collins’ subaltern, Lawrence Tabak, repeatedly lied about U.S. taxpayer subsidies to WIV that funded the dangerous genetic experiments that might have created the souped-up virus, which in turn escaped the lab.",
    "After that, Fauci, Collins, and others falsely said the lab-leak theory was a debunked “conspiracy theory.”\nDr. Fauci loves to talk about following the science.",
    "That course reversal occurred in the Nature Medicine article despite the concerns expressed about a lab leak during the teleconference of February 1, 2020.",
    "— Richard H. Ebright (@R_H_Ebright) October 21, 2021\nThe NIH received the relevant documents in 2018 and reviewed the documents in 2020 and again in 2021.",
    "Yet later, Farrar, Fauci, Collins and others in the group collaborated on a major journal article that said the virus sprung from nature.",
    "— Richard H. Ebright (@R_H_Ebright) October 20, 2021\nTabak, at least, admitted the truth in a letter to Comer in October.",
    "Richard Ebright, head of the Waksman Institute of Microbiology at Rutgers University, has been unequivocal on that point.",
    "The NIH–specifically, Collins, Fauci, and Tabak–lied to Congress, lied to the press, and lied to the public.",
    "If you do write it[,] don’t mention a lab origin as that will just add fuel to the conspiracists.",
    "And he also wanted to know if Fauci thought “more” could be done to “settle” the matter.",
    "E-mails show that Collins thought the piece should “put down” the lab-leak hypothesis.",
    "During that teleconference, the scientists said the virus probably leaked from WIV.",
    "Subsequent e-mails among members in the group also showed those concerns.",
    "The congressmen want the scientists to answer questions under oath.",
    "So why did he muzzle scientists who believed COVID-19 was manmade?",
    "Top scientists joined the teleconference.",
    "Don’t try to write a paper at all … or 2.",
    "Knowingly.",
    "Willfully.",
    "Knowingly.",
    "Willfully.",
    "Brazenly.",
    "Brazenly."
  ]
}