{
  "id": 5870,
  "mediaId": 2699,
  "date": "2022-02-10",
  "headline": "How the White House Caved to Fox News’ Biden ‘Crack Pipe’ Faux-Scandal",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1080,w_1920,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1644520151/tucker-carlson-tonight_-_2022-02-10T130849.840_xk5tmc",
  "link": "https://www.thedailybeast.com/white-house-caves-to-fox-news-obsession-over-biden-crack-pipe-faux-scandal?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Justin Baragona",
  "authorUrl": "https://www.thedailybeast.com/author/justin-baragona",
  "termIds": [
    1328,
    3975,
    404,
    453,
    989,
    1067
  ],
  "sentences": [
    "Furthermore, while noting that the “safe smoking kits” could include supplies for smoking crack cocaine, the Free Beacon’s report also tied the grant program to the administration’s commitment to prioritize marginalized groups and communities, claiming this was all part of President Joe Biden’s plan on “advancing racial equity.” In fact, the Beacon’s headline blared: “Biden Admin To Fund Crack Pipe Distribution To Advance ‘Racial Equity.’”\nAlthough the piece implied throughout that glass pipes were definitely included in the kits, the article noted that an HHS spokesperson declined to specify what was included and that similar efforts, as noted by Harm Reduction International, generally provide rubber mouthpieces, disinfectant wipes, and filters.",
    "“Joe Biden’s latest idea is to pay Black people to smoke more crack.”\nHe added: “Going forward, the administration will send at least $30 million in tax money to nonprofits and local governments so they can purchase ‘safe smoking kits and supplies.’ According to HHS, these kits will contain Joe Biden-approved pipes that will allow beneficiaries of the equity agenda to smoke crack cocaine as well as crystal meth.",
    "The grant itself would provide funds over a three-year period to overdose prevention programs and nonprofits allowing for safer drug use, as well as for “equipment and supplies to enhance harm reduction efforts.” And the smoking kit component is just one of 20 items set out in the Notice of Funding Opportunity for the 2022 Harm Reduction Program Grant.",
    "“The goal of harm reduction is to save lives.”\nHowever, as the Washington Post’s resident fact-checker Glenn Kessler noted on Wednesday, the HHS/ONCDP statement suggested that the administration—in the face of growing GOP pressure and backlash—had made at least some kind of material change in how the funding would be allocated.",
    "Following a Fox News-fueled outrage over misinformation that the president was handing out free crack pipes in the name of “racial equity,” the Biden administration seemingly caved to GOP pressure this week by reassuring the public that a grant program to reduce harm among illicit drug users wouldn’t include funding for pipes.",
    "Very controversial!”\nFrom there, the channel’s flagship morning show—Fox & Friends—ran segments tying the grant program to “affirmative action” while once again claiming the White House had “allocated $30 million to distribute crack pipes.”\nNaturally, the outrage and righteous indignation only grew over the next 36 hours.",
    "Cotton, who has relentlessly tweeted about the “free crack pipes” dozens of times, complained that while “Biden's HHS is no longer funding crack pipes” it is still “proudly using your tax dollars to fund heroin syringes for drug addicts.”\nAnd Fox News hasn’t stopped making the narrative a central part of its programming.",
    "They put their tail between their legs and back pedal.”\nKeith Humphreys, an addiction researcher at Stanford University School of Medicine, also told the Washington Post that this investment in harm reduction is a minuscule part of federal spending and the “massive cultural war blowup” it’s caused is ridiculous.",
    "“We are learning HHS... is considering spending $30 million on crack pipes, handing out crack pipes to drug addicts, the goal is to make smoking crack safer and also, advance racial equity,” Fox & Friends First co-host Carley Shimkus cried out on Tuesday morning, kicking off the network’s relentless narrative.",
    "(As The Daily Beast reported on Thursday, despite the Free Beacon’s claim that an agency spokesman said “these kits will provide pipes for users to smoke crack cocaine,” an HHS spokesperson provided emails that reveal that neither the agency nor the reporter ever said anything about pipes in their exchanges.)",
    "“The safe smoking kit may contain alcohol swabs, lip balm, other materials to promote hygiene and reduce the transmission of diseases like HIV and hepatitis.”\nHHS Secretary Xavier Becerra and Office of National Drug Control Policy Director Rahul Gupta also denied any funds would be spent on glass pipes.",
    "The use of the word ‘Accordingly’ suggests a change in policy without directly saying so.”\nAdvocates of harm reduction, moreover, expressed concern that conservatives’ ginned-up controversy—and the White House’s response to it—would hamper efforts by community groups and non-profits to help drug users.",
    "With the “free Biden crack pipe” narrative remaining the dominant story on Fox into Wednesday morning—and the GOP rallying their messaging around it—both HHS and the White House attempted to stamp out the firestorm by categorically declaring that the grant’s funding will not go towards any pipes.",
    "“Trying to score cheap political points at the expense of people who use drugs - and especially doing so by leaning into racist stereotypes used to prop up the War on Drugs - is callous amidst an ongoing overdose crisis that has cost the lives of hundreds of thousands of people,” McNeil added.",
    "Some say it is about time.” (Of course, there was never any evidence the government was going to “pay Black people to smoke more crack,” but Fox News lawayers have already successfully argued in court that you should not literally believe the facts Carlson says on-air.)",
    "It didn’t take long for Republican politicians and Fox News to seize on the article and strike up a full-blown moral outrage—much of it complete with barely veiled racial overtones—over Biden supposedly spending $30 million to distribute free crack pipes across America.",
    "“The Biden administration has taken 30 million dollars from their emergency COVID bill, and they're using it to facilitate the smoking of crack cocaine and crystal meth,” Sen. John Kennedy said on Thursday’s broadcast of The Faulkner Focus.",
    "“A program making sure racial minorities and LGBTQ folks are first in line for help when it comes to getting high.”\nFox News star Tucker Carlson took it several steps further that evening, stretching the truth further beyond its limits.",
    "Of course, even though the administration essentially kowtowed to the latest right-wing rage cycle, it still hasn’t stopped Fox News and Republicans from trying to further capitalize on the latest brawl in the never-ending culture war.",
    "Yet even after the White House said on Wednesday afternoon that it was “inaccurate” to claim the administration was distributing crack pipes, Fox News continued to obsessively cover the faux-scandal throughout its programming.",
    "While spotlighting a $30-million federal grant program overseen by the Substance Abuse and Mental Health Services Administration, the Free Beacon zeroed in on the inclusion of “smoking kits/supplies” in the grant.",
    "“Wait until you hear the report of the Biden administration funding crack pipes for equity,” Fox News anchor John Roberts blared on Tuesday afternoon, teasing an upcoming segment on the Free Beacon story.",
    "Ted Cruz (R-TX) and Marsha Blackburn (R-TN), and Rep. Jim Jordan (R-OH) called for an end to “government-funded crack pipes,” other politicians insisted this was part of Biden’s plans for racial justice.",
    "Don't believe the lies or the fake fact-checking.”\nOn top of that, Republicans continued to use Fox News airwaves to blast the White House over the program, demanding that the money be sent elsewhere.",
    "Describing the Free Beacon piece as “inaccurate reporting,” White House Press Secretary Jen Psaki said crack pipes were “never a part of the kit” that would be distributed by grantees.",
    "Leo Beletsky, a law and health sciences professor at Northeastern University School of Law, told the Associated Press he was let down by the White House’s reaction to the GOP outrage.",
    "This week, the Biden Admin announced funds for crack pipe distribution to ‘advance racial equity,’” Sen. Tom Cotton (R-AR), an extremely frequent Fox News guest, tweeted this week.",
    "This is what he thinks of our community.”\nFox News, meanwhile, pounced on the opportunity and continued to pour gasoline on the fire throughout the day on Tuesday and Wednesday.",
    "During his Wednesday night show, Carlson took credit for the White House “suspending that program” before grumbling about the intent of harm reduction programs overall.",
    "It's also a critical way to build relationships and facilitate access to other supports,” Ryan McNeill, director of Harm Reduction Research at Yale, said on Wendesday.",
    "“Joe Biden is handing out crack pipes to help ‘racial equity’... during Black History Month,” tweeted Errol Webber, a Republican congressional candidate who is Black.",
    "Accordingly, no federal funding will be used directly or through subsequent reimbursement of grantees to put pipes in safe smoking kits,” they said in a statement.",
    "“Giving out crack pipes to people who use drugs is consistent with best practices in harm reduction and important in preventing disease transmission and injury.",
    "As of Thursday afternoon, “crack pipes” have been mentioned on Fox News and its sister channel Fox Business Network at least 67 times since Tuesday morning.",
    "Following the White House and HHS statements, both channels have mentioned the topic at least 22 times (not including reruns of Fox News’ primetime shows).",
    "“You may recall that on his first day in office more than a year ago, the new president explained that equity will require determination and creativity.",
    "Even after Team Biden said no funds would pay for pipes in a harm reduction program, Fox News continued blasting the White House over the issue.",
    "I know that sounds insane, I know that sounds too crazy to be true,” Sen. Marco Rubio (R-FL) harangued in a video posted to Twitter on Tuesday.",
    "“So yeah, you are right, imagine all the tax money that you pay and the fact that a portion of that money could be going to these programs.",
    "“As soon as there’s a little right-wing echo chamber pushback against something that is quite sound and rooted in science, they backtrack.",
    "Rubio, for instance, announced he would bring forth a bill that would prohibit federal funds from going towards crack pipes.",
    "“Even if the pipes do no good at all I don’t think we should get our knickers in a twist over this,” he pointed out.",
    "“This administration has said repeatedly they are making harm reduction one of their key priorities,” he stated.",
    "“The Biden administration is going to be sending crack pipes and meth pipes, targeting minority communities.",
    "It all started with a breathlessly hyped report from the Washington Free Beacon, a conservative news outlet.",
    "At the same time, glass pipes have sometimes been included in harm reduction kits provided by some groups.",
    "“What they are missing and of course is about smoking crack is not the pipe, it is the crack,” he seethed.",
    "“They say they can make it safer, and I say there's no way to make smoking crack cocaine or meth safer.",
    "This week he proved that is true,” the far-right host exclaimed at the top of his Tuesday night show.",
    "“Unlike WH comment, there is no suggestion that the original reporting on crack pipes was wrong.",
    "“HHS and ONDCP are focused on using our resources smartly to reduce harm and save lives.",
    "“Note how carefully worded this statement is,” Kessler stated on Twitter.",
    "“We wanted to put out information to make that clear,” she said.",
    "“Last week, Biden talked about being tough on crime.",
    "It's like trying to put a filter on a cigarette.”",
    "“So maybe you shouldn't encourage it as they are.",
    "While other Fox News regulars like Sens.",
    "“No I’m not joking.",
    "No I’m not lying."
  ]
}