{
  "id": 5878,
  "mediaId": 2746,
  "date": "2022-02-02",
  "headline": "Trump’s advice to CPAC: ‘Let’s have fun’",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/02/BELTWAY_2_182020_beltway-trump-509598202_c0-133-2000-1299_s1200x700.jpg?6b94e3dcfcbca7a261b96c53fab5cc2a79d7b5cc",
  "link": "https://www.washingtontimes.com/news/2022/feb/2/inside-beltway-donald-trumps-advice-cpac-lets-have/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Harper",
  "authorUrl": "https://www.washingtontimes.com/staff/jennifer-harper/",
  "termIds": [
    1614,
    2201,
    2817,
    3975,
    4661,
    4768,
    35,
    275
  ],
  "sentences": [
    "We’ll hear from members of Congress, some of our favorite governors, and conservative thought-leaders about the fight against Big Tech censorship, how we can stop President Biden’s radical agenda, and ways to engage before this year’s election,” said Matt Schlapp, chair of the American Conservative Union, in an advance statement explaining this bustling, well-focused gathering which annually draws as many as 18,000 people.",
    "“It can’t be done because the party of the left is the party of central planning, reflexive intervention into private affairs, ever-expanding government, higher tax burdens, suppression of speech, stifling regulatory regimes, political society over civil society, violations of the Second Amendment, the accrual of raw political power, and fealty to its rule,” it continued.",
    "Eight of the top 10 hottest real estate markets are in red states, as are nine of the top-10 states for the “best business tax climate.”\nPOLL DU JOUR\n• 51% of U.S. adults are “very dissatisfied” with the “direction of the U.S. as a country”; 72% of Republicans, 54% of independents and 31% of Democrats agree.",
    "THE FREEDOM FACTOR\n“When will freedom arrive in America?” asks an Issues and Insights editorial, referring to pandemic-related restrictions now governing the behaviors and routines of the American public, particularly in such states as California, New York, New Mexico and Oregon.",
    "While President Biden tries to smother the economic recovery he inherited, red states continue to see more jobs and lower unemployment,” reports a new analysis released by the Republican National Committee, based on new Labor Department statistics.",
    "Among those many guests also set to appear in the four-day event: Reps. Lauren Boebert, Madison Cawthorn, Matt Gaetz, Jim Jordan, Ronny Jackson, Barry Loudermilk and Roger Williams; Sen. Marsha Blackburn; Florida Gov.",
    "Exactly four years ago, on February 1, 2018, Trump’s RCP average stood at 41.5% approval and 54.5% disapproval,” writes Scott Whitlock, research director at NewsBusters.org, a conservative press watchdog.",
    "Each day, the conference features some 11 hours of speakers, forums and breakout sessions — not to mention the annual Reagan Dinner, which has been a traditional highlight of the event for decades.",
    "“16 of the top 20 states for jobs recovered since the coronavirus pandemic began are led by Republican governors, and 18 of the top 20 states have Republican-controlled legislatures.",
    "NEWS AND OPINION:\nThe Conservative Political Action Conference — that’s CPAC for short — is just three weeks away, set to take place in Orlando, Florida, Feb 24-27.",
    "“Newly released December data from the Labor Department confirms that Republican governors and legislatures are leading the way in getting Americans back to work.",
    "We are very excited to welcome 45 back to CPAC,” Mrs. Schlapp said in a tweet Wednesday, which was accompanied by a cheerful video message from Mr. Trump himself.",
    "Republican-led states on average have recovered 875 of their lost jobs compared to just 75% for Democrat-run states,” the committee analysis said.",
    "• 31% overall are “somewhat dissatisfied” with the direction of the U.S.; 24% of Republicans, 30% of independents and 39% of Democrats agree.",
    "POPULARITY: BIDEN LOSES TO TRUMP\nThe latest polls appear to reveal an uncomfortable reality for the White House and much of the news media.",
    "As of February 1, 2022, Biden’s Real Clear Politics (RCP) average of all the polls showed him at 41.4% approval and 54.7% disapproval.",
    "On Inauguration Day 2021, the networks proclaimed him ‘Lincoln,’ — ready to ‘hug’ and heal the nation,” Mr. Whitlock said.",
    "Quick, name a single liberty that Democrats support either through legislation or in the abstract,” the editorial said.",
    "Democrat-led states have an average unemployment rate 1.5 percentage points higher — 4.9%.”\nAnd one more thing.",
    "Biden, on the other hand, enjoyed worshipful media reporting, both in the campaign and during his first year.",
    "“Four Republican-led states — Utah, Idaho, Texas, and Arizona — have more jobs than when the pandemic hit.",
    "• 13% are “somewhat satisfied”; 4% of Republicans, 12% of independents and 24% of Democrats agree.",
    "“The average unemployment rate for the nation’s 27 states with Republican governors is just 3.4%.",
    "Ron DeSantis; Fox News host Sean Hannity; broadcaster and author Glenn Beck; and Sebastian Gorka.",
    "If there is any indisputable fact in today’s politics, it’s that Democrats are anti-freedom.",
    "The top nine states for jobs recovered are all led by Republicans,” the research continued.",
    "• 3% are “very satisfied”: 0% of Republicans, 3% of independents and 7% of Democrats agree.",
    "More jobs are being recovered and unemployment is lower in red states,” the analysis said.",
    "“If journalists and networks want to demonstrate any honesty, this should be a big story.",
    "“While that’s an exhausting but not exhaustive list, we know readers will get the point.",
    "Another 24 Republican-led states have recovered at least two-thirds of their lost jobs.",
    "The America First agenda that he championed is the future of the conservative movement.",
    "Trump was hit with relentlessly antagonistic coverage, often surpassing 90% negative.",
    "SOURCE: A Gallup poll of 811 U.S. adults conducted Jan. 3-16 and released Monday.",
    "“Notice any commonality among these outposts where freedom no longer rings?",
    "It’s a derangement they can no longer cover up,” the editorial concluded.",
    "The Democrats would rather reign than constitutionally govern.",
    "The annual event is a showcase for conservative luminaries.",
    "• Follow Jennifer Harper on Twitter @HarperBulletin.",
    "REPUBLICAN STATES TRIUMPH\n“Red States are booming.",
    "“President Donald Trump is the leader of the GOP.",
    "Joe Biden is more unpopular than Donald Trump.",
    "His wife Mercedes Schlapp also has a message.",
    "For more information visit Conservative.org.",
    "• 14% of men and 12% of women also agree.",
    "• 29% of men and 34% of women also agree.",
    "• 53% of men and 49% of women also agree.",
    "• 2% of men and 5% of women also agree.",
    "They are all run by Democrats.",
    "Let’s have fun,” he advised.",
    "“We have a packed line up.",
    "“CPAC is terrific.",
    "“It’s official."
  ]
}