{
  "id": 5888,
  "mediaId": 2547,
  "date": "2022-02-07",
  "headline": "Jim Jordan Is An Absurd Hypocrite, Part Infinity",
  "image": "https://crooksandliars.com/files/mediaposters/2022/02/49498.jpg",
  "link": "https://crooksandliars.com/2022/02/jordan-absurd-hypocrite",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Amato",
  "authorUrl": "https://crooksandliars.com/team/john-amato",
  "termIds": [
    1670,
    2201,
    3102,
    3296,
    3346,
    3975,
    5063,
    5366,
    5371
  ],
  "sentences": [
    "So now that President Biden has had a call with President Zelenskyy of Ukraine, during which there was no extortion, no whistleblower outing, and no \"we need a favor though,\" right-wing frauds like Seb Gorka and his ilk are trying to make a thing out of the \"transcript of the call.\"",
    "He continued, \"I'd like to see what they said, maybe the American people would like to see that, but oh no no such a different standard...This double standard that the elite Left, that they get to abide by a different set of rules.",
    "The Biden White House, in keeping with standard and legal White House practice going back decades, released a \"read-out\" of the call but not a transcript, and that's the same as a \"cover-ups!",
    "Congress authorized aid to Ukraine and Mango Mussolini attempted to withhold that aid to get Ukraine to announce a made-up investigation into Hunter Biden.",
    "(@ColtsFan_Rick) January 30, 2022\nJoining Mark Levin, Jordan claimed that Biden's not being transparent on a call with President Zelenskyy.",
    "\"Joe Biden himself demanded that President Trump do it and they used that -- ridiculous basis for impeaching [Trump],\" Jordan whined.",
    "Needless to say, Jordan refuses to divulge what was said on his ten-minute phone call with Trump on the day of the insurrection.",
    "The man refuses to discuss any of his phone conversations to Trump while helping to defend the insurrectionists of January 6.",
    "Republican Congressmen get to lie about the past when it's about \"the transcript\" and hide the truth when it's about them.",
    "It took me 10 seconds to find the read out of the call…what could possibly be their excuse besides blatant ignorance???",
    "There's an imaginary scandal on the Right regarding Joe Biden's recent phone call with the president of Ukraine.",
    "In the 'you can't make this up,' category, Gym Jordan's hypocrisy was on full display on Sunday night.",
    "Mark Levin howled for almost twenty minutes and demanded Biden be impeached over immigration policies.",
    "Mango's \"defense\" was that \"it was a perfect call\" and that everyone should \"read the transcript.\"",
    "You may recall that Donald Trump's first impeachment was over his attempted extortion of Ukraine.",
    "Why won't Joe Biden release the transcript of the call he just had with President Zelenskyy?\"",
    "Why does the @GOP think Americans deserve lazy and incompetent government representatives?",
    "Levin said, \"We're not talking about a transcript of a phone call to a foreign leader.\"",
    "This led whistleblowers like Lt. Col. Alexander Vindman to come forward.",
    "As we regular folks gotta follow another set it is as wrong as it gets.\"",
    "Then he claimed, a Republican sitting member of Congress wasn't elitist.",
    "The transcript definitely did not exonerate the Traitor-in-Chief.",
    "Jordan replied, \"You just mentioned the transcript.",
    "Don't you remember the Trump rally t-shirts, Gym?",
    "No, \"read the transcript\" was Trump's DEFENSE.",
    "Sounds like a double standard to me.",
    "Hypocrisy, Jordan is thy name.",
    "?https://t.co/pkHZQ293DT\n— ?",
    "?TheObjectiveEngineer ????",
    "outrage on the Right.",
    "Think about this.",
    "Is he kidding?",
    "Solyndra!\"",
    "Bengazi!",
    "Topics:",
    "?????",
    "9/11!"
  ]
}