{
  "id": 5929,
  "mediaId": 2636,
  "date": "2022-02-02",
  "headline": "Who Are the Key Figures of Interest in the Jan. 6 Inquiry?",
  "image": "https://static01.nyt.com/images/2022/02/02/multimedia/committee-investigation/committee-investigation-articleLarge.jpg",
  "link": "https://www.nytimes.com/explain/2022/03/09/us/jan-6-inquiry-figures",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The panel, which has said that there is enough evidence to suggest that Mr. Trump and some of his allies might have engaged in a criminal conspiracy, does not have the authority to pursue charges, but it can make criminal referrals to the Justice Department.",
    "In a civil filing, the committee’s lawyers laid out their theory of a potential criminal case against Mr. Trump, and the federal judge assigned to the case ruled that Mr. Trump most likely committed felonies in trying to overturn the 2020 election.",
    "The panel is also scrutinizing Mr. Trump’s role in proposals to seize voting machines after the 2020 election, as well as whether one of his tweets served as a crucial call to action for extremist groups ahead of the Capitol attack.",
    "In a civil suit over Mr. Eastman’s documents, the panel said it had accumulated evidence demonstrating that Mr. Eastman, along with other Trump allies, could potentially be charged with criminal violations.",
    "The committee said that the former deputy chief of staff had worked with Mr. Trump to spread false information via social media regarding election fraud and had recruited a crowd to Washington on Jan. 6.",
    "The White House adviser, in his book and interviews, said he was involved in what he called an “operation” to keep Mr. Trump in office by getting Congress to reject the results of the 2020 election.",
    "Here are some of the key people and groups included in the panel’s investigation:\nThe former president’s White House records and call logs related to the attack have been a focus of the inquiry.",
    "Mr. Trump’s chief of staff, who initially provided the panel with a trove of documents that showed the extent of his role in the efforts to overturn the election, is now refusing to cooperate.",
    "Mr. Pence’s chief of staff, who has firsthand knowledge of Mr. Trump’s pressure campaign on the vice president to throw out the election results, testified before the panel under subpoena.",
    "Mr. Bannon has been charged with contempt of Congress for refusing to comply with a subpoena; he claimed protection under executive privilege even though he was an outside adviser.",
    "Mr. Trump has tried to keep the documents from the committee by asserting executive privilege, but both the Supreme Court and President Biden have rejected those claims.",
    "The daughter of the former president, who served as one of his senior advisers, is among the highest-ranking Trump White House officials to testify before the committee.",
    "The fiancée of Mr. Trump’s eldest son, Donald Trump Jr., has said she raised millions of dollars to help fund the rally that preceded the Jan. 6 attack on the Capitol.",
    "The riot occurred as Congress met to formalize Joseph R. Biden Jr.’s election victory amid efforts by President Donald J. Trump and his allies to overturn the results.",
    "The panel said that it had gathered evidence that she had implored her father to call off the violence that occurred when his supporters stormed the Capitol.",
    "The academic and conservative lawyer has become the subject of intense scrutiny since writing a memo that laid out how Mr. Trump could stay in power.",
    "The committee said that it would compel Ms. Guilfoyle to testify after she abruptly ended a voluntary interview with the panel.",
    "The House voted to recommend that Mr. Scavino be held in criminal contempt of Congress for defying a subpoena from the panel.",
    "The list of names being scrutinized by the House committee for their role in the Jan. 6 attack on the Capitol keeps growing.",
    "Mr. Navarro said he would not comply with the committee’s subpoena, citing Mr. Trump’s invocation of executive privilege.",
    "The House voted to recommend holding Mr. Meadows in criminal contempt of Congress for defying the panel’s subpoena.",
    "The House voted to recommend criminal contempt of Congress charges against Mr. Navarro for defying the subpoena.",
    "The former Trump aide is under scrutiny by the committee for comments he made on his radio show on Jan. 5, 2021.",
    "He is the most senior person on Mr. Pence’s staff who is known to have cooperated with the committee.",
    "A House select committee is scrutinizing the causes of the Jan. 6 riot at the U.S. Capitol.",
    "The committee points to this as evidence that he had “some foreknowledge” of the attack.",
    "The federal judge in the case ruled that Mr. Eastman most likely committed felonies."
  ]
}