{
  "id": 5938,
  "mediaId": 2707,
  "date": "2022-02-09",
  "headline": "Jan. 6 committee subpoenas ex-Trump adviser Navarro",
  "image": "https://www.ocregister.com/wp-content/uploads/2022/02/sjm-estigation_93834820.jpg?w=1024&h=683",
  "link": "https://www.ocregister.com/2022/02/09/jan-6-committee-subpoenas-ex-trump-adviser-navarro/",
  "mediaOutlet": "The Orange County Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "https://www.ocregister.com/author/apress/",
  "termIds": [
    1335,
    1694,
    2201,
    2737,
    3372,
    3500,
    3731,
    90
  ],
  "sentences": [
    "By Farnoush Amiri | Associated Press\nWASHINGTON — The House committee investigating the U.S. Capitol insurrection subpoenaed former White House trade adviser Peter Navarro on Wednesday, seeking to question an ally of former President Donald Trump who promoted false claims of voter fraud in the 2020 election.",
    "The nine-member panel said it has obtained information from public interviews, reporting and even Navarro’s own book that indicates he worked with longtime Trump ally Steve Bannon and others to develop and implement a plan to delay the certification of Joe Biden’s electoral win on Jan. 6, 2021.",
    "The committee is demanding information and testimony from Navarro, who they say was involved in efforts to delay Congress’ certification of the 2020 election and ultimately change the election results, Mississippi Rep. Bennie Thompson, the committee’s Democratic chairman, said in a statement.",
    "“He hasn’t been shy about his role in efforts to overturn the results of the 2020 election and has even discussed the former President’s support for those plans.”\nNavarro did not immediately respond to a request for comment.",
    "The congressional probe has scrutinized Trump family members and allies, members of Congress and even social media groups accused of perpetuating election misinformation and allowing it to spread rampantly.",
    "Lawmakers will be holding hearings to document to the American public the most detailed and complete look into the individuals and events that led to the Capitol insurrection.",
    "The former president asked him to come on board after one of Navarro’s books on China happened to catch the eye of Trump son-in-law Jared Kushner during an internet search.",
    "Navarro appears to have information directly relevant to the Select Committee’s investigation into the causes of the January 6th attack on the Capitol,” Thompson continued.",
    "The 72-year-old former economics professor was seen as a man with ideas considered well outside the mainstream before he joined the Trump campaign in 2016.",
    "The Jan. 6 select committee, comprised of seven Democrats and two Republicans, has subpoenaed close to 100 people so far and interviewed nearly 500.",
    "Navarro is the latest person to receive a subpoena from the committee as part of the large-scale investigation it began last summer.",
    "A House subcommittee set up to investigate the Trump administration’s response to COVID-19 also subpoenaed him in November.",
    "But he was quickly sidelined by chief of staff John Kelly and closely managed by former staff secretary Rob Porter.",
    "The committee investigating the Capitol attack is not the only group of lawmakers seeking Navarro’s compliance.",
    "He denied their request, citing a “direct order” from the former president to claim executive privilege.",
    "Navarro was one of the White House staffers who promoted Trump’s baseless claims of mass voter fraud.",
    "He released a report in December 2020 that he claimed contained evidence of the alleged misconduct.",
    "Once Trump took office, Navarro was appointed to head a new White House National Trade Council.",
    "The committee plans to move into a more public-facing phase of its work in the next few months.",
    "Associated Press writer Jill Colvin in New York contributed to this report.",
    "“Mr."
  ]
}