{
  "id": 5972,
  "mediaId": 2548,
  "date": "2022-02-07",
  "headline": "Arizona AG Demands GoFundMe Preserve Documents Related To Removal Of Freedom Convoy Fundraiser",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2021/03/Untitled-6-e1615389887227.jpg",
  "link": "https://dailycaller.com/2022/02/07/arizona-mark-brnovich-gofundme-canada-convoy/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ailan Evans",
  "authorUrl": "https://dailycaller.com/author/Ailan+Evans",
  "termIds": [
    1439,
    2588,
    2725,
    3151,
    432,
    878,
    1228,
    4830
  ],
  "sentences": [
    "The letter, addressed to GoFundMe general counsel Kim Wilford, questioned whether GoFundMe violated Arizona laws relating to “fraud, deception, and unfair treatment” when it deleted the “Freedom Convoy 2022” fundraiser, a donation initiative intended to support individuals currently protesting Canada’s COVID-19 vaccine mandate for truck drivers and other coronavirus restrictions.",
    "“GoFundMe is hereby on notice to preserve materials of any kind, including but not limited to, all documents, drafts, emails, voicemails, text or communication app messages of any kind, and social media communications relating in any way and all times to the Freedom Convoy 2022 fundraiser,” wrote Joseph Sciarrotta, Jr., civil litigation division chief.",
    "(RELATED: Ted Cruz Calls For FTC Probe Into GoFundMe For Shutting Down Convoy Fundraiser)\nGoFundMe shut down the fundraiser on Friday, informing donors it would no longer distribute donations to the event’s organizers and citing “police reports of violence and unlawful activity” as justification.",
    "Several other Republican state attorneys general, including West Virginia Attorney General Patrick Morrissey, Ohio Attorney General Dave Yost and Texas Attorney General Ken Paxton, also announced their intent to investigate GoFundMe for potentially violating consumer protection laws.",
    "Republican Arizona Attorney General Mark Brnovich’s office sent a letter to crowdfunding site GoFundMe on Monday requesting the company preserve documents related to its deletion of a fundraiser supporting a protest against Canadian COVID-19 restrictions.",
    "Similarly, prominent Republican members of Congress including Ohio Rep. Jim Jordan and Tennessee Sen. Marsha Blackburn have indicated plans to further scrutinize the crowdfunding site.",
    "The company first said it would donate the money raised by the organizers to charities, but later decided to automatically refund donations after public backlash.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "Brnovich’s office cited this reversal in the letter, and it announced plans to investigate GoFundMe for its handling of the fundraiser.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "Brnovich’s office demanded the company preserve all documents related to the fundraisers’ removal."
  ]
}