{
  "id": 5979,
  "mediaId": 2664,
  "date": "2022-02-05",
  "headline": "'Squirrelly' Jim Jordan's Trump phone call 'is a big piece' of the Capitol riot evidence: former prosecutor",
  "image": "https://www.rawstory.com/media-library/rep-jim-jordan.jpg?id=29272996&width=1200&coordinates=0%2C22%2C0%2C12&height=600",
  "link": "https://www.rawstory.com/jim-jordan-donald-trump/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1670,
    2201,
    3391,
    3975,
    4304,
    180,
    878,
    1132
  ],
  "sentences": [
    "Appearing on CNN Saturday morning, former U.S. Attorney and Deputy Assistant Attorney General Harry Litman suggested the content of the newly revealed 10-minute phone conversation Rep. Jim Jordan (R-OH) had with former president Donald Trump would go a long way to exposing any White House connection to the Jan 6th Capitol riot.",
    "Speaking with host Amara Walker, the former prosecutor labeled the Ohio Republican as \"squirrelly\" with his evasive answers about the morning call that he previously claimed never happened.",
    "A prosecutor's head would be going off like crazy given all the squirreliness like before, but I don't think a subpoena will work against Jordan unless and until they go to court for it.\"",
    "Asked by the CNN host if the GOP lawmaker should be subpoenaed, Litman said it probably would be fruitless because Jordan and Trump are likely engaged in a \"conspiracy of silence.\"",
    "Do you think a subpoena will be enough for Jordan to speak to the committee and reveal what was said on that call?\"",
    "just for the listeners, the records the committee have just say how long the call was, they don't have the context.",
    "Jim Jordan and Donald Trump but they both can have confidence that there will be a conspiracy of silence.\"",
    "As you say that really matters because it is in advance of the whole riot and rally that Trump undertook.\"",
    "\"We know that Congressman Jim Jordan spoke with President Trump for ten minutes,\" host Walker prompted.",
    "\"That afternoon he went to object to the certification of Biden's Electoral College win.",
    "\"Because he's been all over the lot and very squirrely about it with one exception.",
    "He said categorically, 'I never talked to him in the morning.'",
    "\"So it is a big piece of evidence,\" he elaborated. \"",
    "\"Short answer is no,\" the attorney replied.",
    "\"But it's significant,\" he continued.",
    "The people who could give that?",
    "\"And by the way, you're right.",
    "So this puts the lie to it.",
    "Watch below:"
  ]
}