{
  "id": 60,
  "mediaId": 2583,
  "date": "2022-04-11",
  "headline": "Hasan Calls out Republicans’ Hypocrisy on Pedophilia By Listing Scandals of Gaetz, Jordan and Fellow GOP Officials",
  "image": "https://storagealpha10.grabien.com/clipsbank/1502/framelarge/1502135.jpg",
  "link": "https://grabien.com/story.php?id=374143",
  "mediaOutlet": "grabien.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Are we supposed to forget that GOP congressman Jim Jordan was accused by eight former student wrestlers of ignoring allegations of sexual abuse by a team doctor at Ohio State University while he was an assistant coach there in the 1990s, something he denies?",
    "Moore was endorsed by the Republican national committee under Ronna McDaniel, the same Ronna McDaniel who now has the nerve to attack Ketanji Brown Jackson for being soft on child porn offenders.",
    "Are we supposed to forget that Roy Moore, the Republican candidate for the Senate in Alabama in 2017 was credibly accused of sexually assaulting girls as young as 14 and 16, something he denies?",
    "EXCERPT:\nHASAN: “Are we supposed to forget that Republican congressman Matt Gaetz, a close ally of Marjorie Taylor Greene, is under federal investigation for sex trafficking right now?",
    "He's the 29-year-old former GOP staffer in Republican National Committee who was sentenced to 12.5 years for trading in child pornography on Thursday.",
    "That’s the kind of collective blaming and smearing that Republicans use to demonize Democrats and liberals more broadly.",
    "Now you might say all of those Republicans deny those accusations and they weren’t convicted of any crimes.",
    "That investigators are looking into whether Gaetz slept with a 17-year-old for money, something he denies?",
    "In fact, ironically, the same day that Judge Jackson was confirmed to the Supreme Court.",
    "To be clear, I’m not suggesting that the Republican Party is a party of pedophiles.",
    "We shouldn’t help them turn child sex crimes into a party political weapon.”",
    "How about Danny Hastert, former Republican House Speaker for eight years?",
    "He went to prison in 2016 after admitting to sexually abusing young boys.",
    "The judge called him a serial child molester.",
    "How about Ruben Verastigui?",
    "Just this past Thursday!",
    "The former Speaker!",
    "Okay, fine.",
    "Ruben who?"
  ]
}