{
  "id": 6000,
  "mediaId": 2540,
  "date": "2022-02-08",
  "headline": "This is the big loser in the redrawing of the country's congressional lines",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/211209152939-us-capitol-1116-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/08/politics/redistricting-congress-2022-midterm-election/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Of the 301 new House districts that have now been adopted, just 17 (5.6%) went for [Joe] Biden or [Donald] Trump by five points or less, down from 39 of 301 (13.0%) districts in the same states currently,\" tweeted Dave Wasserman, House editor at the Cook Political Report, on Monday morning.",
    "The incentivizing of pure partisans can be seen in the rise of the likes of Reps. Marjorie Taylor Greene, Matt Gaetz and Jim Jordan on the right, as well as Reps. Alexandria Ocasio-Cortez, Ilhan Omar and Rashida Tlaib on the left.",
    "According to Cook Political Report calculations, 42 Republicans and 40 Democrats won with 55% or less of the vote that year -- the traditional marker for competitiveness in congressional elections.",
    "Every 10 years, partisans on both sides largely prize creating as many solidly Republican and Democratic seats as possible -- making the vast majority of districts competitive only in primaries.",
    "These are some of the most prominent faces within their respective parties and each one represents a district that would never elect -- or even consider electing -- someone from the other party.",
    "(CNN)Now that 31 states have finished redrawing their congressional lines in advance of the 2022 midterm elections, one thing is now abundantly clear: Competitive seats are few and far between.",
    "Inside Elections, another campaign tip sheet, currently lists a meager 11 House races as pure \"toss ups\" and 14 as either \"tilting\" or \"leaning\" towards one party.",
    "And increasingly, that decision is taken out of the voters' hands by the map-drawers who create hundreds of non-competitive districts at the start of every decade.",
    "And none of them are good for what people keep telling pollsters they want -- both sides to work together to solve the big problems facing the country.",
    "It also continues a decades-long trend of declining competitiveness as a direct result of the redrawing of the country's 435 congressional districts.",
    "And it keeps incumbents forever wary of ever working with anyone outside of their party, for fear of being cast as disloyal and losing in a primary.",
    "There is a direct connection between the increasing number of purely partisan districts and the decided dearth of bipartisanship in Congress.",
    "Put simply: There are a series of reverberations from drawing congressional districts where only one party has any realistic chance to win.",
    "\"Back in 2012, after the last redistricting round, 66/435 districts went for [Barack] Obama or [John] McCain by five points or less.\"",
    "That lack of competition is reflected in the ratings offered by nonpartisan handicapping services like the Cook Political Report.",
    "That increasing lack of competitiveness has a clear impact on how the government works -- or, more accurately, doesn't.",
    "It creates a disincentive for candidates to do anything other than throw red meat to their bases as the way to win.",
    "As of today, Cook rates just 13 House races as \"toss ups\" and another 17 as \"leaning\" towards one party.",
    "If you want to change the way politics works, you have to change the people you elect.",
    "That marks a major change from even the 2020 election."
  ]
}