{
  "id": 6006,
  "mediaId": 2634,
  "date": "2022-02-10",
  "headline": "Fossil Fuel Companies Have the Nerve to Claim That Taxing Them Will Hurt the Climate",
  "image": "https://images.newrepublic.com/28d8ffb825b423e33f529e38ed0080f781f5bc1e.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/165340/fossil-fuel-companies-nerve-claim-taxing-will-hurt-climate",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Aronoff",
  "authorUrl": "https://newrepublic.com/authors/kate-aronoff",
  "termIds": [
    0
  ],
  "sentences": [
    "“I am not convinced,” Shell CEO Ben Van Buerden said, “that windfall taxes—popular though they may seem—[are] going to help us with supply, nor [are they] going to help us with demand.” BP, which brought home $12.8 billion last year (its highest profits since 2013) and whose CEO Bernard Looney remarked in November that high fuel prices had turned his company into a “cash machine,” also rejected the idea of a windfall tax, arguing that it might endanger the company’s low-carbon ambitions.",
    "Looking around at the rise in fuel prices throughout the world, though—and the fact that they’re paired with massive profits and share buybacks—reveals that these companies are like the pharmaceutical industry, too: pumping up demand for their own harmful products, lobbying to take away constraints on their business model, and charging exorbitant prices for something their customers can’t live without.",
    "The lifting of the price cap was announced the same day that oil giant Shell—soon to be headquartered entirely in London—announced that its profits more than quadrupled last year and that it would buy back $8.5 billion in shares in the first half of this year, padding its shareholders’ pockets.",
    "Shell and BP didn’t pay any corporate taxes or production levies on their North Sea drilling operations between 2018 and 2020, all the while collecting £400 million in tax relief; on average, total U.K. fossil fuel subsidies were valued at £12 billion annually over the last five years.",
    "When allegedly forward-thinking oil and gas companies talk up their meager investments in renewables, it allows these “good guys” to engage in a kind of green blackmail: Place any more constraints on them, and who knows what might happen to all those wind farms and solar panels.",
    "Prices now are well above break-even levels for unconventional production, in large part because shale producers spent months voluntarily constraining production so that profits would rise, and to make nice with investors tired of seeing them burn through their money.",
    "An analysis from the U.K.-based think tank Common Wealth found that Shell and BP have together spent £147.2 billion on stock buybacks and dividends since 2010, well above the Financial Times Stock Exchange, or FTSE, 100 average of £10.8 billion over the same period.",
    "With the red-faced bravado of a slightly drunk high school football coach angry at having lost a big game, Republican Louisiana Representative Garrett Graves told climatologist Michael Mann that he had “crossed so far over from science into political theater.",
    "While it’s nothing new for the GOP to put out disingenuous talking points about their fossil fuel industry donors, it’s possible these donors would be pretty displeased if lawmakers made a concerted effort to increase production or reduce prices.",
    "In the unlikely event that major oil companies do manage to zero out their emissions and pour significant money into renewables, whether their executives and investors are allowed to get rich off a necessity—energy—should still be up for debate.",
    "Besides pouring ungodly amounts of greenhouse gases into the atmosphere, the business model of Exxon, Chevron, BP, and Shell, especially, relies on extracting profits for a small number of people from something everyone needs to survive.",
    "In the third quarter of 2021, energy consultancy Rystad Energy found that 21 shale drillers accounting for 40 percent of the year’s output had $13 billion in cash from operations and poured just $5.9 billion into capital expenditure.",
    "As the windfall tax debate played out in the U.K., across the Atlantic on Wednesday, U.S. Democrats on the House Oversight and Reform Subcommittee on the Environment took Exxon, Chevron, BP, and Shell to task over greenwashing.",
    "In response to a mounting cost-of-living crisis and surging industry profits, the opposition Labour Party has proposed a one-year additional 10 percent tax on North Sea oil and gas producers—totaling an estimated £1.2 billion.",
    "“We believe our strategy is working, and we are beginning to demonstrate the crucial role that bp and greening companies like ours can play in helping the world get to net zero,” a BP spokesperson told E&E News yesterday.",
    "While Energy Secretary Jennifer Granholm has in fact been encouraging U.S. drillers to “get” their “rig count up,” it’s oil and gas companies themselves that have been keeping it in the ground throughout the pandemic.",
    "With most conventional wells exhausted, much of the production that happens here—from places like the booming Permian Basin—is extraordinarily capital-intensive, requiring big injections of cash to keep pumping.",
    "Tory Chancellor Rishi Sunak has so far rejected those calls, opting instead for a one-time £200 loan to ratepayers to be paid back over the next four years, in addition to a one-time £150 council tax rebate.",
    "There’s a vein of criticism from climate campaigners that posits coal, oil, and gas companies as uncommonly villainous, conspiring to mislead the public about the dangers of climate change.",
    "Over the last few years, U.K. and European-based producers—Shell and BP, especially—have been thought of as more forward-thinking on climate than their counterparts in the United States.",
    "For their part, Republicans stuck to familiar talking points about how Democrats were to blame for rising gas prices, for putting a halt to the Keystone XL pipeline in particular.",
    "Oil and gas industry CEOs, meanwhile, have told anyone who will listen that a windfall tax is a bad idea that will somehow screw over the market and exacerbate climate change.",
    "Fuel prices are now likely to rise dramatically in the U.K. over the coming months, with households paying on average £700 ($947) more per year on monthly energy bills.",
    "But what the supervillain account of climate politics can gloss over is how much of fossil fuel companies’ toxic footprint comes from ordinary capitalist-firm behavior.",
    "The likes of ExxonMobil sponsoring disinformation campaigns about the “greenhouse effect” has earned them (very fair) comparisons to the tobacco industry.",
    "But Looney’s argument against the windfall tax sheds some light on what supposedly more responsible energy companies have to gain from those promises.",
    "“I don’t think a windfall tax is going to incentivize people to invest in the thing that we need right now,” Looney told the Financial Times.",
    "That burden will fall hardest on lower-income households, which pay a much larger percentage of their income on energy than wealthier ones.",
    "Ohio Representative Jim Jordan pursued a similar line of questioning, trying to establish that Democrats were to blame for rising prices.",
    "Either coincidentally or not so coincidentally, BP announced new climate targets as the debate over a windfall tax was playing out.",
    "BP’s payouts, researchers Joseph Baines and Sandy Hager found, were 2.5 times larger than their tax payments in that time.",
    "Their commitment to delivering returns to shareholders is making life harder, and more expensive, for millions of people.",
    "“Why would the Democrats want to decrease production?”\nDrillers, though, thrive on high prices, especially in the U.S.",
    "ExxonMobil and Chevron both raked in their highest earnings since 2014: $23 billion and $15.6 billion, respectively.",
    "The United Kingdom’s energy regulator announced last week that it would lift its cap on energy prices by 54 percent.",
    "It really undermines your credibility.” Graves has taken $41,000 from oil and gas company PACs this campaign cycle.",
    "The Labour Party has proposed a one-year tax hike to help low-income customers handle rising energy prices.",
    "BP and Shell jointly delivered £44 billion in dividends to their shareholders between 2018 and 2020.",
    "That’s less than a quarter of what the same companies were spending at the height of the boom.",
    "But the British situation—and Shell’s and BP’s response—is particularly revealing.",
    "As a result, an additional 1.1 million people could be plunged into fuel poverty.",
    "Planet-killing emissions aren’t the only thing wrong with fossil fuel companies.",
    "Frackers struggled to turn a profit amid the shale boom’s drilling frenzy.",
    "European oil companies weren’t the only ones to profit big last year.",
    "Shell and BP have led the charge on net-zero pledges, for instance.",
    "Net-zero pledges don’t just help oil giants placate investors.",
    "At the very least, they should probably be paying more taxes.",
    "The revenue would go toward easing the pain of rising prices.",
    "In 2019, BP had a negative tax rate of 54 percent.",
    "There’s plenty of truth to that story.",
    "Shell and BP oppose it."
  ]
}