{
  "id": 6047,
  "mediaId": 2636,
  "date": "2022-02-10",
  "headline": "Trump’s Missing Call Logs Present a Challenge for Jan. 6 Investigators",
  "image": "https://static01.nyt.com/images/2022/02/10/us/politics/10dc-investigate-SWAP/merlin_182053386_2b37323a-96be-49b4-a4e8-aa211056d6f0-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/10/us/politics/jan-6-trump-calls.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2434,
    4268,
    509,
    663,
    958,
    1124
  ],
  "sentences": [
    "After the Supreme Court ruled against Mr. Trump’s efforts to block the release of hundreds of pages of presidential records, the National Archives turned over to the House panel investigating the riot voluminous documents that included daily presidential diaries, schedules, appointment information showing visitors to the White House, activity logs, call logs, and switchboard shift-change checklists showing calls to Mr. Trump and Mr. Pence on Jan. 6.",
    "At some point during a monthslong negotiation between Mr. Trump’s team and the agency, officials at the National Archives threatened to send a letter to Congress or the Department of Justice if he continued to withhold the boxes, according to a person familiar with private discussions, who spoke about them on the condition of anonymity.",
    "Investigators have not uncovered evidence that any official records were tampered with or deleted, and it is well known that Mr. Trump routinely used his personal cellphone, and those of his aides, to talk with other aides, congressional allies and outside confidants, bypassing the normal channels of presidential communication.",
    "The committee did receive evidence in the documents requested from the National Archives that Mr. Trump had a call with Representative Jim Jordan, Republican of Ohio, who led the floor strategy on Jan. 6 of objecting to Joseph R. Biden Jr.’s victory in key states, according to two people familiar with the investigation.",
    "WASHINGTON — The House committee investigating the Jan. 6 attack on the Capitol has discovered gaps in official White House telephone logs from the day of the riot, finding few records of calls by President Donald J. Trump from critical hours when investigators know that he was making them.",
    "The gaps in the call logs were the latest in a string of revelations this week about the extent of Mr. Trump’s flouting of the rules and norms of presidential conduct, and how his penchant for doing so has left an incomplete record of how he operated while in office.",
    "The Washington Post reported on Wednesday that Justice Department officials were weighing whether to investigate Mr. Trump after the National Archives made a referral to the Justice Department, asking it to examine Mr. Trump’s handling of White House records.",
    "They have also prompted accusations of hypocrisy from Democrats, who recall how Mr. Trump branded Hillary Clinton’s use of a private email server while she was secretary of state “worse than Watergate,” and made “lock her up” a campaign rallying cry in 2016.",
    "Since the attack on Jan. 6, 2021, former Trump administration officials have said that investigators would struggle to piece together a complete record of Trump’s conversations that day, because of his habit of using his and other people’s cellphones.",
    "And while he was president, staff in the White House residence periodically discovered wads of printed paper clogging a toilet — leading them to believe that Mr. Trump had attempted to flush documents, according to people familiar with the situation.",
    "Republicans who eagerly followed his lead in savaging Mrs. Clinton for her email practices have been notably silent amid revelations that Mr. Trump spent his four years in office — and much of the time since — mishandling presidential records.",
    "“A president choosing to use a personal cellphone on a sensitive matter of government business without the conversation being recorded anywhere raises serious questions about his compliance with the spirit” of the Presidential Records Act.",
    "Despite the lack of call records from the White House, the committee has learned in recent weeks that Mr. Trump spoke on the phone with Mr. Pence and Republican lawmakers on the morning of Jan. 6 as he pushed to overturn the election.",
    "In addition, he removed more than a dozen boxes of presidential records from the White House when he left office, which the National Archives believes contained classified material, according to a person briefed on the matter.",
    "Nevertheless, his first public communication as the melee unfolded was a Twitter post attacking Vice President Mike Pence, who was presiding over the joint session of Congress to count the Electoral College votes.",
    "Early on in his administration, Mr. Trump was known to use a cellphone belonging to Keith Schiller, his personal bodyguard at Trump Tower and later the director of Oval Office operations, for some of his calls.",
    "But the sparse call records present a major obstacle to a central element of the panel’s work: recreating what Mr. Trump was doing behind closed doors during the assault on Congress by a mob of his supporters.",
    "But the spirit of the law is that presidents should avoid doing so — and if they do, their calls should still be memorialized, said Jason R. Baron, the former director of litigation at the National Archives.",
    "Two people familiar with the phone records discussed details about them on the condition of anonymity because they did not want to be identified discussing an ongoing congressional investigation.",
    "Counterintelligence officials say it is highly risky for presidents to use their personal cellphones, as those phones almost certainly have no protection against spying by foreign adversaries.",
    "He was watching television as the riot played out on cable news, and several aides, including his daughter Ivanka Trump, implored him to say something to try to get the rioters to stop.",
    "“Government agencies are supposed to document phone calls when the conversation is about important government business,” said Mr. Baron, a professor at the University of Maryland.",
    "Some of the records that the Jan. 6 committee has received had been ripped to shreds and taped back together, reflecting the former president’s habit of tearing up documents.",
    "The House panel investigating Jan. 6 is still awaiting additional material from the National Archives and Records Administration, which keeps the official White House logs.",
    "For instance, Mr. Trump mistakenly called the phone of Senator Mike Lee, Republican of Utah, thinking it was the number of Senator Tommy Tuberville, Republican of Alabama.",
    "The highly irregular practices underscore the challenge of creating a full historical record of a presidency that often operated outside the bounds of longstanding rules.",
    "And he fielded a call from Representative Kevin McCarthy, the top House Republican, who told Mr. Trump that people were breaking into his office on Capitol Hill.",
    "Mr. Lee then passed the phone to Mr. Tuberville, who said he spoke to the former president for less than 10 minutes as rioters were breaking into the building.",
    "The call logs obtained by the committee document who was calling the White House switchboard, and what calls were being made from the White House to others.",
    "Sparse call records and missing documents hinder the House panel as it tries to piece together what President Trump was doing during the attack on Congress.",
    "Mr. Trump has been loath to return the boxes of documents he took from the White House, despite repeated efforts by the National Archives to obtain them.",
    "The House Oversight committee on Thursday announced an investigation into what it called “potential serious violations” of the Presidential Records Act.",
    "The committee has also subpoenaed telecommunications companies for the personal cellphone records of a range of people in Mr. Trump’s inner circle.",
    "(Those incidents are recounted in a forthcoming book, “Confidence Man,” written by a New York Times reporter, about Mr. Trump and his presidency.)",
    "There is nothing in federal record-keeping laws that explicitly addresses whether a president can use a personal cellphone for official business.",
    "Capitol Riot’s Aftermath: Key Developments\nLittle is known of what Mr. Trump did inside the White House as rioters stormed the Capitol.",
    "At least one person who tried to reach Mr. Trump on his cellphone on Jan. 6 had their call picked up by one of his aides.",
    "Mr. Trump also is known to have tried to reach out to one senator as the certification of the vote was delayed.",
    "It is unknown whether the committee has specifically demanded records from Mr. Trump’s personal cellphone.",
    "It meant the White House call logs were often an incomplete reflection of his contacts.",
    "But many of the calls the committee is aware of did not show up in the official logs.",
    "Mr. Jordan has said he spoke with Mr. Trump multiple times that day.",
    "He was known to do the same on foreign trips, the people said.",
    "A spokesman for the committee declined to comment.",
    "It is unclear where Mr. Trump was at the time."
  ]
}