{
  "id": 606,
  "mediaId": 2642,
  "date": "2022-04-22",
  "headline": "GOP Just Came Out Swinging Against Twitter’s Woke Board…They’re Officially On Notice",
  "image": "https://waynedupree.com/wp-content/uploads/2022/04/twiiter-gop-demand-01.jpg",
  "link": "https://waynedupree.com/2022/04/gop-twitter-board-demands/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Missy Crane",
  "authorUrl": "https://waynedupree.com/author/missycrane/",
  "termIds": [
    1670,
    2343,
    2809,
    3116,
    3267,
    4787,
    878,
    1094,
    1161
  ],
  "sentences": [
    "“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter, led by Ranking Member Jim Jordan, R-Ohio.",
    "“You should construe this preservation notice as an instruction to take all reasonable steps to prevent the destruction or alteration, whether intentionally or negligently, of all documents, communications, and other information, including electronic information and metadata, that is or may be potentially responsive to this congressional inquiry,” the letter continued.",
    "In letters shared exclusively with CNBC, Republicans on the House Judiciary Committee asked Twitter Board Chairman Bret Taylor and other members of the board to preserve any messages from official or personal accounts, including through encryption software, that relate to Twitter’s consideration of Musk’s offer.",
    "The request signals that should Republicans take back the majority in the House in the 2022 midterm elections, they may launch an investigation into Twitter, especially if the company declines to take the offer from Musk, who’s CEO of Tesla and SpaceX.",
    "Another bombshell: Kevin McCarthy told other GOP leaders on Jan. 10, 2021 that he wished big tech companies would strip some of his own members of their social media accounts, as had been done with Trump, NYT's Jonathan Martin and Alex Burns report.",
    "CNBC reported that a group of 18 House Republicans is asking Twitter’s board to preserve all records related to Elon Musk’s offer to buy the company, setting up a potential congressional probe should the party win back the majority this fall.",
    "GOP leadership is now jumping into the fray, demanding that the Twitter board preserve all of their records regarding the offer Elon Musk made to buy Twitter… the one they rejected and used a “poison pill” on.",
    "#BREAKING: Judiciary Republicans send preservation notices to Twitter’s board members formally requesting that they preserve all records and materials relating to @elonmusk’s offer to purchase Twitter.",
    "Interesting that now GOP leadership is jumping into the Big Tech mix after it was discovered that Kevin McCarthy said on an audio recording that he hoped Big Tech censored some of his own people.",
    "pic.twitter.com/EqhOUpRdwP\n— House Judiciary GOP (@JudiciaryGOP) April 22, 2022\nIf we expect to make any ground on America First issues, we need to demand that our elected officials work for us.",
    "Under Republican control, the House Judiciary Committee could decide to subpoena records about the board’s internal deliberations.",
    "Otherwise, we’ll end up with 4 more years of “Trey Gowdy-ish” hearings, where there are a lot of soundbites but no action.",
    "I guess that was directed at America First politicians like Marjorie Taylor Greene, and Kevin got his wish, didn’t he?",
    "https://t.co/k17htA1zym\n— Axios (@axios) April 22, 2022\nThe man is a traitor, and he needs to go, NOW.",
    "We need to kick out the McCarthys and the McConnells and put in place America First leadership.",
    "It’s not the first time Twitter has caught the attention of Republican lawmakers.",
    "Promoted Content\nThings are heating up in the quest to Make Twitter Great Again.",
    "Enough with all the talk and no-action nonsense from years past."
  ]
}