{
  "id": 6134,
  "mediaId": 2646,
  "date": "2022-02-09",
  "headline": "GOP QUACKERY: Rep. Massie hooted down on social media for bogus Medicare attack",
  "image": "https://occupydemocrats.com/wp-content/uploads/massie-tweets-1024x576.jpg",
  "link": "https://occupydemocrats.com/2022/02/09/gop-quackery-rep-massie-hooted-down-on-social-media-for-bogus-medicare-attack/",
  "mediaOutlet": "occupydemocrats.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Vinnie Longobardo",
  "authorUrl": "https://occupydemocrats.com/author/vlongobardo/",
  "termIds": [
    0
  ],
  "sentences": [
    "Advertisement Above\nCongressman Thomas Massie (R-KY) may not yet have achieved the media ubiquity of other well-known extremist Republican legislators like Reps. Marjorie Taylor Greene (R-GA), Matt Gaetz (R-FL), or Jim Jordan (R-OH), but one look at his Twitter feed — filled with anti-mask and anti-vaccine rants with a sprinkling of calls for the elimination of sensible gun regulations — proves that he is just as doctrinaire as the rest of the right-wing GOP congressional mafia.",
    "Strom uttered a similar quote during a virulently antisemitic 1993 radio broadcast.”\nWhile tweeting quotes from neo-Nazis seems to be perfectly acceptable among Republican politicians these days, a new tweet from Rep. Massie is causing a commotion online because of its exceptionally poor grasp of the concept of causality.",
    "— 2024 DNC OPERATIVE (@NewDealFan) February 9, 2022\nhttps://twitter.com/whitehouse1550/status/1491460108123058176?s=20\nIf Congressman Massie continues to post tweets as ridiculous as his poorly envisioned post about COVID and Medicare, he may soon join the big leagues among the most insidious Republican lawmakers.",
    "Rep. Massie briefly made a splash on social media last month when he tweeted out this attack on Dr. Anthony Fauci, the Chief Medical Advisor to President Biden, that contained a meme featuring a quote falsely attributed to the 18th-century French philosopher, Voltaire.",
    "— Thomas Massie (@RepThomasMassie) February 9, 2022\nSponsored Links\nWhile I haven’t actually checked the statistics, we can be fairly certain that almost 100% of Americans who died with COVID, died with their heads still attached to their bodies.",
    "— Piyush Mittal (@piyushmittal) February 9, 2022\nhttps://twitter.com/HStarshot/status/1491455794940100611?s=20\nThousands of people die from drunk drivers a year and get some people still want drivers’ licenses????!!!!",
    "Let’s hope that the people of Kentucky come to their senses and vote Massie out of office in the mid-terms to restore some semblance of sanity and intelligence to their congressional delegation.",
    "— Ody: Free Man, Fierce Patriot, Pleasant Sadist (@BlueStarCaptain) February 9, 2022\nSo, because many people who died of Covid were over 65, you are making the correlation that Medicare kills?",
    "— Thomas Massie (@RepThomasMassie) January 30, 2022\nUnfortunately for Massie, as CNN fact-checker Daniel Dale set him straight:\n“There is no record of Voltaire ever uttering these words.",
    "Sponsored Links\nHere’s what Massie posted on Twitter this morning:\nSponsored Links\nOver 70% of Americans who died with COVID, died on Medicare, and some people want #MedicareForAll ?",
    "(@Leslieoo7) February 9, 2022\nOver 70% of Americans who died with COVID were taken to hospital in a gas powered vehicle; switching to EVs would ensure no one dies from COVID.",
    "pic.twitter.com/WwUOad1v57\n— Molly Jong-Fast (@MollyJongFast) February 9, 2022\n100% of Americans who died with COVID breathe oxygen, and some people want to keep breathing?",
    "The quote is commonly attributed to Kevin Alfred Strom, a neo-Nazi who pleaded guilty in 2008 to possession of child pornography.",
    "https://t.co/jQZ3QCcZTX\n— Josh Chafetz (@joshchafetz) February 9, 2022\nAlso 100% of people on Medicare eventually die.",
    "— Rachel Larris (@RachelLarris) February 9, 2022\nWhich is remarkable, considering the competition for that title.",
    "They’d clearly have been better off if they had just gone to a feed store and load it up on ivermectin.",
    "Congressman Massie’s faulty logic naturally garnered its share of snarky responses on social media.",
    "Somehow that fact has not led to a rush of people attempting to sever their heads.",
    "Add your name to call on prosecutors to ARREST DONALD TRUMP for his crimes!",
    "Scroll down and let us know in our comment section!",
    "Yes, obviously medicine is what killed them.",
    "We want to hear what YOU have to say.",
    "Advertisements",
    "— Leslieoo7 ?"
  ]
}