{
  "id": 6148,
  "mediaId": 2699,
  "date": "2022-02-08",
  "headline": "GOP Rep. Claims Capitol Police Secretly Broke Into His Office",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2807,w_4990,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1644342129/GettyImages-1329931281_itjpnp",
  "link": "https://www.thedailybeast.com/gop-rep-troy-nehls-claims-capitol-police-secretly-broke-into-his-office?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Roger Sollenberger",
  "authorUrl": "https://www.thedailybeast.com/author/roger-sollenberger",
  "termIds": [
    1670,
    2599,
    3704,
    3712,
    878,
    1123,
    1163
  ],
  "sentences": [
    "— Congressman Troy Nehls (@RepTroyNehls) February 8, 2022\nNehls, who characterized the entries as “illegally” executed and unconstitutional, said the officers had interrogated the staffer about the photos but did not disclose details about what the police had photographed, or what they asked the staffer.",
    "Manger said no case investigation was ever initiated or conducted into Nehls or his staff, and he suggested that police had not broken into the office, but entered in the course of duty having found it left “open and unsecured.”\n“The United States Capitol Police is sworn to protect Members of Congress.",
    "The back and forth started Tuesday morning when Nehls attacked Capitol Police on Twitter, appearing to possibly be softening the ground for whatever may be coming down the pike by castigating investigators for secretly entering his office nearly three months ago.",
    "Nehls added that, two days later—when most members and staff had cleared out for Thanksgiving recess—three officers with the Capitol Police intelligence division returned to his office, “dressed like construction workers,” only to find a staffer in the room.",
    "“Why is the Capitol Police Leadership maliciously investigating me in an attempt to destroy me and my character?” Nehls wrote on Twitter, a claim that Capitol Police leadership immediately contradicted, saying that no case investigation was ever opened.",
    "If a Member’s office is left open and unsecured, without anyone inside the office, USCP officers are directed to document that and secure the office to ensure nobody can wander in and steal or do anything else nefarious,” the statement said.",
    "The tweets came two days after Axios reported that a Jan. 6 “shadow” committee, featuring Nehls, an election objector and former sheriff, was investigating Capitol Police “negligence” in response to the Jan. 6 attack on the U.S. Capitol.",
    "Nehls speculated it was because he had criticized House Speaker Nancy Pelosi, the select committee investigating the events surrounding Jan. 6, and the Capitol Police themselves—specifically about the shooting death of Ashli Babbitt.",
    "The same morning Nehls posted his tweet storm, fellow Texas Republican Louie Gohmert took to the House floor to announce—also without evidence—that the Department of Justice had “examined” congressional mail five months ago.",
    "The statement explained that Capitol Police entered after an agent noticed that the office had been left “wide open.” After police followed up with the office, Manger said, the department decided not to take further action.",
    "After Pelosi rejected his choices, citing the fact that they were a mix of election objectors and members who rejected the idea of a congressional panel to begin with, the crew opened their own unauthorized shadow probe.",
    "The only explanation Gohmert offered in the statement was that congressional mail \"is somehow being co-mingled\" with DOJ mail, despite the two institutions having \"completely different proprietary zip codes.\"",
    "One came in Sept. 17 stamped by the Department as being received and reviewed and examined, and another from a Christian missionary to me, and it was reviewed by the Department of Justice,” Gohmert claimed.",
    "\"Even if it were a mistake to deliver Congress’ mail to the DOJ, the DOJ has an obligation to immediately notify Congress and forward the mail without opening it,\" Gohmert said in his statement.",
    "Nehls has since turned on the police, however, most specifically making a public show of questioning the legality of Babbitt’s shooting, which an internal investigation found was justified.",
    "In July, House Majority Leader Kevin McCarthy nominated Nehls to the Jan. 6 committee, along with Reps. Jim Jordan (R-OH), Rodney Davis (R-IL), Kelly Armstrong (R-ND), and Jim Banks (R-IN).",
    "The two congressmen broke off pieces of wood and stood shoulder to shoulder with officers, who had their guns drawn as Trump supporters pounded on the front doors to the House chamber.",
    "The office did not reply when asked whether the mail had been originally addressed to Gohmert's office or to another mailbox, perhaps one affiliated with the Justice Department.",
    "Asked to explain this unsubstantiated, bizarre, and apparently anachronistic claim, Gohmert's office pointed The Daily Beast to a press release published later that day.",
    "The statement revealed that the letters in question had first passed through the DOJ mailroom, and were stamped with that information, along with an undisclosed date.",
    "It began, he said, on Nov. 20, when officers secretly entered his office and took pictures of “confidential legislative products.”\nBut that wasn’t the end.",
    "Nehls had been aware of the incursions almost the entire time because, according to his account, police botched one of the supposedly clandestine entries.",
    "In late October, The Daily Beast reported that Banks had sent letters out to a number of government agencies requesting information about the attack.",
    "According to Nehls, who has attacked the Capitol Police response to the Jan. 6 riot, the agency opened a “malicious investigation” into his office.",
    "The full list of agencies he contacted is unknown, but many were reportedly the same departments contacted by the Jan. 6 select panel.",
    "Capitol Police almost immediately fired back and said there was never any investigation and Nehls' version of events was wrong.",
    "He took up arms alongside Capitol Police and Rep. Markwayne Mullin (R-OK) to face down rioters attempting to breach the House.",
    "The @CapitolPolice Intelligence Division investigated my office illegally and one of my staffers caught them in the act.",
    "The police, he added, have never told him—nor, he specified, his “senior level staff”—why they were investigating him.",
    "Troy Nehls (R-TX) claimed on Tuesday that he was the subject of a Capitol Police intelligence investigation.",
    "In an eyebrow-raising series of tweets that read like a paperback political thriller, Rep.",
    "Capitol Police Chief Tom Manger quickly issued a statement refuting Nehls' claims.",
    "Nehls' office did not immediately respond to a request for comment.",
    "“We have seen that our mail—we’ve got two mail just a day apart.",
    "But he only disclosed the alleged break-in now.",
    "But on Jan. 6, Nehls had a different reaction.",
    "??BREAKING??",
    "Thread??"
  ]
}