{
  "id": 6150,
  "mediaId": 2744,
  "date": "2022-02-10",
  "headline": "GOP: FBI ‘refusing to accept accountability’ for enforcing DOJ school boards memo",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/5d20394/2147483647/strip/true/crop/5126x2691+0+363/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F5b%2F2e%2F9a78618e4f19912530cc83a719a5%2Fap22010162470225.jpg",
  "link": "https://www.washingtonexaminer.com/news/gop-fbi-refusing-to-accept-accountability-for-enforcing-doj-school-boards-memo",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerry Dunleavy",
  "authorUrl": "https://www.washingtonexaminer.com/author/jerry-dunleavy",
  "termIds": [
    1670,
    1934,
    2780,
    370,
    878,
    1132,
    1161
  ],
  "sentences": [
    "Jordan and the others wrote on Thursday that the Biden administration \"coordinated\" with the National School Boards Association \"to develop a pretext\" for Garland \"to direct federal law enforcement resources, including the FBI, to investigate concerned parents at school board meetings.”\nThe GOP members’ outrage stems from a brief note Jill Tyson, the assistant director of the FBI’s Office of Congressional Affairs, sent defending Garland’s controversial memo and the FBI’s actions in late January, largely dodging the detailed questions that House Republicans had repeatedly posed to the bureau for months by saying officials were \"not in a position to provide internal documents or communications between the Department of Justice and the FBI.\"",
    "The Republicans said in their Thursday letter that Langan “later testified to the House Intelligence Committee that the FBI also discussed the Attorney General’s directive with the Justice Department prior to its issuance.”\nGarland's early October 2021 school boards directive was released a few days after the NSBA argued to President Joe Biden in reference to parental anger at school board meetings that “the classification of these heinous actions could be the equivalent to a form of domestic terrorism and hate crimes” and called upon the DOJ to review whether the Patriot Act “in regards to domestic terrorism” could be deployed.",
    "Garland wouldn't distance himself from his memo calling for the use of counterterrorism tactics to investigate parents that Republicans said he advocated, arguing in Senate testimony last year that the NSBA’s apology “does not change the association’s concern about violence and threats of violence.” During questioning by Jordan, the Biden attorney general admitted that the NSBA’s letter was a \"relevant factor\" in his memo, though he alluded to critics' concerns in testifying, “I can’t imagine any circumstance in which the Patriot Act would be used in the circumstances of parents complaining about their children.\"",
    "The House Republicans reiterated in their Thursday letter the more than a dozen questions they have posed to the FBI, including asking for all documents related to the FBI’s role as a member of the DOJ’s task force, for all agendas and meeting notes created by the FBI when implementing Garland’s directive, for what actions the FBI has taken tied to investigating protesting parents, for details on the FBI’s use of the “EDUOFFICIALS” threat tag, and for all communications related to FBI investigations of school board threats.",
    "To open an FBI investigation, there must be information indicating potential violence or use of force and a potential violation of federal law.”\nBut in November of last year, House Republicans said an FBI whistleblower email showed the agency was using \"counterterrorism tools\" to monitor threats against school board members and teachers, which the GOP says conflicts with testimony by Garland.",
    "GOP Rep. Jim Jordan, who serves as ranking member on the House Judiciary Committee, and 17 fellow Republicans sent a Thursday letter obtained by the Washington Examiner to FBI Director Christopher Wray blasting the bureau for not sufficiently answering months of questions despite significant pressure from congressional Republicans.",
    "But the FBI seemed to take a different approach, with Jill Sanborn, the executive assistant director of the FBI’s National Security Branch, apparently distancing the bureau from the controversial Biden DOJ initiative during Senate testimony last month, claiming it is \"not a particular focus for the counterterrorism division.\"",
    "\"We received the Federal Bureau of Investigation's half-page response to our serious concerns about the FBI’s use of counterterrorism resources — as evidenced by documents provided to us by a whistleblower — to target concerned parents at local school board meetings,\" the GOP members said.",
    "\"The Attorney General’s Memorandum underscores the FBI’s ongoing efforts to assist state, local, and federal partners to address violence and threats of violence, regardless of the motivation.”\nTyson added: “The FBI is not in the business of policing speech at school board meetings.",
    "Republicans' assertions were seemingly backed by one late October email, signed by Timothy Langan, the FBI’s assistant director for counterterrorism, saying the Counterterrorism Division and Criminal Division had created a \"threat tag\" for FBI officials to use.",
    "House Republicans argue the FBI is stonewalling and “refusing to accept accountability” for its role in enforcing Attorney General Merrick Garland’s divisive school board memo siccing law enforcement officers on angry parents at school board meetings.",
    "“The FBI is fully committed to preserving and protecting First Amendment rights, including freedom of speech,” Tyson wrote in a cursory letter the FBI sent after prodding from Republicans, which was also obtained by the Washington Examiner.",
    "Later that month, Garland revealed that the DOJ and the White House communicated about the NSBA letter before he issued his memo, and emails from the NSBA showed it was in touch with the White House prior to publication.",
    "Your response regrettably highlights the FBI’s pattern of refusing to accept accountability for its actions and explains why public trust in the FBI’s senior leadership has eroded so significantly.\"",
    "The email directed bureau agents to tag threats as “EDUOFFICIALS” and to \"attempt to identify\" whether there are \"federal violations that can be investigated and charged.\"",
    "Jordan and his colleagues said they remain “committed to fully examining the FBI’s use of counterterrorism resources in relation to school board meetings.\"",
    "The NSBA ended up withdrawing and apologizing for the letter after Garland’s House testimony that same month.",
    "\"Your response declined to answer in detail any questions we posed or to provide any documents we sought.",
    "Rather, the FBI’s focus is on violence and threats of violence."
  ]
}