{
  "id": 6199,
  "mediaId": 2735,
  "date": "2022-02-03",
  "headline": "At Least 46 Congress Members Have Visited Trump Properties Since He Left Office",
  "image": "https://truthout.org/wp-content/uploads/2022/02/2022_0203-donald-trump-tower-1200x675.jpg",
  "link": "https://truthout.org/articles/at-least-46-congress-members-have-visited-trump-properties-since-he-left-office/",
  "mediaOutlet": "Truthout",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sharon Zhang",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Investigations into Trump’s finances, however, have found that his businesses often inflate profits in order to seem more successful than they are; in recent court filings, New York State Attorney General Letitia James found that Trump’s family business has repeatedly engaged in “fraudulent or misleading” practices in order to make Trump’s net worth appear larger.",
    "Trump’s guest list also features Republican firebrands and Trump allies like Sen. Ted Cruz (Texas) and Mo Brooks (Alabama), along with Representatives Jim Banks (Indiana) and Jim Jordan (Ohio), who were both rejected from serving on the January 6 House committee due to their closeness to Trump and the attack.",
    "After House Minority Leader Kevin McCarthy (R-California) said on the House floor that Trump shared responsibility for the January 6 attack on the Capitol, he took a trip to Mar-a-Lago to reconcile with the president, who left office shortly before the visit.",
    "Trump’s camp releases this photo from his meeting with McCarthy today pic.twitter.com/uJaA2FN5a0\n— Manu Raju (@mkraju) January 28, 2021\nHouse Minority Whip Steve Scalise (R-Louisiana) also visited Mar-a-Lago after the attack on the Capitol.",
    "Even though former President Donald Trump has been out of office for over a year now, he is still profiting off of the presidency as dozens of lawmakers and candidates continue to patronize his businesses, according to a new report.",
    "A report by the Citizens for Responsibility and Ethics in Washington, or CREW, has found that at least 46 members of Congress and 77 candidates for office have visited one of Trump’s properties since Trump left office last year.",
    "Public officials and candidates for public office have visited one of Trump’s hotels, resorts or golf clubs at least 235 times and held 51 events in total over the past year, the report found.",
    "Visits to Trump’s properties aren’t just a way for lawmakers to gain political clout – they’re also a method of restoring a relationship with the former president, even for other GOP leaders.",
    "Far right lawmakers top the list; Rep. Madison Cawthorn (R-North Carolina) has had 10 visits while Sen. Lindsey Graham (R-South Carolina) has had nine.",
    "These visits can, quite literally, buy influence with the former president, whose approval is still important in many far right political circles.",
    "“These visits bring more than just profit to the for-profit kingmaker of the Republican Party, they bring an alternate reality,” CREW wrote.",
    "Many of Trump’s top customers are the same people most involved in spreading it.”\nGet the news you want, delivered to your inbox every day.",
    "Though it’s unclear how much money Trump has made off of his presidency since he left office, it’s likely been a huge boon to his profits.",
    "Representatives Matt Gaetz (R-Florida), Lauren Boebert (R-Colorado) and Marjorie Taylor Greene (R-Georgia) trail closely behind.",
    "Last year, CREW found that Trump reported making over $1.6 billion in revenue from outside sources while he was president.",
    "Most visits are to Mar-a-Lago, where Trump currently resides for much of the year – just as he did when he was president.",
    "These visits and events, where Trump is often present and frequently gives remarks, perpetuate that false belief.",
    "Visitors include 11 senators and 35 House representatives, who have visited Trump’s properties 119 times.",
    "Trump’s team then released a picture of the two of them together.",
    "“At Mar-a-Lago, Trump won in 2020."
  ]
}