{
  "id": 6236,
  "mediaId": 2679,
  "date": "2022-02-05",
  "headline": "In scrutinizing Trump, Jan. 6 panel adopts prosecution tactics",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/nation-politics/in-scrutinizing-trump-jan-6-panel-adopts-prosecution-tactics/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luke Broadwater",
  "authorUrl": "https://www.seattletimes.com/author/cap-luke-broadwater/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Having lived through and being a part of every major congressional investigation over the past 50 years, from Iran-Contra to Whitewater to everything else, this is the mother of all investigations and a quantum leap for Congress in a way I’ve never seen before,” said Stanley Brand, a Democrat and the former top lawyer for the House who is now representing Dan Scavino, one of Trump’s closest aides, in the investigation.",
    "Four of the panel’s most sought-after targets — conservative lawyer John Eastman; Jeffrey Clark, a Justice Department lawyer deeply involved in Trump’s plays to try to stay in power; conspiracy theorist Alex Jones; and longtime Trump adviser Roger Stone — invoked the Fifth Amendment as a way to avoid answering questions without the threat of a contempt of Congress charge.",
    "But, he said, “If you drew some kind of social diagrams of who’s testifying and who’s not, pretty much everyone is testifying, except for those who are in the immediate entourage of Donald Trump.”\nAmong the other aides who have testified before the committee are Marc Short, Greg Jacob and Keith Kellogg, all of whom worked for former Vice President Mike Pence.",
    "The House select committee scrutinizing the Jan. 6 assault on the Capitol is borrowing techniques from federal prosecutions, employing aggressive tactics typically used against mobsters and terrorists as it seeks to break through stonewalling from former President Donald Trump and his allies and develop evidence that could prompt a criminal case.",
    "In what its members see as the best opportunity to hold Trump and his team accountable, the committee — which has no authority to pursue criminal charges — is using what powers it has in expansive ways in hopes of pressuring Attorney General Merrick Garland to use the Justice Department to investigate and prosecute them.",
    "Advertising\n Skip Ad\nAs the House investigation was gaining momentum late last year, the committee’s vice chair, Rep. Liz Cheney, R-Wyo., read from the criminal code to describe a law she believed could be used to prosecute Trump for obstructing Congress as it sought to certify the Electoral College count of his defeat.",
    "Advertising\n Skip AdSkip AdSkip Ad\n“It’s not a criminal investigation, but having experienced former prosecutors who know how to run complex, white-collar investigations working on a plot to overturn the presidential election is a very useful talent among your team,” said Rep. Adam Schiff, D-Calif., a committee member.",
    "Faced with at least 16 Trump allies who have signaled that they will not fully cooperate with the committee, investigators have taken a page out of organized crime prosecutions and quietly turned at least six lower-level Trump staff members into witnesses who have provided information about their bosses’ activities.",
    "Just wait if the Republicans take over.”\nThe committee’s aggressive approach carries with it another obvious risk: that it could fail to turn up compelling new information about Trump’s efforts to hold on to power after his defeat or to make a convincing case for a Justice Department prosecution.",
    "Trump’s allies have grown angry not just at the aggressiveness of the committee — for example, in making subpoenas public before they have been served — but also at the expansive list of people questioned, some of whom, these allies maintain, had minimal to no involvement in the events of Jan. 6.",
    "Investigators also sought a broad swath of phone records from Ali Alexander, a right-wing rally organizer who was cooperating with the committee, for two months before Jan. 6, 2021 — well before he claims to have thought of planning an event that day — and for one month after.",
    "By comparison, the House select committee that spent 2 1/2 years investigating the 2012 attack in Benghazi, Libya, issued a dozen or so subpoenas — a small fraction of the number issued by the Jan. 6 committee so far — and made no criminal referrals.",
    "Despite those obstacles, the committee turned its attention to lower-level aides, who investigators knew were in the room for many of the key events that occurred before and during the assault or were told almost immediately about what had occurred.",
    "Advertising\n Skip AdSkip AdSkip Ad\nThe committee is also considering granting immunity to key members of Trump’s inner circle who have invoked their Fifth Amendment right against self-incrimination as a way of pressuring them to testify.",
    "Cheney and the committee’s chair, Rep. Bennie Thompson, D-Miss., also hired John Wood, a former U.S. attorney for the Western District of Missouri and a former deputy associate attorney general in the George W. Bush administration.",
    "She said that the panel would face significant resistance from Trump’s inner circle and that the committee would be criticized no matter what it did, so there was no reason to hold back in the face of efforts to impede its work.",
    "Armed with reams of telephone records and metadata, the committee has used link analysis, a data-mapping technique that former FBI agents say was key to identifying terrorist networks in the years after the Sept. 11 attacks.",
    "Although no subpoena has been issued for Jordan, his text messages and calls have shown up in communications with Mark Meadows, a former White House chief of staff, and in a call with Trump on the morning of Jan. 6, 2021.",
    "The committee has no law enforcement role, and its stated goal is to write a comprehensive report and propose recommendations, including for legislation, to try to make sure the events of Jan. 6 are never repeated.",
    "Three Republican members of Congress — Rep. Kevin McCarthy of California, the House minority leader; Rep. Scott Perry of Pennsylvania; and Jordan — told the committee that they would refuse to sit for questioning.",
    "Most Read Nation & World Stories\nSome of the Democrats on the committee were concerned that if the panel was too aggressive, Republicans might turn the tables on Democrats if they took back control of the House.",
    "The Jan. 6 panel has already recommended criminal contempt of Congress charges against three witnesses who refused to cooperate, and one, Steve Bannon, has already been indicted by the Justice Department.",
    "The tactics being used by the committee were described by nearly a dozen people, including members of the committee, aides, witnesses and their lawyers, and other people familiar with the panel’s work.",
    "Members of the Jan. 6 committee say the obstacles thrown up by Trump and his allies and the high stakes of the investigation have left the panel with no choice but to use every tool at its disposal.",
    "Such a step could put considerable additional pressure on Garland, who has not given any specific public indication that the department is investigating Trump or would support prosecuting him.",
    "“They were polite, but they were dogged.”\nEven though Jones refused to share information with the committee, he said the investigators seemed to have found ways around his lack of cooperation.",
    "Cheney and the other Republican on the committee, Rep. Adam Kinzinger of Illinois, were censured by the Republican National Committee on Friday for their participation in the investigation.",
    "A federal judge turned down an emergency request by Budowich to force congressional investigators to relinquish his banking records, which JPMorgan Chase had already given to the committee.",
    "When Meadows, the former White House chief of staff, refused to testify, the panel turned to his top aide, Ben Williamson, who complied with a subpoena and sat for hours of questioning.",
    "Trump moved to block the National Archives from handing over documents from his White House, leading to a monthslong court fight that ended with the committee receiving the documents.",
    "In that position, he oversaw a number of high-profile prosecutions, including one in which drugmaker Abbott Laboratories pleaded guilty in a fraud case and paid a $1.5 billion fine.",
    "Nevertheless, its members have openly discussed what criminal laws Trump and his allies may have violated and how they might recommend that the Justice Department investigate him.",
    "The committee has interviewed more than 475 witnesses and issued more than 100 subpoenas, including broad ones to banks as well as telecommunications and social media companies.",
    "Some of the subpoenas have swept up the personal data of Trump family members and allies, local politicians and at least one member of Congress, Rep. Jim Jordan, R-Ohio.",
    "After Clark, the Justice Department lawyer, refused to cooperate, a former senior counsel who worked for him, Kenneth Klukowski, sat for an interview with the committee.",
    "The panel’s investigation is being run by a former U.S. attorney, and the top investigator brought in to focus on Trump’s inner circle is also a former U.S. attorney.",
    "Rep. Jamie Raskin, D-Md., a member of the panel, said the committee was not trying to “flip” witnesses the way investigators might do in a criminal case.",
    "Many spoke on the condition of anonymity because they did not want to be identified discussing what the committee says is a confidential investigation.",
    "“They have everything that’s already on my phones and things,” Jones said; “I saw my text messages” with political organizers tied to the Jan. 6 rally.",
    "Advertising\n Skip Ad\nThe committee’s investigative work related to Trump’s current spokesperson illustrates the aggressive steps the panel is taking.",
    "He later said on his radio show that in the interview he had invoked his Fifth Amendment privilege against self-incrimination nearly 100 times.",
    "Shortly after testifying, Budowich learned that the committee had requested financial records from his bank related to pro-Trump rallies.",
    "Those witnesses tended to be younger and have far less money to hire high-end white-collar defense lawyers to fend off the committee.",
    "The spokesperson, Taylor Budowich, turned over more than 1,700 pages of documents and sat for roughly four hours of sworn testimony.",
    "The FBI said it used a similar tactic last month to identify the seller of a gun to a man in Texas who took hostages at a synagogue.",
    "Despite a swirl of new investigations since he left office, the former president remains the dominant force in Republican politics.",
    "Trump survived years of scrutiny by the special counsel in the Russia investigation, Robert Mueller, and two impeachments.",
    "Sponsored\n Skip Ad\n Skip Ad\n Skip Ad\n Skip Ad\nAt least 16 witnesses have sued to try to block the committee’s subpoenas.",
    "Three former spokespeople for Trump have also cooperated: Kayleigh McEnany, Stephanie Grisham and Alyssa Farah Griffin.",
    "To lead the inquiry, the panel hired Timothy J. Heaphy, a former U.S. attorney for the Western District of Virginia.",
    "Jones, the conspiracy theorist, who has sued the committee, was questioned by investigators in a virtual interview.",
    "So far, the committee has spoken to at least a half-dozen lower-level aides who fall into this category.",
    "“I just had a very intense experience being interrogated by the Jan. 6 committee lawyers,” he said.",
    "He is a senior investigative counsel for the committee and is focusing on Trump’s inner circle.",
    "“They think they’re fighting for the survival of the democracy and the ends justify the means.",
    "It is a development, Brand suggested, that Democrats might one day come to regret.",
    "Neither Heaphy nor Wood had previously worked on a congressional investigation.",
    "Late last month, another example of the panel’s investigative approach emerged.",
    "The panel has hired more than a dozen other former federal prosecutors.",
    "But Cheney insisted that the committee be as aggressive as possible.",
    "He said the committee had already obtained text messages from him.",
    "“When a frontier is pushed back, it doesn’t recede,” he said.",
    "This story was originally published at nytimes.com.",
    "Read it here."
  ]
}