{
  "id": 6333,
  "mediaId": 2523,
  "date": "2022-02-04",
  "headline": "Pence: ‘Trump is wrong. I had no right to overturn the election’",
  "image": "https://www.dailynews.com/wp-content/uploads/2022/02/sjm-chment_24506.jpg-65d6b_1045595508-1045600563_82062260.jpg?w=1024&h=580",
  "link": "https://www.dailynews.com/2022/02/04/pence-trump-is-wrong-in-saying-vp-could-overturn-election/",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "https://www.dailynews.com/author/apress/",
  "termIds": [
    2201,
    2906,
    3975,
    4977
  ],
  "sentences": [
    "In a statement Tuesday, Trump said the committee investigating the deadly Jan. 6 attack on the Capitol should instead probe “why Mike Pence did not send back the votes for recertification or approval.” And on Sunday, he blasted Pence, falsely declaring that “he could have overturned the Election!”\nVice presidents play only a ceremonial role in the the counting of Electoral College votes, and any attempt to interfere in the count would have represented a profound break from precedent and democratic norms.",
    "By Jill Colvin | Associated Press\nFormer Vice President Mike Pence on Friday directly rebutted Donald Trump’s false claims that Pence somehow could have overturned the results of the 2020 election, saying that the former president was simply “wrong.”\nIn a speech to the conservative Federalist Society in Florida, Pence addressed Trump’s intensifying efforts this week to advance the false narrative that he could have done something to prevent Joe Biden from taking office.",
    "“I had no right to overturn the election.”\nWhile Pence in the past has defended his actions on Jan. 6 and said that he and Trump will likely never see “eye to eye” on what happened that day, the remarks Friday marked his most forceful rebuttal of Trump to date.",
    "And they come as Pence has been laying the groundwork for a potential run for president in 2024, which could put him in direct competition with his former boss, who has also been teasing a comeback run.",
    "“President Trump is wrong,” Pence said."
  ]
}