{
  "id": 6394,
  "mediaId": 2636,
  "date": "2022-01-20",
  "headline": "After Jan. 6, Sean Hannity Advised Trump: ‘No More Stolen Election Talk’",
  "image": "https://static01.nyt.com/images/2022/01/20/business/20hannity-texts/merlin_146393001_b4a8bd41-8261-4c23-b7e4-c1dc47ca40b4-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/01/20/business/media/sean-hannity-donald-trump-january-6.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2202,
    3750,
    4109,
    404
  ],
  "sentences": [
    "After urging Ms. McEnany to avoid discussion of a “stolen election,” Mr. Hannity proffered another talking point to use with Mr. Trump: “Yes, impeachment and 25th amendment are real, and many people will quit …”\nMr. Hannity appeared to be referring to the possibilities that Mr. Trump could be impeached, face mass resignations from his staff or be temporarily removed from office by a group of his cabinet secretaries invoking the 25th Amendment.",
    "One day after the attack, Mr. Hannity sent a text message to Kayleigh McEnany, then the White House press secretary, describing a five-point plan for approaching conversations with the president, according to documents released by the House committee investigating the Jan. 6 riot.",
    "But documents disclosed on Thursday showed in vivid detail just how closely Mr. Hannity had worked with White House aides in a fervent, if brief, effort to persuade Mr. Trump to abandon his false claims about voter fraud after the Jan. 6 attack on the Capitol.",
    "But their private exchanges show the level of alarm among even the president’s closest allies after the Jan. 6 riot, as Mr. Trump persisted in his false claims that the election had been stolen from him and his political future appeared deeply precarious.",
    "Ms. McEnany replied: “Yes 100%.”\nThis month, the House committee asked Mr. Hannity to cooperate and answer questions about his communications with Mr. Trump and his aides in the days surrounding the riot.",
    "A lawyer for Mr. Hannity, Jay Sekulow, has said the committee’s request to interview Mr. Hannity raises “First Amendment concerns regarding freedom of the press.”\nLuke Broadwater contributed reporting.",
    "The committee is seeking Ms. Trump’s cooperation as it tries to piece together a scramble inside the White House to persuade Mr. Trump to denounce the attackers at the Capitol.",
    "At the time, the committee disclosed messages in which Mr. Hannity advised Mark Meadows, then the White House chief of staff, on the president’s political future.",
    "The Fox News host Sean Hannity had some blunt advice for President Donald J. Trump on Jan. 7, 2021: “No more stolen election talk.”\nHis guidance did not take.",
    "I will help reinforce.”\nFox News, where Ms. McEnany is now a commentator and a co-host of a weekday program, declined to comment on Thursday.",
    "The exchanges were included in a letter sent by the House committee to Ivanka Trump, Mr. Trump’s daughter and one of his senior advisers.",
    "In another exchange included in the letter, Mr. Hannity urged Ms. McEnany to keep the president away from certain advisers.",
    "Ever,” Mr. Hannity wrote on Jan. 10, 2021, to Mr. Meadows and Representative Jim Jordan, an Ohio Republican.",
    "In public, Mr. Hannity and Ms. McEnany remain lock-step supporters of Mr. Trump and his worldview.",
    "No more crazy people,” Mr. Hannity wrote.",
    "“He can’t mention the election again.",
    "Ms. McEnany replied: “Love that.",
    "That is the playbook.",
    "Thank you.",
    "“Key now."
  ]
}