{
  "id": 6439,
  "mediaId": 2658,
  "date": "2022-01-10",
  "headline": "POLITICO Playbook: Biden faces his moment on the filibuster",
  "image": "https://static.politico.com/eb/28/85c444794a3c8b6494941aee4e13/220110-biden-getty-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/01/10/biden-faces-his-moment-on-the-filibuster-495658",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1951,
    2371,
    3975,
    4466,
    95,
    301,
    831,
    1171,
    4840
  ],
  "sentences": [
    "On Sunday night, Senate Minority Leader MITCH MCCONNELL’s office sent a memo to reporters blasting Democrats for what they’re dubbing “the left’s Big Lie”: the claim “that there is some evil anti-voting conspiracy sweeping America.” The GOP leader is trying to dispel the notion that the fundamental right to vote is in jeopardy, arguing that Democrats are whipping up “fake hysteria to break the Senate … and ram through their radical agenda.”\nAmong other points that we’re sure we’ll hear more about this week, McConnell argues that the last presidential election saw the most voter turnout since 1900; some polls show more Americans think current voting rules should be stricter than those who say it’s too hard to vote; and warnings of “Jim Crow 2.0” are insulting to the American public, which knows it’s already illegal to prevent people from voting based on their race.",
    "The emails, texts and phone recordings also add consequential context to previously reported incidents, such as Trump’s call to Georgia's top elections investigator and MARK MEADOWS’ outreach to Georgia election officials.”\nAMERICA AND THE WORLD\nBIG WEEK FOR U.S.-RUSSIA RELATIONSHIP — Talks between Russia and the U.S. are set to begin Monday, and the discussions “could shape the future of not only their relationship but the relationship between the U.S. and its NATO allies.” AP’s Matthew Lee puts it bluntly: “Prospects are bleak.”\n“Though the immediacy of the threat of a Russian invasion of Ukraine will top the agenda, there is a litany of festering but largely unrelated disputes, ranging from arms control to cybercrime and diplomatic issues, for Washington and Moscow to overcome if tensions are to ease.",
    "… former Reps. Greg Walden (R-Ore.), Bill Shuster (R-Pa.) and Lois Capps (D-Calif.) … Blake Adami … Nat Wienecke … The Spectator’s Freddy Gray … Adam Weissmann … Caroline Hakes of Targeted Victory … Liesl Hickey of Ascent Media … Morgan Finkelstein … Ryan Dierker … Vaughn Ververs … Joseph Petrzelka … The Hill’s Julia Manchester … Samuel Negatu … Liz Chadderdon … Alyssa Lattner of Latham & Watkins … Jared Kushner … Hugh Livengood … Aaron Buchner … David Horowitz … Stacy Hawkins Adams … Myranda Tanck … Blake Hopper … Jessica Mudditt … Ajit Pai … Esther Whieldon … AnnMaura Connolly\nDid someone forward this email to you?",
    "For example, when White House press secretary JEN PSAKI was asked last week to respond to Republicans saying it was a “big lie” that the party is making it harder for people to vote, she ticked off seven examples and five of them were about potential election subversion after the votes have been counted, not making it harder to vote beforehand (canvassing boards being stacked with supporters of the Big Lie in Michigan, legislature interference with the state board of elections in Georgia, and GOP “audits” of 2020 election results in Arizona, Pennsylvania and Wisconsin).",
    "More details from Nicholas Wu and Kyle Cheney\n— Nick also reports that the committee’s investigation is extending far beyond Washington: The panel has “gathered thousands of records from state officials and interviewed a slate of witnesses as it attempts to retrace Trump’s attempts to subvert the 2020 election, particularly in four key states that swung the presidency to Biden.”\nThe documents sent to the committee, obtained by POLITICO, “underscore the depth of Trump’s pressure campaign directed at the typically lower-level administrators of presidential balloting.",
    "Now, they say, it is time for Mr. Biden to focus not only on his own achievements, but also on how the Republican Party threatens to reverse those efforts if it returns to power on Capitol Hill — something that has not been at the center of his presidency so far.”\nJAN. 6 AND ITS AFTERMATH\nJORDAN SNUBS JAN. 6 PANEL — Rep. JIM JORDAN (R-Ohio) is refusing the Jan. 6 committee’s request for an interview, calling the ask an “unprecedented and inappropriate demand.”\nIn a letter to Chair BENNIE THOMPSON (D-Miss.)",
    "Labor unions representing teachers, health care workers and airline staff say governments aren’t providing enough tests and masks and that leaders should consider short-term closures until the Omicron surge ends.”\nBEYOND THE BELTWAY\nCHICAGO SCHOOLS REMAIN CLOSED — Chicago public schools will remain closed Monday, “the fourth-straight academic day, as it failed to reach a deal with the local teachers’ union over demands for more measures to prevent the spread of Covid-19,” Bloomberg’s Shruti Singh reports.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nTHE WHITE HOUSE\nBIDEN CHANGES HIS TONE — With his agenda stalled in Congress, Biden has adopted a more aggressive tone to start his second year in office, “lashing out at Republicans, embracing forceful new attacks meant to define a choice for voters between Biden’s Democrats and a Republican Party still under the thumb of [DONALD] TRUMP,” NYT’s Michael Shear writes.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Via NBC: “The couple had an intimate wedding ceremony in Cartagena, Colombia, after postponing their original ceremony in May 2020 due to the pandemic.” Pic\n— Mary Claire Couch, director of development at Heritage Action for America, and Peter Barnes, director of caucuses at the Republican State Leadership Committee, got married Saturday in her hometown of Louisville, Ky.",
    "on Sunday evening, Jordan wrote: “Your attempt to pry into the deliberative process informing a Member about legislative matters before the House is an outrageous abuse of the Select Committee’s authority.” He is the second lawmaker to turn down participation in the committee’s investigation, following Rep. SCOTT PERRY’s (R-Pa.) rejection.",
    "Pic … SPOTTED: North Carolina state Senate President Pro Tempore Phil Berger, North Carolina state Senate Majority Leader Kathy Harrington, Jonathan Felts, Katie Delzell and Taylor Haulsee, Laura Pinsky, Jackie Del Bonis, Shawn and Abbey Powell, John Tucker, Ches McDowell, Katie and Stephen Kouba, and Garrett Dimond.",
    "The two sides have been positioning themselves for what will be a nearly unprecedented flurry of activity in Europe this week.”\nTHE PANDEMIC\nTWO YEARS IN — Our Lisa Kashinsky and Susannah Luthi have an interesting look at the split on the left over how to respond to the Omicron outbreak.",
    "The congresswoman, who traveled to Florida over the holiday break and has been boosted, “is experiencing symptoms and recovering at home.”\nBill Whitaker of “60 Minutes” also has it — he thanked Lesley Stahl for introducing his segment on the show Sunday night in his absence.",
    "POLITICO Playbook: Biden faces his moment on the filibuster\nBy RYAN LIZZA and RACHAEL BADE\n01/10/2022 06:13 AM EST\nPresented by\nDRIVING THE DAY\nPresident JOE BIDEN and Senate Democrats are entering the second week of their push to pass a pair of voting rights bills.",
    "If [the] GOP obstructs again, the Senate would move to debate and consider changing the Senate rules to allow for passage of the voting rights legislation.”\nSchumer’s deadline for the rules change debate is a week from today, Martin Luther King Jr. Day.",
    "… Rep. Peter Meijer (R-Mich.) … Nick Calio of Airlines for America … Lauren Edmonds … Beth Fouhy … NBC’s Freddie Tunnard … POLITICO’s Maya Parthasarathy, Kristen Miller and Brandon McDonnell … AP’s Robert Burns … former Sen. Mark Pryor (D-Ark.)",
    "What’s going to happen over the next week, per a Dem source: “I would not expect [Senate Majority Leader CHUCK] SCHUMER to lay out next steps, as it relates to [a] vote schedule, on voting rights, until after POTUS’ voting rights speech.",
    "We’re told the bipartisan group that started discussions on that subject last week has continued to exchange ideas and will likely be meeting this week (though as of Sunday night there was nothing on the books, per a senior Senate aide).",
    "“For some allies, the change in tone is a welcome shift from the dominant theme of the president’s first year, when he more often focused on his desire to unify the country and struggled to negotiate with members of his own party.",
    "‘THE LEFT’S BIG LIE’ — As Schumer pressures his caucus to go nuclear to pass the party’s voting bill this month, Republican leadership is gearing up a major messaging push to save the chamber’s 60-vote threshold.",
    "A new Senate Republican Conference video shared with Playbook on Sunday night name-checks a few boogeymen for the right: the Green New Deal, “open borders,” “Defund the Police” and “packing” the Supreme Court.",
    "“It’s even more urgent than voter suppression, which is a real problem.”\nEven Democrats who say they are most worried about voting rights and suppression are often actually concerned about election subversion.",
    "Full memo here\n2) The GOP is warning voters that Democrats are trying to “silence your voice.” The idea is to make this very D.C.-centric debate about the filibuster more digestible to everyday voters.",
    "They will also lay a wreath at the crypt of Martin Luther King Jr. and Coretta Scott King at the Martin Luther King Jr. Center for Nonviolent Social Change and visit Historic Ebenezer Baptist Church.",
    "The talks started with reform of the Electoral Count Act, but they have broadened to include other election subversion issues, including some that are included in the Freedom to Vote Act.",
    "The big question Democrats will be watching for answers to, starting with the president’s speech in Atlanta on Tuesday: Will Biden make a more forceful case for reforming the filibuster?",
    "Biden’s Georgia trip will pay homage to the state’s civil rights history: He’ll speak at the Atlanta University Center Consortium, which consists of four historically black colleges.",
    "Schools have no right to FORCE you to get your 5-year old vaccinated.” Others pointed out that there are plenty of vaccine requirements already for children to attend school.",
    "THE SENATE will meet at 3 p.m. to take up ALAN DAVIDSON’s nomination to lead the National Telecommunications and Information Administration, with a cloture vote at 5:30 p.m.",
    "So instead of taking incoming from Republicans, they’re hearing from “critics on the left who accuse their own party of selling out public health to keep the economy going.",
    "The pardoned Paul Manafort has a book on the way: “Political Prisoner: Persecuted, Prosecuted, but Not Silenced.”\nWolf Blitzer was a happy Buffalo Bills fan Sunday night.",
    "He and VP KAMALA HARRIS “will lay a wreath at the crypt of Dr. MARTIN LUTHER KING, JR.” and “visit Historic Ebenezer Baptist Church,” according to the White House.",
    "… Wyatt Mayes is now a social media producer for CBS’ “Face the Nation.” He previously was a social media editor and producer at PBS NewsHour and is an NBC alum.",
    "THE HOUSE will meet at 6:30 p.m.\nBIDEN’S WEEK AHEAD:\n— Tuesday: The president and VP will travel to Georgia, where they will deliver remarks on voting rights.",
    "“Democrats and Republicans need to come together and pass legislation that targets the risk of election subversion,” RICK HASEN told The Atlantic recently.",
    "That’s why Republicans will be warning in the coming days that if Democrats nix the filibuster, it would open the floodgates for liberal policies.",
    "Shortly before Biden speaks, Senate Democrats will meet (likely virtually, we’re told) and have their latest opportunity to hear from Sens.",
    "Republicans point to evidence that shows making it harder or easier to vote doesn’t actually affect voter turnout, so there’s no crisis.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "They met at work when they both did state government affairs work — he was a lobbyist for AFPM and she was at American Gas Association.",
    "That’s the church where MLK preached from 1960 to his assassination in 1968, and where Sen. RAPHAEL WARNOCK (D-Ga.) is now a pastor.",
    "She previously was an account director at BerlinRosen, co-leading the reproductive rights portfolio and working on voting rights.",
    "WEEKEND WEDDINGS — Morgan Radford, an NBC News NOW anchor and NBC News correspondent, and David Williams got married Saturday.",
    "The main Republican argument against the two bills is that GOP senators do not believe that the right to vote is under attack.",
    "It is undeniably true that GOP-controlled states are passing laws that make it harder to vote, or at least less convenient.",
    "Expect them to come at this issue from two angles this week:\n1) They’ll argue that voting rights aren’t really in jeopardy.",
    "JOE MANCHIN (D-W.Va.) and KYRSTEN SINEMA (D-Ariz.), neither of whom have budged in their opposition to filibuster reform.",
    "Don’t let them.”\nMost Democrats are focused on a voting “carveout” — as opposed to nuking the filibuster altogether.",
    "FIRST IN PLAYBOOK — Emma Thomas is joining Feldman Strategies as a director, as part of the firm’s senior expansion.",
    "Remember, Schumer had said first Republicans will be given another chance to vote for voting rights legislation.",
    "Democrats call these voting laws “voter suppression” and see it as an emergency that needs to be addressed.",
    "If the GOP, Manchin and Sinema do indeed scuttle the Dems’ two bills, prospects for reform may be dead.",
    "And the recent deployment of Russian troops to Kazakhstan may cast a shadow over the entire exercise.",
    "Bottom line: The voter suppression divide between the two parties is likely unbridgeable right now.",
    "MEDIA MOVES — Jennifer Shutt is joining the States Newsroom Washington bureau as a senior reporter.",
    "She is a former deputy assistant to the president and senior director for Asian affairs at the NSC.",
    "Americans may not care about a spat over Senate rules, but they do care if it affects their lives.",
    "Kovid Kapoor and others who share his first name are trying to make the best of it, WaPo reports.",
    "She previously was a budget and appropriations reporter at CQ Roll Call and is a POLITICO alum.",
    "…\n… Stuart Malec is now director of government affairs for the Progressive Policy Institute.",
    "BIDEN’S MONDAY:\n— 9:30 a.m.: The president will return to the White House from Camp David.",
    "The best chance for a compromise seems to be legislation dealing with election subversion.",
    "“The filibuster ensures millions of Americans have a voice in Congress,” the video says.",
    "Some of the leading liberal experts are more worried about subversion than suppression.",
    "… Kemi Giwa is now deputy comms director for the House Financial Services Committee.",
    "— Thursday: Biden will deliver an update on the administration’s pandemic response.",
    "… Omair Mirza is joining J.P. Morgan Chase as VP of federal government relations.",
    "Democratic leaders aren’t looking to impose restrictions and shutdowns again.",
    "He most recently was senior policy adviser for Rep. André Carson (D-Ind.).",
    "TRANSITIONS — Allison Hooker is now an SVP at American Global Strategies.",
    "But the next best chance will be a bipartisan bill addressing subversion.",
    "Unless Manchin and Sinema change their minds, that effort will also fail.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza, Tara Palmeri.",
    "She previously was press secretary for Rep. Seth Moulton (D-Mass.).",
    "He previously was comms director for Rep. Kathleen Rice (D-N.Y.).",
    "Jeff Stein took to Twitter to ponder the arc of world history.",
    "— 10:30 a.m.: Biden will receive the President’s Daily Brief.",
    "But will anything be salvaged from the ashes of this debate?",
    "Ted Cruz opined on Twitter that “COVID mandates are wrong.",
    "Good Monday morning, and thanks for reading Playbook.",
    "Send Playbookers tips to playbook@politico.com.",
    "“But Democrats want to silence your voice.",
    "But Republicans say it’s a slippery slope.",
    "Last year, 19 states made voting harder.",
    "HAPPY BIRTHDAY: Michelle Fields … Sens.",
    "Psaki will brief at 1:30 p.m.",
    "Or so the GOP thinking goes.",
    "PLAYBOOKERS\nAOC has Covid.",
    "Chris Van Hollen (D-Md.)",
    "and Roy Blunt (R-Mo.)",
    "(More on that below.)",
    "Sign up here."
  ]
}