{
  "id": 6440,
  "mediaId": 2614,
  "date": "2022-01-15",
  "headline": "Kamala’s Interview Was Really Bad, But A Body Language Expert Reveals It Was Even Worse [VIDEO]",
  "image": "https://www.lifezette.com/wp-content/uploads/2021/06/2021.06.26-02.08-lifezette-60d734e3de011.jpg",
  "link": "https://www.lifezette.com/2022/01/kamalas-interview-was-really-bad-but-a-body-language-expert-reveals-it-was-even-worse-video/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Voice Media",
  "authorUrl": "https://www.lifezette.com/author/redvoicemedia/",
  "termIds": [
    1951,
    2298,
    3868,
    3975,
    5371
  ],
  "sentences": [
    "Speaking on Newsmax, Gregory Hartley, a behavior and body language expert, analyzed the interview with Harris and pointed out how not only are her answers already determined, but everything down to her hand movements are all a way to deflect the questions being asked and make it appear the Biden administration is still in control of situations like COVID-19.",
    "Jim Jordan Completely Shreds Biden & The Dems On COVID, Elections & More In Epic Two Minute Speech [VIDEO]\nStew Peters’ Viewers Create Temporary Victory In Scott Quiner Case- Mercy Hospital Ordered To Not Kill Him\nThe opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "Although the media has been known to be relaxed when it comes to the Biden administration, Melvin appeared not to hold back as he questioned the VP about voting rights and the highly controversial COVID-19 pandemic.",
    "We’re focused on what we need to do to address issues like affordable child care–”\nEven after Melvin would ask the question again, cutting off Harris, she replied, “The American people sent us here to do a job.",
    "While there is no denying VP Harris is a much better speaker than Biden, even she appeared to get heated when Melvin brought up the possibility of her being replaced in 2024 by Liz Cheney.",
    "I mean, honestly, I know why you’re asking the question because this is the part of the punditry and the gossip around places like Washington, D.C. Let me just tell you something.",
    "And while Harris appeared to be somewhat agitated at times by Melvin’s persistence, the Vice President seemed to come out of the interview unscathed.",
    "On Tuesday, Vice President Kamala Harris sat down with NBC anchor Craig Melvin to speak about some of the hot issues currently plaguing America.",
    "At least, that was until a body language expert investigated the footage.",
    "Sincerely.”\nThis piece was written by Zach Heilman on January 15, 2022.",
    "It originally appeared in RedVoiceMedia.com and is used by permission.",
    "And right now, there’s a lot of work to be done, and that’s my focus.",
    "Harris quickly retorted, “I’m sorry, we are thinking about today.",
    "400 Athletes Collapsing & Dying Just In The Last 6 Months?",
    "Read more at RedVoiceMedia.com:\nThe New Normal?",
    "We’re focused on the things in front of us."
  ]
}