{
  "id": 6477,
  "mediaId": 2590,
  "date": "2022-01-12",
  "headline": "Jan. 6 Committee Asks House GOP Leader Kevin McCarthy To Testify",
  "image": "https://img.huffingtonpost.com/asset/61df4349210000d0377038dd.jpeg?ops=1778_1000",
  "link": "https://www.huffpost.com/entry/jan-6-gop-leader-kevin-mccarthy-testify_n_61df429de4b0a26702887840",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    1886,
    2201,
    3267,
    3731,
    3975,
    4014,
    305,
    878,
    4887
  ],
  "sentences": [
    "“For example, in advance of January 6th, you reportedly explained to Mark Meadows and the former President that objections to the certification of the electoral votes on January 6th ‘was doomed to fail.’”\nAdvertisement\nIn his five-page letter to the California Republican, Thompson said he would like him to appear before the committee in the first week of February, and noted that McCarthy has said he “wouldn’t hide from anything.”\nThe committee previously asked Rep. Jim Jordan (R-Ohio), a Trump ally, to appear before the committee, but Jordan rejected that request.",
    "“At that meeting, or at any other time, did President Trump or his representatives discuss or suggest what you should say publicly, during the impeachment trial (if called as a witness), or in any later investigation about your conversations with him on January 6th?”\nThompson closed by pointing out that McCarthy has previously said he was willing to help the investigation.",
    "That’s when, according to McCarthy, the president said: ‘Well, Kevin, I guess these people are more upset about the election than you are.’”\nThompson’s letter says the committee wants to know why McCarthy, in spite of all that, continued to push Trump’s false claims of election fraud and his attempt to block President-elect Joe Biden’s election certification that day.",
    "In May, when asked by a CNN reporter whether he would be willing to testify about Jan. 6, McCarthy replied: “Sure.”\nBut late Wednesday evening, McCarthy released a statement calling the committee “illegitimate” and designed to advance the political objectives of Democrats - even though two Republicans, including the vice chair, are members of it.",
    "“The select committee wishes to question you regarding communications you may have had with President Trump, President Trump’s legal team, Representative Jordan, and others at the time on that topic.”\nAdvertisement\nPer Thompson’s letter, the committee also wants to know about Trump’s frame of mind in the days following Jan. 6.",
    "SAUL LOEB via Getty Images\nWASHINGTON - The House select committee to investigate the Jan. 6 Capitol attack has asked Minority Leader Kevin McCarthy - who has acknowledged he was in contact with former President Donald Trump that day - to provide details of those conversations and others with Trump’s top aides.",
    "“And the American people deserve to understand all the relevant details.”\nTrump, who lost the 2020 presidential election by 7 million votes nationally and 306-232 in the Electoral College, became the first president in more than two centuries of U.S. elections to refuse to hand over power peacefully.",
    "Advertisement\n“As a representative and the leader of the minority party, it is with neither regret nor satisfaction that I have concluded to not participate with this select committee’s abuse of power that stains this institution today and will harm it going forward,” McCarthy said in his statement.",
    "It cites a previously unreported text message that Fox News host Laura Ingraham sent to Mark Meadows, Trump’s White House chief of staff, on Jan. 12, 2021, as an example: “Remarks on camera discouraging protest at state capit[o]ls esp with weapons will be well advised given how hot the situation is.",
    "The statement reads: “When McCarthy finally reached the president on January 6 and asked him to publicly and forcefully call off the riot, the president initially repeated the falsehood that it was antifa that had breached the Capitol.",
    "The Jan. 6 assault on the Capitol - which Trump incited in a last-ditch attempt to remain in office - resulted in five deaths, including that of a police officer, as well as injuries to another 140 officers and four police suicides.",
    "This has to stop and he has to go to the American public and tell them to stop this.”\nIt further lays out what McCarthy told Rep. Jaime Herrera Beutler (R-Wash.), who later released her own statement detailing that conversation.",
    "[E]veryone needs to calm down and pray for our country and for those who lost their lives last week.”\nThompson noted that McCarthy visited Trump at his social club in Palm Beach, Florida, just weeks after Jan. 6.",
    "“We also must learn about how the President’s plans for January 6th came together, and all the other ways he attempted to alter the results of the election,” committee Chairman Bennie Thompson (D-Miss.)",
    "Thompson’s letter describes McCarthy’s statements on the day of the attack, when he told CBS News: “I was very clear with the president when I called him.",
    "“A full and accurate accounting of what happened on January 6th is critical to the Select Committee’s legislative recommendations,” Thompson wrote.",
    "Despite this, Trump remains the dominant figure in the Republican Party and is openly speaking about running for the presidency again in 2024.",
    "President Donald Trump and House Republican Leader Kevin McCarthy (Calif.) disembark from Air Force One in Los Angeles, April 5, 2019.",
    "“Your public statements regarding January 6th have changed markedly since you met with Trump,” Thompson wrote.",
    "McCarthy refuted that and told the president that these were Trump supporters.",
    "said Wednesday in a statement addressing McCarthy."
  ]
}