{
  "id": 6577,
  "mediaId": 2526,
  "date": "2022-01-29",
  "headline": "EXCLUSIVE: Jim Jordan Slams Senate Democrat Attempts to Revive Media Cartel Act",
  "image": "https://media.breitbart.com/media/2020/12/AP_19323615529878-640x335.jpg",
  "link": "https://www.breitbart.com/tech/2022/01/29/exclusive-jim-jordan-slams-senate-democrat-attempts-to-revive-media-cartel-act/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allum Bokhari",
  "authorUrl": "https://www.breitbart.com/author/allum-bokhari/",
  "termIds": [
    1670,
    878,
    885,
    1161,
    1163,
    1178
  ],
  "sentences": [
    "They’re trying to revive it… this bill would create an antitrust exemption, a lot like Major League Baseball has an antitrust exemption, so that big media companies can collectively bargain with big tech companies.”\n“This is not about competition and preserving competition,” said Rep. Jordan “This is about creating a cartel, this is about creating an OPEC in the newspaper business.”\n“Do you think letting the New York Times and the Washington Post collude is going to actually help conservatives, going to actually help the first amendment, help free speech, stop the censorship?”\n“Go back to the month before the 2020 presidential election and look how big media colluded with big tech to keep the number one story, what should have been the number one story from the American people, namely the story about Hunter Biden and what he was up to with foreign countries and how it relates to President Biden and the Big Man and everyone else,” continued Jordan.",
    "“They will use it, in the end, to discriminate against people who don’t fit into their category, who aren’t defined as ‘the press’ — and who’s going to determine that definition?”\n“When big government can get together and structure a rule that’s going to help big media supposedly deal with big tech, all that ends up happening is conservative outlets like yours and conservative viewpoints get discriminated against and the first amendment is further harmed.”\nRep. Jordan said the tech regulation that republicans should be supporting is Section 230 reform and a private right of action for users, so they have recourse against the tech giants.",
    "And even some of the members who had co-sponsored the legislation said ‘you know I’m having some second thoughts’ — they actually said that in the hearing.”\nBoyle said that Big Media companies would use the legislation to cut conservatives out of deals with the tech giants.",
    "“One of the things that jumped out at me this week was the Senate Judiciary Committee subcommittee on antitrust announced that they’re going to be having this hearing on this bill called the journalism competition and preservation act,” said Boyle.",
    "“The New York Times, CNN, Fox News whatever, they can get together and make their own deal with Facebook and Google and then all the rest of us are not a part of it.”\n“They will use it to discriminate against Breitbart,” agreed Jordan.",
    "The Ohio Republican went on to discuss the House judiciary committee’s hearing on that chamber’s version of the JCPA, in which independent journalists expressed concern about the legislation.",
    "Jordan said the legislation was likely revived because Democrats wanted to rush through pro-media legislation before Republicans likely take back control in the next midterm elections.",
    "Rep. Jim Jordan (R-OH), the ranking Republican member of the House Judiciary Committee, appeared on SiriusXM’s Breitbart News Saturday with Matt Boyle today.",
    "Rep. Jordan slammed Senate Democrats’ attempts to revive the Journalism Competition and Preservation Act, which failed to pass his committee last year.",
    "“You led the fight against this in the House, and it didn’t pass the house, didn’t even make it through it h committee last year.",
    "“If you think they’re going to pay up to conservatives I’ve got a bridge to sell you,” said Boyle.",
    "“We had a great hearing where we had Glenn Greenwald testify, we had Clay Travis testify."
  ]
}