{
  "id": 6581,
  "mediaId": 2748,
  "date": "2022-01-24",
  "headline": "Must See: Tucker SLAMS Kamala's Illegitimate Election Claims",
  "image": "https://blabberbuzz-bg6bts0feiert.netdna-ssl.com/media/k2/items/cache/262e1fdb7c9b8bd666d31d1558b95608_L.jpg",
  "link": "https://www.blabber.buzz/blab/pop/1034317-must-see-tucker-slams-kamala-s-illegitimate-election-claims?utm_source=c-alrt&utm_medium=c-alrt-email&utm_term=c-alrt-GI&utm_content=1D_AgrAkxCwg4wwQDkK5kDXy_m1doW-jzFME.A",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1328,
    1951,
    2298,
    2444,
    3593,
    3975,
    301,
    878,
    5371
  ],
  "sentences": [
    "In a Wednesday press conference when asked by a reporter if the forthcoming midterm elections will be fair if the Administration's Voting Rights' Bill doesn't pass through legislation, President Biden announced the opposing side is attempting to \"alter the outcome of the election.\"",
    "\"Whether Americans with disabilities have the opportunity to vote by mail, whether a single parent has the opportunity with three kids in the backseat to vote by dropping off their ballot in the dropbox instead of having to stand in line with those three kids for hours?\"",
    "\"So what we're looking at and the topic of so much debate last night was that we as America cannot afford to allow this blatant erosion of our democracy and in particular, the right of all Americans who are eligible to vote, to have access to the ballot unfettered.",
    "\"The President has been consistent on this issue,\" Harris announced, noting Senate Democrats' failure to approve the John Lewis Voting Rights Advancement Act and the Freedom to Vote Act Wednesday evening as she affirmed Biden's remarks.",
    "Tucker Carlson noted that in addition to President Biden's remarks, Vice President Harris made charges that Republicans are trying to \"steal\" U.S. elections, as did congressman Jim Clyburn (D-South Carolina).",
    "Meanwhile, in an interview on NBC's \"Today,\" host Savannah Guthrie explained it was \"astonishing\" to hear Biden's comments regarding the ability to hold \"free and fair elections\" this November.",
    "Democrats contend the measures are required to fight legislation passed by Republican-led states that include provisions regulating early voting and mail-in balloting.",
    "That is the topic of the conversation,\"\nannounced Harris, continuing that \"political gamesmanship\" should not distract from what's \"really at stake.\"",
    "With the two pieces of legislation barred by Senate Republicans, Guthrie asked Harris what effect their absence would have on the midterm elections.",
    "Speaking before the vote at his news conference, Biden was asked regarding the outcomes for November if the Democrat-backed bills were not approved.",
    "\"She is always on the hunt for insurrectionists undermining democracy.\"",
    "January 21, 2022\n\"He wants to stop the theft,\" Tucker Carlson laughed.",
    "\"He's questioning the legitimacy of the upcoming midterms.\"",
    "And so he's going full insurrectionist,\" Carlson said.",
    "\"Biden's a full year into his presidency as of today.",
    "\"Questioning the legitimacy of our elections.",
    "\"These are the issues that are at stake.\"",
    "Doing the bidding of Putin.",
    "the\nFox News host asked.",
    "Where's Liz Cheney?\"",
    "He's not doing well.",
    "He knows that.",
    "Harris asked."
  ]
}