{
  "id": 6593,
  "mediaId": 2724,
  "date": "2022-01-25",
  "headline": "New Poll Shows Majority Of Independents Want Fauci To Resign",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/01/2022.01.25-01.22-thepoliticalinsider-61eff978be559.jpg",
  "link": "https://thepoliticalinsider.com/new-poll-shows-majority-of-independents-want-fauci-to-resign/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rusty Weiss",
  "authorUrl": "https://thepoliticalinsider.com/author/rusty-weiss/",
  "termIds": [
    2576,
    3975,
    4749,
    265,
    305,
    677,
    678,
    878
  ],
  "sentences": [
    "In a recent interview with MSNBC host Stephanie Ruhle, Fauci indicated that criticism of his work is “stressful on my family, my wife, and my children,” but his efforts during the pandemic are “too important.”\n“This is the kind of thing that I’ve devoted my entire career, but certainly over the last 40-plus years in public health, science and medicine, and we are in a crisis right now and there’s no chance I’m going to walk away from this,” he said.",
    "Sharp partisan divide on whether #Fauci should resign in leading COVID-19 response (Overall: 53.7% no/46.3% yes):\n82.5% no/17.5% yes #Dems\n23.4% no/76.6% yes #GOP\n41.1% no/58.9% yes #Inds\n— The Trafalgar Group (@trafalgar_group) January 20, 2022\nNot Going Anywhere\nFor his part, Fauci has consistently stated that he has no intentions of going anywhere despite his advanced age of 81 years.",
    "Fauci’s home office features photos of himself, his own bobblehead https://t.co/o7PqEYeFXt pic.twitter.com/y2LDGyJVUd\nRepresentative Jim Jordan (OH) recently warned that Republicans will “definitely” investigate Dr. Fauci should the GOP win back the House in 2022.",
    "On the matter of whether or not the Biden administration’s chief medical adviser should “resign his position and role in leading the government’s COVID-19 response to allow new leadership,” Independents agree by a whopping margin of 59% to 41%.",
    "— The Post Millennial (@TPostMillennial) January 17, 2022\nJordan seemed to indicate the focus of the investigation would be the government’s alleged attempts to downplay the origins of the coronavirus pandemic.",
    "Ruhle responded as if she were one of the Democrats in the Trafalgar poll, showering effuse praise on Fauci:\n“Well, I am sincerely appreciative that you are not walking away from this post.",
    "Crosstabs on the latest poll on whether or not Fauci, director of the National Institute of Allergy and Infectious Diseases under the NIH, should resign are interesting as well.",
    "— Daily Caller (@DailyCaller) January 24, 2022\nRELATED: Conservatives Mock Fauci After Photos Show His Office Has Life-Size Portrait, Bobblehead Of Himself\nShould Fauci Resign?",
    "On the matter of respondents broken down by age, by far the highest (and only) group of those who believe he should step down are those in the age range of 18 to 24-years-old.",
    "Republicans agree with the assessment, 77% to 23%, while Democrats strongly disagree, with only 18% saying he should leave his post, compared to 82% who believe otherwise.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "Social media erupted last week over an image of the good doctor’s office which revealed a bobblehead and a massive, life-size portrait of himself.",
    "?https://t.co/CwBvzv4uqo pic.twitter.com/NCL07fwyBV\n— Team DeSantis (@teamrondesantis) January 21, 2022\nFauci doesn’t think he’s a flip-flopper.",
    "To commemorate Fauci’s flip flopping, we’re launching EXCLUSIVE Freedom Over Fauci Flip Flops on our Team DeSantis storefront.",
    "The latest poll by the Trafalgar Group shows Independents joining Republicans in calling for Doctor Anthony Fauci to resign.",
    "The poll also shows that most men (60%) believe he should leave his post while most women (66%) think he should remain.",
    "The problem is that a vast majority of people other than the media and Democrats think his work is also incompetent.",
    "Sign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "After 600+ days of ineffective lockdowns & mandates, 3 things are certain with Dr. Fauci:\nHe flips.",
    "“If the American people put us back in charge, we are definitely going to do this,” vowed Jordan.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "The young age group believes by an 83% to 17% margin that Fauci should resign.",
    "Thank you so much, Dr. Fauci.”\nThe work is, no doubt, important.",
    "And based on his home office setup, Fauci truly loves himself.",
    "You make us smarter and safer and better every day.",
    "Why would he ever walk away from adulation?",
    "Fauci thinks he is science.",
    "He flops.",
    "He fails.",
    "?????"
  ]
}