{
  "id": 6678,
  "mediaId": 2540,
  "date": "2022-01-28",
  "headline": "Exclusive: Trump WH spokesman is sent subpoena by January 6 committee",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220128170534-judd-deere-file-2020-super-tease.jpg",
  "link": "https://www.cnn.com/2022/01/28/politics/judd-deere-january-6-subpoena-judd-deere/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gloria Borger",
  "authorUrl": "https://www.cnn.com/profiles/gloria-borger",
  "termIds": [
    2201,
    2378,
    2854,
    3750,
    3975,
    4807,
    234
  ],
  "sentences": [
    "“Yes, but there is a lot of anger out there right now,” Trump responded, according to “Peril.”\nThe select committee also wrote in its letter that Deere “publicly claimed that fraud had affected the November 2020 election,” pointing to a December 2020 tweet where Deere wrote, “the House and Senate have agreed to focus strongly on the very substantial voter fraud which took place in the November 3 Presidential election.”\nThe panel said that it was seeking information from Deere because he “met and communicated with various officials about formulating the White House’s response to the attack on the US Capitol while the attack occurred.”\nThe day after the January 6 attack on the Capitol, Deere issued a statement on behalf of the White House.",
    "How do we convince Congress?”\nDeere is the latest in a wide net of individuals in the Trump orbit, both inside and outside the White House, subpoenaed by the House select committee as part of its sweeping probe into the former president’s efforts to overturn his 2020 election loss to Joe Biden, as well as his state of mind – and intent – before, during and after the January 6 insurrection.",
    "CNN —\nThe House Select Committee investigating January 6 has issued a subpoena Friday for a former White House spokesman with firsthand knowledge of Donald Trump’s behavior before and during the January 6 attack on the Capitol, according to a copy of a letter accompanying the subpoena obtained by CNN.",
    "The committee is seeking both documents and a deposition next month from former deputy White House press secretary Judd Deere, who helped with “formulating White House’s response to the January 6 attack as it occurred,” according to the panel’s letter.",
    "The committee has also sought testimony from Republican members of Congress, including House Minority Leader Kevin McCarthy and Ohio GOP Rep. Jim Jordan, but so far it has yet to issue subpoenas to compel testimony from the lawmakers.",
    "In its letter to Deere, the committee focused on the January 5 staff meeting in the Oval Office, citing information about the meeting both from its own investigation and the book “Peril” by journalists Bob Woodward and Robert Costa.",
    "McEnany and Deere were on a long list of White House officials whose records the panel sought from the National Archives, as part of the committee’s efforts to learn more about how Trump responded as the attack unfolded.",
    "The committee has already met with Deere’s former boss, Trump White House press secretary Kayleigh McEnany, who appeared before the select committee earlier this month after she was subpoenaed in November.",
    "On Friday, the committee also subpoenaed 14 Republicans from seven states who served on bogus slates of Trump electors in 2020 as part of the Trump campaign’s scheme to subvert the Electoral College.",
    "The document request included communications over how Trump would publicly respond to the attack and sought recordings of Trump’s video messages, including outtakes, filmed on January 6.",
    "The committee has issued subpoenas to dozens of Trump aides, rally organizers and groups linked to the January 6 riot, as well as for phone records of more than 100 people.",
    "The committee said it had obtained information that Trump repeatedly asked in the meeting: “What are your ideas for getting the RINOs to do the right thing tomorrow?",
    "One complicating factor for the committee is that Deere currently works in the Senate as a deputy chief of staff to Sen. Bill Hagerty, a Tennessee Republican.",
    "In its letter to Deere, the committee specifically said it wanted to speak with him about the January 5 staff meeting in the Oval Office with the President.",
    "The Archives provided the House panel with hundreds of records last week after the Supreme Court declined Trump’s request to block the document handover.",
    "The committee letter stated in the letter that nothing in the scope of its request concerns Deere’s current position as a Senate aide.",
    "One day later, he took a swipe at Twitter for banning Trump’s account after Trump posted a message on the @POTUS account instead.",
    "According to the book, Trump had a door in the Oval Office open and was listening to the crowds outside during the get-together.",
    "The authors wrote that another staffer said they hoped the following day would be peaceful, and others nodded in agreement.",
    "“The White House grieves the loss of life that occurred yesterday and extends sympathies to their families and loved ones.",
    "“They are excited to hear from you, Mr. President,” Deere told Trump, according to the book.",
    "We also continue to pray for a speedy recovery for those who suffered injury,” Deere said.",
    "“Guess Twitter forgot about this account!” Deere wrote.",
    "CNN’s Ashley Semler contributed to this report.",
    "CNN has reached out to Deere for comment."
  ]
}