{
  "id": 671,
  "mediaId": 2690,
  "date": "2022-04-12",
  "headline": "‘Something Is Up’: Top House Republican Suggests Hunter Biden Indictment Could Be Coming",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/something-is-up-top-house-republican-suggests-hunter-biden-indictment-could-be-coming-474134/",
  "mediaOutlet": "teapartyorg.ning.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    1830,
    2208,
    3102,
    3679,
    3975,
    4013,
    878,
    1161,
    5287
  ],
  "sentences": [
    "“The Left always tries to — always says, ‘Oh, there’s these right-wing conspiracies.’ The real conspiracy here was the Democrats, Big Tech, Big Media keeping this story from the American people just days before the most important election we have, an election for president of the United States, election for who’s going to be the commander in chief.”\n“Maybe worst of all” was the 51 ‘former intelligence officials’ who swore in an October 2020 letter that the Hunter Biden laptop story was probably just Russian disinformation.",
    "And now, we find out these text messages and emails (screenshots here, here, and here) that link the entire family, not just Hunter and Joe and — but also uncle, the — Joe’s brother, James Biden, is involved in this as well.”\nBartiromo then brought up that author Peter Schweizer stated that the laptop contained messages from Hunter that revealed at least $31 million in rather shady international dealings, not to mention a message from 2019 to his daughter whining about providing money to cover family expenses.",
    "You don’t see the Washington Post do that.”\n“While the New York Post led the charge in reporting on the contents of the abandoned laptop, which contained emails detailing Biden’s business dealings and rollercoaster personal life, other major media outlets sought to cast doubt on its authenticity, and Big Tech companies even took steps to suppress its spread in the final weeks of the 2020 election,” the report stated.",
    "“Jordan, who is the top Republican on the House Judiciary Committee, remarked how ‘interesting’ it is that the ‘story has evolved’ in recent weeks, coinciding with rising suspicions that President Joe Biden himself could be drawn into a federal criminal investigation, even as the White House has been adamant in asserting that the president is not involved and that his 52-year-old son did not commit any crimes.",
    "(TeaParty.org Exclusive) – Top House GOP member Jim Jordan stated over the weekend that he believes “something is up” with the MSM’s flip-flopping concerning the Hunter Biden laptop story, which the radical left all referred to as “Russian disinformation” just before the 2020 presidential election, only to be confirmed to be authentic as a grand jury continues to investigate the youngest son of Joe Biden.",
    "But don’t worry, unlike pop, I won’t make you give me half your salary.“\nWhen Jordan was asked to reply, he said, “It sure looks like Joe Biden was involved,” going on to add that there are “4.8 million reasons” to believe that the elder Biden is lying through his teeth when he states there was nothing unethical about the business dealings between Hunter in China and Ukraine.",
    "We want to know who they were talking to, how they came to this conclusion, how they put that letter together, because that was the basis for the conspiracy that kept information from the voters right up before the presidential election.”\nThe Hunter Biden investigation began as a tax inquiry years ago + expanded into a federal probe.",
    "— Chuck Ross (@ChuckRossDC) October 25, 2020\nTony Bobulinski on Tucker says it is a \"blatant lie\" when Joe Biden says he had no knowledge of his son's business dealings:\n\"There was no other reason for me to be in that bar meeting Joe Biden then to discuss what I was doing with his family's name and the Chinese.\"",
    "\"The fact that you and [Hunter Biden] were lying…\" https://t.co/wn47I87tID pic.twitter.com/C79mXN4GXP\n— Chuck Ross (@ChuckRossDC) October 25, 2020\nOn Aug. 8, 2017, per Senate report, CEFC began a series of wire transfers to a pass through to Biden's law firm that totaled $4.7 million over the next year.",
    "“That letter they wrote where they said this has all the earmarks of a Russian disinformation campaign, that letter became the basis for Big Tech and Big Media to suppress this story and keep it from We the People in the run-up to our most important election,” said the Ohio Republican.",
    "Source familiar with the investigation now tells @cbsnews I-unit two men who worked w/Hunter Biden when his father VP were called to the grand jury last fall.pic.twitter.com/1LaXDiycWk\n— Catherine Herridge (@CBS_Herridge) March 31, 2022\nThis is maybe THE clip from this interview.",
    "You can’t have a free and fair election when the media, tech companies, and intelligence community knowingly censor crucial information about the likely foreign corruption of one of the candidates\n— Joel Pollak (@joelpollak) March 30, 2022\nCopyright 2022.",
    "“Remember, it started off as, ‘Oh, it wasn’t his laptop.’ Then it was, ‘Well, it was his laptop, but it was Russian disinformation.’ Now it’s, ‘No, it wasn’t Russian disinformation, but Joe had nothing to do with it,” Jordan stated.",
    "A report from Infowars stated that Jordan said it “sure seems” that Hunter Biden is well on his way to being indicted by the grand jury, though he couldn’t say for sure, according to a report published by the Washington Examiner.",
    "“And now, finally, it is, ‘Well, Joe had something to do with it, but he really didn’t do anything wrong.’ In fact, that’s what his chief of staff, Ron Klain, told us last Sunday on the Sunday shows,” he stated.",
    "pic.twitter.com/GMDL1JNZtB\n— Curtis Houck (@CurtisHouck) October 28, 2020\nTony Bobulinski found out through the Senate report a few weeks ago that Hunter and Jim Biden had a side deal with CEFC China Energy.",
    "Jordan then noted the strange timing of mainstream media outlets reporting on Hunter’s laptop which seems to be in perfect lockstep with a flurry of grand jury activity.",
    "So two eight-page-long stories four minutes apart from the news organization that said 18 months ago there was no story here, this was Russian disinformation.",
    "pic.twitter.com/famy4WaxOk\n— Daily Caller (@DailyCaller) October 28, 2020\nHunter Biden laptop puts a big asterisk next to the *2020 election, all on its own.",
    "“You mentioned those two stories from the Washington Post 10 days ago,” Jordan went on to tell Fox News host Maria Bartiromo.",
    "“I hope you all can do what I did and pay for everything for this entire family for 30 years,” said the First Son.",
    "Bobulinski to #Tucker: \"I remember looking at Jim Biden in saying how are you guys getting away with this?",
    "“The thing that bothers me the most, though, Maria, is the conspiracy,” said the congressman.",
    "Bobulinski says he had no idea that CEFC struck deal with Hunter and Jim.",
    "And he looked at me and he laughed a little bit and said.",
    "Here's Bobulinski's message to Jim Biden about that.",
    "“That’s why we sent a letter to these 51 guys.",
    "-Washington Examiner,” the report continued.",
    "“I understand they were four minutes apart.",
    "“So, my, how this story has changed.",
    "That tells you something is up.",
    "Like, aren't you concerned?",
    "'plausible deniability.'\"",
    "“It’s really hard.",
    "One was at 11:00.",
    "One was at 11:04.",
    "TeaParty.org"
  ]
}