{
  "id": 6711,
  "mediaId": 2569,
  "date": "2022-01-21",
  "headline": "‘Totally fake news’: Donald Trump downplays any split with Ron DeSantis",
  "image": "https://floridapolitics.com/wp-content/uploads/2018/09/trump-ron-densatis-florida-governor-e1570033995745.jpg",
  "link": "https://floridapolitics.com/archives/488612-donald-trump-calls-split-with-ron-desantis-totally-fake-news/",
  "mediaOutlet": "floridapolitics.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1301,
    1670,
    2201,
    2202,
    2292,
    3467,
    3573,
    404,
    4977
  ],
  "sentences": [
    "That same day, Trump associate Roger Stone — teasing his own third-party challenge to DeSantis’ re-election in 2022 — released a video claiming the former President had to “drag (DeSantis) over the finish line” in 2018 against Democrat Andrew Gillum.",
    "The comments came in the wake of widely reported tensions between the two, including claims it would be “too much to ask” for DeSantis to preemptively endorse another Trump term in 2024, while he lamented a “dull” DeSantis.",
    "On Wednesday, Lara Trump discounted rumors of “bad blood” between the two Republicans while suggesting Florida’s Governor may need “another opportunity” to demonstrate his support for Trump ahead of 2024.",
    "“And intend to have it for a long time.”\nTrump’s words seem to be an attempt to spackle over reports of a rift; in most 2024 GOP primary polls, DeSantis is running second to the former President.",
    "Ron DeSantis are “totally fake news.”\nTrump has a “very good relationship” with DeSantis, he said earlier Thursday, continuing that narrative on Sean Hannity‘s Fox News show later that night.",
    "Jeanette Nuñez dismissed reports of a split as “media obsession” and “made-up animosity.”\nFor his part, the Governor is trying to avoid giving engaging quotes on the matter.",
    "“I think Ron said it last week, he said it very publicly, ‘The press is never going to get in the middle of my friendship with Donald Trump.",
    "Ron’s been very good, he’s been a friend of mine for a long time.”\nNext, Trump pivoted to the reported quarrels between him and DeSantis.",
    "Those on the Trump side of the divide are more willing to stoke the fires of discontent than DeSantis adherents seem to be.",
    "And he said that, and I agree with him 100%.”\n“I have a very good relationship with Ron,” Trump added.",
    "We need everybody united for a big red wave in 2022,” DeSantis said last week on the Ruthless podcast.",
    "'”\n“And he said it very strongly, which I thought was really interesting, actually, and very nice.",
    "He was right in front along with Jim Jordan and all of the rest of them; they were fantastic.",
    "It was a great thing, and Ron was one of them.”\n“Ron wanted to run, and I endorsed him.",
    "Meanwhile, during a Tuesday appearance on the Fox Business Channel, Lt. Gov.",
    "Former President Donald Trump is insisting reports of a conflict with Gov.",
    "Trump says they have a 'very good relationship' amid reports of a rift.",
    "and I helped him greatly, and he went on,” Trump continued.",
    "“Don’t take the bait, and just kind of keep on keeping on.",
    "“Ron was very good on the (Robert) Mueller hoax.",
    "Unity is the word here, at least on the record.",
    "“He’s done a really terrific job in Florida.",
    "“I get along great with Ron,” Trump said.",
    "“It’s totally fake news,” he contended.",
    "Republicans really stuck together.",
    "We’re not going to do that stuff."
  ]
}