{
  "id": 6713,
  "mediaId": 2742,
  "date": "2022-01-18",
  "headline": "GOP Finally Focusing On Dems’ Drive To Weaponize Big Tech Against America",
  "image": "https://vdare.com/public_upload/publication/featured_image/56738/VDARE-section-230.jpg",
  "link": "https://vdare.com/articles/gop-finally-focusing-on-dems-drive-to-weaponize-big-tech-against-america",
  "mediaOutlet": "VDARE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1767,
    1824,
    2646,
    2941,
    3975,
    305,
    878,
    1094
  ],
  "sentences": [
    "Texas recently passed a bill that says “social media platforms function as common carriers, are affected with a public interest, are central public forums for public debate, and have enjoyed governmental support in the United States.” It also states that “social media platforms with the largest number of users are common carriers by virtue of their market dominance.” The bill just needs to be tested out in court [Texas Governor Greg Abbott Signs Bill Fighting Social Media Censorship, by Allum Bokhari, Breitbart, September 10, 2021].",
    "[An Open Letter to President Trump on Section 230, Gab.com, October 16, 2020]\nIn an interview with VDARE founder Peter Brimelow almost exactly a year ago, Torba elaborated: “The kabuki theater of going after it is a massive mistake.”\nSection 230 only protects Big Tech from what users say on their platforms; it does not protect users for what they say, nor does it protect what Big Tech itself says.",
    "GOP measures would change Section 230 to make it explicitly protect free speech [House Republican staff outline principles to reform tech’s liability shield, by Lauren Feiner, CNBC, April 15, 2021]:\nHouse Minority Leader Kevin McCarthy, who frequently attacks Section 230, wants a new provision that protects free speech [Scrap 230 and Start Over, RepublicanLeader.gov, October 15, 2020].",
    "“Section 230 helps the little guy,” he continued in an open letter to President Trump published the same day:\nWe seek to protect free speech on the Internet, and Section 230 is the only thing that stands between us and an avalanche of lawsuits from activist groups and foreign governments who don’t like what our millions of users and readers have to say.",
    "Failure to do so, again, would mean losing liability protection\nBill Haggerty’s would scrap Section 230 “in favor of narrower liability protection that reflects its original purpose and that cannot be used as a license for politically-biased censorship” [Hagerty Introduces Bill To Combat Big Tech Censorship, Hagerty.House.gov, April 29, 2021].",
    "Another idea for reining in Big Tech: designating the gargantuan companies as common carriers, as Associate Supreme Court Justice Clarence Thomas suggested in an opinion last spring [Justice Thomas Gives Congress Advice on Social Media Regulation, by Abby Lemert and Klaudia Jazwinska, Lawfare, April 12, 2021].",
    "Jim Jordan and a few others would remove major large tech platforms from blanket liability protection if they fail to respect free speech [House Republicans introduce draft bill to strip Big Tech companies of Section 230 protections, by Brooke Singman, Fox Business, July 28, 2021].",
    "As well, Torba believes the GOP should stop going after Section 230 by requiring “neutrality,” because the government should not decide what is neutral:\nSection 230 says nothing about political neutrality … who enforces that neutrality?",
    "That’s why Republicans must protect the liability protections that allow free speech platforms to exist and thrive, while curbing the abuses that make free speech impossible—and the First Amendment inoperative—as a practical matter.",
    "And as a practical matter, fighting Big Tech over Section 230 is a loser because “Big Tech has poured half a billion dollars in lobbying over the past decade”:\nThey have funneled money and contributed to both sides of the aisle.",
    "Two important points to remember:\nFirst, social media websites such as Facebook and Twitter are the major sources of information for a large part of the American population, including members of the Historic American Nation.",
    "There are plenty of other things that can be done to stop Big Tech tyranny,” he said in October [The “Repeal Section 230” Narrative is Being Pushed by Silicon Valley, Don’t Fall For It, Gab.com, October 16, 2020].",
    "Hundreds of Leftist “doctors” and “scientists” want Spotify, which hosts his podcast, to boot him [Group of ‘Experts’ Pressures Spotify to Censor Joe Rogan, by Allum Bokhari, Breitbart, January 14, 2022].",
    "Joe Biden knows exactly what more censorship will do: cripple political opposition to remaking the United States of America with openly Totalitarian public policies and, of course, The Great Replacement.",
    "If Big Tech did that, they might keep their liability protection [Leader McCarthy Statement on Twitter’s Continued Efforts to Silence Americans, RepublicanLeader.gov, January 3, 2022].",
    "For the radical Left and Democrat Party, that means deep-sixing Section 230, which protects social media platforms from defamation and liability claims that publishers face.",
    "It has to stop” [Remarks by President Biden at Virtual Meeting on Military Deployments Supporting Hospitals for the COVID-?19 Response, WhiteHouse.gov, January 13, 2022].",
    "Haggerty’s bill would update common-carrier laws to include large social media platforms, as well require the tech giants to publicize their moderation policies.",
    "Twitter banned Rep. Marjorie Taylor Greene, the George Republican, for “spreading disinformation.” Also recently banned was mRNA vaccine pioneer Robert Malone.",
    "So, if anything is going to happen to Section 230, it's going to be pro-Big Tech, and it's going to solidify their monopoly power over certain verticals.",
    "Leftist politicians and their spear-carriers in the Regime Media are pushing bans, censorship, and deplatforming with the zeal of Star Chamber judges.",
    "After the Mostly Peaceful Unite the Right protest in Charlottesville, the loudest voices calling for tech censorship were journalists and politicians.",
    "President Joe Biden issued a stark order to Big Tech this week: “I make a special appeal to social media companies and media outlets.",
    "The Texas effort is superior to Florida Governor Ron DeSantis’s largely toothless anti-censorship bill that was shot down in court.",
    "DeSantis has ignored it since [Federal Judge Blocks Florida Tech Censorship Law, by Allum Bokhari, Breitbart, July 1, 2021].",
    "Big Tech has since followed the dictates from Democrats and Journofa on the 2020 election, China Virus, and other topics.",
    "The Historic American Nation must be permitted to defend itself on the main platforms that provide news and information.",
    "The key to protecting patriots like Torba is ensuring that the law cannot be used against alternative platforms.",
    "Controlling social media, with the ability to censor information and ban “bad actors,” means controlling speech.",
    "Without Section 230, we couldn’t stand up to these oppressive forces that want to eliminate free speech online.",
    "It’s not the first time the Biden Regime has demanded more censorship from Big Tech—and it won’t be the last.",
    "Banning POTUS 45 after the media-spun “insurrection” at the U.S. Capitol on January 6, 2020 wasn’t enough.",
    "It didn’t designate the platforms as common carriers, and simply banned Big Tech’s censorship in Florida.",
    "Common carriers include railroads and telephone companies that provide a service in the public interest.",
    "The popular podcaster Joe Rogan is in the censors’ crosshairs for challenging the China Virus narrative.",
    "Expect more conservative, pro-Trump political candidates to be banned in the run-up to November 8, 2022.",
    "Josh Hawley proposed a review board to determine if large social media platforms defend free speech.",
    "Now they include lawmakers like Greene and other prominent people who challenge Leftist narratives.",
    "Because Leftists think Section 230 allows “hate speech” and “misinformation” without consequences.",
    "They can browbeat tech execs in hearings and force sensible legislation through Capitol Hill.",
    "Fortunately, Republicans are now more serious about the threat than two or three years ago.",
    "Democrats want it so social media platforms become liable for all their published content.",
    "Democrats hauled Big Tech execs before Congress to berate them and demand more censorship.",
    "With Trump banned, though, the GOP finally sees an issue that requires government action.",
    "The Left’s end game, though, is abolishing Section 230 of the Communications Decency Act.",
    "The move would kill renegade start-ups who value free speech and permit vigorous debate.",
    "And like, look over our shoulder and say, “Oh, this is wrong,” or, “You did this wrong”?",
    "But they mustn’t inadvertently crush free speech, or give Democrats the power to do so.",
    "Any who noticed the problem would have said that the solution lies in the free market.",
    "But unlike Democrats, most Republicans don’t want to abolish Section 230 outright.",
    "Republicans can do more on tech censorship if they get the majority in Congress.",
    "Are you going to have the government, or some government agency, come into Gab?",
    "That can only help start-ups who, again, could be wiped out by Leftist lawfare.",
    "Please deal with the misinformation and disinformation that's on your shows.",
    "This would offer greater protections to patriots and their free expression.",
    "Big Tech had no problem banning a sitting president from social media.",
    "That’s a good thing, as Gab.com’s founder Andrew Torba has explained.",
    "Yet even without the change, tech censorship has already intensified.",
    "They receive that protection because they are supposed to be neutral.",
    "It’s a bad one that would cement Leftist control of speech online.",
    "Republicans had better legislate wisely when they get the chance.",
    "So why get rid of something that Big Tech doesn’t follow anyway?",
    "Second, the totalitarian controllers aren’t acting on their own.",
    "The same thing happened after the Christchurch mosque shooting.",
    "And it won’t just be the “racists” or conservatives who suffer.",
    "Washington Watcher II [Email him] is an anonymous DC insider.",
    "They are regulated to ensure they serve all customers alike.",
    "In 2017, hardly any elected Republican cared about it.",
    "A federal court said it violated the First Amendment.",
    "Happily, GOP leaders don’t seem to favor the idea.",
    "Big Tech complied and suppressed the Alt-Right.",
    "They’re supposed to be public bulletin boards.",
    "Of course, we all know they are no such thing.",
    "But Biden wants the platforms to censor more.",
    "Thomas wants Big Tech treated the same way.",
    "As the 2022 midterms approach, expect more.",
    "Big Tech is already suppressing the Right.",
    "“Don’t fall for the Section 230 narrative.",
    "And that would lead to more censorship.",
    "Execs complied, but didn’t do enough.",
    "And what does neutrality look like?",
    "We all know how that’s turned out.",
    "More or less, they own Congress.",
    "Who's gonna police neutrality?",
    "With Section 230, we can.",
    "Anyone can post anything.",
    "It was bound to fail.",
    "Come into Facebook?",
    "It’s a distraction.",
    "Come into Twitter?",
    "Right?"
  ]
}