{
  "id": 6732,
  "mediaId": 2659,
  "date": "2022-01-26",
  "headline": "It Is Only A Matter Of Time As Another Matt Gaetz Friend Pleads Guilty And Cooperates With Prosecutors",
  "image": "https://www.politicususa.com/wp-content/uploads/2021/03/2021-03-31T205143Z_1562543209_RC2KMM9N9L2U_RTRMADP_3_USA-CONGRESS-GAETZ-scaled.jpg",
  "link": "https://www.politicususa.com/2022/01/26/it-is-only-a-matter-of-time-as-another-matt-gaetz-friend-pleads-guilty-and-cooperates-with-prosecutors.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Easley",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Rep. Gaetz continues to whistle while walking past the graveyard, as he pretends like someday he is going to be running the House with his partners in shame, Jim Jordan and Marjorie Taylor Greene, but each friend who cooperates is another step toward a different ending where Rep. Matt Gaetz is sitting behind bars.",
    "Last year, The Daily Beast revealed that Ellicott knew intimate details about the teenage girl who was paid for sex by the group—and actually texted what essentially amounted to a confession that they were scrambling to try and coverup details about their sex with a 17-year-old from the feds.",
    "Via: The Daily Beast:\n(Joe) Ellicott is the long-time best friend of corrupt Florida tax official Joel Greenberg, who was Gaetz’s wingman in the underage sex operation, according to several sources with direct knowledge of their relationship.",
    "Ellicott was particularly legally exposed through his involvement with Greenberg, who ran the small Central Florida tax agency like a fiefdom where he hired his friends for no-show jobs.",
    "Also, Matt Gaetz has already hired a team of expensive criminal defense lawyers, so prosecutors likely want to build a case against Gaetz that is as airtight as possible.",
    "Matt Gaetz’s Friends Are Flipping On Him\nEveryone from his best friend to his ex-girlfriend has flipped on Matt Gaetz and is cooperating with prosecutors.",
    "A friend of Matt Gaetz, who is said to know about the Florida congressman’s child sex trafficking, has pled guilty and is cooperating with prosecutors.",
    "The answer is that prosecutors are investigating Gaetz for three serious crimes related to child sex trafficking and obstruction of justice.",
    "The most common question related to Gaetz that pops up in social media discourse is why is it taking so long to charge him?",
    "That appears to be what took Ellicott down."
  ]
}