{
  "id": 6749,
  "mediaId": 2605,
  "date": "2022-01-22",
  "headline": "Why pay TV operators are dropping Trump-loving cable networks",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/caf17e9/2147483647/strip/true/crop/5031x2641+0+329/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe1%2F4a%2F3632c4054d60866aaf2d19c3914e%2F464901-aon-004.jpg",
  "link": "https://www.latimes.com/entertainment-arts/business/story/2022-01-22/why-pay-tv-operators-are-dropping-trump-loving-cable-networks",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen BattaglioStaff Writer",
  "authorUrl": "https://www.latimes.com/people/stephen-battaglio",
  "termIds": [
    1803,
    2201,
    2916,
    3975,
    4656,
    92,
    320,
    775
  ],
  "sentences": [
    "Morrow said carriage decisions on channels are based on “industry trends such as secular decline, programming price increases, competitive offerings with lower price points, our competitors’ offers, and consumers’ desire to have more narrow bundles.”\nBreezeline, the Quincy, Mass.-based cable company formerly known as Atlantic Broadband, took a similar stance in its comment on its decision to part with Newsmax.",
    "“The decision was not related in any way to the content on the network.”\nWalton added that Newsmax’s demands for a higher fee “would have resulted in increased TV fees for all Breezeline customers — for a channel that is free online to other viewers.”\nNewsmax can be streamed online without a pay TV subscription, a selling point the company has touted to Fox News fans who are reluctant to drop cable.",
    "“OAN would love to continue broadcasting on that platform and we know for a fact it is all political behind the scenes on why they’re doing that to us.”\nEarlier in the week, Ball solicited viewers to send him “dirt” on William E. Kennard, chairman of of the board at DirecTV parent AT&T, including any evidence of marital infidelity.",
    "While the loss of carriage on Breezeline and other small carriers will not significantly cut into the 54 million homes that carry Newsmax, other cable providers could cite the service’s free stream as a reason to drop it from their channel lineups in the future.",
    "The loss of DirecTV will deprive the channel of its major source of revenue and casts doubt on the future of the operation, where President Biden’s administration is called a “regime” and concerns about the COVID-19 pandemic are described as hysteria.",
    "Newsmax, the Boca Raton, Fla.-based channel that is the TV home of former President Trump’s first press secretary, Sean Spicer, was dropped from four cable systems in January after it failed to reach new carriage agreements with those companies.",
    "DirecTV did not comment on OAN beyond its initial statement saying the decision to drop it came “after a routine internal review.” But DirecTV Chief Executive Bill Morrow did offer an explanation in a memo to employees obtained by The Times.",
    "“The network is a known perpetrator of disinformation and extremism, fueling real-world violence and placing the health and safety of so many in jeopardy,” said Yosef Getachew, director of Common Cause Media & Democracy Program.",
    "The two channels gained notoriety in recent years by seeking out conservative viewers who believe right-leaning Fox News, the dominant ratings leader in cable news, did not show enough unwavering fealty to Trump.",
    "“We count 11 liberal news and information channels in a typical cable package, with Fox News Channel and Newsmax as the only alternatives,” Newsmax Chief Executive Chris Ruddy said in a statement to The Times.",
    "As late as March 2021, an OAN correspondent, Pearson Sharp, said in a report, “There’s still serious doubts about who’s actually president.” In another, he suggested COVID-19 vaccines are causing mass deaths.",
    "A 2017 Washington Post story on OAN, based on internal company emails, noted how Herring directed his channel to avoid any negative stories about Trump, who regularly promoted the outlet on his Twitter feed.",
    "The desperate calls for help — which would be considered unseemly on a traditional cable news outlet — follow DirecTV’s Jan. 15 announcement that it will drop San Diego-based OAN from its service in April.",
    "We believe that society as a whole benefits from more discussion and political views being represented, not less.”\nProgressive groups, which have lobbied companies to drop OAN, lauded DirecTV’s decision.",
    "OAN’s 80-year-old founder, tech entrepreneur Robert Herring, also went on camera to plead with viewers to ask other cable and satellite providers in their areas to add the channel to their lineups.",
    "The networks have said they were within their 1st Amendment rights to report on election-fraud allegations made by well-known public figures, including Trump, his advisors and members of Congress.",
    "As for OAN, the loss of revenue through DirecTV — Herring told his viewers the company gets 10 cents a month per subscriber — will mean it has to substantially alter its business model to survive.",
    "“While we worked in good faith to negotiate a fair agreement, Newsmax insisted on terms and conditions that we could not accept,” said Andrew Walton, a spokesperson for Breezeline.",
    "Both firms allege their reputations were damaged by false statements presented by anchors and guests who echoed Trump’s claims that the 2020 election was rigged against him.",
    "Newsmax is still a major comfort zone for Trump supporters — its biggest ratings come from live coverage of the former president’s rallies, which Fox News no longer airs.",
    "Before One America News Network host Dan Ball finished an interview with guest Jim Jordan this past week, he asked the Ohio Republican congressman for a favor.",
    "The cost of a cable package is a major factor in the consumers’ decision to cut the cord, which means service providers are under pressure not to raise rates.",
    "The pay TV providers who dropped OAN and Newsmax make the case that it’s not politics that drove their decisions but the upended economics of their business.",
    "(Fox Nation, the streaming service operated by Fox News, shows the cable channel’s programming only on a delayed basis and has no live news programming.)",
    "The lawsuits could create significant liabilities and a heap of bad publicity for the networks, complicating their relationship with distributors.",
    "“It could be the canary in the coal mine,” said one veteran cable distribution executive who was not authorized to discuss the matter publicly.",
    "But Newsmax declared Biden the winner of the 2020 election — something OAN resisted — and has been a strong supporter of COVID-19 vaccines.",
    "Cable and satellite companies are coping with subscriber loss as the emergence of streaming services, such as Netflix, disrupts TV habits.",
    "DirecTV, which AT&T spun off last summer, accounts for nearly half of the 35 million homes that can receive OAN on cable or satellite TV.",
    "While Newsmax has expressed support for OAN publicly, its executives privately distance themselves from their more extreme competitor.",
    "The number of pay TV homes declined by nearly 9% through the first nine months of 2021, according to research firm MoffettNathanson.",
    "“Please put some pressure on AT&T and DirecTV for us,” said Ball, whose “Real America” airs nightly on the right-wing cable channel.",
    "OAN could be offered as a direct-to-consumer subscription service or a free advertiser-supported video-on-demand streaming channel.",
    "OAN, Newsmax and Fox News are all being sued for defamation by voting technology companies Smartmatic and Dominion.",
    "“But don’t worry, we have a lot of options.”\nTimes staff writer Meg James contributed to this report.",
    "Herring also has a multichannel subscription streaming service called KlowdTV that includes OAN.",
    "OAN correspondents have promoted efforts to audit the vote counts in the 2020 election.",
    "Cable bills creep up when the cost to carry programming is passed along to consumers.",
    "Newsmax has noted it picked up carriage on 170 pay TV systems since November 2020.",
    "“All Americans are harmed when any voice, liberal or conservative, is closed down.",
    "“We don’t know exactly what we are going to do yet,” Herring told viewers.",
    "The channel is not broadly distributed enough to be measured by Nielsen.",
    "(Fox News has a pending motion to dismiss the Smartmatic suit.)",
    "OAN is not the only conservative outlet losing distribution.",
    "Both believe it’s now open season on conservative outlets.",
    "DirecTV has seen significant subscriber losses as well.",
    "(The company did not reply to a request for comment.)"
  ]
}