{
  "id": 6820,
  "mediaId": 3987,
  "date": "2022-01-31",
  "headline": "GOP’s 2022 Immigration Strategy: Misinformation, Fearmongering, and Xenophobia",
  "image": "http://americasvoice.org/wp-content/uploads/2022/01/GOP-1200x800.png",
  "link": "https://americasvoice.org/blog/gops-2022-immigration-strategy-misinformation-fearmongering-and-xenophobia/?utm_source=rss&utm_medium=rss&utm_campaign=gops-2022-immigration-strategy-misinformation-fearmongering-and-xenophobia",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Mueller",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In the video, a government contractor says “the government is betraying the American people.” Tucker Carlson gave the video a boost, highlighting it on his show saying, “the government is betraying the American people, that is true, the Biden administration is changing your country without your consent, it’s a crime and it’s immoral.” Picking up the line of “betrayal,” Republicans show what retaking majorities in congress will look like calling for impeachment and congressional investigations over standard practices turned into racist political stunts like this.",
    "A look at Republican messages, statements, and ads from the past week paints a picture of what we can expect over the next ten months: lies and distortions are key elements of their deliberate use of a race-based midterm strategy\nIf you were just listening to Republicans last week, you may believe that Joe Biden is engaged in a secret plot to remake the country by importing non-white migrants by the millions to locations all across the country.",
    "For those few who are not immediately detained or expelled, the GOP is working overtime to scare constituents into believing that there is a secret liberal plot led by President Biden involving migrants in the U.S. with asylum cases pending – including children in the care of the U.S. government – who are being transported into local communities in order to tip the political balance of local elections or somehow increase crime rates.",
    "They won’t send troops to stop the invasion of the U.S. because they’re the ones facilitating it.” A line that Trump himself used at his rally in Conroe, Texas over the weekend saying “before our leaders talk about invasions of other countries they need to stop the invasion of this country, it’s being invaded, it’s being invaded.",
    "For example, Rep. Jim Jordan, whose tweet Bump highlighted, misleadingly warned the apprehension numbers were “larger than the population of Cleveland, Cincinnati, and Columbus, Ohio combined.” While Jordan avoids using the language of replacement his absurd comparison in this context easily lends itself to that conclusion.",
    "On Wednesday and Thursday, Republicans were uplifting a five-month-old clip as some kind of proof of Biden’s plan to remake the country “under the cover of darkness.” Looking to continue their non-story around in-country migrant transport, Republicans uplifted the video recorded in August 2021.",
    "But, when the leaders of the Republican Party, their House and Senate political committees and their superPACS are pushing these ugly messages, they all own it – and Democrats should make sure to call out every Republican that does not forcefully push back.",
    "Rep. Jordan cited Biden’s 1.9 million apprehensions of migrants at the U.S. border with Mexico as evidence that Biden was not doing enough to apprehend migrants at the U.S. – Mexico border and compared that figure to the populations of three cities in Ohio.",
    "Combining a misleading use of statistics, out-of-context video clips, and cynical nativist politics, Republicans crafted this distorted reality as they look to make strategic xenophobia a cornerstone of their midterm message.",
    "It’s sickening what they’re doing to America by so blatantly disregarding the law.” Liz Harrington, the chief spokeswoman for Donald Trump, wrote on Twitter “The Swamp will send troops to fight an invasion of Ukraine.",
    "In a Washington Post column last week titled “The debate over immigration remains dependent on hyperbole more than reality”, Phillip Bump showed a Rep. Jim Jordan tweet as the exemplar of the problem.",
    "It was a broadly misleading tweet, certainly, but one that offers insight into how numbers related to the border are abused to paint a picture of a massive influx of migrants into the United States.",
    "Some Republicans in key battleground districts and competitive states will try to distance themselves from the racist rhetoric the mainstream of the GOP have adopted on immigrants and immigration.",
    "THE WEEK IN REVIEW:\nOn Monday, Customs and Border Patrol (CBP) released new apprehension numbers, and Republicans predictably ran with an intentionally misleading nativist version of the numbers.",
    "Under the current system, most of the people apprehended at the border have been rapidly expelled, in the case of an individual who attempts to cross again, that is counted as two apprehensions.",
    "This sort of transport has been the standard part of the asylum process for the last 20 plus years, but Republicans are looking to the images as revelations on some new “secret” plot.",
    "Stefanik had already been previously called out by the editorial board of the local paper in her upstate New York district for using “replacement theory” rhetoric in her Facebook ads.",
    "Or take Sen. Ted Cruz who draws the replacement theory” conclusion that migration is a Democratic voting scheme writing: “Over 2 MILLION illegal aliens crossed the border last year.",
    "His video showed the orderly processing of asylum seekers who were not immediately sent back under Title 42 and thus were being transported to other locations inside the US.",
    "This xenophobic distortion is a key talking point for Republican leadership, their top cable news broadcasts, and throughout the rank and file GOP, as exemplified last week.",
    "Second, as alluded to above, 60% of apprehensions have resulted in rapid expulsion or deportation with another large percentage going straight to immigration detention.",
    "While some in the media, like Bump, occasionally challenge the Republican narrative with basic facts, often their misinformation around immigration passes as reality.",
    "But the third-ranking House Republican, who became a purveyor of the dangerous and extremist “replacement theory” last fall, couldn’t’ be bothered with facts.",
    "Rep. Mo Brooks, a leading candidate for the Alabama Senate seat, tweeted “Joe Biden and the Socialist Democrats are aiding and abetting foreign invaders!",
    "Setting aside the logical gymnastics, the Congressman implied that millions of migrants are replacing red-blooded Americans as part of the liberal plot.",
    "The news media shouldn’t just accept and regurgitate their rhetoric and, instead, should point out the lies and distortions and overall lack of facts.",
    "Of note, one of Cruz’s sole contributions to the border debate was a widely mocked photo op last March and we can expect more of those this year, too.",
    "Republicans will continue to insist on their xenophobic fictions because they’ve got nothing else to offer and are not being challenged on the facts.",
    "His lede:\nRep. Jim Jordan (R-Ohio) offered a good distillation of one particular strain of anti-immigration rhetoric in a tweet earlier this week.",
    "More concerning were the explicit and euphemistic appeals to the white nationalist “replacement theory” Republicans made alongside these stories.",
    "They attack the Biden administration for being lax on immigration even as they cite a record number of arrests, detentions, and expulsions.",
    "?ILLEGAL IMMIGRANTS POURING IN” from her political accounts and “Unbelievable” from her official account, linking to the same article.",
    "Some elected Republicans and top spokespeople like Rep. Mo Brooks and Liz Harrington employed explicit “replacement theory” rhetoric.",
    "Political reporters should, at the very least, not mistake the GOP’s xenophobic political narrative as anything close to reality.",
    "Democrats need to call it out too because even fringe ideas become potent political weapons in Republican campaigns.",
    "For 20+ years, certain kids who arrive at the border get sent to shelters run by the Office of Refugee Resettlement.",
    "A disturbing phenomenon that America’s Voice has found to be fully embraced as an organizing principle for the GOP.",
    "President Biden and the Democrats do not care to secure the border because they see future Democratic voters.",
    "Repeat apprehensions are rising as a percentage of overall apprehensions, according to government statistics.",
    "So it’s worth examining Republicans’ leading immigration narratives and exposing them to the simple facts.",
    "Looking to use the stat for xenophobic fear-mongering, Republicans conveniently leave out this context.",
    "Over the next ten months between now and Election Day in November, we should expect more of the same.",
    "Melugin’s and Republicans framing, unsurprisingly, looked to tint the scene with xenophobic fear.",
    "Last week was a vivid reminder that Republicans don’t care about facts or offer solutions.",
    "They want to demagogue, frighten and distract and that is a key part of their 2022 agenda.",
    "Other leading Republicans were slightly more tactful but gestured at similar conclusions.",
    "On Tuesday, Republicans seized on a video tweeted out from Fox News’ Bill Melugin.",
    "Rounding up, Republicans claimed there were two million apprehensions last year.",
    "The most basic fact check exposes these nativist conspiracy theories as fiction.",
    "As Aaron Reichlin-Melkin pointed out:\nTHIS SHELTER HAS BEEN THERE FOR YEARS.",
    "There are two glaring, easy-to-find facts that belie their narrative here.",
    "And one need only look at what the GOP said last week to get the picture.",
    "Happened under Bush, Obama, and Trump!”\nYes, Bush, Obama, and Trump.",
    "First, total apprehensions does not equal total unique individuals.",
    "The third-ranking House Republican, Elise Stefanik, tweeted “?",
    "If the shelter is too far for a bus, they take a plane.",
    "It would be laughable if it wasn’t so dangerous.",
    "She has a political agenda to pursue.",
    "This lawlessness has to stop.",
    "#BidenBorderCrisis.",
    "It’s that cynical.",
    "Yes, even Trump.",
    "No conspiracy.",
    "That’s it."
  ]
}