{
  "id": 6829,
  "mediaId": 2522,
  "date": "2022-01-22",
  "headline": "Some CNN, MSNBC hosts have failed to update viewers after running ‘false’ SCOTUS feud story",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/01/reidanderson.jpg",
  "link": "https://www.bizpacreview.com/2022/01/22/some-cnn-msnbc-hosts-have-failed-to-update-viewers-after-running-false-scotus-feud-story-1191816/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Hill",
  "authorUrl": "https://www.bizpacreview.com/author/brooke-hill/",
  "termIds": [
    0
  ],
  "sentences": [
    "— Tom Elliott (@tomselliott) January 20, 2022\nJoy Reid told her MSNBC viewers on Tuesday that Gorsuch “loves COVID, which makes him the perfect Republican.” She called him a “rotten co-worker, dangerous to be near during the pandemic and tonight’s absolute worst.”\nCNN’s Anderson Cooper delved into Gorsuch’s recent book, “If You Can Keep It” to rip on his lack of a face covering, reading “to be worthy of our freedoms, we all have to adopt civic habits that enable others to enjoy them too,” which he cited as an “interesting” excerpt – apparently suggesting the justice was a hypocrite.",
    "A story published by National Public Radio was called out as false after it blamed Gorsuch for Sotomayor’s virtual attendance while all other justices heard the cases in person from the bench because – as reporter Nina Totenberg claimed – “Sotomayor did not feel safe in close proximity to people who were unmasked,” thus putting diabetic Sotomayor’s health in jeopardy if she were to be exposed to COVID.",
    "for his seat in the U.S. House of Representatives also got in on the action with a tweet calling Gorsuch an “a–hole who thinks he should get to control others’ bodies but no one should get to control his.”\nWhile Reid has failed to update her viewers on the truth about the alleged mask controversy, the network’s “Morning Joe” and “Deadline: White House” viewers did give an update on the story.",
    "Despite many over-the-top reports from the media including MSNBC’s Chris Hayes who called it a “shocking story” and alleged that Gorsuch’s maskless face constituted “deeply obnoxious behavior,” Grabien transcripts reveal that most of CNN’s and MSNBC’s prominent hosts have not issued any corrections to the story, according to a report by Fox News.",
    "They didn’t fail they didn’t want too\n— shawn gubernath (@Gubernathss) January 22, 2022\nIf they report the truth they wouldn’t have a problem but they only report what Biden wanting to do\n— Larry Estelle (@larry_estelle) January 22, 2022\nCNN is never never wrong because, in their opinion, propaganda is not misinformation.",
    "I’ll trust Nina Totenberg’s reporting on the Supreme Court\n— Cynthia Wendt (@cynwendt) January 22, 2022\nOthers came to a different conclusion about the lack of correction, indicating that may have known full well that it was false, but since it helped support their narrative, it wasn’t worth correcting.",
    "And to firm up the truth of the controversy, Chief Justice John Roberts also issued a statement over NPR’s report that he “asked” the high court justices to mask up although it too has been largely ignored by the liberal media.",
    "SIGN UP HERE\nHardly a peep has been heard from the liberal media this week to correct the Tuesday frenzy about a now-debunked story alleging that Supreme Court Justices Sonia Sotomayor and Neil Gorsuch were fighting over masks.",
    "Despite hearing straight from the horse’s mouth that the mask controversy was fabricated, some people are choosing to stick with the narrative instead of the truth.",
    "However, Sotomayor and Gorsuch later released a joint statement making it clear that NPR and the news agencies that ran with the story were peddling falsehoods.",
    "CNN’s John King also did a report on the justice’s statements debunking the story, although he had not previously pushed the false narrative.",
    "The “COVID mask controversy” at the high court was also hawked by CNN host Don Lemon – which he has still not corrected.",
    "The report alleged that Gorsuch failed to wear a mask despite a request from Chief Justice John Roberts to do so.",
    "While we may sometimes disagree about the law, we are warm colleagues and friends.” the statement read.",
    "Ohio liberal Shannon Freshour who unsuccessfully ran against Republican Congressman Jim Jordan (R-Oh.)",
    "“I did not request Justice Gorsuch or any other Justice to wear a mask on the bench,” Roberts wrote.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "“Reporting that Justice Sotomayor asked Justice Gorsuch to wear a mask surprised us.",
    "— Big Shoe Drop (@bigshoedrop) January 22, 2022\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "Check out a sampling of the media’s hysteria over the purported feud:\nSUPERCUT!",
    "Get the latest BPR news delivered free to your inbox daily.",
    "The public will not see it and we do not share it.",
    "It is false."
  ]
}