{
  "id": 6863,
  "mediaId": 2521,
  "date": "2022-01-31",
  "headline": "Criminal Referrals For Trump Lawyers Via Jan. 6 Panel Pushed By Analyst",
  "image": "",
  "link": "https://bipartisanreport.com/2022/01/31/criminal-referrals-for-trump-lawyers-via-jan-6-panel-pushed-by-analyst/",
  "mediaOutlet": "bipartisanreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caleb Newton",
  "authorUrl": "https://bipartisanreport.com/author/caleb/",
  "termIds": [
    1670,
    2201,
    2422,
    3267,
    3500,
    3914,
    4109,
    1132,
    4887
  ],
  "sentences": [
    "Those who Honig singled out include Trump lawyers Rudy Giuliani and Jenna Ellis, both of whom were involved in efforts to overturn the election outcome and were more recently subpoenaed by the riot investigation committee — and both of whom have since essentially dismissed the panel’s demands for information.",
    "In a new article, ex-federal prosecutor and CNN legal analyst Elie Honig insisted that the House committee investigating the Capitol riot needs to take aggressive actions — including the approving of criminal referrals — against certain witnesses who’ve refused to cooperate with its investigation.",
    "If it’s truly committed to learning the full truth, it will subpoena each target, hold those who continue to stonewall in contempt and send them to the Justice Department for potential prosecution.’\nThe 1/6 Committee is examining how the insurrection took place and why.",
    "As for Giuliani and Ellis, they’re not yet among those who have been recommended by the committee for prosecution over contempt of Congress; so far, such recommendations have been approved by the panel for just three people and approved by the full House for two.",
    "Through its dogged investigative work, the committee has uncovered damning testimony and documents proving that the effort to steal the 2020 election was premeditated and deliberate, and that former President Donald Trump stood at the epicenter of it all.",
    "The future of the committee in a potentially Republican-led House isn’t clear — but it “would take some time for the committee to pursue these recalcitrant subjects in Congress and potentially in the courts — and the clock is ticking,” as Honig observed.",
    "— Citizens for Ethics (@CREWcrew) January 31, 2022\nFor those latter four individuals, including Ivanka and the three GOP House members, the committee has yet to issue any subpoenas; instead, investigators simply formally requested their testimony.",
    "Trump uses language he knows caused the Jan 6 violence; suggests he’d pardon the Jan 6 defendants, some of whom have been charged with seditious conspiracy; threatens prosecutors; and admits he was attempting to overturn the election.",
    "Honig also brought up Ivanka Trump — the former president’s daughter, who served as a top adviser in his administration; and GOP Reps. Kevin McCarthy (Calif.), Jim Jordan (Ohio), and Scott Perry (Pa.).",
    "In the near future, investigators are planning to host public hearings essentially laying out the case for the American people, in addition to their continuing investigative work.",
    "— Adam Schiff (@RepAdamSchiff) January 30, 2022\nRecommendations from the House for prosecutions on charges of contempt of Congress do not force the Justice Department to act.",
    "Honig wrote as follows:\n‘The House select committee on January 6 has, thus far, done a remarkable job exposing the truth behind the Capitol insurrection.",
    "But the committee also has plenty of unfinished business… In all of these instances, the committee faces a stark choice: Play hardball or give up.",
    "The full House has referred Trump allies Steve Bannon and Mark Meadows for prosecution; so far, just Bannon has faced charges from prosecutors.",
    "(In the third case, the contempt proceedings for ex-Justice Department official Jeffrey Clark were halted amid attempts to get his testimony.)",
    "Meanwhile, other critical factors are weighing on the investigative panel’s work — including time, as Honig noted.",
    "There's no both sides to supporting a violent attempt to overthrow the government.",
    "There was an attempted coup and Donald Trump is backing another one.",
    "Trump’s offer to pardon those responsible shows we’re still at risk.",
    "And suggests his only regret about Jan 6 is that it did not succeed.",
    "To ensure our democracy never again comes so close to the brink.",
    "So far, they’ve heard from hundreds of witnesses.",
    "— Liz Cheney (@Liz_Cheney) January 31, 2022",
    "He’d do it all again if given the chance.",
    "Read more at this link."
  ]
}