{
  "id": 6868,
  "mediaId": 2569,
  "date": "2022-01-21",
  "headline": "Rick Scott says there’s no ‘war’ between Donald Trump, Ron DeSantis",
  "image": "https://floridapolitics.com/wp-content/uploads/2021/04/Rick-Scott-1.png",
  "link": "https://floridapolitics.com/archives/488705-rick-scott-says-theres-no-war-between-donald-trump-ron-desantis/",
  "mediaOutlet": "floridapolitics.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1301,
    1670,
    2201,
    2202,
    2292,
    2352,
    3573,
    4112,
    4168
  ],
  "sentences": [
    "That same day, Trump associate Roger Stone — teasing his own third-party challenge to DeSantis’ re-election in 2022 — released a video claiming the former President had to “drag (DeSantis) over the finish line” in 2018 against Democrat Andrew Gillum.",
    "The comments came in the wake of widely reported tensions between the two, including claims it would be “too much to ask” for DeSantis to preemptively endorse another Trump term in 2024, while he lamented a “dull” DeSantis.",
    "On Wednesday, Lara Trump discounted rumors of “bad blood” between the two Republicans while suggesting Florida’s Governor may need “another opportunity” to demonstrate his support for Trump ahead of 2024.",
    "Jeanette Nuñez dismissed reports of a split as “media obsession” and “made-up animosity.”\nFor his part, the Governor is trying to avoid giving engaging quotes on the matter.",
    "The Hewitt interview follows up on Trump’s move to shoot down rumors of a feud with DeSantis, while reminding listeners that Trump helped the Governor get elected.",
    "“I think Ron said it last week, he said it very publicly, ‘The press is never going to get in the middle of my friendship with Donald Trump.",
    "Ron’s been very good, he’s been a friend of mine for a long time.”\nNext, Trump pivoted to the reported quarrels between him and DeSantis.",
    "We’re not going to do that stuff.’”\n“And he said it very strongly, which I thought was really interesting, actually, and very nice.",
    "'”\nScott, who preceded DeSantis as Governor, has shied away from discussing DeSantis with any specificity in the last three years.",
    "Sen. Rick Scott was asked on Friday’s “Hugh Hewitt Show” about what the host called a “war” between Donald Trump and Ron DeSantis.",
    "Those on the Trump side of the divide are more willing to stoke the fires of discontent than DeSantis adherents seem to be.",
    "“And intend to have it for a long time.”\nTrump’s words seem to be an attempt to spackle over reports of a rift.",
    "And he said that, and I agree with him 100%.”\n“I have a very good relationship with Ron,” Trump added.",
    "We need everybody united for a big red wave in 2022,” DeSantis said last week on the Ruthless podcast.",
    "Every time I talk to the President, he’s asking me, ‘What can I do to help you get the Senate back?",
    "“I talk to both of them and it’s never come up in any of those conversations,” Scott told Hewitt.",
    "Hewitt played a clip of Trump on the Sean Hannity program Thursday night making those arguments.",
    "He was right in front along with Jim Jordan and all of the rest of them; they were fantastic.",
    "It was a great thing, and Ron was one of them.”\n“Ron wanted to run, and I endorsed him.",
    "The Senator has not weighed in until now on much of the Governor’s political action.",
    "In most 2024 GOP primary polls, DeSantis is running second to the former President.",
    "Meanwhile, during a Tuesday appearance on the Fox Business Channel, Lt. Gov.",
    "and I helped him greatly, and he went on,” Trump continued.",
    "“Don’t take the bait, and just kind of keep on keeping on.",
    "“Ron was very good on the (Robert) Mueller hoax.",
    "'I talk to both of them and it's never come up.'",
    "But you have to listen, talk to both of them.",
    "“He’s done a really terrific job in Florida.",
    "But it’s never come up in my conversations.",
    "“I get along great with Ron,” Trump said.",
    "“It’s totally fake news,” he contended.",
    "Republicans really stuck together.",
    "I don’t believe that it’s true.",
    "“And so I’ve never seen it.",
    "I hope it’s not true."
  ]
}