{
  "id": 6877,
  "mediaId": 2595,
  "date": "2022-01-21",
  "headline": "Trump MURDERS the Fake Trump-DeSantis Feud Story",
  "image": "https://i0.wp.com/www.independentsentinel.com/wp-content/uploads/2022/01/trump-desantis.jpg?fit=600%2C317&ssl=1",
  "link": "https://www.independentsentinel.com/trump-murders-the-fake-trump-desantis-feud-story/",
  "mediaOutlet": "independentsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "M Dowling",
  "authorUrl": "https://www.independentsentinel.com/author/freebird/",
  "termIds": [
    1301,
    1670,
    2201,
    2202,
    3434,
    3467,
    404,
    4977
  ],
  "sentences": [
    "DeSantis by calling it “TOTALLY FAKE NEWS” pic.twitter.com/XPezBHSkcy\n— Danny De Urbina (@dannydeurbina) January 21, 2022",
    "Don’t believe these anonymously-sourced articles without triple-checking and then triple-checking again.",
    "Donald Trump’s advisers think Mitch McConnell was behind it, and that certainly is a reasonable guess.",
    "The story was created by Trump-hating authors with anonymous sources in a far-left newspaper.",
    "He says the press is never going to get in the middle of my friendship with Donald Trump.",
    "Watch:\nTrump just MURDERED the media narrative that there’s tension between him and Gov.",
    "No, I have a very good relationship with Ron and intend to have it for a long time.",
    "He was — he was right up front, along with Jim Jordan and all of the rest of them.",
    "Former President Trump fully denied reports that he is “feuding” with Florida Gov.",
    "Hannity asked him about it, saying he heard from a friend that the story was BS.",
    "As it appeared to be, the Trump-DeSantis feud was more fake news.",
    "And he went on, and he’s done a really terrific job in Florida.",
    "I thought it was very interesting, actually, and very nice.",
    "I think Ron said last week — he said it very publicly.",
    "Ron DeSantis, Thursday with FNC’s Sean Hannity.",
    "He’s been a friend of mine for a long time.",
    "And Ron wanted to run, and I endorsed him.",
    "Donald Trump responded:\nWell, he is right.",
    "It never sounded like a legitimate story.",
    "And I agree with him on that 100 percent.",
    "Ron was very good on the Mueller hoax.",
    "The Republicans really stuck together.",
    "And I think Ron has been very good.",
    "We’re not going to do that stuff.",
    "And he said it very strongly.",
    "And that helped him greatly.",
    "I get along great with Ron.",
    "And it was a great thing.",
    "So did Governor DeSantis.",
    "And Ron was one of them.",
    "It’s totally fake news.",
    "They were fantastic.",
    "But he said that."
  ]
}