{
  "id": 6907,
  "mediaId": 2724,
  "date": "2022-01-27",
  "headline": "DeSantis Blames ‘Corporate Media’ For Trying To ‘Manufacture’ Feud Between Him And Trump",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/01/2022.01.26-09.08-thepoliticalinsider-61f1b8397f9af.jpg",
  "link": "https://thepoliticalinsider.com/desantis-blames-corporate-media-for-trying-to-manufacture-feud-between-him-and-trump/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Hanson",
  "authorUrl": "https://thepoliticalinsider.com/author/john-hanson/",
  "termIds": [
    1301,
    2201,
    3792,
    3975,
    404,
    4977
  ],
  "sentences": [
    "DeSantis made his remarks during an interview Fox News’ “The Ingraham Angle.”\nDeSantis: 'The Corporate Media Is Trying to Manufacture' a Trump-DeSantis Feud https://t.co/L5uifs4OhO\n— The TN (@Thewiseonewon) January 26, 2022\nRELATED: Biden’s Deputy National Security Advisor: Border Should Be ‘Inviolate’ … Ukraine’s Border That Is\nDeSantis: ‘The corporate media is trying to manufacture something where something doesn’t exist’\nDeSantis explained that the claims of a feud between him and Trump was something the media invented to distract from Joe Biden’s disastrous presidency.",
    "“But as clever as the media figures running the operation apparently thought they were, neither of the top Republicans took the bait, understanding that it only serves their political opponents’ interest to have them squabbling,” Hemingway wrote.",
    "https://t.co/YCTJpQvpGl\n— Mollie (@MZHemingway) January 20, 2022\nTrump Calls Feud ‘Fake News’ Invention\nTrump agrees with DeSantis, telling Fox News’ Sean Hannity that he has a good relationship with DeSantis: “I get along great with Ron.",
    "‘They’re a threat to the establishment’\nThe Federalist’s Mollie Hemingway recently observed in an opinion column, “It’s not an accident that corporate media are trying to pit former President Donald Trump and Florida Gov.",
    "Among Republicans, the former president and current governor of Florida are popular for their policies and willingness to fight the media.”\n“That means they’re a threat to the establishment,” Hemingway declared.",
    "“That ain’t going to happen.”\nIt’s not an accident that corporate media and other political opponents are trying to pit GOP's two most popular figures — President Donald Trump and Florida Gov.",
    "“And he had my back, and then when he ran for reelection, we had his back in Florida, raised a bunch of money.”\n“He had a great margin of victory in Florida,” DeSantis added.",
    "“And they’re just trying to create divisions.”\nThe governor then gave his reasons for why he thinks the media needs a rift between Trump and himself to exist.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "He was right in front along with Jim Jordan and all of the rest of them.”\nFurther, Trump has blamed talk of a feud on Mitch McConnell and his allies.",
    "And they know he’s failing on all fronts.”\nSign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "“So, they’re trying to divert attention away from those failures and trying to create fissures in the Republican Party,” DeSantis finished.",
    "“We see eye to eye on all of the big issues.”\n“And so, I have zero, zero animosity or anything,” DeSantis added.",
    "DeSantis’ comments are similar to conclusions drawn by Trump about the supposed feud in recent weeks.",
    "Look, when I ran for governor, he endorsed me when everyone said, don’t do it,” DeSantis continued.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "“He had the worst first year of any president in the United States history since the 1800s.",
    "“The corporate media is trying to manufacture something where something doesn’t exist.",
    "But notable how both their teams dismissed the effort.",
    "“And why are they doing that, Laura?” asked DeSantis.",
    "“Because they know Biden is failing,” he said.",
    "Ron was very good on the Mueller hoax.",
    "Ron DeSantis — against each other.",
    "Ron DeSantis against each other."
  ]
}