{
  "id": 692,
  "mediaId": 2597,
  "date": "2022-04-22",
  "headline": "House Republicans Demand Twitter Board Preserve All Records Related to Musk Buyout Bid",
  "image": "https://api-assets.infowars.com/2022/04/mksskwitter.jpg",
  "link": "https://www.infowars.com/posts/house-republicans-demand-twitter-board-preserve-all-records-related-to-musk-buyout-bid/",
  "mediaOutlet": "InfoWars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“You should construe this preservation notice as an instruction to take all reasonable steps to prevent the destruction or alteration, whether intentionally or negligently, of all documents, communications, and other information, including electronic information and metadata, that is or may be potentially responsive to this congressional inquiry.”\nThe request signals that should Republicans take back the majority in the House in the 2022 midterm elections, they may launch an investigation into Twitter, especially if the company declines to take the offer from Musk, who’s CEO of Tesla and SpaceX.",
    "Among other things, the Board’s reactions to Elon Musk’s offer to purchase Twitter, and outsider opposition to Musk’s role in Twitter’s future are concerning.”\nTwitter has come under fire for years of censoring conservative opinions as well as legitimate news, such as the Hunter Biden laptop scandal – which the social media giant blocked all mention of in October 2020, weeks before the US election.",
    "“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” reads the letter.",
    "According to a Friday letter seen by CNBC, House Judiciary Committee Republicans led by ranking member Rep. Jim Jordan (R-OH) have asked Twitter board chairman Bret Taylor to preserve any communications from both official and personal accounts – including those sent using encryption – that have anything to do with Musk’s offer.",
    "-CNBC\nThe letter continues; “Decisions regarding Twitter’s future governance will undoubtedly be consequential for public discourse in the United States and could give rise to renewed efforts to legislate in furtherance of preserving free expression online.",
    "18 House Republicans have demanded that Twitter’s board preserve all records related to Elon Musk’s buyout offer – suggesting that they will conduct a congressional probe if their party regains control of the chamber this fall.",
    "The platform has become a focal point for some conservative members who’ve charged that Twitter unfairly removes or moderates posts on ideological grounds.",
    "At the time, Twitter said they blocked the story because it violated its ‘hacked materials’ policy, and included personal email addresses.",
    "Under Republican control, the House Judiciary Committee could decide to subpoena records about the board’s internal deliberations.",
    "Twitter has denied doing so and says it enforces standards based on its community guidelines.",
    "It’s not the first time Twitter has caught the attention of Republican lawmakers.",
    "Later, former CEO Jack Dorsey said it was “wrong” to block the story.",
    "Join the fight for humanity’s soul at Saveinfowars.com:"
  ]
}