{
  "id": 6929,
  "mediaId": 2644,
  "date": "2022-01-28",
  "headline": "Republicans ask DOJ to probe ‘racial discrimination’ against whites in COVID treatment",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/01/covid-nyc-state-comp.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/01/28/gop-ask-doj-to-probe-priority-non-whites-covid-treatment/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steven Nelson",
  "authorUrl": "",
  "termIds": [
    1670,
    1934,
    4035,
    4117,
    395,
    878,
    1132
  ],
  "sentences": [
    "The New York Department of Health separately stated in a Dec. 27 memo to health care providers that a patient’s race should be considered as part of broader “criteria” in distribution of oral antiviral pills such as Paxlovid that reduce the severity of COVID-19, with the department noting the supply “will be extremely limited initially.”\n“Non-white race or Hispanic/Latino ethnicity should be considered a risk factor, as longstanding systemic health and social inequities have contributed to an increased risk of severe illness and death from COVID-19,” the state agency said.",
    "“Absent evidence showing that race, independent of other factors, directly leads to different levels of COVID-19 severity for patients, this guidance appears to be nothing more than the FDA injecting the malignant scourge of Critical Race Theory into public health policy.”\nThey continue: “Based upon the FDA’s appalling guidance, certain states, including New York, Minnesota, and Utah, prioritized race over high-risk medical conditions in furnishing these lifesaving treatments.",
    "Cornell law professor William Jacobson filed a lawsuit last week asserting that “New York’s use of racial preferences in the distribution of COVID-19 treatments is unconstitutional.”\nFormer President Donald Trump blasted the policies at a rally this month in Arizona, saying, “in New York State, if you’re white, you have to go to the back of the line to get medical help.",
    "Department spokesperson Erin Silk defended the memo, telling Politifact, “These are neither qualifications nor requirements for treatments.”\n“No one in New York who is otherwise qualified based on their individual risk factors will be turned away from life-saving treatment because of their race or any demographic identifier,” Silk further insisted.",
    "“Racism is an evil that our country has fought against for generations, and we must stand up for the rights of all Americans to receive equal protection under the law,” Reps. Jim Jordan of Ohio, Dan Bishop of North Carolina, Darrell Issa of California and 13 others wrote in a Friday letter to Attorney General Merrick Garland.",
    "For example, New York’s Department of Health published a memo detailing its plans for prioritization of monoclonal antibodies and oral antiviral treatments with one ‘risk factor’ being a race or ethnicity that is not White due to ‘longstanding systemic health and social inequities.",
    "A group of House Republicans has demanded the Justice Department tackle what the lawmakers call “shocking displays of racial discrimination” in states like New York that encourage hospitals to consider a patient’s race when deciding if they should receive COVID-19 treatments.",
    "The Food and Drug Administration said last month that “race or ethnicity” was one of the “medical conditions or factors” that could be considered in distribution of sotrovimab, the only monoclonal antibody treatment that’s used against the Omicron variant of COVID-19.",
    "“We seek information about the Department of Justice’s (DOJ) efforts to protect the rights of Americans from discriminatory actions by state governments during the COVID-19 pandemic,” the legislators wrote.",
    "'”\nThe letter requests a briefing by Feb. 11 to discuss “these flagrantly unconstitutional policies”— though such demands are routinely ignored by federal agencies.",
    "“These policies commit state and local health departments to rationing medical care in a way prohibited by the Fourteenth Amendment,” the letter to Garland says.",
    "“The Fourteenth Amendment to the Constitution provides that no State shall ‘deny to any person within its jurisdiction the equal protection of the laws.",
    "If you’re white, you go right to the back of the line.”\nThe Justice Department did not immediately respond to The Post’s request for comment.",
    "But the House Republicans say the FDA and state policies — also adopted in Minnesota and Utah — wrongfully mention race as a consideration.",
    "'”\n“At no point does the FDA cite any scientific support for treating patients differently based on their race,” the Republicans wrote.",
    "“These shocking displays of racial discrimination run counter to the principles we hold dear as Americans,” the letter says.",
    "The issue of racial disparities in COVID-19 treatment is an emerging focus of Republicans and legal scholars.",
    "None of New York’s eight House Republicans signed the letter.",
    "Think of it."
  ]
}