{
  "id": 6956,
  "mediaId": 2724,
  "date": "2022-01-19",
  "headline": "Report: Dozens Of Former Trump Officials Plot Efforts To Stop Trump In 2024",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/01/2022.01.19-03.01-thepoliticalinsider-61e827b606b7b.jpg",
  "link": "https://thepoliticalinsider.com/report-dozens-of-former-trump-officials-plot-efforts-to-stop-trump-in-2024/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rusty Weiss",
  "authorUrl": "https://thepoliticalinsider.com/author/rusty-weiss/",
  "termIds": [
    1518,
    2201,
    2840,
    3436,
    3820,
    983
  ],
  "sentences": [
    "One participant on the conference call told the network, “This cannot just be a professional trolling operation, putting out ads like the Lincoln group.”\nCNN adds that the latest band of former officials trying to stop Trump have “no name, membership, or specific goals as of now.”\n“We’re still trying to figure out what it is” that we want to do, the aforementioned participant added.",
    "While McAuliffe’s Democratic party denies any involvement, The Lincoln Project staged a racist hoax against the Younkin Campaign by paying operatives to stand outside Youngkin’s bus with tiki torches\n— Benny (@bennyjohnson) November 2, 2021\nThis new group, according to CNN, is doing their best to distance themselves from the other group.",
    "More than 30 former Trump officials hold secret call aimed at working against former president’s efforts to sway 2022 midterms https://t.co/BhhyklCNrW\n— Daily Mail US (@DailyMail) January 18, 2022\nSign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "https://t.co/MkcTEY6Usp\n— The Daily Beast (@thedailybeast) January 19, 2022\nBetter Than The Lincoln Project\nIf you were under the impression that this cabal was pathetic, consider this – Even they managed to rip on another group of pathetic ‘Never Trumpers’ in the form of the Lincoln Project.",
    "“Around three dozen former Trump administration officials, disillusioned with their former boss and concerned about his impact on the GOP and the nation, held a conference call last Monday to discuss efforts to fend off his efforts to … erode the democratic process,” CNN wrote.",
    "Taylor, you may recall, lied about his position to publish an anonymous opinion piece in the New York Times bragging that he was “part of the resistance inside the Trump administration.”\nOthers, like Kelly and Scaramucci, had beefs with Trump.",
    "You may recall that the group was so desperate to stop Glenn Youngkin from winning the governor’s race in Virginia, that they staged an incident using fake white nationalists holding little tiki torches outside one of his campaign busses.",
    "Nearly three dozen officials who worked in former President Donald Trump’s administration or orbit held a conference call last Monday to discuss ways to stop their old boss from trying to sway the midterms or winning himself in 2024.",
    "Those involved included former White House chief of staff and retired Marine General John Kelly, former White House communications director Anthony Scaramucci, and Miles Taylor, former DHS chief of staff.",
    "The network also noted that, despite Taylor’s insistence that they’re “overflowing with ideas,” participants weren’t exactly successful in planning a path forward on how to stop Trump in 2022 and 2024.",
    "CNN adds that the group is “way behind the efforts of former President Donald Trump and his allies to set the stage for 2022, 2024, and beyond.”\nAlways bridesmaids, these people, never the bride.",
    "Essentially a group of people who had nothing better to do on a Monday night than share in a virtual group hug to console each other over the eventual reemergence of Trump in the political arena.",
    "The Lincoln Project is an organization composed of an island of misfit toys, rejects from a bygone establishment Republican Party so far adrift that they’re indiscernible from the far-left.",
    "Kelly, according to CNN, couldn’t be bothered with the entire hour-long conference call and instead was only able to “monitor” about 10 minutes of the conversation.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "“The only items the group seemed to agree upon in its first meeting, however, were that they’re not sure what their way forward should be,” CNN explained.",
    "Get Trump\nThe meeting between former Trump officials attempting to stop him in 2024 was reportedly every bit as hilarious as you might imagine.",
    "A group of Trump White House outcasts met for an hourlong phone call last week to discuss thwarting their former boss’ political goals.",
    "CNN reported on the call which involved over 30 officials who worked in the Trump administration.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "No ideas, bound only by a shared hatred and broken heart over the former President.",
    "Though they seemed to only agree on one thing: Trump needs to be stopped.",
    "Taylor says the group was “overflowing with ideas” on ways to stop Trump.",
    "Doesn’t that summarize the ‘Never Trump’ movement perfectly?",
    "It looks like a list of disgruntled former staff."
  ]
}