{
  "id": 6998,
  "mediaId": 2569,
  "date": "2022-01-21",
  "headline": "‘Remove Ron’ trolls Donald Trump for not keeping DeSantis in line",
  "image": "https://floridapolitics.com/wp-content/uploads/2022/01/RemoveRonTrump.jpg",
  "link": "https://floridapolitics.com/archives/488784-remove-ron-trolls-donald-trump-for-not-keeping-gov-desantis-in-line/",
  "mediaOutlet": "floridapolitics.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1301,
    1670,
    2201,
    2202,
    3467,
    404
  ],
  "sentences": [
    "We’re not going to do that stuff.’”\nThose comments came in the wake of widely reported tensions between the two, including claims it would be “too much to ask” for DeSantis to preemptively endorse another Trump term in 2024, while he lamented a “dull” DeSantis and alluded to “gutless” politicians who wouldn’t say whether they had been fully vaccinated against COVID-19.",
    "“But after all this time, if Ron weren’t thinking of challenging you for President, don’t you think he would have told you by now?”\nThe ad comes as Trump continues to remind national audiences that he made DeSantis a national figure.",
    "Ron’s been very good, he’s been a friend of mine for a long time.”\n“It’s totally fake news,” he added, referencing rumors of friction between the two.",
    "“I think Ron said it last week, he said it very publicly, ‘The press is never going to get in the middle of my friendship with Donald Trump.",
    "Ron DeSantis as “totally fake news,” a political organization working against the Governor’s re-election continues to bet otherwise.",
    "On Friday, Remove Ron released its third ad in a series “skewering Trump” regarding DeSantis’ alleged insubordination.",
    "“Magic Words” mocks Trump, arguing DeSantis is unwilling to bend the knee and endorse another Trump term.",
    "He was right in front along with Jim Jordan and all of the rest of them; they were fantastic.",
    "“Rumor is, you’re still waiting for those magic words from Ron,” the narrator continues.",
    "It was a great thing, and Ron was one of them.”\n“Ron wanted to run, and I endorsed him.",
    "Then he continued that narrative on Sean Hannity’s Fox News show later that night.",
    "Even though former President Donald Trump dismissed rumors of a schism with Gov.",
    "Trump said early Thursday he has a “very good relationship” with DeSantis.",
    "Or perhaps something Ron hasn’t said yet?” a voiceover asks.",
    "and I helped him greatly, and he went on,” Trump continued.",
    "“Ron was very good on the (Robert) Mueller hoax.",
    "“He’s done a really terrific job in Florida.",
    "“I get along great with Ron,” Trump said.",
    "Republicans really stuck together.",
    "“What’s the matter, Donald?",
    "Is it something Ron said?"
  ]
}