{
  "id": 7031,
  "mediaId": 4091,
  "date": "2022-01-24",
  "headline": "More leaked texts from the Jan. 6 Committee show messaging coordination between Hannity, McEnany",
  "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2022/01/mcenany.jpg",
  "link": "https://www.naturalnews.com/2022-01-24-more-leaked-texts-jan-6-committee-trump-messaging-coordination.html",
  "mediaOutlet": "Natural News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JD Heyes",
  "authorUrl": "https://www.naturalnews.com/author/jdheyes",
  "termIds": [
    1670,
    1886,
    2201,
    2202,
    2298,
    2599,
    3750,
    404
  ],
  "sentences": [
    "For instance, no one on the panel, including the two anti-Trump Republicans — Reps. Liz Cheney of Wyoming, the co-chair, and Adam Kinzinger of Illinois — wants to know what role the FBI and deep state played in setting up the obvious false flag that was established ahead of the Capitol assault, as noted in observations published by an expert less than a week later.",
    "(Natural News) It is becoming quite apparent that the primary reason why Nancy Pelosi’s ‘select’ committee to ‘investigate’ the Jan. 6 Capitol false flag attack is so certain members can selectively leak certain portions of information obtained by the panel for the sole purpose of ‘convicting’ former President Donald Trump in the court of public opinion — again.",
    "I will help reinforce.”\nAlso, Hannity said he believed it was “key” to keep Trump away from certain people, texting: “No more crazy people,” leading McEnany to respond: “Yes, 100%.”\nHannity also wrote in a text to Rep. Jim Jordan (R-Ohio) and then-White House Chief of Staff Mark Meadows:\nGuys, we have a clear path to land the plane in 9 days.",
    "A few young men wearing Trump or MAGA hats backwards and who did not fit in with the rest of the crowd in terms of their actions and demeanor, whom I presumed to be Antifa or other leftist agitators; and\nDisciplined, uniformed column of attackers.",
    "Specifically, Hannity, on Jan. 7, texted a “five-point plan” to McEnany to control then-President Trump’s responses both to the false flag and in terms of continuing to insist that his reelection was stolen (though it clearly was).",
    "For the record, the FBI has already determined that there was no central plot to ‘storm the Capitol’ by ‘right-wing extremist terrorists,’ as Reuters reported in August — despite what this bogus panel suggests.",
    "The most recent leak involves text messages sent between Fox News’ Sean Hannity and then-White House press secretary Kayleigh McEnany, who is now, not so ironically, a paid Fox News contributor.",
    "These people were there specifically to stage an attack on the Capitol so that Trump would be blamed — and it’s very likely the FBI was involved, as Tucker Carlson of Fox News has speculated.",
    "A column of organized, disciplined men, wearing similar but not identical camouflage uniforms and black gear, some with helmets and GoPro cameras or wearing subdued Punisher skull patches.",
    "Scattered groups of men exhorting the marchers to gather closely and tightly toward the center of the outside of the Capitol building and prevent them from leaving;\nFake Trump protesters.",
    "Militant, aggressive men in Donald Trump and MAGA gear at a front police line at the base of the temporary presidential inaugural platform;\nAgents-provocateurs.",
    "J. Michael Waller, who was at the Capitol that day, wrote about what he saw in a piece for The Federalist a week after the breach:\nPlainclothes militants.",
    "Per the letter, he continued, “2- Yes, impeachment and the 25th amendment are real and many people will quit.”\nShe replied, “Love that.",
    "“1- No more stolen election talk,” Hannity texted McEnany, who sat down with committee investigators last week after being subpoenaed.",
    "Ideas?”\nThe committee has been working on getting all the information it can but only from Trump and his allies and surrogates.",
    "It’s unclear what three of the five points were, as the committee only selectively leaked the first two.",
    "And worse, I’m not sure what is left to do or say, and I don’t like knowing if it’s truly understood.",
    "You don’t go to a political rally to hear the president speak dressed like this.",
    "I did not have a good call with him today.",
    "He can’t mention the election again.",
    "Sources include:\nTheFederalist.com",
    "And that’s exactly what happened.",
    "That is the playbook.",
    "Thank you.",
    "Ever."
  ]
}