{
  "id": 7080,
  "mediaId": 2818,
  "date": "2022-01-20",
  "headline": "FAUCI’S FLAGGING SUPPORT: Poll Shows Four out of Five Young Americans Think Fauci Should Resign",
  "image": "https://tf-a1.azureedge.net/uploads/2021/11/AP21308512560132-1200x630.jpg",
  "link": "https://www.thefirsttv.com/faucis-flagging-support-poll-shows-four-out-of-five-young-americans-think-fauci-should-resign/",
  "mediaOutlet": "theresurgent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The First",
  "authorUrl": "https://www.thefirsttv.com/author/thefirst/",
  "termIds": [
    1670,
    2576
  ],
  "sentences": [
    "In the older age brackets of 35-44, 45-64, and 65+, respondents favored Fauci, supporting him by 57.4%, 50.5%, and 53.6% respectively.”\nBad news for Fauci, who also may be facing an investigation should the GOP win back the House; Jim Jordan (R-OH) has promised to go after the doctor.",
    "“If the American people put us back in charge, we are definitely going to [investigate Fauci] because we now know without a doubt that Dr. Fauci knew on Jan. 31 and Feb. 1 that this thing came from a lab,” Congressman Jim Jordan (R-OH) said Sunday in an interview on Fox News.",
    "The age bracket of 25-34 years old nearly flips the views of the young group, with 71.1% saying Fauci should stay while just 28.9% say that Fauci should resign.",
    "One scientist says, ‘I don’t see how this can happen in nature, but it would be easy to do in a lab.’”\nRead the full report over at the Daily Wire.",
    "According to the Daily Wire, “Among young people aged 18-24, Fauci’s leadership is deeply unpopular.",
    "Among respondents, 82.5% of likely voters in that age bracket supported Fauci stepping down.",
    "One scientist says we got the notes now from the conference call on February 1st.",
    "Dr. Anthony Fauci is losing support of Americans, a new Trafalgar poll shows.",
    "“The top scientists in the country were saying it came from a lab.",
    "Just 17.5% said that the doctor should stay."
  ]
}