{
  "id": 7097,
  "mediaId": 2693,
  "date": "2022-01-24",
  "headline": "Newt Gingrich Gets It: The Wolves Will Be Sheep",
  "image": "https://149366087.v2.pressablecdn.com/wp-content/themes/spectator/imgs/favicon.ico",
  "link": "https://spectator.org/newt-gingrich-gets-it-the-wolves-will-be-sheep/",
  "mediaOutlet": "The American Spectator",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeffrey Lord",
  "authorUrl": "https://spectator.org/author/jlord/",
  "termIds": [
    0
  ],
  "sentences": [
    "Without the slightest sense of irony or self-awareness, Republican Wyoming Rep. Liz Cheney, who has been part of this lynch mob January 6 Committee, tweeted this in response:\nA former Speaker of the House is threatening jail time for members of Congress who are investigating the violent January 6 attack on our Capitol and our Constitution.",
    "It is Cheney and her fellow committee members who have become the epitome of “what it looks like when the rule of law unravels.”\nJust for starters, House Republican Leader Kevin McCarthy has the right to appoint the Republican members of the committee — and he did so, appointing Reps. Jim Jordan of Ohio and Jim Banks of Indiana.",
    "The committee has been issuing subpoenas to “AT&T, Verizon, Sprint, T-Mobile, and others.” She further details:\nAt this writing, we learn that the select committee has also subpoenaed Republican members of Congress including one member who was booted off the select committee by Nancy Pelosi herself, Jim Jordan.",
    "If indeed the Republicans win control of the House in November, the members of this committee, and the Democrat leadership running the House, should be “delivered subpoenas for every document, every conversation, every tweet, every email.” Precisely because they have become serious threats to democracy.",
    "They turn their opponents and critics into sheep, who learn to be quiet or face vicious attacks and destruction.…\nWe are currently living through a moment of delusion among Democrats, who seem to think they can behave like wolves and destroy and intimidate their Republican opponents.",
    "The former Speaker goes on to warn that if, as expected, Republicans regain control of the House in November, the new GOP majority will release the hounds of investigations and prosecutions on the very Democrats who have been using both to bully and terrorize Trump supporters.",
    "And I think when you have a Republican Congress this is all going to come crashing down and the wolves are going to find out that they’re now sheep and they’re the ones who in fact face a real risk of jail for the kinds of laws they’re breaking.",
    "Gingrich expanded on this in an interview with Fox’s Maria Bartiromo on her Sunday Morning Futures show, saying:\nYou have — both with Attorney General (Merrick) Garland and with this select committee on January 6, people who have run amok.",
    "It is more than crystal clear that the participants in this lynch mob that is the January 6 Committee, not to mention the left-wing wolves in the Justice Department and FBI, must be taught a lesson that they and others will never forget.",
    "Because I think it’s clear that these people are literally just running over the law, pursuing innocent people, causing them to spend thousands and thousands of dollars in legal fees for no justification.",
    "Which is to say, when you use your office to violate the Constitution you have sworn to uphold, when you abuse your power with subpoenas and sham investigations — you must and will be held accountable.",
    "This is tens of thousands of moms, children, clergy, reporters, and Republican and conservative influencers who were in touch with everyone from White House aides to prominent activists.",
    "This is about reinforcing the principle that in America, political wolves who viciously destroy their fellow Americans — and violate the rule of law to do so — will not be tolerated.",
    "The time frame the committee demands data on is far-reaching: any and all contact with the individual for two to three months prior to January 6 and all the way to January 31, 2021.",
    "The members are: Lauren Boebert, Andy Biggs, Mo Brooks, Madison Cawthorn, Matt Gaetz, Louie Gohmert, Paul Gosar, Marjorie Taylor Greene, Jody Hice, Jim Jordan, and Scott Perry.",
    "They are going after people in a way which is reminiscent of the British monarchy using closed door systems that we outlawed deliberately because we had seen what it’s like.",
    "And all these people who have been so tough, and so mean, and so nasty are going to be delivered subpoenas for every document, every conversation, every tweet, every email.",
    "Completely violating House procedure, Speaker Nancy Pelosi refused to accept the appointments and she appointed both Cheney and Illinois Republican Adam Kinzinger.",
    "With control returned to House Republicans, they:\n… owe it to the Constitution and the American people to defeat the wolves and return them to sheep status.",
    "Gingrich adds:\nThe January 6 Select Committee is in the process of potentially bankrupting scores of Americans who worked for or supported President Trump.",
    "The legal costs of fighting subpoenas and the further cost of legal counsel if put under oath by a hostile congressional committee creates a real burden.",
    "What they need to understand is on January 4 next year, you’re going to have a Republican majority in the House and a Republican majority in the Senate.",
    "Former House Speaker Newt Gingrich, always ahead of the curve, has laid out exactly what lies ahead for the members of the House January 6 committee.",
    "Then there’s the not so small matter of Cheney making public the private communications of Sean Hannity and Laura Ingraham — members of the media.",
    "The 2022 midterm election will turn the Democratic wolves into sheep — and the power to shear the sheep will be handed over to House Republicans.",
    "That financial burden is compounded by the psychological stress of being under assault by the House Democrats — and potentially also the FBI.",
    "This is unprecedented.…\nThe subpoenas include all individuals on the subscriber’s account and everyone those people messaged or spoke to.",
    "Here at The American Spectator, Melissa Mackenzie has been pointing out exactly what the January 6 Committee has been doing.",
    "And unfortunately the Attorney General of the United States has joined that lynch mob and is totally misusing the FBI.",
    "The wolves who currently dominate the Democratic Party think they will be permanent wolves.",
    "Which makes Liz Cheney and Adam Kinzinger the very face of lawlessness on the committee.",
    "Wrote Gingrich in Newsweek:\nWhen some people acquire power, they act like wolves.",
    "Because they, like Pelosi herself, are obsessed with Trump Derangement Syndrome.",
    "They face financial ruin defending themselves against the committee’s attack.",
    "This is about restoring the core principles of American self-government.",
    "They are not about the truth, they are about getting Donald Trump.",
    "They take whatever savage actions are needed to win and dominate.",
    "So much for First Amendment freedom and privacy for the press.",
    "This is what it looks like when the rule of law unravels.",
    "All of which goes directly to the former Speaker’s point.",
    "And they’re running over people’s civil liberties.",
    "And it’s basically a lynch mob.",
    "Newt Gingrich is exactly right.",
    "They are breaking the rules.",
    "This is not about revenge.",
    "Well said, Mr. Speaker.",
    "They are wrong.",
    "Ahhhh no.",
    "Spot on.",
    "Exactly.",
    "Why?"
  ]
}