{
  "id": 7109,
  "mediaId": 2934,
  "date": "2022-01-06",
  "headline": "Jim Jordan’s Beef with Jan. 6 Committee",
  "image": "https://cdn.factcheck.org/UploadedFiles/Jim-Jordan.png",
  "link": "https://www.factcheck.org/2022/01/jim-jordans-beef-with-jan-6-committee/",
  "mediaOutlet": "FactCheck",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eugene Kiely",
  "authorUrl": "https://www.factcheck.org/author/eugene-kiely/",
  "termIds": [
    0
  ],
  "sentences": [
    "Its Dec. 15 story carried the headline “During January 6 Hearing, Schiff Doctored Text Messages Between Mark Meadows And Rep. Jim Jordan.”\nJordan’s office confirmed to us that the congressman was referring to the arguments made in The Federalist article, which accused Schiff of misrepresenting “the substance of the text message and its source.”\nThe text message was sent by Jordan, but he was sending along a message written by former Department of Defense Inspector General Joseph Schmitz, the article said.",
    "We don’t know Jordan’s motivation for the text — whether Jordan was suggesting, as Schiff said, that Pence “throw out votes that he unilaterally deems unconstitutional.” But we do know that Trump, in his Jan. 6 speech, urged Pence to do exactly that, and we do know that Jordan embraced Trump’s false claims of election fraud and championed efforts to prevent Congress from certifying Biden’s victory.",
    "The Federalist wrote, “In his statement and on-screen graphic, Schiff erased the final two paragraphs and the final clause of the first paragraph of the text message before inserting punctuation that was never there, all without disclosing what he was doing.”\nThe graphic displayed during Schiff’s presentation should have included an ellipsis, not a period.",
    "In that statement, the former president criticized the Jan. 6 committee — which he referred to as “the Democrats’ Great Cover-Up Committee” — and asked, “Why did Adam ‘Shifty’ Schiff forge and change the statement of Congressman Jim Jordan without any consequence?”\nTrump goes even further than Jordan.",
    "Jordan’s text: On January 6, 2021, Vice President Mike Pence, as President of the Senate, should call out all the electoral votes that he believes are unconstitutional as no electoral votes at all — in accordance with guidance from founding father Alexander Hamilton and judicial precedence.",
    "Schiff, Dec. 13: This one reads: “On January 6, 2021, Vice President Mike Pence, as President of the Senate, should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.” You could see why this is so critical to ask Mr. Meadows about.",
    "“We would’ve asked Mr. Meadows about text messages sent to and received from Members of the House of Representatives and the Senate about objections to the certification of electors in certain States on January 6th,” the House resolution to hold Meadows in contempt said.",
    "As Schiff began his presentation, the first text message appeared on the screen with the header “Lawmaker Text to Meadows.” That lawmaker would later be identified as Jordan, who in July had been rejected by House Speaker Nancy Pelosi as a member of the Jan. 6 committee.",
    "78, ‘contrary to the Constitution, can be valid.’ The court in Hubbard v. Lowe reinforced this truth: ‘That an unconstitutional statute is not a law at all is a proposition no longer open to discussion.’ 226 F. 135, 137 (SDNY 1915), appeal dismissed, 242 U.S. 654 (1916).",
    "During his Jan. 3 appearance on “The Ingraham Angle,” Jordan said, “The Jan. 6 committee has altered evidence and lied to the American people about that information.”\nThat’s a strong allegation that doesn’t hold up under scrutiny.",
    "In a recent interview on Fox News, Rep. Jim Jordan rattled off several grievances he has with Democrats — including with the Democratic-controlled committee investigating the Jan. 6, 2021, attack on the U.S. Capitol.",
    "About a lawmaker suggesting that the former vice president simply throw out votes that he unilaterally deems unconstitutional in order to overturn a presidential election and subvert the will of the American people.",
    "A committee spokesperson told Newsweek, “The Select Committee is responsible for and regrets the error.” However, the part of the text message that was omitted doesn’t change the substance of the excerpt.",
    "Democratic Rep. Adam Schiff introduced the text message into the record at a Dec. 13 meeting of the Select Committee to Investigate the January 6th Attack on the United States Capitol.",
    "Jordan’s office told us that the Ohio Republican was referring to a text message that he sent to Mark Meadows, who at the time was then-President Donald Trump’s chief of staff.",
    "The committee met that day to consider a resolution to hold Meadows in contempt of Congress for refusing to comply with a committee subpoena.",
    "In support of the resolution to hold Meadows in contempt, Schiff read from a few text messages that Meadows had received from lawmakers.",
    "A day after Jordan’s appearance on “The Ingraham Angle,” Trump issued a statement cancelling his plans for a Jan. 6 press conference.",
    "Following this rationale, an unconstitutionally appointed elector, like an unconstitutionally enacted statute, is no elector at all.",
    "If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.",
    "Two days after the hearing, The Federalist — a conservative online magazine — disclosed that the text message was from Jordan.",
    "Schiff did not “forge” Jordan’s text message, and the evidence that Schiff substantively changed or altered it is paper thin.",
    "As for altering the substance of the text message, The Federalist included the full text, which we include below.",
    "Schiff’s point in reading Jordan’s text message was to illustrate the committee’s need to question Meadows.",
    "But it was, as Schiff described, a text message from a lawmaker to Meadows.",
    "This claim of “altered evidence” has been made by others, including Trump.",
    "Schiff did not reveal the names of the lawmakers who sent the messages.",
    "Everything after the em dash was omitted from Schiff’s presentation.",
    "All of our articles related to the Jan. 6 attack can be found here.",
    "We rely on grants and individual donations from people like you.",
    "‘No legislative act,’ wrote Alexander Hamilton in Federalist No.",
    "Credit card donations may be made through our “Donate” page.",
    "It only presents one man’s legal opinion in support of it.",
    "Editor’s note: FactCheck.org does not accept advertising.",
    "Schmitz summarized a document he had written.",
    "Please consider a donation.",
    "Fair enough."
  ]
}