{
  "id": 7113,
  "mediaId": 2738,
  "date": "2022-01-31",
  "headline": "A Republican Trying To Attack Dr. Fauci Thought He Was Quoting Voltaire, But He Was Actually Quoting A Neo-Nazi Arrested For Child Porn",
  "image": "https://uproxx.com/wp-content/uploads/2022/01/thomas-massie.jpg?w=1024",
  "link": "https://uproxx.com/viral/republican-fauci-neo-nazi-quote-voltaire/",
  "mediaOutlet": "uproxx.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Prigge",
  "authorUrl": "https://uproxx.com/author/matt-prigge/",
  "termIds": [
    0
  ],
  "sentences": [
    "Still, it’s a popular quote among certain types, even though it’s commonly attributed to Kevin Alfred Strom, said child porn-having neo-Nazi, who said the following in a 1993 broadcast: “To determine the true rulers of any society, all you must do is ask yourself this question: Who is it that I am not permitted to criticize?” Strom was, in fact, referring to Jewish people.",
    "Over the weekend, Kentucky representative Thomas Massie decided to become the umpteenth member of his party to go after the nation’s top immunologist, who somehow managed to keep his job through the final stretch of the Trump presidency while still doing his job.",
    "“You mustn’t question Fauci, for he is science,” Massie sarcastically tweeted above a quote, allegedly from Voltaire: “To learn who rules over you, simply find out who you are not allowed to criticize.”\nProblem is, Voltaire never said that.",
    "But on Monday, thanks to an obscure Republican who pals around with Marjorie Taylor Greene, Jim Jordan, and Lauren Boebert, he did, and for reasons unbefitting of the genius who wrote Candide.",
    "In the meantime, perhaps Voltaire’s Candide (or one of his many history books) will become yet another work of great literature to hit the sales charts, much like Art Spiegelman’s Maus.",
    "It’s a safe bet that Voltaire, the nom de plume of French Enlightenment writer, historian, philosopher, and wit François-Marie Arouet, has rarely if ever trended on Twitter.",
    "Speaking of, in August Massie was condemned after tweeting out an image that compared vaccine cards to Nazis tattooing numbers on concentration camp prisoners.",
    "In 2015, an Australian senator misattributed the quote to Voltaire and, after receiving pushback like Massie is now, deleted all of his tweets.",
    "As per expert CNN fact-checker Daniel Dale, “there is no record” of Voltaire writing or uttering those words.",
    "Massie’s far from the first person to fall for this misquote.",
    "But a neo-Nazi who was arrested for child pornography did.",
    "As of this writing, Massie’s tweet remains live.",
    "He deleted that one.",
    "(Via CNN)"
  ]
}