{
  "id": 7137,
  "mediaId": 2735,
  "date": "2022-01-27",
  "headline": "Fake Electors Casting Fraudulent Ballots for Trump Could Be Charged by DOJ",
  "image": "https://truthout.org/wp-content/uploads/2022/01/2022_0127-georgia-election-rally-1200x675.jpg",
  "link": "https://truthout.org/articles/fake-electors-casting-fraudulent-ballots-for-trump-could-be-charged-by-doj/",
  "mediaOutlet": "Truthout",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Walker",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Glenn Kirschner, who served in the U.S. Attorney’s Office for the District of Columbia for 24 years, suggested that the 59 fake electors could face criminal charges, including obstruction of an official proceeding (the certification of the Electoral College), conspiracy to commit fraud, forgery, and mail fraud, as the fake Electoral College documents were sent through the U.S.",
    "Rep. Scott Fitzgerald, a Republican in Wisconsin who was a member of the state legislature at the time, arranged for a room to be reserved for the fake electors at the state Capitol building on the same day that legitimate electors had met there to cast their ballots for Biden, who won the state in the 2020 presidential race.",
    "Some of the fake electors have sought to distance themselves from the scheme by claiming that their fraudulent votes were accompanied by addendums saying that the votes should only be counted if Trump and his allies were successful in their legal challenges.",
    "Last month, Jordan confirmed that he was one of several GOP lawmakers who texted Trump’s former chief of staff Mark Meadows encouraging him to convince then-Vice President Mike Pence to recognize the fake electors as legitimate.",
    "But in Georgia, where the Republicans involved issued a similar document, electors could face charges because their disclaiming statement wasn’t included with the votes they sent to the National Archives and to Congress.",
    "The scheme, which ultimately sought to disrupt the certification of the presidential election on January 6, was reportedly managed by Rudy Giuliani, Trump’s former lawyer, along with members of Trump’s campaign team.",
    "Before you go — please read the important update below\nFor the last two decades, millions of readers have relied on Truthout to provide accurate, transparent journalism through moments of political and social crisis.",
    "A former federal prosecutor has suggested that Republicans who took part in the fake electors scheme to overturn the results of the 2020 presidential election in seven states could face a number of criminal charges.",
    "But it’s possible that other individuals were involved in the plan, including current members of Congress; if this is the case, fake electors could potentially make plea arrangements based on their involvement.",
    "The DOJ has begun to investigate the fake electors scheme following requests from several state attorneys general for the department to do so, Deputy Attorney General Lisa Monaco said to CNN on Tuesday.",
    "The fake electors may consider making plea arrangements if they have evidence that members of Trump’s inner circle were pressuring them to help the former president overturn the results of the election.",
    "It’s possible that Wisconsin electors with knowledge of Fitzgerald’s actions could arrange a plea deal with the Justice Department by implicating him as a participant in the scheme.",
    "The threat of prosecution could incentivize many of the Republicans involved to cooperate with the Department of Justice (DOJ) if a formal inquiry is opened, Kirshner said.",
    "“That’s not an exhaustive list,” Kirschner said in an interview with HuffPost, indicating that the fake electors could face charges beyond those listed above.",
    "Although his home state wasn’t one of the seven states involved, Rep. Jim Jordan (R-Ohio) could also face repercussions for his involvement in the plan.",
    "Over the last year, we’ve struggled to meet our basic operating costs, as Facebook and Google have reduced the visibility of non-corporate news stories.",
    "The fake documents matched legitimate Electoral College certification notices word for word, although they were printed on a different type of paper.",
    "Fake electors from other states didn’t include statements acknowledging that their votes should only be counted if court challenges were successful.",
    "As a result, our stories are being seen by fewer people at a time when trustworthy journalism is so desperately needed.",
    "We’re working hard to mitigate these issues but we still have an immediate need for your help, especially right now.",
    "Uncompromised, uncompromising news\nGet reliable, independent news and commentary delivered to your inbox every day.",
    "Such a statement was attached to a fake Electoral College document from Pennsylvania Republicans, for example.",
    "We’ve been proud to remain donor-supported — not once accepting money from advertisers or corporate funders.",
    "Our prosecutors are looking at those and I can’t say anything more on ongoing investigations,” Monaco said.",
    "The most serious of those offenses could potentially result in a 20-year prison sentence.",
    "Whether you’re able to make a $5 monthly donation, or give more — we need you, today.",
    "He believes that the lawmakers involved in the scheme will eventually be charged.",
    "We have just 6 days left in our fundraiser and still need to raise $37,000.",
    "Any amount of support you can spare right now will go a very long way.",
    "Please, do what you can to help us get through this trying time.",
    "“These folks should all be charged yesterday,” Kirschner said.",
    "But now, we face an existential threat to our survival.",
    "“We’ve received those referrals.",
    "Postal Service.",
    "Donate Now"
  ]
}