{
  "id": 7139,
  "mediaId": 4032,
  "date": "2022-02-01",
  "headline": "ATF Reveals It Has a National Gun Registry Already in Place",
  "image": "https://thenewamerican.com/assets/sites/2/atf.jpg",
  "link": "https://thenewamerican.com/atf-reveals-it-has-a-national-gun-registry-already-in-place/",
  "mediaOutlet": "New American",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Adelmann",
  "authorUrl": "https://thenewamerican.com/contributor/bob-adelmann/",
  "termIds": [
    0
  ],
  "sentences": [
    "This is the agency that Cloud describes as “notably corrupt” and about which Lee Williams, a researcher for The Second Amendment Foundation’s Investigative Journalism Project, notes:\nThere has never been a federal agency with so little regard for the sanctity of human life, with such a history of failure, with such antiquated duties and responsibilities, with such a propensity to overreact, with such an addiction to good press, with such a willingness to bend over for any politician in charge, and — as we currently see playing out — with such little regard for the constitutional rights of American citizens.",
    "He demanded answers to a number of questions, including just how many records ATF had, how many of them have been digitized using OCR or Optical Character Recognition technology, and specifically “how its Out-of-Business Records Center policy [of capturing all records from gun dealers who go out of business] does not violate the statutory restriction on a federal gun or gun owner registry?”\nCloud’s letter was signed by House members Thomas Massie, Pete Sessions, Ronny L. Jackson, Andy Biggs, Chip Roy, Jim Jordan, Lauren Boebert, Matt Gaetz, Burgess Owens, Louie Gohmert, and others.",
    "John Crump, writing for Ammoland Inc., caught the lie about the OBR database only capturing “certain” limited information in its files, excluding purchaser information:\nAlthough the ATF claims not to have the ability to search for specific character strings [such as purchaser names and related information], the fact they are using OCR means that it would only take mere minutes to enable [its] ability to search the documents.",
    "When the Washington Free Beacon obtained documents last November revealing that the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) had more than 54 million records of Americans who purchased firearms from local gun dealers, Representative Michael Cloud (R-Texas) and 51 other members of Congress demanded answers.",
    "The information-technology company Teris explains just how easy it is to turn paper documents into digital form that then can be searched using keywords such as “purchaser”:\nOCR is the process of converting images and flat non-searchable documents into searchable text documents … so you can search for keywords….",
    "Moreover, GAO’s findings relative to the title of the report refer to a\nfirearms used in crimes, which is a valuable crime gun intelligence tool used in thousands of\nthousands of crime gun traces it completes annually, nor does it have any way to link a trace\na specific prosecution for a particular year.",
    "The table below shows the number of times per year\nThose members were stunned when Daniel Board, ATF’s assistant director, responded:\nIn total, ATF manages 920,664,765 OBR [Out of Business Records], as of November 2021 … 865,787,086 of those records are in digitized format.",
    "So, the ATF already has nearly a billion searchable files on American gun owners, including name, address, phone number, and other information the agency requires on its Form 4473 a purchaser must complete before a gun may be purchased from a gun dealer.",
    "OCR has a range of benefits, including:\nConverting non-searchable documents into searchable text documents,\nQuickly find relevant information: keywords, dates, phrases, and more, and\nConvert paper files into a searchable digital repository.",
    "Board then tried to explain that the ATF’s purposes in keeping such an immense database were benign:\nThe OBR [database does] not capture and store certain key information, such as firearms purchaser information in an automated file….",
    "Thank you for your letter dated November 22, 2021, signed by you and 51 of your colleagues\nIn 2006, ATF developed the Out of Business Records Imaging System due to practical concerns\nof firearms records” (p. 90).",
    "Readers seeking more information about ATF’s failures and atrocities in Ruby Ridge, Waco, the Branch Davidians, and Operation Fast and Furious, Crump’s review is available here.",
    "Yet, the Biden administration is again circumventing Congress and enabling the notably corrupt ATF to manage a database of nearly a billion gun transfer records.",
    "Congress has made it clear … that the federal government shall not create a federal gun registry and has prohibited ATF from creating any centralized databases.",
    "In November he expressed his “concern”:\nWe are concerned that this Administration is leveraging its power in a way to establish a federal gun registry….",
    "The Biden administration continues to empower criminals and foreign nationals while threatening the rights of law-abiding Americans.",
    "The gun registry that gun owners have feared for years as the next step towards gun confiscation is now in place.",
    "The ATF National Tracing Center … only traces crime guns … ATF is confident that it does not violate any laws.",
    "Under the president’s watch, the ATF has increased surveillance of American gun owners at an abhorrent level.",
    "Cloud didn’t buy it, telling the Free Beacon:\nA federal firearm registry is explicitly banned by law.",
    "Disarming the public is the final step in turning the American Republic into a dictatorship."
  ]
}