{
  "id": 7150,
  "mediaId": 2748,
  "date": "2022-01-23",
  "headline": "Fauci Keeps Covering for Communist China",
  "image": "https://img.patriotpost.us/01FSQ8WEA6725ZRZ84126QNYZR.jpeg?w=1200&h=600",
  "link": "https://patriotpost.us/articles/85628-fauci-keeps-covering-for-communist-china-2022-01-19",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "They added: “Fauci’s own behavior has undermined public trust in the response to the pandemic: by sitting for celebrity puff profiles and documentaries, by stifling public debate about the origins of Covid-19 and the proper response to it, by responding in lawyerly and evasive fashion to questions about NIH research dollars supporting work at the Wuhan lab.”\nIt’s Fauci’s stifling of debate and his evasiveness that have Republican Congressman Jim Jordan promising to investigate him when the GOP grabs the gavel away from House Speaker Nancy Pelosi.",
    "It’s strange, isn’t it, that the Democrats are hell-bent on conducting an endless investigation into the unarmed non-insurrection of January 6, 2021 — an event that resulted in the shooting death of a single unarmed woman, Ashli Babbitt, at the hands of a reckless Capitol cop — and yet they don’t seem the least bit interested in uncovering the origins of a virus that has already killed twice as many Americans as died during all of World War II.",
    "One scientist says, “I don’t see how this can happen in nature, but it would be easy to do in a lab.” And yet just in a matter of days, they changed their position [and] write the article that appears in Nature of Medicine magazine, which then gets cited in the now famous letter in [the British medical journal] The Lancet.",
    "“President Joe Biden should relieve Dr. Anthony Fauci of his duties at the National Institute of Allergy and Infectious Diseases, as chief medical adviser to the White House, and as the public face of the American government’s response to Covid-19.” So said the normally mild-mannered editors at National Review.",
    "Holding each other back or shifting blame would only cause needless delay in response and distract us from the overall objective.”\nXi’s remarks were sophomoric from start to finish, but that’s of no consequence.",
    "Such an investigation is long overdue, and it’s pretty clear that we can’t count on the Democrats to conduct it — this despite the fact that the coronavirus has so far killed more than 850,000 Americans.",
    "Jordan goes on to note that this sequence of orchestrated events empowered Fauci and his co-conspirators to insist that COVID-19 didn’t come from a lab when they had good reason to believe that it did.",
    "Speaking of China, its president, Xi Jinping, was among the global leaders who delivered “State of the World” special addresses this week at the World Economic Forum’s virtual event.",
    "He added that Congressman James Comer and Senators Rand Paul and Ron Johnson would lead the charge for a sweeping congressional investigation into the origins of COVID-19.",
    "After all, we know for a fact that Fauci’s organization funded dangerous gain-of-function research on bat coronaviruses at the Wuhan Institute of Virology.",
    "As Jordan continues:\nWe now know without a doubt that Dr. Fauci knew on January 31st and February 1st that this thing came from a lab.",
    "One early proponent of the lab leak, Dr. Kristian Anderson, wrote to Fauci in an email: “Virus looks engineered.",
    "Joe Biden’s corrupt dealings with the Communist Chinese have been well documented around our shop.",
    "“If the American people put us back in charge, we are definitely going to do this,” said Jordan.",
    "And he sounded remarkably Faucian in his desire not to get to the bottom of COVID-19’s origins.",
    "We already have “strong confidence” that the China virus came from a virology lab in Wuhan.",
    "“Strong confidence and cooperation represent the only right way to defeat the pandemic.",
    "Why would Fauci want to mislead us about the origins of this deadly Chinese virus?",
    "One scientist says we got the notes now from the conference call on February 1st.",
    "“First, we need to embrace cooperation and jointly defeat the pandemic,” said Xi.",
    "It’s long overdue, but the tiny tyrant is finally wearing out his welcome.",
    "Because, as it turns out, he might have even more to hide than Joe Biden.",
    "Virus not consistent with evolutionary theory.”\nEvolutionary theory, eh?",
    "What are Joe Biden, Tony Fauci, and their fellow Democrats afraid of?",
    "And we know this despite Fauci’s oft-repeated claim to the contrary.",
    "So much for an attack on Fauci being an attack on science itself.",
    "The top scientists in the country were saying it came from a lab.",
    "Why has he been running such solid interference for the ChiComs?",
    "We just want Anthony Fauci to come clean and admit it.",
    "Because he may have helped underwrite it.",
    "And then to clean out his desk.",
    "But what about Tony Fauci?",
    "Why might that be?",
    "Answer: China."
  ]
}