{
  "id": 7175,
  "mediaId": 2659,
  "date": "2022-01-31",
  "headline": "Liz Cheney Calls Out Trump’s Weekend Comments: He Would Do It All Again",
  "image": "https://www.politicususa.com/wp-content/uploads/2022/01/Cheney-FTN-Trump.jpg",
  "link": "https://www.politicususa.com/2022/01/31/liz-cheney-calls-out-trumps-weekend-comments-he-would-do-it-all-again.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "On January 6th, as protesters began to storm the House floor and legislators themselves were literally barring the doors, Jim Jordan – a man Trump called “strong” in his speech just two hours prior – offered to help Cheney, she aggressively shoved Jordan away and, in perhaps one of the most unguarded and brutally honest moments in U.S. history, said: “You F*cking did this!”\n\nOne can read into it what one will but to many of us the statement comes across as personal, as in “you” individually – Jim Jordan, were part of this plan.",
    "Trump can’t fool Cheney and she simply hears the same old Trump and gives us the same warning, tweeting this morning:\n\n“Trump uses language he knows caused the Jan 6 violence; suggests he’d pardon the Jan 6 defendants, some of whom have been charged with seditious conspiracy; threatens prosecutors; and admits he was attempting to overturn the election.”\n\n“He’d do it all again if given the chance.”\n\nShe is right.",
    "And then there is that last step, the most important one, Cheney almost surely knew that her colleagues in the House, the more radical MAGAs, Jim Jordan, Marjorie Taylor-Greene, Lauren Boebert, Paul Gosar, and many more, had something planned, something dark, illegal, and dangerous, for January 6th.",
    "4.9k SHARES Facebook Twitter Whatsapp Pinterest Reddit Print Mail Flipboard\n\nWho knew that the fate of the country’s democracy might come down to an alliance of shared ideals between the Cheney family and the progressive liberals in America?",
    "Trump is more exposed than he’s been in his life and he’s responded predictably, using his small toolbox, fear, anger, threats, and calling on others to fight for him, just as he used to hire people to cheer for him.",
    "So Cheney is telling us all now, promising us, based on what she knows – and she’s been right all along and known more than us – that Trump will absolutely do it all over again if we give him the chance.",
    "Congress itself, when one adds both houses and the top committee attorneys, is smaller than most high schools, people hear things, rumors, whispers, stuff that never makes it into the New York Times.",
    "Liz Cheney is no Susan Collins, there is no; “I think he learned a big lesson” (As Collins infamously said after voting not-guilty on the first impeachment).",
    "On Saturday night, Trump promised mass demonstrations if prosecutors did anything “Illegal” to him and he promised pardons for those who fought for him.",
    "The post-election period didn’t fool Cheney period, either, knowing – of course – that Joe Biden won the election just like presidents before.",
    "But Trump never fooled her, indeed nothing MAGA ever fooled her because it’s not the least bit conservative.",
    "Cheney and the Select Committee have spent five torrid months searching for the truth, the whole truth.",
    "So we best pick what kind of country we want to be because we know what’s coming if one supports Trump.",
    "If Trump ever fails, it is because he didn’t implement his plan hard enough, it wasn’t the wrong plan.",
    "Trump, Jordan, his MAGA pals all “F**king did this!” then, and they are aligning to do it all again.",
    "Over the weekend, Cheney heard what we all heard in Trump’s speech Saturday night.",
    "She is pleading with us to not give him a chance and willing to lead the charge.",
    "As we said, Congress itself isn’t that big of a club, people talk.",
    "Liz Cheney, like her father, is as conservative as they come.",
    "Cheney knows that Trump doesn’t “learn,” he hits harder.",
    "What did Liz know that day when she screamed at Jordan?",
    "They won that right in front of the SCOTUS.",
    "No one, but we’re quite thankful for it.",
    "They must be getting awfully close.",
    "We seem to be finding out."
  ]
}