{
  "id": 7176,
  "mediaId": 2723,
  "date": "2022-01-24",
  "headline": "Matt Gaetz Casually Throws in a Homophobic Slur During Interview With Steve Bannon (Video)",
  "image": "https://www.thenewcivilrightsmovement.com/wp-content/uploads/2022/01/matt-gaetz-homophobic-ss-4.jpg",
  "link": "https://www.thenewcivilrightsmovement.com/2022/01/matt-gaetz-casually-throws-in-a-homophobic-slur-during-interview-with-steve-bannon-video/",
  "mediaOutlet": "thenewcivilrightsmovement.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Badash",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Gingrich promised Republicans will throw members of the House Select Committee on the January 6 Attack in jail, after a week of multiple bombshell revelations culminating with House investigators receiving a massive number of Trump White House documents the former president tried for months to block.",
    "“And when we do, it’s not going to be the days of Paul Ryan and Trey Gowdy, where the Republicans go limp-wristed where they lose their backbone and fail to send a single subpoena,” the Florida Republican Congressman said, throwing in a homophobic slur that is used to depict weakness.",
    "“No, it’s going to be the days of Jim Jordan and Matt Gaetz and Marjorie Taylor Greene and you know what, we’re going to get answers, real answers about what happened in the election,” he said, before continuing to spin far right-wing conspiracy theories.",
    "“Newt’s right, we are going to take power,” said Gaetz, who reportedly is under DOJ investigation for alleged child sex trafficking, having sex with an under-aged teen, and obstruction of justice.",
    "“Answers about the Wuhan Institute of Virology and certainly answers about a Department of Justice and a national security apparatus that has gone totally off the rails,” he claimed.",
    "U.S. Rep. Matt Gaetz (R-FL) used a homophobic slur in an interview with former Trump chief strategist Steve Bannon while supporting Newt Gingrich’s attack on Democrats.",
    "Honest, fair, real application of the laws in our country,” he said, after endorsing the imprisonment of political opponents.",
    "“They have become the enforcement wing of the Democratic Party.",
    "The entire country knows it.",
    "And you know what we need?"
  ]
}