{
  "id": 7180,
  "mediaId": 2575,
  "date": "2022-01-27",
  "headline": "Please create a 2022 \"Contract with America\" (Vanity)",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-chat/4033292/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "To: Az Joe\n\n\"Including: Immigration, crime, schools, abortion, sex & gender crap, energy, 2nd Amendment\" 1st Amendment / censorship by big tech\n\n1st Amendment / Religious freedom to not participate in same \"sex & gender crap\"\n\n4th Amendment freedom from unreasonable searches without a warrant, including online and phone records, gps records (think J6 protestors), etc.",
    "by 19 posted onby TheCipher (I am a proud member of the LGBT (Let's Go Brandon Trolls ) community)\n\nTo: Az Joe\n\nI wouldn’t sign on unless it included the phrases “border-wall completion”, “mass deportations”, and “Constitutional originalism”...\n\n\n\nby 20 posted onby SuperLuminal (Where is another Sam Adams now that we desperately need him?)",
    "To: Az Joe\n\nGuess you missed this https://freerepublic.com/focus/f-news/4018731/posts\n\n\n\nTo: Theoria\n\nRyan was bulls*t. When Newt Gingrich pushed the Contract with America, he ended 40 years of democrat rule in the congress.",
    "by 12 posted onby Lurkinanloomin ( (Natural born citizens are born here of citizen parents)(Know Islam, No Peace-No Islam, Know Peace)\n\nTo: Az Joe\n\nBRING BACK THE HOUSE UN-AMERICAN ACTIVITIES COMMITTEE!!",
    "Please create a 2022 \"Contract with America\" (Vanity)\n\n01/27/2022\n\nPosted on by Az Joe\n\nA list of 5-10 areas of American life/culture to be acted on once the Rs take over the Congress.",
    "Plan to reduce outrageous tuition costs\n\nPlan to reduce the trade deficits through institutionalizing tariff formulas that increase automatically until the trade deficits fall.",
    "Long term Plans for funding infrastructure improvements that guarantee the money goes for real infrastructure and not political pork and causes and climate change.",
    "Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "Ending dependency on Chinese and oversead manufacturing for critical supplies including computer chips, robotics, ,medicine and medicine components, PPE, etc.",
    "Build the wall, deport ANY illegal alien, remain in Mexico policy enforced, allow state and local LEOs to enforce federal immigration law 2.",
    "McConnell is compromised and over the hill.. Where is the republican leader who isn’t running for president who cares about the rule of law?",
    "Space Force funding and improvements\n\nSeparate authority for finding and recommending effective therapeutics from authority for vaccines.",
    "To: Az Joe\n\nAt the least, anyone running for the Senate should be required to pledge that they won’t vote for McConnell as leader.",
    "I think the American people will hand the leftist a humiliation come November because of the absolute national mismanagement.",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "Including: Immigration, crime, schools, abortion, sex & gender crap, energy, 2nd Amendment\n\nAnything else you can think of.",
    "multiple amnesties, china trade, Supported NAFTA, GATT, WTO, and MFN , tech protections, department of education, etc.",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "To: Az Joe\n\nThere is only one that I really care about (and won’t get): devolving federal powers to the states.",
    "Bush League Republicans will elect them as leaders as long as we keep re-electing the same Assistant Democrats.",
    "No more continuing resolutions, but a zero based budget approach with an eye to reducing federal government.",
    "After Obozo’s 2nd disastrous term, the most pro-American president in my lifetime was elected...Trump.",
    "If that's winning and successful over the long run, we are screwed, and have been screwed for decades.",
    "Separate authority for medical reporting and monitoring vaccine reactions from medical policy makers.",
    "by 9 posted onby Deaf Smith (When a Texan takes his chances, chances will be taken that's for sure.)",
    "TOPICS:\n\nKEYWORDS:\n\naliens\n\namerica\n\ncrime\n\nimmigration\n\nschools\n\nvanity\n\n\n\n\n\nTo: Az Joe\n\nWhy?",
    "To: hinckley buzzard\n\nTo get different leadership we will have to elect different membership.",
    "Contract with America\n\n\n\nTo: Theoria\n\n>>citizens never hold them accountable.<<\n\nI disagree.",
    "*** Start holding unelected bureaucrats accountable for their corruption and abuse of power.",
    "Formulas can allow for decreases automatically as well once the trade deficits have fallen.",
    "To: DannyTN\n\nYou would be hard pressed to find someone who sold out America more than Newt.",
    "6th amendment / right to speedy and public trial including if you are a J6 protestor.",
    "If they can’t do that the ruling apparatus will keep expanding their power over us.",
    "If they can’t stop the spending there is little hope they can fix anything else.",
    "Paul Ryan and crew put out 'A Pledge to America' in 2010, and didn't follow it.",
    "To: Theoria\n\nThey had reasonable success with Gingrich's Contract with America.",
    "To: Az Joe\n\nI’d settle for some semblance of common sense in public policy.",
    "The problem is guys like McConnell, Paul Ryan, John Boehner and so forth.",
    "To: Az Joe\n\nKev aka Karen has a plan that won’t be followed through on.",
    "They get entrenched and it is very difficult to defeat the incumbents.",
    "He then lost a larger majority in the house and then lost the senate.",
    "And, people who actually know what they’re doing if I get two wishes.",
    "Obozo lost a majority in the house after his first year in office.",
    "If we had a leader worthy of the name we could do that this year.",
    "They never follow it, and citizens never hold them accountable.",
    "2. in person or affidavit voting by paper ballots only with id.",
    "Border security\n\nLimitations on H1B's and other work visas.",
    "Make Medical reporting a stand alone independent function.",
    "by 4 posted onby devane617 (RUN FOR LOCAL ELECTED OFFICE!",
    "Is there anyone who wants to be the leader of the House?",
    "To: Az Joe\n\nok i’ll bite: 1. no health mandates ever.",
    "Plan to bring the government deficits under control.",
    "To: devane617\n\nYour NEW contract is not enforceable.",
    "published registration rolls 3 mos before elections.",
    "Fund the police so that they can enforce ALL laws.",
    "Republicans picked up governorships/state houses.",
    "Require bail on ALL violent of firearm offenses.",
    "1st amendment / right to protest at the capitol.",
    "To: Az Joe\n\nI’m on board with a ‘NEW’ contract.",
    "repatriation of all illegal immigrants.",
    "Build more prisons/jails/tent cities.",
    "Kinda the point of what's going on.",
    "no machines except dumb tabulators.",
    "But who is there to take the lead?",
    "To: Az Joe\n\n*** Downsize Fedzilla.",
    "No more \"vaccine only\" approaches.",
    "Plan to reduce the national debt.",
    "\"Broken Windows\" law enforcement.",
    "one day elections and counts.",
    "Please see customer service.",
    "COUNCIL,SCHOOL BOARD, ETC.)",
    "Voters can only do so much.",
    "McCarthy is a weak reed.",
    "immigration moratorium.",
    "there’s my first three.",
    "informed consent only.",
    "3. build the wall.",
    "Jim Jordan maybe?",
    "Skip to comments.",
    "etc, etc, etc.",
    "To: Az Joe\n\n1.",
    "Respectfully."
  ]
}