{
  "id": 7184,
  "mediaId": 2575,
  "date": "2022-01-29",
  "headline": "EXCLUSIVE: Jim Jordan Slams Senate Democrat Attempts to Revive Media Cartel Act",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-news/4033800/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "They’re trying to revive it… this bill would create an antitrust exemption, a lot like Major League Baseball has an antitrust exemption, so that big media companies can collectively bargain with big tech companies.”\n\n“This is not about competition and preserving competition,” said Rep. Jordan “This is about creating a cartel, this is about creating an OPEC in the newspaper business.”\n\n“Do you think letting the New York Times and the Washington Post collude is going to actually help conservatives, going to actually help the first amendment, help free speech, stop the censorship?”\n\n“Go back to the month before the 2020 presidential election and look how big media colluded with big tech to keep the number one story, what should have been the number one story from the American people, namely the story about Hunter Biden and what he was up to with foreign countries and how it relates to President Biden and the Big Man and everyone else,” continued Jordan.",
    "EXCLUSIVE: Jim Jordan Slams Senate Democrat Attempts to Revive Media Cartel Act\n\nBreitbart ^ | 29 Jan 2022 | ALLUM BOKHARI\n\nPosted on by E. Pluribus Unum\n\nRep. Jim Jordan (R-OH), the ranking Republican member of the House Judiciary Committee, appeared on SiriusXM’s Breitbart News Saturday with Matt Boyle today.",
    "“One of the things that jumped out at me this week was the Senate Judiciary Committee subcommittee on antitrust announced that they’re going to be having this hearing on this bill called the journalism competition and preservation act,” said Boyle.",
    "TOPICS:\n\nCrime/Corruption\n\nGovernment\n\nKEYWORDS:\n\nmediacartel\n\nmsm\n\ntechnofascism\n\n\n\n\n\nTo: E. Pluribus Unum\n\nJordan is becoming the Trey Gowdy of our day and so are several others.",
    "March; Berosus; Bockscar; BraveMan; cardinal4; ...\n\nby 6 posted onby SunkenCiv (Imagine an imaginary menagerie manager imagining managing an imaginary menagerie.)",
    "Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "Rep. Jordan slammed Senate Democrats’ attempts to revive the Journalism Competition and Preservation Act, which failed to pass his committee last year.",
    "Otherwise they are fools.I ha)\n\nTo: E. Pluribus Unum\n\nindirect funding to direct funding but still from the clueless American tax payer.",
    "“You led the fight against this in the House, and it didn’t pass the house, didn’t even make it through it h committee last year.",
    "by 5 posted onby Conservative4Life (thy merchants were great men of the earth; for by thy sorceries were all nations deceived.",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "To: CoastWatcher\n\nIt should really be named: Elimination of thought and termination of anticommunist bill.",
    "by 2 posted onby Sequoyah101 (Politicians are only marginally good at one thing, being politicians.",
    "I’m not even sure I understand why they are there anymore in an “oversight” capacity.",
    "We see hearings about things we knew a year ago and still nothing comes of it.",
    "Rev18:23)\n\nTo: AdmSmith; AnonymousConservative; Arthur Wildfire!",
    "To: ronnie raygun\n\nSounds like the “ Anti-Dog Eat Dog Rule.",
    "Hearings and comments that is all they can do.",
    "(Excerpt) Read more at breitbart.com ...",
    "This administration acts with impunity.",
    "They know they won’t be touched.",
    "They have no enforcement power.",
    "Skip to comments."
  ]
}