{
  "id": 7186,
  "mediaId": 2748,
  "date": "2022-01-22",
  "headline": "House Judiciary Committee Hears Plight of Jan. 6 Prisoners",
  "image": "https://img.theepochtimes.com/assets/uploads/2021/06/11/doj-federal-bureau-of-prisons-e1623417081881-1200x849.jpg",
  "link": "https://www.theepochtimes.com/house-judiciary-committee-hears-plight-of-january-6-prisoners_4227570.html/?utm_source=partner&utm_campaign=TheLibertyDaily",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Silva",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "(Mark Lennihan/File/AP Photo)\n\nHouse Judiciary Committee Hears Plight of Jan. 6 Prisoners\n\nAdvocates for inmates who have been arrested in connection with the Jan. 6, 2021, breach of the U.S. Capitol have lamented the lack of national attention being given to the inhumane conditions facing those still in detention.",
    "GOP House members were interrupted by left-wing protestors while trying to hold a press conference on the matter in July 2021, and the lawmakers were barred from a Washington jail housing 50 defendants when they tried to check on their conditions days later.",
    "“It appears as if the D.C. jail is a political prison.”\n\nQuestions were asked largely along party lines, with Republicans probing the Jan. 6, 2021, issue further, while Democrats questioned other witnesses about the BOP’s COVID-19 response and other issues.",
    "said she “wishes she would’ve heard these concerns when we were talking about mostly black and brown people.”\n\nRather than argue, Reps. Jim Jordan (R-Ohio) and Andy Biggs (R-Ariz.) agreed that the problems with the federal prison system are widespread.",
    "The First Step Act provides that the BOP shall provide the data as to how many people applied for compassionate release, how long did it take, and the justifications for the denials—did someone die while their application was pending?” she said.",
    "Subcommittee Chair Val Demings (D-Fla.), who also said she agreed that jail conditions for Jan. 6, 2021, inmates are “filthy,” ended the relatively collegial meeting by announcing that BOP officials are scheduled to appear at a Feb. 3 hearing.",
    "Rep. Thomas Tiffany (R-Wis.) asked Alison Guernsey, a clinical associate professor of law at the University of Iowa, whether she agrees with Kelly’s assessment of how inmates from the Jan. 6, 2021, incident are being treated.",
    "While the inmates reported marginal improvement in treatment after a visit by Rep. Marjorie Taylor Greene (R-Ga.) to the Washington facility, Kelly told committee members that conditions have apparently regressed since then.",
    "Those findings were ignored until a more diverse population was incarcerated there,” said Rep. Mary Gay Scanlon (D-N.Y.), who blamed the broken prison system on the U.S. government’s mass-incarceration policy.",
    "Guernsey discussed the BOP’s alleged refusal to provide data about compassionate release—a program created under the Trump administration—through which eligible inmates can qualify for early release.",
    "“One detainee I spoke with this week, an Army reservist charged with no violent crime, said the D.C. jail is on a 22-hour lockdown due to COVID,” said Kelly, a writer for American Greatness.",
    "“I’ve talked to families who didn’t even know their family member died of COVID.”\n\nDemocrats accused Republicans of ignoring these problems, except when it comes to Jan. 6 inmates.",
    "In response, the BOP sent a link to what it said is “the most up-to-date information regarding First Step Act, including compassionate release and reduction in sentence numbers.”",
    "She voiced concerns that the inmates and their families have been raising for the past year, which include a lack of access to worship, legal counsel, phones, and basic hygiene.",
    "That changed on Jan. 21, when conservative writer Julie Kelly testified about the matter at a House Judiciary Committee hearing on the Federal Bureau of Prisons (BOP).",
    "A sign for the Department of Justice Federal Bureau of Prisons is displayed at the Metropolitan Detention Center in the Brooklyn borough of New York on July 6, 2020.",
    "“I do think some of the things happening to the Jan. 6 defendants are truly appalling, but I don’t think they’re isolated to the Jan. 6 defendants,” Guernsey said.",
    "But Guernsey said that number doesn’t include those housed in private prisons and that it sometimes takes the BOP six months or longer to update its data.",
    "“These defendants haven’t been convicted of any crime, most have no criminal record, and some don’t even face charges of violence,” she said.",
    "That hearing followed months of unsuccessful attempts by some Republican lawmakers to find answers on how Jan. 6 inmates are being treated.",
    "“What I think is quite troubling is that a lot of the information this committee may seek has already been ordered to be provided.",
    "“In 2015, the Washington Lawyers Committee for civil rights released a report condemning conditions in the D.C. jails.",
    "“And the BOP is simply not providing that data.”\n\nGuernsey also said the BOP isn’t providing accurate COVID-19 data.",
    "They and other House members called for another hearing with BOP officials to answer their questions.",
    "The Epoch Times emailed the BOP, seeking a response to the criticisms leveled during the hearing.",
    "Some inmates are released when they’re on their deathbeds, according to Guernsey.",
    "According to the BOP, 279 federal inmates have died from the coronavirus.",
    "“They’re literally released so they don’t die in chains,” she said.",
    "Rep. Cori Bush (D-Mo.)"
  ]
}