{
  "id": 817,
  "mediaId": 2937,
  "date": "2022-04-22",
  "headline": "House Republicans ask Twitter board to retain records tied to Musk offer",
  "image": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2022/04/musk-twitter.jpg?quality=100&strip=all",
  "link": "https://torontosun.com/news/world/house-republicans-ask-twitter-board-to-retain-records-tied-to-musk-offer",
  "mediaOutlet": "torontosun.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Shepardson",
  "authorUrl": "",
  "termIds": [
    1670,
    4787,
    305,
    472,
    878,
    1016,
    1094,
    5390
  ],
  "sentences": [
    "Article content\n“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter signed by the top Republican on the House Judiciary Committee, Jim Jordan, and others on the committee.",
    "The letter, which was also signed by top Republicans on Judiciary subcommittees, said the Twitter board’s “reactions to Elon Musk’s offer to purchase Twitter, and outsider opposition to Musk’s role in Twitter’s future are concerning.”\nMusk on Thursday said he has lined up $46.5 billion in debt and equity financing to buy Twitter and is considering taking his offer directly to shareholders, according to a filing with U.S. regulators.",
    "Twitter, which declined comment on the letter on Friday, on Thursday said, “The board is committed to conducting a careful, comprehensive and deliberate review to determine the course of action that it believes is in the best interest of the company and all Twitter stockholders.”\nTwitter shares were up 3.2% to $48.55 in midday trading.",
    "Musk, the world’s richest person according to a tally by Forbes, on April 14 presented a “best and final” cash offer of $43 billion to Twitter’s board, saying the social media company needs to be taken private to grow and become a platform for free speech.",
    "Article content\nWASHINGTON — A group of 18 U.S. House Republicans on Friday sent Twitter board members a letter asking them to preserve all records and materials relating to Tesla Chief Executive Elon Musk’s offer to purchase Twitter.",
    "Republicans are forecast by many to retake control of the House of Representatives in the November elections which would allow them to open a formal investigation into Twitter and potentially subpoena records from Tesla.",
    "Republicans have criticized Twitter for steps like banning the account of former U.S. President Donald Trump due to the risk of further incitement of violence after the storming of the U.S. Capitol.",
    "Musk also is considering a tender offer to buy all company stock from shareholders but has not decided whether to do so, according to the filing.",
    "Democrats on the panel, who did not sign the letter, did not immediately comment on Friday.",
    "Twitter failed to respond to his offer and adopted a “poison pill” to thwart him.",
    "Article content\nCNBC reported the letter earlier on Friday."
  ]
}