{
  "id": 859,
  "mediaId": 2688,
  "date": "2022-04-14",
  "headline": "Trump Set To Endorse JD Vance After Ohio GOPer Spent Months Repenting For Anti-Trump Past",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/04/GettyImages-634097188.jpg",
  "link": "https://talkingpointsmemo.com/news/trump-jd-vance-endorsement?utm_source=rss&utm_medium=rss&utm_campaign=trump-jd-vance-endorsement",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Shuham",
  "authorUrl": "https://talkingpointsmemo.com/profile/matt-shuham",
  "termIds": [
    1670,
    1804,
    1902,
    2201,
    3466,
    4526,
    764,
    767,
    878,
    5212
  ],
  "sentences": [
    "The TV ads featured footage of Vance in 2016 when he declared himself a “Never Trump guy” and panned Trump by calling the then-GOP presidential candidate an “idiot,” “noxious” and “offensive.”\nVance has since walked back his previous criticism of Trump in an apparent effort to gain the former president’s endorsement — and his voting base.",
    "In his efforts to fit into the MAGA mold, Vance also adopted a habit of speaking in an “angry register” while openly referring to lawmakers in Washington as “idiots” who “hate” hardworking Americans, according to the Washington Post.",
    "And it’s only nobody if somehow the other campaigns can get him to hold off.”\nTrump’s expected endorsement of Vance comes months after the former president began injecting himself into Ohio’s Senate race to replace retiring Sen.",
    "Vance has also palled around with prominent Trump allies in recent months, with regular appearances on Fox News host Tucker Carlson’s show and welcoming the support of far-right lawmaker Rep. Marjorie Taylor Greene (R-GA).",
    "Soon after deleting old anti-Trump tweets last year, Vance went out of his way to repent for his sin of criticizing Trump, telling Fox News that he “regrets being wrong about” the former president.",
    "Among Vance’s supporters in the former president’s inner circle is his adult son Donald Trump Jr., who hoped alongside other Vance backers that Trump would announce the endorsement on Thursday.",
    "The source noted that Rep. Jim Jordan (R-OH), one of Trump’s staunchest allies in Congress, tried to warn the former president against backing Vance on behalf of Mandel, whom Jordan supports.",
    "Last November, Trump reportedly called Club for Growth President David McIntosh to demand that the conservative organization take down its TV ads targeting Vance, according to Politico.",
    "Vance, the once anti-Trump “Hillbilly Elegy” author who has almost cartoonishly tripped over himself to gain the former president’s approval in the past year, according to NBC News.",
    "The former president reportedly called donors and advisers in recent days to get their opinion about potentially endorsing Vance, NBC News reported.",
    "Trump apparently held off on announcing his endorsement of Vance due to pressure from the rival GOP campaigns of Josh Mandel and Jane Timken.",
    "So Trump can always change his mind,” one source who had spoken recently to Trump about the Ohio race told NBC News.",
    "“The Mandel people hit the roof,” one Republican with knowledge of the discussions told NBC News.",
    "Trump is scheduled to rally his supporters in Ohio ahead of the GOP primary on April 23.",
    "Former President Trump is reportedly set to endorse Ohio Senate candidate J.D.",
    "“But he already kicked the tires on everyone and he’s ready to go with Vance.",
    "“Nothing is final until it’s final.",
    "It’s either Vance or nobody.",
    "Rob Portman (R-OH)."
  ]
}