{
  "id": 866,
  "mediaId": 2676,
  "date": "2022-04-22",
  "headline": "Kevin McCarthy caught on tape: Trump won't forgive him this time",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2020/12/mccarthy-trump-1224201.jpg",
  "link": "https://www.salon.com/2022/04/22/kevin-mccarthy-caught-on-tape-wont-forgive-him-this-time/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather Digby Parton",
  "authorUrl": "https://www.salon.com/writer/heather_digby_parton",
  "termIds": [
    0
  ],
  "sentences": [
    "Excerpts of the latest tell-all book about Donald Trump's tumultuous final days in the White House as he attempted to execute his coup d'etat, this one by New York Times reporters Jonathan Martin and Alexander Burns, made the rounds on Thursday and contained some new juicy details about the doings of then-Senate Majority Leader Mitch McConnell, R-Ky., and McCarthy during that period.",
    "The book, entitled \"This Will Not Pass: Trump, Biden and the Battle for America's Future,\" reveals McConnell making delightful comments like, \"The Democrats are going to take care of the son of a bitch for us,\" referring to the impending impeachment over the events of January 6th about which he reasonably said, \"If this isn't impeachable, I don't know what is.\"",
    "McConnell said as much on the floor of the Senate and despite his unprincipled commitment to vote for Trump in 2024 should he be the nominee, McConnell has made no secret of his loathing for Trump — a loathing that is fully reciprocated by the man who calls McConnell \"Old Crow\" and urges every Senate candidate to vote against him for Senate leader.",
    "A month before Donald Trump clinched the Republican nomination, one of his closest allies in Congress — House Majority Leader Kevin McCarthy — made a politically explosive assertion in a private conversation on Capitol Hill with his fellow GOP leaders: that Trump could be the beneficiary of payments from Russian President Vladimir Putin.",
    "The minority leader himself put out a statement later:\nLast night the two authors appeared on Rachel Maddow's show with receipts:\nThere's no word from Trump as I write this and one assumes that the MAGA faithful in the House are waiting to get the signal from their Dear Leader.",
    "Two days later McCarthy was on the phone with his leadership team again, as the Times reported:\nWhen Representative Liz Cheney of Wyoming asked about the chances Mr. Trump might resign, Mr. McCarthy said he was doubtful, but he had a plan.",
    "Mr. McCarthy said he would tell Mr. Trump of the impeachment resolution: \"I think this will pass, and it would be my recommendation you should resign,\" he said, according to the recording of the call, which runs just over an hour.",
    "Recall that back in 2015 when then-speaker John Boehner, R-Ohio, resigned, he was considered the heir apparent until he blurted out to the TV cameras that they had staged the Benghazi hearings to bring down Hillary Clinton.",
    "\"There's two people I think Putin pays: Rohrabacher and Trump,\" McCarthy (R-Calif.) said, according to a recording of the June 15, 2016 exchange, which was listened to and verified by The Washington Post.",
    "Observing that Trump only liked the red and pink Starburst candies he deployed a staff member to buy cases of them, pull out the president's favorites and put them in a glass jar with his name on it.",
    "He asked about the process involved in invoking the 25th Amendment to remove Trump from office, but he was tremulous and afraid that the upcoming impeachment would \"put more fuel on the fire.\"",
    "McCarthy told a group of top House Republicans on January 8th that Trump's conduct was \"atrocious and totally wrong\" and he blamed the president for inciting people to attack the Capitol.",
    "House Minority Leader Kevin McCarthy, R-Calif, shot off his mouth and may have ended his second chance to become speaker of the House of Representatives much as he ended his first one.",
    "McCarthy even went so far as to admit that he wished the social media companies would ban Republicans in his caucus like Rep. Lauren Boebert of Colorado as they had banned Trump.",
    "According to Martin and Burns, as time went on, McCarthy actually seemed to gather some conviction the more clear it became what a disastrous event the insurrection was.",
    "By the time it came out, he had correctly sussed out the most advantageous ways to suck up to the president by paying attention to the most minute details.",
    "That precipitated a mad dash for a replacement and they ended up coercing former Wisconsin Republican Rep. Paul Ryan into taking the job against his will.",
    "One suspects that he'll need to do a full hair-shirt/self-flagellation while crawling on his belly singing \"YMCA\" for this one.",
    "Trump has always eventually forgiven McCarthy for these transgressions, apparently because he really likes the way he grovels.",
    "Yes, he also took to the floor on the night of January 6th and said that Trump bore responsibility for what happened that day.",
    "He communicated to him using colorful pictures and big charts and made note of his infantile preferences and catered to them.",
    "The Democrats were driving hard at an impeachment resolution, Mr. McCarthy said, and they would have the votes to pass it.",
    "But the mere fact that he said he would is a problem for him with the MAGA crowd, and, needless to say, Trump himself.",
    "I don't think anyone expected that the man Trump called \"My Kevin\" would actually call Trump and tell him to resign.",
    "But almost immediately after the Joe Biden's inauguration, McCarthy dashed off to Mar-a-Lago to kiss Trump's ring.",
    "He issued a statement saying, that McCarthy never said he was going to call the president and tell him to resign.",
    "His spotty endorsement record suggests decline\nMcCarthy's caught on tape and there's no way Trump won't hear it.",
    "McCarthy, meanwhile, is almost certainly rueing the day he booted Rep. Liz Cheney, R-Wy., from the leadership.",
    "The two men posed for a picture to commemorate the event and Trump made sure it was circulated.",
    "As I mentioned, this isn't the first time McCarthy's loose lips got him into trouble.",
    "You can be sure that Ohio Rep. Jim Jordan will let him know about it if he hasn't.",
    "After all, McCarthy isn't the only one with dreams of holding the Speaker's gavel.",
    "McCarthy didn't suffer any repercussions from Trump for that little slip-up.",
    "Now he planned to call Mr. Trump and tell him it was time for him to go.",
    "Nobody can defend that and nobody should defend it,\" he told the group.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "He acknowledged it was unlikely Mr. Trump would follow that suggestion.",
    "McCarthy isn't the only one with dreams of holding the Speaker's gavel.",
    "This isn't the first time McCarthy's loose lips got him into trouble.",
    "There is no subject about which Trump is more sensitive or volatile.",
    "It's doubtful that even Trump's nanny ever went to such trouble.",
    "The Times has reviewed the full recording of the conversation.",
    "The new book reveals what McCarthy was saying in the interim.",
    "McCarthy's spokesman denied that he ever said such a thing.",
    "He just keeps stepping in it, over and over again.",
    "Subscribe to our morning newsletter, Crash Course.",
    "RELATED: Does Trump still have the juice?",
    "Apparently, he just can't help himself.",
    "McCarthy, however, is another story.",
    "\"What he did is unacceptable.",
    "It's like a tic with him.",
    "And it paid off for him.",
    "Oops, he did it again!",
    "That's not surprising.",
    "Payback's a bitch."
  ]
}