{
  "id": 875,
  "mediaId": 2621,
  "date": "2022-04-14",
  "headline": "Trump Reportedly Plans to Endorse J.D. Vance in Crucial Ohio Senate Race",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/04/GettyImages-1330458437-scaled-e1649101629519.jpg",
  "link": "https://www.mediaite.com/trump/trump-reportedly-plans-to-endorse-j-d-vance-in-crucial-ohio-senate-race/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Meyer",
  "authorUrl": "https://www.mediaite.com/author/ken-meyer/",
  "termIds": [
    1670,
    1804,
    2201,
    3466,
    4300,
    4526,
    767,
    878,
    1171,
    5212
  ],
  "sentences": [
    "And it’s only nobody if somehow the other campaigns can get him to hold off.”\nIf Trump proceeds to endorse Vance, a one-time Trump critic, it will follow his decision to endorse Dr. Mehmet Oz for the daytime television host’s Senate run in Pennsylvania.",
    "From the report:\n‘The Mandel people hit the roof,’ one Republican with knowledge of the discussions told NBC News, noting that Ohio Republican Rep. Jim Jordan tried to dissuade Trump on behalf of Mandel, whom the congressman supports.",
    "Vance is also running in about third place in recent polling and has barely cracked double digits — a major worry for Trump who doesn’t want to waste his endorsement, the sources said.",
    "He held off on making his endorsement official, however, due to Vance’s lagging poll numbers and pressure from Vance’s rival GOP candidates: Josh Mandel and Jane Timken.",
    "Despite Vance’s efforts to politically portray himself as a firebrand and immigration hard-liner, recent polls have shown him trailing Mandel and Mike Gibbons.",
    "Former President Donald Trump reportedly plans to endorse Hillbilly Elegy author-turned-Republican Senate candidate J.D.",
    "Trump weighing in on Ohio’s crowded senate GOP primary comes as the contest has been heating up in recent weeks.",
    "Trump’s Oz endorsement raised eyebrows among conservatives who’ve publicly wondered if that was the right call.",
    "NBC reports that Trump has been consulting with donors and advisers recently about endorsing Vance.",
    "Trump has been concerned with Vance, who criticized the former president bitterly in 2016.",
    "But he already kicked the tires on everyone and he’s ready to go with Vance.",
    "Absentee voting by mail has already started, and Election Day is May 3.",
    "“Nothing is final until it’s final,” a source told NBC.",
    "“Trump can always change his mind.",
    "Vance in Ohio’s upcoming primary.",
    "It’s either Vance or nobody.",
    "Have a tip we should know?",
    "tips@mediaite.com"
  ]
}