{
  "id": 907,
  "mediaId": 2630,
  "date": "2022-04-10",
  "headline": "McCarthy's Jan. 6 committee gamble faces big test this spring",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220408-kevin-mccarthy-2019-ac-525p-a0d145.jpg",
  "link": "https://www.nbcnews.com/politics/congress/mccarthys-jan-6-committee-gamble-faces-big-test-spring-rcna23681",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Wong",
  "authorUrl": "https://www.nbcnews.com/author/scott-wong-ncpn1288785",
  "termIds": [
    1670,
    2159,
    2201,
    2599,
    3224,
    3267,
    3731,
    3816,
    4715,
    5390
  ],
  "sentences": [
    "She rejected two of McCarthy’s five picks for the panel — GOP Reps. Jim Jordan of Ohio and Jim Banks of Indiana — saying they had made statements that could jeopardize the “integrity of the election.”\nPelosi told McCarthy she would seat the three other Republicans — Rodney Davis of Illinois, Kelly Armstrong of North Dakota and Troy Nehls of Texas — and suggested that he pick two others.",
    "\"It will really [get at] the truth of why we were so ill-prepared that day, what were the decisions made to make us ill-prepared and what can we do to make sure that that never happens again.”\nNehls, a former sheriff of Fort Bend County, Texas, said he’s helping with the competing GOP investigation and plans to turn his findings over to McCarthy.",
    "“They already have the report written, and they’re trying to create a narrative for it instead of trying to get to the truth.”\nBut with the Jan. 6 committee preparing to shift next month from the investigative phase to public, televised hearings, McCarthy’s decision last summer to shun the panel will face perhaps its biggest test.",
    "Instead, the hearings will be tightly controlled and well-choreographed, focusing on areas like the plot to overturn Joe Biden’s election victory, intelligence and security breakdowns related to the attack and what Trump and his inner circle were doing during the hourslong riot that claimed several lives.",
    "They’re not going to have that this time.”\nMcCarthy’s decision to yank his members off the Jan. 6 panel — a response to Speaker Nancy Pelosi’s blocking two of his picks — means pro-Trump Republicans largely have been left in the dark about what's in store for the public hearings.",
    "“One of the reasons Democrats’ impeachment hearings failed so spectacularly in 2019 was because you had [GOP Reps.] Elise Stefanik and Jim Jordan and Doug Collins and Mike Turner, all of them running interference because they were sitting on the panels,\" the aide added.",
    "He said that it was unprecedented for Pelosi to block the minority leader from choosing members of a select committee and that Republicans are carrying out their own inquiry into security lapses on Jan. 6, breakdowns he has repeatedly blamed on Pelosi and the Democrats.",
    "“Maybe that’s why [Pelosi] didn’t want me on the committee.”\nPelosi had said she was fine with Nehls’ serving on the panel, even though he was one of 120 Republicans who voted to challenge the certification of 2020 election results in Arizona and Pennsylvania.",
    "Months later, when Thompson struck a deal with Rep. John Katko, R-N.Y., on legislation to create an independent 9/11-style bipartisan commission, McCarthy came out in opposition, even though he had directed Katko to reach a compromise with Thompson.",
    "A member of the committee, Rep. Jamie Raskin, D-Md., a constitutional law expert who led the second impeachment team that prosecuted Trump last year over his role in the attack, said the absence of Trump allies has made the panel’s work easier.",
    "Other than public reporting, Republicans aren't aware of leads the committee is chasing, what witnesses are saying in the 750 depositions it has conducted in private and what’s in the nearly 90,000 documents it has received.",
    "\"The American people are fed up with this overdramatization of a riot that happened here at the Capitol one time,\" said Greene, who argued that Americans are more focused on border security, inflation and high gas prices.",
    "The GOP's rival investigation\nMore than eight months after those chess moves, McCarthy — who is the favorite to replace Pelosi as speaker if Republicans win back the House in November — is standing by his decision.",
    "Unlike in the first Trump impeachment hearings in 2019, loyalists of former President Donald Trump won’t be in a position to “run interference,” in the words of a GOP source, during the Jan. 6 panel proceedings.",
    "“If Republicans were on a committee and were able to participate in any of this right now, they could be leaking things, they could be setting their own narratives.”\nIn that sense, Democrats aren't complaining.",
    "In a brief interview, Jordan panned the committee as a \"complete political operation,\" while another top Trump ally, Rep. Marjorie Taylor Greene, R-Ga., said Democrats and the media need to get over Jan. 6.",
    "WASHINGTON — House GOP leader Kevin McCarthy says he has no regrets about having Republicans boycott the special committee investigating the Jan. 6 riot, dismissing the inquiry as a political hit job.",
    "Specifically, they won’t be able to aggressively cross-examine witnesses, rebut or interrupt Chairman Bennie Thompson of Mississippi and other Democrats or introduce their own evidence.",
    "As violence was unfolding at the Capitol, McCarthy called Trump and urged him to call off the violent mob of his supporters; an argument ensued, and expletives were hurled.",
    "A week later, McCarthy took to the House floor and declared that Trump “bears responsibility” for the riot and should have taken action when he saw the violence unfolding.",
    "But Nehls conceded that Republicans like him would have been able to combat Democrats in televised Jan. 6 hearings if they had stayed on the select committee.",
    "McCarthy blames Trump, then backpedals\nThe attack on Jan. 6, 2021, put many GOP lawmakers in a difficult spot — but especially McCarthy.",
    "She added two of the 10 Republicans who voted to impeach Trump over the riot: Liz Cheney of Wyoming and Adam Kinzinger of Illinois.",
    "Recommended\nWith the independent commission stalled, Pelosi, D-Calif., unilaterally launched a House select committee.",
    "\"And they were able to push back on whatever Democrats were trying to press Gordon Sondland and Fiona Hill about.",
    "“Politically, I think it was a great decision, because we’re able to get work done,” he added with a grin.",
    "“This is nothing but a political show,” McCarthy said in an interview last week just off the House floor.",
    "“Institutionally, I think it was a terrible decision” for McCarthy to boycott the panel, Raskin said.",
    "But after he saw that the conservative base was siding with Trump, he quickly reversed course.",
    "“The speaker wants control of who the minority leader could put on the committee.",
    "“I would say it’s absolutely a strategic mistake,” a senior House GOP aide said.",
    "Those votes were \"not my criteria\" for ousting Banks and Jordan, she said.",
    "We got the sergeant-at-arms and the Capitol Police to participate with us.",
    "Is she concerned about what we find out?” McCarthy said in his interview.",
    "If McCarthy wouldn't make the panel a bipartisan body, then Pelosi would.",
    "That has opened McCarthy up to criticism from some fellow Republicans.",
    "McCarthy refused and pulled all Republicans off the panel.",
    "“We will expose the truth, no question about it,” he said.",
    "\"They are sick and tired of Jan. 6 — it’s over, OK?\"",
    "“There is no question about that,” Nehls said.",
    "“So we’ve been doing our own investigation.",
    "The seven other members are Democrats.",
    "We’ll have our report,\" he continued.",
    "“You’re going to have a united front.",
    "“That’s an error,” the GOP aide said.",
    "You’re not going to have a sideshow."
  ]
}