{
  "id": 909,
  "mediaId": 2658,
  "date": "2022-04-22",
  "headline": "GOP lawmakers were deeply involved in Trump plans to overturn election, new evidence suggests",
  "image": "https://static.politico.com/41/f9/971cff134b19bb9fc0d9ea57d801/gettyimages-1233273808-1.jpg",
  "link": "https://www.politico.com/news/2022/04/22/gop-lawmakers-deeply-involved-in-trump-plans-to-overturn-election-new-evidence-suggests-00027340",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    2140,
    2201,
    2906,
    3712,
    3975,
    4078,
    878
  ],
  "sentences": [
    "Deposition excerpts filed by the Jan 6. select committee — part of an effort to force former White House chief of staff Mark Meadows to appear for an interview — suggest that some of Trump’s top allies in Congress were frequently present in meetings where a handful of strategies to prevent then-President-elect Joe Biden from taking office were discussed, including efforts to replace the leadership of the Justice Department with figures who would sow doubts about the legitimacy of the election.",
    "| Drew Angerer/Getty Images\nBy Kyle Cheney and Nicholas Wu\n 04/22/2022 11:36 PM EDT\nUpdated: 04/23/2022 02:04 PM EDT\nRepublican members of Congress were heavily involved in calls and meetings with former President Donald Trump and his top aides as they devised a strategy to overturn the election in December 2020, according to new evidence filed in federal court late Friday.",
    "Members traded theories about ways to push then-Vice President Mike Pence to single-handedly stop Biden’s election, they parried with the White House Counsel’s Office on the boundaries of the law regarding presidential electors and they met directly with Pence’s staff to encourage him to take direct action on Jan. 6, when Congress convened to count electoral votes.",
    "The committee also indicated it has come to believe Trump did not attempt to contact any federal law enforcement agency amid the riot, pointing to testimony from former Acting Defense Secretary Chris Miller, Army Secretary Ryan McCarthy, former Acting Attorney General Jeff Rosen and his deputy Richard Donoghue, who indicated he never connected with Trump that day.",
    "Lawmakers who attended meetings, in person or by phone, included Reps. Scott Perry (R-Pa.), Louie Gohmert (R-Texas), Jim Jordan (R-Ohio), Matt Gaetz (R-Fla.) and numerous members of the House Freedom Caucus, according to Cassidy Hutchinson, an aide to Meadows who provided key testimony about the conversations and meetings Meadows had in December 2020.",
    "OLC doesn’t tend to provide the legal opinions, you know, in those cases, you know, in that short timeframe.”\nThe committee also homed in on Meadows’ role as an unofficial campaign adviser, noting that he routinely straddled the line between his official White House work and his effort to keep Trump in office.",
    "Others attended a Dec. 21 meeting where Rudy Giuliani, then the president’s personal lawyer, and some associates advocated a plan for Pence to unilaterally refuse to count Biden’s electors and instead send the election back to various GOP-controlled state legislatures to replace Biden’s electors with Trump’s.",
    "“He was not on any calls that I was on.”\nThe panel concluded: “It is also now clear that Mr. Trump never telephoned his Secretary of Defense that day to order deployment of National Guard, and never contacted any federal law enforcement agency to order security assistance to the Capitol Police.”",
    "Meadows was playing a campaign role, attempting to facilitate a strategy that would have reversed the certified results of the 2020 election.”\nThe committee indicated that Meadows told Jordan in a text message that he supported efforts to convince Pence to send the election back to the states.",
    "Engel indicated that Clark proposed on Jan. 3, 2021, having DOJ issue a legal advisory opinion regarding “the Vice President with respect to his authority when it comes to opening the votes as the President of the Senate on January 6th.”\n“And I shot down that idea,” Engel recalled.",
    "The committee chronicled Meadows’ frenetic activity in the final weeks before Jan. 6, with his actions including:\n— Helping the campaign craft and distribute talking points about election fraud, in concert with allies like attorney Cleta Mitchell and campaign adviser Jason Miller.",
    "Some of the GOP lawmakers were present in December meetings, Hutchinson recalled, when members of the White House Counsel’s Office raised significant legal doubts about a plan for pro-Trump activists to submit “alternate” electors in states won by Joe Biden.",
    "The panel also released text messages between Perry and Meadows about replacing Justice Department leadership before Jan. 6 with officials thought to be more sympathetic to Trump’s claims of voter fraud.",
    "It is not the role of the Department of Justice to provide legislative officials with legal advice on the scope of their duties.” And — you know, and — not to mention it was 3 days from the date.",
    "11 days to 1/6 and 25 days to inauguration,” Perry texted the then-White House chief of staff on Dec. 26, 2020, asking him to get in touch with Justice Department official Jeffrey Clark.",
    "In the filing, the select committee revealed that Meadows turned over 2,319 text messages during a brief period of cooperation but withheld more than 1,000, citing various privileges.",
    "“They felt that he had the authority to — pardon me if my phrasing isn’t correct on this, but — send votes back to the States or the electors back to the States,” Hutchinson recalled.",
    "“[H]e was not acting as anything like a typical White House Chief of Staff advising the President on official matters of government policy,” House General Counsel Doug Letter wrote.",
    "— Meeting in his office with retired Army Col. Phil Waldron, who was pushing for Trump to invoke national security procedures as part of a plan to seize control of voting machines.",
    "“This is what I prepared and sent to Sen Braun last night to help prepare him for ABC appearance this am,” Mitchell wrote on Jan. 6 to Meadows, who forwarded the email to Miller.",
    "Hundreds of documents Meadows claimed were privileged included contacts he had with Trump campaign lawyers, the committee said, citing a privilege log from Meadows himself.",
    "— Texting often with Perry about plans to install Clark at the Justice Department in order to use DOJ’s power to cast doubt on the legitimacy of the election.",
    "The new evidence underscores the expansive cast of elected Republicans who had ultimately enlisted themselves in Trump’s last-ditch effort to cling to power.",
    "The disclosure came as part of a Friday evening court filing by the select panel asking a federal court to throw out Meadows’ lawsuit against the committee.",
    "?”\n— Communicating with Raffensperger and his deputy Jason Fuchs around efforts to get Georgia officials to overturn the results in the state.",
    "In one exchange, Perry indicated he had sent separate messages to Meadows via Signal, and the two discussed a potential deputy for Clark.",
    "And I went over to meet with him at one point, and he had just waved me away, which is out of the ordinary,” Hutchinson testified.",
    "The panel also revealed that it interviewed Steven Engel, the former head of the Justice Department’s Office of Legal Counsel.",
    "Rep. Jim Jordan (R-Ohio) and Rep. Matt Gaetz (R-Fla.) speak to reporters on Capitol Hill in Washington, D.C., in 2021.",
    "— Conducting an array of calls on Jan. 6 from a secure “control car” that was part of Trump’s motorcade.",
    "Not sure it is going to happen,” Meadows texted Jordan early in the morning on Jan. 6.",
    "The — you know, the Vice President is acting as the President of the Senate.",
    "Waldron referenced the meeting in an email sent to Meadows’ Gmail account.",
    "“I never spoke to the President that day,” Donoghue told the panel.",
    "Perry rejected a request from the select panel to testify.",
    "“Mark, just checking in as time continues to count down.",
    "Let me work on the deputy position,” Meadows responded.",
    "“I know that he was on several calls during the rally.",
    "“Can the WH press office get and start using?",
    "“But I said — I said: ‘That’s an absurd idea.",
    "“We gotta get going!”\n“I got it.",
    "“I have pushed for this.",
    "I think I understand.",
    "“Mr."
  ]
}