{
  "id": 932,
  "mediaId": 2572,
  "date": "2022-04-04",
  "headline": "Jim Jordan torches media's Hunter Biden blackout in 2020: 'Only thing fake was the news'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/4a57895a-eb79-4a42-a398-c1d5f4a0f4e6/2024c2a5-1c2e-42be-889a-3323f8f7f921/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/jim-jordan-hunter-biden-coverage-fake-news",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fox News Staff",
  "authorUrl": "https://www.foxnews.com/person/s/fox-news-staff",
  "termIds": [
    1670,
    3102,
    878
  ],
  "sentences": [
    "REP. DONALDS CALLS FOR HUNTER BIDEN SPECIAL COUNSEL TO INVESTIGATE ‘CORRUPTION’ IN WHITE HOUSE\nREP. JIM JORDAN: Well, we all know they colluded 18 months ago to keep this information from the American people in the run-up to our most important election, the presidential election.",
    "Yet you had legacy media, you had Big Tech, you had the Democrat Party and of course, most importantly, had 51 former intel officials who signed the letter that said this has all the earmarks of Russian disinformation, all that proved to be false.",
    "Rep. Jim Jordan, R-Ohio, said Monday on \"The Faulkner Focus\" it's clear the mainstream media, Big Tech and Democrats \"colluded\" to keep the Hunter Biden scandal out of the headlines before the 2020 presidential election.",
    "Remember last week, Wednesday of last week, The Washington Post did two long stories one at 11:00, one at 11:04, two eight-page stories four minutes apart about the Hunter Biden laptop being real.",
    "Jordan emphasized the need to find out why the media took 18 months to confirm the authenticity of the president's son's laptop.",
    "Why, all of a sudden, is their focus this focus on now that what we all knew back then was the truth that the laptop was real?.",
    "The big question, I think right now … is why are they talking about this now?",
    "That's, I think, a key question that we need to get the answer to.",
    "So why all of a sudden are they coming clean?",
    "The only thing fake back then was the news.",
    "The eyewitnesses were real.",
    "The emails were all real.",
    "WATCH FULL VIDEO BELOW:"
  ]
}