{
  "id": 947,
  "mediaId": 2572,
  "date": "2022-04-01",
  "headline": "House votes to decriminalize marijuana at federal level",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/04/Nancy-Pelosi-Marijuana-Decriminalization.jpg",
  "link": "https://www.foxnews.com/politics/house-votes-decriminalize-marijuana",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2453,
    2698,
    2817,
    2936,
    3098,
    3280,
    3324,
    1163,
    4887,
    4977
  ],
  "sentences": [
    "Bentz continued, \"What's deeply and truly disturbing, however, about this bill is its failure to address the clear consequences of legalization, such as what this drug does to children, to drivers on our highways, to the mental health of up to 30 percent of those adults who choose to use marijuana to communities inundated with hundreds, if not thousands of foreign cartel operated, unlicensed out of control marijuana grows.\"",
    "\"Yet because of the way the federal criminal laws are written in the way that cannabis is placed in schedule one, it is very easy for a marijuana offense to actually get someone a worse sentence than an opioid offense like overprescribing OxyContin or selling fentanyl or a firearms.\"",
    "In 2020, the topic found renewed interest after U.S. Olympic champion Sha’Carri Richardson was told she would not run in the 100-meter race after she tested positive for THC, a chemical found in marijuana, at the Olympic trials – voiding her first-place results.",
    "The House heard a slew of proposed amendments for the bill, including measures to track and prevent impaired driving under the influence of marijuana, as well as carve-outs for law enforcement to restructure around the decriminalized substance.",
    "The House of Representatives voted 228-164 to pass the Marijuana Opportunity Reinvestment and Expungement Act in 2020, the first time either chamber of Congress has ever voted to decriminalize marijuana.",
    "Rep. Cliff Bentz, R-Ore., spoke against the bill on the basis of possible spikes in impaired driving without first providing the research into the possible ramifications of the decriminalization.",
    "Rep. Jim Jordan voiced outrage at the marijuana bill's timing, saying that issues such as crime, inflation, and illegal immigration should be taking precedence.",
    "\"Marijuana just didn't register in terms of the risk that it posed to people on a day to day basis compared to those two things.,\" Lamb continued.",
    "According to the Centers for Disease Control and Prevention (CDC), marijuana is the most commonly used federally illegal drug in the U.S.",
    "And the biggest law enforcement challenges that we had then and really still have today are opioids and gun violence,\" said Lamb.",
    "\"It's been obvious for years that at some point marijuana was going to be formally legalized,\" Bentz said on the floor.",
    "\"Record crime, record inflation, record gas prices, record number of illegal immigrants crossing our southern border.",
    "\"Legalizing drugs, legalizing drugs and using American tax dollars to kick-start and prop up the marijuana industry.",
    "Marijuana legalization has become a popular campaign for political candidates across the aisles in recent years.",
    "The U.S. House of Representatives voted Friday to decriminalize possession of marijuana on the federal level.",
    "Three Republicans voted yes: Matt Gaetz of Florida, Tom McClintock of California and Brian Mast of Florida.",
    "However, the legislation stalled going to the Senate, and eventually died without going any farther.",
    "Bentz disagreed with Rep. Conor Lamb, D-Pa., who spoke in favor of the decriminalization bill.",
    "The agency said 48.2 million people, or about 18% of Americans, used it at least once in 2019.",
    "You can follow him on Twitter @timothynerozzi and can email him at timothy.nerozzi@fox.com",
    "\"Before I came to Congress, I was a federal prosecutor in my hometown of Pittsburgh.",
    "Two Democrats voted no: Chris Pappas of New Hampshire and Henry Cuellar of Texas.",
    "Bentz stated that the relevant data should be provided before the bill is passed.",
    "Fox News' Julia Musto and Morgan Phillips contributed to this report.",
    "Lamb cited his time as an assistant attorney general in Pittsburgh.",
    "Timothy Nerozzi is a writer for Fox News Digital.",
    "The bill passed with a vote of 220 to 204.",
    "Such a deal for the American people.\"",
    "And what are Democrats doing today?\"",
    "Jordan asked on the floor.",
    "Wow."
  ]
}