{
  "id": 998,
  "mediaId": 2745,
  "date": "2022-03-31",
  "headline": "The political risks and realities of ending the covid border policy",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/435G5YFQTEI6ZHN5BVDATVCMDQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/31/political-risks-realities-ending-covid-border-policy/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1670,
    2201,
    3975,
    5063,
    5143
  ],
  "sentences": [
    "From June of last year through December, more than a quarter of apprehensions were people who’d already been stopped once, inflating the number of people stopped during that period from fewer than 1 million to more than 1.3 million; many of those people were the same people more than once.",
    "The presumptive rationale was that the government wanted to cut down the number of coronavirus-infected individuals entering the United States, but, in testimony before Congress, one official admitted that this move was not based on the statistics at the time.",
    "This is inaccurate and misleading for several reasons, as I explained at the time: For one thing, not all of those apprehensions were “illegal immigrants,” and for another, most of those who were apprehended were quickly slated for removal under Title 42.",
    "These considerations were probably significant in the administration’s decision-making process, but it’s also likely to be the case that the administration is responding to months of anger from an important part of the Democratic base.",
    "In 2021, only about 300,000 people who were stopped at the border were granted humanitarian release into the country while waiting for their immigration hearings to progress — many, but far fewer than the 1.9 million Jordan cited.",
    "You’ll recall that President Donald Trump delayed approval of a government funding bill in late 2018, forcing a lengthy shutdown, frustrated that the legislation did not include funding for a wall on the southern border.",
    "Using authority it claimed under U.S. Code Title 42, the government began immediately turning away thousands of people at the southern border instead of allowing them to undergo a process of adjudication or seek asylum.",
    "But that most of those who were stopped at the border were quickly removed from the country did not diminish any hand-wringing about the number of migrants who were coming to the United States.",
    "Immigration activists have been understandably furious that Biden would continue a policy instituted by Trump that kept people seeking asylum in the United States from being able to do so.",
    "Jordan and other critics of the administration drew no distinction between those people who spent little to no time on U.S. soil and those who might be on a path to legal residency.",
    "And since Biden took office, there have been multiple months in which that mark was surpassed, at least as measured in the number of stops made at the U.S.-Mexico border.",
    "Those monthly figures — and in particular their growth relative to Trump’s presidency — were repeatedly touted by Biden’s opponents as indicating a laxity at the border.",
    "But the increase in barriers at the border after the passage of legislation in 2006 pushed more migrants to monitored crossing points where they could be stopped.",
    "In January, for example, Rep. Jim Jordan (R-Ohio) criticized the administration over the “1.9 million illegal immigrants” apprehended at the border last year.",
    "One reason for doing so is that the government’s capacity to handle migrants has increased, allowing more people to enter the country to seek residency.",
    "But it seems clear that another reason for doing so is that there’s no political benefit to maintaining the policy — but, perhaps, political damage.",
    "It has waned, but even before it did, there was no reason to think that migrants were a significant source of new infections in the United States.",
    "It persisted, month after month, despite outcry from activists on the left and even despite resignations of administration officials in protest.",
    "The number of apprehensions was inflated by people being caught more than once, so the government began releasing data on repeat apprehensions.",
    "The quick-removal process meant that thousands of people each month would be stopped, removed — and would try again, only to again be stopped.",
    "At that point, it plans to end Title 42 — and with it another of Trump’s strategies for limiting migration to the United States.",
    "It was all presented as “millions surging into the country.”\nAt the same time, Title 42 probably made those numbers worse.",
    "So, while the numbers of people apprehended at the border doesn’t measure every entrant, it measures many if not most.",
    "If 200 people were seeking to migrate to the United States per month, there would be little political consternation.",
    "Some people enter illegally and are not detected, meaning they are not included in the government’s released totals.",
    "It’s important to note here that measuring the number of people entering the United States is necessarily cloudy.",
    "The administration faced a real challenge in handling the increase in migrants, making the removal policy useful.",
    "When the coronavirus hit the United States in early 2020, there was already an emergency at the southern border.",
    "He got around that by declaring a state of emergency that allowed him to move funds around to pay for the wall.",
    "The biggest factor in the country’s surges in new infections continues to be what it always was: Americans.",
    "That Biden gained no credit from the political right for keeping the policy in place makes this easier.",
    "On a month-by-month basis, you can see the difference between the two administrations under Title 42.",
    "When the pandemic emerged, the Trump administration saw a chance to build a different sort of wall.",
    "Instead, the quick-removal policy “may have been initiated for other purposes” — a fair assumption.",
    "That “emergency” persisted well past the increase in border crossings on which it was predicated.",
    "As a candidate, Joe Biden campaigned in direct opposition to Trump’s immigration policies.",
    "Under Biden, that policy was less strict; children, for example, were allowed to remain.",
    "Removing the policy is also politically useful simply because it eases those criticisms.",
    "The administration expects by May to have enough capacity to hold migrants as needed.",
    "But it was still an important part of the administration’s approach to immigration.",
    "Then, of course, there’s the ostensible rationale for the policy: the pandemic.",
    "Migrants were blamed for spreading the virus, yes, but that was rhetoric.",
    "When Trump was president, nearly all migrants were set for quick removal.",
    "This week, the administration announced it would end the policy.",
    "But when 200,000 do, things get tricky.",
    "All of this centers on numbers.",
    "But Title 42 was an exception.",
    "At least, technically.",
    "That’s important."
  ]
}