{
  "id": 1033,
  "mediaId": 2550,
  "date": "2022-04-07",
  "headline": "Morning Digest: Trump's 'bro' now frontrunner following Ohio Republican's unexpected retirement",
  "image": "https://images.dailykos.com/images/1056465/story_image/GettyImages-1325666480.jpeg?1649282302",
  "link": "https://www.dailykos.com/stories/2022/4/7/2090496/-Morning-Digest-Trump-s-bro-now-frontrunner-following-Ohio-Republican-s-unexpected-retirement?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1480,
    2201,
    2312,
    2573,
    305,
    878,
    4812,
    4893,
    5212
  ],
  "sentences": [
    "1Q Fundraising\nFL-Sen: Val Demings (D): $10 million raised, $13.1 million cash-on-hand\nIA-Sen: Michael Franken (D): $1.4 million raised, $1 million cash-on-hand\nNH-Sen: Maggie Hassan (D-inc): $4.3 million raised, $7.5 million cash-on-hand\nCA-26: Matt Jacobs (R): $320,000 raised\nFL-15: Jackie Toledo (R): $353,000 raised (in three weeks)\nIL-03: Gilbert Villegas (D): $390,000 raised\nIL-06: Sean Casten (D-inc): $784,000 raised, $2 million cash-on-hand\nIL-13: Nikki Budzinski (D): $500,000 raised, $1 million cash-on-hand\nNE-01: Patty Pansing Brooks (D): $270,000 raised\nNY-18: Colin Schmitt (R): $350,000 raised\nOH-01: Greg Landsman (D): $532,000 raised, $415,000 cash-on-hand\nRI-02: Jessica de la Cruz (R): $65,000 raised (in \"two weeks of active 1Q fundraising\"), additional $20,000 self-funded\nSenate\n?",
    "Co-hosts David Nir and David Beard also recap elections this week in California and Wisconsin; explain why Republicans are finally turning on Madison Cawthorn (it's not really about cocaine and orgies); pick apart a huge blunder that led to the first attack ad in Pennsylvania's Democratic primary for Senate getting yanked off the air the very day it debuted; and provide updates on international elections in Hungary and France.",
    "\"It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins,\" said the incumbent, \"especially in the Seventh Congressional District, where almost 90 percent of the electorate is new and nearly two-thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District.\"",
    "She then goes after Mastriano for supporting what she calls \"the unconstitutional mail-in voting law,\" which passed in 2019 before Trump and his allies started to wage war on vote-by-mail: The Philadelphia Inquirer explains that a state judge ruled the legislation unconstitutional earlier this year, but that the state Supreme Court has stayed the decision.",
    "Former Trump aide Max Miller is now the frontrunner for Ohio's 7th Congressional District\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "TX-34 (special): Former Cameron County Commissioner Dan Sanchez announced Wednesday that he was entering the June special all-party primary with endorsements from former Democratic Rep. Filemon Vela and 15th District Rep. Vicente Gonzalez, who is Team Blue's nominee for a full term in the new version of the 34th.",
    "Special Elections: We have a recap of Tuesday's all-party primary in Georgia followed by a preview of a rare Thursday contest in New York:\nGA HD-45: A runoff will take place May 3 between Republican Mitch Kaye and Democrat Dustin McCormick for the final months of former GOP state Rep. Matt Dollar's term.",
    "Gibbs in 2009 set his sights on challenging Democratic Rep. Zack Space in the now-defunct 18th Congressional District, a historically red area in the eastern part of the state that had favored John McCain 52-45, but he had to get past seven fellow Republicans in the following year's primary first.",
    "Republican conventions often favor extreme contenders, and Saine offered just that with a video where she declared she \"ran to expose, stop, and destroy the anti-family, anti-America, anti-God agenda\" the Democrats presented; she also used her message to decry \"weak, whiney moderates\" in the GOP.",
    "CA-22 (special): Former Assembly Minority Leader Connie Conway took first place in Tuesday's special all-party primary to succeed her fellow Republican, former Rep. Devin Nunes, but she may need to wait a while to learn the identity of her opponent in the June 7 general election.",
    "CO-07: State Sen. Brittany Pettersen, who already had the backing of retiring Rep. Ed Perlmutter and the rest of the state's Democratic delegation, will have the June Democratic primary to herself following her decisive win against minor opposition at Tuesday's party convention.",
    "With 64,000 votes counted Conway leads with 35%, while Democrat Lourin Hubbard, who is an official at the California Department of Water Resources, is in second with 20%; just behind with 15% each are GOP businessman Matt Stoll and another Democrat, Marine veteran Eric Garcia.",
    "Vance's allies at Protect Ohio Values PAC have released a new poll from Fabrizio Lee & Associates that shows an 18-18-18 deadlock between Vance, state Treasurer Josh Mandel, and businessman Mike Gibbons in the May 3 GOP primary, with former state party chair Jane Timken at 9%.",
    "OH-07: Republican Rep. Bob Gibbs said Wednesday that he was ending his re-election bid for Ohio's 7th Congressional District, a surprising announcement that came well after candidate filing closed and days following the start of early voting for the state's May 3 primary.",
    "Colorado, as we've written before, allows candidates to advance to the primary either by turning in the requisite number of signatures or by taking at least 30% of the vote at their party convention, and no other Democratic contenders successfully pursued either route.",
    "PA-Gov: The very first negative TV ad of next month's packed GOP primary comes from former U.S. Attorney Bill McSwain, who manages to fit in attacks on wealthy businessman Dave White, state Sen. Doug Mastriano, and former Rep. Lou Barletta into just 30 seconds.",
    "Gibbs (who happened to share a name with the Obama White House's first press secretary), had the support of the party establishment, including House Minority Leader John Boehner, and he benefited after tea party activists failed to back a single alternative.",
    "Republican Rep. Jeff Van Drew won a competitive re-election campaign in 2020 the year after he defected from the Democratic Party, and the state's new congressional map extended Trump's margin of victory in this South Jersey shore seat from 51-48 to 52-47.",
    "Graham adds that Vikram Mansharamani, who is an author and lecturer at Harvard, \"has been making media appearances and is reportedly speaking with potential campaign strategists and advisors,\" though he also hasn't said anything about his 2022 plans.",
    "Miller, who was one of Trump's favorite aides (an unnamed source told Politico that the two \"had … kind of a unique 'bro' relationship\") received his old boss' backing last year against Gonzalez, who voted for impeachment and later decided to retire.",
    "NJ-03: Redistricting transformed Democratic Rep. Andy Kim's South Jersey seat from a constituency Trump narrowly carried to one that Biden would have won 56-42, though it's possible this district could still be in play in a tough year for Team Blue.",
    "Rep. Anthony Brown, meanwhile, has received endorsements from 32BJ SEIU, which represents property service workers, and 1199SEIU, which is for health care employees: Maryland Matters writes that these groups represent a total of 30,000 Marylanders.",
    "That's because state Sen. Barb Kirkmeyer, Thornton Mayor Jan Kulmann, and retired Army Green Beret Tyler Allcorn previously turned in the requisite 1,500 signatures they needed to make the ballot, so they did not need to take part in the assembly.",
    "NJ-06: Longtime Democratic Rep. Frank Pallone faces his first notable Republican opposition in some time in the form of Monmouth County Commissioner Sue Kiley, but she's still very much the underdog in a seat that would have backed Biden 59-40.",
    "NJ-08: Democratic leaders responded to Rep. Albio Sires' retirement announcement in December by immediately consolidating behind Port Authority Commissioner Robert Menendez Jr., who is the son and namesake of New Jersey's senior U.S. senator.",
    "NH-Sen: The NH Journal's Michael Graham writes that many GOP insiders believe that two-time New York Senate nominee Wendy Long will join the Republican primary to challenge Democratic incumbent Maggie Hassan, though there's no word from her.",
    "Tedesco, like Caraveo, had originally planned to both collect signatures and take part in the assembly, but because he failed to turn in enough petitions ahead of last month's deadline, his showing Tuesday marked the end of his campaign.",
    "PA-Sen: TV personality Mehmet Oz has publicized a survey from Basswood Research that shows him edging out former hedge fund manager David McCormick 25-22 in the May 17 GOP primary, with former Ambassador to Denmark Carla Sands at 13%.",
    "Kean's most notable intra-party foe is Assemblyman Erik Peterson, but there are five other candidates, including Fredon Mayor John Flora and 2021 gubernatorial candidate Phil Rizzo, who could split whatever anti-Kean vote there is.",
    "Miller ended up taking on Gibbs, who was far more loyal to the MAGA movement, after redistricting led them to seek the same seat, and Trump's spokesperson said last month that the endorsement carried over to Miller's new campaign.",
    "MI-Gov: Wealthy businessman Perry Johnson's new spot for the August GOP primary blames Democratic incumbent Gretchen Whitmer, Joe Biden, and the state's former governor, Secretary of Energy Jennifer Granholm, for high gas prices.",
    "Redistricting two years later left the freshman congressman with a new district, now numbered the 7th, that was largely unfamiliar to him, but unlike in 2022, he faced no serious intra-party opposition in this red constituency.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nHow Democrats are fighting to hold the House, with Ali Lapp\nThe Downballot\nFollowShare\n0:0050:44\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n?",
    "Lapp discusses HMP's role in the broader Democratic ecosystem, how the organization decides which districts to target, and promising research showing the positive impacts of a new ad touting Democrats' record on the economy.",
    "NJ-11: The state's new congressional map augmented Biden's margin in this North Jersey seat from 53-46 all the way up to 58-41, but five Republicans are still hoping that Democratic Rep. Mikie Sherrill is vulnerable.",
    "Caraveo took 71% of the delegate votes at her party's convention (also known as the party assembly), while Adams County Commissioner Chaz Tedesco fell just short of the 30% he needed to appear on the primary ballot.",
    "NJ-05: Rep. Josh Gottheimer, who is one of the most prominent moderate Democrats in the House, got some welcome news when filing closed and he learned he had no primary opposition in this North Jersey constituency.",
    "AL-Sen: The first half of Army veteran Mike Durant's ad details his near-death experience during the 1993 \"Black Hawk Down\" incident in Somalia, with the narrator declaring, \"Mike Durant was saved by his brothers.",
    "Florida Politics writes it was in that capacity that he made several media appearances, including on \"Jimmy Kimmel Live!,\" to explain how the 2018-2019 government shutdown was impacting him and his colleagues.",
    "A fifth Republican, business owner Jewels Gray, is still waiting to hear from election officials if she submitted enough petitions to make the ballot after she failed to win 30% of the vote at the convention.",
    "NY AD-20: We have a special election in Nassau County to succeed Republican Melissa Miller, who resigned in February after she was appointed to the Hempstead Town Board, in a seat Trump carried 52-47 in 2020.",
    "The narrator goes after Whitmer for wanting to close Enbridge Line 5, which The Washington Post explains is \"a 69-year old petroleum pipeline that runs under the Great Lakes\" that is in danger of spillage.",
    "Timken, for her part, has dropped a Moore Information survey that finds Gibbons leading Mandel 20-16, with her just behind at 15%; state Sen. Matt Dolan takes 13%, while Vance brings up the rear with 10%.",
    "The frontrunner looks like Morris County Commissioner Tayfun Selen, who sports important GOP county party endorsements; also in the race are Army veteran Toby Anderson and former prosecutor Paul DeGroot.",
    "NJ-07: Democratic Rep. Tom Malinowski is defending a North Jersey seat where redistricting shrunk Biden's margin of victory from 54-44 to 51-47, and he's likely to face a familiar opponent in the fall.",
    "Those showings didn't impress many people except perhaps off-and-on Trump advisor Corey Lewandowski, who has claimed with \"100%\" certainty that an unnamed woman will join the primary to take on Hassan.",
    "IL-15: Politico reports that the anti-tax Club for Growth is spending $400,000 on an ad campaign touting Mary Miller ahead of her June Republican primary showdown against fellow Rep. Rodney Davis.",
    "Former state Senate Minority Leader Tom Kean Jr. is running again after losing to Malinowski just 51-49 in 2020, and he has the influential party endorsement in all six of the district's counties.",
    "On the other side, Weld County Commissioner Lori Saine was the only major candidate to compete at Team Red's assembly on Saturday, and her easy victory earned her the top spot on the June ballot.",
    "The six-term congressman's abrupt retirement leaves former Trump aide Max Miller as the frontrunner to claim a seat in the Canton area and Akron suburbs that Trump would have carried 54-45.",
    "Miller last year also filed a defamation lawsuit against his ex-girlfriend, former White House press secretary Stephanie Grisham, after she accused him of physically attacking her in 2020.",
    "Long earned just over one-quarter of the vote back in the Empire State against Kirsten Gillibrand and Chuck Schumer in 2012 and 2016, respectively, and she's since moved to New Hampshire.",
    "Kaye is not running for a full term, while McCormick faces no intra-party opposition in the regular May primary to take on Republican state Rep. Sharon Cooper in the new version of HD-45.",
    "MD-AG: Former Judge Katie Curran O'Malley has picked up the support of former Sen. Barbara Mikulski, who served from 1987 until 2017, for the July Democratic primary for this open seat.",
    "Gibbs used his statement to express his anger at the state Supreme Court, which is not scheduled to rule on the fate of the new GOP-drawn congressional map until well after the primary.",
    "On this week's episode of The Downballot, we're joined by Ali Lapp, the founder of the House Majority PAC—the largest super PAC devoted to helping Democrats win House races nationwide.",
    "NC-Sen: The Republican firm Cygnal, which did not identify a client, has a new general election survey that finds GOP Rep. Ted Budd leading Democrat Cheri Beasley 45-43 as former Gov.",
    "CO-08: State Rep. Yadira Caraveo became the sole Democratic contender for this new swing seat on Tuesday, while at least four Republicans will be competing in the June party primary.",
    "Civil rights attorney Tim Alexander has the backing of the local Democratic establishment and faces no serious intra-party opposition, but he struggled to raise money during 2021.\n?",
    "Milwaukee, WI Mayor: Acting Mayor Cavalier Johnson decisively won Tuesday's special election to succeed his fellow Democrat, Tom Barrett, by beating conservative Bob Donovan 72-28.",
    "GA-Sen: Banking executive Latham Saddler is using his opening spot to contrast his service in the military with GOP primary frontrunner Herschel Walker's time as a football star.",
    "The state senator ultimately beat 2008 nominee Fred Dailey, who had lost to Space 60-40, in a 20.9-20.7 squeaker, though it took another month to confirm Gibbs' 156-vote victory.",
    "GA-07: Democratic Rep. Lucy McBath has earned the support of the American Federation of Government Employees for next month's primary against fellow incumbent Carolyn Bourdeaux.",
    "Four other Democrats are running in this safely blue seat in the Jersey City area, but there's no indication that any of them are capable of giving Menendez a serious fight.",
    "Space went on the offensive early by portraying his opponent as a tax hiker and a supporter of free trade agreements, but Gibbs ended up unseating him in a 54-40 landslide.",
    "Neither Conway nor Hubbard are running for a full term in Congress anywhere, while Stoll and Garcia are challenging Democratic Rep. Jim Costa in the new 21st District.",
    "Saddler begins by acknowledging, \"Herschel Walker was my childhood sports hero,\" before continuing, \"I also wore a uniform: I ran on the battlefield as a Navy SEAL.\"",
    "Calabrese, who would be the state's first openly gay member of Congress, served as a Navy combat aviator before working for the FAA, including as a labor official.",
    "The firm warned back in January that Vance's numbers were in a \"precipitous decline,\" but they're now crediting the PAC's ad campaign with propelling him forward.",
    "It is not clear how many votes are left to tabulate, but the Los Angeles Times says that any mail-in ballots postmarked by Tuesday have until April 12 to arrive.",
    "The narrator begins by declaring that White, who is a former member of the Delaware County Council, \"is a career politician who voted to raise property taxes.\"",
    "To put it another way, a mere 9% of the residents of the new 7th are already Gibbs' constituents, so he would have been campaigning in largely unfamiliar turf.",
    "Also in the mix are 2020 nominee Frank Pallotta, who lost to Gottheimer 53-46, and businessman Fred Schneiderman, who recently began airing his opening TV ad.",
    "Gibbs himself got his start in elected office in 2002 when he won a seat in the Ohio state House, and he won a promotion six years later to the state Senate.",
    "FL-22: Commercial airline pilot Curtis Calabrese announced this week that he would join the August Democratic primary to succeed retiring Rep. Ted Deutch.",
    "Miller, by contrast, began the cycle by running against Rep. Anthony Gonzalez in a primary for the old 16th District, which makes up 65% of the new 7th.",
    "Democrats in 2018 hoped that well-funded Navy veteran Ken Harbaugh could give Gibbs a serious fight, but the incumbent decisively turned him back 59-41.",
    "The most prominent challenger appears to be Marine veteran Nick De Gregorio, who has the influential GOP party endorsement in populous Bergen County.",
    "NJ-02: Monday was the filing deadline for New Jersey's June 7 primary, and the state has a list of contenders for the U.S. House available here.",
    "The rest of the commercial touts McSwain as a \"Trump-appointed prosecutor\" who has \"never run for office and will permanently cut the gas tax.\"",
    "Calabrese, who is a first-time candidate, will take on Broward County Commissioner Jared Moskowitz, who had the field to himself up until now.",
    "Kate Brown announced Wednesday that she was endorsing state Rep. Andrea Salinas in the crowded May 17 Democratic primary for this new seat.",
    "A few other Republicans are also in including former RNC staffer Tom Toomey and Rik Mehta, who was Team Red's doomed 2020 Senate nominee.",
    "The most serious Republican contender appears to be wealthy yacht manufacturer Robert Healey, who is also a former punk rock singer.",
    "He could also be in office for quite a long time to come, as Johnson is now only the fifth person elected to this post since 1945.",
    "Gibbs' name will remain on the ballot, but the secretary of state's office says that any votes cast for him will not be counted.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "The GOP is fielding Cedarhurst Deputy Mayor Eric Ari Brown while the Democratic nominee is David Lobl, a former advisor to Gov.",
    "Republicans, who are the underdogs in a seat that Biden would have carried 56-42, have not yet held their party gathering yet.",
    "You can listen to The Downballot on all major podcast platforms, and you'll find a transcript right here by noon Eastern Time.",
    "(Redistricting even made this seat, which includes northern Middlesex County and the northern Jersey Shore, slightly bluer.)",
    "Johnson, who made history as the first Black person elected to lead Milwaukee, will be up for a full four-year term in 2024.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The commercial reminds viewers that Miller is Trump's choice and pledges she'll \"never compromise on election integrity.\"",
    "(Whether Nunes will still have his gig running Trump's disastrous social media platform by June is a separate question.)",
    "The spot then abruptly changes tone as the voice says the GOP primary candidate \"believes the unborn deserve the same.\"",
    "Oz released the poll on Trump's disastrous Truth Social platform, which may make him its most prolific user by default.",
    "The general election turned out to be a far easier contest for Gibbs in what was rapidly turning into a GOP wave year.",
    "The spot does not mention state Senate President Pro Tempore Jake Corman or any of McSwain's other four opponents.",
    "Five Republicans, though, are competing here even though the new map extended Biden's margin from 52-47 to 56-43.",
    "He concludes that he's in the race \"so that you can choose between a war fighter and a celebrity.\"",
    "Finally, the narrator argues Barletta \"supported higher gas taxes and approved Obama's budgets.\"",
    "Biden would have carried this new seat, which includes Denver's northern suburbs, 51-46.\n?",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Unlike Caraveo, though, Saine's convention win doesn't ensure her the nomination.",
    "(We explain the importance of county party endorsements in New Jersey here.)",
    "Kaye led McCormick 42-40, while the balance went to two other Republicans.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "The filing deadline isn't until June 10.\n?",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "His life spared by the grace of God.\"",
    "OH-Sen: Venture capitalist J.D.",
    "Pat McCrory ties her 41-41.\n?",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Attorneys General\n?",
    "The Downballot\n?",
    "Please read it.",
    "Legislatures\n?",
    "Andrew Cuomo.",
    "OR-06: Gov.",
    "Governors\n?",
    "Mayors\n?",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}