{
  "id": 1334,
  "mediaId": 6656,
  "date": "2022-04-06",
  "headline": "Ohio Rep. Bob Gibbs announces retirement citing redistricting 'circus'",
  "image": "https://cdnph.upi.com/sv/ph/og/upi/6781649286946/2022/1/18f9522d78e3984614e4f5cde89e747c/v1.5/Ohio-Rep-Bob-Gibbs-announces-retirement-citing-redistricting-circus.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/04/06/Ohio-Rep-Bob-Gibbs-retirement-redistricting-circus/6781649286946/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Uria",
  "authorUrl": "https://www.upi.com/author/Daniel-Uria/",
  "termIds": [
    1951,
    2201,
    2312,
    3903,
    1116,
    1163,
    5212,
    5371
  ],
  "sentences": [
    "\"It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins, especially in the Seventh Congressional District where almost 90% of the electorate is new and nearly two-thirds is in an area primarily from another district, foreign to any expectations or connection to the current Seventh District,\" he said.",
    "\"I helped reform federal water resources project policy, made clean water utilities more affordable for low-income communities, lowered taxes and red tape for millions of American families and businesses and fought for a cleaner, safer Lake Erie,\" he said.",
    "Trump endorsed Miller, who was originally set to face U.S. Rep. Anthony Gonzalez, who voted to impeach the former president, but said the endorsement would carry over to a primary against Gibbs after the redistricting.",
    "The 67-year-old Gibbs, who had represented the state in the House since 2011, announced his plans in a statement that cited a redistricting process that left 12% of his former district intact.",
    "In a statement Wednesday, Trump praised Gibbs, who often supported the former president during his term in office, for \"a wonderful and accomplished career.\"",
    "Gibbs faced primary challenges from multiple candidates including Max Miller, who served as a White House aide to former President Donald Trump.",
    "\"He was a strong ally to me and MAGA, voting to support my America First agenda and fighting strongly against the Radical Left.\"",
    "April 6 (UPI) -- U.S. Rep. Bob Gibbs, R-Ohio, announced Wednesday he will retire at the end of his current term.",
    "\"His retirement, after serving in Congress for more than a decade should be celebrated by all,\" Trump said.",
    "Gibbs said it was an \"honor\" to serve the people of Ohio while listing off his accomplishments in office.",
    "\"I am proud of this work and am grateful for the opportunity to do it on behalf of Ohioans.\"",
    "\"This circus has provided me the opportunity to assess my future.\"",
    "License Photo"
  ]
}