{
  "id": 1366,
  "mediaId": 2584,
  "date": "2022-04-06",
  "headline": "Republican congressman Bob Gibbs retires, blaming redistricting ‘circus’",
  "image": "https://i.guim.co.uk/img/media/3f346956113b7858558d165f6c6061987d6a5d0c/88_0_2635_1582/master/2635.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c7d04d409cefecd24e5b0b83f42d410f",
  "link": "https://www.theguardian.com/us-news/2022/apr/06/republican-congressman-bob-gibbs-ohio-electoral-maps",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "",
  "termIds": [
    1330,
    2312,
    3903,
    878,
    1163,
    5212
  ],
  "sentences": [
    "In a statement, Gibbs said “almost 90% of the electorate” in the new seventh congressional district where he would be required to run is new, with nearly two-thirds drawn in from another district “foreign to any expectations or connection” to the district he now serves.",
    "As justices consider a request to hold mapmakers in contempt for their repeated failure to craft lines that meet constitutional muster, Republicans who control the state legislature are thinking hard about bringing impeachment proceedings against O’Connor.",
    "“These long, drawn-out processes, in which the Ohio supreme court can take weeks and months to deliberate while demanding responses and filings from litigants within days, is detrimental to the state and does not serve the people of Ohio,” he said.",
    "In response to lawsuits brought by voting rights and Democratic groups, justices have tossed four plans and counting for legislative and congressional lines, declaring each an unconstitutional gerrymander that unduly favors Republicans.",
    "The high court’s bipartisan majority, comprising the Republican chief justice, Maureen O’Connor, and three Democrats, has been engaged in a protracted back-and-forth with the Republican-controlled redistricting commission for months.",
    "That was when the Republican secretary of state, Frank LaRose, the state’s elections chief, ordered county boards of elections to reflect the Ohio Redistricting Commission’s second congressional map on ballots.",
    "He appeared to be referencing a 30 March procedural ruling by the Ohio supreme court, which extended the briefing schedule for the legal challenge to Ohio’s congressional map well past this year’s primary.",
    "The six-term congressman from Amish country exits a primary race in north-eastern Ohio that, under new temporary maps, would have put him up against the Trump-backed Republican Max Miller.",
    "Calling the decision to retire difficult, Gibbs called it irresponsible “to effectively confirm the congressional map for this election cycle seven days before voting begins”.",
    "Republican congressman Bob Gibbs announced his sudden retirement on Wednesday, declaring himself a casualty of “the circus” over Ohio’s still-unresolved congressional map.",
    "Miller was initially recruited to defeat Anthony Gonzalez, who joined a handful of fellow Republicans who voted in favor of the former Republican president’s impeachment.",
    "He called Gibbs a strong ally of his America first” agenda and the fight against “the Radical Left”.",
    "Gibbs said he believed Ohio’s prospects were bright “despite the circus redistricting has become”.",
    "Gibbs is the 17th House Republican to say he won’t seek re-election, compared with 30 Democrats.",
    "However, congressional districts for 2022 elections had actually been set since 2 March.",
    "Trump weighed in to congratulate Gibbs on “a wonderful and accomplished career”.",
    "“Thank you for your service, Bob – a job well done!” Trump said in a statement.",
    "Their face-off continues to escalate.",
    "His term runs through January 2023.",
    "Early voting is already under way.",
    "Gonzalez has since retired."
  ]
}