{
  "id": 1632,
  "mediaId": 2629,
  "date": "2022-04-02",
  "headline": "The 'Soft On Crime' Party? It's Not The Democrats",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjc5ODEyMi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwMTc4OTA3Nn0.VOdlHrTK22adAa-bSRx6IXknRskxGqyJRiN2yJQuuIY/img.jpg?width=1200&coordinates=0%2C43%2C0%2C43&height=600",
  "link": "https://www.nationalmemo.com/republican-view-on-crime",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Conason",
  "authorUrl": "https://www.nationalmemo.com/u/joeconason",
  "termIds": [
    1839,
    1930,
    2292,
    2923,
    3151,
    3481,
    3833,
    4628,
    878,
    996
  ],
  "sentences": [
    "In scandals that ranged from Pentagon procurement scams to influence peddling, perjury and the sale of arms to the Iranian mullahs, the Reaganites displayed an impressive range of delinquency — including Edwin Meese, the law-and-order attorney general who came within a hair's breadth of indictment in a defense contracting scandal and resigned his office in disgrace.",
    "He repeatedly abused the pardon power to protect his own hide from potential testimony by his criminal associates — notably including the aforementioned Stone, his former campaign manager and massive tax criminal Paul Manafort and his former adviser Steve Bannon, who escaped trial for swindling gullible conservatives in his \"We Build the Wall\" crowdfunding scam.",
    "If he could, Trump would surely exonerate the mob that attacked police officers, vandalized the Capitol and sought to murder his own vice president on Jan. 6, 2021 — many of them losers, like Proud Boys leader Enrique Tarrio, with extensive prior criminal records.",
    "Of course, he resigned from office just ahead of the prosecutors who could easily have sent him to prison for a long roster of felonies — from bribery, extortion, obstruction of justice and witness tampering to conspiracy and tax evasion.",
    "(His symbolic legacy can be seen in a tattoo on the back of political crook Roger Stone, who made his bones as a low-level Watergate offender and whose more recent felony convictions were pardoned by Donald Trump — but we'll get to that.)",
    "Look back in history, look around today, and one fact is pretty obvious: It's the Republican Party and its leadership that are ridiculously squishy on crime, perhaps due to their continuing propensity for criminal behavior.",
    "Trump had mastered the art of escaping accountability for felonious misconduct even before he entered the Oval Office — as we know from looking back at his numerous alleged tax crimes, swindles and perjuries.",
    "Trump also pardoned Chris Collins and Duncan Hunter, two former Republican members of Congress convicted on a raft of felony charges — but then again, Republican voters had already reelected both scoundrels.",
    "\"Soft on crime\" is the old dog whistle that Republican senators like Ted Cruz and Josh Hawley used to smear Judge Ketanji Brown Jackson as they attempted to derail her historic Supreme Court nomination.",
    "Why is it even possible for a man like Eric Greitens — who resigned as Missouri governor because of his violent crimes against women — to return as a serious contender in that state's U.S. Senate race?",
    "By the end of Reagan's two terms, his administration had established a new and still unsurpassed record for the number of felony convictions of federal officials in American presidential history.",
    "Jackson is almost certain to be confirmed — and her strong public approval ratings rose after the disgraceful performance of Cruz, Hawley and their GOP colleagues during her nomination hearings.",
    "Still, the criminal and other deviant behavior among Republican politicians is now worrying party leaders, who fear that prominent GOP midterm candidates are just too sleazy to win.",
    "Yet the Republican Party has since developed an even greater tolerance for villainy of every kind, as epitomized by its Dear Leader and would-be 2024 nominee, Donald J. Trump.",
    "The president who most memorably deployed that epithet in my own early political experience was Richard M. Nixon, whose campaigns relied heavily on racialized crime rhetoric.",
    "It is an art he has since perfected, as anyone can see by consulting the handy catalog provided by Citizens for Responsibility and Ethics in Washington, a watchdog group.",
    "The former president has enthusiastically endorsed other candidates credibly accused of similar offenses, including Herschel Walker in Georgia and Max Miller in Ohio.",
    "Included there is the copious evidence revealed by former FBI director Robert Mueller, a lifelong Republican, that Trump committed numerous obstructions of justice.",
    "To find out more about Joe Conason and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.",
    "Despite Nixon's epoch-making scandal, he was surpassed in at least one respect by Ronald Reagan, another loud critic of Democrats' supposed coddling of criminals.",
    "His vice president Spiro Agnew also departed under a cloud of criminal prosecution and barely avoided prison after acknowledging various petty bribes.",
    "But let's consider the Republican regurgitation of that familiar phrase, certain to be heard over and over again before November's midterm election.",
    "Well, Greitens boasts the support of that law-and-order avatar Rudy Giuliani, now under criminal investigation, and members of the Trump family.",
    "Maybe the Republicans should stop calling anybody \"soft on crime\" — unless they're talking about themselves.",
    "To Trump and many of the Republicans in his political entourage, those insurrectionist thugs are \"patriots.\"",
    "In fact, he praised them even before their excrement was mopped up from the Capitol hallways.",
    "Given that tawdry history, it may be hard to believe that those were the good old days.",
    "Certainly, no president has ever been as \"soft on crime\" as Trump himself.",
    "He couldn't be prosecuted because he was president.",
    "\"I am not a crook,\" Nixon lied.",
    "Their racist deception failed.",
    "Republican Party"
  ]
}