{
  "id": 2723,
  "mediaId": 6598,
  "date": "2022-03-21",
  "headline": "Ex-Wife of Eric Greitens, Senate Candidate in Missouri, Accuses Him of Abuse",
  "image": "https://static01.nyt.com/images/2022/03/21/us/politics/21pol-greitens-1/21pol-greitens-1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/03/21/us/politics/missouri-eric-greitens-wife.html",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Senator Josh Hawley, Republican of Missouri, who as the state’s attorney general in 2018 pressed Mr. Greitens to resign as governor, wrote on Twitter, “If you hit a woman or a child, you belong in handcuffs, not the United States Senate.”\nPart of a continuing child custody dispute, the sworn affidavit from Sheena Chestnut Greitens, 39, a professor of public policy at the University of Texas at Austin, accused Mr. Greitens of physical abuse and “unstable and coercive behavior.” The 41-page affidavit, filed on Monday in Boone County Circuit Court in Missouri, said that Mr. Greitens had become increasingly violent in 2018 as his sex scandal threatened to end a once-promising political rise that he hoped would take him to the White House.",
    "The statement said that Dr. Greitens was “engaged in a last-ditch attempt to vindictively destroy her ex-husband.”\nMr. Greitens later issued a personal statement saying he would continue “fighting for the truth and against completely fabricated, baseless allegations.”\nA lawyer for Dr. Greitens did not respond to requests for comment on Monday about the affidavit, which was reported earlier by The Associated Press.",
    "Representative Vicky Hartzler of Missouri, who is running against Mr. Greitens in the Republican primary and has garnered support from many top state officials, issued a statement accusing Mr. Greitens of “a pattern of criminal behavior that makes Eric unfit to hold any public office.”\n“He should drop out of the U.S. Senate race immediately,” she said.",
    "“Prior to our divorce, during an argument in late April 2018, Eric knocked me down and confiscated my cellphone, wallet and keys so that I was unable to call for help or extricate myself and our children from our home,” wrote Dr. Greitens, who has two young sons with Mr. Greitens and whose divorce from him became final in May 2020.",
    "She added that his “behavior included physical violence toward our children, such as cuffing our then-3-year-old son across the face at the dinner table in front of me and yanking him around by his hair.”\nIn a statement on Monday, Mr. Greitens’s campaign denied the allegations and said that they were politically motivated.",
    "The former wife of Eric Greitens, a leading Republican candidate for the U.S. Senate in Missouri, has accused him of physically abusing her and one of their sons in a sworn affidavit that could have serious implications in the race for the seat of Senator Roy Blunt, who is retiring.",
    "Mr. Greitens, whose campaign denied the allegations on Monday, abruptly resigned as governor in 2018 amid a swirling scandal that involved a sexual relationship with his former hairdresser and allegations that he had taken an explicit photograph of her without her permission.",
    "In November, Sean Parnell, a Trump-endorsed candidate for the Pennsylvania Senate seat being vacated by Patrick J. Toomey, a Republican, dropped out of that contest after a judge ruled in favor of his estranged wife in a custody fight that also involved allegations of abuse.",
    "Mr. Greitens’s lead in the polls has flummoxed other Republicans like Mr. Long, considering that the 2018 investigation of Mr. Greitens was led by Republicans and looming impeachment proceedings would have been carried out by the Republican-controlled legislature.",
    "She said he had threatened to kill himself “unless I provided specific public political support to him,” despite accusations of infidelity that she said he had admitted to, even as she said he threatened her with legal action if she revealed that confession.",
    "Representative Billy Long of Missouri, another Republican candidate for the Senate seat, said on Monday that he was “shocked and appalled” by the affidavit, adding that Mr. Greitens was “clearly unfit to represent” their state in the Senate.",
    "Mr. Greitens, 47, a former Navy SEAL, had aligned squarely with former President Donald J. Trump, cheered on anti-vaccine and anti-mask protesters, and surged to the lead in a crowded Republican primary race for a key open Senate seat.",
    "In December, another Trump-backed Senate candidate, the former professional football player Herschel Walker, who is running in Georgia, told Axios he was “accountable” for past violent behavior toward his former wife, Cindy Grossman.",
    "Mr. Greitens is one of several Republican candidates aligned with Mr. Trump who have drawn concerns from top party leaders in Washington, though the former president has yet to endorse anyone in the Missouri race.",
    "In 2018, Mr. Greitens’s former hairdresser described an alarming sexual encounter in which, she said, he had taken a photo of her and threatened to share it if she told anyone about their affair.",
    "In Ohio, a former Trump White House aide, Max Miller, challenged Representative Anthony Gonzalez after Mr. Gonzalez voted to impeach Mr. Trump, helping to push the incumbent into retirement.",
    "But until the latest revelation, his attempt at a political comeback had appeared improbably successful, despite efforts by Missouri’s Republican establishment to block it.",
    "Around the same time, questions began to emerge about whether he had used the donor list of a veterans charity he founded to help his political campaign in 2016.",
    "Mr. Miller is now suing an ex-girlfriend and former White House press secretary, Stephanie Grisham, after she accused him of physical abuse.",
    "However, his campaign said he still denied accusations from two other women who said he had displayed threatening behavior toward them.",
    "He now faces fresh calls from his opponents to drop out, lest he turn a reliably red seat competitive in November.",
    "In her affidavit, Dr. Greitens said her husband had bought a gun but refused to tell her where he had hidden it.",
    "He was also accused by prosecutors of misusing his charity’s donor list for political purposes.",
    "Hannah Norton contributed reporting."
  ]
}