{
  "id": 3604,
  "mediaId": 4008,
  "date": "2022-03-18",
  "headline": "Mel Gibson won Mad Max role after vicious fistfight - 'Not pretty'",
  "image": "https://cdn.images.express.co.uk/img/dynamic/36/750x445/1582886.jpg",
  "link": "https://www.express.co.uk/entertainment/films/1582886/mel-gibson-mad-max-bar-fight-argument",
  "mediaOutlet": "express.co.uk",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Callum Crumlish",
  "authorUrl": "https://www.express.co.uk/journalist/122674/Callum-Crumlish",
  "termIds": [
    0
  ],
  "sentences": [
    "Mad Max- Fury Road Movie CLIP - Attacked (2015) - Tom Hardy Post-Apocalypse Action Movie HD\nMad Max, the 1979 movie, was made on a shoestring budget of $350,000 and was full of brand new actors - including Gibson.",
    "MEL GIBSON made a name for himself by starring as the titular hero in the 1979 epic Mad Max - but he only got the role after being spotted covered in bruises \"every colour of the rainbow\".",
    "Miller could not afford to hire enough real actors, so he brought on members of an actual biker gang to fill out some of the iconic chase scenes through the Australian deserts.",
    "Director George Miller couldn't afford to hire professional actors at the time so held some local auditions for people to join in with his post-apocalyptic adventure movie.",
    "He added: \"They took polaroids because I was - really - every colour of the rainbow, and they put them up, and they said: 'Man, we need freaks in this film!",
    "Mad Max - Fury Road Movie Clip\nGibson remembered: \"They talked to George Miller and he just kind of gave me the part right there - it was real weird!",
    "He continued: \"I went out of the room and just kind of got the gist of what it was and I came out and, kind of, ad-libbed what I could remember.",
    "I drove him, dropped him, and waited for him in the waiting room with the girls at the casting agency - but I had had a very bad weekend.\"",
    "He then blagged his way into the audition by working his charm on director George Miller, who couldn't look away.",
    "The Passion of the Christ director said: \"I was a young actor and nobody had a job, so I thought what the hell?",
    "Two weeks later Gibson returned to the audition process and he was met with an unexpected response.",
    "Some of these bikers could not even be paid, so Miller would instead reportedly pay them with beer.",
    "It could have been a commercial for a toilet cleaner and I would have gone for it to earn a buck!\"",
    "The actor was handed a two-page document filled with dialogue, including a big emotional speech.",
    "The young actor, who was just 23-years-old at the time, was apparently as boisterous as ever.",
    "Gibson recalled the story in the special features of the Mad Max Collector's Edition Blu-ray.",
    "Pointing at the photo of himself covered in bruises, he replied: \"That's me on the wall!\"",
    "I took on half a rugby team and it just... it didn't work out too well on my end.",
    "This wasn't the only radical event that took place during the filming of Mad Max.",
    "He told fans: \"I dropped a friend off because he'd been called into an audition.",
    "Instead, the casting crew forced him to stick around and get his photo taken.",
    "The American-Australian star revealed he \"got into a brawl\" the next before.",
    "Ultimately, Mad Max earned a staggering $100 million at the box office.",
    "But this eccentric look was just what Mad Max bosses were looking for.",
    "But Gibson did not even intend to audition for the upcoming movie.",
    "After realising who he was, Gibson said they quipped: \"Oh my god!\"",
    "Gibson did as he was told, and it went extremely well for him.",
    "Gibson explained: \"I didn't come out looking too pretty.",
    "Gibson was reportedly paid just $10,000 for his role.",
    "before arranging a meeting with him and Miller.",
    "With a smirk, Gibson replied: \"Yeah, sure!\"",
    "And he said: 'Can you memorise this?'\"",
    "When you heal up come and see us.'\"",
    "So that was an attraction enough.",
    "They asked him: \"And you are?\"",
    "And it didn't go well for him.",
    "So I was looking pretty bad.\"",
    "And I guess they bought it.\""
  ]
}