{
  "id": 4167,
  "mediaId": 6676,
  "date": "2022-02-26",
  "headline": "CPAC attendees showing interest in DeSantis for presidential run",
  "image": "https://www.wkrg.com/wp-content/uploads/sites/49/2022/02/DeSantisAP22055692316089.jpg?w=1280",
  "link": "https://www.wkrg.com/national/cpac-attendees-showing-interest-in-desantis-for-presidential-run/",
  "mediaOutlet": "wkrg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://www.nxsttv.com/nmw/?post_type=profile&p=173669",
  "termIds": [
    0
  ],
  "sentences": [
    "But I think him being a strong voice for the governors is more important right now.”\nBut Schmigdall, who’s attending her third CPAC, also said that Trump can’t stay at the helm of the conservative movement forever, noting that “at some point, someone’s going to have to take that job from him and take over and make it live on longer.”\n“If somebody else steps up — probably not in ’24 but in ’28 — if someone else steps up and says ‘I’m going to continue those policies,’ I think that would be amazing,” she said.",
    "Max Miller, an Ohio congressional candidate and former Trump aide, opened his remarks on Thursday by proclaiming that Trump was “right about everything.” Rep. Andy Biggs (R-Ariz.) insisted that the former president had “ignited the brush fires of freedom.”\nMeanwhile, in “CPAC Central,” the conference’s main marketplace, one vendor set up a life-sized cardboard cutout of Trump resembling Rambo, while a cartoonish gold statue of the former president stood in the background.",
    "Saul Anuzis, a longtime Republican strategist and former Michigan GOP chair who has attended CPAC for decades, said that the burgeoning interest in DeSantis among conference attendees isn’t necessarily born out of a weariness or dislike of Trump, but rather a desire for a fresh face who can carry on the political movement that the former president helped give rise to.",
    "I really do, personally.”\nAnother attendee, Rebecca Schmigdall of Naples, Florida, said that Trump was the first candidate that comes to mind when it comes to the 2024 race for the White House, adding that she would prefer to keep DeSantis in the governor’s mansion “for as long as we can.”\n“I don’t want DeSantis to leave us yet,” she said.",
    "Before he took the stage on Thursday, CPAC Chairman Matt Schlapp heaped praise on the Florida governor, saying that he had “made every right move – you name the topic.” A video then played showing DeSantis confronting a handful of national Democrats, including President Biden and Georgia gubernatorial hopeful Stacey Abrams.",
    "Just down the hall, a man held a sign emblazoned with “DeSantisland.”\nThomas Longo, a 51-year-old contractor from New York, said that although he hopes Trump will run again in 2024, he was drawn to DeSantis because of the Florida governor’s hardline stance on issues like vaccine mandates and critical race theory.",
    "Simon Molina Herrera, a student at the University of Maryland, College Park, and campus coordinator for the conservative group Turning Points USA, said he’s looking forward to “a new generation of leaders” in the Republican Party, pointing to DeSantis as an option.",
    "Still, Trump remains “the 800-pound gorilla in the room” Anuzis said, adding that his penchant to attack anyone whom he perceives as a political rival — real or imagined — means that other Republicans interested in a potential 2024 run will have to tread lightly.",
    "“He’s really great for a presidential candidate, but I think he should run for 2028.”\nAsked about a potential 2024 bid by Trump, Molina Herrera said that if the former president runs again, he would most likely vote for another candidate in the primary.",
    "There were still signs and flags emblazoned with slogans like “Trump won” — a reference to his baseless claim that the 2020 election was stolen from him — and “Trump 2024.”\nAnd speaker after speaker paid tribute to the former president.",
    "We’ll see how everything goes.”\nThe conference — the largest annual gathering of conservative activists, writers and elected officials in the country — leaves little doubt about the sway that Trump still holds over the GOP’s grassroots.",
    "Last year’s straw poll, conducted just over a month after Trump left office, found the former president as the heavy favorite to win the 2024 nomination, scoring a 34-point lead over the second-place finisher, DeSantis.",
    "But many also expressed a deepening interest in DeSantis, whom they see as an eventual successor to Trump and future presidential candidate, especially if Trump decides against another White House campaign.",
    "ORLANDO, Fla. (The Hill) – Former President Donald Trump may be the main event at this year’s Conservative Political Action Conference (CPAC), but the gathering also put in stark relief Florida Gov.",
    "“If this thing comes back and shows that Trump is holding his support or increasing it, that should kind of tell some of these other folks that 2024 might not be in the cards,” the pollster said.",
    "Maybe it’s time for fresh leadership.”\nOne key indicator of Trump’s strength among the conservative grassroots will come out on Sunday, when the results of CPAC’s annual straw poll are released.",
    "The interest in DeSantis was clear on Thursday as droves of curious attendees filed into the main conference room ahead of his speech before promptly leaving after he had finished.",
    "But if this year’s straw poll shows any erosion in Trump’s support, it could signal a potential opening for other would-be 2024 Republicans, like DeSantis, the strategist said.",
    "Nevertheless, he has yet to follow the lead of several other would-be presidential candidates who have pledged not to seek the GOP nomination if Trump mounts another campaign.",
    "The enthusiasm is there, especially at a place like CPAC, but that only goes so far.”\nDeSantis isn’t the only potential 2024 hopeful to make an appearance at CPAC this year.",
    "DeSantis has brushed off speculation about a 2024 run, insisting that he’s focused only on his role as governor and running for reelection this year.",
    "One GOP strategist, who did not attend CPAC this year, said that it’s highly unlikely that DeSantis would challenge Trump in a presidential primary.",
    "That straw poll will measure whether attendees want to see the former president run again, as well as how other prospective candidates perform.",
    "“He’s hopefully a potential president in ’28, I would prefer, at this point.”\n“I would still like to see Trump get in there in ’24,” he added.",
    "“Ron DeSantis has been one of the greatest governors in the nation — keeping all the businesses open, keeping the state open,” he said.",
    "The red “Make America Great Again” hats that became a symbol of his two presidential campaigns were a common sight at CPAC.",
    "Conference attendees repeatedly pointed to Trump as their top choice for the 2024 Republican presidential nomination.",
    "“But I think Trump is man enough to know that if he’s not able to do it, I think Trump would back DeSantis.",
    "“To me what’ll be interesting to see is, even if people like Trump, do they want to move on?” Anuzis said.",
    "Ted Cruz (R-Texas) and Marco Rubio (R-Fla.), former Secretary of State Mike Pompeo and South Dakota Gov.",
    "“And I think that’s where DeSantis’ appeal comes from — that maybe it’s time for a new generation.",
    "But the same straw poll showed that only 68 percent of attendees wanted to see Trump run again.",
    "But if he ends up as the general candidate in the 2024 election, I think I might support him.",
    "“But I think there have been a few signs that he’s not as strong as he used to be.",
    "Some attendees, however, were less keen on the idea of a comeback bid by Trump.",
    "“I mean, I’m not sure exactly if I will vote for him in the primaries.",
    "Trump is slated to give a primetime address at CPAC on Saturday night.",
    "At several points during his remarks, the crowd stood in applause.",
    "But DeSantis was also given the full rock-star treatment.",
    "Still, he said he’s unsure about a 2024 run by DeSantis.",
    "Ron DeSantis’s growing star power within the GOP.",
    "“DeSantis is a very powerful man,” Longo said.",
    "“If he runs, he runs,” Molina Herrera said.",
    "“If he decides to run, he wins the primary.",
    "“You have to be polite,” Anuzis said.",
    "“I think eventually he probably will.",
    "Kristi Noem all spoke at the event.",
    "Everybody knows that.”",
    "Sens."
  ]
}