{
  "id": 5659,
  "mediaId": 2594,
  "date": "2022-02-10",
  "headline": "Rihanna praised for donating food and clothes to homeless veterans in Los Angeles",
  "image": "https://static.independent.co.uk/2022/02/10/08/Screenshot%202022-02-10%20at%201.57.31%20PM.png?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/arts-entertainment/music/news/rihanna-homeless-food-clothes-pregnant-b2011966.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peony Hirwani",
  "authorUrl": "https://www.independent.co.uk/author/peony-hirwani",
  "termIds": [
    0
  ],
  "sentences": [
    "And she’s going to take care of business.”\n“Despite all circumstances of how veterans are treated sleeping in tents on asphalt or tiny sheds on land they should call a home, I can say hope and joy was spread to the Veterans,” AFTP captioned the post.",
    "“We were talking about every actor in the world, essentially, and having very in-depth conversations about the benefits of someone famous or someone unknown in the role of Mad Max.”\nMiller set up a meeting with Rihanna while casting the Five Wives.",
    "“Thank you @badgalriri for pulling up with all the love and support and most importantly your ears to listen to Veterans,” Devermont wrote in an Instagram post, where he shared images of himself and Rihanna at the Brentwood campus.",
    "Earlier this week, the 33-year-old artist planned a surprise visit to the West Los Angeles Veterans Affairs campus, where she spent time with the veterans and donated several supplies for them.",
    "Honored to have been witness to this!”\nRihanna’s visit took place shortly after she revealed that she is expecting her first child with rapper A$AP Rocky.",
    "In a new book by writer Kyle Buchanan about the film, Miller said that he and casting director Ronna Kress auditioned many people for the project.",
    "In other news, Mad Max: Fury Road director George Miller recently disclosed that he considered Rihanna and Eminem for major roles in his film.",
    "“The whole process of casting Max took close to a year,” Kress says in the book, an extract of which has now been published on Vulture.",
    "“I’m not sure she was even aware of the content of the movie, so she dressed up as Rihanna, which was the right thing to do.”",
    "Recommended\nIn another video shared by Always For The People foundation, a veteran revealed details of Rihanna’s visit.",
    "“Usually, actors turn up dressed very casually, but boy, Rihanna looked spectacular when she walked in,” Miller said.",
    "“The authenticity of actually caring and listening was beyond the amazing supplies that @badgalriri donated.",
    "Rihanna was accompanied by activist and Checkpoint app founder Sennett Devermont during her visit.",
    "Rihanna is receiving praise for donating food and clothes to homeless veterans in Los Angeles.",
    "She donated clothes, food and she cares about the veterans,” he said in the video.",
    "The entrepreneur applauded Rihanna for “your amazing heart, time and energy”.",
    "Rihanna made that happen when she visited the vets today.",
    "She cares about us and she showed us.",
    "She cares about all the veterans.",
    "The greatest singer on earth.",
    "“United States Army veterans.",
    "US Marine veterans.",
    "Air Force veterans.",
    "“I met Rihanna!"
  ]
}