{
  "id": 6785,
  "mediaId": 2551,
  "date": "2022-01-27",
  "headline": "The man who made Britain chuckle for six decades: As Barry Cryer, who wrote gags for all the comedy greats, dies at 86, CHRISTOPHER STEVENS looks back on a lifetime of laughs",
  "image": "https://i.dailymail.co.uk/1s/2022/01/28/00/53465297-0-image-a-52_1643330970999.jpg",
  "link": "https://www.dailymail.co.uk/tvshowbiz/article-10450301/CHRISTOPHER-STEVENS-looks-Barry-Cryers-lifetime-laughs.html?ns_mchannel=rss&ito=1490&ns_campaign=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Stevens for the Daily Mail",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Christopher+Stevens+for+the+Daily+Mail",
  "termIds": [
    1465,
    1574,
    1663,
    2089,
    2498,
    2657,
    3420,
    4562,
    648,
    649
  ],
  "sentences": [
    "‘Oh, we go way back!’\n+7\nView gallery\nBarry Cryer was the patron saint of comedians, the figurehead with a pint in his hand and a gag for every occasion\n+7\nView gallery\nHis innumerable friends relished the morning phone calls, when he’d dust off a gag from his repertoire and ring around, telling it to a dozen people in turn, like a vintage car enthusiast taking an old motor out for a run\nHe was an unstoppable joke machine, always on hand at showbiz functions to step up to the microphone and do 20 minutes of uproarious patter if the guest speaker failed to arrive.",
    "That spurred him to go to London, where he was offered a gig at the bottom of the bill in the Windmill Theatre\nBut he was self-aware enough to know that his father’s absence had a profound effect on him: ‘I wonder whether my relentless seeking out of other people, to swap ideas, to work and to socialise with, was an attempt to replace my dad.’\nHe also credited his close relationship with his mother for his easy empathy with gay showbiz stars.",
    "One day before a recording of I’m Sorry I Haven’t A Clue, Humphrey Lyttelton said to me: ‘I’ve been asked to write a magazine article on coincidences.’ Instantly feigning surprise, I said: ‘So have I!’\nA man said to his doctor, ‘I think I’m going deaf.’ The doctor said, ‘What are the symptoms?’ He said, ‘They’re that yellow family on television.’\nA wife is in the bathroom trying on a new dress.",
    "‘My father had died, my brother was away for long periods with the Merchant Navy and I was this young bloke with vague theatrical ambitions, alone at home with my mother.’\nAfter cutting his teeth telling jokes in revues at Leeds University, where he studied literature, he landed a week at the city’s Varieties Theatre.",
    "She comes out and says to her husband: ‘Does my bum look big in this?’ He says: ‘Oh be fair, love, it’s quite a small bathroom.’\n+7\nView gallery\nBarry Cryer, pictured with Ronnie Corbett, who he met on the same day he met his wife\nA man is in the front room and his wife is in the kitchen.",
    "+7\nView gallery\nBarry Cryer, pictured with Roy Hudd and Ronny Corbett at the funeral of their friend Danny La Rue, who gave the comedy legend his big break\nHe was never out of fashion, whether the vogue was for variety skits or manic sketches during the ‘alternative comedy’ boom.",
    "You need to get out more.’\nBaz’s favourite Eric Morecambe story: a bore cornered Eric in a pub, and droned at him: ‘I always think that to be in show business you need three things...’ Eric interrupted: ‘If you’ve got three things, you should be in a circus’.",
    "He wrote for everyone from Tommy Cooper to Kenny Everett, was a warm-up man on TV shows as far different as Morecambe & Wise and Monty Python, and shared a drink with stars from music hall legend Max Miller to Edinburgh Fringe newcomers.",
    "Standing alone in the spotlight with a bucket of champagne, Baz lifted the bottle, peered over and said, ‘Oh look – monogrammed ice cubes.’\nBaz’s favourite and oldest joke: I told this as a student at Leeds University in 1955.",
    "His innumerable friends relished the morning phone calls, when he’d dust off a gag from his repertoire and ring around, telling it to a dozen people in turn, like a vintage car enthusiast taking an old motor out for a run.",
    "I met Princess Anne the other night and she said, “Can we have a do with both you b***ers there, so I can sort out which is which?”.’\nBaz’s proudest moment (so he always claimed): heckling the Pope in St Peter’s Square.",
    "He worked closely with Frankie Howerd and Kenny Everett, writing much of their material, and felt a natural affinity with them – despite being happily married throughout his career, with four children.",
    "Many British comics including Tony Hancock and Des O’Connor came up the same way, telling jokes to an audience of men in macs who were there to see the nude showgirls.",
    "Baz’s best put-down: in the middle of a routine at the Establishment Club in Soho, in the mid-1960s, a voice sneered, ‘Is this satire?’ The heckler was John Lennon.",
    "+7\nView gallery\nAfter cutting his teeth telling jokes in revues at Leeds University, where he studied literature, he landed a week at the city’s Varieties Theatre.",
    "Baz’s best quip: introducing Noel Coward on stage at the Mayfair hotel, Barry was left in the lurch when he announced the star’s name... and Coward missed his cue.",
    "Cryer’s family said he had ‘died peacefully, in good spirits and with his family around him’ on Tuesday at Northwick Park Hospital in Harrow, north-west London.",
    "He was once warming up a studio audience for Spike Milligan when the unpredictable star marched on stage, shouted, ‘Van Gogh was Jewish,’ and marched off again.",
    "‘I’d like to replace it.’ ‘Please yourself,’ said the woman, ‘the hens are round the back.’\nWillie Rushton once told me I’d drop dead in the middle of a gag.",
    "The dialogue he and Graeme Garden improvised on I’m Sorry I Haven’t A Clue, as bickering Scotsmen Hamish and Dougal, became its own spin-off series.",
    "One night, the Kray twins, London’s gangster bosses, tried to persuade him to drop in at one of their clubs: ‘I made my excuses and left,’ he said.",
    "David Frost, a TV presenter with a keen eye for talent, spotted him and brought him in to write for John Cleese, Ronnie Barker and Ronnie Corbett.",
    "Effortlessly funny with all sorts of material, from family-friendly puns to the sauciest double-entendres, he excelled in Soho cabaret.",
    "Any script is better than no script.’\nSo many people confused Barry Took and Barry Cryer that the two men used to share jokes about it.",
    "Barry and fellow comics including Bruce Forsyth used to stand in the wings, hissing rude jokes, ‘to see if we could make them wobble’.",
    "His father, John, an accountant (‘about as far away from a description of me as you can get,’ he’d say), died when he was a toddler.",
    "The rabbi had a very bad sense of direction.’\nPearls from his laughter machine\nIsn’t it terrible the way old people get patronised?",
    "In a statement they paid tribute to the star, recalling his ‘gift for friendship and a genius for putting people at their ease’.",
    "His mother didn’t remarry and rarely talked about her husband, just as Barry didn’t talk a great deal about his own upbringing.",
    "Danny La Rue hired him to write his nightclub act, and then sent him on stage to entertain the punters between performances.",
    "Generations of comedians grew up revering him, and he in turn was always affably generous with encouragement and advice.",
    "She says: ‘Smoked salmon or chicken?’ And he says: ‘Oh, love, smoked salmon.’ She says, ‘You’re having soup, Fatty.",
    "Barry Cryer was the patron saint of comedians, the figurehead with a pint in his hand and a gag for every occasion.",
    "That spurred him to go to London, where he was offered a gig at the bottom of the bill in the Windmill Theatre.",
    "And he also said: ‘Barry lives in the world of “we don’t want it good, we want it Monday”, and he delivers.",
    "Within an hour, he’s got from Barking to Tooting.’ And then, before you’d finished laughing, he’d be gone.",
    "The veteran of Radio 4’s I’m Sorry I Haven’t A Clue, who has died aged 86, had anecdotes about everyone.",
    "It seems irrationally odd to be unable to call him for comments on his own obituary: ‘Barry Cryer?",
    "He fronted a long-running series on Sky Arts, chatting each week about comedy stars he’d known.",
    "Denis Norden once said I was ‘living proof you do not have to be neurotic to be a comedian’.",
    "It was a role he fitted naturally – part stand-up, part stand-in, both warm-up and compere.",
    "That old reprobate?’ he might growl, chewing his words like a bulldog with a bone.",
    "Liberace’s piano playing was believed by faith healers to have miraculous powers.",
    "I was talking to the cat.’\nPicasso was burgled and did a drawing of the robbers.",
    "Baz’s least sympathetic audience: the Vatican Swiss Guards who dragged him away.",
    "At the same time, he could always be relied upon as a panellist on TV and radio.",
    "For the theatre to keep its licence, the girls had to stand absolutely still.",
    "‘You don’t retire in this business... the phone just stops ringing,’ he said.",
    "Baz loved writing and performing but felt no need to be the headliner.",
    "I said, ISN’T IT TERRIBLE THE WAY OLD PEOPLE GET PATRONISED, DEAR?",
    "‘I had what you might call a classic gay upbringing,’ he joked.",
    "A man was driving down a country lane and ran over a cockerel.",
    "A man in Essex decides to teach his dog to play the cornet.",
    "So they get on a train, and the dog starts his lesson.",
    "He knocked on the farmhouse door and a woman answered.",
    "‘I appear to have killed your cockerel,’ he said.",
    "Baz had incomparable stories about all of them.",
    "‘Yeah,’ he said, ‘that’s how he lost his ear.",
    "Barry told him, ‘No, this is nightclub filth.",
    "One day, Tookie called Baz and said: ‘I win!",
    "I have been dogged by good luck all my life.",
    "Barry was born in Harehills, Leeds, in 1935.",
    "As a result, he built a bombproof career.",
    "Police arrested a horse and two sardines.",
    "His ability with an adlib was legendary.",
    "I hope that doesn’t...\nAdvertisement",
    "‘Where’s yer missus?’ he yelled.",
    "It once made a blind man deaf.",
    "And I’ve loved it ever since.",
    "I was quite touched by that.",
    "‘Baz here!’ he’d announce.",
    "Baz didn’t miss a beat.",
    "I go with the flow.",
    "Tommy Cooper?",
    "Cary Grant?",
    "Jack Benny?",
    "‘Joke?"
  ]
}