[
  {
    "id": 3810,
    "mediaId": 2594,
    "date": "2022-01-26",
    "sentence": "Mr Vance's pivot from folksy intellectual to belligerent “patriot” is likely a tactic employed to take on his primary rival, former Ohio State Treasurer <span class='selected-term'>Josh Mandel</span>.",
    "author": "Graig Graziosi",
    "title": "JD Vance mocked for celebrating Marjorie Taylor Greene endorsement as he vows to take US back from ‘scumbags’"
  },
  {
    "id": 1846,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "\"Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival <span class='selected-term'>Josh Mandel</span>, which have portrayed Vance as an anti-Trump figure,\" writes Politico.",
    "author": "Brad Reed",
    "title": "JD Vance's campaign is going down in flames -- and his pollster warns he needs a 'course correction ASAP'"
  },
  {
    "id": 1922,
    "mediaId": 2664,
    "date": "2022-02-08",
    "sentence": "As Alex Eisenstadt writes for Politico about a freak-out internal memo from within the campaign of JD Vance, the wealthy investor challenging perennial GOP candidate <span class='selected-term'>Josh Mandel</span>:\n“Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival Josh Mandel, which have portrayed Vance as an anti-Trump figure.” (In reality, Vance has embraced Trump like a teenager mooning over a rock star.)",
    "author": "Thom Hartmann",
    "title": "Has America reached the 'tipping point' where most are sickened by the GOP?"
  },
  {
    "id": 11203,
    "mediaId": 2659,
    "date": "2022-03-18",
    "sentence": "He trails Mike Gibbons by 11 points and <span class='selected-term'>Josh Mandel</span> by 9 points.",
    "author": "Jason Easley",
    "title": "JD Vance Sided With Putin And Now He May Lose The Ohio Senate GOP Primary"
  },
  {
    "id": 11381,
    "mediaId": 2589,
    "date": "2022-03-18",
    "sentence": "Things went downhill from there and a moderator came over like he was the referee at a fight:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other’s faces at tonight’s GOP #OHSen forum hosted by FreedomWorks.",
    "author": "John Sexton",
    "title": "Republican debate devolves into shouting match"
  },
  {
    "id": 9607,
    "mediaId": 2640,
    "date": "2022-03-21",
    "sentence": "The debate became intense almost as soon as it began as former state treasurer <span class='selected-term'>Josh Mandel</span> attacked investment banker Mike Gibbons' business dealings in his opening remarks.",
    "author": "",
    "title": "Vets Demand Apology After Tense Clash in GOP Debate"
  },
  {
    "id": 11750,
    "mediaId": 8491,
    "date": "2022-03-22",
    "sentence": "Those would-be the moments like the exchange between <span class='selected-term'>Josh Mandel</span> and Mike Gibbons from an earlier debate, which the two of them were given a chance to explain at the start of Monday’s debate.",
    "author": "Dave Nethers",
    "title": "Ohio professors analyze Monday night’s GOP Senate Debate"
  },
  {
    "id": 7882,
    "mediaId": 2752,
    "date": "2022-04-05",
    "sentence": "Republican Senate candidate <span class='selected-term'>Josh Mandel</span> of Ohio just received Ted Cruz’s endorsement, which is highly coveted by at least a couple people who aren’t Ted Cruz.",
    "author": "Stephen Robinson",
    "title": "Ted Cruz Endorses GOP Senate Candidate Josh Mandel, Who’s Almost As Terrible As He Is"
  },
  {
    "id": 7261,
    "mediaId": 2644,
    "date": "2022-04-05",
    "sentence": "At a debate last month, Gibbons and former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, currently second in GOP primary polls, came close to a physical altercation on stage as Mandel slammed Gibbons for business links to China.",
    "author": "Steven Nelson",
    "title": "Ohio GOP Senate front-runner panned for taking $1.5M in PPP funds for bank"
  },
  {
    "id": 5920,
    "mediaId": 2671,
    "date": "2022-04-21",
    "sentence": "According to Maggie Haberman Trump expected that David McIntosh, president of Club for Growth, to drop their support for <span class='selected-term'>Josh Mandel</span> after his Vance endorsement.",
    "author": "The Right Scoop",
    "title": "REPORT: Trump unhappy with Club for Growth after Vance endorsement"
  }
]