[
  {
    "id": 11381,
    "mediaId": 2589,
    "date": "2022-03-18",
    "sentence": "Things went downhill from there and a moderator came over like he was the referee at a fight:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other’s faces at tonight’s GOP #OHSen forum hosted by FreedomWorks.",
    "author": "John Sexton",
    "title": "Republican debate devolves into shouting match"
  },
  {
    "id": 11137,
    "mediaId": 2687,
    "date": "2022-03-18",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Josh Mandel and Mike Gibbons Nearly Come to Blows"
  },
  {
    "id": 11199,
    "mediaId": 2659,
    "date": "2022-03-18",
    "sentence": "Senator, and Ohio voters got a first hand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become and that will be reflected on the ballot on May 3,” stated spokesperson Samantha Cotten.",
    "author": "Jason Easley",
    "title": "Mike Gibbons Calls Josh Mandel Unhinged After He Tried To Fight Him At Ohio Debate"
  },
  {
    "id": 10836,
    "mediaId": 2664,
    "date": "2022-03-18",
    "sentence": "Ohio Republican Senate hopefuls <span class='selected-term'>Josh Mandel</span> and Mike Gibbons got into each others' faces on Friday during a heated primary debate.",
    "author": "Brad Reed",
    "title": "WATCH: Ohio GOP Senate candidates get in each others' faces during heated primary debate"
  },
  {
    "id": 9546,
    "mediaId": 2614,
    "date": "2022-03-19",
    "sentence": "Senator, and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become, and that will be reflected on the ballot on May 3,” said Samantha Cotten, a spokesperson for Gibbons’ campaign.",
    "author": "Red Voice Media",
    "title": "Ohio GOP Primary Debate Almost Turns Into A Fist Fight As Candidates Go Off The Rails [VIDEO]"
  },
  {
    "id": 9450,
    "mediaId": 5153,
    "date": "2022-03-19",
    "sentence": "Career politician <span class='selected-term'>Josh Mandel</span> called investment banker Mike Gibbons a “p---y” under his breath at the end of the heated exchange.",
    "author": "Joseph Wilkinson",
    "title": "Republican Ohio Senate candidate calls opponent ‘p---y’ in near-altercation at debate"
  },
  {
    "id": 9097,
    "mediaId": 2644,
    "date": "2022-03-19",
    "sentence": "Senator, and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become, and that will be reflected on the ballot on May 3.”\nMandel, a former state treasurer, and Gibbons, a businessman, are two of seven candidates facing off in the crowded Republican primary.",
    "author": "Kyle Morris",
    "title": "Ohio GOP Senate debate nearly gets physical as candidates get into altercation"
  },
  {
    "id": 9678,
    "mediaId": 2525,
    "date": "2022-03-21",
    "sentence": "The debate became intense almost as soon as it began as former state Treasurer <span class='selected-term'>Josh Mandel</span> attacked investment banker Mike Gibbons’ business dealings.",
    "author": "Associated Press",
    "title": "Fight at Ohio GOP Senate debate elevates military issue"
  },
  {
    "id": 9607,
    "mediaId": 2640,
    "date": "2022-03-21",
    "sentence": "The debate became intense almost as soon as it began as former state treasurer <span class='selected-term'>Josh Mandel</span> attacked investment banker Mike Gibbons' business dealings in his opening remarks.",
    "author": "",
    "title": "Vets Demand Apology After Tense Clash in GOP Debate"
  },
  {
    "id": 8941,
    "mediaId": 2641,
    "date": "2022-03-22",
    "sentence": "Ohio GOP Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons, who made headlines over the weekend after squaring off toe-to-toe during a party debate near Columbus, did not appear ready to back down during interviews on Newsmax Monday.",
    "author": "Sandy Fitzgerald",
    "title": "Ohio's Mandel, Gibbons to Newsmax: Not Backing Down After Debate Fight"
  },
  {
    "id": 5840,
    "mediaId": 2547,
    "date": "2022-04-10",
    "sentence": "Some of you may remember Gibbons from the recent debate where he and <span class='selected-term'>Josh Mandel</span> nearly came to blows.",
    "author": "Heather",
    "title": "Ohio GOP Senate Candidate: Middle Class Doesn't Pay 'Fair Share' Of Taxes"
  }
]