[
  {
    "id": 13160,
    "mediaId": 8428,
    "date": "2022-03-02",
    "sentence": "Republican candidate for the U.S. Senate in Ohio, <span class='selected-term'>Josh Mandel</span>, pulled no punches during an interview with RSBN’s Brian Glenn at CPAC Friday, boldly stating, “I believe this election was stolen from Donald J. Trump.” He added, “I’m the only candidate in the race for U.S. Senate who’s been calling for an audit in Pennsylvania, Wisconsin, Michigan, Georgia, and everywhere we roam.”\nMandel, who recently completed two terms as Ohio’s treasurer, is also an eight-year veteran of the United States Marine Corps.",
    "author": "Summer Lane",
    "title": "Josh Mandel swings at election fraud: ‘I believe this election was stolen’"
  },
  {
    "id": 11245,
    "mediaId": 2915,
    "date": "2022-03-07",
    "sentence": "",
    "author": "Chad Groening/American Family News",
    "title": "More Than 100 Pastors Throw Support to Marine Corps Veteran Running for Senate in Ohio"
  },
  {
    "id": 11381,
    "mediaId": 2589,
    "date": "2022-03-18",
    "sentence": "Things went downhill from there and a moderator came over like he was the referee at a fight:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other’s faces at tonight’s GOP #OHSen forum hosted by FreedomWorks.",
    "author": "John Sexton",
    "title": "Republican debate devolves into shouting match"
  },
  {
    "id": 7504,
    "mediaId": 2540,
    "date": "2022-04-01",
    "sentence": "Washington (CNN)A new television ad from Ohio Republican Senate candidate <span class='selected-term'>Josh Mandel</span> is centered on a false claim that Republican primary rival Mike Gibbons, a businessman, said that military service isn't \"real work.\"",
    "author": "Daniel Dale",
    "title": "Fact check: Ad from Ohio Republican Josh Mandel falsely claims party rival Mike Gibbons said military service isn't real work"
  },
  {
    "id": 7607,
    "mediaId": 4044,
    "date": "2022-04-06",
    "sentence": "While there appears to be a significant color difference between Mandel’s face and his hands in the version that appeared in the campaign ad, this color difference is far less noticeable in the original photograph (at right in the tweet below):\nYou folks asked if <span class='selected-term'>Josh Mandel</span>’s campaign photoshopped his head onto a Black man, and I looked for answers.",
    "author": "Dan Evon",
    "title": "Did Mandel ‘Forget To Photoshop His Hands’ in Campaign Ad?"
  },
  {
    "id": 7636,
    "mediaId": 5247,
    "date": "2022-04-06",
    "sentence": "In his most recent video spot, <span class='selected-term'>Josh Mandel</span> is seen walking across the Edmund Pettus Bridge in Selma, Alabama, where Rev.",
    "author": "Sarah Sicard",
    "title": "Marine veteran’s campaign ad for US Senate features a bad photoshop job"
  },
  {
    "id": 7412,
    "mediaId": 2586,
    "date": "2022-04-06",
    "sentence": "pic.twitter.com/7kz5nYseje\n— Natalie Allison (@natalie_allison) April 5, 2022\nShe wrote, “You folks asked if <span class='selected-term'>Josh Mandel</span>’s campaign photoshopped his head onto a Black man, and I looked for answers.",
    "author": "Stephanie Dube Dwilson",
    "title": "Josh Mandel Releases Original Photo with Black Marines After Photoshop Rumor"
  },
  {
    "id": 7630,
    "mediaId": 2537,
    "date": "2022-04-07",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Josh Mandel</span> drew swift condemnation this week after he filmed a campaign ad attacking critical race theory against the backdrop of a civil rights landmark in Selma, Alabama.",
    "author": "Haley BeMiller",
    "title": "No, Josh Mandel did not edit his face onto a Black Marine in his new U.S. Senate ad"
  }
]