[
  {
    "id": 4186,
    "mediaId": 2716,
    "date": "2022-01-24",
    "sentence": "",
    "author": "Grayson Quay",
    "title": "Millionaire candidates make massive ad buys in Pennsylvania's GOP Senate primary"
  },
  {
    "id": 2818,
    "mediaId": 2590,
    "date": "2022-01-29",
    "sentence": "",
    "author": "Daniel Marans",
    "title": "Pennsylvania Democrats Decline To Endorse In Senate Primary"
  },
  {
    "id": 2706,
    "mediaId": 2658,
    "date": "2022-01-30",
    "sentence": "“The non-endorsement is a disappointment for Conor Lamb, who has been trailing behind primary frontrunner <span class='selected-term'>JOHN FETTERMAN</span>, the lieutenant governor, in polls and fundraising.”\nBUT: “Lamb demonstrated that he has a significant amount of support in the state party regardless.",
    "author": "",
    "title": "POLITICO Playbook: Trump floats pardons for Jan. 6 defendants"
  },
  {
    "id": 1869,
    "mediaId": 2822,
    "date": "2022-02-04",
    "sentence": "",
    "author": "SAM METZ and MEAD GRUVER",
    "title": "GOP now looks to censure Cheney and Kinzinger, not oust them"
  },
  {
    "id": 2443,
    "mediaId": 2637,
    "date": "2022-02-05",
    "sentence": "Last month, the Democratic state committee could not agree on endorsing any single candidate, but U.S. Representative Conor Lamb received the overwhelming majority of the votes ahead of Democratic rivals Lieutenant Governor <span class='selected-term'>John Fetterman</span> and state lawmaker Malcolm Kenyatta, according to results viewed by Reuters.",
    "author": "Jarrett Renshaw",
    "title": "With Trump silent, Pennsylvania Republicans decide against endorsing in Senate race"
  },
  {
    "id": 2615,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "",
    "author": "Dave Boyer",
    "title": "Oz, McCormick trade pro-China barbs in Pa. Senate race, show Trump’s imprint on GOP"
  },
  {
    "id": 927,
    "mediaId": 2573,
    "date": "2022-02-17",
    "sentence": "He's trailing Pennsylvania's far left Lieutenant Governor <span class='selected-term'>John Fetterman</span> in the polls and in fundraising as well.",
    "author": "",
    "title": "'The Ingraham Angle' on the green agenda"
  },
  {
    "id": 15339,
    "mediaId": 2746,
    "date": "2022-03-10",
    "sentence": "",
    "author": "Seth McLaughlin",
    "title": "Pennsylvania’s Conor Lamb hypes electability in first Senate campaign ad"
  },
  {
    "id": 11207,
    "mediaId": 2660,
    "date": "2022-03-16",
    "sentence": "",
    "author": "Tom Kertscher",
    "title": "No proof for Dr. Oz’s claim that Pa. GOP Senate rival Dave McCormick ‘paid for attacks’ on Trump"
  },
  {
    "id": 9175,
    "mediaId": 2644,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Salena Zito",
    "title": "Why ex-hedge funder Dave McCormick is beating Dr. Oz in US Senate run"
  },
  {
    "id": 9469,
    "mediaId": 2659,
    "date": "2022-03-22",
    "sentence": "",
    "author": "Jason Easley",
    "title": "Trump Is Hinting At Meddling And Handing The Pennsylvania Senate Seat To Democrats By Supporting Dr. Oz"
  },
  {
    "id": 9576,
    "mediaId": 2738,
    "date": "2022-03-23",
    "sentence": "Even if he clinched the nomination, he’d still have to face off against the state’s lieutenant governor <span class='selected-term'>John Fetterman</span>, who’s both very popular and much more social media savvy.",
    "author": "Matt Prigge",
    "title": "Dr. Oz Is Big Mad That He Was Asked To Quit His Presidential Council Post (Ditto Herschel Walker)"
  },
  {
    "id": 9036,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "\"To make matters worse, a poll recently commissioned by Lamb’s own super PAC showed his main Democratic opponent — <span class='selected-term'>John Fetterman</span> — not just beating him in a primary where the more liberal candidate often has more traction; polling showed Fetterman as the better candidate in a general election, against potential GOP nominees like Dr. Mehmet Oz.\"",
    "author": "Matthew Chapman",
    "title": "Biden-snubbed Conor Lamb says 'the race is wide open' for Pennsylvania Senate — but is that what the numbers say?"
  },
  {
    "id": 11763,
    "mediaId": 8254,
    "date": "2022-03-25",
    "sentence": "",
    "author": "Hanna Trudo",
    "title": "Is Fetterman pulling away in the Pennsylvania Senate race?"
  },
  {
    "id": 9200,
    "mediaId": 2660,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Tom Kertscher",
    "title": "Dr. Oz claimed that GOP Senate rival McCormick ‘bragged’ about offshoring jobs. That lacks evidence"
  },
  {
    "id": 7295,
    "mediaId": 2660,
    "date": "2022-04-01",
    "sentence": "(Mostly True)\nDave McCormick: Campaign website\nMehmet Oz: Campaign website\nJeff Bartos: Campaign website\nCarla Sands: Campaign website\nGeorge Bochetto: Campaign website\nKathy Barnette: Campaign website\n<span class='selected-term'>John Fetterman</span>: Campaign website\nConor Lamb: Campaign website\nMalcolm Kenyatta: Campaign website\nPennsylvania Capital-Star, \"An early guide to Pennsylvania’s 2022 Senate and governor’s primary election,\" March 15, 2022\nFox Business, \"Pennsylvania is home to most expensive Senate race in nation,\" March 24, 2022\nCity & State Pennsylvania, \"Endorsements in Pennsylvania’s U.S. Senate race keep stacking up,\" March 28, 2022\nPhiladelphia Inquirer, \"Where the Pennsylvania Democratic Senate candidates do and don't agree,\" March 7, 2022\nNew York Times, \"Dr. Oz’s Heritage Is Targeted as Rivals Vie for Trump Backing,\" March 18, 2022\nThe Hill, \"Pennsylvania Senate primaries get personal,\" March 28, 2022\nDaily Beast, \"Inside Dr. Oz’s Shameless Flip-Flop on Abortion,\" Dec. 7, 2021\nAssociated Press, \"Oz vows to renounce Turkish citizenship if elected senator,\" March 17, 2022\nPittsburgh Post-Gazette, \"For GOP Senate candidate Jeff Bartos, front-runners for the job aren’t true Pennsylvanians,\" March 22, 2022\nWOLF-TV, \"Republican Senate hopeful Carla Sands,\" March 27, 2022\nPhiladelphia Inquirer, \"George Bochetto launches Pa. Republican Senate campaign,\" March 4, 2022\nCook Political Report with Amy Walter, \"Pennsylvania Senate: Which Candidate Is the Primary Prescription for Republicans?\"",
    "author": "",
    "title": "The race for the Pennsylvania U.S. Senate seat: A guide"
  },
  {
    "id": 7149,
    "mediaId": 2592,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, Pennsylvania's progressive lieutenant governor, <span class='selected-term'>John Fetterman</span>, is locked in a race against Congressman Conor Lamb, a moderate representing the northwestern suburbs of Pittsburgh.",
    "author": "Moira Warburton and Jan Wolfe",
    "title": "Trump Endorses Celebrity Surgeon Dr. Oz For U.S. Senate Seat In Pennsylvania"
  },
  {
    "id": 6077,
    "mediaId": 2937,
    "date": "2022-04-09",
    "sentence": "Article content\nOn the Democratic side, Pennsylvania’s progressive lieutenant governor, <span class='selected-term'>John Fetterman</span>, is locked in a race against Congressman Conor Lamb, a moderate representing the northwestern suburbs of Pittsburgh.",
    "author": "",
    "title": "Trump endorses Dr. Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 5872,
    "mediaId": 2644,
    "date": "2022-04-09",
    "sentence": "",
    "author": "Patrick Reilly",
    "title": "Trump gives Dr. Oz ‘complete and total endorsement’ in wide-open PA Senate race"
  },
  {
    "id": 5820,
    "mediaId": 2551,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, Pennsylvania's progressive lieutenant governor, <span class='selected-term'>John Fetterman</span>, is locked in a race against Congressman Conor Lamb, a moderate representing the northwestern suburbs of Pittsburgh.",
    "author": "",
    "title": "Trump delivers prized endorsement to 'brilliant' Dr Oz in Pennsylvania Senate race - even though the TV surgeon once told the former president to lose weight"
  },
  {
    "id": 5700,
    "mediaId": 2713,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, Pennsylvania’s progressive lieutenant governor, <span class='selected-term'>John Fetterman</span>, is locked in a race against Congressman Conor Lamb, a moderate representing the north-western suburbs of Pittsburgh.",
    "author": "Moira Warburton",
    "title": "Trump endorses celebrity surgeon Dr Oz for US Senate seat"
  },
  {
    "id": 5679,
    "mediaId": 2637,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, Pennsylvania’s progressive lieutenant governor, <span class='selected-term'>John Fetterman</span>, is locked in a race against Congressman Conor Lamb, a moderate representing the northwestern suburbs of Pittsburgh.",
    "author": "",
    "title": "Trump endorses celebrity surgeon Dr. Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 5725,
    "mediaId": 2636,
    "date": "2022-04-09",
    "sentence": "",
    "author": "",
    "title": "Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 5604,
    "mediaId": 2551,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, Pennsylvania's progressive lieutenant governor, <span class='selected-term'>John Fetterman</span>, is locked in a race against Congressman Conor Lamb, a moderate representing the northwestern suburbs of Pittsburgh.",
    "author": "",
    "title": "Trump calls for an end to ‘woke war on women’ at North Carolina rally: Former president says 'far-left gender theories' are 'child abuse' and that public schools have replaced 'reading and math with pronouns and gender studies'"
  },
  {
    "id": 5302,
    "mediaId": 2594,
    "date": "2022-04-10",
    "sentence": "Mr Schlichter was more succinct in his rejection of the TV doctor: “Endorsing Dr Oz is like arguing that Limp Bizkit is the greatest band ever.”\nPennsylvania’s Senate primary will be held on 17 May; Republicans battling over the nomination will likely face either Lieutenant Gov <span class='selected-term'>John Fetterman</span> or Rep Conor Lamb, the two leading candidates in the state’s Democratic primary, in November.",
    "author": "John Bowden",
    "title": "Trump allies claim he was ‘played’ after endorsing TV’s Dr Oz for Senate seat"
  },
  {
    "id": 5663,
    "mediaId": 2716,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Grayson Quay",
    "title": "Trump endorses Dr. Oz for Senate"
  },
  {
    "id": 5719,
    "mediaId": 2540,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Chris Cillizza",
    "title": "The ridiculous price tag for a Senate race"
  },
  {
    "id": 5775,
    "mediaId": 2676,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Jon Skolnik",
    "title": "Trump fans angered by his endorsement of Dr. Oz"
  },
  {
    "id": 6009,
    "mediaId": 5308,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Paul Blest",
    "title": "Trump Endorsed Dr. Oz and Republicans Are Pissed"
  },
  {
    "id": 6421,
    "mediaId": 8356,
    "date": "2022-04-11",
    "sentence": "More Senate campaign coverage:PA Rep. Malcolm Kenyatta running for U.S. Senate 'because the status quo will not save us'\nCheck out:Populist Democrat <span class='selected-term'>John Fetterman</span> is touring red PA counties for U.S. Senate.",
    "author": "",
    "title": "What makes Dr. Oz's Senate campaign stand out? Trump's endorsement, TV show and wealth"
  },
  {
    "id": 6688,
    "mediaId": 2550,
    "date": "2022-04-11",
    "sentence": "Last month, an internal poll leaked by a super PAC supporting Democratic Senate candidate Connor Lamb showed Democratic frontrunner <span class='selected-term'>John Fetterman</span> beating Oz by 9 points, but trailing McCormick by 3.",
    "author": "",
    "title": "Roger Stone, former OANN host among"
  },
  {
    "id": 6189,
    "mediaId": 8254,
    "date": "2022-04-15",
    "sentence": "abc27 will also host a debate with the Democratic Party candidates for Senate on April 21 at 8 p.m. <span class='selected-term'>John Fetterman</span>, Conor Lamb, and Malcolm Kenyatta have each committed to attend.",
    "author": "George Stockburger",
    "title": "Oz, Mastriano lead latest Pennsylvania Senate, Governor polls"
  },
  {
    "id": 4717,
    "mediaId": 8253,
    "date": "2022-04-18",
    "sentence": "Conor Lamb is attacking his party's frontrunner, <span class='selected-term'>John Fetterman</span>, for seeking the endorsement of a \"democratic socialist\" and being a \"silver spooned socialist.\"",
    "author": "Wendy Daughenbaugh",
    "title": "How former President Donald Trump is impacting the Senate race, PA Primary"
  },
  {
    "id": 5762,
    "mediaId": 2580,
    "date": "2022-04-19",
    "sentence": "",
    "author": "",
    "title": "Trump accused of living in Oz after endorsing liberal TV doctor"
  },
  {
    "id": 5323,
    "mediaId": 2641,
    "date": "2022-04-19",
    "sentence": "",
    "author": "John Gizzi",
    "title": "Trafalgar Poll: Pennsylvania GOP Senate Primary Wide Open"
  },
  {
    "id": 5399,
    "mediaId": 2660,
    "date": "2022-04-19",
    "sentence": "",
    "author": "Tom Kertscher",
    "title": "Dr. Oz misses the facts in calling GOP Senate rival McCormick liberal and supportive of Biden, China"
  }
]