[
  {
    "id": 15339,
    "mediaId": 2746,
    "date": "2022-03-10",
    "sentence": "",
    "author": "Seth McLaughlin",
    "title": "Pennsylvania’s Conor Lamb hypes electability in first Senate campaign ad"
  },
  {
    "id": 5700,
    "mediaId": 2713,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, Pennsylvania’s progressive lieutenant governor, <span class='selected-term'>John Fetterman</span>, is locked in a race against Congressman Conor Lamb, a moderate representing the north-western suburbs of Pittsburgh.",
    "author": "Moira Warburton",
    "title": "Trump endorses celebrity surgeon Dr Oz for US Senate seat"
  },
  {
    "id": 6077,
    "mediaId": 2937,
    "date": "2022-04-09",
    "sentence": "Article content\nOn the Democratic side, Pennsylvania’s progressive lieutenant governor, <span class='selected-term'>John Fetterman</span>, is locked in a race against Congressman Conor Lamb, a moderate representing the northwestern suburbs of Pittsburgh.",
    "author": "",
    "title": "Trump endorses Dr. Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 7149,
    "mediaId": 2592,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, Pennsylvania's progressive lieutenant governor, <span class='selected-term'>John Fetterman</span>, is locked in a race against Congressman Conor Lamb, a moderate representing the northwestern suburbs of Pittsburgh.",
    "author": "Moira Warburton and Jan Wolfe",
    "title": "Trump Endorses Celebrity Surgeon Dr. Oz For U.S. Senate Seat In Pennsylvania"
  },
  {
    "id": 5775,
    "mediaId": 2676,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Jon Skolnik",
    "title": "Trump fans angered by his endorsement of Dr. Oz"
  },
  {
    "id": 4745,
    "mediaId": 8393,
    "date": "2022-04-21",
    "sentence": "Current Pennsylvania Lieutenant Governor <span class='selected-term'>John Fetterman</span>, Congressman Conor Lamb, and State Representative Malcolm Kenyatta will debate in Harrisburg with Dr. Dave Sosar a political scientist who says this debate is crucial to all three candidates.",
    "author": "Andy Mehalshick",
    "title": "Debate night: PA 3 Democrat candidates vying for a U.S. Senate"
  }
]