[
  {
    "id": 5061,
    "mediaId": 223,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The Strike Force includes Governors Kay Ivey (AL), Mike Dunleavy (AK), Asa Hutchinson (AR), Ron DeSantis (FL), <span class='selected-term'>Brian Kemp</span> (GA), Brad Little (ID), Eric Holcomb (IN), Kim Reynolds (IA), Larry Hogan (MD), Tate Reeves (MS), Mike Parson (MO), Greg Gianforte (MT), Pete Ricketts (NE), Chris Sununu (NH), Doug Burgum (ND), Mike DeWine (OH), Kevin Stitt (OK), Henry McMaster (SC), Kristi Noem (SD), Bill Lee (TN), Spencer Cox (UT), Glenn Youngkin (VA), Jim Justice (WV), and Mark Gordon (WY).",
    "author": "Spencer Brown",
    "title": "GOP Governors Launch 'Strike Force' to Combat Biden Border Crisis",
    "sentiment": "0.0"
  },
  {
    "id": 5066,
    "mediaId": 19,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The pact is signed by the following governors:\nGovernors Doug Ducey (AZ), Greg Abbott (TX), Kay Ivey (AL), Mike Dunleavy (AK), Asa Hutchinson (AR), Ron DeSantis (FL), <span class='selected-term'>Brian Kemp</span> (GA), Brad Little (ID), Eric Holcomb (IN), Kim Reynolds (IA), Larry Hogan (MD), Tate Reeves (MS), Mike Parson (MO), Greg Gianforte (MT), Pete Ricketts (NE), Chris Sununu (NH), Doug Burgum (ND), Mike DeWine (OH), Kevin Stitt (OK), Henry McMaster (SC), Kristi Noem (SD), Bill Lee (TN), Spencer Cox (UT), Glenn Youngkin (VA), Jim Justice (WV), and Mark Gordon (WY).",
    "author": "Bob Price",
    "title": "26 Governors Mobilize Against Migration Chaos at Border",
    "sentiment": "0.0"
  },
  {
    "id": 3304,
    "mediaId": 409,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "But Pence's support for Kemp  he proudly offered his full support for four more years of <span class='selected-term'>Brian Kemp</span> as governor of the great state of Georgia? and will hold a rally for the governor  obviously stands out.",
    "author": "Jack Butler",
    "title": "Mike Pence to Campaign for Brian Kemp in Georgia",
    "sentiment": "0.715"
  },
  {
    "id": 3306,
    "mediaId": 21,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Grace Panetta",
    "title": "Mike Pence and other Republicans Trump has attacked are circling the wagons to campaign against his pick for Georgia governor",
    "sentiment": "-0.865"
  },
  {
    "id": 3307,
    "mediaId": 233,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "In a statement announcing the May 23 rally, Pence called Kemp one of the most successful conservative governors in America.?\n\"<span class='selected-term'>Brian Kemp</span> is my friend, a man dedicated to faith, family and the people of Georgia,? Pence said.",
    "author": "Ella Lee",
    "title": "Pence will go toe-to-toe with Trump in Georgia as he announces rally with GOP Gov. Brian Kemp",
    "sentiment": "0.238"
  },
  {
    "id": 4519,
    "mediaId": 169,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "RELATED: Georgia GOP outraged Trump turned against <span class='selected-term'>Brian Kemp</span>: 'I am just so mad  beyond words\"\nBack in March, the president held a tele-rally in support of Perdue, lining the candidate's campaign coffer with half a million dollars.",
    "author": "Jon Skolnik",
    "title": "Mike Pence and top Republicans flock to Georgia to defeat Trump's candidate in key primary",
    "sentiment": "0.0"
  },
  {
    "id": 3506,
    "mediaId": 238,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hugh Hewitt",
    "title": "Opinion Trump hovers, but the number of his likely rivals keeps growing",
    "sentiment": "0.0"
  },
  {
    "id": 7251,
    "mediaId": 238,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "If <span class='selected-term'>Brian Kemp</span> gets over the finish line in the fashion that I believe is possible,? he said, It speaks volumes to the good people of Georgia.?",
    "author": "Matthew Brown",
    "title": "Inside the Republican push to stop Trumps vendetta tour in Georgia",
    "sentiment": "0"
  },
  {
    "id": 8441,
    "mediaId": 129,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "Governor's Race: <span class='selected-term'>Brian Kemp</span> scored a landslide victory over David Perdue, delivering Mr. Trump his biggest setback of the 2022 primaries.",
    "author": "",
    "title": "Republican Governors Lose Their Dread of Trump",
    "sentiment": "0.206"
  }
]