[
  {
    "id": 5413,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "In the last year, weve seen coordinated attacks on the legitimacy of our government, and meanwhile, Republicans all over the country  including <span class='selected-term'>Brian Kemp</span> and David Perdue  are abandoning any concern for our future.",
    "author": "",
    "title": "Hillary Clinton Is Back & She's Ready To Help Stacey Abrams (D) Become Governor",
    "sentiment": "0"
  },
  {
    "id": 4591,
    "mediaId": 65,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "\"Reminder: <span class='selected-term'>Brian Kemp</span> stole the gubernatorial election from Georgians and Stacey Abrams,\" Jean-Pierre tweeted on April 2, 2020, reacting to a news story about Kemp saying he only just learned that asymptomatic people can spread COVID-19.",
    "author": "Jessica Chasmar",
    "title": "Biden's new WH press secretary claimed Trump, GA Gov. Kemp 'stole' elections",
    "sentiment": "-0.888"
  },
  {
    "id": 4525,
    "mediaId": 558,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "But he won.?\nThen in 2020: Reminder: <span class='selected-term'>Brian Kemp</span> stole the gubernatorial election from Georgians and Stacey Abrams.?\nReminder: Brian Kemp stole the gubernatorial election from Georgians and Stacey Abrams.https://t.co/ZIKGTd6U1v\nOn that tweet, Psaki said: We all agree the 2018 election in Georgia is settled.",
    "author": "Josh Dickey",
    "title": "Jen Psaki Defends Successors Stolen Election Tweets Before Her Last Day as White House Press Secretary",
    "sentiment": "-0.441"
  },
  {
    "id": 7075,
    "mediaId": 323,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Plus, Donald Trump recommends Mehmet Oz declare victory before all the votes have been counted in Pennsylvania, and the contest between Georgia Governor <span class='selected-term'>Brian Kemp</span> and David Perdue enters the homestretch.Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nProsecutors presented evidence this week that Mr. Sussmann worked with cyber-researchers and opposition-research firm Fusion GPS to produce the claims on behalf of the Clinton campaign, and to feed them to the FBI.",
    "author": "The Editorial Board",
    "title": "Hillary Clinton Did It",
    "sentiment": "0.0"
  },
  {
    "id": 7074,
    "mediaId": 129,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "Under the once-in-a-decade redistricting process, Georgias Republican governor, <span class='selected-term'>Brian Kemp</span>, signed into law a new map that transformed Ms. McBaths district to favor Republicans overwhelmingly.",
    "author": "",
    "title": "Two Democratic Congresswomen, One Redrawn Georgia District",
    "sentiment": "0.0"
  },
  {
    "id": 8527,
    "mediaId": 157,
    "date": "5/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Sarah K. Burris",
    "title": "Georgia Republicans rejected Trump  not just his lies: columnist",
    "sentiment": "-0.73"
  }
]