[
  {
    "id": 2946,
    "mediaId": 129,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "George Erwin, a retired county sheriff who organized a group of law enforcement officials to endorse Mr. Cawthorn in 2020, said he no longer backed him, in part because of his actions around Jan. 6.\nThe words that come out of his mouth incite people,'' said Mr. Erwin, who is now supporting a Cawthorn challenger, <span class='selected-term'>Rod Honeycutt</span>, a retired Army colonel.",
    "author": "",
    "title": "House Republicans Tire of Madison Cawthorn's Antics. Some in His District Have, Too."
  },
  {
    "id": 2953,
    "mediaId": 33,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Cawthorn is facing a number of GOP candidates including Edwards, Woodhouse, Bruce O'Connell, <span class='selected-term'>Rod Honeycutt</span>, Matthew Burril and Wendy Nevarez.",
    "author": "Melanie Zanona, Manu Raju and Alex Rogers",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 2945,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Ahead of the Tar Heel State's May 17 primary, Cawthorn is facing a number of opponents, including: state Sen. Chuck Edwards, whom Tillis said he is endorsing; Michele Woodhouse, a self-described \"business-woman and political activist\"; Bruce O'Connell, a hotel and restaurant operator; <span class='selected-term'>Rod Honeycutt</span>, a retired US Army colonel; Matthew Burril, a businessman and local economic leader; and Wendy Nevarez, a Navy veteran.",
    "author": "Rachel Janfaza",
    "title": "Who is Madison Cawthorn, the freshman congressman causing headline chaos for the GOP?"
  },
  {
    "id": 3259,
    "mediaId": 238,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "Erwin is now supporting a primary rival, <span class='selected-term'>Rod Honeycutt</span>.",
    "author": "",
    "title": "Inside the Republican campaign to take down Madison Cawthorn"
  },
  {
    "id": 3442,
    "mediaId": 195,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "GOP candidates for the seat also include <span class='selected-term'>Rod Honeycutt</span>, Michele Woodhouse, Matthew Burril, Wendy Navarez, Bruce O'Connell and Kristie Sluder.",
    "author": "",
    "title": "Madison Cawthorn faces primary voters on Tuesday"
  }
]