{
  "id": 15518,
  "mediaId": 8497,
  "date": "2022-03-09",
  "headline": "Commitment 2022: Josh Mandel campaigning for US Senate",
  "image": "https://kubrick.htvapps.com/vidthumb/956a033b-5762-4aca-add9-e77b0474aa37/956a033b-5762-4aca-add9-e77b0474aa37_image.jpg?crop=0.752xw:0.751xh;0.186xw,0.00290xh&resize=1200:*",
  "link": "https://www.wlwt.com/article/josh-mandel-campaigning-for-us-senate/39389656",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John London",
  "authorUrl": "https://www.wlwt.com/news-team/0e331c55-fcf7-4f86-b314-3917d61a0129",
  "termIds": [
    0
  ],
  "sentences": [
    "\"As a citizen, as a taxpayer, as a father, as a Marine Corps vet, it is scary to have a commander-in-chief who is so lost in that office,\" he told WLW Radio talk show host Bill Cunningham.",
    "\"I'll take on these squishy, establishment RINO Republicans and I'll be the worst nightmare of the never Trumpers in Washington,\" he said with relish during an interview the other day.",
    "At a roundtable of pastors at the Life Change Church in Milford, he stated, \"I'm not going there to make friends, I'm not going there to get invited to the cocktail parties.",
    "\"I believe in my heart, in my head, in my gut that if we're going to save this country it's not going to be done in political offices,\" he told us with firm conviction.",
    "He views media as being infatuated with words, saying he's infatuated with action and that once in Washington he's going to be a wrecking ball to the establishment.",
    "So, while all these folks were with Kasich till the bitter end in the Presidential race, I was the first statewide official in Ohio to support President Trump.",
    "Matt Dolan serves in the Statehouse and Josh Mandel was the Ohio treasurer for eight years after his own stint as a state representative.",
    "He wants Ohio's Trump base to know his disgust for President Joe Biden and left-wing Democrats extend to some in his own party.",
    "I'm gonna go there to stand up for the Constitution, for Biblical values, and for the Trump America First agenda,\" Mandel said.",
    "In radio interview that day, Mandel claimed America had not only lost control of the border, but energy independence as well.",
    "COLUMBUS, Ohio —\nOf the five candidates in Ohio's Republican Senate primary, only two have held elected office.",
    "\"It's going to be done in houses of worship, at kitchen tables, and in barns throughout this country.\"",
    "He, like the others, is hoping to attract the 25% or so of the undecided Republican primary voters.",
    "He also took a verbal shot at Jane Timken, the former state party chair who is also in the race.",
    "For the bruising battle in the GOP Senate primary, his political posture is combat-ready.",
    "Mandel is not running his campaign through the usual party events, but through churches.",
    "\"I got one guy running against me, J. D. Vance, who was a never-Trumper,\" Mandel said.",
    "Recent polling shows a tightening race as businessman Mike Gibbons becomes more known.",
    "He described himself as the most conservative, pro-Trump Republican in the race.",
    "I've been full-throated and unwavering in my support for Trump,\" Mandel said.",
    "And you won't find the separation of church of state on his list of beliefs.",
    "\"And whether I'm pissin' off Democrats, Republicans, media, I don't care.",
    "Any hostility that is directed his way becomes a badge of honor to him.",
    "I'm going there to stand up for the Constitution and the Bible.",
    "Mandel has consistently been at or near the top in polling.",
    "As a marine, Mandel also served two tours of duty in Iraq.",
    "\"She defended the Congressman who voted to impeach Trump.",
    "He bragged about voting for Hillary Clinton over Trump.",
    "Mandel said Trump's policies were great for Ohio.",
    "And this guy is running as a Republican.\"",
    "Mandel is a Forever Trumper, if you will.",
    "\"He bragged about being a never-Trumper.",
    "You can't make this stuff up.",
    "That's it.\""
  ]
}