{
  "id": 1687,
  "mediaId": 2702,
  "date": "2022-02-18",
  "headline": "Ohio’s Jane Timken hits male rivals ‘who overcompensate for their inadequacies’",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2021/02/timkenjane_021821youtube.jpg?w=1280",
  "link": "https://thehill.com/homenews/campaign/594914-ohios-jane-timken-hits-male-rivals-who-compensate-for-their-inadequacies/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    0
  ],
  "sentences": [
    "Ohio Republican Senate candidate Jane Timken hit her male primary rivals in a new ad released on Friday, touting her support for former President Trump while accusing the other challengers of being like men who “overcompensate.”\n“We all know guys who overcompensate for their inadequacies, and that description fits the guys in the Senate race to a tee,” Timken said in the ad, standing beside photos of fellow primary contenders Mike Gibbons, J.D.",
    "“As your GOP chairman, I turned Ohio into Trump country, and as your next senator I’ll fight for stronger borders, America jobs, and parents’ rights,” she continued, describing herself as “Trump tough” and “America first.”\nTimken, Mandel, Vance and Gibbons are all openly vying for Trump’s endorsement — and getting blowback from competitors over claims of closeness to Trump.",
    "A survey conducted earlier this month by the Trafalgar Group, a Republican polling firm, found former state Treasurer Josh Mandel (R) leading the field with 21 percent of support.",
    "While Timken’s campaign has touted a number of internal polls showing her gaining traction in the crowded primary field, other recent polls show her trailing her primary rivals.",
    "Portman’s endorsement could very well help sway undecided Republican voters; however, it’s Trump’s endorsement that could help lock in a nomination.",
    "That has particularly been true for Vance, who was extremely critical of the former president during his 2016 presidential campaign.",
    "I’m the MAGA conservative with a backbone,” she said, as she knocked down Mandel’s photo to reveal a picture of her and Trump.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Timken’s campaign raised $250,000 in the 24 hours after Portman formally gave his support to her.",
    "Portman’s support is expected to elevate Timken in fundraising and potentially in the polls.",
    "Timken and state Sen. Matt Dolan (R) were tied at about 10 percent, according to the poll.",
    "Businessman Mike Gibbons (R) took 16 percent, and author and venture capitalist J.D.",
    "Rob Portman’s (R-Ohio) endorsement of Timken as his successor.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "And another 25 percent said they were still undecided.",
    "The 30-second spot comes on the heels of retiring Sen.",
    "Vance took 14 percent.",
    "Vance and Josh Mandel.",
    "“Well, I’m different."
  ]
}