{
  "id": 395,
  "mediaId": 8379,
  "date": "2022-02-20",
  "headline": "The Spectrum: Sen. candidate Matt Dolan; Portman on successor",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2021/07/snapshot-2.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/the-spectrum/the-spectrum-sen-candidate-matt-dolan-portman-on-successor/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Colleen Marshall",
  "authorUrl": "https://www.nbc4i.com/author/colleen-marshall/",
  "termIds": [
    0
  ],
  "sentences": [
    "Republican strategist Mark Weaver and former chief of staff for the Ohio House Democrats Keary McCarthy join the roundtable to talk about the situation in the Ukraine and Sen. Portman’s choice for his replacement.",
    "The state teachers’ retirement system is the target of a special audit from the Ohio auditor’s office as tens of thousands of retirees demand to know what happened to their “guaranteed” cost of living adjustment.",
    "The retiring Senator is making the most of his last months in office, working to deescalate tensions in Ukraine, and delivering a message to the Russian president.",
    "“I would like to be succeeded by someone who shares my view that you get elected to the Senate to get things done for the people of Ohio,” Portman said.",
    "Matt Dolan, a sitting state Senator and part-owner of the Cleveland Guardians, discusses his lucrative campaign and getting some major endorsements.",
    "Rob Portman could choose his replacement, he’d pick another underdog in the race – former Ohio Republican Party Chairperson Jane Timken.",
    "“I’m the only one with any experience in this race to say I’ve been fighting for Ohio,” he said.",
    "COLUMBUS, Ohio (WCMH) – This week on The Spectrum:\nIn a crowded Republican primary for U.S.",
    "“The candidate I’m most intrigued about is Dolan,” said Meet the Press host Chuck Todd.",
    "Senator, political experts said one candidate is standing out.",
    "If Sen."
  ]
}