{
  "id": 5041,
  "mediaId": 2594,
  "date": "2022-04-23",
  "headline": "Trump's Oz, Vance endorsements bring cash windfall, backlash",
  "image": "https://static.independent.co.uk/2022/04/23/05/Election_2022_Trump_Endorsements_67031.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/ap-mehmet-oz-ohio-pennsylvania-trump-b2063801.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Via AP news wire",
  "authorUrl": "https://www.independent.co.uk/author/via-ap-news-wire",
  "termIds": [
    5660,
    5862,
    2290,
    2765,
    2335,
    4306,
    1126,
    6506
  ],
  "sentences": [
    "While allies concede Trump's announcement at 5 p.m. on Good Friday, less than three weeks before the May 3 primary election, may not have been the most desirable timing, the campaign nonetheless reports a 300% increase in online donations — a majority from new donors — including $20,000 raised online and $30,000 by bundlers that Friday alone.",
    "It was an acknowledgement of the fact that Trump's endorsement of a man who has little history with the Republican Party — not to mention Pennsylvania, after living in New Jersey for the past two decades — has roiled party activists who aren't sold on Oz and believe that he is insufficiently conservative on issues like guns and abortion.",
    "Ohio strategists and rival campaigns had long conceded an endorsement from Trump, who remains deeply popular with Republican voters despite his 2020 election defeat and his role in inciting the Jan. 6 Capitol insurrection, was likely to push any candidate to the front of the pack.",
    "\"Mr. President, there are a lot of voters who are passionate about you who have said that they’re coming out to see me because of your endorsement,\" Oz said, before asking Trump if he would “mind easing people’s fears” by vouching for Oz's conservative credentials.",
    "The week following Trump’s endorsement was the best digital fundraising week for Oz since his campaign launched late last year, with the campaign bringing in nearly three times as much money as it had the week before, said campaign manager Casey Contres.",
    "“I was kind of confused on who to vote for.”\nBut at a Mandel event near Cleveland on Thursday, Jeanine Hammack, the campaign chair for the Strongsville Republican Party, said Trump’s endorsement will “not at all” influence her vote.",
    "They have instead continued to run anti-Vance ads, drawing anger, in particular, from Trump's eldest son, Donald Trump Jr., who has been campaigning for Vance and is set to return to the state Monday for a full day of events.",
    "He said that could open up a path to victory for former state GOP chair Jane Timken or even moderate state Sen. Matt Dolan, the one candidate in the race who has not promised to support Trump and his positions if elected.",
    "While some county party officials said the endorsement had no further divided Republicans than they had been already, given the seven-candidate primary field, some county party officials reported a tide of angry calls.",
    "Trump has called on his supporters to rally around Vance, but Vance's chief rivals, including the Trump-aligned Club for Growth, which supports former state treasurer Josh Mandel, have so far refused to stand down.",
    "But the endorsements have also provoked backlash from some Republicans who believe Trump has betrayed his core supporters by backing “Hillbilly Elegy” author JD Vance in Ohio and TV’s Dr. Mehmet Oz in Pennsylvania.",
    "“The conservative Trumpers are very upset over his endorsement, and they cannot understand it,” said Arnold McClure, the Republican Party chair in rural Huntingdon County, where Trump won 75% of the vote in 2020.",
    "Former President Donald Trump’s late endorsements in hypercompetitive Republican Senate primaries in Ohio and Pennsylvania have unlocked a flood of support for his chosen candidates, including millions in cash.",
    "“The Trump era is over in Pennsylvania because of his endorsement of Dr. Oz.”\nColvin reported from New York and Levy from Harrisburg, Pa. AP video journalist Patrick Orsagos in Ohio contributed to this report.",
    "Zawistowski, the tea party leader, warned the endorsement could wind up splitting Trump’s base of support in the state primary three ways among Vance, Mandel and Cleveland banker Mike Gibbons.",
    "It’s unclear whether Trump’s support will pull Vance and Oz across the finish line in races that will serve as key early tests of the former president’s clout in this year’s midterm elections.",
    "“For him to endorse JD Vance really seemed like President Trump was out of touch with what’s going on in Ohio and what his supporters here want,” said Tom Zawistowski, a leader of the group.",
    "The group, in statement, said that Trump had made a “terrible decision” and that those who decide to attend should let Trump know Vance is “wrong for Ohio” by booing when he takes the stage.",
    "And we’re going to go all out on that,\" said Luke Thompson, who runs the super PAC, which has found that Vance's support rises when voters are made aware that he is Trump's pick.",
    "But the endorsements pose a risk to Trump, who has staked his status as a GOP kingmaker on his ability to mobilize his supporters as he eyes another White House run in 2024.",
    "The blowback has included calls by a major conservative group aligned with a Vance rival to boycott the rally Trump is holding Saturday night to try to boost his candidate.",
    "But the endorsement has also sparked deep resentment from those backing Vance's rivals, who launched a furious, last-ditch effort last week to try to change Trump’s mind.",
    "Vance aides see the endorsement as particularly useful for their candidate given that the chief line of attack lodged against him has been his past criticism of Trump.",
    "Both candidates have been criticized for time spent outside their states and being insufficiently committed to the former president and his “America First” agenda.",
    "Some supporters concede that Oz could still lose the May 17 primary with Trump's backing, but argue he likely wouldn't have been able to win without it.",
    "In Pennsylvania, Oz is seeing a similar bump since Trump's surprise April 9 endorsement in his close race against former hedge fund CEO David McCormick.",
    "Both groups are using that money to air new ads trumpeting Trump's endorsement that they expect to run exclusively through the rest of the campaign.",
    "Trump assured listeners that the doctor was the only candidate who has his support and the only one he believes can win the general election.",
    "Always will,” she said, adding that she's sure the former president “has his reasons” for picking Vance, but that she knows Mandel better.",
    "Joe Kildea, a Club for Growth spokesperson, said the group will increase its spending in the coming days to air even more anti-Vance ads.",
    "That includes a $3.5 million check from venture capitalist Peter Thiel, who had previously given $10 million, Politico first reported.",
    "Linda Davidson, a retired financial consultant from Kirtland, said Trump’s endorsement “very much” crystallized her vote for Vance.",
    "In Ohio, Trump's endorsement has been a major boon to Vance, who had been trailing in the polls before Trump’s intervention.",
    "Ohio Value Voters, a conservative group that has also endorsed Mandel, has called for a boycott of Trump’s Saturday rally.",
    "His team has shifted its ad strategy for television and digital pitches to focus on the former president’s announcement.",
    "“It is a game changer,\" said John Fredericks, a talk radio host who had urged Trump to back the celebrity doctor.",
    "Oz acknowledged the impact during a virtual town hall Trump held Friday night to rally support for his candidate.",
    "Protect Ohio Values, the super PAC supporting Vance, says it has brought in $5 million since Trump's endorsement.",
    "The state’s tea party movement, which overwhelmingly supports Trump, is also planning a protest outside.",
    "I couldn’t decide,” she said after an event in the Cleveland suburb of Independence on Wednesday.",
    "“Trump's endorsement has given people a chance to stop and think and go, ‘Wait a minute.",
    "And now I'm going to take a second look,'\" Fredericks said.",
    "I’ve seen this guy on TV helping people for 30 years.",
    "“We want to make sure 100% of people know about it.",
    "So far, some voters are siding with Trump.",
    "“I was actually waiting.",
    "Trump sees it, too.",
    "“We love Trump."
  ]
}