{
  "id": 5447,
  "mediaId": 2562,
  "date": "2022-04-21",
  "headline": "Ohio Poll: Vance Jumps to 7-Point Lead in Senate GOP Primary",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid374BDDC2-9C9C-413B-812A-271B052DD69B.jpg",
  "link": "https://donaldjtrumppolls.com/ohio-poll-vance-jumps-to-7-point-lead-in-senate-gop-primary/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "Ohio Poll: Vance Jumps to 7-Point Lead in Senate GOP Primary (Newsmax Ohio Town Hall)\nBy Eric Mack | Thursday, 21 April 2022 03:48 PM\nIf anyone was wondering what an endorsement from former President Donald Trump can do, we might have found out in the latest Fabrizio, Lee & Associates poll released Thursday.",
    "Notably only 53% of likely GOP primary voters were aware of Trump's endorsement of Vance at the time they responded to their above choice, and Vance had a 19-point lead among voters who were aware of the Trump endorsement.",
    "He's strong on the border, tough on crime, understands how to use taxes and tariffs to hold China accountable, will fight to break up Big Tech, and has been a warrior on the rigged and stolen presidential election.\"",
    "is the most likely to take out the weak, but dangerous, Democrat opponent — dangerous because they will have so much money to spend,\" Trump wrote in a statement from his Save America PAC last week.",
    "\"One of the things he told me is that very often it wasn't the people who were on board from the beginning, it's the converts who are actually the best defenders of his agenda.\"",
    "Establishment Ohio Republicans sought to block Trump's endorsement in the race, but Trump did not back down and even chose Vance, who had been critical of Trump in the past.",
    "\"I've been very open about this fact that I was not a Donald Trump guy in 2016,\" Vance told Schmitt at Ohio Wesleyan University's Chappelear Drama Center in Delaware, Ohio.",
    "\"The endorsement clearly played a role in this improvement, as Vance leads by 19 points among those aware he was endorsed by Donald Trump,\" according to the poll analysis.",
    "When those polled were made fully aware Trump endorsed Vance, Vance's lead spiked to 23 points, which is even greater than the remaining undecided voters:\nVance 37%.",
    "In a Newsmax exclusive town hall Wednesday, skipped by his opponents, Vance told moderator Rob Schmitt he learned his early criticism of Trump was unfounded.",
    "Vance's support in Ohio Senate GOP primary polling shot up from a dead heat at 18% with Josh Mandel and Mike Gibbons to a 7-point lead over the field.",
    "Fabrizio, Lee & Associates conducted the poll April 18-19 among 800 likely Ohio Republican primary voters.",
    "\"The tape is there, and I think I owe it to the voters to just be honest: I was not a Trump guy.\"",
    "Now, Vance is well in control before the May 3 GOP primary:\nVance 25% (18% in March).",
    "will destroy him in the debates and will fight for the MAGA Movement in the Senate.",
    "Before Trump officially endorsed Vance, the three leaders were knotted up at 18%.",
    "\"I'm proud to have the [former] president's support,\" Vance added.",
    "The margin of error was plus or minus 3.46 percentage points.",
    "\"I've studied this race closely and I think J.D.",
    "Jane Timken – 11% (9%).",
    "Matt Dolan – 9% (9%).",
    "Gibbons 13% (18%).",
    "Mandel 18% (18%).",
    "Undecided 21%.",
    "\"However, J.D.",
    "Mandel 14%.",
    "Gibbons 9%.",
    "Timken 8%.",
    "Other 2%.",
    "Dolan 9%."
  ]
}