{
  "id": 8850,
  "mediaId": 8323,
  "date": "2022-04-07",
  "headline": "Jane Timken campaign ad filmed at local high school raises controversy",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/04/4E9A57A6F3C716114059836AD5DFF7AF_4.jpg?w=1280",
  "link": "https://fox8.com/news/jane-timken-campaign-ad-filmed-at-local-high-school-raises-controversy/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Stokes",
  "authorUrl": "https://fox8.com/author/alex-stokes/",
  "termIds": [
    0
  ],
  "sentences": [
    "The rental of our facilities is a business transaction and should not be interpreted as an endorsement of political candidates, organizations or their beliefs or platform.”\n“We don’t know whether it’s violating a law, but we feel like it should be violating a policy and if it’s not violating a policy, we need to make that policy more stringent,” said Hollis.",
    "As a college athlete, mom to a daughter and Ohio next senator, Jane will always protect opportunities for women that are under attack.”\nThe district’s superintendent sent us a statement saying:\n“At North Canton City Schools, we value and respect each student, which is reflected in our district values of relationships, respect, and integrity.",
    "Ash Barros, a transgender student and one of the heads of the school’s Gay-Straight Alliance, told us what bothered them was that the ad could have “very easily” been taken as a stand against the transgender community.",
    "“I think what ultimately pushed us over the edge was when they just flat out said we don’t feel safe in our classes because we’re going to school with the same kids who faces were used in this hatred,” she said.",
    "NORTH CANTON, Ohio (WJW) – A campaign ad released by U.S. Senate candidate Jane Timken filmed at the Hoover High School gym is causing controversy in the North Canton City School District.",
    "North Canton City Schools does have a policy that the premise can be made available to political candidates but only during non-school hours.",
    "A spokesperson for Timken’s campaign released a statement saying:\n“This is about standing up for fundamental fairness in girls’ sports.",
    "The fact the district allowed it to be filmed at the school was “very heartbreaking” to many students who see school as a safe space.",
    "Per an invoice, the ad was filmed Tuesday, March 8 and Timken’s campaign confirmed it was filmed from 10 a.m. to 1:30 p.m.",
    "The next board meeting is scheduled for April 13 and Hollis believes people in the community will bring the issue up.",
    "The ad is critical of NCAA rules that allow transgender women to compete in women’s college sports.",
    "I mean, all of our kids deserve to feel safe and they don’t,” said parent Laura Hollis.",
    "Hollis said that several students reached out expressing fear.",
    "“It really just comes down to protecting mental health."
  ]
}