{
  "id": 9105,
  "mediaId": 2520,
  "date": "2022-03-28",
  "headline": "Ohio Senate race: What to know about JD Vance, venture capitalist running for office",
  "image": "https://www.gannett-cdn.com/presto/2021/08/11/USAT/ef576372-cc39-40b3-ba97-0e2da1619642-AP_Senate_2022-Ohio-Vance.jpg?crop=2399,1349,x0,y164&width=2399&height=1349&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/03/28/midterms-2022-jd-vance-senate-candidate-ohio/7042631001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Orlando Mayorquin",
  "authorUrl": "https://www.usatoday.com/staff/6610183001/orlando-mayorquin/",
  "termIds": [
    4306,
    5660,
    3639,
    980,
    1489,
    6474,
    6175
  ],
  "sentences": [
    "Vance burst onto the political media scene in 2016 when his memoir, \"Hillbilly Elegy,\" about growing up in a small Midwest town made him a media voice of the white working-class during the 2016 presidential election.",
    "Vance has been backed by billionaire investor Peter Thiel – who donated $10 million to a Super PAC supporting Vance – Republican Sen. Josh Hawley, R-Mo., and Georgia congresswoman Marjorie Taylor Greene.",
    "Vance has been backed by billionaire investor Peter Thiel – who donated $10 million to a Super PAC supporting Vance – Republican Sen. Josh Hawley, R-Mo., and Georgia congresswoman Marjorie Taylor Greene.",
    "Vance says he will support cutting funding to universities that teach critical race theory or “radical gender ideology” and break up big tech companies, which Vance says censor conservatives.",
    "According to his campaign, Vance would oppose amnesty for undocumented migrants in the United States and favor a more stringent merit-based immigration system than is in place already.",
    "She clerked for Supreme Court Chief Justice John Roberts from 2017 to 2018 and for Supreme Court Justice Brett Kavanaugh from 2014 to 2015, when Kavanaugh was a federal district judge.",
    "Vance made headlines in February when he said “I don’t really care what happens to Ukraine one way or another,” on Steve Bannon’s podcast, just days before Putin launched his invasion.",
    "Vance’s real claim to fame is his career as a conservative commentator, which was ignited by the success of his 2016 memoir, “Hillbilly Elegy,” a New York Times bestseller.",
    "He got his start in the venture capital world at Mithril Capital, an investment firm co-founded by Thiel, a Republican super-donor who was an early investor in Facebook.",
    "According to the report, Vance earned more than $1 million in non-investment income, including a $408,000 salary from Nayra and $347,000 in royalties from his memoir.",
    "Among them are former Ohio Republican Party chair Jane Timken, Ohio State Sen. Matt Dolan, Cleveland businessman Mike Gibbons and former Ohio treasurer Josh Mandel.",
    "Online reports show varying and unconfirmed figures for Vance’s net worth, but his Senate financial disclosure provides some insight into his wealth and earnings.",
    "One of the most prominent Republican names is JD Vance, a venture capitalist and conservative commentator who appears regularly on Tucker Carlson’s Fox News show.",
    "His campaign website features a pop-up window with the message “Secure our Southern Border and NOT Ukraine’s border!” ?— a message he has repeated on Twitter.",
    "But Vance’s real claim to fame is his career as a conservative commentator, which was ignited by the success of his 2016 memoir, a New York Times bestseller.",
    "Vance earned a law degree from Yale Law School in 2013 after graduating from Ohio State University with a degree in political science and philosophy in 2009.",
    "Vance also opposes abortion, favors gun rights, and supports further voting requirements such as showing your ID to vote and ending expanded mail-in voting.",
    "Just weeks before the primary election, Vance won the heated competition between most of the GOP candidates for former President Donald Trump’s endorsement.",
    "It details his rocky childhood in Middletown, Ohio and joining the Marines before pursuing an education at Ohio State University and Yale Law School.",
    "Vance is a venture capitalist who runs Narya, an Ohio-based venture capital firm he founded and launched in 2020 for startups around the country.",
    "A long list of Republican and Democratic candidates that includes businessmen, attorneys and seasoned politicians is competing for Ohio’s vote.",
    "He is a venture capitalist who runs Narya, an Ohio-based venture capital firm he founded and launched in 2020 for startups around the country.",
    "Having never held public office, he has leaned into his status as an “outsider,” branding himself as the anti-establishment candidate.",
    "His platform suggests raising taxes on large corporations that do business overseas while cutting taxes for small American businesses.",
    "Vance worked briefly as a lawyer for Sidley Austin, an Illinois-based firm, before he pursued an investing career in Silicon Valley.",
    "Congressional guidelines allow candidates and lawmakers to report their wealth using wide ranges rather than specific values.",
    "Vance was born and raised in Middletown, Ohio, a small town of less than 50,000 residents near Cincinnati and Dayton.",
    "He became a vocal supporter of Trump, despite criticizing him before the election, and remains a network TV regular.",
    "Vance said he thought Joe Biden should focus on border security at the U.S.-Mexico border, and not Ukraine’s border.",
    "His campaign released a controversial TV ad that opens with Vance sarcastically asking viewers \"Are you a racist?",
    "Do you hate Mexicans,\" before decrying the press, which Vance says calls supporters of Trump's wall racist.",
    "Other promises involve some of the hot-button conservative issues that have taken shape in the Biden era.",
    "The report lists more than 100 investments with their total value ranging from $4 million to $10 million.",
    "He has kept his political celebrity, amassing close to 200,000 followers on Twitter in the time since.",
    "The main economic issues include revitalizing American manufacturing and addressing inflation.",
    "Vance wants to finish building Trump’s wall and increase the number of Border Patrol agents.",
    ":What to know about the ex-Ohio state treasurer in his third Senate run\nWho is JD Vance?",
    "Cable news shows frequently booked Vance for appearances during the 2016 election.",
    "Vance has held top positions in venture capital funds, including Revolution LLC.",
    "The Ohio race for retiring Republican Senator Rob Portman’s seat is crowded.",
    "Vance married a fellow Yale Law School classmate, Usha Chilukuri Vance.",
    "Vance doubled down on this sentiment as the war in Ukraine broke out.",
    "There are eight candidates in the Republican primary including Vance.",
    "Chilukuri is a lawyer at Munger, Tolles & Olson, a private law firm.",
    "Vance joined the Marines in 2003 after graduating from high school.",
    "He served in the Iraq War, working in public affairs for the Corps.",
    "Vance is based in Cincinnati, according to his Twitter profile.",
    "The book was made into a 2020 Netflix film starring Amy Adams.",
    "Vance and Chilukuri have two children together.",
    "Vance was discharged from the Marines in 2007.",
    "Portman endorsed Timken to be his successor.",
    "Vance’s campaign outlines thirteen issues.",
    "Another of his key issues is immigration.",
    "Yes, \"Hillbilly Elegy\" is Vance’s memoir.",
    "What are JD Vance’s views on Ukraine?",
    "Is 'Hillbilly Elegy' about JD Vance?",
    "Vance was born on August 2, 1984.",
    "Who is JD Vance running against?",
    "What is JD Vance's net worth?",
    "What is JD Vance’s platform?",
    "Where does JD Vance live?",
    "Where is JD Vance from?",
    "Vance has a few titles.",
    "Who is JD Vance’s wife?",
    "Was JD Vance a Marine?",
    "Is JD Vance a lawyer?",
    "How old is JD Vance?",
    "Who is Josh Mandel?",
    "He is 37 years old."
  ]
}