{
  "id": 998,
  "mediaId": 8491,
  "date": "2022-02-16",
  "headline": "U.S. Senator Rob Portman endorses Jane Timken to fill his seat",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/02/Jane-Timpken.jpg?w=1280",
  "link": "https://www.wkbn.com/news/ohio/u-s-senator-rob-portman-endorses-jane-timken-to-fill-his-seat/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Talia Naquin",
  "authorUrl": "",
  "termIds": [
    5581,
    2736,
    1489,
    976,
    1126,
    6474,
    6060
  ],
  "sentences": [
    "“We live in an increasingly polarized country where members of both parties are being pushed further to the right and further to the left, and that means too few people who are actively looking to find common ground,” he said in his announcement at the time.",
    "“Rob successfully led the effort to pass President Trump’s tax cuts, is the leader in the U.S. Senate in fighting the opioid epidemic and has consistently delivered results for Ohio on issue after issue.",
    "“She led the effort as Ohio Republican Party chair to elect Republicans to all statewide constitutional offices in 2018, and to win Ohio by 8 points for President Trump in 2020,” Portman said of Timken.",
    "He is a champion for the unborn, a protector of our 2nd Amendment rights, and worked with President Trump to advance three conservative justices to the U.S. Supreme Court,” Timken said in a statement.",
    "I believe Ohioans would be proud to have her representing us in the United States Senate,” Sen. Portman said in a press release.",
    "“I believe Jane Timken is the best candidate to advance conservative Republican policies to help Ohio workers and families.",
    "Senator Rob Portman announced Wednesday he is endorsing Jane Timken in the U.S. Senate race to fill his seat.",
    "Both Portman and Timken referenced their work for former President Donald Trump Wednesday.",
    "Jane is smart and hardworking and understands the needs of Ohioans.",
    "Portman announced he would not seek re-election in early 2021.",
    "More than a dozen candidates are running for the seat.",
    "The primary is scheduled for May 3, 2022.",
    "CINCINNATI, Ohio (WJW) – U.S."
  ]
}