{
  "id": 10376,
  "mediaId": 8480,
  "date": "2022-03-29",
  "headline": "Two former Southwest Ohio mayors face off in gubernatorial Democratic primary debate",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/3.png?w=1280",
  "link": "https://www.wdtn.com/news/your-local-election-hq/two-former-southwest-ohio-mayors-face-off-in-gubernatorial-democratic-primary-debate/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Morse",
  "authorUrl": "https://www.wdtn.com/author/caroline-morse/",
  "termIds": [
    2605,
    2143,
    3346,
    6474,
    6104,
    6061
  ],
  "sentences": [
    "“I’m the candidate that can bring people together and get things done for our families in Ohio.”\nWith gas prices still on the rise, Cranley said he will stand up for Ohioans and place a temporary pause on gas taxes.",
    "“Mike DeWine raised gas taxes and refuses to budge even in this extreme inflation.”\nBoth candidates said Ohio is at the breaking point recovering from the pandemic and it’s time to bring Ohio together.",
    "“Our communities are now less safe because of extreme radical agenda items like stand your ground and permitless conceal carry which makes our police officers less safe,” said candidate Nan Whaley.",
    "“I believe Ohio deserves better, I’ll make sure your pay goes up, your bills go down and you’ll finally have a state government that’s working for you,” said candidate Whaley.",
    "Former Dayton Mayor Nan Whaley and former Cincinnati Mayor John Cranley debated Tuesday night to persuade audience members they should move ahead in Ohio’s race for governor.",
    "“Bringing 500 mayors from over 50 states of both parties to say we need to have broadband, roads and bridges for our communities,” said candidate Whaley.",
    "As the president of the Mayor’s Conference, Whaley said she brought leaders from both political parties together to ensure Ohio’s families come first.",
    "“As mayor of Cincinnati, I helped lead the only comeback of a major city in Ohio where growth is up and we’ll do the same,” said candidate Cranley.",
    "Both candidates said their leadership as mayors for nearly a decade puts them in the perfect place to be Ohio’s next chief executive of the state.",
    "“Mike DeWine made it worse by signing that outrageous bill as well as stand your ground is a stain on his soul,” said candidate John Cranley.",
    "Two former Southwest Ohio mayors faced off Tuesday night in the state’s gubernatorial Democratic primary debate held at Central State.",
    "“See, we believe in helping the middle class and raising their incomes and not robbing from them,” said candidate Cranley.",
    "Plus, he promises to start an annual energy dividend of $500 for families making less than $75,000 a year.",
    "Mike DeWine declined to participate and other candidates decided to follow suit.",
    "One of the few topics the candidates agreed on was addressing gun violence.",
    "A debate among republicans running for Ohio governor is off after Gov.",
    "WILBERFORCE, Ohio (WDTN) – The race to Ohio’s primary is heating up."
  ]
}