{
  "id": 10396,
  "mediaId": 8276,
  "date": "2022-03-30",
  "headline": "Abortion, gun policy, gas tax: Democrats Nan Whaley, John Cranley debate for 1st time",
  "image": "https://www.gannett-cdn.com/presto/2022/03/30/PCIN/116a3841-31f4-4dba-bbd5-3db9fc8147aa-03292022_GovDemDebate_MV_0047.JPG?crop=2999,1687,x0,y0&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/politics/elections/2022/03/29/ohio-election-governor-democrats-nan-whaley-john-cranley-debate/9458814002/",
  "mediaOutlet": "bucyrustelegraphforum.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    3346,
    2143,
    2605,
    1126,
    259,
    392
  ],
  "sentences": [
    "\"And while I'm very excited that Mayor Cranley has joined us in allyship in fighting for a woman's right to an abortion, this is too important when Roe is about to fall to have someone in the governor's seat that just decided a few months before he announced for governor that he was pro-choice.\"",
    "Qualified immunity\nBoth candidates were asked whether they would sign an executive order to end qualified immunity, a legal principle that shields government officials such as police officers accused of violating constitutional rights.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "Gun policy\nWhaley chastised DeWine for not implementing gun reforms that he promised after nine people were killed and 27 were injured in a mass shooting in Dayton's Oregon District in 2019.",
    "LGBTQ rights\nWhaley incorrectly stated that Dayton was the first city in the state to ban conversion therapy, the attempt to change someone's sexual orientation or gender expression.",
    "\"This primary is about one thing: who is best to beat Mike DeWine,\" former Cincinnati Mayor John Cranley said in the first gubernatorial debate with former Dayton Mayor Nan Whaley.",
    "Cranley said he would not sign an order to end qualified immunity, but he would support licensing police officers, reforming use of force and adding body cameras across the state.",
    "\"He got FirstEnergy to fund his campaign and in return he gave them everything they wanted, including a $1 billion bailout we're paying every single month on our electric bill.\"",
    "Instead, she talked about an \"alternative response model\" in Dayton that might send medical care or mental health professionals to a scene rather than a police officer.",
    "\"I thought, according to Mr. Seelbach, my former colleague that we were the first city to ban conversion therapy, but I'm glad we both did it,\" Cranley said.",
    "Gas tax\nCranley joined DeWine's Republican challengers in calling for the governor to reduce Ohio's gas tax, at least temporarily, to offset high gas prices.",
    "Statute of limitations on rape\nBoth Democrats agreed that the statute of limitations on rape, which is between 20 and 25 years, should be eliminated.",
    "Whaley has sweeped up endorsements from proponents of abortion access, including Planned Parenthood Advocates of Ohio and Pro-Choice Ohio.",
    "\"During that process, it became obvious to me what my wife was already telling me that government had no role in reproductive decisions.\"",
    "\"This is just one of those things, again, that has not been addressed because there are not enough women in politics,\" Whaley said.",
    "He also emphasized the importance of supporting the transgender community, which \"is being demonized all across the country.\"",
    "Cranley cited the efforts of his running mate, state Sen. Teresa Fedor, to increase penalties for human trafficking victims.",
    "Cranley said he would \"absolutely\" reduce Ohio's gas tax to give drivers a break at the gas pumps – at least temporarily.",
    "Here are some of the topics discussed:\nAbortion\nWhaley's most prominent swipe at Cranley came on his record on abortion.",
    "State lawmakers did repeal fees for two nuclear plants but charges for coal plants and cuts to renewable energy remain.",
    "\"Never in my worst nightmare did I think that the thing he was going to do was to actually make it worse,\" she said.",
    "Mike DeWine ducked the Republican debate, but he was a near-constant presence in the Democratic one Tuesday night.",
    "The $200-a-day fine on violators was imposed in December 2015, led by Cincinnati City Councilman Chris Seelbach.",
    "Ohio's Republican-controlled Legislature has been wary of restrictions on fracking and that industry.",
    "Both are vying for the Democratic nomination and an opportunity to defeat the sitting GOP governor.",
    "They also went after corruption at the Ohio Statehouse stemming from a $1 billion nuclear bailout.",
    "Cranley also pushed his $500 annual energy dividend modeled off states such as Oklahoma and Texas.",
    "\"We also recognize that too often Black Ohioans are overpoliced, oversentenced and overcharged.\"",
    "Both agreed they would fight for universal background checks – a popular policy with Ohioans.",
    "When they weren't bashing DeWine, Democrats answered questions about their visions for Ohio.",
    "Whaley said Ohio's Legislature, dominated by men, had not addressed the issue adequately.",
    "Cranley agreed that DeWine's gun policies had been disastrous and \"a stain on his soul.\"",
    "The Democrats criticized DeWine's approach to COVID-19 as too weak to protect children.",
    "DeWine pushed for a 10.5 cents increase in 2019 and has defended it in recent months.",
    "\"Mike DeWine raised the gas tax, refuses to budge even in this extreme inflation.\"",
    "They faced off at the Ohio Debate Commission's event at Central State University.",
    "\"I'm the only candidate that has been pro-choice my entire career,\" Whaley said.",
    "Instead, DeWine signed policies such as stand your ground and permitless carry.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "In fact, Cincinnati was the first city to do so – a year and a half earlier.",
    "She recalled how Dayton mourners shouted for DeWine to \"do something.\"",
    "He said his opinion shifted during fertility decisions with his wife.",
    "\"Mike DeWine has been complicit in this whole piece,\" Whaley said.",
    "She fought to keep Dayton's sole surgical abortion clinic open.",
    "Cranley, who is Catholic, was anti-abortion for many years.",
    "Opponents of the policy say it protects police misconduct.",
    "Whaley didn't answer the question directly.",
    "Democrats have agreed to two more debates.",
    "WILBERFORCE – Gov."
  ]
}