{
  "id": 10511,
  "mediaId": 8299,
  "date": "2022-04-04",
  "headline": "Early voting begins for Ohio Primary",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/14/2022/04/web1_4.29-BOE-1.jpg",
  "link": "https://www.mydailysentinel.com/news/71328/early-voting-begins-for-ohio-primary",
  "mediaOutlet": "Daily Sentinel - United States - Ohio",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pomeroy Daily Sentinel",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "May (Rutland Village), Karen S. Williams (East Rutland), Beverly A. Davis (Salem), Yvonne H. Scalley (Middleport 2nd), Evelyn L. Bauer (Middleport 3rd), Philip M. Ohlinger (Pomeroy 1st), Rebecca J. Triplett (Pomeroy 2nd), Linda Mayer (Pomeroy 3rd), Ann M. Ohlinger (Rocksprings), Gregory D. Howard (Scipio);\nCentral Committee-Republican: Gene Romine (Bedford), David Shuler (East Chester), Darlene Newell (West Chester), Marco Jeffers (Columbia, David Shaver (Lebanon), Elizabeth M. Wolfe (Letart), Cheryl Gumpf (North Olive), William Osborne (South Olive), Eugene Triplett (Orange), Lorri Lightle (Rutland Village), Wilma Davidson (East Rutland), Steve Morris (West Rutland), Thomas P. Gannaway (Salem), Sandy Iannarelli (Middleport 2nd), Marilyn Anderson (Middleport 3rd), Judith Sisson (Pomeroy 1st), Vickki Hanson (Pomeroy 2nd), Bill Spaun (Pomeroy 3rd), Ed Durst (Bradbury), Wallace Hatfield (Rocksprings), Randy Butcher (Scipio), Robert Beegle (Racine Village), Kay Hill (Syracuse Village), Susan Turley (Minersville), Brett Jones (Racine);\nU.S. Senate: Matt Dolan (R), Mike Gibbons (R), Josh Mandel (R), Neil Patel (R), Mark Pukita (R), Jane Timken (R), JD Vance (R), Morgan Harper (D), Traci TJ Johnson (D), Tim Ryan (D);\nU.S. Represenative to Congress: James J. Condit Jr. (R), Brad Wenstrup (R), David J. Windisch (R), Alan Darnowsky (D), Samantha Meadows (D).",
    "Other offices and candidates in the primary will be:\nState Representative (1 seat): Jay Edwards (R), Rhyan Goodman (D);\nGovernor and Lieutenant Governor (1 seat): Joe Blystone and Jeremiah W. Workman (R), Mike DeWine and Jon Husted (R), Ron Hood and Candice Keller (R), Jim Renacci and Joe Knopp (R), John Cranley and Teresa Fedor (D), Nan Whaley and Cheryl L. Stephens (D);\nAttorney General (1 seat): David A Yost (R), Jeffrey A. Crossman (D);\nAuditor of State (1 seat): Keith Faber (R), Taylor Sappington (D);\nSecretary of State (1 seat): John Adams (R), Chelsea Clark (D);\nTreasurer of State (1 seat): Robert Sprague (R), Scott Schertzer (D);\nJudge of Court of Appeals-4th district (2 seats): Kristy Wilkin (R);\nChief Justice of Supreme Court (1 seat): Sharon L. Kennedy (R), Jennifer L. Brunner (D);\nJustice of Supreme Court (2 seats): Pat DeWine (R), Pat Fischer (R), Marilyn Zayas (D), Terri Jamison (D);\nCentral Committee-Democrat: Sonia M. Jennings (Bedford), Josephine Hill (East Chester), Paula J.",
    "Levies filed in Meigs County are as follows: Meigs County Historical Society operating and maintenance expenses – additional 0.5 mills, five years (All precincts); Columbia Township road maintenance – replacement 1.2 mills, five years (Columbia); Salisbury (unincorporated) cemeteries – additional 0.5 mills, 5 years (Bradbury, Laurel Cliff, Rocksprings); Scipio Township road maintenance – replacement 2 mills, five years (Scipio); Scipio Township fire protection – replacement 2 mills, five years (Scipio).",
    "Times for early voting are as follows: April 5-8; April 11-15; April 18-22: 8 a.m. – 5 p.m.; April 25-29: 8 a.m. – 7 p.m.; April 30 (Saturday): 8 a.m. – 4 p.m.; May 1 (Sunday): 1-5 p.m.; and May 2: 8 a.m. – 2 p.m.",
    "According to the Meigs County Board of Elections, there is one county commission seat and the county auditor seat up for election.",
    "Early, in-person voting will continue though May 2, including one Saturday on April 30, at the election board office.",
    "For Meigs County Commission, three people originally filed petitions for the seat currently held by Tim Ihle.",
    "Wood (West Chester), Mary J. Carter (Columbia), Sue Maison (North Olive), Jim Nally (Orange), Samuel B.",
    "For the county auditor, incumbent Mary T. Byer-Hill submitted the only petition for the office.",
    "There were no democratic petitions filed for the offices of county commissioner or auditor.",
    "BJ Smith-Kreseen, Zachary Manuel and Brandy Rankin submitted petitions for the seat.",
    "Voting on election day will be at specific polling locations throughout the county.",
    "MEIGS COUNTY — Early voting for the Primary Election in Ohio begins Tuesday.",
    "All early voting will take place at the board of elections.",
    "© 2022 Ohio Valley Publishing, all rights reserved.",
    "Rankin has since withdrawn her candidacy."
  ]
}