{
  "id": 11018,
  "mediaId": 3993,
  "date": "2022-03-16",
  "headline": "Democratic knives come out for DeWine after Constitutional Carry signed",
  "image": "https://media.townhall.com/townhall/reu/o/2022/75/dc08f02c-7799-4b53-acf5-f5c829a7bdc2-1110x740.jpg",
  "link": "https://bearingarms.com/camedwards/2022/03/16/democratic-knives-come-out-for-dewine-after-constitutional-carry-signed-n56473",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cam Edwards",
  "authorUrl": "https://bearingarms.com/author/camedwards",
  "termIds": [
    1991,
    2143,
    2605,
    3346,
    392,
    6474
  ],
  "sentences": [
    "Ohioans deserve far better than this — and that’s why I’m committed to defeating DeWine and delivering the accountable conservative leadership we desperately need.”\nIt’s true that DeWine hasn’t always been great on Second Amendment issues, and some gun owners (including me) have valid concerns over the governor’s STRONG Ohio initiative, but it’s also the case that DeWine told groups like the Buckeye Firearms Association that he would sign a constitutional carry bill if it got to his desk, and he stuck by his word.",
    "DeWine’s signing of Constitutional Carry should give him a boost when Ohio Republicans hold their primary on May 3rd, but as we’ve already seen, Democrats think they can make Constitutional Carry a campaign issue in the general election by resurrecting the same sky-is-falling rhetoric they unleashed almost 20 years ago when the state adopted “shall-issue” carry laws… though I imagine they’ll at least replace their references to Blockbuster with Redbox instead.",
    "Dayton Mayor Nan Whaley, for instance accused DeWine of breaking his promise to “do something to reduce gun violence,” claiming that the new Constitutional Carry law will “make everyone in our communities, including our police officers, less safe.”\nOf course, we heard the same claims from Ohioans 18 years ago, when the state legislature adopted “shall issue” concealed carry language.",
    "William & Mary University professor Carl Moody has also looked at what happens to crime rates after states adopt Constitutional Carry laws, and his analysis is that, contrary to the claims of Whaley and others, there is a “significant reduction of murder, no increase in violent crime, and no increase in deaths of police officers” once Constitutional Carry laws are in effect.",
    "While Whaley called DeWine’s signing of the legislation “shameless and disgraceful,” her Democratic primary opponent John Cranley took it one step further by claiming that the governor’s approval “stains Mike DeWine’s soul.”\nHeck, even some of DeWine’s primary opponents are going after him on the issue, though not because they’re opposed to Constitutional Carry.",
    "Ohio Governor Mike DeWine is getting praise from Second Amendment groups in the state after signing a Constitutional Carry bill into law earlier this week, but the Democrats vying to challenge him in this fall’s gubernatorial election are taking a far different stance, as you might expect.",
    "Polling in the Republican gubernatorial primary has been pretty scant, but one survey from early February showed DeWine with a healthy lead over Renacci and farmer Joe Blystone, who’s making his first run for office.",
    "He’d gleefully sign a bill trampling on the Second Amendment without skipping a beat, and Ohio gun owners are rightfully nervous about what a second DeWine term would mean for their freedoms.",
    "I remember hearing claims from anti-gun activists that “allowing” ordinary citizens to exercise their right to bear arms would lead to shootouts over parking spaces at Blockbuster Video.",
    "Former congressman Jim Renacci says that the only reason why DeWine approved the Constitutional Carry bill is because he’s worried about re-election.",
    "Given how many politicians go back on campaign promises, it’s notable when one of them actually follows through as DeWine has done.",
    "I would not have hesitated to sign this bill even for a moment, let alone view it as a ‘tough decision’ like DeWine did.",
    "Of course those fears were unfounded, and the right to carry has become quite popular in the state.",
    "Lord knows it’s easier to find a concealed carry holder than a Blockbuster store these days.",
    "Not that the facts are going to stop Democrats from trying to pummel DeWine over the bill.",
    "They’re trying to outdo themselves in their condemnation."
  ]
}