{
  "id": 11127,
  "mediaId": 2919,
  "date": "2022-03-08",
  "headline": "4 in-person debates for senator, governor to be held ahead of May primary",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/c4bb7d6/2147483647/strip/true/crop/1532x804+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Ff7%2F3e%2F2b036e5e4068b13843eb91bad972%2Fcentralstateuniversity.png",
  "link": "https://www.news5cleveland.com/news/election-2022/4-in-person-debates-for-senator-governor-to-be-held-ahead-of-may-primary",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Courtney Shaw",
  "authorUrl": "https://www.news5cleveland.com/courtney-shaw",
  "termIds": [
    1819,
    1991,
    2121,
    2290,
    2694,
    1489,
    259,
    6474
  ],
  "sentences": [
    "“These four professionals offer a great mix of experience across platforms, and from across our state.”\nIf you're interested in having a question asked during the debate, click here.",
    "“As a statewide collaborative, we’re committed to highlighting expertise and issues from around Ohio,” said Jill Zimon, Executive Director of the Ohio Debate Commission.",
    "The second debate will take place March 28 at 7 p.m., with Ohio Public Radio and TV Statehouse News Bureau Chief Karen Kasler serving as the moderator.",
    "The first debate will take place on March 28 from 11:30 a.m. until 12:30 p.m., with Spectrum News anchor Curtis Jackson serving as the moderator.",
    "The third debate will take place on March 29 from 11 a.m. until 12 p.m., with Ideastream senior host Rick Jackson serving as the moderator.",
    "Joe Blystone, Jim Renacci and Mike DeWine have been in contact with the ODC to debate for the Republican Gubernatorial primary.",
    "U.S. Senate Republican hopefuls Matt Dolan, Mike Gibbons, Josh Mandel, Neil Patel, Mark Pukita, Jane Timken and J.D.",
    "CLEVELAND — The Ohio Debate Commission announced the dates and moderators for four primary debates.",
    "U.S. Senate Democratic hopefuls Morgan Harper, Traci Johnson and Tim Ryan are expected to debate.",
    "The final debate will take place at 7 p.m. with WVXU host Lucy May serving as the moderator.",
    "John Cranley and Nan Whaley will be debating for the Democratic ticket for Ohio governor.",
    "Ron Hood has not responded about participating in the debate, according to the ODC.",
    "All of the primary debates will be held at Central State University in Wilberforce.",
    "These will be the first in-person debates since the start of the COVID-19 pandemic.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "Vance are expected to debate."
  ]
}