{
  "id": 11875,
  "mediaId": 2537,
  "date": "2022-03-29",
  "headline": "Opinion: Don't let Cranley fail Ohio like he did with city",
  "image": "https://www.gannett-cdn.com/presto/2020/04/16/PCIN/9ad2677b-a2f9-4499-bd30-65ab3088adc3-041620AlternativeTreatmentDukeEnergyCovid_AC16.JPG?crop=6719,3780,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/03/29/opinion-dont-let-cranley-fail-ohio-like-he-did-city/7046391001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Johannon R. Tate",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Opinion contributor\nAs John Cranley has traveled around our state seeking the Democratic nomination for Ohio governor, his primary argument is that Ohio voters should look at his record and accomplishments as the former mayor of Cincinnati.",
    "And while Cranley loves to highlight new development and growth, he almost never seems to mention the people his developer friends steamrolled: Black Cincinnatians and poor people who have been gentrified out of historic neighborhoods.",
    "When Cranley’s well-respected, Black city manager refused to abide by the sweetheart deals Cranley wanted to give to his developer friends and accused him of corruption, the city manager was also forced out of his job.",
    "But even more importantly, we were outraged that for eight years (and even more before that) he was clearly interested only in himself and gaining power, not helping the folks struggling to get by all around the city.",
    "Although Cranley often takes credit for the betterment of community and police relations through the groundbreaking Collaborative Agreement, the city essentially walked away from the program once he became mayor.",
    "Under his leadership, funding for the Collaborative Agreement decreased, and Cranley only seemed to take interest again when he was up for reelection – and now again that he is running for governor.",
    "As Cranley tries to rewrite history for his own personal and political gain, I believe we must tell the truth to the rest of Ohio because he is not the sort of leader we need as governor.",
    "It is a tale of two cities: one city full of fancy new apartment buildings and nice neighborhoods like Cranley’s, another city full of people being priced out and ignored.",
    "And Cincinnati lost two respected Black leaders while having to pay out hundreds of thousands of dollars in legal settlements to clean up Cranely’s personal vendettas.",
    "When I came to Cincinnati to lead a church in the West End, I tried to meet with then- Mayor Cranley, but was only able to do so after I cornered him on Twitter.",
    "When Cranley came into office, he inherited from his predecessor a Black police chief who was popular with the community and local leaders.",
    "These large public spectacles divided our city and took focus away from solving important problems like poverty and health disparities.",
    "In the West End, a community with many needs, we only ever saw Cranley when he came to our neighborhood for TQL Stadium events.",
    "We only saw him when there was a photo opportunity that made it appear like he cared about the Black community.",
    "He suggested he would add me to a list of clergy who met with him regularly, but no meetings occurred.",
    "We were embarrassed to see headlines and articles about his temper and the toxic culture at City Hall.",
    "Time and time again as the leader of our city, he looked out for himself and his friends, not us.",
    "What he doesn’t like to talk about is that Cincinnati’s Black population is actually decreasing.",
    "I believe that Cranley left Cincinnati more divided and worse off, especially for Black people.",
    "As a pastor and someone who cares about the future of our city, I feel it is my duty to do so.",
    "I think it is time to set the record straight and expose the distortions and lies of Cranley.",
    "The Cincinnati \"comeback\" that he so frequently references is not what he purports it to be.",
    "He had him fired, lied about it, and then even gave advice to other mayors on the topic.",
    "Dr. Johannon R. Tate is the pastor at Jerriel Missionary Baptist Church.",
    "Some of us in Cincinnati never accepted having a mayor who was a bully.",
    "Cranley’s action are well-documented and known by Black Cincinnatians.",
    "This experience seems par for the course for many Black Cincinnatians.",
    "As always, it was Cranley first, the people of Cincinnati last.",
    "John Cranley failed Cincinnati, do not let him fail Ohio.",
    "I did not feel heard or respected in our brief meeting.",
    "Aren’t there better ways to spend our tax dollars?",
    "What was that police chief’s mistake?",
    "Cranley didn’t personally pick him.",
    "I agree.",
    "Rev."
  ]
}