{
  "id": 12002,
  "mediaId": 8480,
  "date": "2022-03-25",
  "headline": "Ohio Democratic gubernatorial candidates debate Tuesday",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/Untitled-design-e1648225631130.png?w=1280",
  "link": "https://www.wdtn.com/news/your-local-election-hq/ohio-democratic-gubernatorial-candidates-set-to-face-off-in-debate/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Curi",
  "authorUrl": "https://www.wdtn.com/author/peter-curi/",
  "termIds": [
    3346,
    2143,
    2605,
    259,
    392,
    6474
  ],
  "sentences": [
    "WILBERFORCE, Ohio (WDTN) – The Democratic candidates running to take over as Ohio’s governor participated in a gubernatorial debate on Tuesday, March 29.",
    "The Ohio Debate Commission held Monday’s debate at the Paul Robeson Cultural & Performing Arts Center at Central State University in Wilberforce.",
    "On the other side of the aisle, a debate among Republican candidates for governor in Ohio has also been canceled after Gov.",
    "The Democratic candidates that attended the gubernatorial debate on Tuesday were John Cranley and Nan Whaley.",
    "A third GOP gubernatorial candidate, former state Rep. Ron Hood, never returned organizers’ phone calls.",
    "The Ohio governor declined the chance to participate in the debate in his race for re-election.",
    "DeWine did participate in the 2018 debate against Democrat Rich Cordray, the release said.",
    "The Ohio Debate Commission sent out a release on March 10 stating that Gov.",
    "Mike DeWine and U.S. Rep. Jim Renacci declined to participate in a debate.",
    "That would have left central Ohio farmer Joe Blystone alone on the stage.",
    "DeWine did not say why he was turning down the opportunity to debate.",
    "The hourlong debate was moderated by Lucy May of Cincinnati Edition.",
    "The March 29 debate can be watched in the video player above.",
    "The debate began at 7 p.m. on March 29."
  ]
}