{
  "id": 12147,
  "mediaId": 8323,
  "date": "2022-03-28",
  "headline": "Ohio US Senate Democratic primary debate",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/03/votingstickers.jpg?w=1280",
  "link": "https://fox8.com/news/candidates-for-ohio-us-senate-democratic-primary-face-off/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Nethers",
  "authorUrl": "https://fox8.com/author/davenethersfox8news/",
  "termIds": [
    0
  ],
  "sentences": [
    "Johnson said, “We should tread lightly when it comes to expanding the court.”\nRyan says he doesn’t support expanding the Supreme Court\nMorgan Harper has focused her attacks on Congressman Tim Ryan\nTim Ryan has been in Congress since 2003\nTim Ryan says he supports a tax on the top 1%\nHarper says universal healthcare is one of her top priorities\nHarper says universal healthcare will be paid for by closing tax loopholes\nJohnson says she supports healthcare for all\nHarper is criticizing Ryan for accepting campaign money from Sen. Joe Manchin’s PAC\nRyan says we can’t grow the middle class who are being stretched thin by students loans to pay for college.",
    "“As I watch the Republican primary debate, it is clear that they are unqualified.” – Tim Ryan\nMorgan Harper says she wants to raise minimum wage and have Medicare for all\n“We have to get people back to work so we can put more money in their pockets.” – Traci Johnson\nRyan says Biden should come to Congress about action in Ukraine\n“Putin is a butcher.” – Tim Ryan\n“President Biden should come to Congress and ask for that authorization,” Harper says about whether there should be more action take in Ukraine\nJohnson says she believes in supporting the people of Ukraine and agrees with President Biden’s handling so far.",
    "“We should be considering repealing the gas tax that is adding 30-cents per gallon to what in some cases is over $4 a gallon for a lot of Ohioans,” said Harper, adding “We need to make sure we are addressing windfall profits that big oil big gas is taking advantage of at this moment of true global humanitarian crisis to be able to continue to milk the working people of our state.”\nRyan said he views alternative energy opportunities as ways to create new jobs across the state, referring in part to the Lordstown Assembly plant.",
    "A vote for either of them is a vote for Joe Biden’s failed policies, causing record inflation, skyrocketing energy prices, and the rapid decline of the United States’ leadership on the world stage.”\nFollow live updates on the debate below\nThe primary was scheduled for May but has been postponed because of the debate over redistricting maps.",
    "“We have to have a strong response and so that is why I have been outspoken about imposing aggressive economic sanctions against Putin and those around him who are enabling him,” said Harper, who added that if she were asked to decide, she would give it careful consideration.",
    "Ryan countered by saying he has always stood with the workers at a tank plant in Lima and other smaller contractors who provide thousands of jobs in Ohio, but he has also not given in to defense contractors when there is evidence of misappropriation of federal funds.",
    "“We need to ensure that we are implementing strong federal protection like universal background checks, preventing people from having access to weapons who aren’t in a position to manage them effectively, but also to address the root cause of violence,” said Harper.",
    "We keep our troops safe, we provide Ukraine the resources to protect themselves and we work in accordance with NATO,” said Traci “T.J.” Johnson, who confessed she was attending her first debate ever and feeling uncomfortable on the stage in front of cameras.",
    "As to the question of universal healthcare, Johnson said, “We have healthcare we need to make it functional, affordable and accessible and then take a viable system and then transition it into Medicaid for all which is healthcare for all,” she said.",
    "Live blog:\nVoters First: 2022 Ohio US Senate Democratic Primary debate\nThe Ohio Debate Commission presents and Central State University hosts Voters First: 2022 Ohio US Senate Democratic Primary debate live from Wilberforce, Ohio.",
    "“With respect to (democrats) stacking the court, we need to tread lightly because if we expand the court as democrats then when republicans come in, they will expand the court and then the court will lose its power,” said Johnson.",
    "Central State University is scheduled to hold the Republican Senate debate Monday evening at 7 p.m.\nMatt Dolan, Josh Mandel, Mike Gibbons, Neil Patel, Mark Pukita, Jane Timken and JD Vance have confirmed for the debate.",
    "Senator Rob Portman of Ohio took the stage at Central State College on Monday weighing in on multiple issues from the war in Ukraine to The U.S. Supreme Court, to voting rights, guns, the environment and energy.",
    "Following the debate Ohio Republican Party Spokesman Dan Lusheck sent out a statement, reading: “Tim Ryan is no moderate, and there is zero light between his and Morgan Harper’s far-left agendas.",
    "“I do think if you took out a loan you should pay it but put more money in your pocket and that will help you buy a car, buy a house and be able to re-invest back into the economy ,” said Ryan.",
    "Morgan Harper, a consumer protection attorney, community organizer born in Columbus, questioned money Ryan has taken from FirstEnergy Corporation and from defense contractors.",
    "The candidates were asked if the president, under those circumstances, should take the question of U.S. military involvement to Congress and how they would vote.",
    "Among those on stage was U.S. Representative Tim Ryan, of Niles, who was elected to congress in 2013 and leads the democratic race heading into the May Primary.",
    "“I have committed to not accept any money from any sector, including the defense contracting that my opponent here today has taken over $400,000,” said Harper.",
    "Our communities have a ton of guns that are just available for gun violence, homicides.”\n“We have to make sure these guns are off the streets,” said Johnson.",
    "With respect to student loans, Ryan said he is in favor of allowing those with huge debt to negotiate a low interest rate with their lenders.",
    "I believe we need to nominate justices like justice Jackson and I think she is the epitome of who we want on the Supreme Court,” said Ryan.",
    "All three were questioned on Article 5 of the NATO agreement, described as “an attack on one is an attack on all” of the 30 NATO countries.",
    "Tuesday at 7 p.m. will be the Democratic gubernatorial debate featuring John Cranley and Nan Whaley, which you can also watch on FOX8.com.",
    "“We have to make sure that not only are we looking at healthcare, we have to make sure people have the mental health care that they need.",
    "“It (the Supreme Court) no longer represents the majority of the will of the people living in the state of Ohio or across this country.",
    "“I supported the House of Representatives’ universal background checks, closing the Charleston loophole, closing the gun show loophole.",
    "All three also weighed in on the U.S. Supreme Court and the confirmation hearings of Justice Candidate Ketanji Brown Jackson.",
    "During Monday’s hour-long debate, Ryan became the focus of one of his rival’s consistent attacks regarding his fundraising.",
    "We need to create economic opportunity for people all over Ohio and make sure we can be a state of the future,” she said.",
    "In November, voters will elect either the Democratic or Republican nominee to fill the seat held by Rob Portman.",
    "“I have fought the department of defense on wasteful spending, including if it was an Ohio company,” said Ryan.",
    "The same questions were not asked of all of the candidates, but all three weighed in on the war in Ukraine.",
    "“I believe at the end of the day, what is most important is that we keep the United States safe.",
    "We have to make sure we grow this economy from the middle out, not the top down,” added Johnson.",
    "With respect to gun violence, Johnson said “Ohio has the weakest laws on guns and gun violence.",
    "Harper was quizzed about the environment and energy with gas prices reaching new record highs.",
    "He says people should be able to renegotiate their interest rates and offer more grants.",
    "All three candidates said they would work to eliminate the filibuster in Congress.",
    "Harper says she supports expanding the Supreme Court and upholding Roe V Wade.",
    "He announced in January of 2021 that he would not be running for re-election.",
    "I think we need to figure out a way to get airplanes to Ukraine,” said Ryan.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "Everybody should feel safe in the community they live in.,” said Ryan.",
    "“When it comes to the Supreme Court, I am not for stacking the court.",
    "WILBERFORCE, Ohio (WJW) – All three democrats seeking to succeed U.S.",
    "He is slaughtering innocent people and I think we need to do more.",
    "I think it’s critical when we see what’s happening on our streets.",
    "We need to recalibrate it, we need to balance it ,” said Harper.",
    "Harper said she was in favor of forgiving student debt entirely.",
    "“I believe he should come to Congress and I would support it.",
    "Putin is a butcher, he is a killer and a war criminal.",
    "Copyright 2022 Nexstar Media Inc. All rights reserved.",
    "I believe we have democracy on the line here.",
    "Harper supports canceling student debt.",
    "Portman has held the seat since 2011.",
    "FOX8.com will stream it live.",
    "“We need to cancel the debt."
  ]
}