{
  "id": 1224,
  "mediaId": 8494,
  "date": "2022-02-18",
  "headline": "Morning Headlines: Ohio Redistricting Commission fails to pass new legislative maps; Biden visits Lorain to tout $1B for Great Lakes cleanup",
  "image": "https://npr.brightspotcdn.com/dims4/default/7bffec5/2147483647/strip/true/crop/1760x924+0+18/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe7%2F54%2Fa940a1be4b1f845afdab2e93457f%2Fdownload.png",
  "link": "https://www.wksu.org/2022-02-18/morning-headlines-ohio-redistricting-commission-fails-to-pass-new-legislative-maps-biden-visits-lorain-to-tout-1b-for-great-lakes-cleanup",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Friday, February 18:\nOhio Redistricting Commission fails to pass new legislative maps\nBiden visits Lorain to tout $1B for Great Lakes cleanup\nOhio’s COVID-19 transmission rate continues to fall\nState Dems choose not to endorse candidates for governor\nKoch-affiliated group makes grassroots policy push in Ohio\nOhio Redistricting Commission fails to pass new legislative maps\n(AP) — The Ohio Redistricting Commission has failed to meet a court-set deadline for fixing state legislative maps.",
    "Koch-affiliated group makes grassroots policy push in Ohio\n(AP) — The Ohio arm of the influential political advocacy group Americans for Prosperity is launching an effort to elevate “a higher caliber” of state legislator who will focus less on socially divisive topics and more on passing impactful public policy.",
    "The policy package it developed through a series of meetings since October centers on: removing barriers to economic opportunity, advancing personal healthcare options, expanding educational opportunities, and reforming the criminal justice system.",
    "State Dems choose not to endorse candidates for governor\n(Statehouse News Bureau) -- The Ohio Democratic Party’s executive committee decided unanimously not to endorse a candidate for governor at Thursday night’s meeting.",
    "But they did endorse Congressman Tim Ryan for U.S. Senate, though his primary opponent Morgan Harper said he already has a fundraising account with the party and is renting space at the party’s headquarters.",
    "Biden visits Lorain to tout $1B for Great Lakes cleanup\n(AP) — President Joe Biden says the bipartisan infrastructure law will pump $1 billion into a Great Lakes restoration program.",
    "Ohio’s COVID-19 transmission rate continues to fall\n(WKSU) -- Ohio’s COVID-19 transmission rate has fallen to 255 cases per 100,000 people, down nearly half from last week.",
    "Supreme Court Justice Jennifer Brunner was endorsed in her bid for Chief Justice, along with the two other Supreme Court candidates, Judges Marilyn Zayas and Terri Jamison.",
    "The billionaire Koch family-affiliated group told The Associated Press its “Buckeye Blueprint” initiative begins Thursday with a rebranded website.",
    "Republicans leading the panel threw up their hands and declared an impasse Thursday, after voting down an alternative map advanced by Democrats.",
    "The committee was pressured not to back either former Dayton mayor Nan Whaley or former Cincinnati mayor John Cranley for governor.",
    "Much of that extra money will help finish the cleanup of harbors and rivers polluted with industrial wastes in the last century.",
    "The map-drawing process driven by the 2020 Census intended for new lines to be in place for the 2022 primary, which is May 3.",
    "Biden went to Lorain, Ohio, on Thursday to highlight the measure's benefits for the lakes and the regional economy.",
    "Support for the cleanup is one issue on which the region's congressional Democrats and Republicans routinely agree.",
    "The maps were twice rejected by the state’s high court for being gerrymandered in favor of Republicans.",
    "Cuyahoga County’s case rate is below 100 cases per 100,000 people for the first time in six months.",
    "In a Feb. 7 decision, the Ohio Supreme Court had set Thursday as the deadline for a new version.",
    "The CDC considers communities with rates of 100 cases or more places with high infection rates.",
    "The state reported around 1,450 COVID patients on Thursday, with just under 400 in ICUs.",
    "Thirty-one U.S. toxic hot spots were designated around the Great Lakes in 1987.",
    "More than $150,000 in promotions and digital outreach will follow.",
    "Officials say by 2030 work should be finished at all but three.",
    "Hospitalizations also continue to drop."
  ]
}