{
  "id": 12391,
  "mediaId": 8379,
  "date": "2022-03-29",
  "headline": "Former Ohio mayors Cranley, Whaley debate in Democratic governor primary",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/03/cranley-whaley-debate.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/your-local-election-hq/ohio-democratic-governor-candidates-cranley-whaley-to-have-first-debate-tuesday/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Orner",
  "authorUrl": "https://www.nbc4i.com/author/ben-orner/",
  "termIds": [
    0
  ],
  "sentences": [
    "Cranley said the same comeback can happen for cities like Toledo, Akron, and Youngstown because his administration would “put Democratic values into practice.” Cranley, a co-founder of the Ohio Innocence Project, said this begins with “racial justice” and “diversity and inclusion.”\nUnder his mayorship, Cranley said Cincinnati arrested fewer people, increased public transit, upped the minimum wage, and invested in free public preschool.",
    "“Folks that are running our statehouse right now are more interested in lining their pockets than taking care of places like Marietta or Mansfield,” she said, “places that have opportunities for growth.”\nCranley said he would invest in community colleges and graduate-level education to attract businesses and jobs and keep Ohio graduates in-state.",
    "Cranley said he would fire Ohio’s utility commissioners and replace them with “commissioners committed to clean energy (and) protecting the consumer.”\nPoll shows it’s anyone’s race\nTuesday night was the first time voters got to see the two candidates together, which should help them overcome a lack of statewide name recognition.",
    "Whaley said cutting taxes on multinational corporations and wealthy people doesn’t mean that “all communities will suddenly get stronger and richer.”\nWhaley said her jobs plan would see the state invest in new technologies like renewable energy and battery tech, secure union manufacturing jobs and help small businesses grow.",
    "“Our communities are now less safe because of extreme, radical agenda items like stand your ground and permit-less concealed carry, which actually makes our police officers less safe,” Whaley said, adding she would push for universal background checks on firearm purchases.",
    "Cranley’s “comeback;” Whaley would spread growth\nCincinnati was Ohio’s only metropolitan core city other than Columbus to gain population between 2010 and 2020 — 4.17% according to the U.S. Census Bureau — and Cranley led the Queen City through much of that growth.",
    "Examples of the governor being “too weak,” Whaley said, include abandoning Ohio’s COVID-19 mask mandate, not requiring masks in schools, and not signing meaningful gun reforms after a 2019 mass shooting in Dayton killed nine people and injured 27.",
    "John Cranley and Nan Whaley, the mayors of Cincinnati and Dayton, respectively, from 2013 through 2021, presented liberal but differing plans to move the state forward, as the candidates hope to face the likely Republican nominee: Gov.",
    "Columbus has by far seen the best population growth of any Ohio city – 15.08% in the last decade – and new developments and investments like the $20 billion Intel computer chip plant are celebrated by state officials.",
    "He touched on multiple mayoral accomplishments that improved Ohio’s third-largest city, including reducing poverty, making Cincinnati carbon neutral, and building the nation’s largest municipal solar farm.",
    "Candidates hit “corrupt” DeWine, legislature\nThroughout the debate, Whaley accused DeWine of “corruption” and accused lawmakers in Columbus of “partisan bickering” and “one-way-is-the-highway” thinking.",
    "On corruption, Cranley made note of House Bill 6, the law championed by since-indicted Ohio House Speaker Larry Householder that subsidized nuclear power plants and raised utility bills for Ohioans.",
    "WILBERFORCE, Ohio (WCMH) – Two former major-city mayors took the stage Tuesday night at Central State University, debating which Democrat has the best vision to be Ohio’s next governor.",
    "Mike DeWine and former Congressman Jim Renacci declined the commission’s debate invitation, so the Republican candidates for governor are not scheduled to meet before the May 3 primary.",
    "“(DeWine) has said what is politically convenient over and over again, but when the rubber meets the road, he is only willing to stand with the radicals in his party,” she said.",
    "Cranley’s biggest ideas include legalizing marijuana and using the tax money to create 30,000 jobs that will build clean energy infrastructure and high-speed Internet.",
    "He also wants to increase taxes on energy companies and return that money to Ohioans as a $500 annual dividend, similar to what Alaska does with oil profits.",
    "Along with being mayor of Ohio’s sixth-largest city, Whaley led more than 500 mayors from both parties as president of the U.S. Conference of Mayors.",
    "NBC4’s poll last month found 45 percent of likely primary voters approve of the job he is doing, 37 percent disapprove and 18 percent were neutral.",
    "Whaley also said Ohio’s future prosperity should be felt statewide, noting that most of the state’s growth has happened in the Columbus region.",
    "That Emerson College survey, the only independent poll of the race so far, had Cranley and Whaley tied with just under 16 percent each.",
    "“Our policies work, our values work, and Republican values of trickle-down (economics) and divisive social policy fails,” he said.",
    "“We need a comeback.”\nCincinnati is adding people twice as fast as the state, he said, and it’s reduced poverty 1.5 times faster.",
    "But after 30 years of one-party, corrupt rule, the average Ohioan is making less money than the average American,” Cranley said.",
    "No Republican gubernatorial debate\nTuesday was also the final of three primary debates scheduled by the Ohio Debate Commission.",
    "Canal Winchester farmer Joe Blystone (21 percent) and Renacci (18 percent) are his top challengers and running to his right.",
    "The latest GOP poll, an early March survey from Fox News, put DeWine at 50 percent, with only 1 in 10 voters undecided.",
    "Nearly 7 in 10 likely Democratic voters in a late February poll commissioned by NBC4 said they were still undecided.",
    "Democrats running for Senate debated Monday morning, and their Republican counterparts took the stage that night.",
    "“The answer to Ohio’s young adults can’t be, ‘If you want a good job, move to Columbus,’” she said.",
    "Despite criticism on both sides of the aisle, DeWine has generally been a popular governor.",
    "Ohio promised more than $2 billion in incentives to attract Intel.",
    "“Mike DeWine has consistently overseen corruption,” he said.",
    "Watch the full debate in the video player above.",
    "“The future used to happen here.",
    "Mike DeWine.",
    "Gov."
  ]
}