{
  "id": 13902,
  "mediaId": 8455,
  "date": "2022-03-15",
  "headline": "Democrat launches ad in Ohio governor race",
  "image": "https://www.toledoblade.com/image/2022/01/05/600x_q90_a4-3_cTCjpg/cranley06-4.jpg",
  "link": "https://www.toledoblade.com/local/politics/2022/03/15/democrat-john-cranley-launches-ad-in-ohio-governor-race/stories/20220315099",
  "mediaOutlet": "The Toledo Blade",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Provance",
  "authorUrl": "",
  "termIds": [
    5339,
    3346,
    2605,
    2143,
    392,
    6077,
    6060,
    6474,
    6660
  ],
  "sentences": [
    "“Right now, we have the larger cash-on-hand advantage, and in a state as large and diverse as Ohio..., our ability to communicate that message to a broad group of people in this primary is going to be absolutely critical.”\nThe campaign forged ahead with this media buy despite uncertainly surrounding the May 3 primary election date and even as Mr. Schoonmaker voiced hope that the Ohio Supreme Court would again strike down Republican-drawn congressional and state legislative maps.",
    "It's going to put police officers in harm's way...It's just an outrageous piece of legislation that I think stains Mike DeWine's soul and will literally lead to unnecessary killing.”\nWhaley spokesman Courtney Rice said that campaign plans to go up with its first ad “very soon.”\n“We are so excited to tell Nan's story in coming weeks,” she said.",
    "To demonstrate what he sees as the difference between a Governor DeWine and a Governor Cranley, he pointed to Mr. DeWine's signing Monday of a Republican-passed bill allowing Ohioans age 21 and older to legally carry concealed handguns without having to obtain a license and undergo the background check and firearm training that goes with it.",
    "“We've got to change that, and at the same time give people hope that Ohioans can have brighter days.”\nThe ad features Mr. Cranley driving past old factories with broken windows and barbed wire around prisons, touting his roles as mayor of Cincinnati and a founder of the Innocence Project that worked to free the wrongly imprisoned.",
    "Meanwhile, Mr. DeWine faces challenges from his right — former state Rep. Ron Hood, cattle farmer Joe Blystone, and former U.S. Rep. Jim Renacci — in his bid for his party’s nomination for re-election..\nOhioans may begin casting absentee and in-person early ballots on April 5.",
    "COLUMBUS — “I say we can bring Ohio back,” former Cincinnati Mayor John Cranley states in his first television ad, part of a campaign that repeatedly emphasizes the “comeback” he says his city has experienced and Ohio will experience if he is elected governor.",
    "His campaign said the biographical ad — which also features images of his running mate, state Sen. Teresa Fedor (D., Toledo) — represents an initial, one-week $280,000 buy that will air on broadcast and cable channels in all of the state's media markets.",
    "Later ads are more likely to focus on some of Mr. Cranley's proposed policies, which include such things as legalization of recreational marijuana to fund Ohio infrastructure investment and an Alaska-style energy dividend for Ohioans.",
    "Nan's campaign is about the future of Ohio families.”\nMs. Whaley, who was mayor of Dayton when the 2019 mass shooting occurred there, planned to visit Toledo later Tuesday to demonstrate support for her candidacy in northwest Ohio.",
    "The first TV ad for a Democratic gubernatorial candidate kicked the campaign for the party's nomination into higher gear Tuesday, just three weeks prior to the start of early voting for the May 3 primary election.",
    "The Cranley-Fedor team will square off against the team of former Dayton Mayor Nan Whaley and Cuyahoga County Councilman Cheryl Stephens for the party's nomination in hopes of ultimately replacing Republican Gov.",
    "In the first of a series of regional launches of the Women for Whaley-Stephens coalition, she was to be joined by Brittany Moore, president of Northwest Ohio Black Young Democrats.",
    "“The only publicly available polling shows this race is a dead heat between Mayor Cranley and Mayor Whaley,” Cranley campaign manager Matt Schoonmaker said.",
    "Such a decision would make moving forward with that primary date impossible — at least for congressional and state House and Senate races.",
    "“We wanted to first introduce ourselves because it's clear that the vast majority of Ohioans don't know who I am,” Mr. Cranley said.",
    "Should it win the nomination, the Whaley-Stephens ticket would be the first all-woman team nominated for Ohio governor.",
    "Nancy Hollister entered the history books for a few days when she ascended from lieutenant governor when then Gov.",
    "The theme is to use what he characterizes as Cincinnati's comeback story and apply it to the state as a whole.",
    "“We feel confident in the lead she's built up by campaigning across Ohio for over 11 months.",
    "George Voinovich left early to join the U.S. Senate in late 1998.",
    "This ad once again is Mayor Cranley talking about himself.",
    "No woman has ever been elected governor, although Gov.",
    "“It's going to lead to killings,” he said.",
    "First Published March 15, 2022, 8:11am",
    "“It's going to lead to deaths.",
    "Mike DeWine."
  ]
}