{
  "id": 14165,
  "mediaId": 2550,
  "date": "2022-03-16",
  "headline": "Morning Digest: MAGA House hopeful bails after Trump",
  "image": "https://images.dailykos.com/images/1048886/story_image/GettyImages-1235845429.jpeg?1647381599",
  "link": "https://www.dailykos.com/stories/2022/3/16/2086143/-Morning-Digest-MAGA-House-hopeful-bails-after-Trump-memory-holes-endorsement-and-backs-someone-else?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Huizenga himself acknowledged weeks ago that he wasn’t sure if Trump’s earlier endorsement of Carra in the 6th still applied, saying, “I'm aware that there are people within the organization that are looking at it and are trying to figure that one out.” Those calls seemed to have worked because on Friday, Trump announced that Huizenga was his man in southwestern Michigan.",
    "Also in the mix is businessman Jonathan Swain, real estate executive Nykea Pippion McGriff, and activist Jahmal Cole, who was running a long-shot campaign against Rush before the incumbent retired; it's possible one of the other 12 candidates could also attract attention in the two-and-a-half weeks ahead of the primary.",
    "The only poll we've seen was a recent Lake Research Partners survey for the pro-Ramirez Working Families Party that showed her leading Villegas 19-11; a mere 1% went to Iymen Chehade, a history professor at the center of an ethics probe involving Rep. Marie Newman (who is seeking re-election in the 6th District).",
    "NC-13: Donald Trump has joined his one-time enemies at the Club for Growth in endorsing Bo Hines, a 26-year-old law student who previously played as a wide receiver at North Carolina State in 2014 before transferring to Yale, in the packed May primary for this competitive open seat in Raleigh's southern suburbs.",
    "And while most of the probes into Zinke ended after investigators concluded he hadn't committed wrongdoing or because Interior Department staffers didn't cooperate, one matter looking into whether he lied about why he denied two tribes permission to operate a casino in Connecticut is still unresolved.",
    "Carra himself eventually decided to run for the 4th even though it didn't include a shred of his legislative seat, and for more than a month he was able to take advantage of the GOP leader’s silence about where things stood post-redistricting and continue to run as the only Trump-backed candidate.",
    "Ross, whose reliably red constituency was redubbed the 15th two years later, rose to become senior deputy majority whip, but he rarely attracted much attention otherwise; indeed, national observers sometimes referred to him as the other Dennis Ross when they referred to him at all.",
    "Three Democrats are campaigning here, but former Biden administration official Nikki Budzinski quickly emerged as the clear frontrunner after raising a serious amount of money and consolidating support from Sen. Dick Durbin, much of the state's House delegation, and several unions.",
    "IL-13: Republican Rep. Rodney Davis decided to run in the 15th District after Democratic mapmakers transformed the 13th into a seat that now stretches from East St. Louis northeast through Springfield to the college towns of Champaign and Urbana and would have backed Biden 54-43.",
    "Last month, federal investigators also released a report concluding that he violated federal ethics rules while in the cabinet by taking part in talks with developers about a project involving land owned by his foundation and then lying about his involvement in the negotiations.",
    "MI-04: State Rep. Steve Carra on Tuesday ended his campaign for the Republican nod against Reps. Bill Huizenga and Fred Upton days after he learned the hard way that Donald Trump's \"Complete and Total Endorsement\" isn’t actually complete and total when redistricting is involved.",
    "IL-17: Democratic Rep. Cheri Bustos announced her retirement months before her party transformed this constituency in the state's northwest corner from a 50-48 Trump seat to one that would have favored Biden 53-45, and seven fellow Democrats are campaigning to succeed her.",
    "DeMarco cited his duties as county party chair and argued that it \"needs a full-time chairman who will devote himself 24/7 to making certain that the Republicans recapture the office of governor, secure a U.S. Senate seat and maintain control of the general assembly.\"",
    "Michigan state Rep. Steve Carra\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Ross was elected in the 2010 tea party wave to succeed Adam Putnam, a fellow Republican who left to successfully run for state agriculture commissioner (he later lost the 2018 primary to none other than DeSantis) in what was then numbered the 12th District.",
    "Carra last year had picked up Trump's backing when he was taking on Upton in the old 6th District, but that was before the new map ensured that Huizenga and Upton would be running for the same new 4th District if they each wanted to remain in the House.",
    "Big Sky Country has regained the second congressional district it lost after the 1990 Census, but all the action this year will almost certainly be in the new 1st District, a seat in the western part of the state that would have supported Trump 52-45.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nNorth Carolina, South Korea, and why you should Run For Something, with Amanda Litman\nThe Downballot\nFollowShare\n0:0042:43\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLEADING OFF\n?",
    "And to win statewide, especially in a difficult midterm environment, would require an even more herculean feat than the one Horn managed four years ago, seeing as Trump carried Oklahoma 65-32 in 2020, making it his fourth-best state in the nation.",
    "Six Republicans are also campaigning here including two mayors of small communities: Keith Pekau of Orland Park and Gary Grasso of Burr Ridge, who has the support of state House Minority Leader Jim Durkin and DuPage County Board Chair Dan Cronin.",
    "Team Blue's field consists of Rockford Alderman Jonathan Logemann; Rockford Alderwoman Linda McNeely; Rock Island County Board member Angie Normoyle; former TV meteorologist Eric Sorensen; former state Rep. Litesa Wallace; and two others.",
    "The third contender is former state Rep. Tom Winter, who ran for the at-large U.S. House seat that year but lost the primary to 2018 nominee Kathleen Williams in an 89-11 landslide; Williams went on to lose to Republican Matt Rosendale.",
    "Horn won the most astonishing upset of the 2018 midterms when she unseated Republican Rep. Steve Russell in a 51-49 squeaker for an Oklahoma City-based district that Donald Trump had carried by a wide 53-40 spread two years earlier.",
    "IL-08: There's little indication that Democratic Rep. Raja Krishnamoorthi has much to worry about in his primary, but he does face a notable intra-party opponent in the form of Junaid Ahmed, who runs a technology consulting firm.",
    "OR-05: Moderate Rep. Kurt Schrader is spending a reported $200,000 on his first TV ad for the May Democratic primary, which features the seven-term incumbent talking about his veterinary career while surrounded by cute animals.",
    "IL-14: Democratic mapmakers sought to protect Rep. Lauren Underwood in this seat in Chicago's western exurbs by augmenting Biden's margin of victory from 50-48 to 55-43, but six Republicans are still betting she's vulnerable.",
    "However, Ross now very much is looking for a re-entry strategy, declaring, \"Seeing what's happened in the last few years has just forced me to get off the sidelines and get back in the game, and that's exactly the way I feel.",
    "Michigan's filing deadline is April 19, and since House candidates need to turn in at least 1,000 valid signatures to make the primary ballot, Upton would need to get moving before then if he's to go up against Huizenga.",
    "Democrats haven't prevailed in a race for statewide office since 2006, and they haven't won a Senate contest since David Boren's last re-election campaign in 1990 (which saw him romp in a remarkable 83-17 landslide).",
    "Another well-connected contender is construction contracting firm owner Jonathan Jackson, who is the son of two-time presidential candidate Jesse Jackson and the brother of former 2nd District Rep. Jesse Jackson Jr.",
    "PA-17: Allegheny County Council member Sam DeMarco announced hours before candidate filing ended on Tuesday that he was abandoning his week-old campaign for the Republican nomination for this competitive open seat.",
    "IL-01: Rep. Bobby Rush is retiring after 15 terms, and a massive field of 20 fellow Democrats have filed to succeed him in a safely blue seat based in the South Side of Chicago and the city's southwestern suburbs.",
    "Rosendale, for his part, is running in the new 2nd, a 62-35 Trump seat in the eastern portion of the state, and there's no indication that any of his three intra-party foes are ready to give him a serious fight.",
    "The most notable of the group appears to be former state Sen. Al Olszewski, but he finished last in both the four-way primary for Senate in 2018 and the three-way nomination fight for governor two years later.",
    "GA-10: Marine veteran Mitchell Swan earned a mere 4% in the 2014 Republican primary for a previous version of this seat, but he seems to have decided that anti-trans bigotry will help him stand out this time.",
    "Trump endorsed Zinke's return to Congress last summer, a development that came about two and a half years after Trump reportedly pressured him to leave the cabinet in the face of 18 federal investigations.",
    "Ahmed, who is portraying himself as a progressive alternative to the incumbent, ended 2021 with $421,000 on hand, a credible sum that was still utterly dwarfed by Krishnamoorthi's $11.55 million war chest.",
    "The congressman unexpectedly announced in 2018 that he would not seek a fifth term, though characteristically, his declaration was vastly overshadowed by Speaker Paul Ryan's own retirement that same day.",
    "FL-15: Former Rep. Dennis Ross announced Tuesday that he'd try to return to the House after a four-year absence by seeking the Republican nomination for the newly drawn 15th District in the Tampa area.",
    "OK-Sen-B: Former Rep. Kendra Horn, who represented Oklahoma's 5th District for one term, announced on Tuesday that she'll run in the November special election to replace departing GOP Sen. Jim Inhofe.",
    "IL-06: Redistricting has led to an incumbent vs. incumbent Democratic primary between Marie Newman and Sean Casten in a seat in Chicago's western inner suburbs that would have favored Joe Biden 55-44.",
    "Unfortunately for Horn, though, those trends weren't enough to keep her in Congress: Even though Trump's margin shrank to 51-46, she lost her bid for a second term to Republican Stephanie Bice 52-48.",
    "Indeed, Barack Obama himself won his state Senate seat in 1996 by getting all his Democratic primary foes—including incumbent Alice Palmer—thrown off the ballot for a lack of sufficient signatures.",
    "OH-Sen: Former state GOP chair Jane Timken's latest commercial for the May primary has her proclaiming that \"border security is national security\" and dubbing herself \"the real Trump conservative.\"",
    "FL-07: Democratic state Rep. Anna Eskamani, who previously hadn't ruled out a bid for Florida's open 7th Congressional District, announced on Tuesday that she'd seek re-election to the legislature.",
    "However, Newman also faces an ethics investigation into charges she sought to keep a potential primary opponent out of the race when she ran in 2020 by offering him a job as a top aide if she won.",
    "Carra, who is now seeking re-election, said Tuesday that he’d spoken to Trump’s people and learned that \"[t]he key decision maker that led to this was the fact that I don't live in the district.\"",
    "IL-03: Legislative Democrats created a new seat based in heavily Latino areas in southwestern Chicago and the western suburbs, and four Democrats are competing for this safely blue constituency.",
    "The two main contenders seem to be former federal prosecutor Jesse Reising and activist Regan Deering, whose family ran the agribusiness giant Archer-Daniels-Midland for more than 40 years.",
    "Businessman Gary Rabine and former state Sen. Paul Schimpf, who badly lost the 2014 general election for attorney general, are also in, but they haven't attracted much outside support yet.",
    "Not everyone who filed may make the ballot, though, because it's very common for candidates in the Prairie State to challenge their opponents' petitions to try to get them disqualified.",
    "Carra on his way out joined Trump in supporting Huizenga's intra-party bid against Upton, who voted to impeach Trump and still hasn't confirmed if he'll even be running for a 14th term.",
    "Davis, who sought to present himself as a moderate in order to win under the previous map, has the Illinois Farm Bureau on his side, and he also ended 2021 with a huge financial edge.",
    "Another notable name is former Illinois Criminal Justice Information Authority official Charise Williams, who lost a 2018 primary for a seat on the Cook County Board of Commissioners.",
    "Donald Trump and the anti-tax Club for Growth are pulling for Miller, a far-right extremist who declared last year during her first days in office, \"Hitler was right on one thing.",
    "A January survey from Public Policy Polling for 314 Action, which has since endorsed Sorensen, gave him a 13-11 edge over Wallace in a race where most respondents were undecided.",
    "Another well-connected contender is venture capitalist Jesse Sullivan, who launched his bid over the summer with $11 million in donations mostly from four California tech titans.",
    "Upton, for his part, began a $213,000 ad campaign last month that seemed to confirm he'd be running again, but his camp insisted at the time that he still hadn't made a decision.",
    "State Sen. Darren Bailey, meanwhile, has received $1 million from a different conservative megadonor, Richard Uihlein, and he also has the backing of far-right Rep. Mary Miller.",
    "Russell had run a disastrous campaign—after his loss, he compared the people who'd voted him out to \"a dog lapping up antifreeze\"—but long-term suburban trends and outgoing Gov.",
    "Steve Bullock launched his bid, while attorney Monica Tranel, who rowed in the 1996 and 2000 Olympics, lost a close general election for a seat on the Public Service Commission.",
    "IL-07: Longtime Rep. Danny Davis faces a rematch against anti-gun-violence activist Kina Collins, whom he beat 60-14 in the 2020 Democratic primary for this reliably blue seat.",
    "Villegas ended 2021 with a wide cash-on-hand lead, while Ramirez has since picked up the support of 4th District Rep. Chuy Garcia, who currently represents 43% of the new 3rd.",
    "The two frontrunners appear to be Chicago Alderman Gilbert Villegas, a Marine veteran backed by VoteVets, and state Rep. Delia Ramirez, who has EMILY's List in her corner.",
    "The frontrunner among the five Republicans very much looks like Ryan Zinke, who resigned as the state's only House member in 2017 to serve as secretary of the interior.",
    "Sununu is seeking to become just the second person to win a fourth two-year term as governor in state history, following Democrat John Lynch, who left office in 2013.\n?",
    "The mayor, though, has participated in several Democratic primaries in the past and has sometimes voiced moderate views, which could be a big liability in the primary.",
    "GA-Gov: While Stacey Abrams faces no competition in the May Democratic primary, the once and future nominee is launching its opening $1 million TV and digital ad buy.",
    "Irvin, who would be the state's first Black governor, has the support of billionaire Ken Griffin, and the state's wealthiest man has already given him $20 million.",
    "KS Redistricting: Kansas' Republican-run state House has introduced a new map for its own districts, following the same action in the upper chamber the other day.",
    "Team Red's field includes Kendall County Board Chair Scott Gryder, former Kane County Board member Susan Starrett, and conservative radio host Michael Koolidge.",
    "The field also includes financial planner David Palmer and progressive activist Ellis Taylor, but neither of them have picked up any major endorsements yet.",
    "(The Florida Man said he learned of Ryan's parallel departure as he was telling his own staff about his decision and happened to look at a TV tuned to Fox.)",
    "The spot ends with old footage of Trump, who is still making Timken and her many opponents grovel for his endorsement, calling her \"unbelievable.\"",
    "She continues by talking about how her organization last year \"paid off the medical debt of 68,000 Georgians,\" and how she aided small businesses.",
    "IL-15: Republican Reps. Rodney Davis and Mary Miller are facing off in a safely red seat in rural central Illinois, and both have powerful allies.",
    "Ramirez has earned the backing of several progressive groups while Villegas, who has emphasized public safety, is campaigning more as a moderate.",
    "We don't know if Upton was just being cute or really is still making up his mind, though prolonged public deliberations from him are nothing new.",
    "\"In Congress, I'm making a real difference for their owners too,\" he says, before he talks about working to lower insulin costs and drug prices.",
    "Things are far clearer on the Republican side where 2020 nominee Esther Joy King, who lost to Bustos 52-48, faces just one unheralded opponent.",
    "Zinke since then has earned bad headlines over how much more time he's spent in Santa Barbara, California compared to his home state.",
    "J.B. Pritzker is seeking a second term in this very blue state, but Republicans are hoping they'll still have an opening in the fall.",
    "After serving two terms in the state House, Sherman, a physician, challenged Republican state Sen. Dan Innis in 2016 but lost 52-46.",
    "The first spot features Abrams saying, \"When I didn't win the governor's race, not getting the job didn't exempt me from the work.",
    "That makes Inhofe's seat a particularly attractive prize to Republicans, though one potential contender is reportedly staying out.",
    "Politico says that Rep. Kevin Hern, who had been considering a bid, won't run, though Hern himself has not yet confirmed the news.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "IL-Gov: Candidate filing closed Monday for Illinois' June 28 primary, and the state has a list of contenders available here.",
    "However, it remains to be seen if any of Zinke's four intra-party foes are strong enough to take advantage of his problems.",
    "buttons at a September 2019 party gathering; it was only the following February that he finally said he'd be running again.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "No other Democrats filed for this seat in the Chicago western outer suburbs, which would have supported Biden 57-41.\n?",
    "Horn's entry gives Democrats an unusually credible candidate for a Senate race in Oklahoma, but it's still … Oklahoma.",
    "When you feel like a stranger in your hometown, it's time to say, 'There's got to be an exit strategy at some point.'\"",
    "And I feel compelled to do that in, I think, a very statesmanlike fashion (that) I think the voters are craving for.\"",
    "OH-Gov: Former Cincinnati Mayor John Cranley is spending $280,000 on his opening spot for the May Democratic primary.",
    "A total of eight GOP contenders are running, and the best-funded will almost certainly be Aurora Mayor Richard Irvin.",
    "The race also includes two sitting elected officials, state Sen. Jacqueline Collins and Chicago Alderman Pat Dowell.",
    "MT-01, MT-02: Filing also closed Monday for Montana's June 7 primary, and the state has its list of candidates here.",
    "Rush himself is supporting Karin Norington-Reaves, who is a former CEO of the Chicago Cook Workforce Partnership.",
    "Last cycle the longtime congressman kept everyone guessing about his plans even after he handed out \"Upton 2020!\"",
    "The only poll we've seen was a mid-February Newman internal from Victoria Research that showed a 37-37 deadlock.",
    "Newman's existing 3rd District makes up 41% of this new seat while Casten's current 6th District forms just 23%.",
    "GOP state Rep. Jackie Toledo is also campaigning for what would be an open seat even though Republican Gov.",
    "Two other Democrats have also filed for this district, which includes Chicago's West Side and downtown.",
    "Miller's current 15th District makes up 31% of this constituency, while Davis' existing 13th forms 28%.",
    "Meanwhile, three Democrats are campaigning here, all of whom also unsuccessfully sought office in 2020.",
    "Swan is running a TV spot for the May primary where he declares, \"I oppose transgenders in our ranks.\"",
    "The candidate is shown inspecting an abandoned factory as he declares that \"Ohio deserves a comeback.",
    "\"I was raised that when you don't get what you want, you don't give up,\" Abrams says, \"You try again.",
    "Two years later, he tried again, this time prevailing 53-47; he went on to win re-election in 2020.",
    "Just two states have failed to unveil any sort of legislative maps at all: Mississippi and Montana.",
    "Four Republicans are campaigning here with the hope that the new 13th isn't as blue as it looks.",
    "Cranley continues, \"When we started the Ohio Innocence Project, they said it was impossible.",
    "Ron DeSantis has pledged to veto the congressional map that she and her colleagues passed.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Chris Sununu this week, making him the first notable Democrat to join the race.",
    "You try because it's how things get better, it's how the world moves forward.\"",
    "When I became mayor of Cincinnati, they said the city would never grow again.",
    "Ross explained his decision by saying, \"Eight years takes its toll on you.",
    "Mary Fallin’s horrible numbers in the area were also working against him.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Public health expert Cora Neumann left the Senate primary when then-Gov.",
    "NH-Gov: State Sen. Tom Sherman announced a bid against Republican Gov.",
    "A fourth candidate, Juan Aguirre, has attracted little attention.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "We'll finally have our answer for 2022 before too long, though.",
    "(Illinois has notoriously lax campaign finance regulations.)",
    "I know it won't be easy, but I've faced long odds before.\"",
    "buttons to roll off the printer, though, we can't say.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "He said, 'Whoever has the youth has the future.'\"",
    "How long it would take for \"Upton 2022!\"",
    "Check out our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "It has freed 34 innocent people.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "And so I didn't quit.\"",
    "We defied the odds.\"",
    "Donate $5 monthly",
    "Please read it.",
    "Democratic Gov.",
    "Redistricting\n?",
    "Governors\n?",
    "Senate\n?",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}