{
  "id": 14192,
  "mediaId": 8379,
  "date": "2022-03-15",
  "headline": "What led DeWine to sign permitless carry bill?",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2019/04/Ohio_bill_would_end_concealed_carry_gun__1_79837616_ver1.0.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/state-news/what-led-dewine-to-sign-permitless-carry-bill/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jamie Ostroff",
  "authorUrl": "https://www.nbc4i.com/author/jamie-ostroff/",
  "termIds": [
    0
  ],
  "sentences": [
    "I have yet to be asked any specific questions about the bill other than if our office has any general comments.”\nNBC4 replied with the following questions:\nThe bill removes the burden from civilians carrying a firearm to disclose the fact that they have a weapon to law enforcement officers if they’re pulled over.",
    "Regarding the third question, Tierney pointed to a study DeWine commissioned during his time as Attorney General, which found that people convicted of two or more violent felonies are responsible for more than half of Ohio’s felony convictions.",
    "Gun rights advocates who support the so-called “permitless carry” bill say it solidifies a person’s Second Amendment right to bear arms, but the legislation has been panned by gun control advocates and law enforcement alike.",
    "After the shooting, DeWine introduced a 17-point legislative proposal geared toward reducing gun violence through measures like mental health care reforms, increased criminal penalties and background checks.",
    "“Our office has no additional comment at this time,” said an email from DeWine’s press secretary, Dan Tierney, Tuesday morning, when NBC4 asked what helped the governor reach his decision to sign the bill.",
    "The email followed noncommittal comments on the topic from the governor Friday, when reporters at an event asked whether he would sign SB 215, which had been on his desk for a week at that point.",
    "Asked Tuesday whether the governor does plan to comment on his decision to sign the bill, Tierney replied, “The governor does not plan to issue any further written statements on the legislations.",
    "“Mike DeWine knows better, and that’s why you’re not getting a response from him,” said Nan Whaley, a Democrat who is running for governor.",
    "Why does the governor believe it is in the best interest of Ohioans to shift that burden to officers, to ask civilians if they’re carrying?",
    "Whaley was mayor of Dayton during a mass shooting that claimed nine lives, leading to calls for DeWine to enact more gun control measures.",
    "Senate Bill 215 allows Ohioans to carry a concealed firearm without a permit, as long as they are qualified to own a firearm.",
    "DeWine’s office sent a press release Monday evening shortly before 6 p.m., outlining the bills he’d signed into law that day.",
    "“I’m not going to say much today other than, the job of the governor is to make tough decisions, and I have decision to make.",
    "Mike DeWine’s office is remaining tight-lipped on a controversial gun bill after the governor signed it into law Monday.",
    "Law enforcement communities, including the state Fraternal Order of Police, urged Governor DeWine to reject this bill.",
    "“On the first two, those are just different ways of asking if he has additional comments on why he signed the bill.",
    "DeWine’s Republican challengers, Jim Renacci and Joe Blystone, both support what they call “constitutional carry.”",
    "What specific factor encouraged the governor to go against the interest of law enforcement on this issue?",
    "Columbus, and cities across Ohio (and the country) are currently experiencing increases in violent crime.",
    "DeWine on his decision, suggesting that SB 215 could contribute to a decrease in gun violence?",
    "Whaley’s democratic opponent, John Cranley, also condemned DeWine’s decision to sign the bill.",
    "At every single term, he has broken that promise to Daytonians,” Whaley said.",
    "Can you please direct (us) to any research that may have informed Gov.",
    "I answered that previously,” Tierney responded to the questions.",
    "DeWine promised to do something to reduce gun violence.",
    "The governor’s office declined comment Monday evening.",
    "That’s about all I will say,” DeWine said that day.",
    "“After we had the mass shooting in Dayton, Gov.",
    "SB 215 was the last one listed.",
    "COLUMBUS, Ohio (WCMH) — Gov."
  ]
}