{
  "id": 15499,
  "mediaId": 8413,
  "date": "2022-03-06",
  "headline": "Nan Whaley, candidate for governor, talks jobs, government ethics in Fremont campaign stop",
  "image": "https://www.gannett-cdn.com/presto/2022/03/06/PPOC/bf9d9a63-7947-4c6d-8fcc-0d50969b26ea-IMG_7131.JPG?crop=5183,2916,x0,y263&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.portclintonnewsherald.com/story/news/2022/03/06/ohio-governor-candidate-nan-whaley-makes-pitch-sandusky-democrats/9389465002/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Carson",
  "authorUrl": "https://www.thenews-messenger.com/staff/4395782002/daniel-carson/",
  "termIds": [
    1991,
    2605,
    3346,
    6168,
    6169
  ],
  "sentences": [
    "Whaley said she's in favor of repealing House Bill 6, which she called the largest corruption scandal in the state's history, and criticized DeWine's role on the Ohio Redistricting Commission, where he and other members were ordered to appear before the Ohio Supreme Court for a contempt of court hearing for failing to meet deadlines to submit new district maps.",
    "Making sure companies follow through on promises\nShe and Stephens, former mayor of Cleveland Heights, said they were encouraged by Intel's announcement it will invest $20 billion in building two factories, called fabs, in Licking County to make semiconductors and what the company had indicated so far about bringing good-paying jobs to the state.",
    "Whaley talks about challenges she faced as Dayton's mayor\nIn a short time span in 2019, Whaley noted, Dayton faced multiple challenges with a Ku Klux Klan rally, a night of tornadoes that ripped through neighborhoods and a 24-year-old gunman who killed nine people and injured 27 others in a 32-second rampage in a crowded entertainment district.",
    "The Democratic gubernatorial candidate said she had been to 74 of Ohio's 88 counties so far, including Sandusky and Ottawa counties, as she looks to secure her party's nomination and seeks to become the first woman elected governor in Ohio's history.",
    "Peloton broke ground on its Wood County plant in August 2021, with the company touting its goals of employing 2,200 workers, investing $400 million over the next three years and having a $138 million in annual payroll.",
    "Whaley said state government officials need to make sure Intel follows through on its promises, especially given that Ohio incentives provided to the company exceed $2 billion.",
    "That's what the Democratic candidate for governor told supporters Saturday night, as Whaley and running mate Cheryl Stephens visited Fremont for an evening campaign stop.",
    "Whaley said she wants Ohio residents to make enough money at one job to pay a mortgage or rent, pay bills and provide opportunities for their families.",
    "She returned to her time spent as Dayton's mayor as she talked to Sandusky County supporters Saturday about her experience handling tough situations.",
    "She endorsed raising the state's minimum wage to $15 an hour and said state government should focus on doing more to help small businesses in Ohio.",
    "Whaley said the answer for the state can't be that people's kids and grandkids have to move to Columbus to be successful and find good-paying jobs.",
    "FREMONT — Everywhere Nan Whaley goes on the campaign trail, voters tell her they are frustrated and feel ignored by the politicians in Columbus.",
    "Mike DeWine is running for re-election in a crowded Republican primary field that includes Jim Renacci and Joe Blystone.",
    "\"We deserve better than what we're getting,\" Whaley said as she looks to make history in Ohio's governor's race.",
    "Investing in clean energy technologies such as solar and wind power would be a boon to Ohio, Whaley said.",
    "She cited Peloton as a good example of making sure companies follow through on their promises.",
    "Whaley, 46, is running against former Cincinnati Mayor John Cranley in the Democratic primary.",
    "The company abandoned those plans earlier this year after experiencing financial struggles.",
    "Whaley served two terms as Dayton's mayor, as well as two terms as a city commissioner.",
    "\"As mayor, you don't have the luxury of saying, 'that's not our problem,'\" Whaley said.",
    "dacarson@gannett.com\n419-334-1046\nTwitter: @DanielCarson7",
    "\"We deserve better than that in leadership,\" Whaley said.",
    "She also favors more state investment in child care.",
    "Gov."
  ]
}