{
  "id": 15927,
  "mediaId": 8498,
  "date": "2022-03-10",
  "headline": "Ohio Gov. Mike DeWine declines to participate in gubernatorial debate",
  "image": "https://woub.org/wp-content/uploads/2022/03/dewine_strong_ohio_3.jpg",
  "link": "https://woub.org/2022/03/10/ohio-gov-mike-dewine-declines-to-participate-in-gubernatorial-debate/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Annie WU | WKSU",
  "authorUrl": "https://woub.org/post_author_new/annie-wu-wksu/",
  "termIds": [
    4706,
    4200,
    3346,
    2873,
    1991,
    2143,
    259,
    957,
    6474
  ],
  "sentences": [
    "The Ohio Debate Commission, which is hosting two gubernatorial debates on March 29 ahead of the May 3 primary, said in a separate statement, “As it works to inform Ohio voters and constituents in an unprecedented election cycle, the ODC hopes Governor DeWine will reconsider his decision not to participate in this primary election debate.”\nDeWine is the only candidate who has declined to participate in the pre-primary debates in Wilberforce.",
    "DeWine’s campaign spokesman Brenton Temple wrote to the Ohio Debate Commission’s Jill Miller Zimon: “We will respectfully decline the invitation to participate in the Ohio Debate Commission’s Primary debate.” No reason or other information was provided.",
    "The debate for the Democratic candidates for governor, John Cranley and Nan Whaley, is scheduled for the same day and location at 7 p.m, moderated by WVXU “Cincinnati Edition” host Lucy May.",
    "The Republican gubernatorial debate was scheduled to be held at 11 a.m. at CSU’s Robeson Cultural & Performing Arts Center, moderated by Ideastream Public Media’s Rick Jackson.",
    "The Ohio Debate Commission was established in 2018 as a collaboration of media outlets around the state to produce debates for statewide distribution.",
    "Businessman Joe Blystone has confirmed he’ll participate and former U.S. Rep. Jim Renacci is still discussing it with the commission.",
    "The commission is also holding debates on March 28 at Central State for the candidates in the U.S. Senate primaries.",
    "Mike DeWine will not be debating his primary opponents at Central State University later this month.",
    "DeWine did participate in the commission’s debate for governor in October 2018.",
    "This is a breaking story and will be updated as information becomes available.",
    "Ron Hood’s campaign has not responded to email or phone outreach.",
    "< < Back to\nOhio Gov."
  ]
}