{
  "id": 1672,
  "mediaId": 8494,
  "date": "2022-02-18",
  "headline": "The Ohio Democratic Party didn't endorse a gubernatorial candidate but it did endorse others",
  "image": "https://npr.brightspotcdn.com/dims4/default/dd756c7/2147483647/strip/true/crop/1842x967+0+32/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2F66%2F68%2Ff943f08b42e7afbae2f66bf07ae9%2Fscreen-shot-2022-02-17-at-9.29.59%20PM.png",
  "link": "https://www.wksu.org/government-politics/2022-02-18/the-ohio-democratic-party-didnt-endorse-a-gubernatorial-candidate-but-it-did-endorse-others",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "There were endorsements in other key statewide races\nDemocratic U.S. Senate candidate Morgan Harper told the committee she had no illusion that they would endorse her over sitting Congressman Tim Ryan (D-Niles) because he already had a fundraising account with the party and had been renting space at the party’s headquarters.",
    "The chairwoman of the Ohio Democratic Party, Liz Walters, says the executive committee didn't endorse former Dayton Mayor Nan Whaley or former Cincinnati Mayor John Cranley in the gubernatorial race because neither candidate wanted that.",
    "We're confident that our eventual nominee will provide Ohio voters a much better alternative to the failed leadership and corruption coming out of Mike DeWine's Statehouse,\" Walters said.",
    "There had been pressure put on the executive committee not to endorse by two former ODP chairs as well as Ohio College Democrats who issued a statement earlier today.",
    "Hamilton County 1st District Appeals Court Judge Marilyn Zayas and 10th District Court of Appeals Judge Terri Jamison were also endorsed.",
    "“To add an endorsement to this list and distributing mailers for only one candidate would be egregious and un-strategic,” Harper said.",
    "The executive committee also endorsed sitting Ohio Supreme Court Justice Jennifer Brunner in her bid for Chief Justice.",
    "\"We respect Mayor Cranley's and Mayor Whaley's request for the part not to endorse in the governor's race.",
    "And two judges running to be on the Ohio Supreme Court were also endorsed.",
    "Despite Harper's plea, the executive committee endorsed Ryan.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau."
  ]
}