{
  "id": 17217,
  "mediaId": 8379,
  "date": "2022-03-01",
  "headline": "Trump’s Ohio endorsement means more than Portman’s, NBC4 poll finds",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/02/trump-portman-2018.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/your-local-election-hq/trumps-ohio-endorsement-means-more-than-portmans-nbc4-poll-finds/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Orner",
  "authorUrl": "https://www.nbc4i.com/author/ben-orner/",
  "termIds": [
    5581,
    2736,
    2765,
    2482,
    1126,
    1607,
    6077,
    6474
  ],
  "sentences": [
    "“Rob Portman is a nationally renowned conservative leader with a matchless record of delivering conservative results for the State of Ohio.”\nThe campaign exclusively provided to NBC4 two internal polls from this year that gives Portman a 58%-to-33% favorable/unfavorable rating among likely GOP primary voters and also found 51% would be more likely to vote for Timken after Portman’s endorsement, vs. 29% who wouldn’t.",
    "“As (DeWine’s) number is so low at this point in comparison to the undecided number,” Holloway said, “it'll be interesting to see if he actively courts that Trump endorsement going forward to bolster his standing.”\nIn making an endorsement decision in both the governor and senate races, Beck said Trump will look at the polls but also what candidates have said about him since his political rise six years ago.",
    "Trump endorsement may decide Senate race\nEmerson’s poll found Ohio’s GOP senate race has “no clear frontrunner” two months from Election Day, Holloway said, with Mike Gibbons and Josh Mandel on top and “a couple of other candidates that are still kind of in that conversation.”\nThe former president’s endorsement, then, could make a big difference.",
    "“My guess is he will want to make an endorsement in the gubernatorial race because he's not a big fan of Michael DeWine.”\nDeWine supported Trump’s reelection in 2020, but he sometimes distanced himself from Trump’s more controversial policies and actions.",
    "On the Democratic side of both races, Beck noted President Joe Biden is unlikely to endorse, even though gubernatorial candidates Nan Whaley and John Cranley – tied at 16% according to Emerson – need to chip away at the 7 in 10 undecided voters.",
    "“He wasn’t sufficiently supportive of Trump, that was the problem.”\nThe last independent poll of Ohio’s GOP senate race before Portman’s endorsement was a Feb. 8-10 Trafalgar Group survey that had Timken in fifth place with 10%.",
    "The results of Portman’s endorsement contrast with the 62% of voters who told Emerson an endorsement from former President Donald Trump would make them more likely to vote for that candidate in the May 3 election.",
    "But his nod may have hurt Timken more than it helped her, new independent polling commissioned by NBC4 shows, and it’s not Portman’s endorsement in Ohio’s Senate race that matters most – it’s a former president’s.",
    "“That shows that Portman’s endorsement, in comparison to Trump’s endorsement, holds much less weight among the Republican primary electorate,” Emerson’s director of survey operations Isabel Holloway said.",
    "Just 19% of likely GOP primary voters said Portman’s endorsement makes them more likely to vote for Timken, per a late February survey by Emerson College pollsters in partnership with NBC4 and The Hill.",
    "But Portman “doesn’t really matter much anymore” in the primary, Ohio State University political science professor emeritus Paul Beck said, noting declining popularity among conservative Ohio voters.",
    "Rob Portman endorsed Jane Timken two weeks ago in the Republican primary to succeed him, he said he was confident in the former state party chair’s ability to win the primary and general elections.",
    "About the Emerson poll\nBetween Feb. 25 and 26, Emerson College Polling surveyed 410 likely voters in Ohio’s Republican primary using text-to-web, an online panel, and automated phone calls.",
    "Timken was chair of the Ohio Republican Party while Trump was in office, a job that had her “in the trenches fighting” for his agenda, she told Cleveland’s WJW-TV last year.",
    "Portman’s endorsement, though, is not toxic, as the Cincinnati Enquirer reported this month most candidates in the field wanted the retiring senator’s endorsement.",
    "“He remembers these things, and these may come into play as he decides who he is going to endorse, if he endorses anybody.”\nWhat about a Biden endorsement?",
    "“And I think he’s going to make a big impact in this race.”\nOn the same day Portman endorsed Timken, so did Kellyanne Conway, Trump’s former top advisor.",
    "The governor's top two challengers, Canal Winchester farmer Joe Blystone and former Northeast Ohio Congressman Jim Renacci, are running to his right.",
    "Multiple candidates have met with Trump at his home in Florida, and it’s hard to find a TV ad from those candidates that doesn’t mention him.",
    "“Portman may have seen the writing on the wall that his popularity as a senator in Republican circles was declining over time,” Beck said.",
    "JD Vance, for example, has been dinged by other candidates for calling Trump “an idiot” and “reprehensible” before coming around to him.",
    "“Trump has been pretty good in general about not wanting to waste his endorsement on somebody who he doesn't think can win,” Beck said.",
    "For example, Portman’s overall approval fell from 53% in early 2017 to 40% in late 2019, according to pollster Morning Consult.",
    "In the Democratic senate race, Youngstown area Congressman Tim Ryan, who already has the endorsement of Ohio’s Democratic U.S.",
    "The frontrunner’s three challengers are all in the single-digits, and half of likely voters in that race are still undecided.",
    "Hurting some GOP senate candidates, he said, is their reluctance to support Trump in the beginnings of his 2016 campaign.",
    "Emerson’s poll last week, however, found Blystone (20%) and Renacci (9%) are currently splitting the anti-DeWine vote.",
    "I’m the only one that actually delivered results for President Trump,” she said, noting his 8-point win here in 2020.",
    "Timken’s campaign pushed back in a statement, however, saying she is “incredibly proud” to have Portman’s support.",
    "However, more likely voters said they are still undecided (36%) than said they plan to vote for DeWine (34%).",
    "Whether the former president will endorse in either Ohio’s senate or governor primaries is yet to be seen.",
    "Twenty-one percent said it would make no difference, and only 18% said it would make them less likely.",
    "Polls commissioned by campaigns, however, often overly favor the supported candidate and their agenda.",
    "Results were weighted by gender, age, education, race, and region based on 2020 election turnout.",
    "In this Emerson poll about a week after the announcement, Timken is again in fifth but with 6%.",
    "“It's unusual for a president to join in to nomination contests in his own party,” Beck said.",
    "“One thing we know about Trump, unlike voters, is that Trump has a long memory,” Beck said.",
    "That means a result could theoretically lose or gain 9.6% if the poll were done again.",
    "The remaining 43% of respondents said Portman’s endorsement made no difference at all.",
    "“These numbers are a joke,” communications director Mandi Marritt said, in part.",
    "Much of the GOP field has tried to prove they are the most pro-Trump candidate.",
    "Four in 10 of those likely GOP primary voters, however, are still undecided.",
    "Portman’s office did not return a request to comment on the Emerson results.",
    "Twice that number – 38% – said it makes them less likely to vote for her.",
    "“I would obviously welcome President Trump’s endorsement,” she added.",
    "The endorsement questions each have a 4.8-point margin of error.",
    "And it took another hit after Trump lost the presidency in 2020.",
    "“There’s lots of candidates in this race that are all talk.",
    "Senator Sherrod Brown, polled at 31% in Emerson’s results.",
    "COLUMBUS, Ohio (WCMH) – When Ohio U.S. Sen.",
    "We don't know for sure,” Beck said.",
    "But will Trump endorse anyone?",
    "“He may not."
  ]
}