{
  "id": 17646,
  "mediaId": 8379,
  "date": "2022-02-28",
  "headline": "Ohio gubernatorial candidates react to latest poll numbers",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2021/02/ohio-statehouse-generic-2021.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/state-news/ohio-gubernatorial-candidates-react-to-latest-poll-numbers/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Griffin",
  "authorUrl": "https://www.nbc4i.com/author/daniel-griffin/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We are seeing quite a few voters who are undecided, but really, in every metric that we look at, not only how people have decided right now, but from small-dollar doners to endorsements of elected officials and community leaders including Senator Sherrod Brown and counties we visited, they also all make up this, to the poll numbers we have internally, we believe we are winning this primary,” Whaley said.",
    "For an incumbent in a state, in a Republican state, to have somewhere under 40 percent, that’s the trend that we’ve seen, and that shows that Mike DeWine is not approved to be reelected in this primary, come May or June or whenever we end up having the primary.”\nAs for Blystone’s showing, Renacci has a theory.",
    "“He was the only person competing against DeWine and that gave him an advantage.”\nAs part of the NBC4/Emerson/The Hill poll, voters were asked if they approve the job DeWine is doing: 45 percent said yes and 36 percent said no, with numbers showing DeWine’s highest approval rating came from Democrats.",
    "“That included guaranteed jobs that pay $60,000, legalizing marijuana, and providing a $500 dividend to fight inflation that is winning people over and now we are winning people over, so we are very excited to head into the home stretch,” he said.",
    "One of those surprises was how many Ohio voters, getting ready to make important decisions about who will represent them in the United States Senate and in the governor’s office, have no idea who they will support.",
    "On the Democratic side of the race, it’s a statistical dead heat with both former Cincinnati Mayor John Cranley and former Dayton Mayor Nan Whaley both scoring 15.7 percent in the poll.",
    "Both candidates are running for statewide office for the first time, with Cranley saying he believes momentum is on his side because voters are connecting with his plans for Ohio.",
    "COLUMBUS, Ohio (WCMH) – NBC4 is your local election headquarters, and with the primary election fast approaching, we wanted to know what’s on the minds of Ohio voters.",
    "For the Republicans in the governor’s race, Renacci said polling he has seen puts him ahead of Blystone – 23 percent to 20 percent — but still trailing DeWine.",
    "NBC4 teamed up with Emerson College and The Hill for a statewide poll, and while some of the results were expected, others were somewhat surprising.",
    "In the number two spot on the GOP side is newcomer Joe Blystone, with 20 percent of the vote, double the number for former Congressman Jim Renacci.",
    "Whaley recently received the endorsement of sitting Sen. Sherrod Brown, which Cranley said hasn’t moved the needle for his opponent.",
    "Mike DeWine, who has been in politics for four decades, tops the Republican field, pulling in 34 percent of the vote.",
    "“I mean, she’s had that for months now and previous polling showed we were down and now we are even,” Cranley said.",
    "“I think that’s because people want results.”\nFor Whaley, the poll results aren’t the whole story.",
    "However, either way, Renacci believes the results are bad news for the man at the top.",
    "“The trend is that Mike DeWine, the highest we’ve seen him, is at 40 percent.",
    "The lowest we’ve seen him at 32 percent, and the average is about 35 percent.",
    "The highest number of respondents – 36 percent – said they were undecided.",
    "“I will tell you one thing: He got out early,” Renacci said.",
    "In the race for governor, incumbent Gov.",
    "“There is a trend,” he said.",
    "The undecideds: 68 percent."
  ]
}