{
  "id": 17814,
  "mediaId": 8379,
  "date": "2022-02-28",
  "headline": "NBC4 Ohio governor poll: DeWine has big lead; no Democratic frontrunner",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/02/DeWine-Intel-smirk-smile-1.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/your-local-election-hq/nbc4-ohio-governor-poll-dewine-has-big-lead-no-democratic-frontrunner/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Orner",
  "authorUrl": "https://www.nbc4i.com/author/ben-orner/",
  "termIds": [
    0
  ],
  "sentences": [
    "The two are still splitting the anti-DeWine vote, Holloway noted, “which means that voters haven’t coalesced around one of them over DeWine yet.”\nMonday’s poll is the first to include the full four-candidate GOP field, but only one of the 410 likely Republican primary voters Emerson surveyed said they plan to vote for Ron Hood.",
    "“What we did see is a trend that Republican voters were more motivated than Democratic primary voters.”\nOn the Republican side, the only other independent survey was a Trafalgar Group poll with a 3-point error margin that put DeWine ahead 41% to Renacci’s 23% and Blystone’s 20%.",
    "Where those independent voters decide to vote, Holloway said, “is very important.”\nAs for DeWine’s challengers, the Emerson poll shows Blystone, who has no political experience, with an 11-point advantage over Renacci, a five-term Congressman.",
    "“As we get closer towards the election, we use a higher sample size, which allows our margin of error to become smaller.”\nDeWine and his 14-point lead, for example, would easily survive the GOP error margin if he lost 9.6 points.",
    "The Emerson/NBC4 poll of Ohio’s 15th Congressional District race two weeks before last November’s election gave Republican Mike Carey an 11.1-point lead over Democrat Allison Russo with more than 1 in 10 voters still undecided.",
    "About this poll\nBetween Feb. 25 and 26, Emerson College Polling surveyed 723 likely voters – 313 for the Democratic primary and 410 for the Republican primary – using text-to-web, an online panel and automated phone calls.",
    "DeWine, with the support of 34% of likely voters surveyed, holds a 14-percentage-point lead over Canal Winchester farmer Joe Blystone (20%), former Congressman Jim Renacci (9%) and former state Rep. Ron Hood (<1%).",
    "Mike DeWine, whom previous impartial polling pegged as the Republican frontrunner, continues his strong performance, per a late February survey by Emerson College pollsters in partnership with NBC4 and The Hill.",
    "“The margin of error is higher because you’re dealing with such a small subset and we’re looking a couple of months out from the election,” Emerson’s director of survey operations Isabel Holloway said.",
    "COLUMBUS, Ohio (WCMH) – The Republican and Democratic races for Ohio governor show two starkly different primaries, according to a new independent poll commissioned by NBC4 and released Monday.",
    "“I don’t think either one of them have done a lot of advertising statewide.”\nElection implications\nThe Emerson poll is the first independent survey of Ohio’s Democratic governor primary.",
    "The Emerson poll, however, showed more Republican primary voters are currently undecided than voting for DeWine, which Holloway said is unusual when an incumbent governor is running.",
    "And because Emerson found independents were less approving of DeWine than Democrats or Republicans, that explains the cloud of undecided voters hanging over DeWine’s 14-point lead.",
    "Former Dayton mayor Nan Whaley and former Cincinnati mayor John Cranley are tied near 16%, according to Emerson’s polling, but 69% of likely voters are still undecided.",
    "“I don’t think that either Whaley or Cranley are well-known to voters,” Ohio State University political science professor emeritus Paul Beck said.",
    "Poll tracking website FiveThirtyEight gives them an overall A-minus after analyzing 201 polls from 2013 through the 2020 election cycle.",
    "More independents in the Emerson poll, Holloway said, plan to vote in the Republican primary than the Democratic primary.",
    "A poll sponsored by Whaley’s campaign in mid-January gave her a 13-point lead with nearly half of voters still undecided.",
    "“There are voters who choose not to tune into the race until just a couple of weeks before the election,” Holloway said.",
    "The Republican question has a 4.8-point margin of error, and the Democratic question has a 5.5-point margin of error.",
    "As for the Democrats, however, the fact that nearly 7 in 10 likely voters are still undecided is the biggest caveat.",
    "That means a candidate could theoretically lose or gain 9.6% or 11%, respectively, if the poll were done again.",
    "Results were weighted by gender, age, education, race and region based on 2020 election turnout.",
    "The Democratic primary, in comparison, is a wide-open race two months from the May 3 election.",
    "Campaign-sponsored polls, however, often inflate the sponsoring candidate’s performance.",
    "Ohio has “open” primaries, which means voters can pick the party primary they vote in.",
    "Both candidates have positioned themselves ideologically to the right of DeWine.",
    "Carey won by 16.6 points, a result within the poll’s 4.6-point error margin.",
    "Emerson has a long track record as a reliable, impartial pollster.",
    "Beating all candidates, however, were undecided voters at 36%.",
    "He also cautioned that it’s still early.",
    "How reliable is Emerson College?",
    "Sixteen percent were undecided.",
    "Gov."
  ]
}