{
  "id": 1962,
  "mediaId": 8494,
  "date": "2022-02-09",
  "headline": "Marion Mayor Scott Schertzer officially announces run as Democrat for state treasurer",
  "image": "https://npr.brightspotcdn.com/dims4/default/c12efbd/2147483647/strip/true/crop/3696x1941+0+88/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2F72%2F89%2Fcf135d974a49bec93350839ecc2b%2Fscott-schertzer-edited.jpg",
  "link": "https://www.wksu.org/government-politics/2022-02-09/marion-mayor-scott-schertzer-officially-announces-run-as-democrat-for-state-treasurer",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow",
  "authorUrl": "https://www.wksu.org/people/andy-chow",
  "termIds": [
    0
  ],
  "sentences": [
    "\"It could be something as simple as see something, say something, because a lot of these elected officials in Columbus right now, they're very tightlipped and not saying anything about the corruption scandals taking place in our state capital,\" Schertzer said.",
    "Schertzer emphasizes the importance of being a watchdog against corruption, noting the federal bribery investigation that led to the arrest of former House Speaker Larry Householder, a Republican who has pleaded not guilty.",
    "Marion Mayor Scott Schertzer says his time in public office has been focused on \"small town values,\" such as being invested in the community and understanding the needs of people who want opportunities to \"get ahead.\"",
    "The Democrats have a candidate running unopposed in every statewide primary with the exception of the gubernatorial race, which features former Dayton mayor Nan Whaley and ex-Cincinnati Mayor John Cranley.",
    "He later worked for the Secretary of State's Office under Sherrod Brown and the Ohio Treasurer's Office under Mary Ellen Withrow, a fellow Marion County resident.",
    "\"You're going to have a sure thing because I am going to watch every dollar spent, and I'm going to pinch every penny.",
    "A Marion County native, Schertzer graduated from Ridgedale High School before attending the University of Toledo.",
    "Schertzer’s announcement completes the Democratic slate for the five statewide executive offices.",
    "Current Treasurer Robert Sprague (R-Ohio) is also running unopposed in the Republican primary.",
    "He says those are the values he would bring to Columbus, if he were to become state treasurer.",
    "And I'm also going to be on the lookout for corruption,\" Schertzer said.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau."
  ]
}