{
  "id": 2964,
  "mediaId": 2919,
  "date": "2022-02-02",
  "headline": "UPDATE: What to know about Ohio's primary election candidates",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/b58b0c1/2147483647/strip/true/crop/640x336+0+72/resize/1200x630!/quality/90/?url=https%3A%2F%2Fsharing.news5cleveland.com%2Fsharescnn%2Fphoto%2F2017%2F03%2F21%2Fstate_1490135887470_57174600_ver1.0_640_480.jpg",
  "link": "https://www.news5cleveland.com/news/democracy-2020/ohio-politics/what-to-know-about-ohios-primary-election-candidates",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morgan Trau",
  "authorUrl": "https://www.news5cleveland.com/morgan-trau",
  "termIds": [
    4839,
    1819,
    2010,
    2290,
    2765,
    1126,
    6077,
    6474
  ],
  "sentences": [
    "Republicans include State Sen. Matt Dolan, businessman Mike Gibbons, Bill Graham (who seemingly has no social media), former State Treasurer Josh Mandel, businessman Neil Patel, \"citizen candidate\" Mark Pukita, former Chair of Ohio Republican Party Jane Timken and author J.D.",
    "The state's filing deadline for the 2022 primaries is officially closed, meaning only the candidates for state positions that submitted before 4 p.m. on Feb. 2 are going to be on the May 3 ballot.",
    "The businessman alluded to potentially not receiving Trump's stamp of approval, saying that he \"will focus [his] efforts on supporting the candidate that wins President Trump’s endorsement.\"",
    "\"After talking to President Trump we both agreed this race has too many Trump candidates and could cost the MAGA movement a conservative seat,\" he stated in a press release Thursday.",
    "COLUMBUS, Ohio — Just one day after the state's filing deadline for the 2022 primaries, entrepreneur Bernie Moreno has ceased his campaign for U.S. Senate on Thursday evening.",
    "U.S. Senate\nRob Portman's seat in the U.S. Senate is up for grabs this year, as the politician has decided not to re-run since he took office in 2011.",
    "Along with Ryan, the democrats running are attorney Morgan Harper, tech executive Traci Johnson and \"non-traditional candidate\" Tinsley LaShondra.",
    "Former state representative John Adams and podcaster and alleged conspiracy theorist Terpsehore Maras are on the primary ballot.",
    "The Democratic ticket has two candidates: Former Mayor of Cincinnati John Cranley and former Mayor of Dayton Nan Whaley.",
    "Republican Pat DeWine, Republican Pat Fischer , Democrat Terri Jamison and Democrat Marilyn Zayas will be on the ballot.",
    "However, if your favorite isn't on the list, House Bill 93 allows for congressional candidates to file up until March 4.",
    "He will eventually face off against Democrat Nelsonville City Auditor Taylor Sappington, who is also running unopposed.",
    "Democrat Chelsea Clark, a Forest Park city council member, will be up against the winner of the Republican primary.",
    "The candidates are central Ohio farmer Joe Blystone, former State Rep. Ron Hood and former U.S. Rep. Jim Renacci.",
    "With Moreno dropping out on Thursday evening, eight Republicans and four Democrats are vying for the position.",
    "A conversation with former President Donald Trump is the key to Moreno's reasoning, the former candidate said.",
    "Chief Justice\nDemocrat Justice Jennifer Brunner will run against Republican Justice Sharon Kennedy.",
    "Treasurer\nRepublican Treasurer Robert Sprague will also be running unopposed in the May elections.",
    "Justice\nTwo Republicans and two Democrats are running for three Ohio Supreme Court justice seats.",
    "Mike DeWine is running for reelection, but he will face off in the primary against three others.",
    "Moreno also exclaimed that Republicans need to stop U.S. Rep. Tim Ryan from winning the seat.",
    "Secretary of State\nThree Republicans and one Democrat are running for Secretary of State.",
    "Attorney General\nRepublican Attorney General Dave Yost will run unopposed in the primary.",
    "In the general, he will campaign against Democratic State Rep. Jeff Crossman.",
    "Republican Frank LaRose, the incumbent, is running against two others.",
    "He will then face off against Democrat Marion Mayor Scott Schertzer.",
    "Here is who filed, according to the Secretary of State's office.",
    "Auditor\nRepublican Auditor Keith Faber will run unopposed.",
    "More contenders may be on the ballot.",
    "Governor\nIncumbent Republican Gov.",
    "Vance."
  ]
}