{
  "id": 3105,
  "mediaId": 8354,
  "date": "2022-01-31",
  "headline": "Democrat Taylor Sappington, an underdog from southeast Ohio, is running for state auditor",
  "image": "https://www.gannett-cdn.com/presto/2020/10/31/NCOD/0347b17a-dfae-45b0-bf48-6e601f008438-nelsonville_future_JB_10.JPG?crop=3967,2232,x0,y1190&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/local/2022/01/31/democrat-taylor-sappington-running-ohio-state-auditor/9256345002/",
  "mediaOutlet": "lancastereaglegazette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Céilí Doyle",
  "authorUrl": "https://www.dispatch.com/staff/5793699002/cil-doyle/",
  "termIds": [
    0
  ],
  "sentences": [
    "Mounting a recount:Nelsonville rejects census population loss, finds 700 more residents in recount to regain city status\nThe self-described family man said he owes his moral clarity, and hardworking attitude, to his mom, Amy Hawk, who raised him and his brother Spencer in a trailer on a hill just outside of Nelsonville.",
    "Currently, there are two Democrats campaigning for governor, former Cincinnati Mayor John Cranley and former Dayton Mayor Nan Whaley and two others, state Rep. Jeff Crossman, and Forest Park City Council member Chelsea Clark running for attorney general and secretary of state, respectively.",
    "Taylor Sappington: Getting message out to Ohio voters\nWhile Sappington is a mostly unknown name among Ohio Democrats, his previous run against state Rep. Jay Edwards, R-Nelsonville, during the 2018 midterms garnered him a New York Times Opinion profile, if not a win.",
    "Sappington says he's running on the promise of transparency, honesty and accountability with the track record to prove it, despite lacking traditional qualifications: a law degree, accounting degree or previous experience holding office above the municipal level.",
    "\"You can't fix something with what broke it,\" Sappington said of his opponent, Faber, who was elected in 2018, implying that Faber has inadequately investigated the Akron-based FirstEnergy corruption scandal that has embroiled the Ohio Republican Party.",
    "Taylor Sappington: Ohio Democrats are uniting behind my bid for auditor\nDespite his previous frustrations with the Ohio Democrats, Sappington said there is unity across the party in support for his bid and a moral pang to get rid of \"corrupt officials.\"",
    "Last midterm season, Ohio Democrats had candidates for all five statewide executive offices: governor, secretary of state, attorney general, treasurer and auditor a year and a half ahead of the election.",
    "Wilson was convicted of felony charges for her scheme to steal hundreds of thousands of dollars from the city and sentenced in December 2020 to nearly five years in prison, according to The Athens News.",
    "\"I’m running because of these games and this culture of corruption has become so entrenched and so expected across Columbus and the state that they almost take it for granted,\" Sappington said.",
    "Southeast Ohio champion:'We're not going to accept mediocrity': Fighting for Nelsonville's future\nSappington, at 30, is one of the youngest candidates to run for statewide office in Ohio.",
    "His first day on the job, Dec. 1, 2019, he opened an investigation into Deputy Auditor Stephanie Wilson after recognizing disparities in payroll and direct deposit forms.",
    "\"My Appalachian upbringing, close relationship to my family, being taught right and wrong, I think, makes this candidacy and election different,\" he said.",
    "At the heart of Sappington's desire to run for state auditor is a resilient commitment to making sure government serves the people who elect them.",
    "His loss to Edwards, due to lacking both a combination of union and organizational support from his party, is in the past, however.",
    "We take our duty to investigate people who are lying, stealing, cheating very seriously and we have a proven record of doing so.\"",
    "\"My main concern for the next 10-11 months, and in the office afterwards, is do the voters have the information they need?\"",
    "As Nelsonville's city auditor Sappington has taken that philosophy in dealing with the town's own corruption scandal.",
    "\"I'm proud of our office,\" Faber said, disputing Sappington's assertion he hasn't done enough to combat corruption.",
    "The Democratic candidate running for state auditor against incumbent Republican Keith Faber this fall.",
    "Faber has the advantage in almost every way: fundraising, name recognition and political experience.",
    "Céilí Doyle is a Report for America corps member and covers rural issues in Ohio for The Dispatch.",
    "\"I want everyone to know there are folks who actually care what’s right and wrong,\" he said.",
    "\"Do they realize their futures are being stolen from them because of these corrupt deals?\"",
    "Your donation to match our RFA grant helps keep her writing stories like this one.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "Please consider making a tax-deductible donation at https://bit.ly/3fNsGaZ.",
    "He's also the first openly LGBTQ candidate to run statewide.",
    "But this cycle has proved more difficult to fill.",
    "\"It's not the same race,\" Sappington said.",
    "An ardent champion of Nelsonville, Ohio.",
    "A southeast Ohioan, born and raised.",
    "Taylor Sappington is many things.",
    "A working-class Democrat.",
    "A municipal city auditor.",
    "\"We do really good work.",
    "And most recently?",
    "A proud gay man.",
    "he added."
  ]
}