{
  "id": 3683,
  "mediaId": 8413,
  "date": "2022-01-19",
  "headline": "With U.S. Supreme Court decision looming, abortion access in Ohio is on the ballot",
  "image": "https://www.gannett-cdn.com/presto/2021/10/02/NTAN/f0de1706-839b-4911-9d81-98bf6ffcb6c5-AGS_rallyforabortionjustice_024.JPG?crop=3599,2025,x0,y366&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/01/19/election-2022-roe-v-wade-uncertainty-makes-abortion-key-primary-issue/9106039002/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    0
  ],
  "sentences": [
    "Jason Williams:Why abortion could be key in 2022 Ohio Democratic gubernatorial primary between Cincinnati, Dayton mayors\nEMILY's List put it more bluntly: \"Cranley is seeking to gloss over his prior anti-abortion statements with the hope that Ohio voters will forget about his past.",
    "Since taking office, DeWine has signed bills to ban abortion as early as six weeks gestation, to require aborted fetuses be buried or cremated, to prevent medication abortions via telemedicine and to add rules that could shutter two Southwest Ohio abortion clinics.",
    "Sadly, with his pick of pro-choice Sen. Teresa Fedor, we no longer could consider his candidacy.”\nCranley recently announced Fedor as his running mate, a move that could help to shore up his support with those wary of his pro-abortion access credentials.",
    "\"I would not be standing next to John Cranley as governor and running as his lieutenant governor candidate if he wasn’t pro-choice, period,\" said Fedor, citing recent actions like Cincinnati joining a legal brief in opposition to the Mississippi ban.",
    "The Right to Life Action Coalition of Ohio rescinded its endorsement of DeWine in November 2020 over his appointment of Acton, a polarizing leader early in the COVID-19 pandemic, and the governor's short-lived pick Dr. Joan Duwve.",
    "The coalition also criticizes DeWine for allowing abortion clinics to remain open amid the COVID-19 pandemic when the state health department halted elective surgeries and closed many businesses as part of its stay-at-home order.",
    "But DeWine didn't offer a resounding endorsement of the bill, instead saying in a recent interview: \"I think it's wise for us, prudent for us, to wait until we have instructions from the United States Supreme Court.\"",
    "\"We all know that reproductive freedom is on the ballot this year, and it's very likely that Roe v. Wade is going to be repealed by the Supreme Court,\" Cranley said while announcing Fedor as his running mate.",
    "\"Given everything that’s happening both at the U.S. Supreme Court and Ohio Statehouse, we need a passionately and proactively pro-choice governor,\" said Kellie Copeland, executive director of Pro-Choice Ohio.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "\"And when we face Mike DeWine and Jon Husted or Jim Renacci in the fall, they're going to have to confront my lieutenant governor who, if they had their way, she or her doctors would be in jail.\"",
    "He's never wavered, never once in his entire political career,\" said Mike Gonidakis, president of Ohio Right to Life, which has not yet endorsed a candidate in the GOP primary.",
    "Former U.S. Rep. Jim Renacci's running mate, Joe Knopp, reiterated that criticism: “The church I attend in Dayton, Ohio, is two miles down the road from the abortion clinic.",
    "And the stakes are high as the U.S. Supreme Court reviews a Mississippi abortion ban that could send decisions about when and where abortion is permitted back to the states.",
    "Even Gonidakis with Ohio Right to Life said the organization \"briefly considered\" endorsing Cranley in the Democratic primary \"based on his long-standing pro-life beliefs.",
    "Former Cincinnati Mayor John Cranley, a Catholic who once labeled himself \"pro-life,\" now says he would be \"the pro-choice governor that Ohio needs now more than ever.\"",
    "\"I don’t think there’s a time when it’s been more important to the citizens in Ohio,\" said Molly Smith, past president of the Right to Life Action Coalition of Ohio.",
    "If ever there was a time for ideological purity on abortion, it's now because of the looming U.S. Supreme Court decision, advocates on both sides of the issue said.",
    "A judge ruled that doctors could determine on a case-by-case basis whether a surgical abortion was necessary, for example, to protect the patient's health or life.",
    "They praised Whaley's consistent advocacy on the issue and her defense of the Dayton area abortion clinic, which has frequently been in the state's crosshairs.",
    "Duwve served as a volunteer coordinator for Planned Parenthood for seven months in the 1980s – a detail conservatives quickly cited as a disqualifying factor.",
    "Advocates for abortion access, including Pro-Choice Ohio and EMILY's List, have endorsed Cranley's primary opponent, former Dayton Mayor Nan Whaley, instead.",
    "To prepare for the high court's ruling, abortion opponents are pushing for a \"trigger law\" that would ban abortion in Ohio if Roe v. Wade were overturned.",
    "As the landmark abortion decision Roe v. Wade hangs on by a legal thread, access to abortion in Ohio could depend on who holds the governor's pen next.",
    "He argued in the 2014 Hobby Lobby case that businesses shouldn't have to provide birth control under Obamacare that violates their religious beliefs.",
    "But GOP challengers are trying to paint DeWine as soft on the issue for decisions like selecting Dr. Amy Acton, a Democrat, as his health director.",
    "Several abortion clinics have closed in recent years, leaving six that offer surgical abortions and another three that offer medication abortions.",
    "In the early 2000s, Cranley voted with Republicans on Cincinnati City Council to exclude most abortion coverage from city health insurance plans.",
    "And as Democratic voters look at their gubernatorial options this spring, Whaley is happy to remind them: \"Abortion is on the ballot in 2022.\"",
    "And Cranley is trying to boost his \"pro-choice\" credentials with running mate Sen. Teresa Fedor, who has consistently backed abortion access.",
    "During an emotional debate on the House floor in 2015, Fedor shared that she had an abortion after she had been raped while in the military.",
    "We know the truth: John Cranley is as much a threat to abortion access and reproductive health care as Ohio’s Republican General Assembly.\"",
    "That has led to a heightened focus on abortion access in both the GOP and Democratic primaries for governor – but for different reasons.",
    "I wasn’t able to attend my church during COVID, however, the abortion clinic was open the entire time and that was his responsibility.\"",
    "“Take all the right to life organizations that don’t have a conflict and they all rescinded the right to life endorsement,\" he said.",
    "Still, Renacci pointed to the rescinded endorsement as proof that DeWine could be doing more to close abortion clinics in Ohio.",
    "Meanwhile, former Dayton Mayor Nan Whaley is pointing to Democratic challenger John Cranley's history of \"pro-life\" stances.",
    "Ohio reported 20,605 abortions in 2020, a 3% increase from the previous year, according to Ohio Department of Health data.",
    "After Ohio Attorney General Dave Yost ordered several clinics to halt \"nonessential\" abortions, the clinics sued.",
    "As governor and in his past political posts, DeWine has been a reliable supporter of abortion restrictions.",
    "The fight over who is pro- or anti-abortion access enough couldn't be starker than in the primary races.",
    "An arbitrator ruled in 2004 that the ban violated the city's union contract, the Enquirer reported.",
    "Before that, he led an investigation into Planned Parenthood as the state's attorney general.",
    "On the other side of the political aisle, a different battle is being waged over abortion.",
    "Mike DeWine has a history of signing every abortion restriction that crosses his desk.",
    "Voters will decide whether that's enough to overcome Cranley's history on the topic.",
    "\"Prior to him running, this is not an area where he has been active,\" Copeland said.",
    "Noted feminist Gloria Steinem, a Toledo native, endorsed the Cranley-Fedor ticket.",
    "Many abortion restrictions in Ohio do not have an exception for rape or incest.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "But DeWine's opponents say he hasn't done enough to restrict abortion in Ohio.",
    "DeWine's team has dubbed him as \"the most pro-life governor in Ohio history.\"",
    "Abortion clinics were open in Ohio because of a federal judge's order.",
    "Copeland called Fedor a \"phenomenal advocate\" for abortion access.",
    "\"This is not an area where he’s spoken out and been supportive.\"",
    "Dr. Bruce Vanderhoff now leads the Ohio Department of Health.",
    "I think our endorsement is going to hold a lot of water.\"",
    "\"You stand with those who have been with you.\"",
    "\"Mike DeWine has always been there on life.",
    "Is Cranley pro-abortion access enough?",
    "\"It’s going to be very, very topical.",
    "Is DeWine anti-abortion enough?",
    "Gov."
  ]
}