{
  "id": 4718,
  "mediaId": 8455,
  "date": "2022-04-20",
  "headline": "Gloves politely come off in Democratic gubernatorial debate",
  "image": "https://www.toledoblade.com/image/2022/04/20/600x_q90_a4-3_cTCjpg/img-1498-jpg.jpg",
  "link": "https://www.toledoblade.com/local/politics/2022/04/20/gloves-politely-come-off-in-democratic-gubernatorial-debate/stories/20220420109",
  "mediaOutlet": "The Toledo Blade",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Provance",
  "authorUrl": "",
  "termIds": [
    2121,
    2143,
    3346,
    2605,
    392,
    6474,
    6104,
    6077,
    6060
  ],
  "sentences": [
    "...I'm the only candidate in this race that can literally say my growth record is better than Ohio’s.”\nHe was not oblique, however, in his latest statewide ad comparing the two cities that he contends are ”heading in two very different directions.” The ad argues that Cincinnati made an economic and population comeback under Mr. Cranley's leadership while Dayton declined on both fronts under Ms. Whaley.",
    "He also suggested that Ms. Whaley's connection with the Ohio Progressive Collaborative, a voter registration nonprofit entity that didn't reveal its donors, would make her less effective in criticizing Mr. DeWine and the “dark money” bribery scandal at the Statehouse involving FirstEnergy Corp. that led to passage of a $1 billion nuclear power plant bailout.",
    "Mr. Cranley pushed his plan to legalize and tax recreational marijuana to help finance infrastructure development and job creation as well as his proposals to provide an Alaska-like energy dividend of $500 a year to Ohio families earning less than $75,000 a year.",
    "On the Republican side, Mr. DeWine faces challenges from three people coming at him from the right — former northeast Ohio U.S. Rep. Jim Renacci, Columbus area cattle farmer and businessman Joe Blystone, and former state Rep. Ron Hood, of Ashville.",
    "He cut taxes by $3.6 billion for all Ohioans, won the largest chip manufacturing plant in the world, and is creating a record number of jobs, all while balancing the budget.”\nThere has been no GOP gubernatorial debate.",
    "... We need a leader on this issue in the governor's seat, not someone passive.”\nMr. Cranley, a Catholic, said he changed his position after he and his wife dealt with fertility issues more than a decade ago.",
    "COLUMBUS — The gloves came off on Wednesday — politely — as the two Democratic former mayors of major southwest Ohio cities set out to explain why they are better situated to do battle this fall against Gov.",
    "But this time the two took aim at each other, usually without directly naming the other, to put more daylight between their records and often similar positions less than two weeks ahead of the May 3 primary.",
    "Both criticized Mr. DeWine for signing a law doing away with Ohio’s requirement that someone carrying a concealed handgun first get a permit and undergo the training and background checks that go with it.",
    "Ms. Whaley, in turn, directly questioned Mr. Cranley's commitment to protecting abortion rights given the threat to Roe vs. Wade before the U.S. Supreme Court and his more recent conversion on the issue.",
    "Reached after the debate, DeWine campaign spokesman Tricia McLaughlin said, “While these Democrat politicians are busy jockeying to be the Biden of Ohio, Governor DeWine is busy bettering the state.",
    "The FBI has not implicated Mr. DeWine in the scandal, but the investigation has brought it close to his office, leading to the resignation of Sam Randazzo, his appointed chief utilities regulator.",
    "“I do believe that we have to have an accounting of any income that we receive from a dark money group especially when [House Bill] 6 is the biggest issue facing this general election.",
    "As of the close of business on Friday, 22,795 Republicans and 21,336 Democrats had already cast ballots, according to figures supplied by the Secretary of State Frank LaRose's office.",
    "Mr. Cranley repeatedly and directly made the argument that his record as mayor of Cincinnati was better than Mr. DeWine's statewide and obliquely better than Ms. Whaley's in Dayton.",
    "Former Dayton Mayor Nan Whaley and former Cincinnati Mayor John Cranley still saved the vast majority of their criticism for the current governor, as with last month's debate.",
    "Mr. Cranley's running mate is state Sen. Teresa Fedor (D., Toledo) while Ms. Whaley has picked Cuyahoga County Councilman Cheryl Stephens as her would-be lieutenant governor.",
    "This occurred after he’d failed to convince fellow Republicans in the General Assembly to pass gun access reforms following the 2019 mass shooting in Ms. Whaley’s city.",
    "Ms. Whaley promoted her proposals to raise the minimum wage to $15 an hour, invest in small business and union jobs, and reduce prescription drug costs for seniors.",
    "The two concurrently served as mayors of their respective cities, leaving office early this year as they headed into the heat of this campaign against each other.",
    "“When they become places to break the law, to make the FBI call the state the most corrupt statehouse in the country, that is very, very different,” she said.",
    "“Winning on that issue is obviously critical.”\nMs. Whaley said the nonprofit worked to help people to register to vote and she is proud of her work with it.",
    "One had been planned for last month, but it fell apart after Mr. DeWine declined an invitation from the non-partisan Ohio Debate Commission.",
    "They had been colleagues working on state and federal issues affecting cities while on the Ohio Mayors Alliance.",
    "“We're glad that Mayor Cranley has come to the fold a few months before running for governor..,” she said.",
    "“Mike DeWine is known, and his record is disastrous,” Mr. Cranley said at the Columbus Metropolitan Club.",
    "“I wish he was on the front lines with us when we were trying to save the Cincinnati clinic.",
    "... We need someone that's going to be unequivocal in the governor's seat to protect it.",
    "Ohioans have been voting for more than two weeks in the May 3 primary election cycle.",
    "He vowed that he would block any attempt to erode abortion rights as governor.",
    "My career is synonymous with increasing the size of Cincinnati's middle class.",
    "“His whole career has coincided with the shrinking of Ohio's middle class.",
    "Early and absentee midterm voting has been light so far.",
    "Mike DeWine, whom they assume will be the nominee.",
    "First Published April 20, 2022, 5:57pm",
    "We could have used his help.",
    "This is a super key issue.",
    "Roe is going to fall.",
    "..,” he said."
  ]
}