{
  "id": 6265,
  "mediaId": 8507,
  "date": "2022-04-13",
  "headline": "Gov candidate John Cranley unveils plan to boost summer school to fix COVID learning loss",
  "image": "https://www.gannett-cdn.com/presto/2022/03/30/PCIN/7b9d585e-0be4-4ba2-bd1c-586992af11b7-03292022_GovDemDebate_MV_0032.JPG?crop=2999,1687,x0,y152&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/04/11/ohio-democrat-wants-billions-covid-relief-universal-summer-school/7273670001/",
  "mediaOutlet": "zanesvilletimesrecorder.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Staver",
  "authorUrl": "https://www.dispatch.com/staff/5802228002/anna-staver/",
  "termIds": [
    2605,
    3346,
    392,
    967,
    1438,
    6035,
    6104,
    6474
  ],
  "sentences": [
    "How to pay for it\nOhio schools and the state Department of Education received a combined $7.9 billion in federal COVID-19 relief and had spent about 21% as of Feb. 28, according to data from the U.S. Department of Education.",
    "Summer school plan\nCranley's plan would require all Ohio school districts to offer a free, six-week summer school program to all eligible students – even those who attend private or community schools.",
    "Anna Staver is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Former Cincinnati Mayor John Cranley, one of the Democrats looking to be Ohio's next governor, proposed spending federal recovery dollars on free summer school for all Ohio school children.",
    "Introduced by Republican Sen. Bill Blessing and signed into law in December, the law required districts to submit their learning loss solutions to the Ohio Department of Education.",
    "Students in Ohio and across the country have fallen behind academically during the pandemic, and lawmakers of all political persuasions want to get them back on track.",
    "\"Last year when a lot of districts were offering expanded summer school classes, I didn’t really hear about local districts having problems,\" DiMauro said.",
    "Attendance by both teachers and students would be optional, but the schools would have to provide transportation as well as free breakfast and lunch.",
    "That didn't include any local costs districts might incur such as bonuses or incentives to lure teachers back to their classrooms.",
    "But Ohio Education Association President Scott DiMauro didn't think finding teachers for summer classes would be a huge issue.",
    "What schools are already doing\nMost public schools offer summer enrichment programs, but they can come at a cost to parents.",
    "\"We’ve got a lot of money sitting around...,\" said Stephen Dyer, a former state representative and education policy analyst.",
    "Canton City Schools, for example, reported that 60-65% of students who sign up for summer school consistently show up.",
    "\"Maybe I’m completely wrong, but (the districts) fight us whenever there is a mandate on anything,\" Blessing said.",
    "The plans could include summer school as well as longer days, tutoring and extended school years, Blessing said.",
    "\"I believe this is a moral imperative, and we have the money to do it,\" Cranley said during a press call Monday.",
    "DiMauro said letting schools localize their options and requiring a free summer school both have merit.",
    "Cranley is running for the Democratic nomination for governor against former Dayton Mayor Nan Whaley.",
    "He estimated the program would cost about $740 million if every K-12 public school student attended.",
    "\"I don't see this as a particularly divisive or controversial issue, which is kind of refreshing.\"",
    "Correction: An earlier version of this article incorrectly stated the credentials of Stephen Dyer.",
    "\"We have a moral obligation to do everything we can to help these students,’’ Cranley said.",
    "\"We don’t expect that 100% of families would take advantage of this option,\" Cranley said.",
    "But he's hoping to capture the one in four students who were chronically absent last year.",
    "\"I think there's a need to come up with as many solutions as possible...,\" DiMauro said.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "Other districts are taking similar steps partly because of Senate Bill 229.",
    "Canton Repository reporter Kelli Weir contributed reporting to this story.",
    "As for universal summer school, Blessing wasn't opposed to offering it.",
    "Still, the district plans to offer even more classes this summer.",
    "But they don't necessarily agree on the solutions.",
    "\"We can afford to do six weeks of summer school.\"",
    "\"There was a lot of latitude in the language.\"",
    "Though he wanted to see the details first.",
    "\"All we need is the political will.\"",
    "Attendance isn't a given either.",
    "We regret the error."
  ]
}