{
  "id": 6304,
  "mediaId": 8497,
  "date": "2022-04-13",
  "headline": "Voter guide: Ohio governor candidates",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/vote-pic-1535499397.png?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-election-candidates-primary-vote-governor-8th-congressional-district-senate/39716253",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Full Tax Reform: Some of the priorities in this section include eliminating income tax over 10 years and moving Ohio to a Consumption Tax\nMake Ohio A Sanctuary for Freedom: Renacci’s website says he wants to make Ohio a sanctuary state for Second Amendment rights, against oppressive taxations, federal overreach and illegal immigration.",
    "Running mate: Current Chief Executive Officer of the East Akron Neighborhood Development Corporation\nHere are the issues Whaley is prioritizing in her campaign:\nJobs: Per her website, Whaley is committed to investing in companies that invest in Ohio and revitalizing Ohio communities by bringing back Main Street businesses.",
    "Running mate: Iraq War Veteran Jeremiah Workman\nHere are the issues Blystone is prioritizing in his campaign:\nUphold State Sovereignty: Per his website, Blystone says he wants to preserve state sovereignty in spite of any encroachment from the federal government.",
    "Running mate: Current State Senator Teresa Fedor\nHere are the issues he wants to tackle if elected:\nCreating 120k Middle Class Jobs: Cranley’s website states he has a plan to create these jobs in his first term; 30,000 jobs per year paying a minimum of $60,000.",
    "Universal Broadband Internet & WiFi: Per his website, Cranley has a plan to get every corner of the state connected to high-speed internet & WiFi\nCleanup Water, Fix Pipes & Lower Sewer Bills: Promising to clean up major water bodies and state parks.",
    "Capitalizing on Energy Assets: Supports making Ohio an energy state by using its oil and gas resources\nRestore the American Dream: Supports keeping young people and retirees in the state and creating an environment for entrepreneurship.",
    "Running mate: Christian film producer Joe Knopp\nRenacci’s website lists his positions as supporting Pro-life, Second Amendment, Freedom, Family, Faith, Education Choice, Law Enforcement, Border Security & Election Integrity.",
    "Creating Jobs in Ohio: DeWine’s website says he’s committed to bringing manufacturing jobs back to the state and has prioritized career, technical & vocational education to help thousands of Ohioans enter the workforce.",
    "Ethics: Whaley says she’s committed to restoring public trust by creating a public accountability commission, bolstering funding to agencies upholding ethics and holding administration and appointees accountable.",
    "Jim Renacci – Hometown: Monongahela, Pennsylvania\nCommitment 2022: Jim Renacci campaigns for Ohio governor\nJim Renacci formerly served as Ohio’s Representative for the 16th Congressional District from 2011-2019.",
    "Education Reform: Supports eliminating Common Core and Critical Race Theory, redirection money to early education and restoring control to local school districts by reducing Ohio’s Department of Education.",
    "Democrat:\nJohn Cranley\nNan Whaley\nJohn Cranley – Hometown: Green Township, Ohio\nCommitment 2022: John Cranley campaigning for governor\nJohn Cranley served as the Mayor of Cincinnati from 2013 to 2022.",
    "Here are the priorities he wants to tackle if elected:\nState Spending Freeze: If elected, Renacci’s website states he wants to request spending reduction of 10%-15% over the first 12 months in office.",
    "Reduce Poverty & Increase Access to Community College & Training: Cranley promising to help people land their first job by offering $1,000 as incentive to learn skills and associate degrees.",
    "Make Affordable Health Care Accessible: Per his website, Cranley wants to open new rural health centers and make health care benefits portable for workers to take with them from job to job.",
    "Running Mate: Current Lieutenant Governor Jon Husted\nWinning Historic Investment for Ohio: His website touts the Intel Semiconductor Factory project as a major achievement in this category.",
    "Also wants to make school buildings technology hubs\nExpand Clean Energy: If elected, Cranley’s website says he will generate 1,300 new jobs per year while doing good for the planet.",
    "Candidates for Ohio’s Gubernatorial Race\nRepublican:\nJoe Blystone\nMike DeWine\nJim Renacci\nJoe Blystone – Hometown: East Liverpool, OH\nJoe Blystone founded the Blystone Farm in 2004.",
    "Protect Civil Rights, Human Rights & Equal Opportunity: Cranley promising to sign a n executive order on his first day in office preventing discrimination in state employment.",
    "Criminal Justice Reform: Plans to shift funding from prisons to addressing poverty and mental illness, decriminalizing marijuana and helping increase police accountability.",
    "Nan Whaley – Hometown: Mooresville, Indiana\nCommitment 2022: Nan Whaley campaigning for Ohio governor\nNan Whaley served as the mayor of Dayton, Ohio from 2014-2022.",
    "Enacting the largest tax cut in history: The website claims DeWine has cut taxes by more than $2 billion, calling it one of the largest tax cuts in state history.",
    "Stand for Health Autonomy: Blystone says he is committed to supporting an individual’s right to make their own medical decisions without government interference.",
    "Energy Dividend for Ohio’s Families: Per his website, Cranley wants to start an annual energy dividend of $500 to families earning less than $75,000 oer year.",
    "Decentralizing State Assets in Columbus: Supports redistributing state institutions throughout the state bringing more economic activity to other cities.",
    "The website also says he tightened the state budget when the COVID-19 pandemic first started and issued millions in funds to help businesses stay afloat.",
    "Reproductive Health: Promising to veto any legislation limiting abortion access and is committed to reducing high infant and maternal mortality rates.",
    "He does not support Critical Race Theory, Transgender Men competing in Women’s Sports, Common Core, Pay for Play, Mandated Masks & Mandated Vaccines.",
    "Cranley has previously run for election to Ohio’s 1st Congressional District race in 2000 and 2006 against current U.S. Representative Steve Chabot.",
    "DeWine’s website does not highlight the issues he’s prioritizing in this campaign, instead he has listed accomplishments during his tenure.",
    "Supercharge Small Business Growth: Promises to provide incentives to make it easier to create small businesses and train new employees.",
    "Eliminate Medicaid Expansion: Supports rolling back expansion and ensuring funds are used only for elderly, the disabled and children.",
    "Senator from 1995-2007, Ohio Lieutenant Governor from 1991-1994, U.S. Representative from 1983-1991 and State Senator from 1981-1982.",
    "Energy Independence: Cranley’s website says he wants to attract manufacturing companies that need access to cheap, reliable energy.",
    "Restore Good & Honest Government: If elected, Cranley says he’s committed to making it easier to prosecute corrupt politicians.",
    "DeWine’s website also states his commitment to Ohioans’ gun rights, like Constitutional Carry, and First Amendment Rights.",
    "Its website describes its function as an interactive way of educating the community about the importance of agriculture.",
    "Preserve the Sanctity of Life: Blystone’s website says he will fight to preserve every life from conception to death.",
    "Fighting Crime: His website says he is committed to supporting law enforcement and combating the opioid epidemic.",
    "The website lists the Heartbeat Bill & Born Alive Infant Protection Act specifically as support for this claim.",
    "Education: Committed to strengthening K-12 schools, making preschool universal and higher education affordable.",
    "Manage State Spending & Shrink the Tax Burden: Per his website, Blystone says he knows how to cut overspending.",
    "Capitalize on Ohio’s Assets: Renacci’s website lists Ohio’s lake & riverfronts and national parks as assets.",
    "Fix Roads, Bridges & Infrastructure: Promising to prioritize transportation improvements across the state.",
    "Proposes a state infrastructure bank that combines funding from federal, state, local and private funding.",
    "Protect the Second Amendment: Blystone is committed to preserving the Second Amendment rights for Ohioans.",
    "Bolster Election Integrity: If elected, Blystone says he will work to ensure elections are free and fair.",
    "Improve PreK-12 Education: If elected, Cranley promises to expand early learning options for children.",
    "Protecting Ohio Families: DeWine’s website claims he’s “the most pro-life governor” in state history.",
    "Environment: If elected, Whaley wants to repeal laws that gutted Ohio’s renewable energy standards.",
    "Rein in Big Tech: Blystone promises to protect Ohio’s economy and Ohioans First Amendment rights.",
    "Renacci previously ran for U.S. Senate in 2018 against current Democratic Senator Sherrod Brown.",
    "Families: Whaley’s website says she’ll fight for paid family leave for all Ohioans, if elected.",
    "DeWine delivers State of the State Address for 2022\nMike DeWine is the incumbent in the race.",
    "Veterans: If elected, Whaley is committed to ensuring the needs of veterans in Ohio are met.",
    "In 2005 she was elected to the Dayton City Commission and served on it for two terms.",
    "Wipe Out Corruption: Supports more transparency and oversight in local governments.",
    "He also helped set up the OneOhio Foundation, which helps fight the opioid crisis.",
    "The farm is located in Canal Winchester, Ohio and is described as locally sourced.",
    "Abortion: Whaley’s website says she will work to defend Ohioan’s right to choose.",
    "In 2020, Renacci was drafted to serve as the Chairman of the Medina County GOP.",
    "State Pension Reform: Proposing to base retirement pension on better terms.",
    "DeWine says this puts Ohio on the frontlines of the U.S.-China tech fight.",
    "COLUMBUS, Ohio —\nA major race in Ohio this year, is the one for Governor.",
    "Blystone also created the non-profit Blystone Farm AG Community in 2019.",
    "He has previously served as Ohio’s Attorney General from 2011-2019, U.S.",
    "He was also a member of the Cincinnati City Council from 2000 to 2009.",
    "He has also previously served as a two-term mayor of Wadsworth, Ohio.",
    "She was one of the youngest women ever chosen for a commission seat.",
    "Whaley is also president of the United States Conference of Mayors.",
    "He claims Ohio is overtaxing its citizens and overspending.",
    "The field includes three Republicans and two Democrats.",
    "Mike DeWine – Hometown: Yellow Springs, Ohio\nGov.",
    "He has served as Ohio’s governor since 2019."
  ]
}