{
  "id": 6651,
  "mediaId": 8497,
  "date": "2022-04-13",
  "headline": "Election guide 2022: Who's running for office in Ohio?",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/vote-1558388089.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-election-candidates-primary-vote-governor-senate-8th-congressional-district/39652215",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    4839,
    4306,
    5581,
    2290,
    2736,
    980,
    1489,
    6077,
    6474
  ],
  "sentences": [
    "The field includes two (or three) Republicans and two Democrats\nRepublican:\nJoe Blystone\nMike DeWine\nJim Renacci\nDemocrat:\nJohn Cranley\nNan Whaley\nOHIO'S 8TH CONGRESSIONAL DISTRICT\nOhio’s 8th Congressional District is up for grabs this year as well.",
    "Here's who's running for Senate:\nRepublican:\nMatt Dolan\nMike Gibbons\nJosh Mandel\nJane Timken\nJD Vance\nDemocrat:\nMorgan Harper\nTraci (TJ) Johnson\nTim Ryan\nOHIO GOVERNOR'S RACE\nAnother major race in Ohio this year, is the one for Governor.",
    "This means that during the May 3 primary, contests to nominate candidates for State Representative, State Senate, and State Central Committee will not appear on the ballot.",
    "That announcement set off a highly competitive race to fill the seat and could very well reshape the battle for control of the U.S. Senate.",
    "The Secretary of State has directed Boards of Elections to proceed with the May Primary despite ongoing disputes over the maps.",
    "Ahead of the primary, we created a voter guide to help you learn more about the candidates running for office.",
    "The winners of the Republican and Democrat primaries in May will face off in the General Election in November.",
    "But, in case you haven't heard - a map-making mess in Columbus has caused the primary to be split in two.",
    "OHIO SENATE CANDIDATES\nRepublican Ohio Senator Rob Portman announced his retirement in January of 2021.",
    "There are five candidates on the Republican side, and three on the Democrat side.",
    "COLUMBUS, Ohio —\nWe are less than one month away from Ohio's May 3 primary.",
    "Both candidates are Republicans but find themselves on the opposite sides.",
    "Sen. Portman’s retirement triggers a statewide primary to take his seat.",
    "The date for the other primary is still to be named.",
    "Two candidates are squaring off for the seat.",
    "Candidates:\nWarren Davidson\nPhil Heimlich"
  ]
}