{
  "id": 7174,
  "mediaId": 2537,
  "date": "2022-03-31",
  "headline": "Ohio Politics Explained podcast: Debate disagreements and disabled parents",
  "image": "https://www.gannett-cdn.com/presto/2022/01/18/NCOD/82da8eab-2096-4314-a555-4ac34d87a04a-Ohio_Redistricting_Commission_KWR_03.jpg?crop=2499,1406,x0,y17&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/04/01/ohio-politics-podcast-senate-debates-redistricting-and-cash-bail/7223587001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Staver",
  "authorUrl": "https://www.dispatch.com/staff/5802228002/anna-staver/",
  "termIds": [
    5185,
    3346,
    2381,
    2605,
    1489,
    6474
  ],
  "sentences": [
    "Those on the left highlighted their differences on issues like Medicare for all and adding justices to the U.S. Supreme court while the seven Republicans debated border security and the false claim that the 2020 election was stolen.",
    "That's why state lawmakers are working on a bipartisan piece of legislation to prohibit courts and child placing entities from \"using a person’s disability as a reason to deny or limit that person’s care for a minor.\"",
    "4) Parenting with a disability\nParents with disabilities say Ohio courts rule against them in custody cases not because they have harmed their children but because of misguided beliefs about how they might.",
    "He's proposing a constitutional amendment that would allow public safety to be considered when it comes to bail amounts in addition to the current factors such as severity of the crime and flight risk.",
    "The attorney general suggested amending the state constitution, Ohio governor and Senate candidates debated, and parents with disabilities claimed family court judges don't listen to them.",
    "On Tuesday, the two Democrats who want to be Ohio's next governor stood at the podiums, and we got a preview of what the fall general election campaign might look like.",
    "Opponents, which include the conservative Buckeye Institute, say judges have a multitude of options for protecting the public including denying bail all together.",
    "The USA TODAY Network Ohio Bureau serves The Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "3) A constitutional amendment on cash bail\nOhio Attorney General Dave Yost wants to give judges a little more latitude when it comes to setting bail.",
    "2) Surprise maps\nThe Ohio Redistricting Commission paid a set of independent mapmakers to come up with a fourth set of state House and Senate maps.",
    "It's a podcast from the USA TODAY Network Ohio Bureau where we catch you up on the state's political news in 15 minutes or less.",
    "1) Debate-apalooza\nThe Democratic and Republican candidates for U.S. Senate took the stage at Central State University Monday.",
    "But when the time came to adopt those boundaries, the Republicans pulled out a different set of maps and voted 4-3 for those.",
    "But Republicans said the independent mapmakers produced districts that had problems with compactness and divided communities.",
    "House Minority Leader Allison Russo, D-Upper Arlington, called the process \"a complete farce.\"",
    "Listen to \"Ohio Politics Explained\" on Spotify, Apple, Google Podcasts and TuneIn Radio.",
    "We break down what it all means on this week's episode of Ohio Politics Explained.",
    "The episode is also available by clicking the link at the top of the article.",
    "Ohio got a surprising fourth set of state House and Senate maps this week.",
    "This week, host Anna Staver was joined by reporter Haley Bemiller.",
    "The three debates were produced by the Ohio Debate Commission.",
    "Mike DeWine on public corruption and gun control.",
    "Nan Whaley and John Cranley both hit Gov."
  ]
}