{
  "id": 7784,
  "mediaId": 2540,
  "date": "2022-04-03",
  "headline": "Why Democrats are desperate to prove Ohio isn't a lost cause",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220401153253-tim-ryan-debate-0328-super-tease.jpg",
  "link": "https://www.cnn.com/2022/04/03/politics/ohio-democrats-midterms-economic-message/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Bradner",
  "authorUrl": "https://www.cnn.com/profiles/eric-bradner",
  "termIds": [
    0
  ],
  "sentences": [
    "\"There's a lot of reasons that Sherrod wins, and one of them is similar to the reason Donald Trump won Ohio: In states like this where it's a competitive state that has begun to tilt one direction, voters value authenticity more than anything,\" said Justin Barasky, a Democratic strategist who managed Brown's 2018 campaign and is advising Ryan's Senate bid.",
    "DeWine, the Republican governor who has been in office for nearly 40 years -- first as a local prosecutor and then state legislator, then as a member of the US House, then Ohio's lieutenant governor, then the US Senate, and finally back to Ohio as attorney general before being elected governor in 2018 -- faces GOP competition in his bid for a second term.",
    "But they also offered a glimpse at a strategy that could help Democrats win the state's suburban regions, casting DeWine and Republicans as too extreme on social issues -- particularly hammering DeWine's decision to sign into law a measure passed by the Republican-led legislature that allows concealed carry of firearms without a license.",
    "In 2020, Joe Biden became the first person to win the presidency without winning Ohio since 1960 -- effectively ending Ohio's bellwether status, though it had been clear for several election cycles that Ohio was no longer the tipping-point state that would push a presidential candidate over 270 electoral votes.",
    "Lambasting Republicans in statehouses for overreaching on social issues is part of Democrats' strategy across the midterm map, with party operatives looking for ways to turn the GOP's focus on issues that animate a base still devoted to Trump against Republicans in the general election.",
    "In a gubernatorial debate at Central State University the day after the Senate candidates debated, the two Democratic candidates vying to take on DeWine, former Dayton Mayor Nan Whaley and former Cincinnati Mayor John Cranley, focused on jobs, rather than DeWine's pandemic management.",
    "Wilberforce, Ohio (CNN)Desperate to prove Ohio isn't a lost cause, Democratic candidates for governor and an open Senate seat are attempting to steer clear of culture wars and tap into a vein of economic populism that has eluded them in the increasingly red state in recent decades.",
    "\"Ohio has to lead the way in bringing our supply chain back, taking on China, building the things that will build our future,\" he said in his opening remarks at a Monday debate at Central State University, a historically Black university in Wilberforce, Ohio, east of Dayton.",
    "Ohio's urban areas favor Democrats, but cities like Cincinnati and Columbus don't provide the huge margins that the party's candidates receive in the urban counties in nearby Pennsylvania and Michigan, where Democrats have consistently won statewide contests in recent years.",
    "It's a response to the pressure he faces from the right: Former US Rep. Jim Renacci and farmer and business owner Joe Blystone are campaigning on criticism of DeWine's handling of the pandemic, saying the measures he took to close schools and businesses early went too far.",
    "In 2018, he dramatically outperformed the rest of the Democratic statewide ticket: Brown won reelection by 7 percentage points, while DeWine won the governor's office and down-ballot Republicans won statewide offices by about 4 percentage points.",
    "\"Among independents and suburban swing voters, people want the economy to be good and they don't want to live in this really conservative state that is focused on social issues that don't affect their day to day life that much,\" Pickrell said.",
    "Ryan is traveling to rural, heavily Republican areas of the state frequently ignored by Democrats, trying to stop the party's bleeding there after years of Republicans racking up enormous margins of victory in those counties.",
    "Brown has survived while other Midwestern Democrats have lost in part because, over decades in public life, he has cultivated a working-class-focused brand that's helped by his raspy voice and rumpled appearance.",
    "Rob Portman's retirement, along with the gubernatorial race, will offer the latest test of whether Democrats can still win in the Buckeye State -- or whether Ohio's battleground status will continue to fade.",
    "He pitches himself as a Democrat in Brown's mold, and tells crowds that while he disagreed with Trump on a number of issues, he supported the renegotiation of the North American Free Trade Agreement.",
    "But Ryan, the 10-term congressman from Youngstown who in 2016 challenged Nancy Pelosi for the House speakership and launched a short-lived 2020 Democratic presidential campaign, is trying.",
    "\"The Sherrod Brown model is the model to win in Ohio,\" said Aaron Pickrell, a veteran Ohio Democratic strategist and a leader of Obama's winning 2008 and 2012 efforts in the state.",
    "In the debate Monday, Harper criticized Ryan for previously receiving an \"A\" rating from the National Rifle Association and for taking campaign money from defense contractors.",
    "Still, Ryan is the clear favorite, with a massive financial advantage: He ended 2021 with $5 million his campaign's bank account, more than 10 times what Harper had on hand.",
    "Former President Donald Trump's 8-point victories in Ohio in 2016 and 2020 underscored just how far Democrats had slid, particularly in the state's White, rural areas.",
    "Meanwhile, two former mayors are competing for the Democratic nomination for a governor's race that would likely pit the primary winner against incumbent Gov.",
    "But in his first television ad of the primary season this week, he pushed the other way, highlighting his efforts to re-open Cleveland schools in early 2021.",
    "So chipping away at the GOP's dominance in Ohio's rural counties is critical, Democratic strategists said, to returning the state to competitive status.",
    "He's a frequent visitor in Ohio's union halls, and has made stories about his family's working-class roots a staple on the campaign trail.",
    "DeWine emerged early in the coronavirus pandemic as among the leading governors advocating public health measures to slow the pandemic.",
    "Morgan Harper, an attorney and former senior adviser to the Consumer Financial Protection Bureau, has challenged Ryan from the left.",
    "Rep. Tim Ryan is the leading candidate to take on whoever emerges from a packed, acrimonious seven-person Republican Senate primary.",
    "He has centered his campaign on an argument for policies that would force corporations to \"start cutting workers in on the deal.\"",
    "But tapping into economic anxiety to convey how you're going to help Ohioans address their economic anxiety is the way to win.\"",
    "\"Tim's learning what people care about, people are talking about him being there, he's talking to the press while he's there.",
    "\"It is us versus China, and instead of taking them on, Washington is wasting our time on stupid fights,\" Ryan says in the ad.",
    "That allowed Ryan to launch a $3.3 million ad buy this week -- with his first 30-second spot focused solely on China.",
    "Still, Ryan has a primary challenge to overcome in May before he can focus on the winner of a seven-way GOP primary.",
    "She said Congress should cancel student loan debt and expand the Supreme Court -- positions Ryan did not embrace.",
    "\"Never in my worst nightmare did I think the thing he was going to do was to actually make it worse,\" she said.",
    "However, those high-profile victories obscured a much bleaker reality in the state for the Democratic Party.",
    "\"They know every time they hear from Sherrod Brown that they're getting an authentic person,\" Barasky said.",
    "Those candidates have largely honed in on a similar approach: Focus almost exclusively on jobs and wages.",
    "\"They know why he's doing what he's doing, who he's fighting for, that he's in it for the right reasons.",
    "Whaley pointed to DeWine's pledge to \"do something\" after a 2019 mass shooting left nine dead in Dayton.",
    "CLARIFICATION: An earlier version of this story misstated the campaign Barasky is advising.",
    "Every corner of Ohio, people are going to know Tim's looking out for him,\" Pickrell said.",
    "But, strategists say, the appeal of Trump and Brown in Ohio isn't just their message.",
    "It's an economic message that carries unmistakable echoes of both Trump and Brown.",
    "Defend workers and union rights, and hammer away at China and free trade deals.",
    "Stay out of the culture wars that are animating the Republican base.",
    "Former President Barack Obama won the state in both 2008 and 2012.",
    "This year, the open-seat Senate race created by Republican Sen.",
    "No other Democrat has won statewide office here since 2006.",
    "In their own ways, both strike voters as authentic figures.",
    "For better or worse, they believe it about Trump, too.\"",
    "That brand is difficult to build in one election cycle.",
    "It hasn't been long since Democrats last won in Ohio.",
    "And in 2018, Sen. Sherrod Brown won his third term.",
    "\"I will not compare Sherrod Brown to Donald Trump.",
    "Ryan, 48, was first elected to Congress in 2002.",
    "It is Ryan's current Senate bid.",
    "Mike DeWine."
  ]
}