{
  "id": 4816,
  "mediaId": 8322,
  "date": "2022-04-23",
  "headline": "Former President Trump addresses supporters at Ohio rally",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/04/GettyImages-1233676526.jpg",
  "link": "https://www.foxnews.com/politics/former-president-trump-addresses-supporters-ohio-rally",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kyle Morris",
  "authorUrl": "https://www.foxnews.com/person/m/kyle-morris",
  "termIds": [
    0
  ],
  "sentences": [
    "In addition to remarks from Trump, other Republicans running for election in the state were set to speak at the event being held at the Delaware County Fairgrounds ahead of the state’s May 3 primary.",
    "\"Frank is dedicated to Secure Elections – the most important work he can do – with every legal vote counted, no ballot harvesting, and all votes counted on Election Day,\" Trump said of LaRose's work.",
    "Rivals Mike Gibbons, Jane Timken and Josh Mandel — all advised and endorsed by at least some Trump-world regulars — sparred with Vance and each other about whose support for Trump was more genuine.",
    "OHIO TRUMP RALLY: FORMER PRESIDENT'S BACKING MAY ‘PROPEL VANCE TO VICTORY,’ INDICATE POWER OF HIS ENDORSEMENT\nTrump's visit to the state comes after his endorsement of Ohio Senate candidate J.D.",
    "The event was slated to include speeches from Vance and Rep. Mike Carey, R-Ohio, as well as congressional candidates Max Miller and Madison Gesiotto Gilbert.",
    "The former president backed Vance for the GOP Senate nomination in Ohio after top candidates jockeyed for his support for months.",
    "Prior to the rally on Saturday, Trump announced his endorsement of Ohio Secretary of State Frank LaRose for reelection.",
    "\"Heading to Ohio for a big rally tonight, great crowd,\" Trump said in a statement before the event.",
    "Former President Donald Trump addressed supporters at a rally in Delaware, Ohio, on Saturday night.",
    "The announced speakers have all received a Trump endorsement.",
    "Fox News' Tyler Olson contributed to this article.",
    "\"See you there!\"",
    "Vance."
  ]
}