{
  "id": 6061,
  "mediaId": 6428,
  "date": "2022-04-18",
  "headline": "GOP Predicts a 'Pink Wave' of Republican Women Heading to Congress This Fall",
  "image": "https://www1.cbn.com/sites/default/files/republicanelephant_hdv_0.jpg",
  "link": "https://www1.cbn.com/cbnnews/politics/2022/april/gop-hopes-to-take-back-congress-with-partys-rising-stars",
  "mediaOutlet": "CBN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tara Mergener",
  "authorUrl": "https://www1.cbn.com/profiles/mergener-tara",
  "termIds": [
    2714,
    4327,
    4396,
    4905,
    1477,
    1126,
    1433,
    392
  ],
  "sentences": [
    "I have voters saying I must decide whether I have gas in my car or eggs for my children,\" said U.S. House candidate Cassy Garcia (R-TX)\nMore than 280 GOP women have filed to run for Congress, beating 2020's historic high.",
    "\"When you look at what President Trump was able to do in both '16 and '20 in terms of changing minds and bringing people into the party who had never voted Republican, swinging those independent votes.",
    "Amid soaring inflation, high gas prices, and numerous other crises including Ukraine, polls show President Biden's approval is in free fall – along with his party.",
    "\"We are seeing Republicans continue to build on what they see as the small but growing influence on the black community,\" said Julia Manchester of The Hill.",
    "While Democrats tout the diversity within their ranks, the GOP also believes it's poised to put a record number of black Republicans in Congress.",
    "\"This is something that Republicans are very much trying to use to connect to all voter groups, but especially black voters,\" said Manchester.",
    "\"I am running against a man who combined with Joe Biden has been in office for 89 years,\" said U.S. House Candidate Liz Joy (R-NY).",
    "Recent polls show strong party alignment with the black community on issues like abortion, education, and immigration.",
    "Thanks for the 2022 momentum goes largely to representative Elise Stefanik who is the third ranking House Republican.",
    "E-PAC is supporting 18 candidates so far this round, in what it calls the most diverse and impressive roster to date.",
    "That's a lot of what we plan to do as well,\" said U.S. House candidate Madison Gesiotto Gilbert (R-OH).",
    "That's one word some analysts use to describe what lies ahead for Democrats in the November midterms.",
    "\"After the 2018 midterms we were down to 13 Republican women and in just one cycle we were over 30.",
    "Each Republican who flipped a Democrat-held House district in 2020 was a woman or person of color.",
    "Help us continue to be a voice for truth in the media by supporting CBN News for as little as $1.",
    "Republicans sense momentum and hope to ride a possible red tidal wave to a Capitol Hill majority.",
    "Optimism is growing that 2022 will be the year these history-makers will become majority makers.",
    "Winsome Sears' historic victory in Virginia as the first woman of color to win statewide office.",
    "Polling shows the number of black voters favoring democrats down 21 points since last fall.",
    "If polling proves true, 2022 will be a game changer thanks to black Republicans and women.",
    "Stefanik created E-PAC, the Elevate Political Action Committee, to get more women elected.",
    "It's a goal likely to be helped by the fierce headwinds facing the current party in power.",
    "We are committed to delivering quality independent Christian journalism you can trust.",
    "Surveys also show the GOP's warning about rising crime and the economy is resonating.",
    "\"This is going to be a pink wave,\" said U.S. House candidate Morgan Ortagus (R-TN).",
    "33 got elected that year, flipping 11 of the 15 seats that went from blue to red.",
    "I predict we'll be over 50 Republican women in the next Republican Congress.",
    "Party leaders are touting another year of the Republican woman only bigger.",
    "\"Voters are frustrated by what they are seeing on the border, inflation...",
    "They are pro-family and that's where the Republican voters are today.",
    "Backers are hoping there's still wind in the sails following Lt. Gov.",
    "But it takes a lot of hard work, time, and money to do what we do.",
    "The GOP is only five seats shy of regaining control in the House.",
    "\"They are going to focus on standing up for conservative values.",
    "Right now, black republicans hold just two seats in the house.",
    "That’s why we view every news story through the lens of faith.",
    "Several candidates are endorsed by former President Trump.",
    "Some 80 black candidates are running this cycle.",
    "So far, E-PAC has raised more than $3,000,000.",
    "That's where this county is,\" said Stefanik.",
    "God is everywhere—even in the news.",
    "Think about that,\" said Stefanik.",
    "They are strongly pro-life.",
    "Did you know?",
    "Bloodbath."
  ]
}