[
  {
    "id": 11082,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "James Lankford, Tim Scott)\nNew PACs\nAMERICANS FOR PROTECTING LIBERTY (Super PAC)\nBIG RED LEADERSHIP PAC (Super PAC)\nCalifornians for Freedom (PAC)\nDEFENDING FREEDOM PAC (Super PAC)\nIndiana Leads PAC (Hybrid PAC)\nLEADERSHIP FOR INDIANA PAC (Super PAC)\nLEHIGH VALLEY ACTION (Leadership PAC: <span class='selected-term'>Lisa Scheller</span>)\nOK SENATE REPUBLICAN NOMINEE FUND 2022 (PAC)\nTake It Back Virginia PAC (Super PAC)\nNew Lobbying Registrations\nAcg Advocacy: Irell & Manella, LLP On Behalf Of Vlsi Technology, LLC\nAkin Gump Strauss Hauer & Feld: Barlow Respiratory Hospital\nAlpine Group Partners, LLC.",
    "author": "",
    "title": "Top GOP Rules staffer heading back to K Street"
  },
  {
    "id": 11096,
    "mediaId": 2553,
    "date": "2022-03-16",
    "sentence": "The second round of candidates in the program include Tom Barrett in Michigan’s 7th Congressional District, Scott Baugh in California’s 47th Congressional District, Juan Ciscomani in Arizona’s 6th Congressional District, John James in Michigan’s 10th Congressional District, Jen Kiggans in Virginia’s 2nd Congressional District, Tyler Kistner in Minnesota’s 2nd Congressional District, <span class='selected-term'>Lisa Scheller</span> in Pennsylvania’s 7th Congressional District and Alek Skarlatos in Oregon’s 4th Congressional District.",
    "author": "Charlotte Pence Bond",
    "title": "McCarthy Announces Recent Additions To GOP ‘Young Guns’ Program"
  },
  {
    "id": 10726,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "New Joint Fundraisers\n<span class='selected-term'>Lisa Scheller</span> Victory Fund (Scheller for Congress, Inc., Lehigh Valley Action, NRCC)\nMajority Conservative Fund (Rep. Kevin McCarthy, Majority Committee PAC MC PAC)\nTeam Brandon Victory Committee (BRANDON FOR CONGRESS NY22, Central New York PAC)\nNew PACs\nAmerica First P.A.C.T.",
    "author": "",
    "title": "House Democrats press Pelosi, DeLauro on fate of small business aid"
  },
  {
    "id": 9282,
    "mediaId": 8322,
    "date": "2022-03-27",
    "sentence": "Stefanik also offered her endorsement to April Becker, a small business owner and lawyer for Nevada’s 3rd Congressional District; <span class='selected-term'>Lisa Scheller</span>, a small business owner, for Pennsylvania’s 7th Congressional District; Monica De La Cruz, a small business owner, for Texas’ 15th Congressional District; and Jeanine Lawson, vice chair of the Virginia Railway Express Operations Board and chair of the Innovation Owner’s Association Board of Directors, for Virginia's 10th Congressional District.",
    "author": "Brooke Singman",
    "title": "Stefanik says becoming a mother made her 'more effective leader,' says moms in Congress 'on a mission'"
  }
]