{
  "id": 14028,
  "mediaId": 8283,
  "date": "2022-03-20",
  "headline": "Letters to the Editor",
  "image": "https://www.gannett-cdn.com/-mm-/3bb1af07cdfc0eb08b746b4b04642f9b736c5d46/c=0-149-680-531/local/-/media/2017/04/20/Chillicothe/B9327262776Z.1_20170420162626_000_G4QI4AT26.1-0.jpg?width=680&height=382&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.chillicothegazette.com/story/opinion/2022/03/20/letters-editor/7053517001/",
  "mediaOutlet": "chillicothegazette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chillicothe Gazette",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Evan Corzine\nChillicothe\nU.S Air Force Veteran\nGibbons is the one concerned our money\nOur national debt continues to grow every second and I can’t sit back and watch from the sidelines any longer as my hard earned money is spent recklessly by our federal government.",
    "There are many candidates to pick from in this year’s primary, but Mike Gibbons is the only one who is legitimately concerned about the value of the U.S. dollar disappearing and has the experience and knowledge to fix this mess.",
    "Instead of focusing on our southern border crisis and other emergencies happening here in the U.S., our government quietly directed funds to their allies abroad.",
    "Unfortunately, I have recently learned that the Asset and Infrastructure (AIR) commission has made a recommendation to ultimately close the Chillicothe campus.",
    "Rural veterans already struggle to access care due to the nature of our geography and we should be striving to increase that access to care, not inhibit it.",
    "With the open Senate seat in Ohio, it’s the responsibility of the people to really know each candidate and elect someone who won’t sell out once in office.",
    "Last year alone, the leaders we are supposed to trust wasted $52 billion on foreign construction projects including the construction of border walls….",
    "Currently, our national debt is just under $30 trillion dollars, which is truly an unfathomable amount of money that no one can actually comprehend.",
    "The care I have received at the Chillicothe facility has always been top-notch and it would be a tremendous loss for our community to see it go.",
    "However, this recommendation to close should still concern every veteran and family member of a veteran that receives care in our community.",
    "Urging the community to contact representatives about VA\nI write this as a veteran who receives care at the Chillicothe VA Medical Center.",
    "I encourage any concerned members of the community to write your representative in Congress and protest these recommendations.",
    "The market assessment used different metrics to determine which VA facilities would be upgraded, downsized or even closed.",
    "I urge all readers to really do their research so we can put in an authentic and trustworthy candidate this fall.",
    "It is important to understand that these are only recommendations at this time and not a final decision.",
    "The economic implications of the loss of good-paying jobs for the area is also a serious concern.",
    "This in itself is a major concern and calls for a new era of leaders who put America first.",
    "That’s why I’m supporting businessman Mike Gibbons in his bid for U.S. Senate this spring.",
    "Recently there was a market assessment conducted on VA facilities all across the country.",
    "I trust Mike Gibbons with his successful background in something other than politics.",
    "Yet corrupt politicians in D.C. keep spending away, and it needs to stop.",
    "in the Middle East and North Africa.",
    "Julie Lambert\nChillicothe"
  ]
}