{
  "id": 1439,
  "mediaId": 2540,
  "date": "2022-02-15",
  "headline": "2021: The year scientists became a political football",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/211214114231-pills-covid-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/15/politics/medicine-politics-covid-vaccine/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    2187,
    2684,
    3217,
    1126,
    687,
    6678
  ],
  "sentences": [
    "“Current ratings of medical scientists and scientists have now fallen below where they were in January 2019, before the emergence of the coronavirus.”\nIt’s hard not see a connection between these falling numbers and some Republicans’ ongoing attempts to portray the medical community – with Dr. Anthony Fauci as its face – as beholden to a liberal agenda when it comes to dealing with Covid-19.",
    "At the tail end of the 2020 campaign, Donald Trump referred to Fauci as a “disaster.”\nThe vilification of Fauci – who has served under seven presidents, including four Republicans – is part of a broader anti-science movement within the GOP.",
    "“This gap is greater than the gaps between racial and ethnic groups, people with varying education levels, people who are insured and uninsured, different age groups, or people who live in rural versus urban areas,” the report read.",
    "Roughly 3 in 10 (29%) of Americans said they had a “great deal” of trust in medical scientists “to act in the best interests of the public,” according to Pew’s latest survey, which was conducted in late 2021.",
    "“I know Mike Gibbons will join me in demanding that Fauci is immediately fired and removed from office.”\nGeorgia GOP Rep. Marjorie Taylor Greene and others have been pushing for Fauci to be fired for months.",
    "CNN —\n2021 was the year of one of the greatest medical accomplishments in modern history: The rollout of Covid-19 vaccines to hundreds of millions of people across the globe.",
    "Last November, a Kaiser Family Foundation analysis found that unvaccinated adults were more than three times as likely to lean Republican as they were to lean Democratic.",
    "In short: Which political party you belong to is the best predictor of whether or not you are vaccinated against a virus that has now killed more than 923,000 Americans.",
    "“Public confidence in both groups had increased shortly after the start of the coronavirus outbreak,” Pew wrote in an analysis of the new data.",
    "In both April and November 2020, 39% of Americans said they had a “great deal” of trust in all scientists to act in the public interest.",
    "Fauci, the director of the National Institute for Allergy and Infectious Diseases, has become cannon fodder for Republican campaign ads.",
    "It was also a year in which Americans’ faith in science – and scientists – plummeted, a new report from the Pew Research Center finds.",
    "The Point: The politicization of science – and scientists – has, without question, led to unnecessary deaths from this virus.",
    "That’s why I’m endorsing Mike Gibbons for Senate,” Sen. Rand Paul (R-Ky.) says in a TV ad for Ohio Republican Mike Gibbons.",
    "“I’ve stood strong against the mandates of Dr. Fauci, but I need help.",
    "That number is down from 40% in November 2020 and 43% in April 2020.",
    "The public has also lost faith in scientists more broadly.",
    "That trend shows up most directly in vaccination rates.",
    "By the end of 2021, that number dipped to just 29%.",
    "And that is an utter disgrace."
  ]
}