{
  "id": 2337,
  "mediaId": 2629,
  "date": "2022-02-04",
  "headline": "Praised By Republican Presidents, Fauci Is Now Target Of GOP Attack Ads",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTI0NTc5NS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3ODQ3Mjg4OX0.P8Mr7ngtlsdrXG3cLEBClgU-O-rk29NMKc3w0ag8D6E/img.jpg?width=1200&coordinates=0%2C38%2C0%2C39&height=600",
  "link": "https://www.nationalmemo.com/fauci",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.nationalmemo.com/u/alexhenderson",
  "termIds": [
    0
  ],
  "sentences": [
    "I know Mike Gibbons will join me in demanding that Fauci is immediately fired and removed from office.”\nOz’s ad, meanwhile, finds him saying, “The big government medical establishment came after me because I dared to challenge Fauci on COVID.”\n“Anthony Fauci has been a GOP target for nearly two years, as the party cast the president’s chief medical adviser as a villain for pandemic-era policies,” Murray explains.",
    "Fauci, the director of the National Institute of Allergy and Infectious Diseases, is appearing in spots across the airwaves this week as primary elections take shape and Republicans seek to tap into his unpopularity with the GOP base.”\nIn 2008, President George W. Bush was praising Fauci for working hard to save lives.",
    "“For his determined and aggressive efforts to help others live longer and healthier lives,” Bush declared, “I'm proud to award the Presidential Medal of Freedom to Dr. Anthony S. Fauci.”\nBut that was before the Trumpification of the GOP and before Fauci was demonized by the far-right MAGA movement.",
    "The poll surveyed 2005 registered voters from January 28-30.”\nThe 81-year-old Fauci has served in the United States government since the late 1960s, and he was appointed director of NIAID under President Reagan in 1984.",
    "In an article published by Politico on February 4, reporter Stephanie Murray stresses that an abundance of Republican ads are trying to fire up the GOP base with anti-Fauci messaging.",
    "Ron DeSantis to Dr. Mehmet Oz — who is running for the U.S. Senate seat presently occupied by Sen. Pat Toomey in Pennsylvania — to Mike Gibbons, a U.S. Senate candidate in Ohio.",
    "Meanwhile, 41 percent of Democrats said Fauci was doing an ‘excellent’ job in his handling of the pandemic — compared to just six percent of Republicans.",
    "“Fauci is a particularly useful foil for GOP candidates in primaries because of Republican hostility toward his performance,” Murray observes.",
    "“Sixty-two percent of Republicans said Fauci was doing a ‘poor’ job handling the pandemic, according to a new Politico/Morning Consult poll.",
    "In Gibbons’ ad, Sen. Rand Paul of Kentucky declares, “I’ve stood strong against the mandates of Dr. Fauci, but I need help.",
    "It was under the younger President Bush, in fact, that Fauci received the Presidential Medal of Freedom Award in 2008.",
    "Republican presidents of the past welcomed Dr. Anthony Fauci’s expertise, from Ronald Reagan and George H.W.",
    "Anti-Fauci messages in Republican ads, Murray notes, are coming from everyone from Florida Gov.",
    "In 2022, demonizing him is a way for MAGA Republicans to prove their street cred.",
    "“Now, he’s emerging as a star in Republican campaign commercials.",
    "That’s why I’m endorsing Mike Gibbons for Senate.",
    "Bush to his son George W. Bush."
  ]
}