{
  "id": 2528,
  "mediaId": 2658,
  "date": "2022-02-04",
  "headline": "Fauci might as well be running for office",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-pulse/2022/02/04/fauci-might-as-well-be-running-for-office-00005582",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2684,
    2523,
    3217,
    3356,
    3016,
    5695,
    1440,
    503
  ],
  "sentences": [
    "Follow us on Twitter\nTucker Doherty @tucker_doherty\nDan Goldberg @dancgoldberg\nErin Banco @ErinBanco\nKatherine Ellen Foley @katherineefoley\nLauren Gardner @Gardner_LM\nBen Leonard @_BenLeonard_\nRachael Levy @rachael_levy\nDavid Lim @davidalim\nMegan Messerly @meganmesserly\nAlice Miranda Ollstein @aliceollstein\nSarah Owermohle @owermohle\nCarmen Paun @carmenpaun\nMegan R. Wilson @misswilson\nFollow Us",
    "“I was shocked to find out that the CMS proposed a national coverage determination that severely restricts Medicare coverage for a whole class of Alzheimer’s treatments,” ranking member Cathy McMorris Rodgers (R-Wash.) said, speaking during a hearing on the FDA’s user fee agreement reauthorization by the House Energy and Commerce Health Subcommittee.",
    "FIRST IN PULSE: HASSAN PUSHES FOR MORE WOMEN SURGEONS — Sen. Maggie Hassan (D-N.H.) has put a call out for more female doctors — and asks the American College of Surgeons what it’s doing “to reduce gender disparities in patient outcomes and improve the career pipeline for female surgeons,” according to a letter the senator wrote to the group.",
    "“But I haven’t made a final decision on that yet and don’t intend to until the administration appears to be truly ready to push his name forward.”\nNames in the News\nKimberlee Trzeciak, chief health adviser for the House Energy and Commerce Committee, is moving to the FDA as the associate commissioner for legislative affairs.",
    "Maggie Hassan asks the American College of Surgeons to share what it’s doing to get more women into medicine\n—HHS issues new civil rights guidance to health care providers for the public health emergency\nWELCOME TO FRIDAY PULSE — I’m Rachael Levy, a new reporter on POLITICO’s powerhouse health team, filling in for Sarah.",
    "Fauci might as well be running for office\nBy RACHAEL LEVY\n02/04/2022 10:00 AM EST\nPresented by\nWith Megan Messerly, Katherine Foley and Lauren Gardner\nEditor’s Note: POLITICO Pulse is a free version of POLITICO Pro Health Care's morning newsletter, which is delivered to our subscribers each morning at 6 a.m.",
    "The guidance comes as chronically ill, immunocompromised and disabled Americans continue to face significant risks for severe complications from Covid-19 and as disability rights advocates raise concerns about how the needs of Americans with disabilities are being met during the pandemic.",
    "MEDICARE INFLATION INCREASE — Cowen’s Gary Taylor told POLITICO he expects the Centers for Medicare and Medicaid Services will pay 4.48 percent in medical cost inflation to Medicare Advantage plans next year — lower than what CMS estimated in a release earlier this week.",
    "— one of the handful of Republicans in the upper chamber who the Biden administration had been counting on to save the embattled nomination of Califf to lead the FDA — told POLITICO earlier this week that he’s skeptical the White House is fully behind the nominee.",
    "“Protecting people with disabilities from being discriminated against in crisis situations is a critical part of this work, and we are continuing to evaluate our operations department-wide to ensure accessibility,” HHS Secretary Xavier Becerra said.",
    "Fauci, the director of the National Institute of Allergy and Infectious Diseases, is appearing in spots across the airwaves this week as primary elections take shape and Republicans seek to tap into his unpopularity with the GOP base.",
    "Around the agencies\nFDA DRUG DRAMA — Lawmakers grilled regulators Thursday on whether the FDA and Medicare coordinated their decisions around Aduhelm, a contentious Alzheimer's drug manufactured by Biogen, Katherine reports.",
    "“I know Mike Gibbons will join me in demanding that Fauci is immediately fired and removed from office.”\nIn enlisting Paul to pad his anti-vaccine mandate credentials, Gibbons chose a top Fauci nemesis to make his point.",
    "Critics in the drug industry and patient advocacy groups, many of which receive donations from pharmaceutical companies, have argued that this draft coverage would unfairly limit access to an FDA-approved therapeutic.",
    "FIRST IN PULSE: PANDEMIC RULES ON DISABILITY RIGHTS — HHS is issuing new guidance to health care providers on civil rights protections for people with disabilities during the public health emergency, Megan reports.",
    "Office for Civil Rights Director Lisa Pino said that, while “biases and stereotypes may impact decision making” during the pandemic, her office will continue to enforce protections for people with disabilities.",
    "That comes as welcome news to several advocacy groups and lawmakers who called for the coverage after the Biden administration required insurers to reimburse tests for Americans with private insurance.",
    "However, it remains unclear how the program will work on the backend, including how Medicare will ultimately pay for the tests and to whom, insurance lobbyists and Medicare advocates told POLITICO.",
    "Driving the Day\nFAUCI AS GOP PUNCHING BAG — Anthony Fauci has been a GOP target for nearly two years, as the party cast the president’s chief medical adviser as a villain for pandemic-era policies.",
    "“History has shown that women are far more likely than men to have their pain dismissed, their concerns ignored, and their lives put at risk,” Sen. Hassan said in the letter, reviewed by POLITICO.",
    "“Was FDA asked to consult with CMS to ensure its analysis of Aduhelm when the decision was made to cover the drug only with evidence development?” Rep. Brett Guthrie (R-Ky.) asked.",
    "The Kentucky senator, a physician and a member of the Senate Health, Education, Labor and Pensions Committee, has been publicly at war with Fauci throughout the pandemic.",
    "“It is essential that medical organizations, including the American College of Surgeons, address these disparities and prioritize the health of women,” the letter added.",
    "WAITING FOR THE VOTES: CALIFF EDITION — Lauren caught up with a handful of senators Thursday to get an update on where Robert Califf’s nomination to lead the FDA stands.",
    "That’s why I’m endorsing Mike Gibbons for Senate,” Sen. Rand Paul (R-Ky.) says in a new TV ad for Gibbons, who’s running in a crowded Republican Senate primary in Ohio.",
    "In Pennsylvania, Republican Mehmet Oz, the celebrity physician and TV personality known as Dr. Oz, also whacked Fauci in a recent TV ad promoting his Senate campaign.",
    "The new guidance underscores that federal civil rights laws apply to all health care providers contributing to the pandemic response, from testing to hospitalization.",
    "When the FDA approved the drug in June, it did so with strings attached and required Biogen to conduct another post marketing trial to prove its benefit to patients.",
    "For his part, Fauci recently told the Senate health committee that Paul “kindles the crazies” with false allegations, leading to death threats and other harassment.",
    "“CMS made their own decision based on their criteria and their thinking about the data.” The FDA determines whether a new therapy is safe and effective, she added.",
    "“The White House is working the votes, and we’ll see where we are,” Sen. Patty Murray (D-Wash.) told POLITICO, adding she didn’t know the status of the whip count.",
    "I cover the Centers for Medicare & Medicaid Services, health care providers and insurers and am interested in how money flows through our health care system.",
    "“The FDA and the CMS decisions are independent of each other,” said Patrizia Cavazzoni, the head of the FDA’s Center for Drug Evaluation and Research.",
    "This trial would have to meet CMS criteria, including a cohort of participants that represents the diversity of the Alzheimer’s population in the U.S.",
    "It also clarifies that federal civil rights laws apply to state Crisis Standard of Care plans that hospitals must follow when resources are scarce.",
    "Paul has sparred with him in hearings over vaccines and masks and even penned a Fox News op-ed titled “The Arrogance of Anthony Fauci” last month.",
    "“Recent reporting indicates that physician gender is a significant predictor of patient outcomes, particularly when that patient is also female.",
    "Last month, Medicare proposed limiting coverage of the $28,000-per-year drug, and future drugs like it, to those enrolled in a clinical trial.",
    "FREE COVID TESTS VIA MEDICARE — Medicare beneficiaries will be able to get free over-the-counter Covid tests sometime in the late spring.",
    "When pressed on whether she believed Medicare’s proposed trial was duplicative of the FDA’s, Cavazzoni failed to give a concrete answer.",
    "“The big government medical establishment came after me because I dared to challenge Fauci on Covid,” Oz says in the 30-second spot.",
    "News this week that Sen. Ben Ray Lujan recently suffered a stroke threw the confirmation vote’s timing into greater uncertainty.",
    "While anyone may fall ill, women are uniquely vulnerable to worse outcomes based on the gender of the doctor that they see.",
    "The POLITICO Pro platform combines the news you need with tools you can use to take action on the day’s biggest stories.",
    "Late-stage clinical trials yielded mixed results, and an advisory panel to the agency recommended against its approval.",
    "He’s gone so far as to challenge Fauci to a debate, “doctor to doctor,” according to a campaign spokesperson.",
    "The New Mexico Democrat isn’t expected back to work for several weeks, leaving Dems with just 49 members.",
    "What We're Reading\n“South African scientists copy Moderna’'s COVID vaccine,” reports Nature’s Amy Maxmen.",
    "Now he’s emerging as a star in Republican campaign commercials, POLITICO’s Stephanie Murray reports.",
    "“Exposure to one nasal droplet enough for Covid infection,” the Guardian’s Hannah Devlin writes.",
    "Quick Fix\n—Anthony Fauci has become the GOP’s villain for pandemic-era policies\n—Sen.",
    "Here’s why patients are still flooding hospitals,” writes NPR’s Will Stone.",
    "“I’ve stood strong against the mandates of Dr. Fauci, but I need help.",
    "ACS didn’t immediately respond to a comment request from POLITICO.",
    "Controversy surrounded Aduhelm even before it reached the market.",
    "CMS didn’t immediately respond to a comment request.",
    "CMS is still working out the details, we are told.",
    "“I like him,” Blunt said of Califf.",
    "The quick version: Still in limbo.",
    "Act on the news with POLITICO Pro.",
    "“Omicron symptoms can be milder.",
    "Reach me at rlevy@politico.com.",
    "Do you have a story idea?",
    "Sen. Roy Blunt (R-Mo.)"
  ]
}