{
  "id": 2830,
  "mediaId": 2540,
  "date": "2022-01-28",
  "headline": "More than $100 million in ads has *already* been spent on just 5 Senate races",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/200310160420-motleyfool-usa20-super-tease.jpg",
  "link": "https://www.cnn.com/2022/01/28/politics/senate-races-millions-ads/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    2459,
    5138,
    3601,
    1126,
    1489,
    300,
    6474,
    5949
  ],
  "sentences": [
    "Given how much money is already being spent – and the fact that two of the most expensive races of 2020 (for Kelly and Warnock’s seats) are being re-run this November – there’s every reason to believe that the spending records set in 2020 will fall in 2022.",
    "As CNN’s David Wright notes, conservative groups like One Nation and Saving Arizona are running ads bashing Kelly, while liberal groups like Advancing Arizona and End Citizens United are defending him.",
    "Nevada: $13,877,003\nConsider that: There has already been more than $30 million spent (or reserved) on ads in Democratic Sen. Mark Kelly’s bid for a full six-year term.",
    "While spending by outside groups dominates in Arizona – where the Republican field is still very much in flux – self-funders are driving the spending in Ohio.",
    "And yet, more than $100 million has already been spent on ads in just five Senate races, according to tabulations made by CNN’s political unit.",
    "Looking back to 2020, the five most expensive Senate races – according to data compiled by Open Secrets – cost upwards of $1 billion (!!!).",
    "Wright also notes that TV ad spending in 2022 Senate races is more than double what it was at a similar point in the 2018 or 2020 cycles.",
    "One candidate, Mike Gibbons, has already spent $10 million on an ad campaign that will run through the state’s early May primary.",
    "The Point: Spending on Senate races has begun to resemble the amounts that candidates for president will spend in a swing state.",
    "(The lone exception – clocking in at $213 million – was the 2018 Florida Senate race won by Republican Rick Scott.)",
    "CNN —\nThe 2022 general election is still 284 days away – and even the earliest primaries don’t start until March.",
    "Kentucky: $166,500,900\nIn fact, of the 10 most expensive Senate races ever, nine of them were in 2020.",
    "And there’s no evidence to suggest we have hit the spending ceiling – or will anytime soon.",
    "This sort of massive spending is already well ahead of the pace of the last two elections.",
    "Georgia (Kelly Loeffler vs. Raphael Warnock): $225,121,111\n4.",
    "Here are the five most expensive Senate contests to date:\n1.",
    "Georgia (David Perdue vs. Jon Ossoff): $260,766,995\n2.",
    "South Carolina: $239,824,140\n3.",
    "New Hampshire: $16,835,264\n5.",
    "Pennsylvania: $20,854,762\n4.",
    "Arizona: $171,841,567\n5.",
    "Arizona: $31,487,757\n2.",
    "Ohio: $25,323,162\n3.",
    "1."
  ]
}