{
  "id": 5639,
  "mediaId": 2627,
  "date": "2022-04-12",
  "headline": "Ohio Republican: Middle class doesn’t pay ‘fair share’ in taxes",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220412-MB-Mike-Gibbons-Ohio-an-ac8100.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/ohio-republican-middle-class-doesnt-pay-fair-share-taxes-rcna24054",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    5138,
    4554,
    1734,
    2684,
    872,
    1489,
    1126,
    6474,
    6678
  ],
  "sentences": [
    "The Daily Beast reported last week, “At least four GOP candidates in the most important battleground states this fall have either explicitly expressed support for Scott’s plan or have campaigned on the political views that form the foundation of his platform.”\nAnd it’s against this backdrop that the public has learned that the top contender in Ohio’s Republican Senate primary also believes that middle-class Americans aren’t paying enough in income taxes.",
    "As regular readers know, Republican Sen. Rick Scott of Florida, the chair of the National Republican Senatorial Committee, recently unveiled a 31-page blueprint, outlining the far-right ideas he wants his party to pursue after this year’s midterm elections.",
    "As we discussed a couple of months ago, in 2011, ahead of her ill-fated presidential campaign, Republican Rep. Michele Bachmann complained that millions of Americans don’t make enough money to qualify to pay income taxes.",
    "The principal problem with Gibbons’ recent rhetoric in Ohio is that he told the truth about his genuine beliefs about tax policy — which is entirely in line with what many Republicans genuinely believe about tax policy.",
    "As we’ve explained before, Scott, a member of the Senate Republican leadership, has proposed changing that: He envisions a tax system in which those who don’t make enough money would have to pay more than they pay now.",
    "Rick Perry, while launching his own presidential bid, called it an “injustice” so many Americans “don’t even pay any income tax.”\nOn Capitol Hill, congressional Republicans thought along the same lines.",
    "Currently over half of Americans pay no income tax.”\nIn other words, tens of millions of American adults currently don’t pay federal income taxes because they don’t make enough money to qualify.",
    "And then, of course, there was Mitt Romney, who spent part of his presidential candidacy insisting that it was “a real problem” that so many Americans didn’t have to pay federal income taxes.",
    "It’s important to emphasize that Gibbons, a millionaire investment banker, made the comments in September, just a few months after launching his second Senate bid.",
    "To date, the GOP candidate hasn’t given any indication of how (or whether) he’d try to get middle-class Americans to pay their “fair share” of income taxes.",
    "Senate hopeful Mike Gibbons — by some measures, the frontrunner in Ohio’s GOP primary — pledged yesterday that he will not support new taxes if elected.",
    "In April 2012, then-House Majority Leader Eric Cantor said it wasn’t “fair” to have the wealthy pay income taxes, while low-income Americans do not.",
    "The far-right Minnesotan described this as ruinous for democracy “because there is no tie to the government benefits that people demand.",
    "One provision stood out: “All Americans should pay some income tax to have skin in the game, even if a small amount.",
    "But Gibbons probably felt the need to make such a declaration because of this Associated Press report.",
    "At face value, this didn’t seem especially notable, since Republicans make similar vows all the time.",
    "I think everyone should have to pay something.”\nAround the same time, then-Texas Gov.",
    "The risk to the GOP is that the public might eventually notice.",
    "What’s more, this line of thought has a lengthy GOP pedigree.",
    "It was a “problem” the wealthy Republican intended to fix.",
    "But there’s an even larger context to this."
  ]
}