{
  "id": 7479,
  "mediaId": 2630,
  "date": "2022-04-06",
  "headline": "From schools to statehouses, conservative Moms for Liberty push to grow influence",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220406-moms-for-liberty-jm-0925-e42c9f.jpg",
  "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/schools-statehouses-conservative-moms-liberty-push-grow-influence-rcna23093",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The National Education Association, a top teacher’s union, calls the group “dangerous.”\nBut some Democrats warn their party cannot afford to take the Republican push on education lightly, saying parents remain deeply frustrated in the wake of the pandemic and will support candidates they feel are listening to them.",
    "Across the aisle, however, Democratic Representative Carlos Guillermo Smith said the group preyed on unsubstantiated fears of teachers “grooming” young children for sexual abuse and promoted conspiracy theories that were once only on the party’s fringe.",
    "Former Trump administration official Ian Prior, who has launched a separate parents’ rights group in Virginia, says the movement could form the “biggest single-issue bloc of voters” in the country and potentially attract Democrats and independents.",
    "They were advocating for the measure giving parents greater input in school curriculum, as well as what critics nicknamed the “Don’t Say Gay” bill, which prohibits classroom instruction for young children on gender and sexuality issues.",
    "At the same time, Republicans appear to be trying to harness the energy of the grassroots group and others like it to stoke voter enthusiasm in the coming November elections, when key governorships and control of Congress are at stake.",
    "“Our party has lost significant support as the party that focuses on students,” said Shavar Jeffries, president of Democrats for Education Reform, an advocacy group that works with state and federal candidates on education issues.",
    "The Republicans embracing Moms for Liberty’s activism are following the lead of Glenn Youngkin, who used education and cultural issues to propel himself to a stunning victory in the Virginia governor’s race last year.",
    "A CNN poll in February found that 46 percent of voters, including about half of parents with children younger than age 18, said education will be extremely important to their vote for Congress in this year’s midterms.",
    "Last month, Iowa Governor Kim Reynolds surrounded herself with members of the conservative parents-rights group Moms for Liberty when she signed a bill that outlawed transgender students from playing girls’ sports.",
    "The group says it plans to hire a series of paid state coordinators, who will organize local chapters into a more cohesive political force and engage with legislators, as well as a Hispanic outreach expert.",
    "“We see this as the highest energy (among Republicans) since the Tea Party,” said Noah Weinrich, a spokesperson for Heritage Action, the political arm of the Heritage Foundation, a conservative think tank.",
    "The Tea Party, a grassroots movement born of the financial crisis of 2007-08 and opposition to Obamacare, helped steer Republican politics in a more populist direction in the 2010 midterms and beyond.",
    "The group has since grown in size and influence, capturing the attention of Republican officials who recognize it has become a fulcrum for culture war issues that dovetail with education.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nIn February, more than 100 Moms for Liberty activists descended upon the Florida legislature in Tallahassee.",
    "The latter bill’s sponsor, Representative Joe Harding, said Moms for Liberty members effectively warned lawmakers who opposed it that they would be “held accountable” in their districts.",
    "Local chapters recently hosted events for Republican candidates such as Mike Gibbons in Ohio’s Senate race and Garrett Soldano in Michigan’s governor’s contest to speak to its members.",
    "Florida Governor Ron DeSantis invited a member of the group to stand alongside him weeks later as he signed a bill that allows parents more say in public school teaching materials.",
    "“Mama Bears and Papa Bears are engaged like never before to reclaim our schools from power-hungry bureaucrats and the radical left,” Soldano tweeted after the March 21 meeting.",
    "“Every single day, I am bombarded by baseless accusations of pedophilia by Moms of Liberty-type advocates that say I need to stay away from children,” said Smith, who is gay.",
    "“It’s unhinged.”\nIn response, Tina Descovich, a co-founder of the group, said “Moms for Liberty is concerned about anyone that is opposed to a bill protecting children .",
    "DeSantis and others are taking Youngkin’s approach a step further by partnering with Moms for Liberty on policy and affiliating themselves with the movement’s goals.",
    "Teachers’ unions, school board organizations and Democrats say the movement promotes disruptive public behavior, anti-gay and trans ideologies, and book bans.",
    "Just over a year ago, Moms for Liberty formed with a few parents upset over their school districts’ Covid-19 mask mandates and race-based equity initiatives.",
    "from sexual content.”\nMoms for Liberty members also lobbied lawmakers in states including South Carolina, Tennessee, Wisconsin, New York and Ohio.",
    "I don’t see an end in sight,” said Alexis Spiegelman, who helped organize the group’s legislative efforts in Florida.",
    "Moms for Liberty has formed three federal PACs and one Florida state PAC to eventually support candidates and causes.",
    "Descovich said the group will endorse candidates for local school boards this year, not in state and federal races.",
    "Its leaders are looking to move beyond local school-board tussles and become a force in bigger political battles.",
    "“They were a huge encouragement to me,” said Harding, a Republican who spoke at a dinner organized by the group.",
    "According to federal and state records, the committees have received no contributions and made no expenditures.",
    "Moms for Liberty says it now has 80,000 members in 34 states, figures Reuters could not independently verify.",
    "But it will press candidates at every level to embrace its priorities ahead of the midterms, she said.",
    "“You can’t manufacture what’s going on here.”\nFollow NBC Out on Twitter, Facebook & Instagram.",
    "About one-fourth of those voters listed curriculum and content in school lessons as a concern.",
    "In March, DeSantis named a member of the group, Esther Byrd, to Florida’s Board of Education.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Ultimately, the PACs “can be a tool in our toolbox,” Descovich said.",
    "As the group’s profile has grown, so has the backlash.",
    "Both bills passed, and DeSantis signed them into law.",
    "“We are making a difference.",
    ".",
    "."
  ]
}