{
  "id": 7553,
  "mediaId": 2699,
  "date": "2022-04-05",
  "headline": "GOP Candidates Can’t Stop Touching the Third Rail of Politics",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1649125925/210404-gop-social-cuts-tease-01_tjaux5",
  "link": "https://www.thedailybeast.com/gop-candidates-cant-stop-touching-the-third-rail-of-politics?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sam Brodey",
  "authorUrl": "https://www.thedailybeast.com/author/sam-brodey",
  "termIds": [
    4267,
    5138,
    4155,
    392,
    772,
    1126,
    1489,
    6159
  ],
  "sentences": [
    "But when pressed, Scott has struggled mightily to explain how he is not proposing a tax increase for the tens of millions of people who pay no income tax, given that he is proposing that “all Americans should pay income tax.”\nIn an interview, NPR’s Steve Inskeep asked, “If you're not going to raise anybody’s taxes, that means you’re not calling for everybody to pay at least some income taxes?”\nScott replied that he wants to “create a system where we’re all in this together” but stated: “I don’t believe in tax increases.”\nGibbons, a wealthy businessman currently leading polls in the contentious GOP primary in Ohio, has attempted to wriggle out of that very same self-imposed logic trap.",
    "Still, Spain, the GOP strategist, said the direction of the party is “shifting much more in the Trump direction, and in the direction of what was predominately the Democratic-held position of, ‘these entitlements are not to be touched.’”\nWhile such rhetoric might play well with traditionally conservative older voters—a key GOP voting bloc, especially in states like Arizona—who have to worry far less about entitlement cuts for younger voters, Spain warned that candidates dive into this turf at their own peril.",
    "“We have to face that reality and do two things at the same time: keep our promises to people we made them to, and change our entitlements in a way that are defensible and fundable into the future.”\nMeanwhile, Blake Masters—the GOP candidate in Arizona backed by Tucker Carlson and Peter Thiel—was asked at an event in January if he supported cutting entitlement spending.",
    "“We have a whole lot of similarities.”\nOn his website, Lamon’s platform touches on some of the conservative issues du jour—banning critical race theory, stopping “defund the police,” and preserving “election integrity”—and proclaims some boilerplate GOP positions like “lower taxes.”\nBut previously, Lamon has said that cutting entitlements should be on the table.",
    "Last September, Gibbons said that “everyone, to some degree, should share in the tax bill.” He argued that the middle class is not “paying any kind of a fair share” and ventured a reason why: “You need the middle class to win an election.”\n“How much of the total tax bill can a very small percentage of the nation pay and still be a democracy?” Gibbons asked.",
    "When the Senate GOP’s campaign chief Sen. Rick Scott (R-FL) released an election-year platform that proposed raising taxes on millions and putting Social Security and Medicare up for negotiation every five years, many Republicans would have been happy to toss it into a Capitol fireplace, light the match, and never speak of it again.",
    "While McCormick noted that “we made promises” to “anybody in this room that’s got gray hair,” he argued entitlements “aren’t sustainable in their current form for the future of our country.”\n“I don’t think my kids are going to be able to live under the same entitlements that all of us that are here,” McCormick said.",
    "Democrats have run against Scott’s plan as if it were the official GOP platform, and have leveraged Scott’s relentless self-promotion by using the steady stream of headlines he generated to ask Republican candidates in varying races nationwide whether they support his ideas.",
    "You know, it’s a very dangerous situation.”\nIn a response to The Daily Beast, campaign spokesperson Samantha Cotten said in a statement that Gibbons has never supported tax increases on anyone and blamed “the left and the mainstream media” for trying to divide Republicans.",
    "“Well, we have to do it,” Masters said, acknowledging the issue is a “Gordian knot.”\nStriking a similar note to McCormick, Masters signaled that benefits should be untouched for retirees or those above the Medicare eligibility age of 65—less so everyone else.",
    "Republican operatives say that, in this election season—one in which Republicans are heavily favored to take control of at least the House, if not the Senate—any time spent talking about taxes and entitlement reform is worse than wasted; it’s a liability.",
    "In response to criticism, Scott has said he expected his ideas would be “unpopular” in status quo-oriented Washington, but that they resonate in “real America.” He accused unnamed Republicans of “parroting” Democratic talking points about his proposals.",
    "And while Scott’s proposal to make all Americans pay some federal income tax—to have some, in his words, “skin in the game”—was denounced by many Republicans, at least one leading candidate, Mike Gibbons of Ohio, had already taken up that same mantle.",
    "McCormick and Masters’ campaigns did not respond to requests for comment on how they would propose restructuring entitlements for future generations, or if they would welcome Scott’s proposal to put them on the negotiating table twice every decade.",
    "In a Jan. 29 interview on Tucson talk radio station, Lamon said “there are many things we can do” to reduce the debt, focusing on “entitlements.”\n“‘Oh, Jim, are you going to take those?’” Lamon said, recreating a question to himself.",
    "Ken Spain, a veteran GOP strategist, credited Scott for having “bold ideas” but said the plan has a “series of political landmines.”\n“Republicans should be talking about three issues: inflation, crime, and immigration,” Spain said.",
    "The short-term and long-term outlook for Social Security and Medicare is much rosier than the picture that many conservatives often paint, but Congress will have to take action soon to prevent key resources from running dry.",
    "At least four GOP candidates in the most important battleground states this fall have either explicitly expressed support for Scott’s plan or have campaigned on the political views that form the foundation of his platform.",
    "Publicly, Minority Leader Mitch McConnell (R-KY) slammed the plan—while Scott stood nearby at a press conference—and privately, GOP strategists said the plan was toxic for their party in the upcoming midterm elections.",
    "In March, for instance, Jim Lamon—a wealthy businessman running in Arizona’s contested GOP primary—said Scott’s plan was “pretty good stuff” and joked that the Florida senator had plagiarized his own platform.",
    "But by proposing that all federal programs, including Social Security and Medicare, should end every five years unless reauthorized, Scott’s plan effectively puts those entitlements on the chopping block.",
    "“If they're talking about anything else, they no longer have the political high ground.”\nMost Senate GOP candidates have steered clear of the Scott plan, so as to deny Democrats any campaign-trail ammo.",
    "They would prefer to raise taxes to fill the stopgap: Sen. Bernie Sanders (I-VT), for instance, proposes raising payroll taxes on wealthy earners first before increasing them for everyone else later on.",
    "Lamon’s campaign did not respond to a request for comment, but a spokesperson told the AP last month that the candidate does not support raising taxes, even though he praised Scott’s plan.",
    "With their poll numbers sagging amid public backlash to rising inflation and high gas prices, they are eager to refocus voters’ attention on the unpopular ideas pushed by Republicans.",
    "“We’re going to have to draw a line, and that line probably goes through the millennial generation,” said Masters, arguing that the country is going to be “completely broke” by 2030.",
    "“I don’t think there’s going to be a lot of successful Republican candidates who win their races by talking about revisiting Medicare and Social Security every year,” he said.",
    "The party and its affiliated campaigns have already run advertising campaigns focused on the plan and blasted out a seemingly endless stream of press releases highlighting it.",
    "Politico reported in February that only one GOP campaign out of over two dozen returned a request for comment on the Scott plan—that of Rep. Billy Long (R-MO), who bashed it.",
    "David McCormick, the former CEO of the powerful hedge fund Bridgewater Associates, is a leading Republican candidate in the critical battleground of Pennsylvania.",
    "Scott’s strategy of approaching the GOP’s third rail issues—gleefully poking at them even—may be more prevalent in the party than many Republicans would like.",
    "“You’re damn right, because that’s where the money is.’”\nScott doesn’t use such blunt rhetoric in his plan—or say much about entitlement reform directly.",
    "When Scott delivered an address at the conservative Heritage Foundation to promote his plan, Democratic staffers camped outside the building with signs.",
    "“He has pledged that he is not going to raise taxes and will put forth pro-growth, America First policies that will get our country back on track.\"",
    "“I talked to him… I said, ‘Rick, have you been reading my website now?’” Lamon said at a campaign stop, according to the Associated Press.",
    "But they nevertheless advocated for significant changes to the programs that form the foundation of the American social safety net.",
    "But his proposal in 2020 to eliminate the Social Security payroll tax was considered a threat to the program’s long-term viability.",
    "As a candidate, Trump famously said he wouldn’t touch Social Security and Medicare, upending decades of conservative orthodoxy.",
    "On Social Security and Medicare, two other leading Senate Republican candidates didn’t make their points as bluntly as Lamon.",
    "“[Gibbons] understands Republicans need an agenda and have to run on and implement smart ideas and strategies,” said Cotten.",
    "For example, Medicare’s trust fund—which pays for hospital stays—could become insolvent by 2026 if Congress does nothing.",
    "At a meet-and-greet on March 25, he acknowledged that entitlements were a “third rail” but proceeded to touch it anyway.",
    "His ideas have quietly gotten some love from an important audience: prominent Republicans who are running for Senate.",
    "At least one very important Republican has also displayed reluctance to touch the third rail of entitlements: Trump.",
    "But it’s not all bad for Scott, the ambitious former Florida governor and potential 2024 presidential hopeful.",
    "Virtually no Democrat wants to slash Social Security and Medicare in order to address these challenges.",
    "“You can't have 10 percent or 20 percent of the population carrying the whole bill.",
    "That is a potential gift to Democrats.",
    "It just—it doesn't work, long run."
  ]
}