{
  "id": 8446,
  "mediaId": 8497,
  "date": "2022-04-06",
  "headline": "Ohio lawmakers propose bill similar to one in Florida dubbed the 'Don't Say Gay' bill",
  "image": "https://kubrick.htvapps.com/vidthumb/images/statehouse-1555009956.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-don-t-say-gay-bill-sexual-orientation-discussion-ban/39655495",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John London",
  "authorUrl": "https://www.wlwt.com/news-team/0e331c55-fcf7-4f86-b314-3917d61a0129",
  "termIds": [
    0
  ],
  "sentences": [
    "We eventually hope to get clarification from the bill's sponsors as to whether they want to prohibit all gender or orientation references or just those that relate to the LGBTQ community?",
    "Republican State Representative Jean Schmidt, co-sponsor of the bill, said in a statement, \"Parents deserve and should be provided a say in what is taught to their children in schools.\"",
    "House Bill 616 states, in part, schools cannot \"teach, use or provide any curriculum or instructional materials on sexual orientation or gender identity\" for grades K through 3.",
    "Ohio House Majority Floor Leader Bill Seitz suggested Wednesday that news outlets not go overboard about it, saying it had not yet been referred to a committee.",
    "Kayes is outside the demographic he referred to and said it's not logical to think that a solution to an imagined problem is to not talk about it at all.",
    "He was among five GOP Senate candidates who spoke about the topic at a political debate, underscoring how traditional values are valued in some circles.",
    "\"I can think of the benefit it would have had to have these conversations from a young age so that I wouldn't have experienced that,\" he said.",
    "The same prohibition would exist for higher grades if taught \"in a manner that's not age appropriate or in accordance with state standards.\"",
    "To Kayes, what might sound to some as harmless on the surface can be emotionally and psychologically damaging to others.",
    "Kayes believes those values \"are rooted in systems that didn't consider or see people outside of a certain demographic.\"",
    "\"Before getting the care she needed, we lived in constant fear that we would lose our daughter to suicide,\" she stated.",
    "As a disabled, gay man of Asian descent, Joshua Kayes said he remembers well the first slur directed at him when he 7.",
    "COLUMBUS, Ohio —\nThe heat has turned up a notch Wednesday about what is taught and what is not taught in Ohio schools.",
    "\"We need to start concentrating on education,\" said Cleveland businessman Mike Gibbons at Miami University last night.",
    "But what supporters described as a parental rights bill is now an undeniable part of the country's culture wars.",
    "Chris Patton, parent of a transgender teenage girl, addressed the governmental body about it this afternoon.",
    "They unanimously approved a resolution Wednesday in support of gender-affirming health care for minors.",
    "You know, are they no longer going to be allowed to talk about, you know, their family?\"",
    "The issue speaks directly to what we as a society deem safe to teach our youngest minds.",
    "She said it blocks an understanding of others and works against being more inclusive.",
    "Sexual orientation and gender identity carry controversy for the classroom of 2022.",
    "The state's version of the so-called \"Don't Say Gay\" bill is a burning controversy.",
    "Pastor JC Church of the Faith Coalition considers HB616 \"common sense\" legislation.",
    "\"Our daughter is a person, a teenage girl, a kid like every other,\" Patton said.",
    "Cincinnati lawmakers intend to take up a resolution against the bill next week.",
    "\"Cause I can remember just how terrible I felt when I received that insult.\"",
    "Vice Mayor Jan Michele Kearney viewed the bill as \"dangerous.\"",
    "Seitz said it takes a long time for any bill to become law.",
    "\"We need to get the 'wokeism' out of our schools.\"",
    "But I can say now that she's doing really well.\"",
    "\"Being trans is only a facet of who she is.\"",
    "\"Children that have same-sex parents.",
    "\"We have been through a lot.",
    "He told us: \"I'm for it.",
    "Let parents decide.\"",
    "I'm glad it's here."
  ]
}