{
  "id": 8992,
  "mediaId": 2584,
  "date": "2022-03-25",
  "headline": "Maori village nestled among hot springs reckoning with the return of foreign tourists",
  "image": "https://i.guim.co.uk/img/media/02c27dd3256363e53ee4309dd6aadaa5c807368f/0_0_5216_3131/master/5216.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1a1705d73cf8d6faa123335fba8d5646",
  "link": "https://www.theguardian.com/world/2022/mar/26/maori-village-nestled-among-hot-springs-reckoning-with-the-return-of-foreign-tourists",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eva Corlett",
  "authorUrl": "https://www.theguardian.com/profile/eva-corlett",
  "termIds": [
    0
  ],
  "sentences": [
    "“We know that a lot of local communities were struggling with numbers, the impacts of waste and insufficient facilities.”\nWhakarewarewa serves as a fascinating microcosm of tourism in New Zealand, and the tension that exists between relying on tourism to survive, while trying to hold on to the wairua (spirit) of a place.",
    "Warbrick – a fourth generation guide – tells stories about the pools, their names and their purposes, and chats about the histories of the houses and the families – all with an ease that comes from growing up watching generations of guides before him tell the stories of his village to more than 120,000 people a year.",
    "t the height of summer, we would get maybe 4,000 people a day,” says James Warbrick as he crosses the bridge into Whakarewarewa, a tiny Maori village pocketed between hundreds of steaming, bubbling geothermal pools – a place like no other and one at the heart of New Zealand’s tourism industry.",
    "The village become a tourist attraction after the 1886 Mount Tarawera eruption, which buried the nearby Pink and White Terraces – a series of terraces, each with a geothermal pool, like a stepped fountain down the mountainside, that had been considered the “eighth wonder of the world”.",
    "A country stilled\nFor more than 130 years visitors have flocked to Whakarewarewa – right up until the pandemic hit, when suddenly, “like a rugby scrum collapsing”, everything went quiet, says 81-year-old Christina Gardiner, a guide and village kuia [elder].",
    "Pre-Covid, most New Zealanders agreed tourism was good for the country, but said the pressure on the environment, degradation of infrastructure and overcrowding were a concern, according to the 2020 Tourism Industry “mood of the nation” report.",
    "Whakarewarewa, in the North Island town of Rotorua, is both a time capsule and a living, evolving place – the 27 families who live on site still cook, bathe and live alongside the hot springs and geysers, just as their tipuna (ancestors) did.",
    "Gibbons adds that there are two words that come to mind when looking towards tourism of the future – manaakitanga, meaning extending love and support to someone, and kaitiakitanga, meaning guardianship and protection of the environment.",
    "The pandemic has given the village a “chance to rethink,” Gibbons says, adding that now, they are considering limiting tour group sizes and would be happy to have just 40,000 visitors a year, a significant drop from pre-Covid times.",
    "They gave us confidence that we can get through this hard time.”\nWhen Gardiner and Warbrick are asked what the first lockdown was like for the village, the words come quick: “eerie”, “shocking”, “there were mixed emotions”.",
    "“They are prepared to share it back with the world, but they have a different affinity to it now.”\nThis month, prime minister Jacinda Ardern announced that the long wait for tourism’s return was nearly over.",
    "Behind him, warm sulphurous mist billows up from the Parekohuru pool and shrouds the small houses in a white veil before being whipped up into the air, exposing the deep blue silica pools beneath.",
    "Having more than 100,000 tourists walking through the village every year is hard on the whenua (land), while one guide to 70 people lacks the connection the village wants to foster, Warbrick says.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "Now, as the country prepares to start reopening to foreign visitors next month, its inhabitants are torn between their economic needs and trepidation at the destructive impact of tourism.",
    "Then, in 1901, the government established the world’s first tourism office, the Department of Tourist and Health Resorts, in Rotorua – and New Zealand’s tourism industry was born.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "If the pandemic hadn’t happened, New Zealand’s tourism industry and its effects “would still be on a fast track to destruction”, says Mike Gibbons, the village’s general manager.",
    "From 13 April, more than two years after the borders shut, New Zealand will reopen – first to Australians, then to other visa-waiver countries and finally the rest of the world.",
    "For the village, there is a reluctance to return to the previous tourism framework, which saw visitor numbers creeping up and the environment de-prioritised.",
    "After the explosion, the people of Whakarewarewa (Ngati Wahiao) took in the displaced Tuhourangi tribe, who had been master tour-guides at the terraces.",
    "Up until March 2020, tourism was New Zealand’s biggest export industry, contributing 20% of total exports and bringing in $40.9bn a year.",
    "To the other side is the open-air kitchen – vegetables are boiled in the 100C mineral spring and meat steamed in ovens that reach 200C.",
    "In Whakarewarewa staff had to be laid off, stores shut down, and the village had to rely on government support grants to keep afloat.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "When New Zealand shut its border two years ago as the Covid pandemic hit, Whakarewarewa lost 96% of its visitors overnight.",
    "Now, it wants to refocus its energy into a more environmentally friendly experience that is both intimate and sustainable.",
    "To one side of the pool are the baths, filled each morning, and left to cool enough for families to take an evening dip.",
    "And, like their tipuna, the families have survived by opening the village to tourists and adapting in times of crisis.",
    "But the inventive drive of his ancestors after the 1886 eruption was the motivation the village needed, he said.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "It is also a case study in how the pandemic years could reorient New Zealand’s relationship with tourism.",
    "A chance to rethink\nThe border reopening will be a lifeline for those regions that are tourist-dependent.",
    "“We’re like the Phoenix bird – you go down; you come back up fighting.”\n… we have a small favour to ask.",
    "“Those were really, really hard times, and I don’t want to experience that ever again,” Warbrick said.",
    "It has already reoriented its tourism model once during the pandemic, to capture a domestic audience.",
    "Before, the bath was a bath, but all of a sudden it was a place where they could be one with nature.",
    "Three regions – Auckland, Queenstown and Rotorua – were perceived as being under too much pressure.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "Inside, meat is cooking slowly, heated through by the mineral steam rising from below ground.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "“We’ve taken on a much stronger focus on what that really means to us,” Gibbons says.",
    "According to Tourism Industry Aotearoa, 90% of international tourism disappeared.",
    "Soon after, the two tribes adapted Tuhourangi’s skills to Whakarewarewa itself.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "The country’s great walks, its ski-slopes, its harbours and towns were still.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "For Whakarewarewa, while there is relief, there is also trepidation.",
    "“It was horrendous what they went through, so we had to dig deep.",
    "Warbrick reaches down and opens a large wooden box on the ground.",
    "“But on the upside, we became very, very close,” Gardiner says.",
    "Since then, many tourism businesses have struggled to survive.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "“In other words, come back to basics,” Gardiner adds.",
    "“It made our kids appreciate what they’d inherited.",
    "If there were ever a time to join us, it is now.",
    "But today there are no tourists in sight.",
    "Thank you.",
    "?"
  ]
}