{
  "id": 104,
  "mediaId": 2584,
  "date": "2022-02-23",
  "headline": "Trump claims investigations into him are politically motivated. That is a lie",
  "image": "https://i.guim.co.uk/img/media/4c7e76c92de44cb8c678f8eb8f6f3e394e1a5356/0_233_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=dfc9bfc342bcf6a35c7686e4fe12a3ab",
  "link": "https://www.theguardian.com/commentisfree/2022/feb/23/trump-claims-investigations-into-him-are-politically-motivated-that-is-a-lie",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather Cox Richardson",
  "authorUrl": "https://www.theguardian.com/profile/heather-cox-richardson",
  "termIds": [
    5065,
    2113,
    2119,
    2415,
    2570,
    4066,
    2887,
    2765,
    3246,
    3403
  ],
  "sentences": [
    "Former speaker of the House Newt Gingrich told the Fox News Channel: “I think when you have a Republican Congress, this is all going to come crashing down, and the wolves are going to find out that they’re now sheep and they’re the ones who are in fact, I think, fac[ing] a real risk of jail for the kinds of laws they’re breaking.”\nDemocratic representative Jamie Raskin, a constitutional law professor and member of the January 6th committee, noted: “That’s the language of authoritarianism.”\nMeanwhile, in an unusual move against an incumbent of his own party, House minority leader McCarthy has endorsed the Trump-backed primary opponent of Representative Liz Cheney, who is the vice-chair of the January 6th committee.",
    "Trump and his supporters are using the language of authoritarians when they denounce cases against him as ‘illegitimate’\nLast week, Judge Arthur F Engoron of the supreme court of the state of New York ruled that former president Trump, his son Donald Trump Jr, and his daughter Ivanka Trump must produce documents and testify under oath in a civil investigation into their valuations of their business assets, complying with a subpoena New York attorney general Letitia James issued for their testimony in December.",
    "Trump claimed that Clinton, “one of the most corrupt politicians ever to run for president, can break into the White House, my apartment, buildings I own, and my campaign – in other words, she can spy on a Presidential candidate and ultimately the president of the United States – and the now totally discredited Fake News Media does everything they can not to talk about it.” (These allegations are false, of course.)",
    "Trump sued Attorney General James last December, alleging that “[h]er mission is guided solely by political animus and a desire to harass, intimidate, and retaliate against a private citizen who she views as a political opponent.” In the hearing, Trump’s lawyers continually portrayed James’s investigation not as a valid exercise in protecting the rule of law, but as a political attack on Trump.",
    "It is not possible.”\nThere is a dangerous theme running through these stories, as well as Trump’s attack on Fulton county district attorney, Fani Willis, who is investigating Trump’s attempt to pressure Georgia secretary of state Brad Raffensperger to overturn the results of the 2020 election in Georgia and award that state’s electoral votes to him, rather than to the actual winner, Joe Biden.",
    "She had the right to review his nominations, and she rejected Republican representative Jim Jordan, who has now been implicated in the events of the day, and Republican representative Jim Banks, who had attacked the committee as a partisan exercise “solely to malign conservatives and to justify the left’s authoritarian agenda”.",
    "“[T]he Radical Left Democrats don’t want [him] to run again,” he wrote, and their targeting of him “represents an unconstitutional attack on our Country… a continuation of the greatest Witch Hunt in history.” Finally, he said, “I can’t get a fair hearing in New York because of the hatred of me by Judges and the judiciary.",
    "While that argument will undermine the rule of law, there is a twist to it: if Republicans can convince their voters that Democrats have engaged in partisan prosecutions of Trump and his allies, the Republicans can justify partisan prosecutions of Democrats as soon as they get the opportunity, just as Gingrich suggested.",
    "She has the clear right to do so.”\nTrump’s attempt to portray as political any legal reckoning for him for potential wrongdoing with regard to his finances dovetails with the attempt of Trump and his loyalists to paint the House Select Committee to Investigate the January 6th Attack on the US Capitol as partisan.",
    "Trump and his allies are working this same game, pressing Wyoming’s Republican governor, Mark Gordon, to back a bill that would change state law to prevent Democrats from voting in the Republican primary, thus likely giving a primary victory to Cheney’s opponent.",
    "“In the final analysis,” the judge wrote, “a State Attorney General commences investigating a business entity, uncovers copious evidence of possible financial fraud, and wants to question, under oath, several of the entities’ principals, including its namesake.",
    "Trump and his loyalists are setting up the idea that any attempt to hold Trump and his allies accountable for illegal activities – including the attempt to overturn the 2020 election and thereby destroy our democracy – is a partisan attack.",
    "He insisted that the suggestion by special counsel John Durham that operatives for Hillary Clinton spied on Trump as president – a suggestion Durham backed away from today –and Judge Engoron’s decision today were entirely partisan.",
    "Earlier this month, Trump told attendees at a rally in Texas that he hoped they would take to the streets with “the biggest protest we have ever had”, if “these radical, vicious racist prosecutors do anything wrong or illegal”.",
    "His lawyers argued that James’s investigation is “selective prosecution” and is “unconstitutional”, and that she is pursuing the case only to hurt the former president before the 2024 election.",
    "Repeatedly, they have called the committee “illegitimate” because Democratic House speaker Nancy Pelosi did not put on it the members Republican House minority leader Kevin McCarthy nominated.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "The judge rejected these claims, pointing out, among other things, that none of the 600 or more documents in the case refer to Trump’s politics; they focus on his financial practices.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "Although Cheney has said she will not encourage Democrats to support her in the primary, the Trump loyalists are prepared to change the law to put a Trump ally in her place.",
    "After rejecting Jordan and Banks, Pelosi asked McCarthy to nominate others in their place, but instead he withdrew all the Republicans from the committee.",
    "He announced that he would use his place on the committee to investigate the protests of summer 2020 instead of the events of January 6.",
    "She is the author of Letters from an American, a daily newsletter about American politics and history\n… we have a small favour to ask.",
    "This is what Eric Trump did more than 500 times in October 2020, when he testified before members of the attorney general’s office.",
    "If this rhetoric works, Trump can undercut legitimate prosecutions, while Democrats will become fair game for partisan prosecutors.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "Although Trump Republicans are portraying Cheney as a turncoat, she voted with Trump’s agenda 92.9% of the time.",
    "Some are talking about turning the committee against the Democrats as soon as the House is back in their hands.",
    "The Trumps can invoke their rights under the fifth amendment to the constitution not to incriminate themselves.",
    "Nonetheless, Trump loyalists dismiss the two Republicans on the committee and claim the committee is partisan.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "At that point, she invited Republican representatives Liz Cheney and Adam Kinzinger to join the committee.",
    "On the other hand, he said, attorney general James is selectively prosecuting him and his family.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "Heather Cox Richardson is an American historian and professor of history at Boston College.",
    "After the decision, James tweeted: “No one is above the law.”\nThe Trumps intend to appeal.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "This is indeed, as Representative Raskin said, the language of authoritarianism.",
    "Last week, Trump lashed out about the legal developments of the past few days.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "In a civil trial, however, invoking the fifth can be interpreted negatively.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "The arguments in last week’s hearing raised a troubling point.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "If there were ever a time to join us, it is now.",
    "Kinzinger voted with Trump 90.2% of the time.",
    "Thank you.",
    "?"
  ]
}