{
  "id": 10706,
  "mediaId": 2572,
  "date": "2022-03-09",
  "headline": "Rising gas prices have 'everything to do' with Biden says former Keystone XL pipeline worker",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/39c6fce1-09bf-4aea-b1bc-a6fd2892dbc1/dc13df8b-b31c-4989-bb6f-83575b32117a/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/rising-gas-prices-keystone-xl-pipeline-biden",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2119,
    3477,
    2767,
    4905,
    6678
  ],
  "sentences": [
    "Even if Biden approved the pipeline, the energy company that was building it would be \"very hesitant to come back to the United States without some kind of concessions\" after losing billions of dollars before.",
    "Crabtree said that his fellow guest, Rep. Jim Jordan, R-Ohio, was the only person to voice disapproval at a congressional hearing with major companies' CEOs that saw promises to halt energy production.",
    "Former Keystone XL pipeline worker Neal Crabtree insisted that President Biden's policies \"have everything to do with\" exorbitant energy prices Wednesday on \"Hannity.\"",
    "Biden's cancellation of the Keystone XL pipeline and waiving of sanctions on the Nord Stream 2 pipeline \"broke\" Keystone XL pipeline workers' hearts, Crabtree added.",
    "\"The president of the United States is lying to you when he says that his policies have nothing to do with the prices of energy,\" Crabtree told host Sean Hannity.",
    "Workers could build the pipeline in about eight months, he estimated, adding that he is \"tired of hearing\" that construction would take three years to complete.",
    "\"If I was that energy company, I would say, 'Hey, you're going to have to give me some of my money back that I lost the first time around.",
    "And then you got Middle America, you got the working and middle-class American families [that] understand what this means.\"",
    "\"You got the quote ‘elite’ and the crazy left who think that there's no problem having four- and five-dollar gas.",
    "And you're going to have to give me some concrete proof that we're not going to end up in U.S. courts again.'\"",
    "As Hannity noted, pipeline jobs are \"high-paying, skill-specific career jobs.\"",
    "\"We take a lot of pride in producing American energy,\" he said.",
    "\"This is the great divide in America today, Sean,\" Jordan said.",
    "\"They have everything to do with the prices going up.\"",
    "\"We want to do it here at home.\""
  ]
}