{
  "id": 10709,
  "mediaId": 2526,
  "date": "2022-03-08",
  "headline": "Jim Jordan: ‘The Democrats Want $7 Gas’",
  "image": "https://media.breitbart.com/media/2020/07/AP_20211649107962-640x335.jpg",
  "link": "https://www.breitbart.com/clips/2022/03/08/jim-jordan-the-democrats-want-7-gas/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Trent Baker",
  "authorUrl": "https://www.breitbart.com/author/trent-baker/",
  "termIds": [
    2119,
    1326
  ],
  "sentences": [
    "I sat in a hearing a few months ago where Ro Khanna, a Democrat member from California, the state that’s now got like $7 gas, he had the oil and gas executives there in front of him, and he badgered every one of them asking them one simple question: ‘Will you pledge to decrease production this year?’ I mean, the Democrats want $7 gas.",
    "Jordan blamed the administration’s “stupid policy decisions” for the soaring gas prices and said that even if President Joe Biden wanted to drill for oil in the United States, “his party won’t let him.” He argued that “Democrats want $7 gas,” as seen in California.",
    "During a Tuesday appearance on FNC’s “Fox & Friends,” Rep. Jim Jordan (R-OH) railed against the Biden administration and Democrats for the record-high gas prices around the United States.",
    "You all know this — the canceling the Keystone Pipeline, not allowing drilling on federal lands, keeping Anwr open, those are things that need to happen.",
    "And understand, we’re in this terrible position because of stupid policy decisions from the Biden administration.",
    "So, we’ve got to focus on that side of the equation.”\n“But here’s the problem, Steve,” he continued.",
    "“But that’s only part of the equation — I mean, it’s only half the equation.",
    "Even if Joe Biden wanted to go there, his party won’t let him.",
    "The real answer is, let’s increase production here.",
    "“We should ban Russian oil,” Jordan declared.",
    "“The left doesn’t want to go there.",
    "So, that is the biggest problem.”"
  ]
}