{
  "id": 10731,
  "mediaId": 2573,
  "date": "2022-03-14",
  "headline": "House GOP investigating US release of Russian cyber criminal",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Jim-Jordan.jpg",
  "link": "https://www.foxnews.com/politics/house-gop-investigating-u-s-release-russian-cyber-criminal",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooke Singman",
  "authorUrl": "https://www.foxnews.com/person/s/brooke-singman",
  "termIds": [
    2119,
    2651,
    3166,
    4905,
    4749,
    4566,
    1126,
    879,
    6672,
    6569
  ],
  "sentences": [
    "Putin, though, during his press conference after the meeting, denied that Russia was responsible for cyberattacks and instead claimed that most cyberattacks in the world were carried out from the U.S.\nBiden in July signed a national security memorandum directing his administration to develop cybersecurity performance goals for critical infrastructure in the U.S. – entities like electricity utility companies, chemical plants and nuclear reactors.",
    "\"The Biden Administration released Burkov at least a year early on August 25, 2021 when U.S. Immigration and Customs Enforcement officials escorted him onto a plane destined for Moscow,\" the lawmakers wrote, adding that, at the time, an ICE spokesperson stated that \"‘Burkov is wanted by Russian authorities,’ and a DOJ spokesperson denied that a prisoner exchange took place.\"",
    "The Republicans asked for an \"explanation\" for why the Biden administration granted Burkov early release from U.S. custody; an assessment of where Burkov is now and whether the administration believes he is \"appropriately being held accountable for his crimes in Russia;\" and an \"explanation of what, if anything, the U.S. received in return for his release to Russia.\"",
    "\"The decision to prematurely release Burkov is curious given the lengths to which the U.S. government went to secure Burkov’s arrest,\" the Republican lawmakers wrote, referring to U.S. authorities’ years-long pursuit of Burkov \"on hacking-related charges, including identify theft, wire fraud, computer intrusion, and money laundering.\"",
    "\"In light of the Biden Administration’s sudden reversal on Burkov’s case, the potential that he may now be working against U.S. interests, and to better understand the Administration’s efforts to address the pervasive threats posed by Russian cybercriminals, we respectfully request the following information,\" the lawmakers wrote.",
    "The top Republicans on the House Judiciary, Foreign Affairs, Homeland Security and Intelligence Committees are demanding answers from White House National Security Adviser Jake Sullivan on the early federal release of Aleksei Burkov, who they describe as a \"notorious Russian cyber criminal.\"",
    "The memo also formally established Biden's Cyber Security Initiative, a voluntary collaborative effort between the federal government and critical infrastructure entities to facilitate the deployment of technology and systems that provide threat visibility indicators and detections.",
    "\"Despite Russia’s efforts to prevent his transferal to U.S. custody, the Trump Administration secured Burkov’s extradition to the U.S. in November 2019,\" the lawmakers noted, adding that Burkov pleaded guilty and a federal judge sentenced him to nine years in prison in June 2020.",
    "\"Burkov has been described as an ‘asset of supreme importance’ and ‘one of the most connected and skilled malicious hackers ever apprehended by U.S. authorities,’\" Reps. Jim Jordan, Michael McCaul, John Katko, and Mike Turner wrote to Sullivan, in a letter obtained by Fox News.",
    "RUSSIA-UKRAINE WAR: INTEL OFFICIALS PREDICT 'UGLY' WEEKS AHEAD AS PUTIN DOUBLES DOWN\nThe Biden administration has worked to strengthen cyber defenses after a string of ransomware attacks last summer, with foreign malign actors targeting pieces of U.S. critical infrastructure.",
    "\"In light of the danger posed by Burkov’s activities and President Biden’s statement that Russian cyber attacks against U.S. interests would face ‘consequences,’ we have questions about the Biden Administration’s decision to allow Burkov to return to Russia,\" they wrote.",
    "EXCLUSIVE: House Republicans are investigating why, in August 2021, the United States released a Russian cyber criminal early from federal custody, as U.S. officials warn of potential cyberattacks against the West amid Russia's multi-front war on Ukraine.",
    "The lawmakers pointed to one of the two illegal websites Burkov ran, called \"Cardplanet,\" which they said \"sold credit and debit card information, many of which belonged to U.S. citizens and resulted in over $20 million in fraudulent purchases on U.S.",
    "The lawmakers also demanded a list of Russian nations in U.S. federal custody pursuant to criminal charges or convictions since Biden took office in January 2021 who have been released prior to the end of the individual’s criminal sentence.",
    "RUSSIA 'DOES NOT WANT A DIRECT CONFLICT WITH US FORCES,' INTELLIGENCE COMMUNITY ASSESSED IN JANUARY\nThe lawmakers added that the Russian government \"has a history of using cybercriminals as assets for Russian intelligence services.\"",
    "The letter was sent to Sullivan at the National Security Council due to his role in \"coordinating the interagency process\" due to the involvement of numerous agencies in the matter, a source familiar with the planning told Fox News.",
    "Russia aggressively fought Burkov’s extradition to the U.S. and even attempted to bait Israel in a prisoner-swap by imprisoning a young Israeli woman on exaggerated drug charges during a layover in Russia,\" they continued.",
    "\"Although a Kremlin spokesperson applauded Burkov’s premature release, calling it a ‘rather positive development,’ current and former U.S. officials have been described as ‘befuddled’ and ‘surprised,’\" they wrote.",
    "The United States \"does not have an extradition treaty with Russia,\" they wrote—meaning the U.S. and Russia do not have an agreement that allows prisoners to finish out their sentences in the other nation.",
    "\"Burkov operated another website that served as an exclusive ‘invite-only club’ where some of the world’s most dangerous cyber criminals could advertise stolen goods and criminal services,\" they wrote.",
    "Last month, the Department of Homeland Security warned U.S. organizations at all levels that they could face cyber threats stemming from the Russia-Ukraine conflict.",
    "The attack on JBS came just weeks after the largest U.S. fuel pipeline, the East Coast's Colonial Pipeline, was targeted by a criminal group originating in Russia.",
    "HACKERS TARGETED US ENERGY COMPANIES AHEAD OF UKRAINE INVASION: SOURCE\n\"In December 2015, at the U.S. government’s request, Israeli authorities arrested Burkov.",
    "\"The Biden Administration continues to warn about vulnerabilities to Russian cyber attacks against Ukraine and the west,\" a senior GOP official told Fox News.",
    "At the time of his sentence, the lawmakers noted that Burkov was given \"credit for time served while incarcerated both in Israel and the United States.\"",
    "Burkov had been imprisoned in the United States for cyber crime, but was deported to Russia in August 2021, before his sentence was complete.",
    "\"If a full response requires the disclosure of classified information, please provide such information under separate cover,\" they wrote.",
    "Biden said he gave a list of \"16 specific entities defined as critical infrastructure,\" saying it ranged from energy to water systems.",
    "\"After you have provided this information in writing, we ask that you arrange for the DOJ to provide a staff-level briefing.\"",
    "In June 2021, a ransomware assault shut down the U.S.-based meat plants of the world’s largest meatpacker, Brazil-based JBS.",
    "Biden, during his summit in Geneva with Russian President Vladimir Putin in June 2021, raised the issue of ransomware.",
    "\"Maybe they wouldn’t be in such a precarious position had they not released a major cyber criminal just months ago.\"",
    "They also warned that \"some former officials have suggested that Burkov may now be working for Russia, against U.S.",
    "Biden, at the time, said he told Putin that \"certain critical infrastructure should be off limits to attack.\"",
    "The White House said the hack was likely carried out by a criminal group based in Russia.",
    "They also requested the charges for which the individual was in custody or convicted.",
    "The lawmakers demanded that Sullivan provide the information by March 28.",
    "You can reach her at Brooke.Singman@Fox.com or @BrookeSingman on Twitter.",
    "\"We request your cooperation with our investigation into this matter.\"",
    "Brooke Singman is a Fox News Digital politics reporter.",
    "interests.\"",
    "cards.\""
  ]
}