{
  "id": 10796,
  "mediaId": 2746,
  "date": "2022-03-18",
  "headline": "House passes bill aimed to ban race-based hair discrimination",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/14/Cori_Bush_Youth_Speak_In_31153.jpg-c12ed_c0-250-6000-3750_s1200x700.jpg?2cb823f519263a3e55a419724463fd44fb7f7c61",
  "link": "https://www.washingtontimes.com/news/2022/mar/18/house-passes-bill-aimed-ban-race-based-hair-discri/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mica Soellner",
  "authorUrl": "https://www.washingtontimes.com/staff/mica-soellner/",
  "termIds": [
    5756,
    5813,
    4619,
    4230,
    392,
    1489,
    1477,
    6428
  ],
  "sentences": [
    "The bill, which now heads to the Senate, was led by House Democrats who said courts have misinterpreted the 1964 Civil Rights Act by using a narrow definition of “race.” Lawmakers who supported the legislation said broadening what race means will prevent discrimination against people who wear natural or protective hairstyles, which include cornrows, twists, braids and Afros.",
    "“I think the American people expect more from their Congress, expect more from their elected representatives, and I hope we can actually focus on things that matter to the American people.”\nAmong the 14 Republicans who joined Democrats were Reps. Liz Cheney of Wyoming, Adam Kinzinger of Illinois, and Don Bacon of Nebraska.",
    "“By passing the CROWN Act out of the House today, we’re taking a bold step toward ending race-based hair discrimination and affirming the right for all of us to show up in the world as our full and authentic selves, no matter where we work or go to school,” Ms. Pressley said.",
    "“I know what it’s like to sit in that waiting room, to sit in that office, and know that the person on the other side of the table is judging me for the way I chose to wear my hair,” Ms. Bush said in a statement.",
    "“Discrimination of Black hair has had catastrophic impacts on our society.”\nRepublicans, meanwhile, criticized the bill as being a distraction from other issues such as rising inflation, gas prices and crime.",
    "The Biden administration said it “strongly supports” the legislation, adding that the bill is in line with its agenda to enhance racial equity and remove barriers to success for Black people.",
    "Lawmakers took action to end race-based hair discrimination, passing a bill on Friday that would enhance protections against people with various textures and hairstyles.",
    "Discrimination against Black hair is discrimination against Black people,” said Rep. Bonnie Watson Coleman, New Jersey Democrat, who sponsored the bill.",
    "Rep. Cori Bush, Missouri Democrat, touched on her own experience of feeling discriminated against as a Black woman because of her appearance.",
    "The U.S. House of Representatives passed the CROWN Act, or Creating a Respectful and Open World for Natural Hair, with a 235-189 vote.",
    "“Natural Black hair is often deemed ‘unprofessional’ simply because it does not conform to white beauty standards.",
    "“Fourteen months of chaos and we’re doing a bill on hair,” said Rep. Jim Jordan, Ohio Republican.",
    "GOP lawmakers also said the issue is already covered by existing anti-discrimination laws.",
    "New Jersey Democratic Sen. Cory Booker is sponsoring the Senate version of the bill.",
    "Rep. Ayanna Pressley, Massachusetts Democrat, praised the bill’s passage.",
    "Fourteen Republicans joined Democrats in passing the measure."
  ]
}