{
  "id": 10921,
  "mediaId": 2685,
  "date": "2022-03-18",
  "headline": "U.S. House passes CROWN Act barring discrimination based on hair type or style",
  "image": "https://chorus.stimg.co/23123126/merlin_65531773.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces",
  "link": "https://www.startribune.com/u-s-house-passes-crown-act-hair-discrimination-ilhan-omar/600157322/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emma Nelson",
  "authorUrl": "https://www.startribune.com/emma-nelson/6134699/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"I know personally, as a person with my hair, that I have had people tell my employer that I was an embarrassment sitting in the front office because of the way my hair looked,\" said Rep. Gwen Moore, D-Wis.\nRep. Barbara Lee, D-Calif., called Republicans' arguments \"outrageous\" but \"not surprising.\"",
    "The CROWN Act would prohibit discrimination based on hair texture and protective hairstyles — such as locs, cornrows, braids, twists, Bantu knots and Afros — and treat it the same as race or national origin discrimination under federal civil rights laws.",
    "Rep. Dan Bishop, R-N.C., called the legislation \"another solution to a problem that doesn't exist in any significant scope in this country\" and said it would prevent employers from enforcing workplace health and safety rules.",
    "During more than an hour of debate Friday morning, Republican lawmakers argued that the CROWN Act — which stands for Creating a Respectful and Open World for Natural Hair — should not be a congressional priority.",
    "\"I don't know anyone that could oppose simple legislation that is just trying to make sure that there is protection for women and young girls who are mostly Black in this country.\"",
    "The CROWN Act, led by a cohort of Black women lawmakers including U.S. Rep. Ilhan Omar, D-Minn., mirrors measures that have already become law in more than a dozen states.",
    "A nationwide survey by CROWN Act proponents in 2019 found Black women are 1-1/2 times more likely than white women to be sent home from work because of their hair.",
    "Democrats countered with specific examples, from the classroom to the workplace, of discrimination based on hair — including, for some, experiences of their own.",
    "\"Republicans, every step of the way, try to diminish the humanity of Black and brown people, try to uphold white supremacy at every step of the way,\" Lee said.",
    "The U.S. House of Representatives approved a bill Friday that seeks to protect Americans from discrimination based on the texture and style of their hair.",
    "The federal bill, which has the support of President Joe Biden, was passed largely along party lines after many Republicans derailed a vote last month.",
    "In an interview Friday, Omar said she hopes the CROWN Act has a path forward in the Senate but wasn't yet sure about its chances this year.",
    "The House on Feb. 28 passed a bill adding a definition of race that includes natural hairstyles and textures to the state Human Rights Act.",
    "Republican U.S. Reps. Michelle Fischbach, Tom Emmer and Pete Stauber were not available or did not respond to requests for comment Friday.",
    "Even if the law passes at the federal level, it will still be important for state-level legislation to move forward, Omar said.",
    "Minnesota's delegation split in similar fashion, with Democrats voting in favor of the bill and Republicans voting against it.",
    "Though the measure received bipartisan support, it remains to be seen whether the GOP-controlled Senate will follow suit.",
    "How about a world where you can actually walk safely on your streets and not have record levels of crime?",
    "\"I don't think it weakens the work that we are doing — I think it strengthens it,\" she said.",
    "\"Just listen to what you're saying in terms of arguing against this bill.\"",
    "How about a world where we were actually energy independent?\"",
    "A Minnesota version of the CROWN Act is in a similar place.",
    "How about a world where inflation isn't at a 40-year high?",
    "Staff writer Hunter Woodall contributed to this report.",
    "\"How about a world where gas prices aren't $5 a gallon?",
    "\"Those are the issues we should be focused on.\"",
    "\"I think it's straightforward,\" she said.",
    "said Rep. Jim Jordan, R-Ohio."
  ]
}