{
  "id": 10982,
  "mediaId": 2594,
  "date": "2022-03-17",
  "headline": "Where’s Fauci? ‘Witness protection’ quip leads to internet conspiracy",
  "image": "https://static.independent.co.uk/2022/01/18/07/GettyImages-1237662446.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/anthony-fauci-witness-protection-desantis-b2038526.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Justin Vallejo",
  "authorUrl": "https://www.independent.co.uk/author/justin-vallejo",
  "termIds": [
    1679,
    2119,
    3217,
    1394,
    6474,
    6159,
    6672,
    6569
  ],
  "sentences": [
    "\"If you listen to them, they never supported all these policies that were so destructive, now it’s like, ‘we all want to be like Florida’, all of a sudden, and nothing has changed, there’s been no change in the underlying science.\"",
    "Their timeline of appearance from 15 February to 6 March had Dr Fauci speaking on MSNBC, quoted in a Reuters interview, on camera during PBS NewsHour, a local 85 South Comedy Show, Gray Television, and a Florida NBC News affiliate.",
    "But the quip has led to frantic debunking and fact-checking to dispel the impression that Dr Fauci, once a prime time fixture, has been shuffled aside to divert attention from politically unpopular Covid lockdowns and mandates.",
    "A \"Missing Person Alert\" posted on the Facebook page of The Steve Gruber Show gave his last-known whereabouts: \"Dr Anthony Fauci, was last seen several weeks ago ‘following the science’ and has not been heard from since.\"",
    "\"He’s still out there advising the public about health issues and the pandemic, even if other world events — such as the war in Ukraine — have been getting a bigger share of news coverage.\"",
    "Internet memes ensued from Facebook to Twitter and TikTok to Telegram, with Dr Fauci appearing on the back of milk cartons or dressed as the Where’s Waldo (or Wally) character.",
    "\"He’s been making fewer media appearances recently, though, as Russia’s war in Ukraine has overtaken much of the news and COVID-19 case counts have fallen,\" they wrote.",
    "\"Think about what they’ve done, Fauci is in the witness protection programme now, they don’t want him out there,\" Mr DeSantis said at a press conference on 2 March.",
    "Titled \"Fauci Continues Making Public Appearances and Hasn’t ‘Disappeared’,\" the fact check concludes that he has, indeed, been less visible.",
    "But if it wasn’t obvious, the Poynter Institute-funded PolitiFact stepped in to debunk the claims that Dr Fauci has gone missing as \"false\".",
    "Not even Florida governor Ron DeSantis was serious when he joked about the architect of the US’s Covid response being given a new identity.",
    "The NIH did not respond when asked to directly confirm whether Dr Fauci is or is not in the witness protection programme.",
    "A spokeswoman for the agency pointed to another debunking from the Annenberg Public Policy Center-funded FactCheck.org.",
    "He also spoke at two White House press briefings, and was quoted in a Telegraph story about tuberculosis in Ukraine.",
    "Even Jim Jordan got in on the action, asking on Twitter, \"where’s Fauci?\"",
    "\"Strange how he disappeared just in time for the State of the Union!\"",
    "Is Dr Anthony Fauci in the witness protection programme?",
    "the Ohio Republican and Trump loyalist wrote.",
    "Facebook flagged posts as misinformation."
  ]
}