{
  "id": 11044,
  "mediaId": 2746,
  "date": "2022-03-14",
  "headline": "Republicans raise questions about U.S. release of Russian cybercriminal",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/08/Cryptocurrency_Laundering_08804.jpg-0155d_c0-146-3513-2195_s1200x700.jpg?1b5b1450560986d6dadac5a744d84745ed4b5c41",
  "link": "https://www.washingtontimes.com/news/2022/mar/14/republicans-raise-questions-about-us-release-russi/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    2119,
    3166,
    4905,
    4566,
    4749,
    879,
    1471,
    1126,
    6569
  ],
  "sentences": [
    "The top Republicans on four House committees are questioning the Biden administration‘s decision to “prematurely release” a Russian cybercriminal, raising concerns that “he may now be working against U.S. interests.”\nReps. Jim Jordan and Michael Turner, both of Ohio, and Reps. John Katko of New York and Michael McCaul of Texas fired off a letter Monday to White House National Security Adviser Jake Sullivan asking for more information as to why the administration granted Aleksei Burkov early release from U.S. custody.",
    "On Monday, the Republican lawmakers requested by March 28 an update on where Mr. Burkov is now, and “whether the Biden administration believes he is appropriately being held accountable for his crimes in Russia.”\nThey said they want to know whether the U.S. received anything in return for his release, and called for a list of Russian nationals in federal custody who were released before the end of their sentences.",
    "“In light of the danger posed by Burkov’s activities and President Biden’s statement that Russian cyberattacks against U.S. interests would face ‘consequences,’ we have questions about the Biden administration’s decision to allow Burkov to return to Russia,” the letter stated.",
    "The following year, a federal judge gave him a nine-year sentence for operating a website that sold credit card numbers that had been stolen online, and resulted in more than $20 million in fraudulent purchases made on credit cards in the U.S.",
    "U.S. authorities pursued Burkov for years on hacking-related charges, including identity theft, wire fraud, computer intrusion, and money laundering.”\nMr. Jordan is the ranking member on the Judiciary Committee.",
    "Russian authorities took Mr. Burkov into custody in September after he arrived at Moscow’s Sheremetyevo International Airport, according to Russia‘s Ministry of Internal Affairs.",
    "Mr. Katko serves as the ranking member on the Homeland Security Committee and Mr. McCaul is the ranking member on the Foreign Affairs Committee.",
    "“The decision to prematurely release Burkov is curious given the lengths to which the U.S. government went to secure Burkov’s arrest.",
    "“The Russian government has a history of using cybercriminals as assets for Russian intelligence services,” the letter read.",
    "“Some former officials have suggested that Burkov may now be working for Russia, against U.S. interests.”",
    "The Justice Department has said that Mr. Burkov’s release in 2021 was not part of a prisoner exchange.",
    "Israeli authorities arrested Mr. Burkov in 2015 and extradited him to the U.S. in 2019.",
    "He also ran an invite-only cyber forum where stolen goods could be sold and traded.",
    "Mr. Turner is the ranking member on the Select Committee on Intelligence."
  ]
}