{
  "id": 11107,
  "mediaId": 2557,
  "date": "2022-03-11",
  "headline": "VIDEO: Americans blast Biden for halting Keystone Pipeline: ‘Killed our economy’",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/03/GettyImages-1332209171-6.jpg",
  "link": "https://dennismichaellynch.com/video-americans-blast-biden-for-halting-keystone-pipeline-killed-our-economy/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2119,
    2415,
    4174,
    4905,
    514,
    6406,
    6678
  ],
  "sentences": [
    "He said, “He’s literally pulled the rug out from under us and killed our economy.”\nWATCH the video below for more reaction from residents:\nDonald Trump Jr. tweeted Thursday, “Biden & blue state libs destroyed America’s energy independence & now they are willing to pay millions to dictators for oil.",
    "“Biden ‘does not care’ about small-town America, South Dakotans say: ‘If he did care, Keystone would be going” https://t.co/KzCqYlUQC8 #MTPol #KeystonePipeline\n— Aaron Flint (@aaronflint) March 11, 2022\nAmericans are calling for more American energy production to lower gas prices.",
    "“If he did care, Keystone would be going.”\nThe article goes on to state the following:\nBiden revoked the Keystone XL Pipeline’s building permit his first day in office over concerns about its potential impact on the climate.",
    "– President Biden has been “absolutely worthless” and “has done nothing for us,” residents of a small South Dakota town say as their community continues to deal with the fallout from the Keystone XL Pipeline cancelation.",
    "STOP filling the pockets of dictators and restart the Keystone Pipeline.”\nBiden & blue state libs destroyed America’s energy independence & now they are willing to pay millions to dictators for oil.",
    "West Central Electric Cooperative CEO Jeff Birkeland told Fox News, “Biden and his administration ran on Build Back Better, and, that is, from where I’m standing, a load of crap.",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Fox News:\nPHILIP, S.D.",
    "He told Fox News that his co-op invested $9 million into the project only for Biden to stop work on it during his first day in office.",
    "https://t.co/KLL7SoYIzP\n— Donald Trump Jr. (@DonaldJTrumpJr) March 10, 2022\nRep. Jim Jordan tweeted Tuesday, “Keystone Pipeline.",
    "'”\nBirkeland described how the Keystone XL Pipeline project was a “once-in-a-lifetime opportunity” for the city of Philip.",
    "https://t.co/B4f2Aq4ZSB\n— Tommy Hicks (@TommyHicksGOP) March 11, 2022\nListen to the latest daily DML podcasts below!",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "— Rep. Jim Jordan (@Jim_Jordan) March 8, 2022\nYou hear the same in Montana.",
    "STOP filling the pockets of dictators and restart the Keystone Pipeline.",
    "“He does not care,” Paulette, a resident of Philip, told Fox News.",
    "To get more information about this article, please visit Fox News.",
    "I think his new slogan should be ‘butchering booming business.",
    "Only common sense.”\nKeystone Pipeline.",
    "There’s no shortage of oil.",
    "But Joe Biden doesn’t care.",
    "There’s no shortage of oil.",
    "American oil leases.",
    "American oil leases.",
    "What about America?",
    "What about America?",
    "Only common sense.",
    "Then please share.",
    "What about Texas?",
    "What about Texas?",
    "Oklahoma?",
    "Oklahoma?",
    "ANWR.",
    "ANWR.",
    "ND?",
    "ND?"
  ]
}