{
  "id": 11157,
  "mediaId": 2602,
  "date": "2022-03-09",
  "headline": "AIPAC and some controversial endorsements - opinion",
  "image": "",
  "link": "https://www.jpost.com/american-politics/article-700809",
  "mediaOutlet": "Jerusalem Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DOUGLAS BLOOMFIELD",
  "authorUrl": "https://www.jpost.com/author/douglas-bloomfield",
  "termIds": [
    2119,
    4905,
    4066,
    4248,
    1477,
    1474,
    6631,
    6253
  ],
  "sentences": [
    "Abe Foxman, the retired leader of the Anti-Defamation League, called the new approach a “Sad Mistake!” It is bad for Israel when AIPAC endorses and contributes to “those who undermine America’s democracy.”\nIn this day when Israel is exploited as a partisan wedge issue in domestic politics, AIPAC’s claim is that it is solely focused on promoting close US-Israel relations rings hollow.",
    "The New York Times has reported that he was said he was like KKK leader David Duke “without the baggage.”\nAIPAC’s most outrageous endorsement may be Rep. Jim Jordan of Ohio, who has refused to testify before the January 6 investigating committee and joined failed lawsuits to block certification of Biden’s election.",
    "After many years of AIPAC leaning to the right under the heavy-handed influence of its wealthiest donors and Israeli prime minister Benjamin Netanyahu, it apparently decided after the election of a Democratic president and Democratic House and Senate, and a new government in Jerusalem, it was time to make shalom.",
    "It’s apparent when one side submits resolutions endorsing annexation of the Golan Heights, opposing Palestinian statehood and embracing West Bank settlements, issues which the other party rejects – leading to specious and purely partisan charges that the critics are being anti-Israel.",
    "Right now, it is an organization without judgment and direction.”\nEmbracing candidates who are anathema to a major portion of each party makes a mockery of the organization’s attempts to claim neutrality and to repair damaged relations with Democrats and the majority of Jewish voters.",
    "Giving its endorsement and contributions to 37 Republicans who tried to trash the Constitution and overthrow the 2020 presidential election is politically and morally unacceptable, and it is unlikely to play well with those American Jews who fear for the future of our democracy.",
    "The notorious 37 include several still trying to overturn the election, refusing to concede that President Joe Biden won the election and planning to quash any investigation of the deadly January 6 attack on the Capitol if their party takes control of the House in November.",
    "(photo credit: GREG NASH/REUTERS)\nIf the American Israel Public Affairs Committee (AIPAC) was ever serious about repairing frayed relations with the Democrats and many Jewish voters, it has just taken a giant step in the wrong direction.",
    "Levin, who is Jewish, likely got the snub for the temerity of leading a group of progressives – including eight liberal Jewish Democrats – calling for reviving the moribund Mideast peace process based on a two state solution.",
    "He voted to overturn the election, has said the Democratic Party has fallen under the “antisemitic influence of their radical members” and has failed to do anything to curb extremists and white supremacists in his caucus.",
    "He would only concede “Joe Biden was sworn into office.”\nOn the Democratic side, it endorsed Rep. Haley Stevens in the Democratic primary against Rep. Andy Levin in the newly drawn Detroit area 11th District.",
    "Jews voted three-to-one for Biden, and they differ fundamentally from most Republicans on issues like climate change, guns, health care, race, LGBQT rights, voting rights and abortion, to name a few.",
    "He remains one of Trump’s fiercest attack dogs, which may explain why he took the senior Republican seat on the House Judiciary Committee in time for the former president’s second impeachment.",
    "By endorsing candidates in a deeply polarized Congress, AIPAC is telling each half of its donors their money is going to help elect people who oppose just about everything they stand for.",
    "Very few Jewish voters put Israel at the top of their priority list when going to the polls and those who do are largely, though not exclusively, on the right and among the Orthodox.",
    "Very few Jewish voters put Israel at the top of their priority list when going to the polls and those who do are largely, though not exclusively, on the right and among the Orthodox.",
    "Endorsing 37 incumbents who sided with the insurrectionists, opposed certification of Biden’s election and question the legitimacy of his presidency is a blunder of the first order.",
    "AIPAC also endorsed two far right Republican nativists who tout white supremacist population replacement conspiracies, Reps. Scott Perry of Pennsylvania and Brian Babin of Texas.",
    "A total of 147 Republicans voted to overturn the election, even after the sacking of the Capitol by Donald Trump’s mob, which included several top GOP House leaders.",
    "The lobby group’s newly christened Political Action Committee (PAC) last week revealed its first list of 120 endorsements, 61 Republicans and 59 Democrats.",
    "I spent the 1980s as the legislative director of AIPAC and have been involved in Israel-related issues since I went to work in the Congress in 1970.",
    "Minority whip Steve Scalise backs Trump’s bogus claims about a stolen election, according to the Associated Press, Fox News and other media reports.",
    "AIPAC’s claims to be a one-issue group that doesn’t care about anything, but US-Israel relations won’t wash. That boat sailed long ago.",
    "He the son and nephew of two of Israel’s staunchest supporters in Congress, former Rep. Sandy Levin and Sen. Carl Levin, respectively.",
    "It is time to return to the longstanding policy of “we don’t rate and endorse” and allow people to make their own decisions.",
    "The decision to establish PACs is wrongheaded, doubly so as the pillars of democracy are being undermined at a furious pace.",
    "Tom Dine, the lobby’s longtime executive director, said, “AIPAC needs to spell out why it selected each person.",
    "He is tangled in a sexual misconduct scandal dating to his tenure as an assistant college wrestling coach.",
    "He’d likely have backing from Trump, who is said to feel McCarthy is not sufficiently tough or loyal.",
    "It should be up to each AIPAC member throughout the country to decide for themselves who to support.",
    "And that will restore lobbyists’ ability to focus on issues, not fundraising when meeting lawmakers.",
    "Minority Leader Rep. Kevin McCarthy is in line to be the next Speaker if his party wins in November.",
    "And one senator, Roger Marshall (R-Kansas), who as of December was still refusing to say Biden won.",
    "The current chair, Rep. Jerry Nadler (D-NY), has accused him of publishing antisemitic tweets.",
    "Telling AIPAC members their money is going to help elect such candidates doesn’t make sense.",
    "Jordan may challenge McCarthy for the speakership if Republicans are victorious this fall.",
    "He may face challenges for the speakership from two other AIPAC-endorsed rejectionists.",
    "AIPAC’s great strength has been that it doesn’t publicly take partisan sides.",
    "The majority of Jewish voters are on the opposite side of the 37.",
    "There’s no need to plunge Israel deeper into the partisan morass.",
    "That may explain AIPAC’s reasoning in endorsing the three.",
    "Jordan is known for his disruptive antics at hearings.",
    "There was and remains a good reason for that.",
    "Scalise may also seek the leadership.",
    "If it ain’t broke, don’t fix it."
  ]
}