{
  "id": 11226,
  "mediaId": 2846,
  "date": "2022-03-09",
  "headline": "Report: Biden Tried To Ask Saudis And UAE For More Oil But They REFUSED To Take His Calls",
  "image": "https://cdn.summit.news/2022/03/GettyImages-1358113820.jpg",
  "link": "https://www.blacklistednews.com/article/82088/report-biden-tried-to-ask-saudis-and-uae-for-more-oil-but-they-refused-to-take-his.html",
  "mediaOutlet": "blacklistednews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2619,
    4032,
    4905,
    4834,
    1052,
    169,
    6678,
    6569
  ],
  "sentences": [
    "Commenting on the import ban for Russian energy, American Petroleum Institute (API) President and CEO Mike Sommers said on Tuesday:\n“We share the goal of reducing reliance on foreign energy sources and urge policymakers to advance American energy leadership and expand domestic production to counter Russia’s influence in global energy markets.”\nThe U.S. oil industry seeks a longer-term commitment to the sector from the Administration and says that despite all pleas and calls, it simply cannot raise production too fast too soon.",
    "Occidental Petroleum CEO Vicki Hollub said at the CERAWeek conference: “We’ve never faced a scenario where we need to grow production, when actually supply chains not only in our industry but every industry in the world [are] being impacted by the pandemic.”\nDespite its flexibility to respond to soaring oil prices, the U.S. shale patch cannot come to the rescue of the increasingly tightening global oil market with some Russian crude not making its way to buyers, commodity intelligence firm Kpler said earlier this week.",
    "Shale CEOs Meet With U.S. Officials Amid Surging Oil Price\nAfter more than a year of little to no dialogue with the U.S. oil industry, officials from the Biden Administration are set to meet with shale executives this week to discuss oil supply and energy security in the wake of Russia’s war in Ukraine, Bloomberg reports, citing sources familiar with the plans.",
    "To the contrary, the Biden Administration has been clear that in the short-term, supply must keep up with demand, at home and around the world while we make the shift to a secure clean energy future.”\nU.S. shale executives beg to differ, and they have been deploring the lack of engagement from the Administration since President Biden took office in early 2021.",
    "U.S. officials from the Department of Energy, including Energy Secretary Jennifer Granholm, will be meeting with executives from several shale companies, as well as from ExxonMobil and Shell, during this week’s energy conference in Houston, CERAWeek by S&P Global, according to Bloomberg’s sources.",
    "Due to the Russian invasion of Ukraine and the highest crude and U.S. gasoline prices since 2008, signs have emerged that there would be some dialogue between the Administration and the U.S. oil and gas industry.",
    "“I’ve been told his mindset is changing,” Scott Sheffield, CEO of Pioneer Natural Resources, the biggest oil producer in the Permian, told Bloomberg, referring to President Biden’s stance on the oil industry.",
    "In the statement announcing the ban on imports of Russian energy, the White House said on Tuesday that “Federal policies are not limiting the production of oil and gas.",
    "Capex discipline from the largest shale firms and the supply chain bottlenecks for many producers will cap U.S. oil production growth, industry executives say.",
    "Even if ConocoPhillips decided to pump more oil today, the first drop of new oil would come within eight to 12 months, CEO Ryan Lance told CNBC on Tuesday.",
    "This is why partisan politics is BS, and why Steve Watson is just a partisan hack.",
    "We thats a given.",
    "And Ted Cruz?"
  ]
}