{
  "id": 11271,
  "mediaId": 2754,
  "date": "2022-03-12",
  "headline": "FBI Whistleblower Raises Questions About Pipe Bombs Set Near DNC, RNC Headquarters: Lawmaker",
  "image": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2022-03/pipe-bomb-capitol-hill-2-600x338.jpg?itok=PgzNrWDa",
  "link": "https://www.zerohedge.com/political/fbi-whistleblower-raises-questions-about-pipe-bombs-set-near-dnc-rnc-headquarters",
  "mediaOutlet": "Zero Hedge",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Durden",
  "authorUrl": "",
  "termIds": [
    2119,
    3468,
    4007,
    474,
    391,
    1126,
    1125
  ],
  "sentences": [
    "Those questions regarded the status of the FBI’s investigation and requested a briefing on the matter, and Posey cited concerns for his office’s safety as well as the safety of “the residences of many Members of Congress, and for the public at large.”\n“The FBI, however, has not fully responded to Rep. Posey’s request, explaining that it was exclusively providing information to the partisan Democrat-led Select Committee investigating the events of January 6, 2021,” Jordan said.",
    "'”\nJordan said that the special agent had described the request as “unusual” because it “was transmitted more than a year after the FBI had begun the investigation, and it raises questions about the progress and extent of the FBI’s investigation.”\nThe FBI began investigating the incident after an unknown individual dressed in a hooded sweatshirt, gloves, and a mask placed two pipe bombs in the Capitol Hill neighborhood of Washington, D.C. on Jan. 5, 2021.",
    "Authored by Katabella Roberts via The Epoch Times (emphasis ours),\nOhio Republican lawmaker Jim Jordan said he has requested a briefing with the FBI after a whistleblower allegedly disclosed information regarding the bureau’s investigation into pipe bombs planted near the Democratic National Committee and Republican National Committee headquarters in Washington the night before the Jan. 6 breach of the U.S. Capitol.",
    "“Identifying the perpetrator of this attempted attack remains a priority for the FBI’s Washington Field Office and our partners at the Bureau of Alcohol, Tobacco, Firearms and Explosives; U.S. Capitol Police; and D.C. Metropolitan Police Department,” the bureau said in a September 2021 statement.",
    "“According to the special agent, on February 7, 2022—over a year after the placement of the bombs—the FBI’s Washington Field Office asked FBI field offices to canvass all confidential human sources nationwide for information about the individual and the crime,” Jordan said in his letter.",
    "In his letter to the FBI Director, Jordan said that in addition to the disclosure from the whistleblower, the House Judiciary Committee had learned that the FBI had failed to “sufficiently answer questions” posed by Rep. Bill Posey, a Florida Republican, in September 2021.",
    "Jordan, who is ranking member of the House Judiciary Committee, said he sent a letter to FBI Director Christopher Wray on March 9 after a senior FBI special agent came forward with information regarding an “unusual” request from the FBI’s Washington Field Office.",
    "Jordan said the FBI’s decision to provide information on a partisan basis “further erodes public confidence in the FBI’s senior leadership.” He requested the FBI briefing take place “as soon as possible” but no later than March 23.",
    "While both of the bomb threats were neutralized by authorities, the devices triggered the evacuation of the U.S. Capitol and nearby buildings when they were found on the afternoon of Jan. 6, officials said.",
    "Both the FBI and other law enforcement entities say one bomb was placed in an alley behind the Republican National Committee (RNC) headquarters, located at 310 First Street Southeast.",
    "The FBI has offered members of the public a reward of $100,000 if the information they provide leads to the identification of the person responsible for planting the bombs.",
    "“In part, the message asked that the canvass ‘include sources reporting on all [types of] threats’ because the suspect’s ‘motive and ideology remain unknown.",
    "Some of the components in the bombs included 1×8-inch threaded galvanized pipes, a kitchen timer, and homemade black powder, according to officials.",
    "The other was left near the headquarters of the Democratic National Committee (DNC), located at 430 South Capitol Street Southeast #3.",
    "The Epoch Times has contacted the FBI for comment."
  ]
}