{
  "id": 11383,
  "mediaId": 2745,
  "date": "2022-03-18",
  "headline": "House passes Crown Act, banning discrimination against Black hairstyles",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QTGXVFVGYYI6ZBRIHWSPVD4HCQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/18/crown-act-house/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The legislation was introduced by Rep. Bonnie Watson Coleman (D-N.J.) and prohibits discrimination “based on the individual’s hair texture or hairstyle, if that hair texture or that hairstyle is commonly associated with a particular race or national origin.”\nAmong the hairstyles mentioned in the legislation are those “in which hair is tightly coiled or tightly curled, locs, cornrows, twists, braids, Bantu knots, and Afros.”\nMore than a dozen states have already enacted similar legislation, often with bipartisan support.",
    "The White House has said it strongly supports the House bill and “looks forward to working with the Congress to enact this legislation and ensure that it is effectively implemented.”\n“The President believes that no person should be denied the ability to obtain a job, succeed in school or the workplace, secure housing, or otherwise exercise their rights based on a hair texture or hair style,” the White House said in a statement earlier this week.",
    "“Here we are today standing on behalf of those individuals — whether my colleagues on the other side recognize that or not — who are discriminated against as children in school, as adults who are trying to get jobs, as individuals who are trying to get housing, as individuals who simply want access to public accommodations and to be beneficiaries of federally funded programs,” Watson Coleman said.",
    "In an interview with The Washington Post, Leah Goodridge, managing attorney for housing policy at the nonprofit legal services and advocacy organization Mobilization for Justice, noted that Black women in particular often face discrimination over how they choose to wear their hair when looking to buy a home, applying for loans, going on a job interview or simply doing their job.",
    "It’s a natural thing for African Americans, and they should not be penalized in the workplace, in sports, in school or in any other ways.”\nAn effort to fast-track Watson Coleman’s federal legislation last month failed to secure the two-thirds majority necessary for passage, with 15 Republicans joining all Democrats in supporting the measure.",
    "We must pass the Crown Act to give dignity and reaffirm the rights of all people: Wear your hair as you desire.”\nRep. Steve Cohen (D-Tenn.) said that, although he does not know what it is like to be discriminated as a Black person in the United States, he has been told “nasty things” for being bald.",
    "Black women, Jackson Lee said, are more likely to receive formal grooming policies, and most Black men “believed that they had to change their hair to be in the workplace.”\n“Just imagine the beauty of these hairstyles, Mr. Jordan, the beauty of these hairstyles,” Jackson Lee said.",
    "Well, that’s discrimination.”\nRep. Jerrold Nadler (D-N.Y.) called the legislation a “critically important civil rights bill” that has “real consequences for real people.”\n“Students have been sent home from school or told they could not walk at graduation,” Nadler said.",
    "Some people have even been denied jobs altogether because of their hairstyles.”\nDuring debate on the House floor Friday, Rep. Jim Jordan (R-Ohio) accused Democrats of distracting from issues that “the American people care about” by bringing it to the floor.",
    "Because there are folks in this society who get to make those decisions, who think because your hair is kinky, it is braided, it is in knots, or it is not straight and blonde and light brown, that you somehow are not worthy of access to those issues.",
    "In remarks on the House floor Friday morning, Watson Coleman cited examples of Black Americans who have been denied employment, housing, federal assistance or equal treatment because of how they chose to wear their hair.",
    "During last month’s debate, Rep. Lauren Boebert (R-Colo.) ridiculed the legislation, calling it “the bad hair bill” — a remark that proponents of the bill said demonstrates that such a bill is in fact necessary.",
    "At times as a student and in her own career, Goodridge said, others would pay undue attention to her hair when she wore it natural, often making her feel uncomfortable enough that she would straighten it.",
    "In one instance in 2019 that drew national attention, a 16-year-old African American wrestler in New Jersey was ordered by a White referee to cut his dreadlocks before a match or forfeit.",
    "2116 — or the Creating a Respectful and Open World for Natural Hair Act — passed on a vote of 235 to 189, with 14 Republicans joining all Democrats in supporting the measure.",
    "countered by saying that “when you say the American people don’t want it, you cannot exclude Black people.”\n“Black people would have this be on the floor,” Green said.",
    "Goodridge has now worn her hair natural for years and said that passing legislation such as the Crown Act is a much-needed step toward combating discrimination.",
    "The House on Friday passed the Crown Act, legislation that would ban discrimination against individuals based on how they choose to wear their hair.",
    "Nadler noted Friday that race-based discrimination is prohibited, but he said that some courts have erroneously rejected this interpretation.",
    "But Democrats today — Friday, March 18, 2022, with chaos all over the place — this is what they’re focused on.”\nRep. Al Green (D-Tex.)",
    "Other Republicans argued that the bill would be duplicative because federal legislation already prohibits race-based discrimination.",
    "“I’m just as good a human being and just as smart and just as effective and just as caring with or without hair,” Cohen said.",
    "“Natural hair is often looked at as inherently unkempt, regardless of how neat the actual hairstyle is.",
    "Because when Johnny comes home and he’s been fired because of his hair, that’s a kitchen table issue.",
    "“Employees have been told to change their hair because it violated their employer’s dress code.",
    "And African Americans have been discriminated against in many ways because of their hairstyle.",
    "… So we have a duty and obligation to do what we are doing.”\nRep. Sheila Jackson Lee (D-Tex.",
    "On Thursday, the Massachusetts House unanimously passed its own version of the Crown Act.",
    "… Mr. Jordan, we have engaged in a lot, but I will not stand down on the Crown Act.",
    "Rep. Tom Cole (R-Okla.) flipped his vote from “yes” in February to “no” on Friday.",
    "), responding to Jordan, said the House can “walk and chew gum” at the same time.",
    "… How about a world where inflation isn’t at a 40-year high?” Jordan said Friday.",
    "And Rep. Don Young (R-Alaska) voted “yes” in February but did not vote Friday.",
    "People who are severely discriminated against, young boys, young girls.",
    "“How about a world where gas prices aren’t five dollars a gallon?",
    "“How about a world where we’re actually energy independent?",
    "“And the fact is, it’s discrimination, and it’s ignorance.",
    "She added: “And why are they denied these opportunities?",
    "“This is a kitchen table issue in Black households.",
    "did not vote in February but voted “yes” on Friday.",
    "That in and of itself is anti-Blackness,” she said.",
    "Those are the issues we should be focused on.",
    "“This is what we’re talking about.",
    "Rep. Liz Cheney (R-Wyo.)",
    "That’s unemployment.",
    "The measure, H.R."
  ]
}