{
  "id": 11428,
  "mediaId": 2724,
  "date": "2022-03-07",
  "headline": "Republican Rep. Mike Rogers: Every Barrel Of Russian Oil U.S. Buys Has ‘Ukrainian Blood On It’",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/03/2022.03.05-05.34-thepoliticalinsider-62239f3ae30b2.jpg",
  "link": "https://thepoliticalinsider.com/republican-rep-mike-rogers-says-every-barrel-of-russian-oil-u-s-buys-has-ukrainian-blood-on-it/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Hanson",
  "authorUrl": "https://thepoliticalinsider.com/author/john-hanson/",
  "termIds": [
    2119,
    2606,
    4905,
    1126,
    6678,
    6569,
    6672
  ],
  "sentences": [
    "— Ted Cruz (@tedcruz) March 4, 2022\nU.S. Energy Independence\nThe Republican said this change would be a matter of President Joe Biden standing up to “climate change lobbyists.”\n“But he’s got to be willing to have the strength to tell the environmental climate change lobbyists that we’ve got to do this because he’s the one that cut them all off when he took power, when he took the presidency, and now we’re paying a price for it,” Rogers said.",
    "What we need to be doing is reopening drilling on federal lands, reopening the XL pipeline that Biden stopped when he agreed to open the Nord Stream 2 pipeline.”\nHe continued, “We’ve got a lot of resources in this country that we can dramatically increase our production of natural gas and oil and be self-sustaining.”\nIt’s asinine that the US is STILL importing more than half a million barrels of oil per day from Russia.",
    "The fact is, and this is true of all your listeners, our gas prices are going to go up because of what’s happening in Ukraine because of the disruptive nature it has had to the energy sector, period.”\nLast week, a bipartisan group of legislators like by Joe Manchin offered a bill to stop Russian oil imports – which was promptly rejected by the Biden administration.",
    "One Republican congressman sees a problem with that, saying that each barrel America imports from Russia has “Ukrainian blood on it.”\nTrump went to the UN and called out countries for relying on Russian oil\nThe German delegation was caught on camera laughing at him for saying it pic.twitter.com/WDbwfOKvFN\n— Jewish Patriot ??",
    "(@MAGAJew2) March 6, 2022\nRep. Rogers: ‘Every barrel we buy, it’s got Ukrainian blood on it’\nAlabama Rep. Mike Rogers slammed current U.S. import practices given the tension over Ukraine during a recent interview on Mobile, Alabama radio FM Talk 106.5.",
    "The fact is we’re still buying a lot of Russian oil here in the United States.”\nSign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "Rogers’ comments are similar to those of Rep. Jim Jordan, who argued last week that Biden is essentially being held hostage by the far-left of his party.",
    "“Every barrel we buy, it’s got Ukrainian blood on it.”\n“There’s no reason for us to keep funding his illegal war,” Rogers continued.",
    "“His party is controlled by the left.”\n“The left actually wants to destroy the oil and gas industry,” Jordan contended.",
    "“It is going to be painful, but we should not be giving money to Russia to kill Ukrainians in this illegal war.",
    "“At a minimum, we should stop that because it’s got Ukrainian blood, every bit of it,” Rogers contended.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "Even as Russia continues to wage war on Ukraine, the U.S. continues to import oil from Russia.",
    "America needs to cut the resources Putin uses for war — his oil and gas revenues.",
    "“And when we stop buying Russian oil, it will go up even more,” he explained.",
    "America must boycott Russian energy and unleash our own domestic production!",
    "Even if Joe Biden wanted to do that, his party won’t let him,” Jordan said.",
    "Rogers there were better more energy sources that the U.S. should consider.",
    "“Russia — their economy is basically, they’re a gas station,” Rogers said.",
    "“Even Nancy Pelosi has come out to call for us to stop buying Russian oil.",
    "“That’s literally where almost half of their money comes from.",
    "Rogers said America must become more oil independent.",
    "They’re selling gas and oil to other countries.",
    "Biden ought to get the message pretty soon."
  ]
}