{
  "id": 11425,
  "mediaId": 6449,
  "date": "2022-03-07",
  "headline": "Liz Cheney’s Unjust War Against Trump",
  "image": "https://www.dailysignal.com/wp-content/uploads/220307_LizCheney.jpg",
  "link": "https://www.dailysignal.com/2022/03/07/liz-cheneys-unjust-war-against-trump/?utm_source=rss&utm_medium=rss&utm_campaign=liz-cheneys-unjust-war-against-trump",
  "mediaOutlet": "Daily Signal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allan Ryskind",
  "authorUrl": "https://www.dailysignal.com/author/aryskind/",
  "termIds": [
    0
  ],
  "sentences": [
    "“In what its members see as the best opportunity to hold Mr. Trump and his team accountable,” the Times continues, “the committee—which has no authority to pursue criminal charges—is using what powers it has in expansive ways in hopes of pressuring Attorney General Merrick B. Garland to use the Justice Department to investigate and prosecute them.”\n“Sentence First—verdict afterward” is not apparently a notion confined to the Queen in “Alice in Wonderland.” Her view of justice has been wholly embraced by Pelosi’s Democrat-stacked panel.",
    "What Trump asked Pence to do, she wrote in The Wall Street Journal, was not only “unconstitutional” but “illegal.”\nIf Pence had supported Trump, the Supreme Court might well have found his actions unconstitutional, since an overwhelming majority in the legal community agrees that the vice president has no power to overturn the Electoral College vote.",
    "Former federal prosecutor Randall Eliason told the Post: “The key in pretty much all these crimes would be proving corrupt intent, because Trump is going to come in and say, when he was pressuring Pence, ‘I was told by my advisers that he had this legal authority, and I was just repeating that.",
    "Fourteen Republican members of the House have also made a convincing case that many defendants convicted in connection with the Jan. 6 attacks did not engage in any violence, had no past criminal records, and, after their arrests, were denied standard medical care and access to attorneys.",
    "Beginning with George W. Bush’s victory in the 2000 presidential race, Democrats have contested three Republican victories in the 21st century, with two Democrat House members opposing Trump’s victory on the grounds that the Russians had illegally interfered in our elections.",
    "In a lead front-page story in The New York Times, the reader is told that the committee is employing prosecutorial techniques “typically used against mobsters and terrorists” as it seeks to “develop evidence that could prompt a criminal case” against Trump and his allies.",
    "The response: “[T]here is no evidence that he knew they were going to storm the building.”\nWhat about the pressure he put on Vice President Mike Pence to overrule Congress’ decision to approve Joe Biden as president, one of his most controversial actions?",
    "Since Jordan had been blocked from asking questions of any witness when Pelosi threw him off the committee McCarthy had appointed him to, he said he hoped that the Democrats would actually find out why there wasn’t a proper security presence that day.",
    "'”\nEliason added, “That could be pretty difficult [for a prosecutor] to overcome.”\nWhat also might be pretty difficult for a prosecutor to overcome is that Democrats have been aggressively challenging Republican presidential winners since 2000.",
    "Cheney could have told Pelosi that the panel would be seen as far less partisan by both the public and her GOP colleagues if she’d reconsider her decision to block two of Trump’s most vigorous and effective supporters.",
    "Democrats, however, are trying to use the House select committee, whose sole purpose is to find out what happened on Jan. 6, to prosecute the former president and his advisers for a crime they have yet to discover.",
    "She rushed to issue a statement on the Capitol steps, remarking: “I agree with what the speaker has done.” It’s hard to get more partisan on behalf of the Democrats and more anti-Republican than that.",
    "I’ve written previously about how the Post conducted a stunning investigative report quoting respected and impartial legal experts that Trump was not obviously guilty of any criminal act on Jan. 6.",
    "Moreover, Pelosi would know that she had an effective 9 to 4 majority, since Cheney, whose anti-Trump rhetoric is boundless, could be counted on to line up with the speaker on any important issue.",
    "On July 21, 2020, Pelosi blocked two of McCarthy’s choices, Reps. Jim Jordan and Jim Banks, each of whom supported Trump’s decision to contest the election, which they had every legal right to do.",
    "A big problem facing the former president is that House Speaker Nancy Pelosi’s committee may poison the well with its report that is scheduled to be released close to the off-year elections.",
    "“And frankly,” he added, “only the speaker can answer that question, so let’s see if the Democrats bring that up.”\nThat’s also a critical question that deserves an answer.",
    "When he told the crowd to march to the Capitol, did he know that a number of participants were going to smash their way into the building and assault police officers?",
    "Late last year, Cheney, more the vengeful accuser than an impartial observer, according to many who heard her carry on about Trump, was moving to have him prosecuted.",
    "But does anyone think the select committee’s report will be honest, thorough, and fair, as every American should desire, if Pelosi and Cheney are running the show?",
    "There are many things the select committee needs to investigate other than Trump and his advisers, though their actions need to be fairly assessed as well.",
    "The Republicans on the select committee, chosen by Pelosi, are Cheney and Rep. Adam Kinzinger, R-Ill., who have been in lockstep with the House leader.",
    "The Post took every major accusation tossed by Trump’s political enemies—including Rep. Liz Cheney, R-Wyo.—and had an answer for each and every charge.",
    "Couldn’t he be charged, she argued, with obstructing Congress while it was counting the electoral votes that would remove him from the White House?",
    "But it was neither unconstitutional or illegal for the president to tell Pence to carry out a policy some of his key advisers believed was lawful.",
    "(Photo: Chip Somodevilla/Getty Images)\nWho’d believe that two liberal-left newspapers might keep former President Donald Trump out of the slammer?",
    "To sound off, please email letters@DailySignal.com and we’ll consider publishing your edited remarks in our regular “We Hear You” feature.",
    "The vice chair of the committee, Cheney, has already delivered her verdict, long before the committee has concluded its investigation.",
    "Cheney had a chance here to partially reingratiate herself with fellow Republicans by coming to the defense of McCarthy’s two picks.",
    "His people, she could have stressed, need to see that the committee is not the lynch mob they strongly suspect it has become.",
    "Were there federal employees who acted as agents provocateurs on Jan. 6, urging those at the rally to break into the Capitol?",
    "Under its rules, Pelosi has complete authority, without the need to consult any Republican, to appoint eight of its members.",
    "When Rep. Thomas Massie, R-Ky., asked Garland if this accusation were true, Garland ducked the question completely.",
    "She's joined by Reps. Elaine Luria, D-Va.; Adam Schiff, D-Calif.; Zoe Lofgren, D-Calif.; and Jamie Raskin, D-Md.",
    "Sure, they can be biased and deserve the harsh condemnation they frequently receive from their critics.",
    "Democrats, she could have argued, would still outnumber Republicans on the panel by an 8 to 5 margin.",
    "Here’s a perfect example of how Cheney is tilting the committee against Trump and her own party.",
    "Nothing written here is to be construed as representing the views of The Heritage Foundation.",
    "Jordan had also voiced concerns that the select committee has to do more than focus on Trump.",
    "Remember to include the url or headline of the article plus your name and town and/or state.",
    "The minority leader, Kevin McCarthy, can appoint five, but only with the speaker’s consent.",
    "Rep. Liz Cheney, R-Wyo., speaks to the press after a U.S. House Jan. 6 committee hearing.",
    "But every once in a while, they will produce something that smacks of honest journalism.",
    "Unlike many conservatives, I relish reading The Washington Post and The New York Times.",
    "Cheney, however, was not in a charitable mood for her party or for elementary fairness.",
    "Many told the lawmakers they had been held in solitary confinement for several months.",
    "(Informed sources tell this reporter she’s still maneuvering to get him behind bars.)",
    "He’s a big supporter of the former president but he’s not opposed to a fair inquiry.",
    "From its inception, the committee has been stacked against Trump sympathizers.",
    "But there are a few other questions that need to be answered.",
    "The Daily Signal publishes a variety of perspectives.",
    "A video that surfaced is certainly incriminating.",
    "This piece was originally published by Newsmax.",
    "Surely these charges need to be pursued?",
    "(See Eliason’s supporting view above.)",
    "Have an opinion about this article?",
    "Did he urge the crowd to riot?",
    "Certainly not this reporter.",
    "The Post didn’t think so.",
    "But it’s true.",
    "Not one."
  ]
}