{
  "id": 1147,
  "mediaId": 8276,
  "date": "2022-02-15",
  "headline": "Here's how area members of Congress voted",
  "image": "https://www.gannett-cdn.com/presto/2021/10/26/NPRJ/110bf9a4-66dc-48d1-ba8b-1e29623d6ae9-OPED-VOTING-FILIBUSTER-EDITORIAL-LA.jpg?crop=5999,3375,x0,y305&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/02/15/heres-how-area-members-congress-voted-feb-4-10/6754148001/",
  "mediaOutlet": "bucyrustelegraphforum.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "NAYS: Bob Gibbs R-OH (7th); Jordan R-OH (4th)\nYEAS: Troy Balderson R-OH (12th)\nHouse Vote 2:\nHOMELAND SECURITY PURCHASING PRACTICES: The House has passed the Promoting Rigorous and Innovative Cost Efficiencies for Federal Procurement and Acquisitions (PRICE) Act (S. 583), sponsored by Sen. Gary C. Peters, D-Mich.",
    "A supporter, Sen. Robert Menendez, D-N.J., said Nathan would help the agency \"to be competitive with China's Belt and Road Initiative, to promote renewable energy development, and to support COVID-19 recovery, and, at the same time, to recognize and grapple with the complexity of these challenges.\"",
    "A supporter, Sen. Maria Cantwell, D-Wash., said Vekich had \"spent his life working in the maritime industry and knows the challenges we face in maritime, intermodal transportation, congestion, and continuing to move forward on how we advance our ports.\"",
    "Targeted News Service\nWASHINGTON — Here's a look at how area members of Congress voted Feb. 4 through Feb. 10:\nAlong with the week's roll call votes, the Senate also passed the Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act (H.R.",
    "The bill would establish a health benefits programs for Postal Service workers and retirees while ending a requirement that retirement health benefits be prepaid and would establish new budget and service reporting requirements for the Postal Service.",
    "NAYS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nSenate\nSenate Vote 1:\nD.C. SUPERIOR COURT: The Senate has confirmed the nomination of Donald Tunnage to serve as a judge on the Washington, D.C., Superior Court for a 15-year term.",
    "YEAS: Brown D-OH, Portman R-OH\nSenate Vote 5:\nINTERNATIONAL DEVELOPMENT: The Senate has confirmed the nomination of Scott Nathan to be chief executive officer (CEO) of the U.S. International Development Finance Corporation.",
    "A supporter, Sen. Dick Durbin, D-Ill., said of Stark: \"His expertise in adjudicating patents combined with his experience hearing appeals will be an asset to the Federal Circuit and to our industrious, inventive nation.\"",
    "YEAS: Sherrod Brown D-OH, Rob Portman R-OH\nSenate Vote 2:\nD.C. APPEALS COURT: The Senate has confirmed the nomination of Loren AliKhan to serve as a judge on the Washington, D.C., Court of Appeals for a 15-year term.",
    "4445), sponsored by Rep. Cheri Bustos, D-Maine, to bar arbitration agreements that prevent a party to the agreement from filing a sexual assault or sexual harassment lawsuit against another party to the agreement.",
    "Lewis, currently a senior official at the German Marshall Fund, was a State Department diplomat during the Obama administration and before that a Chamber of Commerce executive and private practice lawyer.",
    "3485), sponsored by Rep. David L. Cicilline, D-R.I., to have the State Department enact visa-blocking sanctions against foreigners accused of sexual orientation, sex or gender identity discrimination.",
    "YEAS: Brown D-OH, Portman R-OH\nSenate Vote 9:\nMARITIME COMMISSIONER: The Senate has confirmed the nomination of Max Vekich to serve on the Federal Maritime Commission for a term ending in mid-2026.",
    "An opponent, Rep. Claudia Tenney, R-N.Y., said: \"The bill's broad language has the potential to sweep in nonviolent conduct and impose visa restrictions on individuals engaged in that conduct.\"",
    "YEAS: Brown D-OH, Portman R-OH\nSenate Vote 7:\nFEDERAL APPEALS JUDGE: The Senate has confirmed the nomination of Leonard Stark to serve as a judge on the U.S. Federal Circuit Court of Appeals.",
    "YEAS: Brown D-OH\nNAYS: Portman R-OH\nSenate Vote 4:\nASIA FINANCING: The Senate has confirmed the nomination of Chantale Yokmin Wong to serve as the U.S. director on the Asian Development Bank.",
    "YEAS: Gibbs R-OH (7th), Balderson R-OH (12th)\nNAYS: Jordan R-OH (4th)\nHouse Vote 4:\nCONTINUING APPROPRIATIONS: The House has passed the Further Additional Continuing Appropriations Act (H.R.",
    "Wong was a senior official at the Millennium Challenge Corporation during the Obama administration, and was on the board of the Asian Development Bank during the Clinton administration.",
    "MacBride was a Justice Department lawyer and U.S. attorney in Virginia during the Obama administration and earlier was chief counsel to Senator Biden on the Senate Judiciary Committee.",
    "YEAS: Brown D-OH, Portman R-OH\nSenate Vote 6:\nEXPORT-IMPORT BANK: The Senate has confirmed the nomination of Reta Jo Lewis to serve as president of the U.S. Export-Import Bank.",
    "An opponent, Rep. Jim Jordan, R-Ohio, said the bill was more likely to benefit trial lawyers than workers, due to encouraging costly litigation while blocking arbitration.",
    "Maloney called the changes an effort \"to fix some of the serious problems that have been looming over the post office for years and threatening its financial stability.\"",
    "YEAS: Brown D-OH, Portman R-OH\nSenate Vote 8:\nTREASURY LAWYER: The Senate has confirmed the nomination of Neil MacBride to be the Treasury Department's general counsel.",
    "YEAS: Brown D-OH, Portman R-OH\nSenate Vote 3:\nAMBASSADOR TO GERMANY: The Senate has confirmed the nomination of Amy Gutmann to serve as U.S. ambassador to Germany.",
    "YEAS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nHouse Vote 3:\nPOSTAL SERVICE CHANGES: The House has passed the Postal Service Reform Act (H.R.",
    "AliKhan has been the District's solicitor general since 2018, was previously its deputy solicitor general, and before that was a Justice Department lawyer.",
    "House\nHouse Vote 1:\nSEXUAL HARASSMENT ARBITRATION: The House has passed the Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act (H.R.",
    "NAYS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nHouse Vote 5:\nGENDER AND VISAS: The House has passed the Global Respect Act (H.R.",
    "The bill would require the Homeland Security Department to annually publish online a report on agency measures to improve its procurement systems.",
    "Bustos said employment agreements that force employees to go to arbitration to settle such cases were unjust \"legal traps\" used against workers.",
    "Stark, a U.S. district court judge in Delaware since 2010, was previously an assistant U.S attorney and private practice lawyer in the state.",
    "Nathan, a longtime executive at the Baupost Group investment firm, was an official in multiple roles during the Obama administration.",
    "A supporter, Sen. Brown, D-Ohio, called Lewis \"the leader we need in the fight to help U.S. manufacturers compete globally.\"",
    "6617), sponsored by Rep. Rosa L. DeLauro, D-Conn., to extend funding for the federal government though March 11.",
    "Vekich, a former Washington state legislator, has since 2004 been an official at Puget Sound port groups.",
    "Cicilline said: \"This bill protects LGBTQI people from murder, torture and other forms of violence.\"",
    "Tunnage has been a civil rights trial attorney at the Justice Department since 2009.",
    "4445), which had passed the House in a roll call vote earlier in the week.",
    "Gutmann had been president of the University of Pennsylvania since 2004.",
    "3076), sponsored by Rep. Carolyn B. Maloney, D-N.Y.",
    "The vote, on Feb. 8, was 272 yeas to 162 nays.",
    "The vote, on Feb. 9, was 227 yeas to 206 nays.",
    "The vote, on Feb. 8, was 342 yeas to 92 nays.",
    "The vote, on Feb. 7, was 335 yeas to 97 nays.",
    "The vote, on Feb. 10, was 51 yeas to 43 nays.",
    "The vote, on Feb. 9, was 61 yeas to 33 nays.",
    "The vote, on Feb. 8, was 54 yeas to 42 nays.",
    "The vote, on Feb. 8, was 66 yeas to 31 nays.",
    "The vote, on Feb. 9, was 72 yeas to 24 nays.",
    "The vote, on Feb. 9, was 56 yeas to 40 nays.",
    "The vote, on Feb. 9, was 61 yeas to 35 nays.",
    "The vote, on Feb. 7, was 426 yeas to 5 nays.",
    "The vote, on Feb. 7, was 54 yeas to 39 nays.",
    "The vote, on Feb. 8, was 55 yeas to 41 nays.",
    "YEAS: Brown D-OH\nNAYS: Portman R-OH"
  ]
}