{
  "id": 12485,
  "mediaId": 2618,
  "date": "2022-03-06",
  "headline": "Fears Putin will use WNBA All-Star Brittney Griner, 31, as a 'high-profile hostage' after she was detained on arrival at Moscow airport three WEEKS ago with 'cannabis-filled vape pen': Faces 10 YEARS in jail",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/06/fears_putin_will_use_wnba_all-star_brittney_griner_31_as_a_high-profile_hostage_after_she_was_detained_on_arrival_at_moscow_airport_three_weeks_ago_with_cannabis-filled_vape_pen_faces_10_years_in_jail_80594.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Janon Fisher",
  "authorUrl": "",
  "termIds": [
    3371,
    4794,
    1047,
    1592,
    6569,
    6411
  ],
  "sentences": [
    "American women's basketball great Brittney Griner has been detained in Russia for at least three weeks after the two-time Olympic gold medal winner and seven time WNBA All-Star was arrested at a Moscow airport for allegedly having a vape pen filled with hash oil.",
    "Now Russia might use Griner as leverage\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Griner, 31, was detained last month while flying in to play for her Russian basketball team during the WNBA offseason, but there has been no confirmed date of when she was arrested.",
    "Sorry but if you are dumb enough to fly to a foreign country on the cusp of war, and do it with a vape pen full of hash oil then you belong in prison.",
    "It is very sad that officials, parents, or whoever is in authority does not educate how one should follow the laws in another country.",
    "I cannot remember the individual's name but he was petitioning the President of the USA to help him because he was going to be caned.",
    "Instead of ending up in court and prison, they’ll probably hold her for a while in jail as an inconvenience then release her.",
    "Just because US law is pretty lax re: marijuana and derivative products does not mean all nations' laws are the same way.",
    "Her last communication was on February 5 when she posted a photo to Instagram of her and her Phoenix Mercury teammates.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "She is going to find out what doing real hard time is like, she is going to be scared straight on steroids!",
    "She's a nasty, anti-American piece of work who the Russians are more than welcome to keep.",
    "Looks like just another stupid American carelessly bringing drugs into a foreign country.",
    "Oh, and Brittney, bless your heart, the dreads and the tats aren’t helping you.",
    "This reminds me of the case in Singapore during the Clinton administration.",
    "Your donation helps keep our discussions going and our voices heard.",
    "Leave the non-prescription junk at home when you travel abroad.",
    "Look like a ghetto queen, get treated like a ghetto queen.",
    "I never heard of this person and I doubt many people have.",
    "Better yet, simply leave the stuff alone, period.",
    "Some countries actually enforce their laws.",
    "The victim card only works in the USA.",
    "Never heard of her until this idiocy.",
    "Some folks are such slow learners.",
    "No bail for drug violations?",
    "Celebrity, check.",
    "In America, nope.",
    "Female, check.",
    "Black, check.",
    "Imagine that.",
    "#1 nails it.",
    "Spot on #3.",
    "Thank you."
  ]
}