{
  "id": 12542,
  "mediaId": 2618,
  "date": "2022-03-05",
  "headline": "White House: Congress must act soon to replenish COVID funds",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/05/white_house_congress_must_act_soon_to_replenish_covid_funds_80554.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zeke Miller",
  "authorUrl": "",
  "termIds": [
    4794,
    3858,
    3224,
    3448,
    1433,
    6395,
    6396
  ],
  "sentences": [
    "“I mean this sincerely — name me something\nThe shocking announcement that CNN+ would be shutting down operations less than a month after it launched has left out-of-work staffers “aghast and furious” over the company’s handling of what sources inside the network call “an absolute debacle.”“This is f–king crazy, it is nuts,” a CNN insider told The Post.“This literally rivals the epic disaster of Quibi,” the insider said, referring to Jeffrey Katzenberg’s short-lived streaming platform that went out of business just seven months after it launched in April 2020.CNN+ — which one insider estimated the network spent $300 million launching and between $100 million and $200 million advertising —\nIn a leaked recording of Kevin McCarthy on a call with Liz Cheney and other House Republicans, the Minority Leader told Cheney that he would counsel Trump to resign back on January 10, 2021.",
    "3 House Republican, and McCarthy was posted Thursday night\nMitt Romney’s going to need a good lawyer: Tulsi Gabbard is coming after him with a vengeance for the libelous lies he spread about her, having just sent a cease-and-desist letter to Mitt demanding that he stop spreading the “treasonous lies” lie about her.The brilliant, strongly worded letter (perhaps Romney could learn a thing or two about how to have a spine by reading through it a few times), starts on an unapologetically strong note, saying:Dear Senator Romney: Our firm represents former Representative and Lieutenant Colonel Tulsi Gabbard (“Representative Gabbard”) regarding false and defamatory statements you made about Representative Gabbard on Twitter.",
    "The new policy, which Frey proposed in March, no longer allows Minneapolis police to apply for or execute no-knock warrants, no longer allows Minneapolis police to request or respond to requests from agencies in other jurisdictions, and requires Minneapolis police to knock or announce their presence and purpose for entry at least 20 seconds before executing the warrant, or at least 30 seconds before executing the warrant if it’s between 8 p.m. and 7 a.m., among other requirements.",
    "President Joe Biden will reportedly address these issues – amongst many more – dogging his administration in an election year with the simple mantra: “It’s not my fault, blame the Republicans.” According to an Associated Press (AP) report Friday, the president will seek to portray himself as a man of action stymied at every turn by the GOP in a spectacular attempt at electoral blame shifting in the run up to the midterm elections come November.",
    "The triple-threat from Philadelphia, born Robert Louis Ridarelli, was famous for such hip-swinging rock & roll hits as “Volare” and “Wild One,” and acted alongside Ann-Margret, Dick Van Dyke and Janet Leigh in the Oscar-nominated “Bye Bye Birdie.”\n“This is where you can see what someone’s been exposed to,” says Howard Dotson, pointing to a child’s drawing of several buildings ablaze and an artillery piece pointing at them.",
    "But to hear the liberal media tell it, upset parents showing up to school districts around the country were simply racists\nThe instructor was teaching police officers how to write more effective reports and offered several tips such as how to “prepare the script” and portray officers as “victims.” In the webinar, officers were also scolded for documenting injuries suffered by suspects during fights with police.",
    "Jamie Raskin, who serves on the January 6th Committee, recently claimed while speaking at Georgetown University that he and his colleagues will present “evidence” that Donald Trump coordinated with white nationalist and fascist groups “in order to support the coup.” This comes via NBC News, which reported on Raskin’s comments.",
    "“The Republicans know enough to insist on a clean extension of Title 42, not one encumbered with the Democrats’ wish list items,” she said, adding:\nSoaring gas prices, historic inflation, supply chain bottlenecks, lifting crime rates, a porous southern border, and increasing U.S. absences on the global diplomatic stage.",
    "(Snip) “We have to put the industry on notice: You’ve got six years, eight years, no more than 10 years or so, within which you’ve got to come up with a means by which you’re going to capture, and if you’re not capturing, then we have to deploy alternative sources of energy,” the one-time presidential candidate said.",
    "The New York Times reported:Former President Barack Obama on Thursday called for greater regulatory oversight of the country’s social media giants, saying their power to curate the information that people consume has “turbocharged” political polarization and threatened the pillars of democracy across the globe.",
    "According to Fox News: “Today marks 25 consecutive years, six months, and 15 days...\"\nUniversities are increasingly offering graduation events focused on participants’ identities and segregated by race, ethnicity, sexual orientation and even income, according to a report by a conservative education publication.",
    "NBC 10 noted that those who violate the proposed mandate would “face a civil penalty of $50 and shall owe twice the amount of personal income taxes.” Employers would be responsible to enforce the mandate and require vaccine proof from employees or face a $5,000 fine for each worker who is unvaccinated.",
    "Tell Hunter Biden to pay his back taxes with interest; tell Joe to tell us how much he has hidden in Delaware; Wasn't it Margaret Thatcher who said,\"We will soon run out of other people's money/\" Well, tell the Democrat/Socialists to stop spending our money like it grows on trees in their back yard!!!!",
    "While Hannity’s accomplishment is indeed impressive, when we consider that Hannity is still only 61-years-old and that Larry King continued hosting Larry King Live into his late-70s, the milestone becomes even more remarkable and leaves us to wonder: For how long can Sean go?",
    "This letter concerns an urgent matter\nAccording to a press release from Fox News, with last night’s broadcast legendary conservative talk radio and cable TV host Sean Hannity surpassed the late Larry King as the longest-running host of a primetime show in television history.",
    "Prosecutors say 18-year-old Terrence Mather-Lymon of Minneapolis was riding a motorcycle for the first time on April 11 when he passed a number of stopped vehicles and the bus, with stop arm extended and lights flashing, before hitting the 10-year-old in a marked crosswalk.",
    "Campus Reform, which is published by the Leadership Institute in Arlington, Virginia, reported last week that more than three dozen colleges and universities are holding graduation events this summer to recognize groups based on race, gender and sexual orientation.",
    "“I don’t think there’s any incentive for the Republicans to deal,” amid Democratic threats to lift the Title 42 border barrier against migration, responded Jessica Vaughan, the policy studies director at the Center for Immigration Studies.",
    "At the peak of the Critical Race Theory controversy in June of 2021, I was invited to Waukesha, Wisconsin to give a speech in front of a crowd of what was supposed to be a few hundred people about my thoughts on race and CRT in schools.",
    "Republican Rep. Liz Cheney is denying she leaked a tape of a conversation with House Minority Leader Kevin McCarthy in which he says he'll push former President Donald Trump to resign from office after the January 6 Capitol attack.",
    "Minnesota’s event will honor St. Paul native Toni Stone, who was the first woman to play in the Negro Leagues (snip) Registration is $75 per player ($50 for 8 and under) and also includes four tickets to the Twins game on June 10.",
    "The natural gas industry sees itself in a continuing\nDemocrats and their business-backed allies are hinting they want the Republicans to okay more legal migration in exchange for keeping border barriers against illegal migration.",
    "President Biden’s climate envoy, John Kerry, says he’s putting the natural gas industry “on notice,” suggesting it has a decade at most to solve for the emissions that are driving Earth’s temperature dangerously higher.",
    "Carrying 50 pounds of donated crayons and 1,000 pieces of paper, he hosted ‘art circles.’\nMinneapolis man is accused of kidnapping and robbing a man, then lighting his unconscious accomplice on fire earlier this month.",
    "(snip) Leslie, who sits on the company’s Law Enforcement Advisory Council, says Lexipol’s automatic policy updates are a more efficient way of keeping rules for officers up to date, and cuts down on legal settlements.",
    ":-) (If Congress does it, it will be free - they don't even have to pay postage)\nBack in January, when Biden had his sign up for the free at home COVID test kits, both my spouse and I signed up through the website.",
    "Why Now with Omicron all the \"rage\" all the CDC needs is 52 cents apiece for a stamp to send each \"victim\" a letter of congratulations on having a case of sniffles and newly acquired immunity to the \"China Virus.\"",
    "A federal judge rejected Girl Scouts’ claims Thursday that the Boy Scouts created marketplace confusion and damaged their recruitment efforts by using words like “scouts” and “scouting” in recruitment drives.",
    "A Minnesota man connected to a scheme to launder millions in federal child nutrition funds has been charged after he was caught attempting to leave the country with a fraudulently obtained passport.",
    "State lawmakers in Rhode Island are pushing legislation that would require every person in the state 16 years of age and older to be vaccinated against COVID-19 and punish those who refuse to do so.",
    "Manhattan Judge Alvin K. Hellerstein ruled the Boy Scouts of America can describe their activities as “scouting” without referring to gender and that the matter does not need to be put to a jury.",
    "Minneapolis police were called to the area of 38th Street and Chicago Avenue (snip) the suspects drove around Minneapolis using narcotics, until one of Graham’s accomplices became unconscious.",
    "Columbia University, Harvard University, Ohio State University, Illinois State University and the University of Texas at Austin are among those offering special ceremonies for Black graduates.",
    "If you're COVID-19 deputy coordinator Natalie Quillian, your agency will always need more money because that's the source of your personal power and keeps the money flowing into your pockets.",
    "“The hearings will tell a story that will really blow the roof off the House,” Raskin said Thursday at an event hosted by Georgetown University’s Center on Faith and Justice in Washington.",
    "(snip) Prosecutors allege that Ismail, a native Somali who immigrated to the U.S. and later gained citizenship in 2005, later applied for a new passport, claiming he had “lost” it at home.",
    "“I think [impeachment resolutions] will pass, and it would be my recommendation you should resign,” McCarthy said he would tell Trump before further adding, “what he did is unacceptable.",
    "It noted that 305,000 girls are currently enrolled in its programs and that since full participation was permitted beginning in 2019, more than 2,200 females have become Eagle Scouts.",
    "“They came from Kyiv, where there’s bombings.” (snip) So on March 11, Dotson went overseas, traveling on the European rail lines used by refugees fleeing from Ukraine into Poland.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "(Tweet) In a speech at Stanford, Obama called for more government oversight over the Big Tech industry that is already trampling all over Americans’ rights to free speech.",
    "Nobody can defend that and nobody should defend it.”Liz Cheney had pressed McCarthy about whether Trump could possibly choose to resign on his own: “Is there any chance?",
    "600 people showed up— (snip) This wasn't a Trump rally filled with politically active people; on the contrary, it was a crowd of concerned parents who wanted to learn.",
    "Graham allegedly tried to beat the accomplice awake in the vehicle, but after that didn’t work, went back to the abandoned gas station and lit the accomplice on fire.",
    "Yet, the two items of swag seen most often were masks and hand sanitizers at sponsor booths when it seemed like a good idea when they had to order them months ago.",
    "Minnesota 5th District Congresswoman Ilhan Omar took a lot of criticism from both Republicans and Democrats for her vote against a Russian oil ban last month.",
    "“We’re in conversations with lawmakers about how to secure the funding, but it’s urgently needed.” Some of the consequences could be felt later this month.",
    "“I don’t think it’s actually that controversial,” Omar said.. (snip) Omar is also authoring a bill in Congress to restrict the use of “no-knock” warrants.",
    "A young man is charged with riding a motorcycle through a deployed school bus stop arm and hitting a student as he crossed the road the road in Edina.",
    "A South Carolina mother had both arms amputated and her colon removed after she was mauled by two pit bulls and a mixed breed dog earlier this week.",
    "Democrats are making loud noises about January 6th again, claiming that coming revelations will “blow the roof” off the House of Representatives.",
    "Representative Cheney did not record or leak the tape and does not know how the reporters got it,' Cheney's spokesperson said, according to CNN.",
    "The Minnesota Twins, St. Paul Saints and Baseball For All are planning to host the “Baseball For All Toni Stone Invitational” on June 11 and 12.",
    "Desmond Durelle Graham, 31, is charged with kidnapping, first-degree aggravated robbery, third-degree assault and financial transaction fraud.",
    "It passed overwhelmingly in the House by a vote of 414 to 17, with just Rep. Omar, one other Democrat, and 15 Republicans voting against it.",
    "(snip) A good Samaritan saw Waltman being mauled by the dogs and was able to scare the animals off by firing his gun into the air.",
    "Trust the government to give you eternal life by just rolling up your sleeves and getting jabbed and boosted 3-4 times a year.",
    "Regular testing masking up hand sanitizing and social distancing is the key to real obedience and surrender of your free will.",
    "I would say the health crisis is gone, but the democrats don't want to lose the new-found authority they were able to wield.",
    "This is why USA is doomed; our massive fedgov will keep spending money until we're all broke and the dollar is worthless.",
    "(Snip)Other schools are hosting special graduations to recognize LGBTQ, first-generation immigrants, women and low-income",
    "Guess now that Zuckbucks have been deemed bribing officials they need to find other sources of \"walking around money\".",
    "Kyleen Waltman, 38, was savagely attacked by the pit bulls while she was out on a walk Monday morning, WYFF reported.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Apparently those test kits were part of a billion dollar government contract that Biden handed to Chinese companies.",
    "Almost no one was wearing a mask, except the few seconds to enter the building, but it was quickly removed by most.",
    "Thursday, Minneapolis Mayor Jacob Frey talked about the new Minneapolis no-knock search warrant policy in the city.",
    "We must have more nasal swabs out there that implant micro spikes of dangerous chemicals right next to your brain.",
    "Local outlet NBC 10 reported Tuesday that two state Senators have removed their names from the bill, Bill S.2552.",
    "'The select committee has asked Kevin McCarthy to speak with us about these events but he has so far declined.",
    "Before Congress passes out anymore COVID money, they should follow the money on the past Government contracts.",
    "Bobby Rydell, the 1960s teen heartthrob who appeared in the 1963 musical comedy “Bye Bye Birdie,” has died.",
    "Lots of hand shaking and hugging, as it had been a few years since the conference had been held in-person.",
    "FTA: “From the COVID side, the bank account is empty,” said COVID-19 deputy coordinator Natalie Quillian.",
    "Plans for what is believed to be Minnesota’s first-ever girls baseball tournament have been announced.",
    "Court documents show Mohamed Jama Ismail, 49, of Isanti, is charged with one count of passport fraud.",
    "(snip) He told them it was the first time he had ever ridden a motorcycle and did not have a license.",
    "Obama is super wealthy now; how about telling him to pay back the billions in cash he sent to Iran.",
    "Biden said everyone who signed up would have the test kits mailed out to them in eleven days.",
    "After denying he made such comments, audio of a conversation between Cheney, then the No.",
    "He has not been charged in connection with the investigation into Feeding Our Future.",
    "(snip) In a statement, the Boy Scouts said the ruling had vindicated its position.",
    "Up to today neither my spouse or I have received any home test kits by mail.",
    "(snip) These are normal, middle class parents with reasonable concerns.",
    "Your donation helps keep our discussions going and our voices heard.",
    "He passed just weeks before he would have turned 80 on April 26.",
    "You know, to keep people feeling safe and protected from dying.",
    "Barack Obama and Hillary are pushing for government censorship.",
    "Was just at a large conference, with thousands of people.",
    "According to Variety, the cause of death was pneumonia.",
    "To hell with individual rights and the Constitution.",
    "(snip) are named after famous women in baseball.",
    "Obama was a big part of this censorship.",
    "For scientific purposes of course.",
    "Thank you.",
    "He was 79.",
    "."
  ]
}