{
  "id": 12557,
  "mediaId": 2550,
  "date": "2022-03-02",
  "headline": "Republicans’ Nutcase Caucus undaunted by party leadership’s feckless response to extremism",
  "image": "https://images.dailykos.com/images/1043954/story_image/GettyImages-1238864537.jpg?1646255898",
  "link": "https://www.dailykos.com/stories/2022/3/2/2083459/-Republicans-Nutcase-Caucus-undaunted-by-party-leadership-s-feckless-response-to-extremism?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Neiwert",
  "authorUrl": "/users/david neiwert",
  "termIds": [
    2187,
    2443,
    4591,
    4066,
    2887,
    1126
  ],
  "sentences": [
    "Republican Senate Minority Leader Mitch McConnell offered only a statement from his office: “There’s no place in the Republican Party for white supremacists or anti-Semitism.” GOP national committee chair Ronna McDaniel would only offer a similarly generic condemnation: “White supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.”\nThe far-right House Freedom Caucus’ newly elected leader, Congressman Scott Perry of Pennsylvania, and its cofounder, Jim Jordan of Ohio, responded along similar lines asked about Greene and Gosar: They condemned racism, but declined to criticize either by name, or to criticize Fuentes.",
    "After he criticized Biden’s handling of the Ukraine crisis Tuesday on the House floor, House Rules Committee Chairman Jim McGovern of Massachusetts retorted that Republicans had no standing as long as their members spoke at conferences where the audience chanted for Vladimir Putin and the organizer joked about Putin’s resemblance to Hitler as a “good thing.”\n“Look, I also wish, because I think it would be helpful for this country and a signal to the world, if the gentleman who just spoke would reprimand members of his own party who cozy up to white nationalists and go to pro-Putin rallies,” McGovern said.",
    "When another reporter asked McCarthy on Tuesday whether he plans to endorse primary challenges to Gosar and Greene—having endorsed Congresswoman Liz Cheney’s rival in Wyoming—he still demurred: “I made my statement yesterday.”\nNo Republican leaders were willing to comment on the behavior of the congressional scofflaws, let alone the profound irresponsibility of allowing their official positions to help legitimize such extremists.",
    "“He won’t because she has power, let’s be honest, but I’m embarrassed by it.”\nAnother Republican figure—Arizona legislator Wendy Rogers—who participated in the America First PAC gathering was censured by the state Senate Tuesday not just for participating in the gathering, but for the rhetoric she had used in her address: “When we do take back our God-given rights, we will bring these criminals to justice,” she said.",
    "Of course, he hadn’t answered it: The day before, he had called the rhetoric used by conference organizer Nick Fuentes “appalling” and said the “language that he uses about antisemitism and the chanting for Putin is unacceptable”—but that the only thing he intended to do about it was “have a discussion” with Greene and Gosar.",
    "“That would send a signal to people in this country and to people around the world whose side we're on.”\nMcCarthy “needs to do a press conference today denouncing Greene, Gosar, Fuentes, announcing Greene and Gosar are out of the conference, there’s no room for this,” Kinzinger noted.",
    "Indeed, McCarthy had previously suggested the Georgia congresswoman—currently barred by Democrats from holding any committee positions—would be promoted if Republicans take control of the House in the fall elections, and he gave no indication that had changed.",
    "He and his fellow leaders in the GOP are afraid to call out their seditionist cohorts because they know all too well that they represent the very real tide of far-right extremism that has consumed their base—and they are now its captives.",
    "Greene repaid his restraint that evening at the State of the Union address by joining her fellow QAnon fan, Lauren Boebert of Colorado, in interrupting President Biden’s speech repeatedly, howling out Trumpian slogans like banshees.",
    "Kevin McCarthy, the Republican House Minority Leader, didn’t want to talk about the two far-right extremists—Marjorie Taylor Greene and Paul Gosar—in his caucus who spoke at a white-nationalist convention in Florida last weekend.",
    "Moreover, it’s clear that neither Greene nor Gosar will face any further reprimand or rebuke for what is now an ongoing and all-too-familiar pattern of dangerous associations with the worst kind of extremists.",
    "The only Republicans willing to speak up were the two members censured by Republican leadership for participating in the Jan. 6 commission, Cheney and Congressman Adam Kinziger of Illinois.",
    "Kevin McCarthy at Tuesday press conference: ‘I’ve already answered that.’\nMcCarthy’s silence reflects how firmly in the grip of conspiracist nutcases the Republican Party has become.",
    "“This may be a chance to burn out the cancer of the Republican Party — those that are, you know, Putin sympathetic,” said Kinzinger, who nonetheless figure that nothing will happen.",
    "They have yet to be justly punished for the crimes they’ve committed.”\nRogers was defiant after the 24-3 censure vote, claiming her colleagues were attacking her free-speech rights.",
    "The network’s hosts helped turn Greene into a GOP grassroots phenomenon and could pay a price with viewers if they were perceived as now trying to push her out of the party.",
    "Marjorie Taylor Greene gets nasty after another House member told her to pipe down during Tuesday's State of the Union address, which she repeatedly interrupted.",
    "If we try some of these high-level criminals, convict them, and use a newly built set of gallows, it will make an example of these traitors to our country.",
    "The question he wouldn’t answer was whether he would take any action beyond that—and his refusal to answer gives tells us all we need to know.",
    "“He’s not going to do that.”\n“I’m glad he said something but she [Greene] should be kicked out of the conference,” Kinzinger told HuffPost.",
    "But Fox’s advertisers might revolt at a particularly vulnerable moment if the network vocally defends Greene’s white nationalist outreach.",
    "As Media Matters’ Matt Gertz observes:\nA GOP debate over whether the party coalition should include white nationalists puts Fox in a bind.",
    "When another journalist returned to the question, he retorted sharply: “I’ve already answered that,” and walked away from the podium.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Unsurprisingly, there also has been zero mention of the Republican involvement in the weekend convention on Fox News.",
    "“I’ve already commented on that,” he said when a reporter asked about the situation in a press conference Tuesday.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "McCarthy has already faced blowback over his spinelessness.",
    "I will not back down,\" Rogers said Tuesday.",
    "“I’ve said we need to build more gallows.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "\"I do not apologize.",
    "Please read it."
  ]
}