{
  "id": 12676,
  "mediaId": 2618,
  "date": "2022-03-06",
  "headline": "Fears grow for Ukrainian civilians after checkpoint is shelled and evacuations fail for a second day",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/06/fears_grow_for_ukrainian_civilians_after_checkpoint_is_shelled_and_evacuations_fail_for_a_second_day_80610.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Lister *",
  "authorUrl": "",
  "termIds": [
    3246,
    300,
    253,
    514,
    838,
    6672,
    6678,
    6569,
    6509,
    6246
  ],
  "sentences": [
    "Fellow citizens, not one more of our dollars, not one single American soldier or plane should be sent to die in a country that has been a corrupt cash cow for the F Joe Biden, Clinton, and Pelosi crime families over the years.",
    "Ukraine is a weapon of mass distraction propaganda using the very same tactics used to instill mass fear of the Chinese Wuhan Bioweapon Flu and take away our liberties and Steal the Election.",
    "It's sole purpose is to distract upon what is happening to us all every single day of our lives and of course take away all of our liberties while funneling billions to our Ruling Class.",
    "CNN, MSNBC, ABC, and especially the phony so-called Fair and Balanced Fox News -How about reporting the war against the citizens of the United State by their own federal government?",
    "How about the Wuhan Bioweapon Flu which killed hundreds of thousands of Americans (if you believe the CDC) unleashed against us in an Act of War by China?",
    "How about the deadly China Wuhan Flu vaccines administered upon fear stricken, gullible US citizens and their children by a criminally corrupt CDC?",
    "How about the war on our oil and gas industry which we depend on for over very survival and basic needs like food, heat, gas?",
    "Every year we have a Hundred Thousand deaths from drug overdoses sent into this country by our real enemy China.",
    "No more Iraq's, Afganistan's, and especially no war with a nuclear armed country like Russia.",
    "We have our own war to fight here at home against the communist death democrats.",
    "I feel very badly for the Ukrainians but it is their fight.",
    "No American money or forces should be sent to Ukraine.",
    "America First!",
    "Insanity!"
  ]
}