{
  "id": 12956,
  "mediaId": 2618,
  "date": "2022-03-05",
  "headline": "Biden claims he enjoyed ‘teaching’ and misses ‘being a professor at Penn’. Except he never taught there.",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/05/biden_claims_he_enjoyed_teaching_and_misses_being_a_professor_at_penn_except_he_never_taught_there_80582.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Haggerty",
  "authorUrl": "",
  "termIds": [
    5510,
    2941,
    4905,
    4794,
    6678
  ],
  "sentences": [
    "“I wanted to hear from a historic figure in a historic time about how he thinks about America in this pivotal moment,” Richardson said of the conversation, “to put the specifics of what he does in a larger context.”\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "He just cannot stop himself from making up stories in which he LIES HIS JACKASS OFF, an NO ONE in the media will every call him out for it--\nNo #27, I don't believe anywhere near that number honestly and legally voted for him but as long as there are copiers and printing presses, who needs voters ??!!",
    "President Joe Biden reaffirmed that he has lost touch with reality, taking shots at Sen. Joe Manchin (D-WV) before bulking up his resume with a job he’s never held.Boston College history professor Heather Cox Richardson recently released an interview with Biden that was conducted on February 25.",
    "\"I give you my word as a Biden...you can take THAT to the Bank\"\nFTA: \"As the Russian invasion of Ukraine was underway, inflation had reached a 40-year high and the price of fuel was already negatively impacting a strained economy, Biden did not promote a return to American energy independence.\"",
    "Biden is incapable of even grasping the concepts of how to get America's spirit and economy in high gear, having no core beliefs to fall back in an over-lengthy career of lies and deceit, the real Biden character.",
    "I suppose that we could blame TaliBiden’s decades of lies on the two brain aneurisms and surgeries he had back in the 80’s and his dementia today, but he was doing it long before either occurred.",
    "40 years ago, Regan's second year in office, he put conservative, supply-side economics into in policy decisions, including large, across the board tax cuts.",
    "The Carter recession ended in 1982, and as a bonus we got a record defense buildup that broke the Soviet Union, thrown in for good measure.",
    "Dementia Joe, Heels up cackles, Blinken, Milley, and Austin are incredibly weak and all the bad actors in the world are taking advantage.",
    "Is JoeDementiaBamaBiteMe going to Delaware each weekend for some sore of medical treatment or infusion to keep him on his feet?",
    "Joe \"Dementia\" Biden \"For some people living with dementia, their brain misinterprets the information from their senses.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "And for those who wonder why the nuclear clock is at 11:59 and 30 seconds, WEAKNESS is the reason.",
    "Slaps his name on a building, or rather had the buildings name changed, he \"Didn't build that\".",
    "Inflation was still high but the economy turned completely around from the Carter days.",
    "If you think Putin will stop with Ukraine, I have a bridge in Brooklyn I can sell you.",
    "While Jill gets ready for another photo-op before anxiously hoping to be in Delaware.",
    "Tell me again how Biden works out every morning and is mentally sharp as he ever was.",
    "The guy is, quite simply, a huge pile of vermin excrement and always has been.",
    "Tie up their phones every day so they can not get anything done period.",
    "Your donation helps keep our discussions going and our voices heard.",
    "They have lied to America and put all of us and the world at risk.",
    "From what I've read, he is just about as sharp as he ever was !",
    "That alone saved untold trillions in deferred Cold War costs.",
    "Call the Democrats in Congress and DEMAND they resign ASAP!",
    "How much longer are we going to put up with this crap?",
    "Just like Bill Clinton was “mentoring” Monica.",
    "Actually, the last part of that i'll buy.",
    "It’s time for action action action!",
    "I’ve had it as thus is ridiculous!",
    "This can lead to false beliefs.\"",
    "Gets paid $450K a year.",
    "Thank you.",
    "Yes, #16.",
    "!"
  ]
}