{
  "id": 13088,
  "mediaId": 2689,
  "date": "2022-02-28",
  "headline": "“Traitor! Traitor! Traitor!”: Mike Lindell SHUTS DOWN Fake News CBS Reporter At CPAC (VIDEO)",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/traitor-traitor-traitor-mike-lindell-shuts-down-fake-news-cbs-reporter-at-cpac-video-473513/",
  "mediaOutlet": "teaparty.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/6zVW0lE0Ni\n— Rep. Jim Jordan (@Jim_Jordan) January 3, 2022\nLetter from Bennie Thompson to Mark Meadows’ attorney concludes:\n“The Select Committee is left with no choice but to advance contempt proceedings and recommend that the body in which Mr. Meadows once served refer him for criminal prosecution” pic.twitter.com/ahiwtgTaub\n— Alayna Treene (@alaynatreene) December 8, 2021\nMyPillow CEO Lindell seen entering WH with some dramatic notes, including talk of ‘martial law’ https://t.co/VR2qNgnudR pic.twitter.com/FxRmrs75rT\n— Conservative News (@BIZPACReview) January 16, 2021\nhttps://twitter.com/SassyConservat1/status/1421178265146855424?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1421178265146855424%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fteaparty.org%2Fmike-lindell-goes-off-at-cyber-symposium-whistleblowers-office-raided-video-468292%2F\nThere's been a bit of drama at today's \"cyber symposium\" as Ron Watkins aka CodeMonkey (who is likely Q) reada statement from his lawyer that they need to stop their \"data review\" because hard drives may have been \"taken without authorization\" from Mesa County.",
    "In a sane world, the mainstream media would have been eager and interested to hear what Lindell had discovered but in wackadoodle, backwards America, the mainstream media went on a crusade of their own to destroy Lindell and anyone else who dared to declare the election was fraudulent.",
    "Being on Lindell’s turf, he was able to totally embarrass Robert Costa of CBS News, calling him a “traitor” and slamming CBS News as “disgusting.” He also got the crowd to join in and chant “traitor!” at the fake news reporter.",
    "He’s still at it and he’s still got as much vigor and determination as ever to fight against the corrupt Biden regime and the radical left, including their propaganda-pushing sycophants in the establishment media.",
    "What other word is there for someone who is supposed to be reporting factual information to the American public but instead pushes lies and propaganda thus deceiving the very people who trust them?",
    "https://twitter.com/ElectricTranspo/status/1481436883469041664\nhttps://twitter.com/nursey_girl/status/1482032676974604290\nMyPillow CEO Mike Lindell: \"This brings up the biggest problem we face.",
    "During the annual Conservative Political Action Conference (CPAC) in Orlando, Florida, over the weekend, Lindell came face-to-face with one of his many media adversaries.",
    "Lindell has been physically assaulted, major retailers have dropped his products, and he’s been slandered and harassed by media personalities across numerous outlets.",
    "(TeaParty.org Exclusive) – Mike Lindell, CEO of MyPillow, has proven himself to be a ferocious American patriot willing to risk it all for the truth and freedom.",
    "If there is ever justice for what happened in 2020, the media should be held accountable right alongside the agents of the Deep State who stole the election.",
    "Disgusting They’re disgusting\"#TrumpRally\npic.twitter.com/yjEFMoA5wa\n— Neo Jane (@NeoJane8) January 16, 2022\nNew letter from @RodneyDavis and @HouseAdmnGOP.",
    "After the 2020 rigged election in which the Biden regime usurped the White House, Lindell went on a crusade to prove the election was, in fact, stolen.",
    "Of course, his campaign used COVID as a cover and were always adamant about “social distancing” and limiting the number of people permitted in.",
    "The media knows this and they know that President Trump is actually the one who won more votes than any other president in US history.",
    "pic.twitter.com/nSf4HqrHl6\n— Justin Baragona (@justinbaragona) August 11, 2021\nhttps://rumble.com/embed/vibq7e/?pub=4\nCopyright 2022.",
    "traitor!“ pic.twitter.com/S62W17Je3U\n— Greg Price (@greg_price11) February 26, 2022\nWe can bet CBS News won’t be airing that segment.",
    "Do they actually believe Joe Biden won the presidency legitimately despite covering both his and Trump’s campaigns throughout 2020?",
    "In the midst of the so-called pandemic, President Trump drew crowds of thousands everywhere he went.",
    "The average American just might eventually be deterred from the fight but not Lindell.",
    "They are deliberately lying to us and have absolutely no shame in doing so.",
    "You have to wonder how many of them actually believe the lies they spew.",
    "He called him a “traitor to America“ and got everyone to chant “traitor!",
    "Mike Lindell was just confronted by CBS News’ Robert Costa at #CPAC.",
    "They are truly traitors to the American people and this country.",
    "It’s not the fake news media… It’s the conservative media.",
    "https://twitter.com/RSBNetwork/status/1425827638959083520?",
    "https://twitter.com/RSBNetwork/status/1425846925660655618?",
    "Meanwhile, Biden couldn’t attract gnats to his events.",
    "These leftist media lapdogs are truly disgusting.",
    "Mike Lindell is right in calling Costa a traitor.",
    "Fight on Mike Lindell, America is behind you!",
    "No one wanted to attend any Biden rallies.",
    "They have absolutely no integrity.",
    "One of them rhymes with Fox.",
    "The ones that don’t talk.",
    "It was all a sham.",
    "Give it a read.",
    "TeaParty.org",
    "traitor!"
  ]
}