{
  "id": 1312,
  "mediaId": 2672,
  "date": "2022-02-11",
  "headline": "Anti-Protest Conservatives Sure Do Love the Trucker Blockade Causing ‘Deep Pain’ to American Companies",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/02/canada-trucker-convoy-gop.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/canadian-trucker-convoy-protest-republicans-support-blockade-1298752/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Bort",
  "authorUrl": "https://www.rollingstone.com/author/ryan-bort/",
  "termIds": [
    0
  ],
  "sentences": [
    "General Motors has canceled multiple shifts at its plant in Lansing, Michigan, due to part shortages.”\nCarlson then lauded how the protest is causing “deep pain” to the industry, calling it “the single most successful human rights protest in a generation.”\nTucker: That blockade has forced Ford to shut down one of its manufacturing plants and to operate another plant with a skeleton crew.",
    "DeSantis — who respects freedom to protest so much he criminalized it last year through a bill that shields Floridians from liability if they happen to kill protesters — even falsely alleged that GoFundMe is using the donated money as they see fit instead of what they’re actually doing: returning it to the donors.",
    "“We now have evidence from law enforcement that the previously peaceful demonstration has become an occupation, with police reports of violence and other unlawful activity.”\nViolence and unlawful activity were, of course, precisely what Republicans cited to justify all of that anti-protest legislation.",
    "“This interruption on the Detroit/Windsor bridge hurts customers, auto workers, suppliers, communities and companies on both sides of the border that are already two years into parts shortages resulting from the global semiconductor issue, COVID and more,” Ford said in a statement released on Thursday.",
    "Some of that legislation focused on cracking down on protests that blocked roadways, which just so happens to be a pretty key component of the Canadian anti-vax trucker convoy the same conservatives who decried the Black Lives Matter movement are tripping over themselves to praise.",
    "Florida Governor Ron DeSantis and Texas Attorney General Ken Paxton announced recently that their respective states are launching investigations into why fundraising platform GoFundMe froze millions of dollars that had been donated to the convoy.",
    "God bless those truckers for standing firm.”\nJordan’s comments came in response to a question about how the protest is creating supply chain issues, which, as Carlson gleefully noted, is doing a number on the automotive industry.",
    "So, no, the Republicans politicians and conservative commentators who spent the early part of the winter melting down over supply chain issues don’t care about how the blockade is disrupting commerce.",
    "“The blockade has forced the Ford Motor Company to shut down one of its manufacturing plants, and to operate another plant with a skeleton crew,” the Fox News host said on his show Thursday night.",
    "The prospect of such a shutdown is far-fetched, but NPR on Thursday obtained a Department of Homeland Security memo warning that tuckers could block roads in American cities in the coming weeks.",
    "Matt Gertz of Media Matters pointed out on Friday that the network’s coverage of the convoy has skyrocketed in the past week, with commentators pushing for an American version of the protest.",
    "One of the roads they’ve blocked is the Ambassador Bridge, a thoroughfare between Windsor, Ontario, and Detroit that carries 25 percent of all trade between Canada and the United States.",
    "“GoFundMe supports peaceful protests and we believe that was the intention of the Freedom Convoy 2022 fundraiser when it was first created,” the company said in a statement last week.",
    "GM has cancelled multiple shifts.. pic.twitter.com/vxzWds7aih\n— Acyn (@Acyn) February 11, 2022\nCarlson represents only a fraction of Fox News’ coverage of the convoy.",
    "The demonstrations were overwhelmingly peaceful, but the GOP cast the entire movement as violent, paving the way for several states to pass anti-protest legislation.",
    "GOP-led states passed similar legislation a few years earlier in response the wave of demonstrations objecting to newly elected President Donald Trump.",
    "They raised hell about how restrictions meant to prevent a pandemic from killing people were slowing the gears of the economy, but this is fine.",
    "They’re defending Canada, but they’re defending America as well.”\n“They’ve had it,” added Rep. Jim Jordan (R-Ohio), also speaking on Fox News.",
    "It is a fraud for @gofundme to commandeer $9M in donations sent to support truckers and give it to causes of their own choosing.",
    "Republicans were appalled in the summer of 2020 when Black Lives Matter demonstrations broke out in cities across America.",
    "The truckers have now brought Ottawa to a standstill, forcing the closure of businesses and terrorizing citizens.",
    "I will work with @AGAshleyMoody to investigate these deceptive practices — these donors should be given a refund.",
    "GoFundMe’s explanation for why they froze the fundraiser is pretty simple and not very controversial.",
    "“The Canadian truckers are heroes,” Sen. Ted Cruz (R-Texas) told Maria Bartiromo earlier this week.",
    "The blockade has cause a supply chain crisis that is wreaking havoc on international commerce.",
    "— Ron DeSantis (@GovRonDeSantis) February 5, 2022\nThere’s nothing to investigate here, though.",
    "Republican politicians, as they are wont to do, are following their favorite network’s lead.",
    "Toyota says it won’t be able to manufacture vehicles in Ontario for the rest of the week.",
    "“Toyota says it won’t be able to manufacture in Ontario for the rest of the week.",
    "Some Republicans are using their power to help ensure the convoy is well-funded.",
    "“They are patriots and they are marching for your freedom and for my freedom.",
    "“They are so sick of the double standard, so sick of the mandates.",
    "Some have even called for truckers to shut down the Super Bowl.",
    "The memo mentioned the Super Bowl as a potential target.",
    "This, Tucker Carlson says, is a good thing.",
    "What they want is what God gave them.",
    "That’s what this is all about.",
    "In fact, it’s encouraged.",
    "Freedom."
  ]
}