{
  "id": 13142,
  "mediaId": 2741,
  "date": "2022-03-03",
  "headline": "“His Comments on Putin Should Disqualify Him From Ever Again Running”: Can Trump Escape His Love of the Russian Leader?",
  "image": "https://media.vanityfair.com/photos/6220f8c5ed5f0299e82dc3fa/16:9/w_1280,c_limit/trump-putin-comments.jpg",
  "link": "https://www.vanityfair.com/news/2022/03/can-trump-escape-his-love-of-the-russian-leader",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabriel Sherman",
  "authorUrl": "https://www.vanityfair.com/contributor/gabriel-sherman",
  "termIds": [
    0
  ],
  "sentences": [
    "?Images of Russia’s Attack on Ukraine\n—Trump Calls Putin’s Ukraine Moves “Genius” Because He Hates Democracy\n— The Zucker-Cuomo Saga Just Got Even Messier\n— Why Biden Wanted Americans to Know Exactly What Putin Was Planning\n— It’s Been a Hell of a Week for Letitia James\n— “If Ukraine Matters, Tell Us Why”: Joe Biden Is Talking to Everyone Except the American People\n— Republicans on Russia Crisis: It’s Biden’s Fault\n— Thieves in the Night: A Vast Burglary Ring From Chile Has Been Targeting Wealthy U.S.",
    "RINOs and warmongers may have been disappointed that no new wars were started during President Trump’s first term, but the American people certainly miss the low gas prices, peace, and prosperity that he ushered in.”\nThe problem for Trump is that Russia’s invasion of Ukraine is only bound to get bloodier as its army targets civilian areas and Putin seeks total control in the face of massive resistance.",
    "On Wednesday, Florida governor Ron DeSantis praised Ukrainians who are fighting Russia’s invasion, saying they are “stepping up.” Trump will have to escape his own comments—and also his team’s attempts to tie Ukraine’s long struggle with Russia to his political fortunes, as exposed in his first impeachment trial.",
    "The veteran political operative has worked at the highest levels of Republican politics for the past 30 years, from managing Bob Dole’s 1996 presidential campaign to serving as COO of the Republican National Committee to, most recently, working as chief political strategist at the U.S. Chamber of Commerce.",
    "You’re not going to worry about another comment he makes.”\nLiz Harrington, a spokesperson for Trump, said he was “the only president of the 21st century to successfully handle Vladimir Putin, who did not invade another country on President Trump’s watch.",
    "Earlier this week, California congresswoman Katie Porter told reporters that Ohio congressman Jim Jordan, cofounder of the Freedom Caucus, clapped along with Democrats during a classified briefing on Ukraine.",
    "And on Fox News last week, Tucker Carlson, who once declared he was “rooting” for Russia, said: “Vladimir Putin started this war, so whatever the context of the decision that he made, he did it.",
    "He is to blame for what we’re seeing tonight in Ukraine.”\nThere is little sign that Trump or his advisers are worried that Trump’s history of pro-Putin positions will damage him politically.",
    "“Putin is now a war criminal.”\nReed’s wish to see Trump excommunicated from the GOP is a sign of just how fast the party is attempting to pivot away from Trump’s Putin sycophancy.",
    "The adviser said Trump can also take credit for NATO countries agreeing to increase defense spending, even though the move happened as a direct response to Putin’s invasion.",
    "“His comments on Putin should disqualify him from ever again running for the GOP nomination,” Reed told me on Wednesday as Russian forces laid siege to Ukrainian cities.",
    "“Trump can say his glowing remarks about Putin proved to be a success because Putin didn’t move into Ukraine on his watch,” one Trump adviser said.",
    "During Donald Trump’s presidency, Reed excused Trump’s erratic governance because he liked his policies, from the courts to taxes to deregulation.",
    "A former Trump White House official said they expect Republican voters to tune out the media’s coverage of Trump’s pro-Putin comments.",
    "If you were looking for a Republican strategist who could channel the party’s Washington consensus, you might start with Scott Reed.",
    "Missouri senator Josh Hawley, a MAGA stalwart, has called on the administration to sanction Russia’s oil and gas industry.",
    "But Vladimir Putin’s brutal invasion of Ukraine crossed a line for Reed that fundamentally altered his view of Trump.",
    "“Every time people say, ‘There’s no way he can come back from this!’—and he always does,” the former official said.",
    "During Tuesday’s State of the Union, Joe Biden elicited bipartisan applause when he vowed to stand with Ukraine.",
    "Households\n— Watergate’s Central Mystery: Why Did Nixon’s Team Order the Break-In in the First Place?",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "And other presumed 2024 hopefuls are singing a different tune.",
    "— From the Archive: Russia’s Dark Master\n— Not a subscriber?",
    "“Trump lit the fire under NATO,” the adviser said.",
    "It looks like we're experiencing playback issues.",
    "Their strategy will be to pivot and blame Biden.",
    "If you’re voting for Trump, you like him.",
    "“It’s like everything with Trump.",
    "He’s escaped worse in the past.",
    "If you’re not, you don’t.",
    "He fired the first shots.",
    "Our bad!",
    "— ?"
  ]
}