{
  "id": 13212,
  "mediaId": 2599,
  "date": "2022-03-01",
  "headline": "Jim Jordan: House GOP Will Prioritize These 3 Investigations Next Year.",
  "image": "https://instapundit.com/favicon.ico",
  "link": "https://instapundit.com/506610/",
  "mediaOutlet": "Instapundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Green",
  "authorUrl": "",
  "termIds": [
    2119,
    1477
  ],
  "sentences": [
    "Every time Euro-American Fascists (CIA, Schwab, Gates, Dorsey, Zuckerberg, Soros) deploy one of their major dirty tricks, that one becomes non-repeatable because people get on to them, and they have to develop a new, even bigger dirty trick for next time.",
    "The only newer and bigger dirty trick than that that I can think of is declaring elections themselves a threat to our democracy and dissolving competing power centers, to wit Congress and Courts.",
    "I think Ds are not standing for re-election in part because they do not want to be associated with the dissolution of Congress and the Courts they know is imminent.",
    "And Rs were best put to learning what's going on and being frank about it before shooting off their mouths over trivialities.",
    "Every time Rs investigate the report goes on a shelf and more resident idiots flood InstaPundit with cynical snark.",
    "In the name of national security and our democracy, of course; Comey's higher calling.",
    "His inability to make happen the clean up he only mouths off about is well-known.",
    "that's if there is an election and Rs get seated in the majority.",
    "Their last major dirty trick was stealing a national election.",
    "The Deep State are the country's salvation.",
    "Jim Jordan's shirt and tie are well-known.",
    "And what's an investigation going to do?",
    "The House has no prosecution power.",
    "Won't the Sulzbergers be pleased.",
    "That's as far as it goes.",
    "His mouth is well-known.",
    "That's it.",
    "Nothing!",
    ".",
    ".",
    "."
  ]
}