{
  "id": 13266,
  "mediaId": 2629,
  "date": "2022-03-02",
  "headline": "House Panel Subpoenas Trump Lawyers And Flacks Behind Coup Plot",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNjM5NjYxOS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY2NzA4OTIzM30.OTttOuE9m8cZuYAjjpSAmhPL1J6xJT7HxH0jX33442I/img.png?width=1200&coordinates=0%2C92%2C0%2C93&height=600",
  "link": "https://www.nationalmemo.com/coup",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandi Buchman",
  "authorUrl": "https://www.nationalmemo.com/u/brandibuchman",
  "termIds": [
    0
  ],
  "sentences": [
    "“Ultimately, we unanimously conclude the weight of the aggravating factors — i.e., Kline’s inability or refusal to acknowledge the line between overzealous advocacy and operating within the bounds of the law and his professional obligations; his selfish motives; and his lengthy and substantial pattern of misconduct — weigh more heavily than the mitigating factors and merit his indefinite suspension,” the Kansas high court wrote.",
    "In a statement from Committee Chairman Bennie Thompson, the Mississippi Democrat said records and testimony from those subpoenaed Tuesday—Cleta Mitchell, Kurt Olsen, Kenneth Chesebro, Katherine Friess, Phillip Kline, and Christina Bobb—would help investigators better understand how the overturn strategy materialized and was facilitated behind the scenes.",
    "Mitchell said she stepped down because of “a massive pressure campaign … mounted by leftist groups” who were outraged over her “personal involvement with President Trump.”\nMitchell now sits on the advisory board for the Election Assistance Commission, the only agency in the federal government that has authority over elections.",
    "The memo, entitled “The Real Deadline for Setting a State’s Electoral Votes,” proposed that the “real” date that lawmakers could meet to count and certify votes was January 6, not December 14, which is the officially recognized safe harbor date for the Electoral College to count votes.",
    "Investigators probing the attack on the U.S. Capitol have issued six new subpoenas, honing in this time on a group of lawyers and other allies to former President Donald Trump who frenziedly worked in the runup to Jan. 6 to promote his false claims of fraud in the 2020 election.",
    "The committee is keen to interview Chesebro about the role he played promoting Trump’s “alternate electors” scheme and in particular, the Nov. 18, 2020 memo he wrote and then sent to Jim Troupis, the lead attorney for Trump’s campaign in Wisconsin.",
    "Lawmakers on the select committee want Kline to disclose information about a private Jan. 2 conference call he organized under the umbrella of his “election fraud watchdog” group, the Amistad Project, an offshoot of the Thomas Moore Society.",
    "The court concluded Kline’s robust desire to prosecute abortion providers was so intense that it led him to present phony testimony in some cases and in others, illegally obtain the medical records of women planning abortions in his state.",
    "Attorney Kurt Olsen, another Trump stalwart, was subpoenaed for records and testimony about a reported draft executive order he helped write that instructed the Department of Justice to “take voter action” addressing Trump’s fraud claims.",
    "Former New York City Police Commissioner Bernie Kerik—hit with a committee subpoena in November—has previously told reporters at the Daily Beast that Friess helped prepare legal documents, arranged interviews, and reviewed affidavits.",
    "Mitchell’s “volunteerism” came to a head, however, on January 3, 2021, when The Washington Post published an hour-long recording of a January 2 phone call between Trump and Georgia Secretary of State Brad Raffensperger.",
    "Leaders of the “Stop the Steal” movement were also participating and according to a tweet from Republican Rep. Mo Brooks of Alabama that evening, over 50 congresspeople were on the call, including Rep. Jim Jordan.",
    "Kline was a hugely vocal proponent of Trump’s after the election in November and joined the president’s legal challenges to election results in Michigan, Georgia, Wisconsin, Arizona, Pennsylvania, and Nevada.",
    "Though they lost the case, internal Department of Justice emails obtained by the House Oversight Committee have since shown how Olsen pushed to get closer to Trump, succeeded, and then started taking orders.",
    "For many watching the probe, questions have abounded for months over whether the panel would formally demand deposition from Mitchell, a prominent conservative attorney with deep roots in Washington.",
    "Olsen wrote in one email that he was directed by Trump to brief then-Attorney General Jeffrey Rosen about a strategy to relaunch a fraud lawsuit in Texas after the case was tossed out.",
    "Olsen ascended the ranks of Trump's world quickly after he joined up with Texas Attorney General Ken Paxton’s legal bid to have the Supreme Court throw out the 2020 election results.",
    "As for lawyer and lobbyist Katherine Friess, investigators say she was involved in the drafting of an executive order that directed federal agencies to seize voting machines.",
    "Bobb was also on at least one phone call where the alternate slates were discussed and she was in the “war room” at the Willard Hotel with other Trump officials on January 6.",
    "The January 6 committee wants Mitchell to provide information about the Raffensperger call as well as testify about her contact with Trump on Jan. 6 and the days before.",
    "Lastly, investigators on Tuesday demanded records and deposition from Christina Bobb, an anchor at One America News Network, a pro-Trump right-wing propaganda network.",
    "She’s served as counsel to groups like the National Rifle Association, the National Republican Congressional Committee, and Trump-friendly lawmakers like Sens.",
    "Though Bobb has been mum about the “alternate electors” strategy she facilitated under Giuliani, she has admitted openly to working on the legal campaign.",
    "She mostly stayed away from the press and kept her name off of Trump’s lawsuits and other legal briefs flowing from the White House after the election.",
    "Former White House Chief of Staff Mark Meadows and White House trade adviser Peter Navarro were also on the call, according to The Washington Examiner.",
    "Trump asked the secretary to “find 11,780 votes” for him in Georgia and vacillated between flattering and threatening Raffensperger for the duration.",
    "Their chosen electors in Wisconsin, he argued, did not need to submit their slates for Trump with “involvement by state officials.” This was false.",
    "On the call, Mitchell insisted there was fraud in Georgia and griped at Raffensperger for not providing the Trump campaign data it requested.",
    "Unlike other attorneys advising the 45th president—see Rudy Giuliani, Jenna Ellis, or Sidney Powell—Mitchell was less flashy in her approach.",
    "Investigators say Bobb was involved in the drafting of an executive order that directed the seizure of voting machines by federal agencies.",
    "Investigators have subpoenaed Friess’ AT&T phone records, demanding a review of metadata from November 1, 2020 through January 31, 2021.",
    "Giuliani disclosed details about Bobb’s role during a deposition in federal court last September involving Dominion voting machines.",
    "When she did make media appearances, she sometimes described herself as a “volunteer” to Trump’s campaign and legal teams.",
    "But both Troupis and Chesebro took their Trump-backed bid challenging Wisconsin’s election results to the Supreme Court.",
    "Chesebro nonetheless insisted that “alternate electors” were a viable path forward for Trump to overturn the results.",
    "Kline is a staunch conservative who had his law license indefinitely suspended by the Kansas Supreme Court in 2013.",
    "Bobb is a former lawyer who served as a ”volunteer” to the ex-president’s campaign and specifically aided Giuliani.",
    "She also traveled to Michigan to “strong-arm” voting machine data from local officials, the committee contends.",
    "Further, Mitchell promoted the theory to the Georgia secretary of state that voting machines were rigged.",
    "Mitchell resigned from her partnership at the D.C. law firm Foley & Lardner after the call went public.",
    "The Jan. 6 committee has also issued a subpoena to former Kansas Attorney General Phillip Kline.",
    "Kerik said she also coordinated hearings and meetings when either he or Giuliani requested it.",
    "Marco Rubio of Florida, Patt Toomey of Pennsylvania, and Roy Blunt of Missouri, among others.",
    "The firm said publicly it was “concerned” about Mitchell’s relationship with the president.",
    "The individuals subpoenaed Tuesday did not immediately return a request for comment.",
    "Mitchell’s role advising Trump flew largely under the radar before the attack.",
    "His efforts were reportedly relentless and his devotion to Trump complete.",
    "Boston-based lawyer Kenneth Chesebro was also subpoenaed Tuesday.",
    "That resignation arrived just one day before the Capitol attack.",
    "The call involved more than 300 state legislators.",
    "The high court ultimately denied the lawsuit.",
    "Friess sued to stop the review in February."
  ]
}