{
  "id": 13280,
  "mediaId": 6449,
  "date": "2022-02-26",
  "headline": "Rep. Jim Jordan: Jan. 6 Committee ‘Totally Out to Get President Trump’",
  "image": "https://www.dailysignal.com/wp-content/uploads/220226-Jordan.jpg",
  "link": "https://www.dailysignal.com/2022/02/26/rep-jim-jordan-jan-6-committee-totally-out-to-get-president-trump/?utm_source=rss&utm_medium=rss&utm_campaign=rep-jim-jordan-jan-6-committee-totally-out-to-get-president-trump",
  "mediaOutlet": "Daily Signal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Douglas Blair",
  "authorUrl": "https://www.dailysignal.com/author/douglas-blair/",
  "termIds": [
    2441,
    2119,
    2021,
    4307,
    2765,
    4,
    474,
    1126,
    6678
  ],
  "sentences": [
    "And yet, somehow they say it’s Republicans and President Trump who are threat to democracy.”\nIn a recent interview with Fox News’ Laura Ingraham, Jordan expressed his concerns with the make-up of the January 6th Committee and compared it the to investigation into Russian meddling in the 2016 election conducted by Special Counsel Robert Mueller.",
    "Jordan also discussed the treatment of those arrested in connection with January 6th riot, citing how a Washington, D.C. judge, U.S. District Judge Royce Lamberth, held in contempt the prison warden for the jail where the accused were being kept.",
    "[Rep.] Adam Schiff presented it to the American people as if it came from me, left a bunch of the text message off, altered the punctuation, and lied to the American people about it.” said Jordan.",
    "“I mean, just the simple fact that for the first time in American history, the minority leader was not allowed to put on a select committee the individuals he or she selected.",
    "Jordan then said that Democrats were hypocritical for saying the president represented a threat to democracy, arguing their actions threatened the American republic.",
    "The January 6th Committee was created with the purpose of investigating the riot at the Capitol and preventing something like it from ever happening again.",
    "“The judge said that they were treating people inappropriately at the D.C. jail who were being held there as a result of their actions on Jan. 6.",
    "“The White House offered the National Guard to Speaker [Nancy] Pelosi and the sergeant at arms, and for some reason, they chose not to use them.",
    "To sound off, please email letters@DailySignal.com and we’ll consider publishing your edited remarks in our regular “We Hear You” feature.",
    "But as Rep. Jim Jordan, R-Ohio, explains, the committee has abandoned that job in favor of trying to “get” President Donald Trump.",
    "“The January 6th Committee has been caught lying about information, altering evidence and lying to the American people about it.",
    "Nineteen prosecutors, 19 lawyers, 40 FBI agents, a bunch of subpoenas, all this stuff, and what’d they come up with?",
    "So take the judge’s word for it,” he said “I think that tells you everything.”\nHave an opinion about this article?",
    "'”\nJordan said that the Trump White House offered increased security due to the protestors, but was rebuffed.",
    "It’s an effort to get President Trump and deny him an opportunity to run in 2024,” Jordan added.",
    "So that’s a question that only the speaker of the House can answer, and she refuses to do so.",
    "Remember to include the url or headline of the article plus your name and town and/or state.",
    "It’s never happened in our history.”\n“I think the American people see it for of what it is.",
    "“They took a text message that I had forwarded to the White House chief of staff.",
    "They said, ‘The January 6th committee is responsible for and regrets the error.",
    "The congressman argued that the committee had been misleading to the public.",
    "There was no collusion, and we knew that from the get go,” Jordan said.",
    "“Well, this is sort of like the Mueller investigation in some ways.",
    "And the committee refuses to even raise the question.” said Jordan.",
    "“It’s totally out to get President Trump.” Jordan said.",
    "“And they had to apologize.",
    "Nothing."
  ]
}