{
  "id": 13319,
  "mediaId": 2528,
  "date": "2022-02-27",
  "headline": "CPAC candidates want to weigh their options for House speaker if elected. Colleagues say Kevin McCarthy's still in good shape.",
  "image": "https://i.insider.com/621be516101faf0019295b62?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/cpac-kevin-mccarthy-house-freedom-caucus-jim-jordan-leadership-fight-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Warren Rojas",
  "authorUrl": "https://www.businessinsider.com/author/warren-rojas",
  "termIds": [
    2119,
    4066,
    3246,
    2765,
    2714,
    520,
    351
  ],
  "sentences": [
    "Going their own way\nLeslie French, a first-time candidate running to unseat Trump impeachment supporter Republican Rep. Jamie Herrera Beutler of Washington, mapped out a personal agenda that includes following up on Trump's baseless claims about widespread \"election fraud\" in 2020, completing Trump's wall at the southern border, and impeaching President Joe Biden and Vice President Kamala Harris \"because they don't belong there.\"",
    "McCarthy, who shocked the pundit class in 2020 by gaining a dozen seats instead of suffering the double-digit loss most expected, is working to finish the job this fall by ushering in enough Republicans to wrest back control of the chamber from Speaker Nancy Pelosi.",
    "Gaetz is currently under federal investigation for potential sex trafficking while Greene is trying to distance herself from alt-right figure Nick Fuentes after making a surprise appearance at one of his white nationalist rallies on Friday night.",
    "These days Freedom Caucus members Reps. Matt Gaetz of Florida and Marjorie Taylor Greene of Georgia, two MAGA devotees who tune out everyone except embattled former President Donald Trump, are the ones keeping McCarthy on his toes.",
    "ORLANDO, Florida — Republican hopefuls swarming the 2022 Conservative Action Political Action conference to try and win a spot in Congress appeared to be on different pages about who should be in charge once they get there.",
    "Many of the aspiring candidates Insider interviewed at CPAC gushed about how much they admired leading Republicans, ranging from embattled former President Donald Trump to House GOP Conference chairwoman Elise Stefanik.",
    "Garrett Barton, who is running for Congress in South Carolina, said he really likes Jordan and Republican Study Committee chairman Rep. Jim Banks of Indiana, but stopped short of supporting any House leader — for now.",
    "Regina Mauro, a first-time candidate running to unseat Democratic Rep. Chrissy Houlahan of Pennsylvania, told Insider she agrees wholeheartedly with the small government, low tax philosophy of the Freedom Caucus.",
    "While flipping the House would certainly get him closer to earning that long-sought promotion, having a bunch of naysayers join the ranks makes climbing the career ladder more difficult.",
    "The California Republican dropped out of the running for speaker in 2015 amid opposition from the ultra-conservative House Freedom Caucus, which Rep. Jim Jordan of Ohio led at the time.",
    "The political neophytes appeared to be less sure about House Minority Leader Kevin McCarthy — the man they would, in theory, look to for guidance in a Republican-run 118th Congress.",
    "Ingrid Centurion, another South Carolina with her sights set on joining Congress to, as she says, \"replace RINO Nancy Mace,\" laughed when asked whether she was Team McCarthy.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Norman said he hoped McCarthy's developing playbook would include spending cuts, boost military pay, and clear the path for more conservative Republicans to run for office.",
    "\"I'm probably not going to seek his endorsement,\" French said, adding that he'd have to think on who should be speaker if Republicans reclaim control this fall.",
    "One member of this wait-and-see caucus said they were reserving judgment until they got to Washington and could ferret out a party boss \"I could work with.\"",
    "'He has done enough'\nSome Republicans already in Congress told Insider they're waiting to see McCarthy's midterm strategy before making any final decisions.",
    "Delivering a slimmer margin of five to six seats might give skeptics additional pause, Green said, estimating that \"maybe people will scratch their heads.\"",
    "And he doesn't anticipate there'll be much standing in McCarthy's way if Republicans pick up even more seats this November than they did in the last cycle.",
    "House Republican Conference chair Elise Stefanik leaves a meeting of the House Republican conference at the U.S Capitol on May 18, 2021 in Washington, DC.",
    "Lee Murphy, who is running for Congress in Biden's home state of Delaware, said he'd need to interview McCarthy before lending any support.",
    "Jabin Botsford/The Washington Post via Getty Images\nMcCarthy needs to gain just a handful of seats to clinch the speaker's gavel this fall.",
    "Meanwhile, Jordan told Insider in an interview following a book signing at CPAC that he had no interest in mounting a leadership challenge.",
    "He instead hopes to chair the Judiciary Committee and \"focus on defending the First Amendment,\" which guarantees the right to free speech.",
    "\"I'd like to meet the people who are vying for that position and I certainly would like someone in that position I could work with.\"",
    "Six-term Republican Rep. Billy Long of Missouri, who is running for Senate this fall, said McCarthy has nothing to worry about.",
    "\"We want to see a plan,\" said Republican Rep. Ralph Norman of South Carolina who acknowledged McCarthy's fundraising prowess.",
    "\"There are a lot of people in Congress I really respect,\" Lee added, citing Minority Whip Steve Scalise of Louisiana.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Win McNamee/Getty Images\n\"I think she's a super power,\" Mauro said of the House's third highest-ranking Republican.",
    "\"The House had zero competitive leadership races last time,\" Long told Insider while pressing the flesh at CPAC.",
    "\"If we gain 20 seats, Kevin McCarthy's the speaker … and I'll be supporting him,\" the two-term lawmaker said.",
    "Mauro added that she's a huge fan of Jim Jordan, but reserved the highest praise for Elise Stefanik.",
    "GOP Rep. Mark Green of Tennessee gave McCarthy high marks for keeping things together so far.",
    "While CPACers danced around leadership questions, veteran lawmakers mostly praised McCarthy.",
    "House Minority Leader Kevin McCarthy in his office on Capitol Hill on November 18, 2021.",
    "He'll need the full support of the contentious caucus plus newly elected Republicans.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "\"I'd have to see what the field of candidates are at the time,\" French said.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "\"Leader McCarthy is going to be the speaker,\" Jordan said.",
    "Absent from his to-do list: checking in with McCarthy.",
    "\"So many hard questions,\" Centurion told Insider.",
    "\"When I get there I'll make these decisions.\"",
    "Stay up to date with what you want to know.",
    "\"He has done enough to earn that spot.\"",
    "Sign up for notifications from Insider!",
    "\"I don't have a dog in the fight.\"",
    "Loading Something is loading.",
    "\"None.\""
  ]
}