{
  "id": 13325,
  "mediaId": 2656,
  "date": "2022-03-02",
  "headline": "The Morning Briefing: Biden's SOTU—Hey Racist Terrorists, Let's Try Unity and Stuff",
  "image": "https://media.townhall.com/townhall/reu/o/2022/60/7550fd8c-ac44-4ccd-962e-956d60715600-1110x740.jpg",
  "link": "https://pjmedia.com/columns/stephen-kruiser/2022/03/02/the-morning-briefing-bidens-sotu-hey-racist-terrorists-lets-try-unity-and-stuff-n1562909",
  "mediaOutlet": "PJMedia",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Kruiser",
  "authorUrl": "https://pjmedia.com/columnist/stephen-kruiser",
  "termIds": [
    0
  ],
  "sentences": [
    "This is a Genocide”, Biden will have “the blood of Ukrainians on his hands”\nSen. Chuck Schumer catching himself before premature applause is one highlight of Biden’s SOTU speech\n‘My god you are evil’: Dr. Leana Wen says how great it is to see a packed room of mostly unmasked leaders\nVIP\nAround the Interwebz\nBee Me\nTrudeau Suffers PTSD Flashback After Driver Politely Honks To Tell Him Light Is Green https://t.co/CVUwFqEUOw\n— The Babylon Bee (@TheBabylonBee) March 1, 2022\nThe Kruiser Kabana\nKabana Gallery\nKabana Tunes",
    "As Mr. Green has often pointed out, Joe Biden’s handlers have gotten good at pumping him full of enough Adderall to make him able to read a teleprompter for a while without having to worry about him wandering off mentally and beginning to eat his foot.",
    "A lot of the reports were mentioning Biden’s call for unity, which is impossible to take seriously coming from a man who calls his political opponents racists and terrorists and uses his Dept.",
    "I know that has nothing to do with substance, but it does have to do with the fact that this guy has been past his sell-by date for a long time now.",
    "Everything Isn’t Awful\nBREAKING NEWS ALERT:\nAirbnb just announced that it will provide free shelter for nearly 100,000 refugees fleeing Ukraine.",
    "San Fran DA: Get tough on gun makers, not violent offenders\nNRA takes aim at CDC’s gun control efforts\nRep. Spartz: “This is Not a War.",
    "As soon as I read through it, I began to pursue the mainstream and social media responses to the puppet president’s latest babblefest.",
    "Predictably, the usual suspects in the MSM were carrying water for Ol’ Gropes, making it seem as if all is right with the world.",
    "WATCH: Pelosi’s Bizarre Reaction to Soldiers Breathing in Toxic Smoke From Burn Pits\nAmerica’s Wild West Was Super Gay?",
    "The company will work with various countries to provide short and long term housing to those escaping the violence.",
    "As promised, I “watched” Amtrak Joe Biden’s State of the Union Address via our own VodkaPundit’s famous DrunkBlog.",
    "The media can pretend all it wants that Uncle Joe’s America is just fine but the rest of us have to live in it.",
    "Putin Wakes Up the Western Ostrich\nTownhall Mothership\nOh, Now Biden Wants Our Southern Border to Be Secured?",
    "I knew that if I just grabbed three random clips from the speech, each would be a train wreck in its own way.",
    "Stephen mentioned Biden’s squinting, which always distracts me too much when he’s on ‘prompter duty.",
    "Insanity Wrap: Eliminate Science With California’s 1 Weird Trick\nProve to me that she isn’t drunk.",
    "pic.twitter.com/MqTri2jw54\n— Goodable (@Goodable) March 1, 2022\nPJ Media\nVodkaPundit.",
    "I caught up on all of it after a quiet birthday dinner with two of my best friends.",
    "Top O’ the Briefing\nHappy Wednesday, dear Kruiser Morning Briefing friends.",
    "On Ukraine, NATO, America, Comedians and Environmentalists\nShapiro.",
    "It’s disturbing that I can’t see his eyes at all.",
    "Those who offered them will be fondly remembered.",
    "Stephen makes these tedious affairs enjoyable.",
    "Thanks for the birthday wishes yesterday.",
    "So, less-than-respectfully Joe, hell no.",
    "There’s leftover meatloaf in the van.",
    "We know the real state of the union.",
    "And I mean literally eat his foot.",
    "of Justice to silence them.",
    "I was, as always, correct.",
    "The others will be judged.",
    "I’d smell it first.",
    "These people.",
    "Prager.",
    "Cam&Co.",
    "Wut."
  ]
}