{
  "id": 1333,
  "mediaId": 2643,
  "date": "2022-02-11",
  "headline": "Matt Gaetz Believes Jan. 6 Committee Will Try to Block Trump From 2024 Run",
  "image": "",
  "link": "https://www.newsweek.com/matt-gaetz-believes-jan-6-committee-will-try-block-trump-2024-run-1678522",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jenni Fink",
  "authorUrl": "https://www.newsweek.com/authors/jennifer-fink",
  "termIds": [
    5827,
    5399,
    3514,
    2765,
    4275,
    1126,
    1477,
    6159,
    6456
  ],
  "sentences": [
    "Florida Republican Representative Matt Gaetz believes one of the goals of the January 6 House Select Committee is to block former President Donald Trump from running for president in 2024 by disqualifying him as a candidate.",
    "In a statement, he said that he has never and would never engage in an insurrection against the United States and called the challenge to his candidacy a \"weapon by liberal Democrats\" intended to \"defeat our democracy.\"",
    "The 14th Amendment, also known as the\"disqualification clause,\" was ratified after the Civil War with the intention of preventing officials who supported \"insurrection\" from holding office in the future.",
    "North Carolina voters who are challenging Cawthorn's candidacy cite comments he made in a speech shortly before the January 6 Capitol riot and said the violence that day \"amounted to an insurrection.\"",
    "Representative Madison Cawthorn's candidacy for re-election is being challenged in North Carolina because of his alleged stoking of violence on January 6 and allegedly aiding Capitol rioters.",
    "Just as candidates can be disqualified for their age or residency, the elections board said it also polices if candidates should be disqualified under the 14th Amendment.",
    "He told Fox News that everyone \"sees this as a political operation\" that is intended to \"get after President Trump\" because Democrats don't \"want him to run again.\"",
    "\"Claiming to be fighting a battle for our Constitution, Cawthorn has engaged in blatant acts of insurrection,\" John Wallace, a lawyer who filed the suit, argued.",
    "Gaetz told Just the News that the challenge against Cawthorn was a \"very important test\" for whether Trump could be disqualified from running for president.",
    "Cawthorn's challengers are invoking the \"disqualification clause\" of the Constitution and Gaetz believes the same tactic will be used against Trump.",
    "\"Disqualifying potential candidates is the newest and most dangerous iteration of cancel culture,\" Gaetz told the website Just the News on Thursday.",
    "Representative Jim Jordan also believes the committee investigating the Capitol riot wants to keep Trump from running for the White House again.",
    "Members of the North Carolina State Board of Elections argued in court that it does have the power to bar Cawthorn from running for office.",
    "While Some Republicans voted to convict the former president, it wasn't enough to reach the two-thirds majority needed for a conviction.",
    "Polls indicate he could be a frontrunner for the GOP nomination, with significantly more support than any other hypothetical candidate.",
    "However, for that to happen, Trump had to be convicted in the Senate and specifically barred from holding public offices in the future.",
    "Trump hasn't committed to running for another term, but has been teasing a potential campaign since leaving office.",
    "Cawthorn filed a federal lawsuit over the challenge to his reelection campaign, calling it \"unconstitutional.\"",
    "One goal of impeaching Trump after the Capitol riot was to make him ineligible for another term in office.",
    "\"I believe the January 6th committee is going to try to do it regarding Donald Trump.\"",
    "\"He must be held accountable for his actions which have threatened our democracy.",
    "Wisely, the Constitution provides a remedy for our protection.\""
  ]
}