{
  "id": 13345,
  "mediaId": 2742,
  "date": "2022-03-04",
  "headline": "Transcript Of Trump’s CPAC Speech: \"They Legalize Mass Robberies And Cheer For BLM And Antifa Rioters Ransacking Our Cities While They Hold Non Violent Protesters Without Trial\"",
  "image": "https://vdare.com/public_upload/publication/featured_image/57053/VDARE-trump-cpac-2022.jpg",
  "link": "https://vdare.com/posts/transcript-of-trump-s-cpac-speech-they-legalize-mass-robberies-and-cheer-for-blm-and-antifa-rioters-ransacking-our-cities-while-they-hold-non-violent-protesters-without-trial",
  "mediaOutlet": "VDARE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Fulford",
  "authorUrl": "https://vdare.com/writers/james-fulford",
  "termIds": [
    0
  ],
  "sentences": [
    "It's something that obviously is going to have to be looked at it is so horrible what's happening to our country, we need a full accounting of all of the illegitimate turnout efforts illegal dropboxes and ballot harvesting that's taken you know, we had dropboxes night 97% for Joe Biden because he campaigned so hard from his basement, 3% for Trump\n3% They gave me three at least they gave me something because I think that a couple where he actually got 100% 1000s of votes.",
    "I don't think Jim Jordan that would work out too well, what wouldn't work out to a Department of Homeland Security actively aiding illegal immigration and in many cases, criminals coming into our country, criminals, absolute criminals, the Department of Energy and interior, forcing us to be reliant on foreign energy at a cost that is not acceptable to our nation, and not sustainable at Department of Justice waging war on an opposing party, and patriotic parents.",
    "Also, YouTube is taking down channels that report on Trump’s speeches, because they call it “misinformation” when he insists that he actually won in 2020—see YouTube Won't Distinguish Between Misinformation and Reporting, So It Suspended My Channel, by Robby Soave, Reason.com, March 4, 2022.",
    "They try to silence voices like Joe Rogan for alleged misinformation while they perpetuate the most flagrant hoaxes and monstrous lies like the Russia, Russia, Russia hoax I was that for three years we had to put up with a Russia, Russia, Russia hoax, it was a total hoax.",
    "In addition to securing our elections, here are just some of the other things we must do with Republicans back in charge, we must pass critical reforms making every executive branch employee fireable by the President, the deep state must and will be brought to heel.",
    "Republicans should pass legislation making clear that when local left wing, district attorneys and attorney generals refused to prosecute dangerous criminals, the DHS and Attorney Generals can be charged with violations of the civil rights law.",
    "Let's find out who made the decision to censor who made that decision to censor the Joe and Hunter Biden corruption bombshell, which the pollster said amounted to about 15 points, the largest illegal campaign contribution in American history.",
    "The money's been flushed down the drain and they're trying to get more they want to get up to a number that nobody can believe and looks like maybe people will not allow that to happen because they don't want a country to be destroyed.",
    "Standing before you today, I'm thrilled to report that our incredible movement, a movement that nobody's ever seen anything quite like it there has never been anything like it before, is strong and growing stronger every single day.",
    "The world is already waiting to see the explosive information out of Georgia where true the vote incredible people has uncovered a massive illegal ballot harvesting scheme with over 2000 ballot stuffers or as they call them, mules.",
    "And all those tanks roaming around are very expensive, but they're peanuts compared to the kind of money that he's making because of the tremendous increase in oil you know, when I left and during my term oil was at $36 The barrel.",
    "With a Republican Congress, we will once and for all banned critical race theory from our schools, we will benefit from our military we will benefit from every institution that accepts a single penny from the federal government.",
    "And any parent who objects to the radical indoctrination in their children's classroom should be able to take their share of taxpayer dollars and spend it at the public, private charter or religious school of their choice.",
    "If we fail in our mission, we already know what the fate of America will be the radical left is trying to extinguish our very identity as Americans so that when they try to take our freedom, we do not even think to resist.",
    "And they're not only coming from Central and South America, they're coming from all over the world, over 160 countries, in many cases from jails that are being emptied into our country, as though we are a dumping ground.",
    "And when you have a weak president who is not respected by other nations, you have a very chaotic world and the world hasn't been this chaotic since World War Two, I think we can say that we can say that very strongly.",
    "Our mission in 2022 and in 2024, is to take on this radical and power hungry ruling class and to deliver them an electoral defeat, so resounding that they are exiled into political Oblivion, never ever to return again.",
    "But we're very proud of the job we did, we did something that I don't think anybody else could have done and I want to thank certain governors did a very good job, certain Republican governors did a very good job.",
    "In the debate, remember, we had the debate and I said, Hey, what do you do with the 3.5 million that he got from the mayor of Moscow, his wife and Chris Wallace, who I assume was now fired from Fox, which is good?",
    "Millions of people are pouring in, descending on our communities, camping in our towns, depleting our resources, flouting our laws and bringing crime, drugs and death to the streets of our cities and communities.",
    "So to all of those who think that they can coerce and subjugate the citizens of this land, here these words for me tonight, the people of America will not surrender our borders, we will not surrender our culture.",
    "The Biden administration has spent months obsessing over how to stop an invasion of a foreign country 1000s of miles away, I believe Americans deserve a president who will stop the invasion of our country also.",
    "And let's do a full forensic audit of the $417 million given by Mark Zuckerberg who used to come to the White House and kiss my ass\nthat they spent to take over local election offices in key Democrat counties.",
    "I have no doubt that President Putin made his decision to ruthlessly attack Ukraine only after watching the pathetic withdrawal from Afghanistan, with a military was taken out first, our soldiers were killed.",
    "You could take the five worst presidents in American history and put them together, and they would not have done the damage that Joe Biden and his administration has done in just a very short 13 months.",
    "Nobody can even believe it if you wrote a book or a novel, and it was all just printed out like this with crooked Hillary with the Muller report, which was okay, we like it, did it find no collusion.",
    "The American people deserve to know where did all the money In addition, we must take immediate action to fight the Biden violent crime wave that is devastating our citizens and Democrat run cities.",
    "It's so important psychologically so important for our country, I never really realize to that extent, I know it was important, but you assume you're going to be doing certain things that are right.",
    "We had the most secure border in US history, record low gas prices, American energy independence, the fastest economic recovery in the history of our country, fastest economic recovery in history.",
    "I\nf anybody ever wrote a novel, The Great James Patterson, if he ever wrote a novel like this, it wouldn't sell because people would say, No, no, it's not believable, this could never happen.",
    "This is a raw, automatic transcript of Trump’s CPAC speech, because after Biden was confirmed as president, various people who had been providing full transcripts of Trump’s speeches stopped.",
    "If you seek to harm America, they have grossly underestimated the strength and brilliance and pride of the American people, they're not going to stand for it, they're not going to take it.",
    "Over the past year we've seen weakness, self-loathing and self-destruction, on a scale previously unthinkable, a military obsessed with equity to all and only being politically correct.",
    "You remember, though, when so many people in the Democrat Party and during the debates, said he's going to get us into the third world war with I'm the one that didn't have any wars.",
    "In an advanced Western democracy, the peaceful movement of patriotic truckers, workers and families protesting for their most basic rights and liberties has been violently put down.",
    "To build the wall complete the wall in three weeks, took two and a half years on the wall two and a half years to win all of the litigation over 11 lawsuits that they throw at us.",
    "And we had stopped one year ago, we had stuff we hadn't stopped one year ago, you can't defend Western civilization, if you would not be able to defend your own civilization.",
    "The Keystone XL pipeline that I approved, while he enrich Putin by approving the Russian pipeline, which has really been at the core of much of the problem we have right now.",
    "I want to thank the American Conservative Union for putting on this incredible show this great program of patriots and in particular, thank you to Matt and Mercedes Schlapp.",
    "And then you look at what's happening in New York and Chicago and Los Angeles and these Democrat runs that is, and you have seven people killed in one weekend and at shot.",
    "As your president I secured our southern border, upheld the laws of this land and stopped the influx of illegal immigrants into America very dangerous, illegal immigrants.",
    "While we're at it, a Republican Congress should launch a select committee, as opposed to unselect committee to get to the bottom of Big Tech’s 2020 election interference.",
    "We will bring Joe Biden's inflation causing socialist spending spree to a screeching halt, we will immediately begin a full audit of the $6 trillion of radical Democrats.",
    "But it isn't really that interesting that so many Democrat politicians in Washington, they seem to be rushing to microphones to declare that Ukraine's borders are sacred.",
    "Illegal Immigrants cannot be allowed to vote like they are currently allowed in New York City you can walk in and you can vote in New York City on my beautiful New York.",
    "But with all of the things that you've seen all of the horrible things that you've seen the corruption, the spying, it was spying, it's probably worse than spying.",
    "When we when we will defeat this corrupt political establishment, we will save our republic and we will restore constitutional government of by and for the people.",
    "They legalize mass robberies and cheer for BLM and Antifa rioters ransacking our cities while they hold non violent protesters without trial destroy their lives.",
    "The socialist, globalist Marxist and communist who are attacking our civilization have no idea of the sleeping giant, they have a woken, we are a sleeping giant.",
    "They’ve proven during this period of time that their policies are a disaster, and that their policies don't work will get voter ID will never defend the police.",
    "There's never been anything like that where a warring nation the more he makes it difficult to get oil, the more expensive it gets and the more money he makes.",
    "And these are just a few of the steps that we have to take to save the nation, that we love the rest of them, you know the rest of them we've discussed today.",
    "And that's without mentioning the fact that China gave them\n$1.5 billion to manage, and he never managed money before other than the money they got probably.",
    "Can you imagine if I said about getting rid of a Ukrainian prosecutor, or he wouldn't allow $1 billion of American taxpayers money to be given to Ukraine?",
    "We have people coming into our country that we don't want, they will not be good for our country, you will be paying a price for many, many years to come.",
    "The NATO nations and indeed the world, as he looks over what's happening strategically, with no repercussions or threats whatsoever, they're not so smart.",
    "They said Not so long ago, we're going to impeach him for something and then they found out the woman got up, he said, Well, he never did anything wrong.",
    "He said, I've never believed that because President Obama would go to NATO, make a speech, talk about the weather, the sun, how lovely everyone looks at.",
    "It saves me a lot of problems for the rest of the year or when they vote against me at some point they'll vote against me because I didn't mention that.",
    "I'm glad that tape was going those transcribers were writing during that call, because otherwise it could have been but this is what we're dealing with.",
    "The Republicans have a big and bold agenda that they're going to put into action under a Republican Congress, and we have a chance of setting records.",
    "Unbelievably, Biden is now claiming that you must sacrifice through higher energy prices to free Put the cost of his failed foreign policy in Europe.",
    "You've been an entertainment The Apprentice, and you've been in politics, who are the toughest who are the worst I said the worst of the politicians.",
    "he said President Trump is the healthiest president in history if he didn't eat junk food, he’d live for 200 years that got us into a lot of trouble.",
    "And others were to including President Bush, how wonderful everything was, and I went, and I said, I'm sorry, you're all delinquent, you have to pay.",
    "It's time to start talking about greatness for our country again, we want our country to be great again, we want our country to be respected again.",
    "And that means we need borders that work elections that are fair and free and not rigged and crime that must be immediately stopped in our cities.",
    "If I renounce my beliefs, if I agreed to stay silent, if I stayed at home, if I said I'm not going to run, the persecution would stop immediately.",
    "It's the same witch hunt that's been going on since day one since actually, the day that I came down the escalator with a great future First Lady.",
    "So the Middle East, and Saudi Arabia, a lot of countries, but Russia right now in particular is making more money than they ever dreamt possible.",
    "But now Joe Biden is seen as a weak, and I hate to say it because I want him to do a great job I really want him to do politically, I don't care.",
    "We're not going to have a country left for an amazing 48 years CPAC has helped to conserve, protect and defend our magnificent American heritage.",
    "I've had so many people in the steel undersea thank me for the job we did we put massive tariffs on steel that they were dumping in our country.",
    "He actually made up a story about my phone call with the president of Ukraine who, by the way, is a brave man, he's hanging in with a brave man.",
    "He got three and a half million dollars from the mayor of Moscow's wife, very rich family, I will tell you that this is a conflict of interest.",
    "Republicans need to watch the vote counting up close from the start to the finish, we can allow thugs to throw our people out what happened.",
    "And we should not be buying Russian energy, but rather allow the people of our country to start producing like they did just one year ago.",
    "ballots in Georgia and other swing states were trafficked and sold on an unprecedented scale and the brutality and it was just incredible.",
    "They want it to be shut down and shut down and it does great who listens to Oh, am I do I want to take away their voice and let it happen.",
    "The importance of the President, when I look at what's happening to our country today, the President is such an important representative.",
    "Under our administration, Russia respected America, just like every other country, respected America, and they really respected us a lot.",
    "And you know what would be really wonderful to what would be really wonderful to ask you a lot, a thing called very simply paper ballots.",
    "You must get your state legislatures to act now before November they have to move they have to act with the help of everyone here today.",
    "And above all, we will not surrender our children to the small band of bullies and extremists who want to tell everyone else what to do.",
    "And now we have probably the best trade deal ever made, but they want to renegotiate, and they probably will do it this administration.",
    "You know, if you're a person that wants to make a contribution, you're allowed to give less than $6,000 otherwise they put you in jail.",
    "And we will finish the wall very quickly a matter of we will charge China trillions of dollars for unleashing the virus upon the world.",
    "America's moms and dads should get a veto over anyone teaching far left gender ideologies, to their children without parental consent.",
    "With Biden, you get a war in Europe, and a war on American energy with Republicans, you get energy independence and energy dominance.",
    "Now inflation is the highest in 40 years, economists are talking about 567 and even $8 a gallon gasoline supply chains are crumbling.",
    "And unrivaled military, we rebuilt the military, and we added SpaceForce on top of it, and peace and quiet was all around the world.",
    "I never knew how important being president was I was president for four years, I think I did a great job, we did things that nobody.",
    "This will drive prices down, drive inflation down, you want to get rid of inflation or bring it way down, reduce the cost of energy.",
    "And I like it because you know, during that ridiculous impeachment waste of time, and the Republicans stood by us, we were 196 an 0.",
    "Because we'll be acting long before they can do all of it, it was up to them, they do everything they could to destroy our country.",
    "The reason we've got sarin gas prices is that Biden's shut down American energy cancelled our oil and gas leases just two days ago.",
    "And if you ever have a conflict with Russia, you will be able to wave the white flag and surrender because they supply your energy.",
    "On his first day in office, Biden abolished the 1776 Commission and then proceeded to impose woke left wing racism on our military.",
    "I'm very proud of many of our but they're continuing their evil and demented persecution of me, my family, my staff, my supporters.",
    "At a big, big difference also on crime, you look at where the crime is, and you don't see the word Republican very much, if at all.",
    "America has to be strong, and it needs strong leadership and you see what happens when you have bad weak or incompetent leadership.",
    "I'm asking all of you to fight and work hard to elect candidates that believe in the principles and policies that we hold so dear.",
    "We love this country and we're gonna bring this country back and it's going to be bigger and better and stronger than ever before.",
    "You better not let it happen is the only attack in history with the further he goes and the bigger it gets, and the worse it gets.",
    "The left is also trying to take away the rights and dignity of OAn, One America news on DirecTV and AT&T, and it's a great voice.",
    "Over two years he spent a whole life I will tell you what he does and what he goes through what he believes he's a great patriot.",
    "They cannot even begin to imagine the brave and righteous spirit they've unleashed in men and women like all of you here today.",
    "They have to gain strength, they have to gain new courage and they have to stand up for freedom and stand up for what is right.",
    "So we are confident of the results because what we have now is you have 80% of the party thinking the vote was a horrible vote.",
    "And that is why the corrupt Democrat prosecutors and unconstitutional unselect committee on January 6, the unselect committee.",
    "During our time in office, they never paid 10 cents never 10 cents between tariffs and taxes, hundreds of billions of dollars.",
    "And with the commitment of hard working, freedom loving patriots all across our country, we will make America powerful again.",
    "They're being hunted down like enemies of their own government and treated worse than drug dealers and murderers or rapists.",
    "Another top priority to save American democracy must be to break up the big tech giants and restore free speech in America.",
    "The Biden administration cares more about helping citizens of a distant foreign nation than it does about our own citizens.",
    "Joe Biden, Chuck Schumer and crazy Nancy Pelosi are the sinister faces of this corrupted, lawless political establishment.",
    "And I believe that's just the foundation on which a lot of very bad things are going to be learned about what took place.",
    "Something that I had achieved for the first time and 72 years, I was very proud of that they ended it almost immediately.",
    "The easy part was for Biden to just get him out, let the soldier stay the remaining soldiers and take care of everything.",
    "And the more death that's caused, the more money he makes because oil prices keep climbing higher and higher and higher.",
    "Joe Biden is turned calm into chaos, competence into incompetence, stability into anarchy and security into catastrophe.",
    "But even our Supreme Court justices, and it's sad to say this, are afraid to do what has to be done to save our country.",
    "And we will ensure our futures made right here we're going to manufacture we started at big time, right here in the USA.",
    "Look at Philadelphia, where people that kill, violent criminals are being immediately allowed out of jail with no bond.",
    "And then they voted for the\non I call it the an infrastructure bill because there was very little infrastructure right?",
    "Remember, Joe and Hunter Biden got $3.5 million from the mayor of Moscow, his wife, and we're never allowed to explain.",
    "Even the pictures are taken of the people stuffing the ballot boxes because without the pictures, they don't get paid.",
    "But we will never forget what they did to our children, we will hold them accountable at the ballot box this November.",
    "We are done with the fascists and communists and socialists, and we are done with their distorted visions for America.",
    "On the list I gave to the country before the 2016 election, I gave a list of great, brilliant, conservative justices.",
    "We as a country have no confidence anymore, but we will get it back and we'll get it back stronger than ever before.",
    "They set violent criminals loose without charges while prosecuting their political opponents for fabricated crimes.",
    "But they'll never ever do what they did to me and nobody else I don't believe would be able to take it if they did.",
    "To stand down to stop talking about it, to stop making Americans aware of the cheating and corruption that went on.",
    "So secure the border that we had, will be sealed good and tight, except for people coming into our country legally.",
    "And I'd love to ask him who's in the best shape\nhe was also an incredible Admiral, highly respected by everybody.",
    "The rhinos uncertain weak Republican politicians want to ignore election integrity also, but we cannot ignore it.",
    "They stick the FBI on mothers at school board meetings while they teach four year olds to pick their own genders.",
    "They enrich their families in Ukraine, China, Russia while they shutter your small businesses right here at home.",
    "You're either with the peaceful truckers or you are with the left wing fascists and that's what's been happening.",
    "We stand with the truckers and we stand with the Canadian people in there no both left to reclaim their freedom.",
    "But with respect to what's going on now, it would have been so easy for me to stop this travesty from happening.",
    "And when you hear 3 million people this year, it's not 3 million, it's probably three to four times that number.",
    "We can never really bring our country back unless we get an honest media, because they like the policing agent.",
    "So this is the whole text, with video to compare it to—on Rumble.com, not YouTube—so you can hear for yourself.",
    "As your president I negotiated free and fair trade deals with Canada, Mexico, Japan, all over Europe and China.",
    "And their pathetic policies have been out there long enough now that we don't want them we'll never take them.",
    "But we took in hundreds of billions of dollars from China, nobody else took in 10 cents over many, many years.",
    "I don't want to say we could win 65 seats because if we win 64 They'll say it was a terrible night for Trump.",
    "I said so let me ask you is a generals good strong, General Patton, how do you think he'd like this military?",
    "The toughest are the politicians, the meanest of the politicians, and the biggest lying scum of the politics.",
    "And American hostages plus $85 billion worth of the finest equipment anywhere in the world were left behind.",
    "But you also have to portray a strength to the outside world, otherwise, they're going to walk all over you.",
    "It's an outrage, and an atrocity that should never have been allowed to occur, it never would have occurred.",
    "I'm standing up in 2022 We're taking on this wretched and corrupt political establishment like never before.",
    "In history by far as your president I proudly protected our Constitution and the First and Second Amendment.",
    "This is a goal we have to say, this is what we should have voter ID, same day voting like we've always done.",
    "But we can build it back again quickly and even better than before, because they have lost all credibility.",
    "And no matter how you look at it, our country has totally lost itself confidence, loss of self confidence.",
    "And it's not a pretty thing as somebody that loves our country to watch, just not a pretty thing to watch.",
    "The Tyranny we have witnessed in Canada in recent weeks should shock and dismay people all over the world.",
    "But we had a very good relationship as your President, I kept my promise and chose Supreme Court justices.",
    "And I fought Angela, I said Angela, here is a white flag happen to be a white napkin that was on my desk.",
    "We have some great Republican leaders tonight also, and we have so many that I'm going to leave some out.",
    "One of the greatest deals we ever made, and I know it's great because they want to renegotiate the deal.",
    "We love our parents, of course, now we have to defend parents rights against these lunatics and maniacs.",
    "It was bad for our country in their mind, but they probably knew talking about it would have been good.",
    "I want to thank those incredible women for the job, Katherine and all of them for the job they've done.",
    "I stand as the only president of the 21st century on whose watch Russia did not invade another country.",
    "I instituted the largest tax cut in American history by far, and our economy thrived like never before.",
    "And it does not belong to the corrupt establishment in Washington that I have gotten to know very well.",
    "I've I know, certainly I feel certain that it was you can't have that you can't have a great democracy.",
    "The world rightly had a healthy fear that his President, I would stand strong for American priorities.",
    "Who wants this prisons from other countries being emptied out into our country just over one year ago?",
    "I said, Of course, he's smart, too, which I was greeted with, Oh, that's such a terrible thing to say.",
    "Although the way the Supreme Court is behaving, perhaps the Republicans should pack the Supreme Court.",
    "They want to do the same thing to America, that Trudeau has been doing to Canada and much, much worse.",
    "As President I was proud to issue the world's first ban on critical race theory in September of 2012.",
    "Under Joe Biden, we're losing our country no different than if we had lost it in a war, no different.",
    "And if you ever saw him work out he just machine starts to burn the treadmill start to go up on fire.",
    "But she does it anyway, Marjorie Taylor green a man that knows me almost better than any human being.",
    "When I left office, America was a net exporter of energy for the first time in our country's history.",
    "The only ones that can make the changes are the state legislatures and they didn't make the changes.",
    "Right next door, a place called Canada\nwhere by the way, we got rid of NAFTA and we have the US MCA.",
    "I got along with President Xi, I got along with Kim Jong moon, Kim Jong Un is massive nuclear power.",
    "He loves Russia, that we had the Russia, Russia, Russia, hoax, which is now with Durham and Mueller.",
    "Everything they're doing to me is about preserving their power and control over the American people.",
    "They've got millions of viewers and those viewers and that network should be allowed to go forward.",
    "But just a wrong word or was wrong like a young or going to sleep very early, like at four o'clock.",
    "Good guy, former congressman and now happens to be working on a little project called Truth social.",
    "voter rolls must be updated, and they must be accurate, not changed after the election takes place.",
    "I'm the only president in history to stand up to China, and their one sided unfair trade practices.",
    "And they said, get out the checkbook and money float in billions and billions of dollars float in.",
    "If I see him, if you don't mind, during the course of a speech shall just bring them out this way.",
    "It's always a disaster when we do this because they'll say sir, and it takes me a year to make up.",
    "They focus they say on the swing the swing states and you know what, they probably did others too.",
    "Because China now I understand the China but once I'm out China's not going to adhere to the deal.",
    "The people who are masking our children may plan to lift those mandates right before the election.",
    "If our election was not rigged, and of I was the president of very simple wouldn't have happened.",
    "And they did hundreds of billions of dollars started floating in hundreds of billions of dollars.",
    "They are losing, we are winning, they know it, they know it, and that's why they're going so far.",
    "They're acting as though they were lunatics, maniacs, and the people get it, and we have to stop.",
    "Mail in ballots need to be in secure rooms with cameras so they can be no tampering with ballots.",
    "Wonderful thing if we could ever go by the way Canada goes to paper ballots, you know that right?",
    "We will end sanctuaries and we will end catch and release and we will end the visa lottery scam.",
    "Let me also express my enormous gratitude to every single one of you here today in the audience.",
    "And you know, I don't have all these days, but I happen to see a star 128 and one in wrestling.",
    "And I was proud to be the first president in decades who did not get our country into any wars.",
    "And it'll be interesting to see what's going to happen over the next three weeks or four weeks.",
    "Every state must adopt election integrity measures, signature verification, illegal immigrants.",
    "We all know what happens when you get a rigged election, like in 2020 will never happen again.",
    "And as you probably know, through history, you've had some rather major conflicts with Russia.",
    "But our opponents have made a very big mistake they have done the one thing you must never do.",
    "They are afraid of packing the court so that they are only one of 15, 19, or even 25 justices.",
    "And then we're going to kick the Biden crime family out of the White House in 20.4, or seven.",
    "While they throw our borders open to an illegal foreign invasion, which is what is happening.",
    "Now we know that crooked Hillary not only spied on my campaign, she spied on the White House.",
    "They say, even while they're destroying our own borders and surrendering our own sovereignty.",
    "And this year, we're being vividly reminded how fragile and precious that heritage really is.",
    "I also warned NATO about the danger of Russia and look at the consequences on foreign policy.",
    "We had peace in your China knew that it could no longer take advantage of the United States.",
    "They can no longer be afraid of the radical left our Supreme Court and our judges generally.",
    "And then of course, when COVID or the China virus came in, we had to deal a lot differently.",
    "2022 will be the year that millions of everyday citizens stand up to the Left wing fascists.",
    "And the way you do it is to come to a very powerful conclusion as to what happened in 2020.",
    "Something new that came up parents rights whoever thought a parent's rights parents rights.",
    "Bigger than Russia and Saudi Arabia combined times two in one year, we were already bigger.",
    "In Afghanistan, I brought you down to do 1000 soldiers, the easy part was just getting out.",
    "They reveal not the dominance of the radical left, but their desperation and their despair.",
    "And you know what President Xi liked to be and respected me and I liked and respected him.",
    "Putin is saying, Oh, they're going to sanction me, they sanction me for the last 25 years.",
    "And, you know, we didn't have one soldier killed in 18 months in Afghanistan, we add them.",
    "And we will defend the Constitution the right to life and the right to keep and bear arms.",
    "Women that he didn't know women that a particular justice Kevin had no idea who they were.",
    "They indoctrinate your children to hate their parents, while calling you a hateful racist.",
    "As everyone here understands the COVID mandates are just one part of a much larger crisis.",
    "And, you know, as early as when it first happened, I let the governors make that decision.",
    "Which has been trending at the top all over the place, and it's gonna give our voice back.",
    "A man who's terrific who really loves our country and who's loved in the state of Florida.",
    "It's also far past time to declare independence from every last COVID mandate, it's time.",
    "I watched them I saw those Maple Leafs all over the flags and the love for their country.",
    "We will stop the radical Democrats from packing the Supreme Court with far left justices.",
    "We will place tariffs on other countries to restore the glory of American manufacturing.",
    "We will reclaim our status as the number one energy superpower on the face of the earth.",
    "Now, Biden is pleading with OPEC and begging Iran to reenter the disasters nuclear deal.",
    "The cost of the war is very, very small compared to the kind of money they're taking in.",
    "He's not thinking about the nuclear warming, he's thinking about other types of warming.",
    "So that young Americans would learn to love this country as much as we in this room do.",
    "And these are great people and they're patriots and they want to take away their voice.",
    "America's history will be taught fully and truthfully to America's beautiful children.",
    "What are we doing $6,000 In you go to jail for $117 million spread all over the place.",
    "They send young Americans to fight and die for the borders of distant foreign nations.",
    "But I can tell you that the Republican governors did quite well, thank you quite well.",
    "And it's worse, they're finding out things now that nobody even thought were possible.",
    "I've had great people come up to me and tell me sir, ma'am, please ask you a question.",
    "Because they make us weak, and they make our country unsustainable as a nation itself.",
    "She said to two all American wrestlers and I said are you better than your father was?",
    "It's a travesty like nobody could believe could happen in such a short period of time.",
    "As your president, I eliminated more burdensome regulations than any other president.",
    "And we've learned a lot over the last four years, we've learned how corrupt they are.",
    "Like no country has ever been hit, you will be hit harder than anybody has ever been.",
    "But there's never been anything like this ever done to an American president before.",
    "And we will submit to this left wing tyranny no longer we will not do it any longer.",
    "They say they are the ones that are going to defend your democracy and your justice.",
    "Would General Patton be allowed to shout at a private who is doing a horrible thing?",
    "Whoever heard of that, Whoever heard of that our country has lost itself confidence.",
    "A radical Left zealot has been nominated to the Supreme Court of the United States.",
    "But nobody could ever believe how bad and weak and grossly incompetent it has been.",
    "Remember, they said oh, the planes are coming in the people that rushed the planes.",
    "The Washington swamp knows that we are coming to break their grip on power forever.",
    "And they'll continue and we will all continue together to make America great again.",
    "As your president I made America energy independent for the first time in 72 years.",
    "The crackdown, censorship and canceled culture are not an expression of confidence.",
    "They understood any hostile actions would be met with swift and severe consequence.",
    "We are a laughingstock in summation and in closing as your president I instituted.",
    "He had every soldier A great doctor, a great Admiral, and you know what he is now?",
    "He goes, but why your Excellency Mr. President, you send me a picture of my house.",
    "And you know, the saddest part, the hardest thing to do isn't to have caught them.",
    "And we must immediately stop the influx of illegal aliens has to stop immediately.",
    "The most important duty of every elected lawmakers to protect and defend America.",
    "Two days ago, they cancelled many oil and gas leases, because of the environment.",
    "But at the same time, Joe Biden bragged unknowingly on tape and this was on tape.",
    "We saved our steel industry because they were dumping steel all over our country.",
    "They rigged elections, to disenfranchise you and destroy you and ruin your lives.",
    "And to be loved by all these are the justices of the United States Supreme Court.",
    "Under our leadership, the world was a peaceful place because America was strong.",
    "built over 500 miles of border wall and ended the insanity of catch and release.",
    "They so far allowed him to get away with this travesty and assault on humanity.",
    "Those are people that you will be paying a big, big price for in years to come.",
    "If they want to look and look abroad and fight for what they want to fight for.",
    "That's really saying, It's okay, you can do it again, we can't let that happen.",
    "Do you know that he went to Oxford he was an incredible student, brilliant guy.",
    "And it's great to be back where it all started with the great patriots of CPAC.",
    "That's a lot of people and my friends from North Carolina, they've come to 92.",
    "He could have said he did something or he thought, Well, I wasn't appropriate.",
    "The days of big tech censoring the voices of the American people are numbered.",
    "He said, That's not an appropriate question that turned out to be another one.",
    "We're not the United States, we're considered a dumping ground for criminals.",
    "The Obama Administration gave them blankets—you remember they given blankets?",
    "And our great military has been humiliated in its surrender from Afghanistan.",
    "Don't impeach me please, for being with a woman that I never heard of before.",
    "They live sanctions on Iran while they sanction and destroy our own citizens.",
    "And the perception of our country was perhaps like it had never been before.",
    "This is a tipping point for the country, and the stakes could not be higher.",
    "You mean, they're not going to blow us to pieces, at least psychologically.",
    "The Radical Left is trying to replace American democracy with woke tyranny.",
    "He's an incredible, loving, wonderful but very tough politician from Texas.",
    "They've undone some of it—not all of i—I'll never be able to do all of it.",
    "And he said, Mr. President, but why he actually called me Your Excellency.",
    "We will place tariffs and other countries we will do the terrifying thing.",
    "Thank you, I gave Ukraine the Javelins that everyone is now talking about.",
    "We wanted to get out but we had to get out with strength and with dignity.",
    "I call it the crime of the century, ballot harvesting as it gets released.",
    "As everyone understands this horrific disaster would never have happened.",
    "And he understood that I didn't play games, this would not have happened.",
    "In addition, we must defend parents rights, something new, something new.",
    "Do you remember when I said years ago, I think they spied in my campaign.",
    "No mail in ballots except for our military and people who are truly sick.",
    "As your president, I insisted NATO nations start paying their fair share.",
    "And they said, Well, does that mean you won't protect us if we don't pay?",
    "That is why they are so desperate to stop us they will go to any length.",
    "If you take over Ukraine, we're going to sanction you they say sanction.",
    "You mean, I can take over all country and they're going to sanction me?",
    "We rebuilt our economy and energy independence and all of those things.",
    "I've seen the anger and the hatred and the horror at the 2020 election.",
    "But I said Abdul you're killing ourselves is you better kill ourselves.",
    "We all know state constitutions were also ignored all over our country.",
    "I have a young son, Baron young son and he can make his computer sing.",
    "And I tariff them beyond any levels that anybody thought was possible.",
    "Now, my fellow Americans, this nation does not belong to the radicals.",
    "Remember, he signed 17 executive orders and one of them unattended it?",
    "They are behaving not the way we think is appropriate for our country.",
    "As a lot of people have suggested that, but I don't think we'll do it.",
    "Yet if the radical Democrats truly want to fight for democracy aboard.",
    "They've been ripping us off for 30 years, it's time for us to do well.",
    "We are bringing back our country and we are bringing back our freedom.",
    "Takes me a year because it's a year before they sit before you again.",
    "We're dealing with some people that are truly evil, truly bad people.",
    "We have a world that's ready to blow up and disintegrate over energy.",
    "Whoever heard of that whoever thought you'd be hearing but it's true.",
    "And he did have an affinity there's no question about it for Ukraine.",
    "Yesterday, reporters asked me if I thought President Putin was smart.",
    "But they're not going to hear but the farmers did fantastically well.",
    "That's why they're doing some of the crazy things that they're doing.",
    "We will not surrender our history, we will not surrender our liberty.",
    "That was bad things happen with a vote very, very bad things happen.",
    "And it was an incredible deal for our farmers and our manufacturers.",
    "They should have never ever in the Senate given that two month stay.",
    "The problem is not that Putin is smart, which of course, he's smart.",
    "When you see the things that the stupidity, the open border concept.",
    "And the fake news media those people right there refused to report.",
    "And we turned them into some of the greatest trade deals ever made.",
    "We will not surrender our faith; we will not surrender our values.",
    "We're going to end Nancy Pelosi his political career once in draw.",
    "I also created the 1776 commission you people would love the 1776.",
    "I call it the two months in which they can get their act together.",
    "As we defend American safety, we must also defend American values.",
    "But they're going to find out the hard way starting on November 8.",
    "Did you ever hear Republicans do that, but this was truly a scam.",
    "I had a meeting with Abdul Abdul Aziz, the leader of the Taliban.",
    "And then Biden with the help of Mitch McConnell came into office.",
    "All the while they claim is they're the ones defending democracy.",
    "With one voice, Americans must insist that the emergency is over.",
    "We've lost ourselves confidence when you see the way we withdrew.",
    "And all the rest is that total hoax is a made up fictional story.",
    "We all know laws were not followed ballot harvesting was rampant.",
    "The world is always say for when America has a strong president.",
    "These are stories that the fake news doesn't want to talk about.",
    "It's horrible, because it's a disincentive for him to disengage.",
    "And that begins with protecting and defending America's borders.",
    "We have terrorists that came out of Afghanistan, with the plane.",
    "Can you imagine a committee made of these that they hate us all?",
    "The work of making America great, again, is only just beginning.",
    "It's all on tape, and it's coming out over the next three weeks.",
    "They had to take a picture of them and what a job they've done.",
    "And I can't think of any Democrat governor that did a good job.",
    "You know, the expression, they play the ref, they play the ref.",
    "So we've been together from the very beginning in this journey.",
    "And by the way, I noticed a patriot in our midst, Mike Lindell.",
    "Until COVID came and then there was a whole different ballgame.",
    "This coming midterm election is more critical than ever before.",
    "And it's patriots like you that are going to save our country.",
    "But you're leading very big, and you're doing a fantastic job.",
    "And now they want to go back to the Iran nuclear deal America.",
    "Nobody else ended his pipeline, Biden came in, he approved it.",
    "The streets of our Democrat run cities are drenched in blood.",
    "That's the single biggest factor having to do with inflation.",
    "The oceans may rise over the next 300 years 1/100 of an inch.",
    "The world is always in danger with a weak American president.",
    "We will make America proud again, we want to be proud again.",
    "They kept saying wisdom money, wisdom, money, wisdom, money.",
    "And what has happened in Ukraine is a catastrophic disaster.",
    "I would much rather have him do a great job than a poor job.",
    "He had a horrible night he only won 64 He said he wanted 65.",
    "Make no mistake, they will try to do it again and 22 and 24.",
    "It's a good thing to get along with people not a bad thing.",
    "And I'd come in the fake news would say Trump loves Russia.",
    "She's an incredible woman carry, like Kari Lake, everybody.",
    "That's why That's why I like he was the White House doctor.",
    "And Mexico agreed with us someday I'll tell you that story.",
    "Nobody, no president was ever as tough on Russia as I was.",
    "With the Abraham Accords, we had peace in the Middle East.",
    "We ended the worst and most dangerous deal I've ever seen.",
    "They have been slandered as Nazis, racists and terrorists.",
    "They should start with the democracy that is under threat.",
    "Most of it's like throwing the money right out the window.",
    "They've been falsely accused of loyalty to foreign powers.",
    "And we had some governors that didn't do a very good job.",
    "They are trying so desperately to be politically correct.",
    "You know in China for years, they ripped off our country.",
    "I just never had any idea what's going to happen so fast.",
    "But I did a lot of things that were very tough on Russia.",
    "They're doing everything but that will not be successful.",
    "You know, they're politicians and they're vicious people.",
    "But the President of Ukraine said “he did nothing wrong”.",
    "He is a faithful he's a great guy to, he spent his life.",
    "That turned out to be another very appropriate question.",
    "I said Angela, you can have it, he said But why but why?",
    "Let's lock up your state, then let's harm your children.",
    "I said, Abdul, you better not kill our soldiers anymore.",
    "Because it's so much damage to people into our children.",
    "I brought it down from 20,000 soldiers to 2000 soldiers.",
    "I love New York, my beautiful New York what's happened?",
    "And we could have pulled out with strength and dignity.",
    "Let's take their social lives away at a very young age.",
    "But that'll be released, whereas everything is on tape.",
    "But Ukraine, sovereignty must be defended at all costs.",
    "We always very simply put America first was the answer.",
    "That's a pretty that's only a son could say that right?",
    "A person who's very shy doesn't like speaking her mind.",
    "Madison they're doing everything they can to stop him.",
    "He's running it's not going to be much of an election.",
    "That's not putting America first we put America first.",
    "And I want to thank John Durham for figuring that out.",
    "It's to get those people to write anything about him.",
    "Even Jim Jordan would have been concerned if he hurt.",
    "And I believe you're going to be hearing a lot of it.",
    "That's how they start exactly what's happening today.",
    "You know what the bottom line, they love our country.",
    "A man who I've been every time he goes on television.",
    "They will find out like never before—we did it twice.",
    "The drugs pouring in and human trafficking will stop.",
    "Ridiculous Cancel culture will be wiped out entirely.",
    "And Secretary General Stoltenberg was my biggest fan.",
    "We don't want you here you have to remain in Mexico.",
    "And we will again save our country from destruction.",
    "And Polly produced one all American or two is a 212.",
    "I called them up to congratulate him on his victory.",
    "And millions of dollars of other military equipment.",
    "No, no, we gave you blankets they said and blankets.",
    "Let's lock up your cities, let's lock up your towns.",
    "And then Mitch McConnell gave them a two month stay.",
    "I don't want to be an impeached Supreme Court judge.",
    "They've been arrested and charged with phony crimes.",
    "Someday I'll tell you exactly what we talked about.",
    "Millions of illegal aliens are rushing our borders.",
    "But the real truth is they have no idea what it is.",
    "We were doing things that we had never done before.",
    "And we're talking about hundreds of 1000s of votes.",
    "I think it's 92 rallies and CPACS and other things.",
    "You know, all the crap you have to listen to right?",
    "He's still in great shape, but he's a tough cookie.",
    "And he thinks it's actually a very beautiful sight.",
    "And this is some crowd, we broke the record again.",
    "These people are not living in a world of reality.",
    "No, no, no, no, no global warming, global warming.",
    "And they refuse to air scandal they refuse to err.",
    "And the fake news didn't want to mention anything.",
    "It's probably 10 million 11 million or 12 million.",
    "I don't know if their husbands are happy about it.",
    "But the real problem is that our leaders are dumb.",
    "For a boy or man to participate in women's sports.",
    "We had some Republicans headed by Mitch McConnell.",
    "One year ago, we were respected like never before.",
    "It was patriots like you that built this country.",
    "This can never ever happen again in this country.",
    "She has been very well see, I'm being diplomatic.",
    "You need those borders, you need those elections.",
    "They use the intelligence age cease to frame you.",
    "Our most dangerous people are people from within.",
    "It's the destruction within that spells our doom.",
    "That say we got us into trouble, but that's okay.",
    "You know, you're not allowed to say that anymore.",
    "Sir, I we don't think that would be appropriate.",
    "The unselect committee I think that was my term.",
    "And I'm very proud of it and China respected us.",
    "And I said, I'd rather not answer that question.",
    "We are a laughingstock all over the world today.",
    "They are an expression of cowardice and a fear.",
    "And we must insist on integrity in the process.",
    "And we had some governors that did a great job.",
    "You had them on the ropes you are going to win.",
    "And in many ways, I can't answer that question.",
    "Their assets and life savings have been frozen.",
    "We are praying for the proud people of Ukraine.",
    "And a major war in Europe may very well erupt.",
    "You know, I'm the one that ended his pipeline.",
    "But it will be 75% of your energy from Russia.",
    "Can you imagine if I did that, it was on tape.",
    "I don't think they use big tech to censor you.",
    "They've got them at the machine standing here.",
    "I mean, look at Los Angeles, what's going on?",
    "He said, You're killing me with the pipeline.",
    "Now you just can't it just such an important.",
    "I hate to say that long was that about right?",
    "Great student you know, he's a great student.",
    "The other senators not so good in that state.",
    "And then again even more so in November 2024.",
    "They don't want to close up the little loops.",
    "Somebody said, Sir, you've been in business.",
    "Our beautiful friends, they've come to nine.",
    "murderers are setting records in our cities.",
    "It was a surrender for no reason whatsoever.",
    "So said, Putin is playing Biden like a drum.",
    "These are people that must hate our country.",
    "Do you think he calls Biden Your Excellency?",
    "Our steel industry was going down the tubes.",
    "I believe he's afraid to do the right thing.",
    "They use the legal system to persecute you.",
    "Giving you slightly more seafront property.",
    "And it's getting worse and worse every day.",
    "The Russian attack on Ukraine is appalling.",
    "Wow, I look, I just looked at a poll, Kari.",
    "I want to thank and these are great people.",
    "All American wrestler and nobody like him.",
    "The Radical Left is exposed, they're weak.",
    "Our country is being poisoned from within.",
    "They want to say their borders are sacred.",
    "No, you got to get rid of that prosecutor.",
    "They paid hundreds of billions of dollars.",
    "Here they are here they are, you know why?",
    "This nation belongs to you belongs to you.",
    "I instituted the Remain In Mexico policy.",
    "I went to a child who was five years old.",
    "America is the greatest country on Earth.",
    "What took place there we have it on tape.",
    "That's why our farmers are doing so well.",
    "Is there ever been a committee like this?",
    "There's never been a situation like that.",
    "NAFTA was the worst trade deal ever made.",
    "Because we had something very bad happen.",
    "I'd like to tell that to yes, he's smart.",
    "Look at all those cameras up there, wow.",
    "And that's what they're doing right now.",
    "These are the names they've been called.",
    "And we feel for Ukraine in so many ways.",
    "But we made incredible deals with China.",
    "Now it's that was such a horrible thing.",
    "Thank you very much Thank you very much.",
    "Also representatives, Madison Cawthorne.",
    "She is doing incredibly well in Arizona.",
    "These are patriots, Senator Rick Scott.",
    "We had it done—the election was rigged.",
    "You look at what's going on in Chicago.",
    "They are terrified of the radical left.",
    "We have a border, that's a catastrophe.",
    "I was the one that brought us way down.",
    "Would you take the soldiers out first?",
    "It's really unbelievable and canceled.",
    "You don't have to even think about it.",
    "And he's talking about global warming.",
    "And we are a long way from being done.",
    "Iran is on the cusp of a nuclear bomb.",
    "They're looking the opposite of smart.",
    "How did you take what they did to you?",
    "But remember, they're coming after me?",
    "And he's afraid I believe he's afraid.",
    "And everybody said are the other side?",
    "They use the Deep State to spy on you.",
    "We can't let them destroy our country.",
    "And then I said they can't be serious.",
    "And there's so many other people here.",
    "Congressman Ronny Jackson, thank you.",
    "Because that's the way they get paid.",
    "I went, I was much tougher than that.",
    "And we'll be fighting that very hard.",
    "Would you like to change your gender?",
    "Well, that's a pretty weak statement.",
    "They said we need more than blankets?",
    "And we will make America great again.",
    "I'm the one that got us out of wars.",
    "You can be very tough and get along.",
    "Under Biden, Russia invaded Ukraine.",
    "It's all on tape, and truth to vote.",
    "They gotta resist, they gotta fight.",
    "Nobody's better than my father was”.",
    "And she's beautiful inside and out.",
    "Where do you meet people like this?",
    "And we have it just about finished.",
    "The wall will be quickly completed.",
    "And you know, we made a trade deal.",
    "He got a he got 4000 I got nothing.",
    "Because if you do, you will be hit.",
    "Plenty of Americans were there too.",
    "I'm a Justice of the Supreme Court.",
    "But I can't do any of those things.",
    "As grave as the dangers are abroad.",
    "But the swing states was the focus.",
    "under Bush, Russia invaded Georgia.",
    "God bless them all, God bless them.",
    "We will make America wealthy again.",
    "We will make America strong again.",
    "And I believe that to be the case.",
    "I said, let me ask you a question.",
    "And you're not allowed to do that.",
    "We had the worst trade deals ever.",
    "I said because you're getting 75%.",
    "And I think it's higher than that.",
    "As one of the worst scandals ever.",
    "There's plenty of conflicts there.",
    "They didn't want to talk about it.",
    "Thank you, they'll get some votes.",
    "And they say it's absolutely fine.",
    "They use the media to slander you.",
    "He's a people they call him mules.",
    "And we could not let them do that.",
    "But we'll give it the best we can.",
    "He's here someplace Governor step.",
    "Matt gates wisdom Thank you, Matt.",
    "And also, for Obama and for Bush.",
    "We're going to be doing it again.",
    "So sets have been in Afghanistan.",
    "Our country is a dangerous place.",
    "And they think it's going to 150.",
    "With a thing like that happening.",
    "We will make America safe again.",
    "Yeah, I know how to get it open.",
    "We must seek a goal of voter ID.",
    "Or would you take them out less?",
    "Under Obama, Russia took Crimea.",
    "Those are very energetic people.",
    "I think I came up with it first.",
    "Because I'm standing up for you.",
    "They'd go on to the next victim.",
    "They don't want to be impeached.",
    "Former Congressman, Devin Nunes.",
    "She was the anchor for 22 years.",
    "comes from an incredible state.",
    "But nobody's ever had a border.",
    "We're gonna impeach him anyway.",
    "It's everything you could have.",
    "Well, it turned out to be true.",
    "And thank you, Linda, good job.",
    "That's and this is his problem.",
    "I saw John Kerry on television.",
    "And we're talking about energy.",
    "I spent a lot of time with him.",
    "This is an assault on humanity.",
    "Thank you for your dedication.",
    "But they are beautiful people.",
    "Because our country is a mess.",
    "Because without the fake news.",
    "They wouldn't do that with me.",
    "But John Kennedy is fantastic.",
    "22 years and people loved her.",
    "Jim, thank you for being here.",
    "We appreciate your being here.",
    "And that's a lot of fake news.",
    "He was five and he understood.",
    "It's called soldiers out last.",
    "I said, that's what it means.",
    "He said he did nothing wrong.",
    "And he's with us all the way.",
    "Right here in our own nation.",
    "But I don't want to say that.",
    "And\nI knew that would happen.",
    "And we have to keep it going.",
    "Russia is decimating Ukraine.",
    "China is threatening Taiwan.",
    "I said, never let it happen.",
    "Powerful, cunning and smart.",
    "It was bad for the election.",
    "And we can't let this go on.",
    "There was 9% infrastructure.",
    "Because I love this country.",
    "What would you like to know?",
    "And it's been a strong line.",
    "He's so bad for our country.",
    "He's going to win so easily.",
    "And there's nobody like him.",
    "I turn it off and I lock it.",
    "I gave him the whole story.",
    "It's politically incorrect.",
    "Now we're a stupid country.",
    "And I was with Putin a lot.",
    "Now we obviously know that.",
    "General Douglas MacArthur?",
    "We must get this reversed.",
    "Well, we want the Taliban.",
    "What the hell is going on?",
    "We got to fight like hell.",
    "They were all in lockstep.",
    "And they love our country.",
    "The point the other point.",
    "Haggerty, Bell, Tennessee.",
    "He knows every inch of me.",
    "We broke the record again.",
    "Great State of Tennessee.",
    "He's got one point there.",
    "And well, you never know.",
    "And Governor Kevin Stitt.",
    "Absolutely nothing wrong.",
    "These are vicious people.",
    "These are vicious people.",
    "They said, We don't care.",
    "You don't have a scandal.",
    "By opening truth, social.",
    "That's Mexico and Canada.",
    "That was a horrible deal.",
    "You've heard me say this.",
    "Losing is not an option.",
    "store shelves are empty.",
    "We were a smart country.",
    "What a job they've done.",
    "He's lived through hell.",
    "Please don't impeach me.",
    "Please don't impeach me.",
    "A line has been crossed.",
    "Thank you all very much.",
    "Like Adam shifty Schiff.",
    "There's nobody like him.",
    "Thank you, Senator Bill.",
    "Congressman Jim Jordan.",
    "And he's tough as hell.",
    "We all love you, Ronny.",
    "He was a great Admiral.",
    "That's a lot of people.",
    "We know Governor Stitt.",
    "And she is leading big.",
    "Another great patriots.",
    "It's a lot of bullshit.",
    "He's a ballot stuffers.",
    "We need fair elections.",
    "But we talked about it.",
    "And that's what it was.",
    "This is how they start.",
    "It's horrible to watch.",
    "He's getting too close.",
    "I'd take them out last.",
    "Hi, Dad, how you doing?",
    "And we have to stop it.",
    "Canada, paper ballots.",
    "I don't think they do.",
    "They are indeed brave.",
    "They love our country.",
    "I got you out of wars.",
    "And we have to fix it.",
    "I have had that a lot.",
    "And we'll do it again.",
    "So just keep working.",
    "How dare he say that?",
    "They call them mules.",
    "He gave $417 million.",
    "They were absolutely.",
    "I got along with him.",
    "They're great people.",
    "They should leave it.",
    "And it's all on tape.",
    "In each swing state.",
    "Thank you very much.",
    "Thank you very much.",
    "It is a persecution.",
    "Thank you very much.",
    "How did you take it?",
    "How did you take it?",
    "Thank you very much.",
    "Thank you very much.",
    "Thank you very much.",
    "We must win in 2022.",
    "We must win in 2024.",
    "And they are afraid.",
    "We got along great.",
    "We got along great.",
    "What are you doing?",
    "It's a great crowd.",
    "She was the anchor.",
    "We need everything.",
    "It's a great deal.",
    "That's what it is.",
    "But you know what?",
    "That's what it is.",
    "I want to be nice.",
    "We have no choice.",
    "We have no choice.",
    "They don't resist.",
    "Just keep working.",
    "I'm glad the tape.",
    "Don't wrestle him.",
    "It's like a fight.",
    "God bless you all.",
    "Two minutes later.",
    "And John Kennedy.",
    "I must be honest.",
    "He said “No, sir.",
    "They gotta fight.",
    "He understood me.",
    "So we have to do.",
    "It's incredible.",
    "Trump was right.",
    "And at any cost.",
    "Thank you, Mike.",
    "She's beautiful.",
    "Thank you, Bill.",
    "Thank you, Rick.",
    "Mark Green Mark.",
    "Thank you, Mark.",
    "Thank you, Mark.",
    "went to Oxford.",
    "Where is Devin?",
    "Devin is tough.",
    "He was serious.",
    "Inside and out.",
    "Will you stand?",
    "He's a patriot.",
    "He said he did.",
    "And that is it.",
    "And they voted.",
    "We need energy.",
    "Think of it 36.",
    "Now it hit 100.",
    "And I tax them.",
    "Look at Syria.",
    "We must agree.",
    "Appreciate it.",
    "It's terrible.",
    "But it's true.",
    "We love Ronny.",
    "Great people.",
    "Right, Polly.",
    "A third time.",
    "I don't know.",
    "It's treason.",
    "No different.",
    "Look at Iraq.",
    "We need oil.",
    "We need gas.",
    "I really do.",
    "How dare he?",
    "We add them.",
    "It was over.",
    "We ended it.",
    "It's all on.",
    "Who's next?",
    "Oh, really?",
    "Absolutely.",
    "He gets on.",
    "And Polly.",
    "Thank you.",
    "Great job.",
    "Great job.",
    "Thank you.",
    "Thank you.",
    "Thank you.",
    "Very much.",
    "Thank you.",
    "Thank you.",
    "Thank you.",
    "Terrible.",
    "Not good.",
    "Oh, sure.",
    "So dumb.",
    "And you.",
    "Will it?",
    "Really?",
    "Nobody?",
    "Right?",
    "Right.",
    "Right?",
    "This?",
    "Much.",
    "Sir?",
    "Yes.",
    "Wow."
  ]
}