{
  "id": 1335,
  "mediaId": 2663,
  "date": "2022-02-17",
  "headline": "Jim Jordan is having a craptastic birthday",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/02/GettyImages-1202797622-e1645118904253.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/jim-jordan-craptastic-birthday-20220217",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Graham Gremore",
  "authorUrl": "https://www.queerty.com/author/graham-gremore",
  "termIds": [
    0
  ],
  "sentences": [
    "While you’re here, re-live that moment when Val Demings handled Jordan like a boss after he interrupted her during a House Judiciary Committee hearing on a proposed hate crimes bill last year…\nIt’s interesting to see my colleagues on the other side of the aisle support the police when it’s politically convenient to do so, but not when police officers who protect us every day here at the Capitol were fighting for their lives because of the Big Lie.",
    "— Roxanne K (@roxlouken) February 17, 2022\nA birthday card from me to Gym pic.twitter.com/2pUmgUBcYK\n— Free As An Eagle (@CherokeeBlood3) February 17, 2022\nJordan has been dodging the January 6 committee for weeks, refusing to comply with the panel’s request that he provide information about his communication with ex-president Donald Trump in the days leading up to the deadly attack.",
    "Related: It looks like Ivanka Trump is about to become #SubpoenaedBarbie by the January 6 committee\nAnd on Sunday, Jordan appeared on Fox News to say he believes Clinton aides should be put to death after reports that members of her 2016 presidential campaign paid a tech company to access servers belonging to Trump Tower in an effort to find links to Russia.",
    "It’s about getting his friends.”\nThe Hill reports:\nThe committee has staffed up with 14 or so ex-prosecutors because: a) the task is vast; b) they have the resources to hire well-trained lawyers who have handled complex federal cases; and c) typical congressional staffers just can’t handle such a colossal undertaking.",
    "(He claims he “can’t remember.”)\nRelated: Jim Jordan is sure acting like a guy who knows he’s guilty and probably going to jail\nThis week, the birthday boy went on Laura Ingraham‘s show to whine about how the committee has been working with waaaay too many former prosecutors for his liking.",
    "pic.twitter.com/EN9HFKSFsy\n— The Lincoln Project (@ProjectLincoln) February 17, 2022\nToday is Jim Jordan’s birthday which means it’s a perfect time to remind you that he hasn’t passed a single bill in more than 14 years in the House.",
    "“You had the government working with the Clinton campaign to go after the Republican Party’s nominee for president to spy on that campaign.”\nOf course, Jordan didn’t provide any evidence to support his assertion.",
    "@HouseJudiciary pic.twitter.com/x9i9LO5AAi\n— Rep. Val Demings (@RepValDemings) April 20, 2021\nGraham Gremore is the Features Editor and a Staff Writer at Queerty.",
    "“14 former prosecutors are part of this committee,” Jordan said, adding, “This is all about getting President Trump, but it’s also bigger than that.",
    "The former college wrestling coach/homophobic congressman turns 58 years old today and he’s celebrating his big day by getting trolled on Twitter.",
    "In other words, Jordan and other Trump World lackeys are facing their worst possible nightmare in the mother of all congressional investigations.",
    "— Stephen Groves (@stephengrovesjr) February 17, 2022\nLets get him a nice trip to a private room in a federal penitentiary for his birthday.",
    "Butterfly LaChoi 7 saw BTS @ PTD Day 1 (@ButterflyLachoi) February 17, 2022\nAnother year of undeserved power and privilege.",
    "— Jack Cocchiarella (@JDCocchiarella) February 17, 2022\nAlso a good time to remind him @January6thCmte KNOWS EVERYTHING.",
    "— Gregory Hoodin (@cincygreghoodin) February 17, 2022\nGet out the birthday balloons!",
    "— Giuseppina (@Guice54907918) February 17, 2022\n— YouInMyEye ?????",
    "Here’s what people are saying…\nHappy birthday @Jim_Jordan !",
    "(@TwitchedAtBirth) February 17, 2022\nGood morning.",
    "Glad I share it with a respected Jordan (Michael).",
    "“That is what is so frightening here,” he said.",
    "Just reminding you in case you forgot that too.",
    "— teacHerk (@TexHerk) February 17, 2022\nGross.",
    "Rep. Jim Jordan (R) from OH-4 was born today!",
    "Follow him on Twitter @grahamgremore.",
    "I share my birthday with Jim Jordan.",
    "It’s time to send Jim Jordan home.",
    "It’s Jim Jordan’s birthday today.",
    "pic.twitter.com/027E2nyq34\n— ??",
    "It’s about getting his family.",
    "It’s Jim Jordan‘s birthday.",
    "What are you getting him?",
    "Happy birthday, Gym!"
  ]
}