{
  "id": 13409,
  "mediaId": 8413,
  "date": "2022-03-15",
  "headline": "Here's a look at how area members of Congress voted",
  "image": "https://www.gannett-cdn.com/-mm-/27243207262a8b55c9b1d925a7246ef1eb639ab4/c=4-0-1988-1121/local/-/media/2018/03/16/OHGroup/Fremont/636568071596003758-US-capitol.jpg?width=1984&height=1121&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.thenews-messenger.com/story/news/2022/03/15/heres-look-how-sandusky-and-ottawa-co-members-congress-voted/7033275001/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Stinchcomb",
  "authorUrl": "https://www.thenews-messenger.com/staff/4395603002/jon-stinchcomb/",
  "termIds": [
    1923,
    4566,
    3494,
    3540,
    3359,
    1398,
    1433,
    6709,
    5949
  ],
  "sentences": [
    "YEAS: Rep. Bob Latta R-OH (5th), Rep. Marcy Kaptur D-OH (9th)\nNAYS: Rep. Jim Jordan R-OH (4th)\nHouse Vote 2:\nCYBERSECURITY PARTNERSHIPS: The House has passed the National Cybersecurity Preparedness Consortium Act (S. 658), sponsored by Sen. John Cornyn, R-Texas, to authorize the Homeland Security Department to partner with private nonprofit groups on cybersecurity training efforts.",
    "A supporter, Rep. Kay Granger, R-Texas, said the spending \"provides our military and our troops with the resources they desperately need,\" and \"also ensures the safety and security of the American people by increasing overall funding for Homeland Security by 11 percent.\"",
    "2471), sponsored by Rep. Hakeem S. Jeffries, D-N.Y., that would fund federal discretionary domestic programs in fiscal 2022, including an 11.8 percent increase in funding for the legislative branch and 6.7 percent overall increase in funding for nondefense programs.",
    "The bill would establish a health benefits programs for Postal Service workers and retirees while ending a requirement that retirement health benefits be prepaid, and establish new budget and service reporting requirements for the Postal Service.",
    "A supporter, Sen. Lisa Murkowski, R-Alaska, said the bill sought to \"give the Postal Service the tools that it needs to be successful and to fulfill its essential mission and to hold the USPS accountable for improved performance.\"",
    "5681), sponsored by Rep. John Katko, R-N.Y., to reclassify a special unit of Immigration and Customs Enforcement officers (known as \"shadow wolves\") working on Tohono O'odham Nation land in southern Arizona as special agents.",
    "A supporter, Rep. John Katko, R-N.Y., said the bill \"will help provide training, exercises, technical assistance, and other important resources to state and local governments, critical infrastructure, and industry partners.\"",
    "WASHINGTON — Here's a look at how area members of Congress voted March 4 to March 10:\nAlong with roll call votes this week, the House also passed the Extension of Continuing Appropriations Act (H.J.",
    "5616), sponsored by Rep. Val Butler Demings, D-Fla., to require the Homeland Security Department to send accreditation status reports on its training programs to Congressional oversight committees.",
    "A supporter, Senate Majority Leader Chuck Schumer, D-N.Y., called the legislation \"the strongest, boldest, and most significant government funding package we have seen in a very long time.\"",
    "A supporter, Sen. Ron Wyden, D-Ore., said Pagan \"is an expert on a host of issues from trade in services to government procurement, and she has litigated several disputes before the WTO.\"",
    "2471), sponsored by Rep. Hakeem S. Jeffries, D-N.Y., to fund the Defense Department, Homeland Security Department, and associated military and national security programs in fiscal 2022.",
    "A supporter, Rep. Rosa L. DeLauro, D-N.Y., called the funding an effort to \"show just how government can work for working people once again and to achieve the betterment of humankind.\"",
    "YEAS: Brown D-OH, Portman R-OH\nSenate Vote 3:\nEARMARK SPENDING: The Senate has rejected an amendment sponsored by Sen. Mike Braun, R-Ind., to the Consolidated Appropriations Act (H.R.",
    "An opponent, Rep. Louie Gohmert, R-Texas, said: \"There is no way I could vote to exchange getting oil from Putin for getting oil from some other tyrant who wants to destroy America.\"",
    "Demings said stricter accreditation standards for new Homeland Security officers would \"position them to effectively safeguard the American people, our homeland, and institutions.\"",
    "An opponent, Sen. Mike Lee, R-Utah, said it failed to adequately improve the Postal Service's finances while shifting the cost of providing retiree health benefits onto taxpayers.",
    "NAYS: Latta R-OH (5th), Jordan R-OH (4th)\nYEAS: Kaptur D-OH (9th)\nHouse Vote 7:\nIMPORTING RUSSIAN ENERGY: The House has passed the Suspending Energy Imports From Russia Act (H.R.",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th), Jordan R-OH (4th)\nSenate\nSenate Vote 1:\nPOSTAL SERVICE CHANGES: The Senate has passed the Postal Service Reform Act (H.R.",
    "Braun said the drafting of the spending bill just before it was sent to Congress meant there had been no time for legislators to review proposed earmark spending.",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th), Jordan R-OH (4th)\nHouse Vote 3:\nTRIBAL BORDER AGENTS: The House has passed the Shadow Wolves Enhancement Act (H.R.",
    "Adams called the resolution a needed response to \"the recent despicable, cowardly bomb threats to more than 30 historically black colleges and universities.\"",
    "An amendment opponent, Sen. Patrick J. Leahy, D-Vt., said details about the earmark spending had been publicly available on the Internet since summer 2021.",
    "NAYS: Brown D-OH\nYEAS: Portman R-OH\nSenate Vote 4:\n2022 SPENDING: The Senate has agreed to the House amendment to the Consolidated Appropriations Act (H.R.",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th), Jordan R-OH (4th)\nHouse Vote 5:\nMILITARY, SECURITY SPENDING: The House has passed an amendment to a bill (H.R.",
    "An opponent, Rep. Chip Roy, R-Texas, said it increased irresponsible spending while failing to solve the problem of security at the border with Mexico.",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th)\nNAYS: Jordan R-OH (4th)\nHouse Vote 6:\nDOMESTIC SPENDING: The House has passed an amendment to a bill (H.R.",
    "Rob Portman R-OH\nSenate Vote 2:\nTRADE DIPLOMACY: The Senate has confirmed the nomination of Maria L. Pagan to be a Deputy U.S. Trade Representative.",
    "6968), sponsored by Rep. Lloyd Doggett, D-Texas, to bar imports from Russia of natural gas, oil and petroleum products, and other energy resources.",
    "Katko said the reclassification would improve pay for the shadow wolves and enable recruitment of new tribal members into the special unit.",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th)\nNAYS: Jordan R-OH (4th)\nHouse Vote 4:\nBLACK COLLEGES: The House has passed a resolution (H. Con.",
    "Pagan, currently a legal official at the Trade Representative Office, has been a trade lawyer for the federal government since the 1990s.",
    "2471), sponsored by Rep. Hakeem S. Jeffries, D-N.Y., that would fund federal military and discretionary domestic programs in fiscal 2022.",
    "House\nHouse Vote 1:\nHOMELAND SECURITY OVERSIGHT: The House has passed the DHS Basic Training Accreditation Improvement Act (H.R.",
    "2471), that would have barred funding for earmark spending on individual appropriations at the request of a member of Congress.",
    "70), sponsored by Rep. Alma S. Adams, D-N.C., condemning violence against historically black colleges and universities.",
    "It may cost more to fill your tank, but we must work to stop Putin's tanks from crushing families and freedom.\"",
    "Doggett said: \"To take the energy out of Putin's brutal assault, we place energy on our sanctions list.",
    "75), making further continuing appropriations for the fiscal year ending September 30, 2022.",
    "3076), sponsored by Rep. Carolyn B. Maloney, D-N.Y.",
    "The vote, on March 8, was unanimous with 418 yeas.",
    "The vote, on March 9, was 260 yeas to 171 nays.",
    "The vote, on March 9, was 361 yeas to 69 nays.",
    "The vote, on March 9, was 414 yeas to 17 nays.",
    "The vote, on March 10, was 35 yeas to 64 nays.",
    "The vote, on March 10, was 68 yeas to 31 nays.",
    "The vote, on March 10, was 80 yeas to 19 nays.",
    "The vote, on March 8, was 387 yeas to 33 nays.",
    "The vote, on March 7, was 390 yeas to 33 nays.",
    "The vote, on March 7, was 403 yeas to 19 nays.",
    "The vote, on March 8, was 79 yeas to 19 nays.",
    "YEAS: Sen. Sherrod Brown D-OH, Sen.",
    "YEAS: Brown D-OH, Portman R-OH",
    "Res.",
    "Res."
  ]
}