{
  "id": 1352,
  "mediaId": 2658,
  "date": "2022-02-15",
  "headline": "These companies stopped campaign donations to election objectors. Their lobbyists did not.",
  "image": "https://static.politico.com/9f/31/a7731fb944f9b1e9c4432662f980/https-delivery.gettyimages.com/downloads/675949688",
  "link": "https://www.politico.com/news/2022/02/15/jan-6-lobbying-companies-election-00008827",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5816,
    4905,
    4066,
    43,
    799,
    476
  ],
  "sentences": [
    "| Drew Angerer/Getty Images\nBy Emily Birnbaum, Megan Wilson and Hailey Fuchs\n 02/15/2022 04:30 AM EST\nIn the weeks following last year’s riot at the U.S. Capitol, Amazon suspended all campaign donations to the 147 Republicans who objected to certifying the election that day, calling their behavior “unacceptable.”\nSix months later, Amazon lobbyists began doling out thousands of dollars in personal donations to those very lawmakers.",
    "Illinois Democratic Rep. Jan Schakowsky, the head of the House Energy and Commerce’s consumer protection subcommittee, called the tech companies’ involvement “disappointing but not surprising.”\n“Unfortunately, despite the ‘outsider’ image Big Tech companies like Facebook and Amazon try to project, the truth is their lobbying posture in Washington represents the cynicism too many Americans sadly expect,” she added.",
    "“The access and influence buying is kind of the lubrication of how policy gets made in Washington, and the reality has been that so far very little political price has been paid by those Republicans who were objectors.”\nThe donations throughout much of 2021 came at a precarious time for businesses in Washington, when access to Congress was particularly important.",
    "In addition to allowing their in-house lobbyists to give personally to Republicans who voted to overturn the presidential election, at least 15 companies’ PACs last year gave to the National Republican Congressional Committee and the National Republican Senatorial Committee, which support GOP candidates regardless of how they voted on Jan. 6.",
    "With Republicans expected to take back the House majority in 2022, many lawmakers who objected to the presidential election results are poised to ascend to important committee chairs or leadership positions — making them even more important to legislative battles over issues such as antitrust reform and corporate taxation.",
    "Sean Smith, a General Electric spokesperson, said that it would “respect that our employees’ personal decisions on donations are their own.” Dow said that it would not dictate the personal political contributions or ideology of its employees and that the position it took in Jan. 2021 only applied to Dow and its PAC.",
    "Insurance company Allstate swore off giving to those Republicans soon after the Jan. 6 riots, saying the lawmakers’ actions “did not align with the committee’s commitment to bipartisanship, collaboration and compromise.” But Allstate lobbyists gave more to objectors than any other company reviewed by POLITICO.",
    "One industry in particular stood out: Lobbyists with all the big tech companies — Google, Facebook’s parent company Meta, Microsoft and Amazon — doled out more than $16,000 in donations to 11 of the 147 Republican members, even as they publicly maintained their corporate ban on giving to them.",
    "The under-the-radar donations meant that even as the companies stuck to their Jan. 6 pledges, their lobbyists ingratiated themselves with the GOP lawmakers, some of whom are expected to take leadership roles in the House if Republicans take back control in the midterm elections.",
    "Allstate’s director of public affairs and public policy Saat Alety, a former staffer for Sen. Tim Scott (R-S.C.), gave to mostly rank-and-file GOP members who voted against certification, including $2,900 to Rep. Ted Budd (R-N.C.) and $500 to Rep. Lance Gooden (R-Texas).",
    "Meta’s vice president of U.S. federal public policy, Greg Maurer, gave a total of $3,250 to election objectors at the end of 2021, including a $2,500 donation to Scalise, who would likely be a part of GOP leadership if Republicans win during the next election cycle.",
    "Throughout 2021, in-house government affairs staffers for at least 13 companies gave personal donations to Republicans who objected to the presidential election results, according to a POLITICO review of campaign finance filings from the Federal Election Commission.",
    "In the case of Amazon, three lobbyists donated to at least four election objectors, amid a tumultuous debate over antitrust reform that could force Amazon to significantly change the way it interacts with retailers on its platform.",
    "Intel made the list with one lobbyist who made a $5 donation through GOP fundraising apparatus WinRed, and spokesperson Nancy Sanchez said the company’s employees were free to make individual contributions to any candidates.",
    "Colleen Litkenhaus, another Dow lobbyist, contributed $500 to Rep. Tom Rice (R-S.C.), who later said he regretted his Jan. 6 vote against certifying the election and voted to impeach former President Donald Trump.",
    "“If a company is serious about not giving a campaign contribution to insurrectionists, then they can’t allow people who are in senior executive positions who represent the company to make those same contributions.",
    "And that would include the CEO as well as the lobbyists of the company.”\nMost of the 13 companies either did not offer a comment on their employees’ donations or declined to comment.",
    "More than 30 members who refused to certify the election results received donations from the lobbyists identified by POLITICO, most prominently members of the House GOP leadership.",
    "took in a total of $5,500 from these lobbyists through his campaign and leadership PACs, and House Majority Leader Kevin McCarthy (Calif.) collected $3,500 into his accounts.",
    "A POLITICO analysis identified 60 corporate and trade association PACs that made such promises; 15 ended up reversing and donating to the objectors or their leadership PACs.",
    "Fred Humphries, who has been at Microsoft for more than two decades, donated to two election objectors: $2,500 to McCarthy and $1,000 to Jordan’s Buckeye Victory Fund.",
    "Lobbyists for Microsoft gave more to the so-called “insurrectionists” than any of the other major tech companies, according to the campaign finance filings for 2021.",
    "Lobbyists for Microsoft gave more to the so-called “insurrectionists” than any of the other major tech companies, according to the campaign finance filings for 2021.",
    "A few checks from corporate lobbyists began to flow to the election objectors in March, with the number of donations steadily increasing in April, May and June.",
    "Amazon lobbyists were hardly alone in sidestepping company bans on giving to Republicans who voted against certifying President Joe Biden’s victory on Jan. 6.",
    "Sam Lancaster, a key GOP lobbyist for Comcast who spent 19 years working for former Speaker Dennis Hastert (R-Ill.), gave $1,000 to Rep. Billy Long (R-Mo.",
    "The big tech companies were the largest group, highlighting Silicon Valley’s balancing act as it faces increasing scrutiny from both sides of the aisle.",
    "Kevin Kolevar, Dow’s vice president of global government affairs at Dow and a Bush administration alum, donated $500 to Sen. John Kennedy (R-La.).",
    "“The reality is the contribution from the lobbyist is just as important in terms of the Washington access and influence-buying game,” she said.",
    "“We respect our colleagues’ freedom of choice to participate in the political process in a manner that they see fit,” Dow said in a statement.",
    "POLITICO identified more than $28,000 in donations from lobbyists to lawmakers who voted against certifying the 2020 presidential election.",
    "“It clearly is a workaround,” said Craig Holman, a government ethics expert at progressive consumer rights advocacy group Public Citizen.",
    "Holman of Public Citizen said the donations still help corporations get close with lawmakers’ offices, even if they are relatively small.",
    "Lawmakers debated Biden’s Build Back Better plan, which included a number of provisions heavily opposed by corporate interests.",
    "Campaign finance expert Meredith McGehee argues donations from lobbyists are effectively the same as those from company PACs.",
    "If Republicans take back the House in 2022, Jordan is set to become the chair of the powerful House Judiciary Committee.",
    "Those who did emphasized that the money was given in the employee’s capacity as an individual, using their own money.",
    "Unlike many of the companies, Toyota did not commit to stopping its PAC contributions to those members until July 8.",
    "Advocates called out companies by name who reneged on pledges to stop or pause campaign contributions to objectors.",
    "But Google lobbyist Andrew Ladner gave $1,000 to Scalise and $500 to Oklahoma Republican Rep. Markwayne Mullin.",
    "The remaining two companies — AmerisourceBergen and Cozen O’Connor — did not respond to requests for comment.",
    "In June, he also gave $250 to Rep. Debbie Lesko (R-Ariz.), a leader on the powerful GOP Steering Committee.",
    "That included $1,000 to McCarthy and $500 to Ohio Republican Rep. Jim Jordan’s joint fundraising committee.",
    "The majority of companies, however, have stuck by their pledge thus far, at least for direct donations.",
    "More than a dozen companies that originally banned donations to these members have changed tack since.",
    "That includes lobbyists for Microsoft, Google, Meta, Allstate, Toyota, Nike and Dow Chemical Company.",
    "Filings show that a lobbyist for Allstate donated to 15 election objectors, giving a total of $7,900.",
    "The company reiterated its pledge to not give to the Jan. 6 dissenters at the beginning of 2022.",
    "Lobbyists for Silicon Valley giants weren’t the only ones giving to the GOP election objectors.",
    "Of all of the tech companies, Google had the fewest number of lobbyists giving such donations.",
    "Still, an in-house lobbyist gave $250 to Rep. Jack Bergman (R-Mich.) less than a month later.",
    "Microsoft lobbyist Allison Halataei also gave $1,000 to Utah Republican Rep. Chris Stewart.",
    "McCarthy and Jordan are among the most high-profile GOP critics of “Big Tech” in Congress.",
    "), and $1,000 to Scalise, while a lobbyist for Nike gave $250 to Rep. Ben Cline (R-Va.).",
    "But public pressure for companies to maintain their donation bans remained intense.",
    "Still, a lobbyist’s job is to serve as a company’s emissary in Washington.",
    "In September, the same lobbyist gave $250 to Rep. David Kustoff (R-Tenn.).",
    "Before that, Meta lobbyist Christopher Herndon gave $1,000 to Scalise.",
    "And for many companies, that has made the blowback worthwhile.",
    "Comcast and Nike did not respond to requests for comment.",
    "“It’s a symbolic gesture of support to an officeholder.”",
    "Meta, Google, Amazon and Microsoft declined to comment.",
    "Allstate did not respond to a request for comment.",
    "“Two hundred dollars matters a lot,” Holman said.",
    "Toyota did not return a request for comment.",
    "House Republican Whip Steve Scalise (La.)",
    "), $500 to Rep. Greg Pence (R-Ind."
  ]
}