{
  "id": 1360,
  "mediaId": 2644,
  "date": "2022-02-16",
  "headline": "Hillary Clinton finally breaks silence, calls John Durham claims ‘fake scandal’",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/hill-comp.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/16/hillary-clinton-calls-durham-claims-fake-scandal/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Moore",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Durham filed court papers Friday in which he alleged that a Clinton campaign lawyer enlisted a tech executive to help “mine” internet data from locations including Trump Tower and the White House “to establish ‘an inference’ and ‘narrative’ tying then-candidate Trump to Russia.”\nThe documents filed by Durham, who was appointed special counsel by then-Attorney General William Barr in May 2019, have ignited a firestorm of criticism against the Clinton campaign and led to calls for a closer look at the FBI’s handling of the Russia probe, which was code-named “Crossfire Hurricane.”\nTrump himself, who described the accusations as “bigger than Watergate,” called on the Justice Department Tuesday to declassify and release all of the remaining documents related to the claims that his campaign colluded with Russia.",
    "According to them, any information Sussmann handed over dated from before Trump entered the White House and Durham “conveniently overlooks the fact that Mr. Sussmann’s meeting with Agency-2 happened well after the 2016 presidential election, at a time when the Clinton Campaign had effectively ceased to exist.”\nBut Rep. Jim Jordan (R-Ohio), the top Republican on the House Judiciary Committee, said over the weekend that the latest filing proves Trump’s claim that “there was spying going on.”\n“It was worse than we thought because they were spying on the sitting president of the United States,” Jordan told “Fox & Friends” on Sunday.",
    "The defense team on Monday accused Durham of injecting “prejudicial — and false — allegations that are irrelevant to his Motion and to the charged offense.” Sussmann’s lawyers added that the special counsel’s claims were “plainly intended to politicize this case, inflame media coverage, and taint the jury pool” and also took issue with the inference that digital surveillance by the Clinton team continued after Trump was inaugurated in 2017.",
    "“For those interested in reality, here’s a good debunking of their latest nonsense,” she concluded the post, attaching a link to a Vanity Fair article titled: “You’ll never believe it but Hillary Clinton did not, in fact, spy on Trump’s White House.”\nClinton broke her silence one day after she ignored questions from The Post about Durham’s claims after she and her daughter, Chelsea, were at a Queens restaurant.",
    "“Democrats and legacy media may want to sweep this alarming report under the rug, but if House Republicans earn the majority, we will use our oversight tools to determine whether federal funds were used, whether federal office-holders abused their power, and investigate other disturbing elements of this spying scheme to ensure nothing like it ever happens again,” he added.",
    "Durham alleged in his filing Friday that Michael Sussmann, a Clinton campaign lawyer, “assembled and conveyed” spurious claims about the Trump Organization and Moscow-based Alfa-Bank “to the FBI on behalf of at least two specific clients, including … the Clinton campaign.”\nSussmann has been charged with lying to a federal agent, and pleaded not guilty in September.",
    "The former first lady, senator, secretary of state and two-time Democratic presidential candidate finally responded Wednesday to last week’s court filing by special counsel John Durham alleging that her 2016 presidential campaign paid for computer research to link then-candidate Donald Trump to Russia.",
    "According to Durham, Sussmann told then-FBI general counsel James Baker in September 2016 that he was not working on behalf of the Clinton campaign when he handed over documents purportedly detailing a supposed link between the Trump Organization and Alfa-Bank.",
    "Rep. Kevin McCarthy (R-Calif.), the House minority leader, vowed on the same day to pursue Durham’s findings if Republicans gain control of the House after this fall’s midterm elections.",
    "“Special Counsel John Durham’s continued investigation into the Russia hoax is essential to getting to the truth and protecting our democracy,” McCarthy said in a statement to The Post.",
    "Two Republican senators — Ron Johnson of Wisconsin and Chuck Grassley of Iowa — also asked the Justice Department Tuesday to declassify all outstanding Russia probe records.",
    "And they should declassify, absolutely, especially in the light of what has just happened and what has just been revealed,” the 45th president told Fox News.",
    "Sussmann then approached a second agency, believed to be the CIA, in February 2017 to hand over an “updated set of allegations” about the bank.",
    "“Trump & Fox are desperately spinning up a fake scandal to distract from his real ones,” Clinton said on Twitter.",
    "The more his misdeeds are exposed, the more they lie.",
    "If anyone knows scandals, it’s Hillary Clinton.",
    "“And it goes right to the Clinton campaign.",
    "“They have the declassification order.",
    "“So it’s a day that ends in Y.",
    "So God bless John Durham.”"
  ]
}