{
  "id": 1382,
  "mediaId": 2553,
  "date": "2022-02-14",
  "headline": "UH-OH: Whopping Percentage Of Dem Voters Want Hillary Investigated For Russiagate Scandal",
  "image": "https://dw-wp-production.imgix.net/2022/02/Hillary.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/uh-oh-whopping-percentage-of-dem-voters-want-hillary-investigated-for-russiagate-scandal",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hank Berrien",
  "authorUrl": "https://www.dailywire.com/author/hank-berrien",
  "termIds": [
    0
  ],
  "sentences": [
    "The Post reported that “91 percent of Republicans in the same group and 65 percent of Independents also called for Clinton to specifically be investigated,” adding, “76 percent of Americans want Attorney General Merrick Garland’s counsel Maggie Goodlander to recuse herself from the Durham probe because of a potential personal conflict posed by her husband, White House National Security Adviser Jake Sullivan, who is cited in the Sussmann indictment.”\nThe Daily Wire reported on Monday that Durham’s filing stated:\nIn connection with these efforts, Tech Executive-1 exploited his access to non-public and/or proprietary Internet data.",
    "Last month, even before the new findings from Special Counsel John Durham’s investigation found that operatives linked to Hillary Clinton’s failed presidential campaign “exploited” Internet data linked to Trump Tower and the Executive Office of the President in an effort to establish a “narrative” tying President Donald Trump to Russia, the TechnoMetrica Institute of Policy and Politics (TIPP) poll asked over 1,300 Americans whether they thought Hillary Clinton should be investigated for her role in the affair.",
    "This is so wrong and allegations of such ?a ?level of illegal activity that goes directly to our faith in our own government that the truth must be found?.” He opined that former CIA Director John Brennan, former Director of National Intelligence James Clapper and former FBI Director James Comey could all possibly be implicated in Durham’s probe.",
    "Rep. Jim Jordan (R-OH) told Fox & Friends after the bombshell revelations of the Durham investigation, “Yep, there was spying going on, and it was worse than we thought because they were spying on the sitting ?p?resident of the United States.",
    "Tech Executive-1 also enlisted the assistance of researchers at a U.S.-based university who were receiving and analyzing large amounts of Internet data in connection with a pending federal government cybersecurity research contract.",
    "The filing used the word “exploited.”\nA whopping percentage of Democrats say they want prosecutors to investigate Hillary Clinton for her role in the Russiagate scandal, according to a new poll.",
    "Correction: A previous version of this article, based on an incorrect report, stated that Special Counsel John Durham used the word “infiltrate” to describe the actions.",
    "In doing so, Tech Executive-1 indicated that he was seeking to please certain “VIPs,” referring to individuals at Law Firm-1 and the Clinton campaign.",
    "… Tech Executive-1 tasked these researchers to mine Internet data to establish “an inference” and “narrative” tying then-candidate Trump to Russia.",
    "A shocking 66% of Democrats who stated they had been watching the case said they wanted Hillary Clinton investigated, the New York Post reported.",
    "(R-OH) told Fox News’ “Sunday Morning Futures,” “It doesn’t matter really which political campaign this is or which political party this is.",
    "The same poll found in October that the percentage of Democrats who agreed that Hillary should be investigated was 20 points lower.",
    "The Daily Wire is building an alternative to the leftist entertainment industry, one gripping movie at a time.",
    "The Daily Wire’s first original film, Shut In, has made its cinematic debut, being met with rave reviews.",
    "The only thing we didn’t understand was it was worse than we thought?.”\nRep. Michael Turner ?",
    "Join us in this mission and stream Shut In today by becoming a Daily Wire member.",
    "But we’re getting to ?now what we all suspected.",
    "And it goes right to the Clinton campaign.",
    "?His investigation is taking a long time.",
    "So God bless John D?urham?."
  ]
}