{
  "id": 1400,
  "mediaId": 2659,
  "date": "2022-02-14",
  "headline": "Jim Jordan Says Trump’s Call for Clinton Campaign Executions is “Right on Target”",
  "image": "https://www.politicususa.com/wp-content/uploads/2019/09/2019-09-26T231301Z_1_LYNXMPEF8P25U_RTROPTP_4_USA-COURTS-SECRECY-CONGRESS.jpg",
  "link": "https://www.politicususa.com/2022/02/14/jim-jordan-says-trumps-call-for-clinton-campaign-executions-is-right-on-target.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alan Ryland",
  "authorUrl": "",
  "termIds": [
    5676,
    2119,
    2765,
    3054,
    1477
  ],
  "sentences": [
    "“In doing so, Tech Executive-1 indicated that he was seeking to please certain ‘VIPs,’ referring to individuals at Law Firm-1 and the Clinton campaign.”\nTrump later responded to the news with a statement saying that the filing “provides indisputable evidence” that the Clinton campaign and its operatives spied on him “in an effort to develop a completely fabricated connection to Russia.”\n“In a stronger period of time in our country, this crime would have been punishable by death,” Trump added.",
    "Representative Jim Jordan (R-Ohio) said that former President Donald Trump’s call for the executions of those who worked on Hillary Clinton’s 2016 presidential campaign is “right on target.”\n“We’ve never seen anything like this in history,” Jordan told the hosts of “Fox and Friends.” “So, President Trump’s statement yesterday, I think is right on target.",
    "This is truly unprecedented, truly something that has never happened in the history of our great country.”\nJordan’s statement referred to a recent filing by Justice Department special counsel John Durham claiming that the Clinton campaign had paid a tech company to hack into Trump Tower servers to look for links between Trump and Russia.",
    "Jordan has since appeared on Fox News to amplify the news of the filing, saying that it proves that Clinton and her operatives are guilty of spying on a President of the United States.",
    "“Tech Executive-1 tasked these researchers to mine Internet data to establish ‘an inference’ and ‘narrative’ tying then-candidate Trump to Russia,” Durham states, according to Fox."
  ]
}