{
  "id": 1413,
  "mediaId": 2663,
  "date": "2022-02-17",
  "headline": "Lou Dobbs may want to stay off Twitter today",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/02/lou-dobbs.png?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/lou-dobbs-may-want-stay-off-twitter-today-20220217",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Tracer",
  "authorUrl": "https://www.queerty.com/author/dan-tracer",
  "termIds": [
    2119,
    2283,
    2630,
    3514,
    4066,
    5258,
    1126,
    6480,
    6383
  ],
  "sentences": [
    "Dobbs, who was canceled by Fox 24 hours after he and the network were named in a $2.7 billion defamation lawsuit filed by voting technology company Smartmatic, said that if the GOP retakes the House majority this year, only the “brightest” conservatives like Jim Jordan and Matt Gaetz should be considered for speaker.",
    "pic.twitter.com/yKuLLtkid0\n— Ron Filipkowski (@RonFilipkowski) February 17, 2022\nRelated: Jim Jordan is having a craptastic birthday\nNot only did everyone seem to agree this is the worst idea ever, but commenters also shared their feelings about Dobbs:\nLou Dobbs doesn’t know his ass from a hole in the ground!",
    "— Hold My PomPoms Bitches (@Scattered211) February 17, 2022\nWe all know Lou Dobbs is not the brightest bulb\nin the box, But him saying Jim Jordan and Matt\nGaetz are the brightest the GOP have in the\nhouse tells me that he needs serious\nmedical help.",
    "Lou Dobbs says there is no way Kevin McCarthy should be Speaker if the GOP retakes the majority, and that only the “brightest” conservatives should be considered like Jim Jordan and Matt Gaetz.",
    "https://t.co/qNpmUETjXH\n— thenicedonald (@thenicedonald1) February 17, 2022\nLou Dobbs states that Jordan and Gaetz should be considered for speaker because they are the \"brightest\".",
    "The Trump loyalist also attacked current Minority Leader Kevin McCarthy as a “RINO” (Republican in name only) who should should not be considered for speaker.",
    "Former Fox News host Lou Dobbs has offered his two cents on the future of Republican Party leadership, and the response has been less than enthusiastic.",
    "— heather (America is a stir fry, not a melting pot) (@heather_vono) February 17, 2022\nDobbs called Trump a man of action and vision.",
    "— Liberal Lisa in Oklahoma (@lisa_liberal) February 17, 2022\nLou Dobbs is just plain old evil and willfully ignorant.",
    "Lou Dobbs is just another loathsome pos who works for a propaganda network spoon-feeding lies to their viewers 24/7.",
    "Never forget when Trump was railing on Mexicans, Dobbs joined the bandwagon even though he has a Mexican wife.",
    "— Leda M (@MLedaloo) February 17, 2022\nLou Dobbs thinks that Gym Jordan and Matt Gaetz are the \"brightest\".",
    "(@lcatboonies) February 17, 2022\nLou Dobbs clearly showing symptoms\nof rancid raisins in his rice puddin'.",
    "Jim J and Matt G are at the bottom of the Republican barrel when it comes to intelligence.",
    "— Dora Glasberg (@honeydijon13) February 17, 2022\nLou Dobbs has lost his mind.",
    "Maybe Dobbs equates scandals where minors are involved as \"bright\"???",
    "If, you are in agreement with him on anything…seek professional help!",
    "Jordan w/ the OSU settlement & gaetz….well, that will play out soon.",
    "No person in their right mind would suggest such a thing.",
    "Lou Dobbs is as big a buttered doorknob as they are.",
    "They are only a notch above MTG and Lauren Boebert.",
    "— marco m (@RbgMarco) February 17, 2022",
    "— lc ?????????????"
  ]
}