{
  "id": 1422,
  "mediaId": 6598,
  "date": "2022-02-18",
  "headline": "First Thing: Trump and two eldest children must testify in fraud case",
  "image": "https://i.guim.co.uk/img/media/ea04216e2a5a14cce9890655a83de040105dcf13/0_21_1740_1044/master/1740.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=22688a0e941ac501b12dcacf2af985fe",
  "link": "https://www.theguardian.com/us-news/2022/feb/18/first-thing-trump-and-two-eldest-children-must-testify-in-case",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clea Skopeliti",
  "authorUrl": "https://www.theguardian.com/profile/clea-skopeliti",
  "termIds": [
    0
  ],
  "sentences": [
    "Stat of the day: millennials in 2019 were poorer than people of a similar age in any year from 1989 to 2007\nIn a brutal comparison revealing distorted views of wealth, the freelance journalist Laura Martin points out that while a survey in 2018 found that 53% of US millennials expected to become a millionaire at some point in their lifetime, millennials in 2019 were less wealthy than people their age in any year from 1989 to 2007.",
    "Republicans who opposed racial justice protests hope truckers ‘clog up’ US cities\nRepublicans who legislated against the disruption caused by racial justice protests following George Floyd’s murder have come out in favour of similar tactics used by conservative trucker convoys opposing public health rules.",
    "Berkeley may have to slash admissions after neighborhood group complains\nThe University of California, Berkeley may be forced to cut its new admissions by about a third after a local neighborhood group pushed back against the environmental impact of its expansion plan.",
    "Judge Arthur Engoron ordered Trump, Donald Jr and Ivanka to comply with subpoenas issued by the New York state attorney general, Letitia James, intensifying the former president’s legal woes in a week in which his accounting firm cut ties with him after a decade.",
    "Last Thing: Robert Pattinson was told to change his ‘absolutely atrocious’ Batman voice\nRobert Pattinson tried to add his personal touch to Batman by giving the character a different voice, but was asked to stop because it was “absolutely atrocious”.",
    "Responding to the ruling, he accused James’s office of “doing everything within their corrupt discretion to interfere with [his] business relationships and with the political process” and labeled the ruling a “witch-hunt”.",
    "Donald Trump and his two eldest children have been ordered by a New York judge to sit for a civil deposition in the deepening investigation over alleged fraud in the valuation of assets belonging to his family business.",
    "In the university’s environmental impact study for the new construction, it argued rising enrolment had had “no significant environmental impacts” in previous years, but a county judge disagreed in August.",
    "Save Berkeley’s Neighborhoods successfully argued the college was in breach of a major environmental law by failing to account for increases in the trash, traffic and noise that would accompany the plan.",
    "“I tried to do it for the first two weeks, and it just looked absolutely atrocious, and they told me to stop doing it.”\nSign up\nFirst Thing is delivered to thousands of inboxes every weekday.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "The accusations, coming from Ukrainian government forces and Russian-backed rebels in the country’s east, involved both sides claiming there were incidents of mortar fire on Friday.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "This rhetoric isRepublicans seizing any opportunity to attack Joe Biden – rather than being part of a “hard ideological stance”, said Jared Holt, an extremism researcher.",
    "Meanwhile, the Kentucky senator Rand Paul, who was opposed to the tactics used by racial justice protesters, has said he is “all for” the disruption caused by the convoy.",
    "But now, DeSantis has thrown his weight behind the Canadian truckers, whose protests against a vaccine mandate are causing disruptions to the global supply chain.",
    "The Florida governor, Ron DeSantis, last year signed an anti-rioting law that included giving a degree of legal protection to drivers who ran over protesters.",
    "Get in touch\nIf you have any questions or comments about any of our newsletters please email newsletters@theguardian.com\n… we have a small favour to ask.",
    "The university will send out 5,100 fewer admission letters than planned next month, missing out on $57m in tuition fees over the 2022-23 academic year.",
    "The case is running parallel to a criminal investigation, conducted by James with the Manhattan district attorney Alvin Bragg, into Trump accounts.",
    "“Everyone does this kind of gruff, gravelly thing, and I’m like, ‘I’m going to do the opposite, I’m gonna go really whispery’,” Pattinson said.",
    "A court in India has sentenced 38 people to death for a series of bombings in 2008 that killed 56 and wounded 200 in Ahmedabad, Gujarat state.",
    "Additionally, Trump has previously mocked the practice, saying: “If you’re innocent, why are you taking the fifth amendment?”\nWhat’s next?",
    "Procrastination meant that tasks that would take him a few hours in the office ended up seeping into his early mornings and evenings.",
    "In other news …\nUkraine and Russia have accused each other of shelling and other ceasefire violations as tensions continued to grow.",
    "Ted Cruz has demanded an investigation into GoFundMe after it deleted the page for donations to Canadian truckers, as did DeSantis.",
    "So he started using Focusmate, a site that uses accountability to keep you working on the task at hand, which he says “saved” him.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Save Berkeley’s Neighborhoods also argued that a lack of housing had meant students had pushed into the city, affecting housing.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "They argue the California Environmental Quality Act is being used as a pretext to block necessary housing and infrastructure.",
    "It would be tricky: his criminal defense lawyer says it would be front-page news and would make it impossible to pick a jury.",
    "When the pandemic hit and remote working began, freelance writer Sam Wolfson was hit with a productivity crisis.",
    "Almost half of bald eagles tested across the US exhibit signs of chronic lead exposure, according to a study.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "Trump must testify within 21 days and submit “documents and information” within a fortnight.",
    "Trump is likely to appeal against the decision ordering him to comply with the subpoena.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "Harmful levels of toxic lead were found in the bones of 46% of bald eagles in 38 states.",
    "It is the first time so many death sentences have been handed out in a single case.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "A federal judge struck down the law in September, ruling it unconstitutional.",
    "Wolfson speaks to the site’s creator about the psychology behind it.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "The university is asking California’s supreme court to intervene.",
    "Don’t miss this: is this the answer to our productivity crisis?",
    "The Ohio congressman Jim Jordan also criticized the platform.",
    "Testifying could risk Trump potentially implicating himself.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "If there were ever a time to join us, it is now.",
    "If you’re not already signed up, subscribe now.",
    "How should the double standard be understood?",
    "“I hope the truckers do come to America.",
    "I hope they clog up cities,” he said.",
    "What has the challenge achieved?",
    "Who else has backed the convoy?",
    "Could Trump plead the fifth?",
    "What do critics say?",
    "Good morning.",
    "Thank you.",
    "?"
  ]
}