{
  "id": 1456,
  "mediaId": 2548,
  "date": "2022-02-14",
  "headline": "Sen. Rubio: Durham Report May Be ‘One Of The Greatest Political Scandals In American History’",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/02/IMG-6070-e1644898847888.jpg",
  "link": "https://dailycaller.com/2022/02/14/sen-rubio-durham-report-greatest-political-scandals-american-history/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Silverio",
  "authorUrl": "https://dailycaller.com/author/nicole.dcnf@gmail.com",
  "termIds": [
    0
  ],
  "sentences": [
    "Republican Florida Sen. Marco Rubio called the report that revealed new allegations surrounding the Clinton campaign and its spying on former President Donald Trump “one of the greatest political scandals in American history.”\nAccording to the report from Special Counsel John Durham, Clinton campaign lawyer Michael Sussmann worked alongside tech executive Rodney Joffe, who used proprietary data to “establish ‘an inference’ and ‘narrative’ tying then-candidate Trump to Russia,” according to the filing.",
    "“What we’re talking about here is not simply the probe using data scientists to make up a story or links between Trump and Russia, but the White House.”\n“Apparently there was a private company that had a contract to manage servers for the President of the United States and the White House and they were sharing information to help build a narrative for a political operation.",
    "“I’ve seen books with things in there that I know were not true and they’re widely reported as established facts.”\nThe senator said that he does not believe “it is a crime” to have the documents stored and if the process was not handled, then “something needs to be done.” He also expressed skepticism to the allegations of Trump flushing documents down the toilet.",
    "(RELATED: ‘As Wrong As It Gets’: Rep. Jim Jordan Calls Out Liberal Media And Democrats For Denying That Trump Was Spied On)\nBaier cited Trump’s handling of documents, including the fifteen boxes in Mar-a-Lago, and the accusations of flushing papers down the toilet.",
    "So it’s hard to tell anymore what really happened and what didn’t.”\n“I’ve seen at least a dozen things said about Trump that turned out to be complete lies, somebody can just make it up and some of the media just run with it as if it’s true,” he continued.",
    "The filing revealed that Durham believes the Clinton campaign paid to have access to that data associated with Trump Tower, Trump’s New York apartment, and the Executive Office of the President.",
    "They think they can get away with it because the media will not report on it.”\nThe Florida senator said if the political affiliations were swapped, the media would cover the report extensively.",
    "“I don’t know what’s true or not because they’ve made up so many stories about Donald Trump over the years that things that I know are just flat out untrue,” the senator said.",
    "It’s shocking to me that this is not receiving more coverage in the press, I don’t think any of the Sunday shows covered it,” Rubio told Fox News’ Bret Baier Monday.",
    "Rubio responded that it “is difficult to believe” the stories reported on Trump due to the media’s tendency to publish reports about the former president.",
    "Journalist Maggie Haberman alleged in her new book, “Confidence Man,” that White House staff periodically found wads of printed paper in the toilets.",
    "The documents included correspondence with North Korean Dictator Kim Jung Un and a note from former President Barack Obama.",
    "Officials from the National Archives recently had to travel to Mar-a-Lago to retrieve documents from the former president.",
    "“But nowadays in mainstream media, you just need one source to smear Donald Trump or maybe you don’t even need that.",
    "It would be a crime, no doubt about it and it would tell you why these people think they can get away with it.",
    "If this is all proven true, it would be one of the greatest political scandals in American history.",
    "Trump has denied the allegations.",
    "“This is a big deal."
  ]
}