{
  "id": 150,
  "mediaId": 2672,
  "date": "2022-02-24",
  "headline": "These Are the American Right-Wingers Covering for Putin as Russia Invades Ukraine",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/02/right-wing-cheering-putin-2.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/these-are-the-american-right-wingers-covering-for-putin-as-russia-invades-ukraine-1311965/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Dickinson",
  "authorUrl": "https://www.rollingstone.com/author/tim-dickinson/",
  "termIds": [
    2119,
    2080,
    1708,
    2969,
    4591,
    5292,
    6672,
    6569,
    6678,
    6286
  ],
  "sentences": [
    "Vance added: “I gotta be honest I don’t really care what happens to Ukraine one way or another.”\n“I gotta be honest with you, I don’t really care what happens to Ukraine…I do care about the fact that in my community right now the leading cause of death among 18-45 year olds is Mexican fentanyl that’s coming across the southern border.” – @JDVance1 #OHSen pic.twitter.com/nf6MUzdWM5\n— JD Vance for U.S. Senate Press (@JDVancePress) February 19, 2022\nAlex Jones\nThe conspiracy theorist and Infowars host Alex Jones seems to have the same talking points as Vance when it comes to Russia and transgender politics, but he adds a demented George Soros topspin.",
    "“The West is starting the fight.” Jones added that Russian relationship with Ukraine is “like your big brother…comes in and beats you up on a routine basis.” But Jones normalized the attacks by saying of Russia ”it’s not the Huns,” while insisting that Ukraine would be better off — when the alternative is “George Soros that’s going to cut your son’s balls off, OK?” He added: “So you can have the Russians in there or you can have George Soros literally going after your children.",
    "When Putin attacked the sovereign state of Ukraine on Wednesday night, Gabbard did not denounce Putin’s aggression, instead faulting the West for not meeting the Russian autocrat’s demands:\nThis war and suffering could have easily been avoided if Biden Admin/NATO had simply acknowledged Russia’s legitimate security concerns regarding Ukraine’s becoming a member of NATO, which would mean US/NATO forces right on Russia’s border\n— Tulsi Gabbard ??",
    "But only a few days later, during a segment with Rep. Jim Jordan, Tucker voiced the same sentiment more clearly: “I think we should probably take the side of Russia,” he said, “if we have to choose between Russia and Ukraine.”\nDespite saying that he was \"just kidding\" about rooting for Russia over Ukraine, Tucker just doubled down on supporting the Russians in the conflict.",
    "Jones’ rhetoric is a bit hard to decode, but he seems to think Soros is promoting a liberal agenda around transgender rights in Eastern Europe, which in Jones short-hands as Soros seeking “to cut your son’s balls off.”\nOn Valentine’s day, Jones tried to deconstruct the geopolitics behind the Russia/Ukraine conflict, characterizing the West as the aggressor toward Russia.",
    "He insisted in an interview that he and his buddies “did not serve in the Marine Corps to go and fight Vladimir Putin because he didn’t believe in transgender rights, which is what the U.S. State Department is saying is a major problem with Russia.” (This is not the major problem with Russia, a state in which Putin’s regime poisons its opposition leaders.)",
    "Who’s the major player in world affairs?… Why wouldn’t we be on Russia’s side?”\nBy December Carlson was insisting that Putin had good intentions in his clash with the West: “He just wants to keep his Western borders secure.” In January, Carlson asked, “Why is it disloyal to side with Russia but loyal to side with Ukraine?",
    "Kind of strange.”\nIn recent days, Tucker spouted off on long monologues bashing “permanent Washington” for its supposedly irrational hate for Putin and affection for Ukraine, which he insisted was not a democracy but a “tyranny.” Hours before Russia’s invasion he doubled down: “Ukraine isn’t a democracy,” Carlson tweeted.",
    "Vance\nWhere Carlson boldly backs Putin’s thuggery, others on the right scoff a the notion that Americans should care a lick about Ukraine, often casting the Moscow/Kyiv conflict in terms of America’s own culture wars, suggesting Russia shares the values of the right while Ukraine has the taint of wokeness.",
    "Beginning last year Gabbard began hyping the risk of nuclear war as reason not to provide backing to Ukraine: “Are we prepared to see our loved ones burn alive in a nuclear holocaust in a war with Russia over Ukraine?,” she asked on Carlson’s show last April.",
    "Later in 2019 he insisted, “The only purpose of [U.S.] aid to the government of Ukraine is to antagonize Russia.” Last November, he asked a GOP congressman: “Why would we take Ukraine’s side and not Russia’s side?",
    "“It’s a State Department client state.” (In the same show, Carlson attempted a bit of damage control: “Nobody on this show is rooting for Putin — or rooting for Ukrainians for that matter!” he said.",
    "Vance — the shameless, Yale-Law-educated, faux-populist-turned-nativist GOP senate candidate from Ohio — recently blamed transgender advocacy for being at the root of of America’s anger at Russia.",
    "That’s where we are right now.”\nThe onetime Democratic presidential candidate turned CPAC “Reagan Dinner” special guest Tulsi Gabbard is well known for her anti-interventionist politics.",
    "pic.twitter.com/BmaXHMWTFR\n— nikki mccann ramírez (@NikkiMcR) December 3, 2019\nCarlson’s public relations push on Putin’s behalf has been so fawning as to make an RT anchor blush.",
    "But the democracy watchdog Freedom House gives Ukraine a global freedom score of 60 “partly free” compared to Russia’s 20 “not free.” (The U.S. scores an 83 “free,” for context.)",
    "Like many young republics it struggles with corruption and its elected officials often don’t behave in ways that would make France or Germany proud.",
    "As Vladimir Putin ramps up his military offensive against Ukraine, not everyone is upset that the Russian bear is mauling its European neighbor.",
    "But Gabbard’s pacifism has long been tainted by an undercurrent of affection for strongmen like Bashar al Assad and Vladimir Putin.",
    "Which, by the way, I am.”\nAs the end of that same show Carlson claimed he was “joking” (and was truly “only rooting for America”).",
    "Gabbard insists that the “warmongers” are lying that Ukraine is a democracy at all, and thereby not worthy of protection.",
    "Now Gabbard is playing up Ukraine’s messy politics as reasons the West should let Putin have his way with the country.",
    "Vance and CPAC star Tulsi Gabbard, have been cheering Putin on, broadcasting their disdain for Ukraine — or both.",
    "Across the American right, prominent figures from Tucker Carlson and Alex Jones to senate candidate J.D.",
    "“Why do I care what is going on in the conflict between Ukraine and Russia?” Carlson asked of a guest.",
    "As far back as 2019, Carlson said out loud that he was for Moscow in its clash with Kyiv.",
    "They’re both foreign countries that don’t care anything about the United States.",
    "Fox News host Carlson has long toasted to Ukraine’s ill health.",
    "“The West is pumping the weapons in,” he said.",
    "To be clear, Ukraine is not beyond reproach.",
    "“Always rooting for peace, for real.”\nJ.D.",
    "“Why shouldn’t I root for Russia?",
    "(@TulsiGabbard) February 24, 2022",
    "Who’s got the energy reserves?",
    "Why?!",
    "J.D."
  ]
}