{
  "id": 15705,
  "mediaId": 8276,
  "date": "2022-03-08",
  "headline": "Here's how area members of Congress voted",
  "image": "https://www.gannett-cdn.com/presto/2021/10/26/NPRJ/110bf9a4-66dc-48d1-ba8b-1e29623d6ae9-OPED-VOTING-FILIBUSTER-EDITORIAL-LA.jpg?crop=5999,3375,x0,y305&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/03/08/votes-cast-area-members-congress-feb-25-march-3-jim-jordan-bob-gibbs-sherrod-brown-rob-portman/9378263002/",
  "mediaOutlet": "bucyrustelegraphforum.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Targeted News Service\nWASHINGTON — Here's a look at how area members of Congress voted Feb. 25 through March 3:\nHouse\nHouse Vote 1:\nWORLD WAR II MEDAL: The House has passed the Six Triple Eight Congressional Gold Medal Act (S. 321), sponsored by Sen. Jerry Moran, R-Kan., to award a Congressional Gold Medal in honor of women in the 6888th Central Postal Directory Battalion in Europe during World War II.",
    "A supporter, Rep. Ed Perlmutter, D-Colo., said: \"As the largest contingent of African-American women to serve overseas during World War II, the Six Triple Eight demonstrated successfully that African-American women could and should be included in the ranks of the military.\"",
    "An opponent, Rep. Jim Jordan, R-Ohio, said the bill was unnecessary because \"under current law, if a person's hairstyle or hair texture is associated with a person's race or national origin and is used as a pretext for discrimination, that conduct is unlawful.\"",
    "An opponent, Rep, Mariannette Miller-Meeks, R-Iowa, said the bill lacked scientific criteria for determining whether a veteran's medical problem derived from exposure to toxins and claimed it would overwhelm the VA with more than a million disability claims.",
    "Marshall said of the requirement: \"Not only is it coercive and unconstitutional, the mandate does not take into account the fact that natural immunity is as effective as the vaccines and that vaccines do not prevent transmission of the Omicron variant.\"",
    "Marshall said efforts by the Biden administration to sustain the emergency declaration were \"a blatant effort to further extend the massive accumulation of power that the federal government has extended across America for the last two years.\"",
    "A resolution opponent, Senate Majority Leader Chuck Schumer, D-N.Y., said it would \"handicap the Biden administration's ability to fight the pandemic and heighten the danger that all our progress is suddenly unraveled in the future.\"",
    "32), sponsored by Sen. Roger Marshall, R-Kan., to disapprove of and void the Centers for Medicare and Medicaid Services rule requiring COVID vaccination of staff at health care facilities doing business with Medicare and Medicaid.",
    "956), sponsored by Rep. Gregory W. Meeks, D-N.Y., calling for Russia to withdraw its soldiers from Ukraine, supporting sanctions against Russia's government, and urging that the U.S. and its allies send military aid to Ukraine.",
    "3967), sponsored by Rep. Mark Takano, D-Calif., to require the Department of Veterans Affairs to take measures to increase detection of and treatment for veterans' potential toxins exposures while enlisted.",
    "Watson Coleman said: \"Far too often, black people, especially black women and girls, are derided or deemed unprofessional simply because their hair does not conform to white beauty standards.\"",
    "2116), sponsored by Rep. Bonnie Coleman Watson, D-N.J., to prohibit discrimination in the federal government based on a hair texture or hairstyle that is tied to ethnicity or race.",
    "YEAS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nHouse Vote 3:\nHAIRSTYLES: The House has passed the Creating a Respectful and Open World for Natural Hair Act (H.R.",
    "YEAS: Bob Gibbs R-OH (7th), Troy Balderson R-OH (12th), Jim Jordan R-OH (4th)\nHouse Vote 2:\nLYNCHINGS AND HATE CRIMES: The House has passed the Emmett Till Antilynching Act (H.R.",
    "YEAS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nHouse Vote 5:\nVETERANS AND TOXINS EXPOSURES: The House has passed the Honoring Our PACT Act (H.R.",
    "38), sponsored by Sen. Roger Marshall, R-Kan., that would end the national emergency declared by President Trump on March 13, 2020, in response to COVID.",
    "NAYS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nSenate\nSenate Vote 1:\nCOVID VACCINATION: The Senate has passed a resolution (S.J.",
    "NAYS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nHouse Vote 4:\nUKRAINE-RUSSIA WAR: The House has passed a resolution (H. Res.",
    "55), sponsored by Rep. Bobby L. Rush, D-Ill., to deem acts that involve lynching to be hate crimes, with associated criminal penalties.",
    "Takano said: \"This bill addresses the true cost of war, and opposing it would be a vote against our servicemembers and veterans.\"",
    "NAYS: Sherrod Brown D-OH\nYEAS: Rob Portman R-OH\nSenate Vote 2:\nCOVID EMERGENCY: The Senate has passed a resolution (S.J.",
    "An opponent, Sen. Ron Wyden, D-Ore., said: \"Vaccine requirements aren't anything new for healthcare workers.",
    "Meeks called the resolution \"a very strong message, a unified message, to support the people of Ukraine.\"",
    "A supporter, Rep. Jim Jordan, R-Ohio, said: \"Lynching is an especially horrible act of violence.",
    "Flu shot requirements have been common for a long time.\"",
    "The vote, on Feb. 28, was unanimous with 422 yeas.",
    "The vote, on March 3, was 256 yeas to 174 nays.",
    "The vote, on Feb. 28, was 235 yeas to 188 nays.",
    "The vote, on Feb. 28, was 422 yeas to 3 nays.",
    "The vote, on March 2, was 426 yeas to 3 nays.",
    "The vote, on March 2, was 49 yeas to 44 nays.",
    "The vote, on March 3, was 48 yeas to 47 nays.",
    "It was and is as wrong as wrong can be.\"",
    "NAYS: Brown D-OH\nYEAS: Portman R-OH",
    "Res.",
    "Res."
  ]
}