{
  "id": 1644,
  "mediaId": 8369,
  "date": "2022-02-16",
  "headline": "Nightmare Scenario for the 2022 Congressional Elections?",
  "image": "https://www.unz.com/wp-content/uploads/2022/02/BoydCatheyVoteFraud.png",
  "link": "https://www.unz.com/article/nightmare-scenario-for-the-2022-congressional-elections/",
  "mediaOutlet": "Michelle Malkin ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Boyd D. Cathey",
  "authorUrl": "https://www.unz.com/author/boyd-d-cathey/",
  "termIds": [
    4905,
    3380,
    3246,
    4529,
    1126,
    392,
    514,
    1477
  ],
  "sentences": [
    "They are illegitimate, their elections tainted as minority voters in their districts were somehow denied the “equal right to vote.”\nSo what you would have is the usurpation by a rump, lame-duck congress of power, the denial of the results of the election due to phony charges of “voter suppression,” “discriminatory partisanship” and “racist gerrymandering,” and the continuation and tightening of Democratic control—the virtual triumph of authoritarianism under the guise of “saving our democracy.”\nThink it cannot happen?",
    "But then, following the election result, Speaker Nancy Pelosi and her henchmen in the US House of Representatives solemnly declare that perhaps half of the new GOP congressmen were elected based of racist voting procedures and racially gerrymandered and ultra-partisan congressional districts in their respective states which violate the 14th Amendment and various laws and court decisions guaranteeing civil rights.",
    "In North Carolina the 4 to 3 Democratically-controlled Supreme Court just threw out (February 4) proposed congressional and legislative redistricting maps confected by a Republican-majority General Assembly, using the argument that they were overly partisan and also discriminated against Democrats (minorities) by unnecessarily splitting and diluting that vote into Republican districts.",
    "A Congress consisting of mostly Radical Republicans sat early in the Capitol and aside from the delegation from Tennessee who were allowed in, the few Southern Congressmen who arrived were not seated.” In that case the question was whether those congressmen-elect had engaged in “insurrection” and sedition.",
    "Perhaps then, following on the tendentiously ideological “findings” of the January 6 Commission which will surface conveniently prior to the election, the House decides to expel some members who are already in congress (e.g.. Rep Jim Jordan) who supposedly had “contact” with the “insurrectionists”?",
    "Of course, in other “red” states Republicans may prevail and dominate the election, but the legal basis for denying newly-elected GOP congressmen in those states has been established and could well be employed by a lame-duck congress to refuse to seat those representatives.",
    "Indeed, Elias and Democrats have suggested that Congress could possibly expel sitting House Republicans for supporting or encouraging the Jan. 6 “insurrection.” Last year, several Democratic members called for penalizing dozens of current Republicans.",
    "Rep. Bill Pascrell (D-NJ) demanded the disqualification of the 120 House Republicans, including House Minority Leader Kevin McCarthy (R-Calif), for simply signing an “Friend of the Court” amicus brief in support of an election challenge from Texas.",
    "Let’s suppose that this scenario somehow becomes reality and that Republicans appear to win a majority in the congressional elections this fall (and this despite the certain efforts to rig the vote by Democrats as they did in 2020).",
    "Already across the United States Democratic-front organizations, led by former Obama Attorney General Eric Holder, have launched legal action, asserting that newly-drawn districts favoring Republicans violate the Constitution.",
    "I have mentioned this nightmare scenario to several friends who have held high government positions, and they tell me that such a play out is conceivable, given the dominance of extreme ideology in the Democratic Party.",
    "Most pundits we see on Fox News or Newsmax these days, or whom we read in the conservative “blogosphere” are confidently predicting huge Republican gains in the November 2022 congressional elections.",
    "And a Democrat-related group is challenging North Carolina Rep. Madison Cawthorn’s right to run for re-election, because he had “contact” and “encouraged” the “insurrectionists” of January 6.",
    "In the congressional elections of 1866 “most of the congressmen from the former Confederate states were either prevented from leaving the state or were arrested on the way to the capital.",
    "Based on various national and state polls showing the marked unfavorability of Biden and the Democratic Party, they exude a confidence in this outcome which approaches certainty.",
    "Of course, this assumes that the foolish GOP can actually win the November congressional elections without committing suicide, which is what they usually end up doing.",
    "It can, and it already has occurred in American history, in the immediate congressional and presidential elections following the War Between the States.",
    "This idea has been raised by general counsel to the Democratic National Committee (and former counsel to Hillary Clinton), Marc Elias, among others.",
    "Of course, there would be legal action by the Republicans, but that would also signal a constitutional crisis unlike anything since the 1860s.",
    "Would Biden, pushed by his even more extreme advisors, declare a national emergency and martial law, as Justin Trudeau has done in Canada?",
    "If they cannot manipulate the election (like they did in 2020), then what have they got to lose, especially against a spineless GOP?",
    "But the precedent was set for Congress to regulate and expel members which it felt in some way had violated the Constitution.",
    "I would add: does anyone believe that the Democrats and leftists who now control congress will give up power voluntarily?",
    "In other words, the Democratically-controlled House then refuses to seat the newly-elected GOP majority.",
    "The NC Board of Elections (controlled by Democrats) may in fact disqualify him as a candidate.",
    "All we must do is wait, they assure us, and the scoundrels will be turned out of office.",
    "Would the crazed Democrats then enact legislation adding members to the high court?",
    "And how would “moderate” Republicans like Mitch McConnell and Mitt Romney react?",
    "All of this could possibly happen with a degree of impunity."
  ]
}