{
  "id": 1689,
  "mediaId": 2512,
  "date": "2022-02-16",
  "headline": "Text messages showcase the chaos and desperation inside Trumpworld on January 6th",
  "image": "https://www.alternet.org/media-library/image.png?id=28235755&width=1200&coordinates=0%2C9%2C0%2C10&height=600",
  "link": "https://www.alternet.org/2022/02/text-messages-january-6th/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandon Gage",
  "authorUrl": "https://www.alternet.org/author/brandongage",
  "termIds": [
    2119,
    2765,
    2767,
    3246,
    3621,
    3586,
    4905,
    4557,
    514
  ],
  "sentences": [
    "That concern was shared by an unidentified member of the House Freedom Caucus, who wrote to Meadows on January 2nd that “if POTUS allows this to occur… we’re driving a stake in the heart of the federal republic.”\nThree days later, former Defense Department Inspector General Joseph Schmitz wrote to election objector Congressman Jim Jordan (R-Ohio) that “on January 6, 2021, Vice President Mike Pence, as President of the Senate, should call out all electoral votes that he believes are unconstitutional as no electoral votes at all -- in accordance with guidance from founding father Alexander Hamilton and judicial precedence.",
    "Committee member Representative Elaine Luria (D-Virginia) said the exchanges are “key to the investigation — they tie things together and there’s an immediacy to the texts,” adding, “you can tease out the facts and learn more about personal relationships.”\nFor example, Fox News host Sean Hannity – despite promoting Trump’s lie to his audience that the 2020 election was stolen – was found to be in frequent communication with then-White House Chief of Staff Mark Meadows.",
    "Meadows received additional texts from as-yet-unnamed Republican lawmakers who were trapped on Capitol Hill:\n“It’s really bad up here on the Hill.” - GOP member 1\n“Mark, he needs to stop this now.” - GOP member 2\n“TELL THEM TO GO HOME.” - GOP member 3\n“Some members sheltered in the Rotunda, where they were instructed to put on gas masks from under their seats, while others sprinted to offices where they hid in silence with frightened staff,” the Post noted.",
    "Thousands of text messages turned over to the House Select Committee to Investigate the January 6th Attack on the United States Capitol that were published on Wednesday by The Washington Post reveal that key figures inside former President Donald Trump’s orbit were thrust into a quagmire of chaos, confusion, desperation and panic before and during the deadly siege.",
    "78, ‘contrary to the Constitution, can be valid.’”\nOn the day of the attack – while hundreds of armed Trump supporters charged through the barricades and breached the halls of Congress with the objective of assassinating Pence and House Speaker Nancy Pelosi (D-California) – Hannity pled with Meadows to have Trump intervene.",
    "A blizzard of exchanges between administration officials, media personalities, lawmakers and members of Trump’s family has illuminated the numerous and largely fruitless attempts that were made to implore Trump to quell the violent unrest.",
    "It’s gone too far and gotten out of hand.”\nThe president eventually delivered a video address at 4:17 p.m. in which he instructed his mob to “go home and go home in peace.” By then, however, the damage had been done.",
    "He should announce will lead the nationwide effort to reform voting integrity,” Hannity wrote of Trump on New Year’s Eve after Trump had tried to strongarm the Department of Justice into seizing voting machines.",
    "White House counsel will leave,” referring to Trump’s foredoomed scheme to have ex-Vice President Mike Pence throw out President Joe Biden’s Electoral College victories in several swing states.",
    "Someone is going to get killed.” - individual located outside of the White House\nPunchbowl News reporter Jake Sherman also reached out to Meadows during the assault, but to no avail.",
    "Fox News hosts Brian Kilmeade and Laura Ingraham also begged Meadows to force the president – who was watching the events unfold on television – to do something.",
    "“The president needs to stop this ASAP.” - GOP member 1\n“Fix this now.” - GOP member 2\n“POTUS has to come out firmly and tell protestors to dissipate.",
    "And worse, I’m not sure what is left to do or say, and I don’t like not knowing if it’s truly understood,” he said.",
    "“Ideas?”\nOn January 7th, Hannity reached out to then-White House Press Secretary Kayleigh McEnany with some advice.",
    "We’re all helpless.”\nTrump’s eldest son, Donald Trump Jr., begged Meadows to get his father to act.",
    "On January 5th, Hannity expressed to Meadows that he was “very worried about the next 48 hours.",
    "2- Yes, impeachment and 25th amendment are real, and many people will quit…,” Hannity said.",
    "Hannity recognized this and told Meadows that Trump needs to do serious damage control.",
    "Within a week, Fox News returned to parroting whatever nonsense Trump drummed up.",
    "“Mark, the president needs to tell people in the Capitol to go home.",
    "‘No legislative act,’ wrote Alexander Hamilton in Federalist No.",
    "Ask people to peacefully leave the [Capitol],” Hannity said.",
    "Destroying everything you have accomplished,” Kilmeade said.",
    "I do NOT see January 6 happening the way he is being told.",
    "“Guys, we have a clear path to land the plane in 9 days.",
    "There’s an armed standoff at the house chamber door.",
    "The Capitol Police tweet is not enough,” Jr. wrote.",
    "“We can’t lose the entire WH counsels [sic] office.",
    "I will help reinforce....” McEnany responded.",
    "“We need an Oval Office address,” Jr. added.",
    "He is destroying his legacy,” said Ingraham.",
    "I did not have a good call with him today.",
    "“We are under siege in the cpaitol [sic].",
    "No more crazy people,” Hannity advised.",
    "He can’t mention the election again.",
    "“He’s got to condemn this sh*t ASAP.",
    "“1- No more stolen election talk.",
    "“Do something for us,” he wrote.",
    "This is hurting all of us.",
    "I agree,” replied Meadows.",
    "“Yes 100%,” said McEnany.",
    "“Can he make a statement?",
    "“Please get him on tv.",
    "“I’m pushing it hard.",
    "That is the playbook.",
    "“He has to lead now.",
    "Pence pressure.",
    "After the 6th.",
    "“Love that.",
    "Thank you.",
    "“Key now.",
    "Ever."
  ]
}