{
  "id": 17492,
  "mediaId": 2753,
  "date": "2022-02-28",
  "headline": "Rep. Jim Jordan wants more information on Clinton attempt to 'frame' Trump on Russia narrative",
  "image": "https://www.wnd.com/wp-content/uploads/2022/02/hillary-clinton-gritting-teeth-fingers-jpg.jpg",
  "link": "https://www.wnd.com/2022/02/rep-jim-jordan-wants-information-clinton-attempt-frame-trump-russia-narrative/",
  "mediaOutlet": "WorldNetDaily",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Trying to frame a presidential candidate, a president-elect and potentially even the president of the United States, that is really some scary stuff for our country and just underscores this assault on liberty that we have seen and the weaponization of government that we have seen the left use to go after their political opponents.”\nDurham secured an indictment against Sussman for allegedly lying to the FBI.",
    "We can’t prosecute or indict anyone,” Jordan said, adding that “the American people, all of you, the whole country deserves the truth.”\nHe said Congress could determine if the federal government funded research in China that potentially led to the COVID-19 pandemic, and he would like to see Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, answer questions.",
    "Jordan noted Congress should also investigate the Justice Department’s targeting of parents that speak out at school board meetings and investigate whether the U.S. government might have funded gain-of-function research at the Wuhan lab in China before the outbreak of the COVID-19 pandemic.",
    "By Fred Lucas\nThe Daily Signal\nCongress should investigate the Department of Justice’s conduct and that of Hillary Clinton’s presidential campaign in “trying to frame” former President Donald Trump, said Rep. Jim Jordan, R-Ohio, the ranking member of the House Judiciary Committee.",
    "Jordan spoke about the matters in light of the revelations in a court filing by special counsel John Durham that said Clinton campaign lawyer Michael Sussmann hired a technology firm to collect data from Trump Tower and later from the White House.",
    "“We need to know, particularly on the Judiciary Committee, the oversight we’re going to have to do, why the Department of Justice sent out this email to FBI agents saying ‘put this designation, this threat tag label on parents,’” Jordan said.",
    "It’s just letting folks come in.”\nHe also would like to see Congress find out from Attorney General Merrick Garland how far the Justice Department has gone in targeting parents that object to policies during school board meetings.",
    "It looks like it happened while President Trump was actually president of the United States.”\nSchlapp referred to when the media and Democrats dismissed Trump for saying in 2017 that his campaign was spied on.",
    "He said it was designed to create an ‘inference and a narrative’ about President Trump and the false accusations that he was somehow colluding with Russia, which we know wasn’t true,” Jordan said.",
    "He also gained a guilty plea from Justice Department lawyer Kevin Clinesmith for making a false statement on a court document to get a surveillance warrant on Trump campaign aide Carter Page.",
    "Jordan spoke Saturday at the the Conservative Political Action Conference in Orlando, Florida, in an interview-style setting with Matt Schlapp, chairman of the American Conservative Union.",
    "How many parents currently have that designation associated with their names?”\n[Editor's note: This story originally was published by The Daily Signal.]",
    "“Remember all the things that happened in ‘16, they first take the dossier, which they know is false, they take it to the court,” Jordan said.",
    "“We need to know why the Biden administration–it seems to me–is taking the intentional position of not having a border,” Jordan said.",
    "As the ranking member now, Jordan would be the chairman of the House Judiciary Committee if Republicans controlled the House.",
    "He also noted that someone under the alias Azra Turk went to Europe to meet another Trump adviser, George Papadopoulos.",
    "“The scariest thing I took away from what he filed two weeks ago is some of the language he used.",
    "“We need to know, for certain, did Dr. Fauci know two years ago that this virus came from a lab?",
    "Now we find out from the latest Durham filing that it goes right to the Clinton campaign.",
    "He said the southern border and illegal immigration would be a key priority as well.",
    "“Everything they say is a conspiracy theory eventually turns out to be true.",
    "“But thinking about that terminology, inference and creating a narrative.",
    "[Editor's note: This story originally was published by The Daily Signal.]",
    "That’s what we used to call framing somebody,” Jordan added.",
    "It looks like it happened while he was president-elect.",
    "“I would love to ask Merrick Garland a simple question.",
    "This looks like it happened when he was a candidate.",
    "Mr. Clinesmith was indicted for it,” Jordan said.",
    "“When they go to the court, they lie about it.",
    "“Part of our constitutional duty is oversight.",
    "“There is no other way to interpret this.",
    "“That’s called spying,” Jordan continued.",
    "We need to do the investigations.",
    "He was spied on,” Schlapp said.",
    "We’re the legislative branch.",
    "I think he did,” Jordan said.",
    "“We know all that happened.",
    "What’s the number?",
    "It’s intentional.",
    "Did he know that?",
    "It’s deliberate."
  ]
}