{
  "id": 1775,
  "mediaId": 2748,
  "date": "2022-02-17",
  "headline": "New Video: Devin Nunes Says Durham Probing 'Scam Of The Century'",
  "image": "https://blabberbuzz-bg6bts0feiert.netdna-ssl.com/media/k2/items/cache/9f41989070e966cb5890abb37af77c4a_L.jpg",
  "link": "https://www.blabber.buzz/blab/pop/1035134-new-video-devin-nunes-says-durham-probing-scam-of-the-century?utm_source=c-alrt&utm_medium=c-alrt-email&utm_term=c-alrt-GI&utm_content=3CBxZ7_XWJVMPwlfPETsrRVMPzicviGg0jM0.A",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5676,
    2938,
    2922,
    2765,
    3427,
    2379,
    2119,
    898,
    6569
  ],
  "sentences": [
    "Lawyers for the Clinton campaign paid a technology company to \"infiltrate\" servers belonging to Trump Tower, and later the White House, to establish an \"inference\" and \"narrative\" to bring to government agencies linking Donald Trump to Russia, a filing from Special Counsel John Durham found.",
    "Durham filed a motion on February 11 focused on potential conflicts of interest related to the representation of former Clinton campaign lawyer Michael Sussmann, who was charged with making a false statement to a federal agent.",
    "He requested a meeting in which he presented \"purported data and 'white papers' that allegedly demonstrated a covert communications channel\" between the Trump Organization and Alfa\nBank, which has ties to the Kremlin.",
    "The indictment against Sussmann, says he told then-FBI General Counsel James Baker in September 2016, less than two months before the 2016 presidential election, that he was not doing work \"for any client.\"",
    "Appearing on \"Eric Bolling: The Balance,\" Nunes, who now heads Trump Media & Technology Group, asserted that one key question remains to be answered: \"What did she know, and when did she know it?\"",
    "\"Yep, there was spying going on,\" Jordan exclaimed, \"and it was worse than we thought because they were spying on the sitting ?President of the United States.",
    "According to the New York Post, Rep. Jim Jordan, R-Ohio, speaking on Durham's investigation, found credibility in the probe's allegation of spying.",
    "He's already indicted one of Clinton's lawyers — others seem to be in trouble; high-level DNC lawyers seemed to be in trouble.",
    "Remember, we made 14 criminal referrals [to the Department of Justice]; that doesn't mean just 14 people.",
    "My assessment is it looks like there's going to be many, many more, but we just don't\nknow yet.\"",
    "So it'll all be dependent at the end of the day, what did she know, and when did she know it?",
    "\"Durham is going to have to run a perfect investigation here,\" Nunes continued.",
    "\"And it also is going to depend on what indictments Durham continues to bring.",
    "February 17, 2022\n\"So he [Durham] has to go through and look at all of that.",
    "\"He's got to wrap up all the people that were\ninvolved.",
    "And it goes right to the Clinton campaign.",
    "That's really what it comes down to.",
    "Sussmann has pleaded not guilty.",
    "So God bless John Durham?.\""
  ]
}