{
  "id": 1793,
  "mediaId": 2573,
  "date": "2022-02-09",
  "headline": "'Hannity' on Capitol Police",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/701f48c7-5197-4ab9-9019-8f44d0ced0e4/dc152bd9-f1cf-4a3c-898e-ca3d6f117c49/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/transcript/hannity-on-capitol-police",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1708,
    2767,
    2765,
    3054,
    2944,
    3246,
    3468,
    4466,
    932,
    514
  ],
  "sentences": [
    "Cyber security experts are now sounding the alarm about what they are calling a troubling and irresponsible move from the highest levels of the federal government, the same FBI leadership that never held their own top brass to this day accountable for the biggest corruption, abuse of power scandal ever when they use that dirty Russian disinformation dossier that Hillary Clinton bought and paid for to spy on Donald Trump the candidate, the transition team of Donald Trump and President Donald Trump.",
    "HANNITY: You see, we're now an environment, it used to be every two years and every four years, every election cycle, the Democratic playbook is Republicans are racist, sexist, misogynistic, homophobic, xenophobic, now transphobic, and they want dirty air and water, and some prominent Republican wants to put grandma and grandpa in a wheelchair and throw them over a cliff after we only feed them dog food for the last three years of their life.",
    "MARK MEADOWS, FORMER WHITE HOUSE CHIEF OF STAFF: Well, obviously, the biggest thing, Sean, is, is that our Founding Fathers wanted to make sure that search and seizure is done under a particular format, and when you start to look at the ability the technology that is out there right now, Congressman Jordan hit this many, many years ago actually in the Oversight Committee when he was serving there.",
    "Copyright 2022 VIQ Media Transcription, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of VIQ Media Transcription, Inc. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
    "(COMMERCIAL BREAK)\nHANNITY: Now, Wisconsin Senator Ron Johnston today slammed Biden's far left nominee for the U.S. special envoy to monitor and combat anti- Semitism, now, over her March 2021 tweet, accusing him of white supremacy and nationalism for pointing out the Democrats' blatant double standard when it comes to violence.",
    "And that's not all, according to one GOP congressman from Texas during recess in November 2021, three Capitol Police officers entered his congressional office without his knowledge, dressed like construction workers and began taking pictures of a white board before being confronted by a staffer who is still in the office.",
    "And here's what's happening in Israel right now, the Israeli government is now investigating -- this is a huge controversy in Israel -- claims that the spyware was being used by the police against specific Israeli citizens, specifically key witnesses in the corruption trial of former Prime Minister Benjamin Netanyahu.",
    "Why would we believe for one second that the very people that knew that this was a non-verifiable dossier, they knew Hillary paid for it, they were warned off it numerous times, then when the sub-source even told them that none of it is true, they still applied for more FISA warrants to spy on then President Trump.",
    "Today on Twitter, the congressman stated that perhaps his office was targeted because, quote, well, I've been a vocal critic of Speaker Pelosi, the January 6 committee, and the capitol police leadership over their handling of January 6th and the death of Ashli Babbitt and the subsequent sham investigation.",
    "Look at this, breaking today, the inspector general for the Capitol Police opened a formal investigation into serious claims that Republican members of Congress are being unlawfully and were unlawfully surveyed -- surveilled by Capitol Police potentially at the direction of Nancy Pelosi.",
    "SEAN HANNITY, FOX NEWS HOST: You know, Tucker, what is great about him and this is what is funny to me about the left's reaction to him, is without his medical brilliance and his creation of the mRNA technology, there wouldn't be a Pfizer vaccine, there wouldn't be a Moderna vaccine.",
    "Now, once it has access to your phone, Pegasus can allegedly copy your messages and your photos, track your location, record your conversations through the microphone, even when you are not using your phone, and get this: it can even film you secretly through your own phone's camera.",
    "And the last thing, what really struck me about that Psaki response was here they go again, the Democrats and Biden, listen for it, they are talking about weaponizing the DOJ again to investigate so-called right-wing groups that are funding these freedom fighting truckers, right?",
    "(END VIDEO CLIP)\nLINE: And protesting truckers are not only disrupting the core of the capital city, they're blocking and snarling cross-border travel as far west as Alberta and at the Ambassador Bridge crossing which you mentioned halting vehicles from leaving Michigan.",
    "Now, more bad news tonight for Biden of the north -- that would be the gutless and cowardly Justin Trudeau -- as even members of his own far left party are now starting to turn on him over his needless attempts to further divide Canadians to push draconian COVID rules.",
    "Why wasn't the mainstream media interested at that point and who was funding the folks burning down police precincts, who was funding the people that were, you know, going out of their way to murder a retired police officer who was defending small businesses?",
    "He's pathetic, a spineless excuse for a leader, and in this moment by the way, the truckers of the world are uniting and by the way, they're all putting a positive impact on ending draconian mandates, they're actually following the science from John Hopkins.",
    "Meanwhile, late last night, there was an emergency meeting in the House of Commons after the city of Ottawa declared a state of emergency, with Prime Minister Justin Trudeau vowing more help from the federal government and he attacked these demonstrators.",
    "And if I could just comment on one more bit of that sound bite there, Jen Psaki having, Sean, to clarify for all of us that there was no impact to Customs and Border Patrol at the Canadian border come all of a sudden, now we care about the impact to CBP?",
    "But I can say it's quieter here than it has been for at least a dozen days, that's because a judge has issued an injunction so there's no more honking allowed but that has not stopped the revving of these engines and as you mentioned these protesters.",
    "HANNITY: I got to run, but last one point, we're not factoring in here are people that get it -- you know, methamphetamine, you know, they're up for you know 72 straight hours, they're out of their mind psychotic, they're a danger to society, Geraldo.",
    "And so, I think what we need here is the overall concept of the failure of \"The New York Times\" committed they are at fault here , but I think the big picture is, are you going to create a dynamic or conservative , the media is even more under fire.",
    "That sound bite though that you just played there between the reporter and Jen Psaki I found really fascinating, the curiosity from the mainstream media now about funding for something that isn't even impacting us right now here in America.",
    "I mean, we -- but for that whistleblower coming forward and telling us they are putting this threat tag designation on parents, are they going to use this spyware technology on the same parents who now have a threat tag label on them?",
    "What if we tell people who come in the country illegally that if you come in, we're going to make the process of coming in the country more -- we're going to facilitate that --\n(CROSSTALK)\nBONGINO: Hold on, hold on, hold on, hold on.",
    "So I think there's a big lesson here, and the amazing thing is, even though it might result in shortages, the people of Canada and the people in the U.S. have a greater appreciation more than ever before that I can see for truckers.",
    "Lara, you know, one thing that's come out of this that I think is actually amazing and that is I think everybody maybe -- we don't think about it, but everything we buy in every store we go to is because of these great truckers.",
    "We have one building and starting soon right here in the U.S. and we're also learning tonight that the trucker convoy has blockaded the busiest U.S.-Canada bridge that connects with Detroit -- that connects Detroit with Ontario.",
    "Some are even claiming that multiple witnesses were actually because of the spying are being blackmailed into testifying against former Prime Minister Netanyahu because of data harvested from their phones using this spyware.",
    "Mark Meadows, add this new technology, couple it with what's going on in Israel and how potent this is, how -- how all freedoms can be taken away and Christopher Wray who never cleaned up the FBI is buying this technology.",
    "I guess the point I was trying to make, the broader point is, you know, we have malicious poison being spewed all over the Internet and people that just routinely call people racist, you'll play the race card all the time.",
    "Now, the plan prioritizes, quote, undeserved communities and keep in mind, long-term addiction to crack, heroin, crystal meth, other hard drugs, that's pretty much people committing suicide in just a longer period of time.",
    "And you mentioned Prime Minister Bibi Netanyahu and some of the reporting that surveillance has taken place there, it shouldn't happen in America and quite frankly, we need to make sure that we have safeguards.",
    "HANNITY: The kid comes to you -- your kid comes to you and says, dad, I'm going to -- I'm smoking crack, you can't stop me and I'm shooting heroin and you can't stop me, but I can't get any clean needles.",
    "So what's it going to take for this far left failure to wake up, get up off his ass and finally do what is right, talk to the truckers, come to a compromise which would likely be you lose and the mandate.",
    "And now, at today's press briefing, one reporter asked propagandists circle-back Psaki if the Biden administration is investigating the trucker's convoys and their funding from quote right-wing forces.",
    "Here with the very latest is the ranking member of the House Judiciary Committee, Congressman Jim Jordan, along with former White House chief of staff and former congressman, Mark Meadows, is with us.",
    "Now, here's where the story hits close to home, even though the NSO Group has been blacklisted by the U.S. Commerce Department, can you guess who might have purchased the license to use this in 2019?",
    "You may remember \"The Times\" falsely accused me -- multiple times actually -- that I was responsible for coronavirus deaths, including for a man who died after taking a cruise in early March of 2020.",
    "Can you imagine trying to run a West Wing when you have to go hire a criminal defense lawyer on the third day to deal with FBI questions about complete garbage that lead to nothing, by the way?",
    "And you know, we learned today, incredibly irresponsible and reckless, \"The New York Times\", this guy James Bennett simply inserted the language without any justification, without any evidence.",
    "And later, a supposedly non-partisan Biden nominee accused Senator Ron Johnson of white supremacy, called him a white nationalist sympathizer from behind the comfort of her keyboard on Twitter.",
    "\"The New York Times\" recently detailed the intensifying scrutiny over the technology after evidence that, quote, authoritarian governments are using NSO products to spy on political opponents.",
    "HANNITY: I would like an answer to what Director Wray, if Republicans get back to Congress, which I think hopefully they will in November, would you start an investigation, Congressman Jordan?",
    "Clarence Thomas is on record saying that back in 1964, the actual malice standard was conjured up out of thin air by the Supreme Court and it bears no relation to the First and 14th Amendment.",
    "(CROSSTALK)\nHANNITY: I gave you -- I gave them gave you an option, take that money, open a facility and offer them treatment of some kind with trained drug counselors to stop their addiction.",
    "(BEGIN VIDEO CLIP)\nREPORTER: There does seem to be evidence that these truckers are getting support from conservative forces or right-wing forces in the U.S. Are you investigating that all?",
    "When we come back, well, Joe Biden of the north, that's right, Justin Trudeau continues to smear, slander, besmirch all the truckers standing up against these draconian vaccine mandates.",
    "Quote: The Capitol's intelligence unit quietly started scrutinizing the backgrounds of people who met with lawmakers, even Republican staffers were allegedly targeted with surveillance.",
    "So, the message is, the deep state can pretty much do whatever the hell they want and there'll be zero consequences, and there's no way this will not be used for nefarious purposes.",
    "You know, Peter Strzok who said I can smell the Trump supporters at the Walmart, what would he -- what would Andy McCabe, John Brennan have done with this technology four years ago?",
    "Maybe the government's money would be better used to maybe open up a treatment facility and therapy to end the addiction, rather than to offer a means to facilitate the addiction.",
    "Every single error they made associated with Donald Trump, and I bet associated with you, Sean, and I bet associated with Sarah Palin is from the side that you guys are evildoers.",
    "JOHNSON: Yeah, I started my questioning by asking her, if she agreed with President Biden's inaugural address when he said his number one goal was to unify and heal this nation?",
    "LIPSTADT: I certainly did not mean it, and I'm sorry if it was taken, and I'm sorry if I made it in a way that it could be assumed to be a political -- at the person personally.",
    "Now with one liberal member of parliament from Quebec saying, quote, this politicization of the pandemic risks undermining the public's trust in our public health institutions.",
    "You know, if you can have spyware that's actually on your cell phone that collects all kinds of data, can you imagine unseeing things that you've actually been able to collect.",
    "When you're being nominated and considered for confirmation to a position of diplomacy representing the United States, I can't -- I certainly cannot support your nomination.",
    "Then you have \"Times\" -- \"The New York Times\" Sullivan case, what do you think -- what are the odds here, and I think Palin would appeal to the Supreme Court if she didn't.",
    "So, that is definitely something we got to get to the bottom of, and a whole host -- a whole other number of investigations that we also have to - - we also have to have.",
    "The case centers around a 2017 editorial that incorrectly tied Palin to a 2011 mass shooting in Arizona where former Congresswoman Gabby Giffords was seriously injured.",
    "And see, the folks here in charge in America don't want us getting crazy ideas about standing up for our freedoms in the same way that is happening right now in Canada.",
    "In terms of an assessment of any other engagement from here, we have -- we don't really have any update on that or any investigation to read out at this point in time.",
    "JEN PSAKI, WHITE HOUSE PRESS SECRETARY: We have been engaged since the outset -- well, some of it would hopefully answer your question, I should say -- of the protest.",
    "He has sent letters to Trudeau and other safety officials asking for additional police officers, some 1,800 officers he's requesting to, quote, quell the insurrection.",
    "RIVERA: They're trying something -- you know, do you want the junkie in front of the school or you want the junkie in private where is his intake can be monitored.",
    "So here it is --the number one goal of President Biden and his own nominee to be the special envoy agreed with me that we are not more united, we are not healing.",
    "They are just standing up for some principle that they think stands for, you know, their idea of some fake democracy that they are fighting for, which it doesn't.",
    "GREGG JARRETT, FOX NEWS LEGAL ANALYST: It's an uphill battle, but she said if she loses, she will go to the Supreme Court and will get a friendly audience there.",
    "HANNITY: Yeah, it's amazing too and I believe, you know, you have now become the number one target in this re-election cycle by all these leftist liberal groups.",
    "That same FBI which we now know is spying on moms and dads who simply had the audacity to show up at school board meetings and speak out against this curriculum.",
    "That's what's frightening, and that's why we -- this is so concerning what happened -- with what the FBI is purchasing and the situation with Congressman Nehls.",
    "The same FBI that spied on President Trump's campaign, the same FBI that set Michael Flynn up four days into the administration, set him up in the White House.",
    "I just want to -- I want to so just to be clear here, you're suggesting that because these people died of drugs, which is tragic I don't wish death on anyone.",
    "HANNITY: So the socialist jackass that Trudeau is, Reince, is no different than a socialist jackasses in this country because he uses the same lying rhetoric.",
    "(BEGIN VIDEO CLIP)\nCANDICE BERGEN, CANADIAN PARLIAMENT LEADER OF THE OPPOSITION: We have a prime minister who refuses to lead and instead is being divisive.",
    "What we need to make sure, it is some of those who have actually used the system to make a political point or actually violated some of our civil liberties.",
    "Straight ahead, Senator Ron Johnson called out a Biden nominee after she slandered and baselessly accused him of being a white nationalist and supremacist.",
    "I said, you know, just under being called a murderer or a rapist, being called a racist is probably the worst thing that somebody can accuse you of being.",
    "A new plan funded by the HHS, they are going to distribute -- Joe Biden's HHS are going to distribute crack pipes or free to addicts across the country.",
    "It's just -- it's malicious poison that they're spewing and they never get called on it because you know they're the mainstream media are their allies.",
    "The police then interrogated the staffer about the contents on the white board which detailed various legislative plans that are under consideration.",
    "In a statement, the bureau claims that it paid five million dollars for a limited license from the NSO Group for product testing and evaluation only.",
    "Calling somebody a racist, it's not about a serious and vile accusation as you can hurl over some -- against somebody, somebody you don't even know?",
    "I asked you also about immigration in the past, and which Geraldo just say -- Sean just asked you about what you would do if it was your kid, right?",
    "Secondly, you know, these Democrats, and Trudeau, and Biden, they're always the first ones to say we are standing up for these working-class people.",
    "JOHNSON: Well, if you're up for confirmation, whether you are put up for oath as a witness or not, you need to be truthful to the American people.",
    "I have my FBI pen still right there, representing the 99 percent of good people that will risk their lives and obey the laws, and not abuse power.",
    "This is extremely chilling, especially because Director Wray never held these people accountable, never cleaned up his bureau of the one percent.",
    "Senator, you know, so she sent out the article in the tweet and the headline is that you're a white nationalist sympathizer and that is not true.",
    "I've been covering drugs since --\n(CROSSTALK)\nRIVERA: -- the epidemic, the first one, and then the crack, and everything else that came after it.",
    "So, you say, well, it's not compassionate if we stop people who are suffering at the border and you never say to yourself, well, and then what?",
    "Tonight, President Trump is absolutely right, the deep state's abuse of power, it is very real and under Joe Biden, it is now going unchecked.",
    "(END VIDEO CLIP)\nHANNITY: Here with reaction, FOX News contributor, Lara Trump, along with former White House chief of staff, Reince Priebus.",
    "We are on a fast pace, technology-wise, that will all of a sudden enter in all kinds of dynamics that the courts have never even looked at.",
    "For years, Democrats, they have yearned for Medicare for all, but now under Joe, they are going to have to settle for something much less.",
    "Now, this is yet another far-left activist trying to masquerade as a serious diplomat, with the goal of smearing, attacking conservatives.",
    "And yet, you know, Ms. Lipstadt claimed that she never personalized this, but she absolutely does personalize it, and it's very partisan.",
    "Whether it's a member's office as it has been alleged with the Capitol Police, or whether it's private citizens with this new technology.",
    "(BEGIN VIDEO CLIP)\nJUSTIN TRUDEAU, CANADIAN PRIME MINISTER: The people of Ottawa don't deserve to be harassed in their own neighborhoods.",
    "Now, today during the trial, their editor, James Bennett, testified, well, I just relied on information put together by other colleagues.",
    "That is a massive scandal unfolding in Israel and here's my prediction -- buckle up, it's not a matter of if but it's a matter of when.",
    "And as I said earlier, but I want to reiterate, that even in my critiques of people, I'm very careful never to ascribe to the person.",
    "And as I said earlier, but I want to reiterate, that even in my critiques of people, I'm very careful never to ascribe to the person.",
    "Just like they weaponized Mueller, they weaponized Russia-gate, weaponized Loretta Lynch and Bill Clinton, and the back of the plane.",
    "I thought it was interesting to start the hearing -- we had majority leader, Senator Schumer, come and talk about malicious poison.",
    "People from way outside of Wisconsin, I understand and have heard, are pouring money into the campaign to oust you from the Senate.",
    "But because they didn't clean it up, I can't in good conscience support it any longer, because they never got to the bottom of it.",
    "Where was the same curiosity, Sean, for the funding during the summer of love peaceful protests that we had in the summer of 2020?",
    "HANNITY: His technology led to those vaccines and yet he is still criticized because he does not exactly toe the line like Fauci.",
    "I don't think people in this country or really anywhere have appreciated what would happen if the truckers just stopped working.",
    "Now, to our friends in Canada, I can tell you with a high degree of certainty, unfortunately, Joe tonight will be doing nothing.",
    "They don't deserve to be confronted with the inherent violence of a swastika flying on a street corner, or a Confederate flag.",
    "But according to ABC, this technology is frequently used abroad to hack journalists and dissidents and human rights activists.",
    "And you mentioned the FISA court, we need to make sure that we use them just for the bad guys abroad and not on U.S. citizens.",
    "And I think a lot of it is rooted in the fact that you actually take strong stands and you fight for the people in your state.",
    "But what I would do is I would wrap my arms around that child, and I would -- I would say you're not getting out of my sight.",
    "They have a right to protest except when it is a right to protest against something they don't like, like masks and vaccines.",
    "No Confederate flags, no swastikas, no violence whatsoever, and Trudeau just lies through his face -- lies through his teeth.",
    "HANNITY: Any evidence, Molly, of swastikas, Confederate flags, any evidence of racism or violence at all that you've seen?",
    "Yet, you show up -- you show up without your driver's license, you present 72 other forms of ID, you can't get on a plane.",
    "Is there any kind of, you know, involvement of U.S. authorities and looking at those money flows going to these truckers?",
    "(END VIDEO CLIP)\nLINE: As Trudeau aims to paint the protesters as extremists, he's taking fire from within his own party.",
    "For over a year, the Customs and Border Patrol on our southern border have been in a complete and total crisis situation.",
    "MOLLY LINE, FOX NEWS CORRESPONDENT: They have told me that they plan to stay here until they get exactly what they want.",
    "This new position is the special envoy to monitor and combat anti-Semitism, it's supposed to be a non-partisan position.",
    "I have to agree with the MP for Louis Bear when he says people don't know where public health ends and politics begins.",
    "Anyway, we're seeing signs of more similar convoys developing in places like Brussels, all across the European Union.",
    "HANNITY: Well, it's amazing, because you have now become the number one of Democrats to try and take out this cycle.",
    "There have been zero impact to CBP operations, which is a question people have, understandably, have been asking us.",
    "Our own vice president, Kamala Harris, we know, bailed some of these folks out of jail for committing these crimes.",
    "Third, he refused to take down the published editorial because, oh, \"The New York Times\" has a policy against that.",
    "BONGINO: Yeah, Geraldo, I know, but you know, I -- Sean asked you a question I asked you earlier about immigration.",
    "Here now with reaction, the host of \"Unfiltered,\" Dan Bongino, along with the co-host of \"The Five,\" Gerald Rivera.",
    "Oh, see all this information we have, say what we want in court and guess what, it will never see the light of day.",
    "So, that is -- that is the playbook, but it's not every two and four years, now it seems to be every day, Senator.",
    "So perhaps that gives us a look at what authorities are looking towards here in the future on the ground -- Sean.",
    "They have vowed to stay on the ground here until the COVID-19 vaccine mandates and other restrictions are lifted.",
    "And your segment just before us with Ron Johnson, I mean, you come out with an accusation, you're just a racist.",
    "So you just want other communities think people like, this is the thing, like it's easy to speak about emotions.",
    "It was so bad, Mark Meadows, it got to the point that for national security reasons, I supported the FISA court.",
    "JORDAN: Oh, we -- yeah, we got to do -- we got to get to the bottom of this whole DOJ, FBI going after parents.",
    "But don't worry about it, folks, no issue on the northern border, that apparently is the only one that matters.",
    "Now, according to reports, Pegasus might be the single most powerful and controversial spyware ever developed.",
    "That same FBI, the leadership of it now has this amazing technology, which should only be used on terrorists.",
    "Obviously in Canada but right here in America, people are cheering them on because this is all about freedom.",
    "Joel Light bound, a fellow liberal party member, slams the policies of the current government under Trudeau.",
    "Here with the full report live on the ground in Ottawa, FOX News's own correspondent Molly Line is with us.",
    "Well, wait a second, now you want my approval for a Senate approved position with the Biden administration?",
    "So, I will appeal to the audience, I need a lot of help to save this U.S. Senate to help save this country.",
    "And now, we find out the FBI has acquired the single most sophisticated spying tools ever designed by men.",
    "(BEGIN VIDEO CLIP)\nSEN. RON JOHNSON (R-WI): How would you feel somebody just privately called you racist?",
    "Geraldo, let me ask you a question --\nRIVERA: -- East Harlem in Washington Heights, they save 114 people.",
    "HANNITY: Let me get --\nJARRETT: He said you know come apologies are extremely painful to our journalists.",
    "Big developments in the defamation trial involving former Governor Sarah Palin and \"The New York Times\".",
    "Now let's turn our focus back to the White House, a new -- a big new plan from the Biden administration.",
    "We don't need them on our streets, period, and we don't need to be aiding and abetting in their suicide.",
    "You said that 99 percent of normal FBI personnel are honorable public servants, and it's probably 99.9.",
    "So, my question is, how does this person get -- how do the Democrats allow this person to get through?",
    "On our second day at the White House, Sean, I will wrap up with this, we had the FBI down the hallway.",
    "DAN BONGINO, FOX NEWS CONTRIBUTOR: Don't worry, Sean, Geraldo says they come in with their own drugs.",
    "You know, both of you were very, very pivotal in exposing this big abuse of power corruption scandal.",
    "You're suggesting we should make the drug using process easier by giving the equipment to use drugs.",
    "HANNITY: And the double standard can't be any more clear, and Lara and her family know all too well.",
    "CLAY TRAVIS, OUTKICK FOUNDER: Sean, how often has \"The New York Times\" made an error in your favor?",
    "And the question is you caught her red-handed in a lie, and what she said about you was even worse.",
    "HANNITY: Jim Jordan, this is a massive corruption scandal in Israel, and I see the same thing here.",
    "No, this is -- this is -- this is the Geraldo model of thinking and in this you're doing it again.",
    "We need to make sure that our civil liberties are protected each and every day regardless of that.",
    "Here with reaction, Outkick founder, Clay Travis, along with FOX News legal analyst Gregg Jarrett.",
    "That was a copper we did, it was called broken windows policing, and it stopped the drug trading.",
    "But that's after you got her to admit she is very careful not to ascribe these things to people.",
    "There is not one Republican that should put up with this because they are going to be next, too.",
    "We'll talk to a live reporter on the ground and much more, as we continue right here on HANNITY.",
    "No one has any problem using this on terrorists, our concern is, are they going to use it on us?",
    "Please tell me if you don't --\nRIVERA: Believe me, I am not enthusiastic about this plan at all.",
    "When we start to look at really what the technology is able to do, it is very, very frightening.",
    "And then I asked her, well, do you think a year in, is our nation more unified, are we healing?",
    "So we should make it easier for them to do drugs -- never again saying, okay, well, then what?",
    "RIVERA: That's -- more people died last year from overdoses than from COVID in San Francisco.",
    "He refuses to meet with them, refuses to address any of their valid concerns about mandates.",
    "But first, we turn our attention to a chilling story surrounding an Israeli technology firm.",
    "That's a real indictment against President Biden, and it's an indictment against Democrats.",
    "But, Sean, you have to consider the fact -- this is the question, do junkies' lives matter?",
    "(CROSSTALK)\nHANNITY: -- saved their life and give them time to think about something else.",
    "(BEGIN VIDEO CLIP)\nJOHNSON: How would you feel somebody just privately called you racist?",
    "You know, I have my lawyers have already sent \"The New York Times\" a preservation letter.",
    "Your viewers know me, it has nothing to do with any of that, and neither did anyone else.",
    "LARA TRUMP, FOX NEWS CONTRIBUTOR: Yeah, well, thank you to all of our truckers out there.",
    "You're not going to want to miss it and Senator Johnson will react live, straight ahead.",
    "They open these two pilot locations with a safe, secure, where the junkies can shoot up.",
    "You do this with immigration too, where you never ask the question, okay, and then what?",
    "They come in with their own drugs -- it's not that the government is giving them drugs.",
    "So let's give them the equipment --\n(CROSSTALK)\nRIVERA: Okay, okay, you made the point.",
    "RIVERA: There are therapists on site as I understand it in the in the pilot locations.",
    "And I would ask a simple question, Sean, what if Peter Strzok had this four years ago?",
    "I thought that was interesting you never criticized the person -- but that's not true.",
    "Why would we trust them with this type of technology, until they clean up their house?",
    "\"The New York Times\", \"The Washington Post\", CNN, MSNBC, all the stories they've done.",
    "I know what --\nJOHNSON: So, why would you go on social media and make those charges?",
    "RIVERA: You got to recognize that this is --\nBONGINO: You want to make a real issue.",
    "I'm --\n(CROSSTALK)\nHANNITY: Geraldo, serious question and then I'll let Dan respond.",
    "RIVERA: I would die -- I would -- I would -- I would bleed -- tears would be blood.",
    "LIPSTADT: No, I have no idea what -- no, I do not know what's in your heart at all.",
    "TRAVIS: -- is think about all the things that they have written about Donald Trump.",
    "JOHNSON: I don't think we sworn them in at Senate Foreign Relations Committee, no.",
    "Neil Gorsuch has said it's an ironclad subsidy for the publication of falsehoods.",
    "I think we all know there is immense support you just said it for these truckers.",
    "Molly, the latest there and it seems like not one of these truckers has given in.",
    "I mean, the reality, is if this was really about public safety, they missed it.",
    "In the meantime, let not your hearts be troubled, Laura Ingraham takes it away.",
    "JOHNSON: Well, listen, I appreciate your apology, and I'll accept your apology.",
    "Just -- that's -- I'm expecting the worst that about to come out of your mouth.",
    "Then the FBI reportedly renewed the contract for another four million dollars.",
    "Now, the only difference is they won't need to lie to the FISA court to spy.",
    "We know what they've done to parents, putting a threat tag label on parents.",
    "Hey, Joey, what are you going to do about that, now when it impacts America?",
    "As long as they're coming in with their own drugs, that's -- that's A-okay.",
    "I know your kids, a lot of your kids, and you're a great father, all right?",
    "This firm is named NSO Group, and its powerful spyware tool called Pegasus.",
    "Omicron is on the downfall, 80 percent of Canadians are already vaccinated.",
    "Look, Trudeau, Biden, and Democrats, number one, they have missed the wave.",
    "And I was under pressure under deadline pressure, which led to the error.",
    "DEBORAH LIPSTADT, BIDEN NOMINEE: First of all, I would say they're wrong.",
    "I mean, really, you constantly engage in this first order thinking stuff.",
    "Meanwhile, Trudeau continues to call the truckers every name in the book.",
    "(CROSSTALK)\nRIVERA: This plan eliminates the public nuance or reduces it.",
    "The bottom line here is that this really has nothing to do with funding.",
    "One conservative member agreed as Trudeau went before parliament today.",
    "What would you do if your child said I -- dad, I'm using dirty needles.",
    "Those are the ones you are talking about that we need to make sure of.",
    "Public policy is full of entire gray area --\nRIVERA: What's your idea?",
    "It'll make you think twice about how you use your very own cell phone.",
    "When we come back, is Sarah Palin about to crush \"The New York Times\"?",
    "We hope you will set your DVR so you never miss an episode of HANNITY.",
    "I'm not questioning the fact that you care about these people at all.",
    "With the legal immigrants, how many of you guys take it in your home?",
    "RIVERA: These are not -- these are these are horrible dilemmas, Sean.",
    "Dan --\n(CROSSTALK)\nRIVERA: -- if you've got an idea, what's the idea?",
    "Your emotions which are you know are laudable are not public policy.",
    "HANNITY: I'd put them in jail and I'd give them counseling to jail.",
    "Well, last time, I've had you on this show, you seem like a person.",
    "You're an illegal immigrant, get on a plane with an arrest warrant.",
    "Geraldo, I mean this is really -- this is -- this is just juvenile.",
    "Copy: Content and Programming Copyright 2022 Fox News Network, LLC.",
    "Ottawa Mayor Jim Watson claims the people here are living in fear.",
    "We lost 100,000 Americans in the last one year to overdose deaths.",
    "BONGINO: I don't want to talk over you, but I like to answer that.",
    "Here to react himself is Wisconsin Senator Ron Johnson is with us.",
    "RIVERA: Is the alternative that you want them dead, though, Sean?",
    "But is Trudeau's own party even starting to now turn against him?",
    "JOHNSON: If you're up for confirmation, you need to be truthful.",
    "HANNITY: Offer them counseling in jail, get them off the street.",
    "(CROSSTALK)\nHANNITY: They're going to die if they keep doing it.",
    "And meanwhile another spying scandal is brewing on Capitol Hill.",
    "HANNITY: Geraldo, you're a great parent -- Geraldo, I know you.",
    "RIVERA: -- there's 100,000 people dead, fentanyl is everywhere.",
    "Democrat governors across the country are ending mask mandates.",
    "They weaponized Eric Holder, and they blocked Fast and Furious.",
    "Unfortunately, that is all the time we have left this evening.",
    "This is --\n(CROSSTALK)\nHANNITY: I'm asking, what would you do?",
    "Look at this from \"Politico\", hardly a right-wing publication.",
    "(CROSSTALK)\nHANNITY: You don't like it but you're supporting.",
    "BONGINO: Here's a law, you can't take heroin, that's the law.",
    "RIVERA: The group says they've saved 114 lives in six weeks.",
    "There are a lot of children, a lot of families here -- Sean.",
    "There would be no food on the shelves in the grocery store.",
    "That's one pilot program --\n(CROSSTALK)\nHANNITY: All right.",
    "Geraldo --\nGERALDO RIVERA, CO-HOST OF \"THE FIVE\": Hi, Sean.",
    "I've been outspent so far, $13 million to $1 million, 13-1.",
    "Spying scandals just like this will emerge in this country.",
    "So it's not like he is a product of the fervent right wing.",
    "This is a rush transcript of \"Hannity\" on February 8, 2022.",
    "This copy may not be in its final form and may be updated.",
    "(CROSSTALK)\nBONGINO: Okay, I don't want to talk over here.",
    "And the reason why I bring that up --\nHANNITY: Good point.",
    "They never falsely reported that he saved a puppy, right?",
    "Things are not looking too good for \"The Times\" in court.",
    "That's San Francisco, the video that's playing right now.",
    "I want to do everything I possibly can to save your life.",
    "I believe the people of Wisconsin are smarter than that.",
    "What you just -- what you just testified there is false.",
    "REINCE PRIEBUS, FORMER WHITE HOUSE CHIEF OF STAFF: Yeah.",
    "HANNITY: We need new libel laws, this case is important.",
    "No big building can be built without truckers trucking.",
    "Joey is fast asleep after he had his cup of warm milky.",
    "And the people who are most critical love the vaccines.",
    "It's not -- these people aren't, you know, celebrating.",
    "HANNITY: Well, it's a simple, basic, fundamental right.",
    "HANNITY: You know, I could think of a lot of good uses.",
    "RIVERA: -- worse is the hundred thousand dead junkies.",
    "BONGINO: And you're suggesting we give them crackpots.",
    "(END VIDEO CLIP)\nHANNITY: I will use a different word.",
    "Apparently on the weekends, they set up bouncy houses.",
    "As always, we thank you for making they show possible.",
    "Me and my lawyers are watching this case very closely.",
    "And, finally, he refused to apologize to his readers.",
    "Well, today, the senator confronted her face-to-face.",
    "Let me -- let me -- let me respond with one sentence.",
    "You don't have justice if you don't follow the rules.",
    "BONGINO: We have a bunch of laws, let's enforce them.",
    "I mean, we have a country of two Americas right now.",
    "CARLSON: That guy gave money to Joe Biden last year.",
    "And Senator Ron Johnson will be here with reaction.",
    "They never held the people responsible accountable.",
    "(CROSSTALK)\nRIVERA: And they do it year after year.",
    "Second of all, they did so under deadline pressure.",
    "Your father-in-law builds, you know, big buildings.",
    "And this is a way the Democrats and Biden operate.",
    "LIPSTADT: First of all, I would say they're wrong.",
    "MEADOWS: Well, you covered this in your monologue.",
    "It will always end in misery, suffering and death.",
    "HANNITY: -- please tell me you don't support this.",
    "RIVERA: I wouldn't go out and buy clean syringes.",
    "REP. JIM JORDAN (R-OH): No, you're exactly right.",
    "What happens when we make it easier to do drugs?",
    "RIVERA: They've been treatment programs forever.",
    "Like that's what second order thinking entails.",
    "I got to roll, but, guys, good to see you both.",
    "I'm suggesting to you that's not public policy.",
    "So, I don't know how Democrats can support her.",
    "Now, was she under oath in this hearing today?",
    "It seems to be a fairly family-friendly event.",
    "It's one that stigmatizes and divides people.",
    "RIVERA: And this is just a desperate measure.",
    "Not one but two alarming new spying scandals.",
    "Now, we're going to break this down for you.",
    "I mean --\nHANNITY: What are you going to do?",
    "You're saying, well, Sean, what do you want?",
    "HANNITY: I can't in good conscience do that.",
    "But he admitted ultimately it was his fault.",
    "If I put it to sleep, that wouldn't be good.",
    "It is a very high standard to prove malice.",
    "LINE: I have not seen any Confederate flag.",
    "Everything would come to a screeching halt.",
    "RIVERA: The law is you can't take fentanyl.",
    "The lawyers --\nHANNITY: I put them in jail.",
    "JOHNSON: I thought, you know, I heard that.",
    "(END VIDEO CLIP)\nHANNITY: What an exchange.",
    "There are -- there are sanitary conditions.",
    "Second of all, I would disagree with them.",
    "You don't know what's in my heart, do you?",
    "I need help from millions of your viewers.",
    "Second of all, I would disagree with them.",
    "That is ultimately what this is all about.",
    "We will play the full exchange coming up.",
    "I've done everything in my life to do so.",
    "And yet, you get accused of these things.",
    "Jim Jordan, Mark Meadows, thank you both.",
    "Can you -- can you get me some syringes?",
    "I thought lying to Congress was a crime.",
    "They are not trying to heal this nation.",
    "I hope my other colleagues won't either.",
    "JOHNSON: Well, Democrats have no shame.",
    "The answer is you're not taking any in.",
    "Well, you absolutely do personalize it.",
    "Do you want five or six junkies to die?",
    "You can always watch it in the morning.",
    "(COMMERCIAL BREAK)\nHANNITY: All right.",
    "(COMMERICAL BREAK)\nHANNITY: All right.",
    "RIVERA: You see this video right here.",
    "(COMMERCIAL BREAK)\nHANNITY: All right.",
    "Put them in jail, give them treatment.",
    "She said, well, I never personalized.",
    "Geraldo's -- that makes sense to you?",
    "They've saved 114 lives in six weeks.",
    "They have been doing it all the time.",
    "But the interest, Sean, is right now.",
    "This is in another country in Canada.",
    "We've seen a lot of kids here today.",
    "One hundred thousand dead Americans.",
    "(CROSSTALK)\nHANNITY: That's too bad.",
    "He's just an open-minded honest man.",
    "I would call that malicious poison.",
    "He was talking about anti-Semitism.",
    "RIVERA: Thank you now -- as do you.",
    "They have never given a retraction.",
    "There's no doubt at all about that.",
    "HANNITY: Clay, let's get your take.",
    "That's what Republicans hear here.",
    "Molly, great reporting, thank you.",
    "This is a desperate measure, Sean.",
    "I mean, you've never talked to me.",
    "Here's the exchange earlier today.",
    "Senator, thanks for being with us.",
    "I want to heal the racial divide.",
    "She lied, you know, in testimony.",
    "They are exacerbating the divide.",
    "RIVERA: The alternative is death.",
    "The law is you can't take heroin.",
    "RIVERA: I'm not happy about this.",
    "Maybe more people would do drugs?",
    "That's how sophisticated this is.",
    "We call it a lie where I grew up.",
    "Watching them die in the street?",
    "Canadians want their lives back.",
    "I'm following this case closely.",
    "And are you concerned about it?",
    "I mean --\nHANNITY: Dan Bongino.",
    "It's now impacting our country.",
    "So what's really going on here?",
    "You personalize it against me.",
    "But let me just be very clear.",
    "My faith matters to me, right?",
    "Like how does that make sense?",
    "HANNITY: I know you mean that.",
    "They never issued an apology.",
    "More HANNITY straight ahead.",
    "Thank you for being with us.",
    "I've not seen any swastikas.",
    "BONGINO: I want him in jail.",
    "It's a constitutional right.",
    "So, no worries there, folks.",
    "HANNITY: I gave you my idea.",
    "HANNITY: I hope they don't.",
    "I want to heal this nation.",
    "It's in all of these drugs.",
    "Never criticize the person.",
    "Sean, you're exactly right.",
    "There was no fact checking.",
    "But we had to deal with it.",
    "TRAVIS: It's a mess, Sean.",
    "We wouldn't have anything.",
    "And yet what's the option?",
    "You are an amazing father.",
    "JOHNSON: I tell the truth.",
    "We've done it in New York.",
    "And she said I think not.",
    "It's just so unfortunate.",
    "I hope Republicans don't.",
    "What are you going to do?",
    "Because I know what I do.",
    "But there was no vetting.",
    "HANNITY: One last thing.",
    "RIVERA: -- a real issue.",
    "It's not a pretty thing.",
    "RonJohnsonforSenate.com.",
    "But you're right, Sean.",
    "Watching them overdose?",
    "Fentanyl is everywhere.",
    "So this is frightening.",
    "There would be nothing.",
    "Isn't that fascinating?",
    "There would be no gas.",
    "Thank you, Lara Trump.",
    "That I know about you.",
    "And I agreed with her.",
    "She's a hard partisan.",
    "BONGINO: -- of ethics.",
    "Feeling the unity yet?",
    "JOHNSON: I heard that.",
    "Yep, Chris Wray's FBI.",
    "It's kind of bizarre.",
    "HANNITY: What's that?",
    "That's San Francisco.",
    "You heard Molly Line.",
    "We'll explain, next.",
    "They are both right.",
    "ALL RIGHTS RESERVED.",
    "I would not do that.",
    "I've got an example.",
    "You've never met me.",
    "But that's not true.",
    "Look at your screen.",
    "Welcome to HANNITY.",
    "We've got the tape.",
    "And I get you care.",
    "We'll tell you how.",
    "I want him in jail.",
    "BONGINO: All right.",
    "You made the point.",
    "That's our concern.",
    "Are you kidding me?",
    "Thank you, Reince.",
    "No problem at all.",
    "The verdict is in.",
    "What would you do?",
    "Tucker, thank you.",
    "Hold on a second.",
    "What's your idea?",
    "Who gives a damn?",
    "No interest then.",
    "It's a hard life.",
    "It's a hard job.",
    "I don't like it.",
    "I'm a believer.",
    "How about that?",
    "Thank you both.",
    "HANNITY: Yeah.",
    "BONGINO: Yeah.",
    "BONGINO: Yeah.",
    "There you go.",
    "BONGINO: Yes.",
    "BONGINO: Yes.",
    "HANNITY: Dan?",
    "I mean that.",
    "Or cat food.",
    "And she did.",
    "Am I wrong?",
    "It's awful.",
    "I hate it.",
    "It's ugly.",
    "It worked.",
    "All right.",
    "All right.",
    "All right.",
    "I'm not.",
    "Listen."
  ]
}