{
  "id": 1797,
  "mediaId": 2573,
  "date": "2022-02-09",
  "headline": "DHS tracking reports of potential truck convoy in America amid Canada trucker protests",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/AP22030839826415.jpg",
  "link": "https://www.foxnews.com/politics/dis-tracking-reports-of-potential-convoy-in-america",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kyle Morris",
  "authorUrl": "https://www.foxnews.com/person/m/kyle-morris",
  "termIds": [
    1441,
    1618,
    6678,
    6029,
    6492,
    6328
  ],
  "sentences": [
    "The warning, according to certain senior law enforcement officials and documents obtained by the outlet, revealed that \"the convoy could severely disrupt transportation, federal government and law enforcement operations through gridlock and potential counterprotests\" as truckers make their way across the United States.",
    "A report by Yahoo News said the agency is warning U.S. law enforcement and public safety officials that a trucker convoy protesting COVID-19 vaccine mandates, similar to those taking place in Canada, could begin Feb. 13, the same day Super Bowl LVI is played in Los Angeles.",
    "The department has \"not observed specific calls for violence within the United States associated with this convoy, and (is) working closely with our federal, state and local partners to continuously assess the threat environment and keep our communities safe.\"",
    "News of a potential American protest comes on the 13th day of the Freedom Convoy protests in Ottawa, where truck drivers are advocating for an end to the government's vaccine mandate for cross-border truckers.",
    "The Department of Homeland Security (DHS) is aiming to get ahead of a planned demonstration in America, \"tracking reports of a potential convoy\" amid several Canadian truck protests against COVID mandates.",
    "DHS has worked for more than a year with law enforcement partners to provide 500 individuals from across the department to support security measures at the Super Bowl, according to a U.S. official.",
    "The agency \"is tracking reports of a potential convoy that may be planning to travel to several U.S. cities,\" a DHS spokesperson said in a statement to Fox News Wednesday.",
    "\"DHS will continue to share timely and actionable information with the public,\" the spokesperson added.",
    "Ottawa Police have issued more than 1,300 tickets since the beginning of the occupation.",
    "Prime Minister Justin Trudeau has demanded that the protests end.",
    "Fox News' Lisa Bennatan contributed to this article."
  ]
}