{
  "id": 1843,
  "mediaId": 2578,
  "date": "2022-02-06",
  "headline": "Democrats Are Quietly Building A Gun Registry As A First Step In Gun Ban",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/Carry-Pic.jpg",
  "link": "https://www.thegatewaypundit.com/2022/02/democrats-quietly-building-gun-registry-first-step-gun-ban/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike LaChance",
  "authorUrl": "https://www.thegatewaypundit.com/author/aleister/",
  "termIds": [
    2119,
    2370,
    4267,
    4905,
    2765,
    1394,
    1249,
    200,
    392,
    6678
  ],
  "sentences": [
    "John R. Lott Jr. writes at Real Clear Politics:\nTRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nDemocrats Pushing Gun Registry as Precursor to Gun Ban\nFederal law explicitly prohibits the creation of a federal firearm registry, but the Biden administration is making one anyway.",
    "This massive data collection effort encompasses information on all guns sold by licensed gun dealers, and on all legal gun transfers in states with so-called universal background checks.",
    "The government has now created a searchable digital database containing 866 million of these transactions, including some 54 million made in 2021 alone.",
    "California, Chicago, and Washington, D.C. have also used registration to know who legally owned different types of guns before banning them.",
    "According to a Rasmussen Reports survey, Democrats support the idea by a 2-1 ratio, while Republicans oppose it by a similar margin.",
    "Democrats and the Biden administration have been quietly and carefully assembling a gun registry, a clear violation of federal law.",
    "Now, President Biden wants to make universal background checks nationwide so he can have an even more complete registration list.",
    "— Congressman Michael Cloud (@RepCloudTX) January 31, 2022\nThis is one of the major issues at stake in the 2022 midterms.",
    "The Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) has collected nearly one billion firearm purchase records.",
    "Two-thirds of Republicans believe the policy will lead to gun confiscation, and even 40% of Democrats believe the same.",
    "Countries such as Canada, the U.K., and Australia aren’t the only ones to use registration to ban and confiscate guns.",
    "Similarly, a recent Gallup poll shows that 40% of Democrats want a complete ban on civilian ownership of handguns.",
    "The Biden Administration continues to empower criminals while diminishing the rights of law-abiding Americans.",
    "— Rep. Jim Jordan (@Jim_Jordan) February 1, 2022\nA federal firearm registry is explicitly banned by law.",
    "Confiscating legally owned firearms, it seems, is not merely a right-wing conspiracy theory.",
    "Over the last few years, gun sales have absolutely skyrocketed in the United States.",
    "So, federal officials will have the name of everyone who legally obtained a gun.",
    "The ATF is shamelessly circumventing existing law to accumulate these records.",
    "And now the ATF wants a permanent gun registry of your firearm purchases.",
    "Gun control, a favorite issue of the left should be dead, but it’s not.",
    "The DOJ created a “domestic terrorism” unit to snoop on citizens.",
    "The FBI spied on parents at school board meetings.",
    "Cross posted from American Lookout.",
    "And that’s not even the worst part.",
    "Their goal in this is banning guns.",
    "This is not a conspiracy theory.",
    "The IRS targeted conservatives.",
    "This is happening."
  ]
}