{
  "id": 1917,
  "mediaId": 2664,
  "date": "2022-02-04",
  "headline": "White House call log 'directly contradicts' Jim Jordan's claims to Rules Committee: report",
  "image": "https://www.rawstory.com/media-library/gop-s-jim-jordan-clobbered-for-urging-prison-for-john-bolton-glass-houses-gym.png?id=24811080&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/jim-jordan-capitol-riot-2656562173/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    5180,
    2119,
    2500,
    2765,
    300,
    1433,
    1473
  ],
  "sentences": [
    "\"According to White House call records that have been obtained by the January 6th committee, and have been reviewed by two different sources that spoke to CNN, there was a phone call placed by the White House, by President Trump to Jim Jordan on the morning of January 6th,\" said Nobles.",
    "\"Almost every time he's been asked a question about his communication with Donald Trump, he's given a different answer, including today when he told CNN that he only remembers talking to the former president as he left the House floor on January 6th,\" continued Nobles.",
    "On Friday's edition of CNN's \"The Lead,\" correspondent Ryan Nobles reported on how White House records turned over to Congress contradict claims Rep. Jim Jordan (R-OH) made about his contact with former President Donald Trump on January 6.",
    "This is significant information and it is the first time that it has been revealed, and it comes after Jim Jordan has been incredibly evasive as to the communication he's had with the former president on January 6th.\"",
    "The committee is trying to figure out a way to get information from these Republican members of Congress that they believe played at least some sort of a role in the violence that took place on January 6th.\"",
    "\"Of course, Jordan, one of the leading Republicans, was attempting to get in the way of the certification of the election results that day.",
    "\"The January 6th committee is very interested in what Jim Jordan was talking about when he talked to the former president,\" added Nobles.",
    "He also told the House Rules Committee at one point that he thought the only time he spoke to the former president was after the attack.",
    "Nobles then explained what relevance this might have to the House Select Committee.",
    "That directly contradicts what we're learning, and also what he said today.",
    "And there are members of the Rules Committee making note of that.\"",
    "\"Give us the timeline,\" said anchor Jake Tapper.",
    "He voted to object to the election results.",
    "\"That's something he's never said before.",
    "\"That call lasted for ten minutes.",
    "\"When did this call take place?",
    "What does it tell us?\"",
    "Watch below:"
  ]
}