{
  "id": 1963,
  "mediaId": 6449,
  "date": "2022-02-07",
  "headline": "‘Breadcrumbs Lead to Speaker’s Office,’ Rep. Jim Banks Warns as GOP Slams Capitol Police Leadership Over Capitol Riot",
  "image": "https://live-daily-signal.pantheonsite.io/wp-content/uploads/GettyImages-1230454306-1024x532.png",
  "link": "https://www.dailysignal.com/2022/02/07/gop-jim-banks-pelosi-capitol-police-january-6-riot/?utm_source=rss&utm_medium=rss&utm_campaign=gop-jim-banks-pelosi-capitol-police-january-6-riot",
  "mediaOutlet": "Daily Signal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Margaret Olohan",
  "authorUrl": "https://www.dailysignal.com/author/mary-margaret-olohan/",
  "termIds": [
    0
  ],
  "sentences": [
    "Rep. Jim Banks heavily criticized House Speaker Nancy Pelosi for her failure to hand over key documents related to the Jan. 6 Capitol riot, saying in a Monday interview that Republican lawmakers believe the severity of the riot was due to a “systemic breakdown and failure at the highest levels of the Capitol Police.”\nThe Indiana Republican, who is on a panel of GOP lawmakers that is unofficially investigating the riot, spoke with The Daily Signal following an Axios report headlined “GOP’s shadow Jan. 6 committee targets Capitol Police ‘negligence.’”\nBanks criticized the article and strongly disputed any implication that Republicans are focusing negative attention on Capitol Police officers themselves, noting that Republicans believe it is the leadership of the police force that was at fault.",
    "“We’ve found that we’ve had broad support from the United States Capitol Police officers, the rank-and-file officers who know that they deserve more and better from their leadership and who know that leading up to Jan. 6 and on Jan. 6, there were systemic breakdowns and failure at the highest levels of the Capitol Police that led to what happened,” Banks said, adding:\nAnd if we’re serious about preventing something like Jan. 6 from ever happening again, we need to look at what happened there and make those changes so that we can prevent it.",
    "“We’ve learned a lot and we’re nearing the end of our interview process,” the Indiana congressman said, promising that Republicans will publish a report containing key findings of their interviews and make recommendations for House Minority Leader Kevin McCarthy of California, whom Republicans hope will be the next speaker of the House.",
    "They had outdated and in some cases expired equipment.”\nIt is “incredibly” baffling that the officers were not trained for “a riot or a large, violent crowd at the United States Capitol,” Banks said, particularly in light of the rioting and protesting that had taken place previously in both the nation’s capital and across the country.",
    "Banks characterized the investigation by House Democrats’ Jan. 6 select committee as a “political witch hunt.” Banks said that both he and Rep. Jim Jordan, R-Ohio, were “denied the opportunity to serve on the committee” because they questioned why Pelosi refused to turn over documents related to decisions made on the day of the riot.",
    "“When Jim Jordan is chairman of the House Judiciary Committee and has oversight of the FBI, it’ll be important that he and others in our party continue to ask these important questions and demand answers from this administration, who’s clearly not willing to provide information to members of Congress of both parties,” Banks said.",
    "“And as the public trust in this sham committee is diminished so substantially, it’s unfortunate that agencies like the FBI won’t share that information with members of the minority party.”\nHe added:\nThe way they’ve conducted this Jan. 6 commission clearly violates House rules.",
    "“The bottom line there is that the head of the Capitol Police union has told us and said very publicly that they weren’t prepared for what happened on Jan. 6 because of a breakdown in the intelligence gathering and dissemination process,” Banks told The Daily Signal.",
    "Without minority participation, without providing these records to the minority party, it’s a bad precedent for the future of the institution, but it is pretty clear that Nancy Pelosi and Liz Cheney aren’t interested in precedent or rule of law.",
    "Members of the Democrat-led Jan. 6 committee continue to ignore vital questions related to Capitol security, Banks said, noting that Republicans have interviewed dozens of Capitol Police officers and others on this topic.",
    "“The breadcrumbs lead to the speaker’s office,” he told The Daily Signal, adding:\nShe’s covering something up, and the American people deserve to know what those documents say, but so far she’s refused to hand them over.",
    "She doesn’t want to release them because at the end of the day, no matter what those documents say, I imagine they deviate from the political witch-hunt narrative that Nancy Pelosi and [Rep.] Liz Cheney [R-Wyo.]",
    "Questions about FBI involvement, both before and after Jan. 6, are serious questions that need to be answered, Banks said, but Democrats are not willing to share that information with the minority party.",
    "“We’re not attacking the Capitol Police, but we do believe strongly that there was negligence and a breakdown of leadership at the highest levels of the Capitol Police,” Banks told The Daily Signal.",
    "“And even though they had intelligence that something was going to happen on Jan. 6 for weeks beforehand, the Capitol Police officers were never made aware of that,” he continued.",
    "The congressman said that he has heard this same sentiment expressed “over and over” by both the head of the Capitol Police union and by individual officers on the force.",
    "But, he told The Daily Signal, there has been “no transparency.”\n“They will only give it to the committee,” Banks said of federal agencies and their relevant information.",
    "Republicans repeatedly have asked that information shared by federal agencies with the “sham” Jan. 6 committee also be shared with the minority party, Banks said.",
    "Banks, chairman of the Republican Study Committee, emphasized that he and fellow Republicans support the Capitol Police and the rank-and-file officers.",
    "The buck stops with her, and the question that deserves to be answered is why the National Guard wasn’t called to help protect the Capitol.",
    "To sound off, please email letters@DailySignal.com and we’ll consider publishing your edited remarks in our regular “We Hear You” feature.",
    "Instead, they’re just out to get their political opponents and weaponizing their power to go after those who they disagree with.",
    "They’re only interested in attacking and abusing their power to send their political opponents to jail.",
    "And I suspect that those documents in some way, shape, or form implicate the speaker of the house.",
    "Remember to include the url or headline of the article plus your name and town and/or state.",
    "Unfortunately, the Pelosi-Liz Cheney effort has no interest in pursuing those angles.",
    "“They weren’t equipped for what happened on Jan. 6.",
    "“That doesn’t mean that we’re not trying,” he said.",
    "Have an opinion about this article?",
    "Somebody made that decision.",
    "have painted about Jan. 6."
  ]
}