{
  "id": 1995,
  "mediaId": 2625,
  "date": "2022-02-09",
  "headline": "Fauci Says “Full-Blown” Pandemic Is Almost Over",
  "image": "https://www.motherjones.com/wp-content/uploads/2022/02/Screen-Shot-2022-02-09-at-12.01.07-PM.png?w=1200&h=630&crop=1",
  "link": "https://www.motherjones.com/mojo-wire/2022/02/fauci-pandemic-almost-over/",
  "mediaOutlet": "Mother Jones",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Reynolds",
  "authorUrl": "https://www.motherjones.com/author/matt-reynolds/",
  "termIds": [
    3217,
    4905,
    3925,
    253,
    6678,
    6433
  ],
  "sentences": [
    "“There will also be more people making their own decisions on how they want to deal with the virus.”\nThe remarks come as more states, and notably, Democratic-leaning ones, lift Covid restrictions—with some like New Jersey easing mandates in schools and others loosening mandates on businesses.",
    "But some on the right, particularly GOP politicians who have cast the nation’s top expert on infectious diseases as a political bogeyman, have already weaponized Fauci’s cautious optimism as evidence that their vociferous opposition to Covid restrictions was justified all along.",
    "As the number of new Covid cases continues to plunge across the country, Dr. Anthony Fauci has offered his most hopeful assessment of the pandemic yet, telling the Financial Times this week that the United States was “certainly” exiting the most dangerous phase.",
    "“As we get out of the full-blown pandemic phase of Covid-19, which we are certainly heading out of, these decisions will increasingly be made on a local level rather than centrally decided or mandated,” Fauci said in a new interview.",
    "Nor does it take into account the success that scientifically backed Covid safety measures have had in helping to reduce new infections.",
    "But the Biden administration is increasingly under pressure to deliver a road map for what the end of the pandemic could look like.",
    "https://t.co/zsJ6fO2MmI\n— Ted Cruz (@tedcruz) February 9, 2022\nGlenn Youngkin campaigned on ending mask mandates and won.",
    "That, of course, fails to recognize the inherently evolving nature of what it means to be in a pandemic.",
    "He also expressed optimism that Covid restrictions, including mask mandates, could soon be lifted.",
    "For now, the White House has stood by the CDC’s recommendations on mask-wearing in schools.",
    "And now suddenly, Democrat politicians are dropping their mask mandates too.",
    "Pandemic-weary Americans are sure to welcome the new signs of hope.",
    "But that isn’t the point of any of this now, is it?",
    "— Rep. Jim Jordan (@Jim_Jordan) February 9, 2022",
    "Why are none of these hypocrites wearing masks?",
    "Science!"
  ]
}