{
  "id": 2060,
  "mediaId": 2523,
  "date": "2022-02-05",
  "headline": "Trump’s GOP: Party further tightens tie to former president",
  "image": "https://www.dailynews.com/wp-content/uploads/2022/02/Republican_Meeting_27946-1.jpg?w=1024&h=682",
  "link": "https://www.dailynews.com/2022/02/05/trumps-gop-party-further-tightens-tie-to-former-president/",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.dailynews.com/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "In censuring two GOP lawmakers who have criticized Trump and joined the committee probing the Jan. 6 insurrection, the RNC channeled the former president in assailing the panel for leading a “persecution of ordinary citizens engaged in legitimate political discourse.”\nPence, whose life was threatened on Jan. 6, is one of a few Republicans making moves toward a 2024 campaign regardless of whether Trump wages a comeback bid.",
    "One offered this message to prospective small-dollar donors on Tuesday: “YOU must stand with President Trump and YOUR Party.”\nIn speeches made minutes before party leaders voted to censure Cheney and Kinzinger, McDaniel and co-chair Tommy Hicks did not mention Trump and stressed the need to unify for the 2022 midterm elections.",
    "This week, however, she backed an effort by Trump loyalists to censure Reps. Liz Cheney, R-Wyo., and Adam Kinzinger, R-Ill., a move triggered almost entirely by their fight against Trump’s enduring influence in the party beyond the Jan. 6, 2021, attack on the Capitol.",
    "The censure, which passed on a voice vote Friday, says the two “support Democrat efforts to destroy President Trump more than they support winning back a Republican majority in 2022.”\nMcDaniel’s shift coincides with the RNC’s reliance on Trump for fundraising.",
    "“Leading up to 2020, or most of the time Trump was in office, he sent around his minions to populate the committee with very loyal Trump folks in a lot of red states,” said Bill Palatucci, an RNC committeeman from New Jersey and frequent Trump critic.",
    "“We are walking away from the Commission on Presidential Debates because it’s a biased monopoly that does not serve the best interests of the American people.”\nThe eventual 2024 nominee, however, will have final say on whether to participate.",
    "Though the committee’s moves demonstrated a sustained loyalty to the former president, outside the winter meeting the censure was condemned by opponents as divisive and contrary to frequent appeals from leaders to expand the party’s tent.",
    "That’s what we have to do.”\nBut a stark divide has emerged between veterans like Hough, who are devoted to the GOP as an institution, and a larger group of Trump-aligned newcomers, who argue they’re bringing new energy to the party.",
    "“We should be focused on what the voters are focused on,” said Caleb Heimlich, chair of the Republican Party in Washington state, where two of three Republican House members voted to impeach Trump following the Jan. 6 insurrection.",
    "“It’s all Trump all the time coming out of there.”\nA year ago, just after President Joe Biden’s inauguration, RNC Chair Ronna McDaniel declined to encourage Trump to run again when asked, citing party rules that require neutrality.",
    "But as Republican officials from across the country gathered in Utah this week for the RNC’s winter meeting, party leaders devoted considerable energy to disciplining Trump’s rivals and embracing his grievances.",
    "“We can change the bylaws.”\nThe loyalty to Trump is a fresh reminder that one of America’s major political parties is deepening its alignment with a figure who is undermining the nation’s democratic principles.",
    "Harmeet Dhillon, an RNC committeewoman from California, said it was imperative to send a clear message about Cheney and Kinzinger for her and the legions of volunteers working to elect Republicans this year.",
    "“It’s a sad day for my party — and the country — when you’re punished just for expressing your beliefs, standing on principle, and refusing to tell blatant lies.”\nPeoples reported from New York.",
    "By Sam Metz and Steve Peoples | Associated Press\nSALT LAKE CITY — In 2016, Donald Trump overtook the Republican National Committee through a shock and awe campaign that stunned party leaders.",
    "“And they still enjoy that strong majority.”\nThe RNC’s continued embrace of Trump more than two years before the 2024 election is a decided shift from the party’s position in past elections.",
    "“I do not want to elect people in the midterms who do what these two did.”\nBeyond the censure, Republicans set in motion a rules change rooted in another of Trump’s longstanding grievances.",
    "A measure advanced that would force presidential candidates to sign a pledge saying they will not participate in any debates sponsored by the Commission on Presidential Debates advanced.",
    "Away from the ballrooms of the RNC meeting, Pence rebuked Trump on Friday, saying he had “no right to overturn the election” and that his former boss was ”wrong” to suggest otherwise.",
    "“Clearly, there’s a bias that didn’t exist in the past,” said Tim Miller, who previously worked for the Republican National Committee and has since emerged as a fierce Trump critic.",
    "As the earliest stages of the next presidential contest take shape, their actions made clear that choosing to serve Trump and his political interests remains a focus for the party.",
    "“If President Trump decides he’s running, absolutely the RNC needs to back him, 100%,” said Michele Fiore, an RNC committeewoman who has represented Nevada since 2018.",
    "If he were to run for the White House again, Trump is such a powerful force with the GOP base that he probably wouldn’t need the party’s help to become the nominee.",
    "Indeed, this week’s focus on debates that won’t take place until 2024 and on anti-Trump Republicans overshadowed the party’s preparations for the midterm elections.",
    "More recently, he has explicitly said that former Vice President Mike Pence could and should have overturned the election results, something he had no power to do.",
    "“There’s probably some disagreement there,” said Bruce Hough, a longtime RNC member from Utah who lost to a Trump ally in a race for party co-chair last year.",
    "“The midterms are about a party electing its leaders, and what Adam Kinzinger and Liz Cheney did here is defy their party’s leadership,” Dhillon said.",
    "“It shows that Trump and Trumpism has overtaken the RNC.”\nCheney in a statement said the move demonstrated how the party had become hostage to Trump.",
    "In 2012 and 2016, for example, Reince Priebus as RNC chair went to great lengths to ensure each of the candidates was treated equally.",
    "In fact, the GOP’s bylaws specifically require neutrality should more than one candidate seek the party’s presidential nomination.",
    "That’s notable because the GOP could reclaim control of at least one chamber of Congress and several governor’s mansions.",
    "The RNC, which controls the party’s rules and infrastructure, is under no obligation to support Trump again.",
    "“The GOP I believe in is the party of freedom and truth,” the frequent Trump critic tweeted Friday.",
    "As he fought to stay in the White House, Trump sparked a violent insurrection at the U.S. Capitol.",
    "“I’ve been talking to voters in Washington state, traveling around and nobody talks about Cheney.",
    "The party has issued hundreds of fundraising appeals since Trump left office evoking his name.",
    "The party sanctioned 12 debates, including early rounds that featured up to 17 candidates.",
    "But this week, Trump’s grievances with his Republican critics took center stage instead.",
    "The RNC’s discipline “shows more about them than us,” Kinzinger said in an interview.",
    "She also discouraged attacks on those Republicans who voted for Trump’s impeachment.",
    "In 2020, the party was obligated to support him as the sitting Republican president.",
    "“The RNC has to provide a level playing field for any and all comers for president.",
    "It is expected to be voted on when RNC members convene again in August.",
    "Their chief loyalty, however, seems to be to the former president.",
    "Another Republican eyeing a White House campaign, Maryland Gov.",
    "Heading into 2024, however, the Republican Party has a choice.",
    "Larry Hogan, decried the RNC’s push to punish Trump’s rivals.",
    "“We are not walking away from debates,” McDaniel said.",
    "That kind of dissent was rare in Salt Lake City.",
    "Some Republicans said that’s beside the point.",
    "That’s a D.C. topic.”\nOthers disagreed.",
    "That’s our job."
  ]
}