{
  "id": 2282,
  "mediaId": 2677,
  "date": "2022-02-04",
  "headline": "Records: Trump, Jordan spoke at length on morning of Jan. 6",
  "image": "https://www.mercurynews.com/wp-content/uploads/2022/02/GettyImages-1131707315.jpg?w=1024&h=676",
  "link": "https://www.mercurynews.com/2022/02/04/records-trump-jordan-spoke-at-length-on-morning-of-jan-6/",
  "mediaOutlet": "San Jose Mercury News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "CNN.com Wire Service",
  "authorUrl": "https://www.mercurynews.com/author/cnn-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We would like to discuss each such communication with you in detail.”\nThe committee also wants to speak with Jordan about meetings he had with White House officials and Trump in the months between the 2020 presidential election in November and the Jan. 6 attack about “strategies for overturning the results of the 2020 election.”\nPrior to the panel asking for Jordan’s voluntary cooperation, he was identified as one of the lawmakers who sent a text message to then-White House chief of staff Mark Meadows that the committee has in its possession.",
    "By Ryan Nobles, Annie Grayer and Zachary Cohen | CNN\nThe House select committee investigating the Capitol insurrection is now in possession of White House records that provide new details about a phone call Donald Trump made to Republican Rep. Jim Jordan on Jan. 6, 2021 — as the investigation drills down on the former President’s communications that day and questions have long swirled around calls between him and lawmakers.",
    "But what I know is that I spoke with him all the time.”\nIn the committee’s letter to Jordan seeking a voluntary interview, Democratic Rep. Bennie Thompson, who chairs the panel, said investigators specifically wanted to ask Jordan about his communications with the former President.",
    "But House Speaker Nancy Pelosi rejected McCarthy’s selection of Jordan, along with GOP Rep. Jim Banks of Indiana, because she said their appointments could impact the “integrity of the investigation.”\nThe committee has long viewed Jordan as a top target for its investigation.",
    "When Jordan indicated earlier this month that he doesn’t plan to cooperate and dismissed the committee’s investigation as illegitimate, a spokesperson for the panel said that Jordan is a “material witness” because he has admitted to speaking directly with Trump on Jan. 6.",
    "When asked on Friday about the White House records, Jordan told CNN that he had multiple calls with Trump on Jan. 6 but could only confirm that he spoke with Trump after he left the House floor and did not remember whether they spoke that morning.",
    "Jordan has previously said that he would cooperate with the committee’s investigation, but it now appears that the Trump team has persuaded him to try to hide the facts and circumstances of January 6th,” the spokesperson said.",
    "These call logs are among the documents the National Archives turned over to the House select committee investigating the riot after Trump last month lost his bid at the Supreme Court to keep them secret.",
    "Jordan later spoke to request a roll call vote on the Arizona challenge at 10:27 p.m. when lawmakers returned to the chamber after being evacuated as rioters interrupted the congressional proceedings.",
    "The panel’s letter to Jordan also sought to learn more about any communications he had with Trump’s allies, legal team and staffers about potential organizing, planning or strategizing around Jan. 6.",
    "The message, which Jordan forwarded to Meadows on Jan. 5, outlined a legal theory that then-Vice President Mike Pence had the authority to stand in the way of the certification of the 2020 election.",
    "A key focus of the committee’s investigation has been on the runup to the insurrection and the myriad ways Trump and his allies, including those in Congress, tried to overturn the election results.",
    "Since Jordan acknowledged last summer that he spoke to Trump on the phone that day, the Ohio Republican and Trump loyalist has waived off questions about it or been inconsistent in his answers.",
    "The new details about the morning phone call come as the committee is debating whether to move forward with a subpoena for Jordan after he refused to voluntarily appear for an interview.",
    "The records have been crucial for congressional investigators as they try to build a complete narrative of what happened that day, and the call logs help to deepen that understanding.",
    "The committee is still weighing whether it will take the next step and issue Jordan a subpoena, a move it is also considering with McCarthy and GOP Rep. Scott Perry of Pennsylvania.",
    "That afternoon, Jordan took to the House floor to object to the certification of President Joe Biden’s Electoral College win, and pro-Trump supporters attacked the US Capitol.",
    "Two sources who have reviewed the call records tell CNN that Trump spoke on the phone at the White House residence with Jordan for 10 minutes on the morning of Jan. 6.",
    "At a House Rules Committee hearing in December, Chairman Jim McGovern, a Democrat from Massachusetts, specifically asked Jordan when he spoke with Trump that day.",
    "And I’ve been clear about that.”\nMonths earlier, in July, he told a local reporter he could not recall when he spoke to Trump or how many times they talked.",
    "The panel met on Thursday to discuss their options but did not settle on next steps when it comes to efforts to get their fellow lawmakers to cooperate.",
    "One entry in the White House records shows a request from Trump to get Jordan on the phone from the White House residence on the morning of Jan. 6.",
    "“I know I talked to him after we left off the floor,” adding that he did not remember how long his calls with the former President lasted that day.",
    "“We understand that you had at least one and possibly multiple communications with President Trump on January 6th,” Thompson wrote in December.",
    "When McGovern pressed Jordan again and asked him to confirm that the call did not occur before or during the attack, Jordan replied: “Right.",
    "Jordan was originally selected by House Minority Leader Kevin McCarthy to be one of five GOP members serving on the committee back in July.",
    "The text message is just one example of how Jordan provided a megaphone to the narrative that the election had been stolen from Trump.",
    "On Friday, Jordan said, “I don’t recall,” when asked specifically if he spoke with Trump in the morning before the violence started.",
    "In August, Jordan was among a group of Republican lawmakers whose phone records the committee asked various companies to preserve.",
    "At the time, Jordan warned about the precedent the panel would be setting if it went after sitting members of Congress.",
    "The spokesperson also suggested, without evidence, that Trump and his team are the reason Jordan is not cooperating.",
    "According to footage of House proceedings that day, Jordan spoke on the floor for five minutes starting at 1:32 p.m.",
    "“I talked to the President a number of times that day, but I don’t remember the times,” Jordan said.",
    "Jordan’s previous recollections of his conversations with Trump on Jan. 6 have been inconsistent.",
    "ET on Jan. 6, 2021, to give a speech to thousands of his supporters gathered at the Ellipse.",
    "And if we are not in good standing with it, then I mean, we probably won’t do it.”",
    "A spokeswoman for Trump did not immediately respond to a request for comment.",
    "ET during the debate over whether to reject Biden’s electors from Arizona.",
    "Chairman Thompson acknowledged on Thursday that it’s a complicated issue.",
    "“I talked to the President after the attack,” Jordan said at the time.",
    "“You know, we have to see whether or not it’s ever been done before.",
    "Records show Trump did not leave the White House until 11:40 a.m.",
    "A second entry shows that the length of the call was 10 minutes.",
    "“You know, you have to respect this institution,” he told CNN.",
    "I think after?” he told the Spectrum News TV channel in Ohio.",
    "“I don’t know if I spoke with him in the morning or not.",
    "“Uh, I’d have to go — I spoke with him that day after.",
    "I mean I don’t know when those conversations happened.",
    "If it had, on what authorities.",
    "So, we just want to be right.",
    "I’d have to go back.",
    "I just don’t know.",
    "“Mr."
  ]
}