{
  "id": 236,
  "mediaId": 2690,
  "date": "2022-02-23",
  "headline": "‘NeverTrump Convention’ Days Away – Liz Cheney Set To Be Keynote Speaker",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/nevertrump-convention-days-away-liz-cheney-set-to-be-keynote-speakers-473448/",
  "mediaOutlet": "teapartyorg.ning.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "On the Principles First’s website, it asserts that the convention will be “focused on discussing and advancing a more principled politics in the United States.”\n“We look forward to bringing together conservative and independent speakers, thought leaders, and grassroots activists for two days of panels, speeches, networking, and substantive discussion about the meaning of conservatism today and the future of our movement,” the description reads.",
    "After receiving less than 1.1% of the vote against Trump in Iowa, he withdrew his candidacy and then slammed the GOP, saying it’s “not a party, it’s a cult.”\nSure seems like the type of guy one might want to engage in a “substantive discussion about the meaning of conservatism today and the future of our movement.” Thank goodness the “Principles First” convention is just around the corner.",
    "There will be Denver Riggleman in attendance who is essentially a disgruntled former US Rep. from Virginia with a Twitter feed dedicated to his position against American conservatism and Trump:\nLooks like the parasite done took over the host https://t.co/GDfcjlTkKX\n— Denver Riggleman (@RepRiggleman) February 4, 2022\nHow far can you fall?",
    "https://t.co/pHWB0MwHxl\n— Denver Riggleman (@RepRiggleman) February 21, 2022\nAlso attending will be the notorious Alexander Vindman, the former National Security Council official, whose whistleblower report on then-President Trump’s phone call with Ukrainian President Volodymyr Zelensky led to Trump’s first impeachment.",
    "I’m sure the organizers of CPAC are bummed to think of all the conservatives they’re losing who would normally attend their event to hear actual conservatives and American icons like Ted Cruz, Rick Scott, Marsha Blackburn, Jim Jordan, Ronny Jackson, Mark Levin, Glenn Beck and, oh, President Trump himself, speak.",
    "Upon further inspection, however, you’ll notice that further down on the page, the first event partner listed is The Bulwark, a RINO outlet founded by two of the most rabid NeverTrumpers, Bill Kristol and Charlie Sykes, both of which are also featured speakers.",
    "In addition to the aforementioned speakers, there will also be an appearance from Georgia Secretary of State Brad Raffensperger who infamously sparred with President Trump himself over certifying the election results in Georgia.",
    "He decided he didn’t like President Trump and instead of appreciating the good Trump did while in office, he went on a mission to bring him down, even going as far as to attempt to run against him in the 2020 primaries.",
    "There will also be in attendance various minor-league former office-holders who have found differing levels of post-electoral fame by speaking out against Trump, some of which will also be speaking at the event.",
    "That’s because despite spending a decent chunk of money on his campaign, and even apologizing for his past claiming he isn’t a racist but “certainly” has “said some racist things,” he got virtually no support.",
    "According to The Hill, Principles First is apparently attempting to be a counter-programming event for the annual Conservative Political Action Conference (CPAC) which is also set to take place this weekend.",
    "(TeaParty.org Exclusive) – This coming weekend a political event is scheduled to take place that is sure to be the most poorly attended, underwhelming, anti-climatic event of the year.",
    "The so-called “Principles First” convention is going to be a gathering of Never Trump RINOs who won’t be doing a darn thing to further the cause of conservatism despite pretending to.",
    "These two just so happen to be the only GOP members on Nancy Pelosi’s sham Jan. 6 committee thanks to the dedication to hating President Trump.",
    "As you should expect, the most prominent speakers at this charade will be GOP Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois.",
    "Not only is the Principles First convention not satire but it’s taking place at the National Press Club in Washington DC.",
    "One such individual is Joe Walsh, former Illinois Republican who served one term in the House of Representatives.",
    "So will Capitol Police Office Harry Dunn, who dramatically testified before the Jan. 6 committee.",
    "https://t.co/wfK2qwf7Is\n— Denver Riggleman (@RepRiggleman) February 12, 2022\nConspiracy LLC.",
    "Tom Nichols, the so-called “conservative” in residence at The Atlantic, will be featured.",
    "After his brief stint in Washington, he became a controversial conservative radio host.",
    "It will surely be amusing to see how the turnout at these two events compare.",
    "When Trump officially announces for 2024, euphoria and money will follow.",
    "The entire charade is truly just a who’s who of the NeverTrump movement.",
    "Then, realize she will say and do anything to be in the spotlight.",
    "Geoff Duncan will also be making an appearance.",
    "You probably haven’t even heard of him.",
    "You can’t make this stuff up.",
    "Who are these RINOs kidding?",
    "Cogent people laugh at her.",
    "So much money to be made.",
    "Laughter turns to horror.",
    "Needs a boost in profile.",
    "Those are the headliners.",
    "Ignorance supernova.",
    "Georgia Lt. Gov.",
    "It’s a business.",
    "Copyright 2022.",
    "Goes on Tucker.",
    "TeaParty.org"
  ]
}