{
  "id": 2486,
  "mediaId": 2589,
  "date": "2022-02-09",
  "headline": "RNC chief on censuring Cheney: Disagreement is welcome but you can't side with Nancy Pelosi",
  "image": "https://hotair.com/wp-content/uploads/2022/02/r-1110x740.jpg",
  "link": "https://hotair.com/allahpundit/2022/02/09/rnc-chief-on-censuring-cheney-disagreement-is-welcome-but-you-cant-side-with-nancy-pelosi-n447472",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allahpundit",
  "authorUrl": "https://hotair.com/author/allahpundit",
  "termIds": [
    0
  ],
  "sentences": [
    "Instead, Bossie’s version said the committee had a disregard for “minority rights” and “due process” and seemed “intent on advancing a political agenda to buoy the Democrat Party’s bleak electoral prospects.”\nIt is unclear how the words “legitimate political discourse” came to enter the document as it was edited in Salt Lake City by Bossie, McDaniel and others.",
    "The RNC evidently believes that an investigation of an impromptu putsch attempt instigated by two months of disinformation about election-rigging and dubious legal machinations by the highest official in the land is fine provided that it doesn’t extend to … any of the disinformation or legal machinations.",
    "McDaniel goes on to say that the RNC is irked at Liz Cheney and Adam Kinzinger not because they disagree with Trump about January 6 but because they’re willing to serve on a committee made illegitimate by the fact that Nancy Pelosi refused to accept Kevin McCarthy’s appointees to that committee.",
    "McDaniel then says in the clip that the “legitimate political discourse” she has in mind refers to the January 6 committee branching out from the insurrection itself to investigate nonviolent matters, even subpoenaing RNC members who weren’t at the Capitol that day to do so.",
    "pic.twitter.com/AvDdD86vOm\n— Mediaite (@Mediaite) February 9, 2022\nLet’s begin with the fact that disagreement within the GOP not only isn’t welcome, it’s apt to earn you a primary challenge backed by the leader of the party if you happen to disagree on the wrong subject.",
    "According to WaPo, it’s unclear who inserted that phrase into the resolution and why:\nThe phrase “legitimate political discourse” did not appear in an original draft of the resolution by top Trump ally David Bossie, according to a copy reviewed by The Washington Post.",
    "Several RNC members said it was frustrating that, aside from a small number of resolution committee members on Thursday afternoon, no one else saw the text of the resolution until 1:38 a.m. Friday, when the document showed up in inboxes of the committee’s members.",
    "@SpeakerPelosi on Republicans: \"They seemed to have reached rock bottom with their statement that what happened on January 6th was normal political discourse…legitimate political discourse…Take back your party from this cult.\"",
    "In modern American history and maybe in all of American history, there’s never been a party in which disagreement is less tolerated than in the current GOP, an autocracy and personality cult masquerading as a political party.",
    "Brian Kemp stands a real chance of being a one-term governor because he disagreed that Georgia law allowed him to throw out the votes of his constituents and declare Trump the winner of the state’s electoral votes in 2020.",
    "Which is a message both Mitch McConnell and Kevin McCarthy are eager to send before the midterms:\nKevin McCarthy today walked at a leisurely pace and then actually stopped and spoke to reporters.",
    "(@ArthurDelaneyHP) February 9, 2022\n“Nancy Pelosi is anti-insurrection so we must be anti-anti” would be a fine summary of the mentality that drives Republican negative partisanship in this era.",
    "She goes on to clarify that the reference to “legitimate political discourse” in the censure resolution that annoyed so many Senate Republicans wasn’t a reference to the riot itself.",
    "The “legitimate political discourse” McDaniel has in mind, in other words, is a probable federal offense aimed at preventing the rightful transfer of power to the new administration.",
    "If anything, Cheney and Kinzinger are doing the RNC a favor by serving on the committee because they’re signaling to swing voters that one can be a Republican and anti-insurrection.",
    "“When you cancel 22 primaries & caucuses to protect your leader, you make clear that ‘disagreement’ in the GOP is not welcome,” Walsh commented today in response to the clip above.",
    "Walsh mounted a longshot presidential campaign against Trump two years ago only to find that he wouldn’t be given the courtesy of appearing on a ballot in some states.",
    "Remember, McDaniel’s organization adopted the identity of Trumpism so totally in 2020 that it didn’t bother to propose a policy platform at that year’s convention.",
    "Which raises the question: Does Ronna McDaniel think Trump’s stolen-election propaganda during the “stop the steal” campaign was “legitimate political discourse”?",
    "The RNC members subpoenaed by the committee are among the Trump electors who signed documents falsely certifying that Trump had won their home states in 2020.",
    "She rejected two of the five, Jim Banks and Jim Jordan, both of whom are Trump cronies and therefore unsuited to a committee tasked with investigating Trump.",
    "And it appears they did so in coordination with the Trump campaign as part of the scheme to overturn the election that led to the attack on the Capitol.",
    "Ronna McDaniel isn’t a bad person but she’s willing to serve bad people to gain political clout, an ailment more common than COVID in America 2022.",
    "“RESOLVED, That the Republican Party has and will continue to enthusiastically support the President’s America-first agenda,” the resolution read.",
    "\"Disagreement in our party is welcome,\" claimed @GOPChairwoman while defending the RNC's vote to censure both Reps. Liz Cheney and Adam Kinzinger.",
    "But when you realize why the committee wants to speak to those members, it’s not so sinister after all (and McDaniel surely knows it).",
    "It was legally protected speech under the First Amendment, no doubt, but what’s legal and what’s proper are two different things.",
    "Tea partier turned anti-Trumper Joe Walsh knows firsthand how little disagreement is tolerated in the Trump-era GOP.",
    "He said “I agree” when @mkraju asked about Mitch McConnell’s description of Jan 6 as a violent insurrection.",
    "Go figure that no one at the RNC wants to take ownership of the phrase after the backlash this weekend.",
    "There’s so much that’s false or misleading in these 51 seconds I almost don’t know where to begin.",
    "\"But when you have two members who are willing to go with Nancy Pelosi … that's a step too far.\"",
    "It was not read or presented aloud before it was voted on nine hours later.",
    "The RNC platform, in other words, boiled down to: Whatever Trump wants.",
    "McCarthy pulled the other three Republican members after she did that.",
    "Here’s Pelosi offering a rare bit of good advice to the other party.",
    "pic.twitter.com/LNfPBi4fuU\n— CSPAN (@cspan) February 9, 2022",
    "But Pelosi didn’t reject all of McCarthy’s appointees.",
    "That should be — and might be — a federal crime.",
    "Bossie did not respond to requests for comment.",
    "Or maybe I’m giving her too much credit.",
    "How does she know that, though?",
    "Is that McDaniel’s position?",
    "Which sounds sinister!",
    "— Arthur Delaney ????",
    "."
  ]
}