{
  "id": 2564,
  "mediaId": 2730,
  "date": "2022-02-10",
  "headline": "More Jan. 6 Hysteria: Democrats Are Trying to Get Duly Elected Republicans Banned from Office",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/238/ddc5639e-01aa-41ba-9812-5827470ac498.png",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/02/10/more-jan-6-hysteria-democrats-are-trying-to-get-duly-elected-republicans-banned-from-office-n2603140",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    0
  ],
  "sentences": [
    "In the section where Calkins is asked to explain how \"the following facts are known to me and lead me to believe that the individual listed above is ineligible to be a candidate for this office,\" there isn't a whole lot of detail provided.",
    "pic.twitter.com/pF7P2fw0kn\n— Marc E. Elias (@marceelias) December 21, 2021\nElias was thoroughly mocked last April for a since-deleted tweet that claimed Georgia voters would not know how to properly submit their ID to vote by mail.",
    "Rep. Jim Banks, who represents Indiana's 3rd Congressional District, responded on Thursday night to a \"frivolous filing\" from his Democratic opponent, Aaron \"AJ\" Calkins, that seeks to make Banks ineligible for his office.",
    "Trying and failing to ban Trump from holding office again through his second impeachment trial, which took place after he had already left office and President Joe Biden was already sworn in, is also not going away.",
    "My prediction for 2022: Before the midterm election, we will have a serious discussion about whether individual Republican House Members are disqualified by Section 3 of the 14th Amendment from serving in Congress.",
    "While Banks voted to object to the certification of the 2020 presidential election in Pennsylvania and Arizona, citing election rule changes in those states, objecting to presidential elections is nothing new.",
    "Lonas noted that \"Cawthorn filed a lawsuit after a group of liberal activists began attempting to get him barred from office due to what they say were disqualifying actions leading up to the Capitol riot.\"",
    "He is currently involved in partisan redistricting efforts from Democrats in their quest to gerrymander their way into suffering as least catastrophic losses as possible come this November.",
    "\"Unfortunately, Democrats have tried to turn a serious tragedy into a political tool to strip Americans of their civil liberties and even their right to vote for their preferred candidate.",
    "As Lexi Lonas reported on Wednesday for The Hill, the North Carolina Election Board says it has the power to ban Rep. Madison Cawthorn (R-NC) from running for office over January 6.",
    "Democrats’ top elections lawyer promoted the same bogus theory in a clear attempt to ban President Trump from office and disenfranchise 74 million Americans,\" he continued.",
    "Terry McAuliffe (D-VA) in his failed gubernatorial run for 2021 and has also filed challenges to election integrity laws passed in the states, such as those in Georgia.",
    "The Republican members who serve on the select committee, Reps. Liz Cheney (WY) and Adam Kinzinger (IL), the former who is the vice chair, were both selected by Pelosi.",
    "Banks was one of several members that House Minority Leader Kevin McCarthy (R-CA) named to serve on the select committee, and would have been the ranking member.",
    "As John Kruzel reported for The Hill last month, on the anniversary of January 6, \"Democrats quietly explore barring Trump from office over Jan.",
    "\"Since Nancy Pelosi blocked me from the sham January 6th Committee, I've been leading the fight against their partisan harassment campaigns.",
    "They didn't stop with trying to get former President Donald Trump banned from office, and are now going after other Republican lawmakers.",
    "Last December, Democratic election lawyer Marc Elias predicted there would be such challenges for the upcoming midterms.",
    "A copy of the filing challenge that was obtained by Townhall was filed by Calkins on February 6, 2022 in Allen County.",
    "This is a joke allegation that will be quickly dismissed and ignored by voters in northeast Indiana,\" Banks said.",
    "Rep. Bennie Thompson (D-MS), who chairs the select committee, objected to the 2004 presidential election results.",
    "Banks has criticized at length how the select committee is compromised of no members named by the minority party.",
    "When House Speaker Nancy Pelosi (D-CA) vetoed Banks and Rep. Jim Jordan (R-OH), McCarthy pulled all his picks.",
    "Scott Applewhite\nDemocrats continue to be whipped up in their frenzy over the Capitol riot on January 6.",
    "Banks was first elected to his seat in 2016, by 70.1 percent to Democratic Tommy Schrader's 23 percent.",
    "\"I’m running for re-election to fight against Joe Biden’s dangerous agenda and champion Hoosier values.",
    "Calkins had merely written \"Violation of 14th Amendment Supporting An Insurrection.\"",
    "The congressman also spoke to Democratic efforts to ban Trump from office.",
    "The January 6th select committee also found its way into Banks' statement.",
    "Rep. Banks had nothing but strong words for the challenge.",
    "That's why they're targeting me, but I won't back down.\"",
    "He won his most recent race in 2020 by 67.7 percent.",
    "Like Calkins, they are citing the 14th Amendment.",
    "A notary public stamped it the following day.",
    "Banks is not the only member targeted.",
    "Elias was hired by former Gov.",
    "We may even see litigation.",
    "Source: AP Photo/J.",
    "6.\""
  ]
}