{
  "id": 2639,
  "mediaId": 8258,
  "date": "2022-02-10",
  "headline": "WATCH As Conservative Rock Star SLAM DUNKS On Marxist Democrats For Doing THIS",
  "image": "https://americasfreedomfighters.com/wp-content/uploads/2022/02/2238.jpg",
  "link": "https://americasfreedomfighters.com/marxist-democrats/",
  "mediaOutlet": "americasfreedomfighters.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AFF CEO/EDITOR-IN-CHIEF",
  "authorUrl": "https://americasfreedomfighters.com/author/clark-kent/",
  "termIds": [
    0
  ],
  "sentences": [
    "There’s all these Democrat governors who are relaxing the mask mandate on kids, and relaxing some of the mandates, all because they saw what happened in Virginia a few months ago — when Glenn Youngkin ran on this issue and won that election in a blue state,” Jordan said.",
    "As I wrote in my last article, my opinion is that the dems are making this move now because they are desperate to try and improve their chances of avoiding the imminent WIPEOUT coming their way in the midterm elections.",
    "And here’s the other thing, Martha – here’s the other thing that everyone now understands: Everything we were told about this virus by the experts has turned out to be wrong.”\nSPOT ON!",
    "One of my favorites, the great Rep. Jim Jordan, R-Ohio, appeared on FOX News with Martha MacCallum and explained why Democratic governors are relaxing COVID-19 mandates.",
    "Here’s a partial transcript of the interview:\nJIM JORDAN: “The science didn’t change, the polls have changed.",
    "Please take a moment and share our articles with your friends, family and on all social media sites!",
    "Not going after these truckers – I mean they can’t bring gas to their truck, for goodness sake.",
    "“So I think that’s what is driving some of this; so that’s what needs to change.",
    "?It’s time to enjoy social media again… without the filthy Communist censorship!",
    "?Be sure to sign up for our FREE newsletter and we’ll keep you in the loop!",
    "Thank you, we appreciate it!",
    "This is ridiculous.",
    "God Bless.",
    "?",
    "?"
  ]
}