{
  "id": 2704,
  "mediaId": 2573,
  "date": "2022-01-31",
  "headline": "Republicans challenge CDC coronavirus mask, school guidelines for children",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Rochelle-Walensky.jpg",
  "link": "https://www.foxnews.com/politics/republicans-challenge-cdc-coronavirus-mask-school-guidelines-for-children",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marisa Schultz",
  "authorUrl": "https://www.foxnews.com/person/s/marisa-schultz",
  "termIds": [
    5530,
    2698,
    4838,
    4698,
    2065,
    1126,
    253
  ],
  "sentences": [
    "\"Many of America’s peer nations around the world — including the U.K., Ireland, all of Scandinavia, France, the Netherlands, Switzerland, and Italy — have exempted children, with varying age cutoffs, from wearing masks in classrooms with no evidence of an uptick in school outbreaks in those countries relative to schools in the U.S.,\" the lawmakers wrote.",
    "CDC'S WALENSKY HAD TO GOOGLE HER OWN WEBSITE WHEN ASKED ABOUT ADVANCING EQUITY IN THE PANDEMIC RESPONSE\nThe GOP leaders also say it's time to roll back the 14-day quarantine policy for day care and early child care centers that has created a \"logistical nightmare\" for parents when entire preschool classes are shut down abruptly for two weeks.",
    "\"There is no question, as we enter the third year of this pandemic, CDC’s guidelines and policies have failed to factor in — let alone prioritize — children’s social, emotional, and educational development,\" the Republicans wrote to Walensky in a letter obtained first by Fox News Digital.",
    "The lawmakers ask Walensky to schedule a staff briefing with House Oversight Committee Republicans by Feb. 7 to explain the science and justification around the ongoing restrictions that have kept kids out of classrooms and children's faces covered.",
    "EXCLUSIVE: House Republicans are challenging Centers for Disease Control and Prevention (CDC) coronavirus guidelines for children, saying the ongoing mask and school restrictions are harming kids and \"jeopardize an entire generation’s development.\"",
    "The letter points out that the European Centre for Disease Prevention and Control recommends against primary school children wearing masks and that the World Health Organization (WHO) says children under 6 should not be required to wear masks.",
    "Republican Whip Rep. Steve Scalise, R-La., and Rep. James Comer, R-Ky., led a letter to CDC Director Rochelle Walensky Monday urging her to roll back the guidelines on children for the sake of their mental, physical and emotional health.",
    "In addition to Scalise and Comer, the top Republican on the House Oversight Committee, the letter was signed by Reps. Jim Jordan of Ohio, Mark Green of Tennessee, Nicole Malliotakis of New York and Mariannette Miller-Meeks of Iowa.",
    "The lawmakers take aim at the mask guidelines for children 2 and older, saying they are hindering early childhood development and are out of step with mask requirements elsewhere.",
    "They say studies have shown that coronavirus transmission among children is low, and symptoms tend to be milder than for adults, \"yet, the CDC has refused to follow the science.\"",
    "\"These isolation policies are ineffective, especially in light of the transmission and infection rate for this age group,\" the Republicans wrote.",
    "The authors point to the devastating impacts school closures have had on students, including learning loss and a mental health crisis.",
    "\"America’s children are paying — and will continue to pay — the price for the CDC’s decisions for years to come,\" they wrote.",
    "\"The CDC’s guidelines make it impossible for parents to maintain any regular work schedule or find childcare on short notice.",
    "\"In fact, CDC is undermining its own credibility as it continues to jeopardize an entire generation’s development.\"",
    "This uncertainty is a logistical nightmare for parents and creates further disruption for children.\"",
    "Green and Miller-Meeks are both medical doctors."
  ]
}