{
  "id": 2754,
  "mediaId": 2643,
  "date": "2022-02-03",
  "headline": "Trump, Kevin McCarthy Have Equal Support to Be Next House Speaker: Poll",
  "image": "",
  "link": "https://www.newsweek.com/trump-kevin-mccarthy-have-equal-support-next-house-speaker-poll-1675800",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    4066,
    4905,
    4345,
    3246,
    2765,
    392,
    211,
    6678
  ],
  "sentences": [
    "Former President Donald Trump and House Minority Leader Kevin McCarthy enjoy equal support among voters to become the next House speaker should Republicans take back the majority in the midterms later this year, polling shows.",
    "\"We totally get rid of Nancy Pelosi, and the first act of President Trump as speaker [of the House] will be to impeach Joe Biden for his illegitimate activities of stealing the presidency,\" the Boston Herald reported.",
    "As a result, some right-wing allies of Trump have suggested that the former president should be nominated and elected by GOP House members, should they succeed in ousting the Democrats from power.",
    "New polling results released this week by The Economist/YouGov showed that McCarthy and Trump are tied among U.S. adults when it comes to which politician they prefer to become the next speaker.",
    "Although the House speaker is traditionally chosen from among the representatives elected to the legislative chamber, this is not technically required, according to the Constitution.",
    "Although many Trump loyalists in the House would be happy to support him as speaker, it's unclear whether this faction could muster enough support to succeed against McCarthy.",
    "McCarthy, a Republican who represents California's 23rd District, aims to oust House Speaker Nancy Pelosi, a California Democrat, following the elections in November.",
    "Steve Bannon, a right-wing strategist who previously served as a senior adviser to Trump, put forward the idea during a speech to Boston Republicans last February.",
    "Both of the prominent Republicans are backed by 14 percent of U.S. adults individually if the GOP were to win back control of the House in the 2022 races.",
    "Furthermore, other names—such as staunchly pro-Trump GOP Representative Jim Jordan of Ohio—have been floated for the top post in the legislative body.",
    "Even if Republicans take back the House majority in November, it's uncertain whether Trump or McCarthy would garner enough support to become speaker.",
    "Many analysts believe the GOP is well positioned to take back control of the House, which would put McCarthy in line to lead the legislative chamber.",
    "Nearly half (46 percent) of respondents said another Democrat should take up the speaker's gavel if the party holds on to power after the midterms.",
    "While voters elect the members of the House—with all seats up for grabs every two years—they do not directly choose who becomes House speaker.",
    "Trump's former White House chief of staff Mark Meadows backed the proposal in an interview on Bannon's War Room podcast in November.",
    "However, 39 percent of respondents said they preferred a different Republican, and a third (33 percent) said they were not sure.",
    "Meanwhile, if the Democrats maintain their majority, Pelosi is backed by 19 percent of U.S. adults to continue as House speaker.",
    "After the midterms, House lawmakers will convene and vote internally to select who will lead the legislative chamber.",
    "\"I would love to see the [speaker's] gavel go from Nancy Pelosi to Donald Trump,\" Meadows said at the time.",
    "McCarthy has faced opposition from staunchly pro- and anti-Trump factions within the House GOP Conference.",
    "However, Trump allies have repeatedly floated the idea that the former president could be elected instead.",
    "Trump was asked about the idea during an interview with far-right radio host Wayne Allyn Root last June.",
    "The former president didn't commit to the suggestion but described it as \"very interesting.\"",
    "The poll was conducted from January 29 to February 1 and surveyed 1,500 respondents.",
    "The speaker would be expected to come from the party that controls the House.",
    "Trump has not said publicly that he backs the plan or wants the role.",
    "It has a margin of error of plus or minus 2.7 percent."
  ]
}