{
  "id": 2983,
  "mediaId": 8428,
  "date": "2022-01-31",
  "headline": "Trump will headline CPAC 2022 next month in Florida",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/01/Screen-Shot-2022-01-31-at-1.20.12-PM-e1643663279761.png",
  "link": "https://www.rsbnetwork.com/news/trump-will-headline-cpac-2022-next-month-in-florida/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Caldwell",
  "authorUrl": "https://www.rsbnetwork.com/author/alex-caldwell/",
  "termIds": [
    1679,
    2119,
    2765,
    5740,
    5734,
    351,
    6488
  ],
  "sentences": [
    "The Swamp must be getting nervous…\nGet your tickets here: https://t.co/9bKKocGkHp\npic.twitter.com/PKwh9NnSV6\n— Matt Schlapp (@mschlapp) January 31, 2022\n“Hello everyone!",
    "45th President Donald Trump will return to Orlando next month to speak to supporters attending the 2022 Conservative Political Action Conference in Orlando, Florida.",
    "Ron DeSantis, R-Fla., Rep. Matt Gaetz, R-Fla., Rep. Jim Jordan, R-Ohio, commentator Candace Owens, former Trump Press Secretary Sean Spicer, and many others.",
    "He last spoke to supporters during a “MAGA” rally in Conroe, Texas on Saturday, which drew an estimated 90,000 attendees.",
    "CPAC is scheduled to take place Feb. 24 to Feb. 27 at the Rosen Shingle Creek hotel in Orlando.",
    "Since 2017, President Trump has headlined CPAC with supporters from across the nation.",
    "Trump’s Orlando CPAC debut will mark his third official public appearance of the year.",
    "Last year, he spoke to supporters at CPAC events in both Orlando and Dallas, Texas.",
    "What an honor to have President Trump back with us in Orlando, Florida for #CPAC.",
    "I’ll be attending CPAC again this year in Orlando, Florida,” said Trump.",
    "RSBN will provide full, live coverage of 2022 CPAC in Orlando, Florida.",
    "The America First/Conservative movement is still gaining support.",
    "Other CPAC speakers include Gov.",
    "Stay tuned for more details!",
    "Let’s have fun,” he added.",
    "Tickets can be found HERE.",
    "They do a great job!",
    "“CPAC is terrific."
  ]
}