{
  "id": 3029,
  "mediaId": 2636,
  "date": "2022-01-31",
  "headline": "Former Pence Chief of Staff Has Testified to the Jan. 6 Committee",
  "image": "https://static01.nyt.com/images/2022/01/31/us/politics/31dc-short-1/31dc-short-1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/01/31/us/politics/marc-short-mike-pence.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luke Broadwater",
  "authorUrl": "https://www.nytimes.com/by/luke-broadwater",
  "termIds": [
    1950,
    2765,
    2665,
    2969,
    3555,
    4905,
    4038,
    3621,
    6709
  ],
  "sentences": [
    "Mr. Short was with Mr. Pence on Jan. 6 as a mob of Mr. Trump’s supporters attacked the Capitol, and has firsthand knowledge of the effort by Mr. Trump and his allies to try to persuade the former vice president to throw out legitimate electoral votes for Joseph R. Biden Jr. in favor of fake slates of pro-Trump electors.",
    "“Unfortunately, he didn’t exercise that power, he could have overturned the election!”\nMr. Trump also said at a rally over the weekend that he might offer pardons to criminal defendants charged in connection with the Jan. 6 riot, and that he would organize more protests should he be charged with a crime.",
    "Investigators believe that participation by the former vice president and his inner circle is critical, because Mr. Pence resisted a pressure campaign by former President Donald J. Trump to use his role in presiding over Congress’s official count of electoral votes to try to overturn the 2020 election.",
    "“Mike Pence did have the right to change the outcome, and they now want to take that right away,” Mr. Trump said in a statement, referring to a group of senators who are discussing revamping the Electoral Count Act to clarify that the vice president cannot unilaterally change the election results.",
    "WASHINGTON — Marc Short, who served as chief of staff to former Vice President Mike Pence, testified privately last week before the House committee investigating the Jan. 6 attack on the Capitol, the latest turn in weeks of negotiations between the panel’s investigators and Mr. Pence’s team.",
    "Mr. Kellogg told investigators that as rioters stormed the Capitol on Jan. 6, Mr. Trump rejected pleas from him as well as from Mark Meadows, the White House chief of staff, and Kayleigh McEnany, the press secretary, to call for an end to the violence.",
    "Mr. Short and Mr. Jacob were both closely involved in Mr. Pence’s consideration of whether to go along with Mr. Trump’s insistence that he try to block the official count of Electoral College results by a joint session of Congress.",
    "“The ‘siege’ is because YOU and your boss did not do what was necessary to allow this to be aired in a public way so that the American people can see for themselves what happened,” the lawyer, Mr. Eastman, wrote to Mr. Jacob.",
    "Mr. Short appeared in response to a subpoena from the committee, according to three people with knowledge of the developments, making him the most senior person around Mr. Pence who is known to have cooperated in the inquiry.",
    "Three days before the proceeding, the two men met with John Eastman, a lawyer then advising Mr. Trump, about a memo Mr. Eastman had written setting out a case for why Mr. Pence had the power to hold off the certification.",
    "Mr. Kellogg said he and Ms. Trump also witnessed a telephone call in the Oval Office on the morning of Jan. 6 in which Mr. Trump pressured Mr. Pence to go along with a plan to throw out electoral votes.",
    "Capitol Riot’s Aftermath: Key Developments\nKeith Kellogg, a retired lieutenant general who was Mr. Pence’s national security adviser, has also testified before the committee.",
    "As a mob was attacking the Capitol chanting “Hang Mike Pence,” Mr. Eastman sent a hostile email to Mr. Jacob, blaming Mr. Pence for the violence.",
    "The developments come as Mr. Trump has continued to criticize Mr. Pence for refusing to embrace the call to overturn the 2020 election.",
    "Investigators have been in high-stakes negotiations for months with Mr. Pence’s team about whether he would cooperate with the inquiry.",
    "Mr. Kellogg told the committee that the president had accused Mr. Pence of not being “tough enough” to overturn the election.",
    "Mr. Eastman has since invoked his Fifth Amendment right against self-incrimination to defy the committee’s subpoena.",
    "He said Ivanka Trump, Mr. Trump’s eldest daughter and adviser, also attempted to intervene at least twice.",
    "The people spoke on condition of anonymity about Mr. Short’s testimony, which was earlier reported by CNN.",
    "In recent weeks, they have sought the cooperation of Mr. Short and Greg Jacob, Mr. Pence’s former lawyer.",
    "Ms. Trump then turned to Mr. Kellogg and said, “Mike Pence is a good man,” Mr. Kellogg testified."
  ]
}