{
  "id": 3034,
  "mediaId": 2658,
  "date": "2022-01-31",
  "headline": "The Jan. 6 panel's on a hot streak against Trump World. Now what?",
  "image": "https://static.politico.com/ad/98/a7b8412c4214b33e2c6bc0fbaba5/https-delivery.gettyimages.com/downloads/1347725119",
  "link": "https://www.politico.com/news/2022/01/31/january-6-committee-hot-streak-trump-world-00003368",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4984,
    4694,
    3555,
    3481,
    2765,
    1950,
    2391,
    6026
  ],
  "sentences": [
    "“We want to be able to not only do the research, but also tell the story.”\nHere’s a look at the inroads the panel is making lately and what they say about the broader state of the investigation:\nThe Supreme Court win and the draft executive order\nEarlier this month, the Jan. 6 committee finally got its hands on 770 pages of Trump White House records that the former president had tried to keep hidden.",
    "“So many times we find, ‘Oh, we just got the information we needed from somebody else.’”\nInstead, the biggest challenge for the Capitol riot committee has morphed into crafting a final product that will actually resonate with a polarized and occasionally desensitized electorate, considering the relentless campaign by Trump and his allies to diminish the significance of the insurrection.",
    "In a lawsuit filed by attorney John Eastman — a key player in Trump’s effort to overturn the election on Jan. 6, 2021 — Carter forcefully ruled on the “urgency” of the committee’s investigation, commanding Eastman to immediately begin reviewing 19,000 pages of emails, which are maintained by his former employer, Chapman University, to turn over to the committee.",
    "The committee’s run of luck was punctuated last week when on three successive days, a federal judge in California delivered rulings in defense of the committee’s efforts and implemented a lightning-fast process to force attorney John Eastman — a key Trump associate — to begin forking over thousands of pages of emails.",
    "“They have everything that’s already on my phones and things, because I saw my text messages to Caroline Wren and Cindy Chafian and some of the event organizers right there,” pro-Trump broadcaster and conspiracy theorist Alex Jones said last week on his Infowars show, hours after he testified remotely to the panel.",
    "In the past few weeks, the panel has prevailed against Donald Trump at the Supreme Court, obtained pivotal documents related to the former president’s effort to subvert the 2020 election, secured testimony from the highest levels of his White House and unearthed explosive texts from Trump’s son and top aides.",
    "The committee also tipped its hand in a recent request for Ivanka Trump’s testimony, revealing that it had direct testimony from Keith Kellogg — a national security adviser to former Vice President Mike Pence — that described her repeated efforts to persuade her father to call off the Jan. 6 mob.",
    "That means those texts are a sign that witnesses have voluntarily turned over large caches of documents and text messages, including former White House chief of staff Mark Meadows, who provided thousands of texts and emails before he reneged on a planned deposition.",
    "But within days, court filings would reveal that the committee had already obtained Budowich’s records, which investigators say could shed light on his effort to raise funds to generate turnout at the Jan. 6 rally that preceded the attack on the Capitol.",
    "“We’re already using some of these documents in witness interviews and depositions that we were having just in the last few days.”\nSome of the records, he said, provided new revelations while others simply filled in the blanks on existing evidence.",
    "The committee’s aim, according to its members, is ambitious and twofold: Convince Americans how dramatically the country teetered toward an authoritarian takeover by the former president; then propose policies to prevent a future threat.",
    "The legal battles: Taylor Budowich and John Eastman\nWhen most of Washington had tuned out for the holidays, Trump spokesperson Taylor Budowich filed a suit against the Jan. 6 select committee over a subpoena to his bank, JPMorgan Chase.",
    "”My personal hope is that this is something that the public can really, you know, wrap their arms around and understand,” Aguilar said, as opposed to “a 900-page report” fit for the bone-dry Congressional Research Service.",
    "“We want the public to understand just how close we came to a very different result and that democracy was in danger,” said Rep. Pete Aguilar (D-Calif.), one of the committee’s seven Democrats, in a phone interview.",
    "The testimony: Keith Kellogg, Ben Williamson and Alex Jones\nIn recent weeks, the panel has been able to secure interviews with key witnesses, even ones who had resisted speaking with the committee previously.",
    "House General Counsel Letter emphasized in court Friday that the committee does not have the authority to subpoena phone companies for the content of text messages or emails — only to get time-stamped logs.",
    "Looming quandaries\nDespite its winning streak, the committee is facing crucial decision points that could present new roadblocks in the weeks ahead, particularly as it prepares to take its findings public.",
    "They offer a window, he added, into how the Trump White House became a haven for conspiracy theories in its final weeks, with documents detailing just how deeply the White House pursued them.",
    "The panel has been combing through the documents, which include call and visitor logs, speech and memo drafts and hundreds of pages of press secretary Kayleigh McEnany’s briefing notes.",
    "In fact, House lawyers say they’re discussing deemphasizing some of their court battles against Trump allies because they’ve been obtaining the necessary information from other sources.",
    "One of Meadows’ top aides, Ben Williamson, spoke to the committee for hours last week, according to a person familiar with the situation not authorized to speak on the record.",
    "That recent success has heightened the importance of turning lofty expectations for the select panel’s probe into results that are tangible to the public.",
    "And then there’s perhaps the heaviest decision yet: how committee members should handle their own House colleagues who have refused to cooperate.",
    "More significantly, he said he was inclined to reject Budowich’s claims that the committee was invalidly constructed and therefore illegitimate.",
    "initially indicated he planned to request Pence’s voluntary participation in January, but the committee has not yet issued a formal invitation.",
    "The panel is also still awaiting the Justice Department’s decision about whether to prosecute Meadows for refusing to appear for a deposition.",
    "So many witnesses are providing material and providing information,” House General Counsel Doug Letter said in federal court on Friday.",
    "Minority Leader Kevin McCarthy and Reps. Jim Jordan (R-Ohio) and Scott Perry (R-Pa.) have each refused to voluntarily appear.",
    "The most urgent is an impending call about whether and when to seek testimony from both Pence and Trump himself.",
    "Judge James Boasberg ruled that, even if he wanted to, he could not force the committee to return the records.",
    "The select panel started work shrouded in worry that Trump and his allies would succeed in stonewalling them.",
    "And those witnesses have emerged, in some cases, surprised at how much evidence the committee had gathered.",
    "The panel indicated it planned to ask Williamson about Meadows’ actions on Jan. 6 and leading up to it.",
    "The newly obtained material has already become a prominent part of the committee’s investigation.",
    "That’s on top of a string of legal victories against Trump’s current and former advisers.",
    "That’s drastically changed amid the firehose of evidence it’s collecting.",
    "Eastman was due to report on the first 1,500 pages of his review Friday.",
    "Last week, a federal judge in California, David Carter, went further.",
    "“It’s incredibly powerful to help connect the dots,” Aguilar said.",
    "Meanwhile, their self-imposed spring deadline looms large.",
    "The Jan. 6 select committee is on a winning streak.",
    "Select panel Chair Bennie Thompson (D-Miss.)",
    "“We’re talking to so many people.",
    "Now comes the hard part."
  ]
}