{
  "id": 3040,
  "mediaId": 2528,
  "date": "2022-02-03",
  "headline": "Marxism, mandates, and critical race theory: Your guide to the Republican-fueled culture wars as the 2022 midterm election campaigns kick into high gear",
  "image": "https://i.insider.com/61fc4b108a52640019fe2cdb?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/republican-culture-wars-glossary-2022-elections-woke-equity-cancel-culture-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Gaudiano",
  "authorUrl": "https://www.businessinsider.com/author/nicole-gaudiano",
  "termIds": [
    5265,
    3734,
    1126,
    392,
    6223
  ],
  "sentences": [
    "The 1619 Project: Released in 2019 — 400 years after the first enslaved Africans arrived in colonial Virginia — the New York Times Magazine's Pulitzer Prize-winning project was designed to \"reframe the country's history by placing the consequences of slavery and the contributions of black Americans at the very center of our national narrative,\" according to the outlet.",
    "Action civics: Going beyond the traditional civic education, action civics calls for participating in the political process, which has led to anything from students advocating for fellow students who are hungry or experiencing homelessness — or raising awareness about LGBTQ issues, protesting climate change, or staging walkouts to protest gun violence.",
    "American Federation of Teachers President Randi Weingarten told Insider, however, that it's teachers' responsibility \"to actually teach the good and the bad of American history and to actually look at the times that America wasn't so good, like slavery and its effects, like the Japanese internment, or when the world wasn't so good, like the Holocaust.",
    "Parental involvement in schools: Republicans are positioning themselves as the \"party of parents\" and calling for a \"Parents Bill of Rights Act\" after education emerged as a priority for Virginia voters in the gubernatorial election of Republican Glenn Youngkin in November over their former Democratic governor, Terry McAuliffe.",
    "\"Republicans want to recast 'wokeness' as progressive politics run amok, and many establishment Democrats shrink from the term because they either believe that Republicans have succeeded at the task, or, of even more concern, they agree with those Republicans,\" wrote columnist Charles M. Blow for the New York Times.",
    "And the culture war references aren't likely to let up as 2022 midterm election campaigns kick into high gear and Republicans, hoping to win majorities in Congress, tap into parents' frustrations about the education system, pandemic protocols and general unease across the country.",
    "\"You see, to Critical Race theorists, in order to achieve equity, local and federal government policies must discriminate so that the same results are achieved by all races,\" Republican Sen. Ted Cruz of Texas wrote in an ebook on how to fight Critical Race Theory in K-12 schools.",
    "\"Woke was another way to say 'conscious': having awareness of our conditions and history in an America that lulls us with myths of a post-racial, colorblind, meritocratic society,\" wrote Malaika Jabali, senior news and politics editor at Essence Magazine, in The Guardian.",
    "The NAACP Legal Defense and Educational Fund, Inc., says the term \"has been co-opted by opponents as a catch-all and rallying cry to silence any discussions about systemic racism, ban the truthful teaching of American history, and reverse progress toward racial justice.\"",
    "Advocacy for patriotic education continues with hundreds of mostly state and local politicians signing one organization's pledge calling for a restoration in schools of \"honest, patriotic education that cultivates in our children a profound love for our country.\"",
    "Christopher Rufo, the Manhattan Institute fellow who started the political discussion about CRT in 2020 on Fox News, encouraged conservatives to use the term \"race-based Marxism\" in a CRT briefing book section on messaging called \"winning the language war.\"",
    "Conservatives argue the academic framework has filtered down into K-12 teaching, dividing people by race into groups of oppressors and oppressed, making white children feel uncomfortable and putting forward a belief that America is fundamentally racist.",
    "Attorney General Merrick Garland, in an October memo, called on the FBI to address illegal threats against school leaders, who have encountered protests over face mask mandates, controversial books, and the teaching of race and gender in schools.",
    "More than $20 million has been spent on the DEI programs for US public schools since the Spring of 2020, Newsweek reported, citing a figure from Parents Defending Education, an organization that says it fights \"indoctrination\" in the classroom.",
    "Critical race theory: This college-level study of systemic racism in US laws and institutions has become contentious both for K-12 schools, where educators say it isn't taught, and for universities, where it has been taught for decades.",
    "Cancel culture: The term for shunning someone, online or in person, has evolved over several decades from \"obscure slang\" for a breakup to \"a deeply contested idea in the nation's political discourse\" today, according to Pew Research.",
    "ANDREW CABALLERO-REYNOLDS/AFP via Getty Images\nDomestic terrorists: Fox News and Republicans have been saying the Biden administration and Democrats have branded parents who protest at school board meetings as domestic terrorists.",
    "Parents Defending Education says activists demanding \"equity\" are actually saying \"that the basic American value of equality of opportunity … is racist, because equality of opportunity doesn't always produce equality of results.",
    "The push to incorporate these programs in schools is what parents are really talking about when they complain about critical race theory, Dan Domenech, who runs AASA, The School Superintendents Association, told Insider.",
    "He wanted schools to teach young people to \"love America\" and counter lessons on race and slavery that he considered divisive, such as critical race theory and The New York Times Magazine's 1619 Project (see below).",
    "Patriotic education: Before leaving office, then-President Donald Trump created a \"1776 Commission\" — named for the year British colonists signed the Declaration of Independence — to promote \"patriotic education.\"",
    "Glenn Youngkin, for instance, was sued by seven school boards after he signed an executive order on the first day of his administration allowing parents to opt their children out of school mask requirements.",
    "\"The will of Virginians was clear: Parents should have a say in education,\" Youngkin wrote in a Washington Post op-ed recently after allowing parents to opt their children out of school mask requirements.",
    "Republicans point to McAuliffe's September debate statement, that parents shouldn't be \"telling schools what they should teach,\" as evidence that Democrats are out of touch with parents' concerns.",
    "Marxism: Conservatives have been equating critical race theory with Marxism, named for the 19th Century German philosopher Karl Marx, who talked about capital elites exploiting the working class.",
    "\"These are Marxist ideas that divide the nation into oppression and oppressed,\" Rep. Andy Harris, a Maryland Republican, said during the Dorchester County Board of Education meeting in August.",
    "Conservatives have been warning repeatedly about \"left-wing\" activists indoctrinating young people, either with critical race theory, action civics or political ideology in the classroom.",
    "Democrats have distanced themselves from McAuliffe's statement and a McAuliffe spokesperson told Insider that he \"knows the important role parents play in their children's education.\"",
    "The commission produced a report, just before President Joe Biden took office in 2021 and rescinded it, that was called out for \"whitewashing\" narratives about the nation's founders.",
    "Twitter users, meanwhile, called out Republican Rep. Jim Jordan of Ohio for hypocrisy when he called last year for a congressional hearing to \"address the scourge of cancel culture.\"",
    "Rep. Andy Harris, a Maryland Republican, warned at an August 2021 school board meeting in Dorchester, Maryland that the word \"equity\" is among critical-race-theory \"code words.\"",
    "Republicans — and some centrist Democrats — also fought President Joe Biden's rules mandating vaccines or testing for staff at large workplaces as federal government overreach.",
    "Diversity, equity, and inclusion:\nThese terms are commonly used to describe efforts to make schools — and other programs in government and the private sector — more inclusive.",
    "A man looks at a sign as he participates in a rally opposing \"critical race theory\" in schools at the Loudoun County Government center in Leesburg, Virginia on June 12, 2021.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "In March 2020, The Times issued a clarification to a controversial passage that stated a primary reason colonists fought the American Revolution was to protect slavery.",
    "Andrew Cuomo, a Democrat, said he would not yield to \"cancel culture\" when he was accused of the sexual harassment, allegations that forced him to resign months later.",
    "Democrats and educators say children should learn the truth about the country's racial history and that Republicans are using the issue to try to divide Americans.",
    "Like the term \"woke,\" \"cancel\" began as Black jargon and got hijacked by politicians on both sides of the aisle, sometimes as a defense against criticism.",
    "Trump in 2020 called it \"totally discredited\" and described the project, along with critical race theory, as \"toxic propaganda, ideological poison.\"",
    "A supporter of schools reopening speaks at the Hillsborough County Public Schools school board meeting on August 6, 2020 in Tampa, Florida.",
    "The project and lessons on race sparked a backlash from conservatives and helped fuel culture wars over what's taught in US schools.",
    "His memo came after the National School Boards Association — in a letter the group later apologize for — asked the feds to step in.",
    "Equity refers to fairness and may not reflect \"strict equality\" in the process of educating students, according to edglossary.org.",
    "\"In South Dakota, we will focus on education, not indoctrination,\" Noem said when announcing legislation to block \"action civics.\"",
    "While standing behind the basic point, they updated the passage to state that it was a primary motivation for \"some\" colonists.",
    "Mandates: Conservatives don't like government mandates, in general, and that aversion for some extends to masks and vaccines.",
    "Cruz, in his ebook, argues that CRT is based on a Marxist view of society as a conflict between oppressors and the oppressed.",
    "The Supreme Court blocked the rule's enforcement in January, except for health care workers at federally funded facilities.",
    "But she wrote that it's now among terms that have been \"co-opted and distorted beyond recognition in mainstream society.\"",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Politicians have a lot to say about \"critical race theory,\" \"indoctrination\" and even Marxism this election cycle.",
    "A host of Republican-led states have passed legislation restricting the teaching of \"CRT\" and \"divisive concepts.\"",
    "The NSBA — not the Department of Justice — compared the threats to \"a form of domestic terrorism and hate crimes.\"",
    "A major teachers union filed a federal lawsuit in December challenging New Hampshire's \"divisive concepts\" law.",
    "Now it's often used as a pejorative by Republicans and some centrist Democrats opposing progressive \"wokeness.\"",
    "We're starting with the terms we've been hearing frequently from lawmakers, candidates and political observers.",
    "Proponents say the programs enhance students' academic experience, but conservatives like South Dakota Gov.",
    "\"The fear is that you're going to lose the exclusivity that benefits a few but rejects many more,\" he said.",
    "Issues involving the teaching of race and gender have riled parents at school board meetings in some areas.",
    "Several school districts are teaching the 1619 project using curriculum guides from the Pulitzer Center.",
    "Photo by Octavio Jones/Getty Images\nCulture wars are playing a dominant role in the 2022 election cycle.",
    "Kristi Noem say it's another form of \"indoctrination\" and they're working to keep it out of classrooms.",
    "Woke: This is another term that began as jargon in Black culture and has since become a political tool.",
    "But there's room for more, so let us know what we're missing or what you want us to help explain.",
    "The solution is 'equity,' or attempting to achieve equality of results through discrimination.\"",
    "Indoctrination: Or, teaching someone \"to accept a set of beliefs without questioning them.\"",
    "The political meaning of terms like \"critical race theory\" can depend on who's using them.",
    "One wrote, \"Cannot wait to see Colin Kaepernick's testimony at your committee hearing!\"",
    "Here's Insider's glossary for some frequently used terms in politics this cycle.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "\"If policies don't meet that standard, CRT considers them racist policies.\"",
    "Debates include whether it's a way to punish or hold someone accountable.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Contact ngaudiano@insider.com with tips on terms to add and explain.",
    "It has become conservatives' refrain when talking about education.",
    "They worry the laws will have a chilling effect on teaching.",
    "And the word \"equity\" has become a sticking point for some.",
    "That's false, Dana Milbank notes in The Washington Post.",
    "You can't just celebrate the American Revolution.\"",
    "What these terms mean can depend on who uses them.",
    "We're here to help with a 2022 election glossary.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "This list will be updated.",
    "Former New York Gov.",
    "Virginia Gov."
  ]
}