{
  "id": 3076,
  "mediaId": 2702,
  "date": "2022-01-29",
  "headline": "GOP faces divisions over siding with Ukraine against Russia",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/01/ukrainiansoldier_01282022ap.jpg?w=1280",
  "link": "https://thehill.com/homenews/house/591906-gop-faces-divisions-over-siding-with-ukraine-against-russia/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Marcos",
  "authorUrl": "https://thehill.com/author/cristina-marcos/",
  "termIds": [
    0
  ],
  "sentences": [
    "“My office is now getting calls from folks who say they watch Tucker Carlson and are upset that we’re not siding with Russia in its threats to invade Ukraine, and who want me to support Russia’s ‘reasonable’ positions,” tweeted Malinowski, who was part of a congressional delegation that traveled to the Ukrainian capital this week.",
    "In the meantime, House GOP leaders are trying to score points on an area where the party is more unified when it comes to Ukraine: Resentment over Trump’s first impeachment in 2019, which was related to his efforts to pressure the Ukrainian government to launch an investigation into Hunter Biden’s business interests.",
    "After the Biden administration and Ukrainian President Volodymyr Zelensky released competing takeaways of a call held Thursday, House GOP Conference Chairwoman Elise Stefanik (N.Y.) and the top Republican on the House Judiciary Committee, Rep. Jim Jordan (Ohio), called for releasing the call transcript.",
    "advised lawmakers on Friday that “we will continue to monitor developments in Ukraine and work closely with the Biden-Harris administration to deter Russian aggression in whatever ways are necessary,” but did not say specifically if sanctions legislation would be considered in the coming weeks.",
    "Top GOP leaders espousing the party’s traditional hawkish views have urged the Biden administration to impose sanctions and bolster Ukraine’s military capacity to counter Russia’s troop buildup along their shared border in recent weeks after its past invasion of Crimea in 2014.",
    "Biden said Friday that he’ll be “moving U.S. troops to Eastern Europe” in “the near term.”\n“What I’ve been hearing since then is encouraging, that they’re prepared to take steps before an incursion, not afterwards,” McConnell said at a news conference in Kentucky.",
    "The Defense Department announced Monday that 8,500 U.S. troops were placed on “heightened alert” for potential deployment to Eastern Europe to bolster NATO defense forces, though Biden has emphasized he will not be putting boots on the ground in Ukraine itself.",
    "Rep. Tom Malinowski (D-N.J.), a member of the House Foreign Affairs Committee who served as an assistant secretary of State and represents a competitive swing district, said he’s been hearing from Carlson’s viewers expressing sympathy with Russia.",
    "Carlson, one of the most influential figures on the far right, asked Turner to explain to viewers “why it is in America’s interest as their kids risk their lives in Ukraine.”\n“I mean, who’s got the energy reserves?",
    "Lawmakers in both parties are in discussions about legislation to impose sanctions on Russia, including some that would be enacted immediately and others that would take effect if it actually invades Ukraine.",
    "Others are suggesting, without evidence, that Biden’s actions to side with Ukraine could benefit the business interests of his son, Hunter, who previously served on the board of a Ukrainian energy company.",
    "Some of former President Trump’s closest allies have questioned why the U.S. would side with Kyiv over Moscow at all and expressed skepticism that it’s worth pouring American resources into the conflict.",
    "A nation that cannot effectively secure its own border and protect its own territorial integrity cannot be responsible for doing so for nations in Eastern Europe,” said Rep. Matt Rosendale (R-Mont.).",
    "The GOP divide was further exemplified by a combative appearance by Rep. Mike Turner (Ohio), the top Republican on the House Intelligence Committee, on Fox News host Tucker Carlson’s prime-time show.",
    "Turner had signed a letter with several other Republicans in November urging the Biden administration to deploy a U.S. military presence in the Black Sea to deter a Russian invasion of Ukraine.",
    "When asked to reflect on that interview and other Republicans echoing Carlson’s argument, Turner expressed frustration that the idea of siding against an authoritarian regime was up for debate.",
    "Now, the Biden administration is playing a game of ‘he said, she said’ regarding yesterday’s call with President Zelenskyy,” Stefanik and Jordan said in a joint statement on Friday.",
    "Republicans are pushing President Biden to be tougher on Russia over its aggression toward Ukraine, but their isolationist far-right flank is denying them unity on the issue.",
    "“If you look at our foreign policy, if you look at our basic values, as a democracy, it’s fairly easy to understand that we don’t support authoritarian regimes.",
    "But Republicans more closely aligned with Trump — who during his presidency at times expressed pro-Russia sentiment — argue that America should stay out of it.",
    "Senate Minority Leader Mitch McConnell (R-Ky.), however, said this week that he thinks Biden is “moving in the right direction” to deter Russian aggression.",
    "Top Democrats in the House and Senate have both introduced sanctions legislation, but they’re also eyeing potential changes to bring Republicans on board.",
    "“President Biden’s weakness on the world stage has emboldened America’s enemies, abandoned our allies, and put us in the midst of an international crisis.",
    "“Despite claims by war hawks on both sides of the aisle, it is not in our national interest to spill American blood and treasure in Ukraine.",
    "And we support democracies and Ukraine as a well-known ally with the United States.”\n“We’re the light of freedom and liberty.",
    "“This debate about, you know, who should we be for is very, very disappointing,” Turner told CNN’s Jake Tapper on Thursday.",
    "Rep. Marjorie Taylor Greene (R-Ga.) argued that Biden is “compromised” and renewed her regular calls for his impeachment.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "“Russia invading Ukraine is not an immediate threat to the security of the American people, homeland, and way of life.",
    "The flow of dangerous drugs, crime, and criminals over our sovereign border is,” echoed Rep. Paul Gosar (R-Ariz.).",
    "That came after Biden met with Defense Department officials at Camp David over the weekend to discuss his options.",
    "Russia is an authoritarian regime that is seeking to impose its will upon a validly elected democracy in Ukraine.",
    "And he warned that it could undermine America’s standing abroad as an advocate for democracies.",
    "“I am for democracy in other countries, I guess, but I’m really for America,” Carlson said.",
    "Who is the potential counterbalance against China, which is the actual threat?",
    "And when we cease to be for that, then our own values are at risk,” he added.",
    "Carlson’s influence isn’t limited to putting a squeeze on a divided GOP.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "We don’t support people using tanks to change boundaries.",
    "And we’re on the side of democracy,” Turner responded.",
    "Why wouldn’t we have Russia’s side?” Carlson asked.",
    "Who is the major player in world affairs?",
    "House Majority Leader Steny Hoyer (D-Md.)",
    "Why would we take Ukraine’s side?",
    "“Sure you are,” Turner replied.",
    "“Ukraine is a democracy."
  ]
}