{
  "id": 3116,
  "mediaId": 2910,
  "date": "2022-02-03",
  "headline": "“The Plot Against The President”",
  "image": "https://duranimages.s3.eu-west-2.amazonaws.com/wp-content/uploads/2022/02/02232050/flynn.jpg",
  "link": "https://theduran.com/the-plot-against-the-president/",
  "mediaOutlet": "Duran",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2379,
    2152,
    1914,
    3763,
    2879,
    2765,
    5762,
    653,
    6678,
    6569
  ],
  "sentences": [
    "The Steele dossier is discussed here, though not in any depth, nor is there any mention of the defamation action at the High Court in London against Steele and Orbis in which Mr Justice Warby ruled: “In the pre-election period, Mr Steele was keen to ensure that the media were aware that intelligence had been gathered which indicated a connection between Mr Trump and Russia, and he briefed accordingly.",
    "If you watch this film from start to finish, you will be made more stupid as a result…It details all the conspiracy theories related to the deep state, Russia scandal including the Steele dossier, and how Michael Flynn, and all the other criminals in Trump’s orbit are really patriots and are victims.”\nOf the 87 reviews on the site, 18 of them are 1 star, and 51 are 10 star.",
    "If you still don’t understand why the Deep State which we are constantly told doesn’t really exist wanted to get rid of Trump so badly, watch this very short video then ask yourself how much more red tape he would have torn up had he been given the chance?",
    "How much would he have downsized the growing apparatus of repression that collects every e-mail Americans and others send, that monitors every phone call?…something they’ve been doing for decades, yet were still in the dark about 9/11.",
    "How former Obama officials and the odious Adam Schiff would parrot incessantly in public the claim that there was proven collusion between the Trump campaign and Russia, but when they were put under oath, they had nothing to say.",
    "This sordid affair and the fact that none of the major players have been held to account proves that for all its achievements and its magnificent Constitution, the United States is no better than a third rate banana republic.",
    "Like Trump, Putin is a strong, no-nonsense individual; had the former not been cheated out of re-election in 2020, they could have sat down together and made the world a more peaceful, safer place.",
    "What he and they appear to forget is that the only conspiracy “theory” here is the one claiming that somehow Donald Trump became President only because his best buddy Vladimir Putin arranged it.",
    "When Concord Catering and the Internet Research Agency instructed two lawyers to defend the charges, there was the little matter of legal disclosure, and the case was quietly dropped.",
    "Director Amanda Milius and her team have put together a continuous stream of interviews and comments that meld in one place the major Trump players who explain what happened and why.",
    "Other charges were not dropped because they were never brought; the conspirators include James Comey, John Brennan, undoubtedly Hillary Clinton, and possibly Barack Obama.",
    "For the same reason the entire Deep State conspired against Trump, to make him toxic, to send a message to anyone who was tempted to work with him that they should not.",
    "At the time of writing it has one and only one external review linked from the Internet Movie Database, by a dude named Gordon Brown – no, not that Gordon Brown.",
    "Instead, we are faced with the prospect of a war in Europe, war with a capital W, and while that distraction is underway, an invasion of Taiwan.",
    "Why would the FBI raid his home before dawn mob handed, tipping off the media (who arrived first) over allegations that he lied to Congress?",
    "Unsupported by documents or by anything else; Steele hadn’t set foot in Russia for a decade, and his sources were entirely imaginary.",
    "Devin Nunes, Jim Jordan, Kash Patel and others point out how the greatest hoax in American political history was carried out.",
    "It is blocked for the UK, but if you are a dedicated Duran reader you will know there are ways around that.",
    "Many Americans, including Donald Trump, parrot the mantra that theirs is the greatest country in the world.",
    "If that was low key, the arrest of Roger Stone was so outrageously over the top it beggars belief.",
    "There is a lot more herein, but one thing not mentioned is the Mueller Russian indictments.",
    "The film starts with the takedown of General Flynn by the odious Comey and his gang.",
    "The 1 starrers appear to share Mr Brown’s view about these “conspiracy theories”.",
    "This free film can currently be found at this url for American viewers.",
    "His briefings were generally broad, and unsupported by documents”.",
    "Commentary on these is best left to a comedian, Lee Camp.",
    "All the major players except, curiously, Trump himself.",
    "How many make-work jobs would he have destroyed?",
    "He opines:\n“Beware!"
  ]
}