{
  "id": 317,
  "mediaId": 2548,
  "date": "2022-02-20",
  "headline": "Sen. Cruz Says Durham Report ‘Is A Lot Bigger Than Watergate’",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/02/IMG-6105-e1645388424337.jpg",
  "link": "https://dailycaller.com/2022/02/20/ted-cruz-durham-report-hillary-clinton-bigger-than-watergate/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Silverio",
  "authorUrl": "https://dailycaller.com/author/nicole.dcnf@gmail.com",
  "termIds": [
    0
  ],
  "sentences": [
    "The filing alleges that he worked alongside tech executive Rodney Joffe—referred to as “Tech Executive-1” in the filing— to assemble “purported data and white papers” that would “establish ‘an interference’ and ‘narrative’ tying then-candidate Trump to Russia.” (RELATED: ‘As Wrong As It Gets’: Rep, Jim Jordan Calls Out Liberal Media And Democrats For Denying That Trump Was Spied On)\n“Tech Executive-1 and his associates exploited this arrangement by mining the EOP’s [Executive Office of the President] DNS [domain name system] traffic and other data for the purpose of gathering derogatory information about Donald Trump,” the filing says.",
    "“That was a bungled, third-rate burglary, it was wrong, people went to jail for Watergate and people need to go to jail for this if these allegations are true.”\nSpecial Counsel John Durham released a report accusing Democratic lawyer Michael Sussman of lying during a meeting with the FBI regarding reported links between Trump and Russia in 2016.",
    "They were spying on a sitting president.”\n“If what Special Counsel Durham is alleging is true, what Donald Trump said is absolutely right and to the extent that Hillary Clinton is completely complicit with this, her campaign is complicit with it, her lawyers are complicit with it, Big Tech is complicit with it.",
    "Republican Texas Sen. Ted Cruz said Sunday that if the report alleging that Hillary Clinton’s campaign spied on former President Donald Trump in 2016 is accurate, then it “is a lot bigger than Watergate.”\n“Is this [the Durham report] like the Mueller probe all over again?",
    "In compiling and disseminating these allegations, the defendant and Tech Executive-1 also had met and communicated with another law partner at Law Firm-1 who was then serving as General Counsel to the Clinton Campaign (‘Campaign Lawyer-1’),” the filing reads.",
    "Republican Florida Sen. Marco Rubio recently said the findings, if proven true, would be “one of the greatest political scandals in American history” during a Feb. 14 appearance on Fox News’ “Special Report.”",
    "“What Durham alleged, as a federal prosecutor, is that a lawyer for the Hillary Clinton campaign conspired with a big tech executive to monitor and spy on Donald Trump.",
    "The filing also alleges that Sussman offered up computer data to the CIA in 2017 with the intent of linking Trump and Russia, Durham further alleged in the filing.",
    "“We have to see what the facts are but I can tell you what the allegations [are], what Durham filed in a filing in federal court is deeply concerning,” Cruz began.",
    "“The defendant’s billing records reflect that the defendant repeatedly billed the Clinton Campaign for his work on the Russian Bank-1 allegations.",
    "Durham also said that Sussman repeatedly charged the Clinton campaign for work linked to the “Russian Bank-1” allegations, the filing reads.",
    "To spy on him at his home, to spy on him at his office and indeed, they were spying on the White House itself.",
    "If this is true, it’s a lot bigger than Watergate,” the senator continued.",
    "Is it all smoke and no fire?” “Fox News Sunday” host Bill Hemmer asked.",
    "Sussman has denied the allegations brought against him."
  ]
}