{
  "id": 3558,
  "mediaId": 2658,
  "date": "2022-01-26",
  "headline": "Democrats lean on that other rules change",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/01/26/democrats-lean-on-that-other-rules-change-00002226",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1987,
    1799,
    2620,
    4905,
    3653,
    4220,
    4325,
    2765,
    1489,
    392
  ],
  "sentences": [
    "TODAY’S QUESTION from Nick: Name the former House Parliamentarian who began working in said office when Speaker Pelosi was first sworn in as a Member of the House and later commented he holds “a place of honor in the history of the House and in my personal history.” Former Speaker Boehner also said he“consistently has shown grace under pressure in what well may be one of the biggest pressure cookers on Earth.” Hint: they share a name with both a recent diplomat and Member of Congress.",
    "The senior Texas Democrat vowed in a Tuesday video that “there is an ongoing investigation that will show there is no wrongdoing on my part,” Cuellar said in the 90-second statement, reiterating that he is “fully cooperating with law enforcement.” But Cuellar didn’t explain why the FBI searched his property just weeks before he faces a tough primary against progressive challenger Jessica Cisneros.",
    "Of the more than a dozen questions posed to the USCP Board, the lawmakers ask: “Is the USCP conducting background checks, surveillance, or any other type of intelligence activities on Members of Congress, staff, contractors, visitors to the Capitol Complex, or those attending events in congressional districts or otherwise off campus?” They want a response by close of business on Jan. 27.",
    "In addition to benefiting from the rules change, Senate Judiciary Committee Chair Dick Durbin (D-Ill.) is continuing his GOP predecessors’ decision to move forward on circuit court nominees, even if their home state senator doesn’t return a so-called “blue slip,” named for the paper that senators use to express their favorable or unfavorable opinion about a specific judicial pick.",
    "INSIDER THREAT?— Rep. Kelly Armstrong (R-N.D.) and six other House Republicans responded to Monday’s POLITICO scoop on Capitol Police digging into the backgrounds of people who meet with lawmakers, including staff, in a letter to the Capitol Police Board requesting answers and records regarding the “insider threat awareness program” and intelligence collected under the program.",
    "will soon go before the Alcohol Beverage Control board for a hearing on their liquor license, after the Alcoholic Beverage Regulation Administration issued two fines of $1,000 each in addition to written and verbal warning for staff members not wearing masks, not requiring vaccination verification and and not posting required signage informing customers of the policy.",
    "Democrats lean on that other rules change\nBy KATHERINE TULLY-MCMANUS\n01/26/2022 08:16 AM EST\nPresented by\nWith help from Marianne LeVine\nTHE RULES CHANGE THAT ALREADY HELPED DEMS — Senate Democrats may have lost their high profile battle to weaken the filibuster, but they’re still reaping the benefits from the last time the Senate changed its rules, Marianne writes.",
    "“The bill’s centerpiece is $52 billion in semiconductor funding sought by the White House and congressional leaders to combat the computer chip shortage, along with a litany of funding provisions for science and technology research aimed at enhancing American competitiveness against China,” writes Gavin Bade, who has a handy breakdown of the bill.",
    "Trivia\nTUESDAY’S WINNER:Nick Pearson correctly answered that Democratic Sen. Zell Miller of Georgia, fresh off a keynote speech to the Republican National Convention that roasted Democratic presidential nominee John Kerry, got exasperated with host of MSNBC's \"Hardball with Chris Matthews\" host asking about his criticism of Kerry.",
    "Don’t miss these from Roll Call’s staffer edition: Living paycheck to paycheck a reality for some Hill staffers, survey finds, from Megan Minero and Thirteen percent of congressional staffers make less than a living wage, report shows, from Niels Lesniewski\nPressley is Getting Curious…Rep.",
    "by Jonathan Weisman at The New York Times\nSome members of Congress are working to make things more civil, in a Congress that works better, from Federal News Network\nTRANSITIONS\nMadeline Meeker is now Press Secretary for Sen. Rand Paul (R-Ky.), a promotion from deputy press secretary.",
    "Previous promises: The letter states that at a GOP conference meeting on Jan. 19, Armstrong specifically asked Sergeant-at-Arms Walker and USCP Chief Tom Manger if the USCP was conducting background checks or compiling background memos on lawmakers, staff or town hall attendees.",
    "On the trip are: Reps. David Cicilline (D-R.I.), Ami Bera (D-Calif.) Colin Allred (D-Texas), Chrissy Houlahan (D-Pa.), Tom Malinowksi (D-N.J.), Sara Jacobs (D-Calif.), Mark Green (R-Tenn.), August Pfluger (R-Texas), Mikie Sherrill (D-N.J.) and Victoria Spartz (R-Ind.).",
    "That change, which helped Republicans confirm former President Donald Trump’s judges, has allowed Democrats to confirm judges in President Joe Biden’s first year at a pace that’s only rivaled by former President Ronald Reagan’s first 365 days in office.",
    "“Regardless of whether background checks and information gathering are prudent security practices, we question whether the Capitol Police Board has the power to implement such procedures without express statutory authorization,” they write.",
    "Democrats’ swift confirmation of district court judges underscores a reality in the Senate: any change in the chamber rules will be used by whoever is in power, regardless of a party’s position on those changes when it was in the minority.",
    "CURRENT CODEL— House Foreign Affairs Chair Gregory Meeks (D-N.Y.) is leading a congressional delegation to Brussels and Kyiv this week to discuss the escalating security situation on the borders between Russia and Ukraine.",
    "ABOUT LAST NIGHT— The House released their version of a trade and competition bill aimed at confronting China last night, as the push continues for Congress to ready a version to send to President Joe Biden’s desk.",
    "“In response, Sergeant-at-Arms Walker and Chief Manger both assured the Republican Conference that the USCP was not collecting, gathering, or compiling this form of intelligence,” writes Kelly.",
    "CUELLAR, DEFIANT — Rep. Henry Cuellar (D-Texas) doesn’t want anyone to think an FBI raid on his home and campaign offices one week ago has shaken his intention to seek — and win — reelection.",
    "Democrats are capitalizing on a 2019 GOP-backed rules change that sped up the confirmation of most presidential nominees, including district court picks, by cutting down the debate time.",
    "“You have to say to yourself, are we ready to build this much stuff this fast?” Mitch Landrieu, who Biden has charged with overseeing the infrastructure spending, said this month.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Wednesday, January 26, where your host is celebrating Big Papi’s entrance into the Hall of Fame.",
    "Economists warned that a shortage of skilled workers would spoil Democrats’ dreams of mass job creation and now the country is staring that possibility in the face.",
    "QUICK LINKS\nFederal judge rejects challenge to ‘weighty and urgent’ Jan. 6 committee, by Kyle\n Cawthorn Challenge Raises the Question: Who Is an ‘Insurrectionist’?",
    "Then Congress crushed the plan for training enough workers to turn that vision into reality,” write Jennifer Scholtes, Jessica Calefati and Elanor Mueller.",
    "A bipartisan Senate delegation was in Ukraine last week and Rep. Ruben Gallego (D-Ariz.), Michael Waltz (R-Fla.) and Seth Moulton (D-Mass.)",
    "A promo on Instagram teases a conversation about societal fixation on hair and looks like the sit-down interview was filmed on the Hill.",
    "HUDDLE HOTDISH\nStaffers loud and clear… Data released Tuesday packed a double-punch on the financial reality that Hill staff face.",
    "WHEN SPENDING IS THE HARD PART— “President Joe Biden locked down the infrastructure portion of his vision for economic recovery.",
    "She previously was communications director for Rep. Claudia Tenney (R-N.Y.)\nTODAY IN CONGRESS\nThe House is not in session.",
    "Huddle first dug into support among GOP staff on Capitol Hill for The Big Board’s stance against the mandates on Friday.",
    "More:\nBridges don’t build themselves: How Dems' spending flop hurts their infrastructure victory\nGOOD MORNING!",
    "\"I wish we lived in the day where you could challenge a person to a duel,\" Miller angrily told Matthews.",
    "So far, Democrats have confirmed 42 judges -- 29 district court nominees and 13 circuit court nominees.",
    "Colleen Kennedy is now manager of policy communications at the Association of Equipment Manufacturers.",
    "), Jim Jordan (R-Ohio), Barry Loudermilk (R-Ga.), Troy Nehls (R-Texas), and Bryan Steil (R-Wisc.).",
    "will appear on an episode of the upcoming Netflix series Getting Curious with Jonathan Van Ness.",
    "The GoFundMe has now raised more than $13,000, plenty from Republican aides on the Hill.",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "Other signatories include Reps. Rodney Davis (R-Ill.), Jim Banks (R-Ind.",
    "It is the third group of lawmakers to descend on Kyiv in recent weeks.",
    "The bar maintains their stance that \"everyone is welcome.\"",
    "The Big Board update… The Big Board on H Street N.E.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "The Senate cleared their own legislation last year.",
    "GET HUDDLE emailed to your phone each morning.",
    "led a bipartisan House group in December.",
    "Send your answers to ktm@politico.com.",
    "The Senate is not in session.",
    "Watch the exchange, here.",
    "Ayanna Pressley (D-Mass.)",
    "Sarah Ferris has more.",
    "Read the full letter.",
    "More here."
  ]
}