{
  "id": 3673,
  "mediaId": 8413,
  "date": "2022-01-25",
  "headline": "Here's a look at how area members of Congress voted",
  "image": "https://www.gannett-cdn.com/-mm-/27243207262a8b55c9b1d925a7246ef1eb639ab4/c=4-0-1988-1121/local/-/media/2018/03/16/OHGroup/Fremont/636568071596003758-US-capitol.jpg?width=1984&height=1121&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.thenews-messenger.com/story/news/2022/01/25/heres-look-how-area-members-congress-voted/6612595001/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Targeted News Service",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "YEAS: Rep. Bob Latta R-OH (5th), Rep. Marcy Kaptur D-OH (9th), Rep. Jim Jordan R-OH (4th)\nHouse Vote 2:\nRECOGNIZING BLACK HOCKEY PLAYER: The House has passed the Willie O'Ree Congressional Gold Medal Act (S. 452), sponsored by Sen. Debbie Stabenow, D-Mich., to award a Congressional Gold Medal to Willie O'Ree, the first black National Hockey League player.",
    "NAYS: Latta R-OH (5th), Jordan R-OH (4th)\nYEAS: Kaptur D-OH (9th)\nSenate votes\nSenate Vote 1:\nDEBATING ELECTIONS BILL: The Senate has agreed to uphold a ruling by the Senate Chair that allowed senators to offer amendments and raise points of order regarding the Freedom to Vote: John R. Lewis Act (H.R.",
    "House votes\nHouse Vote 1:\nAID TO SCHOOLS: The House has passed the Supplemental Impact Aid Flexibility Act (S. 2959), sponsored by Sen. John Thune, R-S.D., to change procedures for local educational agencies to apply for federal Impact Aid funds in fiscal 2023.",
    "A supporter of the ruling, Senate Minority Leader Mitch McConnell, R-Ky., claimed it was needed to foil \"a direct assault on the core identity of the Senate\" by ending the need for super-majority approval to bring legislation to a vote.",
    "An opponent, Senate Majority Leader Chuck Schumer, D-N.Y., claimed that Republican senators were taking part in a \"reactionary backlash\" against expanded voting and trying to make it harder for Americans to participate in elections.",
    "4673), sponsored by Rep. Mark Takano, D-Calif., to have the Department of Veterans Affairs automatically enroll eligible veterans, with the veterans' consent, into the agency's health care system.",
    "An opponent, Sen. Dan Sullivan, R-Alaska, said senators were being denied the chance to meet with Thomas and other judicial nominees to evaluate them before a confirmation vote.",
    "Rob Portman R-OH\nSenate Vote 2:\nAPPEALS COURT JUDGE: The Senate has confirmed the nomination of Holly Thomas to serve as a judge on the U.S. Ninth Circuit Court of Appeals.",
    "A supporter, Sen. Dianne Feinstein, D-Calif., said: \"Judge Thomas has a breadth of experience and knowledge that would make her well-suited to sit on the Ninth Circuit.\"",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th), Jordan R-OH (4th)\nHouse Vote 3:\nVA BENEFITS SYSTEM: The House has passed the Ensuring Veterans' Smooth Transition Act (H.R.",
    "Thomas, a California Superior Court judge for Los Angeles County since 2018, was previously a Justice Department lawyer and lawyer for the New York government.",
    "Rejecting the ruling could have resulted in senators being required to engage in a talking filibuster in order to avoid a vote on the bill.",
    "A bill opponent, Rep. Mike Bost, R-Ill., cited an estimated $3.1 billion cost, and said the program could take away from other VA services.",
    "Takano said automatic enrollment \"helps simplify the process and prevents veterans from potentially missing out on lifesaving care.\"",
    "WASHINGTON — Here's a look at how area members of Congress voted Jan. 14 to Jan. 20.",
    "The vote, on Jan. 19, was unanimous with 426 yeas.",
    "The vote, on Jan. 20, was 265 yeas to 163 nays.",
    "The vote, on Jan. 18, was 414 yeas to 6 nays.",
    "The vote, on Jan. 20, was 48 yeas to 40 nays.",
    "The vote, on Jan. 19, was 52 yeas to 48 nays.",
    "NAYS: Sen. Sherrod Brown D-OH\nYEAS: Sen.",
    "YEAS: Brown D-OH\nNAYS: Portman R-OH",
    "5746)."
  ]
}