{
  "id": 3680,
  "mediaId": 2614,
  "date": "2022-01-16",
  "headline": "Biden Gets Wrecked In 11 Seconds On CNN Of All Places, His 2022 Is Off To That Bad Of A Start [VIDEO]",
  "image": "https://www.lifezette.com/wp-content/uploads/2021/10/2021.10.03-03.35-lifezette-6159cdb504288.jpg",
  "link": "https://www.lifezette.com/2022/01/biden-gets-wrecked-in-11-seconds-on-cnn-of-all-places-his-2022-is-off-to-that-bad-of-a-start-video/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Voice Media",
  "authorUrl": "https://www.lifezette.com/author/redvoicemedia/",
  "termIds": [
    4905,
    4792,
    300,
    6678
  ],
  "sentences": [
    "Jim Jordan Completely Shreds Biden & The Dems On COVID, Elections & More In Epic Two Minute Speech [VIDEO]\nStew Peters’ Viewers Create Temporary Victory In Scott Quiner Case- Mercy Hospital Ordered To Not Kill Him\nThe opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "pic.twitter.com/cdL8dVZ6Hm\n— Kat Cammack (@Kat_Cammack) January 12, 2022\nBased on Joe’s plummeting approval ratings in addition to the comments online, it seems as if his supposed 81 million voters are abandoning him faster than the Americans he abandoned in Afghanistan.",
    "And CNN still asks if they’re out of touch with American ppl?”\n“Incompetence tends to breed darkness.”\n“If by dark you mean he is an absolute embarrassment….yup, I’m right there with you.”\n“Blondie here has that smug Dem face.",
    "With Biden in office and his leftist policies, it will continue to be bleak for Americans.”\n“Ladies and gentlemen, the most voted for President in US history!”\n“I blame the media for Biden.",
    "Everybody knows that Joe Biden’s first year in office has been one disaster after another, but now, just over two weeks into 2022, even his strongest allies are turning against him.",
    "Here are just a few of the comments on social media that show how people feel about the Biden administration:\n“I understand why Biden said it will be a dark winter.",
    "This is the worst day of her life; her hero is tanking in EVERY category.”\nThis piece was written by Zach Heilman on January 16, 2022.",
    "It is very dark for him right now.”\nIf you still happen to be wondering why even CNN would be saying something like this…\nTOP SECRET!",
    "We’re two weeks into a midterm election year a few days away from his one year anniversary of inauguration, and it is black.",
    "We got ahold of Biden’s to-do list for 2022 and well… it looks a lot like 2021… ??",
    "WATCH:\n“The country is frustrated,” King said, “his party is frustrated.",
    "It originally appeared in RedVoiceMedia.com and is used by permission.",
    "Just listen to what CNN’s John King had to say in the video below.",
    "Good job!”\n“Clown news network just found out how bad Brandon is.",
    "400 Athletes Collapsing & Dying Just In The Last 6 Months?",
    "We had a functional, if not somewhat abrasive, President.",
    "Read more at RedVoiceMedia.com:\nThe New Normal?",
    "The media had other designs.",
    "This is not new.",
    "Wee all knew.",
    "But nooooo."
  ]
}