{
  "id": 4068,
  "mediaId": 2701,
  "date": "2022-01-25",
  "headline": "Bill Tracker Dings Republicans, But Not Democrats, For Questioning Election Certification",
  "image": "https://thefederalist.com/wp-content/uploads/2022/01/5486335997_ddd5a8ae7e_k-e1643074141819.jpg",
  "link": "https://thefederalist.com/2022/01/25/govtrack-tags-gop-reps-who-rejected-2020-certification-as-insurrectionists-but-not-dems-who-objected-before/?utm_source=rss&utm_medium=rss&utm_campaign=govtrack-tags-gop-reps-who-rejected-2020-certification-as-insurrectionists-but-not-dems-who-objected-before",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tristan Justice",
  "authorUrl": "https://thefederalist.com/author/tristanjustice/",
  "termIds": [
    0
  ],
  "sentences": [
    "At the top of each GOP lawmaker’s profile who voted to reject the 2020 election results over process concerns of electoral integrity now sits a note indicting them of participation in a “months-long attempted coup that included the January 6, 2021 insurrection at the Capitol.”\n“These legislators have generally changed their story after the vote,” the pinned paragraph reads, “claiming it was merely a protest and not intended to change the outcome of the election as they clearly sought prior to the vote.”\nThe update, according to Wayback Machine’s site records on Kevin McCarthy and Jim Jordan, came after Jan. 15.",
    "“Many legislators were a part of a coordinated campaign by the Trump Administration to pressure the Vice President, who was also the vice presidential ticket, to exclude Democratic states from the electoral count.”\nDemocrats who contested electoral certification in the last three contests with Republican victories, however, remain exonerated of their past “coup attempts” as defined by GovTrack.",
    "In 2017, Reps. Jim McGovern, D-Mass., Pramila Jayapal, D-Wash., Raul Grijalva, D-Ariz., Sheila Jackson Lee, D-Texas, Barbara Lee, D-Calif., Maxine Waters, D-Calif., and Jamie Raskin, D-Md., who was an impeachment manager, each objected to electoral votes in 2017 when Congress certified President Donald Trump’s 2016 victory.",
    "Waters called the 2000 results “fraudulent,” and Jackson Lee argued its illegitimacy over the “millions of Americans who have been disenfranchised by Florida’s inaccurate vote count.” The New York Times later conceded Bush would have been named president even if the Democrats would have won their challenges in Florida.",
    "When reached for comment on whether GovTrack would similarly pin labels of “attempted coup” efforts on these Democrats’ profiles, an unnamed spokesperson pedantically responded with denials that Rep. Jim Hagedorn, who was cited as an example in the inquiry, voted to object to Biden’s certification.",
    "Democrats would then embark on a four-year campaign to achieve the top item on their policy agenda of impeachment with made-up narratives of Trump-Russian collusion, allegedly illegal Ukrainian interference and “incitement of insurrection” as the outgoing finale.",
    "The congressional tracking service GovTrack.us, a private website allowing users to follow legislative activity, began to tag Republican House members who challenged President Joe Biden’s victory in the Electoral College as insurrectionists.",
    "Hagedorn’s profile, however, prominently features the paragraph highlighting Hagedorn’s participation in “the months-long coup attempt.”\nTristan Justice is the western correspondent for The Federalist.",
    "Brooks’ page in December read that the lawmaker attempted to “disenfranchise Democratic states in the 2020 presidential election” and connected the effort to another member’s call for violence.",
    "“For example, on the page you linked to (Rep. Hagedorn’s page), there is no discussion of Hagedorn making an objection,” they wrote, recommending a refresher reading of congressional rules.",
    "“Following the rejection of several related cases before the Supreme Court, another legislator who joined the case called for violence,” GovTrack explained.",
    "“I will fight every day until he is impeached,” Waters cried out in Washington three months after Trump’s inauguration, which she did not attend.",
    "In fact, Democrats objected to more states in 2017 than Republicans did last year, citing Russian interference and alleged voter suppression.",
    "Several Democrat lawmakers still in Congress today also made objections to former President George W. Bush’s certification in 2001 and 2005.",
    "In 2005, New York Rep. Jerry Nadler declared the 2004 contest “stolen” and demanded an investigation of voting machines.",
    "Tristan graduated from George Washington University where he majored in political science and minored in journalism.",
    "Other members, such as Alabama Rep. Mo Brooks, had similar notes pinned to their profiles beginning last year.",
    "Democrats who made similar objections in 2017, 2005, and 2001 remain on the website with no such descriptor.",
    "Democrats who made similar objections in 2017, 2005, and 2001 remain on the website with no such descriptor.",
    "Follow him on Twitter at @JusticeTristan or contact him at Tristan@thefederalist.com.",
    "Each note now on the lawmakers’ pages still links to the same violent rhetoric.",
    "He has also written for The Washington Examiner and The Daily Signal.",
    "His work has also been featured in Real Clear Politics and Fox News."
  ]
}