{
  "id": 4076,
  "mediaId": 2562,
  "date": "2022-01-21",
  "headline": "Jim Jordan Wants House Judiciary to Probe DOJ, Southern Border, Fauci",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/01/getfile.aspxguid01F6B97C-633C-4D32-9A6A-38AFD49E44B1.jpg",
  "link": "https://donaldjtrumppolls.com/jim-jordan-wants-house-judiciary-to-probe-doj-southern-border-fauci/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "(Alex Wong/Getty Images)\nBy Charlie McCarthy | Friday, 21 January 2022 09:14 AM\nRep. Jim Jordan, R-Ohio, said he plans to investigate the Justice Department, the southern border crisis, and Dr. Anthony Fauci if he becomes chairman of the House Judiciary Committee next year.",
    "Jordan was referencing last year's National School Boards Association letter that compared parents attending school board meetings to domestic terrorists, and the ensuing DOJ memo that directed the FBI to help police deal with alleged threats against school board members.",
    "The strong supporter of former President Donald Trump then said his committee and the House Committee on Oversight and Reform jointly will conduct a probe on the origins of the coronavirus, and on Dr. Fauci's actions during the pandemic.",
    "We’re then going to cite that story as the basis for the message we want out there, and were going to mislead the American people.”\nFauci, Biden's chief medical adviser, will not be the committee's only COVID-related focus, however.",
    "\"In simple terms, Dr. Fauci knew from the get-go that we were funding gain-of-function research, and the origins of the virus likely came from the lab in the Wuhan Institute of Virology in China,\" Fauci told Boothe.",
    "He said he wanted to look into the \"collusion between Big Media and Big Tech\" that led to the suppression of reporting on a laptop believed to belong to Hunter Biden \"in the weeks right prior to the election.\"",
    "Jim Jordan Wants House Judiciary to Probe DOJ, Southern Border, Fauci Rep. Jim Jordan, R-Ohio, speaks during a news conference in front of the U.S. Capitol in Washington, D.C. on July 27, 2021.",
    "2, equally as important, is the chaos that is now our southern border and has been that way for a year, ever since [President Joe] Biden took office,\" he told Boothe.",
    "Jordan added that he will call Homeland Security Secretary Alejandro Mayorkas to testify before House Judiciary Committee – something Mayorkas has yet to do.",
    "Jordan, the committee’s current ranking member, figures to become chairman if Republicans capture control of the House in November's midterm election.",
    "Jordan also raised questions about Hunter Biden, son of the president, whose foreign business dealings have been a cause for concern.",
    "Jordan appeared on The Truth with Lisa Boothe podcast Thursday and discussed his priorities should he become committee chairman.",
    "\"There are six or seven things that they misled, and there's a bunch of other things they misled us on,\" Jordan told Boothe.",
    "Fauci said, 'I’m going to get these individuals who get government money to write the story I want them to write.",
    "\"So we need oversight and the truth to get to the American people on that issue as well.\"",
    "\"We have to get control of that and we have to highlight how wrong [it has been].\"",
    "Rand Paul, R-Ky., and Ron Johnson, R-Wis., to assist in the investigation.",
    "That would give the GOP subpoena power and the ability to set the agenda.",
    "First on the docket will be \"the DOJ, what they're doing to parents.\"",
    "“What Fauci did is the template for how the left operates.",
    "He added that he would like Sens.",
    "Original Article",
    "\"Priority No."
  ]
}