{
  "id": 419,
  "mediaId": 2580,
  "date": "2022-02-24",
  "headline": "DeSantis, Trump to speak at CPAC",
  "image": "https://www.gopusa.com/wp-content/uploads/2021/04/desantis_cbs.jpg",
  "link": "https://www.gopusa.com/desantis-trump-to-speak-at-cpac/",
  "mediaOutlet": "GOPUSA ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5507,
    1679,
    2119,
    2309,
    2765,
    4905,
    1126,
    6159
  ],
  "sentences": [
    "Trump called the idea of a feud between the two “fake news,” while DeSantis called it “totally bunk.”\n“The media and the Democrats, they want to generate some rift narrative and it’s fascinating because on the Republican side we couldn’t be more unified,” said Florida GOP Vice Chair Christian Ziegler.",
    "New limits on abortion and measures restricting discussion of race, sexual orientation and gender in schools are advancing this week in Tallahassee, along with proposed penalties for private companies that assist the Biden administration with migrant relocations to Florida.",
    "Trump and DeSantis are the biggest draws, though, with the former president still immensely popular in the GOP, but DeSantis increasingly challenging him for the affection of Republican activists after thrilling conservatives with his response to COVID-19.",
    "That animosity spilled into public view in January when the former president took a veiled shot at his protégé, calling politicians who won’t disclose their COVID-19 vaccine booster shot status “gutless.” DeSantis has declined to say whether he’s boosted.",
    "The 2021 CPAC event helped cement DeSantis as a conservative star after a straw poll of those in attendance found him as the leading choice for the GOP presidential nomination if Trump doesn’t run, and a solid contender even if Trump does run.",
    "“You can’t help but think is there a split, and how big of a split is there between DeSantis and Trump?”\nWorth watching is “the leadership tug of war that’s going on, at least subterranean, between Trump and DeSantis,” Bergerson said.",
    "Ziegler argued that DeSantis and Trump play “two totally different roles.”\n“President Trump has done a great job of exposing what’s going on in Washington and DeSantis has done a great job protecting us in Florida,” Ziegler said.",
    "A poll of Florida’s 16th congressional district even found DeSantis leading Trump among Republicans in that part of the state, which includes all of Manatee County and portions of Sarasota and Hillsborough counties.",
    "Yet the potential for the career paths of Trump and DeSantis to bring them into conflict in 2024 creates an obvious source of tension, and has led to a continuing focus on where the two men rank with the GOP base.",
    "Ron DeSantis running for president, the event returns to Orlando this week with DeSantis again in the spotlight as a growing force rivaling former President Donald Trump in GOP politics, especially in Florida.",
    "DeSantis also has gained national attention for pushing several hot-button conservative issues that are moving through the Florida Legislature right now, from election law changes to his “Stop W.O.K.E.",
    "The weekend will wrap up with a 2024 straw poll, which will be closely watched as an indicator of where Trump and other possible presidential contenders, especially DeSantis, stand with the GOP base.",
    "A Reuters/Ipsos poll released in early January found Trump well ahead of DeSantis in a potential 2024 matchup, with 54% of GOP voters supporting the former president and 11% backing DeSantis.",
    "DeSantis appeared to fire back at Trump, saying he regrets not pushing back against the nationwide lockdown Trump supported early in the pandemic to rein in the spread of the virus.",
    "A host of prominent conservatives will speak at CPAC this weekend, from U.S. Sen. Ted Cruz to former Secretary of State Mike Pompeo, U.S. Sen. Marco Rubio and U.S. Rep. Jim Jordan.",
    "He seems likely to run again in 2024, and even a rising GOP star such as DeSantis faces an uphill climb against someone who has come to dominate Republican politics at every level.",
    "DeSantis is stronger in Florida, where a Suffolk University/USA TODAY poll released this month found him at 40% support in a head-to-head matchup against Trump, who was at 47%.",
    "The governor has downplayed his presidential ambitions, even as he puts forward a governing agenda that seems tailor made to appeal to conservatives in a presidential primary.",
    "“If you consider this kind of an early primary of sorts from the conservative side, no question about it this would add to the conversation leading up to 2024,” he said.",
    "DeSantis is certain to receive a warm CPAC reception on his home turf, possibly rivaling Trump for the amount of love he receives from the GOP grassroots in Orlando.",
    "Florida Gulf Coast University political science professor Peter Bergerson said CPAC is an important gauge of which GOP leaders are exciting party activists.",
    "It is speaking to a much larger audience than the ones that we are constitutionally bound to protect.”\nTrump doesn’t appear ready to step aside, though.",
    "Some Republicans view DeSantis as a more disciplined version of Trump without the baggage, and believe he would be a better bet to lead the party.",
    "“He’s definitely trying to get all his pieces set up on the board” for a presidential run, said House Democratic Leader Evan Jenne of Dania Beach.",
    "With CPAC – the Super Bowl of GOP politics – returning to Florida, who is the better quarterback to lead his team to victory going forward?",
    "“A big way to do that is to go out to CPAC and say, ‘Look, you’re not going to find any more conservative governor in the union.",
    "The St. Pete Polls survey found that 43% of District 16 Republicans prefer DeSantis, while 40% back Trump and 17% are undecided.",
    "This year’s CPAC straw poll will be closely watched for what it says about that potential matchup of GOP heavyweights.",
    "A Harvard CAPS/Harris poll from last month found Trump at 57% support in a GOP primary, compared to 12% for DeSantis.",
    "Whether the governor stands a real chance of knocking off Trump in a head-to-head matchup is another question.",
    "Since then Trump reportedly has been annoyed that DeSantis won’t rule out running for president against him.",
    "The governor is likely to highlight his legislative agenda at CPAC during a Thursday afternoon speech.",
    "A year after the Conservative Political Action Conference helped super charge speculation about Gov.",
    "A columnist for The Hill called the upcoming straw poll the first “Trump vs. DeSantis” primary.",
    "Follow Herald-Tribune Political Editor Zac Anderson on Twitter at @zacjanderson.",
    "He can be reached at zac.anderson@heraldtribune.com\n© 2022 Journal Media Group",
    "The poll could help cement DeSantis as a top 2024 contender, Bergerson said.",
    "The conflict quickly died down, with both men saying they are on good terms.",
    "“Where does the enthusiasm rest with the individuals there?” Bergerson said.",
    "'”\nJenne added that the “governor’s office…is a campaign wing right now.",
    "Gannett Capital Bureau reporter John Kennedy contributed to this report.",
    "Act” targeting how schools and businesses approach racial issues.",
    "That difference is within the poll’s margin of error.",
    "Who is the future of the conservative movement?",
    "Trump will deliver a speech Saturday evening."
  ]
}