{
  "id": 421,
  "mediaId": 2641,
  "date": "2022-02-22",
  "headline": "Rep. Jim Jordan Demands Hearing on Retail Crime Spike",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=ee161a3c-0b3f-4c56-8796-6a42f39b4cbb&SiteName=Newsmax",
  "link": "https://www.newsmax.com/us/jim-jordan-retail-crime/2022/02/22/id/1058002/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Gournell",
  "authorUrl": "",
  "termIds": [
    2119,
    3422,
    4593,
    1477,
    1550,
    392,
    873,
    6582
  ],
  "sentences": [
    "He also noted a quote from Manhattan's newly minted District Attorney Alvin Bragg:\n\"[R]etail thefts that do not involve a risk of physical harm, the Office will continue to assess the charges based on all of the aggravating and mitigating circumstances presented.\"",
    "Pointing to examples of \"soft on crime\" prosecutors, Jordan noted:\n\"For example, in San Francisco, the new District Attorney [Democrat Chesa Boudin] announced in 2021 that he would deemphasize prosecution of drug and property crimes.",
    "Rep. Jim Jordan, R-Ohio, on Tuesday sent a letter to House Judiciary Chairman Jerry Nadler, D-N.Y., demanding a hearing on what Jordan called the recent \"unprecedented spike\" in retail theft in cities across the country.",
    "\"According to a 2020 study by the National Retail Federation (NRF), retail theft has risen sixty percent since 2015 and now amounts to retail-store losses of $719,548 per $1 billion in sales,\" Jordan wrote.",
    "\"In the NRF survey, retailers 'cited relaxed law enforcement guidelines, changes in shoplifting laws and decreased penalties for shoplifting among the causes for increased organized retail crime.'",
    "\"The criminals carrying out these acts are emboldened by 'soft on crime' policies and progressive prosecutors who refuse to enforce the law,\" wrote Jordan, who is the committee's ranking member.",
    "Crime has increased everywhere since the outset of the COVID-19 pandemic, but \"grab and run\" incidents have seen major waves recently around major cities.",
    "\"Dangerous bail elimination measures\" are another contributor, Jordan said, quoting New York City's former Police Commissioner Dermot Shea: \" 'Insanity.",
    "A Manhattan Rite Aid was forced to close after thieves stole more than $200,000 worth of merchandise this past December and January, Jordan wrote.",
    "\"These retail businesses are already suffering due to record inflation, a massive labor shortage, and supply chain issues,\" he said.",
    "In September 2020, San Francisco police recovered $8 million in merchandise stolen from Walgreens, CVS and Target, Jordan noted.",
    "The thefts have forced retail chains to impose costly and cumbersome anti-theft measures as well as store closures, he added.",
    "Since his election, burglaries have increased 52 percent, representing one of the largest increases in the country.\"",
    "No other way to describe the resulting crime that has flowed from disastrous bail reform law.'",
    "\"Now this surge in theft is forcing some retail stores to close permanently.\"",
    "\"\nRetailers also want Congress to act, he said.",
    "\"\nRelated Stories:"
  ]
}