{
  "id": 4273,
  "mediaId": 2754,
  "date": "2022-01-20",
  "headline": "DirecTV's Plan To Remove One America News Faces Pushback From Senators",
  "image": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2022-01/Steve-Daines-700x420.jpg?itok=544aOJeI",
  "link": "https://www.zerohedge.com/political/directvs-plan-remove-one-america-news-faces-pushback-senators",
  "mediaOutlet": "Zero Hedge",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Durden",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Daines said “there has not been sufficient justification from DirecTV as to why OAN’s contract was not renewed by your company,” adding that “a vague ‘routine internal review’ and the lack of transparency with the viewers of OAN in Montana in your decision making process is unacceptable and has the appearance of targeting supporters of former President Donald Trump.”\nSen. Steve Daines (R-Mont.)",
    "“DirecTV cutting OANN is latest example how corporate leftist media is silencing conservative voices in direct response to Biden administration & democrats smear campaign on allowing [people] to hear different viewpoints that are critical of the administration,” Grassley wrote on Twitter.",
    "OAN declined to comment, but in a post on its website that has since been taken down urged supporters to call DirectTV to “demand OAN remains on your channel lineup.”\n“Join the movement and stand up for freedom of the press!” OAN said, listing phone numbers for the company.",
    "It describes itself as “a family owned and operated, independent media company focused on providing high quality national television programming to consumers via its national cable networks.”\nVerizon FiOS also carries OAN, as do other some other television providers.",
    "“It is important to have a range of media outlets in today’s political atmosphere and by removing conservative content such as OAN on your platform; you are hindering Montanans ability to view their preferred outlet,” Daines wrote.",
    "(Michael Reynolds/Pool/AFP via Getty Images)\nHe asked Morrow to reevaluate the decision in light of DirecTV being the only option for live television in many parts of Montana.",
    "A spokesperson for the company told Bloomberg that “a routine internal review” led to the decision not to renew its contract with OAN after the current one expires in April.",
    "), meanwhile, sent a letter (pdf) to DirecTV’s CEO, Bill Morrow, calling for the company to halt its plans to remove OAN, a television network, from its lineup.",
    "Authored by Zachary Stieber via The Epoch Times,\nDirecTV’s plan to boot One America News Network (OAN) is facing pushback from Republicans in Congress.",
    "No Democrats had appeared to comment, but some last year pressured television carriers to stop hosting OAN, Fox News, and Newsmax.",
    "DirecTV, which has about 15 million subscribers, has not responded to requests for comment.",
    "Other lawmakers weighed in against DirecTV’s plan, including Sen. Chuck Grassley (R-Iowa).",
    "Sen. Rand Paul (R-Ky.) announced this week that he canceled his DirecTV subscription.",
    "questions witnesses on Capitol Hill in Washington on Feb. 24, 2021.",
    "“Why give money to people who hate us?” he said in a statement.",
    "“The Left’s purge continues: YouTube demonetizes Dan Bongino.",
    "Who’s next?” added Rep. Jim Jordan (R-Ohio).",
    "OAN was launched in 2004 in California.",
    "DirectTV drops One America News.",
    "Twitter suspends Dr. Malone.",
    "Sen. Steve Daines (R-Mont."
  ]
}