{
  "id": 4283,
  "mediaId": 2699,
  "date": "2022-01-26",
  "headline": "The Jan. 6 Committee Members Are Patriots Making Sure Treason is Fully Documented",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_675,w_1200,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1643148711/220125-jan-6-committee-hero_zuzmig",
  "link": "https://www.thedailybeast.com/the-jan-6-committee-members-are-patriots-making-sure-treason-is-fully-documented?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eleanor Clift",
  "authorUrl": "https://www.thedailybeast.com/author/eleanor-clift",
  "termIds": [
    5037,
    5066,
    1904,
    2441,
    4557,
    4885,
    4026,
    4267,
    2749,
    283
  ],
  "sentences": [
    "Former House Speaker Newt Gingrich on Sunday morning predicted on Fox News that if Republicans take control of Congress: “The wolves are gonna find out that they’re now sheep, and they’re the ones who—in fact, I think—face a real risk of jail for the kind of laws they’re breaking.” This is a direct threat of political retribution toward members of Congress.",
    "Representing the Republicans are Vice-Chair Lynne Cheney—who was stripped of her leadership role for defying party orthodoxy and rejecting Trump’s Big Lie—and Rep. Adam Kinzinger—an Iraq and Afghanistan war veteran who also broke with his own party following Trump’s attempt to steal the 2020 election (Kinzinger is retiring after this term).",
    "There are three lawyers among the Democrats, Reps. Zoe Lofgren, Adam Schiff, and Jamie Raskin; a Navy veteran in Rep. Elaine Luria; the vice-chair of the Democratic Caucus, Rep. Pete Aguilar of California; and Rep. Stephanie Murphy, a fiscal moderate, member of the Blue Dogs, who is not running for re-election.",
    "They’re carefully building their messaging for next month’s public hearings by meticulously charting the events leading up to Jan. 6, as well as the extent to which Trump and his allies went to overturn the election (which included serious consideration of calling in the military to seize voting machines).",
    "A former GOP staffer before he went into academia, he told me he doesn’t expect the committee’s final report to change the minds of hardcore Trump supporters in the electorate or on Capitol Hill, but it could produce evidence that changes the minds of less stalwart Trump defenders.",
    "This is what it looks like when the rule of law unravels.”\nThis is no Benghazi Committee, the hapless GOP-led group that grilled former Secretary of State Hillary Clinton for 11 hours in 2015 to rough up her poll numbers but in the end found nothing they could actually pin on her.",
    "“[GOP Rep.] Charles Wiggins saw himself as a de facto defense attorney [for Nixon], but when he saw the smoking gun tape, he said, that’s it.”\nIn the immediate aftermath of the Jan. 6 Capitol riot, Republicans recoiled from what President Trump had instigated.",
    "And their loyalty to country and the institution trumps loyalty to party.”\nPitney is old enough to remember the House Judiciary hearings in 1974, when several high-profile Republicans supported the impeachment inquiry into President Richard Nixon.",
    "An added benefit, says Pitney: “With an all grown-up committee, it will be difficult for Fox News to get a lot of usable clips.”\nWhen the House in May 2021 voted on whether to create the committee, 35 Republicans joined Democrats to support it.",
    "The Supreme Court ruling on Trump having to turn over his internal deliberations and communications, coming from “his” judges, is a significant boost to a committee that knows how to run with what they’ve got.",
    "Cheney tweeted in response: “A former Speaker of the House is threatening jail time for members of Congress who are investigating the violent January 6 attack on our Capitol and our Constitution.",
    "GOP Sen. Lindsey Graham said he was getting off the Trump train, and Senate Minority Leader Mitch McConnell put the blame squarely on Trump, saying, “The mob was fed lies.”\nBut that didn’t last.",
    "But compared to the stalemate between the two parties and the bickering among Democrats, the Jan. 6 Committee is a model of congressional collegiality among members with differing ideologies.",
    "“You have Liz Cheney and Adam Kinzinger who have very conservative voting records, but they understand this is different, that it’s separate from their policy differences with the Democrats.",
    "When House Minority Leader Kevin McCarthy named the MAGA-friendly Reps. Jim Jordan and Jim Banks, two known bomb-throwers hostile to the committee, Pelosi exercised her veto power.",
    "“The credibility of the product you produce is very much dependent on the quality of the panel itself,” says John Lawrence, a former chief of staff to Speaker Pelosi.",
    "She wanted him there for that reason,” says Lawrence, whose forthcoming book, Arc of Power: Politics and Policy in the Pelosi era 2005-2010 will be out in November.",
    "“If they had someone on the inside, they could have slammed it as a Democratic witch hunt.” But Cheney and Kinzinger are still conservative Republicans.",
    "Meanwhile the committee’s seven Democrats and two Republicans are performing competently and quietly building credibility for their eventual report.",
    "And now the committee can do its patriotic duty and dig up as much truth as possible about what led to one of the worst assaults on our democracy.",
    "In the formation of the committee, Pelosi tried to uphold the spirit of the 9/11 commission, offering five slots “in consultation” with the GOP.",
    "House Speaker Nancy Pelosi wasn’t going to let McConnell have the final word and squelch any inquiry into the Jan. 6 attack on the Capitol.",
    "The committee members are not prolific leakers, and they don’t fight publicly over whether they should or shouldn’t issue subpoenas.",
    "The Republicans will rue that decision because it left them without anyone on the inside to raise questions and cast doubt.",
    "The committee’s chair, Rep. Bennie Thompson, didn’t have a national profile before Pelosi tapped him for this assignment.",
    "The Jan. 6 Committee took a lot of heat over how long it took to organize, and for its lack of support from Republicans.",
    "“He’s somebody who has dealt with issues of classified material and what’s dangerous or damaging to national security.",
    "Only six Senate Republicans voted for it, which was four short of what was needed to overcome McConnell’s filibuster.",
    "Then it went to the Senate where GOP Minority Leader McConnell used the filibuster to kill the proposed committee.",
    "“You need more of a judicial temperament rather than a legislative temperament.”\nPelosi chose each member wisely.",
    "But he has chaired or been the ranking member on the House Homeland Security Committee for the past 20 years.",
    "They’ve got nothing to lose anymore, politically, so they’re prepared to follow the facts wherever they lead.",
    "“This is what grown-ups look like,” says Jack Pitney, a professor of politics at Claremont McKenna College.",
    "In other words, change is on the margins—and the margins matter in a country as divided as ours.",
    "The GOP’s decision to sit out the Jan. 6 Committee “will come back to bite them,” says Lawrence.",
    "“They had a moment of adulthood, but they quickly reverted to adolescence,” says Pitney.",
    "She proceeded with a second vote on June 30 to authorize the Select Committee.",
    "“This is a tough group of people,” Lawrence says of the Jan. 6 panel.",
    "“Even people who supported Nixon behaved as grown-ups,” says Pitney.",
    "“You don’t want lone wolves or showboats,” he told The Daily Beast.",
    "The committee’s mandate is essentially: make treason uncool again.",
    "With them on the committee, there is no partisan out for the GOP.",
    "Only two Republicans supported it, Cheney and Kinzinger.",
    "Trump still has the GOP base firmly in his grip.",
    "Larry Hogan’s father, Rep. Lawrence Hogan.",
    "He wasn’t learning this stuff on the job.",
    "McCarthy then withdrew his other picks.",
    "Among them was Maryland Republican Gov."
  ]
}