{
  "id": 4351,
  "mediaId": 2545,
  "date": "2022-01-21",
  "headline": "Welcome Madam Ambassador, But Please Not the Best and Brightest 2.0",
  "image": "https://www.counterpunch.org/wp-content/uploads/2021/06/cp-default-share.png",
  "link": "https://www.counterpunch.org/2022/01/21/welcome-madam-ambassador-but-please-not-the-best-and-brightest-2-0/",
  "mediaOutlet": "counterpunch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Warner",
  "authorUrl": "https://www.counterpunch.org/author/dwarner0991/",
  "termIds": [
    0
  ],
  "sentences": [
    "from Franciscan University of Steubenville in Ohio and a law degree from Catholic University of America in Washington, D.C., Crocker has an outstanding academic background at the top American universities – Stanford, Fletcher School of Law and Diplomacy, Harvard Law School – as well as having taught at major universities in the Washington area – Johns Hopkins, George Washington, American University and Georgetown.",
    "But tensions with Russia continue to rise – over 100,000 troops on the border of Ukraine – the shift to China has had no major breakthroughs – fighter planes flying over Taiwan – the Middle East, including the Iran nuclear deal, is bogged down and the Taliban are patrolling the streets of Kabul.",
    "Robert Malley: U.S. Special Representative and lead negotiator for the Iran nuclear deal (Joint Comprehensive Plan of Action), same elite school in Paris as Blinken, Yale undergraduate, Rhodes Scholar Oxford University, Harvard Law School, clerked for Supreme Court Judge Byron White.",
    "The uncoordinated, chaotic troop withdrawal from Afghanistan as well as the tone deaf undiplomatic trilateral security pact (AUKUS) between Australia, the UK and the U.S. that caught the French unaware are serious diplomatic faux pas.",
    "While the Biden administration proclaimed it was back in the multilateral circuit, the lack of a U.N. ambassador – because certain Republican senators held up confirmations – has weakened the American position in International Geneva.",
    "His point, which has become an oft-sighted mantra, is that people like Dean Rusk, Robert McNamara, Arthur Schlesinger Jr. and McGeorge Bundy might have had all the best qualifications, but their judgments were wrong about Vietnam.",
    "Blinken and Malley may speak perfect French, but their surprise submarine deal showed little common sense and caused the French to recall their ambassador to Washington for the first time in modern history.",
    "In it, Halberstam traces the decision-making in the Kennedy and Johnson administrations leading up to the start and beyond of the Vietnam conflict to show how top policymakers and academics were wrong.",
    "One of the most unreported events of the Biden/Putin summit of June 16, 2021, was the lack of an American Geneva ambassador on the tarmac to greet President Biden when he stepped off Air Force One.",
    "Updating Halberstam’s the best and the brightest in promoting the disastrous Iraq War would be Republican neoconservatives Paul Wolfowitz – Ph.D. University of Chicago – Richard Perle – M.A.",
    "She has considerable experience in foreign affairs and the State Department, including serving as Assistant Secretary of State for International Organization Affairs from 2014 to 2017.",
    "Current overeducated, common sense challenged Republicans are led by Senators Ted Cruz – Princeton, Harvard Law School – and Josh Hawley – Stanford, Yale Law School.",
    "Jake Sullivan: National Security Advisor; Yale undergraduate, Rhodes Scholar Oxford University, Yale Law School, clerked for Supreme Court Judge Stephen Breyer.",
    "Similar to Halberstam’s the best and the brightest, we see the people around President Biden’s foreign policy team with outstanding qualifications like Crocker.",
    "For all the qualifications of the current team and Biden’s years of Senate experience, the Biden administration has not yet had a major foreign policy success.",
    "Since January 2021, there has been no United States ambassador to the Office of the United Nations and Other International Organizations in Geneva.",
    "She also has experience with philanthropy – the Bill & Melinda Gates Foundation – and the United Nations – the UN Peacebuilding Support Office.",
    "Ambassador to Hungary, fluent French having studied in Paris, Harvard undergraduate having co-edited the Harvard Crimson, Columbia Law School.",
    "Nominated by President Trump, Bremberg was best known as a buddy of the firebrand, coatless MAGA representative from Ohio, Jim Jordan.",
    "Nevertheless, one could have expected better results on the international scene from Biden and his team with their experience.",
    "One of the most damning books on the Vietnam War was David Halberstam’s 1972 The Best and the Brightest.",
    "So far, the Biden foreign policy team has made no major errors, certainly none on the scale of Vietnam.",
    "Her father, Chester Crocker, was a highly respected Assistant Secretary of State for African Affairs.",
    "Granted the pandemic, infrastructure bill and Build Back Better have been time and energy consuming.",
    "Bremberg’s current position is President and CEO of the Victims of Communism Memorial Foundation.",
    "In sum, the differences between Andrew Bremberg and Bathsheba Crocker could not be more radical.",
    "The previous ambassador, Andrew Bremberg, was certainly no fan of international cooperation.",
    "But that has changed with the Senate confirmation of Bathsheba Crocker on December 18, 2021.",
    "The Vietnam and Iraq tragedies under the best and the brightest should never be repeated.",
    "in political science from Princeton – and Eliot Abrams – Harvard, Harvard Law School.",
    "He had been a special assistant to Trump and director of the Domestic Policy Council.",
    "But before rejoicing about the differences and her confirmation, a caveat is needed.",
    "And the lack of common sense among educated elites is not limited to Democrats.",
    "But beyond no successes, the Biden team has made elementary diplomatic errors.",
    "Here’s hoping Ms. Crocker and the Biden foreign policy team have common sense.",
    "Antony Blinken, Jake Sullivan and Robert Malley have similar backgrounds.",
    "Ambassador Crocker’s credentials are far different from Bremberg’s.",
    "He was sent to Geneva to push a conservative social agenda.",
    "We have seen how the best and the brightest can err.",
    "The Best and the Brightest 2.0 must not be written.",
    "Bremberg had no previous international experience.",
    "This first appeared in the Geneva Observer.",
    "Secretary of State Blinken: Father U.S.",
    "Unlike Bremberg, who has a B.A.",
    "How to measure common sense?",
    "They lacked common sense.",
    "It’s not simple to find.",
    "Welcome Mme.",
    "Ambassador."
  ]
}