{
  "id": 4381,
  "mediaId": 2723,
  "date": "2022-01-25",
  "headline": "Matt Gaetz’s ‘Allies Are Quietly Isolating Him’ as Sex Trafficking Investigation Nears End: Report",
  "image": "https://www.thenewcivilrightsmovement.com/wp-content/uploads/2021/06/gaetz-ss-4.jpg",
  "link": "https://www.thenewcivilrightsmovement.com/2022/01/matt-gaetzs-allies-are-quietly-isolating-him-as-sex-trafficking-investigation-nears-end-report/",
  "mediaOutlet": "thenewcivilrightsmovement.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni – Raw Story",
  "authorUrl": "https://www.thenewcivilrightsmovement.com/author/tbogg/",
  "termIds": [
    0
  ],
  "sentences": [
    "According to Insider, “Asked about Gaetz’s omission from the bill, a cannabis-industry source who spoke on condition of anonymity cited the DOJ investigation,” saying, “It has been more difficult for him to lead legislative efforts because of the associated issues.”\nThe report continues, “It shows that while Gaetz still has friends in Congress, even his allies are quietly isolating him — or at least not going out of their way to work with him,” before adding, “Some Republicans, who have never much cared for Gaetz since he entered Congress in 2018, have been privately sneering at him in the months since his legal woes began, Insider previously reported.",
    "Yet they may soon face a decision day — one they’ve been happy to avoid, since Gaetz is one of former President Donald Trump’s most vocal defenders — and some Republicans are quietly preparing for the real possibility that federal officials will charge the Florida Republican with crimes.”\nAs to why they have refrained from any negative comments about the Florida Republican, Luis Alvarado, a Republican political strategist explained, “Matt Gaetz is still a poster boy for Trumpism.",
    "Two weeks ago it was reported that his former girlfriend was granted immunity before testifying before a Florida grand jury which led former U.S. Attorney Joyce Vance to caution, “It’s never a good sign for the target when a key witness gets immunity to testify in front of the grand jury.”\nAccording to Kimberly Leonard, Camila DeChalus, and Bryan Metzger of Business Insider, “Most Republicans are neither embracing nor condemning scandal-ridden Rep. Matt Gaetz.",
    "And if you deny that, then a question arises whether you’re still part of that movement.”\nInstead, the report notes, his colleagues — with the exception of equally controversial Reps. Marjorie Taylor Greene (R-GA) and Jim Jordan (R-OH) — have sidelined him, including not asking him to be a co-sponsor on a bill to legalize cannabis written by Republicans despite the fact that he is a vocal proponent of legalization.",
    "Other Republicans have given donations from Gaetz’s campaign committee, called Friends of Matt Gaetz, to charity, according to Federal Election Commission records.”\nAs for Gaetz’s future, should he be indicted, one Justice Department official predicted he will still have one defender: Donald Trump.",
    "According to a report from Business Insider, Rep. Matt Gaetz (R-FL) is being kept at arm’s length by a substantial number of his Republican colleagues as the investigation into allegations he engaged in sex trafficking appears to be coming to an end.",
    "The New Civil Rights Movement depends on readers like you to meet our ongoing expenses and continue producing quality progressive journalism.",
    "From unflinching coverage of religious extremism, to spotlighting efforts to roll back our rights, NCRM continues to speak truth to power.",
    "Three Silicon Valley giants consume 70 percent of all online advertising dollars, so we need your help to continue doing what we do.",
    "“However, Trump’s associates are often slimy or controversial and it doesn’t seem to impact his supporters.”\nEnjoy this piece?",
    "Support progressive journalism with a one-time contribution to NCRM, or click here to become a subscriber.",
    "Every reader contribution, whatever the amount, makes a tremendous difference.",
    "“Gaetz is almost as toxic as Marjorie Taylor Greene,” the official remarked.",
    "America needs independent voices like NCRM to be sure no one is forgotten.",
    "Help ensure NCRM remains independent long into the future.",
    "You won’t find mainstream media bias here.",
    "… then let us make a small request.",
    "Click here to donate by check.",
    "NCRM is independent.",
    "Thank you."
  ]
}