{
  "id": 4388,
  "mediaId": 2730,
  "date": "2022-01-20",
  "headline": "The January 6 Select Committee is Now Asking Ivanka Trump for Her 'Voluntary Cooperation,' Really",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2020/80/ce102e45-a879-4bf2-a903-db584ddb2ad5.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/01/20/january-6-select-committee-asks-ivanka-trump-for-voluntary-cooperation-n2602147",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    5065,
    2119,
    2765,
    2693,
    3621,
    4617,
    4066,
    1433
  ],
  "sentences": [
    "Ms. Trump apparently has direct knowledge of the former President’s attempt to persuade Vice President Pence to take action to stop the counting of electoral votes.https://t.co/BYuOw8BDKI\n— January 6th Committee (@January6thCmte) January 20, 2022\nThe letter is a lengthy one, as it takes eight pages to lay out the events of January 6 and what they could possibly have to do with Ivanka Trump.",
    "A later part of the letter also details how \"the Select Committee is investigating the former President's activities and conduct in the days after January 6th, including President Trump's state of mind during that period and whether the President took appropriate action regarding the continuing threats of violence.\"",
    "On Thursday Rep. Bennie Thompson (D-MS), who is the select committee's chairman, sent a letter to Ivanka Trump, the daughter of former President Donald Trump, asking her to be part of assisting with an investigation of a select committee whose members have consistently and vocally been against her father.",
    "\"The Select Committee would like to discuss this effort after January 6th to persuade President Trump not to associate himself with certain people, and to avoid further discussion regarding election fraud allegations,\" the letter reads towards the end.",
    "The letter lays out concerns to do with \"investigating efforts by President Trump to impede the count of certified electoral votes by Congress on January 6, 2021,\" as well as Trump's response to the Capitol riot that took place that day.",
    "\"Ms. Trump apparently has direct knowledge of the former President's attempt to persuade Vice President Pence to take action to stop the counting of electoral votes,\" a press release from the select committee points out.",
    "McCarthy sent out a statement refusing in a matter of hours, sharing that \"Pelosi's illegitimate select committee\" was \"not conducting a legitimate investigation\" and \"is not serving any legislative purpose.\"",
    "Source: AP Photo/Evan Vucci\nThe list of people the January 6 select committee has to come forward when it comes to \"voluntary cooperation\" with such an investigation has gotten increasingly bold.",
    "The select committee has also asked Reps. Scott Perry (R-PA) and Jim Jordan (R-OH), as well as House Minority Leader Kevin McCarthy (R-CA).",
    "McCarthy had been the most recent, with the select committee sending out a letter requesting such \"cooperation\" last Wednesday.",
    "Throughout, the letter references Ivanka as a figure many people close to the former president thought would listen to.",
    "Ivanka Trump is hardly the only key figure that the select committee has asked for \"voluntary cooperation.\"",
    "The select committee is also interested in whether Trump gave the order to deploy the National Guard.",
    "The letter asks to meet with Ms. Trump on February 3 or 4, or during the week of February 7.",
    "There's also some extra material as it pertains to a memo.",
    "All have refused."
  ]
}