{
  "id": 4446,
  "mediaId": 2614,
  "date": "2022-01-16",
  "headline": "Dead Texas Synagogue Suspect Identified As Malik Faisal Akram, All Hostages Safe",
  "image": "https://www.lifezette.com/wp-content/uploads/2022/01/2022.01.16-10.23-lifezette-61e49af993b31.jpg",
  "link": "https://www.lifezette.com/2022/01/dead-texas-synagogue-suspect-identified-as-malik-faisal-akram-all-hostages-safe/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Voice Media",
  "authorUrl": "https://www.lifezette.com/author/redvoicemedia/",
  "termIds": [
    5817,
    5897,
    3954,
    325,
    474,
    6072
  ],
  "sentences": [
    "As services were being held at the synagogue, which at the time were being live-streamed on Facebook, a man who some outlets reported as being the brother of convicted terrorist Aafia Siddiqui, who is serving an 86-year sentence for trying to kill American soldiers, had taken four hostages – including a rabbi – and was demanding from authorities that his “sister” be released from prison.",
    "Jim Jordan Completely Shreds Biden & The Dems On COVID, Elections & More In Epic Two Minute Speech [VIDEO]\nStew Peters’ Viewers Create Temporary Victory In Scott Quiner Case- Mercy Hospital Ordered To Not Kill Him\nThe opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "In our previous reporting on the incident here at Red Voice Media, local police, SWAT, and the FBI had responded to a hostage situation at the Congregation Beth Israel synagogue located off of the 6100 block of Pleasant Run Road during the afternoon of January 15th.",
    "COLLEYVILLE, TX – Local police and FBI officials confirmed that following a nearly 11-hour standoff involving a hostage situation at a Colleyville synagogue, all of the hostages were reported as being safe and the suspect was said to have been shot and killed.",
    "FBI Special Agent in Charge Matthew DeSarno credited the constant communication with the suspect during the incident as being what likely kept the hostages alive and that authorities do not believe the suspect targeted the synagogue for antisemitic purposes.",
    "“We do believe that, from engaging with the subject, he was singularly focused on one issue and it was not specifically related to the Jewish community.”\nThis piece was written by Gregory Hoyt on January 16, 2022.",
    "The incident at the synagogue started at approximately 10:40 a.m., with Akram having released one hostage by 5:00 p.m., with the remaining hostages having escaped at approximately 9:15 p.m. that evening.",
    "Authorities confirmed the identity of the deceased suspect as 44-year-old British national Malik Faisal Akram, but officials have not confirmed whether the suspect was directly related to Siddiqui.",
    "Shortly after the hostages were secured and safe, there were reports of a “loud bang and gunfire” at the scene, with officials later confirming that Akram had died from a gunshot wound.",
    "While the hostage situation was active, the suspect had proclaimed to have been in possession of explosives, but authorities have also not shared any details on whether any were found.",
    "During the fleeing of the remaining hostages, the suspect was reportedly seen following the hostages while armed but then immediately fled back inside of the building.",
    "However, authorities did not clarify whether the suspect was shot by authorities or if the fatal wound was self-inflicted.",
    "It originally appeared in RedVoiceMedia.com and is used by permission.",
    "400 Athletes Collapsing & Dying Just In The Last 6 Months?",
    "Read more at RedVoiceMedia.com:\nThe New Normal?"
  ]
}