{
  "id": 4530,
  "mediaId": 6746,
  "date": "2022-01-12",
  "headline": "Donald Trump’s Speechwriter Subpoenaed After Writing Ex-POTUS’s Pre-Capitol Riot Statement Urging Republicans To Fight Like Hell",
  "image": "https://1075914428.rsc.cdn77.org/data/images/full/268377/president-trump-departs-white-house-for-border-visit.jpg",
  "link": "https://www.hngn.com/articles/239977/20220112/donald-trumps-speechwriter-subpoenaed-writing-ex-potus-pre-capitol.htm",
  "mediaOutlet": "hngn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camille Hembrod",
  "authorUrl": "https://www.hngn.com/reporters/camille-hembrod",
  "termIds": [
    0
  ],
  "sentences": [
    "Read Also: Republican Sen. Mike Rounds Says Donald Trump's Election Fraud Claims Are Counterproductive for the Party; Ex-POTUS Calls Him 'Woke'\nBennie Thompson hopes Worthington, Schwartz will also cooperate\nIn his statement, select committee chairman Bennie Thompson said that the three individuals subpoenaed this week might have relevant information about the Capitol riot.",
    "He had nothing at all to do with the events that took place at the Capitol that day, zero involvement in organizing the rally that preceded it and was off the payroll of the Trump campaign as of Nov. 15, 2020,\" his attorney said via the Huffington Post.",
    "The letters sent to the three individuals also included the names of the committee members who wanted to know more about, namely, Taylor Budowich, Julie Fancelli, Katrina Pierson, and Caroline Wren.",
    "In his speech, Trump asked his supporters to save America, to fight like hell, and to march to the Capitol building peacefully and patriotically to make their voices heard, according to CBS News.",
    "A letter from the committee states that they want to know about the group's rally-planning activities and the involvement of two right-wing conspiracy theorists, Ali Alexander and Alex Jones.",
    "Eric Swalwell, two members of the Capitol Police, and a group of House Democrats filed a lawsuit against the ex-POTUS for allegedly inciting the insurrection on Jan. 6.",
    "Trump's lawyer wants all lawsuits to be overthrown because his speech ahead of the Capitol riot was political and should be protected by the First Amendment.",
    "Andy Surabian vows to cooperate in the investigation\nWorthington and Schwartz have not confirmed whether they will participate in the investigations or not.",
    "Donald Trump wants broad immunity from civil lawsuits\nAs of late, Trump has not yet been subpoenaed to cooperate in the ongoing Capitol riot investigation.",
    "Related Article: Ohio Rep. Jim Jordan Refuses To Cooperate in the Jan. 6 Capitol Riot Investigation, Accuses Democrats of Engaging in Partisan Witch Hunt",
    "The ex-POTUS's lawyers also argued earlier this week that he should be given broad immunity from civil lawsuits in relation to his role in the siege.",
    "\"While we plan on cooperating with the committee within reason, we are bewildered as to why Mr. Surabian is being subpoenaed in the first place.",
    "The committee also wants to gain access to communications from Trump's son and his girlfriend, Kimberly Guilfoyle, according to The Independent.",
    "One of them is Ross Worthington, Trump's speechwriter, who was responsible for drafting the ex-POTUS's speech during the \"stop the steal\" rally.",
    "US District Judge Amit Mehta listened to five hours-worth of oral arguments to help consider whether Trump's request should be granted or not.",
    "Hours before Trump's supporters flocked to the US Capitol, he encouraged them to fight like hell, or they could lose their country.",
    "However, they are unsure why the adviser, who has close ties to Trump's eldest son, Donny, is being subpoenaed in the first place.",
    "Three former Donald Trump aides have just been subpoenaed by the House select committee investigating the Jan. 6 Capitol riot.",
    "He also said that the three would hopefully join the 340 others that the committee had already interviewed.",
    "The committee also subpoenaed Arthur Schwartz and Andy Surabian, two of Trump's advisers.",
    "But Surabian, through his lawyer, confirmed that they would join in the investigation.",
    "As of press writing, Trump is facing three lawsuits from Cong."
  ]
}