{
  "id": 4558,
  "mediaId": 2724,
  "date": "2022-01-13",
  "headline": "GOP Leader McCarthy Tells Jan 6 Committee He Will Not Cooperate",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/01/2022.01.13-05.43-thepoliticalinsider-61e064acb65fc.jpg",
  "link": "https://thepoliticalinsider.com/gop-leader-mccarthy-tells-jan-6-committee-he-will-not-cooperate/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Becky Noble",
  "authorUrl": "https://thepoliticalinsider.com/author/beckynoble/",
  "termIds": [
    2119,
    2391,
    3246,
    2693,
    4617,
    4066,
    1126
  ],
  "sentences": [
    "Your attempt to pry into the deliberative process informing a Member of about legislative matters before the House is an outrageous abuse.”\nRep. Scott Perry (R-PA) has also declined to appear before the committee and has called it “illegitimate.”\nRep. Kevin McCarthy has rejected the Jan 6 committee's request for testimony: \"The committee's only objective is to attempt to damage its political opponents – acting like the Democrat Congressional Campaign Committee one day and the DOJ the next.\"",
    "For example, in advance of January 6th, you reportedly explained to Mark Meadows and the former President that objections to the certification of the electoral votes on January 6th ‘was doomed to fail.’”\nLiz Cheney on Kevin McCarthy refusing to voluntarily testify before Jan 6 committee:\n“I wish that he were a brave and honorable man\"\n— John Harwood (@JohnJHarwood) January 13, 2022\nSign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "McCarthy voiced what has become a similar belief about the committee by many Republicans: “As a representative and the leader of the minority party, it is with neither regret nor satisfaction that I have concluded to not participate with this select committee’s abuse of power that stains this institution today and will harm it going forward.”\nHe also called the committee “illegitimate.”\nPelosi’s select committee is illegitimate.",
    "House GOP Leader Kevin McCarthy announced that he would not cooperate with the Jan 6 House select committee request to voluntarily provide information, calling the panel \"illegitimate\" that is \"not conducting a legitimate investigation\" & is \"not serving any legislative purpose\" pic.twitter.com/pOi41VQTG5\n— Mona Salama (@MonaSalama_) January 13, 2022",
    "At the time, the reasons House Speaker Nancy Pelosi gave were that their appointments “may impact the integrity of the investigation.”\nMcCarthy ultimately pulled all five GOP House members he had selected for the committee, leaving only two ‘Never Trump’ Republicans who both voted to impeach him, Reps. Liz Cheney (R-WY) and Adam Kinzinger (R-IL).",
    "https://t.co/5NIZ9ffXSg\n— Newsmax (@newsmax) January 13, 2022\n‘Bipartisan’ Committee Doomed From The Start\nIt became clear early on that this committee would not be ‘bipartisan.’ When it was formed back in July 2021, McCarthy had selected five GOP members to sit on the committee, including Jordan and Rep. Jim Banks (R-IN).",
    "Assuming that Trump had a plan for the day, Thompson also stated in the letter:\n“We also must learn about how the President’s plans for January 6th came together, and all the other ways he attempted to alter the results of the election.",
    "In his response to the request, Jordan blasted the committee, saying:\n“This request is far outside the bounds of any legitimate inquiry, violates core Constitutional principles, and would serve to further erode legislative norms.",
    "— Kevin McCarthy (@GOPLeader) January 13, 2022\nCommittee Requested Voluntary Meeting\nCommittee Chair Rep. Bennie Thompson (D-MS) sent a letter to McCarthy asking to come before the committee voluntarily.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "On Wednesday, McCarthy informed the House Select Committee investigating the Jan. 6 riot at the Capitol that he would not be cooperating with the committee.",
    "Committee Has Credibility Problem\nKevin McCarthy is just the latest in a growing line of Republicans who are telling the Jan. 6 committee to take a hike.",
    "In the letter, Thompson specifically requested any communication from that day between McCarthy and former White House Chief of Staff Mark Meadows.",
    "House Minority Leader Kevin McCarthy (R-CA) is following in the footsteps of several of his GOP colleagues.",
    "On Sunday, Rep. Jim Jordan (R-OH) also announced that he would not be cooperating with the committee.",
    "Committee Chair Thompson maintains that McCarthy has information pertaining to the events of Jan. 6.",
    "However, it has not yet been determined if the committee can subpoena sitting members of Congress.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "Both Jordan and Banks were rejected by Pelosi for the committee."
  ]
}