{
  "id": 4757,
  "mediaId": 8358,
  "date": "2022-04-22",
  "headline": "Regina Freeman: Jordan visit a bridge too far for Elida",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/04/web1_letters-cmyk-35.jpg",
  "link": "https://www.limaohio.com/opinion/columns/505904/regina-freeman-jordan-visit-a-bridge-too-far-for-elida",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2119,
    444
  ],
  "sentences": [
    "She is degreed in political science, a two-time, duly elected councilwoman in the Cincinnati area and currently running for secretary of state.",
    "Letters must have a signature (unless emailed) and a full name, address and daytime telephone number (for verification purposes only).",
    "I proposed a genuine choice to him, to counterbalance the damage done by Elida’s overstep and flaunting of public school’s purpose.",
    "Young women and Black students would have been impressed with a true educator to enlighten them on things political and governance.",
    "We cannot trust you to support a neutral public-school environment that is fair, nonpartisan and values student exposures.",
    "Her column does not necessarily reflect the opinion of The Lima News editorial board or AIM Media, owner of the newspaper.",
    "Letters dealing with private disputes or containing criticism of private individuals or businesses are not published.",
    "During periods of high volume, such as prior to an election, writers can be limited to one letter a month.",
    "Interesting alternative, but not likely with illegitimate gerrymandering Jordan and his buddies promote.",
    "Elida wasn’t looking for a credible, neutral educator to enlighten students on government and politics.",
    "I asked Elida’s superintendent what policy authorizes a career politician to rally at a public school.",
    "In his 14-year career, has he introduced or sought passage of any legislation helpful to Ohioans?",
    "He said there was no policy; the school’s “position” is that any duly elected person can speak.",
    "Elida has lost my confidence as an institute of learning, accessibility and fair discourse.",
    "It was a publicly disguised effort to advance partisan platforms in advance of an election.",
    "But recently, Elida High School subjected students to a partisan rally by Rep. Jim Jordan.",
    "My future in voting for school levies that do not serve the public good is in jeopardy.",
    "They should be concise, to the point and original — no form letters, please.",
    "We can all agree schools should provide quality education to everyone.",
    "He attacked President Biden’s son, who is not an elected official.",
    "He rebuffed the offer as she is not (yet) elected to state office.",
    "And think of it: Elida has no visible minority staff or teachers.",
    "Letters are subject to editing for length, clarity and grammar.",
    "He said if Sherrod Brown wanted to come, he would be welcome.",
    "I offered an extremely qualified alumni, Chelsea Clark.",
    "3515 Elida Road\nLima, OH 45807\nEducation is important.",
    "Jordan’s presentation was divisive and not factual.",
    "Elida used our students to listen to this drivel.",
    "But there is no “policy,” just a “position”?",
    "I heard he voiced support for the big lie.",
    "We welcome letters of 275 words or fewer.",
    "Letters may be published on our website.",
    "Did he hear she was one of Elida’s own?",
    "What’s next for public schools?",
    "Regina Freeman lives in Lima.",
    "Missed opportunity, Elida.",
    "Is that policy related?",
    "That is personal.",
    "Previous"
  ]
}