{
  "id": 4886,
  "mediaId": 2636,
  "date": "2022-04-23",
  "headline": "Filing Provides New Details on Trump White House Planning for Jan. 6",
  "image": "https://static01.nyt.com/images/2022/04/24/multimedia/23dc-investigate-print/23dc-investigate-1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/23/us/politics/trump-meadows-freedom-caucus-jan-6.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luke Broadwater",
  "authorUrl": "https://www.nytimes.com/by/luke-broadwater",
  "termIds": [
    0
  ],
  "sentences": [
    "The email, which Ms. Mitchell sent to Mr. Meadows on Dec. 6, 2020, included a list of “key points” about the plan, noting, for example, that the “US Constitution gives the authority to state legislatures to appoint presidential electors.”\nMs. Mitchell had sent a version of the email one day earlier to Senator Mike Braun, Republican of Indiana, in advance of the senator appearing on television.",
    "Read the Jan. 6 Committee’s Filing in Its Lawsuit With Mark Meadows\nThe committee alleged that Mark Meadows, the final chief of staff for President Donald J. Trump, was told that an effort to try to overturn the 2020 election using so-called alternate electors were not “legally sound” and that Jan. 6 could turn violent, but he pushed forward with plans to hold a rally in Washington anyway.",
    "She said members of Congress involved in the discussions included Mr. Jordan; Mr. Perry; Representatives Andy Biggs, Paul Gosar and Debbie Lesko of Arizona; Representative Mo Brooks of Alabama; Representative Matt Gaetz of Florida; Representatives Marjorie Taylor Greene and Jody Hice of Georgia; Representative Louie Gohmert of Texas; and Representative Lauren Boebert of Colorado.",
    "WASHINGTON — Before the Jan. 6 attack on the Capitol, Trump White House officials and members of the right-wing House Freedom Caucus strategized about a plan to direct thousands of angry marchers to the building, according to newly released testimony obtained by the House committee investigating the riot and former President Donald J. Trump’s efforts to overturn the election.",
    "“They felt that he had the authority to — pardon me if my phrasing isn’t correct on this, but — send votes back to the states or the electors back to the states,” Ms. Hutchinson testified, adding that they had appeared to embrace a plan promoted by the conservative lawyer John Eastman that members of both parties have likened to a blueprint for a coup.",
    "Capitol Riot’s Aftermath: Key Developments\nTwo weeks earlier, Mr. Alexander disclosed that he had received a subpoena from a federal grand jury that is seeking information on a broad swath of people — rally planners, members of Congress and White House officials — who played a role in the political events that preceded the attack on the Capitol.",
    "?”\nThe filing also shows Mr. Meadows was in contact with Phil Waldron, a retired Army colonel with training in psychological operations who was among a group of plotters who pushed extreme plans to persuade Mr. Trump to use his national security apparatus to seize control of the country’s voting machines in a bid to stay in power.",
    "On a planning call that included Mark Meadows, the White House chief of staff; Rudolph W. Giuliani, Mr. Trump’s personal lawyer; Representative Jim Jordan, Republican of Ohio; and other Freedom Caucus members, the group discussed the idea of encouraging supporters to march to the Capitol, according to one witness’s account.",
    "Two rally organizers, Dustin Stockton and his fiancée, Jennifer L. Lawrence, have also provided the committee with evidence that they were concerned that a march to the Capitol on Jan. 6 would mean “possible danger” and that Mr. Stockton’s “urgent concerns” were escalated to Mr. Meadows, according to the committee.",
    "In his book, “The Chief’s Chief,” Mr. Meadows said Mr. Trump “ad-libbed a line that no one had seen before” when he told the crowd to march, adding that the president “knew as well as anyone that we wouldn’t organize a trip like that on such short notice.”\nMs. Hutchinson’s testimony contradicts those statements.",
    "Working with others like the pro-Trump lawyer Sidney Powell and Michael T. Flynn, Mr. Trump’s former national security adviser, Mr. Waldron circulated a conspiracy theory that foreign actors had hacked into voting machines made by Dominion Voting Systems in an effort to flip votes from Mr. Trump to Mr. Biden.",
    "They’re going to go up to the Capitol.”\nAnd, speaking about the planning call involving Mr. Meadows and Freedom Caucus members, a committee investigator asked her whether Mr. Perry supported “the idea of sending people to the Capitol on January the 6th.”\n“He did,” Ms. Hutchinson replied.",
    "Ms. Hutchinson’s testimony indicated that members of the Freedom Caucus were also involved in plans to pressure Vice President Mike Pence to throw out electoral votes from states won by Joseph R. Biden Jr. and accept false certificates claiming those states had voted for Mr. Trump.",
    "Ms. Hutchinson’s testimony and other materials disclosed by the committee in a 248-page court filing on Friday added new details and texture to what is publicly known about the discussions in Mr. Trump’s inner circle and among his allies in the weeks preceding the Jan. 6 assault.",
    "The nearly two-mile march from the president’s “Stop the Steal” rally at the Ellipse to the Capitol, where parts of the crowd became a violent mob, has become a focus of both the House committee and the Justice Department as they investigate who was responsible for the violence.",
    "This month, they pressed its author, Stephen Miller, a former top White House adviser, on whether Mr. Trump’s repeated use of the word “we” had been an effort to direct his supporters to join him in moving on the Capitol to stop Congress from certifying his defeat.",
    "In a newly disclosed email sent to Mr. Meadows on Dec. 22, 2020, Mr. Waldron included an 18-page document that he described as a “National Asset Tasking request.”\nThe document was essentially a proposal seeking presidential approval for agencies like the F.B.I.",
    "Mr. Meadows and members of the Freedom Caucus, who were deeply involved in Mr. Trump’s push to overturn the 2020 election, have condemned the violence at the Capitol on Jan. 6 and defended their role in spreading the lie of a stolen election.",
    "The idea was endorsed by Representative Scott Perry, Republican of Pennsylvania, who now leads the Freedom Caucus, according to testimony by Cassidy Hutchinson, an aide to Mr. Meadows, and no one on the call spoke out against the idea.",
    "On Wednesday, Mr. Jones revealed that he had recently asked the Justice Department for a deal under which he would grant a formal interview to the government about his role in the events of Jan. 6 in exchange for not being prosecuted.",
    "Testimony disclosed by the House committee investigating the attack showed that Mark Meadows and Freedom Caucus members discussed directing marchers to the Capitol as Congress certified the election results.",
    "It disclosed testimony that Mr. Meadows was told that plans to try to overturn the 2020 election using so-called alternate electors were not “legally sound” and that the events of Jan. 6 could turn violent.",
    "You have to show strength.” He did so after the White House’s chief of operations had told Mr. Meadows of “intel reports saying that there could potentially be violence on the 6th,” according to the filing.",
    "and the National Security Agency to search their databases for people and internet addresses connected to Dominion that Mr. Waldron thought might have information on the supposed hacking scheme.",
    "The filing also disclosed new details of Mr. Meadows’s involvement in attempts to pressure Brad Raffensperger, the Georgia secretary of state, over Mr. Trump’s loss there.",
    "When Ms. Mitchell forwarded the email to Mr. Meadows, she wrote, “This is what I prepared and sent to Sen Braun last night to help prepare him for ABC appearance this am.",
    "The committee’s filing also contained an email revealing that a pro-Trump lawyer named Cleta Mitchell also played a role in promoting the alternate elector scheme.",
    "Mr. Alexander, at the request of aides to Mr. Trump, left the speech before it was over and marched near the head of a crowd that was moving toward the building.",
    "Joining Mr. Alexander that day was Alex Jones, the founder of the conspiracy-driven media outlet Infowars, who encouraged the crowd by shouting about 1776.",
    "Rally planners, such as the prominent “Stop the Steal” organizer Ali Alexander, also had a hand in getting people to move from the Ellipse to the Capitol.",
    "Ms. Hutchinson suggested that White House lawyers had found the plan was not “legally sound” but that Mr. Meadows allowed it to move forward nonetheless.",
    "But on Jan. 6, Mr. Trump encouraged a crowd of thousands to march to the building, telling them: “You’ll never take back our country with weakness.",
    "At rallies in Washington in November and December of 2020, Mr. Trump’s supporters did not march to the Capitol and mostly refrained from violence.",
    "“I don’t think there’s a participant on the call that had necessarily discouraged the idea,” Ms. Hutchinson told the committee’s investigators.",
    "Read Document 248 pages\nThe filing is part of the committee’s effort to seek the dismissal of a lawsuit brought against it by Mr. Meadows.",
    "The Justice Department and the committee both have been investigating the question of how the crowd moved from the Ellipse to the Capitol.",
    "A spokesman for Mr. Perry, who has refused to speak to the committee, did not immediately respond to a request for comment.",
    "(Ultimately, 147 congressional Republicans voted to object to Mr. Biden’s victory in at least one state.)",
    "Even so, he pushed forward with the rally that led to the march on the Capitol, according to the filing.",
    "She said Mr. Meadows had said “in casual conversation”: “Oh, we’re going to have this big rally.",
    "Mr. Waldron wrote that he had discussed the plan with Mr. Meadows in his office the day before.",
    "Committee investigators have, for instance, obtained draft copies of Mr. Trump’s speech.",
    "People are talking about it on social media.",
    "Can the WH press office get and start using?"
  ]
}