{
  "id": 4911,
  "mediaId": 2528,
  "date": "2022-04-24",
  "headline": "A former federal prosecutor says Donald Trump and Mark Meadows 'wanted the Capitol to be taken' on the day of the riot",
  "image": "https://i.insider.com/62654b349f656600190662cb?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/ex-prosecutors-says-trump-meadows-wanted-capitol-to-be-taken-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yelena Dzhanova",
  "authorUrl": "https://www.businessinsider.com/author/yelena-dzhanova",
  "termIds": [
    0
  ],
  "sentences": [
    "In December 2020, Reps. Matt Gaetz, Jim Jordan, and other Republican lawmakers participated in calls and meetings with Trump and his aides after he lost the 2020 presidential election, according to testimony given to the committee by Cassidy Hutchinson, who served as an aide to Meadows.",
    "During these meetings, the Republican lawmakers explored avenues that \"could potentially be a constitutional and viable option to either stall certification of the election or to delay the inauguration or to assert that Mr. Trump had actually won,\" Hutchinson said.",
    "Hutchinson said in the deposition records that various Republican lawmakers, including Gaetz, Jordan, Reps. Scott Perry, Marjorie Taylor Greene, and Louis Gohmert, either met in person or dialed into meetings discussing ways to undo Biden's victory.",
    "Kirschner's remarks come after testimony given to the House panel tasked with investigating the Capitol riot revealed that Meadows plotted with Republican lawmakers to overturn the results of the 2020 presidential election.",
    "We can maybe even call it the only reasonable conclusion: That Donald Trump and Mark Meadows wanted the Capitol to be taken; that Donald Trump and Mark Meadows the angry mob to stop the certification of Joe Biden's win.\"",
    "\"Donald Trump, Mark Meadows, and others in Donald Trump's administration deprived the Capitol of the federal law enforcement forces it needed to defend itself,\" Kirschner said in a video posted to YouTube on Friday.",
    "Former federal prosecutor Glenn Kirschner believes former President Donald Trump and his former White House Chief of Staff Mark Meadows \"wanted the Capitol to be taken\" on the day of the insurrection last year.",
    "For instance, Rep. Jamie Raskin of Maryland, who serves on the Jan. 6 House panel, said the testimony brought forth before the panel will \"really blow the roof off the House.\"",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Getty Images\nA former federal prosecutor said Donald Trump and Mark Meadows \"wanted the Capitol to be taken.\"",
    "Ex-prosecutor Glenn Kirschner based his analysis on new testimony given to Capitol riot investigators.",
    "The testimony revealed Trump and Meadows plotted with Republican reps to overturn Biden's victory.",
    "Mark Meadows, left, and former President Donald Trump, right, in a composite image.",
    "The testimony helps shed light on Trump and Meadows' intentions, Kirschner said.",
    "Previously, Kirschner said the testimony is \"certainly incriminating\" of Trump.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Other political figures agree the testimony so far has been shocking.",
    "\"And that, friends, leads to one pretty compelling inference.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}