{
  "id": 4921,
  "mediaId": 2862,
  "date": "2022-04-23",
  "headline": "January 6 Probe Deposition Accuses High Profile Republicans of Involvement in Trump ‘Coup’ Plot",
  "image": "https://cdnn1.img.sputniknews.com/images/sharing/article/eng/1094997560.jpg?10816843361650735888",
  "link": "https://sputniknews.com/20220423/january-6-probe-deposition-accuses-high-profile-republicans-of-involvement-in-trump-coup-plot-1094997560.html",
  "mediaOutlet": "en.ria.ru",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ilya Tsukanov",
  "authorUrl": "",
  "termIds": [
    2119,
    2391,
    2441,
    3246,
    2765,
    2693,
    1126,
    5949,
    6175,
    6729
  ],
  "sentences": [
    "In them, the lawmaker called on Vice President Mike Pence to use his powers as president of the Senate to deem electoral votes from states in which results were contested “unconstitutional” and thus uncountable.The select committee was forced to admit in December that California Democrat Congressman Adam Schiff presented a doctored version of the text exchange between Jordan and Meadows, in which he cut out the final clause of its first paragraph, deleted the final two paragraphs, and changed punctuation, presumably in a bid to implicate the Republicans.“In addition, Mr. Meadows communicated repeatedly by text with Congressman Scott Perry regarding a plan to replace Department of Justice leadership in the days before January 6th”, the filing noted, pointing to discussions about elevating Assistant Attorney General Jeffrey Clark to the job after Attorney General Bill Barr refused to probe Trump's allegations of campaign fraud in half-a-dozen swing states.A majority of Republicans have roundly criticised the select committee’s investigation into the 6 January violence, painting it as another attempt by Democrats to permanently bar Donald Trump from running for office in 2024 after the failure of Russiagate, and two impeachments.",
    "The House Select Committee on the January 6th Attack has spent over nine months and millions of dollars investigating the January 2021 storming of the Capitol... 23.04.2022, Sputnik International\nhttps://cdnn1.img.sputniknews.com/img/07e5/01/07/1081684338_0:120:1280:840_1920x0_80_0_0_e52e2071e72c3cb2531d29e17bab5c90.jpg.webp\nA raft of senior Republican lawmakers engaged in behind-the-scenes discussions with Donald Trump and other senior administration officials as they brainstormed ways to overturn the results of the 2020 presidential election, a deposition filed as part of Democrats’ defence in the Mark Meadows lawsuit against House Speaker Nancy Pelosi and members of the 6 January Committee alleges.Meadows, Trump’s former chief of staff, took Pelosi et al.",
    "to court in December after the committee held him in contempt in a bid to block committee-issued subpoenas trying to force him to testify.The deposition, filed Friday in the US District Court for the District of Columbia, cited testimony by former Trump staffer Cassidy Hutchinson, who was said to have “brought forward” concerns about the potential for violence on 6 January that were mentioned in intel reports to Meadows.In the motion for summary judgement (i.e.",
    "The committee, staffed by seven Democrats and two never-Trump Republicans - Liz Cheney of Wyoming and Adam Kinzinger of Illinois, has been boycotted by the rest of the party.Trump denies having lost the 2020 race, accusing partisan election organisers in the swing states of Arizona, Nevada, Wisconsin, Michigan, Pennsylvania, and Georgia of widespread electoral fraud involving rigged voting machines and the dumping of unaccounted for pro-Biden mail-in ballots.",
    "a request that the judge in the case issue a ruling without a full trial), Pelosi et al.’s lawyers pointed to the presence of high-profile Republican lawmakers among those who sat in meetings with the Republican president’s officials, either in person or by phone.Among the officials cited by the filing were Ohio Congressman Jim Jordan, Florida Representative Matt Gaetz, and Pennsylvania Congressman Scott Perry.“Mr.",
    "State courts refused to hear the Trump campaign’s allegations in the days and weeks following the election, and in December 2020, the Supreme Court struck down a lawsuit by the state of Texas to challenge results in contested states.",
    "The document went on to cite text messages between Meadows and Jordan, which Democrats previously characterised as smoking-gun evidence of Jordan’s involvement in a Trump-led effort to overturn the election.",
    "Jordan was an active participant in the effort to overturn the 2020 election on January 6”, a footnote in the appeal indicated."
  ]
}