{
  "id": 4939,
  "mediaId": 2741,
  "date": "2022-04-24",
  "headline": "New Congressional Evidence: Yes, Trump Allies Knew What Was Coming on Jan. 6",
  "image": "https://media.vanityfair.com/photos/62657f17d93db66e80a071ff/16:9/w_1280,c_limit/Meadows-Jordan.jpg",
  "link": "https://www.vanityfair.com/news/2022/04/new-congressional-evidence-yes-trump-allies-knew-what-was-coming-on-jan-6",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2391,
    2119,
    2693,
    2765,
    3037,
    3621,
    4905,
    1477,
    1433
  ],
  "sentences": [
    "— Inside the Virus-Hunting Nonprofit at the Center of the Lab-Leak Controversy\n— Jared Kushner and Donald Trump Probably Won’t Be Splitting a Milkshake Anytime Soon\n— CNN Leaves the Drama Behind With Focus on War in Ukraine\n— Trump’s Truth Social Is an Even Bigger Humiliation Than Previous Business Failures\n— The Clock Is Ticking on the January 6 Investigation\n— The Washington Post Checks In, Finds Trump Is Still a Lying Sociopath\n— A Ukrainian Woman Explains the War to Europe’s Skeptics\n— From the Archive: How Playboy Imran Khan Became the Prime Minister of Pakistan\n— Not a subscriber?",
    "“Members traded theories about ways to push then-Vice President Mike Pence to single-handedly stop Biden’s election, they parried with the White House Counsel’s Office on the boundaries of the law regarding presidential electors and they met directly with Pence’s staff to encourage him to take direct action on Jan. 6, when Congress convened to count electoral votes,” Politico reported.",
    "Hutchinson’s testimony asserted that Reps. Perry, Louie Gohmert, Matt Gaetz, Andy Biggs, Marjorie Taylor Greene, and Mo Brooks were among the members of Congress involved in discussions about preventing Biden from taking office, such as by pressuring Pence to “send votes back to the States or the electors back to the States,” Hutchinson said.",
    "Jordan, Meadows, and Trump personal lawyer Rudy Giuliani were among those on a planning call during which Rep. Scott Perry, the current Freedom Caucus leader, backed the idea of encouraging people to march to the U.S. Capitol on January 6, according to testimony by Meadows aide Cassidy Hutchinson.",
    "It has been previously reported that rally organizers feared a march to the Capitol while Congress was certifying Joe Biden’s electoral win would turn dangerous; the committee has evidence that one organizer’s “urgent concerns” made their way up to Meadows, according to the Times.",
    "Information provided by the panel on Friday in their attempt to compel Meadows’ testimony also offers insight into the involvement numerous Republican members of Congress had in Trump and his inner circle’s efforts to overthrow the election in December 2020.",
    "The filing contains testimony and other materials related to discussions that aides, such as then-White House chief of staff Mark Meadows, and members of the hard-right Freedom Caucus, including Rep. Jim Jordan, had in the lead up to the fateful day.",
    "The Friday night court filing by the select panel asked a federal court to enforce its subpoena against Meadows, who for months has been trying to block the committee’s demands for him to testify and provide records, citing executive privilege.",
    "The president, Meadows wrote, “knew as well as anyone that we wouldn’t organize a trip like that on such short notice.” But Hutchinson told investigators that Meadows in “casual conversation” had said, “Oh, we’re going to have this big rally.",
    "Perry also “repeatedly” texted with Meadows about replacing Department of Justice leadership in the days before January 6th with people who may be more supportive of Trump’s evidence-free election fraud claims, according to the filing.",
    "The committee and the Justice Department “both have been investigating the question of how the crowd moved from the Ellipse to the Capitol” as they scrutinize who was responsible for the violence, The New York Times reports.",
    "Not sure it is going to happen,” Meadows said in a text message to Jordan on the morning of January 6, referring to then-Vice President Mike Pence taking unilateral action to reject the counting of electoral votes that day.",
    "“I just remember Mr. [Anthony] Ornato coming in and saying that we had intel reports saying that there could potentially be violence on the 6th,” said Hutchinson, referring to the former White House chief of operations.",
    "The House committee investigating the deadly pro-Trump insurrection disclosed a 248-page court filing on Friday that further elucidates the role of Trump allies in helping plan the Jan. 6 rally-turned-riot.",
    "“Meadows was told that plans to try to overturn the 2020 election using so-called alternate electors were not ‘legally sound,’” the Times reports, though Meadows apparently supported such efforts anyway.",
    "The new information is particularly striking given Meadows, in his book, claimed that, in telling the crowd to march to the Capitol, Trump “ad-libbed a line that no one had seen before,” per the outlet.",
    "They’re going to go up to the Capitol.”\nThe House committee also alleged that Meadows was aware before January 6 about the potential for violence on that day, but encouraged the rally anyway.",
    "“I don’t think there’s a participant on the call that had necessarily discouraged the idea,” she told investigators on the committee.",
    "Some of Donald Trump’s top allies and congressional loyalists may have had a rocky start to the weekend.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "People are talking about it on social media.",
    "Let’s talk about it,” Hutchinson recalled.",
    "“And Mr. Meadows said: All right.",
    "“I have pushed for this."
  ]
}