{
  "id": 4940,
  "mediaId": 2664,
  "date": "2022-04-20",
  "headline": "DOJ faces demands to investigate if Trump 'mutilated or destroyed' records to cover up crimes",
  "image": "https://www.rawstory.com/media-library/trump-touts-new-hotel-in-washington-as-example-of-business-success.jpg?id=24709705&width=1200&coordinates=0%2C7%2C0%2C7&height=600",
  "link": "https://www.rawstory.com/trump-letter/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessica Corbett",
  "authorUrl": "https://www.rawstory.com/u/jessicacorbett-commondreams",
  "termIds": [
    2451,
    2119,
    4905,
    4066,
    3883,
    3621,
    3468,
    2746,
    2765,
    1442
  ],
  "sentences": [
    "\"The time period during which there is a gap in the phone logs includes at least five calls from or to President Trump whose occurrence has been documented in the public record,\" the letter notes, pointing to his reported correspondence with then-Vice President Mike Pence, House Minority Leader Kevin McCarthy, R-Calif., Rep. Jim Jordan, R-Ohio, then-Sen. Kelly Loeffler, R-Ga., and Sen. Mike Lee, R-Utah—who supposedly passed his phone to Sen. Tommy Tuberville, R-Ala.",
    "The letter also lays out key events between 11:06 am—when Trump finished a call with then-Sen. David Perdue, R-Ga.—and 6:54 pm, when he had the White House operator contact an adviser who earlier this month was referred to the DOJ for not cooperating with the January 6 panel, Dan Scavino:\nPresident Trump spoke to a gathering of his supporters near the White House beginning at noon that day, less than an hour after his call with Senator Perdue.",
    "A few weeks after the revelation that White House documents turned over to the panel probing the attack on the U.S. Capitol contains a seven-hour-and-37-minute gap in call logs, a pair of U.S. groups on Monday called for an investigation into whether former President Donald Trump \"willfully mutilated and destroyed critical records of his presidency before leaving office.\"",
    "Demanding an investigation by the U.S. Department of Justice (DOJ), the groups' letter emphasizes that the \"significant gap\" in Trump records corresponds to \"a critical period when the Capitol was under attack by insurrectionists, raising the possibility that portions of the call logs were willfully destroyed to cover up evidence of criminal misconduct.\"",
    "Building on a February 8 letter — sent before the call logs were shared last month with the U.S. House select committee investigating the January 6, 2021—Citizens for Responsibility and Ethics in Washington (CREW) and National Security Archive again wrote to Attorney General Merrick Garland and Federal Bureau of Investigation Director Christopher Wray.",
    "The letter notes that U.S. District Court Judge David O. Carter concluded last month that it is \"more likely than not that President Trump corruptly attempted to obstruct the joint session of Congress on January 6,\" and that he and his ex-attorney, John Eastman, \"dishonestly conspired\" to do so.",
    "Trump's actions that day—including his furtherance of the \"Big Lie\" that the 2020 election was stolen from him—led to his historic second impeachment just days before President Joe Biden took office, though the U.S. Senate, then controlled by Republicans, declined to convict the GOP leader.",
    "\"Judge Carter's conclusions also suggest the need for further investigation to determine whether former President Trump attempted to shield his actions during the January 6th insurrection from being discovered by Congress and the public,\" the document asserts.",
    "\"The public must have confidence that all individuals—including former President Trump—will be thoroughly and fairly investigated,\" the letter adds, \"and be held accountable if they engaged in criminal misconduct to attack the heart of our democracy.\"",
    "\"As our previous letter outlines,\" the document reiterates, \"former President Trump engaged in a pattern of conduct throughout his tenure in office that violated his record-keeping obligations under the Presidential Records Act in multiple ways.\"",
    "The new call for a DOJ probe into the call logs gap comes as members of the January 6 panel are reportedly weighing whether to refer Trump to the department for prosecution.",
    "President Trump tweeted his criticism of Vice President Pence for lacking \"the courage to do what should have been done to protect our Country and our Constitution.\"",
    "At 4:17 pm President Trump tweeted a video directed to his supporters inside the Capitol urging them to go home but also telling them \"We love you.",
    "At 3:36 pm White House Press Secretary Kayleigh McEnany tweeted that President Trump had ordered the National Guard to the Capitol.",
    "\"Information contained in the missing call logs likely would help elucidate the former president's full role in those events.\"",
    "One hour later an initial wave of protestors began storming the Capitol, and by 1:30 pm they had overcome the police.",
    "Shortly after 6:00 pm police were able to clear the Capitol.",
    "Nearly one hour later at 2:24 pm.",
    "You're very special.\""
  ]
}