{
  "id": 4952,
  "mediaId": 2629,
  "date": "2022-04-24",
  "headline": "New Evidence Shows GOP Lawmakers Deeply Involved In Trump Coup",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNzA2MzYxNy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2NjAzNjcwNn0.904ALH7vFurKtN-mWA_SqIhnod7RHi9X5ftze-n_CAU/img.jpg?width=1200&coordinates=0%2C133%2C0%2C134&height=600",
  "link": "https://www.nationalmemo.com/-2657204743",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chibueze Godwin",
  "authorUrl": "https://www.nationalmemo.com/u/chibuezegodwin",
  "termIds": [
    2119,
    2391,
    2765,
    2693,
    3514,
    3621,
    4905,
    4596,
    1433,
    1126
  ],
  "sentences": [
    "Deposition testimony from Cassidy Hutchinson, a former White House aide — whom the House Select Committee deposed in February and again in March — suggests that Mark Meadows, former chief of staff, conferred with Trump’s staunchest allies in Congress by phone and in person on efforts to overturn the election results and stop then-President-Elect Joe Biden from taking office.",
    "Meadows was playing a campaign role, attempting to facilitate a strategy that would have reversed the certified results of the 2020 election.”\nIn its filing, the committee presented a text message that showed Meadows admitting to Jordan that he supported, and contributed to, efforts to pressure Pence into returning the electoral college results to the states.",
    "\"The Select Committee's filing today urges the Court to reject Mark Meadows's baseless claims and put an end to his obstruction of our investigation,\" said chairman Bennie Thompson (D-MS) and Vice-Chair Liz Cheney (R-WY) in a joint statement.",
    "New evidence reveled in a Friday federal court filing details how Republican members of Congress met with former President Trump and his top aides to brainstorm plans to overturn the result of the 2020 presidential election.",
    "“[H]e was not acting as anything like a typical White House chief of staff advising the President on official matters of government policy,” Douglas N. Letter, the House’s general counsel, said in the filing.",
    "Hutchinson’s bombshell testimony underscores the long line of Republican lawmakers who helped former President Trump in his futile efforts to overturn Biden’s victory and remain in power.",
    "The GOP lawmakers who took part in these meetings and phone calls, according to Hutchinson, were Reps. Scott Perry (R-PA), Louie Gohmert (R-TX), Jim Jordan (R-OH), and Matt Gaetz (R-FL).",
    "Plans to replace Justice Department leadership with figures sympathetic to Trump’s cause and ready to peddle falsehoods that cast doubt on the election's legitimacy were also discussed.",
    "“They felt that he had the authority to — pardon me if my phrasing isn’t correct on this, but — send votes back to the states or the electors back to the states,” Hutchinson testified.",
    "The group discussed ways to pressure former Vice President Pence not to certify the election results and sparred with White House counsel on the lawfulness of alternate electors.",
    "The testimony was part of a filing by the House Select Committee onJanuary 6, urging the court to reject Meadow’s executive privilege claims and force him to testify in person.",
    "Although Meadows had turned over thousands of text messages to the committee, he held on to over a thousand more and disobeyed subpoenas demanding his further cooperation.",
    "Hutchinson also testified that Meadows and the GOP lawmakers met directly with Pence’s staff in an attempt to convince him to go along with their scheme on January 6.",
    "Rep. Majorie Taylor Greene (R-GA), then a congresswoman-elect, Rep. Andy Biggs (R-AZ), and Rep. Mo Brooks (R-AL) also attended at least one meeting, Hutchinson added.",
    "Not sure it is going to happen,” Meadows told Jordan in the text message early in the morning on January 6.",
    "Meadows sued Nancy Pelosi and the committee last December to block requests for an in-person interview.",
    "“I have pushed for this.",
    "“Mr."
  ]
}