{
  "id": 4983,
  "mediaId": 2547,
  "date": "2022-04-23",
  "headline": "McCarthy Was Caught Lying About Trump’s J6 Guilt. Now What?",
  "image": "https://crooksandliars.com/files/mediaposters/2022/04/50015.jpg",
  "link": "https://crooksandliars.com/2022/04/mccarthy-was-caught-lying-about-trump-s-j6",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NewsHound Ellen",
  "authorUrl": "https://crooksandliars.com/team/newshound-ellen",
  "termIds": [
    5252,
    2765,
    4066,
    3809,
    1126,
    748
  ],
  "sentences": [
    "I would like the rest of both-sides media to tell me what I win, because I knew McCarthy was lying, you knew McCarthy was lying, most Black people that I ever see on television know McCarthy is lying, most hosts that would dare to have me on their show know McCarthy was lying, so for all y'all people who are surprised at the lies, what do I win?",
    "We've all (except for Trump TV) been buzzing over the recording of House Minority Leader Rep. Kevin McCarthy privately telling fellow Republicans he’s “had it” with Donald Trump, that his January 6th behavior was “unacceptable,” that “nobody can defend that, and nobody should defend it,” and that he was going to ask Trump to resign.",
    "He was asked by host Tiffany Cross, what the tapes mean about “the future possibility of a Speaker of the House, Marjorie Taylor Greene.”\nMYSTAL: I think the [Speaker’s] gavel that McCarthy has been spending his whole life trying to claw at just fell out of his hands.",
    "The sad truth is, all the clicks, ratings and book sales for the Times authors (their scoops are from a forthcoming book) will probably not help democracy nor put any roadblock in the MAGA stampede over the Republican party any more than January 6th did.",
    "We can also enjoy the schadenfreude in knowing that knives are probably out for McCarthy after the same Times article reported McCarthy said he wanted some of his own members, like Rep. Lauren Boebert, kicked off Twitter.",
    "Also, within weeks of his Jan. 10th remarks, McCarthy kissed Trump’s ring at Mar-a-Lago and began blaming security officials and Democrats for Jan. 6, as The New York Times reported.",
    "It has been all the more appealing given that McCarthy categorically denied the reports, just hours before the recording was released.",
    "What are you going to do now that you've been exposed as platforming and giving aid and comfort to an insurrectionist liar?",
    "How are you going to change your coverage so that you are now objectively pro-democracy?",
    "But is anyone really surprised that McCarthy has been proved such a liar?",
    "My question is more -- and I have this question a lot – what do I win?",
    "What do I win now that we have proven once again that lying liars lie?",
    "And the media will probably continue to legitimize the extremists.",
    "That point was made eloquently by Elie Mystal on Saturday morning.",
    "I don't think he's ever going to be Speaker of the House now.",
    "\"Oh, McCarthy lied to us but I'm sure Jim Jordan won't.\"",
    "Or are you just going cycle to the next one?",
    "Are you going to do anything different?",
    "Are you going to change at all?",
    "What are you going to change?",
    "Is that your actual answer?",
    "If anything, it will help.",
    "That's my question."
  ]
}