{
  "id": 4987,
  "mediaId": 2738,
  "date": "2022-04-23",
  "headline": "Matt Gaetz, Jim Jordan, And More Were Reportedly Even More Involved In Plans To Overturn The Election Than Previously Thought",
  "image": "https://uproxx.com/wp-content/uploads/2021/01/matt-gaetz-jim-jordan.jpg?w=1024",
  "link": "https://uproxx.com/viral/matt-gaetz-jim-jordan-gohmert-trump-plot-overturn-election/",
  "mediaOutlet": "uproxx.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Prigge",
  "authorUrl": "https://uproxx.com/author/matt-prigge/",
  "termIds": [
    2119,
    2391,
    4905,
    4596,
    2765,
    2693,
    3037,
    3514,
    6269
  ],
  "sentences": [
    "That evidence implies how deeply embedded the likes of Gaetz and Jordan were involved in the subversive planning:\nMembers traded theories about ways to push then-Vice President Mike Pence to single-handedly stop Biden’s election, they parried with the White House Counsel’s Office on the boundaries of the law regarding presidential electors and they met directly with Pence’s staff to encourage him to take direct action on Jan. 6, when Congress convened to count electoral votes.",
    "One of their members, Democratic representative Jamie Raskin, recently estimated that their findings will be made public by late summer, early autumn, promising that they will “really blow the roof off the House.”",
    "The intel comes at least partly from the more than 2,000 text messages obtained from former White House Chief of Staff Mark Meadows, during a brief period when he was playing ball with the House select committee.",
    "As per Politico, new evidence filed in federal courts on Friday suggest a number of Republican congresspeople were present at meetings or on calls laying out plans to circumvent the will of American voters.",
    "But as the Jan. 6 committee continues to Hoover up more and more intel, it seems they and other Trumpist lawmakers were even more involved in plans to overturn the results than previously thought.",
    "Others attended a late December meeting with Trump’s fumbling lawyer Rudy Giuliani to have then-vice president Mike Pence simply refuse to certify the results, which he couldn’t have done anyway.",
    "“They felt that he had the authority to — pardon me if my phrasing isn’t correct on this, but — send votes back to the States or the electors back to the States,” Hutchinson recalled.",
    "Professional nuisances and Beavis and Butt-Head lookalikes Matt Gaetz and Jim Jordan have never been quiet about spreading misinformation about the 2020 election.",
    "They include some familiar faces, like Gaetz, Jordan, and tooth-loser Louie Gohmert, as well more obscure figures like Pennsylvania representative Scott Perry.",
    "Among the revelations is that Jordan told Meadows over text that he supported attempts to send election results back to the states.",
    "They’re still trying to force him to show up, using some of the texts he gave them as evidence that his presence is required.",
    "In November, Meadows stood them up for a formal interview; he faces possible jail time.",
    "The Jan. 6 committee has been collecting evidence since July of last year.",
    "The former apparently still believes Donald Trump won."
  ]
}