{
  "id": 511,
  "mediaId": 8331,
  "date": "2022-02-24",
  "headline": "J.D. Vance: U.S. should focus more on Mexican border, Canada protests than Ukraine",
  "image": "https://www.gannett-cdn.com/presto/2022/02/24/PLAN/7e037c1e-1ef2-469c-9b81-d88ee36c26f1-NEW_20220223_JD_Vance_14.jpg?crop=5759,3240,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.newarkadvocate.com/story/news/2022/02/24/j-d-vance-u-s-should-focus-mexico-canada-not-ukraine/6914550001/",
  "mediaOutlet": "Granville Sentinel - United States - Ohio",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kent Mallett",
  "authorUrl": "https://www.newarkadvocate.com/staff/4395572002/kent-mallett/",
  "termIds": [
    0
  ],
  "sentences": [
    "That really is the story of my family.”\nkmallett@newarkadvocate.com\n740-328-8545\nTwitter: @kmallett1958\nThat's what he said\nOn the Second Amendment: \"It looks they're collecting a new database of lawful gun purchases for every citizen in this country, which is the back door to a gun registry in this country, which means effectively the end of the Second Amendment.”\nOn campaign ups, downs: “By October-November, we had so much momentum.",
    "If we had leaders half as concerned about their own border as they were about the Ukraine-Russia border, we would not have a border crisis in this country.”\nVance said he believes Trump was being tongue-in-cheek when he praised Vladimir Putin’s moves into Ukraine as “genius,” but added that President Joe Biden’s weakness allowed the situation to deteriorate.",
    "They don’t respect weakness and at the end of the day, Putin sees Biden as a weak president that he can take advantage of.”\nVance responded to a recent Gibbons television ad claiming Vance was not a true Trump supporter and once called him an \"idiot,\" and his policies \"immoral and absurd.\"",
    "\"We have real problems in this country, and we don’t have people interested in solving them.”\nHis primary election opponents include former state treasurer Josh Mandel, former Ohio Republican Party chairwoman Jane Timken, investment banker Mike Gibbons and State Sen. Matt Dolan.",
    "Vance, who made his comments before Russia's invasion escalated beyond two separatist areas that Russian President Vladimir Putin declared independent, said he’s more concerned about the drug trafficking and sex trafficking coming across the border with Mexico.",
    "If they prevented the transmission of coronavirus, we wouldn’t have coronavirus anymore.”\nMedical experts have stated the vaccines are effective, noting that almost all those who are hospitalized and die from COVID are non-vaccinated.",
    "“It’s weird to me that our leaders are so obsessed with Vladimir Putin 6,000 miles away, when what Justin Trudeau did to Canadians 300 miles away is a hell of a lot more scary to me and a hell of a lot closer to home,” Vance said.",
    "Vance, the author of “Hillbilly Elegy,” criticized Democrats, some Republicans and major U.S. corporations who bow to liberal demands, and praised former President Donald Trump at a campaign stop at Cherry Valley Hotel.",
    "Vance, a Republican candidate for the U.S. Senate, told a Newark audience on Wednesday we should be more focused on the border with Mexico and recent truckers’ protest in Canada than the Russian invasion of Ukraine.",
    "Vance was asked about the truckers’ protest against COVID vaccine mandates in Canada, where government officials invoked emergency powers to shut down what they called an illegal occupation in the capital of Ottawa.",
    "A six-week election period makes it easier to cheat.”\nOn Ukraine (as of Wednesday): “What should happen, in a perfect world, you could find some diplomatic solution, Russia doesn’t go much further, and nobody dies.",
    "He shared that his father contracted COVID and got pretty sick, acknowledging “we were pretty worried about him.”\n“His doctor said you came through it OK,” Vance said.",
    "“When mom or dad loses their job, then the parents start to fight a little bit and then divorce happens and then families tear apart, and drugs move in,\" Vance said.",
    "“I took them almost tongue in cheek, a little bit, but I think Trump is right that Putin realizes that with Biden as president he’s got a longer leash,” Vance said.",
    "Anthony Fauci doesn’t need to be serving longer term than Jim Jordan.”\nOn election fraud: “I’m one of those people who thinks we had serious problems in 2020.",
    "I think what likely will happen is he’ll probably annex a couple pieces of the eastern part of the country into Russia and then it’ll stop there.”",
    "The Middletown native who now lives in Cincinnati, seeks to replace two-term Republican incumbent Rob Portman, who will not seek a third term.",
    "He graduated from The Ohio State University, received his law degree from Yale Law School, and became a investor in Silicon Valley.",
    "Vance shared his experience growing up in Middletown when middle-class jobs left the community and families struggled.",
    "He said he does not think vaccines work and the decision to take them should be a personal choice.",
    "He has crisscrossed the state the last six weeks in his first-ever run for political office.",
    "“Hundreds of thousands of illegal aliens are coming across the border every single month.",
    "\"There’s a lot of things that happen to a town when prosperity starts to disappear.",
    "The numbers were moving and things just felt like they were going really well.",
    "“That happened in Middletown, but it’s happened all across the state of Ohio.",
    "“They make sense for some people and they don’t make sense for other people.",
    "Voter ID is how you make sure all those mail-in ballots are not fraudulent.",
    "What happened is $4 million in negative advertising was spent against me.\"",
    "We’re talking about a border 5,000 miles away between Ukraine and Russia.",
    "He spent four years in the U.S. Marine Corps, serving in Iraq and Haiti.",
    "He said our leaders let those manufacturing jobs go to China and Mexico.",
    "If you don’t want to take the vaccine, you shouldn’t take the vaccine.",
    "I was starting to tell people we’re going to run away with this thing.",
    "We need to go back to having an Election Day, not an election season.",
    "“I look at this country and I’m really worried about it,\" Vance said.",
    "That’s why it should be your individual choice to take the vaccine.",
    "“Right now, we have a wide-open U.S. southern border,” Vance said.",
    "On term limits: “I promise I won’t serve more than two terms.",
    "“I like him now because I think he was a great president.",
    "We know they don’t prevent the transmission of COVID.",
    "“I didn’t like Trump six years ago,” Vance said.",
    "You don’t check where the ballots come from.",
    "We need term limits for the bureaucrats.",
    "That’s what our leaders are focused on.",
    "“I think bullies respect strength.",
    "“And what are we talking about?",
    "It’s pretty much that simple.",
    "It’s happened in Youngstown.",
    "Politics is easy, turns out.",
    "“You’ve got the antibodies.",
    "It’s happened in Toledo.",
    "Well, it ain’t easy.",
    "NEWARK — J.D."
  ]
}