{
  "id": 5208,
  "mediaId": 2618,
  "date": "2022-04-11",
  "headline": "“New Crackdown On Gun Rights”: Joe Biden Is Making His Move Against The Second Amendment",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/11/new_crackdown_on_gun_rights_joe_biden_is_making_his_move_against_the_second_amendment_83034.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hailey Sanibel",
  "authorUrl": "",
  "termIds": [
    5802,
    4905
  ],
  "sentences": [
    "The article says that one of Joe's proposals is that \"federally licensed firearms dealers to have a serial number added to 3D printed guns or other un-serialized firearms they take into inventory.” But, as I understand it, existing law already requires a serial number for \"sale or transfer\" of any firearm to another person.",
    "The key issue there isn't if the part is serialized or not - it will be if the manufacturer and/or dealer is required to track the serial numbers and sales history, and that would be useless unless all subsequent transfers are tracked.",
    "So, Obama is getting his third term and only goes to show the whole cabal is ate up with socialism/communism because getting the guns is the only thing that will allow them to completely take over the country.",
    "Also, a requirement that manufacturers serialize 80% parts would make it easier for those who build their own and WANT a serial number (in case they decide later to sell or give it to someone else).",
    "FTA:\"To help law enforcement trace guns used in a crime, the rule would require that manufacturers include a serial number on the firearm “frame or receiver” in easy-to-build firearm kits.\"",
    "Manufacturers of partially completed pieces of plastic or metal which COULD BECOME a frame or reciever have specifically asked.....when does the raw material \"become\" a frame or reciever?",
    "The OFFICIAL word has been that if 80% or less of the manufacturing has been completed the piece of material is NOT a 'frame or reciever\", so is sold as a piece of stuff.",
    "When you do the remaining 20% of milling, drilling and more, then it can be a frame or receiver, if you don't mess it up and get a part that won't do anything.",
    "From what I see on the news, the people getting busted are often felons building guns for sale to gangs - which violates quite a number of existing laws.",
    "They've been doing it piece by piece but their lackeys in the media and democrat party are getting impatient and beginning to look over their shoulders.",
    "Will the plumbing department at the hardware store have to serial number every pipe and will I need a background check before repairing my plumbing?",
    "-- Sigh --\nBiden is run by Obama via the jackals in the WH so anything that comes out of his mouth came out of Obama's first.",
    "A \"frame or receiver\".....becomes a frame or receiver when it is machined or molded into the shape of the frame or receiver.",
    "The partially made plastic part without the necessary holes, slots, grooves, et cetera cut into it to make it work?",
    "The feds (and the states) don't seem too interested in actually prosecuting those in the \"ghost guns\" industry.",
    "I can make a working shotgun from a couple of pieces of water pipe, ZERO modification to the pipes.",
    "Those are stunts, in general, and this is about partially made gun parts, finished at home.",
    "Re #3, this isn't about the well known but essentially non-existent \"3D printed\" guns.",
    "Before it is completed....it is NOT A FRAME OR RECIEVER....so it has no serial number.",
    "Par for the course that those wanting more anti-gun laws don't know the existing laws.",
    "Plastic pellets in a bag before they are poured into the injection molding machine?",
    "Which means that the BATF is now treating \"precursor parts\" as actual firearms.",
    "Pretty soon we get to treating blocks of steel or aluminum as actual firearms.",
    "At the current time, an 80% completed frame or receiver is not a gun part.",
    "Hey FJB what about \"that shall not be infringed\" do you not understand?",
    "Is the bag plastic pellets pre-molding now a \"frame or receiver\"?",
    "If the stuff is 10% completed, is that now a \"frame or receiver\"?",
    "Would metal suppliers have to track all shipments of raw stock?",
    "That protection is written down in ink in the 2nd Amendment.",
    "The Bill of Rights are our protection from the likes of you.",
    "Just like the 1st Amendment, there are no restrictions.",
    "So, this would be a redundant law that already exists.",
    "Lets try enforcing those before we go after new laws.",
    "Is a square block of steel now a \"frame or receiver\"?",
    "That means by no means by the Federal Government.",
    "Can you not read or comprehend the written word?",
    "Existing law works just fine, if its enforced.",
    "Nor will the lying MSM discuss any of this.",
    "FJB, my God man, you were a Lawyer.",
    "But, will any of this stop Biden?",
    "Hard to see how that would work.",
    "Now.....what is the new rule??",
    "Unenforceable gobbledy goop.",
    "GIANT can of worms.",
    "Of course not.",
    "Guaranteed.",
    "Total BS.",
    "Period.",
    "None.",
    "Nada."
  ]
}