{
  "id": 5237,
  "mediaId": 2618,
  "date": "2022-04-22",
  "headline": "Secret Recording: Kevin McCarthy Told Liz Cheney He Would Tell Trump To Resign In Shocking Leaked Audio",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/22/secret_recording_kevin_mccarthy_told_liz_cheney_he_would_tell_trump_to_resign_in_shocking_leaked_audio_83711.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexander Connell",
  "authorUrl": "",
  "termIds": [
    5329,
    1738,
    2765,
    2887,
    3049,
    4066,
    4261,
    4905,
    300,
    6678
  ],
  "sentences": [
    "Former President Trump delivered the keynote speech at the Heritage Foundation’s annual leadership conference at the Ritz-Carlton on Thursday where he addressed a range of issues, chief among them being the radical left’s destruction of the American economy via the “Climate Hysteria Hoax.”“One of the most urgent tasks not only for our movement but for our country is to decisively defeat the Climate Hysteria Hoax,” the president said to the room of supporters.The president highlighted how the radical environmentalist movement has morphed from a fringe belief among America’s youth into an insidious cause that is now actively “destroying America’s economy, weakening our security, and eviscerating our Middle Class.”\nThe shocking announcement that CNN+ would be shutting down operations less than a month after it launched has left out-of-work staffers “aghast and furious” over the company’s handling of what sources inside the network call “an absolute debacle.”“This is f–king crazy, it is nuts,” a CNN insider told The Post.“This literally rivals the epic disaster of Quibi,” the insider said, referring to Jeffrey Katzenberg’s short-lived streaming platform that went out of business just seven months after it launched in April 2020.CNN+ — which one insider estimated the network spent $300 million launching and between $100 million and $200 million advertising —\nIn a leaked recording of Kevin McCarthy on a call with Liz Cheney and other House Republicans, the Minority Leader told Cheney that he would counsel Trump to resign back on January 10, 2021.",
    "In the days after the Jan. 6 attack on the Capitol building, the two top Republicans in Congress, Rep. Kevin McCarthy and Sen. Mitch McConnell, told associates they believed President Donald Trump was responsible for inciting the deadly riot and vowed to drive him from politics.McCarthy went so far as to say he would push Trump to resign immediately: “I’ve had it with this guy,” he told a group of Republican leaders, according to an audio recording of the conversation obtained by The New York Times.But within weeks both men backed off an all-out fight with Trump because they feared retribution from him and his political movement.",
    "He cited some statistics like the creation of 7.9 million jobs, including 430,000 manufacturing jobs,\nAs Democrats stare down the barrel of November’s midterm elections, President Joe Biden is hopscotching the country to sell his trillion-dollar \"roads and bridges” spending plan and rouse voter support.In remarks at an Air National Guard base in Portland, Oregon, Biden placed the trillion-dollar bill in historic terms.“Thanks to the infrastructure law, we’re making the most significant investment to modernize roads and bridges … since Eisenhower’s interstate highway system,” he said Thursday.",
    "“We get up and get out to the bus stop by 6:55 in the morning\nThe handyman lover who allegedly butchered Queens mom Orsolya Gaal was captured on surveillance video returning home the morning of the murder with what appears to be crude bandages on one hand.David Bonola, 44, was seen walking down 114th Street near his Richmond Hill apartment around 6:05 a.m. Saturday morning — just hours after cops say he slaughtered Gaal in the basement of her Forest Hills home.",
    "There are currently 16 Republicans and 11 Democrats representing Florida in the U.S. House of Representatives and the new map, which also adds an additional district, increases Republicans’ dominance in the state to what will likely amount to a 20-8 margin over the Democrats.The new map effectively targets seats held by Rep. Al Lawson (D-FL), Rep. Charlie Crist (D-FL), Rep. Stephanie Murphy (D-FL), and potentially Rep. Val Demings (D-FL).",
    "To reinforce how important he believed the bill to be, Biden quipped that he “wrote the original one with my own paw.”\nFlorida Democrats reportedly erupted Thursday on the House floor as they were powerless to stop the Republican-led body from passing a new congressional map that is expected to yield favorable results for the GOP.",
    "Sarah Palin is standing on the back deck of her father’s home in Wasilla, Alaska, spending the day like she usually does: getting her youngest child, Trig, ready for school while checking in with her 84-year-old dad as he adjusts to life without her mom, who passed away suddenly last year.",
    "Chris Licht, the network’s incoming president, told staff, “While today’s decision is incredibly difficult, it is the right one for the long-term success of CNN.” Wallace took a shot at Fox News after he left, saying that working at the network had become “unsustainable” for him.",
    "'It was like an empty desert out there despite spending hundreds of millions of dollars and the hiring of low-rated Chris Wallace, a man who tried so hard to be his father, Mike, but lacked the talent and whatever else is necessary to be a star,' he continued.",
    "'We've done one hell of a job,' the president said Thursday afternoon at a high-dollar fundraiser at the Portland Yacht Club, co-hosted by The New Republic's owner and editor Win McCormack and his political consultant wife, Carol Butler.",
    "Former President Donald Trump on Thursday celebrated the demise of CNN+ after just three weeks by calling it a 'empty desert' and mocking 'low-rated' Chris Wallace - a nemesis especially after the first 2020 presidential debate.",
    "“I think [impeachment resolutions] will pass, and it would be my recommendation you should resign,” McCarthy said he would tell Trump before further adding, “what he did is unacceptable.",
    "'If we lose the House, this is no joke -- January 6 was a trial run and a lot of people don't seem to understand that,' the New York Democrat said at a town hall in Queens on Wednesday.",
    "Rep. Alexandria Ocasio-Cortez has said that the US Capitol riot last January was a 'trial run' and that Congress could come under mob attack again if Republicans regain a majority.",
    "“Trig goes to public school at a really great special needs program at Wasilla Middle School,” Palin told The Post about her 14-year old-son, who was born with Down syndrome.",
    "Nobody can defend that and nobody should defend it.”Liz Cheney had pressed McCarthy about whether Trump could possibly choose to resign on his own: “Is there any chance?",
    "'Congratulations to CNN+ on their decision to immediately FOLD for a lack of ratings, or viewers in any way, shape, or form,' Trump said in a statement.",
    "President Joe Biden suggested Democrats were having political trouble because Americans were unaware of the party's accomplishments.",
    "Biden said that 'because things have moved so rapidly, so profoundly' that 'they don't know a lot about what we've already done.'",
    "Fox News host Greg Gutfeld repeatedly slammed former colleague Chris Wallace during “The Five” on Thursday after Warner Bros.",
    "Discovery announced that it was closing CNN+, a new subscription streaming service that Wallace left Fox News to join.",
    "In the clips obtained by The Post, Bonola has what appears to be a white bandage wrapped around his left hand.",
    "'The only reason it wasn't worse is because Democrats had the House, and they didn't have the votes.'",
    "'It was a trial run, and they're going to come back if they win the House,' she continued."
  ]
}