{
  "id": 525,
  "mediaId": 2569,
  "date": "2022-02-22",
  "headline": "Delegation for 2.22.22: Foggy — Olympic shade — fake holidays — truckin’ — end hate",
  "image": "https://floridapolitics.com/wp-content/uploads/2021/11/green-capitol-money-Large.jpeg",
  "link": "https://floridapolitics.com/archives/499375-delegation-for-2-22-22-foggy-olympic-shade-fake-holidays-truckin-end-hate/",
  "mediaOutlet": "floridapolitics.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "33min\nAbraham Lincoln\nAl Lawson\nBill Posey\nBrian Ballard\nBrian Mast\nByron Donalds\nCharlie Crist\nDarren Soto\nDebbie Wasserman Schultz\nDelegation\nFeatured Post\nFlorida Delegation\nFrederica Wilson\nGeorge Washington\nGreg Steube\nGus Bilirakis\nJoe Biden\njohn rutherford\nKathy Castor\nLois Frankel\nMarco Rubio\nMaria Elvira Salazar\nMario Diaz-Balart\nMark Foley\nMartin Luther King\nMatt Bryza\nMatt Gaetz\nMichael Waltz\nNancy Pelosi\nNicolas Maduro\nRick Scott\nRon DeSantis\nScott franklin\nSheila Cherfilus-McCormick\nStephanie Murphy\nStephen Breyer\nTed Deutch\nVal Demings\nVern Buchanan\nFog of war\nRussia sent troops into Ukraine Monday as the world faced a renewed prospect of a war in Europe.",
    "I’m hopeful we’ll continue to send people like that to Washington because that’s the only way you get things done, and you see a real reflection of what the American people want.”\nDefending the peace\nOrlando Democrat Val Demings last week honored the National Latino Peace Officers Association by entering a recognition of the group’s 50th anniversary into the Congressional Record.",
    "I also am concerned about some of the forces I am seeing in the extremes of both parties that are intolerant to votes that are anything short of Party unity, if you are looking at what’s going on with the Republicans for the members who voted for the infrastructure bill and you look at what has happened in our own Party when members vote their constituents as opposed to Party.",
    "Feb. 22, 2017 — “Donald Trump administration rolls back protections for transgender students” via The Washington Post — The Trump administration revoked federal guidelines specifying that transgender students have the right to use public school restrooms that match their gender identity, taking a stand on a contentious issue that has become the central battle over LGBT rights.",
    "When reports came out that the White House may not issue sanctions based on the presence of troops in eastern Ukraine alone, he posted, “this is the definition of appeasement.”\nReuters reports that the White House ultimately announced new economic sanctions, including plans to bar U.S. financial institutions from processing transactions for major Russian banks.",
    "I really believe that the brightest, hardest-working conservative leaders we have in the House should be leading the House, and I believe most of the leaders would agree with me on that.”\nReadable bills\nWho has time to read anymore — especially if the text is littered with legal references and footnotes directing to other statutes?",
    "pic.twitter.com/WFGPGOuqS1\n— Rep. Frederica Wilson (@RepWilson) February 21, 2022\nOn this day\nFeb. 22, 1972 — “Richard Nixon meets with Chairman Mao Zedong” via The New York Times — President Nixon‘s weeklong summit conference in China quickly reached a high point yesterday in a surprise meeting with Chairman Mao.",
    "“I’m announcing a bill next week to end the pointless vax mandates on international truck drivers that are hurting these workers and our economy.”\nHe said the Biden administration imposed unnecessary border controls on the north while ignoring problems on the southwestern border of the U.S. with Mexico.",
    "That allowed them to build up their military and allowed an opening of resources to them, and now the Russians have gone directly into eastern Ukraine.”\nOlympic shade\nWhatever reviews come in for the showmanship of the Olympics closing ceremony, don’t expect any stars from Sen. Rick Scott.",
    "“These incidents will not be tolerated, and I know that the Sarasota Police and Sarasota Sheriff’s office are working to bring those responsible to justice quickly.”\nSteube also alluded to a resolution he filed after Democratic Rep. Ilhan Omar made comments widely viewed as antisemitic.",
    "“As a former 27-year law enforcement officer and Chief of Police, I offer my wholehearted congratulations to the National Latino Peace Officers Association on 50 years of dedicated service,” said Demings, who served as Orlando’s police chief before holding elected office.",
    "“In this capacity, she recognized and promoted diversity and equity within her agency.”\nStop H8\nAfter antisemitic messages were hurled in weighted plastic bags on Sarasota-area doorsteps, Longboat Key Republican Vern Buchanan spoke out at a “United Against Hate” rally.",
    "Officials with the federal Education and Justice departments notified the U.S. Supreme Court the administration is ordering the nation’s schools to disregard memos the Barack Obama administration issued during the past two years regarding transgender student rights.",
    "Because of your work, communities around our nation have higher standards of policing.”\nKenneth Chavez, national president of the National Latino Peace Officers Association, praised the Congresswoman, who is challenging Rubio for his Senate seat this year.",
    "“Weakness always invites aggression,” he tweeted, “and weakness in response to aggression always invites others to be aggressive as well.”\nSome Republicans in the House laid responsibility for Russia’s actions on President Joe Biden’s administration.",
    "This change would help members of Congress and their constituents more easily read and understand the purpose of each bill and the effect it would have on the public.”\nThat’s actually standard practice in state legislatures, including in Florida.",
    "She fights for all of us, and she has traveled all over the United States and abroad.”\nBiden at the event presented children’s books for families and praised corporate and nonprofit partners in the effort, including Disney and Blue Star Families.",
    "But what Trump understood was the value of not being so predictable.”\nMeanwhile, Rep. Michael Waltz, a St. Augustine Beach Republican who advised former Vice President Dick Cheney on military matters, called for severe and immediate sanctions.",
    "He congratulated Florida speed skaters Erin Jackson for winning gold in the 500-meter speedskating, Brittany Howe for bronze in the 1,000-meter-long-track speedskating, and Joey Mantia for bronze in the team pursuit long-track speedskating.",
    "“You are helping us to put on a fantastic event for children here today, and I’m so grateful for your dedication to this effort.”\nWilson, meanwhile, said she’s relishing having a working first lady in the White House dedicated to education.",
    "Federal statute, in fact, still designates the federal holiday on the third Monday in February as Washington’s Birthday, even though most calendars and even many federal government documents have called it Presidents Day since 1971.",
    "pic.twitter.com/5bmMHPAkOu\n— Rep. Vern Buchanan (@VernBuchanan) February 20, 2022\nContinuing education\nFrederica Wilson welcomed First Lady Jill Biden to support military families stationed at U.S. Coast Guard Air Station Miami.",
    "The Chinese athlete previously alleged a Chinese government official sexually assaulted her, then recanted her story after disappearing for months when the government made her available for supervised interviews with the IOC.",
    "God willing and health notwithstanding, I’ll have an opportunity at another point in my career to continue to serve this country.”\nMurphy stressed that the redistricting process in Tallahassee had no impact on her decision.",
    "For those curious about how America got to this place, former President Rutherford Hayes signed a federal law in 1880, making Feb. 22 a holiday, called Washington’s Birthday, initially only for D.C. federal employees.",
    "The session was followed by an exchange of banquet toasts with Premier Zhou Enlai in which both leaders stressed common interests, and by extensive rounds of itinerant glass-clinking in the Great Hall of the People.",
    "He asked Dobbs if a good result, rather than seeing Minority Leader Kevin McCarthy ascend to Speaker of the House, would be the elevation of Ohio Republican Jim Jordan, a popular figure among the right-wing base.",
    "“Many schools no longer teach real history, so make sure your children know George Washington was a great man, our greatest President, and made life better for every American who ever lived,” the Senator posted.",
    "“Today is Washington’s Birthday.”\nPresidents Day actually took place Feb. 21 this year, and former President George Washington’s Birthday is Feb. 22 (or maybe it was Feb. 11 — let the historians duke that out).",
    "At home, Democratic and Republican leaders must stand united against an enemy of freedom.”\nFor the most part, representatives from Florida agreed in a need for consequence, but unity wasn’t part of the message.",
    "Still, the day expanded scope more along the way and “has gained a stronghold on the public consciousness to honor all U.S. Presidents,” according to the U.S. Government Publishing Office.",
    "Jacksonville Republican John Rutherford wants to change how bills are read in Congress to make them more consumable by the general public, not to mention for members of the body.",
    "The Congressman there raised the possibility of a sort of Freedom Caucus takeover of the House should the America First plank of the Party drive Republican victories in November.",
    "“The Readable Legislation Act requires every bill that amends current law to show all changes in full, rather than use technical language to refer to omissions and insertions.",
    "He has also filed a bipartisan resolution stating that the U.S. Senate won’t tolerate China’s role, or the IOC’s complicity, in allegedly silencing tennis star Peng Shuai.",
    "Rep. Matt Gaetz, a Panhandle Republican and longtime war critic, for months sounded off against focusing attention on an issue in the Eastern Europe sphere of influence.",
    "“The Biden administration’s response is, well, let’s sanction that portion of eastern Ukraine, not sanction the Russians,” said Rep. Greg Steube in a Newsmax interview.",
    "“The text of bills introduced in Congress often includes confusing references to federal law and U.S. Code that make them difficult to understand,” Rutherford said.",
    "“But I’ve always believed that my job here was to represent my constituents and my loyalty and my fidelity was to them, not to any party or any person in Congress.",
    "The world is a much more dangerous place today than before President Biden took office.”\nAnd yet the world events also exposed new fissures on the American right.",
    "The Naples Republican slammed the hypocrisy of the Chinese government, promoting messages of “One World, One Family” while forced labor of the Uyghurs continues.",
    "“I do worry a bit about the number of moderate voices that will exist in the Congress in the next cycle, simply because there are a number of factors,” she said.",
    "While I wish that we could have celebrated in person this year, it was my honor to enter my congratulations on your powerful work into the Congressional Record.",
    "Rubio holds a gripe that the improper name of “Presidents” has taken precedence and made clear his admiration for the United States’ first commander in chief.",
    "“Putin has ordered forces into the separatist regions of Ukraine for so-called ‘peacekeeping’ purposes,” posted Rep. Charlie Crist, a St. Petersburg Democrat.",
    "Those memos said that prohibiting transgender students from using facilities aligned with their gender identity violates federal anti-discrimination laws.",
    "Steube, the other Congressman representing Sarasota County in the House, didn’t attend but showed his support in a lengthy statement released to media.",
    "He tied ending the Keystone XL pipeline in the Western U.S. to Russia’s boldness, saying the move led to greater use worldwide of Russian oil supplies.",
    "Last week, Canadian Prime Minister Justin Trudeau invoked emergency powers to stop demonstrations that closed down transportation corridors in Ottawa.",
    "The IOC has lost all credibility and must be stripped of its tax-exempt status in the U.S. now.”\nScott has filed legislation that would do just that.",
    "Demings is uniquely qualified to understand and appreciate the work of the NLPOA as she served as the first woman police chief of Orlando,” he said.",
    "“We’re bringing together every part of our government and partners across the sectors to make sure that you have what you need to thrive,” she said.",
    "“Thank you to all of America’s dedicated Latino police officers for their service, bravery, and commitment to our communities and our constitution.",
    "He decried National Security Adviser Jake Sullivan’s statements that the U.S. will defend all NATO territory, noting Ukraine isn’t a part of NATO.",
    "Florida’s junior Senator remains angry at the International Olympic Committee (IOC) for providing the communist nation a platform for propaganda.",
    "She did express the fear that she was leaving Congress in a more divided state and felt tremendous pressure at times as a centrist in the House.",
    "We must stand united against hate.”\nThe Congressman shared the stage with prominent local Democrats like Sarasota City Commissioner Hagen Brody.",
    "Meanwhile, Scott said he would file the Truckers Act this week that would end any requirement on the part of the U.S. for proof of vaccination.",
    "Here comes the General\nMost federal government employees enjoyed a day off for Presidents Day, but Rubio clarified his opinion on the holiday.",
    "At that time, an effort was made to recognize the birthdays of both Washington and former President Abraham Lincoln, who was born on Feb. 12.",
    "Regardless, she said she feels confident she could run even in a closer race and has consistently outperformed other Democrats on the ballot.",
    "“And the worst is yet to come.”\nFlorida’s senior Senator and a consistent foreign policy hawk argued the U.S. must take an aggressive stance.",
    "I have been a public servant at the Department of Defense, left for eight, almost 10 years, and then came back and ran for public office.",
    "“This is functionally Biden gaslighting an invasion of Ukraine because their administration is saying they won’t defend it,” Gaetz said.",
    "The NLPOA has been an important partner in this effort, working to create new career opportunities for America’s Latino police officers.",
    "There, a logistical backup has resulted from truckers who won’t show required proof of COVID-19 vaccination to enter the United States.",
    "The day of the week that the birthday was recognized shifted with the passage of the Uniform Monday Holiday Law, implemented in 1971.",
    "“We are again witnessing the results of a feckless foreign policy of appeasement,” said Rep. Mario Díaz-Balart, a Miami Republican.",
    "The bill’s requirement would be for any law referenced in a bill to have its text appear with the changes that are being proposed.",
    "“We know how critical it is for law enforcement departments to have well-trained officers that reflect the communities they serve.",
    "“We are where we are today because they lifted Trump-era sanctions on the Nord Stream 2 pipeline,” the Sarasota Republican said.",
    "“By lifting those sanctions, the Biden administration opened up billions upon billions of dollars of revenue straight to Moscow.",
    "“This incursion is a clear violation of international law with the ongoing threat of a large-scale Russian military operation.",
    "Murphy stunned many when she announced she would not seek another term in the House, just months after exploring a Senate bid.",
    "This afternoon, Nixon and Zhou held a second working session, sitting down for talks at a long, green table in the great hall.",
    "“Redistricting has darker blue and darker red seats, where the primary concern is a Primary Election, not a General Election.",
    "In response, members of Florida’s delegation spoke up — and in some instances, spoke out — on how the U.S. should respond.",
    "“My goal is to make sure my constituents can easily access and understand what Congress is working on.”\nNext for Murphy?",
    "Think the Biden admin applied that rule to the 2+ million migrants that illegally crossed the southern border last year?",
    "A Senate-approved map leaves her district reasonably intact, but a proposal under consideration in the House does not.",
    "“It is nearly impossible for the public to understand striking or amending sections of the Federal Code,” Mooney said.",
    "As a fellow educator, I commend her for traveling the nation, working to improve the lives of our youngest minds.",
    "Incredible turnout and show of support for the Jewish community at today’s United Against Hate rally in Sarasota.",
    "Our country was founded upon liberty after our Founders suffered religious persecution in England for decades.",
    "Thank you Dr. Biden for welcoming me to join your meeting with families stationed at @USCG Air Station Miami!",
    "A few Olympic moments earned recognition from Scott and other members of Florida’s congressional delegation.",
    "It’s a shift that could lead to a more straightforward understanding of government and more transparency.",
    "“America and our allies must send a single message: Russian aggression will lead to severe consequences.",
    "“This weakness is dangerous for Americans and our allies and now is being exploited by our adversaries.",
    "Truck yeah\nScott said it’s time for Congress to intervene on a border crisis — at the Canadian border.",
    "“I don’t necessarily believe in a particular path toward what I might do in the future,” Murphy said.",
    "“Communist China used the Olympics to whitewash its Uyghur genocide, and the IOC played right along.",
    "Sen. Marco Rubio minced no words in characterizing the actions of Russian President Vladimir Putin.",
    "Gaetz criticized Biden’s “utter predictability” on Russian interactions on his Firebrand podcast.",
    "“She’s a community college teacher, and we just love that she still wants to teach,” Wilson said.",
    "“Right now, every foreign trucker bringing goods into the U.S. has to show proof of vaccination.",
    "Sanctions now.”\n“Putin has now created a pretext for invasion,” the Winter Park Democrat wrote.",
    "Having young children at home primarily drove her decision, she told reporter Samantha-Jo Roth.",
    "That’s why it’s so important we call this hatred for what it is — it’s not just anti-Semitic.",
    "Gaetz hosted conservative media commentator Lou Dobbs on his Firebrand podcast last week.",
    "And so, we love children, and we want to see them prosper,” the Hollywood Democrat said.",
    "That move comes as many delegation Democrats are also calling for an economic response.",
    "They are essential to U.S. supply chains and deserve our full support,” Scott tweeted.",
    "He introduced the Readable Legislation Act with West Virginia Republican Alex Mooney.",
    "Except in the Rubio household, where the modern major general never said goodbye.",
    "Delegation is published by Peter Schorsch and compiled by Jacob Ogles.",
    "It needs energy, vibrancy, and new blood in leadership,” Dobbs said.",
    "Dobbs said he’d welcome that but also threw Gaetz’s name in the mix.",
    "But she told Spectrum News she’s not necessarily done with politics.",
    "“I certainly wouldn’t send American troops to defend Ukraine either.",
    "… You bet I could be excited about Jim Jordan, as you well know.",
    "“I ran a four-month campaign and unseated a 24-year incumbent.",
    "He says those powers may need to be extended, Reuters reports.",
    "“We must stand united against anti-Semitism,” Buchanan said.",
    "“I want you to know that she fights for military families.",
    "“What has happened in our community is reprehensible.",
    "It was a pleasure to welcome @FLOTUS to District 24!",
    "“The mistreatment of truck drivers needs to end now.",
    "“Nothing Joe Biden does makes sense.”\nSpeaker Gaetz?",
    "In America, we hold dearly the freedom of religion.",
    "“We must stand united against this evil ideology.",
    "But such a change never made it through Congress.",
    "We must stand united against this evil ideology.",
    "“Presidents Day is a fake holiday,” he tweeted.",
    "We must stand united against anti-Semitism.",
    "Still, that’s not Rubio’s actual point.",
    "“Russia has invaded Ukraine,” he said.",
    "It’s also anti-American,” Steube said.",
    "“Disgusting appeasement,” he tweeted.",
    "I think you should be there as well.",
    "She’s a teacher, and I’m a teacher.",
    "We must stand united against hate.",
    "She fights for Gold Star families.",
    "Neither would (Donald) Trump.",
    "Bullies respond to strength.",
    "“The Party needs strength.",
    "Nope,” the Senator wrote.",
    "Biden and I share a lot.",
    "She fights for children.",
    "I think highly of him.",
    "I think highly of you.",
    "“It’s that simple.",
    "It needs vision.",
    "“Rep.",
    "“Dr."
  ]
}