{
  "id": 5259,
  "mediaId": 2618,
  "date": "2022-04-11",
  "headline": "Exclusive — Andy Biggs: Biden Could Bring 30K Illegal Aliens to U.S. Border Every Day with End of Title 42",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/11/exclusive__andy_biggs_biden_could_bring_30k_illegal_aliens_to_us_border_every_day_with_end_of_title_42_83011.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "",
  "termIds": [
    2426,
    4905,
    4066,
    392,
    1126
  ],
  "sentences": [
    "Just consider the public schools all over the country that are going to be mandated by the federal courts to appropriately educate all those tens of thousands, and maybe many more, foreign born children who don’t speak English and who are miles behind in their learning and studies compared to American children and who will not be the same age as American children in any particular grade.",
    "So don’t be surprised if the wimpy Republicans led by RINOS, in a very stupid Republican strategy, don’t move to effectively commit long-term political suicide by joining Biden and the Democrats to grant a Democrat designed “path to citizenship” amnesty to the 25 million or so illegal aliens now in the USA and put them on a path to citizenship and US voting rights.",
    "Biden and the Democrats will not stop anything regarding mass uncontrolled illegal immigration, as they think they are giving birth to tens of millions of future socialist oriented foreign born voters who will embrace socialist Democrat politics and can easily be transformed into future Democrat voters to keep them, the Democrats in permanent political power.",
    "But yesterday McCarthy the Republican leader in the House, who believes that he will be the Speaker of the House if the wimpy Republicans gain control of the House after the November election, advised that the wimpy Republicans will not use the political impeachment process to impeach Biden?",
    "Common sense will tell you that ill conceived action in Congress would completely undermine controlling the borderline in the future, no matter what Biden and other DC “UniParty”politicians claim, by encouraging and inviting millions more illegal aliens to gain unlawful entry to the USA.",
    "McConnell the wimpy Republican leader in the Senate says that if the wimpy Republicans then control Congress that they will draw his friend Biden back to the political center as he sees it.",
    "Clearly when it comes to Biden he has been ignoring the immigration laws passed by Congress by allowing masses of illegal aliens to enter and stay in the USA in violation of those laws.",
    "We're not paying to send them home; we're confiscating every dime they made while here and using those funds to put them on the other side of our borders.",
    "That means the 17, 18, and 19 year old foreign born new students will be places in much lower grades with say 12, 13, and 14 year old American students.",
    "Resulting in 17, 18, and 19 year old foreign born boys half the time being placed in classes with 12, 13, and 14 year old American girls.",
    "Why doesn't someone from our side announce that once brandon is out, they will be forced to go back home the same way they came here.",
    "The US Constitution requires that a President faithfully administer and enforce the laws of the land passed by Congress.",
    "GOP “leadership” has lockjaw regarding the millions of criminals who have entered the country over the past 15 months.",
    "We have to start asking business owners and workers who come to our homes if the workers are here illegally.",
    "Anyone with any common sense will recognize the problems that are very likely to pop up in such situations.",
    "It will probably be double that number and Biden should not be allowed to get away with it.",
    "All democrats in Congress and more rinos than you know are on board with the invasion.",
    "What about the strain on health care, public schools and law enforcement?",
    "This is how the communist dream to overwhelm the systems is achieved.",
    "Tho we know the Republicans don't have the numbers right now.",
    "I have no use for Kevin, Mitch, and all the other phonies.",
    "Biden, by doing that, has set himself up for impeachment.",
    "Don't be evil towards them, but don't be nice either.",
    "Border security is one of the laws of this country.",
    "But come Nov. and in January that's another story.",
    "Biden won't end up with a Presidential library.",
    "He's going to have Presidential ice cream shop.",
    "He's sworn to uphold the laws of this country.",
    "Where are the invaders going to live?",
    "There is a critical housing shortage.",
    "He has violated his oath of office.",
    "He should be impeached immediately.",
    "The average used car cost $29,000.",
    "What are they going to drive?",
    "\"Waffle cones for everybody!\"",
    "30,000 is a low-ball figure.",
    "If so, don't hire them.",
    "Let them feel unwanted.",
    "We're too dang nice.",
    "So stop him, Andy!",
    "We are sold out.",
    "No joke."
  ]
}