{
  "id": 5373,
  "mediaId": 2557,
  "date": "2022-04-10",
  "headline": "VIDEO: GOP Rep. Jordan: Hunter Biden’s text messages ‘tie in the entire family’",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-1183467548-e1588164748972.jpg",
  "link": "https://dennismichaellynch.com/video-gop-rep-jordan-hunter-bidens-text-messages-tie-in-the-entire-family/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    0
  ],
  "sentences": [
    "BREAKING: DeSantis signs bill stripping Disney of self governing status, and more…\nBREAKING: Update on TX National Guard soldier presumed drowned trying to rescue migrant from river\nREPORT: Politico publishes photos of Madison Cawthorn wearing lingerie, Cawthorn responds\nUPDATE: Police release name, photo of ‘person of interest’ in DC shooting, terrifying footage posted of gunfire\nREPORT: ‘The Five’ Host Can’t Stop Making Fun Of Chris Wallace Now That CNN+ Went Belly Up",
    "Jordan, the top Republican on the House Judiciary Committee, spoke out about the messages found on the first son’s abandoned laptop — first reported by The Post last July — on Fox News’ “Sunday Morning Futures.”\nThe article goes on to state the following:\nTexts and emails on Hunter Biden’s computer showed that he had to foot the bill for some of his father’s expenses.",
    "But don’t worry, unlike pop, I won’t make you give me half your salary.”\n“Remember what Joe Biden said in the debates 18 months ago, he said he didn’t do anything wrong and Hunter wasn’t taking money from business interests with connections to China,” Jordan said on “Sunday Morning Futures.”\nWATCH:\nListen to the latest daily DML podcasts below!",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by NYPost.com:\nRep. Jim Jordan said The Post’s story revealing how Hunter Biden covered expenses for his president dad shows how “involved” Joe Biden was in his son’s shady business dealings.",
    "“I hope you all can do what I did and pay for everything for this entire family for 30 years,” Hunter Biden wrote to his daughter back in January 2019, referring to his father.",
    "This was a family operation, including his uncle, as I said before,” Jordan said, referring to Biden’s brother James.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "To get more information about this article, please visit NYPost.com.",
    "“One, it sure looks like Joe Biden was involved.",
    "“It’s really hard.",
    "Then please share."
  ]
}