{
  "id": 5432,
  "mediaId": 2618,
  "date": "2022-04-11",
  "headline": "LinkedIn reinstates Air Force vet's post after wrongfully calling it 'hate speech,' apologizes",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/11/linkedin_reinstates_air_force_vets_post_after_wrongfully_calling_it_hate_speech_apologizes_83046.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Megan Myers",
  "authorUrl": "",
  "termIds": [
    4794,
    1423,
    514,
    716,
    6678
  ],
  "sentences": [
    "That contract makes those individuals responsible for fulfilling their end of the contract, not anyone of us who paid our college bills, no matter how the $$$ was earned to pay our educational debt.",
    "LinkedIn cannot stand that Gretchen Smith stated her truth that she, like the rest of us, do not owe hard earned money to those individuals who are idebted for their college education.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "(Photo) Smith on Thursday shared her story on LinkedIn about rising from poverty to holding four college degrees after serving in the Air Force.",
    "LinkedIn reinstated an Air Force veteran's post and apologized after wrongfully accusing her of violating the platform's hate speech policy.",
    "I just canceled my LinkedIn account and told them it was because of their 'Sh.....y treatment of Gretchen Smith' among other things.",
    "I have never received anything of worth from LinkedIn, and see no reason to continue allowing them to think I value their services.",
    "It was due to the Present Regime’s GOVERNMENT allowing a CORPORATION to determine what is permitted speech and thought, IN AMERICA.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "How was this power of “hate speech” determination and punishment allowed to a corporation, without due process?",
    "\"Freedom has been secured with our blood, sweat, lives and tears,\" the veteran, Gretchen Smith, told Fox News.",
    "LinkedIn cannot stand that Gretchen Smith earned multiple college degrees while being in military service.",
    "LinkedIn cannot stand Gretchen Smith earned her degrees by hard work and assistance of the GI Bill.",
    "I can’t seem to recall ANY mention of LinkedIn in the US Constitution, nor in the FIRST AMENDMENT.",
    "I do not owe any of my money to those who cannot pay due to whatever circumstances.",
    "LinkedIn also cannot stand that Gretchen Smith is helping her fellow former GIs.",
    "Your donation helps keep our discussions going and our voices heard.",
    "Vote accordingly or practice your bowing and scraping technique.",
    "This “walk-back” was not due to an “error” on LinkedIn’s part.",
    "She wrote that she is \"not responsible for your student debt.\"",
    "\"I am grateful LinkedIn reinstated our account,\" she added.",
    "LinkedIn cannot stand that Gretchen Smith is a former GI.",
    "\"Now we can resume focusing on veterans in crisis/need.\"",
    "It was not a mistake by LinkedIn, it was intentional.",
    "\"Every American has a duty to protect our freedoms.\"",
    "Individuals made a contract with a lender.",
    "BTW, I paid my educational debt.",
    "Elections have consequences.",
    "They cannot stand the truth.",
    "LinkedIn has gone woke.",
    "Shame on LinkedIn.",
    "Thank you."
  ]
}