{
  "id": 5443,
  "mediaId": 2512,
  "date": "2022-04-15",
  "headline": "Ohio Republicans implore Trump not to endorse J.D. Vance in ‘contentious’ Senate primary: report",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29686278&width=1200&coordinates=0%2C106%2C0%2C107&height=600",
  "link": "https://www.alternet.org/2022/04/ohio-republicans-donald-trump-endorsement/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    0
  ],
  "sentences": [
    "Update: A source close to Mandel\\u2019s campaign acknowledged Thursday Trump's press shop had already written up the Vance endorsement, but it threw up a last-minute obstacle: an internal poll campaign showing Mandel in front & Vance tied in 3rd/4th single digits \\n\\nw/@VaughnHillyardpic.twitter.com/ifG8PdDcxC\n— Marc Caputo (@Marc Caputo) 1649960764\nHowever, one of Politico’s sources — described by Allison, McGraw, Isenstadt and Lippman as someone “close to the former president — said that Trump has narrowed down his endorsement options to Vance and Mandel and has ruled out endorsing any of the other candidates in that Senate primary, who include businessman Mike Gibbons and former Ohio Republican Party Chair Jane Timken.",
    "A goofy attack ad from anti-Vance Republicans mocked him with a parody of the theme from the 1960s television show “Flipper.”\nBizarre jingle in an anti-JD Vance ad\nOn April 14, Remington Research — described by the Politico journalists as “a polling firm connected to” Mandel’s campaign — issued a memo arguing that Vance’s campaign is doomed even if it gets a Trump endorsement.",
    "Vance is widely known by Republican primary voters for his Never-Trumper comments and his calling Trump supporters ‘racists.’ Since he is already known to Ohioans as a self-proclaimed ‘Never Trumper’ and voters will forcefully be reminded of that, Vance will still lose even with President Trump’s endorsement.”\nYesterday I posted that @JDVance1 calls us Trump voters Racists.",
    "Former President Donald Trump hasn’t made an endorsement in that primary, but according to Politico reporters Natalie Allison, Meridith McGraw, Alex Isenstadt and Daniel Lippman, a combination of Vance critics in the state — from his rivals in that primary to local GOP officials — are imploring Trump not to endorse him.",
    "Vance have embarked on a last-ditch effort to stave off an endorsement from Donald Trump in Ohio’s Senate primary, a response prompted by swirling speculation that the former president is close to backing Vance in the contentious race,” the journalists explain in an article published on April 14.",
    "I then had some people message me to correct the record.\\n\\nIn actuality what Never-Trumper JD Vance calls Trump voters is \\u201cVILE RACISTS\\u201d.\\n\\nMy apologies for yesterday\\u2019s inaccuracy.pic.twitter.com/WQpGch6RGh\n— Josh Mandel (@Josh Mandel) 1632068307\n— J.D.",
    "But his endorsement could dramatically shift the margins in the crowded field of candidates, where no one in the five-way race has taken a commanding lead.”\nThe “Hillbilly Elegy” author has flip-flopped dramatically where Trump is concerned.",
    "In 2016, he was vehemently critical of him; the Vance of six years ago was conservative but not a far-right extremist and believed that Trump would be bad for the Republican Party if he received the GOP nomination.",
    "One of those sources told NBC News that “the Mandel people hit the roof” in response, and that Rep. Jim Jordan of Ohio has tried to talk Trump out of the Vance endorsement.",
    "Another Politico source, whom the journalists describe as a “Trump adviser,” believes that it wouldn’t make any sense for Trump to endorse anyone this late in the primary.",
    "These days, however, Vance is stridently MAGA, echoing Trump’s rhetoric and slamming any Republican who disagrees with him as a RINO (Republican In Name Only).",
    "At this point, we’re less than four weeks out from the election, and there’s a bunch of different polls that show Mandel or (Mike) Gibbons or J.D.",
    "On April 14, NBC News journalists Marc Caputo and Vaughn Hillyard reported that according to three GOP sources, Trump “plans to endorse” Vance.",
    "That source told Politico, “From everything I can gather, he will just stay out of it for now until there is a clear and decisive frontrunner.",
    "Vance and former State Treasurer Josh Mandel have been engaged in an ugly, bitter, mudslinging battle to show who is the most MAGA.",
    "Ohio’s other U.S. senator, Sherrod Brown, is a Democrat who was reelected in 2018 and won’t be up for reelection until 2024.",
    "And from his perspective, why would I risk choosing a loser especially after he stayed out of it for over a year?”",
    "“Trump has so far stayed out of the primary, even as early voting has already begun ahead of the May 3 election.",
    "Vance) 1649159687\nThe seat that Vance and Mandel are competing for is presently held by Republican Sen.",
    "In Ohio’s 2022 GOP U.S. Senate primary, “Hillbilly Elegy” author J.D.",
    "Rob Portman, who isn’t seeking reelection in the 2022 midterms.",
    "Vance will still lose even with President Trump’s endorsement.",
    "In the memo, Remington President Titus Bond warned, “J.D.",
    "all tied — and I think it’s just too late in the game.",
    "“Republican rivals to J.D.",
    "Vance (@J.D.",
    "J.D."
  ]
}