{
  "id": 5532,
  "mediaId": 4091,
  "date": "2022-04-11",
  "headline": "January 6 riot defendant acquitted by court on all charges; federal judge convinced defendant was let in freely by police",
  "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2022/04/Capitol-March-3.jpg",
  "link": "https://www.naturalnews.com/2022-04-11-january-6-riot-defendant-acquitted-by-court.html",
  "mediaOutlet": "Natural News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Villareal",
  "authorUrl": "https://www.naturalnews.com/author/maryvillarealdw",
  "termIds": [
    2119,
    2093,
    2391,
    4143
  ],
  "sentences": [
    "In the middle of this issue was Lucas Denney of Texas, and lawyers from the U.S. Attorney’s Office admitted that they have violated his right to a speedy trial as he was put behind bars for weeks without being formally indicted, although they said that “there was nothing intentional or nefarious about the delay.”\nDenney’s charges were more egregious than those of Martin’s and he was detained in December without bail.",
    "The defendant, Matthew Martin, was an engineer from New Mexico, and was charged with four misdemeanors: disorderly and disruptive conduct in a restricted building; entering and remaining in a restricted building; violent entry and disorderly conduct in a Capitol building; and parading, demonstrating or picketing in a Capitol building.",
    "I do think the defendant reasonably believed the officers allowed him into the Capitol,” the judge said, adding that Martin’s conduct for the mere 10 minutes he was inside, was “about as minimal and not serious as I can imagine.”\nCBS News also noted that video evidence backed his claims.",
    "He did, however, tell her that there was “not as much security as you’d think,” and that “they were not prepared.”\nDuring his cross-examination, Martin said he called January 6 a “magical” day because of the spirit he saw in the streets and the many Trump supporters that he encountered.",
    "DOJ tramples rights of riot defendants\nFederal prosecutors also described a “rare mistake” when they admitted to violating the rights of another Capitol riot defendant and asked the judge to dismiss the criminal charges against him.",
    "However, the latest ruling allows other defendants to consider going to trial to test the government cases against them instead of simply pleading guilty to misdemeanors in an attempt to move forward.",
    "U.S. District Court Judge Trevor McFadden ruled that Martin’s claims were “plausible” because police officers weren’t making any attempt to stop him or those around him from entering the premises.",
    "Unmistakable signs January 6th was orchestrated by the ‘Deep State’ to cover up the Democrats election steal – Sure looks like the ‘Clinton Cabal’ is still running Washington DC!",
    "According to Martin’s testimony, he was inside the Capitol on January 6 after briefly attending former President Donald Trump’s rally, and then went back to his hotel.",
    "Martin went on to say that when he returned to his hotel a second time, he exchanged text messages with his then-supervisor from work, stating: “It was beautiful.",
    "He returned to the Capitol for what he thought would be another rally, saying that he was “let in” by the police and that he didn’t notice any security barriers.",
    "With Martin’s movements documented using CCTV footage from inside the Capitol, he was not charged in connection with any of the violence seen during the riots.",
    "Meanwhile, over 770 people have been charged with related federal crimes for the January 6 riots, with over 240 pleading guilty and 140 already sentenced.",
    "The video played at the trial also appeared to show an officer moving his arm in a waving motion inside the building as the rioters moved past them.",
    "Martin was the first to argue that the Capitol Police allowed him to enter the building, and was the first recipient of an outright acquittal.",
    "A federal judge slammed the Department of Justice (DOJ) for “trampling” Denney’s rights, who later pleaded guilty to a felony assault charge.",
    "Watch the video below to know more about the verdicts concerning the January 6 riots, and how this can affect the political establishment.",
    "More related stories:\nDuring January 6 hearing, Schiff doctored text messages between Mark Meadows and Rep. Jim Jordan.",
    "I will remember today for the rest of my life.”\nHowever, he did not tell his boss about his entry into the Capitol.",
    "Publicity stunt: January 6 lawyer says ‘fantasy’ charges against Rhodes meant to stop his promised J6 testimony.",
    "The federal judge was convinced that the defendant was let into the Capitol building freely by police officers.",
    "(Related: Judicial Watch sues U.S. Capitol Police in pursuit of emails and videos pertaining to Jan. 6 riots.)",
    "Of the over 775 people charged in the Capitol riot, at least two other defendants are still held without bond.",
    "Yes, the deep state ran the “capitol riots” as yet more evidence emerges the bureau is thoroughly corrupt.",
    "BREAKING: Investigators release huge bombshell that could change the entire narrative about January 6th.",
    "Martin testified that upon entering the Capitol building, he made his way through the Rotunda and left.",
    "Meanwhile, other judges are not bound by McFadden’s analysis of Martin’s claims about the police.",
    "Nicholas James Brockhoff was arrested in May 2021 and pleaded not guilty in early September.",
    "Once there, nobody contacted the D.C. court to get him a hearing for over three weeks.",
    "(Natural News) A January 6 riot defendant was acquitted by the court on all charges.",
    "“People were streaming by and the officers made no attempt to stop the people.",
    "Ryan Samsel was arrested on January 30, 2021 but wasn’t indicted until August.",
    "Follow Rioting.news for more updates regarding the January 6 riots.",
    "(Related: Maxine Waters won’t be punished for inciting riots.",
    "However, he was not transferred to Washington for six weeks.",
    "He was also not found to be a member of any extremist group.",
    "Sources include:\n100PercentFedUp.com\nCBSNews.com",
    "No compatible source was found for this media.",
    "That’s why Republicans keep losing.)"
  ]
}