{
  "id": 5740,
  "mediaId": 2522,
  "date": "2022-04-12",
  "headline": "Jim Jordan vows to expose Joe’s role in corrupt Biden ‘family enterprise’",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/04/SG-Jordan-Kilmeade.jpg",
  "link": "https://www.bizpacreview.com/2022/04/12/jim-jordan-vows-to-expose-joes-role-in-corrupt-biden-family-enterprise-1224888/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Frank Webster",
  "authorUrl": "https://www.bizpacreview.com/author/frank/",
  "termIds": [
    4905,
    2119,
    3858,
    3237,
    514,
    1472,
    6602
  ],
  "sentences": [
    "“But when former intelligence officials say something, it carries added weight.”\nA year and a half later, major leftist media outlets like the New York Times and Washington Post are finally eating a little crow for dinner as they reluctantly and tacitly admit they were wrong by affirming the stories about Hunter Biden’s laptop are legitimate stories they maybe should have covered but of course wouldn’t, for they are not in the business of journalism but rather that of catapulting Democrats into power and then protecting them from losing it.",
    "One of the actions taken by the House committee so far has been the drafting of a letter to each of the 51 so-called “intelligence” officials who themselves had penned a joint letter in October of 2020 in which they dismissed stories surrounding the laptop as having “the classic earmarks of a Russian information operation,” at least according to former CIA Director James Clapper.",
    "We’re going to look at all those issues because the American people deserve the truth.”\nThe full segment with Jordan provided above also included a discussion of the ongoing war in Ukraine as well as protests erupting in Shanghai, China over COVID mandates and iron-fisted lockdowns in the city.",
    "SIGN UP HERE\n(Video: Fox News)\nRep. Jim Jordan (R-OH) joined Fox News’ “Fox and Friends” Tuesday and said he believes President Joe Biden was most certainly involved in his son Hunter’s business dealings with foreign entities though the president predictably continues to deny it.",
    "He vowed, “If we get the majority – if the American people put us there – we’re going to look at this; we’re going to look at the lab leak with the [Dr.] Fauci situation; we’re going to look at the school boards issue with the Dept.",
    "His statement comes on the heels of a House Oversight Committee’s call for further investigation into the text messages allegedly stored on Hunter Biden’s infamous laptop that was abandoned to a Wilmington, DE, repair shop in 2019.",
    "The letter signed by the 51 top-level spies in charge of protecting America’s interests and its citizens was sent only five days after the New York Post published their first story on the matter.",
    "Both discoveries are among many instances noted by Republicans and conservative media that exposed the lie of Joe Biden’s claims he and his son have never talked about matters of business.",
    "“Well, it sure looks like now it is a family enterprise based on the recent text messages we have seen,” Jordan said of the emerging evidence related to the laptop.",
    "Then quickly, it was his laptop but it was Russian disinformation.”\n“Now it’s well it wasn’t Russian disinformation but Joe had nothing to do with it.",
    "Also of interest are emails in which the 52-year-old complained of having to spend half of his salary to cover his father’s bills and other expenses.",
    "“We want to take a look at that and this now what looks like a family enterprise with these text messages that have recently surfaced,” Jordan said.",
    "Now we learn, well, Joe did have something to do with it but his chief of staff says did he nothing wrong.",
    "“I’m just amazed at how this story has changed because it initially started out that it wasn’t his laptop.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "It doesn’t appear to be the case when you look at these recent text messages.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "The public will not see it and we do not share it.",
    "of Justice treating moms and dads as terrorists.",
    "We are going to look at all of this,” he added.",
    "“That was baloney,” Jordan said of the letter.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!"
  ]
}