{
  "id": 5746,
  "mediaId": 2644,
  "date": "2022-04-10",
  "headline": "GOP Rep. Jordan: Hunter Biden’s text messages ‘tie in the entire family’",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/04/jim-jordan-comp.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/04/10/jim-jordan-hunter-biden-texts-ties-in-the-entire-family/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Moore",
  "authorUrl": "",
  "termIds": [
    2119,
    2332,
    2765,
    3858,
    4905,
    1474,
    1359,
    1126
  ],
  "sentences": [
    "At the same time, a group of 51 former US intelligence officials expressed the same doubts about the laptop — which Jordan slammed as a “conspiracy.”\n“The left always tries to always say, ‘Oh, there’s these right-wing conspiracies.’ The real conspiracy here was the Democrats, big tech, big media, keeping this story from the American people just days before the most important election we have,” Jordan told Fox News’ Maria Bartiromo.",
    "“Remember what Joe Biden said in the debates 18 months ago, he said he didn’t do anything wrong and Hunter wasn’t taking money from business interests with connections to China,” Jordan said on “Sunday Morning Futures.”\n“There are 4.8 million reasons why that statement Joe Biden made was not accurate because we know he took $4.8 million from CEFC, the Chinese energy company.",
    "So yeah, this ties in the entire family.”\nEntities controlled by Hunter Biden and his uncle were paid $4.8 million by CEFC during 2017 and 2018, the Washington Post said in a report March 30 in which the newspaper confirmed the authenticity of the emails found on Hunter Biden’s laptop.",
    "“That letter they wrote where they said, this has all the earmarks of a Russian disinformation campaign, that letter became the basis for big tech and big media to suppress this story and keep it from we the people in the run-up to our most important election,” he said.",
    "Jordan, the top Republican on the House Judiciary Committee, spoke out about the messages found on the first son’s abandoned laptop — first reported by The Post last July — on Fox News’ “Sunday Morning Futures.”\n“One, it sure looks like Joe Biden was involved.",
    "“Frankly, if the American people put us back in power, I think we owe it to them to give them the truth,” he said, pointing out allegations the Department of Justice spied on parents in Virginia and about the origins of the COVID-19 pandemic.",
    "Biden Owens, 76, known as the “Biden whisperer” for her close relationship to her older brother, said she urged him not to run against former President Donald Trump in 2020 because of the political attacks she anticipated would occur.",
    "Jordan, who will likely be the chairman of the House Judiciary Committee if Republicans regain control of Congress in the 2022 midterm elections, said the panel will launch a series of investigations, including into the Biden family.",
    "The laptop, which was left behind at a computer repair shop in Delaware in April 2019, became the basis of The Post’s blockbuster series of exposes published in October 2020 that detailed Hunter Biden’s dealings in Ukraine and China.",
    "“Election for president of the United States, election for who’s going to be the commander-in-chief, and you have a family involved with all kinds of foreign business interests, and we don’t get to hear that story,” Jordan said.",
    "Meanwhile, Valerie Biden Owen, the president’s younger sister, defended her nephew who has struggled with addiction to alcohol and pills, blaming the accusations against the family on attacks that began in the 2020 election.",
    "The Washington Post and the New York Times were among media outlets that failed to follow up on the Hunter Biden story, dismissing it as possible disinformation being spread by Russia before the presidential election.",
    "But don’t worry, unlike pop, I won’t make you give me half your salary.”\nThe laptop did not contain evidence of such money transfers, but noted certain expenses listed as “JRB Bills” — the president’s initials.",
    "Hunter Biden is under investigation by federal prosecutors for possible tax fraud because of his foreign business dealings, and faces more exposure and additional probes if the GOP wins control of Congress.",
    "Rep. Jim Jordan said The Post’s story revealing how Hunter Biden covered expenses for his president dad shows how “involved” Joe Biden was in his son’s shady business dealings.",
    "“I hope you all can do what I did and pay for everything for this entire family for 30 years,” Hunter Biden griped to daughter Naomi in January 2019, referring to his father.",
    "“And, of course, this story about Hunter Biden and the Biden family profiting off of foreign interests and keeping that information from the American people,” Jordan said.",
    "Asked if Hunter Biden bears some of the responsibility for the controversies involving the Biden family, she said, “No.”\n“Hunter walked through hell.",
    "Jordan said the messages fly in the face of what President Biden has publicly said about his wayward son’s controversial overseas business dealings.",
    "This was a family operation, including his uncle, as I said before,” the Ohio congressman said, referring to the president’s brother James.",
    "“Trump and his right-wing followers have continued to do whatever they can to discredit the family and therefore to bring Joe down.”",
    "Biden Owens, whose book “Growing Up Biden: A Memoir” hits shelves Tuesday, compared the Biden family to that of John F. Kennedy.",
    "“It met and exceeded my expectations of being ugly and degrading, disrespectful, a disservice to the country,” she said.",
    "Texts and emails on Hunter Biden’s computer showed that he had to foot the bill for some of his father’s expenses.",
    "And so whatever happens, it’s my responsibility,'” she told USA Today in an interview published Sunday.",
    "He continued to say that “maybe the worst of it all” was the message from intel officials.",
    "He didn’t wake up and say, ‘Aunt Val, I think I’m going to be an addict.",
    "They included thousands of dollars in home repairs.",
    "She said that prediction turned out to be true.",
    "“It’s really hard."
  ]
}