{
  "id": 5748,
  "mediaId": 2524,
  "date": "2022-04-13",
  "headline": "The sicko GQP can't stop saying their new favorite LGBTQ smear word \"grooming\" in supercut video",
  "image": "https://i0.wp.com/boingboing.net/wp-content/uploads/2022/04/groomers.jpeg?fit=1200%2C750&ssl=1",
  "link": "https://boingboing.net/2022/04/13/video-the-gop-cant-stop-using-their-new-favorite-lgbtq-smear-word-grooming.html",
  "mediaOutlet": "Boing Boing",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carla Sinclair",
  "authorUrl": "https://boingboing.net/author/carlasinclair",
  "termIds": [
    2119,
    4095,
    3142,
    6474,
    6159
  ],
  "sentences": [
    "Of course this is pure projection, coming from the party who proudly included former Florida Rep. Mark Foley (resigned after he was accused of sending \"sick,\" \"sexually charged\" email to a teenage boy), former House Speaker Dennis Hastert (accused of sexually abusing teenage boys who he silenced with hush money), current Ohio Rep. Jim Jordan (accused of trying to help cover up sexual abuse by an Ohio State doctor against teenage wrestlers), former Trump advisor George Nader (sentenced to 10 years of prison for child pornography and child molestation), former Alabama Trump-backed nominee for U.S. Senate Roy Moore (accused of sexual abuse against young teenage girls), current Florida Rep. Matt Gaetz (under investigation for sex trafficking and having sex with at least one teenage girl), and many more (see video at bottom).",
    "Grooming: the crime of preparing a child for illegal activity, especially sexual activity… — Macmillan Dictionary\nFrom the banning of a children's book for its unicorns and rainbows to Florida's \"Don't Say Gay\" bill to the nearly 200 other anti-LGBTQ bills filed in the U.S. this year, the GOP is out to slaughter the rights of the LGBTQ community.",
    "And what better way to indoctrinate the public than to repeat \"grooming\" accusations ad nauseam, targeted at anyone who dares challenge their Q-infused straight white nationalist agenda?",
    "The supercut video below shows a sampling of the latest Republican anti-LGBTQ strategy — straight from the QAnon playbook — with more than 70 \"grooming\" utterances in a 45-second clip:"
  ]
}