{
  "id": 5939,
  "mediaId": 6687,
  "date": "2022-04-11",
  "headline": "U.S. Rep. Jim Jordan endorses AL-5 hopeful Casey Wardynski — ‘He is just the kind of fighter we need’",
  "image": "https://yellowhammernews.com/wp-content/uploads/2022/04/Casey-Wardynski-Jim-Jordan.jpg",
  "link": "https://yellowhammernews.com/u-s-rep-jim-jordan-endorses-al-5-hopeful-casey-wardynski-he-is-just-the-kind-of-fighter-we-need/?utm_source=rss&utm_medium=rss&utm_campaign=u-s-rep-jim-jordan-endorses-al-5-hopeful-casey-wardynski-he-is-just-the-kind-of-fighter-we-need",
  "mediaOutlet": "yellowhammernews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dylan Smith",
  "authorUrl": "https://yellowhammernews.com/author/Dylan@yellowhammernews.com/",
  "termIds": [
    2119,
    1477,
    1433,
    1474,
    1126,
    5929,
    6474
  ],
  "sentences": [
    "He is just the kind of fighter we need in Congress to take on Biden and the radical Left.”\nWardynski hailed Jordan as a “conservative stalwart” and advised that he would work alongside the Ohio congressman to carry forward the “Trump agenda” and push back against “crazy woke culture.”\n“If you’ve seen Congressman Jordan in one of the many House Judiciary Committee hearings, you know he’s a true conservative patriot,” declared Wardynski.",
    "I look forward to working with him to continue the Trump Agenda, stop the reckless ways of DC, and put an end to the crazy woke culture Biden and the far left are pushing on our nation.”\nWardynski is one of six Republicans vying to replace outgoing U.S. Rep. Mo Brooks (R-Huntsville), who is seeking election to the U.S. Senate.",
    "In a statement announcing his endorsement of Wardynski, Jordan referred to the North Alabama congressional candidate as a “fighter” who would combat the Biden administration’s progressive policies.",
    "Casey Wardynski, Republican candidate for Alabama’s open fifth congressional district seat, on Monday announced that his campaign had landed the endorsement of U.S. Rep. Jim Jordan (R-Ohio).",
    "Jordan, widely viewed as one of the most prominent conservative members of Congress, served as the founding chair of the House Freedom Caucus in 2015.",
    "Wardynski, a retired U.S. Army colonel, previously served as assistant secretary of the Army in the administration of former President Donald Trump.",
    "“As Assistant Secretary of the Army, Casey helped President Trump build the wall, stop Critical Race Theory at West Point, and root out waste.",
    "“He has done a phenomenal job taking on Russiagate hoaxers, and I’m honored that he has decided to endorse my campaign for Congress.",
    "Aside from being the ranking member on Judiciary, he’s a conservative stalwart who holds the Biden Administration in check.",
    "“Casey Wardynski is a battle tested conservative with a record of taking on the swamp,” proclaimed Jordan.",
    "Republican voters will head to the polls on May 24, 2022, to cast their ballots in the primary election.",
    "If no candidate receives more than 50% of the vote, a runoff election will be held on June 21, 2022.",
    "The congressman is the lead Republican on the House Judiciary Committee.",
    "Dylan Smith is a staff writer for Yellowhammer News.",
    "You can follow him on Twitter @DylanSmithAL"
  ]
}