{
  "id": 6106,
  "mediaId": 2659,
  "date": "2022-04-22",
  "headline": "The Other Explosive Statement on Tape: McCarthy Wished More of His People Would Be Kicked Off Twitter",
  "image": "https://www.politicususa.com/wp-content/uploads/2018/10/2018-10-26T142131Z_1_LYNXNPEE9P199_RTROPTP_4_TWITTER-RESULTS.jpg",
  "link": "https://www.politicususa.com/2022/04/22/the-other-explosive-statement-on-tape-mccarthy-wished-more-of-his-people-would-be-kicked-off-twitter.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Miciak",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "We will come back to the problem but first from Politico:\nOne senior House Republican aide told us Thursday night that there’s already some grumbling among the rank and file over a report by Burns and Martin that McCarthy wanted to get some of his own members kicked off Twitter — and you can expect that to dominate GOP conversations when lawmakers return to Capitol Hill next week.",
    "The strength of the statements, the fear in McCarthy’s voice, the candor and lack of a political veneer – all of it brings us back to the immediacy felt in those first few days when the country appreciated what just happened, the entire country.",
    "But for now, get used to hearing a lot about Speaker Jim Jordan over the next few weeks, and, shockingly, it will likely be based upon McCarthy’s statements regarding Twitter than telling Liz Cheney that they needed to throw Trump out of office.",
    "This is the statement that may threaten McCarthy’s hopes for the Speaker’s gavel over his anger at Trump, which one can always ascribe to “panic” or simply “musing,” and over time, it has all been worked out.",
    "We have all read the headline regarding Kevin McCarthy discussing the 25th Amendment, a demand that Trump resign, and the fact that McCarthy believed Pence shouldn’t pardon Trump.",
    "An insurrection occurs that threatens McCarthy’s life (and many others), and yet the anger will be about a throwaway comment about wishing Twitter would kick some others off.",
    "In so saying, McCarthy turns the volume way down on the MAGA primal scream about Twitter “cancellations” being nothing but censorship of conservatives views.",
    "Was McCarthy saying that he knew or at least suspected that some members knew the insurrection was coming and perhaps played an active role in the matter?",
    "The tape clearly demonstrates that McCarthy knew certain facts relevant to the committee’s investigation and believed they justified the 25th Amendment.",
    "Conveniently, with regard to evidence, McCarthy is going to have a much more difficult time now avoiding “voluntarily” testifying before the committee.",
    "When one uses Twitter to enflame, hate, and incite, that person becomes a danger, and McCarthy knew it that day and surely still knows.",
    "Critically, there is one other element of that statement that we’ve not seen questioned anywhere else in the media.",
    "Interesting that of the two people in that conversation, one holds the same views today as she did then,.",
    "It is only worth pondering because we’ll never really know the answer unless Kevin tells us the truth.",
    "The question must be answered, and it will need to be proven by evidence from elsewhere.",
    "His comment affirms that Twitter merely enforces policies that result in harm reduction.",
    "It would be odd for him to just bring it up because a few of his members annoy him.",
    "It is much harder to call it a partisan “show trial” or whatever word he last used.",
    "She now finds herself vice-chair of the committee investigating the entire crime.",
    "But McCarthy also said something applicable to issues with immediate impact now.",
    "(On MSNBC, J-Mart teased that they have audio of McCarthy saying this, too.)",
    "It openly acknowledges that the problems come from those on the hard right.",
    "He said he wished Twitter would throw a few more of his members off.",
    "The same cannot be said of McCarthy’s comment about Twitter.",
    "Had McCarthy held to his views, he would be the Vice-Chair.",
    "They have normalized the attempted coup.",
    "These are the headlines, and rightly so.",
    "How very typically Republican-MAGA.",
    "What was McCarthy really saying?",
    "Twitter remains a fresh wound.",
    "Something to ponder."
  ]
}