{
  "id": 6186,
  "mediaId": 2658,
  "date": "2022-04-14",
  "headline": "Criminal justice reform faces political buzzsaw as GOP hones its midterm message",
  "image": "https://static.politico.com/d4/0a/cd639d324d1e9f4cba79a2e90fb5/https-delivery.gettyimages.com/downloads/1235583208",
  "link": "https://www.politico.com/news/2022/04/14/criminal-justice-reform-midterms-00024991",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "While Schumer hasn’t yet laid out a timeline for when he’d bring the crack-cocaine disparity bill to the floor, members of the Congressional Black Caucus earlier this month wrote to him and Durbin urging the Senate to consider the bill “without delay.” The legislation is a top priority for the caucus, which has already faced setbacks on police reform and voting rights bills.",
    "Sen. Dick Durbin (D-Ill.) ranked criminal justice as high on his list of priorities, though he said it “may be just as challenging as immigration.” | Tom Williams-Pool/Getty Images\nBy Marianne LeVine\n 04/14/2022 04:31 AM EDT\nThe Senate delivered former President Donald Trump a bipartisan criminal justice reform deal shortly after the last midterm election.",
    "He added that if Democrats agree to certain provisions related to law enforcement, “that might make it possible to get something done.”\nDurbin (D-Ill.), meanwhile, said he’s concerned about the bill’s prospects, particularly given Republican accusations during Jackson’s confirmation hearings that the justice-in-waiting was soft on crime.",
    "I mean, it’s literally on the goal line.”\nThe nonprofit Justice Action Network recently released a new slate of ads to thank the co-sponsors of the legislation to eliminate the crack-and-powder-cocaine sentencing disparity and urge support from Republicans in certain states, including Utah, Louisiana, Kansas and North Dakota.",
    "Dick Durbin and Chuck Grassley, the top Democrat and Republican on the Senate Judiciary Committee, are still in talks over finalizing a package that would serve as a more narrow follow-up to the 2018 prison and sentencing reform bill known as the First Step Act.",
    "The Judiciary chair ranked criminal justice as high on his list of priorities, though he said legislation addressing crime and law enforcement “may be just as challenging as immigration” — a famously tough area of bipartisan compromise on Capitol Hill.",
    "But both senior senators acknowledge it’s not a glide path forward, particularly given the GOP messaging on rising crime ahead of the 2022 midterms — a focus that was on full display during Ketanji Brown Jackson’s Supreme Court hearings last month.",
    "“They have been working on that package for the better part of a year now, and the Equal Act is ready right now,” said Holly Harris, executive director of the Justice Action Network, who is urging the Senate to act shortly after the Easter recess.",
    "While both Durbin and Grassley say the sequel legislation is necessary to fully implement and expand on the sentencing updates in the First Step law, the campaign-season politics surrounding criminal justice reform threaten broader GOP support.",
    "“The timing is not great given the closeness of the midterms and the primaries that still remain to be run.”\nThe Judiciary panel already passed the foundation for Durbin and Grassley’s potential criminal justice reform package last year.",
    "But Senate aides on both sides of the aisle warn that despite the disparity-closing bill’s bipartisan support, it could still face a challenging path to final passage, including a potentially arduous debate over amendments.",
    "Republicans who oppose the bill would almost certainly want to force vulnerable Senate Democrats to take tough amendment votes amid reports of rising violent crime in major cities and the approaching November election.",
    "Now advocates for change want the Senate to move a standalone bill on the crack-cocaine disparity that proponents call the “Equal Act,” citing its support from 11 Senate Republicans — enough to overcome a filibuster.",
    "Supporters of eliminating the long-standing federal sentencing disparity between crack and powder cocaine offenses originally discussed including that provision in the committee’s bigger proposal.",
    "While the Jackson hearings highlighted the “extremes” of GOP opposition, he said he remains hopeful that “there are fair-minded Republicans and Democrats who can form the basis of an agreement.”",
    "And with Democrats in full control of Washington, Republicans’ emerging midterm message — that liberals are to blame for rising violent crime — could make sentencing changes that much harder.",
    "Sen. John Cornyn (R-Texas), a member of the Judiciary Committee and a close adviser to Minority Leader Mitch McConnell, has yet to review the proposal but predicted a tough road ahead.",
    "It would give inmates who were sentenced prior to the First Step law’s passage the ability to petition for its reduced sentencing guidelines, applying them retroactively if approved.",
    "A separate but related criminal justice push in the upper chamber, however, illustrates that reform advocates aren’t exactly pinning their hopes on a broader agreement this year.",
    "Grassley, who is not a co-sponsor, has also outlined concerns about whether there would be enough Republican support in the Senate to get the legislation over the finish line.",
    "And proponents of the reform are framing it as legislation about “fairness” instead of crime, highlighting support from Reps. Jim Jordan (R-Ohio) and Louie Gohmert (R-Texas).",
    "Backers of the legislation eliminating the crack-cocaine disparity, which passed the House overwhelmingly in September, range from conservative Sen. Cynthia Lummis (R-Wyo.)",
    "“That’s dampened the interest in doing what we call the Second Step Act, but we’re still seeing what can be worked out,” Grassley (R-Iowa) said in a brief interview.",
    "“Particularly given the spike in violence in the inner cities, it would probably be controversial depending on what the specific proposal was,” Cornyn said.",
    "Another bill included in it would increase eligibility for a program that allows certain elderly prisoners to serve the rest of their sentences at home.",
    "Senate aides familiar with the package say there’s an ongoing effort to broaden support for it and are bringing on additional members to negotiate.",
    "It’s backed by law enforcement groups, including the Major Cities Chiefs Association and the National District Attorneys Association.",
    "Among those senators are Cory Booker (D-N.J.) and Mike Lee (R-Utah), who played a key role in crafting the 2018 law, the aides said.",
    "There’s also discussion around expanding the scope of a federal carjacking statute, according to a GOP Judiciary Committee aide.",
    "While the Judiciary Committee held a hearing on the crack-cocaine disparity bill last year, it has yet to schedule a markup.",
    "Though 38 Republican senators backed the 2018 bill, it took Trump’s personal appeals to get many on board.",
    "Meanwhile, Durbin isn’t giving up on his broader criminal justice reform package.",
    "“My hope is obviously that we can see the Equal Act through to fruition here.",
    "Staging a sequel for President Joe Biden this year won’t be so easy.",
    "to Senate Majority Leader Chuck Schumer.",
    "At least not yet."
  ]
}