{
  "id": 6461,
  "mediaId": 8276,
  "date": "2022-04-12",
  "headline": "Here's how area members of Congress voted",
  "image": "https://www.gannett-cdn.com/presto/2022/03/31/NPRJ/ec105bfe-c303-49f5-93ea-5b792c34ce5e-U.S._Capitol_building.jpg?crop=5634,3170,x0,y286&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/04/12/heres-how-area-members-congress-voted-april-1-7-sherrod-brown-rob-portman-bob-gibbs-jim-jordan/9513829002/",
  "mediaOutlet": "bucyrustelegraphforum.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Targeted News Service\nWASHINGTON — Here's a look at how area members of Congress voted April 1 through April 7:\nAlong with this week's roll call votes, the Senate also passed the following measures by voice vote: the Strengthening Oversight for Veterans Act (S. 2687), to give the Inspector General of the Department of Veterans Affairs testimonial subpoena authority; and a resolution (S. Res.",
    "1037), sponsored by Rep. Bennie G. Thompson, D-Miss., to recommend that Trump administration staffers Dan Scavino and Peter Navarro be held in contempt of Congress for not complying with subpoenas issued by the House subcommittee investigating the Jan. 6, 2021, riot at the U.S. Capitol.",
    "7108), sponsored by Richard E. Neal, D-Mass., to authorize the president to increase duties on goods imported from Russia or Belarus through 2023, and authorize a broader standard for applying visa and property-related sanctions against foreigners accused of serious human rights abuses.",
    "7108), sponsored by Richard E. Neal, D-Mass., to authorize the president to increase duties on goods imported from Russia or Belarus through 2023, and authorize a broader standard for applying visa and property-related sanctions against foreigners accused of serious human rights abuses.",
    "NAYS: Gibbs R-OH (7th), Jordan R-OH (4th)\nYEAS: Balderson R-OH (12th)\nHouse Vote 4:\nHAZARD MITIGATION: The House has passed the Resilient Assistance for Mitigation for Environmentally Resilient Infrastructure and Construction by Americans Act (H.R.",
    "Eshoo said the bill was needed because \"for babies who have oral defects such as cleft palates, skeletal defects, congenital cataracts, or hearing defects, insurance companies have systematically denied or delayed medically necessary treatments.\"",
    "YEAS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nSenate\nSenate Vote 1:\nSANCTIONS OFFICIAL: The Senate has confirmed the nomination of James O'Brien to be the head of the State Department's Office of Sanctions Coordination.",
    "831), sponsored by Rep. Gerald E. Connolly, D-Va., to stress the importance of democratic principles at the North Atlantic Treaty Organization and NATO's commitment to bolstering democratic institutions in NATO member countries.",
    "A supporter, Sen. Mazie Hirono, D-Hawaii, said: \"Judge Jackson has the intellect, the integrity, and the temperament befitting an associate justice of the U.S. Supreme Court, and she doesn't have an ideological axe to grind.\"",
    "6968), sponsored by Rep. Lloyd Doggett, D-Texas, to bar the importation from Russia of a set of energy products, including petroleum and natural gas, with a potential waiver of the ban if U.S. interests warrant a waiver.",
    "6968), sponsored by Rep. Lloyd Doggett, D-Texas, to bar the importation from Russia of a set of energy products, including petroleum and natural gas, with a potential waiver of the ban if U.S. interests warrant a waiver.",
    "An opponent, Sen. Rick Scott, R-Fla., cited \"her record as a federal judge, which includes numerous instances of the type of judicial activism that we cannot and should not tolerate from the federal judiciary.\"",
    "An opponent, Rep. H. Morgan Griffith, R-Va., said vague language in the bill meant \"that not one person can articulate which medical procedures or treatments would be required to be covered by insurance.\"",
    "NOT VOTING: Gibbs R-OH (7th)\nYEAS: Balderson R-OH (12th), Jordan R-OH (4th)\nHouse Vote 10:\nENERGY IMPORTS FROM RUSSIA: The House has passed the Suspending Energy Imports from Russia Act (H.R.",
    "Jackson, a judge on the District of Columbia Circuit Court of Appeals since June 2021, was earlier a U.S. district court for Washington, D.C., starting in 2013, and a commissioner on the U.S.",
    "NAYS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nHouse Vote 9:\nTRADE WITH RUSSIA: The House has passed the Suspending Normal Trade Relations with Russia and Belarus Act (H.R.",
    "NAYS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nHouse Vote 7:\nRUSSIA WAR CRIMES: The House has passed the Ukraine Invasion War Crimes Deterrence and Accountability Act (H.R.",
    "5689), sponsored by Rep. Peter A. DeFazio, D-Ore., to change various rules for federal funding to local governments and nonprofit groups for disaster hazard mitigation and planning programs.",
    "YEAS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nHouse Vote 8:\nRESTAURANT SUBSIDIES: The House has passed the Restaurant Revitalization Fund Replenishment Act (H.R.",
    "NAYS: Bob Gibbs R-OH (7th), Jim Jordan R-OH (4th)\nYEAS: Troy Balderson R-OH (12th)\nHouse Vote 2:\nTREATING BIRTH DEFECTS: The House has passed the Ensuring Lasting Smiles Act (H.R.",
    "NAYS: Gibbs R-OH (7th), Balderson R-OH (12th), Jordan R-OH (4th)\nHouse Vote 3:\nECONOMIC SECURITY: The House has passed the DHS Trade and Economic Security Council Act (H.R.",
    "YEAS: Sherrod Brown D-OH, Rob Portman R-OH\nSenate Vote 2:\nTRADE WITH RUSSIA: The Senate has passed the Suspending Normal Trade Relations with Russia and Belarus Act (H.R.",
    "YEAS: Brown D-OH, Portman R-OH\nSenate Vote 4:\nSUPREME COURT: The Senate has confirmed the nomination of Ketanji Brown Jackson to serve as a justice on the Supreme Court.",
    "O'Brien, a State Department staffer and official starting in 1989, has, since 2017, been an executive at the Albright Stonebridge Group, a global business consultancy.",
    "3807), sponsored by Rep. Earl Blumenauer, D-Ore., to add $55 billion to the Restaurant Revitalization Fund, a COVID-relief grant program that began in spring 2021.",
    "YEAS: Gibbs R-OH (7th), Balderson R-OH (12th)\nNAYS: Jordan R-OH (4th)\nHouse Vote 6:\nCAPITOL RIOT SUBPOENAS: The House has passed a resolution (H. Res.",
    "The bill would require the president to send to Congress a report on war crimes and other atrocities committed during Russia's invasion of Ukraine.",
    "5657), sponsored by Rep. Earl Blumenauer, D-Ore., to create a new, less stringent federal registration process for research into medical marijuana.",
    "YEAS: Brown D-OH, Portman R-OH\nSenate Vote 3:\nENERGY IMPORTS FROM RUSSIA: The Senate has passed the Suspending Energy Imports from Russia Act (H.R.",
    "YEAS: Gibbs R-OH (7th), Balderson R-OH (12th)\nNAYS: Jordan R-OH (4th)\nHouse Vote 5:\nUKRAINE AND NATO: The House has passed a resolution (H. Res.",
    "503), expressing the sense of the Senate that China's government should immediately guarantee the safety and freedom of tennis star Peng Shuai.",
    "4476), sponsored by Rep. Peter Meijer, R-Mich., to create a trade and economic security advisory council at the Homeland Security Department.",
    "1916), sponsored by Rep. Anna G. Eshoo, D-Calif., to require health insurers to cover birth defect treatments in their plans.",
    "House\nHouse Vote 1:\nMEDICAL MARIJUANA: The House has passed the Medical Marijuana Research Act (H.R.",
    "7276), sponsored by Rep. Michael T. McCaul, R-Texas.",
    "The vote, on April 7, was unanimous with 100 yeas.",
    "The vote, on April 7, was unanimous with 100 yeas.",
    "The vote, on April 6, was 220 yeas to 203 nays.",
    "The vote, on April 7, was 223 yeas to 203 nays.",
    "The vote, on April 4, was 310 yeas to 110 nays.",
    "The vote, on April 5, was 348 yeas to 75 nays.",
    "The vote, on April 5, was 383 yeas to 41 nays.",
    "The vote, on April 5, was 362 yeas to 63 nays.",
    "The vote, on April 4, was 343 yeas to 75 nays.",
    "The vote, on April 7, was 420 yeas to 3 nays.",
    "The vote, on April 7, was 413 yeas to 9 nays.",
    "The vote, on April 6, was 418 yeas to 7 nays.",
    "The vote, on April 6, was 71 yeas to 26 nays.",
    "The vote, on April 7, was 53 yeas to 47 nays.",
    "Sentencing Commission from 2010 to 2013.",
    "YEAS: Brown D-OH\nNAYS: Portman R-OH"
  ]
}