{
  "id": 66,
  "mediaId": 2512,
  "date": "2022-02-21",
  "headline": "John Durham’s admission Republicans are ‘out of their minds’ means he must shut down ‘sham’ investigation: analysis",
  "image": "https://www.alternet.org/media-library/image.png?id=27958559&width=1200&coordinates=0%2C39%2C0%2C39&height=600",
  "link": "https://www.alternet.org/2022/02/durham-2656754665/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5676,
    1670,
    2119,
    2765,
    1338,
    1126,
    6569
  ],
  "sentences": [
    "If he steps forward this spring or summer to say, You know, I’ve been at this three years now, and I have seen no evidence of any conspiracy against Donald Trump, he’ll be rendering a great service unto this beleaguered nation.\"",
    "The special counsel appointed during the Trump administration to investigate GOP complaints about the origins into the investigations into his Russian ties should shut down his probe, Michael Tomasky argued on Monday.",
    "\"If he had genuine integrity, he’d shut the investigation down, save the taxpayers their money, and settle back into prosecuting mobsters in Connecticut instead of enabling mobsters in Washington.",
    "Every reader contribution, no matter the amount, makes a difference in allowing our newsroom to bring you the stories that matter, at a time when being informed is more important than ever.",
    "If you are doing X—setting fire to the Reichstag, say, or cooperating with the Kremlin to win a presidential election—you accuse your opponent of doing the thing that you’re doing.\"",
    "He translated Durham's statement as meaning, \"Fox News and the rest of the right wing media, not to mention Trump himself and his Republican cultists, are out of their minds.\"",
    "Durham issued a filing earlier this month that seemed to suggest, to people who can’t read, that the Hillary Clinton campaign was spying on the Trump campaign.",
    "The Covid-19 pandemic continues to be catastrophic not only to our health - mental and physical - but also to the stability of millions of people.",
    "Tomasky, editor of The New Republic, noted Durham issued a walk back after one of his filings was taken out of context by right wing media.",
    "We’ve always understood the importance of calling out corruption, regardless of political affiliation.",
    "We’ve covered everything thrown at us this past year and will continue to do so with your support.",
    "Tomasky praised Durham for the walk back, writing that he \"at least this smidgeon of integrity.\"",
    "He’s been at this for almost three years now, and he has indicted one person,\" he explained.",
    "Make a one-time contribution to Alternet All Access, or click here to become a subscriber.",
    "\"It’s all fiction, straight out of the Josef Goebbels School of Political Communication.",
    "But that was not enough, in Tomasky's mind, for Durham to correct the situation.",
    "Trump suggested some Clinton aides deserved to be executed (no, really).",
    "\"He has the power to shut down a lot of this pernicious madness.",
    "For all of us independent news organizations, it’s no exception.",
    "Jim Jordan (R-Berchtesgaden) echoed the sentiment,\" he wrote.",
    "The New York Post went with 'Hillary the Spy' on its cover.",
    "The past year has been the most arduous of our lives.",
    "We need your support in this difficult time.",
    "Understand the importance of honest news ?",
    "Read the full analysis.",
    "Fox went berserk.",
    "\"Let me explain.",
    "Invest with us.",
    "Thank you.",
    "So do we."
  ]
}