{
  "id": 71,
  "mediaId": 2526,
  "date": "2022-02-22",
  "headline": "Reagan Ally Bill Batchelder Laid to Rest in Ohio",
  "image": "https://media.breitbart.com/media/2022/02/fileMar30-2011-Ohio-Speaker-William-Batchelder-AP-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/21/reagan-ally-bill-batchelder-rest-ohio/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Klukowski",
  "authorUrl": "https://www.breitbart.com/author/ken-klukowski/",
  "termIds": [
    1781,
    3093,
    3571,
    4234,
    4325,
    973,
    6067,
    6474,
    6375
  ],
  "sentences": [
    "This was seen in Bill’s funeral Friday, attended by so many Ohio leaders that the pastor of Grace Baptist Church, in Brunswick, Ohio, lightened the mood by asking during the sermon, “Who’s running the state right now?”\nFor almost five decades, one of Batchelder’s partners in these efforts was Ambassador Ken Blackwell, who spent some 20 years in Ohio elected office, including serving as mayor of Cincinnati, and 14 years in statewide office.",
    "“As with Reagan, anyone in politics who made the tragic mistake of underestimating Bill Batchelder inevitably would regret it,” Alt told Breitbart News, noting that Reagan had asked Bill to serve on the Republican Party Platform Committee to help ensure that the party stood for bold constitutional conservative principles instead of the moderate GOP establishment of the 1970s.",
    "My wife Rosa and I miss our dear friend, and our hearts and prayers go out to Alice and their family.”\n“Dad told Mom that Ronald Reagan had asked for intelligent conservative women he could nominate to be federal judges, so he had put forward her name,” Billy told the assembled guests during Friday’s funeral service.",
    "Like her husband, during her lengthy tenure, Judge Alice Batchelder has launched the careers of numerous conservative lawyers (including mine), many of whom have gone on to serve in the White House, Department of Justice, top positions in law and academia, clerked for the Supreme Court, or become judges themselves.",
    "“Where else could a 33rd-degree Mason and a prince of the Roman Church work together, for years, to make sure Baptist Black children could go to better schools?” Bill asked rhetorically when working with the local Catholic bishop on a school choice initiative.",
    "Bill was known for a style of politics of never sacrificing principle while building a coalition to pass legislation, looking for common ground to enact laws that advance a conservative vision for the nation that showcased American Exceptionalism.",
    "One such former clerk is Robert Alt, now president of the Buckeye Institute, Ohio’s flagship conservative think tank, where Bill served as the Edwin Meese III Distinguished Fellow after his retirement from the Ohio legislature.",
    "Ken Klukowski is a Breitbart News contributor who served as a law clerk to Judge Alice Batchelder of the U.S. Court of Appeals for the Sixth Circuit and later served in the White House and U.S. Department of Justice.",
    "The Senate confirmed her as Reagan’s nominee to the Northern District of Ohio in 1985, and since 1991, she has served on the U.S. Court of Appeals for the Sixth Circuit, including five years as chief judge.",
    "“He wrote, ‘Jesus Christ, Senator Robert Taft, and my father, in that order.’”\nA devout Christian and committed patriot who served during Vietnam, Bill was first elected to the Ohio House in 1968 at age 25.",
    "In his long career, Batchelder would mentor some of the leading conservatives in America, such as U.S. Rep. Jim Jordan (R-OH) and other household names among Republicans, both in Ohio and nationwide.",
    "Meese went on to praise the lifetime of service that Bill and his wife Alice have provided to the American people as champions of the principles that make America a Shining City upon a Hill.",
    "“Sir, do you work for the state?” a police officer years ago asked as he rushed down the hall to catch up to Rep. Bill Batchelder (R-OH) when he walked past security in the Ohio statehouse.",
    "Meese would serve all eight years in Reagan’s Cabinet, four in the West Wing as counselor to the president and the final four as the 75th attorney general of the United States.",
    "Attorney General Ed Meese had been Reagan’s chief of staff when the latter was governor of California and directed the presidential transition when Reagan won the White House.",
    "But his son’s eulogy cast the pomp and ceremony in a certain light, reminding those in attendance of what his father told him decades ago when visiting the nation’s capital.",
    "“We are not here for this tour because we are important,” Bill told his then-young son when they were visiting the White House and about to enter the Oval Office.",
    "“Mom told Dad that was ‘the dumbest idea you have ever had.’”\nPresident Reagan disagreed, and Alice Batchelder has now served almost 40 years as a federal judge.",
    "She earned such respect as a judge that President George W. Bush considered her in 2005 for the Supreme Court seat that eventually went to Justice Samuel Alito.",
    "“I work against it.”\nThat summarized the half-century career of William G. Batchelder III, a lawmaker and judge who was laid to rest in Medina, Ohio, on Friday.",
    "He leaves behind his wife of 55 years, Judge Alice Batchelder, son Billy (William IV), and daughter Elisabeth, along with grandchildren and extended family.",
    "He would serve a total of 38 years as a legislator — not counting the years he served as an Ohio judge — finishing his tenure as Speaker of the House.",
    "“When he was in junior high, his teacher told him to write an essay on who had most influenced his life,” his son Billy recalled during the eulogy.",
    "“Bill was a happy warrior who fought the good fight with a smile on his face and charity toward all,” Blackwell told Breitbart News exclusively.",
    "“Bill was a great leader in public policy issues and also a great patriot,” Meese — who recently turned 90 — exclusively told Breitbart News.",
    "“This is a great country.”\nBill was buried with full state honors and with military honors in his hometown of Medina.",
    "He was an early supporter of Ronald Reagan for president and part of the conservative reorientation of the GOP.",
    "“I am grateful to have labored alongside such a statesman and Christian gentleman all these years.",
    "What matters is the work we do.”\nBill Batchelder was 79.",
    "“No,” the conservative lawmaker replied.",
    "“Do not forget that."
  ]
}