{
  "id": 7130,
  "mediaId": 2631,
  "date": "2022-03-31",
  "headline": "Republicans squirm as Trump presses Putin for dirt on Bidens",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220331-donald-trump-2021-ac-533p-50ea3c.jpg",
  "link": "https://www.nbcnews.com/politics/congress/republicans-squirm-trump-presses-putin-dirt-bidens-rcna22479",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5583,
    4591,
    4905,
    3662,
    3925,
    3858,
    2765,
    1126,
    6678
  ],
  "sentences": [
    "“He’s one of the worst people on the planet,” Romney said, “and America shouldn’t be asking for favors.”\nPutin is “one of the worst people on the planet, and America shouldn’t be asking for favors.”\nSen. Mitt Romney, R-Utah\nIn an interview with the conservative Real America’s Voice network, Trump pointed to a report by Senate Republicans, released just before the 2020 election, that scrutinized Hunter Biden’s business dealings with Eastern European oligarchs.",
    "Kevin Cramer, R-N.D., called Putin a “war criminal” but said that if he has dirt on the Bidens, “he should reveal it.”\nFull Sen. Cramer: Trump’s call for help from Putin was ‘perhaps not’ wise\nMarch 31, 202213:19\nAsked whether it was appropriate to ask Putin to do that, Cramer shifted his focus back to Joe Biden: “You know, the appropriateness of things that Trump asks for is more amusing to you than it is to me.",
    "Trump’s request twisted congressional Republicans into a political pretzel: GOP lawmakers have been pushing President Joe Biden to get more aggressive in helping Ukraine combat Putin, whom they’ve called a “thug” and a “murderer,” but now Republicans are being asked why their party's de facto leader is making a direct appeal to Putin, whom he has recently praised as \"savvy\" and a \"genius.\"",
    "New developments in Hunter Biden investigation\nMarch 31, 202201:54\nTrump's staunchest allies on Capitol Hill are pointing to recent stories in The Washington Post and The New York Times confirming the existence of a laptop hard drive that is alleged to have belonged to Hunter Biden and to have contained thousands of emails and other financial records.",
    "Asked broadly whether it’s appropriate for a former president to ask a foreign leader for help to undermine a U.S. political opponent, Cruz said: “I’m not going to answer a hypothetical.”\nTrump’s plea to Putin echoed past moments when Trump solicited a foreign leader or government for damaging information about a political rival.",
    "And in 2019, the Democratic-led House impeached Trump over allegations that he threatened to withhold about $400 million in critical military aid to Ukraine until President Volodymyr Zelenskyy launched an investigation into Hunter Biden.",
    "This time it was the former president’s urging Vladimir Putin to release dirt on the Biden family as the Russian president wages a bloody and devastating war in Ukraine that has killed thousands of civilians and displaced millions more.",
    "I’ve learned over the last few years that when asked about an issue regarding any of my colleagues or even President Trump saying something or allegedly doing something, I’ve got to go actually see it to be able to make a comment.\"",
    "Sen. Mitt Romney, R-Utah, a vocal Trump critic who warned about Russia’s threats when he was the GOP presidential nominee in 2012, added, “I don’t think Vladimir Putin ought to be one of the people we go to for favors right now.\"",
    "White House communications director Kate Bedingfield said Thursday she \"absolutely\" stands by Biden's comments during the 2020 campaign, when he said \"nothing was unethical\" about his son's business dealings overseas.",
    "“I did not see them,” said Rep. Mario Diaz-Balart, R-Fla. “I am focused on the fact that Ukrainians are giving their lives for freedom, and I’m focused on making sure the United States does everything it needs to do.",
    "Trump publicly calls on Putin for dirt on Biden\nMarch 30, 202201:44\nTrump’s remarks drew a swift rebuke from a handful of GOP defense hawks — even as they delicately tiptoed around his name.",
    "Sen. Ted Cruz, R-Texas, who is flirting with a 2024 presidential bid, declined twice on Wednesday to say whether Trump’s appeal to Putin to release dirt on Hunter Biden was appropriate.",
    "The emails and other records showed that a Chinese energy firm and its executives paid entities controlled by Hunter Biden and his uncle $4.8 million over 14 months, The Post reported.",
    "I’m not too concerned about what people say.”\nRep. Chip Roy, R-Texas, said, “I honestly haven’t looked at the stuff,” adding that he has been “neck-deep” in border immigration issues.",
    "Everybody’s concerned about that story,” said Rep. Jim Jordan, R-Ohio, a Trump loyalist who is likely to chair the Judiciary Committee if Republicans win the House back in November.",
    "WASHINGTON — Republicans on Capitol Hill found themselves in an awkward but familiar spot this week: being asked to respond to yet another controversy sparked by Donald Trump.",
    "“I don’t think we should be asking Putin to do anything,” said Sen. Lindsey Graham, R-S.C., a Trump ally who has suggested that someone needs to assassinate Putin.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nRep. Rodney Davis, R-Ill., said: “I didn’t see the clip of what you’re talking about.",
    "During the 2016 presidential campaign, Trump publicly asked Russia to release thousands of emails from his Democratic opponent, Hillary Clinton.",
    "The vast majority simply tried to avoid the flap altogether, saying they either hadn't seen Trump's interview or weren’t aware of his remarks.",
    "“We have a current president who’s, you know, way more concerning to me, frankly, than what the former president might be doing.”",
    "And it’s clear from his comments and actions that Hunter Biden’s business dealings will be a key part of any future campaign.",
    "Trump suggested that Putin may have dirt on the president's son, saying: “I would think Putin would know the answer to that.",
    "Zelenskyy, his country in ruins, is trying to beat back a brutal Russian invasion that has lasted more than month.",
    "“I didn’t see the particular comments,” said Cruz, the runner-up to Trump in a bitter 2016 Republican primary.",
    "I think he should release it.”\nLawyers for Hunter Biden have denied any wrongdoing on his part.",
    "As with past Trump controversies, only a few Republicans are condemning his words and actions.",
    "“I think even The Washington Post and The New York Times are writing about that story now.",
    "Trump appears to be gearing up for a possible rematch with Biden in 2024.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "The Senate voted to acquit him.",
    "Another Trump ally, ??Sen."
  ]
}