{
  "id": 7216,
  "mediaId": 2641,
  "date": "2022-04-01",
  "headline": "Rep. Steube to Newsmax: GOP Will Win, Subpoena Big Tech on Hunter Biden",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=bf46e4ce-c1bd-4c70-97fc-a1d0d8a1a5e9&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/steube-hunter-biden-laptop-big-tech/2022/04/01/id/1063930/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sandy Fitzgerald",
  "authorUrl": "",
  "termIds": [
    2119,
    3858,
    3706,
    4905,
    4489,
    1474,
    1394,
    1126,
    910,
    468
  ],
  "sentences": [
    "House Judiciary Committee Republicans want documents from Facebook and Twitter about their decisions to block posts concerning the contents of a laptop owned by President Joe Biden's son Hunter, and if they don't get them, they'll send their demands through a formal subpoena once they regain control of the House in November, Rep. Greg Steube told Newsmax Friday.",
    "His comments come after 10 committee Republicans, led by ranking member Rep. Jim Jordan, R-Ohio, wrote to Twitter CEO Parag Agrawal and Facebook CEO Mark Zuckerberg, quoting a 2020 article from The New York Post about Hunter Biden's laptop and noting that mainstream outlets like The Washington Post, The New York Times and others are now reporting on the matter.",
    "\"If an indictment does happen or something criminal does happen, or there's an active public criminal investigation that's going on with Hunter Biden and this laptop and the information that's contained there, the mainstream media will realize that they can't continue to say that everything on the laptop is false,\" said Steube.",
    "\"When the DOJ is saying they're using that as evidence in an indictment in a criminal investigation, suddenly you're seeing the mainstream media being forced to actually print the truth and evidence and things that we've been saying two years ago, and that the New York Post story said over two years ago.\"",
    "Meanwhile, the social media giants enjoy liability protection through Section 230, which would allow their content to grow organically through customers' posts, but \"we know they're not doing that,\" said Steube.",
    "\"Of course, the mainstream media just called it Russian disinformation and refused to even talk about it,\" Steube said of the earlier response to the revelations about the contents of the laptop and of emails.",
    "\"When we take the majority back, these are things that we're actually going to have subpoena power for and we're setting the stage for that,\" the Florida Republican said on Newsmax's \"National Report.\"",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV’s including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here",
    "\"And when we take the gavels back in January, you can pretty much expect that those documents we mentioned in this letter are going to be in a formal subpoena to Twitter and Facebook.\"",
    "The congressman also said that he thinks mainstream media is paying attention to the Hunter Biden story because there are rumors that there are \"actual indictable acts\" involved.",
    "\"Certainly we're not going to get the information from them because we don't have the power of subpoenas, but November is just around the corner,\" he added.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "\"Facebook and Twitter decided to completely mask that on their platforms.\"",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}