{
  "id": 7297,
  "mediaId": 2621,
  "date": "2022-03-31",
  "headline": "Newly Hired CBS Contributor Mick Mulvaney Attends Right-Wing Fundraiser For Liz Cheney’s Primary Opponent",
  "image": "https://www.mediaite.com/wp-content/uploads/2017/04/mick-mulvaney-bloombergedited.jpg",
  "link": "https://www.mediaite.com/politics/newly-hired-cbs-contributor-mick-mulvaney-attends-right-wing-fundraiser-for-liz-cheneys-primary-opponent/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Griffing",
  "authorUrl": "https://www.mediaite.com/author/alex-griffing/",
  "termIds": [
    5399,
    5367,
    2119,
    2887,
    2847,
    2765,
    3016,
    4066,
    239,
    240
  ],
  "sentences": [
    "The Post also reported CBS News co-president Neeraj Khemlani defended the hiring, telling staff of the network’s morning show, “Being able to make sure that we are getting access to both sides of the aisle is a priority because we know the Republicans are going to take over, most likely, in the midterms.",
    "CBS’s decision to hire Mulvaney raised eyebrows and sparked furor within the news organization as multiple journalists and CBS employees expressed their frustration with the move to the Washington Post.",
    "CBS’s newest contributor, former acting Trump Chief of Staff Mick Mulvaney, attended a fundraiser Wednesday night for Rep. Liz Cheney’s primary opponent Harriet Hageman.",
    "Paul weighed in on his support of Hageman, telling CBS, “I don’t think Liz Cheney has much of a chance of winning unless she can convince most Democrats to vote for her.",
    "A lot of the people that we’re bringing in are helping us in terms of access to that side of the equation.”\nThe Hageman fundraiser was exceptional for multiple reasons.",
    "Cheney served as the chair of the House Republican Conference until May 2021, when she was removed over her criticism of former President Donald Trump.",
    "House GOP leader Kevin McCarthy (R-CA) also attended the event, a rare move for the Republican leader against one of his own members.",
    "“I know everyone I talked to today was embarrassed about the hiring,” one anonymous employee was quoted as telling the Post.",
    "Congressmen Madison Cawthorn (R-NC) and Jim Jordan (R-OH) were among the more high-profile members at the event.",
    "Some 50 House GOP members attended the event aimed at removing one of their former leaders from office.",
    "Cheney also held a fundraiser in the nation’s capital earlier in the month, bringing in over $562,000.",
    "“The fundraiser brought in about $250,000 for Hageman, according to a source familiar with the event.",
    "Sen. Mitt Romney (R-UT) was the only sitting Republican member of Congress to attend the fundraiser.",
    "So I think she’s sort of a woman without a party at this point.”\nHave a tip we should know?",
    "Sen. Rand Paul (R-KY) was the only GOP Senator to attend Hageman’s fundraiser.",
    "The event was not the first D.C. fundraiser for the Wyoming GOP House primary.",
    "But most of the Democrats haven’t been too happy with the Cheneys either.",
    "Attendees paid at least $1,000 to get into the event,” CBS News reported.",
    "tips@mediaite.com"
  ]
}