{
  "id": 7329,
  "mediaId": 2528,
  "date": "2022-04-05",
  "headline": "63 Republicans vote against resolution expressing support for NATO",
  "image": "https://i.insider.com/61eedd31d2653000180460aa?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/63-republicans-vote-against-resolution-expressing-support-for-nato-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charles R. Davis",
  "authorUrl": "https://www.businessinsider.com/author/charles-davis",
  "termIds": [
    0
  ],
  "sentences": [
    "The vote comes not only amid a war in Ukraine that has sent millions of refugees into neighboring NATO states, but just after the reelection of Hungarian Prime Minister Viktor Orban, who has faced international criticism for his relationship with Russian President Vladimir Putin and assaults on civil society.",
    "Republicans who voted against Tuesday's resolution included most of Trump's most loyal defenders in Congress, among them: Reps. Lauren Boebert of Colorado; Madison Cawthorn of North Carolina; Matt Gaetz of Florida; Paul Gosar of Arizona; Marjorie Taylor-Greene of Georgia; and Jim Jordan of Ohio.",
    "Citing the threat posed by \"authoritarian regimes\" as well as \"internal threats from proponents of illiberalism,\" the resolution calls on the Biden administration to uphold NATO's \"founding democratic principles.\"",
    "It also advocates the creation of a \"Center for Democratic Resilience\" within NATO's headquarters in Brussels, with the center providing member states assistance to strengthen their own democratic institutions.",
    "More than 60 Republicans on Tuesday voted against a resolution expressing support for NATO and calling on President Joe Biden to strengthen the organization's committement to defending democracy.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Orban, who was endorsed by former President Donald Trump, has won praise from some right-wing pundits in the US for his hostility to immigration and LGBTQ rights.",
    "The resolution, introduced by Rep. Gerald Connolly, a Democrat from Virginia, was backed by a majority of the GOP caucus and every Democrat who voted.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Olivier Hoslet/Getty Images\nThe House overwhelmingly approved a resolution expressing support for NATO on Tuesday.",
    "President Joe Biden gives a press conference after the NATO summit in Brussels, on June 14, 2021.",
    "The resolution passed 362-63, with support from 143 Republicans and 219 Democrats.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Sixty-three members of the GOP caucus voted against the measure.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}