{
  "id": 7335,
  "mediaId": 2664,
  "date": "2022-04-08",
  "headline": "Students who fought book ban tell their story to House panel",
  "image": "https://www.rawstory.com/media-library/georgia-legislature-approves-new-process-for-banning-books-in-schools.jpg?id=29615584&width=1200&coordinates=0%2C134%2C0%2C134&height=600",
  "link": "https://www.rawstory.com/students-who-fought-book-ban-tell-their-story-to-house-panel/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ariana Figueroa",
  "authorUrl": "https://www.rawstory.com/u/arianafigueroa-statesnewsroom",
  "termIds": [
    1783,
    2119,
    2426,
    3173,
    3286,
    3499,
    3952,
    6653
  ],
  "sentences": [
    "“We should be teaching critical thinking skills,” Mace said, adding that she’s disturbed by reports of colleges “stifling speech to coddle young adults.”\nTennessee book banning\nRep. Debbie Wasserman Schultz, a Florida Democrat, held up a graphic novel about the Holocaust that was the latest book to be banned in Tennessee classrooms, “Maus.” She said with the rise in white nationalism, antisemitism and racism, books like “Maus” are now more important than ever.",
    "“Is there anything that prevents a kid from going to a public library?”\nTwo of the witnesses, Samantha Hull, a librarian from Lancaster County, Pennsylvania, and Jessica Berg, a teacher from Loudoun County, Virginia, said that not every student has the financial means to buy books or has adequate access to transportation to visit public libraries to read books where they see themselves represented.",
    "“When I think about the books frequently being challenged, the only connection I see between them is that they are the books that give voice to the most marginalized in our society.”\nMace agreed that history, especially “problematic chapters in our history,” should be taught in schools, but said books dealing with adult topics expose young kids to inappropriate topics.",
    "Pituch, who identifies with the LGBTQ+ community, said that if she had been able to have access to books with queer representation, she would have “been able to embrace and love myself a lot earlier on.”\n“I deserve to walk into my school library and find a book with someone like me,” she said.",
    "“Books can help kids educate themselves on various cultures and ways of life.”\nMindy Freeman, a parent from Pennsylvania, said a book called “George (Now Melissa)” was able to help her daughter, in fourth grade at the time, understand what she was going through as a transgender girl.",
    "“Most books being targeted for censorship are books that introduce ideas about diversity or our common humanity, books that teach children to recognize and respect humanity in one another,” said the chair of the Subcommittee on Civil Rights and Civil Liberties, Rep. Jamie Raskin.",
    "“I write because I want them to understand the contributions their ancestors have made to our great country, whether that contribution was made as slaves or volunteers.”\nHer book, “This Is Your Time,” is being reviewed for possible removal in a school district in Texas.",
    "Raskin, a Maryland Democrat, cited a new report by PEN America — an organization that advocates for the protection of free speech — that found from July 2021 to the end of March this year, more than 1,500 books were banned in 86 school districts in 26 states.",
    "A U.S. House Oversight and Reform Committee panel on Thursday examined why thousands of books, predominantly written by marginalized authors, have been banned from public schools, and the impact of those actions on students and teachers.",
    "“They feel their identities are not valued in the school and outside the school.”\nRep. Rashida Tlaib, D-Mich., did not ask any of the witnesses questions but expressed the fear of discrimination her two Muslim sons might face growing up.",
    "Olivia Pituch and Christina Ellis, of York, Pennsylvania, said it is important for students to see books written by authors who are people of color, LGBTQ+, Black and Indigenous, and with characters from marginalized groups.",
    "Freedom of speech on campus\nRepublicans on the panel, Reps. Jim Jordan of Ohio and Andy Biggs of Arizona, focused on freedom of speech on college campuses, and argued that these places were not welcoming to conservatives.",
    "Two Republicans, Reps. Byron Donalds of Florida and ranking member Nancy Mace of South Carolina, asked witnesses about district decisions about school curriculum and school administrators’ decisions to ban books.",
    "“We know that bigotry is learned,” Wasserman Schultz said, adding that “we also know it can be unlearned.”\nShe asked Hall what removing books like “Maus” and ones that have diverse characters does to students.",
    "“Books … offer a mirror to readers so they can see themselves reflected in some way, be it their gender, race, culture, identity or experience, and it makes them feel less alone in the world,” she said.",
    "The report found that of the banned books, 467 — or 41% — contained main or secondary characters of color; 247, or 22%, addressed racism; and 379, or 33%, of books contained LGBTQ+ themes.",
    "Pidluzny is the vice president of academic affairs for the American Council of Trustees and Alumni, which is an organization that supports free speech across universities.",
    "She talked about how growing up, classmates would make fun of the Caribbean food she brought from home and how her classmates and sometimes teachers would touch her hair.",
    "Ellis, who is Black, said that books that center characters who are people of color also benefit white students, so those students are educated about different cultures.",
    "Biggs asked the Republican witness, Jonathan Pidluzny, what action should be taken so that conservatives are not barred from speaking on college campuses.",
    "Pennsylvania Capital-Star is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "He, along with Mace, argued that there were other ways that students could get books, such as buying them or going to a public library.",
    "The book was written by Ruby Bridges, a civil rights icon who was the first Black child to desegregate an all-white Louisiana school.",
    "“The truth is that rarely do children of color or immigrants see themselves in these textbooks we are forced to use,” Bridges said.",
    "“No book made my child become transgender any more than a book could have turned her eyes from brown to blue,” Freedman said.",
    "She said she has received death threats from members of her own community as well as continued questioning of her expertise.",
    "Freeman said her daughter’s access to an age-appropriate book provided her the support and visibility she needed.",
    "“Books that highlight our differences, and that teach others how to address diversity, are crucial,” she said.",
    "High school students speak out\nThe hearing began with testimony from several high school students.",
    "“Taxpayers should have the ability to review that material because they pay for it,” Donalds said.",
    "Raskin held up a children’s book that administrators have tried to remove from school libraries.",
    "Berg said that visceral attacks on education from Republicans almost caused her to quit her job.",
    "Books written about her story have been banned in classrooms in Pennsylvania.",
    "“It’s my opinion when books are removed … students are erased,” Hall said.",
    "Bridges, who was 6 years old at the time, was a witness at the hearing.",
    "“Our children, they just simply want to exist as they are,” she said.",
    "Contact Editor John Micek for questions: info@penncapital-star.com.",
    "“We need to learn to tolerate the speech we abhor,” Pidluzny said.",
    "“They can get a book from a lot of different places,” Mace said.",
    "Pennsylvania Capital-Star maintains editorial independence.",
    "Follow Pennsylvania Capital-Star on Facebook and Twitter."
  ]
}