{
  "id": 7366,
  "mediaId": 2590,
  "date": "2022-04-07",
  "headline": "Trump Regrets Not Marching To Capitol On Jan. 6, Blames Pelosi For Violence",
  "image": "https://img.huffingtonpost.com/asset/624ed56c1e0000616e1b21c6.jpeg?cache=jj9Oe2Cy3A&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/donald-trump-jan-6-capitol-riot_n_624ec86ae4b09817450ad96e",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marita Vlachou",
  "authorUrl": "",
  "termIds": [
    2391,
    1849,
    2765,
    3246,
    4066,
    748,
    1359
  ],
  "sentences": [
    "In the interview, Trump also defended Supreme Court Justice Clarence Thomas’ wife Ginni, who sent nearly two dozen texts to then-White House chief of staff Mark Meadows urging him to overturn the 2020 election, according to copies reviewed by The Washington Post and CBS News.",
    "House lawmakers voted Wednesday to refer former Trump trade adviser Peter Navarro and social media chief Dan Scavino to the Justice Department for possible prosecution for criminal contempt of Congress for defying committee subpoenas.",
    "“Based on the evidence, the Court finds it more likely than not that President [Donald] Trump corruptly attempted to obstruct the Joint Session of Congress on January 6, 2021,” U.S. District Judge David Carter wrote last month.",
    "“I would have gone there in a minute.”\nAdvertisement\nHe also blamed House Speaker Nancy Pelosi and D.C. Mayor Muriel Bowser, both Democrats, for not doing enough to stop the violence that ensued.",
    "And she loves our country.”\nThe former president said he didn’t “remember getting very many” phone calls during the seven-hour period missing from White House phone records for Jan. 6.",
    "In recent days, the Jan. 6 committee interviewed Jared Kushner and Ivanka Trump, and obtained 101 emails sent from Jan. 4, 2021, to Jan. 7, 2021, by former Trump lawyer John Eastman.",
    "Advertisement\nAuthorities continue to pursue charges against those who attacked the Capitol, including a former Virginia police officer whose trial began this week.",
    "Trump stirred his supporters at a Jan. 6 rally with his lies about election fraud, then said he’d join them marching down Pennsylvania Avenue to the Capitol.",
    "He said he spoke to House Minority Leader Kevin McCarthy, Rep. Jim Jordan and others, but maintained he did not destroy any records or use other phones.",
    "Former President Donald Trump said he wished he could have joined his supporters in marching on the Capitol on Jan. 6, 2021.",
    "Democrats have been calling for the Supreme Court justice to recuse himself from any cases related to the insurrection.",
    "Trump himself was impeached for the insurrection, but neither he nor others who may have led plans have been charged.",
    "A judge sided with the committee in turning over the emails, rejecting Eastman’s attorney-client privilege argument.",
    "For hours, he ignored repeated pleas from aides and top lawmakers to issue a statement that might halt the violence.",
    "“Secret Service said I couldn’t go,” Trump told The Washington Post during an interview at his Mar-a-Lago club.",
    "“It does seem like the gaps are suspiciously tailored to the heart of the events,” Rep. Jamie Raskin (D-Md.)",
    "There was no secret.”\nThe House committee investigating the Capitol riot has been focusing on the gap.",
    "And I said, ‘It’s got to be taken care of,’ and I assumed they were taking care of it,” he added.",
    "“I thought it was a shame, and I kept asking why isn’t she doing something about it?” Trump said.",
    "The mayor of D.C. and Nancy Pelosi are in charge.”\n“I hated seeing it.",
    "Instead, he returned to the White House and watched the riot on TV.",
    "Advertisement\n“Why would I care about who called me?” he asked.",
    "“If congressmen were calling me, what difference did it make?",
    "“First of all, her husband is a great justice,” Trump said.",
    "Read the full Washington Post interview with Trump here.",
    "“Why isn’t Nancy Pelosi doing something about it?",
    "told CBS’ “Face The Nation” on Sunday.",
    "There was nothing secretive about it.",
    "And the mayor of D.C. also.",
    "“And she’s a fine woman."
  ]
}