{
  "id": 7374,
  "mediaId": 2745,
  "date": "2022-04-07",
  "headline": "Will Elon Musk bring Trump back to Twitter?",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WAMYYAFU3YI6ZA2YECVBMNK7WQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/technology/2022/04/07/elon-musk-trump-twitter-free-speech-ban/?utm_source=rss&utm_medium=referral&utm_campaign=wp_business",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2656,
    3433,
    2765,
    2722,
    5891,
    5868,
    468,
    1394,
    1126,
    6650
  ],
  "sentences": [
    "One sent an open letter to staff promising that the work of combating “hate speech and trolls” was “bigger than any board member.” And a company spokesman told The Washington Post: “Our day-to-day operations and decisions are made by Twitter management and employees.”\nIt would certainly be unusual for a single board member, who owns 9 percent of a company, to unilaterally change its policy on something as momentous as the Trump ban.",
    "He tweeted on Jan. 11, 2021: “A lot of people are going to be super unhappy with West Coast high tech as the de facto arbiter of free speech.”\nReporting by my Post colleague Elizabeth Dwoskin shows that Twitter’s executives sought to reassure their own anxious employees that Musk will not set policy for the company.",
    "Musk’s sudden transubstantiation from a Twitter critic to a Twitter leader has naturally sparked speculation both within and outside the company as to just how the outspoken tycoon might wield power over its policies — and whether he might cajole it into reversing its ban on Trump.",
    "While bringing back Trump could perhaps help ensure Twitter’s place in the political spotlight in the event of a successful Trump 2024 campaign, it would alienate large swaths of users and employees, and perhaps also advertisers, who are the company’s main revenue source.",
    "Even at this early juncture, it seems clear to both employees and outside critics that Musk will have some degree of influence over the company’s communications, if only by pressuring it to address whatever harebrained tweet he may fire off on a given day.",
    "The addition of an influential and vocal board member with a bias toward laissez-faire content policies could certainly affect some of the company’s priorities, particularly those on which his concerns are shared by other board members and leaders.",
    "The giddiness from the right — and consternation from the left — stems from the news that Musk, the Tesla and SpaceX chief executive, had joined Twitter’s board after purchasing a 9 percent stake in the company, making him its largest shareholder.",
    "Followers of QAnon, the far-right extremist ideology based on a sprawling set of false claims, theorized that Musk was destined to merge Twitter with former president Donald Trump’s troubled Truth Social network, making social media great again.",
    "That’s a decision for chief executive Parag Agrawal and his staff, including policy chief Vijaya Gadde, who has overseen the company’s increasingly interventionist approach to issues such as hate speech, misinformation and user safety.",
    "Rather, the target of his ire was “crypto spam bots.” He’d probably find far more support, both inside Twitter and on its board, for prioritizing better anti-spam systems to clean up the platform than for bringing Trump back.",
    "If he were so moved, he could try to force Trump back onto the company’s agenda via a blitz of tweets, which would animate his own supporters while providing ready fodder for an eager conservative media to take up the cause.",
    "For a platform that once took a hands-off approach, Twitter has invested heavily in recent years in research and product changes to promote what it calls “healthy conversations” — a goal that Musk may or may not share.",
    "Musk has already said he plans to enact “significant improvements” at Twitter and has polled his gazillion Twitter followers on whether they think Twitter does enough to uphold principles of free speech.",
    "Though he has on several occasions shown support for the general idea that Twitter should promote free speech, he has said nothing of note on the Trump ban since that January 2021 tweet.",
    "“Elon Musk has made it clear he opposes big tech censorship, and that’s something all freedom-loving Americans can get behind,” tweeted Sen. Marsha Blackburn, a Tennessee Republican.",
    "Even then, however, overturning the policy would require him to win over Agrawal, who has indicated his support for the ban, or persuade his fellow board members to oust Agrawal.",
    "The company’s decision on Jan. 8, 2021, to permanently ban him, following the Jan. 6 Capitol insurrection, was a watershed in the history of social media and American politics.",
    "Even if the board of directors were to try to involve itself — perhaps by pressuring Agrawal — Musk would still be just one among that group, albeit the richest and loudest.",
    "Twitter’s ban went further than its rivals Facebook and YouTube, whose indefinite suspensions left open the possibility that Trump could return for a 2024 presidential run.",
    "Regardless of Musk, the company may feel compelled to give some additional thought to its Trump ban if Trump emerges as a favorite to win the GOP nomination in 2024.",
    "But if Trump and his supporters were banking on Musk to miraculously revive his Twitter account before then, they might have better luck fixing Truth Social.",
    "Musk is not one to let norms — or even, at times, legalities — stand in his way, as his unorthodox filings to buy a stake in Twitter once again showed.",
    "In fact, Musk has said what he thinks is the “single most annoying problem on Twitter” today, and it has nothing to do with Trump.",
    "In what Twitter insists is a coincidence, the company on Tuesday announced it is indeed working on an edit button.",
    "But all of this assumes a level of passion for reinstating Trump that Musk has given no evidence he possesses.",
    "It was as if a savior had descended from the heavens to deliver Twitter from the sin of content moderation.",
    "Twitter wasn’t the only platform to punish the president, but it was Trump’s digital megaphone of choice.",
    "With Musk on the board, Twitter could no longer simply ignore such a campaign or dismiss him as a crank.",
    "Musk has given at least some indication that he may be rankled by Twitter silencing elected officials.",
    "This is not to say that employees are wrong to worry about Musk meddling in their work.",
    "He also polled them on Monday as to whether they want an edit button.",
    "Neither seems particularly likely at this juncture."
  ]
}