{
  "id": 7378,
  "mediaId": 2526,
  "date": "2022-03-31",
  "headline": "Democrat Insiders Fear ‘Screwing Up’ Midterms: ‘G**dammit Man, It’s So Infuriating’",
  "image": "",
  "link": "https://www.breitbart.com/midterm-election/2022/03/31/democrat-insiders-fear-screwing-up-midterms-gdammit-man-its-infuriating/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    5802,
    4947,
    3539,
    3134,
    3782,
    3679,
    4905,
    1126,
    392,
    1489
  ],
  "sentences": [
    "“But with only a quarter of the country believing things are headed in the right direction, the president sitting at a 40 or 42 [percent] approval and inflation at a 40-year high, the atmosphere clearly is not promising for Democrats to buck historical trends.”\nAxelrod’s hope that things could change was contradicted by Julie Roginsky, a former top adviser to New Jersey Gov.",
    "During Biden’s presidency, more than two million migrants have been apprehended at the southern border, fentanyl became the greatest killer among 18- to 45-year-olds, inflation has soared to a 40-year high, gas prices increased to all-time highs, weekly wages shrank, supply chain woes have persisted, and the deadly Afghan withdrawal deeply embarrassed the nation.",
    "Other than impeaching Biden, if Republicans assume congressional power after the midterms, they will also likely conduct probes into Hunter Biden’s laptop, Joe Biden’s relationship with corruption in China and Ukraine, and Dr. Anthony Fauci’s role in funding the Wuhan lab in China.",
    "“It’s easier to tear shit down than it is to build shit up … It’s much easier to frame people who are actively trying to build and accomplish things as failing and incompetent than it is to provide your alternative solution.”\n“Our society seems to have gone batshit,” he added.",
    "https://t.co/EYIP5EdFmS\n— Breitbart News (@BreitbartNews) March 30, 2022\nThe midterm outlook has become so grim for Democrats that 55 powerful and influential House Democrats are reportedly financially stiffing the Democratic Congressional Campaign Committee (DCCC).",
    "Layer on top of that concerns about inflation, concerns about the economy generally.”\nIrene Lin, who is managing Democrat Tom Nelson’s Senate campaign in Wisconsin, echoed Roginsky’s worries but conveyed the Democrats’ concerns are larger than policy failures.",
    "Seventy-five percent of swing voters in competitive districts say Democrats are “out of touch” with reality or “condescending” towards them, a National Republican Congressional Committee (NRCC) poll revealed last week.",
    "https://t.co/PDI4QwEsji\n— Breitbart News (@BreitbartNews) March 30, 2022\nKelly Dietrich, a former Democrat fundraiser, lashed out at Americans for turning away from Biden’s party and towards the GOP.",
    "With 71 percent of Americans believing the nation is headed in the wrong direction, Democrat insiders whined to Politico about how difficult it will be to retain the House and Senate.",
    "Roginsky expressed that Democrats must not deceive themselves into thinking they will maintain control of the House and Senate, citing 40-year-high inflation and soaring gas prices.",
    "“They just see it as, ‘You guys are in charge, and you’re screwing up,’” she said about the Democrats’ inability to lead the nation past President Biden’s manufactured crises.",
    "BIDEN BORDER CRISIS: A CIS analysis found that the illegal alien population has increased by 1.1 million since Joe Biden was sworn in as president.",
    "“It would be a challenging environment, anyway, because the midterm election of an incumbent president whose party controls both houses always is.",
    "Rep. Nancy Pelosi (D-CA) has reportedly tried to force her members to pay their dues, but Pelosi is grappling with her own problems.",
    "The members are failing to pay the dues they owe, likely because of the great odds that Republicans will retake the chamber.",
    "“Goddammit man, it’s so infuriating,” Dietrich said outright, criticizing Americans for turning their backs on Democrats.",
    "Democrat insiders are disquieted about the likely drubbing the Democrat Party will receive in the 2022 midterm elections.",
    "Top Republicans are speaking about potentially impeaching Biden if they successfully retake both congressional chambers.",
    "The poll is significant because it reveals for which party Americans will vote without knowing the specific candidate.",
    "The Democrats’ challenges come November may increase if Republicans retake the House and Senate.",
    "Her approval rating makes her the most unpopular Democrat politician, according to the NRCC.",
    "“I think that’s definitely a discussion we have to have,” Rep. Jim Jordan said last week.",
    "According to a January poll, Republicans lead Democrats on a generic ballot by 12 points.",
    "“Things could change,” said David Axelrod, an adviser to former President Barack Obama.",
    "Nancy Pelosi is the most unpopular American politician, a Tuesday @NRCC poll revealed.",
    "“We’ve got to stop fooling ourselves here,” Roginsky said.",
    "Dietrich’s worries are confirmed by polling.",
    "Phil Murphy (D)."
  ]
}