{
  "id": 7606,
  "mediaId": 2752,
  "date": "2022-04-04",
  "headline": "Guess It Wasn’t Just A Cry For Help: Sarah Palin Really Running For Congress",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTU5NDEwMC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3MTEzNjAxM30.b1DAiaknTwC-nFLtrGOjzMSaLK82zt-TSjpuiSzyzVU/img.jpg?width=1200&coordinates=0%2C120%2C0%2C121&height=600",
  "link": "https://www.wonkette.com/guess-it-wasnt-just-a-cry-for-help-sarah-palins-really-running-for-congress",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    2182,
    2119,
    2765,
    2678,
    3765,
    1477,
    1126,
    1433,
    38,
    5930
  ],
  "sentences": [
    "After losing the vice presidency in 2008 and quitting the job she had amid scandal in 2009, Palin took what Politico describes as “a long break from political life,\" while noting Palin \"has frequently appeared on Fox News and NewsMax.” That’s a polite way of saying she’s lived like a Kardashian for more than a decade.",
    "Sarah Palin is tough and smart and will never back down, and I am proud to give her my Complete and Total Endorsement, and encourage all Republicans to unite behind this wonderful person and her campaign to put America First.",
    "Palin’s statement declaring her candidacy is exactly what you’d expect:\nPublic service is a calling, and I would be honored to represent the men and women of Alaska in Congress, just as Rep. Young did for 49 years.",
    "With just 45 minutes until Friday's filing deadline, Palin entered the special election to fill the seat held by Rep. Don Young, who died last month, but is still more capable than Palin.",
    "She’s said recently that we (well, not us personally) need more people in Congress like Donald Trump, “who has nothing to lose.” She also considers herself a lethal political weapon.",
    "The Washington Post once annoyingly described the late Rep. Young as “the rare Republican who’s not afraid of Trump,” even though Young voted against both of his annual impeachments.",
    "Coincidentally, Palin officially re-enters politics the same week that we endured Cawthorn’s tales about alleged cocaine-fueled Eyes Wide Shut parties in the nation’s capital.",
    "I realize that I have very big shoes to fill, and I plan to honor Rep. Young’s legacy by offering myself up in the name of service to the state he loved and fought for.",
    "During BIF’s signing ceremony at the White House last November, Biden went on so long that Young remarked on a hot mic, “We were wondering when you were gonna stop.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Young was one of those old-school Republicans who praised Trump’s awful policies but wished he would \"just shut up — that’s all he has to do.",
    "According to people familiar with a conversation between dummies, Donald Trump spoke with Palin last week and encouraged her to run.",
    "We can expect that if elected, Palin will refuse to work with Democrats on anything, and blindly serve Kier the cult of Trump.",
    "She’d join the undistinguished ranks of Marjorie Taylor Greene, Lauren Boebert, Matt Gaetz, Jim Jordan, and Madison Cawthorn.",
    "I know that.”\nYoung did boldly defy Trump once he was out of office and voted for the bipartisan infrastructure bill.",
    "The primary is scheduled for June 11, and the top four candidates will advance to the general election on August 16.",
    "The official announcement came late on April Fools' Day, when Palin’s powers on Earth are at their strongest.",
    "But she can’t just saunter into the House of Representatives and claim the title of silliest Republican.",
    "Palin commands a tremendous advantage in name recognition, and Trump quickly endorsed her this weekend.",
    "All we know is that the House GOP caucus’s collective IQ will lower once she’s sworn into office.",
    "There are more than 50 candidates scrambling to replace Young in what is a guaranteed GOP seat.",
    "It’s not like Trump to pay his debts, and this isn’t one of his spite endorsements, either.",
    "Former Alaska GOP governor and \"Masked Singer\" Sarah Palin is running for Congress!",
    "We damn near froze to death.” (Young’s actual death was unrelated to this event.)",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "Sarah shocked many when she endorsed me very early in 2016, and we won big.",
    "Maybe she’s auditioning for an encore vice presidential run in 2024.",
    "Young was the longest-serving congressmember in GOP history.",
    "He's also on the board of the Portland Playhouse theatre.",
    "Palin made it almost a whole term as governor of Alaska.",
    "He also accepted that Joe Biden was president.",
    "His son describes him as a “play typer guy.\"",
    "Please click the clickie, if you are able.",
    "Maybe he just digs his fellow grifter.",
    "How often would you like to donate?",
    "She’s gonna have to work for it.",
    "He writes reviews for the A.V.",
    "That’s saying something.",
    "Now, it’s my turn!",
    "He’s not going to.",
    "That's you!"
  ]
}