{
  "id": 7881,
  "mediaId": 2688,
  "date": "2022-03-31",
  "headline": "Is The Justice Department Finally Going After The Insurrection’s Big Fish?",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/03/GettyImages-1237552542-scaled.jpg",
  "link": "https://talkingpointsmemo.com/news/justice-department-jan-6-investigation-merrick-garland?utm_source=rss&utm_medium=rss&utm_campaign=justice-department-jan-6-investigation-merrick-garland",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Shuham",
  "authorUrl": "https://talkingpointsmemo.com/profile/matt_shuham",
  "termIds": [
    5231,
    5526,
    2119,
    2441,
    2451,
    2399,
    2879,
    1333,
    1442
  ],
  "sentences": [
    "He compared the current investigation to that of former Special Counsel Robert Mueller: “I think to some extent people are concerned that the institutional conservatism of the attorney general may parallel that of Mueller, and that they are not really fully digging in.”\nStill, there are signs that the Justice Department is “getting really serious,” McQuade said — including a recent budget request for $34 million to hire more than 130 new lawyers to help with the investigation.",
    "While developments like subpoenas aimed at high-level officials might find their way to newspaper reports, she said, Justice Department investigators can take lots of action — including securing search warrants for phone records and emails, and reviewing witnesses’ testimony to the Jan. 6 committee — without the public knowing.",
    "There are any number of creative, malicious ways that Congress traditionally would never do.”\nTeam Trust The Process\nThe reports of high-level activity in the Jan. 6 investigation might have been big news, but to some observers they were just confirmation of what they assume has been going on all along.",
    "Strzok imagined a Republican-controlled Congress with committees led by figures like Reps. Jim Jordan (R-OH) and Marjorie Taylor Greene (R-GA), “whose entire existence is devoted to gumming up any DOJ and FBI investigation.”\n“I don’t think anybody can predict what they might do,” he said.",
    "“I think they’ve probably just done so covertly.”\nRandall Eliason, a former assistant U.S. attorney in the District of Columbia, has pleaded publicly for “armchair quarterbacks” to stop questioning the pace at which Garland’s Justice Department is handling the investigation.",
    "On the other hand, a vocal group of institutionalists has urged some perspective: Complex federal investigations take years, not months, and prosecutors are probably slowly working their way up from the rioters to bigger fish, following the facts where they lead.",
    "In an email Thursday, he stressed that in a case like the Jan. 6 investigation, “you want to take the time to do it right.”\n“Garland has said all along that they will start at the bottom, build any cases that are there, and work their way up.",
    "Not a former president, and not someone who’s never held office before.”\nFormer FBI agent Peter Strzok, himself the target of years of attacks from Trump and his supporters, said he didn’t doubt that the DOJ can handle the investigation.",
    "Reacting Wednesday night to The Washington Post’s reporting — that a grand jury has subpoenaed “officials in former president Donald Trump’s orbit” who helped with the rally that day — Schiff downplayed the development.",
    "Plenty Of Decisions Left To Make\nThere’s plenty of middle ground in the debate: News reports, for example, are just peeks into what is largely a closed-door decision-making process among Justice Department officials.",
    "She also pointed to progress in the criminal cases that have been charged: Joshua James, for example, this month became the first Jan. 6 defendant to reach a plea deal for a seditious conspiracy charge.",
    "“It still could be the case, as some critics have said, that they’re actually not going to do anything,” said Harry Sandick, a former assistant U.S. attorney for the Southern District of New York.",
    "“It’s obviously better late than never,” he said, acknowledging that the grand jury activity reported by The Washington Post and New York Times may have started sooner than the reports let on.",
    "The news that the Justice Department’s Jan. 6 investigation is reaching beyond the Capitol rioters has added fuel to a long-running debate about the pace of the investigation.",
    "“I think that from Day 1 — from Jan. 7 — DOJ has been investigating anyone at any level,” said Barbara McQuade, the former U.S. attorney for the Eastern District of Michigan.",
    "The relative lack of leaks from Attorney General Merrick Garland’s Justice Department, they contend, may actually be a sign of a serious, vigorous prosecutorial effort.",
    "“It would be ideal if this had not waited as long as it apparently has.”\nAnother critic is Rep. Adam Schiff (D-CA), a member of the House Jan. 6 select committee.",
    "To Laurence Tribe, an emeritus professor at Harvard Law School, the recent reports of Trump-adjacent investigations brought welcome news — if slightly belated.",
    "James, a member of the Oath Keepers, was seen shepherding Trump confidante Roger Stone around D.C. in a golf cart the day before the attack.",
    "“But they also need to look at these multiple lines of effort to overturn the election, and they need to look at anyone who was involved.",
    "One side has criticized the Justice Department for not investigating Donald Trump and his inner circle for subverting the 2020 election.",
    "The lack of any public signs of a broader, more aggressive investigation for over a year, they say, shows a troubling lack of urgency.",
    "In other words, McQuade said: “Let’s hear about what Joshua James has to say about Roger Stone, before we charge Roger Stone.”",
    "“Memories can fade, people can adjust their testimony in light of interim discoveries,” Tribe said.",
    "“What if they start bringing in people, and immunizing 40, 50, 60 people to have them testify?",
    "And just because they’ve taken investigative steps doesn’t mean indictments will follow.",
    "But time — particularly the approaching 2022 midterms — is a crucial factor, he said.",
    "“It’s a little late, but I’m glad they’re doing it,” Schiff said.",
    "Now, he’s required to cooperate with investigators.",
    "“It’s probably been going on all along,” she said.",
    "That appears to be exactly what they are doing.",
    "But that process is not quick,” Eliason said.",
    "No one gets a pass.",
    "Team Where’s DOJ?"
  ]
}