{
  "id": 7913,
  "mediaId": 2644,
  "date": "2022-04-06",
  "headline": "GOP demands ‘experts’ who dismissed Hunter Biden laptop fess up — or face subpoenas",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/04/hunter-laptop-comp.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/04/06/gop-demands-experts-who-dismissed-hunter-biden-laptop-fess-up/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steven Nelson",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "At worse—and more likely—the public statement was a deliberate and coordinated effort to mislead the American people about information relevant to the 2020 presidential election by invoking your national security experience to falsely suggest that the allegations about Hunter Biden were not based in fact.”\nDemocrats currently control the House of Representatives, but Republicans are favored to win the November midterm elections, which would allow them to wield subpoena powers next year that can compel potential witnesses in any congressional investigation to produce documents and submit to questioning.",
    "The Post’s initial October 2020 bombshell based on the trove of Hunter Biden emails revealed that Vadym Pozharskyi, an executive at the Ukrainian gas company Burisma, emailed Hunter in 2015 to thank him for the chance to meet his father — directly contradicting Biden’s 2019 claim that he’d “never spoken” with his son about “his overseas business dealings.”\nHunter Biden was paid a reported $1 million per year to serve on Burisma’s board while his vice president dad led the Obama administration’s Ukraine policy.",
    "National news organizations called the allegations about Hunter Biden ‘dubious’ and a ‘non-scandal’; CBS News reporter Leslie Stahl said the allegations ‘can’t be verified’; and NPR called it a ‘waste … of time’ and a ‘pure distraction.’\n“Separately, Twitter and Facebook restricted access to the New York Post’s reporting about Hunter Biden, with Twitter locking the Post’s account and Facebook deferring to a so-called independent fact-check that never occurred.",
    "“Although this statement acknowledged that you had seen no actual ‘evidence’ of Russian involvement with respect to the publication of Hunter Biden’s emails, you nonetheless conveyed a ‘deep suspicio[n] that the Russian government played a significant role in the case.’ Later in the statement, you went further to state a ‘view’—not merely a suspicion anymore—’that the Russians are involved in the Hunter Biden email issue,'” the letter recounts.",
    "and others demands that the ex-intelligence operatives — including former CIA directors John Brennan, Leon Panetta and Michael Hayden, as well as ex-Director of National Intelligence James Clapper — “identify all people with whom you communicated about the inception, drafting, editing, signing, publishing, or promotion” of the statement and provide “all documents and communications referring or relating to” that effort.",
    "All 19 Republicans on the panel signed a letter to the intelligence community stalwarts demanding records on their claim that the laptop story had “all the classic earmarks of a Russian information operation” — a statement which helped the Biden campaign discourage pre-election coverage of emails linking Joe Biden to his son’s business ventures in China and Ukraine.",
    "Biden wrote college recommendation letters for kids of Chinese exec tied to Hunter\nA photo and emails subsequently reported by The Post indicate Joe Biden attended a 2015 dinner at DC’s Cafe Milano with a group of his son’s associates — including Pozharskyi, a trio of Kazakhs and Russian billionaire Yelena Baturina and her husband, ex-Moscow mayor Yury Luzhkov.",
    "On the same day as your statement, Politico published a story about the statement, with the conclusive headline, ‘Hunter Biden story is Russian disinfo, dozens of former intel officials say.’ … Fifteen minutes after Politico published its story, Jen Psaki, who now serves as Press Secretary to the President, tweeted a link to the Politico story.",
    "WASHINGTON — House Judiciary Committee Republicans are demanding that 51 former intelligence operatives divulge information about their 2020 statement that documents from Hunter Biden’s laptop could be Russian disinformation — with a senior GOP aide telling The Post that the ex-spies should expect subpoenas next year if they fail to comply.",
    "The Biden campaign vaguely denied that the meeting occurred, saying, “[W]e have reviewed Joe Biden’s official schedules from the time and no meeting, as alleged by the New York Post, ever took place.” Twitter banned sharing of The Post’s article and locked The Post out of its accounts, and Facebook squelched circulation of the story.",
    "These efforts likely affected public awareness of the serious allegations surrounding the Biden family in the crucial weeks before the 2020 election.”\nThe Republicans added: “Your public statement served as a basis for Democrat operatives to try to delegitimize the scandalous allegations about Hunter Biden and the Biden family.",
    "Former Hunter Biden business partner Tony Bobulinski alleges that he met with Joe Biden to discuss the CEFC venture on May 2, 2017, and that the president was the “big guy.”\nThe first son recently paid off a tax bill of more than $1 million in a bid to avoid prosecution, the Times reported last month.",
    "A year and a half after The Post first reported on the hard drive contents, the Washington Post and New York Times recently said they verified the veracity of the data as a federal investigation into the first son over possible tax fraud, money laundering and foreign lobbying crimes heats up.",
    "“The concerted effort to suppress public dissemination of the serious allegations about Hunter Biden and the Biden family, as first reported in October 2020 by the New York Post, was a grave disservice to American citizens’ informed participation in our democracy,” the letter says.",
    "A senior GOP aide told The Post that “these intelligence officials have a choice: either cooperate now, or face the consequences when Republicans take the majority next year.”\n“If they have nothing to hide, it shouldn’t be hard for them to work with the committee,” the source said.",
    "“This belated verification of the Post’s reporting raises fresh questions about the public statement you signed in October 2020.”\nThe letter signed by Reps. Jim Jordan (R-Ohio), Darrell Issa (R-Calif.), Mike Johnson (R-La.)",
    "“We now know from subsequent reporting that the New York Post’s article about Hunter Biden was not, as you and your co-signatories alleged, part of a ‘Russian information operation’,” the GOP letter says.",
    "'”\nWhite House communications director Kate Bedingfield last week insisted that Biden told the truth at that final debate when he claimed that his son didn’t make money in China.",
    "Clapper, the former intelligence director, was one of the few to comment, saying, “Yes, I stand by the statement made AT THE TIME, and would call attention to its 5th paragraph.",
    "Baturina is Russia’s richest woman and a 2020 report from Republican-led Senate committees alleges that in 2014 she paid $3.5 million to a firm associated with Hunter Biden.",
    "A second October 2020 bombshell from The Post described communications about Hunter Biden and his uncle Jim Biden’s business venture with the company CEFC China Energy.",
    "The letter issued Wednesday by House Judiciary Committee Republicans accuses the former intelligence officials of wrongfully giving Biden cover ahead of the election.",
    "During the final presidential debate, Vice President Biden also dismissed concerns about Hunter Biden’s international business dealings as part of a ‘Russian plan.",
    "“Your public statement was consistent with a broader effort to minimize and censor the New York Post’s reporting about Hunter Biden and the Biden family.",
    "A May 13, 2017, email recovered from the laptop said the “big guy” would get a 10 percent equity stake in a corporate entity established with CEFC.",
    "“At best, the public statement was a reckless attempt by you and your co-signatories to erroneously opine about purported election interference.",
    "Psaki said at a briefing Tuesday that the president maintains that he never spoke with his son about his overseas business deals.",
    "The Washington Post reported that Hunter and Jim Biden received $4.8 million from CEFC in 2017 and 2018.",
    "The Biden campaign repeatedly cited your statement to dismiss the allegations against Hunter Biden.",
    "Most of the 51 intelligence veterans didn’t respond to recent requests for comment from The Post.",
    "I think sounding such a cautionary note AT THE TIME was appropriate.”"
  ]
}