{
  "id": 9034,
  "mediaId": 8484,
  "date": "2022-03-25",
  "headline": "Supreme Court justice Clarence Thomas, 73, is discharged from hospital a week after he was admitted for 'flu-like symptoms' and treated with antibiotics for an infection",
  "image": "https://i.dailymail.co.uk/1s/2022/03/25/15/55750953-0-image-a-4_1648223801557.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10652581/Supreme-Court-justice-Clarence-Thomas-73-discharged-hospital-week.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "whatdoesitmean.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morgan Phillips",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Morgan+Phillips,+Politics+Reporter",
  "termIds": [
    5503,
    1882,
    2132,
    3414,
    4267,
    4905,
    1269
  ],
  "sentences": [
    "+9\nView gallery\nThomas sits with his wife and conservative activist Virginia Thomas (center) and GOP Senate Leader Mitch McConnell (right) while he waits to speak at the Heritage Foundation in October of 2021\n+9\nView gallery\nVirginia Thomas - wife of now Associate Justice of the United States Supreme Court, Clarence Thomas - stands behind Thomas during a news conference after his confirmation in 1991\n+9\nView gallery\nThomas shakes hands with then-Senate Judiciary Committee Chairman Joe Biden ahead of his 1991 confirmation hearings\n'Release the Kraken' is a phrase that was popularized by Powell referring to the alleged uncovering of fraud in the 2020 presidential election.",
    "+9\nView gallery\n+9\nView gallery\nVirginia 'Ginni' Thomas echoed QAnon conspiracy theories and tore into GOP lawmakers who did not support Trump's efforts to overturn the 2020 election in at least 29 text messages to former White House Chief of Staff Mark Meadows, a new report reveals\nPowell had been one of the first lawyers on the forefront of promoting Trump's election fraud theories.",
    "+9\nView gallery\nJustice Clarence Thomas was released from the hospital Friday after nearly a week-long stay\nConservative activist Virginia 'Ginni' Thomas, 65, urged Donald Trump's former aide to make controversial lawyer Sidney Powell the face of the ex-president's legal defense and appeared to frequently promote QAnon beliefs in texts obtained by the Washington Post.",
    "Meanwhile, at least one member of Congress has called for Thomas to be impeached and one senator has called on him to recuse himself from certain cases after texts obtained by the Jan. 6 committee revealed that his wife Ginni Thomas pushed 2020 election fraud conspiracy theories in exchanges with former Trump chief of staff Mark Meadows.",
    "She also said: 'Biden crime family & ballot fraud co-conspirators (elected officials, bureaucrats, social media censorship mongers, fake stream media reporters, etc) are being arrested & detained for ballot fraud right now & over coming days, & will be living in barges off GITMO to face military tribunals for sedition.'",
    "And despite his hospitalization the conservative justice was the lone dissenter in a case Thursday, opposing his colleagues in a case where they sided with a death row inmate seeking to have his pastor be able to pray out loud and touch him during his execution.",
    "Justice Clarence Thomas has been discharged from the hospital after nearly a week-long stay, the Supreme Court said, and he returns home to political firestorm over his wife's exchanges after the 2020 election and even calls to recuse himself from Jan. 6 cases.",
    "But the Thursday messages indicate that the Supreme Court justice spouse's beliefs went further than the traditional realms of right-wing politics and that she's even promoted the work of a Sandy Hook shooting denier to the upper echelons of the White House.",
    "+9\nView gallery\nThomas' conservative activism has at times earned ethical scrutiny for her husband, Supreme Court Justice Clarence Thomas\nThomas then appeared to push a QAnon theory that Trump had somehow added watermarks to mail-in ballots to track fraud.",
    "She also took aim at Republican lawmakers who refused to support Trump, as evidenced by a message seemingly referencing GOP Reps. Louie Gohmert of Texas, Jim Jordan of Ohio, Paul A. Gosar of Arizona and Chip Roy of Texas.",
    "The justice missed arguments before the high court on Monday, Tuesday and Wednesday but Chief Justice John Roberts said he would participate in the cases using briefs the parties filed and the transcript of the arguments.",
    "Thomas claimed in his lone dissent that John Henry Ramirez engaged in repeated litigation tactics to delay his execution and said the current lawsuit 'is but the latest iteration in an 18-year pattern of evasion.'",
    "+9\nView gallery\nIt was revealed earlier this month that Virginia Thomas was present at Donald Trump's Stop the Steal rally outside of the White House on January 6, 2021 -- hours before the Capitol riot.",
    "Two days after the November election, Thomas reportedly sent Meadows a YouTube video titled 'TRUMP STING w CIA Director Steve Pieczenik, The Biggest Election Story in History, QFS-BLOCKCHAIN.'",
    "Thomas has long played a role in conservative politics, having had a hand in scouting people for potential roles in George W. Bush's administration when she worked at the Heritage Foundation.",
    "Thomas' outspoken activism has more than once turned ethical scrutiny on her husband, Clarence Thomas, known by many legal experts as the most conservative member of the Supreme Court.",
    "In a November 24 message, Meadows apparently uses a Biblical reference of a battle between 'good versus evil' to describe Trump's battle to overturn Biden's electoral victory.",
    "'House and Senate guys are pathetic too... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy,' Thomas allegedly wrote.",
    "Before joining the Trump White House, Meadows was a Republican House representative from North Carolina and a founding member of the conservative House Freedom Caucus.",
    "The texts suggest Thomas even had a hand in crafting Powell's message -- and that she pushed that message to more members of the Trump White House than just Meadows.",
    "'Watermarked ballots in over 12 states have been part of a huge Trump & military white hat sting operation in 12 key battleground states,' Thomas wrote to Meadows.",
    "At the time her husband, Clarence Thomas, was presiding over the landmark Bush v. Gore case that would see the contested 2000 election won by the Republican.",
    "Sidney Powell & improved coordination now will help the cavalry come and Fraud exposed and America saved,' Thomas reportedly wrote to Meadows on November 13.",
    "The 29 messages are reportedly part of the vast tranche of documents Meadows handed over to the House select committee investigating the Capitol attack.",
    "Pieczenik is a former State Department official who said the 2012 slaughter of 26 people including 20 young children in Connecticut was a 'false flag.'",
    "However her wild claims and insistence on repeating them made her a polarizing figure that even led ex-Trump lawyer Rudy Giuliani to distance himself.",
    "The next message reportedly urged Meadows to listen to the opinions of conservative talk radio hosts Dan Bongino, Rush Limbaugh and Mark Steyn.",
    "The high court said his 'infection' was not COVID-19-related, but so far no more has been revealed about the 73-year-old justice's condition.",
    "Release the Kraken and save us from the left taking America down,' a message Thomas supposedly sent to Meadows on November 19 reads.",
    "She asked Meadows to 'Help This Great President stand firm' on November 10 and mentioned 'the greatest Heist of our History.'",
    "Thomas, 73, went to the hospital last Friday evening for 'flu-like symptoms' that were said to be unrelated to Covid-19.",
    "'Jared' could potentially be referred to Jared Kushner, Trump's son-in-law and a senior adviser in his administration.",
    "Oregon Democrat called on Clarence to recuse himself in 'all cases related to January 6th and the 2024 election.'",
    "After that Virginia Thomas reportedly got to coordinate a meeting between Trump and her allies in Washington.",
    "However she said she had left before Trump took the stage\nMeadows replied: 'I will stand firm.",
    "'Clarence Thomas needs to be impeached,' Rep. Ilhan Omar, D-Minn., wrote on Twitter Friday.",
    "Clarence Thomas was hospitalized late last week, the Supreme Court announced on Sunday.",
    "The Thomases privately dined with the Trumps when they were still in the White House.",
    "The Post's report notes that it's not clear who the 'best friend' Thomas mentions is.",
    "This plus a conversation with my best friend just now… I will try to keep holding on.",
    "Thomas, apparently touched, told Meadows: 'Tearing up and praying for you guys!!!!!",
    "'I hope this is true; never heard anything like this before, or even a hint of it.",
    "She said she attended, but got cold and left early, according to the Free Beacon.",
    "'Clarence doesn't discuss his work with me, and I don't involve him in my work.'",
    "Last month Thomas insisted that she had no role in organizing the Jan. 6 rally.",
    "The high court's longest-serving justice was nominated by President George H.W.",
    "Sounds like Sidney and her team are getting inundated with evidence of fraud.",
    "'Where the heck are all those who benefited by Presidents coattails?!!!'",
    "'Evil always looks like the victor until the King of Kings triumphs.",
    "She also insisted that she and her husband keep their work separate.",
    "It's commonly used among the far-right fringe of Trump supporters.",
    "'Just forwarded to yr gmail an email I sent Jared this am.",
    "It takes time for the army who is gathering for his back.'",
    "It was three days after Joe Biden was declared president.",
    "Well at least my time in DC on it,' Meadows wrote.",
    "He was treated for an infection with antibiotics.",
    "On November 6, Thomas added: 'Do not concede.",
    "We will fight until there is no fight left.",
    "Our country is too precious to give up on.",
    "The pair are reportedly longtime friends.",
    "'Mark (don’t want to wake you) ...",
    "Do not grow weary in well doing.",
    "she wrote along with the video.",
    "I have staked my career on it.",
    "Thomas replied: 'Thank you!!",
    "she added that same day.",
    "So proud to know you!!'",
    "Thanks for all you do.'",
    "America is worth it!'",
    "The fight continues.",
    "Bush in 1991.",
    "Make a plan.",
    "Possible???'",
    "Needed that!"
  ]
}