{
  "id": 9063,
  "mediaId": 2664,
  "date": "2022-03-29",
  "headline": "Tennessee senator refuses to explain his January 6 call to Trump: 'I don't have any comments'",
  "image": "https://www.rawstory.com/media-library/sen-bill-hagerty-r-tn.png?id=25547822&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/trump-capitol-riot-2657060811/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    2765,
    3247,
    3135,
    1489
  ],
  "sentences": [
    "All of this comes as the White House logs given to the House Select Committee investigating January 6 reportedly show a seven-hour gap in Trump's calls, leading investigators to question whether he was using secret backchannels or burner phones to keep his conversations off the official record.",
    "\\u201cI don\\u2019t have any comments on Jan. 6,\\u201d he told me\n— Manu Raju (@Manu Raju) 1648579521\nHagerty is one of many Republicans who reportedly contacted, or tried to contact, the former president during the events of the Capitol insurrection.",
    "On Tuesday, CNN congressional correspondent Manu Raju reported that Sen. Bill Hagerty (R-TN) refused to explain to him why he attempted to call former President Donald Trump the evening of the January 6 attack on the U.S. Capitol.",
    "One of the most famous discussions was one between Trump and House Minority Leader Kevin McCarthy (R-CA), in which McCarthy shouted at Trump to call off the rioters.",
    "Rep. Jim Jordan (R-OH) also reportedly had a lengthy phone call with Trump, and has been evasive about the nature of it.",
    "Sen. Bill Hagerty declines to comment on why he reportedly tried to call Trump on the evening of Jan. 6.",
    "\"I don't have any comments on Jan. 6,\" said Hagerty, according to Raju.",
    "Says he didn\\u2019t speak to Trump that day.",
    "Stories Chosen For You"
  ]
}