{
  "id": 9108,
  "mediaId": 2664,
  "date": "2022-03-29",
  "headline": "Handwritten notes may reveal 'unknown person' in last Trump call before mysterious seven-hour gap",
  "image": "https://www.rawstory.com/media-library/trump-surprised-russia-and-everyone-else-by-repeatedly-inviting-putin-to-the-white-house.png?id=24829872&width=1200&coordinates=0%2C0%2C0%2C1&height=600",
  "link": "https://www.rawstory.com/donald-trump-call-logs/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    5322,
    4905,
    4066,
    3883,
    3859,
    3621,
    2746,
    2765,
    849,
    6175
  ],
  "sentences": [
    "https://storage.courtlistener.com/recap/gov.uscourts.cacd.841840/gov.uscourts.cacd.841840.164.13.pdf\\u00a0\\u2026pic.twitter.com/iBoDyEv5Bw\n— Kyle Cheney (@Kyle Cheney) 1648553944\nThe logs obtained by the Post show Trump also spoke with then-Sen. David Perdue (R-GA) on Jan. 6, a day after each Georgia Republican lost runoff elections to Democratic challengers.",
    "The National Archives turned over White call logs to the House select committee, which the Washington Post obtained and found a seven-hour, 37-minute gap in calls between 11:17 a.m., when the call was made to the unidentified individual, and 6:54 p.m., when Trump instructed the operator to call aide Dan Scavino.",
    "However, handwritten notes on another White House document shows Trump called then-Sen. Kelly Loeffler (R-GA) at 11:17 a.m. -- three minutes before his final call to then-vice president Mike Pence, which has been previously reported but was not recorded in the call logs turned over to the committee.",
    "Loeffler had promised Trump two days earlier at a campaign rally that she would object to certification of Joe Biden's election win but changed her mind after the Capitol riot, but through a quirk in Georgia election law Perdue's term ended Jan. 3, 2021, so he was no longer in Congress.",
    "Other previously reported phone calls that did not show up on the White House logs include a phone call with Rep. Jim Jordan (R-OH), a heated exchange with House minority leader Kevin McCarthy (R-CA) and a conversation with Sen. Tommy Tuberville (R-AL).",
    "Handwritten notes in a previously released document from the National Archives may reveal the identity of the \"unknown person\" who was the last reported call made by Donald Trump before the Jan. 6 insurrection.",
    "NOW WATCH: Over 7 hours of disappearing Trump phone records makes Nixon's tapes 'look like nothing'\nOver 7 hours of disappearing Trump phone records makes Nixon's tapes 'look like nothing'",
    "NOTE: The 11:17am call to an \\u201cunidentified\\u201d person appears to be Kelly LOEFFLER, based on this previously released document from the National Archives."
  ]
}