{
  "id": 9121,
  "mediaId": 2745,
  "date": "2022-03-29",
  "headline": "The inexplicable gap in the Trump White House’s Jan. 6 records",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HM52LRQMWYI6VPM5YYUP2SFTUA.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/29/inexplicable-gaps-trump-records/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3737,
    3639,
    3883,
    4066,
    3621,
    3558,
    2746,
    2765,
    6678
  ],
  "sentences": [
    "9:41 a.m. — Giuliani\n9:52 a.m. — Stephen Miller\n10:32 a.m. — Nick Luna\n10:45 a.m. — William Bennett\n11:04 a.m. — Sen. David Perdue (R-Ga.)\n11:11 a.m. — Meets with his children and advisers\n11:17 a.m. — Call with “unidentified person” who appears to be Loeffler, based on handwritten notes in another White House document (no end time is recorded, and the call is not recorded at all on the call log)\nLate morning/apparently 11:20 a.m. — Pence (during which Trump reportedly tells him: “Mike, you can do this.",
    "7:30 p.m. — Mark Martin\n7:53 p.m. — Mitchell\n8:39 p.m. — Giuliani\n9:23 a.m. — Jason Miller\n9:42 p.m. — Kayleigh McEnany\n9:55 p.m. — Scavino\n10:50 p.m. — Eric Herschmann\n11:08 p.m. — Fox News host Sean Hannity\n11:23 p.m. — John McEntee\nThe White House isn’t the only entity to have slow-rolled its disclosure of Trump’s calls with Jordan; so did Jordan, who implausibly claimed he didn’t remember how often he spoke to Trump or when.",
    "8:34 a.m. — Kurt Olsen\n8:37 a.m. — Stephen K. Bannon\n8:45 a.m. — Rudy Giuliani\n8:56 a.m. — Requests White House Chief of Staff Mark Meadows\n9:02 a.m. — Requests Vice President Mike Pence\n9:16 a.m. — Requests Senate Majority Leader Mitch McConnell (R-Ky.) (a call that an aide says the senator declined)\n9:24 a.m. — Rep. Jim Jordan (R-Ohio)\n9:39 a.m. — Requests Sen. Josh Hawley (R-Mo.)",
    "4:03 p.m.-4:07 p.m. — Records message to supporters in Rose Garden\n6:54 p.m. — Requests Dan Scavino\n7:01 p.m. — Pat Cipollone\n7:08 p.m. — Scavino\n7:16 p.m. — Informed of pending calls from five people: Olsen, Mark Martin, Cleta Mitchell, Sen. Bill Hagerty (R-Tenn.) and Hawley.",
    "And the final call recorded before the gap — at 11:17 a.m. — lists the other party on the call only as an “unidentified person.” It is the only such call listed, and for some reason, it is featured in Trump’s daily diary but not in the call log (as the other calls are).",
    "(McCarthy has said he was “the first person to contact [Trump] when the riot was going on.” Trump reportedly told McCarthy, “Well, Kevin, I guess these people are more upset about the election than you are.”)\n2:24 p.m. — Trump tweets attacking Pence\n???",
    "11:38 a.m. — Leaves for “Stop the Steal” rally\n12 p.m.-1:17 p.m. — Speech at “Stop the Steal” rally\n1:19 p.m. — Returns to White House\n1:21 p.m. — Meets with valet\n2:11 p.m. — Capitol is breached\n2:13 p.m. — Pence escorted from Senate chamber\n???",
    "The Washington Post’s Bob Woodward and CBS News’s Robert Costa report that White House documents turned over to the House Jan. 6 committee feature a gap of 7 hours 37 minutes between phone calls that then-President Donald Trump had with allies.",
    "Below is a timeline of what we know, based on the White House documents (both the call log and the daily diary) and other key events in the public record (in italics), along with the missing and incomplete call information (in bold).",
    "For brevity, we’re excluding most requests for calls that were soon recorded as having taken place, while keeping requests for other calls that either weren’t recorded or didn’t happen for several hours.",
    "Not only is the other party not identified (unlike with the other calls), but it also features no end time (unlike with the other calls), and it doesn’t appear in the call log (unlike the other calls).",
    "The gap somehow neatly breaks down with the last recorded call — with Perdue at 11:04 a.m. — at end of a page, and the next one — the request for Scavino at 6:54 p.m. — at the top of the next page.",
    "The documents appear to exclude calls Trump had with then-Vice President Mike Pence, Rep. Jim Jordan (R-Ohio), Sen. Tommy Tuberville (R-Ala.) and House Minority Leader Kevin McCarthy (R-Calif.).",
    "Fifty years ago, the scandalous actions of an American president were shielded from public view, thanks to a suspiciously convenient 18½-minute gap in the Nixon White House’s call recordings.",
    "Other Trump actions are recorded in that period, including an hour-plus-long speech he gave at a rally that preceded the insurrection, and some of his movements inside the White House.",
    "You could certainly make an argument, then, that the gap stretches to nearly eight hours, between Trump’s calls with Perdue at 11:04 a.m. and his request for Scavino at 6:54 p.m.",
    "The gap takes place between 11:17 a.m. and 6:54 p.m., covering virtually the entirety of the insurrection at the U.S. Capitol, which was breached at 2:11 p.m. on Jan. 6, 2021.",
    "Perhaps most important, we know the logs are missing at least four calls — and important ones, at that — that have become public knowledge in the year since Jan. 6.",
    "), who led the effort to stop Congress from finalizing Trump’s loss, and Senate Minority Leader Mitch McConnell (R-Ky.), who an aide said declined to take the call.",
    "Politico reported this call took place early in the insurrection and featured Jordan and Rep. Matt Gaetz of Florida asking Trump to call off his supporters.)",
    "If you don’t do it, I picked the wrong man four years ago.” The timing of the call is described as 11:20 in the same document featuring the Loeffler call.)",
    "He spoke with at least eight people that morning, in the period before the more than seven-hour gap, and he spoke with at least 11 people afterward.",
    "McCarthy also threatened phone and tech companies that supplied records to the Jan. 6 committee with retribution if Republicans retake the House.",
    "Previously released White House records suggest the call was with Sen. Kelly Loeffler (R-Ga.), but for some reason the details are not recorded.",
    "But also consider this: That call, followed by the Pence call, would have been listed on the next page of records, if there were such a record.",
    "Today, the actions of another American president remain shielded thanks to another convenient — and inexplicable — gap in White House records.",
    "A previous version of this post incorrectly said that then-Vice President Mike Pence was escorted from the House chamber on Jan. 6, 2021.",
    "His office later confirmed there were multiple calls between the two that day, but only one is recorded by the White House.",
    "And the gaps pre-dated the insurrection, as the missing information on the Pence and apparent Loeffler calls indicate.",
    "But it certainly raises all kinds of questions about whether people deliberately shielded Trump’s actions on Jan. 6.",
    "That seems possible, but certainly these times would seem to call for extra care in recording Trump’s actions.",
    "Because the documents show Trump rather feverishly working the phones at virtually all other times.",
    "Trump also requested a number of calls with people for whom calls were never recorded in the logs.",
    "We already know that the latter two calls occurred in that gap, and the others appear to as well.",
    "He also repeatedly requested calls with, and received messages from, the White House switchboard.",
    "Were people caught up in the moment and not recording things after the insurrection was underway?",
    "(Jordan has confirmed he spoke with Trump multiple times that day.",
    "Trump asks for calls to Olsen, Martin and Mitchell.",
    "— House Minority Leader Kevin McCarthy (R-Calif.).",
    "There is no question that information is missing.",
    "We don’t yet know if this gap is truly Nixonian.",
    "But vast stretches of time are unaccounted for.",
    "Among those people: Sen. Josh Hawley (R-Mo.",
    "The 11:17 call is particularly interesting.",
    "He was escorted from the Senate chamber.",
    "— At least one more call with Jordan.",
    "The question is how much and why.",
    "This post has been corrected.",
    "I’m counting on you to do it.",
    "Why is that inexplicable?"
  ]
}