{
  "id": 9133,
  "mediaId": 2728,
  "date": "2022-03-29",
  "headline": "8-hour gap in Trump’s Jan. 6 White House phone records",
  "image": "https://images.thestar.com/cWweKi5SMoxbK9_BJkjMCT5I-Z0=/1280x1024/smart/filters:cb(1648595862258)/https://www.thestar.com/content/dam/thestar/news/world/us/2022/03/29/8-hour-gap-in-trumps-jan-6-white-house-phone-records/20220329160316-624369960ef01d788fab4e21jpeg.jpg",
  "link": "https://www.thestar.com/news/world/us/2022/03/29/jan-6-panel-missing-roughly-8-hours-of-trumps-phone-calls.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Clare Jalonick",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The committee’s effort to piece together Trump’s day as his supporters broke into the Capitol underscores the challenge that his habitual avoidance of records laws poses — not only to historians of his tumultuous four years but to the House panel, which intends to capture the full story of the former president’s attempt to overturn the election results in hearings and reports later this year.",
    "During the roughly eight hours on Jan. 6, Trump addressed a huge crowd of supporters at the nearby Ellipse, repeated falsehoods about his election defeat and told them to walk to the Capitol, make their voices heard and “fight like hell.” He then returned to the White House and watched as the mob broke into the Capitol.",
    "WASHINGTON (AP) — The House panel investigating the Jan. 6 insurrection at the Capitol has identified an almost 8-hour gap in official White House records of then-President Donald Trump’s phone calls as the violence unfolded and his supporters stormed the building, according to two people familiar with the probe.",
    "The panel issued a broad records preservation order in August to almost three dozen telecommunications and social media companies, demanding that the companies save communications for several hundred people in case Congress decided to issue subpoenas for them.",
    "The committee has trained a particular focus on what the president was doing in the White House as hundreds of his supporters beat police, broke into the Capitol and interrupted the certification of Democrat Joe Biden’s 2020 presidential election victory.",
    "He had a tense conversation with House Republican leader Kevin McCarthy, who asked him to call off the mob, according to Republican Rep. Jaime Herrera Beutler of Washington state, who shared McCarthy’s account shortly after the insurrection.",
    "Biden, who has authority as the sitting president over his predecessor’s White House privilege claims, said Tuesday he would reject Trump’s claims concerning the testimony of his daughter, Ivanka Trump, and her husband, Jared Kushner.",
    "Courts have overruled his efforts to block some documents, but many witnesses who are still close to the former president — and several who were in the White House that day — have declined to answer the committee’s questions.",
    "He spoke to Vice President Mike Pence between 11 a.m. and 11:30, according to a person familiar with that conversation, as he had been lobbying Pence publicly and privately to object while presiding over the certification.",
    "The committee also is continuing to receive records from the National Archives and other sources, which could produce additional information and help produce a full picture of the president’s communications.",
    "That log shows calls with his former aide Steve Bannon, conservative commentator William Bennett and Sean Hannity of Fox News, according to one of the people familiar with the records.",
    "While hundreds of people have cooperated with the probe, in some cases the panel has been hampered by Trump’s assertions of executive privilege over material and interviews.",
    "The House panel has made broad requests for separate cell phone records and has talked to more than 800 witnesses, including many of the aides who spent the day with Trump.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "The committee is investigating the gap in the official White House log, which includes the switchboard and a daily record of the president’s activities.",
    "He often bypassed the White House switchboard, placing calls directly, according to a former aide who requested anonymity to discuss the private calls.",
    "Both spoke to The Associated Press on the condition of anonymity because they were not authorized to speak publicly about the ongoing investigation.",
    "The gap extends from a little after 11 a.m. to about 7 p.m. on Jan. 6, 2021, and involves White House phone calls, according to one of the people.",
    "He also spoke with several GOP members of the House and Senate as his allies in Congress were preparing to challenge the official vote count.",
    "Trump had no immediate comment Tuesday, but he has previously disparaged the investigation and sued to stop records production.",
    "Individuals included in that request included Trump, members of his family and several of his Republican allies in Congress.",
    "Trump responded that the rioters must be “more upset about the election than you are,” according to Herrera Beutler.",
    "The committee also has thousands of texts from the cell phone of Mark Meadows, who was then Trump’s chief of staff.",
    "The White House log does show calls Trump made before that time period, as he was preparing to speak at the rally.",
    "The missing records raise questions of whether Trump purposefully circumvented official channels to avoid records.",
    "Kushner, who was one of Trump’s top White House aides, is scheduled for an interview with the panel on Thursday.",
    "The committee has requested an interview with Ivanka Trump as well, but has not said whether she will comply.",
    "SHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "Utah Sen. Mike Lee has said that Trump accidentally called him when he was trying to reach Tuberville.",
    "Trump also talked to Ohio Rep. Jim Jordan and Sen. Tommy Tuberville of Alabama, among other lawmakers.",
    "The exact length of time of the gap was first reported jointly by The Washington Post and CBS News.",
    "It is unclear whether the committee has obtained records of cell phone calls made that day.",
    "But it does not mean the panel is in the dark about what Trump was doing during that time.",
    "Trump was known to use other people’s cell phones to make calls, as well as his own.",
    "Tuberville has said he spoke to the president while the Senate was being evacuated.",
    "It is not unusual for presidential calls to be channeled through other people.",
    "___\nAssociated Press writer Zeke Miller contributed to this report.",
    "The gap in the phone records was previously reported by the AP.",
    "Several of Trump’s calls that day are already publicly known.",
    "More than 700 people have been arrested in the violence.",
    "The Star does not endorse these opinions."
  ]
}