{
  "id": 9207,
  "mediaId": 2664,
  "date": "2022-03-29",
  "headline": "Trump’s mysterious last recorded phone call before the Jan. 6 riot was to an ‘unidentified person’",
  "image": "https://www.rawstory.com/media-library/white-house-shuts-down-press-availability-after-trump-tweet-admits-collusion.jpg?id=24723452&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/trump-call-logs-2657056774/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    3639,
    3621,
    4345,
    3037,
    2863,
    2765,
    5732,
    5322
  ],
  "sentences": [
    "The call records show Trump spoke to allies Steve Bannon and Rudy Giuliani before 9 a.m. and then returned a call from chief of staff Mark Meadows before instructing the operator to call then-vice president Mike Pence at 9:02 a.m.\nBannon asked Trump during their one-minute call whether Pence was coming for a breakfast meeting, where he hoped he could be pressured to stop the certification of Joe Biden's win, according to two people familiar with the conversation, but Trump said the vice president would not be coming to the White House after their heated meeting the previous evening in the Oval Office.",
    "That call came at 11:17 a.m., before Trump addressed his supporters at a \"Stop the Steal\" rally at the White House Ellipse, and was the last official record of a phone conversation the then-president made until seven hours and 37 minutes later -- a gap that has fallen under investigation by the House select committee, reported the Washington Post.",
    "His final call was a 17-minute conversation with John McEntee, his director of presidential personnel, starting at 11:32 p.m.\nNOW WATCH: Over 7 hours of disappearing Trump phone records makes Nixon's tapes 'look like nothing'\nOver 7 hours of disappearing Trump phone records makes Nixon's tapes 'look like nothing'",
    "Records turned over by the National Archives show no calls until 6:54 p.m., when he instructed the operator to call aide Dan Scavino, and committee members are investigating as whether Trump used burner phones or backchannels to communicate as his supporters stormed the Capitol.",
    "The final call with Pence was not listed in the records, although multiple sources close to both men say they spoke by phone in the late morning, before the \"Stop the Steal\" rally, and the vice president reportedly enraged Trump by stating he would not block certification.",
    "The records show Trump spoke that evening with White House counsel Pat Cipollone, press secretary Kayleigh McEnany, political adviser Jason Miller, former North Carolina Supreme Court chief justice Mark Martin and conservative attorney Cleta Mitchell.",
    "Other calls were made to Senate minority leader Mitch McConnell (R-KY), who an aide says declined the call, and Sen. Josh Hawley (R-MO), and Trump spoke for 10 minutes with Rep. Jim Jordan (R-OH) starting at 9:24 a.m.",
    "The call logs also show Trump spoke Jan. 6 with election lawyers, White House officials, outside allies including then-Sen. David Perdue (R-GA), conservative pundit William Bennett and Fox News host Sean Hannity.",
    "He next spoke with Giuliani for six minutes at 9:41 a.m., and then again for nine minutes at 8:39 p.m., and the logs show Giuliani called from different phone numbers.",
    "Trump agreed to call Pence again and ask him to delay certification, and the call logs show he and Bannon spoke again for seven minutes starting at 10:19 p.m.",
    "The last phone call Donald Trump made before the Jan. 6 insurrection began was with an \"unidentified person,\" according to White House call logs.",
    "\"\"I have no idea what a burner phone is, to the best of my knowledge I have never even heard the term,\" Trump told the Post in a statement.",
    "“The President talked on a phone call to an unidentified person,\" reads the 11:17 a.m. entry.",
    "Trump spoke to senior adviser Stephen Miller for 26 minutes starting at 9:52 a.m."
  ]
}