{
  "id": 9214,
  "mediaId": 2658,
  "date": "2022-03-24",
  "headline": "Tour trepidation ahead of Capitol opening",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/03/24/tour-trepidation-ahead-of-capitol-opening-00019971",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5699,
    4066,
    1429,
    226,
    336,
    6159,
    6038
  ],
  "sentences": [
    "When asked about the security anxieties of tour guides, Blunt said “we can’t blame them for that.” In a statement, the Capitol Police said the tours are a “cornerstone” of the visitor experience and that they are working “through a thoughtful and safe re-opening plan.”\nThe elephant (insurrection) in the room… Tour guides who talked to Huddle, and who were granted anonymity to protect their jobs, told us that CVC tour guides on Tuesday received guidance from Capitol Police about what to do if a tour participant says they were part of the siege of the Capitol on Jan. 6 2021, or if they generally seem like a threat.",
    "QUICK LINKS\nHow Trump threw Mo Brooks under the bus, from Natalie Allison and Meridith McGraw\nTop Russian military leaders repeatedly decline calls from U.S., prompting fears of ‘sleepwalking into war’, from The Washington Post\nUkraine president to press Biden, NATO for more support, from The Associated Press\nKetanji Brown Jackson Reminded Republicans They Could Fix The Range Of Grievances They Aired, from BuzzFeed News\nTRANSITIONS\nMegan Quinn is now press secretary for Rep. Steven Palazzo (R-Miss.).",
    "Here’s a recap from The Nebraska Examiner: Fortenberry defense presents case that congressman was unaware of illegal gifts and The Associated Press: Fellow member of Congress on trial is 'honest,' California lawmaker testifies\nCUELLAR CAN COUNT ON PELOSI— Speaker Nancy Pelosi (D-Calif.) affirmed her backing of the most conservative member of her Democratic Caucus, Rep. Henry Cuellar (D-Texas), who is in a primary runoff against a progressive challenger and was recently raided by the FBI.",
    "“But that's very much an active discussion right now, and I hope we can find the answer.”\nShow me the way… Carrie Gallagher, president of AFSCME Local 658, the union that represents the Capitol’s professional tour guides and visitor assistants, tells Huddle her members are feeling anxious about security and being responsible for de-escalating situations in a highly partisan political climate.",
    "Tour trepidation ahead of Capitol opening\nBy KATHERINE TULLY-MCMANUS\n03/24/2022 07:14 AM EDT\nPresented by Connected Commerce Council\nWith help from Burgess Everett and from Florida: Sarah Ferris and Olivia Beaver\nTHE PEOPLE’S HOUSE — While many members are sure to applaud the return of Capitol tours, one group isn’t so thrilled: the professional tour guides.",
    "Catch up on Wednesday’s confirmation action: Cursing senators, judicial philosophy and document demands: 5 takeaways from Jackson hearing\nMark your calendar…The Senate Judiciary Committee will vote Monday, March 28, on Jackson’s nomination to the Supreme Court, Senate Judiciary Committee Chairman Sen. Dick Durbin (D-Ill.) said last night.",
    "She seems like a very nice lady, and certainly well-accomplished, but I don’t think anybody is under any illusion about how she’s going to line up on the court.”\nMarianne has comments from each of the nine names to watch for, from centrist Republicans to conservatives cutting loose after this term…don’t miss this tally sheet analysis.",
    "“One of the big challenges right now, is the number of vacancies at the Capitol Police and how to open more doors and create more opportunities for people to get into the Capitol,” Sen. Roy Blunt of Missouri, the top Republican on the Senate Rules Committee, told your Huddle host.",
    "Keep an eye out for Lincoln… Patrick Jackson, husband of Judge Jackson, has been sporting fun socks during his wife’s Senate Judiciary Committee confirmation hearings this week, featuring Thomas Jefferson on Monday, Benjamin Franklin on Tuesday and John F. Kennedy on Wednesday.",
    "“Elections are important, but I think it’s more important than just running against another party to tell the American public what you’ll do,” McCarthy said, offering a preview of those issues, including gas prices, secure borders, energy independence and anti-crime.",
    "In a 10-member press conference, House Minority Leader Kevin McCarthy (R-Calif.) joined senior Republicans in pummeling President Joe Biden and his party on everything from rising gas prices to border security and energy independence.",
    "Noon today… The Congressional Hispanic Staff Association and the Congressional Asian Pacific American Staff Association host a panel discussion featuring women-of-color staffers working in Congress and navigating the Hill.",
    "Prosecutors wanted to bring up Fortenberry’s proxy voting authorization letter, which says he is unable to vote due to the ongoing coronavirus pandemic (not an ongoing federal trial), as evidence that he isn’t truthful.",
    "Dress for success…The Congressional Hispanic Staff Association, together with the Women’s Congressional Staff Association, is hosting a “Spring Cleaning Clothing Swap” Sunday, March 27th from 12PM-3PM at SVC 200.",
    "That means both staff-led and professionally guided tours will enter through the Longworth House Office Building and the Dirksen Senate Office Building and be escorted to the Capitol through the tunnels.",
    "They are awaiting guidance on how to address the largest attack on the Capitol since the War of 1812 during the tours, given that visitors may hold profoundly divided views on the substance of that day.",
    "GOP IN JAGUAR-LAND — Greetings from a drizzly Jacksonville, Fla. where our Olivia Beavers and Sarah Ferris are covering the House GOP retreat — which already has a lot less fanfare than last year.",
    "HERE COMES THE HOTLINE — Senators are hotlining a deal that would allow a vote on the House's ban on Russian oil imports and the separate bill to revoke normal trade relations with Russia.",
    "In one closed-door session, we're told this music video created by Rep. Andrew Clyde (R-Ga.) -- which is about taking back the House -- had several Republicans cackling and applauding.",
    "Happy hour alert… The Congressional Progressive Staff Association is hosting a happy hour on Friday, April 1st at Metrobar DC for folks to meet the group’s new steering committee.",
    "Politics class of Ravens Wood School in London, England, correctly answered that approximately 374 treaties were ratified between the United States and Indian Tribal Governments.",
    "Call it a throwback… Phase one of reopening will give tenured staff on Capitol Hill unpleasant flashbacks to the days before the completion of the Capitol Visitor Center in 2008.",
    "Some Republicans worry that the party will actually be more vulnerable to Democratic attacks if they offer too many policy promises, which may only divide their own party.",
    "Rep. Jim Jordan (R-Ohio) summed it up like this: “Joe Biden and the Democrats have literally messed up every single thing they tried to do.”\nThe bigger message though?",
    "After two years of a silent, empty rotunda devoid of visitors, those Capitol guides have security concerns as limited public tours are scheduled to resume next week.",
    "That is what I do.”\nIncumbent, investigated…The FBI has not made clear what it was investigating when it raided Cuellar’s home and Cuellar has denied any wrongdoing.",
    "Circuit Court of Appeals and the White House and Senate Democrats are hoping for a repeat: a bipartisan confirmation of the first Black woman on the Supreme Court.",
    "HUDDLE HOTDISH\nDon’t @ me… After Sen. Ted Cruz (R-Texas) sparred with Durbin at Jackson’s confirmation hearing on Wednesday, he checked his Twitter mentions.",
    "McCarthy and his team made clear that this week’s retreat will be a key part in shaping a full-fledged agenda to present to voters as soon as this summer.",
    "Former Rep. Trey Gowdy (R-S.C.) talked about the Benghazi committee and his and Fortenberry’s breakfast routines when they served together in the House.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Thursday, March 24, where the red jackets and cardigans return next week.",
    "Manger said he wished there was capacity to monitor the tour route specifically, according to CVC guides he briefed, but there isn’t enough staffing.",
    "In January, Capitol Police Chief Thomas Manger told lawmakers that his department is 447 officers short of “where we need to be,” for full capacity.",
    "Senate split screen: You’ll recall NRSC Chairman Rick Scott (R-Fla.) rolling out his own agenda just a few weeks ago — with some unintended results.",
    "The socks come in a pack… your Huddle host is betting on Lincoln making an appearance today (the other remaining pair features… Queen Elizabeth).",
    "“I would anticipate they'd be eager to get back to the job that I think almost all of them are great at,” Blunt said of the CVC tour guides.",
    "But the argument from McCarthy and crew on Wednesday was that if — or when — Republicans take back the House, they’ll be ready with a plan.",
    "Instead, Republican leaders kicked off the three-day pep rally on Wednesday by focusing on their favorite topic: Going after Democrats.",
    "This timeline, if objections do not emerge on the hotline, would give President Joe Biden something tangible to announce in Brussels.",
    "RELATED: Limited Capitol tours return Monday, but some say it’s happening too slow, from Chris Cioffi at CQ Roll Call\nGOOD MORNING!",
    "There aren’t enough Capitol Police to staff the $621 million underground fortress designed to be a security buffer for the Capitol.",
    "Elisa Catalano Ewers has started as the Middle East and North Africa lead for Democrats on the Senate Foreign Relations Committee.",
    "MEET THE SCOTUS SWING VOTES — Judge Ketanji Brown Jackson got three Republican votes last year when she was confirmed to the D.C.",
    "Do you know what it’s about?”\nPelosi and other Dems did not go on their annual trip to Laredo this year (But our Sarah did.)",
    "Sen. Mike Crapo (R-Idaho) has been pushing for the two proposals to move together, stalling quick action on the trade bill.",
    "But the panel’s rules allow for any committee business to be held over for one week, which could push the vote to April 4.",
    "Under this structure, the two bills would stay separate, though the oil ban would be amended and sent back to the House.",
    "Sarah Arkin will remain the deputy staff director and handle the Europe portfolio for SFRC Chair Bob Menendex (D-N.J.).",
    "Don't expect to see a specific agenda by week's end: McCarthy predicted it'd be done “by the end of the summer.\"",
    "“When you hear that from people who are in charge, you're like, why are we opening?” one CVC guide told Huddle.",
    "Current Rep. Anna Eshoo (D-Calif.) also took the stand: “I think he brings honor to what he does,” Eshoo said.",
    "Representatives of these task forces are focused on policy and politics,” Rep. Gary Palmer (R-Ala.) said.",
    "“I think it’s south of three” Republicans likely to support Jackson, said Sen. John Cornyn (R-Texas).",
    "The last time they led groups through the building predated both the pandemic and the insurrection.",
    "But with more context on the fact that proxy letters are form letters, the judge didn’t allow it.",
    "She was formerly an adjunct senior fellow at the Center for a New American Security think tank.",
    "It all goes back to a familiar problem for the complex: the Capitol Police are understaffed.",
    "TODAY’S QUESTION: Only two American presidents have traveled to Ukraine while in office.",
    "… My sensibility is that he brings integrity to everything he does.”\nProxy war(ning)...",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "That Republicans will have more than just that message to run on in November.",
    "She previously was deputy press secretary for Rep. Lisa McClain (R-Mich.).",
    "“I support my incumbents,” Pelosi said during a news conference in Austin.",
    "“I don’t know what it is,” Pelosi said when asked about the FBI inquiry.",
    "TODAY IN CONGRESS\nThe House convenes at 1 p.m. for a pro forma session.",
    "COURTROOM DRAMA — The trial of Rep. Jeff Fortenberry (R-Neb.)",
    "The Senate convenes at 10 a.m. with an 11:30 a.m. vote.",
    "“That’s what happened in her court of appeals hearing.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "“I support every one of them, from right to left.",
    "I can’t say that about all members of Congress.",
    "GET HUDDLE emailed to your phone each morning.",
    "TRIVIA\nWEDNESDAY’S WINNER: The Year 13 U.S.",
    "Send your answers to ktm@politico.com.",
    "But of course, there was also levity.",
    "“I haven’t seen anything, have you?",
    "H/t Kent Nishimura who captured it.",
    "really has a little of everything.",
    "“There’s a theme here.",
    "His work is good.",
    "Who were they?",
    "“He’s honest."
  ]
}