{
  "id": 9290,
  "mediaId": 2664,
  "date": "2022-03-29",
  "headline": "Columnist: Bombshell report on missing call logs could make it easier for Jan. 6 committee to get records from Trump allies",
  "image": "https://www.rawstory.com/media-library/donald-trump-and-kevin-mccarthy-save-america-pac.jpg?id=28813853&width=1200&coordinates=0%2C54%2C0%2C54&height=600",
  "link": "https://www.rawstory.com/donald-trump-call-logs-2657059072/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    3621,
    2765,
    1359,
    849
  ],
  "sentences": [
    "Documents turned over by the National Archives to the House select committee don't account for the period between just after 11 a.m. to nearly 7 p.m., although the former president reportedly called at least one Republican senator asking to delay the election certification as the violence raged, reported the Washington Post.",
    "But the select committee might already have records of those missing calls because they have subpoenaed phone records from some key players, and the lengthy gap in White House call logs will strengthen lawmakers' case to obtain phone records from other members of Congress or Trump allies.",
    "\"The source close to the committee tells me the missing phone logs might strengthen the case internally for subpoenaing them, because there should be more pressure on those lawmakers to testify about these calls with Trump.\"",
    "\"The committee is debating whether to subpoena members of Congress such as [House minority leader Kevin] McCarthy (R-CA) and Rep. Jim Jordan (R-OH), who also talked to Trump on Jan. 6,\" wrote Post columnist Greg Sargent.",
    "Nearly eight hours are missing from White House call logs for the period when Donald Trump's supporters mobbed the U.S. Capitol -- raising new questions about the president and his inner circle.",
    "“He was using the leverage of the violent insurrection to keep the inside political coup against Pence going,” said Rep. Jamie B. Raskin (D-MD), a member of the Jan. 6 committee.",
    "“Most everyone not cooperating with the committee is helping shield Trump from public disclosure about what happened during that period.\""
  ]
}