{
  "id": 9316,
  "mediaId": 2730,
  "date": "2022-03-29",
  "headline": "AOC Calls on Justice Thomas to Resign or Be Impeached",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2019/199/d539548a-313e-493f-81a8-08dce6392458.png",
  "link": "https://townhall.com/tipsheet/madelineleesman/2022/03/29/aoc-calls-on-justice-thomas-to-resign-or-be-impeached-n2605192",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Leesman",
  "authorUrl": "https://townhall.com/tipsheet/madelineleesman/",
  "termIds": [
    0
  ],
  "sentences": [
    "Since then, several Democratic lawmakers sent a letter to Thomas and Chief Justice John Roberts stating that he “must disqualify himself from any proceeding in which his impartiality might reasonably be questioned.’ And any judge must do the same when he knows that his spouse has ‘any…interest that could be substantially affected by the outcome of the proceeding.’” The letter was signed by several Democrats, including Sen. Dianne Feinstein (CA), Sen. Amy Klobuchar (MN), Sen. Elizabeth Warren (MA), Sen. Cory Booker (NJ), and “squad” member Rep. Cori Bush (MO).",
    "Scott Applewhite\nDemocratic “squad” Member Rep. Alexandria Ocasio-Cortez (NY) on Tuesday called for Supreme Court Justice Clarence Thomas to resign or face impeachment for texts his wife sent to former President Donald Trump’s White House Chief of Staff Mark Meadows and not recusing himself from cases pertaining to the Jan. 6 Capitol riots.",
    "“If not, his failure to disclose income from right-wing organizations, recuse himself from matters involving his wife, and his vote to block the Jan 6th commission from key information must be investigated and could serve as grounds for impeachment.”\nClarence Thomas should resign.",
    "If not, his failure to disclose income from right-wing organizations, recuse himself from matters involving his wife, and his vote to block the Jan 6th commission from key information must be investigated and could serve as grounds for impeachment.",
    "Ocasio-Cortez added that “impeachment should absolutely be on the table” and that “a failure to hold Clarence Thomas accountable sends a loud, dangerous signal to the full court,” and named two Trump-era appointed justices.",
    "— Alexandria Ocasio-Cortez (@AOC) March 29, 2022\nLast week, The Washington Post reported that Thomas’ wife, Virginia “Ginni” Thomas, sent text messages to Meadows urging him to challenge the 2020 election.",
    "pic.twitter.com/ySCefqQeCm\n— Forbes (@Forbes) March 25, 2022\n\"If you spent any time studying the Supreme Court justice, he's one who studies and correctly, and I mean from all the way through.",
    "Congress must understand that a failure to hold Clarence Thomas accountable sends a loud, dangerous signal to the full Court - Kavanaugh, Barrett, & the rest - that his acts are fair game.",
    "#BREAKING: House GOP Minority Leader Kevin McCarthy is asked if Justice Clarence Thomas should recuse himself from Jan. 6th-related cases, says that, \"It's his decision based upon law.\"",
    "— Alexandria Ocasio-Cortez (@AOC) March 29, 2022\nOn Friday, House Minority Leader Kevin McCarthy (CA) said it’s Thomas’ decision whether or not to recuse himself.",
    "— Alexandria Ocasio-Cortez (@AOC) March 29, 2022\nSubpoenas, investigations, and impeachment should absolutely be on the table.",
    "“I think Justice Thomas could make his decisions like he’s made them every other time,\" McCarthy said Friday.",
    "If he sees it's not upholding the Constitution, he'll rule against it,\" McCarthy added.",
    "A failure to act puts the imperiling of democracy squarely on *our* shoulders.",
    "Inaction is a decision to erode and further delegitimize SCOTUS.",
    "“Clarence Thomas should resign,” Ocasio-Cortez tweeted.",
    "GOP Rep. Jim Jordan (OH) chimed in that he agreed.",
    "We shouldn’t have to think twice about that.",
    "We must go where the facts take us.",
    "\"It’s his decision based upon law.\"",
    "\"That's what his job should be.\"",
    "It’s our duty to defend it.",
    "This is a tipping point.",
    "Source: AP Photo/J."
  ]
}