{
  "id": 9379,
  "mediaId": 2553,
  "date": "2022-03-28",
  "headline": "‘Worst Of All Possible Worlds’: Tom Cotton, Jim Jordan, Other GOP Leaders Blast Biden For ‘Horrendous Gaffe’ In Poland Speech",
  "image": "https://dw-wp-production.imgix.net/2022/03/GettyImages-1239575036.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/worst-of-all-possible-worlds-tom-cotton-jim-jordan-other-gop-leaders-blast-biden-for-horrendous-gaffe-in-poland-speech",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Rigolizzo",
  "authorUrl": "https://www.dailywire.com/author/john-rigolizzo",
  "termIds": [
    2119,
    2122,
    4905,
    4591,
    1477,
    1126,
    1150,
    6526,
    6569
  ],
  "sentences": [
    "And he’s always talking about not escalating, which is the reason why they didn’t send the MiG jets into Ukraine in the first place, because they don’t want to be too provocative.”\nThe Daily Wire is one of America’s fastest growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "“We need to be careful and precise in things we say, particularly as commander in chief of our country.”\n“We went from, you know, Ronald Reagan, ‘Tear down [this wall],’ to the toughness of [former President] Trump, to now the President of the United States, President Biden, giving speeches where he basically says, ‘I don’t know what I’m doing.’ So that is very dangerous.",
    "“We will have a different future, a brighter future, rooted in democracy and principles, hope and light, dignity and decency, freedom and possibilities.” Biden then apparently went off-script from his prepared remarks, ad-libbing the last line: “For God’s sake, this man cannot remain in power.”\nWhite House officials immediately walked back Biden’s comments.",
    "So you get the worst of all possible worlds.” Cotton added that the pattern of Biden making problematic off-script remarks was “not reassuring for our safety or to our allies.”\nOhio Republican Congressman Jim Jordan expressed his concerns late Saturday, warning that Biden’s comments were not just confusing, but that they were actually dangerous.",
    "“He was not discussing Putin’s power in Russia, or regime change.”\nShortly after the speech on Saturday, Republican Arkansas Senator Tom Cotton blasted Biden for his off-the-cuff remarks, and the White House’s rush to “clarify” them, during an interview on Fox News.",
    "“He said something that Vladimir Putin will use for his own reasons to say, ‘See I told you all along that the United States and NATO wants to attack Russia, wants to topple our government,’ then his staff turned around and walked it back.",
    "Republican Congressional leaders slammed President Joe Biden over the weekend for the “horrendous gaffe” he made at a speech in Poland Saturday, when he appeared to suggest that Vladimir Putin should be ousted as President of Russia.",
    "Republican Idaho Senator Jim Risch praised Biden’s speech, but again lamented Biden’s “horrendous gaffe.” “He gave a good speech, but…There was a horrendous gaffe right at the end of it,” Risch told CNN.",
    "“The President’s point was that Putin cannot be allowed to exercise power over his neighbors or the region,” a White House official said in a statement, reported by Fox News’ Jacqui Heinrich.",
    "But my gosh, I wish they would keep him on script.”\nSen. Jim Risch (R-ID) on Biden's \"This man cannot stay in power\" line about Putin:\n\"There was a horrendous gaffe right at the end of it.",
    "He offered limited praise for unifying NATO but slammed Biden for going against U.S. policy and his own rhetoric against escalating the conflict in Ukraine.",
    "pic.twitter.com/xrGfThg37T\n— The Recount (@therecount) March 27, 2022\nTexas Congressman Michael McCaul added to the barrage of criticism Monday.",
    "“Here’s the president potentially having more war-triggering type language than probably any president in American history,” Jordan said.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "“Ukraine will never be a victory for Russia, for free people refuse to live in a world of hopelessness and darkness,” Biden said.",
    "“When he goes off-script, every time he does that, he seems to cause an international incident, and we get way off messaging.",
    "“What definitely wasn’t right was to have the combination of the two,” Cotton told host Brian Kilmeade.",
    "Let’s hope it stops, and let’s hope there’s an end to this as soon as possible.” Jordan added.",
    "Biden made the comments at a speech at the Royal Castle in Warsaw.",
    "It’s not the policy of the United States to have regime change.",
    "But my gosh, I wish they would keep him on script.\"",
    "Whoever wrote that speech did a good job for him.",
    "Whoever wrote that speech did a good job for him.",
    "Create a free account to join the conversation!",
    "Become a member now and join our mission.",
    "“I just wish he would stay on script.",
    "I just wish he would stay on script.",
    "Believe the same?"
  ]
}