{
  "id": 9447,
  "mediaId": 2693,
  "date": "2022-03-24",
  "headline": "The Dead Consensus and the Dying Dems",
  "image": "https://149366087.v2.pressablecdn.com/wp-content/uploads/2022/03/Ketanji_Brown_Jackson_-_Confirmation_hearing_day_1_-_21_March_2022.jpeg",
  "link": "https://spectator.org/the-dead-consensus-and-the-dying-dems/",
  "mediaOutlet": "The American Spectator",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott McKay",
  "authorUrl": "https://spectator.org/author/smckay/",
  "termIds": [
    0
  ],
  "sentences": [
    "But third, a reading of our history indicates that rather than tearing the country apart, the loss of our political consensus is more likely to result in an upheaval in which the much-discussed Overton window will shift and then settle — just as it did in the years following Jefferson’s Revolution of 1800, when the Federalist Party disintegrated into irrelevance, the years following Lincoln’s election in 1860, and the years after Franklin Delano Roosevelt’s election in 1932 and the coming of the New Deal.",
    "As essayist Wesley Yale noted on Twitter, “The existence of a controversy” about the definition of a woman “is something manufactured within the last five years, and not through advancement of our scientific understanding.”\nThe Democrats brand Latinos with a term they hate (Latinx), cling to masks like Japanese soldiers still fighting WW II in 1957 and teach sex ed in kindergarten.",
    "And what Proft and I talked about Thursday morning, at least in part, is that the army of the Left girding for the battle to shape the next consensus, while it certainly commands some high ground in its control of many of our institutions and at least nominally holds a great deal of political power at present, has a very serious problem.",
    "We’ve seen more than a year of the Left’s power structure doing everything it could to brand Republicans, and particularly the populist/MAGA/revivalist conservatives who make up both the vast majority of the GOP’s voters and activists and now, increasingly, its political candidates, as terrorists and radicals.",
    "She didn’t just give away the store by saying “I’m not a biologist” in response to Sen. Marsha Blackburn’s query about the nature of the female — by doing so she conceded that it’s biology that makes a woman, something sure to disappoint William “Lia” Thomas and the rest of the trans gang.",
    "Trans people claim to be oppressed, they insist that a woman or man is whoever declares that status on any given day, and because oppression must be cosseted, acknowledged, and put at the forefront of every question, the Democratic Party nods enthusiastically or simply remains silent.",
    "Retiring Democrat Stephanie Murphy of Florida — leaping off the party bus as it drives through a red light, off the overpass and through the roof of the manure processing plant — says her party is being taken over by a faction that is trying to “dismantle capitalism.”\nThat’s spot on.",
    "That’s why they’re panicking, and it’s why, despite a sense that she’ll ultimately be confirmed, Ketanji Brown Jackson is a national laughingstock for failing to deliver even a babbling answer for basic questions like what’s the definition of a woman or when does life begin.",
    "That consensus fueled an era marked by the welfare state, the regulatory state, the military-industrial complex, the education-media-political complex, and foreign adventurism for fun and profit particularly in the post–Cold War phase of the era.",
    "The consensus between that center Right and center Left was so cozy that cynics not part of the Beltway “in-crowd” began referring to it as the Uniparty, implying there is no real difference between Republican and Democrat politicians.",
    "Proft had me on to talk about Tuesday’s column in this space, which covered the difference in courage between the Babylon Bee’s Seth Dillon and National Review’s Andrew McCarthy where doing battle with the Left is concerned.",
    "It tells you that for all their political and cultural victories over the past 30 years against weak Bush Republicans, leftists like Ketanji Brown Jackson still have to try to hide who they are from adult scrutiny.",
    "Here it is: the political consensus that has persisted for essentially all of our lives was established, to oversimplify the case, by William F. Buckley conservatives and Daniel Patrick Moynihan liberals.",
    "Nancy Pelosi’s Jan. 6 Commission is a political fizzle, and far from disgracing and eliminating Donald Trump they’ve now looked in horror as he polls better than the current occupant of the White House.",
    "They’re trying to cancel all the people who object to the Lia Thomas fiasco, and yet their Supreme Court nominee won’t even articulate their position in the highest-profile debate available.",
    "Donald Trump didn’t kill his political career when he eviscerated John McCain; to the contrary, his crack about McCain letting himself get captured in North Vietnam built his career.",
    "Kyle Smith, writing at the New York Post Wednesday, did an outstanding job of digging it up:\nDemocrats now view everything in terms of who’s being systematically oppressed.",
    "And whatever recent successes they might have had notwithstanding, a political movement that has to hide in the shadows on basic questions like this is not the future.",
    "In just about two months my book The Revivalist Manifesto will be out, and a fundamental bit of its analysis is being validated by events on the political scene.",
    "With the Uniparty’s billowing foul odor among Americans of virtually every ideological stripe, we’re going to have a battle for the new consensus in America.",
    "You can find a poll here and there that might disagree, but most Americans don’t really see Jan. 6 as the “insurrection” the Democrats insist on calling it.",
    "Everything the Democrats are saying, at every level from the trivial to the economy-defining, is nuttier than an explosion at the Snickers factory.",
    "It’s a nothingburger now, and so is the contention that MAGA/revivalism, as practiced by Trump, Jim Jordan, Ron DeSantis, and others, is fringe.",
    "The clock is rapidly ticking on Liz Cheney and Adam Kinzinger; both will be effectively gone from elective politics before the end of the year.",
    "Our institutions are horribly corrupt and in need of reconstruction, and America badly needs a reformation of our shared values.",
    "Note: for more related to this, let me recommend an excellent piece by the editors at American Mind, which appeared last week.",
    "You can’t find a “moderate” Democrat under 75 years old, and nobody listens to the James Carvilles and Doug Schoens anymore.",
    "It’s a radio segment from an appearance I had on Dan Proft’s morning show Thursday on AM 560 The Answer in Chicago.",
    "As I said in the radio segment with Proft, the future lies in the hands of the MAGA/revivalist movement.",
    "From there you get to “I have no idea how to distinguish a woman” in about three intellectual moves.",
    "Don’t call it a lunatic “fringe.” Lunacy is the heart, soul and brain of the Democratic Party now.",
    "That’s understood on both sides of the aisle, though agreement on solutions is nowhere in sight.",
    "The American people know what’s fringe, and we’re seeing more and more evidence they’re correct.",
    "I include this segment so our readers will get a taste of where this column is headed.",
    "The polls show that, but those polls are simply an outward symptom of the problem.",
    "All of the Left’s policies are poison, and their personages aren’t cute anymore.",
    "Take illegal immigrants from the border and sprinkle them all over the country!",
    "It just has to identify and elect its leaders and get to work reviving America.",
    "The reasonable view of racism is that there has always been racism in America.",
    "Voters are bound to notice when a party is singing nothing but looney tunes.",
    "It signified that Trump was not part of the GOP side of the Uniparty crowd.",
    "The Buckleyites and Moynihanians are kaput in their respective parties.",
    "The Jan. 6, 2021, protests are held up as the proof of this contention.",
    "Mitch McConnell is the least popular political figure in Washington.",
    "Their poor imitations are rapidly aging and dwindling in number.",
    "First, the consensus and the era it brought about are both dead.",
    "Beg Saudis for fuel while stopping Americans from producing it!",
    "Three things are emerging, however, surrounding that analysis.",
    "Second, the era that consensus forged is clearly dead as well.",
    "There’s more to Jackson’s refusal to answer those questions.",
    "The general demurrer in those confirmation hearings matters.",
    "The woke translation is that America is defined by bigotry.",
    "How long it takes to die is debatable, but it is dying.",
    "These people are part of a dying political movement.",
    "(READ MORE by Scott McKay: Who Will Beat the Left?)",
    "Nothing about America works as it should right now.",
    "Spend trillions of dollars to reduce inflation!",
    "Closing schools for a year is no big deal!",
    "We’ll start this off with a YouTube video.",
    "But that doesn’t resonate, does it?",
    "Let property crimes go unanswered!",
    "Forced masking for toddlers!",
    "That’s telling.",
    "As it must."
  ]
}