{
  "id": 945,
  "mediaId": 8322,
  "date": "2022-02-11",
  "headline": "Rep. Comer accuses Fauci, CCP of covering up COVID origins 'from day one': 'Is he a mad scientist?'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/GettyImages-1232843448-1.jpg",
  "link": "https://www.foxnews.com/politics/comer-fauci-ccp-cover-up-covid-origins-mad-scientist",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    4969,
    3217,
    4838,
    323,
    1472,
    1126,
    1612
  ],
  "sentences": [
    "Comer made the accusation against Fauci and the Chinese Communist Party (CCP) during a Thursday phone interview with Fox News Digital, also blasting the Biden administration for wasting \"a lot of time\" to get to the bottom of the Wuhan lab leak theory\nThe lead Republican on the House Oversight Committee also pointed to President Biden’s pledge to have his intelligence team look into it in \"90 days,\" which resulted in an inconclusive report.",
    "He also pointed out that the Chinese military entered the Wuhan lab \"early on\" in the pandemic and that Fauci \"should have alerted the Trump administration\" at the pandemic's onset to the leading scientists' lab leak theories and the \"American tax dollars\" that went to EcoHealth Alliance for the gain-of-function research at WIV.",
    "The Kentucky Republican said \"there's no question\" the CCP is trying to cover up the virus's origins at the Wuhan Institute of Virology (WIV) and pointed to China's testing of animals in Wuhan at the beginning of the pandemic without testing \"the original mice that they used to do these gain-of-function research on.\"",
    "(Tom Williams/CQ-Roll Call, Inc via Getty Images/Poo)\n\"Ninety days passed, 100 days passed, he finally issued a report that said, 'well, they didn't find anything,'\" Comer said, praising Republicans for publishing the emails showing the scientists theorizing about a lab leak from Wuhan.",
    "The lawmakers sent a letter to Health and Human Services (HHS) Secretary Xavier Becerra pointing to a conference call from Feb. 1, 2020, that included Fauci and former National Institutes of Health Director Francis Collins in which the virus's origins were discussed.",
    "\"As more time passes, it's going to be harder to prove without a shadow of a doubt where this came from, but it looks to me like there's been a massive cover-up from day one — not just by communist China, but also by Dr. Fauci,\" Comer said.",
    "House Oversight Committee ranking member James Comer, R-Ky., accused China and White House chief medical advisor Dr. Anthony Fauci of working separately to cover up the origins of COVID-19 \"from day one.\"",
    "Comer and Rep. Jim Jordan, R-Ohio, published portions of emails last month revealing Fauci knew that COVID-19 may have been intentionally modified and leaked from the Wuhan Institute of Virology.",
    "The letter said other scientists participated in the call, four of whom wrote a paper titled \"The Proximal Origin of SARS-CoV-2\" that they sent to Fauci and Collins three days after the call.",
    "The congressman warned that the longer a thorough probe into the origins of the virus takes place, the harder it will be to concretely prove its beginnings.",
    "So we would love to have Dr. Fauci come, but I'm at the point now where I would rather Fauci come after\" the scientists in the emails.",
    "The National Institute of Allergies and Infectious Diseases did not immediately respond to Fox News Digital’s request for comment.",
    "\"I wonder — this is me, I'm not speaking on behalf of the committee — but I'm wondering: is he a mad scientist?\"",
    "He also accused China and Fauci of engaging in \"a massive cover-up from day one\" on COVID-19’s origins.",
    "\"I mean, why wasn't he forthcoming in the fact that we were funding gain-of-function research?\"",
    "Says Fauci has \"an open invitation\" to speak to the House Republicans \"any time he wants.\"",
    "\"None of that was ever relayed to President Trump, so why was that not relayed?",
    "Story tips can be sent to Houston.Keene@Fox.com and on Twitter: @HoustonKeene",
    "The article did not argue that the virus originated in the lab.",
    "Houston Keene is a politics reporter for Fox News Digital.",
    "Fox News' Ronn Blitzer contributed reporting.",
    "Comer also said."
  ]
}