{
  "id": 9484,
  "mediaId": 2699,
  "date": "2022-03-22",
  "headline": "Josh Hawley Is on the Verge of Being ‘Senator From QAnon’",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1647926831/TNA-josh-hawley-qanon-16x9_aocfhv",
  "link": "https://www.thedailybeast.com/josh-hawley-is-on-the-verge-of-being-senator-from-qanon?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Daily Beast",
  "authorUrl": "https://www.thedailybeast.com/author/the-daily-beast-branded",
  "termIds": [
    5005,
    2119,
    2218,
    2421,
    3639,
    3823,
    3925,
    4905,
    1489,
    1101
  ],
  "sentences": [
    "Later on the podcast, Molly makes predictions about the midterms—“Benghazi on steroids… It’s going to be the worst two fucking years of our lives.”\nShe gets more insight on impending midterm shittiness from NBC News political analyst Susan Del Percio, mainly because Del Percio has a very scary midterm prediction involving Jim Jordan.",
    "Republicans must have come up short in finding legitimate ways to smear President Biden’s Supreme Court nominee Judge Ketanji Brown Jackson that they’ve resorted to calling her a pedophile sympathizer, says New Abnormal co-host Molly Jong-Fast in Tuesday’s episode.",
    "You’re gonna have rulings that, looked at 10-15 years later, may not stand up or not even stand up under scrutiny, but maybe the times have changed or maybe the circumstances have changed,” she tells co-host Andy Levy.",
    "Plus, Danielle Carnival, head of Biden’s White House Cancer Moonshot program, breaks down how exactly her team plans to meet the president’s goal of decreasing cancer by 50 percent in 25 years.",
    "She’s specifically referring to Sen. Josh Hawley’s claims that Judge Jackson goes easy on people convicted of child-porn offenses.",
    "So they had to attack her for her rulings, which as you know, anyone who’s been a judge has rulings.",
    "Even worse, adds Molly, using the word “pedophilia” is like a dog whistle for the QAnon types.",
    "“Hawley, at this point, he’s on the verge of becoming the Senator from QAnon,” says Andy.",
    "“Like with so many very coordinated right-wing attacks, they couldn’t find anything else.",
    "Here’s a hint: lots of government agencies coming together like the Justice League.",
    "In fact, Andy thinks so little of Hawley, he gives a rare compliment to Ted Cruz.",
    "And sorry to anti-vaxxers, but according to her, vaccines will play a big part.",
    "Right?"
  ]
}