{
  "id": 9523,
  "mediaId": 2636,
  "date": "2022-03-29",
  "headline": "Ginni Thomas Is No Outlier",
  "image": "https://static01.nyt.com/images/2022/03/31/opinion/29bouie_1-02/29bouie_1-02-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/03/29/opinion/ginni-thomas-bill-barr.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Last month, the head of the National Republican Senatorial Committee, Senator Rick Scott of Florida, released an 11-point agenda that, among other things, denies the existence of transgender people and calls on the government to treat socialism as a “foreign combatant.”\nAnd those Republicans who don’t openly hold fringe views are more than willing to pander to them, such as Senator Ted Cruz’s enthusiastic embrace of “stop the steal” and Senator Josh Hawley’s QAnon dog whistle that Ketanji Brown Jackson, President Biden’s nominee for the Supreme Court, is soft on (and sympathetic to) child predators.",
    "And judging from her text messages to Meadows — which include the hope that the “Biden crime family & ballot fraud co-conspirators” are awaiting trial before military tribunals at Guantánamo Bay — she is also something of a QAnon believer, one of millions of Americans who embrace the conspiracy theory that Trump is fighting a messianic war against the “deep state.”\nGinni Thomas is also, notably, the wife of the Supreme Court Justice Clarence Thomas.",
    "“To my mind,” he said, “the real ‘miracle’ in Philadelphia that summer was the creation of a strong executive, independent of, and coequal with, the other two branches of government.”\nBarr concedes the fact of “checks and balances” but insists that, properly understood, the executive branch has nearly limitless authority across several arenas.",
    "For Democrats, and especially for Democratic leadership, the upshot of all of this is that they should give up whatever hope they had that the Republican Party will somehow return to normal, that the fever will break and American politics will snap back to reality.",
    "In his view, the framers “well understood that their prime antagonist was an overweening Parliament” and that their aim at the Constitutional Convention in 1787 was to create a powerful, “unitary” executive with the singular authority of a monarch.",
    "And while Justice Thomas is in no way responsible for the actions of his spouse, it does beggar belief to think he is unaware of her views and actions, including her work to keep Trump in office against the will of the electorate.",
    "In an interview he gave to The Chicago Tribune just before the 2020 election, Barr insisted that mail-in voting would lead to “selling and buying votes” and implied that Democrats would manufacture votes to win elections.",
    "A fervent supporter of former President Donald Trump, she reportedly urged his chief of staff, Mark Meadows, to do everything in his power to subvert the results of the 2020 presidential election and keep Trump in power.",
    "It is a gussied-up version of Trump’s belief that under Article II of the Constitution, he had “the right to do whatever I want as president.” It may not be QAnon, but it still belongs to the fringe.",
    "“The Constitution is designed to maximize the government’s efficiency to achieve victory — even at the cost of ‘collateral damage’ that would be unacceptable in the domestic realm,” Barr said.",
    "Like Thomas, former Attorney General William P. Barr is a mainstay of the Republican establishment in Washington, a consummate insider with decades of political and legal experience.",
    "With that said, and despite his later rejection of Trump’s claims of electoral fraud, Barr does appear to hold somewhat conspiratorial views not unlike those of Ginni Thomas.",
    "The only alternative is to confront the Republican Party as forcefully as possible and show the extent to which that party has descended into conspiracies and corruption.",
    "From its base to its leaders, the modern Republican Party is fully in the grip of an authoritarian movement animated by extreme beliefs and fringe conspiracy theories.",
    "Leading figures like Representatives Jim Jordan of Ohio and Marjorie Taylor Greene of Georgia regularly give voice to conspiracy theories and other wild accusations.",
    "“The idea that the judiciary acts as a neutral check on the political branches to protect foreign enemies from our government is insane.”\nThese are extreme views.",
    "In his view, Congress has no right to challenge claims of executive privilege and the courts have no right to limit the president’s power to make war.",
    "His service under President Ronald Reagan in the White House led to his appointment as head of the Office of Legal Counsel under President George H.W.",
    "What matters here is that we have, in Ginni Thomas, a very high-profile Republican activist who holds, and acts on, fringe, conspiratorial beliefs.",
    "In a November 2019 speech sponsored by the Federalist Society, Barr spoke at length on his vision of executive power under the Constitution.",
    "That appears to have been the plan so far, and if the current political state of the Democratic Party is any indication, it’s not working.",
    "She is an influential and well-connected conservative political activist who has been a fixture of Washington since the late 1980s.",
    "At this point, there’s very little distance between the fringes of the modern Republican Party and the elites who lead it.",
    "He returned to public life in 2019 to serve a second stint as attorney general, this time under Trump.",
    "Every vote will be counted!’ Yeah, but we don’t know where these freaking votes came from,” Barr said.",
    "But there’s no reason to think that Barr’s traditional credentials somehow preclude fringe beliefs.",
    "From there, he was appointed deputy attorney general and then, in 1991, attorney general.",
    "In fact, members of the Republican elite are very often the fringe figures in question.",
    "Superficial differences of affect and emphasis mask shared views and ways of seeing.",
    "You can play this game with any number of prominent Republicans.",
    "Democrats can’t force Republicans onto a different path.",
    "But they also can’t act as if they’re above the fray.",
    "What Barr describes isn’t a president, but a king.",
    "“Someone will say the president just won Nevada.",
    "But that’s something of a separate issue.",
    "Take Virginia (known as Ginni) Thomas.",
    "We just discovered 100,000 ballots!",
    "As it turns out, they don’t.",
    "And she is not alone.",
    "‘Oh, wait a minute!",
    "Bush."
  ]
}