{
  "id": 957,
  "mediaId": 2578,
  "date": "2022-02-11",
  "headline": "ROGER STONE EXCLUSIVE: Liar Adam Schiff Faces Challenge from Fiery Conservative Woman Attorney, Descendant of Slaves",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/fire-schiff-.jpg",
  "link": "https://www.thegatewaypundit.com/2022/02/roger-stone-exclusive-liar-adam-schiff-faces-challenge-fiery-conservative-woman-attorney-descendant-slaves-2022-californians-can-finally-flush-schiff/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/joehoft/",
  "termIds": [
    2119,
    2415,
    2441,
    2391,
    2370,
    2879,
    5245,
    1477,
    1478
  ],
  "sentences": [
    "Yet on April 15, 2018,appearing on ABC’s “This Week,” Schiff made a point to say that it was “simply not true” that there had been no evidence the 2016 presidential campaign for Donald Trump colluded with Russia.”\nSchiff, never one to let facts get in the way, continued making headlines such as this one on April 27, 2018: “ADAM SCHIFF ANNOUNCES DEMOCRATS HAVE EVIDENCE OF TRUMP/RUSSIA COLLUSION.” The story quoted Schiff: “In fact, we found evidence of collusion in the abundant secret meetings and communications between Trump campaign officials and associates.”\nFinally, Schiff changed his assertions of collusion yet again on NBC’s “Meet the Press.” As if trying to clarify his many contradictory statements, he defended his committee’s investigation, saying: “At the outset of the investigation, there was circumstantial evidence of collusion.”\nEnough!",
    "“What is clear is this: the Kremlin repeatedly told the campaign it had dirt on Clinton and offered to help it, and at least one top Trump official, the president’s own son, accepted.” Schiff, of course, ignored that fact that Donald Trump, Jr. received nothing whatsoever from the Russian lawyer he met with, and that the Russian woman in question met both before and after the Trump Tower meeting with Glenn Simpson of Fusion GPS, who produced the bogus Steele dossier about Trump with assistance from Russian intelligence assets.",
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nOnly weeks before that Schiff was forced to admit on ” The View “that the Steele dossier, the fabricated “Hillary paid -for”, the baseless report used by both ” Schifty ” Schiff and Special Counsel Robert Mueller to justify the three-year politically motivated witch hunt which was essentially an illegitimate attempt to remove a duly elected American president, was a fraud.",
    "Schiff stated on Feb. 7, 2018 that there was “certainly a lot of evidence” of collusion between the Trump campaign and Russia.” He added, “In terms of ethical violations and acting against the interest of the United States, that evidence is already ample and in the public view.” Again, the congressman from West Hollywood never produced evidence of any such thing.",
    "On Dec. 10, 2017 Schiff once again stated, “We have all of these facts in chronology, you’d have to believe that these were all isolated incidents, not connected to each other — just doesn’t make rational sense … We do know this: the Russians offered help, the campaign accepted help, the Russians gave help and the president made full use of that help.",
    "While her fighting spirit in defense of the United States Constitution is reason enough for voters to give her a shot at representing them in California’s 30th congressional district and replacing Adam Schiff, her personal story is nothing short of absolutely remarkable.",
    "Mrs. Kennedy has also been on the frontlines in the fight for election integrity and is currently one of 12 plaintiffs for a lawsuit filed by the Election Integrity Project of California, which is currently being heard by the 9th Circuit Court of Appeals.",
    "Guest post by Roger Stone\nLiar Adam Schiff Faces Challenge From Fiery Conservative Woman Attorney, Descendant of Slaves\nCongressman Adam Schiff is without question the worst congenital liar, con-man, and huckster ever elected to the US Congress.",
    "This devoted wife, mother of six – including triplets, and grandmother of four, will not put up with the never-ending stream of propaganda that Adam Schiff spews to his constituents and the American people on an almost daily basis.",
    "Completely devoid of any ethics or integrity, Schiff was caught red-handed only weeks ago editing the text messages of former White House Chief of Staff Mark Meadows as well as Congressman Jim Jordan in the January 6th Witch Hunt.",
    "As a courageous and honest attorney, unlike Schiff who should have been disbarred many years ago for his litany of criminal acts, Mrs. Ronda Kennedy would restore honor to California’s 30th congressional district.",
    "That is pretty damning, whether it is proof beyond a reasonable doubt of conspiracy or not.” Documents ultimately declassified by acting DNI Director Rick Grenell prove this is just another Schiff lie.",
    "The antics of Adam Schiff are standard operating procedure for this charlatan, who frequently makes explosive public charges readily lapped up by the media in order to generate headlines.",
    "Kennedy is the great-granddaughter of Wisconsin’s first black State Assemblyman, Le Roy Simmons, whom she credits for convincing her to join the Republican Party at the age of 18.",
    "In a March 22, 2017 exchange with Chuck Todd on Meet the Press Daily, Todd suggested that the evidence of Russian collusion with the Trump campaign was at best circumstantial.",
    "A self-made African American attorney and descendent of slaves has come forward to challenge the leaking and lying partisan Democrat, and her name is Ronda Baldwin Kennedy.",
    "He finally had to concede that the panel he co-chaired had seen no evidence at all that the Trump campaign “colluded” with the Russian government during the 2016 election.",
    "This is the same court where Kennedy won a federal lawsuit in favor of gun shop owners to remain in business during unconstitutional lockdowns in the state of California.",
    "She is a proud Republican and dynamic no-nonsense attorney who successfully fought to keep businesses open during California’s draconian COVID-19 lockdowns.",
    "… I will say that there is evidence that is not circumstantial, and is very much worthy of investigation.” Of course, Schiff produced nothing of the kind.",
    "Schiff also ignored questions about who issued her visa to enter the country — after the U.S. attorney for the Southern District of New York denied it.",
    "True to form, Schiff said he would do it all over again and would place the entire smear document in the congressional record.",
    "On Nov. 1, during a House Intelligence Committee hearing, Schiff laid out the evidence for Trump-Russia collusion.",
    "Then , in what appeared to be a direct reversal, Schiff then appeared on ABC’s “The View” on March 3, 2018.",
    "She is a well-respected litigator who loves the constitution as much as she loves her country and family.",
    "Schiff and his enablers in the media virtually never come up with proof to back his accusations.",
    "He is a skeevy dishonest punk who belongs in prison for leaking and lying, among other things.",
    "You can help rid Congress of Adam Schiff and help her campaign by going to RondaKennedy.com.",
    "Her great aunt started the first Black-owned bank in Wisconsin, Columbia Savings and Loans.",
    "Kennedy has stated that she is Adam Schiff’s “worst nightmare” and I wholeheartedly agree.",
    "And I can’t go into the particulars, but there is more than circumstantial evidence now.",
    "We now know that there never was any Russian collusion with the Trump campaign.",
    "Of course, Schiff never lets the facts get in the way of a political smear.",
    "Now , finally a formidable challenger to Adam Schiff has stepped forward.",
    "In fact, it’s Schiff’s trail of fabrications that are always shifting.",
    "Simmons was a runaway slave who joined the Union Army as a water boy.",
    "But don’t interrupt Lil’ Adam Schiff when he’s on a rhetorical roll.",
    "Schiff lies so much he has a hard time keeping his lies straight.",
    "This included fighting for the rights of eateries and gun shops.",
    "In 2022, Californian’s can finally flush the Schiff.",
    "“I can tell you that the case is more than that.",
    "“Actually, no, Chuck,” Schiff said.",
    "Summary\nRecent Posts\nContact"
  ]
}