{
  "id": 9592,
  "mediaId": 2807,
  "date": "2022-03-25",
  "headline": "Live Around the Planet: Friday March 25th",
  "image": "https://www.steynonline.com/pics/5322.jpg",
  "link": "https://www.steynonline.com/12256/live-around-the-planet-friday-march-25th",
  "mediaOutlet": "steynonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Steyn",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "That's 7pm in the Canadian Maritimes, half-past-seven in Newfoundland - and, beyond the Americas, 10pm in London and Dublin; 11pm in Paris and Berlin; midnight in Odessa and Kyiv, as we now have to spell it; 1am in Moscow, where Putin is running out of generals; half-past-one in Tehran, for all you Newfoundlanders who move to Iran for the half-hour time zone; 3.45am in Kathmandu, for all you Iranians who move to Nepal to check out the quarter-hour time zone; 6am in Singapore, Honkers and Western Australia (sorry about that); 9am in Sydney and Melbourne, and an even more civilised hour for the lockdown kippers and kedgeree in Auckland and beyond.",
    "I can't recall precisely what I was saying back then (mid-November 2020), but my view of this matter has been consistent throughout: America runs the crappiest elections in the entire western world (and indeed by comparison with the functioning parts of the developing world) and in this particular case it was enough to change the result, which is why I refer to the dead husk of a moth-eaten sock-puppet being passed off as the Leader of the Free World only as \"Joe Biden\" or \"Mr Biden\", never \"President Biden\".",
    "For example, I see I have a tangential connection to the alleged scandal du jour in America's Godawful newspapers - the disclosure of dozens of texts from Mrs Clarence Thomas to Trump chief of staff Mark Meadows supporting the notion that the 2020 presidential election was stolen:\nShe continued by urging him to \"Help This Great President stand firm\" and invoking \"the greatest Heist of our History.\"",
    "and the flat-earthers on the Left continue to cover up and deny science regarding the origins of Covid and its effectiveness and serious side effects; or their lies about the biological facts of life regarding the social engineering crowd who refuse to cede any ground as we've seen in Florida, and are going full scorched earth in terms of public education, could Red states try a \"Quebec solution\" ?",
    "Her texts are now being used to try and bounce her husband, one of only two reliable judges on the Supreme Court, into early retirement - an idea so skull-crushingly stupid any number of bigtime Republicans will be bamboozled into going along with it, thereby giving Joe Biden the chance to appoint a second paedos-get-out-of-gaol-free judge to the nation's highest court.",
    "When the U.N. says \"world\", it's a dog whistle for plebians and \"climate change mitigation\" is a dog whistle for widespread poverty and economic hardship for 99% of the planet since Guterres doesn't really expect the likes of Jeff Bezos, Nancy Pelosi and Al Gore to mothball their private jets or other modes of gasoline powered transport.",
    "On March 25, 2022 at 6:22 pm, Tony Allwright wrote:\nHi Mark,\nA Question for Your Q&A Today\n------------------------------------------\nOn one of your recent GBNews TV shows, your guest talked about Russia's demographic death spiral, with its low-low birth rates (not to mention its high, male vodka-induced death rates).",
    "Even The Daily Mail is hot for the story:\nThe next message reportedly urged Meadows to listen to the opinions of conservative talk radio hosts Dan Bongino, Rush Limbaugh and Mark Steyn...\n'Where the heck are all those who benefited by Presidents coattails?!!!'",
    "On March 25, 2022 at 6:40 pm, Veronica L wrote:\nHi Mark,\nPutin gave a speech on Western 'cancel culture' today, citing many examples from Hollywood films to JK Rowling, and then went on to say that the West is now trying to entirely cancel Russia itself.",
    "Mark Steyn, Bongino, Cleta\" – appearing to refer to conservative commentators Rush Limbaugh, Mark Steyn and Dan Bongino, as well as lawyer Cleta Mitchell, who was involved in Trump's push to claim victory in Georgia despite Biden's certified win there.",
    "On March 25, 2022 at 6:20 pm, Robert Fox wrote:\nMark,\nEarlier this week, U.N. Secretary-General Antonio Guterres declared that the world has to put up with soaring gasoline prices so that the overall goal of climate change mitigation can be achieved.",
    "On March 25, 2022 at 6:37 pm, Brian from Minneapolis wrote:\nDear Mark,\nSo let me get this right: Our message from our leaders is that in order to save the planet, the international community that makes up only 10% of the world, needs to go green.",
    "And if this is a problem for Russia, how much worse will it be for China, each of whose soldiery – as a direct result of its viciously enforced one-child policy – is similarly siblingless, and as such has been raised as a Little Emperor?",
    "As soon as we go live, members should log-in and submit their queries via our comment form below - and I'll answer them as-it-happens on the audio livestream that should magically appear above (or possibly below - I forget which).",
    "Listeners in the Americas should please note the slightly later hour due to the US and Canada's somewhat premature springing into summer: 6pm North American Eastern time, which is for this brief period 10pm Greenwich Mean Time.",
    "The birth rates mean most soldiers have no siblings and thus each death is an unmitigated family disaster and tragedy because it represents the end of any hope for old-age care for his parents plus the end of the family line.",
    "On March 25, 2022 at 6:15 pm, Drew Weber wrote:\nHello Mark,\nContrary to popular opinion in the US, Biden took comfort in saying that \"I don't think I'll find any European leader that thinks I'm not up to the job\".",
    "On March 25, 2022 at 6:34 pm, Laura Rosen Cohen wrote:\nHey Mark, perhaps you could comment further for the benefit of non-Canadians listening about how North Korea-ish it is here in Canada with respect to travel.",
    "Can China realistically sustain, and will China's parents accept, the high death rate that will inevitably ensue, should it invade Taiwan, whose army is bigger and far better equipped and trained than Ukraine's?",
    "Whether or not you're a member of The Mark Steyn Club, you can listen to our Clubland Q&A live as it happens wherever you chance to be on this turbulent earth: Club membership is required only to ask a question.",
    "Thanks and love everything you are doing on GB News :)\nOn March 25, 2022 at 6:45 pm, Elisa Angel wrote:\nThe funny thing is that Lia Thomas can't even just \"try\" to be a woman because it will always be an act.",
    "On today's show I'm happy to take questions on any of the subjects we've talked about in recent days, plus anything we haven't gotten around to - with our regular caveat that certain subjects bore me stiff.",
    "As you know, since this Ukraine thing got going, I've long referred to it as \"the most corrupt country in Europe\" and I'm not too comfortable with Zelenskyy's sweeping prohibitions of \"pro-Russian parties\".",
    "Indeed, how long will the Russian soldiers themselves, used to being the sole, precious focus of their families, tolerate being put at such mortal risk for a cause they scarcely even understand?",
    "On March 25, 2022 at 6:02 pm, Robert Bridges wrote:\nIn light of the outrageous outcomes of trials/bail of the 1/6 protestors/visitors to the Capitol... how do you see your suit with Mann going?",
    "Paul Nachman\nBozeman, Montana\nOn March 25, 2022 at 7:06 pm, Ornery Texan wrote:\nWhy is it important to have a black woman on the Supreme Court if the nominee can't or won't define \"woman\"?",
    "On March 25, 2022 at 6:04 pm, Midwestern Tim wrote:\nI saw that Russian Embassy tweet earlier this week with a picture of Bill & Hillary, Barack & Michelle, George & Laura, and George H.W.",
    "Best wishes and keep up the good work,\nTony Allwright (in Dublin, Ireland)\nOn March 25, 2022 at 6:26 pm, Eric Dale wrote:\nMark, are these the last moments before our giant bubble pops?",
    "On March 25, 2022 at 6:18 pm, AlyM wrote:\nMark, I was going to pose this question to you even before I read the latest skullduggery by the Democrats' sycophants, the mainstream media.",
    "We love to hear from brand new members, so if you've joined this week, either for a full year or a see-how-it-goes experimental quarter, do shoot me a head-scratcher for today's show.",
    "But, if you're not interested in joining, no worries, as they say in Oz: We seek no unwilling members - and as always the show is free to listen to, so we hope you'll want to tune in.",
    "On March 25, 2022 at 7:30 pm, Michael Cavino wrote:\nThe odds that Paul Farhi of the Washington Post listened to your full remarks from three days after the election are slim and none.",
    "Taiwan would likewise be fighting for its life and its future, and more than likely will have powerful allies, even the US, fighting alongside it as well as keeping it supplied.",
    "Ironically it was FBOs Syria threat that resulted in FBO inviting none other than the Russkis to play in the sandbox to smooth things over after Assad called FBOs bluff.",
    "Do you think there is a concerted effort to do that, using the Ukraine war as an excuse, but really because Russia represents a threat to the 'progressive' worldview?",
    "But Club membership does confer a few benefits, including not only participation in our Q&As but also access to Tales for Our Time, our Sunday Poems and much more.",
    "On March 25, 2022 at 6:11 pm, Michael J. from Colorado wrote:\nHi Mark,\nThe search for someone to step up and Lead the Free World, Western Civilization, continues.",
    "+++++\nOn a related note, the Russians have recently driven thousands of Ukrainians out of Mariupol into Russia under false pretences and confiscated their papers.",
    "We're not paywalling off SteynOnline or any of that nonsense - and in fact this site now offers more free content than ever before in our nineteen-year history.",
    "I've always assumed that the reason for religions is that people look around and wonder \"Where did all this -- the earth, life, the universe -- come from?\"",
    "No part of this website or any of its contents may be reproduced, copied, modified or adapted, without the prior written consent of Mark Steyn Enterprises.",
    "On March 25, 2022 at 6:27 pm, George Pereira wrote:\nMark,\nSo *resident Brandon (spits on the ground) is ready to order the 82nd Airborne into Ukraine.",
    "On March 25, 2022 at 6:48 pm, FHB in Montana wrote:\nWhat do you make of Donald Trump suing everyone and their sister about the fake Russia stuff.",
    "I'm a physicist who's an atheist, but -- like Murray -- not the kind of atheist who's hostile to religion and eager to recruit others to atheism.",
    "On March 25, 2022 at 6:08 pm, Sal Tessio wrote:\nFJB has gone full FBO and promised US retaliation if Poutine uses chemical weapons in Ukraine.",
    "And, if you disagree with my response, then let rip in the comments, and I'll endeavour to address a couple of the objections as we go along.",
    "As for Ginni Thomas, she is terrific company, and I'm always delighted to see her on the increasingly rare occasions I venture out and about.",
    "The U.S. taxpayer contributes something like $10 billion per year to that choked, overflowing toilet and we get nothing but grief in return.",
    "Perhaps this would be too personal for you to indulge, but it would surely be interesting to hear about your religious journey and status.",
    "To listen to the livestream, simply click the \"play\" icon on the audio player (in certain browsers, the audio will start auto-playing).",
    "Is this an attention-grabbing exercise or is there some strategic value in pretending there is still justice to be found in America?",
    "On March 25, 2022 at 7:10 pm, Jim Jordan wrote:\nCan you be alienated from the House of Windsor and still be a patriotic Englishman?",
    "On March 25, 2022 at 6:52 pm, George Prescott wrote:\nDo you think that Justin Trudeau felt humiliated at the European parliament?",
    "Meanwhile, on the home front FJB forces chemicals (the woojab) on our own military and separates (fires) those who do not comply.",
    "With China and Russia making moves, it looks like the US dollar's run as the world's reserve currency maybe coming to an end.",
    "I'd be interested in hearing if there are any adults in the room in Canada that you may know of, calling for better policies.",
    "In light of the fact that a fair and lawful election might not ever be possible again (good luck with those midterms, GOP!)",
    "Sounds like a \"gaffe\" except the 82nd Airborne has been slowly and quietly moving into Poland over the last several weeks.",
    "If you're a member of The Mark Steyn Club and you take issue with this article, then have at it in our comments section.",
    "Typically, it is 12 people on a petit jury, but each jurisdiction can set its own rules for both grand and petit juries.",
    "I hate to mention the name but Mark Levin recently talked about the 'Putin wing' of the GOP and the need to defeat it.",
    "Do you see anyone who might emerge and take the role of standing up, standing for, all that we cherish and hold dear?",
    "We'll be going live in about fifteen minutes, so do get ready to fire off your questions via the comment form below.",
    "I know it hasn't panned out for Quebec, but along the lines of an independent, autonomous region within a country.",
    "By the way, is Putin still laughing his socks off or is he about to suffer a very personal type of cancellation?",
    "At the same time, I have no great yearning over the matter: I'm confident I'll never know, and I'm OK with that.",
    "And/or delight us on a cruise ( see he has concerts with Randy but nothing in Montreal or Ottawa so far, sigh).",
    "Is there any chance in the next couple of generations that the U.S. will withdraw its membership in the U.N.?",
    "Who will want to return to Ukraine and what will come of the 100,000 Ukrainians being deported to the US?",
    "On March 25, 2022 at 7:15 pm, Nicola Timmerman wrote:\nIs Tal Bachman going to do some more deep essays?",
    "But I'll say this: Ukraine will run a clean presidential election long before the United States does.",
    "And I'm inclined to share your view that religion is critical for preserving a livable civilization.",
    "Anyone who cares about trans-people would tell them to learn to love the bodies they were born with.",
    "We'll try to pin down the rest of the time zones below, but do, as they say, check local listings.",
    "On March 25, 2022 at 6:32 pm, Robert Bridges wrote:\nUkraine...from breadbasket to basket case.",
    "I remember that episode vividly -- your remarks were on point then and remain so to this day.",
    "It's definitely freer in Ukraine being under the run from the Red Army than here in Toronto.",
    "In your January 22 Q&A, you implied that you have regrets that Douglas Murray is an atheist.",
    "Ah, but they were all busy lining up their post-Trump book deals and telly-commentator gigs.",
    "What do our politics look like if the dollar goes the way of Weimar Germany's Deutsche mark?",
    "This after FJB apparently arriving in Europe and walking down the steps of AF1 in his socks.",
    "Do you think this is to increase the number of \"Russians\" as an alternative to procreation?",
    "in a wheelchair, and it got me thinking about when exactly it was that the USA became evil.",
    "You know, just like his boss (past and current) did with regard to Bashar Assad in Syria.",
    "Or perhaps you think I'm thinking about it wrong ... and could somehow become a believer.",
    "It's Friday, and that means another edition of our Clubland Q&A live around the planet.",
    "How long will Russian parents tolerate such losses measured in the tens of thousands?",
    "And for many/most people, \"God,\" or similar, apparently works as a satisfying answer.",
    "Just how stupid of a people have we become if we actually believe this to be true?",
    "To me, such an answer just kicks the mystery of existence further down the road.",
    "On March 25, 2022 at 7:15 pm, Elisa Angel wrote:\nIt depends on the jurisdiction.",
    "receive the latest by email: subscribe to steynonline's free weekly mailing list",
    "Regretfully, we are without leadership in America at this pivotal, crucial time.",
    "He could speak in a higher pitch or \"more girly\", but he will never be a woman.",
    "The acceptance of corruption as a fact of life shames this so-called republic.",
    "If you missed the live broadcast, the action replay can be heard in full here.",
    "But, whatever hour it is where you are, we do hope you'll be able to join us.",
    "So see you back here live this afternoon at 6pm North American Eastern Time.",
    "Perhaps I'm wrong about fundamental motive ('Where did it all come from?')?",
    "Do you think any European country would swap their leader for Biden?",
    "I can actually envy such people while being puzzled that it works.",
    "Or might the US border opening up completely bring our redemption.",
    "Thomas added in the message that Meadows should \"Listen to Rush.",
    "DC typically follows the federal rules on both types of juries.",
    "Clubland Q&A is a special production for The Mark Steyn Club.",
    "© 2022 Mark Steyn Enterprises (US) Inc. All rights reserved.",
    "On March 25, 2022 at 6:59 pm, Paul Nachman wrote:\nHi, Mark.",
    "Those Eastern European speakers really cleaned his clock.",
    "And to pose a question simply use the comment form below.",
    "The man engenders confidence (not) every step of the way!",
    "Has the NDP-Liberal coalition cemented our imprisonment?",
    "If so, what trade might be a net plus for the U.S.?",
    "He will always be a man playing at being a woman.",
    "He will never know what it is like to be a woman.",
    "And to listen simply click the livestream feed.",
    "FDR and the rise of the administrative state?",
    "We are in need of another Winston Churchill!",
    "Their lives would be healthier and happier.",
    "By the Way, What about Steyn and Snerdly?",
    "How long do you think this can last?",
    "We're live now, so let's have at it!",
    "When Wilson was elected president?",
    "Thank you for all your questions.",
    "So I'm requesting your critique.",
    "See you at the top of the hour.",
    "Why can't we defund the U.N.?",
    "she added that same day.",
    "Who will FJB call in?",
    "What was the date?",
    "Somewhat ironic.",
    "Something else?",
    "Two points:\n1.",
    "Roe v. Wade?",
    "The ChiComs?",
    "UPPERDATE!",
    "UPDATE!",
    "Thanks.",
    "Period.",
    "2."
  ]
}