{
  "id": 9597,
  "mediaId": 2631,
  "date": "2022-03-25",
  "headline": "Ginni Thomas pressed for GOP lawmakers to protest 2020 election results",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220325-ginni-thomas-mjf-1657-09e925.jpg",
  "link": "https://www.nbcnews.com/politics/congress/ginni-thomas-pressed-gop-lawmakers-protest-2020-election-results-rcna21644",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "We need answers.”\n“At the bare minimum, Justice Thomas needs to recuse himself from any case related to the January 6th investigation,” Sen. Ron Wyden, D-Ore., said, “and should Donald Trump run again, any case related to the 2024 election.”\nIn a recent interview with the Washington Free Beacon, Ginni Thomas said she and her husband “share many of the same ideals, principles, and aspirations for America” but have “our own separate careers, and our own ideas and opinions too.”\n“Clarence doesn’t discuss his work with me, and I don’t involve him in my work,” she said.",
    "And her involvement in pressuring and advising leaders in both the executive branch and legislative branch on efforts to overturn the presidential election are raising significant ethical questions about whether her political activism has created a conflict of interest for her husband, Justice Clarence Thomas, who may have to decide additional cases relating to the special House investigation into the Jan. 6 attack.",
    "But we have not made a determination whether or not that information makes her a target of the committee.”\nThe email exchange suggests Thomas was pressuring Republicans in Congress to get more aggressive in fighting for Trump at a key moment when the lame-duck president and his inner circle were devising a strategy to overturn the results of the 2020 election and keep him in power.",
    "WASHINGTON — Shortly after the 2020 election, Virginia \"Ginni\" Thomas, the conservative activist and wife of Supreme Court Justice Clarence Thomas, sent an email to an aide to a prominent House conservative saying she would have nothing to do with his group until his members go “out in the streets,” a congressional source familiar with the exchange told NBC News.",
    "Just days later, Gohmert appeared at a “Million MAGA March” near the White House and told Trump supporters, “This was a cheated election, and we can’t let it stand.” He talked about “revolution.”\nIt’s unclear how many other GOP congressional offices Thomas was emailing, texting or calling during the period between Election Day and Jan. 6.",
    "In one text to Meadows on Nov. 10, three days after networks had projected that Biden was the winner, Thomas railed at congressional Republicans, saying she wished more of them were lining up behind Trump and “out in street rallies” with his grassroots supporters who were furious about the election, the two news outlets reported.",
    "“House and Senate guys are pathetic too... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy,” Thomas texted Meadows, apparently referencing a quartet of Freedom Caucus members: Reps. Louie Gohmert, R-Texas; Jim Jordan, R-Ohio; Paul Gosar, R-Ariz.; and Chip Roy, R-Texas.",
    "Just hours after the Jan. 6 attack, Banks, who is in his second and final year as RSC chairman, objected to the certification of Electoral College votes from both Arizona and Pennsylvania, arguing that some governors and local officials changed the rules of the election due to the pandemic.",
    "Thomas told an aide to incoming Republican Study Committee Chairman Jim Banks, R-Ind., that she was more aligned with the far-right House Freedom Caucus, whose leaders just two months later would lead the fight in Congress to overturn the results of Democrat Joe Biden’s victory.",
    "NBC News has not independently reviewed the email exchange, but sources said it made no specific references to GOP efforts to overturn the election or block the certification of the Electoral College ballots in Congress on Jan. 6, 2021.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nThe Post and CBS also reported on a Nov. 14 text showing that Thomas sent to Meadows material from Connie Hair, Gohmert’s chief of staff.",
    "On Thursday, The Washington Post and CBS News reported that Thomas had repeatedly pressed Trump’s last chief of staff, Mark Meadows, to aggressively pursue an effort to overturn the presidential election.",
    "Thomas wrote to the aide that Freedom Caucus members were tougher than RSC members, were in the fight and had then-President Donald Trump’s back, according to the source familiar with the email contents.",
    "“Justice Thomas was the sole member of the Supreme Court who would have allowed records from Trump, Meadows, et al to be withheld from House Jan 6 Committee,” Sen. Tim Kaine, D-Va., tweeted Friday.",
    "The text message seemed to reference Hair’s belief that “the most important thing you can realize right now is that there are no rules in war.”\n“This war is psychological.",
    "In January, the Supreme Court rejected Trump’s argument that executive privilege prevented the Jan. 6 panel from accessing a trove of records from the Trump White House.",
    "But when Thomas portrayed the RSC as soft in its support for Trump and told its members to take to the streets, the aide thanked her for her suggestions and moved on.",
    "Still, Banks found himself in the headlines last year after House Speaker Nancy Pelosi, D-Calif., blocked both Banks and Jordan from serving on the Jan. 6 committee.",
    "Jan. 6 committee members are now debating whether to invite Thomas to speak to the panel or to issue a subpoena for her records, according to reporting by CBS News.",
    "The RSC was long representative of the most conservative House members, but in the past several years, it has been replaced by the tea party-driven Freedom Caucus.",
    "Her November 2020 email came in response to a request from the RSC to offer policy recommendations as Banks was set to take the helm of the group in early 2021.",
    "Until she saw RSC members “out in the streets” and in the fight, she said, she would not help the RSC, the largest caucus of conservatives on Capitol Hill.",
    "The speaker rejected Banks over a statement he made that the special panel should be used to probe violent riots that occurred across the country in 2020.",
    "Republicans boycotted the Jan. 6 committee, prompting Pelosi to appoint two GOP critics of Trump: Reps. Liz Cheney, R-Wyo., and Adam Kinzinger, R-Ill.",
    "He has said Biden is the president and has not echoed Trump in talking about unsubstantiated allegations of widespread voter fraud in the election.",
    "Thomas was the only justice who indicated the court should grant Trump’s motion to block the National Archives from handing over the material.",
    "“We have a list of people that we’re looking at who helped finance or organize” the Jan. 6 rally, one committee member told NBC News.",
    "Thomas said she attended the Jan. 6 “Stop the Steal” rally near the White House that preceded the deadly riot at the U.S. Capitol.",
    "But until now, the committee has been reluctant to go down the path of investigating the wife of a sitting Supreme Court justice.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "“My understanding is on the broader list, she is there.",
    "Thomas did not respond to a request for comment.",
    "Banks declined to comment for this article.",
    "The pair exchanged nearly 30 text messages.",
    "“He did not explain his reasoning.",
    "PSYOP,” Thomas texted."
  ]
}