{
  "id": 9679,
  "mediaId": 2626,
  "date": "2022-03-29",
  "headline": "Rep. Jordan: Hunter’s Laptop Is Real - ‘Fake News’ Pushed ‘Total Garbage’",
  "image": "https://cdn.mrctv.org/files/styles/large/s3/2022-03/Screen%20Shot%202022-03-29%20at%203.21.28%20PM.png?itok=lzwlB5aR",
  "link": "https://www.mrctv.org/blog/rep-jordan-hunters-laptop-real-fake-news-pushed-total-garbage",
  "mediaOutlet": "mrctv.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Scheiner",
  "authorUrl": "https://www.mrctv.org/author/eric-scheiner",
  "termIds": [
    2119,
    3858,
    1339,
    1126,
    514,
    392,
    6569
  ],
  "sentences": [
    "On Monday, Jordan told Fox News:\nThe big take away for most Americans is, is we kind of all knew this a year and a half ago but the mainstream press along with big tech and Democrats all colluded to keep this important information from the American people just days before our most important election, the presidential election.",
    "That’s when any of the corrupt network newscasts last uttered the words “Hunter Biden.” Scandal after scandal, nothing seems to shake the determination of the ABC, CBS, and NBC morning and evening news shows to keep the public from knowing about the President’s wayward son and his sketchy financial and foreign dealings.",
    "We’ll see what the justice department does, but certainly this is something that needs to be looked into and we deserve to know -- we deserved to be able to have that story being out there for the American people to digest and understand when it really mattered before we decided to our next president was going to be.",
    "This network silence continued as The New York Times belatedly — but still shockingly — confirmed on March 16, 2022 that Hunter Biden’s laptop is real and not an example of Russian disinformation.",
    "According to Rep. Jim Jordan (R-Ohio) the only thing fake about Hunter Biden’s laptop is that “fake news” that claimed that it was full of Russian disinformation.",
    "The laptop was real, the eyewitness Tony Bobulinski was a real person, the e-mails in fact, were real evidence, real documents.",
    "The only thing fake was the news and the 51 former intel people who said this was somehow Russian disinformation.",
    "@kayleighmcenany pic.twitter.com/AhtfbOWvyr\n— MRCTV (@mrctv) March 29, 2022",
    "260 days since the leftist TV networks have mentioned \"Hunter Biden.\"",
    "It has now been 260 days — 37 weeks — since July 12, 2021.",
    "So, I think that’s the big take away.",
    "That was complete garbage."
  ]
}