{
  "id": 9704,
  "mediaId": 2663,
  "date": "2022-03-22",
  "headline": "Jim Jordan’s dumb tweet about SCOTUS hearings backfires spectacularly",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/03/jim-jordan-gma-670x469-1.webp?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/jim-jordans-dumb-tweet-scotus-hearings-backfires-spectacularly-20220322",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Tracer",
  "authorUrl": "https://www.queerty.com/author/dan-tracer",
  "termIds": [
    2119,
    3384,
    2887,
    2697,
    2765,
    5699,
    1269,
    1394
  ],
  "sentences": [
    "Weighing in on the Senate confirmation hearings for Supreme Court nominee Ketanji Brown Jackson, the homophobic lawmaker tweeted: “Don’t forget what Democrats did to Brett Kavanaugh.”\nKavanaugh faced questions in 2018 about accusations of sexual assault from his high school and college years, which he heatedly denied.",
    "(@taradublinrocks) March 21, 2022\nJim Jordan accused of ‘begging’ former Ohio State wrestler not to support reports of sexual abuse https://t.co/XJK8Pf0Uld\n— Shar G (@hapkidogal) March 21, 2022\nWhich ironically is one way to forget what you did at Ohio State.",
    "https://t.co/Uf4Rho2aLd\n— Libertarian Party OH (@LPOhio) March 22, 2022\nHe cried and said he loved beer\n“Jim Jordan called me crying, groveling, begging me to go against my brother, begging me, crying for a half-hour,” DiSabato said Wednesday.",
    "— Jack Cocchiarella (@JDCocchiarella) March 22, 2022\nOthers opted not to “forget” about Jordan’s time as assistant wrestling coach at Ohio State University, when he was accused of ignoring molestation claims about the team doctor.",
    "https://t.co/TpmvgEYTJ1\n— PoliticOhMyGawd (@PoliticOhMyGawd) March 21, 2022\nWe won’t forget you lied about your phone calls w/Trump on Jan. 6th when MAGA terrorists assaulted Capitol.",
    "JimBro can’t remember how many times he spoke with the President during an insurrection, but can somehow remember every moment from a multi day confirmation hearing.",
    "Rep. Jim Jordan took to Twitter Monday to urge people to remember the past, prompting scores of replies about things he likely hopes they forget.",
    "But commenters seemed less concerned about Kavanaugh being questioned about his alleged assaults than they were with Jordan’s own sketchy past.",
    "Specifically, his ever-shifting story about whether or not he communicated with former President Donald Trump during the Jan. 6 insurrection.",
    "https://t.co/WEIsuId1lO\n— Charles Campisi (@1813Doncarlo) March 21, 2022\nHey Jim Jordan, Liz Cheney has your text messages.",
    "George Clooney certainly hasn’t forgotten, Gym Jordan pic.twitter.com/Qry9SVCKhL\n— Tara Dublin ??????",
    "(@jenresisted) March 21, 2022\nJim Jordan upset about someone being held accountable for sexual abuse?",
    "(@LanceUSA70) March 21, 2022\nDon’t forget what Coach Strauss did to wrestlers at Ohio State.",
    "We won’t forget you voted twice to acquit Trump of abuse of office & contempt of Congress.",
    "“That’s the kind of cover-up that’s going on there.” https://t.co/fje0CtU2go\n— LC ??",
    "We won’t forget you voted to decertify Electoral Votes to overturn 2020 election.",
    "(@AZDem_w_Dogs) March 22, 2022\nDon’t forget what Gym Jordan did to his students.",
    "https://t.co/UgaJovVqbk\n— Joe Katz (@joekatz45) March 22, 2022",
    "Don’t forget what Jim Jordan did to hundreds of OSU athletes.",
    "He was confirmed to the Supreme Court in a 50-48 vote.",
    "https://t.co/zapWGDbnxL\n— Jen Henry ??????????????",
    "You should be very worried right now.",
    "pic.twitter.com/026g6he4nr\n— ?????",
    "At least he’s consistent.",
    "Ok then.",
    "??????",
    "??"
  ]
}