{
  "id": 9725,
  "mediaId": 2646,
  "date": "2022-03-28",
  "headline": "FOREIGN INFLUENCE: Convicted GOP Nebraska congressman’s donor tied to terrorist group",
  "image": "https://occupydemocrats.com/wp-content/uploads/Gilbert-Chagoury-and-Jeff-Fortenberry.jpg",
  "link": "https://occupydemocrats.com/2022/03/28/foreign-influence-convicted-gop-nebraska-congressmans-donor-tied-to-terrorist-group/",
  "mediaOutlet": "occupydemocrats.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ty Ross",
  "authorUrl": "https://occupydemocrats.com/author/tyross/",
  "termIds": [
    2083,
    4066,
    4049,
    3246,
    3279,
    1477,
    1126,
    6428
  ],
  "sentences": [
    "He sponsored an art exhibit at the George W. Bush Presidential Center, and Politico reported that Chagoury donated a total of $100,000 to Mitt Romney’s presidential campaign in 2012 and $30,000 to Representative Darrel Issa (R-CA) in 2014, and another $10,000 to former Representative Lee Terry (R-NE), like Fortenberry, also from Nebraska.",
    "Representing the state of Nebraska since 2005, Fortenberry has announced his resignation amid bi-partisan calls from both Speaker of the House Nancy Pelosi (D-CA) and House Minority Leader Kevin McCarthy (R-CA) to step down after being convicted by a California jury of lying to the FBI.",
    "There’s at least one Republican who has spoken up in support: none other than the jacketless GOP Congressman Jim Jordan (R-OH), who in his not-so-eloquently way of speaking has said “I haven’t seen it, but Fortenberry sounds like he got set up.”\nWell, there you have it.",
    "In October 2021, Fortenberry was indicted for statements he made during an investigation into contributions to his 2016 political campaign by a foreign national, Nigerian-born billionaire Gilbert Chagoury.",
    "An ongoing investigation into Chagoury ended with the billionaire admitting to using conduits to make political contributions to Republicans between 2012 and 2016 and paying a $1.8 million fine.",
    "Nebraska has its sights set on young blood, with Nebraska’s Republican Governor Pete Ricketts throwing his support behind Fortenberry’s party rival, Mike Flood, and urging Fortenberry to resign.",
    "His conviction, however, has made it difficult for his party to stand behind him, and, if forced to remove him by a 2/3rds vote, he would be the sixth member in U.S. history to be expelled.",
    "I hope Jeff Fortenberry will do the right thing and resign so his constituents have that certainty while he focuses on his family and other affairs,” Governor Ricketts said.",
    "Sponsored Links\nChagoury’s attempts to infiltrate the American political scene monetarily have been going on for over a decade, focusing primarily on GOP politicians.",
    "In 2010, he was removed from an airplane in New Jersey and questioned by the Department of Homeland Security after being placed on the no-fly list.",
    "Chagoury has also been suspected of being a backer of authoritarian rule in Lebanon and having financial ties to the terrorist group Hezbollah.",
    "Sponsored Links\nThe over $30,000 donated to Fortenberry was, however, significant enough to warrant further investigation and questioning.",
    "It was a drop in the bucket for the man considered to be one of Africa’s richest men and the owner of a $135 million Beverly Hills home.",
    "Whether he wins that appeal or not is still uncertain, but it’s apparent that the bulk of the party would like to move on…without him.",
    "While facing a sentence of up to 15 years — 5 years maximum for each charge — Fortenberry isn’t barred from serving out his term.",
    "GOP representatives Scott Perry (R-PA) and Chris Smith (R-NJ) were also involved in the investigation, but have not been charged.",
    "You can read more about the Nigerian billionaire behind Fortenberry’s ordeal on the Department of Justice website here.",
    "Chagoury’s donations could be seen as more of an “investment.” He has been the subject of investigations in the past.",
    "If you’re not familiar with the name, Corallo would later go on to be the spokesperson for Donald Trump’s legal team.",
    "Advertisement Above\nWhen it comes to the GOP, there is no shortage of criming, and today is no different.",
    "The two associates he used as middlemen, Joseph Arsan and Toufic Joseph Baaklini, made similar deals.",
    "Fortenberry has announced his last day in office will be March 31st, and that he intends to appeal.",
    "Fortenberry has proclaimed his innocence, denying knowledge of the donation or where it came from.",
    "His organization — In Defense of Christians — hired Mark Corallo to lobby for it in Washington.",
    "The latest to fall from political grace is none other than Congressman Jeff Fortenberry (R-NE).",
    "“The people of Nebraska’s First Congressional District deserve active, certain representation.",
    "Sponsored Links\nFortenberry wasn’t the only one to receive illegal contributions.",
    "admitting their role, knowingly and complicity skirting campaign finance laws.",
    "His motivation for building political allies is based on a pro-Lebanon agenda.",
    "Add your name to call on prosecutors to ARREST DONALD TRUMP for his crimes!",
    "In 2015, he was denied a visa and entry to the United States.",
    "Corallo also sits on the board of In Defense of Christians.",
    "Though born in Nigeria, Chagoury is of Lebanese descent.",
    "Arsan paid a fine of $1.7 million.",
    "But all support is not lost.",
    "Baaklini, $90,000.",
    "Advertisements",
    "Case closed."
  ]
}