{
  "id": 9732,
  "mediaId": 2745,
  "date": "2022-03-30",
  "headline": "It seems pretty unlikely Trump doesn’t know what a burner phone is",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BUJVXRRGXYI6XHCKBXDCILCICQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/30/trump-burner-phone-incidents/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "We learned Tuesday that the White House’s records of President Donald Trump’s phone calls and actions on Jan. 6, 2021, contain a large, conspicuous and thoroughly convenient gap: For more than 7½ hours as the insurrection at the U.S. Capitol was taking place and afterward, there are no records of his phone calls, although records show Trump working the phones extensively both before and after the gap.",
    "“It is unclear how often Trump’s call-capable phones, which are essentially used as burner phones, are swapped out.”\nThe Senate’s bipartisan 2020 Russia report found that former Trump campaign chairman Paul Manafort had used a burner phone after he was indicted, to communicate with a man the report identified as a Russian intelligence officer.",
    "Trump’s lawsuit invoked that fact to suggest the two parties knew they were engaged in something illegal:\nAll the while, the parties knew full well that their actions were wrongful, as evidenced by their insistence on communicating through “burner” phones …\nTrump, of course, did not draft the lawsuit himself.",
    "Trump denied it, saying, “I only use Government Phones, and have only one seldom used government cellphone.”\nEarlier that year, a report from Politico stated flat-out that Trump used what were, in effect, burner phones.",
    "Even before this latest news, some reporting indicated that at least some individuals involved in the Jan. 6 rally had used burner phones to communicate with the White House and members of the Trump family.",
    "Even before reports emerged, in March 2016, that the terrorists had probably used these devices, Trump referred to the Paris attacks by way of expressing his acute interest in the security of his phones.",
    "You know, every time I pick up a phone, I assume people are listening to my conversations.”\nContrary to his assurances that he takes information security seriously, Trump’s record suggests otherwise.",
    "This has led to questions about whether he might have used a “burner” phone — a temporary, disposable phone that is difficult to trace — and the Jan. 6 committee is investigating that possibility.",
    "We know there are other calls that weren’t in the White House logs, including with Vice President Mike Pence, Rep. Jim Jordan (R-Ohio), House Minority Leader Kevin McCarthy (R-Calif.) and Sens.",
    "Not only did he not use a burner, but “I have no idea what a burner phone is,” Trump said, adding that “to the best of my knowledge I have never even heard the term.”\nThis seems … unlikely.",
    "One of Trump’s favorite campaign rally lines, in 2016 and beyond, was to attack Hillary Clinton over an aide destroying her cellphones (though such actions are not necessarily nefarious).",
    "Factbase’s record of Trump’s public comments dating back decades includes no mentions of “burner phones,” “disposable phones” or, apparently, any other way to refer to such devices.",
    "“It’s this attitude of arrogance that explains why Hillary Clinton made 13 phones disappear, including with a hammer,” Trump said in September 2016, “so the FBI couldn’t see them.”",
    "But he has accused her of violating a nondisclosure agreement, meaning her communications with the Times — and potentially the methods she used — appear to be of interest to him.",
    "She stated in her 2020 book that a New York Times reporter had given her a burner phone as she provided documents for that paper’s exposé on the former president’s tax records.",
    "The phones involved weren’t burners, per se — but you would think that someone so keenly interested in his rivals’ information security might have happened across the concept.",
    "In 2018, the New York Times reported that Trump had in fact continued to use cellphones that weren’t so secure and invited foreign adversaries to monitor his calls.",
    "It’s also possible the gap in phone records stems from something other than the use of a burner — up to and including a willful effort to not record the calls.",
    "What is pretty certain, though, is that if there’s one person who would argue that obscuring phone communications from investigators implies guilt, it’s Trump.",
    "But the concept of burner phones has featured repeatedly in major news stories in the Trump political era — including some involving Trump himself.",
    "When we found out special counsel Robert S. Mueller III’s investigators had data wiped from their phones, Trump again was on the case.",
    "And he has seldom weighed in on his niece’s actions, meaning he doesn’t appear to have personally addressed her use of a burner phone.",
    "Burner phones were also big news during Trump’s presidential run, in the wake of the 2015 attacks on the Bataclan theater in Paris.",
    "And not just because former Trump national security adviser John Bolton says Trump knows better and has used the term before.",
    "“The president has gone as long as five months without having the phone checked by security experts,” the report said.",
    "But these incidents do suggest that it would be pretty surprising if he didn’t come across the concept at some point.",
    "Most recently, burner phones came up repeatedly in Trump’s lawsuit against his niece, Mary Trump, last year.",
    "“I’ve been there from the beginning; I’ve been there from before the Paris attack,” Trump said in 2015.",
    "“You know, after every attack everybody says exactly this, but I err on the side of the security.",
    "Their phone records could shed light on where their calls from Trump originated.",
    "The good news is that the Jan. 6 committee might be able to nail this down.",
    "It’s true that Trump doesn’t appear to have used this term in public.",
    "And he has frequently weighed in on the traceability of phones.",
    "And Bolton says Trump is, in fact, well familiar with it.",
    "None of this proves Trump knows what a burner phone is.",
    "Mike Lee (R-Utah) and Tommy Tuberville (R-Ala.).",
    "To which Trump offered a rather broad denial.",
    "I err on the side of security.",
    "Trump later pardoned Manafort."
  ]
}