{
  "id": 9781,
  "mediaId": 8484,
  "date": "2022-03-24",
  "headline": "Clarence Thomas' wife Ginni 'urged Trump's chief of staff Mark Meadows to overturn the election' and wanted Sidney Powell to be the face of the legal team, series of text messages sent between the election and January 6 show",
  "image": "https://i.dailymail.co.uk/1s/2022/03/24/23/55772291-0-image-a-54_1648163944220.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10649881/Clarence-Thomas-wife-urged-Trumps-chief-staff-Mark-Meadows-overturn-election-texts.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "whatdoesitmean.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Elkind",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Elizabeth+Elkind,+Politics+Reporter+For+Dailymail.Com",
  "termIds": [
    0
  ],
  "sentences": [
    "+5\nView gallery\n+5\nView gallery\nVirginia 'Ginni' Thomas echoed QAnon conspiracy theories and tore into GOP lawmakers who did not support Trump's efforts to overturn the 2020 election in at least 29 text messages to former White House Chief of Staff Mark Meadows, a new report reveals\nPowell had been one of the first lawyers on the forefront of promoting Trump's election fraud theories.",
    "She also said: 'Biden crime family & ballot fraud co-conspirators (elected officials, bureaucrats, social media censorship mongers, fake stream media reporters, etc) are being arrested & detained for ballot fraud right now & over coming days, & will be living in barges off GITMO to face military tribunals for sedition.'",
    "But the Thursday messages indicate that the Supreme Court justice spouse's beliefs went further than the traditional realms of right-wing politics and that she's even promoted the work of a Sandy Hook shooting denier to the upper echelons of the White House.",
    "Conservative activist Virginia 'Ginni' Thomas urged Donald Trump's former aide to make controversial lawyer Sidney Powell the face of the ex-president's legal defense and appeared to frequently promote QAnon beliefs in texts obtained by the Washington Post.",
    "+5\nView gallery\nThomas' conservative activism has at times earned ethical scrutiny for her husband, Supreme Court Justice Clarence Thomas\nThomas then appeared to push a QAnon theory that Trump had somehow added watermarks to mail-in ballots to track fraud.",
    "She also took aim at Republican lawmakers who refused to support Trump, as evidenced by a message seemingly referencing GOP Reps. Louie Gohmert of Texas, Jim Jordan of Ohio, Paul A. Gosar of Arizona and Chip Roy of Texas.",
    "+5\nView gallery\nIt was revealed earlier this month that Virginia Thomas was present at Donald Trump's Stop the Steal rally outside of the White House on January 6, 2021 -- hours before the Capitol riot.",
    "The wife of Supreme Court Justice Clarence Thomas pushed 2020 election fraud conspiracy theories in dozens of text messages with ex-White House Chief of Staff Mark Meadows, reports revealed on Thursday.",
    "Two days after the November election, Thomas reportedly sent Meadows a YouTube video titled 'TRUMP STING w CIA Director Steve Pieczenik, The Biggest Election Story in History, QFS-BLOCKCHAIN.'",
    "Thomas has long played a role in conservative politics, having had a hand in scouting people for potential roles in George W. Bush's administration when she worked at the Heritage Foundation.",
    "Thomas' outspoken activism has more than once turned ethical scrutiny on her husband, Clarence Thomas, known by many legal experts as the most conservative member of the Supreme Court.",
    "In a November 24 message, Meadows apparently uses a Biblical reference of a battle between 'good versus evil' to describe Trump's battle to overturn Biden's electoral victory.",
    "'House and Senate guys are pathetic too... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy,' Thomas allegedly wrote.",
    "Before joining the Trump White House, Meadows was a Republican House representative from North Carolina and a founding member of the conservative House Freedom Caucus.",
    "The texts suggest Thomas even had a hand in crafting Powell's message -- and that she pushed that message to more members of the Trump White House than just Meadows.",
    "'Watermarked ballots in over 12 states have been part of a huge Trump & military white hat sting operation in 12 key battleground states,' Thomas wrote to Meadows.",
    "Sidney Powell & improved coordination now will help the cavalry come and Fraud exposed and America saved,' Thomas reportedly wrote to Meadows on November 13.",
    "At the time her husband, Clarence Thomas, was presiding over the landmark Bush v. Gore case that would see the contested 2000 election won by the Republican.",
    "The 29 messages are reportedly part of the vast tranche of documents Meadows handed over to the House select committee investigating the Capitol attack.",
    "Pieczenik is a former State Department official who said the 2012 slaughter of 26 people including 20 young children in Connecticut was a 'false flag.'",
    "However her wild claims and insistence on repeating them made her a polarizing figure that even led ex-Trump lawyer Rudy Giuliani to distance himself.",
    "The next message reportedly urged Meadows to listen to the opinions of conservative talk radio hosts Dan Bongino, Rush Limbaugh and Mark Steyn.",
    "'Release the Kraken' is a phrase that was popularized by Powell referring to the alleged uncovering of fraud in the 2020 presidential election.",
    "The high court said his 'infection' was not COVID-19-related, but so far no more has been revealed about the 73-year-old justice's condition.",
    "Release the Kraken and save us from the left taking America down,' a message Thomas supposedly sent to Meadows on November 19 reads.",
    "She asked Meadows to 'Help This Great President stand firm' on November 10 and mentioned 'the greatest Heist of our History.'",
    "'Jared' could potentially be referred to Jared Kushner, Trump's son-in-law and a senior adviser in his administration.",
    "It was revealed earlier this month that Thomas had attended Trump's Stop The Steal rally on January 6 last year.",
    "However she told the Washington Free Beacon that she grew cold and left before the ex-president took the stage.",
    "After that Virginia Thomas reportedly got to coordinate a meeting between Trump and her allies in Washington.",
    "However she said she had left before Trump took the stage\nMeadows replied: 'I will stand firm.",
    "Clarence Thomas was hospitalized late last week, the Supreme Court announced on Sunday.",
    "The Thomases privately dined with the Trumps when they were still in the White House.",
    "This plus a conversation with my best friend just now… I will try to keep holding on.",
    "The Post's report notes that it's not clear who the 'best friend' Thomas mentions is.",
    "Thomas, apparently touched, told Meadows: 'Tearing up and praying for you guys!!!!!",
    "'I hope this is true; never heard anything like this before, or even a hint of it.",
    "Sounds like Sidney and her team are getting inundated with evidence of fraud.",
    "'Where the heck are all those who benefited by Presidents coattails?!!!'",
    "'Evil always looks like the victor until the King of Kings triumphs.",
    "It's commonly used among the far-right fringe of Trump supporters.",
    "It takes time for the army who is gathering for his back.'",
    "'Just forwarded to yr gmail an email I sent Jared this am.",
    "It was three days after Joe Biden was declared president.",
    "Well at least my time in DC on it,' Meadows wrote.",
    "On November 6, Thomas added: 'Do not concede.",
    "We will fight until there is no fight left.",
    "Our country is too precious to give up on.",
    "The pair are reportedly longtime friends.",
    "'Mark (don’t want to wake you) ...",
    "Do not grow weary in well doing.",
    "she wrote along with the video.",
    "I have staked my career on it.",
    "Thomas replied: 'Thank you!!",
    "she added that same day.",
    "So proud to know you!!'",
    "Thanks for all you do.'",
    "America is worth it!'",
    "The fight continues.",
    "Needed that!",
    "Possible???'",
    "Make a plan."
  ]
}