[
  {
    "id": 6740,
    "mediaId": 2590,
    "date": "2022-01-18",
    "sentence": "pic.twitter.com/xEokwlxLtZ\n— <span class='selected-term'>Warren Davidson</span> (@WarrenDavidson) January 17, 2022\n39.",
    "author": "Jennifer Bendery",
    "title": "They Rejected Democracy. They Lied. Now The GOP Is Hailing Martin Luther King's Legacy."
  },
  {
    "id": 3148,
    "mediaId": 2746,
    "date": "2022-03-14",
    "sentence": "The lawmakers that signed on as co-plaintiffs are: Sen. Rand Paul of Kentucky; Rep. Andy Biggs of Arizona; Rep. Dan Bishop of North Carolina; Rep. Lauren Boebert of Colorado; Rep. Andrew Clyde of Georgia; Rep. <span class='selected-term'>Warren Davidson</span> of Ohio; Rep. Bob Good of Virginia, Rep. Paul Gosar of Arizona;, Rep. Marjorie Taylor Greene of Georgia; Rep. Brian Mast of Florida; Rep. Alex Mooney of West Virginia; Rep. Barry Moore of Alabama; Rep. Ralph Norman of South Carolina, Rep. Bill Posey of Florida, Rep. Matt Rosendale of Montana, and Rep. Chip Roy of Texas.",
    "author": "Seth McLaughlin",
    "title": "Seventeen GOP lawmakers sue CDC over mask mandates on flights"
  },
  {
    "id": 2461,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "#DoNotComply https://twitter.com/MayorBowser/status/1480956796395216900\\u00a0\\u2026pic.twitter.com/pHeeNPVhlP\n— <span class='selected-term'>Warren Davidson</span> (@Warren Davidson) 1641984463\nHeimlich says, “I’m willing to follow Liz Cheney and Anthony Gonzalez, people like that who have stood up for what’s right.",
    "author": "Timothy Evans",
    "title": "His father helped save people from choking – now he is trying to save the GOP from Trump"
  },
  {
    "id": 441,
    "mediaId": 2641,
    "date": "2022-04-11",
    "sentence": "While Democrats are complaining Republicans are seeking to pass legislation to keep public schools from teaching sex education to elementary school kids, Rep. <span class='selected-term'>Warren Davidson</span>, R-Ohio, told Newsmax it is \"mind blowing\" such laws are even needed.",
    "author": "Eric Mack",
    "title": "Rep. Warren Davidson to Newsmax: Calls for K-3 Sex Ed 'Mind Blowing'"
  }
]