[
  {
    "id": 5203,
    "mediaId": 2641,
    "date": "2022-02-22",
    "sentence": "Therefore, we ask that your decisions comport with the Constitution and our nation's laws by consulting with Congress to receive authorization before any such development.”\nThe Hill reports that the letter was signed by Reps. Nancy Mace, R-S.C., Pramila Jayapal, D-Wash., Ilhan Omar, D-Minn., Matt Gaetz, R-Fla. and <span class='selected-term'>Warren Davidson</span>, R-Ohio, among others.",
    "author": "Jeremy Frankel",
    "title": "Biden Urged by Lawmakers To Consult Congress Before Sending Military to Ukraine"
  },
  {
    "id": 5225,
    "mediaId": 6676,
    "date": "2022-02-23",
    "sentence": "“Therefore, we ask that your decisions comport with the Constitution and our nation’s laws by consulting with Congress to receive authorization before any such development.”\nThe letter was signed by Reps. Nancy Mace (R-S.C.), Pramila Jayapal (D-Wash.), Ilhan Omar (D-Minn.), Matt Gaetz (R-Fla.) and <span class='selected-term'>Warren Davidson</span> (R-Ohio), among others.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "Lawmakers urge Biden to ask Congress before sending military to Ukraine"
  },
  {
    "id": 5168,
    "mediaId": 4010,
    "date": "2022-02-24",
    "sentence": "",
    "author": "Jack Detsch",
    "title": "Biden Administration Debates Legality of Arming Ukrainian Resistance"
  },
  {
    "id": 5126,
    "mediaId": 2546,
    "date": "2022-02-24",
    "sentence": "The day before, a bipartisan group of 43 representatives, led by Democrat Peter A. DeFazio of Oregon and Republican <span class='selected-term'>Warren Davidson</span> of Ohio, wrote to Biden to warn him that Congress must approve any military action against Russia.",
    "author": "Mark Satter",
    "title": "The consensus against using force holds, despite Russia’s invasion"
  },
  {
    "id": 3738,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "… Reps. <span class='selected-term'>Warren Davidson</span> (R-Ohio) and Trent Kelly (R-Miss.)",
    "author": "",
    "title": "POLITICO Playbook: Biden’s SOTU blues"
  },
  {
    "id": 1283,
    "mediaId": 2745,
    "date": "2022-04-06",
    "sentence": "President Trump and Secretary of State Pompeo made the case, but apparently, Putin finally convinced them->\n— <span class='selected-term'>Warren Davidson</span> (@WarrenDavidson) April 6, 2022\nOf these provisions, Davidson said, “America’s sovereignty is nonnegotiable.",
    "author": "",
    "title": "Why 30 percent of the House GOP voted against reaffirming NATO support"
  },
  {
    "id": 1427,
    "mediaId": 2528,
    "date": "2022-04-06",
    "sentence": "Seven Republicans — Reps. Tom Massie of Kentucky, Scott Perry of Pennsylvania, Marjorie Taylor Greene of Georgia, <span class='selected-term'>Warren Davidson</span> of Ohio, Liz Cheney of Wyoming, and Andy Biggs and Paul Gosar of Arizona — voted against the bill.",
    "author": "Taiyler Simone Mitchell",
    "title": "6 GOP House members opposed a bill meant to document and preserve evidence of war crimes during Russia's invasion of Ukraine"
  },
  {
    "id": 1561,
    "mediaId": 2746,
    "date": "2022-04-06",
    "sentence": "“So, this is a historic moment and I want to thank the Chairman, as always, for working with me to stand up against evil, because that’s exactly what this is.”\nThe seven House members who voted against the resolution were all Republicans: Reps. Andy Biggs and Paul Gosar of Arizona, Liz Cheney of Wyoming, <span class='selected-term'>Warren Davidson</span> of Ohio, Marjorie Taylor-Greene of Georgia, Thomas Massie of Kentucky, and Scott Perry of Pennsylvania.",
    "author": "Joseph Clark",
    "title": "House passes war-crimes legislation aimed at Putin"
  },
  {
    "id": 1563,
    "mediaId": 2621,
    "date": "2022-04-07",
    "sentence": "Greene and Massie were joined by Reps. Andy Biggs (R-AZ), Paul Gosar (R-AZ), <span class='selected-term'>Warren Davidson</span> (R-OH), and Scott Perry (R-PA) in voting against the Ukraine Invasion War Crimes Deterrence and Accountability Act on Wednesday.",
    "author": "Alex Griffing",
    "title": "Here Are The Only House Members to Vote Against Banning Russian Oil and a War Crimes Probe in Ukraine"
  },
  {
    "id": 1498,
    "mediaId": 2627,
    "date": "2022-04-07",
    "sentence": "The list, comprised entirely of Republicans, features some familiar names:\nAndy Biggs of Arizona\n<span class='selected-term'>Warren Davidson</span> of Ohio\nPaul Gosar of Arizona\nMarjorie Taylor Greene of Georgia\nThomas Massie of Kentucky\nScott Perry of Pennsylvania\nSince Russia’s invasion of Ukraine, there have been a series of House votes on measures related to the attack, each of which have been approved easily, despite opposition from the contingent that Rep. Liz Cheney labeled the GOP’s “Putin wing.”\nIt was about a month ago, for example, when the House voted overwhelmingly to ban oil imports from Russia.",
    "author": "Steve Benen",
    "title": "GOP’s ‘Putin wing’ takes a bizarre stand on war crimes resolution"
  },
  {
    "id": 1762,
    "mediaId": 2532,
    "date": "2022-04-07",
    "sentence": "Six Republicans, Reps. Andy Biggs of Arizona, <span class='selected-term'>Warren Davidson</span> of Ohio, Paul Gosar of Arizona, Marjorie Taylor Greene of Georgia, Thomas Massie of Kentucky and Scott Perry of Pennsylvania voted against the measure.",
    "author": "",
    "title": "Senate to vote on revoking Russia's trade status, oil ban"
  },
  {
    "id": 1741,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "The representatives who voted against the bill include: Marjorie Taylor Greene of Georgia, <span class='selected-term'>Warren Davidson</span> of Ohio, Thomas Massie of Kentucky, Scott Perry of Pennsylvania and Andy Biggs and Paul Gosar of Arizona.",
    "author": "Johanna Chisholm",
    "title": "Ex-Trump official calls six Republican lawmakers ‘Vlad’s cover up crew’ for Russia war crime vote"
  },
  {
    "id": 1770,
    "mediaId": 2752,
    "date": "2022-04-07",
    "sentence": "He called NATO “a relic of the Cold War” and asked, “Why should Americans pay for Europe’s defense?”\nBlake says GOP Rep. <span class='selected-term'>Warren Davidson</span>, who was also one of the six who voted against preserving evidence of war crimes, was a bit more \"nuanced.\"",
    "author": "Evan Hurst",
    "title": "How Are GOP Congressmen Appeasing Putin The Genociding Murderer Today?"
  },
  {
    "id": 1402,
    "mediaId": 6676,
    "date": "2022-04-07",
    "sentence": "GOP Reps. Andy Biggs (Ariz.), <span class='selected-term'>Warren Davidson</span> (Ohio), Paul Gosar (Ariz.), Marjorie Taylor Greene (Ga.), Thomas Massie (Ky.) and Scott Perry (Pa.) all opposed the bill.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "Here are the 6 Republicans who voted against investigating Russia for war crimes"
  },
  {
    "id": 1519,
    "mediaId": 2596,
    "date": "2022-04-07",
    "sentence": "Andy Biggs, <span class='selected-term'>Warren Davidson</span>, Paul Gosar, Marjorie Taylor Greene, Thomas Massie, and Scott Perry all voted 'no' on the bill which passed through the House on Wednesday.",
    "author": "",
    "title": "7 Republicans voted against Russian war crimes probe - but one says she did it by mistake"
  },
  {
    "id": 713,
    "mediaId": 2621,
    "date": "2022-04-13",
    "sentence": "Others who were not sanctioned are Andrew Barr (R-KY); Steny Hoyer (D-MD); James McGovern (D-MA); William Keating (D-MA); Chris Smith (R-NJ); Frank Pallone (D-NJ); Tom Malinowski (D-NJ); Albio Sires (D-NJ); Gregory Meeks (D-NY); Jerry Nadler (D-NY); Richard Hudson (R-NC); <span class='selected-term'>Warren Davidson</span> (R-OH); Marcy Kaptur (D-OH); Michael Turner (R-OH); Brian Fitzpatrick (R-PA); Joe Wilson (R-SC).",
    "author": "Kipp Jones",
    "title": "Here Are All House Members Russia Didn’t Sanction"
  }
]