[
  {
    "id": 6470,
    "mediaId": 2590,
    "date": "2022-01-12",
    "sentence": "Rep. <span class='selected-term'>Warren Davidson</span> (R-Ohio) on Wednesday joined the growing number of elected Republicans who have compared COVID-19 vaccine mandates to the horrors imposed on Jewish people by Nazis during the Holocaust.",
    "author": "Josephine Harvey",
    "title": "Yet Another GOP Lawmaker Compares Vaccine Mandates To The Holocaust"
  },
  {
    "id": 6870,
    "mediaId": 2658,
    "date": "2022-01-13",
    "sentence": "",
    "author": "",
    "title": "POLITICO Playbook: Biden and Manchin come face to face"
  },
  {
    "id": 6740,
    "mediaId": 2590,
    "date": "2022-01-18",
    "sentence": "pic.twitter.com/xEokwlxLtZ\n— <span class='selected-term'>Warren Davidson</span> (@WarrenDavidson) January 17, 2022\n39.",
    "author": "Jennifer Bendery",
    "title": "They Rejected Democracy. They Lied. Now The GOP Is Hailing Martin Luther King's Legacy."
  },
  {
    "id": 6645,
    "mediaId": 2602,
    "date": "2022-01-23",
    "sentence": "That same week, responding to a Twitter update from Washington mayor Muriel Bowser regarding COVID-19 requirements in the city, Ohio Congressman <span class='selected-term'>Warren Davidson</span> posted a photo of a Nazi-era health pass, saying \"This has been done before.\"",
    "author": "JERUSALEM POST STAFF",
    "title": "Robert Kennedy Jr: COVID-19 vaccine mandates worse than Holocaust"
  },
  {
    "id": 7048,
    "mediaId": 2629,
    "date": "2022-01-24",
    "sentence": "Last week, Ohio Rep. <span class='selected-term'>Warren Davidson</span> apologized for comparing a Washington, D.C., vaccination requirement for restaurants and bars to a \"Gesundheitspass,\" which is translated as \"health pass\" but was associated with Nazi \"racial hygiene\" theory.",
    "author": "Josh Israel",
    "title": "Why Can't Republican Politicians Control Their Anti-Semitic Tic?"
  },
  {
    "id": 7045,
    "mediaId": 2730,
    "date": "2022-01-26",
    "sentence": "Paul and Johnson, as well as Reps. Scott Perry (R-PA), <span class='selected-term'>Warren Davidson</span> (R-OH), Lauren Boebert (R-CO), Bob Good (R-VA), Dan Bishop (R-NC), Andy Biggs (R-AZ), Jody Hice (R-GA), Marjorie Taylor Greene (R-GA), Jeff Duncan (R-SC) Mary E. Miller (R-IL), Louie Gohmert (R-TX), Alex X. Mooney (R-WV), Matt Rosendale (R-MT), Ralph Norman (R-SC), Bill Posey (R-FL), Clay Higgins (R-LA) Randy K. Weber (R-TX), Andrew Clyde (R-GA), Paul A. Gosar, D.D.S.",
    "author": "Rebecca Downs",
    "title": "Rep. Chip Roy is Willing to Shut Down Government Over Vaccine Mandates"
  },
  {
    "id": 7099,
    "mediaId": 2548,
    "date": "2022-01-27",
    "sentence": "(RELATED: GOP Rep <span class='selected-term'>Warren Davidson</span> Apologizes After Comparing Vaccine Passports To Nazi Treatment Of Jews)\n“I said to my great-grandmother, ‘If they can go viral for dancing, why can’t we go viral for sharing these really important messages?” Forman told CBS News.",
    "author": "Sebastian Hughes",
    "title": "‘I Want To Show Them’: Holocaust Survivor Explains Why She Never Removed The Tattoo The Nazis Gave Her"
  },
  {
    "id": 6988,
    "mediaId": 2553,
    "date": "2022-01-27",
    "sentence": "“Therefore, we the undersigned refuse to consider supporting any federal government funding vehicle, be it a continuing resolution or an omnibus appropriations measure, that funds the enforcement of COVID-19 vaccine mandates at any level of government.”\nAs of press time, the following Republicans have signed onto Roy’s letter, according to a list obtained by The Daily Wire:\nSenators: Rand Paul (KY), Sen. Ron Johnson (WI)\nCongressmen: Scott Perry (PA), <span class='selected-term'>Warren Davidson</span> (OH), Lauren Boebert (CO), Bob Good (VA), Dan Bishop (CA), Andy Biggs (TX), Jody Hice (GA), Marjorie Taylor Greene (GA), Jeff Duncan (SC), Mary E. Miller (IL), Louie Gohmert (TX), Alex X. Mooney (MD), Matt Rosendale (MT), Ralph Norman (SC), Bill Posey (FL), Clay Higgins (LA), Randy K. Weber (TX), Andrew Clyde (GA), and Paul A. Gosar, D.D.S.",
    "author": "Tim Meads",
    "title": "Texas’s Chip Roy Challenges Kevin McCarthy, Mitch McConnell To Defund Government Over ‘Tyrannical’ COVID-19 Vax Mandates"
  },
  {
    "id": 7159,
    "mediaId": 2877,
    "date": "2022-01-27",
    "sentence": "I have written my congressman, <span class='selected-term'>Warren Davidson</span>, to express my concern, and thus far he has refused to reply to my email or to take any action or show any concern for the violation of the constitutional rights of those American citizens being unjustly detained, without proper representation or the right to being released on bail.” —Ohio\n“This article tells part of the story.",
    "author": "",
    "title": "Reader Comments"
  },
  {
    "id": 7156,
    "mediaId": 2699,
    "date": "2022-01-27",
    "sentence": "When Nancy Pelosi required members of the House to wear masks on the chamber floor, Republican Rep. Marjorie Taylor Greene said it was akin to “a time in history where people were told to wear a gold star… put in trains and taken to gas chambers in Nazi Germany.” Upon learning that Washington, D.C., would be requiring proof of vaccination to patronize its businesses, Republican Rep. <span class='selected-term'>Warren Davidson</span> tweeted an image of a Nazi document with the caption, “This has been done before.",
    "author": "Marlow Stern",
    "title": "Holocaust Survivor Sidney Zoltak Has a Message for Anti-Vaxxers Exploiting His Trauma"
  },
  {
    "id": 6716,
    "mediaId": 2570,
    "date": "2022-01-27",
    "sentence": "Comparisons of Covid-19 measures to Nazism have been made by U.S. Reps. <span class='selected-term'>Warren Davidson</span> (R-Ohio) and Marjorie Taylor Greene (R-Ga.), by Republican Washington state Rep. Jim Walsh, by Republican Idaho state Rep. Heather Scott, by Fox News hosts Tucker Carlson and Lara Logan, and by Robert F. Kennedy Jr., who suggested that modern Americans opposed to vaccines were more persecuted than Anne Frank.",
    "author": "Zachary Snowdon Smith",
    "title": "Holocaust Survivors Condemn Anti-Vaccine Protesters’ Use Of Nazi Imagery"
  },
  {
    "id": 6584,
    "mediaId": 2512,
    "date": "2022-01-27",
    "sentence": "\\n#HolocaustRemembranceDay\\n#ItStartedWithWordspic.twitter.com/2j2h8hS6G8\n— Claims Conference (@Claims Conference) 1617852600\nLogan is not the only far-right anti-vaxxer who has made ludicrous and anti-Semitic comments about the Holocaust; everyone from Rep. Marjorie Taylor Greene of Georgia to Rep. <span class='selected-term'>Warren Davidson</span> of Ohio has done it as well.",
    "author": "Alex Henderson",
    "title": "This 90-Year-Old Holocaust survivor is fed up with unhinged anti-vaxxers and their Nazi/vaccine comparisons"
  },
  {
    "id": 7096,
    "mediaId": 2540,
    "date": "2022-01-27",
    "sentence": "In 2019, New York Democratic Congresswoman Alexandria Ocasio-Cortez compared border facilities to \"concentration camps,\" and earlier this month, Ohio GOP Rep. <span class='selected-term'>Warren Davidson</span> compared the Covid-19 vaccination policies in Washington, DC, to the Nazi regime on Twitter.",
    "author": "Mark Wilf",
    "title": "Politicizing the Holocaust dehumanizes us all"
  },
  {
    "id": 6504,
    "mediaId": 2621,
    "date": "2022-01-29",
    "sentence": "Brown then cited Rep. <span class='selected-term'>Warren Davidson</span> (R-OH), who tweeted an image of a Nazi document with the caption, “This has been done before.",
    "author": "Katherine Huggins",
    "title": "CNN’s Pamela Brown Scorns Comparisons Between Covid Requirements and Nazi Germany: ‘Not In the Same Universe Whatsoever as Public Health Measures’"
  },
  {
    "id": 6046,
    "mediaId": 2644,
    "date": "2022-02-02",
    "sentence": "Rutherford (Fla.), Nicole Malliotakis (NY), <span class='selected-term'>Warren Davidson</span> (Ohio) and Brian Babin (Texas) also signed onto the letter.",
    "author": "Juliegrace Brufke",
    "title": "GOP lawmakers demand DOJ to address increase in police violence"
  },
  {
    "id": 5863,
    "mediaId": 3997,
    "date": "2022-02-03",
    "sentence": "",
    "author": "",
    "title": "Back to CR"
  },
  {
    "id": 6325,
    "mediaId": 2695,
    "date": "2022-02-03",
    "sentence": "), <span class='selected-term'>Warren Davidson</span> (Ohio), Lauren Boebert (Colo.), Bob Good (Va.), Dan Bishop (N.C.), Andy Biggs (Ariz.), Jody Hice (Ga.), Marjorie Taylor Greene (Ga.), Ken Buck (Colo.), Mary E. Miller (Ill.), Louie Gohmert (Texas), Alex X. Mooney (W.V.",
    "author": "Daniel Horowitz",
    "title": "Horowitz: It’s time for a government shutdown fight over COVID measures"
  },
  {
    "id": 6257,
    "mediaId": 2883,
    "date": "2022-02-07",
    "sentence": "The House on Thursday voted 262-168 to adopt the bipartisan amendment offered by Perlmutter and Democratic Reps. Nydia M. Velázquez of New York, Barbara Lee of California and Earl Blumenauer of Oregon, and Republican Reps. <span class='selected-term'>Warren Davidson</span> and David Joyce of Ohio.",
    "author": "Caitlin Reilly",
    "title": "House takes its sixth hit on cannabis banking provisions"
  },
  {
    "id": 6001,
    "mediaId": 2546,
    "date": "2022-02-08",
    "sentence": "Rep. <span class='selected-term'>Warren Davidson</span>, R-Ohio, received at least $10,000 from Smith and individuals at CMT Digital and Blockchain Capital.",
    "author": "Caitlin Reilly",
    "title": "Crypto industry poised to play larger role in midterm campaigns"
  },
  {
    "id": 6282,
    "mediaId": 2537,
    "date": "2022-02-09",
    "sentence": "Rob Portman, Rep. Thomas Massie, the Republican from Garrison who represents Northern Kentucky, and Rep. <span class='selected-term'>Warren Davidson</span>, a Republican who represents Butler County just north of Cincinnati, responded with a statement.",
    "author": "Scott Wartman",
    "title": "Portman sides with McConnell against censure of Cheney, Kinzinger. Where local delegation stands on censure, Jan. 6 fights"
  },
  {
    "id": 6306,
    "mediaId": 5308,
    "date": "2022-02-09",
    "sentence": "Even crypto advocates like Ohio Rep. <span class='selected-term'>Warren Davidson</span> are sounding the alarm over risk in the space-in a conversation with The Block, Davidson said he considered Tether (the third-largest cryptocurrency) a “time bomb”.",
    "author": "Edward Ongweso Jr",
    "title": "After a series of recent crypto hacks, companies are stepping in and bailing out protocols and users."
  },
  {
    "id": 5918,
    "mediaId": 2630,
    "date": "2022-02-10",
    "sentence": "5: How many House Republicans former President Donald Trump endorsed Wednesday, including Reps. Elise Stefanik and Claudia Tenney of New York; Michigan’s John Moolenar; Virginia’s Morgan Griffith and Ohio’s <span class='selected-term'>Warren Davidson</span>.",
    "author": "",
    "title": "Congressional leaders race to catch up to stock ban momentum"
  },
  {
    "id": 5996,
    "mediaId": 2746,
    "date": "2022-02-10",
    "sentence": "Legislation introduced by Rep. <span class='selected-term'>Warren Davidson</span>, Ohio Republican, would set 12-year term limits for directors of the National Institute of Allergy and Infectious Diseases.",
    "author": "Tom Howell Jr.",
    "title": "Pandemic outcome will define Dr. Fauci’s legacy; shifts in advice divide Americans on partisan lines"
  },
  {
    "id": 5606,
    "mediaId": 2583,
    "date": "2022-02-11",
    "sentence": "",
    "author": "",
    "title": "GOP Rep. Warren Davidson: Biden Admin Is Not Treating Drug Cartels Like the ‘Enemy of Our Country’"
  },
  {
    "id": 5364,
    "mediaId": 2546,
    "date": "2022-02-15",
    "sentence": "Lummis traveled to Miami last summer for the 2021 Bitcoin Conference, speaking on a panel about Congress with Ohio Republican Rep. <span class='selected-term'>Warren Davidson</span>, a fellow crypto enthusiast.",
    "author": "Jim Saksa",
    "title": "How Cynthia Lummis, a rancher and grandmother, was crowned the Senate’s queen of crypto"
  },
  {
    "id": 5273,
    "mediaId": 2658,
    "date": "2022-02-15",
    "sentence": "Rep. <span class='selected-term'>Warren Davidson</span> (R-Ohio), another member of the Freedom Caucus, threw his support behind Republican Study Chair Jim Banks (R-Ind.)",
    "author": "",
    "title": "House GOP messaging chief starts quieting doubters on the right"
  },
  {
    "id": 5373,
    "mediaId": 2570,
    "date": "2022-02-17",
    "sentence": "Keep Your Coins, America\nEnter Congressman <span class='selected-term'>Warren Davidson</span> (R-OH) announced the introduction of the Keep Your Coins Act on Twitter, hoping that his bill would help avoid the type of fund seizure in Canada from occurring in the United States.",
    "author": "Jason Brett",
    "title": "Meet Greg Foss: A Former Bitcoin Fundraiser For Canada’s ‘Freedom Convoy’ Protest"
  },
  {
    "id": 5419,
    "mediaId": 2674,
    "date": "2022-02-18",
    "sentence": "The move was met with some backlash in the US, with Republican Rep. Marjorie Taylor Greene (Georgia) demanding the government “Protect crypto currency owner’s rights,” and Rep. <span class='selected-term'>Warren Davidson</span> (R-Ohio) introducing a ‘Keep Your Coins Act’ that would forbid any government agency from restricting cryptocurrency transactions, and protect the rights of Americans to hold their own crypto wallets independent from financial institutions.",
    "author": "",
    "title": "US launches crackdown on illicit crypto"
  },
  {
    "id": 5203,
    "mediaId": 2641,
    "date": "2022-02-22",
    "sentence": "Therefore, we ask that your decisions comport with the Constitution and our nation's laws by consulting with Congress to receive authorization before any such development.”\nThe Hill reports that the letter was signed by Reps. Nancy Mace, R-S.C., Pramila Jayapal, D-Wash., Ilhan Omar, D-Minn., Matt Gaetz, R-Fla. and <span class='selected-term'>Warren Davidson</span>, R-Ohio, among others.",
    "author": "Jeremy Frankel",
    "title": "Biden Urged by Lawmakers To Consult Congress Before Sending Military to Ukraine"
  },
  {
    "id": 5376,
    "mediaId": 2684,
    "date": "2022-02-22",
    "sentence": "Nancy Mace (R-SC), Alexandria Ocasio-Cortez (D-NY), Cori Bush (D- MO) Pramila Jayapal (D-WA), Ilhan Omar (D-MN), Matt Gaetz (R-FL) and <span class='selected-term'>Warren Davidson</span> (R-OH) are among the 43 lawmaker-signees.",
    "author": "Evan Craighead",
    "title": "US Lawmakers Urge Biden to Get Congressional Approval Before Involving Troops in Ukraine Crisis"
  },
  {
    "id": 4724,
    "mediaId": 2658,
    "date": "2022-02-22",
    "sentence": "The letter — led by Reps. PETER DeFAZIO (D-Ore.) and <span class='selected-term'>WARREN DAVIDSON</span> (R-Ohio) — is supported by progressive and antiwar groups such as Just Foreign Policy, Common Defense, Heritage Action and the Quincy Institute for Responsible Statecraft.",
    "author": "",
    "title": "The economic war on Russia has begun"
  },
  {
    "id": 5253,
    "mediaId": 2629,
    "date": "2022-02-22",
    "sentence": "In January, Ohio Rep. <span class='selected-term'>Warren Davidson</span> had to apologize for comparing a vaccination requirement for Washington, D.C., bars, and restaurants to a \"Gesundheitspass.\"",
    "author": "Josh Israel",
    "title": "Ron Johnson Compares Anti-Vax Convoy To Holocaust Victims"
  },
  {
    "id": 5434,
    "mediaId": 2735,
    "date": "2022-02-23",
    "sentence": "“Our nation’s laws are highly relevant to the ongoing situation in Ukraine,” 43 U.S. House members led by Reps. Peter DeFazio (D-Ore.) and <span class='selected-term'>Warren Davidson</span> (R-Ohio) wrote in a letter to the White House on Tuesday.",
    "author": "Jake Johnson",
    "title": "Lawmakers Warn Biden He Can’t Unilaterally Send US Troops to Fight Russia"
  },
  {
    "id": 5378,
    "mediaId": 2810,
    "date": "2022-02-23",
    "sentence": "Organized by Oregon Democrat Peter DeFazio, a founding member of the Congressional Progressive Caucus who currently chairs the House Transportation and Infrastructure Committee, and Ohio Republican <span class='selected-term'>Warren Davidson</span>, a West Point graduate who is a leading member of the hardline-conservative House Freedom Caucus, the letter reads:\nWe strongly urge your administration to respect the separation of powers, U.S. law, and Congress’s constitutional war powers authority.",
    "author": "John Nichols",
    "title": "Any US Military Involvement in Ukraine Needs Congressional Approval"
  },
  {
    "id": 5230,
    "mediaId": 2604,
    "date": "2022-02-23",
    "sentence": "“Therefore, we ask that your decisions comport with the Constitution and our nation’s laws by consulting with Congress to receive authorization before any such development.”\nThe letter was signed by Reps. Nancy Mace (R-S.C.), Pramila Jayapal (D-Wash.), Ilhan Omar (D-Minn.), Matt Gaetz (R-Fla.) and <span class='selected-term'>Warren Davidson</span> (R-Ohio), among others.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "Lawmakers urge Biden to ask Congress before sending military to Ukraine"
  },
  {
    "id": 4957,
    "mediaId": 2537,
    "date": "2022-02-23",
    "sentence": "Monica Lira, Amberley Village\nUnclear why Ohio congressmen voted against postal reform\nI noticed that Congressmen Brad Wenstrup, Jim Jordan and <span class='selected-term'>Warren Davidson</span> were the three Ohio representatives (out of 16) that voted NAY on the recently passed H.R.",
    "author": "",
    "title": "Letters: Would you please get Burrow some protection?"
  },
  {
    "id": 5225,
    "mediaId": 6676,
    "date": "2022-02-23",
    "sentence": "“Therefore, we ask that your decisions comport with the Constitution and our nation’s laws by consulting with Congress to receive authorization before any such development.”\nThe letter was signed by Reps. Nancy Mace (R-S.C.), Pramila Jayapal (D-Wash.), Ilhan Omar (D-Minn.), Matt Gaetz (R-Fla.) and <span class='selected-term'>Warren Davidson</span> (R-Ohio), among others.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "Lawmakers urge Biden to ask Congress before sending military to Ukraine"
  },
  {
    "id": 5382,
    "mediaId": 2600,
    "date": "2022-02-23",
    "sentence": "“Therefore, we ask that your decisions comport with the Constitution and our nation’s laws by consulting with Congress to receive authorization before any such development.”\nThe letter was signed by Reps. Nancy Mace (R-S.C.), Pramila Jayapal (D-Wash.), Ilhan Omar (D-Minn.), Matt Gaetz (R-Fla.) and <span class='selected-term'>Warren Davidson</span> (R-Ohio), among others.",
    "author": "IWB",
    "title": "Lawmakers urge Biden to ask Congress before sending military to Ukraine"
  },
  {
    "id": 5156,
    "mediaId": 2553,
    "date": "2022-02-23",
    "sentence": "The letter, written by Democratic Oregon Representative Peter DeFazio and Republican Ohio Representative <span class='selected-term'>Warren Davidson</span>, demanded that Biden defer to the War Powers Resolution of 1973 and get approval from Congress before engaging U.S. troops in hostilities between the two nations.",
    "author": "John Rigolizzo",
    "title": "43 Republican, Democrat House Members Demand Biden Seek Approval Before Sending U.S. Troops To Ukraine"
  },
  {
    "id": 5290,
    "mediaId": 2572,
    "date": "2022-02-23",
    "sentence": "Rep. Peter DeFazio, an Oregon Democrat, and Rep. <span class='selected-term'>Warren Davidson</span>, an Ohio Republican, led the diverse group of 43 members of Congress in a letter to Biden, urging him to follow the Constitution when considering deploying U.S. troops.",
    "author": "Marisa Schultz",
    "title": "Lawmakers urge Biden to get congressional approval before stationing US troops in Ukraine"
  },
  {
    "id": 5332,
    "mediaId": 2748,
    "date": "2022-02-24",
    "sentence": "The authors, Peter DeFazio (D-Ore.) and <span class='selected-term'>Warren Davidson</span> (R-Ohio), write that “if the ongoing situation compels you to introduce the brave men and women of our military into Ukraine, their lives would inherently be put at risk if Russia chooses to invade.",
    "author": "Hayden Schmidt",
    "title": "Democrats and Republicans line up to invoke their war powers on Ukraine"
  },
  {
    "id": 5231,
    "mediaId": 2679,
    "date": "2022-02-24",
    "sentence": "",
    "author": "Jim Brunner",
    "title": "WA lawmakers condemn Russian attack on Ukraine as ‘cruel ambition’ of Putin"
  },
  {
    "id": 5126,
    "mediaId": 2546,
    "date": "2022-02-24",
    "sentence": "The day before, a bipartisan group of 43 representatives, led by Democrat Peter A. DeFazio of Oregon and Republican <span class='selected-term'>Warren Davidson</span> of Ohio, wrote to Biden to warn him that Congress must approve any military action against Russia.",
    "author": "Mark Satter",
    "title": "The consensus against using force holds, despite Russia’s invasion"
  },
  {
    "id": 5188,
    "mediaId": 2707,
    "date": "2022-02-24",
    "sentence": "Rep. <span class='selected-term'>Warren Davidson</span>, R-Ohio, illustrated the risk well when he said, “[Imagine] if the same thing were done to a crowdfunded BLM movement.” Or, imagine if it happened to any number of other protests that took place over the past few years.",
    "author": "Nicholas Anthony",
    "title": "Canada’s plow through financial freedom stopped convoy"
  },
  {
    "id": 5147,
    "mediaId": 2523,
    "date": "2022-02-24",
    "sentence": "Rep. <span class='selected-term'>Warren Davidson</span>, R-Ohio, illustrated the risk well when he said, “[Imagine] if the same thing were done to a crowdfunded BLM movement.” Or, imagine if it happened to any number of other protests that took place over the past few years.",
    "author": "Nicholas Anthony",
    "title": "Canada’s plow through financial freedom stopped convoy"
  },
  {
    "id": 5168,
    "mediaId": 4010,
    "date": "2022-02-24",
    "sentence": "",
    "author": "Jack Detsch",
    "title": "Biden Administration Debates Legality of Arming Ukrainian Resistance"
  },
  {
    "id": 4420,
    "mediaId": 2658,
    "date": "2022-02-28",
    "sentence": "Three days after Trudeau invoked emergency authorities, Rep. <span class='selected-term'>Warren Davidson</span> (R-Ohio) introduced legislation that would bar federal agencies from implementing any rules that might prevent Americans from using crypto in peer-to-peer transactions.",
    "author": "",
    "title": "Trucker crypto crackdown in Canada fuels GOP backlash in U.S."
  },
  {
    "id": 4307,
    "mediaId": 2537,
    "date": "2022-02-28",
    "sentence": "Both senators are Republicans\nThe bill passed the House on a largely party-line vote; all the Greater Cincinnati Republicans including Southwest Ohio's Reps. Steve Chabot, Brad Wenstrup, <span class='selected-term'>Warren Davidson</span> and Northern Kentucky's Thomas Massie voted against it.",
    "author": "Rachel Berry",
    "title": "New Ohio River bridge next to Brent Spence won't require tolls, governors of Ohio and Kentucky say"
  },
  {
    "id": 3738,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "… Reps. <span class='selected-term'>Warren Davidson</span> (R-Ohio) and Trent Kelly (R-Miss.)",
    "author": "",
    "title": "POLITICO Playbook: Biden’s SOTU blues"
  },
  {
    "id": 4344,
    "mediaId": 2629,
    "date": "2022-03-01",
    "sentence": "Colorado's Lauren Boebert last summer called public health officials providing at-home COVID-19 vaccines as \"Needle Nazis;\" Ohio's <span class='selected-term'>Warren Davidson</span> had to apologize for likening a Washington, D.C., vaccine requirement to a Nazi \"Gesundheitspass (health pass)\" used to require \"racial hygiene;\" Alabama's Mo Brooks read aloud sections of Adolf Hitler's book \"Mein Kampf\" on the House floor in 2019 as part of a speech attacking the media and Democrats for allegations Donald Trump's 2016 campaign colluded with Russians; and North Carolina's Madison Cawthorn complained in 2020 that it was really difficult to convince Jews to convert out of Judaism.",
    "author": "Josh Israel",
    "title": "Feckless GOP Leadership Refuses To Punish Greene For ‘America First’ Bigotry"
  },
  {
    "id": 4512,
    "mediaId": 2570,
    "date": "2022-03-01",
    "sentence": "As a result of the events in Canada, <span class='selected-term'>Warren Davidson</span> (R-Ohio), a U.S. congressman, has pushed a “Keep your coins” act to prevent the government and government agencies from ever limiting an individual’s ability to buy and sell cryptocurrencies for their own purposes through a self-hosted wallet.",
    "author": "Rufas Kamau",
    "title": "Bitcoin Demonstrates Its Intrinsic Value To The World"
  },
  {
    "id": 4274,
    "mediaId": 2576,
    "date": "2022-03-03",
    "sentence": "More:For Delphi's former salaried workers, retirement has been a long fight for fair treatment\nIn the House, cosponsors include Democratic Reps. Debbie Dingell of Dearborn and Tim Ryan and Marcy Kaptur of Ohio; and Republican Reps. Michael Turner, Bill Johnson and <span class='selected-term'>Warren Davidson</span> of Ohio.",
    "author": "Todd Spangler",
    "title": "Delphi retirees' fix could cost $1 billion, Biden's support for measure unclear"
  },
  {
    "id": 3839,
    "mediaId": 2537,
    "date": "2022-03-03",
    "sentence": "Former Cincinnati City Councilman Phil Heimlich announced Thursday he will challenge U.S. Rep. <span class='selected-term'>Warren Davidson</span> in a Republican Primary.",
    "author": "Scott Wartman",
    "title": "Phil Heimlich to challenge Ohio's Rep. Warren Davidson for Congress; attacks Trump"
  },
  {
    "id": 3855,
    "mediaId": 2658,
    "date": "2022-03-07",
    "sentence": "Fuentes is “corrupting” the politics of America First as coined by Trump, said Rep. <span class='selected-term'>Warren Davidson</span> (R-Ohio), a member of the Freedom Caucus.",
    "author": "",
    "title": "Why Republicans may let Greene and Gosar's latest brushfire burn itself out"
  },
  {
    "id": 3299,
    "mediaId": 2540,
    "date": "2022-03-08",
    "sentence": "\"We need to make sure we get a good Rules package, make sure we get good leaders on all the right committees and in the leadership team,\" said Rep. <span class='selected-term'>Warren Davidson</span> of Ohio, a member of the Freedom Caucus' leadership team.",
    "author": "Melanie Zanona",
    "title": "Republican leaders face threat of revived Freedom Caucus in GOP-led House"
  },
  {
    "id": 3035,
    "mediaId": 2746,
    "date": "2022-03-09",
    "sentence": "“Speaker Pelosi famously supports passing bills to find out what’s in the bills,” said Rep. <span class='selected-term'>Warren Davidson</span>, Ohio Republican.",
    "author": "Haris Alic",
    "title": "House passes Biden’s $1.5 trillion budget after Pelosi beats back far-left revolt"
  },
  {
    "id": 3284,
    "mediaId": 2533,
    "date": "2022-03-10",
    "sentence": "https://t.co/Bd9wq4zsmb\n— <span class='selected-term'>Warren Davidson</span> (@WarrenDavidson) March 9, 2022\nAnother question.",
    "author": "Natalie Argyle",
    "title": "Pelosi Quietly Dropped Huge Spending Bill At 2:30AM For Vote Just Hours Later"
  },
  {
    "id": 3032,
    "mediaId": 2572,
    "date": "2022-03-10",
    "sentence": "The letter boasts strong support from Republican lawmakers and is co-signed by Reps. Virginia Foxx, Madison Cawthorn, Scott Fitzgerald, Thomas McClintock, Brian Mast, Guy Reschenthaler, Chris Jacobs, Cliff Bentz, Lisa McClain, Jake LaTurner, Beth Van Duyne, Lee Zeldin, Michelle Steel, Mariannette Miller-Meeks, Ralph Norman, Rick Allen, John Moolenaar, John Rutherford, GT Thompson, Jason Smith, Dusty Johnson, <span class='selected-term'>Warren Davidson</span>, Darrell Issa, and Tim Walberg.",
    "author": "",
    "title": "Stefanik, congressional Republicans hammer Biden for 'mask mandate on toddlers' in Head Start programs"
  },
  {
    "id": 3148,
    "mediaId": 2746,
    "date": "2022-03-14",
    "sentence": "The lawmakers that signed on as co-plaintiffs are: Sen. Rand Paul of Kentucky; Rep. Andy Biggs of Arizona; Rep. Dan Bishop of North Carolina; Rep. Lauren Boebert of Colorado; Rep. Andrew Clyde of Georgia; Rep. <span class='selected-term'>Warren Davidson</span> of Ohio; Rep. Bob Good of Virginia, Rep. Paul Gosar of Arizona;, Rep. Marjorie Taylor Greene of Georgia; Rep. Brian Mast of Florida; Rep. Alex Mooney of West Virginia; Rep. Barry Moore of Alabama; Rep. Ralph Norman of South Carolina, Rep. Bill Posey of Florida, Rep. Matt Rosendale of Montana, and Rep. Chip Roy of Texas.",
    "author": "Seth McLaughlin",
    "title": "Seventeen GOP lawmakers sue CDC over mask mandates on flights"
  },
  {
    "id": 3560,
    "mediaId": 2553,
    "date": "2022-03-15",
    "sentence": "Mask mandates are old news, and are only being kept in place by those who relish controlling our day-to-day lives.”\nThe 16 other Republican Congress members included in the lawsuit are Sen. Rand Paul (R-KY), Rep. Andy Biggs (R-AZ), Rep. Dan Bishop (R-NC), Rep. Lauren Boebert (R-CO), Rep. Andrew Clyde (R-GA), Rep. <span class='selected-term'>Warren Davidson</span> (R-OH), Rep. Bob Good (R-VA), Rep. Paul Gosar (R-AZ), Rep. Marjorie Taylor Greene (R-GA), Rep. Brian Mast (R-FL), Rep. Alex Mooney (R-WV), Rep. Barry Moore (R-AL), Rep. Ralph Norman (R-SC), Rep. Bill Posey (R-FL), Rep. Matt Rosendale (R-MT), and Rep. Chip Roy, (R-TX).",
    "author": "Dillon Burroughs",
    "title": "17 GOP Congress Members Sue The CDC To End Air Travel Mask Mandate"
  },
  {
    "id": 3240,
    "mediaId": 2594,
    "date": "2022-03-15",
    "sentence": "The lawsuit includes Representatives Andy Biggs, Dan Bishop, Lauren Boebert, Andrew Clyde, <span class='selected-term'>Warren Davidson</span>, Bob Good, Paul Gosar, Marjorie Taylor Greene, Brian Mast, Alex Mooney, Barry Moore, Ralph Norman, Bill Posey, Matt Rosendale and Chip Roy.",
    "author": "Graig Graziosi",
    "title": "More than a dozen GOP lawmakers sue to force US government to end mask mandate for planes"
  },
  {
    "id": 2965,
    "mediaId": 2537,
    "date": "2022-03-15",
    "sentence": "Among the other plaintiffs in the lawsuit are Sen. Rand Paul, R-Ky, and Rep. <span class='selected-term'>Warren Davidson</span>, a Republican representing southwest Ohio, including Butler County.",
    "author": "Rachel Berry",
    "title": "Ohio and Kentucky lawmakers among those suing CDC over mask requirement on airplanes"
  },
  {
    "id": 3365,
    "mediaId": 2528,
    "date": "2022-03-16",
    "sentence": "Dan Crowley, a lobbyist and partner at K&L Gates, is scheduled to host the fundraising dinner on Thursday for Republican Rep. <span class='selected-term'>Warren Davidson</span> of Ohio, with \"special guest\" Roger Williams, a Republican congressman from Texas, also attending, according to an invitation obtained by Insider.",
    "author": "Camila DeChalus",
    "title": "Trump-backing congressmen and a top DC lobbyist will make their own luck at a St. Patrick's Day political fundraiser"
  },
  {
    "id": 2786,
    "mediaId": 2658,
    "date": "2022-03-16",
    "sentence": "New Joint Fundraisers\nFREEDOMWORKS VICTORY 2022 (Freedomworks PAC, Reps. Andy Biggs, Mike Bishop, <span class='selected-term'>Warren Davidson</span>, Byron Donalds, Mark Green, Yvette Herrell, Ralph Norman, Matt Rosendale, Chip Roy, Sen. Mike Lee, John James for Congress, Inc., Lawson for Congress, Reeves for Congress, Sabatini for Congress, Lori for Freedom)\nScott Baugh Victory Fund (Scott Baugh for Congress, Stop Collectivism or Totalitarianism Triumphs PAC, NRCC, California Republican Party Federal Acct.)",
    "author": "",
    "title": "Top aide to Blue Dog Dems leader heads to K Street"
  },
  {
    "id": 2311,
    "mediaId": 6466,
    "date": "2022-03-22",
    "sentence": "The Senate bill is sponsored by Oregon Democrat Ron Wyden, Montana Republican Steve Daines, New Jersey Democrat Cory Booker and Utah Republican Mike Lee, while a companion bill in the House of Representatives is backed by California Democrat Ted Lieu and Ohio Republican <span class='selected-term'>Warren Davidson</span>.",
    "author": "",
    "title": "Bipartisan bill would expand US data collection transparency requirements"
  },
  {
    "id": 2342,
    "mediaId": 2745,
    "date": "2022-03-22",
    "sentence": "Cory Booker (D-N.J.) and Mike Lee (R-Utah) and Reps. Ted Lieu (D-Calif.) and <span class='selected-term'>Warren Davidson</span> (R-Ohio).",
    "author": "",
    "title": "The government can seize your messages in secret. Lawmakers want you to know if it does."
  },
  {
    "id": 2389,
    "mediaId": 2658,
    "date": "2022-03-24",
    "sentence": "“We’re not just coming off of him being president,” said Freedom Caucus member <span class='selected-term'>Warren Davidson</span> (R-Ohio), who noted that Trump still has sway on some issues.",
    "author": "",
    "title": "House GOP returns to the state where Cheney fell — in a brighter mood this time"
  },
  {
    "id": 2434,
    "mediaId": 2570,
    "date": "2022-03-25",
    "sentence": "Reps. Ted Budd (R-N.C.), <span class='selected-term'>Warren Davidson</span> (R-OH), Scott Perry (R-Pa.) and Barry Loudermilk (R-Ga.) sent a letter to Education Secretary Miguel Cardona in September, urging him to oppose the Biden administration’s efforts to forgive student loans through “unlawful executive action.” They said Congress provides “limited and explicit authority” to the Education Secretary to “compromise, waive or release any right, title, claim, lien or demand” of student loan balances under certain circumstances, such as the death of the borrower, but there is “no unilateral authority to do so for all student loan balances as a general rule.”\nThe Biden administration is under growing political pressure to forgive at least a portion of federal student debt.",
    "author": "Lisa Kim",
    "title": "Obama Education Secretary Says Biden Should Cancel Student Debt"
  },
  {
    "id": 2461,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "#DoNotComply https://twitter.com/MayorBowser/status/1480956796395216900\\u00a0\\u2026pic.twitter.com/pHeeNPVhlP\n— <span class='selected-term'>Warren Davidson</span> (@Warren Davidson) 1641984463\nHeimlich says, “I’m willing to follow Liz Cheney and Anthony Gonzalez, people like that who have stood up for what’s right.",
    "author": "Timothy Evans",
    "title": "His father helped save people from choking – now he is trying to save the GOP from Trump"
  },
  {
    "id": 1723,
    "mediaId": 2537,
    "date": "2022-04-04",
    "sentence": "Local congressional races\nU.S. House, 1st Congressional District(Hamilton County, Warren County)\nDemocrat\nGreg Landsman\nRepublican\nSteve Chabot(incumbent)\nJenn Giroux\nU.S House, 8th Congressional District(Hamilton County, Butler County)\nDemocrat\nVanessa Enoch\nRepublican\n<span class='selected-term'>Warren Davidson</span>(incumbent)\nPhil Heimlich\nU.S. House, 2nd Congressional District(Clermont County)\nDemocrat\nAlan Darnowsky\nSamantha Meadows\nRepublican\nJames Condit Jr.\nBrad Wenstrup(incumbent)\nDavid Windisch\nLocal primaries\nCountywide offices and judicial races are up for election this year.",
    "author": "Scott Wartman",
    "title": "The Ohio primary is here, sort of. What to know as early voting starts"
  },
  {
    "id": 1283,
    "mediaId": 2745,
    "date": "2022-04-06",
    "sentence": "President Trump and Secretary of State Pompeo made the case, but apparently, Putin finally convinced them->\n— <span class='selected-term'>Warren Davidson</span> (@WarrenDavidson) April 6, 2022\nOf these provisions, Davidson said, “America’s sovereignty is nonnegotiable.",
    "author": "",
    "title": "Why 30 percent of the House GOP voted against reaffirming NATO support"
  },
  {
    "id": 1427,
    "mediaId": 2528,
    "date": "2022-04-06",
    "sentence": "Seven Republicans — Reps. Tom Massie of Kentucky, Scott Perry of Pennsylvania, Marjorie Taylor Greene of Georgia, <span class='selected-term'>Warren Davidson</span> of Ohio, Liz Cheney of Wyoming, and Andy Biggs and Paul Gosar of Arizona — voted against the bill.",
    "author": "Taiyler Simone Mitchell",
    "title": "6 GOP House members opposed a bill meant to document and preserve evidence of war crimes during Russia's invasion of Ukraine"
  },
  {
    "id": 1561,
    "mediaId": 2746,
    "date": "2022-04-06",
    "sentence": "“So, this is a historic moment and I want to thank the Chairman, as always, for working with me to stand up against evil, because that’s exactly what this is.”\nThe seven House members who voted against the resolution were all Republicans: Reps. Andy Biggs and Paul Gosar of Arizona, Liz Cheney of Wyoming, <span class='selected-term'>Warren Davidson</span> of Ohio, Marjorie Taylor-Greene of Georgia, Thomas Massie of Kentucky, and Scott Perry of Pennsylvania.",
    "author": "Joseph Clark",
    "title": "House passes war-crimes legislation aimed at Putin"
  },
  {
    "id": 1402,
    "mediaId": 6676,
    "date": "2022-04-07",
    "sentence": "GOP Reps. Andy Biggs (Ariz.), <span class='selected-term'>Warren Davidson</span> (Ohio), Paul Gosar (Ariz.), Marjorie Taylor Greene (Ga.), Thomas Massie (Ky.) and Scott Perry (Pa.) all opposed the bill.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "Here are the 6 Republicans who voted against investigating Russia for war crimes"
  },
  {
    "id": 1775,
    "mediaId": 2526,
    "date": "2022-04-07",
    "sentence": "Congressmen Thomas Massie and Scott Perry, <span class='selected-term'>Warren Davidson</span>, Andy Biggs, Paul Gosar and, of course, Congresswoman Marjorie Taylor Greene.",
    "author": "Pam Key",
    "title": "Joni Ernst: America First ‘Certainly Is Not America Alone’"
  },
  {
    "id": 1563,
    "mediaId": 2621,
    "date": "2022-04-07",
    "sentence": "Greene and Massie were joined by Reps. Andy Biggs (R-AZ), Paul Gosar (R-AZ), <span class='selected-term'>Warren Davidson</span> (R-OH), and Scott Perry (R-PA) in voting against the Ukraine Invasion War Crimes Deterrence and Accountability Act on Wednesday.",
    "author": "Alex Griffing",
    "title": "Here Are The Only House Members to Vote Against Banning Russian Oil and a War Crimes Probe in Ukraine"
  },
  {
    "id": 1770,
    "mediaId": 2752,
    "date": "2022-04-07",
    "sentence": "He called NATO “a relic of the Cold War” and asked, “Why should Americans pay for Europe’s defense?”\nBlake says GOP Rep. <span class='selected-term'>Warren Davidson</span>, who was also one of the six who voted against preserving evidence of war crimes, was a bit more \"nuanced.\"",
    "author": "Evan Hurst",
    "title": "How Are GOP Congressmen Appeasing Putin The Genociding Murderer Today?"
  },
  {
    "id": 1768,
    "mediaId": 2688,
    "date": "2022-04-07",
    "sentence": "Only six House lawmakers (all Republicans) voted against the measure: Reps. Marjorie Taylor Greene (R-GA), Paul Gosar (R-AZ), Thomas Massie (R-KY), Andy Biggs (R-AZ), <span class='selected-term'>Warren Davidson</span> (R-OH) and Scott Perry (R-PA).",
    "author": "Cristina Cabrera",
    "title": "Tennessee GOPers Add Age Limit To Hetero-Only Marriage Bill After Outcry"
  },
  {
    "id": 1555,
    "mediaId": 2643,
    "date": "2022-04-07",
    "sentence": "Or as I like to call them, Vladâ€™s Cover-Up Crew:\nAndy Biggs\n<span class='selected-term'>Warren Davidson</span>\nPaul Gosar\nMarjorie Taylor Greene\nTom Massie\nScott Perry\n— Miles Taylor (@MilesTaylorUSA) April 7, 2022\nCheney, like Taylor, has repeatedly slammed Republicans that she and many others view as favorable to Putin and Russia amid the ongoing war with Ukraine.",
    "author": "Jason Lemon",
    "title": "Trump Official Dubs Six GOP Reps. 'Vlad's Cover-Up Crew' for War Crime Vote"
  },
  {
    "id": 1498,
    "mediaId": 2627,
    "date": "2022-04-07",
    "sentence": "The list, comprised entirely of Republicans, features some familiar names:\nAndy Biggs of Arizona\n<span class='selected-term'>Warren Davidson</span> of Ohio\nPaul Gosar of Arizona\nMarjorie Taylor Greene of Georgia\nThomas Massie of Kentucky\nScott Perry of Pennsylvania\nSince Russia’s invasion of Ukraine, there have been a series of House votes on measures related to the attack, each of which have been approved easily, despite opposition from the contingent that Rep. Liz Cheney labeled the GOP’s “Putin wing.”\nIt was about a month ago, for example, when the House voted overwhelmingly to ban oil imports from Russia.",
    "author": "Steve Benen",
    "title": "GOP’s ‘Putin wing’ takes a bizarre stand on war crimes resolution"
  },
  {
    "id": 1324,
    "mediaId": 2643,
    "date": "2022-04-07",
    "sentence": "The six other Republican members who voted against the Ukraine Invasion War Crimes Deterrence and Accountability Act were Representatives Andy Biggs of Arizona, <span class='selected-term'>Warren Davidson</span> of Ohio, Paul Gosar of Arizona, Marjorie Taylor Greene of Georgia, Thomas Massie of Kentucky and Scott Perry of Pennsylvania.",
    "author": "Darragh Roche",
    "title": "Liz Cheney Votes Against Russian War Crimes Bill by Mistake"
  },
  {
    "id": 1519,
    "mediaId": 2596,
    "date": "2022-04-07",
    "sentence": "Andy Biggs, <span class='selected-term'>Warren Davidson</span>, Paul Gosar, Marjorie Taylor Greene, Thomas Massie, and Scott Perry all voted 'no' on the bill which passed through the House on Wednesday.",
    "author": "",
    "title": "7 Republicans voted against Russian war crimes probe - but one says she did it by mistake"
  },
  {
    "id": 1741,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "The representatives who voted against the bill include: Marjorie Taylor Greene of Georgia, <span class='selected-term'>Warren Davidson</span> of Ohio, Thomas Massie of Kentucky, Scott Perry of Pennsylvania and Andy Biggs and Paul Gosar of Arizona.",
    "author": "Johanna Chisholm",
    "title": "Ex-Trump official calls six Republican lawmakers ‘Vlad’s cover up crew’ for Russia war crime vote"
  },
  {
    "id": 1762,
    "mediaId": 2532,
    "date": "2022-04-07",
    "sentence": "Six Republicans, Reps. Andy Biggs of Arizona, <span class='selected-term'>Warren Davidson</span> of Ohio, Paul Gosar of Arizona, Marjorie Taylor Greene of Georgia, Thomas Massie of Kentucky and Scott Perry of Pennsylvania voted against the measure.",
    "author": "",
    "title": "Senate to vote on revoking Russia's trade status, oil ban"
  },
  {
    "id": 385,
    "mediaId": 2664,
    "date": "2022-04-11",
    "sentence": "Tom Massie (KY) Scott Perry (PA) Marjorie Taylor Greene (GA) <span class='selected-term'>Warren Davidson</span> (OH) Andy Biggs (AZ) Paul Gosar (AZ)\nApril 6th 2022\n18,664 Retweets34,747 Likes\nThis move toward autocracy in the GOP is the biggest threat our democracy faces today.",
    "author": "Thom Hartmann",
    "title": "Why is the GOP siding with Putin?"
  },
  {
    "id": 441,
    "mediaId": 2641,
    "date": "2022-04-11",
    "sentence": "While Democrats are complaining Republicans are seeking to pass legislation to keep public schools from teaching sex education to elementary school kids, Rep. <span class='selected-term'>Warren Davidson</span>, R-Ohio, told Newsmax it is \"mind blowing\" such laws are even needed.",
    "author": "Eric Mack",
    "title": "Rep. Warren Davidson to Newsmax: Calls for K-3 Sex Ed 'Mind Blowing'"
  },
  {
    "id": 713,
    "mediaId": 2621,
    "date": "2022-04-13",
    "sentence": "Others who were not sanctioned are Andrew Barr (R-KY); Steny Hoyer (D-MD); James McGovern (D-MA); William Keating (D-MA); Chris Smith (R-NJ); Frank Pallone (D-NJ); Tom Malinowski (D-NJ); Albio Sires (D-NJ); Gregory Meeks (D-NY); Jerry Nadler (D-NY); Richard Hudson (R-NC); <span class='selected-term'>Warren Davidson</span> (R-OH); Marcy Kaptur (D-OH); Michael Turner (R-OH); Brian Fitzpatrick (R-PA); Joe Wilson (R-SC).",
    "author": "Kipp Jones",
    "title": "Here Are All House Members Russia Didn’t Sanction"
  },
  {
    "id": 644,
    "mediaId": 2537,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Dave Caudill",
    "title": "Opinion: Heimlich working to restore Republican Party's integrity"
  }
]