{
  "id": 106,
  "mediaId": 2584,
  "date": "2022-02-20",
  "headline": "Revealed: Credit Suisse leak unmasks criminals, fraudsters and corrupt politicians",
  "image": "https://i.guim.co.uk/img/media/ea2f2a55d32e6b0a7475bd97e1980540e79f3746/0_0_5000_3000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f6376850c988abca05bf648401a70fe4",
  "link": "https://www.theguardian.com/news/2022/feb/20/credit-suisse-secrets-leak-unmasks-criminals-fraudsters-corrupt-politicians",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luke Harding",
  "authorUrl": "https://www.theguardian.com/profile/lukeharding",
  "termIds": [
    5484,
    353,
    598,
    6639,
    6318
  ],
  "sentences": [
    "Massive leak reveals secret owners of £80bn held in Swiss bank\nWhistleblower leaked bank’s data to expose ‘immoral’ secrecy laws\nClients included human trafficker and billionaire who ordered girlfriend’s murder\nVatican-owned account used to spend €350m in allegedly fraudulent investment\nScandal-hit Credit Suisse rejects allegations it may be ‘rogue bank’\nA massive leak from one of the world’s biggest private banks, Credit Suisse, has exposed the hidden wealth of clients involved in torture, drug trafficking, money laundering, corruption and other serious crimes.",
    "“Credit Suisse strongly rejects the allegations and inferences about the bank’s purported business practices,” the bank said in a statement, arguing that the matters uncovered by reporters are based on “selective information taken out of context, resulting in tendentious interpretations of the bank’s business conduct.”\nThe bank also said the allegations were largely historical, in some instances dating back to a time when “laws, practices and expectations of financial institutions were very different from where they are now”.",
    "Asked why Sederholm needed a Swiss account, they said that he was living in Thailand when it was opened, adding: “Can you please tell me if you would prefer to put your money in a Thai or Swiss bank?”\nFerdinand and Imelda pillage the Philippines\nSwiss banks have cultivated their trusted reputation since as far back as 1713, when the Great Council of Geneva prohibited bankers from revealing details about the fortunes being deposited by European aristocrats.",
    "“However, it is likely that a significant number of these accounts were opened with the sole purpose of hiding their holder’s wealth from fiscal institutions and/or avoiding the payment of taxes on capital gains.”\nIt was not possible for journalists in the Suisse secrets project to establish how many of the more than 18,000 accounts in the leak were declared to relevant tax authorities.",
    "Neiman alleges there has been a culture at the bank “which encourages its bankers probably from the top down to hear no evil, see no evil, speak no evil, bury their heads in the sand on a good day, and on many days, actively assist folks to skirt whatever the law may be in order to best protect assets under management”.”\nSuch allegations are strongly rejected by Credit Suisse.",
    "However, a wide-ranging US Senate investigation later uncovered the aggressive tactics used by UBS and Credit Suisse, the latter of which was found to have sent bankers to high-end events to recruit clients, courted a potential customer with free gold, and in one case even delivered sensitive bank statements hidden in the pages of a Sports Illustrated magazine.",
    "Relationship managers were expected to use external sources to verify customers and their risk levels, according to the leak, including news articles or databases such as the Thomson Reuters World-Check platform, which is used widely in the financial services sector to flag when people are arrested, charged, investigated or convicted of a serious crime.",
    "The Credit Suisse statement added: “These media allegations appear to be a concerted effort to discredit the bank and the Swiss financial marketplace, which has undergone significant changes over the last several years.”\nThe debate over whether Switzerland’s banking industry has undergone sufficient reforms is likely to be renewed in light of the leak.",
    "That includes the $2.6bn the Swiss bank agreed to pay US authorities after pleading guilty to conspiring to aid tax evasion in 2014; the $536m it was fined by the US five years before for deliberately circumventing US sanctions against countries including Iran and Sudan in 2009, and other payouts to Germany and Italy over tax evasion allegations.",
    "Other Credit Suisse clients linked to Hosni Mubarak were the late tycoon Hussein Salem – who acted as a financial consigliere for the dictator for nearly three decades, amassed a fortune through preferred tender deals and died in exile after facing money-laundering charges – and Hisham Talaat Moustafa, a billionaire politician in Mubarak’s party.",
    "As one commentator observed earlier this week: “The bank boasts that its purpose is to serve its wealthy clients ‘with care and entrepreneurial spirit’, but at this stage most of them would probably be happy if it could just avoid yet another major scandal.”\nHorta-Osório lasted less than a year before resigning last month.",
    "“In line with financial reforms across the sector and in Switzerland, Credit Suisse has taken a series of significant additional measures over the last decade, including considerable further investments in combating financial crime,” the bank said in its statement, adding that it upheld “the highest standards of conduct”.",
    "“Never write anything down that could expose an account that is non-compliant and never ask a question you do not want to know the answer to.”\nThe 2000s was also a decade in which foreign regulators and tax authorities became increasingly frustrated at their inability to penetrate the Swiss financial system.",
    "She said: “Nobody wants to have asked the question: how is that possible?”\nAround the time it was doing business with Lazarenko, Credit Suisse appears to have also made inroads into the Egyptian political establishment under the dictator Hosni Mubarak, who was president for three decades until 2011.",
    "They include a human trafficker in the Philippines, a Hong Kong stock exchange boss jailed for bribery, a billionaire who ordered the murder of his Lebanese pop star girlfriend and executives who looted Venezuela’s state oil company, as well as corrupt politicians from Egypt to Ukraine.",
    "Monika Roth, an expert on money laundering and a professor at Lucerne University, said Swiss banks had for a long time struggled to properly challenge politicians and public officials who, after stints in public office on relatively modest salaries, turned up with huge sums to deposit.",
    "Over the past three decades, Credit Suisse has faced at least a dozen penalties and sanctions for offences involving tax evasion, money laundering, the deliberate violation of US sanctions and frauds carried out against its own customers that span multiple decades and jurisdictions.",
    "“The words ‘Venezuela’, ‘PDVSA’ and ‘oil’ are an alarm bell for banks.”\nIf so, that does not appear to have stopped Credit Suisse acquiring clients later revealed to be involved in numerous US investigations and prosecutions linked to PDVSA and the looting of the Venezuelan economy.",
    "Reporters working on the Suisse secrets project identified Credit Suisse accounts linked to almost two dozen business people, officials and politicians implicated in corrupt schemes in Venezuela, most of which revolved around the state oil company, Petróleos de Venezuela (PDVSA).",
    "One client, Stefan Sederholm, a Swedish computer technician who opened an account with Credit Suisse in 2008, was able to keep it open for two-and-a-half years after his widely reported conviction for human trafficking in the Philippines, for which he was given a life sentence.",
    "“The pretext of protecting financial privacy is merely a fig leaf covering the shameful role of Swiss banks as collaborators of tax evaders.”\nCredit Suisse said that Switzerland’s strict banking secrecy laws prevented it from commenting on claims relating to individual clients.",
    "One Algerian client was Khaled Nezzar, who served as minister of defence until 1993 and participated in a coup that precipitated a brutal civil war in which the military junta he was part of was accused of disappearances, mass detentions, torture and execution of detainees.",
    "Lawyers for the brothers reject any suggestion they were corrupt, saying their rights were violated during the Egyptian case, and 10 years of wide-ranging and intrusive investigations into their global assets by foreign authorities has not uncovered any legal violations.",
    "This inequity in the system was cited by the whistleblower behind the leaked data, who said the CRS system “imposes a disproportionate financial and infrastructural burden on developing nations, perpetuating their exclusion from the system in the foreseeable future”.",
    "While Credit Suisse said in its statement it could not comment on any specific clients, the bank said “actions have been taken in line with applicable policies and regulatory requirements at the relevant times, and that related issues have already been addressed”.",
    "Sederholm’s crime first came to light in 2009, when police in Manila raided a storefront purporting to be the local chapter of the Mindanao Peoples’ Peace Movement, and discovered about 17 women in cubicles with webcams performing sex shows for foreign customers.",
    "One case involves two US-based businessmen with Venezuelan connections, Roberto Rincón Fernández and Abraham Shiera Bastidas, who in 2009 set about bribing officials in exchange for lucrative PDVSA contracts with the help of an associate, Fernando Ardila Rueda.",
    "That capped an unprecedented year of controversies in which the bank became embroiled in the collapse of the supply chain finance firm Greensill Capital and the US hedge fund Archegos Capital, and was fined £350m over its role in a loan scandal in Mozambique.",
    "Shortly after Credit Suisse appointed its new chairman, Axel Lehmann, the bank reported a loss of 1.6bn CHF (£1.3bn) in the fourth quarter, in part because it had put aside more than 400m CHF (£320m) to deal with unspecified “legacy litigation matters”.",
    "While I am aware that banking secrecy laws are partly responsible for the Swiss economic success story, it is my strong opinion that such a wealthy country should be able to afford a conscience.”\n* Currency conversions are based on historical rates.",
    "“But we have addressed those problems and for several years we have taken internal measures to make sure nothing similar happens in the future.”\nBanks that enable kleptocrats to launder their money are complicit in a particularly far-reaching crime.",
    "The bank said its “preliminary review” of the accounts flagged by the Suisse secrets reporting project had established that more than 90% of those reviewed were now closed or “were in the process of closure prior to receipt of the press inquiries”.",
    "We know there is no substitute for being there – and we’ll stay on the ground, as we did during the 1917 Russian Revolution, the Ukrainian famine of the 1930s, the collapse of the Soviet Union in 1991 and the first Russo-Ukrainian conflict in 2014.",
    "Details of accounts linked to 30,000 Credit Suisse clients all over the world are contained in the leak, which unmasks the beneficiaries of more than 100bn Swiss francs (£80bn)* held in one of Switzerland’s best-known financial institutions.",
    "Clients would face intensified scrutiny when flagged as a politically exposed person from a high-risk country, or a person involved in a high-risk activity such as gambling, weapons trading, financial services or mining, the report said.",
    "It has long been known that Credit Suisse was one of the first banks to help the Marcoses ravage their own country and in one infamous episode even helped them open Swiss accounts under the fake names “William Saunders” and “Jane Ryan”.",
    "This month, Credit Suisse became the first major Swiss bank in the country’s history to face criminal charges – which it denies – relating to allegation it helped launder money from the cocaine trade on behalf of the Bulgarian mafia.",
    "He has since died, but his case is one of dozens discovered by reporters appearing to show Credit Suisse opened or maintained accounts for clients who had serious convictions that might be expected to show up in due diligence checks.",
    "It remains unclear why Credit Suisse allowed Lazarenko to open an account and deposit such huge sums in the first place, given his background; before entering politics, Lazarenko was a functionary in charge of a collective farm.",
    "By adopting the so-called common reporting standard (CRS) for sharing tax data, Switzerland in effect agreed that its banks would in the future exchange information about their clients with tax authorities in foreign countries.",
    "One Vatican-owned account in the data was used to spend €350m (£290m) in an allegedly fraudulent investment in London property that is at the centre of an ongoing criminal trial of several defendants, including a cardinal.",
    "After German authorities raided the Munich headquarters of Siemens in 2006, Seidel immediately confessed his role in the bribery scheme, though he said he had never stolen from the company or appropriated its slush funds.",
    "The whistleblower who shared the data suggested that banks alone should not be blamed for the state of affairs, as they are “simply being good capitalists by maximising profits within the legal framework they operate in”.",
    "He pleaded guilty to money laundering in Switzerland in 2000, and was later indicted in the US for corruption and sentenced to nine years in prison in 2006 in relation to bribes received from a Ukrainian businessman.",
    "Its lawyers said it had fully cooperated with many of the investigations cited by the Guardian and that any past individual failings by the bank did not reflect its current business policies, practices or culture.",
    "Like every other bank in the world, Credit Suisse professes to have stringent control mechanisms to carry out extensive due diligence on its customers to “ensure that the highest standards of conduct are upheld”.",
    "“The bank’s compliance departments [were] masters of plausible deniability,” they told a reporter from the Organized Crime and Corruption Reporting Project, one of the coordinators of the Suisse secrets project.",
    "That changed in 2007, when the UBS banker Bradley Birkenfeld voluntarily approached US authorities with information about how the bank was helping thousands of wealthy Americans evade tax with secret accounts.",
    "The revelations sent shock waves through Switzerland’s financial sector and enraged the US, which pressured Switzerland into unilaterally disclosing which of its taxpayers had secret Swiss accounts from 2014.",
    "‘How many rogue bankers before you become a rogue bank?’\nWhen Credit Suisse’s ornate headquarters were constructed in the 1870s in Zurich, they were designed to symbolise “Switzerland as a financial centre”.",
    "Such controls might be expected to prevent a bank from opening accounts for clients such as Rodoljub Radulovic, a Serbian securities fraudster indicted in 2001 by the US Securities and Exchange Commission.",
    "They say the case was politically motivated, but after an unsuccessful appeal Alaa and Gamal paid an estimated $17.6m to the Egyptian government in a settlement agreement that made no admissions of guilt.",
    "Of the remaining accounts, which remain active, the bank said it was “comfortable that appropriate due diligence, reviews and other control-related steps were taken, including pending account closures”.",
    "Countries with some of the largest number of clients in the data, such as Venezuela, Egypt, Ukraine and Thailand, have long struggled with political and financial elites hiding their fortunes offshore.",
    "Moustafa, who could not be reached for comment, was convicted in 2009 of hiring a hitman to murder his ex-girlfriend, the Lebanese pop star Suzanne Tamim – but his account was not closed until 2014.",
    "Lazarenko was later estimated by Transparency International to have looted $200m from the Ukrainian government, allegedly by threatening to harm businesses unless they paid him 50% of their profits.",
    "Politicians and state officials are among the riskiest customers for banks because of their access to public funds, particularly in developing nations with fewer legal safeguards against corruption.",
    "Disgraced executives, fraudsters, traffickers – clients\nWhen Ronald Li Fook-shiu approached a banker to open an account in 2000, he is unlikely to have been viewed as a run-of-the-mill client.",
    "The custom was enshrined in statute in 1934 with the introduction of Switzerland’s banking secrecy law, which criminalised the disclosure of client banking information to foreign authorities.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "After the Arab spring uprisings their fortunes changed, and in 2015 the brothers and their father were sentenced to three years in jail by an Egyptian court for embezzlement and corruption.",
    "As the multinational’s lead in Nigeria, he oversaw a campaign of industrial-scale bribery to secure lucrative contracts for his employer by funnelling cash to corrupt Nigerian politicians.",
    "Lawyers for Credit Suisse told the Guardian these periodic reviews were introduced “more than 15 years ago”, meaning it was continually running due diligence on existing clients from 2007.",
    "There are other instances in which Credit Suisse may have taken quick action after red flags emerged, but the case nonetheless shows that dubious clients have been attracted to the bank.",
    "“Corruption has always been around in PDVSA, in varying degrees and levels,” said César Mata-Garcia, an academic at the University of Dundee specialising in international petroleum law.",
    "Jeff Neiman, a Florida-based attorney who represents a number of Credit Suisse whistleblowers, believes the sheer number of scandals involving the bank indicates a deeper problem.",
    "“Simply put, Swiss legislators are responsible for enabling financial crimes and – by virtue of their direct democracy – the Swiss people have the power to do something about it.",
    "If ordinary Algerians, Egyptians and Ukrainians have reason to complain that Credit Suisse may have aided nefarious leaders, their grievances pale in comparison with Venezuelans.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "It is hard to know how Credit Suisse could have missed the money-laundering case linking the couple to the corrupt Philippine leader, which was reported by the Associated Press.",
    "Some of the Venezuela-linked Credit Suisse accounts contained enormous sums; Villalobos had as much as 9.5m CHF (£6.3m) in his account and De Léon had as much as 22m (£15.5m).",
    "However, the repercussions of the leak could be much broader than one bank, threatening a crisis for Switzerland, which retains one of the world’s most secretive banking laws.",
    "“We are transparent, there is nothing to hide in Switzerland.”\nSwitzerland’s almost 90-year-old banking secrecy law, however, remains in force – and was recently broadened.",
    "One former Credit Suisse employee at the time alleges there was a deeply ingrained culture in Swiss banking of looking the other way when it came to problematic clients.",
    "He is arguably rivalled only by relatives of the brutal Nigerian dictator Sani Abacha, who is believed to have stolen as much as $5bn from his people in just six years.",
    "More than 150 years later, Credit Suisse occupies the same grand premises and Switzerland remains a global offshore centre, much as it has done for the last 300 years.",
    "The data reveals Credit Suisse accounts held by several more intelligence and military figures and their family members, including in Pakistan, Jordan, Yemen and Iraq.",
    "It’s our job at the Guardian to decipher a rapidly changing landscape, particularly when it involves a mounting refugee crisis and the risk of unthinkable escalation.",
    "Banks and other financial institutions are required to subject politically exposed persons, or PEPs, to the most stringent checks, known as “enhanced due diligence”.",
    "Media partners in the consortium wrote to more than 100 Credit Suisse clients in the data, asking whether they had disclosed their Swiss accounts to tax authorities.",
    "He was recently given a 10-year prison sentence by a court in Belgrade for his role trafficking cocaine from South America for the organised crime boss Darko Šaric.",
    "The consequences for already impoverished populations can be devastating, as state coffers are siphoned, basic standards are eroded and trust in democracy plummets.",
    "We’d like to invite you to join more than 1.5 million supporters from 180 countries who now power us financially – keeping us open to all, and fiercely independent.",
    "None are as well known as the Marcoses or the Abachas, but several wielded great power in countries from Syria to Madagascar, where they amassed personal fortunes.",
    "They include Pavlo Lazarenko, who served a corrupt single year as prime minister of Ukraine between 1997 and 1998 before applying for an account at Credit Suisse.",
    "A representative for Sederholm said Credit Suisse never froze his accounts and did not close them until 2013 when he was unable to provide due diligence material.",
    "The leaked Credit Suisse data is peppered with politicians and their allies who have been linked to corruption before, during or after they had their accounts.",
    "Against this backdrop, the Suisse secrets revelations may fuel questions over whether Credit Suisse’s challenges are indicative of a deep malaise at the bank.",
    "A former chairman of the Hong Kong stock exchange, he was one of the wealthiest people in the city, where he was known as the “godfather of the stock market”.",
    "The leak points to widespread failures of due diligence by Credit Suisse, despite repeated pledges over decades to weed out dubious clients and illicit funds.",
    "It contained a maximum balance of 2m CHF (£900,000) and remained open until 2013, two years after he was arrested in Switzerland for suspected war crimes.",
    "The leaked data contains an account that belonged to Helen Rivilla, an attorney convicted in 1992 for helping launder money on behalf of Ferdinand Marcos.",
    "Our correspondents are on the ground in Ukraine and throughout the globe delivering round-the-clock reporting and analysis during this perilous situation.",
    "The leaked accounts are linked to Credit Suisse clients living in more than 120 jurisdictions, with a concentration of clients in the developing world.",
    "Switzerland soon became a tax haven for many of the world’s elites and its bankers nurtured a “duty of absolute silence” about their clients’ affairs.",
    "More than 90 countries, most of which are in the developing world, remain in the dark when their wealthy taxpayers hide their money in Swiss accounts.",
    "The Tax Justice Network estimates that countries around the world collectively lose $21bn (£15.4bn) each year in tax revenues because of Switzerland.",
    "The couple are estimated to have siphoned as much as $10bn from the Philippines during the three terms Ferdinand was president, which ended in 1986.",
    "Among those who allegedly received bungs were the energy vice-minister, Nervis Villalobos Cárdenas, and a senior PDVSA official, Luis De Léon Perez.",
    "In 2015, US prosecutors began indicting the participants; court papers make repeated reference to payments into accounts in an unnamed Swiss bank.",
    "His lawyer said his Credit Suisse accounts had not been accessed for two decades and were frozen in connection with court proceedings against him.",
    "“We understand that the index was not really happy with us being involved with Abacha – we were not happy ourselves,” a spokesperson said in 1999.",
    "Despite this, she was able to open a Swiss account in 2000, as was her husband, Antonio, who faced similar charges that were subsequently dropped.",
    "The couple, who could not be reached for comment, were able to hold about 8m CHF (£3.6m) with the bank before their accounts were closed in 2006.",
    "We can reveal how Credit Suisse repeatedly either opened or maintained bank accounts for a panoramic array of high-risk clients across the world.",
    "The Suisse secrets project sheds a rare light on one of the world’s largest financial centres, which has grown used to operating in the shadows.",
    "Rincón, the businessman paying their bribes, had more than 68m CHF (£44.2m) in his account as of November 2015, the month prior to his arrest.",
    "It is only in recent decades that Credit Suisse, one of Switzerland’s oldest and most cherished banks, acquired its reputation for calamity.",
    "It identifies the convicts and money launderers who were able to open bank accounts, or keep them open for years after their crimes emerged.",
    "The whistleblower acknowledged that the leak would contain accounts that were legitimate and declared by the client to their tax authority.",
    "One of the most notorious cases in Credit Suisse’s history involved the corrupt Philippine dictator Ferdinand Marcos and his wife, Imelda.",
    "They added that their Swiss accounts had been frozen for over a decade, pending the resolution of investigations by the Swiss authorities.",
    "Li’s career had ended in disgrace in 1990, when he was convicted of taking bribes in exchange for listing companies on the stock exchange.",
    "Credit Suisse has more than 1.6tn CHF (£1.3tn) in assets under management and is one of Switzerland’s largest lenders, second only to UBS.",
    "The first was opened in 2005, the year after the SEC had secured a default judgment against Radulovic for running a pump-and-dump scheme.",
    "The bank might, therefore, have been expected to have discovered that its German client Eduard Seidel was convicted of bribery in 2008.",
    "“I am aware that having an offshore Swiss bank account does not necessarily imply tax evasion or any other financial crime,” they said.",
    "A 2017 leaked report commissioned by Switzerland’s financial regulator shed some light on the bank’s internal procedures at that time.",
    "The 2017 report said Credit Suisse screened customers at least every three years and as often as once a year for the riskiest clients.",
    "Lazarenko, who reportedly lives in California, has resisted returning to the country, where he still faces accusations he stole $17m.",
    "One month after pressure from rivals forced Lazarenko to announce his resignation, he opened his first of two Credit Suisse accounts.",
    "It has long been known that Credit Suisse provided services to Abacha’s sons, opening Swiss accounts in which they deposited $214m.",
    "That same year, Switzerland reluctantly signed up to the international convention on the automatic exchange of banking Information.",
    "An economic war deepens, as the military conflict escalates, civilian casualties rise and evidence of horrific war crimes mounts.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "And it reveals how Switzerland’s famed banking secrecy laws helped facilitate the looting of countries in the developing world.",
    "He said his client had addressed all outstanding matters relating to his bribery offences and wished to move on with his life.",
    "We have an illustrious, 200-year history of reporting throughout Europe in times of upheaval, peace and everything in between.",
    "“There is no longer Swiss bank client confidentiality for clients abroad,” the Swiss Bankers Association told the Guardian.",
    "By 2010 – the year before the popular revolt that ousted their father – an account belonging to Alaa held 232m CHF (£138m).",
    "However, a decade later Li was nonetheless able to open an account that later held 59m CHF (£26.3m), according to the leak.",
    "The brothers’ relationship with the bank spanned decades, with the earliest joint account opened by the brothers in 1993.",
    "Swiss financial institutions manage about 7.9tn CHF (£6.3tn) in assets, nearly half of which belongs to foreign clients.",
    "Email investigations@theguardian.com, or use Signal or WhatsApp to message (UK) +44 7584 640566 or (US) +1 646 886 8761.",
    "His involvement in the corruption led to his name being entered into the Thomson Reuters World-Check database in 2007.",
    "However, many of its 3,500 ‘relationship managers’, who find and serve wealthy clients, are spread across the world.",
    "The huge trove of banking data was leaked by an anonymous whistleblower to the German newspaper Süddeutsche Zeitung.",
    "Siemens said it did not know about the money and that its review of its own cashflows shed no light on the account.",
    "However, the leaked Credit Suisse data shows his accounts were left open until at least well into the last decade.",
    "In 1995, a Zurich court ordered Credit Suisse and another bank to return $500m of stolen funds to the Philippines.",
    "These countries are the ones that therefore suffer most from Switzerland’s reverse-Robin-Hood stunt,” they said.",
    "While some accounts in the data were open as far back as the 1940s, more than two-thirds were opened since 2000.",
    "The timing of the leak could hardly be worse for Credit Suisse, which has recently been beset by major scandals.",
    "It has almost 50,000 employees, including a significant workforce in Zurich, where the bank is headquartered.",
    "Links to another dictator … and another\nFerdinand Marcos may have been Credit Suisse’s most notorious client.",
    "Membership of the global exchange system is often cited by Switzerland’s banking industry as a turning point.",
    "Nezzar’s alleged role in human rights abuses had been widely documented by 2004, when his account was opened.",
    "However, the leaked data reveals all five men had Credit Suisse accounts active at the time of the offences.",
    "Another Mubarak henchman linked to Credit Suisse’s banking services was his former spy chief Omar Suleiman.",
    "Birkenfeld was viewed as a traitor in Switzerland, where banking whistleblowers are often held in contempt.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "Credit Suisse was publicly contrite after being kicked off a sustainable investment index over the affair.",
    "His associates are listed in the data as beneficial owners of an account that held 63m CHF (£26m) in 2007.",
    "The scandals involving Greensill, Archegos and Mozambique bonds have dogged the bank over the past year.",
    "In some instances, Credit Suisse is understood to have frozen accounts belonging to problematic clients.",
    "His lawyer said those convictions did not relate to the theft of any money from the people of Ukraine.",
    "The bank’s clients included Mubarak’s sons, Alaa and Gamal, who established business empires in Egypt.",
    "“I believe that Swiss banking secrecy laws are immoral,” the whistleblower source said in a statement.",
    "Suleiman was a feared figure in Egypt, where he oversaw widespread torture and human rights abuses.",
    "However, the leaked data identifies him as the co-signatory of two Credit Suisse company accounts.",
    "Last month, it lost its chairman, António Horta-Osório, after he twice broke Covid-19 regulations.",
    "Many of those countries will be poorer nations that have not signed up to the CRS data exchange.",
    "“This situation enables corruption and starves developing countries of much-needed tax revenue.",
    "Reporting like this is vital to establish the facts: who is lying and who is telling the truth.",
    "But how many rogue bankers do you need to have before you start having a rogue bank?” he said.",
    "The Guardian is part of a consortium of media outlets given exclusive access to the data.",
    "Many of those were still open well into the last decade, and a portion remain open today.",
    "The lawyer did not respond to repeated invitations to explain the source of the 54m CHF.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "In November, it announced it would put “risk management at the very core of the bank”.",
    "Within decades, wealthy clients from all over the world were flocking to Swiss banks.",
    "One of Radulovic’s company accounts held 3.4m CHF (£2.2m) before they closed in 2010.",
    "But he was perhaps better known for the time he spent in a maximum security prison.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "In banking parlance, such controls are called know-your-client or KYC checks.",
    "At one point after he left Siemens, one account was worth 54m CHF (£24m).",
    "The exception, Villalobos, is resisting extradition to the US from Spain.",
    "In total, it has racked up more than $4.2bn in fines or settlements.",
    "Radulovic’s lawyer did not respond to multiple requests for comment.",
    "Yet questions remain about how quickly the bank moved to close them.",
    "Support the Guardian from as little as $1 – it only takes a minute.",
    "Six said they were not required to declare their Swiss accounts.",
    "Russia’s invasion of Ukraine has abruptly transformed the world.",
    "Seidel’s lawyer declined to say whether the accounts were his.",
    "Banks are required to continually reassess existing customers.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "He denies wrongdoing and the investigation is ongoing.",
    "Sometimes, that meant clients with something to hide.",
    "If there were ever a time to join us, it is now.",
    "“The bank likes to say it’s just rogue bankers.",
    "One was later valued at almost 8m CHF (£3.6m).",
    "Due diligence is not only for new clients.",
    "A new Iron Curtain is grinding into place.",
    "Do you have information about this story?",
    "Of the five, four have pleaded guilty.",
    "Millions of people have already fled.",
    "And there is no shortage of those.",
    "Seidel was an employee of Siemens.",
    "Five confirmed they had done so.",
    "They started doing so in 2018.",
    "He was convicted in 2011.",
    "We won’t let up now.",
    "No others replied.",
    "Thank you."
  ]
}