{
  "id": 10705,
  "mediaId": 2572,
  "date": "2022-03-08",
  "headline": "Putin's desire to bring back Soviet Union, advanced age driving invasion, Ukraine caucus co-chair says",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/370a9314-737b-4fa7-a03f-d6972e26742a/620ab575-b3aa-49af-a8bc-c433bf33ae34/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/putins-desire-to-bring-back-soviet-union-advanced-age-driving-invasion-ukraine-caucus-co-chair-says",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Schoffstall",
  "authorUrl": "https://www.foxnews.com/person/s/joe-schoffstall",
  "termIds": [
    4591,
    2885,
    3942,
    514,
    107,
    1470,
    6672,
    6620,
    6569,
    6286
  ],
  "sentences": [
    "He believes Russian exports must face sanctions worldwide, and we must target Russian energy and ban all of their imports into the U.S.\nFitzpatrick also believes the U.S. must sanction \"everybody that's anywhere near remotely affiliated\" with Putin and his regime, including their family members.",
    "POLISH AMBASSADOR WARNS PUTIN HAS SIGHTS SET BEYOND UKRAINE, CALLS FOR DECADES LONG RUSSIAN SANCTIONS\nFitzpatrick pointed to Putin's advanced age and desire to cement himself in Russian history books as a second driving factor in the Ukraine invasion.",
    "Secretary Jens Stoltenberg called ruling out such a move a \"painful decision\" and said NATO has a responsibility not to escalate the conflict by engaging Russian forces directly in Ukraine, either on the ground or in the air.",
    "Fitzpatrick said Ukraine was falling short on those metrics because Putin \"constantly sent saboteurs\" into the country to erode its institutions, judicial system, police force and energy contracts, among other areas.",
    "Ukraine is \"a young democracy like we used to be,\" Fitzpatrick said, \"Our democracy is 245 years old, which is very young – just a few generations – yet we are the world's oldest democracy.\"",
    "\"There can't be any carve-outs because we're worried about blowback on some of our respective economies because then you're just perpetuating the problem and kicking the can down the road.\"",
    "Rep. Brian Fitzpatrick said Russian President Vladimir Putin's appetite to reconstitute the former Soviet Union and his advanced age are two significant factors in his invasion of Ukraine.",
    "\"Two things about Vladimir Putin: He's got a significant appetite for risk when it comes to Ukraine,\" the Pennsylvania Republican and Congressional Ukrainian Caucus co-chair told Fox News.",
    "Fitzpatrick and a bipartisan coalition of lawmakers on the House Foreign Affairs Committee went to the Poland border Friday to get as close to the Russia-Ukraine war as possible.",
    "\"If the message that is sent to the world is that we're going to leave Ukraine to fight on their own, that sends a devastating message to the world,\" Fitzpatrick told Fox News.",
    "Fitzpatrick told Fox News that the U.S. now needs to close all Russian sanction loopholes, including seizing all assets and sanctioning 100% of their banks.",
    "\"It's our job to make sure when the history books are written that Vladimir Putin was, in fact, the dumbest leader they've ever had,\" Fitzpatrick added.",
    "\"He has what I call ‘legacy mania.’ He's now focused on how he's going to be written in the history books that future Russian children read.\"",
    "UKRAINE MILITARY TURNS VOLUNTEERS AWAY AS 140K UKRAINIANS COME HOME TO RIGHT RUSSIA\n\"It's got to be all-encompassing,\" he continued.",
    "\"No democracy on this planet has survived more than a few generations, yet so many people take that for granted,\" he added.",
    "CLICK HERE TO GET THE FOX NEWS APP\nFitzpatrick said Ukraine is a 30-year-old democracy that won its freedom in 1991.",
    "While there, he helped the country with anti-corruption and economic metrics in its push to become a part of NATO.",
    "\"You're going to have a far more costly problem in terms of economics and lives,\" Fitzpatrick told Fox News.",
    "Fitzpatrick said NATO must also implement a no-fly zone over Ukraine, a strategy NATO nations have opposed.",
    "\"Sergei Lavrov – Vladimir Putin's right hand – his daughter lives in the United States,\" Fitzpatrick said.",
    "\"If you want to get inside of his mind, this is almost like a West Bank situation for him,\" he continued.",
    "\"This is sacred holy ground to him, and it's the first step in reconstituting the former Soviet Union.\"",
    "\"It's unbecoming of American values, and it's unbecoming of Europe and freedom across the globe.\"",
    "As a former FBI agent, Fitzpatrick was sent to Ukraine in 2015 to work out of the U.S. embassy.",
    "\"Vladimir Putin is about to turn 70 years old, and he's up for re-election in 2024,\" he said.",
    "He said young democracies need help from other \"freedom-loving\" democracies around the world.",
    "\"He's identified three capitals of Christianity in the world: Rome, Jerusalem and Kyiv.\"",
    "The delegation hoped to see firsthand what is needed to help the Ukrainian people.",
    "A no-fly zone could actively pit NATO forces against the Russians.",
    "Marisa Schultz and Paul Conner contributed to this report.",
    "\"A lot of these oligarchs funnel money to their children.\"",
    "\"We have to be there to defend them,\" he said.",
    "We have to guard it vigilantly.\"",
    "\"It could disappear tomorrow."
  ]
}