{
  "id": 10711,
  "mediaId": 2572,
  "date": "2022-03-11",
  "headline": "Victoria Spartz, Ukraine native, describes 'heartbreaking' trip to see Russia's 'ruthless' war",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/spartz17.jpg",
  "link": "https://www.foxnews.com/politics/victoria-spartz-ukraine-native-describes-heartbreaking-trip-russias-war",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marisa Schultz",
  "authorUrl": "https://www.foxnews.com/person/s/marisa-schultz",
  "termIds": [
    5645,
    3942,
    4195,
    2974,
    3441,
    1477,
    6569,
    6526,
    6672
  ],
  "sentences": [
    "The government plane was already full for the bipartisan congressional delegation trip to the Ukraine border, but Rep. Victoria Spartz, R-Ind., was determined to see the crisis herself, so she booked a commercial flight to meet up with her colleagues in Poland last weekend.",
    "\"It's going to get worse before it gets better because a lot of people that will start coming from the more eastern, northern territories have been bombed for a few weeks and under siege and will have a lot of health issues, will have no friends or families,\" Spartz said.",
    "Spartz praised the way Poland's people have welcomed war refugees into their homes but urged the international community to do more to help support Poland and the families escaping war, as well as ensuring safe humanitarian corridors for more women and children to flee.",
    "She introduced a bipartisan resolution to investigate war crimes in the International Criminal Court committed by Russian President Vladimir Putin and his military commanders, saying that Russia's assault on Ukraine is \"pure war crimes … not war.\"",
    "Spartz, who left Ukraine at the age of 21, has become a powerful advocate for Ukraine with her emotional speeches from the Capitol on the horrors of the war and the need for the United States, European Union and others to do more to help.",
    "… When you see in person the human suffering, and you see these little kids and moms leaving their houses with nothing [in] cold weather, it really has an effect on you,\" Spartz told Fox News Digital.",
    "; David Cicilline, D-R.I.; Brian Fitzpatrick, R-Pa.; Raul Ruiz, D-Calif.; Susan Wild, D-Pa.; and Gerry Connolly, D-Va.\nREP. BRIAN FITZPATRICK HEADS TO UKRAINE BORDER: 'I WILL GO AS FAR AS ...",
    "Russia has violated safe passages and shelled civilians as they are trying to escape to the point where Spartz said Ukrainians are stuck – thinking it's too dangerous to attempt to leave.",
    "Spartz was a late addition to the bipartisan delegation trip organized by the House Foreign Affairs Committee in connection with Secretary of State Antony Blinken's trip to the region.",
    "THEY WILL ALLOW ME TO GO'\nThe delegation wanted to send a strong message of bipartisan unity that the United States stands with Ukraine and that help is on the way.",
    "Other members on the trip included Foreign Affairs Committee Chairman Gregory W. Meeks, D-N.Y., Ranking Member Michael McCaul, R-Texas, and Reps. Ann Wagner, R-Mo.",
    "And when she arrived at the border she firsthand witnessed the \"heartbreaking\" scenes of women and children fleeing Ukraine and the tragedy that is unfolding.",
    "Spartz said her grandma has not been able to get out of Ukraine because her hometown has been too heavily bombed as Russian forces are targeting civilians.",
    "Spartz, a Ukraine native, had been hearing first-hand accounts of Russia's brutal assault on the Ukrainian people from her family and friends in Ukraine.",
    "\"I am very upset that there is not more pressure from international organizations to force humanitarian corridors and monitor them,\" Spartz said.",
    "\"The saddest thing for me to see is how ruthless these people are to kill kids,\" Spartz said, noting the recent bombing of a maternity hospital.",
    "The House already approved a $13.6 billion aid package for Ukraine and passed a resolution condemning Russia for the brutal invasion.",
    "\"It has to happen because I think … hundreds of thousands, if not millions, of people will start dying in some of these cities.",
    "With Congress so divided on many things, Spartz said the trip to the Ukraine border brought her colleagues closer together.",
    "\"And I think for a lot of people with kids, it's probably worst for them to try to take a risk to get out.\"",
    "Seeing human suffering on such a grand scale, they returned to Washington much more serious people.",
    "As the fighting continues into a third week, Spartz warned that more suffering is coming.",
    "Story tips can be sent to marisa.schultz@fox.com or @marisa.schultz.",
    "Marisa Schultz is a politics reporter for Fox News Digital.",
    "Spartz said of the calculation that families are making.",
    "\"They're killing people and people are afraid to leave.\"",
    "\"What is more risky for them, to stay or leave?\"",
    "\"We're probably more united than ever.\"",
    "\"It's a tragedy what's happened there.\"",
    "So this really needs to be addressed.\"",
    "The scale … will be a catastrophe.\"",
    "\"It was so powerful,\" Spartz said.",
    "The fight for Ukraine is personal.",
    "\"It's heartbreaking to watch.",
    "\"They have no means."
  ]
}