{
  "id": 10889,
  "mediaId": 2717,
  "date": "2022-03-16",
  "headline": "Remarks by President Biden Celebrating the Reauthorization of the Violence Against Women Act",
  "image": "https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png",
  "link": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2022/03/16/remarks-by-president-biden-celebrating-the-reauthorization-of-the-violence-against-women-act/",
  "mediaOutlet": "The White House",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "And calling the police meant having to stand in front of your abuser — your significant other, your husband, whomever — and say, “He did it.”\nAnd I used to say, when I’d get heat on this, when I spoke — I remember making a speech to the Chamber of Commerce, and someone said, “Well, you’re going overboard here.” I said, “Let me ask you, Jack.” I said, “If you had a 320-pound guy who could bench 400 pounds standing in front of you and beat the — smacked you, are you going to say he did it?",
    "You know, all the brave guys I talk to, they say, “Biden, you’re overdoing this.” And I’d say, “Tell me — tell you what: If somebody who was twice your size, beating the living crap out of you and you were in the same apartment with them, how do you go and pick up the phone and call for help?”\nWomen would hide and say, “I can’t — I can’t say where I am.",
    "How many times have you heard — I’ll bet everybody knows somebody somewhere along the line that in an intimate relationship, what happened was the guy takes a revealing picture of his naked friend, or whatever, in a compromising position, and then literally, in a sense, blackmails or mortifies that person — sends it out, put it online.",
    "And we have to make sure survivors get compensation, and if there have been delays in their cases — you know, we’ve made improvements in the National Criminal Background Check System to help states investigate and prosecute cases when abuses — when abusers who are barred from purchasing firearms attempt to do so.",
    "You have all added new services and resources for folks in most underserved communities — the LGBTQ community, survivors of those rural communities — providing more support and legal services, for law enforcement to get training they need to help handle the trauma of — survivors are experiencing.",
    "And we also made landmark reforms in military justice to help end the epidemic of sexual violence and harassment in our armed forces — (applause) — fundamentally changing how the military investigates, prosecutes sexual assault, domestic violence, and other related crimes.",
    "And we talked about creating shelters to give survivors a way out because so many don’t have a way out, and their children — by the way, the vast majority of children on the street with their mothers are there because she’s a victim of domestic violence.",
    "No, no, but I mean the small print to sign a contract, and the small print says you can’t do anything if your boss, male or female — if you end up getting abused and if you end up doing something — you know, you can’t — you have to do it internally.",
    "But the point is, it’s wonderful to see so many brave survivors and dedicated advocates and — and, truly, old friends — so many who have worked so hard to modernize the Violence Against Women Act to make it stronger and make sure that it endures.",
    "Today, one year since a gunman killed eight people in Atlanta, six of whom were women of Asian descent, these horrific murders are a reminder that we still have work to do to put an end to misogyny and racism and all forms of hate we have.",
    "You could solve literally a significant portion of —\nLook, the only thing I learned that’s worse than — for a woman — worse than a woman who is abused or raped and says, “It’s Charlie who did it,” and no one believes her — him against her.",
    "That was the background when I first wrote the Violence Against Women Act in 1990 to provide more protection against domestic violence, stalking, sexual assault; to support survivors and help them find ways out of their abusive situations.",
    "It’s a family affair.”\nWhen I began, along with others, to pursue this legislation to change this — this issue, we were told that we would literally be responsible for the “disintegration” of American families in the major press.",
    "And I watched — because I was told this would happen — I watched a woman come up to the desk and say, “I want to report that my husband is beating me up.” “Well, why don’t you have a seat over there.” Not a joke.",
    "And I’d say, “No, that’s not the answer.” I happened to be raised by a gentle, decent man, who taught all of his children — and I mean this from the bottom of my heart — Lisa, you know this; you knew my dad.",
    "Just by some of you speaking out — Republicans and Democrats — just by your speaking out about how we abhor those nations that do, in fact, call for — and go through the list — it’s changing behaviors.",
    "You know, the fact is that it really wasn’t so long ago this country didn’t want to talk about violence against women, let alone as being a national epidemic, something the government had to address.",
    "And through the American Rescue Plan, the administration\ndirected $1 billion in supplemental funding for domestic violence and sexual assault services — (applause) — because they’re badly needed.",
    "When I was Vice President — I can’t remember, probably the seventh year in or thereabouts — I was in India, and I met — at the home where Mahatma Gandhi was able to be hidden for a long while.",
    "How many times have you been in a crowded airport or in a circumstance where you see a man not physically beating but abusing a woman — and you just say, “You know, I don’t want to hear that.",
    "We — for all the mistakes police make and all the things they do wrong — we expect them to be everything from a counselor to a expert on sexual violence to an expert on all these things.",
    "We don’t want to do that.” That’s why we held public hearings for this law when there were senators and others who said it was too salacious for this to be public, for people to see.",
    "And as a matter of fact, I can’t — I don’t think there were any Special Victims Units in most of the police departments around the country before this legislation was written.",
    "And here’s what they said, here’s what they wrote: They said these shelters — providing shelter was nothing more than “indoctrination centers” for women’s liberation issues.",
    "Help me.”\nThat’s how we got Microsoft and others in this — in this fight with us, to help us physically locate so the police could pick up where that call was coming from.",
    "And it helped train police officers, advocates, prosecutors, judges, court personnel to make the entire justice system fair and more responsive to the needs of survivors.",
    "And those rape kits, by the way, I don’t know — you ought to go to your major cities, those of you in the House and Senate — this group probably has — which I have done.",
    "You can make all the speeches you wanted, but until those women had the courage — and I remember — I remember in a backroom hold and they said, “It’s going to be okay.",
    "My dad would say the greatest sin of all that anyone could commit was the abuse of power, and the cardinal sin was for a man to raise his hand to a woman or a child.",
    "Pray God.”\nIt supported shelters and rape crisis centers, housing and legal assistance, creating lifesaving options for women and children all across the country.",
    "You know, whether it’s Arizona or whether it’s Michigan, wherever it is, you’re in a rural area, you call, you get help, and you do get help, and then they leave.",
    "And we’ve worked with local public housing authorities to make sure that survivors trapped in a bad situation can find safe new housing options in public housing.",
    "And I don’t recall — I don’t recall how many times I was told in the prelude to writing the legislation that it’s a “family affair.” “You don’t understand, Biden.",
    "It’s going to be okay.” Can you imagine being among the first to stand before the whole damn world and millions of people hear you recite how you were abused?",
    "I’ve been asked, time to time, was there — the reason, I guess, I got a little overwrought about this legislation early on — not that I ever get overwrought.",
    "I don’t want to — I don’t know what to do.”\nWell, I believe that if they could see the truth as to what was going on, we could begin slowly to make change.",
    "As long as there are women in this country and around the world who live in fear of violence, there’s more we have to do to fulfill this sacred commitment.",
    "We didn’t change the law; we set out — I remember some of you way back when I first wrote this legislation — to change the culture — to change the culture.",
    "Look, we delivered more help to survivors in rural areas — we understand — and in underserved communities for a simple reason: There is no place to go.",
    "Tribal courts will now be able to exercise jurisdiction over non-Native perpetrators of sexual assault, child abuse, sex trafficking, and so much more.",
    "If you take a look at those rape kits and you went through them all, you could identify and arrest probably 40, 50 percent of the rapists in America.",
    "As a practical matter, things began to shift — the legal and social burdens — away from survivors and onto perpetrators and where they belonged.",
    "Not only — not only did we reauthorize the Violence Against Women Act through 2027 — and I have to wonder why the hell we can’t reauthorize it.",
    "And again, I’ll never forget being told the first time — I said, “What did you do?” She said, “I got behind the drapes and I held the phone.",
    "But — and I — literally, the most oft-asked questions for the first three years of the act was, “Well, why are you so passionate about this?",
    "So we established a new civil rights — a new civil rights cause of action for those whose intimate images were shared on the public screen.",
    "You know, its introduction — it introduced our nation to so many brave survivors who those stories changed the way America saw the issue.",
    "The mechanism has prevented too many survivors of abuse and harassment in the workplace from having the choice to get their day in court.",
    "I’ll never forget, Chris, I went to the family court when I was writing this — and the family court in my state is like many of yours.",
    "Restoring jurisdiction of Tribal courts — (applause) — over non-Native domestic violence offenders who abuse women in Indian Country.",
    "And you make me think of the women who were willing to come and testify before the whole world when I first started those hearings.",
    "Because what used to happen is a cop may be in the street and see a husband or a boyfriend or a man — anyone — smack his wife.",
    "I mean, in the literal sense, it’s hard to believe — even when I go back and think of when — how it started and where it was.",
    "This reauthorization is testament to the power of your voices and your tireless dedication to changing things for the better.",
    "If this affected manhood — men — I don’t think we’d have a problem, you know, doing it for even longer, making it permanent.",
    "Because you know he’s going to come back.”\nLooking, few — there were very few police departments that had trained personnel.",
    "And how many times —\nI remember the biggest fights I had were the second time around with universities — with universities.",
    "I thought we had won when I got Strom Thurmond to vote for it and extend it for 25 years, and then the Court came along.",
    "And in the House — in the House of Representatives, nobody worked harder than Sheila Jackson Lee, and — and I thank you.",
    "But all kidding aside, it really does — again, I keep coming back to you — you changed the culture, not just the law.",
    "Well, first of all, as I was standing there listening, I should say that — thank all of you, everyone in this room.",
    "It made addressing general — excuse me — gender violence a shared priority with a determined, coordinated response.",
    "I mean, they’re the smart, but they — I mean, we expect them to be psychologists; we expect them to be everything.",
    "Thank you for your courage, for being a hero, sharing your powerful voice, and standing up for thousands of women.",
    "And the reason we’ve been able to do so much, make so much progress in the past 20 years is because of all of you.",
    "I haven’t been —\nBut look, it comes on top of the work we’ve done together over the last years to make progress.",
    "And the only way we could change the culture was by shining an ugly, bright light on it and speaking its name.",
    "But, you know, these are vast majority people with, you know, degrees that are two-year degrees after school.",
    "That’s why, because of all of you in this room, every time we’ve reauthorized this law, it’s been improved.",
    "You know, we — but I believed — and a lot of us did — that we had to let America know what was going on.",
    "I remember going — all kidding aside — there have been millions of women who’ve hit that hotline button.",
    "And at the time, the Majority Leader may remember, we both got criticized for wanting to make it public.",
    "Even in 1994, we knew that there was much more we had to do — you know, that it was only the beginning.",
    "Look, these are just a few of the steps you’ve all taken and how much you’ve improved this legislation.",
    "And one last thing: Some of you in here helped me work on the International Violence Against Women Act.",
    "And I want to thank the bipartisan members of Congress who helped get this latest reauthorization done.",
    "It wasn’t viewed, even among the advocacy groups, as necessarily a particularly positive thing to do.",
    "I want to thank the members of the Senate and the House, members of my Cabinet for all you’ve done.",
    "And, you know, I thought they were going to ask me questions about, you know, U.S.-India relations.",
    "Earlier this month, I signed a bar- — bipartisan bill that ends what we know as forced arbitration.",
    "And she was a serious victim of violence — left for dead, basically — before this law was written.",
    "I think we have to even be stronger than that, but that’s another — that’s another boring speech.",
    "Extending protections to everyone, regardless of sexual orientation and gender identity, in 2013.",
    "It’s not like we didn’t know in 2005 we should be dealing with the things we dealt with in 2013.",
    "Those are just a few of the ways we’ve strengthened — you, not we — you’ve strengthened the law.",
    "Because I believed, as all of you did, that Americans are basically decent and honorable people.",
    "And he’d come over and say, “Do you want to bring charges?” What the hell is she going to say?",
    "Quite frankly, this held — that’s one of the things that held up this bill for much too long.",
    "And 80 percent of the people who sign those don’t even know what’s in the — in the contract.",
    "We know the pandemic only exacerbated instances of domestic violence and sexual violence.",
    "“Yeah, I want to bring…” We got the law changed to say the cop can arrest on information.",
    "But in the meantime, all of you should be enormously proud of what you’ve accomplished.",
    "And if they do, they should have the services and support they need to get through it.",
    "No one — no one, regardless of gender or sexual orientation, should experience abuse.",
    "The idea that this took five years to reauthorize — I was out of office those years.",
    "And — and — and I met with two of the daughters of India’s most serious liberators.",
    "Whether it ends in a rape or just the physical be- — it’s about the abuse of power.",
    "We’ve created — you created new programs to help end the backlog of the rape kits.",
    "Each link in the chain that we’re building made a difference — makes a difference.",
    "And I know some of you aren’t even 28 years old, so it doesn’t count for you guys.",
    "Broadening from domestic violence to include stalking and sexual assault in 2000.",
    "It’s not like we didn’t know we wanted to do these other things in the beginning.",
    "It created a hotline, as I said, for millions of women who have used the hotline.",
    "So, I believed, as many of you in this room did, that — that I believe that too.",
    "I know some of you think maybe I should be out of office for another four years.",
    "And I’m sorry to go on, but you all should — the country owes you — all of you.",
    "“Well, we don’t want to…” I mean major universities — not Podunk universities.",
    "Expanding access to services for immigrants and communities of color in 2005.",
    "They said, “Can you help us write a Violence Against Women Act?” Not a joke.",
    "This law broke the dam of congressional resistance and cultural resistance.",
    "They’d say, “Why didn’t — why didn’t she leave?” Well, she didn’t leave.",
    "Look, and there were too few places you could go for advice or for help.",
    "I learned a long time ago: When Sheila wants something, just say yes.",
    "And, Ruth, it’s been an honor to stand with you through these years.",
    "We’re never going to get it all done, but we can’t ever stop trying.",
    "But as everyone in this room knows, this work is not going to stop.",
    "I — I’m sure there were some, I just can’t remember any of them.",
    "No, I — that’s not why it didn’t happen, but it drove me crazy.",
    "So, look, that — you know, there’s a lot that goes unprocessed.",
    "That’s what this law has always been about: the abuse of power.",
    "And I prayed to God — prayed to God — don’t let him hear this.",
    "Because I just came on the — back on the — on the range again.",
    "Now there’s programs that are on TV for the last 25, 30 years.",
    "It drove me crazy, the rationale for why we weren’t — anyway.",
    "Ex-partners and stalkers who seek to humiliate and hurt them.",
    "And the next nearest — and the next nearest town is 20 miles.",
    "It’s we did as much as we could and keep trying to add to it.",
    "And that’s exactly what you all did and that’s what happened.",
    "Yesterday, I signed the Bipartisan Government Funding Bill.",
    "And, consequentially, we forged the next link in the chain.",
    "It wasn’t just the wackos; it was in the mainstream press.",
    "And Jerry Nadler, a great friend and a great congressman.",
    "Look, thank you for coming together and never giving up.",
    "We’re giving survivors real resources against abuse now.",
    "The hardest thing to get done was arrest on information.",
    "And it brought this hidden epidemic out of the shadows.",
    "She had no place to go, and she had two kids with her.",
    "May God bless you all, and may God protect our troops.",
    "Dianne — Dianne Feinstein, Joni Ernst, Lisa Murkowski.",
    "And that could be said about most of you in this room.",
    "Go back and check your family courts back in the day.",
    "But look, you know, I don’t — just think about this.",
    "And, by the way, it’s not a criticism of the police.",
    "You sat at my desk — a lot of time with me on this.",
    "It took time to change the culture, and you did it.",
    "— (laughter and applause) — and it drove me crazy.",
    "East Room\n2:09 P.M. EDT\nTHE PRESIDENT: Thank you.",
    "We’ll get to that.” “No, no, I — I need help now.",
    "And I’ll tell you a very short concluding story.",
    "Were they — were they victims?” I swear to God.",
    "How long does it take for the cop to get there?",
    "Was your mother a victim of domestic violence?",
    "That’s what I mean about changing the culture.",
    "That was the most oft-asked question of me.",
    "But at any rate, that’s a different thing.",
    "Because they don’t have (inaudible) to go.",
    "And Brian Fitzpatrick — Brian, thank you.",
    "Zahara, do I have permission to proceed?",
    "And all of these bad — these tough guys.",
    "Now.”\nYou know, the law has saved lives.",
    "Make them look at it square in the eye.",
    "As a society, we literally looked away.",
    "It’s helped women rebuild their lives.",
    "But at any rate, that’s another issue.",
    "And run it against the whole panoply.",
    "But they didn’t want to get involved.",
    "I should be clapping for all of you.",
    "It was — because — anyway, you know.",
    "And this backlog is so significant.",
    "In many places, it wasn’t a crime.",
    "So it’s great to be with you all.",
    "It’s shot up like a Roman candle.",
    "Thank you, thank you, thank you.",
    "Thank you, thank you, thank you.",
    "Very few rapists rape only once.",
    "It’s like the Voting Rights Act.",
    "And when — you can take a look.",
    "No, I can get you the articles.",
    "The law kept growing stronger.",
    "There was no national hotline.",
    "Thank you, Kirsten Gillibrand.",
    "Was your sister or your wife?",
    "Thank you very much for that.",
    "Didn’t want to get involved.",
    "And we’re not going to rest.",
    "But, look, let’s keep going.",
    "That’s wonderful, isn’t it?",
    "That, we’ve done federally.",
    "“We don’t want to do that.",
    "You did an incredible job.",
    "Thank you, Jackie Speier.",
    "It took enormous courage.",
    "Where do you report this?",
    "That was the change made.",
    "No, but I really mean it.",
    "All the ugly side of it.",
    "It was getting it done.",
    "Take the blinders off.",
    "I won’t get into that.",
    "Thank you, thank you.",
    "No, I really mean it.",
    "That’s what happened.",
    "Where do you show up?",
    "Their DNAs are there.",
    "We did that in 2013.",
    "Major universities.",
    "No family to go to.",
    "Where would you go?",
    "Please, thank you.",
    "That was a change.",
    "They’re all there.",
    "It’s all in line.",
    "I really mean it.",
    "I — I don’t know.",
    "You go over here.",
    "He saw it happen.",
    "He saw it happen.",
    "Stand up, please.",
    "I’m coming back.",
    "I mean very few.",
    "We looked away.",
    "Is Jackie here?",
    "It never stops.",
    "Thank you all.",
    "Much too long.",
    "It saves time.",
    "You remember.",
    "“That’s okay.",
    "2:34 P.M. EDT",
    "It’s a fact.",
    "It mattered.",
    "(Laughter.)",
    "Not a joke.",
    "Not a joke.",
    "(Laughter.)",
    "(Laughter.)",
    "(Applause.)",
    "(Applause.)",
    "(Applause.)",
    "(Applause.)",
    "(Applause.)",
    "(Laughter.)",
    "(Laughter.)",
    "(Laughter.)",
    "(Laughter.)",
    "(Applause.)",
    "(Applause.)",
    "(Laughter.)",
    "(Applause.)",
    "(Applause.)",
    "(Applause.)",
    "(Applause.)",
    "(Applause.)",
    "(Applause.)",
    "(Applause.)",
    "(Applause.)",
    "You did it.",
    "(Laughter.)",
    "(Laughter.)",
    "(Applause.)",
    "(Applause.)",
    "(Laughter.)",
    "(Laughter.)",
    "(Applause.)",
    "Thank you.",
    "Seriously.",
    "All right.",
    "Thank you.",
    "Thank you.",
    "For real.",
    "Stand up.",
    "No money.",
    "Pray God.",
    "Nothing.",
    "Help me.",
    "No more.",
    "No more.",
    "Really.",
    "Period.",
    "Leave?",
    "You."
  ]
}