{
  "id": 10907,
  "mediaId": 2745,
  "date": "2022-03-09",
  "headline": "Demand for meat is destroying the Amazon. Smarter choices at the dinner table can go a long way to help.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/O2QYRFDONEI6ZMPCAU45VD2EKE.jpg&w=1440",
  "link": "https://www.washingtonpost.com/climate-solutions/2022/03/09/amazon-rainforest-deforestation-beef/?utm_source=rss&utm_medium=referral&utm_campaign=wp_climate-environment",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    43,
    6353,
    6004,
    6005,
    5948
  ],
  "sentences": [
    "“This is our moment as Americans to step forward and leverage some pressure to save the world, by helping to save the Amazon, which is critically important for the future of our planet.”\nBut persuading consumers to buy only sustainable products is just half of the solution, according to Peter Elwin, the head of the food and land use program at the nonprofit Planet Tracker.",
    "In an email, a company spokesperson responded that “beef from Brazil is not used in McDonald’s U.S. restaurants,” adding that it was committed to “eliminating deforestation from our global supply chain by 2030.”\nCould pressure from consumers persuade supermarkets and fast food companies to act more decisively to end deforestation?",
    "Campaigns like this got consumers involved.”\nWhile protests and even consumer boycotts can be powerful tools in persuading companies to clean up their act, the rapidly growing demand for sustainably produced food may be more effective in the long run, according to Frances Seymour, a senior fellow at the World Resources Institute.",
    "Deforestation has been increasing since 2016 in the Amazon (largely for cattle pasture) and even more steeply in its sister biome to the south, the Cerrado, an area of mixed dry forests and grasslands half the size of Europe, which is rapidly being cleared for ranching and also to grow soy for animal feed.",
    "As a result of Mighty Earth’s online jaguar campaign, large supermarket chains such as Tesco in Britain and Carrefour in France were inundated with emails from incensed customers demanding that they stop selling chicken and other meat products that were fueling deforestation in Brazil and Argentina.",
    "A report published by Yale University in 2020 called “Climate change and the American diet” found that roughly 1 in 4 Americans said they rewarded food companies that are taking steps to reduce their impact on the environment by buying their products at least once in the past 12 months.",
    "In arguably the biggest success to date, “the Norwegian salmon industry, which supplies about half of the world’s farmed salmon, has cut all links to deforestation in their soy supply chains,” said Nils Hermann Ranum, whose Rainforest Foundation Norway helped to broker the deal.",
    "Holly Gibbs, a land use scientist at the University of Wisconsin at Madison, explained the move came after on-site inspections by the U.S. Department of Agriculture’s Food Safety and Inspection Service found improvements in practices at six Brazilian beef production plants.",
    "In early 2021, the environmental advocacy group Mighty Earth launched an online advertising campaign to take rainforest-produced meat products out of supermarkets: #StopFeedingDeforestation, the hashtag read, accompanied by a bloody image of a jaguar speared by a fork.",
    "Beef and soy could be produced much more efficiently on land that has already been cleared, but currently underused.”\nElwin added that efforts to end deforestation in Brazil have so far been stymied by the failure to effectively monitor what is happening on the ground.",
    "An investigation published in the Guardian in early 2021 reported that food retailers Walmart, Costco and Kroger are selling Brazilian meat products linked to meatpacker JBS, the world’s largest meat-processing company, which has been linked to deforestation.",
    "“The issue is that these U.S. based companies are financing the deforestation through their global purchases on a pretty massive scale.”\nA report published by Mighty Earth found in 2017 that McDonald’s, for example, was Cargill’s biggest customer in Europe.",
    "He recalled that protests outside the headquarters of Kellogg’s and Nestlé (both of which use palm oil in their products) a decade ago forced the palm oil industry to come together and agree to eliminate rainforest cleared oil from their supply chains.",
    "“It’s not worth it just for a quick profit to destroy something that can never be brought back.”\nAnother online tool is “Rapid Response,” a database created by Mighty Earth which uses satellite imagery to monitor clear-cutting in Brazil and beyond.",
    "“One ad showed someone biting into a Kit Kat candy bar [manufactured by Hershey] which turned into an orangutan finger dripping with blood,” journalist Jocelyn Zuckerman, the author of “Planet Palm: How palm oil ended up in everything,” recalled.",
    "“It’s a symbol that, if you eat chicken, without knowing it, you are eating a jaguar because their habitat has been destroyed to produce the soybeans that the poultry are being fed,” explained Nico Muzi, former Europe director of Mighty Earth.",
    "What won’t be apparent from the air is that the landscape below is the product of consumer demand that originated far from Brazil, in the United States and in Europe, and among the burgeoning middle class in newly developed nations like China.",
    "If these trends continue, Elwin predicted, Brazil’s farmers will face declining yields and potentially a “dust bowl” in the future, like the ecological disaster that wiped out farmland in the high plains of the United States during the 1930s.",
    "In October, U.S. Sen. Brian Schatz (D-Hawaii) together with Reps. Earl Blumenauer (D-Ore.) and Brian Fitzpatrick (R-Pa.) introduced legislation to ban commodities originating from illegally deforested land from entering the United States.",
    "The United States banned beef imports from Brazil because of unsanitary conditions found in some of the country’s meatpacking plants and animal health concerns in 2017, but the Trump administration reversed the measure in February 2020.",
    "Hurowitz said that American consumers should push for a similar breakthrough in the meat industry by insisting that big chains like Burger King and McDonald’s purchase only from suppliers that don’t engage in the destruction of forests.",
    "“Our bill will give people the security to be sure that what they’re purchasing is not destroying ecosystems and kicking native people off of their land.”\nEnvironmental groups in the United States are rallying behind the legislation.",
    "Toward that end, Planet Tracker released a report in September that cites evidence that rampant deforestation has led to a less predictable rainfall pattern, more droughts and higher temperatures in which livestock and crops die.",
    "“We now have an important producer of protein for human consumption that can claim to be fully deforestation free.”\nWould American consumers be willing to act to prevent deforestation as Europeans have already begun to do?",
    "Some experts say that the best way to end this destruction — in Brazil and beyond — is to persuade consumers to purchase only meat products that have been sustainably produced on non-rainforest cleared land.",
    "Banning imports of commodity crops associated with deforestation, and providing financial incentives for buyers and suppliers who do the right thing are two “policy options that can force change,” she said.",
    "To remedy this, professor Gibbs’s land use lab, in partnership with the National Wildlife Federation (NWF), created a digital tool that uses data from the Brazilian government to track cattle supply chains.",
    "While such a move would be unlikely, President Biden was among the leaders of more than 100 countries who pledged to end deforestation by 2030 at the recent U.N. climate summit in Glasgow, Scotland.",
    "The irony, Elwin said, is that a number of studies show that clearing new forest for meat production is not just a disaster for the environment, “it is unnecessary for Brazil’s agricultural success.",
    "To help prevent this, there are strict laws on the books in Brazil banning deforestation in the Amazon rainforest, and looser regulations in the Cerrado, where less of the land is publicly owned.",
    "“The government and meat companies should invest in a Manhattan Project-scale project to bring plant-based and cultivated protein to scale,” Glenn Hurowitz, founder and CEO of Mighty Earth, said.",
    "In numerous cases, corrupt local officials are being paid off to “look the other way” said Felicio Pontes, a Brazilian federal prosecutor specializing in environmental crime, in an interview.",
    "While these food giants are largely unknown to the general public, the fast food franchises and supermarkets that they supply are more susceptible to public pressure, according to Hurowitz.",
    "Cattle in Brazil typically move between several different farms before being slaughtered, making it difficult to know whether they spent part of their life cycle on forest-cleared land.",
    "Group LDC, Europe’s largest poultry producer, also announced that it would stop buying soy from producers that destroyed native ecosystems or grabbed land from Indigenous communities.",
    "“We want to see robust zero deforestation commitments from corporations, especially from the U.S.,” said Nathalie Walker, NWF senior director of tropical forests and agriculture.",
    "An estimated 1,470 jaguars in Brazil’s Amazon rainforest were killed or displaced between 2016 to 2019 due to accelerated deforestation and the wildfires that were linked to it.",
    "“Consumers simply cannot rely on the representations of corporations when they are deciding whether or not to purchase a product,” Schatz said in a phone interview in December.",
    "Some argue that the carbon-intensive meat industry should not just get reformed, but needs to be phased out to make way for more environmentally-friendly food production.",
    "It is dominated by industrial-sized soy plantations where the protein-rich legume is being grown for conversion to animal feed for livestock like pigs and chickens.",
    "It’s part of a growing movement in Europe, where surveys show the public overwhelmingly rejects foods that help drive the destruction of the rainforest.",
    "If you look out the window halfway through the flight, you’ll see a checkerboard landscape of farmland interspersed with remnant patches of forest.",
    "But smart consumer choices alone may not be enough, argues Nancy Landrum, a professor in the business department at Loyola University Chicago.",
    "Well-known brands can compel their suppliers to stop engaging in deforestation when they threaten to take their business elsewhere, he adds.",
    "Food activists say yes, and they point back to their earlier campaign to eliminate rainforest produced palm oil from popular products.",
    "The world’s rapidly increasing appetite for cheap meat is responsible for the clearing of millions of acres of tropical forest a year.",
    "“Demand for products that are produced legally and sustainably is more likely to be effective than the blunt instrument of boycotts.”",
    "Deforestation in the Amazon can seem like a remote problem over which we have no control — but forest advocates say that’s not true.",
    "What they have in mind might become clearer on a flight from Brazil’s capital of Brasilia to Manaus, the largest city in the Amazon.",
    "“Because the U.S. is such a big agricultural producer, we don’t have huge imports directly linked to deforestation,” he explained.",
    "However, these laws are frequently ignored by land grabbers and wealthy landowners who illegally encroach on protected areas.",
    "They argue that smarter choices at the dinner table would go a long way toward safeguarding the world’s largest rainforest.",
    "American corporations like Cargill and Bunge and the Brazil-based JBS ranked among the worst offenders, Hurowitz said.",
    "They offered this resource free online to help companies avoid suppliers that are selling illegally produced beef.",
    "The nonprofit also rates companies on how well they have managed to keep deforestation out of their products.",
    "There may be “no greater step the Biden administration and Congress could take to act on climate,” he added.",
    "This so-called “Arc of Deforestation,” which hugs the eastern and southern margins of Amazonia, is vast.",
    "A combined area the size of New York City was destroyed in Brazil during the first five months of 2021.",
    "Calls for a ban were renewed recently in response to a reported outbreak of mad cow disease in Brazil.",
    "The other part is convincing farmers that it is in their own best interest to keep forests standing.",
    "Both companies pledged to eliminate meat produced with “deforestation” soy from their shelves.",
    "Three years ago, France announced its intention to ban all deforestation imports by 2030.",
    "Since then, she says, exports to the United States have been climbing to pre-ban levels.",
    "Denmark, the U.K. and the European Union itself are considering similar measures.",
    "Other retailers in the United Kingdom and Australia have recently followed suit.",
    "The rest has been transformed into scrubby rangelands for grazing cattle.",
    "“We are going to be eating the rainforest in our burgers,” Gibbs said.",
    "“In general, carrots tend to be better than sticks,” Seymour said.",
    "Some Brazilian beef is making it into U.S. supermarkets.",
    "You’ll fly over it for the better part of an hour.",
    "Ultimately, the government also needs to step in.",
    "(Soy is the main component in fish feed.)",
    "And that effort is underway.",
    "“People really freaked out."
  ]
}