{
  "id": 11674,
  "mediaId": 8489,
  "date": "2022-03-24",
  "headline": "How will the war in Ukraine end?",
  "image": "https://whyy.org/wp-content/uploads/2022/03/AP22083340976463.jpg",
  "link": "https://whyy.org/episodes/how-will-the-war-in-ukraine-end/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Bucks County Courier Times, Fitzpatrick faults ‘risks of inaction’ at BCCC forum on Ukraine –Congressman Brian Fitzpatrick called for more American and European action to help the besieged Ukrainians protect their homeland before it becomes too little too late.",
    "@akendalltaylor\nRead more\nThe Washington Post, Leaders add sanctions on Russia, warn against chemical weapons – Biden also announced that the U.S. would take in up to 100,000 refugees from Ukraine, while also calling for Moscow to be expelled from the G-20.",
    "– How to End a War That No One Is Likely to Win\nForeign Policy, Why Putin Probably Won’t Give Up Anytime Soon – History—and Putin’s penchant for risk—suggest he’s likely to dig in his heels.",
    "Nations agreed on more sanctions against Russia, and more military aid to Ukraine, increasing NATO presence in some Eastern European countries and humanitarian help.",
    "@mkimmage\nAndrea Kendall-Taylor, director of the Transatlantic Security Program at the Center for a New American Security and a former senior intelligence officer.",
    "At the post-NATO meeting press conference, President Biden explained that Putin was “banking on NATO being divided,” but the alliances are stronger than ever.",
    "And we’ll talk about the difficult choices that lie ahead, including how NATO would respond if Putin uses chemical or nuclear weapons.",
    "He co-chairs the Congressional Ukraine Caucus, recently visited the Ukraine border and spent time in Ukraine when he was an FBI agent.",
    "NATO allies, EU leaders and G7 representatives met in Brussels on Thursday for emergency summits on Russia’s war with Ukraine.",
    "This hour, we’ll discuss the meetings in Brussels, where the war stands, and if there is anyway to constrain Putin.",
    "@Repbrianfitz\nMichael Kimmage, professor at Catholic University and fellow at the German Marshall Fund.",
    "Guests\nRep. Brian Fitzpatrick, a U.S. Republican Representative serving Pennsylvania’s 1st district.",
    "He is a former State Department policy planner who held the US-Russia portfolio.",
    "Biden announced that the United States will accept 100,000 Ukrainian refugees.",
    "Foreign Affairs, What If Russia Makes a Deal?"
  ]
}