{
  "id": 12124,
  "mediaId": 8418,
  "date": "2022-03-25",
  "headline": "THANKING HEALTHCARE HEROES: Epstein Humanitarian Foundation honors healthcare workers at Lower Bucks Hospital",
  "image": "https://www.thereporteronline.com/wp-content/uploads/2022/03/LBH17.jpg?w=1024&h=713",
  "link": "https://www.thereporteronline.com/2022/03/25/thanking-healthcare-heroes-epstein-humanitarian-foundation-honors-healthcare-workers-at-lower-bucks-hospital/",
  "mediaOutlet": "Publicspirit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Werner",
  "authorUrl": "https://www.thereporteronline.com/author/jeff-werner/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We are incredibly grateful to our healthcare heroes for the tremendous courage and resiliency they have shown time and time again to our patients, our community, and above all, to each other.”\nSince the start of the pandemic, 43,845 Bucks County residents have died as a result of the COVID-19 virus, according to the county’s Department of Health website.",
    "You could not drive down the street without seeing signs – thank you healthcare workers.”\nToday, that outpouring has waned, said Epstein, but the dedication of healthcare workers like his granddaughter, Samantha, who works at a hospital in New Jersey and has twice contracted COVID while caring for COVID patients in the ICU, continues.",
    "The Washington Crossing Fifes and Drums led the crowd inside where remarks were made by Bucks County Philanthropist Gene Epstein, along with Jim Sell, Campus Dean of Bucks County Community College; Michael Motte, chief executive officer, Lower Bucks Hospital; and Lea Rodriguez, chief nursing officer of Lower Bucks Hospital.",
    "“Having local support from the Gene & Marlene Epstein Humanitarian Foundation is an emotional boost to our employees who have sacrificed and worked tirelessly for all of us.”\nThe day began with Lower Bucks Hospital CEO Michael Motte welcoming all in attendance.",
    "BRISTOL >> Lower Bucks Hospital commemorated the two-year anniversary of its first confirmed coronavirus case with a ceremony honoring healthcare workers who have spent the past two years fighting on the front lines of the COVID-19 pandemic.",
    "Our frontline healthcare workers, much like our veterans, our police officers and our firefighters made a conscious decision to put your physical health and your psychological and emotional health on the line in the name of helping others.",
    "And keep doing what you’re doing.”\nMotte personally thanked US Congressman Brian Fitzpatrick who he credited with helping the hospital secure Remdesivir, vaccines and financial reimbursement so it could pay its staff.",
    "That tells me everything I need to know about you.”\nJim Sell, Lower Bucks campus dean of the Bucks County Community College, presented the healthcare workers with thank you cards and posters made by the students.",
    "And you’re working harder shifts and working double shifts because there were a lot of nurses who have left because of mental and physical exhaustion … We need you to be healthy out of selfishness to protect us.",
    "The event was an opportunity for co-workers to gather with community leaders, begin healing collectively and enjoy a meal donated by the Gene & Marlene Epstein Humanitarian Foundation.",
    "He also took a moment to present a flag flown over the US Capitol in Washington, D.C., in honor of the Epsteins for providing lunch and support to the local healthcare heroes.",
    "“Our healthcare workers on the frontlines of COVID are in many ways an analogous to 9-11 and our first responders – people on the frontlines of a so catastrophe.",
    "“It is certainly hard to believe that two years have passed since our world was upended,” said Lea Rodriguez, chief nursing officer of Lower Bucks Hospital.",
    "“Today, we take the opportunity to publicly honor the Lower Bucks Hospital healthcare heroes that we continually hold dear in our hearts,” said Motte.",
    "“We know our healthcare heroes are tired, but they continue to put others first and care for the sickest patients in our hospitals,” Rodriguez said.",
    "“What we experienced two years ago with the outbreak of COVID was a complete outpouring of love, respect, honor and appreciation from the public.",
    "“Healthcare workers in this hospital and all across the country save countless lives year after year,” Epstein told the workers at Lower Bucks.",
    "The band played inspirational and uplifting tunes, including the theme from “Rocky,” while healthcare workers and community members listened.",
    "“I applaud our community leaders here today for acknowledging the healthcare heroes of Lower Bucks Hospital who were affected by COVID-19.",
    "Every day, these employees are putting their best foot forward, and today’s event is a reminder of our gratitude to them,” Sell said.",
    "The ceremony featured the Harry S Truman High School Marching Band led by Keith Krelove, the school’s director of Instrumental Music.",
    "The ceremony held in the lobby of the Dee Brown auditorium acknowledged the heroism and resilience of the frontline workers.",
    "“For this, I want to thank you to the nth degree … People don’t realize that you are as much at risk as you were last year.",
    "“Since Feb. 29 is a leap year, we introduced legislation to make March 1 Healthcare Appreciation Day in honor of you guys.",
    "It was also the date that the first healthcare worker was infected in Washington state,” said Fitzpatrick.",
    "“I want to thank you for your dedication and helping get patients through traumatic times,” said Epstein.",
    "“She’s still out there every day risking her health to save her patients’ lives,” said Epstein.",
    "Rodriguez also expressed gratitude for community support and donations throughout the pandemic.",
    "After the presentations, the employees and guests were offered meals donated by the Foundation.",
    "During the event, beautifully displayed signs of gratitude were donated by the Foundation.",
    "“February 29, 2020 was the date we lost the first American citizen to COVID.",
    "Fitzpatrick delivered his personal thanks to the workers at Lower Bucks.",
    "“He has been there with us every step of the way,” he said.",
    "You didn’t get into this profession to make lots of money.",
    "You did it to help others.",
    "God bless you.",
    "Thank you."
  ]
}