{
  "id": 12672,
  "mediaId": 8322,
  "date": "2022-03-05",
  "headline": "Republicans troubled by ongoing talks to revive Iran nuclear deal: 'Russia should not be at any table'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Brian-Fitzpatrick.png",
  "link": "https://www.foxnews.com/politics/republicans-troubled-iran-nuclear-deal-talks",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marisa Schultz",
  "authorUrl": "https://www.foxnews.com/person/s/marisa-schultz",
  "termIds": [
    3942,
    3176,
    2765,
    1126,
    6569,
    6177,
    6245,
    6678,
    6672
  ],
  "sentences": [
    "CRUZ, SENATE REPUBLICANS THREATEN TO BLOCK ANY IRAN NUCLEAR AGREEMENT NOT SUBMITTED TO CONGRESS\nThe Iran Nuclear Agreement Review Act passed in 2015 with bipartisan support requires the administration to submit any deal to Congress for review within five days of it being reached.",
    "REP. BRIAN FITZPATRICK HEADS TO UKRAINE BORDER: 'I WILL GO AS FAR AS THEY WILL ALLOW ME TO GO'\nRep. Liz Cheney, R-Wyo., also spoke out against any restart of a deal, calling it \"exceedingly dangerous and exceedingly misguided\" on the \"The Guy Benson Show\" on Fox News Radio.",
    "The ramped-up concern is following reporting from the Wall Street Journal on March 3 that the U.S. and Iran were closing in on an agreement after weeks of intense negotiations in Vienna involving the U.S. and Iran, and Britain, France, Germany, Russia and China.",
    "Fitzpatrick, who sits on the House Foreign Affairs Committee, was referring to the 1994 agreement where Ukraine gave up nuclear weapons after the fall of the Soviet Union in exchange for commitments from Russia and the West to respect Ukraine's sovereignty.",
    "A group of 33 Republican senators led by Sen. Ted Cruz, R-Texas, already pledged last month to do everything in their power to block a new nuclear deal if President Biden doesn't get Senate approval.",
    "In addition to Russia's involvement in the Iran nuclear deal, Fitzpatrick said that the Iranian government \"does not operate in good faith\" and the U.S. doesn't even enforce existing agreements.",
    "Republicans have long been skeptical of the Iran nuclear deal, but say the timing for any restart is particularly troubling given Russia's involvement during its ongoing invasion of Ukraine.",
    "Republicans are raising alarms about a possible breakthrough to restart the Iran nuclear deal, amid reports that the U.S. and Iran are coming close to restoring the 2015 nuclear agreement.",
    "And Rep. Pat Fallon, R-Texas, warned on Twitter that a nuclear deal with Iran could make it \"EASIER for the world’s largest state sponsor of terrorism to obtain a nuclear weapon.\"",
    "\"Russia should not be at any table with us right now,\" Rep. Brian Fitzpatrick, R-Pa., told Fox News Digital, adding that he's \"very concerned\" about a new deal.",
    "Congressional Republicans say they haven't been consulted about any deal the Biden administration is negotiating with the help of the Russians.",
    "Negotiations have been ongoing in Vienna for the United States to rejoin the international deal that President Trump pulled out of in 2018.",
    "They gave them up based on our word, based on the commitment that the United States, the UK gave to Ukraine and to Kazakhstan as well.",
    "\"Does anybody think that if Ukraine were the third-largest holder of nuclear weapons that Russia would be invading them right now?\"",
    "Britain, France, Germany, Russia and China are still part of the deal with Iran and have been trying to salvage it.",
    "\"They're committing egregious acts of terrorism and murder in a free democracy in Ukraine, in Europe right now.\"",
    "Officials from both the U.S. and Iran warned that they were still resolving sanctions relief provisions.",
    "A European diplomat told Fox News on Friday that a new deal is expected within days.",
    "\"And we're not upholding our end of the agreement,\" Fitzpatrick continued.",
    "\"So what does that mean for future nuclear anti-proliferation agreements?",
    "Story tips can be sent to marisa.schultz@fox.com or @marisa.schultz.",
    "They are pushing for any new agreement to be reviewed by Congress.",
    "Fox News' Kelly Laco and Ronn Blitzer contributed to this report.",
    "They're proceeding down the wrong path on all these fronts.\"",
    "Marisa Schultz is a politics reporter for Fox News Digital.",
    "Fitzpatrick said.",
    "\"Of course not."
  ]
}