{
  "id": 13028,
  "mediaId": 2916,
  "date": "2022-03-03",
  "headline": "Manchin, Murkowski Propose Bill to Ban Imports of Russian Oil",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/03/manchin-murkowski-russian-energy.jpg?fit=2057%2C1200",
  "link": "https://www.nationalreview.com/news/manchin-murkowski-propose-bill-to-ban-imports-of-russian-oil/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Evans",
  "authorUrl": "https://www.nationalreview.com/author/zachary-evans/",
  "termIds": [
    4591,
    5510,
    2383,
    3246,
    2859,
    1339,
    1489,
    6569
  ],
  "sentences": [
    "“And that would raise prices at the gas pump for the American people, around the world, because it would reduce the supply available.”\nPsaki said regarding sanctions on Russia and its president, Vladimir Putin, U.S. president Biden looks at “how can we maximize impact on President Putin while minimizing it on the American people.”\nRussian crude oil accounts for less than 4 percent of oil consumption in the U.S., according to the New York Times.",
    "“The U.S. cannot continue to purchase more than half a million barrels of oil per day because in doing so, we are emboldening Putin to continue using his greatest weapon of war—energy exports,” Manchin said in a statement.",
    "Before Manchin’s and Murkowski’s announcement, House speaker Nancy Pelosi was asked about the possibility of banning Russian crude-oil imports at her weekly press conference on Thursday.",
    "“Ban the oil coming from Russia.”\nMeanwhile, White House press secretary Jen Psaki said it is not in the “strategic interest” of the U.S. to limit the global energy supply at this point.",
    "“We must ban Russia’s energy imports into the U.S. so that Americans aren’t forced to help finance their growing atrocities and halt the Russian aggression,” Murkowski said.",
    "“We don’t have a strategic interest in reducing the global supply of energy,” Psaki said at a press conference, according to a transcript released by the White House.",
    "and Lisa Murkowski (R., Alaska) introduced legislation to ban imports of Russian crude oil on Thursday, amid Russia’s invasion of Ukraine.",
    "Russia supplies different grades of crude oil than oil found in the U.S., the Wall Street Journal has noted.",
    "The legislation is co-sponsored by 18 senators, including both Republicans and Democrats.",
    "Senators Joe Manchin (D., W.V.)",
    "Ban it,” Pelosi said.",
    "“I’m all for that."
  ]
}