{
  "id": 13085,
  "mediaId": 2619,
  "date": "2022-03-01",
  "headline": "‘Biden and his party have sent us back,’ says Republican after State of the Union, as Democrats also respond to speech",
  "image": "https://images.mktw.net/im-496087/social",
  "link": "https://www.marketwatch.com/story/keying-your-own-car-moderate-progressive-democrats-squabble-over-their-planned-responses-to-bidens-state-of-the-union-11646156796?rss=1&siteid=rss",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Victor Reklaitis",
  "authorUrl": "https://www.marketwatch.com/topics/journalists/victor-reklaitis",
  "termIds": [
    5220,
    5051,
    4905,
    3049,
    3448,
    2298,
    1126,
    392,
    6396
  ],
  "sentences": [
    "“But two forces stood in the way: a Republican Party that serves only the rich and the powerful, and just enough corporate-backed Democratic obstructionist to help them succeed.”\nIt’s not the first time that a Democratic lawmaker aligned with the Working Families Party has given such a speech, as Rep. Jamaal Bowman of New York spoke last year after Biden’s SOTU-style address to a joint session of Congress.",
    "In addition, moderate Democratic Rep. Josh Gottheimer of New Jersey had been due to give his “perspective” immediately following the State of the Union, as he participated in an event hosted by the “No Labels,” a nonpartisan group whose stated goal is to “break the gridlock and dysfunction.”\nRepublican Rep. Brian Fitzpatrick of Pennsyvlania also had been scheduled to take part in the No Labels event.",
    "I know who I’ll be watching,” added Omar, who along with Tlaib and influential Democratic Rep. Alexandria Ocasio-Cortez of New York is part of a liberal group of Democratic lawmakers known as “The Squad.”\nU.S. stocks SPX, -2.77% DJIA, -2.82% closed sharply lower Tuesday as Russia stepped up its attacks on Ukraine and said it would begin “high-precision” strikes on the capital city of Kyiv.",
    "In her remarks, Tlaib criticized the opposition to Biden’s Build Back Better plan, as she noted the social-spending proposal was stalled in Congress but progressives are “ready to jumpstart our work again.”\n“No one fought harder for President Biden’s agenda than progressives,” she said in her address, which came during a Zoom call hosted by the Working Families Party.",
    "“We’re now one year into his presidency, and instead of moving America forward, it feels like President Biden and his party have sent us back in time, to the late 70s and early 80s, when runaway inflation was hammering families, a violent crime wave was crashing our cities and the Soviet Army was trying to redraw the world map,” the GOP governor said.",
    "Kim Reynolds of Iowa delivered the traditional “opposite-party” rebuttal to President Joe Biden’s State of the Union address on Tuesday night, but a few of Biden’s fellow Democrats offered responses to his remarks as well — and it caused some friction within the president’s ranks.",
    "Other moderate Democrats had questioned Tlaib’s decision as well, with Rep. Elaine Luria of Virginia tweeting the following:\nTlaib’s allies came to her defense and blasted Gottheimer’s plan to speak with a GOP lawmaker after Biden’s remarks.",
    "Gottheimer had criticized Tlaib’s plan to offer a response, saying she’s being “massively counterproductive.”\n“It’s like keying your own car and slashing your own tires,” the New Jersey congressman said in an interview with Axios.",
    "Now read: Biden to tackle inflation in State of the Union, but he can’t do that much to fight it\nAlso: Here’s what experts think Biden should say about the U.S. economy and inflation in the State of the Union",
    "“So if Rashida doing a response is keying your own car, Josh doing a response with a Republican who opposes Biden’s agenda is… what…?” tweeted Democratic Rep. Ilhan Omar of Minnesota.",
    "Gottheimer and Fitzpatrick are co-chairs of the Problem Solvers Caucus, a group of lawmakers that aims to encourage bipartisan cooperation.",
    "Separate from Tlaib’s remarks, Democratic Rep. Colin Allred of Texas offered a response for the Congressional Black Caucus.",
    "Meanwhile, progressive Democratic Rep. Rashida Tlaib of Michigan gave a response on behalf of the Working Families Party.",
    "“Progressives have been stronger defenders of @POTUS and his agenda than Josh and his conservative friends.",
    "Reynolds accused Biden of taking the country in the wrong direction.",
    "Republican Gov."
  ]
}