{
  "id": 2072,
  "mediaId": 2870,
  "date": "2022-02-08",
  "headline": "U.S. Militarism Is a Cause of Tension in Eastern Europe, Not a Solution",
  "image": "https://s3.us-east-1.amazonaws.com/in-these-times/_1200x630_crop_center-center_82_none/ukraine_soldier.jpg?mtime=1644342767",
  "link": "https://inthesetimes.com/article/ukraine-russia-us-militarism-war-russian-invasion-armed-conflict-military-aggression-military-industrial-complex",
  "mediaOutlet": "In These Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Khury Petersen-Smith",
  "authorUrl": "https://inthesetimes.com/authors/khury-petersen-smith",
  "termIds": [
    0
  ],
  "sentences": [
    "Psaki’s admission begs some follow-up questions: If U.S. troops and weapons have already been in Ukraine for years — and in Europe for decades — but their presence has not deterred Russia from mobilizing troops to the Ukrainian border, why does the Pentagon think that more weapons and troops will do so now?",
    "?“Do we just let them get invaded, or do we make the cost so high on the ground-level military — but also the diplomatic and the economic?”\nThe choice being put forward is between military action or inaction; to opt for ?“inaction” is presented as an abandonment of Ukraine.",
    "Even as Ukrainian president Volodymyr Zelensky discourages panic and downplays the idea that a Russian invasion is imminent, American officials are portraying armed conflict between Russia and Ukraine as inevitable — and U.S. military support of Ukraine as necessary.",
    "We have to send a very strong and unequivocal message to Vladimir Putin, which would also be a message to Xi Jinping, to Kim Jong Un and other bad actors around the world that this is not OK to do.”\nFitzpatrick’s interviewer didn’t question his response.",
    "The particular kind of crisis story that American officials are deploying in the situation with Ukraine is a familiar one: An underdog faces a threat from an authoritarian regime, so the United States must come to the rescue with a military response.",
    "Since the 2014 conflict in Ukraine, in which Russia annexed the Crimean Peninsula, the U.S. has sent hundreds of millions of dollars’ worth of weapons to Ukraine — in 2015, 2018, 2019 and 2020—including its celebrated Javelin missiles.",
    "With 8,500 U.S. troops readied for deployment, a journalist asked during a White House press conference if sending forces to the countries that NATO counts as its ?“Eastern Flank” might escalate the situation rather than calm it.",
    "In an interview on NPR, Republican Representative and Chair of Congress’s Ukraine Caucus Brian Fitzpatrick of Pennsylvania offered a historical analogy often invoked by American officials to justify military action.",
    "If U.S. troops and weapons have already been in Ukraine for years … but their presence has not deterred Russia from mobilizing troops … why does the Pentagon think that more weapons and troops will do so now?",
    "While they speak of Ukrainian sovereignty, it is clear that U.S. officials are primarily preoccupied with Russian military aggression that they see as threatening a world order that the U.S. presides over.",
    "Still, there are moments when officials share details that unintentionally reveal that U.S. involvement in the crisis on the Ukrainian border is far more complicated than they have been acknowledging.",
    "Indeed, the U.S. maintains an enormous, nuclear armed military presence in Europe — and in the years leading up to the current crisis, it has spent millions of dollars arming Ukraine in particular.",
    "But his story conveniently omits the fact that just prior to its invasion of Kuwait, Iraq counted the U.S. as an ally — one that supplied it with weapons during the Iran-Iraq War of the 1980s.",
    "The rising tensions between Ukraine, Russia, the United States and other NATO countries — and the resulting discourse in U.S. media — show that American leaders love an international crisis.",
    "“When we defended Kuwait in Operation Desert Shield,” Fitzpatrick said, ?“we sent a message to the world that you cannot violate the territorial integrity of an independent nation.",
    "But his example of U.S. military action in Iraq in 1991 shows exactly why it’s critical to question the narrative being pushed by U.S. media, especially during times of crisis.",
    "In just over a week, the U.S. made four shipments of weapons to Ukraine — a move that has U.S. arms manufacturers anticipating soaring profits for their shareholders.",
    "Narratives like these obscure ongoing, longstanding military operations and other policies that make the world more dangerous and which have no end in sight.",
    "Khury Petersen-Smith is the Michael Ratner Middle East Fellow at the Institute for Policy Studies (IPS), researching U.S. empire, borders and migration.",
    "And as Representative Fitzpatrick makes clear, they also want to send a message to China and other states that they consider hostile.",
    "Ultimately, increased U.S. militarism in Eastern Europe — as history has repeatedly made clear — will only make the situation worse.",
    "And could it be, perhaps, that this same U.S. militarism is a cause of rising tension in Eastern Europe, rather than its solution?",
    "“What’s the alternative?” asked retired Brigadier General and former Defense Attaché to Moscow Peter Zwack in an interview on NPR.",
    "In a crisis, the American public is often discouraged from asking questions — and when they do, militarism is usually the answer.",
    "And finally, the U.S. invaded once again in 2003, occupied Iraq after and maintains about 2,500 troops there to this day.",
    "It then imposed catastrophic economic sanctions on Iraq, which were responsible for the deaths of another million Iraqis.",
    "In Fitzpatrick’s account of the Iraqi invasion of Kuwait, the U.S. appears to be a bystander responding to Iraqi actions.",
    "Zwack’s prescription is ?“lethal weapons” — specifically Javelin anti-tank missiles and Stinger anti-aircraft missiles.",
    "Cherry-picking past examples of U.S. intervention excludes vital context and falls short of telling the whole story.",
    "The U.S. quickly shifted its supposed defense of Kuwait into its own invasion — Operation Desert Storm — of Iraq.",
    "It accompanied this policy with air patrols of Iraq, and bombed the country intermittently over the next decade.",
    "It would be wrong to minimize the potential devastation of a Russian invasion of Ukraine should one occur.",
    "?“We’ve had troops in the Eastern Flank countries for decades,” Press Secretary Jen Psaki replied.",
    "In that assault, the U.S. killed some 100,000 Iraqis and shattered the country.",
    "This post by Khury Petersen-Smith first appeared at Truthout?.org.",
    "But U.S. actions are raising tensions rather than resolving them.",
    "It also ignores that the story did not end with Desert Shield.",
    "And Ukraine should be no different.",
    "And the U.S. is delivering."
  ]
}