{
  "id": 370,
  "mediaId": 8469,
  "date": "2022-02-23",
  "headline": "Pennsylvania high court picks new map of US House districts",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2017/11/cropped-web1_22-TL-Logo.jpg.webp",
  "link": "https://www.timesleader.com/wire/state-wire/1541234/pennsylvania-high-court-picks-new-map-of-us-house-districts",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "By MARC LEVY and MARK SCOLFORO\nHARRISBURG, Pa. (AP) — Pennsylvania’s highest court broke a partisan deadlock Wednesday over a new map of congressional districts by selecting boundaries that broadly adhere to the outlines of current districts, even as the state loses one seat because of sluggish population growth.",
    "Pennsylvania’s national Republican committeeman, Andrew Reilly, said it was unfortunate that the court chose a map that combines two safe Republican districts into one, makes a suburban Pittsburgh seat friendlier for Democrats and was represented in part by the firm of a prominent Democratic lawyer, Marc Elias.",
    "It had some wins for Republicans and some wins for Democrats on a map whose stated aim was to adhere as closely as possible to districts drawn by the high court in 2018 to replace a six-year-old map it found to be unconstitutionally gerrymandered by Republicans.",
    "The new map provides eight Republican-leaning districts, six Democratic-leaning districts and three closely divided districts, according to an analysis by FiveThirtyEight, a website that focuses on opinion poll analysis, politics and other topics.",
    "It is unlikely to create a big shift in the makeup of the congressional delegation, , going from 18 to 17, to account for in census findings over the past decade, particularly in rural white areas predominantly represented by Republicans.",
    "“Despite that partisan choice, Pennsylvania Republicans will be ready to favorably compete in these districts to assist the National Republican Campaign Committee in taking back the U.S. House in November,” Reilly said in a statement.",
    "The swing districts are held by Allentown-area Democrat Susan Wild, Republican Brian Fitzpatrick of suburban Philadelphia’s Bucks County and suburban Pittsburgh Democrat Conor Lamb, who is not running for re-election.",
    "It lumps two Republican incumbents — Glenn Thompson and Fred Keller — into a sprawling northern district, and draws two Pittsburgh-area districts where there are no sitting incumbents running for another term.",
    "It ensures each Democratic incumbent has their own district and it keeps the metropolitan Harrisburg area in one district with York, instead of splitting it into several districts, as Republicans had sought.",
    "However, the court on Wednesday also issued an order that suspended the primary election calendar for state legislative candidates, because new state House and Senate maps are being challenged in court.",
    "The Democratic-majority state Supreme Court in a 4-3 decision a 17-district map that had been proposed by a group of Democratic-aligned voters who sued last year in an effort to get the court involved.",
    "It keeps the city of Pittsburgh in one district, helping maintain a competitive district for Republicans in its suburbs, and it keeps all of Bucks County in one district, helping protect Fitzpatrick.",
    "The court also adjusted the petition gathering schedule — starting this Friday going until March 15 — but left the May 17 primary date intact for congressional races and statewide contests.",
    "Nine of the districts were won by Democrat Joe Biden in 2020’s presidential election, according to an analysis by Redistricting & You, while Republican Donald Trump would have won eight.",
    "Pennsylvania’s delegation is currently split evenly, nine Republicans and nine Democrats, in a state where registered Democrats outnumber Republicans by 4 million to 3.4 million.",
    "Four of five Democrats on the court formed the majority in Wednesday’s decision, while one Democrat, Justice Debra Todd, sided with the court’s two Republicans in opposing it.",
    "Still, the map will put more pressure on Wild to get re-elected, drawing her new district to include conservative Carbon County.",
    "Follow Marc Levy on Twitter at https://www.twitter.com/timelywriter and Mark Scolforo at https://www.twitter.com/houseofbuddy.",
    "The court has selected boundaries twice before in the past three decades, and it’s decision is likely to be the final word, .",
    "Of the map’s Republican-leaning districts, one is held by a Democrat, Matt Cartwright in northeastern Pennsylvania.",
    "In picking the new map, the justices also rejected a lower court judge’s that Democrats had opposed.",
    "Tom Wolf, a Democrat, and the Republican-controlled Legislature deadlocked on a new plan.",
    "However, the map also sides with Democrats on certain aspects.",
    "It also pits two Republican incumbents against each other.",
    "The map sides with Republicans on two big issues.",
    "Initial Republican response was critical.",
    "The court after Gov."
  ]
}