{
  "id": 3735,
  "mediaId": 2553,
  "date": "2022-01-24",
  "headline": "Bipartisan Group Of Lawmakers Demand Pelosi Hold Vote On Stock Trading Bans",
  "image": "https://dw-wp-production.imgix.net/2022/01/Nancy-Pelosi.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/bipartisan-group-of-lawmakers-demand-pelosi-hold-vote-on-stock-trading-bans",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Rigolizzo",
  "authorUrl": "https://www.dailywire.com/author/john-rigolizzo",
  "termIds": [
    4923,
    5052,
    5381,
    3246,
    2746,
    4032,
    4066,
    1433
  ],
  "sentences": [
    "“Both of you have recently addressed this issue in public comments, but this glaring problem will not go away until it is fixed and Congress should not delay when we have the power to fix it.”\nThe members pointed out that the STOCK Act, which was passed in 2012, has been violated hundreds of times since just 2020 by everyone from members of Congress, to Congressional staffers, to federal officials like Biden Energy Secretary Jennifer Granholm, who broke the law nine times in 2021, as The Daily Wire reported.",
    "In a Monday letter to Pelosi and House Minority Leader Kevin McCarthy, 27 members of Congress, led by Democratic Maine Congressman Jared Golden, urged the leaders “to swiftly bring legislation to prohibit members of Congress from owning or trading stocks … to the House floor.”\nThe note specifically mentions the Ban Conflicted Trading Act and the TRUST in Congress Act.",
    "“In addition to ensuring that members’ access to information doesn’t advantage them over the public when trading stocks, as the STOCK Act sought, this would end the potential corruption of lawmakers pursuing policy outcomes that benefit their portfolios … Perhaps this means some of our colleagues will miss out on lucrative investment opportunities.",
    "The members also pointed to the insider trading scandal which broke in 2020, where a group of bipartisan Senators, including Republican Senators Richard Burr, David Purdue, Kelly Loeffler, and Democrat Dianne Feinstein, were all found to have bought or sold stock based on non-public information about the then-emerging COVID-19 pandemic.",
    "Those Senators did not violate the letter of the law, the members wrote, but because of the narrowness of the law and the ambiguity of the phrase “nonpublic knowledge,” it is extremely difficult to prosecute violators.",
    "A bipartisan group of lawmakers demanded that House Speaker Nancy Pelosi hold a vote on a number of bills that would ban members of Congress from holding and trading individual stock.",
    "“This common-sense, bipartisan legislation is unfortunately necessary in light of recent misconduct, and is supported by Americans across the political spectrum,” the letter said.",
    "We came to Congress to serve our country, not turn a quick buck.” The members also pointed out that fully 76% of voters disapprove of Congress being able to trade stocks.",
    "“Instead, Congress should close these loopholes by simply banning members from owning or trading individual stocks while in office,” the letter said.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "“Instead, we view the emergence of multiple bipartisan bills on this issue as a sign of broad rank-and-file support for it across Congress.",
    "Let’s get this done.”\nThe letter was co-signed by 24 other Democrats, including Rep. Rashida Tlaib (MI) and Rep. Pramila Jayapal (WA).",
    "The members acknowledged that multiple bills had been authored by members of Congress from both parties and introduced in the House.",
    "Good-faith differences of opinion between members on the details of this legislation can be resolved through an amendment process.",
    "Republican Pennsylvania Congressman Brian Fitzpatrick and Florida Representative Matt Gaetz joined the Democrats signing the bill.",
    "“However, handwringing over which bill to advance should be no excuse for stalling a House floor vote on this issue,” they wrote.",
    "While there are many difficult questions facing Congress, this is an easy one.",
    "Members of Congress should not be allowed to own or trade individual stocks.",
    "Get inside access to The Daily Wire by becoming a member.",
    "We don’t care."
  ]
}