{
  "id": 402,
  "mediaId": 2548,
  "date": "2022-02-24",
  "headline": "China Sends More Planes Over Taiwan, Says Island ‘Is Not Ukraine’",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/02/pla-jet-scaled-e1645717648814.jpg",
  "link": "https://dailycaller.com/2022/02/24/china-planes-taiwan-ukraine-invasion/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Ginsberg",
  "authorUrl": "https://dailycaller.com/author/michael.b.ginsberg1998@gmail.com",
  "termIds": [
    0
  ],
  "sentences": [
    "After President Joe Biden claimed that NATO allies might “fight about what to do” in the case of a “minor incursion” into Ukraine, Republican Wisconsin Rep. Mike Gallagher said in January that the president’s rhetoric “invites major incursions in Ukraine, Taiwan, and around the world.”\nChinese Foreign Ministry spokeswoman Hua Chunying downplayed similarities between the two situations Wednesday.",
    "Taiwanese President Tsai Ing-wen has expressed support for Ukraine, saying in late January that Taiwan “empathize[s] with Ukraine’s situation” since it “has faced military threats and intimidation from China for a long time.” Ukraine does not recognize Taiwan as a separate country, officially holding to the One-China Policy since 1992.",
    "China flew nine People’s Liberation Army planes over Taiwan on Thursday, the National Defense Ministry announced, in an apparent test of the resolve of both the island nation and its Western supporters amid the Russian invasion of Ukraine.",
    "(RELATED: Taiwan ‘On Alert’ After Record Number Of Chinese Planes Enter Airspace, Warns Of ‘Catastrophic’ Consequences If Its Democracy Falls)\n9 PLA aircraft (Y-8 RECCE and J-16*8) entered #Taiwan’s southwest ADIZ on February 24, 2022.",
    "(@MoNDefense) February 24, 2022\nTaiwan increased its military spending by nearly $9 billion over the five-year period beginning in 2022, over a 2022 base spending amount of about $16.7 billion.",
    "He claimed in a Monday speech that Ukraine “was created by Vladimir Lenin” and that the Soviet Union was forced into “giving [it] away” after the Russian Civil War.",
    "Republican Pennsylvania Rep. Brian Fitzpatrick described both countries as “scared to death” in September 2021, shortly after the terrorist group took Kabul.",
    "This is an indisputable legal and historical fact.”\nRussian President Vladimir Putin has made similar comments about the history of Ukraine.",
    "Putin frequently refers to this revisionist account of eastern European history when justifying Russian military actions against Ukraine.",
    "Many observers have drawn parallels between the fates of Ukraine and Taiwan, particularly after the fall of Afghanistan to the Taliban.",
    "Please check our official website for more information: https://t.co/Uz6XjMcLc8 pic.twitter.com/W4OIgYQ7HS\n— ???",
    "They dreamt of a world revolution that would wipe out national states,” he wrote in a July 2021 essay.",
    "The country plans to use the extra funds on cruise missiles and stealth warships, Reuters reported.",
    "“The Bolsheviks treated the Russian people as inexhaustible material for their social experiments.",
    "“Taiwan is not Ukraine,” she said, according to Reuters.",
    "“One fact is crystal clear: Russia was robbed, indeed.”",
    "“Taiwan has always been an inalienable part of China.",
    "Ministry of National Defense, R.O.C.",
    "????"
  ]
}