{
  "id": 4443,
  "mediaId": 2547,
  "date": "2022-01-21",
  "headline": "Witness Ties Flynn Allies To Election Audit Extortion Plot",
  "image": "https://crooksandliars.com/files/embeds/2022/01/48892.jpg",
  "link": "https://crooksandliars.com/2022/01/witness-ties-flynn-allies-election-audit",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susie Madrak",
  "authorUrl": "https://crooksandliars.com/team/susie-madrak",
  "termIds": [
    5207,
    4286,
    2751,
    3942,
    474,
    1489,
    6506
  ],
  "sentences": [
    "Stern, who runs the intelligence firm Tactical Rabbit and is a Republican vying for a Senate seat in Pennsylvania, in multiple interviews with the Guardian said two Flynn associates with the rightwing Patriot Caucus group enlisted his help in April in a scheme to seek potentially damaging information on two Republican members of Congress to prod them to back an audit of the 2020 vote that Joe Biden won.",
    "Via The Guardian:\nFBI agents and the House panel investigating the January 6 attack on the Capitol have both learned of an alleged plan by allies of retired army Lt Gen Michael Flynn to gather “intelligence” on top Republicans to “move” them to back election audits in key states Trump lost, said ex-whistleblower Everett Stern who talked to the panel and the FBI.",
    "Stern told the Guardian he spent several hours in November telling House panel investigators about the alleged drive by Flynn associates who sought campaign finance and other dirt on Pennsylvania’s Senator Pat Toomey and Congressman Brian Fitzpatrick to win their support for an audit to bolster Trump’s debunked charges that Biden’s win was fraudulent.",
    "While Fitzpatrick and Toomey were the main “targets” Stern said other Pennsylvania officials including judges were also being targeted by the Flynn allies as they sought to ramp up pressure for an audit in the state.",
    "If proven, GOP Senate candidate Everett Stern is confirming what we've suspected since Trump came onto the political scene -- which is that he and his minions will use any means necessary to get what he wants.",
    "Now, the Jan. 6th committee will have to investigate how closely Flynn, and thus Trump, was involved.",
    "Let's use plain language here: We're talking about alleged extortion.",
    "Is that what we call attempted extortion these days?",
    "I don't think it will be difficult.",
    "We shouldn't tiptoe around this.",
    "\"Win their support\"?",
    "\"Prod\" them?",
    "Blackmail.",
    "Topics:"
  ]
}