{
  "id": 4467,
  "mediaId": 2658,
  "date": "2022-01-03",
  "headline": "Pelosi aide joins theGROUP",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/01/03/pelosi-aide-joins-thegroup-799639",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    5237,
    5695,
    3664,
    4210,
    3246,
    392,
    387,
    6709
  ],
  "sentences": [
    "Mike Lee, James Lankford)\nNew PACs\nAgenda PAC (Super PAC)\nBlackcopsmatter:independentpolicinginthehoods (Super PAC)\nFree America Now (Super PAC)\nGOP Wagon (Super PAC)\nMcGowan Victory Fund (Super PAC)\nProgressive PAC (Leadership PAC: Ted Lieu)\nReset DC (Super PAC)\nRISEUP (PAC)\nTake Back Arizona PAC (Leadership PAC: Blake Masters)\nTake Back AZ-04 Republican Nominee Fund 2022 (PAC)\nTake Back AZ-06 Republican Nominee Fund 2022 (PAC)\nTake Back CA-09 Republican Nominee Fund 2022 (PAC)\nTake Back CA-13 Republican Nominee Fund 2022 (PAC)\nTake Back CA-47 Republican Nominee Fund 2022 (PAC)\nTake Back GA-02 Republican Nominee Fund 2022 (PAC)\nTake Back MI-07 Republican Nominee Fund 2022 (PAC)\nTake Back MI-10 Republican Nominee Fund 2022 (PAC)\nTake Back MT-01 Republican Nominee Fund 2022 (PAC)\nTake Back NV-01 Republican Nominee Fund 2022 (PAC)\nTake Back OH-09 Republican Nominee Fund 2022 (PAC)\nYACHAD PAC (Super PAC)\nNew Lobbying Registrations\nAkin, Gump, Strauss, Hauer & Feld: Abiomed, Inc.\nAkin, Gump, Strauss, Hauer & Feld: Mamed Salmanov\nAkin, Gump, Strauss, Hauer & Feld: Trade Alliance For Health\nAsset & Equity Corporation: Pinnacle Armor Company\nBarbara Burchett: Superior Handforge\nBarbara Burchett: Tst Inc\nBlue Star Strategies LLC: Qpartners, LLC\nDentons US LLP: Town Center Cid\nFaegre Drinker Biddle & Reath LLP: Verde Environmental Technologies, Inc.\nFgh Holdings, LLC (Formerly Known As The Glover Park Group LLC): Saleen Motors International\nForbes-Tate: Gl Homes\nFulcrum Public Affairs LLC: Dailypay Inc.\nFulcrum Public Affairs LLC: Newity LLC\nFulcrum Public Affairs LLC: Policy Solutions LLC\nInvariant LLC: National Veterinary Associates\nK&L Gates, LLP: Solarcode LLC\nKountoupes Denham Carr & Reid, LLC: Hess Corporation\nMcb Consulting, Inc.: Envision Strategy, LLC On Behalf Of Afff Litigation Corporation\nMcb Consulting, Inc.: Envision Strategy On Behalf Of Healthcare Association Of New York State, Inc.\nMcdermott+Consulting LLC: At-Home Covid Testing (Act) Coalition\nNate: The Communications Infrastructure Contractors Association: Nate: The Communications Infrastructure Contractors Association\nPaul Marcone & Associates, LLC: Genesis At The Crossroads\nRicchetti Incorporated: Medigen Vaccine Biologics Corp.\nRich Feuer Anderson: Chime Financial Inc.\nSchaerr Jaffe LLP: Airline Employees For Health Freedom\nShumaker Advisors Florida, LLC: Tampa Bay Performing Arts Foundation, Inc.\nStrategies 360: Rosenthal And Associates (On Behalf Of Delaware North Companies, Inc.)\nTaft Stettinius & Hollister LLP Dba Taft Advisors LLC Fka (Taft, Stettinius & Hollister, LLP): Woolpert\nTeach Plus, Inc.: Teach Plus, Inc.\nThorn Run Partners: Contra Costa County\nThorn Run Partners: Golden Gate Bridge, Highway And Transportation District\nVenable LLP: Fifth Third Bank\nVitello Consulting: Vivenns, LLC\nWestmoreland160, LLC: Secure Communication Systems Dba Benchmark Secure Technology\nNew Lobbying Terminations\n10-Square Solutions: Boston Scientific Corporation\n10-Square Solutions: Johnson & Johnson Services, Inc.\n10-Square Solutions: Microsoft Corporation\n10-Square Solutions: T-Mobile\nB'Tselem USa: B'Tselem USa\nCarmen & Muss, P.L.L.C.",
    "The companies have also told lawmakers whose districts are home to Amazon warehouses and Google data centers that the legislation could lessen their voters’ job opportunities, according to two congressional aides, who spoke on the condition of anonymity to speak candidly.”\n— The effort appears to have had some degree of success: “A House member whose district includes a Google data center is hesitating on supporting the antitrust legislation after the lawmaker’s office received similar objections from the local chamber of commerce, one of the congressional aides said.”\nSOUTH KOREAN CHIPMAKERS LOOK FOR A LOBBYING FOOTHOLD IN DC: Samsung, Hyundai, SK Group and LG, South Korea’s largest semiconductor conglomerates, are among the country’s chipmakers boosting their lobbying efforts in the U.S. in an effort to win “critical export licences to supply Chinese companies targeted by trade sanctions” and amid pressure from Washington to shift chip and electric battery manufacturing into the U.S., the Financial Times’ Song Jung-a reports.",
    "The submission alleges that Public Integrity Section Principal Deputy Chief John Keller acted unethically by negotiating a plea deal for her last year with Davis’ attorney at the time, Abbe Lowell, while Keller was investigating Lowell in a separate inquiry into what a judge called a ‘bribery for pardon’ probe.”\n— “The allegations in the complaint raise questions about whether Davis understood important aspects of her predicament in August 2020 when she pleaded guilty in a Hawaii federal court to aiding and abetting violations of the Foreign Agents Registration Act,” but they could also “pose complications for a related, higher-profile prosecution against Prakazrel ‘Pras’ Michel — a well-known rapper and member of the Fugees, a legendary hip-hop trio.” Michel was indicted on campaign finance charges in 2019 but last June a grand jury in Washington returned a new indictment accusing him of taking part in the same unregistered lobbying effort as Davis and former RNC deputy finance chair Elliot Broidy.",
    "HOW BIG TECH IS WORKING TO THWART ANTITRUST BILLS: “Amazon and Google are mobilizing a powerful force to counter Congress’ increasing appetite for corporate trust-busting,” POLITICO’s Emily Birnbaum writes: “the throngs of business owners and ordinary users who have made the tech giants a part of their daily lives.”\n— “The campaign, carried out by petitions, email blasts and Zoom calls, seeks to reverse the usual David-vs.-Goliath portrayal of Washington’s antitrust debates — pushing the narrative that two of the world’s wealthiest corporations are on the sides of the underdogs.”\n— “The antitrust bills’ supporters accuse the tech giants of spreading baseless fears and stoking small businesses’ anxieties to blunt the growing anti-monopoly momentum in Congress.",
    "— “Jorge is a valued and accomplished professional whose political and communications expertise will enhance the firm’s services to our corporate, non-profit and foreign government clientele,” Art Collins, the firm’s founder and managing partner, said in a statement, adding that Aguilar’s previous work “hand-in-hand with senior elected and appointed officials on a broad range of issues” will add “immediate value as we serve as trusted advisors to our clients.”\nGood afternoon and welcome to the first PI of 2022.",
    "But the effort shows that the companies’ networks of data centers, warehouses, business partnerships and legions of users have given Amazon and Google a huge number of potential allies in their showdown with Washington.”\n— Emily reports that “two members of Congress, who requested anonymity to speak about a divisive topic, said they have been inundated with calls and emails from entrepreneurs who heard Amazon’s warnings that the legislation might force it to shut down its platform for sellers.",
    "He’ll also “leverage his communications expertise and reach to achieve meaningful results for the firm’s clients.”\n— The firm, whose lobbyists count President Joe Biden, the late Senate Democratic leader Harry Reid, congressman-turned-White House aide Cedric Richmond and now-HHS Secretary Xavier Becerra as former bosses, is one of a handful of K Street with ties to Biden that has seen business boom since last year’s election.",
    "So they need to hire more former US officials as their lobbyists.”\nIF YOU MISSED IT OVER THE BREAK: “A new legal ethics complaint from a businesswoman charged in a prosecution involving unregistered foreign lobbying threatens to roil two major cases in the Justice Department’s high-profile effort to crack down on foreign influence in the U.S. political system,” POLITICO’s Josh Gerstein reports.",
    "— “We are trying to hire Americans with connections to Washington as we need to strengthen networking with the US government and Capitol Hill,” an executive at LG Energy Solution told FT. Kim Young-woo, an analyst at SK Securities, told the outlet that “Korean chipmakers now have to deal with the commerce department and Pentagon more often to discuss security concerns.",
    "— The top corporate donors to election objectors last year were Boeing, Koch Industries, American Crystal Sugar, General Dynamics and Valero Energy, the report found, though of those only Boeing and Valero suspended PAC donations after the insurrection, while the Koch political network said it would “weigh heavy” lawmakers’ actions in the insurrection.",
    "— A separate analysis by the watchdog group Accountable.US, first reported by CNBC’s Brian Schwartz, examines the public statements of 30 Fortune 500 companies and major trade groups in the days following the insurrection compared with their contributions — and found the companies and trade groups still donated over $8.1 million to election objectors.",
    "— Citizens for Responsibility and Ethics in Washington found that more than 717 corporations and trade groups gave more than $18 million to nearly every one of the 147 members of Congress who voted against certifying Biden’s presidential win after the insurrection, as well as to House and Senate Republicans’ campaign arms.",
    "CHECKING IN: Coming up on a year since the deadly insurrection at the Capitol, several watchdog groups are out today with analyses taking stock of corporate America’s pledges to pull back on political contributions, either to Republican members who objected to the 2020 election results or to federal lawmakers altogether.",
    ": Centre Market Building, LLC\nGray Global Advisors, LLC: Exacter Inc.\nMarshall Brachman: Cardiovascular Associates Of The Delaware Valley\nMosaic: Mosaic\nMr. Toby Myerson: Tencent America LLC\nSapphire Strategies, LLC: Morrissey Strategic Partners\nThe Jbh Group, LLC: Everytown For Gun Safety Action Fund\nFollow Us",
    "Not all of those were part of the group that pledged to freeze donations — but companies who did make those pledges gave $2.4 million directly to those members’ campaigns and leadership PACs through November of last year (campaign finance data for December will not be available until later this month).",
    "The company also had to reimburse General Motors after a costly electric vehicle recall over battery flaws.”\n— “The Korean groups are seeking export licences to supply US-blacklisted Chinese companies, including technology group Huawei and chipmaker Semiconductor Manufacturing International Corp.",
    "Pelosi aide joins theGROUP\nBy CAITLIN OPRYSKO\n01/03/2022 03:47 PM EST\nWith Daniel Lippman\nTheGROUP ADDS ANOTHER WELL-CONNECTED DEMOCRAT: Jorge Aguilar has joined theGROUP D.C. as a principal, giving the firm another Democrat with ties to the upper echelons of power in Washington.",
    "Corporate giving to most of those lawmakers last year was down 60 percent since 2019, Popular Information’s Judd Legum reports, even as the party as a whole has begun outraising Democrats and fundraising will really begin to pick up in earnest throughout this year.",
    "— Still, as PI reported last year, a recent survey found that nearly half of corporate PACs have changed their criteria for political donations since the insurrection, with more than 80 percent of corporate PACs suspending political contributions in the aftermath.",
    "— “LG will open a lobbying office in Washington next year, after its battery-making unit LG Energy Solution was embroiled in a multibillion-dollar legal dispute with domestic rival SK Innovation that threatened to disrupt Ford’s electric car plans in the US.",
    "It brought in over $5 million through the first nine months of 2021, compared with $3.6 million in all of 2020, and has added a number of big-name clients to its roster since the election, including Intuit, Pfizer and the American Health Care Association.",
    "New Joint Fundraisers\nNittany-Buckeye Joint Committee (Reps. Brian Fitzpatrick, Brad Wenstrup, BRINGING AMERICA TOGETHER PAC, BUILDING AND RESTORING THE AMERICAN DREAM FUND)\nWinning Red Committee (Sens.",
    "Perhaps unsurprisingly, House Minority Leader Kevin McCarthy, who could become speaker if Republicans retake the House this fall, was the top fundraiser among election objectors.",
    "— Aguilar will advise clients on how to navigate “the intricacies of the Democratic Caucus in Congress and key stakeholder organizations,” according to the firm.",
    "Aguilar has spent nearly a decade working for House Speaker Nancy Pelosi, most recently serving as the executive director for Pelosi’s campaign committee.",
    "Send me your tips, your New Year’s resolutions and your advice on what to make with the new sous vide I got for Christmas: coprysko@politico.com.",
    "— “The complaint was filed with the Justice Department last month on behalf of Nickie Lum Davis, a Hawaii- and California-based businesswoman.",
    "The US commerce department had granted more than $103 billion in export licences to Huawei and SMIC from November 9 2020 to April 2021.",
    "— Anna Ashton will be senior fellow for Asia Pacific trade, investment and innovation at the Asia Society Policy Institute.",
    "— Charlotte Clay has been promoted to be director of marketing and communications at the D.C.-based Museum of the Bible.",
    "Jobs Report\n— Samantha (Tartas) Seitz has been promoted to be manager for North America PR at Boston Consulting Group.",
    "— Anne-Marie Wieland D'Angelo is now chief legal and government affairs officer at Molson Coors Beverage Company.",
    "He previously led government relations and market entry strategy for the Americas and Asia Pacific at Lime.",
    "She most recently was client service leader and government relations director at Barge Design Solutions.",
    "SoftBank has also promoted Jeff Dressler, Emily Christy and Christin Baker to the position of partner.",
    "She most recently was executive vice president, general counsel and corporate secretary at NiSource.",
    "He previously was a legislative representative at the American Federation of Government Employees.",
    "— Natalie Knight is now director of state and local government relations at Impact Public Affairs.",
    "She previously led U.S. government relations for Zoom, and is a Lyft and Obama White House alum.",
    "— Matt Sowards is now a legislative representative at the National Treasury Employees Union.",
    "She previously was vice president of government affairs at the U.S.-China Business Council.",
    "— Amena Ross is joining Block (formerly Square) as head of policy for the Cash app.",
    "Caroline Rourke is joining the ONE Campaign as senior communications coordinator.",
    "— Lauren Belive is joining SoftBank Group as a director of government affairs.",
    "She previously was deputy chief of staff for Rep. Lauren Underwood (D-Ill.).",
    "— Sam Sadle is now senior director of North America public policy at Sonder.",
    "— Kirsten Hartman West is now a principal of public affairs at Cornerstone.",
    "She most recently was at the Association for Community Affiliated Plans.",
    "She previously was chief of staff for Rep. Al Green (D-Texas).",
    "She most recently was lead for North America PR at the firm.",
    "She most recently was media relations manager at the museum.",
    "— Tom Hart will become president of the ONE Campaign.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "He most recently was acting CEO.",
    "What’d I miss?"
  ]
}