{
  "id": 7712,
  "mediaId": 2700,
  "date": "2022-04-05",
  "headline": "Guest commentary: Reliable, affordable energy supply and a carbon-free future are all possible for the U.S.",
  "image": "https://www.denverpost.com/wp-content/uploads/2021/12/TDP-L-OILGAS_845.jpg?w=1024&h=683",
  "link": "https://www.denverpost.com/2022/04/05/gas-prices-oil-production-russia-climate-change/",
  "mediaOutlet": "The Denver Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "L. Roger Hutson",
  "authorUrl": "https://www.denverpost.com/author/l-roger-huston/",
  "termIds": [
    1939,
    5510,
    5455,
    5051,
    5168,
    6709,
    6678,
    6672,
    6245
  ],
  "sentences": [
    "Given the turmoil in Ukraine and the fickle nature of the globe’s other major oil producers, like those in the Middle East, there’s only\none realistic way of balancing those three requirements: an “all-in” strategy that replaces dirty energy imports with cleaner domestic and allied production on the way to a carbon-free energy future.",
    "Critics will bristle at the notion of tapping new oil and gas resources at a time when many want to steer the economy toward new sources of power, but the truth is that American hydrocarbons are produced in ways that promise to be much less destructive for the planet than at competing facilities elsewhere\naround the globe.",
    "Roger Hutson is a co-chair of No Labels Colorado, a board member of Colorado Concern and the CEO of HRM Resources III, LLC\nTo send a letter to the editor about this article, submit online or check out our guidelines for how to submit by email or mail.",
    "The White House appears to be working to resuscitate the deeply misguided deal the Obama administration cut with Tehran to end economic sanctions in return for something less than a complete dismantling of their nuclear and terror-supporting regimes.",
    "The only reasonable solution here is to replace dirty foreign sources of oil and gas with much cleaner sources from our close allies and within our own borders, and simultaneously ramp up solar and wind energy in the months and years to come.",
    "Lisa Murkowski, R-Arkansas, and Joe Manchin, D-W.V., and Colorado’s own John Hickenlooper and Michael Bennet worked with the bipartisan House Problem Solvers Caucus to write\nlegislation curtailing imports to the United States.",
    "Others, mainly on the left, are looking to take advantage of the high prices to wean the world from oil, even when there’s no feasible way to make the switch to emission-free energy sources overnight.",
    "For all the swirl of competing interests that dominate debates about energy markets, national security, climate, and the future, there’s really little debate about the proper way forward.",
    "It begins by ensuring that the White House is precluded from making these decisions unilaterally–Congress, with its diversity of voices and perspectives, needs to play a prominent role.",
    "America has the resources, the know-how, and the technology both to free the democratic world from its dependence on unreliable partners and to steer us toward a carbon-neutral future.",
    "Some right-wing cable hosts have suggested that the U.S. let Russia steamroll our allies in Ukraine, an outcome that would surely ease any disruption in global energy markets.",
    "And, of course, the U.S. could purchase Iranian oil only if we lifted the embargo imposed to discourage Tehran from subsidizing global terrorism and pursuing nuclear weapons.",
    "A bipartisan coalition led by Reps. Josh Gottheimer, ?D-N.J., and Brian Fitzpatrick, R-Penn., is mobilizing to ensure the federal government drives a hard bargain with Iran.",
    "Finally, and equally important, America needs to continue to invest in building up “green” energy alternatives, from wind, to solar, to even nuclear power generation.",
    "America’s energy demands can be separated into three separate elements: a reliable supply, reasonable prices, and an aggressive strategy combating climate change.",
    "The only question now is whether Washington will accept the truth and act to forge a path forward, or otherwise prevent the free world from seizing the future.",
    "And if we did those things, we would avoid having to replace\nRussian energy resources with oil and gas from other autocracies such as Venezuela and Iran.",
    "Initially, the Biden administration was so concerned about gas prices that they demurred in taking a hard stand against Russian energy exports.",
    "Much as America may desire more energy, the White House should not commit us to a deal that would undermine our national security.",
    "But because we can’t get to a carbon-free reality overnight, we need also to ramp up domestic oil and gas production and refining.",
    "That will require congressional leaders on both sides of the aisle to negotiate and compromise in good faith.",
    "In other words, Washington would have to enter into a devil’s bargain that could strengthen the ayatollahs.",
    "Fortunately, a growing cadre of real problem solvers is emerging on Capitol Hill to do exactly that.",
    "Next, we need to be very wary of letting one autocratic dictator push us to get cozy with another.",
    "The question is whether Washington is capable of taking the first steps in the right direction.",
    "America can be strong abroad and secure at home, but to get there, we need balance and wisdom.",
    "Purchasing Venezuelan oil would prop up the country’s dictatorial president, Nicolas Maduro.",
    "Already, our leaders’ propensity to fight rather than fix threatens to get in the way.",
    "But an American failure to stand up to Putin\nwould be morally repugnant.",
    "Fortunately, once again, Congress is poised to step in.",
    "This isn’t an opinion or an aspiration–it’s a fact.",
    "The good news is that we are capable of doing both.",
    "So how to weigh these competing priorities?",
    "The White House subsequently acquiesced.",
    "Already this is happening.",
    "But Sens."
  ]
}