{
  "id": 4353,
  "mediaId": 8347,
  "date": "2022-01-27",
  "headline": "Arizona utility regulators again reject clean energy rules",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/ceac3a6/2147483647/strip/true/crop/3675x1929+0+260/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F08%2F50%2F5cb59e8b4bf885f99421cebd3cc6%2Fs116009364.JPG",
  "link": "https://www.kgun9.com/news/local-news/arizona-utility-regulators-again-reject-clean-energy-rules",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.kgun9.com/associated-press",
  "termIds": [
    0
  ],
  "sentences": [
    "“They really have put politics ahead of good energy policy, and certainly ahead of clean energy and doing what we need to do to address climate change.”\nRepublican Commissioner Justin Olson said he opposed the new rules because they could cost ratepayers at the state’s two largest utilities more than $5 billion, pointing to a report prepared for the commission.",
    "PHOENIX (AP) — Arizona’s utility regulators have rejected new rules that would have drastically boosted the use of renewable energy for the second time in a year, drawing sharp reaction from clean energy advocates who said the decision leaves the state far behind what is needed to address climate change.",
    "“I have sought to honor this pledge with each of my votes at the Commission and today’s vote was no exception.” Bahr said Olson is just wrong and that other reviews found savings from energy efficiency and switching from fossil fuels to renewable power would save ratepayers $2 billion.",
    "The three Republicans on the five-member Arizona Corporation Commission joined to defeat the new standards, which were the result of months of hearings and negotiations and were backed by the state’s utilities, large and small businesses, environmental groups, and even faith leaders.",
    "They require utilities to get at least 15% of their electricity from renewable energy sources by 2025, although the state’s APS and Tucson Electric Power have announced voluntary plans to vastly increase their use of renewable energy and cut carbon emissions tied to climate change.",
    "They also won’t have to follow other parts of the rejected rules, including giving the commission power to undertake robust reviews of utilities’ long-term plans for new power plants and other investments and approve or reject them.",
    "The utility, which supplies power to 1.1 million residential and commercial customers in 13 of 15 Arizona counties, will continue to rely on the Palo Verde Nuclear Generating Station west of Phoenix for about 25% of its power.",
    "“When I ran for the Commission, I promised to pursue policies that will lead to the lowest rates possible while still maintaining safe and reliable services,” Olson said in a statement.",
    "Also in the package were increased requirements for utilities to pay to boost energy efficiency to cut power demand and rules increasing battery storage for rooftop solar installations.",
    "APS announced in January 2020 that it plans to get all its power from non-carbon emitting sources by 2050 and plans to end the use of coal-fired power plants by 2031.",
    "It will add utility-scale solar power plants, greatly increase battery storage, and expects homeowners to add more rooftop solar panels to supply electricity.",
    "And siting decisions for new renewable energy plants would have to favor communities where coal plants are or plan to be shuttered, a boon for Arizona tribes.",
    "The state’s largest utility, Arizona Public Service, said it would stick to its vow to have 100% clean power by 2050 despite the rules package being defeated.",
    "The proposed rules would have required the state’s utilities to get 50% of their power from sources that do not emit carbon dioxide by 2035 and 100% by 2070.",
    "“So they can’t make themselves do the right thing on clean energy,” said Sandy Bahr, director of the Sierra Club’s Grand Canyon chapter.",
    "Tucson Electric Power vowed in 2020 to retire its coal plants by 2032 and get more than 70% of its power from solar and wind by 2035.",
    "“We recognize that clean, reliable, and affordable energy is essential to Arizona’s future,” the company said in a statement.",
    "Republican Commissioner Jim O’Conner had backed the same rules package last fall and changed his mind on Wednesday.",
    "The decision means to Arizona utilities will only be held to the renewable energy standards adopted in 2006.",
    "Without the new rules, APS and other regulated utilities won’t have to boost spending on energy efficiency.",
    "Utility-scale solar plants, for instance, now produce cheaper power than legacy coal-fired power plants.",
    "Its goal is to reduce carbon emissions, which are tied to climate change, by more than 70% by 2035.",
    "The regulations the commission declined to adopt last May mandated 100% clean power by 2050.",
    "----\nSTAY IN TOUCH WITH US ANYTIME, ANYWHERE\n(Copyright 2022 The Associated Press.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "All rights reserved."
  ]
}