{
  "id": 1022,
  "mediaId": 237,
  "date": "1/13/2022 12:00:00 AM",
  "headline": "Top GOP official in Michigan aiding Trump's bid to install loyalists in Lansing",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/925191.png",
  "link": "https://www.washingtonexaminer.com/news/top-gop-official-in-michigan-aiding-trumps-bid-to-install-loyalists-in-lansing",
  "sentiment": "-0.459",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-m-drucker",
  "termIds": [
    1147,
    1844,
    1939,
    146,
    308,
    428,
    2645,
    2748,
    2791
  ],
  "sentences": [
    "Imagine a man so caring that he not only stops to sign his endorsement, sends it to me to give to a candidate AND draws a sharpie [heart symbol] on the outside of the envelope,? Maddock wrote in the post showing the Save America press release signed by Trump and its envelope.",
    "They say Maddock is searching out candidates who back Trump's unsupported claim that the 2020 contest was stolen  working against Republicans who oppose the former president and loyal soldiers who may disagree with him on one glaring issue: the outcome of the last election.",
    "On Jan. 3, Michigan Republican Party co-Chairman Meshawn Maddock proudly posted on Facebook a picture of the handwritten note she received from former President Donald Trump announcing his support for yet another candidate running for a seat in the state Legislature.",
    "Meshawn Maddock posted a picture of the note on Facebook Nov. 11, adding: Thank you Mr. President, we won't let you down.?\nMaddock's apparent self-interest is not all that rankles Michigan Republicans who are unhappy she is collaborating with Trump on endorsements.",
    "I am happy that he continues to be engaged and in good spirits because there's a lot of work to be done to elect more Republicans up and down the ballot.?\nRepublican insiders in Michigan emphasize Maddock is doing far more than offering Trump advice.",
    "There, top GOP leaders who otherwise back the 45th president also rejected his election fraud allegations and resisted his attempts to use the Legislature to overturn the outcome of a 2020 contest President Joe Biden won by 2.8 percentage points.",
    "In addition to a formal candidate-vetting process run by the 45th president's top political aides, he constantly talks to a range of informal advisers and supporters around the country and uses their feedback to decide who to support.",
    "Let's Go [heart symbol].?\nTrump has been more active in endorsing Republicans running for office down-ballot in Michigan, especially candidates vying for a seat in the Legislature (at least nine so far) than perhaps any other state.",
    "Maddock's critics argue her actions are as much a scheme to elect her husband as speaker of the Michigan House of Representatives as they are about boosting institutional support for Trump in Lansing, the state capital.",
    "Everybody talks about it, but no one has confidence that [Michigan Republican Party Chairman Ron Weiser] or anyone is going to do anything about it,? said a veteran Republican strategist in the state.",
    "Last year, the Michigan GOP's second-in-command brought Trump a series of 2022 candidates to consider endorsing that he or anyone in his position could not possibly be expected to know.",
    "Also, you have a great wife,? the former president told him in a handwritten note scribbled on top of a printout of a Detroit News article about his ambitions for the speakership.",
    "Her key role in the former president's aggressive intervention in GOP politics in the Midwestern battleground is splintering Michigan Republicans and roiling the state party.",
    "She has provided several suggested endorsements, and the president has carefully considered them,? added a Republican operative familiar with Trump's involvement in Michigan.",
    "Meshawn is definitely in his ear and telling him who her favorites are,? said Jason Roe, a Republican strategist in Michigan and former executive director of the state GOP.",
    "Maddock, a fan of Republican gubernatorial contender James Craig, was in the room with the retired Detroit police chief when he met Trump to pitch an endorsement.",
    "Ambitious Republicans make the pilgrimage to Mar-a-Lago, the former president's social club and winter residence in Palm Beach, Florida, to ask for his support.",
    "A spokesman for the Michigan Republican Party said Wednesday that Maddock was under the weather? and unavailable to speak with the Washington Examiner directly.",
    "Throughout, Maddock has been his sherpa,? more than a half-dozen knowledgeable Republican operatives in Michigan and Trump's orbit told the Washington Examiner.",
    "In the contest to pick a GOP nominee for attorney general, Republicans say Maddock preferred Tom Leonard, who happens to be the consensus establishment choice.",
    "And, they grumble her actions have provoked avoidable dissension in the ranks and general frustration  especially among the Republicans Trump spurned.",
    "Or, in the summer months, they make the trip to his golf club in Bedminster, New Jersey, to meet with him and ask for his support in primaries.",
    "Maddock is not operating quietly, either, as revealed in the Jan. 3 Facebook missive celebrating Trump's Dec. 16 endorsement of Mike Hoadley.",
    "They claim the candidates she presents to the former president are sometimes of marginal quality, possibly jeopardizing GOP gains this fall.",
    "But in a prepared statement, she acknowledged advising Trump on Michigan candidates and said his endorsements boost efforts to oust Gov.",
    "Once the endorsement is granted, Save America, Trump's political action committee, cuts a check for the candidate.",
    "There's actually infighting with the Trump movement right now,? added a second GOP operative based in Michigan.",
    "The former president has also endorsed candidates in GOP primaries for attorney general and secretary of state.",
    "Those choices sometimes contradict the advice that surfaces from the candidate vetting conducted by his team.",
    "Maddock did not address complaints about her choosing sides in primaries or the GOP infighting it sparked.",
    "There's a whole fight going on over who's Trumpier.?\nGranted, Trump does not always listen to Maddock.",
    "The president and I often talk about politics and about winning this year and beyond,? Maddock said.",
    "The former president was not impressed, and he has still not backed a candidate in this primary.",
    "As such, he often asks for my advice as an individual which I'm always happy to give.",
    "The process can be a bit unwieldy, as are many aspects of Trump's decision-making.",
    "Matt Maddock, a sitting state representative, was endorsed by Trump in November.",
    "As a senior party official, Maddock is supposed to remain neutral in primaries.",
    "President Trump is VERY excited about elections in Michigan, so am I!",
    "I have a good relationship with President Trump and I'm proud of it.",
    "Gretchen Whitmer and other Democrats seeking reelection.",
    "Trump is regularly inundated with endorsement requests.",
    "Trump endorsed attorney Matthew DePerno.",
    "Matt, I am with you all the way."
  ]
}