[
  {
    "id": 932,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "The complete poll results:\n<span class='selected-term'>Mehmet Oz</span>: 27.4%\nDavid McCormick: 15.9%\nCarla Sands: 14.8%\nKathy Barnette: 8.9%\nJeff Bartos: 6.6%\nSean Gale: 1.9%\nGeorge Bochetto: 1.6%\nEverett Stern: 1.5%\nThere were still 21.6% of likely GOP Senate primary voters undecided.",
    "author": "Eric Mack",
    "title": "Trafalgar Poll: Dr. Oz Takes Big Lead in Pa. Race"
  },
  {
    "id": 13051,
    "mediaId": 6570,
    "date": "2022-03-03",
    "sentence": "Blood sport, it may be, as just this week, Dr. <span class='selected-term'>Mehmet Oz</span>, another Republican running for the Senate, quipped that Mr. McCormick “says he is tough on China, but got rich investing with them.”\nThe New York Times reported late last month that Mr. McCormick’s hedge fund, Bridgewater Associates, was closely linked to China, and cited affectionate comments he had made in the past about the country, though some were from when he served as U.S. Treasury Under Secretary for International Affairs in George W. Bush’s administration.",
    "author": "Julian Routh",
    "title": "David McCormick hawkish on China, punches back at Mehmet Oz in visit to suburban Pittsburgh"
  },
  {
    "id": 5592,
    "mediaId": 2790,
    "date": "2022-04-10",
    "sentence": "Former President Donald Trump has endorsed fellow TV personality-turned-politician Dr. <span class='selected-term'>Mehmet Oz</span> for the U.S. Senate ahead of the Republican primary in Pennsylvania.",
    "author": "Emma Bowman",
    "title": "Trump endorses Dr. Oz for the U.S. Senate in Pennsylvania"
  },
  {
    "id": 5781,
    "mediaId": 6746,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Madz Dizon",
    "title": "Hunter Biden's Wealth: How Rich Is the President's Son After Business Dealings Unearthed?"
  },
  {
    "id": 4809,
    "mediaId": 2562,
    "date": "2022-04-23",
    "sentence": "David McCormick to Newsmax: Trump Endorsing Oz Won't Stop Me From Winning (Newsmax's \"America Right Now\")\nBy Eric Mack | Saturday, 23 April 2022 01:49 PM\nWhile former President Donald Trump is popular in his state and the endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> \"matters,\" Pennsylvania Senate GOP primary candidate David McCormick told Newsmax it will not keep him from winning on May 18.",
    "author": "NationalWatch",
    "title": "David McCormick to Newsmax: Trump Endorsing Oz Won’t Stop Me From Winning"
  },
  {
    "id": 4760,
    "mediaId": 2548,
    "date": "2022-04-24",
    "sentence": "Former President Donald Trump has endorsed David McCormick’s chief rival, former reality show host and heart surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, citing Oz’s perceived electability.",
    "author": "Michael Ginsberg",
    "title": "Wall Street Tries to Take Out Trump’s Senate Candidate In Pennsylvania"
  }
]