[
  {
    "id": 11255,
    "mediaId": 2742,
    "date": "2022-03-16",
    "sentence": "Apparently he's planning on carrying his Turkish dual citizenship into the Senate, even if it means that he won't have a Senator's security clearance:\nRepublican U.S. Senate candidate <span class='selected-term'>Mehmet Oz</span> said today that he would forego certain security clearances that are provided to all U.S.",
    "author": "James Fulford",
    "title": "Dr. Oz, The Senate, And Turkish Dual Citizenship"
  },
  {
    "id": 9625,
    "mediaId": 2524,
    "date": "2022-03-23",
    "sentence": "When Donald Trump was elected president by losing the popular vote to Hillary Clinton, he appointed Dr. <span class='selected-term'>Mehmet Oz</span> to the President's Council on Sports, Fitness & Nutrition.",
    "author": "Mark Frauenfelder",
    "title": "Nostrum peddler Dr. Mehmet Oz fired from President's Council on Sports, Fitness & Nutrition"
  },
  {
    "id": 7228,
    "mediaId": 2526,
    "date": "2022-04-02",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, the celebrity doctor running as a Republican in Pennsylvania’s 2022 U.S. Senate race, is accused of being a hypocrite after a reportedly lavish “$250,000-a-head fundraiser with [a] Clinton friend and Epstein associate” when he has attacked his most prominent opponent David McCormick for “taking money from [Democrats].”\nDr. Oz in the past has accused McCormick of taking money from “Clinton-loving Democrats” while trying to appear as a strong Republican.",
    "author": "Jacob Bliss",
    "title": "Hypocrisy: ‘Republican’ Dr. Oz Has Lavish Fundraiser with ‘Clinton Friend and Epstein Associate’ After Attacking Opponent for ‘Taking Money from Dems’"
  },
  {
    "id": 7609,
    "mediaId": 2557,
    "date": "2022-04-03",
    "sentence": "… There isn’t a single thing about Oz that doesn’t raise major red flags for republican voters.”\n<span class='selected-term'>Mehmet Oz</span> praised Hillary Clinton and said Obama would make a “superb president” https://t.co/dle6xza1LQ #PAsen\n— Matt Wolking (@MattWolking) March 31, 2022\nListen to the latest daily DML podcasts below!",
    "author": "DML News App",
    "title": "REPORT: Dr Oz called a hypocrite for ‘$250,000-a-head fundraiser’ with Clinton associate"
  },
  {
    "id": 5270,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Michael Goodwin",
    "title": "America is still paying the price for Hillary Clinton’s treachery"
  },
  {
    "id": 5448,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Frances P. Sempa",
    "title": "Bill Clinton's supreme NATO screw-up comes back to haunt us"
  },
  {
    "id": 5390,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Philip Lenczycki",
    "title": "China Stockpiling Nuclear Weapons At An Alarming Rate: Report"
  },
  {
    "id": 5281,
    "mediaId": 2557,
    "date": "2022-04-14",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nFox News host Laura Ingraham called former President Donald Trump and her colleague Sean Hannity’s endorsement of Republican Pennsylvania Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> a “mistake” Tuesday.",
    "author": "DML News App",
    "title": "VIDEO: Laura Ingraham Goes Against Trump And Hannity, Calls Their Latest Move A ‘Mistake’"
  }
]