[
  {
    "id": 4601,
    "mediaId": 2590,
    "date": "2022-01-13",
    "sentence": "A political action committee supporting another Republican in the race, TV host <span class='selected-term'>Mehmet Oz</span>, launched an ad attacking McCormick’s ties to China, where Bridgewater Associates manages $5 billon of its $150 billion portfolio.",
    "author": "Liz Skalka",
    "title": "Hedge Fund Exec David McCormick Latest To Enter Pennsylvania Senate Race"
  },
  {
    "id": 4593,
    "mediaId": 2636,
    "date": "2022-01-13",
    "sentence": "Whatever might come, this would not be a tenure of earth tones and lethargy and saturnine expressions.” (Debbie Deitcher, Manhattan)\nTaking the measure of <span class='selected-term'>Mehmet Oz</span>, Annaliese Griffin wrote: “He’s rightly understood as a kind of quasi-religious leader, one who has set up his revival tent between a yoga studio and an urgent-care clinic, with the television cameras rolling.” (Scott Williams, Salt Lake City)\nFinally, here’s Charles Blow on his dinner with Sidney Poitier: “His enchantment settled on you, like a soft sweater.",
    "author": "",
    "title": "Trump’s Pride Goeth Before Our Fall"
  },
  {
    "id": 3923,
    "mediaId": 2631,
    "date": "2022-01-22",
    "sentence": "",
    "author": "",
    "title": "Trump stays on sidelines in Pennsylvania Senate race — for now"
  },
  {
    "id": 3437,
    "mediaId": 2630,
    "date": "2022-02-01",
    "sentence": "In particular, Dr. <span class='selected-term'>Mehmet Oz</span>, a Pennsylvania Senate candidate, has made Covid a central theme of his campaign, running two ads that criticize the federal government’s response.",
    "author": "",
    "title": "The GOP’s midterm playbook: Flip the script on Covid"
  },
  {
    "id": 2490,
    "mediaId": 2641,
    "date": "2022-02-06",
    "sentence": "The COVID-19 pandemic has exposed Washington, D.C., Democrats, and President Joe Biden on every issue important to Pennsylvanians, according to GOP Senate primary candidate Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Eric Mack",
    "title": "Dr. Oz: Biden Got It Wrong on COVID, Giving 'Too Much Pajama Time'"
  },
  {
    "id": 2244,
    "mediaId": 2630,
    "date": "2022-02-09",
    "sentence": "The former hedge fund manager has praised China in the past, the Philadelphia Inquirer reports, which has already fueled attack ads from celebrity doctor <span class='selected-term'>Mehmet Oz</span> (who has his own ties to China, per Politico).",
    "author": "",
    "title": "The era of big Covid mandates is ending"
  },
  {
    "id": 893,
    "mediaId": 8322,
    "date": "2022-02-11",
    "sentence": "DR. <span class='selected-term'>MEHMET OZ</span> (R), CANDIDATE FOR U.S. SENATE IN PA.: Oh, it's not science.",
    "author": "",
    "title": "'Hannity' on Democrats' panic"
  },
  {
    "id": 956,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Two of the leading Republican candidates in the Pennsylvania Senate race, David McCormick and <span class='selected-term'>Mehmet Oz</span>, have hit each other over a perceived lack of loyalty to former President Donald Trump, who has yet to issue an endorsement in the race.",
    "author": "Theodore Bunker",
    "title": "Pennsylvania GOP Senate Candidates Fight for Trump's Endorsement"
  },
  {
    "id": 930,
    "mediaId": 8254,
    "date": "2022-02-16",
    "sentence": "SOMERSET COUNTY, Pa (WTAJ) — Dr. <span class='selected-term'>Mehmet Oz</span>, a current Republican candidate for the U.S. senate visited Somerset county on Wednesday to host a town hall.",
    "author": "Jordan Tracy",
    "title": "Senate candidate Dr. Oz visits Somerset county"
  },
  {
    "id": 23,
    "mediaId": 2621,
    "date": "2022-02-18",
    "sentence": "Subscribe to\nFormer TV host Dr. <span class='selected-term'>Mehmet Oz</span> called on China to pay the U.S. “reparations” on Friday during an interview on Newsmax TV.",
    "author": "Kipp Jones",
    "title": "Dr. Oz Tells Newsmax China Should Pay U.S. ‘Reparations’ As He Continues MAGA-Like Senate Tour"
  },
  {
    "id": 152,
    "mediaId": 2732,
    "date": "2022-02-19",
    "sentence": "Frances Weiss, White Oak\nDon’t vote for Dr. Oz\nI felt the need to write this letter to encourage Pennsylvania voters not to vote for Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Sounding off: Biden, Casey, protect our borders first"
  },
  {
    "id": 6,
    "mediaId": 2573,
    "date": "2022-02-22",
    "sentence": "DR. <span class='selected-term'>MEHMET OZ</span> (R), PENNSYLVANIA SENATE CANDIDATE: I think Fauci, the CDC, public health service is becoming irrelevant at this point.",
    "author": "",
    "title": "'Hannity' on Freedom Convoy protest, crime surge"
  },
  {
    "id": 126,
    "mediaId": 2551,
    "date": "2022-02-24",
    "sentence": "+8\nView gallery\n+8\nView gallery\nFormer Democratic Rep. Tulsi Gabbard (left) and Dr. <span class='selected-term'>Mehmet Oz</span> (right) will both be appearing at the Conservative Political Action Conference in Orlando, Florida, where it was moved to get away from strict COVID-19 protocols\n+8\nView gallery\nSo far, former Rep. Tulsi Gabbard is the only prominent Democrat slated to appear at CPAC, a gathering for those on the political right.",
    "author": "",
    "title": "'P***ed off' conservatives gather in Orlando for 'awake not woke' CPAC conference as organizer Matt Schlapp says Americans are tired of being told what to do by the Biden administration"
  },
  {
    "id": 12589,
    "mediaId": 8322,
    "date": "2022-03-03",
    "sentence": "DR. <span class='selected-term'>MEHMET OZ</span> (R), CANDIDATE FOR U.S. SENATE IN PENNSYLVANIA: Let's put some numbers on it, Sean, because I have addressed this issue my entire career.",
    "author": "",
    "title": "'Hannity' on Russia-Ukraine, Biden's SOTU address"
  },
  {
    "id": 11128,
    "mediaId": 2641,
    "date": "2022-03-11",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, a Republican candidate for the U.S. Senate in Pennsylvania, told Newsmax on Friday that the Biden administration is \"getting it wrong\" on energy policy and consistently caving to \"woke radical environmentalists.\"",
    "author": "Luca Cacciatore",
    "title": "Dr. Oz to Newsmax: Biden Is 'Getting It Wrong' on Energy Policy"
  },
  {
    "id": 10917,
    "mediaId": 2641,
    "date": "2022-03-11",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> is a heart surgeon, professor emeritus at Columbia University and Republican candidate for the U.S. Senate in Pennsylvania.",
    "author": "Dr. Mehmet Oz",
    "title": "Dr. Oz: Follow The Science For Domestic Energy Policy"
  },
  {
    "id": 10696,
    "mediaId": 2573,
    "date": "2022-03-15",
    "sentence": "DR. <span class='selected-term'>MEHMET OZ</span> (R), CANDIDATE FOR U.S. SENATE IN PA: Well, I'm actually in Beaver County now, which is the western portion of the state and it is shocking that even the folks serving your food the diner here know everything about energy policy and know exactly how wrong Joe Biden is.",
    "author": "Fox News Staff",
    "title": "'Hannity' on Biden's Putin blame game"
  },
  {
    "id": 10888,
    "mediaId": 2590,
    "date": "2022-03-17",
    "sentence": "pic.twitter.com/XkIE6qV4R0\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 16, 2022\nOz’s campaign is even denying that he ever voiced any concern about fracking in the first place, claiming that he had no part in any of those earlier columns — even though he is listed as their primary author.",
    "author": "Chris D'Angelo",
    "title": "Dr. Oz's First-Class Flip-Flop On Fracking"
  },
  {
    "id": 9231,
    "mediaId": 2644,
    "date": "2022-03-19",
    "sentence": "They are a disgraceful publication.”\n“This is just another example of the media being quick to silence anything that would shine a light on the corrupt Biden family,” Dr. <span class='selected-term'>Mehmet Oz</span>, a leading GOP Pennsylvania Senate candidate, told The Post.",
    "author": "Jon Levine",
    "title": "Republicans demand new probe into Hunter Biden laptop, coverup"
  },
  {
    "id": 9474,
    "mediaId": 2862,
    "date": "2022-03-20",
    "sentence": "The idea that the laptop story was invented by Russia was also backed by numerous US intelligence officials, both former and current, according to several media reports.One of the leading Republican candidates in a race for a Pennsylvania Senate seat, Dr <span class='selected-term'>Mehmet Oz</span>, also vowed to back the initiative to probe the silencing of the story about Hunter Biden in 2020, if he wins election in the 2022 midterms.",
    "author": "Tim Korso",
    "title": "US Republicans Call for Congressional Probe Into Media, Big Tech Over Silencing Hunter Laptop Story"
  },
  {
    "id": 9618,
    "mediaId": 4018,
    "date": "2022-03-21",
    "sentence": "“American Leadership Action” was established to back the candidacy of <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "author": "Ron Kampeas",
    "title": "AIPAC’s pro-democracy ‘super PAC’ does not mention Israel in its mission"
  },
  {
    "id": 9325,
    "mediaId": 2602,
    "date": "2022-03-21",
    "sentence": "“American Leadership Action” was established to back the candidacy of <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "author": "RON KAMPEAS/JTA",
    "title": "AIPAC’s pro-democracy ‘super PAC’ does not mention Israel in its mission"
  },
  {
    "id": 9166,
    "mediaId": 2526,
    "date": "2022-03-21",
    "sentence": "In the Senate, Republicans look to retain an open seat with likely Republican primary candidate David McCormick leading in the polls against <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Wendell Husebø",
    "title": "Poll: Joe Biden’s Approval Rating Is 36 Percent, Impacting Battleground States"
  },
  {
    "id": 9026,
    "mediaId": 2727,
    "date": "2022-03-22",
    "sentence": "“American Leadership Action” was established to back the candidacy of <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "author": "Ron Kampeas",
    "title": "Israel not mentioned in AIPAC’s new pro-democracy project"
  },
  {
    "id": 9686,
    "mediaId": 2771,
    "date": "2022-03-22",
    "sentence": "“American Leadership Action” was established to back the candidacy of <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "author": "Ron Kampeas",
    "title": "Fast ForwardAIPAC’s pro-democracy ‘super PAC’ does not mention Israel in its mission"
  },
  {
    "id": 9584,
    "mediaId": 2631,
    "date": "2022-03-23",
    "sentence": "The Biden administration threatened Wednesday to remove Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile GOP Senate candidates.",
    "author": "Zoë Richards",
    "title": "White House moves to oust Dr. Oz and Herschel Walker from presidential advisory panel"
  },
  {
    "id": 9590,
    "mediaId": 2776,
    "date": "2022-03-23",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nThe TV host then denounced Biden for being “petty” and “political” in his action, and assured he had “no intention” of resigning.",
    "author": "Cynthia Cook",
    "title": "Dr. Oz Claps Back After Joe Biden Fires Him From President’s Sports Council: Watch"
  },
  {
    "id": 9602,
    "mediaId": 2574,
    "date": "2022-03-23",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> criticized Trump-era trade policies toward Beijing in an interview on Chinese state TV.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Criticized Trump’s China Trade Policy in Interview With CCP Media"
  },
  {
    "id": 9621,
    "mediaId": 2695,
    "date": "2022-03-23",
    "sentence": "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@Dr. Mehmet Oz) 1648080535\nOz is running for a U.S. Senate seat in Pennsylvania, while Walker is running for a U.S. Senate seat in Georgia — both men are slated to compete in Republican primaries this May.",
    "author": "Alex Nitzberg",
    "title": "White House ousts Dr. Mehmet Oz and Herschel Walker from President's Council on Sports, Fitness & Nutrition"
  },
  {
    "id": 9625,
    "mediaId": 2524,
    "date": "2022-03-23",
    "sentence": "When Donald Trump was elected president by losing the popular vote to Hillary Clinton, he appointed Dr. <span class='selected-term'>Mehmet Oz</span> to the President's Council on Sports, Fitness & Nutrition.",
    "author": "Mark Frauenfelder",
    "title": "Nostrum peddler Dr. Mehmet Oz fired from President's Council on Sports, Fitness & Nutrition"
  },
  {
    "id": 9500,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "Herschel Walker and <span class='selected-term'>Mehmet Oz</span>, who are now Republican Senate candidates in Georgia and Pennsylvania, respectively, were appointed in 2018 by President Donald Trump to serve on the council.",
    "author": "Donald Judd and Maegan Vazquez",
    "title": "Biden requests Mehmet Oz and Herschel Walker resign from presidential council or be terminated"
  },
  {
    "id": 9566,
    "mediaId": 2621,
    "date": "2022-03-23",
    "sentence": "The White House sent Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker letters demanding their resignations from the President’s Council on Sports, Fitness & Nutrition, and informed the U.S. Senate candidates from Pennsylvania and Georgia respectively that if they do not resign by 6 p.m. Wednesday they will be “terminated.”\nUnder the Hatch Act, Oz and Walker are considered special government employees who “may not be candidates in partisan elections” while engaged in official government business.",
    "author": "Michael Luciano",
    "title": "Joe Biden Just Fired Dr. Oz – Yes, Really"
  },
  {
    "id": 9544,
    "mediaId": 6509,
    "date": "2022-03-23",
    "sentence": "The Biden administration on Wednesday threatened to remove <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile Senate GOP candidates.",
    "author": "",
    "title": "White House Moves to Oust Dr. Oz, Herschel Walker From Panel as They Run for Office"
  },
  {
    "id": 8946,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "— Geoff Bennett (@Geoff Bennett) 1648065806\nAt the same time, Biden reportedly asked for the resignation of a more controversial member of the council, Dr. <span class='selected-term'>Mehmet Oz</span>, a thoracic surgeon and medical talk show host first appointed to the advisory council by former President Donald Trump in 2018.",
    "author": "Matthew Chapman",
    "title": "Dr. Oz lashes out after Biden boots him off nutrition advisory panel and replaces him with Chef José Andrés"
  },
  {
    "id": 9090,
    "mediaId": 2573,
    "date": "2022-03-23",
    "sentence": "\"President Trump appointed me to two terms on the President’s Council on Sports, Fitness & Nutrition,\" tweeted Dr. <span class='selected-term'>Mehmet Oz</span>, who is running for Senate in Pennsylvania.",
    "author": "Jon Brown",
    "title": "Biden demands Dr. Oz, Herschel Walker step down amid Senate runs"
  },
  {
    "id": 9322,
    "mediaId": 6497,
    "date": "2022-03-23",
    "sentence": "The Biden administration is seeking the formal resignations of TV personality Dr. <span class='selected-term'>Mehmet Oz</span> and former NFL star Herschel Walker from the President’s Council on Sports, Fitness & Nutrition, warning that failure to quit the posts would lead to termination.",
    "author": "Abid Rahman",
    "title": "Biden Administration Seeks Resignations of Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 9320,
    "mediaId": 2934,
    "date": "2022-03-23",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> has been outspoken about opposing defunding the police.",
    "author": "Robert Farley",
    "title": "Misleading ‘Defund the Police’ Attack on Dr. Oz"
  },
  {
    "id": 9310,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "",
    "title": "NATO summit to address Russia’s invasion of Ukraine underway"
  },
  {
    "id": 9306,
    "mediaId": 2632,
    "date": "2022-03-24",
    "sentence": "The Biden administration on Wednesday threatened to remove <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile Senate GOP candidates.",
    "author": "",
    "title": "White House Moves to Oust Dr. Oz, Herschel Walker From Panel as They Run for Office"
  },
  {
    "id": 9428,
    "mediaId": 2619,
    "date": "2022-03-24",
    "sentence": "President Joe Biden has cut Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span> from advisory roles with the President’s Council on Sports, Fitness & Nutrition due to their current candidacies for the U.S. Senate.",
    "author": "Charles Passy",
    "title": "Biden brings onboard chef José Andrés after cutting Mehmet Oz and Herschel Walker from presidential fitness council"
  },
  {
    "id": 9414,
    "mediaId": 2592,
    "date": "2022-03-24",
    "sentence": "The White House requested Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, who are now Republican Senate candidates in Pennsylvania and Georgia, respectively, to step down from their positions as the administration forbids federal candidates to be members of presidential boards.",
    "author": "Joseph Gobran",
    "title": "Dr. Oz And Herschel Walker Asked By White House To Step Down Or Be Fired, Both Were Trump Appointees"
  },
  {
    "id": 9336,
    "mediaId": 2550,
    "date": "2022-03-24",
    "sentence": "Just as President Joe Biden has reportedly asked GOP Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their posts on the President’s Council on Sports, Fitness & Nutrition, Biden has announced his intent to appoint their replacements.",
    "author": "Rebekah Sager",
    "title": "You’re fired! Biden gives Dr. Oz the boot and appoints José Andrés to presidential council"
  },
  {
    "id": 9367,
    "mediaId": 2919,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nOz also used the video to levy an attack against Dr. Anthony Fauci, a White House medical adviser and the director of the National Insitute for Allergies and Infectious Diseases.",
    "author": "Alex Hider",
    "title": "Biden asks Dr. Oz, Herschel Walker to resign from presidential fitness council"
  },
  {
    "id": 9240,
    "mediaId": 2720,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the Biden administration notified former football star Herschel Walker and celebrity physician Dr. <span class='selected-term'>Mehmet Oz</span> that they could either resign from the council or be fired, according to NBC News.",
    "author": "Jack Davis",
    "title": "Biden Demands Herschel Walker and Dr. Oz Quit Presidential Advisory Council or Be Ousted"
  },
  {
    "id": 9197,
    "mediaId": 2740,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, according to reports by several media outlets.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: Should Russia be kicked out of the G-20?"
  },
  {
    "id": 9237,
    "mediaId": 2584,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the White House sent letters to Dr <span class='selected-term'>Mehmet Oz</span> and former football star Herschel Walker – two Republican Senate candidates in Pennsylvania and Georgia, respectively – asking them to submit their resignations or face termination.",
    "author": "Maya Yang",
    "title": "White House tells Dr Oz and Herschel Walker to resign from fitness council"
  },
  {
    "id": 9183,
    "mediaId": 2718,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nIf President Biden wants to politicize health, he will have to fire me.",
    "author": "Andi Ortiz",
    "title": "Biden Boots Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 9181,
    "mediaId": 2570,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Derek Saul",
    "title": "Georgia Senate Candidate Herschel Walker Refuses To Resign From Presidential Council"
  },
  {
    "id": 9180,
    "mediaId": 2641,
    "date": "2022-03-24",
    "sentence": "U.S. Senate candidates Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker on Wednesday were told to resign from the President's Council on Sports, Fitness and Nutrition or their positions would be \"terminated.\"",
    "author": "Charlie McCarthy",
    "title": "Biden Removes Dr. Oz, Herschel Walker From Fitness Council"
  },
  {
    "id": 9089,
    "mediaId": 2658,
    "date": "2022-03-24",
    "sentence": "The White House asked <span class='selected-term'>Mehmet Oz</span> and Herschel Walkerto resign from the President’s Council on Sports, Fitness & Nutrition.",
    "author": "",
    "title": "POLITICO Playbook: Biden in Europe, WMD fears at center stage"
  },
  {
    "id": 9085,
    "mediaId": 2590,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nWalker, the Trump-endorsed front-runner in the GOP contest to challenge Sen. Raphael Warnock (D-Ga.) in November, recently questioned the science of evolution.",
    "author": "Josephine Harvey",
    "title": "White House Removes Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 9142,
    "mediaId": 2520,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, a White House official said.",
    "author": "Rick Rouan",
    "title": "Biden asks GOP Senate candidates Mehmet Oz, Herschel Walker to resign from presidential board"
  },
  {
    "id": 9170,
    "mediaId": 2641,
    "date": "2022-03-24",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, who is running for the U.S. Senate in Pennsylvania as a Republican, told Newsmax on Thursday that he was asked a day earlier by the White House to resign or face termination from his position on the President's Council on Sports, Fitness, & Nutrition.",
    "author": "Luca Cacciatore",
    "title": "Dr. Oz to Newsmax: Removal From WH Fitness Council Politically Motivated"
  },
  {
    "id": 9159,
    "mediaId": 2748,
    "date": "2022-03-24",
    "sentence": "The White House requested for Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker to resign from the President's Council on Sports, Fitness & Nutrition on Wednesday, or else face termination, according to CNN.",
    "author": "STATION GOSSIP",
    "title": "White House ousts Dr. Mehmet Oz and Herschel Walker from President's Council on Sports, Fitness & Nutrition"
  },
  {
    "id": 9143,
    "mediaId": 2740,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, a White House official said.",
    "author": "Rick Rouan",
    "title": "Biden asks GOP Senate candidates Mehmet Oz, Herschel Walker to resign from presidential board"
  },
  {
    "id": 8945,
    "mediaId": 2594,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to <span class='selected-term'>Mehmet Oz</span>, popularly known as the TV host Dr Oz, as well as Herschel Walker of Georgia; both men are pursuing bids for the Senate in hotly-contested races in their respective states while simultaneously serving as advisers on the largely honorary White House council.",
    "author": "John Bowden",
    "title": "Controversial GOP candidate Mehmet Oz fired after refusing to quit president’s council on sports"
  },
  {
    "id": 8949,
    "mediaId": 2732,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nThe White House on Wednesday posted two new appointments to the council, while a White House official said Oz and Walker were asked to resign because the White House doesn’t permit candidates for federal office to serve on boards.",
    "author": "Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from Biden's sports council"
  },
  {
    "id": 8928,
    "mediaId": 2658,
    "date": "2022-03-24",
    "sentence": "The administration asked <span class='selected-term'>Mehmet Oz</span> to resign from the President’s Council on Sports, Fitness & Nutrition.",
    "author": "",
    "title": "Officials say fourth doses are coming ... if they can buy them"
  },
  {
    "id": 8889,
    "mediaId": 8322,
    "date": "2022-03-24",
    "sentence": "(BEGIN VIDEO CLIP)\nDR. <span class='selected-term'>MEHMET OZ</span> (R-PA), SENATORIAL CANDIDATE: I received the letter on your screen, some behalf of President Biden from the White House, requesting that I resign from the president's council on sports, fitness and nutrition.",
    "author": "",
    "title": "'Hannity' on Biden and NATO"
  },
  {
    "id": 9308,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Harper Neidig",
    "title": "Trump lawyer urges appeals court to block House from getting tax returns"
  },
  {
    "id": 9517,
    "mediaId": 2601,
    "date": "2022-03-24",
    "sentence": "Oz has made millions of dollars in China from his television show and his health sponsorship deals\nWFB: Dr. <span class='selected-term'>Mehmet Oz</span> criticized Trump-era trade policies toward Beijing in an interview on Chinese state TV.",
    "author": "MJA",
    "title": "Dr. Oz Criticized Trump’s China Trade Policy in Interview With CCP Media"
  },
  {
    "id": 9506,
    "mediaId": 2521,
    "date": "2022-03-24",
    "sentence": "‘Replying to@NoLieWithBTC’\nThis is one of the reasons Walker was fired:\n‘The Biden Admin also asked GA Senate candidate Hershel Walker to resign from the WH fitness and nutrition council as well because it’s against their policy for Federal candidates to serve on presidential boards.’\n‘President Joe Biden has asked Republican Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their respective positions on a presidential council, or face removal.’\n‘[E]ven if he becomes Senator Oz.",
    "author": "Gloria Christie",
    "title": "Joe Biden Shows Dr. Oz & Herschel Walker The Door"
  },
  {
    "id": 9471,
    "mediaId": 2696,
    "date": "2022-03-24",
    "sentence": "WASHINGTON – The Biden administration requested the resignation of Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span> from the President’s Council on Sports, Fitness & Nutrition Wednesday night, saying they would be fired if they did not do so.",
    "author": "David Epstein",
    "title": "Elena Delle Donne, José Andrés to replace Herschel Walker and Dr. Oz on fitness council"
  },
  {
    "id": 9624,
    "mediaId": 2560,
    "date": "2022-03-24",
    "sentence": "Harrisburg, Pa. – The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> – best known as daytime TV’s host of “The Dr. Oz Show” – and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 9622,
    "mediaId": 2721,
    "date": "2022-03-24",
    "sentence": "In 2018, former President Donald Trump appointed television personality Dr. <span class='selected-term'>Mehmet Oz</span> and professional athlete Herschel Walker to the President’s Council on Sports, Fitness and Nutrition.",
    "author": "",
    "title": "Biden threatened to fire… who!?"
  },
  {
    "id": 9658,
    "mediaId": 2528,
    "date": "2022-03-24",
    "sentence": "President Joe Biden's administration sent letters to television personality Dr. <span class='selected-term'>Mehmet Oz</span> and former NFL player Herschel Walker Wednesday, asking them to resign from the President's Council on Sports, Fitness & Nutrition or be terminated by the end of the day.",
    "author": "Lauren Frias",
    "title": "Biden asked Dr. Oz and Herschel Walker to resign from a presidential council or be terminated"
  },
  {
    "id": 9636,
    "mediaId": 2518,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "The Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from president’s fitness council"
  },
  {
    "id": 9610,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Alex Gangitano",
    "title": "Biden has sharp response to reporter: ‘You’re playing a game with me’"
  },
  {
    "id": 9606,
    "mediaId": 2680,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV's host of “The Dr. Oz Show” — and former football star Herschel Walker from the President's Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "",
    "title": "Herschel Walker, Dr. Oz removed from Biden's sports council"
  },
  {
    "id": 9786,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Alex Gangitano",
    "title": "Biden ‘hopeful’ China won’t help Russia"
  },
  {
    "id": 9659,
    "mediaId": 2514,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV's host of “The Dr. Oz Show” — and former football star Herschel Walker from the President's Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "",
    "title": "Herschel Walker, Dr. Oz removed from Biden's sports council"
  },
  {
    "id": 9673,
    "mediaId": 2728,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "The Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 12333,
    "mediaId": 8481,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "",
    "title": "Herschel Walker, Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 9497,
    "mediaId": 2747,
    "date": "2022-03-25",
    "sentence": "President Joe Biden asked former NFL running back Herschel Walker and TV personality <span class='selected-term'>Mehmet Oz</span>, M.D., to step down from their positions on the President’s Council on Sports, Fitness, and Nutrition.",
    "author": "",
    "title": "Some federal employees can run for political office under the Hatch Act"
  },
  {
    "id": 9540,
    "mediaId": 6704,
    "date": "2022-03-25",
    "sentence": "President Joe Biden asked former NFL running back Herschel Walker and TV personality <span class='selected-term'>Mehmet Oz</span>, M.D., to step down from their positions on the President’s Council on Sports, Fitness, and Nutrition.",
    "author": "",
    "title": "Some federal employees can run for political office under the Hatch Act"
  },
  {
    "id": 9153,
    "mediaId": 2641,
    "date": "2022-03-25",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> said Friday that he won't quit fighting over his position on the President's Council on Sports, Fitness, and Nutrition, telling Newsmax that if he is elected to represent Pennsylvania as a senator, he and NFL great Herschel Walker, who was also fired from the council, will fight back against politically-motivated firings.",
    "author": "Sandy Fitzgerald",
    "title": "Dr. Oz to Newsmax: Will Keep Fighting After Dismissal From Fitness Council"
  },
  {
    "id": 9358,
    "mediaId": 2752,
    "date": "2022-03-25",
    "sentence": "This is truly a smart and good meme, because Dr. <span class='selected-term'>Mehmet Oz</span> sold good patriotic lifesaving snake oil on the Oprah Winfrey show, while Dr. Fauci tyrannically asked Americans to get vaccinated against a deadly pandemic and to wear masks on their faces, which liberty-loving human beings simply cannot do.",
    "author": "Doktor Zoom",
    "title": "Biden Shitcans Jerk GOP Losers From Fitness Council And They Will Not Shut Up"
  },
  {
    "id": 8913,
    "mediaId": 2618,
    "date": "2022-03-26",
    "sentence": "Herschel Walker echoed the sentiments of Dr. <span class='selected-term'>Mehmet Oz</span> this week when he responded to President Joe Biden’s demand that he step down from the President’s Council on Sports, Fitness & Nutrition over Hatch Act violation concerns, stating simply, “I’m not a quitter.”Walker, a Republican candidate for U.S. Senate from Georgia, has had a storied career in sports competing in the NFL and the Olympics representing the United States.",
    "author": "Kevin Haggerty",
    "title": "Herschel Walker on Biden demanding resignation: ‘I’m not a quitter so you’re gonna have to fire me’"
  },
  {
    "id": 9684,
    "mediaId": 8428,
    "date": "2022-03-26",
    "sentence": "Walker took to Twitter to respond to the sudden demand: “I’m not a quitter so you are going to have to fire me.”\nDr. <span class='selected-term'>Mehmet Oz</span>, candidate for the Senate in Pennsylvania, received the same demand, questioning the political intent behind the decision to oust two Republican candidates from the health council.",
    "author": "Laura Ramirez",
    "title": "Biden orders Herschel Walker to step down from health council – or else"
  },
  {
    "id": 9487,
    "mediaId": 2890,
    "date": "2022-03-28",
    "sentence": "“Biden’s reckless spending caused inflation,” Republican Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> said in a recent campaign ad.",
    "author": "Li Zhou",
    "title": "What Biden is really saying in his new budget"
  },
  {
    "id": 9285,
    "mediaId": 2641,
    "date": "2022-03-28",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> wrote President Joe Biden to say he would not resign from the President's Council on Sports, Fitness and Nutrition despite being ordered to do so.",
    "author": "Charlie McCarthy",
    "title": "Dr. Oz Refuses to Resign From Fitness Council"
  },
  {
    "id": 9242,
    "mediaId": 2512,
    "date": "2022-03-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> has been a fixture on television for the past 13 years, ever since Oprah began featuring him as a guest on her talk show.",
    "author": "Timothy Evans",
    "title": "Dr. Oz's TV staffers say he 'blindsided everyone' when he abruptly fired them to run for Senate"
  },
  {
    "id": 9272,
    "mediaId": 2573,
    "date": "2022-03-29",
    "sentence": "(BEGIN VIDEO CLIP)\nDR. <span class='selected-term'>MEHMET OZ</span> (R-PA), SENATORIAL CANDIDATE: I just received the letter on your screen.",
    "author": "",
    "title": "'Hannity' on Biden's Ukraine war response, domestic woes"
  },
  {
    "id": 9134,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "I am proud of my service and will not resign.pic.twitter.com/EP1vHWATp4\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@Dr. Mehmet Oz) 1648071503\nA recent Fox News poll shows Oz trailing David McCormick in the Republican primary, 24-15 percent, after having enjoyed a lead in the race shortly after announcing his candidacy.",
    "author": "Timothy Evans",
    "title": "Dr. Oz faces backlash from 'furious' longtime staffers after laying them off without warning"
  },
  {
    "id": 8916,
    "mediaId": 2573,
    "date": "2022-03-29",
    "sentence": "The White House sent letters to both Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them to resign by 6:00 p.m. last night or be fired.",
    "author": "",
    "title": "'The Ingraham Angle' on Biden's Europe trip, Big Tech censorship"
  },
  {
    "id": 9634,
    "mediaId": 2701,
    "date": "2022-03-29",
    "sentence": "“Now all of a sudden [it] is the first question in their multiple choice.”\nNo representatives for daytime television star Dr. <span class='selected-term'>Mehmet Oz</span> or Montgomery County real estate developer Jeff Bartos, who are also candidates in the race, responded to The Federalist’s inquiries.",
    "author": "Tristan Justice",
    "title": "5 Pennsylvania GOP Senate Candidates Refuse Philadelphia Inquirer’s Grossly Biased Survey, Torch Paper As A ‘Biased’ ‘Rag’"
  },
  {
    "id": 9675,
    "mediaId": 2748,
    "date": "2022-03-29",
    "sentence": "Lexi Lonas from The Hill reports, President Biden has asked Republican Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to quit their positions on a presidential council or be removed.",
    "author": "IWB",
    "title": "Biden Tells These Two GOP Senate Candidates To Quit Presidential Council Or Be Fired"
  },
  {
    "id": 9130,
    "mediaId": 2740,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, a candidate for U.S. senator and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Chelsey Cox",
    "title": "Senate candidate and TV host Dr. Oz removed from presidential fitness council"
  },
  {
    "id": 9009,
    "mediaId": 2644,
    "date": "2022-03-30",
    "sentence": "Republican US Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> was fired from the President’s Council on Sports, Fitness and Nutrition, about a week after the White House asked him to resign.",
    "author": "Jesse O’Neill",
    "title": "It’s Terminal: Dr. Oz fired from presidential council amid GOP Senate run"
  },
  {
    "id": 9160,
    "mediaId": 2641,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, the longtime talk show host who's running for a Senate seat in Pennsylvania, said he's been formally fired by the White House from his role as a member of the President's Council on Sports, Fitness and Nutrition.",
    "author": "Newsmax Staff",
    "title": "Dr. Oz Formally Fired by Biden White House"
  },
  {
    "id": 9222,
    "mediaId": 2520,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, a candidate for U.S. senator and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Chelsey Cox",
    "title": "Senate candidate and TV host Dr. Oz removed from presidential fitness council"
  },
  {
    "id": 7294,
    "mediaId": 2740,
    "date": "2022-03-31",
    "sentence": "Oz is out: Dr. <span class='selected-term'>Mehmet Oz</span>, a U.S. Senate candidate and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: POTUS seeks to lower gas prices by ordering oil from reserves"
  },
  {
    "id": 7049,
    "mediaId": 2573,
    "date": "2022-04-04",
    "sentence": "DR. <span class='selected-term'>MEHMET OZ</span> (D-PA), SENATORIA CANDIDATE: I mean, it's remarkable the Biden administration in fact Biden can't even fire people as well as Trump.",
    "author": "",
    "title": "'Hannity' on Hunter Biden, Dr. Oz's firing"
  },
  {
    "id": 7084,
    "mediaId": 2512,
    "date": "2022-04-07",
    "sentence": "“Carpet-bagging” Republican U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> is being mocked for a video that shows him in a supermarket shopping for ingredients for crudité, and complaining that the ingredients – totaling he says about $20 – are too expensive, and President Joe Biden is to blame.",
    "author": "David Badash",
    "title": "'Grifter' Dr. Oz mocked for video blaming Biden for $6 salsa as new disclosure puts his wealth at up to $400 million"
  },
  {
    "id": 7279,
    "mediaId": 2745,
    "date": "2022-04-07",
    "sentence": "Trump asked Josh whether he should endorse David McCormick — whom he met with later on Wednesday at Mar-a-Lago — or <span class='selected-term'>Mehmet Oz</span> in the Republican primary to replacing retiring Sen. Pat Toomey (R-Pa.).",
    "author": "",
    "title": "The Post's interview with Donald Trump"
  },
  {
    "id": 7481,
    "mediaId": 2663,
    "date": "2022-04-07",
    "sentence": "pic.twitter.com/8kNil6upn8\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) April 6, 2022\nOz posted the video shortly after his campaign released his most recent financial disclosure statement that lists his wealth at more than $400 million, which would make him one of the wealthiest Senators if elected (God forbid).",
    "author": "Graham Gremore",
    "title": "Dr. Oz has grocery store meltdown while buying ingredients for crudité, blames Biden for $6 salsa"
  },
  {
    "id": 8875,
    "mediaId": 2723,
    "date": "2022-04-07",
    "sentence": "“Carpet-bagging” Republican U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> is being mocked for a video that shows him in a supermarket shopping for ingredients for crudité, and complaining that the ingredients – totaling he says about $20 – are too expensive, and President Joe Biden is to blame.",
    "author": "David Badash",
    "title": "‘Grifter’ Dr. Oz Mocked for Video Blaming Biden for $6 Salsa as New Disclosure Puts His Wealth at Up to $400 Million"
  },
  {
    "id": 7874,
    "mediaId": 2629,
    "date": "2022-04-07",
    "sentence": "“Carpet-bagging” Republican U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> is being mocked for a video that shows him in a supermarket shopping for ingredients for crudité, and complaining that the ingredients – totaling he says about $20 – are too expensive, and President Joe Biden is to blame.",
    "author": "David Badash",
    "title": "Mockery Greets Dr. Oz’s Hilarious Campaign Video Of Fake Grocery Shopping (VIDEO)"
  },
  {
    "id": 7836,
    "mediaId": 2596,
    "date": "2022-04-08",
    "sentence": "Thanks a lot, Joe.pic.twitter.com/8kNil6upn8\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@Dr. Mehmet Oz) 1649281493\nAnd here comes the Biden slam (if you could even call it that)...\n\"We got Joe Biden to thank for this.",
    "author": "",
    "title": "Dr Oz roasted for 'phony' grocery store shopping video"
  },
  {
    "id": 7780,
    "mediaId": 2602,
    "date": "2022-04-09",
    "sentence": "Former US President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for US Senate in Pennsylvania.",
    "author": "REUTERS",
    "title": "Trump endorses celebrity surgeon Dr. Oz for US Senate seat in Pennsylvania"
  },
  {
    "id": 7706,
    "mediaId": 2562,
    "date": "2022-04-09",
    "sentence": "Trump: 'Our Country Is Being Systematically Destroyed' Former President Donald Trump (Jason Behnken/AP)\nBy Eric Mack | Saturday, 09 April 2022 07:18 PM\nStumping for North Carolina GOP Senate primary candidate Ted Budd, former President Donald Trump added an announcement of his official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's hotly contested GOP Senate primary.",
    "author": "NationalWatch",
    "title": "Trump: ‘Our Country Is Being Systematically Destroyed’"
  },
  {
    "id": 7359,
    "mediaId": 2592,
    "date": "2022-04-09",
    "sentence": "Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for U.S. Senate in Pennsylvania.",
    "author": "Moira Warburton and Jan Wolfe",
    "title": "Trump Endorses Celebrity Surgeon Dr. Mehmet Oz For U.S. Senate Seat In Pennsylvania"
  },
  {
    "id": 7343,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Stumping for North Carolina GOP Senate primary candidate Ted Budd, former President Donald Trump added an official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's hotly contested GOP Senate primary at Saturday's Save America rally.",
    "author": "Eric Mack",
    "title": "Trump: 'Right Now Our Country Is a Laughingstock'"
  },
  {
    "id": 7053,
    "mediaId": 2573,
    "date": "2022-04-09",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" a statement from Trump says.",
    "author": "Adam Sabes",
    "title": "Former President Trump endorses Dr. Oz for US Senate in Pennsylvania"
  },
  {
    "id": 5243,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Trump also made an exclusive backstage announcement of an official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania GOP Senate primary.",
    "author": "Eric Mack",
    "title": "Donald Trump to Newsmax: Remember, Nancy Pelosi Was in Charge of Security on Jan. 6"
  },
  {
    "id": 5542,
    "mediaId": 4043,
    "date": "2022-04-09",
    "sentence": "Dr <span class='selected-term'>Mehmet Oz</span>, a Turkish-American TV personality who made more than 60 appearances on Winfrey's show before it stopped airing in 2011, is running to replace retiring Republican Pat Toomey in Pennsylvania.",
    "author": "Tom Acres",
    "title": "Donald Trump endorses celebrity surgeon known for guesting on Oprah in crucial Senate race"
  },
  {
    "id": 5543,
    "mediaId": 2631,
    "date": "2022-04-09",
    "sentence": "Former President Donald Trump endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's Senate GOP primary.",
    "author": "",
    "title": "Trump endorses Dr. Mehmet Oz in Pennsylvania Senate GOP primary"
  },
  {
    "id": 5445,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Trump also made an exclusive backstage announcement of an official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania GOP Senate primary.",
    "author": "Eric Mack",
    "title": "Donald Trump to Newsmax: Remember, Nancy Pelosi Was in Charge of Security on Jan. 6"
  },
  {
    "id": 5825,
    "mediaId": 2745,
    "date": "2022-04-09",
    "sentence": "Former president Donald Trump on Saturday jumped into a high-stakes intraparty contest, endorsing fellow television celebrity-turned-politician <span class='selected-term'>Mehmet Oz</span> in the contested Republican primary for the U.S. Senate in Pennsylvania, where the leading candidates jockeyed aggressively for Trump’s support.",
    "author": "",
    "title": "Trump endorses Dr. Oz in Pennsylvania Senate race, a key battleground"
  },
  {
    "id": 5790,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Neil A. Kurtzman",
    "title": "COVID, Gender, Climate, and the Collapse of Science"
  },
  {
    "id": 5728,
    "mediaId": 2592,
    "date": "2022-04-10",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" the endorsement read.",
    "author": "Ashley Palya",
    "title": "Trump Endorses Dr. Oz In Pennsylvania Senate Race, Says Decision 'All About Winning Elections'"
  },
  {
    "id": 5442,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Will",
    "title": "OOF: More Bad News for Biden"
  },
  {
    "id": 5448,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Frances P. Sempa",
    "title": "Bill Clinton's supreme NATO screw-up comes back to haunt us"
  },
  {
    "id": 5457,
    "mediaId": 2740,
    "date": "2022-04-10",
    "sentence": "The biggest name in Pennsylvania's Senate race – <span class='selected-term'>Mehmet Oz</span> – has secured the endorsement of the GOP's biggest name, Donald Trump.",
    "author": "Katie Wadington",
    "title": "Trump endorses celebrity surgeon Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 5468,
    "mediaId": 2668,
    "date": "2022-04-10",
    "sentence": "As RedState reported Saturday evening, Trump raised eyebrows across the political spectrum with his “complete and total” endorsement of Dr. <span class='selected-term'>Mehmet Oz</span>, just weeks before the contested Republican primary in Pennsylvania.",
    "author": "Mike Miller",
    "title": "Trump's Endorsement of Dr. Oz Should Surprise No One Who Understands Trump"
  },
  {
    "id": 5361,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "There are seven people running for the PA senate seat including two women, one white, one black: Kathy Barnette (Republican): MAGA businesswoman from Montgomery County, occasional Fox News commentator; Jeff Bartos (Republican): A real estate investor from Montgomery County; Sean Gale (Republican): A lawyer from Montgomery County; David McCormick (Republican) A former CEO of one of the world's largest hedge funds; <span class='selected-term'>Mehmet Oz</span> (Republican): A TV celebrity doctor; Carla Sands (Republican): from Mechanicsburg, Trumps' former ambassador to Denmark; George Bochetto (Republican): A Philadelphia defense attorney who sued the city over boxing-up of a statue of Christopher Columbus.",
    "author": "Bonchie",
    "title": "Donald Trump Just Made an Absolutely Head-Scratching Endorsement"
  },
  {
    "id": 5360,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Clarice Feldman",
    "title": "I Learn Something New Every Day"
  },
  {
    "id": 5335,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Kyle Becker",
    "title": "Joe Biden’s Brain Glitches Out at KBJ Ceremony, Starts Rambling About Xi Jinping and the Himalayas"
  },
  {
    "id": 5536,
    "mediaId": 2537,
    "date": "2022-04-10",
    "sentence": "The biggest name in Pennsylvania's Senate race – <span class='selected-term'>Mehmet Oz</span> – has secured the endorsement of the GOP's biggest name, Donald Trump.",
    "author": "Katie Wadington",
    "title": "Trump endorses celebrity surgeon Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 5491,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Haris Alic",
    "title": "McCarthy rules out weaponizing impeachment if GOP takes House majority"
  },
  {
    "id": 5246,
    "mediaId": 2557,
    "date": "2022-04-10",
    "sentence": "President Trump vows to ‘demand justice for the Jan. 6 prisoners and full protection of their civil rights like was received by ANTIFA, Black Lives Matter who murdered people throughout our country.’ pic.twitter.com/I9VxV5zpjh\nPresident Trump: ‘We must ensure that every election can be FULLY and quickly audited.’ pic.twitter.com/9sWhOHumo6\nTrump confirmed his endorsement for Dr. <span class='selected-term'>Mehmet Oz</span>, in Pennsylvania, who is running for U.S. Senate.",
    "author": "DML News App",
    "title": "WATCH: Highlights from Trump’s speech at North Carolina rally"
  },
  {
    "id": 5235,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Kevin Tober",
    "title": "'Democrats Are Always Two Steps Behind': NBC Frets Over Dem Failures"
  },
  {
    "id": 5214,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Matt McNulty",
    "title": "Biden to push tougher rules on sale of ghost guns that would make manufacturers add serial number to all firearms and require background checks before selling kits"
  },
  {
    "id": 5207,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "George Neumayer",
    "title": "Biden’s Unfolding War on Religious Hospitals"
  },
  {
    "id": 5256,
    "mediaId": 2658,
    "date": "2022-04-11",
    "sentence": "— Minority Leader Mitch McConnell (R-Ky.)\n\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.",
    "author": "",
    "title": "Donald Trump endorsed Dr. Mehmet Oz over the weekend in the Pennsylvania Senate race. Mitch McConnell didn't follow suit."
  },
  {
    "id": 5531,
    "mediaId": 2724,
    "date": "2022-04-11",
    "sentence": "pic.twitter.com/XkIE6qV4R0\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 16, 2022\nWe live in a time where too many Republicans try selling their conservative wares just to get elected only to start functioning like barely-disguised left-of-center RINOs once they get into office.",
    "author": "Rusty Weiss",
    "title": "I’m Just Going To Say This: Trump’s Endorsement Of Dr. Oz Is The Wrong Move"
  },
  {
    "id": 5759,
    "mediaId": 2621,
    "date": "2022-04-11",
    "sentence": "Trump has endorsed both men as he continues to throw his support behind various Republicans running, including recently Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Zachary Leeman",
    "title": "Trump Rally in North Carolina Draws Fewer Than 2,000 People: Report"
  },
  {
    "id": 5382,
    "mediaId": 2592,
    "date": "2022-04-13",
    "sentence": "Donald Trump's decision to endorse celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate race has divided local Republican Party officials and stunned close advisers who thought he had decided to stay out of the contest to pick a Republican candidate, two sources familiar with internal deliberations told Reuters.",
    "author": "Jarrett Renshaw",
    "title": "Trump Endorsement Of Dr. Oz In Senate Race Stuns Advisers, Divides Loyalists"
  },
  {
    "id": 5781,
    "mediaId": 6746,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Madz Dizon",
    "title": "Hunter Biden's Wealth: How Rich Is the President's Son After Business Dealings Unearthed?"
  },
  {
    "id": 5666,
    "mediaId": 4091,
    "date": "2022-04-15",
    "sentence": "(Natural News) Dr. <span class='selected-term'>Mehmet Oz</span> is running for the United States Senate in the Commonwealth of Pennsylvania, and former President Donald Trump is endorsing him.",
    "author": "Ethan Huff",
    "title": "Trump officially endorses Dr. Oz, calls him “smart, tough” … but not all conservatives are happy about it"
  },
  {
    "id": 5452,
    "mediaId": 2699,
    "date": "2022-04-17",
    "sentence": "On Sunday evening’s edition of Last Week Tonight, John Oliver kicked off the show by addressing former President Donald Trump’s recent endorsement of snake-oil salesman Dr. <span class='selected-term'>Mehmet Oz</span>, who aggressively pushed hydroxychloroquine as a COVID-19 treatment during the pandemic, in the Pennsylvania Senate race.",
    "author": "Marlow Stern",
    "title": "John Oliver Reveals How He’s Been Trolling Dr. Oz for Years"
  },
  {
    "id": 5558,
    "mediaId": 2644,
    "date": "2022-04-18",
    "sentence": "The former president and longtime reality TV personality stepped in recently to endorse Dr. <span class='selected-term'>Mehmet Oz</span>, another erstwhile reality personality, in his Republican bid for a Pennsylvania Senate seat.",
    "author": "Kase Wickman",
    "title": "John Oliver Tears Into Dr. Oz’s ‘Sh*t Show’ Senate Campaign"
  },
  {
    "id": 5877,
    "mediaId": 6497,
    "date": "2022-04-18",
    "sentence": "Not surprisingly, Donald Trump’s endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate — and Oz’s campaign itself — aren’t sitting well with John Oliver.",
    "author": "Kimberly Nordyke",
    "title": "John Oliver Takes on Dr. Oz and His “Sh— Show” Senate Campaign on ‘Last Week Tonight’"
  },
  {
    "id": 5620,
    "mediaId": 8290,
    "date": "2022-04-20",
    "sentence": "The California conservative was particularly put off by Trump’s recent decision to endorse TV doctor <span class='selected-term'>Mehmet Oz</span> in the upcoming (May 17) Pennsylvania Republican U.S. Senate primary.",
    "author": "Jeffrey A. Rendall",
    "title": "The Right Resistance: Trump doesn’t require vote of confidence, but he does need primary competitors"
  },
  {
    "id": 4665,
    "mediaId": 8412,
    "date": "2022-04-20",
    "sentence": "Pennsylvania Republican Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> torched Biden’s policies and argued that people \"are angry,\" as \"inflation rates rage forward.\"",
    "author": "Stephanie Giang-Paunon",
    "title": "Dr. Oz rips Biden’s policies as inflation rages forward"
  },
  {
    "id": 4809,
    "mediaId": 2562,
    "date": "2022-04-23",
    "sentence": "David McCormick to Newsmax: Trump Endorsing Oz Won't Stop Me From Winning (Newsmax's \"America Right Now\")\nBy Eric Mack | Saturday, 23 April 2022 01:49 PM\nWhile former President Donald Trump is popular in his state and the endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> \"matters,\" Pennsylvania Senate GOP primary candidate David McCormick told Newsmax it will not keep him from winning on May 18.",
    "author": "NationalWatch",
    "title": "David McCormick to Newsmax: Trump Endorsing Oz Won’t Stop Me From Winning"
  }
]