[
  {
    "id": 8946,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "— Geoff Bennett (@Geoff Bennett) 1648065806\nAt the same time, Biden reportedly asked for the resignation of a more controversial member of the council, Dr. <span class='selected-term'>Mehmet Oz</span>, a thoracic surgeon and medical talk show host first appointed to the advisory council by former President Donald Trump in 2018.",
    "author": "Matthew Chapman",
    "title": "Dr. Oz lashes out after Biden boots him off nutrition advisory panel and replaces him with Chef José Andrés"
  },
  {
    "id": 9500,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "Herschel Walker and <span class='selected-term'>Mehmet Oz</span>, who are now Republican Senate candidates in Georgia and Pennsylvania, respectively, were appointed in 2018 by President Donald Trump to serve on the council.",
    "author": "Donald Judd and Maegan Vazquez",
    "title": "Biden requests Mehmet Oz and Herschel Walker resign from presidential council or be terminated"
  },
  {
    "id": 9584,
    "mediaId": 2631,
    "date": "2022-03-23",
    "sentence": "The Biden administration threatened Wednesday to remove Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile GOP Senate candidates.",
    "author": "Zoë Richards",
    "title": "White House moves to oust Dr. Oz and Herschel Walker from presidential advisory panel"
  },
  {
    "id": 9506,
    "mediaId": 2521,
    "date": "2022-03-24",
    "sentence": "‘Replying to@NoLieWithBTC’\nThis is one of the reasons Walker was fired:\n‘The Biden Admin also asked GA Senate candidate Hershel Walker to resign from the WH fitness and nutrition council as well because it’s against their policy for Federal candidates to serve on presidential boards.’\n‘President Joe Biden has asked Republican Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their respective positions on a presidential council, or face removal.’\n‘[E]ven if he becomes Senator Oz.",
    "author": "Gloria Christie",
    "title": "Joe Biden Shows Dr. Oz & Herschel Walker The Door"
  },
  {
    "id": 9622,
    "mediaId": 2721,
    "date": "2022-03-24",
    "sentence": "In 2018, former President Donald Trump appointed television personality Dr. <span class='selected-term'>Mehmet Oz</span> and professional athlete Herschel Walker to the President’s Council on Sports, Fitness and Nutrition.",
    "author": "",
    "title": "Biden threatened to fire… who!?"
  },
  {
    "id": 9471,
    "mediaId": 2696,
    "date": "2022-03-24",
    "sentence": "WASHINGTON – The Biden administration requested the resignation of Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span> from the President’s Council on Sports, Fitness & Nutrition Wednesday night, saying they would be fired if they did not do so.",
    "author": "David Epstein",
    "title": "Elena Delle Donne, José Andrés to replace Herschel Walker and Dr. Oz on fitness council"
  },
  {
    "id": 9428,
    "mediaId": 2619,
    "date": "2022-03-24",
    "sentence": "President Joe Biden has cut Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span> from advisory roles with the President’s Council on Sports, Fitness & Nutrition due to their current candidacies for the U.S. Senate.",
    "author": "Charles Passy",
    "title": "Biden brings onboard chef José Andrés after cutting Mehmet Oz and Herschel Walker from presidential fitness council"
  },
  {
    "id": 9336,
    "mediaId": 2550,
    "date": "2022-03-24",
    "sentence": "Just as President Joe Biden has reportedly asked GOP Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their posts on the President’s Council on Sports, Fitness & Nutrition, Biden has announced his intent to appoint their replacements.",
    "author": "Rebekah Sager",
    "title": "You’re fired! Biden gives Dr. Oz the boot and appoints José Andrés to presidential council"
  },
  {
    "id": 9240,
    "mediaId": 2720,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the Biden administration notified former football star Herschel Walker and celebrity physician Dr. <span class='selected-term'>Mehmet Oz</span> that they could either resign from the council or be fired, according to NBC News.",
    "author": "Jack Davis",
    "title": "Biden Demands Herschel Walker and Dr. Oz Quit Presidential Advisory Council or Be Ousted"
  },
  {
    "id": 8945,
    "mediaId": 2594,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to <span class='selected-term'>Mehmet Oz</span>, popularly known as the TV host Dr Oz, as well as Herschel Walker of Georgia; both men are pursuing bids for the Senate in hotly-contested races in their respective states while simultaneously serving as advisers on the largely honorary White House council.",
    "author": "John Bowden",
    "title": "Controversial GOP candidate Mehmet Oz fired after refusing to quit president’s council on sports"
  },
  {
    "id": 9153,
    "mediaId": 2641,
    "date": "2022-03-25",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> said Friday that he won't quit fighting over his position on the President's Council on Sports, Fitness, and Nutrition, telling Newsmax that if he is elected to represent Pennsylvania as a senator, he and NFL great Herschel Walker, who was also fired from the council, will fight back against politically-motivated firings.",
    "author": "Sandy Fitzgerald",
    "title": "Dr. Oz to Newsmax: Will Keep Fighting After Dismissal From Fitness Council"
  },
  {
    "id": 9358,
    "mediaId": 2752,
    "date": "2022-03-25",
    "sentence": "This is truly a smart and good meme, because Dr. <span class='selected-term'>Mehmet Oz</span> sold good patriotic lifesaving snake oil on the Oprah Winfrey show, while Dr. Fauci tyrannically asked Americans to get vaccinated against a deadly pandemic and to wear masks on their faces, which liberty-loving human beings simply cannot do.",
    "author": "Doktor Zoom",
    "title": "Biden Shitcans Jerk GOP Losers From Fitness Council And They Will Not Shut Up"
  }
]