[
  {
    "id": 5361,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "There are seven people running for the PA senate seat including two women, one white, one black: Kathy Barnette (Republican): MAGA businesswoman from Montgomery County, occasional Fox News commentator; Jeff Bartos (Republican): A real estate investor from Montgomery County; Sean Gale (Republican): A lawyer from Montgomery County; David McCormick (Republican) A former CEO of one of the world's largest hedge funds; <span class='selected-term'>Mehmet Oz</span> (Republican): A TV celebrity doctor; Carla Sands (Republican): from Mechanicsburg, Trumps' former ambassador to Denmark; George Bochetto (Republican): A Philadelphia defense attorney who sued the city over boxing-up of a statue of Christopher Columbus.",
    "author": "Bonchie",
    "title": "Donald Trump Just Made an Absolutely Head-Scratching Endorsement"
  },
  {
    "id": 5493,
    "mediaId": 2646,
    "date": "2022-04-10",
    "sentence": "Trump: I’ve gotta be the cleanest— I think I’m the most honest human being perhaps that god ever created pic.twitter.com/D98itzA6vi\n— Acyn (@Acyn) April 10, 2022\nIf there was one bit of actual news to be gleaned from Trump’s North Carolina appearance last night, it was his endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> for the Republican nomination for Senator in Pennsylvania.",
    "author": "Vinnie Longobardo",
    "title": "FUTILE RAMBLINGS: Trump’s North Carolina rally provides him with ever diminishing returns"
  },
  {
    "id": 5246,
    "mediaId": 2557,
    "date": "2022-04-10",
    "sentence": "President Trump vows to ‘demand justice for the Jan. 6 prisoners and full protection of their civil rights like was received by ANTIFA, Black Lives Matter who murdered people throughout our country.’ pic.twitter.com/I9VxV5zpjh\nPresident Trump: ‘We must ensure that every election can be FULLY and quickly audited.’ pic.twitter.com/9sWhOHumo6\nTrump confirmed his endorsement for Dr. <span class='selected-term'>Mehmet Oz</span>, in Pennsylvania, who is running for U.S. Senate.",
    "author": "DML News App",
    "title": "WATCH: Highlights from Trump’s speech at North Carolina rally"
  },
  {
    "id": 6086,
    "mediaId": 2668,
    "date": "2022-04-10",
    "sentence": "A new WHTM/Emerson College Polling/The Hill Pennsylvania primary poll shows David McCormick and <span class='selected-term'>Mehmet Oz</span> continuing to lead in the Republican race for one of Pennsylvania’s U.S. Senate seats.",
    "author": "Duke",
    "title": "Did Donald Trump Just Burn Some Bridges With His Base Over the Dr. Oz Endorsement?"
  },
  {
    "id": 6017,
    "mediaId": 2540,
    "date": "2022-04-11",
    "sentence": "That fact was borne out over the weekend when Trump endorsed TV doctor <span class='selected-term'>Mehmet Oz</span> over hedge fund rich guy David McCormick in advance of next month's Republican Senate primary.",
    "author": "Chris Cillizza",
    "title": "The very simple reason why Donald Trump chose Mehmet Oz in Pennsylvania"
  },
  {
    "id": 5759,
    "mediaId": 2621,
    "date": "2022-04-11",
    "sentence": "Trump has endorsed both men as he continues to throw his support behind various Republicans running, including recently Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Zachary Leeman",
    "title": "Trump Rally in North Carolina Draws Fewer Than 2,000 People: Report"
  },
  {
    "id": 5715,
    "mediaId": 8428,
    "date": "2022-04-12",
    "sentence": "Trump has endorsed Herschel Walker in his race to unseat Sen. Raphael Warnock, D-Ga., Rep. Ted Budd in his campaign to replace retiring Sen. Richard Burr, R-N.C., and Dr. <span class='selected-term'>Mehmet Oz</span> in his close primary race to replace retiring Sen. Pat Toomey, R-Pa.\nTrump has not yet endorsed a Senate candidate in Ohio, although multiple Republicans seek his support.",
    "author": "Timothy Frudd",
    "title": "Trump’s approval rating remains strong among Republicans"
  },
  {
    "id": 5822,
    "mediaId": 2656,
    "date": "2022-04-12",
    "sentence": "Donald Trump’s recent endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Republican Senate primary shook MAGA world to its core.",
    "author": "Rick Moran",
    "title": "The Silly Talk of Trump's Demise Over Oz Endorsement"
  },
  {
    "id": 5808,
    "mediaId": 2894,
    "date": "2022-04-17",
    "sentence": "",
    "author": "Bryan Anderson",
    "title": "Smart tactic or missed opportunity? Budd is the latest GOP frontrunner to avoid debates"
  },
  {
    "id": 5297,
    "mediaId": 2592,
    "date": "2022-04-17",
    "sentence": "KEY POINTS\nTrump said he received advice from Dr. Oz to lose weight and observe a healthy lifestyle\nTrump is known for his love of McDonald's and Diet Coke\nTrump can down approximately a dozen Diet Cokes each day\nFormer President Donald Trump recently lamented that he does not have the time to lose weight as he told a crowd about the advice he received from TV personality Dr. <span class='selected-term'>Mehmet Oz</span>, who he recently endorsed for the Pennsylvania Senate Race.",
    "author": "Danielle Ong",
    "title": "Trump Talks About His Weight: 'I Don’t Have Time To Lose Weight'"
  },
  {
    "id": 4937,
    "mediaId": 8484,
    "date": "2022-04-24",
    "sentence": "Oz is on the far right, seen here with the Trumps and Piers Morgan on the left\n+7\nView gallery\n+7\nView gallery\nConservatives are grumbling over former President Donald Trump's (left) decision to back Dr. <span class='selected-term'>Mehmet Oz</span> (right) in the May 17 Republican Senate primary\n+7\nView gallery\nHuman Events' Jack Posobiec, a Pennsylvania native, tweeted out footage of a vintage Dr. Oz episode that focused on transgender children\nThe Trump endorsement could break a deadlock in the Pennsylvania race.",
    "author": "Adam Manno For Dailymail.Com",
    "title": "REVEALED: Dr. Oz bought up thousands of dollars of Trump-backed hydroxychloroquine pills during pandemic"
  }
]