[
  {
    "id": 2100,
    "mediaId": 2540,
    "date": "2022-02-04",
    "sentence": "\"<span class='selected-term'>Mehmet Oz</span> - citizen of Turkey, creature of Hollywood - has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,\" said Jess Szymanski, referring to the Chinese Communist Party.",
    "author": "Michael Warren",
    "title": "Pennsylvania Senate Republican race between Oz and McCormick turns ugly early"
  },
  {
    "id": 1745,
    "mediaId": 2736,
    "date": "2022-02-11",
    "sentence": "Pennsylvania Republican Dr. <span class='selected-term'>Mehmet Oz</span> took a break from his Senate campaign to travel to Hollywood and literally get down on all fours to kiss his newly awarded star on the Walk of Fame.",
    "author": "Greg P.",
    "title": "WATCH: PA Senate candidate Dr. Oz kisses his new star on the Hollywood Walk of Fame"
  },
  {
    "id": 17143,
    "mediaId": 8254,
    "date": "2022-03-02",
    "sentence": "Republican candidate running for Pennsylvania Senate, Dr. <span class='selected-term'>Mehmet Oz</span>, visited the Erie region for the second time since his campaign began.",
    "author": "Chelsea Swift",
    "title": "Dr. Oz makes campaign stop in Warren"
  },
  {
    "id": 11126,
    "mediaId": 2699,
    "date": "2022-03-16",
    "sentence": "A recent attack ad against McCormick’s big rival—pop surgeon Dr. <span class='selected-term'>Mehmet Oz</span>—is spotlighting the talk-show host’s position on transgender issues, slamming him as a “Republican in Name Only” for engaging on the topic in the past.",
    "author": "Roger Sollenberger",
    "title": "Dr. Oz’s PA Senate Rival Sure Was ‘Woke’ While He Was a CEO"
  },
  {
    "id": 7836,
    "mediaId": 2596,
    "date": "2022-04-08",
    "sentence": "Thanks a lot, Joe.pic.twitter.com/8kNil6upn8\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@Dr. Mehmet Oz) 1649281493\nAnd here comes the Biden slam (if you could even call it that)...\n\"We got Joe Biden to thank for this.",
    "author": "",
    "title": "Dr Oz roasted for 'phony' grocery store shopping video"
  },
  {
    "id": 5825,
    "mediaId": 2745,
    "date": "2022-04-09",
    "sentence": "Former president Donald Trump on Saturday jumped into a high-stakes intraparty contest, endorsing fellow television celebrity-turned-politician <span class='selected-term'>Mehmet Oz</span> in the contested Republican primary for the U.S. Senate in Pennsylvania, where the leading candidates jockeyed aggressively for Trump’s support.",
    "author": "",
    "title": "Trump endorses Dr. Oz in Pennsylvania Senate race, a key battleground"
  },
  {
    "id": 5718,
    "mediaId": 2532,
    "date": "2022-04-10",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he's the farthest thing from America First & he'd be very bad for PA.\"\n2022 Midterm Elections\n More\n A test for Trump as Michigan GOP gathers\n McCarthy considered telling Trump to resign after Jan. 6, recording shows\n Bernie Sanders hasn't ruled out third run for presidency\n Florida governor approves map that could give GOP more U.S. House seats\n Tennessee GOP kicks Trump-backed candidate off congressional primary ballot\n More\nIn:\nPennsylvania\nUnited States Senate\n<span class='selected-term'>Mehmet Oz</span>\nDonald Trump",
    "author": "",
    "title": "Trump endorses Dr. Mehmet Oz in Pennsylvania Senate primary race"
  },
  {
    "id": 5673,
    "mediaId": 2738,
    "date": "2022-04-10",
    "sentence": "On Saturday, as CNN shared, Trump went ahead and gave quack TV doc <span class='selected-term'>Mehmet Oz</span>, who is running for senator in Pennsylvania, his full endorsement.",
    "author": "Jennifer Wood",
    "title": "Donald Trump Endorsing Dr. Oz In The PA Senate Race Has Sparked A Hilarious MAGA Mutiny"
  },
  {
    "id": 5998,
    "mediaId": 8484,
    "date": "2022-04-11",
    "sentence": "+8\nView gallery\n+8\nView gallery\nConservatives are grumbling over former President Donald Trump's (left) decision to back Dr. <span class='selected-term'>Mehmet Oz</span> (right) in the May 17 Republican Senate primary\n+8\nView gallery\nHuman Events' Jack Posobiec, a Pennsylvania native, tweeted out footage of a vintage Dr. Oz episode that focused on transgender children\n+8\nView gallery\nPosobiec also highlighted an Oz tweet from 2018 that suggested the Centers for Disease Control and Prevention should conduct a study on gun violence\n'You're not America First.",
    "author": "Nikki Schwab",
    "title": "MAGA turns on Trump for endorsing Dr. Oz: Supporters tear into TV star's past comments on abortion and transgender issues after ex-president gave him prized backing in Pennsylvania Senate race"
  },
  {
    "id": 5225,
    "mediaId": 2557,
    "date": "2022-04-11",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by TheHill.com:\nFrustration is mounting on the GOP’s right flank over former President Trump’s endorsement of <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate race.",
    "author": "DML News App",
    "title": "POLL: After you see THIS, do you support Trump’s endorsement of Dr. Oz for U.S. Senate?"
  },
  {
    "id": 5256,
    "mediaId": 2658,
    "date": "2022-04-11",
    "sentence": "— Minority Leader Mitch McConnell (R-Ky.)\n\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.",
    "author": "",
    "title": "Donald Trump endorsed Dr. Mehmet Oz over the weekend in the Pennsylvania Senate race. Mitch McConnell didn't follow suit."
  },
  {
    "id": 5556,
    "mediaId": 2688,
    "date": "2022-04-12",
    "sentence": "“Hence, our Country is going to hell.”\nLast weekend, the former president announced his controversial endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the hotly contested GOP primary for Pennsylvania Senate.",
    "author": "Matt Shuham",
    "title": "Trump Refuses To Back His Ex-US Attorney For Not Big Lying Hard Enough"
  },
  {
    "id": 5422,
    "mediaId": 2550,
    "date": "2022-04-19",
    "sentence": "Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span>\nI can think of a million reasons why I wouldn’t support Mehmet Oz to represent Pennsylvania in the U.S. Senate, and now I can add one more.",
    "author": "Rebekah Sager",
    "title": "‘He’s shown us who he is,’ Armenian publisher says of Oz’s refusal to recognize Armenian genocide"
  },
  {
    "id": 4721,
    "mediaId": 8356,
    "date": "2022-04-21",
    "sentence": "According to RealClearPolitics.com, McCormick has an average lead of 4.2% in polls of the race since late February, although Dr. <span class='selected-term'>Mehmet Oz</span>, who received the GOP-coveted endorsement of former President Donald Trump, held a 3-percentage point lead over McCormick in a recent Trafalgar Group poll.",
    "author": "",
    "title": "PA Senate race: Ex hedge fund CEO David McCormick tries to fend off Oz's Trump endorsement"
  }
]