[
  {
    "id": 2686,
    "mediaId": 2573,
    "date": "2022-02-02",
    "sentence": "\"<span class='selected-term'>Mehmet Oz</span> – citizen of Turkey, creature of Hollywood – has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,\" McCormick campaign spokesperson Jess Szymanski charged.",
    "author": "Paul Steinhauser",
    "title": "New punches in China fistfight between Dr. Oz and David McCormick in Pennsylvania GOP Senate race"
  },
  {
    "id": 2739,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "“This should be a model for other U.S. companies, unlike David McCormick’s track record of exporting jobs to China and India from the dark corners of Wall Street.”\nIn reference to Oz’s connections to China, McCormick campaign spokesperson Jess Szymanski told POLITICO: “<span class='selected-term'>Mehmet Oz</span> — citizen of Turkey, creature of Hollywood — has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,” and that “while Mehmet has been silent on China until he needed to knock down Dave’s credentials, Dave was serving our country and standing up to the [Chinese Communist Party].”\nIn its 2020 annual report filed with the Securities and Exchange Commission, Usana said that China was its “largest market and single largest source of revenue,” making up around 41 percent of net sales and about 38 percent of its active customers.",
    "author": "",
    "title": "Dr. Oz is running as a China hawk. It's a bit of a stretch."
  },
  {
    "id": 2244,
    "mediaId": 2630,
    "date": "2022-02-09",
    "sentence": "The former hedge fund manager has praised China in the past, the Philadelphia Inquirer reports, which has already fueled attack ads from celebrity doctor <span class='selected-term'>Mehmet Oz</span> (who has his own ties to China, per Politico).",
    "author": "",
    "title": "The era of big Covid mandates is ending"
  },
  {
    "id": 932,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "The complete poll results:\n<span class='selected-term'>Mehmet Oz</span>: 27.4%\nDavid McCormick: 15.9%\nCarla Sands: 14.8%\nKathy Barnette: 8.9%\nJeff Bartos: 6.6%\nSean Gale: 1.9%\nGeorge Bochetto: 1.6%\nEverett Stern: 1.5%\nThere were still 21.6% of likely GOP Senate primary voters undecided.",
    "author": "Eric Mack",
    "title": "Trafalgar Poll: Dr. Oz Takes Big Lead in Pa. Race"
  },
  {
    "id": 23,
    "mediaId": 2621,
    "date": "2022-02-18",
    "sentence": "Subscribe to\nFormer TV host Dr. <span class='selected-term'>Mehmet Oz</span> called on China to pay the U.S. “reparations” on Friday during an interview on Newsmax TV.",
    "author": "Kipp Jones",
    "title": "Dr. Oz Tells Newsmax China Should Pay U.S. ‘Reparations’ As He Continues MAGA-Like Senate Tour"
  },
  {
    "id": 13051,
    "mediaId": 6570,
    "date": "2022-03-03",
    "sentence": "Blood sport, it may be, as just this week, Dr. <span class='selected-term'>Mehmet Oz</span>, another Republican running for the Senate, quipped that Mr. McCormick “says he is tough on China, but got rich investing with them.”\nThe New York Times reported late last month that Mr. McCormick’s hedge fund, Bridgewater Associates, was closely linked to China, and cited affectionate comments he had made in the past about the country, though some were from when he served as U.S. Treasury Under Secretary for International Affairs in George W. Bush’s administration.",
    "author": "Julian Routh",
    "title": "David McCormick hawkish on China, punches back at Mehmet Oz in visit to suburban Pittsburgh"
  },
  {
    "id": 9602,
    "mediaId": 2574,
    "date": "2022-03-23",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> criticized Trump-era trade policies toward Beijing in an interview on Chinese state TV.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Criticized Trump’s China Trade Policy in Interview With CCP Media"
  },
  {
    "id": 9517,
    "mediaId": 2601,
    "date": "2022-03-24",
    "sentence": "Oz has made millions of dollars in China from his television show and his health sponsorship deals\nWFB: Dr. <span class='selected-term'>Mehmet Oz</span> criticized Trump-era trade policies toward Beijing in an interview on Chinese state TV.",
    "author": "MJA",
    "title": "Dr. Oz Criticized Trump’s China Trade Policy in Interview With CCP Media"
  },
  {
    "id": 9786,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Alex Gangitano",
    "title": "Biden ‘hopeful’ China won’t help Russia"
  },
  {
    "id": 9089,
    "mediaId": 2658,
    "date": "2022-03-24",
    "sentence": "The White House asked <span class='selected-term'>Mehmet Oz</span> and Herschel Walkerto resign from the President’s Council on Sports, Fitness & Nutrition.",
    "author": "",
    "title": "POLITICO Playbook: Biden in Europe, WMD fears at center stage"
  },
  {
    "id": 8904,
    "mediaId": 2526,
    "date": "2022-03-29",
    "sentence": "Celebrity Doctor <span class='selected-term'>Mehmet Oz</span>, candidate for U.S. Senate in Pennsylvania, reportedly co-authored a book with the head of a university controlled by the Chinese Communist Party (CCP), which touted the benefits of traditional Chinese medicine that has seen pushback in the West over the years.",
    "author": "Jacob Bliss",
    "title": "Report: Mehmet Oz Co-Authored Book Touting Controversial Medicine With CCP-Backed Academic"
  },
  {
    "id": 9510,
    "mediaId": 2574,
    "date": "2022-03-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> coauthored a book touting the benefits of traditional Chinese medicine with the head of a Beijing university controlled by the Chinese Communist Party.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Promoted Controversial Medicine in Book Written With CCP-Backed Academic"
  },
  {
    "id": 5390,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Philip Lenczycki",
    "title": "China Stockpiling Nuclear Weapons At An Alarming Rate: Report"
  },
  {
    "id": 5334,
    "mediaId": 2557,
    "date": "2022-04-15",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nCelebrity Doctor <span class='selected-term'>Mehmet Oz</span>, who is running as a tough-on-China candidate in the race to fill Pennsylvania’s Senate seat, is coming under fire again for his long history with the communist country.",
    "author": "DML News App",
    "title": "REPORT: Mehmet Oz’s China Ties Deepen: Financial Disclosures"
  },
  {
    "id": 4780,
    "mediaId": 2594,
    "date": "2022-04-23",
    "sentence": "But they have also provoked backlash from some Republicans who believe Trump has betrayed his core supporters by backing “Hillbilly Elegy” author JD Vance in Ohio and TV’s Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Via AP news wire",
    "title": "AP News Digest 3:15 a.m."
  }
]