[
  {
    "id": 4601,
    "mediaId": 2590,
    "date": "2022-01-13",
    "sentence": "A political action committee supporting another Republican in the race, TV host <span class='selected-term'>Mehmet Oz</span>, launched an ad attacking McCormick’s ties to China, where Bridgewater Associates manages $5 billon of its $150 billion portfolio.",
    "author": "Liz Skalka",
    "title": "Hedge Fund Exec David McCormick Latest To Enter Pennsylvania Senate Race"
  },
  {
    "id": 3028,
    "mediaId": 2551,
    "date": "2022-01-29",
    "sentence": "+5\nView gallery\nMedical emergency: Dr. <span class='selected-term'>Mehmet Oz</span>, 61, rushed in to help a man who collapsed and went unconscious at a caucus meeting just outside Pittsburgh onSaturday morning; pictured in 2020\nSources at the scene alleged that Oz was next in line to speak when the man fell, and he immediately rushed over in time to lower him to the ground.",
    "author": "Kevin Kayhart For Dailymail.com",
    "title": "Dr. Oz jumps into action to help man who collapsed at a caucus meeting... as he continues his run for U.S Senate seat in Pennsylvania"
  },
  {
    "id": 3027,
    "mediaId": 2557,
    "date": "2022-01-30",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Fox News:\nDr. <span class='selected-term'>Mehmet Oz</span> aided a man who called out for a doctor and then collapsed at a Pennsylvania Republican event this weekend.",
    "author": "DML News App",
    "title": "REPORT: Dr. Oz rushes to help unconscious man at Pennsylvania GOP event"
  },
  {
    "id": 2100,
    "mediaId": 2540,
    "date": "2022-02-04",
    "sentence": "\"<span class='selected-term'>Mehmet Oz</span> - citizen of Turkey, creature of Hollywood - has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,\" said Jess Szymanski, referring to the Chinese Communist Party.",
    "author": "Michael Warren",
    "title": "Pennsylvania Senate Republican race between Oz and McCormick turns ugly early"
  },
  {
    "id": 9255,
    "mediaId": 2732,
    "date": "2022-03-30",
    "sentence": "Republican Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> spoke at a campaign event in Canonsburg on Wednesday evening, highlighting his energy policies and taking questions about the legitimacy of the 2020 election.",
    "author": "Ryan Deto",
    "title": "Senate candidate Oz talks fracking support and election fraud at Canonsburg campaign event"
  },
  {
    "id": 5932,
    "mediaId": 2556,
    "date": "2022-04-10",
    "sentence": "“The great commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nIn his statement, Trump also said Oz was especially popular with women because of his work in daytime TV, and could do well in Philadelphia and Pittsburgh.",
    "author": "",
    "title": "Dr. Oz Picks Up Donald Trump Endorsement For Republican Nod In Pennsylvania Senate Race"
  },
  {
    "id": 5421,
    "mediaId": 6571,
    "date": "2022-04-11",
    "sentence": "",
    "author": "",
    "title": "Pets help manage stress and anxiety, experts say"
  },
  {
    "id": 5525,
    "mediaId": 2533,
    "date": "2022-04-11",
    "sentence": "Dr. Oz also passionately believes in high-quality education and protecting parent involvement throughout the process.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\n“Women, in particular, are drawn to Dr. Oz for his advice and counsel.",
    "author": "Staff -",
    "title": "Dr. Oz Is Running for Senate and He Just Got Big News From Donald Trump"
  }
]