[
  {
    "id": 3437,
    "mediaId": 2630,
    "date": "2022-02-01",
    "sentence": "In particular, Dr. <span class='selected-term'>Mehmet Oz</span>, a Pennsylvania Senate candidate, has made Covid a central theme of his campaign, running two ads that criticize the federal government’s response.",
    "author": "",
    "title": "The GOP’s midterm playbook: Flip the script on Covid"
  },
  {
    "id": 126,
    "mediaId": 2551,
    "date": "2022-02-24",
    "sentence": "+8\nView gallery\n+8\nView gallery\nFormer Democratic Rep. Tulsi Gabbard (left) and Dr. <span class='selected-term'>Mehmet Oz</span> (right) will both be appearing at the Conservative Political Action Conference in Orlando, Florida, where it was moved to get away from strict COVID-19 protocols\n+8\nView gallery\nSo far, former Rep. Tulsi Gabbard is the only prominent Democrat slated to appear at CPAC, a gathering for those on the political right.",
    "author": "",
    "title": "'P***ed off' conservatives gather in Orlando for 'awake not woke' CPAC conference as organizer Matt Schlapp says Americans are tired of being told what to do by the Biden administration"
  },
  {
    "id": 5258,
    "mediaId": 2618,
    "date": "2022-04-09",
    "sentence": "There are seven people running for the PA senate seat including two women, one white, one black: Kathy Barnette (Republican): MAGA businesswoman from Montgomery County, occasional Fox News commentator; Jeff Bartos (Republican): A real estate investor from Montgomery County; Sean Gale (Republican): A lawyer from Montgomery County; David McCormick (Republican) A former CEO of one of the world's largest hedge funds; <span class='selected-term'>Mehmet Oz</span> (Republican): A TV celebrity doctor; Carla Sands (Republican): from Mechanicsburg, Trumps' former ambassador to Denmark; George Bochetto (Republican): A Philadelphia defense attorney who sued the city over boxing-up of a statue of Christopher Columbus.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Donald Trump Endorses Mehmet Oz in Pennsylvania U.S. Senate Race"
  },
  {
    "id": 5249,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Harriet Alexander",
    "title": "Disney heir who works as a high school biology teacher comes out as transgender man and blasts Ron DeSantis' so-called 'Don't Say Gay' law: Family makes $500,000 donation to LGBTQ advocacy group"
  },
  {
    "id": 5209,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Nick Arama",
    "title": "Disney's Colossal Political Error in Challenging DeSantis Will Cost It Dearly"
  },
  {
    "id": 5959,
    "mediaId": 2752,
    "date": "2022-04-13",
    "sentence": "He’s endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania GOP Senate primary and South Dakota Governor Kristi Noem.",
    "author": "Stephen Robinson",
    "title": "Trump To Ron DeSantis: Just Do Me A Favor Though"
  },
  {
    "id": 5668,
    "mediaId": 2589,
    "date": "2022-04-18",
    "sentence": "Jim Justice who testifies that “McKinley stands with Trump.” In the Pennsylvania Senate race, where Trump just recently endorsed TV personality Dr. <span class='selected-term'>Mehmet Oz</span>, businessman David McCormick has been running ads in which he pledges to “fight for America First energy policies like Donald Trump” and to “fight for what Trump and Reagan showed us all — the world is safest when America is strongest.” A recent ad for Gov.",
    "author": "Allahpundit",
    "title": "Megadonors at Manchin fundraiser whisper: He should run for president as a Republican in 2024"
  }
]