[
  {
    "id": 3536,
    "mediaId": 2746,
    "date": "2022-01-29",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span>, a close Trump ally and current Republican contender in the state’s gubernatorial race, also chimed in.",
    "author": "Joseph Clark",
    "title": "Trump, supporters take victory lap after Pennsylvania court decision on mail-in voting"
  },
  {
    "id": 2759,
    "mediaId": 2664,
    "date": "2022-02-01",
    "sentence": "The slate of fake electors includes <span class='selected-term'>Lou Barletta</span> and Charlie Gerow, both candidates for governor in Pennsylvania; Burt Jones, a candidate for lieutenant governor in Georgia; James Lamon, a candidate for U.S. Senate from Arizona; and candidates for state legislative seats.",
    "author": "Kira Lerner",
    "title": "Trump’s fake electors: Here’s the full list"
  },
  {
    "id": 3515,
    "mediaId": 2540,
    "date": "2022-02-02",
    "sentence": "And in Pennsylvania, Republican gubernatorial candidate <span class='selected-term'>Lou Barletta</span> has cited flights carrying children to the state for care from the border in his criticism of the Biden administration.",
    "author": "Priscilla Alvarez",
    "title": "Internal documents show heated back-and-forth between DeSantis and Biden admin over care of migrant children"
  },
  {
    "id": 888,
    "mediaId": 2658,
    "date": "2022-02-15",
    "sentence": "Mastriano is running for governor of Pennsylvania, and has polled in second place — behind former Rep. <span class='selected-term'>Lou Barletta</span> — in multiple Republican primary polls, as City & State Pennsylvania has detailed.",
    "author": "",
    "title": "Jan. 6 panel targets key players in false Trump elector strategy"
  },
  {
    "id": 83,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "White is sitting in a crowded primary field that includes former U.S. Rep. <span class='selected-term'>Lou Barletta</span> and William McSwain, a former U.S. attorney.",
    "author": "Matt Leach",
    "title": "Pennsylvania gubernatorial candidate gets private sit-down with Trump at CPAC; will seek endorsement"
  },
  {
    "id": 15335,
    "mediaId": 8481,
    "date": "2022-03-07",
    "sentence": "The TargetPoint poll also found former Congressman <span class='selected-term'>Lou Barletta</span> leading Republican candidates in the Governor race.",
    "author": "George Stockburger",
    "title": "McCormick leads latest Pennsylvania Senate GOP race poll"
  },
  {
    "id": 15297,
    "mediaId": 8254,
    "date": "2022-03-07",
    "sentence": "The TargetPoint poll also found former Congressman <span class='selected-term'>Lou Barletta</span> leading Republican candidates in the Governor race.",
    "author": "George Stockburger",
    "title": "McCormick leads latest Pennsylvania Senate GOP race poll"
  },
  {
    "id": 10015,
    "mediaId": 8254,
    "date": "2022-03-31",
    "sentence": "Gubernatorial candidate Bill McSwain was a Trump-appointed U.S. Attorney and <span class='selected-term'>Lou Barletta</span> was endorsed by Trump in the 2018 Senate race.",
    "author": "",
    "title": "President Trump’s endorsement could sway voters in the Pennsylvania primary election, new poll finds"
  },
  {
    "id": 6224,
    "mediaId": 8254,
    "date": "2022-04-12",
    "sentence": "Former congressman <span class='selected-term'>Lou Barletta</span> received over double McSwain, receiving 19.8%.",
    "author": "George Stockburger",
    "title": "Trump calls GOP governor candidate McSwain a coward, will not endorse"
  },
  {
    "id": 6202,
    "mediaId": 8254,
    "date": "2022-04-12",
    "sentence": "Should Corman exit the race, eight Republicans remain in the crowded field: Doug Mastriano, Melissa Hart, <span class='selected-term'>Lou Barletta</span>, Joe Gale, Nche Zama, William McSwain, Dave White, and Charlie Gerow.",
    "author": "Dennis Owens",
    "title": "Jake Corman petitions to remain in Governor’s race after reportedly speaking with Donald Trump"
  },
  {
    "id": 5296,
    "mediaId": 2641,
    "date": "2022-04-12",
    "sentence": "A WHTM/Emerson College Polling/The Hill Pennsylvania primary survey last week showed former Rep. <span class='selected-term'>Lou Barletta</span> (19.8%) with a slight lead over state Sen. Doug Mastriano (19.4%) in the GOP gubernatorial primary race.",
    "author": "Charlie McCarthy",
    "title": "Trump Blasts Pennsylvania Governor Hopeful McSwain, Withholds Endorsement"
  },
  {
    "id": 5803,
    "mediaId": 2629,
    "date": "2022-04-13",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span> (R-PA) is the current front-runner in the crowded field of Republicans running to become Pennsylvania's next governor.",
    "author": "Emily Singer",
    "title": "Trump Bashes GOP Candidate In Pennsylvania For Failing To Overturn 2020 Election"
  },
  {
    "id": 6990,
    "mediaId": 8493,
    "date": "2022-04-13",
    "sentence": "Should Corman exit the race, eight Republicans remain in the crowded field: Doug Mastriano, Melissa Hart, <span class='selected-term'>Lou Barletta</span>, Joe Gale, Nche Zama, William McSwain, Dave White, and Charlie Gerow.",
    "author": "WKOK Staff",
    "title": "Jake Corman Pulls Out, Then Returns to PA Gubernatorial Race"
  },
  {
    "id": 5694,
    "mediaId": 2735,
    "date": "2022-04-14",
    "sentence": "Leading GOP candidates Doug Mastriano and <span class='selected-term'>Lou Barletta</span> even took part in Trump’s fraudulent elector scheme.",
    "author": "Igor Derysh",
    "title": "Trump Says He Advised Barr to Get Impeached in Support of Bogus Election Claims"
  }
]