[
  {
    "id": 3536,
    "mediaId": 2746,
    "date": "2022-01-29",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span>, a close Trump ally and current Republican contender in the state’s gubernatorial race, also chimed in.",
    "author": "Joseph Clark",
    "title": "Trump, supporters take victory lap after Pennsylvania court decision on mail-in voting"
  },
  {
    "id": 3515,
    "mediaId": 2540,
    "date": "2022-02-02",
    "sentence": "And in Pennsylvania, Republican gubernatorial candidate <span class='selected-term'>Lou Barletta</span> has cited flights carrying children to the state for care from the border in his criticism of the Biden administration.",
    "author": "Priscilla Alvarez",
    "title": "Internal documents show heated back-and-forth between DeSantis and Biden admin over care of migrant children"
  },
  {
    "id": 3060,
    "mediaId": 2748,
    "date": "2022-02-03",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span> (R-PA), running for governor in Pennsylvania, has vowed to take similar action to ensure that NGOs and private contractors are not doing business with the state while aiding in illegal immigration.",
    "author": "John Binder",
    "title": "House Republicans Seek to Bankrupt Corporate-Funded NGOs Aiding Biden’s ‘Mass Invasion’"
  },
  {
    "id": 888,
    "mediaId": 2658,
    "date": "2022-02-15",
    "sentence": "Mastriano is running for governor of Pennsylvania, and has polled in second place — behind former Rep. <span class='selected-term'>Lou Barletta</span> — in multiple Republican primary polls, as City & State Pennsylvania has detailed.",
    "author": "",
    "title": "Jan. 6 panel targets key players in false Trump elector strategy"
  },
  {
    "id": 11149,
    "mediaId": 6570,
    "date": "2022-03-17",
    "sentence": "Former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, a leading contender for the GOP nomination in the Pennsylvania governor’s race, is hoisting up the economic impacts of Russia’s invasion into Ukraine as a portrait of why American energy independence is so important.",
    "author": "Julian Routh",
    "title": "GOP governor candidate Lou Barletta says Pennsylvania could lead the way for U.S. energy independence"
  },
  {
    "id": 6224,
    "mediaId": 8254,
    "date": "2022-04-12",
    "sentence": "Former congressman <span class='selected-term'>Lou Barletta</span> received over double McSwain, receiving 19.8%.",
    "author": "George Stockburger",
    "title": "Trump calls GOP governor candidate McSwain a coward, will not endorse"
  },
  {
    "id": 5803,
    "mediaId": 2629,
    "date": "2022-04-13",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span> (R-PA) is the current front-runner in the crowded field of Republicans running to become Pennsylvania's next governor.",
    "author": "Emily Singer",
    "title": "Trump Bashes GOP Candidate In Pennsylvania For Failing To Overturn 2020 Election"
  }
]