{
  "id": 1006,
  "mediaId": 8469,
  "date": "2022-02-15",
  "headline": "Senator seeking GOP governor nomination issued 1/6 subpoena",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2017/11/cropped-web1_22-TL-Logo.jpg.webp",
  "link": "https://www.timesleader.com/wire/state-wire/1539663/senator-seeking-gop-governor-nomination-issued-1-6-subpoena",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The Jan. 6 committee also noted his presence outside the Capitol the day of the insurrection, saying his public statements indicated “you witnessed ‘agitators … getting in the face of the police’ and ‘agitators … start pushing the police up the Capitol steps.”\n“We would like to better understand these statements and expenditures, events that you witnessed or in which you participated, and communications we believe you may have had with national, state and local officials” about the 2020 presidential election outcome, wrote U.S. Rep. Bennie Thompson, the Mississippi Democrat who chairs the Jan. 6 committee.",
    "In an email to his GOP colleagues sent a day earlier, Mastriano advised them to fill out security details in the RSVP “if you would like to join us for lunch with POTUS at the White House tomorrow.”\nDuring online chats with his growing cadre of supporters and admirers, Mastriano has repeatedly said he’s had regular, direct contact with Trump, boasting about having spoken with the then-president at least 15 times.",
    "He subsequently claimed he left the U.S. Capitol area after the eruption of violence, which in the aftermath he called “unacceptable.”\nMastriano was unknown in state political circles when he won a May 2019 special election for a state Senate seat in a mostly rural district that straddles Interstate 81 along the Maryland-Pennsylvania state line.",
    "By MARK SCOLFORO and MARC LEVY\nHARRISBURG, Pa. (AP) — A Pennsylvania state senator who was in regular communication with Donald Trump as the then-president sought to reverse his 2020 election loss, and was outside the U.S. Capitol the afternoon of the Jan. 6 rioting, was subpoenaed Tuesday by the congressional .",
    "Days after President Joe Biden’s victory was certified in Pennsylvania, Mastriano sponsored a resolution in the Legislature to undo the certification, declare the election in dispute and effectively overturn state law by empowering the Republican-controlled Legislature to pick electors.",
    "The committee in December also requested an interview with Republican U.S. Rep. Scott Perry, who has advanced baseless conspiracies about the election being stolen, including on the floor of the U.S. House when he voted to object to Pennsylvania’s electoral votes being cast for Biden.",
    "Sen. Doug Mastriano, a former Army officer currently seeking the Republican nomination for governor, was asked by the Jan. 6 select committee to hand over documents and information about efforts to name a slate of alternate Electoral College electors for Trump.",
    "Last month, the House Jan. 6 committee released subpoenas for Bill Bachenberg and Lisa Patton, the two chairpersons of a competing Electoral College meeting held by Republicans in December 2020 to submit rival Pennsylvania electoral votes for Trump.",
    "As Trump’s efforts to overturn the results gathered speed in the ensuing weeks, Mastriano helped organize and host a four-hour state Senate Republican policy hearing regarding the election, held Nov. 25 at a hotel conference room in Gettysburg.",
    "By spring of 2020, Mastriano had emerged as a leader of opposition to pandemic mitigation efforts, telling protesters they should “rise up” and “say ‘no’ to tyranny.”\nMastriano is not the first Pennsylvanian to be subpoenaed by the committee.",
    "Mastriano was among Trump’s most dedicated supporters during the 2020 campaign, and the night Trump’s loss became evident on Nov. 7, he addressed a few thousand disappointed Trump supporters outside the Pennsylvania Capitol.",
    "Mastriano traveled to the White House the evening of the Gettysburg hearing for a private event to strategize about the election results, but tested positive for COVID-19 and had to leave.",
    "He later posted a video on Facebook describing his case as “pretty mild.”\nHe then urged fellow Republican state senators to join him for lunch with Trump on Dec. 23.",
    "Mastriano organized bus trips to the U.S. Capitol on Jan. 6 and advertised himself ahead of time as a scheduled speaker on the Capitol steps during the afternoon.",
    "He previously denied breaking any laws that day and there is no evidence Mastriano entered the Capitol building or that he participated in the violence.",
    "The letter to Perry said he had “an important role” in efforts to install Justice Department official Jeffrey Clark as acting attorney general.",
    "He has declined repeated efforts by The Associated Press over the past year to interview him about what he did and saw that day.",
    "Trump lawyer Rudy Giuliani attended, and Trump claimed during a roughly 11-minute video call that the election was rigged.",
    "The committee cited a that said he was pushing to have the Pennsylvania Legislature appoint electors.",
    "The resolution did not gather any cosponsors and died in committee without action on Nov. 30.",
    "A cellphone voicemail and an email were sent to Mastriano seeking comment.",
    "Perry declined the committee’s interview, calling the body “illegitimate.”",
    "“This election has to be turned around,” Trump told the Gettysburg crowd.",
    "He has described getting prime seats to Trump’s speech before the riot.",
    "He easily won reelection in 2020."
  ]
}