{
  "id": 11346,
  "mediaId": 2636,
  "date": "2022-03-16",
  "headline": "A Proud Dad in the Stands, Omar Minaya Is Still a Scout at Heart",
  "image": "https://static01.nyt.com/images/2022/03/16/sports/16mcbb-minaya1/16mcbb-minaya1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/03/16/sports/justin-minaya-providence-south-dakota-state.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4491,
    1796,
    2041,
    2624,
    2693,
    3510,
    4189,
    3863,
    266
  ],
  "sentences": [
    "The guy, you would think he’s a basketball G.M., not a baseball G.M.”\nOmar Minaya is one of several famous fathers who could be in Buffalo for games this week: Connecticut Coach Dan Hurley is a son of the Naismith Hall of Famer Bob Hurley, coach of St. Anthony High in Jersey City, N.J., until its closure in 2017, while his assistant, Luke Murray, is a son of the actor Bill Murray.",
    "“He’s always liked athletic guys, so I’m pretty sure when he sees athletic basketball players that have length, that can do a lot of different athletic things, it’s kind of the same way as he was scouting in baseball.”\nOmar Minaya had a short-lived career in the minor leagues, as well as stints in professional leagues in both his native Dominican Republic and Italy.",
    "Omar Minaya also shares insights on players and team building with Providence Coach Ed Cooley, who was named the conference’s coach of the year after his team won its first Big East regular season title in program history after being picked in the preseason coaches’ poll to finish seventh.",
    "For him to hear ‘Justin Minaya’s dad,’ I know that meant a lot to him.”\nHowever Providence’s season ends, Justin, who is averaging 6.4 points, 5.8 rebounds and 1.5 steals, has to decide whether to return to campus next season or attempt to start a professional career.",
    "The two developed a friendship, and after Rosas became the Minnesota Timberwolves’ president of basketball operations in 2019, he brought Minaya in during the pandemic for “multiple conversations” with the staff about minority leadership, scouting and team building.",
    "“In Minnesota, we were reshaping the direction, we were doing it with young talent, but we also wanted to be selective about the guys that we brought in to help define our character and our DNA,” said Rosas, whom Minnesota fired last year.",
    "While watching Justin play in the Big East tournament semifinals Friday from section 102 of Madison Square Garden, Omar was impressed by Creighton’s 7-foot-1 sophomore center Ryan Kalkbrenner, the Big East Defensive Player of the Year.",
    "When Justin transferred to Providence before this season, it meant he was joining the Big East Conference, where his parents Rachel and Omar could watch virtually every game, including at local schools like St. John’s and Seton Hall.",
    "Krause, who died in 2017, had a scouting background in both baseball and basketball, having worked for the White Sox before becoming the architect of the Michael Jordan-era Chicago Bulls, who won six N.B.A.",
    "contributor: When Justin played for South Carolina in the Southeastern Conference, Omar was a big fan of Herb Jones, a 6-foot-7 Alabama forward whom New Orleans selected 35th overall in last year’s N.B.A.",
    "higher-ups, like Knicks General Manager Scott Perry and Gersson Rosas, whom the team hired earlier this year as a consultant, though Minaya has no official relationship with the Knicks.",
    "“I’m a big believer you can learn from other sports.”\nRosas said Minaya suggested balancing out a young roster of stars like Karl-Anthony Towns and Anthony Edwards, both No.",
    "He also likes Justin Lewis, a redshirt freshman forward for Marquette who averaged 17.1 points and 7.9 rebounds per game and was among the league’s best players this season.",
    "After injuries ended his playing career, he joined the Texas Rangers in 1985 as a scout, helping to sign Latino players such as Sammy Sosa, Juan Gonzalez and Ivan Rodriguez.",
    "He eventually held top front office jobs with the Expos and then the Mets, where he signed pitcher Pedro Martinez and outfielder Carlos Beltran to free-agent contracts.",
    "“And we did some of those things here last summer with guys like Patrick Beverley and Taurean Prince.”\nOne player Minaya watched in college has quickly become an N.B.A.",
    "“I think he’s actually pretty good,” Justin, a 22-year-old forward for the Friars who also played baseball growing up in North Jersey, said in a phone interview.",
    "“Me and my friends joke about it, he’ll come to practice, and he’ll be sitting in the stands not near anybody, looking like a scout,” Justin said with a laugh.",
    "Minaya was also close with the longtime New York City basketball scout Tom Konchalski, who scouted Justin in high school and died in 2021 of prostate cancer.",
    "When Minaya was with the Mets, he also hired T.J. Barra, currently the director of basketball research and innovation with the reigning N.B.A.",
    "Listening to him, he’ll know what he’s looking for in a particular organization as far as the character trait, the DNA trait, the skill set.",
    "“It’s always pretty cool, too, when my dad talks about somebody came up to him and asked, ‘Aren’t you Justin Minaya’s dad?’” Justin said.",
    "You have to have the quantifiable with the non-quantifiable and blend that in, and that’s leadership.”\nMinaya now has the ear of N.B.A.",
    "Minaya is now involved with the Thomas C. Konchalski Foundation, which awards high school scholarships to young basketball players.",
    "He is averaging 9.6 points and 3.9 rebounds per game with the Pelicans and is a player Justin patterns his game after, Omar said.",
    "“He loved hoops, I loved baseball and it was an opportunity to connect with a very intelligent and interesting guy,” Rosas said.",
    "He enjoys going to college basketball games, not only to watch his son, but to scout potential pro talent from other teams.",
    "When Justin Minaya and fourth-seeded Providence take the court in Buffalo on Thursday for their first-round N.C.A.A.",
    "tournament game against 13th-seeded South Dakota State, there will be one keenly interested scout in the stands.",
    "Omar Minaya is not only Justin’s father; he is also a former general manager of the Mets and the Montreal Expos.",
    "“I think he thinks I have a great chance,” Justin said, “whether it’s playing in the league or playing overseas.",
    "1 overall draft picks, with veterans — the same way Minaya had brought in Martinez and Beltran with the Mets.",
    "Currently a scouting consultant for Major League Baseball, Minaya, 63, also has an eye for basketball talent.",
    "“He was actually a guy I looked up to very early on for me in my trajectory, being the first Latino G.M.",
    "“Jerry was all about athletes and makeup, guys who were good teammates and had “I.Q.,” Minaya said.",
    "Rosas, 43, said Minaya “played a huge role” as a mentor given that both are from Latin America.",
    "Minaya always respected Krause’s ability to identify talent, especially in two sports.",
    "I know he thinks that I can do it and having that belief from him, it means a lot.”",
    "In 2005, he made another key deal, bringing Jerry Krause to the Mets as a scout.",
    "Marquette and Creighton are among the six Big East teams in the N.C.A.A.",
    "So what does his father, the basketball scout, think about his chances?",
    "(Rosas was born in Colombia; Minaya is from the Dominican Republic.)",
    "Asked if he thought Minaya could make the leap to N.B.A.",
    "Sometimes, he even relays tips to his friends in N.B.A.",
    "“All my life I’ve been hearing I’m Omar Minaya’s son.",
    "champion Milwaukee Bucks, who served as a data guru.",
    "tournament, and both play Thursday in Fort Worth.",
    "in baseball,” Rosas said in a phone interview.",
    "Basically, things that were not quantifiable.",
    "“One hundred percent he could,” he said.",
    "“No 1, he knows the professional ranks.",
    "scouting, Cooley did not hesitate.",
    "2, he knows how to evaluate.",
    "“Guys that knew how to play.",
    "championships in the 1990s.",
    "circles.",
    "draft.",
    "No."
  ]
}