{
  "id": 1148,
  "mediaId": 8489,
  "date": "2022-02-16",
  "headline": "High-ranking oil and gas official resigns from DEP",
  "image": "https://whyy.org/wp-content/uploads/2022/02/IMG_5912-1920x1078.jpeg",
  "link": "https://whyy.org/articles/high-ranking-oil-and-gas-official-resigns-from-dep/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel McDevitt",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The state Supreme Court in 2013 and 2016 struck down parts of the law as unconstitutional, including its preemption of local zoning, use of eminent domain for storage facilities and exclusion of private wells from notification of hazardous spills.",
    "Perry oversaw efforts to move the agency’s permitting and inspection reports online and promoted policies such as recycling water used in fracking, to lower the need for more fresh water in drilling operations.",
    "Republicans who control the legislature have been unable to reach an agreement with the Wolf Administration over spill reporting requirements and whether wastewater can be used to suppress dust on roads.",
    "The agency is also considering a petition to have drillers insure wells at higher rates, so they will be cleaned up at the end of their productive lives.",
    "DEP is working to update regulations for conventional drillers, which drill shallower wells than fracking companies and are typically smaller operations.",
    "DEP will be in charge of applying for and administering the funds, which could total more than $100 million just in the first phase of the program.",
    "As of Friday, Scott Perry is no longer Deputy Secretary for Oil and Gas Management at DEP, an agency spokesman confirmed in an email.",
    "Leaders of the House and Senate energy committees did not have much to say about Perry’s resignation as of Wednesday morning.",
    "The state is about to get an influx of federal money to plug abandoned wells that leak the potent greenhouse gas methane.",
    "Perry had been in the role since then-governor Tom Corbett appointed him in 2011, as the shale gas boom was taking off.",
    "Old wells leak the potent greenhouse gas methane and toxins that can cause health issues for people who live nearby.",
    "He had been scheduled to give a presentation to the Environmental Quality Board about regulatory fees on Tuesday.",
    "In 2020, a grand jury report said DEP failed to protect the public from the health effects of fracking.",
    "The top deputy for oil and gas programs is out at the state Department of Environmental Protection.",
    "Sen. Carolyn Comitta (D-Chester) and Rep. Daryl Metcalfe (R-Butler) did not immediately respond.",
    "The law was challenged by environmentalists and communities who wanted to keep drilling out.",
    "During his tenure, he helped create new comprehensive regulations in Act 13 of 2012.",
    "Perry leaves DEP as it is dealing with several big issues concerning oil and gas.",
    "3 months ago\nPerry’s position was created in response to the shale gas boom.",
    "DEP did not comment on Perry’s resignation, citing personnel matters.",
    "Rep. Greg Vitali (D-Delaware) said he was surprised by the news.",
    "He said he did not know the reason for the departure.",
    "Sen. Gene Yaw (R-Lycoming) had no comment.",
    "It has not announced a replacement."
  ]
}