{
  "id": 12964,
  "mediaId": 2641,
  "date": "2022-03-07",
  "headline": "Rep. Scott Perry to Newsmax: US Must Produce Oil to Stop Putin, Help Americans",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=d7a42f5f-9607-452a-9019-7159438d1fdb&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/scott-perry-oil-natural-gas-vladimir-putin/2022/03/07/id/1059962/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sandy Fitzgerald",
  "authorUrl": "",
  "termIds": [
    5200,
    4591,
    4905,
    4195,
    3671,
    2693,
    910,
    6678,
    6672
  ],
  "sentences": [
    "Meanwhile, Secretary of State Antony Blinken told CNN on Sunday that the United States is \"working with Poland as we speak to see if we can backfill anything that they provide to the Ukrainians,\" including fighter jets, and while Perry said he supports that, he questioned the wisdom of \"telegraphing our actions\" to Putin.",
    "\"Russia must be cut off from the rest of the world and made to feel the pain so they pull their forces not only out of Ukraine from this incursion, but from the previous ones, and then other countries like Georgia, where they invaded in the past,\" Perry concluded.",
    "Perry, though, said there is no reason for the United States to shirk from helping Ukraine out of fear of escalating tensions, and he thinks an agreement on backfilling planes and weapons sent to the war-torn country \"should have happened a long time ago.",
    "The United States must start putting its natural gas and oil onto the market not only to stop funding Russian President Vladimir Putin's war machine but also to help bring down prices and help Americans, Rep. Scott Perry, R-Pa., told Newsmax on Monday.",
    "However, Perry said he questions whether Putin will ever be brought to account for any war crimes occurring in the invasion and bombardment of Ukraine because war crime charges \"are only functional if you can get the person on trial and punish them.\"",
    "While the United States should not be buying Russian oil, which is putting \"about $65 [million] or $75 million a day\" toward Putin's attacks on Ukraine, the other side of the equation is to reopen the United States' capabilities, said Perry.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\n© 2022 Newsmax.",
    "\"The gas prices started going up long before the invasion of Ukraine because of the United States policy, the Biden policy to quit drilling for gas and oil and providing it on the open market,\" he added.",
    "But with Putin being the leader of a sovereign nation, that means it will be up to his county to hold him accountable, and \"that's why the screws need to be turned down on every single way on Russia.\"",
    "By taking further action, he added, that puts \"despots, wherever you live\" on alert to \"stay in your own countries and quit invading your neighbors [as] you're not going to be rewarded for doing it.\"",
    "\"The hunt for the high gas price scapegoat just continues all around the country and, of course, President [Joe] Biden and the left are leading this safari,\" Perry told \"Wake Up America.\"",
    "Russia must also be stopped from negotiating on the behalf of the United States for the Iran nuclear deal, and must be cut off from the rest of the world, said Perry.",
    "Americans can't afford the higher gas prices, particularly at a time when their wages are no longer going up to meet the record levels of inflation, said Perry.",
    "\"If you're living in Poland or Belarus, you're very concerned, and so the thing to do is to let Vladimir Putin know that this is not going to stand.",
    "\"We have no quarrel with the Russian people, but Vladimir Putin must feel the pain from his people,\" said Perry.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "No exports, no imports, removal from the National Security Council.",
    "America must be united in this cause against Vladimir Putin.\"",
    "\"I'm not sure how tensions can get any higher,\" said Perry.",
    "\"It's all self-inflicted and unnecessary,\" said Perry.",
    "\"These are all policies of Joe Biden and the left.\"",
    "That alone should be without question.",
    "He's not going to stay in Ukraine.\"",
    "102, Cox cable, Suddenlink Ch.",
    "It really shouldn't be news.\"",
    "1115, Spectrum, U-verse Ch.",
    "That's non-negotiable.\"",
    "\"They must be cut off.",
    "349, Dish Network Ch.",
    "\"This all must stop.",
    "All rights reserved.",
    "102, Mediacom Ch.",
    "615, Frontier Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch.",
    "Special Links:"
  ]
}