{
  "id": 1914,
  "mediaId": 2641,
  "date": "2022-02-08",
  "headline": "Rep. Brian Mast Introduces Bill to Defend Medical Privacy in Military",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=064773aa-93ea-4bff-a12f-0f76d7f75455&SiteName=Newsmax",
  "link": "https://www.newsmax.com/us/congressman-army-bill-discharge/2022/02/08/id/1055984/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Malbin",
  "authorUrl": "",
  "termIds": [
    4381,
    4596,
    4983,
    5289,
    4135,
    3015,
    1126,
    1162
  ],
  "sentences": [
    "The bill is cosponsored by Representatives Jeff Duncan, R-S.C., Brian Babin, R-Texas, Tracey Mann, R-Kan., Matt Gaetz, R-Fla., Greg Steube, R-Fla., Jody Hice, R-Ga., Scott Perry, R- Pa., Glenn Grothman, R-Wis., Gus Bilirakis, R- Fla., Bill Posey, R-Fla., Louie Gohmert, R- Texas, Lisa McClain, R-Mich., Matthew Rosendale, R-Mont., Bill Huizenga, R-Mich., Rodney Davis, R-Ill., Andy Biggs, R-Ariz., Michael Cloud, R-Texas, Rick Allen, R-Ga., Dan Bishop, R-N.C., Billy Long, R-Mo., and Mike Kelly, R-Pa.\nSpecial Links:",
    "The bill would require the Secretaries of the Army, Navy, and Air Force to reinstate, at their previous rank, the soldiers, sailors, airmen, and marines who separated from service following President Joe Biden's vaccine mandate.",
    "Former President Donald Trump said in January that \"Congress should pass a bill rehiring every single member of the military who was cruelly and wrongfully terminated by Joe Biden and his ridiculous COVID mandate.\"",
    "\"Vaccine mandates have been used by the Biden Administration to wipe critical thinkers and conservative perspectives out of our military, and America is less safe as a result,\" Rep. Mast said in a statement.",
    "Rep Brian Mast, R-Fla., has introduced legislation to defend service members who have been discharged for exercising their right to medical privacy by declining to take the COVID-19 vaccine.",
    "Approximately 12,000 religious-exemption requests have been filed, and to date, only the Marine Corps has approved any of those requests — three in the last month out of more than 3,000.",
    "To date, 3,350 soldiers — the rough equivalent of three battalions — have declined to get the COVID-19 vaccine and are at risk of being discharged from the Army this week.",
    "\"This bill will strengthen military readiness, as well as get these young men and women back doing what they love: serving our nation.\"",
    "There are more than 15,000 military service members who have refused to comply with the vaccine mandate, according to Military.com.",
    "Roughly 98 percent of the active-duty force has received the COVID-19 vaccine, according to the U.S. Department of Defense.",
    "More than 100 Marines and dozens of sailors were among those removed from the Army and Navy's ranks in December.",
    "Secretary of Defense Lloyd J. Austin III has mandated that all service members receive the shots."
  ]
}