{
  "id": 2312,
  "mediaId": 2586,
  "date": "2022-02-10",
  "headline": "Knicks Refuse to Entertain Trade for Former NBA MVP",
  "image": "https://heavy.com/wp-content/uploads/2022/02/russell-westbrook-knicks.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/new-york-knicks/russell-westbrook-trade-no-interest/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eli Becht",
  "authorUrl": "https://heavy.com/author/elibecht/",
  "termIds": [
    0
  ],
  "sentences": [
    "As it stands right, Westbrook would be a hard contract to move and as Fischer put it on the podcast, teams around the league look at him as “damaged goods.” He did just lead Washington to a playoff berth last season, so he might have to be the lead star on a team he’s on for him to be successful.",
    "If you’ve been paying attention at all to the Los Angeles Lakers, especially as of late, you’ll notice that the Westbrook-James-Davis trio isn’t exactly working out and the team is more than likely looking at ways to move on past Westbrook.",
    "“Like everyone I’ve talked to within the Knicks have had zero interest even entertaining the idea of doing that.”\nWestbrook would definitely make the team better this year, but that wouldn’t really be all that difficult to do.",
    "Knicks Aren’t Interested\nNew York Knicks president Leon Rose, GM Scott Perry and head coach Tom Thibodeau pose for photos with Kemba Walker and Evan Fournier during their introductory press conference.",
    "Speaking on Kevin O’Connor’s podcast The Void, Bleacher Report’s Jake Fischer went into detail about a potential trade that would land Westbrook in New York and send Evan Fournier to Los Angeles.",
    "As the backslide to the bottom of the Eastern Conference standings continues the team will likely be looking to make some trades that send some of their veterans out of town.",
    "The Knicks are within striking distance of the play-in tournament, but is that even worth going for just to potentially be bounced in the first round by a much better team?",
    "There are also opportunities out there to land some players that would help the organization win now, and one of those options is Russell Westbrook.",
    "The NBA trade deadline is February 10, which means if the New York Knicks are going to make a move, they are rapidly running out of time to do so.",
    "He would have the chance to do that on the Knicks, but it doesn’t seem like New York is willing to give him the keys to the offense this year.",
    "“I’ve pitched to the Knicks people, ‘Why not do the Evan Fournier, Julius Randle for Russ stuff,” he began around the 28:10 mark.",
    "If the Knicks would give up Randle and Fournier in the deal, it would also raise the question of how much better would they be?",
    "ESPN’s Bobby Marks floated a trade that would land the former MVP in New York, but nothing has budged on that end as of yet.",
    "Outside of the Knicks, it appears the Rockets could be the next best thing for the Lakers getting Westbrook out of town.",
    "Some markets consider it, but the Knicks want to be a powerhouse for years, so is it something worth going for?",
    "Reporting on the Knicks side of things, he says the team has not shown any sort of interest in doing that.",
    "Fast forward to now, and it appears like the Knicks have absolutely no interest in bringing in Westbrook.",
    "The Rockets have been sitting point guard John Wall year, so he’d be somebody to flip for the former MVP.",
    "What Will Happen to Westbrook?",
    "Is Russ on the move?"
  ]
}