{
  "id": 2488,
  "mediaId": 2639,
  "date": "2022-02-09",
  "headline": "Knicks drubbed early and fall to Nuggets in Denver",
  "image": "https://cdn.newsday.com/image-service/version/c:ZjY1MjE0YmEtZGI5NC00:YWVmNjc5/knicks_nuggets_basketball_54036.jpg",
  "link": "https://www.newsday.com/sports/basketball/knicks/knicks-nuggets-d49021",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Popper",
  "authorUrl": "",
  "termIds": [
    1793,
    1771,
    3112,
    3306,
    3404,
    5620,
    5427,
    903,
    398,
    6111
  ],
  "sentences": [
    "In losing their 10th game in the last 12 and third straight, falling to 24-31 on the season, the Knicks fell behind by 27 points, and they surrendered 83 points in the first half — one point off the franchise record set in 1966 for most points given up in a first half.",
    "But some of the biggest names on the trade market have already switched places, with Portland dealing CJ McCollum to NewOrleans and Indiana sending Domantas Sabonis in a package to Sacramento that brought back Tyrese Haliburton and Buddy Hield.",
    "Coach Tom Thibodeau said Barrett suffered an ankle injury but thought he would be OK. Barrett was still in the game with 24 seconds left, after the rest of the starters had been removed with 51 seconds left.",
    "and Unless there is a major deal made in the coming ,days the best hope remains that Derrick Rose makes it back from his ankle surgery rehabilitation and can carry the team the way he did last season.",
    "One person with knowledge of their talks said that the team has shopped Fournier extensively, trying to get out from under the contract he was given in the summer.",
    "The trading of Haliburton likely means that the Kings — after leaking that they intended to build around Haliburton and De’Aaron Fox — likely will hold on to Fox.",
    "There are pieces on the roster that hold value around the league — Barrett, Julius Randle even after signing the contract extension and regressing this season.",
    "RJ Barrett had 18 points, but still in the game with the Knicks down double-digits and less than a minute left, he went down and limped to the locker room.",
    "The Knicks were run out of the gym by the Nuggets, 132-115, sending them to a much-needed day off before reuniting on the trade deadline at Golden State.",
    "DENVER — As the Knicks walked off the floor at Ball Arena on Tuesday night, there was less than 48 hours to go until Thursday’s NBA trade deadline.",
    "And while he did a credible job, the Knicks were outgunned by a much better team — a 48-minute indication of just how far they are from contending.",
    "The Knicks were without Mitchell Robinson (sore lower back) and Nerlens Noel (sore left knee), leaving Taj Gibson to contend with Nikola Jokic.",
    "But as shown by the latest humbling performance put on display, the Knicks' need for help isn’t exactly making their own pieces easy to move.",
    "But there has been nothing that makes sense to make them better now, which is a hope the organization is clinging to after last season’s No.",
    "And while there seem to be no easy answers as to what the front office can do, it is becoming clear that they need to do something.",
    "Julius Randle put together another solid performance with 28 points, 10 rebounds, three steals, six assists and just one turnover.",
    "Randle said that there was no question in the locker room about the decision to have Barrett in a blowout in the final seconds.",
    "Could the Knicks be boosted by the return of Rose and make things work with the group that has not quite found its footing?",
    "With a schedule that ranked fourth-toughest in the NBA over the final 28 games, bright spots are hard to find.",
    "That may be true, but comparing last year’s team to this one seems to be growing more difficult by the day.",
    "\"Thibs is our leader and I trust Thibs with everything and I’m just a soldier for him,\" Randle said.",
    "They went on a late run and closed the gap to 13 in the fourth quarter, but never really threatened.",
    "He’s who’s in charge and I’m going to do whatever Coach asks me, regardless of what anybody thinks.",
    "Like I said, the only thing that matters is what’s in our locker room and what we think as players.",
    "It’s just about finding a way to play and sticking with that and building confidence and all that.",
    "It’s a tricky part of the season, just before the All-Star break and all the trade rumors.",
    "\"I trust Leon [Rose], William [Wesley], Scott [Perry],\" Knicks coach Tom Thibodeau said.",
    "4 seed effort and a summer spent signing new deals and adding Fournier and Kemba Walker.",
    "Bones Hyland had 22 points for Denver (30-24) which had six players in double figures.",
    "The Knicks are seven games below .500, with two more stops on the five-game road trip.",
    "If something makes sense that they feel can improve the team, we’ll do it.",
    "But it’s the time of the year you’re looking at all the possibilities.\"",
    "Fournier had 21 points and Alec Burks added 14 points off the bench.",
    "\"I really do believe we have the right pieces,\" Evan Fournier said.",
    "But there has been little interest in taking him off their hands.",
    "This group has not fit together nearly as well as that team did.",
    "If they get close on something, they’ll talk to me about it.",
    "And we’re not that far from playing better and getting wins.",
    "\"If he wants me playing 48 minutes, I’ll play 48 minuites.",
    "If he wants me playing 20 minutes, I’ll play 20 minutes.",
    "\"We have talent, we have toughness, we have everything.",
    "The score for this game is currently unavailable.",
    "And whatever he asks me to do, I’m going to do.\"",
    "But the Knicks have given no hint that it will.",
    "They’re up constantly studying opportunities.",
    "Nikola Jokic had 21 points and 11 rebounds.",
    "Like I said, I got Thibs’ back 100 percent.",
    "There’s more focus because of the deadline.",
    "If it doesn’t make sense, we won’t do it.",
    "We just have to find ourselves right now.",
    "As Barrett said, these things happen.",
    "\"They’re doing what they need to do.",
    "Yeah, I’ll let ya’ll debate that.",
    "That includes Burks and Robinson.",
    "Just focus on what matters, man.\"",
    "We’re kind of going through it.",
    "Stuff happens fast in the NBA .",
    "That’s what they have to do.",
    "\"They do it all year-round.",
    "I don’t care what it is.",
    "It’s a tough road trip.",
    "Please try again later.",
    "I trust him.",
    ".",
    "."
  ]
}