{
  "id": 298,
  "mediaId": 5153,
  "date": "2022-02-19",
  "headline": "Mike Lupica: The only thing this Knicks executive team is good at is pointing fingers",
  "image": "https://www.nydailynews.com/resizer/ezAC_pZbj_mZPPOy22XSze4K6KI=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/CCCEGCRF4VDQDDNI6WZ4WDA4OE.jpg",
  "link": "https://www.nydailynews.com/sports/basketball/knicks/ny-who-to-blame-for-knicks-dolan-20220219-74ji4grqc5f2jl7jqpakegg5qy-story.html#ed=rss_www.nydailynews.com/arcio/rss/category/sports/",
  "mediaOutlet": "Daily News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Lupica",
  "authorUrl": "https://www.nydailynews.com/mike-lupica-staff.html#nt=byline",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s the job of his bosses:\nRose and Wesley have turned into every failed Knicks executive we have seen across the 20 years when the Knicks — with only a couple of notable exceptions, including last season — were as bad as any team in the sport.",
    "And it was the beginning of the greatest era of Red Sox baseball, four World Series for them and one for the Yankees since A-Rod was introduced at the Hall of Fame Club at the old Stadium, Presidents Day, 2004.",
    "The only thing that’s really changed with the Knicks since December, when we first evoked “It’s Chinatown, Jake” and started calling them the Chinatown Knicks, is that things have gotten worse.",
    "So now, in the basketball version of the movie, the long knives are out for Tom Thibodeau, who could have run for mayor when the Knicks finished fourth in the Eastern Conference last season.",
    "Was there a Big Move that Rose and Wesley could have made at the trade deadline to turn this ship — the one that be sinkin’ in the immortal words of Micheal Ray Richardson — around?",
    "Where the message is always the same, the way it was always the same with Isiah:\nIt won’t be too very long before the 2020-21 season will be remembered as a glory year.",
    "It means their primary duties, at least at the present time, are to get into Dolan’s ears and convince him that the current sad state of the Knicks isn’t their fault.",
    "But if you think the problem here is Thibodeau’s rotations and playing his vets too many minutes, well, to keep with the movie theme, you’re watching the wrong movie.",
    "When the Warriors were winning championships, one of the guys in charge there, Bob Myers, president of basketball ops and general manager, is a former sports agent.",
    "The holding call against Logan Wilson at the end of the Rams’ winning drive last Sunday was one of the worst game-changing calls in Super Bowl history.",
    "I was all set to go see the new Liam Neeson until Z. Lupica had to go and point out that “Blacklight” scored a 9 “with critics” on Rotten Tomatoes.",
    "My friend Barry Stanton observes that somehow the Knicks have managed to turn the Garden into Fenway Park, just in terms of no lead being safe.",
    "I love Phil Mickelson going all-in on this money grab with this Saudi golf league, and then saying he’s only doing it for the good of the Tour.",
    "It turns out they weren’t as good as their record and now, man oh man, are they ever proving it, as they blow one 20-point lead after another.",
    "They’re delighted that everybody is talking about Thibodeau, because when they’re talking about the coach they’re not talking about them.",
    "I know Zac Taylor did a fine job with the Bengals this season, and got them to the organization’s third Super Bowl in history.",
    "Carmelo, who finished third in the MVP voting the year the Knicks won 54 games, and the Atlantic Division, for Mike Woodson.",
    "There’s always somebody, no matter who is running the permanent government at the Garden, who is going to come save them.",
    "Rose and Wesley truly have turned into so many other executives who have gone in and then out the door at the Garden.",
    "You get rid of him for committing the great big-city sin for anybody with a big job like this:\nNot his fault, though.",
    "It’s why Steve Mills managed to survive in Dolan’s permanent government at Madison Square Garden as long as he did.",
    "Soon you will be hearing, the way we did with other regimes, about the big names they’re going after this summer.",
    "The only player they’ve got who was part of the All-Star festivities was Obi Toppin, for the Slam Dunk contest.",
    "Wesley has no known qualifications for his current position other than connections in the basketball world.",
    "Now Dolan has shifted gears and hired people to run the Knicks who only worked with — and for — stars.",
    "The Knicks agents are doing about as well as the Mets did with their CAA agent, Brodie Van Wagenen.",
    "I mean, I get it that Creative Artists is a very big deal in the sports and entertainment business.",
    "If you are looking for somebody to bring along a bunch of kids in the NBA, Thibs is not your guy.",
    "Maybe they can play themselves into a play-in game over the last 23 games of the regular season.",
    "I love the idea that Wesley was going to work some kind of magic by bringing in Kentucky guys.",
    "There is always enough blame to go around when a season turns lousy the way this one has.",
    "The people in charge, though, they’re apparently as stellar as ever at pointing fingers.",
    "You’ll start hearing about Anthony Davis, because that is as inevitable as the tide.",
    "The leaks to the media are as familiar as the famous spoked ceiling at the Garden.",
    "Because there is always a big name out there for them, the way LeBron once was.",
    "You bet everybody is paying the price for the Knicks overachieving last season.",
    "The Knicks played over their heads a year ago, and that includes Julius Randle.",
    "And the job of putting good players in a Knicks uniform isn’t Thibodeau’s job.",
    "You don’t get rid of him after the season for Evan Fournier and Kemba Walker.",
    "But give them their due: They’ve cracked the code at Madison Square Garden.",
    "Dolan has always loved the Creative Artists Agency the way he loves music.",
    "You know the last semblance of a big star the Knicks had playing for them?",
    "Look at the standings and look at the record, 25-34 at the All-Star break.",
    "Eventually, that catches up with you in sports, you can look that one up.",
    "You’ll probably start hearing that they’re going after Donovan Mitchell.",
    "Because players keep going to cities where they think they can win.",
    "This time around James L. Dolan decided to go in another direction.",
    "They want this to be about Thibodeau and minutes and rotations.",
    "But the only one who will likely pay with his job is Thibodeau.",
    "Not the fault of Wesley, who seems to be the new Isiah Thomas.",
    "So here the Knicks are at the All-Star break, what they are.",
    "Willis and Dave DeBusschere and The Pearl and Dollar Bill.",
    "Now the Knicks don’t have enough good basketball players.",
    "Has Thibodeau been as good this year as he was last year?",
    "He effectively hasn’t talked to anybody else all season.",
    "But Jimmy Dolan has always been a bear for connections.",
    "For now, though, the Knicks ask agents to save them.",
    "At least the Knicks could rest up over the weekend.",
    "The Knicks don’t score enough points these days.",
    "So Dolan decided to try it with Rose and Wesley.",
    "Which gives them more time to be in Dolan’s ear.",
    "There are superstars all over the league.",
    "Once Dolan became infatuated with stars.",
    "The Knicks who were once Clyde and Capt.",
    "At least Rose is talking to the owner.",
    "They want the blame to be Thibodeau’s.",
    "But this team didn’t assemble itself.",
    "Except those players never come here.",
    "But the Knicks aren’t a team of kids.",
    "But then where do they go after that?",
    "And was never going to be your guy.",
    "Again: Is the coach blameless here?",
    "They’re not a team of veterans.",
    "World Wide Wes, the new Isiah.",
    "Now they’re not anything.",
    "But they didn’t even try.",
    "He put agents in charge.",
    "Just not the best ones.",
    "Isiah Thomas was one.",
    "Then Phil Jackson.",
    "In a job like his.",
    "In New York City.",
    "Silent Leon Rose.",
    "Oh, wait, I know.",
    "And by the way?",
    "Certainly not.",
    "You know why?",
    "Those Knicks.",
    "CAA agents.",
    "Singular.",
    "Come on.",
    "No sir.",
    "Right.",
    "Nope.",
    "Much."
  ]
}