{
  "id": 3036,
  "mediaId": 8419,
  "date": "2022-01-31",
  "headline": "US Blocks Pakistan Ambassador Masood Khan’s Appointment; Big Blow To Imran Khan Admin",
  "image": "http://pukhtunkhwatimes.blogspot.com/favicon.ico",
  "link": "http://pukhtunkhwatimes.blogspot.com/2022/01/us-blocks-pakistan-ambassador-masood.html",
  "mediaOutlet": "pukhtunkhwatimes.blogspot.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aparna Shandilya",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Scott Perry calls Pak envoy 'genuine terrorist sympathiser'\nIn the letter, he also stated that the Imran Khan government's nomination of a 'genuine terrorist sympathiser' working to undermine US interests in the region, as well as the security of US ally India, can only be described as a 'breathtaking lack of judgement at best'.",
    "Pakistan faces a massive global embarrassment as the United States blocks the appointment of a new Pakistan ambassador due to possible terror links/\nPakistan faced a massive global embarrassment as the United States blocked the appointment of a new Pakistan ambassador due to possible terror links.",
    "I urge you to reject any diplomatic credentials presented to you by Masood Khan and reject any effort by the Government of Pakistan to install this jihadist as Pakistan’s Ambassador to the United States,\" the letter by Scott Perry to US President read.",
    "In the letter, he encouraged President Biden to reject any diplomatic credentials submitted by Masood Khan, as well as any attempt by the Pakistani government to appoint the terrorist as Pakistan's Ambassador to the United States.",
    "Republic Media Network accessed US Congressman Scott Perry's letter written to President Joe Biden urging him to reject Masood Khan as the next ambassador from Pakistan over possible terror links.",
    "Masood Khan has finished his preparations to take up his ambassadorial job in Washington during a difficult moment for Pakistan-US ties, according to ANI, which cited sources close to him.",
    "\"While I am encouraged that the State Department has reportedly placed a pause on approving Masood Khan as the new Ambassador from Pakistan, a pause is not enough.",
    "https://www.republicworld.com/world-news/us-news/us-blocks-pak-ambassador-masood-khans-appointment-big-blow-to-imran-khan-administration-articleshow.html",
    "The media agency reported citing the source that Washington has requested more time for his clearance.",
    "He went on to say that, at worst, this demonstrates Islamabad's utter contempt for the United States.",
    "However, due to a delay in his approval by the State Department, he has just halted his meetings.",
    "According to The Nation, the State Department has requested extra time for his clearance.",
    "Masood Khan's nomination was sent by Pakistan's Foreign Office in November of last year.",
    "It was intended to be authorised in eight weeks under the standard diplomatic procedure.",
    "Scott Perry believes that the hold on the appointment of Masood Khan is insufficient.",
    "Earlier this week US State Department had not rejected Masood Khan's nomination.",
    "Pakistan's nominated ambassador is also said to have supported Burhan Wani.",
    "Masood Khan began his goodbye meetings in December of last year."
  ]
}