{
  "id": 4064,
  "mediaId": 8401,
  "date": "2022-01-25",
  "headline": "Lawmakers Stalemated On Congressional Map, Top Senator Says",
  "image": "https://philadelphia.cbslocal.com/wp-content/uploads/sites/15116066/2021/01/harrisburg.jpg?w=1280",
  "link": "https://philadelphia.cbslocal.com/2022/01/25/pennsylvania-lawmakers-stalemated-on-congressional-map-congressional-district-boundries/",
  "mediaOutlet": "philadelphia.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In this year’s election, Pennsylvania is losing a congressional seat, dropping from 18 to 17, to reflect population changes over the past decade reported by the U.S. Census that shows the nation’s fifth-most populous state growing more slowly than the rest of the nation.",
    "HARRISBURG, Pa. (AP) — Pennsylvania’s state Senate majority leader said Monday that a partisan stalemate remains unbroken on a new map of congressional district boundaries for the state, and she predicted that the state’s highest court will end up settling the matter.",
    "READ MORE:\nSenate Majority Leader Kim Ward, R-Westmoreland, told a Pennsylvania Press Club luncheon that Senate Republicans have tried unsuccessfully thus far to broker an agreement between the Republican-controlled House, Democratic Gov.",
    "During floor debate, Senate Minority Leader Jay Costa, D-Allegheny, called it a “partisan map that significantly benefits the Republican Party.”\nWard said that, in part, the sides had disagreed on where to compress two districts into one.",
    "Meanwhile, Wolf’s map shifts the heavily Democratic city of Harrisburg out of a district with York now represented by Republican Rep. Scott Perry and into a district with Lancaster now represented by Republican Rep. Lloyd Smucker.",
    "Wolf’s map puts two suburban Philadelphia Democrats — Reps. Madeleine Dean and Mary Gay Scanlon — in the same district, and puts Republican Reps. John Joyce and Fred Keller together in a central Pennsylvania district.",
    "Pennsylvania’s delegation is currently split evenly, with nine Democrats and nine Republicans, in a presidential battleground state where registered Democrats outnumber Republicans by 4 million to 3.4 million.",
    "Courts also picked Pennsylvania’s congressional map in 1992 and drew new boundaries in 2018 after the state Supreme Court threw out a six-year-old Republican-drawn map as unconstitutionally gerrymandered.",
    "Both Wolf’s map and the House GOP map keep major features of the existing districts intact, such as maintaining a Bucks County-based seat, a Lehigh Valley-based seat and two Philadelphia-based seats.",
    "They both keep Scranton and Wilkes-Barre together, barely, in a northeastern Pennsylvania district and keep the city of Reading packaged with a Chester County-based seat.",
    "Pennsylvania, like most other states, must redraw its congressional district boundaries to account for a decade of demographic shifts in time for 2022’s elections.",
    "“It just comes down to we can’t agree, the governor’s going to veto anything that’s not what he produced and the courts will end up drawing maps,” Ward said.",
    "Monday was also the court-imposed deadline for parties — including Wolf, Republican lawmakers and Democratic lawmakers — to submit proposed maps to it.",
    "That deadline is barely two weeks before the date — Feb. 15 — when candidates can start circulating petitions to get on primary election ballots.",
    "READ MORE:\nWolf unveiled a map that he supports, and the Republican-controlled House approved a map that every Democrat in the chamber opposed.",
    "It also drags a Chester County-based district held by Democrat Chrissy Houlahan in suburban Philadelphia into conservative Lebanon County.",
    "The House GOP map would create seven safer Republican districts, five safer Democratic districts and five districts more evenly divided.",
    "The Commonwealth Court issued the order earlier this month, acting on a request last month for it to get involved in the process.",
    "That complicated the task of drawing new districts, and Ward said the sides disagreed on how to compress two districts into one.",
    "Any opinion by the Commonwealth Court is likely to be appealed to the state Supreme Court, where a 5-2 Democratic majority sits.",
    "The House GOP map does not split Pittsburgh, and creates one heavily Democratic district and one politically divided district.",
    "The House GOP map puts two northeasterners, Republican Rep. Daniel Meuser and Democrat Matt Cartwright, in the same district.",
    "Wolf’s map would create six safer Republican seats, seven safer Democratic districts and four districts more evenly divided.",
    "Wolf’s map splits the heavily Democratic city of Pittsburgh, giving Democrats a better chance at winning both districts.",
    "The House GOP map splits the Harrisburg area into three districts, making all three safe for Republicans.",
    "The Republican-controlled Senate passed it Monday along party lines, over a veto threat by Wolf.",
    "As recently as Sunday night, Democratic lawmakers rejected a Republican counteroffer, Ward said.",
    "It set a Jan. 30 deadline for it to render its judgment on proposals that are submitted to it.",
    "MORE NEWS:\nAll contents © copyright 2022 Associated Press.",
    "They largely give incumbents a district of their own.",
    "Tom Wolf and Democratic lawmakers.",
    "The primary election is May 17.",
    "All rights reserved"
  ]
}