{
  "id": 4158,
  "mediaId": 2548,
  "date": "2022-01-20",
  "headline": "EXCLUSIVE: House Republicans Demand FDA Withdraw Race-Based Criteria For Monoclonal Antibodies",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/01/Photo-by-Andrew-Harnik-PoolGetty-Images-213232-e1642706027187.jpg",
  "link": "https://dailycaller.com/2022/01/20/house-republicans-dan-bishop-letter-fda-withdraw-race-based-criteria-monoclonal-antibodies/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Henry Rodgers",
  "authorUrl": "https://dailycaller.com/author/Henry+Rodgers",
  "termIds": [
    0
  ],
  "sentences": [
    "(RELATED: EXCLUSIVE: House Republicans Introduce Bill To Make COVID-19 Data Publicly Available)\nThe 30 cosigners include Reps. Ted Budd, Glenn Grothman, Jody Hice, Andy Biggs, Elise Stefanik, Doug Lamborn, Diana Harshbarger, Madison Cawthorn, Mary Miller, Mike Carey, Lauren Boebert, Chip Roy, Rodney Davis, Ralph Norman, Bill Posey, Bill Huizenga, Tom Tiffany, Andrew Clyde, Stephanie Bice, Clay Higgins, Claudia Tenney, Beth Van Duyne, Scott Perry, Mo Brooks, David McKinley, Matt Rosendale, Paul Gosar, Byron Donalds, Nancy Mace and Jeff Duncan.",
    "Minnesota’s Department of Health’s guidance states “FDA’s acknowledgment means that race and ethnicity alone, apart from other underlying health conditions, may be considered in determining eligibility.” Utah’s Department of Health put a point system in place that awards two points to patients of “Non-White race or Hispanic/Latinx ethnicity,” while those suffering from congestive heart failure, hypertension and other medical problems are awarded one point for each such condition.",
    "(RELATED: EXCLUSIVE: Rep. Pat Fallon Urges White House To Make Monoclonal Antibodies Available For Purchase)\n“President Biden’s FDA issued guidance that allocates life-saving monoclonal antibody treatment, not based on medical need, but instead on the basis of race.",
    "A group of over two dozen House Republicans sent a letter Thursday to Food and Drug Administration (FDA) Acting Commissioner Dr. Janet Woodcock, demanding the agency withdraw guidance related to the distribution of monoclonal antibodies in regards to race.",
    "The lawmakers say the agency’s guidelines direct medical providers to consider race in addition to medical risk factors when prescribing monoclonal antibodies, saying the guidance violates the 14th Amendment.",
    "Bishop’s office also mentioned the shortage of the treatments from the federal level and said the FDA’s race-based guidance has been implemented in states such as New York, Minnesota and Utah.",
    "These treatments are already being rationed by states due to this President’s needless power play to federalize our nation’s supply,” Bishop told the Daily Caller before sending the letter.",
    "READ THE LETTER HERE:\n“Now, Biden’s FDA is violating the 14th Amendment by discriminating who gets treatment based on the individual’s skin color.",
    "The Daily Caller first obtained the letter which was spearheaded by Republican North Carolina Rep. Dan Bishop and signed by 30 House Republicans.",
    "New York City “will take a patient’s race into account when distributing potentially life-saving COVID treatments,” the New York Post reported.",
    "I can’t think of anything more un-American than that and demand they rescind this guidance immediately,” Bishop added.",
    "There is a word for that."
  ]
}