{
  "id": 4225,
  "mediaId": 2644,
  "date": "2022-01-27",
  "headline": "Chip Roy, GOP reps call for government shutdown if vaccine mandates stay in place",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/01/chip-roy-2.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/01/27/chip-roy-gop-reps-call-for-government-shutdown-if-vaccine-mandates-stay-in-place/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Juliegrace Brufke",
  "authorUrl": "",
  "termIds": [
    3516,
    4267,
    4066,
    1126,
    6074,
    6159,
    5949
  ],
  "sentences": [
    "“Therefore, we the undersigned refuse to consider supporting any federal government funding vehicle, be it a continuing resolution or an omnibus appropriations measure, that funds the enforcement of COVID-19 vaccine mandates at any level of government.”\nRoy told The Post the letter-writers are looking to get at least 10 GOP senators on board with the effort to tank government funding legislation, which requires 60 votes for passage in the upper chamber.",
    "“After Feb. 18, 2022, government funding will expire and congressional Republicans must once again decide whether they will vote to fund a federal government that is enforcing tyrannical COVID-19 vaccine mandates on the American people,” the lawmakers wrote to Senate Minority Leader Mitch McConnell (R-Ky.) and House Minority Leader Kevin McCarthy (R-Calif.).",
    "More than two dozen GOP representatives joined the letter, including House Freedom Caucus Chairman Scott Perry of Pennsylvania, Lauren Boebert of Colorado, Andy Biggs of Arizona, Marjorie Taylor Greene of Georgia, Louie Gohmert of Texas, Thomas Massie of Kentucky and Brian Mast of Florida.",
    "A group of Republican lawmakers led by Texas’ Rep. Chip Roy is calling on GOP leadership to withhold its support for a bill needed to avert a government shutdown next month if COVID-19 vaccine mandates remain in place.",
    "“Most Republicans say that vax mandates are tyrannical and foolish, but will they unite before government funding expires on Feb. 18 to pledge not to fund enforcement of these mandates?” he said in a statement.",
    "“Congressional Republicans cannot continue to abdicate their Article I duties in hopes the judicial branch will rule in favor of the American people,” they wrote.",
    "The members argued that by funding the government, lawmakers are agreeing to fund the implementation of the mandates despite voicing individual opposition.",
    "We’re going to find out.”\nOnly two Republican senators signed on to Roy’s letter: Rand Paul of Kentucky and Ron Johnson of Wisconsin.",
    "However, mandates are still in effect for the military, federal employees, federal contractors and most medical workers.",
    "“Will at least 10 of the 19 GOP Senators who voted to punt last time now stand up for healthcare workers or not?",
    "The Supreme Court recently struck down a vaccine-or-test rule for companies with at least 100 employees."
  ]
}