{
  "id": 5236,
  "mediaId": 2746,
  "date": "2022-04-20",
  "headline": "Election forecasters move more than a dozen House races in GOP direction",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/20/House_Proxy_Voting_14485.jpg-f4292_c0-250-6000-3750_s1200x700.jpg?2cb823f519263a3e55a419724463fd44fb7f7c61",
  "link": "https://www.washingtontimes.com/news/2022/apr/20/election-forecasters-move-over-dozen-house-races-g/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kerry Picket",
  "authorUrl": "https://www.washingtontimes.com/staff/kerry-picket/",
  "termIds": [
    4812,
    1804,
    3594,
    2970,
    1477,
    1163,
    392,
    604,
    1126
  ],
  "sentences": [
    "Rep. Julia Brownley, California Democrat, has a race that went from the “safe Democratic” to “likely Democratic,” while the re-election contest of Rep. Susie Lee of Nevada went from “leans Democratic” to “toss-up.”\nTo round out all the Democrats in the analysis, the race involving Rep. Antonio Delgado of New York was shifted from “likely Democratic” to “lean Democratic.”\nIllinois’ 13th Congressional District, held by Republican Rep. Rodney Davis, was redrawn to favor Democrats and pushed Mr. Davis to run in the 15th District, a more GOP leaning seat, but forced him to primary Rep. Mary Miller.",
    "The re-elections of Reps. Abigail Spanberger of Virginia, Steven Horsford of Nevada, and Ms. Lee all went from “lean D” to “toss-up,” while the races of Mr. Mrvan and Mr. Delgado went from “likely D” to “lean D.” The open North Carolina 1st Congressional District seat to be vacated by the retiring Rep. G.K Butterfield also went from “likely D” to “lean D.”\nThe reelection contest of Rep. Andy Kim of New Jersey shifted from “solid D” to “likely D,” and New York’s 4th Congressional District, currently held by soon-to-be retiring Rep. Kathleen Rice, had the same rating shift.",
    "The 13th Congressional District, however, shifted in Sabato’s Crystal Ball rating from “Likely Democratic” to “Leans Democratic.”\nThe remaining lawmakers whose reelections received rating changes from the Larry Sabato’s Crystal Ball are House Republican members whose districts went from “Likely Republican” to “Safe Republican.” These members are Reps. Bill Huizenga of Michigan, Rep. Richard Hudson of North Carolina, Scott Perry of Pennsylvania and Tony Gonzales of Texas.",
    "Most of the changes in narrowly competitive GOP-held districts became “safe Republican,” or Democratic districts went from “likely Democratic” to a more competitive rating of “leaning Democratic.”\nMost of the Democratic lawmakers listed by the Cook Political Report and the Crystal Ball are part of the National Republican Congressional Committee’s target list this cycle.",
    "“Meanwhile, Republicans’ extreme plans to tax the middle class, ban abortion, and throw away votes they don’t like are driving a serious wedge between them and key battleground voters.”\nThe ratings shift of the districts happened, as poll numbers tightened up between Republicans and Democrats ahead of the midterm elections.",
    "“House Democrats have proven they can win tough races and are ready to do it again this November with their record-breaking fundraising, popular economic agenda, and strong record of delivering meaningful results to families,” DCCC spokesperson Nebeyatt Betre said in a statement.",
    "House Republicans are confident they will recapture the chamber, betting on the economic environment of high inflation and the historical political precedent with the party in the White House usually losing seats during the first midterm election.",
    "A new poll released by Politico/Morning Consult of registered voters found that if the midterms were held today, 43% would favor a Democratic candidate for Congress, while 42% would vote for the Republican candidate.",
    "The reelection race ratings of Democratic Reps. Greg Stanton of Arizona, Sanford Bishop of Georgia, and Frank Mrvan of Indiana changed from “likely Democratic” to “lean Democratic” in Mr. Sabato’s forecast.",
    "The Democratic Congressional Campaign Committee acknowledged facing a tough battle, but said the party’s fundraising capabilities and legislative agenda on the economy will help pull the candidates through.",
    "The Cook Political Report also included the Democratic House districts of Ms. Lee, Mr. Mrvan and Mr. Delgado and shifted their seats toward GOP territory in its analysis of eight Democratic House races.",
    "House Democrats’ fortunes took a turn for the worse Wednesday when two prominent election forecasters shifted 16 congressional races toward Republicans’ favor.",
    "The poll surveyed 2,005 registered voters between April 15 and 17 and has a margin of error of plus or minus two percentage points.",
    "“There is still time for smart Democrats to retire rather than lose,” NRCC Spokesman Mike Berg said of the new ratings.",
    "Larry Sabato’s Crystal Ball at the University of Virginia’s Center for Politics shifted 11 races toward the GOP.",
    "Six of these members were elected between 2018 and 2020.",
    "Another 16% responded “don’t know” or had no opinion."
  ]
}