{
  "id": 5676,
  "mediaId": 2562,
  "date": "2022-04-13",
  "headline": "GOP Calls for DOJ Transparency in Hunter Biden Probe",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid04D9F3C0-0544-4B5E-8796-D46ABB2660F4-1.jpg",
  "link": "https://donaldjtrumppolls.com/gop-calls-for-doj-transparency-in-hunter-biden-probe-2/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    4905,
    3858,
    2364,
    2228,
    2426,
    2451,
    2479,
    1126,
    204,
    1442
  ],
  "sentences": [
    "Fox News reported the letter was also signed by: Reps. Andy Biggs, R-Ariz.; Jeff Duncan, R-S.C.; Ralph Norman, R-S.C.; Mary Miller, R-Ill.; Chip Roy, R-Texas; and Michael Cloud, R-Texas; Dan Bishop, R-N.C.; Scott Perry, R-Pa.; Marjorie Taylor Greene, R-Ga.; and Jody Hice, R-Ga., Tom Tiffany, R-Wis.; Ken Buck, R-Colo.; Matt Gaetz, R-Fla.; and Vicky Hartzler, R-Mo.",
    "Highlighting Hunter Biden's lucrative alleged business dealings in China, Ukraine, Kazakhstan and Serbia, the Republican lawmakers also sought information on his abandoned laptop containing \"potentially compromising material\" and his fundraising efforts for the Vice President's Residence Foundation.",
    "\"Legal questions plaguing Hunter Biden continue to arise and cast doubt on President Joe Biden and his administration,\" Rep. Bob Good, R-Va., and 14 other lawmakers, wrote in a letter to Attorney General Merrick Garland, obtained by Fox News.",
    "\"Congress has a constitutional obligation to conduct oversight of the Executive Branch and a moral obligation to examine if the President of the United States or any senior official in his administration is ethically compromised or injured.\"",
    "In a statement at the time, he said he was \"confident that a professional and objective review of these matters will demonstrate that I handled my affairs legally and appropriately, including with the benefit of professional tax advisers.\"",
    "(Andrew Harnik/AP)\nBy Nicole Wells | Wednesday, 13 April 2022 12:53 PM\nCalling for more transparency, Republican House lawmakers asked the Department of Justice to update Congress on the probe of Hunter Biden's foreign business dealings.",
    "Arguing that \"little detail\" has been released to the public, the GOP lawmakers said the investigation raises questions about potential criminal or civil crimes committed by the president or other senior administration officials.",
    "The congressmen's letter comes as investigators scrutinize the first son's income and payments received while he was serving on the board of Ukrainian energy company Burisma.",
    "GOP Calls for DOJ Transparency in Hunter Biden Probe Joe Biden is sworn in as the 46th president as Jill Biden holds the Bible and daughter Ashley and son Hunter look on.",
    "First reported by the New York Post, outlets such as The Washington Post and The New York Times have confirmed the authenticity of Hunter Biden's laptop in recent weeks.",
    "Going into the November midterm elections, the probe into the younger Biden's business dealings has created a political headache for the White House.",
    "\"It is imperative that the Department of Justice brief Congress on the nature of Mr. Weiss' investigation into Hunter Biden,\" Good said.",
    "Hunter Biden confirmed the investigation into his tax matters in December 2020 – one month after the presidential election.",
    "The president has repeatedly claimed to know nothing about his son's business affairs, despite reports to the contrary.",
    "The investigation is being led by Delaware's U.S. Attorney David Weiss, according to Fox News."
  ]
}