{
  "id": 5933,
  "mediaId": 5329,
  "date": "2022-04-11",
  "headline": "Final Knicks report card, from Obi Toppin’s A to Leon Rose’s F",
  "image": "https://www.twincities.com/wp-content/uploads/2022/04/202204111854TMS_____MNGTRPUB_SPORTS-FINAL-KNICKS-REPORT-CARD-FROM-OBI-2-NY5.jpg?w=1024&h=576",
  "link": "https://www.twincities.com/2022/04/11/final-knicks-report-card-from-obi-toppins-a-to-leon-roses-f/",
  "mediaOutlet": "St.Paul Pioneer-Press ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tribune News Service",
  "authorUrl": "https://www.twincities.com/author/tribune-news-service/",
  "termIds": [
    5373,
    5326,
    2094,
    1793,
    2754,
    3020,
    3551,
    3404,
    3112,
    4117,
    903
  ],
  "sentences": [
    "2) Anything about Kemba Walker and the point guard situation, 3) Will the Knicks at least field offers for Julius Randle, 4) What about the reports of top executive William Wesley throwing Thibodeau under the bus, 5) Why trade for Cam Reddish when the coach didn’t see a spot for him in the rotation, 6) What was learned from the dreadful 2021 free agency, and 7) If not a symbol of running this squad back next season, why stay silent at the trade deadline?",
    "Exciting potential with flashes of orchestrating an offense — particularly when sharing the floor with best bud Obi Toppin — but Quickley still falls into the streaky category: If the shot is falling, he’s a big bonus; if he’s misfiring, Quickley doesn’t do enough otherwise to justify heavy minutes.",
    "Final Grade: C+\nJULIUS RANDLE\nStats: 72 games, 35.3 minutes, 20.1 points, 9.9 rebounds, 5.1 assists, 41% shooting, 31% on 3s\nNext season’s salary: $26.1 million\nBreakdown:\nAn utter letdown season that included meltdowns directed at fans, officials, opponents and a team video coordinator.",
    "KEMBA WALKER\nStats: 37 games, 25.6 minutes, 11.6 points, 3.5 assists, 40% shooting, 37% on 3s\nNext year’s salary: $9.2 million\nBreakdown:\nBecame apparent quickly that Walker’s explosion wasn’t going to magically reappear by returning to New York, and Thibodeau gave up quickly.",
    "Final Grade: B\nIMMANUEL QUICKLEY\nStats: 78 games, 23.1 minutes, 11.3 points, 3.5 assists, 3.2 rebounds, 39% shooting, 35% on 3s\nNext season’s salary: $2.3 million\nBreakdown:\nTurned in a respectable season because of a late surge but early woes led to poor efficiency numbers.",
    "Final Grade: D-\nOBI TOPPIN\nStats: 72 games, 17.1 minutes, 9 points, 3.7 rebounds, 53% shooting, 31% on 3s\nNext year’s salary: $5.3 million\nBreakdown:\nIt was cool to watch Toppin’s blossom from a deer in headlights as a rookie to the Knicks’ most exciting player in Year 2.",
    "Final Grade: F\nNERLENS NOEL\nStats: 25 games, 22.5 minutes, 3.4 points, 5.6 rebounds, 1.2 blocks\nNext year’s salary: $9.2 million\nBreakdown:\nOnly managed 25 games without a major injury, leaving questions about his commitment after signing a $27 million deal in the summer.",
    "ALEC BURKS\nStats: 81 games, 21.6 minutes, 11.7 points, 4.9 rebounds, 3.0 assists, 39% shooting, 40% on 3s\nNext season’s salary: $10 million\nBreakdown:\nThrust into an unfamiliar role as the starting point guard for much of the season, Burks was reliably not a point guard.",
    "Final Grade: B\nRJ BARRETT\nStats: 70 games, 20 points, 5.8 rebounds, 3.0 assists, 41% shooting, 34% on 3s\nNext year’s salary: $10.9 million\nBreakdown:\nDisappointing start transitioned to a confident end to RJ Barrett’s season, even if it was cut short by the knee sprain.",
    "Final Grade: A\nMITCHELL ROBINSON\nStats: 72 games, 8.5 points, 8.6 rebounds, 1.8 blocks, 76% shooting\nNext year’s salary: Unrestricted free agent\nBreakdown:\nHealth was a major concern heading into the season and Robinson passed that test while playing 72 games.",
    "Final Grade: C\nEVAN FOURNIER\nStats: 80 games, 29.5 minutes, 14.1 points, 2.1 assists, 2.6 rebounds, 42% shooting, 39% on 3s\nNext season’s salary: $18 million\nBreakdown:\nThe Knicks overpaid for a 3-point specialist but that’s not Fournier’s fault.",
    "At this point, it’s easy to project Robinson’s path: He’s a tall and athletic center, perhaps susceptible to injuries, who will finish at the rim and protect it defensively, but diversifying his offensive game should be shelved.",
    "Rose, who clearly isn’t so comfortable or polished as a speaker, has played the role better than his predecessors, even though we hope somebody at MSG understands that silence is a sign of weakness during the bad times.",
    "Breen, a well-deserved Hall of Famer, was in a tough spot as MSG’s play-by-play voice interviewing a shy and reclusive executive, but he missed seven key questions: 1) Will Thibodeau be the coach next season?",
    "That’s all he could manage after falling from fourth in the East to out of the play-in: a pre-taped and edited interview with the in-house network, with Rose’s main message being, well, nothing in particular.",
    "TOM THIBODEAU\nBreakdown:\nThere were ugly moments, particularly right before the All-Star break, when RJ Barrett suffered an ankle sprain in garbage time and Thibodeau forgot he can’t challenge two plays.",
    "Maybe it’s more illusion in a contract year (we’ve certainly seen that from other players), but Barrett positioned himself, in many ways, as the anti-Randle when dealing with the media and fans.",
    "Anything I can do to contribute to that, I wanna do it.”\nOf course, this is the James Dolan way of dealing with the media and fans: keep the message insulated, vague and propagandist.",
    "“That’s very much important to me, important to this organization, from the standpoint of giving them something they can be proud of, they can root for, they can feel good about.",
    "In the end, it’s a simple equation leading to a bad grade: Rose entered the offseason with the most cap space in the NBA plus two first-round picks, and the team got much worse.",
    "He ditched playmaking earlier in the season and almost exclusively roamed the perimeter, with 3-pointers accounting for 72% of his shot attempts after the All-Star break.",
    "Biggest takeaway was that he relishes being the go-to face of the franchise, embracing the burdens and responsibilities that come with the ball in his hands.",
    "The long-distance shooting was good enough, but everything else — the defense, the ability to get to the hoop and finish — left Walker as a liability.",
    "But the Knicks also improved in the second half of the season, especially the young players, which meant Thibodeau still had them clutching the rope.",
    "Burks was signed as a backup two-guard and he’s fine in that role, sometimes exceptional when he’s scoring in bunches at the end of close games.",
    "There were misguided concerns about his point-guard rotation, which was more a product of the roster construction than Thibodeau’s assessments.",
    "We always knew he’s athletic phenom and potentially elite in transition, but he flashed a competent 3-point shot at the end of the season.",
    "Final Grade: F\nQUICK GRADES\nJericho Sims (B+); Quentin Grimes (B); Miles McBride (C+); Derrick Rose (D); Taj Gibson (B-); Cam Reddish (D).",
    "Then Randle imploded and Toppin flourished, leaving the fanbase eager to ditch the player who just signed a contract worth $106 million.",
    "He watched the team get pounded by the Hawks in the playoffs and thought the roster required only a few tinkers, rather than a repair.",
    "The big question now will be whether the Knicks can unload Randle for something worthwhile because Leon Rose totally screwed this up.",
    "There was an appearance on a Zoom session to announce the hiring of Tom Thibodeau, which was dominated by Thibodeau’s voice.",
    "To be clear, interviewer Mike Breen did a fine job with the time allotted, at least the time that aired, which wasn’t much.",
    "Contrary to the coach’s critics, I don’t believe Toppin was so much held back this season than he developed exceptionally.",
    "There were problems with enabling Julius Randle, who seemed to operate, often negatively, without guidance or punishment.",
    "These questions will never be answered by Rose because he declined, yet again, to hold a postseason press conference.",
    "Rose’s highlight was the draft, where he picked up Quentin Grimes and Jericho Sims with late picks in both rounds.",
    "In Sunday’s interview, Rose was asked by Breen if he’d speak publicly more often and he sidestepped the question.",
    "In reality, he has never really answered questions from outside media since taking the job over two years ago.",
    "He was a force on the offensive glass and ridiculously efficient while exclusively operating in the paint.",
    "He just doesn’t possess the playmaking instincts, and his paltry three assists per game were indicative.",
    "As an aside, Fournier wins this season’s Media Award for being so open and expansive in his sessions.",
    "It was a big change from earlier in Toppin’s career, when he struggled to hit the rim on corner 3s.",
    "Then there was an in-person gathering in September that also included Thibodeau and GM Scott Perry.",
    "Final Grade: C-\nLEON ROSE\nBreakdown:\nIt’s hard to understate the disaster of the 2021 free agency.",
    "To recap: Rose wasn’t sold on Randle so he drafted his replacement at power forward, Obi Toppin.",
    "With that being said, we offer our final Knicks Report Card of a disappointing 2021-22 season.",
    "He doesn’t have the handle or the shot (he made just 49% of his foul shots) for much else.",
    "The Knicks also need an answer to those questions before deciding whether to pay Robinson.",
    "He set the franchise record for 3-pointers in a season, eclipsing John Starks’ 1995 mark.",
    "He had the most cap space in the NBA and failed to solve the glaring point guard problem.",
    "Defense remains an issue, but again, that doesn’t deviate with whom the Knicks signed.",
    "On the heels of an ugly season, that’s all team president Leon Rose could muster.",
    "The silence and nondisclosure agreement are stipulations to the large paycheck.",
    "Then Randle exceeded all expectations and Rose gave him a four-year extension.",
    "This is not who Toppin was to start the season, but rather what he became.",
    "Ultimately, Walker disappeared at the All-Star break and never returned.",
    "The Knicks, perhaps not coincidentally, were better after the break.",
    "Keep in mind, we don’t dismiss injuries or missed time in grading.",
    "Also, he deserved better competition for his NBA Slam Dunk title.",
    "He chose to splurge on Evan Fournier instead of DeMar DeRozan.",
    "He gave Julius Randle a massive contract based on one season.",
    "Again, Thibodeau commanded the room, mostly by default.",
    "And like Leon Rose, we won’t take follow-up questions.",
    "He paid Nerlens Noel instead of Mitchell Robinson.",
    "Final Grade: F+\n()\nRecommended For You",
    "How much is that worth in free agency?",
    "“I want to please the fans,” he said.",
    "Rose made every wrong move.",
    "That’s not his fault."
  ]
}