{
  "id": 61,
  "mediaId": 2572,
  "date": "2022-02-26",
  "headline": "GOP Rep. Perry says 'not too late' for Biden admin to prevent Chinese attack on Taiwan amid Russia-Ukraine",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/12/Pennsylvania-Rep-Scott-Perry.jpg",
  "link": "https://www.foxnews.com/politics/gop-rep-perry-biden-admin-china-taiwan",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooke Singman",
  "authorUrl": "https://www.foxnews.com/person/s/brooke-singman",
  "termIds": [
    4016,
    2693,
    2912,
    4905,
    4591,
    1126,
    6672,
    6569,
    6645,
    6509,
    5979
  ],
  "sentences": [
    "CLICK HERE TO GET THE FOX NEWS APP\nPerry also said that \"every single day,\" when Americans are \"buying goods and services, whether you're paying for it at the pump, or whether you're buying a half a chicken for your family for dinner this evening, you're paying more because of the fuel prices.\"",
    "\"The United States will continue to support a peaceful resolution of cross-strait issues, consistent with the wishes and best interests of the people on Taiwan,\" the spokesman said, stressing that such action is \"destabilizing\" and undermines regional peace and stability.",
    "\"It’s not too late, but the actions obviously haven't had any effect on Russia's calculation, on Vladimir Putin's calculation, and the risk related to invading another country on the world stage,\" Perry said, referring to the Biden administration’s sanctions on Russia.",
    "\"We saw him being weak in Afghanistan and so too the rest of the world, certainly, but Vladimir Putin did, and then just recently, with Ukraine talking about a little invasion or something like that, would be something we wouldn't do anything about it.",
    "ORLANDO, Fla. – Republican Rep. Scott Perry said it is \"not too late\" for the Biden administration to \"show some strength\" with regard to China's ambitions in Taiwan amid concerns that Beijing has been emboldened by Russian aggression in Ukraine.",
    "\"And when you do that, somebody like Vladimir Putin, who's got an economy that is 40-50%, driven by fossil fuels, it raises the amount of money he's making, so it makes it affordable for somebody — some autocrat — to do what he's doing.",
    "\"We urge the U.S. side to recognize the high sensitivity of the Taiwan issue, stop interfering in China's internal affairs and stop playing with fire on the Taiwan issue,\" Tan said, according to Reuters.",
    "During an exclusive interview with Fox News on the sidelines of the Conservative Political Action Conference (CPAC), Perry, R-Pa., said the Biden administration’s leadership has been \"an abject failure.\"",
    "Some have raised concerns in recent days that Russia’s multi-front war on Ukraine could embolden adversaries like China in their ambitions to take Taiwan, but Perry told Fox News there is still time.",
    "When we pull the United States offline of producing the energy that the world needs, it opens it up for other actors who use it to extort their neighbors, and Vladimir Putin is one of them.\"",
    "\"But if they continue to fail or fail more spectacularly than they already have, I think it kind of opens the door wide open to China's regressions, and then it's just a matter of timing.\"",
    "We made a guarantee with some of our European NATO partners that if they're ever attacked, we would be there to defend them, we would come in with armed forces,\" Perry said.",
    "Meanwhile, when asked why the average American should care about the conflict in Ukraine, Perry said there is a \"macro issue which maybe most of Americans don't realize.\"",
    "A Defense Department spokesman said that the Pentagon is \"aware of the reporting\" and that the U.S. remains \"concerned\" by \"provocative military action near Taiwan.\"",
    "\"Vladimir Putin hasn't gotten there yet, but he's on the doorstep right now, and if he goes any further, we are there, so that's a good reason to be concerned.\"",
    "The last such incursion occurred on Jan. 23, when 39 Chinese aircraft flew into the defense space, but the new fly-by occurs at a time of heightened tensions.",
    "Taiwan scrambled its air force Thursday as nine Chinese aircraft have entered the island nation’s air defense zone, the Taiwan Ministry of Defense announced.",
    "Rep. Scott Perry, R-Pa., takes a question from a reporter at a news conference held by the House Freedom Caucus on Capitol Hill in Washington Aug. 23, 2021.",
    "We can still have the ideals that people should be free and should not be invaded while producing our own fossil fuels and driving the cost down for us.\"",
    "\"Our commitment to Taiwan is rock solid and contributes to the maintenance of peace and stability across the Taiwan Strait and within the region.\"",
    "Chinese Defense Ministry spokesman Tan Kefei stressed that Taiwan was a \"core issue\" for China, and it would tolerate no foreign interference.",
    "\"It's a continuous assessment, and I still think that there is time for the Biden administration to show some strength here and some resolve.",
    "And China appeared to stress that coverage of Russia’s invasion could play into helping \"solve the Taiwan issue once and for all.\"",
    "Taiwan increased its alert levels as Russia launched a full-scale invasion of Ukraine Thursday local time.",
    "A small fleet of eight J-16 fighters and a Yun-8 technical reconnaissance aircraft breached the airspace.",
    "Perry said when U.S. \"assets\" are pulled off the market, it \"raises prices because there is less of it.\"",
    "\"There’s a risk to that and, apparently, he’s determined that it is worth the whatever that risk is.\"",
    "\"When a tyrant is looking for a green light, that’s essentially opening the door completely.\"",
    "(AP Photo/Amanda Andrade-Rhoades, File)\n\"Number two, his rhetoric has been weak,\" Perry said.",
    "The Taiwanese aircraft broadcast a warning and monitored the Chinese fleet’s activities.",
    "\"The Biden energy policies have facilitated what's happening in Ukraine right now.\"",
    "As for China, Perry said he believes \"China is making an assessment right now.\"",
    "Fox News' Peter Aitken and The Associated Press contributed to this report.",
    "You can reach her at Brooke.Singman@Fox.com or @BrookeSingman on Twitter.",
    "\"How we got into this, in my opinion, is twofold,\" Perry said.",
    "China criticized the move by saying Taiwan is \"not Ukraine.\"",
    "Brooke Singman is a Fox News Digital politics reporter.",
    "\"It's our energy policy in the United States.",
    "So that's number one,\" Perry said.",
    "That’s very, very provocative.",
    "\"It is unnecessary,\" he said.",
    "\"We don't have to sacrifice.",
    "\"We are a treaty signatory.",
    "\"It's ongoing,\" he said."
  ]
}