{
  "id": 7640,
  "mediaId": 2550,
  "date": "2022-04-07",
  "headline": "GOP introduces bill forbidding Biden from potentially declaring climate change the threat that it is",
  "image": "https://images.dailykos.com/images/1056459/story_image/GettyImages-1238122462.jpeg?1649280819",
  "link": "https://www.dailykos.com/stories/2022/4/6/2090486/-Republicans-benefiting-from-fossil-fuel-donors-oppose-Biden-declaring-climate-change-an-emergency?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    5138,
    2082,
    2514,
    2765,
    2966,
    3475,
    1126,
    1489,
    5951
  ],
  "sentences": [
    "Dubbed the “Real Emergencies Act,” the bill claims it attempts to “clarify the inability of the president to declare national emergencies under the National Emergencies Act, major disasters or emergencies under the Robert T. Stafford Disaster Relief and Emergency Assistance Act, and public health emergencies under the Public Health Service Act on the premise of climate change, and for other purpose.” What it really does is offer a cheat sheet on lawmakers absolutely loaded with campaign contributions from the very industry that threatens us most.",
    "Voters can still save the country, but Democrats have to help them\nDaily Kos' The Brief\nFollowShare\n0:0058:38\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nA quick search for the legislation revealed those 10 lawmakers’ names: Rep. August Pfluger of Texas, Rep. Jake Ellzey of Texas, Rep. Brian Mast of Florida, Rep. Alexander Mooney of West Virginia, Rep. Adrian Smith of Nebraska, Rep. Tom McClintock of California, Rep. Yvette Herrell of New Mexico, Rep. Jefferson Van Drew of New Jersey, Rep. Scott Perry of Pennsylvania, and Rep.",
    "It’s a bit of a shame that Carter makes the list, as he made some good points during Wednesday’s House Energy and Commerce Committee hearing on high gas prices about oil companies profiting from his constituents’ pain at the pump, but Carter also willfully misunderstands climate change and has an abysmal lifetime score of 4% from the League of Conservation Voters.",
    "North Dakota Sen. Kevin Cramer, who flat-out rejects the premise of climate change and recently called on the SEC to abandon its proposed climate risk and emissions rule, received more than $1 million in donations from the oil and gas sector and around $135,000 from mining since taking office.",
    "Sen. Jim Inhofe of Oklahoma, who slammed “radical environmentalists” and “leftists” for giving a shit about the future, received just over $100,000 in campaign donations from the mining industry since taking office and more than $750,000 from oil and gas.",
    "Arkansas Sen. John Boozman, who was one of 22 Republicans to sign a letter urging Donald Trump to abandon the Paris Agreement, has made around a quarter of a million dollars from campaign contributions from fossil fuel companies since taking office.",
    "Regardless of how much these lawmakers stand to make and their absurd charge that environmentalists are extremists, climate change is legitimately a crisis—and one that President Biden should take seriously enough to call it what it is.",
    "Sen. Shelley Capito, who has netted nearly $1 million from oil and gas and coal mining industry donations since taking office, introduced a bill to prevent President Biden from declaring climate change an emergency.",
    "Sen. Shelley Capito of West Virginia, who along with 10 other senators introduced the bill on Wednesday, has netted nearly $1 million from oil and gas and coal mining industry donations since taking office.",
    "Roger Wicker of Mississippi, Sen. John Barrasso of Wyoming, and Sen. John Cornyn of Texas—have cumulatively made more than $3.6 million from the fossil fuel sector since taking office.",
    "A companion bill was introduced in the House by Rep. David McKinley of West Virginia, along with 10 co-sponsors who curiously were not named in McKinley’s press release.",
    "McKinley is raking in more than his fair share from fossil fuel companies, with oil and gas and mining campaign contributions reaching nearly $1 million.",
    "That leaves just Sen. Rick Scott of Florida, Sen. John Hoeven of North Dakota, Sen. Marsha Blackburn of Tennessee, and Sen. James Lankford of Oklahoma.",
    "Listen and subscribe to Daily Kos' The Brief podcast with Markos Moulitsas and Kerry Eleveld\nx\nx\nYou need to enable JavaScript to run this app.",
    "A handful of Republicans have introduced a bill that would prevent President Biden from taking substantive steps to address the climate crisis.",
    "And you’ll never guess who else signed that letter: three other lawmakers who also don’t want climate change to be declared an emergency.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "She’s cleared more than half a million dollars in campaign donations from fossil fuel groups and companies since taking office.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Call on the president to declare climate change an emergency under the National Emergencies Act.",
    "Their combined total of fossil fuel industry campaign contributions since taking office?",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n59.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Wyoming Sen. Cynthia Lummis?",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Buddy Carter of Georgia.",
    "Daily Kos is different.",
    "Nearly $2.8 million.",
    "Those senators—Sen.",
    "Please read it."
  ]
}