{
  "id": 7770,
  "mediaId": 2551,
  "date": "2022-04-02",
  "headline": "Families speak out about having to swear off Disney over its swing to left and woke policies",
  "image": "https://i.dailymail.co.uk/1s/2022/04/02/21/56139383-0-image-a-24_1648933019973.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10679783/Families-speak-having-swear-Disney-swing-left-woke-policies.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5891,
    1679,
    1940,
    3807,
    2880,
    2638,
    1357,
    6159,
    6678
  ],
  "sentences": [
    "+11\nView gallery\nDeSantis signed into law the Parental Rights in Education bill, which forbids classroom instruction on sexual orientation and gender identity in kindergarten-third grade\n+11\nView gallery\nDisney's tepid response to the controversial bill led to protests and worker walkouts\n+11\nView gallery\nDisney employee Nicholas Maldonado holds a sign while protesting outside of Walt Disney World in Orlando, Florida\nKelly Claggett, mother and owner of The Local Farm to Table & Venue in Grove, Oklahoma, told Fox News parents are standing their ground to set an example to their children.",
    "+11\nView gallery\n'Disney has surrendered to the woke mob and is using its platform to indoctrinate the children of America into becoming the woke activists of tomorrow,' Texas dad Trent Talbot said\n+11\nView gallery\n Ohio mother and grandmother Patti Gariba (center) told Fox News Digital she and others should ' void your household of all things Disney'\nTalbot also said this is why his company BRAVE Books is working on providing children with alternative options.",
    "+11\nView gallery\nGaribay, the executive director and founder of American Heritage Girls, a faith-focused alternative to the Girl Scouts, (pictured) said the company's founder would be shocked by what the company has turned into\n+11\nView gallery\nDisney expressed support for the demonstration in a Facebook post Tuesday morning\n+11\nView gallery\n+11\nView gallery\nDisney has reportedly reinstated a gay kiss in its upcoming Toy Story spinoff amid the criticism.",
    "+11\nView gallery\nDisney CEO Bob Chapek told employees during a virtual town hall that he regretted not taking a public stance against Florida's controversial 'Don't Say Gay' bill and that the company will create a task force to focus on more LGBTQ content\nDuring the same all-hands meeting, television animation executive producer Latoya Raveneau gushed about Disney's inclusivity and boasted about 'adding queerness' to shows and productions.",
    "Corporations like Disney should listen to parents and reject the left's disturbing obsession with sexualizing our children,'\nThe animation company also invited Nadine Smith, the co-founder of Equality Florida, who said that there's been a strong anti-gay movement in the Sunshine State for a long time and the ultimate goal is to take kids away from their parents.",
    "They also point to other moves by the newly woke Disney, such as including a same-sex kiss in the new Lightyear movie, adding 'racism' warnings on children's classics such as Peter Pan and The Jungle Book, and changing it's greetings at parks from 'boys and girls' greeting to the gender neutral 'dreamers of all ages'.",
    "'We've provided training to all our cast members so now they know it's 'Hello, everyone or hello, friends'\nWhen they brought the fireworks show back to the Magic Kingdom theme park in Buena Vista, Florida, they addressed the crowd as 'Dreamers of all ages.'",
    "Claude Kirk, a Republican, signed into law the Reedy Creek Improvement Act authorizing it to regulate land use, enforce building codes, treat wastewater, control drainage, maintain utilities and provide fire protection at Disney World.",
    "But the reaction was the last straw for many conservative families who are angry that their children's favorite animated films are being used 'to indoctrinate the children of America into becoming the woke activists of tomorrow'.",
    "Walt Disney's 'Magic Kingdom': How 1967 law allowed the company to govern its vast Florida domain\nThe Reedy Creek Improvement District, a semi-private, special-purpose government, is controlled by Disney.",
    "Garibay, the executive director and founder of American Heritage Girls, a faith-focused alternative to the Girl Scouts, said the company's founder would be shocked by what the company has turned into.",
    "'By 2022, 50% of regular and recurring characters across Disney General Entertainment scripted content will come from underrepresented groups,' according to the 'Reimagine' promotional material.",
    "Hawthorne (voiced by Uzo Aduba), a character in the film Lightyear, has a relationship with another female character in the film\nDespite the backlash, it appears Disney execs are doubling down.",
    "Meanwhile, Disney's diversity and inclusion chief Vivain said that they no longer address theme park visitors as 'ladies and gentleman, boys and girls' but instead as 'dreamers' and 'friends'.",
    "'Disney's opposition to a common-sense parental rights law exposes its disturbing effort to push the radical left's toxic 'woke' agenda on our country's most vulnerable, our young children.'",
    "When I read about 'woke Disney,' my friends and I all felt the same way — clearly the executives at Disney live in some kind of bubble and don't know everyday moms and dads like us.'",
    "Many families see the company's shift to woke policies as hypocritical and parents hit the company from the other side for what they said was pandering to liberal politics.",
    "Last Friday the company also announced that it would reinstate a kissing scene between two women in 'Lightyear' an upcoming film spun off the popular 'Toy Story' franchise.",
    "'When they can erase you, when they can criminalize your existence, when they can demonize who you are, the next step is to criminalize you and take your kids,' she said.",
    "Claggett said the company has pushed away multiple parents who are searching for alternatives to Disney like The Tuttle Twins that 'fill in where Disney is leaving off.'",
    "Pennsylvania Congressman Scott Perry, Chairman of the House Freedom Caucus agreed, telling Fox News that Disney's actions show they are actively pushing a 'woke' agenda.",
    "'Parents are deeply frustrated because we have to fight so hard to raise our kids with important values like honesty, integrity and learning the Golden Rule,' she said.",
    "Such private governments aren’t uncommon in Florida, which has more than 600 community development districts that manage and pay for infrastructure in new communities.",
    "The call was part of Disney’s 'Reimagine Tomorrow' campaign which promises that 50 per cent of characters and content would be from underrepresented groups by 2022.",
    "'Disney has surrendered to the woke mob and is using its platform to indoctrinate the children of America into becoming the woke activists of tomorrow,' he said.",
    "The district has the authority to tax the land, and use the revenue to provide essential public services and operate and maintain all public roads and bridges.",
    "Advertisement\n'I have heard so much from so many of my colleagues over the past few weeks in open forums, through emails and phone conversations,' Burke said.",
    "Videos from the meeting were leaked to conservative journalist Christopher Rufo of the Manhattan Institute's City Journal, who first reported them on Twitter.",
    "Today's Disney promotes a full spectrum of lifestyles that rarely align with the Biblical values of good and evil, which God calls us to,' Garibay explained.",
    "Governor Ratcliffe from 'Pocahontas', Ursula of 'The Little Mermaid,' and Scar from 'The Lion King' have all been speculated to be queer or queer-coded.",
    "One of those parents is Ohio mother and grandmother Patti Garibay, who told Fox News she and others should 'void your household of all things Disney.'",
    "'We don't want to just assume because someone might be, in our interpretation, presenting as female, that they may not want to be called 'princess.'",
    "'Last summer we removed all gendered greetings in relationship to our live spiels,' Diversity and Inclusion Vivian Ware said at Monday's town hall.",
    "The district is governed a Board of Supervisors that is selected by its 19 landowners, the biggest and most influential of them being Disney World.",
    "Earlier this week General entertainment president Karey Burke said during a company-wide Zoom call that Disney must do more to be more inclusive.",
    "Ron DeSantis' so-called Don't Say Gay Bill and apologized to the LGBTQIA community for not being 'a stronger ally in the fight for equal rights.'",
    "'It has been said before and it bears saying again, \"Walt would turn over in his grave\" to see what his beloved company has become,' she added.",
    "'Kids need entertainment that is a refuge from this crazy culture, where they can be entertained with just great stories and fun characters.",
    "'I'm here as the mother of two queer children, actually, one transgender child and one pansexual child, and also as a leader,' she said.",
    "Disney said their sensitivity to nonbinary people is nothing new they are working on eliminating gendered pronouns in their theme parks.",
    "Many Disney-loving Americans are boycotting the entertainment and media conglomerate over fears it has 'surrendered to the woke mob'.",
    "Meanwhile, the animation and live-action movie company announced that it would increase the number of gay characters in its films.",
    "If the 1967 is repealed by GOP lawmakers, Disney World's property will fall under the control of Orange and Osceola counties.",
    "And parents should have confidence that their children are seeing and hearing stories that are good and true,' he added.",
    "His comments came after Disney employees staged a walk-out in protest of the company's response to the new Florida law.",
    "'One of our execs stood up and said, 'You know we only have a handful of queer leads in our content,' Burke said.",
    "In 2021, Forbes complained in a headline 'How Many Times Is Disney Going To Introduce Its ‘First’ Gay Character?'",
    "She defended 20th Century Fox as 'the home of really incredible, groundbreaking LGBTQIA stories over the years.'",
    "The company has launched a campaign called 'Reimagine Tomorrow' with the goal to represent more minority groups.",
    "'There needs to be more companies that step up and create alternative entertainment options for families.'",
    "'Walt Disney most often cited his most important lesson as that of \"goodwill always triumphs over evil.\"",
    "Furious families are speaking out after Disney CEO Bob Chapek promised to work to overturn Florida Gov.",
    "Le Fou, the bumbling sidekick in 'Beauty and the Beast' is said to be the first openly gay character.",
    "'The radical left will stop at nothing to indoctrinate America's children with their woke ideology.",
    "Georgia Congresswoman Jody Hice told Fox News Disney should step back and hear parents out.",
    "'Our leadership over there has been so welcoming to my not-so-secret gay agenda,' she said.",
    "Burke choked up during Monday, saying the issue hit close to home because of her children.",
    "Texas father of two Trent Talbot, told Fox News that Disney caved in to woke culture.",
    "The internet is awash with stories about gay characters in their animated films.",
    "'I feel a responsibility to speak not just for my self but also for [my kids].'",
    "'Disney used to offer us wonderful content that reinforced good values.",
    "'We no longer say 'Ladies and gentlemen, boys and girls,' she said.",
    "'We want to create that magic moment with our guests,' she said.",
    "Disney's sudden sexual awakening, may be a bit of rebranding.",
    "DeSantis said the company was overstepping its authority.",
    "No one would stop me and no one was trying to stop me.'",
    "But she said that it hasn't been inclusive enough.",
    "It was created in 1967 when then-Florida Gov.",
    "'Wherever I could I was adding queerness.",
    "And then I realized it is true.'",
    "That can't be true.",
    "'I went, 'What?"
  ]
}