{
  "id": 8902,
  "mediaId": 2573,
  "date": "2022-03-26",
  "headline": "Top House Intel Committee Republican calls for classified briefing on Biden, Xi call",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Mike-Turner-House-Intelligence-Committee.jpg",
  "link": "https://www.foxnews.com/politics/top-house-intel-committee-republican-classified-briefing-biden-xi-call",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooke Singman",
  "authorUrl": "https://www.foxnews.com/person/s/brooke-singman",
  "termIds": [
    4486,
    4905,
    5030,
    3166,
    2651,
    1126,
    808,
    1478,
    6527,
    6569
  ],
  "sentences": [
    "STEFANIK WARNS RUSSIA, CHINA 'STRENGTHENING' THEIR 'AUTHORITARIAN ALLIANCE'\n\"As a permanent member of the UN Security Council and the world's two largest economies, we must not only lead the development of China-US relations on the right track, but also shoulder our due international responsibilities and make efforts for world peace and tranquility,\" the Chinese Foreign Ministry statement said.",
    "PONTE VEDRA, Fla. – The top Republican on the House Intelligence Committee is calling for a classified briefing on the call last week between President Biden and Chinese President Xi Jinping, saying the panel needs to understand what consequences the Biden administration presented to Beijing should they choose to aid Russia in its invasion of Ukraine.",
    "\"So, in addition to focusing on national security, our goal will be to get the information that we receive as notifications to Congress and make certain that it is provided to the appropriate committees for decision-making, for legislating, and for funding the appropriate programs and initiatives to make our country safe.\"",
    "GOP REP. SCOTT PERRY SAYS 'WEAKNESS IS PROVOCATIVE,' WARNS BIDEN FOREIGN POLICY 'ENCOURAGES' ADVERSARIES\nMeanwhile, the White House said Biden \"reiterated that U.S. policy on Taiwan has not changed, and emphasized that the United States continues to oppose any unilateral changes to the status quo.\"",
    "CLICK HERE TO GET THE FOX NEWS APP\nMeanwhile, if Republicans take the majority of the House of Representatives after the midterm elections in November, Turner vowed to bring the focus of the House Intelligence Committee back to what it is \"intended to be\" focused on.",
    "\"Our committee has not been briefed on it and this is certainly relevant for our committee to understand both what the president laid out to China, and what President Xi’s responses were on if the China should assist Russia militarily,\" Turner told Fox News.",
    "Turner formally requested a briefing from White House national security adviser Jake Sullivan Thursday, saying the call \"contained critical information relevant to the future of U.S.-China relations and the ongoing conflict in Ukraine.\"",
    "During an interview with Fox News at the House Republican Issues Conference Thursday, Mike Turner, R-Ohio, said understanding what transpired on President Biden’s call with Chinese President Xi Jinping is \"certainly relevant.\"",
    "Turner said that members of the Intelligence Committee \"have no transcript of the call\" and \"have no information as to what even were the elements of what Biden intended to say would be the consequences to China.\"",
    "A senior administration official said this week that the Biden administration has \"deep concerns\" about China’s \"alignment\" with Russia amid Moscow’s multi-front war against Ukraine.",
    "The official shared those concerns after Sullivan met with his Chinese counterpart, director of Chinese Foreign Affairs Commission Yang Jiechi, last Monday in Rome, Italy.",
    "\"The two leaders also agreed on the importance of maintaining open lines of communication, to manage the competition between our two countries.\"",
    "\"President Biden detailed our efforts to prevent and then respond to the invasion, including by imposing costs on Russia,\" the White House said.",
    "Shortly after the conclusion of the meeting, Chinese Ministry of Foreign Affairs said Xi underscored the \"severe challenges\" around the globe.",
    "\"China has made statements that they do not want to be in a conflict with Ukrainians, but arming Russia would have them enter that.\"",
    "\"The two leaders tasked their teams to follow up on today’s conversation in the critical period ahead,\" the White House said.",
    "In an attempt to protect intelligence sources, U.S. officials have been reluctant to detail what type of aid is being sought.",
    "\"I am certainly very concerned that perhaps he has portrayed weakness again with China as he has with Russia,\" Turner said.",
    "\"This committee is intended to be focused on national security and that's what we're going to focus on,\" Turner said.",
    "U.S. intelligence officials said Russia asked China for military and economic aid following its invasion of Ukraine.",
    "The White House said Biden \"outlined the views of the United States and our allies and partners on this crisis.\"",
    "\"The president underscored his support for a diplomatic resolution to the crisis,\" the White House added.",
    "\"Relevant events once again show that state-to-state relations cannot go to the point of confrontation.",
    "\"The Ukraine crisis is something we don't want to see,\" the Chinese Foreign Ministry reported Xi said.",
    "\"Our efforts are going to be matching intelligence to policymaking and decision-making,\" Turner said.",
    "\"Those are very important details that we need to be brought up to speed on,\" Turner said.",
    "Turner, in a swipe at Biden, said that his administration has \"a record of weakness.\"",
    "Peace and security are the most treasured treasures of the international community.\"",
    "The committee has been chaired by Democrat Rep. Adam Schiff, D-Calif., since 2019.",
    "Biden spoke with Xi last Friday on a secure video call for nearly two hours.",
    "You can reach her at Brooke.Singman@Fox.com or @BrookeSingman on Twitter.",
    "\"There should be absolute consequences to China,\" Turner said.",
    "Conflict and confrontation are not in anyone's interests.",
    "Brooke Singman is a Fox News Digital politics reporter.",
    "\"And that can result in greater escalation.\""
  ]
}