{
  "id": 9104,
  "mediaId": 2573,
  "date": "2022-03-25",
  "headline": "GOP Rep. Scott Perry says 'weakness is provocative,' warns Biden foreign policy 'encourages' adversaries",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/12/Pennsylvania-Rep-Scott-Perry.jpg",
  "link": "https://www.foxnews.com/politics/rep-scott-perry-weakness-provocative-biden-foreign-policy",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooke Singman",
  "authorUrl": "https://www.foxnews.com/person/s/brooke-singman",
  "termIds": [
    5150,
    4905,
    2765,
    2912,
    2693,
    3671,
    1126,
    6245
  ],
  "sentences": [
    "NORTH KOREA TESTS NEW ICBM MISSILE SYSTEM IN 'SERIOUS ESCALATION,' US OFFICIAL SAYS\nThe Japanese and South Korean militaries said the January missile was launched on a high trajectory, apparently to avoid the territorial spaces of neighbors, reached a maximum altitude of 1,242 miles and traveled 497 miles before landing in the sea.",
    "The flight details suggested North Korea tested its longest-range ballistic missile since 2017, when it flew ICBMs that demonstrated the potential to reach the U.S.\nNorth Korea completed more missile tests in January than it did in all of 2021, alarming South Korean officials who worry about its northern neighbor's intentions.",
    "On the sidelines of the House Republican Issues Conference, Perry, R-Pa., told Fox News Digital that the Biden administration’s response to aggression from Russia, China, Iran and North Korea in the wake of its test of an intercontinental ballistic missile this week, simply is \"not enough.\"",
    "PONTE VEDRA, Fla. – Republican Rep. Scott Perry, who sits on the House Foreign Affairs Committee, told Fox News Digital that \"weakness is provocative,\" warning that President Biden is not equipped to handle the issues at hand during this \"very dangerous and concerning time.\"",
    "(STR/AFP via Getty Images)\nThe White House condemned the DPRK’s ICBM launch, calling it \"a brazen violation of multiple U.N. Security Council resolutions and needlessly raises tensions and risks destabilizing the security situation in the region.\"",
    "White House press secretary Jen Psaki said that this action \"demonstrates that the DPRK continues to prioritize its weapons of mass destruction and ballistic missile programs over the well-being of its people.\"",
    "North Korea in January fired what appeared to be its most powerful missile since President Biden took office, a move senior U.S. officials described at the time as concerning and \"increasingly destabilizing.\"",
    "\"We’re seeing that with the Chinese in Taiwan; we’re seeing that with Iran and the Iran nuclear deal; and we’re seeing it very up close, in front, with Russia and Ukraine,\" Perry told Fox News Digital.",
    "The new ICBM system was originally unveiled during the Korean Workers Party parade Oct. 10, 2020, and again in the Defense Exhibition in Chung Young in October 2021, the official said Thursday.",
    "\"And, unfortunately, while that makes some leaders and some Americans uncomfortable, it is really important for national security that your adversaries do not know what you are going to do.\"",
    "The 2022 launches did not demonstrate ICBM range or capability but were likely aimed at testing elements of the new system, a senior administration official said earlier this month.",
    "US CONDEMNS NORTH KOREA'S LONG-RANGE BALLISTIC MISSILE TEST\n\"The door has not closed on diplomacy, but Pyongyang must immediately cease its destabilizing actions,\" Psaki said.",
    "He added: \"This is a very, very dangerous and concerning time and, unfortunately, our president doesn’t have the judgement or the competence to handle the issues at hand.\"",
    "It has threatened stronger action after the Biden administration imposed fresh sanctions following two tests of a purported hypersonic missile in early January.",
    "Testing largely was suspended under the Trump administration following a summit between North Korean Leader Kim Jong Un and former President Trump in 2018.",
    "The White House urged \"all countries to hold the DPRK accountable for such violations and call on the DPRK to come to the table for serious negotiations.\"",
    "Earlier this month, U.S. Indo-Pacific Command ordered \"intensified\" intelligence surveillance and reconnaissance in the Yellow Sea, the official said.",
    "\"Whether or not you liked the delivery of President Trump, what you knew for sure was that, you didn’t know what he was going to do,\" Perry said.",
    "The U.S. government said earlier this month that North Korea tested a new intercontinental ballistic missile (ICBM) system Feb. 26 and March 4.",
    "\"Whether it is Russia, whether it is Iran, whether it is North Korea or China, he keeps on telling them what we won’t do,\" Perry told Fox News.",
    "\"The United States will take all necessary measures to ensure the security of the American homeland and Republic of Korea and Japanese allies.\"",
    "North Korea test-launched a long-range ballistic missile on Thursday, weeks after the Biden administration warned of new tests from Pyongyang.",
    "The senior administration official, at the time, predicted a future launch at \"full range,\" which may be disguised as a space launch.",
    "\"When an adversary senses your weakness, it provokes them and encourages them to see how far they can push it,\" he said.",
    "The U.S. Indo-Pacific Command also added \"enhanced readiness among our ballistic missile defense forces in the region.\"",
    "North Korea in January attempted to justify its testing activity as an exercise of its right to self-defense.",
    "\"Now, we’re seeing it with a nuclear-armed terrorist state of North Korea,\" Perry added.",
    "Perry said that Biden \"unfortunately keeps telling the world what we won’t do.\"",
    "You can reach her at Brooke.Singman@Fox.com or @BrookeSingman on Twitter.",
    "\"So, they’re going to continue to test and it is very dangerous for us.\"",
    "Brooke Singman is a Fox News Digital politics reporter.",
    "The launch was the first of its kind since 2017."
  ]
}