{
  "id": 9438,
  "mediaId": 5308,
  "date": "2022-03-30",
  "headline": "The Freedom Caucus Has Been Triggered by Cawthorn’s Coke and Orgies Comments",
  "image": "https://video-images.vice.com/articles/62447a5f5cf35c009490a8fc/lede/1648655035515-madison-cawthorn-freedom-caucus-orgies.jpeg?image-resize-opts=Y3JvcD0xeHc6MC44NDI3eGg7MHh3LDAuMDg0NHhoJnJlc2l6ZT0xMjAwOiomcmVzaXplPTEyMDA6Kg",
  "link": "https://www.vice.com/en/article/y3v47w/freedom-caucus-madison-cawthorn",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Blest",
  "authorUrl": "https://www.vice.com/en/contributor/paul-blest",
  "termIds": [
    5399,
    2693,
    1477,
    520
  ],
  "sentences": [
    "Rep. Madison Cawthorn, the 26-year-old House freshman from North Carolina, appeared on a podcast interview last week and said that since he came to D.C. in 2020, he’s seen anti-addiction policymakers do cocaine in front of him and been witness to the “sexual perversion that goes on in Washington.”\n“I look at all these people, a lot of them that I’ve looked up to through my life, I've always paid attention to politics,\" Cawthorn said.",
    "And then you realize they are asking you to come to an orgy.”\nMultiple members of the Freedom Caucus—the group of more than 40 far-right House lawmakers—raised the prospect of kicking Cawthorn out of the group over his comments about alleged D.C. depravity, according to Politico.",
    "?want to predispose the conversation.”\nThe claim reportedly caused an uproar among the Republican membership Tuesday, as Rep. Steve Womack raised Cawthorn’s comments during a caucus meeting, according to Politico.",
    "“You should have to name names if you are going to go make those kinds of brushstroke accusations and impugn the character of people in this institution,” an anonymous Freedom Caucus member told Politico.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "After news broke of his comments being raised during the House GOP meeting, Cawthorn tweeted: “Signal, not noise.”\nWant the best of VICE News straight to your inbox?",
    "“Then all of a sudden you get invited to, ‘Well, hey, we’re going to have kind of a sexual get-together at one of our homes, you should come.",
    "“We will discuss that when we get to it,” Perry told Politico, adding that he hadn’t yet talked to Cawthorn and didn’t “?",
    "Rep. Scott Perry of Pennsylvania, the caucus chair, told Politico he plans to talk to Cawthorn about his claims.",
    "Perry echoed this sentiment, and reportedly wouldn’t rule out booting Cawthorn from the caucus.",
    "Members being investigated for allegedly paying underage girls for sex?",
    "House Minority Leader Kevin McCarthy said he would talk to Cawthorn.",
    "Cawthorn’s office did not respond to a request for comment Tuesday.",
    "Accusing fellow politicians of doing blow and hosting orgies?",
    "The Freedom Caucus has a high tolerance for immoral behavior.",
    "Supporting the overthrow of a free and fair election?",
    "Basically a prerequisite for joining.",
    "Hanging out with white nationalists?",
    "Well, hold on just a second.",
    "Sign up here.",
    "No problem.",
    "All good."
  ]
}