{
  "id": 9645,
  "mediaId": 2553,
  "date": "2022-03-30",
  "headline": "Cawthorn Called On To Name Names After D.C. Coke, Orgy Claims",
  "image": "https://dw-wp-production.imgix.net/2022/03/cawthorn.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/cawthorn-called-on-to-name-names-after-d-c-coke-orgy-claims",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Curl",
  "authorUrl": "https://www.dailywire.com/author/joseph-curl",
  "termIds": [
    0
  ],
  "sentences": [
    "He said that the only thing not accurate in that show—that you could never get a piece of legislation about education passed that quickly.”\n“Cawthorn appears to be quoting from a 2015 Gotham magazine interview with Kevin Spacey in which Spacey, the star of House of Cards, said Bill Clinton told him ’99 percent of what you do on that show is real.’ The 1 percent that he got wrong?",
    "The House Freedom Caucus, considered to be the most conservative bloc within the House Republican Conference, is calling on Rep. Madison Cawthorn (R-NC) to name names after he claimed some of his fellow members of Congress have invited him to orgies in Washington and snorted cocaine right in front of him.",
    "I mean, being kind of a young guy in Washington, where the average age is probably 60 or 70 — [you] look at all these people, a lot of them that I’ve looked up to through my life, I’ve always paid attention to politics,” Cawthorn said in an interview on Thursday, the New York Post reported.",
    "“And it’s like, this is wild.”\nIn an interview with John Lovell on the “Warrior Poet Society” podcast last week, Cawthorn was asked if Washington resembles the former Netflix series “House of Cards,” which featured rampant corruption.",
    "The Daily Wire is one of America’s fastest growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "“Then all of a sudden you get invited: ‘We’re going to have a sexual get-together at one of our homes, you should come.’ ‘What did you just ask me to come to?’ And then you realize they’re asking you to come to an orgy,” he added.",
    "“Perry wouldn’t say whether the caucus would consider booting Cawthorn if he didn’t name names or share evidence to back up his salacious claims,” the political website said, adding that members of the caucus met Monday.",
    "“Some of the people leading on the movement to try and remove addiction in our country, and then you watch them do a key bump of cocaine right in front of you,” Cawthorn said.",
    "Joseph Curl has covered politics for 35 years, including 12 years as White House correspondent, and ran the Drudge Report from 2010 to 2015.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "Freedom Caucus Chairman Rep. Scott Perry (R-PA) said he plans to talk to Cawthorn, a member of the caucus, about his allegations.",
    "“I think it is important, if you’re going to say something like that, to name names,” Perry said in an interview with Politico.",
    "House Minority Leader Kevin McCarthy (R-CA) also said he planned to speak to Cawthorn about the allegations, The Hill reported.",
    "Cawthorn’s claims have exploded around Washington, D.C.\n“The sexual perversion that goes on in Washington.",
    "“I heard a former president that we had in the ’90s was asked a question about this,” Cawthorn said.",
    "“And I haven’t talked to him at all, so I don’t want to predispose the conversation,” Perry added.",
    "Cawthorn, 26, also said he has seen leading national anti-addiction officials do cocaine.",
    "‘[Y]ou could never get an education bill passed that fast,'” Mediaite reported.",
    "Send tips to josephcurl@dailywire.com and follow him on Twitter @josephcurl.",
    "“And he gave an answer that I thought was so true.",
    "Create a free account to join the conversation!",
    "Become a member now and join our mission.",
    "Believe the same?"
  ]
}