[
  {
    "id": 4468,
    "mediaId": 2658,
    "date": "2022-01-03",
    "sentence": "—Our Sam Sutton: Republican <span class='selected-term'>Blake Masters</span> told POLITICO on Tuesday that he raised more than $550,000 for his U.S. Senate campaign in Arizona by selling non-fungible tokens depicting early cover art for a book he co-wrote with GOP megadonor and technology investor Peter Thiel.",
    "author": "",
    "title": "Happy New Year: Here's what could go wrong in 2022"
  },
  {
    "id": 4473,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "Arizona GOP Senate candidate <span class='selected-term'>Blake Masters</span> last month raised $550,000 in 36 hours when he auctioned off digital tokens depicting the cover of a book he wrote with tech investor and GOP megadonor Peter Thiel.",
    "author": "",
    "title": "Former Manchin chief signs 2"
  },
  {
    "id": 4544,
    "mediaId": 2716,
    "date": "2022-01-10",
    "sentence": "For instance, Democratic House candidate Shrina Kurani and Republican Senate candidate <span class='selected-term'>Blake Masters</span> have both offered NFTs as \"incentives for donors,\" albeit \"to varying degrees of success,\" Bloomberg reports (these are, after all, still \"the early days of crypto's push into politics\").",
    "author": "Brigid Kennedy",
    "title": "Congressional candidates turn to NFTs as form of campaign finance"
  },
  {
    "id": 4573,
    "mediaId": 2641,
    "date": "2022-01-12",
    "sentence": "Recently, Melania Trump and Arizona Senate candidate <span class='selected-term'>Blake Masters</span> (R, Ariz) announced that they, too, would be selling respective NFTs, with the former First Lady selling her limited edition piece, titled “Melania’s Vision,” for the cost of 1 Solana coin.",
    "author": "Maxwell Newman",
    "title": "10 Key Crypto Buzzwords to Know in 2022"
  },
  {
    "id": 3894,
    "mediaId": 4032,
    "date": "2022-01-24",
    "sentence": "pic.twitter.com/mXdRYPAMMG\n— <span class='selected-term'>Blake Masters</span> (@bgmasters) November 3, 2021\nNoting that the radical Left was “up in arms” over the observation, he said “a Republican politician or candidate is allowed to say ‘Critical Race Theory is bad.’ And I think some of the braver ones are even allowed to say, ‘it’s racist.’”\nBut one can’t proceed from there:\nIf you actually go and unpack that a little bit more, and say, “this is straight-up anti-white racism,” I mean the hit pieces just float in.",
    "author": "R. Cort Kirkwood",
    "title": "Masters Again: CRT Is “Anti-white Racism”"
  },
  {
    "id": 4369,
    "mediaId": 2660,
    "date": "2022-01-26",
    "sentence": "Go to OpenSecrets.org and a search on that group shows that this is a PAC that backs <span class='selected-term'>Blake Masters</span> for U.S. Senate.",
    "author": "Jon Greenberg",
    "title": "Know who’s talking to you: A guide to interpreting Facebook political ads"
  },
  {
    "id": 3169,
    "mediaId": 2643,
    "date": "2022-01-27",
    "sentence": "",
    "author": "Jake Thomas",
    "title": "For Some, Biden's Pledge of SCOTUS Nominee Puts Race Above Achievement"
  },
  {
    "id": 4372,
    "mediaId": 2570,
    "date": "2022-01-27",
    "sentence": "Rep. Lauren Boebert (R-Colo.) presdicted Biden will “try to appoint a radical leftist,” while Senate candidate <span class='selected-term'>Blake Masters</span> tweeted Biden would “nominate [drag queen] RuPaul to SCOTUS and you’ll be expected to take it seriously.”\n“Our intention is to not play games,” Psaki said Thursday after chiding Republicans who claimed Biden will nominate a radical.",
    "author": "Alison Durkee",
    "title": "White House Says Republicans Have ‘Obliterated Their Own Credibility’ By Attacking Biden’s — Still Unnamed — Supreme Court Nominee"
  },
  {
    "id": 3128,
    "mediaId": 2924,
    "date": "2022-01-30",
    "sentence": "",
    "author": "Luc Olinga",
    "title": "Crypto's Personalities Take a Page Out of an Old Political Book"
  },
  {
    "id": 3363,
    "mediaId": 2701,
    "date": "2022-01-31",
    "sentence": "Prominent next-gen Republican lawmakers and foreign policy leaders, such as Adam Laxalt, Bernie Moreno, J. D. Vance, <span class='selected-term'>Blake Masters</span>, and Peter Meijer also often voice more realist rhetoric.",
    "author": "Sumantra Maitra",
    "title": "In Opposing War With Russia, Tucker Carlson Champions The Hard-Won Truths Of Putting American Interests First"
  },
  {
    "id": 3039,
    "mediaId": 2702,
    "date": "2022-02-03",
    "sentence": "The conservative Club for Growth’s political action committee is intervening in the Republican Senate primary in Arizona, endorsing venture capitalist <span class='selected-term'>Blake Masters</span> to take on Sen. Mark Kelly (D-Ariz.).",
    "author": "Max Greenwood",
    "title": "Club for Growth endorses Blake Masters in Arizona Senate race"
  },
  {
    "id": 2839,
    "mediaId": 2546,
    "date": "2022-02-03",
    "sentence": "The conservative Club for Growth PAC endorsed venture capitalist <span class='selected-term'>Blake Masters</span>, who is running for the GOP nomination in the Arizona Senate race.",
    "author": "Kate Ackley\nMary Ellen McIntire\nStephanie Akin",
    "title": "At the Races: Big money, little baby"
  },
  {
    "id": 2326,
    "mediaId": 2748,
    "date": "2022-02-04",
    "sentence": "Brand new ad from <span class='selected-term'>Blake Masters</span>\nMasters is running for U.S. Senate in Arizona\nConversation with Madison Cawthorn",
    "author": "Blarp Blog",
    "title": "Psychopaths are running the country…Videos"
  },
  {
    "id": 2193,
    "mediaId": 2526,
    "date": "2022-02-04",
    "sentence": "— <span class='selected-term'>Blake Masters</span> (@bgmasters) February 5, 2022\nGoFundMe has a long history of bias, including banning a legal fundraiser for Kyle Rittenhouse before the teenager, now cleared of all charges,was ever convicted of a crime.",
    "author": "Allum Bokhari",
    "title": "UPDATE: GoFundMe Relents After Backlash, Will Refund All Donors to Canadian Trucker Fund"
  },
  {
    "id": 2470,
    "mediaId": 2918,
    "date": "2022-02-05",
    "sentence": "Republican Senate candidate for Arizona, <span class='selected-term'>Blake Masters</span>, said: “If GoFundMe steals the truckers’ money & sends it to left-wing non-profits, the company’s executives should be arrested and tried for fraud and theft.”\nFollowing the backlash, the company altered its position, claiming it would automatically refund all donors.",
    "author": "Kay Smythe",
    "title": "GoFundMe Attempts to Defraud Canada’s Truckers Out of $10M… Gets Owned by Backlash."
  },
  {
    "id": 2169,
    "mediaId": 8416,
    "date": "2022-02-06",
    "sentence": "",
    "author": "",
    "title": ""
  },
  {
    "id": 2290,
    "mediaId": 2644,
    "date": "2022-02-07",
    "sentence": "“Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions.”\nThiel likewise praised Zuckerberg for his “intelligence, energy, and conscientiousness.”\n“His talents will serve Meta well as he leads the company into a new era,” Thiel said\nThiel is now reportedly expected to focus more of his time on conservative political causes, including senate bids by two of his proteges, <span class='selected-term'>Blake Masters</span> and JD Vance, according to the WSJ report.",
    "author": "Theo Wayt",
    "title": "Peter Thiel leaving Meta board, will reportedly focus on pro-Trump advocacy"
  },
  {
    "id": 2047,
    "mediaId": 2748,
    "date": "2022-02-07",
    "sentence": "One option that will be available to American voters this November would be to elect a new breed of Republican politician, such as those like <span class='selected-term'>Blake Masters</span>, running for the US Senate in Arizona; J D Vance running for the US Senate in Ohio; Joe Kent running for the US House of Representatives in Washington state; and Andrew McCarthy running for the US House in upstate New York.",
    "author": "James Carden",
    "title": "The irony of America’s ‘woke’ foreign policy"
  },
  {
    "id": 1931,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "Thiel has already announced support for <span class='selected-term'>Blake Masters</span> who is running for the US Senate in Arizona.",
    "author": "Jim Hoft",
    "title": "Billionaire Peter Thiel to Step Down from Facebook Board to Support President Trump-Aligned Candidates in 2022"
  },
  {
    "id": 2040,
    "mediaId": 2754,
    "date": "2022-02-07",
    "sentence": "\"His focus will be on supporting <span class='selected-term'>Blake Masters</span>, JD Vance and others who support the Trump agenda,” he added, referring to Republican candidates for U.S. Senate.",
    "author": "Tyler Durden",
    "title": "Billionaire Peter Thiel To Leave Facebook Board To Help \"Advance The Trump Agenda\""
  },
  {
    "id": 1960,
    "mediaId": 4418,
    "date": "2022-02-07",
    "sentence": "Thiel has already announced support for <span class='selected-term'>Blake Masters</span> who is running for the US Senate in Arizona.",
    "author": "Jake Lambert",
    "title": "Billionaire Peter Thiel to Step Down from Facebook Board to Support President Trump-Aligned Candidates in 2022"
  },
  {
    "id": 1878,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\n<span class='selected-term'>Blake Masters</span>: Well, exactly.",
    "author": "Jim Hoft",
    "title": "Blake Masters: “Joe Biden Violates the Constitution EVERY SINGLE DAY – a Culture of Lawlessness – Look at How They’re Going After President Trump!” (VIDEO)"
  },
  {
    "id": 2388,
    "mediaId": 2597,
    "date": "2022-02-07",
    "sentence": "",
    "author": "",
    "title": "WATCH LIVE: THE MOST CENSORED NEWS BROADCAST IN THE WORLD"
  },
  {
    "id": 2645,
    "mediaId": 2552,
    "date": "2022-02-07",
    "sentence": "Advertisement\nHe reportedly plans to support Republicans in line with Mr Trump’s agenda, such as <span class='selected-term'>Blake Masters</span> and JD Vance, in the 2022 midterm elections.",
    "author": "Giulia Bottaro",
    "title": "Trump-supporting tech billionaire quits Facebook to focus on politics"
  },
  {
    "id": 2655,
    "mediaId": 2713,
    "date": "2022-02-07",
    "sentence": "“His focus will be on supporting <span class='selected-term'>Blake Masters</span>, JD Vance and others who support the Trump agenda,” he added, referring to Republican candidates for US Senate.",
    "author": "Lizette Chapman",
    "title": "Peter Thiel to leave Meta board to ‘support Trump agenda’"
  },
  {
    "id": 2327,
    "mediaId": 2560,
    "date": "2022-02-07",
    "sentence": "“His focus will be on supporting <span class='selected-term'>Blake Masters</span>, JD Vance and others who support the Trump agenda,” he added, referring to Republican candidates for U.S. Senate.",
    "author": "Lizette Chapman and Kurt Wagner",
    "title": "Peter Thiel to leave Meta board to advance Trump political agenda"
  },
  {
    "id": 2626,
    "mediaId": 2584,
    "date": "2022-02-07",
    "sentence": "He recently donated $10m each to the Senate campaigns of <span class='selected-term'>Blake Masters</span>, who is running for a seat in Arizona, and JD Vance, who is running in Ohio.",
    "author": "Johana Bhuiyan",
    "title": "Peter Thiel, PayPal founder and Trump ally, to step down from Meta board"
  },
  {
    "id": 2225,
    "mediaId": 2748,
    "date": "2022-02-08",
    "sentence": "",
    "author": "",
    "title": "Blake Masters: “Joe Biden Violates the Constitution EVERY SINGLE DAY – a Culture of Lawlessness – Look at How They’re Going After President Trump!” (VIDEO)"
  },
  {
    "id": 2203,
    "mediaId": 2602,
    "date": "2022-02-08",
    "sentence": "“His focus will be on supporting <span class='selected-term'>Blake Masters</span>, JD Vance and others who support the Trump agenda,” he added, referring to Republican candidates for U.S. Senate.",
    "author": "LIZETTE CHAPMAN/KURT WAGNER/TNS",
    "title": "Peter Thiel to leave Meta board to pursue Trump political agenda"
  },
  {
    "id": 1802,
    "mediaId": 2572,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Fox News Staff",
    "title": "Tucker: Our leaders are trying to intimidate truckers for speaking out."
  },
  {
    "id": 1432,
    "mediaId": 2584,
    "date": "2022-02-13",
    "sentence": "Last year, Thiel gave $10m each to the campaigns of two protégés – <span class='selected-term'>Blake Masters</span>, who is running for the Senate from Arizona, and JD Vance, from Ohio.",
    "author": "Robert Reich",
    "title": "Beware of this deadly mix: oligarchic economics and racist, nationalist populism"
  },
  {
    "id": 1515,
    "mediaId": 2741,
    "date": "2022-02-14",
    "sentence": "",
    "author": "Caleb Ecarma",
    "title": "Peter Thiel Is MAGA’s Big Money Man"
  },
  {
    "id": 1625,
    "mediaId": 2548,
    "date": "2022-02-17",
    "sentence": "But lately, the voices calling for a solution to this issue have been limited to a few courageous, heterodox conservatives, such as Arizona GOP Senate candidate <span class='selected-term'>Blake Masters</span>.",
    "author": "",
    "title": "SCHILLING: To Rebrand As Pro-Family, Republicans Must Embrace A New Economic Vision"
  },
  {
    "id": 527,
    "mediaId": 2676,
    "date": "2022-02-24",
    "sentence": "pic.twitter.com/5HD077MMf4\n— <span class='selected-term'>Blake Masters</span> (@bgmasters) February 22, 2022\nDon't be fooled by the faux-innocuous assertions of cultural history or the glib tokenism of mentioning Chuck Berry.",
    "author": "Amanda Marcotte",
    "title": "Republicans pick Putin over democracy — and Rick Scott's creepy blueprint for America shows why"
  },
  {
    "id": 472,
    "mediaId": 2664,
    "date": "2022-02-24",
    "sentence": "pic.twitter.com/5HD077MMf4\n— <span class='selected-term'>Blake Masters</span> (@bgmasters) February 22, 2022\nDon't be fooled by the faux-innocuous assertions of cultural history or the glib tokenism of mentioning Chuck Berry.",
    "author": "Amanda Marcotte",
    "title": "The real reason why the GOP loves Putin"
  },
  {
    "id": 86,
    "mediaId": 2512,
    "date": "2022-02-24",
    "sentence": "A slightly slicker but similarly disturbing message is evident in a recent campaign ad by Peter Thiel-backed GOP candidate for Arizona's Senate seat, <span class='selected-term'>Blake Masters</span>.",
    "author": "Amanda Marcotte",
    "title": "Rick Scott's agenda underscores the love fest between the GOP and Vladimir Putin"
  },
  {
    "id": 12778,
    "mediaId": 2528,
    "date": "2022-02-28",
    "sentence": "Within hours of Scott publishing his ideas, Democratic Senatorial Campaign Committee Chairman Gary Peters hung the surprise tax-hikes pitch around the necks of Republicans like incumbent Sen. Ron Johnson of Wisconsin, and Senate hopefuls Herschel Walker, who is running for office in Georgia, and <span class='selected-term'>Blake Masters</span>, who is running in Arizona, in new radio and online ads.",
    "author": "Warren Rojas",
    "title": "Republican Sen. Rick Scott's rogue plan to 'rescue' America has become a fundraising 'godsend' for Democrats as they roast the GOP about his plan to raise taxes"
  },
  {
    "id": 17556,
    "mediaId": 8407,
    "date": "2022-03-03",
    "sentence": "Republican U.S. Senate hopeful <span class='selected-term'>Blake Masters</span> launched a collection as a campaign fundraiser.",
    "author": "",
    "title": "Business Buzz: Scottsdale’s Young Paris Launches NFT Projects"
  },
  {
    "id": 11029,
    "mediaId": 2557,
    "date": "2022-03-07",
    "sentence": "— <span class='selected-term'>Blake Masters</span> (@bgmasters) March 7, 2022\nBill Barr is a morally corrupt fraud who is hellbent on selling out the President for a check.",
    "author": "DML News App",
    "title": "WATCH: Barr doubles down in slams against Trump in second interview, conservatives blast him on social media"
  },
  {
    "id": 11546,
    "mediaId": 6503,
    "date": "2022-03-10",
    "sentence": "#6 <span class='selected-term'>Blake Masters</span>\nIf you were looking to invest in stock for a politician, it would be hard to find a surer bet than Blake Masters, the former head of Thiel Capital, who is currently running for Senate in Arizona.",
    "author": "A.J. Rice",
    "title": "The 25 Most Influential Conservative Figures over the Next 25 Years"
  },
  {
    "id": 10977,
    "mediaId": 2573,
    "date": "2022-03-11",
    "sentence": "Arizona Senate candidate <span class='selected-term'>Blake Masters</span> joined ‘Tucker Carlson Tonight’ to weigh in on Big Tech censorship and the ‘hook’ it has into the White House.",
    "author": "Fox News Staff",
    "title": "Big Tech has a 'hook' into the White House says US Senate candidate"
  },
  {
    "id": 10704,
    "mediaId": 2573,
    "date": "2022-03-14",
    "sentence": "",
    "author": "",
    "title": "Tucker: This is the biggest tax increase of your life"
  },
  {
    "id": 11453,
    "mediaId": 2890,
    "date": "2022-03-16",
    "sentence": "That’s its entire point,” Carlson’s guest that night, Arizona senate candidate and Thiel Foundation president <span class='selected-term'>Blake Masters</span> chimed in, bestowing a title on DuckDuckGo that DuckDuckGo never bestowed on itself.",
    "author": "Sara Morrison",
    "title": "The free speech search engine that never was"
  },
  {
    "id": 11204,
    "mediaId": 2598,
    "date": "2022-03-17",
    "sentence": "",
    "author": "",
    "title": "Blake Masters Quits Peter Thiel Foundation To Run For Senate"
  },
  {
    "id": 9294,
    "mediaId": 2550,
    "date": "2022-03-20",
    "sentence": "cc @garyvee pic.twitter.com/0OjdAL6nrC\n— Scott Jensen (@drscottjensen) September 1, 2021\n<span class='selected-term'>Blake Masters</span> is another political candidate who has also gotten into the NFT game.",
    "author": "",
    "title": "All About NFTs: What this means for political campaigns"
  },
  {
    "id": 9139,
    "mediaId": 2641,
    "date": "2022-03-21",
    "sentence": "\"Brnovich is moving in the wrong direction and <span class='selected-term'>Blake Masters</span>, despite spending millions, is not resonating with voters.\"",
    "author": "Eric Mack",
    "title": "McLaughlin Poll: Jim Lamon Surges in Arizona GOP Senate Primary"
  },
  {
    "id": 9283,
    "mediaId": 2641,
    "date": "2022-03-21",
    "sentence": "\"Brnovich is moving in the wrong direction and <span class='selected-term'>Blake Masters</span>, despite spending millions, is not resonating with voters.\"",
    "author": "Eric Mack",
    "title": "McLaughlin Poll: Jim Lamon Surges in Arizona GOP Senate Primary"
  },
  {
    "id": 9662,
    "mediaId": 2573,
    "date": "2022-03-29",
    "sentence": "",
    "author": "",
    "title": "Tucker: Cory Booker invented his own identity"
  },
  {
    "id": 7802,
    "mediaId": 2557,
    "date": "2022-03-31",
    "sentence": "https://t.co/7G0bOOjUTd #azleg pic.twitter.com/WiJLv1HhXL\n— AZ House Republicans (@AZHouseGOP) March 30, 2022\n<span class='selected-term'>Blake Masters</span> of Arizona, a Republican candidate for U.S. Senate, released the following video message praising the newly-passed bill.",
    "author": "DML News App",
    "title": "REPORT: State will force voters to show proof of citizenship in bid to crack down on fraud"
  },
  {
    "id": 7074,
    "mediaId": 2572,
    "date": "2022-03-31",
    "sentence": "Author and Arizona Senate candidate <span class='selected-term'>Blake Masters</span> said the book Newsom appeared to be reading in the photo was a \"terrible novel.\"",
    "author": "Hanna Panreck",
    "title": "Gavin Newsom roasted for picture of him reading 'banned books' he says states are 'afraid of'"
  },
  {
    "id": 7509,
    "mediaId": 2699,
    "date": "2022-04-01",
    "sentence": "For instance, take <span class='selected-term'>Blake Masters</span>, a far-right Republican candidate vying for Senate in Arizona and a longtime vocal crypto advocate.",
    "author": "Roger Sollenberger",
    "title": "Bitcoin Makes QAnon Candidate’s Fundraising Even Sadder"
  },
  {
    "id": 7670,
    "mediaId": 2636,
    "date": "2022-04-06",
    "sentence": "One, <span class='selected-term'>Blake Masters</span>, a former employee of Mr. Thiel’s who is running for Senate in Arizona, spoke at the Rockbridge dinner reception at Mar-a-Lago on Tuesday night before Mr. Trump, and conceivably could benefit from Rockbridge’s efforts.",
    "author": "",
    "title": "Dissatisfied With Their Party, Wealthy Republican Donors Form Secret Coalitions"
  },
  {
    "id": 5567,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "Arizona Republican Senate candidate <span class='selected-term'>Blake Masters</span> has made no secret of his connections to his longtime business partner and biggest political benefactor, billionaire tech investor Peter Thiel.",
    "author": "Roger Sollenberger",
    "title": "The Epic Back-Scratching Fest Between a GOP Senate Wannabe and a Trumpy Billionaire"
  },
  {
    "id": 7015,
    "mediaId": 8349,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Garret Lewis",
    "title": "Garret Talks To Blake Masters About Election Fraud Report, Border"
  },
  {
    "id": 5289,
    "mediaId": 2578,
    "date": "2022-04-13",
    "sentence": "He was known to the FBI, but FBI was too busy kidnapping the Michigan governor.pic.twitter.com/LFXCCAbQmh\n— <span class='selected-term'>Blake Masters</span> (@bgmasters) April 13, 2022\nHopefully, the FBI will not raid Blake’s home with armed SWAT teams following this tweet.",
    "author": "Jim Hoft",
    "title": "Blake Masters: “FBI Was Too Busy Kidnapping the Michigan Governor” to Keep Tabs on Black Nationalist NYC Subway Shooter Who Was on Their Radar"
  },
  {
    "id": 5813,
    "mediaId": 4067,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Emily Baker-White",
    "title": "Political Campaigns Are Facing Risks With Crypto Donations On Coinbase And BitPay"
  },
  {
    "id": 5537,
    "mediaId": 4091,
    "date": "2022-04-14",
    "sentence": "He was known to the FBI, but FBI was too busy kidnapping the Michigan governor.pic.twitter.com/LFXCCAbQmh\n— <span class='selected-term'>Blake Masters</span> (@bgmasters) April 13, 2022\nAfter two suspects were acquitted in an alleged plot to kidnap Governor Whitmer, a Daily Mail report revealed that the FBI played an instrumental role in escalating what was initially just ‘stoned crazy talk’ in to a full blown plan to kidnap Governor Whitmer.",
    "author": "News Editors",
    "title": "“FBI was too busy kidnapping the Michigan Governor” to keep tabs on black nationalist NYC subway shooter who was on their radar” says Arizona senate candidate"
  }
]