[
  {
    "id": 1695,
    "mediaId": 129,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Left and Center-Left Both Claim Stacey Abrams. Who's Right?"
  },
  {
    "id": 1636,
    "mediaId": 63,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "Nicholas Reimann",
    "title": "GOP Figures Blast Trump's Rehashing Of Election Fraud Claims: Learn To Lose'"
  },
  {
    "id": 608,
    "mediaId": 43,
    "date": "2/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The Cracks in the Republican Party are Expanding: Saturday's GNR"
  },
  {
    "id": 1472,
    "mediaId": 19,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Stacey Abrams Poses Maskless with Dozens of Masked Children, Deletes Photo amid Fierce Backlash"
  },
  {
    "id": 1389,
    "mediaId": 238,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "If 20-year career politician <span class='selected-term'>Brian Kemp</span> spent half as much time protecting Georgia's elections as he does scheming to hold on to his office, we wouldn't be in this mess.?\nIn a statement, Kemp's campaign spokesman, Cody Hall, said: It's no surprise that David Perdue and Stacey Abrams are joining forces to maintain the blatantly unfair status quo and continue raising money for their campaigns when the Governor is prohibited by law from doing so, solely because he is the incumbent during a legislative session.",
    "author": "",
    "title": "Stacey Abrams, David Perdue call foul on GOP proposal to ban fundraising while Georgia legislature is in session"
  },
  {
    "id": 1969,
    "mediaId": 195,
    "date": "4/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "Caroline Vakil",
    "title": "Trump stumps for Vance while acknowledging he said some bad sh about me'"
  },
  {
    "id": 1938,
    "mediaId": 238,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion: No Republican who participates in the war on truth deserves your vote"
  }
]