[
  {
    "id": 5356,
    "mediaId": 195,
    "date": "2022-00-01",
    "sentence": "",
    "author": "Caroline Vakil",
    "title": "GA state Senate sends permit-less carry handgun bill to Kemp",
    "sentiment": "0"
  },
  {
    "id": 5364,
    "mediaId": 65,
    "date": "2022-00-01",
    "sentence": "",
    "author": "",
    "title": "Georgia set to become 25th state with 'constitutional carry' law in major win for gun-rights activists",
    "sentiment": "0"
  },
  {
    "id": 5351,
    "mediaId": 19,
    "date": "2022-00-02",
    "sentence": "",
    "author": "AWR Hawkins",
    "title": "Gov. Brian Kemp: Georgians Carry Permit Is the 2nd Amendment",
    "sentiment": "0.468"
  },
  {
    "id": 4725,
    "mediaId": 157,
    "date": "2022-00-04",
    "sentence": "There's also a question of whether Rep. <span class='selected-term'>Brian Kemp</span> (R-GA), who is heated reelection battle, would call a special legislative session to craft even stricter laws.",
    "author": "Sarah K. Burris",
    "title": "Here are the specifics on the 22 state laws that will go into effect if the Supreme Court eliminates Roe",
    "sentiment": "0.0"
  },
  {
    "id": 4639,
    "mediaId": 12,
    "date": "2022-00-06",
    "sentence": "",
    "author": "Andy Miller",
    "title": "As overdoses soar, more states decriminalize fentanyl testing strips",
    "sentiment": "0"
  },
  {
    "id": 5287,
    "mediaId": 98,
    "date": "2022-00-06",
    "sentence": "",
    "author": "",
    "title": "Residents of Southern states clear storm debris as more severe weather looms",
    "sentiment": "0"
  },
  {
    "id": 8171,
    "mediaId": 43,
    "date": "2022-00-10",
    "sentence": "David Nir:\nThe fun thing here is that Perdue for all of Trump's extremely loud mouth support and incredible abuse that he's heaped on <span class='selected-term'>Brian Kemp</span>, has been a pitiful fundraiser so far.",
    "author": "",
    "title": "What do Bidens approval ratings mean for the midterms? (transcript)",
    "sentiment": "0.0"
  },
  {
    "id": 5202,
    "mediaId": 19,
    "date": "2022-00-12",
    "sentence": "",
    "author": "AWR Hawkins",
    "title": "Brian Kemp Signs Bill Making Georgia 25th Constitutional Carry State",
    "sentiment": "0"
  },
  {
    "id": 5209,
    "mediaId": 33,
    "date": "2022-00-12",
    "sentence": "",
    "author": "Andy Rose and Theresa Waldrop",
    "title": "Georgia governor signs bill allowing most residents to carry a concealed gun without a permit",
    "sentiment": "0"
  },
  {
    "id": 5105,
    "mediaId": 209,
    "date": "2022-00-17",
    "sentence": "",
    "author": "The Week Staff",
    "title": "Putting more guns on the street",
    "sentiment": "0"
  },
  {
    "id": 7094,
    "mediaId": 1576,
    "date": "2022-00-20",
    "sentence": "",
    "author": "",
    "title": "Announcement expected to confirm $7B auto plant in Georgia",
    "sentiment": "0"
  },
  {
    "id": 7069,
    "mediaId": 151,
    "date": "2022-00-21",
    "sentence": "",
    "author": "",
    "title": "Trump's revenge tour is put to the test in Georgia, Alabama",
    "sentiment": "0"
  },
  {
    "id": 7256,
    "mediaId": 441,
    "date": "2022-00-22",
    "sentence": "Chung said Hyundai would invest an additional $5 billion through 2025 to collaborate with American enterprises in diverse technologies, such as robotics, urban air mobility, autonomous driving and AI.?\nGeorgias Republican Governor <span class='selected-term'>Brian Kemp</span> -- who faces former Senator David Perdue in Tuesdays GOP primary -- has backed hefty incentives to lure automotive companies.",
    "author": "Jennifer Jacobs",
    "title": "Biden Urges Hyundai, Samsung to Embrace Union Workers",
    "sentiment": "0.0"
  },
  {
    "id": 7290,
    "mediaId": 238,
    "date": "2022-00-23",
    "sentence": "The latest example is Pence's decision to campaign Monday night in Georgia with the state's incumbent GOP governor, <span class='selected-term'>Brian Kemp</span>, who faces a primary challenge Tuesday from former U.S. senator David Perdue.",
    "author": "Mariana Alfaro",
    "title": "On our radar: Pence appearing in Ga. as part of pushback against Trump-backed candidates for governor",
    "sentiment": "0.0"
  },
  {
    "id": 7482,
    "mediaId": 195,
    "date": "2022-00-23",
    "sentence": "",
    "author": "Niall Stanage",
    "title": "The Memo: Trump no longer holds MAGA movement in his palm",
    "sentiment": "0"
  },
  {
    "id": 7484,
    "mediaId": 195,
    "date": "2022-00-23",
    "sentence": "",
    "author": "Rachel Scully",
    "title": "What time do polls close in Georgia, Texas?",
    "sentiment": "0"
  },
  {
    "id": 7295,
    "mediaId": 195,
    "date": "2022-00-24",
    "sentence": "Im here because <span class='selected-term'>Brian Kemp</span> is the only candidate in tomorrows primary who has already defeated Stacey Abrams, whether she knows it or not, Pence told rally attendees, referring to Abramss refusal to accept the election results of their gubernatorial election four years ago (The Atlanta Journal-Constitution).",
    "author": "Alexis Simendinger",
    "title": "The Hills Morning Report  Will GOP primaries offer clues about 2024?",
    "sentiment": "-0.264"
  },
  {
    "id": 7308,
    "mediaId": 195,
    "date": "2022-00-24",
    "sentence": "",
    "author": "Max Greenwood",
    "title": "Five things to watch in the Georgia, Alabama primaries",
    "sentiment": "-0.51"
  },
  {
    "id": 7309,
    "mediaId": 323,
    "date": "2022-00-24",
    "sentence": "",
    "author": "Cameron McWhirter",
    "title": "Georgia GOP Primary Elections for Governor and Secretary of State Are Top Contests Today",
    "sentiment": "0.26"
  },
  {
    "id": 7313,
    "mediaId": 129,
    "date": "2022-00-24",
    "sentence": "Governors Race: David Perdues impending loss to <span class='selected-term'>Brian Kemp</span> looms as the biggest electoral setback for Donald Trump since his own 2020 defeat.",
    "author": "",
    "title": "What to Watch For in Todays Elections in Georgia and Beyond",
    "sentiment": "-0.793"
  },
  {
    "id": 7338,
    "mediaId": 25,
    "date": "2022-00-24",
    "sentence": "David Perdue and <span class='selected-term'>Brian Kemp</span>.",
    "author": "",
    "title": "Primary results 2022: Georgia, Alabama, Arkansas, Texas runoff and Minnesota special election primary results",
    "sentiment": "0.206"
  },
  {
    "id": 7349,
    "mediaId": 32,
    "date": "2022-00-24",
    "sentence": "",
    "author": "Kevin Breuninger",
    "title": "Georgia's primary elections on Tuesday are pivotal. Here's what to watch",
    "sentiment": "-0.643"
  },
  {
    "id": 7350,
    "mediaId": 129,
    "date": "2022-00-24",
    "sentence": "Here is what else is going on:\nOn Monday, Trump and Mike Pence, his former vice president, held dueling events for their respective candidates in the Republican primary for governor: David Perdue, a former senator and Dollar General executive who entered the race at Trump's insistence, and <span class='selected-term'>Brian Kemp</span>, the incumbent.",
    "author": "",
    "title": "Live Updates: What to Watch For in Today's Elections in Georgia and Beyond",
    "sentiment": "-0.762"
  },
  {
    "id": 7416,
    "mediaId": 195,
    "date": "2022-00-24",
    "sentence": "",
    "author": "",
    "title": "Live coverage: Polls close in Alabama, Texas",
    "sentiment": "-0.484"
  },
  {
    "id": 7428,
    "mediaId": 136,
    "date": "2022-00-24",
    "sentence": "Georgia\nIn Georgia's Republican primary race for governor, incumbent <span class='selected-term'>Brian Kemp</span> will face off against former Senator David Perdue, who has been endorsed by former President Donald Trump.",
    "author": "Isabel Martins",
    "title": "Primary Election Results for Georgia, Texas, Alabama and Other States",
    "sentiment": "0.0"
  },
  {
    "id": 7430,
    "mediaId": 136,
    "date": "2022-00-24",
    "sentence": "Where Trump has taken the biggest risk in the GOP gubernatorial race in Georgia, where he has supported former Senator David Perdue over the popular Republican Governor <span class='selected-term'>Brian Kemp</span>.",
    "author": "Ewan Palmer",
    "title": "Donald Trump Set for Slew of Primary Losses as Midterms Strategy Unravels",
    "sentiment": "-0.774"
  },
  {
    "id": 7435,
    "mediaId": 65,
    "date": "2022-00-24",
    "sentence": "KEMP, PERDUE, MAKE FINAL PITCHES IN GEORGIA'S HEATED GOP GUBERNATORIAL SHOWDOWN\n\"<span class='selected-term'>Brian Kemp</span> is truly an embarrassment to the Republican Party because of what's taken place in your great state, Georgia,\" Trump charged during a tele-rally Monday evening on behalf of Perdue.",
    "author": "",
    "title": "Trump looms large over Tuesday primaries in Georgia, Alabama, Arkansas, and runoff in Texas",
    "sentiment": "0"
  },
  {
    "id": 7437,
    "mediaId": 223,
    "date": "2022-00-24",
    "sentence": "Down in Georgia, incumbent Governor <span class='selected-term'>Brian Kemp</span>  endorsed by former Vice President Mike Pence  squares off against former Senator David Perdue  endorsed by former President Donald Trump  in a key test of the power held by the previous administration's top two figures.",
    "author": "Spencer Brown",
    "title": "Here's What to Expect in the Texas Runoffs and Races in Georgia, Alabama, and Arkansas",
    "sentiment": "-0.538"
  },
  {
    "id": 7438,
    "mediaId": 238,
    "date": "2022-00-24",
    "sentence": "Today, Republican voters in Georgia will decide a marquee primary contest for governor between incumbent <span class='selected-term'>Brian Kemp</span> and former U.S. senator David Perdue, an election that could be a big setback for former president Donald Trump as he tries to play GOP kingmaker.",
    "author": "Mariana Alfaro",
    "title": "Primary elections live updates Big races are on the ballot in Georgia, Alabama, Arkansas and Texas",
    "sentiment": "0.0"
  },
  {
    "id": 7444,
    "mediaId": 943,
    "date": "2022-00-24",
    "sentence": "When <span class='selected-term'>Brian Kemp</span> prevails on Tuesday, he will prove that voters want their leaders to focus on the everyday issues in their lives like high gas prices and rising crime, not indulging the petty grievances of another politician, Hogan told The Associated Press.",
    "author": "STEVE PEOPLES and JEFF AMY",
    "title": "What to watch in Tuesdays primaries: Trumps bid to reshape GOP faces biggest hurdles in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7446,
    "mediaId": 151,
    "date": "2022-00-24",
    "sentence": "",
    "author": "",
    "title": "Trump heads for big rebuke in Tuesdays elections",
    "sentiment": "-0.916"
  },
  {
    "id": 7470,
    "mediaId": 178,
    "date": "2022-00-24",
    "sentence": "Let's take a few hours, lick our wounds, and tomorrow morning, you're going to hear me going to work for <span class='selected-term'>Brian Kemp</span> to make damn sure that Stacey Abrams is never governor of Georgia.\"",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Kemp wins Georgia GOP gov's race in stinging rebuke of Trump",
    "sentiment": "0.397"
  },
  {
    "id": 7472,
    "mediaId": 19,
    "date": "2022-00-24",
    "sentence": "Perdue is the third Trump-backed governor candidate to lose in as many weeks https://t.co/Sie3a6qeqA pic.twitter.com/zLhCJkWtjm\n Grace Panetta (@grace_panetta) May 24, 2022\nWhile the Associated Press and the networks have not yet called it, it is looking like a very big night for <span class='selected-term'>Brian Kemp</span>.",
    "author": "Matthew Boyle",
    "title": "*** Election Night Livewire *** Georgia, Alabama, Texas, Arkansas, Minnesota Vote in Key Primaries",
    "sentiment": "0.0"
  },
  {
    "id": 7345,
    "mediaId": 1576,
    "date": "2022-00-25",
    "sentence": "",
    "author": "",
    "title": "Takeaways: Trump's big primary defeat; scandals for the win",
    "sentiment": "0.642"
  },
  {
    "id": 7362,
    "mediaId": 195,
    "date": "2022-00-25",
    "sentence": "Trump's endorsement suffered a major loss in Georgia's gubernatorial race with incumbent <span class='selected-term'>Brian Kemp</span>'s (R ) victory over former Sen. David Perdue (R-Ga.).",
    "author": "Max Greenwood",
    "title": "Five takeaways from primaries in Georgia, Alabama and beyond",
    "sentiment": "-0.338"
  },
  {
    "id": 7369,
    "mediaId": 65,
    "date": "2022-00-25",
    "sentence": "And on the eve of the Peach State's primary  with Trump backing Kemp challenger former Sen. David Perdue  the former president took aim at the governor one last time before voters headed to the polls\n\"<span class='selected-term'>Brian Kemp</span> is truly an embarrassment to the Republican Party because of what's taken place in your great state, Georgia,\" Trump charged during a tele-rally Monday evening on behalf of Perdue.",
    "author": "Tyler Olson",
    "title": "Primary elections in Georgia, Alabama, runoff in Texas",
    "sentiment": "0.232"
  },
  {
    "id": 7379,
    "mediaId": 18,
    "date": "2022-00-25",
    "sentence": "I had an inelegant delivery of a statement that I will keep making  that is <span class='selected-term'>Brian Kemp</span> is a failed governor who doesn't care about the people of Georgia, Abrams said.",
    "author": "Associated Press",
    "title": "Midterm updates | Jones, Collins in Georgia GOP House runoff",
    "sentiment": "0.0"
  }
]