[
  {
    "id": 1478,
    "mediaId": 43,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Morning Digest: New House fundraising reports shed light on"
  },
  {
    "id": 1389,
    "mediaId": 238,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "If 20-year career politician <span class='selected-term'>Brian Kemp</span> spent half as much time protecting Georgia's elections as he does scheming to hold on to his office, we wouldn't be in this mess.?\nIn a statement, Kemp's campaign spokesman, Cody Hall, said: It's no surprise that David Perdue and Stacey Abrams are joining forces to maintain the blatantly unfair status quo and continue raising money for their campaigns when the Governor is prohibited by law from doing so, solely because he is the incumbent during a legislative session.",
    "author": "",
    "title": "Stacey Abrams, David Perdue call foul on GOP proposal to ban fundraising while Georgia legislature is in session"
  },
  {
    "id": 429,
    "mediaId": 43,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Two Republicans who certified 2020 are winning money race against two"
  },
  {
    "id": 1144,
    "mediaId": 238,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion: Trump's un-endorsement of Mo Brooks hurts Trump more than it hurts Brooks"
  },
  {
    "id": 2198,
    "mediaId": 19,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "It's RINO <span class='selected-term'>Brian Kemp</span>,? a recent Perdue ad says.",
    "author": "Ashley Oliver",
    "title": "George Soros Company': Electric Vehicle Plant Deal Emerges as Flashpoint in Georgia Governor's Race"
  },
  {
    "id": 134,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "MAY 24\nStates holding primaries: Alabama, Arkansas, Georgia\nKey race to watch: Trump is out for revenge in Georgia, where he's backed several candidates for state offices in an effort to oust GOP incumbents (including Governor <span class='selected-term'>Brian Kemp</span>) who refused to help him undo Biden's 2020 win.",
    "author": "Steve Friess",
    "title": "These Are Key Races to Watch In Every State Primary This Election Season"
  },
  {
    "id": 1903,
    "mediaId": 195,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "",
    "author": "Max Greenwood",
    "title": "Seven key primary races to watch in May"
  },
  {
    "id": 1751,
    "mediaId": 195,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "Tal Axelrod",
    "title": "After Vance, five Trump endorsements to watch"
  },
  {
    "id": 3177,
    "mediaId": 151,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Trump bets his brand on 2 elections"
  },
  {
    "id": 3162,
    "mediaId": 65,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Trump sees split decision in high-profile Nebraska, West Virginia GOP primaries"
  }
]