[
  {
    "id": 5347,
    "mediaId": 223,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Rebecca Downs",
    "title": "Mark Zuckerberg Involved in Significant 2020 Election Interference, New Documentary Exposes"
  },
  {
    "id": 5101,
    "mediaId": 21,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "Trump has made various risky endorsements, including David Perdue against incumbent <span class='selected-term'>Brian Kemp</span> in Georgia's gubernatorial race.",
    "author": "Alia Shoaib",
    "title": "'Gambler' Trump is going against advisers by endorsing risky candidates like Dr. Oz and JD Vance, report says"
  },
  {
    "id": 4683,
    "mediaId": 19,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Simon Kent",
    "title": "Georgia High School Association Begins Transgender Sports Ban"
  },
  {
    "id": 3307,
    "mediaId": 233,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "In a statement announcing the May 23 rally, Pence called Kemp one of the most successful conservative governors in America.?\n\"<span class='selected-term'>Brian Kemp</span> is my friend, a man dedicated to faith, family and the people of Georgia,? Pence said.",
    "author": "Ella Lee",
    "title": "Pence will go toe-to-toe with Trump in Georgia as he announces rally with GOP Gov. Brian Kemp"
  },
  {
    "id": 3506,
    "mediaId": 238,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hugh Hewitt",
    "title": "Opinion Trump hovers, but the number of his likely rivals keeps growing"
  },
  {
    "id": 4457,
    "mediaId": 233,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "David Jackson",
    "title": "Voter 'subversion': Trump Republicans push laws to make it easier to change elections, per report"
  },
  {
    "id": 6605,
    "mediaId": 33,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Gabby Orr",
    "title": "Trump may hold off on more endorsements for coming primaries, advisers say"
  },
  {
    "id": 7262,
    "mediaId": 234,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Senator David Perdue is almost certain to lose to incumbent <span class='selected-term'>Brian Kemp</span>is among several contests into which Trump has injected himself this cycle.",
    "author": "",
    "title": "Report: State Legislatures Have Become a Linchpin of Trumps Attack on Free and Fair Elections"
  }
]