[
  {
    "id": 8190,
    "mediaId": 12,
    "date": "d2022-02-03T19:00",
    "sentence": "Both political parties acknowledge these demographic trends generally favor Democrats in a closely divided state, where Democrat Joe Biden won the 2020 presidential race by less than 12,000 votes after Republican <span class='selected-term'>Brian Kemp</span> prevailed in the 2018 gubernatorial contest by 55,000 votes.",
    "author": "Mark Niesse",
    "title": "Sharp growth in Georgia voters alters landscape for 2022 elections",
    "sentiment": "-0.261"
  },
  {
    "id": 8173,
    "mediaId": 12,
    "date": "d2022-02-09T21:00",
    "sentence": "",
    "author": "Greg Bluestein",
    "title": "Self-proclaimed Black Donald Trump to test ex-presidents brand in rural Georgia",
    "sentiment": "0"
  },
  {
    "id": 8168,
    "mediaId": 43,
    "date": "d2022-02-10T00:00",
    "sentence": "Hes been a Democrat for decades, but his hunger for power has obviously overtaken his hunger for reality, and with failed former President Donald Trumps blessing, he bolted from his gubernatorial race against <span class='selected-term'>Brian Kemp</span> to try his hand at the 10th Congressional District race in Dekalba district he doesnt even live in.",
    "author": "Rebekah Sager",
    "title": "On Jan. 6 Vernon Jones switched parties. Trump's endorsing him for a Congressional seat in Georgia",
    "sentiment": "0"
  },
  {
    "id": 5280,
    "mediaId": 12,
    "date": "d2022-04-06T16:00",
    "sentence": "",
    "author": "Ernie Suggs",
    "title": "Black Atlanta women judges say Ketanji Brown Jackson scrutiny familiar",
    "sentiment": "0"
  },
  {
    "id": 5212,
    "mediaId": 12,
    "date": "d2022-04-11T19:00",
    "sentence": "",
    "author": "Shelia Poole",
    "title": "Voting will be top at the agenda for faith leaders during upcoming rally",
    "sentiment": "0"
  },
  {
    "id": 4901,
    "mediaId": 12,
    "date": "d2022-04-27T17:00",
    "sentence": "",
    "author": "Maureen Downey",
    "title": "Opinion: In firing school chief, DeKalb board squanders moment",
    "sentiment": "0"
  },
  {
    "id": 4775,
    "mediaId": 12,
    "date": "d2022-05-02T15:00",
    "sentence": "",
    "author": "Shannon McCaffrey",
    "title": "Race for Georgia insurance commissioner seeks to move past scandal",
    "sentiment": "0.0"
  },
  {
    "id": 7370,
    "mediaId": 18,
    "date": "d2022-05-25T02:04",
    "sentence": "I had an inelegant delivery of a statement that I will keep making  that is <span class='selected-term'>Brian Kemp</span> is a failed governor who doesn't care about the people of Georgia, Abrams said.",
    "author": "Associated Press",
    "title": "Midterm updates | Nguyen in runoff in Democratic SoS primary",
    "sentiment": "0.0"
  }
]