[
  {
    "id": 1333,
    "mediaId": 19,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "This is all on <span class='selected-term'>Brian Kemp</span>'s watch.",
    "author": "Ashley Oliver",
    "title": "Exclusive  David Perdue: Halting Buckhead City Bill Is Height of Corruption' in Georgia Statehouse"
  },
  {
    "id": 1306,
    "mediaId": 19,
    "date": "2/26/2022 12:00:00 AM",
    "sentence": "In Trump's statement on Saturday, the former president took aim at Kemp for the dormant Buckhead bill, and also singled out Ralston, Duncan, and three specific state senators:\nRINOs like Governor <span class='selected-term'>Brian Kemp</span>, the man responsible, along with his puppet master Mitch McConnell, for the loss of two Senate Seats and 2020 Presidential Vote, Lt.",
    "author": "Ashley Oliver",
    "title": "Trump Backs Georgia's Buckhead Bill, Bashes RINOs like Gov. Brian Kemp': They Don't Deliver'"
  },
  {
    "id": 274,
    "mediaId": 302,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Trump has taken a particularly active role in shaping the governor's race, recruiting former Sen. David Perdue to challenge incumbent <span class='selected-term'>Brian Kemp</span> as retribution for his not going along with lies about the 2020 election being stolen.",
    "author": "Associated Press",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 1081,
    "mediaId": 136,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump heads to Georgia on Saturday for a large rally in support of GOP gubernatorial candidate David Perduewho is challenging incumbent Republican Governor <span class='selected-term'>Brian Kemp</span>.",
    "author": "Jason Lemon",
    "title": "Trump Georgia Rally Takes Aim at Kemp 'to Settle a Score' After 2020 Feud"
  },
  {
    "id": 1082,
    "mediaId": 124,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "COMMERCE, Ga.  President Donald Trump's stamp of approval was supposed to turn former Sen. David Perdue of Georgia into the favorite to beat incumbent <span class='selected-term'>Brian Kemp</span> for the Republican gubernatorial nomination here.",
    "author": "",
    "title": "Trump's clout tested as he seeks to oust Georgia's GOP governor"
  },
  {
    "id": 1085,
    "mediaId": 136,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "David Perdue, on the other hand, is trailing to current Governor <span class='selected-term'>Brian Kemp</span> in the Republican primary race.",
    "author": "Alexandra Hutzler",
    "title": "How to Watch Trump Georgia Rally: Time, Live Stream for GOP Campaign Event"
  },
  {
    "id": 1091,
    "mediaId": 33,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "Gabby Orr and Michael Warren",
    "title": "Trump's endorsement power will be put to the test as May primaries approach"
  },
  {
    "id": 1065,
    "mediaId": 136,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "The former president pressured the southern state's GOP leadersGovernor <span class='selected-term'>Brian Kemp</span>, Secretary of State Brad Raffensperger and Lieutenant Governor Geoff Duncanto overturn President Joe Biden's 2020 election victory in the state, but they declined to assist in the effort.",
    "author": "Jason Lemon",
    "title": "Trump's Georgia Rally Sees 'Smallest Crowd' in State Since 2016: Reporters"
  },
  {
    "id": 1816,
    "mediaId": 147,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Steve Peoples",
    "title": "As Trump's chosen candidates face voters in May races, bid to shape GOP is tested"
  }
]