[
  {
    "id": 1644,
    "mediaId": 65,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Georgia Gov. Kemp reports massive fundraising haul over past six months"
  },
  {
    "id": 1389,
    "mediaId": 238,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "If 20-year career politician <span class='selected-term'>Brian Kemp</span> spent half as much time protecting Georgia's elections as he does scheming to hold on to his office, we wouldn't be in this mess.?\nIn a statement, Kemp's campaign spokesman, Cody Hall, said: It's no surprise that David Perdue and Stacey Abrams are joining forces to maintain the blatantly unfair status quo and continue raising money for their campaigns when the Governor is prohibited by law from doing so, solely because he is the incumbent during a legislative session.",
    "author": "",
    "title": "Stacey Abrams, David Perdue call foul on GOP proposal to ban fundraising while Georgia legislature is in session"
  },
  {
    "id": 2153,
    "mediaId": 305,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "",
    "author": "Murjani Rawls",
    "title": "Herschel Walker Leads Raphael Warnock In Early Georgia Senate Poll"
  },
  {
    "id": 2026,
    "mediaId": 65,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Georgia Senate race: Herschel Walker lands endorsement of leading anti-abortion group"
  },
  {
    "id": 1852,
    "mediaId": 409,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Sparks flew between former senator David Perdue and Georgia governor <span class='selected-term'>Brian Kemp</span> at the GOP gubernatorial primary debate Thursday night.",
    "author": "Caroline Downey",
    "title": "Sparks Fly at Heated Georgia Debate Between Brian Kemp, David Perdue"
  },
  {
    "id": 1704,
    "mediaId": 21,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "\"One of the problems also is if <span class='selected-term'>Brian Kemp</span> gets in, I think it's going to be very, very hard for Herschel Walker to win,\" the former president said.",
    "author": "John L. Dorman",
    "title": "Trump says it will be 'very hard' for Herschel Walker to win the Georgia Senate race if Brian Kemp is the GOP gubernatorial nominee"
  }
]