[
  {
    "id": 1394,
    "mediaId": 237,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Georgia voters know that unlike political opportunist and woke leftist Stacey Abrams, <span class='selected-term'>Brian Kemp</span> shares their values and works for them.?\nThe RGA air cover for Kemp came within days of Vernon Jones dropping out of the Georgia GOP gubernatorial primary, giving Perdue an unobstructed opportunity to oust Kemp.",
    "author": "David M. Drucker",
    "title": "Republican governors buy ads in Georgia to help Brian Kemp"
  },
  {
    "id": 5398,
    "mediaId": 1576,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Now Perdue is running in the Republican primary for Georgia governor against incumbent Republican <span class='selected-term'>Brian Kemp</span>, and he is hoping this time support from Trump will be enough to galvanize supporters.",
    "author": "",
    "title": "AJC politics reporter Greg Bluestein on his new book and whether Georgia may be 'Flipped' again"
  },
  {
    "id": 2091,
    "mediaId": 43,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Trump's going all in to trash frontrunner Brian Kemp in Georgia's GOP gubernatorial primary"
  },
  {
    "id": 4991,
    "mediaId": 157,
    "date": "4/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "Bob Brigham",
    "title": "David Perdue claims it's Brian Kemp's fault voters rejected him  and gave Democrats Senate control"
  },
  {
    "id": 1914,
    "mediaId": 237,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "Barnini Chakraborty",
    "title": "Brian Kemp surges ahead of Trump-backed David Perdue in Georgia GOP primary: Poll"
  },
  {
    "id": 4945,
    "mediaId": 157,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "Matthew Chapman",
    "title": "Former GOP senator likely billed taxpayers for her private jet  while claiming it would save them money: report"
  },
  {
    "id": 4795,
    "mediaId": 157,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Brad Reed",
    "title": "Trump to phone in stump speech for David Perdue as his quest to beat Brian Kemp spirals downward"
  },
  {
    "id": 3396,
    "mediaId": 65,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "I am proud to offer my full support for four more years of <span class='selected-term'>Brian Kemp</span> as governor of the great state of Georgia!,\" the former vice president emphasized in a statement this weekend, as the Kemp campaign announced that Pence will campaign with Georgias conservative governor on the eve of the states May 24 primary.",
    "author": "",
    "title": "Is Trump faceoff with Pence in Georgia GOP gubernatorial showdown an early 2024 skirmish?"
  },
  {
    "id": 6541,
    "mediaId": 21,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Cheryl Teh",
    "title": "Trump is ditching David Perdue, the Georgia GOP candidate he backed who is now struggling in his gubernatorial race"
  },
  {
    "id": 7098,
    "mediaId": 157,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "\"We're a few days from some big primaries including in Georgia, where the former President Donald Trump has worked hard, really hard, to defeat incumbent Republican Governor <span class='selected-term'>Brian Kemp</span>,\" said anchor John Berman.",
    "author": "Matthew Chapman",
    "title": "Trump is about to 'get embarrassed' in Georgia GOP primary: CNN election analyst"
  },
  {
    "id": 7071,
    "mediaId": 157,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "",
    "author": "Tom Boggioni",
    "title": "Republicans fear angry Trump 'could sabotage his party again'"
  },
  {
    "id": 7266,
    "mediaId": 157,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "Sarah K. Burris",
    "title": "How the Republican Party's deal with Trump is leading to chaos in Georgia GOP elections"
  },
  {
    "id": 7309,
    "mediaId": 323,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "Cameron McWhirter",
    "title": "Georgia GOP Primary Elections for Governor and Secretary of State Are Top Contests Today"
  },
  {
    "id": 7456,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "Travis Gettys",
    "title": "Trump threw Georgia GOP into turmoil  and things could get bumpier after the primary: report"
  },
  {
    "id": 7470,
    "mediaId": 178,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Let's take a few hours, lick our wounds, and tomorrow morning, you're going to hear me going to work for <span class='selected-term'>Brian Kemp</span> to make damn sure that Stacey Abrams is never governor of Georgia.\"",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Kemp wins Georgia GOP gov's race in stinging rebuke of Trump"
  },
  {
    "id": 7376,
    "mediaId": 147,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "",
    "author": "Steve Peoples",
    "title": "Brian Kemp wins Georgia GOP governor's race against Trump-backed challenger"
  },
  {
    "id": 7380,
    "mediaId": 178,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Let's take a few hours, lick our wounds, and tomorrow morning, you're going to hear me going to work for <span class='selected-term'>Brian Kemp</span> to make damn sure that Stacey Abrams is never governor of Georgia.\"",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Trump rebuked with stinging losses in Georgia GOP contests"
  }
]