[
  {
    "id": 5139,
    "mediaId": 63,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "",
    "author": "Nicholas Reimann",
    "title": "Trump Reportedly Backing J.D. Vance In Ohio Senate RaceLatest Test Of Dubious Endorsement Power"
  },
  {
    "id": 2068,
    "mediaId": 129,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Trump Endorses J.D. Vance in Republican Primary for Senate in Ohio"
  },
  {
    "id": 5133,
    "mediaId": 129,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Trump Endorses J.D. Vance in Republican Primary for Senate in Ohio"
  },
  {
    "id": 2050,
    "mediaId": 234,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "The paper added, Trump received so many calls that he stopped taking them Friday.?\nIn addition to the GOP primaries in Ohio and Pennsylvania, Trump's image is also on the line in Georgia, where he has endorsed gubernatorial candidate David Perdue, who is trailing incumbent <span class='selected-term'>Brian Kemp</span>.",
    "author": "",
    "title": "Trump's Endorsement of J.D. Vance Worries Advisers Who Fear He's Backing Losers"
  },
  {
    "id": 5091,
    "mediaId": 169,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Many eyes are on Georgia as a microcosm of the \"Mar-a-Lago Machine\" in action, where Trump has waged a particularly ugly crusade against GOP Governor <span class='selected-term'>Brian Kemp</span> and Secretary of State Brad Raffensberger, along with anyone associated with them, endorsing their challengers and insisting that all GOP candidates running for any office sign off on the Big Lie.",
    "author": "Heather Digby Parton",
    "title": "Does Trump still have the juice? His spotty endorsement record suggests decline"
  },
  {
    "id": 5023,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Morning Digest: Federal judges let Ohio GOP run out the clock and use illegal gerrymandered maps"
  },
  {
    "id": 4984,
    "mediaId": 136,
    "date": "4/24/2022 12:00:00 AM",
    "sentence": "The former president has officially endorsed former Senator David Perdue over Governor <span class='selected-term'>Brian Kemp</span> in Georgia and Lieutenant Governor Janice McGeachin over Governor Brad Little in Idaho.",
    "author": "Andrew Stanton",
    "title": "Donald Trump's 'Emotional' Endorsements Will 'Backfire': Chris Christie"
  },
  {
    "id": 1767,
    "mediaId": 136,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "After months of publicly deriding his one-time ally Governor <span class='selected-term'>Brian Kemp</span> for refusing to contest the 2020 presidential election results in Georgia, Trump endorsed former Senator David Perdue.",
    "author": "Jon Jackson",
    "title": "J.D. Vance Wins Ohio Primary in Crucial Test of Trump's Power"
  },
  {
    "id": 1768,
    "mediaId": 63,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "Nicholas Reimann",
    "title": "Ohio Senate Primary: Trump-Backed J.D. Vance Wins GOP Nomination In Crowded Field"
  },
  {
    "id": 1730,
    "mediaId": 238,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Polls indicate that Mr. Trump's campaign against Georgia's incumbent governor, <span class='selected-term'>Brian Kemp</span> (R), is failing.",
    "author": "",
    "title": "Opinion Why J.D. Vance's crude nationalism still might not be the GOP's future"
  },
  {
    "id": 1731,
    "mediaId": 129,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Late last year, the leadership of the Republican Governors Association faced a vexing question: What should the group do about conservative governors, like <span class='selected-term'>Brian Kemp</span> of Georgia, who were facing relentless attacks from Donald Trump?",
    "author": "",
    "title": "Tucker, Thiel and Trump: How J.D. Vance won in Ohio."
  },
  {
    "id": 1732,
    "mediaId": 195,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Dennis Aftergut",
    "title": "J.D. Vance's GOP primary victory in Ohio says little about Trump's endorsement power"
  },
  {
    "id": 3301,
    "mediaId": 238,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "That tells you all you need to know about what you are getting Georgia  just a continuation of bad elections and a real RINO if you vote for <span class='selected-term'>Brian Kemp</span>, Trump wrote on his social network.",
    "author": "Josh Dawsey",
    "title": "More Republicans are working to undermine Trump endorsements"
  },
  {
    "id": 3307,
    "mediaId": 233,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "In a statement announcing the May 23 rally, Pence called Kemp one of the most successful conservative governors in America.?\n\"<span class='selected-term'>Brian Kemp</span> is my friend, a man dedicated to faith, family and the people of Georgia,? Pence said.",
    "author": "Ella Lee",
    "title": "Pence will go toe-to-toe with Trump in Georgia as he announces rally with GOP Gov. Brian Kemp"
  },
  {
    "id": 3382,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "The Ohio and Pennsylvania Republicans were mostly taking their cues from Mr. Trump in their Senate primaries; by contrast, the Georgia Republicans were more inclined to buck Mr. Trump and stick with their incumbent Republican governor, <span class='selected-term'>Brian Kemp</span>, whom the former president is trying to oust in next weeks primary.",
    "author": "",
    "title": "10 Republican Voters in Swing States on Trumps Hold on the Party"
  },
  {
    "id": 4461,
    "mediaId": 195,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Alexis Simendinger",
    "title": "The Hills Morning Report  Recount looms in Pennsylvania"
  }
]