[
  {
    "id": 5139,
    "mediaId": 63,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "",
    "author": "Nicholas Reimann",
    "title": "Trump Reportedly Backing J.D. Vance In Ohio Senate RaceLatest Test Of Dubious Endorsement Power",
    "sentiment": "0.0"
  },
  {
    "id": 5133,
    "mediaId": 129,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Trump Endorses J.D. Vance in Republican Primary for Senate in Ohio",
    "sentiment": "0.0"
  },
  {
    "id": 5091,
    "mediaId": 169,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Many eyes are on Georgia as a microcosm of the \"Mar-a-Lago Machine\" in action, where Trump has waged a particularly ugly crusade against GOP Governor <span class='selected-term'>Brian Kemp</span> and Secretary of State Brad Raffensberger, along with anyone associated with them, endorsing their challengers and insisting that all GOP candidates running for any office sign off on the Big Lie.",
    "author": "Heather Digby Parton",
    "title": "Does Trump still have the juice? His spotty endorsement record suggests decline",
    "sentiment": "0.0"
  },
  {
    "id": 5034,
    "mediaId": 157,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "NOW WATCH: Trump rages against <span class='selected-term'>Brian Kemp</span> for purportedly conspiring against Marjorie Taylor Greene\nStories Chosen For You",
    "author": "Brad Reed",
    "title": "Trump sent profane text message to Club for Growth after it continued bashing candidate he endorsed: Maggie Haberman",
    "sentiment": "0.0"
  },
  {
    "id": 5023,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Morning Digest: Federal judges let Ohio GOP run out the clock and use illegal gerrymandered maps",
    "sentiment": "0.0"
  },
  {
    "id": 4984,
    "mediaId": 136,
    "date": "4/24/2022 12:00:00 AM",
    "sentence": "The former president has officially endorsed former Senator David Perdue over Governor <span class='selected-term'>Brian Kemp</span> in Georgia and Lieutenant Governor Janice McGeachin over Governor Brad Little in Idaho.",
    "author": "Andrew Stanton",
    "title": "Donald Trump's 'Emotional' Endorsements Will 'Backfire': Chris Christie",
    "sentiment": "0.0"
  },
  {
    "id": 5844,
    "mediaId": 239,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "Susan Ferrechio",
    "title": "Trumps endorsement winning streak headed for tougher tests in Pennsylvania, Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 3301,
    "mediaId": 238,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "That tells you all you need to know about what you are getting Georgia  just a continuation of bad elections and a real RINO if you vote for <span class='selected-term'>Brian Kemp</span>, Trump wrote on his social network.",
    "author": "Josh Dawsey",
    "title": "More Republicans are working to undermine Trump endorsements",
    "sentiment": "0.0"
  },
  {
    "id": 3307,
    "mediaId": 233,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "In a statement announcing the May 23 rally, Pence called Kemp one of the most successful conservative governors in America.?\n\"<span class='selected-term'>Brian Kemp</span> is my friend, a man dedicated to faith, family and the people of Georgia,? Pence said.",
    "author": "Ella Lee",
    "title": "Pence will go toe-to-toe with Trump in Georgia as he announces rally with GOP Gov. Brian Kemp",
    "sentiment": "0.0"
  },
  {
    "id": 3382,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "The Ohio and Pennsylvania Republicans were mostly taking their cues from Mr. Trump in their Senate primaries; by contrast, the Georgia Republicans were more inclined to buck Mr. Trump and stick with their incumbent Republican governor, <span class='selected-term'>Brian Kemp</span>, whom the former president is trying to oust in next weeks primary.",
    "author": "",
    "title": "10 Republican Voters in Swing States on Trumps Hold on the Party",
    "sentiment": "0.0"
  },
  {
    "id": 4461,
    "mediaId": 195,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Alexis Simendinger",
    "title": "The Hills Morning Report  Recount looms in Pennsylvania",
    "sentiment": "0.0"
  },
  {
    "id": 6583,
    "mediaId": 195,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Brad Bannon",
    "title": "Party primaries test power of Trumps backing and progressive platform",
    "sentiment": "0.0"
  },
  {
    "id": 6605,
    "mediaId": 33,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Gabby Orr",
    "title": "Trump may hold off on more endorsements for coming primaries, advisers say",
    "sentiment": "0.0"
  },
  {
    "id": 6608,
    "mediaId": 234,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Trump has been desperately trying to lift David Perdue, his preferred candidate in Georgias governor race, over incumbent <span class='selected-term'>Brian Kemp</span>a right-wing governor who provoked his ire by not doing more to overturn Joe Bidens 2020 election win.",
    "author": "Eric Lutz",
    "title": "Donald Trumps Georgia Revenge Fantasy Isnt Quite Panning Out",
    "sentiment": "0.0"
  },
  {
    "id": 6538,
    "mediaId": 195,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Niall Stanage",
    "title": "The Memo: Trump faces critical popularity test in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 6575,
    "mediaId": 129,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Its not sufficient  David Perdue, a former senator, looks like hes going to lose to the incumbent governor of Georgia, <span class='selected-term'>Brian Kemp</span>, in next weeks primary, despite his support for the big lie?  but it makes a difference.",
    "author": "",
    "title": "Its Trumps Party, and Hell Lie if He Wants To",
    "sentiment": "0.0"
  },
  {
    "id": 7106,
    "mediaId": 129,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "In the Georgia primary for governor, a Trump surrogate, Sonny Purdue, is polling well behind Mr. Trumps nemesis, the incumbent <span class='selected-term'>Brian Kemp</span>.",
    "author": "",
    "title": "Democrats, the Midterm Jinx Is Not Inevitable",
    "sentiment": "0.0"
  },
  {
    "id": 7194,
    "mediaId": 136,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "As Tuesday's primary elections approach in Georgia, Trump appears poised to be delivered a major proxy defeat in the Republican Party's gubernatorial primary, where he endorsed former Senator David Perdue against incumbent GOP Governor <span class='selected-term'>Brian Kemp</span>.",
    "author": "Andrew Stanton",
    "title": "Trump Endorsement More 'Matchbox Car' Than 'Freight Train': Geoff Duncan",
    "sentiment": "0.0"
  },
  {
    "id": 7198,
    "mediaId": 323,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "Cameron McWhirter",
    "title": "Georgia Governor Race Is a Test for Trump. It Isn't Going Well.",
    "sentiment": "0.0"
  },
  {
    "id": 7224,
    "mediaId": 129,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "But to many Georgia Republicans, he is one of us.\nTHOMASTON, Ga. <span class='selected-term'>Brian Kemp</span>, Georgias incumbent governor and a prominent fixture on former President Donald J. Trumps enemies list, was clip-clopping around in a pair of cowboy boots in this small city on a recent morning, glad-handing his way through an adoring Republican throng at a place called Greatest Generation Memorial Park.",
    "author": "",
    "title": "What Donald Trump Didnt Count On in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7326,
    "mediaId": 1546,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trump is trying to defeat two Georgia officials: Governor <span class='selected-term'>Brian Kemp</span> and Secretary of State Brad Raffensperger.",
    "author": "Ken Bredemeier",
    "title": "Trump's Election Fraud Claims Face a Test in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7329,
    "mediaId": 33,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "You're going to have a lot of very strong Trump supporters who are going to vote for <span class='selected-term'>Brian Kemp</span>, said Martha Zoller, a talk radio host in Georgia who previously worked for both Perdue and Kemp.",
    "author": "Eric Bradner",
    "title": "Republicans look to Georgia for a path beyond Trump's 2020 grievances",
    "sentiment": "0.0"
  },
  {
    "id": 7482,
    "mediaId": 195,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "",
    "author": "Niall Stanage",
    "title": "The Memo: Trump no longer holds MAGA movement in his palm",
    "sentiment": "0.0"
  },
  {
    "id": 7309,
    "mediaId": 323,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "Cameron McWhirter",
    "title": "Georgia GOP Primary Elections for Governor and Secretary of State Are Top Contests Today",
    "sentiment": "0.0"
  },
  {
    "id": 7349,
    "mediaId": 32,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kevin Breuninger",
    "title": "Georgia's primary elections on Tuesday are pivotal. Here's what to watch",
    "sentiment": "0.0"
  },
  {
    "id": 7350,
    "mediaId": 129,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Here is what else is going on:\nOn Monday, Trump and Mike Pence, his former vice president, held dueling events for their respective candidates in the Republican primary for governor: David Perdue, a former senator and Dollar General executive who entered the race at Trump's insistence, and <span class='selected-term'>Brian Kemp</span>, the incumbent.",
    "author": "",
    "title": "Live Updates: What to Watch For in Today's Elections in Georgia and Beyond",
    "sentiment": "0.0"
  },
  {
    "id": 7412,
    "mediaId": 233,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump declined to discuss the probability that David Perdue will lose the Georgia gubernatorial primary to incumbent Republican <span class='selected-term'>Brian Kemp</span>, preferring to discuss his more successful candidates during an interview Tuesday with Fox Business Network.",
    "author": "David Jackson",
    "title": "Stacey Abrams wins gov primary; GA polls close; primaries also in Alabama, Ark., Texas: live updates",
    "sentiment": "0.0"
  },
  {
    "id": 7331,
    "mediaId": 238,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "",
    "author": "David Weigel",
    "title": "Kemp, Raffensperger win in blow to Trump and his false election claims",
    "sentiment": "0.0"
  },
  {
    "id": 8357,
    "mediaId": 129,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Primary Elections Live Updates: Voters Reject Trump Endorsed Candidates in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 8473,
    "mediaId": 157,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "Travis Gettys",
    "title": "Republicans talk trash about Trump as endorsements flop",
    "sentiment": "0.0"
  },
  {
    "id": 8571,
    "mediaId": 151,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "'Trump picked this fight': Why heavyweight Republicans no longer fear Trump",
    "sentiment": "0.0"
  },
  {
    "id": 8503,
    "mediaId": 147,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "I mean, his  David  yes, David Perdue got stomped by more than 50 points by <span class='selected-term'>Brian Kemp</span>, someone who Trump was desperate to knock out.",
    "author": "",
    "title": "Brooks and Capehart on the tragedy in Uvalde and Georgias primary elections",
    "sentiment": "0.0"
  },
  {
    "id": 8504,
    "mediaId": 151,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Inside the Forecast: Trumps endorsement record, explained",
    "sentiment": "0.0"
  },
  {
    "id": 8509,
    "mediaId": 238,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "",
    "author": "Felicia Sonmez",
    "title": "Post Politics Now Biden to address Naval Academy graduates; Trump to speak at NRA convention",
    "sentiment": "0.0"
  },
  {
    "id": 8461,
    "mediaId": 129,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "Governor's Race: <span class='selected-term'>Brian Kemp</span> scored a landslide victory over David Perdue, delivering Mr. Trump his biggest setback of the 2022 primaries.",
    "author": "",
    "title": "Trump's Primary Losses Puncture His Invincibility",
    "sentiment": "0.0"
  }
]