[
  {
    "id": 2198,
    "mediaId": 19,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "It's RINO <span class='selected-term'>Brian Kemp</span>,? a recent Perdue ad says.",
    "author": "Ashley Oliver",
    "title": "George Soros Company': Electric Vehicle Plant Deal Emerges as Flashpoint in Georgia Governor's Race"
  },
  {
    "id": 2047,
    "mediaId": 195,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "In George, incumbent governor <span class='selected-term'>Brian Kemp</span>, whom Trump blames for his loss in 2020, has withstood Trump's attacks and leads handily in recent polls.",
    "author": "Keith Naughton",
    "title": "For Easter, Trump plays Judas"
  },
  {
    "id": 2,
    "mediaId": 163,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "* Versus Georgia Governor <span class='selected-term'>Brian Kemp</span>\n* May 24 Republican primary\nIn 2021, Perdue conceded that he lost his U.S. Senate to Democrat Jon Ossoff, but in March 2022 reversed himself, voicing false claims that the election was stolen, although the evidence of fraud that he cited was part of a case that was ultimately dismissed by a judge.",
    "author": "Reuters",
    "title": "Factbox: Trump's endorsement power faces test in key elections"
  },
  {
    "id": 1842,
    "mediaId": 65,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Lindenbaum's name appears as the third signature on the original complaint in the lawsuit alleging voter suppression in the race that saw then-Republican Secretary of State <span class='selected-term'>Brian Kemp</span> defeat Abrams by 55,000 votes statewide in the governor's race.",
    "author": "",
    "title": "Biden FEC pick claimed Georgia voting machines 'switched' votes from Abrams to Kemp in 2018"
  },
  {
    "id": 1844,
    "mediaId": 163,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "But Oz trails rival David McCormick ahead of the May 17 Pennsylvania primary and former Senator David Perdue lags Georgia Governor <span class='selected-term'>Brian Kemp</span> heading into their May 24 matchup.",
    "author": "Jarrett Renshaw",
    "title": "Trump faces biggest test of his 'king-maker' clout since leaving White House"
  },
  {
    "id": 1741,
    "mediaId": 43,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 5/5"
  },
  {
    "id": 1727,
    "mediaId": 129,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "And Georgia's current governor, <span class='selected-term'>Brian Kemp</span>, is being pushed further to the right on the issue by his primary challenger, David Perdue, the Trump-backed former senator.",
    "author": "",
    "title": "Abortion is already starting to reshape these notable midterm campaigns."
  },
  {
    "id": 3201,
    "mediaId": 65,
    "date": "5/8/2022 12:00:00 AM",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "2022/2024 Watch: Cruz heading to Pennsylvania to campaign with McCormick days after Trump rally for Oz"
  }
]