[
  {
    "id": 1389,
    "mediaId": 238,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "If 20-year career politician <span class='selected-term'>Brian Kemp</span> spent half as much time protecting Georgia's elections as he does scheming to hold on to his office, we wouldn't be in this mess.?\nIn a statement, Kemp's campaign spokesman, Cody Hall, said: It's no surprise that David Perdue and Stacey Abrams are joining forces to maintain the blatantly unfair status quo and continue raising money for their campaigns when the Governor is prohibited by law from doing so, solely because he is the incumbent during a legislative session.",
    "author": "",
    "title": "Stacey Abrams, David Perdue call foul on GOP proposal to ban fundraising while Georgia legislature is in session"
  },
  {
    "id": 1380,
    "mediaId": 129,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "The Republican Governors Association, which Mr. Ducey leads, this week began pushing back, airing a television commercial defending the Georgia governor, <span class='selected-term'>Brian Kemp</span>, against his opponent, former Senator David Perdue.",
    "author": "",
    "title": "Inside McConnell's Campaign to Take Back the Senate and Thwart Trump"
  },
  {
    "id": 1969,
    "mediaId": 195,
    "date": "4/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "Caroline Vakil",
    "title": "Trump stumps for Vance while acknowledging he said some bad sh about me'"
  },
  {
    "id": 135,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "\"John King is the insurance commissioner and Georgia's first statewide Hispanic officeholder, and his sole crime is having been appointed by <span class='selected-term'>Brian Kemp</span>, so Trump endorsed a candidate for insurance commissioner who is basically saying that he will not allow the insurance industry to become 'woke,' whatever the hell that means,\" says Bill Crane, a longtime Georgia political observer.",
    "author": "Steve Friess",
    "title": "GOP Races Dominated by MAGA CandidatesWhether Trump Has Backed Them or Not"
  },
  {
    "id": 1903,
    "mediaId": 195,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "",
    "author": "Max Greenwood",
    "title": "Seven key primary races to watch in May"
  }
]