[
  {
    "id": 395,
    "mediaId": 12,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "Tia Mitchell",
    "title": "The Jolt: David Perdue targets Gov. Brian Kemp's prized Rivian deal"
  },
  {
    "id": 195,
    "mediaId": 157,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Timothy Evans",
    "title": "Trump finally opens his war chest as he struggles to take down GOP governor Brian Kemp in Georgia"
  },
  {
    "id": 198,
    "mediaId": 19,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Trump's First Major Midterm Donation Aims to Unseat Brian Kemp in Georgia"
  },
  {
    "id": 104,
    "mediaId": 239,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "Haris Alic",
    "title": "George W. Bush to headline $5K-a-head fundraiser for Trump foe Brian Kemp"
  },
  {
    "id": 3301,
    "mediaId": 238,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "That tells you all you need to know about what you are getting Georgia  just a continuation of bad elections and a real RINO if you vote for <span class='selected-term'>Brian Kemp</span>, Trump wrote on his social network.",
    "author": "Josh Dawsey",
    "title": "More Republicans are working to undermine Trump endorsements"
  },
  {
    "id": 3379,
    "mediaId": 136,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "But Pence, who has increasingly shown a willingness to buck his relationship with Trump in the past several months, is now throwing his weight behind Georgia's incumbent Republican Governor <span class='selected-term'>Brian Kemp</span>.",
    "author": "Jason Lemon",
    "title": "Trump Heads to Texas Rally as Allies Face Subpoenas, Pence Clash Ramps Up"
  },
  {
    "id": 3366,
    "mediaId": 136,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Former President George W. Bush is reported to be attending a fundraiser in support of Georgia governor <span class='selected-term'>Brian Kemp</span> in another example of recent and longtime enemies of Donald Trump publicly rallying against the MAGA president's endorsed candidate, David Perdue.",
    "author": "Ewan Palmer",
    "title": "Donald Trump's Enemies Flock to Brian Kemp in Bid to Thwart MAGA Surge"
  },
  {
    "id": 3375,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Senate primaries to watch"
  },
  {
    "id": 6520,
    "mediaId": 238,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "",
    "author": "Aaron Blake",
    "title": "The top 10 GOP presidential candidates for 2024, ranked"
  },
  {
    "id": 7186,
    "mediaId": 25,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Brian Kemp</span> facing a challenge from the former senator, David Purdue, who was put up to the race by Mr. Trump.",
    "author": "",
    "title": "Full transcript of \"Face the Nation\" on May 22, 2022"
  },
  {
    "id": 7288,
    "mediaId": 136,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "The former president has also leveled some of his harshest personal attacks on the state's two Republican officials  Governor <span class='selected-term'>Brian Kemp</span> and Secretary of State Brad Raffensperger  who blocked his attempt to claim a victory over President Joe Biden in the state.",
    "author": "Daniel Bush",
    "title": "Georgia Primaries Will Test Trump's Revenge Campaign Against GOP Incumbents"
  },
  {
    "id": 7289,
    "mediaId": 129,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Under the once-in-a-decade redistricting process, Georgia's Republican governor, <span class='selected-term'>Brian Kemp</span>, signed into law a new map that transformed Ms. McBath's district to favor Republicans overwhelmingly.",
    "author": "",
    "title": "Democrats are mindful of headwinds in Georgia, and everywhere else."
  },
  {
    "id": 7290,
    "mediaId": 238,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "The latest example is Pence's decision to campaign Monday night in Georgia with the state's incumbent GOP governor, <span class='selected-term'>Brian Kemp</span>, who faces a primary challenge Tuesday from former U.S. senator David Perdue.",
    "author": "Mariana Alfaro",
    "title": "On our radar: Pence appearing in Ga. as part of pushback against Trump-backed candidates for governor"
  },
  {
    "id": 7291,
    "mediaId": 558,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Cheney and Pence take the fight to Trump, from Georgia to Wyoming"
  },
  {
    "id": 7294,
    "mediaId": 129,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The Depp-Heard Trial Isn't Even the Weirdest Thing About America Right Now"
  }
]