[
  {
    "id": 1005,
    "mediaId": 43,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "GOP primary for Wisconsin governor"
  },
  {
    "id": 1200,
    "mediaId": 19,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver and Matthew Boyle",
    "title": "Analysis: Senate Majority May Come Down to 11 Battleground Races"
  },
  {
    "id": 1167,
    "mediaId": 124,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The Alabama Senate race is becoming a headache for Trump  again"
  },
  {
    "id": 1113,
    "mediaId": 124,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Trump's influence on GOP in question ahead of Georgia rally"
  },
  {
    "id": 1122,
    "mediaId": 43,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "The spot begins with the GOP master bellowing, <span class='selected-term'>Brian Kemp</span> is a turncoat, he's a coward, he's a complete and total disaster.? As the crowd repeatedly boos, Trump tells his followers that the governor was bullied into a consent decree engineered by Stacey Abrams and allowed massive voter fraud to occur throughout the state of Georgia.? The only mention of Perdue in the spot comes afterwards as Trump proclaims that he'll never surrender to Stacey Abrams and the militant radical left, and with your vote we're going to rescue the state of Georgia from the RINOs.?\nMeanwhile, Perdue's allies at Georgia Action Fund are spending another $955,000 on TV advertising for him, which AdImpact says takes the group's total to $1.64 million.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 3/29"
  },
  {
    "id": 1045,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "? GA-Gov: Former Sen. David Perdue is continuing his all-Trump all-the-time advertising strategy for the May GOP primary with a new commercial that uses footage of Trump bashing both incumbent <span class='selected-term'>Brian Kemp</span> and Democrat Stacey Abrams at his Saturday rally.",
    "author": "",
    "title": "Morning Digest: Tennessee GOP's bill would block Trump's pick, but they'll need courts to agree"
  },
  {
    "id": 2342,
    "mediaId": 43,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "And as for Stacy Abrams, it's part of that depends on who she's going to face in the TOP primary between Governor <span class='selected-term'>Brian Kemp</span> and former Senator David Perdue.",
    "author": "",
    "title": "The Downballot: We open our mailbag and answer your questions! (transcript)"
  },
  {
    "id": 2334,
    "mediaId": 43,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Morning Digest: Jeff Merkley slams top super PAC's spending in House primary as"
  },
  {
    "id": 134,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "MAY 24\nStates holding primaries: Alabama, Arkansas, Georgia\nKey race to watch: Trump is out for revenge in Georgia, where he's backed several candidates for state offices in an effort to oust GOP incumbents (including Governor <span class='selected-term'>Brian Kemp</span>) who refused to help him undo Biden's 2020 win.",
    "author": "Steve Friess",
    "title": "These Are Key Races to Watch In Every State Primary This Election Season"
  },
  {
    "id": 868,
    "mediaId": 129,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Ready for the Midterm Primary Elections? Here's What to Know."
  },
  {
    "id": 869,
    "mediaId": 129,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Ready for the Midterm Primary Elections? Here's What to Know."
  }
]