[
  {
    "id": 5061,
    "mediaId": 223,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The Strike Force includes Governors Kay Ivey (AL), Mike Dunleavy (AK), Asa Hutchinson (AR), Ron DeSantis (FL), <span class='selected-term'>Brian Kemp</span> (GA), Brad Little (ID), Eric Holcomb (IN), Kim Reynolds (IA), Larry Hogan (MD), Tate Reeves (MS), Mike Parson (MO), Greg Gianforte (MT), Pete Ricketts (NE), Chris Sununu (NH), Doug Burgum (ND), Mike DeWine (OH), Kevin Stitt (OK), Henry McMaster (SC), Kristi Noem (SD), Bill Lee (TN), Spencer Cox (UT), Glenn Youngkin (VA), Jim Justice (WV), and Mark Gordon (WY).",
    "author": "Spencer Brown",
    "title": "GOP Governors Launch 'Strike Force' to Combat Biden Border Crisis",
    "sentiment": "0"
  },
  {
    "id": 5066,
    "mediaId": 19,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The pact is signed by the following governors:\nGovernors Doug Ducey (AZ), Greg Abbott (TX), Kay Ivey (AL), Mike Dunleavy (AK), Asa Hutchinson (AR), Ron DeSantis (FL), <span class='selected-term'>Brian Kemp</span> (GA), Brad Little (ID), Eric Holcomb (IN), Kim Reynolds (IA), Larry Hogan (MD), Tate Reeves (MS), Mike Parson (MO), Greg Gianforte (MT), Pete Ricketts (NE), Chris Sununu (NH), Doug Burgum (ND), Mike DeWine (OH), Kevin Stitt (OK), Henry McMaster (SC), Kristi Noem (SD), Bill Lee (TN), Spencer Cox (UT), Glenn Youngkin (VA), Jim Justice (WV), and Mark Gordon (WY).",
    "author": "Bob Price",
    "title": "26 Governors Mobilize Against Migration Chaos at Border",
    "sentiment": "0"
  },
  {
    "id": 3157,
    "mediaId": 136,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump has blasted Republican Georgia Governor <span class='selected-term'>Brian Kemp</span> as a \"real RINO\" as Kemp's campaign continues against Trump-backed GOP primary challenger David Perdue.",
    "author": "Aila Slisco",
    "title": "Donald Trump Launches Fresh Attack on 'Real RINO' Georgia Gov Brian Kemp",
    "sentiment": "0"
  },
  {
    "id": 3301,
    "mediaId": 238,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "That tells you all you need to know about what you are getting Georgia  just a continuation of bad elections and a real RINO if you vote for <span class='selected-term'>Brian Kemp</span>, Trump wrote on his social network.",
    "author": "Josh Dawsey",
    "title": "More Republicans are working to undermine Trump endorsements",
    "sentiment": "0"
  },
  {
    "id": 3306,
    "mediaId": 21,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Grace Panetta",
    "title": "Mike Pence and other Republicans Trump has attacked are circling the wagons to campaign against his pick for Georgia governor",
    "sentiment": "-0.865"
  },
  {
    "id": 3307,
    "mediaId": 233,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "In a statement announcing the May 23 rally, Pence called Kemp one of the most successful conservative governors in America.?\n\"<span class='selected-term'>Brian Kemp</span> is my friend, a man dedicated to faith, family and the people of Georgia,? Pence said.",
    "author": "Ella Lee",
    "title": "Pence will go toe-to-toe with Trump in Georgia as he announces rally with GOP Gov. Brian Kemp",
    "sentiment": "0.238"
  },
  {
    "id": 4519,
    "mediaId": 169,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "RELATED: Georgia GOP outraged Trump turned against <span class='selected-term'>Brian Kemp</span>: 'I am just so mad  beyond words\"\nBack in March, the president held a tele-rally in support of Perdue, lining the candidate's campaign coffer with half a million dollars.",
    "author": "Jon Skolnik",
    "title": "Mike Pence and top Republicans flock to Georgia to defeat Trump's candidate in key primary",
    "sentiment": "0"
  },
  {
    "id": 7087,
    "mediaId": 65,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Why Trump's full court press in Georgia hasn't helped Perdue's bid to oust Kemp",
    "sentiment": "-0.559"
  },
  {
    "id": 7531,
    "mediaId": 1576,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "I support many of President Trumps policies, and I know <span class='selected-term'>Brian Kemp</span> does, Ricketts said.",
    "author": "",
    "title": "Kemp and Walker look to victory in Georgia as primaries near",
    "sentiment": "0.208"
  },
  {
    "id": 7212,
    "mediaId": 195,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "I support many of President Trumps policies, and I know <span class='selected-term'>Brian Kemp</span> does,? Ricketts told The Associated Press.",
    "author": "Alexis Simendinger",
    "title": "The Hills Morning Report  Biden: US economy has problems; vows Taiwan defense",
    "sentiment": "0.217"
  },
  {
    "id": 7329,
    "mediaId": 33,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "You're going to have a lot of very strong Trump supporters who are going to vote for <span class='selected-term'>Brian Kemp</span>, said Martha Zoller, a talk radio host in Georgia who previously worked for both Perdue and Kemp.",
    "author": "Eric Bradner",
    "title": "Republicans look to Georgia for a path beyond Trump's 2020 grievances",
    "sentiment": "0"
  },
  {
    "id": 7357,
    "mediaId": 151,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "If there is any cosmic political karma, <span class='selected-term'>Brian Kemp</span> deserves every bit of it, said John Watson, a former chair of the Georgia Republican Party, said, This is the payback of all paybacks.",
    "author": "",
    "title": "Trump flops in Georgia: 5 takeaways from a big primary night",
    "sentiment": "-0.208"
  },
  {
    "id": 8441,
    "mediaId": 129,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "Governor's Race: <span class='selected-term'>Brian Kemp</span> scored a landslide victory over David Perdue, delivering Mr. Trump his biggest setback of the 2022 primaries.",
    "author": "",
    "title": "Republican Governors Lose Their Dread of Trump",
    "sentiment": "0.206"
  },
  {
    "id": 8490,
    "mediaId": 195,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "Max Greenwood",
    "title": "Republicans grow more aggressive in openly defying Trump",
    "sentiment": "-0.475"
  }
]