[
  {
    "id": 1569,
    "mediaId": 43,
    "date": "1/23/2022 12:00:00 AM",
    "sentence": "His pick of Hershel Walker and his feud with <span class='selected-term'>Brian Kemp</span> will likely cost him Georgia again this year, at least.",
    "author": "",
    "title": "Why Ann Coulter is 100% right about Trump being finished..."
  },
  {
    "id": 2058,
    "mediaId": 136,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "In Georgia, Trump is looking to settle a personal vendetta against Republican Governor <span class='selected-term'>Brian Kemp</span>, who declined to work with Trump in his effort to overturn President Joe Biden's narrow victory in the state.",
    "author": "Jason Lemon",
    "title": "Trump-Backed Candidates Face Increased Attacks From GOP as Primaries Loom"
  },
  {
    "id": 2052,
    "mediaId": 136,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "Similar pushback to Trump-backed candidates has played out in Tennessee, where GOP lawmakers pushed through legislation in a bid to keep one of his endorsees off the ballot, as well as in Georgia, where Trump has a vendetta against incumbent Republican Governor <span class='selected-term'>Brian Kemp</span> because he declined to help overturn President Joe Biden's 2020 election win in the southern state.",
    "author": "Jason Lemon",
    "title": "Ex-Trump Admin Official Knocks His 'Dumb Endorsements' in GOP Primaries"
  },
  {
    "id": 186,
    "mediaId": 129,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Mar-a-Lago Machine: Trump as a Modern-Day Party Boss"
  },
  {
    "id": 2048,
    "mediaId": 195,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "",
    "author": "Reid Wilson",
    "title": "Republican governors sprint right, eyeing re-election and 2024"
  },
  {
    "id": 1919,
    "mediaId": 238,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Post Politics Now Biden issues first pardons, commutations of his presidency"
  }
]