[
  {
    "id": 1678,
    "mediaId": 1164,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Clyde Hughes",
    "title": "In divisive primary fight, Georgia Gov. Brian Kemp wants to expand gun rights"
  },
  {
    "id": 1680,
    "mediaId": 19,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "I'm glad <span class='selected-term'>Brian Kemp</span> is answering my call for constitutional carry in Georgia.",
    "author": "Ashley Oliver",
    "title": "Brian Kemp Plans to Ease Gun Laws in Georgia: Carry Permit' Should Be the Founding Document of Our Nation'"
  },
  {
    "id": 1527,
    "mediaId": 65,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kyle Morris",
    "title": "Stacey Abrams trails Brian Kemp, David Perdue for Georgia governor, new poll shows"
  },
  {
    "id": 1508,
    "mediaId": 19,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "The Democrats walked all over <span class='selected-term'>Brian Kemp</span>.",
    "author": "Ashley Oliver",
    "title": "Exclusive  Donald Trump Delivers Message to Georgia in First David Perdue Ad: Brian Kemp Let Us Down'"
  },
  {
    "id": 1452,
    "mediaId": 237,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "The best shot they had of beating <span class='selected-term'>Brian Kemp</span> was to get him into a runoff.?\nStacey Abrams, who lost to Kemp narrowly in 2018, is running again this year and is considered the putative Democratic nominee.",
    "author": "David M. Drucker",
    "title": "David Perdue gets clear shot at Georgia Gov. Brian Kemp with Vernon Jones primary exit"
  },
  {
    "id": 1462,
    "mediaId": 19,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "What is even worse is that this is a classroom in <span class='selected-term'>Brian Kemp</span>'s Georgia, not New York or California.",
    "author": "Matthew Boyle",
    "title": "Exclusive David Perdue Slams Stacey Abrams and Brian Kemp in Unmask Our Kids' Ad"
  },
  {
    "id": 1322,
    "mediaId": 169,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "Democrat Stacey Abrams and former Republican U.S. Sen. David Perdue found themselves in an unlikely alliance last week after Georgia's Republican governor, <span class='selected-term'>Brian Kemp</span>, backed a rule change that could benefit his election chances  and not for the first time.",
    "author": "Igor Derysh",
    "title": "Stacey Abrams, David Perdue in unlikely alliance after Brian Kemp changes election rules again"
  },
  {
    "id": 1175,
    "mediaId": 237,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "Just In...\nFew politicians have drawn as much ire from opposite corners of the political spectrum as <span class='selected-term'>Brian Kemp</span>, the forever embattled Georgia governor seeking a second term in office this year.",
    "author": "Haisten Willis",
    "title": "The many trials of Brian Kemp"
  },
  {
    "id": 1089,
    "mediaId": 19,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Right here in your state, we are going to throw out your spineless RINO Governor <span class='selected-term'>Brian Kemp</span>, and we are going to replace him with a fearless America First patriot in David Perdue,? Trump plans to say.",
    "author": "Ashley Oliver",
    "title": "Exclusive  Trump at Georgia Rally: A Vote for RINO Brian Kemp' Is a Vote for Stacey Abrams'"
  },
  {
    "id": 5446,
    "mediaId": 223,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "American democracy is under attack right now  perhaps nowhere more so than in Georgia, where Governor <span class='selected-term'>Brian Kemp</span> is doing everything he can to make it harder for Georgians to vote  especially people of color.",
    "author": "Derek Hunter",
    "title": "Stacey Abrams Is Displeased"
  },
  {
    "id": 5406,
    "mediaId": 237,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "Andrew Kerr",
    "title": "Stacey Abrams dark money group hauled in $62 million following 2018 election loss"
  },
  {
    "id": 5413,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "In the last year, weve seen coordinated attacks on the legitimacy of our government, and meanwhile, Republicans all over the country  including <span class='selected-term'>Brian Kemp</span> and David Perdue  are abandoning any concern for our future.",
    "author": "",
    "title": "Hillary Clinton Is Back & She's Ready To Help Stacey Abrams (D) Become Governor"
  },
  {
    "id": 5392,
    "mediaId": 238,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion: Trumps lies are failing in Georgia. Thats good news for all of us."
  },
  {
    "id": 5364,
    "mediaId": 65,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Georgia set to become 25th state with 'constitutional carry' law in major win for gun-rights activists"
  },
  {
    "id": 5346,
    "mediaId": 223,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Rebecca Downs",
    "title": "More Big Tech Censorship: RNC Video of Interview with Donald Trump Removed from YouTube"
  },
  {
    "id": 5304,
    "mediaId": 65,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Then-gubernatorial candidate <span class='selected-term'>Brian Kemp</span> criticized Abrams in 2018 for owing $54,000 to the IRS.",
    "author": "Julia Musto",
    "title": "Stacey Abrams now a millionaire as she aims to take governor's office"
  },
  {
    "id": 5326,
    "mediaId": 1576,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "The leading Republicans seeking the nomination for governor  incumbent <span class='selected-term'>Brian Kemp</span> and challenger David Perdue  are far wealthier than she is.",
    "author": "",
    "title": "Stacey Abrams reaches millionaire status before 2nd campaign"
  },
  {
    "id": 5328,
    "mediaId": 25,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "The leading Republicans seeking the nomination for governor  incumbent <span class='selected-term'>Brian Kemp</span> and challenger David Perdue  are far wealthier than she is.",
    "author": "",
    "title": "Stacey Abrams' net worth over $3 million as she launches second bid for Georgia governor"
  },
  {
    "id": 5257,
    "mediaId": 43,
    "date": "4/8/2022 12:00:00 AM",
    "sentence": "According to AJC, prior to the 2018 election, nearly 47,000 voter registrations were put in pending status, about 70% of which were from Black residents.?\nThe suit was filed in 2018 by Stacey Abrams group Fair Fight Action after she lost her gubernatorial race to Republican <span class='selected-term'>Brian Kemp</span>.",
    "author": "Rebekah Sager",
    "title": "Georgia voting rights suit heads to trial as midterms heat up in the state"
  },
  {
    "id": 5234,
    "mediaId": 65,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Ron DeSantis says if Stacey Abrams wins election it will create a Florida-Georgia 'cold war'"
  },
  {
    "id": 5235,
    "mediaId": 65,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Ron DeSantis says if Stacey Abrams wins election it will create a Florida-Georgia 'cold war'"
  },
  {
    "id": 5236,
    "mediaId": 21,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Getahun",
    "title": "DeSantis says 'Cold War' could ensue between Florida and Georgia if Stacey Abrams wins governor race"
  },
  {
    "id": 2119,
    "mediaId": 25,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "Georgia Governor <span class='selected-term'>Brian Kemp</span> on Tuesday signed a law allowing residents to carry handguns in public without a license or background check.",
    "author": "Adam Brewster",
    "title": "Georgia Governor Brian Kemp signs bill allowing guns to be carried without license"
  },
  {
    "id": 6501,
    "mediaId": 43,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/12"
  },
  {
    "id": 198,
    "mediaId": 19,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Trump's First Major Midterm Donation Aims to Unseat Brian Kemp in Georgia"
  },
  {
    "id": 2109,
    "mediaId": 19,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Brian Kemp Has Wide Lead over David Perdue in Governor's Primary"
  },
  {
    "id": 2091,
    "mediaId": 43,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Trump's going all in to trash frontrunner Brian Kemp in Georgia's GOP gubernatorial primary"
  },
  {
    "id": 5153,
    "mediaId": 1576,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "So weve got  years of people calling into question elections any time theyre close.?\nMore than a week after voting ended in Georgia in 2018, Abrams gave a carefully worded speech in which she accused her opponent, then-Secretary of State <span class='selected-term'>Brian Kemp</span>, of voter suppression, while also acknowledging he would be certified the victor of the election.",
    "author": "",
    "title": "After 2020, a candidate conceding an election is no longer a sure thing"
  },
  {
    "id": 5157,
    "mediaId": 43,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "",
    "author": "Rebekah Sager",
    "title": "Georgia governor signs bill protecting farms from suits filed by neighbors, environmental groups"
  },
  {
    "id": 5014,
    "mediaId": 21,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "\"The Governor of Georgia, <span class='selected-term'>Brian Kemp</span>, and Secretary of State, Brad Raffensperger, perhaps in collusion with the Radical Left Democrats, have allowed a horrible thing to happen to a very popular Republican, Congresswoman Marjorie Taylor Greene,\" Trump wrote.",
    "author": "Cheryl Teh",
    "title": "Trump has accused Georgia's GOP leaders of colluding with 'radical left Democrats' to unseat Marjorie Taylor Greene"
  },
  {
    "id": 1921,
    "mediaId": 136,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "\"Initially David Perdue opened a fairly strong favorite but the market may have placed an over emphasis on Trump's endorsement at first, in turn underestimating the chances of <span class='selected-term'>Brian Kemp</span>,\" Ladbrokes spokesperson Alex Apati told Newsweek.",
    "author": "Khaleda Rahman",
    "title": "David Perdue's Chances of Beating Brian Kemp in Georgia Primary"
  },
  {
    "id": 4946,
    "mediaId": 19,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "In a Monday statement, Trump said the debate was a BIG win for David Perdue, who exposed <span class='selected-term'>Brian Kemp</span> as the RINO that we all know him to be.?\nTrump identified Perdue as the only Republican who can defeat Stacey The Hoax Abrams,? and said:\nIt also showed how important it is for the MAGA voters to go and support David Perdue in the Election.",
    "author": "Hannah Bleau",
    "title": "Donald Trump: Georgia Debate a BIG Win for Perdue, Exposed Brian Kemp as RINO"
  },
  {
    "id": 1879,
    "mediaId": 237,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "\"After months and months of <span class='selected-term'>Brian Kemp</span> having exclusive ability to raise unlimited funds as a result of the bill he signed, Kemp will no longer be able to raise these funds while Stacey Abrams and [her leadership committee] One Georgia are denied equal ability to operate under the same rules.",
    "author": "Cami Mondeaux",
    "title": "Brian Kemp's campaign fundraising suspended until after GOP primary, judge rules"
  },
  {
    "id": 1852,
    "mediaId": 409,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Sparks flew between former senator David Perdue and Georgia governor <span class='selected-term'>Brian Kemp</span> at the GOP gubernatorial primary debate Thursday night.",
    "author": "Caroline Downey",
    "title": "Sparks Fly at Heated Georgia Debate Between Brian Kemp, David Perdue"
  },
  {
    "id": 4839,
    "mediaId": 19,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Pam Key",
    "title": "Stacey Abrams: Kemp Has Perfected Cruelty Towards Fragile Transgender Kids"
  },
  {
    "id": 1832,
    "mediaId": 1576,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Georgia's Brian Kemp raises $2.7M for reelection bid"
  },
  {
    "id": 4779,
    "mediaId": 223,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Lindenbaum's name appears as the third signature on the original complaint in the lawsuit alleging voter suppression in the race that saw then-Republican Secretary of State <span class='selected-term'>Brian Kemp</span> defeat Abrams by 55,000 votes statewide in the governor's race.",
    "author": "Guy Benson",
    "title": "Surprise: Biden Nominates Conspiratorial Election Truther to Oversee US Elections"
  },
  {
    "id": 4724,
    "mediaId": 33,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "Daniel Dale",
    "title": "Fact check: Jody Hice, running to oversee Georgia elections, makes yet more false 2020 claims"
  },
  {
    "id": 4673,
    "mediaId": 43,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Time for Democratic leaders in Washington to take their cues from the states on abortion"
  },
  {
    "id": 4676,
    "mediaId": 19,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Georgia Democrat Stacey Abrams Sponsored Legislation Related to Her Private Business Interests"
  },
  {
    "id": 1728,
    "mediaId": 19,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "And if they're not voting for <span class='selected-term'>Brian Kemp</span>, they're not going to be able to vote for Herschel Walker.?\nThe ARW poll also tested Walker in his primary race and found him leading his closest opponent by nearly 50 points, an outsize lead that Walker has held throughout the primary.",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Brian Kemp Holds 38-Point Lead over David Perdue"
  },
  {
    "id": 4591,
    "mediaId": 65,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "\"Reminder: <span class='selected-term'>Brian Kemp</span> stole the gubernatorial election from Georgians and Stacey Abrams,\" Jean-Pierre tweeted on April 2, 2020, reacting to a news story about Kemp saying he only just learned that asymptomatic people can spread COVID-19.",
    "author": "Jessica Chasmar",
    "title": "Biden's new WH press secretary claimed Trump, GA Gov. Kemp 'stole' elections"
  },
  {
    "id": 4575,
    "mediaId": 223,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "",
    "author": "Matt Vespa",
    "title": "What a Woman Found Walking Her Dog Should Spark More Questions About Election Integrity"
  },
  {
    "id": 4580,
    "mediaId": 223,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "\"Fox News was racist before #coronavirus, they are racist during coronavirus, and Fox News will be racist after the coronavirus\" @JoyAnnReid #AMJoy #MSNBC #SundayMorning pic.twitter.com/0oOQWqkSE8\n Karine Jean-Pierre (@K_JeanPierre) March 15, 2020\nStolen emails, stolen drone, stolen election .....welcome to the world of #unpresidented Trump https://t.co/NI7vqPV6cu\n Karine Jean-Pierre (@K_JeanPierre) December 18, 2016\nReminder: <span class='selected-term'>Brian Kemp</span> stole the gubernatorial election from Georgians and Stacey Abrams.https://t.co/ZIKGTd6U1v\n Karine Jean-Pierre (@K_JeanPierre) April 2, 2020\nAs Guy stated, all this coming from the administration that promised to unite the country.",
    "author": "Leah Barkoukis",
    "title": "Biden's New Press Secretary Had Some Interesting Things to Say About Fox News"
  },
  {
    "id": 4555,
    "mediaId": 223,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "And if Psaki views undermining our institutions and the public's faith in our system as part of her job, it may be a seamless transition to her successor:\nReminder: <span class='selected-term'>Brian Kemp</span> stole the gubernatorial election from Georgians and Stacey Abrams.https://t.co/ZIKGTd6U1v\n Karine Jean-Pierre (@K_JeanPierre) April 2, 2020\nTo be fair to Ms. Jean-Pierre, she is hardly alone in embracing this conspiracy theory for political reasons.",
    "author": "Guy Benson",
    "title": "Will Biden's Ministry of Truth Investigate His New Press Secretary?"
  },
  {
    "id": 4563,
    "mediaId": 65,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Back on April 2nd, 2020, she tweeted \"Reminder <span class='selected-term'>Brian Kemp</span> stole the gubernatorial election from Georgians and Stacey Abrams.\"",
    "author": "Greg Gutfeld",
    "title": "Greg Gutfeld: Karine Jean-Pierre's tweets matter"
  },
  {
    "id": 3312,
    "mediaId": 305,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "Georgia has a been a traditionally red state, but the wins by Warnock, Sen. John Ossoff, and the potential for Stacey Abrams to beat Republican governor <span class='selected-term'>Brian Kemp</span> could show Democrats have been making progress.",
    "author": "Murjani Rawls",
    "title": "Potential Warnock vs. Walker Georgia Senate Battle Shows It Could Be A Close Race"
  },
  {
    "id": 3317,
    "mediaId": 25,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "Former Vice President Mike Pence is headlining a primary election-eve campaign event next week for Governor <span class='selected-term'>Brian Kemp</span>, who is facing a Trump-backed primary challenger in former Senator David Perdue.",
    "author": "",
    "title": "Pence campaigning for Brian Kemp as he faces Trump-backed challenger in Georgia"
  },
  {
    "id": 4511,
    "mediaId": 675,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "Democratic activist Stacey Abrams, known for her get-out-the-vote activism, is running again for governor of Georgia after narrowly losing to the current governor, <span class='selected-term'>Brian Kemp</span>, in 2018.",
    "author": "Art Moore",
    "title": "'2000 Mules' investigator: Georgia officials intimidating my witnesses"
  },
  {
    "id": 3402,
    "mediaId": 409,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "It creates opportunities for rivals: Mike Pence is campaigning next week for <span class='selected-term'>Brian Kemp</span> in Georgia, opposing the Trump-backed candidacy of David Perdue.",
    "author": "Dan McLaughlin",
    "title": "The Ron DeSantis Dog That Hasnt Barked Yet"
  },
  {
    "id": 3366,
    "mediaId": 136,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Former President George W. Bush is reported to be attending a fundraiser in support of Georgia governor <span class='selected-term'>Brian Kemp</span> in another example of recent and longtime enemies of Donald Trump publicly rallying against the MAGA president's endorsed candidate, David Perdue.",
    "author": "Ewan Palmer",
    "title": "Donald Trump's Enemies Flock to Brian Kemp in Bid to Thwart MAGA Surge"
  },
  {
    "id": 4471,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Michael Lee",
    "title": "Georgia early voting shatters records despite election reforms Dems labeled 'voter suppression'"
  },
  {
    "id": 4459,
    "mediaId": 409,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "The fact that this years GOP Senate primary features Herschel Walker, arguably the greatest college football player of all time who won a national championship with the University of Georgia, probably helps stir public interest in the race, as well as President Trumps furious denunciations of incumbent GOP governor <span class='selected-term'>Brian Kemp</span>, although Kemp is leading the polls by a wide margin.",
    "author": "Jim Geraghty",
    "title": "Much Higher Minority Early Voting in Georgias Upcoming Primaries"
  },
  {
    "id": 4460,
    "mediaId": 223,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Despite the loud and hyperbole-filled opposition, the law was passed and Republican Governor <span class='selected-term'>Brian Kemp</span> signed the measure into law while noting criticism of the legislation was disingenuous and completely false.? Kemp was right.",
    "author": "Spencer Brown",
    "title": "Georgia Sets Early Voting Record and Debunks 'Jim Crow 2.0' Fear-Mongering"
  },
  {
    "id": 6583,
    "mediaId": 195,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Brad Bannon",
    "title": "Party primaries test power of Trumps backing and progressive platform"
  },
  {
    "id": 6608,
    "mediaId": 234,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Trump has been desperately trying to lift David Perdue, his preferred candidate in Georgias governor race, over incumbent <span class='selected-term'>Brian Kemp</span>a right-wing governor who provoked his ire by not doing more to overturn Joe Bidens 2020 election win.",
    "author": "Eric Lutz",
    "title": "Donald Trumps Georgia Revenge Fantasy Isnt Quite Panning Out"
  },
  {
    "id": 7082,
    "mediaId": 195,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Lexi Lonas",
    "title": "Palin to stump for Perdue in Georgia"
  },
  {
    "id": 7087,
    "mediaId": 65,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Why Trump's full court press in Georgia hasn't helped Perdue's bid to oust Kemp"
  },
  {
    "id": 7093,
    "mediaId": 409,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "They should renominate <span class='selected-term'>Brian Kemp</span> for a second term as governor.",
    "author": "The Editors",
    "title": "Yes on Kemp, No on Greene"
  },
  {
    "id": 7065,
    "mediaId": 151,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Georgia's Latino population keeps growing. Why are there so few in office?"
  },
  {
    "id": 7067,
    "mediaId": 238,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "",
    "author": "Matthew Brown",
    "title": "Voting is surging in Georgia despite controversial new election law"
  },
  {
    "id": 7069,
    "mediaId": 151,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Trump's revenge tour is put to the test in Georgia, Alabama"
  },
  {
    "id": 7072,
    "mediaId": 129,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "I am with David all the way because <span class='selected-term'>Brian Kemp</span> was the WORST governor in the Country on Election Integrity!? Mr. Trump insisted Friday on his Truth Social messaging platform.",
    "author": "",
    "title": "Perdue Had Trump. In Georgia, Kemp Had Everything Else."
  },
  {
    "id": 7190,
    "mediaId": 21,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "It took everyone getting behind <span class='selected-term'>Brian Kemp</span>  even people that did not support him in the runoff,\" she said of the concentrated effort it took to shore up the 50,000 votes that kept the state from flipping blue.",
    "author": "Warren Rojas",
    "title": "David Perdue's closing argument to Georgians ahead of Tuesday's GOP primary: A vote for Brian Kemp is a vote for Stacey Abrams"
  },
  {
    "id": 7228,
    "mediaId": 129,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Democrats Fight Headwinds in Georgia and Beyond: The Problem Is Reality"
  },
  {
    "id": 7238,
    "mediaId": 195,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "Max Greenwood",
    "title": "Democrats look to defy political headwinds in Georgia"
  },
  {
    "id": 7240,
    "mediaId": 65,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "\"<span class='selected-term'>Brian Kemp</span> just doesn't care.\"",
    "author": "Jessica Chasmar",
    "title": "Stacey Abrams says Georgia the worst state in the country to live, despite owning multiple houses there"
  },
  {
    "id": 7245,
    "mediaId": 21,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "John L. Dorman",
    "title": "Early voting turnout in Georgia soars in wake of restrictive election law"
  },
  {
    "id": 7248,
    "mediaId": 195,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Not only is he petulant dotard but also a deplorable illegitimate president,? was her sentiment in 2017.\nReminder: <span class='selected-term'>Brian Kemp</span> stole the gubernatorial election from Georgians and Stacey Abrams,? she said of Abramss gubernatorial loss to Republican Brian Kemp.",
    "author": "Joe Concha",
    "title": "Amateur hour at the White House briefing room"
  },
  {
    "id": 7260,
    "mediaId": 1576,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Georgia voters showed us these 3 things about the fall election"
  }
]