[
  {
    "id": 8342,
    "mediaId": 12,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "Tia Mitchell",
    "title": "The Jolt: The Cobb homage to treason planned for Jan. 6"
  },
  {
    "id": 5395,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kevin Liptak",
    "title": "Biden announces historic oil reserve release and presses oil companies to do their part to reduce gas prices"
  },
  {
    "id": 5287,
    "mediaId": 98,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Residents of Southern states clear storm debris as more severe weather looms"
  },
  {
    "id": 5254,
    "mediaId": 33,
    "date": "4/8/2022 12:00:00 AM",
    "sentence": "",
    "author": "Art Acevedo",
    "title": "Opinion: These laws tie law enforcement's hands behind their backs"
  },
  {
    "id": 5238,
    "mediaId": 558,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "A former state representative and a successful author, she ran for governor in 2018 and lost narrowly to <span class='selected-term'>Brian Kemp</span>, refusing to concede while protesting his role as secretary of state in controlling his own election.",
    "author": "Martin Pengelly",
    "title": "Stacey Abrams win in Georgia will lead to cold war with Florida, DeSantis says"
  },
  {
    "id": 5204,
    "mediaId": 43,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "",
    "author": "Rebekah Sager",
    "title": "Texas conservatives have gone rogue, paying Big Lie lackeys to investigate citizens for voter fraud"
  },
  {
    "id": 5109,
    "mediaId": 169,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "Jon Skolnik",
    "title": "Corporate America steps up to fight for abortion access  after backing anti-abortion Republicans"
  },
  {
    "id": 5112,
    "mediaId": 157,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "Jon Skolnik",
    "title": "Corporate America steps up to fight for abortion access  after backing anti-abortion Republicans"
  },
  {
    "id": 5040,
    "mediaId": 157,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "I was in San Antonio today to meet with the men & women of law enforcement.\\n\\nIn Texas, we ALWAYS back the blue.\\n\\nThat is why I signed laws that defund cities that defund police & made attacks on law enforcement officers a hate crime.\\n\\nThank you for keeping us safe.pic.twitter.com/fPs7lR8FzC\n Greg Abbott (@Greg Abbott) 1650578380\nNOW WATCH: Trump rages against <span class='selected-term'>Brian Kemp</span> for purportedly conspiring against Marjorie Taylor Greene\nStories Chosen For You",
    "author": "Bob Brigham",
    "title": "Greg Abbott gave Crime Stoppers $6 million  and theyre attacking Democrats: report"
  },
  {
    "id": 4949,
    "mediaId": 323,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "",
    "author": "The Editorial Board",
    "title": "Remain in Mexico Policy Goes to the Supreme Court"
  },
  {
    "id": 104,
    "mediaId": 239,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "Haris Alic",
    "title": "George W. Bush to headline $5K-a-head fundraiser for Trump foe Brian Kemp"
  },
  {
    "id": 1795,
    "mediaId": 65,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "President George W. Bush to appear at event for Georgia Gov. Brian Kemp, opponent of Trump-backed Purdue"
  },
  {
    "id": 4519,
    "mediaId": 169,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "RELATED: Georgia GOP outraged Trump turned against <span class='selected-term'>Brian Kemp</span>: 'I am just so mad  beyond words\"\nBack in March, the president held a tele-rally in support of Perdue, lining the candidate's campaign coffer with half a million dollars.",
    "author": "Jon Skolnik",
    "title": "Mike Pence and top Republicans flock to Georgia to defeat Trump's candidate in key primary"
  },
  {
    "id": 3379,
    "mediaId": 136,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "But Pence, who has increasingly shown a willingness to buck his relationship with Trump in the past several months, is now throwing his weight behind Georgia's incumbent Republican Governor <span class='selected-term'>Brian Kemp</span>.",
    "author": "Jason Lemon",
    "title": "Trump Heads to Texas Rally as Allies Face Subpoenas, Pence Clash Ramps Up"
  },
  {
    "id": 6525,
    "mediaId": 238,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "David Weigel",
    "title": "The Trailer: Four trends from Tuesday's primaries in Pennsylvania, North Carolina and elsewhere"
  },
  {
    "id": 7484,
    "mediaId": 195,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "",
    "author": "Rachel Scully",
    "title": "What time do polls close in Georgia, Texas?"
  },
  {
    "id": 7308,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "Max Greenwood",
    "title": "Five things to watch in the Georgia, Alabama primaries"
  },
  {
    "id": 7338,
    "mediaId": 25,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "David Perdue and <span class='selected-term'>Brian Kemp</span>.",
    "author": "",
    "title": "Primary results 2022: Georgia, Alabama, Arkansas, Texas runoff and Minnesota special election primary results"
  },
  {
    "id": 7412,
    "mediaId": 233,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump declined to discuss the probability that David Perdue will lose the Georgia gubernatorial primary to incumbent Republican <span class='selected-term'>Brian Kemp</span>, preferring to discuss his more successful candidates during an interview Tuesday with Fox Business Network.",
    "author": "David Jackson",
    "title": "Stacey Abrams wins gov primary; GA polls close; primaries also in Alabama, Ark., Texas: live updates"
  },
  {
    "id": 7416,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Live coverage: Polls close in Alabama, Texas"
  },
  {
    "id": 7418,
    "mediaId": 18,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "I had an inelegant delivery of a statement that I will keep making  that is <span class='selected-term'>Brian Kemp</span> is a failed governor who doesnt care about the people of Georgia, Abrams said.",
    "author": "Associated Press",
    "title": "Midterm updates | Arkansas Sanders mourns Texas victims"
  },
  {
    "id": 7421,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "2 hr ago 19:27 PM EDT\nStacey Abrams Wins Georgia's Democratic Primary for Govenor\nStacey Abrams has again won the Democratic primary for governor of Georgia, setting up a potential rematch with Republican <span class='selected-term'>Brian Kemp</span>.",
    "author": "Jake Thomas",
    "title": "Primary Live Updates: Sarah Huckabee Sanders Wins Arkansas Governor Primary"
  },
  {
    "id": 7422,
    "mediaId": 409,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Its early yet in the vote-counting in todays primaries in Georgia, Alabama, Arkansas, and Texas, but this much is clear: <span class='selected-term'>Brian Kemp</span> has steamrolled David Perdue, who just conceded the race.",
    "author": "Dan McLaughlin",
    "title": "Brian Kemp Crushes David Perdue"
  },
  {
    "id": 7428,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Georgia\nIn Georgia's Republican primary race for governor, incumbent <span class='selected-term'>Brian Kemp</span> will face off against former Senator David Perdue, who has been endorsed by former President Donald Trump.",
    "author": "Isabel Martins",
    "title": "Primary Election Results for Georgia, Texas, Alabama and Other States"
  },
  {
    "id": 7435,
    "mediaId": 65,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "KEMP, PERDUE, MAKE FINAL PITCHES IN GEORGIA'S HEATED GOP GUBERNATORIAL SHOWDOWN\n\"<span class='selected-term'>Brian Kemp</span> is truly an embarrassment to the Republican Party because of what's taken place in your great state, Georgia,\" Trump charged during a tele-rally Monday evening on behalf of Perdue.",
    "author": "",
    "title": "Trump looms large over Tuesday primaries in Georgia, Alabama, Arkansas, and runoff in Texas"
  },
  {
    "id": 7437,
    "mediaId": 223,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Down in Georgia, incumbent Governor <span class='selected-term'>Brian Kemp</span>  endorsed by former Vice President Mike Pence  squares off against former Senator David Perdue  endorsed by former President Donald Trump  in a key test of the power held by the previous administration's top two figures.",
    "author": "Spencer Brown",
    "title": "Here's What to Expect in the Texas Runoffs and Races in Georgia, Alabama, and Arkansas"
  },
  {
    "id": 7438,
    "mediaId": 238,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Today, Republican voters in Georgia will decide a marquee primary contest for governor between incumbent <span class='selected-term'>Brian Kemp</span> and former U.S. senator David Perdue, an election that could be a big setback for former president Donald Trump as he tries to play GOP kingmaker.",
    "author": "Mariana Alfaro",
    "title": "Primary elections live updates Big races are on the ballot in Georgia, Alabama, Arkansas and Texas"
  },
  {
    "id": 7472,
    "mediaId": 19,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Perdue is the third Trump-backed governor candidate to lose in as many weeks https://t.co/Sie3a6qeqA pic.twitter.com/zLhCJkWtjm\n Grace Panetta (@grace_panetta) May 24, 2022\nWhile the Associated Press and the networks have not yet called it, it is looking like a very big night for <span class='selected-term'>Brian Kemp</span>.",
    "author": "Matthew Boyle",
    "title": "*** Election Night Livewire *** Georgia, Alabama, Texas, Arkansas, Minnesota Vote in Key Primaries"
  },
  {
    "id": 7369,
    "mediaId": 65,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "And on the eve of the Peach State's primary  with Trump backing Kemp challenger former Sen. David Perdue  the former president took aim at the governor one last time before voters headed to the polls\n\"<span class='selected-term'>Brian Kemp</span> is truly an embarrassment to the Republican Party because of what's taken place in your great state, Georgia,\" Trump charged during a tele-rally Monday evening on behalf of Perdue.",
    "author": "Tyler Olson",
    "title": "Primary elections in Georgia, Alabama, runoff in Texas"
  },
  {
    "id": 7380,
    "mediaId": 178,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Let's take a few hours, lick our wounds, and tomorrow morning, you're going to hear me going to work for <span class='selected-term'>Brian Kemp</span> to make damn sure that Stacey Abrams is never governor of Georgia.\"",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Trump rebuked with stinging losses in Georgia GOP contests"
  }
]