[
  {
    "id": 8097,
    "mediaId": 12,
    "date": "d2022-03-01T17:00",
    "sentence": "",
    "author": "Greg Bluestein",
    "title": "Walker wont go to Marjorie Taylor Greene event after she spoke at pro-Putin rally",
    "sentiment": "0.0"
  },
  {
    "id": 5394,
    "mediaId": 43,
    "date": "d2022-03-31T00:00",
    "sentence": "Governors\n? GA-Gov: Incumbent <span class='selected-term'>Brian Kemp</span> is once again running a TV ad against his Trump-endorsed Republican primary foe, former Sen. David Perdue, by using footage of Trump attacking Americans who send jobs to China.",
    "author": "",
    "title": "Morning Digest: Our guide to Ohio's new congressional map, gerrymandered to benefit the GOP",
    "sentiment": "0.0"
  },
  {
    "id": 5365,
    "mediaId": 12,
    "date": "d2022-04-01T16:00",
    "sentence": "In recent days, hes been stumping for Republican gubernatorial candidate David Perdue in his challenge against incumbent <span class='selected-term'>Brian Kemp</span>.",
    "author": "Shannon McCaffrey",
    "title": "Newt Gingrich returns to the 6th District looking for a GOP win",
    "sentiment": "0.0"
  },
  {
    "id": 5360,
    "mediaId": 12,
    "date": "d2022-04-01T19:00",
    "sentence": "",
    "author": "Ty Tagami",
    "title": "Georgia Senate approves bill to limit classroom race discussions",
    "sentiment": "0"
  },
  {
    "id": 5356,
    "mediaId": 195,
    "date": "d2022-04-01T19:03",
    "sentence": "",
    "author": "Caroline Vakil",
    "title": "GA state Senate sends permit-less carry handgun bill to Kemp",
    "sentiment": "0"
  },
  {
    "id": 5355,
    "mediaId": 12,
    "date": "d2022-04-01T20:00",
    "sentence": "",
    "author": "Maya T. Prabhu",
    "title": "Georgia Legislature approves Juneteenth holiday for state employees",
    "sentiment": "0"
  },
  {
    "id": 4848,
    "mediaId": 33,
    "date": "d2022-04-29T00:00",
    "sentence": "With the silence of the Republican Governor <span class='selected-term'>Brian Kemp</span> over the voting issues in Georgia, both rank-in-file Republicans and many state leaders are bitterly divided.",
    "author": "",
    "title": "READ: 82 texts between Sean Hannity and Mark Meadows",
    "sentiment": "0.0"
  },
  {
    "id": 7635,
    "mediaId": 33,
    "date": "d2022-05-02T00:00",
    "sentence": "Finalmente, el 24 de mayo, Trump tendr la oportunidad de vengar al gobernador republicano de Georgia, <span class='selected-term'>Brian Kemp</span>, por rechazar sus esquemas electorales de 2020.",
    "author": "Por Maeve Reston",
    "title": "ANLISIS: Las primarias de mayo pondrn a prueba el toque de Trump como lder del Partido Republicano",
    "sentiment": "0"
  },
  {
    "id": 4676,
    "mediaId": 19,
    "date": "d2022-05-05T00:00",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Georgia Democrat Stacey Abrams Sponsored Legislation Related to Her Private Business Interests",
    "sentiment": "0.0"
  },
  {
    "id": 4631,
    "mediaId": 136,
    "date": "d2022-05-06T19:50",
    "sentence": "\"The Governor of Georgia, <span class='selected-term'>Brian Kemp</span>, and Secretary of State, Brad Raffensperger, perhaps in collusion with the Radical Left Democrats, have allowed a horrible thing to happen to a very popular Republican, Congresswoman Marjorie Taylor Greene,\" Trump said in a statement Thursday.",
    "author": "Zoe Strozewski",
    "title": "Brad Raffensperger Sides With Judge, Keeps Marjorie Taylor Greene on Ballot",
    "sentiment": "0.0"
  },
  {
    "id": 3301,
    "mediaId": 238,
    "date": "d2022-05-13T17:34",
    "sentence": "That tells you all you need to know about what you are getting Georgia  just a continuation of bad elections and a real RINO if you vote for <span class='selected-term'>Brian Kemp</span>, Trump wrote on his social network.",
    "author": "Josh Dawsey",
    "title": "More Republicans are working to undermine Trump endorsements",
    "sentiment": "0.0"
  },
  {
    "id": 3375,
    "mediaId": 238,
    "date": "d2022-05-16T00:00",
    "sentence": "",
    "author": "",
    "title": "Senate primaries to watch",
    "sentiment": "0.0"
  },
  {
    "id": 4466,
    "mediaId": 302,
    "date": "d2022-05-19T00:00",
    "sentence": "",
    "author": "Associated Press",
    "title": "Biden invokes Defense Production Act for baby formula shortage",
    "sentiment": "0.0"
  },
  {
    "id": 7105,
    "mediaId": 1576,
    "date": "d2022-05-20T00:00",
    "sentence": "",
    "author": "",
    "title": "Georgia's senior congressman facing toughest race since 2010",
    "sentiment": "0.0"
  },
  {
    "id": 7065,
    "mediaId": 151,
    "date": "d2022-05-21T11:01",
    "sentence": "",
    "author": "",
    "title": "Georgia's Latino population keeps growing. Why are there so few in office?",
    "sentiment": "0"
  },
  {
    "id": 7186,
    "mediaId": 25,
    "date": "d2022-05-22T00:00",
    "sentence": "Republican <span class='selected-term'>Brian Kemp</span> facing a challenge from the former senator, David Purdue, who was put up to the race by Mr. Trump.",
    "author": "",
    "title": "Full transcript of \"Face the Nation\" on May 22, 2022",
    "sentiment": "0.0"
  },
  {
    "id": 7497,
    "mediaId": 1576,
    "date": "d2022-05-23T00:00",
    "sentence": "Governor <span class='selected-term'>Brian Kemp</span> is being challenged by former U.S.",
    "author": "",
    "title": "7 things to watch on primary election night in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7289,
    "mediaId": 129,
    "date": "d2022-05-23T13:33:24",
    "sentence": "Under the once-in-a-decade redistricting process, Georgia's Republican governor, <span class='selected-term'>Brian Kemp</span>, signed into law a new map that transformed Ms. McBath's district to favor Republicans overwhelmingly.",
    "author": "",
    "title": "Democrats are mindful of headwinds in Georgia, and everywhere else.",
    "sentiment": "0.0"
  },
  {
    "id": 7342,
    "mediaId": 136,
    "date": "d2022-05-25T01:15",
    "sentence": "Trump's biggest endorsement stake was in Georgia, where he endorsed challengers to two incumbentsRaffensperger and Governor <span class='selected-term'>Brian Kemp</span>as retaliation for their refusal to help him overturn the results of the 2020 presidential election.",
    "author": "Katherine Fung",
    "title": "Marjorie Taylor Greene Wins GOP Primary and Is More Popular Than Ever",
    "sentiment": "0"
  },
  {
    "id": 7355,
    "mediaId": 136,
    "date": "d2022-05-25T07:19",
    "sentence": "However, those efforts seemed to fall flat on Tuesday after the biggest battle in the governor's race was won by Trump's rival Governor <span class='selected-term'>Brian Kemp</span>, who easily defeated former Senator David Perdue.",
    "author": "Katherine Fung",
    "title": "Republican Who Said Elon Musk is African-American Faces Georgia Runoff",
    "sentiment": "0.0"
  },
  {
    "id": 8391,
    "mediaId": 136,
    "date": "d2022-05-28T10:00",
    "sentence": "Georgia's GOP Governor <span class='selected-term'>Brian Kemp</span> and Secretary of State Brad Raffensperger, who drew the former president's wrath after they declined to help him overturn President Joe Biden's 2020 election win in their state, both won their primaries by double-digit margins on Tuesday.",
    "author": "Jason Lemon",
    "title": "Liz Cheney's Chances of Beating Trump-Backed Harriet Hageman in Wyoming",
    "sentiment": "0"
  }
]