[
  {
    "id": 1508,
    "mediaId": 19,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "The Democrats walked all over <span class='selected-term'>Brian Kemp</span>.",
    "author": "Ashley Oliver",
    "title": "Exclusive  Donald Trump Delivers Message to Georgia in First David Perdue Ad: Brian Kemp Let Us Down'"
  },
  {
    "id": 7036,
    "mediaId": 43,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Morning Digest: Democratic Senate primary in Pennsylvania gets smaller as GOP's gets uglier"
  },
  {
    "id": 5405,
    "mediaId": 124,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Georgia lawmakers gut controversial elections bill"
  },
  {
    "id": 5394,
    "mediaId": 43,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Governors\n? GA-Gov: Incumbent <span class='selected-term'>Brian Kemp</span> is once again running a TV ad against his Trump-endorsed Republican primary foe, former Sen. David Perdue, by using footage of Trump attacking Americans who send jobs to China.",
    "author": "",
    "title": "Morning Digest: Our guide to Ohio's new congressional map, gerrymandered to benefit the GOP"
  },
  {
    "id": 5354,
    "mediaId": 136,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Governor <span class='selected-term'>Brian Kemp</span> said on Twitter Friday he looked forward to signing the bill, \"fulfilling another promise I made to the voters of this state.\"",
    "author": "Jake Thomas",
    "title": "Georgians Closer to Carrying Concealed Guns Without License"
  },
  {
    "id": 5356,
    "mediaId": 195,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "Caroline Vakil",
    "title": "GA state Senate sends permit-less carry handgun bill to Kemp"
  },
  {
    "id": 5375,
    "mediaId": 1576,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Georgia lawmakers OK parent rights, divisive concepts ban"
  },
  {
    "id": 5305,
    "mediaId": 124,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Georgia lawmakers pass bill allowing state police to investigate voter fraud"
  },
  {
    "id": 5307,
    "mediaId": 163,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Trump has fiercely criticized Governor <span class='selected-term'>Brian Kemp</span> and Secretary of State Brad Raffensperger, both fellow Republicans, for their refusal to overturn the results of the 2020 election, in which President Joe Biden became the first Democrat in nearly 30 years to win the state.",
    "author": "Joseph Ax",
    "title": "Georgia Republicans pass bill empowering law enforcement to investigate elections"
  },
  {
    "id": 5285,
    "mediaId": 305,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "In January, former Senator and current Republican Gubernatorial candidate David Purdue called for an election police unit, to do what <span class='selected-term'>Brian Kemp</span> has failed to do? to make Georgia elections the safest and securest.? Secretary of State Brad Raffensperger stated that voter fraud is not widespread in Georgia.",
    "author": "Murjani Rawls",
    "title": "Georgia Republicans Pass Bill To Allow State Police To Investigate Voter Fraud Claims"
  },
  {
    "id": 198,
    "mediaId": 19,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Trump's First Major Midterm Donation Aims to Unseat Brian Kemp in Georgia"
  },
  {
    "id": 2109,
    "mediaId": 19,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Brian Kemp Has Wide Lead over David Perdue in Governor's Primary"
  },
  {
    "id": 5167,
    "mediaId": 21,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Brent D. Griffiths",
    "title": "McConnell said Trump is 'always setting up somebody to blame it on' ahead of Georgia's pivotal 2021 Senate runoffs"
  },
  {
    "id": 5139,
    "mediaId": 63,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "",
    "author": "Nicholas Reimann",
    "title": "Trump Reportedly Backing J.D. Vance In Ohio Senate RaceLatest Test Of Dubious Endorsement Power"
  },
  {
    "id": 5133,
    "mediaId": 129,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Trump Endorses J.D. Vance in Republican Primary for Senate in Ohio"
  },
  {
    "id": 5091,
    "mediaId": 169,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Many eyes are on Georgia as a microcosm of the \"Mar-a-Lago Machine\" in action, where Trump has waged a particularly ugly crusade against GOP Governor <span class='selected-term'>Brian Kemp</span> and Secretary of State Brad Raffensberger, along with anyone associated with them, endorsing their challengers and insisting that all GOP candidates running for any office sign off on the Big Lie.",
    "author": "Heather Digby Parton",
    "title": "Does Trump still have the juice? His spotty endorsement record suggests decline"
  },
  {
    "id": 5023,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Morning Digest: Federal judges let Ohio GOP run out the clock and use illegal gerrymandered maps"
  },
  {
    "id": 1921,
    "mediaId": 136,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "\"Initially David Perdue opened a fairly strong favorite but the market may have placed an over emphasis on Trump's endorsement at first, in turn underestimating the chances of <span class='selected-term'>Brian Kemp</span>,\" Ladbrokes spokesperson Alex Apati told Newsweek.",
    "author": "Khaleda Rahman",
    "title": "David Perdue's Chances of Beating Brian Kemp in Georgia Primary"
  },
  {
    "id": 4946,
    "mediaId": 19,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "In a Monday statement, Trump said the debate was a BIG win for David Perdue, who exposed <span class='selected-term'>Brian Kemp</span> as the RINO that we all know him to be.?\nTrump identified Perdue as the only Republican who can defeat Stacey The Hoax Abrams,? and said:\nIt also showed how important it is for the MAGA voters to go and support David Perdue in the Election.",
    "author": "Hannah Bleau",
    "title": "Donald Trump: Georgia Debate a BIG Win for Perdue, Exposed Brian Kemp as RINO"
  },
  {
    "id": 1795,
    "mediaId": 65,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "President George W. Bush to appear at event for Georgia Gov. Brian Kemp, opponent of Trump-backed Purdue"
  },
  {
    "id": 1728,
    "mediaId": 19,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "And if they're not voting for <span class='selected-term'>Brian Kemp</span>, they're not going to be able to vote for Herschel Walker.?\nThe ARW poll also tested Walker in his primary race and found him leading his closest opponent by nearly 50 points, an outsize lead that Walker has held throughout the primary.",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Brian Kemp Holds 38-Point Lead over David Perdue"
  },
  {
    "id": 1704,
    "mediaId": 21,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "\"One of the problems also is if <span class='selected-term'>Brian Kemp</span> gets in, I think it's going to be very, very hard for Herschel Walker to win,\" the former president said.",
    "author": "John L. Dorman",
    "title": "Trump says it will be 'very hard' for Herschel Walker to win the Georgia Senate race if Brian Kemp is the GOP gubernatorial nominee"
  },
  {
    "id": 3312,
    "mediaId": 305,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "Georgia has a been a traditionally red state, but the wins by Warnock, Sen. John Ossoff, and the potential for Stacey Abrams to beat Republican governor <span class='selected-term'>Brian Kemp</span> could show Democrats have been making progress.",
    "author": "Murjani Rawls",
    "title": "Potential Warnock vs. Walker Georgia Senate Battle Shows It Could Be A Close Race"
  },
  {
    "id": 3317,
    "mediaId": 25,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "Former Vice President Mike Pence is headlining a primary election-eve campaign event next week for Governor <span class='selected-term'>Brian Kemp</span>, who is facing a Trump-backed primary challenger in former Senator David Perdue.",
    "author": "",
    "title": "Pence campaigning for Brian Kemp as he faces Trump-backed challenger in Georgia"
  },
  {
    "id": 3375,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Senate primaries to watch"
  },
  {
    "id": 3382,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "The Ohio and Pennsylvania Republicans were mostly taking their cues from Mr. Trump in their Senate primaries; by contrast, the Georgia Republicans were more inclined to buck Mr. Trump and stick with their incumbent Republican governor, <span class='selected-term'>Brian Kemp</span>, whom the former president is trying to oust in next weeks primary.",
    "author": "",
    "title": "10 Republican Voters in Swing States on Trumps Hold on the Party"
  },
  {
    "id": 4472,
    "mediaId": 302,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Associated Press",
    "title": "Primary takeaways: Election denier wins, bad behavior dooms Cawthorn"
  },
  {
    "id": 4476,
    "mediaId": 943,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Election denier wins GOP nomination for Pennsylvania governor: Takeaways from Tuesdays primaries"
  },
  {
    "id": 4477,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Julia Manchester",
    "title": "Little fends of Trump-backed primary challenge in Idaho governor primary"
  },
  {
    "id": 4456,
    "mediaId": 238,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Greg Sargent",
    "title": "Opinion Trumps alarming GOP primary wins demand a serious response"
  },
  {
    "id": 6605,
    "mediaId": 33,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Gabby Orr",
    "title": "Trump may hold off on more endorsements for coming primaries, advisers say"
  },
  {
    "id": 6608,
    "mediaId": 234,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Trump has been desperately trying to lift David Perdue, his preferred candidate in Georgias governor race, over incumbent <span class='selected-term'>Brian Kemp</span>a right-wing governor who provoked his ire by not doing more to overturn Joe Bidens 2020 election win.",
    "author": "Eric Lutz",
    "title": "Donald Trumps Georgia Revenge Fantasy Isnt Quite Panning Out"
  },
  {
    "id": 6539,
    "mediaId": 409,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Trump relentlessly pushed former senator David Perdue to run a primary challenge against Georgia governor <span class='selected-term'>Brian Kemp</span>.",
    "author": "Jim Geraghty",
    "title": "Trump's Gambling Isn't Paying Off"
  },
  {
    "id": 6566,
    "mediaId": 238,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Other tests of Trumps influence loom next week, including in Georgia, where polls show his preferred choice for governor, David Perdue, badly trailing incumbent <span class='selected-term'>Brian Kemp</span> in the GOP primary.",
    "author": "Mariana Alfaro",
    "title": "Post Politics Now Senate primary in Pa. still unresolved as other tests of Trumps influence loom"
  },
  {
    "id": 7076,
    "mediaId": 195,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "I am with David all the way because <span class='selected-term'>Brian Kemp</span> was the WORST Governor in the Country on Election Integrity,? he added.",
    "author": "Caroline Vakil",
    "title": "Trump calls NBC story on him giving up on Perdue a phony narrative"
  },
  {
    "id": 7106,
    "mediaId": 129,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "In the Georgia primary for governor, a Trump surrogate, Sonny Purdue, is polling well behind Mr. Trumps nemesis, the incumbent <span class='selected-term'>Brian Kemp</span>.",
    "author": "",
    "title": "Democrats, the Midterm Jinx Is Not Inevitable"
  },
  {
    "id": 6524,
    "mediaId": 136,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "Taylor, who is challenging incumbent GOP Governor <span class='selected-term'>Brian Kemp</span>, has made religion a cornerstone of her campaign.",
    "author": "Andrew Stanton",
    "title": "Native Americans Made 'Sacrifice' for 'Our Right to Worship Jesus': Taylor"
  },
  {
    "id": 7065,
    "mediaId": 151,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Georgia's Latino population keeps growing. Why are there so few in office?"
  },
  {
    "id": 7072,
    "mediaId": 129,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "I am with David all the way because <span class='selected-term'>Brian Kemp</span> was the WORST governor in the Country on Election Integrity!? Mr. Trump insisted Friday on his Truth Social messaging platform.",
    "author": "",
    "title": "Perdue Had Trump. In Georgia, Kemp Had Everything Else."
  },
  {
    "id": 7074,
    "mediaId": 129,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "Under the once-in-a-decade redistricting process, Georgias Republican governor, <span class='selected-term'>Brian Kemp</span>, signed into law a new map that transformed Ms. McBaths district to favor Republicans overwhelmingly.",
    "author": "",
    "title": "Two Democratic Congresswomen, One Redrawn Georgia District"
  },
  {
    "id": 7202,
    "mediaId": 151,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "'No one's paying any attention': The week that Republicans ignored Trump's election lies"
  },
  {
    "id": 7238,
    "mediaId": 195,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "Max Greenwood",
    "title": "Democrats look to defy political headwinds in Georgia"
  },
  {
    "id": 7242,
    "mediaId": 136,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "\"Good for <span class='selected-term'>Brian Kemp</span> who stayed the course and showed what you can do when you have a real record to run on and you don't have to kowtow to this and you don't have to change yourselfbe who you are and that authenticity has carried him.\"",
    "author": "Thomas Kika",
    "title": "McConnell Adviser Blames Trump for 'Embarrassing' End to Perdue's Career"
  },
  {
    "id": 7243,
    "mediaId": 233,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "University of Georgia Professor Charles Bullock told USA TODAY that Trump's endorsement \"really doesn't make much of a difference in the governor's race because <span class='selected-term'>Brian Kemp</span> is well-known.\"",
    "author": "Merdie Nzanga",
    "title": "Ahead of Georgia primary, RNC chairwoman calls on Republicans to unite"
  }
]