[
  {
    "id": 5390,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kevin Liptak",
    "title": "Biden considering releasing 1 million barrels of oil per day from strategic reserves"
  },
  {
    "id": 5391,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "En Georgia, el gobernador republicano <span class='selected-term'>Brian Kemp</span>, quien enfrenta una de las carreras de reeleccin ms duras del pas, firm un proyecto de ley que otorgar reembolsos de impuestos de US$ 250 a $ 500 a los georgianos, una medida que varios de sus rivales criticaron como politiquera de ao electoral.",
    "author": "Kevin Liptak",
    "title": "Biden considera liberar 1 milln de barriles de petrleo por da de reservas estratgicas"
  },
  {
    "id": 5393,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "En Georgia, el gobernador republicano <span class='selected-term'>Brian Kemp</span>, que enfrenta una de las carreras de reeleccin ms duras del pas, firm un proyecto de ley que otorgar reembolsos de impuestos de US$ 250 a US$ 500 a los georgianos, una medida que varios de sus rivales criticaron como politiquera.",
    "author": "Kevin Liptak",
    "title": "Biden anunci una liberacin histrica de reservas de petrleo y presiona a las compaas petroleras para que hagan su parte para reducir los precios de la gasolina"
  },
  {
    "id": 5395,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kevin Liptak",
    "title": "Biden announces historic oil reserve release and presses oil companies to do their part to reduce gas prices"
  },
  {
    "id": 5162,
    "mediaId": 33,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "En Georgia, por ejemplo, los partidarios de la Gran Mentira, la falsa afirmacin de que las elecciones de 2020 fueron robadas al expresidente Donald Trump, abuchearon al gobernador <span class='selected-term'>Brian Kemp</span>, un republicano acrrimo que se enfrenta a un desafo en las primarias de un candidato elegido a dedo por el expresidente.",
    "author": "Por Frida Ghitis",
    "title": "OPININ | As podra verse la venganza de Putin contra Estados Unidos"
  },
  {
    "id": 4914,
    "mediaId": 43,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Lets hear from Beau on Georgia\nThe debate between <span class='selected-term'>Brian Kemp</span> and David Perdue was quite a spectacle.",
    "author": "",
    "title": "\"Try to Think What We Are Going to Do Ourselves\""
  },
  {
    "id": 3316,
    "mediaId": 1576,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "I am proud to offer my full support for four more years of <span class='selected-term'>Brian Kemp</span> as governor of the great state of Georgia!?\nThe news comes as Pence has taken steps to distance himself from Trump as the former congressman and Indiana governor considers a 2024 presidential run that could put him into direct competition with his former boss.",
    "author": "",
    "title": "Pence to rally with Kemp in Georgia in break with Trump"
  },
  {
    "id": 7294,
    "mediaId": 129,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The Depp-Heard Trial Isn't Even the Weirdest Thing About America Right Now"
  }
]