[
  {
    "id": 195,
    "mediaId": 157,
    "date": "2022-00-13",
    "sentence": "",
    "author": "Timothy Evans",
    "title": "Trump finally opens his war chest as he struggles to take down GOP governor Brian Kemp in Georgia",
    "sentiment": "-0.826"
  },
  {
    "id": 7291,
    "mediaId": 558,
    "date": "2022-00-23",
    "sentence": "",
    "author": "",
    "title": "Cheney and Pence take the fight to Trump, from Georgia to Wyoming",
    "sentiment": "-0.387"
  },
  {
    "id": 8403,
    "mediaId": 136,
    "date": "2022-00-26",
    "sentence": "On Tuesday, Georgia Governor <span class='selected-term'>Brian Kemp</span> comprehensively beat the Trump-backed David Perdue in the gubernatorial primary by more than 50 percentage points.",
    "author": "Ewan Palmer",
    "title": "Trump Still Likely to Get Revenge on Liz Cheney, Despite Brian Kemp Setback",
    "sentiment": "-0.858"
  },
  {
    "id": 8399,
    "mediaId": 151,
    "date": "2022-00-27",
    "sentence": "",
    "author": "",
    "title": "As Cheney files for reelection, poll from rival group shows her trailing badly",
    "sentiment": "0"
  },
  {
    "id": 8388,
    "mediaId": 21,
    "date": "2022-00-28",
    "sentence": "",
    "author": "Oma Seddiq",
    "title": "Trump targets Liz Cheney at Wyoming rally days after his high-profile endorsements flopped",
    "sentiment": "0"
  },
  {
    "id": 8389,
    "mediaId": 136,
    "date": "2022-00-28",
    "sentence": "The southern state's GOP Governor <span class='selected-term'>Brian Kemp</span> and Secretary of State Brad Raffensperger, who drew the former president's ire after they refused to help him overturn President Joe Biden's election win in their state, both won their primaries by double-digit margins.",
    "author": "Jason Lemon",
    "title": "Trump Targets Cheney in Wyoming Rally as Endorsement, Court Failures Sting",
    "sentiment": "0"
  },
  {
    "id": 8391,
    "mediaId": 136,
    "date": "2022-00-28",
    "sentence": "Georgia's GOP Governor <span class='selected-term'>Brian Kemp</span> and Secretary of State Brad Raffensperger, who drew the former president's wrath after they declined to help him overturn President Joe Biden's 2020 election win in their state, both won their primaries by double-digit margins on Tuesday.",
    "author": "Jason Lemon",
    "title": "Liz Cheney's Chances of Beating Trump-Backed Harriet Hageman in Wyoming",
    "sentiment": "0"
  },
  {
    "id": 8374,
    "mediaId": 238,
    "date": "2022-00-29",
    "sentence": "",
    "author": "Josh Dawsey",
    "title": "After losses in Ga., Trump sets sights on ousting Liz Cheney in Wyo.",
    "sentiment": "0"
  }
]