[
  {
    "id": 2787,
    "mediaId": 2636,
    "date": "2022-02-01",
    "sentence": "In Ohio, the Senate race is crowded with wealthy Republican self-funders who have lent or donated money to their own campaigns: Mike Gibbons, an investment banker ($11.4 million); <span class='selected-term'>Jane Timken</span>, a former party chair ($3.5 million); Bernie Moreno, a former car dealer ($3.75 million); and Matt Dolan, whose family owns the Cleveland Guardians ($10.5 million).",
    "author": "",
    "title": "Billionaires and Big Checks Shape Battle for Congress"
  },
  {
    "id": 1460,
    "mediaId": 8491,
    "date": "2022-02-15",
    "sentence": "Chagrin Falls State Senator Matt Dolan with just about 10%, and former Ohio Republican Party Chairperson <span class='selected-term'>Jane Timken</span> just under 10%.",
    "author": "Brandy Johanntges",
    "title": "Ohio Senate race heats up"
  },
  {
    "id": 1501,
    "mediaId": 2745,
    "date": "2022-02-16",
    "sentence": "Rob Portman (R-Ohio) on Wednesday endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> in the race to succeed him, calling Timken “the best candidate to advance conservative Republican policies to help Ohio workers and families.”\nTimken has touted herself in TV ads as a “Trump conservative” and is one of several Republican candidates who have worked furiously to prove their fealty to the former president.",
    "author": "",
    "title": "Ohio’s Sen. Portman backs former state GOP chair Jane Timken in race to succeed him"
  },
  {
    "id": 12493,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "“<span class='selected-term'>Jane Timken</span> is comfortable with establishment Republicans who make up a faction of our party, and with strong Trump Republicans who also are an important faction of our party, and that’s been true since becoming party chair,” he said.",
    "author": "",
    "title": "Trump endorsement casts long shadow over Ohio Senate race"
  },
  {
    "id": 15327,
    "mediaId": 8480,
    "date": "2022-03-07",
    "sentence": "The candidates: Mike Gibbons, Josh Mandel, <span class='selected-term'>Jane Timken</span>, J.D.Vance and Matt Dolan will debate at FOX 8 News in Cleveland on March 21.",
    "author": "Jessica Bates",
    "title": "Ohio Republican Senate candidates to face off for the first time"
  },
  {
    "id": 15368,
    "mediaId": 8491,
    "date": "2022-03-07",
    "sentence": "Candidates who have committed to participate include Mike Gibbons, Josh Mandel, JD Vance, Matt Dolan and <span class='selected-term'>Jane Timken</span>.",
    "author": "Mitch Davis",
    "title": "First News to air GOP Senate debate"
  },
  {
    "id": 13857,
    "mediaId": 8480,
    "date": "2022-03-15",
    "sentence": "Nexstar’s Ohio TV stations will host the hour-long debate with candidates Mike Gibbons, Josh Mandel, <span class='selected-term'>Jane Timken</span>, JD Vance and Matt Dolan at 7 p.m. on March 21.",
    "author": "Darcie Loreno",
    "title": "2 NEWS Ohio GOP Senate Debate: What are your questions for the candidates?"
  },
  {
    "id": 13491,
    "mediaId": 8491,
    "date": "2022-03-15",
    "sentence": "Nexstar’s Ohio TV stations will host the hour-long debate with candidates Mike Gibbons, Josh Mandel, <span class='selected-term'>Jane Timken</span>, JD Vance and Matt Dolan at 7 p.m. on March 21.",
    "author": "Darcie Loreno",
    "title": "Ohio GOP Senate Debate: What are your questions for the candidates?"
  },
  {
    "id": 10946,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "“You don’t know squat,” Gibbons is heard jabbing at the former state treasurer’s experience in the private sector, after which Mandel, a veteran, responds, “Two tours in Iraq, don’t tell me I haven’t worked.”\nThe men repeatedly told each other to back off before standing eye-to-eye for several seconds, while fellow GOP debate participants Matt Dolan, <span class='selected-term'>Jane Timken</span> and JD Vance looked on awkwardly.",
    "author": "",
    "title": "Ohio GOP Senate debate turns nasty as Gibbons and Mandel go nose-to-nose"
  },
  {
    "id": 13467,
    "mediaId": 8379,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Jen Steer",
    "title": "Top Ohio Republican Senate candidates to debate on Monday"
  },
  {
    "id": 13510,
    "mediaId": 8480,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Jen Steer",
    "title": "Top Ohio Republican Senate candidates to debate on Monday"
  },
  {
    "id": 13496,
    "mediaId": 8491,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Jen Steer",
    "title": "Top Ohio Republican Senate candidates to debate on Monday"
  },
  {
    "id": 13463,
    "mediaId": 8480,
    "date": "2022-03-21",
    "sentence": "Candidates also vying for the position include <span class='selected-term'>Jane Timken</span>, Mike Gibbons, Bernie Marino, JD Vance and Josh Mandel.",
    "author": "fox8webcentral",
    "title": "Race for Ohio’s Senate seat: Matt Dolan"
  },
  {
    "id": 13621,
    "mediaId": 8323,
    "date": "2022-03-21",
    "sentence": "Matt Dolan: “You don’t provide checks to people to stay home… When you get people back to work… That creates a downward pressure.”\n<span class='selected-term'>Jane Timken</span>: “They acted like children… It will be a priority of mine to get back our energy independence.”\nJosh Mandel: “So instead of depending on radical Muslim nations, instead of depending on thugs like Putin…” He says we should be producing gas in Ohio.",
    "author": "Jen Steer",
    "title": "Ohio Republican Senate candidates face off in debate at FOX 8 News"
  },
  {
    "id": 13601,
    "mediaId": 8480,
    "date": "2022-03-21",
    "sentence": "",
    "author": "Joe Toohey",
    "title": "Race for Ohio Senate seat: Jane Timken"
  },
  {
    "id": 9259,
    "mediaId": 2919,
    "date": "2022-03-28",
    "sentence": "",
    "author": "Courtney Shaw",
    "title": "Ohio's 7 Republican Senate hopefuls face off in debate at Central State University"
  },
  {
    "id": 6554,
    "mediaId": 8291,
    "date": "2022-04-12",
    "sentence": "Former Ohio Republican Party Chairwoman <span class='selected-term'>Jane Timken</span> loaned $3.5 million to her campaign last year.",
    "author": "David Skolnick",
    "title": "Ryan nets $4.1M in 1st quarter"
  },
  {
    "id": 5644,
    "mediaId": 2680,
    "date": "2022-04-14",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer Josh Mandel, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "GOP leaders in Ohio try to block Trump endorsement of Vance"
  },
  {
    "id": 5834,
    "mediaId": 2721,
    "date": "2022-04-15",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer Josh Mandel, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "",
    "title": "Trump to make huge announcement; GOP unhappy?"
  }
]