[
  {
    "id": 3431,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "Josh Mandel, Mike Gibbons, JD Vance, and <span class='selected-term'>Jane Timken</span> are some of the Republican candidates who remain in the Senate race.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Bernie Moreno Suspends U.S. Senate Campaign"
  },
  {
    "id": 2710,
    "mediaId": 2658,
    "date": "2022-02-04",
    "sentence": "The commercial shows clips of the doctor contradicting himself, then directs viewers to a link to DeSantis’ campaign website to “pre-order your exclusive freedom over Fauci flip-flops today.”\n“Let’s fire Fauci and take back our freedoms,” Ohio Republican Senate candidate <span class='selected-term'>Jane Timken</span> said in an ad titled “Fire Fauci,” which aired last fall.",
    "author": "",
    "title": "Fauci is the villain in new GOP campaign ads"
  },
  {
    "id": 12493,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "“<span class='selected-term'>Jane Timken</span> is comfortable with establishment Republicans who make up a faction of our party, and with strong Trump Republicans who also are an important faction of our party, and that’s been true since becoming party chair,” he said.",
    "author": "",
    "title": "Trump endorsement casts long shadow over Ohio Senate race"
  },
  {
    "id": 13405,
    "mediaId": 8480,
    "date": "2022-03-18",
    "sentence": "Nexstar’s Ohio TV stations will host the hour-long debate with candidates Mike Gibbons, Josh Mandel, <span class='selected-term'>Jane Timken</span>, JD Vance and Matt Dolan at 7 p.m. on March 21.",
    "author": "Jordan Unger",
    "title": "‘Back off, buddy’: Mandel, Gibbons get in heated exchange at election forum"
  },
  {
    "id": 13448,
    "mediaId": 8491,
    "date": "2022-03-18",
    "sentence": "The hour-long debate will feature candidates Mike Gibbons, Josh Mandel, <span class='selected-term'>Jane Timken</span>, JD Vance and Matt Dolan at 7 p.m. on March 21.",
    "author": "Jordan Unger",
    "title": "‘Back off, buddy’: Mandel, Gibbons get in heated exchange at election forum"
  },
  {
    "id": 9415,
    "mediaId": 2528,
    "date": "2022-03-19",
    "sentence": "The debate was attended by other GOP primary candidates JD Vance, Matt Dolan, and <span class='selected-term'>Jane Timken</span>, who looked on as the exchange unfolded.",
    "author": "Kelsey Vlamis",
    "title": "2 GOP frontrunners in the Ohio Senate race squared off during a heated debate moment: 'You watch what happens'"
  },
  {
    "id": 6554,
    "mediaId": 8291,
    "date": "2022-04-12",
    "sentence": "Former Ohio Republican Party Chairwoman <span class='selected-term'>Jane Timken</span> loaned $3.5 million to her campaign last year.",
    "author": "David Skolnick",
    "title": "Ryan nets $4.1M in 1st quarter"
  }
]