[
  {
    "id": 1501,
    "mediaId": 2745,
    "date": "2022-02-16",
    "sentence": "Rob Portman (R-Ohio) on Wednesday endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> in the race to succeed him, calling Timken “the best candidate to advance conservative Republican policies to help Ohio workers and families.”\nTimken has touted herself in TV ads as a “Trump conservative” and is one of several Republican candidates who have worked furiously to prove their fealty to the former president.",
    "author": "",
    "title": "Ohio’s Sen. Portman backs former state GOP chair Jane Timken in race to succeed him"
  },
  {
    "id": 998,
    "mediaId": 8491,
    "date": "2022-02-16",
    "sentence": "“I believe <span class='selected-term'>Jane Timken</span> is the best candidate to advance conservative Republican policies to help Ohio workers and families.",
    "author": "Talia Naquin",
    "title": "U.S. Senator Rob Portman endorses Jane Timken to fill his seat"
  },
  {
    "id": 368,
    "mediaId": 2745,
    "date": "2022-02-21",
    "sentence": "The nod might go to a more establishment candidate, such as former state party chair <span class='selected-term'>Jane Timken</span>, who has Portman’s endorsement.",
    "author": "",
    "title": "Opinion J.D. Vance’s attack on Gen. Barry McCaffrey is obscene. It’s also not unusual for today’s GOP."
  },
  {
    "id": 12493,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "“<span class='selected-term'>Jane Timken</span> is comfortable with establishment Republicans who make up a faction of our party, and with strong Trump Republicans who also are an important faction of our party, and that’s been true since becoming party chair,” he said.",
    "author": "",
    "title": "Trump endorsement casts long shadow over Ohio Senate race"
  },
  {
    "id": 11259,
    "mediaId": 2537,
    "date": "2022-03-07",
    "sentence": "After <span class='selected-term'>Jane Timken</span> gave a stump speech lambasting inflation, illegal immigration and the \"indoctrination of our children,\" U.S. Sen.",
    "author": "Haley BeMiller",
    "title": "With Portman endorsement, Ohio Senate candidate Jane Timken juggles opposing GOP factions"
  },
  {
    "id": 10754,
    "mediaId": 2594,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Eric Garcia",
    "title": "How the war in Ukraine is affecting Republican primaries"
  },
  {
    "id": 13601,
    "mediaId": 8480,
    "date": "2022-03-21",
    "sentence": "",
    "author": "Joe Toohey",
    "title": "Race for Ohio Senate seat: Jane Timken"
  },
  {
    "id": 5487,
    "mediaId": 2642,
    "date": "2022-04-22",
    "sentence": "Candidates like Josh Mandel, Mike Gibbons, <span class='selected-term'>Jane Timken</span>, and Vance have been battling it out in the primary.",
    "author": "WD Staff",
    "title": "Ohio Rallygoers Advised Not To Attend President Donald Trump Saturday Event Over JD Vance Endorsement?"
  },
  {
    "id": 5003,
    "mediaId": 6511,
    "date": "2022-04-24",
    "sentence": "La decisión del expresidente fue una estocada para otros candidatos en la contienda que estuvieron durante meses suplicando su apoyo, entre ellos, el extesorero estatal Josh Mandel, el banquero de inversiones Mike Gibbons y la expresidenta del Partido Republicano de Ohio, <span class='selected-term'>Jane Timken</span>.",
    "author": "",
    "title": "Donald Trump celebra mitin en Ohio en medio de críticas al respaldo de JD Vance para el Senado de EE. UU."
  }
]