{
  "id": 10071,
  "mediaId": 2883,
  "date": "2022-04-04",
  "headline": "Facing criticism, Tim Ryan defends anti-China ad in Ohio Senate race",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/04/IAPOL19_050_08092019.jpg",
  "link": "https://rollcall.com/2022/04/04/facing-criticism-tim-ryan-defends-anti-china-ad-in-ohio-senate-race/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephanie Akin",
  "authorUrl": "https://www.rollcall.com/author/stephanie-akin/",
  "termIds": [
    0
  ],
  "sentences": [
    "Alex Lasry, a Milwaukee Bucks basketball team executive running in the Democratic primary to take on GOP Sen. Ron Johnson in Wisconsin, pledged in an ad in January that he would “finally stand up to China.” The Democratic Senatorial Campaign Committee ran an ad around the same time attacking Johnson for “rewarding companies that outsource to China.” Lucas Kunce, a Marine veteran seeking the Democratic nomination for an open Senate seat in Missouri, aired an ad in November criticizing the Republicans in the race for alleged ties to China.",
    "He's telling Ohio voters, particularly the blue-collar voters — that we have to win, who we have to win back, if we're going to have any hope of winning in that state again — that he is on their side.”\nNo policies mentioned\nBrad Jenkins, president and CEO of AAPI Victory Fund, said he welcomed discussion about China’s trade policies and other malevolent influences on international human rights and other issues.",
    "‘Will never apologize’\n\"I've spent my entire career sounding the alarm on China, who — thanks to a concerted strategy by their Communist government that has included currency manipulation, intellectual property theft, and artificially depressed wages, use of child labor, and brutal working conditions — has been our greatest economic adversary for 40 years,” Ryan said in a statement first provided to NBC News.",
    "Herb Asher, an Ohio State University political scientist, said Ryan’s rhetoric on China is consistent with his career-spanning focus on working-class issues, and pointed out that other prominent Democrats in the state, most notably Sen. Sherrod Brown, have maintained their cross-party appeal by calling attention to the loss of Ohio manufacturing jobs overseas.",
    "“To spend $3 million right out of the gate blaming China for all the problems in the state of Ohio, that’s not an inspiring message for Asian Americans, or for any communities of color.”\nJenkins said candidates who are campaigning on competing with China could do a better job by focusing on specific policies and featuring Asian Americans in their ads.",
    "In a sense, he's saying that and, and so I'm not sure that he is saying anything that inaccurate or inappropriate.”\nDale Butland, a Democratic strategist who was the press secretary and chief of staff for four-term Ohio Sen. John Glenn, said critics of Ryan’s ad don’t understand Ohio voters.",
    "Ryan said he had voted against trade deals and tax bills “that rewarded corporations for shipping our jobs overseas.”\n“Ohio workers are the best in the world, and I will never apologize for doing everything in my power to take on China and fight for all Ohioans,\" he said.",
    "“There's a temptation now to link his ad to what the Republicans are doing, and maybe that's something he should have anticipated, but, but the whole notion of preserving and growing manufacturing jobs, that's actually a core message of his career,” Asher said.",
    "He also pointed out that Ryan is facing a competitive primary and will likely need the support of Ohio’s minority communities if he wants to win in an election that will hinge in part on motivating Democratic voters to show up in November.",
    "But the repetition of the word “China,” along with the lack of a single Asian-looking person in the footage, struck a nerve at a time when Asian Americans have been targeted by violence widely seen as fueled by Trump’s anti-China rhetoric.",
    "Shekar Narasimhan, the chairman of AAPI Victory Fund, a super PAC that supports Asian American and Pacific Islander candidates, likened it to tactics inciting “hate” and “fear” used by Republicans emulating former President Donald Trump.",
    "The argument adopts a talking point that has featured prominently in Republican campaigns since Trump won the 2016 election with a tough-on-China approach that was credited in part with the GOP’s gains among white, working-class voters.",
    "“And instead of taking them on, Washington is wasting our time on stupid fights.”\nThe ad, part of a $3.3 million campaign running across the state, attracted immediate backlash from Democratic groups promoting Asian American issues.",
    "‘Core message of his career’\nSome political scientists and Democratic strategists in Ohio said criticism of the ad is misplaced and praised Ryan and the ad for addressing an issue they said is top of mind for Ohio voters.",
    "The ad comes as the Ryan campaign has made a pointed attempt to appeal to voters in Ohio’s industrial heartland with a pitch that is centered in part on government investment in manufacturing and outcompeting China.",
    "Tim Ryan’s ad for his Ohio Senate campaign stirs up a racist pedagogy vis-a-vis China and makes Americans of East Asian descent vulnerable to attacks,” Narasimhan said in a statement posted on Twitter.",
    "With inflation and a turbulent economy driving down Democrats’ approval rating, Ryan is not the only candidate running in a Trump-friendly Midwestern or Rust Belt state to lay the blame on China.",
    "“There's no question that China's trade policies have been extremely damaging to the U.S., whether you're talking about the theft of intellectual property or currency manipulation.",
    "Ohio Rep. Tim Ryan is not backing down as he faces blowback from some fellow Democrats for an ad in his Senate campaign that repeatedly blames China for workers’ economic woes.",
    "Ryan’s campaign also noted he had voted for a resolution Meng sponsored condemning violence against Asian Americans and has spoken out in the aftermath of anti-Asian attacks.",
    "“China” is the first word Ryan utters, cueing a twangy guitar solo that runs in the background as he repeats the word “China” numerous times in different settings.",
    "“It’s definitely China,” says Ryan in a T-shirt that reads “Workers first.” “One word: China,” he says to workers in an industrial-looking kitchen.",
    "“It is us versus China,” Ryan says in the one-minute montage of his speeches, many at union halls and to audiences wearing blue-collar uniforms.",
    "New York Rep. Grace Meng, the vice chair of the Congressional Asian Pacific American Caucus, called on Ryan to stop airing it.",
    "I mean, you go down the list, there have been a lot of unfair policies that have robbed American jobs,” he said.",
    "The ad was made by Left Hook Strategy, a majority minority-owned firm led by several AAPI partners.",
    "Rob Portman is giving up is rated Solid Republican by Inside Elections with Nathan L. Gonzales.",
    "“What was heavy-handed about it is the repetition: China, China, China, China, China.",
    "Trump won Ohio by 8 points in 2020, and the open Senate race for the seat GOP Sen.",
    "“China is winning, workers are losing,” he says at a union hall.",
    "But who is our major economic adversary today in the world?",
    "“It just felt like an ad from 20 years ago,” Jenkins said.",
    "“China is winning,” he says in a high school gymnasium.",
    "Ryan’s ad stands out for its relentless focus.",
    "There's very few specific policy proposals.",
    "“That is what Tim Ryan is going at.",
    "“This was lazy,” Jenkins said.",
    "“You don't have a job?",
    "You're feeling bad?",
    "It's China.",
    "China.”",
    "China.",
    "China.",
    "“Rep."
  ]
}