{
  "id": 10370,
  "mediaId": 2526,
  "date": "2022-03-30",
  "headline": "Report: 55 House Democrat ‘Deadbeats’ Skip Paying Dues to DCCC as Midterm Red Wave Builds",
  "image": "https://media.breitbart.com/media/2021/12/GettyImages-1058677306-640x335.jpg",
  "link": "https://www.breitbart.com/midterm-election/2022/03/30/report-55-house-democrat-deadbeats-skip-paying-dues-dccc-midterm-red-wave-builds/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    4453,
    3129,
    3246,
    3049,
    389,
    392,
    1126,
    1477
  ],
  "sentences": [
    "Many of those who are stiffing the committee are some of the most powerful and influential members in the caucus, such as Oversight Chair Carolyn Maloney (D-NY), Reps. Alexandria Ocasio-Cortez (D-NY), Rashida Tlaib (D-MI), Ilhan Omar (D-MN), Cori Bush (D-MO), and Jamaal Bowman (D-NY).",
    "“The House Democratic majority is in deep trouble, with both history and the polls against them; and Republicans have overtaken what’s been traditionally a large lead by the DCCC in fundraising, thanks in part to a huge spurt in online fundraising,” Punchbowl noted.",
    "Fifty-five powerful and influential House Democrats are reportedly financially stiffing the Democratic Congressional Campaign Committee (DCCC), failing to pay the dues they owe because of the likelihood that Republicans will retake the chamber.",
    "Rules dictate that each member is responsible for dumping a certain amount of cash into the committee’s coffers to be used by the top brass as a part of a national strategy to defeat Republicans.",
    "Top Democrats leaders are unhappy and worried because many of their valuable caucus members are not paying their dues to the party committee, according to Punchbowl News.",
    "One congressional Democrat told the publication Pelosi is trying her best to force the “deadbeats” to cough up the money by keeping a list of those who have not paid.",
    "Speaker Nancy Pelosi (D-CA), House Majority Whip Jim Clyburn (D-SC), and DCCC Chair Sean Patrick Maloney (D-NY) reportedly pleaded with members on Tuesday to pay up.",
    "Others stiffing the committee include Transportation and Infrastructure Chair Peter DeFazio (D-OR) and Natural Resources Chair Raúl Grijalva (D-AZ).",
    "Those reportedly include Reps. Peter Welch (D-VT), Tim Ryan (D-OH), Conor Lamb (D-PA), Val Demings (D-FL), and Charlie Crist (D-FL), among others.",
    "Many members who are running for different political positions or are retiring from Congress after the midterms also have unpaid dues.",
    "But many members are not paying their dues, perhaps because Democrats perceive the 2022 midterm election as a lost cause.",
    "Rep. G.K. Butterfield (D-NC) has $685,000 in a campaign account, yet refuses to pay any dues.",
    "The amount of cash members are to fork over depends on their position in the party.",
    "You really don’t want to be on the wrong list right now,” the member said.",
    "“The speaker is very focused on exactly who’s paid dues and who hasn’t."
  ]
}