{
  "id": 10423,
  "mediaId": 2518,
  "date": "2022-04-01",
  "headline": "Capitol chief: Staff short, open slowly",
  "image": "https://wehco.media.clients.ellingtoncms.com/static-4/ao_redesign/graphics/adgog.jpg",
  "link": "https://www.arkansasonline.com/news/2022/apr/01/capitol-chief-staff-short-open-slowly/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "https://www.arkansasonline.com/staff/the-associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "The testimony before a House subcommittee underscores that persistent security concerns are playing a major role in restricting the public’s access to the Capitol, an increasingly sore point with lawmakers from both parties who are urging a return to normalcy after two years of restrictions.",
    "WASHINGTON — The chief of the U.S. Capitol Police told lawmakers Wednesday it was his recommendation to move forward with a phased-in reopening of the U.S. Capitol as his agency works to overcome attrition after the January 6, 2021, insurrection and hiring delays because of the pandemic.",
    "Rep. Tim Ryan, D-Ohio, who leads the subcommittee with jurisdiction over Capitol Police spending, told Manger that lawmakers understood it was a “heavy lift” to get the agency’s ranks where they need to be.",
    "“Given everything going on in the world, I think we’ve got to do everything we can to make sure people can come and be reminded of how important America is, how important the Capitol is.”",
    "U.S. Capitol Police Chief Thomas Manger said the department doesn’t have the personnel to staff the number of posts deemed necessary to secure the Capitol and adjacent offices.",
    "Hazard bonuses were paid to officers who responded to the insurrection and retention bonuses were paid to curb attrition levels that temporarily doubled their normal rate.",
    "“I believe at this point we are in fact getting ahead of attrition, but we’ve got a ways to go before we get up to where we need to be,” Manger said.",
    "Congress has boosted funding for the agency to increase hiring, cover overtime costs and bolster the security of the complex.",
    "The Capitol saw a return of more visitors this week with congressional offices limited to leading one tour weekly.",
    "“I regret we’re the choke-point, we’re the problem in terms of getting it reopened fully,” Manger said.",
    "Some of those positions have already been authorized and about 130 officers are in training.",
    "He said the agency has about 1,850 officers but is about 300 short of where it needs to be.",
    "Manger said it takes time to get in place the number of officers the agency needs, though.",
    "The adjacent Capitol Visitor Center is to reopen for limited numbers of people May 30.",
    "“By the end of the summer, my hope is that we can do a little bit more,” Manger said.",
    "The budget for the coming fiscal year recommends about a 17% increase in funding.",
    "The tourists want to get back here,” Ryan said.",
    "“The American people want to get back here.",
    "Additional posts were added after Jan. 6.",
    "The schools want to get back here."
  ]
}