{
  "id": 10632,
  "mediaId": 8491,
  "date": "2022-03-31",
  "headline": "Lawmakers want Youngstown airport designated ‘primary airport’",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2016/02/B63B1D5655F244519C3C5D4A0F6807D5_39959815_ver1.0.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/lawmakers-want-youngstown-airport-designated-primary-airport/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Sess",
  "authorUrl": "https://www.wkbn.com/author/dave-sess/",
  "termIds": [
    0
  ],
  "sentences": [
    "“When you are landing C-17s, C-130s, and all types of general aviation aircraft every day of the week, it takes its fair share of abuse on the runway,” said Western Reserve Port Authority Director Anthony Trevena.",
    "“The Western Reserve Port Authority and local officials have been working as hard as ever to maintain the airport, bring back commercial traffic, and support the mission of the 910th Airlift Wing.",
    "VIENNA TOWNSHIP, Ohio (WKBN) – It’s been four years since the Youngstown Regional Airport (YNG) has been designated a primary airport by the Federal Aviation Administration.",
    "Currently, YNG is the only commercial airport in the country with an air reserve station that does not have commercial air service.",
    "Legislation introduced by Rep. Bill Johnson, R-6th District, and Rep Tim Ryan, D-13th District, would amend H.R.",
    "7282 to say that any public airport in use by an air reserve station should be designated a primary airport.",
    "There’s always ongoing maintenance.”\nThe airport also services charter, corporate and general aviation.",
    "Designation as a primary airport will go a long way in helping with these,” Johnson said.",
    "As it deteriorates, we know we need money to either resurface, repave, fill cracks.",
    "The designation is what the FAA uses to decide how airports qualify for funding.",
    "The designation was removed in 2018 after the airfield lost commercial service.",
    "“In order to keep up with that, the FAA keeps up with pavement studies.",
    "They watch our pavement over the years."
  ]
}