{
  "id": 10670,
  "mediaId": 8278,
  "date": "2022-04-01",
  "headline": "Ryan Lodges Opposition To FirstEnergy’s Youngstown Project",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2021/04/tim-ryan-courthouse.jpg",
  "link": "https://businessjournaldaily.com/ryan-lodges-opposition-to-firstenergys-youngstown-project/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "I ask the Board to instead instruct the company to renew talks with the City of Youngstown and other stakeholders to find an alternative plan.”\nAmerican Transmission Systems unveiled plans last year to string high transmission aerial power lines through downtown Youngstown along the Mahoning River, which would run directly behind the Covelli Centre, Wean Riverfront Park and the Youngstown Foundation Amphitheatre.",
    "Read the full letter Ryan sent to the Ohio Power Siting Board HERE and below:\nDear Members of the Ohio Power Siting Board:\nAs both a resident and Representative of the Mahoning Valley’s 13th Congressional District, I write to voice my strong opposition to the proposed plan by American Transmission Systems (a FirstEnergy company) to construct a six-mile long 138 kilovolt high-tension power line in Youngstown, OH.",
    "In a filing before the Siting Board on March 28, Youngstown Law Director Jeff Limbian stated that the transmission lines would negate future development along the riverfront and “be an enormous detriment and would set back the progress of our community.”\nThe city favors an alternate route or burial of the power lines.",
    "“As both a resident and Representative of the Mahoning Valley’s 13th Congressional District, I write to voice my strong opposition to the proposed plan by American Transmission Systems (a FirstEnergy company) to construct a six-mile long 138 kilovolt high-tension power line in Youngstown, OH,” Ryan wrote.",
    "This stretch of land along the Mahoning River represents many years of collective hard work by local, state, and federal officials—including my office—to secure millions in funding to develop it into an economic driver and quality of life asset for Youngstown’s residents and guests.",
    "“Simply put, marring this beautiful and useful land with an unsightly and disruptive high-power transmission line would do irreparable harm to the City of Youngstown’s immediate and long-term economic development plans.",
    "Simply put, marring this beautiful and useful land with an unsightly and disruptive high-power transmission line would do irreparable harm to the City of Youngstown’s immediate and long-term economic development plans.",
    "In addition, I have worked closely with City officials to help identify and obtain funding to clean and revitalize the Mahoning River in a way that supports recreational and commercial activities.",
    "YOUNGSTOWN, Ohio — U.S. Rep. Tim Ryan, D-13, is urging members of the Ohio Power Siting Board to oppose FirstEnergy’s plan to construct a six-mile long power line through downtown Youngstown.",
    "As you are aware, the proposed route would connect the Lincoln Park Substation to the Riverbend Substation via an aboveground line which follows the north bank of the Mahoning River.",
    "Together the Amphitheatre, Park, and Covelli Center provide vital space for indoor and outdoor events that generate significant and important economic revenue for Youngstown.",
    "I ask the Board to instead instruct the company to renew talks with the City of Youngstown and other stakeholders to find an alternative plan.",
    "The utility says the upgrades are needed in order to improve reliability and increase capacity to downtown and the surrounding areas.",
    "The proposed line would traverse land occupied by the Youngstown Foundation Amphitheatre, Wean Park, and Covelli Center.",
    "Pictured: In this file photo from April 26, 2021, U.S. Rep. Tim Ryan announces his bid for Rob Portman’s Senate seat.",
    "Alternatives might involve a route which avoids the Mahoning River and/or buries the transmission lines.",
    "I am urging the Ohio Power Siting Board to oppose First Energy’s proposed plan.",
    "Thank you for your time and consideration of this important matter.",
    "Published by The Business Journal, Youngstown, Ohio.",
    "Community groups and the city oppose the project."
  ]
}