{
  "id": 11569,
  "mediaId": 2752,
  "date": "2022-03-15",
  "headline": "Ohio GOP Says F**k It, Any Fool Can Carry A Concealed Weapon Now",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTU0MTQ4NC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY3ODQ5MTg2NX0.bErvXWVEt6oHcU3Ee4EFes1AxCk7CRUvi5arAHt2ARg/img.png?width=1200&coordinates=0%2C46%2C0%2C47&height=600",
  "link": "https://www.wonkette.com/ohio-gop-says-f-k-it-any-fool-can-carry-a-concealed-weapon-now",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    0
  ],
  "sentences": [
    "Stanford Law professor John Donohue examined decades of crime data and his analysis revealed that \"violent crime in RTC states was estimated to be 13 to 15 percent higher – over a period of 10 years – than it would have been had the state not adopted the law.”\nDemocrats need to hammer Republicans who pass these Wild West laws as pro-crime.",
    "The enactment of “constitutional carry” or “permitless carry” marks a long-coveted win for the gun rights movement and firearms lobby, and a major loss for Democrats, anti-gun violence activists, police organizations and public health researchers who opposed it.",
    "When the law takes effect in 90 days, all Ohioans aged 21 and older who are lawfully allowed to possess a weapon will be able to carry it concealed on their persons.",
    "A Bastrop County, Texas, sheriff’s deputy was shot multiple times at a gas station Sunday night — twice in the chest and once in the right forearm, shattering it.",
    "After the Boulder, Colorado, gun massacre last March, President Joe Biden demanded that the Senate — yes, the US Senate — act on sensible gun safety legislation.",
    "Gary Wolske, president of the Fraternal Order of Police of Ohio, also criticized the law, which removes the obligation to inform a cop that you’re armed.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Ohio's Democratic House Minority Leader Allison Russo slammed DeWine for signing a law that removes a necessary layer of scrutiny for gun ownership.",
    "Republicans has pinned rising violent crime rates on “progressive prosecutors” who don’t lock away homeless people and drug addicts for life.",
    "Let’s hope Democratic Senate candidate Tim Ryan slams his potential Republican opponents for their support of this blatantly “anti-cop” law.",
    "Prior law required them to undergo eight hours of training, a background check, and an application through their local sheriff.",
    "He specifically urged the Senate to hurry up and pass the two House bills that closed loopholes in the background check system.",
    "Republican-run states have instead loosened gun restrictions, making it even easier for Americans to access death machines.",
    "When a cop is killed in the line of duty, Republicans rush to blame any Democrat who openly supported Black Lives Matter.",
    "Studies have shown that states with right-to-carry handgun laws experience a corresponding increase in violent crime.",
    "Under the current system, thousands of people had concealed carry permits denied, revoked or suspended every year.",
    "Permitless carry laws are the latest gun rage, often in states that are simultaneously making it harder to vote.",
    "Mike DeWine signed a law removing training, background checks, and permitting requirements to concealed carry.",
    "Texas police associations have opposed permitless cary laws, but the GOP serves the NRA, not the public.",
    "Apparently, a mail-in ballot is more lethal (at least to Republican interests) than a concealed weapon.",
    "Only a true fool would think this is in any way a solution to Texas’s increased violent crime rates.",
    "If you’re carrying a gun near your crotch, don’t you want at least a few hours of basic training?",
    "However, we probably should have clarified that we wanted those actions to make sense.",
    "We have to act.”\nThere’s been a great deal of action on guns over the past year.",
    "Republicans are acting as if the only true lethal weapon is an anti-racism book.",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Here’s a thought: Let's not make it easy for anyone to carry around firearms.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "But obviously more guns on the streets didn’t protect Deputy Sawyer Wilson.",
    "He’s expected to survive, thanks to the protective vest he was wearing.",
    "This is how you respond to gun violence in the Bizarro World.",
    "A popular concealed carry position is inside the waistband.",
    "He said: \"This is not and should not be a partisan issue.",
    "He's also on the board of the Portland Playhouse theatre.",
    "The Texas GOP passed a permitless carry law, which Gov.",
    "But Abbott can always just blame illegal immigrants.",
    "Now, you only have to tell a cop if they ask.",
    "Monday, Ohio went full Yosemite Sam when Gov.",
    "His son describes him as a “play typer guy.\"",
    "Please click the clickie, if you are able.",
    "Now, any one of them can freely carry.",
    "Greg Abbott eagerly signed, last fall.",
    "Homicidal recklessness has prevailed!",
    "Follow Stephen Robinson on Twitter.",
    "How often would you like to donate?",
    "He writes reviews for the A.V.",
    "It’s not a time blip, either.",
    "This is objectively stupid.",
    "This is an American issue.",
    "I don’t get these people.",
    "It will save lives.",
    "American lives.",
    "That's you!",
    "Hooray!"
  ]
}