{
  "id": 11898,
  "mediaId": 8473,
  "date": "2022-03-27",
  "headline": "Ohio must reject Ryan once and for all in 2022",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/opinion/letters-to-the-editor/2022/03/ohio-must-reject-ryan-once-and-for-all-in-2022/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In the widely rebuked letter he signed in June 2020, Tim Ryan didn’t attack the violent criminals burning our cities to the ground, he attacked the police officers who have faithfully kept him and his family safe for the 20 years he’s spent holding public office.",
    "It’s clear Tim Ryan’s loyalty lies with the far-left anti-police activists he’s courting as he runs for U.S. Senate and not with the people who risk their own safety every time they put on their uniform to keep our streets safe.",
    "Our safety is in spite of people like Congressman Tim Ryan, who chose to side with radicals seeking to defund our police over the men and women who put their lives on the line every day to keep all of us safe.",
    "Here in the Valley, we haven’t been hit as hard by this spike in violent crime as other parts of the state and country, thanks entirely to the brave men and women of law enforcement.",
    "From small towns to big cities, no community is immune from the 30 percent increase in murder that America witnessed in 2020, the biggest increase in homicide since 1960.",
    "It’s not just Tim Ryan we have to stand against — now members of his office staff are running for lower office to expand his influence on our state.",
    "We saw our great cities overrun with lawless left-wing mobs, looting, pillaging and destroying everything in sight.",
    "Tim Ryan’s policies are a direct threat to the public safety of every resident of the Mahoning Valley.",
    "We must reject Tim Ryan and his anti-police ideology once and for all in 2022.",
    "DEAR EDITOR:\nViolence is running rampant all across our country.",
    "CATHY LUKASKO\nBrookfield"
  ]
}