{
  "id": 11916,
  "mediaId": 8498,
  "date": "2022-03-21",
  "headline": "Ohio University investigates two incidents directed at Black students on campus",
  "image": "https://woub.org/wp-content/uploads/2020/09/OU-Image-scaled-e1599491277344.jpg",
  "link": "https://woub.org/2022/03/21/ohio-university-investigates-two-incidents-directed-at-black-students-on-campus/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Forster",
  "authorUrl": "https://woub.org/post_author/david-forster/",
  "termIds": [
    0
  ],
  "sentences": [
    "University leadership in the Division of Student Affairs, Housing and Residence Life and the Division of Diversity and Inclusion are meeting with residents and staff as well as student leaders from the Black Student Union, the NAACP and the Multicultural Student Organization Coalition to develop additional action items.",
    "“So after finding out it was meant for me it kind of made my heart drop because I’m like, wow, people really think of me like this.”\nIn a news release early Monday afternoon, the university said this was one of two “racially derogatory” actions in two separate residence halls it learned about on Sunday.",
    "“It was kind of a scary moment, I can’t lie, because I have never dealt with anything like this before, and quite honestly I never thought I would have to deal with something like this,” Hamner said.",
    "< < Back to\nATHENS, Ohio (WOUB) — Ohio University is investigating an incident in which a racist note attached to a large garbage bag was left outside a dorm room.",
    "The note, handwritten in black ink on lined notebook paper, includes the words trash, two racial slurs directed at Black people and a vulgarity directed at women.",
    "The stuffed black trash bag was left outside a room in Sargent Hall, two doors down from the dorm room of Naomi Hamner, a 19-year-old freshman who is Black.",
    "The person who urinated on Brown’s door was identified as Brady Linkel, who was charged with criminal mischief by the Ohio University Police Department.",
    "And along with the police investigation, there will be an internal investigation by the Office of Community Standards and Student Responsibility.",
    "Linkel, who is a member of the university’s baseball team, is scheduled to appear in Athens County Municipal Court on March 31.",
    "The other incident involved someone urinating on the door of Christopher Brown, a resident adviser in James Hall.",
    "The university’s office of Equity and Civil Rights Compliance is reviewing the incidents, Leatherwood said.",
    "Brown said in his tweet that he is the only Black resident adviser on that floor of the residence hall.",
    "University spokesperson Carly Leatherwood said the two incidents did not appear to be connected.",
    "Brown tweeted a photo of his floor near the doorway covered in urine-soaked paper towels."
  ]
}