{
  "id": 12320,
  "mediaId": 8473,
  "date": "2022-03-27",
  "headline": "Career politicians like Ryan must be defeated",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/opinion/letters-to-the-editor/2022/03/career-politicians-like-ryan-must-be-defeated/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "I strongly ...\nLatell best to handle Trumbull auditor’s post\nDEAR EDITOR: I have been truly honored to be a public servant for more than 40 years, and I have had the distinct ...\nFoundation starts with God, country, family\nDEAR EDITOR: Sitting quietly in the living room reflecting what has been on the news, three words came to mind.",
    "...\nSupport state bill that promotes electric cars\nDEAR EDITOR: Ohio has a unique opportunity to capitalize on a motivated workforce, growing industry and booming ...\nWarren auditor supports Shay for county office\nDEAR EDITOR: For the first time in two decades, Trumbull County voters will have an opportunity to nominate a new ...",
    "JAN KALAN\nLiberty\nNEWSLETTER\nToday's breaking news and more in your inbox\nLetters to the Editor\nWhy I’m supporting Dolan for US Senate\nDEAR EDITOR: The U.S. Senate primary is set for May 3, and I am strongly supporting Matt Dolan.",
    "...\nWarren violence must come to an end\nDEAR EDITOR: In the early hours of Easter morning, our family heard gunshots outside our northeast-side home.",
    "I believe he knew for years before GM-Lordstown closed that it would happen, yet he sat on it till there was a full-blown fire.",
    "Union dues should go toward negotiations and pay raises, health care benefits, legitimate grievances and retirement pensions.",
    "Tim Ryan is a career politician who attaches his name to many proposals that someone else comes up with.",
    "Josh Mandel is a popular Republican candidate, but I don’t think he’s strong enough to fight the unions.",
    "It’s because of Frank Fuda that Trumbull County is doing better than a lot of other counties.",
    "Another race that concerns me is Trumbull County Commissioner Frank Fuda’s upcoming vacancy.",
    "I am not Republican, but I believe in voting for the best person — not a career politician.",
    "DEAR EDITOR:\nWe need a strong candidate in the Senate race in Ohio who will beat Tim Ryan.",
    "Republican Mike Gibbons seems a lot stronger, and he’s not taking any of your union dues.",
    "But really, they are political dues, and your Democrats are making millions off of you.",
    "Some unions such as police and firefighters are not strong-armed to vote politically.",
    "Paying politicians does not speak for employees or the corporations you work for.",
    "First, shame on the woman who brings false allegations against Frank.",
    "No one can compare to his reputation and dedication.",
    "All you people who pay union dues support Tim Ryan.",
    "Now, more career politicians are seeking his seat.",
    "You pay these dues thinking it will benefit you.",
    "Many families were affected and uprooted.",
    "Because unions support only Democrats.",
    "Why?"
  ]
}