{
  "id": 12421,
  "mediaId": 2728,
  "date": "2022-03-25",
  "headline": "Municipalities face choices as fibre-optic line nears completion",
  "image": "https://www.thestar.com/assets/img/thestar-ribbon.png",
  "link": "https://www.thestar.com/news/canada/2022/03/25/municipalities-face-choices-as-fibre-optic-line-nears-completion.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Boivin",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "First out the gate\nBut there’s another option that won’t require municipal governments to raise a finger to see the last mile completed in their communities – and it will be ready soon after the backbone ‘lights up.’\nColumbia Wireless, an internet service provider that already provides internet to residents in the southern half the valley, plans to connect to at least five ‘point of presence’ drops along the line.",
    "“Approximately 115,000 households in rural, remote and Indigenous communities that are still underserved will now have the same digital economic opportunities as larger urban communities.”\nFew details about how the money will be spent were provided, however, and none of the contacts the Valley Voice spoke to had heard more than the news release revealed.",
    "“This joint record investment of $830 million between the federal and provincial governments means many First Nations communities will have high-speed internet access for the first time – advancing true, lasting and meaningful reconciliation and self-determination,” Lisa Beare, BC Minister of Citizen’s Services announced March 8.",
    "“We are working very closely with CBT and as soon as the fibre is live, we will be connecting to it in multiple locations to deliver more bandwidth to our mountaintop towers, which will immediately increase speeds to all of our existing wireless clients,” says Ben Leslie, the company’s CEO.",
    "With software managing the signal and automating billing, and the fibre itself proving to be low maintenance and low-cost to install, Ryan says it is not only within the ability of communities, it is also do-able financially, as the infrastructure can soon pay for itself.",
    "“But it’s happening in the next 12 months, so we do have to start thinking about this.”\nAnd as they ponder, two different models are emerging – a publicly-owned fibre-to-the-home network in the ground, and a private internet service delivered mostly over the air.",
    "“The first noticeable improvements will be felt by all existing Columbia Wireless clients in just a few short months after the CBT fibre is live for us to use.”\nLeslie says those plans already include Silverton, Nakusp, Slocan and other communities.",
    "“This announcement of funding could have a great effect on that… we’ll have to wait and see how they are going to spend that money.”\nSHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "Municipal leaders in the Slocan Valley - Arrow Lakes region are exploring how best to deliver high-speed internet services to their communities as the fibre-optic trunk line up the valley nears completion.",
    "Each household drop could generate from $1,000 to $1,600 annually, he says, if the utility wanted to charge people in the community what they pay now for for-profit internet and a landline.",
    "The fibre trunk line will already have a ‘point of presence,’ or local access connection, in town, so the Village would only have to lay fibre from the access point to homes and businesses.",
    "Started in 2019, the $10 million Slocan Valley fibre-optic backbone will see high-speed fibre-optic line installed from Playmor Junction in the south to Shoreholme, north of Nakusp.",
    "Ryan talks about a ‘fibre fabric’ being installed by a community along the backbone, installing its own fibre lines and creating its own service according to the community’s needs.",
    "That’s even more likely now that the provincial and federal governments announced $830 million to make sure everyone in BC has equal and full access to high-speed internet by 2027.",
    "Ryan was one of the founders of the Kaslo infoNet Society, which has installed community-owned high-speed fibre-optic line in Kaslo and around the north end of Kootenay Lake.",
    "“These communities have limited resources, so it’s one of the reasons we’ve been hanging back a bit and trying to decide what to do,” says Silverton Mayor Colin Ferguson.",
    "“It’s going to be awesome.”\nLeslie declined to give a lot of details of the company’s rollout and spending plans, citing business confidentiality and partner agreements.",
    "But it is a possibility that small villages like Silverton could find the fund will help them buy the equipment and expertise they need to do the project on their own.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "Ryan has also had talks with officials in Nakusp, and the Village of Slocan just appointed a councillor to look into the KiN proposal, among other options.",
    "“[KiN] operates in positive cashflow, delivers what it promised, to close to 1,000 subscribers, and reinvests its cashflow in the community,” he says.",
    "The public model\nSilverton council met recently with local consultant Tim Ryan to discuss how the community could operate its own internet service.",
    "“Where it makes sense, we can bring fibre to the home, but we also have many other options for bringing fibre-like service to people,” he says.",
    "But he’s confident his company can meet the federally targeted data service levels of 50Mb down and 10Mb up soon after the system goes online.",
    "New money announced\nMore players and schemes to provide last mile service to the Slocan Valley may appear as the backbone project completes.",
    "However, some analysts predict the line could be ‘lit up’ as soon as this spring, bringing more urgency to planning for last mile delivery.",
    "“Just as we build water and power supplies to every property, plan to build and connect fibre along with it,” he says.",
    "“What remains is to create a cable placement plan and service map for endpoints and cable routing,” Ryan said.",
    "Ryan says Silverton is a great location for such a fabric, with its compact, well-laid-out grid of homes.",
    "The Columbia Basin Broadband Corporation said the project would be completed by March 2023.",
    "It’s testing software and hardware now to be ready, says its chief executive officer.",
    "There’s no sense in not doing that,” Silverton Mayor Ferguson told the Valley Voice.",
    "“This will enable us to provide anything anyone wants for bandwidth,” he says.",
    "The community-held service has been proven to work in Kaslo, he says.",
    "“We hope to implement the last mile into people’s homes.",
    "He also runs a company called ComXpertise.",
    "The Star does not endorse these opinions."
  ]
}