{
  "id": 1336,
  "mediaId": 2537,
  "date": "2022-02-15",
  "headline": "Opinion: Disdain for law enforcement in this country must end",
  "image": "https://www.gannett-cdn.com/presto/2021/04/06/PCIN/9dec44d3-dfbf-471d-88f1-2f39ec82c136-cindc5bk-5ia8i91ge7cclipcovn_original.jpg?crop=1999,1125,x0,y98&width=1999&height=1125&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/02/15/opinion-disdain-law-enforcement-country-must-end/6785075001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jane Timken",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "That is why I was proud to work so hard as Ohio Republican Party Chair to ensure Prosecutor Deters’ reelection in 2020, and why I’m very proud to have his endorsement in this U.S. Senate primary, along with the support of many sheriffs and law enforcement officials across the state.",
    "Former Ohio Congresswoman Marcia Fudge, who is now Biden's HUD Secretary, said that \"every single city in this country ought to be thinking about\" defunding the police, while Biden’s own vice president promoted a bail fund for a Minneapolis murderer.",
    "By using the Senate Oversight and Investigative authority, I will ensure the federal government increases its focus on preventing violent crime and sends a clear message to criminals that they will be held accountable.",
    "Ohio Congressman Tim Ryan, my likely Democrat opponent in the U.S. Senate race, has even accused police officers of being a leading cause of death for young men – a totally false and irresponsible claim.",
    "At the same time, left-wing governors and prosecutors, many funded by liberal billionaire George Soros, promote weak bail reform policies that allow repeat violent criminals to go free on the streets.",
    "I also promise to only approve tough-on-crime judges that believe criminals should be off the streets, not on them, and will make sure Democrats can’t touch officers’ qualified immunity protections.",
    "On the campaign trail, I talk regularly with law enforcement, tour sheriff’s departments, and have even done ride-alongs to get first-hand experience of what police officers face every single day.",
    "Biden and Democrats have spent the last two years telling criminals that if they break the law, we won’t punish you, but telling police officers that if they enforce the law, we will punish you.",
    "While it ended peacefully, I was blown away by the split-second decisions these officers have to make and their bravery to run toward danger, rather than away from it.",
    "We can’t have thriving schools or booming businesses without first having safe communities, and we can’t have safe communities without the work of police officers.",
    "The dramatic rise in crime and the escalating violence against police is a direct result of this harmful rhetoric and the unmitigated disaster that is bail reform.",
    "Joe Biden has openly embraced \"defund the police\" advocates into his administration, even from here in Ohio, and Democrats continue to disregard law and order.",
    "Prosecutor Deters knows better than most the Soros-machine that is trying to systematically dismantle law and order in this country, but we have to fight back.",
    "It should go without saying, but the DOJ needs to be more focused on prosecuting violent criminals than prosecuting parents at school board meetings.",
    "Finally, on a more local level, we have to vote out liberal prosecutors and support tough-on-crime prosecutors like Hamilton County’s Joe Deters.",
    "Meanwhile, violent crime spiked across the country as 14 major Democrat-run cities, including Columbus and Toledo, broke homicide records.",
    "There is a war being waged on the police, and beneath this backdrop of violence, lies a silent White House and a complicit Democrat Party.",
    "Defunding only eliminates staff, resources and training while destroying morale and stability of our law enforcement agencies.",
    "As Ohio’s next senator, I fiercely believe that instead of defunding the police, we should be defending the police!",
    "Opinion contributor\nAcross the country, 30 law enforcement officers were shot in the line of duty in January alone.",
    "Jane Timken is a candidate for the United States Senate and the former chair of the Ohio Republican Party.",
    "One ride-along in Toledo resulted in a pursuit of a suspect in a car chase with a child involved.",
    "It’s past time we treat criminals like criminals and police officers like the heroes they are!",
    "One of the major pillars of my Senate platform is ensuring Ohio’s communities are safe.",
    "Instead, we must support law enforcement and strengthen their tools and resources.",
    "As Ohio’s next senator, I will always stand strong for the men and women in blue.",
    "In 2021, intentional killings of officers reached a 20-year high.",
    "Senator will be to kick the Department of Justice into action.",
    "No more demoralizing, denigrating, or defunding the police.",
    "The disdain for law enforcement in this country must end.",
    "One of my top priorities as U.S.",
    "No more fallen heroes."
  ]
}