{
  "id": 13375,
  "mediaId": 2658,
  "date": "2022-03-21",
  "headline": "Trump hoards his war chest and Dem donors unleash millions: 5 takeaways from the latest campaign money disclosures",
  "image": "https://static.politico.com/a4/da/d8abb9b745b99a02003982b58346/https-delivery.gettyimages.com/downloads/1373041852",
  "link": "https://www.politico.com/news/2022/03/21/trump-donors-millions-00019002",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5322,
    1819,
    2612,
    2765,
    3653,
    4694,
    4658,
    476,
    392
  ],
  "sentences": [
    "The big Democrat donors to watch\nIn addition to Eychaner’s big splash with House Majority PAC, Democratic megadonor George Soros’ political committees gave $2.5 million to SMP and $2 million to the super PAC arm of American Bridge, the political communications and research operation that is part of operative David Brock’s sprawling network.",
    "Here are five takeaways from the latest campaign money developments:\nTrump hoards a growing war chest\nTrump’s Save America PAC crossed $110 million in the bank at the end of February, after taking in $3.5 million during the month and spending just $1.2 million.",
    "The next highest tier of fundraisers were all Senate candidates: Sen. Raphael Warnock (D-Ga.), Rep. Val Demings (D-Fla.) and Sen. Mark Kelly (D-Ariz.) each brought in more than $2 million-a-piece, and Rep. Tim Ryan (D-Ohio) raised almost $1 million.",
    "The group — which after opposing Trump during the 2016 primaries has closely aligned itself with him ever since — has spent heavily backing Rep. Ted Budd’s (R-N.C.) Senate bid, as well as Rep. Mo Brooks’ (R-Ala.) struggling campaign for Senate.",
    "ActBlue gives a fundraising preview\nThe online donations processor ActBlue released its monthly report, showing which Democratic candidates brought in the most money online before their own quarterly filing reports reveal their total intakes.",
    "Dem super PACs well stocked as they fight to keep Congress\nThe major Democratic super PACs focused on the House and the Senate continued to rake in money at a healthy clip, even though Democrats are facing a tough political environment.",
    "(The Republican super PACs focused on Senate and House races, the Senate Leadership Fund and Congressional Leadership Fund, are both filing on a quarterly basis and will not have to report their latest numbers until April.)",
    "POLITICO pored over the monthly Federal Election Commission filings for super PACs and party committees, with more outside groups and candidates set to report their first fundraising numbers of the year next month.",
    "Senate Republicans’ campaign arm raised $11.7 million and has $41.6 million in its account, slightly ahead of its Democratic counterpart, while House Republicans raised $10 million and had $85 million banked.",
    "Other top House fundraisers included Speaker Nancy Pelosi and Rep. Adam Schiff (D-Calif.), as well as Marcus Flowers, who’s challenging Rep. Marjorie Taylor Greene (R-Ga.) in a safe Republican district.",
    "Meanwhile, allies of the former president are cementing themselves as part of a new power base in the Republican Party, and Democrats are pouring money into their efforts to retain control of Congress.",
    "Progressive Texas House candidate Jessica Cisneros also brought in over $820,000 online in February, making her one of the highest-fundraising House candidates on ActBlue last month.",
    "He personally gave $3 million to the Club, and Kentucky Freedom PAC — a super PAC that supports Sen. Rand Paul (R-Ky.), and which Yass has funded — gave an additional $2 million.",
    "ActBlue’s Republican opposite, WinRed, does not file its reports monthly, so similar data won’t be available for Republican candidates until the next quarterly deadline in April.",
    "Senate Democrats’ campaign arm raised $15 million and has $37.9 million in the bank, while the House Democrats’ committee raised $19.3 million and had $99.2 million in reserve.",
    "That is more money than both national political parties — the Democratic National Committee and the Republican National Committee — have combined in their main bank account.",
    "One of them, Brand Woodward — the firm of former House counsel Stan Brand — represents longtime Trump aide Dan Scavino, who still draws a check from the leadership PAC.",
    "| Joe Raedle/Getty Images\nBy Brittany Gibson and Zach Montellaro\n 03/21/2022 04:33 PM EDT\nMillions of dollars poured into super PACs and party committees in February.",
    "Trump’s operation has built a mountain of cash typically only seen at the national party groups, but he continues to largely keep the money to himself.",
    "The top recipient, according to a compilation from the nonpartisan California Target Book, was the DCCC, bringing in more than $4 million via ActBlue.",
    "The Club has been active in Republican primaries this year, and it has been the largest outside spender of the cycle so far, according to OpenSecrets.",
    "The filings did, however, reveal substantial payments to two law firms representing high-profile witnesses sought by the Jan. 6 select committee.",
    "The Club for Growth cements its power\nThe Club for Growth continues to expand its influence as one of the power bases of the Republican Party.",
    "The DNC reported $52.9 million in its coffers at the end of the month, while its Republican counterpart had $45.5 million in its bank account.",
    "Protect Freedom recently spent $100,000 on digital ads supporting Harriet Hageman, who is primarying arch-Trump foe Rep. Liz Cheney (R-Wyo.).",
    "Soros also personally gave $500,000 to the Democratic Grassroots Victory Fund, a fundraising arm of the DNC and a group of state parties.",
    "Its largest benefactor continues to be Jeff Yass, who has emerged as one of the most powerful Republican donors in recent years.",
    "Simon joined the board of EMILY’s List, the powerful liberal group that supports “Democratic pro-choice women,” in 2021.",
    "Former President Donald Trump’s operation has built a mountain of cash typically only seen at the national party groups.",
    "These Democrats have mostly cleared the fields in their primaries but also face competitive races come November.",
    "Democrats’ official party committees also had big months, with each buoyed by $5 million transfers from the DNC.",
    "Brand’s counterpart, Stanley Woodward, represents several of the defendants charged with breaching the Capitol.",
    "House Majority PAC brought in $6.6 million, including $5 million from prominent Democratic donor Fred Eychaner.",
    "The committee did not report any new donations or independent expenditures backing Trump-endorsed candidates.",
    "Daniel Bean, an attorney with the other firm, Abel Bean, represents Trump spokesperson Taylor Budowich.",
    "Another major Democratic donor in February was Deborah J. Simon, the heir to a shopping mall empire.",
    "But none of them have as much money as the group controlled by former President Donald Trump.",
    "Senate Majority PAC raised $5.7 million, bringing its cash reserves total to $36.6 million.",
    "She’s now preparing for a run-off election against incumbent Rep. Henry Cuellar on May 24.",
    "Kentucky Freedom also gave $750,000 to Protect Freedom PAC, another Paul-aligned group.",
    "Simon gave $1 million to Bridge’s super PAC, and she also sent $875,000 to the DGVF.",
    "The Club’s super PAC arm brought in $6.6 million and has $26.7 million in the bank.",
    "It was followed by the DSCC with $3.6 million and the DNC with $3.48 million.",
    "Shipping magistrate Richard Uihlein kicked in an additional $1 million.",
    "Simon was one of the largest hard-money donors of the 2020 cycle.",
    "That raised the super PAC’s cash on hand total to $45.8 million.",
    "Trump has done little to spend his largesse around the party.",
    "Kyle Cheney contributed to this report."
  ]
}