{
  "id": 13378,
  "mediaId": 2658,
  "date": "2022-03-21",
  "headline": "Pete Aguilar bets on the House",
  "image": "https://static.politico.com/d7/30/5b6b7df1495d981af834a3624d09/220318-pete-aguilar-getty-773.jpg",
  "link": "https://www.politico.com/news/2022/03/21/pete-aguilar-house-democrats-00018565",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1906,
    4817,
    3804,
    4210,
    2376,
    4984,
    5695,
    1477,
    387,
    6026
  ],
  "sentences": [
    "“I was pretty shocked at his level of understanding of a whip count not just on the Democratic side, but on the Republican side, too.”\nThe two got so close it became a running joke in the House that year that Aguilar’s first name was Hurd, “because people always said like, ‘you got to sign on to Hurd-Aguilar,’” remembered Rep. Derek Kilmer (D-Wash.).",
    "He views himself as a bridge across different factions of the caucus, an attitude that Porter described as a contrast to the “‘it’s my turn’ mentality that can sometimes be present in institutions like Congress.”\n“He really earns his turn,” she added of her caucus ally, who’s also close to their fellow Californian, Speaker Nancy Pelosi.",
    "Rep. Pete Aguilar speaks during a news conference at the U.S. Capitol in Washington, D.C. | Alex Wong/Getty Images\nBy Nicholas Wu\n 03/21/2022 04:30 AM EDT\nDozens of House Democrats are eyeing the exits of a caucus that’s lost its fair share of young leaders in the past.",
    "“From where I’m from, in the shadows of Los Angeles … nobody from my neck of the woods runs for statewide office, so that door has been closed.”\nThe former mayor who flipped a Republican-held seat in 2014 has since used his opportunities to quiet but undeniable effect.",
    "Rep. Tim Ryan (D-Ohio), a Congressional Baseball teammate of Aguilar’s who’s leaving the House to run for Senate, agreed with that assessment as he subtly alluded to his friend’s continued rise: “He’s given me money for my race for Senate and didn’t really have to.",
    "That’s not to say he wants to talk about his own ambitions — he tends to shun national attention and stays surprisingly low-key for a Democratic leadership member who also holds a highly visible perch on the Jan. 6 select committee.",
    "6 spot when leadership vacancies arise, and his easygoing approach is advantageous in a caucus where it’s risky to openly discuss potential leadership races before any of the current leaders entertain their own future retirements.",
    "Still, Aguilar helped orchestrate a discussion session on immigration at the Democratic retreat in Philadelphia in an effort to bring together different ideological camps of the caucus on a policy important to his own community.",
    "He pitched in the Congressional Baseball Game, brought soup to Rep. Dan Kildee (D-Mich.) during a battle with Covid and showed newer arrivals like Rep. Katie Porter (D-Calif.) the ropes on the complex Appropriations panel.",
    "“But he believes in the cause.”\nAguilar’s cross-caucus diplomacy skills are now on full display as he uses his leadership role to help House Democrats more effectively message the goals of the Jan. 6 select panel.",
    "He worked alongside then-Rep. Will Hurd (R-Texas) on a comprehensive immigration measure, and the now-retired Texan recalled Aguilar’s style and tactics endearing him to lawmakers on both sides of the aisle.",
    "But he’s also clear-eyed about the natural limits of his own path, identifying squarely as a House guy while other political animals try to hop to the Senate, gubernatorial or executive-branch species.",
    "House-passed immigration bills have stalled out in the Senate throughout this Congress, and efforts to include immigration legislation in a filibuster-proof party-line vehicle have faltered.",
    "“They worked so well together, people thought his first name was Hurd.”\nHe’s kept up the immigration advocacy since then even as legislative avenues for any major agreement remain elusive.",
    "While many of his colleagues are losing interest in a House that looks increasingly likely to flip them into the minority, the 42-year-old Aguilar wants to stick around.",
    "He’s the highest-ranking Latino member in a chamber that’s seen plenty of other rising Latino leaders leave to pursue higher-profile offices — like New Mexico Gov.",
    "His central role in a bipartisan immigration reform push in 2018 won plaudits from other Democrats, even though the underlying talks never bore fruit.",
    "Aguilar admitted that, as much as he tries to stay progress-minded on immigration, he’s sometimes rattled by the slow pace of change there.",
    "He frequently uses his time at press conferences and bigger meetings to communicate what the House’s insurrection investigators are up to.",
    "Aguilar sits on key panels that manage the House’s inner workings, appropriate funds, and investigate the Capitol riot.",
    "But even a lawmaker prepared to stay put, minority or majority, finds himself disheartened every now and again.",
    "I’m not going to be able to vote for him in any future leadership position, one way or another,” Ryan said.",
    "Michelle Lujan Grisham, Health and Human Services Secretary Xavier Becerra and Sen. Ben Ray Luján (D-N.M.).",
    "“I think that there’s benefit to being a relatively junior House member from California,” he said.",
    "Those immigration negotiations illustrate that Aguilar’s charm isn’t limited to other Democrats.",
    "I want to help the caucus deliver for the country,” he said in a recent interview.",
    "Part of Aguilar’s appeal is that he’s a genuinely nice guy, fellow Democrats say.",
    "“I’m happy to just be someone who’s committed to the House and wants to be here.",
    "Of course, that team-player energy is itself strategically valuable.",
    "“He’s an unbelievable vote counter, too,” Hurd said in an interview.",
    "Aguilar is widely viewed as likely to move up from the No.",
    "But of course, there’s frustration at times,” he said.",
    "And when Aguilar commits, he goes all-in.",
    "Pete Aguilar is the exception.",
    "I want to make a difference.",
    "“I’m an eternal optimist."
  ]
}