{
  "id": 14,
  "mediaId": 2658,
  "date": "2022-02-21",
  "headline": "Tucker Carlson Says Ukraine Isn’t Important. These Key GOP Voters Beg to Differ.",
  "image": "https://static.politico.com/d7/71/33a8c45c483591d7c03821b22232/mag-ohioukraineillo-1.jpg",
  "link": "https://www.politico.com/news/magazine/2022/02/21/ukrainian-american-voters-eye-on-russia-00010148",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1708,
    2273,
    2765,
    3639,
    4851,
    1410,
    6067,
    6569,
    6672,
    6678
  ],
  "sentences": [
    "(Portman has since endorsed Jane Timken, a self-described pro-Trump conservative and former chair of the Ohio Republican Party, who has accused Biden of showing weakness on Ukraine and invoked the Reagan mantra of “peace through strength.”) Liscynesky-Kelleher is careful not to criticize any of the current crop of candidates by name, allowing only that while some have reached out to the Ukrainian community, “for those that haven’t reached out and are saying things that maybe a little education could solve, we would be very happy to welcome them into the fold.”\nIf Futey had his way, Portman wouldn’t retire.",
    "I think your comments not only offend us, Ukrainians, but also the millions of Ukrainian people who have been murdered by the Soviets and Russians throughout the course of history.” Zhybak added that Carlson is a Christian, should act like one and owes Ukrainians an apology, and concluded by apologizing “if I have offended you or the Murdoch family,” which owns Fox News, “in any way.” He received an auto-response.",
    "He regularly watches Carlson’s show, on which the host has declared Ukraine “strategically irrelevant to the United States,” questioned why the United States should side with Ukraine over Russia, and wondered “why the emphasis [in Washington] on Ukraine’s borders and not ours?” Marko says this kind of rhetoric has “gotten his nerves going a little bit,” and that he’s seen Republican friends condemn it on Facebook.",
    "He said the difference between Dole’s GOP and today’s is night and day, where “Bob Dole was day, and this one is night” — Tucker Carlson, he says, has taken Putin’s side, “and there are those, not many, who echo what he says, but many who are silent about it.” (He’s nevertheless gratified that at least among serving members of Congress, the GOP is near-unanimous in its support for Ukraine.)",
    "The company has done this for decades, and calls have picked up in the last few days along with the Russian buildup on Ukraine’s borders; Roman, who joined the business in 1979 and now owns it, came to the United States from Ukraine after living in Poland, where he said Ukrainians hid their identity because of widespread prejudice against them fomented by Russian propaganda.",
    "Futey, an Ohioan who is active in Republican politics, describes most Ukrainian voters here as strong on national defense, anti-socialism and pro-small government — in other words, a natural constituency for a certain kind of Republican, though Futey emphasizes that the state’s Ukrainian community has strong advocates on both sides of the aisle.",
    "Fedynsky, a former high school teacher who once spent summers smuggling dissident literature from behind the Iron Curtain, served as a foreign-policy adviser to Republican Sen. Bob Dole during the Cold War before realizing he was a Democrat; he didn’t share Ronald Reagan’s views on many issues, and liked Jimmy Carter’s human rights policies.",
    "Over borscht and short-rib pierogi at Olesia’s Taverne, an upscale Ukrainian joint in the Cleveland suburb of Richfield, Liscynesky-Kelleher said it’s already too late to stop a war in Ukraine: The war has been ongoing since 2014, when Russia annexed Crimea, and Russian-backed separatists began fighting for control of Eastern Ukraine.",
    "Back in 1994, when Ukraine agreed to remove some 2,000 Soviet nuclear weapons from its territory in exchange for security guarantees from the United States, Russia and Britain, he said, the agreement enhanced the security of the United States “like no other country.” He went on: “We, the United States, said we will honor that.",
    "In 2020, Donald Trump won the heavily Ukrainian Cleveland suburb of Parma — despite his rhetorical resistance to U.S. interventionism and skepticism toward NATO, local Ukrainians point out that he did more than the Obama administration in aiding their ancestral country with lethal weapons against Russian aggression.",
    "There aren’t specific polls on Ukrainian voting patterns in the state, but traditionally these voters made up a “Reagan Republican-like community,” says Andrew Futey, president of the Ukrainian Congress Committee of America, a nonpartisan national nonprofit that advocates for Ukrainian-American interests.",
    "Ohio’s Ukrainians are well-organized and politically active — a Midwestern constituency with a strong working-class element that actually votes in part on foreign policy, and punches above well above its size in their state’s politics, according to many Ukrainian Americans I recently spoke to in Ohio.",
    "Now, Ohio now faces a pivotal Senate race that showcases the exit of a strong pro-Ukrainian voice in the GOP — retiring Rob Portman, who co-chairs the Senate Ukraine Caucus — and the rise of a decidedly un-Reaganesque style of Republican who doesn’t see why Ukraine is any of America’s business.",
    "Contra the Republican populists, a plurality of Americans actually agrees with Biden’s decision to send troops to reinforce NATO countries such as Poland and Romania, though most Americans — and by all indications, Biden, too — think it would be a bad idea to fight Russia directly in Ukraine.",
    "CLEVELAND, Ohio — One chilly day this month, as Russian troops continued their buildup on Ukraine’s borders and Russian warships headed to the Black Sea off Ukraine’s coast, Andy Fedynsky sat in a windowless office in Cleveland, paging through a folder of yellowing papers on his lap.",
    "Marta Liscynesky-Kelleher, president of the United Ukrainian Organizations of Ohio, an umbrella group for more than 50 Ukrainian cultural, political and other organizations in the state, is practiced at explaining why she thinks Ukraine’s fate is very much relevant to America.",
    "Bohdan Danylo, the bishop of St. Josaphat Cathedral, a Ukrainian Catholic church about a mile up the road from the Bodnaruks’ store in Parma, traveled to Ukraine earlier this month for a synod of bishops, and said he was surprised to find people almost at ease.",
    "His organization has pushed policy positions he believes address some of the reservations that Vance or Mandel might have about Ukraine’s significance to America, though neither has reached out to the Ukrainian American community to his knowledge.",
    "If the Senate choice is between an engagement-oriented Democrat like Rep. Tim Ryan, who has called for sending Ohio-built tanks to Poland to deter Russia, or a Tucker Carlson-style Republican like Mandel, Marko doesn’t know whom he will pick.",
    "Some Ukrainian Americans told me the sense of panic being telegraphed over the past week by the Biden administration — which has pulled diplomatic staff out of Ukraine and told Americans to leave — isn’t necessarily shared in Ukraine itself.",
    "“If we, as a birthplace of democracy — and this democracy that is still standing, United States of America … if we think that today those principles are not defended by peace-loving and freedom-loving Ukrainians, we are mistaken,” he says.",
    "No.”\nFedynsky is a prominent member of Ohio’s Ukrainian American population, one of the largest in the nation, and one that happens to reside in a key political battleground state that could help determine control of the Senate this year.",
    "We paused over a century-old pamphlet from the Paris Peace Conference of 1919, topic: Les Problèmes Nationaux de Ukraine, written in an era when Ukraine was fighting for independence before being absorbed into the Soviet Union.",
    "But it also threatens to alienate an entire community of Americans who, in my conversations in Ohio this month, denounced the isolationist forces they see in U.S. politics, whether on the populist right or the progressive left.",
    "Ohio has some 80,000 Ukrainians, both immigrants and their descendants, a community forged in part by waves of refugees who fled earlier crises in the Old Country: World War I, World War II, Nazi occupation, Soviet occupation.",
    "This is perhaps a winning message for some of the GOP base, and it’s one that other prominent Republicans, including Missouri Sen. Josh Hawley, have taken up in a departure from the party’s longstanding hawkishness on Russia.",
    "They even attracted the ire of the pastor at a Ukrainian Catholic parish in Youngstown, Ohio, about an hour from Parma, who posted on Facebook a letter he told me he sent to the Fox News host via a “Viewer Feedback” web form.",
    "On this particular Tuesday, he had dug out materials from the 1938 crisis in Eastern Europe — when the Munich Agreement offered up a piece of Czechoslovakia to the Nazis, and Neville Chamberlain vowed peace in our time.",
    "Futey says his own vote in the Senate race would come down to who makes it out of the primaries and where the candidates stand on both foreign and domestic issues; he has sometimes supported Democrats in the past.",
    "Liscynesky-Kelleher has an 80-year-old aunt in the eastern city of Donetsk who has spent the whole period hunkered down under Russian occupation, unable to so much as FaceTime with relatives in the United States.",
    "Fedynsky himself was born in a refugee camp in Austria in 1947; just outside his mom’s home village in Ukraine, Strilkivtsi, dozens of Jews had survived the Nazis by hiding in an underground network of caves.",
    "“The reason why I am writing to you is to express my disdain at your seemingly biased anti-Ukrainian statements that you recently made on your shows regarding the current conflict between Ukraine and Russia.",
    "Marko told me he voted for Trump in both 2016 and 2020, but struggled with the decision because of Trump’s rhetoric; many of his Ukrainian-American acquaintances ultimately supported Trump over Biden.",
    "Liscynesky-Kelleher told me she expected whoever takes the open Ohio Senate seat “to walk in the footsteps of Senator Portman,” and she notes that the GOP primary is still more than two months away.",
    "Both told me they’re satisfied with Biden’s response to the crisis so far, and both admire Marcy Kaptur, the Democratic co-chair of the Congressional Ukraine Caucus, whose district includes Parma.",
    "(Most of Ohio’s primary polls are not independent, so aren’t a perfect picture of who’s really in the lead, though Mandel and Vance have drawn more national media attention than other candidates.)",
    "Vance, who respectively occupy near-top and near-bottom slots in the latest polling on the Senate race, have both suggested the United States should focus on its own border rather than Ukraine’s.",
    "“I mean, this has been sitting here for decades, and I’m looking at it,” Fedynsky mused, glancing back down at a page from an information service of the era called the Press Bureau of Ukraine.",
    "As a member of a religious community, Danylo said he believes in peace, dialogue and coexistence — but he also believes Putin wants to exert Russian influence over former Soviet satellites.",
    "When I popped into the Ohio Export Corporation, a shipping service in Parma, Roman Bodnaruk and his son Marko were busy sending humanitarian aid to Ukraine — vitamins, clothing, money.",
    "As for the current field, the Ukrainian Congress Committee of America president recognizes that some candidates might be using the Ukraine issue to reach a certain base in the primary.",
    "Their friends, their family members, their very ideals are under tangible threat — and they are watching closely to see how American officials and political candidates respond.",
    "Fedynsky is the director of the Ukrainian Museum-Archives, one of America’s largest collections of Ukraine-related literature and cultural artifacts stretching back centuries.",
    "At the archives, Fedynsky guided me through shelves and shelves of gray boxes filled with fragile papers and pamphlets, on topics like Judaica, Economics, Chernobyl, Sports.",
    "“We, not just the United States, but the West … spent trillions of dollars and lost hundreds of thousands of people in different wars through the Cold War,” Fedynsky says.",
    "The cost has been some 14,000 Ukrainian lives, more than five-fold the U.S. troop losses in Afghanistan, along with economic devastation and the displacement of millions.",
    "“Most of the history of Ukraine is never a history of taking someone else’s land, but rather defending its own,” he told me over the phone when he came back.",
    "During the 2020 election, he says, one client, during what started as a friendly chat about politics, got agitated and called the then-president an idiot.",
    "The latest statement from Futey’s organization takes implicit aim at the Biden administration, too, calling for immediate new sanctions on Russia.",
    "It’s freedom, democracy, free enterprise, capitalism.”\nFor Fedynsky, Ukraine’s sovereignty isn’t just about Ukraine; it’s about America, too.",
    "I called him to check in a few days after my visit, by which point the White House was warning Putin could launch an attack any day.",
    "For him, for many others here, Ukraine’s hard-earned sovereignty is not some abstraction irrelevant to daily life in Middle America.",
    "He and Marko both consider themselves Republicans, and they’re the kind of Ukrainian-Americans who now find themselves conflicted.",
    "He went on to work for then-Rep. Mary Rose Oakar (D-Ohio) as the Soviet Union fell and Ukraine achieved independence in 1991.",
    "In Ohio specifically, the loudest such voices are currently coming from the right — to Republicans’ potential peril.",
    "“Isolationism absolutely, absolutely is not something the community grasps or will ever support,” Futey says.",
    "And compared to the 2014 Russian incursion, he said, this time Ukraine is more ready to defend itself.",
    "“Hello Mr. Carlson!” wrote Lubomir Zhybak, who moved to the United States from Ukraine a decade ago.",
    "(Neither the Mandel nor the Vance campaigns responded to messages seeking comment for this article.)",
    "But he also recalls customers telling his father they would stop being Republican because of Trump.",
    "Futey emphasizes that the community is not asking for U.S. troops to actually fight in Ukraine.",
    "In America, he was shocked to find that his aunt and uncle could speak Ukrainian in public.",
    "And there are echoes of Reagan in how he describes the stakes in Eastern Europe now.",
    "But other Cleveland-area Ukrainian Republicans publicly backed President Joe Biden.",
    "And if America means anything, it’s democracy, freedom and keeping our word.”",
    "But they do want U.S. support, and they do want Vladimir Putin to be stopped.",
    "“I don’t think Putin’s going to attack, but I mean, we’re waiting,” he said.",
    "Carlson’s comments on Ukraine have become a flashpoint for many Ukrainians.",
    "But isolationist strains in the GOP have rattled some in the community.",
    "“We can’t afford to be isolationists,” she says.",
    "“Feed the bear and he’ll be satisfied?",
    "Candidates Josh Mandel and J.D.",
    "Well, it’s not a banal thing.",
    "This ended in war,” he said.",
    "“And we won.",
    "For what?",
    "“Yeah."
  ]
}