{
  "id": 15416,
  "mediaId": 2584,
  "date": "2022-03-06",
  "headline": "Wave of House Democratic retirements stokes fears for party’s election prospects",
  "image": "https://i.guim.co.uk/img/media/e9adee420c4c49011d931fc10587aaa9f04751d2/0_147_4417_2651/master/4417.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=08e4094b5db62d8197b5b9c8535f5f1a",
  "link": "https://www.theguardian.com/us-news/2022/mar/06/democrats-retirements-election-2022-brenda-lawrence",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lauren Gambino",
  "authorUrl": "https://www.theguardian.com/profile/lauren-gambino",
  "termIds": [
    0
  ],
  "sentences": [
    "Lawrence, who represents a heavily Democratic district and is the only Black member of Michigan’s congressional delegation, said she “feels good” about her legacy and would continue to be active in her community in other ways: “I’m not going home to plant flowers.”\nShe hopes her departure will make room for a new generation of Black lawmakers, who will bring fresh urgency to the battles over women’s reproductive rights, voting protections and police reform.",
    "“There’s no way, at least for me in this election cycle, but there may be a path for other worthy candidates.”\nJohn Rogers, a Republican pollster who was the executive director of the National Republican Congressional Committee during the 2018 midterm elections cycle, says the retirements of powerful and long-serving Democrats is a strong sign that the party is bracing for defeat in November.",
    "And Republicans, they say, will have to answer for Trump’s enduring control over their party and the fallout from the congressional investigation into the events of January 6, as well as for their efforts to restrict access to abortion and the ballot, issues Democrats believe will rally voters to their side this cycle.",
    "He has received rare bipartisan praise for his handling of the crisis in Ukraine and Democratic voters are excited about his nominee for the supreme court, Ketanji Brown Jackson, who is poised to become the first Black woman to serve on the bench after her confirmation hearings later this month.",
    "“However bad it is to serve in Congress, it’s worse to serve in the minority,” Kondik said, “particularly in the House.”\nNotably bucking the trend, the House speaker, Nancy Pelosi, has announced her decision to run again, extinguishing speculation that she would retire at the end of the term.",
    "“This redistricting in our state and a lot of states is turning out not to be quite the windfall for them that they thought.”\nThough Democrats have fared far better than expected in the redistricting process, it was still a factor in some decisions to retire or seek another office.",
    "But he said that by embracing Trump’s lies about election fraud and refusing to sanction their most extreme members, Republicans are helping frame the election as a choice between “two parties with very different priorities, one of which is going to wind up in charge”.",
    "With Biden’s sagging approval ratings, Democrats’ agenda stalled, public discontent over the economy and inflation, and Republicans’ strong performance in a series of off-cycle elections, the political landscape looks grim for the party in power.",
    "But leaders say hope remains\nFor the Michigan congresswoman Brenda Lawrence, it was a question from her husband: “When is our time?” For the North Carolina congressman David Price, it was the judgment that “the time has come” to step down.",
    "“The number of retirements is naturally higher in years that end in ‘two’ because those are redistricting cycles,” said Kyle Kondik, the managing editor of Sabato’s Crystal Ball at the University of Virginia Center for Politics.",
    "“There are too many committee chairs retiring for this to be just about redistricting,” he said, adding that the prospect of losing a gavel or ending a lengthy career in the minoritywas unattractive to some politicians.",
    "Retirements deprive a party of the advantages that come with incumbency: fundraising, name recognition and a deep understanding of their constituency, factors that are especially critical in competitive seats.",
    "“But I came in with the intent to make a difference, and I hope that that continues to motivate American citizens to step up into public service – because there is work to do.”\n… we have a small favour to ask.",
    "Announcing his decision to retire last year, the Wisconsin congressman, Ron Kind, was frank: “The truth is, I’ve run out of gas.”\nThe decision not to seek re-election is both deeply personal and political.",
    "“Most midterms by their nature are referenda on a party of power,” said Ian Russell, a Democratic strategist and former national political director with the Democratic Congressional Campaign Committee.",
    "Last month, Lawrence, the Michigan congresswoman, surprised some of her colleagues when she announced that she would retire at the end of the term, after more than three decades in public service.",
    "Price’s new district is rated safely Democratic, and after a long redistricting battle, the North Carolina state supreme court recently approved congressional maps that are favorable to the party.",
    "Among them, eight Democrats are seeking other offices next year, like Tim Ryan of Ohio, who is running for the Senate, and Karen Bass of California, who is running to be the mayor of Los Angeles.",
    "Some retiring members are powerful veterans,such as Kentucky’s John Yarmuth, chair of the budget committee and Oregon’s Peter DeFazio, chair of the transportation and infrastructure committee.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "On Monday, the Florida congressman Ted Deutch announced that he would not seek re-election, bringing the total number of Democratic departures from the House so far this cycle to 31.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "“Incumbency is not as valuable as it used to be,” said Kondik, author of The Long Red Thread: How Democratic Dominance Gave Way to Republican Advantage in US House Elections.",
    "“I explored every possible way, including lawsuits, to stop the gerrymandering and to win one of the three new congressional districts that now divide Nashville,” he said.",
    "Among them are more moderate members including Adam Kinzinger of Illinois and John Katko of New York, who have faced conservative backlash for voting to impeach Trump.",
    "Still, others cite the rise of political extremism and the deteriorating relations between members of Congress, particularly in the wake of the January 6 insurrection.",
    "“But open seats are generally harder to defend, particularly in a wave-style environment.”\nNot since 1992 have so many House Democrats opted not to seek re-election.",
    "In polling that asks voters which party they would support on an election day – as opposed to which congressional candidate – Republicans repeatedly hold the edge.",
    "Congressman Jim Cooper witnessed his reliably Democratic Nashville seat being carved up into three different districts that Trump would have easily won in 2020.",
    "During the Trump years, he said many long-serving Democrats postponed the decision to retire because they believed their experience was needed on Capitol Hill.",
    "“Retire or lose.”\nThough many vacancies are in safely Democratic districts, the rush of retirements come as the party faces significant historical headwinds.",
    "But as the party braces for a grueling midterm election in November, a rising number of House Democrats are opting not to return to Congress next year.",
    "A day after the Tennessee legislature approved the map, Cooper announced his retirement from Congress, where he had served for more than three decades.",
    "The party lost 41 seats that year, and Democrats gained control of the chamber, in an election cycle widely viewed as a referendum on Donald Trump.",
    "And with states still finalizing their congressional maps and candidate filing deadlines approaching, there might be more retirements to come.",
    "Some retiring Democrats have blamed the gridlock and dysfunction on Capitol Hill while others point to the redrawing of congressional maps.",
    "Adding to the uncertainty is the once-a-decade redistricting process when a state’s congressional and legislative districts are redrawn.",
    "“After four years of Donald Trump’s administration, Covid, January 6, it was a death by a million cuts,” she said in an interview.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "In an interview, Price, 81, said his decision leave Congress after three decades was “mainly personal” and not circumstantial.",
    "“Their majority is doomed,” the National Republican Congressional Committee (NRCC) spokesman, Mike Berg, said recently.",
    "As of this week, 15 House Republicans have said they won’t run for re-election, with seven running for another office.",
    "Others represent politically competitive districts, like Stephanie Murphy of Florida and Ann Kirkpatrick of Arizona.",
    "In 2018, dozens of House Republicans did not seek re-election, including the then House majority leader, Paul Ryan.",
    "Republicans are trumpeting each retirement as a sign that Democrats’ hopes of keeping their majority are fading.",
    "The House is often a reflection of the national American mood, which public opinion polls show is pessimistic.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "Biden has started to ramp up his travel around the country touting his legislative accomplishments.",
    "And in the House, Democrats can only afford to lose a handful of seats before surrendering control.",
    "He decried the move as “raw politics” and an effort to dilute the electoral power of Black voters.",
    "The Covid-19 pandemic appears to be in retreat, and the economy remains strong, despite inflation.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "Pelosi was re-elected as speaker after agreeing to step down from the role by the end of 2022.",
    "Voters are frustrated with their political leaders and the party is bracing for a backlash.",
    "Congressional retirements are often an early sign of a wave election – for the other party.",
    "Thirty-one Democrats, a modern record, are stepping down as the party risks bleak midterms.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "“I would suggest they don’t bring out the champagne quite yet,” he said of Republicans.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "The president’s party almost always loses seats in the midterm elections.",
    "Democrats argue that much could change before the November elections.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "The Republican retirements, though far fewer, are also telling.",
    "“I came into Congress when we were in the minority,” she said.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "If there were ever a time to join us, it is now.",
    "This year, the political winds are reversed.",
    "It’s been a brutal experience for some.",
    "It’s a worrying trend for Democrats.",
    "Now they feel the time is right.",
    "Thank you.",
    "?"
  ]
}