{
  "id": 15821,
  "mediaId": 4032,
  "date": "2022-03-14",
  "headline": "On Gas Prices, “The Memo Has Gone Out.” It’s “Putin’s Price Hike”",
  "image": "https://thenewamerican.com/assets/sites/2/putin-7.jpg",
  "link": "https://thenewamerican.com/on-gas-prices-the-memo-has-gone-out-its-putins-price-hike/?pk_campaign=feed&pk_kwd=on-gas-prices-the-memo-has-gone-out-its-putins-price-hike",
  "mediaOutlet": "New American",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Murphy",
  "authorUrl": "https://thenewamerican.com/contributor/james-murphy-2/",
  "termIds": [
    0
  ],
  "sentences": [
    "I support punishing Putin with a ban on Russian oil imports to the U.S., and I support this bipartisan legislation to increase production and use of Made in America biofuel to help lower costs for Wisconsinites who face Putin's price spike at the pump.https://t.co/lNJeRXmZlu\n— Sen. Tammy Baldwin (@SenatorBaldwin) March 9, 2022\nRepresentative Tim Ryan (D-Ohio) attacked the Evil Putin this way:\nToday I’ll vote to ban U.S. dollars from funding Putin’s war machine.",
    "Like most, the Climate Power Twitter feed parroted Biden’s line without putting it between quotation marks, meaning that it was, in fact, “Putin’s Price Hike”:\nPutin’s price hike “should motivate to us accelerate to a transition of clean energy.”\nWATCH: @POTUS explains why clean American energy is critical to lowering prices and achieving real energy independence while countering Putin and other dictators around the world.",
    "As the National Review’s Matthew McLaughlin put it, “the memo has gone out.”\nThe Democrats and their leftist Media Information Ministry will hereafter refer to stratospheric gas prices as “Putin’s Price Hike.”\n— Dan McLaughlin (@baseballcrank) March 9, 2022\nThe Speech\nThe propaganda whirred to life on March 8 when Biden announced the ban in the Roosevelt Room of the White House.",
    "“I support punishing Putin with a ban on Russian oil imports to the U.S., and I support this bipartisan legislation to increase production and use of Made in America biofuel to help lower costs for Wisconsinites who face Putin’s price spike at the pump,” Senator Tammy Baldwin of Wisconsin tweeted.",
    "https://t.co/NrD6llEgOY\n— Rep. Mike Thompson (@RepThompson) March 9, 2022\nABC News was all in for bashing the Russian president and blaming him for the gas prices that Biden himself caused, just like he gave us almost eight-percent inflation.",
    "“The consensus view among economists is that sustained inflation occurs when a nation’s money supply growth outpaces economic growth,” as Investopedia explains:\nAn increase in the supply of money is the root of inflation….",
    "“Inflation is made in Washington, because only Washington can create money,” free market economist Milton Friedman explained long ago:\nAnd any other attribution of it to other groups of inflation is wrong.",
    "The narrative began, it appears, last week when President Joe Biden announced his ban on Russian gas and oil imports and blamed out-of-control gas prices on Russian President Vladimir Putin.",
    "— Congressman Tim Ryan (@RepTimRyan) March 9, 2022\n“Let’s be clear: this is Putin’s price hike,” Representative Mike Thompson (D-Calif.) fumed:\nLet’s be clear: this is Putin’s price hike.",
    "Now we must do everything in our power to shield working people from Putin’s price hike at the pump by fully restoring America’s energy independence and passing a working-class tax cut.",
    "Now we must do everything in our power to shield working people from Putin’s price hike at the pump by fully restoring America’s energy independence and passing a working-class tax cut.",
    "WATCH: @POTUS explains why clean American energy is critical to lowering prices and achieving real energy independence while countering Putin and other dictators around the world.",
    "After claiming he’s “on track to be the first President in history to lower the deficit by over $1 trillion in one year,” Biden delivered this whopper:\nSo, I’m sick of this stuff.",
    "Government Spending Does Not Cause Inflation\nThe other major problem that neither Biden nor the Democrats are responsible for is soaring inflation, now running at 7.9 percent.",
    "pic.twitter.com/6HKE5gX2SP\n— The Hill (@thehill) March 12, 2022\nYes, it is, and government is not “reducing the national debt,” which is well past $30 trillion and rising.",
    "pic.twitter.com/BmJo5z9SYk\n— Kristina DAmours (@KristinaD_WWLP) March 9, 2022\nFor the record, the price for a gallon of gas ranges from $4.325 (regular) to $5.131.",
    "Since Putin began his military buildup on Ukrainian borders, just since then, the price of the gas at the pump in America went up 75 cents.",
    "“Today’s national gas price breaking records, averaging $4.17 per gallon.”\nGas lines as ‘Putin’s price hike’ hits Western Massachusetts.",
    "@SpeakerPelosi: \"When we're having this discussion, it's important to dispel some of those who say, well it's the government spending.",
    "In coordination with our partners, we’ve already announced that we’re releasing 60 million barrels of oil from our joint oil reserves.",
    "“The decision today is not without cost here at home,” Biden said:\nPutin’s war is already hurting American families at the gas pump.",
    "We have to talk about it because the American people think the reason for inflation is the government is spending more money.",
    "“Gas lines as ‘Putin’s price hike’ hits Western Massachusetts,” NBC’s WWLP22News in Springfield, Massachusetts, tweeted.",
    "Biden: \"I'm sick of this stuff … the American people think the reason for inflation is government spending more money.",
    "Three days after pinning the blame for high gas prices on Putin, Biden spoke at the House Democrats issues gathering.",
    "High gas prices are the result of rapid shifts in supply & demand due to COVID & Putin’s illegal invasion of Ukraine.",
    "What produces it is too much government spending and too much government creation of money.”\nH/T: Legal Insurrection",
    "Economists agree about what causes inflation: the government’s printing money and pouring it into the economy.",
    "But that didn’t stop House Speaker Nancy Pelosi from delivering an even more inexplicable and amusing claim.",
    "“It’s important to dispel some of those who say, well it’s the government spending,” she said:\nNo, it isn’t.",
    "https://t.co/u85agBu06n\n— ABC News (@ABC) March 9, 2022\nThe memo even went to local network affiliates.",
    "pic.twitter.com/vzH67MDGkE\n— Climate Power (@ClimatePower) March 8, 2022\nNext day, the Democrats began.",
    "But at least they attributed the remarks:\n“Putin’s price hike” will be borne by American consumers.",
    "Consumers are attaching stickers that feature Biden’s photo and say “I did that” to gas pumps.",
    "pic.twitter.com/Xak7CKTjFs\n— RNC Research (@RNCResearch) March 11, 2022\nActually, it is true.",
    "It’s time to work together to find solutions, not exploit this crisis for political gain.",
    "Putin's price hike \"should motivate to us accelerate to a transition of clean energy.\"",
    "Half of that — 30 billion — million — excuse me — is coming from the United States.",
    "The government spending is doing the exact reverse, reducing the national debt.",
    "The government spending is doing the exact reverse, reducing the national debt.",
    "I’m going to do everything I can to minimize Putin’s price hike here at home.",
    "Today’s national gas price breaking records, averaging $4.17 per gallon.",
    "Today I’ll vote to ban U.S. dollars from funding Putin’s war machine.",
    "\"Putin's price hike\" will be borne by American consumers.",
    "And with this action, it’s going to go up further.",
    "Democrats turned on the spin cycle.",
    "[M]oney loses its purchasing power.",
    "Foreign sheiks don’t produce it.",
    "Trade unions don’t produce it.",
    "Oil imports don’t produce it.",
    "Consumers don’t produce it.",
    "Producers don’t produce it.",
    "Check out the story here!",
    "It is not inflationary.\"",
    "It is not inflationary.",
    "Simply not true!\"",
    "Simply not true.",
    "No, it isn't.",
    "??",
    "."
  ]
}