{
  "id": 15862,
  "mediaId": 2550,
  "date": "2022-03-06",
  "headline": "Texas primary recap and a look at open Democratic House seats (transcript)",
  "image": "https://images.dailykos.com/images/1008854/story_image/beto-orourke.jpeg?1637207796",
  "link": "https://www.dailykos.com/stories/2022/3/3/2083627/-Texas-primary-recap-and-a-look-at-open-Democratic-House-seats-transcript?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5061,
    1847,
    2440,
    2742,
    3653,
    4596,
    4591,
    1477,
    6653
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nTexas primary recap and a look at open Democratic House seats\nThe Downballot\nFollowShare\n0:0037:51\n15301xMar 03, 2022\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nDavid Nir:\nBefore we get to today's regular programming, we want to take a moment to recognize the situation in Ukraine and to criticize in the strongest terms we possibly can Vladimir Putin's illegal invasion of this peaceful, democratic nation.",
    "It's very unclear if this is exactly legal compared to what the Oklahoma law says, but there's also really no one who's going to be challenging it in court because there's no real sort of avenue for someone to be like... unless the state of Oklahoma decided not to hold it, which they're going to do, there's no real avenue to challenge it, so he's going to just sort of be in this very strange lame duck position for any number of months.",
    "David Nir:\nAnd now one other twist to the open seat roster in a redistricting year that we hadn't mentioned yet, are brand new districts created because of reapportionment and Texas was the biggest winner in the reapportionment sweepstakes as a result of the 2020 census and strong population growth, almost all of which, by the way, was among people of color, Texas added two brand new Congressional districts.",
    "David Beard:\nExactly everyone sort of pre-running before the final map is drawn because they know there will be a seat here and we've got State Senator Randolph Bracy, who is probably the most well known from an elected official perspective, but he's running up against a 24 year old newcomer who is an ACLAU organizer named Maxwell Alejandro Frost, who raised significantly more money than the state Senator.",
    "On the latest episode of The Downballot, David Nir and David Beard recap the action from Texas' Tuesday primaries, including the runoff between conservative Democrat Henry Cuellar and progressive challenger Jessica Cisneros; the demise of Louie Gohmert's political career; and the shocking developments in Texas' 3rd Congressional District, where a new scandal derailed an unexpected runoff.",
    "David Nir:\nSo we've taken a look at some primaries that have already unfolded or races where there won't even really be much in the way of a contested primary, but we have many more seats where there are in fact very interesting primaries going down, like Beard said earlier, simply too many for us to share with you in today's episode though, we will definitely hit them in the future.",
    "Paxton with almost all the votes tallied led Bush by a 43-23 margin, a former state Supreme court justice Eva Guzman took 17%, but perhaps the most delightful result of all is the fourth place finisher, Congressman Louis Gohmert, who you might know as the most adult member of Congress, even John Boehner once called him insane and said, he doesn't think there's a brain up there.",
    "David Beard:\nAnd it'll be interesting to see in a race this close there's both the question of who the 5% of supporters who voted for third party candidate, community organizer, Tanyya Benavides will go to, but then there's also the question of turnout in a race this close in a primary runoff in particular, you can see very, very low turnout numbers.",
    "This is the seat that Val Demings, who Beard mentioned earlier is running for Senate, she's leaving this district open and while Republicans have a whole bunch of competing maps, and it's not exactly clear what's going to happen, there's almost certainly going to be a pretty strongly democratic seat in the Orlando area, no matter what happens.",
    "David Beard:\nAnd we've definitely seen that before where politicians facing a tough race or a tougher race retire in what you would think of as sort of the prime of their careers to fight another day to sort of not want to take a bad loss so that they are seen as still a good candidate for statewide office or something else down the road.",
    "There's a couple of other examples where it's less clear because particularly in Ohio and Florida, because those maps aren't finished right now, but Tim Ryan who represents a Northeast Ohio district, Ohio 13, he decided to run for Senate, and there was a lot of speculation that was at least in part because his district was at risk.",
    "David Beard:\nSo let's start by looking at potentially why some of these retirements took place since it's a redistricting year, obviously a lot of districts have changes, some of them have very small changes that probably wouldn't affect a Congressman or congresswoman's decision of whether or not to run again.",
    "The co-hosts also embark on a deep dive into the world of Democratic open seats in the House, discussing the role of redistricting in prompting retirements and the many ways in which primaries this year have the chance to move the party in a more progressive direction and increase its diversity.",
    "The person who was already running, who had been primary in Yarmuth before he announces retirement is state representative Attica Scott, she was the first black woman elected to the Kentucky general assembly this century, she had already been in the race, as I mentioned before Yarmuth retired.",
    "You alluded to this earlier, but sometimes these seats pop open because one party is in control of the cartographers’ pen and totally revamps things so much that the existing incumbent either decides to retire, or in this case with Rodney Davis simply runs somewhere else that's more favorable.",
    "And we've got eight representatives who are doing that on the Democratic side this year, largely to run for Senate, we already talked about Tim Ryan, similarly, Peter Welch in Vermont is going to be running for Senate, Connor Lamb is running for Senate in Pennsylvania, Val Demings in Florida.",
    "He supported the creation of the Jan. 6 commission, which of course earned him the scorn and hatred of Republicans like Keith Self for supporting among other things the Jan. 6 commission, though he later tried to claim that he only voted for it because he wanted to investigate Nancy Pelosi.",
    "It's currently represented by a Republican Rodney Davis who is running in a different seat because this seat has become much more democratic because it takes basically a lot of the democratic air areas of central and Southern Illinois to create a democratic cleaning seat.",
    "The woman who had an affair with Taylor is named Tanya Joya, and she had been in the headlines because her former husband, I should say her widow, a man born with the name John Georgellas, but who changed his name to Yaha Alba Rumi, became a notorious figure in ISIS.",
    "David Beard:\nAnd one other story I wanted to highlight for the weekly head that's not in Texas, just before we move to our deep dive of the week is in Oklahoma, just a little bit to the north where Senator Jim Inhofe confirmed reports that he's going to be resigning.",
    "The question now is whether folks who would rather have an attorney general who is not under indictment rally around Bush, or whether the Trump endorsement that Paxton received is enough to ensure that he wins a majority on May 24 when the runoff takes place.",
    "That's a large part of why he got only 43% when he is an incumbent, but even if he's able to consolidate Guzman's support, which you can kind of think of as conceivable, I think it's hard to imagine that Gohmert and Bush's supporters really align too much.",
    "It's a very strange situation though it happened in 2014 in Oklahoma as well, when late Senator Tom Coburn, well, he wasn't late at the time when Republican Senator Tom Coburn pulled the same thing, announcing his resignation many, many months in advance.",
    "That doesn't seem terribly likely to work out well for him, but you never know, I guess, but that's leaving an open seat where Suozzi was really a relative moderate, there's a potential to move a more progressive direction with a couple of the candidates.",
    "It is, as I said, based on Long Island, but after redistricting, it now takes in a portion of the Bronx and Westchester, just north of New York City, which just happened to include Biaggi's home base and probably quite a few democratic primary voters.",
    "That's a very popular avenue, we've also got a couple of more oddball ones where Anthony Brown in Maryland is running for Attorney General, which is a statewide office, so in some ways it's step up, but it's not one of the premier statewide offices.",
    "Again, we don't know that with absolute certainty, the way you can know that with Cooper, where he basically came out and said, \"I don't have a district anymore,\" but there was certainly one of the reasons that she, you may have decided to retire.",
    "David Beard:\nWhat's strange is that Oklahoma has a setup where, if a Senator resigns, and what would normally happen is that the governor can appoint a temporary Senator to fill the term until the special election takes place in November.",
    "Most notably state Senator Alessandra Biaggi, who came to prominence as one of the candidates who defeated the IDC back a few years ago, which was a sort of Republican aligned group of democratic senators in the New York state Senate.",
    "And there had been a lot of fear among Democrats that Republicans in the Kentucky legislature would try to crack this city of Louisville, just like their counterparts in Tennessee did with Nashville, but the GOP stayed its hand.",
    "This is a seat in south Texas centered around Laredo, but stretching all the way up to the outskirts of San Antonio, where Henry Cuellar is easily the most, or certainly one of the most, conservative Democrats left in the House.",
    "Her husband died some years ago, it's not clear exactly when or where, but the real detail here is that she also accused Taylor of giving her $5,000 on quote, \"On the condition you don't tell anyone about their involvement.\"",
    "And we will start with New York, Long Island in particular, which is undergoing a big refresh, three of the four Congressional districts located on Long Island in the New York City Metro area are going to be open this year.",
    "This one was a little bit interesting because it was a primary fight between what seems like the two wings of the today's GOP, which maybe you would call sort of the post-Trump establishment versus the Ted Cruz fanatics.",
    "And there are definitely quite a few more of those on the Democratic side than on the Republican side, for the GOP there's, maybe about seven or eight of those true retirements of people who are just calling it a career.",
    "It certainly presaged that year's blue wave, but there is also an upside to open seats because it gives the Democratic party a chance to bring in new blood and often to move the party in a more progressive direction.",
    "She obviously also had the support of Johnson so it's not like that single handedly took her into this strong lead, but it certainly contributed, and it's worth watching how that affects her likely term in office.",
    "And the reason he announced this and put in his resignation letter is that he had to do this on or before March 1st, so that the election would take place this year, otherwise it would've taken place later.",
    "Cruz had endorsed a political operative named Christian Collins while the sort of mainstream Republicans supported a former Navy seal named Morgan Lutrell, well, I guess we can say Ted Cruz lost this one.",
    "One of those in the New York area, New Jersey eight, which is in at New York Metro area, Albio Sires is retiring and Bob Menendez's son, Bob Menendez Jr. Is running and is pretty much locked up the seat.",
    "David Nir:\nBut there's another half to this equation, which is that whatever reason, all of these various seats came open, we have in almost every case, really compelling primaries to fill these seats.",
    "All that we've heard is that it has something to do with is ties to Azerbaijan, the oil rich former Soviet Republic, but it's a huge, huge risk going forward with a guy who could be indicted any day.",
    "David Nir:\nAnd well, it is a loss for Ted Cruz, but it is a win for House minority leader, Kevin McCarthy, who supported Lutrell and I guess gets to keep a Cruz-nic maniac out of Congress next year.",
    "David Nir:\nYeah, this was a really interesting development Biaggi's entry into the race because this district, it leans democratic, not dramatically so, but it was reshaped in redistricting a bit.",
    "David Nir:\nIt almost certainly reflects of belief among many in the party that the November midterms will in fact be quite difficult and very possibly result in Republicans taking over the House.",
    "When we come back David Beard and I will be taking a deep dive into the many open Democratic seats in the House this year and how these elections might change the future of the Democratic caucus.",
    "One of the elections we didn't talk about in the weekly hits in Dallas, Eddie Bernice Johnson is retiring and state representative Jasmine Crockett took a really strong first place on Tuesday.",
    "David Beard:\nAnd so that means former Collin County judge, Keith Self, who is the runoff opponent of Taylor, will almost certainly be the next Congressman here as it's a safe Republican seat.",
    "David Beard:\nAnd meanwhile, there'll be this competitive Republican primary to almost certainly take the seat next January, which I'm sure we'll talk more about as the folks running develop.",
    "So you're looking at something like 13, 14 of these members retiring for one of those two reasons which still leaves over half of their retirements are not retiring to run for higher office.",
    "So you can understand why somebody who was a House member would see that as a step up, a place to have a much more prominent role as mayor of Los Angeles versus one of 435 House members.",
    "David Nir:\nAlso on the statewide level, Republican Attorney General Ken Paxton, who has been plagued by multiple scandals for years, he's even been under indictment for securities fraud.",
    "So that's one where you can sort of chalk it up to redistricting in part obviously, maybe he would've run for senate, even if he did have his same district, in 2022, we just don't know.",
    "For a complete rundown of all of these results and many more in other races as well, we want to encourage you to check out our daily newsletter, the Daily Kos Elections Morning Digest.",
    "He essentially congratulated Keith Self and expected Self to be the GOP nominee and wants him to hold this seat for the Republican party, because Taylor admitted to having an affair.",
    "And we've got a few of those already in some of these open seats, people who, even though the primary is still a while away, can really almost write their ticket to Congress already.",
    "So of course, Frost will be 25 by the time he's sworn in, but he can run for office as a 24 year old, as long as he's going to turn 25 before he's sworn in potentially next January.",
    "And those races are still sort of solidifying, but in Texas 35, obviously the election took place on Tuesday and former Austin city council member, Greg Casar took 61% of the vote.",
    "Greg Abbot took 67% of the vote in his primary against really B- or C-level competition with former Senator Don Huffines and former state party chair Allen West, both getting 12%.",
    "David Nir:\nThe old joke has it, that AG stands for aspiring Governor, but as a result, his 4th Congressional District, a very blue slice of the Washington suburbs is now open.",
    "So there is certainly precedent for this kind of thing, but obviously Maxwell Alejandro Frost would be just about the youngest member of Congress you could possibly imagine.",
    "David Nir:\nAnd there is certainly one very famous American politician who took a similar route to Congress when he was 29 years old, Joe Biden ran for Senate in Delaware.",
    "There isn't going to be a temporary appointment from the governor, the special election is going to take place in 2022, with the special general taking place in November.",
    "And if you split a dark blue city like Louisville, then you wind up forcing a whole bunch of Republican members to take on turf that they really don't want to represent.",
    "But while Casar emerged from a very competitive primary, sometimes with these open seats, you wind up with one candidate really dominating and even clearing the field.",
    "She had a lot of outside spending money and she's seen as very progressive, somebody who's really going to move the caucus towards the left once she gets into office.",
    "This is a big change from two years ago when Cisneros first challenge Cuellar, he won outright 52-48 that year, but a third candidate this time took 5% of the vote.",
    "And so it may just be that she is keeping her powder dry for her future political career, whether that's a return to the House or perhaps a bid for a higher office.",
    "And that temporary Senator would be finished with his term, but Inhofe has decided that he is resigning, but he is resigning effective at the end of this Congress.",
    "David Nir:\nAnd someone like Murphy, also, you mentioned her age, she had been widely considered to be a possible Senate candidate, this cycle decided not to run.",
    "David Beard:\nSo often, as you said, we have very competitive primaries when there's an open seat, particularly in heavily Democratic or heavily Republican areas.",
    "David Beard:\nSo we've got two main candidates here in this district, state Senator and Minority Leader Morgan McGarvey is very much the establishment favorite.",
    "So it's not a surprise that he really took this strong victory, but he is another person who you would really see, add to sort of the left side of the caucus.",
    "Now Taylor is married, but nonetheless, this is 2022, how often do you see an elected official decide not to seek reelection, just because of a little affair.",
    "Sometimes district are completely changed to where they go from a safe Democratic seat to a safe Republican seat or vice versa, or just eliminated entirely.",
    "But of course, in a bad year, as you said, it could somehow wind up staying Republican, which would be very much the result that Democrats did not aim for.",
    "And it's worth thinking about why there's of course, plenty of speculation about personal reasons, but really there is a strong bias toward the status quo.",
    "If you would like to contribute to this effort, which has already raised over half a million dollars, please check out the link in our episode description.",
    "David Beard:\nAnd speaking of running for higher office, that's also a major reason why a lot of Congressmen and Congresswomen will move on from the House.",
    "And then with that newly elected Senator taking office at the beginning of next year, which is not really how the Oklahoma law is really set up to work.",
    "So I think there was also, again, a lot of speculation that the potential for this district becoming tougher was one of the reasons for her retirement.",
    "David Beard:\nYou've seen in a number of states, the maps have been created to elect Democrats in sort of neutral or even slightly bad Republican years.",
    "This is an open seat in Louisville, where John Yarmuth, who was a member of the class of 2006 in that big democratic wave, John Yarmuth is retiring.",
    "David Nir:\nBut there was some additional reporting here from the Dallas Morning News and others that indicated there was quite seamy backstory here.",
    "David Beard:\nWith the number of retirements that we've had, the democratic caucus will look different in 2023, regardless of how the election goes.",
    "David Beard:\nAnd then we've got Nassau County legislator, Josh Lafazan, who's a relative moderate compared to the other two candidates I mentioned.",
    "David Nir:\nSo in a late breaking development on Wednesday afternoon, just before we recorded this episode, something absolutely shocking happened.",
    "He actually joined up with ISIS and became a key figure there, he was an American, but he helped them to recruit other Westerners to their cause.",
    "We obviously don't have time to look at all 31 of these seats, but we're going to look at a few really interesting primaries that have developed.",
    "There's also former Prince George's County state's attorney Glen Ivey and Delegate Jazz Lewis and Lewis has representative Steny Hoyer's backing.",
    "And now she's seeking a comeback, but she's not the only candidate, even though obviously she has some really good name recognition in the area.",
    "David Beard:\nThey're not retiring because of redistricting, which points to what you said earlier about this being the potential for a bad year.",
    "And with that in mind, that's allowed a bunch of candidates to actually gear up campaigns, despite the fact that there's no final map in place.",
    "David Nir:\nWe have one more Texas race we'll recap that is in the 8th Congressional district, another safely Republican seat north of Houston.",
    "David Beard:\nAnd as a reminder, please subscribe to The Downballot wherever you listen to podcasts and leave us a five-star rating and review.",
    "He has been forced into a runoff by his progressive challenger, immigration attorney Jessica Cisneros, with almost all of the votes counted.",
    "So we'll be seeing both of them in the fall and what should be an expensive you know, remains to be seen how competitive it will be in 2022.",
    "And if you haven't already like, and subscribe to the Downballot, wherever you listen to podcast and leave us a five star rating and review.",
    "We also want to mention that the Daily Kos community has opened its wallets in an enormous way for Ukrainian victims of Putin's aggression.",
    "David Nir:\nEarlier Beard, you mentioned Anthony Brown, who is a Maryland Congressman whose reason for retirement is a little more unusual.",
    "So that's a race that's sort of still developing, but it's definitely worth keeping an eye on as we see who will end up replacing Suozzi.",
    "And he endorsed his chief of staff, Luke Holland, to replace him in what's sure to be a competitive Republican primary to fill this seat.",
    "In fact, it's the largest number of Democratic retirements in a few decades when we saw numbers like this from the GOP in the 2018 cycle.",
    "And that will result in these very crowded primaries where sometimes someone gets elected to Congress due to a primary win in the teens.",
    "You can sign up for that at dailykos.com/morningdigest, it's free and it shows up in your inbox every weekday morning at 8 AM Eastern.",
    "Even we saw that with Ted Budd in North Carolina, a number of years ago, who won his Republican primary with a very, very low result.",
    "But like with any gerrymander, if the year is bad, enough seats are going to become competitive that are not meant to be competitive.",
    "But right now we want to talk about a handful that look like they're going to be some of the most compelling on the ballot this year.",
    "The Downballot is a weekly podcast dedicated to the many elections that take place below the presidency, from Senate to city council.",
    "So it's certainly no lock for Edwards, but you think that she would have a good chance given her name recognition and past service.",
    "And so the question of whose supporters are more motivated, who's going to come out to vote, can really swing in a race this close.",
    "David Beard:\nHe is very, very progressive, definitely running from the left, who is going to bring a really strong challenge here.",
    "David Nir:\nSo hopefully Democrats will see some sense and rally around Cisneros, who, by the way, has been endorsed by Daily Kos.",
    "The big news this week, of course, is the Texas primary, which took place on Tuesday and gave us a number of interesting results.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "And of course, as you said, she was a giant slayer in 2018 when she took down Jeff Klein, the leader of the renegade Democrats.",
    "And that district we've seen in different Florida maps go from anywhere being a swing district, to a more Republican district.",
    "And we want to start with a couple of the Texas races that happened on Tuesday night that we didn't cover in the weekly hits.",
    "They made it about 10 or 12 points redder in redistricting, but Congressman Van Taylor wound up getting forced into a runoff.",
    "He actually tried to run against Elliot Spitzer in the primary for governor in 2006 and got something like 12% of the vote.",
    "She held the seat for a number of years, eventually running for Senate in 2016, losing in the primary to Chris Van Holland.",
    "And then Beto O'Rourke, who is the Democratic challenger very easily won his primary against really negligible competition.",
    "You may remember that she was a progressive primary challenger way back in 2008 when she defeated Congressman Albert Wynn.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "It's against state land commissioner, George P. Bush, who is the son of none other than former Florida governor, Jeb Bush.",
    "So he gets to short circuit the system and obviously tried to give his chief of staff a leg up as his preferred candidate.",
    "He is clear to November where in his overwhelmingly democratic district, he will be elected to Congress for next January.",
    "David Beard:\nYes, it's unclear exactly sort of how she got all of this crypto support, but it was a lot of crypto money.",
    "And as you probably know, but I'll just remind you, there is a minimum age requirement in the House of representatives.",
    "And this is a pretty scary development for Van Taylor's Congressional career, not that I feel particularly bad for him.",
    "David Nir:\nMoving along from there, the other top tier contest on Tuesday night was in the 28th Congressional district.",
    "These are people who are ending their political careers or maybe they're moving on to take jobs in the private sector.",
    "David Nir:\nAnd sometimes as we were discussing earlier, we can have primaries in districts that don't quite exist yet.",
    "So she has a ton of establishment support and she's really locked up everything you need to have a strong primary win.",
    "And we will also be taking a deep dive into the various open Democratic House seats that are on the ballot this year.",
    "There were quite a few interesting races, some surprises, a number of contests that will go to runoffs on May 24th.",
    "Ohio was losing a seat and there was the thought that his district might be eliminated or become more Republican.",
    "And it seems that this seamy backstory is very probably what prompted Taylor to decide to pull the rip cord here.",
    "But all of that is said and done, because on Wednesday afternoon, Van Taylor said he was suspending his campaign.",
    "She was challenging him from the left, but she's facing a big money disparity and Yarmuth has endorsed McGarvey.",
    "I was probably being overly polite to the retiring Congressman soon to be retiring politician, at least for now.",
    "Many of these primaries will result in the Democratic caucus, moving to the left and also becoming more diverse.",
    "The key here is that Inhofe would not have been up for reelection until 2026; he just won another term in 2020.",
    "So you think that he's a pretty strong favorite though, obviously we'll have to see how the primary turns out.",
    "And obviously having your father be a Senator, goes a long way and ensuring that you'll become a Congressman.",
    "And so there was no district that he could run in that had any potential for a Democrat to win in it in 2022.",
    "David Nir:\nHe dragged his wife to Syria, she claims she had no idea that they were going into ISIS territory.",
    "David Nir:\nAnd even if their districts would still be pretty red, they, A always fear losing no matter what.",
    "He represented a Nashville based district in Tennessee's fifth, and that district was completely changed.",
    "David Beard:\nSo in New York three, Tom Suozzi is running for Governor in a primary against Kathy Hochul.",
    "So we'll go ahead and start it at the top with of Texas' primaries, which were not entirely competitive.",
    "We have been raising donations for several charities, including chef Jose Andres’ World Central Kitchen.",
    "And the real question will be, will we see any further shoes drop on this FBI investigation of Cuellar?",
    "So even though she's not from the sort of heart of the district, she certainly has a real chance here.",
    "There's a couple of these types of seats in Illinois the 13th district is a heavily changed district.",
    "Well, this one, I think we do know, Tom Suozzi is going to get absolutely flattened by Kathy Hochul.",
    "The sort of intention to resign more than nine months from now is not really sort of accounted for.",
    "You think of like Governor or Senator, that's the most common avenue for House members to run for.",
    "David Nir:\nThe big news we'll be discussing is the Texas primaries that unfolded on Tuesday night.",
    "So he will also like many other new members help increase the diversity of the democratic caucus.",
    "David Beard:\nSo if 2022 is a bad year, she could certainly have a competitive race on her hands.",
    "So I wouldn't expect turnout to completely crater, but I expect it to be lower than the primary.",
    "David Beard:\nSo it's just one of the strange quirks of Texas election law that allows for this.",
    "He's running for state Attorney General, which can certainly be a springboard to higher office.",
    "David Beard:\nYes, there's a few what you would call new democratic seats like this Texas 35th.",
    "Obviously starting out 20 points behind in the first round is not where you really want to be.",
    "This November so far, there are 31 Democratic retirements compared to just 16 for Republicans.",
    "And David Beard will walk us through some of the most compelling races that are on the docket.",
    "Taylor has the ability to take his name off the runoff ballot, which he says that he will do.",
    "It's hard to overcome in those situation any other candidate trying to beat Bob Menendez Jr.",
    "David Nir:\nAnd also, I just have to say Beard, I don't share your optimism about Tom Suozzi.",
    "She got 48% of the vote just below the majority that she would've needed to avoid a runoff.",
    "David Beard:\nYes, former Congresswoman Donna Edwards is in a race to reclaim her old seat.",
    "That includes the most recent one we were talking about in the top of the show Van Taylor.",
    "David Beard:\nAnd in a similar situation, Stephanie Murphy is a Congresswoman from Florida.",
    "We've got about a half a dozen who have been affected by redistricting, at least in part.",
    "Now, I should preface this, that we saw a surprise in Texas's 3rd Congressional district.",
    "And some people not wanting to come back in a potential minority on the Democratic side.",
    "And B new turf means the possibility of a primary challenger really sneaking up on them.",
    "And we of course have to point out that this was the result of a democratic gerrymander.",
    "He has a lot of support from all of the establishment, which is very key in New Jersey.",
    "David Nir:\nIt's like the distinguished gentleman, Bob Menendez, it's the name you know.",
    "David Nir:\nAnd we should also note though that this was one of those races, wasn't it?",
    "It's not uncommon for older members to think this is a good time to call it a career.",
    "So these two will square off once again, that once more, is 12 weeks from now May 24.",
    "It's a really strange situation, Self only one 27% of the vote, but he is on his way.",
    "This is a red seat north of Dallas Republicans went to great lengths to shore it up.",
    "So we've got eight members on the Democratic side who are running for higher office.",
    "We'll be reading and discussing some of the most interesting notes that we received.",
    "It does appear though that Lutrell will get through this primary without a runoff.",
    "There's another one in North Carolina in Charlotte, there's another one in Oregon.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "David Beard:\nBut sometimes you get a candidate that really just clears the field.",
    "We're taking a look at all of the many open Democratic House seats on the ballot.",
    "David Beard:\nSo you can really chalk his retirement up to redistricting changes.",
    "Party operative Jane Hamilton secured second but it was a pretty distant second.",
    "David Beard:\nIt's not clear how that's going to shake out; she is pretty young.",
    "And you’re much more likely see Gohmert's support going to Paxton than to Bush.",
    "So I think that's another one we're going to be able to say good riddance to.",
    "And a couple of those overlap, Tim Ryan being the most prominent overlapper.",
    "David Beard:\nAnd then we've got Karen Bass from California's 37th district.",
    "He only took 49% of the vote against former Collin County judge Keith Self.",
    "People see it as a once in a generation chance sometimes to go to Congress.",
    "David Beard:\nSo we think Crockett is really a pretty strong favorite here.",
    "David Beard:\nThe idea is obviously, if you're going to resign, you resign.",
    "This number of retirements for Democrats is really not an optimistic sign.",
    "The Democrats they've been in the majority, they passed some legislation.",
    "Paxton was forced into a runoff and the runoff is against a famous name.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "You would certainly call her the favorite to go to Congress next year.",
    "Hoyer of course is the Majority Leader of the House Democratic caucus.",
    "Melanie D'Arrigo who lost the 2020 primary to Suozzi is also running.",
    "And so it's important to sort of run down, see some of these changes.",
    "The state legislative Republicans cracked Nashville into three parts.",
    "David Beard:\nSo that's certainly the case for of the representatives.",
    "Donate to charities helping Ukrainian victims of Putin's illegal war.",
    "David Nir:\nAnother race we want to take a look at is Kentucky's 3rd.",
    "He's been echoing GOP talking points about criminal justice reform.",
    "Now, Paxton obviously has all these problems that have plagued him.",
    "Which just makes it so hard to imagine a path to victory for Bush.",
    "Now, obviously there's going to be a ton of interest in this race.",
    "So she's a very progressive candidate who's running for this seat.",
    "So he's got very strong support on the progressive side of things.",
    "David Beard:\nAnd I think Bush is going to have real trouble here.",
    "Obviously Los Angeles is a huge city, it's a very prominent role.",
    "And then whoever was elected would then become the next Senator.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "One of those examples is Florida's 10th Congressional district.",
    "So, you have to watch out for a split among progressives there.",
    "And the other candidates is really going to have to deal with.",
    "David Nir:\nAnd I'm David Nir, political director of Daily Kos.",
    "I'm David Beard, contributing editor for Daily Kos Elections.",
    "Let us know if there are any topics you'd like us to discuss.",
    "Thanks to our producer, Cara Zelaya and editor, Tim Einenkel.",
    "Nicki Bazinsky is the democratic candidate, almost certainly.",
    "And so the primary is where the real action is going to be.",
    "And he's totally delusional about his chances in a primary.",
    "David Nir:\nHe's the only anti-choice Democrat in the House.",
    "And on upcoming episodes, we will be featuring a mail bag.",
    "David Beard:\nWe'll start with the 30th district of Texas.",
    "He finished in fourth place behind Guzman also with 17%.",
    "You can reach us by email at thedownballot@dailykos.com.",
    "Some winners, some going to a runoff and some surprises.",
    "One of which is the 35th, which we ought to talk about.",
    "So he is going to remain a Senator throughout the year.",
    "She represents really a swing district, Florida seven.",
    "He's a member of the Democratic Socialists of America.",
    "He also had a big financial edge over his competitors.",
    "But let's go ahead and dive into our topics for today.",
    "Where a lot of the outside spending was crypto money?",
    "You might call those true retirements, quote-unquote.",
    "And one of the most interesting is the 3rd district.",
    "The Downballot comes out every Thursday, everywhere.",
    "He did in fact, turn 30 by the time of inauguration.",
    "So it really didn't end up being competitive at all.",
    "You can email us at thedownballot [at] dailykos.com.",
    "So he's almost certainly going to be a Congressman.",
    "In fact, their total number was quite a bit higher.",
    "Gohmert's political career is essentially now over.",
    "David Beard:\nThat's very common in a midterm year.",
    "David Nir:\nAnd Casar, I should also add is Latino.",
    "We'll certainly be able to help Lewis raise money.",
    "David Nir:\nSince 2015, still hasn't gone to trial.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "David Nir:\nHe would not be running in the runoff.",
    "And so there will be 4, 6, 8, 10 people running.",
    "She's a former Biden aide, former Pritzker aide.",
    "It's not 80-20 democratic or anything like that.",
    "I think you said something like you never know.",
    "Lutrell is in first place with 53% of the vote.",
    "David Nir:\nMany of these seats are safely blue.",
    "They will run for Senate or for something else.",
    "I think Jim Cooper is the most obvious example.",
    "Now mayor in some places would be a step down.",
    "There'll be a lot of money spent on this race.",
    "We would like to hear from you, our listeners.",
    "Where do you want to start this conversation?",
    "And it becomes clear who the race is between.",
    "So he is not going to have to go to a runoff.",
    "He was endorsed by Alexandria Ocasio-Cortez.",
    "She also has an interesting family history.",
    "We'll be back with a new episode next week.",
    "Not all of the votes have been counted yet.",
    "David Beard:\nThat's all from us this week.",
    "David Beard:\nSo he has a lot of influence.",
    "Her grandfather was a member of Congress.",
    "You have to be 30 to serve in the Senate.",
    "He jumped in, he's raised a ton of money.",
    "JB Pritzker is the Governor of Illinois.",
    "Sometimes there are more major changes.",
    "Who's running for mayor of Los Angeles.",
    "She has an enormous amount of support.",
    "This is a short blurb about Daily Kos.",
    "And there's a familiar name running.",
    "So that's why this seat popped open.",
    "He is the son of Mexican immigrants.",
    "We still don't know what it's about.",
    "Now the seat is democratic leaning.",
    "That feels so last century, right?",
    "What are we going to be covering?",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Collins is well behind with 22%.",
    "She's really cleared the field.",
    "That's just how elections work.",
    "She's a former labor official.",
    "And we do have a few of those.",
    "Cuellar had just a 48-47 lead.",
    "David Beard:\nWelcome everyone.",
    "Please send us your feedback.",
    "So go on and drop us a line.",
    "She was endorsed by Johnson.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "David Beard:\nI'm excited.",
    "Daily Kos is different.",
    "David Beard:\nExactly.",
    "So it's very strange.",
    "So let's get started.",
    "David Beard:\nYeah.",
    "He totally sucks.",
    "David Nir:\nBeard.",
    "David Nir:\nToday.",
    "Donate $5 monthly",
    "David Nir:\nYeah.",
    "David Nir:\nYeah.",
    "David Nir:\nYeah.",
    "Please read it.",
    "Stay with us.",
    "It is 25.",
    "Yeah."
  ]
}