{
  "id": 16024,
  "mediaId": 2518,
  "date": "2022-03-05",
  "headline": "Ex-militiaman testifies at trial",
  "image": "https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/200812899_200810951-0795923c51d445ad8af78adee15ae580_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676",
  "link": "https://www.arkansasonline.com/news/2022/mar/05/ex-militiaman-testifies-at-trial/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "WASHINGTON -- The first person to be tried in the Jan. 6, 2021, assault on the U.S. Capitol was a Texas militia member who advocated for physically removing and replacing \"corrupt\" members of Congress as he drove to Washington, D.C., a former group member testified Friday.",
    "Rocky Hardie, a key government witness at the trial of Guy Wesley Reffitt, said he didn't believe that Reffitt would act on his talk of dragging lawmakers out of the Capitol and replacing them with people who would \"follow the Constitution.\"",
    "Hardie testified that he and Reffitt both had holstered pistols strapped to their bodies when they attended then-President Donald Trump's \"Stop the Steal\" rally and then headed to the Capitol.",
    "Hardie, who was Reffitt's passenger on their car ride to Washington, said he was \"pretty impressed\" when Reffitt recounted what he did after they became separated on their way to the Capitol.",
    "He has an immunity agreement that prevents prosecutors from using his testimony against him, but the deal doesn't insulate him from being charged with a crime for his actions on Jan. 6.",
    "Prosecutors say Reffitt played a leadership role when he and other rioters charged at police officers on the west side of the Capitol, but he isn't accused of entering the building.",
    "FBI Special Agent Laird Hightower said the image shows \"a silvery metallic linear object\" in a holster protruding from under Reffitt's jacket as he leaned forward.",
    "Hardie, who lives near Austin, Texas, said he met Reffitt in person for the first time before the 2020 presidential election, discussing politics at a park.",
    "Prosecutors expect to rest their case Monday after calling four more witnesses, including two Capitol police officers and Reffitt's daughter, Peyton.",
    "He also is charged with obstructing justice, accused of threatening his children if they reported him to law enforcement authorities after the riot.",
    "The Three Percenters militia movement refers to the myth that only 3% of American colonists fought against the British in the Revolutionary War.",
    "Reffitt, 49, of Wylie, Texas, is charged with bringing a gun onto Capitol grounds and interfering with police officers guarding the building.",
    "Hardie said he didn't join the hundreds of rioters who entered the building, but he conceded that he brought a gun into a restricted area.",
    "They both viewed House Speaker Nancy Pelosi as \"evil incarnate\" and believed the election had been stolen from Trump, Hardie testified.",
    "During Welch's cross-examination, Hardie agreed that Reffitt is prone to bragging, using hyperbole and embellishment.",
    "\"We did ask ourselves how far do you let things go before you take action to protect your country,\" Hardie said.",
    "Hardie said Reffitt also gave him two pairs of zip-tie cuffs before they left their hotel room that day.",
    "During Friday's testimony, prosecutors zoomed in on a video image of Reffitt at the Capitol.",
    "He retreated after an officer pepper-sprayed him in the face, according to prosecutors.",
    "\"I considered it hyperbole,\" Hardie testified during the third day of Reffitt's trial.",
    "Hardie said he met Reffitt through their membership in the \"Texas Three Percenters.\"",
    "\"We talked about how the country is pretty much going down the tubes,\" Hardie said.",
    "\"In case we need to detain anybody,\" Reffitt replied, according to Hardie.",
    "They left rifles locked up in a car parked at a hotel, Hardie said.",
    "\"I felt like he had more courage than I did,\" Hardie said.",
    "Hardie recalled asking.",
    "\"What are those for?\""
  ]
}