{
  "id": 1607,
  "mediaId": 2574,
  "date": "2022-02-17",
  "headline": "Proxy Abuse: House Dems Who Don’t Show Up to Congress Spent Big on Campaign Travel",
  "image": "https://freebeacon.com/wp-content/uploads/2022/02/pjimage_736x514.jpg",
  "link": "https://freebeacon.com/democrats/proxy-voting-house-dems-traveled-to-luxury-destinations-instead-of-showing-up-for-work/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley Strack",
  "authorUrl": "https://freebeacon.com/author/haley-strack/",
  "termIds": [
    0
  ],
  "sentences": [
    "During the same time, he amassed $45,000 in travel expenses at ritzy hotels, including a stay at the Fairmont San Francisco, where billionaire Ivy Getty got ready for her star-studded wedding, Las Vegas's lavish Cosmopolitan, and Manhattan's five-star Conrad Hotel.",
    "House Democrats, by contrast, appear willing to travel for campaigns while using the proxy-voting system, giving the impression they are keeping pandemic measures because they're convenient, not because they're needed for safety.",
    "Rep. Tony Cárdenas (D., Calif.) proxy voted 278 times, at least two of which were in December, the same month the congressman’s campaign spent more than $1,000 in idyllic California beach towns like San Diego and Santa Barbara.",
    "#FirePelosi pic.twitter.com/sZCl0WLGzm\n— Kevin McCarthy (@kevinomccarthy) February 3, 2022\nSwalwell and Cartwright are far from alone when it comes to taking advantage of Pelosi's proxy-voting system to attend campaign events.",
    "House Speaker Nancy Pelosi (D., Calif.) announced last week that she will extend until March 30 the proxy-voting system in place for COVID-cautious lawmakers to avoid travel during the pandemic.",
    "McCarthy has pointed to the numbers in the Ripon Society study, which show one member of the House voting exclusively by proxy last year, as evidence that Democrats are \"skip[ing] work.\"",
    "Pelosi's decision to extend the proxy-voting system stands in contrast with Democrats around the country, who are abandoning strict coronavirus restrictions as case counts plummet.",
    "But the pandemic hasn't stopped them from racking up luxury travel expenses as they criss-cross the country for their campaigns, a review of campaign finance disclosures reveals.",
    "On Oct. 12, for example, Cartwright used the system, saying he was \"unable to physically attend proceedings in the House chamber due to the ongoing public health emergency.\"",
    "The proxy-voting system has been used almost exclusively by Democrats, who have accumulated 12,500 proxy votes citing the \"unprecedented nature of the coronavirus pandemic.\"",
    "They were joined by Delaware's Rep. Lisa Blunt Rochester (D.), who couldn't be bothered to travel to Washington, D.C., but safely made it an additional 650 miles to Georgia.",
    "Update 5:20 p.m.: A previous version of this story included a link to a proxy letter sent by Rep. Katie Porter (D., Calif.) in Nov. 2020, rather than a letter in Nov. 2021.",
    "That same month, her campaign spent hundreds of dollars on a hotel in Georgia and an additional $1,193 at a boutique hotel in New York blocks away from Rockefeller Center.",
    "Minority Leader Kevin McCarthy (R., Calif.) tried to disband the \"unconstitutional\" proxy-voting system last year, but the Supreme Court rejected the lawsuit in January.",
    "Cartwright used the occasion to thank Biden for \"rescuing the country from COVID,\" even though he cited the disease's prevalence as his reason for skipping work.",
    "The following week Cartwright used the proxy-voting system again—this time to appear with President Joe Biden to tout the White House's spending plan.",
    "Like the Georgia Democrats, Rep. Sharice Davids (D., Kan.) has abused the proxy-voting system on multiple occasions to appear with the Biden family.",
    "Rep. Tim Ryan (D., Ohio), who has proxy voted 60 times, was in Los Angeles fundraising for his U.S. Senate campaign the day after the Super Bowl.",
    "On Dec. 1, she spent several hundred dollars at the Ritz Carlton in Rancho Mirage, Calif. On Dec. 2, she filed yet another proxy voter letter.",
    "That same day, his campaign dropped $2,026.26 on lodging at a \"chic Southern style\" hotel in Atlanta where rooms cost as much as $599 a night.",
    "Sanford Bishop, Carolyn Bourdeaux, Lucy McBath, Nikema Williams, and Hank Johnson—requested to vote by proxy citing the coronavirus pandemic.",
    "Rep. Lauren Underwood (D., Ill.) raised almost half of her contributions from California during the final three months of 2021.",
    "Rep. Matt Cartwright (D., Pa.) has used the proxy-voting system many times, but spent thousands traveling to luxury hotels.",
    "With the November midterms approaching, House Republicans have said they will squash the system if they win a majority.",
    "The story has been updated with additional from her campaign, which says Porter did not travel to Georgia or New York.",
    "Records show, however, the system's most frequent users have traveled regularly for their reelection campaigns.",
    "Chief among those who took advantage of the system is Pelosi's fellow California Democrat, Rep. Eric Swalwell.",
    "The real reason they couldn't appear in Congress to do their job was because they were at an event with Biden.",
    "On Dec. 8, she filed for a proxy vote and later posted a photo with a maskless Rep. Emanuel Cleaver (D., Mo.)",
    "Like Davids, the maskless Cleaver cited the coronavirus pandemic as the reason he could not vote in person.",
    "Neither Pelosi nor the system's biggest abusers responded to requests for comment on the campaign travel.",
    "He appeared maskless on stage and fist bumped a maskless Sen. Bob Casey (D., Pa.) prior to his remarks.",
    "Rep. Raúl Grijalva (D., Ariz.) cast 303 proxy votes but spent hundreds on California hotels in June.",
    "In one instance, she filed a proxy letter on Nov. 5, citing the \"ongoing public health emergency.\"",
    "If elected, he wouldn't have the benefit of proxy voting—the Senate does not allow proxy voting.",
    "The California congresswoman cited the pandemic as her reason for proxy voting in both months.",
    "Swalwell proxy voted 141 times last year, according to a comprehensive Ripon Society study.",
    "Citing the coronavirus pandemic, Davids wrote on Oct. 12 that she needed a proxy vote.",
    "That same day, she appeared at an event with \"Dr.\" Jill Biden in Kansas City.",
    "as the duo prepared to board Air Force One for an event with Biden.",
    "Porter's campaign says she remained in California for both trips.",
    "On Jan. 11, five Democratic members of Georgia's delegation—Reps.",
    "Rep. Katie Porter (D., Calif.) proxy voted 264 times last year.",
    "Swalwell also dropped almost $50,000 on flights.",
    "Meet the top 15 proxy voting members in ’21.",
    "Pelosi’s House — skip work, get paid."
  ]
}