{
  "id": 167,
  "mediaId": 8288,
  "date": "2022-02-25",
  "headline": "Cleveland to Chicago Hyperloop is Still Just a Stupid, Extremely Expensive Dream",
  "image": "",
  "link": "https://www.clevescene.com/cleveland/cleveland-to-chicago-hyperloop-is-still-just-a-stupid-extremely-expensive-dream/Content?oid=38451361",
  "mediaOutlet": "clevescene.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sam Allard",
  "authorUrl": "https://www.clevescene.com/author/sam-allard",
  "termIds": [
    0
  ],
  "sentences": [
    "In 2019, the Northeast Ohio Areawide Coordinating Agency (NOACA) and the California-based Hyperloop Transportation Technologies announced the results of a feasibility study that assessed the costs and benefits of an imaginary Hyperloop corridor between Chicago, Cleveland and Pittsburgh.",
    "For Clevelanders who actually use public transit, the prospect of safe, frequent, reliable buses and trains—and hell, maybe a couple of Amtraks departing during waking hours—is still far more intoxicating than the magical sci-fi super tube dreamed up by Elon Musk.",
    "Back then, local leaders up to and including Democratic U.S. Senate Candidate Tim Ryan were credulously praising the hyperloop as a revolutionary technology with the potential for thousands of jobs and a commute to Chicago so painless (30 minutes or less!)",
    "That bipartisan bill authorized huge investments in bridges, freeways and sustainable transportation modes nationwide and allowed Hyperloop companies like HyperloopTT to apply for federal grants that other transportation modes already have access to.",
    "This groundbreaking technology will be revolutionary to Ohio and the entire country — opening the door for more job opportunities, higher economic growth in our cities, less time in traffic, more chances to see loved ones, and so much more.",
    "But it's hard to imagine that investors, who in spite of De Leon's prognosis have been skittish about the incipient and overblown tech, will pony up in the wake of Virgin's transition, a move interpreted by some as a surrender to reality.",
    "\"I think there’s enough evidence in the feasibility study to suggest we should move forward as a region in order to leverage the work that we’ve already done and to capitalize on the momentum of hyperloop nationally and internationally.\"",
    "That momentum, stalled by the pandemic, screeched to a halt this week when Virgin Hyperloop announced that it was abandoning its plans for passenger transport via hyperloop tech and laying off roughly half its staff.",
    "The feasibility study advised that the project could cost north of $25 billion but would make up those costs via huge upticks in the labor market and enhanced property values, among other things.",
    "All sorts of public and private institutions leaped to be a part of a \"Great Lakes Consortium\" on the hyperloop and released a vortex of press releases about how excited they all were.",
    "Hyperloop technology even seemed to be gaining ground in its quest for legitimacy in November, when it was included by name in Joe Biden's Infrastructure Investment and Jobs Act.",
    "Transporting freight (instead of humans) along vacuum-sealed tubes at high speeds, the company concluded, would entail far fewer regulatory and safety burdens.",
    "He said, in fact, that the company's transition to freight was \"highly expected,\" given that its primary investor, DP World, is a cargo logistics company.",
    "Tim Ryan himself gushed, \"I am proud to have helped cement the future of hyperloop travel with the passage of the Infrastructure Investment and Jobs Act.",
    "Everyone now seems to acknowledge that the technology is simply too costly to be practical, especially when high-speed rail is sitting right there.",
    "The news couldn't come at a better time for RTA, whose rapid transit trains are spontaneously bursting into flame on what feels like a daily basis.",
    "***\nSign up for Scene's weekly newsletters to get the latest on Cleveland news, things to do and places to eat delivered right to your inbox.",
    "Since our unveiling of the Great Lakes Hyperloop Feasibility [study] in late 2019 we have continued to make advancements in the region.",
    "After its passage, HyperloopTT's CEO Andres de Leon said that the construction of a domestic hyperloop system \"just got a lot easier.\"",
    "HyperloopTT's Andres De Leon, when reached via email by Scene, said he was not deterred by the Virgin Hyperloop news this week.",
    "The regional transit agency announced Thursday that it was receiving $20.3 million as part of its first tranche of funding.",
    "\"As for HyperloopTT, we remain committed to building a sustainable adaptable system that includes both passenger and cargo.",
    "that it would be possible to live in Cleveland and work in Chicago and vice versa, an outrageous proposition.",
    "The study itself cost $1.2 million and included a $200,000 contribution from the Cleveland Foundation.",
    "And we believe everyone deserves access to accurate independent coverage of their community and state.",
    "Thankfully, the Infrastructure bill is also providing enormous investments in regular-old rail.",
    "Even so, the government of Saudi Arabia appears to be Virgin's only client for such transport.",
    "“I am sold to move to the next step,’’ Grace Gallucci, president of NOACA, said at the time.",
    "Help us keep this coverage going with a one-time donation or an ongoing membership pledge.",
    "I look forward to continuing to work to get the Hyperloop built and up and running.\"",
    "In Cleveland, the buoyant hyperloop atmosphere in 2018 and 2019 is a distant memory.",
    "We’re working to advance the project and expect to announce next steps this year.\"",
    "\"This shift aligns them better with their current revenue streams,\" he wrote.",
    "It came to the astonishing conclusion that such a corridor would be worth it.",
    "Join the Cleveland Scene Press Club\nLocal journalism is information.",
    "Interest in hyperloop around the world\nis stronger than ever.",
    "Who knows what those next steps might be.",
    "Information is power."
  ]
}