{
  "id": 17586,
  "mediaId": 2731,
  "date": "2022-03-04",
  "headline": "With the 2022 Midterms Approaching, COVID-19 Wraps Up",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2022/27/7604ef0b-fc28-496f-a496-7a1a0a06db00.jpg",
  "link": "https://townhall.com/columnists/tedharvey/2022/03/04/with-the-2022-midterms-approaching-covid19-wraps-up-n2604091",
  "mediaOutlet": "townhall.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ted Harvey",
  "authorUrl": "https://townhall.com/columnists/tedharvey/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Left’s encroachment on individual liberty had nothing to do with “science” yesterday, just like today’s pivot has nothing to do with “science.” With two-thirds of Americans fully vaccinated, the Omicron variant—the least severe variant yet—was not deserving of the overreaction it triggered.",
    "Leading from behind, the Centers for Disease Control and Prevention (CDC) has also loosened its mask-wearing guidelines for most Americans, tying those guidelines to hospitalizations rather than infections—a policy that made sense two years ago, let alone now.",
    "According to the Boston Globe (yes, the left-leaning Boston Globe), seven in 10 Americans believe it’s time to accept COVID is here to stay and “get on with our lives.” Even 47 percent of Democrats are sick and tired of pandemic-era politics.",
    "Despite their incessant virtue signaling, Biden Democrats don’t care about public health or human life more than other Americans; they simply care about expanding government and retaining power.",
    "Ukraine dominates the headlines (and for good reason), with the coronavirus being treated like flu-like symptoms or car accidents—sort of important, but not important enough for the front page.",
    "According to Rep. Tim Ryan (D-OH), Americans are “sick of the whole damn thing.” Ryan just so happens to be representing a politically competitive district and running for an open Senate seat.",
    "The New York Times warned us about a “persistent threat,” claiming “the pandemic has not ended.” Hospitalizations and deaths were front-page news, just like they were for the last two years.",
    "But Democrats wouldn’t be pushing for normality if polling wasn’t overwhelmingly on the side of Republicans, who have rejected pandemic hysteria since the beginning.",
    "In COVID-19 America, Hawaii is now the only state with an indoor mask mandate, with Massachusetts, New York, and Rhode Island all lifting theirs in recent weeks.",
    "Across America, people are fed up with COVID-related mandates, recognizing that mass vaccination has brought about the end of pandemic hysteria.",
    "Indeed, Democrats are proving what Republicans have believed for two years: The pandemic was all about politics—nothing more, nothing less.",
    "Tomorrow won’t be a brighter day because of the Left’s caution and prudence, but rather because Democrats are scared to death of 2022.",
    "According to Gallup, COVID-19 is the third most important issue in America, behind economic malaise and subpar government leadership.",
    "Democrats are toeing the same line as their media allies, rolling back restrictions en masse for the first time in two years.",
    "There’s a reason why, even now, Democrats exploit the “pandemic” to promote liberal policies like mandated paid sick leave.",
    "With inflation rising at the fastest pace in four decades, Democrats like Biden are scrambling to change the subject.",
    "The coronavirus may be endemic and it remains a concern, but not to the extent that it warrants government overreach.",
    "And only 45 percent approve of the Biden administration’s handling of the virus—down from 66 percent in July.",
    "View Cartoon\nFor all intents and purposes, the pandemic is over, even in our bluest states and cities.",
    "Elected officials who were once mandate-obsessed should be punished for their overzealousness.",
    "When even California shifts to an “endemic” phase, you know that normality is long-overdue.",
    "Nearly 60 percent of Americans consider President Biden’s first year in office a failure.",
    "Those who determine “science” for the rest of us, based on new polling, deserve to lose.",
    "As COVID-19 wraps up, Americans know which side believes in freedom—and which doesn’t.",
    "Those who tout “science” to tread on individual liberties do not deserve your vote.",
    "Wasn’t the mainstream media panicking about the Omicron variant just last month?",
    "Democrats have seen the writing on the wall, and the writing is public opinion.",
    "Ted Harvey serves as chairman of the Committee to Defeat the President.",
    "Numerous polls confirm public disillusionment with left-wing mandates.",
    "And they will be, with Republicans poised to expand the electoral map.",
    "Not surprisingly, President Biden bears the brunt of the blame.",
    "The “red wave” is coming, and Democrats caused it themselves.",
    "Therein lies the reason for the shift in COVID-19 messaging.",
    "Those who play politics with public health deserve to fail.",
    "Now, COVID-19 is relegated to a media afterthought.",
    "There was only ever one reason: The 2022 midterms.",
    "Trending\nDown goes the vaccine mandate in Chicago.",
    "Off with the required masks in Los Angeles.",
    "But the polling had not shifted yet.",
    "Don’t let “them” have it in 2022.",
    "But it’s too late.",
    "So what happened?",
    "It’s about power."
  ]
}