{
  "id": 17607,
  "mediaId": 8341,
  "date": "2022-03-03",
  "headline": "Historic trails in development",
  "image": "",
  "link": "https://thejambar.com/historic-trails-in-development/",
  "mediaOutlet": "Jambar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Gillett",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“If we connect the Stavich Trail through there to Ravenna, not only will we connect through active transportation, our area, but really the whole region and really the nation, east of the Mississippi,” Harver said.",
    "What happened to the population, how have we regrouped, and how have we made some recovery back from that?”\nHarver’s main focus at the YHCIL was using the archives library to find sources.",
    "“My main project is to both document the history of transportation through the [Mahoning] Valley while also advocating for active transportation: hike and bike trails,” he said.",
    "“Local history is really important to our mission, which is to preserve it and to educate, and also to entertain people in the community about where we came from,” Wilson said.",
    "Part of Harver’s work is to have the National Underground Railroad Network to Freedom update NTF panels about the Underground Railroad on the Western Reserve Greenway Trail.",
    "Harver’s work will culminate in May with a completed project in the form of an exhibit on display at the YHCIL and the William F. Maag Library.",
    "She said Harver was already well-rounded with his project and explained how his work aligned with the museum’s mission of local history.",
    "In 2019, congressman Tim Ryan proposed the Steel Valley National Heritage Area, which, if passed, could be used to fund the project.",
    "He advises the East Gate Regional Council of Governments and has presented his idea for the trail to the Mahoning River Green Wave.",
    "Jacob Harver, Youngstown State University graduate student, is a Youngstown native, history major and an avid cyclist.",
    "Through Leary’s applied history program, Harver was able to learn skills and information to develop his project.",
    "Among the biggest challenges Harver is facing regarding the trail is acquiring the land and building the trail.",
    "Both these interests converged onto his current project, which he has been working on for the last two years.",
    "They are a consortium of various local governments that help funnel federal spending into transportation.",
    "Youngstown is a city with an extensive local history of which residents are often only casually aware.",
    "Alongside a trail, Harver is creating a digital exhibit that will be on display after he graduates.",
    "In the east, the Stavich Bike Trail runs between Struthers, Ohio, and New Castle, Pennsylvania.",
    "Harver worked on this exhibit through an internship under Marcelle Wilson, head of the YHCIL.",
    "This exhibit will be displayed at the Youngstown Historical Center of Industry and Labor.",
    "While many historic trails exist in the region, none run through the Youngstown area.",
    "To the West, the Portage and Summit county trails run from Ravenna to Akron, Ohio.",
    "This includes dealing with landowners, though Harver has not done that personally.",
    "He cultivated this part of his project by using ArcGIS, an app used to make maps.",
    "He has and is still learning how to use it to help him configure the data.",
    "He has the help, encouragement and expertise from professor Thomas Leary.",
    "5 in steel production in the country by the 1950s, and where we’re going.",
    "Future infrastructure spending could go to trails as well.",
    "Progress updates are available at mahoningmovement.com",
    "He has been a history professor at YSU for decades.",
    "However, one student is working to change that.",
    "Why did we encounter deindustrialization?",
    "“Why we were a hub for being No."
  ]
}