{
  "id": 17770,
  "mediaId": 2560,
  "date": "2022-03-02",
  "headline": "Kildee-led bill seeks to restore clipped pensions for salaried Delphi retirees",
  "image": "https://www.gannett-cdn.com/presto/2019/12/18/PDTN/9c4c4bea-dd31-4a79-8faf-0d55494c99af-kildee.jpg?crop=2800,1575,x0,y0&width=2800&height=1575&format=pjpg&auto=webp",
  "link": "https://www.detroitnews.com/story/news/politics/2022/03/02/kildee-bill-seeks-restore-clipped-pensions-salaried-delphi-retirees/9349314002/",
  "mediaOutlet": "Detroit News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melissa Nann Burke",
  "authorUrl": "https://www.detroitnews.com/staff/2684082001/melissa-nann-burke/",
  "termIds": [
    0
  ],
  "sentences": [
    "The bipartisan legislation, led by U.S. Rep. Dan Kildee of Flint Township in the House, would set up a trust fund at the U.S. Department of Treasury that would be used to top off the benefits of the non-union retirees of the former General Motors Corp. parts unit to make them whole.",
    "\"We would essentially be topping off what the PBGC has not provided and making sure that they have the resources to pay the back payments that they have missed — the difference between the statutory cap and what their benefits would have been,\" Kildee said.",
    "Beneficiaries who already are receiving benefits would receive a lump sum payment of the difference between what was paid by PGBC and would have been paid without the statutory limitations, plus 6% interest, according to a bill summary.",
    "The bill comes about six weeks after the U.S. Supreme Court declined to hear the retirees' case in January, letting stand a ruling by the 6th Circuit U.S. Court of Appeals upholding the government termination of their pension plans.",
    "The Pension Benefit Guaranty Corp. — the government-owned pension insurer — then terminated the Delphi salaried workers' plan and has since been paying retirement benefits to the former plan participants out of its insurance funds.",
    "As GM went through a quick-exit bankruptcy in 2009, the decision was made to \"top up\" the pensions of most union Delphi hourly workers and retirees, largely those of the United Auto Workers, to the full amount promised by GM.",
    "\"This specific subset of retirees and employees of the larger General Motors family were singled out and suffered a loss that no one else had to suffer and, obviously, we believe it was unfair also quite consequential.\"",
    "Washington — A bill to be introduced in Congress this week aims to restore lost pension benefits for thousands of former Delphi Corp. salaried workers, including about 6,000 in Michigan.",
    "The bill is named after Susan Muffley of Indiana, whose husband, David, was an electronics technician for three decades whose pension was cut in 2009, according to Kildee's office.",
    "GM did not do the same for 20,000 salaried retirees and pension participants at Delphi, a former GM subsidiary that was spun off in 1999 and which filed for bankruptcy in 2005.",
    "The PBGC said last year in court records that the agency has paid nearly $1.5 billion in benefits out of its insurance funds since 2009 that were unfunded in the Delphi plan.",
    "The Congressional Budget Office has not yet scored the bill, but Kildee estimated it would cost several hundreds of millions of dollars — likely over $500 million.",
    "She avoided seeing her doctor due to financial concerns, despite health issues, and was later diagnosed with pancreatic cancer and died in 2012, Kildee said.",
    "GM later told a 2011 government audit that it made the call \"because of its dependence\" on the United Auto Workers union.",
    "Democratic Ohio Sen. Sherrod Brown will introduce the legislation in the Senate, along with Michigan Democratic Sens.",
    "At least eight other bills have previously been introduced in Congress related to the Delphi salaried employees.",
    "Kildee is optimistic this is time will be different now that the matter is no longer pending before the courts.",
    "The legislation is co-sponsored by Ohio Reps. Michael Turner, a Republican, and Tim Ryan, a Democrat.",
    "For new retirees, Kildee said the legislation would ensure their benefits are what was promised.",
    "But some pensioners and other plan participants lost as much as 70% of their vested benefits.",
    "About 20,000 workers were affected by the cuts, including close to 6,000 in Michigan.",
    "\"Every other avenue has been exhausted,\" Kildee told The Detroit News on Wednesday.",
    "\"People's lives have been dramatically impacted by this,\" Kildee said.",
    "Debbie Stabenow and Gary Peters and Republican Sen.",
    "The Delphi retirees' lawsuit dated to 2009.",
    "mburke@detroitnews.com",
    "Rob Portman of Ohio."
  ]
}