{
  "id": 17849,
  "mediaId": 2730,
  "date": "2022-03-01",
  "headline": "Radical: Senate Dems Overwhelmingly Support Nationwide Law Imposing Abortion-on-Demand For All Nine Months",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/354/09a792de-6811-4086-af43-42ae34ae87a6.jpeg",
  "link": "https://townhall.com/tipsheet/guybenson/2022/03/01/radical-senate-dems-support-national-law-imposing-abortionondemand-for-all-nine-months-n2603933",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Guy Benson",
  "authorUrl": "https://townhall.com/tipsheet/guybenson/",
  "termIds": [
    0
  ],
  "sentences": [
    "The bill creates an absolute right to abortion prior to fetal viability — that is, prior to the point at which a baby can likely survive outside the womb — and prevents state laws from protecting a baby’s life after viability whenever a single “health-care provider” determines that the continuation of the pregnancy “would pose a risk” to the mother’s life or “health.” The bill’s chief Senate sponsor, Richard Blumenthal of Connecticut, has acknowledged that it “doesn’t distinguish” between physical and psychological health...As [pro-choice Republican] Senator Susan Collins told the Los Angeles Times while announcing her opposition in September, the WHPA would “severely weaken the [conscience] exceptions that are in the current law,” eliminating protections and defenses afforded to health-care providers and by the Religious Freedom Restoration Act as no federal law has ever done before.",
    "Its contents represent the views of...17 percent of the American people, according to a poll released earlier this year:\nNew Marist poll sheds light on what Americans think abortion law should be: https://t.co/GCmYdocUu6 pic.twitter.com/yWCCgoO4Aq\n— John McCormack (@McCormackJohn) January 21, 2022\nI summarized public opinion on the issue of abortion late last year (this is based on data, not my opinion, which is generally pro-life):\n(3) Large majorities favor very heavy restrictions on middle and late-term abortions.",
    "So did this guy:\nCasey, who campaigned as a “pro-life Democrat,” voted to open debate, but Casey’s “office did not answer follow-up questions on whether Casey would also support final passage of the legislation, or whether he has changed his position on abortion rights.” https://t.co/w414Re7tfo https://t.co/zitnIdpX17\n— John McCormack (@McCormackJohn) February 28, 2022\nAll Republicans, including pro-choice ones, opposed it, along with Manchin.",
    "/end\n— Guy Benson (@guypbenson) December 3, 2021\nWe can debate whether various state-level abortion restrictions are out of the mainstream (statutes in places like Mississippi and soon Florida fall within US and international norms, whereas other policies are more extreme) -- but few approach the pro-abortion radicalism in states like Oregon, which national Democrats have now voted to inflict upon the entire country.",
    "Details on the vote and what it means for Dems @NRO: https://t.co/zJa9wK5koT\n— Alexandra DeSanctis Marr (@xan_desanctis) February 28, 2022\nVulnerable 2022 Democratic incumbents from Arizona's Mark Kelly, to New Hampshire's Maggie Hassan, to Nevada's Catherine Cortez Masto all lined up to vote with Chuck Schumer to advance this breathtaking measure.",
    "It appears there are precisely two Democrats in all of Congress (Rep. Henry Cuellar of Texas and Sen. Joe Manchin of West Virginia) who oppose unlimited, taxpayer-funded, full-term elective abortion-on-demand:\nThe Senate fails to invoke cloture on the pro-abortion Women’s Health Protection Act in a 46-48 vote, with four senators not voting.",
    "As Rebecca covered last night, Senate Democrats returned from their recess and their first order of business -- in the midst of multiple bona fide crises, mind you -- was to bring up a truly radical, majority-opposed measure that would have imposed a national law legalizing abortion-on-demand throughout all nine months of pregnancy.",
    "If someone wanted to abort her late-term, viable unborn daughter in month eight after deciding that the notion of having a girl instead of a boy constituted an undue tax upon her \"mental health,\" that 'choice' would not only be legal in all 50 states -- a non-doctor could perform the deadly procedure.",
    "These preferences reflect the laws in many countries across the globe, and there isn’t much of a gender gap between men and women on these questions…\n— Guy Benson (@guypbenson) December 3, 2021\n(4) The national Republican position on abortion is to the right of a majority of the American people.",
    "There's 'pro-choice,' then there's this pro-abortion monstrosity:\nThe WHPA is an effort to “codify Roe,” not only declaring abortion a fundamental right — for any reason, throughout all of pregnancy — but also nullifying any state law that prohibits or regulates abortion.",
    "Abortion extremism has since become a special interest-driven litmus test within the Democratic Party, enforced by the journalist class:\nAmidst talk of asymmetric polarization, recall that the late term abortion restrictions passed under Bush with a bipartisan majority.",
    "Increasing safety standards at clinics could save women's lives, but such details might get in the way of more abortions taking place, so such state-level requirements would be barred under the Democrats' bill.",
    "It's the equivalent of Congressional Republicans introducing a bill that would outlaw all abortions from the moment of conception, with no exceptions whatsoever, including to save the life of the mother.",
    "Back in 2003, when George W. Bush was president, a late-term 'partial-birth' abortion ban passed the Senate by a 30-vote margin, with almost 20 Democrats voting in favor of the restriction.",
    "Every single Democratic member of Nancy Pelosi's caucus, save one, voted in favor -- including alleged 'moderates' running for Senate like Conor Lamb of Pennsylvania and Tim Ryan of Ohio.",
    "Many in the GOP would oppose such a bill, which would undoubtedly generate a high-decibel media firestorm, given how ideologically biased most journalists are on this particular issue.",
    "The national Democratic position is significantly to the left of a substantially larger majority, but most culture shapers (media, entertainment) share that extreme stance.",
    "It would prohibit even the most modest regulations such as informed-consent laws, waiting periods, ultrasound requirements, and even safety standards for abortion clinics.",
    "Yet House Democrats passed this grotesque legislation with little attention or fanfare (outside of the abortion lobby, which effectively forced the vote) last fall.",
    "https://t.co/TTQ3h54Pz2\n— Zaid Jilani (@ZaidJilani) February 28, 2022\nThe only people standing in the way of said extremism are voters.",
    "More sickening details:\nCreating a right to abortion “all the way through pregnancy” in all 50 states is exactly what the WHPA does.",
    "It would nullify bans on abortions chosen for discriminatory reasons, such as the unborn child’s sex or diagnosis with a disability.",
    "The bill would forbid state laws protecting unborn children after they’re old enough to survive outside the womb.",
    "Democrats also want to scrap the longstanding 'Hyde Amendment' compromise and force taxpayers to fund abortions.",
    "The failed bill received the backing of 99 percent (264 of 266) of voting Congressional Democrats.",
    "Conscience protections for healthcare professionals who object to abortion would also be gutted.",
    "The bill also enshrines a right for non-doctors to perform abortions, even after viability.",
    "Now there's...one Senate Democrat who believes in some restrictions on abortion.",
    "Senator Joe Manchin was the only Democrat to oppose the bill.",
    "\"Safe, legal and rare\" is long gone within Democratic dogma.",
    "Perhaps that's a far-fetched illustration, perhaps not.",
    "One of them was Joe Biden, who is now this Joe Biden.",
    "As I said, this is extreme pro-abortion zealotry.",
    "That's not a distortion or an exaggeration.",
    "Last night was the Senate's turn."
  ]
}