{
  "id": 219,
  "mediaId": 8278,
  "date": "2022-02-25",
  "headline": "Valley Priest, Congregation Pray for Peace and Ukrainian People",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/02/fr-zhyback.jpg",
  "link": "https://businessjournaldaily.com/valley-priest-congregation-pray-for-peace-and-ukrainian-people/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan O'Brien",
  "authorUrl": "https://businessjournaldaily.com/author/dobrienbusiness-journal-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Brown said he would work with the Biden administration to carry out sanctions imposed by the U.S.\n“President Biden has made it clear the U.S. and our allies and partners will impose the strongest sanctions Russia has ever seen, and I will work with the Biden Administration to implement them against Russian officials and oligarchs who prop up Putin’s regime,” Brown said.",
    "“You could sense the imperial desires of Czar Putin telling the whole world that Ukraine is part of Russia and how we should be thankful to the Bolsheviks.”\nZhyback says the only way to deter aggression from leaders such as Putin is a collective response from the rest of the world condemning Russia’s actions and supporting stringent economic sanctions.",
    "“Why don’t you for a moment place yourself in the shoes of the Ukrainian people who are currently facing such an adversary as Russia and then we’ll see what comments you’d be willing to make?”\nZhyback, who also has family members in Russia, requested that Carlson publicly apologize to all Ukrainians.",
    "You can only imagine how anxious and scared people are.”\nEarly Thursday morning, Russian President Vladimir Putin ordered a “special military operation” against Ukraine, citing protection for people in the Russian-backed separatist region of Donbas in eastern Ukraine.",
    "“Now is not the moment for partisan division – Americans stand united with all our NATO allies, and we pray for the people of Ukraine.”\nU.S. Reps. Tim Ryan, D-13, and Bill Johnson, R-6, both condemned Putin’s aggression and voiced support for Ukraine.",
    "The pastor took special aim late last month in a letter to Fox News host Tucker Carlson, who commented on his show that Ukraine is “strategically irrelevant” and questioned why the United States should support that country over Russian interests.",
    "President Putin’s justification for this attack, to ‘de-Nazify’ Ukraine, along with his comments about the illegitimacy of the sovereign nations of Estonia, Latvia, Lithuania, and Poland, is cause for further alarm,” he said.",
    "YOUNGSTOWN, Ohio — The congregation was thin and the mood somewhat somber as three parishioners joined Father Lubomir Zhyback for liturgy services at the Holy Trinity Ukrainian Catholic Church Thursday morning.",
    "The United States and its allies have agreed to block the assets of Russia’s four largest banks, impose export controls intended to squeeze tech shipments to Russia, and sanction the country’s oligarchs.",
    "“I think your comments not only offend us, Ukrainians, but also the millions of Ukrainian people who have been murdered by the Soviets and Russians throughout the course of history,” the letter scolded.",
    "We pray that the Ukrainian people will muster the courage and strength they need in this dark time.”\nAs for Zhyback, he hopes that the Russian people will realize Putin’s folly and protest his actions.",
    "“Last night, a missile hit the airport in Ivano-Frankivsk,” a city in western Ukraine where Zhyback was born and is just miles from where he grew up in Tysmenysta, where his mother still lives.",
    "“We’re all praying for Ukraine.”\nThe church at 526 W. Rayen Ave. was established in 1911 and has long been a cultural and spiritual center for the Youngstown area Ukrainian community.",
    "Biden, for now, declined to impose tougher measures such as cutting Russia from the Swift payment system, which allows the transfer of money from bank-to-bank around the world.",
    "While the effort to install democratic institutions during the 1990s in Ukraine was difficult, Zhyback says the country is far better off without a Kremlin-backed government.",
    "Ohio’s two U.S. senators, Democrat Sherrod Brown and Rob Portman, a Republican who is co-chair of the Senate Ukraine Caucus, both support tough sanctions against Russia.",
    "The first immigrants from Ukraine settled in Youngstown in 1887 and by 1909, about 150 Ukrainian families had moved into Youngstown, according to the church’s website.",
    "“What country is next?”\nZhyback says anti-Ukrainian sentiment from political pundits inside the United States does little to help the beleaguered country’s cause.",
    "“Vladimir Putin’s insatiable pursuit of power has driven him to a decision that will kill innocent men, women and children in a democratic nation,” Ryan said.",
    "Zhyback, 44, was born in Ukraine under Russian rule and was optimistic when his country gained independence in 1991 after the collapse of the Soviet Union.",
    "Putin said that those in the Donbas had been “subjected to abuse and genocide by the Kyiv regime for eight years.”\nZhyback doesn’t believe a word of it.",
    "“I was texting with my mother-in-law, and she’s scared,” he says, noting she wrote a veiled plea for the couple to bring her to the United States.",
    "A recent speech by Putin regarding the Russian military buildup on Ukraine’s borders provided clues as to the leader’s intentions, Zhyback says.",
    "Zhyback says he understands the concerns of western nations and dealing with a nuclear power such as Russia and a volatile leader such as Putin.",
    "Throughout the night, Zhyback had been in contact with family members living in Ukraine as Russian forces began their assault on the country.",
    "It’s just awful.”\nMines, who is Ukrainian by heritage but was born in Poland, says other members of the congregation share her views.",
    "“Something needs to be done,” Zhyback says, to prevent Putin taking possible future military action on other European countries.",
    "Putin’s actions have spurred bipartisan condemnation from lawmakers across Ohio, all of whom urge swift, strong retaliation.",
    "Indeed, Zhyback says the world should pray for peace and pray that Putin has a change of heart and withdraws his forces.",
    "“The United States should lead the international community to hold Russia accountable for this tragedy,” Portman added.",
    "“Make no mistake: Putin will regret this decision.”\n“We’ve seen nothing like this in Europe since WWII,” Johnson said.",
    "The president also announced the U.S. would deploy about 7,000 troops to Germany in support of NATO forces in Europe.",
    "Zhyback has been in the United States for about 10 years and he understands the resolve of the Ukrainian people.",
    "“This unwarranted brutality will kill thousands of innocent people and create a massive humanitarian crisis.",
    "Zhyback responded with a letter sent to the Fox News host through the networks’ online feedback form.",
    "“Did you get any sleep last night?” one church member asked Zhyback after the service concluded.",
    "“Putin chose this war, and now he and his country will bear the consequences,” Biden said.",
    "The pastor posted the letter to the church’s Facebook page Jan. 31 as the crisis deepened.",
    "“He’s got blood on his hands.”\nCopyright 2022 The Business Journal, Youngstown, Ohio.",
    "On Thursday afternoon, President Joe Biden announced broad sanctions against Russia.",
    "“Russia’s actions are an illegal, unjustifiable assault on Ukraine,” Portman said.",
    "There are no winners in war, only horrific death and catastrophic destruction.",
    "I’m angry,” the pastor answered shaking his head and bowing slightly forward.",
    "“This needs a strong, unified response from the civilized world,” he says.",
    "“I feel terrible,” church member Mary Mines says of the Ukraine crisis.",
    "“There are millions of innocent civilians who don’t want conflict.",
    "Most of Zhyback and his wife’s families live in Ukraine, he says.",
    "“The man is a coward, a bully and needs to be stopped,” he says.",
    "He also knows that they need help on a global scale.",
    "He has not received a formal reply from the network.",
    "Ukrainian leaders have called for such a sanction.",
    "“I’d be willing to go on his show,” he says.",
    "“He’s targeting the western part of Ukraine.",
    "“They didn’t do anything to deserve this.",
    "“I speak Russian fluently,” he says.",
    "Ukraine is not a member of NATO.",
    "His parishioners agree.",
    "“I’m mad."
  ]
}