{
  "id": 2799,
  "mediaId": 2658,
  "date": "2022-01-31",
  "headline": "TheGROUP adds another Republican",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/01/31/thegroup-adds-another-republican-00003878",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2651,
    3006,
    3664,
    4221,
    4397,
    5506,
    4905,
    5856,
    392,
    1126
  ],
  "sentences": [
    "John Boozman, Mike Crapo, Chuck Grassley, John Hoeven, Ron Johnson, John Kennedy, James Lankford, Mike Lee, Mitch McConnell, Jerry Moran, Lisa Murkowski, Rand Paul, Marco Rubio, Tim Scott, John Thune, Todd Young, NRSC)\nNew PACs\nAmerica The Great PAC (PAC)\nCalifornians for Safe and Healthy Communities (Super PAC)\nNORTH CAROLINA GRASSROOTS GOVERNMENT PAC (PAC)\nPA For PA (Super PAC)\nPennsylvania Conservative Fund (Super PAC)\nWeb 3.0 PAC (Super PAC)\nNew Lobbying Registrations\nCapitol Counsel LLC: Verizon Communications, Inc.\nConrad Law & Policy Counsel: American Forest & Paper Association\nEmanuel & Associates, Inc. (Fka Adam Emanuel): Halo Maritime Defense Systems\nHair Of The Dog Outfitters, LLC: Elizabeth Buckley On Behalf Of Conley Immigration Firm\nLocke Lord LLP: Alternate Concepts, Inc.\nLocke Lord LLP: America's Mutual Banks\nLocke Lord LLP: Bally'S Corporation\nLocke Lord LLP: Hill Country Class 3, LLC\nLocke Lord LLP: Intel Corporation\nLocke Lord LLP: Landry's\nLocke Lord LLP: Steward Healthcare Systems\nOthram, Inc.: Othram, Inc.\nS-3 Group: American Unity Fund\nThe Majority Group, LLC: House Canary, Inc.\nVan Scoyoc Associates: Waterways Council, Incorporated\nNew Lobbying Terminations\nDc Strategies Group, LLC: National Association Of Mortgage Brokers\nFaegre Drinker Biddle & Reath LLP: Bluenalu Inc.\nLeblanc Government Relations, LLC: United States Seafoods LLC\nMcdermott+Consulting LLC: Lifecare 2.0, LLC\nS-3 Group: Military Housing Association\nThe Majority Group, LLC: Michael Best Strategies, LLC On Behalf Of Housecanary, Inc.",
    "It’s supposed to be shared and borderless, operating with full transparency and no centralized leader pulling the strings — not a big business that curries favor with lawmakers behind closed doors and seeks legal loopholes.”\nVOGEL GROUP’S JOHNSON JUMPS TO VETERANS ADVOCACY GROUP: Brian Johnson, a principal at the Vogel Group, is moving in-house to become the first vice president of government and public affairs for Veterans Guardian, a consulting group focusing on VA benefits claims.",
    "— “Robert Califf, who was first nominated more than two months ago, is agreeing to not seek employment or compensation from any pharmaceutical or medical device company that he interacts with ‘for four years’ following his time in government, according to a letter he sent to the Massachusetts Democrat and obtained by POLITICO.”\n— “A spokesperson for Warren said that, should Califf’s nomination ultimately come to a vote, the Massachusetts Democrat plans to support him.",
    "GRASSLEY ALUMS SQUEEZE DOJ OVER SILENCE ON AL JAZEERA’S FARA OBLIGATIONS: A whistleblower and oversight advocacy group formed by former staffers to Senate Judiciary ranking member Chuck Grassley (R-Iowa) launched a new push over the weekend for documents from the Justice Department relating to the department’s reported letter of determination that Qatar-based Al Jazeera’s digital news outlet AJ+ is required to register as a foreign agent.",
    "— Al Jazeera did not immediately respond to a request for comment, but has previously referred to calls for it to register as “baseless.” In response to the Times report detailing DOJ’s letter of determination, Al Jazeera “strongly condemned” the order, according to an article on its site, and accused its regional foe, the United Arab Emirates, of demanding the order in return for agreeing to normalize relations with Israel.",
    "“The public has a right to know why Justice Department has failed to enforce FARA in this instance and failed to be responsive to congressional oversight on this topic.” The group is asking for documents relating to DOJ’s processing and response to “to all Congressional correspondence regarding Al Jazeera or any of its affiliates and FARA,” including the three letters they reference, two of which Grassley helped spearhead.",
    "He told the senator that “I do not intend or expect to seek a waiver from any of these recusals.”\nTWO ROADS DIVERGE FOR NFT ADVOCATES: The non-fungible token industry’s efforts to shape future regulations governing the sale of digital assets “is causing tension between factions of the Web3 world, an emerging group of companies pushing the idea of a more decentralized Internet,” Fortune Magazine’s Nicole Goodkind reports.",
    "TheGROUP adds another Republican\nBy CAITLIN OPRYSKO\n01/31/2022 05:39 PM EST\nWith Daniel Lippman\nTHEGROUP ADDS ANOTHER REPUBLICAN: TheGROUP D.C., the lobbying firm whose ties to the Biden administration and Democratic lawmakers have fueled a business boom over the past year, has added a second Republican lobbyist to its ranks as the GOP appears poised to retake the House in November’s midterms.",
    "— She was most recently Rep. Steve Chabot’s (R-Ohio) top aide, and before that was chief of staff to Rep. Mike Turner of Ohio, the top Republican on the Intelligence Committee, and former Rep. Jon Runyan (R-N.J.), but she got her start on the Hill as a fellow in the Congressional Black Caucus Foundation’s fellowship program in the office of Del.",
    "— “It was just a really great opportunity that presented itself that provided me both the leadership ability to run a D.C. office and the opportunity to not only work for a company in my home state, but to really work to help support something I really didn't know much about but really came to fall in love with,” Johnson said in an interview.",
    "In that letter, DOJ counterintelligence chief Jay Bratt wrote that “journalism designed to influence American perceptions of a domestic policy issue or a foreign nation’s activities or its leadership qualifies as ‘political activities’ under the statutory definition,” according to The New York Times.",
    "She previously led executive strategy development and management for the Centre for the Fourth Industrial Revolution at the World Economic Forum and co-hosts the CoinDesk show “Money Reimagined.”\n— Tiffany Smith has joined the National Foreign Trade Council as vice president for global trade policy.",
    "TheGROUP has deep ties to Washington’s most powerful Democrats, employing President Joe Biden’s former Hill liaison, a top former staffer to White House aide Cedric Richmond and HHS Secretary Xavier Becerra, a former aide to Speaker Nancy Pelosi, and Obama White House and campaign alums.",
    "— Warren isn’t the only Democrat crucial to Califf’s confirmation “concerned by Califf’s $2.7 million paycheck for advising the Alphabet-owned Verily Life Sciences … along with board seats Califf held on two other pharmaceutical companies” following his first turn as FDA commissioner.",
    "But others, many steeped in the original independent ethos of Web3, fear that will lead to regulation for all being influenced by a few big players.”\n— “Some industry groups have lobbied in Washington on NFT-related matters almost since NFTs were created in 2014.",
    "— In a letter to the department over the weekend the group, called Empower Oversight Whistleblowers & Research, noted that members of Congress have been pushing since 2018 for Al Jazeera, which receives funding from the Qatari government, to register under FARA.",
    "— “As of today, the Justice Department appears to have been entirely unresponsive to the congressional oversight letters on this issue,” the group wrote in its FOIA request, which came days before Biden welcomed the Qatari emir to the White House this afternoon.",
    "FDA PICK MAKES ETHICS PLEDGES TO WIN OVER WARREN: Biden's nominee to lead the FDA \"is making major ethics concessions to Sen. Elizabeth Warren as he tries to lock down critical confirmation votes,” POLITICO’s Laura Barrón-López and Adam Cancryn report.",
    "In the letter, Califf also agreed to a four-year period in which he will recuse himself from decisions before the agency related to companies with which he had relationships,” up from the two years outlined in the Biden administration’s ethics pledge.",
    "— Dentons Global Advisors-ASG is adding Xiaoqing Boynton as senior vice president for China, Paul Triolo as senior vice president for China and technology policy lead, and Kevin Allison as vice president for Europe and Eurasia and technology policy.",
    "The group claimed that threeletterson the issue from lawmakers to the department — sent over three years and multiple administrations — have gone unanswered, even after DOJ reportedly informed Al Jazeera of its obligations to register AJ+ in 2020.",
    "Coin Center, founded in 2014, and the Blockchain Association, in 2018, have tried to educate lawmakers about the larger decentralized finance industry, but they are both nonprofits, and relatively small and underfunded.",
    "— The group is also asking for the department’s communications regarding FARA and Al Jazeera and its affiliates, or between DOJ and the media network’s or Qatar’s representatives, including the letter of determination.",
    "The UAE denied the accusation, though the country’s lobbyists had previously made the argument that Al Jazeera should be required to register similar to media outlets owned and controlled by China, Russia and Turkey.",
    "Johnson, who had previously served as a tax lobbyist at the American Petroleum Institute, will head Veterans Guardian’s D.C. office and also manage the group’s PAC as it works to expand its footprint in Washington.",
    "— Herald Group has promoted CC Jaeger and Kevin Manning to vice president, Caroline Ponseti to senior director, Christian Stellakis to director and EC Wheatley and Colin Hensel to senior digital associates.",
    "Flugrath previously served as communications strategy director for the Anti-Defamation League’s Southern Division and is an alum of Florida state Agriculture Commissioner Nikki Fried’s office and campaign.",
    "— The government affairs technology platform Phone2Action has changed its name to Capitol Canary effective today, and is rolling out new advocacy and GOTV tools ahead of the midterms.",
    "— “Additionally, a number of crypto companies — NFTs are bought using cryptocurrency — and the venture capital firms that invest in them are increasing their overall lobbying.",
    "She was previously a staffer for the House Appropriations Committee for more than two decades, most recently serving as minority clerk for the Homeland Security subcommittee.",
    "She previously served as senior policy advisor in Mayer Brown’s international trade and government relations practices, and is a USTR, Senate and Commerce Department alum.",
    "— The firm’s annual lobbying revenues more than doubled since Democrats assumed total control of Washington, from $3.6 million in 2020 to $7.5 million in 2021.",
    "— Former Deputy U.S. Trade Representative Rufus Yerxa has joined the trade practice at the strategic advisory firm McLarty Associates, per Morning Trade.",
    "She was most recently communications director at the Internet Association, and is a Phil Roe, Energy & Commerce, PhRMA, and Finsbury Glover Hering alum.",
    "… But critics say that direct lobbying by major NFT and cryptocurrency companies betrays the promise of Web3 as truly democratizing the Internet.",
    "The firm plans to keep adding Democrats and Republicans to its roster, and told PI that neither GOP addition is tied to any particular election.",
    "That’s all changing,” with NFT platform Dapper Labs last year becoming the first company to disclose federal lobbying on NFTs specifically.",
    "He most recently was director for U.S. government and public affairs at EMD Serono, and is a Mike Bishop and House Ways and Means alum.",
    "He was most recently general counsel for Senate Majority Leader Chuck Schumer and is a Perkins Coie, Treasury and Tom Daschle alum.",
    "Boynton most recently was at the Biotechnology Innovation Organization, and Triolo and Allison were at the Eurasia Group.",
    "He previously was communications director for Senate Energy and Natural Resources ranking member John Barrasso (R-Wyo.).",
    "— Rachel Bisi Lawlor is now senior manager for public policy at Amazon, where she engages with state attorneys general.",
    "He is the former associate administrator in the office of strategic communications at GSA in the Trump administration.",
    "— After leaving the Hill last year, Palmer Barton served as vice president of government affairs at SourceAmerica.",
    "She most recently served as the vice president of government affairs and assistant general counsel for Sodexo.",
    "— “Some want to follow the path of large industries before them, including lobbying by individual companies.",
    "Stacy Palmer Barton, a former chief of staff to three House Republicans, is joining the firm as a principal.",
    "Last year, TheGROUP added its first Republican lobbyist, former Energy Department official Dwayne Bolton.",
    "New Joint Fundraisers\nRyan Rose Victory Fund (Rep. Tim Ryan, Max Rose for Congress)\nTeam McConnell (Sens.",
    "— Mark McHale is now vice president for public affairs and community relations at Ritter Communications.",
    "She most recently was associate attorney in the state attorneys general practice at Cozen O'Connor.",
    "Daley previously spent five years as a legislative director at Polsinelli and worked for Barrasso.",
    "— Tiffany Haverly is now communications director and senior adviser to Rep. Adrian Smith (R-Neb.).",
    "— Max Flugrath is joining the Georgia state Democratic Party as senior communications adviser.",
    "He most recently served as vice president of government relations for Utah State University.",
    "— Daniel Harder is now director for government affairs and public policy at Biogen.",
    "— Robert Daley joined the National Association of ACOs as a senior policy adviser.",
    "— Nancy Bukar has joined Otis Worldwide as chief government relations officer.",
    "— The Biosimilars Forum has named Julie Reed as its new executive director.",
    "Spencer Cox’s office as senior adviser of legislative affairs and policy.",
    "— Sheila Warren has been named CEO of the Crypto Council for Innovation.",
    "— Mark Patterson is joining the Brunswick Group as a senior adviser.",
    "He was most recently the head of the National Foreign Trade Council.",
    "Jobs Report\n— Dena Baron Smith is joining Invariant as a lobbyist.",
    "— Mike Danylak is now a senior vice president at the CGCN Group.",
    "— Cyrus Vance Jr. has joined Baker McKenzie as a partner.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "The Moyer Group: Federal Bar Association\nFollow Us",
    "He was previously Manhattan district attorney.",
    "The Justice Department declined to comment.",
    "Send lobbying tips: coprysko@politico.com.",
    "— Neil Abercrombie is joining Utah Gov.",
    "She was previously its president.",
    "Good afternoon and welcome to PI.",
    "Eleanor Holmes Norton (D-D.C.)."
  ]
}