{
  "id": 3377,
  "mediaId": 8323,
  "date": "2022-01-27",
  "headline": "Proposed project could bring naval shipyard, thousands of jobs to Lorain",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/01/Capture-8.jpg?w=1280",
  "link": "https://fox8.com/news/proposed-project-could-bring-naval-shipyard-to-lorain/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stan Boney",
  "authorUrl": "https://www.wkbn.com/author/stan-boney/",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s not a done deal yet and there’s the potential of 2,500 to 4,000 jobs being created in Northeast Ohio\nThe office of Congressman Tim Ryan released this statement Thursday night, “Congressman Ryan has been working with Bartlett Maritime Corporation for over a year on this project… While the project remains under development, he is supportive and hopeful it will come to fruition.”",
    "“That report publicly disclosed that for the prior decade, our attack submarine, the U.S. Navy attack submarines, were not getting the proper maintenance that they required,” said Bartlett.",
    "The document states the plan would restore critical naval shipyard capacity and capability and that it would solve the submarine maintenance crisis within the Navy’s budget limitations.",
    "LORDSTOWN, Ohio (WKBN / WJW) – A proposal is being discussed within the U.S. military, the White House and others in Washington that could potentially bring a naval shipyard to Lorain.",
    "“We expect, based on preliminary work we’ve done with the construction folks, that the Lordstown site will be up and operating in about 24 months after that,” said Bartlett.",
    "It would include two dry docks for submarines in an enclosed production facility and would employ between 2,000 to 3,000 people.",
    "Bartlett spent much of his career on submarines and developed the Lordstown-Lorain Project because of a November 2018 report.",
    "The idea for the project came from former Navy officer Captain Ed Bartlett, who runs Bartlett Maritime in Broadview Heights.",
    "The project would involve the city of Lorain and the village of Lordstown, separated by 80 miles of the Ohio Turnpike.",
    "So there’s national rail access, and because of the interstate connections — the turnpike, 76 and 80,” said Bartlett.",
    "The maintenance of the submarine parts and those from aircraft carriers docked elsewhere would be done in Lordstown.",
    "According to the document, the shipyard would bring the total number of certified naval shipyard dry docks to 20.",
    "“The reason Lordstown is attractive to us is because of the rail network there with CSX and Norfolk Southern.",
    "Officials have forwarded a 27-page document that outlines what will be called the Lordstown-Lorain Project.",
    "Bartlett called it a multi-billion dollar project that would involve both private and government money.",
    "Mayor Hill said several sites are being looked at in Lordstown, but nothing has yet to be selected.",
    "“As of today, I’d say we’re on the five-yard line and we just have to knock it in,” said Bartlett.",
    "It would be a new construction site that would employ from 500 to 1,000 people.",
    "At the same time, the American Naval Depot would be built in Lordstown.",
    "Barlett’s plan is to build an American Naval Shipyard in Lorain.",
    "AFL-CIO signed off on the project in Washington on Thursday.",
    "He hopes to have broken ground by this fall."
  ]
}