{
  "id": 384,
  "mediaId": 8491,
  "date": "2022-02-24",
  "headline": "‘We must make him pay’: Local lawmakers speak out against Ukraine invasion",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/02/tim-ryan-and-rob-portman.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/we-must-make-him-pay-local-lawmakers-speak-out-against-ukraine-invasion/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patty Coller",
  "authorUrl": "https://www.wkbn.com/author/patty-coller/",
  "termIds": [
    0
  ],
  "sentences": [
    "I urge democratic leaders across the globe to unite and respond decisively to this unjustified and unlawful attack.Frances and I pray for the people of Ukraine, as well as the Pennsylvanians who have loved ones living in Ukraine.”\nPennsylvania Governor Tom Wolf\nCongressman Tim Ryan, D-13th District had stern words for Vladimir Putin.",
    "Make no mistake: Putin will regret this decision\nCongressman Tim Ryan\nIn unleashing Moscow’s most aggressive action since the Soviet invasion of Afghanistan in 1979, President Vladimir Putin deflected global condemnation and cascading new sanctions — and chillingly referred to his country’s nuclear arsenal.",
    "The international community must now strengthen these sanctions to ensure the economic consequences will be damaging enough to the Russian economy to stop the aggression and avoid a dangerous escalation of the eight-year-old war in Ukraine.”\nSen.",
    "I call on President Biden and his team, working with our allies across the globe, to impose immediate, tougher – as harsh as possible – sanctions and export controls to create more of an effective deterrent on Putin’s tyranny.",
    "Ukraine’s government said Russian tanks and troops rolled across the border and accused Moscow of unleashing a “full-scale war” that could rewrite the geopolitical order and whose fallout already reverberated around the globe.",
    "He threatened any foreign country attempting to interfere with “consequences you have never seen.”\nPennsylvania’s senators, Democrat Bob Casey and Republican Pat Toomey are calling Putin a brutal dictator who must be stopped.",
    "“The international community, including the U.S., EU, UK, Canada, Australia and others have now made it clear that Russia will face economic consequences for violating international law and Ukraine’s territorial integrity.",
    "The United States, in coordination with our European allies, must impose the strongest possible sanctions and work swiftly to make him pay for the pain and suffering he has already caused and will continue to cause.",
    "The Biden administration’s plans to impose sanctions on Nord Stream 2 and its CEO, along with Germany’s decision to finally suspend certification of the Nord Stream 2 pipeline, is also welcome news.",
    "What has been tried thus far clearly did not work.”\nCongressman Bill Johnson\nSenator Rob Portman, R-Ohio, said President Biden’s sanctions were an important first step but doesn’t go far enough.",
    "He released an official statement on Thursday:\nVladimir Putin’s insatiable pursuit of power has driven him to a decision that will kill innocent men, women and children in a democratic nation.",
    "Rob Portman\nPennsylvania Governor Tom Wolf said he stands with President Biden in condemning the attack and called the military action unprovoked and unjustified.",
    "The United States has the power to cripple Russia financially because it controls the flow of dollars, which is the most accepted universal currency.",
    "“Andrea and I are praying for the Ukrainian people and our Ukrainian-American friends and neighbors who are watching these events unfold in horror.",
    "Both lawmakers also support the harsh sanctions on Russia and see them as a way to show the world that such behavior will not be tolerated.",
    "“I think we have to show Putin that we’re not kidding around this is going to be devastating to your economy,” Toomey said.",
    "Ohio and Pennsylvania lawmakers were quick to react to the violence and spoke in unison in condemning the invasion.",
    "YOUNGSTOWN, Ohio (WKBN) – Local lawmakers were swift to react to Russia’s wide-ranging attack on Ukraine Thursday.",
    "Ohio Congressman Bill Johnson, R-6th District, said we’ve seen nothing in Europe like this since World War II.",
    "Thinking about the unnecessary loss of life and suffering that will occur in Ukraine is very somber.",
    "“There is only one person responsible for the tragedy unfolding in Eastern Europe: Vladimir Putin.",
    "“Putin has made his decision, and now we must make him pay,” Ryan wrote in a Tweet.",
    "This attack on a peaceful country is shocking and its impacts will be far reaching.",
    "“We have to be determined to exact a price because of what he’s doing.",
    "Russia’s military hit cities and bases with airstrikes or shelling.",
    "We stand united with the Ukrainian people,” Casey said.",
    "Toomey says don’t dismiss economic sanctions.",
    "We stand with you today and every day."
  ]
}