{
  "id": 3947,
  "mediaId": 2569,
  "date": "2022-01-22",
  "headline": "Facing tough ’22 elections, Dems want a year of achievements",
  "image": "https://floridapolitics.com/wp-content/uploads/2022/01/schumer.jpeg",
  "link": "https://floridapolitics.com/archives/489026-facing-tough-22-elections-dems-want-a-year-of-achievements/",
  "mediaOutlet": "floridapolitics.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://floridapolitics.com/archives/author/associatedpress/",
  "termIds": [
    0
  ],
  "sentences": [
    "She said Biden should issue executive orders easing pharmaceutical prices and student debt, and House Democrats should send popular bills to the Senate, where Republican-inflicted defeats would let “people understand that Democrats are fighting on these particular issues.”\nParty leaders expect to renew talks on the social and environmental bill soon and hope to have a deal, or be near one, by Biden’s March 1 State of the Union address.",
    "Congress\nCongressional Progressive Caucus\ndemocrats\nfederal\nJoe Biden\nRepublicans\nStaring at midterm elections that could cost them control of Congress, Democrats are trying to sculpt a 2022 legislative agenda that would generate achievements and reassure voters that they’re addressing pocketbook problems and can govern competently.",
    "“If we do these things, boom, boom, boom, boom, we can start reclaiming the narrative.”\nHouse Budget Committee Chairman John Yarmuth, a Kentucky Democrat, said Democrats would benefit politically by rescuing the child tax credit because it’s one of the few components of the social and economic bill voters would feel before November.",
    "Other Pelosi priorities include benefits for veterans who served near toxic burn pits in Iraq and Afghanistan that could cost hundreds of billions of dollars, a measure addressing the computer chip shortage and other competitiveness issues, and a bill combating Russia’s threatened invasion of Ukraine with sanctions and other steps.",
    "“His term does not end tomorrow.”\nIn one microcosm of Democrats’ differences, Manchin has shown little enthusiasm for extending the enhanced child tax credit and its monthly checks for recipients, dampening its prospects and prompting Biden to express doubts about its survival.",
    "Yet also imprinted on voters’ minds are the months of Democratic infighting over priorities that saw holdouts embarrass Biden and party leaders by scuttling two top goals: their roughly $2 trillion, 10-year social and environment measure and voting rights legislation.",
    "He said that’s put many on the left “in a funk.”\nAnd while the economy, job creation and the stock market have been strong and COVID-19 vaccines widely available, concerns are widespread over inflation, the persistent pandemic and Russia’s threat to Ukraine.",
    "But revisiting the social and environment measure — which initially contained popular programs to restrain prescription drug prices, send monthly checks to families with children and curb global warming — is seen as a political imperative by many Democrats.",
    "“Democracy seems under attack on every front; the Democratic trifecta can’t get things across the finish line,” Adam Green, cofounder of the Progressive Change Campaign Committee, said of Democratic control of the White House, Senate and House.",
    "That’s going to be what people think about when they vote in November.”\nTo achieve that, Democrats are looking to claim election-year wins in a Congress they steer with almost no votes to spare, often against solid Republican opposition.",
    "“This tax cut for families is just something we should go right back to,” said Rep. Tim Ryan, an Ohio Democrat, who is running for Senate and says Democrats communicated their working-class priorities poorly last year.",
    "In a poll released Thursday by The Associated Press-NORC Center for Public Affairs Research, Biden hit a low for his year-old presidency with more people disapproving than approving of his job performance, 56% to 43%.",
    "It’s a risky endeavor because Sen. Joe Manchin has already derailed the legislation once, but Biden has conceded he’d accept a smaller package and Democrats could still claim victory with a more modest version.",
    "They’re also debating the value of crafting other popular bills and essentially daring GOP lawmakers to defeat them, producing fodder for campaign ads but reminding constituents of Democrats’ 2021 failures.",
    "Crafting an agenda that produces legislative success, not just setups for failure to expose Republican intransigence, could be crucial for Democrats in a year with political headwinds blowing against them.",
    "“We have to put everything to the metal for the next six weeks” to rewrite and pass that bill, said Rep. Pramila Jayapal, a Washington Democrat, who leads the Congressional Progressive Caucus.",
    "”People want to see government work and expect us to help move things forward,” said Rep. Suzan DelBene, a Washington Democrat, chair of the New Democrat Coalition, a House centrist group.",
    "“When there’s no path forward, then you work on other things that will have very strong impact,” said Democratic Rep. Susan Wild, who represents a competitive Pennsylvania district.",
    "An early focus will be a $1.5 trillion bill financing government through September and perhaps providing further aid to cope with omicron, the highly contagious COVID-19 variant.",
    "After months of talks pitting progressives against moderates, Democrats had squeezed a compromise social and environment bill through the House in November over GOP opposition.",
    "Last year, President Joe Biden and congressional Democrats notched two massive accomplishments: a $1.9 trillion COVID-19 relief bill and a $1 trillion infrastructure package.",
    "“They’re seeing things Biden put political capital behind fail,” Sean McElwee, cofounder of the liberal research group Data for Progress, said of Democratic voters.",
    "Biden has predicted “big chunks” of the original bill will be enacted, including money for free pre-Kindergarten and over $500 billion for climate change efforts.",
    "She said Democrats should compromise with Manchin and put omitted initiatives into separate bills, such as capping insulin costs at $35 monthly.",
    "The party holding the White House has lost House seats in 17 of the 19 midterm elections since World War II, averaging 28 losses per election.",
    "“I’m not going to spend all my time talking about what didn’t happen because we’ve got three more years” of Biden’s presidency, said Clyburn.",
    "Resurrecting the social and environment bill tops the 2022 wish list for House Speaker Nancy Pelosi and Senate Majority Leader Chuck Schumer.",
    "And three Northeastern Democrats want retention of federal tax breaks for people from places, like theirs, with high state and local levies.",
    "“If we can’t get that pushed through on a bipartisan basis, then something is truly wrong with our colleagues across the aisle,” Wild said.",
    "All this in a year of midterm elections, when lower turnout puts a premium on voting by each party’s most ideological loyalists.",
    "Manchin said rather than resuming where negotiations left off, “We just start with a clean sheet of paper and start over.” No.",
    "Lawmakers have already begun positioning over the renewed effort, underscoring how long and difficult such bargaining may be.",
    "But in a 50-50 Senate where Democrats can afford no defectors, Manchin shot it down in December, arguing it was too costly.",
    "3 House Democratic leader James Clyburn of South Carolina wants the package to keep its aid for affordable housing.",
    "She said voters will assess Democrats’ agenda for “the impact it has on their communities, on their families.",
    "“They need to see things Biden puts political capital behind succeed.”\nHistory bodes ill for Democrats.",
    "But the credit is a top priority for many, and Schumer and others have promised to try retaining it.",
    "Agency budgets run out Feb. 18 and bipartisan cooperation will be needed for a deal.",
    "Republicans would grab House control in November by gaining five seats.",
    "This puts a premium on honing a forward-looking legislative agenda.",
    "The IRS could quickly resume the now-expired monthly checks.",
    "____\nRepublished with permission from The Associated Press.",
    "Others say it’s time to recalibrate."
  ]
}