{
  "id": 4034,
  "mediaId": 8473,
  "date": "2022-01-23",
  "headline": "Congress is final hope for Delphi retirees",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/opinion/editorials/2022/01/congress-is-final-hope-for-delphi-retirees/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Mike DeWine announced the amount of money to maintain bridges under the jurisdiction of ...\nLaw deserves GOP nod in 65th district\nConfusion reigns supreme in this year’s primary election for state representative in the 65th House District ...\nOrchids and onions\n• ORCHID: To former Howland and John F. Kennedy tennis standout Lauren Kraker, a senior at Baruch College in New ...\nSunshine law violations must be punished\nThe Ohio Supreme Court is weighing a case about violations of the state’s open meetings law, including ...\nLook forward to new Ohio job opportunities\nHumans are stubborn creatures.",
    "I will continue to work with my colleagues in both parties to do just that.”\nU.S. Rep. Bill Johnson, R-Marietta, said, “Congress should come together and put any partisan differences aside and solve this once and for all.”\nU.S. Rep. Mike Turner, R-Dayton, said, “This decision will not stop me from pursuing legislative remedies and urging the Biden administration to get them the answers and treatment they deserve.”\nU.S. Sens.",
    "In a statement last week, the Delphi Salaried Retirees Association, headed by Bruce Gump, 70, of Trumbull County, described their reaction as “profound disappointment.”\n“The Pension Benefit Guaranty Corporation will continue to be allowed to terminate pensions without the workers and retirees who earned them having any opportunity to even object or check the numbers,” Gump said.",
    "Most salaried retirees lost 30 to 70 percent of their promised pensions after the Pension Benefit Guaranty Corporation, the insurer of last resort for the nation’s private retirement plans, took over control of the pensions after Delphi’s bankruptcy.",
    "Following last week’s high court denial, U.S. Rep. Tim Ryan, D-Howland, said, “Today’s decision highlights the need for congressional action to restore their pensions and provide them with the retirement benefits that they have always deserved.",
    "NEWSLETTER\nToday's breaking news and more in your inbox\nEditorials\nRoot cause of drug addiction must be targeted\nAs we step back from the sense of urgency with which we had been discussing the COVID-19 pandemic, an old plague ...",
    "However, what is troubling and wholly unfair is the company’s salaried retirees, who worked just as many years in the same manufacturing plants as the unionized workers, were omitted from that agreement and left out in the cold.",
    "That’s because the federal government under the Barack Obama administration and General Motors, one time owner of the Delphi parts division, worked out a deal to protect the pensions of Delphi’s unionized workers.",
    "A nearly 13-year legal battle came to a sad and anti-climactic end last week when the U.S. Supreme Court declined to hear an appeal involving the involuntary termination of the Delphi Salaried Pension plan.",
    "While lower court rulings have denied arguments that the salaried retirees were victims of discrimination because they were not represented by a labor union, we find it difficult to see it any other way.",
    "It’s time for our legislators in Washington to make their rhetoric a reality by bringing forth and passing legislation that will end this unfair action and ensure that it never happens again.",
    "GM continued contributing to union-represented retirees, “topping up” their reduced pensions, while salaried retirees were left with substantially reduced benefits.",
    "We believe this decision ranks high among the most egregious and unfair travesties carried out against law-abiding, hard-working citizens from our Mahoning Valley.",
    "“These men and women continue to suffer the results of the unequal and unfair treatment by the PBGC.”\nThe harsh reality of that statement is startling.",
    "The pensions they’d been promised as part of their compensation all those years first were frozen temporarily, and then they were cut significantly.",
    "Weeks prior to the 2020 election, Trump told his administration to look into what could be done for the retirees, but nothing ever came of it.",
    "Reports and analysts have estimated that, all told, the Delphi salaried retirees will lose some $440 million in pension benefits.",
    "That 2009 termination affected 20,000 seniors, many from the Mahoning Valley, who retired after decades of work for Delphi Corp.",
    "Sadly, since their pensions first were cut, the group has been let down by three presidents and multiple sessions of Congress.",
    "In the fall of 2020, both then-President Donald Trump and current President Joe Biden made campaign issues of this matter.",
    "The salaried retirees sued, and after more than 12 years, last week they learned their litigation could go no further.",
    "With the legal battle coming to an end, frankly, these legislators are the only remaining hope for this aging group.",
    "Since then, Biden said he was sympathetic to the retirees’ plight, stating pensions should be protected.",
    "He later told legislators raising inquiries about it that his administration could do nothing to help.",
    "They’ve been fighting for more than a dozen of what was supposed to be their golden retirement years.",
    "Rob Portman and Sherrod Brown of Ohio also have pledged support to these retirees.",
    "While it isn’t unusual to see pensions lost in bankruptcies, this case was unique.",
    "Submit bridge repair plans with urgency\nIn recent weeks, Ohio Gov.",
    "The rhetoric also has continued from legislators in Washington.",
    "That equals about $100 million in the Mahoning Valley alone.",
    "Now, we see no reason to resent that fact.",
    "Many of us are uncomfortable with change.",
    "In our anxiety about an evolving jobs ..."
  ]
}