{
  "id": 4185,
  "mediaId": 2570,
  "date": "2022-01-27",
  "headline": "Executives Say They’re Worried About Keeping Talent. Less Than A Third Say They’re Committed To Keeping Increased Pay.",
  "image": "",
  "link": "https://www.forbes.com/sites/jenamcgregor/2022/01/27/executives-say-theyre-worried-about-keeping-talent-less-than-a-third-say-theyre-committed-to-keeping-increased-pay/?sh=a6cd85a44a9f",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jena McGregor",
  "authorUrl": "https://www.forbes.com/sites/jenamcgregor/",
  "termIds": [
    0
  ],
  "sentences": [
    "Of all the many concerns top executives see as their biggest risks for 2022—a disrupted global supply chain, new Covid-19 variants, rising inflation or government regulatory changes—none ranks higher than their talent acquisition and retention challenges, according to a new survey by accounting and consulting giant PwC released Thursday.",
    "The survey, which queried nearly 700 U.S. C-suite leaders in January, nearly two-thirds of whom work for Fortune 1000 companies, showed that the incentive that the greatest percentage of employers were planning to continue was hybrid work arrangements, with 43% saying it was something they had implemented and planned to keep.",
    "Yet despite worries about talent shortages, and 77% of executives saying that hiring and retaining talent is “very important” to their growth, less than a third said they had implemented and were planning to keep increasing compensation for employees through sign-on bonuses and raises outside of the usual review cycle.",
    "“Many of our leaders in business are dealing with this for the first time in their careers.”\nRyan says he’s hearing CEOs zero in on four “Ts”: Talent, of course, as well as M&A transactions, which he expects will remain high in 2022; digital and climate “transitions,” or strategic changes in these areas; and trust.",
    "“You can’t simply buy your way out of this with raises.”\n—Tim Ryan, PwC U.S. chair\nOther than the talent shortage, C-suite executives responding to PwC’s survey said the biggest risks they face in 2022 were continued supply chain disruptions, the policy and regulatory environment and new Covid-19 variants.",
    "Even if companies revisiting such policies ultimately decide to keep them in place, the survey appears to show that business leaders are at an inflection point, cautious about making long-term commitments to some of the more challenging or costly measures they’ve had to implement so far.",
    "Depending on the industry, it could have a meaningful impact on their [profit & loss] statement.”\nTim Ryan, PwC U.S. chair, who also spoke Thursday on a call describing the survey’s results, says they’ve found that investments in the employee experience can reduce turnover.",
    "In a memo to employees, Bank of America CEO Brian Moynihan announced a pool of $1 billion in restricted stock that would be allocated and awarded to employees who make less than $500,000, or about 97% of the company’s workforce, Bloomberg reported Tuesday.",
    "Yet corporate executives are in agreement that the pandemic will become endemic by the end of 2022, with nearly 70% suggesting it’s likely to become something the world learns to live with by the end of the year.",
    "Similarly, just 23% said they had implemented ways for employees to permanently relocate outside of a primary office location, while 27% said they had allowed that policy but could revisit it.",
    "Survey respondents also said inflation, which reached rates not seen in nearly 40 years last month, isn’t going anywhere, with 69% saying it would likely remain elevated at the end of 2022.",
    "“What I’m seeing in the marketplace is that in some ways, dealing with compensation has been firefighting,” says Neil Dhar, PwC’s vice chair and co-leader of its U.S. consulting solutions.",
    "KPMG U.S. chair and CEO Paul Knopp also announced Tuesday that it would be making an additional $160 million investment in across-the-board salary adjustments for its professionals.",
    "Another 31% said they had put in place such increases but planned to revisit them, while 22% said they were under consideration, but a final decision hadn’t been made.",
    "Employers have had to deal “in the moment” amid a hot labor market, but there are many ways employers can differentiate their workplaces over time, Dhar says.",
    "Salary increase budgets are the highest since 2008, according to a November report by the Conference Board that forecasted a 3.9% jump in wage costs.",
    "Still, despite those concerns, Ryan says, “what we’re hearing from CEOs out in the marketplace … is there’s a very high sense of optimism.",
    "Sixty-two percent of executives said they will likely need to increase the prices of their goods or services by the end of the year.",
    "One topic “we’re hearing [about] consistently from executives is the wage increases, and their impact on the cost basis.",
    "“The topic of trust, and trust-building, and creating trust as an asset is very much on the minds of CEOs,” Ryan says.",
    "“The rates of inflation have been coming in at rates not seen in a long, long time,” Dhar says.",
    "Still, 34% said they had allowed hybrid work arrangements but will revisit it.",
    "For now, some companies are giving raises or bonuses to help retain talent.",
    "“You can’t simply buy your way out of this with raises,” he says.",
    "Just 31% said they believe talent shortages will ease this year.",
    "CEOs feel very good about the things they can control.”"
  ]
}