{
  "id": 4308,
  "mediaId": 8290,
  "date": "2022-01-20",
  "headline": "Far Left Targets Sinema And Manchin For Defeat",
  "image": "https://static.wixstatic.com/media/7d0df7_0c7b3d3c8493425994aeb3e255d23102~mv2.jpg/v1/fit/w_574%2Ch_315%2Cal_c%2Cq_80/file.jpg",
  "link": "https://www.conservativehq.org/post/far-left-targets-sinema-and-manchin-for-defeat",
  "mediaOutlet": "conservativehq.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Rasley",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"We want to make it clear, if Sen. Sinema cannot support a path forward for the passage of this legislation, we believe she undermines the foundations of our democracy, her own path to victory and also the mission of Emily's List, and we will be unable to endorse her moving forward,\" Laphonza Butler, the organization's president, said in a statement Tuesday, reported The Washington Post.",
    "Our friends at NewsMax report Emily's List, the largest financial contributor to Sen. Kyrsten Sinema's campaign for office, is threatening to cut off its support of the Arizona Democrat if she keeps refusing to agree to change the Senate's filibuster rules in a push to pass the party's voting legislation.",
    "\"Sen. Sinema’s decision to reject the voices of allies, partners, and constituents who believe the importance of voting rights outweighs that of an arcane process means she will find herself standing alone in the next election,\" Butler said according to reporting by Sandy Fitzgerald of NewsMax.",
    "Meanwhile, Black House Democrats have been threatening Sen. Joe Manchin (D-W.Va.) for his refusal to back a change in Senate rules to allow them to pass a bill to institutionalize the fraud-prone election management practices that cast doubt on the outcome of the 2020 presidential election.",
    "Leaders of the Congressional Black Caucus charged that Manchin, by refusing to support that carve-out, is essentially helping Republicans to disenfranchise vulnerable voters — particularly minorities — while threatening to erode decades of civil rights protections in the process.",
    "Indeed, Jayapal ran 183 ads in December and January attacking Manchin for his \"insistence on retaining the Jim Crow filibuster\"; for \"saying 'no' to what people across America want, need, and deserve\"; and for \"a betrayal of the millions of voters who elected Democrats.\"",
    "\"I've given him enough time to respond — I will make it public now — and it only suggests if he should have the courage of West Virginia that seceded from Virginia because they did not want to support slavery,\" she said in a statement reported by The Hill’s Mike Lillis.",
    "But this is nothing new for Manchin, back in June a liberal member of Congress called the West Virginia Democrat \"the new Mitch McConnell,\" and a liberal PAC threatened to \"run ads meant to dampen Manchin's\" approval ratings at home and Rev.",
    "The Arizona Democratic state party passed a resolution calling for the abolition of the filibuster, but the state's senior senator, Krysten Sinema (who isn't up until 2024), remains opposed to abolishing the nearly 200 year old Senate rule.",
    "The hope was, apparently, that persuasion or pressure would spur Manchin and Sinema to abolish or weaken the filibuster, even though they’d repeatedly vowed they wouldn’t,” wrote Andrew Prokop of Vox.",
    "“Congressional leaders, activists, and outside groups have mostly been in lockstep trying to unite Democrats around a sweeping legislative package, then charging full steam ahead into a filibuster.",
    "Rep. Sheila Jackson Lee (D-Texas) revealed a five-page letter she'd sent previously to Manchin, and made clear that she was frustrated with what she said was his subsequent silence.",
    "\"We're sending a clarion call and you can print this: Shame on you for not doing it,\" said Rep. Joyce Beatty (D-Ohio), head of the Black Caucus according to reporting by The Hill.",
    "The powerful Far Left organization contributed $405,588 in Sinema's 2018 race for the Senate, eclipsing her next fundraising source by almost $200,000, according to Open Secrets.",
    "Senators Manchin and Sinema are certainly not conservatives, but they do have something their Democratic Party colleagues, and many establishment Republicans lack – principles.",
    "It’s become clear that Democrats never had a plausible plan to pass their bill to institutionalize the practices that cast a pall over the 2020 presidential election.",
    "Seven other Democratic candidates for the U.S. Senate have also used their would-be colleague Manchin as a prop for their campaigns claims the Newsweek report.",
    "Mandela Barnes and basketball executive Alex Lasry in Wisconsin; and U.S. Marines veteran Lukas Kunce and U.S. Air Force veteran Jewel Kelly in Missouri.",
    "Mr. Prokop’s analysis is really a metaphor for how the modern American Progressive Left operates on everything, not just the filibuster.",
    "William Barber, a progressive activist and leader of the Poor People's Campaign, organized a \"Moral March on Manchin\" in West Virginia.",
    "Congressman Mondaire Jones (D-N.Y.) equated Manchin’s positions to racism, a relic of Jim Crow, wrote Hoppy Kercheval of MetroNews.",
    "His critics, and there are now legions of them among Democrats and liberal columnists, are leveling brutal attacks against him.",
    "So have Rep. Pramila Jayapal (D-WA) and Rep. Veronica Escobar (D-TX), plus Ryan as mentioned before in Newsweek’s reporting.",
    "The image shows Ryan standing proudly in the foreground as the faded blue face of Manchin looms over him in the background.",
    "Democrats have even taken to running social media ads against Manchin to advance their own campaigns, reports Newsweek.",
    "Alexandria Ocasio-Cortez (D-NY) and Rep. Ilhan Omar (D-MN)—have also deployed anti-Manchin ads in the past few weeks.",
    "says an active Facebook and Instagram ad from Rep. Tim Ryan (D-OH), who is campaigning for the U.S. Senate in Ohio.",
    "Chuck Schumer\nfilibuster\nJoe Manchin\nKyrsten Sinema\nVoting rights\nJoe Biden\nBuild Back Better\nMitch McConnell\nH.R.",
    "\"Joe Manchin just said he can't support the Build Back Better Act after MONTHS of stringing along negotiations.\"",
    "There is a link to Act Blue, the left-wing fundraising platform, urging people to donate to Ryan's campaign.",
    "John Fetterman and State Rep. Malcolm Kenyatta in Pennsylvania; Adm. Michael Franken in Iowa; Lt. Gov.",
    "Their first reaction to any disagreement is always to bully, never to persuade or deal.",
    "Two Democratic members of the progressive \"Squad\" in the U.S. House—Rep.",
    "5746\ntalking filibuster\nJanuary 17 deadline\nEmily's List",
    "They include Lt. Gov.",
    "\"Folks, I'm PISSED!\""
  ]
}