{
  "id": 5164,
  "mediaId": 2658,
  "date": "2022-04-23",
  "headline": "Trump lays down marker for Vance in Ohio rally: 'This man is going to win'",
  "image": "https://static.politico.com/f3/e7/4cda39a8406bbf2436ff47c8a9ce/trump-48434.jpg",
  "link": "https://www.politico.com/news/2022/04/23/trump-jd-vance-ohio-rally-00027356",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“The thing that Trump revealed, more than any policy achievement, is that we are living in an incredibly corrupt country,” Vance added, before stating falsely that the 2020 election was stolen and declaring himself “the American First candidate.”\nTrump for his part delivered a familiar red-meat diatribe against the presidential election he lost, undocumented immigrants, foreign heads of state, the media, critical race theory, Democrats and establishment Republicans — calling them, among other things, “horrible human beings who are destroying our country.”\nTrump repeatedly called on the crowd to vote for Vance, slamming Republican groups who opposed the Ohioan.",
    "“I’ve studied this race closely and I think JD is the most likely to take out the weak, but dangerous, Democrat opponent — dangerous because they will have so much money to spend,” Trump said at the time of the endorsement, referring to the expected Democratic nominee, Rep. Tim Ryan.",
    "“I felt pretty good about the race a week ago, but now I feel very good about it.”\nVance had previously rounded on Mandel following a conflagration during a primary debate on March 18 between Mandel and another candidate Mike Gibbons, where Mandel uttered an expletive at his rival.",
    "In his own address ahead of Trump’s speech, Vance referred to Trump as “the big man,” adding that the former president embraced “all the policies we loved” including on China, big-tech regulation and the building of the southern border wall.",
    "In the latter state, Trump rescinded his earlier endorsement of Rep. Mo Brooks, after Brooks reneged on his previous full-throated backing of the former president’s spurious claims that the 2020 election was stolen from him.",
    "Trump reportedly sent Club for Growth president David McIntosh an obscenity-laced message when the group pledged to continue its support for former state Treasurer Josh Mandel following Trump’s endorsement.",
    "Vance, previously a venture capitalist, spent more than a year battling for Trump’s endorsement alongside a handful of other candidates — including a March 2021 “ audition with the former reality TV star.",
    "Vance criticized Trump during the 2016 presidential campaign but has recently gained the former president’s grace and favor, following repeated public commitments to the “America First” MAGA message.",
    "Reaction to Trump’s endorsement of Vance was particularly acute among allies of Mandel, the race’s previous frontrunner, and Vance the only candidate to attend the rally.",
    "Trump’s son, Donald Trump Jr., has repeatedly visited the state to canvass for Vance, and Trump praised his efforts from the stage.",
    "It also represented a significant risk to the former president’s position as a ahead of his own potential White House run in 2024.",
    "“I would not have told you, you know, a week ago that we were in a position to win convincingly,” Vance said in an on Wednesday.",
    "He really is an American First warrior.”\nIt was the latest kinetic moment in the contentious race to replace retiring GOP Sen.",
    "Seeking to stave off a Trump endorsement of his rival, Mandel had argued the nod would have little effect on the race.",
    "Trump’s endorsement of Vance sparked controversy within his movement, with some followers unhappy with the choice.",
    "However, Vance has in the last week, with a pro-Vance super PAC receiving more than $5 million in new donations.",
    "Vance later said Mandel’s actions were unbecoming of an Iraq combat veteran (Vance also served in Iraq).",
    "Mandel has also secured the backing of Trump’s former national security adviser Mike Flynn, a MAGA icon.",
    "Fox News host Tucker Carlson has also urged Trump to back Vance, as did tech billionaire Peter Thiel.",
    "Trump has yet to endorse in Senate GOP primaries in Arizona, Missouri, New Hampshire and Alabama.",
    "Rob Portman, with the future of the Senate potentially hanging in the balance in November.",
    "“He’s a guy who said some bad shit about me,” Trump said to laughs from the crowd.",
    "Natalie Allison, Alex Isenstadt and Garrett Ross contributed to this report.",
    "Every one of the others did also.",
    "Ultimately I put that aside.",
    "“He did, but you know what?",
    "… But they all came back.",
    "… He’s tough.",
    "He’s smart."
  ]
}