{
  "id": 5594,
  "mediaId": 2596,
  "date": "2022-04-17",
  "headline": "Trump 'refused to endorse' Republican after this 'embarrassing' on-stage showdown",
  "image": "https://www.indy100.com/media-library/donald-trump-insists-he-won-t-return-to-twitter-if-elon-musk-buys.png?id=29690725&width=1200&coordinates=369%2C358%2C906%2C506&height=600",
  "link": "https://www.indy100.com/politics/trump-mandel-jd-vance-ohio",
  "mediaOutlet": "indy100.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4306,
    2415,
    2290,
    2765,
    5660,
    1126,
    6474
  ],
  "sentences": [
    "Vance is also backed by the likes of Tucker Carlson, billionaire Peter Thiel, and Don Jr.\nFor what it's worth, Mandel is undeterred and says he hopes to have Trump's endorsement in the general election, as he expects to beat Vance in the primary:",
    "Axios said: “Trump was soured by clips of a near-physical debate altercation last month between Mandel and another rival, investment banker Mike Gibbons.”\nThe winner of the May 3 primary will probably face Representative Tim Ryan in November.",
    "Donald Trump brought his carnival barker persona to the White House for four years with his band of wacky hangers-on, but according to one report there’s a politician who even he thought was too “embarrassing” to endorse.",
    "And Axios speculated that it was this incident that may have contributed to that:\nAccording to a report from Axios, Vance’s ability to bounce back from a dip in the polls impressed Trump.",
    "And while Vance had previously said some anti-Trump things in the past, him renouncing them appeared to be enough to convince Trump he was loyal to the MAGA ex-president.",
    "He’s running in the Republican US Senate primary in Ohio, which is one of the most hotly contested endorsement battles of the midterms so far.",
    "Former state treasurer Josh Mandel had embraced Trump’s base during the battle, but apparently it wasn’t enough to swing Trump’s endorsement.",
    "But perhaps the most cutting Axios claim for Mandel is that Trump reportedly thought he was “embarrassing” in debates.",
    "Donald Trump has waded into the race, backing JD Vance, the author of Hillbilly Elegy.",
    "And it might have all been because of a near-physical altercation on stage recently.",
    "Step forward Josh Mandel."
  ]
}