{
  "id": 6075,
  "mediaId": 2919,
  "date": "2022-04-12",
  "headline": "GOP Senate hopefuls Vance, Gibbons campaign in Northeast Ohio ahead of May primary",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/9593133/2147483647/strip/true/crop/1302x684+0+24/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fcb%2F95%2F764134cc45f5976e5ab3baf63db4%2F2022-04-12-17-13-19.png",
  "link": "https://www.news5cleveland.com/news/political/elections-local/gop-senate-hopefuls-vance-gibbons-campaign-in-northeast-ohio-ahead-of-may-primary",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Kosich",
  "authorUrl": "https://www.news5cleveland.com/john-kosich",
  "termIds": [
    5581,
    4306,
    4839,
    2290,
    1489,
    1126,
    6067,
    6474,
    6387
  ],
  "sentences": [
    "Vance called for not only automatic voter registration and proxy voting, which would gut the integrity of our elections, but for one-party rule by the same coastal elites he worked side by side with his entire adult life,\" the Gibbons campaign statement read.",
    "\"I also think it's a political liability like at the end of the day this is the Republican Primary, we need to send the best Republican to take on Tim Ryan if you're making gaffes like that it maybe means that you shouldn't be running on the big stage.\"",
    "But I do think that behind every good joke there's an element of truth to it and the truth is that it takes way too long to get from casting votes to actually counting them in this country.\"",
    "The Gibbons camp attacked Vance on his statement praising the speed of the French elections tweeting, compared to the U.S. \"must be nice to live in a first-world country.\"",
    "CLEVELAND — The crowded race for U.S. Senate polling has shown a tight battle with a lot of voters still undecided but also Mike Gibbons at or near the top of the choices.",
    "One such statement Gibbons is taking heat for was his remark last week that the \"middle class is not paying any kind of a fair share\" when it comes to federal income tax.",
    "Former President Donald Trump came off the fence in Pennsylvania over the weekend in endorsing Dr. Mehmet Oz, so do they expect him to weigh in here in Ohio?",
    "\"One I think Mike should learn to take a joke a little bit I'm poking fun frankly at our own delayed ballot counting in this country.",
    "\"Early in the election, I go 'boy I'd like to be in first place' and they said you don't want to be in first place.",
    "As for Gibbons, \"I don't know, I don't care if he does, I just don't want him to endorse somebody else.\"",
    "\"If I had to put money on it, I think he probably will endorse but I don't know at the end of the day.\"",
    "I think our tax codes were broken, I think it needs to be simplified, I think it needs to be flatter.\"",
    "Vance, Matt Dolan, and Josh Mandel among others, have at times taken his words out of context.",
    "Something Vance, who was also campaigning in Northeast Ohio Tuesday takes issue with.",
    "Gibbons said the middle-class comment was taken out of context of the discussion.",
    "Campaigning in Middleburg Heights Tuesday he said it has its pluses and minuses.",
    "\"I've taken a pledge never to raise taxes on anybody ever,\" said Gibbons.",
    "“In advocating for France’s national popular voting system, J.D.",
    "He said his opponents, that include Jane Timken, J.D.",
    "Now I know why they told me that,\" Gibbons said.",
    "\"I think it's a huge mistake,\" said Vance.",
    "Vance stated his comment was in jest.",
    "\"I think taxes are way too high.",
    "\"If I had to guess,\" said Vance."
  ]
}