{
  "id": 6278,
  "mediaId": 8494,
  "date": "2022-04-15",
  "headline": "Trump endorses J.D. Vance, wading into Ohio's contentious Republican Senate primary",
  "image": "https://npr.brightspotcdn.com/dims4/default/30384db/2147483647/strip/true/crop/8256x4334+0+460/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2022%2F04%2F15%2Fgettyimages-1239921867_custom-32e3c2de988a7255b9602372e5d66a40c686a99b.jpg",
  "link": "https://www.wksu.org/npr-news/2022-04-15/trump-endorses-j-d-vance-wading-into-ohios-contentious-republican-senate-primary",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric McDaniel",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The state's Republican primary has been a race to the party's right, as Vance and a trio of his opponents — businessman Mike Gibbons, former state Treasurer Josh Mandel and former state GOP Chair Jane Timken — worked to mirror Trump's style and elevated his pet issues of alleged election fraud and illegal immigration.",
    "Trump's endorsement follows a surprise endorsement of television personality Dr. Mehmet Oz in the Pennsylvania Republican Senate primary last week, one of a number of endorsements Trump has granted nationwide to candidates willing to back his lies about widespread election fraud in the 2020 presidential election.",
    "The Republican has lived much of his life in San Francisco — in 2017, he announced in a New York Times op-ed that he would return to Ohio — and in advance of the 2016 election called Trump \"noxious\" and said he was considering voting for a third-party candidate.",
    "The GOP contest has several candidates who have touted their allegiances to Trump, but the former president said in a statement that, \"In the Great State of Ohio, the candidate most qualified and ready to win in November is J.D.",
    "In a since-deleted tweet from March 2017, first reported by CNN, Vance wrote: \"In 4 years, I hope people remember that it was those of us who empathized with Trump's voters who fought him most aggressively.\"",
    "Former President Donald Trump has waded into the crowded and contentious Republican Senate primary in Ohio to offer an endorsement with just over two weeks until the election.",
    "In the Georgia governor's race, Trump has endorsed former Sen. David Perdue over incumbent Brian Kemp — though Perdue has continued to lag Kemp considerably in the polls.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,\" Trump said in his statement on Wednesday.",
    "Vance, a venture capitalist-turned-Midwest memoirist, whose best-selling Hillbilly Elegy launched his career as a conservative media commentator.",
    "\"I've studied this race closely,\" Trump, who won the state twice in his presidential runs, said in his statement, \"and I think J.D.",
    "Now, Vance will rely on the president's endorsement to buoy him in a crowded field of candidates.",
    "It remains to be seen how influential the former president's endorsements will be.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent.\"",
    "\"He is our best chance for victory in what could be a very tough race.\"",
    "The open contest follows the announced retirement of Republican Sen.",
    "The endorsement comes ahead of a Trump rally in Ohio next weekend.",
    "Vance has made a particularly striking evolution on Trump.",
    "The leading Democratic candidate is Rep. Tim Ryan.",
    "To see more, visit https://www.npr.org.",
    "Trump on Friday backed J.D.",
    "\"Like some others, J.D.",
    "Copyright 2022 NPR.",
    "Rob Portman.",
    "Vance.\""
  ]
}