{
  "id": 7775,
  "mediaId": 2540,
  "date": "2022-04-09",
  "headline": "Ohio GOP Senate primary remains all about Trump as candidates hope for late endorsement",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220408133906-ohio-senate-candidates-0318-super-tease.jpg",
  "link": "https://www.cnn.com/2022/04/09/politics/ohio-republican-senate-primary-trump/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Bradner",
  "authorUrl": "https://www.cnn.com/profiles/eric-bradner",
  "termIds": [
    2765,
    4839,
    3067,
    5843,
    1126,
    976,
    1489,
    6474
  ],
  "sentences": [
    "That prospect is the nightmare of national Republicans, who are watching as similar potential scenarios loom across the Senate playing field – including in reliably red Missouri, where a leading candidate is accused of assault by his ex-wife; in Georgia, where a Trump-endorsed former football star has faced allegations of threatening multiple women, including his ex-wife; and in Pennsylvania, where the nation’s most expensive Senate primary could leave the eventual winner bloodied.",
    "I encourage you to study my father/nonviolence in full.”\nMandel responded by telling King to “study your history better.”\n“Your father knew the importance of the Second Amendment when he tried to exercise his right to self-defense,” he said, “and was wrongly denied a gun permit by anti-gun racists.”\nPortman has endorsed Timken, who nevertheless frequently reminds audiences that she’s been endorsed by Trump before.",
    "He defended Georgia Rep. Marjorie Taylor Greene, who recently spoke at a White nationalist gathering, saying in Wilberforce that he listened to her speech and “agreed with nearly every word that she said.”\n“She said nothing wrong, and I’m absolutely not going to throw her under the bus, or anybody else who’s a friend of mine,” Vance said.",
    "My visit to Selma was powerful and inspiring and I look forward to returning and bringing my kids.”\nThat led Bernice King to respond on Twitter, saying: “Josh: Regretfully, I do not believe that I or @TheKingCenter legitimately motivated you to film this ad, as it is in opposition to nonviolence and to much of what my father taught.",
    "“My problem is he’s a failed president.”\nLeaning into the culture wars\nThe television ad battles have also seen GOP candidates making cultural arguments – with Mandel and Vance both launching spots in recent days that attempt to tap into conservative frustrations over their positions being labeled as “racist.”\n“Are you a racist?",
    "“There are people up on the stage who are literally fighting for one vote, and that person doesn’t even vote in Ohio,” state Sen. Matt Dolan, the only one of seven Republican candidates who has not embraced Trump’s lies about widespread voter fraud in the 2020 election, said at a recent debate in Wilberforce.",
    "The likely Democratic nominee in this year’s Senate race, longtime US Rep. Tim Ryan – who challenged Nancy Pelosi for the House speaker’s gavel in 2016 and briefly ran for the 2020 Democratic presidential nomination – is offering himself as an “all economy all the time” candidate in Brown’s mold.",
    "Wilberforce, Ohio CNN —\nNearly all the Republicans vying for the party’s Senate nomination in Ohio are embracing former President Donald Trump’s message, touting their closeness to him and cozying up to the elements of the GOP that he propelled as they joust for a late endorsement.",
    "Only Dolan, in another debate this week, raised the issue of Lewandowski’s hiring, saying that Timken “hasn’t yet explained” to voters why she hired Lewandowski, “who has been investigated for assault to women.”\n“Corey Lewandowski is a friend of mine,” Timken responded.",
    "Dolan, meanwhile, is attempting to tap into the concerns of some Republicans that the race to appease Trump and court his most ardent supporters in the primary could ultimately damage the GOP’s chances of holding on to the seat in November.",
    "The jockeying for a late, game-changing endorsement from Trump comes in part because polls show the primary is wide open with less than four weeks remaining before the May 3 primary, and with early voting having kicked off this week.",
    "Ohio in recent elections appears to have shed its former bellwether status as Republicans’ dominance among White working-class and rural voters has shifted the Midwestern state out of reach for most Democrats in statewide elections.",
    "With control of a Senate that’s now split 50-50 on the line, losses in any combination of those states could imperil Republicans’ hopes in what should otherwise be a good midterm for the party in the current political environment.",
    "“Long story short, he was there at the beginning for President Trump,” Mandel said of Lewandowski at the Wilberforce debate – a comment that also underscored Mandel’s seeming belief that his only viable rival is Gibbons.",
    "“He knows that I’ve been in the trenches fighting for America First policies because Corey came into Ohio and campaigned for President Trump with me.”\nThis headline and story have been updated with additional details.",
    "Mandel, meanwhile, says in a new ad that describes him as “pro-Trump”: “I didn’t do two tours in Anbar province, fighting alongside Marines of every color, to come home and be called a racist.",
    "The 30-second spot features Mandel standing on the Edmund Pettus Bridge in Selma, Alabama, the landmark site where peaceful civil rights activists were beaten by police during a 1965 march.",
    "Gibbons has cast himself as a candidate in Trump’s mold – a former businessman with no real political background, and experience making money in systems that he’d now like to overhaul.",
    "The former President has waded into other competitive Senate primaries, including in neighboring Pennsylvania, where he endorsed celebrity doctor Mehmet Oz’s campaign on Saturday.",
    "In Ohio, Democratic strategists privately say the Republican who would be toughest to beat in November is the one they’re most certain GOP primary voters won’t nominate: Dolan.",
    "An endorsement – if one comes – could prove decisive in a contest in which polls have shown all the leading candidates under 30% and a huge swath of undecided primary voters.",
    "Vance uses the ad to highlight his mother’s struggle with addiction, arguing that a tough stance on immigration is an important step in battling the opioid epidemic.",
    "Former Ohio Republican Party chair Jane Timken has frequently equated being hand-picked for that party job by Trump to an effective endorsement for this race.",
    "Mandel has focused on Gibbons’ business experience, accusing him at a debate in Cleveland last month of “making millions” on stock in a Chinese company.",
    "“Two tours in Iraq,” Mandel, who served in the Marine Corps Reserve, shot back, as he stood up and approached Gibbons and the two stood face to face.",
    "Democrats see the state senator, whose family owns the Cleveland Guardians baseball team, in the mold of Portman, who has held the seat since 2011.",
    "Unlike rivals, including Mandel, who say the 2020 election was stolen from Trump, Dolan has acknowledged the reality of Joe Biden’s victory.",
    "And though Lewandowski is a controversial figure, most of the other candidates in the GOP race have not criticized her decision to hire him.",
    "He has eschewed the culture wars on the campaign trail, instead delivering populist missives against China and international trade deals.",
    "Democratic Sen. Sherrod Brown won reelection in 2018, coasting to a 7-point victory as Republicans swept every statewide executive race.",
    "Still, for a Democrat to win in Ohio, large swaths of independents and Republicans would need to find the GOP nominee unacceptable.",
    "There’s nothing racist about stopping critical race theory and loving America.”\nBut the scenery in the ad also ignited controversy.",
    "“Let me be very clear, Joe Biden is the legitimate president of the United States,” Dolan said at the debate in Wilberforce.",
    "The former President has not given his stamp of approval to any candidate in the race to replace retiring Republican Sen.",
    "Timken’s decision to hire Trump 2016 primary campaign manager Corey Lewandowski was another step into Trump’s orbit.",
    "He also tweeted a thanks to King’s daughter Bernice King and The King Center “for motivating me to film this ad.",
    "Self-funding financier Mike Gibbons and former state Treasurer Josh Mandel have also courted Trump aggressively.",
    "Appeals to voters still loyal to the former President are on display in debates and candidates’ television ads.",
    "“Don’t tell me I haven’t worked.”\nIt’s all unfolding without Trump weighing in publicly on the race.",
    "She has hired two of Trump’s former top political allies, Corey Lewandowski and David Bossie.",
    "But Timken and Vance also have some support, and all four have flooded the airwaves with ads.",
    "Do you hate Mexicans?” Vance says in an ad that touts his support for Trump’s border wall.",
    "“Martin Luther King marched right here so skin color wouldn’t matter,” Mandel says.",
    "Vance has aligned himself with far-right figures who emerged in Trump’s wake.",
    "And Democrats have won a handful of statewide judicial races too.",
    "“You’ve never been in the private sector in your entire life.",
    "Mandel and Gibbons have led the pack in most polls.",
    "Some, though, continue to succeed there.",
    "You don’t know squat,” Gibbons said.",
    "All that’s missing is Trump himself.",
    "Venture capitalist and author J.D.",
    "Rob Portman."
  ]
}