{
  "id": 8565,
  "mediaId": 2699,
  "date": "2022-04-08",
  "headline": "Tim Ryan Is Right. China Is Our Adversary.",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1649448953/210407-tim-ryan-china-tease-01_ax8amf",
  "link": "https://www.thedailybeast.com/tim-ryan-is-right-china-is-our-adversary?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Katharine Ham",
  "authorUrl": "https://www.thedailybeast.com/author/mary-katharine-ham",
  "termIds": [
    0
  ],
  "sentences": [
    "Ryan’s camp also made the distinction between the nation-state of China and people of Asian descent, pointing out that he had voted for a fellow Democrat’s resolution—“COVID-19 Hate Crimes Act”— which called for government action to confront rising violence against Asian Americans.",
    "“My identity is Chinese and I love my culture and I love the people who live in China and I feel sad that my people have to suffer from this regime on a daily basis,” Badiucao told me in February, drawing the vital distinction—which the CCP doesn’t—between people and the state.",
    "Democratic Rep. Tim Ryan declined this week to take down a campaign ad in which he repeatedly said “China” to drive home his populist message that the Chinese government is an adversary of America, and that its economic policies directly affect working-class Americans.",
    "Conflating any criticism of the Chinese government with racism is a tactic the CCP knows can quell critics in America, and it has increasingly worked to encourage censorship and self-censorship on American campuses, according to investigations by Human Rights Watch.",
    "The entire world nonetheless recently gathered at a Beijing-hosted Olympics, which despite diplomatic boycotts handed China’s government the prestige it desired while skiers and snowboarders aerialed against a backdrop of dystopian, snowless scenery.",
    "Recent bannings of Russian artists and athletes (with no links to oligarchs or the Kremlin) that are intended to punish Russia’s dictatorial government for its invasion of Ukraine, for instance, have been far too frequent and should be fought.",
    "Children who test positive for COVID are separated from their parents in an attempt to uphold an authoritarian government’s dreams of “zero COVID.”\nFrankly, in his strident criticisms of the CCP, Ryan left a lot of material on the table.",
    "The posters were briefly displayed on the campus of George Washington University until its president, Mark Wrighton, leapt to condemn and remove them—apologizing for offense and saying he was saddened by the “terrible event” on campus.",
    "Ryan, who is running in red-trending Ohio to replace the GOP’s retiring Rob Portman in the Senate, released the one-minute montage of stump speeches to blue-collar workers in an attempt to appeal to just those voters.",
    "Tim Ryan’s ad for his Ohio Senate campaign stirs up a racist pedagogy vis-a-vis China and makes Americans of East Asian descent vulnerable to attacks,” said Shekar Narasimhan, head of a PAC supporting AAPI candidates.",
    "He talks about capitalism vs. communism—which, it must be noted, are philosophies of government that were at odds long before the Chinese economy rose from an essential non-factor to the second-biggest in the world.",
    "And if I were running against him, I would quibble about the amount of blame that can reasonably be laid at the feet of the Chinese government for complex economic problems in a rapidly changing economy.",
    "This has been a very useful tool to censoring those criticisms against [the] Chinese government all over the world.”\nCriticism of a government can, of course, come from those who also have racist intent.",
    "Badiucao’s satirical versions of Beijing Winter Olympics posters took aim at the CCP’s surveillance state, the oppression of Hong Kong, Tibetans, and Uyghurs—as well as its handling of the coronavirus.",
    "It was just months ago that an American university censored posters by Chinese dissident artist Badiucao at the behest of a handful of complaints from student groups of Chinese nationals.",
    "“Letting our domestic sensitivities dictate our debate on China allows the CCP to avoid criticism where it richly deserves it, and it can have terrible consequences for free speech here.",
    "Letting our domestic sensitivities dictate our debate on China allows the CCP to avoid criticism where it richly deserves it, and it can have terrible consequences for free speech here.",
    "As one Democratic strategist and (veteran of Ohio campaigns) told The Washington Post’s Dave Weigel, “This was our message, until Trump stole it.” It’s quite clear it worked.",
    "We are now two years into the pandemic, with a death toll in the millions for the disease itself and untold losses from the isolation and lockdown measures used to fight it.",
    "And lest we forget, the CCP engages in human rights atrocities against its own citizens and imprisons dissidents, while throwing Uyghur minorities into concentration camps.",
    "Shirt sleeves obligatorily rolled, an energetic Ryan pledged to his hard-hatted audiences not to back down from an economic fight with China, and to invest in Ohio workers.",
    "At the very least, it concealed the truth about COVID in the vital early days of its spread, causing crucial delays in worldwide study, planning, and mitigation efforts.",
    "Trump won labor union households in Ohio in 2020 by 12 percentage points over Biden, the culmination of a 35-point swing away from Democrats since Obama’s 2012 run.",
    "Citizens cannot leave their homes for medical care or food; they are welded into their residential areas or sealed up in malls where infections have been detected.",
    "U.S. politicians must be able to criticize a nation state without every criticism—even the heavy-handed ones made for one-minute ad buys—being deemed sinophobic.",
    "”\nLet’s also remember that China is a nuclear-armed global superpower—and the Chinese Communist Party (CCP) is a bad actor on the world stage.",
    "But broadly smearing as racist any criticism of authoritarian human-rights violators and economic bullies protects governments, not people.",
    "I’d be in disagreement with Ryan on the basis of his very simple argument, just as I disagreed with Donald Trump on this point.",
    "The ad drew accusations of racism from some Asian American Pacific Islander (AAPI) advocacy groups, and from a fellow Democrat.",
    "Wrighton later walked back this pronouncement under pressure, but criticism had already been muzzled on an American campus.",
    "Shanghai, a cosmopolitan center of 25 million, is locked down, its citizens subject to robot and drone surveillance.",
    "It’s a policy argument, not a cultural argument, and one that attempts to address real concerns of Ohio voters.",
    "I’m conservative and far more pro-free-trade than Ryan is, putting me out of step with many in both parties.",
    "The ad pits the U.S. and China against one another, a reflection of the reality of the two global powers.",
    "“It’s just a very sneaky and confusing and misleading narrative that the Chinese government is using.",
    "That is a swing in a crucial demographic that cannot be repaired with accusations of racism.",
    "“My art is always focused on the crimes and the problems of the government,” Biducao said.",
    "The least we can do is subject them to the rhetorical wrath of our negative campaign ads.",
    "But some AAPI activists thought he went too far by relentlessly repeating “China.”\n“Rep.",
    "His message for the $3 million ad buy is relentless, even provocative, but not racist.",
    "We should always be careful not to scapegoat people for the sins of their governments.",
    "The thing is, like tens of millions of Americans, I’m not an economic populist.",
    "Economic populism was, pre-Trump, a Midwestern Democrat’s bread and butter.",
    "In an economic war, what is at stake, according to the moderate Democrat?",
    "I’d also probably lose, which is another part of what’s at stake, here.",
    "Ryan’s positions can and should easily coexist.",
    "Ryan mentions jobs, wages, and manufacturing.",
    "He vowed to find those responsible.",
    "He shouldn’t take it down."
  ]
}