{
  "id": 8880,
  "mediaId": 6552,
  "date": "2022-04-05",
  "headline": "NY Sen. Gianaris: Discovery reform 'settled,' criminal justice issues 'buttoned up' in state budget",
  "image": "https://s7d2.scene7.com/is/image/TWCNews/ap-gianaris-3_04052022",
  "link": "https://www.ny1.com/nyc/all-boroughs/politics/2022/04/05/new-york-sen--gianaris-on-criminal-justice-in-state-budget",
  "mediaOutlet": "ny1.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Arbetter",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Until you see actual print on paper, nothing is actually resolved but it does seem that we’re pretty close to resolution on all those issues and, I think we’re going to make some progress in that area.”\nAn issue that has not reached any stage of resolution is the Buffalo Bills stadium deal, which Gianaris said he’s not a fan of.",
    "There will be some changes to the bail laws...I think we’re going to see some changes to the way we handle gun charges in this state.”\n— Susan Arbetter (@sarbetter) April 5, 2022\nWhen asked if there were any other successes he could share with Capital Tonight, Gianaris said there was.",
    "“I think we’re going to see some changes to the way we handle gun charges in this state.”\nThe senator said that lawmakers understand the public’s concerns around rising crime rates and want to address the issue, but not in a way that would roll back the positive gains made in 2019.",
    "But they did make the point that throughout history, many stadiums downstate in the New York City area have received these subsidies and they felt it would be unfair if Buffalo got singled out as the one time that those kinds of projects were stopped.",
    "Kathy Hochul have made significant progress on the state’s late budget “in just the last couple of days” in spite of efforts to insert what he called “non-budget issues” like alcohol to-go and the reform of 421a into the spending plan.",
    "Hochul has been getting criticized by the Seneca Nation for freezing their bank accounts and using money that the governor has argued they owe the state of New York to pay for part of the Buffalo Bills stadium.",
    "“We are trying to be responsive to what the public sees as a need, while not moving us backward from the reforms we made in 2019 that even opponents think were necessary and successful,” he explained.",
    "“[Discovery] has pretty much been settled and, as I understand it, it’s an issue that’s been settled to the satisfaction of both the defenders and the reform community, as well as the DAs.",
    "“[State Sen. Tim Kennedy and state Sen. Tim Ryan] spoke passionately about what that means to Buffalo in particular and Western New York in general,” Gianaris said.",
    "“It seems like we’re finally clearing our way through all that and now getting to the dollars and cents, which is what the budget is really about,” Gianaris said.",
    "These successes within the confines of the emerging budget agreement come with the caveat that until the bills are in print, everything is still up in the air.",
    "“That was a dispute that has been ongoing for a long time and the governor is taking credit for solving it in the sense that she got the money,” Gianaris said.",
    "On the controversial criminal justice issues of bail and discovery reform, Gianaris was more optimistic than many lawmakers have been over the past few days.",
    "@SenGianaris on @CapitalTonight on bail, discovery:\n“On the issues of the criminal laws in general, we are pretty much buttoned up on that.",
    "“The problem is, she’s trying to tie it to the Buffalo stadium, which is an unrelated issue.”\nAlso still under discussion?",
    "There will be some changes to the bail laws, there will be some changes to discovery as we just mentioned,” he said.",
    "New York Deputy Senate Majority Leader Michael Gianaris told Capital Tonight that state lawmakers and Gov.",
    "I believe we’ve even passed a number of them as bills over time as legislation,” Gianaris said.",
    "“We’re still working through a lot of those reforms, but they are important to the Senate.",
    "“On the issues of the criminal laws in general, we are pretty much buttoned up on that.",
    "“I’m a big advocate of that kind of transparency and hope it does make it in.”",
    "The database of deals and returning pre-audit power to the state comptroller.",
    "“Of course, I’m not a big fan of subsidizing wealthy corporations.",
    "“And hopefully wrapping it up in the next couple of days.\"",
    "An item of success so far in the discussions,” he said.",
    "I have a long record of opposing that.",
    "It’s still under discussion.”\nGov.",
    "."
  ]
}