{
  "id": 9758,
  "mediaId": 2630,
  "date": "2022-03-24",
  "headline": "Ohio's rowdy GOP Senate primary gets even messier after first debates",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220324-Mike-Gibbons-al-1146-0665ae.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/ohios-rowdy-gop-senate-primary-gets-even-messier-first-debates-rcna21364",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nMichael Hartley, a veteran GOP strategist in Ohio who is not aligned with any of the Senate candidates, said Gibbons’ remarks about Timken’s career and women’s history “probably wasn’t the most polished response I’ve ever seen.”\n“I don’t think Mike Gibbons is sexist by any means,” Hartley added.",
    "The tweets should not be viewed as an endorsement, Trump Jr. added, “but enough is enough with the lies being told about this guy from his opponents.”\nGibbons, Mandel, Timken, Vance and state Sen. Matt Dolan — the only candidate not aggressively angling for Trump’s endorsement — are running to succeed Sen.",
    "She has presented herself alliteratively in recent days as a “mom on a mission” with “grit and grace” who would have grounded Gibbons and Mandel for their “bloviating and bravado.” Since Monday, she has gone especially hard at Gibbons, branding him as a sexist in a digital ad.",
    "And she is now claiming the moral high ground, even though she has aired a TV ad in which she accuses her male rivals of overcompensating for “their inadequacies” and has hired Corey Lewandowski, a former Trump adviser who has faced allegations of sexual harassment.",
    "Gibbons has diminished her career as a lawyer, a magistrate and a GOP activist as “barely” work — an attack he was pressed on by a moderator Monday night — and his campaign has accused Timken of marrying into the money that is helping fund her Senate bid.",
    "“In some regards an unpolished response is to be expected if you’re not a career politician.”\nFor Gibbons, who lost a 2018 Senate primary that got far less national attention, the debates have been his first tests in a high-stakes forum.",
    "But Gibbons’ opponents and their allies are now calling attention to his stumbles, citing them as evidence that he is unprepared for the big stage and would be a liability in the general election if he wins the nomination.",
    "At another point he considered backing Mandel because of his then-decisive lead in polling, said a source close to Trump’s political operation who requested anonymity to share details of private discussions.",
    "It’s like judging George Washington according to today’s standards.”\nThe debates — the highest-profile moments of the race so far — could be a turning point with the May 3 primary less than six weeks away.",
    "“As voters see more of him on the debate stage and learn more about his record ... his poll numbers will fall quickly.”\nThere has been no public polling since the first debates to support that theory.",
    "\"Because that inevitability has been punctured,\" the source added, Trump \"started really looking at the race again and at the other candidates,\" with a greater interest in Vance than in Gibbons.",
    "His advisers accentuated his political inexperience as a positive this week when they were pressed about his shaky performances and the criticism from opponents and others that has followed.",
    "Josh Mandel, who led in most polls until Gibbons blitzed the state with more than $8 million in ads, instigated a verbal fight that nearly turned physical at the first GOP debate last week.",
    "The scuffle at last week’s debate began with Mandel questioning Gibbons’ investments in Chinese companies and escalated when Gibbons belittled Mandel for lacking private-sector experience.",
    "“I believe that there’s a distinction between somebody putting money in a race where they make the money versus having it donated by somebody else,” Gibbons said at Monday’s debate.",
    "At a second debate Monday, Gibbons struggled when he was asked about his past assertions that another rival, Jane Timken, \"barely worked” and that women have never been oppressed.",
    "After having spent his way into the top tier of Ohio’s rowdy Republican Senate primary, investment banker Mike Gibbons has begun feeling the heat of the front-runner spotlight.",
    "Mandel, whose antics fueled suspicion that he was looking for a fight, struck a much softer tone in the second debate, even jumping to Timken’s defense after a Gibbons attack.",
    "Luke Thompson, the executive director of a pro-Vance super PAC, said he believes the Mandel-Gibbons “imbroglio” hurt both candidates, particularly the new front-runner.",
    "Trump, who won Ohio twice, came close to endorsing Timken, a former state GOP chair, last year, but advisers encouraged him to hold off as the race developed.",
    "Timken has characterized Gibbons and Mandel — whose debate clash last week included an audible vulgarity that neither will admit to uttering — as children.",
    "The GOP candidates and super PACs advocating for them have already spent more than $31 million on advertising, according to the ad-tracking firm AdImpact.",
    "After Monday’s debate, Donald Trump Jr. rebuked Gibbons and Mandel while piggybacking on a tweet from another contender, “Hillbilly Elegy” author J.D.",
    "There also are signals from Trump’s orbit that Gibbons and Mandel are falling out of favor, perhaps creating an opening for second-tier candidates.",
    "He served two terms as state treasurer and was Ohio’s GOP nominee for the Senate in 2012, when he lost to Democratic incumbent Sherrod Brown.",
    "Mandel rose from his chair, got in Gibbons’ face and touted his service in the Marine Corps before both launched into threats of violence.",
    "Gibbons had been gaining momentum and met last week with former President Donald Trump, who has said he plans to make an endorsement.",
    "It’s a painful lesson that they will just have to learn on May 3.”\nIn contrast, Mandel is the most experienced debater in the bunch.",
    "At times he seemed downright confused about where he stood.”\nGet the Morning Rundown\nGet a head start on the morning's top stories.",
    "Trump Jr. also absolved Vance for his past criticism of the former president — an issue his rivals have sought to exploit.",
    "“A lot of conservatives were skeptical of [Trump] in 2016 & got won over when they saw him in action,” Trump Jr. wrote.",
    "“Mike Gibbons is spending $12 million to try to buy a Senate seat,” Mandel campaign manager Scott Guthrie said.",
    "“I think when they weren’t allowed to vote they were probably oppressed,” Gibbons said on the latter topic.",
    "“The stakes are too high, and we deserve serious leadership,” Timken said Wednesday on a conference call.",
    "“What the politicians and party insiders fail to understand is that this is actually a plus with voters.",
    "But Timken is particularly eager to capitalize, playing on her status as the only woman in the field.",
    "Timken’s husband is the former top executive at an Ohio steel company that bears their family’s name.",
    "But he also was unapologetic about the confrontation, saying it showed that he was a fighter.",
    "“And clearly what we’ve seen is that Mike Gibbons is not ready for prime time.”",
    "(“Back off, buddy,” Gibbons said as a moderator tried to separate them.",
    "“Gibbons showed a lack of preparation,” Thompson said of the debates.",
    "Rob Portman, a Republican who is not seeking re-election this year.",
    "He’s a businessman,” Gibbons strategist Michael Biundo said.",
    "Rep. Tim Ryan is favored to win the Democratic nomination.",
    "“He hasn’t thought through most of the issues.",
    "“Mike Gibbons isn’t a politician.",
    "“You back off,” Mandel replied.)",
    "“But it was a different culture.",
    "Vance."
  ]
}