{
  "id": 9811,
  "mediaId": 2573,
  "date": "2022-04-04",
  "headline": "Marc Thiessen on Dem candidate being accused of anti-Asian hate for criticizing China: 'What a joke'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/3855c3d3-9611-493c-9f29-c8be68399dce/85a8b48e-ec5c-4867-8984-21bf3c0ed2e4/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/tim-ryan-china-manufacturing-marc-thiessen",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fox News Staff",
  "authorUrl": "https://www.foxnews.com/person/s/fox-news-staff",
  "termIds": [
    3068,
    1819,
    1765,
    1126,
    514,
    6509,
    6569,
    6645
  ],
  "sentences": [
    "Fox News contributor Marc Thiessen defended Democrat Rep. Tim Ryan on \"America's Newsroom\" Monday after the Ohio Senate candidate received backlash for a campaign ad where he criticizes China and calls for more U.S. manufacturing.",
    "And Tim Ryan is 100 percent correct that we need -- this is a new Cold War between the United States and the cause of freedom, and China and Russia who are the last bastions of totalitarianism in the world.",
    "Rep. Grace Meng, D-N.Y., accused Ryan of \"essentially shifting blame away from American corporations’ anti-worker policies and putting a target on the backs\" of Asian Americans.",
    "Two, is it \"Russophobia\" to be pointing out the horrific things that Russia is doing to the Ukrainian people?",
    "Right now, the Chinese communist regime has as much blood on its hands as Russia does, if not more...",
    "While Putin commits genocide against Ukrainians, they are committing genocide against the Uighurs.",
    "They have people in concentration camps put on boxcars, heads shaved, sent to concentration camps.",
    "They are sending planes to harass Taiwan and threatening to invade Taiwan.",
    "We should not be depending on them for any strategic materials whatsoever.",
    "The Chinese communist regime is a threat to freedom around the world.",
    "First of all, Tim Ryan is 100 percent correct.",
    "We need to decouple our economy from China.",
    "They're crushing freedom in Hong Kong.",
    "WATCH THE FULL INTERVIEW BELOW:",
    "MARC THIESSEN: What a joke.",
    "Of course not.",
    "It's a fact."
  ]
}