{
  "id": 1212,
  "mediaId": 2746,
  "date": "2022-04-07",
  "headline": "Eyeing reelection, Sen. Mark Kelly drifts away from Biden",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/06/EPA_Budget_22931.jpg-4e4e1_c0-210-5053-3157_s1200x700.jpg?68cddf3b34b8bb1a7419ef1684a3ca6163dc3f99",
  "link": "https://www.washingtontimes.com/news/2022/apr/7/eyeing-reelection-sen-mark-kelly-drifts-away-biden/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    1941,
    2132,
    2201,
    3975,
    4310,
    4777,
    305,
    878,
    1171,
    4830
  ],
  "sentences": [
    "He staked out his clear position against Mr. Biden’s decision to wipe away Title 42, saying it is “unacceptable” to end the program without a “place to ensure a secure, orderly, and humane process at the border.”\n“From my numerous visits to the southern border and conversations with Arizona’s law enforcement, community leaders, mayors, and nonprofits, it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities,” he said.",
    "“Because of Mark Kelly, Arizona families are facing the highest rate of inflation in the nation, record-high gas prices, and an ever-worsening crisis along the Southern Border.”\n“It would be easier to believe Kelly actually cared about helping struggling Arizona families if his voting record didn’t reveal the exact opposite,” she said.",
    "“Mark Kelly is Joe Biden’s political puppet — voting with him more than 97% of the time – and has gone above and beyond to pass Biden’s far-left agenda,” said Katharine Cooksey Noyes, spokesperson for the National Republican Senatorial Committee, the campaign arm for Senate Republicans.",
    "“Mark Kelly is doing as well as a Democrat can be right now in this very toxic Democratic environment, and every move that Kelly makes is critical to whether or not he enjoys six more years or gets ousted,” said Mike Noble, chief of research at OH Predictive Insights, a polling firm.",
    "Mr. Kelly is set to square off against the winner of the spirited Republican primary race featuring Arizona Attorney General Mark Brnovich, venture capitalist Blake Masters, solar energy entrepreneur Jim Lamon and retired Air Force Maj. Gen. Mick McGuire.",
    "“He has done a phenomenal job of supporting progressive policy, but not necessarily advocating for it.”\nMs. Pearson said he has also benefited from all the frustration within the Democratic ranks that has been aimed at his seatmate Sen. Kyrsten Sinema.",
    "Mr. Kelly has called on the Biden administration to put a freeze on the federal gasoline tax and helped block David Weil’s nomination to head the Labor Department’s Wage and Hour Division, handing Mr. Biden his first nomination loss.",
    "Indeed, Ms. Sinema has been blamed for torpedoing Mr. Biden’s $1.75 trillion social safety net package known as Build Back Better and thwarting efforts to abolish the legislative filibuster to pass a “voting rights” bill.",
    "An OH Predictive Insights survey released last month found that Mr. Biden’s approval rating was underwater by a 55% to 40% margin, marking a new low for him in the state, where he pulled out his narrowest victory in 2020.",
    "Mr. Kelly, who is the husband of former Rep. Gabrielle Giffords, raised roughly $100 million on his way to winning the 2020 special election to fill out the remainder of the late Republican Sen. John McCain’s term.",
    "“There is a brilliant strategy here in distancing himself from the president who is being blamed fairly or unfairly for the current economic situation,” said Stacy Pearson, an Arizona-based Democratic strategist.",
    "Mr. Kelly recently split with Mr. Biden over his decision to end the pandemic border emergency order, known as Title 42, that for the last two years has blocked many illegal immigrants from entering the U.S.",
    "Sen. Mark Kelly is distancing himself from President Biden on immigration and other issues as he turns his attention toward navigating what is shaping up to be a brutal midterm environment for Democrats.",
    "Mr. Kelly also is raising boatloads of money, announcing he pulled in more than $11 million in the first quarter and is sitting on $23 million, reinforcing his reputation as a fundraising juggernaut.",
    "That same day, Mr. Kelly and Sen. Joe Manchin III of West Virginia sent a letter to Mr. Biden urging his administration to move forward with domestic oil and gas development in the Gulf of Mexico.",
    "Voters are exhausted with coronavirus protocols, concerned about inflation and crime, and frustrated that Mr. Biden and Democrats have not been able to fulfill more of their campaign promises.",
    "Despite the hyped nature of being an incumbent whose fate is considered crucial in determining party control of the Senate in November, Mr. Kelly has kept a low profile on Capitol Hill.",
    "Mr. Kelly, meanwhile, supported doing away with the filibuster to overhaul election laws but never had to take a hard stand on Mr. Biden’s signature spending proposal.",
    "Mr. Kelly’s maneuvering comes as Republicans cast him as a minion for Mr. Biden, whose approval rating is underwater, creating additional headwinds for Democrats.",
    "Sarah Guggenheimer, a spokesperson for the Kelly campaign, said Mr. Kelly’s record shows he’s in line with Arizona voters on economic and border issues.",
    "The 58-year-old retired astronaut helped sink a Biden labor nominee and is airing concerns about one of the president’s picks for ambassador.",
    "Doug Ducey opted against running for the Senate after knocking heads with former President Donald Trump over the state’s election results.",
    "He also is pressing the Biden administration for a gas tax holiday and to open up more oil and gas drilling in the Gulf of Mexico.",
    "“Sinema has taken the heat from the progressive community and it has taken a lot of pressure off of him,” she said.",
    "“He has managed to not get into the circular firing squad that is the Democratic Party so often,” Ms. Pearson said.",
    "He also is on the fence about Los Angeles Mayor Eric Garcetti’s nomination as ambassador to India.",
    "Still, Mr. Kelly ranks as one of the Senate’s most vulnerable Democratic incumbents this year.",
    "“Arizonans know they can count on Kelly to always put Arizona priorities first,” she said.",
    "Mr. Kelly is facing a different landscape in his quest for his first full six-year term.",
    "The consensus is that Mr. Kelly dodged a bullet when Arizona Gov."
  ]
}