{
  "id": 3263,
  "mediaId": 2598,
  "date": "2022-03-17",
  "headline": "Blake Masters Quits Peter Thiel Foundation To Run For Senate",
  "image": "https://imgb.srgcdn.com/0abd1f00-38b3-4cf5-bd03-ad5c62918144.jpg",
  "link": "https://www.inquisitr.com/10003576/blake-masters-quits-peter-thiel-foundation-to-run-for-senate",
  "mediaOutlet": "Inquisitr",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "4 Times Georgia Steel Thrilled Fans In Bikini\nLindsey Vonn In Bikini Pronounces Self-Worth\nEverything We Know About Jennifer Lopez’s Workout Secrets\nChlöe Bailey Gives A Tour Inside Her Beautiful Los Angeles Home\nBella Hadid In Bikini Channels Lizzie McGuire\nBillionaire Peter Thiel Pledged To Support Masters This November\nPeter Thiel, who is a co-founder of PayPal and early Facebook investor, will support his protégé's campaign for the U.S. Senate seat.",
    "Kim Kardashian Files To Be Legally Single\n\"There Are Simply No Compelling Reasons Not To Grant A Motion To Bifurcate And Terminate Marital Status In This Case\"\nPeter Thiel Donating $10 Million To Master Super PAC\nThiel announced he would be donating $10 million to Master's super PAC, Saving Arizona PAC.",
    "Masters Calls Teaching The Truth About Slavery 'Anti-White Racism' And 'Toxic Crap'\nMasters called Critical Race Theory, which teaches the truth about slavery and its impact on society, \"anti-white racism\" and \"toxic crap\" while speaking to the Sun City Republican Club on Jan. 22.",
    "'The Green River Killer': Captured By Another Killer\nMasters Is A Trump Supporter\nThirty-four-year-old Masters is a Trump supporter.",
    "“Too much of schooling in America has become a machine to uproot common sense and to replace it with something much more sinister.",
    "\"The billionaire Peter Thiel, an early Facebook investor, is stepping down from the board of its parent company, Meta.",
    "\"Critical Race Theory is anti-white racism, no kid should have to listen to that crap,\" he captioned the post.",
    "It is toxic, and it does not belong in our schools.”\nHe also shared the racist rhetoric on Twitter.",
    "The former president attended a fundraiser for the Republican candidate last year at Mar-a-Logo.",
    "He is said to be focused on backing Trump allies for the midterm elections in November.\"",
    "They are smart enough to know it's not racist to be accurate,\" wrote the Twitter user.",
    "What Happened To Christine And Jeremy Moody From ‘Snapped: Killer Couples’?",
    "The New York Times announced his intent to support the campaign on Feb. 7.",
    "Masters' anti-white racism comment met criticism on Twitter.",
    "One user noted the importance of children knowing the truth.",
    "He also used his racist-dog whistle, calling it \"sinister.\"",
    "You’ve heard about Critical Race Theory,\" said Masters.",
    "“All it does is teach kids to identify in racial terms.",
    "You are good or bad, depending on what you look like.",
    "\"For my part I want my kids to know the whole truth.",
    "At this point, it is straight-up anti-white racism.",
    "I don’t think we’re allowed to say that.",
    "But let’s call it what it is.",
    "Right?"
  ]
}