{
  "id": 4331,
  "mediaId": 2540,
  "date": "2022-03-03",
  "headline": "Arizona Gov. Doug Ducey rules out US Senate bid and says he may endorse in GOP primary",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220303112258-arizona-gov-doug-ducey-super-tease.jpg",
  "link": "https://www.cnn.com/2022/03/03/politics/arizona-senate-doug-ducey/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kyung Lah, Jeff Zeleny and Rachel Janfaza",
  "authorUrl": "",
  "termIds": [
    1941,
    2321,
    305,
    875,
    878,
    1029,
    1171,
    4830,
    5245
  ],
  "sentences": [
    "\"Right now I have the job I want, and my intention is to close my years of service to Arizona with a very productive final legislative session AND to help elect Republican governors across the country in my role as chairman of the Republican Governors Association.\"",
    "Doug Ducey announced Thursday he would not be a candidate for US Senate in 2022, ending speculation about whether he would reconsider his previous stance against seeking the party's nomination to challenge Democratic Sen. Mark Kelly this fall.",
    "Senate Minority Leader Mitch McConnell has spent months working aggressively to persuade Ducey to mount a Senate campaign, under the belief that he would be the strongest candidate to try and win back the seat of Sen. Mark Kelly, a Democrat.",
    "Trump first attacked Ducey for his handling of the election certification process, and since then, the former President dug into the governor for being a \"Republican in name only\" and vowing he would \"never\" endorse Ducey.",
    "Current GOP Senate hopefuls looking to take on Kelly include state Attorney General Mark Brnovich, solar energy executive Jim Lamon, venture capitalist Blake Masters and retired Air Force Maj. Gen. Mick McGuire.",
    "In a letter to donors obtained by CNN, Ducey, who is term-limited this year as Arizona governor, said his \"mind hasn't changed\" from January 2021, when he initially said he would not run for the Senate.",
    "\"I consider him an historic figure and one of the Titans of the Senate and I am supportive of everything he's doing to elect Republican senators and wrest back control from Chuck Schumer.\"",
    "\"We have a strong field of candidates in Arizona and I will be actively supporting our nominee -- and perhaps weighing in before the primary,\" Ducey wrote.",
    "A senior adviser to Senate Republicans said Ducey's letter to supporters closes the door on repeated attempts to recruit him into the Arizona Senate race.",
    "\"MAGA will never accept RINO Governor Doug Ducey of Arizona running for the U.S. Senate,\" Trump said last month in a statement from his Save America PAC.",
    "Former President Donald Trump looms large over the Republican Senate primary in Arizona, as candidates compete for his backing.",
    "Ducey has repeatedly drawn Trump's ire after the governor refused to overturn Joe Biden's victory in the state in 2020.",
    "\"The only downside about any of this is that it would be an honor to serve with Sen. Mitch McConnell,\" he wrote.",
    "\"These days, if you're going to run for public office, you have to really want the job,\" Ducey wrote.",
    "Ducey also raised the possibility he would endorse a candidate ahead of the GOP primary in August.",
    "\"So save your time, money, and energy, Mitch.\"",
    "(CNN)Arizona Republican Gov."
  ]
}