{
  "id": 4586,
  "mediaId": 2658,
  "date": "2022-02-17",
  "headline": "Ducey looms as last big question on 2022 Senate map",
  "image": "https://static.politico.com/e8/54/357fea4d49b29d8ccf08d9eb98e1/https-delivery.gettyimages.com/downloads/1140210720",
  "link": "https://www.politico.com/news/2022/02/17/ducey-senate-map-00009867",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1868,
    1941,
    2201,
    2321,
    3434,
    4478,
    1029,
    1171,
    4830,
    5104
  ],
  "sentences": [
    "Three people familiar with Ducey’s thinking said he is unlikely to enter the crowded Republican Senate primary, but has still not completely ruled it out\nWhile the governor has repeatedly denied having an interest in the race, he often uses present-tense phrases like “I’m not running for Senate” or “I’ve got the job I want,” which has fanned speculation that he isn’t ruling out the possibility entirely.",
    "I think that is widely believed by both sides of the aisle at this point.”\nThis month, a Democratic-aligned group underscored that point by launching a $115,000 ad campaign against Ducey, unveiling several billboards along major Phoenix thoroughfares leading to the Arizona Capitol while running YouTube ads and other digital spots.",
    "The GOP’s chances of flipping the seat held by Democratic Sen. Mark Kelly — a key contest in the party’s fight for the Senate majority — are viewed by many in both parties as even better with Ducey, who has been elected statewide three times, than the current cast of MAGA Republicans in the race.",
    "With time winding down toward the state’s candidate filing deadline, the political class in Arizona and D.C. is scrutinizing Ducey’s every move — aware that his decision looms as the last major piece of the 2022 Senate campaign puzzle.",
    "If Ducey entered the crowded Republican primary, the governor would take the lead, receiving 35 percent, followed by Attorney General Mark Brnovich in second-place with 13 percent, according to a January poll by OH Predictive Insights.",
    "“So save your time, money, and energy, Mitch!”\nTrump appeared to be referencing a New York Times story over the weekend about Senate Minority Leader Mitch McConnell’s efforts to recruit Ducey and other candidates.",
    "The billboards and video make reference to an Arizona Republic report alleging the FBI was examining the governor’s office last year regarding a push for large-scale tax refunds to campaign supporters.",
    "The weekend before, at the Phoenix Open — a massive annual golf tournament where Ducey has announced major initiatives in previous years — the governor had also dashed the hopes of supporters.",
    "Doug Ducey might use the opportunity to announce he’s running for the Senate — as then-Rep. Jeff Flake did in 2011 — were disappointed when Ducey instead appeared at an event in Los Angeles.",
    "“For the candidates that are in the race, everyone’s just looking over their shoulder a little bit, making sure he won’t get in,” said Kirk Adams, Ducey’s former chief of staff.",
    "“If he were to tell them tonight, ‘Hey, I’m doing this’ — he’ll be off to the races,” said a person close to Ducey who requested anonymity to talk about the prospects of a run.",
    "“It’s pretty clear to most Republicans where Donald Trump stands vis a vis Doug Ducey right now, and it doesn’t seem to be affecting his standing in the polls,” Adams said.",
    "Ducey has a fundraising team in place and could pay an army of field staff to quickly collect the thousands of voter signatures needed before the April 4 filing deadline.",
    "A Morning Consult poll released in late January found Ducey’s approval rating has only increased from a year ago, now up to 48 percent — slightly higher than Kelly’s.",
    "Larry Hogan, both of whom were recruited by McConnell but ultimately announced at press conferences that there was no chance they’d be jumping into Senate races.",
    "In addition to Brnovich, the current front-runner in the race, the field includes tech venture capitalist Blake Masters and energy executive Jim Lamon.",
    "Ducey gave a brief, generic talk — disheartening some in the audience of big donors and tech executives who had heard word of a possible big reveal.",
    "Ducey, who has pushed back on Donald Trump’s claims of a stolen election, would have to contend with animosity from the former president.",
    "Trump, who has not endorsed anyone in the race, visited the state last month and continues to make negative comments about the governor.",
    "While Ducey doesn’t have an official Senate campaign team assembled, he is in a position to move quickly should he decide to run.",
    "Doug Ducey doesn’t have an official Senate campaign team assembled, he is in a position to move quickly should he decide to run.",
    "| Chip Somodevilla/Getty Images\nBy Natalie Allison\n 02/17/2022 02:16 PM EST\nArizona Statehood Day came and went on Monday.",
    "A Republican strategist with ties to Arizona said Ducey is “playing it a little bit differently” than New Hampshire Gov.",
    "The limitation on that is how long it takes to get signatures and qualify for the ballot by early April,” Adams said.",
    "His two past chiefs of staff are consultants at firms that aren’t currently committed to anyone in the Senate race.",
    "The governor, whom some in the state believe is eyeing a 2024 presidential run, has seen his standing improve.",
    "Advancing Arizona is trying to raise attention about a reported FBI investigation into Ducey’s office.",
    "In the absence of a Ducey announcement on Monday, Trump released a statement denigrating the governor.",
    "“MAGA will never accept RINO Governor Doug Ducey of Arizona running for the U.S. Senate,” Trump wrote.",
    "Adams and another Ducey adviser said the governor appears undeterred by Trump’s campaign against him.",
    "Other former campaign staffers have also stayed away from the current field of Senate candidates.",
    "Maybe the third time’s a charm.”\nThe Ducey recruitment efforts haven’t stopped, Adams said.",
    "“If there was no hope, he would already have shut it down like the other two.",
    "He emphasized, however, that Ducey has not shown signs of a change of heart.",
    "“Is there technically still time for him to change his mind?",
    "“He’s keeping hope alive, for sure,” the strategist said.",
    "“That’s really the only limitation he faces.”",
    "Ducey’s office has denied any wrongdoing.",
    "“If he did get in, he’d win the primary.",
    "I believe he’d win the general election.",
    "Chris Sununu and Maryland Gov.",
    "Those hoping GOP Gov.",
    "While Gov."
  ]
}