{
  "id": 5028,
  "mediaId": 2548,
  "date": "2022-02-17",
  "headline": "SCHILLING: To Rebrand As Pro-Family, Republicans Must Embrace A New Economic Vision",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2019/10/shutterstock_1449374711-e1581023465331.jpg",
  "link": "https://dailycaller.com/2022/02/17/schilling-rebrand-pro-family-republicans-embrace-new-economic-vision/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "As the disastrous consequences of Democrat economic policies become more visible for working Americans, Republicans could put forward an alternative vision, one rooted not merely in creating jobs but in creating well-paying jobs which would enable families to escape the necessity of both parents working.",
    "Progressive stalwart Elizabeth Warren made a name for herself in her pre-politics days in part thanks to her book, “The Two-Income Trap,” bemoaning the economic developments that had forced many families to rely on two parents working.",
    "Republicans would be well advised to follow the example set by candidates like Masters and make pro-family economics both a centerpiece of their pitch to voters as well as a top policy goal once they are elected to office.",
    "On the left, the old-school liberal outlook of Prof. Warren has long been replaced by a radical feminist ideology which sees any attempts to enable single-income families as a plot to force women back into the kitchen.",
    "Although his campaign largely capitalized on parent discontent with public schools, adding an economic component to this vision would make the Republican pitch even more potent heading into the midterms.",
    "However, in contemporary times that dynamic has been all but erased as a possibility for most families, as the relentless consequences of globalization and mass immigration have transformed our economy.",
    "Polling has shown that a large number of parents, especially those in working class households, would prefer an arrangement in which one parent had to work while the other could stay home.",
    "Meanwhile, on the right, a business-friendly outlook largely still reigns — an outlook hostile to any policy change which might endanger the profit margins of corporate America.",
    "But lately, the voices calling for a solution to this issue have been limited to a few courageous, heterodox conservatives, such as Arizona GOP Senate candidate Blake Masters.",
    "As a study by my own organization, American Principles Project, has shown, the Republican coalition is heavily reliant on married and family-oriented voters for success.",
    "Within living memory, it was typical — even expected — that parents could sustain a family on a single income, with one parent able to stay home to raise the children.",
    "Given the left’s increasing capture by woke extremists, it seems unlikely that families will ever see any relief as long as Democrats are in charge.",
    "Therefore, it would make sense that the party would want to prioritize any prescription which could reverse this trend.",
    "Despite the relative lack of attention, this development is truly an existential threat to the future of our country.",
    "Glenn Youngkin pulled off a massive political upset running on making it easier in the state to raise a family.",
    "Birth rates are also at historical lows, and it looks likely the COVID-19 pandemic has driven them even lower.",
    "And making it possible for parents to raise a family on a single income is an important step toward this goal.",
    "The ongoing collapse of the family represents a dire problem for the GOP’s future political prospects.",
    "Rebuilding the American family is obviously in the GOP’s interest, both short- and long-term.",
    "But decades of terrible economic policy have also done much to hollow out American families.",
    "This would be a powerful message, one that the left would have a difficult time countering.",
    "Fewer Americans are getting married than ever before, and many do not even see a need to.",
    "And not long ago, this issue seemed to have salience even on the political left.",
    "The short-term electoral benefits of a pro-family platform are already clear.",
    "By almost every conceivable metric, the American family is in serious crisis.",
    "At first glance, this would appear to be an issue ripe for political action.",
    "Cultural changes over the last several decades have played a major role.",
    "It would also be a smart move for the GOP looking beyond this year.",
    "Terry Schilling is the president of American Principles Project.",
    "Such a significant problem has many causes, of course.",
    "This presents the GOP with an important opportunity.",
    "Follow him on Twitter: @Schilling1776.",
    "Thus, the status quo continues.",
    "Last fall, Virginia Gov."
  ]
}