{
  "id": 5522,
  "mediaId": 2641,
  "date": "2022-02-03",
  "headline": "A Blake Masters Ariz. Win Would Boost America First Movement",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=95891a2c-ae53-4edd-99d0-a6dd783400fe&SiteName=Newsmax",
  "link": "https://www.newsmax.com/kennycody/blake-masters-arizona-sinema/2022/02/03/id/1055344/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kenny Cody",
  "authorUrl": "https://www.newsmax.com/insiders/kennycody/id-735",
  "termIds": [
    1941,
    2394,
    4777,
    878,
    1073,
    4830
  ],
  "sentences": [
    "Nation-building has been one of the foremost blights on American foreign policy in its existence, and with candidates like Masters hopefully getting elected to the United States Senate, the Republican party can finally get away from that horrid policy strategy and start prioritizing our military without sending them to far away place to needlessly die.",
    "These blasphemes have allowed far-Left progressivism to infiltrate our society, be it through our schools, corporate media or through Republicans caving on their own values --- all in an effort to either win elections and/or cash their next paycheck.",
    "While he is backed by Thiel and co-authored the book \"Zero to One: Notes on Startups, or How to Build the Future\" with Thiel, Masters has primarily became known because of his healthy fixation on the America First political movement.",
    "For far too long, even after President Donald Trump left office, establishment Republicans have tried to convince the American public that neoconservative, wasteful spending, war-loving political strategies were the the GOP way.",
    "Democrats have used the government and its influence to change the country's structure more in the past 10 years than it ever has before, while establishment Republicans have been content to sit back and do virtually nothing.",
    "Instituting solutions prioritizing the American worker while keeping the government out of the everyday lives of the individual are how American conservatives can win back America, making America a true winner once again.",
    "If Masters is able to win the Republican senatorial primary and unseat Mark Kelly, Arizona can be the stepping stone towards garnering for the America First movement one of its most significant victories of 2022.",
    "However, Arizonans now have an opportunity to elect an actual conservative warrior, one who will battle against the radical left and establishment in Washington, D.C.\nThat fighter is Blake Masters.",
    "From neocon warmongers like John McCain and virtue signaling, weak \"moderates\" like Kyrsten Sinema and Mark Kelly, the state's U.S. Senate seats are not filled by the Grand Canyon State's best.",
    "However, candidates like Masters are turning that attempt on its head by embracing the movement that got Trump elected in 2016, while embracing new issues as well.",
    "Masters himself has declared, \"The American people have made clear that we need to end our pointless interventions abroad and focus on our problems at home.",
    "For far too long, conservatism in the United States have started to abandon the idea that Judeo-Christian values should be the backbone of American culture.",
    "We need a foreign policy for this century: tough on actual threats like China, without trying to \"export democracy\" and remake other nations in our image.\"",
    "One of the mantras of America First conservatives is the embrace of anti-interventionist foreign policy, while still arguing for a strong national defense.",
    "Republicans like Masters, however, have offered up policies to bring back the confidence ----- both in the nuclear family and the workforce.",
    "Masters is primarily known as a venture capitalist and for his association with Peter Thiel's Thiel Foundation, serving as its president.",
    "Arizona has long had a problem in electing individuals who don't prioritize its values.",
    "Kenny Cody is a conservative writer and activist from Northeast Tennessee.",
    "Blake Masters embodies that much needed change.",
    "Masters also prioritizes the nuclear family.",
    "Read Kenny Cody's Reports — More Here.",
    "All rights reserved.",
    "© 2022 Newsmax.",
    "Special Links:"
  ]
}