{
  "id": 5605,
  "mediaId": 2546,
  "date": "2022-02-03",
  "headline": "At the Races: Big money, little baby",
  "image": "https://www.rollcall.com/static/media/favicon.dfdc3285.ico",
  "link": "https://rollcall.com/2022/02/03/at-the-races-big-money-little-baby/",
  "mediaOutlet": "CQ Politics ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Ackley\nMary Ellen McIntire\nStephanie Akin",
  "authorUrl": "https://www.rollcall.com/author/kate-ackley/",
  "termIds": [
    0
  ],
  "sentences": [
    "Campaigns often have a small, overworked staff, so taking initiative and jumping in both gave me leadership opportunities and benefited the campaigns I worked on.”\nUnconventional wisdom: “I think Rep. Liz Cheney will win reelection,” Drew said of the Wyoming Republican, who has drawn the ire of some members of her own party for voting to impeach former President Donald Trump and faces a Trump-backed primary challenge.",
    "…We are proud to work at the DCCC, and we are unionizing to ensure that this continues to be one of the best places to work in Democratic politics — not just for us but for future generations of staffers.”\nWhat we’re reading\nFrom our columnists: Mary C. Curtis weighs in on how the expected nomination of a Black woman to the Supreme Court is playing with Senate Republicans.",
    "Tightrope walk: Nevada GOP Senate candidate Adam Laxalt, who has insisted the 2020 election was “rigged,” has been assuring voters in rural parts of the state that elections are “legitimate” and that they need to turn out because “your votes are going to matter,” NBC reports, based on audio recordings from his campaign appearances.",
    "“Today I’ve been stuck in the office all day and focused on nothing but fundraising… it’s not exactly my favorite thing in the world, but it’s part of the job when you’re in a purple seat,” wrote the California member, who is a NRCC target and a member of the DCCC Frontliners program for incumbents in competitive races.",
    "“He was incredibly gracious to all the staff as we were getting things organized backstage, and I remember thinking even then that he would definitely become president one day.”\nBiggest campaign regret: “I’m fortunate to not have any major regrets, since the candidates I’ve worked for over the years have won!",
    "Counseling: West Virginia Rep. Alex X. Mooney, who is in a Republican primary battle with Rep. David McKinley after their state lost a seat to reapportionment, has set up a legal defense fund to deal with an ethics inquiry over his use of campaign funds, CQ Roll Call’s Chris Marquette reports.",
    "Since his daughter’s murder, Parker has been an advocate for what he calls “common-sense gun legislation.” New York Republican Rep. Claudia Tenney plans to run for reelection this year but in the 23rd District instead of the 22nd, following the state’s new congressional lines.",
    "Starting gate\nWe’ve got receipts: Even though voting against certifying the 2020 election results didn’t cost House Republicans much in the way of campaign funds, an endorsement from former President Donald Trump didn’t ensure much of a fundraising boost, disclosures show.",
    "Campaigning on voting rights: Democrats’ unsuccessful effort to pass a voting rights in the Senate offered Florida GOP Sen. Marco Rubio and his Democratic challenger, Rep. Val Demings, an opportunity to display their contrasts on the campaign trail, McClatchy writes.",
    "The count: $46,568,744\nThat’s how much more cash Republicans who voted against certifying electoral votes on Jan. 6, 2021 had in their campaign accounts at the end of the year compared with the same point in the election cycle in 2019, a CQ Roll Call analysis found.",
    "The color of money: Kate joined Roll Call’s Political Theater podcast with Jason Dick to discuss her reporting on the fundraising hauls from candidates of color, including some in the GOP such as Sen. Tim Scott of South Carolina and Texas candidate Wesley Hunt.",
    "Draft bill dropped: The bipartisan group of senators working to update the Electoral Count Act continued talks this week, as three Democrats released a draft bill that would give the vice president less authority in the certification of Electoral College votes.",
    "Nathan’s notes\nIn his continuing roll-out of ratings for every state, Nathan L. Gonzales looks at Utah, where dividing Salt Lake County diluted Democratic voters, and Arizona, where Republicans are favored in races for two seats now held by Democrats.",
    "Not commenting: Senate Majority Leader Charles E. Schumer wouldn’t tell CNN whether he would stay neutral or support moderate Democrats Sen. Joe Manchin III of West Virginia and Kyrsten Sinema of Arizona, if they face primary challengers in 2024.",
    "Eyeballs emoji: After an NBC News report about friction between the Democratic National Committee and the White House, DNC Chairman Jaime Harrison launched a Twitter thread blasting unnamed sources and defending his record at the party committee.",
    "Endorsed: Maggie’s List, a PAC supporting Republican women, endorsed Washington Rep. Jamie Herrera Beutler, one of the 10 House Republicans who voted to impeach former President Donald Trump after the Jan. 6 attack on the U.S. Capitol.",
    "Shades of gray: Even as Democrats decry dark-money political groups, a New York Times analysis found that left-learning organizations that do not disclose their donors spent $1.5 billion in 2020, even more than their GOP counterparts.",
    "Shop talk: Katie Grant Drew\nDrew, most recently a senior adviser and communications director for House Majority Leader Steny Hoyer of Maryland, joined the lobbying and public affairs firm Monument Advocacy last month as a principal.",
    "Axne joins Virginia Democratic Rep. Elaine Luria, who reversed her position in late 2020, and has since disclosed more than $150,000 in corporate PAC money, including from the PACs of Boeing, health insurer Cigna and Bechtel Group.",
    "Andy Parker, the father of slain TV journalist Alison Parker, who was the victim of gun violence while doing a news segment, said he will run as a Democrat in Virginia’s 5th District, the seat currently held by GOP Rep. Bob Good.",
    "Steve Carra, who had Trump’s endorsement in his challenge to Rep. Fred Upton in Michigan’s 6th District, will move to the new 4th District, where he will presumably run against Upton and GOP Rep. Bill Huizenga.",
    "I did, in fact, chunk a pumpkin, and I still have the t-shirt to prove it!”\n“Another unforgettable moment was meeting then-Sen. Barack Obama in 2006 when I was staffing a campaign event in Maryland,” she added.",
    "It convinced me that politics can be a force for good, and I knew that’s what I wanted to do.”\nMost unforgettable campaign moment: “My favorite part of campaigns are the community events you attend,” she said.",
    "But Kulmann, who is now director of well construction at Whiting Petroleum Corp., told CQ Roll Call that her experience in the industry has been an asset to the city of Thornton, where she now serves as mayor.",
    "“Together, we will work hand in hand with leadership to continue uplifting our community and advancing our workforce so we are best equipped to hold the House in November and fight for our values nationwide.",
    "The Democratic Congressional Campaign Committee started the year with $82.5 million in the bank, while its GOP counterpart, the National Republican Congressional Committee, reported holding $78.2 million.",
    "ICYMI\nThey’re running: Republican John James, who lost back-to-back Senate races in 2018 and 2020, will seek a House seat from Michigan’s 10th District, the Army veteran and businessman said this week.",
    "Cawthorn case: North Carolina Rep. Madison Cawthorn sued the state to stop a legal challenge against his 2022 campaign because of his alleged support for Trump’s efforts to overturn the 2020 election.",
    "He argued in his lawsuit that the state Board of Elections doesn’t have the authority to keep him off the ballot and asked the court to declare the state law allowing the challenge unconstitutional.",
    "Likewise, she says, she would bring a unique perspective to Congress, including an insider's view to a number of energy-related issues facing the country, like climate change and rising gas prices.",
    "And you might get teased by your colleagues, as Sen. Rick Scott, R-Fla., found out when the car he and Sen. Cindy Hyde-Smith, R-Miss., got stuck Wednesday as Sen. John Cornyn, R-Texas was watching.",
    "With the biggest ticket items on Congress’ legislative agenda in something of a lull, lawmakers — and their challengers — had extra time this week to pore over their opponents’ fundraising hauls.",
    "“Voters value authenticity and appreciate courageous stands, and I think that’s going to win her another term.”\nDo you know someone who works in campaigns whom we should feature for Shop Talk?",
    "Candidate confessions\nJan Kulmann, an oil and gas company engineer running in the Republican primary for Colorado's new 8th District, is used to being attacked for her energy industry ties.",
    "The parallel messages demonstrate the “tightrope” walk some Republicans face as they campaign on unfounded allegations about the 2020 election while trying not to “spook” their own voters.",
    "Democrat Hillary Scholten, a former Department of Justice attorney, announced a campaign for Michigan's newly drawn 3rd District, setting up a potential rematch with GOP Rep. Peter Meijer.",
    ": The Washington Post joins Ohio Rep. Tim Ryan as he seeks to convince Ohio’s white, working class voters in his bid for the Senate to reconsider their rejection of the Democratic Party.",
    "Shovel ready: Former Democratic Rep. Max Rose, who is seeking a rematch against Malliotakis in New York, took to the district to shovel snow for prospective voters during a recent storm.",
    "“It’s a great experience getting to explore all that a district has to offer and talking to residents about their hopes and concerns – and sharing how your candidate will address them.",
    "Drew, who previously worked on the campaigns of Hoyer and other Democrats, will give the firm’s clients advice about the policy-making process and how to shape their advocacy messages.",
    "In 2008, working for now-Sen. Martin Heinrich’s campaign, we went to a ‘Pumpkin Chunkin’’ event — an activity I had never witnessed before,” where pumpkins are propelled into the air.",
    "Coming up\nThe deadline is one week from today to file to run in the April 5 special primary to fill the remainder of the term of GOP Rep. Devin Nunes in California’s 22nd District.",
    "The major takeaways from our notebooks: The House Republicans who voted against certifying the 2020 election for President Joe Biden did not pay a price, overall, with donors.",
    "The disclosures of the party committees and outside groups may portend one thing in these uncertain times: The 2022 midterms promise to shatter previous spending records.",
    "Here are our five takeaways from the fourth quarter reports, including such tidbits as Michigan Democratic Rep. Haley Stevens outraising her colleague, Rep. Andy Levin.",
    "Family feuds: National Journal took a dive into the member-vs.-member primaries where, because of redistricting, 10 incumbents will face off against a fellow incumbent.",
    "New York New Map: New York Democrats released a draft map updating the state’s congressional districts that would combine several Republican-held seats, and which Gov.",
    "She was the target of a failed recall campaign organized by a local environmental group for her connection to the industry when she was a city councilor in 2016.",
    "Photo finish\nYou may be chairman of the NRSC, which raised $105 million last year, but you can’t buy your way out of a Senate subway car if the doors don’t open.",
    "A town divided: The Associated Press travels to Benson, Minn., to chronicle how political divisions have “seeped into the American fabric” of one small town.",
    "His baby-to-be is already no stranger to the campaign, which reported a $375 expenditure in December to a photographer who snapped pics of Harder’s family.",
    "She has worked to update Thornton's oil and gas regulations and regularly renegotiates mineral rights contracts on land the city owns in Weld County.",
    "The new map would combine two Republican districts in Long Island and make Rep. Nicole Malliotokis’s seat, based on Staten Island, more competitive.",
    "District decision: The Pennsylvania Supreme Court directed a lower court judge to recommend a new congressional map by Monday after Democratic Gov.",
    "The conservative Club for Growth PAC endorsed venture capitalist Blake Masters, who is running for the GOP nomination in the Arizona Senate race.",
    "She’s done more to deal with climate change than any politician has, she says, because she helped to design more energy efficient facilities.",
    "Critics said her work for Noble Energy Inc., which was one of Colorado’s biggest energy companies, created a potential conflict of interest.",
    "We also examined the battles where incumbents will face each other as well as the leftover political money of some of the retiring members.",
    "(A campaign finance expert says family photos are an approved use of campaign money provided the photos are used for campaign purposes.)",
    "“We are excited to form the Democratic Party’s largest collective bargaining unit,” the DCCC’s organizing committee said in a statement.",
    "Axios found examples of candidates with high-profile endorsements sometimes listing campaign expenditures to those doing the endorsing.",
    "She had previously refused donations from company PACs, but disclosed several such contributions, according to the Des Moines Register.",
    "Overall, they were sitting on nearly $140 million going into the midterms, despite predictions donors would shun them for the votes.",
    "It would create three GOP-leaning districts in upstate and western New York, where there are currently four Republican-held seats.",
    "Just ask Democratic Rep. Josh Harder, who sent a pair of fundraising emails earlier this week that took a more personal approach.",
    "Instead, I’ll offer some advice that I’m glad I followed: When working on a campaign, don’t be afraid to speak up,” Drew said.",
    "“I’m glad that when I saw things that could work better, or opportunities we could take, I spoke up and offered solutions.",
    "Campaign labor: A majority of DCCC employees opted to join a union, the Teamsters Local 238, according to a news release.",
    "That appeal came just after he sent one announcing to supporters that he and his wife, Pamela, are expecting a baby girl.",
    "These primaries can bring to the forefront intraparty tensions that both sides would prefer to ignore, according to NJ.",
    "Nunes resigned, effective Jan. 3, to become CEO of Trump Media & Technology Group, the former president’s new company.",
    "Last year was just the beginning, and the money chase from now until the November elections will be grueling.",
    "“That event both spurred me to pay attention to politics and made me want to find a way to serve my country.",
    "Starting out: “I was in college when 9/11 happened, and it was a formative experience,” Drew recalled.",
    "Our offices have been closed since 2020, but despite barriers we are making a difference,” he tweeted.",
    "I saw how dedicated he was to his district and how passionate he was about helping his constituents.",
    "The New York Democrat said he’s focused on this year’s midterms, in which he is up for reelection.",
    "And David Winston suggests lessons Democrats can learn from President Barack Obama’s first year.",
    "Subscribe now using this link so you don’t miss out on the best news and analysis from our team.",
    "PAC people: Iowa Democratic Rep. Cindy Axne has reversed her position on corporate PAC money.",
    "That group of lawmakers raised more money last year than in 2019, according to our analysis.",
    "The group previously backed Kelly Tshibaka, who is challenging Alaska Sen. Lisa Murkowski.",
    "The Democratic-controlled Supreme Court will have the final say over the district map.",
    "“Only in DC… can you break a fundraising record & have folks complain it isn’t enough.",
    "Each week we’ll bring you news and analysis from the CQ Roll Call campaign team.",
    "Her recent donors included Berkshire Hathaway, AT&T and Archer Daniels Midland.",
    "Tom Wolf and the Republican-controlled legislature haven’t agreed to a new map.",
    "Kathy Hochul is expected to sign, CQ Roll Call’s Mike Macagnone reports.",
    "He invited would-be donors to help celebrate by giving a contribution.",
    "The DNC work isn’t always easy & covid has created its own challenges.",
    "The first campaign I worked on was in 2006 for Representative Hoyer.",
    "Walter Shapiro questions how much campaign spending is enough.",
    "One Staten Island resident encouraged Rose to put on a hat.",
    "“It was hands down the most fun event I’ve gone to.",
    "Know someone who’d like to get this newsletter?",
    "And yes, we know dollars don’t equal votes.",
    "Email us at attheraces@cqrollcall.com.",
    "That’s what the DNC did in ‘21!",
    "(Bill Clark/CQ Roll Call).",
    "They can subscribe here.",
    "Welcome to At the Races!",
    "Back to the blue?",
    "And so did we.",
    "Tit for tat?"
  ]
}