{
  "id": 5744,
  "mediaId": 2702,
  "date": "2022-02-03",
  "headline": "Club for Growth endorses Blake Masters in Arizona Senate race",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2018/01/money_thinkstock.jpg?w=1280",
  "link": "https://thehill.com/homenews/campaign/592697-club-for-growth-endorses-blake-masters-in-arizona-senate-race/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    1941,
    2394,
    4086,
    4595,
    81,
    232,
    878,
    1171,
    4830
  ],
  "sentences": [
    "He raised nearly $9 million in the last three months of 2021 and ended the year with a staggering $18.6 million in the bank, meaning whichever Republican emerges from the primary will likely have a long way to go to catch up in the money race.",
    "“Masters will be a champion for economic freedom in the Senate and Club for Growth PAC looks forward to helping him win the primary and then the general this November,” Club for Growth PAC President David McIntosh said in a statement.",
    "The conservative Club for Growth’s political action committee is intervening in the Republican Senate primary in Arizona, endorsing venture capitalist Blake Masters to take on Sen. Mark Kelly (D-Ariz.).",
    "The GOP needs to flip just one seat in the Senate to recapture control of the upper chamber, and Arizona has emerged as a key battleground where Democrats only recently began racking up wins.",
    "Other top candidates for the nomination include Arizona Attorney General Mark Brnovich, businessman Jim Lamon and retired Air Force Major General Mick McGuire.",
    "He already has the support of billionaire investor Peter Thiel, who has pledged millions of dollars to a super PAC backing Masters’s Senate bid.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Masters is one of several Republicans running in a crowded primary field to take on Kelly in November.",
    "Republicans see Kelly’s seat as one of their best pickup opportunities this year.",
    "The endorsement puts even more financial might behind Masters’s campaign.",
    "Still, Kelly is among the best-funded Democrats in the Senate.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}