{
  "id": 5881,
  "mediaId": 2584,
  "date": "2022-02-13",
  "headline": "Beware of this deadly mix: oligarchic economics and racist, nationalist populism",
  "image": "https://i.guim.co.uk/img/media/e50c1d2ea9c2bac9fb973fcf5b6f418cae40407b/0_0_3600_2160/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=cc635935a0f1c89a61b92ec4634505b6",
  "link": "https://www.theguardian.com/commentisfree/2022/feb/13/us-republicans-oligarchs-economics-nationalism",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Reich",
  "authorUrl": "https://www.theguardian.com/profile/robert-reich",
  "termIds": [
    2298,
    3709,
    4087,
    4595,
    4777,
    5240,
    5287
  ],
  "sentences": [
    "Now state-level Republicans are busily suppressing votes of people of color and paving the way for a possible anti-democratic coup, while the national Republican party excuses the attack on the Capitol – calling it “legitimate political discourse” – and censures Representatives Liz Cheney and Adam Kinzinger, the only two congressional Republicans serving on the panel investigating that attack.",
    "The arrangement was far from perfect, but with the addition of civil rights and voting rights, subsidized healthcare (in the US, Medicare and Medicaid), and a vast expansion of public education, democracy was on the way to making capitalism work for the vast majority.",
    "Deregulation, privatization, globalization, and the unleashing of finance created the Full Monty: abandoned factories and communities, stagnant wages, widening inequality, a shrinking middle class, political corruption and shredded social support.",
    "After all, it wasn’t long ago that Donald Trump – who openly admired Xi Jinping and Vladimir Putin – encouraged racist nationalism in America while delivering much of the US government into the hands of America’s super-rich.",
    "Last year, at least 13 billionaires who had previously donated to Trump lavished campaign donations on Democratic senators Joe Manchin and Kyrsten Sinema, according to an analysis of Federal Election Commission records.",
    "A treacherous alliance is growing that will undermine democratic institutions in the US and elsewhere\nThe United States presents itself as the beacon of democracy in contrast to the autocracies of China and Russia.",
    "But this hugely successful experiment ended abruptly in December when Senator Joe Manchin joined 50 Republican senators in rejecting President Biden’s Build Back Better Act, which would have continued it.",
    "Robert Reich, a former US secretary of labor, is professor of public policy at the University of California at Berkeley and the author of Saving Capitalism: For the Many, Not the Few and The Common Good.",
    "As early as 2012, more than 40% of all money spent in federal elections came from the wealthiest of the wealthiest – not the top 1% or even the top tenth of the 1%, but from the top 1% of the 1%.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "Capitalism is consistent with democracy only if democracy reduces the inequalities, insecurities, joblessness, and poverty that accompany unbridled profit-seeking.",
    "Thiel is also backing 12 House candidates, three of whom are running primary challenges to Republicans who voted to impeach Trump for the events of January 6.",
    "Last year, Thiel gave $10m each to the campaigns of two protégés – Blake Masters, who is running for the Senate from Arizona, and JD Vance, from Ohio.",
    "Peter Thiel, a staunch Trump supporter whose net worth is estimated by Forbes to be $2.6bn, has become one of the Republican party’s largest donors.",
    "Yet American democracy is in danger of succumbing to the same sort of oligarchic economics and racist nationalism that thrive in both these powers.",
    "Even before the pandemic, most people were working harder than ever but couldn’t get ahead, and their children’s prospects weren’t any better.",
    "More than one out of every six American children was impoverished and the typical American family was living from paycheck to paycheck.",
    "That’s when 36 million American families began receiving pandemic payments of up to $3,000 per child ($3,600 for each child under six).",
    "During the pandemic, America’s 745 billionaires increased their holdings by 70%, adding $2.1tn to their wealth in just over a year.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "The US and war-ravaged western Europe built the largest middle classes the world had ever seen, and the most buoyant democracies.",
    "Starting last July, America did an experiment that might have limited these extremes and reduced the lure of racist nationalism.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "The combination of oligarchic wealth and racist nationalism is treacherous for democratic institutions in the US and elsewhere.",
    "But that’s less than big corporations and the rich will have saved on taxes from the Trump Republican tax cut of 2018.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "America’s oligarchic wealth, meanwhile, has reached levels rivaling or exceeding those of Russia and China.",
    "The cost is also less than the increase in the wealth of America’s 745 billionaires during the pandemic.",
    "Oligarchic economics coupled with racist nationalism marks the ultimate failure of progressive politics.",
    "They cited concerns over the experiment’s cost – an estimated $100bn per year, or $1.6tn over 10 years.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "Then came a giant U-turn, courtesy of Ronald Reagan in America and Margaret Thatcher in Europe.",
    "Child poverty dropped by at least a third, and the typical family gained some breathing space.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "At the same time, a record high share of national wealth was already surging to the top.",
    "The experiment died because, put simply, the oligarchy didn’t want to pay for it.",
    "When the people are no longer defended against the powerful, they look elsewhere.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "His newsletter is at robertreich.substack.com\n… we have a small favour to ask.",
    "For the first three decades after the second world war, democracy did this.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "His new book, The System: Who Rigged It, How We Fix It, is out now.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "The result has been widespread anger and cynicism.",
    "A portion of this wealth is going into politics.",
    "Now, some of this wealth is supporting Trumpism.",
    "If there were ever a time to join us, it is now.",
    "Repeal it, and there would be enough money.",
    "He is a Guardian US columnist.",
    "It’s not just Republicans.",
    "Why not a wealth tax?",
    "Thank you.",
    "Beware.",
    "Presto.",
    "?"
  ]
}