{
  "id": 6234,
  "mediaId": 2560,
  "date": "2022-02-07",
  "headline": "Peter Thiel to leave Meta board to advance Trump political agenda",
  "image": "https://www.gannett-cdn.com/presto/2022/02/08/PDTN/5a6ab197-a3f5-486f-8aba-2af7bda19380-AP22038823021393.jpg?crop=5471,3077,x0,y571&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.detroitnews.com/story/business/2022/02/07/peter-thiel-leave-meta-board-advance-trump-political-agenda/6698976001/",
  "mediaOutlet": "Detroit News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lizette Chapman and Kurt Wagner",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Vance, who previously invested on behalf of Thiel, is running for the U.S. Senate as a Republican from Ohio who is a “conservative outsider.” Vance is best known for his 2016 memoir “Hillbilly Elegy” and is campaigning on promises to abolish the Bureau of Alcohol, Tobacco, Firearms and Explosives and push back against gun laws.",
    "Thiel, who joined the board in 2005 after an early investment in Facebook, plans to increase his political support of former President Donald Trump’s agenda during the 2022 election and doesn’t want his political activities to be a “distraction” for Facebook, according to person close to Thiel.",
    "Bloomberg News\nPeter Thiel, the tech investor and conservative provocateur who has advised Mark Zuckerberg for nearly two decades at Facebook parent Meta Platforms Inc., will step down from the company’s board after Meta’s annual shareholder meeting in May.",
    "When Trump became president, Thiel worked on his transition team while nominating colleagues to fill government positions, including former Thiel Capital Chief of Staff Michael Kratsios, who served as the CTO of the White House until last year.",
    "Thiel, who joined the board in 2005, has been a close adviser to Zuckerberg ever since the duo met through Napster co-founder Sean Parker, when Facebook was still just a social network for college campuses.",
    "Many Facebook employees were upset with Thiel’s role in backing Trump in 2016 given the former president’s stance on immigration, and allegations of sexism and racism against then-candidate Trump.",
    "He was among those reportedly encouraging the CEO not to fact-check political advertisements in the run-up to the 2020 presidential election, a move that many believe benefited Trump.",
    "“He wanted to avoid being a distraction for Facebook.”\nThiel helped elect Trump president in 2016 by donating money and speaking on his behalf at the Republican National Convention.",
    "That relationship continued even as Thiel became more and more controversial in the technology industry, and became a frequent target for Facebook critics and unhappy employees.",
    "Thiel’s departure will mark the end of one of the most productive – and harshly criticized – partnerships between a chief executive officer and an investor in all of business.",
    "“He thinks that the Republican Party can advance the Trump agenda and he wants to do what he can to support that,” said the person, who was not authorized to speak publicly.",
    "“We can’t create a culture that says it cares about diversity and then excludes almost half the country because they back a political candidate,” he wrote at the time.",
    "“His focus will be on supporting Blake Masters, JD Vance and others who support the Trump agenda,” he added, referring to Republican candidates for U.S. Senate.",
    "Masters, a former student of Thiel’s who co-wrote “Zero to One” with him, is running for the United States Senate as a Republican from Arizona.",
    "Thiel has continued to support Trump while meeting with members of the Republican Party and members of the far-right in recent years.",
    "Thiel was instrumental in shaping Zuckerberg’s ethos during the early days of Facebook and its relentless pursuit of growth.",
    "Thiel, also is a co-founder and chairman of Palantir Technologies Inc., was known to advise Zuckerberg on political issues.",
    "But Zuckerberg defended Thiel and his role on Facebook’s board in an internal post to employees in October 2016.",
    "Masters still oversees Thiel’s personal investment vehicle Thiel Capital and eponymous foundation.",
    "He also joined a dinner with Zuckerberg and Trump at the White House in 2019."
  ]
}