{
  "id": 6337,
  "mediaId": 2552,
  "date": "2022-02-07",
  "headline": "Trump-supporting tech billionaire quits Facebook to focus on politics",
  "image": "https://www.telegraph.co.uk/content/dam/business/2022/02/07/TELEMMGLPICT000216180742_trans_NvBQzQNjv4BqOR79fl4qqSsuAd0k6ubyq64Pwt_cKb9rPJRnam6RRiQ.jpeg?impolicy=logo-overlay",
  "link": "https://www.telegraph.co.uk/business/2022/02/07/tech-billionaire-peter-thiel-fight-trump-re-election/",
  "mediaOutlet": "Daily Telegraph",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Giulia Bottaro",
  "authorUrl": "https://www.telegraph.co.uk/authors/g/gf-gj/giulia-bottaro/",
  "termIds": [
    2201,
    2394,
    2979,
    3466,
    4595,
    364,
    383,
    605
  ],
  "sentences": [
    "However, many industry observers deemed his role at the company controversial due to his political affiliations, especially as the social media owner has been criticised for the handling of misinformation on his platforms.",
    "The Wall Street Journal previously reported that Mr Thiel had lobbied Mr Zuckerberg to keep running political advertising without fact-checking ahead of the 2020 election.",
    "American tech billionaire Peter Thiel plans to leave Facebook’s board in a sign that he will turn his attention to helping Donald Trump get re-elected to the White House.",
    "Mr Thiel, the PayPal co-founder, has announced he will not stand for re-election as a director of Meta, Facebook’s parent company, after nearly two decades as an adviser.",
    "The Financial Times reported that Mr Thiel, a prominent Trump supporter, is looking to focus on “political endeavours” and “avoid that being a distraction for Facebook”.",
    "In 2016, Mr Zuckerberg defended Mr Thiel after it emerged he had donated $1.25m to Mr Trump’s presidential campaign, saying that his presence helped “diversity”.",
    "I'm grateful he's served on our board for as long as he has.”\nMr Thiel commented: “Mark Zuckerberg's intelligence, energy, and conscientiousness are tremendous.",
    "Advertisement\nHe reportedly plans to support Republicans in line with Mr Trump’s agenda, such as Blake Masters and JD Vance, in the 2022 midterm elections.",
    "Its fourth quarter results revealed a sharp fall in profits due to the company’s heavy spending on “metaverse” technologies such as virtual reality.",
    "Advertisement\nMr Thiel has donated $86,000 to the National Republican Congressional Committee and Republican leadership committees last year.",
    "It also banned Mr Trump for breaching violent speech and misinformation rules following the assault on the Capitol in January 2020.",
    "Meta chief Mark Zuckerberg said: “We’ve always known that at some point he would devote his time to other interests.",
    "The news comes as Meta suffered the biggest one-day drop in value of any company in Wall Street history last week.",
    "Mr Thiel was the first external investor in Meta and has made over $1bn (£740m) by trimming his stake.",
    "Facebook did not implement fact-checking measures but placed a temporary ban around the election.",
    "He also donated $10m to a committee supporting Mr Vance as well as $10m to Mr Masters.",
    "His talents will serve Meta well as he leads the company into a new era.\"",
    "He has sat on its board since 2005."
  ]
}