{
  "id": 6601,
  "mediaId": 4032,
  "date": "2022-01-24",
  "headline": "Masters Again: CRT Is “Anti-white Racism”",
  "image": "https://thenewamerican.com/assets/sites/2/masters.jpg",
  "link": "https://thenewamerican.com/masters-again-crt-is-anti-white-racism/",
  "mediaOutlet": "New American",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "R. Cort Kirkwood",
  "authorUrl": "https://thenewamerican.com/contributor/r-cort-kirkwood/",
  "termIds": [
    1328,
    2394,
    279,
    5245
  ],
  "sentences": [
    "pic.twitter.com/mXdRYPAMMG\n— Blake Masters (@bgmasters) November 3, 2021\nNoting that the radical Left was “up in arms” over the observation, he said “a Republican politician or candidate is allowed to say ‘Critical Race Theory is bad.’ And I think some of the braver ones are even allowed to say, ‘it’s racist.’”\nBut one can’t proceed from there:\nIf you actually go and unpack that a little bit more, and say, “this is straight-up anti-white racism,” I mean the hit pieces just float in.",
    "“Regardless of how much you say you detest racism, you are the sole reason it has flourished for centuries.”\nWalmart has a similar anti-white program, while whites who toil for CVS learned that they live in a “society completely soaked in racist ideas.” Raytheon tells whites what they are allowed — and not allowed — to say to black employees.",
    "Critical Race Theory is anti-white racism, no kid should have to listen to that crap pic.twitter.com/1s2PMND3oQ\n— Blake Masters (@bgmasters) January 22, 2022\nMedical Rationing Based on Race\nCalling CRT “racist” isn’t enough, Master told his GOP listeners.",
    "“Medical rationing based on race”:\nIf you’re a white person, it doesn’t matter if you are more sick, you’re not going to get this therapeutic because we have a limited supply and it should go to a person of color who is historic[ally disadvantaged].",
    "But “I can navigate issues like this,” he said:\nI think it is important to have people who are going to be bold and take the arrows and talk about some difficult subjects in our country.",
    "AT&T’s CRT material told white employees that if they want to know “who’s responsible for racism, look in the mirror.”\n“White people, you are the problem,” AT&T told white employees.",
    "Masters delivered the blunt assessment at a meeting of the Sun City Republican Club on Saturday, and he was just as adamant about the anti-white hate as he was before.",
    "As The New American reported last week, legal blogger William Jacobsen sued New York because it is using race to prioritize scarce treatments.",
    "And, of course, he told Newsweek what he later told Carlson: “Yeah, everyone knows this is true — you’re just not supposed to say it.”.",
    "Rufo has exposed how corporate bureaucrats at major Fortune 500 companies are using CRT to harass and harangue white employees.",
    "As well, he said his handlers advised ducking the question when he appeared on Tucker Carlson’s program in November.",
    "If you do that too much, even if you let that take root at all, pretty soon you don’t have a real country anymore.",
    "“All it does is teach kids to identify in racial terms,” he said at a conservative rally in Phoenix:\nRight?",
    "What CRT Says About Whites\nThe City Journal’s Christopher Rufo has shown that Masters is exactly right.",
    "Because of CRT and the anti-white hate it creates, “you see what you’re seeing today,” Masters said.",
    "But it is bad for black kids and Latino kids, it is bad for every kid to hear that toxic crap.",
    "Critical Race Theory, he said for at least the third time, is anti-white racism.",
    "Toxic for any kid who is subjected to it, no matter what their background.",
    "They can’t handle that, even though it’s what everybody knows to be true.",
    "Masters blamed anti-white China Virus treatment policy on CRT, too.",
    "We’ve got to take back the schools and stop the indoctrination.",
    "Critical Race Theory is racism, specifically anti-white racism.",
    "I went on to explain that it is bad for white kids, obviously.",
    "Arizona U.S. Senate candidate Blake Masters went there again.",
    "You are good or bad, depending on what you look like.",
    "So I said critical race theory is anti-white racism.",
    "It is toxic, and it does not belong in our schools.",
    "At this point it is straight up anti-white racism.",
    "On Carlson’s program, Masters was equally blunt.",
    "It’s “toxic” he said, and it has to be stopped.",
    "I don’t think we’re allowed to say that.",
    "Whites, the state says, need not apply.",
    "In August he said the same thing.",
    "But let’s call it what it is."
  ]
}