{
  "id": 6770,
  "mediaId": 2716,
  "date": "2022-01-10",
  "headline": "Congressional candidates turn to NFTs as form of campaign finance",
  "image": "https://mediacloud.theweek.com/image/private/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1608652137/gettyimages-915269972.jpg",
  "link": "https://theweek.com/politics/1008831/congressional-candidates-turn-to-nfts-as-form-of-campaign-finance",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    2394,
    4587,
    4595,
    136,
    669,
    1163,
    4887
  ],
  "sentences": [
    "Unlike Bitcoin, NFTs are not meant to be used as a currency, Bloomberg explains; rather, they are meant \"to be held, sold, or traded as an asset,\" and are created with a \"unique digital certificate of authenticity\" using the same blockchain technology associated with Bitcoin and other forms of cryptocurrency.",
    "For instance, Democratic House candidate Shrina Kurani and Republican Senate candidate Blake Masters have both offered NFTs as \"incentives for donors,\" albeit \"to varying degrees of success,\" Bloomberg reports (these are, after all, still \"the early days of crypto's push into politics\").",
    "The Arizona-based Masters, on the other hand, said he raised almost $575,000 in late December \"by promising to give donors tokens with cover art for a book about startup companies that he wrote with Silicon Valley billionaire and top Trump ally Peter Thiel,\" per Bloomberg.",
    "Critics worry such donations could circumvent donor disclosure requirements, though that hasn't stopped certain political committees — like the National Republican Congressional Committee — from joining in the crypto fun.",
    "Overall, however, fundraising consultants don't think crypto will become a completely mainstream contribution method any time soon, especially given questions about regulation.",
    "Kurani said she was the first to distribute NFTs to donors through digital marketplace SolSea, and hopes her crypto approach will help galvanize a younger generation.",
    "In fact, some congressional candidates have even begun selling NFTs to help finance their midterms campaigns.",
    "Non-fungible tokens, also known as NFTs, have made their way into politics, Bloomberg reports.",
    "\"NFTs are our campaign merchandise,\" said Kurani, who's running in California.",
    "She had raised $6,610 when her offer expired at the end of December.",
    "Read more at Bloomberg."
  ]
}