{
  "id": 6866,
  "mediaId": 2641,
  "date": "2022-01-12",
  "headline": "10 Key Crypto Buzzwords to Know in 2022",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=78bc86ad-137e-46c0-9935-7e7a1a4d670e&SiteName=Newsmax",
  "link": "https://www.newsmax.com/finance/investinganalysis/cryptocurrency-buzzwords-Bitcoin/2022/01/12/id/1052084/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maxwell Newman",
  "authorUrl": "",
  "termIds": [
    128,
    236,
    281,
    357,
    974,
    5144,
    5371
  ],
  "sentences": [
    "Instead of the hurdles that a traditional stock brokerage poses, or providing a required government-issued ID or Social Security number in a traditional trade, DeFi allows “buyers, sellers, and elenders to interact peer-to-peer with a strictly software-based middleman, rather than a company facilitating a transaction,” according to Investopedia.",
    "Vijay Ayyar of the crypto exchange Luno, tells CNBC that he expects 2022 to bring more regulation to the industry from the government, while President Nayib Bukele of El Salvador, has continued his ambitious plans for mass adoption of Bitcoin in the country, of which we will see much more of in 2022.",
    "Web 3.0\nWeb 3.0 is a somewhat blurry concept still in its infancy, but some, like Esther Crawford, a senior project manager at Twitter, view Web 3.0 as a concept of “value that’s created can be shared amongst more people—rather than just the owners, investors and employees.” (to NPR).",
    "Crypto wallet\nA crypto wallet is an online wallet or hardware (often stored on a thumb drive) that allows users “to store the secure digital codes required to interact with the blockchain—a ledger that records all of a cryptocurrency’s account balances and transactions,” per NASDAQ.",
    "Decentralised Application (dApp)\nA dApp, or decentralized application, “is a software application that runs on a distributed network…A dApp is just like any other software you use, but what makes dApp different is that it’s built on a decentralized network, like Ethereum.",
    "NFTs\nA non-fungible token, commonly known as an NFT, is “a unique unit of data employing technology that allows digital content—from videos to songs to images—to be logged and authenticated on cryptocurrency blockchains, primarily Ethereum,” according to The Verge.",
    "A soft fork is a much smaller change than a hard fork, with Coinbase.com describing a soft fork as “a software upgrade for the blockchain” and that “soft forks have been used to bring new features, typically at the programming level, to Bitcoin and Ethereum.”\n10.)",
    "Recently, Melania Trump and Arizona Senate candidate Blake Masters (R, Ariz) announced that they, too, would be selling respective NFTs, with the former First Lady selling her limited edition piece, titled “Melania’s Vision,” for the cost of 1 Solana coin.",
    "This means that digital art, video and images can be sold online, using cryptocurrency, and NFT artists can “mint (create) their work on an NFT marketplace, like OpenSea.”\nNFTs have made a lot of headlines recently, growing in popularity in late 2021.",
    "For example, artist Kevin Abosch sold an NFT titled “Forever Rose”, for $1 million, and the creator of the Nyan Cat, Chris Torres, turned the meme into an NFT, selling his NFT for 300 ether, or $561,000, in February 2021.",
    "Following the explosive growth of crypto’s two most popular coins, Bitcoin and Ethereum, Elon Musk’s influence on the industry, and the meteoric rise of the Shiba Inu coin, cryptocurrency has turned mainstream.",
    "DeFi\nDecentralized finance, often shortened as DeFi, “is a system by which financial products become available on a public decentralized blockchain network,” henceforth making the system open for anyone to use.",
    "Fiat Currencies\nFiat currencies are government backed, national currencies that “are dictated by central banks,” as opposed to cryptocurrency being dictated by “blockchain protocols and code,” per Gemini.com.",
    "Meme coins, like Shiba Inu, which rose dramatically in late 2021, and Floki Inu have been called pump-and-dump schemes, alternatively known as rug pulls, writes journalist Will Ebiefung of The Motley Fool.",
    "This includes the ushering in the features of “open source software, applications running on blockchain, machine learning, and increased connectivity, including the Internet of Things,” per Investopedia.",
    "Pump and Dump\nA pump and dump is a scheme where one or multiple traders and participants cooperate to inflate the price of a token they hold, only to sell it when its value is artificially high.",
    "Whether using a “hot wallet”, which is online and can be used on a computer or smartphone, or an offline cold wallet, a wallet is essential to have, in order to trade cryptocurrency.",
    "It is arguably improbable that popular, well-known tokens like Ethereum are pump-and-dump schemes, but it is important to remember the warning signs for a pump-and-dump scam.",
    "Essentially, fiat currency are currencies like the U.S. Dollar, the British pound or the Japanese yen, whereas a cryptocurrency is a coin like Bitcoin, Ethereum or Solana.",
    "Its backers’ goal is “to ease global money transfers” and “to reach the world’s ‘unbanked’ and to allow money to move across borders more easily,” per NASDAQ.",
    "While Web 3.0 does not fully exist yet, proponents see it as the next stage of the Internet, like how Web 2.0 brought the world Google, Facebook and TikTok.",
    "More recently, through a high-profile deal with MoneyGram, XLM is trying to expand remittances through its platform to the world’s “unbanked” population.",
    "In this scenario, the blockchain splits in two: the original blockchain and the new version that follows the new set of rules,” according to Coinbase.",
    "Primarily because the crypto industry is powered by decentralization, decentralized finance and open-source crypto exchange platforms, like Uniswap.",
    "Since cryptocurrency is poised for further growth in 2022, according to several experts, here are 10 key buzzwords to know in the coming year:\n1.)",
    "With XLM’s transaction cost being the equivalent of just 0.000038 cents per transaction, creating partnerships, such as with Stripe, is key[LB1] .",
    "Cryptocurrency’s move out of the shadows can be seen with major retailers like AT&T, PayPal and Starbucks, now accepting it as a form of payment.",
    "Much like E*Trade and Fidelity online brokerages to buy stocks, the same is true for Binance and Coinbase when it comes to transacting crypto.",
    "In order to buy a cryptocurrency like Bitcoin on an exchange, traders will pay for said cryptocurrency, using fiat money like the US Dollar.",
    "Crypto Exchange\nA crypto exchange is a marketplace where traders can make purchases, sales, and digital transactions of cryptocurrency.",
    "A hard fork is what happens “when the code changes so much that the new version is no longer backward-compatible with earlier blocks.",
    "For example, if someone wants to buy Ethereum, an exchange like Binance or Coinbase are two exchanges where this can be done.",
    "Proponents like Mat Dryhurst, a researcher on the future of the Internet, see a key factor of Web 3.0 as decentralization.",
    "Altcoin\nAlternative coins, commonly known as altcoins, are cryptocurrencies that are alternative coins to Bitcoin.",
    "Just a year ago, many Americans were unfamiliar with cryptocurrency, not having the slightest idea what it is.",
    "Even multi-million-dollar real estate deals, such as one in Miami, are being completed via cryptocurrency.",
    "Several altcoins that became more mainstream were Solana, Cardano APA, Stellar Lumens (XLM) and Polka Dot.",
    "A number of altcoins also have special purposes to them, with one cryptocurrency being Stellar Lumens.",
    "Usually known for its volatility, crypto seems set to be in for another wild ride in the coming year.",
    "In sum, it is the backend code that makes a peer-to-peer network run smoothly and efficiently.",
    "Fork\nIn simplest terms, a fork is a rule change in a cryptocurrency’s blockchain protocol.",
    "dApp equals the frontend code + the smart contract backend of code,” per Free Code Camp.",
    "In 2020 and 2021, coins other than Bitcoin surged in both price and popularity.",
    "Takeaways\n2022 is shaping up to be another exciting year for cryptocurrency.",
    "How does this relate to cryptocurrency?",
    "There are two types of forks.",
    "© 2022 Newsmax Finance.",
    "All rights reserved.",
    "Special Links:",
    "9.)",
    "8.)",
    "6.)",
    "7.)",
    "4.)",
    "5.)",
    "2.)",
    "3.)"
  ]
}