{
  "id": 6879,
  "mediaId": 2701,
  "date": "2022-01-31",
  "headline": "In Opposing War With Russia, Tucker Carlson Champions The Hard-Won Truths Of Putting American Interests First",
  "image": "https://thefederalist.com/wp-content/uploads/2022/01/tuckercarlson-on-ukraine-and-russia.jpg",
  "link": "https://thefederalist.com/2022/01/31/in-opposing-war-with-russia-tucker-carlson-champions-the-hard-won-truths-of-putting-american-interests-first/?utm_source=rss&utm_medium=rss&utm_campaign=in-opposing-war-with-russia-tucker-carlson-champions-the-hard-won-truths-of-putting-american-interests-first",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sumantra Maitra",
  "authorUrl": "https://thefederalist.com/author/sumantramaitra/",
  "termIds": [
    0
  ],
  "sentences": [
    "Thus in recent years, the ascendant New Right has led a bipartisan push for a more restrained foreign policy, one predicated on cutting down on foreign entanglements (termed as foreign policy realism in academic circles) especially from the Middle East, pushing Europe to spend a lot more for its own defense, and focusing more on domestic issues, as well as the rise of China.",
    "Self-Government Means No Country Is Too Big to Fail\nWhen Rhodes and McFaul yell about defending human rights in Ukraine, and Carlson and others on the right remind everyone of American failures in pursuing such an unlimited global policy, it’s important to rethink the priors and understand the re-alignment in foreign policy is complete.",
    "Powerful realist voices on the left such as Matthew Duss, Stephen Wertheim, Tulsi Gabbard, and Rep. Ro Khanna notwithstanding, it is becoming increasingly clear that true restrained foreign policy realism is connected to a very narrow form of nationalism, and that is fundamentally a reactionary and therefore conservative concept.",
    "This logic leads straight to an active policy of regime change, where the goal is to topple autocrats and put liberal democracies in their place.”\nConsider the relentless number of tweets by a section of the commentariat about Western support for ensuring LGBT-favoring laws in Ukraine, and Mearsheimer sounds prescient.",
    "To top it all, President Obama’s former Russia hand quite literally called for war against a nuclear rival to ensure the sovereignty of Ukraine, a proposition unthinkable during Cold War bipartisanship, when the first instinct was to ensure great power equilibrium and avoid mutually assured destruction.",
    "The instinct for promoting a global revolution to promote LGBT rights, liberalism, and feminism is as radical an instinct as it can get, and that argument is increasingly opposed by a majority of Americans who simply don’t care enough to spend blood and treasure in places they cannot spot on a map.",
    "It’s Natural to Defend Yourself\nCarlson is increasingly influential because he sides with something very natural: a human urge to be a nationalist, and therefore opposed to a relentless and crusading global revolution, whether promoting a borderless Marxism or an equally borderless liberalism.",
    "One of his historical role models is said to be Alexander III, a reactionary tsar in the Romanov dynasty who instituted draconian restrictions on the press, sought to ‘Russify’ his multi-ethnic empire, and mobilized against internal and external threats.",
    "Our Job Is to Govern Ourselves First\nForeign policy realism, on the other hand, enacts a grand strategy based on amoral narrow national interest, one formulated by early American statesmen from George Washington to James Monroe to John Quincy Adams.",
    "Michael McFaul, Obama’s Russia ambassador, was vocal on Twitter arguing that opposing Russia is a moral duty of anyone who opposes “imperialism,” alongside both prominent liberal theorists and second-tier neoconservative internationalist gadflies.",
    "The ascendant New Right believes in peace through strength, and a very narrow Jacksonian definition of nationalism, in which Europeans pay for their own security and Americans only come at the last moment if things go wrong.",
    "Dr. Sumantra Maitra is a national-security fellow at The Center for the National Interest; a non-resident fellow at the James G Martin Center; and an elected early career historian member at the Royal Historical Society.",
    "Four years ago, Putin expressed his deep admiration for the tsar while visiting the Crimean Peninsula, a substantial and distinctly unthreatening parcel of Ukraine that Russia invaded in 2014 and has occupied ever since.",
    "It may be a noble goal, but ultimately it’s one that the majority of Americans and an overwhelming number of conservatives are tired of after 30 years, thousands of lost lives, and trillions of dollars in deficits.",
    "Matt Walsh and Sohrab Ahmari recently also opposed further confrontation with Russia over ensuring democracy and rights in Ukraine, as this conflict does not directly threaten the American landmass or way of life.",
    "In this view, China is a far bigger threat to American prosperity and its land-mass than Russia or Iran will ever be, and defending porous American borders matters a lot more to Americans than Ukrainian borders.",
    "This recent debate on Ukraine, therefore, has brought forth troubling questions for those trying to sell oxymoronic “progressive” foreign policy realism, which took a hell of a beating in the last few weeks.",
    "This realignment has also included questioning whether the ascending conservative foreign-policy realism in America, based on a narrow definition of national interest, is compatible with progressivism.",
    "The other side, a duopoly of Never Trump neoconservatives and liberal-internationalists, wants to continue to allegedly ensure human rights across the globe while neglecting the way of life at home.",
    "Believing that “History” is progressive, and therefore acting on it to liberate everyone everywhere and promote rights and democracy, then becomes part of an inflated American national interest.",
    "Mearsheimer wrote, “because liberalism prizes the concept of inalienable or natural rights, committed liberals are deeply concerned about the rights of virtually every individual on the planet.",
    "Prominent next-gen Republican lawmakers and foreign policy leaders, such as Adam Laxalt, Bernie Moreno, J. D. Vance, Blake Masters, and Peter Meijer also often voice more realist rhetoric.",
    "“We are potentially on the verge of a land war in Europe aimed at extinguishing democracy and sovereignty, and the American right wing is on the side of ethno-nationalist authoritarianism.",
    "Second, as I wrote recently, “selling” such foreign policy, even to a very instinctively nationalist electorate like America, means talking in a language that most people will get.",
    "A recent New Yorker profile makes it clearer than any:\nVladimir Putin presents himself to his citizens and to the world as the standard-bearer of a modern counter-enlightenment.",
    "Some have gone so far as to bizarrely tag Carlson a “comrade,” which is absurd because Putin’s Russia is far more Christian andconservative than the increasingly secular West.",
    "Another Democrat operative, who allegedly worked with the Ukrainian embassy to dig up dirt on President Trump, tweeted that Carlson should be prosecuted as a foreign agent.",
    "Carlson (and Donald Trump, for that matter) connected with the normal crowd, arguing about the futility of sending their sons to die for Ukraine, Afghanistan, or Libya.",
    "Carlson is perhaps the most prominent voice of that school in the right and has consistently opposed needless foreign confrontation, especially over Iran and Russia.",
    "This universalist logic creates a powerful incentive for liberal states to get involved in the affairs of countries that seriously violate their citizens’ rights.",
    "Reaction to Tucker Carlson’s monologue on Ukraine proves neither liberalism nor its cousin progressivism is compatible with the United States’ national interest.",
    "A recent Tucker Carlson monologue questioned the relentless narrative insisting Americans must compulsively side with Ukraine against Russia in their conflict.",
    "That’s where we’re at,” tweeted President Obama’s former speechwriter Ben Rhodes, who coined the phrase “DC blob,” in reply to Carlson without a hint of irony.",
    "It cannot be a matter of American patriotism to send U.S. troops to die for evils in other nations, or United States must attempt to police the entire globe.",
    "The aversion against great powers and spheres of influence is an egalitarian instinct claiming all states are equal, regardless of any other variable.",
    "To take this a step further, the best way to ensure that the rights of foreigners are not trampled is for them to live in a liberal democracy.",
    "“Why is it disloyal to side with Russia but loyal to side with Ukraine?” Carlson asked, provoking commentary noting Putin murders dissidents.",
    "A Rabid Response to the New Right’s Power\nThere is a palpable panic at Carlson arguably driving the GOP towards a more pre-war conservatism.",
    "The side that does not believe in nation-states or nationalism cannot by definition side with a narrow interpretation of national interest.",
    "Yet the world is full of rulers who murderously abuse power—for example, by sending drones that kill non-combatants and children.",
    "Whatever these people are, their constant revolutionary and internationalist rhetoric would make Leon Trotsky blush.",
    "If it ever comes back as an administrative principle, then it will become the domain solely of the right.",
    "He has declared liberal democracy ‘obsolete,’ a political arrangement that has ‘outlived its purpose.",
    "Progressivism, as John Mearsheimer noted, is by definition universalist, radical, and revolutionary.",
    "Experience has shown that is practically impossible and deeply damaging to U.S. national interests.",
    "There has also been relentless fearmongering about Carlson, authoritarianism, and nationalism.",
    "It defies geography, aggregate power, history, and most importantly, narrow nationalism.",
    "He is a senior contributor to The Federalist, and can be reached on Twitter @MrMaitra.",
    "It’s even being hysterically termed Putinism and “Russia First” by some commentators.",
    "That has more impact than a bunch of Foreign Affairs Snapshots.",
    "This instinct is by definition unnatural and revolutionary.",
    "Is It America’s Job to Change Other Nations’ Regimes?",
    "They are not the only ones."
  ]
}