{
  "id": 6883,
  "mediaId": 2924,
  "date": "2022-02-01",
  "headline": "Crypto's Personalities Take a Page Out of an Old Political Book",
  "image": "https://www.thestreet.com/.image/t_share/MTY4NjUwMzU5NzQ4MjQxMDMx/meet-trump-adviser-anthony-scaramucci-an-unapologetic-defender-of-wall-street.png",
  "link": "https://www.thestreet.com/investing/cryptos-personalities-take-a-page-out-of-an-old-political-book",
  "mediaOutlet": "The Street",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luc Olinga",
  "authorUrl": "https://www.thestreet.com/author/luc-olinga",
  "termIds": [
    0
  ],
  "sentences": [
    "$20 Million to Support Pro-Crypto Candidates\nThe new PAC brings together SkyBridge Capital, founded by Donald Trump's former White House communications director Anthony Scaramucci, venture capital firms Multicoin Capital and Blockchain Capital, Framework Ventures co-founder Vance Spencer, FTX Digital Markets CEO Ryan Salame, and CMS Holdings’ co-founder Dan Matuszewski.",
    "While the White House is working on a white paper to regulate the sector, the big guns and figures of the sector have just formed a political action committee (PAC) to weigh and be heard in the coming midterm elections scheduled for November.",
    "\"GMI PAC supports candidates who work to give US-based innovators the opportunity to build next-generation technologies and services here in America rather than doing that valuable work overseas,\" says the PAC on its website.",
    "Blake Masters, a Republican U.S Senate candidate in Arizona, announced in late December that he had raised over $574,000 for his campaign by selling NFTs based on the cover of his best-selling book Zero to One.",
    "For example, some politicians are using Non-fungible tokens (NFTs) - digital assets that can't be replicated -- one of the buzzwords in the tech world, to raise money and attract young fans.",
    "Scaramucci, a crypto advocate, is trying to start a Bitcoin Investment fund but the Securities and Exchange Commission (SEC) blocked his effort on January 20, saying it was too risky.",
    "They reached $740,000 in the fourth quarter of 2021, according to a January 20 disclosure, while the firm only re-registered its internal lobbying program last September.",
    "Many on social media have quipped that the crypto space, whose rhetoric is that it wants to change the old ways of doing things, is picking up the codes of old politics.",
    "The cryptosphere began to organize itself last year after an attempt by the Biden administration to impose a tax on the sector in in the $1.2 trillion infrastructure.",
    "GMI PAC is initially planning to invest over $20 million into congressional candidates for the coming November midterm elections, according to Politico.",
    "Called GMI PAC, this PAC aims to support candidates who are favorable or open to cryptocurrencies and the technologies on which they are based.",
    "It added that: \"GMI PAC supports candidates committed to making way for a more secure, competitive, and innovative digital marketplace.\"",
    "Spencer took to Twitter to insist that the \"time\" has come to be \"good political stewards of the industry seriously.\"",
    "The amount doesn't take into account the contracts that Coinbase has entered into with external lobbying firms.",
    "The lobbying expenditures of Coinbase, the only crypto exchange platform in the United States, have exploded.",
    "Sometimes it is politicians and candidates who seek support from the crypto sphere.",
    "Contacted by TheStreet, GMI PAC didn't respond immediately.",
    "The group has raised $5.3 million in contributions so far.",
    "For now, GMI PAC has not yet endorsed a candidate.",
    "GMI comes from crypto slang 'gonna make it'.",
    "The cryptosphere is flexing its muscles."
  ]
}