{
  "id": 6922,
  "mediaId": 2636,
  "date": "2022-01-27",
  "headline": "The Man at the Center of Arizona’s Primary",
  "image": "https://static01.nyt.com/images/2022/01/27/us/politics/27onpolitics-newletter-pm-1/27onpolitics-newletter-pm-1-facebookJumbo-v2.jpg",
  "link": "https://www.nytimes.com/2022/01/27/us/politics/trump-arizona-primary.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1941,
    2201,
    2725,
    3975,
    73,
    85,
    305,
    878,
    4830
  ],
  "sentences": [
    "Last year, Jill Abramson, the former executive editor of The New York Times, observed in an opinion essay that “what is remarkable is the extent to which the Supreme Court, with the addition of three Donald Trump nominees who create a 6-to-3 conservative majority, seems to be reshaping itself in Justice Thomas’s image.”\nThis is the one thing that pundits of opposite political leanings seem to agree on: Liberals have lamented Thomas’s role as “the new chief justice,” while conservatives, including the influential Wall Street Journal editorial page, have hailed “the Thomas court.”\nIt’s not the first time someone has made the same error.",
    "Masters — a venture capitalist backed by Peter Thiel, a billionaire tech mogul who’s close to Trump — has said that he believes Trump won in 2020 and that the country is being run by “psychopaths.”\nThen there’s Jim Lamon, a businessman whose campaign put $1 million behind a TV ad cheering “Let’s Go Brandon,” a far-right slogan that translates to an expletive directed at Biden.",
    "At an Arizona rally earlier this month, Trump referred to his baseless claims that he actually won the state and told the crowd that he was “anxiously waiting” to see whether Brnovich would agree with him, and that they’d soon find out if the attorney general is a “good man.”\nBrnovich, apparently undeterred, posted on Twitter a photo of himself with Trump.",
    "Scarpinato said he hasn’t seen candidates engage in behavior that would “tear the party apart or put people in a position where they’re perceived as being unelectable.”\nBut he cautioned that Republicans can’t become so preoccupied with fighting one another in the primary — which is not until August — that they delay their attacks against Kelly.",
    "If Republicans fail to knock off Kelly, a popular former astronaut with piles of campaign cash, it’ll be for one main reason, party strategists and pollsters tell us: A primary so consumed with winning Donald Trump’s blessing that the Republican Party sets itself up to lose the general election.",
    "“However, it is absolutely a weakness when they move into the all-important general election.”\nIt’s ‘the Republicans’ to lose’\nBefore we go any further, let’s make one thing clear: Given the national environment, Republicans should have a natural advantage in a state that Biden won so narrowly.",
    "One Republican national strategist involved in Senate races told us that the top concern for many in his party is that the eventual nominee drains all their resources on the primary, leaving them cash-strapped against Kelly, who ended last year with nearly $20 million in his campaign account.",
    "In oral arguments last week in a case about whether Boston can stop a private group from flying a Christian flag in front of its City Hall, a lawyer for the plaintiffs was addressing Clarence Thomas, a deeply conservative associate justice who joined the court in 1991.",
    "“With the current electoral environment shaping up to be very pro-Republican, the only potential issue is that a hard-right candidate comes out of the primary and ends up losing in what should be a gimme Republican year,” said Mike Noble, an Arizona-based pollster.",
    "“Chief —” the lawyer, Mathew Staver, began, before correcting himself and continuing, “Justice Thomas.”\nThe little-noticed hiccup came after a flood of recent commentary and reporting on Thomas’s growing influence after years on the margins of the court.",
    "And while others noted that while Republican-aligned outside groups such as the Club for Growth could make up any gaps in spending, money is likely one reason that many Republicans keep hoping Ducey changes his mind and decides to run, Noble said.",
    "But Ducey has said publicly and privately that he’s not running, and it’s easy to see why: He’d have to get through a Republican primary and general election without the support of Trump, who blames him for losing the state in 2020.",
    "Just a few weeks ago, Trump reiterated in a statement that Ducey would never have his “endorsement or the support of MAGA Nation!”\nOne of the great unknowns in the 2022 election is the effect of the president’s approval rating.",
    "As a freshman Democrat in a state that President Biden won by less than a percentage point in 2020, he’s one of four vulnerable incumbents whom Republicans are targeting as they seek to regain the majority in the U.S. Senate.",
    "?Voters and persuadable swing voters will be inclined to want to vote for someone who’s going to be a check and a balance on the Biden administration,” said Daniel Scarpinato, a former chief of staff to Ducey.",
    "It’s not just that the party in the White House tends to struggle in the first midterm election of a president’s term, or that the president’s approval ratings are hovering in the low 40s.",
    "One more thing …\nA lighthearted moment accidentally illuminated some important dynamics on the Supreme Court — more consequential, perhaps, than the retirement of Justice Stephen Breyer.",
    "What to read\nSome Democrats hope that nominating a Black woman to the Supreme Court will help solidify support from Black voters in the midterms, Trip Gabriel reports.",
    "This is more of a recommendation on what to do tonight: Try gerrymandering an imaginary state in this online game created by Ella Koeze, Denise Lu and Charlie Smart.",
    "A Modern-Day Party Boss: Hoarding cash, doling out favors and seeking to crush rivals, Mr. Trump is behaving like the head of a 19th-century political machine.",
    "Senator Kyrsten Sinema has received so much attention recently that you might have forgotten that she’s not the Arizona Democrat up for re-election in 2022.",
    "The confirmation process will test Senator Dick Durbin, the chairman of the Judiciary Committee, which is evenly divided between Democrats and Republicans.",
    "All of these efforts to win the former president’s support could backfire in the fall if Democrats are able to anchor the eventual nominee to Trump.",
    "And that Arizona was ruby red only a few short years ago, suggesting that Kelly’s three-point margin in 2020 could be easy enough to erase.",
    "Just the Beginning: For many Trump supporters who marched on Jan. 6, the day was not a disgraced insurrection but the start of a movement.",
    "“He has to carry around Joe Biden like a sack of potatoes wherever he goes,” said Stan Barnes, a Republican strategist based in Phoenix.",
    "But he faces intense pressure from Trump and from the Republican grass-roots to find fraud in his investigation of the 2020 election.",
    "If it stays in the low 40s, Kelly could be ousted no matter how skilled a campaign he runs, or how bumbling an opponent he faces.",
    "Chief Justice,” the actual chief justice — John Roberts — joked, “There’s no opening.”\nIs there anything you think we’re missing?",
    "Lamon also helped facilitate Republicans’ post-mortem review of the 2020 election results in the state’s most populous county.",
    "Proceeding with caution\nArizona elected two Democratic senators during Trump’s term and ultimately voted to oust him in 2020.",
    "Republicans are confident that whoever becomes their nominee will enter the race against Kelly in a strong position to win.",
    "Power Struggle: Led by Senator Mitch McConnell, a band of anti-Trump Republicans is maneuvering to thwart the ex-president.",
    "“Yes, it’s a big benefit and help during the primary due to Trump’s current influence over the electorate,” Noble said.",
    "“It’s absolutely the Republicans’ to lose,” Brian Seitchik, an Arizona-based Republican consultant, said of the race.",
    "In his latest Congressional Memo, Carl Hulse asks if the Democrats’ new voting bill talks are for real — or for show.",
    "Obtaining the endorsement of Trump, which means making remarks or taking positions that could haunt them in November.",
    "And even in a national environment that could lift Republicans to the majority, they could still find ways to lose.",
    "Ducey was re-elected in 2018 even as Democrats won a Senate seat in Arizona for the first time in decades.",
    "He managed to win re-election in a brutal year for Republicans and is not allowed to run for a third term.",
    "The obvious choice for a challenger to Kelly might have been Doug Ducey, Arizona’s Republican governor.",
    "First, there’s Attorney General Mark Brnovich, who’s worked in Arizona government for the last decade.",
    "Trump reserved a warmer reception for Blake Masters, calling him “a really terrific guy” at the rally.",
    "Post-Presidency Profits: Mr. Trump is melding business with politics, capitalizing for personal gain.",
    "It’s also that Biden inherited a pandemic and all the economic and social fallout that came with it.",
    "The economy is growing faster than it has in decades, so why aren’t voters rewarding Biden for it?",
    "In March of last year, when a lawyer in another case mistakenly called Thomas “Mr.",
    "He’s already proven he can put together a top-tier statewide campaign operation.",
    "That leaves a number of lesser-known Republicans to vie for the nomination.",
    "But Ducey has steadfastly maintained he’s not interested in the Senate.",
    ": Mr. Trump remains the most powerful figure in the Republican Party.",
    "Here’s what economists told Jeanna Smialek and Ben Casselman.",
    "However, there are signs his control is loosening.",
    "How Donald J. Trump Still Looms\nGrip on G.O.P.",
    "“They need to start now,” Scarpinato said.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "That would be Senator Mark Kelly.",
    "We’d love to hear from you.",
    "The best way to stand out?",
    "“?"
  ]
}