{
  "id": 7232,
  "mediaId": 6555,
  "date": "2022-01-24",
  "headline": "Blake Masters: Critical Race Theory Is Anti-White Racism",
  "image": "https://i0.wp.com/occidentaldissent.com/wp-content/uploads/2022/01/blake-masters.jpg?fit=1200%2C700&ssl=1",
  "link": "https://occidentaldissent.com/2022/01/24/blake-masters-critical-race-theory-is-anti-white-racism/",
  "mediaOutlet": "occidentaldissent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "About Hunter Wallace, Founder, Editor-In-Chief Of Occidental Dissent, James Bell, Karl Austin, James Owen, John Bonaccorsi, Tikkun Olam Is Coming For You",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "If you’re a white person, it doesn’t matter if you are more sick, you’re not going to get this therapeutic because we have a limited supply and it should go to a person of color who is historic[ally disadvantaged].",
    "Critical Race Theory is anti-white racism, no kid should have to listen to that crap pic.twitter.com/1s2PMND3oQ — Blake Masters (@bgmasters) January 22, 2022\n\nThis is a great example of where we are at in 2022.",
    "And it was a risk, I remember some of my consultants didn’t want me to do it, but I went on Tucker [Carlson’s FOX News show] said I can navigate issues like this.",
    "I think it is important to have people who are going to be bold and take the arrows and talk about some difficult subjects in our country.",
    "It is an opportunity for insurgent candidates who are free to talk about White people and White interests for the first time in decades.",
    "As recently as the 2020 election, it was still taboo for conservatives to even acknowledge that White people existed and had interests.",
    "Banning CRT is a racial dog whistle, but the fact that it is even happening says a lot about how much our politics has changed.",
    "Many of these people had bought into the MLK nonsense about how the country was progressing toward a colorblind utopia.",
    "“Journalists” are self-absorbed Twitter addicts who write for other blue checks on Twitter, not the general public.",
    "If you do that too much, even if you let that take root at all, pretty soon you don’t have a real country anymore.",
    "RCP:\n\n“BLAKE MASTERS: Until that point, you were allowed to say critical race theory is racist and that’s bad.",
    "In the wake of the triumph of Ibram X. Kendism, the Republican base is on fire with White anxiety.",
    "But it is bad for black kids and Latino kids, it is bad for every kid to hear that toxic crap.",
    "They now try to apply the same extreme tactics to everyone on the Right up to the president.",
    "And when it takes root, you see what you’re seeing today: medical rationing based on race.",
    "But to say it is “anti-white” racism — if it’s racist it is racist against somebody.",
    "The fact that black grievance isn’t being centered and pedestaled is a change.",
    "They have been rudely awakened from that delusion over the past two years.",
    "This thawing of the old taboos and norms is playing out in GOP primaries.",
    "Donald Trump had nothing to say about White people until a few days ago.",
    "They have devolved into discredited partisan NGOs like the SPLC and ADL.",
    "It is an example of a White interest being translated into legislation.",
    "We can expect more conservatives to start tiptoeing into these waters.",
    "GOP consultants, officials and politicians are still mostly cowards.",
    "The “watchdog organizations” can no longer police the mainstream.",
    "I went on to explain that it is bad for white kids, obviously.",
    "This is an admission that the “mainstream” no longer exists.",
    "…”\n\nThe mainstream media doesn’t really exist anymore.",
    "So I said critical race theory is anti-white racism.",
    "They haven’t caught up with their base though.",
    "“Extremism” has gone mainstream.",
    "Public opinion has changed.",
    "It is coastal media now."
  ]
}