{
  "id": 910,
  "mediaId": 2664,
  "date": "2022-04-11",
  "headline": "Pro-Trump Arizona candidate complains Biden's new rules wouldn't let him build his 'very cool' ghost gun",
  "image": "https://www.rawstory.com/media-library/blake-masters.jpg?id=28331767&width=1200&coordinates=0%2C39%2C0%2C40&height=600",
  "link": "https://www.rawstory.com/ghost-guns/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    1934,
    2394,
    3975,
    4595,
    80,
    268,
    1171
  ],
  "sentences": [
    "But now, thanks to Biden\\u2019s new rule change, I would be a felon if I made another one just like it today.pic.twitter.com/ZkatLvK46s\n— Blake Masters (@Blake Masters) 1649705241\n\"Ghost guns\" are any privately assembled firearm that lacks a traceable serial number, which makes it harder to identify how they got into the hands of criminals if used in shootings.",
    "On Monday, President Joe Biden announced a first-of-its kind new gun regulation enacted by executive order that will restrict unserialized kits that allow people to assemble untraceable so-called \"ghost guns,\" and make ownership of certain existing unserialized guns illegal.",
    "Under the new rules, \"firearm\" and \"frame and receiver\" will be defined to include so called \"buy build shoot\" kits, and manufacturers of components used in ghost guns will be required to use the federal background check system on buyers.",
    "It has always been possible to build improvised firearms using relatively easy-to-acquire materials, but in recent years ghost guns have become more common, particularly in states that heavily regulate the sale of conventional firearms.",
    "Masters, a tech executive, is the protege of pro-Trump billionaire venture capitalist Peter Thiel; a recent report indicated that Masters has been using his platform as a political candidate to promote Thiel's businesses.",
    "But the announcement did not sit well with Arizona GOP Senate candidate Blake Masters, who took to Twitter to complain that under the new rules, a \"very cool\" firearm he assembled last month would be illegal to build now.",
    "NOW WATCH: 'Copious' evidence of Trump's criminality still may not force Merrick Garland to act\n'Copious' evidence of Trump's criminality still may not force Merrick Garland to act",
    "He is running against several other Republicans for the nomination to take on Democratic Sen. Mark Kelly, including state Attorney General Mark Brnovich and businessman Jim Lamon.",
    "Last year, the ATF recovered 20,000 ghost guns from crimes, roughly ten times the amount in 2016.",
    "I made this \\u201cghost gun\\u201d a few months ago.",
    "Very legal & very cool."
  ]
}