{
  "id": 6620,
  "mediaId": 8469,
  "date": "2022-04-13",
  "headline": "Butler Township suing Marsicano over helipad",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2022/04/128408828_web1_marsicano01.jpg.optimal.jpg",
  "link": "https://s24526.pcdn.co/news/1550413/butler-2",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4982,
    4883,
    6215,
    6662,
    6023
  ],
  "sentences": [
    "Complaint details\nAccording to the complaint filed Tuesday in Luzerne County Court by township solicitor Donald G. Karpowich:\nThe first notification of zoning violation was issued to Marsicano on Sept. 19, 2016, which alleged that Marsicano was in violation of the Butler Township Zoning Ordinance for constructing and operating the heliport on his 1135 Pilot Point property.",
    "Butler Township Zoning Officer Thomas Percosky has evidence of violations on July 4, 2021, Aug. 13, 2021, and October 2021, which is corroborated by neighbors Richard Franzosa and Tracey Franzosa, who live in adjacent Hazle Township.",
    "The Franzosas were quoted as saying the operation of the helicopter made their lives “intolerable.”\nKarpowich, who handled that case as well said then: “Can you imagine being 100 feet away and having a helicopter take off?",
    "— Former state trooper, commercial airline pilot, Hazleton mayor, and current congressional candidate Mike Marsicano is facing a civil suit related to the operation of a helipad on his Butler Township property.",
    "The noise is unbelievable.”\nA cease-and-desist order was issued to Marsicano in 2011, however, he appealed it, citing that it was issued by Hazle Township, and that his residence is located in Butler Township.",
    "As plaintiff, Butler Township is requesting that Marsicano discontinue operation of the helipad, that it be removed from his property, and that future use be prohibited.",
    "Marsicano filed earlier this year as a Republican candidate for the 8th Congressional District seat, currently held by incumbent Democrat Matt Cartwright.",
    "The suit comes after several alleged violations of the Butler Township Zoning Ordinance, which municipal officials say Marsicano failed to appeal.",
    "Back in 2011, the Franzosas filed a lawsuit against Marsicano, alleging that the helipad was constructed without seeking any township permits.",
    "According to Section 310 of the Butler Township Zoning Ordinance, operating a heliport is not permitted in RC districts.",
    "Previous concerns\nThis complaint is not the first time Marsicano has faced backlash over the use of his home helipad.",
    "Butler Township received a civil judgement against Marsicano in magisterial district court on March 2 of this year.",
    "According to a Times Leader report at the time, there was no resolution due to the question of jurisdiction.",
    "If his political opponents hear a whirring sound, it is likely the gears coming loose inside their heads.",
    "Dennis Roddy, a spokesman for Marsicano’s campaign, responded on his behalf Wednesday night.",
    "Despite that judgement, he continues to operate his home heliport, the complaint states.",
    "The suit also requests costs, damages, and attorney fees be paid to Butler Township.",
    "Marsicano would be happy to remove any helipad from his property if there were one.",
    "Marsicano’s property is located in the Rural Conservation (RC) Zoning District.",
    "A subsequent violation was issued on Jan. 10, 2020, citing the same violation.",
    "“Mike’s helicopter is kept at the airport with all the other flying machines.",
    "There never has been,” Roddy wrote in an email to the Times Leader.",
    "Subscribers enjoy a distraction-free reading experience.",
    "Because there’s no helipad,” Roddy added.",
    "Click here to subscribe today or Login.",
    "Tired of ads?",
    "There is not.",
    "BUTLER TWP.",
    "“Mr."
  ]
}