[
  {
    "id": 4447,
    "mediaId": 2591,
    "date": "2022-01-20",
    "sentence": "The 30 other signatories include Reps. Ted Budd, Glenn Grothman, Jody Hice, Andy Biggs, Elise Stefanik, Doug Lamborn, Diana Harshbarger, Madison Cawthorn, Mary Miller, Mike Carey, Lauren Boebert, Chip Roy, Rodney Davis, Ralph Norman, Bill Posey, Bill Huizenga, Tom Tiffany, Andrew Clyde, Stephanie Bice, Clay Higgins, Claudia Tenney, Beth Van Duyne, <span class='selected-term'>Scott Perry</span>, Mo Brooks, David McKinley, Matt Rosendale, Paul Gosar, Byron Donalds, Nancy Mace and Jeff Duncan.",
    "author": "Human Events Staff",
    "title": "House Republicans Demand FDA Withdraw Race-Based Guidance for Monoclonal Antibodies"
  },
  {
    "id": 4281,
    "mediaId": 2580,
    "date": "2022-01-21",
    "sentence": "The 30 other signatories include Reps. Ted Budd, Glenn Grothman, Jody Hice, Andy Biggs, Elise Stefanik, Doug Lamborn, Diana Harshbarger, Madison Cawthorn, Mary Miller, Mike Carey, Lauren Boebert, Chip Roy, Rodney Davis, Ralph Norman, Bill Posey, Bill Huizenga, Tom Tiffany, Andrew Clyde, Stephanie Bice, Clay Higgins, Claudia Tenney, Beth Van Duyne, <span class='selected-term'>Scott Perry</span>, Mo Brooks, David McKinley, Matt Rosendale, Paul Gosar, Byron Donalds, Nancy Mace and Jeff Duncan.",
    "author": "",
    "title": "House Republicans Demand FDA Withdraw Race-Based Guidance for Monoclonal Antibodies"
  },
  {
    "id": 3318,
    "mediaId": 2730,
    "date": "2022-02-02",
    "sentence": "In addition to Bishop, the bill has 21 other co-sponsors, including Reps. Ralph Norman (SC), Bill Posey (FL), Jody Hice (GA), Randy Weber (TX), Ted Budd (NC), Andy Harris (MD), Tom Tiffany (WI), Roger Williams (TX), Greg Steube (FL), <span class='selected-term'>Scott Perry</span> (PA), Mary Miller (IL), Michael Cloud (TX), Louie Gohmert (TX), Bob Good (VA), Bob Gibbs (OH), Scott DesJarlais (TN), Matt Gaetz (FL), Glenn Grothman (WI), Brian Mast (FL), Brian Babin (TX), and Madison Cawthorn (NC).",
    "author": "Rebecca Downs",
    "title": "EXCLUSIVE: Rep. Bishop Introduces House Bill to Prevent Vaccine Passports for In-Person Voting"
  },
  {
    "id": 11488,
    "mediaId": 2591,
    "date": "2022-03-10",
    "sentence": "The bill’s 15 co-sponsors are Reps. Ted Budd, Paul Gosar, <span class='selected-term'>Scott Perry</span>, Mary Miller, Louie Gohmert, Matt Gaetz, Madison Cawthorn, Brian Babin, Randy Weber, Jeff Duncan, Rodney Davis, Lauren Boebert, Andrew Garbarino, Dan Bishop and Ralph Norman.",
    "author": "Human Events Staff",
    "title": "House Republicans Introduce Legislation to Designate MS-13 as Foreign Terrorist Organization"
  }
]