[
  {
    "id": 28,
    "mediaId": 2551,
    "date": "2022-02-24",
    "sentence": "'America's incompetent right now,' said TV host Ben Ferguson as he warned that adversaries were taking advantage\n+19\nView gallery\nFormer President Trump called into Fox News on Wednesday to claim the attack would not have happened on his watch\nRep <span class='selected-term'>Scott Perry</span> was among the Republicans who took to Twitter to blast Biden for Putin's aggression in Ukraine\nOthers warned that America's allies were watching what was unfolding and see American weakness on the world stage\n+19\nView gallery\nA steady stream of Republicans tweeted their anger at Biden and warned that the country's enemies would be watching.",
    "author": "Morgan Phillips",
    "title": "Republicans criticize Biden for admitting he 'knew' about Russia's invasion of Ukraine for months but still 'did nothing' and not sanctioning Putin personally is a 'big mistake'"
  },
  {
    "id": 12614,
    "mediaId": 2551,
    "date": "2022-02-26",
    "sentence": "+9\nView gallery\nRep. <span class='selected-term'>Scott Perry</span>, R-Pa., takes a question from a reporter at a news conference held by the House Freedom Caucus on Capitol Hill in Washington\n+9\nView gallery\nRussian President Vladimir Putin, left, and China's President Xi Jinping\n+9\nView gallery\nPresident Joe Biden leaves St. Joseph on the Brandywine Catholic Church in Wilmington, Delaware Saturday\n+9\nView gallery\nA Ukrainian soldier walks past debris of a burning military truck, on a street in Kyiv\n'The United States will continue to support a peaceful resolution of cross-strait issues, consistent with the wishes and best interests of the people on Taiwan,' a spokesman said.",
    "author": "Stephen M. Lepore For Dailymail.Com",
    "title": "'China is watching': GOP rep warns Beijing is studying Biden's response to Ukraine to decide whether it should invade Taiwan and urges president to show 'strength and resolve' to deter President Xi"
  },
  {
    "id": 7770,
    "mediaId": 2551,
    "date": "2022-04-02",
    "sentence": "Pennsylvania Congressman <span class='selected-term'>Scott Perry</span>, Chairman of the House Freedom Caucus agreed, telling Fox News that Disney's actions show they are actively pushing a 'woke' agenda.",
    "author": "",
    "title": "Families speak out about having to swear off Disney over its swing to left and woke policies"
  }
]