[
  {
    "id": 3721,
    "mediaId": 2618,
    "date": "2022-01-23",
    "sentence": "My congress critter, <span class='selected-term'>Scott Perry</span>, has military experience at least with the reserves.",
    "author": "Heather Hamilton",
    "title": "Six former Navy SEALs run for Congress with one goal: Take down Pelosi"
  },
  {
    "id": 4003,
    "mediaId": 4024,
    "date": "2022-01-25",
    "sentence": "“Therefore, we the undersigned refuse to consider supporting any federal government funding vehicle, be it a continuing resolution or an omnibus appropriations measure, that funds the enforcement of COVID-19 vaccine mandates at any level of government.”\nMore than a dozen Republicans have reportedly signed on so far, including Reps. Lauren Boebert of Colorado, Paul Gosar of Arizona, Clay Higgins of Louisiana, and <span class='selected-term'>Scott Perry</span> of Pennsylvania.",
    "author": "",
    "title": "House conservatives building support to block federal funding of Biden vaccine mandates"
  },
  {
    "id": 4087,
    "mediaId": 2641,
    "date": "2022-01-25",
    "sentence": "The letter gives Republicans until the end of the week to sign on to the plan and there are already more than a dozen on board, including Reps. <span class='selected-term'>Scott Perry</span>, R-Pa.; Clay Higgins, R-La.",
    "author": "Eric Mack",
    "title": "GOP Pitches Shutdown to Stop Vaccine Mandate Funding"
  },
  {
    "id": 4334,
    "mediaId": 2572,
    "date": "2022-01-25",
    "sentence": "There are already over a dozen signers, including GOP Reps. <span class='selected-term'>Scott Perry</span> of Pennsylvania, Clay Higgins of Louisiana, Paul Gosar of Arizona, and Lauren Boebert of Colorado.",
    "author": "Kelly Laco",
    "title": "Republicans consider shutting down government over vax mandate"
  },
  {
    "id": 4225,
    "mediaId": 2644,
    "date": "2022-01-27",
    "sentence": "More than two dozen GOP representatives joined the letter, including House Freedom Caucus Chairman <span class='selected-term'>Scott Perry</span> of Pennsylvania, Lauren Boebert of Colorado, Andy Biggs of Arizona, Marjorie Taylor Greene of Georgia, Louie Gohmert of Texas, Thomas Massie of Kentucky and Brian Mast of Florida.",
    "author": "Juliegrace Brufke",
    "title": "Chip Roy, GOP reps call for government shutdown if vaccine mandates stay in place"
  },
  {
    "id": 2985,
    "mediaId": 2748,
    "date": "2022-01-28",
    "sentence": "There are already over a dozen signatures, including GOP Reps. <span class='selected-term'>Scott Perry</span> of Pennsylvania, Clay Higgins of Louisiana, Paul Gosar of Arizona, and Lauren Boebert of Colorado.",
    "author": "",
    "title": "Can The GOP Shut Down The Gov Over Vaccine Mandates?"
  },
  {
    "id": 3013,
    "mediaId": 2618,
    "date": "2022-02-01",
    "sentence": "The House Freedom Caucus will hold a hearing Tuesday to analyze how President Joe Biden’s border policies have affected migration at the southern border after Biden’s first year in office ended with record-breaking numbers of illegal migrant apprehensions.The hearing will feature several members of the Freedom Caucus, including the new caucus chairman, Rep. <span class='selected-term'>Scott Perry</span> (R-PA), as well as key border officials, including the U.S. Border Patrol union president, Brandon Judd.The hearing begins at 3:00 p.m. and is taking place at the FreedomWorks headquarters in Washington, DC.",
    "author": "Ashley Oliver",
    "title": "Watch Live: Freedom Caucus Holds Hearing on Biden’s Border Policies After Record-Breaking Year of Illegal Migration"
  },
  {
    "id": 2520,
    "mediaId": 2540,
    "date": "2022-02-04",
    "sentence": "\"We are all on the same page,\" said Rep. <span class='selected-term'>Scott Perry</span>, a Pennsylvania Republican who chairs the group.",
    "author": "Melanie Zanona",
    "title": "McCarthy in bind as conservatives push GOP to oust Cheney in her primary"
  },
  {
    "id": 13003,
    "mediaId": 2672,
    "date": "2022-03-05",
    "sentence": "“While we pray for & offer support for Ukrainians fighting for freedom, why ignore our own?” the Congressman asked on Twitter, appealing for “freedom from vaccine tyranny.”\nRoy also shared an image of a joint letter addressed to House Minority Leader Rep. Kevin McCarthy (R-Calif.) and Senate Minority Leader Sen. Mitch McConnell (R-Ky.), where he and fellow anti-vax Republican Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.) sound the oft-used dog whistle of “the troops” to further double down on the baffling red herring argument.",
    "author": "Kat Bouza",
    "title": "Texas Congressman: Covid Vaccines, Not Ukraine Invasion, Are the Real ‘Crimes Against Humanity’"
  },
  {
    "id": 9352,
    "mediaId": 2687,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Cawthorn’s Orgy Comment Stirs Trouble"
  },
  {
    "id": 8911,
    "mediaId": 2658,
    "date": "2022-03-29",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.), who chairs the ultra-conservative House Freedom Caucus to which Cawthorn belongs, said he plans to speak to the North Carolina Republican one-on-one about the incendiary comment.",
    "author": "",
    "title": "Cawthorn’s orgies-and-drugs comment stirs trouble within Freedom Caucus"
  },
  {
    "id": 9309,
    "mediaId": 2658,
    "date": "2022-03-30",
    "sentence": "House Freedom Caucus Chair <span class='selected-term'>Scott Perry</span> (R-Pa.) told POLITICO in an interview Wednesday that he plans to discuss the matter with Cawthorn, as more than one of the ultra-conservative members in the group rattle about kicking him out of the caucus.",
    "author": "",
    "title": "McCarthy: Cawthorn's 'lost my trust' following orgy and cocaine comments"
  },
  {
    "id": 9120,
    "mediaId": 2590,
    "date": "2022-03-30",
    "sentence": "House Freedom Caucus Chair Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.) previously told Politico he also plans to speak with Cawthorn on the matter, adding that he might ask the lawmaker to name names.",
    "author": "Sara Boboltz",
    "title": "Talking About Cocaine And Orgies Is The GOP's Red Line"
  },
  {
    "id": 8967,
    "mediaId": 2512,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-PA) (photo), who has been asked by the January 6 Committee to testify but has refused, told Politico’s Olivia Beavers, “I think it is important, if you’re going to say something like that, to name some names.”\nTuesday Beavers also reported that House Republican Minority Leader Kevin McCarthy had wanted to speak with Cawthorn about the allegations – not to start any type of investigation, but because some Republicans said they were “upset” Cawthorn made the claim.",
    "author": "David Badash",
    "title": "'Name names': House Freedom Caucus chair demands Cawthorn reveal who invited him to coke-fueled orgy parties"
  },
  {
    "id": 9481,
    "mediaId": 2603,
    "date": "2022-03-30",
    "sentence": "“I think it is important, if you’re going to say something like that, to name some names,” Rep. <span class='selected-term'>Scott Perry</span>, chair of the House Freedom Caucus of which Cawthorn is a member, told Politico.",
    "author": "Kylie Cheung",
    "title": "Republicans Insist Madison Cawthorn 'Name' the Coke-Doers and Orgy-Havers Among Them"
  },
  {
    "id": 9545,
    "mediaId": 2676,
    "date": "2022-03-30",
    "sentence": "\"I think it is important, if you're going to say something like that, to name some names,\" echoed Rep. <span class='selected-term'>Scott Perry</span>, R-Pa. said in an interview with Politico.",
    "author": "Jon Skolnik",
    "title": "Madison Cawthorn is a GOP castaway: Kevin McCarthy fumes at House Republican's \"orgies\" allegation"
  },
  {
    "id": 9553,
    "mediaId": 2738,
    "date": "2022-03-30",
    "sentence": "Among them are House Minority Leader Kevin McCarthy and Rep. <span class='selected-term'>Scott Perry</span>, who said that “I think it is important, if you’re going to say something like that, to name some names.” While McCarthy may hold a higher position, Perry chairs the House Freedom Caucus, to which Cawthorn belongs—at least for now.",
    "author": "Jennifer Wood",
    "title": "Madison Cawthorn’s Fellow GOP Wingnuts In The House Are Pissed About Him Blabbering About Cocaine-Fueled Orgies"
  },
  {
    "id": 9631,
    "mediaId": 2589,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.), who chairs the ultra-conservative House Freedom Caucus to which Cawthorn belongs, said he plans to speak to the North Carolina Republican one-on-one about the incendiary comment.",
    "author": "Allahpundit",
    "title": "McCarthy rips Cawthorn: He told me his story about orgies and coke was exaggerated"
  },
  {
    "id": 9665,
    "mediaId": 2553,
    "date": "2022-03-30",
    "sentence": "“I think it is important, if you’re going to say something like that, to name some names,” Rep. <span class='selected-term'>Scott Perry</span> (R-PA), chairman of the House Freedom Caucus said.",
    "author": "Ryan Saavedra",
    "title": "Madison Cawthorn Admits His Claims Of Lawmaker Orgies And Drug Use Were ‘Exaggerated’: GOP Leader"
  },
  {
    "id": 9691,
    "mediaId": 2514,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Dave Goldiner",
    "title": "Rep. Madison Cawthorn admits lying about cocaine and orgies after tongue-lashing from GOP leaders"
  },
  {
    "id": 10255,
    "mediaId": 2723,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-PA) (photo), who has been asked by the January 6 Committee to testify but has refused, told Politico’s Olivia Beavers, “I think it is important, if you’re going to say something like that, to name some names.”\nTuesday Beavers also reported that House Republican Minority Leader Kevin McCarthy had wanted to speak with Cawthorn about the allegations – not to start any type of investigation, but because some Republicans said they were “upset” Cawthorn made the claim.",
    "author": "David Badash",
    "title": "‘Name Names’: House Freedom Caucus Chair Demands Cawthorn Reveal Who Invited Him to Coke-Fueled Orgy Parties"
  },
  {
    "id": 7150,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "House Freedom Caucus Chair Rep. <span class='selected-term'>Scott Perry</span>, R-Pa., told Politico that he planned to talk with Cawthorn as some members of the caucus had suggested kicking out Cawthorn.",
    "author": "Charlie McCarthy",
    "title": "Leader McCarthy: I've 'Lost Confidence' in Rep. Cawthorn After Orgy, Cocaine Comments"
  },
  {
    "id": 7128,
    "mediaId": 2662,
    "date": "2022-03-31",
    "sentence": "Freedom Caucus Chairman Rep. <span class='selected-term'>Scott Perry</span> (R-PA) said he plans to speak to Cawthorn in the near future about his allegations, the lawmaker explained to Politico.",
    "author": "Julian Conradson",
    "title": "House Freedom Caucus Members Want Madison Cawthorn to “Name Names” After Explosive DC Swamp Coke, Orgy Claims"
  },
  {
    "id": 4977,
    "mediaId": 2621,
    "date": "2022-04-23",
    "sentence": "“It’s just unreal.”\nACOSTA: According to this new court filing from the Jan. six committee, an aide to Mark Meadows told the committee that she heard Republican Congressman <span class='selected-term'>Scott Perry</span> talking about this idea of sending people to the Capitol on January sixth.",
    "author": "Caleb Howe",
    "title": "Michael Fanone Savages Kevin McCarthy After Jan. 6 Audio Released: ‘Potentially Being Speaker Way More Important’ to Him Than Democracy"
  }
]