[
  {
    "id": 12614,
    "mediaId": 2551,
    "date": "2022-02-26",
    "sentence": "+9\nView gallery\nRep. <span class='selected-term'>Scott Perry</span>, R-Pa., takes a question from a reporter at a news conference held by the House Freedom Caucus on Capitol Hill in Washington\n+9\nView gallery\nRussian President Vladimir Putin, left, and China's President Xi Jinping\n+9\nView gallery\nPresident Joe Biden leaves St. Joseph on the Brandywine Catholic Church in Wilmington, Delaware Saturday\n+9\nView gallery\nA Ukrainian soldier walks past debris of a burning military truck, on a street in Kyiv\n'The United States will continue to support a peaceful resolution of cross-strait issues, consistent with the wishes and best interests of the people on Taiwan,' a spokesman said.",
    "author": "Stephen M. Lepore For Dailymail.Com",
    "title": "'China is watching': GOP rep warns Beijing is studying Biden's response to Ukraine to decide whether it should invade Taiwan and urges president to show 'strength and resolve' to deter President Xi"
  },
  {
    "id": 61,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "ORLANDO, Fla. – Republican Rep. <span class='selected-term'>Scott Perry</span> said it is \"not too late\" for the Biden administration to \"show some strength\" with regard to China's ambitions in Taiwan amid concerns that Beijing has been emboldened by Russian aggression in Ukraine.",
    "author": "Brooke Singman",
    "title": "GOP Rep. Perry says 'not too late' for Biden admin to prevent Chinese attack on Taiwan amid Russia-Ukraine"
  },
  {
    "id": 13347,
    "mediaId": 2748,
    "date": "2022-03-01",
    "sentence": "Amid growing concerns that Beijing has been emboldened by Russian aggression in Ukraine, Republican Rep. <span class='selected-term'>Scott Perry</span> insists it is “not too late” for the Biden administration to “show some strength” with regard to China’s ambitions in Taiwan.",
    "author": "",
    "title": "Internal Debate: Biden Bungled Afghanistan & Ukraine, Is It Too Late For Taiwan?"
  },
  {
    "id": 11051,
    "mediaId": 2746,
    "date": "2022-03-10",
    "sentence": "• <span class='selected-term'>Scott Perry</span> is the U.S. representative for Pennsylvania’s 10th congressional district.",
    "author": "Rep. Scott Perry",
    "title": "Steps the U.S. must take to stop murderous dictator Putin"
  }
]