[
  {
    "id": 4038,
    "mediaId": 6571,
    "date": "2022-01-25",
    "sentence": "Meanwhile, Wolf's map shifts the heavily Democratic city of Harrisburg out of a district with York now represented by Republican Rep. <span class='selected-term'>Scott Perry</span> and into a district with Lancaster now represented by Republican Rep. Lloyd Smucker.",
    "author": "",
    "title": "Lawmakers Stalemated On Pennsylvania Congressional Map, Top Senator Says"
  },
  {
    "id": 1359,
    "mediaId": 8254,
    "date": "2022-02-16",
    "sentence": "This story has been updated to reflect that Congressman <span class='selected-term'>Scott Perry</span> was not subpoenaed by the committee, which did request information from him and he refused.",
    "author": "Dennis Owens",
    "title": "Mastriano mute for the moment on Jan. 6 subpoena"
  },
  {
    "id": 54,
    "mediaId": 2526,
    "date": "2022-02-22",
    "sentence": "https://t.co/sJfnDJXgCj\n— Chip Roy (@chiproytx) February 20, 2022\nThe Freedom Caucus chair, Rep. <span class='selected-term'>Scott Perry</span> (R-PA), also condemned the event’s coronavirus rules, saying in a statement to Breitbart News, “The arbitrary and capricious rules set forth are nothing short of farce and political theater meant to deeply divide and further distract from a president who just never fails to fail.” The Pennsylvania Republican has not publicly made a decision on if he will attend.",
    "author": "Ashley Oliver",
    "title": "Cotton, Rubio Among Those Planning to Boycott Joe Biden’s State of the Union"
  },
  {
    "id": 62,
    "mediaId": 2564,
    "date": "2022-02-24",
    "sentence": "'As we pray for the Ukrainian people, make no mistake: THIS is what happens when America’s enemies see a weak and incompetent @POTUS,' tweeted U.S. Rep. <span class='selected-term'>Scott Perry</span>, adding the hashtag Bidenisafailure.",
    "author": "",
    "title": "Republican Senator Josh Hawley says Biden 'emboldened' Putin to do 'whatever he wants' by 'shutting down' American energy production and says he is 'unfit' to be in office"
  },
  {
    "id": 10736,
    "mediaId": 2526,
    "date": "2022-03-07",
    "sentence": "Brooks has introduced the “Freedom to Fly Maskless Act” with co-sponsors like Reps. Paul Gosar (R-AZ), <span class='selected-term'>Scott Perry</span> (R-PA), and Tom Tiffany (R-WI), to prohibit the federal government from mandating masks, negative Chinese coronavirus tests, and vaccinations on all public transportation.",
    "author": "John Binder",
    "title": "Mo Brooks Leads Effort to End Mask Mandate on U.S. Commercial Flights"
  },
  {
    "id": 7924,
    "mediaId": 6669,
    "date": "2022-04-06",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-Penn.)",
    "author": "Basil John",
    "title": "House Democrats and Republicans concerned about new Iran Nuclear Deal"
  },
  {
    "id": 7640,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Voters can still save the country, but Democrats have to help them\nDaily Kos' The Brief\nFollowShare\n0:0058:38\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nA quick search for the legislation revealed those 10 lawmakers’ names: Rep. August Pfluger of Texas, Rep. Jake Ellzey of Texas, Rep. Brian Mast of Florida, Rep. Alexander Mooney of West Virginia, Rep. Adrian Smith of Nebraska, Rep. Tom McClintock of California, Rep. Yvette Herrell of New Mexico, Rep. Jefferson Van Drew of New Jersey, Rep. <span class='selected-term'>Scott Perry</span> of Pennsylvania, and Rep.",
    "author": "",
    "title": "GOP introduces bill forbidding Biden from potentially declaring climate change the threat that it is"
  }
]