[
  {
    "id": 3721,
    "mediaId": 2618,
    "date": "2022-01-23",
    "sentence": "My congress critter, <span class='selected-term'>Scott Perry</span>, has military experience at least with the reserves.",
    "author": "Heather Hamilton",
    "title": "Six former Navy SEALs run for Congress with one goal: Take down Pelosi"
  },
  {
    "id": 4038,
    "mediaId": 6571,
    "date": "2022-01-25",
    "sentence": "Meanwhile, Wolf's map shifts the heavily Democratic city of Harrisburg out of a district with York now represented by Republican Rep. <span class='selected-term'>Scott Perry</span> and into a district with Lancaster now represented by Republican Rep. Lloyd Smucker.",
    "author": "",
    "title": "Lawmakers Stalemated On Pennsylvania Congressional Map, Top Senator Says"
  },
  {
    "id": 3634,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "The public has met a series of other players: Philip Waldron, an Army veteran turned cybersecurity investigator; the businessman Russell Ramsland; the Overstock.com founder Patrick Byrne; the professional bad penny Bernard Kerik; and members of Congress such as Representative <span class='selected-term'>Scott Perry</span> of Pennsylvania.\"",
    "author": "Bob Brigham",
    "title": "‘Bumbling consigliere’ Giuliani exposed dozens of seasoned GOP operatives to legal liability: report"
  },
  {
    "id": 3273,
    "mediaId": 2630,
    "date": "2022-02-01",
    "sentence": "Last week, The Dispatch reported that House Minority Leader Kevin McCarthy, R-Calif., had pushed back on an effort from Freedom Caucus Chairman <span class='selected-term'>Scott Perry</span>, R-Pa., to boot Cheney from the conference because doing so could lead to Republicans losing committee seats.",
    "author": "",
    "title": "RNC to debate endorsing ouster of Cheney, Kinzinger from House GOP"
  },
  {
    "id": 3318,
    "mediaId": 2730,
    "date": "2022-02-02",
    "sentence": "In addition to Bishop, the bill has 21 other co-sponsors, including Reps. Ralph Norman (SC), Bill Posey (FL), Jody Hice (GA), Randy Weber (TX), Ted Budd (NC), Andy Harris (MD), Tom Tiffany (WI), Roger Williams (TX), Greg Steube (FL), <span class='selected-term'>Scott Perry</span> (PA), Mary Miller (IL), Michael Cloud (TX), Louie Gohmert (TX), Bob Good (VA), Bob Gibbs (OH), Scott DesJarlais (TN), Matt Gaetz (FL), Glenn Grothman (WI), Brian Mast (FL), Brian Babin (TX), and Madison Cawthorn (NC).",
    "author": "Rebecca Downs",
    "title": "EXCLUSIVE: Rep. Bishop Introduces House Bill to Prevent Vaccine Passports for In-Person Voting"
  },
  {
    "id": 3149,
    "mediaId": 2636,
    "date": "2022-02-02",
    "sentence": "The bills enjoy broad support — the 42 co-sponsors of Ms. Spanberger’s TRUST in Congress Act include Representatives Matt Gaetz of Florida, <span class='selected-term'>Scott Perry</span> of Pennsylvania and Andy Harris of Maryland, all firmly in the Trump wing of their party — and if anything, they are putting Ms. Pelosi in the spotlight.",
    "author": "",
    "title": "Democrats Break With Leaders Over Congressional Stock Trading"
  },
  {
    "id": 1359,
    "mediaId": 8254,
    "date": "2022-02-16",
    "sentence": "This story has been updated to reflect that Congressman <span class='selected-term'>Scott Perry</span> was not subpoenaed by the committee, which did request information from him and he refused.",
    "author": "Dennis Owens",
    "title": "Mastriano mute for the moment on Jan. 6 subpoena"
  },
  {
    "id": 79,
    "mediaId": 2658,
    "date": "2022-02-23",
    "sentence": "Two are held by GOP Reps. Brian Fitzpatrick and <span class='selected-term'>Scott Perry</span>, another two are held by Democratic Reps. Susan Wild and Matt Cartwright, and a fifth swing district is the open Pittsburgh-area seat that Democratic Rep. Conor Lamb is vacating to run for Senate.",
    "author": "",
    "title": "State courts shake up Pennsylvania, North Carolina with new House lines"
  },
  {
    "id": 12664,
    "mediaId": 2732,
    "date": "2022-02-28",
    "sentence": "U.S. Rep. <span class='selected-term'>Scott Perry</span> has just vanquished one major potential foe in his quest for a 6th term in Congress, as former Pennsylvania Auditor General Eugene DePasquale has decided not to seek a rematch of their 2020 race.",
    "author": "",
    "title": "Eugene DePasquale will not oppose U.S. Rep. Scott Perry in the 10th Congressional District race"
  },
  {
    "id": 17112,
    "mediaId": 8254,
    "date": "2022-02-28",
    "sentence": "Now, at a time of persistent inflation, global instability, and an ongoing assault on our institutions and rights, <span class='selected-term'>Scott Perry</span> has done the opposite, perpetuating far-right conspiracies and trafficking in hostility and contempt.",
    "author": "George Stockburger",
    "title": "DePasquale opts out of Pa. 10th Congressional district race"
  },
  {
    "id": 13003,
    "mediaId": 2672,
    "date": "2022-03-05",
    "sentence": "“While we pray for & offer support for Ukrainians fighting for freedom, why ignore our own?” the Congressman asked on Twitter, appealing for “freedom from vaccine tyranny.”\nRoy also shared an image of a joint letter addressed to House Minority Leader Rep. Kevin McCarthy (R-Calif.) and Senate Minority Leader Sen. Mitch McConnell (R-Ky.), where he and fellow anti-vax Republican Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.) sound the oft-used dog whistle of “the troops” to further double down on the baffling red herring argument.",
    "author": "Kat Bouza",
    "title": "Texas Congressman: Covid Vaccines, Not Ukraine Invasion, Are the Real ‘Crimes Against Humanity’"
  },
  {
    "id": 9438,
    "mediaId": 5308,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> of Pennsylvania, the caucus chair, told Politico he plans to talk to Cawthorn about his claims.",
    "author": "Paul Blest",
    "title": "The Freedom Caucus Has Been Triggered by Cawthorn’s Coke and Orgies Comments"
  },
  {
    "id": 9545,
    "mediaId": 2676,
    "date": "2022-03-30",
    "sentence": "\"I think it is important, if you're going to say something like that, to name some names,\" echoed Rep. <span class='selected-term'>Scott Perry</span>, R-Pa. said in an interview with Politico.",
    "author": "Jon Skolnik",
    "title": "Madison Cawthorn is a GOP castaway: Kevin McCarthy fumes at House Republican's \"orgies\" allegation"
  },
  {
    "id": 7150,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "House Freedom Caucus Chair Rep. <span class='selected-term'>Scott Perry</span>, R-Pa., told Politico that he planned to talk with Cawthorn as some members of the caucus had suggested kicking out Cawthorn.",
    "author": "Charlie McCarthy",
    "title": "Leader McCarthy: I've 'Lost Confidence' in Rep. Cawthorn After Orgy, Cocaine Comments"
  },
  {
    "id": 7135,
    "mediaId": 2745,
    "date": "2022-04-06",
    "sentence": "), 56 “nay” votes\nRep. Lauren Boebert (Colo.), 56 “nay” votes\nRep. Matt Gaetz (Fla.), 51 “nay” votes\nRep. <span class='selected-term'>Scott Perry</span> (Pa.), 49 “nay” votes\nRep. Mary E. Miller (Ill.), 49 “nay” votes\nRep. Clay Higgins (La.",
    "author": "",
    "title": "The House Republican ‘no’ caucus is at it again"
  },
  {
    "id": 5124,
    "mediaId": 8493,
    "date": "2022-04-19",
    "sentence": "Jeffrey D. Hill of Muncy, a registered Democrat, in documents filed Friday and Monday in U.S. Middle District Court, claims actions taken by state Sen. Doug Mastriano and U.S. Rep. <span class='selected-term'>Scott Perry</span> disqualify them under the state constitution.",
    "author": "WKOK Staff",
    "title": "Muncy Man Files Suit to Keep Mastriano, Cong. Perry Off Ballot"
  },
  {
    "id": 5957,
    "mediaId": 2562,
    "date": "2022-04-20",
    "sentence": "Four GOP-held seats — Reps. Bill Huizenga, who represents Michigan’s 2nd Congressional District and is running for reelection in the 4th; Richard Hudson, who holds North Carolina’s 8th Congressional District and is running for reelection in the 9th; Rep. <span class='selected-term'>Scott Perry</span> of Pennsylvania’s 10th Congressional District; and Texas 23rd Congressional District Rep. Tony Gonzales — all shifted from \"likely Republican\" to \"safe Republican,\" the Washington Examiner reported.",
    "author": "NationalWatch",
    "title": "House Races Shift in Republicans’ Favor: Nonpartisan Forecasters"
  },
  {
    "id": 5236,
    "mediaId": 2746,
    "date": "2022-04-20",
    "sentence": "The 13th Congressional District, however, shifted in Sabato’s Crystal Ball rating from “Likely Democratic” to “Leans Democratic.”\nThe remaining lawmakers whose reelections received rating changes from the Larry Sabato’s Crystal Ball are House Republican members whose districts went from “Likely Republican” to “Safe Republican.” These members are Reps. Bill Huizenga of Michigan, Rep. Richard Hudson of North Carolina, <span class='selected-term'>Scott Perry</span> of Pennsylvania and Tony Gonzales of Texas.",
    "author": "Kerry Picket",
    "title": "Election forecasters move more than a dozen House races in GOP direction"
  },
  {
    "id": 4977,
    "mediaId": 2621,
    "date": "2022-04-23",
    "sentence": "“It’s just unreal.”\nACOSTA: According to this new court filing from the Jan. six committee, an aide to Mark Meadows told the committee that she heard Republican Congressman <span class='selected-term'>Scott Perry</span> talking about this idea of sending people to the Capitol on January sixth.",
    "author": "Caleb Howe",
    "title": "Michael Fanone Savages Kevin McCarthy After Jan. 6 Audio Released: ‘Potentially Being Speaker Way More Important’ to Him Than Democracy"
  }
]