{
  "id": 108,
  "mediaId": 2573,
  "date": "2022-02-24",
  "headline": "Trump, allies defend or deflect Putin’s invasion; was Romney right?",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/27787eeb-Romney_trip.jpg",
  "link": "https://www.foxnews.com/media/trump-allies-defend-putins-invasion-romney",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Howard Kurtz | Fox News",
  "authorUrl": "",
  "termIds": [
    4905,
    5507,
    5583,
    4591,
    4345,
    2765,
    3639,
    3662,
    4267,
    1126,
    6672
  ],
  "sentences": [
    "The Washington Post noted that Vance, a Senate candidate in Ohio, tweeted that \"what’s happening in Ukraine has nothing to do with our national security, but it is distracting our idiot ‘leaders’ from focusing on the things that actually do matter to our national security, like securing the border & stopping the flow of Fentanyl that’s killing American kids.\"",
    "And I don’t get the praise for Putin, a man who jails and poisons his opponents and spewed all kinds of fabrications to justify his invasion, the second time in eight years he has attempted to seize a chunk of Ukraine – which he doesn’t even view as a legitimate country.",
    "Some are saying Biden hasn’t gone far enough – criticism that’s been fueled by the president’s decision to roll out only limited sanctions, apparently because the Russian military has entered only a couple of rebellious provinces so far.",
    "They raised no objection when Donald Trump said Vladimir Putin is a \"genius,\" and \"very savvy,\" for his handling of Ukraine and framing the invasion as a \"peacekeeping\" mission (which is, of course, an outright lie).",
    "The criticism exploded when Barack Obama, in their final debate, said to Romney that \"the 1980s, they’re now calling to ask for their foreign policy back because, you know, the Cold War’s been over for 20 years.\"",
    "But there is another Republican faction, generally aligned with a certain former president, that doesn’t particularly care about Ukraine, and believes its base doesn’t much care either.",
    "Perhaps it’s also time to acknowledge that not only was he right about Russia, but he wasn’t the heartless hedge-fund capitalist that became his indelible image in that campaign.",
    "Many GOP leaders, such as Mitch McConnell and Lindsey Graham, are backing President Biden in lining up NATO allies for imposing sanctions on Russia for its invasion of Ukraine.",
    "They argue that expanding the U.S. commitment to NATO is a mistake, and that the president should instead focus on countering China and securing America’s southern border.\"",
    "Noticeably missing from the Putin praise in that radio interview was even the mildest disapproval for one country using force to seize territory from a sovereign neighbor.",
    "Hawley, for instance, is one of roughly a dozen Senate Republicans who didn’t back legislation last week urging the imposition of sanctions if Russia invaded Ukraine.",
    "It was in an interview with Wolf Blitzer that Mitt Romney, running for president in 2012, declared that Russia was \"without question our number one geopolitical foe.\"",
    "This was in the midst of Obama’s reset with Moscow, and Romney was widely derided as a relic who didn’t understand that al-Qaeda and Iran were America’s top enemies.",
    "Mike Pompeo, Trump’s secretary of state, told Fox last month that Putin is \"a credible, capable statesman,\" but said this week he is the \"aggressor\" against Ukraine.",
    "Ukraine, of course, was at the heart of the first impeachment, when Trump held up military aid while pressuring the country’s leader to provide dirt about Joe Biden.",
    "For decades, the Republican Party has stood for being tough on Communism, and the Democrats, fairly or unfairly, were often criticized for a softer approach.",
    "The New York Times editorial page said Romney’s comments \"display either a shocking lack of knowledge about international affairs or just craven politics.",
    "\"We don’t have any interest — no one in the Trump movement has any interest at all in the Russian-speaking provinces of eastern Ukraine.",
    "Vance, among others — has taken a third path, actively arguing against any U.S. involvement in the region while still dinging Biden.",
    "The media have been much more favorable to Romney in recent years as he became a sharp Trump critic who voted for impeachment.",
    "I don’t get the abandonment of the NATO alliance and indifference to a military takeover of what used to be a Soviet state.",
    "Steve Bannon, a charter member of what Politico calls the \"America First\" crowd, says: \"It’s not a split on the right.",
    "Some media liberals, and Democrats like David Axelrod and Rep. Ted Lieu, are also acknowledging Romney’s prescience.",
    "It shows you the new right, or the new Republican Party, versus the neocons that are still there,\" said Bannon.",
    "Politico says \"a vocal GOP minority on and off Capitol Hill — represented by Sen. Josh Hawley (R-Mo.",
    "But now, CNN’s Chris Cillizza says \"It’s Time to Admit It: Mitt Romney Was Right About Russia.\"",
    "AN ERA OF ENDLESS DEBATES, FROM UKRAINE TO VACCINES TO RUSSIAGATE\nI get the criticism of Biden.",
    "Most lawmakers would be all over the airwaves with a victory lap, but that’s not Romney.",
    "Columnist Tom Friedman said Romney seemed to have gotten his foreign policy from IHOP.",
    "Either way, they are reckless and unworthy of a major presidential contender.\"",
    "At the time, Cillizza called Obama’s jab \"the best line of the three debates.\"",
    "I twice asked the Utah senator’s office for comment and got no response.",
    "There was, of course, one Republican who warned about this a decade ago.",
    "I get the argument that Ukraine shouldn’t be a top American priority.",
    "The Boston Globe said \"maybe Romney forgot what decade it was.\"",
    "), Fox News host Tucker Carlson and Ohio Senate candidate J.D.",
    "But now the entire deck is scrambled.",
    "Good for him.",
    "Zero.\""
  ]
}