{
  "id": 10914,
  "mediaId": 2658,
  "date": "2022-03-07",
  "headline": "Russian-linked campaign cash raises new questions",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/03/07/russian-linked-campaign-cash-raises-new-questions-00014535",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5640,
    1679,
    2126,
    4099,
    4066,
    2976,
    1073,
    6569,
    6672
  ],
  "sentences": [
    "Did Meadows potentially commit voter fraud by listing the Scaly Mountain address on his registration form?”\nTRUMP CARD — “Republicans are courting Trump’s support for Pa. governor — very carefully,” by Chris Brennan, Philadelphia Inquirer: “In a Trump primary, getting ahead of yourself can get your head handed to you.”\nEVERYTHING’S BIGGER IN TEXAS — “Uncounted mail-in ballots discovered in Harris County add uncertainty to two Democratic races,” by Mitchell Ferman, Texas Tribune: Two notable Democratic primary races have gained a new level of uncertainty after Texas’ largest county said it ‘identified approximately 10,000 mail-in ballots (6,000 Democratic and 4,000 Republican) that were not added into the original Election Night count.’”\nPOLL POSITION\n— “Biden gets a bounce after the State of the Union, NPR/PBS NewsHour/Marist poll shows,” by Domenico Montanaro, NPR: “After what's been a bleak several months politically for President Biden, a new NPR/PBS NewsHour/Marist survey finds he is seeing a significant boost in his approval ratings across the board following his State of the Union address and Russia's invasion of Ukraine.”\n— “Iowa Poll: As 2022 governor's race takes shape, Kim Reynolds leads Deidre DeJear,” by Brianne Pfannenstiel, Des Moines Register: “Republican Gov.",
    "Days until the CA-22 special election primary: 30\nDays until the Texas runoff: 78\nDays until the Indiana and Ohio primaries: 79\nDays until the general election: 247\nDays until the 2024 election: 975\nCAMPAIGN INTEL\nTHE GOVERNORS — “The Democratic Party’s emerging priority: Save the governors,” by Elena Schneider and Christopher Cadelago, POLITICO: “Ahead of the midterm elections, Democrats are expanding their scope far beyond congressional contests and on to governor races in battleground states, seeing them as existential for the party’s presidential prospects, if not democratic governance itself.”\nTHE MAP LINES — “GOP-led Florida Legislature approves new congressional maps that DeSantis vows to veto,” by Gary Fineout, POLITICO Florida: “Florida’s Republican-controlled Legislature on Friday approved a set of doomed congressional maps that Gov.",
    "House lawmakers are considering companion legislation.”\n— “Judge shuts down January 6-based challenge to Rep. Madison Cawthorn's candidacy,” by Marshall Cohen, CNN: “A federal judge on Friday shut down a legal challenge to GOP Rep. Madison Cawthorn's candidacy from a group of North Carolina voters and advocacy groups who claimed that an old provision of the US Constitution banned him from running because of his role on the January 6 insurrection.”\nMIDTERM MESSAGING — “Republicans court growing conservative voter bloc: Colombian Americans,” by Carmen Sesin, NBC News: “Months before the U.S. midterms, a growing group of Florida voters have been mobilizing to vote in elections a continent away — while Republicans see an opportunity to gain voters in November.",
    "But the 2020 election also pointed to another problem: Hispanic voters (who are growing as a portion of the electorate) moving toward the Republican Party.”\nFIRST IN SCORE: BIDEN TIME — “EDF Action launches Six-Figure Ad Campaign Supporting President Biden’s Efforts to Invest in Climate & Clean Energy,” via EDF Action: “EDF Action, the advocacy partner of the Environmental Defense Fund, is launching a new paid and digital media campaign to amplify President Biden’s call in his State of the Union Address for Congress to pass his climate and environmental justice priorities so that he can sign them into law.",
    "Former state Sen. Sam Searcy announced he would add his name to the list of candidates in a swing district.”\n— “Jared Moskowitz is first major candidate for Ted Deutch congressional seat,” by Anthony Man, Sun Sentinel: “Jared Moskowitz on Friday became the first major candidate to announce he’s running to fill the congressional seat being vacated later this year by U.S. Rep. Ted Deutch, instantly becoming a top contender.”\nENDORSEMENT ALERT — The NRDC Action Fund endorsed 22 House lawmakers for reelection, the environmental group announced.",
    "At least four key allies of the Perdue family political machine are openly backing Kemp, while many others are pointedly staying on the sidelines ahead of the May 24 matchup between the former friends.”\nHINDSIGHT IS 2020 — “Why Did Mark Meadows Register to Vote at an Address Where He Did Not Reside?” by Charles Bethea, The New Yorker: “After Trump lost the election, Meadows was one of the most influential Republicans claiming without factual evidence that widespread voter fraud had taken place.",
    "It’s a substantial commitment in a state that national Democrats and Republicans are targeting in their battle for control of the chamber, and one where the pricey Boston media market in neighboring Massachusetts is key to reaching voters.”\n— “Gibbons rolls out ad hitting Vance, Timken over Trump,” by Julia Manchester, The Hill: “Ohio Republican Senate candidate Mike Gibbons rolled out an ad on Friday questioning his primary rivals' support for former President Trump.",
    "“I've taken contributions from American citizens who support my election or my reelection and have no ties whatsoever to the Kremlin,” Auchincloss said on WCVB’s “On the Record.” “This strikes me as sort of grasping at straws from would-be opponents trying to muddy the track record that I've built.”\nPlenty of lawmakers on either side of the aisle could face the same question about their campaign bank accounts — and some of them already have.",
    "The campaign kicked off yesterday with a print ad in the president’s hometown paper, the Wilmington News Journal, and will layer on a digital ad campaign.”\nGETTING IN — “Former state senator running to represent Wake and Johnston counties in Congress,” by Danielle Battaglia, The News & Observer: “As candidate filing wrapped up Friday in North Carolina for the 2022 election, a new name emerged to run for Congress in the Triangle.",
    "Colombian Americans can vote in elections in their home country as long as they register.”\n— “Democrats' problem with Hispanic voters isn't going away as GOP gains seem to be solidifying,” by Harry Enten, CNN: “The Democratic Party's early 2000s dream of an emerging majority based on a diversifying electorate has run into reality.",
    "Balter told The Citizen on Saturday that she is endorsing Josh Riley in the Democratic primary.”\nJUST PEACHY — “David Perdue’s challenge fractures powerful family political machine,” by Greg Bluestein, The Atlanta Journal-Constitution: “The Perdue network was once the most formidable political operation in Georgia.",
    "CODA — HEADLINE OF THE DAY — “Carpetbagger Morgan Ortagus Dodges Questions from The Tennessee Star: ‘You Need to Stop Being Mean to Me,’” — The Tennessee Star\nFollow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "— “Dana Balter endorses Josh Riley over six other CNY Democrats for Congress,” by Robert Harding, The Citizen: “Dana Balter, a Syracuse Democrat who has been the party's nominee for Congress in the last two elections, was not planning to make an endorsement in the newly drawn 22nd Congressional District.",
    "Russian-linked campaign cash raises new questions\nBy STEPHANIE MURRAY\n03/07/2022 10:00 AM EST\nTop Line\nUNDER THE MICROSCOPE — As the war in Ukraine rages on, lawmakers are beginning to face questions about the campaign donations they’ve accepted from a billionaire with ties to a top Russian oligarch.",
    "Ron DeSantis has pledged to veto, leaving the state’s redistricting in limbo with just days left in the 2022 session.”\n— RELATED: “House lawmakers who sided with DeSantis in map fight see their priorities stalled,” by Matt Dixon, POLITICO Florida.",
    "… The spot is a part of a $10 million ad buy from the Gibbons campaign, which is set to run through the Ohio primary on May 3.”\nSTAFFING UP\n— Sam Fullam is organizing director for New York Democrat Alessandra Biaggi’s congressional campaign.",
    "— “314 Action Fund Endorses Physician Dr. Asif Mahmood in CA-40 Race,” via 314 Action: “314 Action Fund announced its endorsement of Dr. Asif Mahmood in the race to represent California’s fortieth congressional district.",
    "BALLOT BATTLE — “Florida Senate passes GOP bill that would create police force for election crimes,” The Associated Press: “The Florida Senate passed a voting law package Friday that was pushed by Gov.",
    "The billionaire has been known for keeping the Kremlin at a distance, according to a Financial Times profile from 2019, which noted Blavatnik’s team asks reporters not to refer to him as an oligarch.",
    "The magnifying glass comes as the United States hits Russia with harsh sanctions, and governors take symbolic steps like banning Russian alcohol in their states in a show of solidarity with Ukraine.",
    "It’s not unheard of for political campaigns to pledge not to accept campaign contributions for symbolic reasons, like money from corporate PACs or the fossil fuel industry.",
    "In late 2020 and early 2021, he e-mailed the Justice Department, urging it to investigate claims of voter fraud, including claims that courts had previously rejected.",
    "The latest Des Moines Register/Mediacom Iowa Poll shows 51% of likely midterm election voters say they would support Reynolds, and 43% say they would support DeJear.",
    "Maggie Hassan, D-N.H., has reserved $13 million worth of fall airtime for her re-election bid, her campaign announced Friday in a memo shared first with NBC News.",
    "Ada Duque, we 45, is Colombian American and was recently at the Colombian consulate here registering to vote in her home country's presidential elections in May.",
    "Rep. Jake Auchincloss was asked about billionaire Len Blavatnik, one of the wealthiest people in the world, during a TV interview that aired Sunday.",
    "AS SEEN ON TV\n— “New Hampshire Sen. Maggie Hassan reserves $13 million for fall re-election bid in New Hampshire,” by Henry Gomez, NBC News: “Sen.",
    "Blavatnik has given money to Senate Majority Leader Chuck Schumer, House Minority Leader Kevin McCarthy, the NRCC and the DCCC, to name a few.",
    "His net worth is $32.4 billion, according to Forbes, and he made $7 billion when he sold his stake in the Russian oil company TNK-BP in 2013.",
    "Dr. Mahmood has served as a leader in Southern California for over twenty years as a physician and as a nonprofit and philanthropy leader.\"",
    "“If there's any evidence that there are people who are supporting the Kremlin right now, I of course would not take any contributions.",
    "Kim Reynolds holds an 8-point lead over Democratic challenger Deidre DeJear as Iowa’s race for governor begins to take shape.",
    "Another 5% are not sure and 1% say they would not support either candidate.”\nWant to receive this newsletter every weekday?",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "Blavatnik gave Auchincloss $5,800 in December, the maximum contribution to his campaign, as did his wife, Emily Blavatnik.",
    "The list includes vulnerable Democratic Reps. Elaine Luria (D-Va.), Tom Malinowski (D-N.J.) and Dan Kildee (D-Mich.).",
    "Spokesperson Matt Corridoni told Score that the congressman does not have a personal relationship with Blavatnik.",
    "You’ll also receive daily policy news and other intelligence you need to act on the day’s biggest stories.",
    "Questions about Blavatnik’s campaign contributions have sprung up periodically over the last few years.",
    "But one of the seven Democrats running for the seat impressed her enough that she decided to weigh in.",
    "The ad, which was first seen by The Hill, hits former Ohio GOP Chairwoman Jane Timken and author J.D.",
    "But he’s close with Viktor Vekselberg, a Russian oligarch who was sanctioned by the U.S. in 2018.",
    "“Should Democrats Return Len Blavatnik’s Campaign Donations?” The New Republic asked last week.",
    "The chamber approved the bill on a party lines vote with nearly all Republicans in support.",
    "Blavatnik was born in Ukraine and is a citizen of the United States and the United Kingdom.",
    "Ron DeSantis and would create a police force dedicated to pursuing election crimes.",
    "Email me at smurray@politico.com and follow me on Twitter at @stephanie_murr.",
    "Democrats lost the 2016 presidential election, and they barely won in 2020.",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "Brian Kemp has fractured the powerful family’s longtime loyalists.",
    "Part of their problem was declining support among White voters.",
    "The couple have given Auchincloss more than $22,000 since 2019.",
    "— Nora Keefe will serve as press secretary at the DSCC.",
    "But former U.S. Sen. David Perdue’s challenge to Gov.",
    "(He reiterated those claims in a recent memoir.)",
    "That is not the case,” Auchincloss said.",
    "Morning Score has a new look today.",
    "I’d love to hear what you think.",
    "Subscribe to POLITICO Pro.",
    "Good Monday morning!",
    "Vance."
  ]
}