{
  "id": 11093,
  "mediaId": 2699,
  "date": "2022-03-15",
  "headline": "Putin Killed Trump’s ‘America First’ Movement",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1647301326/220314-america-first-putin-tease-01_nsvm33",
  "link": "https://www.thedailybeast.com/putin-killed-trumps-america-first-movement?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Lewis",
  "authorUrl": "https://www.thedailybeast.com/author/matt-lewis",
  "termIds": [
    5575,
    4382,
    4503,
    4591,
    4905,
    2765,
    3578,
    4306
  ],
  "sentences": [
    "As an upstart GOP primary candidate, Trump said George W. Bush’s war of choice was the “worst single mistake ever made in the history of our country.” Trump took advantage of GOP voter disillusionment, then weaponized his distance from the Republican establishment to make the case for America to retreat from its global leadership role, and only consider “America First.” It was this message that helped Trump handily dispatch the “mainstream” GOP’s original consensus choice: Bush’s own brother Jeb.",
    "Marjorie Taylor Greene and Paul Gosar (who spoke at the white nationalist America First Political Action Conference, where the audience cheered Putin) and Madison Cawthorn (who called Zelensky a “thug”)—are ensconced in safe districts, and their national infamy hasn’t hurt them at the local level to date.",
    "Pat McCrory said in a video bashing his primary opponent, “Congressman Budd excused their killer.”\nBudd is now trying to dig himself out of this mess by explaining that Putin is “intelligent” but “evil.” This clarification reflects a changing political reality on the right, as it pertains to Putin.",
    "Would-be primary opponents might rationalize that although Trump remains personally popular in the GOP, the greater electorate is ready to move on from the unnecessary international drama that Trump caused on an almost daily basis as president.",
    "He won’t get much mileage out of attacking George W. Bush and the GOP establishment’s “forever wars.” And praise for Putin—and suggesting that he can be managed or (even more ridiculous) turned into an ally—simply won’t resonate.",
    "But following a recent Vance campaign event, attendees told NBC News that “images of death and destruction on TV” had helped form their opinions about whether or not the U.S. should support a besieged Ukraine.",
    "According to a Quinnipiac poll released last week, a majority of Americans—including 74 percent of Republicans—think Joe Biden “has not been tough enough” when it comes to punishing Russia for the invasion.",
    "Vance, a Republican candidate for the U.S. Senate in Ohio, last month tried to channel Trump’s nativist populism, saying that he didn’t want U.S. troops to fight and die over Putin’s invasion of Ukraine.",
    "But losing reelection, inciting a riot, and then finding himself on the wrong side of an emerging foreign policy shift hardly feels like the makings of a brilliant political comeback.",
    "“The invasion has already done huge damage to populists all over the world, who prior to the attack uniformly expressed sympathy for Putin,” wrote Francis Fukuyama.",
    "While it’s true that his campaign was already struggling, Vance has somewhat backtracked on his comments, a clear confirmation that he was not reading the room.",
    "Donald Trump’s election in 2016 was, in no insignificant part, a reaction to the disastrous 2003 invasion of Iraq and the subsequent years of quagmire.",
    "“That includes Matteo Salvini, Jair Bolsonaro, Éric Zemmour, Marine Le Pen, Viktor Orbán, and of course Donald Trump.”\nTrump can never be counted out.",
    "Regardless, one thing is certain: Russia’s invasion of Ukraine is one of the biggest international crises and upending of the world order in decades.",
    "Should most of Trump’s endorsed 2022 candidates lose—a possibility even before Russia crossed Ukraine’s border—it would only chum the waters more.",
    "), and the horrors of the war in Ukraine will end, with Putin’s troops leaving a country they had no business attacking in the first place.",
    "“Many were also unequivocally supportive of sanctions and the oil ban, expressing a need for empathy and generosity,” NBC News reported.",
    "Meanwhile, 64 percent of Americans—including 61 percent of Republicans—hold a favorable view of Ukrainian President Volodymyr Zelensky.",
    "As National Journal’s Josh Kraushaar colorfully put it, “Putin is less popular than syphilis.”\nThis feedback is not merely anecdotal.",
    "To paraphrase Mike Tyson, every “America First” isolationist has a plan—until they watch some kid get hit in the mouth on TV.",
    "“I gotta be honest with you, I don’t really care what happens to Ukraine,” Vance said, to make the point perfectly clear.",
    "But make no mistake, the events of the last few weeks have brought implications that transcend even American politics.",
    "A field of anti-Trump Republicans is already lining up to run against him in 2024, according to the Associated Press.",
    "But the Trumpian worldview that embraced Vladimir Putin and threatened to abandon NATO has, for now, been repudiated.",
    "Trump could still win in 2024, but the isolationist populism he deployed in 2016 isn’t as likely to land today.",
    "Perhaps MAGA will finally settle on a consistent message (is Biden too tough or too weak on Russia?",
    "Of course, the fickle court of public opinion could swing back Trump’s way between now and 2024.",
    "Of course, public opinion matters most to people facing competitive races on upcoming ballots.",
    "In North Carolina, Trump-backed candidate Rep. Ted Budd is on defense after praising Putin.",
    "Following Russia’s invasion of Ukraine, there’s no going back to “America First” as it was.",
    "This means that Trump can’t run again in 2024 by playing his greatest hits.",
    "Republicans with their ears closest to the ground already know this.",
    "That’s not to say the public is clamoring for a war with Russia.",
    "In political campaigns, we are always fighting the last war.",
    "“As Ukrainians bled and died,” former GOP Gov.",
    "But that is no longer the world we live in.",
    "Ohio’s primary is May 3, just weeks away.",
    "The most loathsome Republicans—Reps.",
    "This is not an absurd theory.",
    "That was the last war.",
    "The world is dynamic.",
    "Vance isn’t alone.",
    "That was in 2016.",
    "J.D."
  ]
}