{
  "id": 11709,
  "mediaId": 8358,
  "date": "2022-03-29",
  "headline": "Republican Senate hopefuls say they expect ugly primary race",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/03/web1_AP22088064402677.jpg",
  "link": "https://www.limaohio.com/news/502565/republican-senate-hopefuls-say-they-expect-ugly-primary-race",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2290,
    4839,
    5581,
    4306,
    4283,
    3054,
    259,
    1126,
    1489
  ],
  "sentences": [
    "Toward the end of Monday’s debate organized by the Ohio Debate Commission at Central State University in Wilberforce, moderator Karen Kasler of the Statehouse News Bureau asked the seven candidates on stage - Cleveland businessman Mike Gibbons, former Ohio Republican Party Chairman Jane Timken, Chagrin Falls state Sen. Matt Dolan, author and venture capitalist J.D.",
    "Everyone on this stage wants to go to Washington to look backwards.”\nWhen Statehouse News Bureau’s Karen Kasler, who moderated, fact-checked several false election claims, several candidates took issue with Kasler’s injection of facts into the debate while the crowd audibly booed, unhappy with the evidence.",
    "Though in a departure from the usual rhetoric that’s marked the Senate race, the candidates did show some distance between them when asked about Florida Sen. Rick Scott’s proposed Republican agenda, which includes tax increases on low- and middle-income Americans, among other policy priorities.",
    "There are some things I disagree with in there that I think we should change, but we need to determine what this is all about.”\nVance said he agreed with much of the proposal but singled out the proposed tax increases as a nonstarter.",
    "“I think some of the accusations have been kind of ridiculous,” said Vance, who has been targeted for his deep history of criticizing Trump, including saying he would consider voting for Democrat Hillary Clinton in the 2016 election.",
    "By Seth A. Richardson - cleveland.com (TNS)\nWILBERFORCE — Given a chance to address the ugly tenor of the Republican primary for U.S. Senate, the candidates on Monday offered little reflection on the state of the race.",
    "Vance, former Treasurer Josh Mandel, Columbus-area businessman Mark Pukita and Delaware County businessman Neil Patel - if the ugly state of the race was appropriate for the race to succeed retiring GOP Sen.",
    "The Republican Senate contest has largely been defined by the candidates trying to outdo one another via controversial statements, with policy mostly taking a backseat in their everyday campaigning.",
    "His lack of an endorsement has led to a mad scramble by most everyone eager to show fealty to him and get a welcome boost among voters in a divided primary who still support the former president.",
    "While Monday’s forum wasn’t defined by sideshow antics, it was the second time in as many weeks that the leading candidates met on the debate stage, this time joined by Pukita and Patel.",
    "Why would we increase taxes on the middle class, especially when Apple, Google, Amazon and Facebook pay a lower tax rate than any middle-class American in this room or in this country.",
    "The lone outlier was, at times, Dolan, who has fashioned himself as not tethered to Republican Party dogma despite being the only candidate to currently hold elected office.",
    "Instead, they’ve focused on convincing voters they are the candidate most closely aligned with former President Donald Trump, who has not endorsed in the race.",
    "That includes some circus-level antics, such as a debate two weeks ago that devolved into chest-bumping and epithets thrown on stage by Gibbons and Mandel.",
    "Much of the rest of the debate was a rehash of familiar talking points, such as support for a wall along the United States-Mexico border.",
    "“Absolutely, I would not support Rick Scott’s agenda, especially because it raises taxes on the middle class,” Timken said.",
    "Every candidate on stage - save for Dolan - repeated the liethat the 2020 election was stolen from Trump.",
    "“Let me be very clear here: Joe Biden is the legitimate president of the United States,” Dolan said.",
    "While Trump hasn’t endorsed anyone, he did come out against Dolan after the latter’s announcement.",
    "“This is a great first draft in trying to set some things we all believe in,” Gibbons said.",
    "“In particular, he’s advocating for middle-class tax increases,” Vance said.",
    "“And the people that don’t believe them probably shouldn’t be Republicans.",
    "“My agenda is the America First agenda.”\nMandel said he had not read it.",
    "It’s ridiculous.”\nTimken also voiced displeasure with Scott’s proposal.",
    "“I want to point out it did not become a slugfest,” Gibbons said.",
    "As usual, Trump occupied much of the time despite not attending.",
    "Gibbons and Dolan said they generally agreed with Scott’s plan.",
    "Style was a bigger differentiator than most proposals.",
    "“I think that’s a joke for the Republican Party.",
    "“My problem is that he’s a failed president.",
    "The answer, generally, from the candidates?",
    "That’s politics.",
    "Rob Portman.",
    "Previous"
  ]
}