{
  "id": 11961,
  "mediaId": 8496,
  "date": "2022-03-21",
  "headline": "No fireworks this time as Ohio's GOP Senate candidates hold debate",
  "image": "https://media.wkyc.com/assets/WKYC/images/dac1fdd2-2974-4a87-9dab-701b7850e7fd/dac1fdd2-2974-4a87-9dab-701b7850e7fd_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/politics/elections/no-fireworks-ohio-gop-senate-candidates-hold-debate/95-5131034a-e065-4673-8203-8da9f2fda045",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "I’m sick of Joe Biden focusing on the border of a country I don’t care about while he lets the border of his own country become a total war zone.”\nVance knows he stands alone on his stance and added on Monday, \"What Vladimir Putin did was wrong invading a sovereign country on its border but we have our own issues.\"",
    "Vance received national attention shortly after the invasion by saying in a podcast interview, “I gotta be honest with you, I don’t really care what happens to Ukraine one way or another.",
    "Timken blamed the Biden administration for not acting sooner and added, \"We should have been putting sanctions on Russia long before the invasion.\"",
    "Unlike last Friday's heated forum, the candidates kept their cool as they debated topics ranging from gas prices, to Russia's invasion of Ukraine.",
    "CLEVELAND — On Monday evening, Ohio's candidates seeking the Republican nod for the U.S. Senate got together in Cleveland for a debate.",
    "Tensions between Josh Mandel and Mike Gibbons got so heated, that the two had to be pulled apart while audience members were booing.",
    "On Monday envening, the five candidates debated topics ranging from gas prices, to former President Trump.",
    "This came on the heels of fireworks that happened on Friday during a forum involving the GOP candidates.",
    "There are currently five GOP candidates seeking to fill Portman's spot: Gibbons, Mandel, Timken, J.D.",
    "\"We must make sure Ukraine has the humanitarian aid and military aid they need to defend themselves.\"",
    "Gibbons added, \"I don't care if there is a transgender category amongst other transgenders.\"",
    "I'm a Marine and I will never back down from a fight,\" replied the former Ohio Treasurer.",
    "The moderator's first question to Mandel was why he got so heated during Friday's forum.",
    "A transgender athlete competing with women in a NCAA swimming competition.",
    "Jane Timken jumped in when she got the chance to address the spat.",
    "The field for the U.S. Senate became wide open when longtime Sen.",
    "Most of the time was spent on the Russian invasion of Ukraine.",
    "You can watch the debate in the player below:\nRelated Stories:",
    "\"I would like to address the embarrassment of Friday evening.",
    "Josh Mandel and Mike Gibbons acted like children,\" she said.",
    "\"My point was Josh has never been in the private sector.",
    "Gibbons was asked the same question about the incident.",
    "Rob Portman decided not to seek re-election this year.",
    "The military is not the private sector,\" he answered.",
    "Boys are boys and girls are girls,\" Mandel said.",
    "Dolan strongly disagreed with his competitor.",
    "The candidates also talked current events.",
    "\"Let's face it there are only two genders.",
    "Fast forward to Monday night in Cleveland.",
    "It's about women's rights,\" said Timken.",
    "\"This is about fundamental fairness.",
    "They were in all agreement.",
    "Vance, and Matt Dolan.",
    "\"I'm a fighter.",
    "J.D."
  ]
}