{
  "id": 12416,
  "mediaId": 8291,
  "date": "2022-03-29",
  "headline": "Candidates say Senate race is fight for US",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/news/local-news/2022/03/candidates-say-senate-race-is-fight-for-us/",
  "mediaOutlet": "content.tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "NEWSLETTER\nToday's breaking news and more in your inbox\nLocal News\nOn the record: Lordstown\nWHAT: Board of Education meeting April 20 PRESENT: Cheryl Kistler, Jackie Woodward, William Catlin, Niki ...\nRobotics teams end season with awards\nWARREN — FIRST Robotics teams from Warren G. Harding High School and Champion High School finished the season at ...\nVeterans group seeks parade participants\nWARREN — The Trumbull County Veterans Services Commission is seeking participants for the 2022 Trumbull County ...\nCortland man guilty in counterfeiting case\nWARREN — A Cortland man Monday pleaded guilty to a charge of attempting counterfeiting connected to an October ...\nWarren man gets 2 years in robbery\nWARREN — A Warren man received a two-year prison sentence Monday for his part in a May 30, 2020, robbery at ...\nUdderly Smooth president, music ed grad to speak at YSU",
    "She said Democrats will turn the U.S. into “a ditch.”\nFormer Ohio Treasurer Josh Mandel said, “Right now, what we need in Washington is to defeat the secular left, to defeat the radical left, to defeat Biden and (Senate President Chuck) Schumer and (House Speaker Nancy) Pelosi and save this country for our kids and grandkids.”\nGenerally, though, the candidates did more attacking of the moderator than of each other Monday — oftentimes, after a near physical altercation at one debate, concurring on or complimenting one another’s answers.",
    "“My problem is he’s a failed president.”\nFormer Ohio Republican chair Jane Timken said her work on the ground in Ohio to elect Trump — who won the state by more than 8 percentage points — included allegedly catching a Democrat ballot harvesting, a case she referred to the state attorney general.",
    "WILBERFORCE — All but one Republican seeking an open U.S. Senate seat in Ohio held fast to the disproven narrative Monday that the 2020 presidential election was either stolen from Donald Trump or fraught with irregularities, fraud or other problems.",
    "Ohio Public Radio’s Karen Kasler pushed back during the 90-minute event, reminding audience members many of the claims they were hearing have been fact checked and found to be inaccurate.",
    "Candidate Matt Dolan, a Cleveland-area state senator, was the only one of seven candidates on the stage at Central State University not to embrace the allegations.",
    "It was the contentious, Trump-focused contest’s first debate hosted by a mainstream journalist, who was tapped by the nonpartisan Ohio Debate Commission.",
    "They described the race as a fight to preserve American values that they believe are slipping, to protect U.S. security and to revive the economy.",
    "“The Democrats are threatening the future of our country and I’m going to fight to make sure that we still have a country,” Timken said.",
    "The Ohio elections chief identified 62 potential fraud cases from 2020 to authorities, a tiny fraction of nearly 6 million votes cast.",
    "Vance cited Facebook CEO Mark Zuckerberg’s large donations to states for use by county boards of elections among his 2020 concerns.",
    "Rob Portman announced his retirement last year, expressing dismay over the deep partisanship and dysfunction in American politics.",
    "“Let me be very clear: Joe Biden is the legitimate president of the United States,” he said.",
    "Author and venture capitalist J.D.",
    "Incumbent U.S. Sen."
  ]
}