{
  "id": 15669,
  "mediaId": 8363,
  "date": "2022-03-08",
  "headline": "State Sen. Matt Dolan makes case to replace Rob Portman at Republican luncheon",
  "image": "https://www.gannett-cdn.com/presto/2022/03/07/PMAN/c9ab8f6b-8e77-4f20-9f0a-5ad83c3e9f96-Dolan_1.jpg?crop=4343,2443,x0,y199&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/03/08/richland-county-republicans-host-candidate-u-s-senate-matt-dolan/6972482001/",
  "mediaOutlet": "mansfieldnewsjournal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Caudill",
  "authorUrl": "https://www.mansfieldnewsjournal.com/staff/4395513002/mark-caudill/",
  "termIds": [
    0
  ],
  "sentences": [
    "His private sector experience includes being a partner at the law firm in his hometown of Chardon, as well as vice president of 7th Avenue Management and part of the ownership group of the Cleveland Guardians.",
    "Other candidates include businessman Mike Gibbons, who addressed the local Republicans last month, former Treasurer Josh Mandel, former Ohio Republican Party leader Jane Timken and author J.D.",
    "In response to a question from state Rep. Marilyn John, Dolan said he supports sanctions against Putin and Russia but does not believe they have been strong enough or fast enough.",
    "Dolan has been an attorney for more than 30 years\nHis public service career began as assistant state attorney general and later as chief assistant prosecutor for Geauga County.",
    "Asked about possible military intervention by the United States, Dolan said he does not support \"boots on the ground\" in Ukraine \"as ugly as it is, as tragic as it is.\"",
    "Unlike many members of his party, including some of his opponents, Dolan does not want to decertify the 2020 election that saw Biden knock off Donald Trump.",
    "Candidate asserts that 'what happens in Washington matters'\nMatt Dolan says Republicans must share some of the blame for the country's current situation.",
    "Dolan addresses war in Ukraine\nThe candidate also has spoken out publicly against Russian leader Vladamir Putin for invading neighboring Ukraine.",
    "While he said he would not get rid of the Department of Education, Dolan suggested local school boards should be in charge of curriculum.",
    "Unlike most Republicans, Dolan said he was \"OK\" with the expansion of Medicaid, which he said was working before the COVID-19 pandemic.",
    "\"When Republican ideas are put into practice, we are better off,\" he said Monday during a local Republican Party luncheon at DLX.",
    "Of his years in public office, he said he went to Columbus \"with a purpose,\" to make sure that conservative ideas were executed.",
    "Candidate answers audience questions candidly\nAfter his speech, Dolan took a number of questions from the audience.",
    "\"What happens in Washington matters, and I'd rather have it be a strength than a weakness,\" Dolan said.",
    "Dolan's most recent budget was called \"the most conservative budget in Ohio legislative history.\"",
    "\"I'm the one person who understands execution of our ideas make our exceptional nation,\" he said.",
    "Dolan is running for U.S. Senate to replace Rob Portman, who chose not to seek reelection.",
    "\"You cannot require a recipient of welfare benefits to look for work now,\" Dolan said.",
    "Dolan said he takes credit for any of his failures instead of blaming others.",
    "\"When you say that, you are stomping all over the Constitution,\" Dolan said.",
    "\"That's the mess we get when we as Republicans do not execute,\" Dolan said.",
    "When we do not execute, we get Joe Biden, Nancy Pelosi and Chuck Schumer.\"",
    "He revisited the topic on a question from County Commissioner Tony Vero.",
    "\"If we are running in 2022 fighting 2020, we are going to lose in 2024.\"",
    "He said 78% of the overdoses in Ohio last year were caused by fentanyl.",
    "He said he demands of himself \"honesty, consistency and transparency.\"",
    "He spent the early portion of Monday's speech attacking Democrats.",
    "\"I'm the only one (candidate) who can point to that,\" Dolan said.",
    "He criticized Biden for making changes to government assistance.",
    "Prior to that, he was a member of the Ohio House from 2005-10.",
    "Having an open border has cost us in Ohio to be less safe.\"",
    "His father, Larry, is the principal owner of the Guardians.",
    "\"Our standing in the world is stronger, and we feel safe.",
    "\"Not one of my opponents spoke out against him,\" he said.",
    "He prefers to help the Ukrainians with humanitarian aid.",
    "He serves as the finance committee chair for the Senate.",
    "\"We haven't always executed on those Republican ideas.",
    "mcaudill@gannett.com\n419-521-7219\nTwitter: @MNJCaudill",
    "\"It (welfare) is not designed to be a way of life.\"",
    "\"We have a party that does not support the police.",
    "Dolan has served in the state Senate since 2017.",
    "\"America needs to be much stronger,\" Dolan said.",
    "\"This election is about tomorrow,\" Dolan said.",
    "\"I grew up in a family of faith,\" Dolan said.",
    "Dolan called Putin's actions \"disgusting.\"",
    "\"You would federalize the election.\"",
    "\"I grew up in a family of hard work.",
    "I grew up in a family of service.\"",
    "Vance."
  ]
}