{
  "id": 15741,
  "mediaId": 8363,
  "date": "2022-03-11",
  "headline": "'We're in for a real fight': J.D. Vance labels himself as an outsider in race for Portman's seat",
  "image": "https://www.gannett-cdn.com/presto/2022/03/10/PMAN/1fd31e20-d516-4a78-af91-06fe31e7987e-_DSC2663.JPG?crop=4511,2537,x0,y183&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/03/11/j-d-vance-mansfield-labels-himself-outsider-republican-race-portmans-senate-seat-hillbilly-elegy/9441654002/",
  "mediaOutlet": "mansfieldnewsjournal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zach Tuggle",
  "authorUrl": "https://www.mansfieldnewsjournal.com/staff/4395274002/zach-tuggle/",
  "termIds": [
    0
  ],
  "sentences": [
    "Loss of local manufacturing\nVance, author of the best-selling book \"Hillbilly Elegy\" who graduated from Ohio State and Yale Law School, told the audience that his hometown of Middletown is similar to Mansfield in that their economic decline over the years came because they \"got neglected by our leaders.\"",
    "Staying out of the war in Ukraine\nTaking care of the nation's border with Mexico is, to Vance, a more important military operation than becoming involved with what's happening in Ukraine, which he said was of little interest to the U.S.",
    "The U.S. Marine veteran has labeled himself as a \"conservative outsider\" who wants to focus on issues such as securing the nation's southern border, combating the use of opioids and strengthening America's economy, among others.",
    "He acknowledged to the group of about 30 inside Saint Luke's Lutheran Church on Marion Road that winning the Republican primary this spring would not be easy given the number of well-known contenders.",
    "Vowed not to become corrupt\nVance told the audience that a lot of people get into politics and then become corrupted when they start spending time around the lobbyists in Washington, DC.",
    "Opioid crisis and the southern border\nThe opioid pandemic was at the top of Vance's healthcare priorities, and he said more needs done to keep those drugs from entering the country.",
    "Vance told voters Wednesday that \"Democrats are evil and Republicans are stupid\" when he campaigned in Mansfield for the U.S. Senate seat to be vacated by Rob Portman.",
    "He wants to set term limits for congress, and he wants to write legislation that will make it easier to fire civil servants who are not doing their jobs.",
    "Doing so would allow the military to track them down and take them out of business, he said, similar to how Osama bin Laden was eliminated in 2011.",
    "He said the middle class has suffered because household products, electronics and even pharmaceuticals are now all produced in foreign countries.",
    "He said he hopes, though, that doesn't happen while Biden is in the White House, because he thinks Biden would be a very bad Commander in Chief.",
    "He said that any further aggression by Russia, though, especially to ally NATO nations, would be cause for U.S. involvement in the region.",
    "He said politicians quickly amass a net worth far beyond what their salaries would have earned them, a clear sign they've been paid off.",
    "He said it's fine to feel bad for Ukrainians and to hope the best for them, but there are more pressing issues at hand for Americans.",
    "Those negligent employees are costing veterans their lives, and he wants the government to hire people who would do a better job.",
    "He wants to challenge leadership in both parties, and he wants to ban members of congress from owning any publicly traded stocks.",
    "Vance told the crowd he's going to Washington to make omelets, so he's going to have to break some eggs in the process.",
    "He said it's one of the few areas in which he thinks the federal government needs to become more involved.",
    "\"I don't think it's right that we have 100,000 kids who are orphaned because we have this drug problem.\"",
    "He said the conflict has allowed President Joe Biden to \"look tough\" without actually doing anything.",
    "The border wall, Vance said, needs to be finished to help keep those drugs out of the United States.",
    "\"The leading cause of death in people 18 to 45 years old is from overdoses right now,\" Vance said.",
    "Aside from prayer, he said he doesn't think there's much the United States could do for Ukraine.",
    "\"We could actually declare the Mexican drug cartels a terrorist organization,\" Vance said.",
    "\"As far as I can tell, he doesn't know where he is at any given moment,\" Vance said.",
    "\"The one thing that can save this guy's presidency is a war,\" Vance told voters.",
    "\"There's a lot of money and there's a lot of influence there,\" Vance said.",
    "\"The one thing we could do is go to war with the Russians,\" Vance said.",
    "Although he's a Republican, he said both parties share in that blame.",
    "Republican Senate candidate brings his 'No BS Tour' to Mansfield\nJ.D.",
    "He said 90% of VA employees are great people, but 10% are \"scumbags.\"",
    "One of his targets would be the U.S. Department of Veterans Affairs.",
    "\"We are no longer a country that makes our own stuff,\" Vance said.",
    "\"Three weeks now I've prayed for Ukraine at church,\" Vance said.",
    "ztuggle@gannett.com\n419-564-3508\nTwitter: @zachtuggle",
    "\"I think it's a fight for the soul of the party.\"",
    "\"I think that would be a terrible mistake.\"",
    "\"That's where you have to draw a red line.\"",
    "\"They don't answer the phone,\" Vance said.",
    "\"We're in for a real fight,\" Vance said.",
    "\"That's when it changes,\" Vance said.",
    "\"They leave you on hold for hours.\"",
    "He vowed not to do the same.",
    "\"The deep state is real.\"",
    "\"We can and we should.\""
  ]
}