{
  "id": 1679,
  "mediaId": 2537,
  "date": "2022-02-18",
  "headline": "Opinion: ATF's database is a backdoor way of disarming citizens",
  "image": "https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2022/02/10/USATODAY/usatsports/imageForEntry22-deH.jpg?width=1365&height=768&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/02/18/opinion-atfs-database-backdoor-way-disarming-citizens/6799454001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "J.D. Vance",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The pistol, a powerful firearm (one of the most powerful handguns ever made), is a bit of an inside joke in my family: toward the end of her life, my grandmother was in pretty frail condition and probably couldn’t even hold the gun much less shoot it.",
    "According to Texas Congressman Michael Cloud, the ATF’s new efforts \"means that 100 percent of all lawful commercial firearm transfers would eventually end up in an ATF computer system, thereby creating a permanent database.\"",
    "Whistleblowers first sounded the alarm about the ATF database back in November, but subsequent investigations by gun rights groups and pro-Second Amendment lawmakers have revealed the extent of the ATF’s data collection.",
    "So I was especially curious to learn that the entirely legal and constitutionally transaction I engaged in may very well put me on a Bureau of Alcohol Tobacco and Firearms (ATF) database of gun transactions.",
    "One of the main drivers of criminal activity on our southern border is Mexican drug cartels, many of whom are often armed by weapons illegally trafficked along that very same border.",
    "Opinion contributor\nA few weeks ago, my father and I visited a gun range outside of Columbus to shoot targets with my favorite pistol, a .44 magnum once owned by my grandmother.",
    "I want an ATF that prevents Mexican drug cartels from getting access to the most dangerous weapons in the world, while protecting my rights and those of my fellow citizens.",
    "Federal law explicitly prevents the creation of a federal firearms database, for the simple reason that such a database is a direct affront to the Second Amendment.",
    "Unfortunately, drugs aren’t the only things coming across: many communities, even here in Ohio, have an increase of sex trafficking victims from Central America.",
    "As we’ve seen in other nations, specifically Australia and multiple countries in Europe, a firearms database is a backdoor way of disarming the citizenry.",
    "Some may wonder who will do the important work of ensuring criminal gangs and international terrorist organizations aren’t equipped with powerful weapons.",
    "Vance, a Cincinnati resident, is a Republican candidate for U.S. Senate in Ohio, investor and author of the best-selling memoir, \"Hillbilly Elegy.\"",
    "When we strip funding from a bureaucracy that has failed to do its job, and we can redirect resources to groups that are actually keeping us safe.",
    "If the last two years has taught us anything, it should caution against giving broad, unconstitutional powers to unelected bureaucrats.",
    "These criminal gangs are terrorist organizations, and their success means more death and misery for people on both sides of the border.",
    "I gave him my driver’s license, answered some questions about my legal history, and I assume the clerk ran a standard background check.",
    "Yet the government entity empowered to disarm these thugs is instead using precious resources to spy on American citizens?",
    "Using various legal loopholes, the ATF is acquiring tens of millions of transaction records on American citizens.",
    "Yes, the ATF could serve an important and valuable function, all while safeguarding the rights of citizens.",
    "The Biden administration's immigration policies have driven cartel profits through the roof.",
    "By some metrics, deadly fentanyl trafficking has increased fourfold since Biden took office.",
    "It’s an important point, but this concern is actually well served by abolishing the ATF.",
    "Importantly, the ATF serves a very important public safety function in our country.",
    "We have real problems, and real criminals, with actually illegal firearms.",
    "Aside from being illegal, it’s a preposterous focus for our government.",
    "The ATF should focus on those instead of law-abiding Americans.",
    "The ATF is doing the opposite, so it’s time to get rid of it.",
    "But it was still her favorite, and so it is mine, too.",
    "Yet this is exactly what the ATF’s new database does.",
    "The ATF’s focus suggests radical change is needed.",
    "This database creates a few obvious problems.",
    "I did everything properly, as did the seller.",
    "But it doesn’t, so it’s time to start anew.",
    "While there, I purchased a new rifle.",
    "The first is that it’s illegal.",
    "J.D."
  ]
}