{
  "id": 17758,
  "mediaId": 8288,
  "date": "2022-03-03",
  "headline": "Why Are Some Americans Rooting for Putin? An FAQ",
  "image": "",
  "link": "https://www.clevescene.com/cleveland/americans-rooting-for-putin-an-faq/Content?oid=38492242",
  "mediaOutlet": "clevescene.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pete Kotz",
  "authorUrl": "https://www.clevescene.com/author/pete-kotz",
  "termIds": [
    0
  ],
  "sentences": [
    "Only recently have we learned that “dictator” is just another word for “strong, decisive leader.” Donald Trump calls Vladimir Putin “savvy” and a “genius.” He won’t try to cancel you or claim you’re a racist, adds Kremlin fanboy Tucker Carlson.",
    "He’s a leader of “enormous weakness,” notes former Secretary of State Mike Pompeo, making for “an America on its back, an America that apologizes.”\nAnd as any woman anywhere will tell you, no one likes a guy who apologizes.",
    "“I’m sick of being told that we have to care more about people 6,000 miles away than we do people like my mom and my grandparents,” says Millionaire Venture Capitalist/Voice of the Working Man J.D.",
    "Complain about the cops accidentally shooting your son – or pretty much anything else – and you’ll find yourself flopping like a fish from a lethal dose of poison.",
    "He’s spent a lifetime battling subpoenas, dodging lawsuits from business associates he’s stiffed, evading depositions from women he molested.",
    "If you’re already worried about, say, fentanyl crossing our southern border, you can’t possibly worry about something else at the same time.",
    "If Covid taught us anything, it’s that caring for others is way too hard, and may even involve briefly wearing a mask at the liquor store.",
    "Once they’re born, they’re just another moocher with their hand out, trying to sell you candy to raise money for the school band.",
    "Then we discovered that our greatest president could lose by 7 million votes and not even be able to declare himself the winner.",
    "Before America was great again, we used to care when ruthless dictators invaded small, defenseless countries.",
    "Putin knows that if he invaded Ukraine while Trump was president, he’d be tied up in litigation for years.",
    "As we also learned from the pandemic, people who do their own research suck at doing their own research.",
    "And we believe everyone deserves access to accurate independent coverage of their community and state.",
    "Or how he shouted encouragement from the rear as brave patriots tried to overthrow our government.",
    "So we now open the floor to your questions:\nI always thought democracy was kind of our thing.",
    "If Marcy from work declines your invite to see a Def Leppard cover band, it’s Biden’s fault.",
    "Help us keep this coverage going with a one-time donation or an ongoing membership pledge.",
    "But just because there’s a shortage elsewhere doesn’t mean we shouldn’t jack prices here.",
    "America has been a net-exporter of oil for years, meaning we produce more than we need.",
    "None of this would have happened if Donald Trump was still president, right?",
    "He doesn’t manufacture fake pandemics or teach your children about slavery.",
    "Did you know the average Ruskie only makes the equivalent of $263 a month?",
    "If you expect him to have your back in a dark alley, you’re in deep shit.",
    "But Trump is the greatest paperwork fighter this country has ever known.",
    "Or how he cowered in a bunker during a protest near the White House.",
    "Join the Cleveland Scene Press Club\nLocal journalism is information.",
    "And if you have, how do you know that map wasn’t made by Bill Gates?",
    "That means nearly all the money flows up to the more deserving few.",
    "Mexicans are showoffs, always taunting us with how hard they work.",
    "Mitch McConnell would give his pancreas for an economy like that.",
    "In short: We should have never overthrown the tyrant King George.",
    "Or at least until Trump’s lawyers realized they’d never get paid.",
    "So what you’re saying is high gas prices are Joe Biden’s fault?",
    "We’ll concede that Trump isn’t much for face-to-face battle.",
    "Yet it only hurts the economy if we blame Exxon or Chevron.",
    "But wouldn’t it suck if Putin was the dictator of America?",
    "If Chipotle runs out of guacamole, it’s Biden’s fault.",
    "Especially after 236 years of thinking like morons.",
    "That’s how a real leader deals with the woke mob.",
    "But doesn’t Jesus teach us to care about others?",
    "We don’t even know if Ukraine is a real country.",
    "But aren’t we supposed to be against invasions?",
    "Revised conclusion: Democracy blows chunks.",
    "Everyone knows we only care about fetuses.",
    "Like when the Mexicans invade our border?",
    "As for those poor, defenseless countries?",
    "We understand this is a lot to digest.",
    "So really everything is Biden’s fault?",
    "What about the children being killed?",
    "That was a waste of time, wasn’t it?",
    "It’s called smart business, people.",
    "Recall the whole bone spurs thing.",
    "Have you ever seen it on a map?",
    "Russia’s also a police state.",
    "That’s clearly a misprint.",
    "I mean, the friggin’ band?",
    "Nobody will be the wiser.",
    "Better to blame Biden.",
    "What’s wrong with you?",
    "Where’s the research?",
    "Information is power.",
    "Are you kidding me?",
    "That’s different.",
    "Even Ukrainians?",
    "Absolutely not.",
    "Past tense.",
    "What gives?",
    "Puleeease!",
    "Who else?",
    "Exactly.",
    "It was.",
    "Vance.",
    "Yes."
  ]
}