{
  "id": 2526,
  "mediaId": 2510,
  "date": "2022-02-08",
  "headline": "Gay Billionaire Peter Thiel Exits Meta Board to Fund Trump Candidates",
  "image": "https://www.advocate.com/sites/default/files/edited_gettyimages-1056133328.jpg",
  "link": "https://www.advocate.com/business/2022/2/08/gay-billionaire-and-republican-donor-peter-thiel-leave-meta-board",
  "mediaOutlet": "Advocate",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Cooper",
  "authorUrl": "https://www.advocate.com/authors/alex-cooper",
  "termIds": [
    2765,
    3706,
    4306,
    3005,
    5660,
    778,
    1015,
    1489,
    5949
  ],
  "sentences": [
    "A person familiar with Thiel’s plans told the Times that Thiel understands that the midterms will be significant for the future of the country and said that he is backing candidates who have supported former President Donald Trump’s agenda.",
    "“Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions.”\n“It has been a privilege to work with one of the great entrepreneurs of our time.",
    "“Peter has been a valuable member of our board and I’m deeply grateful for everything he’s done for our company,” Mark Zuckerberg, Meta’s CEO, said in the release.",
    "He’s also supporting a few people running in Republican primaries against representatives who voted for impeaching Trump after the January 6 insurrection.",
    "Thiel helped steer Facebook in its early years as a close associate of Zuckerberg’s, especially as it applied to free speech on Meta’s platforms.",
    "However, Thiel secretly funded a legal battle against the media site Gawker, leading that company to bankruptcy after the site tried to out him.",
    "Thiel, who cofounded PayPal, served on the board of directors for the parent company of Facebook, recently renamed Meta, since 2005.",
    "Out tech billionaire Peter Thiel is planning to exit Meta’s board of directors, the company announced in a press release Monday.",
    "Thiel invested both in a facial recognition startup and a cyberweapons firm, both going against Meta’s platforms in some way.",
    "Last year, he gave $10 million to Blake Masters, who is running for U.S. Senate in Arizona, and J.D.",
    "Thiel, 54, is seeking to influence the upcoming midterm elections, The New York Times reports.",
    "Recent investments have also clashed with his seat on the board, according to the Times.",
    "His talents will serve Meta well as he leads the company into a new era,” Thiel said.",
    "Zuckerberg and Thiel met 18 years ago, and Thiel invested $500,000 into Facebook.",
    "Mark Zuckerberg's intelligence, energy, and conscientiousness are tremendous.",
    "Forbes estimates Thiel has a net worth of $2.6 billion.",
    "Meta has now lost its board’s conservative viewpoint.",
    "The company did not announce who would replace Thiel.",
    "Vance, who is running for U.S. Senate in Ohio."
  ]
}