{
  "id": 2752,
  "mediaId": 2664,
  "date": "2022-01-28",
  "headline": "Russia-Ukraine standoff is 'becoming a trial of strength' as it splits the GOP: conservative strategist",
  "image": "https://www.rawstory.com/media-library/sick-distracted-and-now-under-cyberattack-ex-trump-security-adviser-sounds-alarm-on-ongoing-russian-hack-of-us-government.jpg?id=24819419&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/republicans-putin-ukraine/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1809,
    4524,
    4591,
    4693,
    1126,
    6569,
    6672
  ],
  "sentences": [
    "Tucker Carlson’s influence is felt across right-wing social media, where it is amplified by figures such as Steve Bannon, Mike Cernovich, Glenn Greenwald, and Mollie Hemingway,\" he wrote in The Atlantic.",
    "\"But broadly, Republican elected officials and the think tanks that advise them are staunchly pro-Ukraine; conservative talkers (especially on TV and social media) are varying degrees of anti-Ukraine.",
    "\"Night after night, the host of the top-rated show on Fox News repeats Vladimir Putin’s talking points justifying aggression against Ukraine and opposing U.S. aid to that threatened sovereign country.",
    "He noted Senate Minority Leader Mitch McConnell (R-KY) has backed Biden's approach while House GOP Leader Kevin McCarthy (R-CA) has urged a stronger policy against Russia.",
    "Vladimir Putin's potential invasion of Ukraine is splitting the conservative movement, former George W. Bush strategist David Frum explained on Friday.",
    "Over the past half-dozen years, such intra-conservative disputes have usually ended in abject defeat for Republican elected officials,\" he wrote.",
    "Russia-Ukraine is becoming a trial of strength, not only between Putin and NATO, but between different parts of the conservative world.",
    "A new poll by the Pew Research Center finds that large majorities of Americans view Russia as an enemy or a competitor.",
    "\"Meanwhile, day after day, Republican officeholders in the House and the Senate urge more support for Ukraine.\"",
    "\"Yet some signs show that with Ukraine and Putin, the conservative entertainment complex may have overstepped.",
    "Vance in Ohio, Blake Masters in Arizona, and Eric Greitens in Missouri have sided with Carlson and Putin.",
    "Large majorities regard the Russian buildup against Ukraine as a threat to U.S.",
    "But GOP Senate candidates such as J.D.",
    "interests.\""
  ]
}