{
  "id": 2929,
  "mediaId": 8313,
  "date": "2022-02-03",
  "headline": "After meeting with Trump, Bernie Moreno drops out of crowded GOP primary for U.S. Senate",
  "image": "https://www.gannett-cdn.com/presto/2021/10/16/PCIN/8ed8a804-26e1-45b5-bea8-c6d67d649e88-10162021_GOPPancakes_MV_017.JPG?crop=3499,1969,x0,y178&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/02/03/ohio-senate-race-bernie-moreno-drops-out-after-trump-meeting/6657995001/",
  "mediaOutlet": "enquirer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"To whomever wins the Senate race, I hope and pray they take the actions needed to stop illegal immigration, bring our manufacturing base back to America, and shrink the size and scale of the Federal Government,\" he said.",
    "Luxury car dealer and blockchain executive Bernie Moreno dropped out of Ohio's crowded U.S. Senate race Thursday after he met with former President Donald Trump to discuss the state of play in the Buckeye State.",
    "Haley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Internal polls released by multiple campaigns in recent months show Mandel at the top of the heap, but they also indicate many voters are still undecided about their preferred candidate.",
    "He loaned his campaign $3.75 million last year and kicked off a $4 million TV ad spree in December, but his contributions began to decrease after starting strong over the summer.",
    "Moreno is the first to drop out of the GOP primary, and his departure came one day after he filed candidate paperwork with the secretary of state's office.",
    "“I asked for a private meeting with President Trump this afternoon to discuss the state of the Ohio Senate race,\" Moreno said in a statement Thursday.",
    "After talking to President Trump we both agreed this race has too many Trump candidates and could cost the MAGA movement a conservative seat.\"",
    "Trump commended Moreno's decision to exit the race in a statement: \"He has done much for Ohio and loves his State and our great MAGA Movement.",
    "Also running for the nomination are former state treasurer Josh Mandel, former Ohio GOP chair Jane Timken, \"Hillbilly Elegy\" author J.D.",
    "The meeting with Trump underscores the influence he has over the race as Republicans clamor for his endorsement in the May primary.",
    "Trump's endorsement would help set the candidates apart, although it's unclear if or when he'll wade into the race.",
    "Moreno said he plans to return to the private sector and will support whomever Trump backs.",
    "His decision will help ensure the MAGA Ticket wins BIG, as it is all over the Country.\"",
    "Moreno, like several others in the race, used his personal wealth to boost his bid.",
    "\"It’s not too much for Americans to expect their government work for them.\"",
    "Moreno was among the leading GOP candidates angling to replace Sen.",
    "Rob Portman and had invested millions of dollars in his campaign.",
    "Vance, state Sen. Matt Dolan and investment banker Mike Gibbons.",
    "Business leaders recognize patterns before they happen.",
    "\"I am a businessman, not a politician."
  ]
}