{
  "id": 3459,
  "mediaId": 2627,
  "date": "2022-02-01",
  "headline": "Another GOP candidate struggles to talk about pregnancies from rape",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_05/3532569/220201-garrett-soldano-mb-1242.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/another-gop-candidate-struggles-talk-about-pregnancies-rape-n1288342",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    0
  ],
  "sentences": [
    "After so many Republican candidates have struggled with questions about pregnancies resulting from rape, it's tempting to assume that all GOP candidates, no matter how vehement their opposition to reproductive rights, would prepare a compelling answer.",
    "As the dust settled on the 2012 election cycle, Kellyanne Conway — at the time, a prominent Republican pollster, years before she joined Donald Trump's political operation — was brought in to advise House GOP candidates and officeholders on the issue.",
    "Now, a prominent GOP gubernatorial candidate in a competitive state is using related rhetoric, and it's hardly outlandish to wonder how many more Republicans will do the same thing as the 2022 election season unfolds over the next several months.",
    "As longtime readers may recall, it was in Missouri's 2012 U.S. Senate race when Republican Todd Akin famously declared, \"If it's a legitimate rape, the female body has ways to try to shut that whole thing down.\"",
    "The Republican went on to argue, \"How about we start inspiring women in the culture to let them understand and know how heroic they are and how unbelievable they are that God put them in this moment.\"",
    "The Washington Post reported this morning:\nThe \"Face the Facts\" podcast interview was conducted a couple of weeks ago, but it reached a national audience yesterday.",
    "Two months later, in Indiana's U.S. Senate race, Republican Richard Mourdock argued that when a woman is impregnated by a rapist, \"it's something God intended.\"",
    "You didn't need a PhD in political science to realize their rhetoric about rape and pregnancies was directly responsible for their defeats.",
    "The idea that God put women impregnated by rapists \"in this moment\" is probably not a message that will resonate with many voters.",
    "Vance, a Republican U.S. Senate hopeful said he'd support abortion bans, even if they applied to pregnancies resulting from rape.",
    "\"I will do everything in my power to make sure that happens,\" Soldano replied, adding, \"We must defend life in all instances.\"",
    "The competitive GOP gubernatorial candidate was asked whether he'd pursue a policy akin to Texas' abortion ban.",
    "Akin and Mourdock were conservative candidates running in red states, but they lost anyway.",
    "I can say this with some confidence because it's a pitch that's failed before.",
    "A decade later, some in the party appear to have forgotten the lesson.",
    "She implored her partisan allies: Stop talking about rape.",
    "The Ohioan described such pregnancies as \"inconvenient.\"",
    "But that assumption would be wrong.",
    "Five months ago, for example, J.D.",
    "It's easy to understand why."
  ]
}