{
  "id": 3891,
  "mediaId": 2562,
  "date": "2022-01-24",
  "headline": "Senate Candidate JD Vance: I’m Not Another ‘Fake’ Politician",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/01/getfile.aspxguid8F6C400D-276C-4420-9F1B-22D49D27D64C.jpg",
  "link": "https://donaldjtrumppolls.com/senate-candidate-jd-vance-im-not-another-fake-politician/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    4306,
    4882,
    5036,
    5026,
    2765,
    1394,
    1489,
    6435
  ],
  "sentences": [
    "One example was a tweet in which he yearned for comments from former President Donald Trump — who had been banned permanently by the social media platform — soon after actor Alec Baldwin fatally shot a cinematographer and wounded a director after discharging a prop gun on a movie set in New Mexico.",
    "The former venture capitalist and author of \"Hillbilly Elegy\" was asked about comments made on social media that could be considered ill-advised rhetoric by some people.",
    "\"So, I think the idea that we can't have somewhat offensive humor sometimes from our politicians is basically just asking us to have fake politicians all the time.",
    "Senate Candidate JD Vance: I'm Not Another 'Fake' Politician (AP)\nBy Charlie McCarthy | Monday, 24 January 2022 02:42 PM\nU.S. Senate candidate J.D.",
    "\"I obviously care a lot about foreign policy, armed services, really care about just how we spend money on the military, on other things.",
    "Vance insisted he's not one of those \"fake politicians\" who goes out of his way to make sure his humor doesn't offend people.",
    "\"I'd say like, Look, people may not always agree with my rhetoric, but I think, unfortunately, our country's kind of a joke.",
    "Obviously, you don't get to pick and choose, you know, you get some of what you want, and some of what you don't want.",
    "Every single person that I knew was joking about what would Donald Trump say if he was on Twitter.",
    "Vance was asked, if he's elected, on which Senate committees he would like to serve.",
    "Vance, one of six GOP candidates running for the seat to be vacated by retiring Sen.",
    "Maybe it turns some people off, but I think the realness turns more people on.\"",
    "Those are a few of the things I thought would be good to spend some time on.\"",
    "\"I care about veterans issues, would love to be on the Veterans Committee.",
    "\"I think it's important for our politicians to have a sense of humor.",
    "Appropriations would be a good committee,\" he told Spectrum News 1.",
    "Rob Portman, R-Ohio, was interviewed last week by Spectrum News 1.",
    "I think it's important for us to be real people.",
    "And we should be able to tell jokes about it.",
    "That's not what I'm going to be.",
    "Vance told Spectrum News 1.",
    "Original Article",
    "Right?\"",
    "Right?"
  ]
}