{
  "id": 394,
  "mediaId": 2745,
  "date": "2022-02-23",
  "headline": "Opinion With his praise for Putin’s invasion of Ukraine, Trump makes his apologists look foolish. Again.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3KUSHCUUBII6ZOZROT6ANQFDUU.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/02/23/trump-praises-putin-ukraine-refuting-claims-tough-on-russia/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5507,
    1708,
    2765,
    4591,
    4905,
    3054,
    6177,
    6569,
    6672,
    6678
  ],
  "sentences": [
    "By the end of his presidency, Trump was surrounded by people such as Secretary of State Mike Pompeo, who has recently called Putin “a very talented statesman,” “very shrewd,” “very capable,” and said, “I have enormous respect for him.”\nAt least Pompeo is willing to admit that Putin is the “aggressor” and the Ukrainians are his “victims.” No such censure was evident in Trump’s comments Tuesday to right-wing podcaster Buck Sexton.",
    "Vance said, “I don’t really care what happens to Ukraine.” Fox’s Maria Bartiromo imaginatively suggested that the Biden administration’s “hysteria” about a Russian invasion of Ukraine might be a “ruse” to distract from the latest nonsensical allegations about Hillary Clinton spying on Trump.",
    "I liked him.” — and to praise him as someone with a lot of “charm and a lot of pride” who “loves his country.”\nWith those few words, Trump has just made a fool of every right-winger who has tried to pretend that he would have been tougher on Putin than Biden is currently being.",
    "Compare right-wing complacency about Putin’s invasion of Ukraine with their hysteria about Prime Minister Justin Trudeau of Canada ordering the arrests of anti-vaccine mandate protesters who were blocking major thoroughfares.",
    "It is true that the Trump administration sometimes pursued tough-on-Russia policies independent of the president, but this was largely the work of officials who were purged long before the end of Trump’s term.",
    "Trump did claim that “this never would have happened with us,” but this was merely his usual rhetorical ploy of blaming Russian aggression on former president Barack Obama or on Biden rather than on Putin.",
    "Biden simply does not evoke any sense of strength or danger to our enemies.”\nTo believe this is to suffer from temporary amnesia about how Donald Trump actually acted toward Putin while he was in office.",
    "The U.S. president rejected the findings of the United States’ own intelligence community about the hacking of the 2016 election and said: “President Putin says it’s not Russia.",
    "This is the authentic voice of Trump’s America First movement — and it would be solidly in control of a second Trump term in a way it was not during most of his first term.",
    "1 American apologist — and a favorite of Russian state television — by incessantly arguing that the United States has no stake in Russia’s aggression against Ukraine.",
    "I don’t see any reason why it would be.” Or who can forget Trump’s use of U.S. military aid to extort the government of Ukraine into helping him politically?",
    "Trump mused about pulling out of the alliance, questioned its Article 5 security guarantees and ordered a withdrawal of 12,000 troops from Germany.",
    "But the hardcore MAGA base thinks that Biden has too been too hostile to Putin, who is viewed more favorably by Republican voters than Biden is.",
    "It is a commonplace on the right that the only reason that Vladimir Putin is invading Ukraine is that President Biden is too weak to deter him.",
    "Right-wing troll Candace Owens tweets: “NATO (under direction from the United States) is violating previous agreements and expanding eastward.",
    "Indeed, if Trump stages a comeback in 2024, he might well be counting on more political aid from Putin of the kind that he received in 2016.",
    "So please don’t insult our intelligence by suggesting that Trump is the tough-on-Russia candidate or that his volatility would deter Putin.",
    "That’s why he doesn’t want Ukraine to join NATO, and that makes sense.”\nCarlson’s views are echoed by other America Firsters.",
    "As one right-winger tweeted: “I’m convinced that Putin would be a lot, LOT more hesitant to invade if Trump was President.",
    "Carlson claims that “Canada canceled democracy,” while ignoring the actual, existential threat to democracy in Ukraine.",
    "WE are at fault.” Her fellow troll Charlie Kirk opines: “It feels as if Putin is going into places that want him.",
    "… It is a family dispute that we shouldn’t get in the midst of, that’s for certain.” Ohio Senate candidate J.D.",
    "Here’s a guy who’s very savvy.”\nTrump went on to rhapsodize about his relationship with Putin — “He liked me.",
    "He explained:\n“Putin declares a big portion of the Ukraine — of Ukraine — Putin declares it as independent.",
    "Indeed, it’s hard to think of a single negative word Trump has ever uttered about the Russian tyrant.",
    "It’s true that many mainstream Republicans criticize Biden for being too weak on Russia.",
    "Putin’s aggression against Ukraine is an act of “genius,” according to Trump.",
    "‘I said, ‘How smart is that?’ And he’s gonna go in and be a peacekeeper.",
    "And that’s just the way his most devoted supporters like it.",
    "Who can forget Trump’s kowtow to Putin at Helsinki in 2018?",
    "“Vladimir Putin does not want Belgium,” Carlson says.",
    "“He just wants to keep his western borders secure.",
    "He’s more about Russia First than America First.",
    "That’s the strongest peace force I’ve ever seen.",
    "There were more army tanks than I’ve ever seen.",
    "... We could use that on our southern border.",
    "Tucker Carlson has become Putin’s No.",
    "They’re gonna keep peace all right.",
    "Or all of Trump’s anti-NATO animus?",
    "Oh, that’s wonderful.",
    "No, but think of it."
  ]
}