{
  "id": 4242,
  "mediaId": 2593,
  "date": "2022-01-20",
  "headline": "'Let The 25th Amendment Discussions Begin': Biden's Press Conference a Total Failure as Reactions Roll in",
  "image": "https://ijr.com/wp-content/uploads/2022/01/GettyImages-1365690652.jpg",
  "link": "https://ijr.com/bidens-press-conference-total-failure-reactions-roll-in/",
  "mediaOutlet": "IJR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Samantha Chang",
  "authorUrl": "https://ijr.com/author/wj/ ",
  "termIds": [
    5802,
    2440,
    4992,
    4905,
    4831,
    2765,
    3374,
    2981,
    3639,
    188
  ],
  "sentences": [
    "We watch Biden blather with confused eyes on tv, and all the libs have suddenly forgotten about the 25th Amendment they used to speak of with such reverence when Trump was President\n— Buck Sexton (@BuckSexton) January 13, 2022\nStore shelves are empty, prices are soaring, real wages are declining, American cities are engulfed in violence, the border is controlled by the cartels & parents are treated as terrorists while actual terrorists go free.",
    "Let the 25th Amendment discussions begin\n— Joel Pollak (@joelpollak) January 19, 2022\nConservative radio host Clay Travis slammed the “incredibly embarrassing press conference,” saying Biden underperformed despite responding to “a pre-approved list of questioners on a list given to him.”\nThis is an incredibly embarrassing press conference for Joe Biden.",
    "Breitbart’s Joel Pollak tweeted six words that Biden surely didn’t want to hear: “Let the 25th Amendment discussions begin.” The amendment provides a process for the vice president to assume power if the president “is unable to discharge the powers and duties of his office.”\nThis press conference marks the effective end of the Biden presidency.",
    "Biden derisively tried to brush off the question, but a persistent Rosen followed up, asking, “Why do you suppose such large segments of the American electorate have come to harbor such profound concerns about your cognitive fitness?”\nThe career politician awkwardly replied, “I have no idea.” Then he quickly called on another reporter.",
    "— Caleb Hull (@CalebJHull) January 19, 2022\nDemocrats and their corporate media lapdogs have screeched for the past year that questioning election results is “treason” and “terrorism.”\nIf you oppose COVID restrictions or worry about election integrity you’re now a “potential terror threat.” pic.twitter.com/KpqVYfn7t1\n— J.D.",
    "Hillary Clinton: “Trump knows he’s an illegitimate president.” pic.twitter.com/Ru3ktSgi5T\n— The Hill (@thehill) October 6, 2019\nHypocritical Democrats and their media minions who disingenuously questioned Trump’s mental fitness for four years are now curiously silent about Biden’s bewildering babbling.",
    "The increase in the prospect of it being illegitimate is in direct proportion to us not being able to get these reforms passed.” pic.twitter.com/DF0iOXX2jl\n— Townhall.com (@townhallcom) January 19, 2022\nReminder: The corporate media brutally attacked Trump for making similar remarks.",
    "— Clay Travis (@ClayTravis) January 19, 2022\nMedia strategist Caleb Hull noted that Biden dismissed his abysmal approval ratings as fake (“I don’t believe the polls”) and even suggested that the 2020 election and the forthcoming 2022 midterm elections could be rigged.",
    "Republican Rep. Ronny Jackson of Texas, who was the White House physician to former Presidents Barack Obama, George W. Bush and Donald Trump, reiterated his grave concerns about Biden’s mental sharpness.",
    "pic.twitter.com/b8conSnqW5\n— Scott Whitlock (@ScottJW) January 19, 2022\nMeanwhile, Biden was widely panned by numerous social media commentators, who said the news conference was an epic disaster.",
    "#JoeNeedsToGo #25thAmendment https://t.co/wsKvmxgR0x\n— Robby Starbuck (@robbystarbuck) January 20, 2022\nAlthough people laugh about it, Biden’s faltering mental fitness is not a joke.",
    "— Ronny Jackson (@RonnyJacksonTX) January 19, 2022\nJackson pointed out that Biden completely ignored a question from a White House correspondent about his flailing mental acuity.",
    "— Ronny Jackson (@RonnyJacksonTX) January 19, 2022\nJackson was referencing a polite but direct question posed by James Rosen, the chief White House correspondent for Newsmax.",
    "“A poll released this morning by Politico Morning Consult found 49 percent of registered voters disagreeing with the statement, ‘Joe Biden is mentally fit,'” Rosen said.",
    "President Joe Biden seemed to confirm the dark suspicions of millions of Americans that he’s mentally unfit during his rambling, two-hour news conference Jan. 19.",
    "The blundering 79-year-old repeatedly lost his train of thought and slurred his words during the event to mark his first year as president.",
    "https://t.co/ZlsbJ2DA1h\n— Josh Hawley (@HawleyMO) January 19, 2022\nJoe Biden thinks he “outperformed” in his first year in office.",
    "Vance (@JDVance1) August 14, 2021\nBut if you’re a Democrat, you can call GOP election victories “illegitimate” with impunity.",
    "“He’s totally disconnected from reality,” Jackson tweeted during Biden’s first news conference in 10 months.",
    "In my life there’s never been a president who fit the bill to be removed via the 25th Amendment… Until now.",
    "There’s too much on the line, we need to know!”\nBIDEN JUST IGNORED A QUESTION ABOUT HIS COGNITIVE DECLINE!",
    "Biden says that future elections “easily could be illegitimate.”\n“I’m not saying it’s going to be legit.",
    "So Biden has now complained that elections are rigged, polls are fake, and that news coverage is wrong.",
    "It is a pressing national security threat that will haunt him for the rest of his presidency.",
    "Because that’s the only explanation most people watching, including me, take from this.",
    "This is an EMBARRASSMENT.”\nBiden’s “press conference” is disturbing and bizarre.",
    "Anyone with eyes, a gas tank to fill up and bills to pay knows that’s insane.",
    "He’s reading from a pre-approved list of questioners on a list given to him.",
    "“Isn’t this everything that made Trump ‘literally Hitler’?” Hull tweeted.",
    "!”\nThe congressman added: “I am demanding he have a cognitive test NOW.",
    "We are committed to truth and accuracy in all of our journalism.",
    "“It’s no surprise he’s been kept locked away in the basement.",
    "It’s no surprise he’s been kept locked away in the basement.",
    "“BIDEN JUST IGNORED A QUESTION ABOUT HIS COGNITIVE DECLINE!",
    "“He has NO IDEA what’s going on,” the congressman tweeted.",
    "James Rosen brings up the issue of Biden’s mental fitness.",
    "This article appeared originally on The Western Journal.",
    "When do the Dems seriously consider the 25th Amendment?",
    "Isn’t this everything that made Trump literally Hitler?",
    "Is he incapable of calling on reporters himself?",
    "There’s too much on the line, we need to know!",
    "I am demanding he have a cognitive test NOW.",
    "This man IS NOT qualified to be President!!",
    "“This man IS NOT qualified to be President!",
    "Something is WRONG with him,” he tweeted.",
    "He’s totally disconnected from reality.",
    "He has NO IDEA what’s going on.",
    "Read our editorial standards.",
    "Something is WRONG with him.",
    "This is an EMBARRASSMENT."
  ]
}