{
  "id": 448,
  "mediaId": 2537,
  "date": "2022-02-23",
  "headline": "Opinion: GOP can be party of Trumpism without Trump",
  "image": "https://www.gannett-cdn.com/presto/2019/10/08/PCIN/634e91ad-975f-4449-9261-24846f8e2e6f-091419Gallipolis07.JPG?crop=5214,2933,x0,y265&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/02/23/opinion-gop-can-party-trumpism-without-trump/6795150001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Sewell",
  "authorUrl": "",
  "termIds": [
    5825,
    2736,
    4905,
    4306,
    2765,
    312,
    6060,
    6474
  ],
  "sentences": [
    "The former West Virginia GOP official and Rob Portman aide was an early caller of Trump’s Republican primary domination and as editor-publisher of the Hillsboro Times-Gazette in southern Ohio, he was among a handful nationwide whose newspaper endorsed Trump for president.",
    "When we first moved here in the summer of 2020, I think there were more Trump signs here than in Hillsboro…\nTrump won nearly 80% of the vote in Highland County, but he still won 67% in Clermont and 65% in Warren, so it’s still Trump Country here in the rural areas.",
    "Despite some people claiming that Trump was a cult leader, he actually had a platform that attracted Republicans – a strong Southern border, energy independence, an America First foreign policy, and resistance to cancel-culture, politically correct wokeness.",
    "Jane Timken is probably the most serious candidate policy-wise, and she’s also trying to fill that Trump lane, but her efforts in that direction don’t come off as blatant or desperate as Mandel and Vance.",
    "Abernathy tries to promote \"communication and civil discourse between people who completely disagree with each other,\" co-existing and respecting each other’s rights to have differing points of view.",
    "Most media outlets have not done as good a job as the Post, especially its Opinion … But in general news coverage, not much has improved, which I think is due in part to dwindling budgets.",
    "A: I was somewhat surprised at how little difference there is between where I live now in Clermont County – right on the borders of Hamilton and Warren – and Highland County.",
    "\"He’s not just a pro-Trumpish voice, he’s more of a Trump voter voice,\" Ruth Marcus, Post deputy editorial page editor, explained to the Columbia Journalism Review.",
    "Most of the major, influential news outlets are based in metropolitan areas, and branching out to the rural areas is costly, beyond a drop-by visit here and there.",
    "A: It was sad to watch Vance surrender his credibility and abandon what were obviously his heartfelt sentiments about Trump in 2016 in order to pander for votes.",
    "A: I wrote a column for the Post recently making the point that even though President Biden taunted the Republican Party recently by asking, \"What are they for?\"",
    "Vance got a lot of attention in 2016 for his insights into Trump voters, although his U.S. Senate foes attack him now for his former opposition to Trump.",
    "They feel their concerns are marginalized and dismissed – but they’ve long felt that way, which Trump recognized and is why they found him appealing.",
    "Abernathy, 66, who now lives in Loveland, broke with Trump over his post-2020 election behavior, but still keeps his ears open to Trump supporters.",
    "After Trump’s victory, some in the stunned \"Big Media,\" to use Abernathy’s term, realized there was a lot of America not being well-represented.",
    "His Post columns have led to frequent appearances on PBS NewsHour and other media shows, as well as talks on college and high school campuses.",
    "Rob Portman’s endorsement is helpful, but it wasn’t surprising considering his wife, Jane, has been co-sponsoring fundraisers for Timken.",
    "Gary Abernathy doesn’t officially hold the title, but he’s been serving in that role since Donald Trump was elected president in 2016.",
    "Most Trump supporters I know still believe there was fraud in the 2020 election and the mainstream media doesn’t take it seriously.",
    "I know Trump supporters who like Mike Gibbons and liked Bernie Moreno, before he dropped out, for their business backgrounds.",
    "But no one should confuse that with the notion that there’s been a big move away from Trump by Republicans in either place.",
    "Matt Dolan is the only non-Trumper, which is interesting, but it won’t get him across a Republican primary finish line.",
    "Q: As early as January 2016 you were telling traditional Republicans they \"should start fathoming\" a Trump-led ticket.",
    "Dan Sewell retired last year after 44 years of daily journalism and is a member of The Enquirer Board of Contributors.",
    "How much better do you think the mainstream news media have become in the need to reflect more parts of America?",
    "But I do think the passion for Trump is higher when I go back to visit Hillsboro than it is here in Loveland.",
    "A: Does the Times acknowledge that there’s a \"left-wing media ecosystem\" that could stand to be scrutinized?",
    "How much of a factor will Trump be in that race and who do you think has the most appeal in Trump Country?",
    "Opinion contributor\nThere across the table from me in suburban Cincinnati sat the Voice of Trump Country.",
    "He recently answered five questions:\nQ: What do you think the mood of Trump Country is these days?",
    "So Americans in \"flyover country\" remain either misunderstood, stereotyped or flat-out ridiculed.",
    "Q: The New York Times recently posted a job to cover \"the right-wing media ecosystem.\"",
    "\"We are … really wanting to find the diverse viewpoints expressed in the election.\"",
    "Josh Mandel is comical in the lengths to which he goes to pander to Trump voters.",
    "Do you think those voters are more likely to want to move on from Trump?",
    "There are many other Republican candidates ready to carry that banner.",
    "Q: You now live in a different sector of Trump Country – the suburbs.",
    "the GOP doesn’t actually have to figure that out right now.",
    "The GOP can be the party of Trumpism without Donald Trump.",
    "All it needs to do in 2022 is move away from Trump.",
    "If Trump endorses, whoever he picks wins.",
    "The Washington Post came calling.",
    "Q: \"Hillbilly Elegy\" author J.D.",
    "That’s still where we’re at.",
    "A: Unhappy and defiant.",
    "How about for 2024?",
    "You have to laugh."
  ]
}