{
  "id": 4727,
  "mediaId": 8497,
  "date": "2022-04-21",
  "headline": "Ohio US Senate candidates push to the finish ahead of primary",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/gop-candidate-png-1650578887.png?crop=1.00xw:0.908xh;0,0.0314xh&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-us-senate-candidates-primary/39789555",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John London",
  "authorUrl": "https://www.wlwt.com/news-team/0e331c55-fcf7-4f86-b314-3917d61a0129",
  "termIds": [
    2290,
    4306,
    4839,
    1489,
    6060,
    6474
  ],
  "sentences": [
    "His appearance came two days before Trump returns to Ohio for a Delaware County rally where media will be watching and measuring the crowd's reaction to Vance because of his stinging comments about Trump and his supporters six years ago.",
    "Taking note of the media following him around the state Thursday, Mandel launched a line that got the biggest applause of the event: \"Let me say it very clear: I believe this election was stolen from Donald J.",
    "General Michael Flynn, a close confidante of former President Donald Trump, walked briskly up the steps of Immaculate Conception Church to join Mandel on the first of four statewide stops.",
    "For the other candidates who have been running their entire campaign to get that endorsement, I don't know what they can now turn to Ohioans and say, 'Yeah, I'm fighting for you now.'\"",
    "\"And we have our differences about who's who because I know there's a lot of things going on here right now,\" Flynn said before Mandel spoke.",
    "CINCINNATI —\nThe search for persuadable Republican primary voters is intensifying in the final dozen days of early voting in Ohio.",
    "That is when the votes will be counted and Ohio will find out if it will be the Trump-endorsed candidate or one of the other four.",
    "\"The left is trying to teach our kids there's over fifty genders and as young as eight years old you can just pick your gender.",
    "The others would take issue with that, but he was hard at it today as he delivered a dizzying number of declarations.",
    "Regarding the Trump endorsement, Dolan said, \"The impact on me is non-existent because my race has been about Ohio.",
    "Mike Gibbons pushes his outsider businessman image and is pouring personal millions into burnishing his chances.",
    "\"By that statement, Josh Mandel is telling Ohioans he's going to go to Washington and do nothing,\" Dolan said.",
    "Jane Timken promotes the backing of retiring Senator Rob Portman, respected for his bipartisan approach.",
    "That's who all five candidates for the GOP Senate nomination are trying to reach between now and May 3.",
    "Boys are boys and girls are girls,\" he thundered to vigorous cheers and applause.",
    "\"We don't need 30 days of voting,\" Mandel said as the crowd reacted approvingly.",
    "That was as close as he or Mandel would come to the endorsement impact question.",
    "Dolan presents himself as \"the policy guy\" who will work across the aisle.",
    "\"We need warriors right now,\" said General Flynn at a pre-rally interview.",
    "In the post-debate, post-endorsement period, the talk is even more blunt.",
    "A \"Faith and Freedom\" rally in Norwood became \"Faith, Freedom and Flynn.\"",
    "On Thursday, there was star power on Josh Mandel's campaign trail.",
    "Mandel told us no one was going to outwork him down the stretch.",
    "Voting itself has become a partisan issue in today's America.",
    "Vance a week ago created a new dynamic in the five-way race.",
    "All of the campaigns are trying to gin up the interest.",
    "In a sense, it is now a whole new part of the primary.",
    "Dolan's gloves came off when he was informed about it.",
    "Turnout for the primary is still expected to be low.",
    "I think now is the time for fighters,\" Mandel said.",
    "The five candidates have had their debate moments.",
    "Trump's endorsement of venture capitalist J.D.",
    "\"I think the time for bipartisanship is over.",
    "It's called Election Day.\"",
    "There's only two genders.",
    "\"Go back to one day.",
    "That's not right.",
    "Trump.\""
  ]
}