{
  "id": 4966,
  "mediaId": 2668,
  "date": "2022-04-23",
  "headline": "Trump Lambasts Biden at Ohio Rally With Comments Sure to Be 'Fact-Checked'",
  "image": "https://media.townhall.com/townhall/reu/o/2022/101/ae3b6983-efdc-483b-b7b2-168d24b5f52e-1110x740.jpg",
  "link": "https://redstate.com/bonchie/2022/04/23/trump-lambasts-biden-at-ohio-rally-with-comments-sure-to-be-fact-checked-n555077",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bonchie",
  "authorUrl": "https://redstate.com/author/bonchie",
  "termIds": [
    4905,
    4306,
    2765,
    1489,
    6107
  ],
  "sentences": [
    "Trump is so good on the mic\npic.twitter.com/pBr67kc4Kd\n— eazy (@ThatGuyBrian3) April 24, 2022\nTrump tells the story of a meeting he had with the Mexican president before the United States had hammered out the “Remain in Mexico” agreement that Biden has now sought to nuke (with disastrous, deadly consequences).",
    "In typical comedic fashion, the former president riffed about the interaction, noting that the Mexican president was non-cooperative at first, specifically in regards to deploying Mexican forces to help.",
    "I mean, there’s no way the current president actually tried to shake hands with thin air and was herded like a cow by the Easter Bunny in an attempt to shield him from reporters, right?",
    "But while Vance may have technically been the man of the hour, the former president was the highlight, playing his greatest hits but also leveling some hilarious comments on Joe Biden.",
    "Because it’s the antithesis of how the mediocre, careerist hacks at the State Department normally operate, and Biden’s ascension to power has brought a return to the status quo.",
    "Rather, they are coming to a conclusion that fits their preferred narrative — based on exactly the same amount of speculation as those who see him shaking hands with thin air.",
    "Heck, Politifact has already done the work, claiming that Biden was “pointing at the audience behind him with his whole hand.” You know, because that’s something people do.",
    "One of the best moments included a mention of the Easter Bunny, while rounding out into a very effective critique of what the Biden administration has done to the country.",
    "Getting off that tangent and back onto the Trump rally, the president also shared a story that I think highlights one of the best things about his presidency.",
    "— PolitiFact (@PolitiFact) April 20, 2022\nEveryone reading this is welcome to go watch the video for themselves and come to their own conclusion.",
    "pic.twitter.com/F08bshqaBC\n— Steven Cheung (@CaliforniaPanda) April 23, 2022\nIn more sane times, you’d assume that Trump was just joking.",
    "Would anyone else prefer Trump’s hard-nosed style to the current administration breaking records for illegal immigrant crossings?",
    "Still, you can bet those statements will be “fact-checked” in another weak attempt to protect the current White House resident.",
    "The video is one of many that form a history of comedic and embarrassing presidential moments that garnered public attention.",
    "It’s not, though, and the country is stuck with Biden and his horrible, nonsensical policies for nearly another three years.",
    "What I do know is that Politifact does not have any special insight into what Biden was doing or thinking at the time.",
    "Efforts to portray presidents as ineffective or seize on moments that make them look that way are not new.",
    "Donald Trump held a rally in Delaware, OH, on Saturday evening, prompted by his recent endorsement of J.D.",
    "Unfortunately, we don’t live in more sane times, so both those things actually happened.",
    "In the end, Mexico caved, allowed “Remain in Mexico,” and did deploy troops.",
    "Taking orders from the Easter bunny.” – President Trump #TrumpRally ????",
    "According to Trump, that came after he threatened crippling tariffs.",
    "That seems like a pretty easy choice, if it were being offered.",
    "When you say it like that, it sure is depressing.",
    "Vance in the state’s coming GOP Senate primary.",
    "Biden is writing Trump’s material for him.",
    "He’s walking around somewhat bewildered.",
    "“[Biden’s] shaking hands with the air.",
    "Ask yourself, how has that worked out?",
    "Here’s what that sounded like.",
    "Why is that story impactful?",
    "But I digress."
  ]
}