{
  "id": 4988,
  "mediaId": 2621,
  "date": "2022-04-23",
  "headline": "Trump Explains Endorsing J.D. Vance, Who Previously Said ‘Bad Sh*t’ About Trump: ‘By That Standard, I Don’t Think I Would Have Ever Endorsed Anybody’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-23-at-8.42.35-PM.png",
  "link": "https://www.mediaite.com/donald-trump/trump-explains-endorsing-j-d-vance-who-previously-said-bad-sht-about-trump-by-that-standard-i-dont-think-i-would-have-ever-endorsed-anybody/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Huggins",
  "authorUrl": "https://www.mediaite.com/author/katherine-huggins/",
  "termIds": [
    4306,
    2765,
    1126,
    1254,
    1489,
    6474
  ],
  "sentences": [
    "Every one of the others did.”\n“In fact, if I went by that standard, I don’t think I would have ever endorsed anybody in the country,” Trump continued, adding that while they all said bad things, “they all came back.”\nThe venture capitalist and “Hillbilly Elegy” author called himself in a 2016 interview “a Never Trump guy,” wrote of Trump in a 2016 tweet, “My god what an idiot,” and said his policy proposals “range from immoral to absurd.”\nGOP officials in the state urged Trump not to back Vance based on his past comments, writing in a letter that “an endorsement that cuts against your support and legacy in Ohio will only serve to confuse or upset voters.”\nHowever, last Friday, Vance earned the coveted endorsement, though Trump noted the decision was not “easy,” as he likes others in the race.",
    "We have to pick somebody that can win.”\nTrump then listed the qualifications he believed made Vance the most likely to win the general election out of all the contenders in the crowded GOP primary.",
    "Trump argued Saturday that Vance was not the only candidate to have spoken negatively of him in the past, but indicated he holds no grudges against any of the Ohio Republican candidates.",
    "“By the way, he’s been like, incredible the last period of time, long period of time, and so have the others for the most part, I guess in all cases, the others,” Trump said.",
    "“He’s a guy that said some bad shit about me, he did,” Trump said as he reintroduced Vance during a rally in Ohio.",
    "Vance in Ohio’s Senate race despite the fact he previously “said some bad shit” about Trump.",
    "Subscribe to\nFormer President Donald Trump explained on Saturday his endorsement of J.D.",
    "And he, frankly, he’s a great Buckeye.”\nWatch above, via RSBN\nHave a tip we should know?",
    "A great student, you know, went to Yale, got a law degree.",
    "He’s a former marine,” Trump said of Vance.",
    "He fights like crazy and he loves Ohio.",
    "“But I have to do what I have to do.",
    "He’s a fearless MAGA fighter.",
    "“He’s a Yale educated lawyer.",
    "“This guy is, he’s tough.",
    "Want to avoid video ads?",
    "He’s a great student.",
    "“But you know what?",
    "tips@mediaite.com",
    "He’s smart."
  ]
}