{
  "id": 5038,
  "mediaId": 2557,
  "date": "2022-04-23",
  "headline": "WATCH LIVE: Trump speaks at Save America rally in Ohio",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-1251044496-3.jpg",
  "link": "https://dennismichaellynch.com/watch-live-trump-speaks-at-save-america-rally-in-ohio/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    0
  ],
  "sentences": [
    "BREAKING: Trump delivers announcement as Elon Musk seals deal to purchase Twitter\nBREAKING: Judge rules on request from NY AG Letitia James to hold Trump in contempt\nDML Podcast Ep61: Why and how the beginning of the end of wokeness has arrived\nBREAKING: Twitter and Elon Musk reach agreement on buyout deal\nREPORT: NAACP sends list of demands to Musk following purchase of Twitter",
    "It operates much like Iran’s Council of Guardians as an unelected, unaccountable, self-styled fourth branch of government, neutralizing threats like MLK and RFK, backing its own uni-party candidates like GHWB and BHO, and manipulating the American people and world events.",
    "Vance spoke at the rally shortly before Trump was set to appear on stage, as the crowd chanted “JD, JD!”\nWATCH LIVE as Trump takes the stage in Ohio:\nUPDATE: The 45th President of the United States will be streaming live on his official Rumble account at 7pm ET today.",
    "Tune in multiple streams below…\nOfficial President’s account: https://t.co/pQ9jwJx8y7\nOfficial @RSBNetwork account: https://t.co/4LYEFexmMs\n— Rumble (@rumblevideo) April 23, 2022\nThe DML News App offers the best in news reporting.",
    "I think it’s the only endorsement in politics that actually moves votes, and it moves a lot of votes, especially here in Ohio,” Vance told Fox News of Trump’s endorsement.",
    "The dark secret at the heart of the American political system is the sad fact that CIA elements and their Mafia allies carried out the 1963 assassination of Pres.",
    "Mandel and Gibbons were the frontrunners before Trump’s official endorsement of Vance came along, which pushed him squarely in contention for the nomination.",
    "Former President Donald Trump is speaking at a ‘Save America’ rally in Delaware, Ohio Saturday evening, and is set to endorse Senate candidate J.D.",
    "Republican rivals Mike Gibbons, Jane Timken and Josh Mandel all sparred with Vance and each other about whose support for Trump was more genuine.",
    "The FBI and CIA have operated with impunity ever since, simply by invoking the trope of “national security.” This is the Deep State.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "They then leveraged the White House, FBI, and Warren Commission to cover up the conspiracy.",
    "The hotly-contested Ohio race may be the biggest test of Trump’s endorsement power yet.",
    "Trump is right — the Deep State is a greater threat than even our external enemies.",
    "Kennedy, at the behest of Lyndon B. Johnson, J. Edgar Hoover and Allen Dulles.",
    "The usurpation in the White House has no real legitimacy whatsoever.",
    "Trump through massive election fraud and judicial intimidation.",
    "It is treason that must be extirpated root and branch.",
    "Listen to the latest daily DML podcasts below!",
    "It has just deposed Pres.",
    "“It’s hugely powerful.",
    "Then please share.",
    "Vance."
  ]
}