{
  "id": 5118,
  "mediaId": 2742,
  "date": "2022-04-24",
  "headline": "Trump Endorses Vance In Ohio, Hammers Biden, But Ignores Legal Immigration",
  "image": "https://vdare.com/public_upload/publication/featured_image/57432/trumrally.png",
  "link": "https://vdare.com/posts/trump-endorses-vance-in-ohio-hammers-biden-but-ignores-legal-immigration",
  "mediaOutlet": "VDARE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2765,
    4093,
    4306,
    4873,
    4905,
    6474,
    6107
  ],
  "sentences": [
    "Noting that he ended catch-and-release and built 500 miles of border wall, Trump said Biden has “blown the border to shreds,” and will soon stop Title 42 expulsions, the only thing keeping out what Biden’s own officials predict could be an invasion of 18,000 illegals per day.",
    "“In no other developed country do we allow migration primarily based on family relations rather than skills,” Vance begins:\nMillions of people want to come here, and we should only allow them if they contribute something meaningful to our country.",
    "Because of this, our capacity to assimilate the next generation of immigrants is limited, and our legal immigration system should account for this fact by changing who we let in and reducing the total numbers.",
    "Vance (@JDVance1) April 15, 2022\nTrump was solid—on the 2020 election and the Democrats’ openly anti-American and destructive, crackpot policies such as Defund the Police, and not least open borders.",
    "pic.twitter.com/xSgsGmS2ZJ\n— Steven Cheung (@CaliforniaPanda) April 23, 2022\n“Now either you’re stupid or you hate our country” if you support Let’s Go Brandon’s open-borders immigration policies.",
    "Forty years ago, new American immigrants came to a country where bipartisan leaders delivered a simple message: this great country is now your own, and you have a duty to help build it.",
    "Should he land in the Senate in January, one of his top priorities is restarting the border wall, a near impossibility even if Republicans take Congress and pass appropriations for it.",
    "Joe Biden and his Homeland Security chief—unindicted Cuban-Jewish visa fraudster Alejandro Mayorkas—have openly, and repeatedly, said they will not enforce U.S. immigration laws.",
    "Importantly, our ability to assimilate immigrants successfully—something our country should be proud of—is contingent on American leadership that loves this country.",
    "But Trump ignored legal immigration, foreign workers, and walked by some really low-hanging fruit: TPS for 12,000 Cameroonians who should be shipped back to Africa.",
    "“There’s no way that anybody can want open borders,” Trump continued:\nThe radical democrats have chosen their side, and they’ve sided with the drug cartels.",
    "He was an incredible fighter for hard working Americans in the White House, he will be again, and I'll fight for the America First Agenda in the Senate.",
    "… [Democrats have] sided with these drug cartels and human traffickers … and child smugglers, and criminal aliens and savage thugs of MS-13.",
    "But once again, he ignored legal immigration and Biden’s crazed plan to import at least 125,000 refugees, if not double that amount.",
    "Vance and accused Treason Lobby Democrats of siding with drug cartels and human smugglers in their obsession with open borders.",
    "… There has to be something going on because nobody could want to open borders, where hundreds of countries are pouring in.",
    "Today, those same leaders deliver a different message: this is an evil and racist country, and you owe nothing to it.",
    "He fights like crazy and he loves Ohio and quite frankly a great Buckeye.” - President Trump#TrumpRally ????",
    "Speaking at a Save America rally last night in Delaware, Ohio, POTUS 45 Trump re-endorsed GOP candidate J.D.",
    "He didn’t mention it last night, but Vance goes farther, much farther, than Trump did.",
    "Yet opposing the illegal-alien invasion at the border is hardly going out on a limb.",
    "He attacks legal immigration, and he attacks it in detail at his campaign website.",
    "“It can only be one of 2.”\nI pick the latter for an obvious reason.",
    "For doing so means the GOP must override Brandon’s certain veto.",
    "In other words, he ignored the obvious: The Great Replacement.",
    "I'm incredibly honored to have President Trump's support.",
    "But Trump could and should have said what Vance does.",
    "The Hillbilly Elegy author spoke twice … briefly.",
    "Illegal immigration isn’t the problem.",
    "https://t.co/s3d3JhTgBC\n— J.D.",
    "He’s a Yale educated lawyer.",
    "That’s all well and good.",
    "A fearless MAGA fighter.",
    "The borders must close.",
    "… The money is so big.",
    "He’s a former Marine.",
    "… Who can want that?",
    "“@JDVance1 is tough.",
    "All immigration is.",
    "He’s smart."
  ]
}