{
  "id": 5167,
  "mediaId": 2589,
  "date": "2022-04-23",
  "headline": "Bill Maher: When did the right stop believing in democracy?",
  "image": "https://hotair.com/wp-content/uploads/2022/04/m-1-1110x740.jpg",
  "link": "https://hotair.com/allahpundit/2022/04/23/bill-maher-when-did-the-right-stop-believing-in-democracy-n464403",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allahpundit",
  "authorUrl": "https://hotair.com/author/allahpundit",
  "termIds": [
    2499,
    5075,
    4306,
    2765,
    1126,
    392,
    6474
  ],
  "sentences": [
    "“I think that what Trump should do, if I was giving him one piece of advice: Fire every single midlevel bureaucrat, every civil servant in the administrative state, replace them with our people.”\n“And when the courts stop you,” he went on, “stand before the country, and say—” he quoted Andrew Jackson, giving a challenge to the entire constitutional order—“the chief justice has made his ruling.",
    "“If we’re going to push back against it, we’re going to have to get pretty wild, and pretty far out there, and go in directions that a lot of conservatives right now are uncomfortable with.”\nVance said in the same interview that he wants to “seize the institutions of the left,” whatever “seize” might mean, and engage in a “de-Baathification program” against the woke.",
    "If you’re constantly being told that you’re right in all particulars but you’re also losing the popular vote in election after election, go figure that you might develop a siege mentality that would lead you to conclude there must be something fundamentally wrong with America’s system of governance.",
    "But as an insight into how far gone the party is already, simply note that Vance’s chatter about ignoring court rulings and “de-Baathifiying” his fellow Americans isn’t the reason he stands a chance of losing his Senate primary.",
    "What if the GOP’s pre-Trump small-government incarnation was unpopular with voters but its current Trump-era nationalist model is also unpopular — at least when it’s represented on the ballot in the person of Trump himself?",
    "It simply can’t be that populists could nominate their political hero, a man running on a platform of restoring American greatness, and fail to receive even 47 percent of the vote for the second straight election.",
    "For instance, the cretin who recently said this is currently favored to become the next senator from Ohio with the endorsement of a former Republican president:\n“I think Trump is going to run again in 2024,” [J.D.",
    "He doesn’t describe himself as a fascist but I imagine that’s less a matter of him being uncomfortable with the term than knowing that the normie voters he’s courting would be uncomfortable with it.",
    "The reason he might lose is that he said some unflattering things about Trump six years ago and, for many Republicans, no amount of groveling and pledges of slavish loyalty can ever properly atone.",
    "Anyone with an interest in politics in 2022 can envelop themselves in a warm bubble of online information in which their beliefs are affirmed repeatedly, every hour of every day.",
    "If he’s forced to choose between a democratic system in which wokesters sometimes get elected and a dictatorship in which they don’t, he’ll take door number one.",
    "The tribal dynamics of social media, where users are incentivized to reinforce their group’s beliefs with the promise of virality, make matters worse.",
    "What if the Democrats’ claims that demographic change will produce a durable Democratic majority are true, locking Republicans out of power forever?",
    "As for the answer to Maher’s question, it starts with the fact that Republicans have won the popular vote once in the last eight elections.",
    "Republican disillusionment with democracy is partly a product of results, then, but also partly a matter of media in the Internet age.",
    "In which a guy who’s been accused of being a closet Republican because he hates wokeness explains why he still prefers Democrats.",
    "“We are in a late republican period,” Vance said later, evoking the common New Right view of America as Rome awaiting its Caesar.",
    "Vance’s sin, in other words, isn’t that he’s an authoritarian but that he hasn’t been consistently authoritarian enough.",
    "If democracy keeps putting people who are Wrong About Everything in power, there must be a problem with democracy.",
    "It can’t be that Republicans have been the less popular party in every election for nearly 30 years save one.",
    "But populism and classical liberalism coexist uneasily, as we were reminded this week in Florida.",
    "When did Republicans, or at least many Republicans, begin to prefer door number two, he wonders?",
    "Viewed through that lens, the “rigged election” insanity in 2020 is a sort of coping mechanism.",
    "Maher dislikes having to choose between them — don’t we all — but he’s made his choice.",
    "But even the true believers must feel a bit of doubt nag at them from time to time.",
    "It’s hard to know to what extent populism is a cause or an effect in all this.",
    "Now let him enforce it.”\nThis is a description, essentially, of a coup.",
    "As far as I’m aware, his opponents aren’t even making an issue of it.",
    "What good is democracy if your side always loses?",
    "So the election must have been rigged.",
    "What if Trump did lose?",
    "He said so himself.",
    "(They aren’t true.)",
    "Vance] said.",
    "Trump won.",
    "For now."
  ]
}