{
  "id": 5174,
  "mediaId": 2664,
  "date": "2022-04-21",
  "headline": "J.D. Vance defends Florida's 'don’t say gay' bill ahead of Trump visit",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29708194&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/-2657191381/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Evans",
  "authorUrl": "https://www.rawstory.com/u/nickevans-ohiocapitaljournal",
  "termIds": [
    0
  ],
  "sentences": [
    "“One of the things I do when I win the primary, and even before,” he said, “is going to be you have to convince those people that I’m actually on their side, I’m on their team and that they should help me.”\nOhio Capital Journal is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "“and they’ll be the first to tell you it’s unsafe, and it’s unreasonable to expect our young girls to participate against people who have been through puberty.”\nVance also addressed so-called “don’t say gay” legislation, zeroing in on the provision that teacher can’t address gender or sexual identity at all for grades K-3.",
    "“The idea that my son can engage in conversations that are that mature, is really ridiculous.”\nVance’s description of Florida’s legislation, of course, glosses over the much broader provision that any instruction be “age appropriate,” which the measure does not define.",
    "“I think it’s pretty cowardly and pretty pathetic that nobody else decided to show up.”\nBut while his opponents ceded the stage, Vance’s GOP critics haven’t taken the Trump endorsement lying down.",
    "The event, at Ohio Wesleyan’s Chappelear Drama Center, landed right between him securing Donald Trump’s endorsement and the former president’s visit this weekend at the nearby county fairgrounds.",
    "We did it in the face of ‘Never Trumpers’ like JD Vance.”\nTrump’s 2016 state director Rob Scott and electoral college elector Ralph King are leading the effort to convince Trump to reconsider.",
    "“I think he sort of came to think that a lot of the other guys were just you know, sloganeering and talking points, and didn’t actually believe the things that they were saying,” Vance said.",
    "Separately Vance invoked common carrier status — effectively regulating an entity like a public utility — as a way to keep tech companies from regulating speech on their platforms.",
    "I mean, it’s a hard thing, but I guess they know that when they go in.”\nJessica Miller decided to back Vance before the announcement, but she said it certainly didn’t hurt.",
    "“I’m not afraid to talk to voters, and I’m not afraid to actually answer tough questions,” Vance told an audience member asking why she should cast a vote for him.",
    "“We are the original and proud ‘Trumpers’ who served as your delegates in Ohio when everybody was against you or supporting other candidates,” the letter states.",
    "In a letter, 33 of Trump’s 2016 delegates and electors expressed a sense of “betrayal” that Trump would back “a political chameleon” like Vance.",
    "But instead of dismissing the idea that people can be trans, he offered the first glimpse of a potential bid to win over more moderate voters.",
    "Townhall takeaways\nThe townhall format gave Vance a bigger bullhorn, but much of what he had to say reiterated points from previous debates.",
    "Ron Desantis for threatening Disney’s special taxing district, arguing that the government should punish companies for engaging politics.",
    "Vance railed at big tech censorship, got loud applause for his border plan, and stood firm on his skepticism of involvement in Ukraine.",
    "And when it comes to the 30-odd Trump delegates asking the former president to reconsider, Vance made a bid for their support.",
    "The organizers invited all five GOP frontrunners, but after a wave of previous get-togethers, the other candidates declined.",
    "His comments on Florida’s “don’t say gay” bill also showed how quickly lightning rod issues can muddy the political waters.",
    "Speaking after the townhall Vance shrugged off the inconsistency, arguing individual companies need to treat users fairly.",
    "Lisa Giesler had been vacillating among the field even wishing she could put parts of them together into one candidate.",
    "Despite Republicans long defending corporate political spending as free speech, Vance applauded Florida Gov.",
    "“Look, I’ve got friends of mine who have kids who are going through gender identity problems,” Vance said.",
    "“They get a ton of special privileges, they get liability protections, they get subsidies,” Vance said.",
    "But the same status was revoked for internet service providers during the debate over net neutrality.",
    "“We should be willing to cut that stuff off if these corporations are going to engage in politics.",
    "Vance had the stage to himself, taking questions from voters in a townhall hosted by NewsMax.",
    "On the issue of transgender participation in sports Vance took the party line in opposition.",
    "Trump’s backing carried weight for some attendees Wednesday night, but not for others.",
    "“I’ve never let those types of endorsements influence me in the past,” Orr explained.",
    "Right?”\nVance went on to explain that his son will be in kindergarten next year.",
    "“I don’t want ISPs to be able to discriminate against conservatives, either.",
    "And we did it for you against the Ohio Swamp and many in the establishment!",
    "We’ve got to stop bribing people with our own money, who hate our values.",
    "Contact Editor David DeWitt for questions: info@ohiocapitaljournal.com.",
    "As for Trump’s endorsement, Vance chalked it up to debate performance.",
    "“My son wakes up and thinks that he’s a dinosaur, right?” Vance asked.",
    "The main issue is sort of the forward-facing companies,” he argued.",
    "“We are the ones you trusted to stand and deliver for you in 2016!",
    "Trump’s endorsement decided her, but she was a bit apologetic.",
    "“We’re talking about 5, 6, 7, 8-year-old kids,” he said.",
    "Vance didn’t miss the opportunity to get a few digs in.",
    "Ohio Capital Journal maintains editorial independence.",
    "Donald Trump’s FCC chairman, Ajit Pai led that charge.",
    "Follow Ohio Capital Journal on Facebook and Twitter.",
    "Bill Orr and Janice Weinandy couldn’t care less.",
    "“I feel bad for the other people,” she said.",
    "“That seems like a pretty good idea.",
    "“They spend so much money and time.",
    "In Delaware Wednesday night J.D.",
    "That’s not the main issue.",
    "It’s really that simple.",
    "Stories Chosen For You"
  ]
}