{
  "id": 5320,
  "mediaId": 2557,
  "date": "2022-04-14",
  "headline": "NEWS ALERT: Trump plans to endorse candidate in contentious Ohio Senate GOP primary, report says",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-1325665733-e1625586228905-2.jpg",
  "link": "https://dennismichaellynch.com/news-alert-trump-plans-to-endorse-candidate-in-contentious-ohio-senate-gop-primary-report-says/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    0
  ],
  "sentences": [
    "Vance 18%\nMike Gibbons 18%\nJosh Mandel 18%\nJane Timken 9%\nMatt Dolan 9%\nUndecided 29% pic.twitter.com/RFu0PpXddD\n— InteractivePolls (@IAPolls2022) April 6, 2022\nUpdate: A source close to Mandel’s campaign acknowledged Thursday Trump’s press shop had already written up the Vance endorsement, but it threw up a last-minute obstacle: an internal poll campaign showing Mandel in front & Vance tied in 3rd/4th single digits\n— Marc Caputo (@MarcACaputo) April 14, 2022\nListen to the latest daily DML podcasts below!",
    "Just now, NBC reporter @MarcACaputo who broke the news about Trump's upcoming endorsement, reports that Trump was ready endorse Vance before Mandel's campaign sent him this internal poll showing Vance losing even if Trump endorses him: take all of this news with a grain of salt pic.twitter.com/hYsFyLKntk\n— InteractivePolls (@IAPolls2022) April 14, 2022\nTrump’s ‘Save America’ rally in Ohio is scheduled for April 23.",
    "The article goes on to state the following:\nDuring his campaign, Vance touted an endorsement from Rep. Marjorie Taylor Greene of Georgia, a close ally of Trump who joined Vance on the campaign trail, in what was seen as a move to persuade Trump to back his candidacy.",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by WashingtonExaminer:\nFormer President Donald Trump is planning to endorse author J.D.",
    "— Washington Examiner (@dcexaminer) April 14, 2022\nPromoted Content\nPoll done for pro-Vance super PAC Protect Ohio Values and @TonyFabrizioGOP\n2022 OHIO SENATE GOP PRIMARY:\nJ.D.",
    "Promoted Content\nAdditionally, Vance’s lackluster polling numbers recently presented “a major worry for Trump who doesn’t want to waste his endorsement,” the report adds.",
    "Vance, like all the candidates in the field, has openly courted Trump’s endorsement as a means of differentiating himself from the rest of the field.",
    "According to the report, Trump has expressed concern about Vance in the passed, citing criticisms of him while running for president back in 2016.",
    "Former President Donald Trump is planning to endorse author @JDVance1 in Ohio’s crowded and contentious Republican Senate primary.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "Promoted Content\nNBC News reported that Trump is planning to endorse Vance, citing three sources with knowledge.",
    "To get more information about this article, please visit WashingtonExaminer.",
    "Vance in Ohio’s crowded and contentious Republican Senate primary.",
    "Then please share."
  ]
}