{
  "id": 5688,
  "mediaId": 2674,
  "date": "2022-04-16",
  "headline": "Trump endorses JD Vance",
  "image": "https://cdni.russiatoday.com/files/2022.04/article/625b1efd85f5407e1b6f3363.jpg",
  "link": "https://www.rt.com/news/554001-trump-endorses-jd-vance/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "mediaOutlet": "Russia Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5613,
    2290,
    2765,
    2971,
    4306,
    4905,
    1477,
    1126
  ],
  "sentences": [
    "But he is facing stiff competition from establishment stalwarts Mike Gibbons and Josh Mandel, both of whom lobbied for Trump’s endorsement, with Gibbons touting his work on Trump’s 2016 campaign and Mandel invoking Trump when he promised last year “I'm not just going to drain the swamp, I'm going to blow up the swamp.”\nYet both espouse traditional Republican positions on foreign policy and, during a debate last month, advocated for more US involvement in the Russia-Ukraine conflict.",
    "In one week they gave Joe Biden $14 billion for Ukrainian aid.”\nTrump said that endorsing Vance was “not an easy” choice, as “I like and respect some of the other candidates in the race.” However, Vance has been lauded by Fox News host Tucker Carlson and backed by pro-Trump lawmakers such as Senator Josh Hawley (R-Missouri) and Representative Matt Gaetz (R-Florida), all of whom Trump’s most loyal voters hold in high regard.",
    "Predicting a Republican “landslide” in Ohio this November, Trump declared on Friday that “it is time for the entire MAGA movement, the greatest in the history of our country, to unite behind JD’s campaign because, unlike so many other pretenders and wannabes, he will put America First.”\n“In other words, JD Vance has my complete and total endorsement,” Trump concluded.",
    "The choice is likely to please the ex-president’s base but anger the GOP establishment\nFormer President Donald Trump has endorsed ‘Hillbilly Elegy’ author and upstart conservative JD Vance in Ohio’s crowded Republican primary for the US Senate.",
    "However, Vance himself was highly critical of then-candidate Trump, calling his policies “immoral and absurd,” and some of his voters “racists.”\n“Like a lot of people, I criticized Trump back in 2016,” he told Fox News last year.",
    "“And I ask folks not to judge me…I regret being wrong about the guy.”\nOn the eve of Trump’s endorsement, more than three dozen top Ohio Republicans sent a letter to the former president urging him to refrain from backing Vance.",
    "However, Trump declared his one-time critic “our best chance for victory in what could be a very tough race.”\nVance still faces an uphill struggle to clinch the GOP’s nomination.",
    "Vance was once a scathing critic of Trump but has since become a favorite among the former president’s base for his hardline stance on immigration and opposition to foreign wars.",
    "“I’m very distressed, frankly, that for four years Congressional Republicans refused to give Donald Trump $4 billion for a border wall,” he said during the debate.",
    "He was an incredible fighter for hard working Americans in the White House, he will be again, and I'll fight for the America First Agenda in the Senate.",
    "His book ‘Hillbilly Elegy’ became a bestseller in 2016 as liberal pundits struggled to understand the appeal of Trump to the white working class.",
    "Vance (@JDVance1) April 15, 2022\nVance is one of seven Republicans vying for a shot at the party’s nomination in Ohio this year.",
    "“$4 billion for a border wall when fentanyl was pouring into our country, killing our citizens by the tens of thousands.",
    "Polls taken before Trump’s endorsement put either Gibbons or Mandel in the lead, by between 1.7 and 7 points.",
    "Vance did not always bill himself as an “America First Conservative” though.",
    "Vance did not, and won the debate by a margin of two to one.",
    "I'm incredibly honored to have President Trump's support.",
    "Republicans in Ohio cast their votes on May 3.",
    "https://t.co/s3d3JhTgBC\n— J.D."
  ]
}