{
  "id": 623,
  "mediaId": 2518,
  "date": "2022-02-24",
  "headline": "OPINION | JOHN BRUMMETT: Clear Ukraine policy needed",
  "image": "https://wehco.media.clients.ellingtoncms.com/img/photos/2021/02/26/ADG_Columnists_5_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676",
  "link": "https://www.arkansasonline.com/news/2022/feb/24/clear-ukraine-policy-needed/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Brummett",
  "authorUrl": "https://www.arkansasonline.com/staff/john-brummett/",
  "termIds": [
    0
  ],
  "sentences": [
    "In the matter of Russia alone, never mind Vietnam or Afghanistan or weapons of mass destruction, consider these tidbits of recent American history:\n• In the late 1990s the Clinton administration supported expanding NATO eastward toward Russia in the new post-Soviet world.",
    "It did so even as its own defense secretary and others argued that we shouldn't do that because Russia was newly receptive to our overtures of friendship but only as long as we didn't rile the proud and paranoid old bear with signals of aggression.",
    "Vance said over the weekend that he didn't give a hoot about Ukraine and that we ought to worry about our own border and taking care of the working people's kids at home rather than sending them into danger on failed military missions.",
    "He has renewed America's devotion to its NATO allies, installing the United States again as the leader of a vital alliance of free and open Western democracies and cultures of great economic and military might.",
    "• In a presidential debate in the fall of 2012, Republican nominee Mitt Romney said, sure, there were more immediate menaces such as Iran and North Korea, but, in strict geopolitical terms, Russia was our No.",
    "Editorial & Opinion Updates\nGet award-winning commentary from our editorial page and team of local and national columnists, plus letters to the editor, political cartoons and more straight to your inbox.",
    "• In the summer of 2001, then-President George W. Bush, navigating his first year, declared after meeting Vladimir Putin that he had looked into the man's eyes and seen his soul.",
    "When retired Gen. Barry McCaffrey assailed him for such a view, calling him a stooge for Russian aggression, Vance imitated Trump's lack of respect for John McCain.",
    "Barack Obama's then-celebrated retort, the clincher in his \"winning\" that debate, was to tell Romney \"the 1980s called, and they want their foreign policy back.\"",
    "The question is whether the world is simply unmanageable or rendered that way by the blundering superficiality of American politicians, or both.",
    "Whatever the case, the right-wing cry that we can't trust our American government continues to be fueled by international-arena incompetence.",
    "• In the four misbegotten years of his presidency, Donald Trump was famously man-crushing on the manly little authoritarian that is Putin.",
    "But now he seems to have lost his mind to an appeal to Trump voters in pursuit of the Republican nomination for the U.S. Senate in Ohio.",
    "John Brummett, whose column appears regularly in the Arkansas Democrat-Gazette, is a member of the Arkansas Writers' Hall of Fame.",
    "It is to say that scheming thuggery at Putin's level requires more accomplished American political opposition than it has gotten.",
    "Maybe Putin indeed always has been straightforward in making it clear we should trust that a KGB man once is a KGB man forever.",
    "Otherwise, the United States risks becoming even more of an island of isolated resentment in the orbit of the egocentric Trump.",
    "It is not unreasonable to suggest that, if Trump were still president, our Ukraine policy would be to cheer Putin's romp.",
    "He replied that McCaffrey was mostly an expert in losing wars who perhaps stands to profit from the conflict in Ukraine.",
    "So, we're currently a country where a keyboard commando and a reality-show star ridicule war heroes for political gain.",
    "• Obama's flippant dismissal was supported at the time by Clinton's former secretary of state, Madeleine Albright.",
    "He actually is a decorated warrior who was an infantry commander in the winning war to boot Iraq from Kuwait.",
    "He imposed only some of those sanctions when Russia moved to occupy a couple of separatist areas in Ukraine.",
    "But Biden smartly saved further economic squeezes for later in the event of more widely Russian actions.",
    "He's the author of \"Hillbilly Elegy,\" a good book about policy abandonment of America's working class.",
    "As Putin advanced on Ukraine, Biden shared American intelligence with allies to keep them on board.",
    "It may be that that Joe Biden has played as well as he could the sloppy hand he was dealt.",
    "Hawkish Republican senators like Tom Cotton and Lindsey Graham faulted him for timidity.",
    "He promised to support allies in punishing economic sanctions on Russia if it invaded.",
    "Ukraine asked for NATO membership but has been denied the required unanimous support.",
    "Now Ukraine stands naked in the middle, yearning to the west and menaced on the east.",
    "She said hindsight proves we were in too big a rush to quit worrying about Russia.",
    "We had best hope Biden's leadership in this matter proves sound and successful.",
    "The problem was what happened when an American politician got something right.",
    "That movement has been advanced most starkly lately by, of all people, J.D.",
    "Clear, consistent and effective policy toward Ukraine would be a start.",
    "None of that is to blame any American politician for Putin's thuggery.",
    "Our short national attention span is the problem, I suspect.",
    "But she said the other day that she owed Romney an apology.",
    "He agreed to a summit only if Russia didn't invade.",
    "He said he found straightforward trustworthiness.",
    "He sent sophisticated weaponry to Ukraine.",
    "Email him at jbrummett@arkansasonline.com.",
    "He exposed Putin's feints and propaganda.",
    "Read his @johnbrummett Twitter feed.",
    "We need to stop being that.",
    "So, how did that turn out?",
    "The bear became riled.",
    "1 threat.",
    "Vance."
  ]
}