{
  "id": 659,
  "mediaId": 2810,
  "date": "2022-02-25",
  "headline": "Biden Has Chosen Ketanji Brown Jackson for a Reason",
  "image": "https://www.thenation.com/wp-content/uploads/2022/02/GettyImages-1232576319.jpg",
  "link": "https://www.thenation.com/article/politics/ketanji-brown-jackson-nominated/",
  "mediaOutlet": "The Beat",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elie Mystal",
  "authorUrl": "https://www.thenation.com/authors/elie-mystal/",
  "termIds": [
    5802,
    5699,
    5590,
    1708,
    4688,
    4905,
    4325,
    4306,
    2938,
    1434
  ],
  "sentences": [
    "Graham—a sniveling hypocrite who didn’t give Garland a hearing because he claimed we were too close to an election, promised to do the same should a Republican nominee be in the same situation, but was proven to be a liar when he held a hearing and confirmed Amy Coney Barrett during the election to replace the president who nominated her–can of course not be trusted to do anything other than what he’s ordered to do.",
    "Biden promised during the campaign that he would nominate a Black woman for the Supreme Court, and picking Jackson fulfills that commitment, but people should understand that Jackson would have been the most likely person to replace Breyer under any Democratic administration, no matter what the candidate said during the primaries.",
    "If you are a person of color or a white progressive who understands that a principal failure of justice in this country is the disparate penalties imposed on white and Black defendants, then you should know that there are few Supreme Court candidates with a better track record on this stuff than Jackson.",
    "Ketanji Brown Jackson during her hearing to become a US Circuit judge for the District of Columbia Circuit, April 28, 2021, in Washington, D.C. (Kevin Lamarque-Pool / Getty Images)\nJoe Biden has chosen Ketanji Brown Jackson to replace Stephen Breyer on the Supreme Court.",
    "And in Trump v. Thompson, just this past December, Jackson joined in an opinion ruling against Trump’s cockamamie attempt to use executive privilege to shield documents from the January 6 Congressional Committee, a ruling that was affirmed by the Supreme Court 8-1.",
    "She went back into private practice after that, but in 2010 she was picked by Obama to return to the Sentencing Commission as its vice chair, where she worked to implement amendments to the federal sentencing guidelines to reduce harsh sentences for drug crimes.",
    "After earning her JD, she clerked for a Bill Clinton–appointed judge on the US District Court, then for a Ronald Reagan–appointed judge on the US Court of Appeals for the First Circuit, before eventually clerking for Stephen Breyer himself on the Supreme Court.",
    "Moreover, if you are a “libertarian” who professes to find comity with the left when it comes to nonviolent drug offenses, it will again be hard to find a judicial candidate better positioned on that issue than Judge Jackson.",
    "It will be fun watching Senate Judiciary member and insurrectionist OnlyFan Josh Hawley question Jackson during her confirmation hearing: It’ll be like watching a bank robber question the bank’s new head of security.",
    "After this confirmation battle, they will still control the court 6-3, meaning this appointment does not affect their overall goals of destroying the rights of women, the LGBTQ community, people of color, or labor.",
    "In Committee on the Judiciary v. McGahn, Jackson ruled against former White House counsel Don McGahn’s scheme to evade a congressional subpoena for the testimony he gave to former special counsel Robert Mueller.",
    "If confirmed, Judge Jackson will be the first Black woman to serve on the nation’s highest court, only the fourth person of color, and the sixth woman among the 115 justices who’ve served throughout US history.",
    "White conservatives will make ugly and baseless attacks on her credentials and intelligence, and throw around whatever other muck passes for legal analysis on white-wing television these days.",
    "But make no mistake, the reason conservatives will be against Jackson (beyond their racism) is her rulings against the Trump administration and in favor of democratic self-government.",
    "Along the way, she scored big-time legal jobs at well-respected private law firms, and she could have easily had a comfortable life of getting rich while representing wealthy clients.",
    "Despite that, if I may risk making a prediction that will make me look like a sweet summer idiot if it all goes wrong, I do not expect Jackson’s confirmation hearing to be that hard.",
    "My question has been whether she’ll be the only new justice appointed by this administration, or if Biden will ever come around on reforming the court and getting her some more help.",
    "Tucker Carlson will warn that Black people mean to make slavery unconstitutional, then claim to have been joking when someone informs him that it’s unconstitutional already.",
    "I believe, and have believed since 2016, that Ketanji Brown Jackson will be the next associate justice of the Supreme Court of the United States appointed by a Democrat.",
    "But once those views have been sufficiently surfaced by Republican senators, there’s really no reason for them to draw continued attention to a nominee they can’t stop.",
    "The filibuster has already been removed for Supreme Court confirmations, so we don’t have to worry about Machinema’s justifications for unending minority white rule.",
    "But Jackson has been the front-runner for “the next” Democratic Supreme Court nominee for six years for reasons beyond her race, sex, and educational credentials.",
    "She joined the US Sentencing Commission, an independent federal agency aimed at addressing sentencing disparities and inconsistency throughout the system.",
    "Jackson is going to be more popular than inflation or gas prices or any number of other bad-faith fights Republicans can pick with this administration.",
    "Jackson was a superstar coming out of the well-known Miami Palmetto High School, where she was a debate champion and student body president.",
    "In Campaign for Accountability v. DOJ, Jackson ruled against another Trump administration gambit to shield documents from FOIA requests.",
    "Vance will feel threatened and worry that “hillbillies” with Yale Law degrees and venture-capital backing are being left behind.",
    "If confirmed, Jackson will come to the court with more public defense experience than any justice since Thurgood Marshall.",
    "And she was a “finalist” during the Obama administration for the nomination that eventually went to Merrick Garland.",
    "Moreover, there’s just no upside to the Republicans to have a prolonged, drawn-out hissy fit over the nomination.",
    "She is a boogeyman to the kind of Republican voter who can only handle Black women if they’re serving up syrup.",
    "Her qualifications are impeccable, her decisions are mainstream, and her demeanor is serious yet charismatic.",
    "For whatever reasons, the donors who control those two appear more concerned with policy than appointments.",
    "And in fact both of them have been fairly reliable when it comes to Biden’s judicial appointments so far.",
    "The Georgetown Constitutional Law Center will hold a symposium extolling the virtue of judicial eugenics.",
    "Her strength lies not in the immutable characteristics of who she is but in what she’s done.",
    "Yes, base Republican voters are fearful snowflakes who dislike women of color gaining power.",
    "Circuit that Judge Jackson has done justice upon the Trump administration and its cronies.",
    "Circuit, an appellate court long considered a “feeder” for future Supreme Court justices.",
    "All 50 Democrats voted for her, as did Susan Collins, Lisa Murkowski… and Lindsey Graham.",
    "The question is simply how racist Republican senators want to look between now and then.",
    "Jackson already received 53 votes from this very Senate when she was nominated in 2021.",
    "Obama nominated Jackson to the District Court for the District of Columbia in 2012.",
    "Remember, we’re talking about a high school student body president and debater.",
    "She was doing this work long before it was politically advantageous to do so.",
    "Jackson will be attacked by the worst white people this country has to offer.",
    "She can talk your socks off in a blizzard and make you think it’s your idea.",
    "The answer for some of them will be “very,” but probably not all of them.",
    "But there’s no objective reason for Collins or Murkowski to balk now.",
    "Not that I expect Jackson to receive a ton of conservative support.",
    "She left that work to spend two years as a federal public defender.",
    "And I think Joe Manchin and Kyrsten Sinema will stay the course.",
    "I think they’ll lodge their racialized complaints and move on.",
    "It was unlikely that she would be passed over a second time.",
    "She went on to Harvard College, and then Harvard Law School.",
    "Instead, she bounced between “Biglaw” and public service.",
    "Biden nominated her to the Court of Appeals for the D.C.",
    "Republicans control the court by a margin of 6-3.",
    "She’s a recent appointee to the D.C.",
    "And it’s on the D.C.",
    "Circuit in 2020.",
    "J.D."
  ]
}