{
  "id": 7086,
  "mediaId": 2512,
  "date": "2022-04-03",
  "headline": "MAGA Republicans hold 'emergency' meeting on how to sell opposition to intervention in Ukraine: report",
  "image": "https://www.alternet.org/media-library/image.jpg?id=23477905&width=1200&coordinates=0%2C66%2C0%2C67&height=600",
  "link": "https://www.alternet.org/2022/04/maga-republicans-hold-emergency-meeting/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.alternet.org/author/tom-boggioni",
  "termIds": [
    3618,
    2765,
    4591,
    4306,
    4884,
    392,
    1063,
    1126,
    6286,
    6672,
    6678
  ],
  "sentences": [
    "The young men, almost all of them soberly dressed in dark suits, and women, almost uniformly wearing dresses, listened attentively as one speaker after another warned about the perils of intervention for their very own lives,” adding “…as Putin’s deadly and unprovoked assault drags on, the GOP is also going to war — against itself.”\nAccording to Politico, there is a civil war brewing in the GOP between the Trumpian “America First” wing and mainstream Republicans who are joining with Democrats to assist and support the Ukrainian people.",
    "“Though Trump’s view of Putin may be little changed, the Russian invasion has broken open the uneasy marriage between the followers of Trump, who abhor foreign entanglements, and the hawks of the Republican Party, who have rarely seen a war they didn’t want to enter,’ the Politico report states before adding, “nothing provided a better window into the ideological ferment of the GOP — and the staying power of the Trump wing of the party — than the daylong conference at the Marriott Hotel.",
    "Quite the contrary.”\nReporting, “The participants generally described themselves as ‘realists’ and ‘restrainers,’ and the meeting featured what amounted to realist royalty — politicians and thinkers, ranging from GOP Sen. Rand Paul (Ky.) and Reps. Thomas Massie (Ky.), Dan Bishop (N.C.) and Matt Rosendale (Mont.)",
    "According to a report from Politico, Republicans allied with Donald Trump, and who want America to stay out of involvement in halting Russia’s invasion of Ukraine, held an “emergency” meeting to get their messaging straight as they battle members of their own party.",
    "As Heilbrun reports, “The event was the ‘Up From Chaos’ conference, a self-described “emergency” meeting organized by the Trumpian wing of the GOP to grapple with the political fallout from Russian President Vladimir Putin’s invasion of Ukraine.",
    "to Michael Anton, Sohrab Ahmari, Mollie Z. Hemingway, and, of course, Vance,” the report states before adding, “It was notable that at the conference, speaker after speaker targeted the GOP hawks more often than they spoke about Ukraine itself.",
    "Politico’s Jacob Heilbrun is reporting the meeting occurred on Thursday at the Marriott Marquis hotel in downtown Washington, attended by lawmakers like Sen. Rand Paul (R- KY), Rep. Tom Massie (R-KY) and aspiring Ohio senator J.D.",
    "Indeed, Kyiv itself was essentially MIA — serving more as a proxy for a dispute about America nationhood than about the country’s own fate as it’s mercilessly pummeled by Putin.”",
    "As Heilbrun notes, the anti-interventionists aren’t back down and are hoping to refine their pitch to the American public.",
    "Throughout, it became clear that the war on Ukraine is not prompting the Trump-aligned right to back down.",
    "Vance who have been very vocal about their opposition to U.S. intervention in Ukraine."
  ]
}