{
  "id": 7181,
  "mediaId": 2621,
  "date": "2022-04-08",
  "headline": "Tucker Carlson Asks Why Dads Aren’t Entering Classrooms to ‘Thrash’ Teachers Pushing ‘Sex Values’ on Kids",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-08-at-8.07.05-PM.png",
  "link": "https://www.mediaite.com/tv/tucker-carlson-asks-why-dads-arent-entering-classrooms-to-thrash-teachers-pushing-sex-values-on-kids/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kipp Jones",
  "authorUrl": "https://www.mediaite.com/author/kipp-jones/",
  "termIds": [
    1708,
    4905,
    4306,
    1126,
    514
  ],
  "sentences": [
    "What kind of country to want to live in – where families control what values their children grow up in, or where Joe Biden and the pharmaceutical companies get to do that?”\nCarlson reacted by asking why more fathers are not stepping into classrooms to intervene.",
    "Vance accused Democrats of “sexualizing” children, but concluded the issue is ultimately one of “parental rights.”\n“If you don’t want to be called a groomer, don’t try to sexualize six-, seven-year-old children.",
    "“So, one of the of the things we’re learning, Tucker, is that this is being forced by some of these really radical teachers, and they’re hiding it from the parents,” he said.",
    "Subscribe to\nTucker Carlson asked why angry fathers are not going into classrooms to “thrash” teachers who are sharing “sex values” with children.",
    "He equated efforts to share materials on gender and sex with children to “grooming” efforts.",
    "Where’s the pushback?”\nVance concluded teachers are hiding their sexual agenda from parents.",
    "He also went after organizations that make material for schools about sexuality and gender.",
    "Carlson claimed the Democratic Party is working with radical groups to undermine families.",
    "This is an agent of the government pushing someone else’s values on your kid about sex.",
    "During a discussion about school curriculum with Republican Ohio Senate candidate J.D.",
    "Vance, the Fox News host asked him his take on the topic of gender in the classroom.",
    "On Tucker Carlson Tonight, the host spent nearly 20 minutes covering sex education.",
    "‘That’s maybe the most pernicious part.”\nWatch above, via Fox News.",
    "“At that of the day, like you said, this is about parental rights.",
    "“Some teacher’s pushing sex values on your third grader.",
    "Why don’t you go in there and thrash the teacher?",
    "Like, where are the dads?” Carlson asked.",
    "“I don’t understand where then men are.",
    "It’s really that simple,” Vance said.",
    "Have a tip we should know?",
    "Want to avoid video ads?",
    "tips@mediaite.com"
  ]
}