{
  "id": 8,
  "mediaId": 8322,
  "date": "2022-02-22",
  "headline": "Mandel showcases service as U.S. Marine in Iraq in new ad blitz in Ohio’s GOP Senate battle",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/JoshMandel.png",
  "link": "https://www.foxnews.com/politics/ohio-senate-mandel-us-marine-in-iraq-ad",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    5581,
    2736,
    2765,
    2290,
    1480,
    1126,
    1489,
    6474,
    6067,
    5927
  ],
  "sentences": [
    "TIMKEN TAKES AIM AT HER MALE RIVALS IN OHIO'S COMBUSTIBLE GOP SENATE PRIAMRY\nAll four candidates for months have been making a full court press to earn the endorsement of former President Donald Trump, who remains very popular and influential with Republican voters in Ohio and across the country as he continues to play a kingmaker’s role in GOP primaries and repeatedly teases another White House run in 2024.",
    "NEW FIREWORKS OVER SUPPORT FOR TRUMP IN OHIO'S GOP SENATE PRIMARY\nMandel's campaign tells Fox News the commercial, which starts running on Wednesday, is the first in a large $2 million statewide ad blitz on broadcast and cable TV, and digital.",
    "With GOP primary field chock-full of wealthy contenders who are also backed by well-financed super PACs, nearly $20 million has been spent to date to run ads, according to figures from the national ad tracking firm AdImpact.",
    "Rob Portman not to make a full-court press to land Trump’s endorsement is state Sen. Matt Dolan, a former prosecutor whose family owns Major League Baseball’s Cleveland Guardians, formerly known as the Indians.",
    "Among his major rivals are Mike Gibbons, a Cleveland entrepreneur, real estate developer and investment banker who’s making his second bid for the Senate GOP nomination, former Ohio GOP chair Jane Timken, J.D.",
    "EXCLUSIVE – Republican Josh Mandel is launching his first major ad blitz in nearly a year in the crowded and combustible race to succeed retiring GOP Sen.",
    "Nearly all the ad spending, with just over two months still to go until Ohio's scheduled May 3 primary, has been on the Republican side.",
    "And the commercial includes a soundbite from Ben Adkins, who's described as Mandel's drill instructor, saying \"I know he’s prepared.",
    "Pro-Gun, Pro-Gun, Pro-Trump,\" says the narrator in a new ad by the Mandel campaign that was shared first on Tuesday with Fox News.",
    "A time when the fighter mentality and courage of a United States Marine are vitally needed in the U.S. Senate,\" the narrator says.",
    "THE AD WARS HEAT UP IN THE SENATE GOP PRIMARIES IN OHIO AND PENNSYLVANIA\n\"Now is such a challenging time for our nation.",
    "Mandel is one of the top contenders in a large field of Republican Senate candidates vying for their party's nomination.",
    "The ad spotlights the former Ohio treasurer and former two-time Senate candidate’s service in the U.S. Marines.",
    "Club for Growth Action, which is supporting Josh Mandel, has dished out more than $3 million to run ads.",
    "The only candidate among the leading GOP contenders in the race to succeed retiring GOP Sen.",
    "Vance, a hedge fund executive and the author of the best-selling memoir \"Hillbilly Elegy.\"",
    "The spot concludes with Mandel saying \"you want a fighter?",
    "Served two tours in Anbar Province.\"",
    "\"Josh Mandel is that Marine.",
    "Send in the Marine.\"",
    "Rob Portman of Ohio.",
    "He’s been tested.",
    "And he’s passed.\"",
    "\"Josh Mandel."
  ]
}