{
  "id": 805,
  "mediaId": 2688,
  "date": "2022-02-23",
  "headline": "Five Arguments The Far Right Has Marshaled To Defend Putin",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/02/candace-owens-MTG-tucker-carlson-defending-putin.jpg",
  "link": "https://talkingpointsmemo.com/fivepoints/far-right-defend-putin-russia-ukraine?utm_source=rss&utm_medium=rss&utm_campaign=far-right-defend-putin-russia-ukraine",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Cabrera",
  "authorUrl": "https://talkingpointsmemo.com/profile/cristina-cabrera",
  "termIds": [
    5507,
    4905,
    4591,
    3054,
    4267,
    1708,
    6569,
    6672,
    6678
  ],
  "sentences": [
    "“Was this whole thing an effort to take everybody’s attention away from what Hillary Clinton did and what we know to be a complete hoax over this Russia investigation?”\n“Anyone paying attention to Biden’s presser last week heard the sounds of the war-drums beating [as] the media desperately wants to get off the raging crime, raging COVID, raging inflation story that’s driven Biden to another new low in the polls today,” said Fox News host Laura Ingraham.",
    "“I have enormous respect for him,” Pompeo said on CSPAN, adding that “I consider him an elegantly sophisticated counterpart and one who is not reckless, but has always done the math.”\nThe reminiscences brought a smile to his face, particularly one episode where he says he told Putin that those pesky human rights abuses (poisonings of political enemies, what have you) made it darn hard for western leaders to get on his team.",
    "“Here’s a guy that says, you know, ‘I’m gonna declare a big portion of Ukraine independent’ — he used the word ‘independent’ — ‘and we’re gonna go out and we’re gonna go in and we’re gonna help keep peace,’” Trump said on a conservative radio show, marveling at the way in which Putin started his invasion.",
    "From the “deep state” crowd, it’s a contention that this whole crisis was somehow fabricated to distract people’s attention from the other failings of the Biden administration, and/or Hillary Clinton scandals that are hard to decipher without a steady diet of Fox News conspiracy theories.",
    "“I suggest every American who wants to know what’s *actually* going on in Russia and Ukraine, read this transcript of Putin’s address,” Fox News contributor Candace Owens tweeted, referring to a revisionist version of Russian and Ukrainian history that Putin delivered Monday.",
    "“I don’t believe Vladimir Putin would have a couple hundred thousand troops on the border of Ukraine had we not precipitously withdrawn from Afghanistan last August, but that’s where we are,” Senate Minority Leader Mitch McConnell (R-KY) said at a lunch in Kentucky.",
    "As war in Ukraine looks increasingly likely, the standard-bearers of the far right are tripping over themselves to express their admiration of Russian leader Vladimir Putin, and to otherwise defend his unprovoked menacing of the country.",
    "“We’re overly aggressive sometimes and NEED another bully on the world stage, to check our worst impulses.”\nIt’s a common thread — a conflation of United States’ past foreign adventurism and NATO expansion.",
    "Has he threatened to get me fired for disagreeing with him?”\nFurther examples included whether Putin had shipped American jobs to Russia, manufactured the pandemic, “snuffed out” Christianity or eaten dog.",
    "Astonishingly, that’s not true — the claim seems built from some mangled interpretation of one Ukrainian man donating money to the Clinton Foundation long before Clinton’s presidential bid.",
    "This camp contends that Putin’s motives, a seemingly amorphous mix of strongman ego, anti-NATO sentiment and desire to rewrite the end of the Cold War, are noble and justified.",
    "Rep. Marjorie Taylor Greene (R-GA), known the world over for her devotion to truth, wildly claimed that Ukraine was the “number one donor” to Hillary Clinton’s 2016 campaign.",
    "What’s threatening a war that would leave innocent people dead, after all, compared to the horrors of teaching American schoolchildren about the country’s racial history?",
    "On Monday, Putin ordered troops into breakaway regions of eastern Ukraine, prompting President Joe Biden to slap sanctions on Russian oligarchs and financial entities.",
    "“I got to be honest with you, I don’t really care what happens to Ukraine one way or the other.”\n“We have no dog in the Ukraine fight,” added Rep. Paul Gosar (R-AZ).",
    "“If Putin wants to throw some cold water on American expansionism and interventionism, for whatever reason, that’s a good thing,” former Trump campaign aide A.J.",
    "A popular refrain, employed by both GOP Russia hawks and those who defend Putin, is that Biden is weak, and it’s that weakness that prompted Putin to attack now.",
    "Some have enjoyed stitching that critique together with Russia’s 2014 invasion of Crimea to weave a narrative that former President Barack Obama was also weak.",
    "“First, Biden allowed China to walk into Afghanistan after thousands of our troops died there,” George Papadopoulos, former Trump campaign adviser, tweeted.",
    "“You gotta say that’s pretty savvy.”\nFox News host Tucker Carlson too has devoted many an hour of his primetime show to singing the praises of the autocrat.",
    "One of the more insidious talking points from this crew involves the various ways that Ukrainians are not so innocent, and thus not worth defending.",
    "Perhaps the performance most aglow with dewy-eyed respect for Putin came from Mike Pompeo — who, somewhat alarmingly, once ran the State Department.",
    "In a different, callous line of thinking, some far-right members simply contend that what happens to the Ukrainians is none of America’s concern.",
    "“He has fundamentally declared himself dictator and is waging war on innocent Canadian protesters and those who have supported them financially.”",
    "Send American troops to Canada to deal with the tyrannical reign of Justin Trudeau Castro,” tweeted Fox News contributor Candace Owens, sanely.",
    "“I think it’s ridiculous that we are focused on this border in Ukraine,” Hillbilly Elegy author-turned-Trumpist Senate candidate J.D.",
    "A couple dozen European Union members added on their own sanctions, and Biden threatened tougher ones should the invasion progress.",
    "“As I’ve said for months — NATO (under direction from the United States) is violating previous agreements and expanding eastward.",
    "I assure you [the] Russian military is no joke either.”\nBiden has maintained that no American troops will be deployed to Ukraine.",
    "WE are at fault.”\nThese far-right thought leaders harbor a real admiration for Putin, quick to praise his mind and personality.",
    "In this moment of high tension and stakes, here’s what the American right is contributing to the discourse.",
    "Many have also taken the opportunity to rehash old criticisms of Biden’s withdrawal from Afghanistan.",
    "It remains unclear if and how Putin will use the 150,000 Russian troops massed on Ukraine’s borders.",
    "If Ukrainians are in some way villainous, Putin’s violence is then not unprovoked, the logic goes.",
    "“He smiled at me with a look that reminded me it’s a tough world out there,” Pompeo chuckled.",
    "Shady Biden family business in both countries.”\nAh, the oldie but goodie.",
    "We’re coming for your maple syrup, your moose, your effusive apologies.",
    "To Trumpist Republicans, Hillary Clinton is the paragon of evil.",
    "For former President Donald Trump, it’s a yearslong love fest.",
    "“Was this a ruse?” Fox Business host Maria Bartiromo posited.",
    "We just lost Afghanistan to sandal-wearing goat herders.",
    "“The answer to all of them is no!” Carlson said.",
    "“Now, he’s allowing Putin to walk into Ukraine.",
    "Not one American bullet should be fired there.",
    "Any country that “supports” her must be too.",
    "“Not one American soldier should die there.",
    "“Why do I hate Putin?” Carlson mused.",
    "“Has Putin ever called me a racist?",
    "Get ready, brothers from the north.",
    "Ukraine is not a NATO member.",
    "But the implication is clear.",
    "“STOP talking about Russia.",
    "Maybe it’s even justified.",
    "Common denominator?",
    "Delgado tweeted.",
    "Vance said."
  ]
}