{
  "id": 8301,
  "mediaId": 8497,
  "date": "2022-04-05",
  "headline": "Full debate: GOP candidates face off in Ohio U.S. Senate Primary debate",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/primary-1649203001.jfif?crop=0.896xw:1.00xh;0.0529xw,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-u-s-senate-primary-debate-matt-dolan-mike-gibbons-josh-mandel-jane-timken-j-d-vance/39641549",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“This May 3, Hamilton County voters will be nominating candidates for statewide offices, U.S. Congress, County Commissioners, County Auditor, Clerk of Courts, and several judicial offices, as well as deciding ballot issues in several jurisdictions,” Sherry Poland, Director of the Hamilton County Board of Elections, said in a statement.",
    "There are three ways to cast your ballot in the May 3 Primary:\nVote by Mail\nEarly In-Person at the Board of Elections 4700 Smith Road\nIn-Person voting on election day at your polling location\nVoters may submit an application for a vote by mail ballot now.",
    "This means that during the May 3 primary, contests to nominate candidates for State Representative, State Senate, and State Central Committee will not appear on the ballot.",
    "While the candidates share similar viewpoints on topics like the second amendment, they differed from how they would address issues like gun violence.",
    "The GOP candidates shared their stances on topics including inflation, the war in Ukraine, gun violence and critical race theory.",
    "OXFORD, Ohio —\nFive candidates for the Ohio Republican nomination – Matt Dolan, Mike Gibbons, Josh Mandel, Jane Timken, and J.D.",
    "The Secretary of State has directed Boards of Elections to proceed with the May Primary despite ongoing disputes over the maps.",
    "We've profiled all of these candidates on why they're running and what they want to accomplish in the U.S. Senate.",
    "Applications may be downloaded from the board of elections website or requested by calling 513-632-7000.",
    "The first primary is May 3, the date for the other is still to be named, but will likely be in August.",
    "“We encourage voters to view their sample ballot on our website and make a plan to vote.\"",
    "Vance – took the stage Tuesday night for the final Ohio U.S. Senate Primary debate.",
    "Election day voting will take place from 6:30 a.m. to 7:30 p.m. on May 3, 2022.",
    "Voters will now be taking two trips to the polls to vote in the primary.",
    "Early In-Person Voting at the Board of Elections Office starts Tuesday.",
    "It's a result of the map-making mess involving redistricting in Ohio.",
    "You can also view the full debate on our Facebook and Youtube pages.",
    "To find a complete listing of early voting days/hours, click here.",
    "Early voting began Tuesday for the May 3 primary election.",
    "Commitment 2022: Matt Dolan campaigning for US Senate",
    "Watch the full debate in the player above.",
    "To find your polling location click here.",
    "Ballots will be mailed beginning April 5."
  ]
}