{
  "id": 853,
  "mediaId": 2693,
  "date": "2022-02-25",
  "headline": "The Bravery of the Ukrainian Defenders of Serpent Island Will Never Be Forgotten",
  "image": "https://149366087.v2.pressablecdn.com/wp-content/uploads/2022/02/shutterstock_1088907020-scaled-e1645819040142.jpg",
  "link": "https://spectator.org/the-bravery-of-the-ukrainian-defenders-of-serpent-island-will-never-be-forgotten/",
  "mediaOutlet": "The American Spectator",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "– Taras Shevchenko, Kobzar (1848)\nThe Ukrainian poet Leonid Pervomayskiy awoke one summer’s morning in 1941 only to discover that, as he wrote two harrowing years later in his essay “The History Teacher,” “the war stepped down from the history textbook and was marching through the roads of his motherland.” He promptly volunteered for the Red Army, though as the son of a bookbinder, and as a former librarian and journalist, he was perhaps fortunately placed not on active duty at the frontline, but rather assigned as a literary instructor for Front Radio.",
    "As Andrew Wilson put it in The Ukrainians: Unexpected Nation, the “Ukrainians have not always existed as a nation, they were ‘made’ or ‘invented’ in the same way as any other nation, but this construction began late and is still going on.” Ukraine’s construction was no doubt delayed by the tens of millions of souls who perished on its soil during the world wars, terror famines, and Stalinist political and cultural oppression of the 20th century, and the simmering and now boiled-over conflicts of our era.",
    "Readers familiar with Les Misérables will recall the admiration Victor Hugo expressed for the French Guard officer Cambronne who, when called upon to surrender as the battle of Waterloo turned into a rout, responded to his English counterpart with one contemptuous word: “Merde!” For Hugo,\nTo hurl such a verbal thunderbolt at the bombshells that are killing you is to be victorious.",
    "It constantly lies on my heart,\nWhen one thinks of Ukraine and its soil, one naturally thinks of the fertile tallgrass steppes and prairies, and the gentle hills that overlook the winding Dnipro, where the great poet and former serf Taras Shevchenko was laid to rest, or perhaps the sodden basin of the Polesie Marshes, or the craggy Crimean coastline.",
    "Like the Poles who rose up in 1830 and 1863, like the Czechs and Hungarians who rose up in the Spring of Nations, and in 1956, and in 1968, like the Estonians, Latvians, and Lithuanians who formed the Baltic Chain in 1989, the Ukrainians are shedding copious blood in pursuit of their national destiny.",
    "Russia’s ongoing invasion of its western neighbor is predicated on the notion that Ukraine is not a real country, that it is an artificial construct of the 20th century, and that it must paradoxically be “de-Nazified” and “de-communized” by absorption, in part or in whole, into a greater Russia.",
    "When the United States and its NATO partners refused to guarantee Ukraine’s sovereignty over its recognized borders, and structured its Russian sanctions to ensure the continuing flow of fossil fuels and aluminum for the greater good of the global economy, Ukraine’s die was effectively cast.",
    "Leonid Pervomayskiy had a motto, summarized by Yohanan Petrovsky-Shtern in his study The Anti-Imperial Choice — “to identify with the victimized, colonized, oppressed, and doomed.” Pervomayskiy was always “for the victims.” I completely understands the attitude of J.D.",
    "Vance et al., who understand that Ukraine’s territorial integrity is not a “kitchen table” issue for normal Americans, unlike, say, inflation, spiraling crime rates, a porous southern border, fentanyl overdoses, CRT in schools, pandemic-related restrictions, and so on.",
    "They were immediately declared Heroes of Ukraine, and though they fell in that wasteland at the edge of the monstrous Black Sea, beneath the gaze of a nauseated globe, to borrow Shevchenko’s immortal words, their titanic disdain still rings out for all to hear.",
    "Even more naively did it allow itself to be led by Western partners down what John Mearsheimer has called the “primrose path” to war with Russia, by partners who had no interest in standing by their ally when push came to violent shove.",
    "To overcome these repeated stillbirths, Ukraine will have to undergo the same struggles, and pass through the same fires, as its neighbors to the west did in their own national rebirths over the last several centuries.",
    "Otherwise, you will be bombed.”\n“Russian vessel — Go f**k yourself.”\nBombed, strafed, and attacked by ground forces, the garrison held out for hours, before every last man and woman lay dead on the field of battle.",
    "With the Red Army falling back in the face of Operation Barbarossa’s onslaught, Pervomayskiy was carried along with it, deeper into the Soviet Union, and beyond the borders of his beloved Ukrainian homeland.",
    "The Armed Forces of Ukraine cannot last for long against the behemoth with which they are locked in an existential struggle, but they can thumb their nose at disaster, and perhaps even have the last laugh.",
    "But that does not mean that we cannot be for the victims, and for the heroes, like those defenders of Serpent Isle who might still carry off the prize of history on behalf of their beleaguered homeland.",
    "But right now, I, like many others no doubt, am thinking of another small piece of Ukrainian earth — Ostriv Zmiinyi, or Serpent Island, an igneous rock formation set in the vastness of the Black Sea.",
    "To have this response to the catastrophe, to say this to destiny … to lose on the battlefield and carry off the prize of history, after this carnage to have the last laugh — this is tremendous.",
    "Their heroic sacrifice, and the sacrifice of the soldiers desperately battling against absurd odds for Sumy, Kharkiv, Antonov Airport, and elsewhere, is being made on behalf of something real.",
    "It was here, on the infamous day of February 24, 2022, that the thirteen Ukrainian border guards occupying the islet came under attack by two Russian vessels, the Vasily Bykov and the Moskva.",
    "But I could not throw back on the road\nFor memory, about the days of my youth\nThe land, where I grew up and matured,\nAbout my native steppe, rivers, and hills,\nOf my past … a piece of earth!",
    "III\nI, like many others no doubt, am thinking of another small piece of Ukrainian earth — Ostriv Zmiinyi, or Serpent Island, an igneous rock formation set in the vastness of the Black Sea.",
    "Ukrainian writers and historians have called this the rozstriliane vidrodzhennia, the “executed renaissance,” a national rebirth that was smothered in the cradle again and again.",
    "In his 1943 poem “A Small Piece of Your Earth,” the poet described how before he departed Ukrainian soil:\nI picked up a piece of earth on the road,\nWashed by the autumn rains.",
    "And like the Poles of the November and January Uprisings, like the Hungarians in 1956, no one is coming to the Ukrainians’ aid, not in any meaningful way.",
    "All of this is true, but if corruption and poor strategic decision-making serve to disqualify a country’s very existence, then we should all tremble.",
    "In the face of this extraordinary and undistinguished victory, in face of this victory with none victorious, this despairing man draws himself up.",
    "If Poland is the God’s Playground, then surely the Ukraine is the devil’s plaything, and political survival there is never straightforward.",
    "Naively did it give up its nuclear weapons in the aftermath of the collapse of the Soviet Union, trusting meaningless security guarantees.",
    "If corruption and poor strategic decision-making serve to disqualify a country’s very existence, then we should all tremble.",
    "And overwhelmed by numbers, by superior force and circumstance, he finds in his soul an expression: Merde!",
    "I propose that you lay down your arms and surrender, in order to avoid bloodshed and unnecessary victims.",
    "Before the assault, the following exchange, now rightly famous, took place:\n“I am a Russian warship.",
    "It is an explosion caused by excess of anguish … There is no one left to protest but this worm.",
    "the drowsy waves;\nAm I going to be trapped for long\nbut there’s no one else to ask.",
    "The country for which these men and women are fighting and dying is not perfect.",
    "The defenders of Serpent Island had the soul of Cambronne that day.",
    "To say that, to do that, to light on that, is to be the victor!",
    "Their sacrifice was not on behalf of an artificial construct.",
    "He suffers the enormity of it but he can see its emptiness.",
    "So he searches for a word as a man searches for a sword.",
    "We can still feel a rupture of disdain in our breasts.",
    "A spume rises within him, and this spume is the word.",
    "And Ukraine, of all countries, has excuses to spare.",
    "That is precisely what is happening before our eyes.",
    "The Verkhovna Rada is fractious and often farcical.",
    "It reaches the heights of Aeschylean grandeur.",
    "It is the rupturing of a breast with disdain.",
    "The defenders of Serpent Island refute this.",
    "It is thumbing your nose at disaster!",
    "Cambronne’s word is like a rupture.",
    "Like a poor heart drained of blood.",
    "The spume had risen within them.",
    "And he more than spits on it.",
    "I rushed to the trucks.",
    "Corruption is endemic.",
    "We can, and we should.",
    "The horn was called.",
    "He will protest.",
    "Slava Ukraini !",
    "We repeat it."
  ]
}