{
  "id": 9138,
  "mediaId": 2512,
  "date": "2022-03-29",
  "headline": "J.D. Vance attempts to defend Marjorie Taylor Greene’s recent appearance at a white nationalist conference",
  "image": "https://www.alternet.org/media-library/j-d-vance-debases-himself-before-trump-to-get-a-shot-at-the-senate.jpg?id=26922613&width=1200&coordinates=0%2C81%2C0%2C82&height=600",
  "link": "https://www.alternet.org/2022/03/j-d-vance-attempts-to-defend-mtj-s-recent-appearance-at-a-white-nationalist-conferene/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meaghan Ellis",
  "authorUrl": "https://www.alternet.org/author/meaghanellis",
  "termIds": [
    2503,
    4306,
    4267,
    4039,
    4066,
    1126,
    6279
  ],
  "sentences": [
    "During a recent candidate debate, he said, Greene “is my friend and she did nothing wrong.”\nHe added, \"I’m not going to throw her under the bus.”\nVance went on to voice his frustrations about another issue saying that \"while Republicans were subjected to 'guilt by association' attacks, Democrats were not.\"",
    "JD Vance from media darling to whatever this is in a few short yearshttps://twitter.com/lizskalka/status/1508594229542596615\\u00a0\\u2026\n— Molly Jong-Fast (@Molly Jong-Fast) 1648521452\nSo he is openly choosing association with a white nationalist guest speaker.",
    "A Republican Senate candidate in Ohio recently defended Rep. Marjorie Taylor Greene's decision to appear at a white nationalist event last month as he claimed, “She did nothing wrong.”\nAccording to HuffPost, J.D.",
    "Vance's remarks were made in reference to Greene's attendance at the America First Political Action Conference organized by far-right white nationalist, Nick Fuentes.",
    "In response to Greene's attendance, a number of high ranking Republican lawmakers have distanced themselves from her as they condemned their attendance.",
    "As Vance attempted to defend Greene, Twitter users quickly jumped to criticize him for his poor political choice to back the controversial lawmaker.",
    "Speaking about Rep. Paul Gosar's (R-Ariz.) attendance at the event, House Minority Leader Kevin McCarthy (R-Calif.) described it as \"appalling.\"",
    "“There’s no place in the Republican Party for white supremacists or anti-semitism,\" said Senate Minority Leader Mitch McConnell (R-Ky.).",
    "During the conference, Fuentes, per HuffPost, \"complained to the audience that the nation had forgotten 'young white men.'\"",
    "”Pete Buttigieg can take his electric vehicles and his bicycle, and he and his husband can stay out of our girls bathrooms.",
    "The outlet also noted that far-right attendees \"hailed Russian President Vladimir Putin as a hero and chanted his name.\"",
    "Vance's remarks follow Greene's recent homophobic tirade targeting U.S. Transportation Secretary Pete Buttigeig,.",
    "— Jeannette Webber (@Jeannette Webber) 1648516823\nThat may not be as appealing to Ohioans as he seems to believe.",
    "\"JD Vance from media darling to whatever this is in a few short years,\" one Twitter user wrote.",
    "Pushing back against both assessments, Vance argued otherwise.",
    "— Michael Raymond (@Michael Raymond) 1648520098",
    "“You know what?” Greene asked the the crowd.",
    "Always helps to know who someone really is.",
    "Yup.\""
  ]
}