{
  "id": 9335,
  "mediaId": 3987,
  "date": "2022-03-21",
  "headline": "Immigration Reform News March 21, 2022 / Qué Pasa En Inmigración",
  "image": "http://americasvoice.org/wp-content/uploads/2018/09/Immigration_News.jpg",
  "link": "https://americasvoice.org/blog/immigration-reform-news-march-21-2022/?utm_source=rss&utm_medium=rss&utm_campaign=immigration-reform-news-march-21-2022",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Agencia EFE",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "solicitan reubicar a inmigrantes de centro de Nuevo México por insalubridad\nMarch 18, 2022\nLos Angeles Times en Español Tres formas de cómo los hijos pueden pedir la residencia de los padres\nBy Selene Rivera\nMarch 18, 2022\nSan Diego Union Tribune Gobierno Biden pone fin a norma que amplió criterios de expulsiones expeditas\nBy Agencia EFE\nMarch 18, 2022\nTelemundo 62 Activistas: los rusos son rechazados en la frontera de EEUU mientras los ucranianos son admitidos\nBy AP\nMarch 19, 2022\nTelemundo 52 Controversia ante el trato “especial” de migrantes ucranianos vs. latinoamericanos\nBy Gilberto Dorrego y Fabiola Berriozábal\nMarch 18, 2022\nNoticias Telemundo Programa llena de esperanza a recién liberados del Centro de Detención de Adelanto\nBy Luis Zaragoza\nMarch 18, 2022\nUnivision Mentir en solicitud de asilo llevaría a perder cualquier otro beneficio migratorio en EEUU\nMarch 19, 2022\nSan Diego Union Tribune Presupuesto para 2022 incluye 8.3 millones para el proyecto del Museo Latino\nBy Agencia EFE\nMarch 19, 2022\nLa Opinión (CA) IRS: por qué hispanos deben pedir ayuda para presentar impuestos\nBy Agencia EFE\nMarch 20, 2022\nUnivision Informe revela “condiciones atroces” en una cárcel de ICE en Nuevo México\nBy Jorge Cancino\nMarch 20, 2022\nEl Latino Sal Diego San Diego se prepara para recibir mayor flujo de personas que buscan asilo\nBy Manuel Ocaño\nMarch 20, 2022\nNoticiero Univision Cerca de 200 migrantes atacan oficina de regulación migratoria en Tapachula, México, exigiendo visas humanitarias (Video)\nBy Sandra Argüelles\nMarch 19, 2022\nNoticiero Univision Tomados de la mano y con sus hijos a cuestas: duras imágenes de migrantes que intentan cruzar el Río Bravo para llegar a EEUU (Video)\nBy Sandra Argüelles\nMarch 20, 2022\nNoticiero Univision “Es emocionante estar aquí”: se gradúa el primer grupo de inmigrantes del programa Voces Resilientes en California (Video)\nBy Dulce Castellanos\nMarch 20, 2022\nNoticias Telemundo California asesora a inmigrantes recién liberados del centro de detención de Adelanto (Video)\nBy Enrique Chiabra\nMarch 18, 2022\nNoticias Telemundo Piedras Negras, la ciudad mexicana que registra cruces masivos de inmigrantes hacia EE.UU.",
    "By Greg Sargent\nMarch 18, 2022\nThe Hill Now is the time to rebuild America’s refugee resettlement program\nBy Christopher Richardson\nMarch 20, 2022\nForbes Paradigm Shift In Thinking Needed To Address New Immigration Challenges Worldwide\nBy Andy J. Semotiuk\nMarch 20, 2022\nHouston Chronicle Biden must stop using ‘public health’ excuse to immediately expel migrants\nBy Rebecca Hennes\nMarch 20, 2022\nNew York Daily News With immigration reform all but dead, here’s how Biden administration can still help deserving immigrants\nBy Allan Warnick\nMarch 18, 2022\nImpacto Latino Activistas piden fin al “racista” Título 42 de expulsión de inmigrantes\nMarch 17, 2022\nHola News Activistas piden fin al “racista” Título 42 de expulsión de inmigrantes\nMarch 17, 2022\nImpacto Media Activistas piden fin al «racista» Título 42 de expulsión de inmigrantes\nMarch 17, 2022\nEl Informador Activistas piden fin al «racista» Título 42 de expulsión de inmigrantes\nMarch 17, 2022\nThe Sun News Artistas de Seattle intentan la compra comunitaria del antiguo edificio de INS, hogar de más de 100 estudios\nBy Grace Gorenflo/The Seattle Times\nMarch 18, 2022\nUnivision Gobierno anuncia que pondrá fin a regla de Trump que amplió deportaciones aceleradas\nBy Jorge Cancino\nMarch 18, 2022\nHola News Médicos brindan información sobre vacunas contra covid-19 a detenidos del ICE\nBy Heidi de Marco\nMarch 20, 2022\nEl Diario-La Prensa (NY) Senado Estatal aprueba ley para expandir a más idiomas los programas disponibles para inmigrantes de Nueva York\nBy Edwin Martínez\nMarch 18, 2022\nAl Día (TX) Expanden Operación ‘Lone Star’ que detiene a inmigrantes por ‘invasión de propiedad’ en Texas\nBy María Ramos Pacheco\nMarch 20, 2022\nNoticias YA Anuncian nuevos detalles sobre la reapertura de oficinas de inmigración\nBy Heder Casas\nMarch 18, 2022\nRadio Bilingüe Doctores ofrecen salvavidas telefónico a migrantes internos en riesgo de Covid\nMarch 18, 2022\nEl Diario-La Prensa (NY) Autoridades migratorias de EE.UU.",
    "By Camilo Montoya-Galvez\nMarch 18, 2022\nThe New Republic The Democrats Are Caught in a Policy Doom Loop\nBy Grace Segers\nMarch 18, 2022\nAssociated Press Federal report finds unsafe conditions in New Mexico migrant jail\nBy Ben Fox\nMarch 18, 2022\nWashington Post Inspector general, ICE clash over conditions at immigration detention facility in New Mexico\nBy Maria Sacchetti\nMarch 18, 2022\nThe Hill DHS watchdog, in rare move, wants detainees immediately removed from New Mexico facility\nBy Rebecca Beitsch\nMarch 18, 2022\nRoll Call Watchdog urges removal of ICE detainees amid ‘safety risks’\nBy Caroline Simon\nMarch 18, 2022\nCBS News Watchdog recommends relocation of detainees from ICE facility, citing unsanitary conditions and staff shortages\nBy Camilo Montoya-Galvez\nMarch 18, 2022\nCBS 8 Number of Ukrainian refugees increasing at Tijuana border\nBy David Gotfredson\nMarch 19, 2022\nReuters Over 2 mln Ukrainian refugees have entered Poland, border guard says\nMarch 19, 2022\nNew York Times Ukrainians Are Trickling Into the U.S. to Warm Welcomes\nBy Miriam Jordan\nMarch 19, 2022\nAxios UN: 10 million Ukrainians have fled their homes since invasion began\nBy Rebecca Falconer\nMarch 20, 2022\nBoomberg Ukraine War Refugees Find Visa Nightmare Blocking Path to U.S.\nBy John Holland and Courtney Rozen\nMarch 18, 2022\nDaily Beast Ukrainians Deserve Special Treatment at the U.S. Border Right Now\nBy Ruben Navarrette Jr\nMarch 21, 2022\nWashington Post Why is J.D.",
    "Delivering on Immigration Part of Recipe for How Democrats Can Appeal to Latino Voters in AZ and NV\nWashington Post Building on anti-mask activism, far-right groups pivot from mandates to midterms\nBy Hannah Allam\nMarch 19, 2022\nNew York Times What to Watch as Jackson’s Supreme Court Confirmation Hearings Begin\nBy Carl Hulse\nMarch 21, 2022\nPolitico The new midterm math: How redistricting, Biden and Trump shaped the battle for the House\nBy Ally Mutnick\nMarch 21, 2022\nPolitico Dems begin building a Latino vote firewall in the West\nBy Sabrina Rodriguez\nMarch 21, 2022\nReuters DHS withdraws Trump-era rule that expanded quick deportations\nBy Daniel Wiessner\nMarch 19, 2022\nThe Hill Title 42 anniversary marks headaches for Biden, stalemate with lawmakers\nBy Rafael Bernal and Rebecca Beitsch\nMarch 20, 2022\nCBS News What is Title 42, the COVID-19 border policy Democrats want Biden to end?",
    "(Video)\nMarch 19, 2022\nNoticias Telemundo “¡Queremos la visa!”: migrantes frustrados destrozan oficinas de Inmigración en México (Video)\nMarch 19, 2022\nCNN en Español Aumentan los migrantes haitianos que llegan a Florida en embarcaciones\nBy Ana María Mejía\nMarch 18, 2022\nLa Opinión (CA) EE.UU.",
    "mantiene “la frontera cerrada” para migrantes pese a cambio de enfoque\nMarch 18, 2022\nLa Opinión (CA) Demócratas del Congreso de Nuevo México condenan las condiciones inhumanas del centro de detenidos de ICE\nBy Marlyn Montilla\nMarch 19, 2022",
    "Vance getting canceled by his fellow Republicans?"
  ]
}