{
  "id": 9598,
  "mediaId": 2548,
  "date": "2022-03-19",
  "headline": "‘Watch What Happens, P*ssy’: Ohio GOP Senate Candidate Gets In His Opponent’s Face With Threats At Debate",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/03/IMG-6360-e1647663380992.jpg",
  "link": "https://dailycaller.com/2022/03/19/watch-what-happens-ohio-gop-senate-candidate-opponent-face-threats-debate/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Silverio",
  "authorUrl": "https://dailycaller.com/author/nicole.dcnf@gmail.com",
  "termIds": [
    2290,
    4729,
    1489,
    1126,
    980,
    976,
    6246,
    6474
  ],
  "sentences": [
    "While Ohians are struggling to make ends meet in Joe Biden’s America, Mike Gibbons spent his entire career profiting by shipping jobs overseas and investing in places like China and Russia.”\nRecent polling found Gibbon holding a slight lead in the Senate race, with Mandel trailing him by a few percentage points.",
    "#OHSen pic.twitter.com/xLgdca7gxR\n— Mike Gibbons (@MikeGibbonsOH) March 18, 2022\n“Mike Gibbons got upset tonight that he was called out for his investments in Chinese oil,” Scott Guthrie, Mandel’s campaign manager, said in statement obtained by the Daily Caller.",
    "Tensions boiled over as Republican Ohio senate candidate Josh Mandel jumped up from his seat and made threatening remarks to his opponent, Mike Gibbons, at the Ohio Republican U.S. Senate Candidate Forum on Friday.",
    "The candidate began to sit down when Gibbons repeated, “You don’t know squat.” (RELATED: New Ohio Senate Poll Shows More Bad News For JD Vance)\n“Two tours in Iraq, don’t tell me I haven’t worked,” Mandel repeated.",
    "“He claims not to remember the investment, but it’s part of a pattern of Gibbon’s entire career making money by taking American companies and selling them to foreign interests.",
    "We need an adult in the room and Josh Mandel has proven that he is not capable of being that for Ohioans.”\nJosh Mandel is unhinged, unfit, and flailing – because he’s losing.",
    "The candidates argued over Mandel’s accusations that his opponent “made millions” off of Chinese petroleum stock, which Gibbons denied.",
    "“You may not understand this because you’ve never worked in the private sector in your entire life,” Gibbons exclaimed.",
    "The exchange immediately escalated as Mandel rushed out of his seat and angrily stood directly in Gibbons’ face.",
    "We need an adult in the room and Josh Mandel has proven that he is not capable of being that for Ohioans.",
    "Gibbons holds an average of 20%, Mandel with 16%, Vance with 13% and Jane Timken with 9% as of March 9.",
    "“Josh Mandel is an unhinged, unfit, and flailing — because he’s losing,” Gibbons said in a statement.",
    "The moderator quickly interfered to ease tensions by directing Mandel back to his seat.",
    "Vance called the exchange ridiculous and told his two opponents to sit down.",
    "“Two tours in Iraq, don’t tell me I haven’t worked,” Mandel yelled.",
    "“We can’t leave this race to child-like candidates.",
    "We can’t leave this race to child-like candidates.",
    "“You don’t know squat,” Gibbons retaliated.",
    "You watch what happens.”\nCandidate J.D.",
    "You’re dealing with the wrong guy.",
    "You watch what happens, p*ssy.",
    "“You back off.",
    "Watch, watch."
  ]
}