{
  "id": 2385,
  "mediaId": 367,
  "date": "2/24/2022 12:00:00 AM",
  "headline": "'Voters don't know where he's at': Tom Nelson turns sights on Democratic rival Mandela Barnes in U.S. Senate race",
  "image": "https://www.gannett-cdn.com/presto/2022/02/24/PMJS/9e93b2cd-fc99-40ab-aeed-0914c64aff2e-barnes_nelson.jpg?width=660&height=415&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/politics/elections/2022/02/24/tom-nelson-criticizes-mandela-barnes-democratic-u-s-senate-race/6912725001/",
  "sentiment": "-0.889",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Glauber",
  "authorUrl": "https://www.jsonline.com/staff/2646086001/bill-glauber/",
  "termIds": [
    741,
    802,
    1568,
    1925,
    2039,
    146,
    318,
    600,
    2855
  ],
  "sentences": [
    "Mandela is the only candidate in the race who can beat Ron Johnson  and that's who he is running against.?\nBarnes has recently distanced himself from the Abolish ICE and defund police movements, despite past social media comments on those issues and support from groups that favor those left-wing proposals.",
    "Nelson's move to shake up the race comes as Democrats prepare for two candidate forums  a Thursday night event for students and faculty only and held by the University of Wisconsin-Madison College Democrats, and a Friday night virtual event with Our Wisconsin Revolution.",
    "A small business policy paper released this week by his campaign said Barnes supported \"building a path to Medicare for All, allowing the federal government to negotiate lower drug prices, and lowering the Medicare age of eligibility to 50.\"",
    "Nelson said it was important for Democrats to have a healthy exchange of ideas during the primary as the winner heads to a nationally watched general election race against Johnson, with potential control of the U.S. Senate on the line.",
    "Nelson is trying to provide a contrast in the race against top contenders Barnes, state Treasurer Sarah Godlewski and Alex Lasry, on leave from his executive job with the Milwaukee Bucks.",
    "More:Gillian Battino expected to leave Democratic U.S. Senate race and announce run for state treasurer\nOn several occasions, Nelson took to Twitter to chide Lasry over economic issues.",
    "Nelson said as lieutenant governor Barnes \"has been talking about how Medicare for All is important, the Green New Deal is important, now you can't get him to say those words.",
    "Nelson, who called himself \"the progressive candidate\" in his interview with the Young Turks, has taken stands against cashless bail, abolishing ICE and defunding the police.",
    "The Barnes campaign fended off the attack, claiming the candidate hasn't changed his positions and has firmly embraced the issues of Medicare for All and the Green New Deal.",
    "Mandela Barnes has always been clear about what he stands for and about his vision for Wisconsin,\" said Maddy McDaniel, communications director for the Barnes campaign.",
    "For more than a year, Democrats running for U.S. Senate have concentrated their verbal fire on Republican U.S. Sen. Ron Johnson.",
    "\"He's inconsistent, he's changing his positions,\" Nelson said of Barnes in an interview with the Milwaukee Journal Sentinel.",
    "But this week, Outagamie County Executive Tom Nelson turned his sights on the perceived Democratic front runner, Lt. Gov.",
    "On Wednesday, Nelson tweeted a portion of an interview he gave last week with the liberal commentators The Young Turks.",
    "\"You need to have a candidate who's consistent, who exercises judgment, someone who you know where they stand.\"",
    "\"That's why he continues to out-raise, out-poll, and out-organize every other candidate in this race.",
    "\"He seemed like he was for defunding the police and now he says he's not for defunding the police.",
    "He also Tweeted a chart to make comparisons with the other candidates on issues and experience.",
    "\"Democrats have got to get this election right because it is for all the marbles,\" he said.",
    "Barnes' campaign, however, maintains he has been consistent in those positions.",
    "Nelson claimed that Barnes has flip-flopped on several key positions.",
    "He wanted to abolish ICE, now he doesn't want to.",
    "I think he's entirely confused,\" Nelson said.",
    "He has also backed the Green New Deal.",
    "\"Voters don't know where he's at.\"",
    "I think he's confused.",
    "Mandela Barnes."
  ]
}