{
  "id": 2392,
  "mediaId": 21,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Democratic candidates blast Biden and Pelosi for not pushing Congress to pass a stock trade ban for lawmakers: 'Get in the ring!'",
  "image": "https://i.insider.com/61fd6840bd5041001918c604?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/stock-ban-congress-biden-pelosi-democrats-tom-nelson-wisconsin-2022-2",
  "sentiment": "-0.827",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Levinthal",
  "authorUrl": "https://www.businessinsider.com/author/dave-levinthal",
  "termIds": [
    781,
    815,
    1335,
    1568,
    1609,
    1896,
    2087,
    2280,
    118,
    142,
    145,
    146,
    183,
    337,
    427,
    428,
    545,
    571
  ],
  "sentences": [
    "Nelson, the county's elected executive, is particularly bamboozled by President Joe Biden's unwillingness to back any of the several bipartisan plans to have emerged or re-emerged since Insider's \"Conflicted Congress\" project in December revealed numerous financial conflicts of interest and widespread violations of the Stop Trading on Congressional Knowledge Act of 2012, a law designed to prevent them.",
    "They join an improbable and growing coalition of federal lawmakers on the left  Democratic Rep. Alexandria Ocasio-Cortez and Sen. Elizabeth Warren  and the right  House Minority Leader Kevin McCarthy and Sen. John Hawley  who've signaled their support for banning their colleagues from trading stocks.",
    "Democratic leaders must understand that they're at significant risk of losing majorities in the US House and US Senate during the 2022 midterms if they don't spearhead \"common sense\" efforts to bolster the public's trust in government, such as stock trade bans, Nelson said.",
    "Out in Outagamie County, Wisconsin, two flights and a lengthy Lyft ride from Capitol Hill, US Senate candidate Tom Nelson follows events in Washington with disbelief as leaders of his own Democratic Party resist banning members of Congress from buying and selling stock.",
    "US Senate candidate John Fetterman in Pennsylvania said Wednesday that \"there isn't any voter I've ever spoken to that says, 'yes, we should allow members of Congress to either protect their investments or make money based off the information they come in contact to.\"",
    "Sen. Sherrod Brown and Rep. Tim Ryan, both Ohio Democrats, as well as Ocasio-Cortez and Rep. Abigail Spanberger, a Virginia Democrat, have recently featured their support for congressional stock trade bans in their campaign fundraising messaging.",
    "Pelosi's endorsement of lawmakers' right to trade individual stocks, followed recently by a reluctant course change, is particularly vexing because it cuts against what most Democrats want Congress to do, Nelson added, citing recent polls.",
    "Gage Skidmore via Creative Commons/Wikimedia Commons\nRepublicans embrace a congressional stock ban\nRepublican US Senate candidate Blake Masters in Arizona, for one, is already attempting to outflank Democrats by embracing a stock ban.",
    "Even former President Donald Trump, arguably the most financially conflicted president in US history, has chimed in, saying in January that members of Congress trading individual stocks is \"not right  not appropriate.\"",
    "Both Buttar and Nelson said they're at least mildly encouraged that Pelosi, increasingly squeezed by both liberals and conservatives, said she won't block stock ban bills from coursing through the legislative process.",
    "In Pelosi's own California congressional district, Democratic socialist Shahid Buttar is hammering the House speaker on her stock ban reluctance as part of his longshot attempt to upend her in in the 2022 midterms.",
    "He, too, has panned Pelosi  one of the wealthiest members of Congress whose venture capitalist husband, Paul Pelosi, frequently trades stocks and stock options  as a poster politician for congressional corruption.",
    "But it'll take all Democratic leaders offering wholehearted support of such a ban  up to and including Biden  to give left-of-center candidates across the country proper political cover during the 2022 midterms.",
    "US Senate candidate Tom Nelson, a Democrat from Wisconsin, says party leaders in Washington are hurting congressional hopefuls like him by not embracing a ban on lawmakers trading stocks.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "US Senate candidate Lucas Kunce in Missouri not only wants to ban members of Congress from trading stocks, but he also wants to toss them in jail if they don't comply.",
    "He can't lead from behind,\" said Nelson, who's running in a crowded Democratic primary for a shot at challenging two-term incumbent Sen. Ron Johnson, a Republican.",
    "\"That preference, and Pelosi's history of putting her stock portfolio before the public interest, violate the oath of office and demand accountability,\" he said.",
    "Democratic leaders' resistance to a congressional stock trade ban, Buttar told Insider, reveals their willingness to \"prioritize capitalism over democracy.",
    "Tom Williams/CQ Roll Call/Getty Images\nDemocrats against a congressional stock trade ban are hurting flyover country candidates, they say.",
    "Nelson's outrage is shared by a growing number of Democratic congressional candidates who don't work in Washington, DC, but want to.",
    "\"Members of Congress have access to highly confidential information that the public does not,\" Ryan's campaign wrote in January.",
    "It's dangerous because we're in a very challenging environment for Democrats, we're in the midterm, and our party is in power.",
    "That includes Speaker Nancy Pelosi, House Majority Leader Steny Hoyer, and Senate Majority Leader Chuck Schumer, he said.",
    "GOP Senate candidate Blake Masters in Arizona has called on Congress to ban its members from trading individual stocks.",
    "It's also given fuel to TikTokkers and Twitter accounts that religiously track and meme the speaker's trading.",
    "Biden wants Congress to \"determine what the rules should be,\" White House press secretary Jen Psaki said.",
    "They argue it's both bad politics and bad policy as Democrats try to hold on to their majorities.",
    "\"But this is still legal thanks to politicians who only look out for their own bottom line.\"",
    "Some Republicans are attempting to outflank Democrats by touting stock trade restrictions.",
    "\"We can't have stupid decisions coming out of Washington if we want to win,\" Nelson said.",
    "And they're making a congressional stock ban a thick plank in their campaign platforms.",
    "Comedians at The Onion and The Daily Show have meanwhile made Pelosi a punchline.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "\"Speaker Pelosi should be leading, Sen. Schumer should be leading.",
    "This is not only good policy, it's good politics,\" Nelson said.",
    "But Nelson said it's \"a bad mistake\" for Biden to sit it out.",
    "There's very little room for error  This is a blunder.\"",
    "I'm concerned that he's not embracing this issue.\"",
    "Stay up to date with what you want to know.",
    "\"Democrats need a win  we need a big win.",
    "Sign up for notifications from Insider!",
    "\"He's got to get in the ring.",
    "Loading Something is loading.",
    "\"But they're out of touch.",
    "And that's dangerous."
  ]
}