{
  "id": 2741,
  "mediaId": 2679,
  "date": "2022-03-19",
  "headline": "Champion Rams re-sign kick returner Brandon Powell",
  "image": "",
  "link": "https://www.seattletimes.com/sports/champion-rams-re-sign-kick-returner-brandon-powell/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "https://www.seattletimes.com/author/the-associated-press/",
  "termIds": [
    1391,
    2493,
    3162,
    570,
    4887,
    5104
  ],
  "sentences": [
    "The Rams on Saturday announced the return of Powell, who joined their practice squad midway through the regular season before playing a major role in the turnaround of their special teams on the way to the Super Bowl championship.",
    "Los Angeles lacked a solid kick returner early in the season, but Powell made a series of big plays while returning kicks and punts down the stretch, including a 61-yard punt return for a touchdown against Minnesota.",
    "The Rams kept offensive linemen Brian Allen and Joseph Noteboom, but have already lost Von Miller, Darious Williams, Sebastian Joseph-Day, Austin Corbett, Ogbo Okoronkwo and Johnny Mundt.",
    "The Rams said after the season that they hoped to keep the injured Beckham, but they also signed veteran receiver Allen Robinson to a three-year deal this week.",
    "After the Rams finally signed him permanently to the active roster in early January, he returned nine punts and five kickoffs in the Rams’ four playoff games.",
    "THOUSAND OAKS, Calif (AP) — Kick returner and receiver Brandon Powell has re-signed with the Los Angeles Rams on a one-year deal.",
    "Powell is only the third of Los Angeles’ 13 unrestricted free agents to re-sign with the champs.",
    "___\nMore AP NFL: https://apnews.com/hub/NFL and https://twitter.com/AP_NFL\n The Associated Press",
    "Odell Beckham Jr. is among Los Angeles’ four remaining unsigned unrestricted free agents."
  ]
}