{
  "id": 2826,
  "mediaId": 2707,
  "date": "2022-03-16",
  "headline": "Rams lose Von Miller after Bills come with cash",
  "image": "https://www.ocregister.com/wp-content/uploads/2022/03/LDN-L-SUPER-BOWL-LVI-0241-KB112-1.jpg?w=1024&h=706",
  "link": "https://www.ocregister.com/2022/03/16/rams-lose-free-agent-cb-darious-williams-to-jaguars/",
  "mediaOutlet": "The Orange County Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Modesti",
  "authorUrl": "https://www.ocregister.com/author/kevin-modesti/",
  "termIds": [
    1391,
    1817,
    3234,
    3440,
    3815,
    4468,
    160,
    184,
    308,
    570
  ],
  "sentences": [
    "Much love & respect @JHekker https://t.co/Ybae557keU\n— Jalen Ramsey (@jalenramsey) March 15, 2022\nHekker, 32, who played 10 years with the Rams after being signed as an undrafted rookie from Oregon State, might have seen this coming after his punting average slipped for the second season in a row to a career-low 44.2 yards in the 2021 regular season.",
    "Williams and Miller were the fourth and fifth free agents and second and third regular starters to leave this week, after starting right guard Austin Corbett agreed to sign with the Panthers, nose tackle Sebastian Joseph-Day agreed to terms with the Chargers, and outside linebacker Ogbonnia Okoronkwo reached a deal with the Texans.",
    "Is (uniform number) 40 open?”\nThe Rams knew Miller wouldn’t come cheap after seeing the new contracts for outside linebackers Chandler Jones (three years, $52.5 million to go from the Cardinals to the Raiders), Randy Gregory (five, $70 million, Cowboys to Broncos) and Haason Reddick (three, $45 million, Panthers to Eagles).",
    "Since Monday, when teams could start negotiating with other teams’ free agents, the Rams have not announced any acquisitions, while they’ve re-signed tackle Joe Noteboom – groomed as retiring left tackle Andrew Whitworth’s successor – and center Brian Allen and guard-center Coleman Shelton.",
    "The NFL leader in career sacks among active players, Miller will remain third among outside linebackers in total contract value, behind Chargers Khalil Mack and Joey Bosa, and fourth in average salary behind the Steelers’ T.J. Watt, Bosa and Mack.",
    "The Rams announced Wednesday evening that they released Johnny Hekker, the longest-serving member of their roster, one of last four holdovers from the St. Louis days, and as popular with teammates and fans as a punter could be.",
    "Miller exited Wednesday as dramatically as he had entered last fall, agreeing to sign with the Buffalo Bills for a six-year contract worth $120 million, with $51.4 million of it guaranteed, according to national reports.",
    "He went into training camp last summer with competition from Corey Bojorquez, and feared he was on the way out after Bojorquez had a sensational preseason finale in Denver while Hekker sat home with COVID-19.",
    "As it turned out, Miller will do better than any of them, getting a slight raise in salary from about $19 million on his expiring, six-year contract with the Broncos, to $20 million a year with the Bills.",
    "His ability to play inside and outside cornerback positions was credited for freeing Jalen Ramsey, the All Pro cornerback on the other side of the field, to take advantage of his own versatility.",
    "In another important departure, free-agent Rams cornerback Darious Williams was expected to sign a three-year contract worth $30 million with the Jacksonville Jaguars, national reports said.",
    "Williams, 28, led the Rams in tackles (eight) in their Super Bowl victory over the Bengals, and led the team in interceptions (four) in the 2020 season before failing to record one in 2021.",
    "They would get a seventh-round draft pick for Howard, an exclusive-rights free agent, and a fifth-rounder for Gay, a restricted free agent, if another team signed either to an offer sheet.",
    "The three-time NFL defensive player of the year is, if anything, underpaid as the sixth-highest-salaried defensive player at $22.5 million a year on a current deal that runs through 2024.",
    "Ramsey reacted to reports that Hekker would be released with an appreciative tweet Wednesday morning: “Dang … one of the best teammates you could have forreal too.",
    "Unloading the final two years of Hekker’s contract, which paid an average of $3,762,943 for five years, saves the Rams about $2 million against the NFL salary cap.",
    "Although it’s hard to take this too seriously from a 30-year-old, Donald has indicated he could walk away from football if Miller and Beckham weren’t re-signed.",
    "The day’s two big moves left wide receiver Odell Beckham Jr. as the last free agent for the Rams to try to re-sign among their Super Bowl starters.",
    "In other moves Wednesday, the Rams announced they had placed $2.54 million original-round tenders on linebacker Travin Howard and kicker Matt Gay.",
    "The retirement of Whitworth the day before had saved the Rams $16 million as they moved to get under the cap by the deadline at 1 p.m. Wednesday.",
    "Those names notably did not include restricted free agent Troy Reeder, the undrafted linebacker who started 25 games over the past three years.",
    "For Williams, a Jacksonville native who played at the University of Alabama at Birmingham, the Jaguars contract is a reward for perseverance.",
    "Assuming Reeder isn’t with the Rams next season, Howard could be the front-runner to start with Ernest Jones at inside linebacker.",
    "One question now is how much the Rams will have to pay to make defensive tackle Aaron Donald happy with a contract extension.",
    "Speaking in a video he posted on Instagram, Miller indicated the Rams were in the running to re-sign him until the end.",
    "Wednesday at 1 p.m. marked the start of the period in which teams can officially complete signings and trades.",
    "Too big for the Rams, even as much as they wanted to keep all the stars of their Super Bowl championship run.",
    "Unless the Rams acquire a cornerback, the likely replacements for Williams are Robert Rochell and David Long.",
    "Meanwhile, for the second consecutive day, the Rams said goodbye to a pillar of their championship team.",
    "He was undrafted in 2018, signed but waived by the Ravens and soon released, and picked up by the Rams.",
    "Williams worked his way up the depth chart to become a fixture at cornerback the past two seasons.",
    "Much love & respect @JHekker”\nDang … one of the best teammates you could have forreal too.",
    "But the Rams traded Bojorquez to the Packers and kept Hekker, the highest-paid NFL punter.",
    "All of those numbers are big for an outside linebacker who will turn 33 on March 26.",
    "Long enough for Von Miller to record nine sacks in eight games.",
    "Maybe he’ll see that the Rams couldn’t pay both Miller and him.",
    "It had to be the best three-month career in Rams history.",
    "But I just wanted to let you know I’m coming to Buffalo.",
    "“It’s been crazy man, crazy four hours,” Miller said.",
    "Long enough to help the Rams to a Super Bowl victory.",
    "Not long enough to put down roots in Los Angeles.",
    "A lot of things that I love in L.A.",
    "“Going back and forth, man.",
    "Bills Mafia, what’s good?"
  ]
}