{
  "id": 2851,
  "mediaId": 2605,
  "date": "2022-03-14",
  "headline": "Rams agree to deals to keep offensive linemen Joe Noteboom, Brian Allen",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/4e6cc39/2147483647/strip/true/crop/2457x1290+0+179/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F69%2Fae%2F1de099694414a389b94fa20ee4f7%2Fla-photos-1staff-905576-la-sp-nfc-divisional-rams-bucs-30-gmf.jpg",
  "link": "https://www.latimes.com/sports/rams/story/2022-03-14/rams-re-sign-joe-noteboom-to-a-three-year-contract",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "As NFL teams began the frenzy that marks the unofficial start of free agency, the Rams on Monday shied away from blockbuster moves and instead attempted to keep intact the offensive line that protects perhaps their most valuable asset: quarterback Matthew Stafford.",
    "The Rams, who are expected to give Stafford and star defensive lineman Aaron Donald new contracts before the start of the season, were eager to put the pieces of their offensive line in place as they gear up for a run to repeat as Super Bowl champions.",
    "Cornerbacks Darious Williams and Donte Deayon, linebacker Obo Okoronkwo, running backs Sony Michel and Buddy Howell, tight end Johnny Mundt and kick returner Brandon Powell are other pending unrestricted free agents.",
    "The Rams agreed to terms with presumed starting tackle Joe Noteboom and starting center Brian Allen on three-year contracts, and also gave reserve Coleman Shelton, who can play guard and center, a two-year deal.",
    "Monday was the start of the so-called legal tampering period, which precedes the start of the NFL’s new league year Wednesday, when trades and new contracts can become official.",
    "Corbett, selected by the Cleveland Browns with the first pick in the second round of the 2018 draft, was traded to the Rams in 2019 and became an integral part of the line.",
    "But it wasn’t all wins: Right guard Austin Corbett, who started every game the last two seasons, agreed to terms with the Carolina Panthers, according to multiple reports.",
    "Whitworth, 40, won the Walter Payton NFL man of the year award and helped lead the Rams to a Super Bowl LVI victory over the Cincinnati Bengals to cap his 16th NFL season.",
    "Shelton, 26, last season also played nearly the entire game against the Jacksonville Jaguars after Allen suffered an injury, and also started two other games.",
    "And defensive tackle Sebastian Joseph-Day agreed to terms with the Chargers, rejoining coach Brandon Staley, the Rams’ former defensive coordinator.",
    "He also started in place of Whitworth — and played very well — in last season’s NFC divisional-round playoff victory over the Tampa Bay Buccaneers.",
    "The chest muscle injury sidelined Joseph-Day for much of the 2021 season, which enabled Greg Gaines to ascend into a starting role.",
    "The Rams’ main free-agent priorities remain retaining pending free-agent receiver Odell Beckham Jr. and linebacker Von Miller.",
    "But early in Noteboom’s career, there were questions about whether he would ultimately become the team’s starting left tackle.",
    "Terms of the contracts were not revealed, but NFL.com reported that Noteboom’s includes $25 million in guarantees.",
    "He played in 13 games as a rookie but sat out much of the 2019 season and all of 2020 because of knee injuries.",
    "The Rams drafted the 6-foot-5, 321-pound Noteboom in the third round of the 2018 draft to succeed Whitworth.",
    "Re-signing Noteboom, 26, was a strong indication that veteran left tackle Andrew Whitworth will retire.",
    "Noteboom has started at tackle, guard and also has played as an extra tight end in heavy formations.",
    "Linebackers Troy Reeder and Travin Howard and kicker Matt Gay are among restricted free agents.",
    "In 2020, after Whitworth suffered a midseason knee injury, Noteboom started in his place.",
    "He was not active for any games as a rookie, but developed into a valuable starter.",
    "In 2019, the Rams signed Shelton off waivers from the Arizona Cardinals.",
    "Allen’s deal could be worth as much as $24 million, according to ESPN.",
    "He did not play in the Super Bowl because of a chest muscle injury.",
    "The Rams selected Joseph-Day in the sixth round of the 2018 draft.",
    "Backup quarterback John Wolford is an exclusive right free agents.",
    "Allen, 26, was selected in the fourth round of the 2018 draft.",
    "Last season, the 6-2, 307-pound Allen started 16 games.",
    "Shelton signed a two-year contract."
  ]
}