{
  "id": 2862,
  "mediaId": 2707,
  "date": "2022-03-15",
  "headline": "Rams lose G Austin Corbett, OLB Ogbonnia Okoronkwo",
  "image": "https://www.ocregister.com/wp-content/uploads/2022/03/Bears-Rams-Football-10.jpg?w=1024&h=682",
  "link": "https://www.ocregister.com/2022/03/15/rams-lose-g-austin-corbett-olb-ogbonnia-okoronkwo/",
  "mediaOutlet": "The Orange County Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Modesti",
  "authorUrl": "https://www.ocregister.com/author/kevin-modesti/",
  "termIds": [
    0
  ],
  "sentences": [
    "In one other move Tuesday, the Rams moved to keep kicker Matt Gay by giving him an original-round restricted-free-agent tender worth $2.54 million, according to the NFL Network, meaning a team signing him to an offer sheet must give L.A. a fifth-round draft pick.",
    "The Rams, as projected, were awarded five comp picks, one in the third round (for losing minority executive Brad Holmes to the Lions) and one in the fourth and three in the sixth for losing free agents John Johnson, Samson Ebukam, Gerald Everett and Troy Hill.",
    "While left tackle Andrew Whitworth was preparing his retirement speech Tuesday, free agent right guard Austin Corbett was agreeing to join the Carolina Panthers on a three-year contract reported to be worth $26.25 million.",
    "The other departure from the Super Bowl winners’ roster on Tuesday was outside linebacker Ogbonnia Okoronkwo, who agreed to a reported one-year contract with the Houston Texans in a bid for regular playing time.",
    "In Corbett, 26, the Rams lose a former second-round draft choice who played almost every offensive snap in the two full seasons after he arrived from the Cleveland Browns in a 2019 trade for a fifth-round pick.",
    "But the team came away from it feeling pretty good about its line, considering that the 40-year-old Whitworth’s retirement was expected and free agency loomed for several blockers.",
    "The Rams already lined up a possible replacement for Corbett when they re-signed pending restricted free agent guard/center Coleman Shelton to a two-year contract on Monday.",
    "Wednesday is the first day to officially sign and complete trades for other teams’ players, and the deadline for teams to get under next season’s $208.2 million payroll cap.",
    "Also Monday, the Rams anticipated Whitworth’s retirement by re-signing tackle Joe Noteboom (for three years) and re-signing starting center Brian Allen (three years).",
    "The Rams’ eight scheduled picks are in the third round (104th overall), fourth (142nd), fifth (175th), sixth (211th, 212th, 218th) and seventh (239th, 253rd).",
    "Remaining Rams unrestricted free agents include wide receiver Odell Beckham Jr., outside linebacker Von Miller and cornerback Darious Williams.",
    "Okoronkwo is the second loss from the defense after nose tackle Sebastian Joseph-Day agreed Monday to a three-year deal with the Chargers.",
    "The Rams began the week a league-high $22.9 million over the cap, but Whitworth’s retirement knocks $16 million off that figure.",
    "With the NFL draft coming up April 28-30, teams found out Tuesday about compensatory picks.",
    "That’s a lot of offseason activity for the Rams’ offensive line, which was ranked No.",
    "The Rams’ focus remained on the offensive line on the second day of free-agent week.",
    "7 in the NFL for the 2021 season by Pro Football Focus."
  ]
}