{
  "id": 2868,
  "mediaId": 2685,
  "date": "2022-03-12",
  "headline": "With Kirk Cousins' contract settled, what's next for the Vikings as free agency opens?",
  "image": "https://chorus.stimg.co/23203058/merlin_66358705.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces",
  "link": "https://www.startribune.com/vikings-top-needs-nfl-free-agency-kwesi-adofo-mensah/600155494/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Krammer",
  "authorUrl": "https://www.startribune.com/andrew-krammer/6370577/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Vikings' next highest cap hits are defensive end Danielle Hunter ($26 million, including an $18 million roster bonus due March 20), receiver Adam Thielen (nearly $17 million), linebacker Eric Kendricks ($13.5 million), safety Harrison Smith ($13.5 million) and running back Dalvin Cook ($12 million).",
    "The Vikings also need outside corners who can cover man-to-man like the Eagles' Steven Nelson, Cardinals' Robert Alford and Packers' Kevin King, who had his best season in 2019 under new Vikings assistant Mike Pettine.",
    "Jones landed a three-year, $30 million deal in Denver, according to reports, which aligns with his recent stopping power; only the Rams' Aaron Donald had more run stops in 2021, per Pro Football Focus.",
    "The team addressed this Tuesday by agreeing to sign ex-Cardinals inside linebacker Jordan Hicks, who projects as Barr's replacement next to Kendricks in the often-used, two-linebacker nickel defense.",
    "Top of the class\nEx-Commanders guard Brandon Scherff, an All-Pro in 2020, is the clear top option who reportedly agreed with Jacksonville on a three-year deal worth up to $49.5 million.",
    "Three coaches on the new staff, O-line coach Chris Kuper, run game coordinator Curtis Modkins and assistant O-line coach Justin Rascati, were on the Broncos staff that coached him.",
    "The Buccaneers' Carlton Davis is another man-to-man maven who, after 52 deflections in four seasons, will reportedly re-sign with Tampa Bay for three years and $45 million.",
    "Former Packers edge rusher Za'Darius Smith — cut by Green Bay on Monday — reportedly reneged on an agreement with the Ravens on Thursday, meaning he's still a free agent.",
    "Top of the class\nA couple veterans with game-changing pasts, the Bears' Akiem Hicks, 32, and the Ravens' Calais Campbell, 35, are intriguing and likely costly rentals.",
    "The NFL free agency flurry officially begins this week, with players out of contract allowed to negotiate with other teams on Monday and officially sign Wednesday.",
    "INTERIOR DEFENSIVE LINEMEN\nThe situation\nThe Vikings plan to release nose tackle Michael Pierce in a cost-cutting move, a league source said Monday night.",
    "The Bears' James Daniels, a 2018 second-round pick out of Iowa, agreed to sign with the Steelers on Tuesday for a reported three-year, $26.5 million deal.",
    "On Wednesday, the Vikings agreed to a one-year, minimum salary contract with former Broncos guard Austin Schlottmann, who started seven games for Denver.",
    "Vikings 600155494\nCornerback, edge rusher, linebacker and both lines require the attention — and significant investment — from new GM Kwesi Adofo-Mensah.",
    "EDGE RUSHERS\nThe situation\nDonatell's 3-4 base defensive front means the Vikings need athletic stand-up edge rushers who can rush and drop into coverage.",
    "INTERIOR OFFENSIVE LINEMEN\nThe situation\nTwo interior offensive linemen are currently signed beyond this season: guards Ezra Cleveland and Wyatt Davis.",
    "Best fits\nThe Vikings agreed to terms on Monday night with ex-Bills defensive tackle Harrison Phillips on a three-year deal worth up to $19.5 million.",
    "Adofo-Mensah and new coach Kevin O'Connell inherited some expensive veterans who could be means to that end, through trades, restructures or releases.",
    "The Giants' Lorenzo Carter, a 26-year-old former third-round pick, is a lanky rush-and-cover man who had five sacks and five deflections last season.",
    "Top of the class\nA couple former Patriots could cash in big between J.C. Jackson and Stephon Gilmore, who was traded to the Panthers last season.",
    "CORNERBACKS\nThe situation\nOnly four cornerbacks — Cameron Dantzler, Kris Boyd, Harrison Hand and Parry Nickerson — are currently under contract.",
    "New coordinator Ed Donatell often deploys five defensive backs — more than Mike Zimmer did in Minnesota — which makes corner a top priority.",
    "Quarterback Kirk Cousins was the first to redo his deal, clearing nearly $14 million in cap space with a one-year extension on Sunday night.",
    "Three Bears free agents — Hicks, Bilal Nichols and Eddie Goldman — were coached last season by new Vikings defensive line coach Chris Rumph.",
    "Two former Broncos starting linebackers, Alexander Johnson and Josey Jewell, are available after suffering torn pectoral muscles last year.",
    "But Barr is free to sign elsewhere on Wednesday, and Adofo-Mensah said at the NFL combine that he wanted to \"work with\" Hunter to keep him.",
    "The Vikings have plenty of roster holes to fill, especially for a defense that has six key contributors among their in-house free agents.",
    "Top of the class\nEx-Cardinals edge Chandler Jones reportedly agreed to a three-year deal with the Raiders worth more than $50 million.",
    "Ex-Falcons linebacker Foy Oluokun got a hefty contract — three years for $45 million, per his agent — to join the Jaguars on Monday.",
    "LINEBACKERS\nThe situation\nLike other positions, the Vikings have one marquee starter — Kendricks — and only inexperience behind him.",
    "Buccaneers Pro Bowl center Ryan Jensen followed Tom Brady back to Tampa Bay on a three-year deal reportedly worth up to $39 million.",
    "Top of the class\nDe'Vondre Campbell, the former Gophers linebacker, was one of the NFL's best bargains for the Packers last season.",
    "Best fits\nThe Vikings agreed to terms on a two-year, $10 million deal with Hicks, who has started 51 straight regular season games.",
    "Jackson reportedly parlayed eight interceptions last season into a five-year deal worth up to $82.5 million with the Chargers.",
    "The Vikings need to clear salary cap space by then — current commitments have them up against the 2022 cap of $208.2 million.",
    "A slam-dunk fit is Bryce Callahan, who has played all seven NFL seasons under Donatell and Vic Fangio in Chicago and Denver.",
    "Center Garrett Bradbury is entering the final year of his rookie contract after briefly losing his starting job last year.",
    "Ex-49ers guard Laken Tomlinson reportedly agreed to sign with the Jets on Monday for three years and up to $40 million.",
    "The Chargers' Uchenna Nwosu agreed to a two-year, $20 million deal with Seattle on Wednesday, according to his agency.",
    "Barr is a free agent who sounded resigned to moving on after last year's season finale, and may not fit the finances.",
    "Ex-Rams cornerback Darious Williams agreed to join the Jaguars on Wednesday with a three-year, $30 million contract.",
    "Both played well under Fangio and Donatell, ranking first and second in tackles in their last full seasons in 2020.",
    "The Vikings need long-term depth and, if they are sticking with Cousins, they need immediate help in front of him.",
    "The Vikings could use an upgrade at guard, and the Jaguars' Andrew Norwell is one of a few proven veterans left.",
    "The Vikings could sign a veteran to join Chazz Surratt, Troy Dye, Ryan Connelly, Blake Lynch and Tuf Borland.",
    "Ex-Chiefs corner Charvarius Ward also got paid, agreeing to a three-year, $42 million deal in San Francisco.",
    "Sheldon Richardson is a free agent again after playing inside and outside for last year's patchwork line.",
    "Armon Watts is entering a contract year after he had five sacks in nine starts for Pierce last season.",
    "The Dolphins' Emmanuel Ogbah agreed Monday to a four-year deal worth up to $65 million, per his agent.",
    "Nose tackle Michael Pierce was informed of his release on Monday night after an attempted restructure.",
    "Here's a glance at five positions the Vikings could restock, and the market and best fits for each.",
    "Ex-Panthers edge rusher Haason Reddick agreed to a three-year, $45 million deal with the Eagles.",
    "Best fits\nThe Bills' Jerry Hughes and Ravens' Justin Houston would bring immediate pass rush.",
    "Titans center Ben Jones will reportedly re-sign in Tennessee for two years and $14 million.",
    "While Dantzler could hold onto a starting job, the Vikings need both starters and reserves.",
    "When healthy, the 30-year-old Callahan has been one of the league's best slot defenders.",
    "Nick Vigil played well on a one-year deal but doesn't appear to fit Donatell's defense.",
    "Pierce has played in only eight of 33 games due to a torn triceps and COVID-19 opt-out.",
    "Rams center Brian Allen is reportedly returning for three years and up to $24 million.",
    "The Ravens' Bradley Bozeman, who has played both center and guard, is still available.",
    "The Titans' Jayon Brown has 3-4 experience and a history of playing well in coverage.",
    "Even with Hunter, the Vikings need more pass rush with only youth on the roster: D.J.",
    "That leaves the Browns' Jadeveon Clowney as one of the top rushers out of contract.",
    "But there are two younger, versatile edge defenders who might fit the big picture.",
    "Six-time All-Pro linebacker Bobby Wagner is available after Seattle released him.",
    "Now he's staying in Green Bay, reportedly on a five-year, $50 million contract.",
    "Patrick Peterson and Mackensie Alexander will become free agents on Wednesday.",
    "Vikings General Manager Kwesi Adofo-Mensah's roster puzzle needs more pieces.",
    "Oli Udoh also enters a contract year after struggling as a starting guard.",
    "He was set to account for nearly $10 million of Cleveland's cap this year.",
    "Former Rams guard Austin Corbett reportedly agreed to join the Panthers.",
    "Defensive tackle Dalvin Tomlinson was solid in 16 starts last season.",
    "But he has landed on injured reserve each of the past three seasons.",
    "Best fits\nThe Vikings need to upgrade from Alexander in the slot.",
    "The Rams' Von Miller is headed to Buffalo on a six-year deal.",
    "Best fits\nA deep interior O-line market moved quickly Monday.",
    "Wonnum, Patrick Jones, Janarius Robinson and Kenny Willekes.",
    "Danielle Hunter can do this, so can a healthy Anthony Barr.",
    "The Browns released center JC Tretter on Tuesday.",
    "Mason Cole and Dakota Dozier are free agents.",
    "Ex-49ers defensive tackle D.J.",
    "That's it."
  ]
}