{
  "id": 2907,
  "mediaId": 2679,
  "date": "2022-03-16",
  "headline": "LA Rams release punter Johnny Hekker after memorable decade",
  "image": "",
  "link": "https://www.seattletimes.com/sports/la-rams-release-punter-johnny-hekker-after-memorable-decade/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "GREG BEACHAM",
  "authorUrl": "https://www.seattletimes.com/author/greg-beacham/",
  "termIds": [
    1728,
    1817,
    2578,
    3162,
    3234,
    3440,
    4147,
    4547,
    570,
    5104
  ],
  "sentences": [
    "Along with left tackle Andrew Whitworth’s retirement, Los Angeles lost edge rusher Von Miller to Buffalo, defensive tackle Sebastian Joseph-Day to the Chargers, and starting cornerback Darious Williams to Jacksonville this week.",
    "Along with his punting prowess and his steady hands as the Rams’ holder for placekicks, Hekker was a team leader, a popular figure among fans, and even a serious threat to throw the ball on trick plays.",
    "Los Angeles has yet to sign an outside free agent or re-sign receiver Odell Beckham Jr.\nHekker was one of three former St. Louis Rams left on Los Angeles’ roster for its Super Bowl victory last month.",
    "Starting right guard Austin Corbett is expected to sign with Carolina soon, while backup linebacker Ogbo Okoronkwo joined Houston and backup tight end Johnny Mundt headed to Minnesota.",
    "He became a four-time All-Pro selection and arguably the NFL’s top punter during the 2010s, but his average declined to a career-low 44.2 yards per punt last season.",
    "The former high school quarterback is 14 of 23 for 186 yards and a touchdown as a passer in his career, although he threw just one pass in the past two seasons.",
    "Advertising\n Skip AdSkip AdSkip Ad\nThe Rams managed to retain offensive linemen Joseph Noteboom and Brian Allen, two probable starters next season.",
    "The Super Bowl champion Rams dropped their longest-tenured player Wednesday night in a move that creates just over $2 million in salary cap room.",
    "Hekker has spent his entire career with the Rams since signing in St. Louis as an undrafted free agent out of Oregon State in 2012.",
    "Hekker acknowledged he suspected he would be cut during training camp last summer, but he beat out Corey Bojorquez for the job.",
    "While Hekker is leaving, the Rams are likely to keep kicker Matt Gay as a restricted free agent with an original-round tender.",
    "Hekker is among several significant personnel losses this week for the champs, who are squeezed against the cap as usual.",
    "Bojorquez signed with the Packers and had a strong season, while the Rams must find another punter this summer.",
    "___\nMore AP NFL: https://apnews.com/hub/NFL and https://twitter.com/AP_NFL\n GREG BEACHAM",
    "Gay was a Pro Bowl selection last season after joining Los Angeles in 2020.",
    "Only superstar DT Aaron Donald and right tackle Rob Havenstein now remain.",
    "The Los Angeles Rams have released punter Johnny Hekker after 10 seasons."
  ]
}