{
  "id": 2921,
  "mediaId": 2586,
  "date": "2022-03-16",
  "headline": "Exclusive: Former NFL GM Reacts to the Early Moves the Rams Have Made",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-1383095749-e1647402800892.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/los-angeles-rams/former-gm-reacts-to-rams-moves/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Randy Mueller",
  "authorUrl": "https://heavy.com/author/randy-muellerheavy-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "In fact, the Rams have endured some notable losses in this order: Right guard Austin Corbett to the Carolina Panthers, nose tackle Sebastian Joseph-Day to the Los Angeles Chargers and on Tuesday afternoon, March 15, Pro Bowl stalwart and captain Andrew Whitworth calling it a career.",
    "Mueller, the NFL Executive of the Year in 2000 by the Sporting News while he was with the New Orleans Saints, plus served as the GM for the Miami Dolphins from 2005 to 2007, tells Heavy that the Rams made an intelligent decision in starting with signing the trench trio.",
    "But with the free agency period already off and running on Monday, March 14 through the start of the legal tampering period (when teams can contact an opposing player’s agent and negotiate a deal), the Rams are yet to make a major splashy acquisition yet.",
    "What Intrigues Mueller About the Rams\nMueller noticed right away the first initial act during the week of March 14 for the Rams: Resigning three offensive linemen in Coleman Shelton, Brian Allen and Joseph Noteboom.",
    "In the Los Angeles Rams era of Les Snead, Sean McVay and company, March is when the franchise is at their most aggressive during the offseason — by luring in hot name free agents.",
    "And could some believe the Rams aren’t being smart about pivoting immediately to resigning NFC champion hero Odell Beckham and one of their Super Bowl heroes Von Miller?",
    "“With Whitworth’s future in doubt (now officially retired), it’s a no brainer.”\nMueller isn’t the only one who likes the fact all three are back on board with the Rams.",
    "Both have made it clear in the past they would like to return to the champs, especially since they’ve developed a close bond even before becoming Ram teammates.",
    "“Von Miller and OBJ will play the market and the Rams had to know those guys wouldn’t be even options until they see where their market lands,” Mueller said.",
    "“Noteboom and Allen minimize change in a group that has worked well together.”\nMueller zeroed in on two particular areas of need that the Rams addressed.",
    "I believe the two positions they play (Noteboom and Allen) are most critical and there should be no period of adjustment come next year,” Mueller said.",
    "Miller, however, has sent cryptic messages in the past week on his social media accounts that he’s open to returning to the Denver Broncos.",
    "Randy Mueller tells Heavy that he’s taken a liking to what the Super Bowl champs have done early on in the 2022 free agency period.",
    "Beckham, meanwhile, is still dealing with his torn ACL from the Super Bowl which could diminish his free agent value.",
    "pic.twitter.com/qCkwDgh6pS\n— Cooper Kupp (@CooperKupp) March 15, 2022\nWhat’s the Prediction for Miller & OBJ?",
    "Wednesday is when signings will be made official — and really intensify among NFL teams including the Rams.",
    "One past general manager isn’t one who believes the Rams are doing anything wrong from the early outset.",
    "pic.twitter.com/EhTSwKqtpI\nDoes this mean the Rams have scaled back on the free agent aggressiveness?",
    "Von Miller runs off celebrating the Super Bowl 56 win with the Rams on February 13, 2022.",
    "The Super Bowl Most Valuable Player Cooper Kupp is another:\nGlad to have these men back!",
    "“Tackles are hard to find and center is the key communicator with the whole front.",
    "Those guys would just shop any offer the Rams made.”",
    "“I like what the Rams have done,” Mueller said.",
    "“Timing is not right — yet — to sign either.",
    "This is where Miller and Beckham come in.",
    "What does Mueller predict for the duo?",
    "Can't wait to see what's next.",
    "Thank you, 7??7??!",
    "??",
    "??"
  ]
}