{
  "id": 3004,
  "mediaId": 2732,
  "date": "2022-03-14",
  "headline": "NFL free agency roundup: Let the mostly unofficial dealing begin",
  "image": "",
  "link": "https://triblive.com/sports/nfl-free-agency-roundup-let-the-mostly-unofficial-dealing-begin/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://triblive.com/author/the-associated-press/",
  "termIds": [
    1728,
    2537,
    2787,
    2999,
    3000,
    3259,
    4673,
    4737,
    68,
    671
  ],
  "sentences": [
    "Also agreeing to move on were New England cornerback J.C. Jackson to the Los Angeles Chargers; linebacker Haason Reddick, from Carolina to Philadelphia; guard Laken Tomlinson from San Francisco to the New York Jets; running back Chase Edmonds from Arizona to Miami; quarterback Teddy Bridgewater from Denver to Miami; offensive lineman Ted Karras from New England to Cincinnati and offensive lineman Alex Cappa from Tampa Bay to Cincinnati; offensive lineman Rodger Saffold from Tennessee to Buffalo — with many more switches to come.",
    "Staying put are Tampa Bay center Ryan Jensen, a key protector of Tom Brady; safeties Devin McCourty with the Patriots and Quandre Diggs with the Seahawks; All-Pro kick returner Braxton Berrios with the Jets; defensive end Emmanuel Ogbah with the Dolphins; linebacker Preston Smith with the Packers; center Brian Allen and tackle Joseph Noteboom with the Rams; center Ben Jones and tight end Geoff Swaim with the Titans.",
    "“Since coming to Green Bay, he has not only contributed with production on the field but has been a great presence in the locker room and a leader for this team.”\nNoteboom is nearly certain to be the Rams’ starting left tackle because NFL Man of the Year Andrew Whitworth, 40, is expected to retire.",
    "The Jaguars agreed to sign Arizona receiver Christian Kirk, Washington guard Brandon Scherff, Atlanta linebacker Foyesade Oluokun and New York Jets defensive tackle Folorunso “Foley” Fatukasi, according to a person familiar with negotiations.",
    "Among the most notable names to stay put was former Pitt and Steelers running back James Conner, who re-signed with the Arizona Cardinals for three years after a stellar 2021 season that included a franchise-record 18 total touchdowns.",
    "“Jarvis’ on-field production and fiery competitiveness speaks for itself, but his leadership and team-oriented attitude impacted our culture in a way that will last in time even beyond his release,” general manager Andrew Berry said.",
    "“These decisions are always difficult, but we wish Jarvis well and we look forward to the day when he returns as a storied Browns alumnus.”\nThe biggest scramble, of course, centers on adding players for positions of need.",
    "Also set free and able to sign with another team even before Wednesday were Packers linebacker Za’Darius Smith and versatile offensive lineman Billy Turner; Bears nose tackle Eddie Goldman; and Panthers cornerback A.J.",
    "The NFL’s “legal tampering period” in free agency began Monday with a slew of deals even as many teams released veterans to clear salary cap space before the league’s business year begins Wednesday.",
    "The 26-year old Jackson earned his first Pro Bowl selection last season, leading the league with 23 passes defensed, and was second with eight interceptions.",
    "Some desperately need to get under the $208.2 million cap, which is up by nearly $26 million after two pandemic-impacted seasons.",
    "Others are clearing out players with large cap hits to add more spending room or because they plan to bring in replacements.",
    "Reddick, from the Philly area and a sack force in recent years, should boost a defense in need of exactly what he brings.",
    "Jacksonville, which has the first overall selection in the draft next month for the second straight year, got busy early.",
    "Miami badly needs a reliable running back and gets one in Edmonds, who would have been a backup to Conner in Arizona.",
    "Conner was a huge part of the Cardinals’ offense last season with 752 yards rushing and 375 yards receiving.",
    "“We are excited to have Preston continue his career with the Packers,” general manger Brian Gutekunst said.",
    "Oluokun led the Falcons with 192 tackles last season, and Fatukasi is a force against the run.",
    "Perhaps the most notable player to get cut Monday was Browns receiver Jarvis Landry.",
    "1 wideout, so Landry is gone despite the many positives he brought to the Browns.",
    "Jackson should solidify an under-performing cornerbacks group with the Chargers.",
    "Such is the case in Cleveland with Amari Cooper about to become the No.",
    "Kirk figures to replace DJ Chark as Trevor Lawrence’s top target.",
    "Scherff has been a dependable blocker when healthy in Washington.",
    "He has 25 picks over the past four seasons, most in the league.",
    "Yes, 32 teams are in scramble mode, for a variety of reasons.",
    "The Packers, Saints, Rams, 49ers and Chiefs are among those.",
    "And then there is Jacksonville, which needs everything.",
    "Most aggressive was the worst team in the league.",
    "Let the dealing begin — if mostly unofficial.",
    "All four newcomers should be starters.",
    "Bouye and defensive end Morgan Fox.",
    "Categories: NFL | Sports"
  ]
}