{
  "id": 3102,
  "mediaId": 2728,
  "date": "2022-03-14",
  "headline": "Champion Rams re-sign LT Noteboom, C Allen to 3-year deals",
  "image": "https://www.thestar.com/assets/img/thestar-ribbon.png",
  "link": "https://www.thestar.com/sports/football/2022/03/14/champion-rams-re-sign-lt-joseph-noteboom-to-3-year-deal.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Beacham",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Noteboom missed the NFC championship game and the Super Bowl last month because of a chest injury from the Rams’ playoff victory over Tampa Bay, but he has filled in solidly for an injured Whitworth whenever called upon over the past four years with the Rams.",
    "The 40-year-old Whitworth has all but said he won’t return after winning his first league title last month and being selected as the league’s Walter Payton Man of the Year in an impressive culmination of his 16-year career.",
    "The Super Bowl champions announced the deal early Monday with Noteboom, who was headed toward free agency after four seasons spent largely as left tackle Andrew Whitworth’s backup in Los Angeles.",
    "Noteboom started two games at left guard and seven more at left tackle in the 2020 season after Whitworth went down with a knee injury, and he started two games in Whitworth’s place last season.",
    "Allen, a fourth-round pick in 2018, became the Rams’ starting center as a second-year pro in 2019, but Austin Blythe took his job after Allen was injured midway through the season.",
    "___\nMore AP NFL: https://apnews.com/hub/NFL and https://twitter.com/AP_NFL\nSHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "A few hours later, the Rams locked up fellow 2018 draft pick Allen, who made a remarkable comeback as the Rams’ starting center last season after not getting on the field in 2020.",
    "Allen had a largely outstanding season during the Rams’ title run, starting 16 regular-season games and all four playoff games while earning recognition as a Pro Bowl alternate.",
    "Noteboom got a $40 million deal with $25 million guaranteed and a maximum value of $47.5 million through playing time incentives, according to his agent, Bill Johnson.",
    "Allen didn’t play a down for the Rams in 2020 while sitting behind Blythe, but he improbably reclaimed the job last summer after Blythe signed with Kansas City.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "The Los Angeles-area native has become a dependable player on the interior line since being cut by two teams and then joining the Rams for the 2019 season.",
    "Corbett has attracted interest from several teams after he resurrected his career in Los Angeles when Cleveland cast off its former 33rd overall pick.",
    "With Allen’s return alongside Noteboom, only starting right guard Austin Corbett remains unsigned among the Rams’ key offensive linemen.",
    "Los Angeles also re-signed versatile backup offensive lineman Coleman Shelton, who started games at center and left guard last season.",
    "Noteboom also played as an extra blocker in heavy run formations for the Rams down the stretch of their championship season.",
    "He was a third-round pick out of TCU by the Rams in 2018, while Allen was a fourth-round pick out of Michigan State.",
    "Offensive linemen Joseph Noteboom and Brian Allen have agreed to three-year deals to stay with the Los Angeles Rams.",
    "Noteboom is nearly certain to be the Rams’ starting left tackle next season if Whitworth retires as expected.",
    "Noteboom was the Rams’ starting left guard in 2019 before a knee injury ended his season after six games.",
    "Shelton is a possible replacement if Corbett leaves.",
    "The Star does not endorse these opinions.",
    "Shelton got a two-year deal."
  ]
}