{
  "id": 3179,
  "mediaId": 2523,
  "date": "2022-03-13",
  "headline": "Tom Brady Is Back, but the Buccaneers Are Far from Super Bowl Favorites",
  "image": "https://img.bleacherreport.net/img/images/photos/003/920/874/hi-res-aed560b4b00893d1f6a675ba3a90fc43_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2954344-tom-brady-is-back-but-the-buccaneers-are-far-from-super-bowl-favorites",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gary Davenport",
  "authorUrl": "https://bleacherreport.com/users/56e814d7-af6d-4d06-81ed-30c56f8841e0",
  "termIds": [
    1587,
    2537,
    184,
    442,
    539,
    671,
    703,
    1004
  ],
  "sentences": [
    "And for the Bucs to get past the likes of the Los Angeles Rams and Green Bay Packers and get to Super Bowl LVII, general manager Jason Licht will have to do the best work of his professional career to keep this particular pirate ship from springing leaks all over the place.",
    "And there are the Tampa Bay Buccaneers, who have a boatload of key contributors set to hit the open market when Monday's legal tampering period begins and were facing the impossible task of replacing the most successful quarterback the NFL has ever known.",
    "Even if Licht can hold most of the core together, Brady has another great season and the Buccaneers somehow make it to Glendale, the AFC is loaded with talented teams who don't face the same monetary crunch (for the most part) the top NFC teams do.",
    "After going all-in on winning the Super Bowl, the Rams won't pick until the very end of Round 3 (assuming that they get a compensatory pick for Brad Holmes' departure last year) and are over $20 million upside-down against the cap.",
    "Licht can (and will) create cap space with some restructures—he need look no farther than New Orleans and Saints general manager Mickey Loomis for a masterclass in how to milk cap space in the present at the expense of the future.",
    "No player in NFL history has resisted the ravages of time better than Brady, and there's zero reason to think he can't play at an elite level again in 2022—possibly because he's a vampire and doesn't age.",
    "Both have free agents of their own to worry about, whether it's edge-rusher Von Miller and center Brian Allen in Los Angeles or linebacker De'Vondre Campbell and cornerback Rasul Douglas in Green Bay.",
    "But losing a rock along the offensive like Jensen or a starter in a secondary that struggled badly at times last year (including the loss to the Rams that ended Tampa's season) would be a major blow.",
    "And after so many players \"took one for the team\" in 2021 to keep the band together, it's not hard to imagine one or more prioritizing their own financial future once free agency opens.",
    "The Dallas Cowboys all but gave wide receiver Amari Cooper away to clear cap space to bring back wideout Michael Gallup and prioritize other free agents like safety Jayron Kearse.",
    "Tight end Rob Gronkowski is set to be a free agent, although Brady's return could easily motivate him to sign a team-friendly deal to re-reunite with his favorite quarterback.",
    "But while this is a day of celebration and the firing of cannons at Raymond James Stadium, Brady's return doesn't instantly make Tampa the Super Bowl favorite.",
    "To be clear, saying this is a good day for the Buccaneers is a bit like saying that Christmas morning is mildly enjoyable for children.",
    "The Carolina Panthers, coming off a miserable 2021 campaign, are reportedly among the leading contenders to trade for Deshaun Watson.",
    "With Tom Brady ending his retirement Sunday after a month or so, the Buccaneers have rocketed to the top of the division again.",
    "It was Brady himself who announced on Twitter that he had decided to return to the Buccaneers for his 23rd season in the NFL.",
    "There's work to be done if Brady's \"comeback\" is to end with that thing that 31 of every 32 NFL fans would rather not see.",
    "The defending AFC champion Cincinnati Bengals have the sixth-most cap space in the NFL with which to upgrade their O-line.",
    "Now, not all of these players need to be retained—2021 first-round pick Joe Tryon-Shoyinka makes Pierre-Paul expendable.",
    "His QBR of 68.1 trailed only Aaron Rodgers', and Brady finished second in MVP voting behind the Packers quarterback.",
    "There's next to no chance he can pull that off again, and not just because Pro Bowl guard Ali Marpet retired at 28.",
    "The reality is that (Brady or no) the 2022 Buccaneers probably won't be as loaded on paper as last year's team was.",
    "He successfully brought back all 22 starters from the team that throttled the Kansas City Chiefs in Super Bowl LV.",
    "Albert Breer\nLogistically, it'll be pretty easy for the Buccaneers to bring Tom Brady back into the fold.",
    "The New Orleans Saints have an awful cap situation, no quality starting quarterback and a new head coach.",
    "As things stand, Tampa has to be considered the prohibitive favorite to repeat as NFC South champions.",
    "And per Albert Breer of The MMQB, Brady's salary and cap numbers for 2022 aren't at all exorbitant.",
    "Tom Brady\nThese past two months I’ve realized my place is still on the field and not in the stands.",
    "The AFC West alone now features teams led by Patrick Mahomes, Russell Wilson and Justin Herbert.",
    "One day ago, Bucs fans were trying to convince themselves that maybe Kyle Trask has potential.",
    "Of all those AFC teams, only one (Kansas City) is in worse shape against the cap than Tampa.",
    "And center Ryan Jensen (who was reportedly re-signed shortly after Brady's announcement).",
    "The Atlanta Falcons have an aging quarterback and holes galore on both sides of the ball.",
    "Especially since Brady just walked away from football altogether—even if only for a bit.",
    "His base salary for this year is $8.925 million, and his cap number is $18.396 million.",
    "Tampa's top two running backs (Leonard Fournette and Ronald Jones II) are free agents.",
    "The Buffalo Bills may have the most balanced and talented roster in the entire league.",
    "The NFC South has been in a massive state of flux since the 2021 NFL season ended.",
    "And the list of free agents the team has decisions to make on is not a short one.",
    "But making (and winning) a second Super Bowl in three seasons is another story.",
    "And make no mistake: The Buccaneers just became all about living in the now.",
    "Brady's return solves one problem, but by no means does it solve them all.",
    "But the Buccaneers sit $2.7 million in the red, according to Over the Cap.",
    "Plus, Tampa's roster/cap was built to keep the Brady window open for '22.",
    "Tampa already retained wide receiver Chris Godwin via the franchise tag.",
    "The Packers have the worst salary-cap situation in the entire NFL.",
    "Most of the leading contenders in the NFC face a similar dilemma.",
    "Thomas Edward Patrick Brady Jr. lifting a Lombardi Trophy…again.",
    "Brady's 5,316 passing yards led the NFL and were a career high.",
    "Unfinished business LFG https://t.co/U0yhRKVKVm\nLanguage, Tom.",
    "It hammered home the reality that Tampa's window is slim.",
    "I love my teammates, and I love my supportive family.",
    "But frankly Brady's return shouldn't come as a shock.",
    "Brady's 43 passing touchdowns led the league as well.",
    "Or that all Marcus Mariota needs is a second chance.",
    "Now the GOAT is back—and the Buccaneers are as well.",
    "Last year, Licht accomplished the unprecedented.",
    "That 23 years in the NFL is a staggering number.",
    "And they are also in on the Watson sweepstakes.",
    "The 44-year-old didn't show his age last year.",
    "I’m coming back for my 23rd season in Tampa.",
    "And those players already have a ring.",
    "Not saying he's definitely a vampire.",
    "So is edge-rusher Jason Pierre-Paul.",
    "And defensive tackle Ndamukong Suh.",
    "There is at least a silver lining.",
    "Simply raising the possibility.",
    "And safety Jordan Whitehead.",
    "1 cornerback Carlton Davis.",
    "That's not the whole list.",
    "They make it all possible.",
    "It's the team around him.",
    "The problem isn't Brady.",
    "Think of the children.",
    "And guard Alex Cappa.",
    "Only the highlights.",
    "That time will come.",
    "But it’s not now.",
    "B/R Recommends",
    "Or maybe not.",
    "And No."
  ]
}