{
  "id": 3569,
  "mediaId": 2523,
  "date": "2022-03-11",
  "headline": "NFL Free Agency 2022: 1 Player Each Team Shouldn't Re-Sign",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/506/250/hi-res-e8e58ab2bba6bb7d518759ee6a35fbbc_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2954120-nfl-free-agency-2022-1-player-each-team-shouldnt-re-sign",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gary Davenport",
  "authorUrl": "https://bleacherreport.com/users/56e814d7-af6d-4d06-81ed-30c56f8841e0",
  "termIds": [
    0
  ],
  "sentences": [
    "But a new role for an aging player with a Spotrac projected annual salary over $5 million isn't a wise use of Chicago's cap space, especially for a team with under $29 million in cap space and needs to address at wide receiver (if Allen Robinson II leaves as expected), cornerback, along the offensive line.",
    "Los Angeles Chargers: CB Chris Harris Jr.\nAt the NFL Scouting Combine, Los Angeles Chargers head coach Brandon Staley made it clear to reporters that he views the nickel cornerback spot as a key to fielding a solid defense:\n\"We really view the star, the nickel—we view that as a starter.",
    "Washington Commanders: OG Brandon Scherff\nIn mid-January, Washington Commanders general manager Martin Mayhew said he made \"every effort\" to re-sign guard Brandon Scherff to a long-term deal last year before eventually placing the franchise tag on him.",
    "The Cleveland Browns took him with a first-round pick in 2017, traded him to the New York Giants two years later as part of the deal for wideout Odell Beckham Jr., and he was an up-and-down defensive starter before tearing his ACL last season.",
    "But Green is also going to be 34 years old when the regular season starts, was wildly inconsistent in 2021 and didn't really show much of a chemistry with Cardinals quarterback Kyler Murray (who wants a new contract of his own this offseason).",
    "Cooper is reportedly being released primarily to alleviate some of the pressure on Dallas' annually backward cap situation so the team can afford to re-sign players like wide receiver Michael Gallup and edge-rusher Randy Gregory.",
    "But they already have three cornerbacks on the team that are arguably better than Rhodes in Isaiah Rodgers, Rock Ya-Sin and Kenny Moore, and they could pursue an upgrade with their league-leading $71.6 million in cap space, too.",
    "The Rams are already $20.4 million over the cap, and they have several in-house free agents of note, including wide receiver Odell Beckham Jr., edge-rusher Von Miller and offensive linemen Austin Corbett and Brian Allen.",
    "With a whopping $42.1 million in cap space, the Chargers have the wiggle room to be a player for just about any corner in this year's class (although the impact of the Khalil Mack trade could shrink that number).",
    "Cincinnati Bengals: OT Riley Reiff\nGiven the beating that Joe Burrow took in 2021, it might seem odd that the Cincinnati Bengals should part ways with a veteran offensive tackle with 139 starts to his credit.",
    "Also, a number of veteran Ravens are hitting the open market who are important presences in the locker room, such as defensive lineman Calais Campbell, edge-rusher Justin Houston and cornerback Jimmy Smith.",
    "Jacksonville Jaguars: OG Andrew Norwell\nWith both guard Andrew Norwell and tackle Cam Robinson set to hit free agency, the Jacksonville Jaguars had some potentially massive decisions to make this offseason.",
    "With $20.6 million in cap space and other free agents to sign, it doesn't make sense for the Eagles to pay paying $8 million or more annually to a player who hasn't come close to meeting expectations.",
    "He had six sacks in 2018, posted a career-best 105 tackles the following year, and he played a career-high 92 percent of the Titans' defensive snaps in 2020 over the 10 games in which he was healthy.",
    "Green Bay Packers: CB Chandon Sullivan\nThe offseason storylines around the Green Bay Packers have focused almost totally on the futures of quarterback Aaron Rodgers and wide receiver Davante Adams.",
    "They have next to no salary-cap space and a number of significant free agents, including edge-rusher Chandler Jones, tight end Zach Ertz, wide receiver Christian Kirk and running back James Conner.",
    "Dallas Cowboys: LB Leighton Vander Esch\nThe Dallas Cowboys are already making waves in free agency, with reports circulating that wide receiver Amari Cooper's days with the team could be numbered.",
    "While they could retain Smith-Schuster with their nearly $29 million in cap space, they should spend that money on more important issues than retaining a potentially declining underneath receiver.",
    "Las Vegas Raiders: OT Brandon Parker\nThe Las Vegas Raiders enter free agency with a pressing need to upgrade an offensive line that Pro Football Focus ranked as the league's fifth-worst in 2021.",
    "Tuesday was the deadline to apply the franchise tag, with stars like Chris Godwin of the Tampa Bay Buccaneers and Davante Adams of the Green Bay Packers getting locked up for the 2022 season.",
    "Add in that even an average young cornerback is going to generate substantial interest on the open market, and the Panthers would be wise to let another team overpay for Jackson's services.",
    "After playing decently in a reserve role in 2020, Parker was thrust into action as the Raiders full-time right tackle when first-round pick Alex Leatherwood flopped in spectacular fashion.",
    "\"We're still working what our cap situation is going to be and what are all the positions we gotta answer but we definitely would be open to bringing either one or both back,\" Beane said.",
    "It was Walker's 108 total tackles that led the Lions in 2021, with linebackers Jalen Reeves-Maybin (82 tackles) and Alex Anzalone (78 tackles) checking in third and fourth on the team.",
    "But the reality is that Riley Reiff played a part in that beating Burrow took last year, and the first step in the offensive line makeover should be letting Reiff walk in free agency.",
    "14 pick in 2017, but 21.5 sacks in five seasons are not enough for a player who’s on the field as much as Barnett (at least 60 percent of defensive snaps during the past four years).\"",
    "It feels like it's the right place, but at the end of the day, I've got to do what's best for me and my family, you know, and if Atlanta is not that place, then it's not that place.\"",
    "When the Broncos used a Day 2 pick on North Carolina's Javonte Williams, many assumed the writing was on the wall—that Melvin Gordon III's days as the team's lead back were numbered.",
    "And that's seemingly what the franchise has been doing with running back David Johnson from the moment he arrived as part of one of the most ill-conceived trades in Texans history.",
    "Those coverage lapses may cool Woods' market a bit, but plenty of teams still figure to show interest in a 26-year-old safety coming off the most productive season of their career.",
    "New England Patriots: LB Dont'a Hightower\nThe New England Patriots were one of the NFL's most aggressive teams in free agency last year, but that aggressiveness came with a price.",
    "The Saints signed right tackle Ryan Ramczyk to a five-year, $96 million extension last June, and they have a ready-made replacement for Armstead in eight-year veteran James Hurst.",
    "If some team is willing to pay him that much, the Jets would be better off saying adieu and going of this year's high-end outside threats like Michael Gallup or Allen Robinson II.",
    "Seattle Seahawks: RB Alex Collins\nAfter the Seattle Seahawks traded quarterback Russell Wilson to the Denver Broncos on Tuesday, it's hard to figure out what they should do next.",
    "The Dolphins may look at adding a veteran free-agent running back like Melvin Gordon III of the Broncos, but they otherwise figure to spend a pick on a tailback during the draft.",
    "The money needed to bring Gordon back would be better spent improving Pro Football Focus' 19th-ranked offensive line or adding pop to the team's middle-of-the-pack pass rush.",
    "The 33-year-old Hughes led all the Bills' defensive ends in snap count last year, but the 34-year-old Addison paced the club with seven sacks, while Hughes managed just two.",
    "Cleveland Browns: OT Chris Hubbard\nChris Hubbard is a cautionary tale in overspending in free agency for a pedestrian offensive tackle—a mistake made by teams every year.",
    "And while the team isn't in a terrible place regarding the salary cap, with only about $21 million in cap space, Houston isn't set up to be a major player in free agency.",
    "Both linebackers missed some time with injuries, but being out-tackled by two safeties (Walker and Will Harris) doesn't speak well to the level of play of either player.",
    "The Broncos are in good position relative to the salary cap in 2022 even after addinfg Russell Wilson, and general manager George Paton hasn't ruled out Gordon's return.",
    "There's also the matter of extensions for the likes of edge-rusher Charles Harris and safety Tracy Walker—contracts that could suck up most of that available cap space.",
    "Transitioning into something of a Swiss Army knife role, Patterson was the team's most consistent offensive weapon, eclipsing 1,100 yards from scrimmage with 11 scores.",
    "Green had his moments in his lone season in the desert last year—his 54 receptions tied for third on the team, and Green quietly ranked second with 848 receiving yards.",
    "The Eagles still have veteran edge-rusher Brandon Graham, a young up-and-comer in Josh Sweat and three first-round picks with which they can add pop to their pass rush.",
    "But they also have pending free agents who could command well in excess of $10 million per season in edge-rusher Haason Reddick and veteran cornerback Stephon Gilmore.",
    "The Chiefs are already $5.4 million over the salary cap, and they have other defensive free agents of note such as safety Tyrann Mathieu and edge-rusher Melvin Ingram.",
    "He made 14 starts for the Niners in 2021, logging a career-best 66 total tackles while allowing 57.6 percent of the passes thrown in his direction to be completed.",
    "Bills general manager Brandon Beane told reporters the team hasn't ruled out bringing back Mario Addison and Jerry Hughes, both of whom hit free agency next week.",
    "In each of the last two campaigns, he has allowed over 65 percent of the passes thrown in his direction to be completed with a passer rating against north of 90.",
    "If Peppers' market is anywhere near that, there's no way that a Giants team that is already more than $7.4 million over the salary cap can afford to retain him.",
    "Indianapolis Colts: CB Xavier Rhodes\nAt this time a year ago, some expected the Indianapolis Colts to let veteran cornerback Xavier Rhodes walk in free agency.",
    "Losing Williams will be a blow for the Rams, but t's a loss they can absorb with capable in-house replacements behind him in David Long Jr. and Robert Rochell.",
    "At 33, Reiff is well past his prime, and while he's not a bad right tackle, he's also not a great one—he allowed four sacks in just over 700 snaps last season.",
    "You're playing 65 percent or more five-DB groupings and it doesn't matter what team you coach for, what system you run, you're in five DB, 65 percent or more.",
    "Despite the uncertainty surrounding Peppers' status for the beginning of the 2022 season, some expect the market for his services in free agency to be robust.",
    "With a new head coach (Brian Daboll) and general manager (Joe Schoen) in New York who have no ties to Peppers, his days in the Big Apple are probably through.",
    "After notching 30.5 sacks over his first three seasons in Tampa Bay and making the Pro Bowl in 2020, Pierre-Paul managed only 2.5 sacks in 12 games last year.",
    "He once again missed considerable time (seven games) and finished seventh on the team in stops, trailing fellow linebackers David Long Jr. and Rashaan Evans.",
    "The smart play is to take a big chunk of that cabbage and look to upgrade Reiff with a player like Terron Armstead of the Saints or Morgan Moses of the Jets.",
    "Despite playing in 13 games, Johnson gained only 228 yards on the ground, averaged a meager 3.4 yards per carry and didn't score a touchdown on the ground.",
    "The Seahawks likely won't want to part ways with offensive linemen Duane Brown and Ethan Pocic, as their new quarterback will need all the help he can get.",
    "A rebuilding Falcons team upside down against the cap can't afford to pay that for a soon-to-be 31-year-old whose effectiveness waned later in the season.",
    "Allowing Rhodes to depart would leave a hole in the secondary, and the Colts don't have a first-round pick thanks to last year's trade for Carson Wentz.",
    "As a rookie it didn't appear that Leighton Vander Esch was going to be average, as the four-year veteran logged 102 solo tackles and made the Pro Bowl.",
    "They are sitting on less than $6 million in cap space, and that's without taking into account a potential mega-extension for quarterback Lamar Jackson.",
    "There will be veterans shown the door on both sides of the ball—including an edge-rusher who has spent the better part of the past decade in Buffalo.",
    "Last season in 13 starts, Rhodes allowed 60.7 percent of the passes thrown in his direction to be completed and had a passer rating against of 97.0.",
    "And when the 30-year-old was out last season, Talanoa Hufanga showed that he can man the box safety spot without a big drop-off in the Niners' play.",
    "\"I don't like to negotiate through the media, and I kind of felt like I might've crossed the line saying that, so I don't plan on doing that again.\"",
    "But while Jaire Alexander is one of the game's best corners and Douglas was an amazing find for the team a year ago, Sullivan has been a liability.",
    "But last year his season was over almost before it started—the 30-year-old played less than 40 snaps before suffering a season-ending arm injury.",
    "Harris has missed at least three games in each of the past two seasons, and he surrendered a passer rating over 90 each of the past three years.",
    "The Vikings don't have the resources to engage in even a limited bidding war, especially with a young replacement on the roster in Camryn Bynum.",
    "The 28-year-old is in the prime of his career, has started 23 games over the past two seasons and just helped Los Angeles win the Super Bowl.",
    "New Orleans Saints: OT Terron Armstead\nThe New Orleans Saints are still $44.9 million over the cap even after moving a bunch of money around.",
    "Johnson's first season in Houston was actually decent—the seven-year pro topped 1,000 yards from scrimmage and averaged 4.7 yards per carry.",
    "Carolina Panthers: CB Donte Jackson\nWith over $26.5 million in cap space, the Carolina Panthers have some room to do damage in free agency.",
    "If Parker expects to be paid anywhere close to a starting NFL tackle in free agency, the Raiders should let him get that payday elsewhere.",
    "Crowder hauled in 51 passes for 447 yards and two scores in 12 games last year, and the Jets have the fourth-most cap space in the league.",
    "Pittsburgh Steelers: WR JuJu Smith-Schuster\nAs the Steelers begin the post-Ben Roethlisberger era, some veteran free agents won't be back.",
    "The Dolphins desperately need to improve their run game, which managed only 92.2 yards per game last season, the third-fewest leaguewide.",
    "This next week will be filled with a flurry of similar actions, as teams decide which of their players they cannot let walk out the door.",
    "They're now sitting on only $13.4 million in cap space as free agency nears, and that's after releasing veteran linebacker Kyle Van Noy.",
    "Philadelphia Eagles: Edge Derek Barnett\nIn 2017, the Philadelphia Eagles selected Derek Barnett with the 14th overall pick in the draft.",
    "Norwell is much older than Robinson and had an average salary ($13.3 million) nearly as high as Robinson's ($13.8 million) last season.",
    "Re-upping Keanu Neal or adding a linebacker in free agency or the draft makes more sense for Jerruh's boys than re-signing Vander Esch.",
    "Chicago Bears: DL Akiem Hicks\nFor the past six seasons, Akiem Hicks has been a mainstay along the defensive line for the Chicago Bears.",
    "The Vikings broke in a new starter at safety opposite Harrison Smith last year, with Xavier Woods coming over from the Dallas Cowboys.",
    "Miami Dolphins: RB Phillip LIndsay\nThe Miami Dolphins currently have more than $51 million in cap space, which ranks third leaguewide.",
    "Considering that Harris had a cap hit of $11.3 million last season, they may be able to acquire an upgrade without spending much more.",
    "Given Green Bay's lack of cap space (the team is upside-down by the largest amount in the NFL), there are some hard decisions coming.",
    "But they do have a few potential options for the slot in Braxton Berrios (who is also a free agent) and second-year pro Elijah Moore.",
    "If they can afford to let a veteran walk because they already have a younger, cheaper option in place, they must explore that option.",
    "They also spent a first-round pick in Washington's Joe Tryon-Shoyinka last year, who showed flashes of promise as the season wore on.",
    "But after signing a one-year, $5.3 million contract in 2021, Brown fell down the pecking order among Titans linebackers last season.",
    "Hall of Fame quarterback Tom Brady has retired, and after franchise-tagging wide receiver Chris Godwin, they have minimal cap space.",
    "Kansas City added the 29-year-old last year in an effort to add some pop to the interior of its defensive line opposite Chris Jones.",
    "At the NFL combine, head coach Doug Pedersen told reporters that in a perfect world, both players would be back on the team in 2022.",
    "After playing the past several years in a three-man base front, Hicks would have had to adjust to new head coach Matt Eberflus' 4-3.",
    "His 27 catches, 394 receiving yards and one touchdown were all career lows, and Watkins reeled in just 55.1 percent of his targets.",
    "On Monday at noon ET, the \"legal tampering\" period begins, which is when teams can negotiate with outside free agents on contracts.",
    "San Francisco 49ers: S Jaquiski Tartt\nMost of the talk in San Francisco this offseason will center on quarterback Jimmy Garoppolo.",
    "After a miserable 2021 campaign in which Barnett managed only two sacks, it's time for the Eagles admit their mistake and move on.",
    "Over the past two years, Smith-Schuster has become the king of the dink-and-dunk receivers, managing a meager 8.6 yards per catch.",
    "Evans is also a free agent, but with youngster Monty Rice waiting in the wings as well, Brown's time in Nashville should be over.",
    "There will more likely than not be a team who talks itself into the idea of Hubbard as a starter, just as the Browns did in 2018.",
    "And after acquiring quarterback Carson Wentz in a trade with the Colts, a huge chunk of Washington's cap space just evaporated.",
    "However, injuries limited the 30-year-old to only eight games last year and his fewest number of snaps since the 2016 campaign.",
    "But the 49ers have a number of starters set to hit the open market, and they currently have less than $6 million in cap space.",
    "However, he isn't as explosive as fellow free agent Rashaad Penny, whom the Seahawks have expressed an interest in re-signing.",
    "As has been the case for so long with Watkins, the 28-year-old had trouble staying on the field last year, missing four games.",
    "Duke Johnson showed flashes late in the season, but the Dolphins fielded a wholly uninspiring committee for much of the year.",
    "New York Jets: WR Jamison Crowder\nJamison Crowder has led the New York Jets in receptions for each of the past three seasons.",
    "However, Pittsburgh also should strongly consider some less obvious farewells, including wide receiver JuJu Smith-Schuster.",
    "After re-upping edge-rusher Harold Landry to a five-year, $87.5 million pact, Tennessee's cap space has all but evaporated.",
    "Reed showed promising flashes here and there, but his 2.5 sacks for the season marked the third-lowest total of his career.",
    "Rhodes is a nine-year veteran and three-time Pro Bowler, but he hasn't come close to playing at that level in Indianapolis.",
    "Tennessee Titans: LB Jayon Brown\nThe Tennessee Titans don't have much wiggle room to play with relative to the salary cap.",
    "Hightower's big-play numbers were down, and he was a sizable liability in coverage, allowing 28 receptions on 31 targets.",
    "He has missed time in each of the past three seasons and has surrendered a passer rating against north of 80 three times.",
    "Lindsay burst onto the scene back in 2018, topping 1,000 rushing yards in each of his first two seasons with the Broncos.",
    "He had seven or more sacks three times over that span and was named to the Pro Bowl at the conclusion of the 2018 season.",
    "They are a Super Bowl contender, but they are right up against the salary cap with some important free agents to re-sign.",
    "To be fair, Hubbard was at least adequate as an injury fill-in two years ago, playing 290 snaps without allowing a sack.",
    "With Armstead expected to command well over $20 million annually on a new deal, the Saints can't realistically keep him.",
    "After tallying 7.5 sacks in that Pro Bowl 2018 campaign, Hicks has just eight sacks in the past three seasons combined.",
    "Durability is a concern, too—Reiff missed five games in 2022 and was sidelined for Cincinnati's run to Super Bowl LVI.",
    "Atlanta Falcons: RB Cordarrelle Patterson\nThis is the first entry in this column that will send some eyebrows skyward.",
    "Los Angeles Rams: CB Darious Williams\nThe Los Angeles Rams went all-in on winning a Super Bowl in 2021, and it worked.",
    "The road since then has been an uneven one, with flashes of game-changing ability interspersed with disappearing acts.",
    "Last season, he rushed for a career-low 249 yards and averaged only 2.8 yards per carry with the Texans and Dolphins.",
    "The former reportedly has agreed to a four-year, $200 million extension, while the latter received the franchise tag.",
    "However, he was inconsistent at times in coverage, allowing over 17 yards per completion and passer rating of 110.4.",
    "Instead of that disruptive force, though, the Chiefs got the player whom Seattle let walk after a few so-so seasons.",
    "The 30-year-old is a fine player, but he hasn't been named an All-Pro since his final year in Carolina back in 2017.",
    "Armstead has made 93 starts for the Saints over the last decade, and he earned Pro Bowl nods in 2018, 2019 and 2020.",
    "They also need to figure out what they're doing at quarterback, so they're in no position to splurge in free agency.",
    "Some team might be willing to give Scherff an annual salary close to the $18 million he got under the tag last year.",
    "When that didn't work out, the Browns gave huge money to Jack Conklin and relegated Hubbard to \"swing\" tackle duty.",
    "In a 2021 season that was preciously short on bright spots in Atlanta, running back Cordarrelle Patterson was one.",
    "Baltimore Ravens: WR Sammy Watkins\nThe Baltimore Ravens are going to have to be frugal in free agency this season.",
    "New York Giants: S Jabrill Peppers\nThe first five seasons of Jabrill Peppers' NFL career have been quite the ride.",
    "But Tartt has also struggled to stay on the field, averaging six missed games per season over the past five years.",
    "Unless he's willing to take a massive pay cut, it's time for the Pats to get younger and cheaper at the position.",
    "Minnesota Vikings: S Xavier Woods\nNine Minnesota Vikings players played 690 or more snaps on defense last season.",
    "Denver Broncos: RB Melvin Gordon III\nThere were some puzzling decisions made by Denver's coaching staff in 2021.",
    "On Wednesday at 4 p.m., those contracts can become official, and the free-agent floodgates will officially open.",
    "Of course, many teams are already busily making phone calls in an effort to keep their own free agents in town.",
    "This isn't to say that Hicks can't play the three-technique tackle spot, as he has in sub-packages in the past.",
    "Williams figures to have ample suitors on the open market despite allowing a passer rating of 95.8 last season.",
    "There's no point in retaining him, particularly if the Seahawks are headed into a rebuild or retooling process.",
    "Tampa Bay Buccaneers: Edge Jason Pierre-Paul\nThe Tampa Bay Buccaneers face quite the challenge this offseason.",
    "Collins is a plodding runner who averaged 3.8 yards per carry last year and battled multiple nagging injuries.",
    "The Vikings are already $14.7 million over the cap, so it won't be easy for them to keep all of those players.",
    "Jacksonville has the sixth-most cap space leaguewide and 12 draft picks to fill the holes all over its roster.",
    "The Jaguars franchise-tagged Robinson on Tuesday, which knocked their cap space down to roughly $40.1 million.",
    "Vander Esch made it through the entire 2021 season healthy, and his 77 total tackles ranked third on the team.",
    "But again, teams annually throw ridiculous amounts of money at any offensive lineman with even a so-so resume.",
    "He has never topped 850 receiving yards in a season, and his 8.8 yards per catch last year was a career low.",
    "Some players who played a significant role in the Bucs' Super Bowl LV victory won't be coming back in 2022.",
    "When healthy, Brown was was on the field for over 80 percent of Tennessee's defensive snaps from 2018-2020.",
    "In 2018, Smith-Schuster caught 111 passes for 1,426 yards and seven touchdowns en route to a Pro Bowl nod.",
    "\"Barnett picked the wrong year to have the worst season of his career,\" Zach Berman of The Athletic wrote.",
    "But he's also on the verge of turning 29 and has gained 1,000 rushing yards exactly once in seven seasons.",
    "Kansas City Chiefs: DT Jarran Reed\nJarran Reed was once one of the better defensive tackles in the league.",
    "They also have work to do on both sides of the ball, and many decisions to make on their own free agents.",
    "Spotrac estimates that the 26-year-old could see a four-year contract in the neighborhood of $50 million.",
    "Prior to the injury, Peppers appeared to finally be settling into a role as a safety/linebacker \"hybrid.\"",
    "The apology could be construed as an attempt to repair the team's relationship with their Pro Bowl guard.",
    "Wide receiver Sammy Watkins is similarly the elder statesman of a young wide receiver room in Baltimore.",
    "But at this point, the best thing for Washington is letting Scherff get a fat payday from another team.",
    "However, Scherff has also missed at least three games in four straight seasons, including six in 2021.",
    "Jackson is not a bad player, and at 26 the four-year veteran is just entering the prime of his career.",
    "Replacing Norwell with a less expensive free agent or rookie would free up resources to use elsewhere.",
    "In 881 snaps, Parker committed a staggering nine penalties and allowed eight sacks, according to PFF.",
    "Houston Texans: RB David Johnson\nThe Houston Texans are in the opening stages of a ground-up rebuild.",
    "After sitting out the 2020 season, he didn't display the range last season that he did in years past.",
    "Over that time, he has piled up 569 tackles, 27 sacks, two Pro Bowl nods and three Super Bowl rings.",
    "Detroit Lions: ILB Jalen Reeves-Maybin\nThe Detroit Lions have in excess of $25 million in cap space.",
    "But it's time for the next chapter in Hicks' career, and that chapter needs to begin somewhere else.",
    "Patterson has also made it clear that after one season in Atlanta he likes playing for the Falcons.",
    "Instead, the two backs split the team's carries and rushing yards just about right down the middle.",
    "In 2018, the Browns gave Hubbard $36.5 million over five seasons to be their starting right tackle.",
    "They can't afford to re-sign all of their free agents, including young cornerback Darious Williams.",
    "What the Cowboys cannot afford is wasting any of that cap space on an average off-ball linebacker.",
    "That's a good thing, because the Lions also have as many holes on the roster as any in the league.",
    "1 running back, and his 220-pound frame appears capable of holding up under an increased workload.",
    "After the season Reddick just had, the Panthers will likely make a concerted effort to retain him.",
    "\"When you get somewhere, Atlanta feels like home, so why not retire here and end my career here?\"",
    "Spotrac estimates that Patterson could command north of nine million per season on his next deal.",
    "Gordon remains a capable running back who averaged 4.6 yards per carry over the last two seasons.",
    "But it is clear those injuries have taken their toll—Vander Esch's range isn't what it once was.",
    "They don't have the resources to spend on anyone who didn't play up to expectations last season.",
    "Green\nThe Arizona Cardinals have some tricky sands to navigate when free agency opens next week.",
    "The Buccaneers already have edge-rusher Shaquil Barrett signed to a four-year, $68 million deal.",
    "It's time for Tryon-Shoyinka to move into a larger role and for Pierre-Paul to do so elsewhere.",
    "Back in 2018, the six-year veteran piled up a career-high 10.5 sacks with the Seattle Seahawks.",
    "Reeves-Maybin had the higher salary last season and would probably be more expensive to retain.",
    "Sullivan has played over 70 percent of the snaps for the Packers each of the past two seasons.",
    "He's been a Pro Bowler in each of the past three seasons and was a first-team All-Pro in 2020.",
    "If the Browns could get Hubbard back on a short-term, \"prove it\" deal, it would be one thing.",
    "If the Cardinals are going to re-up one of their receivers this offseason, it should be Kirk.",
    "But Jackson hasn't really developed into the player the Panthers hoped to be getting in 2018.",
    "Of course, the opposite is true as well—teams have to decide which players are too expensive.",
    "The Bengals are sitting on over $34 million with which to improve the protection for Burrow.",
    "He has also surrendered over 13 yards per completion in both of his seasons with the Colts.",
    "One had an $8.9 million cap hit, while the other was on the first year of his rookie deal.",
    "Given those realities, a measure of frugality with the team's other signings is necessary.",
    "When he's healthy, the 30-year-old Scherff is one of the best in the game at his position.",
    "For example, the ascension of rookie tight end Pat Freiermuth makes Eric Ebron expendable.",
    "As we take time to digest this blockbuster deal, we're going to go with an easy call here.",
    "However, the team decided to bring back the 31-year-old on a one-year, $4.8 million pact.",
    "Six of those players are unrestricted free agents, per Will Ragatz of Inside the Vikings.",
    "Anyone who didn't play a substantial role for the Titans last year should be expendable.",
    "He's 32 years old and has missed at least eight games in two of the past three seasons.",
    "But for every team in the league, there's at least one player it should say goodbye to.",
    "However, he has amassed only 1,512 receiving yards in the last three seasons combined.",
    "At the NFL Scouting Combine, Mayhew told reporters that he regretted that statement.",
    "Buffalo Bills: Edge Jerry Hughes\nThis is a critical offseason for the Buffalo Bills.",
    "There's zero point in keeping around a 30-year-old back with those kinds of numbers.",
    "But the biggest head-scratcher of the lot was easily the team's running back usage.",
    "But as he nears his 33rd birthday, it's clear that he isn't the player he once was.",
    "The Steelers have a pair of solid wideouts in Chase Claypool and Diontae Johnson.",
    "For a good portion of the 2021 season, Alex Collins was the lead back in Seattle.",
    "The 28-year-old has missed at least four games in three of the past four seasons.",
    "The 33-year-old is now a lot closer to the end of his career than the beginning.",
    "That means the Texans can't afford to throw money away on their own free agents.",
    "Detroit also doesn't need to create any more holes on the roster than necessary.",
    "For many years, Chris Harris Jr, was one of the league's best at the position.",
    "That means some other free agents are going to be victims of the numbers game.",
    "But the Ravens would be well-served to let Watkins find a fourth team in 2022.",
    "Seattle should have ample cap space to re-sign free safety Quandre Diggs, too.",
    "Those numbers aren't worth the $5 million Baltimore paid Watkins last season.",
    "His passer rating against of 86.5 in 2021 isn't great, but it's respectable.",
    "The 25-year-old missed most of the 2021 season, playing in only five games.",
    "Spotrac projects Crowder's annual market value to be north of $12 million.",
    "He'll all but certainly one day be inducted into the team's Ring of Honor.",
    "Dont'a Hightower has been a mainstay on the Patriots defense for a decade.",
    "That performance isn't good enough for a team with Super Bowl aspirations.",
    "And if that's the case, the Browns should wish him well and wave goodbye.",
    "But in a perfect world, the Lions will figure out a way to upgrade both.",
    "Woods tallied a career-high 108 tackles, which ranked third on the team.",
    "New England now needs to continue to make over the linebacker position.",
    "However, the team is facing some harsh financial realities as a result.",
    "We're always going to be looking at it as long as I'm the head coach.\"",
    "That means it's likely bye-bye time for inside linebacker Jayon Brown.",
    "So corner is definitely going to be something that we're looking at.",
    "He's not the only longtime Cowboy who could be headed out the door.",
    "Tagging him again would be prohibitively expensive for Washington.",
    "\"He has talent and could fulfill the promise that made him the No.",
    "Depth at safety is one of the few problems the G-Men don't have.",
    "They could use depth behind Conklin and youngster Jedrick Wills.",
    "His PFF grade of 55.8 fell firmly in the \"replaceable\" category.",
    "However, he wasn't any better at that spot than Leatherwood was.",
    "And when Watkins was out there, he wasn't especially productive.",
    "Just keeping those players in the fold will be difficult enough.",
    "Patterson said, via Michael Rothstein's From the Perch podcast.",
    "\"I would love to have them all back, honestly,\" Pederson said.",
    "\"But we know this business is driven by the dollars and cents.",
    "Leading tackler De'Vondre Campbell is about to hit the market.",
    "And wide receivers Allen Lazard and Marquez Valdes-Scantling.",
    "But the team doesn't have much choice at off-ball linebacker.",
    "Either way, Miami should be pursuing an upgrade over Lindsay.",
    "Edge-rusher Jason Pierre-Paul should be one of those players.",
    "Hightower had a cap hit of nearly $12.4 million last season.",
    "That means it's time for left tackle Terron Armstead to go.",
    "Letting Scherff walk would sting, but it's the right move.",
    "That also made re-upping Norwell that much more difficult.",
    "Things are about to get really interesting around the NFL.",
    "But after a career season he's also looking for a payday.",
    "But the Packers have a slew of other pending free agents.",
    "That could mean pursuing an upgrade over Brandon Parker.",
    "Cornerback Donte Jackson should be one of those victims.",
    "There's also the matter of the scheme change in Chicago.",
    "The Jets should be in no hurry to make it four straight.",
    "That's the situation with veteran safety Jaquiski Tartt.",
    "They have plenty of money to re-sign him if so desired.",
    "However, durability has long been an issue for Crowder.",
    "But at 31, Hightower is on the downslope of his career.",
    "I mean, five-DB defenses lead the NFL by a wide margin.",
    "But in 2021 the bottom dropped out of his productivity.",
    "One year later, it's officially time to say goodbye.",
    "But Williams showed last season that he can be a No.",
    "Kansas City's 31 total sacks ranked 29th in the NFL.",
    "We'll make decisions that are best for the Jaguars.\"",
    "Epenesa and Greg Rousseau to step into larger roles.",
    "Never mind one of the biggest trades in NFL history.",
    "The Jets don't have a ton of depth at wide receiver.",
    "\"I probably went too far into that,\" Mayhew said.",
    "For starters, Hicks isn't the player he once was.",
    "They're going to have to make some tough choices.",
    "So are cornerbacks Rasul Douglas and Kevin King.",
    "They badly need to bolster their offensive line.",
    "In 2020, he set a career high with 91 tackles.",
    "His statistical production has also plummeted.",
    "And time for Hughes' tenure in Buffalo to end.",
    "For others, it's a gut-wrencher of a decision.",
    "Green is a luxury the Redbirds cannot afford.",
    "and on the edge after Khalil Mack was traded.",
    "Slot cornerback Chandon Sullivan needs to go.",
    "But since, then his production has plummeted.",
    "They need help at just about every position.",
    "The Green experiment wasn't a total failure.",
    "They have less than $5 million to work with.",
    "Phillip Lindsay was part of said committee.",
    "For some teams, it's an easy call to make.",
    "When healthy, Tartt is a capable veteran.",
    "Cap-space figures accurate as of 6 p.m.",
    "But also retaining veteran wideout A.J.",
    "The big difference between the two?",
    "All salary-cap figures via Spotrac.",
    "They don't really need to, either.",
    "It's time for youngsters like A.J.",
    "That means Reed needs to move on.",
    "But it wasn't a success either.",
    "But then the injuries set in.",
    "Seven missed games in 2019.",
    "Arizona Cardinals: WR A.J.",
    "They shouldn't even try.",
    "But at least one isn't.",
    "Or a mixture of both.",
    "Maybe the biggest.",
    "Too expendable.",
    "\"It feels good.",
    "ET on Thursday.",
    "B/R Recommends",
    "Six in 2020."
  ]
}