{
  "id": 3572,
  "mediaId": 2605,
  "date": "2022-03-16",
  "headline": "Rams lose another super contributor as Von Miller gets six-year deal with Buffalo Bills",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/b1491c0/2147483647/strip/true/crop/7203x3782+0+691/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F74%2F68%2Fed50503b4c98a2562849160a248a%2F914165-sp-0213-super-bowl-336-wjs.jpg",
  "link": "https://www.latimes.com/sports/rams/story/2022-03-16/von-miller-agrees-to-six-year-120-million-contract-with-buffalo-bills",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Cornerback Darious Williams, a two-year starter, agreed to terms with the Jacksonville Jaguars, and tight end Johnny Mundt agreed to terms with the Minnesota Vikings, where former Rams offensive coordinator Kevin O’Connell is the head coach and former tight ends coach Wes Phillips is offensive coordinator.",
    "On Wednesday, the Rams lost another key part of their Super Bowl-winning team when Miller agreed to terms with the Buffalo Bills, who reportedly gave Miller a six-year contract that includes $51 million in guarantees and averages $17.5 million per year for the first four years, according to NFL.com.",
    "It remains to be seen what effect Miller’s departure might have on Donald, who has not publicly disputed a pre-Super Bowl television report that he might consider stepping away if the Rams won the championship.",
    "The three-time All-Pro had five sacks in eight regular-season games for the Rams and added four in the playoffs, including two in the Super Bowl LVI victory over the Cincinnati Bengals at SoFi Stadium.",
    "A day after veteran left tackle Andrew Whitworth retired, clearing $16 million in salary-cap space, the Rams also released four-time All-Pro punter Johnny Hekker — their longest tenured player.",
    "Williams and Miller were the third and fourth Rams defensive players to find new teams, joining Okoronkwo and nose tackle Sebastian Joseph-Day, who agreed to terms with the Chargers on Monday.",
    "If they sign offer sheets with other teams, and the Rams opt not to match the offers, the Rams would receive a fifth-round draft pick as compensation for Gay, a seventh-round pick for Howard.",
    "40 open?”\nAt a post-Super Bowl parade rally, star defensive lineman Aaron Donald said the Rams could “run it back” if they kept their “super” team in place, and that included Miller.",
    "The Rams had prioritized re-signing Miller, tackle Joe Noteboom and center Brian Allen, along with receiver Odell Beckham Jr., who suffered a knee injury during the Super Bowl.",
    "Obo Okoronkwo agreed to terms with the Houston Texans on Monday, so Justin Hollins, Terrell Lewis and Chris Garrett are the in-house candidates to replace Miller.",
    "Other former Rams who are unrestricted free agents: Running backs Sony Michel and Buddy Howell, cornerback Donte Deayon and kick returner Brandon Powell.",
    "Miller, who will turn 33 this month, was traded from the Denver Broncos to the Rams last October in exchange for second- and third-round draft picks.",
    "Noteboom and Allen agreed to terms with the Rams on Monday, and the Rams announced that Noteboom signed his contract Wednesday.",
    "All NFL teams were required to be under the $208.2-million salary cap by Wednesday, the start of the NFL’s new league year.",
    "Donald clearly enjoyed playing with Miller, a certain Hall of Famer who encouraged Donald to become a more vocal leader.",
    "Kicker Matt Gay and inside linebacker Travin Howard, who are restricted free agents, were given original-round tenders.",
    "He played in eight games last season before suffering a chest muscle injury that sidelined him until the playoffs.",
    "The Rams attempted to retain him, but Miller announced in an Instagram video that he was signing with the Bills.",
    "Both were important pieces the last few seasons, but Miller’s departure qualifies as a high-profile loss.",
    "He was below Miller, Okoronkwo and Hollins on the depth chart, and he is not utilized on special teams.",
    "Lewis, a third-round draft pick in 2020, was inactive for the last five games and the playoffs.",
    "Hollins emerged as a valuable player in 2020 under former defensive coordinator Brandon Staley.",
    "The move was anticipated because of the 10-year veteran’s $3.2 million salary-cap number.",
    "“It’s been crazy, man, crazy four hours, going back and forth, man,” Miller said.",
    "As a rookie last season, Garrett was active for three games and played in one.",
    "The Rams will attempt to “run it back” without outside linebacker Von Miller.",
    "Offensive lineman Austin Corbett agreed to terms with the Carolina Panthers.",
    "As of Wednesday, Beckham had not announced with whom he would sign.",
    "Miller’s departure leaves the Rams thin at outside linebacker.",
    "But I just wanted to let you know, I’m coming to Buffalo.",
    "“A lot of things I love in L.A.",
    "Bills Mafia, what’s good?",
    "Is [jersey No.]"
  ]
}