{
  "id": 3857,
  "mediaId": 2605,
  "date": "2022-03-02",
  "headline": "Sean McVay to keep coaching with revamped Rams staff, but fiancee, Ukraine also on his mind",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/c5cf1cc/2147483647/strip/true/crop/4276x2245+0+303/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F76%2Ffb%2F8bb866294e41aa9177703a56049a%2F914165-sp-0213-super-bowl-081-wjs.jpg",
  "link": "https://www.latimes.com/sports/rams/story/2022-03-02/sean-mcvay-coach-revamped-staff-fiance-urkaine-russia",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“He’s earned the right to take a little bit of an exhale,” McVay said, adding, “Once he digests it all, I’m going to do everything in my power to make it enticing for him to want to come back and be a foundational part of us trying to do a great job of playing really well.”\nThe Rams, who do not have a pick in the first, second or third round of the draft, are prioritizing their impending free agents, among them linebacker Von Miller, receiver Odell Beckham Jr., cornerback Darious Williams and offensive linemen Joe Noteboom, Brian Allen and Austin Corbett.",
    "… My thoughts and prayers are with so many people that are unfortunately affected by this terrible time.”\nThe usually upbeat McVay was more reserved throughout a near 30-minute media session, during which he addressed his immediate future, his and general manager Les Snead’s decision not to attend the NFL scouting combine in Indianapolis, staff changes and the start of free agency, which begins in two weeks.",
    "“I’m really excited about continuing to move forward with this group.”\nThe Rams, who last month defeated the Cincinnati Bengals in Super Bowl LVI at SoFi Stadium, will try to become the first team since the New England Patriots in the 2003 and 2004 seasons to win consecutive Super Bowl titles.",
    "“You don’t want to minimize the value of combine but for us that’s what we felt like was going to be the best approach.”\nAmong the Rams’ “incredibly high” priorities are working out new contracts for quarterback Matthew Stafford and defensive lineman Aaron Donald, McVay said.",
    "... You start from square one, and there’s going to be a lot of turnover.”\nAfter the Super Bowl, six assistants left for jobs with more responsibilities, including offensive coordinator Kevin O’Connell, now head coach of the Minnesota Vikings.",
    "Former Denver Broncos assistant Chris Beake will become the inside linebackers coach, Skyler Jones will be an assistant defensive line coach and Jeremy Springer will be a special teams assistant, McVay said.",
    "McVay said former assistants Liam Coen and Greg Olson would rejoin the staff, and that Jake Peetz, Louisiana State’s offensive coordinator last season, also would be an assistant on offense.",
    "McVay said the last few weeks have been “quite a whirlwind, to say the least.”\nMcVay, 36, confirmed that broadcast networks had expressed interest in him transitioning to a media role.",
    "Snead and McVay “sat together this week and put together an action plan, and feel like we can execute it from here maybe more efficiently than in Indy,” Snead said.",
    "... Just watching the grace at which she’s handled this, how strong her family’s been in the midst of this, I’m just so proud to be associated with that culture.",
    "Thomas Brown, running backs coach the last two seasons, will coach tight ends and is leading the search for a new running backs coach, McVay said.",
    "“Les and I felt like our time would be best utilized staying back, being able to do some things and there’s a lot of layers to that,” McVay said.",
    "He said he was “flattered by some of the opportunities and interest,” but “there was never really a doubt,” he would continue to coach the Rams.",
    "“And you want to be able to try and keep as many foundational pieces in place while not being naïve to the fact that it’s a brand new year.",
    "Snead said the Rams have “a pretty good feel for the direction” Whitworth wants to move, but that nothing had been officially decided.",
    "“That is something that way down, that down the line, I think that I would be interested in, some of the media things,” he said.",
    "Snead and McVay said they opted to skip the combine so that they could more efficiently prepare for the draft and free agency.",
    "The joy and relief born from the Rams’ Super Bowl victory has been tinged by other emotions for coach Sean McVay.",
    "Left tackle Andrew Whitworth, 40, has said that he was evaluating whether to retire or return for another season.",
    "McVay’s fiancee, Veronika Khomyn, is from Ukraine and has family in the war-torn country, McVay said Wednesday.",
    "Donald has three years remaining but has not completely dismissed a report that he was considering retiring.",
    "The Rams have training staff personnel and a few assistant coaches and scouts on site in Indianapolis.",
    "“My thoughts and prayers are with Ukraine,” McVay said as he opened a videoconference with reporters.",
    "“But my heart is in coaching, with these players, with these coaches with this ownership group.",
    "“It was certainly a special journey and now you start to move forward,” McVay said.",
    "This is real type of stuff right here and it gives you really a perspective.",
    "Snead also spoke with reporters during a separate videoconference.",
    "McVay and Donald “have had a great dialogue,” McVay said.",
    "“President Zelensky’s leadership has been incredible.",
    "Stafford is entering the final year of his contract.",
    "“This obviously hits home with me."
  ]
}