{
  "id": 4107,
  "mediaId": 2586,
  "date": "2022-02-24",
  "headline": "Trade Proposal Flips Former Vikings First-Round Pick For Edge Rusher",
  "image": "https://heavy.com/wp-content/uploads/2022/02/GettyImages-1289768042-e1645753815984.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/minnesota-vikings/trade-rumors-garrett-bradbury-hollins-rams/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Dible",
  "authorUrl": "https://heavy.com/author/maxdible1/",
  "termIds": [
    1728,
    1967,
    3053,
    3177,
    3503,
    636,
    5153,
    5154
  ],
  "sentences": [
    "“Halfway through the 2021 campaign, Bradbury was benched with a 35.9 pass-blocking grade that ranked dead last among centers with at least 50 such snaps through Week 8.”\nHollins Can Take Edge Snaps if Vikings Move on From DE Hunter\nQuarterback Andy Dalton of the Chicago Bears tries to escape from defensive tackle Aaron Donald (left) and defensive edge Justin Hollins (right) of the Los Angeles Rams on Sunday, September 12.",
    "Replacing the edge rusher with a younger and healthier Hollins on a one-year prove-it deal for the price of Bradbury, then assuming a new direction at center in the form of an Allen signing in free agency appears a logical path forward for the new regime in Minnesota.",
    "(Photo by Hannah Foslien/Getty Images)\nThe Minnesota Vikings may end up at the center of major trades this offseason involving the likes of quarterback Kirk Cousins or defensive end Danielle Hunter, but it’s a less flashy move Vikings fans should look out for.",
    "Ham #30 of the Minnesota Vikings is congratulated by teammate Garrett Bradbury #56 after Hamm scored a touchdown in the third quarter against the Jacksonville Jaguars at U.S. Bank Stadium on December 06, 2020 in Minneapolis, Minnesota.",
    "He has been afforded limited opportunities to showcase his skills in Los Angeles over the last couple of seasons, playing behind the likes of pass rushers Von Miller and Leonard Floyd on perhaps the best defensive front in the NFL.",
    "“With a lot of Rams players in need of new contracts, staying cheap at center with a proven scheme fit in the run game could be a necessary gamble [in Los Angeles].”\nALL the latest Vikings news straight to your inbox!",
    "“Bradbury was drafted with the 18th overall pick at a non-premium position because he excelled as a zone run blocker — pretty much the opposite of how a team should approach using a top-20 pick,” Spielberger wrote.",
    "Los Angeles would be on the hook for the last guaranteed year of Bradbury’s rookie contract at a value of just over $2.25 million, with a fifth-year team option at their disposal should they decide to use it.",
    "While largely durable, Bradbury underperformed his draft position last season with an overall offensive rating of 60.1, per Pro Football Reference (PFF), ranking him 29th out of 39 qualifying centers.",
    "PFF’s Brad Spielberger believes the Vikings will look to move off Bradbury’s deal in exchange for an edge defender to bolster the defensive interior — namely Justin Hollins of the Los Angeles Rams.",
    "Minnesota may need Hollins to eat up several snaps on the defensive edge, depending on how new Vikings general manager Kwesi Adofo-Mensah chooses to handle a difficult decision on Hunter.",
    "Spielberger believes an upgrade at center resides in the back pocket of Minnesota’s new head coach, making the hypothetical trade proposal that much more logical and desirable.",
    "Garrett Bradbury has started 45 of a possible 49 games at center in Minnesota since the Vikings drafted him with the 18th overall pick in the first round of the 2019 NFL Draft.",
    "Bradbury’s Pass-Blocking Woes Have Defined His Time With Vikings\nMinnesota Vikings center Garrett Bradbury has struggled as a pass blocker since entering the NFL in 2019.",
    "If the Vikings are unable to move Cousins’ contract, or if they decide they don’t want to, Hunter will transition from a serious trade candidate to a highly likely one.",
    "A subpar pass-blocking grade of just 43.7 reflects Bradbury’s primary struggle since entering the league as a highly-rated prospect out of North Carolina State.",
    "“Kevin O’Connell is the former Rams offensive coordinator, and Rams center Brian Allen is slated to be a free agent this offseason,” Spielberger wrote.",
    "Minnesota would incur a cost of approximately $1.85 million in dead money by making the trade — the amount of Bradbury’s annual signing bonus.",
    "Over his three-year career, Hollins has appeared in 39 games for the Rams and the Denver Broncos, including two starts last season in L.A.",
    "The Rams would also send the Vikings a seventh-round draft selection in 2022 via the Miami Dolphins as part of the suggested proposal.",
    "Hunter’s contract carries a $26 million cap hit next season, while Minnesota needs to shed nearly $15 million to get under the cap.",
    "The two-time Pro-Bowler amassed 29 sacks between 2018-19, but has struggled to stay on the field over the last two seasons.",
    "He has amassed 71 total tackles, 8 quarterback hits, 6 sacks, 5 tackles for loss and 2 forced fumbles during that time.",
    "Hollins, also 26 years old, is on a one-year deal worth just shy of $1 million.",
    "Join the Heavy on Vikings newsletter here!",
    "C.J."
  ]
}