{
  "id": 4871,
  "mediaId": 2641,
  "date": "2022-02-18",
  "headline": "Rep. Scott Perry to Newsmax: Russian Crisis Over Ukraine Created by Biden",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=66dc179f-eebf-4e2b-917c-dd2bca3beee7&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/newsmax-tv-scott-perry-russia-ukraine/2022/02/18/id/1057544/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luca Cacciatore",
  "authorUrl": "",
  "termIds": [
    1728,
    1872,
    2140,
    2318,
    3975,
    409,
    715,
    5287,
    5366
  ],
  "sentences": [
    "''We're fueling what's allowing Russia to have 190,000 troops on the Ukrainian border,'' said Perry, who is seeking reelection this year in Pennsylvania's 10th Congressional District and faces challenger Brian Allen in the GOP primary on May 17, according to Ballotpedia.",
    "''I'm not sure they are going to invade quite honestly, especially when President Biden and the European countries like Germany, our NATO allies, are giving them everything they want without an invasion,'' he added.",
    "''When he [Biden] relieved the sanctions on essentially the CEO of Nord Stream 2 [Russia], that certainly was a green light for Vladimir Putin that everything was on the table for the taking,'' the congressman said.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV’s including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nSpecial Links:",
    "Perry, chairman of the House Freedom Caucus, said on ''Greg Kelly Reports'' that Biden's strategic actions have exacerbated the crisis over an allegedly imminent Russian invasion of Ukraine.",
    "Let's see what we can get to reestablish the old Soviet Union because we've got a guy in the office in the United States of America that isn't going to do a darn thing,''' Perry said.",
    "Perry also criticized Biden's initial decision to remove sanctions on the construction of the Nord Stream 2 pipeline from Russia into central Europe.",
    "Rep. Scott Perry, R-Pa., told Newsmax on Friday that the crisis over whether Russia will invade Ukraine has been ''created by President Joe Biden.''",
    "Perry attributed Biden's weak leadership to Russian President Vladimir Putin's decision to ''reestablish the old Soviet Union.''",
    "The emperor has no clothes now, and the world knows it, which is really, really dangerous.''",
    "''This is all made by President Joe Biden — who talks tough but absolutely does nothing.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "''Vladimir Putin watched our dismal withdrawal from Afghanistan.",
    "Humiliating defeat for the United States of America.",
    "And he said, 'Well, I think it's time to roll now.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "And you know what?",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}