{
  "id": 4988,
  "mediaId": 2586,
  "date": "2022-02-24",
  "headline": "Former Steelers Fifth-Round Pick Drafted by Birmingham Stallions",
  "image": "https://heavy.com/wp-content/uploads/2022/02/GettyImages-1025404042.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/pittsburgh-steelers/cornerback-brian-allen-drafted-birmingham-stallions/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Zasky",
  "authorUrl": "https://heavy.com/author/jasongzasky6/",
  "termIds": [
    1290,
    1728,
    2743,
    3029,
    3441,
    4525,
    4558,
    129,
    184,
    823
  ],
  "sentences": [
    "ALSO READ:\n• Pittsburgh Maulers Select Ex-Giants QB in First Round of USFL Draft\n• Steelers Inside Linebacker Named the Team’s Top ‘Cut Candidate’\n• Analyst Predicts WR JuJu Smith-Schuster Will Sign With Steelers’ Hated Rival\n• Steelers Predicted to Trade for ‘Elite Bridge’ Quarterback\n• Trai Essex Urges Steelers to Sign Former No.",
    "Lynch spent time on Pittsburgh’s practice squad in 2019 before being elevated to the team’s active roster, where he sat behind backup Mason Rudolph and third-stringer Devlin ‘Duck’ Hodges, who handled all the quarterback duties while Ben Roethlisberger was out of the lineup with a season-ending elbow injury.",
    "The Michigan Panthers Drafted 3 Players With a Steelers Connection\nMeanwhile, the Michigan Panthers selected three players who spent time in Pittsburgh, including defensive lineman Cavon Walker, who played at Maryland and signed with the Steelers in April 2020 after the XFL folded.",
    "#Steelers #ATLvsPIT pic.twitter.com/ZjIeZHUmHv\n— Chat Sports (@ChatSports) August 20, 2017\nAs for Askew-Henry, he signed with the Steelers in 2019 as an undrafted free agent out of West Virginia but was waived during the final round of cuts.",
    "#GiddyUp pic.twitter.com/FHfnsq4Lfn\n— Birmingham Stallions (@USFLStallions) February 23, 2022\nThe 27-year-old played his college ball at Oregon, appearing in three games for the Steelers in 2019 and one for the Atlanta Falcons in 2020.",
    "The Utah product went on to spend time with the Seattle Seahawks, Buffalo Bills & San Francisco 49ers, and started one game for the 49ers in 2020 before being added to the practice squad of the Cincinnati Bengals late in the season.",
    "Williams—who went undrafted out of Texas A&M in 2015—spent time with the Steelers in 2017, and is best remembered for the punt return for touchdown he authored in a preseason game against the Falcons.",
    "But of the eight USFL draft picks who have some connection to the Steelers, the one who came into the NFL with the most fanfare—at least in terms of draft pedigree—was cornerback Brian Allen.",
    "The Panthers also snapped up quarterback Paxton Lynch, a former first-round pick of the Denver Broncos, who most recently spent time with the CFL’s Saskatchewan Roughriders.",
    "The New Jersey Generals, Too\nIf you recognize the names of running back Trey Williams and safety Dravon Askew-Henry, you’re probably among the most hardcore Steelers fans.",
    "Rasheed Bailey #16 of the Carolina Panthers can't make the catch against Brian Allen #29 of the Pittsburgh Steelers during a preseason game on August 30, 2018.",
    "#GiddyUp pic.twitter.com/SxIf3PnT02\nAllen—6-foot-3 and 215 pounds—appeared in 16 games for the Steelers in 2017-18, playing exclusively on special teams.",
    "Finally, the Panthers also added defensive lineman T.J. Carter, a former undrafted free agent out of Kentucky who signed with the Steelers in 2021.",
    "Former Pittsburgh Steelers wide receiver Eli Rogers may be the most accomplished former Steelers player to be selected in the USFL’s 2022 Draft.",
    "The Cleveland Browns signed Allen away from the Bengals in January 2021 and then re-upped with him this past spring.",
    "Allen will be teammates with running back Tony Brooks-James, who was the first back selected by the Stallions.",
    "Trey Williams (@twll3) takes the punt 64 yards all the way back to the end zone for the impressive TD!",
    "173 overall), and the first defensive back taken by the Birmingham Stallions in the 2022 USFL Draft.",
    "Follow the Heavy on Steelers Facebook page for the latest breaking news, rumors and content!",
    "All of the above-named players look forward to training camps that begin on March 21.",
    "The 28-year-old Texas native was a fifth-round pick of the Steelers in 2017 (No.",
    "He made it through to the final round of roster cuts before getting waived.",
    "But he played just 34 special teams snaps in three games this past season.",
    "He lasted until the second-to-last round of roster cuts this past summer.",
    "The latest Steelers news straight to your inbox!",
    "Join the Heavy on Steelers newsletter here!",
    "We have selected our first DB of the draft!",
    "The USFL season gets underway on April 16.",
    "2 Overall QB to Start in 2022",
    "Our first RB of the draft!",
    "What a return!"
  ]
}