{
  "id": 5010,
  "mediaId": 2707,
  "date": "2022-02-15",
  "headline": "Rams face these 10 offseason issues as they seek Super Bowl repeat",
  "image": "https://www.ocregister.com/wp-content/uploads/2022/02/LDN-L-SUPER-BOWL-LVI-16x9-1.jpg?w=1024&h=579",
  "link": "https://www.ocregister.com/2022/02/15/rams-face-these-10-offseason-issues-as-they-seek-super-bowl-repeat/",
  "mediaOutlet": "The Orange County Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Modesti",
  "authorUrl": "https://www.ocregister.com/author/kevin-modesti/",
  "termIds": [
    2710,
    2873,
    3274,
    3368,
    3518,
    570
  ],
  "sentences": [
    "If O’Connell’s successor comes from the current staff, the leading internal candidate could be Thomas Brown, the running backs coach who also carries the title of assistant head coach, and the top external possibility could be University of Kentucky OC Liam Coen, who used to coach Rams quarterbacks.",
    "“I think we definitely, really, really think we have the core and the base (of the roster) in place to continue being a contender for the NFC West,” Snead said last week, “not only this year, not only next year but into some years to come.”\nWhat comes after Super Bowl LVI for the triumphant Rams?",
    "Full-time or frequent starters who could become unrestricted free agents on March 16 include wide receiver Odell Beckham Jr., outside linebacker Von Miller, running back Sony Michel, right guard Austin Corbett, center Brian Allen, nose tackle Sebastian Joseph-Day and cornerback Darious Williams.",
    "As usual, the Rams won’t have a first-round pick in the April 28-30 draft after sending it and two other choices to the Detroit Lions in the Stafford trade, and they won’t have a second-rounder either after giving up that and a third-rounder to the Broncos for Miller.",
    "Adding “I” to the Roman numerals is easy, but the chances of defending the title in next year’s Super Bowl LVII in Arizona will depend on the Rams’ answers to hard questions that will start coming at them after Wednesday’s parade in Exposition Park.",
    "SEAN McVAY\nMcVay, 36, the youngest head coach to win a Super Bowl, hasn’t shot down speculation about how long he wants to coach, seeing that he wants to start a family with fiancee Veronika Khomyn and networks see a future for him in broadcasting.",
    "That’s a relief for any fans who thought trading more high draft picks to go all-in on winning the Super Bowl in the season it would be played at SoFi Stadium meant the Rams cared less about the seasons ahead.",
    "Andrew Whitworth is expected to retire, and what a way to go out, as the first left tackle to play at 40, the NFL’s Walter Payton Man of the Year Award winner and a Super Bowl champion for the first time.",
    "Offensive coordinator Kevin O’Connell is scheduled to be introduced as the Minnesota Vikings’ head coach on Thursday, and secondary coach Ejiro Evero is becoming the Denver Broncos’ defensive coordinator.",
    "View the above in the context of the Rams being projected by overthecap.com’s payroll analysts to have the 28th least amount of salary cap space after paying contract bonuses based on the team’s success.",
    "Others with a year to go include running back Darrell Henderson, right tackle Rob Havenstein and left guard David Edwards, defensive linemen A’Shawn Robinson and Greg Gaines, and safety Taylor Rapp.",
    "McVay, who plans to get married this summer, is the sixth highest-paid NFL coach with an $8.5 million salary and two years to go on the extension he signed after the Rams’ Super Bowl run in 2019.",
    "MOTIVATION\nAfter talking so much about wanting to win a Super Bowl for Donald, Whitworth, Johnny Hekker, Eric Weddle and other respected Rams veterans, where does that extra juice come from now?",
    "“It goes without saying you’d like that to continue.”\nRETIREMENTS\nAaron Donald hasn’t disputed reports he would consider retiring if the Rams won the Super Bowl, his last stated career goal.",
    "While third-round pick Ernest Jones started at inside linebacker in the Super Bowl, the Rams’ eight other 2021 draft picks will be battling for bigger roles than they had this season.",
    "“Understanding, though, that there’s so much work that has to be done, so much time, so much effort, so much sacrifice has to go into that.”\nIt can wait until after the parade.",
    "Sixth lineman Joe Noteboom can be an unrestricted free agent, but his chances of staying could rise if Whitworth retires and opens the left tackle starting spot.",
    "The NFC West was the league’s toughest division, and the San Francisco 49ers, Arizona Cardinals and Seattle Seahawks all have quarterback issues to sort out.",
    "Wide receiver Cooper Kupp was asked if the Rams are capable of being the first Super Bowl champions to repeat since the New England Patriots in 2003-2004.",
    "“While many things have changed over the last five years, we’ve had unbelievable, unwavering leadership from Sean and Les,” Rams COO Kevin Demoff said.",
    "It’s worth noting that the Rams’ cap deficit was the worst in the league going into the 2021 free agent season, and things worked out OK.",
    "Right now, the Rams have eight picks in the seven rounds, six of those as compensation for losing free agents and executive Brad Holmes.",
    "The three-time NFL Defensive Player of the Year’s average salary of $22.5 million ranks 23rd among NFL players – barring an extension.",
    "Stafford’s five-year, $135 million deal is up after 2022, and even at age 34, he’s the most obvious candidate for an extension.",
    "Assuming Wolford seeks a chance to play more elsewhere, 2021 preseason star Bryce Perkins becomes Matthew Stafford’s backup.",
    "“If you’re going into a season and didn’t think you can win it all, it would be a pretty depressing place to play from.",
    "Before the Rams won Super Bowl LVI on Sunday, Rams general manager Les Snead was talking about what might come next.",
    "It will be the fourth time in five offseasons that McVay changes his offensive or defensive coordinator or both.",
    "But overthecap.com ranks them 32nd and last in “draft capital.”\nOffensive line positions could be a priority.",
    "EXTENSIONS\nAs Demoff said Monday, when you win a Super Bowl, everybody deserves to be rewarded.",
    "Tiny second-round pick Tutu Atwell must show he can survive as a receiver or kick returner.",
    "Fourth-rounder Robert Rochell had a flurry of action in the secondary before getting hurt.",
    "Donald, 30, has three years and more than $50 million left on his six-year contract.",
    "Restricted free agents include kicker Matt Gay and inside linebacker Troy Reeder.",
    "McVay showed confidence in wide receiver Ben Skowronek, a seventh-rounder.",
    "Exclusive-rights free agents include backup quarterback John Wolford.",
    "FREE AGENTS\nThe contracts of more than a dozen Rams players are up.",
    "Snead, too, is under contract through 2023 under a 2019 extension.",
    "Beckham’s situation is complicated by his Super Bowl knee injury.",
    "They’ll have something to do with how the Rams do in 2022.",
    "Of course, far from everybody will get a bigger contract.",
    "You go into every year believing that.",
    "Here are 10 issues (so far) to watch.",
    "“I mean, certainly,” Kupp said.",
    "Are more extensions in order?",
    "Oh, them."
  ]
}