{
  "id": 5098,
  "mediaId": 2586,
  "date": "2022-02-18",
  "headline": "Insider Says 49ers ‘Would Weaken’ Champs With Key Signing",
  "image": "https://heavy.com/wp-content/uploads/2022/02/GettyImages-1200702683-e1645208901852.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/san-francisco-49ers/champs-weakened-with-possible-signing/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lorenzo Reyna",
  "authorUrl": "https://heavy.com/author/lorenzoreyna714/",
  "termIds": [
    1817,
    1993,
    2328,
    3258,
    3545,
    3757,
    570,
    924
  ],
  "sentences": [
    "The Free Agent Addition Who ‘Would Weaken’ the Rams\nIn a Thursday article from The Athletic pinpointing the biggest needs for all 32 teams, 49ers insider Matt Barrows pointed out guard as the “position of greatest need.”\nThe biggest priority, Barrows says, is resigning Laken Tomlinson following a a Pro Bowl season.",
    "However, Barrows believes if Tomlinson isn’t brought back, here’s where the 49ers can hit their division rival hard:\n“Miss out on Tomlinson and the team will likely would have to bring in a veteran such as Austin Corbett — which would weaken the Rams,” Barrows said.",
    "The 49ers could also clear more room if they’re able to find a trade suitor immediately for quarterback Jimmy Garoppolo and which team could be willing to take on what’s left of his $137.5 million deal which includes his $24.2 million base salary.",
    "pic.twitter.com/z8BIEru2y8\n— Brandon Thorn (@BrandonThornNFL) September 29, 2021\nCorbett also proves to be a violent finisher — regardless if it’s a Pro Bowl lineman like Suh or Pro Bowl linebacker like Bobby Wagner:\nYes Kupp had nice block.",
    "But here’s one reason why the former Nevada Wolf Pack could be a natural fit for the 49ers: His dominance in zone and gap running plays as seen below:\nAustin Corbett might've played his best game as a Ram in this one.",
    "But there’s two other free agents representing the front line: 32-year-old guard Tom Compton ($1,075,000 value) and 28-year-old tackle Daniel Brunskill ($850,000), the latter also playing some guard.",
    "— Adam Schefter (@AdamSchefter) February 14, 2022\nFit & Value\nThe 26-year-old has made sure he’s made the most of his opportunity with the Rams after being shipped away by the Cleveland Browns.",
    "And, with Andrew Whitworth likely heading to retirement, the Rams may become more pressed to resign his potential replacement Joe Noteboom as noted by Rams Athletic reporter Jourdan Rodrigue.",
    "Rams free agents after this game include Odell Beckham Jr, Von Miller, Darious Williams, Sony Michel, Austin Corbett, Donte Deacon, Joseph Noteboom, Matt Gay, Troy Reeder, Will Compton.",
    "(@TL_LARams) October 8, 2021\nAnd in the Super Bowl, Corbett delivered one of his best outings of his season with hitting his highest run blocking grade from Pro Football Focus at 81.5.",
    "But the 49ers could also become enamored with a possible guard duo of Tomlinson and Corbett — especially with getting a guy who could help in topping the Rams with a Ram on the line.",
    "There is one name on the Rams, though, who one insider on Thursday, February 17 believes “would weaken” the champs if the NFC runner-up 49ers manage to bring this free agent in.",
    "While the 49ers face their own free agency decisions, the Rams have their own dilemma with figuring out who to keep to “run it back” or which splashy free agent they could add.",
    "Here’s now what the Rams are facing: Corbett played the final year of his four-year, $7,568,000 deal this past season with a base salary of $1.5 million according to Spotrac.",
    "The 6-foot-4, 306-pound Corbett has taken on his share of dominant and menacing defensive linemen like Aaron Donald in practice or Ndamukong Suh during the season.",
    "And on the first play of this regular season clip, he plants Suh to the ground:\nAustin Corbett's play strength, anchor, & ability to strain are very impressive.",
    "However, he is a significant need for the champs if they want to keep Matthew Stafford together in piece — and away from Arik Armstead, Nick Bosa and company.",
    "But with Corbett coming off a career-defining and Super Bowl winning year, he could be in high demand by other NFL teams come March 16.",
    "Sure, Corbett isn’t a trendy name among the Rams’ pool of free agents like Odell Beckham, Sony Michel, Von Miller or Darious Williams.",
    "There will be 31 teams outside of the Los Angeles Rams with this goal in mind for the 2022 season: Topple the Super Bowl champs.",
    "Just mauled humans in the run game pic.twitter.com/CeNSu9ngSs\n— Sosa Kremenjas (@QBsMVP) January 11, 2021\nThat’s not all.",
    "Corbett not only established himself as a starter, but a versatile option when the Rams needed a center or guard.",
    "However, could the 49ers be presented with an early attempt to weaken the Vince Lombardi Trophy holders?",
    "What the ‘Niners are Facing\nTo reiterate, the 49ers will soon face a tough decision on Tomlinson.",
    "Him and Trent Williams together proved to be a destructive pairing especially in the run game.",
    "But check out Brian Allen at the point of attack against an NT about 40lbs heavier than him.",
    "John Lynch celebrates the 49ers winning the NFC title in January 2020 at Levi's Stadium.",
    "Also, Austin Corbett has no respect of Bobby Wagner pic.twitter.com/MlZhS8Xhjl\n— ??????",
    "He’s one of four free agent linemen on the Rams including starting center Brian Allen.",
    "Count the San Francisco 49ers as one of them that will attempt to do the toppling.",
    "He also allowed zero sacks in 69 total snaps (48 in pass blocking).",
    "Corbett is listed as a contingency plan if Tomlinson walks.",
    "ALL the latest 49ers news straight to your inbox!",
    "Quietly one of the 5-6 best RGs in football.",
    "And that’s where the 49ers could come in.",
    "Join the Heavy on 49ers newsletter here!"
  ]
}