{
  "id": 5158,
  "mediaId": 2523,
  "date": "2022-02-22",
  "headline": "How Aaron Rodgers and Russell Wilson Will Shape the Rest of the NFL Offseason",
  "image": "https://cdn.vox-cdn.com/thumbor/XrCNkzvbnSg7M1Wd6fGV6NT-UvE=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23262888/NFL_Offseason_Storylines_AP_Ringer.jpeg",
  "link": "https://www.theringer.com/nfl/2022/2/22/22945807/offseason-primer-aaron-rodgers-russell-wilson-free-agency",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steven Ruiz",
  "authorUrl": "https://www.theringer.com/authors/steven-ruiz",
  "termIds": [
    0
  ],
  "sentences": [
    "This is a better way to evaluate how much money teams have for the offseason than just current cap space pic.twitter.com/lOtEX4sS8g\n— Arjun Menon (@arjunmenon100) February 17, 2022\nIf the Packers don’t completely botch the next few weeks, Rodgers should be their starting quarterback when the 2022 season kicks off in September.",
    "Green Bay is already leaking we’re-ready-to-go-all-in reports, and in February the team brought back an old Rodgers favorite in Tom Clements to serve as the quarterbacks coach; that could be this year’s version of the Randall Cobb trade, which general manager Brian Gutekunst admitted was made in part to appease Rodgers.",
    "There will be cheaper alternatives in free agency for any team willing to talk itself into Jameis Winston or Carson Wentz, but it’s difficult to imagine either guy garnering a multiyear commitment after the former blew out his knee in October and the latter got blown out by the Jaguars with a playoff berth on the line.",
    "I don’t want to be a part of a rebuild if I’m going to keep playing.”\nThat’s probably not what a front office staring down a $53.6 million cap deficit wants to hear from its quarterback, but the Packers have ways of manipulating the cap to keep their core together for at least one more season.",
    "The defending champions have to shed nearly $22 million to get into the black, and they’ll have even more work to do if they’re going to bring back big-name starters like Von Miller, Odell Beckham Jr., corner Darious Williams, center Brian Allen, and guard Austin Corbett.",
    "In fact, this offseason is already picking up where the last one left off: with fans and media members trying to decipher vague social media posts by Aaron Rodgers, while the Packers reportedly do everything in their power to keep him in Green Bay.",
    "The offseason is technically already underway, but it won’t really start until the reigning NFL MVP decides his fate—whether that means running things back in Green Bay, forcing a trade to another team, or retiring from football altogether.",
    "Tennessee has an almost $8 million cap deficit, per Over the Cap, so general manager Jon Robinson will have to move some money around by restructuring contracts if he’s going to pull another move like the Julio Jones trade last offseason.",
    "The Vikings, for example, with their $20 million cap deficit, are one of a handful of teams that will have to decide between pushing all their chips into the middle of the table and folding to lay the foundation for a rebuild.",
    "How these cap-strapped contenders decide to approach the offseason will have a huge bearing on what looks like a relatively weak free agent class outside a few positions of strength, including safety and offensive tackle.",
    "The Bengals could be a candidate to sign some of these players as well, but if they don’t allocate all of their resources to improving their offensive line, that front office should be pelted with bowls of Skyline Chili.",
    "I’m just assuming the Ravens will write Lamar Jackson a blank check some time before training camp after he carried that shell of a team on his back for the first three months of last season before it finally gave out.",
    "The Patriots will likely tag star corner J.C. Jackson, and I can’t see the Bengals letting Jessie Bates III walk with the franchise tag value for safeties projected to be just over $13 million, per Over the Cap.",
    "Even if the Browns are interested in pulling off their own version of the Matthew Stafford deal, they’ll have to find a team willing to trade a QB who is demonstrably better than the one they already have.",
    "1 seed is bound for major regression, it’s tough to imagine a franchise that was voted as the NFL’s “least analytically advanced” putting much stock into those projections and blowing things up.",
    "The uncertainty surrounding those three could leave Mike Williams as the top receiver on many teams’ wish lists when free agency opens up on March 16—and that’s if the Chargers don’t tag him.",
    "And then there’s Deshaun Watson, who didn’t play last season and is facing criminal, civil, and NFL investigations after 22 women came forward with accounts of sexual harassment and assault.",
    "He said as much after the team’s season-ending loss in the playoffs, but he also mentioned Green Bay’s precarious cap situation when discussing the factors that would affect his decision.",
    "With all 32 front offices convening in Indianapolis next week for the combine, we shouldn’t have to wait long before the first major domino falls and, well … you know how dominoes work.",
    "A trade for Cousins would make sense for both Cleveland and Minnesota, but it’s not clear whether the Vikings would entertain such talks before seeing how things play out in Green Bay.",
    "With the Texans reportedly shopping Laremy Tunsil, and a deep draft class of tackles entering the league, this seems like a good year for those in the market for pass protectors.",
    "Behind some salary-cap wizardry from rookie GM Kwesi Adofo-Mensah, Minnesota could create enough cap space to fill in some roster holes to try to make a run at the playoffs.",
    "The Cardinals are dealing with their own quarterback drama—though the Kyler Murray ordeal feels more like the beginning of a contentious contract negotiation than a breakup.",
    "Here's a way to visualize how much effective cap space teams have currently, and how much they can end up with if they complete max restructures on their veteran contracts.",
    "But while all four of those teams have seemingly taken themselves out of the Wilson sweepstakes, some others have emerged as possible landing spots for the now 33-year-old.",
    "The Browns are on the hook for his $18.9 million cap hit after picking up Mayfield’s fifth-year option, and it’s been reported that the team plans on starting him in 2022.",
    "Considering the depth at this position around the league, don’t be surprised if the market for free-agent receivers cools off after last year’s group got big paydays.",
    "We could also see two passers land big deals in the months to come if the Cardinals don’t alienate the first homegrown franchise quarterback in Arizona history.",
    "Wilson has told the Seahawks he wants to play in Seattle but, if a trade were considered, the only teams he would go to are the Cowboys, Saints, Raiders, Bears.",
    "Brown could reset the receiver market in Tennessee, while Deebo Samuel’s contract negotiations in San Francisco will spark countless positional value debates.",
    "Allen Robinson is another exciting name hitting free agency, but he’s coming off a down season in which he apparently forgot how to make contested catches.",
    "Williams would be a good addition to any receiving corps, but he would probably command WR1 money on the open market, and he’s a high-end WR2 at best.",
    "If Rodgers stays in Green Bay, however, trading Cousins a year before his contract is set to expire would probably be the right play for the Vikings.",
    "Running it back with Russ and revisiting a possible trade next offseason feels like the most probable path for the Seahawks over the next 12 months.",
    "Rodgers and Wilson represent clear upgrades, but they may be unrealistic options even if the Packers and Seahawks are willing to listen to offers.",
    "Of course, Aaron Donald could quickly nab that title if the Rams give him the pay raise he seems to be angling for with all this retirement talk.",
    "“So many guys’ contracts are up or on the brink—or salary cap stuff,” Rodgers said last month after a loss to the 49ers in the divisional round.",
    "But Von Miller, Chandler Jones, Stephon Gilmore, Marcus Williams, Jadeveon Clowney, and Tyrann Mathieu are all poised to hit the open market.",
    "Of course, Wilson is publicly denying a desire to be traded, as he did last offseason when the Russ isn’t happy reports started to leak out.",
    "The longtime Seahawks star just wiped his Twitter feed of any mention of the team, which will increase speculation about a possible trade.",
    "All of the big contracts handed out in free agency will pale in comparison to the extensions we’ll see handed out later in the offseason.",
    "And Duane Brown, Morgan Moses, Trenton Brown, and Eric Fisher would be solid consolation prizes for any teams that miss out on Armstrong.",
    "The Chiefs will reportedly apply the franchise tag to left tackle Orlando Brown Jr., thereby weakening the talent pool at that position.",
    "Teams such as the Jaguars, Chargers, and Seahawks have plenty of cap space to throw around—and plenty of defensive problems to address.",
    "Per Over the Cap, Green Bay could free up more than $40 million in available cap space this offseason just by restructuring contracts.",
    "None of this will matter if the Seahawks are unwilling to part with Wilson, though, and there’s no reason to think that they will be.",
    "Even if he returns to Green Bay, though, all hope is not lost for other QB-needy teams looking to make a splash this offseason.",
    "The Titans face a similar dilemma—and while the analytically inclined might point to all the numbers suggesting the AFC’s no.",
    "That group includes receiver Michael Gallup, pass rusher Randy Gregory, guard Connor Williams, and tight end Dalton Schultz.",
    "As big a boon as a Rodgers trade would be for those of us in the content business, the Packers appear desperate to keep him.",
    "Then again, those reports were accompanied by a list of Wilson’s preferred destinations for a trade he said he didn’t want.",
    "1 for a more established starter—and giving up two first-round picks and eating a $24.7 million dead cap charge to do it.",
    "What’s next with Rodgers will set the course for the next few months of trades, signings, extensions, and draft picks.",
    "The Cowboys, meanwhile, are $22 million over the cap, and have a number of key contributors in need of new contracts.",
    "At this point, we’re probably a Jake Kumerow signing away from Green Bay locking up Rodgers’s commitment for 2022.",
    "Both the Buccaneers and Steelers just lost their quarterbacks to retirement and can offer playoff-caliber rosters.",
    "If the Packers are willing to mortgage their future to keep Rodgers happy, they certainly have the means to do so.",
    "Jimmy Garoppolo isn’t far behind, assuming the 49ers still plan on turning things over to Trey Lance next season.",
    "And late-season injuries to Beckham, Gallup, and Chris Godwin have weakened the group of available pass catchers.",
    "If Rodgers elects to return to Green Bay, the Packers will likely slap the tag on Davante Adams soon thereafter.",
    "— Adam Schefter (@AdamSchefter) February 25, 2021\nA lot has changed since that list of four teams was revealed.",
    "Then there’s Baker Mayfield, who almost certainly played his way out of a contract extension this past season.",
    "Seattle’s offense, under first-year coordinator Shane Waldron, showed signs of life late in the 2021 campaign.",
    "And Pete Carroll has overhauled the defensive staff with some exciting hires from outside his coaching tree.",
    "And the Broncos have the makings of a playoff team if they can fill their longstanding void at quarterback.",
    "Kirk Cousins and his $35 million cap hit shoots to the top of the list of the best QBs who could be traded.",
    "Sean Payton stepped down as the head coach in New Orleans, making the Saints a far less attractive option.",
    "Perhaps the most interesting aspect of this offseason’s free-agent market will involve defensive players.",
    "But Cleveland just saw the Rams win a Super Bowl after ditching a limited quarterback they drafted no.",
    "It’s only a matter of time before the 49ers make Nick Bosa the highest-paid defender in NFL history.",
    "It also appears that Rodgers is over any beef he had with the organization at this time last year.",
    "For one, he’s under contract through 2023 and would have a $26 million dead cap charge if traded.",
    "The Raiders reportedly plan on giving Derek Carr an extension, so Las Vegas likely won’t happen.",
    "You know, this would be a lot easier to sort out if Rodgers would just make up his mind already.",
    "This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
    "If a Wilson trade is off the table, the quarterback trade market gets a whole lot more dicey.",
    "Bringing Cousins back would be enough to make the Vikings the favorites to win that division.",
    "The 49ers seem primed to turn the keys to the offense over to a raw 21-year-old quarterback.",
    "What happens with the quarterbacks won’t be the only major dominoes to fall this offseason.",
    "The Ringer Newsletter\nBy submitting your email, you agree to our Terms and Privacy Notice.",
    "So in order to make sense of what will be a league-altering offseason, let’s begin there.",
    "Seahawks’ QB Russell Wilson has not demanded a trade, his agent Mark Rodgers told ESPN.",
    "And the Rams are slated to lose a few key starters after going all in this past season.",
    "In the NFC, the Rams and Cowboys will also have to make some hard financial decisions.",
    "Cousins’s future in Minnesota could depend on what happens with Rodgers in Green Bay.",
    "That’s a problem for a veteran receiver who never excelled at creating separation.",
    "And that doesn’t include other potential cap-clearing moves, like trades or cuts.",
    "Several others will shape the Super Bowl landscape heading into the 2022 season.",
    "All of a sudden, there would be a massive question at the top of the NFC North.",
    "The Eagles can offer the same if they’re not fully committed to Jalen Hurts.",
    "And the Bears selected Justin Fields in the first round of the 2021 draft.",
    "Whatever is left over can go toward shoring up a weak cornerback group.",
    "Still, the Saints are expected to let Terron Armstead hit free agency.",
    "Let’s say the Packers do trade Rodgers and start a full-scale rebuild.",
    "And the dominoes will ultimately lead back to the quarterbacks.",
    "For another, the NFC West suddenly looks a lot more winnable.",
    "In the NFL, everything starts with the quarterback position.",
    "Garoppolo might be a downgrade compared to a healthy Baker.",
    "The Cowboys finally gave Dak Prescott a long-term deal.",
    "The 2022 offseason won’t be any different.",
    "The receiver market isn’t as clear.",
    "The next domino is Russell Wilson.",
    "“A lot of decisions to be made.",
    "You can opt out at any time.",
    "A.J."
  ]
}