{
  "id": 5255,
  "mediaId": 2606,
  "date": "2022-02-17",
  "headline": "LA Rams bring Super Bowl celebration to the Strip",
  "image": "https://www.reviewjournal.com/wp-content/uploads/2022/02/16170518_web1_Los-Angeles-Rams-Party-at-Encore-Beach-Club-at-Night-on-Feb.-16_Photo-Credit-Mike-Kirschbaum.jpg",
  "link": "https://www.reviewjournal.com/entertainment/entertainment-columns/kats/la-rams-bring-super-bowl-celebration-to-the-strip-2531055/",
  "mediaOutlet": "Las Vegas Review-Journal ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Katsilometes",
  "authorUrl": "https://www.reviewjournal.com/staff/john-katsilometes/",
  "termIds": [
    0
  ],
  "sentences": [
    "The venue became the Strip version of the Rams House, with the team’s logos splashed across giant flags, and the LED screen proclaiming, “Wynn Nightlife Welcomes the 2022 Super Bowl Champs LA Rams.” A replica Lombardi Trophy was on display, and several players waded into the DJ booth to hang with headliners Deux Twins.",
    "This SRP is an other-worldly VIP experience where ticket-holders will be hauled in the show’s chauffeured, inter-galactically painted Rolls Royce to and from The Cosmopolitan of Las Vegas (I was nearly slammed by a Ford F-150 in this vehicle once, for real).",
    "The celebrants included Tyler Higbee, Brian Allen, Troy Reeder, Coleman Shelton, Greg Gaines, Michael Hoecht, Jamil Demby, Jared Koski, Ben Skowronek, Jeremiah Kolone, Brycen Hopkins, Christin Rozeboom and John Mundt.",
    "Cool Hang Alert\nDavid Tatlock’s blazing Soul Juice Band plays Sand Dollar Lounge from 10 p.m.-2 a.m. Tatlock’s horn band has just released a single, “Funky Lke That,” which is a good way to describe this outfit.",
    "Barbutti made some 60 appearances on “The Tonight Show Starring Johnny Carson.” He lives in Vegas and performs rarely these days, but I caught him in a charity show years ago.",
    "They ambled into EBC at about 12:30 a.m., where “The Next Episode” by rap legend and Super Bowl halftime show co-star Dr. Dre blared on the house sound system.",
    "“We’re not saying the backseat is a great place to do the NASA-ty, but love is love.”\nThe whole experience is $1,200 per couple, go to spiegelworld.com/opium.",
    "Members of the Super Bowl champion Los Angeles Rams moved the chains and fired the party cannons Wednesday night at Encore Beach Club at Wynn Las Vegas.",
    "“Opium,” a hit on the Strip and across the galaxy of Spiegelworld “Impresario” Ross Mollison’s fertile mind, has opened its Space Roller Package.",
    "Just after their victory parade in L.A., the NFL champions also dined at the chic Casa Playa restaurant before venturing to the club.",
    "The VIPs then watch the show from their own Escape Pod with bottle service and receive a digital photo opp with a cast member.",
    "The comic actor and swift-selling headlining stand-up has added a second night for his “Reality Check” shows at The Chelsea.",
    "He’s also posted a classic Tonya Harding skate from 1994, with a crowbar attached (research that reference online, kids).",
    "A comedy icon and one of the great storytellers ever is headlining The Nevada Room on Friday and again Feb. 25.",
    "Great Moments in Social Media\nCarrot Top has developed a Kamila Valieva skate with a syringe glued to the side.",
    "The crew ordered “the menu” at Casa Playa, including the tomahawk steak and full roster of margaritas.",
    "Showers of sparks from Champagne bottles and a torrent of blue and gold confetti, too, were involved.",
    "Guests will dine on a prix fixe menu at Superfrico, a favorite of Hollywood culinary types.",
    "He told a single joke in his set and it was so good I was laughing about it days later.",
    "Ask for Captain Kunton, who says the rig was built of spare parts from Starship OPM73.",
    "Cost is $20 (not including fees), with a $24.95 prix-fix menu or items a la cart.",
    "Entering “Harry M. Howie” as a promo code will get you nothing but style points.",
    "He’s now booked for a quartet of shows at 7 p.m. and 10 p.m. July 2-July 3.",
    "Pete Barbutti is in th showroom at 8 p.m. (doors 6 p.m.) both nights.",
    "Barbutti plays trumpet, piano and accordion and sets his own pace.",
    "His “PodKats!” podcast can be found at reviewjournal.com/podcasts.",
    "Suffice to say Barbutti’s act is not for the Tik-Tok generation.",
    "What Works In Vegas\nKevin Hart at The Cosmopolitan of Las Vegas.",
    "Follow @johnnykats on Twitter, @JohnnyKats1 on Instagram.",
    "John Katsilometes’ column runs daily in the A section.",
    "Contact him at jkatsilometes@reviewjournal.com.",
    "No compatible source was found for this media.",
    "Hit VegasNevadaRooms.com for more info.",
    "Mirth on deck\nThis is a modal window.",
    "This video is currently unavailable.",
    "Try the pizza.",
    "That roller!",
    "No cover."
  ]
}