{
  "id": 5689,
  "mediaId": 2570,
  "date": "2022-02-11",
  "headline": "The Los Angeles Rams’ Oldest Player, Andrew Whitworth, Faces Former Bengals Team",
  "image": "",
  "link": "https://www.forbes.com/sites/jefffedotin/2022/02/11/the-los-angeles-rams-oldest-player-andrew-whitworth-faces-former-bengals-team/?sh=2c34cc9779c1",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Fedotin",
  "authorUrl": "https://www.forbes.com/sites/jefffedotin/",
  "termIds": [
    1391,
    2873,
    3809,
    4102,
    217,
    314,
    570,
    4906
  ],
  "sentences": [
    "“He’s a freak,” said David Edwards, who lines up next to Whitworth at left guard, “probably the strongest, most flexible guy I’ve ever been around that never stops working, never stops moving.”\nWhen the Rams facility and gyms across the country were closed during the peak of the pandemic, Whitworth let Edwards work out in the gym of his garage.",
    "It’s neat for me to go out on the football field and think I’m going to be most weeks facing some 22-, 26-, 28-year-old defensive end who thinks that nothing can faze him.”\nBut Whitworth is more than a cute story of the oldest player in the NFL facing his old team.",
    "“He’s taught me how to be a pro whether that’s on the field or off the field.”\nWhile Edwards has one more year left on his four-year, $2.8 million rookie deal, fellow starters, right guard Austin Corbett and center Brian Allen, will be unrestricted free agents.",
    "In what could potentially be his final game, Los Angeles Rams left tackle Andrew Whitworth will play against the Cincinnati Bengals, the team for whom he played his first 11 years in the NFL.",
    "He even volunteered at the Boys & Girls Club in the Covington, Ky. suburb, where he befriended future Detroit Lions linebacker Derrick Barnes, whom he played against in Week Seven.",
    "“There’s so many cool faces I can’t wait to see.”\nAs if the Rams needed extra incentive in the big game, wide receiver Odell Beckham Jr. said he wanted to win it for Whitworth.",
    "Whitworth is not only the oldest starting left tackle in the history of the NFL, but also following the retirement of Tom Brady, he’s currently the oldest player in the NFL.",
    "“I’m very happy for him to have this opportunity.”\nBeckham Jr. calls Whitworth “The Undertaker” because his giant frame, imposing stature and beard resemble the WWE star.",
    "The 40-year-old Whitworth emphasized that he couldn’t be happier for the Bengals organization and that his family will attend both Rams and Bengals games in the future.",
    "Whitworth has one year left on the three-year, $30 million extension he signed with the Rams in March of 2022, but he could retire after Super Bowl LVI.",
    "During the first five weeks of the season, the Rams faced the Indianapolis Colts and Seattle Seahawks, two teams that regularly play four-man fronts.",
    "On several plays he had the difficult assignment of cutting off the three-technique tackle, who aligns to the outside shoulder of the left guard.",
    "“I’ve put my heart and soul into both places.”\nWhitworth signed a three-year, $33.75 million contract with the Rams before the 2017 season.",
    "“I can’t even come up with the words of how cool and how special it is for me.”\nWhitworth immersed himself in the Cincinnati community.",
    "“After that, regardless of the outcome, you reach out and just talk about what a cool moment it is and how special it was,” he said.",
    "After texting some in the Bengals organization last week, he has, of course, spent this week focused on Super Bowl LVI.",
    "“It’s almost like a storybook just to have this opportunity in what could possibly be — at my age — my last game.”",
    "His time with the Bengals was long enough ago that it’s more familiar staff than players — like tight end C.J.",
    "His family knew the names of everyone who worked in the Cincinnati restaurants and stores they frequented.",
    "“Going against his former team, I’m sure he’s going to be motivated,” Beckham Jr. said.",
    "“He’s done so much for me and my teammates; it’s hard to put into words,” Edwards said.",
    "The four-time Pro Bowler is 6-7, 330 pounds and started 15 games this season.",
    "So the Rams could face a major overhaul on its offensive line next season.",
    "He knocked them off the line of scrimmage and buried them.",
    "“Everybody’s gonna give me the old jokes,” Whitworth said.",
    "“That’s always something I’ll decide after the season.",
    "Man, what a cool ending if it is,” Whitworth said.",
    "I think you’ve got to step away for a second.",
    "“The reality is: Yes, it’s pretty cool.",
    "That beard now has turned mostly white.",
    "“It’s unbelievable,” Whitworth said.",
    "“We love both places,” he said.",
    "Call it the Whitworth Bowl.",
    "Uzomah — who remain."
  ]
}