{
  "id": 5784,
  "mediaId": 6534,
  "date": "2022-02-12",
  "headline": "Multiple Players With Chicago-Area Ties Taking Part in Super Bowl LVI",
  "image": "https://media.nbcchicago.com/2022/02/rams-player-correct.png?resize=1200%2C675&quality=85&strip=all",
  "link": "https://www.nbcchicago.com/news/local/multiple-players-with-chicago-area-ties-taking-part-in-super-bowl/2757433/",
  "mediaOutlet": "nbcchicago.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lexi Sutter",
  "authorUrl": "https://www.nbcchicago.com?s=Author%3A%20%22Lexi%20Sutter%22",
  "termIds": [
    0
  ],
  "sentences": [
    "\"He’s so good about coming back and being at the high school, so to know him personally and see him do this, you’re proud, you’re excited for him,\" said Brian Griffin, football coach at Hinsdale Central.",
    "The Super Bowl will air on NBC with kickoff schedule for 5:30 p.m.\nMore information about the matchup including details of the halftime show, odds and background on both teams can be found here.",
    "David Edwards Jr., a starter and left guard for the Los Angeles Rams, grew up in Downers Grove and served as quarterback at Downers Grove North High School.",
    "Edwards' teammate, Brian Allen, a graduate of Hinsdale Central High School, will also represent the region as the Rams take on the Cincinnati Bengals.",
    "\"You could tell he had the size, the nastiness, and what kind of set him apart is he’s just so athletic for how big as he was,\" the coach said.",
    "As the two men prepare to take the field in what may be the biggest game of their lives, Chicago will be rooting them on.",
    "Based on his high school days, Griffin said he knew Allen had all the makings to eventually participate in the big game.",
    "While the Chicago Bears aren't in Super Bowl LVI, multiple players with Chicago-area connections are participating.",
    "The entire Edwards family will be in Los Angeles for the big game, cheering on their loved one the entire time.",
    "\"Everything, when he puts his mind to something, he always reaches that goal,\" David Edwards Sr. said.",
    "\"You just try to enjoy the moment because it may never come again,\" David Edwards Sr. said.",
    "\"It really doesn’t feel real but it is,\" the father said.",
    "The 24-year-old's father calls him a perfectionist."
  ]
}