{
  "id": 6512,
  "mediaId": 2746,
  "date": "2022-01-27",
  "headline": "Rams, 49ers renew long-running rivalry, while Chiefs, Bengals meet in a rare postseason matchup",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/01/27/bengals_titans_football_14452_c0-0-5568-3248_s1200x700.jpg?3ba5c576b19e6de77b3849e0078f4b7690a3a4b6",
  "link": "https://www.washingtontimes.com/news/2022/jan/27/rams-49ers-renew-long-running-rivalry-while-chiefs/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Barry Wilner",
  "authorUrl": "",
  "termIds": [
    1959,
    2687,
    3547,
    4202,
    217,
    539,
    924
  ],
  "sentences": [
    "The unenviable task of dealing with them goes to nearly everyone, from LBs Logan Wilson and Germaine Pratt to a deep group of defensive backs: CBs Chidobe Awuzie, Mike Hilton and inconsistent Eli Apple, plus backups Tre Flowers and Trae Waynes, and safeties Vonn Bell and Jessie Bates.",
    "Kupp, another unanimous All-Pro, pulled off the hat trick of leading the NFL in receptions, yards and touchdown catches; made the biggest play last week after Tampa Bay stormed back to nearly steal the game; and has a unique connection with QB Matthew Stafford.",
    "All-Pro Trent Williams, dealing with ankle issues, is the best left tackle in the game, though the keys could be center Alex Mack and guards Laken Tomlinson and Daniel Brunskill, who get the pleasure of dealing with Donald all day.",
    "While Mahomes has other playmakers - WRs Mecole Hardman and Byron Pringle, RBs Jerick McKinnon and Clyde Edwards-Helaire — moving the ball and, especially, finding the end zone usually comes down to Kelce and Hill.",
    "Awaiting them at loud, sometimes intimidating Arrowhead Stadium will be the Kansas City Chiefs, in their fourth consecutive AFC championship game and seeking their third trip in a row to the Super Bowl.",
    "Although he missed two kicks against the Bills, Harrison Butker has a huge leg and has been very reliable for the Chiefs, and he bounced back to hit the 49-yarder to force overtime last weekend.",
    "The 40-year-old placekicker made two field goals, including a 45-yarder in the snow as time expired to beat Green Bay, making him 20 for 20 in his career on field-goal attempts in the playoffs.",
    "Samuel will test everyone on LA’s defense, from fellow All-Pro Jalen Ramsey at cornerback, yet another All-Pro — unanimous, no less — DT Aaron Donald — or some of the other studs on that unit.",
    "Odell Beckham Jr., Van Jefferson and TE Tyler Higbee can’t be given minimal attention by safeties Jaquiski Tartt and Jimmie Ward, CBs K’Waun Williams and, if healthy, Ambry Thomas.",
    "Still, the master in this one is Andy Reid, who could join that limited group with three or more consecutive Super Bowl appearances: Don Shula, Marv Levy, Bill Belichick.",
    "That said, the Rams are playing at home — SoFi Stadium will stage the Super Bowl, and the five-plus decade run of teams not hosting the big game ended in Tampa last year.",
    "Until Sunday, only one of all those confrontations was in the postseason — the Niners won that one, too, 30-3 in 1989 on the way to the most lopsided Super Bowl victory.",
    "The kid simply doesn’t miss: His four fields goal in the wild-card round were the most for a rookie in his postseason debut, and he nailed the winner in Music City.",
    "Bengals tackles Jonah Williams and Isaiah Prince must deal with Chris Jones and Frank Clark on the outside, while DT Jarran Reed has been superb in the playoffs.",
    "It doesn’t hurt that Mahomes has a sixth sense for escaping pressure, but he needs his blockers, particularly LG Joe Thuney and LT Orlando Brown Jr. to hold up.",
    "Not only are they the most entertaining offense in the league, but with QB Patrick Mahomes, WR Tyreek Hill and TE Travis Kelce, they are as creative as anyone.",
    "Hardman and CB Mike Hughes do most of the work, but the Chiefs will use Hill when they need a big play; he delivered with one on a punt return against Buffalo.",
    "And they must avoid the likes of DEs Nick Bosa and Samson Ebukam, DT Arik Armstead, plus standout linebacker Fred Warner, who has been battling a balky ankle.",
    "DeMeco Ryans is much more a newbie to the position in San Francisco, but his unit has been stellar for all but one period against Dallas in these playoffs.",
    "Each team comes off last-second victories on field goals, the Niners on the Lambeau Field tundra, the Rams in balmy Tampa against Tom Brady and the Bucs.",
    "It sure didn’t look like it against Buffalo, when CBs Charvarius Ward, L’Jarius Sneed and safeties Daniel Sorensen and Juan Thornhill struggled mightily.",
    "He had 34 touchdown passes and 14 interceptions during the season, and thus far in the playoffs is 52 of 71 (73.2%) for 592 yards and a 101.4 QB rating.",
    "Reid relies heavily on his assistants (Spagnuolo, OC Eric Bieniemy, special teams coordinator Dave Toub) and they all keep things fresh and innovative.",
    "If the Bengals can get the running game on track with Joe Mixon, who ranked third with 1,205 rushing yards, they might have the balance they need.",
    "WHEN THE CHIEFS HAVE THE BALL:\nAs they showed in the shootout with the Bills, the Chiefs need only, say, 13 seconds to produce in crunch time.",
    "With him, the numbers - albeit great - are almost superfluous as he finds a way on so many plays, particularly in the most dire circumstances.",
    "P Kevin Huber did not have a particularly strong season, but he’s a veteran accustomed to punting outdoors in the cold, which will help in KC.",
    "Pringle is more of a threat than any of the Bengals on kick returns, while the Chiefs use a variety of dangerous players to bring back punts.",
    "Burrow, whose rookie season in 2020 was cut short by a knee injury, made a sensational return and is as accurate as any passer in the league.",
    "A true flex player, for all your fantasy gurus, the All-Pro receiver turned running back on occasion has become as dynamic as any NFL player.",
    "Los Angeles added stars in Stafford, Miller and Beckham with one thing in mind: returning to the Super Bowl the Rams lost three years back.",
    "But the Niners have minimized him this season: Donald has only three pressures and zero sacks in the two games during the regular season.",
    "Gay is no slouch, though, and the way three of last weekend’s four games came down to last-season field goals, his role could be vital.",
    "INTANGIBLES:\nSan Francisco’s mastery of its longtime rival has to raise the confidence level of the 49ers, while ticking off the Rams.",
    "That’s not a knock on Cincinnati’s Zac Taylor, who has helped turn around a moribund franchise and has an exciting group on offense.",
    "Sure, the Chiefs made sense, but the often-mocked Bengals - Bungles no more - were a surprise last to first winner of the AFC North.",
    "Not to be overlooked is how the 49ers rallied to beat the Rams in the season finale, which SF needed to qualify for the playoffs.",
    "The Rams could have a difficult time protecting the revitalized Stafford if LT Andrew Whitworth remains sidelined by knee issues.",
    "And the Niners, with many of the same players still on hand, lost their chance for the NFL title two years ago to Kansas City.",
    "Niners TE George Kittle hasn’t been his usual brilliant self, but LA is weak at safety and the LBs don’t do much in coverage.",
    "Kansas City knows it must slow down the elusive and supremely athletic Chase, but does it have the defensive backs to do so?",
    "Chase has 14 catches for 225 yards (16.1 per reception) after scoring 13 times on 81 receptions in the regular season.",
    "WHEN THE RAMS HAVE THE BALL:\nAs Samuel should be the focal point for San Francisco, so too must WR Cooper Kupp for LA.",
    "They’re a year early, by most estimations, in their development, and the experience can only help them in the future.",
    "Where both have struggled is late in games — see Rams at Bucs last weekend, 49ers at Cowboys in the wild-card round.",
    "Here’s how the 49ers and Rams match up:\nWHEN THE 49ERS HAVE THE BALL:\nJust give it to Deebo Samuel in some manner.",
    "He also must feed the ball often to RB Elijah Mitchell, a real find, and keep versatile FB Kyle Juszczyk involved.",
    "Here come the Cincinnati Bengals, who had lost eight straight playoff games since their last victory 31 years ago.",
    "WHEN THE BENGALS HAVE THE BALL:\nIt’s not all about QB Joe Burrow and rookie WR Ja’Marr Chase, but much of it is.",
    "If star FS Tyrann Mathieu (concussion) can’t go, not only Chase but Tee Higgins, Tyler Boyd and emerging TE C.J.",
    "The 49ers have owned the Rams in the past six meetings, and have a 75-67-3 mark against their California rivals.",
    "QB Jimmy Garoppolo needs to avoid forcing passes; he tends to be good, make that bad, for one turnover a game.",
    "The Chiefs, under aggressive coordinator Steve Spagnuolo, have a solid pass rush, which they’ll clearly need.",
    "One thing the Bengals defense will need is a relentless pass rush against a stout but not impenetrable line.",
    "Now, San Francisco goes for a three-game sweep of Los Angeles, though the Rams will be at home and favored.",
    "COACHING:\nKyle Shanahan simply doesn’t lose to the Rams, who have dropped the past six games to the Niners.",
    "They’re aggressive to a fault, highly popular with their players, and have a deep trust in their schemes.",
    "But the Rams have another potential offense wrecker in LB Leonard Floyd, plus the revitalized Von Miller.",
    "P Johnny Hekker has been one of the league’s best punters for a decade, also is a threat on fake punts.",
    "SPECIAL TEAMS:\nWhen a last-place team drafts a kicker in the fifth round, fans scratch their heads.",
    "Well, the Bengals are a division winner and one step from the Super Bowl thanks to Evan McPherson.",
    "LA’s Raheem Morris is a respected defensive coordinator in the mix for a second head coaching job.",
    "Cincy sacks leader Trey Hendrickson is the primary pass rusher, though DE Sam Hubbard and DT D.J.",
    "Uzomah, however, might be needed to help block after Cincinnati allowed nine sacks at Tennessee.",
    "The two hooked up 11 times for 266 yards and three TDs in a 34-31 win over the Chiefs on Jan. 2.",
    "Old West rivals 49ers, Rams meet for Super Bowl berth\nThey have gone at each other 145 times.",
    "Plus, they know when they’ve needed big plays in the past month or so, they have made them.",
    "They know one another so well their coaches probably could swap sides and be comfortable.",
    "The first four, though, came without Stafford, an immeasurable upgrade from Jared Goff.",
    "This pass-catch combination was dynamic at LSU and has made a huge splash in the NFL.",
    "His range doesn’t match that of the Rams’ Matt Gay, but Gould is extremely reliable.",
    "Shanahan and Sean McVay are leaders of the youth wave among offense-minded coaches.",
    "For the Chiefs, it’s Super Bowl or bust, as it has been since Mahomes took charge.",
    "COACHING:\nMaybe the biggest discrepancy in this game is the resume for each coach.",
    "This is a team that doesn’t panic, and when could that be said about the Bengals?",
    "Now, here they are, one step from their first Super Bowl appearance since 1989.",
    "Cincy defends runbacks well, but is not much of a threat on its own returns.",
    "Mahomes has certified himself with his arm, legs and mind as the real thing.",
    "SPECIAL TEAMS:\nRobbie Gould has been spectacular in his, uh, Goulden years.",
    "Center Brian Allen could have his hands full with defenders in the middle.",
    "How well the 49ers hold up on the offensive line might be critical.",
    "LA has a two-pronged running game with Sony Michel and Cam Akers.",
    "And watch for Chiefs weakside LB Nick Bolton to have some impact.",
    "They must avoid turnovers; the Rams fumbled four times at Tampa.",
    "Kupp is far from the only playmakers 49ers DBs must account for.",
    "His counterpart, Mitch Wishnowsky, has had a mediocre season.",
    "Neither team is particularly dangerous on kick returns.",
    "This is hardly the matchup most NFL observers expected.",
    "Samuel could be the wild card the Rams can’t match.",
    "Talk about newcomers versus the tried and true.",
    "On the other side, McPherson is the real deal.",
    "INTANGIBLES:\nWhat do the Bengals have to lose?",
    "So they should be able to play loose and free.",
    "Rookie C Creed Humphrey has been a real find.",
    "So both teams have a nasty taste to remove.",
    "His sub, Joseph Noteboom is a level down.",
    "How do they match up with the Chiefs?",
    "He also can’t be a one-man gang.",
    "Watch for something new Sunday.",
    "Uzomah could be dangerous.",
    "Coverage units were fine.",
    "Reader can be trouble."
  ]
}