{
  "id": 683,
  "mediaId": 2523,
  "date": "2022-04-22",
  "headline": "FCF 2021 Week 2 Rosters, Schedule, Live Stream and Format",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/515/155/55df6f0bf5378fdf7378b511a8902efb_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2955569-fcf-2021-week-2-rosters-schedule-live-stream-and-format",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristopher Knox",
  "authorUrl": "https://bleacherreport.com/users/6e186227-f9b2-4450-af0d-8f62243323ee",
  "termIds": [
    1979,
    2330,
    2445,
    4270,
    368,
    895,
    4955
  ],
  "sentences": [
    "The full season schedule, which can also be found at DAZN, is as follows:\nWeek 2: Saturday, April 23\nWeek 3: Saturday, April 30\nWeek 4: Saturday, May 7\nWeek 5: Saturday, May 14\nWeek 6: Saturday, May 21\nWeek 7: Saturday, May 28\nPlayoffs: Saturday, June 4\nChampionship: Saturday, June 11\nWeek 2 Rosters\nHere's a look at all eight teams for Week 2, including their team owners and starting lineups—according to the FCF official website:\nGlacier Boys: Quavo Hunco, Adin Ross, Richard Sherman and Deestroying\nQB: Dentarrius Yon, Devlin Isadore\nRB: Brycen Alleyne, Malcolm Ballard\nWR: Andrew Jamiel, Vance Leonard\nSR: Harrison Dreher\nOL: The Trenchmen\nDEF: The Hitmen\nBeasts: Marshawn Lynch, Renee Montgomery and Miro\nQB: Alphonso Howard, Jason Stewart\nRB: Quinn Porter\nWR: Tra Chandler, LaMarcus Caradine, Justin Nicholls, Jordus Smith\nOL: Block Party\nDEF: Heavy Hitters\nShoulda Been Stars: Rachel Lindsay, Austin Ekeler, Altered State Machines and Druski\nQB: D'Vonn Gibbons, Slade Jarman\nRB: LaDarius Galloway\nWR: Just'N Thymes, Slade Jarman, Tyis Boykin, Travalle Calvin\nOL: The Wall\nDEF: D-Block\nZappers: Bob Menery, Ronnie Singh, Trevor May and Dalvin Cook\nQB: Johnny Manziel, Brian Allen\nRB: John Robinson\nWR: Terrell Owens, Antonio Turner, Ismail Brooks\nSR: James Harden\nOL: Force Field\nDEF: Shut Down Squad\nKingpins: NFT Kingpins\nQB: Danny Southwick, Tirri Jones\nRB: Daryl Virgies\nWR: Keyston Fuller, Tony Dixon\nSR: Elijah Rogers, Eterrious Giles\nOL: The Trenchmen\nDEF: Heavy Hitters\nBored Ape FC: Bored Ape NFT\nQB: Deondre Francois, Vidal Woodruff\nRB: Jakobie Baker\nWR: Collin Andrews, Jordan Andrews, Connor Andrews\nSR: Maurice Thomas\nOL: The Wall\nDEF: The Hitmen\nKnights of Degen: Knights of Degen\nQB: Ed Crouch, Laquan Horton\nRB: Terelle West\nWR: Jacoby Herring, Yedidiah Louis, Keyon Thomas\nSR: Drake Wells\nOL: Force Field\nDEF: The D-Block\n8oki: 8oki\nQB: Mitch Kidd, Brandon Pearson\nWR: Joseph Boykin, Patrick Smith, Joshua Johnson, Tracy Gaston\nSL: Cedric Byrd\nOL: Block Party\nDEF: Shut Down Squad\n*A full list of FCF players can be found here.",
    "...Some Rare Gear items will also provide additional utility and benefits, including Enhanced voting power for player drafting, play calling, replay review, team and league operations, and branding decisions, access to behind the scenes content, ability to design and sell merch in the team store, game day tickets and event access.\"",
    "Week 1 Scores, Week 2 Schedule and Live Stream\nWeek 1 Results\nBeasts 36, Glacier Boyz 20\nShoulda Been Stars 20, Zappers 12\n8oki 28, Kingpins 26\nBored Ape FC 36, Knights of Degen 32\nWeek 2 Schedule (all games, Saturday, April 23)\nBored Ape FC vs, 8oki: 1 p.m.",
    "Extra points (two-point conversions) are decided by a one-vs.-one battle between a wide receiver and defensive back from the five-yard line—with the quarterback having just four seconds to deliver a pass.",
    "Offensive lines and defenses are drafted as units, while quarterbacks and the offensive skill players—wide receivers, slot receivers and running backs—are drafted individually.",
    "This year, FCF will feature two divisions—the OGs and the Ballerz—with each team playing its divisional opponents twice in the season along with one non-divisional game.",
    "Offenses begin on their own 10-yard line and must drive 40 yards to the end zone, and the opening possession is decided by rock paper, scissors instead of a coin toss.",
    "Backup quarterbacks must be involved in the game plan, with each team's signal-caller having to play at least one out of three possessions (barring injury).",
    "Games are played with a running clock, except in the last 30 seconds of the half and overtime, and are expected to fit within a one-hour window.",
    "The second season (season v2.0) of Fan Controlled Football kicked off last weekend, and it brought plenty of entertainment and excitement.",
    "Four FCF expansion teams will be exclusively managed by fans holding the 20,500 unique, programmatically generated Ballerz in the league.",
    "Fans can feel a part of the game, as they control the play-calling and roster-building—with weekly redrafts taking place on Wednesdays.",
    "The 48-year-old won't make an impact in fantasy, as DFS sites and oddsmakers still aren't offering FCF for fantasy games or betting.",
    "It wasn't enough to deliver a win for the Zappers, though, and the NFL Hall of Famer will look to make more of an impact in Week 2.",
    "Here, you'll find all the information you need for Week 2, including scheduling, live-stream, roster and format information.",
    "Fans have numerous ways to watch and, as always, can download the FCF App to stream and get into the play-calling action.",
    "This adds a unique element to roster building, one that separates FCF drafting from traditional fantasy drafts.",
    "Season V2.0 Rules and Format\nWe covered the rules—which were voted on by fans—last year and again in Week 1.",
    "FCF expanded from four to eight teams this year and also expanded its collection of streaming partners.",
    "Waiting until the final pick for a backup quarterback could be a mistake, because he will be playing.",
    "From the FCF website:\n\"Ballerz are customizable avatars that drop you into the Ballerz Collective.",
    "Fans can become owners of an expansion team by purchasing NFT avatars for their respective squad.",
    "Fans can dictate \"franchise\" players to keep, though, and we may see odds closer to the playoffs.",
    "The rules are quite a bit different from traditional American football and other indoor leagues.",
    "New drafts take place each Wednesday, with fans able to keep one \"franchise\" player each week.",
    "It also saw the professional return of Terrell Owens, who scored a touchdown in his FCF debut.",
    "There will be a seven-week regular season, followed by the playoffs and the championship game.",
    "This is likely due to the weekly-redraft nature of rosters and it being early in the season.",
    "In other words, fans can become true ownership partners if they land the right NFT drops.",
    "Fans interested in checking out Week 2 of the 2022 season should have little trouble.",
    "It's worth a quick refresher, though, as many fans may be new to FCF entering Week 2.",
    "Bovada, for example, eventually had odds for the championship winner last year.",
    "For one, there's no kicking in FCF, which means no field goals and no punts.",
    "Starting lineups consist of seven players, with three-man offensive lines.",
    "Each week features afternoon and evening windows with two games apiece.",
    "NFTs were still available for 8oki and Kingpins as of Friday morning.",
    "Each offense also features one quarterback and three skill players.",
    "ET\nLive Stream\nDAZN, NBCLX, Peacock, Twitch and the FCF App.",
    "It's named Fan Controlled Football for a reason.",
    "Matchups are played on a 50-yard indoor field.",
    "ET\nBeasts vs. Shoulda Been Stars: 9 p.m.",
    "ET\nKingpins vs. Knights of Degen: 3 p.m.",
    "ET\nGlazier Boyz vs. Zappers: 7 p.m."
  ]
}