{
  "id": 1022,
  "mediaId": 2781,
  "date": "2022-02-14",
  "headline": "WATCH: Senate Hopeful Torches Biden’s Super Bowl-Sized Fails in ‘Let’s Go Brandon’ Ad",
  "image": "https://joemiller.us/wp-content/uploads/infinityscreen2.jpeg",
  "link": "https://joemiller.us/2022/02/watch-senate-hopeful-torches-bidens-super-bowl-sized-fails-in-lets-go-brandon-ad/?utm_source=rss&utm_medium=rss&utm_campaign=watch-senate-hopeful-torches-bidens-super-bowl-sized-fails-in-lets-go-brandon-ad",
  "mediaOutlet": "joemiller.us",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fox News",
  "authorUrl": "https://joemiller.us/author/joemiller/",
  "termIds": [
    4905,
    1126,
    1489,
    6506
  ],
  "sentences": [
    "The phrase, “Let’s go Brandon,” took the internet by storm in early October after an NBC reporter at a NASCAR Xfinity Series race incorrectly reported that fans in the stands were chanting “Let’s Go Brandon” following a victory by driver Brandon Brown, when they were really shouting, “F— Joe Biden!” The phrase has since become a popular anti-Biden rallying cry.",
    "“The frustration and anger we are feeling toward the failures of our current leadership in Washington is what motivated me to run.” (Read more from “WATCH: Senate Hopeful Torches Biden’s Super Bowl-Sized Fails in ‘Let’s Go Brandon’ Ad” HERE)\nDelete Facebook, Delete Twitter, Follow Restoring Liberty and Joe Miller at gab HERE.",
    "The ad plays the “Let’s go Brandon” chant, as it shows headlines of issues plaguing the Biden administration — like rising inflation, the botched withdrawal from Afghanistan, a surge in crime, and record-high illegal border crossings.",
    "Republican candidate for U.S. Senate in Pennsylvania Dave McCormick is running a “Let’s go Brandon” Super Bowl ad Sunday, highlighting the “self-inflicted” problems facing President Biden and his administration.",
    "Fox News obtained McCormick’s 30-second ad, which is expected to air across NBC platforms during the Super Bowl in Pennsylvania.",
    "“The issues we are facing are so much bigger than ‘Brandon,’” McCormick told Fox News."
  ]
}