{
  "id": 10441,
  "mediaId": 8399,
  "date": "2022-04-02",
  "headline": "Let's not! McCormick’s \"Let's Go, Brandon\" Super Bowl appearance",
  "image": "https://media1.fdncms.com/pittsburgh/imager/u/slideshow/21398660/davemccormick_teaser_700x390.jpg",
  "link": "https://www.pghcitypaper.com/pittsburgh/lets-not-mccormicks-lets-go-brandon-super-bowl-appearance/Content?oid=21398655",
  "mediaOutlet": "pghcitypaper.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Kinney-Kobre",
  "authorUrl": "https://www.pghcitypaper.com/author/hannah-kobre",
  "termIds": [
    0
  ],
  "sentences": [
    "Over a stock photo of a car at the pump, we see a quote from The Economist telling us that “Inflation is at a record high.” A photo of a rubbery looking Mark Zuckerberg serves as the backdrop to The Times telling us that “Big Tech is silencing conservative voices.” A blurry image of police lights instructs us that homicides are higher than they’ve ever been before, etc., etc.",
    "And I also normally am not the kind of person who will deride something by saying, “I/my kid/my pet chimpanzee could have painted that!” But when you spend $70,000 to show something to an entire city and its surrounding areas, I expect a higher production quality than what I achieved when making a video about World War I’s naval arms race for my 11th grade history class.",
    "Armed with all the subtle techniques available to anyone who has a Macbook with iMovie preloaded on it, McCormick essentially shows us a PowerPoint he’s made — the only concessions to what we modern-day sophisticates think of as being “the movies” are a soundtrack comprised of an audience chanting “LET’S GO, BRANDON” and a handful of transition effects.",
    "During the Super Bowl, McCormick, a Republican candidate for Senate in Pennsylvania, decided to show us (the people unfortunate enough to be in the Pittsburgh market) a real masterpiece of political filmmaking: concise, clear-eyed, and, like all politics, supremely banal.",
    "Then, the audio breaks into sudden cheers and the film awkwardly cuts to a big WordArt font telling us, “THIS IS SO MUCH BIGGER THAN BRANDON.” The text slowly zooms towards us, looming larger and larger.",
    "The images fade into each other; the text fades out and comes in with a traditional “text blur” transition, appearing over top the images out of order and going from blurry to clear.",
    "Now I’m not against a barebones approach — the brilliant French Left Bank filmmaker Chris Marker made a short film that is almost entirely composed of still photographs.",
    "His voice reads, “I’m Dave McCormick, and I approve this message,” and his campaign slogan comes on the screen: “Fight for America to Save America.”\nWell, alright.",
    "They’re also poised for everything else that comes with it: not just the halftime show, but for all the incredibly expensive advertisements that act as interludes.",
    "McCormick appears for the first time in his little short, a photo of him posed in front of an American flag attired in a puffer vest and holding a microphone.",
    "(If you, dear reader, do not know what “Let’s go, Brandon” refers to, I won’t explain it and will instead ask that you initiate me in your lifestyle.)",
    "(And also literally reminding me of how it plays when you use the default option for adding text to a video in iMovie, but I digress.)",
    "If you’re going to attempt to be provocative, people chanting “Let’s Go Brandon” is simply not enough to do it.",
    "Well, let’s say you’ve been granted a mere 30 seconds of ad time during this insanely well-viewed event.",
    "The connection between the text and the images is not particularly innovative or interesting.",
    "Millions of viewers at home are all waiting in anticipation, but not just for the big game.",
    "Say what you will about Hollywood liberals: at least they know how to blow something up.",
    "OK, the opening conceit has gone far enough because I already have an answer for you.",
    "Let’s say the game is fantasy football — actually, no, let’s get even more precise.",
    "What are you showing the massive audience that’s right at your fingertips?",
    "It’s not just fantasy football, it’s the fantasy Super Bowl.",
    "(I’m going straight to hell for dragging him into this.",
    "Well, OK, I have Dave McCormick’s answer for you.",
    "I want a little of that movie magic!",
    "And finally, the conclusion!",
    "Your role in the game?",
    "What’s your strategy?",
    "Let’s play a game.",
    "I want artifice!",
    "Sorry, Mr.",
    "Marker.)"
  ]
}