{
  "id": 10834,
  "mediaId": 2553,
  "date": "2022-03-16",
  "headline": "‘I’m In To Win’: Dr. Oz Responds To Report Of TV Show Talks",
  "image": "https://dw-wp-production.imgix.net/2022/03/Untitled-design-21-copy-6.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/im-in-to-win-dr-oz-blasts-reports-of-new-tv-show-as-fake-news",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dillon Burroughs",
  "authorUrl": "https://www.dailywire.com/author/dillon-burroughs",
  "termIds": [
    5905,
    4576,
    2802,
    2964,
    3054,
    2765,
    1394,
    6486,
    6506,
    6512
  ],
  "sentences": [
    "And my failing RINO opponent Dave McCormick is lying about me leaving the race after being exposed by Philly Inquirer.https://t.co/L0DgP6WMGC\n— Dr. Mehmet Oz (@DrOz) March 16, 2022\nOz’s linked a Philadelphia Inquirer article that claimed some of the donors helping McCormick to attack him are past donors of liberal Democrats, including Hillary Clinton’s 2016 presidential campaign.",
    "Pennsylvania Republican U.S. Senate candidate Dr. Mehmet Oz blasted fellow Republican candidate Dave McCormick over claims the former television personality would soon be returning in a new show, calling the reports “fake news.”\nOz responded to the developments in a series of Twitter posts on Tuesday following widespread reports of an alleged deal for a new television program.",
    "Which is why there has already been talk about him becoming a primetime opinion host.”\nAn insider told the publication that if Oz loses that “we have not heard the last of Dr. Oz,” which comes as recent polling shows that former hedge fund CEO David McCormick, backed by Sen. Ted Cruz (R-TX), has blown past Oz in the primary.",
    "pic.twitter.com/uC1j5seZnz\n— Dr. Mehmet Oz (@DrOz) March 16, 2022\nOz followed by referring to the report as, “Fake news being pushed by Dishonest Dave and his team.”\nIn a later post regarding the accusations, Oz made his view clear that he was in the race “to win.”\n“I’m in.",
    "The Daily Wire previously reported on the claim that Oz could be considering a move back to television:\nDr. Mehmet Oz, a U.S. Senate candidate in Pennsylvania, is reportedly in talks to return to television if he does not win the Republican Party nomination for the seat.",
    "“But of the seven known donors, at least four gave to Clinton’s presidential bid and a fifth made a $100,200 donation to the Democratic National Committee weeks before the 2016 election,” the Inquirer report stated.",
    "Cory Booker of New Jersey and Ron Wyden of Oregon, and are now writing $50,000 or $100,000 checks to the pro-McCormick group hammering Oz for being soft on abortion and gun laws,” it added.",
    "“He is only 61-years-old and isn’t ready to retire if he doesn’t go to Washington DC,” sources told Radar, the same publication that broke the Jeff Zucker scandal at CNN.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "And my failing RINO opponent Dave McCormick is lying about me leaving the race after being exposed by Philly Inquirer,” he tweeted.",
    "In another post, Oz said former President Donald Trump called out the “BS” by McCormick’s team in the past.",
    "Today I outlined how Dishonest Dave McCormick ripped off Pennsylvania taxpayers for half a billion dollars.",
    "Like any good doctor, he is already looking for alternatives to keep his career alive if he doesn’t win.",
    "Fortunately for him, his appearances on Fox News and Newsmax have impressed the bosses.",
    "“Honor Pennsylvania donors have also given to high-profile Democrats such as Sens.",
    "The news comes as another GOP candidate has surged to the top of the polls.",
    "“McCormick and his team only have one play when the truth is exposed.",
    "He’s failed PA before and can’t be trusted,” Oz claimed on Twitter.",
    "There is no doubt that he is a very gifted communicator on TV.",
    "“No one wants to admit defeat, but he isn’t a stupid man.",
    "Get inside access to The Daily Wire by becoming a member.",
    "President Trump called it out then, I'm doing it now.",
    "McCormick's team has tried this BS before.",
    "He knows his campaign is on life support.",
    "I’m in to win.",
    "I’m in to win.",
    "I’m in."
  ]
}