{
  "id": 10969,
  "mediaId": 2664,
  "date": "2022-03-14",
  "headline": "Republicans 'kick the crap out of each other' in brutal primaries as Democrats sit back and watch",
  "image": "https://www.rawstory.com/media-library/mehmet-oz.jpg?id=28222367&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/republican-senate-primary/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    5138,
    2505,
    4002,
    4267,
    392,
    1126,
    1489
  ],
  "sentences": [
    "Senate GOP leaders are engaged in a power struggle of their own, with Sen. Rick Scott (R-FL) challenging Senate minority leader Mitch McConnell (R-KY) by unveiling his own 11-point GOP platform, but Republicans remain confident in their chances to retake the majority despite the public infighting eight months out.",
    "Republicans have spent a record $35 million on TV ads in Pennsylvania, where frontrunners Mehmet Oz and Dave McCormick are bashing one another as a “liberal RINO” and “Wall Street insider,” respectively, in attacks that could be used against them again in a general election.",
    "GOP candidates are challenging one another in more than a dozen states, compared to only two primary battles for Democrats -- who are watching the bloodbaths from the sidelines, reported Politico.",
    "“At the same time, this is going to be such a wave year that except in the most egregious examples of poor candidate recruitment, I think Republicans are going to be fine.",
    "“I don’t think we’re doing anything to help ourselves in these primaries, but if the environment holds as it is, I think we’ll win almost everywhere.”",
    "“It’s almost like ‘The Godfather: Part III’ — ‘all the power on earth can’t change destiny,’” said one GOP operative familiar with Senate campaigns.",
    "“They’re doing what I want them to do, which is kick the crap out of each other,” said J.B. Poersch, president of the Senate Majority PAC.",
    "Republican candidates for Senate are battering one another in primary races around the country.",
    "“I don’t think it’s particularly helpful,” said Missouri-based GOP strategist Gregg Keller.",
    "Republican primary voters are angry and juiced up.\""
  ]
}