{
  "id": 12781,
  "mediaId": 2573,
  "date": "2022-02-28",
  "headline": "Belarus may enter Ukraine fight, actress calls Zelenskyy 'a true leader'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/2belarus-newsletter-2-28-22.jpg",
  "link": "https://www.foxnews.com/us/belarus-may-enter-ukraine-fight-actress-calls-zelenskyy-a-true-leader",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "REBECCA GRANT",
  "authorUrl": "",
  "termIds": [
    4591,
    4905,
    4774,
    5271,
    2859,
    5980,
    6672,
    6569
  ],
  "sentences": [
    "Continue reading …\nBIDEN BLASTED - Former Pentagon Chief of Staff Kash Patel slammed President Biden for his \"colossal failure of leadership\" Continue reading …\nOPINION\nNIKKI HALEY - The heroism of Ukraine’s people and leadership is inspiring the free world to support their cause.",
    "- REP. DAN CRENSHAW\nFOLLOW FOX NEWS ON SOCIAL MEDIA\nYouTube\nSIGN UP FOR OUR NEWSLETTERS\nFox News Entertainment (FOX411)\nDOWNLOAD OUR APPS\nWATCH FOX NEWS ONLINE\nThis edition of Fox News First was compiled by Fox News' Jack Durschlag.",
    "Continue reading …\n‘FEARLESS’ VS. FECKLESS - The images of Ukrainian President Volodymyr Zelenskyy on the ground in Ukraine helping his countrymen fight draw a strong contrast with Russian President Vladimir Putin.",
    "Continue reading …\nSOTU FOCUSED - Presidential Press Secretary Jen Psaki did not respond to accusations on Biden’s mental capacity but instead focused on Biden’s State of the Union address.",
    "Continue reading …\nMEDIA\nGORDON CHANG - Author Gordon G. Chang warned that President Biden’s lack of action against Russia will help China’s efforts to \"marginalize the United States.\"",
    "Continue reading …\nUKRAINIAN WILL - As day five of Russia's invasion of Ukraine unfolds, Ukrainian civilians are determined to fight for their families, their homes and their freedoms.",
    "Continue reading …\nKIRSTIE’S FEUD - Kirstie Alley will pray for Ukraine after getting into a social media feud with her former \"Dancing With the Stars\" partner, Maks Chmerkovskiy.",
    "Continue reading …\nNATO STRENGTHENS - British Ambassador to the U.S. Dame Karen Pierce said Vladimir Putin's aggressive and \"destabilizing\" behavior has strengthened NATO allies.",
    "Continue reading …\nTHOMAS PYLE - Americans across the country are hurting financially, in large part thanks to policies enacted out of Washington, D.C., over the past year.",
    "Continue reading …\nROYAL SUPPORT - Meghan Markle and Prince Harry reiterated support for Ukraine as they accepted an award at the NAACP Awards on Saturday night.",
    "Continue reading …\nDAVE MCCORMICK - Russia's unprovoked invasion of Ukraine has begun, driven by Vladimir Putin's decades-old desire to rebuild the Soviet Union.",
    "Continue reading …\nPOLITICS\nCOTTON’S TAKE - Sen. Tom Cotton, R-Ark., was repeatedly asked by ABC’s George Stephanopoulos to bash former President Trump.",
    "Continue reading …\nMCCARTHY VS. PUTIN - House Minority Leader Rep. Kevin McCarthy, R-Calif, described Vladimir Putin as \"reckless, evil and dangerous.\"",
    "Continue reading …\nTRUMP’S THE CHOICE - Former President Donald Trump easily won the 2024 GOP presidential nomination straw poll at the CPAC gathering.",
    "Continue reading …\nMADONNA: ‘POINTLESS’ - Madonna called for the end of \"Russia's pointless and greed driven invasion of the Ukraine\" on social media.",
    "Continue reading …\nRUSSIA SCRUTINIZED - Russia’s UN role is under fresh scrutiny and the Ukrainian president demands Moscow be stripped of its vote.",
    "Continue reading …\nROOFTOP REVELATIONS: Day 99: Like most Americans, I've been watching the Russian invasion of Ukraine unfold in real time.",
    "Continue reading …\nUKRAINIAN-AMERICAN SUPPORT - New Jersey residents gathered to support the men and women fighting against Russian forces.",
    "Continue reading …\nSEEKING THE NOD - All but one of the major candidates in Ohio's GOP showdown spotlight their support for Donald Trump.",
    "- A senior U.S. intelligence official says Belarus is expected to send troops into Ukraine as soon as Monday to fight alongside Russia.",
    "Continue reading …\nFOSSIL FUELS - Rep. Dan Crenshaw, R-Texas, said the longtime war on fossil fuels enabled Russia to invade Ukraine.",
    "IN OTHER NEWS\n‘A TRUE LEADER’ - Actress Katheryn Winnick may have been born in Canada, but her heart and homeland is with Ukraine.",
    "Continue reading …\nFRANKEL’S UKRAINE PLANS- Bethenny Frankel is attempting to get to Ukraine amid the country's war with Russia.",
    "Continue reading …\nMASK-FREE - Face coverings are now optional for President Joe Biden’s State of the Union address Tuesday.",
    "Continue reading …\nFollow along as Fox News checks in with Pastor Corey Brooks each day with a new Rooftop Revelation.",
    "Continue reading …\nKT MCFARLAND - Everyone is understandably focused on how to stop Putin’s Ukraine grab.",
    "For me, there's a sense that we knew this was going to come, that this was going to happen.",
    "Continue reading …\nFOX WEATHER\nWhat’s it looking like in your neighborhood?",
    "Here's what you need to know to start your day ...\nBELARUS ENTERING WAR?",
    "Continue reading…\nTHE LAST WORD\n\"There are two things that stop war.",
    "Thank you for making us your first choice in the morning!",
    "We’ll see you in your inbox first thing Tuesday.",
    "The credible threat of force, and leverage.\"",
    "Good morning and welcome to Fox News First."
  ]
}