{
  "id": 1574,
  "mediaId": 8428,
  "date": "2022-02-14",
  "headline": "Republican Senate candidate airs powerful ‘Let’s Go, Brandon’ commercial during the Super Bowl",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/02/Screen-Shot-2022-02-14-at-9.03.18-AM-e1644849847561.png",
  "link": "https://www.rsbnetwork.com/news/republican-senate-candidate-airs-powerful-lets-go-brandon-commercial-during-the-super-bowl/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Caldwell",
  "authorUrl": "https://www.rsbnetwork.com/author/alex-caldwell/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Whether it’s not being able to afford gas or groceries because of record-high inflation, rampant crime in our cities, a dramatic spike in the trafficking of fentanyl and human exploitation across open borders, or the disgraceful lack of accountability for the death of 13 young service members in Afghanistan—these problems were self-inflicted by Joe Biden and the extreme policies of the left,” he added.",
    "The phrase “Let’s Go, Brandon” became popular after an NBC News reporter falsely claimed that a crowd of NASCAR fans were cheering for race car driver Brandon Brown, when they were really chanting, “F*** Joe Biden.”\nAfterwards, “Let’s Go, Brandon” became a popular stand-in for the crasser phrase and has been chanted loudly across sporting events and concerts ever since.",
    "McCormick, however, has received endorsements from multiple members of the Trump administration, including former Secretary of State Mike Pompeo, former White House Press Secretary Sarah Huckabee Sanders, counselor Kellyanne Conway, former advisor Stephen Miller, and many others.",
    "The 30-second ad detailed failures from Joe Biden’s first year in office, including record inflation, rising crime, heightened illegal border crossings, and the botched troop withdrawal from Afghanistan.",
    "'”\n“The frustration and anger we are feeling toward the failures of our current leadership in Washington is what motivated me to run,” the Senate candidate told Fox News ahead of the ad’s release.",
    "McCormick served as Under Secretary of the Treasury under President George W. Bush from 2007 to 2009, and later became CEO of Bridgewater Associates, one of the world’s largest hedge funds.",
    "Pennsylvania Republican Dave McCormick, a candidate for U.S. Senate, aired a “Let’s Go, Brandon” commercial during Sunday’s Super Bowl LVI that later went viral.",
    "McCormick, whose wife served as deputy national security advisor for President Trump, has stated his support for the 45th president’s “American First” agenda.",
    "McCormick is running against a crowded field of Republicans, including celebrity physician Dr. Mehmet Oz, to succeed retiring Republican Sen. Pat Toomey.",
    "Trump has not yet endorsed a candidate after Republican Sean Parnell, his original endorsement, dropped out of the race.",
    "Nevertheless, McCormick argued that the problems facing Pennsylvanians “are so much bigger than ‘Brandon.",
    "All the while, a powerful “Let’s Go, Brandon” chant constantly played in the background.",
    "Pennsylvania’s 2022 GOP primary is one of the most contested races in the country.",
    "He is also a graduate of Princeton University and a U.S. Army veteran."
  ]
}