{
  "id": 18694,
  "mediaId": 8417,
  "date": "2022-01-12",
  "headline": "Plan many small weekend trips or live the van life with an RV",
  "image": "https://www.gannett-cdn.com/presto/2022/01/11/NETN/98150a3b-8e92-45f8-be42-ed296945fd8a-Back_of_pickup_camper_Wise.jpeg?crop=1991,1120,x4,y0&width=1991&height=1120&format=pjpg&auto=webp",
  "link": "http://rssfeeds.publicopiniononline.com/~/677829026/0/publicopiniononline/sports~Plan-many-small-weekend-trips-or-live-the-van-life-with-an-RV/",
  "mediaOutlet": "publicopiniononline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Plan a trip:Find out why more than 1 million visit Ohiopyle State Park each year\n\nWith the Pittsburgh RV Show underway this week at the David L. Lawrence Convention Center, there are plenty of experts on hand who can introduce you to camping or help you upgrade to the latest technology.",
    "Hours through Friday are 4 to 9 p.m.; Saturday from 10 a.m. to 9 p.m., and Sunday from 10 a.m. to 5 p.m.\n\nTickets are available at the Convention Center box office – or skip the line by purchasing tickets in advance at www.PittRVshow.com.",
    "Brian Whipkey\n\nPennsylvania Outdoor Columnist\n\nThe coronavirus pandemic over the last year has made each of us realize how to do some things differently and focus on our true priorities in life.",
    "“You can take your toys with you.”\n\nYour next adventure:Spend a day on Lake Arthur in Moraine State Park\n\nHe said the challenge is getting the inventory for people who want to invest in RVs.",
    "Off the grid:Pa. Campers look to solar panels for remote power needs of motorhomes\n\nVenues like this one offer sites to set up your own camper or you can rent a cabin for your stay.",
    "“Many times people say it’s the nicest camper here in the entire show.”\n\nThe unit is designed to have a bed, table kitchen and bathroom in the size of a truck with an 8-foot bed.",
    "Once you make the investment, you can just keep using it and creating family bond memories for life.”\n\nTry whitewater this spring:Thinking about riding whitewater at Ohiopyle?",
    "Here's what you need to know\n\nCamping opportunities range from tents to folding campers, solid wall units to large trailers pulled by pickup trucks with a fifth-wheel hitch.",
    "Dave McCormick, one of the Mountain Pines employees at the RV Show, said they are in the process of upgrading their Wi-Fi access for people to work from their camper.",
    "Anthony Talerico, finance manager at Hufnagel & Majors Trailer Sales in Harmony, said, “The RV industry gives you the ability to work remotely inside your trailer.",
    "Coworker Deanna Horak said working remotely at a campground, “you have a wonderful view and your children have a variety of activities to do while you’re working.",
    "You can pretty much work from your vacation.”\n\nPeople are spending more time with their family and planning more short weekend trips that fit in with RV’ing.",
    "\"When you vacation and travel with an RV, you still have the memories and you still have the pictures, but you have the RV to go again and again and again.",
    "“It’s pretty versatile,” he said because the owner can still tow a boat, four wheelers or even another camper while having this camper on their truck bed.",
    "They are kind of out of your hair for a little bit.” She said children can ride on their bikes with their friends in a safe environment while you work.",
    "“It’s a win-win.”\n\nHorak said in addition to their pools, there is a stocked fishing creek, bands in the evenings, crafts and activities for adults.",
    "You can explore the country with a recreational vehicle and still stay connected with work, family and friends wherever there is internet access.",
    "Contact him at bwhipkey@gannett.com and sign up for our weekly Go Outdoors PA newsletter email on your website's homepage under your login name.",
    "Justin Wise, manager of Wise Trailer Sales in Ebensburg, had a camper that slides into the back of a pickup truck on display at the show.",
    "If you want a safe place to have your family, there are numerous campgrounds and state parks across the state to accommodate your needs.",
    "With people social distancing and having the ability to work from remote areas, the van-life lifestyle has become a growing trend.",
    "Randy Giancola, the show’s promoter from Three River’s Promotions, said Tuesday, campers are a great way to make endless memories.",
    "If you’re thinking about camping this year, it’s time to start planning and making your reservations before the sites become full.",
    "The facility is celebrating its 100th anniversary and is known for having the largest walk-in swimming pool in the commonwealth.",
    "Lisa Shirley, who also works at Mountain Pines, said campgrounds have been busier than ever because of the coronavirus.",
    "Your choices are cruise ships, planes, destinations with a hotel, a train and a hotel or a bus and a hotel,\" he said.",
    "To find out more about RVs the convention center has nine acres of campers and inventory on display through Sunday.",
    "If you don’t have a vehicle to pull a camper, there are motorhomes that rival the amenities of many homes.",
    "He said they received four loads of campers and they were all sold by the time they arrived on his lot.",
    "They usually have 30 to 40 trailers of different sizes and shapes but now only have three.",
    "“One of the beauties of RV’ing, I’ve been telling people, is vacations are old as America.",
    "Many campgrounds have on-site laundry facilities to make your extended stay easier, too.",
    "“It’s been crazy,” he said about finding inventory and parts during the past two years.",
    "Brian Whipkey is the outdoor columnist for USA TODAY Network sites in Pennsylvania.",
    "\"When you get done with those types of vacations you really have three things left.",
    "People are able to monitor their own environment and bedding with a camper.",
    "Dealers are also having a good year but do have trouble getting inventory.",
    "“It was our busiest year ever,” she said about the start of the pandemic.",
    "Those concerned about mail can get a box at the nearest Post Office.",
    "One place is Mountain Pines Campground in Champion, Fayette County.",
    "You have pictures, you have memories and you have receipts.",
    "People have been going on holidays and going on trips.",
    "We probably quadrupled (in the number of campers).",
    "It’s never been as busy as it is right now.\"",
    "Follow him on social media @whipkeyoutdoors.",
    "It also comes with Wi-Fi capabilities.",
    "“It went insane."
  ]
}