{
  "id": 2675,
  "mediaId": 2573,
  "date": "2022-01-28",
  "headline": "Biden visits Pittsburgh bridge collapse site, promises US will 'fix them all'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/Pittsburgh-Bridge-Collapse-Biden-Visit-3.jpg",
  "link": "https://www.foxnews.com/politics/biden-visits-pittsburgh-bridge-collapse-site-promises-us-fix-all",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1802,
    4905,
    4560,
    1053,
    1427,
    6506,
    6520
  ],
  "sentences": [
    "PITTSBURGH BRIDGE COLLAPSE CAUSES MASSIVE GAS LEAK LEAVING 3 HOSPITALIZED AHEAD OF BIDEN'S VISIT\nThe Pittsburgh bridge collapse left three hospitalized and 10 injured near Frick Park early Friday morning, according to the Pittsburgh Post-Gazette.",
    "First responders reported to the site and rappelled nearly 150 feet to help passengers from a dangling bus, while others formed a human chain to help rescuers with the effort.",
    "The bridge has become a symbol of worsening infrastructure in the city and the nation, and Biden has used the destruction of the bridge in his rhetoric since.",
    "In Pittsburgh, the president looks to tout his $1 trillion infrastructure bill as well as his administration's economic progress in his first year.",
    "But I didn't realize there are literally more bridges in Pittsburgh than any other city in the world,\" Biden said at the scene of the incident.",
    "Biden promised the crowd that the bridge infrastructure of the city would be addressed, along with all 43,000 bridges in the U.S. nationwide.",
    "While no fatalities have been reported and all victims are in stable condition, the massive collapse shook the city and surrounding area.",
    "President Biden stopped by the location of a bridge collapse in Pittsburgh Friday afternoon during an official trip to Pennsylvania.",
    "For him coming today to talk about why this funding is so important … this is critical we get this funding,\" Gainey told WITF.",
    "Jones added that families who were told to evacuate during the leak have returned home and their gas has been restored.",
    "The United States Army Reserve was deployed to ensure there were no victims under the bridge during the collapse.",
    "Pittsburgh Fire Chief Darryl Jones said a gas leak that was caused by the collapse is now \"under control.\"",
    "The injured were transported to a hospital with injuries that were not considered life-threatening.",
    "Pittsburgh Mayor Ed Gainey emphasized the importance of Biden's visit given the bridge collapse.",
    "\"I've been coming to Pittsburgh a long time – and as a former Pennsylvanian.",
    "There’s 43,000 nationwide, and we’re sending them money,\" Biden said.",
    "\"I knew there were a lot of bridges – I had no idea of that.",
    "Fox News's Emmett Jones contributed to this report.",
    "\"We know we have bridges we need to take care of.",
    "This is going to be a gigantic change.",
    "And we’re gonna fix them all.",
    "\"More than Venice.\"",
    "It’s not a joke."
  ]
}