{
  "id": 3654,
  "mediaId": 2658,
  "date": "2022-01-21",
  "headline": "Pro-Oz group changes ‘You’re Fired’ ad against McCormick",
  "image": "https://static.politico.com/8a/67/0eb50e6e43a5b5e102ba1ef97fc1/ap21337709329498-1.jpg",
  "link": "https://www.politico.com/news/2022/01/21/pro-oz-group-mccormick-ad-527571",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The piece, which linked to a Foreign Policy report that had broken the news, said that the “Defense Department on Friday said that a number of members of its Defense Policy Board — including former Secretaries of State Henry Kissinger and Madeleine Albright — had been removed” as well as “former Treasury undersecretary David McCormick.”\nIn the letter to station managers, a lawyer for the McCormick campaign pointed out that Foreign Policy had written a follow-up article that read, “One update from last week: Former Treasury official David McCormick, once a contender for Pentagon chief, will stay on the board.”\nMcCormick’s team sent a second letter that cited a government document as additional evidence that McCormick remained on the board until February 2021, after Trump left office.",
    "The original TV spot said that McCormick, a former hedge fund CEO running against celebrity physician Mehmet Oz for the GOP Senate nomination in Pennsylvania, “criticized President Trump’s China policy — no wonder Trump fired him.” An all-caps chyron on the screen blasted “PRESIDENT TRUMP TO McCORMICK: YOU’RE FIRED.”\nThe new, edited advertisement now running does not say anything about Trump canning McCormick.",
    "A super PAC boosting Jeff Bartos, a real estate developer, has spent or committed more than $1 million, including on an ad labeling Oz and McCormick as “out-of-state politicians” who are trying to “buy a Pennsylvania Senate seat.” Carla Sands, a former ambassador to Denmark during the Trump administration, has also spent or reserved upwards of $1.8 million on TV.",
    "Donald Trump poses for photos with David McCormick at the Trump National Golf Club Bedminster clubhouse, Sunday, Nov. 20, 2016, in Bedminster, N.J. | Carolyn Kaster, File/AP Photo\nBy Holly Otterbein\n 01/21/2022 11:26 AM EST\nIn the Pennsylvania GOP Senate battle to prove who’s most loyal to Donald Trump, David McCormick just scored a small victory.",
    "Instead, a narrator bashes McCormick as having “criticized President Trump’s China policy — that’s not putting America first.”\nThe battle between the pro-Oz group and McCormick’s campaign over the negative ad demonstrates the hold that Trump continues to have on the Republican Party ahead of this year’s midterm elections.",
    "“This false ad being taken down just reinforces what Pennsylvanians already know: Dave McCormick is battle-tested and Pennsylvania-true and Mehmet Oz can’t be trusted.”\nThe GOP contest in Pennsylvania for the seat being vacated by Republican Sen. Pat Toomey is already extremely expensive and increasingly contentious.",
    "“Lies are all the Mehmet Oz camp has because the truth — that he’s a Hollywood liberal and Dave McCormick is a Pennsylvania, combat veteran conservative — is their worst enemy,” said Jess Szymanski, a spokesperson for McCormick.",
    "Both self-funders, Oz has spent $4.1 million and booked an additional $1.3 million in ad time, according to the ad tracking firm AdImpact, while McCormick has dropped nearly $3.4 million on ads and committed an extra $385,000.",
    "In addition to disputing the claim about Trump firing him, McCormick’s campaign also refuted other allegations in the American Leadership Action spot, including that he called China an “ally” and outsourced Pittsburgh jobs.",
    "Both Oz and McCormick, who are widely viewed as two of the top candidates in the Republican primary, have touted their “America First” beliefs and sought to downplay departures from conservative orthodoxy.",
    "Moreover, McCormick’s positions on China are in sync with Trump’s,” McCormick’s team wrote in a letter to television station managers, which was first obtained by POLITICO.",
    "Two anti-Oz groups, Honor Pennsylvania and Pennsylvania Patriots Victory Fund, have so far spent or committed $1.1 million and $166,000, respectively, on television.",
    "A pro-Dr. Oz super PAC has overhauled an attack ad after McCormick’s campaign complained that it had lied in saying that the former president had fired him.",
    "Their spots have accused Oz of being a “Hollywood liberal” and slammed him for his previous positive comments about the Affordable Care Act.",
    "GOP campaigns and their allies are determined to paint their opponents as NeverTrumpers — while claiming the MAGA mantle for themselves.",
    "AdImpact confirmed that the organization’s spot hitting McCormick had been changed following the two letters from McCormick’s campaign.",
    "In the ad, it previously pointed to a Fox News article in November 2020 as evidence that Trump had fired McCormick.",
    "McCormick, who criticized Trump after the Jan. 6 attack on the Capitol, has taken care to MAGA-proof his campaign.",
    "He has hired former top Trump operatives and distanced himself from his former company’s ties to China.",
    "Those attacks have remained in the ads, though the McCormick team is still fighting them.",
    "American Leadership Action, the pro-Oz group, did not respond to a request for comment.",
    "American Leadership Action, meanwhile, has spent or reserved $1.2 million on TV ads.",
    "“The ad’s claim about Trump firing McCormick is totally false.",
    "Daniel Lippman contributed to this report."
  ]
}