{
  "id": 3798,
  "mediaId": 8483,
  "date": "2022-01-26",
  "headline": "Pa. Senate candidate Jeff Bartos counts on grassroots campaign to beat high-profile competitors",
  "image": "https://kubrick.htvapps.com/vidthumb/438f6aa9-8ef7-4a4b-bc67-2330c7cd7159/438f6aa9-8ef7-4a4b-bc67-2330c7cd7159_image.jpg?crop=1xw:1.0xh;center,top&resize=1200:*",
  "link": "https://www.wgal.com/article/pa-senate-candidate-jeff-bartos-counts-on-grassroots-campaign-to-beat-high-profile-competitors/38902962",
  "mediaOutlet": "wgal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Barbara Barr",
  "authorUrl": "https://www.wgal.com/news-team/dd3d1fae-1c80-4987-8033-777e744e3c47",
  "termIds": [
    0
  ],
  "sentences": [
    "Dr. Mehmet Oz and Dave McCormick are making headlines and getting airtime with political ads in the race for Pennsylvania's U.S. Senate seat, but Republican Jeff Bartos is emerging as a favorite of the party faithful.",
    "\"We raised over $3.5 million and helped over 1,000 women and men keep their small businesses open, save thousands of jobs for working families,\" he said.",
    "Bartos, a Montgomery County real estate developer, touts his roots compared to other high-profile Republican candidates in the race.",
    "\"Pennsylvanians are not going to elect people who just moved here – political tourists – to represent them,\" he said.",
    "The only way we save Main Street, Pennsylvania, is to have a broad, very robust economy in all 67 counties,\" he said.",
    "Bartos won straw polls of Republican committee members in a number of central and northeastern Pennsylvania counties.",
    "They are candidates who have worked and made money elsewhere but are now spending time and money in Pennsylvania.",
    "\"I've been working with them, side by side with them, for about five years,\" Bartos said.",
    "Pa. Senate candidate David McCormick holds campaign rally with Sen. Ted Cruz",
    "He created a nonprofit to help small businesses survive the pandemic.",
    "The challenge now is whether his message will connect with voters.",
    "The open seat could swing the balance of power in the U.S. Senate.",
    "\"This campaign is focused on saving Main Street, Pennsylvania.",
    "Bartos said he's building a grassroots ground game to win.",
    "Bartos is referring to Oz, McCormick and Carla Sands.",
    "His message is resonating with the party faithful.",
    "I come from a business background,\" Bartos said.",
    "Bartos previously ran for lieutenant governor.",
    "\"I'm a proud lifelong Pennsylvanian.",
    "I'm a conservative."
  ]
}