{
  "id": 425,
  "mediaId": 8481,
  "date": "2022-02-20",
  "headline": "Penn State THON 2022 breaks record with over $13.7 million raised",
  "image": "https://www.wearecentralpa.com/wp-content/uploads/sites/69/2022/02/THON-2022-3.jpg?w=1280",
  "link": "https://www.wearecentralpa.com/news/local-news/penn-state-thon-2022-breaks-record-with-over-13-7-million-raised/",
  "mediaOutlet": "wearecentralpa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jared Weaver",
  "authorUrl": "https://www.wearecentralpa.com/author/jared-weaver/",
  "termIds": [
    0
  ],
  "sentences": [
    "“And the $190 million THON has raised made it possible for Four Diamonds to cover the cost to care for all of our children who are fighting cancer at Penn State Health Children’s Hospital and to wrap them in comprehensive services.",
    "“It’s extraordinary, THON makes up close to 70 percent of the funds raised for Four Diamonds since we first went into partnership together,” Graney said.",
    "In total, THON raised $13,756,375.50 that will go towards Four Diamonds at Penn State Children’s Hospital, aiding in the fight against childhood cancer.",
    "The 46-hour marathon celebration had live music, dance performances, motivational speakers and appearances from families impacted by childhood cancer.",
    "Most importantly to invest in research, looking for a cure.”\nLast year due to COVID-19 THON was held virtually but was back in person for 2022.",
    "UNIVERSITY PARK, Pa. (WTAJ) — Penn State’s THON 2022 broke its record for most money raised with over $13.7 million raised.",
    "Executive Director of Four Diamonds Suzanne Graney said how much THON really means to the Four Diamonds organization.",
    "More than 700 students gathered at the Bryce Jordan at 6 p.m. on Friday and remained standing until 4 p.m. Sunday.",
    "This is just one event from a year of fundraising efforts, but the dance marathon is certainly the most popular.",
    "THON has raised over $190 million total with $13.7 million now on top of that amount.",
    "Even pop singer Chelsea Cutler made a surprise appearance on Friday night.",
    "THON is the largest student-run philanthropy in the world.",
    "This breaks the 2014 record of $13.34 million."
  ]
}