{
  "id": 4373,
  "mediaId": 2562,
  "date": "2022-01-22",
  "headline": "Ted Cruz Endorses McCormick in Pa. Senate Race",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/01/getfile.aspxguid5A30BBCD-A15B-4D61-885F-BB3B9F7ED2F8.jpg",
  "link": "https://donaldjtrumppolls.com/ted-cruz-endorses-mccormick-in-pa-senate-race/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "Ted Cruz Endorses McCormick in Pa. Senate Race David McCormick (Peter Dejong/AP)\nBy Luca Cacciatore | Saturday, 22 January 2022 06:27 PM\nSen. Ted Cruz, R-Texas, endorsed Dave McCormick for the 2022 Senate election in Pennsylvania on Friday during an appearance on Fox News' \"The Ingraham Angle.\"",
    "The Pennsylvania senate candidate followed the announcement with thanks and recognition on Twitter of Cruz's contributions to the Senate as a conservative leader:\n\"BREAKING: I'm thrilled to announce @TedCruz's endorsement of my campaign.",
    "McCormick is in a stacked field for the Republican primary, including conservative commentator Kathy Barnette, former Ambassador Carla Sands, and TV star Dr. Mehmet Oz, according to The New York Times.",
    "\"He was a high school wrestler, he was a high school football player, he got appointed to West Point, he was the captain of the wrestling team at West Point\n\"This guy's a bada**.\"",
    "The former Bush official decided to join the race after Trump-endorsed candidate Sean Parnell dropped out amid a public custody fight with his estranged wife.",
    "\"You look at Dave's story, he's born in Pittsburgh, grew up on a Christmas tree farm in Western Pennsylvania,\" Cruz added.",
    "As we fight to restore our values, it's an honor to have the support of great Conservative leaders like Ted.\"",
    "He is also former official in the Treasury Department under President George W. Bush, according to CNN.",
    "\"I've known Dave for a lot of years, and I think he is an exceptionally strong candidate,\" Cruz said.",
    "He has since received the endorsement of Parnell, The Washington Free Beacon reported.",
    "McCormick served as a CEO of Bridgewater Associates since 2017, according to Reuters.",
    "\"We've got to win Pennsylvania to take the Senate.\"",
    "Original Article"
  ]
}