{
  "id": 4466,
  "mediaId": 2658,
  "date": "2022-01-12",
  "headline": "Powell's path to maximum employment? Price stability",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/morning-money/2022/01/12/powells-path-to-maximum-employment-price-stability-799819",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3373,
    2238,
    2564,
    5567,
    5408,
    481
  ],
  "sentences": [
    "REGULATOR TO PROBE FINANCIAL DATA MARKETS — Our Matei Rosca in London: “The British financial regulator will open investigations into the functioning of the capital-market data sector amid complaints of monopolistic behavior by big players, it announced on Tuesday.”\nIMF: CRYPTO CAN NO LONGER HEDGE YOUR INVESTMENTS — Bjarke Smith-Meyer in Brussels: “The value of Bitcoin and other cryptocurrencies are moving more in lockstep with market swings in the stock market and therefore serve as a poor hedge for investment portfolios, according to the International Monetary Fund.”\nFED WATCH —\n— WSJ’s Michael S. Derby: “[P]owell said Tuesday the central bank is close to finalizing a broad revamp of its ethics rules prompted by criticism of officials’ financial transactions during the coronavirus pandemic.”\n— Bloomberg’s Allyson Versprille and Jesse Hamilton: “There’s room for privately issued stablecoins to exist alongside a possible central bank digital currency, according to Federal Reserve Chair Jerome Powell.",
    "Driving the Day\nDecember consumer price index data released at 8:30 a.m. … Peterson Foundation hosts a discussion on the fiscal outlook with NBER President Jim Poterba and Grant Thornton chief economist Diane Swonk at 1 p.m. … Treasury Department monthly budget data released at 2 p.m. … Federal Reserve Beige Book released at 2 p.m.\nPOWELL’S WARNING TO CONGRESS: INFLATION IS A SEVERE THREAT TO JOBS — Our Victoria Guida: “Powell dug in with lawmakers on the Senate Banking Committee during the confirmation hearing about how the central bank will chart a course to lower inflation without choking off a promising job market recovery and without spooking financial markets.”\n— And from our Sam Sutton: Powell indicated Tuesday that he’s open to giving Wyoming crypto banks access to the Fed's payment rails, in what would be a big boost for the growth of the digital asset industry.",
    "Those 20 disasters killed 688 people and cost $145 billion, with $75 billion of that coming from Hurricane Ida.”\nBEARS U-TURN ON EMERGING CURRENCIES AS FED RATE HIKES DRAW NEAR — Bloomberg’s Netty Idayu Ismail: “Currency watchers are reining in bearish emerging-market calls, betting that the asset class is now in a better position to withstand Federal Reserve rate hikes when they come.”\nBANK STOCKS SET FOR BIG GAINS BEFORE POTENTIAL RATE INCREASES — WSJ’s Hardika Singh: “Investors are betting that looming interest-rate increases will fuel profits in financials and make the sector more attractive than tech, one of the main contributors to last year’s rally.",
    "“It was a pretty predictable hearing.”\n— Meanwhile, Atlanta Fed President Raphael Bostic told WSJ’s Derby Monday, ‘I’m totally open to March being a meeting where interest rate changes are considered.”\nTOOMEY WARNS ON POSSIBLE RASKIN PICK AS TOP FED REGULATOR — Bloomberg’s Steven Dennis: “‘Sarah Bloom Raskin has specifically called for the Fed to pressure banks to choke off credit to traditional energy companies and to exclude those employers from any Fed emergency lending facilities,’ Sen. Pat Toomey (R-Pa.) said in a statement to Bloomberg News.",
    "‘There is a huge risk the SEC will shut it down,’ said Thomas Gorman, a partner at the law firm Dorsey & Whitney and former official at the SEC.”\nFIRST LOOK: CBA ASKS FDIC TO PAUSE RULES UNTIL A REPUBLICAN JOINS THE BOARD — The Consumer Bankers Association, in a letter to the FDIC yesterday, urged the agency’s Democratic board members to avoid passing any new rules until the president nominates and the Senate confirms a Republican board member to replace Chairman Jelena McWilliams, whose resignation is effective Feb. 4.",
    "Here’s Yellen in September 2016, discussing “risks in waiting too long to remove accommodation”:\n“One is the risk that the economy runs too hot … that we need to tighten policy in a less gradual way than would be ideal, and in the course of doing that — because that is a very difficult thing to accomplish, to gently create a bit more slack in the labor market — we could cause a recession in the process.”\n“And so that’s something my colleagues and I certainly wouldn’t want to be responsible for.",
    "After the hearing, Senate Banking Chair Sherrod Brown (D-Ohio) tweeted this excerpt from from his opening statement:\n“Let's cut through the economists' lingo––when people talk about ‘cooling off’ the economy, what they really mean is making it harder for people to find jobs and stopping paychecks from growing.”\nIT’S WEDNESDAY — Good news for inflation expectations?",
    "WORLD BANK WARNS THAT PANDEMIC WILL SLOW ECONOMIC GROWTH IN 2022 — NYT’s Alan Rappeport: “The World Bank said on Tuesday that the pace of global economic growth was expected to slow in 2022, as new waves of the pandemic collide with rising prices and snarled supply chains, blunting the momentum of last year’s recovery.",
    "(h/t Daniel Lippman)\nFly Around\nWEATHER DISASTERS COST $145 BILLION IN DAMAGE LAST YEAR IN U.S., NOAA SAYS — CNBC’s Catherine Clifford: “In 2021, there were 20 separate billion-dollar weather and climate change disasters, according to a report from the National Oceanic and Atmospheric Administration released Monday.",
    "The tech-heavy Nasdaq Composite fell 4.5 percent last week, the most since March 2020.”\nFollow us on Twitter\nMark McQuillian @mcqdc\nKate Davidson @KateDAvidson\nAubree Eliza Weaver @aubreeeweaver\nBen White @morningmoneyben\nVictoria Guida @vtg2\nKaty O'Donnell @katyodonnell_\nZachary Warmbrodt @Zachary\nFollow Us",
    "We would all like to have a very long expansion, with the labor market operating well for many years to come.”\nAnd then-Fed Chair Alan Greenspan in March 1997:\n“We believe that a necessary condition for sustained economic growth, which is the maximum that can be achieved, is low inflation or price stability.",
    "Such actions not only threaten both the Fed’s independence and effectiveness, but would also weaken economic growth.’”\nBIDEN REGULATORS COULD RAIN ON TRUMP’S SPAC PARADE — CNN’s Matt Egan: “Former President Donald Trump is plotting a return to Wall Street with a new media company taking aim at Big Tech.",
    "It will also eliminate non-sufficient fund fees and no longer charge a transfer fee for a program where customers can use other linked accounts to cover shortfalls …”\nThe move comes amid mounting pressure on banks from Democratic policymakers, including Sen. Elizabeth Warren (D-Mass.)",
    "But Powell offered this blunt assessment of the trade-offs of waiting too long: “If these high levels of inflation get entrenched in our economy and in people’s thinking, that will inevitably lead to much tighter monetary policy from us, and it could lead to a recession,” he said.",
    "With inflation running near four-decade highs, and rapid progress in the labor market — maximum employment is fast approaching or may be already here, Powell said at his confirmation hearing Tuesday — the Fed has signaled it could soon begin lifting short-term interest rates.",
    "The Fed plans to publish a report on digital currencies in the coming weeks, Powell said at a Senate Banking Committee hearing on Tuesday.”\n— Brown said after Tuesday’s hearing that Powell should easily win confirmation to a second term, Bloomberg’s Daniel Flatley reported.",
    "MCCORMICK MAGA-PROOFS HIS SENATE CAMPAIGN AFTER DISSING TRUMP — Our Holly Otterbein and Natalie Allison: “Dave McCormick has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an “America First” mindset.",
    "“It was really easy to say, ‘We’re going to focus largely on the employment mandate because inflation isn’t going anywhere.’ Suddenly, inflation’s going somewhere.”\nBut it’s not likely to appease Democrats, even if they generally do support Powell’s nomination.",
    "Powell led a dramatic shift in the Fed’s monetary policy strategy last year — officials would no longer preemptively raise short-term rates to ward off inflation, but would wait until the labor market had achieved “broad-based and inclusive” maximum employment.",
    "Price stability\nBy KATE DAVIDSON and AUBREE ELIZA WEAVER\n01/12/2022 08:00 AM EST\nPresented by\nEditor’s Note: Morning Money is a free version of POLITICO Pro Financial Services morning newsletter, which is delivered to our subscribers each morning at 5:15 a.m.",
    "Quick Fix\nAs Jerome Powell faces pressure from Democrats to keep interest rates low for the sake of the labor market, the Federal Reserve chair is reverting to a familiar central bank defense: High inflation hurts workers, too.",
    "BANK OF AMERICA TO SLASH OVERDRAFT FEES AFTER PUSH BY WARREN, CHOPRA — Our Katy O’Donnell: “The Charlotte, N.C.-based bank — the second-largest U.S. lender — said it will reduce overdraft fees from $35 to $10 beginning in May.",
    "“So we do not distinguish the goal of maximum sustainable economic growth from low inflation, because we believe the evidence is increasingly becoming persuasive that one is a necessary condition of the other,” he said.",
    "This projection underscores the stubborn nature of the public health crisis, which is widening inequality around the world.”\nJobs Report\nJennifer Songer is now policy counsel in the office of the chair at the SEC.",
    "“And that would be bad for workers.”\n“So really, achievement of maximum employment, by which we really mean continued progress in hiring and participation, is going to require price stability,” he added.",
    "It’s our judgment, based on ample historical evidence, that when inflation begins to accelerate within a very short period of time, economic expansion runs into trouble and the unemployment rate rises.",
    "“None of it is apparent from his Senate campaign website, which says people are asking him to run to represent ‘America First’ values, a nod to former President Donald Trump’s battle cry.”\nU.K.",
    "The argument has been a relatively standard one for Fed officials over the years, said David Wessel, director of the Brookings Institution’s Hutchins Center on Fiscal and Monetary Policy.",
    "‘I have serious concerns that, if nominated, she would abuse the Fed’s narrow statutory mandates on monetary policy to have the central bank actively engaged in capital allocation.",
    "It tracks closely with what then-Fed Chair Janet Yellen said as the central bank was embarking on slow and steady rate increases for the first time since the financial crisis.",
    "For months last year, Powell had argued that the Fed could be patient as it waited for price pressures to ease and more workers to return to the labor force.",
    "Send us your best tips, ideas or word games at kdavidson@politico.com and aweaver@politico.com, or DM us on Twitter @katedavidson or @aubreeeweaver.",
    "The number of the day is 97 (percent): That’s how much BofA estimates the changes would slash its overdraft fee revenue from 2009 levels.",
    "Liz Ann Sonders, chief investment strategist at Charles Schwab & Co., says Google searches of the word “hyperinflation” have collapsed.",
    "“In a way this is a return to a more conventional approach, dictated by the circumstances,” Wessel said of Powell’s argument.",
    "But Trump Media & Technology Group's path to the stock market faces a formidable obstacle: President Joe Biden's regulators.",
    "The POLITICO Pro platform combines the news you need with tools you can use to take action on the day’s biggest stories.",
    "She most recently was branch chief for the division of investment management - private funds branch at the SEC.",
    "His comments Tuesday underscore how dramatically officials have shifted their views over the past two months.",
    "The KBW Nasdaq Bank Index rose 10 percent last week, the largest percentage gain since November 2020.",
    "Senate Democrats raised concerns about what tighter monetary policy would mean for hiring and wages.",
    "and Rep. Carolyn Maloney (D-N.Y.) and CFPB Director Rohit Chopra, to eliminate overdraft charges.",
    "A former hedge fund CEO, he’s overseen more than $1 billion in investments in China.",
    "Capital One and Ally Bank previously said they would stop charging the fees.",
    "(But searches for “wordle” have taken off in the New Year!)",
    "But they didn’t bet on the pandemic.",
    "Powell's path to maximum employment?",
    "Act on the news with POLITICO Pro.",
    "What should we be searching for?",
    "Sound familiar?"
  ]
}