{
  "id": 4891,
  "mediaId": 8481,
  "date": "2022-04-24",
  "headline": "Pennsylvania GOP Senate Debate turns ugly as candidates throw jabs",
  "image": "https://www.wearecentralpa.com/wp-content/uploads/sites/69/2022/04/candidates-during-debate-1-1-e1650936987832.png?w=1280",
  "link": "https://www.wearecentralpa.com/2022-united-states-senate-election-in-pennsylvania/pennsylvania-senate-race-debate-republican-candidates-face-off/",
  "mediaOutlet": "wearecentralpa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lauren Rude",
  "authorUrl": "https://www.abc27.com/?post_type=profile&p=846928",
  "termIds": [
    0
  ],
  "sentences": [
    "What’s true is, he has flip-flopped on every issue we are talking about in this campaign.”\n8:21 p.m.: Prior to answering the question asked, Bartos said, “Well for your viewers who took my advice and played the drinking game about them talking about each other they’re already drunk.”\n8:24 p.m.: Candidates answer the question: “Define ‘America First.",
    "Now, under President Biden, she says that we are seeing the biggest influx of illegal immigration, or what she called an “invasion.” She says that “they are estimating” that 20% of America’s population will be illegal immigrants by the end of the Biden administration.",
    "You know I don’t make many promises on the campaign trail, but I can promise the people of Pennsylvania that when these carpetbaggers lose, you will never see them again.”\n8:07 p.m.: Oz and McCormick address the attack advertisements that have called Oz a R.I.N.O.",
    "8:19 p.m.: Responding to how Oz answered the question, “How would you bring jobs back to America?” McCormick said, “Listen the reason Mehmet keeps talking about President Trump’s endorsement, is because he can’t run on his own position and on his own records.",
    "8:41 p.m.: Bartos targets McCormick for “hunkering down in Aspen, Colorado” during the two years of the COVID-19 pandemic and says Oz was “living in New Jersey” while Bartos had his “sleeves rolled up” raising money across the 67 counties.",
    "Kathy Barnette, Jeff Bartos, Dave McCormick, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "The U.S. Senate Debate was carried on the following stations and websites:\nIn addition, the U.S. Senate Debate was streamed on the following websites:\nYou can also catch up on all that went down on Twitter by searching #PASen.",
    "In the poll of 1,000 likely Republican Pennsylvania voters, the former hedge fund CEO McCormick finished first with 17.8%, followed by the former television personality and Donald Trump-endorsed candidate Oz with 16.6%.",
    "Barnette said, “Actually in the last poll, in the Tragalgar Poll, I am at a three-way statistical tie for first place and that is a direct result of the people here in Pennsylvania because they want one of their own.",
    "8:49 p.m.: When answering the question “Are we managing a migration issue with a public health order,” Sands said former President Trump created the most secure border she has ever seen.",
    "(WHTM) – For the first time on a debate stage, the five leading Republican candidates for one of Pennsylvania’s U.S. Senate seats faced off on Monday night.",
    "WHTM abc27 News anchor and Capitol Bureau Reporter Dennis Owens and WPXI Anchor Lisa Sylvester co-hosed the debate from the abc27 studio in Harrisburg.",
    "8:51 p.m.: The candidates answer the question: “Would you prevent trans women from competing in women’s sports?” McCormick targets Oz in his response.",
    "Plus, catch up on key moments from the debate in the live updates, below:\n8:03 p.m.: Barnette is asked how she can improve her poll numbers.",
    "8:35 p.m.: Host Lisa Sylvester reminds Barnette and Sands of the rules of the debate after consistent back and forth talking over the other.",
    "Candidates needed to receive at least 5% in either the March or April Nexstar/Emerson College Polling/The Hill polls were invited to attend.",
    "It was the first time McCormick and Oz, who lead in an April Nexstar/Emerson College Polling/The Hill poll, appeared in a debate together.",
    "8:08 p.m.: The candidates answer: “Should there be exceptions for rape, incest, or the life of a mother?” when it comes to abortion laws.",
    "Kathy Barnette finished third in the April poll with 10.2%, followed by Jeff Bartos at 8.9% and Carla Sands at 7.7%.",
    "8:11 p.m.: Bartos says the other candidates have made the race about themselves, rather than about the voters.",
    "The Democratic Party candidates for Senate held a debate on April 21 that can be rewatched online.",
    "McCormick has been endorsed by Mike Pompeo, Ted Cruz, and other prominent Conservatives.",
    "A debate between the Republican candidates for Governor will air on April 27.",
    "and highlighted the claims that McCormick has made billions for China.",
    "She has come in third place in recent polls behind Oz and McCormick.",
    "Full Debate:\nTo watch the debate, click on the video player above.",
    "'” Sands targets Barnette in her response and Barnette responds.",
    "Senator from Pennsylvania is scheduled to take place on May 17.",
    "After, vote on who you think won in the link below.",
    "More than 32% of voters were undecided.",
    "Voters must register to vote by May 2.",
    "The primary election for U.S."
  ]
}