{
  "id": 5144,
  "mediaId": 8393,
  "date": "2022-04-20",
  "headline": "U.S. Senate candidate Dave McCormick tours Central PA",
  "image": "https://www.pahomepage.com/wp-content/uploads/sites/91/2022/04/McCormick-campaign-1.jpg?w=1280",
  "link": "https://www.pahomepage.com/news/local-news/u-s-senate-candidate-dave-mccormick-tours-central-pa/",
  "mediaOutlet": "pahomepage.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Mehalshick",
  "authorUrl": "https://www.pahomepage.com/author/andy-mehalshick/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Listen, I think small businesses whether it’s farming businesses, 50,000 farms in Pennsylvania so crucial to Pennsylvania economy, or small businesses like the creamery or small manufacturers.",
    "EYEWITNESS NEWS (WBRE/WYOU) — The race for a U.S. Senate seat in Pennsylvania is intensifying as candidates crisscross the commonwealth seeking voter support.",
    "Eyewitness News asked him about the recent endorsement the former president gave to Mehmet Oz as the two are neck-and-neck at the top of recent polls.",
    "And it appears, based on the large turnout for this rally that this race will only intensify as we get closer to the May 17 Primary Election.",
    "“I’m not 100 percent sure I agree with the direction of the country and I do think Dave from what I know has a good message,” said Spicer.",
    "You look around my family farm which is between Bloomsburg and Danville, there’s more Trump signs today than there was in 2020.",
    "Wednesday, Republican Dave McCormick, one of seven candidates seeking the GOP nomination campaigned in central Pennsylvania.",
    "“Well it’s always important that we get the most conservative most capable effective leader and Dave is definitely that.",
    "Many political observers say a Trump endorsement could be the deciding factor in who will win the GOP nomination.",
    "McCormick says he supports the policies put forth by former President Trump, and says he is a true conservative.",
    "His policies are not in line with America’s first agenda,” Dave McCormick (R) U.S. Senate candidate explained.",
    "He talked with residents about his priorities which include supporting the Pennsylvania Agriculture Industry.",
    "McCormick told Eyewitness News what he thought of Dr. Oz getting an endorsement from former President Trump.",
    "A big part of McCormick’s campaign focuses on bringing back high-paying manufacturing jobs to Pennsylvania.",
    "They are the heart of job creation and they are really feeling the pressure,” said McCormick.",
    "He had a set of policies on America’s first agenda that helped the country and Pennsylvania.",
    "I’ve known Dave for decades he will be great for Pennsylvania, great for America.",
    "The campaign day ended with a rally at the Frosty Valley Resort near Danville.",
    "For more information visit the Pennsylvania Department of States website.",
    "Dave McCormick’s first stop was the Country Creamery near Selinsgrove.",
    "An industry hit hard by the COVID-19 pandemic and the war in Ukraine.",
    "He’s truly battle-tested, he’s authentic, he’s real,” said Pompeo.",
    "Former U.S. Secretary of State Mike Pompeo endorsed McCormick.",
    "“Yeah, listen, Donald Trump is very popular in Pennsylvania.",
    "So Mehmet Oz does not connect to the people of Pennsylvania.",
    "Strong manufactures hot tubs and employs about 700 people.",
    "Four candidates are vying for the Democratic nomination.",
    "McCormick toured Strong Industries in Northumberland.",
    "But no doubt the popular his endorsement matters.",
    "So he’s very popular and for good reason.",
    "The problem is Mehmet Oz isn’t popular.",
    "Wade Spicer owns Strong Industries."
  ]
}