{
  "id": 5435,
  "mediaId": 2618,
  "date": "2022-04-13",
  "headline": "Trump Had Every Reason to Endorse Dr. Oz",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/13/trump_had_every_reason_to_endorse_dr_oz_83150.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ned Ryun",
  "authorUrl": "",
  "termIds": [
    2383,
    2765,
    4539,
    4794,
    2802,
    2996,
    5583,
    6506,
    6178
  ],
  "sentences": [
    "why haven't some of these people realized that it is futile to second guess our duly elected President, Donald J. Trump because ... he is right, has always been right and will continue to be right on anything and everything he ever says and / or does - wake up you foolish people and recognize we are privileged to live at a time when such a human being is amongst us - he will lead us to greatness for everybody even those who denied him and made foolish remarks and statements about him\nFTA: \"But everyone needs to take a deep breath and understand that Oz is 10 times better than former hedgefund CEO Dave McCormick.",
    "I mean, I get it on some levels: Oz isn’t great on the issues, isn’t a conservative rockstar (as if Pennsylvania produces any), and is an unknown commodity in electoral politics (see Trump, Donald J., circa 2015).",
    "I live in Texas so this race is of only peripheral interest to me but if what the article says about Dave McCormick is true then Dr. Oz could be a better choice, but that is up to the voters of Pennsylvania.",
    "https://www.uscitizenship.info/articles/does-america-allow-people-to-have-dual-citizenship/ How ironic that he is being judged as Donald Trump was - never mind that he is a highly educated specialist.",
    "And covering one's eyes and ears and going \"naa-naa-naa\" because the choices available (the possible) are not as good as we'd like - isn't useful, and is actually harmful, helps the other side win.",
    "He taught me that ------ \"Politics is the art of the possible\" This is critical and huge numbers of people don't get that wanting the impossible doesn't help move things in the right direction.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Oz will win the primary, probably win the general given the dynamics of the coming 2022 midterms, and if you keep your expectations low, I bet he’ll even pleasantly surprise you.",
    "There are no credible MAGA candidates in the Pennsylvania Senate race; this isn’t a potential Jim DeMint versus Oz situation, so Trump really has two choices: Oz or McCormick.\"",
    "I hope whichever one loses this year comes back in 2024 and defeats Little Bobby Casey, Pennsylvania's baby killing Catholic senator, who is the exemplar of a back bencher.",
    "At least one who did stopped short of his entire statement on how Oz might perform in the Senate: Is Oz going to be the next Ted Cruz or Josh Hawley or Jim DeMint?",
    "As for Oz’s dual citizenship, he was born in Cleveland, Ohio, to Turkish nationals A doctor at Case Western Reserve and the daughter of a wealthy Istanbul family.",
    "A tiny step in the right direction, that you can ACTUALLY ACCOMPLISH, is better than that \"wonderful thing or person\" that cannot happen, is impossible.",
    "https://theleansubmariner.com/2022/03/24/doug-mastriano-for-governor-for-information-only/\nFTA: \"Is (Oz) going to vote 90 percent with Republicans?",
    "Even a small \"wrong direction\" step must be understood to be preferrable to a LARGE wrong direction step, if those are the only choices available.",
    "I'm of the no longer holding my nose to support someone less than a proven conservative or otherwise proven supportive of conservative values.",
    "On dual citizenship for Oz, I accept his reason - his mother lives in Turkey, and it simplifies the visa procedure so he can vi9sit her.",
    "Often we must choose the best available, and next time, get involved earlier when the chance to have better choices is still available.",
    "The reaction by some to Donald Trump’s endorsement of Dr. Mehmet Oz in the U.S. Senate race in Pennsylvania seems a bit over the top.",
    "Gov., won the election, lives in a restored gas station in Braddock, Pa with his illegal half black Brazilian wife, and children.",
    "Much of this \"hand wringing\" comes from folks who do not vote in primaries - and are a huge part of the problem because of that.",
    "But everyone needs to take a deep breath and understand that Oz is 10 times better than former hedgefund CEO Dave McCormick.",
    "He is a self described socialist dimocrat,and is touring the rural parts of Pennsylvania, and is good at retail politics.",
    "That makes it almost impossible for a true MAGA candidate to be heard in the Pennsylvania campaign for Senator this year.",
    "I had this explained to me by a guy who was the country Republican chair, and very conservative, still a close friend.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Neither Oz nor McCormick is the ideal candidate, but searching for the perfect candidate can be counter-productive.",
    "When you get a handful of lemons like we have with the Republican primary in Pennsylvania, you make lemonade.",
    "#4...Well that was quite the smear of President Trump and those of us that support him even through missteps.",
    "On McCormick's financial dealings with China, even President T^rump's daughter had products made in China.",
    "Senate Republicans already have a half dozen wobbly votes, starting with Mitt, Murkowski, Collins, etc.",
    "He's been leading Republican's efforts to uncover the facts regarding Pennsylvania's 2020 voter fraud.",
    "His physical presence is sort of awesome - 6'8\" former college football player, and he uses it well.",
    "President Trump didn't know his presidency was being stolen, so he's not perfect in his judgment.",
    "We can argue all day about McCormick and Oz, but Fetterman may campaign his way into office.",
    "He's a strong supporter of Donald Trump, including refutations of the 2020 election results.",
    "We do not put him on a pedestal or wallow in cult idolization as your snotty slur suggest .",
    "Is he going to be an ally of Trump’s in the Senate if and when Trump runs and wins in 2024?",
    "Apparently they missed the article that went with the headline announcing his endorsement.",
    "But the only thing that will do is cheer on the Left and possibly taint Trump's campaign.",
    "Interesting to see that some commenters haven grasped the fundamental truth of politics.",
    "FPDT didn't learn his lesson in Utah, where he heartily endorsed Mitt for election.",
    "They stalled before that part about his being an ally of Trump’s in the Senate.",
    "..\" BUT there is one such candidate for Governor: His name is Doug Mastriano.",
    "He's a Pennsylvania state senator representing the Gettysburg area district.",
    "His proven strength and can do American ideals are what drives our support.",
    "\"There are no credible MAGA candidates in the Pennsylvania Senate race; .",
    "He stands a good chance of winning Pa, in spite of an expected red wave.",
    "My biggest worry for Pennsylvania is the dimocrat candidate, Fetterman.",
    "One \"moderate\" is no better than any other \"moderate\" in an election.",
    "2nd post apologies, but, #15, McCormick is self funding his campaign.",
    "Your donation helps keep our discussions going and our voices heard.",
    "I’ll bet real bucks that some did not even read Ryun’s article.",
    "I see one poster questioning why President Trump endorsed Oz.",
    "That is the kind of selective reporting that our media use.",
    "You can probably find it via Search right here at Lucianne.",
    "He is an excellent campaigner, retail politics to the max.",
    "Here is what America has to say about dual citizenship.",
    "Trump gave a lengthy explanation for his endorsement.",
    "(Where I disagreed with President Trump, I was wrong.",
    "Either of these is a better choice than any Democrat.",
    "But is he better than the ONLY POSSIBLE alternative?",
    "It's that selective 10 percent that is the issue.",
    "But I do trust Trump because he's proven himself.",
    "I have no feelings for him one way or the other.",
    "Is he going to vote 90 percent with Republicans?",
    "At least read PDJT’s full endorement statement.",
    "And Trump is making sweet lemonade out of them.",
    "Why pick any poison if the outcome is the same?",
    "He's retired from the U.S. Army as a Colonel.",
    "If you’re Trump, you have political capital.",
    "And in Trump’s mind, maybe 50 times better.",
    "And in Trump’s mind, maybe 50 times better.",
    "And we conservatives do that way too much.",
    "Very interesting and convincing article.",
    "And each is spending a bundle of money.",
    "His TV career is all anyone considers.",
    "Oz would never be my first choice.",
    "Fetterman primaried a sitting Lt.",
    "None of us knows why he chose Oz.",
    "I thought he should avoid it.)",
    "I do know he has his reasons.",
    "I think #2 stated where I am.",
    "Shocking to see it used here.",
    "Rant and whine all you want.",
    "Surely not \"every\" reason.",
    "Worth finding and reading.",
    "I trust DJT on this one.",
    "Best example - twitter.",
    "And each is wealthy.",
    "Almost certainly.\"",
    "Almost certainly.",
    "Trump thinks so.",
    "I don't know Oz.",
    "Of course not.",
    "Thank you.",
    "So is Oz.",
    "You bet.",
    "Done!",
    "...",
    "."
  ]
}