{
  "id": 5925,
  "mediaId": 2680,
  "date": "2022-04-18",
  "headline": "Pa. Senate candidate McCormick earned $22M as hedge fund CEO",
  "image": "https://s.hdnux.com/photos/01/25/20/06/22348178/3/rawImage.jpg",
  "link": "https://www.sfgate.com/news/article/Pa-Senate-candidate-McCormick-earned-22M-as-17088915.php",
  "mediaOutlet": "sfchronicle",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MICHAEL RUBINKAM",
  "authorUrl": "",
  "termIds": [
    2802,
    1489,
    6520,
    6506
  ],
  "sentences": [
    "Dave McCormick earned more than $22 million last year as CEO of the world's largest hedge fund, a job he quit to run for U.S. Senate in Pennsylvania, according to a financial disclosure form that offered the public its first detailed look at the candidate's finances.",
    "Virtually unknown to Pennsylvania voters before launching his campaign, McCormick has since blanketed the airwaves with millions of dollars in TV ads that portray him as a jeans-wearing, Pennsylvania-born everyman who found success.",
    "McCormick listed more than 160 assets with value, including stocks, mutual funds, corporate and government bonds and real estate, on a disclosure that he filed after business hours on Friday of the Easter holiday weekend.",
    "McCormick is part of a trio of ultrarich candidates, including celebrity surgeon Mehmet Oz, to come from out of state to run for the Republican nomination for Pennsylvania’s open Senate seat.",
    "McCormick and his wife estimated the value of their assets between $116 million and $289 million, including a valuable stake in Bridgewater Associates, the company he ran until early January.",
    "Another wealthy candidate from out of state, Carla Sands, filed a public disclosure of assets last year, valuing more than 50 accounts or properties at between $35 million and $152 million.",
    "Together, those properties generated rental income of $200,000 to $2 million, according to the disclosure, which requires candidates to provide a range and not an exact value.",
    "McCormick has also continued to hitch himself to Donald Trump even after the former president recently endorsed Oz, who quit his eponymous TV show to run for Senate.",
    "Liabilities include two 30-year mortgages, each listed between $5 million and $25 million, as well as a line of credit pegged at $5 million to $25 million.",
    "The primary is May 17, and the November general election to replace retiring GOP Sen. Pat Toomey could help determine party control of the chamber.",
    "In addition to taking home $22.5 million in salary from Bridgewater, McCormick also reported owning company stock valued at more than $50 million.",
    "McCormick has touted his Pennsylvania roots, calling himself “Pennsylvanian true” as he describes growing up on his family’s Christmas tree farm.",
    "The businessman has contributed almost $7 million to his campaign through March 31, according to his most recent campaign finance report.",
    "He also got $2.2 million from the sale of options in Bechtel, an engineering and construction firm on whose board he sits.",
    "Like Oz, regarded as his chief rival for the nomination, McCormick is using his personal wealth to fund his campaign.",
    "McCormick owns dozens of corporate bonds, from Delta Airlines to General Electric to UPS, the disclosure said.",
    "He moved to Pennsylvania from Connecticut, where he had lived for years while working for Bridgewater.",
    "He also listed $4.75 million to $18 million in capital commitments to various investment funds.",
    "McCormick also has a ranch in Colorado and his family's farm outside Bloomsburg, Pennsylvania.",
    "He listed a principal residence in Pittsburgh, pegging its value at $1 million to $5 million.",
    "He owns homes in Dallas and New York City worth a combined $10 million to $50 million.",
    "Earlier this month, Oz reported assets of between $104 million and $422 million.",
    "He has said he put $10 million into his campaign in Pennsylvania.",
    "If elected, he’d be among the wealthiest U.S. senators."
  ]
}