{
  "id": 6026,
  "mediaId": 2934,
  "date": "2022-04-15",
  "headline": "McCormick’s Denouncement of ‘Structural Bigotry’ Not an Endorsement of BLM",
  "image": "https://cdn.factcheck.org/UploadedFiles/McCormick-headshot.png",
  "link": "https://www.factcheck.org/2022/04/mccormicks-denouncement-of-structural-bigotry-not-an-endorsement-of-blm/",
  "mediaOutlet": "FactCheck",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Farley",
  "authorUrl": "https://www.factcheck.org/author/robert-farley/",
  "termIds": [
    5675,
    5429,
    2765,
    392,
    190,
    164,
    1126,
    6506,
    6080
  ],
  "sentences": [
    "Amid nationwide protests after George Floyd’s murder in 2020, Dave McCormick, then CEO of a hedge fund, emailed his colleagues, calling on them to “be agents of change” and to show “solidarity by denouncing and eradicating structural bigotry around us.”\nA new ad from a super PAC supporting McCormick’s chief rival in the Republican primary for U.S. Senate in Pennsylvania cites that email as evidence that “McCormick’s woke Connecticut hedge fund supported Black Lives Matter.” But the letter did not mention Black Lives Matter, and it expressed concern not only about racial discrimination and bigotry, but also about “rioting and destruction on city streets across the country.”\nMcCormick campaign spokesperson Jess Szymanski told us that “like President Trump and others,” McCormick was merely “a leader who provided reflections following the death of George Floyd,” and that “Dave never supported BLM and has always stood with law enforcement as a strong law and order candidate.”\nThere’s little mystery why McCormick’s opponents would want to tie him to the Black Lives Matter movement.",
    "To back up its claim that “McCormick’s woke Connecticut hedge fund supported Black Lives Matter,” the ad cites a June 2020 article in Institutional Investor, which states: “Bridgewater Associates, the world’s largest hedge fund, has distinguished itself by being the only hedge fund among the top ten to post a statement on its website, with the headline ‘A Heartbreaking Time for our Country,’ which was illustrated with the black box associated with the #BlackoutTuesday support for Black Lives Matter protests.”\nAs we said, at the time, protests were springing up all around the country after the death of George Floyd, a Black man who died after a white police officer kneeled on his neck during an arrest in Minneapolis on May 25, 2020.",
    "A news release on the company’s website says, “We have also overhauled our benefits to better support women and underrepresented groups; as a result, we now offer fully paid parental leave; egg freezing, IVF, and adoption coverage; state-of-the-art mothers’ rooms and breastfeeding support; and fully paid coverage for gender transitions.”\nSzymanski, the McCormick campaign spokesperson, told us via email that the coverage was part of “a standard benefits package provided to adult employees” (emphasis hers) and that McCormick “is opposed to taxpayer funded transgender procedures and will always defend the rights of parents to protect their children.”\nEditor’s note: FactCheck.org does not accept advertising.",
    "The New York Times explained the emergence of black boxes on social media in a June 2, 2020, story: “What began as an attempt by two music insiders to pause business as usual across the industry on Tuesday, in response to the protests sweeping the nation, broadened and morphed overnight on social media into a less focused action, resulting in a sea of black boxes across Instagram and other platforms.”\nFor some, the article states, the blank black posts were meant to show solidarity with Black Lives Matter, but others were simply “wishing to show support for broader causes of racial injustice.”\nNotably, McCormick made no specific mention of Black Lives Matter in his email.",
    "Ironically, a super PAC supporting McCormick, Honor Pennsylvania, ran an ad in March that accused Oz of being “liberal” and “woke” because he “posted about Black Lives Matter on social media.” In a story we wrote about that ad and others attacking Oz, we noted that Oz posted a message about “systemic racism” in the medical field that creates “disparities in the health outcomes of black people.” The post linked to a video about health that briefly mentions and shows protests over the killing of Floyd.",
    "And while we stand in solidarity against any forms of racism, hate, and bigotry, I also recognize that I and others cannot and should not pretend to fully understand the challenges and barriers, both historical and present day, that many of our colleagues face from different races, backgrounds, genders, and experiences.",
    "Here is the entirety of McCormick’s message:\nMcCormick, May 31, 2020: Bridgewater,\nI have had discussions with many of you about the horrible incidents of racial bigotry that we’ve seen in America in recent days followed by outcries for justice, and rioting and destruction on city streets across the country.",
    "But Oz has since said he does “not support the actions being taken by the Black Lives Matter organization and its leadership” and that “BLM has the wrong approach at every level.”\nAmerican Leadership Action also claims that McCormick’s company “covered transgender surgeries.” That’s true.",
    "As Dr. Martin Luther King, Jr. once said, “There is an almost universal quest for easy answers and half-baked solutions.” There are no easy solutions to the challenges we face today, but a willingness and commitment to do the hard work openly and honestly is the critical first step.",
    "In contrast, most Republicans and those who lean to the GOP (78%) say they oppose the Black Lives Matter movement, with 58% saying they strongly oppose it.”\nThe ad is from American Leadership Action, a super PAC supporting Dr. Mehmet Oz in the Republican Senate primary.",
    "Polling from the Pew Research Center released on Sept. 27 highlights the deep partisan divide, with 85% of Democrats and Democratic-leaning independents expressing “at least some support, including 48% who strongly support the movement.",
    "I’m hopeful that justice will prevail in Minneapolis and elsewhere, but let’s not focus our anger or our sense of justice only on one particular incident or on our deep and painful mourning for one individual.",
    "The ad, which was captured by Kantar Media and seen here below, argues that McCormick is “too woke for Pennsylvania.” And it cites McCormick’s email to Bridgewater Associates employees as a prime example.",
    "It’s also aligned with our belief that diversity isn’t just a nice thing to aspire to, it’s an essential condition of our quest for excellence and our idea of true meritocracy.",
    "This problem is very big, and this is a moment for us to ask ourselves some very hard and uncomfortable questions about the kind of country we want to be.",
    "My hope is that our hurt and outrage will move us, individually and collectively, to be agents of change within Bridgewater and in our broader community.",
    "In addition to the protests, lots of large companies — Walmart, Disney, Nike — expressed concern about Floyd’s death and racial injustice.",
    "These events remind us of what is deeply troubling in our country, and I know we all seek to find ways to help heal this very deep wound.",
    "The Black Lives Matter movement has become a polarizing political topic — popular among Democrats and wildly unpopular among Republicans.",
    "Benefiting from a system that quietly discriminates – without acknowledging it and helping to repair it – only propagates that system.",
    "With empathy and genuine conviction, we can and must show this solidarity by denouncing and eradicating structural bigotry around us.",
    "If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.",
    "Racism and discrimination more broadly thrive not just in overt actions, but also in omissions and willful ignorance.",
    "On May 31, 2020, Bridgewater posted to its public website an email that McCormick shared with his colleagues.",
    "McCormick routinely mocks Oz as a “woke” liberal, but this ad uses McCormick’s “woke” rhetoric against him.",
    "We clearly have much work to do as a nation, and so this is an opportunity to renew our resolve to do so.",
    "Meanwhile, I hope that by supporting each other, we can find a way through this difficult time.",
    "Under the headline, “A Heartbreaking Time for Our Country,” was a black box.",
    "We rely on grants and individual donations from people like you.",
    "Credit card donations may be made through our “Donate” page.",
    "Doing so is in keeping with Bridgewater’s values.",
    "Please consider a donation.",
    "Together."
  ]
}