{
  "id": 6065,
  "mediaId": 2873,
  "date": "2022-04-10",
  "headline": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz",
  "image": "https://michaelsavage.com/wp-content/uploads/2022/04/dr-oz.png",
  "link": "https://michaelsavage.com/trumpworld-goes-into-meltdown-after-trump-endorses-dr-oz/",
  "mediaOutlet": "Michael Savage",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5732,
    4958,
    1724,
    1696,
    2765,
    2802,
    2189,
    1489,
    1126,
    6456
  ],
  "sentences": [
    "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate Dave McCormick, who has ex-Trump administration officials Hope Hicks and Stephen Miller by his side.",
    "Elsewhere, Rep. Mo Brooks (R-AL), who is running for the Senate and who has split with Trump in recent over back-and-forth accusations of election interference, chalked up the Oz endorsement to weak-kneaded staffers the ex-president has enlisted.",
    "Oz is the antithesis of everything that made Trump the best president of my lifetime.” The infighting only intensified as more conservative commentators and politicos lined up to take shots at Trump’s endorsement.",
    "I was honored to have his endorsement in PA. Twice,” Sean Parnell, the former Trump-backed candidate, who dropped out of the race after an abuse allegation surfaced from his estranged ex-wife, wrote on Twitter.",
    "Daily Beast\nLate Saturday evening, former President Donald Trump officially endorsed his old TV pal Dr. Mehmet Oz in the ruckus Republican U.S. Senate primary race in Pennsylvania.",
    "“It’s like Donald Trump’s staff is sabotaging Trump by convincing him to make the worst possible endorsements,” conservative radio host Erick Erickson tweeted.",
    "“This endorsement could divide MAGA in the only way that matters: he could lose America First conservatives over it,” Breitbart News’ Joel Pollak wrote.",
    "In doing so, Trump, while speaking at a rally in North Carolina, ignited fury and ridicule among some of the loudest voices in Trumpworld.",
    "“I have enormous respect for President Trump.",
    "“But I’m disappointed by this.",
    "Related"
  ]
}