{
  "id": 6274,
  "mediaId": 8504,
  "date": "2022-04-12",
  "headline": "WJET to air Pennsylvania Republican Primary Senate Debate",
  "image": "https://www.yourerie.com/wp-content/uploads/sites/27/2022/04/debatecandidates.jpg?w=1280",
  "link": "https://www.yourerie.com/2022-united-states-senate-election-in-pennsylvania/abc27-to-host-pennsylvania-republican-primary-senate-debate/",
  "mediaOutlet": "yourerie.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/?post_type=profile&p=1032698",
  "termIds": [
    0
  ],
  "sentences": [
    "The one hour debate will air on eight television stations serving the state: WHTM-TV (ABC) in Harrisburg/Lancaster, Lebanon, York, WPXI-TV (NBC) in Pittsburgh, WPHL-TV (MyNetworkTV) in Philadelphia, WTAJ-TV (CBS) in Johnstown/Altoona/State College, WBRE-TV (NBC) and WYOU-TV (CBS) in Scranton/Wilkes-Barre/Hazleton, WJET-TV (ABC) and WFXP-TV (FOX) in Erie, and WYTV-TV (ABC) in Youngstown, OH.",
    "Nexstar Media Inc. will also host an exclusive debate between the Democratic Party candidates for the United States Senate Thursday, April 21 at 8 p.m.\nAn exclusive debate has also been announced between the Republican Party candidates for Governor of Pennsylvania on Wednesday, April 27 at 8 p.m.",
    "In addition, the debate will be live-streamed on WETM-TV (NBC) in Elmira, NY, WPIX-TV (CW) in New York, NY, WIVB-TV (CBS) in Buffalo, NY, and WDVM-TV (IND) in Washington, D.C\nAdditionally, all radio stations throughout the commonwealth will be provided free access regardless of their market.",
    "The candidates will debate for one hour on Monday, April 25 at 8 p.m. and will both air and live-stream in 10 markets across Pennsylvania, New York, Ohio, and Maryland, reaching 9.8 million TV and streaming households in every county of the Keystone State.",
    "HARRISBURG, Pa. (WHTM) – Less than one month from the May 17 Pennsylvania primary election, Nexstar Media Inc. will host an exclusive multi-market prime time debate between the Republican Party candidates for United States Senate from Pennsylvania.",
    "For more information regarding the upcoming elections, including early voting dates, polling locations and voter identification requirements, please visit https://www.pavoterservices.pa.gov.",
    "Candidates who have committed to attend include Kathy Barnette, Jeff Bartos, Dave McCormick, Mehmet Oz, and Carla Sands.",
    "All candidates on the ballot who meet eligibility criteria will be invited to participate.",
    "To register to vote, please visit https://www.vote.pa.gov/Register-to-Vote.",
    "Senator from Pennsylvania is scheduled to take place on May 17.",
    "Voters must register to vote by May 2.",
    "The primary election for U.S."
  ]
}