{
  "id": 6322,
  "mediaId": 8481,
  "date": "2022-04-12",
  "headline": "McCormick makes stop at Somerset County business",
  "image": "https://www.wearecentralpa.com/wp-content/uploads/sites/69/2022/04/McCormick-.jpg?w=1280",
  "link": "https://www.wearecentralpa.com/2022-united-states-senate-election-in-pennsylvania/mccormick-makes-stop-at-somerset-county-business/",
  "mediaOutlet": "wearecentralpa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Courtney Murphy",
  "authorUrl": "https://www.wearecentralpa.com/author/courtney-murphy/",
  "termIds": [
    0
  ],
  "sentences": [
    "The fact that he’s really a Hollywood liberal and not a conservative is the reason he hasn’t taken off in the polls.”\nMcCormick currently leads in the recent WTAJ/Emerson College/The Hill polls for likely Republican voters at 17.8%.",
    "Fighting against the weak policies or world policies we’ve seen over the last year.”\nThis visit comes a day after Former President Donald Trump endorsed McCormick’s main competitor, Dr. Mehmet Oz.",
    "SOMERSET COUNTY, Pa (WTAJ)– Republican U.S. Senate Candidate Dave McCormick is making his final steps in his campaign, including one in Somerset Tuesday.",
    "When he spoke to the owner, McCormick said the shortage had to do with the lack of those specializing in welding and machinery trades.",
    "However, McCormick is being supported by multiple different former Trump staffers, including former Secretary of State Mike Pompeo.",
    "His campaign stopped at Leiss Tool and Die in Somerset, where he met with some workers and took a facility tour.",
    "His American first agenda is really great for our country and great for Pennsylvania,” McCormick said.",
    "“My experiences and commitment to Pennsylvania makes me unique in terms of contributing on day one.",
    "He proceeded to say that this requires better policies that can be initiated on day one of office.",
    "This 50-year-shops specializes in dies, molds, fixtures, and builders of special machines.",
    "They face the ongoing problems of staffing shortages and inflation on their materials.",
    "McCormick got to hear firsthand the struggles that this business is experiencing.",
    "“So, it’s an important endorsement, but Mehmet Oz isn’t popular in Pennsylvania.",
    "“We need to elect a Senator that can go in on day one and be effective.",
    "He also leads on undecided voters with 27.2% favoring him.",
    "There’s no time for on-the-job training,” McCormick said.",
    "“President Trump is very popular in Pennsylvania.",
    "Be a leader in the Senate on day one."
  ]
}