{
  "id": 647,
  "mediaId": 8254,
  "date": "2022-02-20",
  "headline": "Pennsylvania Senate candidate Dave McCormick visits State College",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/0129b0ff5c2148ddaa96b1dc46f36705-1.jpg?w=1280",
  "link": "https://www.abc27.com/election/pennsylvania-senate-candidate-dave-mccormick-visits-state-college/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Risky",
  "authorUrl": "https://www.wearecentralpa.com/?post_type=profile&p=948361",
  "termIds": [
    0
  ],
  "sentences": [
    "“And so that’s a huge advantage because I know what business leaders deal with and on top of that I’ve served in the highest levels of government in key economic jobs so I know how the macroeconomy works.”\nBeing a business owner and working with other countries has allowed McCormick to learn about the global economy and he thinks the natural gas reserves in Pennsylvania are something they can take advantage of.",
    "I’ve created jobs in Pennsylvania and this is an opportunity to give back to the great state of Pennsylvania and make sure our kids, my kids, and your kids can live the American Dream.”\nAfter chatting with many voters, McCormick said the biggest issue to address in Pennsylvania is the rise of gas prices, the open border, and an increase in crime.",
    "“So we have untold potential to unleash that in our economy and in the American economy and that’s great for America, it’s great for Pennsylvania, and it’s great for the world because we won’t be dependent on foreign oil and it’s great for our natural security.”\nGet daily news, weather, breaking news, and alerts straight to your inbox!",
    "“I think I’ll be unique in the Senate in the following sense: I’ve run two companies, I’ve created jobs, I’ve made payroll, I’ve started something from nothing and making it into a big company twice,” McCormick said.",
    "STATE COLLEGE, Pa. (WTAJ)– As the U.S. Senate race heats up, GOP candidate Dave McCormick made his way to State College to talk about his plans on helping Pennsylvania residents.",
    "He feels that his time in the service and experience as a businessman are two key factors for him being able to speak for the people of Pennsylvania.",
    "McCormick feels that his long background in politics is what will allow him to connect and give a voice to Pennsylvania residents.",
    "“If Pennsylvania were a country, we’d be the fourth largest country in the world for natural gas reserves,” McCormick said.",
    "He feels that his background is something that will bring in a different perspective.",
    "Battle-tested has been the slogan for Dave McCormick as he runs for senator.",
    "“I’m a seventh-generation Pennsylvanian,” McCormick said.",
    "Sign up for the abc27 newsletters here.",
    "“I grew up here, I’ve lived here."
  ]
}