{
  "id": 7626,
  "mediaId": 2629,
  "date": "2022-04-05",
  "headline": "Super-Rich GOP Senate Candidate Says Keep Minimum Wage At $7.25",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTYzOTQwNi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2Mjg5NTkwOH0.1v5gxVR6Y17-b2F9Anz4uyDwJQqJOIXbEhUO_guutfM/img.jpg?width=1200&coordinates=0%2C270%2C0%2C270&height=600",
  "link": "https://www.nationalmemo.com/minimum-wage",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Israel",
  "authorUrl": "https://www.nationalmemo.com/u/josh-israel",
  "termIds": [
    4905,
    2440,
    4081,
    1126,
    48,
    392,
    1489,
    1448
  ],
  "sentences": [
    "Between 2010 and 2013, he received at least $70 million in discretionary awards from his then-employer, the Bridgewater Associates investment management firm, according to information contained in his 2015 divorce records.",
    "In an interview on the podcast Politics PA podcast, first flagged this week by the progressive research group American Bridge 21st Century, McCormick was asked whether he supported having any federal minimum wage at all.",
    "While recent polling shows about two-thirds of Pennsylvania voters support a minimum wage increase, Republican lawmakers at the state and federal levels have blocked Democratic proposals for a more livable minimum wage.",
    "However, instead of supporting a minimum wage increase, he proposes to get rid of President Joe Biden's investments in infrastructure and families, cut taxes, and eliminate federal regulations on businesses.",
    "Pennsylvania Republican Senate candidate Dave McCormick opposes increasing the federal minimum wage and wants to keep it at its current level of $7.25 an hour, set in 2009, when it was raised from $6.55.",
    "McCormick said on Feb. 18, \"Inflation across our nation continues to rise — spiking costs for all Pennsylvanians, especially working families, at the store and at the pump.\"",
    "Had he been working at the minimum wage he does support in a 40-hour-per-week full-time job, it would have taken him more than 4,641 years to earn that much.",
    "With tens of millions of dollars earned running a hedge fund business, McCormick does not need a higher minimum wage to pay for his basic needs.",
    "A person working 40 hours a week at that rate would make about $15,080 a year, well below the $18,310 federal poverty line for a family of two.",
    "Tom Wolf has increased it for state employees and unsuccessfully prodded the GOP-controlled legislature to do the same for other workers.",
    "McCormick is one of several Republican candidates running in November's race to succeed retiring Pennsylvania Republican Sen. Pat Toomey.",
    "But for the more than 10 percent of Pennsylvanians who live below the poverty line, a higher minimum wage would make a huge difference.",
    "\"I wouldn't change the minimum wage we have now,\" the former George W. Bush administration Treasury Department official responded.",
    "All of Pennsylvania's neighboring states have opted to increase their minimum wages above the $7.25 level.",
    "Pennsylvania has not opted to raise its state minimum above the federal floor, though Democratic Gov.",
    "But according to a February report by Insider, McCormick is personally quite wealthy.",
    "A McCormick spokesperson did not respond immediately to an inquiry for this story.",
    "But the $7.25 minimum set in 2009 is only worth about $5.34 in 2022 dollars.",
    "In total, at least 25 states voluntarily raised their wage floor for 2022.",
    "\"But I wouldn't raise it.\"",
    "Minimum wage"
  ]
}