{
  "id": 936,
  "mediaId": 8254,
  "date": "2022-02-18",
  "headline": "Four GOP candidates for US Senate meet in Blair County",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/AC00A42B21174A93F03C3A290BA6C446.jpg?w=1280",
  "link": "https://www.abc27.com/news/this-week-in-pennsylvania/pennsylvania-politics/four-gop-candidates-for-us-senate-meet-in-blair-county/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Tracy",
  "authorUrl": "https://www.wearecentralpa.com/?post_type=profile&p=133",
  "termIds": [
    4286,
    2802,
    1126,
    1489,
    5991,
    6074,
    6506,
    6512,
    6520
  ],
  "sentences": [
    "“We all sort of know how Pittsburgh and Philadelphia go, but the voter turnout and the makeup of what Blair County is is very representative of Pennsylvania.”\nBartos and Barnette will join Carla Sands, Everett Stern and George Bochetto in a debate Monday night at Villanova.",
    "ALTOONA, Pa. (WTAJ) — Four candidates vying for the Republican nomination for the open United States Senate seat in Pennsylvania visited Blair County on Feb. 17 for the Lincoln Day Dinner.",
    "Blair County GOP Chair Jim Foreman believes an event like the Lincoln Day Dinner is an important one for these candidates, as he sees the county playing a pivotal role in the race.",
    "“Raising money and getting it out the door to save small businesses.”\nDr. Oz and McCormick have been at odds on the airwaves but met in front of the same crowd Thursday night.",
    "Candidates Jeff Bartos and Kathy Barnette had the opportunity to reach the voters who have been bombarded by TV ads from their opponents Dr. Mehmet Oz and Dave McCormick.",
    "“During the pandemic while others were living in Colorado or Connecticut or other places…I had my sleeves rolled up on main streets across all 67 counties,” Bartos said.",
    "“He built the largest hedge fund, a $1.3 billion investment gathered in China, that he finished in November and then announced his candidacy six weeks later.",
    "To me, that’s disqualifying.”\nMcCormick explained he is not shying away from his success in business, and that he has lived the American dream.",
    "The most important thing is to win the general election.”\nFor Bartos, he’s running on the actions he’s already taken to help Pennsylvanians.",
    "Bartos established the 30 Day Fund, a nonprofit that provides forgivable loans to small businesses that were struggling during the pandemic.",
    "Each candidate had a chance to make their pitch to voters as to why they are the right choice to represent the GOP in November.",
    "I want to work on behalf of Pennsylvania to make sure my kids and your kids can have that same experience too,” he continued.",
    "“The arguments I make about Dave McCormick are very much about what he has done over the last couple of years,” Dr. Oz said.",
    "We got to be very serious,” she explained, “We have a very important decision to make and we only get one shot at doing it.",
    "“He stepped into it and said, ‘That’s why I’m going to be a great president.’ I’m stepping into it.",
    "“My focus is talking to the people, making sure that they understand these are very serious times.",
    "“Just like President Trump, (he) didn’t back off of his business success,” McCormick said.",
    "Barnette says the GOP needs a strong candidate to represent them in November.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "“It is a bellwether for how the state will do,” Foreman said.",
    "It’s an idea that he says was born in Blair County.",
    "I’m saying, ‘listen, this is what we dream of.",
    "McCormick has since withdrawn from the debate.",
    "I want to bring that experience to others.",
    "Sign up for the abc27 newsletters here.",
    "Dr. Oz declined the invite.",
    "'”\n“I’ve lived that.",
    "The American dream.",
    "For our kids."
  ]
}