{
  "id": 965,
  "mediaId": 2641,
  "date": "2022-02-14",
  "headline": "The Supreme Court Will Disappoint Joe Biden on Gun Control",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=9b1f9289-4154-47f7-819a-49c0d9de1c9a&SiteName=Newsmax",
  "link": "https://www.newsmax.com/michaeldorstewitz/guns/2022/02/14/id/1056725/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Dorstewitz",
  "authorUrl": "https://www.newsmax.com/insiders/michaeldorstewitz/id-498",
  "termIds": [
    4905,
    3144,
    1269,
    392,
    6653
  ],
  "sentences": [
    "Pennsylvania GOP Senate candidate Dave McCormick ran a “Let’s go, Brandon!” Super Bowl campaign ad within his state, listing some of Biden’s losses since taking office, using actual headlines, including:\nInflation a record high;\nThe fiasco in Afghanistan is a grave blow;\nBig Tech silencing conservative voices;\nU.S. trade deficit hits record high;\nOn pace to surpass record for annual homicides; and,\nIllegal border crossings soar to record highs.",
    "“May be of help to Russian troops on Ukraine border.”\nHis win-loss record with the courts hasn’t fared much better, including:\nAn appeals court rejected his bid to end Trump’s “remain in Mexico” policy for asylum-seekers;\nThe Supreme Court blocked his OSJA vaccine mandate for large companies; and,\nLate last week a federal court in Louisiana struck down a climate change provision the administration proposed.",
    "In 2008 the high court reaffirmed this standard in D.C. v. Heller, and ruled that handguns, which were banned by the District of Columbia at the time, were protected under the Second Amendment because they were \"in common use at the time.”\nThe court also ruled in Heller that the Second Amendment right to keep and bear arms was an individual right — unconnected to the membership in any militia.",
    "On Sunday, at a time when Russia and Ukraine are poised at the brink of war, the State Department sent an explanation of American football and Super Bowl Sunday to the international community, making others wonder if the White House had its own eyes on the ball.",
    "He reported that Georgetown University Professor William English released a survey of more than 16,000 self-proclaimed gun owners last year, revealing that 30% of them admitted to owning AR-15s or AR-style rifles either currently or in the past.",
    "When campaigning for the Democratic presidential nomination in 2009, O’Rourke exclaimed, “Hell, yes, we’re going to take your AR-15, your AK-47,” which made him sound very much like Biden — along with a lot of other Democrats.",
    "“What I want to make sure that we do is defend the Second Amendment.”\nHis change of heart is more-than-likely grounded in the knowledge that confiscating people’s guns isn’t how you win hearts and minds in the Lone Star State.",
    "Back in 1939, the U.S. Supreme Court held in U.S. v. Miller that a short-barreled shotgun was not a weapon protected under the Second Amendment, because it was not \"in common use at the time” of the court’s decision.",
    "Texas gubernatorial hopeful Robert Francis “Beto” O’Rourke apparently learned something that President Joe Biden hasn’t — you can’t ban the manufacture, sale or possession of AR-15-style rifles in the United States.",
    "Cam Edwards, editor at Bearing Arms, a popular pro-Second Amendment news and blog site, observed that AR-15-style rifles are among the most popular long guns being manufactured, sold and owned by Americans today.",
    "For decades he’s been trying to ban AR-15-style rifles, claiming that they’re “weapons of war” (they’re not) and referring to them as “assault rifles” (a made-up term meant to scare the public).",
    "English conservatively estimated that there were 80 million U.S. gun owners, which would mean an estimated 24 million past or present owners of AR-15-style rifles, placing them in common use.",
    "Extending that to his conservative 80 million gun owners, that would equal 38.4 million gun owners who own, or have owned, magazines with a greater than 10-round capacity.",
    "Even more common are the ammunition magazines that Biden defines as “high capacity” if capable of containing more than 10 rounds and which he would also ban.",
    "Or, it could be that he learned a little constitutional law in the intervening years — something that’s eluded Biden — an alleged law school graduate.",
    "On that issue, English found that nearly half of the gun owners surveyed (48%) acknowledged owning magazines with a greater than a 10-round capacity.",
    "The magazine capacity of full size Heckler & Koch USP 9mm handgun is 15 rounds; the same model in a compact size holds 13 rounds.",
    "Merchant Marine officer and an enthusiastic Second Amendment supporter who can often be found honing his skills at the range.",
    "Michael Dorstewitz is a retired lawyer and has been a frequent contributor to BizPac Review and Liberty Unyielding.",
    "“State Dept posts primer to the world explaining Super Bowl,” observed CBS News’ Mark Knoller.",
    "If Biden pushes his AR-15 and magazine ban, he’s only going to be disappointed again.",
    "The most popular handgun cartridge size is 9mm, according to a recent report.",
    "When asked about that statement last week, he made a complete about-face.",
    "Maybe he likes disappointment — he at least should be used to it by now.",
    "“I’m not interested in taking anything from anyone,” he said.",
    "His administration appears resigned to failure also.",
    "So what does all that have to do with Joe Biden?",
    "Biden hasn’t had much of a winning season.",
    "Read Dorstewitz's Reports — More Here.",
    "Newsmax Blogs:\n© 2022 Newsmax.",
    "He is also a former U.S.",
    "All rights reserved.",
    "Special Links:"
  ]
}