{
  "id": 9842,
  "mediaId": 8254,
  "date": "2022-03-31",
  "headline": "Sean Parnell, former Senate candidate, endorses McSwain for Governor",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/AP22075589145241.jpg?w=1280",
  "link": "https://www.abc27.com/election/sean-parnell-former-senate-candidate-endorses-mcswain-for-governor/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    4811,
    4958,
    2765,
    1942,
    1489,
    6506
  ],
  "sentences": [
    "McSwain said, in part, he was “proud to receive the endorsement of my fellow veteran Sean Parnell,”\n“Driven by our shared conservative principles, we will work towards victory in November and a safer, freer, more secure Pennsylvania for generations to come.”\nGet the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "In his endorsement, Parnell described McSwain as a “conservative outsider” and a “fighter.”\n“It’s not every day that you see an Army Captain cheering on a Marine Platoon Commander, but in this case, I am proud to cheer Bill on and give him my full endorsement,” said Parnell.",
    "Parnell was former President Donald Trump’s endorsed candidate in the May primary election before Parnell suspended his campaign in November after losing a custody fight with his estranged wife.",
    "WEST CHESTER Pa. (WHTM) – Bill McSwain, Republican candidate for Governor, today announced that he has received the endorsement of former Senate candidate and combat veteran Sean Parnell.",
    "The judge, James Arner, wrote in an order Monday that Parnell’s estranged wife, Laurie Snell, will have sole legal custody of the school-age children, as well as primary physical custody.",
    "According to the Pittsburgh Post-Gazette, Parnell endorsed Senate candidate Dave McCormick and appeared with him at a March 15 event in Homestead, Pa.",
    "Snell was “the more credible witness,” Arner summed up in his 16-page opinion, saying she could remember and describe details in a convincing manner.",
    "Parnell took the stand to deny allegations by his estranged wife that he had hurt her and the children.",
    "Former President Trump has not yet made an endorsement in either the Senate or Governor race.",
    "Parnell will have physical custody on three weekends per month, Arner wrote.",
    "The Associated Press contributed to this report",
    "Sign up here."
  ]
}