{
  "id": 2450,
  "mediaId": 2589,
  "date": "2022-02-08",
  "headline": "As GOP tries to retake the House, women and minority candidates lead the way",
  "image": "https://hotair.com/wp-content/uploads/2022/02/Monica-1110x740.jpg",
  "link": "https://hotair.com/john-s-2/2022/02/08/as-gop-tries-to-retake-the-house-women-and-minority-candidates-lead-the-way-n447200",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Sexton",
  "authorUrl": "https://hotair.com/author/john-s-2",
  "termIds": [
    0
  ],
  "sentences": [
    "… We need to be well-represented here on both sides of the aisle.”\nThis year, as the GOP hopes to finally retake the House, the party is doubling down with a focus on women and minority candidates:\nBroadly, there are more Republican women and Hispanics running for Congress than ever before, according to figures tracked by the National Republican Congressional Campaign Committee.",
    "It’s some of the clearest evidence that Trump’s 2020 performance there may not have been an anomaly, but rather a sign of significant Republican inroads among Texas Hispanics — perhaps not enough to threaten the Democratic advantage among those voters, but enough to send ripples of fear through a party that is experiencing erosion among Hispanics across the country.",
    "#TheAmericanDream #AZ02https://t.co/890c6IrbZQ pic.twitter.com/1MtySXUWor\n— Juan Ciscomani (@JuanCiscomani) October 6, 2021\nAnd given Joe Biden’s poll numbers and the general consensus that the country is not headed in the right direction, there are GOP candidates with a chance to win in districts where Biden won in 2020 by as much as 11 points.",
    "Doug Ducey who is running for an open Tucson seat; and Wesley Hunt, a Black Army veteran…\nBuilding on their success from the last election, female candidates are top GOP contenders for highly contested battleground seats in Kansas City, Kan.; Virginia Beach; northeast Pennsylvania; Las Vegas; Toledo, Ohio; Manchester, N.H.; and Orlando.",
    "Among those contenders: Tanya Contreras Wheeless, a Latina businesswoman challenging Democratic Rep. Greg Stanton in a Phoenix-area district; Jennifer Ruth-Green, a Black Air Force reservist, and former La Porte Mayor Blair Milo, who are both running against Democratic Rep. Frank Mrvan (D-Ind.",
    "Join my team today at https://t.co/NChWVXRjEQ pic.twitter.com/Ejp6LMQWHX\n— Jeremy C. Hunt (@thejeremyhunt) January 13, 2022\nRepublicans are putting forward some appealing candidates and there’s every reason to think, collectively, they’re going to take the House this November.",
    "In the most important seats, roughly two dozen open and battleground districts, a leading GOP candidate is either a woman or a person of color…\nFemale, Black and Hispanic GOP candidates are the frontrunners to win several more open or swing seats in November.",
    "pic.twitter.com/3EoE9N7jvd\n— Monica De La Cruz for Congress (@monica4congress) February 1, 2022\nIn Arizona, Juan Ciscomani has a similar message but with a focus on his identity as a proud, first generation American.",
    "“What [GOP leaders] learned from the cycle is that women can win,” said Sarah Chamberlain, a GOP strategist who runs the moderate Republican Main Street Partnership and has been trying to elect more women for years.",
    "That list includes: De La Cruz in Texas; Army reservist Esther Joy King, who is vying to replace retiring Rep. Cheri Bustos (D-Ill.); Juan Ciscomani, a longtime adviser to Arizona Gov.",
    "Instead, despite Joe Biden winning the White House, the GOP wound up flipping 13 seats held by Democrats and most of the candidates who flipped those seats were women.",
    "You probably remember that in the run up to the 2020 election the expectation was that Democrats could pick up as many as a dozen seats in the House.",
    "); and Jeremy Hunt, a Black Army veteran, who launched a campaign against veteran Democratic Rep. Sanford Bishop in a southwest Georgia seat.",
    "And in case you think she might be offering a softer message than other Texas Republicans, check out this campaign ad she posted last week.",
    "I am ALL IN to fight to give our community a voice, and stop the reckless policies we are seeing come out of Washington, D.C.\nJoin us!",
    "So far, more than 253 women and 228 people of color have filed to run as Republicans across the House map, the committee says.",
    "Looking at his introduction of himself to voters, he’s got a great biography and seems like he could be a winner.",
    "Yesterday, Politico published a story about the Hispanic women who are leading GOP candidates in southern Texas.",
    "I’m a next-generation conservative running to preserve the American dream for my family and yours.",
    "“As a woman, as a mother of a daughter, I think it is a huge step forward.",
    "Monica De La Cruz is one of those women making Democrats nervous.",
    "It's official – I'm running for Congress in GA's 2nd district!",
    "WATCH:\nI am running for the future of my children AND yours.",
    "“…and together we’ll finish what Trump started.” ??",
    "To be honest, I hadn’t heard of Jeremy Hunt before.",
    "????"
  ]
}