{
  "id": 11082,
  "mediaId": 2658,
  "date": "2022-03-10",
  "headline": "Top GOP Rules staffer heading back to K Street",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/03/10/top-gop-rules-staffer-heading-back-to-k-street-00016283",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4242,
    4404,
    4409,
    3246,
    4066,
    2877,
    2976,
    2104,
    505,
    610,
    1126,
    1235
  ],
  "sentences": [
    "Horizon Government Affairs: Laboratory Access & Benefits (Lab) Coalition\nInvariant LLC: Prince George'S County Government\nJ M Burkman & Associates: Joselito Molina\nJ M Burkman & Associates: Lucia Enterprises International\nMike Williams Capitol Strategies LLC (F/K/A Mw Capitol Strategies LLC): Steptoe & Johnson LLP On Behalf Of Complete Parachute Solutions, Inc.\nMike Williams Capitol Strategies LLC (F/K/A Mw Capitol Strategies LLC): Steptoe & Johnson LLP On Behalf Of Iten Defense LLC\nMike Williams Capitol Strategies LLC (F/K/A Mw Capitol Strategies LLC): Steptoe & Johnson LLP On Behalf Of Point Blank Enterprises, Inc.\nMilne, Wiener & Shofe Global Strategies (Fka M & W Government Affairs, LLC): C6 Strategies, LLC On Behalf Of Reveal Technology, Inc.\nMilne, Wiener & Shofe Global Strategies (Fka M & W Government Affairs, LLC): Maher & Associates, LLC, Dba Maher Advanced Manufacturing\nNational Group, LLP: Museum Of Science And Industry\nO'Neill And Associates: David Radlo\nPeople United For Privacy: People United For Privacy\nPeter Damon Group LLC: Tis-Group Jv\nRakuten Mobile USa LLC: Rakuten Mobile USa LLC\nResolution Public Affairs, LLC: Oracle\nS-3 Group: Mckinsey & Company\nS-3 Group: Pet Food Institute\nSaildrone Inc.: Saildrone Inc.\nSandler, Travis & Rosenberg, P.A.",
    "The downtown community’s letter calls on Congress to reopen to people without appointments beginning July 11, arguing, “What better message to send to the public that we are turning the corner on two years of very difficult and challenging times for this country than by announcing that Capitol Hill is again open to the public?”\n— The letter was signed by trade groups like the U.S. Chamber of Commerce, Footwear Distributors & Retailers of America and U.S. Travel Association, in addition to individual lobbyists such as theGROUP D.C.’s Eriade Williams and lobbying shops such as Ogilvy Government Relations.",
    "The Lucas Firm, LLC (F/K/A Travis Lucas): Hntb Corporation\nThe Raben Group: Early Edge California\nWhitmer & Worrall, LLC: University Of North Florida\nWinning Strategies Washington: Coya Therapeutics\nNew Lobbying Terminations\nMercury Public Affairs, LLC: Fluidigm\nMercury Public Affairs, LLC: Roz Trading LLC\nMercury Public Affairs, LLC: US Immigration Fund LLC\nMeridian Hill Strategies Formerly Known As \"Ernest C. Baynard Iv\": Tecore Networks\nSquire Patton Boggs: Gazprombank Gpb (Ojsc)\nVan Scoyoc Associates: Downey Brand LLP (Three Rivers Levee Improvement Authority)\nFollow Us",
    "Cornerstone Government Affairs, Inc.: Applied Intuition, Inc.\nCovington & Burling LLP: Hino Motors Manufacturing U.S.A., Inc.\nCypress Advocacy, LLC: Municipal Securities Rulemaking Board\nDefi Education Fund: Defi Education Fund\nDla Piper LLP (US): Mark Foods\nFederal Hall Policy Advisors, LLC: Pretium\nFgh Holdings, LLC (Formerly Known As The Glover Park Group LLC): Mckinsey And Company, Inc.\nGordian Group: Gordian Group\nHolland & Knight LLP: Give Legacy, Inc.\nHolland & Knight LLP: Hms Associates (On Behalf Of Glide Foundation)\nHolland & Knight LLP: Riot Blockchain, Inc.",
    "James Lankford, Tim Scott)\nNew PACs\nAMERICANS FOR PROTECTING LIBERTY (Super PAC)\nBIG RED LEADERSHIP PAC (Super PAC)\nCalifornians for Freedom (PAC)\nDEFENDING FREEDOM PAC (Super PAC)\nIndiana Leads PAC (Hybrid PAC)\nLEADERSHIP FOR INDIANA PAC (Super PAC)\nLEHIGH VALLEY ACTION (Leadership PAC: Lisa Scheller)\nOK SENATE REPUBLICAN NOMINEE FUND 2022 (PAC)\nTake It Back Virginia PAC (Super PAC)\nNew Lobbying Registrations\nAcg Advocacy: Irell & Manella, LLP On Behalf Of Vlsi Technology, LLC\nAkin Gump Strauss Hauer & Feld: Barlow Respiratory Hospital\nAlpine Group Partners, LLC.",
    "Jewish Insider, which first reported the meeting, said Pence joined Adelson on Tuesday morning to pay his respects at her husband's gravesite on the Mount of Olives, overlooking Jerusalem's Old City.” The trip comes as Pence’s advocacy group “announced it was spending $10 million on TV ads targeting vulnerable House Democrats on energy policy and Ukraine” — “the most expensive move by a 2024 GOP contender not named Donald Trump.”\nJobs Report\n— Katelynn Vogt is joining the Carnegie Endowment for International Peace as communications director.",
    "Autoimmune Association: Autoimmune Association\nBose Public Affairs Group: 3Chi Corporation\nBose Public Affairs Group: Coverpoint Partners, LLC\nBrownstein Hyatt Farber Schreck, LLP: Chegg, Inc.\nBrownstein Hyatt Farber Schreck, LLP: Msci\nBrownstein Hyatt Farber Schreck, LLP: National Multifamily Housing Council\nBuchanan Ingersoll & Rooney Pc: Fera Pharmaceuticals, LLC\nCapitol Decisions, Inc.: Van Scoyoc Associates (Alliance For Plant Based Inclusion)\nClarity Consulting, LLC: Drug Abuse Resistance Education (D.A.R.E.)",
    "Hany Farid, a professor of computer science at UC Berkeley and a recent adviser to the Biden White House on tech reform, told me that ‘Joel Kaplan is probably the most influential person at Facebook that most people have never heard of.’”\nWITH FRIENDS LIKE THESE: “Mike Pence flew to Israel this week on the private jet owned by arguably the most powerful donor in Republican politics, Miriam Adelson,” two sources familiar with the situation told Axios’ Jonathan Swan and Lachlan Markay.",
    "It also seeks a dialogue with leadership to discuss “a proposal that could enable Congress to re-open for public visits, which would help ensure that people remain healthy and safe.”\n— Lobbyists have technically been able to return to the Capitol complex since last year, but have not been able to roam the halls without appointments and escorts, a hurdle some on K Street have deemed not worth the hassle on a regular basis.",
    "— ”Members of our profession understand the challenges that Congress has faced and we have been sympathetic to its health, safety, and security concerns over these last two years,” says the letter to House Speaker Nancy Pelosi, House Minority Leader Kevin McCarthy, Senate Majority Leader Chuck Schumer and Senate Minority Leader Mitch McConnell, which was spearheaded by the National Institute for Lobbying & Ethics.",
    "While I am sad to see him go, I couldn’t be happier for him in this next endeavor.”\n— Fitzella, who was at Downey McGrath Group before joining Rules, worked with a wide range of committees, including the Agriculture, Appropriations, Energy and Commerce, Financial Services, Homeland Security, Natural Resources, Small Business, Transportation and Infrastructure, Ways and Means, and Veterans’ Affairs panels.",
    "DOWNTOWN COMMUNITY ASKS LEADERSHIP TO REOPEN CAPITOL: More than 250 lobbying firms, lobbyists and trade associations signed on to a letter delivered to congressional leadership Wednesday urging Hill leaders to reopen the Capitol to the public — and, more importantly, to K Street — after two years of public health and security-driven restrictions on who can walk the halls of Congress freely.",
    "— The company’s lobbying spending soared in the second half of 2019, after then-President Donald Trump signed an executive order seeking to block U.S. companies from doing business with companies such as Huawei, and slowed to a trickle before surging past its 2019 levels last year (thanks in part to hefty, $500,000 payments to Tony Podesta, whom the company brought out of retirement).",
    "— According to registration paperwork shared with PI, Squire’s Bret Boyles and Ed Newberry began working in January for Huawei on telecom issues, export controls and sanctions, including the fiscal 2020 National Defense Authorization Act, which requires that certain conditions be met in order for Huawei to be removed from the Commerce Department’s entities list.",
    "Top GOP Rules staffer heading back to K Street\nBy CAITLIN OPRYSKO\n03/10/2022 05:10 PM EST\nPresented by\nWith Daniel Lippman\nFIRST IN PI — TOP GOP RULES STAFFER RETURNING TO K STREET: James Fitzella, a senior professional staffer for House Rules ranking member Tom Cole (R-Okla.), is heading back to K Street to join the Vogel Group as a director.",
    "He also leads a team of a thousand Policy staff worldwide, assessing, shaping, and often thwarting the boundless constellation of international laws and policies that graze Facebook’s business and its 2.9 billion users across the globe, from German privacy rules to Iowa firearm laws to Indian political parties.",
    "— In a statement provided by the firm, Cole called Fitzella “a truly invaluable member of the team, supporting Republicans in both the majority and the minority,” and someone who “has always provided valuable counsel to me and demonstrated the highest level of professionalism and dedication to his work.",
    "Functionally, his authority is as sprawling as the company’s reach.”\n— “The 52-year-old has not only assembled one of history’s most prolific lobbies in Washington, where he manages relations across the federal government as well as with state capitals and their increasingly avid attorneys general.",
    "KNOWING JOEL KAPLAN: Wired’s Benjamin Wofford is out today with a lengthy profile of Joel Kaplan, Facebook parent company Meta’s man in D.C. and beyond, who has guided the company through numerous crises while building out one of the capital’s most formidable lobbying shops.",
    ": Base Brands, LLC\nSbl Strategies, LLC: University Of Tulsa\nSmoke-Free Alternatives-Trade Association: Smoke-Free Alternatives-Trade Association\nStrategies 360: California Asian Pacific Chamber Of Commerce\nStrategies 360: Innova Medical Group, Inc.",
    "— The letter concedes that security concerns following the Jan. 6, 2021 insurrection persist even as coronavirus infections remain down and the House recently dropped its mask mandate after roughly two years, lowering the public health risk.",
    "— “The former vice president, who fell out with Donald Trump because he refused the former president's demands to unilaterally overturn the 2020 election result, is contemplating challenging Trump in the 2024 GOP presidential primaries.",
    "— The Large Public Power Council announced that Jackie Sargent, general manager of Austin Energy, and Tom Falcone, CEO of Long Island Power Authority, are now the organization’s new chair and vice chair, respectively.",
    "Fitzella has spent most of the last decade as a GOP staffer on the wonky but powerful committee that sets the rules for debate and whether amendments may be offered on pieces of legislation heading to the House floor.",
    "For a company whose power has no equivalent, Kaplan’s is a job without precedent.”\n— “One person described Kaplan to me as ‘Washington dark matter’ — exerting powerful gravitational forces but strangely hidden.",
    "— “We are pleased to be working with best-in-class legal and policy experts from Squire Patton Boggs to help Huawei USA understand US Government questions and concerns,” Huawei said in a statement.",
    "HUAWEI REHIRES SQUIRE PATTON BOGGS: The blacklisted Chinese tech firm Huawei has added Squire Patton Boggs back to its contingent of outside lobbyists in the U.S., according to a disclosure filing.",
    "— James Hayes was promoted to senior vice president of global government affairs at Tenable, and Jill Shapiro was also promoted to be the company’s vice president of global government affairs.",
    "“Hired in 2011 after eight years in the Bush White House, his tenure has coincided with Facebook’s rise to global dominance — and its ascendance to the throne of permanent controversy.",
    "A close relationship with Adelson — widow of former casino mogul and megadonor Sheldon Adelson — could potentially bring tens of millions of dollars to a pro-Pence political machine.",
    "He led communications for North Carolina Senate Leader Phil Berger and the state Senate Republican Caucus for the past four years, and is a former U.S. House communications director.",
    "The world will benefit from multiple, secure platforms supporting digital technology needs.” The company also retains LeMunyon Group, Imperium Global Advisors and Sidley Austin.",
    "McCoshen, a partner in the Wisconsin office of Michael Best Strategies, and Riccio, a principal in the D.C. office, have also been added to the MBS PAC board.",
    "— Goldman Sachs' Dina Powell McCormick has been named by House Minority Leader Kevin McCarthy to the Middle East Partnership for Peace Advisory Board.",
    "According to the list of signatories reviewed by PI, though, none of the top 20 lobbying firms by revenue were among the letter’s early signatories.",
    "Summit Strategies Government Affairs LLC: Flex Force Enterprises Incorporated\nTgb Strategies LLC: Brownstein Hyatt Farber Schreck Obo Caredx, Inc.",
    "A disclosure filing submitted to the Senate’s lobbying database shows Jack Deschauer and Jeff Turner on the account instead of Boyles.",
    "Deitz was previously at Kontoor Brands and Hohl was previously at the John F. Kennedy Library Foundation and Fidelity Investments.",
    "— Scott Deitz and Meaghan Hohl have joined Seven Letter as partners, helping launch the firm's ESG practice.",
    "— “In Silicon Valley, Joel Kaplan is regarded as one of Facebook’s most curious enigmas,” Wofford writes.",
    "“Huawei has recently worked with several government relations partners to help us on this direction.",
    "Squire first signed the telecom giant back in 2019 but filed termination paperwork the next year.",
    "Pence currently trails well behind Trump in speculative 2024 polls of Republican voters.",
    "— Michael Best Strategies has named Bill McCoshen and Andrea Riccio political directors.",
    "— “Pence arrived in Israel on Monday and had dinner with Miriam Adelson that night.",
    "She previously was deputy chief of staff for Rep. David Price (D-N.C.).",
    "— Pat Ryan has launched North Carolina-based Ryan Public Relations.",
    "Formally, Kaplan’s role is to forecast and manage policy risk.",
    "Send K Street tips, musings and gossip: coprysko@politico.com.",
    "— Joe Garcia has joined Texas Star Alliance as a principal.",
    "New Joint Fundraisers\nLANKFORD-SCOTT VICTORY FUND (Sens.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "He is president of the Garcia Group.",
    "Good afternoon and welcome to PI.",
    ": Njoy, LLC."
  ]
}