{
  "id": 7172,
  "mediaId": 238,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Rep. Susan Wild carefully finds middle ground, except on abortion",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/07/midterm-democrats-abortion/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    4501,
    5168,
    146,
    428,
    482,
    5223,
    2597
  ],
  "sentences": [
    "As I travel the district, the number one concern I hear about is the cost of living,? said Lisa Scheller, who was defeated by Wild in 2020 and is running again in the GOP primary on May 17. The people of the Lehigh Valley are ready for a common-sense conservative who prioritizes good jobs, safe communities and a good standard of living.?\nMost of those issues came up at a roundtable Wild held last month in Allentown with 18 manufacturing executives who want to create more avenues for young people to be trained in textiles without the need to seek a college education, a cause Wild has championed while serving on the House Education & Labor Committee.",
    "Were pivoting to now making sure that our supporters are organized, and theyre mobilized, and theyre ready to do a couple of actions that will help us in this fight.?\nBut even in speaking forcefully about abortion, Wild says she plans to continue focusing on the issues that her constituents ask her about often and that her Republican opponents will continue to attack her on: rising prices, the workforce and the repercussions of supply chain logjams in a largely manufacturing and labor community.",
    "As far as their economic agenda, it seems like its just stalling Democrats at every phase.?\nKathy Garza, 72, echoed some sympathy for Biden, saying that most of the issues he faces are not really his fault.? She continues to identify as a Republican, having voted neither for Biden nor Trump, but acknowledged many like her in suburban Lehigh Valley are turned off by candidates who embrace Trumps style and act as obstructionists in Congress.",
    "The will of the American people is being violated as part of an ideological crusade by far-right forces, and it means that all of our constitutional rights are at stake.?\nShe blamed former president Donald Trump  a president who lost the popular vote,? she noted  and the three conservative justices he appointed, who she said outright lied during their confirmation hearings? in claiming Roe was settled law.",
    "Its an attack Scheller has already used in campaign ads that labels Wild as helping to push a radical agenda.?\nBut Wild and her team are confident voters will see through the attempts to categorize her as a staunch liberal, citing her accessibility and close ties to constituents who often call or text her personal cellphone  which, they argue, is the ultimate way to mobilize voters.",
    "Theres the positive there, but its a lot to take in for small communities.?\nIts likely Wild will face off against Scheller, her former Republican opponent who benefits from name recognition after seeking the seat in 2020 and has raised 10 times more than her current primary opponent, Kevin Dellicker, according to federal disclosures.",
    "My answer is: Well, if youre not going to be pro-business, then where are you going to get all these jobs people need??\nSeveral executives noted that their workforce has been depleted and suggested that refugees willing to work in labor-intensive jobs should be given appropriate visas, a process that was restricted under Trump.",
    "I think she votes with her head and not her heart, and thats important.?\nThe National Republican Campaign Committee has painted Wild as a liberal parading back home as a moderate, often pointing to her 100 percent voting record with Biden and House Speaker Nancy Pelosi (D-Calif.) this congressional term.",
    "A former Republican who registered as an independent in 2020 after being turned off by Trump, he remains frustrated about inflation but does not regret his vote for Biden, largely blaming Republicans in the Senate for stalling legislation that could alleviate economic problems.",
    "Greg Abbott (R) would soon send buses packed with undocumented immigrants to the Lehigh Valley after doing it to D.C. (Abbott only sent two charter buses to the nations capital before facing a backlash, including from his own party, for misappropriating taxpayer funds.)",
    "In an interview, Fischer, who began representing a more conservative borough in Wilds district this year, said she appreciated how accessible the congresswoman was even though she wished there were more concrete answers to the problems affecting her community.",
    "Im going to continue to fight every day for the people of Pennsylvanias 7th, on all issues  But you better believe reproductive freedom is going to dominate serious attention in the coming weeks and months, because peoples lives and liberty are on the line.",
    "While the addition of Carbon County may skew the district more conservative, these strategists say, the midterm election winner will probably be determined by voter enthusiasm and turnout in the suburban neighborhoods that anchor the Lehigh Valley.",
    "So many people are incredibly angry and motivated to do something right now,? said Sam Bobila, the chief external affairs officer at Planned Parenthood Keystone, who joined Wild at the rally and was struck by the energy of those gathered.",
    "Wild has spent months avoiding culture-war topics in her moderate district, but her passionate speech at a courthouse rally Tuesday night was reminiscent of 2018, when Trumps presidency invigorated liberal activists, many of them women.",
    "I think people either turn out to vote or dont turn out to vote based on whether they feel like they have something to vote for, and I am pretty confident my district feels like they have something to vote for,? she said.",
    "Schellers approach is one that some Republican strategists say could make her more palatable in an evenly split district filled with former GOP voters who became independents after Trump took control of the party.",
    "Wild listened, listed bills she has introduced to combat the supply chain problem and stressed her belief that government should have a respectful relationship with businesses, conducting oversight when necessary.",
    "She noted that planes carrying undocumented children do arrive at the Lehigh Valley airport because its cheaper to land there than at a New York City-area airport, where the children are eventually transported.",
    "Two years ago, Wild held a town hall in a rural part of the district and was confronted by attendees who falsely accused her and other Democrats of supporting legislation that would abort full-term fetuses.",
    "Wild, who defines herself as pro-business Democrat, has carefully tried to explain how her party is attempting to confront these problems and reach voters who arent sure which political party to trust.",
    "But several executives told her they were also worried about the skyrocketing price of oil, steel and other products that have caused major delays in completing projects, making them lose business.",
    "There is nothing I take more seriously.?\nRepublicans involved with the race say their message against Wild will be different than in 2020, with a heavy focus on inflation, crime and immigration.",
    "Whether women can get credit in their own names?? Wild tersely said, rallying with activists less than 24 hours after a draft opinion leaked, reveling the courts likely plans to overturn Roe.",
    "Democratic and Republican strategists predict an overhaul of Roe by the Supreme Court this summer could enthuse the Democratic base, which showed little motivation to turn out in November.",
    "Rep. Susan Wild (D-Pa.) is not waiting for the Supreme Court to officially overturn Roe v. Wade to bluntly ask constituents in her swing district to consider what rights would fall next.",
    "Forty-seven minutes in, Wild mentioned Biden for the first time, noting his decision to accept Ukrainian refugees, all of whom she said could bolster the workforce through proper visas.",
    "Wild echoed the sentiment, noting that the declining birthrate in the United States and the lack of people returning to the workforce after the pandemic created a labor shortage.",
    "They point to Wild underperforming her 2018 margin by more than six points in 2020, and only holding a four-point lead ahead of Scheller at a time when Biden was more popular.",
    "I dont understand where theyre going with their social agenda, he said about pro-Trump Republicans running for office, outside an Allentown Wegmans grocery store last month.",
    "Wild narrowly won again in 2020, when Joe Biden carried the state, but redistricting added rural Carbon County, which Trump won with 65 percent of the vote, to her district.",
    "At another event with local leaders later that evening, Portland, Pa., Mayor Heather Fischer asked Wild how to address misguided concerns from constituents that Texas Gov.",
    "That year, Democrats flipped dozens of seats long held by Republicans  including Wilds district in eastern Pennsylvania that includes suburban Allentown and Bethlehem.",
    "But as she rallied with sign-holding activists on Tuesday, Wild made clear where she stood on abortion  even if it might upset conservative voters in her district.",
    "Many voters also disapprove of the job President Biden and Democrats are doing and are angry about inflation, increased gas prices and supply chain problems.",
    "The New Democrat Coalition that Im a part of is not particularly a favorite of the far left,? she said, referencing the moderate, pro-business caucus.",
    "During a GOP primary debate last month, Scheller expressed openness to criminalizing abortions except in cases where a mothers life is at risk.",
    "She also said she did not support banning abortion pills, which are prescribed to induce a miscarriage in the first 10 weeks of pregnancy.",
    "When I first joined the New Dems, I got a fair amount of flak for that because they dont particularly like that pro-business mentality.",
    "There are plenty of people from countries who want to come work, but were not doing anything to attract those people,? Wild said.",
    "People in my district arent single issue voters, and Im not a single issue Congresswoman,? Wild said in a statement Friday.",
    "She made exuberantly clear that she is not a member of her partys liberal wing that is often more visible and vocal.",
    "Im really glad you asked that question,? Wild said, before explaining that thats not going to happen.",
    "Voters like Paul Montgomery, 60, are waiting until after the primary to begin weighing who to pick.",
    "Theres not a lot of positives going on, but its nice to see Susan Wild come out and talk about it.",
    "(She broke with Pelosi on one vote  the Heroes Act  during her first term).",
    "Whether you can marry the person you love, regardless of gender or color?",
    "Deciding how many children to have, or not to have children at all?",
    "Thats what I like,? Garza, who is retired, said outside of a Wawa.",
    "It feels like its all happening at one time,? she said.",
    "Dellicker said he would support both.",
    "Contraception?"
  ]
}