{
  "id": 7177,
  "mediaId": 118,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "TFW a TV Host Tells a White Woman That as a Hispanic She Should Speak for Hispanic Voters",
  "image": "https://www.motherjones.com/wp-content/uploads/2022/03/2022-03-27-rachel.jpg",
  "link": "https://www.motherjones.com/politics/2022/03/tfw-a-tv-host-tells-a-white-woman-that-as-a-hispanic-she-should-speak-for-hispanic-voters/",
  "mediaOutlet": "Mother Jones",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fernanda Echavarri",
  "authorUrl": "https://www.motherjones.com/author/fernanda-echavarri/",
  "termIds": [
    5168,
    5410,
    146,
    199,
    428,
    2796
  ],
  "sentences": [
    "Im going to move on to you Amanda, you are Hispanic,? Campos-Duffy said emphatically, by way of turning Adkins into the authority and spokesperson for all issues Hispanic.?\nIts no surprise from these polls Hispanics are fleeing the Democrat Party,? she continued as Adkins maintained a pleasant expression and no flicker of concern that she may have been misidentified.",
    "Misunderstand Latino voters at your own peril, and that goes for campaigns as well as media.?\nAnyway, much has already been said by smart people about all of this so Ill just end with the observation that the weirdest thing about this clip for me was that the host doesnt pause or lose a beat to address the misidentification of a white woman as Hispanic.",
    "After Adkins gave her speech explaining why she is running for office, Ill give her some kudos for wanting to highlight that there are some Latina business leaders who are running.? But lets be clear, her answer had nothing to do with the question that started all this in the first place.",
    "So I was surprised to see that her last name was Campos, and USA Today told me, when she got the Fox gig in 2021, that she was the only Hispanic woman to co-host a cable news morning show.? A quick Google search also taught me that Campos-Duffy is the granddaughter of Mexican immigrants.",
    "While there are many unifying concerns and priorities amongst the many Latinx communities, I still have to constantly remind people that the experiences of a Mexican-American voter in the Southwest are not likely to be comparable to those of an Afro-Latino voter in New Jersey.",
    "Her panelists were Shukri Abdirahman who is running in Minnesotas 5th Congressional district, Lisa Scheller from Pennsylvanias redrawn 7th Congressional district (that includes Allentown), and former chair of the Kansas GOP, congressional candidate Amanda Adkins.",
    "On Sunday Fox and Friends Weekend co-host Rachel Campos-Duffy spoke to three Republican, female, congressional candidates in order to highlight another year of the Republican Woman,? during which more than 50 GOP women have thrown their hats in the ring.",
    "Ill let fellow journalist Adrian Carrasquillos tweet from November 2020 summarize this sentiment: I realize some people want to tweet Latinos arent monolithic on election night like its some profound comment but I just cant do it anymore.",
    "But its difficult not to move from this moment to the recent reveal that some white people have benefited and profited from taking on a fake Latinx/Hispanic identity basically stealing opportunities from those who actually deserved them.",
    "After first asking questions of Abdirahman (who was born in Somalia and whose last name she struggled to pronounce) about how being a single mom has impacted her politics, the host turned her attention to Adkins.",
    "Well,? she said, Im not a Hispanic, but I am in a super-competitive district.?\nAll four women were on camera at the time, and Campos-Duffy seems to look down at her notes for a brief second when she hears this.",
    "Tell me, why youre running and why you think Hispanics are so dissatisfied with the country right now and the policies coming from the Democrat Party ??\nAdkins smiled.",
    "Then theres the other maddening aspect of how those of us who are Latinas are constantly asked to speak about the Latinx voting block as a monolith.",
    "(I also realized why she looked a bit familiar: She started out her TV career as one of the cast members in MTVs The Real World San Francisco.)",
    "At no point do the panelists answer Campos-Duffys question about how Hispanic voters are fleeing? the Democrat? party.",
    "Adkins is to be credited for immediately correcting the host rather than dancing around the misidentification.",
    "But the fact that she is Latina makes this particular moment a little more uncomfortablegiving me pena ajena.",
    "Plus, I should confess that Im not super familiar with many TV personalities across cable news channels.",
    "As if we have some mythical unified vision, as opposed to being as individual and diverse as any group.",
    "Im not saying that just because Campos-Duffy is Latina, she should never make a mistake like this.",
    "This means that not only didnt I recognize the host in this clip, I didnt even know her name.",
    "Fox host this morning to GOP Congress candidate (KS) Amanda Adkins: Amanda, you are Hispanic.",
    "If youre looking for an awkward facepalm emoji moment on cable news, Ive got one for you.",
    "No surprise from these polls, Hispanics are fleeing the Democrat Party.",
    "First, I have to admit that Ive never watched Fox and Friends Weekend.",
    "Some are Latinas and many are running for office the first time.",
    "Tell me, why do you think Hispanics are so dissatisfied?",
    "And it will make my fellow Latinos cringe even more.",
    "In many ways, weve seen versions of this before.",
    "(You can watch this uncomfortable moment here.)",
    "Meanwhile, fellow panelist Scheller chuckles.",
    "Not that Adkins did such a thing!",
    "Of course, we all make mistakes."
  ]
}