{
  "id": 7181,
  "mediaId": 223,
  "date": "d2022-03-09T14:30",
  "headline": "Elise Stefanik's E-PAC Announces Endorsements with Bid to Elect GOP Women in Historic Numbers",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/152/5b2a1954-4cd7-4abb-96db-22a48fd75ea5.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/03/09/elise-stefaniks-epac-announces-women-to-watch-and-rising-star-endorsements-n2604328",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    888,
    1095,
    1335,
    1447,
    2216,
    5168,
    5251,
    5447,
    422,
    428,
    562
  ],
  "sentences": [
    "Those fully endorsed 2022 E-PAC candidates include:\nEsther Joy King (IL-17)\nAmanda Adkins (KS-03)\nKaroline Leavitt (NH-01)\nApril Becker (NV-03)\nLisa Scheller (PA-07)\nMonica De La Cruz (TX-15)\nJen Kiggans (VA-02)\nJeanine Lawson (VA-10)\nTanya Contreras Wheeless (AZ-04)\nAnna Paulina Luna (FL-13)\nErin Houchin (IN-09)\nAnnie Black (NV-04)\nLiz Joy (NY-20)\nMadison Gesiotto Gilbert (OH-13)\nLori Chavez-DeRemer (OR-05)\nMorgan Ortagus (TN-05)\nCassy Gracia (TX-28)\nMayra Flores (TX-34)\nE-PAC also released a list of \"Women to Watch,\" including:\nJan Kulmann (CO-08)\nBarbara Kirkmeyer (CO-08)\nCatalina Lauf (IL-11)\nCassandra Tanner Miller (IL-11)\nRegan Deering (IL-13)\nTheresa Gavarone (OH-09)\nJessica De La Cruz (RI-02)\nKalena Bruce (MO-04)\nSarah Walsh (MO-04)\nYesli Vega (VA-07)\nTownhall got in touch with one of those women, Jan Kulmann, mayor of Thornton, Colorado.",
    "Scott Applewhite\nOn Tuesday, Rep. Elise Stefanik (R-NY), who represents New York's 21st district and chairs the House Republican Conference, announced that through E-PAC, she has now endorsed a total of 18 Republican women running for office in key battleground districts.",
    "It's clear there is no shortage of all-star Republican women this cyclewe have a record-shattering 260+ Republican women who are already running for Congress, which surpasses our record in 2020 during the historic 'Year of the Republican Woman,'\" said Stefanik.",
    "Even with the edge that Democrats have been given in redistricting, Republicans are still favored to take control of the House following the November midterm elections, which Democrats currently narrowly control by single digits.",
    "\"It is humbling to have Chairwoman Stefanik recognize the work that we're putting in to elect a conservative outsider to this new Congressional District,\" she said in a statement to Townhall.",
    "Further, polling indicates that Biden's approval ratings are faring particularly badly, and Democrats are seeing quite the amount of retirements, with over 30 members now.",
    "\"We have strong Republican women running from Florida, to Indiana, to Arizona, to Oregon in top battleground districts that will determine the House majority.\"",
    "In 2019, following the midterm losses from 2018, only 13 Republican women served in the House, accounting for 2.9 percent, leading Stefanik to found E-PAC.",
    "They want an outsider who will fight to restore America's energy independence, get our spending under control, and ensure the safety of our communities.",
    "\"I'm thrilled to add to E-PAC's impressive slate of Republican women candidates by officially endorsing nine more Rising Star GOP women for Congress.",
    "In 2020, E-PAC helped more than double the number of GOP women in Congress in what President Trump called 2020 \"The Year of the Republican Women.\"",
    "Stefanik added, \"I look forward to supporting these Rising Stars across the finish line in both their primaries and general elections.",
    "GOP women made history in 2020, and in 2022, Republican women are leading the Red Tsunami to Fire Nancy Pelosi once and for all.\"",
    "As I covered last July, 127 Republican women indicated at that time that they were running for House seats, a record-high.",
    "The GOP could be looking at a red wave, with a record-high of Republican women serving in the House contributing to it.",
    "\"Joe Biden and Nancy Pelosi's reckless spending and radical far-left agenda are hurting hard-working Coloradans.",
    "It's past time to bring common-sense conservative values to the U.S. House of Representatives.\"",
    "The president's party almost always loses seats in Congress during his first midterm election.",
    "While Republicans did not regain control of the House in 2020, they did exceed expectations.",
    "Eleven out of the 15 seats that flipped red were won by E-PAC endorsed Republican women.",
    "That's why we are giving this race everything we've got  there is a lot on the line.",
    "These endorsements come as more district maps have been redrawn for redistricting.",
    "There are now 31 Republican women serving in the House.",
    "Working Coloradans are tired of career politicians.",
    "That number is now double, at over 260 women.",
    "Source: AP Photo/J."
  ]
}