{
  "id": 9273,
  "mediaId": 2572,
  "date": "2022-03-24",
  "headline": "2022 shaping up to be another banner year for Republican women, candidates say",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/06/Rep.-Maria-Elvira-Salazar-R-Fla..jpg",
  "link": "https://www.foxnews.com/politics/2022-shaping-up-to-be-another-banner-year-for-republican-women-candidates-say",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5791,
    4396,
    5388,
    5234,
    392,
    741,
    1433,
    1126,
    6697
  ],
  "sentences": [
    "\"We’re going to have another record setting year for Hispanic women joining the Republican Party because the radical left is out of touch with what concerns women most - the fact that a dollar can’t go as far as it used to two years ago,\" Alexis Martinez Johnson, a Republican candidate for New Mexico's 3rd Congressional District, told Fox News Digital.",
    "‘YEAR OF REPUBLICAN WOMEN’: MCCARTHY CELEBRATES HOUSE WINS FROM FLORIDA TO CALIFORNIA\n\"President Trump’s leadership inspired Americans of all walks of life to help take our country back,\" Jennifer Carnahan, a candidate for Minnesota's 1st Congressional District in a special election this year, told Fox News Digital.",
    "JIM HAGEDORN'S WIDOW, JENNIFER CARNAHAN, ANNOUNCES RUN FOR HIS OPEN HOUSE SEAT\n\"Since then, the policies of the Biden Administration and Democrat-controlled Congress have been disastrous, especially economically,\" Ramirez added.",
    "After Republican women set a record in Congress in the 2020 elections, the 2022 midterm elections are shaping up to deliver another \"Year of Republican Women,\" Republican operatives and candidates say.",
    "\"I’m incredibly proud of the work we have done with Maggie’s List to get resolute conservative women elected across the country,\" Wendy Gade, co-chair of the Virginia chapter, told Fox News Digital.",
    "\"Eleven of the 15 seats that Republicans flipped from blue to red in 2020 were taken by women,\" Tina Ramirez, Virginia chair of Maggie's List and a candidate for state senate, told Fox News Digital.",
    "Maggie's List, a political action committee dedicated to increasing the number of conservative women elected to federal public office, has endorsed more than 50 female GOP candidates so far.",
    "\"We saw just last year in Virginia Winsome Sears, who I nominated for Maggie’s List endorsement, become Lieutenant Governor and a huge swing in women voters to the right.",
    "\"In New Mexico and across the nation, families are hurting, that’s why women are turning to the Republican Party,\" Martinez Johnson added.",
    "\"Now these women are quickly becoming the face of the Republican Party, and inspiring many, many more to run themselves,\" Carnahan added.",
    "Maggie's List takes its name from Margaret Chase Smith, a Republican who was the first woman elected to both houses of Congress.",
    "\"At Maggie’s List, we have endorsed over 50 terrific GOP women candidates for the Midterms with more still to come,\" she said.",
    "\"Women are now leading the charge to take back the House, put a check on Joe Biden’s failing agenda, and save our nation.\"",
    "Thirty-two Republican women won election to Congress in 2020, surpassing the record of 30 Republican women set in 2006.",
    "\"I believe victories by Republican women running for Congress will absolutely be the story of this election cycle.\"",
    "With these conditions, I think it’s safe to say Republican women are due for another record setting year.\"",
    "\"The women are all amazing leaders and I am thrilled to work to get them all elected.\"",
    "\"Among those are many women who finally stood up and ran for office, myself included.\"",
    "\"Our families cannot thrive under Joe Biden’s crippling inflation.\""
  ]
}