[
  {
    "id": 4909,
    "mediaId": 2662,
    "date": "2022-02-13",
    "sentence": "According to Conservative Brief — <span class='selected-term'>Dave McCormick</span> was the CEO of Bridgewater Associates, the largest hedge fund in the world with assets worth at least $150 billion, from 2020 until January of this year.",
    "author": "Jim Hoft",
    "title": "MUST SEE: GOP Candidate Releases ‘Let’s Go Brandon’ Commercial During the Super Bowl (VIDEO)"
  },
  {
    "id": 6013,
    "mediaId": 2522,
    "date": "2022-02-13",
    "sentence": "",
    "author": "Joshua Nybo",
    "title": "Penn. Senate candidate to run ‘Let’s Go Brandon’ ad during Super Bowl to highlight Biden failings"
  },
  {
    "id": 821,
    "mediaId": 2934,
    "date": "2022-04-15",
    "sentence": "Amid nationwide protests after George Floyd’s murder in 2020, <span class='selected-term'>Dave McCormick</span>, then CEO of a hedge fund, emailed his colleagues, calling on them to “be agents of change” and to show “solidarity by denouncing and eradicating structural bigotry around us.”\nA new ad from a super PAC supporting McCormick’s chief rival in the Republican primary for U.S. Senate in Pennsylvania cites that email as evidence that “McCormick’s woke Connecticut hedge fund supported Black Lives Matter.” But the letter did not mention Black Lives Matter, and it expressed concern not only about racial discrimination and bigotry, but also about “rioting and destruction on city streets across the country.”\nMcCormick campaign spokesperson Jess Szymanski told us that “like President Trump and others,” McCormick was merely “a leader who provided reflections following the death of George Floyd,” and that “Dave never supported BLM and has always stood with law enforcement as a strong law and order candidate.”\nThere’s little mystery why McCormick’s opponents would want to tie him to the Black Lives Matter movement.",
    "author": "Robert Farley",
    "title": "McCormick’s Denouncement of ‘Structural Bigotry’ Not an Endorsement of BLM"
  }
]