[
  {
    "id": 6364,
    "mediaId": 2658,
    "date": "2022-01-12",
    "sentence": "MCCORMICK MAGA-PROOFS HIS SENATE CAMPAIGN AFTER DISSING TRUMP — Our Holly Otterbein and Natalie Allison: “<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an “America First” mindset.",
    "author": "",
    "title": "Powell's path to maximum employment? Price stability"
  },
  {
    "id": 6376,
    "mediaId": 2658,
    "date": "2022-01-18",
    "sentence": "In the crowded race to replace retiring Sen. Pat Toomey (R-Pa.), conservative commentator Kathy Barnette came in second place, while the poll showed hedge fund executive <span class='selected-term'>Dave McCormick</span> in third place.",
    "author": "",
    "title": "Governors get in on redistricting"
  },
  {
    "id": 6769,
    "mediaId": 6526,
    "date": "2022-01-25",
    "sentence": "“It’s not often a U.S. senator from Texas comes to the Lehigh Valley,” Jonathan DelCollo of Reading said, referring to guest speaker Ted Cruz, who was there to support fellow Republican <span class='selected-term'>Dave McCormick</span>’s bid for Pat Toomey’s soon-to-be-vacated Senate seat.",
    "author": "Andrew Scott",
    "title": "‘The country looks to Pennsylvania’: Ted Cruz rallies in the Lehigh Valley to kick off candidate’s bid to replace Sen. Pat Toomey"
  },
  {
    "id": 6357,
    "mediaId": 2572,
    "date": "2022-01-25",
    "sentence": "And I think I'll be interviewing <span class='selected-term'>Dave McCormick</span> as well in the coming days.",
    "author": "Fox News Staff",
    "title": "'The Ingraham Angle' on COVID restrictions and children"
  },
  {
    "id": 6486,
    "mediaId": 2590,
    "date": "2022-01-29",
    "sentence": "“You have a chance today to put fear into the heart of Dr. Oz, and <span class='selected-term'>Dave McCormick</span>, and that whole cast of characters because they don’t want to run against Conor Lamb,” he said, referring to the top two candidates seeking the Republican Senate nomination.",
    "author": "Daniel Marans",
    "title": "Pennsylvania Democrats Decline To Endorse In Senate Primary"
  },
  {
    "id": 6382,
    "mediaId": 2658,
    "date": "2022-01-30",
    "sentence": "Fetterman took second place, garnering 23 percent of ballots.”\n— Another GOP straw poll goes poorly for MEHMET OZ: Republican Senate candidate <span class='selected-term'>DAVE MCCORMICK</span> won the latest round of southwestern PA straw polls this weekend with the support of 35 members of the Republican State Committee — more three times as many as JEFF BARTOS who won 11.",
    "author": "",
    "title": "POLITICO Playbook: Trump floats pardons for Jan. 6 defendants"
  },
  {
    "id": 6378,
    "mediaId": 2658,
    "date": "2022-01-31",
    "sentence": "— Pennsylvania Republican Mehmet Oz is up with a new ad attacking <span class='selected-term'>Dave McCormick</span> as “China’s friend, not ours.” Oz and McCormick are two of the many Republicans running for Senate.",
    "author": "",
    "title": "The FEC reports we can’t wait to see"
  },
  {
    "id": 6549,
    "mediaId": 2662,
    "date": "2022-01-31",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "Cassandra Fairbanks",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 6522,
    "mediaId": 6571,
    "date": "2022-01-31",
    "sentence": "In her race for the Senate, Barnette calls her three fellow Republicans who recently moved into the state to run – <span class='selected-term'>Dave McCormick</span>, Carla Sands and Mehmet Oz – \"carpetbaggers,\" and then she adds, \"We don't need to send another rich person to D.C. to represent our interests.",
    "author": "",
    "title": "Kathy Barnette Hopes To Become US Senate's First Black Republican Woman"
  },
  {
    "id": 6666,
    "mediaId": 2748,
    "date": "2022-02-01",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "STATION GOSSIP",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 6132,
    "mediaId": 2918,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Natalie Winters",
    "title": "A Dominion Voting Systems Rep is Sponsoring a Republican Senate Campaign Fundraiser."
  },
  {
    "id": 5706,
    "mediaId": 2883,
    "date": "2022-02-02",
    "sentence": "Former hedge fund CEO <span class='selected-term'>Dave McCormick</span> entered the race last month, so he won’t be required to file a disclosure form until April.",
    "author": "Stephanie Akin\nKate Ackley\nRyan Kelly\nMary Ellen McIntire",
    "title": "5 takeaways from the latest fundraising disclosures"
  },
  {
    "id": 5625,
    "mediaId": 2702,
    "date": "2022-02-03",
    "sentence": "No crowd-clearing candidate has yet risen to the top in Republicans’ regional caucuses and no endorsement is anticipated to be granted at this weekend’s state party confab, but businessman <span class='selected-term'>Dave McCormick</span> and former lieutenant governor candidate Jeff Bartos have emerged with the most momentum, while Mehmet Oz looks to capitalize on his celebrity status.",
    "author": "Tal Axelrod",
    "title": "Pennsylvania’s high-profile race for Senate begins to take shape"
  },
  {
    "id": 5485,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "Ron DeSantis’ PAC and into Honor Pennsylvania, a super PAC backing fellow hedge funder <span class='selected-term'>Dave McCormick</span> — and opposing celebrity physician Mehmet Oz — in Pennsylvania’s GOP Senate primary, making Griffin the biggest individual donor to those two groups so far.",
    "author": "",
    "title": "The Republican megadonor funding the party’s 2022 hopes"
  },
  {
    "id": 5936,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "Ron DeSantis’ PAC and into Honor Pennsylvania, a super PAC backing fellow hedge funder <span class='selected-term'>Dave McCormick</span> — and opposing celebrity physician Mehmet Oz — in Pennsylvania’s GOP Senate primary, making Griffin the biggest individual donor to those two groups so far.”\n— “The massive national investment by Griffin, a longtime Republican megadonor who has sharply increased his political donations in recent years, positions him to be one of the biggest forces in the GOP’s drive to retake Congress in 2022.",
    "author": "",
    "title": "Which Democrats K Street is fundraising for"
  },
  {
    "id": 5454,
    "mediaId": 2572,
    "date": "2022-02-04",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> said that the state's working families \"are being terribly damaged by the policies of the Biden administration\" Friday on \"The Story with Martha MacCallum.\"",
    "author": "",
    "title": "Working families 'being terribly damaged' by the Biden administration: Dave McCormick"
  },
  {
    "id": 5583,
    "mediaId": 2658,
    "date": "2022-02-05",
    "sentence": "Sarah Huckabee Sandersshowed up to support Pennsylvania Senate hopeful <span class='selected-term'>Dave McCormick</span> at the Keystone State’s Republican State Central Committee meeting.",
    "author": "",
    "title": "POLITICO Playbook: RNC does Trump’s bidding, frustrating its members"
  },
  {
    "id": 6080,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "“If you think about the kind of people we need, we need people that actually understand and can put forward a tough-minded set of policies with China and that’s what I’ll do.”\nMs. Szymanski, the McCormick campaign spokeswoman, said Dr. Oz “has been silent on China until he needed to knock down Dave’s credentials.”\n“<span class='selected-term'>Dave McCormick</span> fought for the United States of America in combat,” she said.",
    "author": "Dave Boyer",
    "title": "Oz, McCormick trade pro-China barbs in Pa. Senate race, show Trump’s imprint on GOP"
  },
  {
    "id": 5675,
    "mediaId": 2644,
    "date": "2022-02-09",
    "sentence": "“Strong borders can only be achieved with strong leadership and <span class='selected-term'>Dave McCormick</span> embodies the kind of strength needed to uphold the rule of law,” National Border Patrol Council president Brandon Judd said in a statement distributed by McCormick’s campaign.",
    "author": "Steven Nelson",
    "title": "Border Patrol union backs Pennsylvania GOP Senate contender McCormick"
  },
  {
    "id": 6013,
    "mediaId": 2522,
    "date": "2022-02-13",
    "sentence": "",
    "author": "Joshua Nybo",
    "title": "Penn. Senate candidate to run ‘Let’s Go Brandon’ ad during Super Bowl to highlight Biden failings"
  },
  {
    "id": 4909,
    "mediaId": 2662,
    "date": "2022-02-13",
    "sentence": "According to Conservative Brief — <span class='selected-term'>Dave McCormick</span> was the CEO of Bridgewater Associates, the largest hedge fund in the world with assets worth at least $150 billion, from 2020 until January of this year.",
    "author": "Jim Hoft",
    "title": "MUST SEE: GOP Candidate Releases ‘Let’s Go Brandon’ Commercial During the Super Bowl (VIDEO)"
  },
  {
    "id": 5139,
    "mediaId": 2781,
    "date": "2022-02-14",
    "sentence": "Republican candidate for U.S. Senate in Pennsylvania <span class='selected-term'>Dave McCormick</span> is running a “Let’s go Brandon” Super Bowl ad Sunday, highlighting the “self-inflicted” problems facing President Biden and his administration.",
    "author": "Fox News",
    "title": "WATCH: Senate Hopeful Torches Biden’s Super Bowl-Sized Fails in ‘Let’s Go Brandon’ Ad"
  },
  {
    "id": 4804,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "Watch us stand up to Joe Biden below: #PASen https://t.co/vMqEcQEAqX\n— <span class='selected-term'>Dave McCormick</span> (@DaveMcCormickPA) February 14, 2022",
    "author": "Valerie Richardson",
    "title": "‘Let’s Go, Brandon’ ad airs during Super Bowl in Pennsylvania"
  },
  {
    "id": 5252,
    "mediaId": 2533,
    "date": "2022-02-14",
    "sentence": "Republican candidate for U.S. Senate in Pennsylvania <span class='selected-term'>Dave McCormick</span> is the person behind creating the “Let’s go Brandon” ad.",
    "author": "",
    "title": "‘Let’s Go, Brandon’: Senate Candidate Hits Biden With Brilliant Super Bowl Ad"
  },
  {
    "id": 4617,
    "mediaId": 2641,
    "date": "2022-02-14",
    "sentence": "Pennsylvania GOP Senate candidate <span class='selected-term'>Dave McCormick</span> ran a “Let’s go, Brandon!” Super Bowl campaign ad within his state, listing some of Biden’s losses since taking office, using actual headlines, including:\nInflation a record high;\nThe fiasco in Afghanistan is a grave blow;\nBig Tech silencing conservative voices;\nU.S. trade deficit hits record high;\nOn pace to surpass record for annual homicides; and,\nIllegal border crossings soar to record highs.",
    "author": "Michael Dorstewitz",
    "title": "The Supreme Court Will Disappoint Joe Biden on Gun Control"
  },
  {
    "id": 5309,
    "mediaId": 2716,
    "date": "2022-02-14",
    "sentence": "Longtime Republican bigwig and former hedge fund CEO <span class='selected-term'>Dave McCormick</span> once seemed to be at least Never-Trump adjacent, though perhaps not fully Never-Trump.",
    "author": "Joel Mathis",
    "title": "Trump lost, but his tactics keep on winning"
  },
  {
    "id": 5132,
    "mediaId": 2676,
    "date": "2022-02-14",
    "sentence": "On Sunday, Lamb tore into McCormick's ad over Twitter, writing: \"<span class='selected-term'>Dave McCormick</span> is too much of a coward to say 'Let's Go Brandon' himself, but pathetic enough to spend millions on a Super Bowl ad to say it for him.\"",
    "author": "Jon Skolnik",
    "title": "\"Let's Go Brandon\" ad airs during Super Bowl"
  },
  {
    "id": 4826,
    "mediaId": 2658,
    "date": "2022-02-14",
    "sentence": "Republican <span class='selected-term'>Dave McCormick</span>, who’s running in Pennsylvania’s Senate primary, brought the anti-Biden slogan “Let’s Go Brandon” to prime time on Sunday.",
    "author": "",
    "title": "Campaigns roll out Super Bowl ads"
  },
  {
    "id": 5043,
    "mediaId": 2745,
    "date": "2022-02-15",
    "sentence": "",
    "author": "",
    "title": "The Trailer: An L.A. billionaire's answer to 'defund the police': Run for mayor and hire more."
  },
  {
    "id": 5371,
    "mediaId": 2690,
    "date": "2022-02-15",
    "sentence": "A political ad for Pennsylvania Republican <span class='selected-term'>Dave McCormick</span>, who’s running for a seat in the US Senate, featured the popular “Let’s Go Brandon” chant that has taken the country by storm.",
    "author": "",
    "title": "Watch The ‘Let’s Go Brandon’ Commercial That Aired During The Super Bowl LVI"
  },
  {
    "id": 4571,
    "mediaId": 2658,
    "date": "2022-02-16",
    "sentence": "“The limited liability company, called 807080A, donated $100,000 on New Year’s Eve to Honor Pennsylvania Inc., which is supporting former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>’s effort in the race, according to a Federal Election Commission filing.”\n— “The LLC’s California address on that document is identical to the one listed on 990 tax forms for Kotick’s foundation, which is called the 803011 Foundation.",
    "author": "To the FARA Unit",
    "title": "To the FARA Unit, with love"
  },
  {
    "id": 5101,
    "mediaId": 2590,
    "date": "2022-02-17",
    "sentence": "Advertisement\nIn the contest for the GOP nomination, Oz has several rivals: Kathy Barnette, a conservative commentator; Jeff Bartos, a real estate developer who ran unsuccessfully for lieutenant governor; <span class='selected-term'>Dave McCormick</span>, a former hedge fund CEO; and Carla Sands, Donald Trump’s ambassador to Denmark.",
    "author": "Liz Skalka",
    "title": "Inside Dr. Oz's Campaign Road Show"
  },
  {
    "id": 5053,
    "mediaId": 2632,
    "date": "2022-02-17",
    "sentence": "The latter firm has contributed at least $100,000 funding Republican efforts, including a super PAC backing former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>, who is running for Pennsylvania's Senate seat in a GOP primary.",
    "author": "Brian Schwartz",
    "title": "Activision CEO Bobby Kotick Spent Big Money to Back GOP Campaigns Through Another LLC"
  },
  {
    "id": 5154,
    "mediaId": 2539,
    "date": "2022-02-17",
    "sentence": "The latter firm has contributed at least $100,000 funding Republican efforts, including a super PAC backing former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>, who is running for Pennsylvania’s Senate seat in a GOP primary.",
    "author": "Brian Schwartz",
    "title": "Activision CEO Bobby Kotick spent big money to back GOP campaigns through another LLC"
  },
  {
    "id": 4749,
    "mediaId": 2702,
    "date": "2022-02-17",
    "sentence": "“Perhaps if this debate was held in Connecticut or New Jersey, <span class='selected-term'>Dave McCormick</span> and Mehmet Oz would be inclined to attend and defend their records,” said Bartos.",
    "author": "Tal Axelrod",
    "title": "Oz, McCormick to skip Pennsylvania Republican Senate debate"
  },
  {
    "id": 4715,
    "mediaId": 2730,
    "date": "2022-02-18",
    "sentence": "— Holly Otterbein (@hollyotterbein) February 17, 2022\nPOLITICO's Holly Otterbein tweeted on Thursday that Senatorial candidate <span class='selected-term'>Dave McCormick</span> pulled out of a GOP debate for Monday, February 21, after he learned Dr. Mehmet Oz would not be attending.",
    "author": "Rebecca Downs",
    "title": "Out of State Candidates Refuse to Show Up for Senate GOP Debate in Key Battleground State"
  },
  {
    "id": 4552,
    "mediaId": 2572,
    "date": "2022-02-18",
    "sentence": "And the Oz campaign added that they were \"not aware of why <span class='selected-term'>Dave McCormick</span> decided to back out after committing\"\nNEW PUNCHES THROWN IN CHINA FISTFIGHT BETWEEN DR. OZ AND DAVID MCCORMICK\nThe McCormick campaign told Fox News that the former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official who entered the race last month \"is looking forward to debating.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania GOP Senate clash: Bartos takes aim at Oz, McCormick for skipping debate"
  },
  {
    "id": 4650,
    "mediaId": 2572,
    "date": "2022-02-24",
    "sentence": "The latter, <span class='selected-term'>Dave McCormick</span>, joins me now.",
    "author": "",
    "title": "'The Ingraham Angle' on Biden admin on the ropes"
  },
  {
    "id": 3640,
    "mediaId": 2572,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "PA Republican Senate candidate McCormick calls Putin 'tyrant' who 'needs to be kept in check'"
  },
  {
    "id": 3647,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "Oz is in a crowded GOP race that also includes top rivals such as <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Jeff Bartos, a real estate developer, philanthropist and the 2018 Republican nominee for lieutenant governor; and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump.",
    "author": "Paul Steinhauser",
    "title": "Dr. Oz says his celebrity 'a huge advantage' as he runs for Senate; says he's 'aligned' with GOP voters"
  },
  {
    "id": 3879,
    "mediaId": 2590,
    "date": "2022-02-26",
    "sentence": "Advertisement\nIn this 2022 photo combination shown are Republican Pennsylvania U.S. Senate candidates, <span class='selected-term'>Dave McCormick</span>, left and Mehmet Oz.",
    "author": "Jeff McMillan and Marc Levy",
    "title": "In Trans People, GOP Candidates Find Latest 'Wedge Issue'"
  },
  {
    "id": 3003,
    "mediaId": 2641,
    "date": "2022-03-11",
    "sentence": "Oz, a former heart surgeon, and former hedge fund CEO <span class='selected-term'>Dave McCormick</span> are the leaders in the Republican primary field.",
    "author": "Charlie McCarthy",
    "title": "Ted Nugent: Why I'm Endorsing Dr. Oz"
  },
  {
    "id": 3028,
    "mediaId": 2664,
    "date": "2022-03-14",
    "sentence": "Republicans have spent a record $35 million on TV ads in Pennsylvania, where frontrunners Mehmet Oz and <span class='selected-term'>Dave McCormick</span> are bashing one another as a “liberal RINO” and “Wall Street insider,” respectively, in attacks that could be used against them again in a general election.",
    "author": "Travis Gettys",
    "title": "Republicans 'kick the crap out of each other' in brutal primaries as Democrats sit back and watch"
  },
  {
    "id": 2986,
    "mediaId": 2658,
    "date": "2022-03-14",
    "sentence": "JOHN FETTERMAN and Rep. CONOR LAMB run ads arguing why they can win in one of the nation’s top battleground states, GOP candidates there have dropped a record-shattering $35 million on TV — the vast majority coming from MEHMET OZ and <span class='selected-term'>DAVE MCCORMICK</span>, the leading Republicans, whose camps are framing the other as a ‘liberal RINO’ and ‘Wall Street insider,’ respectively.”\n“‘They’re doing what I want them to do, which is kick the crap out of each other,’ said J.B. POERSCH, president of the Senate Majority PAC, Senate Democrats’ flagship super PAC.”\n— ICYMI (for all you watching this crazy Missouri primary …): “Schmitt raises $1.6M at Mar-a-Lago event, lands visit from Trump,” by Fox News’ Brooke Singman\nCHENEY’S GAMBIT — In 2007, the leftist crowd in Wyoming's liberal bastion of Jackson Hole dragged an effigy of DICK CHENEY through downtown in protest of the Iraq War.",
    "author": "",
    "title": "POLITICO Playbook: Something unusual is happening between Biden and Congress"
  },
  {
    "id": 3108,
    "mediaId": 2658,
    "date": "2022-03-14",
    "sentence": "John Fetterman and Rep. Conor Lamb run ads arguing why they can win in one of the nation’s top battleground states, GOP candidates there have dropped a record-shattering $35 million on TV — the vast majority coming from Mehmet Oz and <span class='selected-term'>Dave McCormick</span>, the leading Republicans, whose camps are framing the other as a “liberal RINO” and “Wall Street insider,” respectively.",
    "author": "",
    "title": "GOP Senate candidates thrash each other ahead of fight for majority"
  },
  {
    "id": 3335,
    "mediaId": 6570,
    "date": "2022-03-14",
    "sentence": "",
    "author": "Jonathan Tamari",
    "title": "Dave McCormick has dropped millions into Pa.'s U.S. Senate race, but it's hard to trace where it's coming from"
  },
  {
    "id": 3172,
    "mediaId": 2590,
    "date": "2022-03-16",
    "sentence": "In a heated campaign for an open Senate seat, Oz’s opponent, <span class='selected-term'>Dave McCormick</span>, called on Oz to renounce his dual citizenship and questioned why Oz didn’t serve in the U.S. military.",
    "author": "Liz Skalka",
    "title": "Mehmet Oz Says He'll Give Up Dual Citizenship If Elected To Senate"
  },
  {
    "id": 3266,
    "mediaId": 2660,
    "date": "2022-03-16",
    "sentence": "That includes physician and talk show host Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>, the former chief executive of the Bridgewater Associates hedge fund.",
    "author": "Tom Kertscher",
    "title": "No proof for Dr. Oz’s claim that Pa. GOP Senate rival Dave McCormick ‘paid for attacks’ on Trump"
  },
  {
    "id": 2778,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "Dr Oz had been under fire from a primary opponent, <span class='selected-term'>Dave McCormick</span>, who charged that he could not serve in the upper chamber of the US legislature if he held “dual loyalties”.",
    "author": "Andrew Feinberg",
    "title": "Dr Oz reverses course on keeping Turkish citizenship if elected to Senate"
  },
  {
    "id": 3614,
    "mediaId": 2540,
    "date": "2022-03-16",
    "sentence": "\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz said.",
    "author": "Alex Rogers and Michael Warren",
    "title": "Dr. Oz vows to renounce Turkish citizenship if elected to Senate"
  },
  {
    "id": 2955,
    "mediaId": 2702,
    "date": "2022-03-16",
    "sentence": "Senator for Pennsylvania I will only be a U.S. citizen.”\nThe announcement came after former hedge fund manager <span class='selected-term'>Dave McCormick</span>, Oz’s biggest primary rival, held a press call with Sen. Dan Sullivan (R-Alaska) on Oz’s dual citizenship.",
    "author": "Tal Axelrod",
    "title": "Oz says he will renounce Turkish citizenship if elected to Senate"
  },
  {
    "id": 2893,
    "mediaId": 2553,
    "date": "2022-03-16",
    "sentence": "And my failing RINO opponent <span class='selected-term'>Dave McCormick</span> is lying about me leaving the race after being exposed by Philly Inquirer.https://t.co/L0DgP6WMGC\n— Dr. Mehmet Oz (@DrOz) March 16, 2022\nOz’s linked a Philadelphia Inquirer article that claimed some of the donors helping McCormick to attack him are past donors of liberal Democrats, including Hillary Clinton’s 2016 presidential campaign.",
    "author": "Dillon Burroughs",
    "title": "‘I’m In To Win’: Dr. Oz Responds To Report Of TV Show Talks"
  },
  {
    "id": 2758,
    "mediaId": 2572,
    "date": "2022-03-16",
    "sentence": "(McCormick Senate campaign)\n\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz told Fox News.",
    "author": "Brooke Singman",
    "title": "Dr. Oz will renounce his Turkish citizenship if elected to Senate: 'I will only be a U.S. citizen'"
  },
  {
    "id": 2916,
    "mediaId": 2748,
    "date": "2022-03-17",
    "sentence": "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S. senator for Pennsylvania I will only be a U.S. citizen.”\nOz called the attacks from his primary opponent, <span class='selected-term'>Dave McCormick</span>, “bigoted,” likening it to a time when Americans rejected Jews and Catholics.",
    "author": "Blarp Blog",
    "title": "Dr. Oz Flip Flops on Turkish Citizenship, Now Says He Will Renounce It if Elected"
  },
  {
    "id": 3545,
    "mediaId": 2934,
    "date": "2022-03-17",
    "sentence": "A super PAC that supports Republican Pennsylvania Senate candidate <span class='selected-term'>Dave McCormick</span> has been flooding the airwaves in the Keystone State with ads attacking his opponent, cardiac surgeon and TV personality Dr. Mehmet Oz, as a “Hollywood liberal” and RINO, or Republican in Name Only.",
    "author": "Robert Farley",
    "title": "Ads Attacking Dr. Oz"
  },
  {
    "id": 2172,
    "mediaId": 2732,
    "date": "2022-03-19",
    "sentence": "He had just spent about an hour listening to Republican U.S. Senate candidate <span class='selected-term'>Dave McCormick</span> as he addressed several dozen people in a private room, talking about his qualifications and what separates him from the rest of the crowded primary field.",
    "author": "Paula Reed Ward",
    "title": "Republican U.S. Senate candidate Dave McCormick greets potential voters in Murrysville"
  },
  {
    "id": 2131,
    "mediaId": 2644,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Salena Zito",
    "title": "Why ex-hedge funder Dave McCormick is beating Dr. Oz in US Senate run"
  },
  {
    "id": 1981,
    "mediaId": 2553,
    "date": "2022-03-21",
    "sentence": "“No one actually believes that he was so offended by the content of these columns that he waited until he was running for senate in a Republican primary to disown them.”\n<span class='selected-term'>Dave McCormick</span>, the leading Republican candidate in the race, slammed Oz, saying in a statement that Oz “has a long public record and history of being enthusiastically anti-Second Amendment.”\n“He has supported red flag laws and sided with extreme left gun grabbers to try to take away guns from Americans,” McCormick’s campaign continued.",
    "author": "Ryan Saavedra",
    "title": "Articles Surface Featuring Dr. Oz’s Name On Byline That Cheer Clamping Down On Second Amendment Rights"
  },
  {
    "id": 2204,
    "mediaId": 2590,
    "date": "2022-03-23",
    "sentence": "The top contenders for the Republican nomination are former hedge fund executive <span class='selected-term'>Dave McCormick</span> and Mehmet Oz, a physician and former television personality.",
    "author": "Daniel Marans",
    "title": "Moderate Democrats Struggle To Take Off In Key Pennsylvania Races"
  },
  {
    "id": 2726,
    "mediaId": 2528,
    "date": "2022-03-25",
    "sentence": "Dina Powell McCormick and David McCormick\n <span class='selected-term'>Dave McCormick</span>, a Republican US Senate candidate from Pennsylvania, and his wife Dina Powell McCormick.",
    "author": "Kayla Epstein",
    "title": "21 DC power couples who have influenced politics together for years"
  },
  {
    "id": 1887,
    "mediaId": 2526,
    "date": "2022-03-25",
    "sentence": "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S. senator for Pennsylvania I will only be a U.S. citizen.”\nOz called the attacks from his primary opponent, <span class='selected-term'>Dave McCormick</span>, “bigoted,” likening it to when Americans rejected Jews and Catholics.",
    "author": "Paul Bois",
    "title": "Enes Kanter Freedom: Dr. Oz Works for Turkish ‘Dictator’ Erdogan"
  },
  {
    "id": 2156,
    "mediaId": 2660,
    "date": "2022-03-29",
    "sentence": "The race for the GOP nomination for an open U.S. Senate seat in Pennsylvania has been marked by attacks exchanged between two of the leading Republicans, Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>.",
    "author": "Tom Kertscher",
    "title": "Dr. Oz claimed that GOP Senate rival McCormick ‘bragged’ about offshoring jobs. That lacks evidence"
  },
  {
    "id": 2072,
    "mediaId": 2590,
    "date": "2022-03-30",
    "sentence": "Advertisement\nAt Wednesday’s forum, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> brought up Oz’s past columns that caution against fracking, which Oz’s campaign claims were actually authored by someone else.",
    "author": "Liz Skalka",
    "title": "Mehmet Oz Goes Full Climate Denial, Says Carbon Dioxide Isn't A Problem"
  },
  {
    "id": 2680,
    "mediaId": 2872,
    "date": "2022-03-30",
    "sentence": "There, disgraced TV physician Dr. Mehmet Oz is gunning hard to close a 9-point gap between himself and former George W. Bush administration official <span class='selected-term'>Dave McCormick</span>.",
    "author": "",
    "title": "Pennsylvania is ground zero for 2022’s ugliest Senate races"
  },
  {
    "id": 2149,
    "mediaId": 2630,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "GOP rivals pile on 'Dr. Oz' during forum for Pennsylvania Senate candidates"
  },
  {
    "id": 1911,
    "mediaId": 2526,
    "date": "2022-03-30",
    "sentence": "During the Pennsylvania Republican Senate primary debate forum, frontrunner <span class='selected-term'>Dave McCormick</span>, saying that everyone should be held accountable for their past statements, confronted the celebrity doctor about his anti-fracking history over the years on his shows and in columns he has written.",
    "author": "Jacob Bliss",
    "title": "Mehmet Oz Has Meltdown During Live Debate When Confronted With Record, Called ‘Liberal’"
  },
  {
    "id": 1171,
    "mediaId": 2660,
    "date": "2022-04-01",
    "sentence": "(Mostly True)\n<span class='selected-term'>Dave McCormick</span>: Campaign website\nMehmet Oz: Campaign website\nJeff Bartos: Campaign website\nCarla Sands: Campaign website\nGeorge Bochetto: Campaign website\nKathy Barnette: Campaign website\nJohn Fetterman: Campaign website\nConor Lamb: Campaign website\nMalcolm Kenyatta: Campaign website\nPennsylvania Capital-Star, \"An early guide to Pennsylvania’s 2022 Senate and governor’s primary election,\" March 15, 2022\nFox Business, \"Pennsylvania is home to most expensive Senate race in nation,\" March 24, 2022\nCity & State Pennsylvania, \"Endorsements in Pennsylvania’s U.S. Senate race keep stacking up,\" March 28, 2022\nPhiladelphia Inquirer, \"Where the Pennsylvania Democratic Senate candidates do and don't agree,\" March 7, 2022\nNew York Times, \"Dr. Oz’s Heritage Is Targeted as Rivals Vie for Trump Backing,\" March 18, 2022\nThe Hill, \"Pennsylvania Senate primaries get personal,\" March 28, 2022\nDaily Beast, \"Inside Dr. Oz’s Shameless Flip-Flop on Abortion,\" Dec. 7, 2021\nAssociated Press, \"Oz vows to renounce Turkish citizenship if elected senator,\" March 17, 2022\nPittsburgh Post-Gazette, \"For GOP Senate candidate Jeff Bartos, front-runners for the job aren’t true Pennsylvanians,\" March 22, 2022\nWOLF-TV, \"Republican Senate hopeful Carla Sands,\" March 27, 2022\nPhiladelphia Inquirer, \"George Bochetto launches Pa. Republican Senate campaign,\" March 4, 2022\nCook Political Report with Amy Walter, \"Pennsylvania Senate: Which Candidate Is the Primary Prescription for Republicans?\"",
    "author": "",
    "title": "The race for the Pennsylvania U.S. Senate seat: A guide"
  },
  {
    "id": 1150,
    "mediaId": 2572,
    "date": "2022-04-02",
    "sentence": "Celebrity physician-turned Senate candidate Dr. Mehmet Oz and several others at the conservative Pennsylvania Leadership Conference forum Saturday did not debate each other, but many took turns jabbing at <span class='selected-term'>Dave McCormick</span> over his wealth and alleged ties to China.",
    "author": "Thomas Phippen",
    "title": "Pennsylvania GOP Senate primary: Dr. Oz, other candidates swipe at absent McCormick during forum"
  },
  {
    "id": 1499,
    "mediaId": 2744,
    "date": "2022-04-03",
    "sentence": "Just In...\nPINE TOWNSHIP, Pennsylvania — When Sarah Sanders took center stage Wednesday night at an event for <span class='selected-term'>Dave McCormick</span>, a Republican primary candidate for the U.S. Senate, her entrance into the packed event space didn’t go as planned.",
    "author": "Salena Zito",
    "title": "Sarah Sanders emerges as a formidable advocate for Republican candidates on the campaign trail"
  },
  {
    "id": 1502,
    "mediaId": 2629,
    "date": "2022-04-05",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> opposes increasing the federal minimum wage and wants to keep it at its current level of $7.25 an hour, set in 2009, when it was raised from $6.55.",
    "author": "Josh Israel",
    "title": "Super-Rich GOP Senate Candidate Says Keep Minimum Wage At $7.25"
  },
  {
    "id": 1085,
    "mediaId": 2660,
    "date": "2022-04-06",
    "sentence": "The major Republican candidates are commentator Kathy Barnette, real estate developer Jeff Bartos, Philadelphia attorney George Bochetto, former hedge fund CEO <span class='selected-term'>Dave Mccormick</span>, physician and TV personality Dr. Mehmet Oz and Carla Sands, who served as President Donald Trump's ambassador to Denmark.",
    "author": "Tom Kertscher",
    "title": "\"John Fetterman's a self-described democratic socialist.\""
  },
  {
    "id": 1767,
    "mediaId": 2934,
    "date": "2022-04-06",
    "sentence": "Although Pennsylvania’s TV airwaves have been filled with ads from Republican candidates Mehmet Oz and <span class='selected-term'>Dave McCormick</span> attacking each other, the discourse on the air had been more civilized on the Democratic side.",
    "author": "Robert Farley",
    "title": "Pro-Lamb Super PAC Misfires in Attack Ad Against Fetterman"
  },
  {
    "id": 1509,
    "mediaId": 6570,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Julian Routh",
    "title": "GOP Senate candidate Dave McCormick sees Pennsylvania's natural gas as driver of state's economy"
  },
  {
    "id": 233,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Trump’s endorsement comes two days after a The Hill/Emerson College poll found Oz and hedge fund manager <span class='selected-term'>Dave McCormick</span> to be neck-and-neck ahead of the May 17 primary.",
    "author": "Katherine Huggins",
    "title": "Trump Backs Dr. Oz’s Pennsylvania Senate Bid, Cites Doc’s Diagnosis That He’s in ‘Extraordinary Health’ in Glowing Endorsement"
  },
  {
    "id": 1327,
    "mediaId": 2730,
    "date": "2022-04-09",
    "sentence": "A poll conducted by The Hill and Emerson College published this week showed Oz and his primary opponent <span class='selected-term'>Dave McCormick</span> being “neck-and-neck” among the Republican candidates.",
    "author": "Madeline Leesman",
    "title": "Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 536,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "The endorsement came after months of behind-the-scenes jockeying by Oz and another leading candidate in Pennsylvania, <span class='selected-term'>Dave McCormick</span>, a hedge fund executive.",
    "author": "Sarah Fortinsky",
    "title": "Trump endorses Mehmet Oz in Pennsylvania Senate race"
  },
  {
    "id": 775,
    "mediaId": 2572,
    "date": "2022-04-10",
    "sentence": "Dr. Mehmet Oz got that endorsement over <span class='selected-term'>Dave McCormick</span>, who had been trying to get it.",
    "author": "",
    "title": "'Fox News Sunday' on April 10, 2022"
  },
  {
    "id": 220,
    "mediaId": 2578,
    "date": "2022-04-10",
    "sentence": "Dr. Oz is currently in a tight primary race with <span class='selected-term'>Dave McCormick</span> a former hedge fund manager.",
    "author": "Jim Hoft",
    "title": "President Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 860,
    "mediaId": 2873,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration officials Hope Hicks and Stephen Miller by his side.",
    "author": "",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 107,
    "mediaId": 2621,
    "date": "2022-04-10",
    "sentence": "But that’s good enough for a close second place in a crowded Republican primary field, behind current frontrunner <span class='selected-term'>Dave McCormick</span> at 18 percent.",
    "author": "Joe DePaolo",
    "title": "Trump Beams About His Dr. Oz Endorsement at Rally: When You’re in TV for 18 Years, ‘That’s Like a Poll, That Means People Like You’"
  },
  {
    "id": 313,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "Sunday morning, the campaign of billionaire <span class='selected-term'>Dave McCormick</span> released a statement from Santorum who stated, \"I know Pennsylvania and I know conservatives.",
    "author": "Tom Boggioni",
    "title": "Rick Santorum bucks Trump over Pennsylvania Senate seat endorsement: report"
  },
  {
    "id": 235,
    "mediaId": 2512,
    "date": "2022-04-10",
    "sentence": "Sunday morning, the campaign of billionaire <span class='selected-term'>Dave McCormick</span> release a statement from Santorum who stated, \"I know Pennsylvania and I know conservatives.",
    "author": "Tom Boggioni",
    "title": "Rick Santorum bucks Trump over Pennsylvania Senate seat endorsement: report"
  },
  {
    "id": 572,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration official Hope Hicks by his side.",
    "author": "Zachary Petrizzo",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 179,
    "mediaId": 2512,
    "date": "2022-04-11",
    "sentence": "And Petrizzo notes that Trump, by endorsing Oz, has “ignited fury and ridicule among some of the loudest voices in Trumpworld.”\n“At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy’ America First’ Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump Administration official Hope Hicks by his side,” Petrizzo explains.",
    "author": "Alex Henderson",
    "title": "MAGA zealots throw a temper tantrum after Trump endorses Dr. Oz in Pennsylvania Senate race"
  },
  {
    "id": 570,
    "mediaId": 2676,
    "date": "2022-04-11",
    "sentence": "Oz faces a crowded field of primary opponents, including <span class='selected-term'>Dave McCormick</span>, a Republican former hedge fund executive and Republican businessman Jeff Bartos.",
    "author": "Jon Skolnik",
    "title": "Trump fans angered by his endorsement of Dr. Oz"
  },
  {
    "id": 911,
    "mediaId": 2629,
    "date": "2022-04-11",
    "sentence": "And Petrizzo notes that Trump, by endorsing Oz, has “ignited fury and ridicule among some of the loudest voices in Trumpworld.”\n“At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy’ America First’ Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump Administration official Hope Hicks by his side,” Petrizzo explains.",
    "author": "Alex Henderson",
    "title": "Trump Endorsement Of Dr Oz Enrages ‘MAGA’ Followers"
  },
  {
    "id": 260,
    "mediaId": 2740,
    "date": "2022-04-11",
    "sentence": "He is nearly even with former hedge fund manager <span class='selected-term'>Dave McCormick</span> with 17% support compared to 18% for Toomey, according to a new poll from The Hill and Emerson College.",
    "author": "Chelsey Cox",
    "title": "OnPolitics: POTUS asks Congress to ban sale and distribution of ghost guns"
  },
  {
    "id": 165,
    "mediaId": 2621,
    "date": "2022-04-11",
    "sentence": "When you’re in television for 18 years, that’s like a poll, that means people like you.”\nOz, whose political credentials don’t exactly align with other candidates Trump has backed in the past, is in a tight race with MAGA candidate <span class='selected-term'>Dave McCormick</span>.",
    "author": "Kipp Jones",
    "title": "Pennsylvania Conservatives Question Trump’s Endorsement of Dr. Oz: ‘What the Hell Was He Thinking?’"
  },
  {
    "id": 633,
    "mediaId": 2522,
    "date": "2022-04-11",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he’s the farthest thing from America First & he’d be very bad for PA https://t.co/kuTo4pp53U\n— Sean Parnell (@SeanParnellUSA) April 9, 2022\n<span class='selected-term'>Dave McCormick</span>, who is a former George W. Bush administration official and is married to Dina Powell, a former deputy national security adviser to Trump, was also in the running for his endorsement but did not get it even though he leads Oz, according to recent polls.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Conservatives react very badly to Donald Trump’s endorsement of Dr. Oz"
  },
  {
    "id": 241,
    "mediaId": 6571,
    "date": "2022-04-11",
    "sentence": "In addition to Oz, the other GOP candidates include Kathy Barnette, Jeff Bartos, George Bochetto, Sean Gale, <span class='selected-term'>Dave McCormick</span> and Carla Sands.",
    "author": "Jon Delano",
    "title": "Donald Trump endorses Mehmet Oz for US Senate in Pennsylvania"
  },
  {
    "id": 49,
    "mediaId": 2732,
    "date": "2022-04-12",
    "sentence": "On the Senate side, the front-runners appear to be two recent transplants: celebrity doctor Mehmet Oz, a long-time New Jersey resident, and hedge fund CEO <span class='selected-term'>Dave McCormick</span>, who relocated to Pittsburgh after living in Connecticut.",
    "author": "David Thornburgh",
    "title": "David Thornburgh: High stakes in Pa.'s primary races"
  },
  {
    "id": 215,
    "mediaId": 2621,
    "date": "2022-04-13",
    "sentence": "Conway has endorsed <span class='selected-term'>Dave McCormick</span> in the primary.",
    "author": "Michael Luciano",
    "title": "Laura Ingraham Hits Trump and Hannity for Endorsing Dr. Oz in Senate Race: ‘It Was a Mistake’"
  },
  {
    "id": 782,
    "mediaId": 2731,
    "date": "2022-04-13",
    "sentence": "Trending\nPro-China <span class='selected-term'>Dave McCormick</span> currently holds a narrow lead in the polls for the open U.S. Senate seat in Pennsylvania.",
    "author": "John and Andy Schlafly",
    "title": "Trump’s Wizardry in Oz Endorsement"
  },
  {
    "id": 641,
    "mediaId": 2522,
    "date": "2022-04-13",
    "sentence": "Ingraham was critical of the endorsement, calling it a “mistake.” She asked Conway, who endorsed Republican <span class='selected-term'>Dave McCormick</span> in Pennsylvania, if it was an error by Trump and Hannity to endorse Oz several times.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Laura Ingraham unafraid to hit Trump and Hannity for endorsing Dr. Oz: ‘I’ll say it…it was a mistake’"
  },
  {
    "id": 103,
    "mediaId": 2660,
    "date": "2022-04-15",
    "sentence": "Meta, <span class='selected-term'>Dave McCormick</span> \"Mehmet Oz wants to take away your guns\" ad, started running April 4 to April 12, 2022\nEmail, Dave McCormick campaign spokesperson Jess Szymanski, April 11, 2022\nLevittownNow.com, \"Senate Candidate Mehmet Oz Stops In Lower Bucks County,\" Feb. 21, 2022\nWashington Examiner, \"Dr. Oz: Q&A: Why is America's health ranking so poor?",
    "author": "Tom Kertscher",
    "title": "In Pa. Senate run, Dr. Oz casts self as pro-Second Amendment, but he has backed gun-control measures"
  },
  {
    "id": 821,
    "mediaId": 2934,
    "date": "2022-04-15",
    "sentence": "Amid nationwide protests after George Floyd’s murder in 2020, <span class='selected-term'>Dave McCormick</span>, then CEO of a hedge fund, emailed his colleagues, calling on them to “be agents of change” and to show “solidarity by denouncing and eradicating structural bigotry around us.”\nA new ad from a super PAC supporting McCormick’s chief rival in the Republican primary for U.S. Senate in Pennsylvania cites that email as evidence that “McCormick’s woke Connecticut hedge fund supported Black Lives Matter.” But the letter did not mention Black Lives Matter, and it expressed concern not only about racial discrimination and bigotry, but also about “rioting and destruction on city streets across the country.”\nMcCormick campaign spokesperson Jess Szymanski told us that “like President Trump and others,” McCormick was merely “a leader who provided reflections following the death of George Floyd,” and that “Dave never supported BLM and has always stood with law enforcement as a strong law and order candidate.”\nThere’s little mystery why McCormick’s opponents would want to tie him to the Black Lives Matter movement.",
    "author": "Robert Farley",
    "title": "McCormick’s Denouncement of ‘Structural Bigotry’ Not an Endorsement of BLM"
  },
  {
    "id": 720,
    "mediaId": 2680,
    "date": "2022-04-18",
    "sentence": "",
    "author": "MICHAEL RUBINKAM",
    "title": "Pa. Senate candidate McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 639,
    "mediaId": 2801,
    "date": "2022-04-18",
    "sentence": "",
    "author": "MICHAEL RUBINKAM",
    "title": "Pa. Senate candidate McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 674,
    "mediaId": 2732,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Associated Press",
    "title": "Pa. Senate candidate Dave McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 547,
    "mediaId": 2539,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania’s Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz has close ties to the wealthy du Pont family heirs, and they’re backing his GOP bid for Pennsylvania’s Senate seat"
  },
  {
    "id": 377,
    "mediaId": 2632,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania's Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz Has Close Ties to the Wealthy Du Pont Family Heirs, and They're Backing His GOP Bid for Pennsylvania's Senate Seat"
  },
  {
    "id": 194,
    "mediaId": 2660,
    "date": "2022-04-19",
    "sentence": "RELATED: No proof for Dr. Oz’s claim that Pa. GOP Senate rival <span class='selected-term'>Dave McCormick</span> ‘paid for attacks’ on Trump\nRELATED: In Pa. Senate run, Dr. Oz casts self as pro-Second Amendment, but he has backed gun-control measures\nRELATED: 2022 candidates use ads vowing to be tough on China, or attacking rivals as too soft on China",
    "author": "Tom Kertscher",
    "title": "Dr. Oz misses the facts in calling GOP Senate rival McCormick liberal and supportive of Biden, China"
  },
  {
    "id": 69,
    "mediaId": 6571,
    "date": "2022-04-19",
    "sentence": "Donald Trump or <span class='selected-term'>Dave McCormick</span>?",
    "author": "Jon Delano",
    "title": "David McCormick reacts to Trump's endorsement of Mehmet Oz and denies shipping jobs to China"
  },
  {
    "id": 530,
    "mediaId": 2539,
    "date": "2022-04-22",
    "sentence": "AP Photos\nWall Street executives are pouring millions of dollars into the Republican primary race for Pennsylvania’s open U.S. Senate seat — where veteran physician Dr. Mehmet Oz and former Bridgewater CEO <span class='selected-term'>Dave McCormick</span> lead in the polls — making the primary one of the most expensive in the 2022 midterm elections.",
    "author": "Brian Schwartz",
    "title": "Pennsylvania’s GOP Senate primary draws backing from some of Wall Street’s biggest billionaires, making it one of the most expensive midterm races"
  }
]