[
  {
    "id": 6549,
    "mediaId": 2662,
    "date": "2022-01-31",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "Cassandra Fairbanks",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 6666,
    "mediaId": 2748,
    "date": "2022-02-01",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "STATION GOSSIP",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 6080,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "“If you think about the kind of people we need, we need people that actually understand and can put forward a tough-minded set of policies with China and that’s what I’ll do.”\nMs. Szymanski, the McCormick campaign spokeswoman, said Dr. Oz “has been silent on China until he needed to knock down Dave’s credentials.”\n“<span class='selected-term'>Dave McCormick</span> fought for the United States of America in combat,” she said.",
    "author": "Dave Boyer",
    "title": "Oz, McCormick trade pro-China barbs in Pa. Senate race, show Trump’s imprint on GOP"
  },
  {
    "id": 3640,
    "mediaId": 2572,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "PA Republican Senate candidate McCormick calls Putin 'tyrant' who 'needs to be kept in check'"
  },
  {
    "id": 3335,
    "mediaId": 6570,
    "date": "2022-03-14",
    "sentence": "",
    "author": "Jonathan Tamari",
    "title": "Dave McCormick has dropped millions into Pa.'s U.S. Senate race, but it's hard to trace where it's coming from"
  },
  {
    "id": 3266,
    "mediaId": 2660,
    "date": "2022-03-16",
    "sentence": "That includes physician and talk show host Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>, the former chief executive of the Bridgewater Associates hedge fund.",
    "author": "Tom Kertscher",
    "title": "No proof for Dr. Oz’s claim that Pa. GOP Senate rival Dave McCormick ‘paid for attacks’ on Trump"
  },
  {
    "id": 3614,
    "mediaId": 2540,
    "date": "2022-03-16",
    "sentence": "\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz said.",
    "author": "Alex Rogers and Michael Warren",
    "title": "Dr. Oz vows to renounce Turkish citizenship if elected to Senate"
  },
  {
    "id": 2156,
    "mediaId": 2660,
    "date": "2022-03-29",
    "sentence": "The race for the GOP nomination for an open U.S. Senate seat in Pennsylvania has been marked by attacks exchanged between two of the leading Republicans, Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>.",
    "author": "Tom Kertscher",
    "title": "Dr. Oz claimed that GOP Senate rival McCormick ‘bragged’ about offshoring jobs. That lacks evidence"
  },
  {
    "id": 69,
    "mediaId": 6571,
    "date": "2022-04-19",
    "sentence": "Donald Trump or <span class='selected-term'>Dave McCormick</span>?",
    "author": "Jon Delano",
    "title": "David McCormick reacts to Trump's endorsement of Mehmet Oz and denies shipping jobs to China"
  },
  {
    "id": 194,
    "mediaId": 2660,
    "date": "2022-04-19",
    "sentence": "RELATED: No proof for Dr. Oz’s claim that Pa. GOP Senate rival <span class='selected-term'>Dave McCormick</span> ‘paid for attacks’ on Trump\nRELATED: In Pa. Senate run, Dr. Oz casts self as pro-Second Amendment, but he has backed gun-control measures\nRELATED: 2022 candidates use ads vowing to be tough on China, or attacking rivals as too soft on China",
    "author": "Tom Kertscher",
    "title": "Dr. Oz misses the facts in calling GOP Senate rival McCormick liberal and supportive of Biden, China"
  }
]