[
  {
    "id": 6769,
    "mediaId": 6526,
    "date": "2022-01-25",
    "sentence": "“It’s not often a U.S. senator from Texas comes to the Lehigh Valley,” Jonathan DelCollo of Reading said, referring to guest speaker Ted Cruz, who was there to support fellow Republican <span class='selected-term'>Dave McCormick</span>’s bid for Pat Toomey’s soon-to-be-vacated Senate seat.",
    "author": "Andrew Scott",
    "title": "‘The country looks to Pennsylvania’: Ted Cruz rallies in the Lehigh Valley to kick off candidate’s bid to replace Sen. Pat Toomey"
  },
  {
    "id": 6522,
    "mediaId": 6571,
    "date": "2022-01-31",
    "sentence": "In her race for the Senate, Barnette calls her three fellow Republicans who recently moved into the state to run – <span class='selected-term'>Dave McCormick</span>, Carla Sands and Mehmet Oz – \"carpetbaggers,\" and then she adds, \"We don't need to send another rich person to D.C. to represent our interests.",
    "author": "",
    "title": "Kathy Barnette Hopes To Become US Senate's First Black Republican Woman"
  },
  {
    "id": 6378,
    "mediaId": 2658,
    "date": "2022-01-31",
    "sentence": "— Pennsylvania Republican Mehmet Oz is up with a new ad attacking <span class='selected-term'>Dave McCormick</span> as “China’s friend, not ours.” Oz and McCormick are two of the many Republicans running for Senate.",
    "author": "",
    "title": "The FEC reports we can’t wait to see"
  },
  {
    "id": 6132,
    "mediaId": 2918,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Natalie Winters",
    "title": "A Dominion Voting Systems Rep is Sponsoring a Republican Senate Campaign Fundraiser."
  },
  {
    "id": 5936,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "Ron DeSantis’ PAC and into Honor Pennsylvania, a super PAC backing fellow hedge funder <span class='selected-term'>Dave McCormick</span> — and opposing celebrity physician Mehmet Oz — in Pennsylvania’s GOP Senate primary, making Griffin the biggest individual donor to those two groups so far.”\n— “The massive national investment by Griffin, a longtime Republican megadonor who has sharply increased his political donations in recent years, positions him to be one of the biggest forces in the GOP’s drive to retake Congress in 2022.",
    "author": "",
    "title": "Which Democrats K Street is fundraising for"
  },
  {
    "id": 4617,
    "mediaId": 2641,
    "date": "2022-02-14",
    "sentence": "Pennsylvania GOP Senate candidate <span class='selected-term'>Dave McCormick</span> ran a “Let’s go, Brandon!” Super Bowl campaign ad within his state, listing some of Biden’s losses since taking office, using actual headlines, including:\nInflation a record high;\nThe fiasco in Afghanistan is a grave blow;\nBig Tech silencing conservative voices;\nU.S. trade deficit hits record high;\nOn pace to surpass record for annual homicides; and,\nIllegal border crossings soar to record highs.",
    "author": "Michael Dorstewitz",
    "title": "The Supreme Court Will Disappoint Joe Biden on Gun Control"
  },
  {
    "id": 3028,
    "mediaId": 2664,
    "date": "2022-03-14",
    "sentence": "Republicans have spent a record $35 million on TV ads in Pennsylvania, where frontrunners Mehmet Oz and <span class='selected-term'>Dave McCormick</span> are bashing one another as a “liberal RINO” and “Wall Street insider,” respectively, in attacks that could be used against them again in a general election.",
    "author": "Travis Gettys",
    "title": "Republicans 'kick the crap out of each other' in brutal primaries as Democrats sit back and watch"
  },
  {
    "id": 3108,
    "mediaId": 2658,
    "date": "2022-03-14",
    "sentence": "John Fetterman and Rep. Conor Lamb run ads arguing why they can win in one of the nation’s top battleground states, GOP candidates there have dropped a record-shattering $35 million on TV — the vast majority coming from Mehmet Oz and <span class='selected-term'>Dave McCormick</span>, the leading Republicans, whose camps are framing the other as a “liberal RINO” and “Wall Street insider,” respectively.",
    "author": "",
    "title": "GOP Senate candidates thrash each other ahead of fight for majority"
  },
  {
    "id": 2680,
    "mediaId": 2872,
    "date": "2022-03-30",
    "sentence": "There, disgraced TV physician Dr. Mehmet Oz is gunning hard to close a 9-point gap between himself and former George W. Bush administration official <span class='selected-term'>Dave McCormick</span>.",
    "author": "",
    "title": "Pennsylvania is ground zero for 2022’s ugliest Senate races"
  },
  {
    "id": 2149,
    "mediaId": 2630,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "GOP rivals pile on 'Dr. Oz' during forum for Pennsylvania Senate candidates"
  },
  {
    "id": 1171,
    "mediaId": 2660,
    "date": "2022-04-01",
    "sentence": "(Mostly True)\n<span class='selected-term'>Dave McCormick</span>: Campaign website\nMehmet Oz: Campaign website\nJeff Bartos: Campaign website\nCarla Sands: Campaign website\nGeorge Bochetto: Campaign website\nKathy Barnette: Campaign website\nJohn Fetterman: Campaign website\nConor Lamb: Campaign website\nMalcolm Kenyatta: Campaign website\nPennsylvania Capital-Star, \"An early guide to Pennsylvania’s 2022 Senate and governor’s primary election,\" March 15, 2022\nFox Business, \"Pennsylvania is home to most expensive Senate race in nation,\" March 24, 2022\nCity & State Pennsylvania, \"Endorsements in Pennsylvania’s U.S. Senate race keep stacking up,\" March 28, 2022\nPhiladelphia Inquirer, \"Where the Pennsylvania Democratic Senate candidates do and don't agree,\" March 7, 2022\nNew York Times, \"Dr. Oz’s Heritage Is Targeted as Rivals Vie for Trump Backing,\" March 18, 2022\nThe Hill, \"Pennsylvania Senate primaries get personal,\" March 28, 2022\nDaily Beast, \"Inside Dr. Oz’s Shameless Flip-Flop on Abortion,\" Dec. 7, 2021\nAssociated Press, \"Oz vows to renounce Turkish citizenship if elected senator,\" March 17, 2022\nPittsburgh Post-Gazette, \"For GOP Senate candidate Jeff Bartos, front-runners for the job aren’t true Pennsylvanians,\" March 22, 2022\nWOLF-TV, \"Republican Senate hopeful Carla Sands,\" March 27, 2022\nPhiladelphia Inquirer, \"George Bochetto launches Pa. Republican Senate campaign,\" March 4, 2022\nCook Political Report with Amy Walter, \"Pennsylvania Senate: Which Candidate Is the Primary Prescription for Republicans?\"",
    "author": "",
    "title": "The race for the Pennsylvania U.S. Senate seat: A guide"
  },
  {
    "id": 1502,
    "mediaId": 2629,
    "date": "2022-04-05",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> opposes increasing the federal minimum wage and wants to keep it at its current level of $7.25 an hour, set in 2009, when it was raised from $6.55.",
    "author": "Josh Israel",
    "title": "Super-Rich GOP Senate Candidate Says Keep Minimum Wage At $7.25"
  },
  {
    "id": 1767,
    "mediaId": 2934,
    "date": "2022-04-06",
    "sentence": "Although Pennsylvania’s TV airwaves have been filled with ads from Republican candidates Mehmet Oz and <span class='selected-term'>Dave McCormick</span> attacking each other, the discourse on the air had been more civilized on the Democratic side.",
    "author": "Robert Farley",
    "title": "Pro-Lamb Super PAC Misfires in Attack Ad Against Fetterman"
  },
  {
    "id": 1085,
    "mediaId": 2660,
    "date": "2022-04-06",
    "sentence": "The major Republican candidates are commentator Kathy Barnette, real estate developer Jeff Bartos, Philadelphia attorney George Bochetto, former hedge fund CEO <span class='selected-term'>Dave Mccormick</span>, physician and TV personality Dr. Mehmet Oz and Carla Sands, who served as President Donald Trump's ambassador to Denmark.",
    "author": "Tom Kertscher",
    "title": "\"John Fetterman's a self-described democratic socialist.\""
  },
  {
    "id": 530,
    "mediaId": 2539,
    "date": "2022-04-22",
    "sentence": "AP Photos\nWall Street executives are pouring millions of dollars into the Republican primary race for Pennsylvania’s open U.S. Senate seat — where veteran physician Dr. Mehmet Oz and former Bridgewater CEO <span class='selected-term'>Dave McCormick</span> lead in the polls — making the primary one of the most expensive in the 2022 midterm elections.",
    "author": "Brian Schwartz",
    "title": "Pennsylvania’s GOP Senate primary draws backing from some of Wall Street’s biggest billionaires, making it one of the most expensive midterm races"
  }
]