[
  {
    "id": 6486,
    "mediaId": 2590,
    "date": "2022-01-29",
    "sentence": "“You have a chance today to put fear into the heart of Dr. Oz, and <span class='selected-term'>Dave McCormick</span>, and that whole cast of characters because they don’t want to run against Conor Lamb,” he said, referring to the top two candidates seeking the Republican Senate nomination.",
    "author": "Daniel Marans",
    "title": "Pennsylvania Democrats Decline To Endorse In Senate Primary"
  },
  {
    "id": 6382,
    "mediaId": 2658,
    "date": "2022-01-30",
    "sentence": "Fetterman took second place, garnering 23 percent of ballots.”\n— Another GOP straw poll goes poorly for MEHMET OZ: Republican Senate candidate <span class='selected-term'>DAVE MCCORMICK</span> won the latest round of southwestern PA straw polls this weekend with the support of 35 members of the Republican State Committee — more three times as many as JEFF BARTOS who won 11.",
    "author": "",
    "title": "POLITICO Playbook: Trump floats pardons for Jan. 6 defendants"
  },
  {
    "id": 6378,
    "mediaId": 2658,
    "date": "2022-01-31",
    "sentence": "— Pennsylvania Republican Mehmet Oz is up with a new ad attacking <span class='selected-term'>Dave McCormick</span> as “China’s friend, not ours.” Oz and McCormick are two of the many Republicans running for Senate.",
    "author": "",
    "title": "The FEC reports we can’t wait to see"
  },
  {
    "id": 5454,
    "mediaId": 2572,
    "date": "2022-02-04",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> said that the state's working families \"are being terribly damaged by the policies of the Biden administration\" Friday on \"The Story with Martha MacCallum.\"",
    "author": "",
    "title": "Working families 'being terribly damaged' by the Biden administration: Dave McCormick"
  },
  {
    "id": 5583,
    "mediaId": 2658,
    "date": "2022-02-05",
    "sentence": "Sarah Huckabee Sandersshowed up to support Pennsylvania Senate hopeful <span class='selected-term'>Dave McCormick</span> at the Keystone State’s Republican State Central Committee meeting.",
    "author": "",
    "title": "POLITICO Playbook: RNC does Trump’s bidding, frustrating its members"
  },
  {
    "id": 6080,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "“If you think about the kind of people we need, we need people that actually understand and can put forward a tough-minded set of policies with China and that’s what I’ll do.”\nMs. Szymanski, the McCormick campaign spokeswoman, said Dr. Oz “has been silent on China until he needed to knock down Dave’s credentials.”\n“<span class='selected-term'>Dave McCormick</span> fought for the United States of America in combat,” she said.",
    "author": "Dave Boyer",
    "title": "Oz, McCormick trade pro-China barbs in Pa. Senate race, show Trump’s imprint on GOP"
  },
  {
    "id": 6013,
    "mediaId": 2522,
    "date": "2022-02-13",
    "sentence": "",
    "author": "Joshua Nybo",
    "title": "Penn. Senate candidate to run ‘Let’s Go Brandon’ ad during Super Bowl to highlight Biden failings"
  },
  {
    "id": 3335,
    "mediaId": 6570,
    "date": "2022-03-14",
    "sentence": "",
    "author": "Jonathan Tamari",
    "title": "Dave McCormick has dropped millions into Pa.'s U.S. Senate race, but it's hard to trace where it's coming from"
  },
  {
    "id": 3266,
    "mediaId": 2660,
    "date": "2022-03-16",
    "sentence": "That includes physician and talk show host Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>, the former chief executive of the Bridgewater Associates hedge fund.",
    "author": "Tom Kertscher",
    "title": "No proof for Dr. Oz’s claim that Pa. GOP Senate rival Dave McCormick ‘paid for attacks’ on Trump"
  },
  {
    "id": 2131,
    "mediaId": 2644,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Salena Zito",
    "title": "Why ex-hedge funder Dave McCormick is beating Dr. Oz in US Senate run"
  },
  {
    "id": 2156,
    "mediaId": 2660,
    "date": "2022-03-29",
    "sentence": "The race for the GOP nomination for an open U.S. Senate seat in Pennsylvania has been marked by attacks exchanged between two of the leading Republicans, Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>.",
    "author": "Tom Kertscher",
    "title": "Dr. Oz claimed that GOP Senate rival McCormick ‘bragged’ about offshoring jobs. That lacks evidence"
  },
  {
    "id": 1171,
    "mediaId": 2660,
    "date": "2022-04-01",
    "sentence": "(Mostly True)\n<span class='selected-term'>Dave McCormick</span>: Campaign website\nMehmet Oz: Campaign website\nJeff Bartos: Campaign website\nCarla Sands: Campaign website\nGeorge Bochetto: Campaign website\nKathy Barnette: Campaign website\nJohn Fetterman: Campaign website\nConor Lamb: Campaign website\nMalcolm Kenyatta: Campaign website\nPennsylvania Capital-Star, \"An early guide to Pennsylvania’s 2022 Senate and governor’s primary election,\" March 15, 2022\nFox Business, \"Pennsylvania is home to most expensive Senate race in nation,\" March 24, 2022\nCity & State Pennsylvania, \"Endorsements in Pennsylvania’s U.S. Senate race keep stacking up,\" March 28, 2022\nPhiladelphia Inquirer, \"Where the Pennsylvania Democratic Senate candidates do and don't agree,\" March 7, 2022\nNew York Times, \"Dr. Oz’s Heritage Is Targeted as Rivals Vie for Trump Backing,\" March 18, 2022\nThe Hill, \"Pennsylvania Senate primaries get personal,\" March 28, 2022\nDaily Beast, \"Inside Dr. Oz’s Shameless Flip-Flop on Abortion,\" Dec. 7, 2021\nAssociated Press, \"Oz vows to renounce Turkish citizenship if elected senator,\" March 17, 2022\nPittsburgh Post-Gazette, \"For GOP Senate candidate Jeff Bartos, front-runners for the job aren’t true Pennsylvanians,\" March 22, 2022\nWOLF-TV, \"Republican Senate hopeful Carla Sands,\" March 27, 2022\nPhiladelphia Inquirer, \"George Bochetto launches Pa. Republican Senate campaign,\" March 4, 2022\nCook Political Report with Amy Walter, \"Pennsylvania Senate: Which Candidate Is the Primary Prescription for Republicans?\"",
    "author": "",
    "title": "The race for the Pennsylvania U.S. Senate seat: A guide"
  },
  {
    "id": 1499,
    "mediaId": 2744,
    "date": "2022-04-03",
    "sentence": "Just In...\nPINE TOWNSHIP, Pennsylvania — When Sarah Sanders took center stage Wednesday night at an event for <span class='selected-term'>Dave McCormick</span>, a Republican primary candidate for the U.S. Senate, her entrance into the packed event space didn’t go as planned.",
    "author": "Salena Zito",
    "title": "Sarah Sanders emerges as a formidable advocate for Republican candidates on the campaign trail"
  },
  {
    "id": 1509,
    "mediaId": 6570,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Julian Routh",
    "title": "GOP Senate candidate Dave McCormick sees Pennsylvania's natural gas as driver of state's economy"
  },
  {
    "id": 536,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "The endorsement came after months of behind-the-scenes jockeying by Oz and another leading candidate in Pennsylvania, <span class='selected-term'>Dave McCormick</span>, a hedge fund executive.",
    "author": "Sarah Fortinsky",
    "title": "Trump endorses Mehmet Oz in Pennsylvania Senate race"
  },
  {
    "id": 313,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "Sunday morning, the campaign of billionaire <span class='selected-term'>Dave McCormick</span> released a statement from Santorum who stated, \"I know Pennsylvania and I know conservatives.",
    "author": "Tom Boggioni",
    "title": "Rick Santorum bucks Trump over Pennsylvania Senate seat endorsement: report"
  },
  {
    "id": 572,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration official Hope Hicks by his side.",
    "author": "Zachary Petrizzo",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 860,
    "mediaId": 2873,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration officials Hope Hicks and Stephen Miller by his side.",
    "author": "",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 220,
    "mediaId": 2578,
    "date": "2022-04-10",
    "sentence": "Dr. Oz is currently in a tight primary race with <span class='selected-term'>Dave McCormick</span> a former hedge fund manager.",
    "author": "Jim Hoft",
    "title": "President Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 911,
    "mediaId": 2629,
    "date": "2022-04-11",
    "sentence": "And Petrizzo notes that Trump, by endorsing Oz, has “ignited fury and ridicule among some of the loudest voices in Trumpworld.”\n“At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy’ America First’ Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump Administration official Hope Hicks by his side,” Petrizzo explains.",
    "author": "Alex Henderson",
    "title": "Trump Endorsement Of Dr Oz Enrages ‘MAGA’ Followers"
  },
  {
    "id": 570,
    "mediaId": 2676,
    "date": "2022-04-11",
    "sentence": "Oz faces a crowded field of primary opponents, including <span class='selected-term'>Dave McCormick</span>, a Republican former hedge fund executive and Republican businessman Jeff Bartos.",
    "author": "Jon Skolnik",
    "title": "Trump fans angered by his endorsement of Dr. Oz"
  },
  {
    "id": 633,
    "mediaId": 2522,
    "date": "2022-04-11",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he’s the farthest thing from America First & he’d be very bad for PA https://t.co/kuTo4pp53U\n— Sean Parnell (@SeanParnellUSA) April 9, 2022\n<span class='selected-term'>Dave McCormick</span>, who is a former George W. Bush administration official and is married to Dina Powell, a former deputy national security adviser to Trump, was also in the running for his endorsement but did not get it even though he leads Oz, according to recent polls.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Conservatives react very badly to Donald Trump’s endorsement of Dr. Oz"
  },
  {
    "id": 641,
    "mediaId": 2522,
    "date": "2022-04-13",
    "sentence": "Ingraham was critical of the endorsement, calling it a “mistake.” She asked Conway, who endorsed Republican <span class='selected-term'>Dave McCormick</span> in Pennsylvania, if it was an error by Trump and Hannity to endorse Oz several times.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Laura Ingraham unafraid to hit Trump and Hannity for endorsing Dr. Oz: ‘I’ll say it…it was a mistake’"
  },
  {
    "id": 821,
    "mediaId": 2934,
    "date": "2022-04-15",
    "sentence": "Amid nationwide protests after George Floyd’s murder in 2020, <span class='selected-term'>Dave McCormick</span>, then CEO of a hedge fund, emailed his colleagues, calling on them to “be agents of change” and to show “solidarity by denouncing and eradicating structural bigotry around us.”\nA new ad from a super PAC supporting McCormick’s chief rival in the Republican primary for U.S. Senate in Pennsylvania cites that email as evidence that “McCormick’s woke Connecticut hedge fund supported Black Lives Matter.” But the letter did not mention Black Lives Matter, and it expressed concern not only about racial discrimination and bigotry, but also about “rioting and destruction on city streets across the country.”\nMcCormick campaign spokesperson Jess Szymanski told us that “like President Trump and others,” McCormick was merely “a leader who provided reflections following the death of George Floyd,” and that “Dave never supported BLM and has always stood with law enforcement as a strong law and order candidate.”\nThere’s little mystery why McCormick’s opponents would want to tie him to the Black Lives Matter movement.",
    "author": "Robert Farley",
    "title": "McCormick’s Denouncement of ‘Structural Bigotry’ Not an Endorsement of BLM"
  },
  {
    "id": 547,
    "mediaId": 2539,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania’s Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz has close ties to the wealthy du Pont family heirs, and they’re backing his GOP bid for Pennsylvania’s Senate seat"
  },
  {
    "id": 194,
    "mediaId": 2660,
    "date": "2022-04-19",
    "sentence": "RELATED: No proof for Dr. Oz’s claim that Pa. GOP Senate rival <span class='selected-term'>Dave McCormick</span> ‘paid for attacks’ on Trump\nRELATED: In Pa. Senate run, Dr. Oz casts self as pro-Second Amendment, but he has backed gun-control measures\nRELATED: 2022 candidates use ads vowing to be tough on China, or attacking rivals as too soft on China",
    "author": "Tom Kertscher",
    "title": "Dr. Oz misses the facts in calling GOP Senate rival McCormick liberal and supportive of Biden, China"
  },
  {
    "id": 69,
    "mediaId": 6571,
    "date": "2022-04-19",
    "sentence": "Donald Trump or <span class='selected-term'>Dave McCormick</span>?",
    "author": "Jon Delano",
    "title": "David McCormick reacts to Trump's endorsement of Mehmet Oz and denies shipping jobs to China"
  }
]