[
  {
    "id": 5675,
    "mediaId": 2644,
    "date": "2022-02-09",
    "sentence": "“Strong borders can only be achieved with strong leadership and <span class='selected-term'>Dave McCormick</span> embodies the kind of strength needed to uphold the rule of law,” National Border Patrol Council president Brandon Judd said in a statement distributed by McCormick’s campaign.",
    "author": "Steven Nelson",
    "title": "Border Patrol union backs Pennsylvania GOP Senate contender McCormick"
  },
  {
    "id": 4552,
    "mediaId": 2572,
    "date": "2022-02-18",
    "sentence": "And the Oz campaign added that they were \"not aware of why <span class='selected-term'>Dave McCormick</span> decided to back out after committing\"\nNEW PUNCHES THROWN IN CHINA FISTFIGHT BETWEEN DR. OZ AND DAVID MCCORMICK\nThe McCormick campaign told Fox News that the former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official who entered the race last month \"is looking forward to debating.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania GOP Senate clash: Bartos takes aim at Oz, McCormick for skipping debate"
  },
  {
    "id": 2149,
    "mediaId": 2630,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "GOP rivals pile on 'Dr. Oz' during forum for Pennsylvania Senate candidates"
  },
  {
    "id": 1150,
    "mediaId": 2572,
    "date": "2022-04-02",
    "sentence": "Celebrity physician-turned Senate candidate Dr. Mehmet Oz and several others at the conservative Pennsylvania Leadership Conference forum Saturday did not debate each other, but many took turns jabbing at <span class='selected-term'>Dave McCormick</span> over his wealth and alleged ties to China.",
    "author": "Thomas Phippen",
    "title": "Pennsylvania GOP Senate primary: Dr. Oz, other candidates swipe at absent McCormick during forum"
  },
  {
    "id": 1767,
    "mediaId": 2934,
    "date": "2022-04-06",
    "sentence": "Although Pennsylvania’s TV airwaves have been filled with ads from Republican candidates Mehmet Oz and <span class='selected-term'>Dave McCormick</span> attacking each other, the discourse on the air had been more civilized on the Democratic side.",
    "author": "Robert Farley",
    "title": "Pro-Lamb Super PAC Misfires in Attack Ad Against Fetterman"
  }
]