[
  {
    "id": 6769,
    "mediaId": 6526,
    "date": "2022-01-25",
    "sentence": "“It’s not often a U.S. senator from Texas comes to the Lehigh Valley,” Jonathan DelCollo of Reading said, referring to guest speaker Ted Cruz, who was there to support fellow Republican <span class='selected-term'>Dave McCormick</span>’s bid for Pat Toomey’s soon-to-be-vacated Senate seat.",
    "author": "Andrew Scott",
    "title": "‘The country looks to Pennsylvania’: Ted Cruz rallies in the Lehigh Valley to kick off candidate’s bid to replace Sen. Pat Toomey"
  },
  {
    "id": 6549,
    "mediaId": 2662,
    "date": "2022-01-31",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "Cassandra Fairbanks",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 6522,
    "mediaId": 6571,
    "date": "2022-01-31",
    "sentence": "In her race for the Senate, Barnette calls her three fellow Republicans who recently moved into the state to run – <span class='selected-term'>Dave McCormick</span>, Carla Sands and Mehmet Oz – \"carpetbaggers,\" and then she adds, \"We don't need to send another rich person to D.C. to represent our interests.",
    "author": "",
    "title": "Kathy Barnette Hopes To Become US Senate's First Black Republican Woman"
  },
  {
    "id": 6666,
    "mediaId": 2748,
    "date": "2022-02-01",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "STATION GOSSIP",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 6132,
    "mediaId": 2918,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Natalie Winters",
    "title": "A Dominion Voting Systems Rep is Sponsoring a Republican Senate Campaign Fundraiser."
  },
  {
    "id": 5485,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "Ron DeSantis’ PAC and into Honor Pennsylvania, a super PAC backing fellow hedge funder <span class='selected-term'>Dave McCormick</span> — and opposing celebrity physician Mehmet Oz — in Pennsylvania’s GOP Senate primary, making Griffin the biggest individual donor to those two groups so far.",
    "author": "",
    "title": "The Republican megadonor funding the party’s 2022 hopes"
  },
  {
    "id": 5454,
    "mediaId": 2572,
    "date": "2022-02-04",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> said that the state's working families \"are being terribly damaged by the policies of the Biden administration\" Friday on \"The Story with Martha MacCallum.\"",
    "author": "",
    "title": "Working families 'being terribly damaged' by the Biden administration: Dave McCormick"
  },
  {
    "id": 5583,
    "mediaId": 2658,
    "date": "2022-02-05",
    "sentence": "Sarah Huckabee Sandersshowed up to support Pennsylvania Senate hopeful <span class='selected-term'>Dave McCormick</span> at the Keystone State’s Republican State Central Committee meeting.",
    "author": "",
    "title": "POLITICO Playbook: RNC does Trump’s bidding, frustrating its members"
  },
  {
    "id": 6080,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "“If you think about the kind of people we need, we need people that actually understand and can put forward a tough-minded set of policies with China and that’s what I’ll do.”\nMs. Szymanski, the McCormick campaign spokeswoman, said Dr. Oz “has been silent on China until he needed to knock down Dave’s credentials.”\n“<span class='selected-term'>Dave McCormick</span> fought for the United States of America in combat,” she said.",
    "author": "Dave Boyer",
    "title": "Oz, McCormick trade pro-China barbs in Pa. Senate race, show Trump’s imprint on GOP"
  },
  {
    "id": 5675,
    "mediaId": 2644,
    "date": "2022-02-09",
    "sentence": "“Strong borders can only be achieved with strong leadership and <span class='selected-term'>Dave McCormick</span> embodies the kind of strength needed to uphold the rule of law,” National Border Patrol Council president Brandon Judd said in a statement distributed by McCormick’s campaign.",
    "author": "Steven Nelson",
    "title": "Border Patrol union backs Pennsylvania GOP Senate contender McCormick"
  },
  {
    "id": 6013,
    "mediaId": 2522,
    "date": "2022-02-13",
    "sentence": "",
    "author": "Joshua Nybo",
    "title": "Penn. Senate candidate to run ‘Let’s Go Brandon’ ad during Super Bowl to highlight Biden failings"
  },
  {
    "id": 4909,
    "mediaId": 2662,
    "date": "2022-02-13",
    "sentence": "According to Conservative Brief — <span class='selected-term'>Dave McCormick</span> was the CEO of Bridgewater Associates, the largest hedge fund in the world with assets worth at least $150 billion, from 2020 until January of this year.",
    "author": "Jim Hoft",
    "title": "MUST SEE: GOP Candidate Releases ‘Let’s Go Brandon’ Commercial During the Super Bowl (VIDEO)"
  },
  {
    "id": 4804,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "Watch us stand up to Joe Biden below: #PASen https://t.co/vMqEcQEAqX\n— <span class='selected-term'>Dave McCormick</span> (@DaveMcCormickPA) February 14, 2022",
    "author": "Valerie Richardson",
    "title": "‘Let’s Go, Brandon’ ad airs during Super Bowl in Pennsylvania"
  },
  {
    "id": 5139,
    "mediaId": 2781,
    "date": "2022-02-14",
    "sentence": "Republican candidate for U.S. Senate in Pennsylvania <span class='selected-term'>Dave McCormick</span> is running a “Let’s go Brandon” Super Bowl ad Sunday, highlighting the “self-inflicted” problems facing President Biden and his administration.",
    "author": "Fox News",
    "title": "WATCH: Senate Hopeful Torches Biden’s Super Bowl-Sized Fails in ‘Let’s Go Brandon’ Ad"
  },
  {
    "id": 4715,
    "mediaId": 2730,
    "date": "2022-02-18",
    "sentence": "— Holly Otterbein (@hollyotterbein) February 17, 2022\nPOLITICO's Holly Otterbein tweeted on Thursday that Senatorial candidate <span class='selected-term'>Dave McCormick</span> pulled out of a GOP debate for Monday, February 21, after he learned Dr. Mehmet Oz would not be attending.",
    "author": "Rebecca Downs",
    "title": "Out of State Candidates Refuse to Show Up for Senate GOP Debate in Key Battleground State"
  },
  {
    "id": 4552,
    "mediaId": 2572,
    "date": "2022-02-18",
    "sentence": "And the Oz campaign added that they were \"not aware of why <span class='selected-term'>Dave McCormick</span> decided to back out after committing\"\nNEW PUNCHES THROWN IN CHINA FISTFIGHT BETWEEN DR. OZ AND DAVID MCCORMICK\nThe McCormick campaign told Fox News that the former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official who entered the race last month \"is looking forward to debating.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania GOP Senate clash: Bartos takes aim at Oz, McCormick for skipping debate"
  },
  {
    "id": 3640,
    "mediaId": 2572,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "PA Republican Senate candidate McCormick calls Putin 'tyrant' who 'needs to be kept in check'"
  },
  {
    "id": 3647,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "Oz is in a crowded GOP race that also includes top rivals such as <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Jeff Bartos, a real estate developer, philanthropist and the 2018 Republican nominee for lieutenant governor; and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump.",
    "author": "Paul Steinhauser",
    "title": "Dr. Oz says his celebrity 'a huge advantage' as he runs for Senate; says he's 'aligned' with GOP voters"
  },
  {
    "id": 3879,
    "mediaId": 2590,
    "date": "2022-02-26",
    "sentence": "Advertisement\nIn this 2022 photo combination shown are Republican Pennsylvania U.S. Senate candidates, <span class='selected-term'>Dave McCormick</span>, left and Mehmet Oz.",
    "author": "Jeff McMillan and Marc Levy",
    "title": "In Trans People, GOP Candidates Find Latest 'Wedge Issue'"
  },
  {
    "id": 3003,
    "mediaId": 2641,
    "date": "2022-03-11",
    "sentence": "Oz, a former heart surgeon, and former hedge fund CEO <span class='selected-term'>Dave McCormick</span> are the leaders in the Republican primary field.",
    "author": "Charlie McCarthy",
    "title": "Ted Nugent: Why I'm Endorsing Dr. Oz"
  },
  {
    "id": 3108,
    "mediaId": 2658,
    "date": "2022-03-14",
    "sentence": "John Fetterman and Rep. Conor Lamb run ads arguing why they can win in one of the nation’s top battleground states, GOP candidates there have dropped a record-shattering $35 million on TV — the vast majority coming from Mehmet Oz and <span class='selected-term'>Dave McCormick</span>, the leading Republicans, whose camps are framing the other as a “liberal RINO” and “Wall Street insider,” respectively.",
    "author": "",
    "title": "GOP Senate candidates thrash each other ahead of fight for majority"
  },
  {
    "id": 3028,
    "mediaId": 2664,
    "date": "2022-03-14",
    "sentence": "Republicans have spent a record $35 million on TV ads in Pennsylvania, where frontrunners Mehmet Oz and <span class='selected-term'>Dave McCormick</span> are bashing one another as a “liberal RINO” and “Wall Street insider,” respectively, in attacks that could be used against them again in a general election.",
    "author": "Travis Gettys",
    "title": "Republicans 'kick the crap out of each other' in brutal primaries as Democrats sit back and watch"
  },
  {
    "id": 2758,
    "mediaId": 2572,
    "date": "2022-03-16",
    "sentence": "(McCormick Senate campaign)\n\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz told Fox News.",
    "author": "Brooke Singman",
    "title": "Dr. Oz will renounce his Turkish citizenship if elected to Senate: 'I will only be a U.S. citizen'"
  },
  {
    "id": 3266,
    "mediaId": 2660,
    "date": "2022-03-16",
    "sentence": "That includes physician and talk show host Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>, the former chief executive of the Bridgewater Associates hedge fund.",
    "author": "Tom Kertscher",
    "title": "No proof for Dr. Oz’s claim that Pa. GOP Senate rival Dave McCormick ‘paid for attacks’ on Trump"
  },
  {
    "id": 2172,
    "mediaId": 2732,
    "date": "2022-03-19",
    "sentence": "He had just spent about an hour listening to Republican U.S. Senate candidate <span class='selected-term'>Dave McCormick</span> as he addressed several dozen people in a private room, talking about his qualifications and what separates him from the rest of the crowded primary field.",
    "author": "Paula Reed Ward",
    "title": "Republican U.S. Senate candidate Dave McCormick greets potential voters in Murrysville"
  },
  {
    "id": 2156,
    "mediaId": 2660,
    "date": "2022-03-29",
    "sentence": "The race for the GOP nomination for an open U.S. Senate seat in Pennsylvania has been marked by attacks exchanged between two of the leading Republicans, Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>.",
    "author": "Tom Kertscher",
    "title": "Dr. Oz claimed that GOP Senate rival McCormick ‘bragged’ about offshoring jobs. That lacks evidence"
  },
  {
    "id": 2072,
    "mediaId": 2590,
    "date": "2022-03-30",
    "sentence": "Advertisement\nAt Wednesday’s forum, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> brought up Oz’s past columns that caution against fracking, which Oz’s campaign claims were actually authored by someone else.",
    "author": "Liz Skalka",
    "title": "Mehmet Oz Goes Full Climate Denial, Says Carbon Dioxide Isn't A Problem"
  },
  {
    "id": 2149,
    "mediaId": 2630,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "GOP rivals pile on 'Dr. Oz' during forum for Pennsylvania Senate candidates"
  },
  {
    "id": 1171,
    "mediaId": 2660,
    "date": "2022-04-01",
    "sentence": "(Mostly True)\n<span class='selected-term'>Dave McCormick</span>: Campaign website\nMehmet Oz: Campaign website\nJeff Bartos: Campaign website\nCarla Sands: Campaign website\nGeorge Bochetto: Campaign website\nKathy Barnette: Campaign website\nJohn Fetterman: Campaign website\nConor Lamb: Campaign website\nMalcolm Kenyatta: Campaign website\nPennsylvania Capital-Star, \"An early guide to Pennsylvania’s 2022 Senate and governor’s primary election,\" March 15, 2022\nFox Business, \"Pennsylvania is home to most expensive Senate race in nation,\" March 24, 2022\nCity & State Pennsylvania, \"Endorsements in Pennsylvania’s U.S. Senate race keep stacking up,\" March 28, 2022\nPhiladelphia Inquirer, \"Where the Pennsylvania Democratic Senate candidates do and don't agree,\" March 7, 2022\nNew York Times, \"Dr. Oz’s Heritage Is Targeted as Rivals Vie for Trump Backing,\" March 18, 2022\nThe Hill, \"Pennsylvania Senate primaries get personal,\" March 28, 2022\nDaily Beast, \"Inside Dr. Oz’s Shameless Flip-Flop on Abortion,\" Dec. 7, 2021\nAssociated Press, \"Oz vows to renounce Turkish citizenship if elected senator,\" March 17, 2022\nPittsburgh Post-Gazette, \"For GOP Senate candidate Jeff Bartos, front-runners for the job aren’t true Pennsylvanians,\" March 22, 2022\nWOLF-TV, \"Republican Senate hopeful Carla Sands,\" March 27, 2022\nPhiladelphia Inquirer, \"George Bochetto launches Pa. Republican Senate campaign,\" March 4, 2022\nCook Political Report with Amy Walter, \"Pennsylvania Senate: Which Candidate Is the Primary Prescription for Republicans?\"",
    "author": "",
    "title": "The race for the Pennsylvania U.S. Senate seat: A guide"
  },
  {
    "id": 1150,
    "mediaId": 2572,
    "date": "2022-04-02",
    "sentence": "Celebrity physician-turned Senate candidate Dr. Mehmet Oz and several others at the conservative Pennsylvania Leadership Conference forum Saturday did not debate each other, but many took turns jabbing at <span class='selected-term'>Dave McCormick</span> over his wealth and alleged ties to China.",
    "author": "Thomas Phippen",
    "title": "Pennsylvania GOP Senate primary: Dr. Oz, other candidates swipe at absent McCormick during forum"
  },
  {
    "id": 1499,
    "mediaId": 2744,
    "date": "2022-04-03",
    "sentence": "Just In...\nPINE TOWNSHIP, Pennsylvania — When Sarah Sanders took center stage Wednesday night at an event for <span class='selected-term'>Dave McCormick</span>, a Republican primary candidate for the U.S. Senate, her entrance into the packed event space didn’t go as planned.",
    "author": "Salena Zito",
    "title": "Sarah Sanders emerges as a formidable advocate for Republican candidates on the campaign trail"
  },
  {
    "id": 1502,
    "mediaId": 2629,
    "date": "2022-04-05",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> opposes increasing the federal minimum wage and wants to keep it at its current level of $7.25 an hour, set in 2009, when it was raised from $6.55.",
    "author": "Josh Israel",
    "title": "Super-Rich GOP Senate Candidate Says Keep Minimum Wage At $7.25"
  },
  {
    "id": 1085,
    "mediaId": 2660,
    "date": "2022-04-06",
    "sentence": "The major Republican candidates are commentator Kathy Barnette, real estate developer Jeff Bartos, Philadelphia attorney George Bochetto, former hedge fund CEO <span class='selected-term'>Dave Mccormick</span>, physician and TV personality Dr. Mehmet Oz and Carla Sands, who served as President Donald Trump's ambassador to Denmark.",
    "author": "Tom Kertscher",
    "title": "\"John Fetterman's a self-described democratic socialist.\""
  },
  {
    "id": 1509,
    "mediaId": 6570,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Julian Routh",
    "title": "GOP Senate candidate Dave McCormick sees Pennsylvania's natural gas as driver of state's economy"
  },
  {
    "id": 860,
    "mediaId": 2873,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration officials Hope Hicks and Stephen Miller by his side.",
    "author": "",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 313,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "Sunday morning, the campaign of billionaire <span class='selected-term'>Dave McCormick</span> released a statement from Santorum who stated, \"I know Pennsylvania and I know conservatives.",
    "author": "Tom Boggioni",
    "title": "Rick Santorum bucks Trump over Pennsylvania Senate seat endorsement: report"
  },
  {
    "id": 572,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration official Hope Hicks by his side.",
    "author": "Zachary Petrizzo",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 570,
    "mediaId": 2676,
    "date": "2022-04-11",
    "sentence": "Oz faces a crowded field of primary opponents, including <span class='selected-term'>Dave McCormick</span>, a Republican former hedge fund executive and Republican businessman Jeff Bartos.",
    "author": "Jon Skolnik",
    "title": "Trump fans angered by his endorsement of Dr. Oz"
  },
  {
    "id": 633,
    "mediaId": 2522,
    "date": "2022-04-11",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he’s the farthest thing from America First & he’d be very bad for PA https://t.co/kuTo4pp53U\n— Sean Parnell (@SeanParnellUSA) April 9, 2022\n<span class='selected-term'>Dave McCormick</span>, who is a former George W. Bush administration official and is married to Dina Powell, a former deputy national security adviser to Trump, was also in the running for his endorsement but did not get it even though he leads Oz, according to recent polls.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Conservatives react very badly to Donald Trump’s endorsement of Dr. Oz"
  },
  {
    "id": 821,
    "mediaId": 2934,
    "date": "2022-04-15",
    "sentence": "Amid nationwide protests after George Floyd’s murder in 2020, <span class='selected-term'>Dave McCormick</span>, then CEO of a hedge fund, emailed his colleagues, calling on them to “be agents of change” and to show “solidarity by denouncing and eradicating structural bigotry around us.”\nA new ad from a super PAC supporting McCormick’s chief rival in the Republican primary for U.S. Senate in Pennsylvania cites that email as evidence that “McCormick’s woke Connecticut hedge fund supported Black Lives Matter.” But the letter did not mention Black Lives Matter, and it expressed concern not only about racial discrimination and bigotry, but also about “rioting and destruction on city streets across the country.”\nMcCormick campaign spokesperson Jess Szymanski told us that “like President Trump and others,” McCormick was merely “a leader who provided reflections following the death of George Floyd,” and that “Dave never supported BLM and has always stood with law enforcement as a strong law and order candidate.”\nThere’s little mystery why McCormick’s opponents would want to tie him to the Black Lives Matter movement.",
    "author": "Robert Farley",
    "title": "McCormick’s Denouncement of ‘Structural Bigotry’ Not an Endorsement of BLM"
  },
  {
    "id": 547,
    "mediaId": 2539,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania’s Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz has close ties to the wealthy du Pont family heirs, and they’re backing his GOP bid for Pennsylvania’s Senate seat"
  },
  {
    "id": 377,
    "mediaId": 2632,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania's Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz Has Close Ties to the Wealthy Du Pont Family Heirs, and They're Backing His GOP Bid for Pennsylvania's Senate Seat"
  },
  {
    "id": 194,
    "mediaId": 2660,
    "date": "2022-04-19",
    "sentence": "RELATED: No proof for Dr. Oz’s claim that Pa. GOP Senate rival <span class='selected-term'>Dave McCormick</span> ‘paid for attacks’ on Trump\nRELATED: In Pa. Senate run, Dr. Oz casts self as pro-Second Amendment, but he has backed gun-control measures\nRELATED: 2022 candidates use ads vowing to be tough on China, or attacking rivals as too soft on China",
    "author": "Tom Kertscher",
    "title": "Dr. Oz misses the facts in calling GOP Senate rival McCormick liberal and supportive of Biden, China"
  },
  {
    "id": 530,
    "mediaId": 2539,
    "date": "2022-04-22",
    "sentence": "AP Photos\nWall Street executives are pouring millions of dollars into the Republican primary race for Pennsylvania’s open U.S. Senate seat — where veteran physician Dr. Mehmet Oz and former Bridgewater CEO <span class='selected-term'>Dave McCormick</span> lead in the polls — making the primary one of the most expensive in the 2022 midterm elections.",
    "author": "Brian Schwartz",
    "title": "Pennsylvania’s GOP Senate primary draws backing from some of Wall Street’s biggest billionaires, making it one of the most expensive midterm races"
  }
]