[
  {
    "id": 2680,
    "mediaId": 2872,
    "date": "2022-03-30",
    "sentence": "There, disgraced TV physician Dr. Mehmet Oz is gunning hard to close a 9-point gap between himself and former George W. Bush administration official <span class='selected-term'>Dave McCormick</span>.",
    "author": "",
    "title": "Pennsylvania is ground zero for 2022’s ugliest Senate races"
  },
  {
    "id": 1150,
    "mediaId": 2572,
    "date": "2022-04-02",
    "sentence": "Celebrity physician-turned Senate candidate Dr. Mehmet Oz and several others at the conservative Pennsylvania Leadership Conference forum Saturday did not debate each other, but many took turns jabbing at <span class='selected-term'>Dave McCormick</span> over his wealth and alleged ties to China.",
    "author": "Thomas Phippen",
    "title": "Pennsylvania GOP Senate primary: Dr. Oz, other candidates swipe at absent McCormick during forum"
  },
  {
    "id": 536,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "The endorsement came after months of behind-the-scenes jockeying by Oz and another leading candidate in Pennsylvania, <span class='selected-term'>Dave McCormick</span>, a hedge fund executive.",
    "author": "Sarah Fortinsky",
    "title": "Trump endorses Mehmet Oz in Pennsylvania Senate race"
  },
  {
    "id": 572,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration official Hope Hicks by his side.",
    "author": "Zachary Petrizzo",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 860,
    "mediaId": 2873,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration officials Hope Hicks and Stephen Miller by his side.",
    "author": "",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 633,
    "mediaId": 2522,
    "date": "2022-04-11",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he’s the farthest thing from America First & he’d be very bad for PA https://t.co/kuTo4pp53U\n— Sean Parnell (@SeanParnellUSA) April 9, 2022\n<span class='selected-term'>Dave McCormick</span>, who is a former George W. Bush administration official and is married to Dina Powell, a former deputy national security adviser to Trump, was also in the running for his endorsement but did not get it even though he leads Oz, according to recent polls.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Conservatives react very badly to Donald Trump’s endorsement of Dr. Oz"
  },
  {
    "id": 570,
    "mediaId": 2676,
    "date": "2022-04-11",
    "sentence": "Oz faces a crowded field of primary opponents, including <span class='selected-term'>Dave McCormick</span>, a Republican former hedge fund executive and Republican businessman Jeff Bartos.",
    "author": "Jon Skolnik",
    "title": "Trump fans angered by his endorsement of Dr. Oz"
  }
]