[
  {
    "id": 5101,
    "mediaId": 2590,
    "date": "2022-02-17",
    "sentence": "Advertisement\nIn the contest for the GOP nomination, Oz has several rivals: Kathy Barnette, a conservative commentator; Jeff Bartos, a real estate developer who ran unsuccessfully for lieutenant governor; <span class='selected-term'>Dave McCormick</span>, a former hedge fund CEO; and Carla Sands, Donald Trump’s ambassador to Denmark.",
    "author": "Liz Skalka",
    "title": "Inside Dr. Oz's Campaign Road Show"
  },
  {
    "id": 3647,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "Oz is in a crowded GOP race that also includes top rivals such as <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Jeff Bartos, a real estate developer, philanthropist and the 2018 Republican nominee for lieutenant governor; and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump.",
    "author": "Paul Steinhauser",
    "title": "Dr. Oz says his celebrity 'a huge advantage' as he runs for Senate; says he's 'aligned' with GOP voters"
  },
  {
    "id": 3614,
    "mediaId": 2540,
    "date": "2022-03-16",
    "sentence": "\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz said.",
    "author": "Alex Rogers and Michael Warren",
    "title": "Dr. Oz vows to renounce Turkish citizenship if elected to Senate"
  },
  {
    "id": 69,
    "mediaId": 6571,
    "date": "2022-04-19",
    "sentence": "Donald Trump or <span class='selected-term'>Dave McCormick</span>?",
    "author": "Jon Delano",
    "title": "David McCormick reacts to Trump's endorsement of Mehmet Oz and denies shipping jobs to China"
  }
]