{
  "id": 7,
  "mediaId": 43,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 4/22",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/4/22/2092221/-Daily-Kos-Elections-Live-Digest-4-22",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    651,
    1844,
    1901,
    2002,
    2298,
    3075,
    3087
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWhy House Democrats' best defense is a good offense\nThe Downballot\nFollowShare\n0:0044:11\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\n Friday, Apr 22, 2022  9:30:31 AM Pacific Daylight Time  David Nir\nNY Redistricting: A five-judge panel on New York's Appellate Division, the state's intermediate appellate court, upheld a recent lower court ruling that the new congressional map drawn by Democrats violates the state constitution as an illegal partisan gerrymander and gave lawmakers until April 30 to craft a replacement.",
    "Friday, Apr 22, 2022  11:24:15 AM Pacific Daylight Time  Jeff Singer\nMI-07: Republican state Sen. Tom Barrett, who is challenging Democratic Rep. Elissa Slotkin in Michigan's new and competitive 7th Congressional District, recently sent out a fundraising appeal by text message falsely telling recipients that your child's gender reassignment surgery has been booked,? complete with a phony time for the appointment.",
    "Friday, Apr 22, 2022  11:43:11 AM Pacific Daylight Time  Jeff Singer\nMI-08: Democratic Rep. Dan Kildee is defending a seat in the Flint and Saginaw areas that would have favored Joe Biden only 50-48, a small but potentially important shift from Biden's 51-47 showing in Kildee's existing 5th District.",
    "The few polls that have been released show former Detroit Police Chief James Craig as Team Red's frontrunner, but he's had to deal with several major campaign shakeups: Craig, most notably, parted ways with his first campaign manager in December, and his second left last month.",
    "This appears to be the first ad of the cycle that directly goes after a candidate from any of the \"big four\" party groups (which in addition to the NRSC includes the Senate Leadership Fund super PAC on the GOP side and the DSCC and Senate Majority PAC on for Democrats).",
    "Friday, Apr 22, 2022  11:57:25 AM Pacific Daylight Time  Jeff Singer\nMI-10: Five Democrats are competing to take on John James, who was Team Red's Senate nominee in 2018 and 2020, in an open seat in Detroit's northeastern suburbs that would have gone for Trump 50-49.",
    "Friday, Apr 22, 2022  11:54:40 AM Pacific Daylight Time  Stephen Wolf\nCO-Sen: Wealthy construction company wonder Joe O'Dea has announced he's spending $250,000 over three weeks to air an ad that touts his business record and portrays him as a conservative outsider.",
    "Barrett, a far-right politician who has worn a \"naturally immunized\" wrist band and refused to say if he's vaccinated, deployed this tactic after David Drucker of the conservative Washington Examiner reported that he'd badly missed his own team's fundraising goals.",
    "Friday, Apr 22, 2022  11:30:12 AM Pacific Daylight Time  Jeff Singer\nMI-03: Rep. Peter Meijer, who was one of the 10 House Republicans to vote to impeach Trump, faces primary opposition from conservative commentator John Gibbs, who is Trump's endorsed candidate.",
    "Friday, Apr 22, 2022  11:35:32 AM Pacific Daylight Time  Jeff Singer\nMI-04: Republican Rep. Bill Huizenga, who represents the existing 2nd District, has no primary opposition following fellow Rep. Fred Upton's retirement announcement earlier this month.",
    "Friday, Apr 22, 2022  11:25:04 AM Pacific Daylight Time  Jeff Singer\nMI-Gov: A total of 10 Republicans are competing to take on Democratic incumbent Gretchen Whitmer, which would make this the largest gubernatorial primary field in state history.",
    "The winner will take on 2020 nominee Hillary Scholten, who faces no intra-party opposition for her second bid, in a Grand Rapids-based seat that redistricting transformed from a 51-47 Trump seat to one Joe Biden would have carried 53-45.",
    "Warren Council member Angela Rogensues finished the quarter with $160,000 on-hand, while attorney Huwaida Arraf and former Macomb County Judge Carl Marlinga were similarly situated with $145,000 and $135,000 to spend, respectively.",
    "Former Grosse Pointe Shores Councilman Matthew Seely and businesswoman Candice Miller (not to be confused with the former congresswoman with the same name) are also in, but neither opened fundraising committees until recently.",
    "Friday, Apr 22, 2022  11:49:00 AM Pacific Daylight Time  Stephen Wolf\nAZ-Sen: The NRSC is commencing what they call a \"seven figure\" ad buy that starts off with a spot attacking Democratic Sen. Mark Kelly over immigration.",
    "It's possible that some candidates who submitted signatures won't appear on the ballot, though, because election authorities in Michigan have disqualified contenders in past years for not meeting the state's requirements.",
    "In 2018, for instance, seven House hopefulsincluding a few notable nameswere thrown off the ballot after the secretary of state ruled that they'd failed to turn in the requisite number of acceptable petitions.",
    "In its ruling, the Appellate Division also overturned the trial court's finding that the legislature lacked the power to draw new maps for the state Senate and Assembly, allowing those maps to be used.",
    "He's raising more money nowour goal is a million by the end of March.? However, the senator hauled in only $456,000 during the first three months of 2022, which left him with $396,000 on-hand.",
    "Sterling Heights City Council member Henry Yanez, though, was far back with only $22,000 in the bank, while former Macomb County Health Department head Rhonda Powell had less than $5,000.",
    "We announced just before Thanksgiving, you know, really, you know, we chained him to a desk and had him on the phones,\" said the staffer in February, \"and he raised, you know, 310 grand.",
    "This constituency in the Lansing area would have supported Joe Biden by a 50-49 margin, a small improvement for Slotkin from Trump's 50-49 edge in the old 8th District.",
    "Candidate filing closed Tuesday, and the only other Republican to turn in paperwork was insurance agency owner Jacob Hagg, who hasn't reported raising any cash at all.",
    "Conservative radio host Tudor Dixon doesn't have the same resources as her intra-party foes, but she sports endorsements from Reps. Bill Huizenga and Lisa McClain.",
    "The Republican frontrunner is former Trump administration official Paul Junge, who lost to Democratic Rep. Elissa Slotkin 51-47 in the old 8th District in 2020.",
    "James, who only has a little-known primary foe, had $1.25 million stockpiled at the end of March, which was considerably more than the Democrats had combined.",
    "Now that filing has passed in the Wolverine State, we'll be taking a look at Michigan's other big competitive races, starting with our MI-Gov item below.",
    "This seat in southwestern Michigan would have favored Trump 51-47, and the one Democrat to file, Joseph Alfonso, has not reported raising any money.",
    "However, Democrats have already said they'll appeal to the state's highest court, the Court of Appeals, with oral arguments scheduled for Tuesday.",
    "We know about Barrett's underperformance because a Democratic operative provided Drucker with a vivid recording of one of his top aides.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Also in the running are chiropractor Garrett Soldano, Michigan State Police Captain Mike Brown, and five others.",
    "Little-known attorney Gabi Manolache is also running, though MAGA bride? Audra Johnson did not end up filing.",
    "Slotkin, by contrast, took in $1.32 million during the first quarter and had a gigantic $5.5 million on-hand.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "It's not yet clear whether Republicans plan to pursue their own appeal regarding this issue.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "The August primary also includes two wealthy businessmen, Kevin Rinke and Perry Johnson.",
    "But even an underfunded extremist like Barrett has an opening in a district this close.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "One thing Barrett doesn't need to worry about, though, is the Aug. 2 primary.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "O'Dea faces state Rep. Ron Hanks in the June Republican primary.",
    "It's also a place to discuss elections, not policy.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "(We recently took a closer look at this primary.)",
    "(The old and new 8th Districts do not overlap.)",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "New episodes every Thursday morning.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}