{
  "id": 71,
  "mediaId": 43,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 2/1",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/2/1/2077316/-Daily-Kos-Elections-Live-Digest-2-1",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1510,
    1510,
    2277,
    2405,
    2405,
    2277,
    2384,
    2384,
    2087,
    2087,
    304,
    428,
    428,
    304,
    2621,
    2621,
    2678,
    2678
  ],
  "sentences": [
    "Tuesday, Feb 1, 2022  9:54:45 AM Pacific Standard Time  Jeff Singer\nGA-07: Rep. Lucy McBath's allies at Protect our Future, a new super PAC funded in part by cryptocurrency billionaire Sam Bankman-Fried, have released a Data for Progress survey of the May Democratic primary that shows her with a 40-31 edge over fellow incumbent Carolyn Bourdeaux, with state Rep. Donna McLeod a distant third with 6%.",
    "Tuesday, Feb 1, 2022  11:10:41 AM Pacific Standard Time  Jeff Singer\nMI-03: 2020 Democratic nominee Hillary Scholten announced Tuesday that she would seek a rematch against Republican Rep. Peter Meijer in Michigan's 3rd Congressional District, a Grand Rapids-based constituency that the state's new map transformed from a 51-47 Trump seat to one Joe Biden would have carried 53-45.",
    "Tuesday, Feb 1, 2022  9:47:25 AM Pacific Standard Time  Jeff Singer\nCO-07: State Sen. Brittany Pettersen, who earned the backing of retiring Rep. Ed Permutter last week, now has endorsements from Colorado's other three Democratic U.S. House members: Reps. Diana DeGette, Joe Neguse, and Jason Crow.",
    "Vander Veen, though, gained traction by focusing his campaign on the beleaguered President Richard Nixon, and he reminded voters that Ford would take over if Nixon left the White House: In one memorable newspaper ad, Vander Veen wrote, Our President must stand beyond the shadow of doubt.",
    "Gibbs, though, didn't do a particularly good job winning over furious MAGA donors during his opening quarter: Meijer outraised him $455,000 to $50,000, with Gibbs self-funding an additional $55,000, and the congressman ended 2021 with a massive $1.2 million to $85,000 cash-on-hand lead.",
    "The Grand Rapids area was solidly Republican turf all the way back in 1948 when a Navy veteran named Gerald Ford decisively unseated Rep. Bartel Jonkman, an ally of the powerful political boss Frank McKay, in the primary for what was numbered the 5th District at the time.",
    "Ford, who eventually rose to House minority leader, never fell below 60% of the vote in any of his general election campaigns, and the GOP initially didn't anticipate any trouble holding the seat after Ford replaced the disgraced Spiro Agnew as vice president.",
    "Meijer ran ahead of the top of the ticket last time and beat Scholten 53-47 in a very expensive open seat race in this historically Republican area, but he has more immediate problems ahead of him before he can fully focus on another bout.",
    "In 1976, as Ford was carrying Michigan during his unsuccessful bid against Jimmy Carter, Republican Harold Sawyer unseated Vander Veen 53-46, and the GOP has continued to win each incarnation of the Grand Rapids-based seat since then.",
    "Meijer's win over Scholten kept Team Red's long winning streak going, but a combination of redistricting, the area's move to the left, and intra-GOP troubles could give her the chance to score a historic win this fall.",
    "He only currently represents just under half of the revamped 3rd District, and Trump and his outside group allies can make plenty of trouble for Meijer over the next six months even if Gibbs' fundraising woes continue.",
    "The region did temporarily slip from the GOP's grasp in 2019 when five-term Rep. Justin Amash left the GOP to become an independent, and later a Libertarian, but he ultimately retired the next cycle.",
    "The incumbent was one of the 10 House Republicans who voted to impeach Donald Trump, and Trump is backing conservative commentator John Gibbs' bid to deny Meijer renomination in the August primary.",
    "Our President must be Gerald Ford.?\nFord himself only did one appearance for Vander Laan in a campaign that almost still everyone expected him to win, even if only by a small margin.",
    "Ford did become president months later after Nixon resigned, but Vander Veen still won a full term 53-43 months later during that year's Democratic wave.",
    "The party nominated Richard Vander Veen, who had badly lost to Ford in 1958, while the GOP opted for state Senate Minority Leader Robert Vander Laan.",
    "The only other poll we've seen here was a mid-December McBath internal from 20/20 Insight that gave her a far-larger 40-19 advantage over Bourdeaux.",
    "Scholten, for her part, is Team Blue's first notable candidate in a region that has almost never sent Democrats to the House since the early 1910s.",
    "Vander Veen, however, pulled off a 51-44 victory in what is still remembered as one of the biggest special election upsets in American history.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Despite his huge financial advantage, however, Meijer will almost certainly still need to watch his back in August.",
    "The unfolding Watergate scandal, though, gave Democrats the chance to pull off an upset of the ages in early 1974.",
    "(A few other candidates are also competing in the GOP primary, but none of them had more than $3,000 to spend.)",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "Sign up here to receive the Daily Kos Elections Morning Digest in your inbox each weekday.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "It's also a place to discuss elections, not policy.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "His tenure would be short.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}