{
  "id": 77,
  "mediaId": 195,
  "date": "1/14/2022 12:00:00 AM",
  "headline": "The fates of the 10 House Republicans who voted to impeach Trump",
  "image": "https://thehill.com/sites/all/themes/thehill/images/redesign/thehill-logo-big.png",
  "link": "https://thehill.com/homenews/house/589826-the-fates-of-the-10-house-republicans-who-voted-to-impeach-trump",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Marcos",
  "authorUrl": "https://thehill.com/author/cristina-marcos",
  "termIds": [
    1096,
    1147,
    1248,
    1335,
    1609,
    2006,
    2074,
    3085,
    3087,
    3094,
    255,
    459,
    562,
    615
  ],
  "sentences": [
    "Since her ouster as the House GOP conference chair, Cheney hasn't hesitated to criticize her former leadership colleague, House Minority Leader Kevin McCarthy (R-Calif.), for reversing his initial position that Trump bore some responsibility for the attack to full-on embracing him again.",
    "Aside from voting for Trump's impeachment, Upton also voted for the bipartisan infrastructure bill and to remove Rep. Marjorie Taylor Greene (R-Ga.) from committees for her past statements embracing conspiracy theories and promoting the idea of violence against Democrats.",
    "The Washington State Republican Party state committee passed a resolution condemning Trump's impeachment and expressing disappointment in Herrera Beutler and Rep. Dan Newhouse, another Republican from the state who voted to impeach the former president.",
    "\"While my desire to build a fuller family life is at the heart of my decision, it is also true that the current state of our politics, especially many of the toxic dynamics inside our own party, is a significant factor in my decision,\" Gonzalez said.",
    "Cheney\nCheney has gone from being one of the highest-ranking House Republicans plotting strategy against Democrats to accepting an invitation from Speaker Nancy Pelosi (D-Calif.) to serve on the select committee investigating the Jan. 6 insurrection.",
    "When the 10 GOP House members, along with seven of the party's senators, joined Democrats on Trump's impeachment, they said that the former president bore responsibility for inciting the mob of his supporters and was no longer fit for public office.",
    "Herrera Beutler serves as the top Republican on the House Appropriations subcommittee that oversees legislative branch funding and has participated in numerous hearings scrutinizing Capitol security since the insurrection.",
    "), who was serving as the third-ranking House Republican, was unceremoniously booted from her leadership post last year for repeatedly pushing back against Trump's false claims that the 2020 election was stolen from him.",
    "Katko, the top Republican on the House Homeland Security Committee, backed legislation to create an independent bipartisan commission to investigate the insurrection, which was blocked by Senate Republicans.",
    "In his retirement announcement, Kinzinger recalled hearing from supporters during his first race in 2010 unseating a Democratic incumbent to \"be my own man and to never 'do what they tell you to do.'\"",
    "The 10 House Republicans who voted to impeach former President Trump after the Jan. 6, 2021, attack on the Capitol have increasingly become pariahs as their party moves in the opposite direction.",
    "Valadao affirmed Wednesday that he will run for reelection, saying that \"I'll continue to be an independent member of Congress who will stand up to the divisive partisanship in Washington D.C.\"",
    "Newhouse rebuffed the calls, stating that he is \"still a conservative Republican who holds the principles of our Constitution and the priorities of central Washington above all else.\"",
    "In his retirement announcement, Katko added, \"My conscience, principles, and commitment to do what's right have guided every decision I've made as a member of Congress.\"",
    "But a year later, those Republicans are finding themselves ostracized  and even facing death threats  for being out of step with a party that continues to embrace Trump.",
    "Unlike in the House, only one of the seven GOP senators who voted to convict Trump in his impeachment trial faces voters later this year: Sen. Lisa Murkowski (Alaska).",
    "His support for Trump's impeachment marked one of his first votes upon his return to the House in January 2021 after unseating the Democrat who defeated him in 2018.",
    "Newhouse\nMultiple Washington Republicans are vying to challenge Newhouse in the GOP primary in August, though Trump has not yet endorsed a particular candidate.",
    "Meijer said in an interview with The Atlantic that he hoped after Jan. 6 that Republicans \"would do the necessary soul-searching and reconstruction.\"",
    "But Valadao has a powerful ally in McCarthy, who told a local NBC News affiliate that he \"strongly support[s]\" him despite his impeachment vote.",
    "In the wee hours of that disgraceful night, while waiting for the Capitol of our great country to be secured, I knew I should vote to certify.",
    "He has since been censured by county-level GOP groups in his district, and multiple Republicans are vying to unseat him in the GOP primary.",
    "Katko ultimately announced Friday that he won't seek reelection \"so that I can enjoy my family and life in a fuller and more present way.\"",
    "Aside from voting to impeach Trump, Katko has crossed party lines numerous times since the Jan. 6 riot in defiance of Trump's position.",
    "He became the second Republican who voted for impeachment to opt against seeking reelection when he made his decision known in October.",
    "Upton, who has served in the House since 1987, has come under fire from his party for repeatedly crossing party lines in recent months.",
    "Gonzalez cited \"toxic dynamics\" within the Republican Party in a September statement announcing his decision not to run for reelection.",
    "The others are all facing Trump-allied primary challengers who accuse them of lacking fealty to the most influential figure in the GOP.",
    "Kinzinger is currently the only other Republican serving alongside Cheney on the House select committee investigating Jan. 6.",
    "But months later, he realized: \"It's like, 'All right, this is going to be a longer, deeper project than I thought.'\"",
    "She faces multiple GOP primary challengers, including one endorsed by Trump, Army Special Forces veteran Joe Kent.",
    "Shortly after the vote to impeach, Republican county leaders in Newhouse's district called on him to resign.",
    "But because I had made a public announcement of my intent to object, I did not want to go back on my word.",
    "Valadao represents what's been one of the most competitive House districts in the country in recent years.",
    "He also was among the 13 House Republicans who voted for the bipartisan infrastructure bill last fall.",
    "Trump in November backed former Housing and Urban Development official John Gibbs to challenge Meijer.",
    "Meijer was the sole Republican who voted to impeach Trump who was only in his first term in Congress.",
    "Trump has endorsed trial attorney Harriet Hageman to challenge Cheney in the GOP primary this summer.",
    "Since then, a crowded field of Republicans has emerged to challenge him in the GOP primary in June.",
    "Rice told Politico in December that he now regrets his decision to vote against the certification.",
    "The South Carolina Republican Party voted last year to censure Rice for his impeachment vote.",
    "While Rice voted to impeach Trump, he did vote against certifying the 2020 election results.",
    "Here's a look at what's happened to the 10 House Republicans since their impeachment votes.",
    "He would have faced a Trump-backed primary challenger, former White House aide Max Miller.",
    "Trump endorsed Michigan state Rep. Steve Carra in September to challenge Upton.",
    "Valadao faces at least one GOP primary challenger, Army veteran Chris Mathys.",
    "I stand tall and proud knowing that I have done just that,? Kinzinger said.",
    "1 down, 9 to go,? Trump said in a statement after Gonzalez's announcement.",
    "Three of the 10 have decided not to run for reelection this year.",
    "\"He doesn't deserve to keep his seat,\" Trump said of Upton.",
    "She, too, will face a Trump-backed primary challenger.",
    "So yeah, I regret my vote to object,\" Rice said.",
    "Cheney's response: \"Bring it.\"",
    "And Rep. Liz Cheney (Wyo."
  ]
}