{
  "id": 1145,
  "mediaId": 238,
  "date": "d2022-03-22T22:34",
  "headline": "The Trailer: How campaign rhetoric about child porn made it to the Supreme Court hearing",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/03/22/trailer-how-campaign-rhetoric-about-child-porn-made-it-supreme-court-hearing/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    802,
    1047,
    1448,
    1972,
    2347,
    482,
    571
  ],
  "sentences": [
    "Rep. Mo Brooks (R-Ala.) and former Missouri governor Eric Greitens made the same promise on Monday: If elected to the U.S. Senate from their safe, red states, they'd vote to get rid of their party's leader, Mitch McConnell (R-Ky.)\nAmerica can't afford a Senate leader who is a weak-kneed, debt junkie, open border RINO Republican  and who, worse yet, sells out America for special interest group cash,? Brooks said in a 90-second campaign video, talking over a cowboy soundtrack that landed somewhere between Ennio Morricone and Weather Report.",
    "What would Jane have done if Josh Mandel had attacked him on this stage??\nDolan, the only candidate in the race who says that Donald Trump clearly lost the 2020 election, took multiple chances to emphasize his uniqueness  he raised his hand when asked if the party should move on? from 2020, and said he was the only one that said that Donald Trump's statement about calling Putin a genius and savvy was disgusting.?\nBut Dolan struggled to bait Vance, whose dismissive reaction to the Russian invasion set him apart from the field.",
    "I know Tim Ryan is backed by the Lincoln Project,? Vance wrote on Twitter, but maybe he should avoid the Chinese pedophile app.? In 2021, Lincoln Project co-founder John Weaver resigned over sexually explicit messages he'd sent to young men; Ryan campaign spokeswoman Izzy Levy called the tweet another pathetic attempt at relevance from Silicon Valley Vance.?\nIn the Senate race, the accusation was that one candidate was not taking child sexual exploitation seriously, and even giving a break to pedophiles.",
    "Hines's energy and competitiveness are highlighted throughout the 30-second spot, along with his endorsement from Donald Trump and a quick mention of what he's running to protect: Secure borders and free elections, and the God-given freedoms we all cherish.?\nOne Nation, Middle Class Being Torched.? This PAC, aligned with GOP Senate leadership, is running ads in multiple swing states to soften up Democratic incumbents on the issues they poll the worst on  in this case, inflation.",
    "The basketball gimmick is a game of horse, with each letter representing a number of problems; H, for example, stands for Insanely High Gas, Grocery Prices, Illegal Cartel Heroin, Fentanyl, Opioids on Our Streets.? (High and Heroin start with an H.?)\nSarah for Wisconsin, Decades.? Had one version of Build Back Better passed last year, Democrats might be running on having lowered prescription drug prices.",
    "Now it's going to have 60 days to educate the whole state on how to do this.?\nBrelsford said that he would probably run when the election date was set: If you're not in the race now, the train's moving down the track without you.? Republican Nick Begich III and Democrat Chris Constant, who were also running against Young before he died, said over the weekend that they'd run in a special election.",
    "Of all the issues that she could have taken on in law school, as a sentencing commissioner where she's setting policy, as a district court judge  why is going easier on people who possess child pornography one of her pet issues??\nWhen voters have gotten their say, judges seen as stopping short of the sentencing guidelines have landed in political trouble.",
    "The statute doesn't say, look only at the guidelines and stop.' The statute doesn't say, impose the highest possible penalty for this sickening and egregious crime.'?\nRepublicans haven't settled on the best way to use this month's hearings to damage Democrats, or to stop Jackson from becoming the first Black woman to serve on the highest court.",
    "Hawley read the names and details of child pornography cases Jackson had ruled on, emphasizing that she had given some sentences far lower than the maximum, but not getting into details: One convict who had just turned 18 was not seen as a threat to children, but an older man who sent nude pictures of his child to an undercover FBI agent was.",
    "But Hawley's focus on sentencing requirements for child sex offenders comes straight from campaign trail, where cracking down on sexual predators and pornographers is a guaranteed winner in general elections, especially in law enforcement and judicial races  even when there's criticism of stings that capture people with no criminal records.",
    "He hit back at Mandel, a former Marine who's been running for office since getting elected to city council at age 26: You may not understand this, because you've never been in the private sector in your life.?\nMandel leaped out of his chair, squaring up with Gibbons, and accusing him of demeaning military service.",
    "Judge Jackson's history of sentencing below guidelines, particularly in cases involving child exploitation, raises legitimate questions about her views on penalties for these crimes,? Sen. Charles E. Grassley (R-Iowa), the ranking Republican on the Senate Judiciary Committee, said in a statement on Saturday.",
    "A differently worded ABC News/Ipsos poll on this question in late January, in the first days after Associate Justice Stephen G. Breyer's retirement announcement, suggested that a supermajority of adults would have preferred Biden pick from all possible nominees? and not limit his search to Black women.",
    "Do you approve or disapprove of him making this a primary factor in his choice of nominee?? (Monmouth, March 10-14, 809 adults)\nMost modern Supreme Court nominees have started out with high public support, with Americans needing some disqualifying fact or event to emerge to oppose their confirmation.",
    "The criticism of Jackson has three components: She wrote a 1996 article on whether it was constitutional to retroactively add sex offenders to a registry, she gave convicts less onerous sentences than the sentencing guidelines allowed, and that her own stance on the guidelines deserves investigation.",
    "Her judicial and public records suggest that she was working to reduce sentences for child porn offenders.?\nSince 1990, when Congress first voted to make the possession of child pornography a federal offense, the law has moved toward stiffer penalties, and never toward relaxing them.",
    "Some people that we know have been living in this community, (whose) family has been living in this community, and then are not jumping from one district to another.?\nBridget Barton for Oregon, No Horse Sh!% Outsider.? You've seen candidates shoot hoops in their campaign ads.",
    "In a 2012 paper, the commission suggested that the current guideline produces overly severe sentencing ranges for some offenders, unduly lenient ranges for other offenders, and widespread inconsistent application.?\nThat was published during Jackson's term on the commission.",
    "Biological males should not be competing with biological females, so the NCAA got that wrong,? said Dolan, who said the issue was up to states, and said that he wouldn't alter Title IX of the Civil Rights Act to prevent transgender athletes from competing in girls' sports.",
    "Republican politicians and activists have also, increasingly, used the language of child pornography crackdowns to pull sexually explicit books out of school libraries, asking whether the liberals who want this material available to children are grooming? them for abuse.",
    "Gibbons didn't thrive in the TV format, occasionally restarting sentences to sharpen his points, getting bogged down in arguments about the confrontation with Mandel  and struggling with the moderators' decision to make candidates explain their main attacks on rivals.",
    "When you parachute back into Ohio, understand that there are tens of thousands Ukrainian people whose families and relatives are being killed.? Senate candidates, responded Vance, should think like statesmen? and not react emotionally to every foreign conflict.",
    "Nathaniel Herz and James Brooks reported on Monday that 2020 Democratic U.S. Senate nominee Al Gross, would run in the special; Gross raised $19.4 million, more than any federal candidate ever had in Alaska, to lose to Sen. Dan Sullivan (R-Alaska) by 13 points.",
    "Begich, whose namesake grandfather held this House seat as a Democrat, entered the race by promising new energy? as a more conservative replacement for Young; he announced his campaign in Palin's hometown of Wasilla, one of the state's conservative strongholds.",
    "It's not an argument supported by conservative elites, and politically it goes against [Mitch] McConnell's light-touch, keep it classy' approach,? said Brian Fallon, the founder of Demand Justice, a liberal advocacy group that supported Jackson's nomination.",
    "The leaders of both parties in Congress are unpopular, and McConnell has remained unpopular when Republican voters are asked about him, though the reasons have changed over time, and the current reason, typically, is that Donald Trump dislikes McConnell.",
    "Emily Horowitz, an academic who's written critically of pumped-up sex offender laws, pointed to the fate of Aaron Persky, a California judge who handed down a six-month prison sentence in a college rape case, and was recalled by voters within months.",
    "The reason why shots are being fired at us is that I was the first guy in the country to come out and say that when I'm elected to the United States Senate, as an America First' senator, that I'm voting against Mitch McConnell,? said Greitens.",
    "End Citizens United/Let America Vote Action Fund, Economy Too.? Two liberal pressure groups team up for this quick digital spot, which reminds voters of the controversy and boycott threats that came to Georgia when the state's Republican Gov.",
    "Rep. Rashida Tlaib (D-Mich.) is seeking reelection in the newly redrawn 12th Congressional District, but the Michigan Democratic Party Black Caucus endorsed another candidate for the safely blue seat: Lathrup Village Mayor Kelly Garrett.",
    "Only Vance took the question somewhere else, arguing that the growing acceptance of gender fluidity was being forced on Americans by woke? Democrats and tech companies, urging the audience to Google whether a man could become pregnant.",
    "The state was going to have three more months to figure out how top-four worked,? said Gregg Brelsford, a former Republican who was challenging Young as a nonpartisan candidate, said about his own decision to run in a special election.",
    "Liberals are a little late to the party here: It was conservatives, in ads that ran throughout last year, who blamed the left for the boycott threats and blamed Democrats for the All-Star Game moving from suburban Atlanta to Denver.",
    "Retiring Rep. Brenda Lawrence (D-Mich.) endorsed nonprofit CEO and state Civil Rights Commissioner Portia Robinson to replace her in the 13th Congressional District, bringing some clarity to the crowded race to represent Detroit.",
    "You get the same horsesh!% electing the same politicians,? says Barton, a Republican candidate for governor of Oregon, who adds that even Republicans? didn't do enough to fight the state's long-lasting pandemic restrictions.",
    "Mike Dunleavy (R) hasn't set the date yet, but state law requires a special primary election to be held between 60 and 90 days of Young's March 18 death, and a special general election no less than 60 days after the primary.",
    "Republicans like Ron Johnson  and let's be honest, too many Democrats  don't have the guts to stand up to the pharmaceutical companies,? Godlewski, a Democrat, says in her second statewide spot for her U.S. Senate campaign.",
    "Dolan said that Vance had caused pain? and sorrow? to Ukrainian Americans in Ohio, and Vance brought the topic back to Dolan's weakness: His family owns the Cleveland Indians, which has changed its name for the new season.",
    "It's a sop to the QAnon element.?\nFallon was referring to a conspiracy theory that Hawley hasn't endorsed  that political and economic elites, mostly Democrats, are engaged in child sex trafficking and even murder.",
    "I haven't been able to find a single case where she has had a child porn offender, a pedophile in front of her, where she hasn't given him the most lenient sentence,? Hawley said in a weekend interview on Fox News.",
    "Bo Hines, Offense.? The first ad from the 26-year-old former Yale football player's House campaign in North Carolina starts with Hines mid-workout, lifting weights and doing pull-ups in a gym with patriotic flags.",
    "Brooks made his statement as Trump was reportedly having second thoughts about endorsing him; Greitens, in the Bannon interview, invoked Trump to say that true conservatives were always getting falsely accused.",
    "By focusing on why Jackson did not pursue the maximum available penalty to child sex offenders, conservatives who agreed with Hawley's strategy said that they were asking for documents from her term on the U.S.",
    "I said the matter of what happens to Ukraine is not in our vital national interest.?\nDolan fired back, suggesting that Vance made the Ukraine statement because he didn't understand the state he was running in.",
    "Timken called herself a mom on a mission? four times; Mandel used the phrase squishy RINO Republicans? five times, to say that his smash-mouth approach to the campaign showed how he'd do battle in Washington.",
    "It also kicked off a likely summer election for Young's House seat, the first under a new voting law that makes candidates of each party compete in one primary, with the top four heading to a runoff election.",
    "In 2018, Thanedar, the founder of a chemical testing company, spent nearly $11 million on a campaign for governor, carrying the city of Detroit after blanketing it with ads, but losing the nomination to Gov.",
    "Don't tell me I haven't worked.?\nThat exchange didn't really settle anything, but it made international news, and it dominated the first round of Monday night's televised debate between the same candidates.",
    "They've taken a knee for the Democrats, and they've taken a knee for the media.?\nGibbons explained again that the military is not the private sector,? letting other candidates do the talking about Mandel.",
    "This is a 25-year pet project for Judge Jackson, and it is very, very alarming,? Mike Davis, the founder of the conservative Article III Project, said on a conservative podcast shortly before the hearing.",
    "Timken said that the candidates had acted like children,? and she'd have punished them if she was their mother; Vance invoked his own service as a Marine to mock Mandel's constant focus on his biography.",
    "On Friday, five contenders for the party's nomination met in Columbus for an event hosted by FreedomWorks  investment banker Mike Gibbons, former state GOP chair Jane Timken, Hillbilly Elegy? author J.D.",
    "Thank you, senator,? said Jackson, for allowing me to address what appears to be a question in the context of a hearing on child pornography.? She was not on the ballot, but she might as well have been.",
    "And if we don't go after the big tech companies, we might win a battle here or there, but the tech companies are going to destroy our notion of what it is to be a human being in this country.?\nMichigan.",
    "Let's talk about the issues.?\nVance frequently got the better of his opponents at the debate, hosted by Fox 8 in Cleveland; candidates with more political experience often resorted to talking points.",
    "But the driving question is whether a judge who did not give the maximum recommended sentence to child sex offenders might have argued, in some document, that the recommendations are too harsh.",
    "A mid-June election would allow the special election for the state's sole House seat to be held simultaneously with the regular Aug. 16 primary, when the state will be printing ballots anyway.",
    "Republicans don't see a risk of losing the Alabama race with Brooks or any other nominee; polling has found Greitens running behind any other potential Republican nominee in the Missouri race.",
    "TV talking heads, and President Biden, talk for 25 seconds about high gas prices and inflation, before a narrator arrives to urge voters to call their senator and demand they stop inflation.",
    "Lawrence announced her retirement just a few days into the new year, with no obvious successor, which led to a fracas for the safe blue seat, and an opportunity for state Rep. Shri Thanedar.",
    "After Timken condemned Gibbons for arrogance? in how he talked about her husband's money fueling her campaign, Gibbons continued arguing that she didn't have his credibility or experience.",
    "It's all very similar to Biden's own support last summer, before the withdrawal from Afghanistan  a reason that Republicans didn't stick to it as a line of attack against Jackson.",
    "In this edition: Why Republicans are talking about pedophilia this week, how contempt is shaping Ohio's U.S. Senate primary, and what's happening in the race to replace Don Young.",
    "And as a mom and a former college athlete and an aunt of an NCAA swimmer who is competing right now and has been competing, this is unfair,? said Timken, who said that she would.",
    "The death of Rep. Don Young (R-Alaska) on Friday ended one of the House's longest careers, one that started just a few years after statehood and stretched across five decades.",
    "A few hours later, Greitens appeared on Stephen K. Bannon's War Room podcast, answering questions for the first time since his ex-wife filed documents accusing him of abuse.",
    "It's interesting to hear a lecture on strength from a guy who changed the name of the Cleveland Indians to the Cleveland Guardians, which of course, was a joke,? said Vance.",
    "You have stated publicly that it is a mistake to assume that child pornography offenders are pedophiles,? said Sen. Marsha Blackburn (R-Tenn.) during her opening statement.",
    "But most adults polled by Monmouth say that Judge Ketanji Brown Jackson should be confirmed, and large majorities of non-White voters approve of Biden's campaign pledge.",
    "A National Review columnist called it a smear.? And the paid media campaigns against Ketanji Brown Jackson's nomination to the Supreme Court have ignored it completely.",
    "I would like to know what Jane would do when every question asked to Josh Mandel was turned on me, and he literally spouted falsehoods the entire time he got up there.",
    "That issue has gained attention among Republican candidates across the country due to the competitive college career of Penn swimmer Lia Thomas, who is transgender.",
    "A year later, she was confirmed to the U.S. District Court for the District of Columbia, and the sentencing guidelines around child pornography never came up.",
    "Do you agree with that sentiment, that there is some meaningful population of people who have child pornography, but are not in fact pedophiles?? asked Cruz.",
    "If I were asked to serve in the House and take his place, I would be humbled and honored and I would,? Palin told Newsmax host Eric Bolling on Monday night.",
    "Just last week, after Rep. Tim Ryan (D-Ohio) talked to the New York Times about using TikTok to promote his U.S. Senate campaign, Republican candidate J.D.",
    "That's insane.? Gibbons agreed, suggesting that there could be a transgender category and they compete among other transgenders? to neutralize the issue.",
    "They didn't, and Wisconsin state Treasurer Sarah Godlewski blames both the GOP and the Democrats who cut the reform out of their social spending bill.",
    "At Monday's hearing, Grassley said that the Sentencing Commission documents could also shed light on Jackson's interactions with Fallon and his group.",
    "displayed the quote that Blackburn was talking about  a question about whether people who may not be pedophiles? sometimes get trapped in the system.",
    "But fewer people wanted to face Young, who never lost an election since entering politics in the 1960s, than to take a gamble on an open seat.",
    "And yet, on Tuesday morning, the first accusation Jackson was asked to respond to was the one first made by Sen. Josh Hawley (R-Mo.)",
    "And that could mean the return of Sarah Palin, weeks after the former governor lost her libel case against the New York Times.",
    "(Some are military flags, and one is a modified American flag with blue and red stripes representing police and firefighters.)",
    "Greitens was right  he'd been calling for McConnell  the Senate minority leader  to go before anyone else running for Senate.",
    " that she had given sexual predators and people caught with child pornography the most lenient? sentences she possibly could.",
    "We want some people that have been committed to our organization,? MDPBC's Keith Williams explained after the endorsement.",
    "Sentencing Commission be released,? said Terry Schilling, the president of the conservative American Principles Project.",
    "After Kemp promised no more changes, another bill is threatening our elections and our economy, again,? a narrator says.",
    "When he was campaigning for president, Joe Biden said that his first Supreme Court nomination would be a Black woman.",
    "First the Republican candidates for U.S. Senate debated; then, they debated about what happened at that debate.",
    "What might make some Republicans nervous in the Senate Judiciary Committee is a common topic in state politics.",
    "Brian Kemp signed a package of voting changes after the GOP losses in 2020 and a 2021 special election.",
    "That's significantly more than Begich or other Young challengers were on track to raise for this race.",
    "Not every question got to every candidate, but each got a chance to weigh in on transgender athletes.",
    "The opposition comes largely from White voters, 50 percent of whom disapprove of Biden's standard.",
    "Sentencing Commission studying its own standards and asking whether they should be more nuanced.",
    "But it comes up now, in many ways, from Senate races to school boards to the hearing room.",
    "Mandel accused Gibbons of making millions? by owning stock in a Chinese petroleum company.",
    "These are some of the most difficult cases that a judge has to deal with,? Jackson said.",
    "(Making and distributing child pornography was made a federal crime 13 years earlier.)",
    "I don't know why you use the Marine Corps every single time you're attacked, Josh.",
    "I'm a fighter, I'm a Marine, and I'll never back down from a fight,? Mandel said.",
    "The discussion about sentencing guidelines has happened in public, with the U.S.",
    "It's time for Eric to get out of this Senate race and to get professional help.?",
    "Conservatives are simply asking that Ketanji Brown Jackson's record at the U.S.",
    "The problem in Washington is that we have all these squishy RINO Republicans.",
    "I hate when people use the Marine Corps as a political football,? Vance said.",
    "The answer on a search engine, he said, would be yes,? which was the problem.",
    "We should never allow boys to be in our daughters' high school locker rooms.",
    "They've tried to destroy the basic natural understanding of men and women.",
    "to call for Greitens to quit the race, echoing Rep. Vicky Hartzler (R-Mo.",
    "You've seen a candidate invoke feces with computer-generated dung pies.",
    "Vance, former state Treasurer Josh Mandel, and state Sen. Matt Dolan.",
    "Sentencing Commission, which could delay the final confirmation vote.",
    "But have you seen a candidate shoot hops while talking about feces?",
    "They've tried to create a bunch of different genders,? said Vance.",
    "Two tours in Iraq, don't tell me I haven't worked,? said Mandel.",
    "That's it,? said Mandel, who also supported changing Title IX.",
    "I don't think I've made millions off anything,? Gibbons said.",
    "End of story,? Hartzler said in a 30-second video statement.",
    "In this week's hearings, the same sort of argument emerged.",
    "Vance suggested that Ryan was soft on child sexual abuse.",
    "Monday's filing was enough for Sen. Josh Hawley (R-Mo.)",
    "We should never allow boys to compete in girls sports.",
    "I never said I don't care about the people of Ukraine.",
    "But he was never expecting to face Palin herself.",
    "The White House dismissed it with a joke.",
    "Real men never abuse women and children.",
    "Simple, no gimmicks, and no dung pies.",
    "I'm a little insulted,? Gibbons said.",
    "Yeah, in a heartbeat, I would.?\nGov.",
    "), who Hawley endorsed last month.",
    "On Tuesday, Sen. Ted Cruz (R-Tex.)",
    "I had a chance to respond.",
    "Click above and you will.",
    "It's kind of ridiculous.",
    "Gretchen Whitmer.",
    "Girls are girls.",
    "Boys are boys.",
    "Period.",
    "Ohio."
  ]
}