{
  "id": 1726,
  "mediaId": 43,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Morning Digest: Pennsylvania Democrat tries to get GOP voters to nominate QAnon ally for governor",
  "image": "https://images.dailykos.com/images/1066409/story_image/AP22097622076886.jpg?1651788666",
  "link": "https://www.dailykos.com/story/2022/5/6/2096151/-Morning-Digest-Pennsylvania-Democrat-tries-to-get-GOP-voters-to-nominate-QAnon-ally-for-governor",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    802
  ],
  "sentences": [
    "Indeed, organizers made it very clear exactly what they believed during the gathering by showing a video that, among other things, called the 9/11 attacks false flags,? labeled vaccines genocide therapy,? and declared that JFK was assassinated because of his high risk of cabal exposure.?\nA spokesman for Mastriano previously said his boss strongly condemns the Q anon' conspiracy theory? and never committed to speak at this event but sadly was used to help promote it with his picture on the invite,? though the candidate himself seemed anything but sad about being used to promote the event he ended up attending.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nPlayback speed\nWhy progressives must build state power, with Gaby Goldstein\nThe Downballot\nFollowShare\n0:0055:29\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? PA-Gov: Democratic Attorney General Josh Shapiro has launched a commercial designed to help state Sen. Doug Mastriano, a QAnon ally whom many Republicans fret would be a toxic nominee in this swing state, prevail in his packed May 17 primary.",
    "? WV-02: With days to go before Tuesday's incumbent vs. incumbent Republican primary showdown, David McKinley is airing an ad that shows a digitally altered image of Alex Mooney in a prison jumpsuit as the narrator asserts that Mooney has no answers for why he's potentially facing prison time.? The commercial doesn't explain this explosive insinuation, though the Charleston Gazette-Mail article it references does.",
    "However, campaign finance attorney Brett Kappel suggested to the Gazette-Mail last month that it appears that the OCE is concerned that Rep. Mooney may have tried to obstruct their first investigation.? If true, the story says, that could subject Mooney to the False Statements Act, a law that carries a penalty of up to five years in prison and gives McKinley the hook he needs to picture his rival in jail garb.",
    "NC-Sen: Cheri Beasley (D)\nPA-Sen: Honor Pennsylvania - anti-Mehmet Oz (R)\nPA-Sen: Web3 Forward - pro-John Fetterman (D) ($200,000)\nWI-Sen: Sarah Godlewski (D)\nGA-Gov: Brian Kemp (R-inc) - anti-David Perdue (R)\nGA-Gov: RGA - pro-Brian Kemp (R-inc) and anti-Stacey Abrams (D)\nAL-05: Dale Strong (R)\nGA-06: Jake Evans (R)\nOR-05: Kurt Schrader (D-inc)\nVA-02: Jen Kiggans (R)\nThis is a short blurb about Daily Kos.",
    "Do you try and discredit me?? Mastriano hung up when the discussion turned to how he'd handle attacks in the general election over his attempt to overturn Biden's 2020 win: The site wrote, Delaware Valley Journal has interviewed many of the gubernatorial and U.S. Senate candidates from both sides of the aisle and hosted a debate among Republicans in the Senate race.",
    "That's what I always see on the left.? One of his hosts continued by asking about crime, but Mastriano himself chose to bring the topic back to the Patriots Arise gathering by exclaiming, How dare you castigate me for gathering with people??\nThings continued in that vein, with the candidate going on, 'Oh, you have conspiracy theorists there.' Oh, Ok. Maybe.",
    "The spots highlight the story of Jerry Winchester, who stepped down as executive director of the Oklahoma Tourism and Recreation Department after a legislative report revealed that his agency paid an enormous $13 million to renovate and run locations of restaurateur Brent Swadley's barbecue chain in several state parks.",
    "Cor, which we hadn't encountered before, says that the earlier poll for an unnamed client was \"never intended for public consumptionit was a quick and dirty automated tracking poll testing something else entirely,\" and that it was \"horrified to have our name tied to those results as an official public tracking poll.\"",
    "All proceeds go to Mastriano campaign.?\nThe Delaware Valley Journal then used an interview for its podcast this week to ask Mastriano about the gathering, to which he barked, I want you to call out Josh Shapiro and scrutinize who's in his audience or which groups he's speaking with, or do you give him a free pass?",
    "No other candidate has walked out on an interview or debate.?\nSenate\n? AR-Sen: Hendrix College, polling for Talk Business & Politics, finds Sen. John Boozman taking 45% of the votea few points below the majority he'd need to avert a runoffin the very first survey we've seen of the May 24 Republican primary.",
    "The ad came the same day that Franklin & Marshall College released a survey giving Mastriano a 20-12 advantage over former U.S. Attorney Bill McSwain, whom Trump has explicitly come out against, in the primary, with former Rep. Lou Barletta and wealthy businessman Dave White at 11% and 8%, respectively.",
    "The department, days before Winchester's departure, announced it was canceling that contract with Swadley's company because of \"suspected fraudulent activity and questionable business practices,\" and multiple state authorities and the legislature are all currently investigating the matter.",
    "The first allegation references a late March Texas Tribune article that describes how the family of Botham Jean, a Black man who was murdered by a Dallas police officer in 2018, used an open letter to blast Crockett for \"misrepresent[ing] yourself as one of our attorneys\" on her website.",
    "Pennsylvania state Sen. Doug Mastriano (R)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Bequette has benefited from close to $1.5 million in spending by a group funded by billionaire megadonor Dick Uihlein while Morgan, who lost the 2018 primary for governor 70-30 to incumbent Asa Hutchinson, has attracted relatively little attention and no major outside support.",
    "The firm, which did not mention a client for either poll, finds Michigan Rep. Elissa Slotkin defeating state Sen. Tom Barrett 40-34, while Virginia incumbent Elaine Luria outpaces state Sen. Jen Kiggans and far-right activist Jarome Bell 39-34 and 38-33, respectively.",
    "? MI-07, VA-02: The Democratic pollster Slingshot Strategies has released mid-April surveys testing views on abortion rights in two Democratic-held swing seats, Michigan's 7th Congressional District and Virginia's 2nd, that also include a horserace component.",
    "The Philadelphia Inquirer also notes that Mastriano has spent a mere $187,000 on TV ads in this large and expensive state while McSwain and White have each deployed millions, which gives Shapiro even more incentive to try to boost his preferred opponent.",
    "House\n? ID-02: Outside spending has intensified on both sides ahead of the May 17 Republican primary rematch between incumbent Mike Simpson and attorney Bryan Smith, though it still has a ways to go before it matches the price tag from their 2014 bout.",
    "According to OpenSecrets, Simpson's allies at the American Dental Association; Defending Main Street, which is close to the party establishment; and the crypto-aligned American Dream Federal Action have so far deployed a total of just over $1 million.",
    "? IL-Gov: The Republican pollster Cor Strategies has released a survey showing Aurora Mayor Richard Irvin leading state Sen. Darren Bailey 33-21 in the June Republican primary, which is a bit closer than the 30-13 edge it gave Irvin two weeks ago.",
    "Brian Kemp, meanwhile, was forbidden by state law from raising money for most of this period because the legislature was in session, but he pulled in $2.7 million during the 26 days after it adjourned and ended with $10.7 million in the bank.",
    "? OR-06: State Rep. Andrea Salinas has publicized an internal from Public Policy Polling that shows her leading economic development adviser Carrick Flynn 18-14 ahead of the May 17 Democratic primary, with everyone else in the single digits.",
    "? HI-Gov: Former Honolulu Mayor Kirk Caldwell announced Wednesday that he was dropping out of the August Democratic primary, saying, \"I'm not sensing the kind of momentum I know I need in the time we have left to continue to be viable.\"",
    "However, things remain completely muddled on the GOP side, where a 39% plurality remain undecided: TV personality Mehmet Oz outpaces former hedge fund manager Dave McCormick 18-16, with Big Lie promoter Kathy Barnette at 12%.",
    "? NC-Sen: The North Carolina Chamber of Commerce, which doesn't appear to have taken sides in the May 17 Republican primary, has publicized a survey from Atlantic Polling Strategies showing Rep. Ted Budd beating former Gov.",
    "Is that what we want in Pennsylvania?? Shapiro, who has no intra-party opposition of his own, is very much counting on Republicans watching at home to respond in the affirmative even though Trump has yet to endorse anyone.",
    "? TX-30: Democratic operative Jane Hope Hamilton uses most of her new ad for the May 24 runoff to emphasizes her progressive values and work on Biden's campaign, while the last third focuses on state Rep. Jasmine Crockett.",
    "? NY-19: State Sen. Michelle Hinchey has confirmed that she's considering running in the upcoming special election to succeed Rep. Antonio Delgado, a fellow Democrat who is resigning to become lieutenant governor.",
    "Surprisingly, the school also shows former NFL player Jake Bequette edging out gun-range owner Jan Morgan only 19-17 for second place even though there's a huge resource disparity between the two challengers.",
    "John Fetterman defeating Rep. Conor Lamb 53-14 ahead of the May 17 Democratic primary, which is an improvement from his already-large 41-17 lead that the school found a little more than three weeks ago.",
    "The narrator ostensibly attacks the legislator's opposition to vote by mail and calls to audit Biden's victory before saying, If Mastriano wins, it's a win for what Donald Trump stands for.",
    "Josh Green, who has held huge leads in the few polls we've seen, and businesswoman Vicky Cayetano, though Rep. Kai Kahele reportedly told House leaders last week he'd also decided to run.",
    "The Office of Congressional Ethics has been probing Mooney for over a year for allegedly misusing campaign funds on personal expenses, including meals at Chick-Fil-A and Taco Bell.",
    "The panel has not publicly specified what the new inquiry concerns, and because it almost certainly won't release any sort of report until after Tuesday, voters won't know either.",
    "Kevin Stitt, has launched a new $750,000 buy ahead of the June 28 primary attacking the governor over a scandal that led to the Friday resignation of his state tourism director.",
    "\"She lied about her record as a civil rights attorney,\" the narrator says of Crockett, who also goes after the $2 million that crypto-aligned PACs have spent for her.",
    "Governors\n? GA-Gov: Democrat Stacey Abrams raised a hefty $11.7 million from Feb. 1 through April 30, and she finished last month with $8 million cash-on-hand.",
    "The OCE, however, also opened a second investigation into Mooney in February, which makes him the rare member to be the subject of two simultaneous inquiries.",
    "The Oklahoma Project, which is funded by a longtime Democratic National Committee member, is also joining in, though there is no word on the size of the buy.",
    "? OK-Gov: Sooner State Leadership Fund, a dark money group that says it's willing to deploy a total of $10 million to deny renomination to Republican Gov.",
    "SSLF's commercial, though, portrays the story as \"the latest allegation of corruption\" that \"involves another state official personally hired\" by Stitt.",
    "Each poll asked how respondents prioritized a number of issues before it quizzed them on each matchup, with questions about abortion coming afterwards.",
    "Crockett led Hamilton 48-17 back in March in the primary to succeed retiring Rep. Eddie Bernice Johnson, who is supporting the state representative.",
    "Crockett, who works as a civil rights attorney, responded by saying, \"I'd never intentionally inflict additional distress upon any family.",
    "There may have been confusion about some information on our website which was remedied as quickly as it was brought to our attention.\"",
    "The state senator recently spoke to a conference called Patriots Arise for God and Country? that was filled with QAnon disciples.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Mastriano, meanwhile, seems intent on proving that Shapiro's right about him being the easiest Republican to beat in the fall.",
    "Instead, he wrote on Facebook, Painting print of President Trump done by Jeff Preston auctioned at event and sold for $4,000.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Stitt has not been accused of wrongdoing, and he's denied knowing Swadley or having \"involvement in this contract.\"",
    "Kahele hasn't confirmed his plans yet, but Civil Beat says he \"was expected to make an announcement this weekend.\"",
    "That's anything but a secure lead, though, especially since a 34% plurality of respondents are undecided.",
    "In Smith's corner is a new organization called America Proud, which has dropped $500,000 to date.",
    "Former Sen. David Perdue, who has struggled badly in the polls, has yet to reveal his haul.",
    "The firm says that, in response, it \"commissioned an actual poll that we could release.\"",
    "It also quotes the governor saying in 2019, \"You will know exactly where the buck stops.",
    "TOP's own commercial goes after Stitt on similar lines, saying, \"His friends get rich.",
    "Oz held a similar 16-15 edge last month just before he received Trump's endorsement.",
    "Pat McCrory 45-21.\n? PA-Sen: Franklin & Marshall College's new survey finds Lt. Gov.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Ad Roundup\nDollar amounts reflect the reported size of ad buys and may be larger.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "We haven't seen any numbers from any other firms here all year.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our podcast, The Downballot!",
    "The two remaining Democrats are Lt. Gov.",
    "(Simpson won 62-38 eight years ago.)",
    "Donate $25\n\nDonate $10 monthly",
    "Want to keep it that way?",
    "Click here to donate now.",
    "So what does that matter?",
    "Daily Kos is different.",
    "Oklahomans get burned.\"",
    "Please read it.",
    "Republican Gov.",
    "At my desk.\""
  ]
}