{
  "id": 2288,
  "mediaId": 43,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Admits He's Waging \"Guerilla War\" Against The Medical Establishment",
  "image": "https://images.dailykos.com/images/1067021/story_image/ScreenShot2022-05-06at5.49.10PM.png?1651884568",
  "link": "https://www.dailykos.com/story/2022/5/6/2096416/-WI-Sen-RoJo-The-Anti-Vaxxer-Admits-He-s-Waging-Guerilla-War-Against-The-Medical-Establishment",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2145,
    2145,
    1997,
    1997,
    1990,
    1990,
    1765,
    1925,
    1925,
    1713,
    1765,
    1713,
    728,
    728,
    837,
    837,
    1335,
    1335,
    1360,
    1360,
    414,
    146,
    146,
    143,
    143,
    428,
    428,
    414,
    2862,
    2862,
    2972,
    2972
  ],
  "sentences": [
    "Click below to donate and get involved with the Wisconsin Democrat of your choice and these Wisconsin Democrats campaigns:\nWisconsin Democratic Party\nMinocqua Brewing Company SuperPAC\nTony Evers for Governor\nMandela Barnes for U.S. Senate\nSarah Godlewski for U.S. Senate\nTom Nelson for U.S. Senate\nAlex Lasry for U.S. Senate\nJosh Kaul for Attorney General",
    "She previously said women who are raped should make lemons out of lemonade.?\n No Lie with Brian Tyler Cohen (@NoLieWithBTC) May 6, 2022\nU.S. Sen. Ron Johnson said Friday he doesn't believe Wisconsin's potential ban on almost all abortions would remain in place for long, distancing himself from his four fellow Republicans running for governor.",
    "In a letter sent to Speaker of the House Nancy Pelosi, Senate Majority Leader Chuck Schumer, House Minority Leader Kevin McCarthy and Senate Minority Leader Mitch McConnell, the coalition called for federal lawmakers to pass the Women's Health Protection Act, which would, among other things, codify the rights granted by Roe v. Wade.",
    "Tony Evers and 16 other governors are calling on congressional leaders to pass legislation guaranteeing continued access to abortions following a Monday night report that the U.S. Supreme Court may overturn the landmark Roe v. Wade decision that guaranteed access to the procedure nearly 50 years ago.",
    "Johnson, who is running for re-election to a third term in the Senate, made his comments after a draft of a U.S. Supreme Court ruling was leaked that showed a majority is prepared to overturn Roe v. Wade, the 1973 ruling that legalized abortion nationwide.",
    "In an exchange during a Zoom conference call Sunday that was taped and placed on the website Rumble, Johnson said he \"always advised the doctors that I have been working with don't do anything, don't say anything to marginalize themselves.\"",
    "But maybe he's also starting to realize that he's running for re-election:\nx\nNEW: The leading Republican candidate for Wisconsin Governor, Rebecca Kleefisch, just said she wants to ban abortion with NO exceptions for rape or incest.",
    "Sen. Ron Johnson (R. WI)\nGood to have him on record:\nRepublican U.S. Sen. Ron Johnson told a group of COVID vaccine critics that he's in a \"guerrilla war\" as he seeks to empower doctors and reform the medical establishment.",
    "Johnson, who has raised concerns about COVID vaccines and promoted the use of ivermectin and other unapproved therapies for early treatment of COVID-19, was speaking to a group that called itself Doctors for COVID Ethics.",
    "Speaking to reporters, Johnson did not detail what abortion limits he would like to see but said he did not think a near-total ban would last for long if the landmark Roe v. Wade decision is overturned.",
    "Johnson suggested Wisconsin officials would set different limits  even though Republicans who control the Legislature have given no indication they would do anything other than keep the ban in place.",
    "The COVID-19 vaccines do not compromise the body's immune system, but rather stimulate it to recognize and more easily defend against the disease, which has killed nearly 1 million Americans.",
    "The ad reservation by the Democratic Governors Association comes two months after its Republican counterpart said it would spend $6.2 million on spots for its nominee starting in September.",
    "Earlier this week, Johnson pushed this bull shit theory:\nRepublican U.S. Sen. Ron Johnson said during a video interview that it may be true? that COVID-19 vaccines cause AIDS.",
    "FYI:\nIn the latest sign Wisconsinites will see nonstop political ads this fall, a Democratic group announced Wednesday it plans to spend $21 million on spots supporting Gov.",
    "Speaking of which:\nx\nBREAKING: Today, I'm leading a coalition of 17 governors to call on Congress to immediately protect access to abortion and reproductive rights.",
    "So until we get a larger percentage of the population with their eyes open to woah, these vaccine injuries are real, why?' You know, it's gotta be step by step.",
    "Moderator Charles Kovess, who bills himself as Australia's Passion Provocateur, said about 100 \"doctors, lawyers, scientists, physicists\" were on the call.",
    "Johnson's comments came after Attorney Todd Callender, a vaccine opponent, told the Oshkosh Republican that COVID-19 shots caused vaccine-induced AIDS.",
    "Everything you say may be true, OK, but right now the public views the vaccines as largely safe and effective, that vaccine injuries are rare and mild.",
    "The bill was passed by the House of Representatives in September but has not yet made its way through the Senate.",
    "You can't leap to another Nuremberg trial.?\nThe AIDS claim is false, according to independent fact-checkers.",
    "Read our full letter here ? pic.twitter.com/y4NSFOE0qU\n Governor Tony Evers (@GovEvers) May 3, 2022\nGov.",
    "Johnson has provided a platform for doctors who have been critical of the nation's COVID response.",
    "If that happens, an 1849 ban on nearly all abortions would go back into effect in Wisconsin.",
    "\"I think the democratic process in Wisconsin will have something other than the 1849 law.\"",
    "The Republican group has described its plans as initial and said it could spend more.",
    "Health and Democracy are on the ballot next year and we need to keep Wisconsin Blue.",
    "That's the narrative, that's what the vast majority of the public accepts.",
    "\"I need every guerrilla fighting this guerrilla war right now,\" he added.",
    "\"Don't get out ahead of what the public is willing to accept as truth.\"",
    "They purposefully gave people AIDS.?\nLet me challenge you there.",
    "Tony Evers have said they oppose exceptions for rape or incest.",
    "The Democrats didn't say when their ads would begin running.",
    "Click here to register to vote or check your registration.",
    "I don't think that will stand for long,? Johnson said.",
    "The four Republicans running against Democratic Gov.",
    "We need action now, and we need to pass the #WHPA.",
    "In January, one panel lasted more than five hours.",
    "We cannot wait for #SCOTUS to overturn #RoeVWade.",
    "That's way down the road,? Johnson replied.",
    "You can't leap to crimes against humanity.",
    "I mean, you gotta do one step at a time.",
    "Primary Day in Wisconsin is August 9th.",
    "Tony Evers."
  ]
}