{
  "id": 2296,
  "mediaId": 33,
  "date": "d2022-05-03T00:00",
  "headline": "Supreme Court draft opinion that would overturn Roe v. Wade published by Politico",
  "image": "https://www.i.cdn.cnn.com/.a/2.294.0/assets/video_pinned_white_bg.jpg",
  "link": "https://www.cnn.com/2022/05/02/politics/roe-v-wade-supreme-court/index.html",
  "sentiment": "0.0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tierney Sneed",
  "authorUrl": "https://www.cnn.com/profiles/tierney-sneed",
  "termIds": [
    802,
    812,
    827,
    854,
    1070,
    1078,
    1491,
    1889,
    2058,
    2087,
    2428,
    2507,
    146,
    403,
    428,
    482,
    545,
    562,
    2798
  ],
  "sentences": [
    "\"Control of the Senate has never been more important: it's time to end the filibuster, pass the Women's Health Protection Act, and fight like hell to make sure all Ohio families are free to make these critical decisions without interference from politicians in Columbus or Washington,\" added Ohio Rep. Tim Ryan, who's favored to win his Democratic primary on Tuesday.",
    "\"Not only is the result it portends -- the overruling of Roe and Casey -- a shockwave to our constitutional politics, but we have never seen a leak remotely like this from inside the Court, where we're not just hearing what the result is going to be, but we're seeing the draft majority opinion in advance.",
    "A reversal of Roe would leave abortion policy up to individual states and would likely produce a patchwork system where the procedure would remain largely available in Democratic-led states, while Republican-led states would pass extreme limits or outright bans on it.",
    "If Roe were overturned or fundamentally weakened, 21 states have laws or constitutional amendments already in place that would make them certain to attempt to ban abortion as quickly as possible, according to the Guttmacher Institute, which favors abortion rights.",
    "Celebrated by supporters of abortion right and long reviled by critics, Roe v. Wade was decided in 1973 establishing a constitutional right to abortion before fetal viability, which most experts say occurs now at around 23-24 weeks of pregnancy.",
    "\"Several of these conservative Justices, who are in no way accountable to the American people, have lied to the U.S. Senate, ripped up the Constitution and defiled both precedent and the Supreme Court's reputation,\" the leaders said.",
    "According to a CNN Poll conducted by SSRS in January, most Americans oppose overturning Roe, with a majority saying that if the decision was vacated, they'd want to see their own state move toward more permissive abortion laws.",
    "Just 30% of Americans say they'd like to see the Supreme Court completely overturn its Roe vs. Wade decision, with 69% opposed -- a finding that's largely consistent both with other recent polling and with historical trends.",
    "At oral arguments, Roberts was the only one of the six Republican appointees who signaled interest in exploring a narrower opinion that would have upheld Mississippi's law but preserved some protections for abortion rights.",
    "In a statement, House Speaker Nancy Pelosi and Senate Majority Leader Chuck Schumer said overturning Roe would be \"the greatest restriction of rights in the past fifty years -- not just on women but on all Americans.\"",
    "The court said that a regulation cannot place an \"undue burden\" on the right to abortion, which is defined as a \"substantial obstacle in the path of a woman seeking an abortion before the fetus attains viability.\"",
    "Joe Manchin of West Virginia and Kyrsten Sinema of Arizona have repeatedly committed to protecting the filibuster, which sets up a 60-vote threshold that requires bipartisan cooperation to pass most legislation.",
    "(CNN)In a stunning breach of Supreme Court confidentiality and secrecy, Politico has obtained what it calls a draft of a majority opinion written by Justice Samuel Alito that would strike down Roe v. Wade.",
    "Because it is one of the court's most high-stakes and contentious decisions, the anticipation was that the opinion would be among the final ones the court released at the end of its term in late June.",
    "The Dobbs case was perhaps the most anticipated case of the court's term, and most court observers expected that the conservative majority was likely to scale back or outright overturn Roe's holding.",
    "\"Democrats need to act NOWend the filibuster, codify Roe, and defend reproductive freedom,\" tweeted Wisconsin state Treasurer Sarah Godlewski, who's running for her party's nomination for Senate.",
    "Alito also pushed back on the notion that if the court were to overturn Roe it could lead the court to overturn other cases like Obergefell v. Hodges, that upheld the right to same-sex marriage.",
    "Chief Justice John Roberts did not want to completely overturn Roe v. Wade, meaning he would have dissented from Alito's draft opinion, sources tell CNN, likely with the court's three liberals.",
    "That would mean that the five conservative justices that would make up the majority overturning Roe are Alito and Justices Clarence Thomas, Neil Gorsuch, Brett Kavanaugh and Amy Coney Barrett.",
    "Democrats outraged, call to end filibuster\nSeveral Senate Democratic candidates immediately called for the elimination of the filibuster and passing legislation to protect abortion rights.",
    "\"This news is simply stunning for the Supreme Court as an institution,\" said Steve Vladeck, CNN Supreme Court analyst and professor at the University of Texas School of Law.",
    "\"This court cannot bring about the permanent resolution of a rancorous national controversy simply by dictating a settlement and telling the people to move on,\" he wrote.",
    "\"The inescapable conclusion,\" Alito wrote, according to the draft, \"is that a right to an abortion is not deeply rooted in the Nation's history and traditions.\"",
    "He said that instead of \"bringing about a national settlement of the abortion issue\" Roe and a follow-on decision \"have enflamed debate and deepened division.\"",
    "A largely somber crowd gathered outside the Supreme Court building Monday evening, as people came together to console one another and question what to do next.",
    "The inner deliberations among the justices while opinions are being drafted and votes are being settled are among the most closely held details in Washington.",
    "Under current law, government cannot interfere with a women's choice to terminate a pregnancy before about 23 weeks, when a fetus could live outside the womb.",
    "Former President Donald Trump, when running for the White House in 2016, promised to appoint Supreme Court justices who would overturn Roe \"automatically.\"",
    "In February, Manchin also joined Senate Republicans in blocking the House-passed Women's Health Protection Act that aimed to preserve access to abortion.",
    "The court, Alito added, was not able to end the debate on abortion nearly a half century ago when Roe came down, so it should leave the issue to states.",
    "He said that Roe was \"egregiously wrong from the start\" and that its reasoning was \"exceptionally weak, and the decision has had damaging consequences.\"",
    "Decades-long project of conservative legal moment\nOverturning Roe would be the culmination of a decades-long project of the conservative legal moment.",
    "Barrett replaced the late Justice Ruth Bader Ginsburg, a Democratic appointee and abortion rights champion who died weeks before the 2020 election.",
    "Under normal procedure, by the end of that week the justices would have met in their private conference to take a preliminary vote on the issue.",
    "Already nearly half of the states have or will pass laws that ban abortion, while others have enacted strict measures regulating the procedure.",
    "The opinion would be the most consequential abortion decision in decades and transform the landscape of women's reproductive health in America.",
    "A majority of the court in that case replaced Roe's framework with a new standard to determine the validity of laws restricting abortions.",
    "\"The Constitution makes no reference to abortion and no such right is implicitly protected by any constitutional provision,\" Alito wrote.",
    "Stare decisis and overturning precedent\nIn the opinion, Alito also addresses the fact that Roe has been on the books for some 50 years.",
    "In the 50-50 Senate, Democrats need every vote to eliminate the chamber's rules requiring 60 votes to advance most legislation.",
    "Roberts is willing, however, to uphold the Mississippi law that would ban abortion at 15 weeks of pregnancy, CNN has learned.",
    "His nominee Kavanaugh replaced Justice Anthony Kennedy, who sided with the liberal justices in past abortion rights cases.",
    "The push from the Democratic candidates and others is likely to fail, unless some incumbent senators change their minds.",
    "According to the draft, the court would overturn Roe v. Wade's holding of a federal constitutional right to an abortion.",
    "He said that the notion of \"stare decisis\" does not \"compel unending adherence to Roe's abuse of judicial authority.\"",
    "Abortion is your right -- and it is STILL LEGAL,\" Planned Parenthood said in a tweet following Politico's reporting.",
    "It's hard to believe that the former doesn't help to explain the latter, but it's an earthquake in both respects.\"",
    "He added, \"It is time to heed the Constitution and return the issue of abortion to the people's representatives.\"",
    "The final opinion has not been released and votes and language can change before opinions are formally released.",
    "It concerns a challenge to Mississippi's 15-week ban on abortion and oral arguments were heard on December 1.",
    "In the past, justices have changed their votes and sometimes a majority opinion ultimately becomes a dissent.",
    "He also said the decision was on a \"collision course\" with the Constitution \"from the day it was decided.\"",
    "He said that what \"sharply distinguishes\" Roe from other cases is that \"abortion destroys\" potential life.",
    "An additional five states are likely to ban abortion as soon as possible without federal protections.",
    "They would have gone around the table in order of seniority discussing their take on the case.",
    "After that initial tally, if Roberts was in the majority he would assign the majority opinion.",
    "Politico's publishing of the draft is unprecedented by the high court's standards of secrecy.",
    "\"That is what the Constitution and the rule of law demand,\" he said, according to the draft.",
    "The release of a final opinion in the case is expected later this Spring or early summer.",
    "At one point, the crowd began to chant, \"Hey, hey, ho, ho, Samuel Alito's gotta go.\"",
    "As of April 2022, 536 abortion restrictions have been introduced in 42 states.",
    "Although the court is loath to overturn precedent, Alito says it must do so.",
    "The opinion in this case is not expected to be published until late June.",
    "\"Abortion rights are under attack, what do we do, stand up fight back.\"",
    "Otherwise the most senior justice would have taken that responsibility.",
    "Roe is the law of the land until the court formally issues its opinion.",
    "CNN's Alex Rogers, Manu Raju and Eva McKend contributed to this report.",
    "The decision was reaffirmed in 1992, in Planned Parenthood v. Casey.",
    "The draft was circulated in early February, according to Politico.",
    "CNN has not independently confirmed the document's authenticity.",
    "It appears that five justices would be voting to overturn Roe.",
    "A Supreme Court spokesperson declined to comment to CNN.",
    "It's outrageous, it's unprecedented, but it's not final.",
    "After that, draft opinions would go between chambers.",
    "This story has been updated with additional details.",
    "Roberts would have gone first, with Barrett last.",
    "Politico says it has authenticated the draft.",
    "The case in question is Dobbs v. Jackson.",
    "\"Let's be clear: This is a draft opinion.",
    "\"This fight is too urgent.\"",
    "\"We will not go back.\"",
    "And Democratic Sens.",
    "\"Pack the courts.\""
  ]
}