{
  "id": 2301,
  "mediaId": 367,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Wisconsin U.S. Senate election updates: Tom Nelson claims endorsement from Bernie Sanders-linked Our Wisconsin Revolution",
  "image": "https://www.gannett-cdn.com/presto/2022/02/02/PMJS/b1624b42-8555-4c22-bd50-78dacd6aa6e9-Tom_Nelson_1.jpg?width=600&height=750&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/politics/elections/2022/04/29/wisconsin-united-states-senate-race-2022-updates-candidates-ron-johnson-seat/9571561002/",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Glauber",
  "authorUrl": "",
  "termIds": [
    1925,
    1925,
    1568,
    1568,
    1253,
    1253,
    318,
    318,
    571,
    571,
    2855,
    2855,
    2972,
    2972,
    2951,
    2951
  ],
  "sentences": [
    "April 21: Ron Johnson touts work on right-to-try legislation, Trump tax bill\nAs he runs for reelection for a third term, Republican U.S. Sen. Ron Johnson is touting what he's calling his accomplishments that include passing a \"right to try\" law, ensuring President Donald Trump's tax bill benefited small businesses and digging into Hunter Biden's financial arrangements.",
    "April 28: Tom Nelson claims endorsement from Bernie Sanders-linked Our Wisconsin Revolution\nOutagamie County Executive Tom Nelson gained an endorsement Thursday from a key liberal group, the Bernie Sanders-inspired Our Wisconsin Revolution.",
    "The senator later clarified his remarks, saying he was using Obamacare as an example of how to prepare for delivering on agenda items, adding \"I was not suggesting repealing and replacing Obamacare should be one of those priorities.\"",
    "April 28: Ron Johnson details his stance on health care in 2022 election\nIn a statement to the Journal Sentinel, U.S. Sen. Ron Johnson, a staunch foe of Obamacare, detailed his approach to the health care issue in the 2022 election.",
    "Democrats attacked Johnson last month after he indicated during an interview that if Republicans regain control of Congress this year  and the presidency in 2024  they could again try to repeal the Affordable Care Act.",
    "In a subsequent statement to the Journal Sentinel, Johnson detailed his approach to the health care issue, favoring a \"free-market system\" with protections for those with preexisting medical conditions.",
    "Milwaukee Journal Sentinel\nWisconsin's race for U.S. Senate will be one of the most hotly contested in the country this fall, with implications for which party will be in control of the body in 2023.",
    "April 27: Marquette Poll shows tight Dem U.S. Senate race between Barnes, Lasry\nThe Democratic race for U.S. Senate has tightened, according to Wednesday's Marquette University Law School Poll.",
    "Mandela Barnes was the choice of 19% while Milwaukee Bucks executive Alex Lasry was at 16%, with state Treasurer Sarah Godlewski at 7% and Outagamie County Executive Tom Nelson at 5%.",
    "April 21: Steven Olikara unveils 'agenda to make government work'\nDemocratic U.S. Senate candidate Steven Olikara is banking on his ideas to get traction in a crowded primary field.",
    "He said those ideas and others can catch on with voters, like getting rid of gerrymandering, helping \"non-traditional\" candidates run for office and reforming the filibuster.",
    "The statement comes after years of staunch opposition from the Wisconsin Republican to Obamacare and his efforts to repeal and replace the Affordable Care Act.",
    "Johnson detailed the list April 22 in an email to supporters and a post on his website wisfacts.com as he braces to take on a Democratic rival in the fall.",
    "But many voters haven't made their pick for the primary that will be held Aug. 9, with the winner taking on Republican U.S. Sen. Ron Johnson in the fall.",
    "Our Wisconsin Revolution executive director Andre Walton said: \"Tom fights tirelessly for working people and puts people before corporate profits.",
    "Tom can win back this Senate seat because he's true to a progressive vision, not in spite of this, as some other candidates might believe.\"",
    "The top five finishers would move on to the general election, with voters ranking the candidates, what's known as ranked-choice voting.",
    "We know that just beating Ron Johnson is not enough, we need someone willing to challenge the billionaire class and corporate power.",
    "Nelson also backs Medicare for All and a Green New Deal, two key pillars for many on the left within the Democratic Party.",
    "He'd ban members of Congress from fundraising while Congress is in session and clamp down on corporate PAC money.",
    "And he'd tighten up the Congressional calendar, with members working three weeks in D.C. and one week at home.",
    "Incumbent Ron Johnson, a Republican, will face the winner of the Aug. 16 Democratic primary.",
    "On elections, he's for open primaries, Republicans and Democrats thrown into the same mix.",
    "He'd also cap at $250,000 the amount of money individuals put into their own campaigns.",
    "A long shot in the polls,\nHe wants legislators to work on policy, not on raising cash.",
    "Nelson was a 2020 Democratic Party delegate for Sanders, the Vermont independent U.S.",
    "This story will update with the latest developments in the race.",
    "That's unchanged,\" said poll director Charles Franklin.",
    "\"And 48% still don't know who they'll vote for.",
    "Senator who mounted a run for president.",
    "Lt. Gov."
  ]
}