{
  "id": 2302,
  "mediaId": 238,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Opinion The Wisconsin GOP is stuck with Ron Johnson. Democrats could pick a winner.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/28/wisconsin-ron-johnson-democrats-senate-poll-midterm/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    741,
    802,
    1568,
    2039
  ],
  "sentences": [
    "The most recent Marquette Law School poll finds: Johnson is seen favorably by 36% and unfavorably by 46%, while 14% say they haven't heard enough and 4% say they don't know.? The poll also found: Thirty-nine percent [of voters] say cares about people like me' describes Republican Sen. Ron Johnson, 50% say it does not describe him, and 11% say they don't know.? (Prior to the 2016 election, 43 percent said he cares about people like them and 39 percent said he did not.)",
    "In addition, A majority, 64%, say that undocumented immigrants who are currently in the United States should be allowed to stay and eventually apply for citizenship, while 16% say they should be able to stay but only as guest workers and 16% say they should be required to leave the United States.?\nThese may pose a problem for Johnson, who has become an extreme right-winger and is more in step with the MAGA crowd than moderate Midwest voters.",
    "His opponents and Democratic observers have made the case that he will attract fire from Johnson, who would love nothing better than to make the election a choice between him and someone he can try to label as a socialist.?\nThat concern and some tenacious campaigning by Barnes's opponents seem to have had an impact.",
    "While associating with President Biden likely would not help Wisconsin Democrats, given that his approval rating is underwater in the state (43/53 percent), Johnson's unpopularity provides an opportunity for Democrats, assuming they choose an electable candidate.",
    "Wisconsin's Democratic primary voters should understand that their choice could be the difference between keeping and losing the Senate majority (and with it, the power to confirm Biden's judicial and executive branch nominees).",
    "As I have written, the leading Democratic Senate contender, Mandela Barnes, initially went far to the left (e.g., favoring Medicare-for-all, abolishing ICE), although he recently has tried to tack back to the center.",
    "It runs through Pennsylvania, where Sen. Patrick J. Toomey (R) is retiring, as well as in states where Democrats will have to protect seats they currently hold, such as Georgia, Arizona and Nevada.",
    "But perhaps the most tantalizing opportunity for Democrats is in Wisconsin, which serves as a perfect example of Democratic primary voters' critical role in picking an electable candidate.",
    "The Marquette Law poll reports:\nA substantial majority, 69%, favor the state's current law allowing a license for concealed carry of handguns, with 26% opposed and 5% who don't know.",
    "He has become a reliable gaffe producer, recently called for repealing the Affordable Care Act and opposes luring jobs to Wisconsin (or helping people pay for raising children).",
    "The Marquette Law poll finds that Barnes, who was at 23 percent in February, is down to 19 percent, while former Bucks executive Alex Lasry has risen from 13 to 16 percent.",
    "In contrast, a proposal to allow concealed handguns without the need for a license is supported by only 16% and opposed by 82%, with 2% saying they don't know.",
    "With an incumbent as weak and vulnerable as Johnson, Democrats must consider which candidate is best able to make the election a referendum on him.",
    "State treasurer Sarah Godlewski has more than doubled her share, now taking 7 percent, while populist Tom Nelson holds steady at 5 percent.",
    "The Republican incumbent in the race, Sen. Ron Johnson, is an election denier, vaccine skeptic and eager Russia propagandist.",
    "His positions earned him an 89 percent conservative? rating from the far-right Conservative Political Action Conference.",
    "Seventy-two percent support marriage for gay and lesbian couples, while 19% oppose and 8% say they don't know.",
    "There is plenty of time for the candidates to make their case to voters before the Aug. 9 primary.",
    "Interestingly for a swing state, voters in Wisconsin express progressive views on some key issues.",
    "Fifty-one percent of voters disapprove of his performance, including 56 percent of independents.",
    "Republicans are hoping the election is about anything other than their gaffe-prone MAGA soldier.",
    "Support for same-sex marriage remains strong in Wisconsin, and has gained support over time.",
    "A Morning Consult poll earlier this year had Johnson's approval rating at 36 percent.",
    "Democrats have a narrow path to saving their Senate majority in the midterms.",
    "That puts Barnes's lead within the margin of error.",
    "The poll is hardly an outlier.",
    "And his poll numbers stink."
  ]
}