{
  "id": 2353,
  "mediaId": 43,
  "date": "3/22/2022 12:00:00 AM",
  "headline": "Morning Digest: The top GOP candidate to run Nevada's elections is an antisemitic Big Lie proponent",
  "image": "https://images.dailykos.com/images/1051003/story_image/AP21351804375413.jpeg?1647902111",
  "link": "https://www.dailykos.com/story/2022/3/22/2087277/-Morning-Digest-The-top-GOP-candidate-to-run-Nevada-s-elections-is-an-antisemitic-Big-Lie-proponent",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1501,
    1501,
    863,
    863,
    869,
    869,
    1480,
    1480,
    428,
    428,
    2818,
    2818,
    2879,
    2879
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nVoting rights and criminal justice are on your local ballot this year, with Daniel Nichanian\nThe Downballot\nFollowShare\n0:0044:09\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? NV-SoS: Both parties will be fighting hard to win the race to succeed termed-out Secretary of State Barbara Cegavske, who was the only Nevada Republican to prevail statewide during the 2018 Democratic wave, and with the close of candidate filing on Friday, we now know who all the contenders are.",
    "The paper says that normally an appointed incumbent would be up whenever an election next takes place, but the deadline to turn in signatures for the 2022 cycle is fast approaching on April 5.\n? Suffolk County, MA District Attorney: Sen. Ed Markey on Monday endorsed Boston City Councilor Ricardo Arroyo in the September Democratic primary, a development that came a week after Markey's home-state Senate colleague, Elizabeth Warren, also backed the city councilor.",
    "Prosecutors\n? Maricopa County, AZ Attorney: Republican Allister Adel announced Monday that she was resigning as the top prosecutor of America's fourth-most populous county, effective Friday, a move that the Arizona Republic writes came after negative attention \"over her sobriety and absences from the office, which prompted investigations by the State Bar of Arizona and the Maricopa County Board of Supervisors.\"",
    "Rice, though, has made it clear she's not at all a fan of Jacobs: Earlier this month, after the chair implored donors to refrain from contributing to anyone \"until we have had an opportunity to discuss the complexities of the race,\" she responded by tweeting, \"No wonder Democrats in Nassau county lose with this kind of leadership.\"",
    "? SC-07: On Monday, the State Law Enforcement Division confirmed it was investigating allegations leveled by former Myrtle Beach Mayor Mark McBride, who said that a blogger named David Hucks tried to bribe him to quit the June Republican primary at the behest of another candidate, Horry County school board chair Ken Richardson.",
    "? WI-Sen: In her second commercial ahead of the August Democratic primary, state Treasurer Sarah Godlewski bemoans how prescription drug costs keep rising and declares that it's \"[b]ecause Republicans like [Sen.] Ron Johnsonand let's be honest, too many Democratsdon't have the guts to stand up to the pharmaceutical companies.",
    "The most prominent name belongs to former 4th District Rep. Cresent Hardy, who launched a surprise bid just before filing closed on Friday; only 4% of the new 1st's residents live in the old 4th, but, because both seats are located in the Las Vegas media market, he should be a familiar presence here.",
    "Candidates running statewide or in constituencies containing multiple counties were required to file with the secretary of state, while candidates running for single-county seats, such as the 1st and 3rd Congressional Districts in Clark County, had to instead file with their local election officials.",
    "Hardliners immediately called for his ouster, and while the congressman soon protested that \"[i]n no way, shape, or form, did I indicate support for impeachment,\" Trump's campaign notably snubbed the Silver State's only GOP member of Congress by leaving him off its list of state co-chairs for 2020.",
    "Laxalt so far has shown no interest in tacking to the center, and he's repeatedly accused Democrats and the media of exaggerating the Jan. 6 attack, saying in September, \"What the media and their left wing allies have done to weaponize this against Republicans and Trump voters is reprehensible.\"",
    "The only elected official in the primary is state Sen. Zach Nunn, who is going up against businesswoman Nicole Hasso and Gary Leffler; Leffler, who took part in the Jan. 6 Trump rally that preceded the attack on the Capitol, didn't report any fundraising during his first quarter in the race.",
    "Republican Sen. Chuck Grassley, who is one of the two longest-serving members of Congress following the death of Alaska Rep. Don Young (Grassley is tied with Vermont Sen. Patrick Leahy, who is retiring), is seeking an eighth term in a state that swung hard to the right during the Trump era.",
    "The alleged incident occurred the month before Eric Greitens resigned as governor while under indictment for purportedly sexually assaulting a woman he was having an affair with and blackmailing her into silence, as well as unrelated charges of computer tampering involving his charity.",
    "The frontrunner appears to be attorney April Becker, who narrowly failed to unseat state Senate Majority Leader Nicole Cannizzaro by a 50.5-49.5 margin last cycle; Becker then tried to challenge her 631-vote loss in court and demanded a \"revote,\" but she failed to get what she wanted.",
    "Amodei, of course, never voted to impeach Trump, but he did piss off conservatives nationwide in September of 2019 when he became the first House Republican to identify as impeachment-curious, saying of the inquiry into Trump, \"Let's put it through the process and see what happens.\"",
    "Until last month the only contender was Sigal Chattah, an attorney who has sued to try to undermine the state's pandemic response measures and who has complained that the attorney general has done a poor job investigating (baseless, of course) voter fraud allegations.",
    "The tampering charge was dropped in exchange for Greitens' resignation, while Jackson County Prosecutor Jean Peters Baker later abandoned the assault and blackmail case saying that, while she believed Greitens' accuser, she did not think she could prove the charges.",
    "The Hawkeye State has an unusual law that requires party conventions to select nominees in races where no candidate receives over 35% of the vote in the primary, but that provision is unlikely to come into play this year in any of the contests we'll be watching.",
    "Tarkanian previewed his strategy in a video posted just before he filed, saying that the incumbent has \"voted for amnesty for illegal immigrants, for giving your money to Planned Parenthood, for voting for the $1.5 trillion budget which gave him a 20% increase.\"",
    "In her filing, Sheena Greitens attested, \"Prior to our divorce, during an argument in late April 2018, Eric knocked me down and confiscated my cell phone, wallet and keys so that I was unable to call for help or extricate myself and our children from our home.\"",
    "? IA-03: Three Republicans are competing to take on Rep. Cindy Axne, who emerged from the 2020 elections as Iowa's only Democratic representative, in a district based in Des Moines and southwestern Iowa that Trump would have carried by a tiny 49.2-48.9 edge.",
    "Nevada Republican Jim Marchant\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Redistricting\n? OH Redistricting: A group of Ohio voters, with the support of Eric Holder's National Democratic Redistricting Committee, filed a new lawsuit on Monday challenging the replacement congressional map that Republicans passed earlier this month.",
    "The suit comes after the state Supreme Court ruled on Friday that it could not entertain plaintiffs' objections to the map in a pair of pending cases because it had issued a \"final judgment\" when it invalidated the GOP's original district lines in January.",
    "The incumbent's only primary foe is state Sen. Jim Carlin, a pro-Trump die-hard who has baselessly claimed the 2020 election was stolen and spouted antisemitic conspiracy theories blaming wealthy Jews like Mark Zuckerberg and George Soros for the outcome.",
    "? NV-01: Democratic Rep. Dina Titus is defending a seat in the eastern Las Vegas area where her party, in order to make the 3rd and 4th Districts bluer, cut Biden's margin of victory from 61-36 to 53-45, and eight Republicans are now running against her.",
    "Secretaries of State\n? IA-SoS: Republican Secretary of State Paul Pate has no primary opposition in his bid for a third term, while the Democratic contest is a duel between Clinton County Auditor Eric Van Lancker and Linn County Auditor Joel Miller.",
    "? IA-02: Republican Rep. Ashley Hinson, who unseated Democratic incumbent Abby Finkenauer last cycle in a close race for the old 1st District, now faces Democratic state Sen. Liz Mathis in a northeast Iowa seat that Trump would have taken 51-47.",
    "? NV-02: Republican Rep. Mark Amodei learned Friday that he'd have the pleasure of a primary fight against Douglas County Commissioner Danny Tarkanian, who ended his legendary losing streak last cycle after relocating from the Las Vegas area.",
    "? IL-01: While former 3rd District Rep. Dan Lipinski thankfully will not be on the ballot this year, he's endorsing pastor Chris Butler, who shares his anti-abortion views, in the June Democratic primary to succeed retiring Rep. Bobby Rush.",
    "Eric Greitens' ex-wife, Sheena Greitens, accused him of physically abusing both her and their children in 2018, as well as threatening to kill himself, in a court affidavit released Monday in the couple's ongoing child custody dispute.",
    "? IA-01: Freshman Rep. Mariannette Miller-Meeks, a Republican who won the old 2nd District by all of six votes last cycle, faces Democratic state Rep. Christina Bohannan in a southwestern Iowa seat that Trump would have carried 50-48.",
    "? NV-03: Democratic legislators sought to protect Rep. Susie Lee in this southern Las Vegas area seat by extending Joe Biden's margin of victory from just 49.1-48.9 to 52-46, but five Republicans are still campaigning against her.",
    "Also in the running is Chance Bonaventura, who works as an aide to another far-right politician, Las Vegas Councilwoman Michele Fiore (Fiore herself recent ditched a longshot gubernatorial bid to run for state treasurer instead).",
    "The undisputed frontrunner is former Attorney General Adam Laxalt, who lost the 2018 gubernatorial race 49-45 against Democrat Steve Sisolak and now touts endorsements from Donald Trump and the Club for Growth for his latest bid.",
    "The only recent primary poll we've seen was an early March survey from the Democratic pollster Public Policy Polling on behalf of the DGA that gave Lombardo the lead with 26%, while Heller and Lee tied for second with 13% each.",
    "And as for the endless string of courtroom losses Trump allies were dealt when they sought to undo the 2020 election, Marchant has an explanation for that, too: \"A lot of judges were bought off toothey are part of this cabal.\"",
    "Her situation grew worse last week when Attorney General Mark Brnovich asked her to provide more information about 180 misdemeanor cases that were dropped because Adel's office failed to file charges before it was too late.",
    "\"We need to support the people in Ukraine that are not the Biden, the Clintons, the cabal,\" said Marchant, continuing, \"They have patriots like us  that have been oppressed by the cabal, the central bankers for centuries.",
    "The Nevada Independent reported in January that Haw, who was appointed to fill a vacant state Senate seat for a few months in 2016, was \"expected to bring at least half a million of dollars in campaign cash in the bank.\"",
    "? NY-Gov: Empire Results, a dark money group run by a longtime consultant to Rep. Tom Suozzi, is running a new commercial for the June Democratic primary that once again amplifies the congressman's attacks against Gov.",
    "? NY-16: Pastor Michael Gerald last week ended his nascent Democratic primary bid against freshman Rep. Jamaal Bowman, telling Jewish Insider, \"Rather than crash-landing, I think it was the best thing for me to do.\"",
    "The GOP field includes conservative activist David Brog, who previously ran a group funded by the late casino magnate Sheldon Adelson; Army veteran Mark Robertson; and former Trump campaign staffer Carolina Serrano.",
    "She also added that in June of 2018, the month following his resignation, \"I became afraid for my safety and that of our children at our home, which was fairly isolated, due to Eric's unstable and coercive behavior.",
    "Three other Republicans are also running for this northern Nevada constituency that would have backed Trump 54-43, and while none of them look formidable, they could cost Tarkanian some needed anti-incumbent votes.",
    "? FL-22: Attorney Chad Klitzman, state Rep. David Silvers, and Fort Lauderdale Mayor Dean Trantalis have each announced that they won't compete in the August Democratic primary to succeed retiring Rep. Ted Deutch.",
    "? PA-Gov: Pennsylvania Works, which is funded by a DGA affiliate, recently began airing ads touting Attorney General Josh Shapiro, and the Philadelphia Inquirer reports that the size of the buy is $1 million.",
    "However, while former state Athletic Commission member Cisco Aguilar faces no opposition in the June 14 Democratic primary, Republicans have a seven-way contest that includes a well-connected election denier.",
    "Arroyo is campaigning as a criminal justice reformer against appointed incumbent Kevin Hayden in a heavily blue county that's home to Boston and the nearby communities of Chelsea, Revere, and Winthrop.",
    "? NV-AG: Democrat Aaron Ford made history in 2018 when he became the first Black person elected to statewide office in Nevada, and two Republicans are now campaigning to unseat the attorney general.",
    "? NY-01: 2020 2nd District nominee Jackie Gordon has earned an endorsement in the June Democratic primary from 4th District Rep. Kathleen Rice, who represents a seat on the other end of Long Island.",
    "The challenger continued, \"Mark Amodei was the first GOP congressman to join the Democrats in support[ing] President Trump's first impeachment inquiry, and he also blamed President Trump for Jan.",
    "Sheena Greitens further said in her affidavit that, during \"the spring and early summer of 2018,\" her husband had threatened to kill himself \"unless I provided specific public political support.\"",
    "February, though, saw the entrance of Tisha Black, who lost a 2018 race for Clark County Commission and whom the Nevada Independent identified as a former head of a cannabis industry trade group.",
    "She continues that \"multiple people other than myself were worried enough to intervene to limit Eric's access to firearms on at least three separate occasions, in February, April, and May 2018.\"",
    "This behavior included physical violence toward our children, such as cuffing our then three-year-old son across the face at the dinner table in front of me and yanking him around by the hair.\"",
    "? NV-Sen: Democratic Sen. Catherine Cortez Masto will be a top GOP target in a state that both Hillary Clinton and Joe Biden narrowly won, and eight Republicans have filed to go up against her.",
    "McBride claimed in early March that Hucks told him in a call, \"There's an opportunity for you, there's a $70,000 job opportunity for you to step out of this race and support another candidate.\"",
    "The congresswoman's endorsement comes not long after Jay Jacobs, who chairs both the state and county parties, publicly talked down Gillen's chances, though he did not explain his rationale.",
    "Yet Marchant is anything but a pariah in today's GOP, as he has the backing of former Attorney General Adam Laxalt, who is the frontrunner to take on Democratic Sen. Catherine Cortez Masto.",
    "The congressman, though, this time used his interview to say upfront that he'd oppose any impeachment effort, and he soon joined most of his party colleagues in voting against impeachment.",
    "However, Laxalt still faces a surprisingly well-funded intra-party challenge from Army veteran Sam Brown, though it remains to be seen whether Brown will be able to put up a serious fight.",
    "The ex-lawmaker, who has repeatedly addressed QAnon gatherings, has also said that he would not have certified Joe Biden's victory in the state had he been secretary of state at the time.",
    "? NV-04: Three Republicans are challenging Democratic incumbent Steven Horsford in a northern Las Vegas area seat where Democratic legislators doubled Biden's margin from 51-47 to 53-45.",
    "Attorneys General\n? IA-AG: Iowa Attorney General Tom Miller, a Democrat who is already the longest-serving state attorney general in American history, is seeking an 11th term this year.",
    "There's also Clark County Sheriff Joe Lombardo, who is the top lawman in a county that's home to about three-quarters of Nevada's residents and was the field's best fundraiser in 2021.",
    "? PA-Sen: Self-funding attorney George Bochetto's new commercial for the May Republican primary is entirely devoted to attacking TV personality Mehmet Oz for his \"pro-abortion views.\"",
    "Neither Hinson nor Mathis, who were once coworkers at the TV station KCRG (Hinson was a morning news anchor while Mathis hosted the evening news program) have any primary opposition.",
    "Tarkanian, however, is betting those anti-impeachment votes won't actually matter to a base looking to purge the party of anyone who's shown even a hint of disloyalty toward Trump.",
    "Adel herself won a four-year term in a close 2020 contest, but it's not clear if her soon-to-be-vacant post will be on this year's ballot or if voters will need to wait until 2024.",
    "Hardy was a state assemblyman in 2014 when he waged what appeared to be a longshot campaign against Democratic Rep. Steven Horsford in a seat that Barack Obama had carried 54-44.",
    "Bochetto, who earned all of 1% in a recent Fox News survey, doesn't even appear at all except to provide the legally required \"I approve this message\" disclaimer at the very end.",
    "Kihuen, though, didn't seek re-election after multiple women accused him of sexual harassment, and both Hardy and Horsford ended up campaigning for the unexpectedly open seat.",
    "Both McBride and Richardson are trying to deny renomination to Rep. Tom Rice, though they've each been overshadowed in recent weeks by Trump-endorsed state Rep. Russell Fry.",
    "In its decision, however, the court noted that plaintiffs were free to bring a new suit targeting the remedial map, which remains heavily gerrymandered in favor of the GOP.",
    "? NV-Gov: Steve Sisolak's 2018 win made him the Silver State's first Democratic governor in 20 years, and 16 different Republicans are campaigning to unseat him this year.",
    "When her mother confronted the then-governor, Greitens continued, her husband said he'd sought \"to prevent me from doing anything that might damage his political career.\"",
    "Marchant, though, responded to that incontrovertible defeat by baselessly claiming he was the \"victim of election fraud\" and unsuccessfully suing to overturn the results.",
    "? NY-04: Retiring Rep. Kathleen Rice has backed former Hempstead Supervisor Laura Gillen in the June Democratic primary to succeed her in this Nassau County-based seat.",
    "That conspiracy theorist is former Assemblyman Jim Marchant, who challenged Democratic Rep. Steven Horsford last cycle in the 4th District and lost by a 51-46 margin.",
    "The former governor, who is competing in the August Republican primary for Missouri's open Senate seat, responded by calling the allegations \"completely fabricated.\"",
    "Little-known opponent Manuel Casanova exited the race days later and endorsed Westchester County Legislator Vedat Gashi, who is now Bowman's only intra-party foe.",
    "Also in the running are retired Vice Admiral Mike Franken, who lost the 2020 primary for the state's other Senate seat, and Minden City Councilman Glenn Hurst.",
    "Other contenders to watch are venture capitalist Guy Nohra and attorney Joey Gilbert, who has bragged that he was \"definitely on the Capitol steps\" on Jan. 6.",
    "Richardson himself was asked about McBride's claims at a March 7 candidate forum and declared, \"I didn't know anything about this until you dropped your bomb.",
    "House\n? FL-07: Democratic state Rep. Joy Goff-Marcil has announced that she'll run for the state Senate rather than for the open 7th Congressional District.",
    "Hardy was immediately a top Democratic target in 2016, and state Sen. Ruben Kihuen ended up unseating him 49-45 as Hillary Clinton was taking the 4th 50-45.",
    "Another notable candidate is North Las Vegas Mayor John Lee, a longtime conservative Democrat who switched parties just before he launched his new bid.",
    "The frontrunner on the Democratic side looks like former Rep. Abby Finkenauer, who lost a tight battle for a second term last cycle in northeast Iowa.",
    "The GOP field also includes Sparks City Councilman Kristopher Dahir, former TV anchor Gerard Ramalh, and former District Court Judge Richard Scotti.",
    "Kim Reynolds' sole Democratic foe is Deidre DeJear, who lost the 2018 general election for secretary of state 53-45 against incumbent Paul Pate.",
    "Both parties began spending serious amounts of money in the final weeks of the race, but it was still a bit of a surprise when Hardy won 49-46.",
    "The only elected official of the trio is Assemblywoman Annie Black, who attended the Jan. 6 Trump rally the preceded the attack on the Capitol.",
    "Titus' only intra-party foe is progressive activist Amy Vilela, who also ran in the 4th in 2018 and took third place in the primary with 9%.",
    "However, while professional boxer Jessie Vargas announced he was running last year, the secretary of state doesn't list him as a candidate.",
    "Marchant continued to embrace the far-right last week by letting loose an antisemitic rant against Ukrainian President Volodymyr Zelenskyy.",
    "Right after the Jan. 6 attacks, the congressman told Nevada Newsmakers, \"Do I think he (Trump) has a responsibility for what has occurred?",
    "Both parties spent huge amounts of money for their rematch, but this time, a favorable political climate helped Horsford prevail 52-44.",
    "Donald Trump last week said, in the words of the Washington Examiner, that \"Greitens is still in the running for his seal of approval.\"",
    "Lipinski represented about 10% of the new 1st until he left Congress early last year following his 2020 primary loss to Marie Newman.",
    "However, the GOP wave hit Nevada hard, and with a little-known Democrat leading the statewide ticket against popular Republican Gov.",
    "DeJear would be the first Black person elected statewide, but a recent poll from Selzer & Company gave Reynolds a 51-43 advantage.",
    "Bohannan has no opposition in the primary, while Miller-Meeks should have no trouble getting past her one intra-party opponent.",
    "She was later censured by her colleagues on a party-line vote for refusing to comply with the chamber's COVID mitigation rules.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Finally, there's Sam Peters, an Air Force veteran and businessman who took second place in the 2020 primary to face Horsford.",
    "One prominent contender is former Sen. Dean Heller, who lost re-election to Democrats Jacky Rosen during the 2018 blue wave.",
    "The one Republican taking him on is Guthrie County Attorney Brenna Bird, who previously worked as chief counsel to then-Gov.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Senate\n? IA-Sen: Candidate filing closed Friday for Iowa's June 7 primaries, and the state has a list of contenders here.",
    "Meanwhile, the ACLU of Ohio, which served as counsel in the second case, said that it is \"considering next steps.\"",
    "Most of the field has little money or name recognition, but the Republican side does include a few familiar names.",
    "Republicans have several other contenders, with the most formidable looking like Reno-area developer Jesse Haw.",
    "(Miller was elected in 1978, left in 1994 to unsuccessfully run for governor, and regained the post in 1998.)",
    "His campaign manager also characterized the account as \"clearly a politically-motivated attack against him.\"",
    "The only notable contender remains Broward County Commissioner Jared Moskowitz, who earned Silvers' support.",
    "Hucks responded both by denying the bribery allegation and that he'd \"taken a cent from Ken Richardson.\"",
    "The Board of Supervisors, which appointed Adel in 2019, must choose a fellow Republican to replace her.",
    "Further below we'll be taking a look at Nevada's other competitive races now that filing has closed.",
    "Trump himself, though, is supporting Grassley over Carlin, who barely raised any money in 2021.",
    "Eric Greitens is currently competing against several other Republicans in the August primary.",
    "Both Titus and Hardy have primaries ahead of them before they can fully focus on one another.",
    "This time it faults the incumbent for using \"state aircraft to travel to fundraisers.\"",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "And that's who we need to support people that were oppressed by the Soros cabal.\"",
    "Amodei avoided a serious primary fight, but he wasn't done inflaming Trumpists.",
    "Heller, however, has struggled to raise money for his gubernatorial bid.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "None of the other four Republicans have generated much attention yet.",
    "None of the other six Republicans have attracted much attention.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Brian Sandoval, Team Blue's turnout was a disaster.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "Governors\n? IA-Gov: Republican Gov.",
    "I didn't know anything about it.\"",
    "I'm Sarah Godlewski and I will.\"",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "? MO-Sen: Former Gov.",
    "Please read it.",
    "Terry Branstad.",
    "Kathy Hochul.",
    "Yes.\"",
    "6.\""
  ]
}