{
  "id": 2354,
  "mediaId": 124,
  "date": "3/21/2022 12:00:00 AM",
  "headline": "Ketanji Brown Jackson's sleepy confirmation fight finally wakes up",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_08/3537325/220225-ketanji-brown-jackson-mjf-.jpg",
  "link": "https://www.nbcnews.com/politics/meet-the-press/ketanji-brown-jackson-s-sleepy-confirmation-fight-finally-wakes-n1292466",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    802,
    1054,
    1653,
    1763,
    1925,
    2087,
    2302,
    571,
    2972
  ],
  "sentences": [
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nEveryone's coming out swinging tonight,? the moderator of a FreedomWorks forum featuring Ohio's GOP Senate candidates said with a laugh Friday night after former state Treasurer Josh Mandel called out investment banker Mike Gibbons.",
    "White House preps Supreme Court nominee ahead of hearings\nMarch 21, 202202:14\nThe day is set to feature opening remarks by the chair and members of the committee, followed by remarks from Jackson,? who is seeking to become the Supreme Court's first Black female justice, NBC's Sahil Kapur reports.",
    "White House spokesman Andrew Bates, pointing to fact checks that debunk the claims as misleading or distortions of her record, assailed Hawley's desperate conspiracy theory' and said it was based on toxic and weakly-presented misinformation,? Kapur writes.",
    "94 percent: How effective a third dose of Covid vaccination (Moderna or Pfizer) was at preventing death and the need for a patient to be ventilated in January, per a Centers for Disease Control and Prevention study reported on by The Washington Post.",
    "That's the portion of Americans who say Judge Ketanji Brown Jackson should be confirmed to the Supreme Court, according to a new Monmouth University poll, with 21 percent saying she couldn't be confirmed and 24 percent with no opinion.",
    "Elsewhere on the trail:\nOklahoma Senate: Former EPA Administrator Scott Pruitt phoned former President Donald Trump to ask for his endorsement as he considers a run for the state's open Senate seat, NBC's Julie Tsirkin reports.",
    "But first: You have to go back to the 1990s with Stephen Breyer to find a Supreme Court confirmation on the political backburner as much as Ketanji Brown Jackson's has been since Biden nominated her to the court a month ago.",
    "At least 30: How many state legislative leaders (House speakers, Senate presidents and majority leaders) have retired or will retire at the end of their terms, per The Hill and the National Conference of State Legislatures.",
    "The moderator probably didn't think punches would actually be thrown, but 10 minutes later, Mandel and Gibbons seemingly almost came to blows as Mandel knocked Gibbons' stock holdings and business dealings in China.",
    "Because Republicans like Ron Johnson  and let's be honest, too many Democrats  don't have the guts to stand up to the pharmaceutical companies,? Godlewski says in the 30-second spot, shared first with NBC News.",
    "Pennsylvania governor: State Attorney General Josh Shapiro is embracing his support for abortion rights in his gubernatorial bid with the future of Roe v. Wade hanging in the balance.",
    "The other part is that this Supreme Court seat doesn't change the court's balance of power  with Jackson replacing Breyer on what's already a 6-to-3 conservative majority court.",
    "Other numbers you need to know today:\n0: The number of Republican members of Congress who served longer than the late Rep. Don Young, R-Alaska, whose tenure spanned 49 years.",
    "Pennsylvania Senate: Former first lady Melania Trump has told her husband she supports celebrity doctor Mehmet Oz in the state's crowded GOP Senate primary race.",
    "You don't know squat,? Gibbons added, and Mandel responded, Two tours in Iraq, don't tell me I haven't worked!? The crowd booed as the pair had to be separated.",
    "Forty seven percent say she's at least very or somewhat qualified, 9 percent say she is not qualified and 43 percent don't know enough to share their opinion.",
    "Wisconsin state Treasurer Sarah Godlewski is focusing on drug prices in her new TV ad, criticizing both GOP Sen. Ron Johnson and her fellow Democrats.",
    "A slim majority, 53 percent, approve of Biden's pledge to name a Black woman to the court with his first pick (with 41 percent disapproving).",
    "Still, this confirmation fight finally heats up this week, with four days of Senate Judiciary Committee hearings that start Monday morning.",
    "10 million: The number of people who have fled their homes as Russia attacks Ukraine, according to the U.N. High Commissioner for Refugees.",
    "Last week, [Sen. Josh] Hawley issued a series of tweets arguing that Jackson isn't tough enough on sex offenders who prey on children.",
    "The ad is part of a seven-figure? ad buy across TV and digital platforms in the state's major media markets, per Godlewski's campaign.",
    "The episode highlights how nasty some GOP primaries have become, overshadowing discussions about more substantive policy differences.",
    "$4 million: How much spending has been tracked by AdImpact on ads this cycle that use the phrase RINO? (Republican in Name Only).",
    "South Carolina 01: NBC News heads down to Summerville to take a look at the Trump-backed attempt to oust GOP Rep. Nancy Mace.",
    "The hearings come as some Republican senators have ramped up their attacks on Jackson, portraying her as being soft on crime.",
    "Sign up for First Read; Get First Read from Meet the Press for fresh reporting and analysis on the top political stories.",
    "Sign up for First Read; Get First Read from Meet the Press for fresh reporting and analysis on the top political stories.",
    "A small, but vocal, minority of Republicans continues to argue for America First? isolationism over supporting Ukraine.",
    "You've never been in the private sector,? Gibbons said, prompting Mandel to stand up and go nose-to-nose with Gibbons.",
    "WASHINGTON  If it's Monday ... President Joe Biden heads later this week to a NATO conference in Brussels.",
    "Circuit Court of Appeals Judge Thomas Griffith and University of Pennsylvania law professor Lisa Fairfax.",
    "Maryland and Georgia have temporarily suspended their gas taxes to give residents a break at the pump.",
    "And 69 percent say that having a court that's more reflective of the nation's diversity is important.",
    "238: The number of bills filed in state legislatures that would limit the rights of LGBTQ people.",
    "Part of the reason is the war in Ukraine, which has dominated the news over the last month.",
    "28: The number of people shot (with one killed) at an Arkansas car show this past weekend.",
    "For decades, Washington politicians have promised to lower the cost of prescription drugs.",
    "The altercation came after a question about the U.S. response to the war in Ukraine.",
    "Political campaigns are taking to TikTok as they look to win over younger voters.",
    "Introducing Jackson, NBC's Ali Vitali adds, will be conservative former D.C.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Many Democrats want to shake up the presidential nominating calendar.",
    "... Ukraine rejects Russia's demand to surrender Mariupol.",
    "... Supreme Court Justice Clarence Thomas is hospitalized.",
    "... Ohio Senate forum gets combative And RIP, Don Young.",
    "But that could prove more difficult than it sounds.",
    "... China Eastern 737 crashes in southern China.",
    "But every year, the prices go up.",
    "Case in point?",
    "Why?"
  ]
}