{
  "id": 2355,
  "mediaId": 195,
  "date": "3/21/2022 12:00:00 AM",
  "headline": "Marianne Williamson endorses Tom Nelson in Wisconsin Senate race",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/williamsonmarianne_091919gn4_lead.jpg?itok=YOyVGbJo",
  "link": "https://thehill.com/homenews/campaign/598979-marianne-williamson-endorses-tom-nelson-in-wisconsin-senate-race",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester",
  "termIds": [
    741,
    802,
    1568,
    2039
  ],
  "sentences": [
    "Whether it's standing up for paper mill and factory workers and dairy farmers who are being ground up for corporate profit, or envisioning an American environmental policy that heals our planet while making our communities stronger and less reliant on Big Oil, or making clear the need for Medicare for All, Tom has distinguished himself from among the Democratic field,\" she continued.",
    "As more national activists and Wisconsin Democrats engage in this Senate race, they'll see our campaign as having not just the BEST shot  but also the most consistent progressive vision at beating Ron Johnson come November,\" Nelson said in a statement to The Hill.",
    "Williamson, an author who has also been described as a spiritual adviser, went on to say how Nelson views the Senate race as \"not merely a political struggle, but a moral and spiritual one,\" citing his background as the son of a pastor.",
    "Former presidential candidate Marianne Williamson endorsed Outagamie County Executive Tom Nelson in Wisconsin's Democratic Senate primary on Monday, calling Nelson \"the candidate with the truest progressive vision.\"",
    "Tom Nelson has consistently shown himself to be a change agent in confronting the various crises facing our nation,? Williamson said in a statement.",
    "The progressive candidate is a part of a crowded Democratic primary field vying to challenge incumbent Sen. Ron Johnson (R-Wis.) in November.",
    "Mandela Barnes (D) leading the field, with 23 percent support, followed by Milwaukee Bucks executive Alex Lasry at 13 percent support.",
    "Notably, 48 percent of respondents gave no preference, leaving room for movement ahead of the state's Aug. 9 primary.",
    "Nelson trailed at 5 percent, and Wisconsin state Treasurer Sarah Godlewski came in at 3 percent support.",
    "He described the endorsement as a sign that his Senate bid is gaining progressive momentum in Wisconsin.",
    "A Marquette University Law School survey released earlier this month showed Lt. Gov.",
    "Nelson has also received endorsements from Sunrise Wisconsin and local labor groups.",
    "Williamson's backing is one of Nelson's most high-profile endorsements to date.",
    "The Hill was the first outlet to report on the endorsement."
  ]
}