{
  "id": 2412,
  "mediaId": 195,
  "date": "d2022-01-14T12:31",
  "headline": "Senate Democrats' super PAC releases $1 million ad buy against Ron Johnson",
  "image": "https://cdn.jwplayer.com/v2/media/grrhidyA/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/589722-senate-democrats-super-pac-releases-1-million-ad-buy-against-ron-johnson",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester",
  "termIds": [
    802,
    1568,
    1925,
    2039,
    2272,
    101,
    141,
    146,
    571,
    2972
  ],
  "sentences": [
    "Mandela Barnes (D) said in a statement that the only people celebrating the announcement were Johnson's \"donors and corporate special interests,\" while Outagamie County executive Tom Nelson said in a statement Johnson has spent the last ten years \"catering to the ultra-wealthy millionaires and corporate interests.\"",
    "The Senate Majority PAC on Friday rolled out a $1 million ad buy against incumbent Sen. Ron Johnson (R-Wis.), becoming the latest Democratic group to hit Johnson on air following the announcement of his reelection bid.",
    "Wisconsin state treasurer Sarah Godlewski blasted Johnson for announcing his reelection bid in the Wall Street Journal, calling it a sign of how much Johnson \"has left Wisconsin and our working families behind.\"",
    "Candidates running in the state's Senate Democratic primary have slammed Johnson's reelection announcement, painting him as a politician beholden to special interests.",
    "In one of the ads, Johnson explained why he was running for another term despite saying six years ago that he would only serve two terms in the Senate.",
    "The top Senate Democratic super PAC's ad is set to be aired on television markets in the Badger State, as well as on digital and streaming platforms.",
    "The Democratic Senatorial Campaign Committee rolled out an ad on Sunday shortly after Johnson announced his reelection campaign.",
    "The ad comes after Johnson's campaign released two ads after he announced he would seek a third term in the upper chamber.",
    "Barnes's campaign told The Hill on Wednesday it hads raised nearly $150,000 following Johnson's reelection announcement.",
    "The ad is the latest spot from a Democratic group attacking Johnson ahead of the midterms.",
    "\"It's no surprise Johnson broke his promise to only serve two Senate terms,\" the ad says.",
    "If you're in a position to make our country safer and stronger, would you just walk away?",
    "\"With Democrats in total control, our nation is on a very dangerous path.",
    "The Senate Majority PAC ad hits Johnson over the comments.",
    "I decided I can't,\" Johnson says in the spot.",
    "Wisconsin Lt. Gov."
  ]
}