{
  "id": 2418,
  "mediaId": 129,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "Nobody's Getting Special Treatment in 2022",
  "image": "https://static01.nyt.com/images/2022/01/11/us/politics/11onpoilitics-pm-newsletter-1/merlin_193128702_a678e0f0-11d6-4dc7-9792-c45ea3ca53cf-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/01/11/us/politics/democrats-ron-johnson-2022.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    741,
    802,
    1568,
    2039
  ],
  "sentences": [
    "We're here today to stand against the forces in America that value power over principle,? Biden said, connecting those imposing new restrictions on voter access to the rioters who stormed the U.S. Capitol on Jan. 6. The right to vote and have that vote counted is democracy's threshold liberty.?\nReacting to the speech, Spencer Overton, head of the Joint Center for Political and Economic Studies and the author of a book on voter suppression, told us: Biden was not silent today.",
    "For voters that aren't paying attention closely to politics from day to day,? he said, that's the stuff that feels most extreme and disappointing.?\nWhat to read tonight\nA New York Times analysis of climate data by Krishna Karra and Tim Wallace found that temperatures in the United States last year set more all-time heat and cold records than any other year since 1994.?\nHarry Reid lived for the Senate floor.",
    "As Johnson wrote in his announcement in The Wall Street Journal, Countless people have encouraged me to run, saying they rely on me to be their voice, to speak plain and obvious truths other elected leaders shirk from expressing  truths the elite in government, mainstream media and Big Tech don't want you to hear.?\nPartisanship has also deepened since the pre-Trump era.",
    "Instead, the ad begins: Has Ron Johnson been looking out for himself, or you?? It cites an AP headline, Report: Johnson pushed for tax break benefitting megadonors.?\nCut-and-paste attacks\nIn Washington, Democrats bash Trump and his allies for elevating conspiracy theories about the 2020 election and for sowing misinformation about the coronavirus.",
    "He drew clear lines that you're either for democracy or you're against democracy.?\nHere are some highlights of our coverage:\nBiden is pressing the Senate to alter the filibuster, an institutional rule that effectively requires a 60-vote threshold for most legislation, including two voting rights bills Republicans uniformly oppose.",
    "Take Todd Akin, a Missouri Senate candidate who was ostracized from the Republican Party in 2012 for saying: If it's a legitimate rape, the female body has ways to try to shut that whole thing down.? Claire McCaskill, the Democrat who defeated Akin, later confessed to shotgunning a beer when Akin won the G.O.P.",
    "In Georgia, Secretary of State Brad Raffensperger, a Republican who stood up to Trump's false claims of election fraud, accused Democrats of pushing for a federal elections takeover.?\nGeorgia has become the crucible for the national struggle over voting rights, Zolan Kanno-Youngs and Astead W. Herndon write.",
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering, though this year's map is poised to be surprisingly fair\nGovernors' Races: Georgia's contest will be at the center of the political universe, but there are several important races across the country.",
    "For the 2022 midterms, Democrats may be betting that the generic conventions that have worked in countless campaigns  attacking candidates' voting records, elevating so-called kitchen-table? issues  are more likely to move the voters they need to reach than righteous condemnation over fringe ideas.",
    "It's a return to the plutocrat-bashing that was so successful for Barack Obama in the 2012 presidential election against Mitt Romney, and a rejection of Terry McAuliffe's more recent efforts to anchor Glenn Youngkin to Trump in the Virginia governor's race.",
    "Fauci's public financial disclosure reports are releasable through the Ethics in Government Act.? She added: Anyone can obtain them by submitting OGE Form 201 request, as described on the NIH FOIA portal website.?\nIs there anything you think we're missing?",
    "One more thing\nAt a hearing Tuesday before the Senate Committee on Health, Education, Labor and Pensions, Dr. Anthony Fauci was caught on a hot mic muttering under his breath after an exchange with Senator Roger Marshall, a Republican from Kansas.",
    "The New York Times covered every angle of Tuesday's appearance by President Biden and Vice President Kamala Harris in Atlanta, where they delivered forceful, back-to-back addresses demanding the Senate act on federal voting rights legislation.",
    "Ben Wikler, the chairman of the Wisconsin Democratic Party, put it this way: It's what affects people more than what offends people.?\nTop target\nWisconsin is one of the country's most fiercely contested political battlegrounds.",
    "Marshall had been pressing Fauci to share his personal financial disclosure forms, insinuating that the National Institutes of Health's top infectious disease expert might be benefiting improperly from inside information.",
    "As Wikler, the Democratic state chairman, explained it, the allegations about Johnson's self-dealing are more likely to break through to ordinary Wisconsinites than his comments about the coronavirus or the Capitol riot.",
    "Noticeably absent from the ad, which was sponsored by the Democratic Senatorial Campaign Committee, are Johnson's stances on two of the biggest issues that the country is facing: the pandemic and political violence.",
    "Or, you might know him as the guy who has said Jan. 6 didn't seem like an armed insurrection.? Up until this weekend, he was also the Republican dragging his feet on whether to run for a third Senate term.",
    "And then there's the simple magnitude of the challenge: If Democrats are going to mention the things that they find to be the most outlandish, they then have to spend time explaining why it's outlandish.",
    "They might be hoping to reach the surprisingly large group of Wisconsin voters who haven't formed an opinion of Johnson  just over 20 percent, according to polling data from the Marquette Law School.",
    "Democrats are going to have to come up with some new messaging, because everything they're talking about now is old,? said Brandon Scholz, a Republican and former strategist based in Wisconsin.",
    "But if Wisconsin is an indicator of what's to come, Democrats seem to be gravitating toward conventional candidate attack lines that have little to do with the political outrage of the moment.",
    "Republican primaries are still sorting themselves out in Pennsylvania, Georgia and Arizona  which means that Johnson will be the Democratic Party's chief villain for the next few months, too.",
    "It doesn't mention that he's questioned the efficacy of vaccines, or has used his perch on the Homeland Security Committee to amplify Donald Trump's false claims about a stolen election.",
    "Wouldn't you agree with me that you see things before members of Congress would see them, so that there's an air of appearance that maybe some shenanigans are going on?? Marshall said.",
    "In Pennsylvania, Mehmet Oz, a celebrity doctor who has advocated for using unproven drugs to treat Covid-19, could become the Senate nominee for Republicans.",
    "Republicans are going to be furious over those references putting them on the side of Southern racists like George Wallace and Bull Connor,? he predicts.",
    "He also lived on it,? writes Carl Hulse in a remembrance of the late Senate majority leader, who will lie in state in the Capitol Rotunda on Wednesday.",
    "In the pre-Trump world, Democrats actively rooted for opponents known for making outlandish or false statements, because they made for easier targets.",
    "Mandela Barnes and State Treasurer Sarah Godlewski, along with Alex Lasry, an executive with the Milwaukee Bucks, and Tom Nelson, a county executive.",
    "If you don't live in Wisconsin, you probably know Ron Johnson as the senator who has suggested gargling with mouthwash to ward off the coronavirus.",
    "The difference would be that as soon as it happened, there would just be a chorus on the right that would just say, Oh, yeah, yeah, that's true.",
    "Even if some voters find certain rhetoric to be unsavory, they would rather not vote for someone who would build the opposing party's majority.",
    "Will Democrats attack him for that, or would they go after him as a wealthy carpetbagger who has been living for years in New Jersey?",
    "That makes Johnson a top target for Democrats, who are hoping that defeating him will help them hang onto their Senate majority.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycle's defining topics.",
    "Multiple Democrats are vying to take on Johnson, though they all entered the race before they knew he was running again.",
    "A woman's body can just shut that down,'? said Jason Kander, a Democrat who fell short in the 2016 Missouri Senate race.",
    "They're voting against not just the candidate on the ballot in front of them, but also Nancy Pelosi or Mitch McConnell.",
    "They have covered everything he's said.?\nIt might just be easier to discredit the messenger, rather than the message.",
    "Since Trump won the state in 2016, shattering Hillary Clinton's blue wall,? Democrats have crawled their way back.",
    "And Democrats responded immediately with a television ad that provided an early glimpse of their 2022 messaging.",
    "In fact, it doesn't mention any of the incendiary comments that have landed him in the national spotlight.",
    "Candidates, taking their cues from Trump, have also learned to recast their gaffes as bold truth-telling.",
    "Now, however, many Democrats doubt that comments like Akin's would register with voters in the same way.",
    "In 2018, Tony Evers was elected governor and Senator Tammy Baldwin won re-election, both Democrats.",
    "Fauci replied that Marshall was totally incorrect? and that his records were publicly available.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "Johnson isn't the only candidate who has repeated misinformation on the pandemic.",
    "That's leading to an angry pushback from Senate Republicans, Carl Hulse reports.",
    "Midterms Begin: The Texas primaries officially opened the 2022 election season.",
    "Jesus Christ.?\nAsked about the encounter, an NIH spokesperson replied, Dr.",
    "In 2020, Biden won the state, by barely more than 20,000 votes.",
    "What a moron,? Fauci could be heard whispering afterward.",
    "His staff had been unable to find the forms, he added.",
    "Here are the four incumbents most at risk.",
    "On Sunday, Johnson finally jumped in.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "See the full primary calendar.",
    "We'd love to hear from you.",
    "Did Trump change the game?",
    "Among them are Lt. Gov.",
    "primary."
  ]
}