{
  "id": 2439,
  "mediaId": 195,
  "date": "1/7/2022 12:00:00 AM",
  "headline": "Democrats look to diversify ranks in bid to keep Senate",
  "image": "https://cdn.jwplayer.com/v2/media/zzjmM7J0/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/588692-democrats-look-to-diversify-ranks-in-bid-to-keep-senate",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester",
  "termIds": [
    741,
    802,
    1916,
    2039,
    2087,
    146,
    318,
    562,
    571,
    2945
  ],
  "sentences": [
    "Their candidacies shone a light on their lived experiences and how these inequities affected their lives.?\nBiden's Build Back Better package stalled in the Senate last month after moderate Sen. Joe Manchin (D-W.Va.) abruptly said in a cable news interview that he would not support it, sending fellow Democratic senators and rank-and-file voters into an angry fury after months of discussions and promises about passing the legislation by the end of 2021.",
    "The internal poll found that his support with primary voters grew to 46 percent once they received his biography, which includes some notable hardships like being less affluent than his opponents and receiving a state-run Medicaid supplement as recently as the last midterm cycle, according to a report by the Milwaukee Journal Sentinel.",
    "Some of the 2022 elections' highest-profile Senate contenders are more racially, economically and ideologically diverse than in previous midterm cycles, illustrating a new consciousness of identity toward a part of Capitol Hill that is constantly criticized for being older, whiter and more male-dominated than the rest of the country.",
    "Beyond Barnes, two other candidates, Charles Booker and Malcolm Kenyatta, who are running to unseat Sen. Rand Paul (R) in Kentucky and to replace retiring Sen. Pat Toomey (R) in Pennsylvania, respectively, have also received the Working Families Party's stamp of approval, along with top labor and activist leaders.",
    "Adding more true champions of the multiracial working class is an absolute priority this year because it's the only way we'll be able to pass an agenda that meets the needs of working-class people,? said Joe Dinkin, campaigns director at the Working Families Party, which has endorsed Barnes.",
    "With the changing demographics of our country and the exposure of disparities in health care, wages and education caused by the pandemic, it's refreshing and encouraging to see a diverse slate of U.S. Senate candidates,? she said.",
    "In the build-up to November, Democratic candidates of color are taking the lead in primaries nationwide, a marked contrast from past early cycles that have sent white candidates to victory, sometimes over minority contenders.",
    "Many argue that for too long, the upper chamber has represented a tired version of what Washington politics used to be  and still is to an extent  where corporate money, gender and race were often tied to power at the table.",
    "With all the enthusiasm of a possible landscape shift, some Democrats still acknowledge that it will not be easy to break through in a midterm cycle that is already being labeled by forecasters as particularly challenging.",
    "You're starting to see candidates' backgrounds and experiences reflect those that they're trying to represent,? said Antjuan Seawright, an adviser to House Majority Whip James Clyburn (D-S.C.), who has endorsed Lt. Gov.",
    "That is especially the case given the current economic climate, the COVID-19 pandemic and the desire to pass President Biden's biggest policies ahead of what is likely to be a tough election year for the party in power.",
    "Regardless of whether they win or lose their election,? Murdock said, they are building necessary political and donor relationships to support running for office again and future candidates that look like them.?",
    "\"As a former judge, mother and woman of faith, I know I will bring an important perspective to the Senate that's missing now, but that's not the only reason I'm running,\" Beasley said in a statement to The Hill.",
    "Organizers for the Working Families Party and other progressive groups are coordinating with a host of candidates they believe can help refashion the Senate to more accurately represent Americans' perspectives.",
    "Democrats angling to keep the Senate in their grasp are also aiming to reshape the chamber's makeup while they're at it, hoping their candidacies will help reflect a more inclusive Washington if elected.",
    "In a time of rising inequality, there are a lot of voters that want to see working-class people in office, that want to see somebody that can relate to them and is going to fight for them,? he said.",
    "There's a tremendous amount of excitement not only inside the Democratic Party right now, but I think among voters who reflect the day-to-day experiences that Americans have,? the source said.",
    "Barnes, who is the first Black official to serve as Wisconsin's lieutenant governor, has consistently led the 11 other Democrats running in the Democratic Senate primary by double digits.",
    "Matthew Daggett, a political consultant working for Kenyatta's camp, believes that he has a compelling enough personal narrative to convince voters to turn out for him over other rivals.",
    "Some Democrats believe having a more diverse Senate caucus means lawmakers like Manchin would have less sway to block bills essential to bringing relief to those who are struggling.",
    "In the current campaign map, other candidates  including several progressive and even less well-known aspirants  are aiming to make over the way the Senate looks after November.",
    "In North Carolina, state Sen. Jeff Jackson (D) dropped out of that race's Senate primary last month and promptly endorsed former state Supreme Court Chief Justice Cheri Beasley.",
    "\"The people of North Carolina deserve a senator who understands the challenges they face every day and will fight for those who have been left behind and ignored for too long.\"",
    "A source close to the campaign told The Hill that they believe his lived experiences and statewide name recognition have played a role in helping him gain an edge.",
    "Democrats say that there is greater urgency to recruit candidates whose own pasts can be seen through the eyes of voters living through similarly trying times.",
    "He entered the state's Democratic Senate primary in July against a crowded field, including state Treasurer Sarah Godlewski and businessman Alex Lasry.",
    "Kenyatta, an openly gay millennial, is running against arguably higher profile contenders in the Democratic primary, including Rep. Conor Lamb (D-Pa.).",
    "We have earned the right to see ourselves on the ballot through advocacy and sweat equity,? said North Carolina state Sen. Natalie Murdock (D).",
    "He currently holds a 29-point electoral lead, according to an internal poll from his campaign released exclusively to The Hill on Friday.",
    "Looking to systematically change that, liberal groups are boosting Democrats who are more ideologically progressive and racially diverse.",
    "Beasley already made history in 2019 when she became the first Black woman to serve as chief justice of the North Carolina Supreme Court.",
    "Only two Black women, Vice President Harris and former Sen. Carol Moseley Braun (D-Ill.), have been elected to serve in the Senate.",
    "While Barnes is indeed gaining prominence due to his significant polling spike, he's not entirely alone in rising to recognition.",
    "But to those working to diversify the Senate, the effort is nonetheless worthwhile for the potential precedent it can set.",
    "If elected, Beasley would be the first Black senator to represent the Tar Heel State on Capitol Hill.",
    "Jackson, a member of the Army National Guard, has served in North Carolina's state Senate since 2014.",
    "His move to bow out of the primary likely saved Democrats from a bruising intraparty contest.",
    "But Daggett says Kenyatta can generate sorely needed enthusiasm? with his own narrative arc.",
    "In the 2020 election, she was ousted by Republican Paul Newby by only 401 votes.",
    "For the Barnes camp, these bumpy times are also strategic advantages.",
    "Beasley is widely considered to be the likely Democratic nominee.",
    "Mandela Barnes (D) in the upcoming Wisconsin Senate contest."
  ]
}