{
  "id": 3289,
  "mediaId": 151,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Threat to Roe puts GOP on defense in 2022 battlegrounds",
  "image": "https://www.politico.com/dims4/default/21efea8/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Ff0%2F23%2F852ed6d742889bdc23a438786ec8%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1240289533",
  "link": "https://www.politico.com/news/2022/05/07/gop-steers-clear-of-roe-in-2022-battlegrounds-00030880",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    1837,
    852,
    3048,
    571,
    146,
    428,
    2751,
    2818,
    2819
  ],
  "sentences": [
    "I think this is going to be an important issue that women in the suburbs are going to be looking for.\nBrandon Scholz, former executive director of the Wisconsin Republican Party, said my black helicopter theory is that inside the court somebody [who] liked Democrats or liberals or whoever, were the ones who leaked it, because theyre getting the most benefit out of this.\nRepublican voters were already energized to go to the polls, Scholz said, whereas Democrats have been struggling to excite the base.",
    "In a statement this week after the disclosure of the draft ruling, Morse said he was proud of his pro-life record in the state Senate, where the legislature settled the law in New Hampshire that permits abortions in the first six months while banning late term and partial birth abortions in the last 12 weeks of a pregnancy  a policy that the vast majority of Granite Staters support.\nThis potential decision will have no impact on New Hampshire, Morse continued.",
    "The Alaska senators position aligns with the NRSC advice for candidates to present themselves as a compassionate consensus builder on abortion policy. The committee even sees opportunities to go on the offensive, by highlighting Democrats refusal to state clear positions on whether they support late-term abortions, according to a person familiar with Republican messaging strategies.",
    "Vance, the Republican nominee, fired off a tweet about the interview, saying Ryan had a barbaric position for defending abortion through 40 weeks.\nAnd when Sen. Mark Kelly (D-Ariz.) on Thursday tweeted in favor of passing the Democrat-sponsored Womens Health Protection Act to codify Roe, Blake Masters, a Republican rival, teed off on the legislation.",
    "The things hes talked about since the beginning are the things well focus on.\nThats fairly close to the guidance offered by the National Republican Senatorial Committee, which was where GOP Senate candidates looked for messaging help after POLITICO reported Monday night that the Supreme Court was poised to overturn Roe.",
    "So now, we have May and June  but there are 185 days until the election.\nCarney, who is consulting for Chuck Morse, the state Senate president seeking the Republican nomination to challenge Sen. Maggie Hassan (D-N.H.), said Morse is not running away from abortion and has articulated his position when asked.",
    "Republicans arent jumping up and down as much as Democrats are because they may be a little more cautious and wondering if this is actually going to happen.\nPennsylvanias contentious race for an open Senate seat is proving to be one notable exception to the GOP rule about downplaying the impending decision.",
    "Among those in the most competitive contests, reaction to the news that the Supreme Court was poised to overturn the 1973 Roe v. Wade decision has been muted, marked by statements in support of overturning Roe and great caution to avoid placing abortion at the center of their campaigns.",
    "| Ronda Churchill/Getty Images\nBy Natalie Allison and Holly Otterbein\n 05/07/2022 12:27 PM EDT\nIn the top Senate battlegrounds, Democrats are buying up television time and sounding off at every opportunity about Republican plans to curtail abortion rights.",
    "Progressives rallied in Anchorage and Fairbanks last week, where they slammed Murkowski for her votes to confirm Justices Samuel Alito, Neil Gorsuch and Amy Coney Barrett, who make up the anticipated majority opinion on the courts upcoming abortion ruling.",
    "That stands in stark contrast to one of his prospective opponents, Sarah Godlewski, the Wisconsin state treasurer who sought to break out of a crowded Democratic Senate primary by pouncing on the issue as soon as news broke Monday night.",
    "Murkowski is trying to chart a middle course consistent with her record of favoring abortion rights by pushing a proposal  along with Sen. Susan Collins (R-Maine)  to codify Roe v. Wade thats narrower than a Democratic version.",
    "Pointing to Ozs past comments expressing concerns about a restrictive Alabama measure, they have argued that Oz is not truly anti-abortion and have sought to portray themselves as the real social conservatives in the race.",
    "When Ohio Democratic Senate nominee Tim Ryan was asked on Fox News last week whether there should be limits on abortion access, he tried to sidestep the question, before saying it should always be a womans decision.",
    "I firmly believe that the issues that people are talking about and that you see in a lot of polling, unless you see a poll with a push question on abortion, its inflation, its gas prices, its crime, he said.",
    "Instead, the NRSC urged candidates to emphasize Democratic officials support for late-term abortion, then pivot to Bidens handling of inflation, Americas energy dependence and issues at the southern border.",
    "A spokesperson for Laxalt declined to elaborate on how the abortion issue was playing out in the race or Laxalts strategy for discussing it, instead pointing to the statement released days earlier.",
    "But in a state where abortions are legal up to 24 weeks  and where polling shows the majority of voters favor some restrictions on the procedure  the campaign prefers to move on to other issues.",
    "The people of Nevada have already voted to make abortion rights legal in our state, and so no matter the Courts ultimate decision on Roe, it is currently settled law in our state, he said.",
    "The Roe v. Wade draft opinion is helping stir up the Democratic grassroots, at least for now, he argued, but he doesnt expect it to change the major concerns driving voters in the fall.",
    "The campaign committee sent out a memo last week with proposed talking points to combat potential attacks from Democrats, but did not suggest that Republicans lead with the issue.",
    "Anybody in politics with two brain cells knew that this issue was going to come up at the end of June, most likely, said Dave Carney, a New Hampshire-based Republican strategist.",
    "Godlewski, who was visiting D.C. at the time, held an impromptu press availability outside the Supreme Court that night, then recorded a campaign ad there later in the week.",
    "Republican Senate candidates there have been talking about abortion for weeks as a way to pummel Mehmet Oz, the celebrity doctor endorsed by former President Donald Trump.",
    "Some Republicans  notably first-time candidates  are already signaling their intention to stake out a combative position, rather than adopt a defensive crouch.",
    "The threat to Roe has also put Republican Sen. Lisa Murkowski (R-Alaska), who is up against Trump-endorsed challenger Kelly Tshibaka, in a quandary.",
    "Republican Senate candidate from Nevada Adam Laxalt speaks at a campaign event at Stoneys Rockin Country on April 27, 2022 in Las Vegas, Nevada.",
    "Mark Kelly supports partial birth abortion, Masters wrote in a quote-tweet that continued on to describe late-term abortion in explicit terms.",
    "We have seen this before in 2020, whether it was in Georgia or in Wisconsin, with pushing Joe Biden over the edge with those 20,000 votes.",
    "Were going to talk about the economy, about energy, about the failed Biden policies, about the open border, Carney said of Morses message.",
    "Yet Murkowskis efforts arent enough to placate Democrats whose support shell need under Alaskas new ranked-choice voting system.",
    "In turn, Oz has played up his anti-abortion credentials and expressed support for striking down Roe v. Wade: The Court is right.",
    "Laxalt then shifted to reminding voters that Nevada likely wont feel the effects of a new court ruling on abortion this summer.",
    "Women in the suburbs are a critical coalition that we have to communicate and do well with, Godlewski said in an interview.",
    "I look forward to supporting pro-life legislation that saves innocent lives in the U.S. Senate, he said in a statement.",
    "The expected overturning of Roe represented an historic victory for the sanctity of life, he said in a statement.",
    "In Nevada, Republican Senate candidate Adam Laxalt, the states former attorney general, had a similar response.",
    "The goal of this unprecedented breach is to intimidate sitting Supreme Court justices, he tweeted.",
    "The ad buy is a six-figure purchase of television time statewide, according to her campaign.",
    "), focused on the unprecedented disclosure of the draft opinion, more than its substance.",
    "Abortion laws should be left up to the American people and their elected representatives.",
    "Alex Lasry, another Democrat in the race, tweeted his own video from outside the court.",
    "On social media in the days since, Johnson has focused on inflation and the border.",
    "They have seized on the moment  and consider it a possible turning point.",
    "One of the GOPs most vulnerable incumbents, Sen. Ron Johnson (R-Wisc.",
    "And he wants to force your state to allow it.",
    "Many Republicans, though, are shrugging.",
    "Roe was wrongly decided.",
    "This was anticipated.",
    "J.D."
  ]
}