{
  "id": 3453,
  "mediaId": 238,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "In N.C., a Black woman brings up abortion in Senate run. Her Trump-backed rival doesnt.",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/15/beasley-budd-abortion-trump/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Annie Linskey",
  "authorUrl": "https://www.washingtonpost.com/people/annie-linskey/",
  "termIds": [
    729,
    802,
    1147,
    1404,
    3973,
    146,
    243,
    371,
    571,
    2834
  ],
  "sentences": [
    "In Wisconsin, state Treasurer Sarah Godlewski, who is seeking the Democratic nomination for Senate, has released a TV ad focusing on abortion that ends with her saying: As your senator, I will never sit by and allow our rights to be stripped away.\nIn North Carolina, for a Democrat to win statewide, strong turnout among Black voters as well as a significant share of suburban swing voters would likely be required.",
    "No matter how you feel about the issue of abortion, the way that opinion was written, what we all know for sure is that all of our civil rights are under attack, Beasley, a Democrat who made history as the first Black woman to be chief justice of the North Carolina Supreme Court, said at an outdoor town hall meeting at a park here Thursday.",
    "Its a very radical thing to be doing, but we may have to do that.\nShould Roe v. Wade be overturned this year, North Carolina, the furthest Southeastern state not expected to swiftly ban abortion, according to study from the nonprofit Guttmacher Institute, could become a major regional destination for women who want to end their pregnancies.",
    "I also believe in the Tenth Amendment and bringing it to the states.\nIn battleground races all across the country since the draft opinion that would overturn the ruling establishing a constitutional right to abortion became public early this month, Democratic candidates have been more eager to talk about the issue than Republicans.",
    "For all the discussion around North Carolina as a safe state for abortion, while that may be true in the immediate aftermath of the final ruling from the Supreme Court, it may very well not be the case come November, said Alison Kiser, the executive director of Planned Parenthood Votes!",
    "In addition to Budd, who leads a crowded field in public polls on the GOP side, other Republican candidates also say little about abortion, even as the leaked decision means the party is on the brink of a victory for many conservatives thats a half-century in the making.",
    "Later that same day, Rep. Ted Budd, a Republican Senate contender backed by former president Donald Trump, made no mention of abortion during a brief stump speech two hours to the east on the second floor of the industrial chic Carolina Brewery & Deli in Pittsboro.",
    "Two other candidates in the field of 14 gave brief remarks Wednesday night during a Republican womens dinner hosted at the Old North State Club, part of a gated community near New London, N.C., that features a top-rated golf course and abuts sparkling Badin Lake.",
    "In the interview with Budd, whose campaign literature prominently notes that he will protect the unborn, the congressman offered a variety of reasons for omitting abortion from his brief remarks in Pittsboro, including that didnt want to elevate a leaked opinion.",
    "Beasley spoke to The Washington Post afterward, inviting a reporter into the back of her campaign SUV for the interview to avoid a tracker from America Rising, a Republican opposition research group that has dispatched staff to film all of her public events.",
    "But even if the GOP falls short of achieving supermajorities in November, there are a handful of Democrats who reliably vote with Republicans on abortion measures, meaning Republicans only need a few seats to wield influence on abortion-related bills.",
    "I feel like instead of focusing so much on canceling Roe versus Wade and all that we need to focus more on getting children out of foster care, said Taylor Godwin, 20, a student at Western Carolina University, who was casting an early vote.",
    "She is heavily favored to win the Democratic nomination and is expected to continue discussing these issues, which are resonating with some voters, along with calling for better wages and urging limits on corporate profit-taking.",
    "Early voting wrapped up Saturday, and interviews with nearly two dozen people casting ballots revealed Democrats were far more concerned about the leaked draft decision and many agreed with Beasleys warning.",
    "After a meal of chicken and chocolate-frosted cake (displayed on the top of an Opus One Winery carton), the GOP women who gathered at Old North Club said they didnt see abortion rights as truly threatened.",
    "Beasley, a longtime judge who would be North Carolinas first Black senator if she is elected in November, is in a distinctive position to connect abortion rights to civil rights and judicial precedent.",
    "And the presence of a handwritten lawn sign quoting the late Supreme Court Justice Ruth Bader Ginsburg on abortion at an early vote center Pittsboro served as a reminder of new intensity on the issue.",
    "Im going somewhere for breakfast, lunch and dinner, explained former Army combat veteran Marjorie Eastman, a Republican candidate who said her campaign strategy involves frequently attending events.",
    "She said she felt that activists on the left warning that abortion rights are in jeopardy are making a case thats uninformed.\nShe noted that abortion wont be illegal everywhere if Roe is overturned.",
    "Forget going to the courthouse with a sign to protest.\nNorth Carolina is a battleground state that has often left Democrats disappointed in federal races ever since Barack Obamas 2008 victory here.",
    "Godwin said shes an unaffiliated voter and chose to vote in the GOP primary because she believes that Republicans want fewer abortions, though she does not think they would ban them outright.",
    "Several people who attended her event said abortion dominates their thinking about politics, and one woman suggested borrowing a tactic thats been effective in recent civil rights protests.",
    "While the Democrats interviewed for this story all said they had planned on voting before the decision was made public, nearly all said they thought about it as they cast their ballots.",
    "Democratic activists warn that Republicans, who already control both chambers of the General Assembly, are close to having enough seats to override a veto from Democratic Gov.",
    "A North Carolina ban on most abortions after 20 weeks of pregnancy was ruled unconstitutional by a federal court last year, but could be reinforced if Roe is struck down.",
    "But Republicans are currently favored to hold the seat, according to nonpartisan analysts, in part due to Bidens unpopularity and concerns over issues such as inflation.",
    "Sherri Sugg, who lives in the community and is retired at 61, said shes a Republican who supported abortion rights and is a little aggravated by the current discussion.",
    "But Beasleys approach represents an early example of a Democrat trying to energize a broader set of voters in a midterm year in which her party faces head winds.",
    "In a brief interview outside the brewery, Budd tried to downplay the debate over abortion and indicated that he would not support a federal ban on the procedure.",
    "Dana Dawson, who owns a local coffee shop and described herself as a religious conservative, reiterated that the change would put the decision in states hands.",
    "At the same time, abortion rights activists said they are also preparing for the states potential status as an abortion destination to be short-lived.",
    "Women may need to kneel at the national anthem now, said Cindy Sellers, a retired teacher who just turned 68, speaking just before Beasleys town hall.",
    "With just over a dozen clinics that provide abortions in the state, Planned Parenthood is already sketching out scenarios for how demand could rise.",
    "Roe versus Wade held that the right to privacy for women to make the choice around her own reproductive health is a constitutional right, she said.",
    "Even if the court erases a federal right to abortion, she predicts that her side will still have significant work ahead to ban it nationwide.",
    "Yet the contours of this contest, one of a handful that could collectively decide which party controls the Senate next year, are unique.",
    "But idea that abortion could be completely banned is not an outcome that some Republican voters in the state said they foresee.",
    "Privately, Republicans and some Democrats predict that the leaked abortion decision might not dramatically alter the midterms.",
    "Voters here reelected Cooper in 2020 by 4.5 percentage points, while Joe Biden lost the state by just over 1 percentage point.",
    "Weve marched, what can we do? asked Jennifer Gillis, 71, shortly after casting her ballot in the Democratic primary there.",
    "And people are incensed.\nOther established rights, from voting rights to civil rights could also be at risk, she said.",
    "Like many Republican leaders, they expressed more outrage over the leak than excitement about what the court could do.",
    "And she said shed be willing to help women who needed to travel to obtain abortions because they should be accessible.",
    "The more conservative women at the club also stressed how limited they felt the draft decision would be in practice.",
    "With just days to go before Tuesdays primary here in North Carolina, that contrast was especially stark here.",
    "People were like Whoa  whats going on? \nBut the impact on abortion in North Carolina could be significant.",
    "Its been important to uphold the law and respect the Constitution, Beasley said in an interview Thursday.",
    "Beasleys town hall was held in Alexander County, where Trump won by nearly 60 percentage points in 2020.",
    "Beasley is competing to win a Senate seat that will be left open by retiring Sen. Richard Burr (R).",
    "There are certain circumstances when an abortion could happen, she said, listing rape or incest.",
    "Instead, he focused on rising costs, the nationwide baby formula shortage and border security.",
    "He said that his views are largely consistent with the other Republicans in the race.",
    "And some Republican lawmakers have said they want to impose further restrictions.",
    "Its a decision she must make, the sign read, with the last two words underlined.",
    "Neither mentioned the draft decision or their desire to limit abortions.",
    "In the Senate, she said, she would vote to protect these rights.",
    "The crowd was older and a mix of Black and White attendees.",
    "We must all feel a sense of urgency around this election.",
    "At the end of the day I think a life is a life, she said.",
    "The emphasis should be to turn people out to vote  now.",
    "I want to save as many lives as possible, Budd said.",
    "Other Democrats are making a similar pitch.",
    "When it first happened people were shocked.",
    "Rome was not built in a day, she said.",
    "The view was echoed elsewhere.",
    "Im not hearing it.",
    "South Atlantic.",
    "Roy Cooper."
  ]
}