{
  "id": 694,
  "mediaId": 195,
  "date": "d2022-02-01T21:47",
  "headline": "Five big takeaways from year-end FEC filings",
  "image": "https://cdn.jwplayer.com/v2/media/QYRRTcIl/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/592347-five-takeaways-from-a-year-of-record-breaking-fundraising",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood and Reid Wilson -",
  "authorUrl": "",
  "termIds": [
    741,
    802,
    815,
    1095,
    1147,
    1248,
    1765,
    1877,
    2039,
    2087,
    2125,
    2280,
    3085,
    3094,
    118,
    142,
    145,
    146,
    183,
    337,
    427,
    428,
    571,
    2945
  ],
  "sentences": [
    "Here are five takeaways from the latest FEC reports:\nTrump's big haul\nFormer President Trump's political operation is flush with cash heading into 2022, virtually guaranteeing his place as one of the most influential financial power players in the midterm elections  and perhaps beyond that.",
    "Expensive swing state primaries ahead\nResults of critical elections in Ohio, Pennsylvania and Wisconsin may determine which party controls the Senate next year  but even before the general elections, primary contenders are spending heavily, often their own money.",
    "The fundraising numbers, made public on Monday as part of the latest batch of filings with the Federal Election Commission (FEC), offer some early hints about where the parties and their candidates stand less than a year out from November's elections.",
    "GOP groups are outpacing their Democratic counterparts in fundraising\nRepublican groups that trailed their Democratic counterparts just a few years ago are pulling ahead in the money race as the GOP prepares for a midterm onslaught.",
    "Senate Leadership Fund (SLF), the main super PAC backing GOP Senate candidates, finished out 2021 with $47.4 million in the bank, while Democrats' Senate Majority PAC (SMP) reported just under $30.6 million in cash on hand.",
    "While the pace of fundraising slowed down over the last six months, the former president's affiliated groups now command more money than both the Republican National Committee and the Democratic National Committee combined.",
    "And the mammoth fundraising by Trump's political operation also has implications for 2024, when the former president could mount a comeback bid for the White House and have a massive edge over any GOP rival.",
    "The democratization of fundraising means small-dollar donors are playing a bigger role in politics than ever before, and they're fueling a surge of spending on Senate contenders on both sides of the aisle.",
    "Meanwhile, the Congressional Leadership Fund (CLF), one of the main super PACs backing Republican House candidates, has widened its cash advantage over the Democratic group House Majority PAC (HMP).",
    "Trump loves to brag that his imprimatur is stronger than ever in Republican primaries, but the reports show he hasn't been able to fill a candidate's coffers or cut off cash to his rivals.",
    "That means first-time statewide candidates like Demings and Walker can quickly fill their coffers, and popular candidates like Warnock and Kelly can build their own self-sustaining lists.",
    "On the House side, the Democratic Congressional Campaign Committee (DCCC) still has a slight edge over its GOP counterpart, the National Republican Congressional Committee (NRCC).",
    "The same is true for the National Republican Senatorial Committee, which now leads the Democratic Senatorial Campaign Committee in cash on hand $32.8 million to $23.7 million.",
    "Former NFL running back Herschel Walker (R), who is challenging Warnock in Georgia, ended the year with $5.4 million on hand, an impressive sum for a first-time candidate.",
    "Former hedge fund manager David McCormick (R) joined the race late enough that he has not filed any public disclosures  but he has booked $4.2 million on television ads.",
    "Republicans have invested heavily in digital and grassroots fundraising in recent years in an attempt to match Democrats who have long held an advantage on that front.",
    "Trump-backed contenders struggled\nWalker is something unique in the Republican field this year: a candidate backed by Trump who has had early fundraising success.",
    "In the Ohio, investment banker Mike Gibbons (R) and state Sen. Matt Dolan (R) have each dropped more than $10 million of their own money into their campaigns.",
    "Senate races now rival presidential campaigns\nWhen he ran for president in 2016, Sen. Marco Rubio (R-Fla.) raised about $48 million before dropping his bid.",
    "Kelly Tshibaka, the Trump-backed former Alaska state official challenging Sen. Lisa Murkowski (R), raised $601,000 in the last three months of the year.",
    "Rep. Tim Ryan, who has a relatively clear shot at the Democratic nomination, is stockpiling his own funding; he ended the year with $5 million on hand.",
    "His main political account, Save America PAC, gave $1.35 million to like-minded causes? and Trump-endorsed candidates last year, according to his team.",
    "Democrats and Republicans are heading into 2022 with record amounts of cash as both parties brace for a historically expensive midterm election cycle.",
    "Alex Lasry, whose family owns the Milwaukee Bucks, has loaned his campaign $2.3 million; state Treasurer Sarah Godlewski loaned herself $1.4 million.",
    "Mandela Barnes has raised more than the other Democratic candidates from outside donors, but he doesn't have the personal wealth of his two rivals.",
    "Businessman Bernie Moreno (R) and former state Republican Party Chairwoman Jane Timken have added $3.5 million of their own cash to their coffers.",
    "Two other Republicans  former Ambassador Carla Sands and businessman Jeff Bartos  have also invested seven-figure sums into their campaigns.",
    "Neither are independently wealthy; Fetterman ended the year with $5 million on hand, Lamb with a little more than $3 million in the bank.",
    "But the newfound fundraising advantage for some GOP groups also suggests that the political winds may be shifting in Republicans' favor.",
    "Trump's political committees have a combined $122 million on hand after pulling in more than $51 million in the second half of 2021.",
    "Prominent Senate candidates today are raising as much money as promising presidential primary contenders only a few cycles ago.",
    "The CLF ended 2021 with nearly $61.2 million in the bank compared to the HMP's roughly $39.2 million, federal filings show.",
    "Rep. Val Demings (D), running against Rubio in Florida, has $8.1 million in reserve, and she outraised Rubio last quarter.",
    "Watch out for businessman and retired Army officer Mike Durant (R), who has loaned his own campaign $4.1 million so far.",
    "But in a sign that Republicans may be catching up, the NRCC outraised the DCCC in December by more than $2 million.",
    "In Alabama, Rep. Mo Brooks (R) pulled in $382,000, a third of what his leading rival, Katie Britt (R), raised.",
    "reported raising just shy of $2 million in the last quarter, and she's sitting on $4.7 million in the bank.",
    "He raised half that amount, $24.4 million, by the end of 2021 as he seeks a third term in the Senate.",
    "In Pennsylvania, Republican Mehmet Oz kicked off his campaign by lending himself $5.2 million.",
    "The DCCC reported having about $82.5 million on hand, while the NRCC has about $78.2 million.",
    "At the end of 2017, the SMP had $13.7 million in the bank compared to the SLF's $6.3 million.",
    "Her Trump-backed rival, Harriet Hageman (R), raised $443,000 and has less than that on hand.",
    "Compare that to December 2017 when the DCCC raised nearly $5.4 million more than the NRCC.",
    "Rubio and Sen. Catherine Cortez Masto (D-Nev.) each finished with $10 million in reserve.",
    "Murkowski hauled in twice as much, and the incumbent has $4.25 million in the bank.",
    "John Fetterman and Rep. Conor Lamb are emerging as the two best-funded contenders.",
    "In Wisconsin, it's the Democrats who are investing big bucks in their own races.",
    "Sen. Raphael Warnock (D-Ga.) ended the year with $22.9 million in the bank.",
    "Trump's top Republican targets, by contrast, have set new records.",
    "That's a reversal  and growth  of fortunes for the two groups.",
    "Sen. Mark Kelly (D-Ariz.) had $18.6 million on hand.",
    "In most cases, their rivals are no slouches either.",
    "Trump's not just sitting on that money either.",
    "Others haven't been as prolific.",
    "On the Democratic side, Lt. Gov.",
    "Rep. Liz Cheney (R-Wyo.)",
    "And Rubio isn't alone.",
    "Lt. Gov."
  ]
}