[
  {
    "id": 4880,
    "mediaId": 2564,
    "date": "2022-02-22",
    "sentence": "Trump himself has yet to weigh in on the race, though he has already waded into Ohio's midterms with an endorsement of his former aide <span class='selected-term'>Max Miller</span> in the state's 13th Congressional District.",
    "author": "Elizabeth Elkind",
    "title": "Chaos at Ohio Senate race debate as Republican Josh Mandel shouts at audience member who said he should be 'put out' for calling BLM 'thugs' and calls his Democratic rival 'like AOC only dumber'"
  },
  {
    "id": 1822,
    "mediaId": 2630,
    "date": "2022-04-06",
    "sentence": "But Gibbs' most significant obstacle to a seventh term was former Trump White House and campaign aide <span class='selected-term'>Max Miller</span>, one of several other candidates who filed for the May 3 primary.",
    "author": "",
    "title": "Rep. Bob Gibbs of Ohio, facing Trump-backed challenger, announces retirement"
  },
  {
    "id": 1028,
    "mediaId": 2919,
    "date": "2022-04-06",
    "sentence": "If he had not exited the primary race, Gibbs would have went up against Trump-backed challenger <span class='selected-term'>Max Miller</span>, who was an aide to the former president.",
    "author": "Kaylyn Hlavaty",
    "title": "Ohio Rep. Bob Gibbs announces retirement over 'circus' of Ohio's unresolved congressional maps"
  },
  {
    "id": 1495,
    "mediaId": 2636,
    "date": "2022-04-06",
    "sentence": "— <span class='selected-term'>Max Miller</span> (@MaxMillerOH) April 6, 2022\nThe court is planning to hold a hearing on the new congressional map sometime after the May 3 primary, and is hearing challenges to a fourth set of state legislative maps.",
    "author": "",
    "title": "Bob Gibbs, House Republican Facing Primary Challenge in Ohio, Will Retire"
  },
  {
    "id": 1623,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Gibbs’ expected primary opponent is <span class='selected-term'>Max Miller</span>, a former aide to Donald Trump.",
    "author": "Jazz Shaw",
    "title": "Ohio Republican announces retirement over redistricting"
  },
  {
    "id": 1742,
    "mediaId": 2540,
    "date": "2022-04-06",
    "sentence": "To that end, after considerable deliberation, I have decided to not seek re-election this year.”\nGibbs was also facing <span class='selected-term'>Max Miller</span>, a former aide to former President Donald Trump, in the Republican primary.",
    "author": "Clare Foran and Melissa Holzberg DePalo",
    "title": "Ohio GOP lawmaker announces retirement citing redistricting ‘circus’"
  },
  {
    "id": 1636,
    "mediaId": 2687,
    "date": "2022-04-06",
    "sentence": "Around 12 percent of his old district remained in the new one.”\n“Gibbs also faced primary challenges from several candidates including <span class='selected-term'>Max Miller</span>, a well-funded former White House aide to ex-President Donald Trump.”\nSave to Favorites",
    "author": "Taegan Goddard",
    "title": "GOP Lawmaker to Retire Rather Than Face Primary"
  }
]