[
  {
    "id": 6402,
    "mediaId": 2590,
    "date": "2022-01-14",
    "sentence": "Gonzalez, who announced his decision in November, was facing a primary challenge from Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "Daniel Marans",
    "title": "Third Republican Who Voted To Impeach Trump Now Retiring"
  },
  {
    "id": 4880,
    "mediaId": 2564,
    "date": "2022-02-22",
    "sentence": "Trump himself has yet to weigh in on the race, though he has already waded into Ohio's midterms with an endorsement of his former aide <span class='selected-term'>Max Miller</span> in the state's 13th Congressional District.",
    "author": "Elizabeth Elkind",
    "title": "Chaos at Ohio Senate race debate as Republican Josh Mandel shouts at audience member who said he should be 'put out' for calling BLM 'thugs' and calls his Democratic rival 'like AOC only dumber'"
  },
  {
    "id": 1230,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish Country exits a primary race in northeast Ohio that, under new temporary maps, would have put him up against Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "JULIE CARR SMYTH - Associated Press",
    "title": "Ohio Rep. Bob Gibbs retires abruptly, blames fight over maps"
  },
  {
    "id": 1623,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Gibbs’ expected primary opponent is <span class='selected-term'>Max Miller</span>, a former aide to Donald Trump.",
    "author": "Jazz Shaw",
    "title": "Ohio Republican announces retirement over redistricting"
  },
  {
    "id": 1673,
    "mediaId": 2745,
    "date": "2022-04-07",
    "sentence": "In Ohio, GOP Rep. Bob Gibbs announced his retirement, citing exhaustion with the tangled and lengthy process by which the state redistricting commission finally produced its maps — and put him in a district with Trump-endorsed candidate <span class='selected-term'>Max Miller</span>, most of which he'd never represented since arriving in D.C. 11 years ago.",
    "author": "",
    "title": "The Trailer: Some called his anti-China ad dangerous. Here's why Tim Ryan kept running it."
  },
  {
    "id": 1033,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Former Trump aide <span class='selected-term'>Max Miller</span> is now the frontrunner for Ohio's 7th Congressional District\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "author": "",
    "title": "Morning Digest: Trump's 'bro' now frontrunner following Ohio Republican's unexpected retirement"
  }
]