[
  {
    "id": 4535,
    "mediaId": 8466,
    "date": "2022-01-13",
    "sentence": "DEFIANCE, OH: On Jan. 10th, State Representative <span class='selected-term'>Craig Riedel</span> announced his candidacy for the 9th Congressional District.",
    "author": "",
    "title": "State Representative Craig Riedel announces his candidacy for Ohio's 9th Congressional District"
  },
  {
    "id": 4428,
    "mediaId": 8358,
    "date": "2022-01-20",
    "sentence": "Celina — With Ohio Rep. <span class='selected-term'>Craig Riedel</span>, R-Defiance, announcing his bid for the U.S. House of Representatives, one local politician has announced she is seeking to replace the Defiance-based representative for Ohio House District 82.",
    "author": "",
    "title": "Mercer County recorder announces bid for Riedel’s old seat"
  },
  {
    "id": 1436,
    "mediaId": 8465,
    "date": "2022-02-10",
    "sentence": "VW independent staff and submitted information\nDEFIANCE – Republican Ted Penner has filed as a candidate for the Ohio House of Representatives seat currently held by <span class='selected-term'>Craig Riedel</span>, who has decided to seek a U.S. Congressional seat.",
    "author": "",
    "title": "Penner running for seat in the Ohio House"
  },
  {
    "id": 15874,
    "mediaId": 8465,
    "date": "2022-03-14",
    "sentence": "Senator Rob McColley and Representative <span class='selected-term'>Craig Riedel</span> demonstrated their devotion to the arts economy in northwest Ohio by not only advocating for our support but by being present to celebrate this milestone.”\nCentral Insurance Regional Vice-President RJ Coleman addressed the audience with the community-minded intent behind Central’s continued investment in the live performing arts, and Van Wert County Foundation CEO Seth Baker provided the historical significance of contributions paving the way for progress today.",
    "author": "",
    "title": "New annex unveiled by NPAC officials"
  },
  {
    "id": 8798,
    "mediaId": 8465,
    "date": "2022-04-07",
    "sentence": "Also on the ballot for that seat are Beth Deck, Theresa Gavarone and <span class='selected-term'>Craig Riedel</span>.",
    "author": "",
    "title": "GOP Meet the Candidates night April 11"
  },
  {
    "id": 6674,
    "mediaId": 8465,
    "date": "2022-04-12",
    "sentence": "Submitted information\nDEFIANCE — State Representative <span class='selected-term'>Craig Riedel</span> (R-Defiance) announced that his campaign for Ohio’s 9th Congressional District raised $415,000 during the first quarter of 2022.",
    "author": "",
    "title": "Riedel raises over $400K for campaign"
  }
]