{
  "id": 8660,
  "mediaId": 261,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "James Craig loses bid to appear on primary ballot after Michigan court denies appeal",
  "image": "https://www.gannett-cdn.com/presto/2021/08/19/PDTF/618ab703-3ef9-4867-b433-aa86e0fbefcb-07302020_policeshootingscen.jpg?crop=1920,1080,x240,y260&width=1920&height=1080&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/elections/2022/06/02/james-craig-michigan-primary-ballot-governor-petition-signatures-appeal/7469618001/",
  "sentiment": "-0.592",
  "mediaOutlet": "Detroit Free Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arpan Lobo",
  "authorUrl": "https://www.freep.com/staff/4448999001/arpan-lobo/",
  "termIds": [
    651,
    1088,
    1682,
    1844,
    2002,
    2298,
    3075,
    3095,
    3099,
    311,
    428,
    6118,
    2645,
    2791,
    2842
  ],
  "sentences": [
    "Problems with signatures submitted by Craig's campaign include petition sheets that had signatures with similar handwriting and evidence of \"round-tabling,\" or petition circulators passing around a petition between each other to vary handwriting, according to the Bureau of Elections.",
    "Dismissing Craig's lawsuit, Michigan Court of Claims Judge Elizabeth Gleicher wrote she is bound by the Court of Appeals decision in the Johnson lawsuit that she said resolved the same underlying issue at play in Craig's bid to challenge his removal from the primary ballot.",
    "Brandenburg filed a legal challenge with the Michigan Supreme Court early Thursday, almost a week after the Board of State Canvassers meeting and the day before Secretary of State Jocelyn Benson is required by law to certify the names of candidates for the primary election.",
    "James Craig, former Detroit police chief and the once-presumed front-runner to be the Republican Party's nominee for governor this fall, lost his bid to appear on the August primary ballot after the Michigan Court of Claims denied an appeal from his campaign Thursday.",
    "The Court of Claims decision mirrors Wednesday rulings from the Michigan Court of Appeals, which denied similar appeals from GOP gubernatorial hopefuls Oakland County businessman Perry Johnson and Grand Haven financial adviser Michael Markey.",
    "They include Norton Shores businesswoman Tudor Dixon, Ottawa County real estate agent Ryan Kelley, Farmington Hills pastor Ralph Rebandt, Bloomfield Hills businessman Kevin Rinke and Kalamazoo chiropractor Garrett Soldano.",
    "Last Thursday, the Board of State Canvassers split 2-2 along party lines on accepting Bureau of Elections staff recommendations to disqualify Craig, Johnson, Markey and Bryon Center businesswoman Donna Brandenburg.",
    "Craig argued he was the victim of a methodical attempt to keep him from being on the ballot and called on Michigan Attorney General Dana Nessel to open a criminal investigation into the petition signature fraud.",
    "The bureau's review found that of the 21,305 signatures Craig's campaign submitted, more than 11,000 were invalid, leaving him well short of the 15,000 valid signatures needed to appear on the ballot.",
    "Craig was one of five GOP gubernatorial candidates whose nominating petitions to qualify for the ballot were rife with signature fraud, according to the Bureau of Elections.",
    "Michigan elections director Jonathan Brater described the signature fraud identified by the Bureau of Elections an unprecedented \"attack on our election system.\"",
    "\"I'm being robbed of the opportunity to be on the ballot and let Michigan voters decide who should represent the GOP,\" Craig told the Free Press last week.",
    "Brandenburg's legal challenge marked the fourth and final one from GOP gubernatorial candidates disqualified from the August election.",
    "Mike Brown withdrew from the race before the board met to review candidates' nominating petitions to land a spot on the ballot.",
    "Craig and Johnson filed lawsuits last Friday challenging the board's action followed by Markey who filed his lawsuit Sunday.",
    "For instance, at times fraudulent-petition circulators made little effort to vary handwriting,\" Bureau staff wrote.",
    "Altogether, the Bureau identified at least 68,000 invalid signatures submitted on candidates' nominating petitions.",
    "The Board of State Canvassers certified five GOP gubernatorial candidates for the upcoming primary.",
    "Craig could also appeal the Court of Claims decision denying his bid to land a spot on the ballot.",
    "The deadlock had the effect of disqualifying the candidates from appearing on the primary ballot.",
    "Johnson has appealed to the Michigan Supreme Court, and Markey has said he plans to do the same.",
    "The fraud uncovered by the bureau was has been referred to the Attorney General's office.",
    "Clerks will begin sending out absentee ballots to military and overseas voters on Jun.",
    "\"Some pages are more obvious than others.",
    "Michigan State Police Capt.",
    "18."
  ]
}