{
  "id": 8662,
  "mediaId": 195,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Republican candidate in Michigan governor race loses bid to get placed on primary ballot",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/06/902fcb366cbe4f889d22caa83b62c4ea.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/state-watch/3508404-republican-candidate-in-michigan-governor-race-loses-bid-to-get-placed-on-primary-ballot/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Dress",
  "authorUrl": "https://thehill.com/author/brad-dress/",
  "termIds": [
    651,
    773,
    146,
    311,
    428,
    6118,
    2791
  ],
  "sentences": [
    "Because of the unprecedented number of fraudulent petition sheets consistent of invalid signatures identified during the initial review of petition sheets submitted this election cycle, and the fact that the same fraudulent-petition circulators submitted petition sheets for many different candidates, it was not practical to review these sheets individually during the course of ordinary face review and challenge processing, the ruling reads.",
    "The Michigan Court of Appeals ruled in favor of the Board of State Canvassers, the secretary of state and the director for the Bureau of Elections against Johnson, who filed a lawsuit to force the state to put him on the GOP primary ballot in August after officials rejected his petition, claiming it was rife with fraud.",
    "The browser does not support the specified video codec\nPerry Johnson, a Republican candidate for governor in Michigan, lost a bid on Wednesday to get placed on the primary ballot after a court ruled he used fraudulent signatures on a petition to qualify for the race.",
    "The candidate submitted 23,193 signatures, but the Michigan Bureau of Elections denied his petition along with four other candidates, saying more than 9,000 signatures were fraudulent, thus dropping him below the qualification threshold.",
    "A key issue in the Johnson case was whether the state was required to review every single signature or deny all those submitted by fraudulent-petition circulators, whom officials found to have submitted fake signature sheets.",
    "State officials said after a review of Johnson's petitions, they found signatures from voters who have not lived at the listed address, misspelled names and uncommon signatures that signaled something was amiss.",
    "Johnson, a businessman who has self-funded much of his campaign, was required to submit a petition containing 15,000 valid signatures in order to qualify for the gubernatorial primary election on Aug. 2.",
    "Johnson filed a challenge with the Board of State Canvassers, which deadlocked 2-2 on whether to accept the petition, meaning the bureau's original denial was valid.",
    "The ruling will likely have an affect on four other candidates who were also denied a ballot placement for the primary based on similar fraud findings.",
    "The three-person court said in the ruling the board did not have to scrutinize in detail every single submitted petition sheet from the circulators.",
    "Johnson, who filed a lawsuit in the appeals court last week, can now take the case to the Michigan Supreme Court if he chooses to appeal.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "All the candidates are seeking to challenge incumbent Gov.",
    "Gretchen Whitmer (D) in the general election."
  ]
}