{
  "id": 8962,
  "mediaId": 129,
  "date": "6/3/2022 12:00:00 AM",
  "headline": "Pennsylvania court sides with McCormick for now, ordering undated ballots to be counted.",
  "image": "",
  "link": "https://www.nytimes.com/live/2022/06/03/us/midterms-primary-elections",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    651,
    661,
    1844,
    2095,
    2303,
    3094
  ],
  "sentences": [
    "Heading into Tuesday's primary election to replace Mayor Eric Garcetti, who faces term limits, Mr. Caruso has flooded the airwaves with so many ads that he is almost certain to make it into a runoff with his top rival, Representative Karen Bass, who was on President Biden's short list for vice president and has much of the city's Democratic establishment behind her.",
    "On a recent walk through Venice, a wealthy beach community and city neighborhood that has become a prime battleground over homelessness, Mr. Caruso, dressed in an impeccably tailored suit, listened as a resident, Marjorie Weitzman, lamented both the enduring presence of encampments and plans to develop more low-income housing in the area.",
    "At this point, it seems hard to see congressional maps being upset for this November, especially given the Supreme Court's repeated admonitions to federal courts to hold back on changes to election laws in the period close to the election, said Richard L. Hasen, an election law expert at the University of California, Irvine.",
    "I'm not aware of a super PAC spending in an attorney general's race in Massachusetts, ever, said Jeff Clements, the president of American Promise, a nonprofit group that supports tightening campaign finance laws, and a former chief of the public law enforcement bureau in the Massachusetts attorney general's office.",
    "In Mr. Johnson's challenge, the Michigan Court of Appeals reached a similar conclusion, writing in its ruling on Wednesday that the canvassing board had a clear legal duty to investigate, but it did not have a clear legal duty to conduct a comparison of each fraudulent signature against the Qualified Voter File.",
    "That would be an awful lot of crossover voting, said Scott H. Ainsworth, a professor of political science at the University of Georgia, adding that Mr. Raffensperger's nearly 30,000-vote margin to avoid a runoff had most likely been spurred by more than just meandering former Democratic primary voters.",
    "But Judge Cohn Jubelirer was not persuaded by the Oz campaign's argument that such an approach would not cause harm, writing that the ability to determine which votes will make a difference is an ever-changing number during the recount stage and that waiting could further delay the election process.",
    "The Democrats' comparative success in this year's map drawing is a marked departure from the last redistricting in 2011, when Republicans' dominance in state legislatures enabled the party to gerrymander its way to comfortable control of the House until the Democratic wave election of 2018.",
    "On their way out, they can pick up an unusual memento at the concierge stand  a Caruso for mayor lawn sign, a symbol of his more than $34 million attempt to apply his expertise overseeing faux town squares to the very real and far messier task of running the nation's second-largest city.",
    "Such statements underscore how much of a zero-sum game redistricting has become as Democrats, who campaigned against partisan redistricting, chased the same kind of partisan advantage in states like New York and Illinois as Republicans have achieved in states like Texas and Wisconsin.",
    "Voting rights groups argued that the map ignored an amendment to the State Constitution approved by voters in 2010 that outlawed partisan mapmaking and specifically barred creating districts that diminished the likelihood that minority voters could elect their preferred candidates.",
    "In another serious blow to Republicans' prospects in the Michigan governor's race, two of the party's top candidates lost separate court appeals this week that had sought to overturn their disqualification from the primary because of forged signatures on their nominating petitions.",
    "And while the House map includes more districts that voted for Mr. Biden than ones that supported Mr. Trump, Republicans also performed two to four percentage points better than Mr. Trump on average in 2020, according to data from the National Republican Redistricting Trust.",
    "Judge Elizabeth L. Gleicher wrote in the ruling that the Board of State Canvassers did not have a clear legal duty to compare all of the signatures on the petitions for Mr. Craig to the Qualified Voter File, a registry maintained by the state, as Mr. Craig had argued.",
    "In its two-sentence denial, the State Supreme Court said it was premature for the justices to intervene in a suit seeking to overturn the congressional map because the case had not yet wound its way through the state court system, which could take months or years.",
    "A decade of efforts by citizens and voting rights advocates to rein in partisan maps produced some results, though they were largely a wash. A ballot initiative undid a Republican gerrymander of the House map in Michigan, and a state court struck down a G.O.P.",
    "She faces Quentin Palfrey, a former assistant attorney general, voting rights lawyer and official in the Obama and Biden administrations who supports Medicare for all; and Shannon Liss-Riordan, a self-financing labor lawyer who has the backing of major unions.",
    "A Pennsylvania court ordered election officials on Thursday to count undated mail-in ballots for now in a nationally watched Republican Senate primary, granting a temporary injunction to David McCormick as he trailed Dr. Mehmet Oz amid a statewide recount.",
    "No race has attracted more debate about crossover voting than the Republican primary for secretary of state, in which Mr. Raffensperger, the incumbent, who had rejected attempts to subvert the 2020 election, defeated Mr. Hice, a Trump-endorsed challenger.",
    "But in the end, it devolved into a power struggle between Democrats intent on preserving their narrow majority in the House of Representatives and Republicans who feel confident about retaking control of the House in advance of the 2024 presidential race.",
    "The Commonwealth Court of Pennsylvania concluded that a May 23 lawsuit by Mr. McCormick had raised sufficient claims that a state law requiring voters to hand-write the date on return envelopes for mail-in ballots could lead to their disenfranchisement.",
    "We are pleased the court agrees on ensuring valid Republican votes that were signed and returned on time, as shown by their time-stamp, are counted so the party can get behind a strong nominee in the fall, the campaign spokeswoman, Jess Szymanski, said.",
    "During an event Mr. Sures hosted in Brentwood, one guest asked Mr. Caruso about the headline-grabbing murder of a 24-year-old woman in the Hancock Park neighborhood of Los Angeles in which the authorities have said they believe the killer was homeless.",
    "As the New York legislative session wraps up this week, Hochul is supporting measures to strengthen the state's gun laws after a racist massacre at a Buffalo grocery store last month, including raising the minimum age to buy an AR-15-style rifle to 21.",
    "A victory for Mr. Caruso  a one-time Republican who became a Democrat just before announcing his run  would be a stark shift in this overwhelmingly liberal city, which Senator Bernie Sanders easily carried in the 2020 Democratic presidential primary.",
    "In Georgia's open primary system, Democrats and Republicans can vote in the other party's primary if they wish, and more than 37,000 people cast early ballots in this year's Republican primary election after voting in the Democratic primary in 2020.",
    "A tradition of taking on big business\nThe attorney general in Massachusetts has a storied muckraking tradition dating to Frank Bellotti, who transformed the office into a formidable platform for law in the public interest during the 1970s and '80s.",
    "State elections officials rejected thousands of names that they said had been forged and were collected by fraudulent petition circulators, though officials said there was no evidence the candidates had knowledge of the widespread cheating effort.",
    "And Mr. Caruso, 63, whose malls across Southern California made him a billionaire, has gone directly at voters' frustrations with those problems, portraying Los Angeles as a city in deep decay and promising swift action on a law-and-order agenda.",
    "Mr. Caruso's rivals liken him to a different businessman with no government experience who traded on his wealth and reputation: A campaign mailer from an independent group supporting Ms. Bass morphs Mr. Caruso's face with that of Donald J. Trump.",
    "Its donors include Reed Hastings, a chief executive of Netflix, who chipped in $250,000; Andrew Balson, a former managing director at Bain Capital, who likewise gave $250,000; and Jim Walton, an heir to the Walmart dynasty, who donated $45,000.",
    "Despite living with an assortment of extended family members and foster parents, Campbell managed to attend Boston Latin, the city's most prestigious public school, then went to Princeton University for her undergraduate studies and to U.C.L.A.",
    "In its 11-page ruling against Mr. Craig, the Court of Claims dismissed his argument that he had been deprived of due process, concluding that he had received advance notice that the signatures on his nominating petitions were being challenged.",
    "The National Democratic Redistricting Committee, the party's primary redistricting organization, said its calculations showed that Democrats would hold a House majority in November if they won a popular vote majority of 2.1 percent nationwide.",
    "That disparity has left Mr. Caruso almost alone in appealing to voters and describing how he would tackle homelessness and crime  vowing to clean up the city by hiring some 1,500 new police officers and building 30,000 shelter beds in a year.",
    "In the 42-page opinion, Rene Cohn Jubelirer, the court's president judge, directed county election boards to report two sets of tallies to the acting secretary of the commonwealth, one that includes the undated ballots and one that does not.",
    "Scott Harshbarger sued major tobacco manufacturers, resulting in a huge settlement in the late 1990s; more recently, Healey has gone after pharmaceutical companies that made and marketed opioids, effectively shutting down Purdue Pharma.",
    "Redistricting this year netted the Democratic Party further small gains: Mr. Biden carried 226 of the 435 new districts in 2020, two more than before the new maps were drawn, while Mr. Trump carried 209 districts, two fewer than before.",
    "She has woven the story of Andre, a twin brother who died in prison from an undertreated medical condition, into the case she makes to voters  that she is someone who is uniquely able to empathize with stories of injustice and tragedy.",
    "It's just out of control, Jay Sures, a Caruso supporter who is the co-president of United Talent Agency, said when talking about crime, citing a recent example of one of his employees getting held up at gunpoint near Universal Studios.",
    "Home to Athens, a Democratic-leaning city, the county is wholly contained in the 10th Congressional District, a decidedly Republican seat held by Mr. Hice (he did not run for re-election because he was running for secretary of state).",
    "The Commonwealth Court's action late on Thursday came two days after Judge Cohn Jubelirer heard several hours of oral arguments in Mr. McCormick's lawsuit, in which the state and national Republican parties intervened in opposition.",
    "Fewer than 1,000 votes separate Mr. McCormick, a former hedge fund executive, from Dr. Oz, the celebrity physician backed by former President Donald J. Trump, in a race that could ultimately determine control of the divided Senate.",
    "In its review last week of the nominating petitions, the Michigan Bureau of Elections issued a stinging criticism of the methods used by the candidates' campaigns to collect signatures and the operatives working for the candidates.",
    "That's probably because they realize that Campbell has the early lead, said David Paleologos, the director of the Suffolk University Political Research Center, who has seen private polling in the race that heavily favors Campbell.",
    "At a time when many Democrats find themselves demoralized by the paralysis in Washington and by President Biden's low approval ratings, its contours will tell us something about what voters on the left are most passionate about.",
    "If you had told me coming into this redistricting cycle that we'd be able to make the gains that we've made with less control, with a significant funding disparity between us and the Democrats, I would have taken it in a minute.",
    "More than half of the 21,305 signatures submitted by Mr. Craig's campaign were rejected, leaving him with 10,192 valid signatures, the bureau said in its report, which noted that little effort had been made to vary handwriting.",
    "Mr. DeSantis contended that Mr. Lawson's district was itself unconstitutional because it was drawn specifically to permit the election of a Black representative, taking in African American voters from across northern Florida.",
    "Most everywhere else, fierce partisanship was the order of the day, which Chris Christie, the former governor of New Jersey and former chairman of the National Republican Redistricting Trust, said was inherent in the system.",
    "On May 23, 19 candidates learned that they had not met the signature requirement to get onto the ballot, including three Republicans and one Democrat seeking House seats, and 10 nonpartisan candidates seeking judicial posts.",
    "There's a lot of Democrats in Athens and Clarke County who will have no meaningful voice in their choice for Congress unless they vote in the primary, said Anthony Michael Kreis, a law professor at Georgia State University.",
    "All three are running as different flavors of liberal, fitting what local Democrats say is the public's appetite for someone willing to wield the power of the office aggressively to protect consumers and correct injustices.",
    "Voters like Ms. Cooper base their choices in every election on multiple variables: their political leanings, how competitive one party's primary might be or the overall environment in any given election year, among others.",
    "In addition to traditional swing voters or disaffected Democrats, a portion of those who crossed over were indeed probably Democratic voters switching strategically to the Republican primary to spite the former president.",
    "Lived experience means something, especially if you're running for an office where people depend on and expect that, said Debra Kozikowski, a vice chairwoman of the Massachusetts Democratic Party who is backing Campbell.",
    "Though Mr. Raffensperger won by almost 20 points, he escaped being forced into a runoff election by finishing with 52.3 percent of the vote, or 2.3 percent above the majority threshold that would have prompted a runoff.",
    "I think there's a real danger on the part of Democrats in Georgia to just assume that they aren't going to lose some of those voters from 2020, said Erik Iverson, a Republican pollster who works with Georgia campaigns.",
    "And while Democrats in Congress have all but abandoned hope of banning military-style rifles like the one used in the shooting in Uvalde, Texas, Palfrey is calling to banish gun manufacturers from the state altogether.",
    "He said that the court should hold off on ruling on the ballots' status until after the statewide recount concludes; counties have to complete the process by Tuesday and report their results to the state by Wednesday.",
    "Yet the crossover voters who cast early ballots in last month's Republican primary are not demographically representative of Georgia's multiracial Democratic base, which also includes a growing number of young voters.",
    "Before Mr. Trump's election in 2016, Mr. Caruso declared he would happily ban the candidate from his properties, but backtracked after Mr. Trump's inauguration, saying, Whether I agree with him or not doesn't matter.",
    "According to an analysis by The New York Times, Mr. Biden performed better than his 2020 average in 215 of the new House districts  a big improvement from the current map, where he only outperformed in 207 districts.",
    "The Florida Supreme Court has rejected a challenge to a new map of the state's congressional districts, despite a lower court's ruling that the map illegally diluted the power of Black voters, Michael Wines reports.",
    "Jonathan Brater, Michigan's elections director, told the canvassing board during its meeting that the fraud was so blatant that the petitions were referred to the state attorney general for criminal investigation.",
    "Yet his Hollywood support is not unanimous: In recent days he has publicly sparred with Jeffrey Katzenberg, the mogul and Democratic donor who is backing an independent expenditure committee supporting Ms. Bass.",
    "Of the more than $34 million Mr. Caruso has spent on his campaign, the bulk has gone to television, digital and radio ads  $25.2 million as of Wednesday, according to AdImpact, which tracks advertising spending.",
    "In Clarke County, roughly 900 voters who cast early ballots in the Republican primary had voted in the Democratic primary in 2020, one of the largest county totals of crossover voters outside the Atlanta area.",
    "While the Florida lawsuit will grind on, as will a handful of other court challenges to political maps nationwide, the odds that they will produce further changes in maps before November are vanishingly small.",
    "Massachusetts prides itself on leading the nation on progressive causes, be it overthrowing the British, outlawing slavery and Jim Crow, establishing universal health care or legalizing same-sex marriage.",
    "She rejects what she says are lies spread about the financing of her campaign by her opponents, though she has declined to say whether she would disavow Better Boston's support should it resume spending.",
    "Pennsylvania's top election official  Leigh M. Chapman, the acting secretary of the commonwealth, who was named as defendant in Mr. McCormick's lawsuit  supports the counting of undated mail-in ballots.",
    "A Roman Catholic who has a weekly Sunday supper with his priest, Mr. Caruso has donated generously to church institutions, including the Caruso Catholic Center at the University of Southern California.",
    "more than $125,000 to the Republican National Committee, $100,000 for George W. Bush's inauguration and $50,000 to Kevin McCarthy's Victory Fund, which helps fund conservative congressional candidates.",
    "There are probably some Democratic voters who were just voting quite rationally in the sense that they wanted their voice heard in a House race, and that is their only meaningful opportunity to do so.",
    "Deadlocked along party lines, with two Democrats supporting the disqualification and two Republicans opposing it, the canvassing board on May 26 upheld the bureau's decision to exclude the candidates.",
    "Guns will be a big issue, said Phil Johnston, a former chairman of the state Democratic Party who supports Palfrey, noting that Massachusetts already has some of the toughest gun laws in the country.",
    "Connie Rice, a longtime civil rights leader who worked with Mr. Caruso on the police commission, spoke highly of his past philanthropic and volunteer work, praising his desire to get more involved.",
    "(In an only-in-Los Angeles coincidence, Mr. Caruso's daughter was vacationing on his $100 million yacht with one of the students involved in an admissions bribery case when it first became public.)",
    "The bureau is unaware of another election cycle in which this many circulators submitted such a substantial volume of fraudulent petition sheets consisting of invalid signatures, the bureau said.",
    "Critics, including Planned Parenthood, have sharply criticized him for backing Republicans and for making donations to church organizations, contributions that some characterized as anti-choice.",
    "With many Democrats across the country in broad agreement that significant federal legislation on gun safety or abortion is all but impossible, Democratic governors are trying to take the lead.",
    "Some Democrats, for their part, staked a claim to these voters, arguing that they had crossed over to strategically support candidates who reject Mr. Trump's falsehoods about the 2020 election.",
    "At the Boston Women's March the day after Trump's inauguration in 2017, she famously stood in front of an enormous crowd and shouted what would become a signature line: We'll see you in court!",
    "Mr. Caruso frequently cites another Republican businessman turned Los Angeles mayor: Richard Riordan, who won office after the 1992 Los Angeles riots, having spent $6 million on his campaign.",
    "Los Angeles faces vexing crises over who can live there and how, as its longstanding problems with housing affordability, homelessness and crime have taken on new urgency during the pandemic.",
    "It is unclear whether a majority of these voters will return to support Democrats this November, as some in the party expect, or whether they will vote again for Republicans in large numbers.",
    "The state faces a Friday deadline for completing ballots for the Aug. 2 primary, which state election officials have said is crucial for programming computers and preparing absentee ballots.",
    "It is also exposing a fault line within the Democratic Party over corporate money  between those who see it as inherently corrupting and reject it, and those who view it as a necessary evil.",
    "The ruling all but ensures that the November elections will be based on districts that a lower state court said diluted the voting power of Black residents, violating the State Constitution.",
    "WASHINGTON  The Florida Supreme Court refused on Thursday to step into a challenge to a new map of the state's congressional districts that was approved by the Republican State Legislature.",
    "Hochul says that, in addition to guaranteeing abortion protections in one of the most populous states in the country, she has a responsibility to provide refuge for women outside New York.",
    "Experts and critics say many of his plans may not be achievable because of federal court mandates that allow people to camp in public spaces, as well as the city's byzantine zoning rules.",
    "Critics of corporate money in politics say the super PAC's looming presence in the race is unprecedented, and has the potential to be corrupting even if the group is not currently active.",
    "A prolific donor to the University of Southern California, Mr. Caruso was chairman of its board of trustees and helped usher in a new administration in the aftermath of several scandals.",
    "The new House map dismantles a congressional district held by Representative Al Lawson, a Black Democrat, and strongly boosts Republican odds of capturing other competitive House seats.",
    "And though Campbell on Thursday secured the endorsement of Emily's List, which backs candidates who support abortion rights, Massachusetts long ago codified Roe v. Wade into state law.",
    "The court begins with the overarching principle that the Election Code should be liberally construed so as not to deprive electors of their right to elect a candidate of their choice.",
    "That one is before the U.S. Supreme Court, which on Tuesday paused the counting of those ballots in a judicial race in Lehigh County, Pa., a case that could reverberate in the G.O.P.",
    "Without court action, there exists the very real possibility that voters within this commonwealth will not be treated equally depending on the county in which they vote, she wrote.",
    "People have not paid attention to state governments for a long time, believing that the epicenter of power is in Washington, and are now realizing no, it's at the state level, Gov.",
    "For example, if voters are drawn into a noncompetitive district, they will sometimes vote in the other party's primary if it will essentially determine the general election winner.",
    "These voters, data suggests, are less Republican traitors or stalwart Democrats aiming to stop Trump loyalists than they are highly sought-after  and unpredictable  swing voters.",
    "What voters are looking for is people who are going to fight on their behalf, said Mary Anne Marsh, a Democratic strategist in Boston who is not supporting any of the candidates.",
    "Voter Fraud Claims Fade: Republicans have been accepting their primary victories with little concern about the voter fraud they once falsely claimed caused Mr. Trump's 2020 loss.",
    "Personality goes a long way\nWith little to fear from Republicans in most general elections, Democrats in Massachusetts tend to race to the left in primaries for attorney general.",
    "Ron DeSantis, a Republican, was a fitting coda to a once-a-decade redistricting process that began with efforts to reduce the raw political self-interest built into the exercise.",
    "I'm not accountable to corporations or PACs, she said in a recent television interview, emphasizing that 93 percent of her campaign donations had come from within Massachusetts.",
    "This weekend, the three candidates will face their first test when delegates to the Democratic Party's state convention will vote to decide who receives the party's endorsement.",
    "The current data on crossover voters includes only those who cast ballots during Georgia's three-week early voting period, when the most politically engaged people tend to vote.",
    "As he sipped coffee near the Grove's dancing fountain on a recent afternoon, he made no apology for tying his vision of the city to the manicured image of his shopping centers.",
    "Just 7 percent of those who voted early during last month's Republican primary cast ballots for Democrats in that party's 2020 primary election, according to the data firm L2.",
    "The two candidates  James Craig, a former Detroit police chief, and Perry Johnson, a wealthy businessman  were among five Republicans in the race who were declared ineligible.",
    "The margin of victory in the 2020 presidential contest was smaller than five percentage points in 33 of the 435 districts, a third fewer than before, the Times analysis found.",
    "But drawing such a conclusion ignores the many reasons for crossover voting in Georgia, and probably overestimates the number of true Democrats voting for Mr. Raffensperger.",
    "The leading candidate in the primary, by all indications, is Andrea Campbell, a former Boston City Council president who finished third in the city's mayoral race last year.",
    "Mr. Caruso had been a longtime Republican, switched his registration to independent in 2019 and then became a Democrat this year, just before announcing his bid for mayor.",
    "While Mr. Caruso has spent more than $25 million on advertising alone, Ms. Bass's campaign has spent a total of less than $3 million, not just on ads but in its entirety.",
    "When you live in an oligarchy, you have to look for the good oligarchs, said Ms. Rice, adding that she was supporting Ms. Bass because of her ability to form coalitions.",
    "The group has plans to support candidates in Michigan and to defend Republican incumbents like Senator Lisa Murkowski of Alaska and Representative Liz Cheney of Wyoming.",
    "Where national Democrats have pivoted to loudly proclaiming their appreciation for America's police officers, Campbell has gotten into public scrapes with police unions.",
    "For example, the Supreme Court is soon expected to release a decision that could strike down a New York law limiting people's ability to carry guns outside their homes.",
    "The Michigan Court of Claims on Wednesday denied the appeal of Mr. Craig, who in a statement on Thursday said he would appeal the ruling to the Michigan Supreme Court.",
    "Trump's Invincibility in Doubt: With many of Donald J. Trump's endorsed candidates failing to win, some Republicans see an opening for a post-Trump candidate in 2024.",
    "Thomas W. King III, a lawyer for the Republican National Committee and Pennsylvania Republican Party, did not immediately respond to a request for comment on Friday.",
    "They see a city riddled with crime, where tent encampments for the homeless have taken over sidewalks and freeway underpasses  a city at its lowest point in years.",
    "Redistricting also has created a much less competitive House map than before, in no small part because of gerrymandering, which tends to create lopsided districts.",
    "The organization has tried to lift candidates in states including Texas and North Carolina, where it successfully helped to oust Representative Madison Cawthorn.",
    "A self-described moderate, Ms. Cooper said that she had voted in both Democratic and Republican primaries in the past, and that she could often vote either way.",
    "After Mr. Caruso attacked Mr. Katzenberg for lying about him, Mr. Katzenberg shot back that Mr. Caruso was too thin-skinned and temperamental to serve as mayor.",
    "Yet in the new map, Mr. Trump was favored by a majority of voters in 20 of the 28 districts, while voters favoring Joseph R. Biden Jr. were a majority in eight.",
    "Many complain about R.V.s parked for days or weeks on residential streets, people defecating in public parks, robberies in the city's wealthiest neighborhoods.",
    "If the Supreme Court does overturn that law, Hochul said, she would immediately call the Legislature back into session to reassess the state's gun regulations.",
    "Judge Cohn Jubelirer wrote that the court's guidance should be uniform, noting that some counties had decided to accept the undated ballots and others had not.",
    "In some cases, rather than attempting varying signatures, the circulator would intentionally scrawl illegibly, the bureau said of the petitions for Mr. Craig.",
    "In an 1858 article in The Atlantic, Oliver Wendell Holmes Sr. only half-jokingly called the statehouse atop Boston's Beacon Hill the hub of the solar system.",
    "Mr. Caruso's wealth  and his association with the boldface names of Los Angeles society  are central both to his public image and his rapid political ascent.",
    "Some of the signatures were cross-checked with that database, and none had redeeming qualities, according to the staff report that was cited in the ruling.",
    "Palfrey and Liss-Riordan have attacked Campbell for refusing to disavow a super PAC, Better Boston, that spent $1.6 million in support of her mayoral run.",
    "The departing attorney general of Massachusetts, Maura Healey, gained a national following for suing Donald Trump's administration in dozens of cases.",
    "The group's message to Georgia Democrats, who had largely noncompetitive races for governor and Senate, was to vote in the Republican primary instead.",
    "But their gains were marginal in the face of President Biden's plummeting approval ratings and the historical pattern of losses by the party in power.",
    "Because of the conservative Supreme Court and a gridlocked Congress, Democrats are now firmly on defense nationally on issues like guns and abortion.",
    "ATLANTA  One look at the results of Georgia's primary election last week led many Republicans to believe it was the product of Democratic meddling.",
    "Both have pushed Campbell to sign the People's Pledge, an agreement to reject corporate donations that was popularized by Senator Elizabeth Warren.",
    "President Biden is expected to call for a change in the nation's gun laws in a White House address on Thursday evening, according to Michael Shear.",
    "Mr. Caruso has also suggested he could model shelters after those built for migrants along the southern border, which have been widely criticized.",
    "Whoever prevailed in the multicandidate Republican primary was likely to win in November in a district that Mr. Hice carried by 25 points in 2020.",
    "LOS ANGELES  At the Grove, the luxury shopping center he created in the middle of Los Angeles, Rick Caruso is treated like the mayor of the mall.",
    "Democrats just straight up are in a stronger position than Republicans, said Kelly Burton, the president of the party's redistricting committee.",
    "The Politics of Guns: Republicans have been far more likely than Democrats to use messaging about guns to galvanize their base in the midterms.",
    "John Fetterman, the Democratic nominee, in the November election for the seat, from which Senator Patrick J. Toomey, a Republican, is retiring.",
    "Former President Donald J. Trump's recruited challengers lost in grand fashion in his most sought-after races: David Perdue was routed by Gov.",
    "Iowa, a World War II-era warship docked at the Port of Los Angeles, two protesters approached Mr. Caruso, cutting through a cluster of guests.",
    "A lower court blocked the Republican map from taking effect last month, substituting a map drawn by a Harvard University redistricting expert.",
    "Election officials said they had identified 36 people who had submitted fraudulent petition sheets consisting entirely of invalid signatures.",
    "Fifty-five percent of these early crossover voters were above the age of 65, and 85 percent were white, according to voter registration data.",
    "In this moment, you need to be attacking the structure, the barriers to epidemic crisis and the limitations of how we design our government.",
    "I didn't want any of the Trumpsters becoming a candidate, said Frances Cooper, 43, who voted in Columbia County, two hours east of Atlanta.",
    "The elections bureau rejected 9,393 of the 23,193 signatures submitted by Mr. Johnson's campaign, leaving him with 13,800 valid signatures.",
    "Republicans noted that they had shored up 15 to 20 Republican incumbents in Congress by drawing districts that were more safely Republican.",
    "Those voters, however, may not have been focused on the statewide races but on the closely contested primary election to replace Mr. Hice.",
    "Campbell, who would be the first Black woman to win statewide office in Massachusetts, has leaned heavily on her extraordinary life story.",
    "His campaign has the backing of several celebrities: Wolfgang Puck, members of the Kardashian-Jenner empire, Gwyneth Paltrow, Snoop Dogg.",
    "Brian Kemp by more than 50 percentage points, while Representative Jody Hice fell to Secretary of State Brad Raffensperger by nearly 20.",
    "Sometimes, the motivation for Democrats or Republicans to cross over into the other party's primary goes deeper than statewide contests.",
    "The Michigan Republican Party and a campaign strategist for Mr. Johnson did not immediately respond to requests for comment on Thursday.",
    "Under the city's unusual primary rules, that would let him skip the November election and go directly to the mayor's office in December.",
    "Operatives on both sides of the aisle have speculated that crossover voting was a chief reason that Mr. Raffensperger avoided a runoff.",
    "She is backing legislation to protect New York health care providers who perform abortions from facing legal penalties in other states.",
    "A group of Senate lawmakers has said it is making progress in bipartisan talks, led by Senator Chris Murphy, Democrat of Connecticut.",
    "The court notes that no party has asserted, or even hinted, that the issue before the court involves allegations of fraud, she wrote.",
    "That way, when a final decision is made on whether to accept the ballots, the judge wrote, the vote count will be readily available.",
    "In the opinion, Judge Cohn Jubelirer said there was no question that the contested ballots had been returned by the May 17 deadline.",
    "But Mr. Trump beat his average in 220 of the new districts, an indication that the House as a whole still tilts slightly Republican.",
    "Some Democratic voters in deep-red counties opted for a Republican ballot because they believed it would be a more effective vote.",
    "For years, he told associates he was reluctant to run for mayor because of the effect it could have on his wife and four children.",
    "A young girl being stabbed over 20 or 30 times alone  dying alone  it could be anybody's daughter, he said later in an interview.",
    "He has acknowledged having leveraged his connections in his 20s to obtain a seat on one of the city's important municipal boards.",
    "Representative Adam Kinzinger of Illinois, a Republican who founded the group Country First, which supports pro-democracy G.O.P.",
    "And his supporters invoke Michael R. Bloomberg, the billionaire and onetime Republican who won three terms as mayor of New York.",
    "It's the people's attorney, said Marie St. Fleur, a former assistant attorney general in Massachusetts who is close to Campbell.",
    "That would represent a vast improvement from 2012, when Mr. Obama's win did not dislodge Republicans from control of the House.",
    "It was intended by the framers to be a political process, and I don't think you'll ever be able to take the politics out of it.",
    "The decision created chaos for Republicans, who characterized it as politically driven and immediately began legal challenges.",
    "When that kind of raw power can be used to decide who can be the chief law enforcement officer of a state, that's a big deal.",
    "But courts also negated Democratic gerrymanders in New York and Maryland, and let Republican ones stand in Kansas and Ohio.",
    "A state canvassing board last week ruled that they did not collect enough valid signatures for the primary to take on Gov.",
    "The voters should be deciding who their candidates are, not an unelected board of government bureaucrats, Mr. Craig said.",
    "A lawyer for Dr. Oz had argued on Tuesday that there were not enough outstanding votes to change the outcome of the race.",
    "They claimed that making voters write the date on the return envelopes for mail-in ballots was aimed at preventing fraud.",
    "Being a bastion of liberalism can sometimes mean that the biggest issues in national politics have already been settled.",
    "Maya King and Nick Corasaniti investigate a Georgia mystery: How many Democrats voted in the state's Republican primary?",
    "We are going to have a huge offensive playing field this fall, said Adam Kincaid, the organization's executive director.",
    "Only Richard Irvin's Republican campaign for Illinois governor has spent more on ads so far this year at $28.8 million.",
    "The ballots should be set aside, the lawyer said, with counties reporting the total number but not counting the votes.",
    "Still, that hasn't dissuaded some from pointing to crossover voters as a root cause of Mr. Raffensperger's success.",
    "People in Massachusetts are pretty content, said Scott Ferson, a Democratic consultant who is neutral in the race.",
    "Better Boston has not spent any money so far in the attorney general's race, though it has not shut down, either.",
    "The Democrats appear to have come out of the map-drawing battles in slightly better shape than before they began.",
    "A candidate must get a majority of votes from the board's four members to be certified for a spot on the ballot.",
    "Even as President Barack Obama won re-election in 2012, Republicans maintained a 17-seat majority in the House.",
    "The state's First District Court of Appeal later lifted that stay, saying the judge had exceeded his authority.",
    "The Florida court ruling appeared to extinguish their last hope of further bolstering their midterm prospects.",
    "Some of the fraudulent signatures represented voters who had died or moved out of the state, the bureau said.",
    "Still, his supporters say it is precisely his experience outside government that is driving their enthusiasm.",
    "Mr. Trump and his allies pointed to so-called Democratic crossover voters as the cause of their shellackings.",
    "But Mr. Caruso dismisses such criticism as anti-religious and insists he supports a woman's right to choose.",
    "The son of the founder of Dollar Rent a Car, Mr. Caruso grew up wealthy and learned early how to use power.",
    "For decades, Mr. Caruso has contributed to both Democratic and Republican politicians, including Ms. Bass.",
    "That has left governors like Hochul trying to pass state laws through Democratic-controlled legislatures.",
    "His group distributed mailers, sent text messages and ran television ads in support of Mr. Raffensperger.",
    "Her father, an associate of Whitey Bulger, the notorious Irish mobster, spent much of his life in prison.",
    "Sonia Alleyne, a former bank executive listed as the chairwoman of the group, did not respond to emails.",
    "Palfrey has said the donations could create a conflict of interest if Campbell becomes attorney general.",
    "Shoppers stop to shake his hand, pose for photographs and occasionally offer suggestions and complaints.",
    "candidates, cited the Georgia secretary of state's victory as proof of his organization's effectiveness.",
    "She was undecided about the November general election for governor, but if anything leaning toward Kemp.",
    "They yelled that Mr. Caruso was anti-abortion, and that Los Angeles did not want a billionaire mayor.",
    "Any candidate who does not reach 15 percent support among delegates will not make the primary ballot.",
    "To be sure, Hochul faces challenges and limitations regardless of what the federal government does.",
    "But when you campaign with bumper stickers and 30-second ads, you run to fear and you run to anger.",
    "The treatment of undated mail-in ballots is at the heart of another legal dispute in Pennsylvania.",
    "Casey Contres, the campaign manager for Dr. Oz, declined to comment about the decision on Friday.",
    "When Campbell was just 8 months old, her mother died in a car accident while trying to visit him.",
    "The Supreme Court ruling on Thursday rebuffed a request to overturn the appeals court's decision.",
    "The state has always had a crusading streak  it was, after all, founded by religious dissidents.",
    "Al Checchi spent $40 million on a failed bid for the Democratic nomination for governor in 1998.",
    "It's a terrible thing for our state and it's an attack on our election system, Mr. Brater said.",
    "In other instances, they circulated petition sheets among themselves, each filling out a line.",
    "That edge slowly eroded as courts undid some gerrymanders and the political landscape shifted.",
    "Campbell has raised nearly $1 million so far, significantly ahead of Palfrey and Liss-Riordan.",
    "But she faulted his campaign strategy, criticizing him for playing on voters' anger and fear.",
    "But I think it also went, you know, to this fear that you've got of people that are homeless.",
    "It also clarified that it saw no evidence that the candidates had any knowledge of the fraud.",
    "Like other leading Democrats, she blames the opposing party for the slow pace in Washington.",
    "primary had participated in both Democratic and Republican primaries over the last decade.",
    "We're going to have cleaner streets and better parks, and we're going to have lower crime.",
    "But the candidates in this race have struggled to differentiate themselves on the issues.",
    "A campaign spokeswoman for Mr. McCormick lauded the court order in a statement on Friday.",
    "So the race to succeed Healey, who is running for governor, is very much worth following.",
    "But Mr. Caruso has an outside shot at coming away with more than 50 percent of the vote.",
    "Most of the crossover voters, the Democrats said, would return to the party in November.",
    "Others, frustrated with leadership in Washington, voted according to their misgivings.",
    "He argues that it's not his politics that have changed but the rest of the country's.",
    "He calls himself a lifelong moderate and points to his early criticism of Mr. Trump.",
    "This time, she said, Mr. Kemp had been pretty good, and was the best of our options.",
    "And 70 percent of this year's crossover voters who cast early ballots in the G.O.P.",
    "Gretchen Whitmer, the Democratic incumbent, in the battleground state in the fall.",
    "It is the Republicans who are thwarting the will of the American people, she said.",
    "He expects the primary, which will be held on Sept. 6, to be a low-turnout affair.",
    "But no analogy can quite capture a man who is a uniquely Los Angeles phenomenon.",
    "Rest assured, we will be appealing this questionable decision to a higher court.",
    "Republicans have fought to enforce the rule, siding with Dr. Oz in the lawsuit.",
    "Governors Emboldened: Many Republican governors are in strong political shape.",
    "And Meg Whitman blew $143 million of her fortune running for governor in 2010.",
    "Donald J. Trump carried Florida by 3.3 percentage points in the 2020 election.",
    "When everyone's the same on policy, Ferson said, people vote for biography.",
    "There's a lot of people like you, Mr. Caruso said, nodding in agreement.",
    "The ruling, which preserves the new House map personally ordered by Gov.",
    "Mr. Kinzinger said the efforts helped Mr. Raffensperger avoid a runoff.",
    "His daughter was a classmate of the victim's at Brentwood High School.",
    "Moneyed would-be politicians have a spotty track record in California.",
    "And you're going to be able to go for a walk and not worry about it.",
    "She's also supporting a sweeping package to protect abortion rights.",
    "But a closer look at these voters paints a more complicated picture.",
    "Mr. Caruso has long cultivated an image as a doting family man.",
    "During an event with about 100 people on the deck of the U.S.S.",
    "The parties have agreed that this election was free and fair.",
    "Her older brother, Alvin, has been charged with serial rape.",
    "Mr. Caruso looked over at his daughter and began to tear up.",
    "We have to make it so our kids can go out in the streets.",
    "But his most generous donations have benefited the G.O.P.",
    "Less than 3 percent were between the ages of 18 and 29.",
    "I have no doubt we made the impact, Mr. Kinzinger said.",
    "Blake & Leah\nIs there anything you think we're missing?",
    "I'm going to make L.A. more livable, Mr. Caruso said.",
    "Her father died when she was 19 and still in college.",
    "This homeless thing is also out of control, he said.",
    "Still, those numbers do not tell the whole story.",
    "The Republican primary winner will face Lt. Gov.",
    "Kathy Hochul of New York said in an interview.",
    "We're not wasting a second of time, she said.",
    "And that is true no matter how you slice it.",
    "We have a higher baseline number of seats.",
    "I think our city is in shambles right now.",
    "It shook my world, she has told reporters.",
    "And some are openly opposing Mr. Trump.",
    "Email us at onpolitics@nytimes.com.",
    "They aren't looking for revolution.",
    "It's a political process, he said.",
    "Anything you want to see more of?",
    "Democrats made their own claims.",
    "gerrymander in North Carolina.",
    "You know what I'm going to do?",
    "This is a very anti-gun state.",
    "I'm accountable to the people.",
    "Take Clarke County in Georgia.",
    "And I'm prepared to be bold.",
    "Many unknowns still remain.",
    "We'd love to hear from you.",
    "Our fight is not over.",
    "That's who we are.",
    "She has refused.",
    "for law school.",
    "Senate primary.",
    "Here's why.",
    "G.O.P."
  ]
}