{
  "id": 948,
  "mediaId": 43,
  "date": "d2022-02-25T00:00",
  "headline": "Morning Digest: Longtime GOP senator in Oklahoma reportedly to resign, triggering special election",
  "image": "https://images.dailykos.com/images/1041664/story_image/GettyImages-1237832680.jpg?1645759632",
  "link": "https://www.dailykos.com/story/2022/2/25/2082217/-Morning-Digest-Longtime-GOP-senator-in-Oklahoma-reportedly-to-resign-triggering-special-election",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    651
  ],
  "sentences": [
    "Campbell was able to submit paperwork to run for the 4th District even though Missouri still doesn't have final congressional or state Senate maps because Secretary of State Jay Ashcroft determined that candidates for those offices should, for now, file to run for the existing districts; the filing deadline is currently set for March 29.\n? NC-01: With North Carolina's new congressional map finally in place (see our NC Redistricting item above), pieces are falling into place across the state.",
    "Texas primary preview, with Jeff Singer\nThe Downballot\nFollowShare\n0:0044:16\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? OK-Sen-B: The New York Times' Jonathan Martin tweeted Thursday that he's been \"hearing\" that Republican Sen. Jim Inhofe, who is 87, \"may resign in the next few days,\" and several outlets quickly confirmed that the senator plans to leave office when the current Congress ends and a successor can be elected.",
    "This eastern North Carolina district would have gone for Biden 53-46.\n? NC-06: Freshman Democratic Rep. Kathy Manning has confirmed she'll seek re-election in the new 6th, a Greensboro-based seat that Biden would have carried 56-43.\n? NC-08: Republican Rep. Dan Bishop, who represents the old 9th District, announced Thursday evening that he'd be seeking the new 9th, which would have gone for Trump 66-32.",
    "Contenders who fail to hit the 20% threshold can still make it to the primary, though, if they turn in the requisite number of signatures by March 8.\n? PA-Gov: Guy Ciarrocchi, who is the former president of the Chester County Chamber of Business and Industry, announced Thursday that he was dropping out of the May Republican primary.",
    "? MN-01: Richard Painter, a former ethics lawyer for the George W. Bush White House, on Wednesday announced that he would seek the Democratic nomination in both the special election and for the regular two-year term in Minnesota's vacant 1st District, but he's unlikely to deter anyone else from running.",
    "? TN-05: Former state House Speaker Beth Harwell announced Thursday that she would join the August Republican primary for the open 5th District, which her old colleagues in the legislature transformed from a 60-37 Biden district to a 54-43 Trump constituency by carving the city of Nashville to pieces.",
    "? TX-28: While the Democratic primary rematch between conservative Rep. Henry Cuellar and civil rights attorney Jessica Cisneros in this Laredo-based seat is the main event here next week, Republicans also have a competitive nomination contest in a district that would have favored Joe Biden 53-46.",
    "? RI-Gov: Former Rhode Island Turnpike and Bridge Authority chair David Darlington said this week that he was ending his bid for the Republican nomination for governor, though he never actually submitted any paperwork in the nearly five months between when he declared his candidacy and now.",
    "? TX-35: Public Policy Polling has conducted a Democratic primary survey on behalf of a trio of groups supporting Austin City Council member Greg Casar that shows him far ahead of the rest of the field with 42% of the vote, which is still a bit below the majority he'd need to win outright.",
    "In December, Street proposed a GOP-friendly map that would have created a new open seat based in Philadelphia custom-made for himself by undermining Boyle's base, but the boundaries the state Supreme Court ended up approving made only small changes to the safely blue 2nd District.",
    "Taylor next week faces a field that includes former Collin County Judge Keith Self, who has attacked the congressman for voting to accept Joe Biden's Electoral College victory in the hours after the attack on the Capitol and for supporting the creation of the Jan. 6 commission.",
    "? MI-10: Macomb County Judge Carl Marlinga, a Democrat whose resignation takes effect Friday, asked Attorney General Dana Nessel earlier this week for a legal option about whether state law prohibits him from seeking federal office, but her office declined to do so.",
    "Redistricting\n? NC Redistricting: Late on Wednesday night, the North Carolina Supreme Court rejected multiple appeals of a trial court ruling issued earlier the same day implementing a new congressional map and greenlighting new legislative maps passed by lawmakers.",
    "Morgenthau, a prominent fundraiser for Joe Biden's campaign, comes from a legendary political family: Her grandfather, Henry Morgenthau Jr., was FDR's secretary of the treasury, while her uncle, Robert Morgenthau, served decades as Manhattan's district attorney.",
    "? RI-02: Sarah Morgenthau, who recently stepped down as an official at the U.S. Department of Commerce, announced Thursday that she was joining the September Democratic primary for the open 2nd District, which makes her the sixth notable candidate to declare.",
    "Yanez previously ran for Congress in 2010 against then-Rep. Candice Miller in a safely red seat (which was also numbered the 10th District) and lost the general election 72-26, but he bounced back two years later by winning a competitive state House district.",
    "? MO-04: Former NHL right wing Jim Campbell, who played for the St. Louis Blues from 1996 to 1999, has filed paperwork with the state to seek the Republican nod for what will almost certainly remain a safely red constituency in the western part of the state.",
    "Several plaintiffs had challenged the new state Senate map, which passed the Republican-run legislature on party lines, as improperly skewed toward the GOP, while Republicans attacked the lower court for substituting its own congressional plan for theirs.",
    "Oklahoma Sen. Jim Inhofe (R)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "? NM-Gov: 2020 Senate nominee Mark Ronchetti launched his first TV ad this week, just days ahead of the Saturday Republican primary convention; the GOP firm Medium Buying says it's running on Fox, though there's no word on the size of the buy.",
    "Team Blue's field could grow larger still: Former state Rep. David Segal, who lost the 2010 primary for the 1st, said the previous day that he was forming an exploratory committee and wants \"to make my intentions known over the coming weeks.\"",
    "Harwell joins a field that includes former State Department spokesperson Morgan Ortagus, who is Donald Trump's endorsed candidate, and music video producer Robby Starbuck, and more could still get in ahead of the early April filing deadline.",
    "This week a group called Protect and Serve PAC launched a $200,000 buy in support of former San Antonio police officer Willie Vasquez Ng, who lost the 2020 primary for Bexar County sheriff, that touts his law enforcement background.",
    "Marlinga, though, has argued that he's allowed to run for the House because of a 1995 Supreme Court decision that ruled that states cannot add further qualifications to candidates for Congress that aren't in the U.S. Constitution.",
    "Yanez convincingly held on during the 2014 GOP wave and won his final term 54-46 even as Donald Trump was carrying his constituency 52-43, but he went on to lose a contested race in 2018 for a GOP-leaning state Senate district.",
    "Elect Principled Veterans Fund, which is affiliated with the super PAC With Honor, has dropped $207,000 for TV and digital advertising to boost the congressman (a Marine vet), which brings its total spending here to $317,000.",
    "We'll be referring to this special election for the final four years of Inhofe's term as OK-Sen-B, while the regular contest, which features Republican Sen. James Lankford's bid for another six-year term, will be OK-Sen-A.",
    "We start with the redrawn 1st District, where state Sen. Don Davis, state Rep. James Gailliard, and former state Sen. Erica Smith have all confirmed that they'll run to succeed retiring Democratic Rep. G.K. Butterfield.",
    "The Oklahoman adds that, because there have been rumors for weeks about the senator's resignation, Reps. Kevin Hern and Markwayne Mullin have been \"positioning themselves\" to run, while former state House Speaker T.W.",
    "Marlinga, who is considering running for this competitive open seat in the Detroit suburbs, subsequently claimed that the attorney general's response \"clears the path\" for him to campaign for the new 10th District.",
    "Szoka ended last year with $140,000 on hand for a campaign for the 4th District that the GOP created in its first congressional gerrymander, but it appeared he would be out of luck after that map was struck down.",
    "He was therefore likely one of the very few Republicans who was relieved that those boundaries survived less than a week and were replaced by a court-drawn map that is otherwise much more favorable to Democrats.",
    "? PA-02: The Philadelphia Inquirer reports that state Sen. Sharif Street has decided not to challenge Rep. Brendan Boyle in the May Democratic primary now that the new congressional districts have been released.",
    "Gina Raimondo, who now leads the Commerce Department, to the governor's Homeland Security Advisory Board, and Morgenthau says she's spent time in the state \"very regularly\" over \"the last couple of years.\"",
    "That seemed like it would be his last campaign as a Democrat, too, as Painter said just last week that he was open to running as an independent this year against Democratic Attorney General Keith Ellison.",
    "As we've written before, any candidate who wins the support of at least 20% of the convention delegates will advance to the primary, and the person who takes first earns the top spot on the June ballot.",
    "Segal, for his part, was active in Providence progressive politics in 2002 when he was elected to the City Council as a member of the Green Party, and he briefly served as the chamber's minority leader.",
    "? NC-09: Republican Rep. Richard Hudson, who holds the old 8th District, said Thursday morning he'd be running for the new 9th, a seat in the south-central part that would have supported Trump 53-45.",
    "Morgenthau herself has spent most of her career outside the state and only registered to vote in Rhode Island early this month, though she stressed her personal and family ties to the Ocean State.",
    "Meanwhile, Sterling Heights City Council member Henry Yanez tells the Detroit News that he's considering entering the August Democratic primary as well and hopes to decide in the next few weeks.",
    "? MI-Gov: While former Republican Rep. Pete Hoekstra didn't rule out running for governor in May, he appeared via pre-recorded video at an event for businessman Perry Johnson on Wednesday.",
    "We've seen no polls, though, to indicate whether Self, who hasn't spent much money to push his message, can keep Taylor from taking the majority of the vote he needs to avoid a May runoff.",
    "The timing would also allow a special election to take place this year, with the primary and general election coinciding with the regularly scheduled race for Oklahoma's other Senate seat.",
    "With the state Supreme Court declining to intervene further, that means district lines are set for the November election, barring a longshot Republican appeal to the U.S. Supreme Court.",
    "? NC-13: Democratic state Sen. Wiley Nickel has announced that he's in for the new 13th District, a suburban Raleigh constituency that would have favored Biden by a narrow 50-48 margin.",
    "He campaigned to the left of his many primary foes and ended up in third place with 20%; the winner, with 37%, was Providence Mayor David Cicilline, who still holds the district today.",
    "Her late mother, Ruth Morgenthau, was also the Democratic nominee for a previous version of the 2nd District in 1988, but she badly lost to Republican incumbent Claudine Schneider.",
    "After joining the Democrats and winning a seat in the state House, Segal ran for the 1st District in 2010, which was the last time Rhode Island had an open-seat race for Congress.",
    "At issue is a provision in the state constitution that bars sitting and former judges from running for a non-judicial office unless they've been off the bench for at least a year.",
    "Senate\n? FL-Sen, FL-Gov: The University of North Florida's first general election survey of the cycle finds Republican Sen. Marco Rubio leading Democratic Rep. Val Demings 46-34.",
    "Jackson spent most of 2021 running for the U.S. Senate before dropping out in December, and he says he still has almost all of the $830,000 war chest he ended that campaign with.",
    "WFAE also reports that Charlotte Mayor Pro Tem Julie Eiselt is also thinking about entering the Democratic primary, while the city's mayor, Vi Lyles, did not answer when asked.",
    "Slotta, who had been running for the 7th District last year under the first GOP map, had $232,000 on hand in December that also almost entirely came from his own bank account.",
    "Team Red has a massive bench of elected officials here, but according to the Associated Press, the person Inhofe is \"expected to support\" is his chief of staff, Luke Holland.",
    "His time out of office was short, though, as he was appointed to a vacant seat on the Sterling Heights City Council months later and subsequently held it at the ballot box.",
    "House\n? CA-37: EMILY's List has endorsed Democratic state Sen. Sydney Kamlager in the June top-two primary to succeed Rep. Karen Bass, who also backed Kamlager last month.",
    "? NC-14: Democratic state Sen. Jeff Jackson said Thursday that he was considering running for the new 14th District, a Charlotte-area seat that Biden would have won 57-41.",
    "KOCO's Dillon Richards says that Inhofe will hold a press conference Friday afternoon, while both Politico and Martin put Monday as the date of his departure announcement.",
    "During the pre-primary period, which covered Jan. 1 to Feb. 9, Cabrera outspent Ng $59,000 to $51,000 and had a $118,000 to $98,000 cash-on-hand lead for the final weeks.",
    "Harwell was elected to the legislature in 1988 to a Nashville seat, and she made history in 2011 by becoming the first, and to date only, woman to lead the lower chamber.",
    "Daughtry, who is the daughter of former state Rep. Leo Daughtry, had $151,000 on hand, almost all of it self-funded, at the end of 2021 for the now-defunct 4th District.",
    "Kay Ivey's latest commercial takes up the transphobic themes that businessman Tim James, who is one of her opponents in the May Republican primary, has been emphasizing.",
    "Bishop's declaration came a day after he said he was \"weighing whether to run in the court-imposed 8th or 9th district\" or for an unnamed \"state-wide judicial office.\"",
    "The Congressional Leadership Fund has further deployed a total of $193,000 for him, which makes Taylor the first incumbent it's ever directly aided in a GOP primary.",
    "Last week, Szoka was one of just two Republican representatives to vote against the second map the legislature passed, which would have very much disadvantaged him.",
    "Painter, who joined the Democratic Party in 2018, challenged appointed Sen. Tina Smith in that year's primary and got utterly destroyed, losing by a 76-14 margin.",
    "(The younger Morgenthau is also related through her father to the late historian Barbara Tuchman, the Pulitzer Prize-winning author of \"The Guns of August.\")",
    "The Republican field so far includes activist DeVan Barbour and two others we hadn't previously mentioned: attorney Kelly Daughtry and pastor Chad Slotta.",
    "State Rep. Eddie Rodriguez, meanwhile, leads former San Antonio City Councilwoman Rebecca Viagran 13-9 for the second spot in the potential May runoff.",
    "There seems to be far more where that came from too, as NC Insider's Brian Murphy reports she threw in an additional $2 million Thursday morning.",
    "The Sooner State is one of the reddest states in the nation, so there's no question that the eventual Republican nominee will succeed Inhofe.",
    "Six other Republicans are also in, including businessman Ed Cabrera and former Ted Cruz staffer Cassy Garcia, who has her old boss' support.",
    "No other notable Republicans have announced a campaign, though businesswoman Ashley Kalus did file paperwork of her own earlier this month.",
    "The incumbent, though, already faces intra-party opposition from state Rep. John Szoka, who said the previous day that he'd campaign here.",
    "On the Republican side, state Sen. Julie Rosen said she wouldn't make the race but would instead support former state Rep. Brad Finstad.",
    "\"Biden's Critical Race Theory is racist, wrong and dead as a doornail,\" says the incumbent before continuing, \"Transgender sportstoast.",
    "She left in 2018 to run for governor but, despite her powerful post, she took fourth place in every single poll released that year.",
    "The Justice Democrats, which was one of the organizations that sponsored the new survey, is also spending $128,000 to help Casar.",
    "Ron DeSantis, meanwhile, defeats Rep. Charlie Crist and state Agriculture Commissioner Nikki Fried 55-34 and 55-32, respectively.",
    "Segal hasn't sought elected office in the ensuing decade, though he did found the national liberal organization Demand Progress.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Clark, too, had been running for the now-defunct 4th District, but he had just $23,000 on hand at the conclusion of December.",
    "As long as Inhofe submits his resignation on or before March 1, he will be allowed to serve for the rest of the year and Gov.",
    "? OH-13: EMILY's List has endorsed state Rep. Emilia Sykes, who is the former leader of the chamber's Democratic minority.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "John McGuire has announced that he's ending his campaign for Congress and will instead seek a state Senate seat next year.",
    "For a full rundown on the impact of the new congressional boundaries, see our House section below, starting with NC-01.",
    "Ciarrocchi had by far the longest title of all the GOP candidates, but he struggled to raise a serious amount of money.",
    "Crypto Innovation, which doesn't try to hide what industry it's affiliated with, is also spending $110,000 for Taylor.",
    "The AP and Politico also name several other Republicans who could run, including attorney Gentner Drummond, Lt. Gov.",
    "(Cabrera has self-funded almost his entire campaign, while Ng is also responsible for a portion of his budget.)",
    "? TX-03: Rep. Van Taylor is continuing to benefit from outside spending ahead of Tuesday's Republican primary.",
    "Ronchetti is one of five Republicans competing in the June primary for the right to take on Democratic Gov.",
    "The last poll we saw was a January Lake Research internal for Casar that had him beating Rodriguez 48-20.",
    "And sure enough, Harwell ended up placing fourth with 15%, which was well below the 37% that now-Gov.",
    "Garcia deployed just $9,000 during this time, though she had $101,000 available for the homestretch.",
    "State Sen. Malcolm Graham, though, was an emphatic no, saying, \"Juice is not worth the squeeze.\"",
    "(Under state law, a court-imposed remedial map may be used \"in the next general election only.\")",
    "Stitt is currently running for re-election, while Drummond is campaigning for attorney general.",
    "Finstad, who works for the U.S. Department of Agriculture, has not yet said anything publicly.",
    "Ronchetti spends the spot pledging to create \"a border strike force to go after the cartels.\"",
    "Speaking of Democrats, state Sen. Ben Clark has also declared that he's running for the 9th.",
    "Shannon ran in the 2014 special when Sen. Tom Coburn resigned, but Lankford beat him 57-34.",
    "Citing the death of a family member, however, he has not yet made a public announcement.",
    "Michelle Lujan Grisham, and Saturday's event will be an early test for the contenders.",
    "Candidate filing commenced immediately on Thursday and will continue through March 4.",
    "The congressional map, however, is only valid for 2022, per the trial court's ruling.",
    "? NY-11: VoteVets has endorsed former Rep. Max Rose in the June Democratic primary.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "The new candidate, though, declined to reveal if she'd do any self-funding.",
    "If no one earns a majority of the vote, a runoff would take place Aug. 23.",
    "The statewide filing deadline is April 15, while the primary is June 28.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "This appears to be the first notable outside spending on the GOP side.",
    "Matt Pinnell, former U.S. Attorney Trent Shore, and Stitt himself.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Kevin Stitt would not be able to appoint a replacement.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Shannon is also reportedly thinking about it.",
    "Check out our new podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "She was appointed in 2017 by then-Gov.",
    "They can try that in California.\"",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "? VA-07: Republican Del.",
    "Governors\n? AL-Gov: Gov.",
    "Daily Kos is different.",
    "Bill Lee earned.",
    "Please read it.",
    "Republican Gov."
  ]
}