{
  "id": 975,
  "mediaId": 151,
  "date": "d2022-02-14T14:54",
  "headline": "Campaigns roll out Super Bowl ads",
  "image": "https://static.politico.com/8b/96/ea2c33a94ba0ae55477a6f073a19/20220214-superbowl-getty-773.jpg",
  "link": "https://www.politico.com/news/2022/02/14/campaigns-roll-out-super-bowl-ads-00008579",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    651,
    886,
    1335,
    2142,
    2550,
    2590,
    2714,
    2791,
    2862
  ],
  "sentences": [
    "An exterior view of at SoFi Stadium during Super Bowl 56 on Feb. 13 in Inglewood, Calif. | Katelyn Mulcahy/Getty Images\nBy Stephanie Murray\n 02/14/2022 09:26 AM EST\nUpdated: 02/14/2022 09:54 AM EST\nIt wasn't all commercials for cryptocurrency and the metaverse during the Super Bowl.",
    "McCormick aired a 30-second spot featuring audio of the chant, a euphemism for F Joe Biden.?\nThe ad displays headlines documenting rising crime, an increase in illegal border crossings and rising inflation, among other issues.",
    "Another GOP Senate hopeful, Jim Lamon in Arizona, spent six figures to produce and air an ad that depicts him in an old Western-style shootout with President Joe Biden, House Speaker Nancy Pelosi and Sen. Mark Kelly (D-Ariz.).",
    "Johnson, a businessperson, kicked off a $1.5 million ad buy that will run through the first week of March, according to The Detroit News' Craig Mauger.",
    "Former President Donald Trump took advantage of the game in 2020, spending $10 million on the airwaves just days before the Iowa Democratic caucuses.",
    "Republican Dave McCormick, who's running in Pennsylvania's Senate primary, brought the anti-Biden slogan Let's Go Brandon? to prime time on Sunday.",
    "The commercial ends with text that reads THIS IS SO MUCH BIGGER THAN BRANDON,? and aired during the Super Bowl in Pennsylvania.",
    "The ad highlight's Perry's background as a perfection-seeking guru? who brought higher standards to the automotive industry.",
    "A handful of candidates also seized the opportunity to appear on air Sunday during one of the biggest TV events of the year.",
    "Lamon, wearing a sheriff's badge and a cowboy hat, shoots weapons out of the hands of his Democratic adversaries.",
    "The actor flirted with a bid for Texas governor last year, before opting against running against GOP Gov.",
    "Candidates have long used the Super Bowl to air political ads in House, Senate and gubernatorial races.",
    "In Michigan, Republican gubernatorial candidate Perry Johnson took a more traditional approach.",
    "Perry is one of more than a dozen Republicans running for a chance to take on Democratic Gov.",
    "This year's big event even featured an almost-candidate  Matthew McConaughey.",
    "McCormick wasn't the only one to bash the president during Super Bowl 56.",
    "He appeared in a Super Bowl ad for Salesforce instead.",
    "Gretchen Whitmer.",
    "Greg Abbott."
  ]
}