[
  {
    "id": 2421,
    "mediaId": 43,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "Mandela Barnes has publicized a mid-December ALG Research survey that gives him a 40-11 lead over Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span> in the August primary.",
    "author": "",
    "title": "Morning Digest: Why the special election to succeed Devin Nunes could be an orphan race"
  },
  {
    "id": 2407,
    "mediaId": 43,
    "date": "1/20/2022 12:00:00 AM",
    "sentence": "? WI-Sen: Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span> has launched what his campaign says is a seven-figure ad buy well ahead of the August Democratic primary, which makes these his first commercials in more than two months.",
    "author": "",
    "title": "Morning Digest: Republican launches rematch for governor in Connecticut after close 2018 race"
  },
  {
    "id": 938,
    "mediaId": 43,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "Bynum says he will not seek the GOP nod for any office in 2022.\n? WI-Sen: Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span> has released a poll from Normington Petts that shows him trailing Lt. Gov.",
    "author": "",
    "title": "House Democrat and indicted GOP attorney general headed to runoffs"
  },
  {
    "id": 2378,
    "mediaId": 367,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "In a statement, the group's communications director Chris Hartline said: Wisconsin doesn't need a spoiled rich kid like <span class='selected-term'>Alex Lasry</span> who thinks it's okay to use his wealth and power to cut in line ahead of vulnerable, elderly Wisconsinites to receive the COVID-19 vaccine, as he did last month.",
    "author": "Bill Glauber",
    "title": "Marquette poll shows Rebecca Kleefisch and Mandela Barnes leading key primary contests"
  },
  {
    "id": 2376,
    "mediaId": 43,
    "date": "3/3/2022 12:00:00 AM",
    "sentence": "Mandela Barnes outpaces Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span> 23-13, with Outagamie County Executive Tom Nelson at 5%; a recent Lasry internal from Normington Petts found him trailing Barnes 35-27.",
    "author": "",
    "title": "Morning Digest: A day after being forced into surprise runoff, Texas congressman quits amid scandal"
  }
]