[
  {
    "id": 2338,
    "mediaId": 367,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "The push for unionization has received support from Wisconsin Democrats U.S. Sen. Tammy Baldwin and Rep. Mark Pocan, as well as Democratic Senate candidates <span class='selected-term'>Alex Lasry</span> and Mandela Barnes, Wisconsin's lieutenant governor.",
    "author": "Piet Levy",
    "title": "Employees of Pabst Theater Group in Milwaukee are trying to form a union"
  },
  {
    "id": 2330,
    "mediaId": 367,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span> poured $3.45 million into his campaign in the first three months of the year, while state Treasurer Sarah Godlewski added $1.5 million to her campaign, according to statements issued Thursday.",
    "author": "Bill Glauber",
    "title": "Bucks executive Alex Lasry, Wisconsin Treasurer Sarah Godlewski spend big in Democratic U.S. Senate race"
  },
  {
    "id": 2321,
    "mediaId": 195,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span>'s campaign said he raised $3.9 million during the period.",
    "author": "Julia Manchester",
    "title": "Johnson raises $7.1 million in first quarter"
  },
  {
    "id": 6550,
    "mediaId": 367,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Texts from friends alerted <span class='selected-term'>Alex Lasry</span> that gunfire was erupting outside Fiserv Forum at the end of Friday night's Milwaukee Bucks playoff game.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate candidate Alex Lasry calls for more cops on the street, tighter gun laws"
  },
  {
    "id": 6548,
    "mediaId": 367,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "A recent Marquette University Law School Poll showed a race that appeared to be tightening, with Barnes leading <span class='selected-term'>Alex Lasry</span>, on leave from his executive job with the Milwaukee Bucks.",
    "author": "Bill Glauber",
    "title": "U.S. Sen. Elizabeth Warren praises Mandela Barnes, calls out Ron Johnson during Milwaukee appearance"
  }
]