[
  {
    "id": 2387,
    "mediaId": 367,
    "date": "d2022-02-21T00:00",
    "sentence": "Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span> said he believes there is inherent inequality in the current system.",
    "author": "Daniel Bice",
    "title": "Bice: U.S. Senate candidate Mandela Barnes favors eliminating cash bail nationally, aide says",
    "sentiment": "0"
  },
  {
    "id": 2386,
    "mediaId": 367,
    "date": "d2022-02-23T00:00",
    "sentence": "Mandela Barnes, state Treasurer Sarah Godlewski, Outagamie County Executive Tom Nelson and <span class='selected-term'>Alex Lasry</span>, on leave from his executive job with the Milwaukee Bucks.",
    "author": "Bill Glauber",
    "title": "Gillian Battino expected to leave Democratic U.S. Senate race and announce run for state treasurer",
    "sentiment": "0"
  },
  {
    "id": 2385,
    "mediaId": 367,
    "date": "d2022-02-24T00:00",
    "sentence": "Nelson is trying to provide a contrast in the race against top contenders Barnes, state Treasurer Sarah Godlewski and <span class='selected-term'>Alex Lasry</span>, on leave from his executive job with the Milwaukee Bucks.",
    "author": "Bill Glauber",
    "title": "'Voters don't know where he's at': Tom Nelson turns sights on Democratic rival Mandela Barnes in U.S. Senate race",
    "sentiment": "0.0"
  },
  {
    "id": 2380,
    "mediaId": 124,
    "date": "d2022-03-01T14:05",
    "sentence": "A new poll from Milwaukee Bucks executive and Democratic Senate candidate <span class='selected-term'>Alex Lasry</span> shows he's catching up to Wisconsin Lt. Gov.",
    "author": "",
    "title": "Biden's State of the Union checklist expands from economy to Covid and war in Europe",
    "sentiment": "0.0"
  },
  {
    "id": 2371,
    "mediaId": 195,
    "date": "d2022-03-09T15:43",
    "sentence": "Mandela Barnes (D) leading that primary field with 23 percent support, while Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span> trailed at 13 percent support and Outagamie County Executive Tom Nelson garnered five percent support.",
    "author": "Julia Manchester",
    "title": "Johnson touts work with Milwaukee faith initiative in new ads",
    "sentiment": "0.0"
  },
  {
    "id": 2368,
    "mediaId": 367,
    "date": "d2022-03-14T00:00",
    "sentence": "While Democrats have a large primary field, the ad space so far has been dominated by Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span>, whose campaign has spent more than $3 million on TV spots.",
    "author": "Bill Glauber",
    "title": "Democrat Sarah Godlewski releases her first TV ad in her bid for U.S. Senate, takes swipe at Republican Ron Johnson",
    "sentiment": "0"
  },
  {
    "id": 2367,
    "mediaId": 151,
    "date": "d2022-03-14T08:30",
    "sentence": "",
    "author": "",
    "title": "GOP Senate candidates thrash each other ahead of fight for majority",
    "sentiment": "0.0"
  }
]