[
  {
    "id": 2426,
    "mediaId": 195,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, state Treasurer Sarah Godlewski, Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span> and Outagamie County Executive Tom Nelson.",
    "author": "Tal Axelrod",
    "title": "Ron Johnson announces run for third Senate term in Wisconsin"
  },
  {
    "id": 2380,
    "mediaId": 124,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "A new poll from Milwaukee Bucks executive and Democratic Senate candidate <span class='selected-term'>Alex Lasry</span> shows he's catching up to Wisconsin Lt. Gov.",
    "author": "",
    "title": "Biden's State of the Union checklist expands from economy to Covid and war in Europe"
  },
  {
    "id": 2374,
    "mediaId": 124,
    "date": "3/3/2022 12:00:00 AM",
    "sentence": "Mandela Barnes (23 percent) and businessman <span class='selected-term'>Alex Lasry</span> (13 percent) are the only two candidates in double-digits.",
    "author": "",
    "title": "Twelve months that moved the Democratic Party left of Biden"
  },
  {
    "id": 340,
    "mediaId": 124,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "Mandela Barnes and Milwaukee Bucks co-owner <span class='selected-term'>Alex Lasry</span>, Godlewski goes after incumbent Republican Sen. Ron Johnson.",
    "author": "",
    "title": "Trump attempts to fix his Putin problem"
  },
  {
    "id": 1191,
    "mediaId": 124,
    "date": "3/16/2022 12:00:00 AM",
    "sentence": "Wisconsin Democratic Senate hopeful <span class='selected-term'>Alex Lasry</span> is opening up his deep pockets again with a new seven-figure ad campaign, his first to attack Republican Sen. Ron Johnson directly, NBC News reports\nIn Lasry's new spot, the candidate uses Johnson's support for Fla. GOP Sen. Rick Scott's policy plan  as well as recent comments dismissing the importance of pushing for new USPS trucks to be built in the state  to argue Johnson isn't on the side of working people.",
    "author": "",
    "title": "Ukraine gets the U.S. gets a little more united  for now"
  },
  {
    "id": 2358,
    "mediaId": 43,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "Click below to donate and get involved with these incumbents re-election campaigns and to these Democratic Senate candidates:\nMark Kelly (D. AZ)\nRaphael Warnock (D. GA)\nCatherine Cortez Masto (D. NV)\nMaggie Hassan (D. NH)\nPennsylvania\nJohn Fetterman\nConor Lamb\nMalcom Kenyatta\nWisconsin\nMandela Barnes for U.S. Senate\nSarah Godlewski for U.S. Senate\nTom Nelson for U.S. Senate\n<span class='selected-term'>Alex Lasry</span> for U.S. Senate\nOhio\nTim Ryan\nNorth Carolina\nCheri Beasley\nFlorida\nVal Demings\nMissouri\nLucas Kunce\nScott Sifton",
    "author": "",
    "title": "Chuck Schumer (D) Gets The Senate Ready To Grill Gas & Oil CEOs On Price Gouging"
  },
  {
    "id": 1133,
    "mediaId": 124,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Meanwhile, Democrat <span class='selected-term'>Alex Lasry</span> is up with a new digital ad, seen first by NBC (h/t Natasha Korecki), hitting Johnson on Russia (the campaign says it will have six figures behind it).",
    "author": "",
    "title": "Questions on race stand out on Day 2 of Supreme Court confirmation hearings"
  },
  {
    "id": 2349,
    "mediaId": 367,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "In many ways, Barnes, Milwaukee Bucks executive <span class='selected-term'>Alex Lasry</span>, Outagamie County Executive Tom Nelson and state Treasurer Sarah Godlewski are following the political path Baldwin blazed.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate contenders in Wisconsin focus on manufacturing"
  },
  {
    "id": 2347,
    "mediaId": 43,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "Or click below to donate and get involved with the Senate Democrat of your choice and these Wisconsin Democrats campaigns:\nWisconsin Democratic Party\nMinocqua Brewing Company SuperPAC\nTony Evers for Governor\nMandela Barnes for U.S. Senate\nSarah Godlewski for U.S. Senate\nTom Nelson for U.S. Senate\n<span class='selected-term'>Alex Lasry</span> for U.S. Senate\nJosh Kaul for Attorney General",
    "author": "",
    "title": "Rep. Adam Schiff (D. CA) Helps Wisconsin Democrats Take Down Putin's Favorite Senator"
  }
]