{"request":{"pageUrl":"http://hosted.ap.org/article/5cad905d00f8bc056fe64522c9b84b1d/abrams-backed-election-lawsuit-goes-trial-georgia","api":"article","fields":"quotes","version":3,"resolvedPageUrl":"https://hosted.ap.org/article/5cad905d00f8bc056fe64522c9b84b1d/abrams-backed-election-lawsuit-goes-trial-georgia"},"objects":[{"date":"Sat, 09 Apr 2022 13:33:00 GMT","sentiment":-0.535,"images":[{"naturalHeight":454,"width":678,"diffbotUri":"image|3|1383030569","title":"FILE - Georgia gubernatorial Democratic candidate Stacey Abrams talks to the media after qualifying for the 2022 election on Tuesday, March 8, 2022, in Atlanta. When she ended her first bid to become Georgia governor in 2018, Abrams announced plans to sue over the way the state’s elections were managed. More than three years later, as she makes another run at the governor’s mansion, the lawsuit filed in Nov. 2018 by Abrams' Fair Fight Action organization is finally going to trial on Monday, April 11. (AP Photo/Brynn Anderson, File)","url":"https://mapi.associatedpress.com/v1/items/6ba231fe039b486498bea153557ad104/preview/preview.jpg?s=680x","naturalWidth":680,"primary":true,"height":452}],"author":"KATE BRUMBACK","estimatedDate":"Sat, 09 Apr 2022 13:33:00 GMT","publisherRegion":"North America","icon":"https://hosted.ap.org/sites/hosted/files/AssociatedPress_logo.png","diffbotUri":"article|3|557407227","siteName":"Hosted","type":"article","title":"Abrams-Backed Election Lawsuit Goes To Trial In Georgia","tags":[{"score":0.9986886382102966,"sentiment":-0.698,"count":7,"label":"Stacey Abrams","uri":"https://diffbot.com/entity/E-CcLNnG4NuON849wzvPBEA","rdfTypes":["http://dbpedia.org/ontology/Person"]},{"score":0.9952646493911743,"sentiment":-0.851,"count":12,"label":"election","uri":"https://diffbot.com/entity/EeCs-TueGN-GkXY6DWkQA2A","rdfTypes":["http://dbpedia.org/ontology/Event"]},{"score":0.9877874255180359,"sentiment":-0.639,"count":11,"label":"Georgia","uri":"https://diffbot.com/entity/E_L-1Z6pbMUuEvXV5RpTMaQ","rdfTypes":["http://dbpedia.org/ontology/Place","http://dbpedia.org/ontology/PopulatedPlace","http://dbpedia.org/ontology/State"]},{"score":0.9820060729980469,"sentiment":-0.748,"count":4,"label":"Brian Kemp","uri":"https://diffbot.com/entity/EYu86qnLnMJSovrKFbbvdyQ","rdfTypes":["http://dbpedia.org/ontology/Person"]},{"score":0.9749225378036499,"sentiment":-0.642,"count":4,"label":"trial","uri":"https://diffbot.com/entity/E6f8FmjW5MIy9cTBCAWfMHw"},{"score":0.9502427577972412,"sentiment":0,"count":6,"label":"Democratic Party","uri":"https://diffbot.com/entity/EsAK1CigZMFeqk72s5EidGQ","rdfTypes":["http://dbpedia.org/ontology/Organisation","http://dbpedia.org/ontology/PoliticalParty"]},{"score":0.9414761662483215,"sentiment":0,"count":4,"label":"Republican Party","uri":"https://diffbot.com/entity/EQux7TYFDMgO6n_OByeSXzg","rdfTypes":["http://dbpedia.org/ontology/Organisation","http://dbpedia.org/ontology/PoliticalParty"]},{"score":0.9302927851676941,"sentiment":0,"count":2,"label":"Robert Abrams","uri":"https://diffbot.com/entity/ErbMtUglZPJ2NX4fS7gVdcA","rdfTypes":["http://dbpedia.org/ontology/Person"]},{"score":0.914738655090332,"sentiment":0,"count":4,"label":"Steve Jones","uri":"https://diffbot.com/entity/Ef-po3RkzMHSADwFD3q4HCg","rdfTypes":["http://dbpedia.org/ontology/Person"]},{"score":0.8879861235618591,"sentiment":0,"count":4,"label":"Atlanta","uri":"https://diffbot.com/entity/EP-thVRNKPCiwPfIyJ3_ozQ","rdfTypes":["http://dbpedia.org/ontology/Place","http://dbpedia.org/ontology/PopulatedPlace","http://dbpedia.org/ontology/Settlement","http://dbpedia.org/ontology/City"]}],"publisherCountry":"United States","humanLanguage":"en","authorUrl":"https://hosted.ap.org/article/5cad905d00f8bc056fe64522c9b84b1d/abrams-backed-election-lawsuit-goes-trial-georgia#","pageUrl":"http://hosted.ap.org/article/5cad905d00f8bc056fe64522c9b84b1d/abrams-backed-election-lawsuit-goes-trial-georgia","html":"<figure><img alt=\"FILE - Georgia gubernatorial Democratic candidate Stacey Abrams talks to the media after qualifying for the 2022 election on Tuesday, March 8, 2022, in Atlanta. When she ended her first bid to become Georgia governor in 2018, Abrams announced plans to sue over the way the state’s elections were managed. More than three years later, as she makes another run at the governor’s mansion, the lawsuit filed in Nov. 2018 by Abrams' Fair Fight Action organization is finally going to trial on Monday, April 11. (AP Photo/Brynn Anderson, File)\" src=\"https://mapi.associatedpress.com/v1/items/6ba231fe039b486498bea153557ad104/preview/preview.jpg?s=680x\"><\/img><figcaption>FILE - Georgia gubernatorial Democratic candidate Stacey Abrams talks to the media after qualifying for the 2022 election on Tuesday, March 8, 2022, in Atlanta. When she ended her first bid to become Georgia governor in 2018, Abrams announced plans to sue over the way the state&rsquo;s elections were managed. More than three years later, as she makes another run at the governor&rsquo;s mansion, the lawsuit filed in Nov. 2018 by Abrams' Fair Fight Action organization is finally going to trial on Monday, April 11. (AP Photo/Brynn Anderson, File)<\/figcaption><\/figure>\n<p>ATLANTA (AP) &mdash; When she <a href=\"https://apnews.com/article/north-america-lawsuits-us-news-ap-top-news-elections-7985be43fa4c4422bfece25cb0204307\">ended her first bid<\/a> to become Georgia governor in 2018, Stacey Abrams announced plans to sue over the way the state's elections were managed. More than three years later, as she <a href=\"https://apnews.com/article/2022-midterm-elections-georgia-atlanta-elections-david-perdue-477aaed9ac577b6b976cd1da9cfcf770\">makes another run<\/a> at the governor's mansion, <a href=\"https://apnews.com/article/lawsuits-political-organizations-elections-courts-stacey-abrams-1e7726035c7c4c89955fe003cbe615b3\">the lawsuit<\/a> is going to trial.<\/p>\n<p>Filed in November 2018 by Abrams' Fair Fight Action organization, the suit alleged that state officials &quot;grossly mismanaged&rdquo; the election, depriving some citizens, particularly low-income people and people of color, of their right to vote. The lawsuit originally called for a sweeping overhaul of the state's elections, but its scope was <a href=\"https://apnews.com/article/stacey-abrams-georgia-lawsuits-voting-rights-elections-1924a84dfa2e4337dcfbf13526abcc96\">considerably narrowed<\/a> after the state made changes that addressed some allegations and others were dismissed by the court. The trial is set to begin Monday.<\/p>\n<p>Even if U.S. District Judge Steve Jones sides with the plaintiffs, it&rsquo;s unclear whether that will affect elections this year. Jones and other federal judges <a href=\"https://apnews.com/article/voting-rights-2022-midterm-elections-voting-georgia-elections-624ec6cfb7017a367c8915d789310d50\">have been reluctant<\/a> to order last-minute changes, noting that the Supreme Court has repeatedly said federal judges shouldn&rsquo;t alter rules &ldquo;on the eve of an election.&quot;<\/p>\n<p>In the months preceding the 2018 election, Abrams, a Democrat, accused her Republican opponent in the governor&rsquo;s race, then-Secretary of State Brian Kemp, of <a href=\"https://apnews.com/article/race-and-ethnicity-elections-voting-voting-rights-atlanta-fb011f39af3b40518b572c8cce6e906c\">using his position<\/a> as Georgia's chief elections officer to promote voter suppression, an allegation Kemp has vehemently denied.<\/p>\n<p>In the more than three years since that fiercely fought contest captured national attention, the focus on Georgia's elections has only intensified. <a href=\"https://apnews.com/article/georgia-nv-state-wire-primary-elections-wv-state-wire-ap-top-news-e7ea6e919fadb995c407eea3a4450176\">Problems during the 2020 primary<\/a> drew sharp criticism. Later that year, former President Donald Trump <a href=\"https://apnews.com/article/donald-trump-georgia-elections-58e0fe86f601e092779c413fdad52a63\">hurled insults<\/a> at state officials who declined to overturn his narrow <a href=\"https://apnews.com/article/election-2020-joe-biden-donald-trump-stacey-abrams-hillary-clinton-b845b51c32e3bc9392953af0a22f1141\">general election loss<\/a> in the state. And the nation watched closely in January 2021 as a <a href=\"https://apnews.com/article/Georgia-election-results-4b82ba7ee3cc74d33e68daadaee2cbf3\">pair of Democrats<\/a> unseated the state&rsquo;s two incumbent Republican U.S. senators.<\/p>\n<p>Numerous GOP-led state legislatures <a href=\"https://apnews.com/article/trump-gop-voting-laws-2c3e53313f023af1d7df78f588ea415c\">passed election bills<\/a> last year after Trump stoked false claims that widespread fraud led to his 2020 defeat. <a href=\"https://apnews.com/article/donald-trump-legislature-bills-state-elections-voting-rights-b2b014cc81894a50fc513168a5f1d0b8\">Georgia's bill, which Kemp signed into law a year ago, was one of the broadest<\/a>. Among other things, <a href=\"https://apnews.com/article/what-does-new-georgia-gop-election-law-do-87665a200f6442e28ef43cbc60c88653\">the state's measure<\/a> reduced the window to request an absentee ballot, stripped power from the secretary of state and sharply curtailed the use of absentee ballot drop boxes in populous and Democratic-voting metro Atlanta counties. Voting rights groups and the <a href=\"https://apnews.com/article/ga-state-wire-georgia-voting-rights-laws-voting-c552e88d294e5f35e2eea595177bc4b5\">U.S. Department of Justice<\/a> promptly sued; those lawsuits are pending.<\/p>\n<p>Republicans in Georgia <a href=\"https://apnews.com/article/2022-midterm-elections-georgia-state-legislature-legislature-donald-trump-21c6ebb0a157acf33db18b0988f7f425\">this year passed<\/a> legislation to let the Georgia Bureau of Investigation initiate probes into alleged election wrongdoing.<\/p>\n<p>Meanwhile, Abrams, a state lawmaker who was little known outside Georgia when she ran four years ago, has become <a href=\"https://apnews.com/article/england-north-america-donald-trump-ap-top-news-las-vegas-d7f84fa8d1864f5bb328214710b5dbfd\">a household name <\/a> and Democratic Party star. The <a href=\"https://apnews.com/article/2022-midterm-elections-georgia-atlanta-elections-david-perdue-477aaed9ac577b6b976cd1da9cfcf770\">only Democrat<\/a> running for governor, she'll <a href=\"https://apnews.com/article/2022-midterm-elections-congress-stacey-abrams-david-perdue-georgia-f47b7046fb2a53ab7e42568a425c4dcd\">face Kemp<\/a> again in November if he fends off a primary challenge from former <a href=\"https://apnews.com/article/2022-midterm-elections-biden-georgia-elections-david-perdue-db709359cc2af654247e83edc106d9be\">U.S. Sen. David Perdue<\/a>.<\/p>\n<p>Secretary of State Brad Raffensperger accused Abrams and her allies of trying to undermine the integrity of Georgia elections.<\/p>\n<p>&ldquo;Her 3-year &lsquo;stolen election&rsquo; campaign has been nothing more than a political stunt to keep her in the national spotlight, and it&rsquo;s a disservice to Georgia voters,&rdquo; he said in an emailed statement.<\/p>\n<p>Fair Fight says it works to promote voting rights and support progressive candidates around the country, and its PAC has raised more than $100 million since its founding. It filed the lawsuit along with Care in Action, a nonprofit that advocates for domestic workers. Several churches have also joined as plaintiffs.<\/p>\n<p>Fair Fight collected <a href=\"https://apnews.com/article/f73a65f5f7cc489c9519b5829133525a\">statements from people<\/a> who said they had problems voting. The lawsuit cited multiple alleged problems, including the purging of eligible voters from voter rolls under a &ldquo;use it or lose it&rdquo; policy; the state&rsquo;s so-called exact match voter registration rules; an insufficient number of voting machines at some precincts; and a lack of sufficient training for election officials. It asked a federal judge to find that Georgia&rsquo;s elections processes violated the U.S. Constitution and federal law.<\/p>\n<p>&ldquo;Since the start of this lawsuit, we have highlighted real voters and their challenges because we believe that is one of the most effective ways to demonstrate the barriers in Georgia&rsquo;s elections system,&quot; Fair Fight executive director Cianti Stewart-Reid said in an emailed statement. She added that voters from around the state will testify at trial about obstacles faced while trying to vote.<\/p>\n<p>Some of the alleged problems were addressed by changes in state law. For example, a 2019 law called for replacing the state's outdated voting machines. The new system was implemented statewide in 2020.<\/p>\n<p>In February 2021, Jones threw out parts of the lawsuit, saying some allegations were made irrelevant by changes in state law or the plaintiffs&rsquo; lack of standing. Among them were some of the claims about voting machines and election technology, as well as the security of voter lists and polling place issues. The following month, Jones dismissed claims targeting the &ldquo;use it or lose it&rdquo; policy and some allegations of inadequate training of poll workers. He also dismissed some claims relating to provisional and absentee ballots.<\/p>\n<p>The issues remaining for the trial have to do with the &ldquo;exact match&rdquo; policy, the statewide voter registration list and in-person cancellation of absentee ballots. The plaintiffs claim that Georgia's secretary of state and State Election Board members are &ldquo;denying and abridging Georgians' right to vote&quot; in violation of the Voting Rights Act of 1965 and the U.S. Constitution.<\/p>\n<p>Under the &ldquo;exact match&rdquo; policy, information from voter registration applications is checked against information held by the state Department of Driver Services or the federal Social Security Administration. If there's a discrepancy, the would-be voter must show identification to county officials before being able to cast a regular ballot.<\/p>\n<p>The plaintiffs say data entry errors or differences as minor as a missing hyphen or apostrophe can trigger a non-match and that naturalized citizens can also be wrongly flagged as noncitizens if records are outdated. These problems disproportionately affect people of color and can depend on where a person lives because counties do things differently, the plaintiffs say.<\/p>\n<p>The statewide voter registration database is &ldquo;error-ridden,&rdquo; the plaintiffs say, resulting in the erroneous deletion of eligible voters' registration or critical information being incorrect. That can prevent eligible voters from being able to vote or force them to overcome undue burdens to do so, the plaintiffs say.<\/p>\n<p>The plaintiffs also say election officials aren't sufficiently trained on canceling an absentee ballot if someone chooses to vote in person instead, which can cause voters to be turned away or forced to cast a provisional ballot.<\/p>\n<p>Lawyers for the state argue the claims in the lawsuit &ldquo;are not supported by the evidence.&rdquo; The number, geographic scope and severity of the alleged problems experienced by voters identified by the plaintiffs &ldquo;do not rise to a level sufficient to demonstrate an unconstitutional burden on voting in Georgia,&rdquo; state lawyers wrote in a filing. Additionally, they argue, the alleged problems cited are not the responsibility of the state officials named in the lawsuit.<\/p>","categories":[{"score":0.897,"name":"Law","id":"iabv2-383"},{"score":0.999,"name":"News and Politics","id":"iabv2-379"}],"text":"ATLANTA (AP) — When she ended her first bid to become Georgia governor in 2018, Stacey Abrams announced plans to sue over the way the state's elections were managed. More than three years later, as she makes another run at the governor's mansion, the lawsuit is going to trial.\nFiled in November 2018 by Abrams' Fair Fight Action organization, the suit alleged that state officials \"grossly mismanaged” the election, depriving some citizens, particularly low-income people and people of color, of their right to vote. The lawsuit originally called for a sweeping overhaul of the state's elections, but its scope was considerably narrowed after the state made changes that addressed some allegations and others were dismissed by the court. The trial is set to begin Monday.\nEven if U.S. District Judge Steve Jones sides with the plaintiffs, it’s unclear whether that will affect elections this year. Jones and other federal judges have been reluctant to order last-minute changes, noting that the Supreme Court has repeatedly said federal judges shouldn’t alter rules “on the eve of an election.\"\nIn the months preceding the 2018 election, Abrams, a Democrat, accused her Republican opponent in the governor’s race, then-Secretary of State Brian Kemp, of using his position as Georgia's chief elections officer to promote voter suppression, an allegation Kemp has vehemently denied.\nIn the more than three years since that fiercely fought contest captured national attention, the focus on Georgia's elections has only intensified. Problems during the 2020 primary drew sharp criticism. Later that year, former President Donald Trump hurled insults at state officials who declined to overturn his narrow general election loss in the state. And the nation watched closely in January 2021 as a pair of Democrats unseated the state’s two incumbent Republican U.S. senators.\nNumerous GOP-led state legislatures passed election bills last year after Trump stoked false claims that widespread fraud led to his 2020 defeat. Georgia's bill, which Kemp signed into law a year ago, was one of the broadest. Among other things, the state's measure reduced the window to request an absentee ballot, stripped power from the secretary of state and sharply curtailed the use of absentee ballot drop boxes in populous and Democratic-voting metro Atlanta counties. Voting rights groups and the U.S. Department of Justice promptly sued; those lawsuits are pending.\nRepublicans in Georgia this year passed legislation to let the Georgia Bureau of Investigation initiate probes into alleged election wrongdoing.\nMeanwhile, Abrams, a state lawmaker who was little known outside Georgia when she ran four years ago, has become a household name and Democratic Party star. The only Democrat running for governor, she'll face Kemp again in November if he fends off a primary challenge from former U.S. Sen. David Perdue.\nSecretary of State Brad Raffensperger accused Abrams and her allies of trying to undermine the integrity of Georgia elections.\n“Her 3-year ‘stolen election’ campaign has been nothing more than a political stunt to keep her in the national spotlight, and it’s a disservice to Georgia voters,” he said in an emailed statement.\nFair Fight says it works to promote voting rights and support progressive candidates around the country, and its PAC has raised more than $100 million since its founding. It filed the lawsuit along with Care in Action, a nonprofit that advocates for domestic workers. Several churches have also joined as plaintiffs.\nFair Fight collected statements from people who said they had problems voting. The lawsuit cited multiple alleged problems, including the purging of eligible voters from voter rolls under a “use it or lose it” policy; the state’s so-called exact match voter registration rules; an insufficient number of voting machines at some precincts; and a lack of sufficient training for election officials. It asked a federal judge to find that Georgia’s elections processes violated the U.S. Constitution and federal law.\n“Since the start of this lawsuit, we have highlighted real voters and their challenges because we believe that is one of the most effective ways to demonstrate the barriers in Georgia’s elections system,\" Fair Fight executive director Cianti Stewart-Reid said in an emailed statement. She added that voters from around the state will testify at trial about obstacles faced while trying to vote.\nSome of the alleged problems were addressed by changes in state law. For example, a 2019 law called for replacing the state's outdated voting machines. The new system was implemented statewide in 2020.\nIn February 2021, Jones threw out parts of the lawsuit, saying some allegations were made irrelevant by changes in state law or the plaintiffs’ lack of standing. Among them were some of the claims about voting machines and election technology, as well as the security of voter lists and polling place issues. The following month, Jones dismissed claims targeting the “use it or lose it” policy and some allegations of inadequate training of poll workers. He also dismissed some claims relating to provisional and absentee ballots.\nThe issues remaining for the trial have to do with the “exact match” policy, the statewide voter registration list and in-person cancellation of absentee ballots. The plaintiffs claim that Georgia's secretary of state and State Election Board members are “denying and abridging Georgians' right to vote\" in violation of the Voting Rights Act of 1965 and the U.S. Constitution.\nUnder the “exact match” policy, information from voter registration applications is checked against information held by the state Department of Driver Services or the federal Social Security Administration. If there's a discrepancy, the would-be voter must show identification to county officials before being able to cast a regular ballot.\nThe plaintiffs say data entry errors or differences as minor as a missing hyphen or apostrophe can trigger a non-match and that naturalized citizens can also be wrongly flagged as noncitizens if records are outdated. These problems disproportionately affect people of color and can depend on where a person lives because counties do things differently, the plaintiffs say.\nThe statewide voter registration database is “error-ridden,” the plaintiffs say, resulting in the erroneous deletion of eligible voters' registration or critical information being incorrect. That can prevent eligible voters from being able to vote or force them to overcome undue burdens to do so, the plaintiffs say.\nThe plaintiffs also say election officials aren't sufficiently trained on canceling an absentee ballot if someone chooses to vote in person instead, which can cause voters to be turned away or forced to cast a provisional ballot.\nLawyers for the state argue the claims in the lawsuit “are not supported by the evidence.” The number, geographic scope and severity of the alleged problems experienced by voters identified by the plaintiffs “do not rise to a level sufficient to demonstrate an unconstitutional burden on voting in Georgia,” state lawyers wrote in a filing. Additionally, they argue, the alleged problems cited are not the responsibility of the state officials named in the lawsuit.","resolvedPageUrl":"https://hosted.ap.org/article/5cad905d00f8bc056fe64522c9b84b1d/abrams-backed-election-lawsuit-goes-trial-georgia","authors":[{"name":"By KATE BRUMBACK","link":"hosted.ap.org/article/5cad905d00f8bc056fe64522c9b84b1d/abrams-backed-election-lawsuit-goes-trial-georgia"}]}]}