{
  "id": 1225,
  "mediaId": 2746,
  "date": "2022-04-08",
  "headline": "Liberals push legal effort to block Republican ‘insurrectionists’ from the ballot",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/11/17/Congress_Gosar_83743.jpg-8e3b3_c0-242-5251-3305_s1200x700.jpg?1440fcc6787d7c6387ecab65ccffe1a6edabb60a",
  "link": "https://www.washingtontimes.com/news/2022/apr/8/liberals-push-legal-effort-block-republican-insurr/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    0
  ],
  "sentences": [
    "The third section of the amendment says that “no person shall be a Senator or Representative in Congress, or elector of President and Vice-President, or hold any office, civil or military, under the United States” who has “engaged in insurrection or rebellion.”\nThe lawsuits follow similar suits the same group filed targeting Republican Reps. Marjorie Taylor Greene of Georgia and Madison Cawthorn of North Carolina.",
    "Mrs. Greene is seeking to dismiss the case against her, while U.S. District Judge Richard E. Myers II, a Trump appointee, last month blocked the effort to disqualify Mr. Cawthorn from the ballot in North Carolina, ruling that the Amnesty Act of 1872 granted amnesty to future insurrectionists.",
    "“The facts are very strong in these cases that Gosar, Biggs and Finchem were heavily involved in not only the effort to introduce fake slates of electors but also involved in the violent extremist groups that gathered at the Capitol.”",
    "A liberal advocacy group is broadening its legal effort to disqualify Republican lawmakers from running for reelection because of their support of the events surrounding the Jan. 6 attack on the U.S. Capitol.",
    "Free Speech For People filed lawsuits on behalf of voters in Arizona’s Maricopa County that challenge the eligibility for the office of GOP Reps. Paul Gosar and Andy Biggs, and state Rep. Mark Finchem.",
    "The suits say the lawmakers should be barred from seeking office because of their support for the pro-Trump mob that stormed the U.S. Capitol on Jan. 6, citing the 14th Amendment.",
    "Rob Fein, legal director for Free Speech For People, told the Arizona Mirror that there are holes in that argument.",
    "“That ruling hasn’t been defended by anyone,” Mr. Fein said of the ruling in Mr. Cawthorn’s case.",
    "Mr. Finchem is running for secretary of state with former President Donald Trump’s endorsement.",
    "Mr. Gosar and Mr. Biggs are running for reelection in November."
  ]
}