{
  "id": 1707,
  "mediaId": 5308,
  "date": "2022-04-05",
  "headline": "Ex-WWE Ref Drake Wuertz Running for Florida GOP Turns Babyface Against QAnon",
  "image": "https://video-images.vice.com/articles/624c600e3e39af0096d87c34/lede/1649174176936-untitled-design.png?image-resize-opts=Y3JvcD0xeHc6MXhoO2NlbnRlcixjZW50ZXImcmVzaXplPTEyMDA6KiZyZXNpemU9MTIwMDoq",
  "link": "https://www.vice.com/en/article/m7vn74/florida-drake-wuertz-wwe-candidate",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Trone Dowd",
  "authorUrl": "https://www.vice.com/en/contributor/trone-dowd",
  "termIds": [
    0
  ],
  "sentences": [
    "“Those kinds of theories, they only hurt the mission of ending human trafficking.”\nIn a campaign ad on his website, a line of people wearing American flags, pro-Trump, anti-abortion, and pro-gun-rights merchandise flank Wuertz, who talks about public schools depriving kids of oxygen with mask mandates, medical tyranny, and children being “indoctrinated” into believing America is a racist country.",
    "He even reportedly went so far as to storm out of a 2020 WWE meeting about inclusiveness in the company, as the then-ongoing protests against police brutality continued throughout the U.S..\nOn his old Parler account, Wuertz also upvoted multiple posts that contained QAnon content and conspiracies, including a photo of a woman holding a “WWG1WGA flag,” accompanied by #QAnon hashtag.",
    "Wuertz even helped organize fundraising and awareness efforts for Operation Underground Railroad, an anti-trafficking organization whose CEO has legitimized certain QAnon conspiracies—like the lie that online furniture retailer Wayfair was a front to buy and sell children—while failing to overtly disavow QAnon the way other groups in the space have.",
    "It is a much more combative party, and now outsiders have success challenging the old guard.”\nWuertz has also picked up a few endorsements from conservatives groups and politicians in Florida, including Flagler County Commissioner Joe Mullins and Winter Springs City Commissioner Rob Elliott.",
    "“Any company that is discriminating against employees who refuse to participate in an experimental medical procedure by forcing them to show proof of vaccination in order to come to work in a normal capacity is violating basic human rights,” he said in an Instagram post at the time.",
    "“I will fight to increase the penalty for those who exploit children to life in prison.”\nWuertz told VICE News he’s now working with the local government, Seminole County Human Trafficking Task Force run by the local sheriff’s office, to address human trafficking in his state.",
    "A former indie wrestler and referee for WWE’s once-booming developmental territory NXT, Wuertz jumped into the race for Florida House District 38 last month after switching from District 30 during Florida’s controversial and messy redistricting.",
    "Wuertz is presenting himself as a pro-Second Amendment, pro-“medical freedom” (a term coined by the anti-mask and anti-vaccine mandate movements), anti-abortion alternative to Smith, who he says has lost sight of what voting conservatives want.",
    "Screenshots of Wuertz’s activity on social media site Parler (preserved by wrestling reporter David Bixenspan in his newsletter Babyface v. Heel) show that Wuertz liked and shared several posts shared by Proud Boy-affiliated accounts in 2020.",
    "According to a collection of emails obtained by Motherboard in 2020, Wuertz used his WWE corporate email to help with the efforts and even offered to lobby other performers to join a movie night benefitting Operation Underground Railroad.",
    "During the Trump presidency, the QAnon movement gained significant steam, and several candidates who outright believe in the conspiracy, like Mark Finchem in Arizona and Kristina Karamo in Michigan, are running for office in 2022.",
    "DeSantis and the state Legislature have not been able to come to an agreement on how the map will look, and the governor has called for a special four-day legislative session that will focus on finalizing redistricting.",
    "Wuertz, however, told VICE News plainly that he doesn’t support QAnon and does not maintain any relationship with Operation Underground Railroad, although stopping human trafficking remains a key tenet of his campaign.",
    "Going up against an established Republican like Smith will be a difficult undertaking for Wuertz, but not impossible, according to Aubrey Jewett, a political science professor at the University of Central Florida.",
    "“It causes people to be what I call couch patriots, where they just sit on the couch, sit on Facebook, and they don't get up and take action, take responsibility, and accountability,” Wuertz said of QAnon.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "“I lost my six-figure job for taking a stand on multiple fronts, and I don’t regret it one bit.”\n“They have ridiculous things, like saying, ‘Just wait, the storm is coming.’ The storm is never coming.",
    "I have met Enrique Tarrio, who founded the group, at several conservative events before, but I am not in close contact with him.” (Tarrio did not found the group; he serves as its embattled leader.)",
    "While Smith has already raised more than $210,000 for his re-election bid, Wuertz's more than $17,000 in donations is an impressive start for a relatively unknown name in Central Florida politics.",
    "Although Wuertz’ campaign is getting a lot of attention in Florida and within the wrestling fanbase, wrestlers transitioning into politics, especially as conservatives, is nothing new.",
    "A former WWE wrestler and referee, who once flirted with QAnon and Proud Boy conspiracies, is now running for the Florida Legislature on a grab bag of hardcore conservative ideals.",
    "Jewett said Republicans in the district failed to hold onto voters who align more with the old GOP and have been reluctant to embrace the most conservative ideologies of Trumpism.",
    "Jesse Ventura, a popular WWE wrestler and actor, had one term as governor of Minnesota in the late 90s as a member of the Reform Party before switching to the Independence Party.",
    "The online cult believes that a cabal of affluent celebrities and politicians, largely Democrats, secretly run a massive, child-sex-trafficking operation and also worship Satan.",
    "Similar to the Proud Boys’ anti-Black Lives Matter stance, Wuertz was also a proponent of the “All Lives Matter” movement, according to Dave Meltzer of the Wrestling Observer.",
    "“I am not a political person,” indie wrestler Biff Busick, also known as Oney Lorcan during his six-year stint in WWE, told fans questioning his donation to Wuertz on Twitter.",
    "There needs to be more men willing to take the church outside of the four walls and get engaged in the public square like the founders of our nation framed,” Wuertz said.",
    "“He's trying to get as much work as possible, so he caved under the cancel culture.”\nBusick did not immediately return VICE News’ request for comment on the matter.",
    "The candidate, Drake Wuertz, however, blamed the “fake news and Marxist left” for canceling him in a recent campaign ad and has now disavowed QAnon.",
    "Busick donated through Wuertz’ campaign website, which clearly signposted that the contribution would have been for a political campaign.",
    "“The post on Parler I ‘liked’ and followed was a repost of the Proud Boys account detailing a human trafficking bust,” Wuertz said.",
    "Ending human trafficking is also a key focus of Wuertz’s campaign, which led to his interactions with QAnon in the first place.",
    "With the primary set for Aug. 23, Wuertz still has several months to fundraise as the state figures out its redistricting woes.",
    "And even Dwayne “The Rock” Johnson has flirted with the idea of running in interviews—if the people want him to, of course.",
    "Glenn Jacobs, the current mayor of Knox County, Tennessee, had a career spanning more than two decades as WWE legend Kane.",
    "Florida ranks third in the country for most human trafficking cases reported to the National Human Trafficking Hotline.",
    "Redistricting in Florida, like in many other states, places a bit of uncertainty on the primary in November, as well.",
    "While the multibillion-dollar company never confirmed, Wuertz said he was let go because of his anti-vaccine beliefs.",
    "Wuertz was a veteran indie wrestler and multi-time champion known for his hard-hitting, hardcore in-ring style.",
    "Sorry.”\nBut as Bixenspan noted in another one of his newsletters, it’s almost impossible for that to be true.",
    "You guys are stupid.”\nWuertz’s time in the WWE, however, was marred by other controversies over the years.",
    "“They have ridiculous things, like saying, ‘Just wait, the storm is coming.’ The storm is never coming.",
    "After a seven-year-long stint as a referee with WWE, he was released from his contract in June 2021.",
    "(Disclosure: Gavin McInnes, who founded the Proud Boys in 2016, was a co-founder of VICE in 1994.",
    "And a few WWE, All-Elite Wrestling, and indie wrestling performers have already donated to him.",
    "“I stand ready to end human trafficking in Florida,” Wuertz says in his two-minute campaign ad.",
    "Wuertz also says he jumped into the world of politics in hopes of fighting human trafficking.",
    "I know how people with those beliefs can hurt people and I don't want to do that to anyone.",
    "One of them, however, publicly claimed he didn’t knowingly donate to Wuertz’s campaign.",
    "“As a man of God and a Christian, we need to have more God-honoring legislation put up.",
    "I thought I was just lending money and I did not knowingly donate to Drake's campaign.",
    "“The Republican Party has changed not only under President Trump, but under Gov.",
    "He will now face Republican Rep. David Smith in the state’s primary in August.",
    "At least one wrestler called him out for having an interest in the Proud Boys.",
    "He has since deleted his account, he says, to cut down on social media usage.",
    "(“Where we go one, we go all,” or WWG1WGA, is the movement’s slogan.)",
    "He left the company in 2008 and has had no involvement since then.)",
    "His focus is now on helping victims transition back into normalcy.",
    "“These primaries are typically low-turnout affairs,” Jewett said.",
    "President Biden also won Seminole County by three points in 2020.",
    "Want the best of VICE News straight to your inbox?",
    "You guys are stupid,” Wuertz, 37, told VICE News.",
    "“I am not affiliated with the Proud Boys.",
    "“I do not support QAnon or their beliefs.",
    "“Look, Biff just left WWE,” Wuertz said.",
    "[Ron] DeSantis.",
    "Sign up here."
  ]
}