{
  "id": 178,
  "mediaId": 2781,
  "date": "2022-04-20",
  "headline": "Federal Judge Allows Georgia Voters to Challenge Rep. Marjorie Taylor Greene’s Candidacy for Re-Election Under Fourteenth Amendment’s Insurrectionist Disqualification Clause",
  "image": "https://joemiller.us/wp-content/uploads/Marjorie-Greene.jpeg",
  "link": "https://joemiller.us/2022/04/federal-judge-allows-georgia-voters-to-challenge-rep-marjorie-taylor-greenes-candidacy-for-re-election-under-fourteenth-amendments-insurrectionist-disqualification-clause/?utm_source=rss&utm_medium=rss&utm_campaign=federal-judge-allows-georgia-voters-to-challenge-rep-marjorie-taylor-greenes-candidacy-for-re-election-under-fourteenth-amendments-insurrectionist-disqualification-clause",
  "mediaOutlet": "joemiller.us",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Free Speech for People",
  "authorUrl": "https://joemiller.us/author/joemiller/",
  "termIds": [
    0
  ],
  "sentences": [
    "The ruling is in marked contrast to a March 4 ruling by a federal judge in North Carolina, who ruled that an 1872 law which gave amnesty to ex-Confederates provided amnesty as well to all future insurrectionists, effectively nullifying Section Three of the Fourteenth Amendment and blocking a similar challenge brought by North Carolina voters to Representative Madison Cawthorn’s candidacy for re-election.",
    "As a result of Judge Totenberg’s ruling, the Georgia voters will have their challenge against Rep. Greene heard before a state administrative law judge in Atlanta, with a hearing currently scheduled for Friday, April 22, at 9:30 am, at the Office of State Administrative Hearings, 225 Peachtree Street NE, Suite 400, South Tower, in Atlanta.",
    "Free Speech For People also serves as co-lead counsel in the challenge to Rep. Cawthorn’s eligibility to appear on the 2022 ballot, and in similar challenges filed last week in Arizona against Rep. Andy Biggs, Rep. Paul Gosar, and State Rep. Mark Finchem, who is running for Secretary of State.",
    "A federal judge in Atlanta today denied Representative Marjorie Taylor Greene’s attempt to block a challenge, brought by Georgia voters, to her candidacy under Section Three of the Fourteenth Amendment to the U.S. Constitution, otherwise known as the Insurrectionist Disqualifications Clause.",
    "(Read more from “Federal Judge Allows Georgia Voters to Challenge Rep. Marjorie Taylor Greene’s Candidacy for Re-Election Under Fourteenth Amendment’s Insurrectionist Disqualification Clause” HERE)\nDelete Facebook, Delete Twitter, Follow Restoring Liberty and Joe Miller at gab HERE.",
    "The voters are represented by Free Speech For People, a nonpartisan, non-profit legal advocacy organization with leading constitutional law experts, which is serving as co-lead counsel in the matter, along with New York-based Emery Celli Brinckerhoff Abady Ward & Maazel LLP.",
    "US District Judge Amy Totenberg ruled against Rep. Greene’s motion for a preliminary injunction to stop the challenge from proceeding this week before a state administrative law judge.",
    "Last Thursday, the US Court of Appeals granted the North Carolina voters an expedited schedule for hearing their appeal of that ruling, with oral argument scheduled for May 3, 2022.",
    "The Georgia voters, through their counsel, have issued a subpoena for Rep. Greene to appear at that hearing and testify under oath.",
    "Bryan Sells, an Atlanta-based civil rights lawyer specializing in voting rights and election law, is serving as local counsel."
  ]
}