{
  "id": 2695,
  "mediaId": 2560,
  "date": "2022-03-26",
  "headline": "Trump-backed candidates see 'movement' in Michigan despite small rally crowd",
  "image": "https://www.gannett-cdn.com/presto/2022/03/26/PDTN/0df6b1b5-e6e7-40e9-8d0a-77f373a4e29f-032622-tm-MAGA_Rally-078.jpg?crop=5627,3165,x1,y207&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.detroitnews.com/story/news/politics/2022/03/26/pro-trump-rally-lansing-michigan-finchem-deperno-lindsey/7139997001/",
  "mediaOutlet": "Detroit News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Craig Mauger",
  "authorUrl": "https://www.detroitnews.com/staff/2683993001/craig-mauger/",
  "termIds": [
    1771,
    2201,
    3975,
    4830,
    4943,
    5085,
    5115,
    5145
  ],
  "sentences": [
    "Lansing — Mark Finchem, whom former President Donald Trump endorsed to be Arizona's next secretary of state, told a crowd in Michigan Saturday to \"fire\" lawmakers who were unwilling to consider claims of wrongdoing in the 2020 election.",
    "In addition to Finchem, Matt DePerno of Kalamazoo, whom Trump endorsed to be Michigan's next attorney general, and Jonathan Lindsey of Coldwater, whom Trump endorsed for a seat in the state Senate, were among the speakers Saturday.",
    "\"We don't have a chance at secure elections going forward, especially for president, if these critical states don't have legislators who are willing to stand up for election integrity,\" Lindsey told the crowd.",
    "After the last election, Finchem, a Republican state lawmaker in Arizona, said he got a group of Arizona legislators together to listen to what he described as evidence of election fraud.",
    "Jon Smith, secretary of the Hillsdale County Republican Party, said the purpose of the event was to help grassroots candidates at a key point before the August primary election.",
    "But speakers maintained that there's a pro-Trump movement unfolding in Michigan and stressed the need for their supporters to get involved in the 2022 midterm election.",
    "Finchem served 21 years with the Kalamazoo Department of Public Safety, as a firefighter/paramedic and as a law enforcement officer, according to his campaign site.",
    "Finchem, a Michigan native, was among a group of candidates backed by Trump who participated in a \"Make America Great Again\" rally in Lansing Saturday afternoon.",
    "Smith noted how cold it was for the outdoor rally and predicted there would be more people at a mixer that was scheduled to take place indoors later Saturday.",
    "Democrat Joe Biden won both Michigan and Arizona over Trump in 2020 despite lingering and unproven claims of widespread election fraud.",
    "DePerno, who's in a race with two others for the GOP nomination for attorney general, also identified a \"grassroots movement.\"",
    "Put aside your petty differences and get behind this campaign so we can win and beat Whitmer, Nessel and Benson.\"",
    "Gretchen Whitmer, Attorney General Dana Nessel and Secretary of State Jocelyn Benson are all Democrats.",
    "You need to support a candidate,\" said Finchem, whose campaign website says he was born in Detroit.",
    "\"Now I hear ... that there are some legislators in this state that don't want to be your champion.",
    "\"If you want to put an end to what you're witnessing right now, you need to get schooled up.",
    "When he retired, he moved to Arizona, where he was elected to the state Legislature.",
    "\"We did it because we were being the champions of our constituents,\" Finchem said.",
    "With temperatures in the low 30s, the crowd for the event was about 125 people.",
    "\"You've got to support the conservative candidates,\" Finchem added later.",
    "Trump himself will hold a rally in Macomb County a week later on April 2.",
    "He was the first Michigan candidate Trump endorsed for the 2022 election.",
    "Currently, Michigan's House and Senate are controlled by Republicans.",
    "Lindsey is running for a southern Michigan seat in the state Senate.",
    "As a lawmaker, he's called for decertifying Arizona's 2020 election.",
    "Lindsey said there's a \"movement\" happening in Michigan currently.",
    "But DePerno used his speech to call for unity within the party.",
    "In Michigan, Biden won by 3 percentage points or 154,000 votes.",
    "\"The time for the establishment status quo has come and gone.\"",
    "Trump endorsed DePerno on Sept. 16.\ncmauger@detroitnews.com",
    "\"When you're in a campaign, it goes fast,\" Smith said.",
    "\"We agree with each other on 95% of the issues.",
    "\"Put aside your differences,\" DePerno said.",
    "Here's what I recommend you do: Fire them.\"",
    "But Gov."
  ]
}