{
  "id": 2796,
  "mediaId": 2664,
  "date": "2022-03-12",
  "headline": "Mike Flynn describes battle against school boards like a military action: 'We're gonna counter-attack'",
  "image": "https://www.rawstory.com/media-library/mike-flynn.jpg?id=29530256&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/mike-flynn-school-boards/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    4226,
    4293,
    5301
  ],
  "sentences": [
    "Self-described \"Biblical Prophecy Expert\" Pastor Phil Hotsenpiller organized the event, which includes a focus on the \"truth about 2020 voter fraudhttps://timetofreeamerica.com/what-is-the-purpose/,\" the \"truth about Black Lives Matter (George Soros),\" the \"truth about the deep state,\" and \"are we living through the fulfillment of the Mark of the Beast prophecy?\"",
    "Michael Flynn to QAnon conference today: \\u201cWe need you to charge the machine gun nest .. or hold this side of the line, or form up cause we\\u2019re gonna counter-attack over here, and that counter-attack is - we\\u2019re gonna go after school boards.\\u201dpic.twitter.com/PCUZsDw3ni\n— Ron Filipkowski (@Ron Filipkowski) 1647142403",
    "Former Trump National Security Advisor Michael Flynn described his efforts to go after school boards like a military operation in a speech at the \"Time to Free America\" gathering of conspiracy theorists in San Marcos, California.",
    "\"Maybe I'm just asking you to dig a little bit deeper there or hold this side of the line, or form up cause we’re gonna counter-attack over here, and that counter-attack is, we’re gonna go after school boards,\" Flynn said.",
    "Other speakers scheduled to address the conference include Eric Trump, Roger Stone, Arizona Republican state Rep. Mark Finchem, Pastor Greg Locke, and Pastor Mark Burns.",
    "\"We need you to charge the machine gun nest,\" the retired 3-star Army general told the conspiracy theorists."
  ]
}