{
  "id": 2816,
  "mediaId": 2658,
  "date": "2022-03-10",
  "headline": "The Arizona Republican Caught in a Vise by Trump’s Big Lie",
  "image": "https://static.politico.com/76/24/d48094c144a199ba959e6574c7b3/gettyimages-1364877529.jpg",
  "link": "https://www.politico.com/news/magazine/2022/03/10/arizona-republican-mark-brnovich-senate-no-trump-00015346",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1450,
    2201,
    2725,
    3975,
    878,
    1029,
    4830,
    5128,
    5245
  ],
  "sentences": [
    "As Tim Steller, a columnist at the Arizona Daily Star put it, Brnovich has used the Office of the Arizona Attorney General to “establish himself as a super-Trump Republican.”\nSteller recently became the second columnist at a statewide newspaper to call for Brnovich’s resignation after Brnovich issued a legal opinion that Ducey can use “war powers” to send Arizona National Guard troops to the border to directly fight the “invasion” of cartels.",
    "But any Republican primary opponent can just say what they would do and bring a more satisfactory answer to the mob.”\nTrumpian Republicans have a specific complaint about Brnovich right now: He has done nothing with a batch of “findings” prepared by the Cyber Ninjas, the now-defunct company that the Republican-controlled state Senate hired to audit the 2020 presidential election in Maricopa County.",
    "Still, he notes that Brnovich checks the conservative box on every other issue that matters to Republicans and surrounded himself on the campaign trail with “highly qualified, conservative, what I would call MAGA Republicans.”\nIndeed, even as Brnovich faces criticism from the right for not doing enough on “election integrity,” many on the left and in the press see him as a disciple of Trumpism.",
    "The Arizona Republic’s Laurie Roberts was the first columnist to call for his resignation after Brnovich’s meeting with Trump on the tarmac before his January rally here, noting that instead of investigating the slate of fake, Trump-supporting electors that Arizona sent to Congress in January, he’s posing for pictures with Trump and using it as a fundraising plea.",
    "“Election integrity is what’s preventing Brnovich from polling at 40 to 50 percent in the primary.”\nThe 2020 election is still the top issue for many MAGA Republicans, he adds, likening Brnovich’s early comments on the lack of election fraud to endorsing critical race theory in schools or open borders — it’s practically unheard of in the GOP.",
    "The crowded Republican field also includes Jim Lamon, a wealthy businessperson who is largely self-funding his campaign; Mick McGuire, a retired U.S. Air Force General who served as the head of the Arizona National Guard; Justin Olson, a state utility regulator and former state legislator; and Masters, the Thiel disciple.",
    "For the last four months, a steady group of protesters have set up shop a few days a week, holding signs with slogans relitigating the 2020 election: “Indictments Now Fix Nov. 3,” and “Arrest Criminal Board of Supervisors,” a reference to the Arizona officials who ratified Joe Biden’s victory 16 months ago.",
    "And as you know we have an ongoing investigation into the Senate audit report that was sent to us.”\nHis tenure as attorney general has been marked mostly by fights against the political establishment — the governor, the secretary of state, the board of regents and especially, the Arizona State University.",
    "“I think it’s a very easy job to do, because anybody with any common sense is going to look, they’re going to take a look, and they’re going to say this was a total fraud.”\nBrnovich hasn’t answered questions about what they discussed on the tarmac — or if Trump tried to pressure him on the audit.",
    "With Trump unwilling to let go of the lie he won the election, and the GOP base passionately defending his claims, Republicans who actually hold office — and who have to operate within the rules and norms of government — face a disadvantage with many of their own voters.",
    "When Republican state lawmakers drafted legislation to overturn Biden’s 2020 win and allow themselves to declare the winner of future presidential contests, Rusty Bowers, the Republican Speaker of the House and a Trump supporter, put the kibosh on the bills.",
    "Right now, Brnovich, a lifelong Republican and diehard conservative, is the frontrunner for the Republican nomination for the U.S. Senate — with a reasonable chance to flip the seat back from incumbent Mark Kelly, the Democrat who won only narrowly in 2020.",
    "Trump had previously taken direct aim at Brnovich, writing in one statement, “He is always on television promoting himself, but never mentions the Crime of the Century.”\nBut lately, Trump has been gentler in his demand that Brnovich pursue prosecutions.",
    "“I don’t want to be bullied out of service,” he told the Arizona Republic, adding that he’s going to bring some “sanity” to the state Senate, which conducted the audit of Maricopa County’s presidential election results without the House’s backing.",
    "Zachery Henry, a former spokesperson for the Arizona Republican Party, says while Trump may be offering something of an olive branch, his supporters haven’t forgotten that Brnovich led the charge to declare that Trump had lost fair and square.",
    "The hollers and car horns beeping their support can’t help but leak through the windows of the seven-story government building — a regular reminder of the political irritant that won’t fade away for Brnovich, the attorney general of Arizona.",
    "He said the effort to decertify the 2020 election was “obviously unconstitutional and profoundly unwise.”\nBowers is term-limited in the state House and had planned on retiring from politics — until protesters picketed his house again.",
    "“Fundraising is the biggest Achilles heel for Brnovich because these U.S. Senate races are incredibly expensive, and he has historically been an abysmal fundraiser,” says Mike Noble, chief of research at OH Predictive Insights.",
    "Sam Stone, a Republican consultant who works with MAGA candidates and is running for Phoenix City Council, says Brnovich is clearly in an impossible position when it comes to prosecuting voter fraud and appeasing the GOP base.",
    "Lorna Romero, a Republican political consultant in the state, says candidates who carry the “Stop the Steal” banner may appeal to Republican primary voters, but nominating them could be disastrous for the party come November.",
    "If he gets knocked out by a loyalist challenger, it will leave the GOP with a harder battle in November: Brnovich is seen as the party’s best chance to beat Kelly, the former astronaut with a massive campaign war chest.",
    "Brnovich was one of the first local Republicans to publicly acknowledge Joe Biden as the winner of the 2020 election in Arizona, and he was an early defender of Arizona’s election system when Trump declared it corrupt.",
    "“We’ve seen through his career that he has not necessarily picked fights, but he has gone after companies or public entities that he fundamentally disagrees with what they’re doing from a legal standpoint,” she says.",
    "Hobbs argued that Brnovich had undercut her legal arguments in election cases during the 2020 election, withdrawing from cases at the last minute or intervening and taking a different position than her office.",
    "Tech billionaire and Trump ally Peter Thiel, who is backing Brnovich’s closest competitor, Blake Masters, has already cut television ads using Trump’s words to hammer Brnovich for certifying the election.",
    "The former local newscaster’s penchant for spreading election disinformation and tangling with the press earned her the coveted Trump endorsement in the race to replace the term-limited Doug Ducey.",
    "More recently, GOP gubernatorial frontrunner Kari Lake headlined a rally outside Brnovich’s office in December and used her time at the microphone to demand Brnovich file charges and make arrests.",
    "We’re not done,” says Susan, a local activist who declined to give her last name because she distrusts the media, and who — along with her dog Hudson — have become reliable faces at the protests.",
    "In any normal year, his current job would be a big asset: He’s one of Arizona’s highest profile elected officials, with unmatched name ID and what seems to be a standing invitation to Fox News.",
    "Republican state Rep. Mark Finchem, who has promoted a host of QAnon conspiracies and introduced a resolution to decertify the 2020 presidential election in Arizona, attended the same protest.",
    "The 55-year-old son of Yugoslavian immigrants who fled communism, he also worked as a judge advocate general, an assistant U.S. attorney for the District of Arizona and a county prosecutor.",
    "Brnovich also was on the receiving end of separate ethics complaints from Democratic Secretary of State Katie Hobbs and the Arizona Board of Regents, which oversees the state universities.",
    "So far, Brnovich has taken what looks like the path of least resistance, politically: He won’t endorse Trump’s Big Lie, or prosecute people over it, but he’s not loudly refuting it either.",
    "Rep. Paul Gosar, a far-right Republican who’s attended white nationalist conferences, led the charge in the House to object to Biden’s victory ahead of the Capitol riot on Jan. 6, 2021.",
    "Bowers has already drawn a primary challenge from a fellow Republican and former lawmaker who has espoused QAnon-style conspiracies and denied the legitimacy of the election.",
    "It’s a tricky balancing act for an officeholder, and it’s unclear if Brnovich, whose office and campaign didn’t respond to requests for comment, is adept enough to manage it.",
    "To burnish his Trumpian credentials he has sought to ingratiate himself with the former president and his supporters in other ways, like embracing hard-line border policies.",
    "Even Ron Watkins, who is alleged to be Q of QAnon fame (he denies it) and is now a long-shot Republican candidate for the House, has filmed videos outside Brnovich’s office.",
    "Trump, did, however, hold a fundraiser for Masters, who has raised more than $2.6 million and has the backing of Thiel, who is funding a $10 million pro-Masters super PAC.",
    "The report was replete with innuendo but didn’t actually declare any charges were warranted for election fraud, let alone provide sufficient evidence to win a prosecution.",
    "When Trump called Ducey’s personal cell phone moments before the governor signed documents certifying Arizona’s 2020 election results, Ducey memorably silenced the call.",
    "“I think it’ll be helpful for [Brnovich] to be on the right side of history.”\nIn many ways, Brnovich is a classic Arizona politician — conservative but idiosyncratic.",
    "And legally, he has to tell Trump, “No.”\n“He desperately needs that Trump voter, however extreme they might be,” says Emily Ryan, a Republican lobbyist in Arizona.",
    "If he can win the primary without bowing to Trump and drumming up real political prosecutions, it may be a sign the election fraud lie isn’t as potent in the GOP.",
    "Both complaints were filed with the State Bar of Arizona; he settled them in a “diversion agreement” that ensured the terms of the settlement stayed confidential.",
    "But as he entered the campaign for the Senate, Brnovich has shifted rightward, pressing high-profile conservative causes, especially when it comes to the border.",
    "It hasn’t earned him many friends from inside the halls of power, but it’s bolstered his image as an independent-minded conservative who calls it as he sees it.",
    "Arizona has been home to some of the most extreme efforts to overturn the election as well as the most notable instances of GOP resistance to Trumpian tactics.",
    "Before a January rally in Arizona where Trump regurgitated his greatest hits of election fraud claims, the duo met on the airport tarmac and posed for a photo.",
    "Observers say his fervor on the issues that matter to the base — election integrity aside — is not disingenuous, but shows a more zealous and partisan figure.",
    "Republican state senators washed their hands of Trump’s demand for an audit and solved their own political problem by dropping it in Brnovich’s lap.",
    "He’s allowed his office’s investigation into the Cyber Ninjas’ report to quietly drag on, without any sense of when it might be resolved.",
    "He began his political career in 2014 by toppling a scandal-plagued Republican incumbent attorney general with calls for accountability.",
    "The move worked as intended, as MAGA Republicans praised the decision, even as law enforcement on the border said there was no invasion.",
    "But despite months of wooing by national Republicans unimpressed with the current field, the outgoing governor has resisted a campaign.",
    "For now, the former president is holding back on an endorsement in the race, perhaps for fear of backing a loser in a wide-open field.",
    "Beyond fundraising, Brnovich’s biggest challenge is to simply “stay out of Trump’s crosshairs from now until the primary,” says Noble.",
    "“I know a lot of folks have many questions and concerns regarding the 2020 election,” he said during a radio interview in January.",
    "The point, for a long time, has been to use his office to cultivate support in the five-way primary for U.S. Senate,” he wrote.",
    "Most Republican candidates just have to pledge allegiance to Trump’s election lies to prove loyalty to their national leader.",
    "He rarely does interviews about the audit or 2020 election, and he rarely joins the other candidates on the campaign trail.",
    "One recent poll had Brnovich leading with 25 percent, followed by McGuire with 11 percent and the others in single digits.",
    "Brnovich is “not the type that’s going to be bullied,” says Romero, who also served as an aide to former Republican Gov.",
    "He may also see an opportunity for leverage to try to get a more favorable outcome from Brnovich on the election audit.",
    "Early general election polling shows Kelly holding a slim lead over Brnovich, though with plenty of undecided voters.",
    "The Cyber Ninjas report, Stone says, is an amateur document with none of the evidence needed to lead to charges.",
    "The primary is not until Aug. 2, and he may not want to further antagonize Trump or his supporters before then.",
    "“I would lay this whole bloody mess at the feet of the Cyber Ninjas and just say we got hosed by these guys.",
    "“And there are various inquiries going on in our country, both at the state level and at the federal level.",
    "That includes Trump himself, who has called Brnovich “lackluster” and “nowhere to be found” on his crusade.",
    "Brnovich has parked the investigation in his office, and there’s no sign it’s wrapping up anytime soon.",
    "But in 2022, he faces a squeeze familiar to high-profile Republican state officials across the country.",
    "Republicans who believe the election was stolen have been raising the pressure on Brnovich ever since.",
    "As pressure mounts from Trump, it’s unclear if Brnovich’s effort to straddle the line will be tenable.",
    "Friends and allies of Brnovich describe an intelligent, independent thinker who doesn’t suffer fools.",
    "But a handful of Arizona Republicans have also shown time and again there’s a line they won’t cross.",
    "“I think he’s a good man, I think he’s going to do his job — we’ll find out,” Trump told the crowd.",
    "Brnovich has so far raised just $1.8 million for his campaign, and he’s already spent most of that.",
    "Brnovich holds a steady, but not rock-solid, polling lead over his lesser-known primary opponents.",
    "You couldn’t quite call him moderate, but he hasn’t always been a Republican’s Republican, either.",
    "The Board of Regents argued he violated ethical rules when he sued the board, which is his client.",
    "He’s a Deadhead who sported a Grateful Dead t-shirt at one point during his first campaign video.",
    "“And with the extreme right of the party, Brnovich can’t legally go far enough to satisfy them.",
    "He’s raised about $28 million for the campaign so far and has more than $18 million on hand.",
    "The same poll showed that Ducey would become the instant frontrunner if he decided to run.",
    "“But of course, accurately describing reality is not the point when it comes to Brnovich.",
    "Of course, Trump’s crosshairs swing wildly from day to day, so that may not be possible.",
    "Of course, Trump would have almost certainly trained his fire on Ducey, were he to run.",
    "“If I were him, I’d be ripping steamed when they dropped that at my office,” he says.",
    "“His early statements on the 2020 election really backfired on him,” Henry says.",
    "He studied martial arts and famously swings nunchucks at any given opportunity.",
    "Kelly, the Democratic incumbent, has proved himself a fundraising juggernaut.",
    "Lamon, meanwhile, dumped $8 million of his own money into his campaign.",
    "He’s the Trump-endorsed candidate to be Arizona’s next elections chief.",
    "His fate will say much about the state of the Republican Party in 2022.",
    "Politically, he has long fashioned himself as something of a reformer.",
    "PHOENIX — The honking is constant outside Mark Brnovich’s office.",
    "He eagerly put his signature on certifying the Arizona election.",
    "In fact, the audit reaffirmed that Biden beat Trump in Arizona.",
    "But nearly half of likely voters were undecided in the race.",
    "At the rally, he gave Brnovich a largely pleasant shoutout.",
    "But where he was once bold on the issue, he is now silent.",
    "He formally announced he would sit out the race last week.",
    "In interviews, he mostly tries to sidestep the issue.",
    "And at this point, Arizona is solidly a swing state.",
    "He’s less thoughtful than the Brnovich of the past.",
    "Brnovich is tasked with executing on them.",
    "“The tides are gonna change,” she says.",
    "He’s now running for the state Senate.",
    "The approach may be working.",
    "“We’re not going away.",
    "We got cyberpunked.”",
    "Jan Brewer."
  ]
}