{
  "id": 2846,
  "mediaId": 2578,
  "date": "2022-03-12",
  "headline": "EXCLUSIVE: Maricopa County Supervisor Bill Gates Continues to Play Victim and Refuses to Turn Election Routers Over to Inspectors… Why Is That? (VIDEO)",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/BC090B51-8194-4770-BFC1-B249D8584AB4.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/03/exclusive-maricopa-county-supervisor-bill-gates-continues-play-victim-refuses-turn-election-routers-inspectors-video0/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1581,
    3147,
    4638,
    1094,
    4830,
    5128,
    5371
  ],
  "sentences": [
    "He chose to resign after The Gateway Pundit reported on secret audio recordings where Chucri was saying, multi-faceted election fraud and ballot harvesting changed the election, and that Maricopa County’s audit was “bullsh*t.” He also said that he does not feel comfortable with Dominion Voting Machines and that Maricopa County Recorder Stephen Richer agrees!",
    "And I think humbly you know that that may be part of why we’ve been able to keep this team together because they’ve seen us, they’ve seen Stephen Richer, our new recorder and just for those who don’t know Stephen Richer, as David mentioned, he beat Adrian Fontes, the Democrat recorder in 2020.",
    "This panel aimed to discredit evidence of election fraud and claim the 2020 election was “the most secure, transparent, and verified election in history.”\nThe panelists repeated the debunked lies that Russia influenced the 2016 election and that 2020 was the most secure election in history.",
    "Maricopa County Chairman Bill Gates, Michigan Secretary of State Jocelyn Benson, and Pasco County Supervisor Brian Corely recently chaired a McCain Institute panel titled, “Defending American Democracy: When Local Elections Are Threatened, What Are The National Implications?”.",
    "We now have one of the leading candidates for Secretary of State on the Republican side this year in 2022 is none other than Mark Finchem who was at the US Capitol on January 6th and has made it very clear what his intent will be if he is elected Secretary of State.",
    "So again, this constant drumbeat that we are somehow complicit in a criminal enterprise to throw this election to Joe Biden, and in fact, we have been investigated now for several months by the Attorney General, Republican Attorney General Mark Brnovich.",
    "The Attorney General threatened to take over $700 million in state-shared revenues away from Maricopa County, which would have put us out of business because we refused to turn over routers at the request of President Trump.",
    "During the House Oversight Committee hearing last October, Rep. Andy Biggs asked Maricopa County officials why they deleted data from the Dominion election equipment after it was subpoenaed by the Arizona State Senate.",
    "The Attorney General did, in fact, threaten to withhold 10% of state shared revenues from Maricopa County after months of noncompliance with legal and enforceable Arizona Senate subpoenas and multiple warnings.",
    "Stephen Richer’s fingerprints are all over the 2020 election because he ran a campaign against the election fraud perpetrated by former County Recorder Adrian Fontes and Secretary of State Katie Hobbs.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThese people are the biggest never-Trumpers in America.",
    "The reason he is doing this criminal investigation is because the president of our State Senate, Karen Fann, sent the cyber ninja report to him and asked that he do a criminal investigation.",
    "You may have seen some things sent out by The Gateway Pundit where they claim that Clint Hickman, and I’m not making this up, fed the ballots to his chickens and then set the farm on fire.",
    "The Gateway Pundit reported that Becker’s Center for Election Innovation and Research (CEIR) gave $20mil to Michigan Secretary of State Jocelyn Benson’s personal non-profit (MCELA).",
    "Gates continues to play the victim while playing 2020 off as the most secure election in history and claiming that Republicans seized the elections equipment for the Arizona audit.",
    "Attorney General Brnovich is conducting a criminal investigation because the Arizona audit discovered evidence of law violations and hundreds of thousands of illegal ballots.",
    "I was honored to go and testify with you, David, in front of the House Oversight Committee to tell our story of the good election that our election workers ran.",
    "And now, on a daily basis, there are posts on social media that I “lied in front of Congress,” and that I should be prosecuted for lying in front of Congress.",
    "Additionally, former County Supervisor Steve Chucri admitted that Stephen Richer does not trust the Dominion software to be used in another election.",
    "The Gateway Pundit reported that this is a recycled John McCain tactic, instituted by RINOs, to make the Republican Party more accepting of RINOs.",
    "The Panel was moderated by David Becker, a far-left radical, who organized the creation of the Electronic Registration Information Center (ERIC).",
    "TGP also reported how Becker founded the (EOLDN) to help election officials with lawyers who would fend off legitimate claims of election fraud.",
    "This bill replaces precinct committeemen elections with appointments by the Board of Supervisors to unseat MAGA patriots from party leadership.",
    "Bill Gates actually admitted to deleting elections data, then walked back and claimed they were “archived” and not included in the subpoena.",
    "The Gateway Pundit reported that John McCain funneled several junk Trump-Russia documents to the FBI after Trump won the 2016 election.",
    "They even compared the invasion of Ukraine to the struggles elections officials in America face in covering up the fraudulent election.",
    "As everyone has said here, it was an outstanding election that was run in 2020 in Maricopa County, so we’re standing up for their work.",
    "Paul Fagan introduced the panel members for McCain Institute, which is dedicated to carrying on the legacy of RINO Senator John McCain.",
    "And additionally, one of our colleagues was forced to resign after he was recorded making comments about the Maricopa County audit.",
    "And I gotta tell you, that’s one of the things I’ve thought about a lot in the last two years is, what would John McCain say?",
    "My colleagues and I are literally called traders on a daily basis, and now, I have great concerns about the future.",
    "The video conference took place on March 3rd, 2022, the same day that the disastrous HB2839 was passed in Arizona.",
    "I’m going to run a better election in 2022 working with the Board of Supervisors.” But that’s not what he’s done.",
    "One of my colleagues, Clint Hickman, who also owns a very successful egg company with a lot of chickens.",
    "Now, they’re all appearing on a panel together to cover up the rigged 2020 Presidential Election.",
    "And that story was just reposted on my Facebook yesterday by someone I went to high school with.",
    "These routers had sensitive information that would have put law enforcement operations in peril.",
    "The County still echos its bogus claim that the routers held sensitive law enforcement data.",
    "What advice would John McCain have given me and my colleagues as we’ve dealt with this?",
    "As an elected official in Arizona for 12 years, I spent a lot of time with John McCain.",
    "Additionally, four of the members of the Board of Supervisors faced a recall effort.",
    "Once elected, however, Richer claimed that Adrian Fontes ran the election perfectly.",
    "The Gateway Pundit has covered the controversial ERIC organization extensively.",
    "Bill Gates: I really want to thank the McCain institute for inviting me.",
    "We continue to deal with that criminal investigation on a daily basis.",
    "John McCain would certainly plot another coup against President Trump.",
    "Stephen Richer’s fingerprints are not on the 2020 election at all.",
    "The Gateway Pundit received this video from WeThePeopleAZAlliance.",
    "Maricopa County Supervisor Bill Gates made the following remarks.",
    "The Arizona Senate lawfully subpoenaed the elections equipment.",
    "I mean, for me, this was the election that I helped oversee.",
    "Arizona’s election officials also used the ERIC database.",
    "Listen to the rest of Bill Gates’ nutty comments below.",
    "He has stood up for his workers time and time again.",
    "She then directed $11.8mil to two Democrat PR firms.",
    "Mark Finchem will remedy the stolen 2020 election.",
    "The threats have come to Maricopa County itself.",
    "He could, as a politician, say, “You know what?",
    "What would RINO Never-Trumper, John McCain say?",
    "And she didn’t post it there as a joke.",
    "Steve Chucri was not forced to resign.",
    "There’s questions, but you know what?",
    "Fortunately, that was not successful.",
    "In fact, he’s run into the building.",
    "Obviously no basis for that at all.",
    "So that’s what we’re dealing with.",
    "It appears that Bill Gates lied.",
    "The McCain wing is terrified.",
    "He has run into the building.",
    "Okay, so I’m a little biased.",
    "Bill Gates is lying again.",
    "I wasn’t involved in 2020.",
    "Hey, there’s questions.",
    "The attacks continue.",
    "Was Richer paid off?",
    "That is remarkable.",
    "Stephen is not.",
    "I’ll admit it.",
    "I’ll admit it.",
    "Okay."
  ]
}