{
  "id": 3062,
  "mediaId": 2584,
  "date": "2022-03-12",
  "headline": "‘Arsonists with keys to the firehouse’: once-obscure state races fuel fears for US democracy",
  "image": "https://i.guim.co.uk/img/media/cf1d744d72a9a5e5a63a03cc7cebcce7d5f2053d/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=39ebfd96f80090bb4247cee000169aee",
  "link": "https://www.theguardian.com/us-news/2022/mar/12/us-elections-secretary-of-state-democracy-brad-raffensperger",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joan E Greve",
  "authorUrl": "https://www.theguardian.com/profile/joan-greve",
  "termIds": [
    0
  ],
  "sentences": [
    "“The places that we’ve seen the biggest increase – which is basically Arizona, Georgia and Michigan – each of those places had some degree of nationally covered election controversy around 2020.”\nThe Brennan Center analysis also indicated that out-of-state donations to secretary of state candidates are increasing at an even faster rate than overall donations.",
    "“When 50 Republicans blocked it yet again, folks were looking for a way to stay engaged and to continue the fight, and they shifted their assets into the states.”\nRepublicans complain that Democrats are trying to alter election regulations to their benefit at both the federal and state levels.",
    "Andrew Romeo, communications director for the Republican State Leadership Committee, said Democrats were “ramping up their interest in secretary of state races because they see control of these offices as a way to change the rules to compensate for their inability to win elections”.",
    "According to an analysis by the Brennan Center for Justice, donations for secretary of state races in six battleground states are three times higher than they were at this point in the last election cycle, in 2018, and eight times higher than the 2014 cycle.",
    "Congressional Democrats have repeatedly tried to pass national voting rights legislation, which would reverse some of the voting restrictions enacted by 19 states last year, but Senate Republicans have successfully used the filibuster to defeat those bills.",
    "“It is disempowering, and it is akin to giving an arsonist keys to the firehouse.”\nRepublicans and Democrats’ disparate concerns over election fairness have contributed to a significant increase in donations to secretary of state candidates.",
    "Raffensperger is paying for his actions in a way that reveals how his once obscure elected position is now at the center of a battle for the future of American democracy – and attracting all the big money and political heat that entails.",
    "Candidates for secretary of state are raising huge sums after Trump’s lies shook 2020 election\nLast year, Brad Raffensperger was attracting national headlines for taking a stand against Donald Trump and his lies about the 2020 election.",
    "Finchem, who has called on the Arizona legislature to decertify the 2020 presidential results in three major counties, already has six times as many donors as every secretary of state candidate in the 2018 election combined.",
    "In the weeks after the 2020 election, as Trump and his supporters falsely claimed the results had been tainted by fraud, secretaries of state in key battleground states became the target of intimidation and threats.",
    "In a phone call that was quickly made public, Trump demanded that Raffensperger, Georgia’s Republican secretary of state, “find” enough votes to deprive Joe Biden of a victory in the battleground state.",
    "Hice’s impressive haul is partly thanks to the unusually high number of out-of-state donations that his campaign has attracted, as more Americans across the country zero in on secretary of state races.",
    "As Trump and his allies continue to spread the “big lie” of widespread fraud in the 2020 race, many voters are focusing their attention – and wallets – on the officials who oversee states’ elections.",
    "While Trump did not endorse any candidates for secretary of state in 2020, he has already endorsed three in the 2022 cycle: Hice in Georgia, Mark Finchem in Arizona and Kristina Karamo in Michigan.",
    "Secretary of state candidates in both parties are now posting substantial fundraising figures, intensifying concerns over how election administration has become a heated political issue in the US.",
    "Rogers believes Democratic activists are increasingly turning their attention to secretary of state races partly because they have been frustrated by the lack of progress at the federal level.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "The winners of these elections assume rather bureaucratic roles, and their duties may include managing state records, overseeing the department of motor vehicles and keeping the state seal.",
    "Vandewalker fears that the increasingly dire messaging about secretary of state races will contribute to a political climate in which both parties distrust the outcome of elections.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "“They are willing to overturn the will of the voters in order to choose the winner,” said Kim Rogers, executive director of the Democratic Association of Secretaries of State.",
    "Romeo’s group is an umbrella organization that promotes Republican candidates for state legislatures, state supreme courts and secretary of state offices, among other roles.",
    "Hice, who has said the 2020 results in Georgia would have been different if the race had been “fair”, has already raised more than twice as much money as Raffensperger.",
    "But he adds, “that kind of rhetoric is extremely dangerous to voter confidence because of course one side or the other is going to win and is going to count the votes.",
    "“A lot more money is going to these once sleepy, bureaucratic races,” said Ian Vandewalker, senior counsel in the Brennan Center’s elections and government program.",
    "The organization has said it is on track to meet its fundraising goal of $15m for the 2022 cycle, in part because of the increase in first-time individual donors.",
    "The Democratic Association of Secretaries of State and its partner groups raised a record $4.5m in 2021, compared with $1.5m raised during the entire 2018 cycle.",
    "But to Democrats like Rogers, the outcome of secretary of state races in key battleground states represents nothing less than the fate of American democracy.",
    "This year, Raffensperger is facing a brutal primary race against a Trump-backed candidate, the US congressman Jody Hice, and trying to cling on to his job.",
    "“I think there are a lot of activists who got involved in 2020 who fought incredibly hard for the federal voting rights legislation in 2021,” Rogers said.",
    "Fundraising has particularly increased in Arizona, Georgia and Michigan, which also happen to be the three states where Trump has issued an endorsement.",
    "Biden’s margin of victory in each of those states was less than three points, and their input could prove decisive in the next presidential election.",
    "Other progressive groups, including End Citizens United and iVote, have pledged to spend tens of millions more on secretary of state races this year.",
    "Democrats have taken note of Republican enthusiasm about secretary of state elections, and they are responding by ramping up their own fundraising.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "All three candidates have embraced the lie that Democrats stole the 2020 election by allowing fraud to affect the results.",
    "The RSLC and its policy partner group raised $33.3m in 2021, exceeding their previous odd-year record by more than $14m.",
    "And democracy counts on people accepting the result, even if their side doesn’t win.”\n… we have a small favour to ask.",
    "Now the former president is using the power of his endorsement to wield influence in the races for those posts.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "But in many states, the secretary of state also serves – crucially – as the chief election official.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "We have seen a massive increase in our email list and grassroots support,” Rogers said.",
    "Secretary of state races have historically attracted little notice and even less money.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "“These folks want to rig the game, and they are out to do that,” Rogers said.",
    "“Money and attention being paid to these races is not inherently a bad thing.",
    "Raffensperger refused to do so and won widespread praise for his courage.",
    "The voters should be informed about these candidates,” Vandewalker said.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "Two-thirds of those donors live outside Arizona.",
    "If there were ever a time to join us, it is now.",
    "“The engagement is at every single level.",
    "And Georgia is not unique.",
    "Thank you.",
    "?"
  ]
}