{
  "id": 3261,
  "mediaId": 2745,
  "date": "2022-03-08",
  "headline": "Arizona lawmaker speaks to white nationalists, calls for violence — and sets fundraising records",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/G6E6AOUZWAI6ZGMHTXHO4YVD6Y.jpg&w=1440",
  "link": "https://www.washingtonpost.com/investigations/2022/03/08/wendy-rogers-arizona-nick-fuentes-censure/?utm_source=rss&utm_medium=referral&utm_campaign=wp_national",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The censure rebuked her for “conduct unbecoming a Senator” and “encouraging violence.”\nDucey, who had faced criticism for declining to reproach her took to Twitter Tuesday night, saying “Anti-Semitic and hateful language has no place in Arizona.”\nArizona Republican Party Chairwoman Kelli Ward, a leading voice in the “Stop the Steal” movement to deny Biden’s victory, did not respond to requests for comment on the censure.",
    "While her support for former president Donald Trump’s election falsehoods puts her in line with many Republicans, Rogers has moved unapologetically further to the edges of American politics: Calling for jailing and executing her political opponents, identifying herself as a member of the Oath Keepers militia group, and attending a conference organized by a group linked to QAnon, the violent anti-government ideology.",
    "“We need to build more gallows,” the speaker said, adding that such a deadly fate would “make an example of these traitors who’ve betrayed our country.”\nThe speech via video at the Feb. 25 conference organized by far-right activist Nick Fuentes, who has espoused racist and antisemitic views, wasn’t from another online agitator or fringe radio host.",
    "Like fellow GOP provocateurs in Congress, such as Rep. Marjorie Taylor Greene (R-Ga.) and Madison Cawthorn (R-N.C.), Rogers’s inflammatory rhetoric has gained her widespread notice in the pro-Trump media ecosystem and on social media, making her a sought-after endorsement well beyond her rural home district around Flagstaff.",
    "In a letter Rogers posted on social media, constituents Rose and Richard Sperry, wrote, “Up until Senator Rogers came on the scene, there was NO voice for us and it appears that with these actions you have made it pretty clear that we still don’t have but ONE voice and that is the voice of Senator Rogers.",
    "“I will personally destroy the career of any Republican who partakes in the gaslighting of me simply because of the color of my skin or opinion about a war I don’t want to send our kids to die in.”\nBy Tuesday, under pressure to take a stand, the Arizona Senate voted to censure one of its own.",
    "Rogers, though, called the conference “a major success” and posted a meme depicting her and Fuentes crouching in a field holding a rifle, with a dead rhinoceros splayed out in front of them labeled “CPAC.” The acronym had been tweaked so that inside one of the letters was a Jewish star.",
    "Midway through a white nationalist’s conference in Orlando last month, one speaker drew applause calling for gruesome violence against “traitors” after excoriating critics of the “honorable” Confederate Gen. Robert E. Lee and proponents of the “bioweapon” coronavirus vaccine.",
    "The Anti-Defamation League, which battles antisemitism, had already added Rogers to its list of extremists in January, citing her support for Fuentes along with her association with the Oath Keepers militia group and interviews with a website that has espoused antisemitism.",
    "“In the end, I rejoice in knowing I do and say what is right, and I speak as a free American regardless of the actions of this corrupted process today.”\nA decade before she became known for her scorching rhetoric, Rogers was viewed as a traditional conservative.",
    "Even Greene, one of the most right-wing members of Congress, tried to distance herself from Fuentes after attending the conference, saying she did not know him but wanted to talk to “his very large following.” AFPAC claims 1,000 people attended.",
    "“Even blatant support for extremist movements is no longer disqualifying in the eyes of many voters.”\nRogers boasted about widening the boundaries of the political mainstream, the so-called Overton window, in response to the ADL’s admonishment.",
    "“I don’t know of a single one of her election bills I can support, and I am not the only Republican who feels that way,” said state Sen. Paul Boyer, one of a few GOP lawmakers who have openly repudiated conspiracy theories about the 2020 vote.",
    "Her 2021 fundraising also surpassed totals collected by other Trump-endorsed contenders in the state, including gubernatorial candidate Lake, with about $1.5 million, and secretary of state candidate Mark Finchem, with roughly $663,000.",
    "“Anyone with practical logic, and an open mind, can see that [her] claim of a legitimate primary residency in Flagstaff is a scam,” wrote Gila County Republican Chairman Gary Morris in a news release during the 2020 campaign.",
    "Rogers has echoed Trump’s baseless assertions that mail-in voting is a major source of fraud, and backed another bill that would do away with early voting, except when a voter is physically unable to cast a ballot in person.",
    "“Our broad concern is with the normalization of extremist ideas, hateful rhetoric and the type of narrative geared toward undermining democratic institutions,” said Oren Segal, vice president of the ADL Center on Extremism.",
    "Nearly $2 million of that money came from small donations from outside Arizona as she traveled the U.S. calling for the 2020 election to be overturned and demanding audits of the vote without credible evidence of fraud.",
    "She has blamed international financiers and Jewish investor and activist George Soros for the war in ways that seem to echo the long-standing slur that the world’s problems are caused by an international cabal of Jews.",
    "Rather, it was delivered by Arizona state Sen. Wendy Rogers, a Republican lawmaker who represents tens of thousands of constituents and has found a rising national profile as a face of the radicalized wing of the GOP.",
    "“If her bills passed, elections would be Helter Skelter.”\nRogers posts constantly on six social media accounts, ranging from mainstream platforms like Twitter to sites favored on the right, including Telegram and Gab.",
    "“Just moving the ol’ Overton window,” she said, “Thanks for the award losers.” She added: “#JesusIsKing.”\nIn the wake of the Russian invasion of Ukraine, Rogers’s online commentary has leaned into antisemitic tropes.",
    "In a feat remarkable for one of 30 state senators, Rogers is outraising statewide incumbents such as Republican Attorney General Mark Brnovich, who is campaigning for U.S. Senate and has raised about $1.8 million.",
    "“There were no alarms bells.”\nIn 2015, Rogers was an early and enthusiastic supporter of Jeb Bush’s presidential campaign, raising enough money to join other bundlers at his family’s home in Kennebunkport, Maine.",
    "At this year’s AFPAC, Fuentes said that his group’s “secret ingredient” was “young white men.” He led the crowd in a cheer for Russian President Vladimir Putin, days into the deadly military assault on Ukraine.",
    "Rogers is following the path paved by other online provocateurs whose profiles have risen since Trump’s election in 2016, said Jared Holt, a domestic extremism expert at the nonpartisan Atlantic Council.",
    "“It used to be that if someone said something crazy, they would get slapped down by the party leaders in a way that could hurt,” said Chris DeRose, a longtime Republican election law attorney in Phoenix.",
    "May she never yield to your class of warfare.”\nAn early draft of the censure accused Rogers of “inciting general racial and religious discrimination,” but that phrase was stricken before the final tally.",
    "“She was not one to make the kind of polarizing statements she makes now,” said political consultant Bert Coleman, who worked on the campaign, which Rogers eventually lost to a Democratic opponent.",
    "In the three months leading up to her speech to Fuentes’s event, the America First Political Action Conference, about a half dozen posts suggested sending political foes to the gallows.",
    "Rogers, who declined an interview request from The Post and did not respond to a detailed list of questions, has made it clear that she had no regrets about speaking to Fuentes’s group.",
    "In her first state Senate race in 2010, she ran on the kind of résumé coveted by the political establishment: co-owner of a small business, military veteran and mother of two children.",
    "“What we do not condone is members threatening each other, to ruin each other, to incite violence, to call us communists,” Senate President Karen Fann (R) said on the Senate floor.",
    "But she made it clear she believes such blowback only strengthens her message, as she quickly decried the elites for trying to silence her and refused to apologize or back down.",
    "She also has criticized Ukraine’s Jewish president, Volodymyr Zelensky, who has received global acclaim for inspiring his country and refusing to flee in face of death threats.",
    "Of candidates for state offices, only Democratic Secretary of State Katie Hobbs, who is running for governor and collected more than $2.9 million in 2021, surpassed Rogers.",
    "“There is no way to nullify the election, yet that is how she is raising money, being disingenuous with the voters,” said Sylvia Allen, the Republican Rogers beat in 2020.",
    "A retired U.S. Air Force pilot who reached the rank of lieutenant colonel, Rogers once said Arizona Sen. John McCain, who died in 2018, inspired her to seek public office.",
    "After losing her earliest races as a mainstream Republican, she moved further and further right until she beat an incumbent by campaigning as the more conservative choice.",
    "She raised nearly $2.5 million in 2021, outraising even statewide candidates for governor, attorney general and secretary of state, according to campaign finance records.",
    "Unlike a decade earlier, when she campaigned for a Tempe-area seat, Rogers was seeking to represent a more conservative and rural Senate district surrounding Flagstaff.",
    "When Ducey was pressed last month to comment on Rogers’s impending speech to the Fuentes rally, he spoke of the “governing majorities” needed to advance his agenda.",
    "Now, after a year of fanning bogus allegations about election fraud and other false claims, she is the most successful fundraiser in the Arizona state legislature.",
    "At the time, a Rogers spokesman denounced the attack as a “smear” and said she lived in Flagstaff and only went to her other home to visit her grandchildren.",
    "“I stand with the Christians worldwide not the global bankers who are shoving godlessness and degeneracy in our face,” she wrote on Feb. 27 on Telegram.",
    "Rogers is the prime sponsor of about a dozen voting-related bills, including some that experts say would make statewide elections virtually impossible.",
    "“My wife gives me hell to this day for having supported her.”\nHer shift to the far right has coincided with an outpouring of grass-roots, small donors.",
    "She has proposed eliminating electronic vote-tabulating machines and requiring hand counts in a state that cast more than 3.3 million ballots in 2020.",
    "While the 2020 election remains her signature issue, she also has spread false claims about former first lady Michelle Obama and the Sept. 11 attacks.",
    "But by the spring of 2016, as the former reality television star improbably headed toward the nomination, Rogers had become a loyal Trump supporter.",
    "“This censure is nothing more than an attempt to limit my speech,” she said on the Senate floor Tuesday before casting one of the three no votes.",
    "In a sign of how her social media presence dwarfs that of other Arizona Republicans, her Twitter following exceeds 276,000, while Arizona Gov.",
    "But since 2015, she has been registered to vote about 160 miles away in Flagstaff, where records show she owns a 700-square-foot mobile home.",
    "“They say that’s not a good thing,” he said, adding with a chuckle, “I shouldn’t have said that.”\nRepublicans have widely spurned Fuentes.",
    "State law requires candidates live in the county they represent for at least one year before election, but the rule is rarely enforced.",
    "Her latest speech to Fuentes’s group earned her a rare official rebuke from Republicans, via a 24-3 Arizona Senate vote to censure her.",
    "She didn’t receive an endorsement from the Arizona Chamber of Commerce — as she did in 2010 — but she didn’t need it to win in 2020.",
    "Absentee ballots for the primary and general elections that year were mailed to Rogers’s Tempe address, according to public records.",
    "A spokesman for his Trump-endorsed rival for governor, Kari Lake, did not respond to a request from The Washington Post to comment.",
    "Republican supporters recall an indefatigable campaigner, biking all over the Tempe-area district to knock on thousands of doors.",
    "Republicans who have watched Rogers over the past decade wonder if her views have changed or if she is merely opportunistic.",
    "“When she first ran, she was nothing like she is today,” said Rick Romley, a Republican and former Maricopa County attorney.",
    "Arizona, which Biden won by about 10,500 votes, has been at the forefront of Trump’s push to undermine the 2020 election.",
    "Rogers has been pushing for “decertification,” a process election experts say is not possible under state or federal law.",
    "“She’s still better than her opponent Felicia French,” Ducey said, referring to the Democrat Rogers defeated in 2020.",
    "That means an absentee ballot is automatically mailed to her for every election in which she is an eligible voter.",
    "Nearly 40,000 individuals contributed to her campaign last year, of which only a handful gave the $5,300 maximum.",
    "One of the party’s gubernatorial candidates, former U.S. Rep. Matt Salmon, on Thursday called for her to resign.",
    "She addressed the Fuentes conference the following day, along with Greene and GOP Rep. Paul A. Gosar of Arizona.",
    "She tweeted a Post story about a Bush campaign event where he attacked Trump for not being a true conservative.",
    "In 2020, the vast majority of voters statewide and in Rogers’s own district cast ballots before Election Day.",
    "Rogers herself has been on the state’s permanent early voting list since at least 2006, public records show.",
    "After the members were rebuked by a handful of prominent Republicans, Rogers lashed out on social media.",
    "Rogers’s online followers reacted with fury, and in some cases, threatened her colleagues with violence.",
    "Rogers and her husband own a 2,900-square-foot home with a pool in Tempe, according to public records.",
    "After four more failed congressional bids, she turned her sights back to the state Senate in 2020.",
    "Either way, Rogers’s MAGA-charged rants helped her achieve a long-elusive victory at the polls.",
    "Less than 24 hours after the Senate reprimand, Rogers was leveraging it in a fundraising email.",
    "In her previous campaigns, she repeatedly urged supporters to meet absentee ballot deadlines.",
    "Of the 20 candidates she has endorsed in this year’s midterms, only one is from Arizona.",
    "Rogers’s trajectory shows the political and financial incentives of going to extremes.",
    "The chamber has not done so in at least three decades, according to a Senate official.",
    "Rogers, 67, has now emerged as a dividing line for the GOP in Arizona and beyond.",
    "In the closely divided Senate, her bills need unanimous support from Republicans.",
    "Rogers’s top priority: cracking down on “illegals,” according to her website.",
    "She talked about raising teacher pay and expanding the use of solar energy.",
    "That means Rogers can keep dipping into this large pool of donors in 2022.",
    "“Zelensky is a globalist puppet for Soros and the Clintons,” she wrote.",
    "A Trump spokesman did not respond to questions about her either.",
    "She has more than 700,000 followers between the six accounts.",
    "None of her election-related bills are expected to pass.",
    "Fuentes noted Putin has been compared to Adolf Hitler.",
    "“Now it’s a badge of honor if people are mad at you.”",
    "She expressed support for Fuentes more than 30 times.",
    "She won endorsements from mainstream business groups.",
    "“I will not apologize for being white,” she said.",
    "Doug Ducey counts fewer than 152,000 followers.",
    "She publicized support from Democrats."
  ]
}