{
  "id": 3317,
  "mediaId": 2735,
  "date": "2022-03-07",
  "headline": "Trump’s Pick for AZ Secretary of State Participated in January 6 Capitol Breach",
  "image": "https://truthout.org/wp-content/uploads/2022/03/2022_0306-mark-finchem-1200x675.jpg",
  "link": "https://truthout.org/articles/trumps-pick-for-az-secretary-of-state-participated-in-january-6-capitol-breach/",
  "mediaOutlet": "Truthout",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sasha Abramsky",
  "authorUrl": "",
  "termIds": [
    2201,
    2321,
    3242,
    3709,
    4830,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "It is also looking to secure control of vital electoral positions — from the secretary of state downward — the capture of which would make it far easier for a determined Republican candidate to overturn the will of the people by limiting who can vote, corrupting the vote count, using the new legislation to remove independent local election officials, and, if all else fails, by empowering state officials to replace electors chosen by the populace with electors hand-picked by legislators.",
    "Doug Ducey — who is himself deemed by Trump, Finchem and their ilk to be not nearly conservative enough, since he committed the cardinal sin of certifying Arizona’s election result for Biden — saying, in the wake of Rogers’s appearance at the white nationalist event, that she was better than her defeated Democratic opponent; and then doubling down and refusing to apologize for having showered copious amounts of money on her during her election campaign.",
    "The brooding would-be-strongman helped launch an insurrection; tried in multiple ways to subvert the constitutional process for the peaceful transition of power; appealed to the courts time and time again in a failed effort to neutralize the votes of those who didn’t support him; and finally, after the fact, has begun building a powerful electoral machine to capture the very operating machinery of the electoral process.",
    "There’s no doubt that Russian President Vladimir Putin, who has held the presidency for most of the years between 1999 and today — has shaded into functionally acting as a dictator, despite the fact that he can rightly say he has been reelected several times by the Russian electorate, and by huge margins at that.",
    "And, notwithstanding the implosion of the so-called “audit” of Maricopa County’s election results last year, as recently as last month, Finchem was telling anyone who would listen that he had evidence that would lead to the decertification of the results from three Arizona counties.",
    "This is a man who swore to uphold the Constitution, yet who journeyed across the country to take part in a mob effort to prevent the vice president and the Congress from completing the peaceful transfer of power from a defeated president to an incoming administration.",
    "He proposes constitutional amendments allowing him to extend his rule, and, when those amendments pass, with the opposition largely silenced in their efforts to speak up against the changes, again claims that his tsar-like reign has the people’s stamp of approval.",
    "As the world watches the Russian military bombarding its way through Ukraine and police arresting Russian anti-war activists by the thousands, the dangers of autocratic, unaccountable rule, rubber-stamped by stage-managed elections, becomes ever clearer.",
    "Arizona is one of the five key swing states that went to Joe Biden last time around, and Trump hasn’t forgiven Republican state officials for not intervening on his behalf to somehow erase the Democratic margins there.",
    "Before you go — please read the important update below\nFor the last two decades, millions of readers have relied on Truthout to provide accurate, transparent journalism through moments of political and social crisis.",
    "People in the U.S. should take careful note of this case study because, to a large degree, it’s a similar model to what Donald Trump, and much of the GOP, appear open to trying to impose within the United States.",
    "It’s a prospect that should send anyone concerned about the future of U.S. democracy into overdrive working to ensure that Finchem can’t get anywhere near the position of power that he craves.",
    "In state after state, Trump’s movement is now honing in on passing new legislation aimed at restricting the franchise and giving partisan officials power over the vote counting process.",
    "In fact, over the years, a goodly number of far right extremists have won elections in Arizona, the state that, via Barry Goldwater, birthed the modern conservative renaissance.",
    "If Trumpite conspiracists seize control of the levers of the electoral system in 2022 in states such as Arizona, they could use that newly acquired power ruthlessly come 2024.",
    "Witness the recent appearance by GOP State Sen. Wendy Rogers as a featured speaker at a major white nationalist event, the America First Political Action Conference (AFPAC).",
    "Rogers herself, with links to militias such as the Oath Keepers, is on record as calling white nationalists “patriots” and has called for her political enemies to be hanged.",
    "He gets elected and claims legitimacy; no matter that he has jailed his opponents, shuttered the free press and gained total control over how the votes are counted.",
    "He also introduced a resolution into the legislature — shot down as “un-American” by the Republican speaker — to try to decertify the results of those counties.",
    "But Arizona, a purple state whose GOP often swings far to the right, continues to throw political curveballs, and it is naïve to assume he simply has no chance.",
    "And because it’s so horrific, it’s tempting to simply assume that in practice, there’s no way that someone as extreme as Finchem could win statewide office.",
    "Over the last year, we’ve struggled to meet our basic operating costs, as Facebook and Google have reduced the visibility of non-corporate news stories.",
    "He is on record as saying that tens of thousands of undocumented immigrants voted in Arizona, despite no evidence surfacing to back up these claims.",
    "Putin has used a state-controlled media and a largely pliant political, business, security and military elite to ruthlessly consolidate his power.",
    "Finchem, a state legislator from the Tucson suburbs, is a far right conspiracist who completely buys into Trump’s lies about a stolen election.",
    "With that history in mind, let’s take a look at what Trump has done in the U.S. in the 16 months since he lost the 2020 presidential election.",
    "Trump’s hope, it seems, is to do an end-run in 2024 around the various institutional protections that foiled his coup efforts in 2020.",
    "Film footage unveiled last summer shows that Finchem was among the insurgent crowd outside the U.S. Capitol building on January 6.",
    "All by way of saying that just because Finchem seems to be a long shot, that doesn’t mean he’s inherently unelectable in Arizona.",
    "As a result, our stories are being seen by fewer people at a time when trustworthy journalism is so desperately needed.",
    "We’re working hard to mitigate these issues but we still have an immediate need for your help, especially right now.",
    "We’ve been proud to remain donor-supported — not once accepting money from advertisers or corporate funders.",
    "Yet each step of the way, he has taken care to at least give the appearance of playing by democratic rules.",
    "What happened in the post-Soviet Russian political system is a case study in autocracy via the ballot box.",
    "Given this history, the notion that Finchem could soon be Arizona’s secretary of state is truly horrific.",
    "Now, he’s trying to secure the election, this coming November, of Mark Finchem as secretary of state.",
    "What’s happening in Arizona is a case study in the Trumpite effort to subvert the democratic system.",
    "AFPAC is led by Nick Fuentes, who various news outlets have described as a Holocaust denier.",
    "We see in Putin the dangers of a fully flowered autocracy that claims a popular legitimacy.",
    "Whether you’re able to make a $5 monthly donation, or give more — we need you, today.",
    "Yet Finchem’s antics aren’t just those of an eccentric but harmless legislator.",
    "We have just 6 days left in our fundraiser and still need to raise $37,000.",
    "Any amount of support you can spare right now will go a very long way.",
    "These are nuclear options against the very principles of democracy.",
    "Please, do what you can to help us get through this trying time.",
    "But now, we face an existential threat to our survival.",
    "The vision of a Trump or a Finchem is no different.",
    "There’s something almost quixotic in these efforts.",
    "Or witness GOP Gov.",
    "Donate Now"
  ]
}