{
  "id": 350,
  "mediaId": 2646,
  "date": "2022-04-10",
  "headline": "DISQUALIFIED: Pro-coup Republicans face ban from seeking re-election",
  "image": "https://occupydemocrats.com/wp-content/uploads/johnson-gosar-green-cawthorn.jpg",
  "link": "https://occupydemocrats.com/2022/04/10/disqualified-pro-coup-republicans-face-ban-from-seeking-re-election/",
  "mediaOutlet": "occupydemocrats.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ty Ross",
  "authorUrl": "https://occupydemocrats.com/author/tyross/",
  "termIds": [
    0
  ],
  "sentences": [
    "In March, ten Wisconsin citizens – with the backing of the Minocqua Brewing Company Super Pac – filed suit again US Senator Ron Johnson (R-WI) and Representatives Tom Tiffany (R-WI) and Scott Fitzgerald (R-WI), citing the Disqualification Clause of the 14th amendment, which states:\n“No person shall hold any office, civilian or military, under the United States, or any state, who, having previously taken an oath to support the Constitution had then engaged in insurrection or rebellion against the same or given aid or comfort to the enemies thereof.”\nOn January 4th, Sen. Johnson, along with two other GOP Senators, met with Trump, just two days before the insurrection.",
    "Legal Director for Free Speech for People, Ron Fein, had this to say:\n“The importance of defending the bedrock constitutional principle that oath breakers who engage in insurrection cannot be trusted in future.”\nThe 14th amendment had been talked about following the January 6th coup attempt, but it wasn’t until voters in NC filed suit to prohibit Congressman Madison Cawthorn from seeking re-election that people began to take the possibility more seriously.",
    "In a separate suit, Free Speech for People (FSFP), an organization formed in 2010, committed to getting money out of politics and securing and protecting the right of all citizens to vote – a right guaranteed by the 14th amendment – filed suit in Maricopa County against US Representatives Paul Gosar (R-AZ), Andy Biggs (R-AZ), and former GOP state Rep. Mark Finchem to prevent each of them from running for re-election.",
    "Tiffany publicly condemned the Capitol attack on January 6th, tweeting this in response to a post from Congressman Steve Scalise (R-LA), in which Scalise credited the Capitol Police with saving his life:\nSponsored Links\nPeaceful protest is a constitutionally guaranteed right and that right must be protected for all Americans.",
    "The “Save the Republic” rally was held before a crowd of 400, a crowd receptive to the volatile and violent rhetoric of its far-right wing speakers, including radio host Vicki McKenna whose repeated calls for violence were met with approval by the crowd.",
    "Advertisement Above\nAs more players and conspirators in the January 6th Capitol attack come to light, fed-up voters and pro-democracy advocates are holding multiple Republicans involved accountable when it comes to their re-election campaigns.",
    "Suits in Wisconsin and Arizona seek to prevent six GOP politicians who pushed The Big Lie, participated in the January 6th insurrection, and voted against certifying Biden’s electoral win from running for — or holding — office again.",
    "https://t.co/VSMDk87ivM\n— Rep. Tom Tiffany (@RepTiffany) January 6, 2021\nSponsored Links\nBut at a private Republican rally in Wausau, Wisconsin two days later, Tiffany was singing a different tune.",
    "Fitzgerald has been accused of reserving a room in DC in December of 2020 for fake Republican electors from Wisconsin to meet and cast their votes illegally for Trump.",
    "They also fought to overturn legislation in Arizona that attempts to purge voters from the rolls and restrict voting on Election Day to no later than 7 PM.",
    "While the wheels at the Department of Justice appear to be moving slowly, the court of public opinion is seeking its own conclusion.",
    "Just because this has been going on a long, long time, and we’re in a final battle, doesn’t mean we’ve lost,” McKenna said.",
    "Representative Marjorie Taylor Greene (R-GA) is also facing a suit to ban her from running for re-election.",
    "Even though the judge ruled in Cawthorn’s favor temporarily, it was enough to propel others to action.",
    "With 147 House Republicans voting against certifying the election, the battle is far from over.",
    "Finchem, with Donald Trump’s endorsement, is currently running for AZ Secretary of State.",
    "FSFP represented Mi Vota, in Texas, challenging the state’s voter suppression bill, SB1.",
    "Video of the private event was shared by multiple right-wing Facebook accounts.",
    "Add your name to call on prosecutors to ARREST DONALD TRUMP for his crimes!",
    "Both Fitzgerald and Tiffany voted against counting Biden’s electors.",
    "Sponsored Links\n“It’s the beginning of the end of this war.",
    "Republicans pushed – Americans pushed back.",
    "Watch the WSAW’s report on the rally here.",
    "We decide how it ends though.",
    "Violence is unacceptable.",
    "Advertisements"
  ]
}