{
  "id": 40,
  "mediaId": 2664,
  "date": "2022-04-22",
  "headline": "Judge dismisses case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'",
  "image": "https://www.rawstory.com/media-library/rep-paul-gosar-r-az.jpg?id=27365744&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/gosar-insurrectionist-case-dismissed/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1771,
    1911,
    1912,
    1926,
    4384,
    587,
    878,
    1163,
    4830
  ],
  "sentences": [
    "We will be appealing this decision to the Arizona Supreme Court.”\nCoury said the “ultimate trial” will be the “one decided by Arizona voters who will have the final voice about whether each Candidate should, or should not, serve in elective office.”\nArizona Mirror is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "“Arizona’s election challenge framework is ill-suited for the detailed analysis of the complex constitutional, legal and factual issues presented in this case.”\nThe lawsuits are part of a growing legal effort to use the Fourteenth Amendment to disqualify candidates because of their support of the January 6 attack, claiming they are “insurrectionists” and thus unable to hold public office.",
    "“Moreover, a state judicial trial relating to the qualifications of Rep. Biggs and Rep. Gosar arguably implicates the doctrines of federalism and separation of powers between the branches of the government.”\nDespite the court dismissing the case, Coury made it clear that it was not giving an opinion on the trio’s involvement in Jan. 6 or that they still may face legal repercussions.",
    "In his advisory opinion, Coury noted that Finchem, Gosar and Biggs have not been “charged with or convicted of any state or federal crime that relates to insurrection or rebellion.”\nBoth Biggs and Gosar argued that only Congress has the constitutional power to judge the qualifications of its members, an argument that Coury found persuasive.",
    "Free Speech For People, the group behind the suits, has made a similar challenge in the past: It sought to have North Carolina U.S. Rep. Madison Cawthorn barred from that state’s ballot on the grounds that he is disqualified by the Fourteenth Amendment.",
    "Indeed, there may be a different time and type of case in which the Candidates’ involvement in the events of that day appropriately can and will be adjudicated in court.”\nFree Speech For People told the Arizona Mirror it intends to appeal.",
    "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. Mark Finchem from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "“To be clear, it is a mistake to conclude that the Court is opining that the Candidates’ involvement in the events of January 6, 2021 never can be subject to any judicial review,” the judge wrote.",
    "“It would contradict the plain language of the United States Constitution for this Court to conduct any trial over the qualifications of a member of Congress,” Coury’s opinion said.",
    "But the attempt failed when a federal judge appointed by former President Donald Trump ruled that the Amnesty Act of 1872 gave amnesty to all future insurrectionists.",
    "The amendment was adopted during Reconstruction after the Civil War and was intended to bar Confederate leaders from being elected to positions of power.",
    "“This Court will follow the restrained and judicious lead of the federal courts,” Maricopa County Superior Court Judge Christopher Coury wrote.",
    "A candidate who has taken an oath of office and then engaged in insurrection has no place on a future Arizona ballot.",
    "“Arizona is not exempted from the mandate of Section 3 of the Fourteenth Amendment to the U.S. Constitution.",
    "Biggs and Gosar are seeking re-election, while Finchem is running for secretary of state.",
    "“This ruling is contrary to the law,” the organization said in a statement.",
    "Contact Editor Jim Small for questions: info@azmirror.com.",
    "“This decision should not be misconstrued in this way.",
    "Arizona Mirror maintains editorial independence.",
    "Follow Arizona Mirror on Facebook and Twitter."
  ]
}