{
  "id": 4759,
  "mediaId": 2662,
  "date": "2022-02-19",
  "headline": "Rep. Mark Finchem Receives Subpoena from Liz Cheney’s Jan 6 Gang – He Did Nothing Wrong But That Doesn’t Matter",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/BC1EAB94-DBDC-49C4-AB9D-BBCA6E0DC70E.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/rep-mark-finchem-receives-subpoena-liz-cheneys-jan-6-gang-nothing-wrong-doesnt-matter/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/joehoft/",
  "termIds": [
    1771,
    1872,
    2201,
    2298,
    3267,
    878,
    1094,
    4830,
    5128
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nBREAKING: THE LIST – Nearly 700,000 Maricopa County Ballots Identified with Issues from the Audit and Separate Canvassing Work to Date\nNow Liz Cheney and her corrupt gang in the DC House are after Finchem.",
    "20220211_Verzon Subpoena Redacted by Jim Hoft on Scribd\nMark shares:\nThese Marxists seek only to crush good people doing the right things for the right reasons.",
    "So they are coming after Finchem to harass him and punish him for standing up for the truth against the seditionists who stole the 2020 Election.",
    "The corrupt and unconstitutional committee is moving forward with its harassment of Americans who worked to address the stolen 2020 Election.",
    "Thousands of issues concerning hundreds of thousands of ballots were eventually uncovered in the work performed in Arizona.",
    "Their requests are based on lies – the biggest being that the 2020 Election in Arizona was not a complete fraud.",
    "You can help Mark stand up to Liz Cheney and her corrupt gang in DC by giving to Mark’s GiveSendGo defense fund.",
    "He assisted with the election review with President Trump’s team after the 2020 Election in that state.",
    "Liz Cheney’s Jan 6 Committee continues its assault on good Americans who want free and fair elections.",
    "Below is the Jan 6 committee’s subpoena of Finchem’s phone records.",
    "Below is the Jan 6 subpoena sent to Representative Finchem.",
    "In Arizona Rep. Mark Finchem was the leader in this effort.",
    "They are terrified of people like me who won’t be bullied.",
    "Their requests are lengthy, unreasonable and disgusting."
  ]
}