{
  "id": 482,
  "mediaId": 2689,
  "date": "2022-04-19",
  "headline": "Dems Already Infiltrating For 2024 Election",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/dems-already-infiltrating-for-2024-election-474256/",
  "mediaOutlet": "teaparty.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1414,
    1771,
    305,
    4814,
    4977,
    5145,
    5402
  ],
  "sentences": [
    "On Monday, Politico reported “The program would recruit candidates in 35 states for everything from county probate judges in Alabama to county clerks in Kansas and county election board members in Pennsylvania — all offices that handle elections and will be on voters’ ballots between now and 2024.”\n“Spearheading the effort is Run for Something, a Democratic group that launched soon after Donald Trump’s 2016 presidential victory to recruit candidates for local elections,” it said.",
    "https://t.co/FimoHLFNpm https://t.co/5eH3DmZYSA\n— Mark Finchem (@RealMarkFinchem) April 7, 2022\nSpecial Counsel Michael Gableman says Facebook CEO's $8.8 million into Wisconsin's Democrat cities was election bribery in violation of the law pic.twitter.com/pDBzOpZulG\n— Liz Harrington (@realLizUSA) March 1, 2022\nIt’s frustrating to read, isn’t it?",
    "The outlet shared a Run for Something memo that read, “The left is decades behind in investing in the local infrastructure needed to fight back against emerging anti-democracy forces on the right.”\n“Taking over our election administration infrastructure at the local level is our last best option.",
    "The left has claimed incessantly that the 2020 election was the “most secure in US history” yet, according to Politico, the group’s intention is “to fight subversion of future election results” and is, of course, only being pitched to Democratic donors.",
    "“Now, the group plans to raise $80 million over the next three years for this push, which would include at least a hundred staffers to support those candidates in-state, according to details and donor memos” shared with Politico.",
    "Run for Something was co-founded by Amanda Litman and Ross Morales Rocketto who are calling the candidate recruiting project “Clerk Work.”\nIn their deranged minds they actually believe they’re fighting for democracy.",
    "“Election subversion in 2024 is not going to be a mob storming the Capitol, it’s going to be a county clerk in Michigan or a supervisor of elections in Florida who decides to f*** the whole thing up,” Litman said.",
    "They’ve now got their sights set on 2024 and you can be sure they’re going to do everything they can think of to make sure that election is anything but fair, free, or secure.",
    "A Democratic group has launched a three-year program aimed at recruiting and training 5,000 candidates for local offices in charge of administering elections.",
    "Given the fact that absolutely nothing has been done to rectify the 2020 stolen election, it’s no wonder Dems are feeling emboldened to steal the next one.",
    "The left literally stole the election from the American people and then have the nerve to claim they’re the ones defending it!",
    "No matter how many barriers you employ, it does not take away from the fact that the election was irredeemably compromised.",
    "There is still massive amounts of evidence piling up that proves the 2020 election was rigged and stolen by the left.",
    "Be vigilant in local and state elections and remember to VOTE in every election no matter how small you think it is.",
    "These jobs should be non-partisan yet here are the Democrats, shamelessly recruiting operatives to do their bidding.",
    "“The only way to make long-term democracy protection is by electing people who will defend democracy.”\nTap dancing.",
    "If the 2020 election was so safe and secure then why is there any need for Democrats to take any action at all?",
    "(TeaParty.org Exclusive) – The Democrats stole the 2020 election but they were only just getting started.",
    "If we want to win, we need to go big quickly.”\nThese people are evil.",
    "They are destroying democracy all in the name of saving it.",
    "We cannot allow these people to do it again in 2024.",
    "Read my Resolution to #decertify.",
    "Absolutely maddening.",
    "It’s truly sick.",
    "Copyright 2022.",
    "TeaParty.org"
  ]
}