{
  "id": 4822,
  "mediaId": 2662,
  "date": "2022-02-15",
  "headline": "204 Legislators Call For 50-State Audit, Decertification Where Appropriate, and Possible Convening of the US House of Representatives",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/Screenshot_20210924-205039_Twitter.jpg",
  "link": "https://www.thegatewaypundit.com/2022/02/204-legislators-call-50-state-audit-decertification-appropriate-possible-convening-us-house-representatives/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    3064,
    59,
    75,
    81,
    977,
    1094,
    1163,
    4830
  ],
  "sentences": [
    "WATCH: AZ State Senator Wendy Rogers: 186 Legislators From 39 States Call For 50 State Audit – Arizona Looks To DECERTIFY\nLast week, Rogers tweeted,\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nBREAKING 204 Legislators from Multiple States Write a Letter to the American People Calling for a 50-State Audit, Decertification Where Appropriate, and Possible Convening of the US House of Representatives\nBREAKING 204 Legislators from Multiple States Write a Letter to the American People Calling for a 50-State Audit, Decertification Where Appropriate, and Possible Convening of the US House of Representatives (2/2) pic.twitter.com/guD71Bauie\n— Wendy Rogers (@WendyRogersAZ) February 10, 2022\nMassive evidence of voter fraud in Arizona’s 2020 election was discovered, and the Arizona Attorney General has opened a criminal investigation.",
    "https://t.co/nDKQe9zCux\n— Mark Finchem (@RealMarkFinchem) February 14, 2022\nNo matter where you live, sign Arizona State Rep. Mark Finchem’s petition to decertify the fraudulent 2020 election and strongly encourage your state legislators to sign State Senator Rogers’ letter to audit 50 states.",
    "The Gateway Pundit has reported on State Senator Rogers’ letter to the American People Calling for a 50-State Audit, decertification where appropriate, and possible convening of the U.S. House of Representatives to determine the rightful winner of the 2020 election.",
    "Last Monday, Arizona State Representative Mark Finchem introduced a resolution to decertify three county elections in Arizona and reclaim the fraudulent Presidential Electors.",
    "Arizona State Senator Wendy Rogers’ historic movement to audit all 50 states and decertify fraudulent elections continues to grow.",
    "Arizona House Speaker RINO Rusty Bowers mocked this resolution after siding with Democrats since November 3rd, 2020.",
    "Contact Rusty Bowers and strongly encourage him to support the decertification of Arizona’s fraudulent election.",
    "I have 10,500 signatures on this petition to decertify Arizona's 2020 election.",
    "Please sign this petition and help me get the army I need to get this done.",
    "I am getting push back from Rusty Bowers.",
    "We need 1 million signatures ASAP."
  ]
}