{
  "id": 4886,
  "mediaId": 2594,
  "date": "2022-02-15",
  "headline": "Capitol riot committee subpoenas Trump campaign officials and state lawmakers involved in sham elector plot",
  "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2021/01/19/19/trump-tiny-desk.png?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/jan-6-committee-subpoena-gop-trump-b2016028.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Feinberg",
  "authorUrl": "https://www.independent.co.uk/author/andrew-feinberg",
  "termIds": [
    1771,
    2201,
    2668,
    3669,
    3731,
    3975,
    1124,
    4830
  ],
  "sentences": [
    "“The Select Committee has heard from more than 550 witnesses, and we expect these six individuals to cooperate as well as we work to tell the American people the full story about the violence of January 6th and its causes.”\nMr Thompson on Tuesday issued subpoenas to Michael Roman and Gary Brown, the election day operations director and deputy director for Mr Trump’s doomed re-election campaign demanding production of documents to the panel by 1 March and appearances to give evidence on 14 and 9 March, respectively.",
    "In a letter to the former Trump campaign officials, Mr Thompson said the committee’s probe has “revealed credible evidence” that both men “were aware of, and participated in, efforts to promote unsupported allegations of fraud in the November 2020 Presidential election and encourage state legislators to alter the outcome of the November 2020 election by ... appointing alternate slates of electors to send competing electoral votes to the United States Congress”.",
    "In a statement, select committee chair Bennie Thompson said the panel is “seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans,” which were central to Donald Trump’s push to overturn the 2020 election and install himself in the White House for a second term against the wishes of American voters.",
    "Mr Thompson also asked about a further text message to the official in which she reportedly said: “I know you don’t want to be the remembered as the guy who led the charge to certify a fraudulent election,” as well as Ms Ward’s role as a signer of one of the forged electoral certificates and about a tweet she sent during the 6 January riot urging then-vice president Mike Pence to “send the elector choice back to the legislatures”.",
    "Mr Thomson informed Mr Roman and Mr Brown that the committee has obtained “communications” which reflect their participation in “a coordinated strategy to contact Republican members of state legislatures in certain states that former President Trump had lost and urge them to ‘reclaim’ their authority by sending an alternate slate of electors” for the defeated president.",
    "In a letter to Ms Ward demanding she produce documents to the committee on 1 March and appear to give evidence a week later, Mr Thompson said the committee wants to know about text messages she reportedly sent to an Arizona election official asking them to “stop the counting” after Fox News and the Associated Press called the 2020 race for Mr Biden.",
    "Both Mr Mastriano and Mr Finchem were avid promotors of Mr Trump’s false claims of election fraud in the months between his loss to Joe Biden and 6 January 2021, the day of the quadrennial joint session at which Congress certifies the results of the electoral college and declares who the next president and vice president will be.",
    "The House select committee investigating the 6 January insurrection has issued subpoenas to a group of state lawmakers, Republican Party officials, and Trump campaign operatives who were allegedly involved in plans to send forged electoral college certificates from swing states to the National Archives in late 2020.",
    "“We would like to better understand these and other statements, events that you witnessed or in which you participated, and communications we believe you may have had with national, state, and local officials and others about the outcome of the November 2020 election and the events of January 6, 2021,” he wrote.",
    "In a letter to Mr Mastriano, Mr Thompson noted that the committee has learned that the Pennsylvania lawmaker “[had] knowledge of and participated in a plan to arrange for an alternate slate of electors to be presented to the President of the Senate on January 6, 2021” and spoke with Mr Trump about his plans.",
    "He also said investigators “understand” Mr Mastriano undertook the activities under investigation based on his belief in a controversial constitutional theory which holds that state legislatures have “the sole authority to direct the manner of selecting delegates to the Electoral College”.",
    "To Mr Mastriano, he said the committee “understand[s]” he was “present during the attack on the U.S. Capitol on January 6, 2021, and that you witnessed ‘agitators...getting in the face of the police’ and ‘agitators...start pushing the police up the [Capitol] steps’”.",
    "Ms Cox, whose term as Michigan’s GOP chair ended in February 2021, is said to have witnessed Trump attorney Rudy Giuliani pressure Wolverine State lawmakers to ignore Mr Biden’s 2020 election win and refuse to certify it, calling certification a “criminal act”.",
    "Mr Thompson further stated in letters to both lawmakers that the committee is aware that each was present at the Capitol on 6 January — the day of the worst attack on the US legislature since the 1814 burning of Washington.",
    "He added that it “appears” Mr Roman “helped direct” and Mr Brown “helped manage” Trump campaign staffers involved in the effort to send sham electoral certificates to the National Archives for transmittal to Congress.",
    "Ms Ward, a physician and former Arizona state senator, has served as the Arizona Republican Party’s chair since 2019, and was a losing primary candidate in the past two Arizona Senate races.",
    "Mr Thompson also issued subpoenas demanding documents and testimony from Laura Cox and Kelli Ward, the former and current chairs of the Michigan and Arizona state Republican parties.",
    "“The Select Committee is seeking information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election,” Mr Thompson said.",
    "Two Republican state lawmakers — Pennsylvania senator Doug Mastriano and Arizona senator Mark Finchem — also received subpoenas from Mr Thompson on Monday.",
    "“We have an interest in understanding these activities and the theories that motivated them,” he added."
  ]
}