{
  "id": 4930,
  "mediaId": 2578,
  "date": "2022-02-17",
  "headline": "EXCLUSIVE: Cyber Ninjas CEO Doug Logan Spoke Twice With Arizona Election Fraud Investigators: “Last Time I Spoke With Them They Indicated That They Were Starting To Wrap Up, We Should Have The Results Relatively Soon”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/34C6A38D-AA35-44DE-AC82-FD2FF3FDC56B.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/exclusive-cyber-ninjas-ceo-doug-logan-spoke-twice-arizona-election-fraud-investigators-last-time-spoke-indicated-starting-wrap-result/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1771,
    2725,
    2935,
    283,
    4830,
    5128
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nEXCLUSIVE – ELECTION FRAUD ON VIDEO: Maricopa County Election Workers CAUGHT RED-HANDED Deleting “Archived” Files From Server Before Delivery To Auditors\nAuditor, Doug Logan gave The Gateway Pundit a huge update on the Attorney General’s investigation.",
    "Maricopa County failed to record the number of ballots on 1,514 out of 1,895 unique chain of custody documents and failed … Continue reading\nFor months, Attorney General Brnovich has been executing a criminal investigation into the fraudulent 2020 election.",
    "Finchem’s Obviously Unconstitutional And Profoundly Unwise Proposal Will Receive All The Consideration It Deserves”\nContact Arizona State Legislators and urge them to support the decertification of Arizona’s fraudulent 2020 election.",
    "The full forensic audit of Maricopa County, completed in part by Cyber Ninjas and Doug Logan, discovered evidence of over 700,000 ballot discrepancies in Maricopa County alone.",
    "He has received mountains of evidence, including video footage of elections workers caught red-handed deleting files from the elections server before the audit began.",
    "Arizona State Representative and American Hero Mark Finchem recently introduced a resolution to set aside and decertify three 2020 county elections in Arizona.",
    "Cyber Ninjas CEO Doug Logan has twice been pulled in for questioning by investigators with Arizona Attorney General Mark Brnovich’s Election Integrity Unit.",
    "Last time I spoke with them they indicated that they were starting to wrap up the investigation, and we should have the results relatively soon.",
    "Another recent investigation found an additional 740,000 ballots lacked chain of custody documentation in Maricopa County.",
    "740,000 ballots were accepted and counted without the proper chain of custody documentation in violation of Arizona Law.",
    "I’ve talked with them twice, and I’m aware of quite a few other people they’ve reached out to and have interviewed.",
    "A new report from Verity Vote provides massive evidence of law violations in Maricopa County’s 2020 election.",
    "In response, House Speaker Rusty Bowers said this was unconstitutional, and he is now trying to stop it.",
    "Doug Logan: The attorney general appears to be doing a thorough investigation.",
    "He spoke with Special Agent Roger Geisler and multiple other special agents.",
    "Logan told us that his last meeting with investigators was on January 28th.",
    "Arizona House Speaker Turncoat Rusty Bowers: “Mr.",
    "The results could not come sooner."
  ]
}