{
  "id": 4943,
  "mediaId": 2592,
  "date": "2022-02-16",
  "headline": "Trump Picks Anti-Vaxxer Who Claims COVID-19 Doesn't Exist For Arizona Sec. Of State",
  "image": "https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2021/11/02/former-us-president-donald-trump-has-not-shown.jpg",
  "link": "https://www.ibtimes.com/trump-picks-anti-vaxxer-who-claims-covid-19-doesnt-exist-arizona-sec-state-3403386?utm_source=Public&utm_medium=Feed&utm_campaign=Distribution",
  "mediaOutlet": "IBTimes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Danielle Ong",
  "authorUrl": "https://www.ibtimes.com/reporters/danielle-ong",
  "termIds": [
    1771,
    2201,
    80,
    4817,
    4830
  ],
  "sentences": [
    "Trump endorsed his vocal supporter Rep. Finchem in Sept. 2021\nFinchem has repeatedly shared COVID-19 conspiracies\nFinchem was also spotted near the Capitol during the Jan. 6 insurrection\nFormer President Donald Trump has chosen Rep. Mark Finchem, R-AZ, as his top pick for Arizona’s secretary of state position — a lawmaker known for repeatedly spreading misinformation about the COVID-19 pandemic and vaccines.",
    "Trump first endorsed Finchem to be the next secretary of state in Arizona in September 2021, calling him a “patriot” who loves “our military and our vets.” If he is elected, Finchem will become the first in the line of succession for the governorship.",
    "In July 2021, Finchem also shared an article from a conspiracy website Rense claiming that COVID-19 vaccines would shorten the life expectancy of its recipients to only two years, adding that the shots have the ability to alter human blood cells.",
    "In a separate post in August, Finchem shared an image that falsely claimed that the novel coronavirus did not exist in the Canadian province of Alberta, leading health officials to lift their COVID mandates.",
    "Apart from promoting COVID-19 misinformation, Finchem also became known for peddling lies about the 2020 election and for attending the insurrection at the U.S. Capitol on Jan. 6, 2021.",
    "If this is true, and I am not saying it is or is not, then we need to brace ourselves for a new order of diseases that we have never seen before,\" Finchem wrote on Telegram.",
    "In August 2021, he shared a story on the social media platform Gab, writing a caption calling COVID-19 vaccines a “crime against humanity.”\n\"It ain't a vaccine!!!",
    "During his tenure as a state lawmaker, the Republican became known for being one of the most vocal Trump supporters.",
    "However, footage taken during the riot showed Finchem at least 100 yards away from the steps of the Capitol.",
    "The House Select Committee has issued a subpoena to state Rep. Finchem over his role in the insurrection.",
    "He initially denied ever coming within 500 yards of the Capitol on the day of the riot.",
    "\"Much more work needs to be don [sic] on the 'vaccine' than has been done.",
    "He is also known for sharing conspiracy theories about COVID-19.",
    "Finchem began serving as Arizona’s state representative in 2015.",
    "Call it what it is, a crime against humanity,” Finchem wrote."
  ]
}