{
  "id": 4946,
  "mediaId": 2822,
  "date": "2022-02-15",
  "headline": "Jan. 6 panel subpoenas Arizona's Finchem, Ward in fake GOP electors scheme",
  "image": "https://bloximages.chicago2.vip.townnews.com/tucson.com/content/tncms/assets/v3/editorial/8/90/8908e8ba-8eb7-11ec-8eb2-f74cbd1799bb/620c38dfb6b42.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize",
  "link": "https://tucson.com/news/state-and-regional/govt-and-politics/jan-6-panel-subpoenas-arizonas-finchem-ward-in-fake-gop-electors-scheme/article_455ad70e-8eb7-11ec-8860-6f9201875760.html",
  "mediaOutlet": "tucson.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Farnoush Amiri The Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We’re seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans.”\nThe individuals subpoenaed include Michael Roman and Gary Michael Brown, who served as directors for Trump's 2020 reelection campaign.",
    "WASHINGTON — The House committee investigating the U.S. Capitol insurrection subpoenaed six more people Tuesday, including former Trump campaign members and state lawmakers, as it further expands its review into efforts to falsely declare Donald Trump the winner of the 2020 election in several swing states.",
    "Mastriano, a former Army officer currently seeking Pennsylvania’s Republican gubernatorial nomination, was among Trump’s most dedicated supporters during the 2020 campaign, helping organize and host a four-hour hearing post-election that was attended by Rudy Giuliani and that Trump addressed remotely.",
    "The latest subpoenas come more than a month after the committee issued subpoenas to 14 people over the submission of false Electoral College certificates declaring Trump the winner of Arizona, Georgia, Michigan, New Mexico, Nevada, Pennsylvania and Wisconsin.",
    "“The Select Committee is seeking information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election,\" Mississippi Rep. Bennie Thompson, the committee’s Democratic chairman, said in a statement.",
    "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. Mark Finchem and Arizona Republican Party chair Kelli Ward.",
    "The panel is seeking testimony and records from individuals who it says had knowledge of or participated in efforts to send false “alternate electors” from seven of the states President Joe Biden rightfully won.",
    "He is currently pushing a resolution in the state Legislature that seeks to overturn the state’s certification of the 2020 presidential election, listing a slew of debunked election fraud conspiracy theories.",
    "The committee believes the two men reportedly promoted allegations of election fraud as well as encouraged state legislators to appoint false slates of electors.",
    "Associated Press writers Mark Scolforo in Harrisburg, Pennsylvania, and Bob Christie and Jacques Billeaud in Phoenix contributed to this report.",
    "He has been a vocal critic of the election results in Arizona, contending despite evidence to the contrary that Trump won in Arizona.",
    "Two weeks ago, Ward and her husband filed a lawsuit against the House committee seeking to block a subpoena of their phone records.",
    "Both signed a document falsely claiming they were Arizona’s true electors, despite Democrat Biden’s victory in the state.",
    "He is also seeking the Republican nomination to run for secretary of state, Arizona’s chief election officer.",
    "They were presidential electors who would have voted for Trump in the Electoral College had he won Arizona.",
    "Messages requesting comment from Ward, Mastriano, Roman and Finchem were not immediately returned.",
    "Finchem was on Capitol grounds on Jan. 6, although he did not enter the building.",
    "No decisions have been issued in the case."
  ]
}