{
  "id": 5102,
  "mediaId": 2662,
  "date": "2022-02-23",
  "headline": "WATCH: AZ State Representative Mark Finchem On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/A5FF6F4A-54D3-406A-94C1-FF71405331BF_4_5005_c.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/watch-az-state-representative-mark-finchem-decertification-arizona-thing-left-parliamentary-tool-force-resolution-floor/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1771,
    1872,
    3064,
    3267,
    3500,
    3624,
    1163,
    4830,
    5128,
    5246
  ],
  "sentences": [
    "I was a witness to two of the four audits during and immediately after the election performed by Maricopa County, and from all that they have reviewed they have issued a report, both of their own, and concerning the accusations leveled against them by the Cyber Ninjas, who have now refused to comply with Court Orders to produce their documents but were very quick in producing accusations apart from the count report done for the Senate (which count was done by chiefly republican volunteers over a passage of months) which I beleive found that Biden won by a larger margin than that which the county had concluded.",
    "House Speaker Rusty Bowers immediately opposed decertification, saying it was “obviously unconstitutional and profoundly unwise.”\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nBowers later sent an email to his constituents dismissing the countless elections law violations resulting in hundreds of thousands of illegally counted ballots and saying there was no proof of fraud.",
    "I asked for proof of the allegations that several thousand dead people voted, many thousands of illegal citizens voted, more thousands of people voted in more than one county, and even more thousands voted and moved residence thereafter…(which isn’t a crime by the way).",
    "I was as impressed with it as I was with Mr. Giulianni who promised the same proof and gave me even less, as well as others throughout the last year who have screamed, and threatened, and picketed and harrassed me and others for not accepting these obvious proofs.",
    "It has no associated explanation, but it is the TRUE PROOF that was produced for me, with a daily flurry of accompanying emails from the friends of some candidate that must have reported the delivery of the proof…by a staff member of the House I presume.",
    "You’re saying after he saw the information, he said it’s unconstitutional, we’re not going to do this I want to make sure your belief is he’s had a chance to review the information and that’s when he came back and said, Hey, sorry, not sorry.",
    "One transcript of a committee hearing in Washington (I believe), AND…\nAbout one hundred copies of forms used in the processing of ballots from somewhere, someplace, sometime which were filled or used whenever a ballot container was opened.",
    "And he’s claiming that he had hoped to see names of the villains, and all that and he’s writing to these constituents saying there’s there’s no evidence there, and that the move is unconstitutional.",
    "One transcript of an apparent interview with Congressman Biggs on the subject – who did vote to decertify the election results of the 2020 election from ballots cast by 3.3 plus million Arizonans.",
    "It is extremely comprehensive, and even found, I believe, by reviewing films of the counting that one stack of 50 ballots was counted twice due to the error of a tired worker – a human.",
    "From: Russell Bowers <RBowers@azleg.gov>\nTo: Constituent\nDate: 02/20/2022\nSubject: RE: To Az Representatives\nDear constituent,\n15 months those who cried foul wanted an audit.",
    "There were some 27 or so ballots that were cast by someone other than the person named on the envelope, and those names were sent to the Attorney General for prosecution.",
    "I am supposed to decertify an election that elected Mr. Finchem as well as Mr. Biden…without reviewing the names of all these lawbreaking people or how they voted…??",
    "I have no knowledge of Pima county and the “Republican, Democrat, and Independent/Parties not determined” volunteers who manned the voting centers and precincts etc.",
    "Arizona State Representative Mark Finchem appeared on Steve Bannon’s War Room today to give updates on his push to decertify Arizona’s fraudulent 2020 election.",
    "I have staunchly asked for proof of the ongoing allegations even up to last week of a reputed former Trump lawyer who apparently works closely with Mr. Finchem.",
    "Finchem: I’ve gotten emails from constituents who are saying this is what Rusty Bowers told me about the stack of information that that you dropped on his desk.",
    "The Gateway Pundit recently reported that another investigation in Maricopa County, Arizona found 740,000 ballots lacking chain of custody documentation.",
    "What I’ve invited everybody who is sending those emails to me to do, come to the house and I will show you the evidence, don’t take his word for it.",
    "I was immediately deluged with thousands of calls and emails questioning why I would dare ask for proof when it was so obvious!!!???",
    "I have talked to the authors – two lawyers – who both said you could try it and let the courts decide whether it was constitutional.",
    "One legal paper that Mr. Finchem had prepared on the subject of legislative plenary power, I believe for his legal studies program.",
    "Maricopa County has published a report which took them months to produce replying to every allegation from the Cyber Ninjas.",
    "So the only thing that we have left is a parliamentary tool where we force the resolution to the floor and we force a vote.",
    "The Gateway Pundit reported that Finchem introduced HCR2033 to set aside and decertify three county elections in Arizona.",
    "I am not sorry that I can’t do more until I receive more than this so called “evidence”, but it is enough for many .",
    "In fact, we’ve got people that are willing to pay for a public debate on this matter because it is so important.",
    "I’ll show you the evidence come down and inspect it and then you can formulate an opinion for yourself.",
    "Contact Rusty Bowers and Arizona legislators to strongly encourage their support for decertification.",
    "I took it to the United States Constitution , and the Constitution and laws of the State of Arizona.",
    "Three letters supporting the idea that the legislature could try to do it, and might be successful.",
    "I looked through it hoping to find names of the above mentioned scofflaws…and what did I find?",
    "There is my proof of the existence of thousands and thousands of law breakers above mentioned.",
    "We’ve got our constitutional scholars, we’ve got our lawyers who are on the pro side.",
    "You can go to votefinchem.com, click on news, and they’ll see the full resolution.",
    "What is going on with the decertification process in the great state of Arizona?",
    "Rusty Bowers\nRep. Finchem appeared on Bannon’s war room to tell us what’s next.",
    "They contain apparent tracking numbers associated with groups of ballots.",
    "Rusty Bowers you’re saying he just got a big pile of the information.",
    "So, it was wonderful to receive the “proof” placed on my desk!",
    "I’m waiting to see the con side and so far nobody stepped up.",
    "I did not take an oath to the Peoples Republic of China.",
    "Finchem: I introduced House Concurrent Resolution 2033.",
    "And he is making claims that it’s unconstitutional.",
    "So I’ve challenged that notion to a public debate.",
    "The Speaker of the House is refusing to hear it.",
    "Other diminimus questions were also addressed.",
    "Evidence continues to be discovered each day.",
    "there in Pima, as happened in other counties.",
    "Best wishes and thank you for your kindness.",
    "Bannon: And when can people anticipate that?",
    "Bannon: The evidence is so overwhelming.",
    "Finchem: That’s got to be a surprise.",
    "People can go and look at it online.",
    "I don’t think it’s going to happen.",
    "Bannon: One last question.",
    "Recent Posts\nContact",
    "Just not me.",
    "That’s it!"
  ]
}