{
  "id": 5223,
  "mediaId": 2748,
  "date": "2022-02-16",
  "headline": "Biden rejects Trump's executive privilege claim and orders the release of ALL White House visitor logs to the January 6 committee",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4EwL34XXC0nDwOTlqS2y5zfJ-wkp24sOs_GsgVwz-VQa3N-MlU2LEijuqsMsZUQI8BMUsWYC2CiaAjKD4Z8HN8uzYzBY4pnkQl0RaVOpJkdUi0UkeKDN2mKOFBhSwQCtC-6qNva_Nxx0u1UnIZFLYF2r5KhS4uQvQu9Nu8U=w1200-h630-p-k-no-nu",
  "link": "http://www.yourdestinationnow.com/2022/02/biden-rejects-trumps-executive.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    3232,
    3731,
    3975,
    4711,
    583,
    1124
  ],
  "sentences": [
    "Many members in Trump's circle spent considerable time at the White House in the days and weeks leading up to the January 6 riot – this includes his then-personal lawyer Rudy Giuliani, who was helping lead the legal push to challenge the 2020 results; conservative lawyer John Eastman, who was making the case that Pence could somehow stop congressional certification of the Electoral College results; and former national security adviser Michael Flynn, who was pursuing voter fraud theories.",
    "President Joe Biden rejected Donald Trump's executive privilege claim attempting to stop the National Archives from releasing White House visitor logs to the panel investigating the January 6 attack\nShe added that the records should include 'visitor logs showing appointment information for individuals who were processed to enter the White House complex, including on Jan. 6, 2021.'",
    "We're seeking records and testimony from former campaign officials and other individuals in various states who we believe have relevant information about the planning and implementation of those plans,' Committee chair Representative Bennie Thompson said in a statement.",
    "Trump campaign official Michael Roman, in charge of Election Day operations in 2020, and his deputy Gary Michael Brown, will receive a subpoena, as will Republican state lawmakers from Pennsylvania and Arizona – Douglas Mastriano and Mark Finchem, respectively.",
    "The latest subpoenas and Biden's demand for logs release comes after Special Counsel John Durham released a filing last week revealing that Hillary Clinton hired a technology firm lawyer to 'fabricate' ties between Trump's 2016 campaign and Russia.",
    "'Constitutional protections of executive privilege should not be used to shield, from Congress or the public, information that reflects a clear and apparent effort to subvert the Constitution itself,' Remus wrote to the Archives.",
    "Joe Biden is rejecting another executive privilege claim by Donald Trump as he tries to invoke the right in order to withhold the White House visitor logs from the House select committee investigating the January 6 Capitol riot.",
    "Under Biden and Barack Obama's presidencies, the White House has made its visitor logs public to aid in government transparency and gives the public a sense of who has a direct access to the country's most powerful officials.",
    "On Tuesday, the House January 6 committee hit six more people in Trump's orbit with subpoenas to testify, claiming all were involved in some way with a plan to install 'alternate electors' to challenge Biden's victory.",
    "Former President Trump is attempting to invoke executive privilege to keep the panel form obtaining the logs, just as he did with other White House documents that were turned over to the committee earlier this month.",
    "Some of the papers handed over to the select committee last month from the Trump administration were taped together by National Archives staff because they had been ripped up, the agency revealed in a statement.",
    "The Trump administration, however, said in April 2017 that their logs would be kept secret because of 'the grave national security risks and privacy concerns of the hundreds of thousands of visitors annually.'",
    "In a letter sent to the National Archives on Tuesday, Biden's White House Counsel Dana Remus told the archivist of the U.S. David Ferriero the agency should provide the material to the panel within 15 days.",
    "Remus requested the logs be turned over in 15 days 'in light of the urgency' of the committee's probe and insisted 'Congress has a compelling need' for the National Archives to disclose the documents.",
    "Two members of the Trump campaign and four high-ranking GOP officials in battleground states will be compelled to testify about their actions in the lead-up to the Capitol riot on January 6, 2021.",
    "Last month the committee subpoenaed 14 of the 84 Republicans from seven different states who served as a fake set of alternate Trump electors as part of a scheme to overturn the election.",
    "New York Times reporter Maggie Haberman writes in Confidence Man that staff would often find ripped up pieces of paper clogging the toilet and would have to get maintenance to fix it.",
    "Former Director of National Intelligence John Ratcliffe has met with Durham multiple times and claims he has 'enough evidence' to indict multiple people related to the Russia probe.",
    "Several books, reports and former staffers have alleged Trump would destroy documents and papers while president, despite his requirement to preserve all records for the Archives.",
    "The Archives turned over records to the panel in January 2022 and another 15 boxes retrieved from his Mar-a-Lago residence were turned over to the panel earlier this month.",
    "'The Select Committee is seeking information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election.",
    "While they did not say directly that they were ripped by the former president, Trump's widely known habits suggest he is the culprit of the tearing.",
    "Most recently, a book set to release in October of this year reveals that Trump would try to flush papers in a toilet at the White House residence.",
    "Giuliani is in discussions with the panel about responding to its questions, three people familiar with the matter told the Times over the weekend.",
    "Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP will also receive subpoenas.",
    "Law requires presidents preserve records related to administration activity, but the National Archives has limited enforcement over this.",
    "Last year, Biden opposed Trump's executive privilege claim over White House documents and records the committee was seeking to obtain.",
    "Mastriano and Finchem both signed a letter to then-Vice President Mike Pence on January 5 asking him to delay certifying the election.",
    "The nine-member House panel has already discovered gaps in official White House telephone logs from the day of the riot.",
    "Trump could try to block or slow the release of the logs like he did with other White House documents and materials.",
    "Trump feels vindicated by this filing due to his repeated claims that the Russia probe was a partisan 'witch hunt'.",
    "One Archives official said that the Presidential Records Act operates through more of a 'gentlemen's agreement.'",
    "The White House plans to inform Trump Wednesday morning of the rejection for his executive privilege claim.",
    "He would rip up some papers while he would send others to the Pentagon in a burn bag for incineration.",
    "Cox worked with RNC chair Ronna McDaniel to delay certification of the election results in Michigan.",
    "The committee has already interviewed over 550 people and subpoenaed dozens of others.",
    "It is still unclear how much assistance he is willing to provide in the probe.",
    "'I was proven right about the spying, and I will be proven right about 2020!'",
    "He also says the report is reason to believe his 2020 election fraud claims.",
    "Trump went to federal court to block the release, but lost his bid.",
    "Trump wrote in a Monday statement."
  ]
}