{
  "id": 5532,
  "mediaId": 2662,
  "date": "2022-02-09",
  "headline": "EXCLUSIVE: Arizona State Rep. Mark Finchem Challenges House Speaker to Public Debate On Decertification: “Here’s My Cards. I’m Waiting To See Yours.” (VIDEO)",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/C36818D2-D347-40AC-B28F-32AC976E0F71.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/exclusive-arizona-state-rep-mark-finchem-challenges-house-speaker-public-debate-decertification-cards-waiting-see-video/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1771,
    1872,
    3064,
    3267,
    3351,
    83,
    1094,
    4830
  ],
  "sentences": [
    "There’s so much more evidence that they have to go through and if what I believe is happening, the mountain of evidence, the people who had to be involved in this in order for that evidence to even exist, and I praise Congressman Andy Biggs for really putting sellers in gates and hot seat for saying, Okay, here’s your you’re telling us certain things that just don’t make sense, especially when we look at the electronic record.",
    "Okay, so if we’re a nation of laws, and we live under the rule of law, that means that when you have things that happen in an election that make that election irredeemably compromised and with the jurisprudence that is listed on the last two pages of the resolution, items 12 and 13 detail the authority under the US Constitution.",
    "So, I think that where we are at this point is, I would love to see a debate between the constitutional scholars that have backed me up that helped me put this thing together this resolution and the individuals that the Speaker is relying on, I think he’s made an unsupportable claim.",
    "Finchem’s Obviously Unconstitutional And Profoundly Unwise Proposal Will Receive All The Consideration It Deserves”\nWhen speaking to TGP correspondent Jordan Conradson, Finchem challenged Rusty Bowers and his attorneys to a public debate on the constitutionality of HCR 2033.",
    "The Gateway Pundit reported that Mark Finchem introduced HCR 2033, a resolution to set aside and decertify three 2020 county elections and reclaim Arizona’s 2020 Presidential electors using the State Legislature’s plenary powers, granted by the Constitution.",
    "There may be people that come alongside and say, “Look, we really want this to come to the floor and we want to have the opportunity to vote on it.” Beyond that, we’ll just let this thing sit for a little while and let people contemplate their next move.",
    "Speaker Rusty Bowers later told reporters that this resolution was “obviously unconstitutional and profoundly unwise” and indicated that he would not allow this bill to receive fair consideration.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nArizona House Speaker Turncoat Rusty Bowers: “Mr.",
    "And frankly, I think it would be great for us to have a public debate so that the people know what’s really going on instead of having it behind the doors of the legislature.",
    "Arizona Speaker of the House Rusty Bowers is expected to stonewall State Representative Mark Finchem’s historic resolution to reclaim Arizona’s fraudulent 2020 electors.",
    "So for the Speaker of the House to say, “well, it’s unconstitutional?” I’m happy to put my constitutional scholars and lawyers up against whoever is advising him.",
    "And anyone who denies that the evidence exists, they’re willfully disregarding the evidence that’s been turned over to the Arizona Attorney General’s Office.",
    "And I suppose that’s one of the reasons that I’ve been elevated to some sort of champion for the people who believe that justice is denied.",
    "That talks about the plenary authority of the legislature to step in, when a crime has been committed, and it affects an election.",
    "And until this is fully examined, and the people are fully satisfied, they are going to believe that justice has been denied.",
    "There will be members who are probably going to receive a lot of pressure and a lot of encouragement from their constituents.",
    "And if people want to read the evidence that is contained in the nine pages of this document, it is damning evidence.",
    "That tells me that he has every intention of blocking the passage, or at least even the consideration of ACR 2033.",
    "I mean, he’s got people from all the different investigative units who have come into the election integrity unit.",
    "He’s pulled resources from all throughout the Attorney General’s office to do what I call gang tackle this thing.",
    "The mountain of evidence, by the way, the stuff that I listed in the resolution, only scratches the surface.",
    "Do you think that this resolution will put some fire under his feet, get him moving on some kind of update?",
    "Finchem: The purpose of this body is to hear bills, to deliberate on proposals, to examine public policy.",
    "You know, there’s a lot of people who are trying to put pressure on Attorney General Mark Brnovich.",
    "Many of the things that are noted in there are crimes in the Arizona Elections Procedure Manual.",
    "Contact Rusty Bowers and demand decertification of Arizona’s Maricopa, Pima, and Yuma Counties.",
    "Finchem: I don’t know that The Attorney General needs to have fire under his feet.",
    "The document itself is an indictment of sloppy process and criminal behavior.",
    "And there’s jurisprudence that goes all the way back to the late 1800s.",
    "Frankly, I was shocked at the statement by the Speaker of the House.",
    "He has pulled resources and I have this from their internal folks.",
    "But that seems to have been how it’s always played out.",
    "Conradson: What about Attorney General Brnovich?",
    "It’s time to lay our cards on the table.",
    "In that exchange, that too is evidence.",
    "Now, was that the intention of this?",
    "I’m waiting to see yours.",
    "This is not going away.",
    "What’s the next step?",
    "Here’s my cards.",
    "That’s right.",
    "602-926-3128",
    "Okay.",
    "Now.",
    "No."
  ]
}