{
  "id": 5556,
  "mediaId": 2578,
  "date": "2022-02-06",
  "headline": "TOMORROW: AZ Senate Government Committee Considers 14 Election Integrity Bills – Drive-Up Voting; Prohibition, Voting; One Day Only; Holiday",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/389B6A2C-B256-43BC-AF49-498C2C4F7B37.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/tomorrow-az-senate-government-committee-considers-14-election-integrity-bills-drive-voting-prohibition-voting-one-day-holiday/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1771,
    1872,
    2076,
    3267,
    75,
    1094,
    1171,
    4830
  ],
  "sentences": [
    "EXCLUSIVE: AZ State Rep. Mark Finchem Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nAZ Senate Republicans are pushing for serious election reform and decertification of the 2020 election.",
    "SB1357\n____\nelection equipment; certification; results (Townsend: Borrelli, Livingston, et al)\nThe Gateway Pundit reported that Arizona State Representative Mark Finchem is working on a resolution to reclaim the fraudulent 2020 electors in Arizona.",
    "The Arizona Senate Government committee, chaired by State Sen. Kelly Townsend, Wendy Rogers, Sonny Borrelli, and Warren Petersen, will convene on Monday to consider 19 bills, including 14 new election integrity laws.",
    "These bills will focus on chain of custody, election equipment, early voting, election server passwords, precinct voting, one-day voting, and one bill to make election day a state holiday.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nView the full agenda here.",
    "Democrats are mobilizing to stop election integrity bills from passing so that they can continue to steal elections moving forward.",
    "All Arizona patriots need to show up to the Senate Government Committee at 2 pm and speak on behalf of election security.",
    "Some RINOs in the legislature have publicly opposed decertification or reclaiming Presidential electors.",
    "These bills will address problems discovered during the full forensic audit of Maricopa county.",
    "Contact ALL Arizona State Legislators to demand a recall of Arizona’s fraudulent electors.",
    "The Gateway Pundit will provide coverage of this hearing and its outcomes.",
    "Tune in for updates."
  ]
}