{
  "id": 561,
  "mediaId": 6746,
  "date": "2022-04-13",
  "headline": "Democrats Attempt To Kick Out Two-Pro Trump Representatives, Arizona Lawmaker as Panic Sets in Before 2022 Midterm Elections",
  "image": "https://1075914428.rsc.cdn77.org/data/images/full/270071/democrats-attempt-to-kick-out-two-pro-trump-representatives-and-arizona-lawmaker-as-panic-sets-in-before-2022-midterm-elections.jpg",
  "link": "https://www.hngn.com/articles/241588/20220413/democrats-attempt-kick-out-two-pro-trump-representatives-arizona-lawmaker-midterm-election.htm",
  "mediaOutlet": "hngn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Forster",
  "authorUrl": "https://www.hngn.com/reporters/ed-forster",
  "termIds": [
    1771,
    1911,
    1926,
    2201,
    3975,
    878,
    1171,
    4830
  ],
  "sentences": [
    "The Accused Politicians\nThose charged in the Superior Court of Arizona in Maricopa County are US Reps. Paul Gosar and Andy Biggs for reelection; while State Rep. Mark Finchem for Arizona secretary of state announced this by the Austin, Texas-based Free Speech For People on April 7, cited Court House News Service.",
    "Those hoping to oust the three officeholders argue that their acts invoked the seldom-used Disqualification Clause in Section 3 of the 14th Amendment, which was imposed after the Civil War to prevent former Confederates out of congress and statehouses.",
    "These are two groups who are carrying out a national campaign to ensure that election officials across the country follow the mandate of Section Three of the Fourteenth Amendment and bar elected officials who engaged in the insurrection.",
    "Midterm Elections\nUntil now, the Dems are still holding on to the capital insurrection to make allegedly false claims that Trump loyalists wanted to disrupt the electoral college; has not been proven, reported the Epoch Times.",
    "Democrats have filed a bogus case to keep me off the ballot, claiming incorrectly that I am an insurrectionist, according to Mr. Gosar, since he's got plans in the 2022 Midterm elections, noted AZ Mirror.",
    "A campaign by Free Speech for People and Our Revolution, a known leftist group, splintered from socialist Sen. Bernie Sanders's 2016 presidential campaign, is engaged in undermining these individuals.",
    "Most of the Democratic Party and GOP RINOs are still calling it either an insurrection or a coup to attack the US government; it is not valid, as Donald Trump and loyalists denied it.",
    "These democrats will try and do anything seeing the failure of the Democratic party in the White House, Congress, and Senate to stop a massacre in the 2022 midterm elections.",
    "The group charged that the representative went beyond free speech and told people to go to the National Mall rally before it led to the alleged capital breach.",
    "Both Gosar and Biggs are well-known in congress for their attempts to uncover Chinese Communist Party infiltration and meddling in American politics.",
    "Charges (PDF)that Gosar engaged in an attempt to disrupt the counting of ballots to affect the outcome of the electoral college on January 6, 2021.",
    "Leftists on the side of the Dems have sought to twist the narrative to get what they want, even inventing untrue reports to further their agenda.",
    "Democrats belonging to two leftist parties that want to eliminate GOP competition before the 2022 midterm elections is trying to do just this.",
    "They are also after ex-President Donald Trump to keep him from a possible 2024 victory that will spell doom for Joe Biden and the Dems.",
    "The Democratic party might see a massacre in the congress and Senate that will allow the GOP to start going after the administration.",
    "Their targets are two-pro Trump representatives and an Arizona lawmaker whom they saw participated in the January 6 insurrection.",
    "Relate Article: January 6 Committee Driven by Political Motives To Prevent Donald Trump From a 2024 White House Bid",
    "He added his opponents are getting desperate because, since 2010, they have lost and were beaten badly.",
    "Adding that, the rep supported the events of that day, which he was innocent of.",
    "Finchem is running for higher office on a platform of electoral integrity.",
    "Then having congress vote on fraudulent electors as alternative slates.",
    "They will even do this to win at all costs."
  ]
}