{
  "id": 5708,
  "mediaId": 2643,
  "date": "2022-02-04",
  "headline": "QAnon in 2022: Conspiracy Followers Focus on Controlling Elections and School Boards",
  "image": "",
  "link": "https://www.newsweek.com/qanon-2022-conspiracy-followers-focus-controlling-elections-school-boards-1675946",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anders Anglesey",
  "authorUrl": "https://www.newsweek.com/authors/anders-anglesey",
  "termIds": [
    2201,
    2486,
    3975,
    140,
    860,
    5086,
    5199,
    5371
  ],
  "sentences": [
    "Watkins, who has no children, recently made a series of unfounded claims during a school board meeting in Arizona where he ranted against \"communist creeps\" who were \"indoctrinating our children with transsexual propaganda\" and vaccinating children without their parents' consent.",
    "He told Newsweek: \"Whoever escapes the 2024 [Republican] primary, if there is one, is going to have to come out against the vaccine, certainly against the mandates and probably against taking the vaccine, which is a very scary and bizarre place to be in the year 2022.\"",
    "And there is support among Republicans for the unfounded election fraud claims that QAnon followers have pushed with only 21 percent of GOP supporters stating in a December 2021 University of Massachusetts at Amherst poll that President Biden \"definitely won\" in 2020.",
    "Mike Rothschild, author of The Storm Is Upon Us: How QAnon Became a Movement, Cult, and Conspiracy Theory of Everything was not surprised followers of the online movement abandoned openly mentioning its mythos as the country entered the Biden presidency.",
    "Among the Republicans who attended John Sabal's Patriot Voice event, were Arizona State Senator Wendy Rogers and Arizona State Representative Mark Finchem, both of whom continue to push the baseless claim that the 2020 election was stolen.",
    "Convinced that Biden somehow stole the 2020 Presidential Election, QAnon followers moved to entrench that idea among American conservatives with the goal of overturning the result and gaining control of American institutions.",
    "The Scottsdale Unified School District disputed the assertions made by the QAnon influencer and denied its students are learning critical race theory or are allowed to be vaccinated on-site without their parents' permission.",
    "With the movement now fractured and without guidance from the anonymous \"Q\" account, QAnon influencers ditched the terminology and consolidated their position in a bid to gain control of American institutions.",
    "In their eyes an illegitimate president sat in the White House, the predicted mass arrests of pedophiles never came to pass and a satanic cult still controlled world events—all of which are unfounded claims.",
    "They don't do it with their ideas, they do it by seizing control of the mechanisms by which we govern which are not always being looked at the way that they should.",
    "In a January 25 report, the ADL said: \"Several candidates have continued to support the conspiracy theory even as it has morphed into something less recognizable.\"",
    "He said: \"They really set this narrative up, I think, knowing that they wouldn't have very much use for a lot of the mythology of QAnon once Biden was in office.\"",
    "According to the Anti-Defamation League (ADL) at least 45 candidates running for office in 2022 \"have lent credence in some way to the QAnon conspiracy theory.\"",
    "QAnon Republican Congressional Candidate Ron Watkins, who is running to represent Arizona's second district, is listed as one of the event's featured speakers.",
    "Influencers in the conspiracy movement have also courted sitting Republican lawmakers, with several attending a QAnon conference in Las Vegas in October 2021.",
    "Sabal, who recently went by the moniker QAnon John on Telegram, will again pull the QAnon community together at an upcoming event in North Carolina in April.",
    "Adherents of the QAnon conspiracy theory are actively planning to smuggle their extreme views into American institutions as they eye routes to power in 2022.",
    "Rothschild believes ongoing vaccine hesitancy or outright skepticism has not only been embraced by QAnon adherents, but by the mainstream Republican party.",
    "Rothschild told Newsweek QAnon followers and others influenced by the movement are targeting lesser-known institutions in order to maximize their impact.",
    "People spend a lot of time in America worrying about the White House and worrying about the Senate and the Supreme Court and the filibuster.",
    "But I think they're realizing that they really can have an impact on national politics by doing it at a very small and very targeted level.\"",
    "I think you'll see more people who specifically hold power over elections who are doing that so they can rig or influence those elections.",
    "Rothschild pointed to the reaction from Republicans and QAnon supporters alike who \"booed Trump for saying he got the [COVID-19] booster.\"",
    "The author expressed concern that the apparent fusion of QAnon and Republican beliefs would make polarization in the U.S. even worse.",
    "\"So, yeah, I think it's going to make the divisions worse, the polarization worse…It's just terrible for democracy all around.\"",
    "They're finding an opportunity where people are not paying attention as much and now people are starting to pay attention.",
    "Speaking to Newsweek, Rothschild said: \"'Q' spent all of 2020 beating the drum that the election was going to be stolen.",
    "For believers of the conspiracy theory, it was the latest in a number of events that could derail the online movement.",
    "He told Newsweek: I think you'll see more people in positions of power who are working against the government.",
    "And so that if Biden was announced as the winner that by its very nature means that the election was stolen.\"",
    "He said: \"These are elections and boards and little committees that don't get a lot of national attention.",
    "\"Local governments are starting to see an influx of people pushing back against a lot of this stuff.",
    "People don't always know who's on their city council, what their local election board is doing.",
    "\"That there is no way Joe Biden could beat the great Donald Trump in a free and fair election.",
    "\"So, I think in a lot of ways these promoters have gotten very smart about this.",
    "\"I think what you're seeing is the way that a minority party exercises power.",
    "Joe Biden's inauguration was a disaster for QAnon followers."
  ]
}