{
  "id": 5944,
  "mediaId": 2594,
  "date": "2022-02-10",
  "headline": "They wanted to overturn 2020 election results. Now these candidates want to run the next elections",
  "image": "https://static.independent.co.uk/2022/02/08/18/1364898743.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/trump-2024-election-fraud-candidates-b2010588.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Woodward",
  "authorUrl": "https://www.independent.co.uk/author/alex-woodward",
  "termIds": [
    1771,
    2153,
    2201,
    3445,
    3975,
    4830
  ],
  "sentences": [
    "She also has pledged – if elected – to direct the state’s office of Attorney General to open a criminal investigation into the election, including seizing “all election material, all election equipment, and he should start questioning people immediately.”\nThe leading GOP candidate for Arizona’s secretary of state, state representative Mark Finchem, filed legislation this week to decertify the state’s 2020 election results, baselessly asserting that “illegal acts occurred” and that the outcome is “irredeemably compromised, and it is impossible to name a clear winner of the contest.”\nHis fundraising has outpaced the two leading Democratic candidates combined.",
    "But the threat has actually evolved.”\nThe former president – who launched a spurious legal and public messaging campaign to overturn results in battleground states he definitively lost to Joe Biden – has endorsed a slate of election fraud conspiracy theorists running for office to legitimise his baseless narrative and do in state capitols what his allies failed to do in court.",
    "Mr Schmidt said state and local election officials and administrators, facing rising threats based on conspiracy theories and weaponised lies, need help amplifying the truth against disinformation campaigns, “which is really difficult for us to counter.”\n“I think the way it spreads is a real concern,” Mr Schmidt told reporters.",
    "“I think we’re seeing the consequences of that.”\nMis- and disinformation campaigns across far-right media networks and social media have metastasized “into real threats and violent rhetoric targeting our elections and our election officials,” said Michigan’s Democratic Secretary of State Jocelyn Benson.",
    "States United director Joanna Lydgate has compared the prospect of putting such candidates into office to “putting arsonists in charge of the fire department.”\n“It feels in many ways like we’re facing the same threats to our elections and our democracy as we were in 2020,” she told reporters this month.",
    "Within the last few weeks, Republican gubernatorial candidate Ryan Kelley called on election workers to unplug voting machines if they suspect fraud, and Republican state senate candidate Mike Detmer called on supporters to be prepared to “lock and load” at polling places on Election Day.",
    "He admonished Republicans who are “exploiting confusion” over the state’s vote-by-mail measures, which passed with bipartisan support in Pennsylvania’s Republican-controlled legislature in 2019 before they were targeted by Trump and his allies as a baseless source of widespread fraud.",
    "State legislatures approve of the slate of Electoral College electors, who cast votes for presidential candidates based on the outcome of elections among votes in their respective states, while the governor’s office can block or approve legislation that changes how elections are run.",
    "Eleven others are running for attorney general in 10 states, while right-wing figures promote election-denying candidates to run for administrative roles at the state and local level – historically nonpartisan roles to keep the nation’s elections free, fair and running smoothly.",
    "“The ability to exploit the belief that many voters have that they know the results on election night, despite counties being prohibited from even beginning processing those mail-in ballots until election morning, created a lot of opportunity for distrust,” he said.",
    "Mr Finchem is among the candidates behind the America First coalition, which has attracted conspiracy theorists Mike Lindell and Patrick Byrne, who have helped fund several lawsuits, partisan “audits” of results and the coalition and its candidates.",
    "In several battleground states for 2022 campaigns, “fundraising in secretary of state races is two and a half times higher than it was by this point in either of the last two election cycles,” according to an analysis from the Brennan Center.",
    "Kari Lake, a former TV reporter who is among leading GOP candidates for Arizona’s next governor, has called for the imprisonment of the state’s Democratic secretary of state and characterised the results of the 2020 election as “stolen”.",
    "A governor who installs an official who would reject election outcomes “is a very concerning thing,” said Al Schmidt, a former Republican election commissioner and head of the Philadelphia-based watchdog group Committee of Seventy.",
    "A secretary of state typically serves as the senior-most election official, maintaining voter rolls, certifying the results and shaping how local elections are run, from auditing results to managing voting machines and materials.",
    "Maricopa County Recorder Stephen Richer, an elected Republican who maintains the county’s 2.6 million voter files, wrote a lengthy open letter in the wake of the Cyber Ninjas “audit” directed by Arizona’s Republican legislators.",
    "At least 51 people who denied the outcome of that election are running for governor in 24 states, and at least 21 others are running for secretary of state in 18 states, according to a report from States United Action.",
    "Voters typically “would have taken it as a given that elections would be administered in a nonpartisan manner, regardless of the identity of the administrator,” according to the Brennan Center for Justice.",
    "In Arizona, Trump-endorsed Republican frontrunners for governor and secretary of state are among leading GOP candidates in a state that has become a hotbed of conspiracy theories and election denialism.",
    "The unprecedented campaign – including a multi-state coalition under the “America First” banner – is buoyed by relatively large fundraising efforts not typically seen in lower-ballot state-level races.",
    "One in three election workers feel unsafe because of their jobs, and one in six workers have faced threats as they help run the nation’s elections, according to a 2021 report from the Brennan Center.",
    "At the former president’s first campaign-style rally of 2022 in Arizona last month, Mr Finchem said his campaign is part of a “nationwide populist movement to regain control over our government”.",
    "Arizona Republicans and right-wing operatives have spent months – and millions of dollars – analysing the outcome of the state’s election results, which have repeatedly affirmed Mr Biden’s win.",
    "In total, two out of three races for governor and secretary of state and one-third of attorney general races include a candidate who rejects the 2020 election results, according to the report.",
    "“I’m equally concerned we are so far away from the 2020 election and have so much progress to make in terms of countering not just the lies we hear but … what makes people believe these lies.",
    "Several Trump allies have entered the race for Pennsylvania’s next governor, a position that appoints the secretary of state, which is responsible for overseeing the state’s elections.",
    "Candidates who deny the outcome of free and fair elections are “willing to put their professional careers at stake” by relying on the electoral process they want to destroy, he said.",
    "That changed after 2016, when Donald Trump and his allies fuelled an aggressive disinformation campaign to undermine the outcome of the 2020 election before a single ballot was cast.",
    "Reuters also identified more than 100 threats of death or violence against election workers, and hundreds of reports of intimidation and harassment.",
    "“Elections in Maricopa County aren’t rigged.”\nTrump loyalists running for office are “revealing their true colours,” he told reporters last week.",
    "“We’re seeing lies and conspiracy theories, threats against election officials, and the now-former president who continues to stoke those flames.",
    "Meanwhile, the state’s Republican-controlled Senate launched an investigation into 2020 elections despite several audits confirming the results.",
    "Across the US, dozens of candidates who rejected the outcome of the 2020 presidential election are running for office to control the next one.",
    "He also attended the Stop the Steal rally that preceded the attack on the US Capitol on 6 January, 2021.",
    "“As much as I want to blame the former president, he really just exploited what was already there.”",
    "In all, election denialism is fuelling dozens of campaigns for public office across the US.",
    "“That’s one example of many that we’ve been living in,” Ms Benson said.",
    "“Nobody stole Maricopa County’s election,” he wrote in August 2021.",
    "“We know it and they know it – Donald Trump won,” he said.",
    "“We’ll count their ballots just the same,” he said."
  ]
}