{
  "id": 6090,
  "mediaId": 2716,
  "date": "2022-02-13",
  "headline": "Starting the steal?",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1644541439/GettyImages-1294918250.jpg",
  "link": "https://theweek.com/election/1010045/starting-the-steal",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Week Staff",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "On his popular War Room podcast, the former Trump adviser had issued a \"call to action,\" beseeching Trump supporters to volunteer at local election boards — part of a \"precinct strategy,\" aimed at taking the reins of election administration \"village by village.\"",
    "Election-integrity experts say federal legislation is needed that would restrict a state legislature's ability to insert itself into election administration or vote certification — but Senate Republicans oppose federal rules over how states run elections.",
    "In Michigan, among those running in the Republican primary is Kristina Karamo, a community college professor who has called the Jan. 6 uprising a \"false flag\" operation by leftists and says Democrats are following \"a Satanist agenda.\"",
    "In Georgia, Secretary of State Brad Raffensperger, who famously resisted Trump's entreaties to \"find\" 11,780 Trump votes, is being challenged by Jody Hice, a Trump-endorsed congressman who opposed certifying the 2020 vote.",
    "\"You have people running for these offices where the most important duty is counting the votes and accepting the results even if you don't like the outcome, and these folks don't appear to be well-positioned to do that.\"",
    "In response, Trump allies such as far-right nativist Steve Bannon have launched a campaign to replace principled officials with Trump allies, from the lowest county volunteer up to states' top election officials.",
    "In Horry County, South Carolina, a longtime Republican election official, Mike Connett, lost his position after an unprecedented crush of citizens showed up for a county convention and elected a QAnon supporter.",
    "A major reason Trump failed in his efforts to overturn the 2020 election is that state and local election officials, many of them Republicans, certified the results over Trump's objections and threats.",
    "That leaves one realistic strategy for those opposed to the MAGA organizing campaign: a counter-movement of principled Republicans and Democrats to prevent a Trumpist takeover of election machinery.",
    "In Michigan, the state Republican Party replaced Aaron Van Langevelde, a member of the state board of canvassers who cast a decisive vote to certify the state's election results in favor of Biden.",
    "It allows a state board appointed by the Republican legislature to take control of county vote tallying, and to replace a local board with a handpicked administrator who could invalidate ballots.",
    "Acolytes of Donald Trump, galvanized by his false claims of voter fraud, are laying the groundwork for overturning future elections by commandeering state and county election systems.",
    "There and in many other states, Trump-linked newcomers are filling positions vacated by veteran officials who are walking away after being inundated with threats and harassment.",
    "In Pennsylvania, hundreds of Trump supporters recruited by Stop the Steal groups won county election inspector positions in November, some through write-in campaigns.",
    "At least 148 such bills were introduced in 36 states last year, according to a report by three nonpartisan watchdog groups called \"A Democracy Crisis in the Making.\"",
    "Bills were proposed in seven states, including Arizona, Missouri, and Nevada, that would have given legislatures the power to change or overturn election results.",
    "Much of this legislation has not yet passed, but three states have enacted laws giving partisan legislators pathways to control county election administration.",
    "The most visible effort is being made by scores of Stop the Stealers who are running to be secretaries of state — in most states, the top election official.",
    "They feel Trump was defrauded of his rightful win, and that \"their involvement in upcoming elections will prevent something like that from happening again.\"",
    "An NPR analysis counts at least 20 current Republican secretary of state candidates who question the legitimacy of the 2020 election, running in 17 states.",
    "When ProPublica reached out to Republican leaders in 65 counties, 41 reported an unprecedented surge in volunteers, one unmatched on the Democratic side.",
    "In eight of the state's largest counties, Republicans have replaced members of the boards of canvassers — who certify results — with Trump partisans.",
    "Officials in many counties say they've been deluged with Trump loyalists volunteering to serve as precinct officers, many of them rallied by Bannon.",
    "Running in Arizona is Mark Finchem, a member of the Oath Keepers militia who was present at the Capitol insurrection and has links to QAnon.",
    "People were suddenly clamoring to know how they could become volunteer precinct officers, a low-level role that's never drawn much interest.",
    "Bannon's volunteer army\nFor Rick Barnes, the Republican Party chair in Texas' Tarrant County, the barrage of calls was baffling.",
    "They'd give state legislatures unprecedented power to exert control over local election boards and the certification of results.",
    "Next time, the battered guardrails that held firm in 2020 might be gone, said Wendy Weiser of the Brennan Center for Justice.",
    "Election-integrity watchdogs are sounding the alarm as Trump allies take control of swing states’ election machinery.",
    "Election-integrity watchdogs are sounding the alarm as Trump allies take control of swing states' election machinery.",
    "\"They're laying the groundwork for a slow-motion insurrection,\" said local Democratic election lawyer Mark Brewer.",
    "\"There's a lot of crazy going around,\" said Trey Grayson, a Republican former secretary of state in Kentucky.",
    "Their motivation is simple, said Palm Beach County GOP chair Michael Barnett, who's seen a similar surge.",
    "In some states, proposed new laws might help them contest or overturn any results they don't like.",
    "\"People are coming out of the woodwork,\" said Polk County, Florida, party chair J.C. Martin.",
    "If you want to read more like it, you can try six risk-free issues of the magazine here.",
    "\"We are seeing a coordinated effort by extreme Republicans to undo American democracy.\"",
    "\"We are at code red,\" said Jena Griswold, Colorado's Democratic secretary of state.",
    "\"It's about winning elections with the right people — MAGA people,\" he said.",
    "This article was first published in the latest issue of The Week magazine.",
    "Bannon, meanwhile, crows that Trump populists are making great inroads.",
    "They include Georgia, which passed a sweeping election bill last March.",
    "There are also efforts to replace lower-level elections officials.",
    "Across numerous battleground states, at every level.",
    "The reason, Barnes soon learned, was Steve Bannon.",
    "\"We've never seen anything like that before.\"",
    "\"We will have our people in at every level.\"",
    "Bannon's effort has yielded big dividends.",
    "\"This is a giant crisis,\" she said.",
    "Here's everything you need to know.",
    "How are Trump's allies doing this?",
    "What would those laws do?",
    "Where is that happening?",
    "What is the concern?",
    "What can be done?"
  ]
}