{
  "id": 6397,
  "mediaId": 2662,
  "date": "2022-01-28",
  "headline": "“I See You Are Wendy’s Puppet!” – AZ State Rep Walt Blackman and Triggered WIFE, Kristi Blackman Psycho Text TGP’s Conradson Following TGP Article on Decertification",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/walt-blackman.jpg",
  "link": "https://www.thegatewaypundit.com/2022/01/see-wendys-puppet-az-state-rep-walt-blackman-triggered-wife-kristi-blackman-psycho-text-tgps-conradson-following-tgp-article-decertification/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1872,
    2757,
    3470,
    3839,
    4586,
    4675,
    1094,
    1226
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nWithin minutes, Blackman contacted TGP’s Jordan Conradson attempting to walk back what he said and claiming he has been on the front lines for decertification, despite his near silence through the process.",
    "These letters were good for election integrity and the Arizona audit, but since 2020 we haven’t seen Blackman on the frontlines like Rep. Mark Finchem, Senator Wendy Rogers, Senator Sonny Borrelli and other election integrity heros.",
    "Kristi accused TGP of not reporting the truth, then sent screenshots of Walt Blackman’s letters to the Arizona Attorney General and a letter to Arizona Senate President Karen Fann.",
    "Blackman pledged to Conradson that he would post a Facebook live video to clarify his stance on decertification or nullification of the fraudulent 2020 election.",
    "Just a few minutes later, Walt’s wife, Kristi Blackman began repeatedly texting Conradson and continued for several hours with no response.",
    "Arizona State Representative Walt Blackman and his wife are triggered because TGP totally called Blackman out on his bs.",
    "At one point, Kristi even attacked Conradson personally and threatened that she had a surprise coming.",
    "He pointed to his voting record as proof that he isn’t a RINO but that doesn’t change what he said.",
    "Finally, after a ten minute break from her 12 hour rant, Kristi found God and came to her senses.",
    "Blackman claimed that there was nothing we could do about the stolen 2020 election.",
    "The Gateway Pundit reported on RINO comments made by Blackman during an interview.",
    "“We have to look forward” and move on from the stolen 2020 election, he said.",
    "The video now appears to have been deleted but the gesture was nice.",
    "Walt Blackman needs to remember that he works for the taxpayers.",
    "Walt couldn’t handle the criticism and his wife lost it!",
    "The Gateway Pundit doesn’t work for the Blackmans.",
    "Both letters were sent in 2020.",
    "Walt Blackman works for you."
  ]
}