{
  "id": 6436,
  "mediaId": 2662,
  "date": "2022-01-27",
  "headline": "AZ State Senator Wendy Rogers Drops 88 Bills: “We Are Going Back to In-Person One Day One Vote NO MACHINES And Paper Ballots With Watermarks”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/E6149F9E-F88D-4F58-AC37-9D9C852578F9.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/01/az-state-senator-wendy-rogers-drops-88-bills-going-back-person-one-day-one-vote-no-machines-paper-ballots-watermarks/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1872,
    3267,
    3736,
    81,
    109,
    1026,
    1094,
    1171,
    4830
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nBREAKING: Arizona Senate Committee Passes SEVEN Election Integrity Bills – Including Ballot Fraud Countermeasures, Ballot Images Will Be Public Records\nSenator Rogers tweeted that 70 election integrity bills have been proposed in the Senate so far.",
    "In order to improve the security of the ballot and election integrity, we need to move from machines to human hand counts.”\nTo quote American columnist and author William Vaughan, “To err is human, to really foul things up requires a computer.” SB 1348 returns to an election system that every American can understand: hand counting.",
    "https://t.co/8i3gN6YAkU\n— Wendy Rogers (@WendyRogersAZ) January 26, 2022\nThe full forensic audit of Maricopa County’s 2020 election provided sweeping evidence that Arizona’s 2020 election was stolen from President Trump, and the Arizona Attorney General has since opened a criminal investigation.",
    "Tuesday, January 25, 2022\nFOR IMMEDIATE RELEASE\nIn an effort to restore election integrity and to make sure all legal votes in Arizona are counted for, Senator Wendy Rogers (R-6) is introducing legislation that aims to get rid of automated voting machines.",
    "Former Maricopa County Recorder Adrian Fontes, who facilitated the shady, corrupt 2020 election, recently said that “AZ must go 100% ballot by mail.” Rogers responded by calling him a “crook” and telling him her plans for this session.",
    "EXCLUSIVE: AZ State Rep. Mark Finchem Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nWho will decertify first?",
    "SB 1348 would prohibit the use of electronic or other tabulating equipment and would require all ballots to be counted by hand for any and every state, county, city or town election.",
    "Furthermore, neither the Secretary of State, the Board of Supervisors, nor any other officer in charge of elections shall allow the use of electronic or other tabulating equipment.",
    "On Monday, this bill passed through the Senate Government Committee with six more new elections laws, including currency-grade ballot counterfraud requirements.",
    "Arizona State Senator Wendy Rogers has already proposed 88 bills for the 2022 legislative session, including legislation to ban machine counting in elections.",
    "— Wendy Rogers (@WendyRogersAZ) January 26, 2022\nOn Tuesday, Rogers announced another critical election security bill via press release.",
    "Representative Mark Finchem told The Gateway Pundit that he is currently drafting a resolution to recall Arizona’s eleven electors.",
    "We are going back to in person one day one vote no machines and paper ballots with watermarks because of crooks like YOU and Hobbs.",
    "Ballots would be counted by hand only and required to remain segregated by precinct, both before and after counting.",
    "Arizona State Legislators are now fighting to reclaim Arizona’s 2020 Presidential and Vice Presidential electors.",
    "Contact Arizona Legislators and demand a yes vote to reclaim Arizona’s fraudulently certified 2020 electors.",
    "With complicated voting systems comes complicated vulnerabilities that can be difficult to detect.",
    "This bill will require elections to be counted by hand and ban electronic tabulating equipment.",
    "One of these bills, SB1133, will ban a city, town, or school from conducting mail-in elections.",
    "“An alarming number of voting machines are vulnerable to hackers,” said Senator Rogers.",
    "We need to make bold moves to guarantee that every vote is accurately counted.",
    "Arizonans deserve a voting system they can both understand AND trust.",
    "On Monday, Senator Rogers tweeted a link to view 75 proposed laws.",
    "There are nearly 70 election bills proposed in the Arizona Senate.",
    "Contact Arizona Attorney General Mark Brnovich to demand justice.",
    "“These systems aren’t reliable and don’t have any credibility.",
    "@AZKellyT is doing a great job handling them as govt chair.",
    "The AZ Senate is so busy, going to be a lot of late nights.",
    "Even just a dozen votes can make or break a race.",
    "We are restoring the integrity of our elections.",
    "We owe this to the people of Arizona.",
    "Already, that number has grown.",
    "SB 1348 returns us to this.",
    "But it is worth it."
  ]
}