{
  "id": 6458,
  "mediaId": 2578,
  "date": "2022-01-19",
  "headline": "AZ State Rep. Mark Finchem Speaks At Save America Rally: “The Arizona Election Should Be DECERTIFIED With Cause By The Legislature”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/680B2A50-4655-4D46-B9BB-A2F57DA273D4.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/01/az-state-rep-mark-finchem-speaks-save-america-rally-arizona-election-decertified-cause-legislature/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1771,
    2201,
    23,
    81,
    83,
    4830,
    4976,
    5128
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nWhile on stage, Rep. Finchem joined State Senator Rogers in her calls for decertification of the “irredeemably compromised” 2020 Presidential Election.",
    "And yes, the unenumerated powers of the 10th Amendment do indeed give the state legislatures around this country, when they have an irredeemably flawed election, irredeemably compromised means they cannot determine who the real winner is because the election is so polluted.",
    "He also spoke about critical election reform that he has sponsored in the Arizona House, including banning voting machines, conducting regular audits, ballots with currency-grade fraud countermeasures, and making ballot images publicly available to the voter.",
    "The Gateway Pundit reported on … Continue reading\nDuring the rally, Trump-endorsed Arizona State Senator Wendy Rogers called for decertification of the fraudulent 2020 presidential election in the 2022 legislative session, which started last week.",
    "You deserve a secretary of a state who will put your interests first, who will diligently promote voter list clean up, watermarks on ballots, a verifiable audit trail, and to refer criminality to the Attorney General’s office when it’s found.",
    "LIVE-STREAM VIDEO: THOUSANDS Turn Out For President Trump’s First Save America Rally Of 2022 In Florence, Arizona – NEW Speaker List Released\nPresident Trump’s 2022 Save America tour kicks off today in Florence, Arizona.",
    "I need to have you go to VoteFinchem.com, sign my petition at the top of the page, and read the news because every single thing that I put out there is on the News tab.",
    "— Mark Finchem (@RealMarkFinchem) January 14, 2022 The gates opened at 8 am, and already there are thousands of patriots waiting for the rally to begin at 4:30 pm MST.",
    "Arizona State representative and Trump-endorsed candidate for Secretary of State Mark Finchem spoke at President Trump’s latest rally in Florence, Arizona.",
    "It is time for us, the Arizona legislature to move those counties which are irredeemably compromised into the you’re decertified section.",
    "We must take what we’ve learned in the audit and restore your confidence in your elections, but I’m going to need your help.",
    "Now, if you want to join me, and you want to help me clean this mess that Katie Hobbs and Adrian Fontes created.",
    "With all the evidence we have, the Arizona election should be decertified with cause by the legislature.",
    "I’m probably going to be the most transparent candidate you have ever seen in a political race.",
    "The Gateway Pundit reported on President Trump’s entire rally and the enormous crowd sizes.",
    "Finchem: From Maricopa County to Pima County and yes, even all the way down to Yuma.",
    "We’re always going to have voters that cheat, but we have systems that are broken.",
    "I look forward to the day that we set aside an irredeemably flawed election.",
    "God bless you, and God bless Donald Trump.",
    "This is how the people can get justice.",
    "We need to take care of those systems.",
    "We need to maintain those systems.",
    "I’m not talking about voter fraud.",
    "I’m talking about election fraud.",
    "We need to repair those systems.",
    "We have a systematic problem.",
    "That’s the election of 2020.",
    "Every news hit is out there.",
    "Trump rallies are back.",
    "I am fired up."
  ]
}