{
  "id": 6483,
  "mediaId": 2662,
  "date": "2022-01-26",
  "headline": "EXCLUSIVE: Women Fighting For America’s Jan. 28-30 Border Event Comes Under Attack from Angry Leftists and Big Tech – Organizers Vow to Push Forward — REGISTER HERE",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/4D404C6B-6645-44ED-AAA9-DE13BD200110.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/01/exclusive-women-fighting-americas-jan-28-30-border-event-comes-attack-angry-leftists-big-tech-organizers-vow-push-forward-register/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1771,
    1872,
    3267,
    4487,
    75,
    360,
    5143,
    5371
  ],
  "sentences": [
    "KEY Border Stats:\n277% YOY Increase of Southern border encounters – 458k in 2020 to 1.73M in 2021 – Link\n342% YOY Increase of unaccompanied minors crossing the border – 33k to 146k – Link\n345% YOY Increase of Criminals (including homicide, sexual offenses, burglary, and assault ) being arrested at the border from 2,400 to 10,700 – Link\nThe woke radical left doesn’t want us to see the crisis at the southern border.",
    "JAN 28-30: Women Fighting For America Announce The TAKE ACTION TOUR With AZ State Rep. Mark Finchem And General Flynn\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nAn event representative told TGP that the Payne Arena in Hidalgo, Texas holds 7,000 people, and jumbotrons will be set up for the overflow crowd.",
    "In our media appearances, we have been encouraging people who cannot personally attend the event to consider purchasing a gift ticket so we can give out more free tickets to our Veterans.",
    "WFFA has set up a Warrior Freedom Fund that gives 10% of all proceeds to help those military men and women who have been unjustly discharged for not taking the unconstitutional mandate.",
    "From the Office of Christie Hutcherson\nFounder & CEO Women Fighting For America\nOpen Border Leftists Reach New Low Attacking Veterans / First Responders FREE Tickets!!!",
    "We are going to explain why Border Security is the essence of domestic security and to support our Border Patrol Agents who are committing suicide in record numbers.",
    "We have overcome obstacles, including issues with Ticketmaster attempting to cancel us multiple times, Eventbrite not processing tickets, and servers being attacked.",
    "Incredible speakers, including Arizona State Representative Mark Finchem and General Michael Flynn, will headline the three-day event at the U.S.-Mexico border.",
    "This Friday, WFFA is sponsoring and organizing an event in McAllen, Texas highlighting the failures of the current administration on our Southern Border.",
    "The Women Fighting for America “Take Action Tour” has come under attack by woke corporations and hackers, according to WFFA founder Christie Hutcherson.",
    "The event will focus on domestic security, States’ rights, and educating citizens about what actually happens at the southern border.",
    "Nothing will stop us from standing with our Military, and nothing you can do will stop us from ensuring this event is a success.",
    "As a thank you, we are providing free tickets to our Active duty military and first responders, including border patrol agents.",
    "Our veterans who risked everything and our first responders who work tirelessly every day serving our nation DESERVE BETTER.",
    "Patriots are set to lock arms along the border in prayer for our national security, led by pastors from around the country.",
    "WFFA founder Christie Hutcherson released the following statement urging patriots to stand up to cancel culture.",
    "The Gateway Pundit announced this “historical unification event” scheduled for January 28-30 in McAllen, Texas.",
    "Since TGP reported on this event, the organizers say they have been canceled three times on Ticketmaster.",
    "Hundreds of fake accounts flooded the system for free tickets intended for veterans and first responders.",
    "This morning, hundreds of fake accounts went to Eventbrite and registered for these free tickets.",
    "Attendees will be followed up with and encouraged to take local action in their communities.",
    "Today we witnessed a new low by those who are determined this event is canceled.",
    "WFFA is an organization that is proud of our military and first responders.",
    "After moving to Eventbrite, the organizers faced another leftist attack.",
    "Nothing will stop us from going to McAllen, Texas, this weekend.",
    "This is DISGUSTING, EVIL, and should be condemned by all sides.",
    "My message to our opponents is simple – YOU WILL NOT WIN!!!",
    "We don’t just say Thank you for your service, WE ACT.",
    "WFFA wants to form the longest human border wall!",
    "This event has been under attack since day one.",
    "WE EXPECT this from our opponents.",
    "Register now at WeStandAmerica.com",
    "The event is still on!"
  ]
}