{
  "id": 6529,
  "mediaId": 2547,
  "date": "2022-01-23",
  "headline": "Acosta Drags DeSantis: He Should Send His Election Police To Mar-A-Lago",
  "image": "https://crooksandliars.com/files/mediaposters/2022/01/49387.jpg",
  "link": "https://crooksandliars.com/2022/01/acosta-absolutely-drags-politicians",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Painter",
  "authorUrl": "https://crooksandliars.com/team/red-painter",
  "termIds": [
    1301,
    1771,
    4417,
    583,
    4830,
    4977
  ],
  "sentences": [
    "Ending this exceptional monologue of the danger we face in 2022 and 2024, Jim closed with this zinger: \"You know, if Ron DeSantis wants to put that election police force to good use, he might consider sending them over to Mar-a-Lago, you know, just ask a few questions about an attempted coup.",
    "Then, he dug into the insane Georgia law that actually threatens to PUNISH people for handing out water and snacks to people waiting in long lines, lines that were intentionally made longer by legislation that cut down on polling places, saying: \"Ain't that a peach?",
    "DeSantis said, in a clip: \"To ensure that elections are conducted in accordance with the rule of law, I propose an election integrity unit whose sole focus will be the enforcement of Florida's election laws.",
    "From power grabs in state houses to \"election police forces\" similar to Nazi Gestapo to the installation of MAGA Trump lovers in positions of power in election boards in states nationwide.",
    "Jim Acosta does not pull any punches when talking about GOP-led voter suppression laws and those pushing the Big Lie as justification for disenfranchising so many Americans from voting.",
    "Then, and scariest of all, Acosta dove into the push to install MAGA Trump-loving Republicans into key secretary of state and election board positions across the country.",
    "Acosta started with this one-two punch: \"The new voting restrictions passed in those 19 GOP-led states have been predicated on the big lie that the election was rigged.",
    "In Texas, the state's Republican Party tweeted the quiet part out loud saying recently if you can wait in line for a COVID test, you can wait in line to vote.\"",
    "Even worse, the Trump-backed Georgia Governor candidate jumped on the \"election police force\" bandwagon after seeing the positive feedback DeSantis got.",
    "This will facilitate the faithful enforcement of election laws and will provide Floridians with the confidence that their vote will matter.\"",
    "He played a clip of Mark Finchem, who is another Trump-backed lunatic who loves QAnon and is running for secretary of state in Arizona.",
    "Studies in recent years have shown that voting lines are longer in minority communities.",
    "Yes, Officer Ron, I'd like to report an insurrection, the one on January 6th.\"",
    "Even more scary is this Florida \"election police force\" is being proposed.",
    "They are not going to make the same mistakes in 2022 and 2024.",
    "And if you're still saying it was rigged, please get help.\"",
    "Who will be in charge of this \"election police force\"?",
    "This is where the real danger lies, in my opinion.",
    "We need to be ready, and I fear we are not.",
    "2020 was just a practice insurrection.",
    "We all know that now.",
    "It is BAD out there.",
    "So 2 states now.",
    "Ron DeSantis?",
    "It wasn't.",
    "Topics:"
  ]
}