{
  "id": 6542,
  "mediaId": 2672,
  "date": "2022-01-23",
  "headline": "Start the Steal: New MAGA Emails Reveal Plot to Hand Arizona to Trump",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/01/GettyImages-1284490089c.jpg",
  "link": "https://www.rollingstone.com/politics/politics-features/maga-emails-arizona-trump-2020-election-1287447/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Kroll",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "He said too many questions had been raised about the integrity of Arizona’s election, and the investigation was a way to “try and see if we can reinsert some confidence in our election process.”\nSen. Borrelli, another recipient of Waldron’s emails, said the operating manual for Dominion’s equipment laid out how “data can be changed and votes switched around,” adding, “Nothing’s 100 percent secure.",
    "This time, Waldron included hundreds of pages of supporting documents purporting to describe how proprietary technology could be used to detect “kinetic markers” like folds and creases on ballots or the lack thereof, which in turn could be used to identify ballots that were “fraudulent or were not cast by a voter,” according to an attached affidavit.",
    "Waldron, who says he worked in the Defense Intelligence Agency’s clandestine service and had ties to former National Security Advisor Michael Flynn, is part of a small group of military veterans who have argued that Chinese Communist Party front groups, Venezuelans, and voting-machine companies have all contributed to vote-rigging and election fraud.",
    "As Rolling Stone has reported, private emails and text messages revealed the behind-the-scenes influence of several high-level Trump aides in Arizona’s 2021 sham election audit, including Reince Priebus, the former Republican National Committee chairman and Trump White House chief of staff, and Trump’s personal lawyer Rudy Giuliani.",
    "The gist of his plan, Waldron wrote, was this: “This will allow us to pull invalid votes out of the totals ‘By Candidate’ so that your state can certify normal elections and potentially not have to take extra legislative action.”\nSen. Borrelli forwarded this message to every Republican in the Arizona Senate, emails show.",
    "The report claims that Dominion Voting Systems’s software contained “glitches” that led to “thousands of votes being added to Joe Biden’s total ballot count.” (Dominion has refuted all such claims about its hardware and software, and sued multiple lawyers and media outlets for spreading them.)",
    "When Trump allies pursued claims of fraud in a northern Michigan county — claims later proven to be false — Friess was one of a group of Republican lawyers who traveled to Michigan in a charter jet in late November 2020, according to reporting in the Traverse City Record Eagle.",
    "A retired Army colonel who owns a bar and distillery outside of Austin, Texas, Waldron is emblematic of the crew of self-styled investigators and researchers that have emerged in the last 18 months to spout convoluted and sometimes easily debunked theories about election fraud.",
    "But while the Trump campaign knew about this plotting, it was the obscure investigators and researchers, the emails show, who made the case directly to Arizona legislators about how to find supposed fraud and potentially use that evidence to challenge the outcome.",
    "Fontes says, “This is the way the legislators got the wool pulled over their eyes.”\nA few days after receiving Waldron’s Dec. 11 email, Sen. Farnsworth announced he planned to subpoena information about Maricopa County’s software and hardware provided by Dominion.",
    "“But I cannot and will not entertain a suggestion that we violate current law to change the outcome of a certified election.”\nBut behind the scenes, as the emails show, other Republicans were discussing plans with outside activists about to challenge the outcome.",
    "The technology was complicated, but the plan was simple: Scan mail-in and absentee ballots in populous Maricopa County, remove the “invalid votes,” and recertify the state’s 2020 election count, surely declaring then-President Donald Trump the rightful winner.",
    "“These are the people the Arizona state senate relied on in pursuing this effort, which has now been thoroughly discredited, wasted millions of dollars, wasted time, and accomplished nothing other than sowing doubt about our electoral system,” he says.",
    "“This is obviously people from outside, along with Trump and his lieutenants, pushing this.”\nThis is not the first time that high-level Trump officials have appeared in documents about the Republican Party’s efforts to challenge the 2020 result.",
    "The emails show how a group of fringe election sleuths pressed state legislators on a plan to disrupt the 2020 election certification and potentially change the vote count in a battleground state that helped deliver Joe Biden the presidency.",
    "“This is part and parcel of it.”\nGates says the records also illustrate how people outside of Arizona drove the election-fraud frenzy, supplying state legislators with strategies, talking points, and reams of technical jargon.",
    "Bill Gates, the Republican chairman of the Maricopa County Board of Supervisors, was one of several election officials in Arizona who debunked many outlandish accusations of fraud and wrongdoing made by Trump and his allies.",
    "Senior Trump aides said they’d help provide legal support to Arizona Republicans; influential conservative lawyers and activists helped direct millions of dollars in funding into efforts to “audit” the 2020 vote count.",
    "Waldron would go on to write a PowerPoint presentation titled “Election Fraud, Foreign Interference & Options for 6 JAN” that described a number of ways to try to stop the certification of Biden’s election victory.",
    "State House Speaker Rusty Bowers, a Republican, refused to bow to Trump’s demands that Arizona reverse its decision to certify Biden as the state’s victor and instead deliver the state’s 11 electoral vote to Trump.",
    "Yet another person on Waldron’s Dec. 8 email was Russ Ramsland, a self-appointed election sleuth who has spread multiple election-related conspiracy theories and made fraud allegations that were later debunked.",
    "On Monday, Politico reported that Kerik had told congressional investigators that Waldron was the first to propose that Trump issue an executive order calling on the Defense Secretary to seize voting machines.",
    "“Why is he rushing to put a Democrat in office, especially when so many horrible things concerning voter fraud are being revealed at the hearing going on right now,” Trump tweeted in late November 2020.",
    "Bill Gates, the Republican supervisor in Maricopa County, and Adrian Fontes, the county’s former Recorder and a Democrat, say they spotted multiple inaccuracies and misperceptions in Waldron’s emails.",
    "Still, election-law experts say no matter the audit’s outcome, it also served to further undermine trust in the last election and supply a pretext for legal and legislative changes in the future.",
    "Sent in early December 2020, the emails cover a critical moment when the post-election push by Trump and Republican allies to find fraud and overturn the presidential election was in full swing.",
    "Bill Gates, the Maricopa Board of Supervisors chairman, says he believes the sham audit demanded by Arizona Republicans was in part fueled by the discredited claims of people like Waldron.",
    "At the time, Republican legislators faced tremendous pressure from party activists and from President Trump to find evidence of fraud that would change the outcome of the election.",
    "Three days later, on Dec. 11, Waldron wrote to three Arizona Republican lawmakers: Borrelli, Finchem, and Sen. Eddie Farnsworth, a Republican who chaired the judiciary committee.",
    "He also added what appears to be an email address for another Trump legal team volunteer who has received less scrutiny, a lawyer and one-time lobbyist named Katherine Friess.",
    "According to the newly obtained emails, Waldron contacted multiple Arizona Republican lawmakers in early December 2020 about his strategy for identifying fraudulent votes.",
    "Ellis appeared at public hearings, sometimes alongside Trump lawyer Rudy Giuliani, and amplified baseless claims about election fraud in frequent media appearances.",
    "Friess reportedly bragged to local election officials that she had dined with President Trump the night before she flew to northern Michigan’s Antrim County.",
    "Fontes, who is now running for secretary of state, says he’s never heard anyone refer to “kinetic markings” on ballots in his years as an election official.",
    "Most of the new emails — first obtained by the watchdog group American Oversight and provided to Rolling Stone — were written by a man named Phil Waldron.",
    "The emails also reveal that several Trump advisers, including campaign lawyer Jenna Ellis and legal adviser Bernie Kerik, were included in the discussion.",
    "Gates, who reviewed the emails, says they show pro-Trump activists and lawmakers “trying to figure out that hail-mary pass” to overturn the election.",
    "Waldron and his associates sent the document to multiple people, and it ultimately ended up in the inbox of White House chief of staff Mark Meadows.",
    "Kerik played a more behind-the-scenes role, emails and other records show, assisting the Trump campaign’s fruitless search for election wrongdoing.",
    "That supposed audit violated multiple best practices and procedures for handling ballots, cost millions of dollars, and reaffirmed Biden’s victory.",
    "Trump criticized Arizona’s Republican governor, Doug Ducey, for rebuffing the fraud claims and certifying Biden’s victory in the state.",
    "A diehard Trump supporter and onetime member of the Oath Keepers militia, Finchem had amplified fraud claims during the 2020 campaign.",
    "Friess’ name also appeared on the cover sheet of a “report” that Trump’s legal team provided to state lawmakers in early December.",
    "Ellis and Kerik played influential roles on Trump’s legal team after the 2020 election, and their work extended beyond Arizona.",
    "The Arizona Senate would go on to order a hand-counted audit of more than 2 million ballots cast in Maricopa County in 2020.",
    "What’s more, one state lawmaker included on the emails, Mark Finchem, is now running for secretary of state in Arizona.",
    "This scheme to subvert the election outcome in Arizona is laid out in newly released emails obtained by Rolling Stone.",
    "If people want to cheat they’re going to cheat.” (Farnsworth and Borrelli did not respond to requests for comment.)",
    "For this, Gates was called a traitor, he and his family faced harassment, and he feared for his physical safety.",
    "Multiple judges dismissed lawsuits filed by Republican groups and Trump supporters alleging fraud in Arizona.",
    "“We have the capability to identify fraudulent ballots via optical scanning technology,” Waldron wrote.",
    "Those outside investigators remain active in the growing movement to find fraud in the 2020 election.",
    "In one email, on Dec. 8, Waldron sent some of his team’s research to Arizona Rep. Mark Finchem.",
    "The documents also included operating manuals for hardware produced by Dominion Voting Systems.",
    "The select committee investigating the January 6 insurrection has subpoenaed Ellis and Kerik.",
    "“I voted for President Trump and worked hard to reelect him,” Bowers said in a statement.",
    "“They’re drawing up the hail-mary pass that obviously culminated in January 6,” he adds.",
    "Images of ballots are not a public record, as Waldron claims in one of his emails.",
    "That same day, Waldron wrote to Arizona state Sen. Sonny Borrelli, a Republican.",
    "Ellis, Kerik, Friess, and Ramsland did not respond to requests for comment.",
    "No evidence has emerged to show widespread fraud in the 2020 election.",
    "They were the ones some of our Republican state senators listened to.”",
    "A court-ordered audit of Arizona’s ballots confirmed Biden’s win.",
    "Waldron included Trump aides Ellis and Kerik on that email.",
    "Friess has claimed she had nothing to do with the report.)",
    "If Finchem wins, he would oversee Arizona’s elections.",
    "Waldron did not respond to a request for comment.)",
    "(A lawyer for Meadows said he didn’t act on it.",
    "“This was not an organic effort,” he says.",
    "“These people were the ones pushing it."
  ]
}