{
  "id": 6546,
  "mediaId": 2512,
  "date": "2022-01-31",
  "headline": "Now every day in Arizona is January 6",
  "image": "https://www.alternet.org/media-library/how-to-stop-america-s-slide-toward-tyranny.jpg?id=24477681&width=1200&coordinates=0%2C1527%2C0%2C1527&height=600",
  "link": "https://www.alternet.org/2022/01/now-every-day-in-arizona-is-january-6/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1310,
    1771,
    2201,
    2321,
    3736,
    3975,
    4226,
    4500,
    878,
    4830
  ],
  "sentences": [
    "But Republicans have proposed new restrictions that could have a profound impact sooner, including new voter-ID requirements, severe limitations on the use of drive-up voting and ballot drop boxes, and requiring all voting to be in person on Election Day.",
    "Millions more poured in from outside sources, including pro-Trump fundraising groups led by his former national security adviser Michael Flynn, Trump's election conspiracy-peddling lawyer Sidney Powell, and correspondents for the One America News Network.",
    "Moral: Even when Trump loses, he wins\nIn early January 2022, Maricopa County issued a detailed analysis demonstrating that Cyber Ninjas' report about its voting process made 22 misleading claims, 41 inaccurate claims, and 13 claims that were false.",
    "Tactic #2: If the opposing candidate wins the popular vote, disregard It\nTrump recently told the Pennsylvania GOP, \"Sometimes the vote counter is more important than the candidate... We have to get tougher and smarter.\"",
    "Ah, the good ol' days of 1958, when Arizona with its large Native American population imposed literacy tests as a prerequisite to voting, and about half of the Navajo voting-age population couldn't pass them.",
    "She claims falsely that Trump won the election, advocates the imprisonment of Hobbs for unspecified election crimes, and demands that Arizona \"decertify\" Biden's electoral victory, which is impossible.",
    "On January 7, 2022, Cyber Ninjas shut down for good after a judge fined the company $50,000 a day for failing to turn over public records in accordance with a court's ruling in August.",
    "The inexperienced firm's owner had touted Trump's election conspiracy theories and provided the ominous voiceover in \"The Deep Rig\"—a movie claiming that Trump had won the election.",
    "The mere existence of the bogus \"audit\" became fodder for Trump's talking points and spawned Republican demands for equally specious copycat audits across the country.",
    "Former President Donald J. Trump and his Republican allies are using three tactics in a nationwide, state-by-state strategy to control the outcome of future elections.",
    "\"It's clearer by the day: The people hired by the Senate are in way over their heads,\" said the Republican chair of the Maricopa County Board of Supervisors in May.",
    "Tactic #3: Bogus audits and investigations\nAfter Trump lost in Arizona, his allies focused on Maricopa County, which accounted for 60 percent of the state's total.",
    "Tactic #1: Keep voters from voting\nArizona's latest voter restriction law will remove an estimated 100,000 eligible voters from its early voting mailing list.",
    "By November 2021, a Monmouth University poll found that \"among Republicans, 32% say the so-called audit found evidence of fraud and 30% say it probably did.\"",
    "Nevertheless, in March 2021, the state senate's Republican president hired Cyber Ninjas to lead an outside audit of Maricopa County's 2.1 million ballots.",
    "It would have the power to subpoena witnesses, conduct hearings, seek a court order impounding election equipment, and make prosecutorial referrals.",
    "\"If you look at the numbers, if you look at the findings in Arizona…,\" Trump told NPR's Steve Inskeep during a phone interview on January 11, 2022.",
    "\"We need to get back to 1958-style voting,\" Arizona State Rep. John Fillmore said, defending his proposals in a committee hearing on Jan. 26, 2022.",
    "Finchem addressed Trump's crowd at the \"Stop the Steal\" rally in Washington, D.C., on January 5, 2021, and attended the January 6 insurrection.",
    "To its credit, the Republican-dominated Maricopa County Board of Supervisors withstood the pressure and certified Biden's 45,000 vote victory.",
    "When Cyber Ninjas' final report made false, misleading, and inaccurate claims about the county's election process, Trump amplified them.",
    "When Inskeep asked Trump whether GOP candidates must embrace the Big Lie to get his endorsement, he launched into praise for Kari Lake.",
    "In December, she introduced a bill that would create a new bureau in the governor's office to investigate election fraud allegations.",
    "Four days later, Lake and Mark Finchem appeared with Trump and spoke to thousands of his supporters in Florence, Arizona.",
    "They have proposed a law that would empower the state's legislature to \"accept or reject the election results.\"",
    "GOP State Sen. Wendy Rogers, a vocal supporter of Trump's Big Lie, seeks to operationalize the false claims.",
    "In June, another Arizona GOP election official blasted the audit as \"insane from a competence standpoint.\"",
    "Without answering Inskeep's question, Trump continued his monolog of false claims and then hung up.",
    "\"An empty piñata is a pretty accurate description of the 'audit' as a whole,\" the county tweeted.",
    "He ignored the firm's conclusion: Biden's victory margin in the state had increased by 360 votes.",
    "Now that she is running for governor, Trump has endorsed state Rep. Mark Finchem to replace her.",
    "Doug Ducey, who is term-limited, signed the state's official certification of Biden's victory.",
    "In 2020, Secretary of State Katie Hobbs—a Democrat—was Arizona's top \"vote counter.\"",
    "It won't begin deleting voters from the list until after the 2024 election.",
    "\"This was a corrupt election… the findings are devastating for Arizona.\"",
    "Trump still pretends that Cyber Ninjas somehow corroborated his Big Lie.",
    "To replace him, Trump has endorsed former Fox news anchor Kari Lake.",
    "If rejected, any voter could sue to request a new election.",
    "Republicans in Arizona are also working on a backup plan.",
    "The state promised to pay Cyber Ninjas $150,000.",
    "\"She's very big on this issue…,\" Trump said.",
    "\"This is not funny; this is dangerous.\"",
    "He's putting those words into action.",
    "But it was too little, too late.",
    "All are on display in Arizona.",
    "The \"audit\" became a farce.",
    "Their theme:\nThe Big Lie.",
    "Gov."
  ]
}