{
  "id": 6551,
  "mediaId": 2607,
  "date": "2022-01-25",
  "headline": "If you think 2020 chaos was bad, imagine if Trump had control of elections",
  "image": "",
  "link": "https://lasvegassun.com//news/2022/jan/25/if-you-think-2020-chaos-was-bad-imagine-if-trump-h/",
  "mediaOutlet": "Las Vegas Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Barabak",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Returning home, Finchem not only supported the supposed “audit” of Biden’s 2020 win in Arizona but also found a way to make a fast buck off the Maricopa County clown show by selling T-shirts reading “#Proveit.”\nSo naturally, when it came time to support a candidate to oversee future Arizona elections, Donald Trump went all-in for Finchem, who marinates in QAnon Kool-Aid when he isn’t grifting or hanging out with members of the right-wing Oath Keepers militia.",
    "In several of the hardest-fought 2020 battlegrounds —Nevada, Georgia, Michigan and Wisconsin, as well as Arizona — Trump disciples are running for secretary of state, a typically obscure office that has gained tremendous import as the country’s cornerstone principle of free and fair elections comes under mounting attack.",
    "Marchant recently told Steve Bannon, the podcaster, former White House strategist and accused swindler whom Trump pardoned, of a “coalition” of Republicans working “behind the scenes to try to fix 2020 like President Trump said.”\nGarbled verbiage aside, consider that statement a warning.",
    "In Nevada, Hice’s political soulmate is Jim Marchant, a former state assemblyman and candidate for secretary of state who has personal cred when it comes to making up election stuff: He unsuccessfully sued after losing a 2020 congressional race, making bogus claims of voter fraud.",
    "But ultimately, Foley said, “It is those human beings who populate the institutions that matter.”\nThe attempted takeover is separate from legislative efforts, fueled by Trump’s blabbering about supposed election fraud, that make it harder to vote.",
    "In his announcement video, Bolding stated the obvious: “Elected leaders should win on the strength of their ideas, not their ability to game the system.”\nThe fact that principle is even in question speaks to the fraught times we’re living in.",
    "Finchem, a four-term member of the Arizona House, is part of a larger effort by Trump and his acolytes to hijack the country’s election machinery by putting loyalists in charge of the balloting in key states.",
    "On Jan. 6, 2021, Arizona lawmaker Mark Finchem — a practiced peddler of nutso conspiracy theories — stood outside the U.S. Capitol and tweeted his support for the mob seeking to overturn Joe Biden’s victory.",
    "By refusing to go along, the incumbent landed himself a Trump-endorsed challenger, Rep. Jody Hice, who was among the 147 GOP lawmakers in the House who refused to certify Biden’s victory on Jan. 6.",
    "That’s why Trump dialed up Georgia’s secretary of state, Brad Raffensperger, and urged him to “find” 11,780 votes, or enough to overturn Biden’s narrow victory in the Republican-leaning state.",
    "Then, the ex-president’s agents could cause all sorts of mayhem: lawsuits, never-ending audits, voting restrictions and partisan meddling, all dressed up as administration and oversight.",
    "In most states, the secretary of state is responsible for running elections, from the local level to the White House, including how votes are cast and, crucially, how they are counted.",
    "“What happens when the People feel they have been ignored, and Congress refuses to acknowledge rampant fraud,” Finchem wrote, pushing the election lie hatched in the Trump White House.",
    "It’s the difference between a person being thwarted while attempting to break in and ransack a home and somebody being handed the keys to loot, then torch the house from within.",
    "Given the scant attention paid to secretary of state races, and the typically low voter turnout, Trump’s endorsement could carry considerable weight in Republican primaries.",
    "The district attorney in Atlanta is seeking a grand jury inquiry into the actions of Trump and others who sought to intimidate Raffensperger and undermine the election.",
    "Think of the election system as a triangle consisting of rules, institutions and human beings, said Edward Foley, an elections law expert at Ohio State University.",
    "In Arizona, the leader of House Democrats, Reginald Bolding, is one of several candidates running against Finchem for secretary of state in an open-seat contest.",
    "Nationwide, there are more than a dozen Republican candidates running who question the legitimacy of Biden’s irrefutable election.",
    "Hice referred to the insurrection as “our 1776 moment,” soiling both himself and the glory attached to that date in history.",
    "(GOP lawmakers reduced the powers of the office after Democrat Katie Hobbs pushed back against Trump’s bogus fraud claims.",
    "“A man who is tough and smart and loves our country,” the former president said at his recent rally in the Arizona desert.",
    "If you think the Trump-driven chaos that followed the last campaign was bad, 2024 could be monumentally worse.",
    "Not least, Trump loyalists would also have the opportunity to overturn any election results they don’t like.",
    "The institutions should be as nonpartisan, or at least bipartisan, as they can be.",
    "That person is usually the official responsible for certifying the final result.",
    "Mark Barabak is a columnist for the Los Angeles Times.",
    "In some states, that could be enough to get elected.",
    "The rules should be as clear as possible.",
    "It would be funny if it weren’t so scary.",
    "In many ways, it’s even more insidious.",
    "She’s now running for governor.)"
  ]
}