{
  "id": 6571,
  "mediaId": 2694,
  "date": "2022-01-15",
  "headline": "Trump Soft-Launches His 2024 Campaign",
  "image": "https://cdn.theatlantic.com/thumbor/x7TkHzc3LCUa5fF6Hf4_kEat0B4=/0x51:4405x2345/1200x625/media/img/mt/2022/01/GettyImages_1364875196/original.jpg",
  "link": "https://www.theatlantic.com/politics/archive/2022/01/trump-arizona-rally-2024-election/621244/?utm_source=feed",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elaine Godfrey",
  "authorUrl": "https://www.theatlantic.com/author/elaine-godfrey/",
  "termIds": [
    0
  ],
  "sentences": [
    "Other speakers included secretary-of-state candidate Mark Finchem, who was at the Capitol last January 6 and who often wears a cowboy hat and bolo tie despite being from Michigan; Paul Gosar, Andy Biggs, and Debbie Lesko, three Trump-loving members of Congress who voted against certifying Biden’s win in 2020; and Arizona GOP chair Kelli Ward, who has embraced numerous conspiracy theories and recently received a cease-and-desist notice from Dominion Voting Systems after accusing the company of changing 6,000 Trump votes to Biden votes.",
    "He previewed his lines of attack on Biden over Afghanistan, immigration, and inflation; recited a litany of policy changes that a Republican-controlled Congress would be able to make; and promised that “in 2024, we are going to take back the White House.” Sam and Dave’s “Hold on I’m Coming” played as he exited, and the song sounded like a promise.",
    "Although he didn’t say the words, the former president seems poised to run in two years—“Make America great again again … again,” he joked to the crowd—and tonight, his message was as clear as it was dishonest: He didn’t lose to Joe Biden in 2020, and he’ll spend the next year working to elect Republicans who agree.",
    "Trump lost Arizona by only 10,000 votes in 2020, giving him and his supporters the space, apparently, to allege that the close outcome was the result of left-wing chicanery, the result of ballot stuffing and interference by Venezuelans, among other false claims.",
    "The pair would love for Trump to run again in 2024, but they don’t think he will, and they’re not sure he’ll need to: They’re confident that he’ll be reinstated as president sometime soon, after Arizona and other states vote to decertify the election.",
    "By the latter half of the night, Lake was calling for the arrests of anyone involved in the “shady, shoddy election of 2020.”\nEverything we know about fundamentals of midterm elections suggests that Republicans will have an excellent 2022.",
    "Trump is no longer the president, and he’s been permanently banned from Twitter, which means that his accusations of fraud and tirades against insufficiently loyal Republicans have had to be expressed via emailed press releases.",
    "1 show on NBC.”) Now that the midterm season is fully under way, Trump will be out and about more often, hosting rallies and stumping for any Republicans desperate enough to lie about the election in exchange for his support.",
    "He has convinced Republican candidates all over the country—including those on stage tonight—to repeat his election lies, and convinced his rank-and-file supporters to treat those falsehoods as holy writ.",
    "The former president’s message at his Arizona rally was as clear as it was dishonest: He didn’t lose to Joe Biden in 2020, and he’ll spend the next year working to elect Republicans who agree.",
    "The pre-Trump headliner was Kari Lake, the former TV-news reporter running to replace Governor Doug Ducey; she alleges, falsely, that “bag loads of ballots” were dumped in Arizona last year.",
    "“I can’t do another three years of this.”\nThe Stohldriers’ predictions might seem bold, but the sisters were simply echoing what they’d been hearing from prominent Republicans at the rally.",
    "If Lake and the other Big Lie proponents at tonight’s rally can win their primary races, they’ve got a good shot at becoming the Grand Canyon State’s next generation of political leaders.",
    "“Kari will be incredible for election integrity,” Trump said of Lake, just after vowing to turn on her if she didn’t do “a great job.” Election integrity, he added, might be Lake’s “No.",
    "1 issue.”\nAn hour or so into his speech, Trump turned his attention to January 6, calling the storming of the Capitol an excuse for Democrats to arrest people and abuse them in jail.",
    "But at tonight’s rally, as Trump’s fans called for the arrests of poll workers and the reinstatement of the rightful president, I got the sense that this might be just the beginning.",
    "On paper, the gathering was meant as his response to the anniversary of January 6, as well as an unofficial kickoff for his efforts to support Republicans in the midterm elections.",
    "(“He’s tan, fit, has lost some weight since he left office,” Newsmax’s anchors, speculating eagerly about a 2024 announcement, trilled as Trump took the stage here.",
    "“The military has to come in and take [Biden] away.”\nBy the end of the evening, Trump was having trouble pretending that he wasn’t actively running for president.",
    "Nearly everyone I interviewed at the rally vowed to follow Trump’s lead and support only GOP candidates who endorse the false idea that he won the election.",
    "(“Kari Lake, she’s been with us from the beginning on the election fraud,” Trump gushed when he brought her back on stage for a cameo during his speech.)",
    "And when he finally appeared on stage, as Lee Greenwood played from the loudspeakers, the crowd roared as though Trump were still the commander in chief.",
    "He will in some ways be reintroducing himself to the country: Here I am, America, back after a stolen election, ready to win by any means possible.",
    "Earlier that afternoon, Ward, the state party chair, had warmed up the crowd by promising that the 2020 election results would soon be overturned.",
    "“I watched all those Republican candidates in Arizona right now covering it up,” Julie Stohldrier, who drove in with her sister, Amy, told me.",
    "They had braved the wind for hours—some waited the entire day—just to get a glimpse of the defeated former president.",
    "Trump has still been speaking directly to his most dutiful supporters through far-right media outlets, though.",
    "The difference is, what he says hasn’t quite permeated the public consciousness the same way it once did.",
    "State lawmakers who spent the past year reviewing the ballots ultimately found zero evidence of mischief.",
    "Even with power, though, they’ll still owe Trump a debt of loyalty—one that he’ll expect to be repaid.",
    "FLORENCE, Ariz.—Tonight, deep in the Arizona desert, thousands of people chanted for Donald Trump.",
    "Each of these Republicans has repeatedly echoed Trump’s false allegations of election mischief.",
    "He suggested that the FBI planted people in the crowd outside the Capitol to incite the riot.",
    "“This crowd is a massive symbol of what took place, because people are hungry for the truth.",
    "Trump has bucked the trend, only tightening his grip on the GOP in the wake of his defeat.",
    "They want their country back.”\nTonight’s rally was Trump’s first public event since July.",
    "I asked a group of older attendees if they were excited to see Trump run again in 2024.",
    "“It’s not possible,” a retiree named Michael, who declined to give his last name, said.",
    "Most losing presidential candidates are forced into quiet retirement by their parties.",
    "This is the former president’s new litmus test: You endorse the lie; he endorses you.",
    "“They’re all talk and no action.” Lake is promising action, so the sisters adore her.",
    "But the event also served as the soft launch of Trump’s 2024 presidential campaign.",
    "By this point, those lies have been circulating for what feels like forever.",
    "He mocked the police officer who shot Ashli Babbitt, and the crowd cheered.",
    "“The real insurrection took place on Election Day, November 3,” he added.",
    "Trump has been broadcasting these messages for more than a year now.",
    "Two of them argued about whether he could take office before 2025.",
    "GOP politicians across Arizona adopted Trump’s lies anyway.",
    "In this way, the former president has been off the grid.",
    "“I ran twice and we won twice,” Trump told his fans.",
    "“I think it is!” a retiree named Susan Higgins said.",
    "Trump chose Arizona for this moment for a reason.",
    "“People forget that The Apprentice was the No.",
    "But that didn’t matter to Trump’s supporters.",
    "Many of them were guests of honor tonight.",
    "“I want Trump back now,” Amy told me.",
    "Trump has had a remarkable 14 months.",
    "In this state, the Big Lie thrives.",
    "To many of them, he is.",
    "Of course they have.",
    "They all were."
  ]
}