{
  "id": 6720,
  "mediaId": 2540,
  "date": "2022-02-01",
  "headline": "Trump's PAC gave $1 million to Meadows' non-profit weeks after House formed January 6 committee",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/211215083129-mark-meadows-washington-103020-file-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/01/politics/trump-pac-mark-meadows-january-6-investigation/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Bradner",
  "authorUrl": "https://www.cnn.com/profiles/eric-bradner",
  "termIds": [
    1886,
    2201,
    4284,
    4319,
    4358,
    1163
  ],
  "sentences": [
    "Among them: Rep. Jody Hice of Georgia, who voted against certifying the election on January 6 and is running in the Republican primary against Georgia Secretary of State Brad Raffensperger, who has defended the state's election results; and Harriet Hageman, a Republican primary challenger to Wyoming Rep. Liz Cheney, who voted to impeach Trump for his actions on January 6 and is a member of the House select committee investigating the January 6 attack.",
    "Recipients also include a slate of Arizona candidates -- gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender Mark Finchem -- who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "(CNN)Weeks after the House panel investigating the January 6 insurrection was formed, former President Donald Trump's political action committee gave $1 million to the non-profit organization that employs his former chief of staff Mark Meadows, campaign finance records filed Monday night show.",
    "Trump's political organization also paid tens of thousands of dollars to law firms that represent current and former Trump aides who have fought against subpoenas issued by the House panel probing the January 6 attack.",
    "Most of the donations were for $5,000 and went to candidates who Trump has endorsed -- and who have embraced his lies that widespread voter fraud cost him the 2020 presidential election.",
    "The $1 million to Meadows' non-profit made up most of the $1.35 million in donations that Trump's PAC disbursed to political organizations and candidates in the second half of 2021.",
    "Save America PAC paid $50,000 to JP Rowley Law PLLC, which represents attorney Cleta Mitchell, who advised Trump on how to attempt to overturn the November 2020 election results.",
    "Recipients include $25,000 to Brand Woodward Law, which has represented Trump aide Dan Scavino, and $29,500 to Abel Bean Law, which represents Trump aide Taylor Budowich.",
    "In December, the House voted to recommend that the Department of Justice pursue criminal charges against Meadows for refusing to cooperate with the committee's probe.",
    "The donation came less than four weeks after the House voted to establish a select committee to investigate the January 6, 2021, insurrection at the US Capitol.",
    "Trump's Save America PAC on July 26 gave $1 million to the Conservative Partnership Institute, the group where Meadows is a senior partner.",
    "The recipients include Republicans who have made clear their willingness to attempt to overturn voters' will.",
    "Trump's political organization has amassed $122 million in cash reserves, his team announced Monday."
  ]
}