{
  "id": 6765,
  "mediaId": 2662,
  "date": "2022-01-27",
  "headline": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/walt-blackman.jpg",
  "link": "https://www.thegatewaypundit.com/2022/01/audio-rino-arizona-state-rep-walt-blackman-bashes-rep-finchem-claims-decertification-impossible-cant/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1771,
    2725,
    3470,
    75,
    83,
    878,
    1147,
    4830,
    5402
  ],
  "sentences": [
    "EXCLUSIVE: AZ State Rep. Mark Finchem Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nBut RINO Arizona State Representative and U.S. Congressional Candidate Walter Blackman, says this is not a possibility.",
    "The Arizona audit report with evidence of elections law violations and hundreds of thousands of fraudulent ballots was delivered to Arizona Attorney General Mark Brnovich over four months ago and a criminal investigation is ongoing.",
    "The Arizona legislature now looks to reclaim Arizona’s eleven stolen 2020 presidential electors after the Wisconsin Assembly voted to move forward Rep. Ramthun’s resolution to reclaim Wisconsin’s electors.",
    "— Andrew Jackson (@DrAndrewJackson) January 27, 2022\nThe U.S. Constitution grants plenary power to the State Legislature to oversee elections and choose or withdraw their state’s electors.",
    "Arizona State Representative and Trump-endorsed candidate for Secretary of State Mark Finchem is currently drafting a resolution to decertify Arizona’s 2020 Presidential election.",
    "After revealing that he was not a supporter of Finchem for Secretary of State, Blackman went on to bash Finchem for calling to decertify Arizona.",
    "The Attorney General’s office has received even more evidence from across the state and investigators have spoken to multiple suspects.",
    "Blackman: I understand he’s been active in the audit but I just want to tell things that are real.",
    "We are not going to be able to decertify an election… number two, you look at the Constitution.",
    "Reporter: Why aren’t you voting Finchem, who’s been really active in the audit?",
    "Walt Blackman is either wrong or too weak to stand for his constituents.",
    "There is nothing in the Constitution that says that we can decertify.",
    "Rep. Mark Finchem is already working on this piece of legislation.",
    "There’s a couple things wrong with that, that we can’t do that.",
    "Because I, you know, like to be straight, straight with folks.",
    "There’s been a lot of chatter about decertifying the election.",
    "The House and Senate can decertify with a joint resolution.",
    "In a recent interview, Blackman sounded like a Democrat.",
    "Contact Walter Blackman and demand decertification.",
    "Phone Number: 602-926-3043"
  ]
}