{
  "id": 6783,
  "mediaId": 2660,
  "date": "2022-01-31",
  "headline": "The battleground states where Republicans want to overhaul voting laws",
  "image": "https://static.politifact.com/CACHE/images/politifact/photos/Mail-in_ballots/df30ea6a78ca9c24d7ffb38b066e4146.jpg",
  "link": "https://www.politifact.com/article/2022/jan/31/battleground-states-where-republicans-want-overhau/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amy Sherman",
  "authorUrl": "https://www.politifact.com/staff/amy-sherman/",
  "termIds": [
    0
  ],
  "sentences": [
    "As state legislatures convened in most states in January, Republicans lawmakers in many of these states — particularly those that Joe Biden narrowly won — continued to press for a rewrite of their election laws, in some cases reimposing restrictions that existed before 2020, or eliminating voting conveniences.",
    "Arizona — a longtime GOP stronghold that flipped from Trump in 2016 to Biden in 2020, and has replaced two Republican senators with Democrats — has become a hot spot for the notion of \"election integrity,\" said Stuart Goodman, an Arizona lobbyist who worked for former Gov.",
    "Here’s a look at some of the restrictive measures proposed in battleground states:\nArizona: One of the dozens of bills pending would give the Legislature power to accept or reject election results, essentially allowing lawmakers to set aside the will of the voters.",
    "Republicans have only a one-vote majority in both chambers of the Legislature, so a key legislator to watch is Sen. Paul Boyer, a Republican who drew wrath from Trump for not supporting a much criticized, GOP-orchestrated review of ballots in Maricopa County.",
    "Georgia: State Sen. Butch Miller, who is running for lieutenant governor, filed a bill to ban ballot drop boxes, which were popular during the pandemic for voters who didn’t want to rely on the post office and wanted to avoid crowded indoor polling sites.",
    "But GOP lawmakers are laying the groundwork to do an end run around future governors by aiming to put ballot questions directly before the voters in May 2023 that would ban no-excuse absentee voting and move up the deadline to return absentee ballots.",
    "Republican sponsors of the election bills say they want to reduce the chance of voter fraud, but concern about fraud alone doesn’t explain the quick clampdown since the 2020 election, which state and federal authorities said was the most secure ever.",
    "\"I don’t say this lightly: It seems our democracy is in peril at this moment,\" said Kadida Kenner, founding executive director of the New Pennsylvania Project, which launched in 2021 to mobilize young people and people of color to register to vote.",
    "Many of their proposals would make it harder for some voters to cast ballots in the midterms or in the next presidential election, such as a Georgia bill that would limit drop boxes, and a Pennsylvania proposal that seeks to limit absentee voting.",
    "The current proposals follow another raft of laws enacted in several Republican-led battleground states in 2021 that restricted voting by mail, tightened ID requirements and empowered partisan officials — on the premise of combating voter fraud.",
    "In Arizona, Republican state legislators have proposed a bill that would give the Legislature the power to reject election results, and turn back the clock on election advances such as early voting and machine counting of ballots.",
    "A poll done for the Atlanta Journal-Constitution in January found a plurality of voters, 44%, want drop boxes to be as widely available as they were in 2020, although they were more popular among Democrats than Republicans.",
    "State Sen. Doug Mastriano, one of many Republicans running for governor, said when he introduced the bill that it \"will allow the people of Pennsylvania to have the final say on these important election security measures.\"",
    "Despite evidence that the election was secure, Republican state lawmakers have proposed major overhauls of election laws in battlegrounds where the outcome of statewide contests is often decided by narrow margins.",
    "\"The proliferation of proposals this year is simply an extension of the wave that began last year,\" said Alexander Keyssar, author of the book \"The Right to Vote\" and a professor of history at Harvard University.",
    "Now a group wants to circumvent the governor by collecting signatures to place a question on the ballot to make changes, including one that would require strict photo ID rules for in-person and absentee voting.",
    "Mastriano cited findings of a poll in December 2020 that found that about one-third of Pennsylvanians who voted in the 2020 general election did not have confidence in the accuracy of the final results.",
    "Drop boxes are generally more secure than standalone mail boxes and were used in GOP and Democratic counties in many states for two decades without controversy until Trump challenged their use in 2020.",
    "Some of the sponsors of restrictive voting bills are running in primaries where they are competing for Republican voters who tell pollsters they have doubts about the integrity of the election.",
    "In races across the country, Republican candidates have latched onto former Trump’s factually false attacks on voting by mail and his inaccurate statements that the 2020 election was rigged.",
    "Under the state constitution, if the initiative garners the required number of signatures, the GOP-controlled Legislature can enact the bill on its own, without the governor’s signature.",
    "The proposals include banning no-excuse absentee voting or ballot drop boxes, giving state legislatures power to reject election results and creating new voter-fraud investigative units.",
    "\"I don’t think it’s the Legislature’s responsibility to accept or reject election results, especially when our own names are on the ballot,\" said Boyer, who isn’t seeking re-election.",
    "A law passed in Montana last year bans paid ballot collection and will make it harder for Native Americans far from polling places to have paid organizers shuttle their ballots.",
    "The petition will also call for a \"forensic audit\" of the 2020 election and set rules for future audits, including that it could be paid for through undisclosed private donors.",
    "\"That it is happening nationally indicates that the Republican Party, throughout the country, is committed to a strategy of making it more difficult for people to cast ballots.",
    "It would also require that all ballots be counted by hand and that all voting should occur on Election Day, ending the early-voting periods that expanded access to the ballot.",
    "Democrats have questioned why such a large budget is needed when there were few cases of voter fraud in 2020, and DeSantis himself held up the state as a model for elections.",
    "\"Even mainstream Republicans are feeling the pressure from precinct committeemen and the base that they have to have something on the record showing they are a true believer.",
    "\"Republican members feel obligated to demonstrate their conservative credentials by having their name on something in this genre,\" Goodman said.",
    "The number of staff would be more than than the Jacksonville Police Department has to investigate homicides, the Tampa Bay Times found.",
    "A large number of bills in this space are from members who normally would not be in this space, but they’ve got to check the box.\"",
    "Such handouts have been typically used by voting rights groups in areas with long lines, which are often in nonwhite communities.",
    "State Legislatures that convened in January in Arizona, Georgia and Pennsylvania are considering changes to election laws.",
    "The proposal to eliminate no-excuse absentee voting would reverse a law passed by the GOP-controlled Legislature in 2019.",
    "Ron DeSantis proposed creating a state office, with a budget of $5.7 million, to investigate fraud and \"irregularities.\"",
    "Gretchen Whitmer, a Democrat, vetoed the most controversial election bills that would have overhauled ID requirements.",
    "Tom Wolf, a Democrat whose term expires this year, vetoed a bill in 2021 that would have added voter restrictions.",
    "\"We need to get back to 1958-style voting,\" said state Rep. John Fillmore, a Republican who introduced the bill.",
    "\"If Democrats were trying to pass something similar, we as a party would be losing our minds right now.\"",
    "Miller said in a statement in December that \"we can return to a pre-pandemic normal of voting in person.",
    "State Rep. Mark Finchem, Trump’s endorsed candidate for secretary of state, is one of the co-sponsors.",
    "Some of the new laws or proposals pose a burden to specific groups of voters, such as people of color.",
    "Wisconsin: Republicans are considering limits on the number and location of ballot drop boxes.",
    "Boyer told PolitiFact that he will support some ideas, such as to require ID for mail voting.",
    "But he said the proposal to allow the Legislature to reject election results is \"horrendous.\"",
    "That was a period before the passage of federal civil rights laws and the Voting Rights Act.",
    "Georgia’s law passed in 2021 restricts food and water handouts to voters waiting in line.",
    "Whether drop boxes can be used in Wisconsin has been the subject of litigation this year.",
    "Presumably they think that doing so will improve their electoral fortunes.\"",
    "Removing drop boxes will help rebuild the trust that has been lost.\"",
    "The bill is part of a larger pattern across battleground states.",
    "Both states flipped from Donald Trump in 2016 to Biden in 2020.",
    "What he didn’t mention: The doubters were largely Republican.",
    "\"It’s an affront to our democracy.\"",
    "Jane Dee Hull, a Republican.",
    "Michigan: In 2021, Gov.",
    "Pennsylvania: Gov.",
    "Florida: Gov."
  ]
}