{
  "id": 6847,
  "mediaId": 2676,
  "date": "2022-01-31",
  "headline": "Arizona bills embrace Trump conspiracy theories, could allow GOP to reject election results",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/01/doug-ducey-0128221.jpg",
  "link": "https://www.salon.com/2022/01/31/new-arizona-voting-bill-would-allow-legislature-to-reject-results/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    0
  ],
  "sentences": [
    "Fillmore's bill would also eliminate no-excuse early voting, which is used by more than 80% of Arizona voters, and would require that all ballots be hand-counted within 24 hours of polls closing, which election administration experts say would require thousands, if not tens of thousands, of additional election workers in a state with more than 3 million voters.",
    "Other bills would increase voter ID requirements to include fingerprints or special security codes; impose a ban on same-day voter registration and automatic voter registration, both of which are already illegal in the state; expand the election recount threshold from 0.1% to 0.5%; and enact bans on drive-through voting and drop boxes.",
    "The state Senate Government Committee advanced seven bills along party lines this week, including one that would require an audit of voting machines — despite the failed Cyber Ninjas audit of Maricopa County's machines — and would mandate that all ballots use \"anti-fraud\" paper with holograms or watermarks.",
    "Arizona Republicans, who already approved numerous new voting restrictions last year, are turning many of the GOP's conspiracy theories about Donald Trump's election loss into legislation even after their \"forensic audit\" of results in Maricopa County failed to turn up any evidence of fraud.",
    "Election administration has also made great strides since the 1950s and Arizona voters have increasingly moved away from traditional Election Day voting since the 1990s, said Tammy Patrick, a senior advisor to the elections program at the Washington, D.C., nonprofit Democracy Fund.",
    "A bill by state Sen. Wendy Rogers, one of the most ardent election conspiracy theorists in the state, would create a Bureau of Elections that answers to the governor and is empowered to investigate allegations of election fraud, a proposal similar to those floated by Florida Gov.",
    "Patrick said that when she was Maricopa County's federal compliance officer, her main job was to submit every policy to the Justice Department under the Voting Rights Act, which required the DOJ to pre-clear any voting changes in states with a history of racial discrimination.",
    "RELATED: Republican legislatures want to jam through more voting restrictions ahead of 2022 midterms\nFillmore, who backed a lawsuit seeking to overturn Trump's defeat in four key states, insisted that the bill was not partisan and had nothing to do with the former president.",
    "\"One of the most troubling aspects is that we see carryover from the conspiracy-theory language regarding the Maricopa County audit, in which there's this view that hand-counting ballots is the only way to ensure that you have a free and fair election,\" Bolding said.",
    "But since the Supreme Court gutted that provision of the law, \"it gives everyone carte blanche ability to implement any kind of voting legislation, irrespective of whether or not it's retrogressive or hurtful to all voters or even to specific voting populations.\"",
    "It's problematic because legislatures are introducing these kinds of bills as though there should be an additional channel outside the courts, and that it should go back to the legislature to decide whether or not they agree with their population.\"",
    "\"It is really important to hold people accountable when they continue to push misinformation and disinformation, when they continue to rule on the side of authoritarianism and anti-democratic values and undermine the will of the people.\"",
    "\"For a large portion of our country, when they hear things like, 'Let's go back to 1958,' they think about when their livelihood and their life could have been threatened just for simply having the ability to participate in democracy.\"",
    "\"Nearly half the [Republican] caucus believes that the legislature should be the final decider, which goes against everything that we stand for when we talk about election integrity, democracy and what it means to truly be a republic.\"",
    "Patrick said many lawmakers pushing voting bills are trying to \"game the system by introducing legislation that they feel will benefit themselves and their party, when in reality it's going to affect all voters across the spectrum.\"",
    "\"The only way for them to complete a hand count of the full ballot within 24 hours, on millions of ballots in Arizona would be to hire literally thousands of people — in fact, it might be as many as tens of thousands,\" she said.",
    "Fillmore's 35-page House Bill 2596 includes a section that would require the legislature to hold a special session to \"review the ballot tabulating process\" and then decide whether to \"accept or reject the election results.\"",
    "It's unclear what would happen if the legislature rejected the results under the new law and a court did not order a new election, or whether a court would have to order a new election for all races or individual ones.",
    "Perhaps the most far-reaching bill was introduced by Republican state Rep. John Fillmore, whose legislation could open the door for the Republican-led legislature to overturn election results for no reason at all.",
    "The number of polling places in Arizona has been drastically reduced, from more than 11,000 down to fewer than 800 over the last two decades, as voters have increasingly moved away from Election Day voting.",
    "State Senate President Karen Fann last year ordered an audit by Cyber Ninjas into the results in Maricopa County, which produced a report that was almost completely debunked by Republican county officials.",
    "Arizona Republicans opened the legislative session this month with a slew of new voting bills, including legislation that would allow the GOP-led state legislature to \"reject\" election results.",
    "The most concerning part of Fillmore's legislation is its attempt to allow the legislature to overturn the will of the voters, a growing trend in legislatures across the country, Patrick said.",
    "\"This bill is probably one of the biggest threats that we have seen here to our democracy,\" Arizona House Minority Leader Reginald Bolding, a Democrat, said in an interview with Salon.",
    "\"To date, this country has said we want cheap elections because we don't invest in them, except episodically, every five to 10 or 20 years, the federal government kicks in some money.",
    "\"Because you've seen Arizona move from a ruby-red state to one that is shifting purple and moving blue, I think you see politicians now are trying to implement power grabs,\" he said.",
    "The Help America Vote Act allows people voting on Election Day to have \"second-chance voting,\" which means they can correct errors on their ballots if the voting system rejects it.",
    "He insisted earlier this week that the bill would not allow the legislature to overturn the election, and that only the court system could do that, according to the Arizona Mirror.",
    "Because the legislature knew that egregious voting-law changes \"would never be pre-cleared by the federal government,\" such changes were not enacted or even introduced, she said.",
    "The bill already has 15 Republican co-sponsors, including state Rep. Mark Finchem, the Trump-endorsed secretary of state candidate seeking to take over the state's elections.",
    "Republican lawmakers last year introduced hundreds of voting restrictions in state legislatures and have already rolled out many new proposals in states across the country.",
    "Fillmore's bill is one of dozens introduced by Republicans in Arizona, with many seemingly inspired directly by right-wing conspiracy theories about the 2020 election.",
    "Voter fraud is exceptionally rare, despite numerous anecdotal reports of Trump supporters illegally voting, and there are numerous laws on the books criminalizing it.",
    "\"For Arizona to introduce legislation to go back 70 years in the way in which we provide services to our voters is I think irresponsible,\" she said in an interview.",
    "Fillmore's bill would also allow the legislature to audit any election's results, though it does not say if there are any criteria to trigger such an audit.",
    "The Senate failed to pass voting rights legislation that would bring back the pre-clearance requirement after Republicans filibustered the bill and Sens.",
    "It might be more of a challenge to make sure that you get your voices heard in November, but it's never going to be more important than now,\" she said.",
    "\"I think about the 1950s, where you had poll taxes, where you had literacy tests, where Jim Crow was the law of the land,\" said Bolding, who is Black.",
    "That comes after Republicans apparently hunted for traces of bamboo over a conspiracy theory that thousands of ballots had been flown in from China.",
    "You will see massive confusion and I think some real drop-off in turnout and who's going to participate on both sides of the aisle,\" she said.",
    "So to adjust to this proposed law, that the state would have to fund a massive expansion of polling locations and poll workers, Patrick said.",
    "I think that's this long line of conspiracy theories that we'll continue to see in 2022 all the way through the next election cycle as well.\"",
    "Patrick, who served for over a decade as Maricopa County's head of federal election compliance, said the bill would also violate federal law.",
    "They expect legislation that's going to advance voting rights, not that's going to suppress people from having the ability to participate.\"",
    "Cyber Ninjas, which is planning to shut down, is being fined $50,000 per day by a judge after refusing to turn over records from the audit.",
    "\"If this bill were to pass, the vast majority of voters in Arizona would have to change the way in which they interact with the franchise.",
    "\"What is the situation that would allow the legislature to step in and subvert the will of the people in a legitimate election outcome?\"",
    "Any candidate, political action committee or individual voter who has evidence of wrongdoing has legal recourse to challenge elections.",
    "\"We should have voting, in my opinion, in person, one day, on paper, with no electronic means and hand counting that day,\" he said.",
    "If the legislature rejects the election results, \"any qualified elector\" can go to court to \"request that a new election be held.\"",
    "Arizona ballots also typically include between 40 to 60 different items to vote on, including local elections and propositions.",
    "\"There were more than 400 court cases around the 2020 election and all but one of the federal court cases was thrown out.",
    "Joe Manchin, D-W.Va., and Kyrsten Sinema, D-Ariz., refused to back their party's proposal to change the filibuster rules.",
    "Some Democrats are hopeful that voter backlash will hold Republicans pushing to restrict ballot access accountable.",
    "Bolding said he is particularly concerned about the \"constant attacks\" from Republicans on the vote-by-mail system.",
    "\"The same process that Republicans use to vote, Democrats and independents use those measures to vote as well.",
    "\"I absolutely think these voter suppression and voter restriction bills will backfire,\" Bolding predicted.",
    "The bill's language does not include any criteria or necessary requirements to reject election results.",
    "Another bill advanced by the committee would also require all ballot images to be published online.",
    "\"There's that lack of specificity and there's ambiguity around when the legislature can do this.\"",
    "Patrick said she is also hopeful that voters will overcome the new obstacles to ballot access.",
    "Everybody's lying to me and I feel like I have a couple hundred ex-wives hanging around me.",
    "Fillmore said on Wednesday that he wants elections to run the way they did in the 1950s.",
    "I think it is to appease former President Trump, but Arizona is no longer that place.",
    "\"The power really still is in the hands of the people and in the hands of the voter.",
    "Voters would not have this opportunity if they drop their ballot to be hand-counted.",
    "States are constantly cutting budgets, local offices, country boards, city councils.",
    "They have what they consider to be more pressing services to provide to the public.",
    "Bolding said many Arizonans do not want to hear about \"returning back to 1958.\"",
    "The legislature does not have to have a specific reason to reject the results.",
    "All these provisions would come with a huge cost attached, Patrick observed.",
    "States already have laws and protocols if anything is amiss with elections.",
    "\"I don't care what the press says,\" he said during a hearing on Wednesday.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "… In all other cases, they were thrown out for lack of evidence.",
    "Read more on voting restrictions and Arizona's \"forensic audit\":",
    "So the elections infrastructure is continually being depleted.\"",
    "Ron DeSantis and Georgia gubernatorial candidate David Perdue.",
    "\"I don't trust ABC, CBS, NBC or Fox or anybody out there.",
    "Fillmore's bill would create a logistical nightmare.",
    "Fillmore did not respond to a request for comment.",
    "Subscribe to our morning newsletter, Crash Course.",
    "Arizona voters expect common sense from lawmakers.",
    "This is not a 'the other red-headed guy' thing.\"",
    "It can't be merely conjecture,\" Patrick said.",
    "\"We need to get back to 1958-style voting.\"",
    "This is not a President Biden thing.",
    "\"We know that not to be the truth.",
    "\"But you have to have evidence.",
    "It might be more inconvenient.",
    "I think it's short-sighted.",
    "Patrick asked."
  ]
}