{
  "id": 6861,
  "mediaId": 2589,
  "date": "2022-01-29",
  "headline": "\"Credible threats\" force three-day shut down of National Butterfly Center",
  "image": "https://media.townhall.com/townhall/reu/o/2017/299/b313d395-8e72-4c9d-b22c-3c46fe21bb5d-1110x740.jpg",
  "link": "https://hotair.com/karen-townsend/2022/01/29/credible-threats-force-three-day-shut-down-of-national-butterfly-center-n445005",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Townsend",
  "authorUrl": "https://hotair.com/author/karen-townsend",
  "termIds": [
    0
  ],
  "sentences": [
    "The notice also includes what it refers to as a “fake photo of rafts at our dock composed and disseminated by Kolfage & crew.” The photo appears to show a dock at a riverbank and includes the text: “The National Butterfly sham even has a dock for illegals who come by raft… nice welcome mat!”\nKolfage’s Facebook account was suspended in November 2020 because of repeated violations of pushing misinformation and association with Bannon, the Washington Post reported at the time.",
    "In its notice, the butterfly center said a “former state official” told executive director Marianna Wright that the center “would likely be a stop” for the caravan and that Wright “and the center are targets.” The former official also told Wright she should be either away or “armed at all times” this weekend, according to the notice.",
    "Conroe Police Department said that Trump’s Save America rally will produce “heavy traffic congestion is expected from very early hours in the morning until late in the night.” Most Republican elected official and candidate running for office is expected to either speak or attend the rally, including Governor Abbott.",
    "In November 2019, as Kolfage and We Build the Wall fundraised for the endeavor — which resulted in a tax fraud indictment for Kolfage and former White House chief strategist Steve Bannon — they sought to construct the wall near the center’s 100-acre butterfly reserve.",
    "Kolfage turned his attention to the center, which stood near his fantasy wall’s path, and hurled a series of conspiratorial accusations at Wright, as well as other Rio Grande business owners and advocates who opposed the wall.",
    "“We are writing to let you know the National Butterfly Center will be closed Friday, Jan. 28 – Sunday, Jan. 30, due to credible threats we have received from a former state official,” center staff said in a notice on Thursday.",
    "Tickets are selling fast so reserve your seat today.https://t.co/TUpz8VgUOA#americanfreedomtour #USA #Houston #DonaldTrumpJr pic.twitter.com/Y1Uo7nRHbu\n— AmericanFreedomTour (@AmericaFreedomT) January 13, 2022",
    "Retired Lt. Gen. Michael Flynn, former President Donald Trump’s pardoned national security advisor, is also set to speak at what We Stand America refers to as its “Take Action Tour,” according to its website.",
    "Local officials, the center, and a ProPublica and Texas Tribune investigation all raised concerns about the ecological soundness of the project, especially in proximity to nature reserves and the Rio Grande.",
    "The National Butterfly Center sued Kolfage, We Build the Wall, and associated construction companies for their endeavor in December 2019 — specifically alleging Kolfage’s harassment campaign defamed them.",
    "In November 2019, Kolfage tweeted at the center, baselessly claiming there was “rampant sex trade taking place on your property and the death (sic) bodies,” according to My Rio Grande Valley News.",
    "It sounds like a difficult situation between a butterfly sanctuary and a man determined to built a border wall with private donations escalated into the current problems presented this weekend.",
    "A purported screenshot of another 2019 tweet showed Kolfage baselessly claiming, “The only butterflies we saw were swarming a decomposing body,” according to the center’s notice.",
    "Wright says she didn’t know about the event planned by Trump supporters until last week when a Virginia congressional candidate, Kimberly Lowe, visited the center with a friend.",
    "A spokesperson for the Mission Police Department confirmed to Insider on Friday that there was an ongoing investigation into the situation, but declined to elaborate further.",
    "The weekend closure is in connection to conspiracy theories coming from We Build The Wall founder Brian Kolfage and threats linked to a pro-Trump border wall event.",
    "American Freedom Tour is coming Houston on January 29, 2022 featuring Donald Trump Jr, Kayleigh McEnany, Dinesh D'Souza, Judge Jeanine Pirro and more.",
    "The National Butterfly Center in Mission, Texas is not new to controversy, as odd as it is to mention that a butterfly sanctuary is controversial.",
    "The center’s notice announcing their temporary closure also said that a Texas Department of Transportation sign was torn down on Thursday morning.",
    "It is unclear why the Virginia candidate came to Texas and livestreamed her visit or even what her involvement in the pro-Trump event is, if any.",
    "The border wall event is hosted by a slew of conservative organizations, including Women Fighting For America and Veterans for America First.",
    "An optional event connected to the pro-Trump event is reported to be a caravan on Sunday to the border to see the unfinished border wall.",
    "Upon determining that there are credible threats to the sanctuary director and the facility itself, the center has closed for three days.",
    "For example, past arguments over the border wall in Texas have led to legal challenges between the sanctuary and supporters of the wall.",
    "The pro-Trump event hosted by We Stand America is focused on border law enforcement and domestic security, according to the website.",
    "The butterfly sanctuary objected to the construction of a border wall near its location and sited ecological concerns at the time.",
    "Arizona Rep. Mark Finchem and former Immigration and Customs Enforcement Director Tom Homan are scheduled to attend.",
    "Co-hosts for that event include former Major League Baseball pitcher Roger Clemens and Attorney General Ken Paxton.",
    "“We simply cannot risk the safety and lives of our staff and visitors during this dangerous time,” the notice read.",
    "In Houston at an undisclosed location, Trump is charging couples $100,000 to attend a private luncheon with him.",
    "Meanwhile, dates set in federal courts in Florida and New York over the We Build the Wall project are unchanged.",
    "Prices climb to as high as $50,000 to participate in a roundtable discussion and have a photo opportunity.",
    "Trump already endorsed Abbott so it will be interesting to see if they come to be seen by the large crowd.",
    "It will be in Conroe, in Montgomery County just north of Houston, at the Montgomery County Fairgrounds.",
    "“The more they could engage and incite their base, the bigger their dollar count,” Wright told Insider.",
    "Kolfage could face trial twice in two months beginning in March on separate sets of federal charges.",
    "And later there is a reception at Lake Conroe where guests are paying $5,000 per couple to attend.",
    "He will attend two fundraising events for his new political action committee, called MAGA Again!",
    "They asked to access the back of the center so they could see “illegals crossing on rafts”.",
    "On Saturday night, Trump joins his son Donald, Jr. and the America Freedom Tour in Houston.",
    "Wright said she tried to get Lowe to stop livestreaming but instead, a scuffle broke out.",
    "Conspiracy plots include “rampant sex trade” and dead bodies allegedly on the property.",
    "Lowe was livestreaming the visit on Facebook, according to an affidavit from Wright.",
    "Dan Patrick, who lives in Montgomery County, is listed as the chairman of the event.",
    "Kolfage was suspended from social media platforms over his claims, all unfounded.",
    "The blame is being put on a pro-Trump border wall event and conspiracy theories.",
    "A huge crowd is expected and traffic delays and road closures are expected.",
    "Staff at the National Butterfly Center posted a notice about its closure.",
    "The National Butterfly Center should be open this weekend but it is not.",
    "The big event is Trump’s first rally in Texas since the 2020 election.",
    "It’s a big day all the way around in the Houston area for Team Trump.",
    "Wright says the years of dispute over the wall has taken a toll.",
    "The caravan organizers say they will pray for the country there.",
    "C’mon, you knew it had to all be Trump-related somehow, right?",
    "It’s being called the “Coachella”-type event for Republicans.",
    "The friend reportedly claimed to be a Secret Service agent.",
    "Former President Trump is having a big day in Texas today.",
    "They carry possible penalties of decades in prison.",
    "Will Abbott’s GOP primary challengers show up?",
    "Tickets range in price from $10 to $2,500.",
    "His Twitter account is also suspended.",
    "The feud with Kolfage began in 2019.",
    "Wright’s son called 911.",
    "Frankly, it’s nuts.",
    "Lt. Gov."
  ]
}