{
  "id": 6912,
  "mediaId": 4040,
  "date": "2022-01-19",
  "headline": "Trump’s Latest Inflammatory Lie: White People Are Being Denied COVID Treatment",
  "image": "https://files.rightwingwatch.org/uploads/Trump-in-Let-Us-Worship-video.jpg",
  "link": "https://www.rightwingwatch.org/post/trumps-latest-inflammatory-lie-white-people-are-being-denied-covid-treatment/",
  "mediaOutlet": "Right Wing Watch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Montgomery",
  "authorUrl": "https://www.rightwingwatch.org/post_author/peter-montgomery/",
  "termIds": [
    0
  ],
  "sentences": [
    "Also speaking at the Florence event was Arizona’s Trumpist GOP chairwoman Kelli Ward, who claimed that there was cheating back in 2016 but that “we deplorables, we people who love this country, overwhelmed their cheating algorithm, and we’ve got to do it again in 2022, 2024, and beyond.” She said Arizona’s “audit” is still ongoing and that she hopes that “we’re gonna decertify 2020.”\nin recognition that Black, Hispanic, and Native Americans are, according to CDC data cited by the New York Times, “about twice as likely to die from COVID-19 than white Americans,” the guidelines suggest that in prioritizing care for people with COVID-19, race should be considered one risk factor along with other factors like age, diabetes, and heart disease.",
    "At the event, which was sponsored by Trump’s Save America PAC, he falsely charged “the left” with “discriminating against and denigrating, just denigrating, white people to determine who lives and who dies,” adding, “If you’re white, you don’t get the vaccine, or if you’re white, you don’t get therapeutics.”\nTrump’s wildly irresponsible charge was tailor-made to promote racial resentment and stoke the kind of anger and grievance that is fomented by white nationalists and has led to violence and mass murder.",
    "In recognition of the fact that Black, Hispanic, and Native Americans are, according to CDC data cited by the New York Times, about twice as likely to die from COVID-19 as white Americans, the department’s guidelines suggest that in prioritizing care for people with COVID-19, race should be considered one risk factor along with other factors like age, diabetes, and heart disease.",
    "Gosar gave the QAnon adherents in attendance reason to cheer when he asked, “Do you feel the storm building?” and encouraged rally attendees to keep “building on this storm.” Central to the far-right QAnon conspiracy theory is belief in “the Storm,” a day of reckoning when high-ranking Democratic officials and others would be rounded up and arrested for their alleged crimes.",
    "Other officials and candidates who addressed the crowd included Reps. Andy Biggs and Debbie Lesko, former Trump administration official Richard Grenell, state Sen. Sonny Borrelli, state Senate candidate Anthony Kern, Trump-endorsed secretary of state candidate Mark Finchem, and Trump-endorsed candidate for governor Kari Lake.",
    "In December, Rogers bragged about having been called “based” by Fuentes, describing it as “like knighthood.” At Saturday’s rally, she insisted that Trump won and is the “true president.” Rogers, who describes herself as a member of the Oath Keepers, was one of several rally speakers who sounded Christian nationalist themes.",
    "But it didn’t seem to bother his fans, including Turning Point USA’s Charlie Kirk, who tweeted his praise for Trump’s “epic speech,” adding, “This is how you win big in November.”\nIndeed, Trump was in Florence, Arizona, “drumming up support for Arizona Republicans running for office,” reported the local Fox affiliate.",
    "Their speeches collectively document the extent to which Trump has corrupted the Republican Party, with speakers repeating Trump’s lies about the election, calling on the state legislature to decertify the 2020 presidential election results, and denouncing Dr. Anthony Fauci (eliciting chants of “Lock him up!”).",
    "It is not clear that anyone in Trump’s Republican Party—which has made a bogeyman out of critical race theory and stokes white grievance as a power-building strategy—takes issue with the former president lying about white people being “denigrated” and denied access to COVID-19 care.",
    "Former President Donald Trump spoke at rally with Arizona Republicans on Saturday, where he made false and racially inflammatory comments claiming that white people are being denied access to COVID-19 vaccines and treatments.",
    "She ended her remarks with “Jesus is King!”—a declaration reminiscent of the chants of “Christ is King!” that could be heard repeatedly at Fuentes’s America First conference last year.",
    "His hour-and-a-half speech also included his standard lies about the 2020 presidential election nationally and in Arizona specifically and about the Jan. 6, 2021 Capitol Insurrection.",
    "Biggs denounced the “fascistic Biden regime” and promoted the right-wing lie that the Biden administration is investigating parents simply for showing up at school board meetings.",
    "Some right-wing media responded to the guidelines with characteristic truthfulness and nuance; for example, writer Karol Markowicz tweeted, “white people need not apply.”",
    "Right Wing Watch has documented multiple recent examples of Fuentes using his streaming show to spout blatant racism, most recently to defend his use of the N-word.",
    "Among the Arizona politicians who spoke at the rally were Rep. Paul Gosar, who represents the area where the event was held, and state Sen. Wendy Rogers.",
    "That false claim was apparently in response to media reports about a December memo from the New York Department of Health.",
    "The guidelines do not disqualify white patients from receiving any treatments.",
    "Both of them are associated with white nationalist Nick Fuentes."
  ]
}