{
  "id": 7007,
  "mediaId": 2540,
  "date": "2022-01-26",
  "headline": "2020 sore losers look to run the 2024 vote",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220126130857-arizona-recount-may-2021-super-tease.jpg",
  "link": "https://www.cnn.com/2022/01/26/politics/nevada-secretaries-of-state-campaigns/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kyung Lah and Anna-Maja Rappard",
  "authorUrl": "https://www.cnn.com/profiles/kyung-lah-profile",
  "termIds": [
    1716,
    2201,
    3975,
    4284,
    4358,
    234,
    5178
  ],
  "sentences": [
    "But the Reno meeting is evidence of continuing pockets of anger at former President Donald Trump's loss to President Joe Biden, a misguided belief that the election was somehow stolen through a broken system and the desire to get that system fixed by changing secretaries of state who act as election referees.",
    "Unfounded promises\nMarchant told the women in Reno that, as secretary of state, he would eliminate all voting machines, early voting and mail-in ballots, without explaining that moves like that would come from the state legislature not the executive branch.",
    "That coalition, as Marchant has repeated on Trump ally Steve Bannon's podcast and at a QAnon-themed conference in Las Vegas last summer, is made up of Trump-endorsed Republican secretary of state candidates in Arizona, Georgia and Michigan.",
    "\"Under the stress of the 2020 election results and the unprecedented attack on the accuracy of the results, secretaries of state had to step up in a way that they have not historically had to, in order to validate accuracy of the results.\"",
    "\"As a Republican, it worries me a great deal for the future of popular credibility and elections, that the role of secretary of state -- a nonpartisan election role, where you have to call balls and strikes -- is becoming so politicized.",
    "The numbers show it,\" she told CNN of the 2020 election, despite multiple Nevada lawsuits being dismissed for lack of evidence and the state's Republican secretary of state investigation also finding no sign of widespread wrongdoing.",
    "Carusone said what he sees is the normalization of these extreme election deniers being part of a path that could \"very likely result in a constitutional crisis or a total undermining of our democratic norms and systems.\"",
    "Clutching flyers about how to become a poll worker along with her red notebook, Duppenthaler had embraced Marchant's message that 2020 election deniers needed to be the top election chiefs in battleground states.",
    "Duppenthaler applauded with the rest of the crowd, mainly senior citizens like her, as Marchant underscored each false point and presented invented data points about America's election process.",
    "CNN was not permitted into the event, but the owner of Paisan's seated the crew close by in the public section of the restaurant to listen to the speeches happening behind a gray curtain.",
    "Chris Johnson, another member of the Republican Women of Reno, said she walked away from Marchant's event convinced she'd found the solution to her dismay over the 2020 election.",
    "Two-hundred-and-fifty post-election audits by Michigan's secretary of state reaffirm the accuracy of the election and that Biden won the state by more than 150,000 votes.",
    "Angelo Carusone, president and CEO of Media Matters, a left-leaning nonprofit media watchdog, is graphic in his warning of what may lie ahead for American democracy.",
    "As well as campaigning in Nevada, Marchant said he is supporting similar campaigns putting together what he calls a coalition to fight in other battleground states.",
    "He said he would seek out an unnamed company in Texas to print ballots with new security features -- a favorite topic of the far-right and fabulist QAnon forums.",
    "He publicly blames that defeat on baseless claims of election fraud, for which he failed to produce evidence in a lawsuit that sought to overturn the result.",
    "Both political parties are gearing up for this year’s contests to elect secretaries of state, who typically serve as their state's head election official.",
    "Karamo did not return multiple phone calls from CNN for a request for an interview or directly respond to an in-person request made through her family.",
    "Back in Reno, Marchant's event was motivating not just for Duppenthaler but for many of the women who attended the Republican Women of Reno meeting.",
    "Finchem has repeatedly touted multiple lies about the election and the results of the partisan audit of Maricopa County's ballots last year.",
    "Alarm bells elsewhere\nCampaigns for the state races that used to fly largely under the radar are making many sit up and take notice in 2022.",
    "In Georgia, Trump has endorsed Republican Rep. Jody Hice, who's challenging Republican Secretary of State Brad Raffensperger in a primary.",
    "\"In 2022, the secretaries of state races are being used as surrogate races to either validate or refute the Big Lie from 2020,\" he said.",
    "The importance of these state offices became crystal clear in contested states in 2020, Republican election lawyer Ben Ginsberg said.",
    "The monthly Republican Women of Reno meeting was holding an \"Election Integrity Workshop\" and the retiree was prepared to take notes.",
    "\"The difference between myself and my opponents -- I'm the only one that believes there was election fraud,\" said Marchant, 65.",
    "Marchant, a former member of the Nevada state assembly, lost his 2020 election for the US House by more than 16,000 votes.",
    "His ideas are in line with MAGA,\" said Duppenthaler afterwards, referencing Trump's \"Make America Great Again\" platform.",
    "This map shows the 27 states that will pick secretaries of state in 2022 and which party currently controls the office.",
    "Headlining the women's group event was Jim Marchant, a Republican candidate to be Nevada's new secretary of state.",
    "Reno, Nevada (CNN)Glen Duppenthaler walked into Paisan's Old World Deli in Reno, Nevada, clutching a red notebook.",
    "Instead, she posted the CNN reporter's business card on her Facebook page, writing, \"I will not be intimidated.\"",
    "\"The algorithms from state to state reveal the facts,\" said Linda Park, after the two-hour misinformation event.",
    "Raffensperger denied Trump's outrageous request to \"find 11,980 votes\" made in a phone call in January 2021.",
    "Acceptance of results is not going to be tolerated anymore, unless they align with what this sector wants.\"",
    "\"We have people in there that are not in there for the people, they're in there for themselves,\" she said.",
    "\"With all the evidence we have, the Arizona election should be decertified,\" said Finchem at the rally.",
    "We are at code red for American democracy,\" said Colorado Secretary of State Jena Griswold, a Democrat.",
    "Democrats are taking action -- raising $4.5 million for these races last year, a record for the group.",
    "He spoke at Trump's first rally of 2022, declaring, \"We know it and they know it: Donald Trump won!\"",
    "In Arizona, another Trump-endorsed candidate, Mark Finchem, is also running for secretary of state.",
    "This is both an early warning system as well as an alarm bell for fires that are already going off.",
    "And secretaries of state are one of the last stop gates to safeguarding democracy,\" Griswold said.",
    "In GOP primaries in 2022, Ginsberg sees the fiercest battle for democracy being waged in the open.",
    "\"This cauldron of extremism and disinformation is being propelled by social media,\" said Carusone.",
    "In that coalition is Kristina Karamo, a Republican candidate for secretary of state in Michigan.",
    "Attendees were promised, \"We will discuss next steps to prevent 2022 election from being stolen.",
    "She has posted multiple lies about Michigan's election and spent weeks challenging the results.",
    "That is a bottomless pit from which neither of the political parties would emerge unscathed.\"",
    "For her, having Republicans in office is no longer enough, she wants them \"Trump-backed.\"",
    "\"We are seeing a coordinated effort by extreme Republicans to undo American democracy.",
    "That Republican-commissioned audit was widely discredited but even it found Biden won.",
    "\"It's created a lot of kinetic energy that is now a part of more mainstream politics.",
    "And part of that effort is to win these key swing state, secretary of state seats.",
    "\"The scaffolding is being constructed right now in plain sight,\" he said.",
    "She is the chair of the Democratic Association of Secretaries of State.",
    "\"I think he knows what he's doing,\" said Johnson of Marchant.",
    "You can see watermarks and holograms,\" Marchant claimed.",
    "We got to challenge the courts,\" he told the audience.",
    "\"You'd have to be ignorant to not see what's going on.",
    "\"I believe in his efforts and I totally support him.\"",
    "There was so much fraud in this last election.\"",
    "\"This ballot, you hold it up to a blacklight.",
    "We gotta watch people counting the votes.",
    "You will go away with action items.\"",
    "She had her action item for 2022.",
    "\"The stakes could not be higher.",
    "\"I thought he was excellent.",
    "Duppenthaler, 74, was ready.",
    "\"We gotta watch the polls.",
    "\"So, get ready to work.\"",
    "\"Yes, there was fraud.",
    "100%!"
  ]
}