{
  "id": 7136,
  "mediaId": 2898,
  "date": "2022-01-31",
  "headline": "Campaigning to oversee elections, while denying the last one: Partisan candidates are transforming races for secretary of state",
  "image": "https://www.baltimoresun.com/resizer/zws55Qu2kVDvpvO7MS0rhmRcusE=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/QKQXDUUHM2RC6EZLTTQZCLSMT4.jpg",
  "link": "https://www.baltimoresun.com/news/nation-world/ct-aud-nw-nyt-election-deniers-secretary-of-state-20220131-mviol2ggxjcpdlyxutmmmoszru-story.html#ed=rss_www.baltimoresun.com/arcio/rss/category/news/nation-world/",
  "mediaOutlet": "Baltimore Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Medina",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "They can’t afford to do that.”\nTony Daunt, a longtime Michigan Republican official who was appointed last year to the panel that certifies the state’s election results, said Karamo, who has falsely claimed that Trump won Michigan, was unqualified to be secretary of state because of the “nonsense regarding the stolen election.”\nBut Daunt and Merrill, of Alabama, are among very few Republican election officials who have publicly criticized the spreading of lies about the 2020 election.",
    "The coalition’s other candidates include Jim Marchant in Nevada, a former state legislator; Rachel Hamm in California, who contends that Trump actually won that deep-blue state; and Kristina Karamo in Michigan, who developed a high profile in conservative media after she made uncorroborated claims that she had seen fraudulent ballots being counted in Detroit during the 2020 election, allegations that have been disproved by both local election officials and courts.",
    "Their candidacies are alarming watchdog groups, Democrats and some fellow Republicans, who worry that these Trump supporters, if elected to posts that exist largely to safeguard and administer the democratic process, would weaponize those offices to undermine it — whether by subverting an election outright or by sowing doubts about any local, state or federal elections their party loses.",
    "There, Finchem told the crowd that the 2020 election had prompted him to run for secretary of state, said he was part of a “nationwide populist movement to regain control over our government” and called for the state Legislature to decertify the presidential result in Arizona, which Biden carried by nearly 11,000 votes.",
    "The significance of the America First coalition’s parallel efforts can be seen clearly in Arizona, where the slate’s candidate is Mark Finchem, a former firefighter and real estate agent who has served in the state House since 2015 and has become the leading Republican contender for secretary of state.",
    "Had secretaries of state taken their cues from Trump in the last election, they could have put their thumbs on the scales of fair elections by forcing the closure of polling places, removing ballot drop boxes or withholding other resources that could make voting easier in heavily Democratic precincts.",
    "Their chances in November, should they succeed in the primaries, could rest heavily on how well Republicans fare in the midterm elections, given voters’ tendency to vote for down-ballot candidates such as secretary of state from the same party as their choices for governor or senator.",
    "“The narrative that is being promoted by people who are ill-informed and simply trying to promote a political narrative to benefit themselves in a particular candidacy is very dangerous,” said John Merrill, the Republican secretary of state in Alabama who is term-limited.",
    "“When we think about the anti-democracy playbook, you change the rules and you change the players so you can change the outcome.”\nMany of the election deniers are running in solidly red states where it is less likely that their actions could tilt a presidential election.",
    "In a phone call that is now the subject of an Atlanta grand jury investigation into Trump’s actions in Georgia, the former president urged Brad Raffensperger, the Georgia secretary of state, to “find 11,780 votes” — the margin by which Trump lost the state to Biden.",
    "PHOENIX — Nearly two dozen Republicans who have publicly questioned or disputed the results of the 2020 election are running for secretary of state across the country, in some cases after being directly encouraged by allies of former President Donald Trump.",
    "Nothing and no one has catalyzed Republican enthusiasm for secretary of state contests more than Trump himself, who has offered three endorsements for Finchem, Karamo and U.S. Rep. Jody Hice, who is challenging Raffensperger in Georgia’s Republican primary.",
    "In the two months between Election Day and Congress’ certification of President Joe Biden’s victory, Trump and his allies pressured Republican secretaries of state, election board members and other officials in battleground states to overturn his defeat.",
    "“We would like as many like-minded secretary of state candidates to come forward as we can,” Marchant said at a Las Vegas conference that featured members of the coalition along with speakers who are well-known to followers of QAnon conspiracy theories.",
    "Major donors to the coalition include such promoters of election conspiracies as Mike Lindell, the CEO of My Pillow, and Patrick Byrne, a former executive at Overstock, both of whom have also helped fund several election-denial campaigns and lawsuits.",
    "We’re working to bring them into the coalition.”\nIn an interview, Marchant said the group had presented its theories about the 2020 election at three “summits” in different states recently and planned others in Wisconsin, Texas, Colorado and Nevada.",
    "Instead, pro-Trump Republicans are enthusiastic about those candidates, and both the candidates and their supporters say the changes they are pushing for will make it more difficult to commit election fraud, which they portray as a pressing threat.",
    "Jocelyn Benson, the Democratic secretary of state in Michigan who is facing a likely reelection battle against Karamo, has raised $1.2 million this campaign cycle, more than six times what her Republican predecessor raised by this point in 2014.",
    "While local election officials typically oversee the counting of individual ballots, and state legislatures sign off on slates for the Electoral College, secretaries of state often certify elections and set the tone of how elections are run.",
    "All told, some 21 candidates who dispute Biden’s victory are running for secretary of state in 18 states, according to States United Action, a nonpartisan group tracking races for secretary of state throughout the country.",
    "He championed the Republican-ordered review of the 2020 vote in Maricopa County — although he never endorsed its conclusion that Biden won — and received a prime speaking spot in Trump’s Jan. 15 rally outside Phoenix.",
    "Some held their jobs for many years and viewed themselves not as politicians but as bureaucrats in chief, tending to such arcane responsibilities as keeping the state seal or maintaining custody of state archives.",
    "Nationally, Democratic candidates for secretary of state raised six times as much money in 2021 — and from five times as many donors — as they did in 2017, according to ActBlue, the Democratic donation platform.",
    "But several others, who have formed a coalition calling itself the America First slate, are running in states won by Biden in 2020, including in the crucial battleground states of Michigan, Arizona and Nevada.",
    "Jena Griswold, the secretary of state in Colorado and the chair of the Democratic Association of Secretaries of State, said she had hired full-time staff for the first time in the association’s history.",
    "He has publicly acknowledged his affiliation with the Oath Keepers, the far-right militia group whose leader and other members were charged with seditious conspiracy for their roles in the Capitol riot.",
    "While the money being spent on races for secretary of state as yet does not approach the fundraising by candidates for governor or Senate, they are no longer the low-budget affairs they once were.",
    "The coalition’s members are coordinating talking points and sharing staff members and fundraising efforts — an unusual degree of cooperation for down-ballot candidates from different states.",
    "She said the group had set a fundraising goal of $15 million for this cycle, far surpassing the $1.8 million it raised in 2019 and 2020, and had raised $4.5 million toward that goal so far.",
    "In a presidential election, state legislators and the governor hold the power to approve an alternative set of presidential electors, and refusing to certify could boost such an effort.",
    "Their election-management duties generally include distributing voter registration cards, allocating voting machines, educating voters, auditing election results and ordering recounts.",
    "And he has repeatedly called for “currency grade” paper as a countermeasure against fake ballots, although there is no evidence that fake ballots have posed a threat to fair elections.",
    "For decades, secretaries of state worked in relative anonymity, setting regulations and enforcing rules for how elections were administered by local counties and boards.",
    "He brushed off concerns about undermining confidence in elections and instead assailed sitting state and local officials for resisting further audits of the 2020 vote.",
    "Despite their fundraising struggles in the Arizona contest, Democrats are having some success creating a national support structure for secretary of state candidates.",
    "In Georgia, Michigan and Minnesota, fundraising is more than double what it was at this point during the 2018 midterms, according to the Brennan Center for Justice.",
    "Finchem, who declined to comment for this article, was in Washington on Jan. 6, 2021, and attended the Stop the Steal rally that led to the storming of the Capitol.",
    "They are in strong position to win Republican primaries in those battleground states, as well as in somewhat-bluer Colorado and heavily Democratic California.",
    "That intense focus on a once-obscure state-level office has dramatically transformed its place in American politics — and the pool of candidates it attracts.",
    "Short of that, in states where secretaries of state have the power to certify elections, the refusal to do so could be a vital step in overturning one.",
    "In contests for governor or for House or Senate seats, the refusal to certify the result of an election could send states into uncharted legal waters.",
    "Campaigns for secretaries of state this year are attracting more money, more attention and more brazenly partisan candidates than ever before.",
    "Another of his bills would require all ballots to be counted by hand, although studies show that hand counting introduces more errors.",
    "Those who say they are alarmed at the possibilities include many current Democratic secretaries of state — and a few Republican ones.",
    "He has raised some $663,000 for his campaign, according to state filings, more than the two leading Democratic candidates combined.",
    "Trump’s phone call to Raffensperger in Georgia raised the specter of out-and-out fraud in the tabulation of a presidential vote.",
    "Finchem is sponsoring a bill in Arizona that would treat all voters’ ballots as public records and make them searchable online.",
    "“The stature of the office is different, and the stature of what officeholders are doing is also different,” Griswold said.",
    "Hice reported more than $575,000 in donations for his secretary of state candidacy in June, twice Raffensperger’s total.",
    "The powers of secretaries of state to subvert elections vary from state to state and are largely untested in court.",
    "Worse, critics say, they could have raised doubts about, or even refused to certify, Biden’s victories.",
    "“It’s like putting arsonists in charge of the Fire Department,” said Joanna Lydgate, the group’s CEO.",
    "And Marchant, in Nevada, said he entered the race after being encouraged by allies of Trump.",
    "“If they’re so confident, wouldn’t they gloat and say, ‘See, we told you so?’” he said.",
    "“Ladies and gentlemen, we know it and they know it — Donald Trump won,” Finchem said.",
    "The aftermath of the 2020 presidential election changed all that.",
    "“I’ve got a few that have contacted me.",
    "Byrne said he gave the group $15,000.",
    "c.2021 The New York Times Company",
    "“They won’t."
  ]
}