{
  "id": 7220,
  "mediaId": 2723,
  "date": "2022-01-21",
  "headline": "Draft Memo Reveals Trump Had Plan to Order Defense Secretary to Seize Voting Machines",
  "image": "https://www.thenewcivilrightsmovement.com/wp-content/uploads/2020/04/trump-oval-cv-4.jpg",
  "link": "https://www.thenewcivilrightsmovement.com/2022/01/draft-executive-order-reveals-trump-had-plan-to-order-defense-secretary-to-seize-voting-machines/",
  "mediaOutlet": "thenewcivilrightsmovement.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Badash, Bob Brigham, Raw Story",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s unclear if that “peaceful rally” was the violent attack on the U.S. Capitol that has already resulted in about 650 arrests, or the insurrection incitement rally where Donald Trump, Rudy Giuliani, John Eastman, Rep. Mo Brooks, Rep. Madison Cawthorn, Katrina Pierson, Amy Kremer, Texas Attorney General Ken Paxton, Donald Trump Jr., Lara Trump, Eric Trump, Kimberly Guilfoyle, all “riled up the crowd at the now-infamous ‘Stop the Steal’ rally,” that led to the insurrection.",
    "But we’re gonna win it again.”\n\nHere’s how the conservative crowd responded when the flag, now a “talisman” as some are commenting, was trotted out as a revered symbol of insurrection:\n\nAt the rally last night for GOP VA Gov candidate Glenn Youngkin, they said the ‘Pledge of Allegiance’ to a flag that was carried during the insurrection on Jan 6, as if it was sacred or something.",
    "pic.twitter.com/NGEaFFAvdF — Ron Filipkowski (@RonFilipkowski) October 14, 2021\n\nDemocratic gubernatorial nominee Terry McAuliffe did not hold back in condemning the “pledge”:\n\nGlenn Youngkin was endorsed again tonight by Donald Trump at a rally where attendees pledged allegiance to a flag flown at the deadly January 6th insurrection.",
    "so @TerryMcAuliffe pls try to avoid holding any rallies with ISIS or other terrorist groups https://t.co/j4AOgcDcVS — Josh Marshall (@joshtpm) October 14, 2021\n\nFlags are, of course, a fetish, like Crucifixes and Golden Calves, and like religion, patriotism is a tool which demagogues use to manipulate the masses.",
    "The highlight of the evening was supposed to be when Donald Trump called in to motivate supporters at the Steve Bannon-led event, but it appears the crowd was quite taken with a flag Boneta said “was carried at the peaceful rally with Donald Trump on January 6,” and they pledged allegiance to it.",
    "She backed a different Republican candidate for governor of Virginia earlier this year but pro-Trump “folk hero” and GOP activist Martha Boneta was on stage Wednesday night to emcee a rally for far right Virginia Republican gubernatorial nominee Glenn Youngkin, and other GOP candidates.",
    "(@MichelDKerrigan) October 14, 2021\n\nHow quickly “How dare Colin Kaepernick disgrace Old Glory!” became “Let’s celebrate the mass assault on and multiple deaths of cops!” https://t.co/st1NB46hoy — LOLGOP (@LOLGOP) October 14, 2021\n\nWhat would you say if you saw it in another country?",
    "— Terry McAuliffe (@TerryMcAuliffe) October 14, 2021\n\nOn social media some commented on the disturbing symbolism, including the parallels to Nazi Germany:\n\nNot too go all Nazi, but that’s what Hitler did with what became known as the Bloody Flag.",
    "It had been carried during the Beer Hall Putsch in Munich and was later used in Nazi rallies and ceremonies where people would line up to be touched by it.",
    "https://t.co/xgMzjVKyhP — Brendan Nyhan (@BrendanNyhan) October 14, 2021\n\nOh good, now we’ve reached the “Blutfahne” part of the program.",
    "We won in 2020 — the most corrupt election in the history of our country, probably one of the most corrupt anywhere.",
    "(@davegreenidge57) October 14, 2021\n\napparently it’s hard to prevent stuff like this from happening in a campaign.",
    "What the fuck is it going to take to make people realize this is ALL a repeat of late 20s/early 30s Germany?!",
    "And the more sacred such talismans are proclaimed the more venerated they will be.",
    "(We’ve already covered the “Horst Wessel” part with Ashli Babbitt).",
    "— Medium Historian At Large (@one0nine) October 14, 2021",
    "Wednesday night Trump told the crowd, “We won in 2016.",
    "And Glenn is honored to have Trump’s endorsement.",
    "pic.twitter.com/UiiG2AXoEh — Hey, Dave!",
    "Beyond disturbing, this is sick.",
    "— Michael D Kerrigan ????"
  ]
}