{
  "id": 802,
  "mediaId": 2634,
  "date": "2022-04-15",
  "headline": "The Six States That Could Determine Whether Republicans Steal the 2024 Election",
  "image": "https://images.newrepublic.com/60ab825fcd1a570fc828d4023c2dfcc718bb233e.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/165975/six-states-republicans-steal-2024-election",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Ford",
  "authorUrl": "https://newrepublic.com/authors/matt-ford",
  "termIds": [
    1771,
    2201,
    2321,
    2668,
    3736,
    3854,
    4192,
    878
  ],
  "sentences": [
    "To replace Hobbs, Donald Trump favors state Representative Mark Finchem, whom Trump has praised for “his incredibly powerful stance on the massive Voter Fraud that took place in the 2020 Presidential Election Scam.”\nGeorgia\nGovernor: Brian Kemp, a Republican, is up for reelection in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: Controlled by a conservative majority\nElections administered by the secretary of state, with significant legislative influence\nOther key players: Stacey Abrams, a Democrat\nCan they steal it?",
    "Wisconsin\nGovernor: Tony Evers, a Democrat, is up for reelection in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: The court is officially nonpartisan, but has a 4–3 conservative-liberal split\nElections administered by Wisconsin Elections Commission\nOther key players: Assembly Speaker Robin Vos, a Republican, and retired state Supreme Court Justice Michael Gableman, also a Republican\nCan they steal it?",
    "Pennsylvania\nGovernor: Tom Wolf, a Democrat, is term-limited; the next election is in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: Populated by five Democratic justices and two Republican justices\nElections administered by Pennsylvania Secretary of the Commonwealth Leigh Chapman, a Democrat\nOther key players: Pennsylvania Senate President Pro Tempore Jake Corman, a Republican\nCan they steal it?",
    "Michigan\nGovernor: Gretchen Whitmer, a Democrat, is up for reelection in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: Split between four Democratic justices and three Republican justices\nElections administered by Michigan Secretary of State Jocelyn Benson, a Democrat\nOther key players: Ron Weiser and Meshawn Maddock, co-chairs of the state GOP\nCan they steal it?",
    "Texas\nGovernor: Greg Abbott, a Republican, is up for reelection in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: Controlled by nine Republican justices\nElections administered by Texas secretary of state and county judges\nOther key players: Texas Attorney General Ken Paxton, a Republican, and Harris County Judge Lina Hidalgo, a Democrat\nCan they steal it?",
    "Governor Whitmer vetoed similar measures when the legislature passed them through the normal process in 2021; the restrictions, she told lawmakers, “would disproportionately harm communities of color.” If conservative activists manage to collect roughly 340,000 signatures within a 180-day period, however, the proposals she vetoed could yet become law.",
    "Governor: Doug Ducey, a Republican, is term-limited; the next election is in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: All seven justices were appointed by Republican governors\nElections administered by Secretary of State Katie Hobbs, a Democrat\nOther key players: Kelli Ward, state GOP chair\nCan they steal it?",
    "If upheld by the U.S. Supreme Court, this theory, known as the “independent state legislature doctrine,” would allow state lawmakers to draft a wide variety of laws for congressional elections without fear of gubernatorial vetoes or state court reviews.",
    "Over the summer, a Supreme Court ruling upheld a series of restrictions on mail-in ballots that had been challenged by Democrats under the Voting Rights Act of 1965.\nWho runs Arizona’s elections will also shape the outcome of the midterms.",
    "Some of the new law’s provisions, including one that gives partisan poll watchers more discretion to challenge an individual voter’s eligibility, appear destined to manufacture claims of fraud instead of reducing the likelihood of it.",
    "6/10\nSince 2020, Arizona’s attempts to restrict voting have not gone quite as far as those of other states, but, considering that Biden won here by just over 10,000 votes, even modest changes may have an outsize impact on turnout.",
    "Though the proposals aren’t as ambitious as in states where Republicans have complete control, they would be a step back from the system that in the last presidential election produced Michigan’s highest voter turnout on record.",
    "Perhaps most dangerously, state lawmakers can suspend local election officials at will, a power that seems destined to be used against election supervisors in large, majority-Black communities such as those in Fulton County.",
    "Last summer, GOP lawmakers passed a sweeping law that bans 24-hour and drive-through voting, two innovations adopted during the last presidential election by some large counties to reduce lines at polling places.",
    "Inspired by the widely criticized so-called audit of Arizona’s election results, Assembly Speaker Robin Vos announced that he would hire an investigator with taxpayer dollars to review the 2020 results.",
    "4/10\nBecause Governor Evers has veto power and the state’s elections are run by a nonpartisan commission, Wisconsin Republicans haven’t been able to impose major restrictions over the last two years.",
    "But the new law allowed Georgia’s Republican-led legislature to wrest control of the election board from the secretary of state, and opens more channels for partisan figures to warp the process.",
    "3/10\nWith a Democratic governor and a Democratic secretary of state, Michigan’s Republican lawmakers happily have few opportunities to enact restrictions like those seen in Georgia or Texas.",
    "“I believe the legislature ought to take a very hard look at the option of decertification of the 2020 Wisconsin presidential election,” said retired state Supreme Court Justice Gableman.",
    "Some counties used to accept funds and donations from third-party groups to shore up their infrastructure and make voting more accessible; Georgia’s voting law now bans that practice.",
    "Last May, when Governor Ducey signed a bill that abolished the state’s permanent list of early voters, he made it possible to remove Arizonans if they don’t regularly cast a ballot.",
    "They argued that the federal Constitution gives state legislatures the exclusive power to decide how to conduct federal elections and that state supreme courts can’t override it.",
    "They lost much of their discretion to extend the hours at polling places, to set up mobile voting centers, or, in certain larger counties, to expand early-voting hours.",
    "“I will not be part of any effort, and will do everything possible to stop any effort, to put politicians in charge of deciding who wins or loses elections,” he said.",
    "Voting in person is harder too: In a state where some counties are plagued with long lines at precincts, it is now illegal to provide food or water to those waiting.",
    "Nevertheless, the 136-page report echoed points made by fringe far-right groups and accused state and local election officials of a wide variety of illegal activity.",
    "And some have argued that it would give state lawmakers the power to ignore the outcome of a presidential race and appoint a slate of electors of their own choosing.",
    "Georgian voters must now meet strict voter-ID requirements to request an absentee ballot, get less time to make the request, and will find fewer drop-off locations.",
    "More than 15,000 ballots were excluded—a small figure compared to previous elections, but potentially significant, because absentee voters tend to vote Democratic.",
    "In February, two Republican congressional candidates asked the U.S. Supreme Court to block a new congressional map approved by the Pennsylvania Supreme Court.",
    "Another important legal battle in Pennsylvania revolves around redistricting—and an extraordinary legal theory that could have major implications for 2024.",
    "But the 2022 contests could decide whether future elections are conducted fairly, and whether they can proceed without being overturned by partisan actors.",
    "It would also narrow access to absentee ballots and block state officials from sending absentee ballot applications to all eligible voters.",
    "9/10\nIn 2020, Texas went solidly for Donald Trump, but that didn’t stop the state’s Republican leaders from further restricting the vote.",
    "During the first round of the 2022 primaries, in March, that number jumped as high as 30 percent in the state’s most populous counties.",
    "5/10\nLike Michigan, Pennsylvania has a Democratic governor whose veto power limits the GOP’s ability to pass major voting restrictions.",
    "Whether other GOP legislators in the Badger State will accept the results in 2024 if Biden wins again, however, is far from certain.",
    "The Pennsylvania Supreme Court heard oral arguments in March in a lawsuit that sought to overturn the state’s mail-in voting law.",
    "In the midterms, we’ll find out how far the party will go to hold power—particularly when voters want to give it to someone else.",
    "Over the past year, Republican state lawmakers, egged on by former President Donald Trump, passed a wave of voting restrictions.",
    "They can no longer send out absentee-ballot applications to all voters, as Secretary of State Brad Raffensperger did in 2020.",
    "Katie Hobbs, a Democrat who oversaw the 2020 election as secretary of state, is now challenging Ducey for the governorship.",
    "In 2020, The Atlantic reported that Pennsylvania Republican leaders had discussed that option ahead of that year’s contest.",
    "While a ruling may not come in time for the 2022 midterms, it will certainly arrive before the 2024 presidential election.",
    "Under the state constitution, a proposed law that collects enough signatures can be sent to the legislature for approval.",
    "In early 2021, Raffensperger resisted Trump’s pressure to “find 11,780 votes” and give him the state’s electoral votes.",
    "Election officials, furthermore, can no longer send absentee ballot applications to all qualified voters.",
    "Outside organizations have scrutinized Wisconsin’s results and found no signs of tampering or mischief.",
    "Given this, most of the Keystone State’s battles over election law are now taking place in the courts.",
    "In the 2020 election, officials rejected fewer than 1 percent of absentee ballots across the state.",
    "Most important, the governor can’t veto legislation approved by the legislature under this method.",
    "One of the proposed initiatives sought by a GOP-aligned group would enact a strict voter-ID law.",
    "Her departure gives Republicans an opening to take control of a key state’s election machinery.",
    "8/10\nGeorgia has lately become a flashpoint for voting restrictions, and for good reason.",
    "No aspect of the new law is more sinister than its empowerment of the state legislature.",
    "Wisconsin Assembly Majority Leader Jim Steineke, a Republican, denounced the report.",
    "Look to these six states to divine the future of free elections in America.",
    "Midterm elections rarely get as much attention as a presidential contest.",
    "If the legislature approves the proposal, it automatically becomes law.",
    "If not, it goes on the ballot for voter approval in the next election.",
    "But that hasn’t stopped them from undermining elections in other ways.",
    "There are already signs that the new hurdles are having an impact.",
    "One of those leaders, Jake Corman, is now running for governor.",
    "State and local election officials also face novel constraints.",
    "But they may have found a roundabout means of doing it anyway.",
    "In March 2021, a new law erected a medley of barriers.",
    "The right wing is intent on restricting the vote.",
    "How far will it go to hold onto power?"
  ]
}