[
  {
    "id": 7968,
    "mediaId": 188,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "The White House requested for Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span> to resign from the President's Council on Sports, Fitness & Nutrition on Wednesday, or else face termination, according to CNN.",
    "author": "Alex Nitzberg",
    "title": "White House ousts Dr. Mehmet Oz and Herschel Walker from President's Council on Sports, Fitness & Nutrition",
    "sentiment": "-0.833"
  },
  {
    "id": 7932,
    "mediaId": 112,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "President Joe Biden has axed <span class='selected-term'>Herschel Walker</span> and Dr. Mehmet Oz from advisory roles with the Presidents Council on Sports, Fitness & Nutrition due to their current candidacies for the U.S. Senate.",
    "author": "Charles Passy",
    "title": "Why President Biden fired Herschel Walker and Dr. Mehmet Oz from a federal fitness council",
    "sentiment": "-0.81"
  },
  {
    "id": 7940,
    "mediaId": 237,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "A White House official told CNN Wednesday that Oz, along with fellow council member and Republican Senate candidate <span class='selected-term'>Herschel Walker</span>, were in violation of the Biden administration's policy of federal candidates serving on presidential boards.",
    "author": "Heather Hamilton",
    "title": "WATCH: Dr. Oz responds to Bidens request that he resign from fitness council",
    "sentiment": "0.0"
  },
  {
    "id": 7942,
    "mediaId": 136,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Oz, best known as the host of The Dr. Oz Show, and <span class='selected-term'>Herschel Walker</span> were both sent letters on Wednesday asking them to resign by the end of the day or they would be terminated, a White House official told NBC News.",
    "author": "Khaleda Rahman",
    "title": "Dr. Oz Calls Biden 'Petty' After Being Asked to Quit President's Council",
    "sentiment": "-0.607"
  },
  {
    "id": 7950,
    "mediaId": 43,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Just as President Joe Biden has reportedly asked GOP Senate candidates <span class='selected-term'>Herschel Walker</span> and Mehmet Oz to resign their posts on the Presidents Council on Sports, Fitness & Nutrition, Biden has announced his intent to appoint their replacements.",
    "author": "Rebekah Sager",
    "title": "Biden moves to oust GOP Senate candidates Herschel Walker, Dr. Oz for Jos Andrs, Elena Delle Donne",
    "sentiment": "-0.403"
  },
  {
    "id": 7955,
    "mediaId": 43,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span> were both appointed to the President's Council on Sports, Fitness & Nutrition by twice-popular-voter-loser former President Donald Trump.",
    "author": "",
    "title": "Biden requests resignations of Dr. Mehmet Oz and Herschel Walker by end of day",
    "sentiment": "-0.418"
  },
  {
    "id": 7883,
    "mediaId": 63,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "But Mehmet Oz, MD, still brought up Fauci in response to the Biden Administration asking both him and <span class='selected-term'>Herschel Walker</span> to resign from the Council.",
    "author": "Bruce Y. Lee",
    "title": "Dr. Mehmet Oz Asked To Resign From Presidents Council, Brings Up Dr. Fauci Again",
    "sentiment": "0.218"
  },
  {
    "id": 7875,
    "mediaId": 151,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Theres no upside to debate, said Jason Shepherd, the chair of the Republican Party in Cobb County, Ga., if youre someone like <span class='selected-term'>Herschel Walker</span> who is already the frontrunner  and has no experience debating.",
    "author": "",
    "title": "Debate-dodging takes off in midterm campaigns",
    "sentiment": "-0.76"
  }
]