[
  {
    "id": 8349,
    "mediaId": 19,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "Sunday on FNCs Fox & Friends Weekend, former NFL star running back <span class='selected-term'>Herschel Walker</span>, a Republican running for U.S. Senate in Georgia, pushed back against the Biden administrations attempt to pass the so-called Build Back Better agenda.",
    "author": "Trent Baker",
    "title": "Herschel Walker: I Dont Think Anyone Really Trusts the Biden Administration",
    "sentiment": "-0.517"
  },
  {
    "id": 8342,
    "mediaId": 12,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> has spent the opening months on the campaign trail speaking mostly to conservative media outlets that offered him friendly questions.",
    "author": "Tia Mitchell",
    "title": "The Jolt: The Cobb homage to treason planned for Jan. 6",
    "sentiment": "0"
  },
  {
    "id": 8340,
    "mediaId": 12,
    "date": "1/4/2022 12:00:00 AM",
    "sentence": "As a result, Tim Hutchison was exposed to Grizzards unique humor and perspective, which introduced him to the greatest college football player of the day, <span class='selected-term'>Herschel Walker</span>.",
    "author": "Chip Towers",
    "title": "From far and wide, Georgia fans flock to Indianapolis",
    "sentiment": "0.833"
  },
  {
    "id": 8334,
    "mediaId": 65,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "Democrats have already taken to social media to push their support of Warnock, as challengers like former football star Republican <span class='selected-term'>Herschel Walker</span> and former Trump national security official Latham Saddler line up in an attempt to unseat him.",
    "author": "Caitlin McFall",
    "title": "Fight for Senate majority looms one year after Dems won Georgia",
    "sentiment": "0"
  },
  {
    "id": 8329,
    "mediaId": 233,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "",
    "author": "David Whitley",
    "title": "It's time for Georgia to have their day against Alabama in the College Football Playoff championship game",
    "sentiment": "0.0"
  },
  {
    "id": 8330,
    "mediaId": 1460,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "",
    "author": "Mark Whicker",
    "title": "CFP National Championship: Georgia fans anxious about the onrushing Tide",
    "sentiment": "0.0"
  },
  {
    "id": 8324,
    "mediaId": 12,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "And <span class='selected-term'>Herschel Walker</span> is not walking through that door, fans.",
    "author": "Steve Hummer",
    "title": "Champion 1980 Bulldogs have waited long enough for company",
    "sentiment": "0.325"
  },
  {
    "id": 8325,
    "mediaId": 12,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "But during his tenure he has lifted Georgia to place it hasnt been since Vince Dooley landed <span class='selected-term'>Herschel Walker</span> in the spring of 1980 and won a national championship and three SEC championships in a row.",
    "author": "Chip Towers",
    "title": "Once again, Alabama stands in Georgias path to glory",
    "sentiment": "0.0"
  },
  {
    "id": 8327,
    "mediaId": 43,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Those thrill of those triumphs was soon followed by a severe throttling of voting rights in Georgia, by the rise of Marjorie Taylor Green (she of the Jewish Space Lasers) and by the widespread Republican endorsement of <span class='selected-term'>Herschel Walker</span> as Warnocks 2022 opponent.",
    "author": "",
    "title": "our current voting rights threats",
    "sentiment": "0.0"
  },
  {
    "id": 8313,
    "mediaId": 237,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "The Bulldogs have not won a national championship since 1980, when <span class='selected-term'>Herschel Walker</span>, who is now a candidate for the U.S. Senate, helped carry the team to victory as running back.",
    "author": "Daniel Chaitin",
    "title": "Georgia defeats Alabama in college football championship nail-biter",
    "sentiment": "0"
  },
  {
    "id": 8314,
    "mediaId": 12,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "Former Georgia players and coaches inducted into the College Hall of Fame: Charley Trippi, 1959; Vernon Catfish Smith, 1979; Bill Hartman, 1984; Fran Tarkenton, 1987; Coach Vince Dooley, 1994; Coach Wally Butts, 1997; Bill Stanfill, 1998; <span class='selected-term'>Herschel Walker</span>, 1999; Terry Hoage, 2000; Kevin Butler, 2001; John Rauch, 2003; Coach Jim Donnan, 2009; Jake Scott, 2011; Scott Woerner, 2016; Matt Stinchcomb, 2018; David Pollack, 2020.",
    "author": "Chip Towers",
    "title": "Champ Bailey elected to College Football Hall of Fame",
    "sentiment": "0.455"
  },
  {
    "id": 8316,
    "mediaId": 1460,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "The Bulldogs (14-1) hadnt won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "The Associated Press",
    "title": "Georgia outlasts Alabama for 1st national title in 41 years",
    "sentiment": "0"
  },
  {
    "id": 8286,
    "mediaId": 65,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "In other developments:\n- <span class='selected-term'>Herschel Walker</span> leads Georgia celebration as Bulldogs beat Alabama for national title\n- Alabama's Nick Saban delivers message to Georgia's Kirby Smart after national championship loss\n- Questionable Georgia fumble leads to Alabama score in pivotal national title game moment\n- Alabama's Jameson Williams leaves national title game with apparent knee injury\nCLICK HERE TO GET THE FOX NEWS APP\nTODAY'S MUST-READS:\n- Harmony Montgomery: Uncle says he tried to alert authorities about abuse for years\n- Rep. Jim Banks: Bidens response to Russia raises concern\n- Food delivery driver rescues shivering toddler wandering Detroit in the cold\n- New Mexico teen mom throws newborn in dumpster in shocking video\n- 'Rachel Maddow Show' worried Madison Cawthorn might ask to come on show if they asked him for comment: Email\nTHE LATEST FROM FOX BUSINESS:\n- Fed chair hammers home commitment to cooling red-hot inflation\n- JPMorgan CEO Dimon sees very strong economy this year\n- Jon Ossoff exploring bill to ban Congress stock trades, rebuffing Pelosi\n- Sen. Warren demands Federal Reserve release more details on trading scandal\n- Billionaire supermarket CEO warns of potential egg and meat shortage\nSOME PARTING WORDS\nLaura Ingraham told viewers of Foxs \"The Ingraham Angle\" Monday night, \"It's only January 10th, and the web of lies woven by American agents of disinformation is beginning to unravel for all to see now from the government's response to the pandemic, to our military leadership's failures and critical points in between.\"",
    "author": "Jack Durschlag",
    "title": "Chicago, teachers union reach agreement; students return to classrooms Wednesday",
    "sentiment": "0.0"
  },
  {
    "id": 8292,
    "mediaId": 124,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs (14-1) hadnt won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "",
    "title": "Georgia snaps 41-year title drought with 33-18 win over Alabama",
    "sentiment": "0.0"
  },
  {
    "id": 8294,
    "mediaId": 718,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs (14-1) hadnt won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "Ralph D. Russo | Associated Press",
    "title": "Georgia wins first national title in 41 years, beating Alabama 33-18",
    "sentiment": "0.0"
  },
  {
    "id": 8296,
    "mediaId": 65,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ryan Gaydos",
    "title": "Herschel Walker leads Georgia celebration as Bulldogs beat Alabama for national title",
    "sentiment": "0.951"
  },
  {
    "id": 8297,
    "mediaId": 12,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "Bulldog fans were stuck viewing YouTube clips starring <span class='selected-term'>Herschel Walker</span>.",
    "author": "Mark Bradley",
    "title": "Mighty Georgia runs down Bama to claim its long-sought championship",
    "sentiment": "0"
  },
  {
    "id": 8298,
    "mediaId": 233,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "It was Georgia's first national title since 1981, when <span class='selected-term'>Herschel Walker</span> and the Bulldogs capped their undefeated season with a 17-10 victory over Notre Dame in the Sugar Bowl.",
    "author": "Nancy Armour",
    "title": "Georgia shows off Bulldog mentality in beating Alabama for first title since 1980",
    "sentiment": "0.588"
  },
  {
    "id": 8299,
    "mediaId": 1164,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs' last national title came more than four decades ago when freshman running back <span class='selected-term'>Herschel Walker</span> guided them to a 12-0 record and a Sugar Bowl win over Notre Dame.",
    "author": "Connor Grott",
    "title": "Georgia tops Alabama in College Football Playoff for 1st national title since 1980",
    "sentiment": "0"
  },
  {
    "id": 8302,
    "mediaId": 178,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs (14-1) hadn't won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "RALPH D. RUSSO Associated Press",
    "title": "Georgia snaps 41-year title drought with 33-18 win over Bama",
    "sentiment": "0.0"
  },
  {
    "id": 8303,
    "mediaId": 25,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs hadn't won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "",
    "title": "Georgia Bulldogs win first national title since 1980",
    "sentiment": "0"
  },
  {
    "id": 8306,
    "mediaId": 25,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs (14-1) hadn't won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "",
    "title": "Georgia Bulldogs win first college football national title since 1980, beat defending champ and longtime nemesis Alabama 33-18",
    "sentiment": "0.0"
  },
  {
    "id": 8278,
    "mediaId": 238,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "As the coronavirus was sweeping across the United States last summer and the country was still without a vaccine, Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> promoted a mist that he claimed would kill any covid on your body.",
    "author": "",
    "title": "Georgia Senate candidate Herschel Walker promoted a mist that he claimed would kill any covid on your body",
    "sentiment": "-0.865"
  },
  {
    "id": 8279,
    "mediaId": 65,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "(The last time Georgia won this championship was in 1980, with <span class='selected-term'>Herschel Walker</span>.)",
    "author": "Maureen Mackey",
    "title": "Georgia quarterback Stetson Bennett's words to live by: 'Life is tough, work through it'",
    "sentiment": "0.0"
  },
  {
    "id": 8280,
    "mediaId": 43,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "",
    "author": "Rebekah Sager",
    "title": "No big shocker to learn that Herschel Walker hawked 'dry mist' spray to 'clean' you of",
    "sentiment": "-0.713"
  },
  {
    "id": 8270,
    "mediaId": 1390,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "FIRST ON FOX: A super PAC supporting Georgia GOP Senate candidate <span class='selected-term'>Herschel Walker</span> is spending more than $50,000 on a billboard campaign attacking Sen. Raphael Warnock over inflation and gas prices as the midterms loom later this year.",
    "author": "Tyler Olson",
    "title": "Pro-Herschel Walker PAC hits Warnock over gas prices, inflation in billboard ads",
    "sentiment": "-0.857"
  },
  {
    "id": 8272,
    "mediaId": 1576,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "The only other Georgian to speak during primetime was <span class='selected-term'>Herschel Walker</span>, the former University of Georgia and professional football player, a longtime friend of Trumps, who also strongly defended him.",
    "author": "",
    "title": "Georgians At The RNC: An Entirely Different Republican Strategy",
    "sentiment": "-0.399"
  },
  {
    "id": 8268,
    "mediaId": 33,
    "date": "1/19/2022 12:00:00 AM",
    "sentence": "Warnock, chosen by voters in a special election, is on the ballot again this year in a high-profile race that could pit him against Trump's choice for the Republican nomination, the former football star <span class='selected-term'>Herschel Walker</span>.",
    "author": "Fredreka Schouten",
    "title": "Plans to close all but one polling place in a rural Georgia county reverberate through a battleground state",
    "sentiment": "0.0"
  },
  {
    "id": 8260,
    "mediaId": 12,
    "date": "1/21/2022 12:00:00 AM",
    "sentence": "Hell face one of four Republicans, including <span class='selected-term'>Herschel Walker</span>, who have gotten into the GOP primary to challenge him.",
    "author": "Patricia Murphy",
    "title": "OPINION: Raphael Warnocks year of victories, defeats, and Senate prayers",
    "sentiment": "0.0"
  },
  {
    "id": 8261,
    "mediaId": 43,
    "date": "1/21/2022 12:00:00 AM",
    "sentence": "His Senate picks for Georgia (<span class='selected-term'>Herschel Walker</span>), Pennsylvania (Sean Parnell), and North Carolina (Ted Budd) have already muddled GOP chances in three of the most important races.",
    "author": "",
    "title": "It's starting to occur to Trump that some of his endorsements have proven subpar",
    "sentiment": "0"
  },
  {
    "id": 8255,
    "mediaId": 12,
    "date": "1/24/2022 12:00:00 AM",
    "sentence": "Senate candidate <span class='selected-term'>Herschel Walker</span> is holding mostly closed-door events in Georgia, while collecting lucrative fees for private speeches mostly outside of the state.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Internal poll shows voter support for Buckhead cityhood down",
    "sentiment": "0.0"
  },
  {
    "id": 1557,
    "mediaId": 12,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "But none of those military appointments, statewide elections, or traditional Republican check-list attributes have managed to compete with the sheer celebrity of <span class='selected-term'>Herschel Walker</span> since he moved back to Georgia in August and announced his run for Senate, with Donald Trump's blessing.",
    "author": "Patricia Murphy",
    "title": "OPINION: How to run for Senate when you're not Herschel Walker",
    "sentiment": "0.686"
  },
  {
    "id": 1551,
    "mediaId": 65,
    "date": "1/26/2022 12:00:00 AM",
    "sentence": "Walker campaign manager Scott Paradise touted that \"this massive fundraising haul, likely the largest in the country for a non-incumbent, shows that Georgia Republicans are clearly united behind <span class='selected-term'>Herschel Walker</span> and are ready to take on Senator Warnock.\"",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Herschel Walker reports hauling in nearly $10M since launching GOP Senate bid in Georgia",
    "sentiment": "0.906"
  },
  {
    "id": 8239,
    "mediaId": 32,
    "date": "1/26/2022 12:00:00 AM",
    "sentence": "He will ultimately face one of his Republican challengers, including retired football player <span class='selected-term'>Herschel Walker</span> and former Trump administration official Latham Saddler.",
    "author": "Thomas Franck",
    "title": "Democrats bid to keep the Senate will involve plans to fight inflation and promises for a renewed agenda",
    "sentiment": "0"
  },
  {
    "id": 8240,
    "mediaId": 12,
    "date": "1/26/2022 12:00:00 AM",
    "sentence": "This massive fundraising haul, likely the largest in the country for a non-incumbent, shows that Georgia Republicans are clearly united behind <span class='selected-term'>Herschel Walker</span> and are ready to take on Senator Warnock, said his campaign manager Scott Paradise.",
    "author": "Greg Bluestein",
    "title": "Herschel Walker raises another $5.4M for Senate bid",
    "sentiment": "0.849"
  },
  {
    "id": 8228,
    "mediaId": 43,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "He has outraised his GOP opponent, <span class='selected-term'>Herschel Walker</span>, by almost double in the last quarter of 2021, with donations averaging at $43.",
    "author": "Rebekah Sager",
    "title": "Warnock soaring to the lead in fundraising over GOP opponent, Trump lapdog Herschel Walker",
    "sentiment": "-0.902"
  },
  {
    "id": 8230,
    "mediaId": 19,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "In the poll, 872 registered Georgia voters were asked: If the election were held today and the candidates for U.S. Senate were Democrat Raphael Warnock and Republican <span class='selected-term'>Herschel Walker</span>, who would you vote for?",
    "author": "Warner Todd Huston",
    "title": "Poll: Herschel Walker Holds 3-Point lead over Warnock in Georgia Senate Race",
    "sentiment": "0"
  },
  {
    "id": 8232,
    "mediaId": 19,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Republican candidate <span class='selected-term'>Herschel Walker</span> is narrowly beating incumbent Sen. Raphael Warnock (D-GA) by 3.5 points in the race for U.S. Senate in Georgia, according to a new poll.",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Football Legend Herschel Walker Leads Democrat Raphael Warnock in Tight Senate Race",
    "sentiment": "0.45"
  },
  {
    "id": 8214,
    "mediaId": 21,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "Brent D. Griffiths",
    "title": "Herschel Walker says it's 'totally unfair' to ask him if he supports the bipartisan infrastructure bill that passed last year: 'I have to see all the facts'",
    "sentiment": "0.0"
  },
  {
    "id": 8215,
    "mediaId": 12,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "Oh, and a tailback named <span class='selected-term'>Herschel Walker</span>.",
    "author": "Chip Towers",
    "title": "Belief makes Georgia Bulldogs a threat to win it all again",
    "sentiment": "0.0"
  },
  {
    "id": 8218,
    "mediaId": 12,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "Greg Bluestein",
    "title": "Bidens sagging approval could haunt Georgia Democrats",
    "sentiment": "-0.851"
  },
  {
    "id": 8212,
    "mediaId": 120,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "After <span class='selected-term'>Herschel Walker</span> moved to Georgia to launch a Republican U.S. Senate campaign, his team didn't seem especially eager about sending him out on the campaign trail.",
    "author": "Steve Benen",
    "title": "How many times can Herschel Walker fumble before he's benched?",
    "sentiment": "-0.913"
  },
  {
    "id": 8205,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Warnock soaring to the lead in fundraising over GOP opponent, Trump lapdog <span class='selected-term'>Herschel Walker</span>\nThis is a short blurb about Daily Kos.",
    "author": "Rebekah Sager",
    "title": "Perdue kicks off his Stop Stacey campaign with a promise of an election fraud police force",
    "sentiment": "0.0"
  },
  {
    "id": 8207,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Trump-backed Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span> raised almost $5.4 million in the past three months and has about the same amount in the bank.",
    "author": "",
    "title": "candidates are getting 'crushed' in early fundraising: report",
    "sentiment": "0.468"
  },
  {
    "id": 8194,
    "mediaId": 12,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "One detail that caught our eye in <span class='selected-term'>Herschel Walker</span>s fundraising report this week: His campaign paid Donald Trumps Mar-A-Lago resort roughly $135,000 in catering and venue fees last year.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Transgender sports ban introduced with high-powered support",
    "sentiment": "0.555"
  },
  {
    "id": 8195,
    "mediaId": 12,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "U.S. Sen. Raphael Warnock has amassed $23 million in his campaign account  more than four times higher than his closest Republican rival, former football star <span class='selected-term'>Herschel Walker</span>.",
    "author": "Greg Bluestein",
    "title": "Stacey Abrams raises $9.2M after entering gov race in December",
    "sentiment": "0"
  },
  {
    "id": 8196,
    "mediaId": 1576,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Last week, Democratic Sen. Raphael Warnock said he raised $9.8 million in the last three months of 2021, while his Republican challenger <span class='selected-term'>Herschel Walker</span> said donors gave him $5.4 million.",
    "author": "",
    "title": "Stacey Abrams raised $9.25 million since jumping into governor's race",
    "sentiment": "0.0"
  },
  {
    "id": 8190,
    "mediaId": 12,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "In this years Senate race, the poll showed Republican <span class='selected-term'>Herschel Walker</span> favored at 47% to Warnock at 44%, within the margin of error.",
    "author": "Mark Niesse",
    "title": "Sharp growth in Georgia voters alters landscape for 2022 elections",
    "sentiment": "0.0"
  },
  {
    "id": 8188,
    "mediaId": 12,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "In this episode of the Politically Georgia podcast, host Greg Bluestein and political insider Patricia Murphy break down the focus on Donald Trump, Stacey Abrams huge fundraising figures and the pressure on Republican Senate candidates not named <span class='selected-term'>Herschel Walker</span>.",
    "author": "Patricia Murphy",
    "title": "Politically Georgia: David Perdue goes all in with Donald Trump",
    "sentiment": "0.0"
  },
  {
    "id": 8186,
    "mediaId": 19,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "He will likely be facing off against former pro-football player and prominent Trump supporter <span class='selected-term'>Herschel Walker</span> in a state that Biden won narrowly in 2020.",
    "author": "Paul Bois",
    "title": "Vulnerable Democrats Distance from Joe Biden Ahead of Midterms",
    "sentiment": "0"
  },
  {
    "id": 8182,
    "mediaId": 12,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Georgia voters are on edge about rising inflation rates and economic struggles, according to an Atlanta Journal-Constitution poll that also shows Warnock in a tight race against Republican football standout <span class='selected-term'>Herschel Walker</span> in a hypothetical matchup.",
    "author": "Greg Bluestein",
    "title": "Warnock to Georgians in debut 2022 ad: I see you, I hear you, I am you.",
    "sentiment": "0"
  },
  {
    "id": 8183,
    "mediaId": 43,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "(Breaking: Glorious <span class='selected-term'>Herschel Walker</span> Wins 99 Percent Of Vote In Victory Over Raphael Warnock in Georgia Senate Race!)",
    "author": "Bill",
    "title": "Cheers and Jeers: Tuesday",
    "sentiment": "0.929"
  },
  {
    "id": 8184,
    "mediaId": 19,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Georgia Republicans are solidly united behind <span class='selected-term'>Herschel Walker</span>, and 34N22s focus is on sharing Herschels background as a political outsider, successful job creator, and consensus builder with independent and swing voters who will decide this election, Lawson said in a statement.",
    "author": "Ashley Oliver",
    "title": "Exclusive  Watch: Herschel Walker Ad Recalls Georgia Football Legends Small-Town Roots",
    "sentiment": "0.815"
  },
  {
    "id": 8173,
    "mediaId": 12,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "The former president has also backed former football star <span class='selected-term'>Herschel Walker</span> for the U.S. Senate, state Sen. Burt Jones for lieutenant governor and Perdue against Kemp.",
    "author": "Greg Bluestein",
    "title": "Self-proclaimed Black Donald Trump to test ex-presidents brand in rural Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 8174,
    "mediaId": 237,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "McConnell also likes what he sees at the outset in Georgia and Nevada, where he is backing <span class='selected-term'>Herschel Walker</span> and Adam Laxalt, respectively.",
    "author": "David M. Drucker",
    "title": "'The worst of Joe Biden will be over': McConnell pitches voters on GOP Senate",
    "sentiment": "0.0"
  },
  {
    "id": 8165,
    "mediaId": 558,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Georgia Senate Walker\nFILE - Former Georgia running back and Republican Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> attends a college football game between UAB and Georgia, Sept. 11, 2021, in Atlanta.",
    "author": "BRIAN SLODYSKO",
    "title": "Police records complicate Herschel Walker's recovery story",
    "sentiment": "-0.85"
  },
  {
    "id": 8168,
    "mediaId": 43,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Hice is challenging Secretary of State Brad Raffensperger, who also has Trumps support, as does another GOP-er with a long history of violence against women: <span class='selected-term'>Herschel Walker</span> for Senate.",
    "author": "Rebekah Sager",
    "title": "On Jan. 6 Vernon Jones switched parties. Trump's endorsing him for a Congressional seat in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 8171,
    "mediaId": 43,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "In his case, it's almost certainly going to be former NFL star <span class='selected-term'>Herschel Walker</span> and Mark Kelly against his opponents in Arizona.",
    "author": "",
    "title": "What do Bidens approval ratings mean for the midterms? (transcript)",
    "sentiment": "0.0"
  },
  {
    "id": 8156,
    "mediaId": 558,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "(AP Photo/Ben Gray, File)\nATLANTA (AP)  Republicans risk losing the U.S. Senate race if they nominate <span class='selected-term'>Herschel Walker</span>, two of Walker's rivals said, citing a report by The Associated Press about how police confiscated a gun from the former football great following a domestic dispute 20 years ago.",
    "author": "JEFF AMY",
    "title": "Walker's past could let Warnock keep Senate seat, rivals say",
    "sentiment": "-0.977"
  },
  {
    "id": 8159,
    "mediaId": 1576,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "We are very proud of the man <span class='selected-term'>Herschel Walker</span> has become, Diane McKnight, Deans mother, said in a statement provided by Walkers campaign.",
    "author": "",
    "title": "Police records complicate Herschel Walker's recovery story",
    "sentiment": "-0.867"
  },
  {
    "id": 8147,
    "mediaId": 112,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "Associated Press\nHeavily redacted records from 2001 incident at Walkers former home in a gated suburban Dallas subdivision adds another layer to an already turbulent personal history, which includes the former football stars acknowledged struggles with mental health, violent outbursts and accusations that he repeatedly threatened his ex-wife\nWASHINGTON (AP)  One warm fall evening in 2001, police in Irving, Texas, received an alarming call from <span class='selected-term'>Herschel Walker</span>s therapist.",
    "author": "Associated Press",
    "title": "Texas police report provided to the AP under legal compulsion complicates the Herschel Walker redemption tale",
    "sentiment": "-0.977"
  },
  {
    "id": 8140,
    "mediaId": 147,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "And what it  so far, someone like that <span class='selected-term'>Herschel Walker</span> in Georgia got a Trump endorsement and has been raising money blockbuster, even though he wouldn't have necessarily been the most obvious choice as a candidate.",
    "author": "",
    "title": "Tamara Keith and Amy Walter on the Supreme Court vacancy, the fight for control of the GOP",
    "sentiment": "0.0"
  },
  {
    "id": 8141,
    "mediaId": 223,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "Source: AP Photo/Carolyn Kaster\nA new ad from 34N22, a pro <span class='selected-term'>Herschel Walker</span> Super PAC in Georgia is targeting Sen. Raphael Warnock (D-GA) in a rather clever way, by using his own words against him.",
    "author": "Rebecca Downs",
    "title": "Clever New Ad Uses Raphael Warnock's Own Words Against Him",
    "sentiment": "0.0"
  },
  {
    "id": 8132,
    "mediaId": 21,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "The newly minted lawmaker is likely to face off against former professional football star <span class='selected-term'>Herschel Walker</span>  one of many Republican political newcomers Trump has endorsed in races around the country.",
    "author": "Warren Rojas",
    "title": "Sen. Raphael Warnock proposes slashing gas, drug, and shipping costs to beat inflation ahead of a midterm challenge from MAGA",
    "sentiment": "0"
  },
  {
    "id": 8133,
    "mediaId": 12,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Four Heisman Trophy winners, including Johnson Countys <span class='selected-term'>Herschel Walker</span> and Westlakes Cam Newton, played high school football in Georgia.",
    "author": "Todd Holcomb",
    "title": "Plans announced for Georgia High School Football Hall of Fame",
    "sentiment": "0.0"
  },
  {
    "id": 8128,
    "mediaId": 12,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "Brian Kemp is leveraging his office to strengthen his conservative credentials, <span class='selected-term'>Herschel Walker</span> is ignoring his Republican rivals in the U.S. Senate race and tempers are flaring under the Gold Dome.",
    "author": "Patricia Murphy",
    "title": "Politically Georgia: David Perdue calls in a favor from Donald Trump",
    "sentiment": "0.0"
  },
  {
    "id": 1314,
    "mediaId": 195,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> (R) says that he does not support either? Georgia Gov.",
    "author": "",
    "title": "Herschel Walker says he doesn't support 'either' Kemp or Perdue",
    "sentiment": "-0.412"
  },
  {
    "id": 1317,
    "mediaId": 12,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "We told you Tuesday that <span class='selected-term'>Herschel Walker</span> blasted the Biden administration's weak? response to the unfolding Russian invasion of the Ukraine during another stop in Dahlonega.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Herschel Walker: I don't support either' Brian Kemp or David Perdue",
    "sentiment": "-0.243"
  },
  {
    "id": 1319,
    "mediaId": 19,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Herschel Walker Doesn't Support Kemp or Perdue: I'm Mad at Both of Them'",
    "sentiment": "-0.436"
  },
  {
    "id": 8119,
    "mediaId": 12,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "In this edition of the Politically Georgia podcast, host Greg Bluestein and Political Insider columnist Patricia Murphy dig into what theyve learned on the campaign trail with U.S. Sen. Raphael Warnock and Republican <span class='selected-term'>Herschel Walker</span>.",
    "author": "Patricia Murphy",
    "title": "Politically Georgia: Why Warnock is trying to be no ordinary Democratic candidate",
    "sentiment": "0"
  },
  {
    "id": 8112,
    "mediaId": 12,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "The Florida compound will host back-to-back fundraisers in mid-March, along with a third <span class='selected-term'>Herschel Walker</span> event.",
    "author": "Greg Bluestein",
    "title": "The Jolt: Trump stepping up focus on Georgia candidates",
    "sentiment": "0.428"
  },
  {
    "id": 8106,
    "mediaId": 12,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "Former U.S. Sen. David Perdue said Russia wouldnt have invaded its neighbor if Trump was still president and Senate candidate <span class='selected-term'>Herschel Walker</span> faulted Bidens disastrous foreign policy  and Americans themselves.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Trump candidates in Georgia split from pro-Putin rhetoric",
    "sentiment": "0.0"
  },
  {
    "id": 8108,
    "mediaId": 12,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "The fundraiser was for House and Senate candidates, including <span class='selected-term'>Herschel Walker</span>.",
    "author": "Patricia Murphy",
    "title": "OPINION: The good, the bad, and the un-American in the response to the Ukraine crisis",
    "sentiment": "0.0"
  },
  {
    "id": 8105,
    "mediaId": 12,
    "date": "2/26/2022 12:00:00 AM",
    "sentence": "Each of Georgias Trump-endorsed candidates  a quintet that includes Perdue and GOP U.S. Senate front-runner <span class='selected-term'>Herschel Walker</span>  declined to comment on the former presidents glowing words about the Russian leader.",
    "author": "Greg Bluestein",
    "title": "Ukraine could refocus debates in Georgia midterm races",
    "sentiment": "0.0"
  },
  {
    "id": 1287,
    "mediaId": 195,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "Georgia Republican Senate candidate and former NFL star <span class='selected-term'>Herschel Walker</span> is backing out of a planned speech at an event organized by Rep. Marjorie Taylor Greene (R-Ga.) after she attended a white nationalist conference.",
    "author": "Max Greenwood",
    "title": "Herschel Walker pulls out of Greene event after her speech at white nationalist conference",
    "sentiment": "0.308"
  },
  {
    "id": 8097,
    "mediaId": 12,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> pulled out of a weekend event organized by U.S. Rep. Marjorie Taylor Greene after she spoke at a white nationalist rally where attendees cheered Russias invasion of Ukraine and chanted Vladimir Putins name.",
    "author": "Greg Bluestein",
    "title": "Walker wont go to Marjorie Taylor Greene event after she spoke at pro-Putin rally",
    "sentiment": "-0.389"
  },
  {
    "id": 8098,
    "mediaId": 12,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "We wont be surprised if his dad schedules a trip to Georgia in the next few weeks to tout the five-candidate slate hes backing, a group that also includes Senate candidate <span class='selected-term'>Herschel Walker</span>.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Marjorie Taylor Greene to deliver America First response to Biden speech",
    "sentiment": "0.0"
  },
  {
    "id": 8100,
    "mediaId": 157,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> pulled out of an upcoming event organized by Georgia GOP Rep. Marjorie Taylor -- who's come under fire for speaking at an event hosted by white nationalists who praised Russian President Vladimir Putin's invasion of Ukraine, The Atlanta Journal Constitution reports.",
    "author": "Sky Palma",
    "title": "Marjorie Taylor Greene suffers more blowback as GOP Senate hopeful pulls out of her event",
    "sentiment": "0"
  },
  {
    "id": 1279,
    "mediaId": 19,
    "date": "3/3/2022 12:00:00 AM",
    "sentence": "Usually, that signals a potential upset for the incumbent.?\nThe poll also weighed the primary field for the Senate race, which is poised to become an expensive battleground general election contest between incumbent Sen. Raphael Warnock (D-GA) and the leading Republican candidate, <span class='selected-term'>Herschel Walker</span>.",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Kemp Holds Lead over Perdue in Governor's Race; Herschel Walker Dominates Senate Primary",
    "sentiment": "0"
  },
  {
    "id": 8083,
    "mediaId": 12,
    "date": "3/4/2022 12:00:00 AM",
    "sentence": "Plus, our team also discusses how key items of U.S. Sen. Raphael Warnocks agenda made it into the State of the Union and why <span class='selected-term'>Herschel Walker</span> will not be joining U.S. Rep. Marjorie Taylor Greene on the campaign trail this weekend.",
    "author": "Patricia Murphy",
    "title": "Politically Georgia: Why Rivian has charged up the race for governor",
    "sentiment": "0"
  },
  {
    "id": 8073,
    "mediaId": 12,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "Senate candidate <span class='selected-term'>Herschel Walker</span> wasnt the only big name to skip U.S. Rep. Marjorie Taylor Greenes pro-gun rally.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Prepare for surprises this week in Georgia politics",
    "sentiment": "-0.391"
  },
  {
    "id": 1252,
    "mediaId": 12,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Republican Senate candidate <span class='selected-term'>Herschel Walker</span> indicated he won't debate his GOP rivals.",
    "author": "Greg Bluestein",
    "title": "Herschel Walker won't commit to GOP debates, while Kemp ups pressure on Perdue",
    "sentiment": "-0.803"
  },
  {
    "id": 8061,
    "mediaId": 12,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Stephen Lawson, spokesperson for the 34N22 political action committee, which is supporting Republican senate candidate <span class='selected-term'>Herschel Walker</span>, said in February that Warnock's record is causing Georgias gas prices to spike and our country to lose its energy independence.",
    "author": "JEFF AMY",
    "title": "Kemp and Warnock push for halt to gas taxes as prices rise",
    "sentiment": "0.0"
  },
  {
    "id": 8056,
    "mediaId": 12,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "So why is <span class='selected-term'>Herschel Walker</span> using this stage to say that hell bypass showdowns against his Republican rivals?",
    "author": "Greg Bluestein",
    "title": "Politically Georgia: Why Herschel Walker is stiff arming GOP debates",
    "sentiment": "-0.521"
  },
  {
    "id": 1217,
    "mediaId": 65,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "Also scheduled to appear at the March 26 rally with Trump is former professional and college football star running back <span class='selected-term'>Herschel Walker</span>, the clear front-runner in this year's GOP Senate primary in Georgia.",
    "author": "Paul Steinhauser",
    "title": "Trump returning to Georgia to campaign with David Perdue, Herschel Walker",
    "sentiment": "0.832"
  },
  {
    "id": 8044,
    "mediaId": 305,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "Sen. Ralph Warnock is also seeking to win a six-term and Republican <span class='selected-term'>Herschel Walker</span> is unfortunately still trying.",
    "author": "Kalyn Womack",
    "title": "Guess Whos Back: Stacey Abrams Qualifies for 2022 Georgia Governor Race",
    "sentiment": "0.0"
  },
  {
    "id": 8045,
    "mediaId": 12,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "While football great <span class='selected-term'>Herschel Walker</span>s bid for the U.S. Senate hinges on his celebrity, hes just as likely to bring up his reputation as a businessman on the campaign trail.",
    "author": "Greg Bluestein",
    "title": "Herschel Walkers business record reveals creditor lawsuits, exaggerated claims",
    "sentiment": "0.728"
  },
  {
    "id": 8047,
    "mediaId": 1576,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "Republicans: Gary Black, Josh Clark, Kelvin King, Jonathan Jon McColumn, Latham Saddler, <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Candidates confirmed for 2022 election in Georgia as qualifying ends",
    "sentiment": "0.0"
  },
  {
    "id": 8020,
    "mediaId": 21,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Republican Senate candidate <span class='selected-term'>Herschel Walker</span> expressed skepticism over evolution during a recent event at a Georgia church, questioning whether such a thing can be real based on the current existence of apes.",
    "author": "Brent D. Griffiths",
    "title": "GOP Senate candidate Herschel Walker suggests evolution isn't real: 'Science said man came from apes...If that is true, why are there still apes?'",
    "sentiment": "0"
  },
  {
    "id": 8027,
    "mediaId": 157,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Trump-backed Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> recently delivered a diatribe that cast doubt on the science of evolution.",
    "author": "Brad Reed",
    "title": "'Why are there still apes?' Trump-backed Senate candidate casts doubt on evolution",
    "sentiment": "-0.739"
  },
  {
    "id": 8012,
    "mediaId": 12,
    "date": "3/16/2022 12:00:00 AM",
    "sentence": "The Huffington Post dug up footage of leading GOP Senate contender <span class='selected-term'>Herschel Walker</span> questioning the theory of evolution during a recent conversation with pastor Chuck Allen at Sugar Hill Church.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Washington marks anniversary of Atlanta spa shootings",
    "sentiment": "-0.667"
  },
  {
    "id": 8017,
    "mediaId": 43,
    "date": "3/16/2022 12:00:00 AM",
    "sentence": "RELATED STORIES:\nGOP dismisses senate candidates' records of domestic violence, sexual assault allegations\nNo big shocker to learn that <span class='selected-term'>Herschel Walker</span> hawked 'dry mist' spray to 'clean' you of COVID-19\nWalker gave a speech at Sugar Hill Church in Georgia Sunday where he actually questioned the science of evolution, not just implying but challenging the notion that if apes and humans coexisted, that means there is no evolution.",
    "author": "Rebekah Sager",
    "title": "'Why Are There Still Apes? Think About It': Herschel Walker has his doubts about evolution",
    "sentiment": "-0.679"
  },
  {
    "id": 8018,
    "mediaId": 1576,
    "date": "3/16/2022 12:00:00 AM",
    "sentence": "Republican Senate candidate <span class='selected-term'>Herschel Walker</span> questioned the existence of evolution this week in an appearance at a Georgia church.",
    "author": "",
    "title": "Georgia GOP Senate candidate Herschel Walker questions evolution",
    "sentiment": "-0.612"
  },
  {
    "id": 1176,
    "mediaId": 65,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "WHO'S UP AND WHO'S DOWN IN THE LATEST FOX NEWS MIDTERMS POWER RANKINGS\nRepublican Senate candidate Kelvin King charged in comments to the Atlanta Journal Constitution that \"<span class='selected-term'>Herschel Walker</span> talks about working hard and fighting for the interests of Georgians, yet he works behind the scenes to ensure a level of celebrity comfort and elusiveness, separating himself from the questions and engagement that Georgians demand.",
    "author": "Paul Steinhauser",
    "title": "Demolition derby in Georgia as Herschel Walker's GOP primary rivals slam the Senate front-runner",
    "sentiment": "-0.759"
  },
  {
    "id": 7996,
    "mediaId": 12,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "While <span class='selected-term'>Herschel Walker</span>s comments questioning evolution and reproductive medicine caught national attention this week, he also spoke Tuesday at the Rotary Club of Carrollton where he appeared to falsely suggest that NATO hasnt been involved in working to deter Russias invasion of Ukraine.",
    "author": "Greg Bluestein",
    "title": "Its not an autograph tour. Herschel Walkers GOP opponents rip their rival",
    "sentiment": "-0.904"
  },
  {
    "id": 8002,
    "mediaId": 157,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "On Thursday, POLITICO Playbook reported that <span class='selected-term'>Herschel Walker</span>, the former football star running for Senate in Georgia with the endorsement of former President Donald Trump, is now facing attacks from his primary challenger, state Agriculture Commissioner Gary Black, over his history of domestic violence  and it has some GOP strategists privately scared about his viability in the general election.",
    "author": "Matthew Chapman",
    "title": "Republicans worry about pro-Trump Senate candidate's history of domestic violence",
    "sentiment": "-0.929"
  },
  {
    "id": 7989,
    "mediaId": 12,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "Senate candidate <span class='selected-term'>Herschel Walker</span> is ignoring his Republican rivals, while David Perdue is stepping up his appeals to the GOPs far right.",
    "author": "Patricia Murphy",
    "title": "Politically Georgia: Teflon Herschel Walker is frustrating his rivals",
    "sentiment": "-0.929"
  },
  {
    "id": 7973,
    "mediaId": 124,
    "date": "3/22/2022 12:00:00 AM",
    "sentence": "Ex-wife accuses Missouri Senate candidate Eric Greitens of domestic abuse\nMarch 22, 202201:37\nConsider these all of these different problems:\nIn Georgia, GOP frontrunner <span class='selected-term'>Herschel Walker</span> (who is much more likely than Greitens is to win the Republican nomination and has largely consolidated the party around him) has admitted his own past violent behavior as part of his struggle with mental illness.",
    "author": "",
    "title": "The GOP's bid to retake the Senate is encountering early struggles",
    "sentiment": "-0.212"
  },
  {
    "id": 7977,
    "mediaId": 238,
    "date": "3/22/2022 12:00:00 AM",
    "sentence": "He also endorsed <span class='selected-term'>Herschel Walker</span> for Georgias Senate primary, despite serious questions about his business background and alleged history of violent behavior.",
    "author": "",
    "title": "Opinion: Donald Trump has gone from cult leader to weather vane",
    "sentiment": "-0.796"
  },
  {
    "id": 7966,
    "mediaId": 43,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "If the election were today, Senator Warnock could be destined for defeat against Football Star <span class='selected-term'>Herschel Walker</span>, the almost certain nominee for the GOP.",
    "author": "",
    "title": "Can Raphael Warnock win Georgia a Second Time?",
    "sentiment": "0.424"
  },
  {
    "id": 7967,
    "mediaId": 33,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "",
    "author": "Donald Judd and Maegan Vazquez",
    "title": "Biden requests Mehmet Oz and Herschel Walker resign from presidential council or be terminated",
    "sentiment": "-0.208"
  },
  {
    "id": 7968,
    "mediaId": 188,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "The White House requested for Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span> to resign from the President's Council on Sports, Fitness & Nutrition on Wednesday, or else face termination, according to CNN.",
    "author": "Alex Nitzberg",
    "title": "White House ousts Dr. Mehmet Oz and Herschel Walker from President's Council on Sports, Fitness & Nutrition",
    "sentiment": "-0.833"
  },
  {
    "id": 7931,
    "mediaId": 233,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "The White House sent letters to Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span>, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, according to reports by several media outlets.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: Should Russia be kicked out of the G-20?",
    "sentiment": "0"
  },
  {
    "id": 7934,
    "mediaId": 63,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Topline\nRepublican Senate candidate <span class='selected-term'>Herschel Walker</span> said Thursday he wont comply with President Joe Bidens request that he resign from the Presidents Council on Sports, Nutrition and Fitness, even though federal law dictates that the former football star step down from the role and the White House already named his replacement.",
    "author": "Derek Saul",
    "title": "Georgia Senate Candidate Herschel Walker Refuses To Resign From Presidential Council",
    "sentiment": "-0.834"
  },
  {
    "id": 7942,
    "mediaId": 136,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Oz, best known as the host of The Dr. Oz Show, and <span class='selected-term'>Herschel Walker</span> were both sent letters on Wednesday asking them to resign by the end of the day or they would be terminated, a White House official told NBC News.",
    "author": "Khaleda Rahman",
    "title": "Dr. Oz Calls Biden 'Petty' After Being Asked to Quit President's Council",
    "sentiment": "-0.607"
  },
  {
    "id": 7944,
    "mediaId": 21,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "President Joe Biden's administration sent letters to television personality Dr. Mehmet Oz and former NFL player <span class='selected-term'>Herschel Walker</span> Wednesday, asking them to resign from the President's Council on Sports, Fitness & Nutrition or be terminated by the end of the day.",
    "author": "Lauren Frias",
    "title": "Biden asked Dr. Oz and Herschel Walker to resign from a presidential council or be terminated",
    "sentiment": "-0.306"
  },
  {
    "id": 7946,
    "mediaId": 65,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "A similar notification was issued to Georgia Senate candidate <span class='selected-term'>Herschel Walker</span>, who is running for the Senate in Georgia.",
    "author": "",
    "title": "Biden demands Dr. Oz, Herschel Walker step down amid Senate runs",
    "sentiment": "0"
  },
  {
    "id": 7948,
    "mediaId": 237,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "President Joe Biden informed Republican Senate candidates Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span> that they needed to resign from the Presidents Council on Sports, Fitness and Nutrition or they would be removed.",
    "author": "Misty Severi",
    "title": "Biden forces out Dr. Oz and Herschel Walker from fitness council",
    "sentiment": "-0.532"
  },
  {
    "id": 7926,
    "mediaId": 19,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "Friday on Newsmax TVs Spicer & Co., Georgia U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> suggested the Biden administration was using its call for his resignation from the Sports & Fitness Council to help out his opponent, incumbent Sen. Raphael Warnock (D-GA).",
    "author": "Jeff Poor",
    "title": "Walker: Theyre Trying to Help Out My Opponent with Fitness Council Removal  Im Going to Beat Him Anyway",
    "sentiment": "-0.85"
  },
  {
    "id": 7900,
    "mediaId": 237,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "Heather Hamilton",
    "title": "Single most dangerous time: Trump blasts climate change, CRT, and KBJ",
    "sentiment": "0"
  },
  {
    "id": 7904,
    "mediaId": 12,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Trump also wants to boost former Georgia football star <span class='selected-term'>Herschel Walker</span>, the Republican frontrunner in the race for U.S. Senate who is already looking ahead to a matchup against Democratic incumbent Raphael Warnock.",
    "author": "Greg Bluestein",
    "title": "Perdue welcomes Trump to Georgia by embracing stolen election lie",
    "sentiment": "0.0"
  },
  {
    "id": 7906,
    "mediaId": 558,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Saturdays rally in Commerce, 70 miles north-east of Atlanta and one of the most conservative parts of the state, is expected to feature <span class='selected-term'>Herschel Walker</span>, a former football player running for the US Senate; Perdue; and the congressional candidate Vernon Jones, a former Democratic state representative who began calling himself the Black Donald Trump after switching parties.",
    "author": "Edward Helmore",
    "title": "Trump heads to Georgia in high-stakes bid to shape Republican primaries",
    "sentiment": "0.277"
  },
  {
    "id": 7911,
    "mediaId": 19,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Multiple Trump-endorsed candidates are scheduled to speak at Saturdays rally, including former football star and current Republican primary Senate candidate <span class='selected-term'>Herschel Walker</span> and former Senator and current gubernatorial candidate David Perdue.",
    "author": "Ethan Letkeman",
    "title": "Watch Live: Donald Trump Holds Save America Rally in Commerce, Georgia",
    "sentiment": "0"
  },
  {
    "id": 7886,
    "mediaId": 136,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "",
    "author": "Xander Landen",
    "title": "Trump Rally in Georgia Helps Stacey Abrams With Fundraising Appeal",
    "sentiment": "0"
  },
  {
    "id": 7889,
    "mediaId": 237,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "The 45th president added that the stakes for <span class='selected-term'>Herschel Walker</span>, a GOP Senate candidate in the Peach State and former star running back, are also high.",
    "author": "Heather Hamilton",
    "title": "'It's a vote for this country': Trump touts David Perdue for Georgia's next governor",
    "sentiment": "0.814"
  },
  {
    "id": 7894,
    "mediaId": 12,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "If Kemp runs, I think <span class='selected-term'>Herschel Walker</span> will be seriously and negatively impacted, Trump thundered from the stage at an old racetrack in Commerce.",
    "author": "Greg Bluestein",
    "title": "Trump brings his anti-Kemp campaign to Georgia",
    "sentiment": "-0.388"
  },
  {
    "id": 5441,
    "mediaId": 124,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "Brian Kemp, and Senate hopeful <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Midterm environment looks more like 2010 than 2018 in NBC News poll",
    "sentiment": "0.0"
  },
  {
    "id": 5437,
    "mediaId": 12,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Our team digs into why Georgia is the biggest test of Trumps influence, how Perdue is taking his complaints about the 2020 election one step further, and why <span class='selected-term'>Herschel Walker</span> is taking a different approach.",
    "author": "Patricia Murphy",
    "title": "Did Donald Trump's visit to Georgia change anything?",
    "sentiment": "0.0"
  },
  {
    "id": 7875,
    "mediaId": 151,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Theres no upside to debate, said Jason Shepherd, the chair of the Republican Party in Cobb County, Ga., if youre someone like <span class='selected-term'>Herschel Walker</span> who is already the frontrunner  and has no experience debating.",
    "author": "",
    "title": "Debate-dodging takes off in midterm campaigns",
    "sentiment": "-0.76"
  },
  {
    "id": 7877,
    "mediaId": 12,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Republican Senate hopeful <span class='selected-term'>Herschel Walker</span> indicated recently that he would avoid debates against his GOP rivals and instead focus on Democratic U.S. Sen. Raphael Warnock.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Lawmakers rush to finish favorite bills before time runs out",
    "sentiment": "0"
  },
  {
    "id": 7873,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span> has been dodging debates, and given Walker's current campaigning there's no mystery there, either.",
    "author": "",
    "title": "Republicans begin to abandon debates, just as they've abandoned moderates (and common sense)",
    "sentiment": "-0.695"
  },
  {
    "id": 5366,
    "mediaId": 12,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "You can even tell your smart speaker to play Politically Georgia podcast.?\nWeve uncovered audio of Republican Senate candidate <span class='selected-term'>Herschel Walker</span>s speech to a private closed-door fundraiser in Texas earlier this month where he makes broad statements about climate change.",
    "author": "Tia Mitchell",
    "title": "The Jolt: See Sonny Perdues resume for his new $524,000 job as chancellor",
    "sentiment": "0.0"
  },
  {
    "id": 7854,
    "mediaId": 165,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "William Vaillancourt",
    "title": "Turns Out Herschel Walker, Who Questioned How Evolution Is Possible, Repeatedly Lied About His Academic Record",
    "sentiment": "-0.824"
  },
  {
    "id": 7858,
    "mediaId": 151,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Republican Senate candidate <span class='selected-term'>Herschel Walker</span> speaks at a rally featuring former President Donald Trump on Sept. 25, 2021, in Perry, Ga. | Sean Rayford/Getty Images\nBy Natalie Allison\n 04/01/2022 04:31 AM EDT\nHerschel Walker, the former football star whos armed with former President Donald Trumps enthusiastic endorsement, has been on a glide path to the GOP nomination since announcing his Senate bid in Georgia.",
    "author": "",
    "title": "The baggage is too heavy: GOP foes tee up last-ditch effort to sink Herschel Walker",
    "sentiment": "-0.856"
  },
  {
    "id": 7864,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "CNN:\nFor years, <span class='selected-term'>Herschel Walker</span> has told the same inspiring story: that he graduated in the top 1% of his class at the University of Georgia.",
    "author": "",
    "title": "candidate Walker claimed he graduated in the top 1% of his college class. He didn't",
    "sentiment": "0.386"
  },
  {
    "id": 7865,
    "mediaId": 157,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Trump-backed Georgia Senate candidate <span class='selected-term'>Herschel Walker</span>, who is already facing several allegations of abusive and violent behavior toward women, now has another scandal to contend with.",
    "author": "Brad Reed",
    "title": "Scandal-plagued MAGA candidate Herschel Walker 'repeatedly misrepresented his academic credentials': report",
    "sentiment": "-0.951"
  },
  {
    "id": 7849,
    "mediaId": 169,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "For years now, GOP Senate candidate <span class='selected-term'>Herschel Walker</span> has boasted about graduating in the top 1% of his class at the University of Georgia; but recent evidence has come to light indicating that he actually didn't graduate at all.",
    "author": "Kelly McClure",
    "title": "GOP Senate candidate Herschel Walker lied about his college achievements",
    "sentiment": "0.743"
  },
  {
    "id": 7850,
    "mediaId": 12,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "The best-known GOP candidate is <span class='selected-term'>Herschel Walker</span>, a former football player with a history of violence against women and erratic behavior that has dogged his campaign.",
    "author": "Greg Bluestein",
    "title": "Warnocks ex-wife takes legal action over child custody",
    "sentiment": "-0.375"
  },
  {
    "id": 7852,
    "mediaId": 21,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "For years in radio show appearances, motivational speeches, and campaign events, Georgia GOP Senate candidate <span class='selected-term'>Herschel Walker</span> said he'd graduated as valedictorian of his class at the University of Georgia.",
    "author": "Katherine Tangalakis-Lippert",
    "title": "For years, Georgia GOP Senate candidate Herschel Walker claimed he'd graduated in the top 1% of his class at University of Georgia  but he never graduated at all",
    "sentiment": "-0.894"
  },
  {
    "id": 7848,
    "mediaId": 129,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "No one, and I mean not one person, would seriously believe that <span class='selected-term'>Herschel Walker</span>, the former football star and current leading contender for the Republican Senate nomination in Georgia, was at the top of his class at the University of Georgia.",
    "author": "",
    "title": "Herschel Walker, the Worst Candidate, Trump-Approved",
    "sentiment": "-0.649"
  },
  {
    "id": 7844,
    "mediaId": 120,
    "date": "4/4/2022 12:00:00 AM",
    "sentence": "After retiring from professional athletics, <span class='selected-term'>Herschel Walker</span> has held a handful of different jobs, including working as a paid motivational speaker.",
    "author": "Steve Benen",
    "title": "Herschel Walkers latest fumble is over his education",
    "sentiment": "-0.843"
  },
  {
    "id": 7846,
    "mediaId": 43,
    "date": "4/4/2022 12:00:00 AM",
    "sentence": "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n GA-Sen: Former football star <span class='selected-term'>Herschel Walker</span> has been the undisputed frontrunner for the Republican nomination to take on Democratic Sen. Raphael Warnock from the moment he entered the race in August, but now his intra-party critics are preparing to wage an expensive ad campaign to weaken him ahead of the May 24 primarydespite Donald Trump's full-throated support for the one-time University of Georgia running back.",
    "author": "",
    "title": "Morning Digest: Georgia Republicans try to take down Herschel Walker, despite Trump's backing",
    "sentiment": "-0.898"
  },
  {
    "id": 7837,
    "mediaId": 195,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Georgia Sen. Raphael Warnock (D) narrowly trails Republican <span class='selected-term'>Herschel Walker</span> in the Peach States marquee Senate race, according to a new The Hill/Emerson College poll.",
    "author": "Tal Axelrod",
    "title": "Herschel Walker leads Warnock in Georgia Senate race: poll",
    "sentiment": "0"
  },
  {
    "id": 7838,
    "mediaId": 19,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> holds a narrow lead over incumbent Sen. Raphael Warnock (D-GA) in a hypothetical matchup in the race for U.S. Senate in Georgia, according to a poll published Wednesday.",
    "author": "Ashley Oliver",
    "title": "Poll: Herschel Walker Leads Raphael Warnock in Tight Georgia Senate Race",
    "sentiment": "0.583"
  },
  {
    "id": 2153,
    "mediaId": 305,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Republican Senate candidate <span class='selected-term'>Herschel Walker</span>, the same one who claimed to have a COVID cure, is narrowly winning an early poll against Sen. Raphael Warnock (D-GA), according to The Hill.",
    "author": "Murjani Rawls",
    "title": "Herschel Walker Leads Raphael Warnock In Early Georgia Senate Poll",
    "sentiment": "-0.616"
  },
  {
    "id": 2155,
    "mediaId": 239,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> has surged ahead of Democratic Sen. Raphael Warnock in the high-profile Georgia U.S. Senate contest, according to a poll released Wednesday.",
    "author": "Valerie Richardson",
    "title": "Herschel Walker opens up lead over Raphael Warnock in Georgia Senate poll",
    "sentiment": "0.91"
  },
  {
    "id": 7827,
    "mediaId": 12,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "DAHLONEGA  Taking the stage of a packed gym in the foothills of North Georgia, <span class='selected-term'>Herschel Walker</span> gave the audience exactly what they wanted: a raft of conservative campaign promises, including a pledge to rid the state of Democratic U.S. Sen. Raphael Warnock.",
    "author": "Greg Bluestein",
    "title": "Cruise control? Walker ignores rivals, aims for Warnock ahead of May primary",
    "sentiment": "-0.729"
  },
  {
    "id": 7821,
    "mediaId": 65,
    "date": "4/8/2022 12:00:00 AM",
    "sentence": "A campaign staffer for former NFL star <span class='selected-term'>Herschel Walker</span>, who is running as a Republican for a Senate seat in Georgia, posted a photo with Clarence Thomas on Friday afternoon marking the first time Thomas has been seen since being released from a hospital on March 25 following an undisclosed illness.",
    "author": "Andrew Mark Miller",
    "title": "Clarence Thomas publicly spotted for first time since being hospitalized",
    "sentiment": "0"
  },
  {
    "id": 7824,
    "mediaId": 188,
    "date": "4/8/2022 12:00:00 AM",
    "sentence": "Remarking on a photo of <span class='selected-term'>Herschel Walker</span> and Supreme Court Justice Clarence Thomas, Democratic Rep. Mondaire Jones of New York asked whether Thomas will recuse himself from any cases that emerge from the Peach State's 2022 Senate election contest.",
    "author": "Alex Nitzberg",
    "title": "'I think the court has crossed the rubicon': Sen. Chris Murphy sounds alarm over photo of Supreme Court Justice Clarence Thomas with US Senate candidate Herschel Walker",
    "sentiment": "0"
  },
  {
    "id": 7818,
    "mediaId": 195,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "Warnock is anticipated to run against former football star <span class='selected-term'>Herschel Walker</span> in a race that will see millions of dollars spent on the campaign trail to gain even the slightest edge.",
    "author": "Tal Axelrod",
    "title": "Warnock grapples with strong headwinds in Georgia",
    "sentiment": "0.428"
  },
  {
    "id": 7815,
    "mediaId": 12,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Former football great <span class='selected-term'>Herschel Walker</span> skipped the first major Republican U.S. Senate debate, but his absence at the event in Gainesville on Saturday helped shape the back-and-forth among the five candidates who showed up.",
    "author": "Greg Bluestein",
    "title": "Herschel Walkers no-show looms large over Senate GOP debate",
    "sentiment": "-0.678"
  },
  {
    "id": 7817,
    "mediaId": 157,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Republican U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> used Michael Jackson's \"Man in the Mirror\" anthem on Sunday to call for more oil drilling in the United States.",
    "author": "David Edwards",
    "title": "Herschel Walker cites Michael Jackson's 'Man in the Mirror' to call for more oil drilling",
    "sentiment": "-0.469"
  },
  {
    "id": 7797,
    "mediaId": 120,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "Herschel Walker's awkward Fox News interview is hard to watch",
    "sentiment": "-0.908"
  },
  {
    "id": 7798,
    "mediaId": 120,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "Herschel Walker's awkward Fox News interview is hard to watch",
    "sentiment": "-0.918"
  },
  {
    "id": 7800,
    "mediaId": 195,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, Trump recently endorsed former television host Mehmet Oz (R) to replace retiring Sen. Pat Toomey (R)\nHe also is backing former football star <span class='selected-term'>Herschel Walker</span> (R) in the Georgia race against Sen. Raphael Warnock (D).",
    "author": "Elizabeth Crisp",
    "title": "Trump approval ratings still strong in key battleground states: poll",
    "sentiment": "0"
  },
  {
    "id": 7812,
    "mediaId": 43,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "By him going out, giving up all the energy, now we're not energy independent anymore, which started the whole downfall\" -- <span class='selected-term'>Herschel Walker</span>'s analysis of energy policy doesn't show a grasp of details or really anything at all pic.twitter.com/WR5GkqS8ma\n Aaron Rupar (@atrupar) April 10, 2022\nMeanwhile, although Walker was more than willing to chat up Fox News Maria Bartiromo Sunday morning, he skipped out on the first major GOP Senate debate on Saturday.",
    "author": "Rebekah Sager",
    "title": "Herschel Walker's financial reporting 'may raise questions for voters,' expert says",
    "sentiment": "-0.753"
  },
  {
    "id": 7790,
    "mediaId": 12,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "With less than a month until early voting begins in the Georgia primaries, the increasingly frustrated Republicans running against <span class='selected-term'>Herschel Walker</span> are accusing the famous former footballer of conducting what they call the basement strategy, of President Joe Biden, who kept a restricted schedule during the pandemic campaign of 2020.",
    "author": "Patricia Murphy",
    "title": "OPINION: Herschel Walkers Velvet Rope Campaign",
    "sentiment": "-0.557"
  },
  {
    "id": 7792,
    "mediaId": 120,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "Former athlete <span class='selected-term'>Herschel Walker</span>, of course, was the only contender who refused to show up.",
    "author": "Steve Benen",
    "title": "Why Herschel Walkers fumble on energy policy matters",
    "sentiment": "-0.773"
  },
  {
    "id": 7795,
    "mediaId": 157,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "In a column for MSNBC, political analyst Steve Benen suggested that retired football player <span class='selected-term'>Herschel Walker</span> is completely out of his depth as an aspiring candidate for the Republican nomination to oppose Sen. Raphael Warnock (D-GA).",
    "author": "Tom Boggioni",
    "title": "Herschel Walker can't even 'pretend to be competent': analyst",
    "sentiment": "-0.861"
  },
  {
    "id": 7778,
    "mediaId": 558,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "Despite a flurry of bad press and complaints from his primary competitors that hes avoiding the campaign trail, <span class='selected-term'>Herschel Walker</span> is the leading Republican contender in the race to face the Democratic incumbent, Raphael Warnock, in this falls key Georgia Senate race.",
    "author": "Christopher Wilson",
    "title": "Republican rivals try to topple Georgia football star Herschel Walker in key Senate race",
    "sentiment": "-0.791"
  },
  {
    "id": 7783,
    "mediaId": 19,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> holds a five-point lead over incumbent Sen. Raphael Warnock (D-GA) in a hypothetical matchup for Georgias U.S. Senate seat, according to a recent poll.",
    "author": "Jacob Bliss",
    "title": "Poll: Republican Herschel Walker Shows 5-Point Lead over Democrat Sen. Raphael Warnock",
    "sentiment": "0"
  },
  {
    "id": 7787,
    "mediaId": 43,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Top Comments: The purpose of the lie",
    "sentiment": "0.63"
  },
  {
    "id": 7788,
    "mediaId": 43,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "RELATED STORY: <span class='selected-term'>Herschel Walker</span>'s financial reporting 'may raise questions for voters,' expert says\nWalker has made mind-numbing missteps, such as referring to the late Rep. John Lewis as a senator, even implying that Lewis wouldnt have supported the bill named in his honor.",
    "author": "Rebekah Sager",
    "title": "Former NFL star, current Senate candidate Herschel Walker gets new coaches: McConnell, Cruz, Trump",
    "sentiment": "-0.449"
  },
  {
    "id": 5139,
    "mediaId": 63,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Polling shows Trump-endorsed Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> (R) leading incumbent Sen. Raphael Warnock (D-Ga.) despite Walkers campaign being plagued by a series of gaffes, like Walkers assertion that the existence of apes is evidence that evolution is not real.",
    "author": "Nicholas Reimann",
    "title": "Trump Reportedly Backing J.D. Vance In Ohio Senate RaceLatest Test Of Dubious Endorsement Power",
    "sentiment": "-0.892"
  },
  {
    "id": 7763,
    "mediaId": 120,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "A quickly growing stack of evidence has made something impossible to ignore: Republican Senate candidate <span class='selected-term'>Herschel Walker</span> is a serial fabricator.",
    "author": "Zeeshan Aleem",
    "title": "Why Herschel Walker's constant lies aren't hurting him",
    "sentiment": "-0.214"
  },
  {
    "id": 7764,
    "mediaId": 120,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Its no secret that <span class='selected-term'>Herschel Walker</span> is running for the U.S. Senate despite not having any background in politics, policy, governing, or elected office.",
    "author": "Steve Benen",
    "title": "Herschel Walkers business claims seem divorced from the truth",
    "sentiment": "-0.658"
  },
  {
    "id": 7765,
    "mediaId": 237,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "The numbers reflect the high-stakes nature of the Senate race between Warnock and his likely Republican opponent, former University of Georgia football star <span class='selected-term'>Herschel Walker</span>.",
    "author": "Cami Mondeaux",
    "title": "Sen. Warnock has over $25 million in the bank for fight against GOP rival Walker",
    "sentiment": "0"
  },
  {
    "id": 7766,
    "mediaId": 195,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "That bank account is anticipated to be a key advantage in his bid this year for a full term against likely GOP nominee <span class='selected-term'>Herschel Walker</span>, the former NFL star.",
    "author": "Tal Axelrod",
    "title": "Warnock raises $13.6 million in first quarter of 2022",
    "sentiment": "0"
  },
  {
    "id": 7767,
    "mediaId": 237,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Warnock, who was found trailing GOP challenger <span class='selected-term'>Herschel Walker</span> in a recent poll, asked the Fulton County court jointly with his ex-wife Ouleye Ndoye to make the records of their divorce and custody battle over their two children unavailable to the public.",
    "author": "Virginia Aabram",
    "title": "Embattled Democratic Sen. Warnock and ex-wife file to seal custody battle record",
    "sentiment": "-0.852"
  },
  {
    "id": 7768,
    "mediaId": 12,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span>, the GOP frontrunner, ended 2021 with roughly $5 million in the bank.",
    "author": "Greg Bluestein",
    "title": "Warnock sets another fundraising record, ends quarter with $25.6M in the bank",
    "sentiment": "0"
  },
  {
    "id": 7771,
    "mediaId": 424,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "",
    "author": "Elie Mystal",
    "title": "The Herschel Walker Senate Campaign Is an Insult to Black People",
    "sentiment": "-0.947"
  },
  {
    "id": 7772,
    "mediaId": 239,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> is the frontrunner among six GOP candidates in the May 24 primary.",
    "author": "Jeff Amy",
    "title": "Georgias Sen. Warnock raises $13.6M in 2022s first quarter",
    "sentiment": "0.908"
  },
  {
    "id": 7773,
    "mediaId": 1576,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> is the frontrunner among six GOP candidates in the May 24 primary.",
    "author": "",
    "title": "Georgia's Sen. Warnock raises $13.6M in 2022's first quarter",
    "sentiment": "0.927"
  },
  {
    "id": 2064,
    "mediaId": 65,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: Republican Senate candidate <span class='selected-term'>Herschel Walker</span> racked up another impressive fundraising haul for his Senate campaign as he tries to unseat Democratic Sen. Raphael Warnock of Georgia in November's midterm elections.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Herschel Walker raises $5.5M the past three months in his GOP Senate bid in Georgia",
    "sentiment": "0.689"
  },
  {
    "id": 5135,
    "mediaId": 12,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "In this episode of the Politically Georgia podcast, AJC political insiders Greg Bluestein and Patricia Murphy breakdown how the Democrat will use the $25 million hes amassed -- and how GOP frontrunner <span class='selected-term'>Herschel Walker</span> plans to respond.",
    "author": "Patricia Murphy",
    "title": "A tidal wave of cash hits Georgias Senate race",
    "sentiment": "0"
  },
  {
    "id": 7739,
    "mediaId": 136,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "\"<span class='selected-term'>Herschel Walker</span> will never let you down,\" Trump said in a statement last year that declared his \"complete and total endorsement\" for the candidate, CNN reported.",
    "author": "Zoe Strozewski",
    "title": "Herschel Walker Is Betting Favorite to Win Georgia Senate Seat",
    "sentiment": "0.748"
  },
  {
    "id": 7743,
    "mediaId": 12,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Republican Senate front-runner <span class='selected-term'>Herschel Walker</span> said his campaign committees amassed $5.5 million the first three months of the year for his bid to unseat Democratic U.S. Sen. Raphael Warnock.",
    "author": "Greg Bluestein",
    "title": "Herschel Walkers campaign raises $5.5M for Senate bid",
    "sentiment": "-0.614"
  },
  {
    "id": 7745,
    "mediaId": 305,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Senate candidate <span class='selected-term'>Herschel Walker</span> skipped the first major Republican debate with less than a month until early voting begins in the Georgia primariesmostly sticking to controlled appearances and rallies.",
    "author": "Murjani Rawls",
    "title": "The Republican National Committee's Decision to Withdraw From Future Debates Is No Big Surprise",
    "sentiment": "-0.689"
  },
  {
    "id": 7747,
    "mediaId": 65,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Georgia U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> asserted that the Democratic Party \"has left Brown and Black people behind\" Thursday on \"Hannity.\"",
    "author": "",
    "title": "Herschel Walker responds to Elie Mystal's attack: Democratic Party 'has left Brown and Black people behind'",
    "sentiment": "-0.897"
  },
  {
    "id": 7751,
    "mediaId": 1576,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Football icon and Georgia Republican <span class='selected-term'>Herschel Walker</span> said Friday that his U.S. Senate campaign had raised $5.5 million in the first three months of 2022, a big haul that is still dwarfed by the $13.6 million that Democratic incumbent Raphael Warnock raised in the same period.",
    "author": "",
    "title": "Walker raises $5.5M in Georgia Senate race, trailing Warnock",
    "sentiment": "0.408"
  },
  {
    "id": 7752,
    "mediaId": 19,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Discussing Georgia Republican U.S. Senate candidate <span class='selected-term'>Herschel Walker</span>, fill-in host Katie Fang said, He will eventually have to address the critical issues, the core issues, the kitchen table issues that are confronting not only all of us and the United States by the people in Georgia.",
    "author": "Pam Key",
    "title": "Elie Mystal: Crazy Trumpers Have Completely Taken Over GOP",
    "sentiment": "0.0"
  },
  {
    "id": 7754,
    "mediaId": 19,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "The Nations justice correspondent Elie Mystal said Friday on MSNBCs All In that Georgia Republican U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> is a clown candidate that voters should punish Republicans for putting forward.",
    "author": "Pam Key",
    "title": "Mystal: Voters Need to Punish GOP for Putting Forward Clown Candidate Herschel Walker",
    "sentiment": "-0.861"
  },
  {
    "id": 7755,
    "mediaId": 19,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Thursday on Fox News Channels Hannity, Georgia Republican U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> reacted to a piece from The Nations Elie Mystal declaring Walker to be an insult to black people.",
    "author": "Jeff Poor",
    "title": "Herschel Walker Responds to The Nations Elie Mystal: Im Not Going to Have You to Bully Me Because You Cant",
    "sentiment": "-0.85"
  },
  {
    "id": 7758,
    "mediaId": 188,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span> graciously invited progressive journalist Elie Mystal to meet him and \"break bread\" after Mystal viciously attacked Walker's candidacy, but the offer was snubbed.",
    "author": "Chris Pandolfo",
    "title": "Herschel Walker invites progressive who viciously attacked him to 'break bread,' gets an utterly contemptuous response",
    "sentiment": "-0.828"
  },
  {
    "id": 2026,
    "mediaId": 65,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "But the National Right to Life Committee is endorsing Republican Senate candidate <span class='selected-term'>Herschel Walker</span>, who has been outspoken in his support to outlaw abortion as he runs this year to challenge Democratic Sen. Raphael Warnock of Georgia in a crucial Senate showdown that could determine whether the GOP wins back the chamber's majority.",
    "author": "Paul Steinhauser",
    "title": "Georgia Senate race: Herschel Walker lands endorsement of leading anti-abortion group",
    "sentiment": "0.853"
  },
  {
    "id": 7709,
    "mediaId": 195,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Georgia deserves a pro-life senator like <span class='selected-term'>Herschel Walker</span> who is committed to building a culture of life, Tobias said in the NRLCs endorsement announcement.",
    "author": "Natalie Prieb",
    "title": "National Right to Life endorses Herschel Walker",
    "sentiment": "0.94"
  },
  {
    "id": 7712,
    "mediaId": 238,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Finally, Republicans who refuse to show up for debates, such as Senate candidates <span class='selected-term'>Herschel Walker</span> in Georgia and Rep. Ted Budd in North Carolina, should be asked at every opportunity why they are hiding.",
    "author": "",
    "title": "Opinion: The media still havent learned how to cover the GOP threat to democracy",
    "sentiment": "-0.248"
  },
  {
    "id": 7717,
    "mediaId": 43,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Take the PAC's heaviest commitment of $37 million in Georgia, where Republicans have one of their best pickup chances but are saddled with alleged wife abuser <span class='selected-term'>Herschel Walker</span>, who has written about his struggles with violent episodes partially fueled by his multiple personalities.",
    "author": "",
    "title": "Midterms will be a heavy lift for the Senate GOP. One super PAC is already shelling out $141 million",
    "sentiment": "-0.556"
  },
  {
    "id": 6281,
    "mediaId": 43,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "x\nx\n1\nState\nName\nParty\n1Q\nRaised\nSelf-\nFund\nSpent\nCash\nRaised\nCTD\nSelf-Fund\nCTD\nx\nx\n2\nAK\nLisa Murkowski\n(R-inc)\n$1,574\n$0\n$550\n$5,288\n$7,453\n$0\n3\nAK\nKelly Tshibaka\n(R)\n$664\n$0\n$330\n$968\n$2,484\n$0\n4\nAL\nKatie Boyd Britt\n(R)\n$1,415\n$0\n$2,236\n$3,229\n$6,404\n$0\n5\nAL\nMo Brooks\n(R)\n$490\n$0\n$899\n$1,570\n$2,662\n$0\n6\nAL\nMike Durant\n(R)\n$290\n$2,650\n$1,352\n$4,096\n$455\n$6,800\n7\nAR\nJohn Boozman\n(R-inc)\n$1,114\n$0\n$2,116\n$2,508\n$5,521\n$0\n8\nAR\nJake Bequette\n(R)\n$335\n$0\n$191\n$556\n$1,107\n$35\n9\nAR\nJan Morgan\n(R)\n$211\n$0\n$217\n$55\n$546\n$1\n10\nAZ\nMark Kelly\n(D-inc)\n$11,165\n$0\n$6,439\n$23,320\n$39,000\n$0\n11\nAZ\nBlake Masters\n(R)\n$1,168\n$0\n$728\n$2,253\n$3,558\n$6\n12\nAZ\nMark Brnovich\n(R)\n$735\n$0\n$974\n$529\n$2,531\n$6\n13\nAZ\nMichael McGuire\n(R)\n$378\n$750\n$359\n$994\n$1,044\n$1,030\n14\nAZ\nJim Lamon\n(R)\n$275\n$5,000\n$4,040\n$7,176\n$832\n$13,000\n15\nAZ\nJustin Olson\n(R)\n$33\n$17\n$98\n$144\n$202\n$0\n16\nCA\nAlex Padilla\n(D-inc)\n$1,363\n$0\n$555\n$7,103\n$9,406\n$0\n17\nCA\nDan O'Dowd\n(D)\n$0\n$0\n$0\n$0\n$0\n$0\n18\nCO\nMichael Bennet\n(D-inc)\n$2,448\n$0\n$1,039\n$6,146\n$11,050\n$0\n19\nCO\nJoe O'Dea\n(R)\n$303\n$107\n$689\n$609\n$819\n$632\n20\nCO\nRon Hanks\n(R)\n$11\n$18\n$27\n$16\n$27\n$30\n21\nCT\nRichard Blumenthal\n(D-inc)\n$809\n$1\n$255\n$8,112\n$6,931\n$3\n22\nCT\nThemis Klarides\n(R)\n$425\n$40\n$18\n$448\n$425\n$40\n23\nCT\nLeora Levy\n(R)\n$284\n$761\n$82\n$963\n$284\n$761\n24\nFL\nVal Demings\n(D)\n$9,988\n$0\n$4,919\n$13,228\n$30,478\n$0\n25\nFL\nKen Russell\n(D)\n$236\n$0\n$280\n$285\n$1,222\n$0\n26\nFL\nAlan Grayson\n(D)\n$28\n$0\n$35\n$243\n$228\n$250\n27\nFL\nMarco Rubio\n(R-inc)\n$5,711\n$0\n$3,170\n$13,137\n$29,319\n$0\n28\nGA\nRaphael Warnock\n(D-inc)\n$13,470\n$0\n$10,836\n$25,580\n$44,194\n$0\n29\nGA\n<span class='selected-term'>Herschel Walker</span>\n(R)\n$5,158\n$0\n$3,181\n$7,422\n$14,218\n$0\n30\nGA\nLatham Saddler\n(R)\n$616\n$0\n$346\n$1,964\n$3,719\n$3\n31\nGA\nGary Black\n(R)\n$201\n$0\n$328\n$792\n$1,902\n$0\n32\nGA\nKelvin King\n(R)\n$199\n$0\n$386\n$145\n$1,148\n$300\n33\nGA\nJosh Clark\n(R)\n$95\n$0\n$196\n$127\n$279\n$35\n34\nHI\nBrian Schatz\n(D-inc)\n$303\n$0\n$171\n$4,049\n$3,701\n$0\n35\nIA\nMichael Franken\n(D)\n$1,393\n$0\n$709\n$1,005\n$1,818\n$0\n36\nIA\nAbby Finkenauer\n(D)\n$1,146\n$0\n$1,090\n$780\n$3,066\n$0\n37\nIA\nChuck Grassley\n(R-inc)\n$1,628\n$0\n$739\n$4,600\n$6,194\n$0\n38\nIA\nJim Carlin\n(R)\n$16\n$80\n$95\n$5\n$81\n$297\n39\nID\nMike Crapo\n(R-inc)\n$553\n$0\n$388\n$5,987\n$5,505\n$0\n40\nIL\nTammy Duckworth\n(D-inc)\n$1,832\n$0\n$1,135\n$7,104\n$15,857\n$0\n41\nIN\nThomas McDermott\n(D)\n$248\n$0\n$162\n$117\n$403\n$0\n42\nIN\nTodd Young\n(R-inc)\n$1,063\n$0\n$1,060\n$6,189\n$11,720\n$0\n43\nKS\nMark Holland\n(D)\n$161\n$0\n$126\n$122\n$303\n$1\n44\nKS\nJerry Moran\n(R-inc)\n$677\n$0\n$168\n$5,326\n$5,350\n$0\n45\nKY\nCharles Booker\n(D)\n$837\n$0\n$717\n$528\n$3,159\n$0\n46\nKY\nRand Paul\n(R-inc)\n$3,586\n$0\n$2,817\n$8,629\n$19,348\n$0\n47\nLA\nGary Chambers\n(D)\n$781\n$7\n$312\n$469\n$781\n$7\n48\nLA\nLuke Mixon\n(D)\n$281\n$0\n$159\n$242\n$477\n$0\n49\nLA\nJohn Kennedy\n(R-inc)\n$5,123\n$0\n$2,307\n$13,967\n$22,674\n$0\n50\nMD\nChris Van Hollen\n(D-inc)\n$935\n$0\n$381\n$5,496\n$7,592\n$0\n51\nMO\nLucas Kunce\n(D)\n$841\n$0\n$707\n$942\n$3,291\n$0\n52\nMO\nVicky Hartzler\n(R)\n$495\n$0\n$748\n$1,527\n$2,424\n$0\n53\nMO\nEric Schmitt\n(R)\n$481\n$0\n$451\n$1,302\n$2,924\n$0\n54\nMO\nEric Greitens\n(R)\n$336\n$30\n$311\n$345\n$1,755\n$48\n55\nMO\nBilly Long\n(R)\n$155\n$0\n$290\n$500\n$1,276\n$250\n56\nMO\nDave Schatz\n(R)\n$90\n$1,000\n$117\n$2,135\n$258\n$2,000\n57\nMO\nMark McCloskey\n(R)\n$70\n$0\n$131\n$38\n$948\n$0\n58\nNC\nCheri Beasley\n(D)\n$3,659\n$0\n$1,339\n$5,139\n$8,569\n$1\n59\nNC\nPat McCrory\n(R)\n$1,122\n$0\n$830\n$2,241\n$4,127\n$0\n60\nNC\nTed Budd\n(R)\n$1,053\n$0\n$1,339\n$1,941\n$3,845\n$275\n61\nNC\nMarjorie Eastman\n(R)\n$212\n$160\n$217\n$441\n$629\n$166\n62\nNC\nMark Walker\n(R)\n$101\n$0\n$163\n$509\n$1,561\n$0\n63\nND\nJohn Hoeven\n(R-inc)\n$475\n$0\n$339\n$3,234\n$3,084\n$0\n64\nNH\nMaggie Hassan\n(D-inc)\n$4,281\n$0\n$1,980\n$7,616\n$21,627\n$0\n65\nNH\nChuck Morse\n(R)\n$735\n$6\n$68\n$672\n$735\n$6\n66\nNH\nKevin Smith\n(R)\n$409\n$0\n$97\n$312\n$409\n$0\n67\nNH\nDonald Bolduc\n(R)\n$105\n$0\n$80\n$82\n$305\n$0\n68\nNV\nCatherine Cortez Masto\n(D-inc)\n$4,341\n$0\n$3,747\n$11,083\n$21,674\n$0\n69\nNV\nAdam Laxalt\n(R)\n$1,581\n$0\n$1,035\n$2,239\n$4,304\n$0\n70\nNV\nSam Brown\n(R)\n$1,145\n$0\n$1,197\n$680\n$3,185\n$17\n71\nNY\nChuck Schumer\n(D-inc)\n$2,094\n$0\n$841\n$37,613\n$36,069\n$0\n72\nOH\nTim Ryan\n(D)\n$4,058\n$0\n$2,622\n$6,466\n$12,531\n$0\n73\nOH\nMorgan Harper\n(D)\n$323\n$3\n$385\n$378\n$1,191\n$7\n74\nOH\nJane Timken\n(R)\n$797\n$0\n$2,962\n$1,452\n$4,216\n$3,500\n75\nOH\nJosh Mandel\n(R)\n$507\n$0\n$3,716\n$2,789\n$2,742\n$0\n76\nOH\nJ.D.",
    "author": "",
    "title": "Daily Kos Elections 1Q 2022 Senate fundraising reports roundup",
    "sentiment": "0.0"
  },
  {
    "id": 7706,
    "mediaId": 43,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "In terms of pickups, Republicans appear to be betting the farm on Georgia, where they are saddled with Trump-backed political neophyte and alleged wife abuser <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Senate GOP super PAC playing a lot of defense for a supposed",
    "sentiment": "-0.325"
  },
  {
    "id": 7707,
    "mediaId": 129,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "It was a campaign stop for a Senate candidate, but for many Georgians who came to see <span class='selected-term'>Herschel Walker</span>, politics was hardly the only draw.",
    "author": "",
    "title": "Herschel Walkers Senate Bid in Georgia Is Powered by Fandom",
    "sentiment": "0"
  },
  {
    "id": 7698,
    "mediaId": 12,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Mallory Blount, an aide to GOP Senate frontrunner <span class='selected-term'>Herschel Walker</span>, said if this is your messaging strategy, youre already losing.",
    "author": "Greg Bluestein",
    "title": "A magician I am not. Warnock tests a different tone",
    "sentiment": "0.0"
  },
  {
    "id": 7699,
    "mediaId": 305,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Somehow former football player and Republican Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> is still convincing folks that hes the man for the job.",
    "author": "Angela Johnson",
    "title": "Herschel Walker Endorsed by Pro-Life Organization",
    "sentiment": "0.849"
  },
  {
    "id": 7702,
    "mediaId": 129,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Other out-of-state candidates  like David McCormick, Ozs chief Republican rival in Pennsylvania, as well as <span class='selected-term'>Herschel Walker</span> in Georgia  have faced similar scrutiny this year.",
    "author": "",
    "title": "Sections",
    "sentiment": "0.0"
  },
  {
    "id": 6155,
    "mediaId": 237,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Polling averages have Georgia Democratic Sen. Raphael Warnock trailing Trump-endorsed <span class='selected-term'>Herschel Walker</span> in Georgia, with Hassan, Sen. Mark Kelly of Arizona, and Sen. Catherine Cortez Masto of Nevada all in competitive races.",
    "author": "Christian Datoc",
    "title": "Biden thinks Democrats can gain Senate seats this year  with Trump's help",
    "sentiment": "0.0"
  },
  {
    "id": 4946,
    "mediaId": 19,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "He also predicted that a Kemp win would negatively affect the great <span class='selected-term'>Herschel Walker</span>s race for the Senate  it will be very hard for him to win with Kemp on the ticket.?\nDont let the Democrats, or the RINOs win in Georgia.",
    "author": "Hannah Bleau",
    "title": "Donald Trump: Georgia Debate a BIG Win for Perdue, Exposed Brian Kemp as RINO",
    "sentiment": "0.0"
  },
  {
    "id": 6145,
    "mediaId": 124,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Trump, for his part, is sticking by Perdue, saying in a statement last night, It is not easy to beat an incumbent, however, if our voters turn out, David Perdue will win in a landslide.?\nThe poll also finds 66 percent of likely voters supporting former football player <span class='selected-term'>Herschel Walker</span>, who has Trumps backing in the Senate race, while the other candidates polled in the single digits.",
    "author": "",
    "title": "'Mean,' 'circus': Some undecided Pa. GOP voters disappointed by Senate debate",
    "sentiment": "0.0"
  },
  {
    "id": 7679,
    "mediaId": 19,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "The Republican frontrunner, <span class='selected-term'>Herschel Walker</span>, took in more than $5 million, outpacing his other Republican primary opponents, but at the same time that Warnock took in roughly $13 million.",
    "author": "Jacob Bliss",
    "title": "Majority of Democrat Sen. Raphael Warnocks Campaign Donations Are from Out of State",
    "sentiment": "0"
  },
  {
    "id": 7668,
    "mediaId": 237,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The microtargeting project, which is likely the most expansive and detailed survey conducted in Georgia so far this cycle, shows the dominant position that <span class='selected-term'>Herschel Walker</span> maintains over Raphael Warnock in the race for the U.S. Senate, Republican pollster Blaise Hazelwood wrote in a memorandum for 34N22, the super PAC supporting Walkers Senate bid.",
    "author": "David M. Drucker",
    "title": "GOP candidate Walker leads Democratic Sen. Warnock in Georgia Senate race: Poll",
    "sentiment": "0.696"
  },
  {
    "id": 7671,
    "mediaId": 98,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Right now the leading candidate in Georgias Republican primary for the Senate is <span class='selected-term'>Herschel Walker</span>, a former Georgia Bulldog football star who lied about graduating from college, lied about being high school valedictorian, and earlier this year told college students in Texas that his upholstery company employs about 250 people when in fact theres no evidence of him even owning an upholstery company.",
    "author": "",
    "title": "Column: Georgia can do better than Marjorie Taylor Greene",
    "sentiment": "-0.413"
  },
  {
    "id": 7672,
    "mediaId": 19,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> holds a ten-point lead over far-left incumbent Sen. Raphael Warnock (D-GA) in a hypothetical matchup for Georgias U.S. Senate seat, according to a recent poll conducted by a pro-Walker super PAC.",
    "author": "Jacob Bliss",
    "title": "Poll: Republican Herschel Walker Shows Commanding Lead over Democrat Sen. Raphael Warnock",
    "sentiment": "0.674"
  },
  {
    "id": 7662,
    "mediaId": 43,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "RELATED STORY: No big shocker to learn that <span class='selected-term'>Herschel Walker</span> hawked 'dry mist' spray to 'clean' you of COVID-19\nAS reported by the AJC, when Aloe-Lu-Ya failed, Walker rebranded through another company with a plant extract drink called Sunutra.",
    "author": "Rebekah Sager\nDaily Kos Staff",
    "title": "Herschel Walker didnt just hawk",
    "sentiment": "-0.211"
  },
  {
    "id": 7641,
    "mediaId": 237,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Former NFL player <span class='selected-term'>Herschel Walker</span>, who is running for Senate in Georgia, where Gingrich used to be a congressman, was one GOP candidate he highlighted.",
    "author": "Daniel Chaitin",
    "title": "Newt Gingrich predicts GOP could pick up historic 70 House seats",
    "sentiment": "0.442"
  },
  {
    "id": 7645,
    "mediaId": 33,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span>, who is running for Senate in Georgia, has been accused of threatening multiple women over the course of a decade.",
    "author": "Gabby Orr and Paul LeBlanc",
    "title": "Trump defends Nebraska gubernatorial candidate facing groping allegations",
    "sentiment": "-0.9"
  },
  {
    "id": 7629,
    "mediaId": 237,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Asher Notheis",
    "title": "Herschel Walker will skip second primary debate in Georgia Senate race",
    "sentiment": "-0.72"
  },
  {
    "id": 1801,
    "mediaId": 239,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "One of the problems also is if Brian Kemp gets in, I think it's going to be very, very hard for <span class='selected-term'>Herschel Walker</span> to win,? Mr. Trump said, according to the Atlanta Journal-Constitution.",
    "author": "Seth McLaughlin",
    "title": "Herschel Walker's debate avoidance in primary spurs general election questions",
    "sentiment": "0.182"
  },
  {
    "id": 7625,
    "mediaId": 19,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "The Susan B. Anthony (SBA) List is throwing its weight behind Georgia Republican <span class='selected-term'>Herschel Walker</span> in this years battleground race for U.S. Senate in Georgia, Breitbart News has learned.",
    "author": "Ashley Oliver",
    "title": "Exclusive  National Pro-Life Group Endorses Herschel Walker for Senate, Disavows Radical Biden-Warnock Agenda",
    "sentiment": "0.282"
  },
  {
    "id": 1773,
    "mediaId": 43,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "The Previous Guy & his buddy, <span class='selected-term'>Herschel Walker</span> (R. GA)\nYesterday in Georgia, the GOP U.S. Senate frontrunner, Herschel Walker (R. GA), was a no show but the issue of abortion was a big topic of discussion:\nFive of the six Republican candidates competing to challenge Democratic U.S. Sen. Raphael Warnock invoked the yet-to-be-issued opinion published by Politico this week to lend urgency to their long-shot campaigns.",
    "author": "",
    "title": "Deadspin, \"Men like Herschel Walker (R) are coming for my rights and probably yours, too\"",
    "sentiment": "-0.588"
  },
  {
    "id": 7614,
    "mediaId": 1576,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Tuesdays debate among Georgia Republican Senate candidates was predictably defined by the man who wasnt there  <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Georgia GOP Senate debate focuses on Herschel Walker absence",
    "sentiment": "-0.949"
  },
  {
    "id": 7615,
    "mediaId": 12,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Missing from the stage was GOP front-runner <span class='selected-term'>Herschel Walker</span>, a former football star who was instead hosting a fundraiser in east Georgia while his rivals mocked him as a coward for skipping the event.",
    "author": "Greg Bluestein",
    "title": "A Senate GOP debate without Herschel Walker highlights new abortion clash",
    "sentiment": "-0.927"
  },
  {
    "id": 7597,
    "mediaId": 558,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Running for the U.S. Senate in Georgia, <span class='selected-term'>Herschel Walker</span> has taken a different tack, saying he doesnt want to look backward at the 2020 election.",
    "author": "DAVID KLEPPER and JEFF AMY",
    "title": "GOP works to get out the vote after calling elections rigged",
    "sentiment": "0.0"
  },
  {
    "id": 7599,
    "mediaId": 12,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "The only other Georgia candidate who has Haleys backing is <span class='selected-term'>Herschel Walker</span>, who is running for U.S. Senate.",
    "author": "Tia Mitchell",
    "title": "Nikki Haley endorses 2nd District GOP candidate Jeremy Hunt",
    "sentiment": "0"
  },
  {
    "id": 7592,
    "mediaId": 238,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Its reminiscent of a real-life Black man revered for his athleticism and heretofore seen as just happy-go-lucky: the great running back from the University of Georgia, <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Herschel Walkers insulting campaign is the worst kind of sports idolatry",
    "sentiment": "-0.943"
  },
  {
    "id": 7593,
    "mediaId": 136,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "In Georgia, leading Republican Senate candidate and former football star <span class='selected-term'>Herschel Walker</span> has spoken out repeatedly about rising gas prices and inflation.",
    "author": "Daniel Bush",
    "title": "Democrats Campaigning in Swing States Are Reckoning With Biden's Economy",
    "sentiment": "0.296"
  },
  {
    "id": 1704,
    "mediaId": 21,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "\"One of the problems also is if Brian Kemp gets in, I think it's going to be very, very hard for <span class='selected-term'>Herschel Walker</span> to win,\" the former president said.",
    "author": "John L. Dorman",
    "title": "Trump says it will be 'very hard' for Herschel Walker to win the Georgia Senate race if Brian Kemp is the GOP gubernatorial nominee",
    "sentiment": "-0.664"
  },
  {
    "id": 7585,
    "mediaId": 19,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span> appeared to acknowledge a possible blowout in the primary as he dominates in the polls and invited his GOP opponents, their staff, and supporters to a unity celebration in an effort to bring everyone together on election day.",
    "author": "Jacob Bliss",
    "title": "Georgia Republican Herschel Walker Invites GOP Opponents to Unity Celebration on Primary Day",
    "sentiment": "0.493"
  },
  {
    "id": 3758,
    "mediaId": 151,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "There are other candidates and politicians that people like ideologically here, but none have the excitement that DeSantis does,? said Wesley Donehue, founder of Push Digital, a South Carolina-based Republican digital firm that does work nationally, including for Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Trump's South Carolina donors vet DeSantis",
    "sentiment": "0"
  },
  {
    "id": 7572,
    "mediaId": 136,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "Democratic Senator Raphael Warnock looks as if he's headed for a tough race to defend his Georgia seat against GOP contender <span class='selected-term'>Herschel Walker</span> in November's midterm.",
    "author": "Jason Lemon",
    "title": "Raphael Warnock's Chances of Beating Herschel Walker, According to Polls",
    "sentiment": "0"
  },
  {
    "id": 3312,
    "mediaId": 305,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "A recent round of polling shows that Sen. Raphael Warnock (D-GA) is looking at a close race, presuming GOP candidate <span class='selected-term'>Herschel Walker</span> wins the Republican nomination for the upcoming Georgia Senate race, according to Newsweek.",
    "author": "Murjani Rawls",
    "title": "Potential Warnock vs. Walker Georgia Senate Battle Shows It Could Be A Close Race",
    "sentiment": "0.194"
  },
  {
    "id": 3382,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Kimberly: So <span class='selected-term'>Herschel Walker</span> is running on the Republican ticket for Senate in Georgia.",
    "author": "",
    "title": "10 Republican Voters in Swing States on Trumps Hold on the Party",
    "sentiment": "0.0"
  },
  {
    "id": 7562,
    "mediaId": 142,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "YES\nViewpoint: Conservative\nType of group: SUPER PAC\nSupports: <span class='selected-term'>Herschel Walker</span> (R-GA)\nGrand Total Spent on 2022 Federal Elections: $278,606\nTotal Independent Expenditures: $278,606\nFor Democrats: $0\nAgainst Democrats: $59,403\nFor Republicans: $219,203\nAgainst Republicans: $0\nTotal Electioneering Communications: $0\nBy definition, electioneering communications do not explicitly advocate for or against the election of a candidate, but simply refer to a clearly identified federal candidate in a broadcast ad.",
    "author": "",
    "title": "34N22 Inc Outside Spending",
    "sentiment": "0"
  },
  {
    "id": 7564,
    "mediaId": 157,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "In a teaser for an ABC \"Nightline \" report on the next seven days of GOP primaries that could dictate the fate of both the Senate and the House of Representatives, Republicans in Georgia express dismay at the inevitability that they will be saddled with former football player <span class='selected-term'>Herschel Walker</span> as their nominee for an obtainable Senate seat.",
    "author": "Tom Boggioni",
    "title": "'It's going to be a tough day': Georgia Republicans concerned over Herschel Walker's Senate run",
    "sentiment": "-0.895"
  },
  {
    "id": 4468,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In the states Senate race, the leading Republican candidate, the Trump-backed former football star <span class='selected-term'>Herschel Walker</span>, said on Wednesday that he wasnt sure if Mr. Biden had been lawfully elected in 2020.\nI dont know,? Mr. Walker told a New York Times reporter after a speech in Macon, Ga. I do think there was problems.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "-0.606"
  },
  {
    "id": 4469,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In the states Senate race, the leading Republican candidate, the Trump-backed former football star <span class='selected-term'>Herschel Walker</span>, said on Wednesday that he wasnt sure if Mr. Biden had been lawfully elected in 2020.\nI dont know,? Mr. Walker told a New York Times reporter after a speech in Macon, Ga. I do think there was problems.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "-0.495"
  },
  {
    "id": 4470,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "CLICK HERE FOR TOPLINE AND CROSSTABS\nFormer NFL running back <span class='selected-term'>Herschel Walker</span> dominates the field in the Republican Senate primary race.",
    "author": "",
    "title": "Fox News Poll: Georgias GOP primary race for governor sees Kemp holding wide lead over Perdue",
    "sentiment": "0.0"
  },
  {
    "id": 4458,
    "mediaId": 129,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Ive dedicated my entire career to working in the interests of marginalized Black communities.?\n<span class='selected-term'>Herschel Walker</span>, the former football star leading the race for the Republican nomination for a Georgia Senate seat, said that a ban on abortion should have no exceptions  presumably even for rape, incest or the health of the mother.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "0.0"
  },
  {
    "id": 4459,
    "mediaId": 409,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "The fact that this years GOP Senate primary features <span class='selected-term'>Herschel Walker</span>, arguably the greatest college football player of all time who won a national championship with the University of Georgia, probably helps stir public interest in the race, as well as President Trumps furious denunciations of incumbent GOP governor Brian Kemp, although Kemp is leading the polls by a wide margin.",
    "author": "Jim Geraghty",
    "title": "Much Higher Minority Early Voting in Georgias Upcoming Primaries",
    "sentiment": "0.85"
  },
  {
    "id": 6582,
    "mediaId": 323,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "The former president has been savvy with some of his endorsements, allying himself with candidates who already have high profiles (including Mehmet Oz and <span class='selected-term'>Herschel Walker</span> for Senate in Pennsylvania and Georgia, respectively) or bestowing his approval at crucial times (as he did at the last minute for Mr. Mastriano, who was already leading).",
    "author": "Kimberley A. Strassel",
    "title": "The Limits of Stop the Steal",
    "sentiment": "0.0"
  },
  {
    "id": 7548,
    "mediaId": 129,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Your Thursday Evening Briefing",
    "sentiment": "0"
  },
  {
    "id": 7549,
    "mediaId": 558,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "A notable exception: former football star <span class='selected-term'>Herschel Walker</span>, whos set for a big Senate primary win Tuesday and who was recruited by Trump.",
    "author": "",
    "title": "Trump washes hands of Perdue in Georgia as his campaign limps into final stretch",
    "sentiment": "0"
  },
  {
    "id": 7550,
    "mediaId": 21,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Republican US Senate hopeful <span class='selected-term'>Herschel Walker</span> neglected to report nearly $3.2 million in earnings in a federal financial disclosure, waiting five months to amend the sum.",
    "author": "Madison Hall",
    "title": "Republican Senate candidate Herschel Walker failed for months to report millions in earnings",
    "sentiment": "-0.755"
  },
  {
    "id": 7551,
    "mediaId": 233,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Walker's college-aged son, Christian, is a popular conservative political commentator on social media platforms like Twitter and Twitter, where he often posts videos blasting liberal political views popular among Gen Z.\n<span class='selected-term'>Herschel Walker</span> vs. Raphael Warnock in the polls\nThe anticipated match up between Walker and Warnock is expected to be tight.",
    "author": "Orlando Mayorquin",
    "title": "Who is Herschel Walker? The former football star is running for Senate in Georgia as a Republican.",
    "sentiment": "0.333"
  },
  {
    "id": 6538,
    "mediaId": 195,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span> is all but guaranteed to win the GOP Senate primary, setting up a general election match-up with Sen. Raphael Warnock (D) in November.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump faces critical popularity test in Georgia",
    "sentiment": "0.693"
  },
  {
    "id": 6539,
    "mediaId": 409,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "As noted a month ago, the GOP Senate primary in Georgia features <span class='selected-term'>Herschel Walker</span> against state agriculture commissioner Gary Black, former state representative Josh Clark, U.S. Air Force captain and entrepreneur Kelvin King, and former U.S. Navy SEAL and director of Intelligence Programs on the National Security Council Latham Saddler.",
    "author": "Jim Geraghty",
    "title": "Trump's Gambling Isn't Paying Off",
    "sentiment": "-0.658"
  },
  {
    "id": 7087,
    "mediaId": 65,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Hes also backing former football star <span class='selected-term'>Herschel Walker</span> in the Senate primary, and has also taken sides in the GOP primaries for lieutenant governor, Secretary of State, and a couple of congressional contests.",
    "author": "Paul Steinhauser",
    "title": "Why Trump's full court press in Georgia hasn't helped Perdue's bid to oust Kemp",
    "sentiment": "0.0"
  },
  {
    "id": 7106,
    "mediaId": 129,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "In the Georgia Senate race, Mr. Trumps endorsed candidate, <span class='selected-term'>Herschel Walker</span>, is running away from his past and locked in a tight race against the incumbent Raphael Warnock.",
    "author": "",
    "title": "Democrats, the Midterm Jinx Is Not Inevitable",
    "sentiment": "0.0"
  },
  {
    "id": 7535,
    "mediaId": 558,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "(Hyosub Shin/Atlanta Journal-Constitution via AP, File)\nWASHINGTON (AP)  <span class='selected-term'>Herschel Walker</span>, the football legend and leading Republican Senate candidate in Georgia, often boasts of his work helping service members and veterans struggling with mental health.",
    "author": "BRIAN SLODYSKO",
    "title": "Herschel Walker's ties to veterans program face scrutiny",
    "sentiment": "0.393"
  },
  {
    "id": 7536,
    "mediaId": 223,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Source: AP Photo/Ben Gray\nGeorgia Senate candidate and former professional football player <span class='selected-term'>Herschel Walker</span> said on Wednesday that he supports restrictions on abortion without exceptions for rape, incest or the health of the mother.",
    "author": "Madeline Leesman",
    "title": "Herschel Walker on Abortion: 'There's No Exception in My Mind'",
    "sentiment": "0.923"
  },
  {
    "id": 7537,
    "mediaId": 195,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Georgia Senate candidate and former football star <span class='selected-term'>Herschel Walker</span> said Wednesday he supports abortion bans without any exceptions for rape, incest or the health of the mother.",
    "author": "Lexi Lonas",
    "title": "Herschel Walker says he wants total ban on abortion: Theres no exception in my mind",
    "sentiment": "0.862"
  },
  {
    "id": 7538,
    "mediaId": 129,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "MACON, Ga.  <span class='selected-term'>Herschel Walker</span>, the former football star leading Georgias Republican primary for Senate, had a mixed message about racial issues for 70 or so supporters, mainly white, who came to hear his stump speech this week at the Georgia Sports Hall of Fame.",
    "author": "",
    "title": "On race, Herschel Walkers offer of absolution divides Georgia voters.",
    "sentiment": "0.634"
  },
  {
    "id": 7539,
    "mediaId": 558,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Georgia Republican <span class='selected-term'>Herschel Walker</span>, currently leading its race for the U.S. Senate, failed to disclose over $3 million in earnings in his last federal disclosure form.",
    "author": "",
    "title": "Senate candidate Herschel Walker failed to disclose millions in earnings",
    "sentiment": "-0.652"
  },
  {
    "id": 6556,
    "mediaId": 151,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "Why are there so few in office?? by Sabrina Rodrguez\n <span class='selected-term'>Herschel Walker</span>s ties to veterans program face scrutiny,? by APs Brian Slodysko\n And NBCs Alex Seitz-Wald has an interesting story about a planned $5 billion electric vehicle factory for the Atlanta suburbs thats emerged as a point of contention in the Kemp-Perdue primary, with Perdue decrying the woke? project.",
    "author": "",
    "title": "POLITICO Playbook: Sean Patrick Maloney dodges a bullet",
    "sentiment": "0.0"
  },
  {
    "id": 7069,
    "mediaId": 151,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "Meanwhile, Tuesdays Georgia primary is likely to solidify another clash of two titans this fall: Democratic Sen. Raphael Warnock and Republican <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Trump's revenge tour is put to the test in Georgia, Alabama",
    "sentiment": "0"
  },
  {
    "id": 7526,
    "mediaId": 305,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "The Republicans running against <span class='selected-term'>Herschel Walker</span> for U.S. Senate are crisscrossing the state this week, looking for every vote they can get and making a similar argument: Walker cant win in a November general election against Democrat Raphael Warnock.",
    "author": "Keith Reed",
    "title": "Hershel Walker's Senate Bid Has Some Georgia Republicans Shook",
    "sentiment": "-0.762"
  },
  {
    "id": 7527,
    "mediaId": 305,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "Now that Stacey Abrams is back in the race to triumph her loss in the gubernatorial primary in 2018 and <span class='selected-term'>Herschel Walker</span> is taking a stab at the Senate race following his glorification of former President Trump, more people seem to be interested in participating in the election.",
    "author": "Kalyn Womack",
    "title": "Georgia Sees Record Number of Early Votes from Minorities",
    "sentiment": "0"
  },
  {
    "id": 7531,
    "mediaId": 1576,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "Brian Kemp and former football star <span class='selected-term'>Herschel Walker</span> hope to win GOP majorities and clinch nominations for governor and U.S. senator on Tuesday without runoffs, with polls showing both men backed by more than 50% of voters.",
    "author": "",
    "title": "Kemp and Walker look to victory in Georgia as primaries near",
    "sentiment": "-0.255"
  },
  {
    "id": 7194,
    "mediaId": 136,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Even though polls point to a Perdue loss, Trump's endorsed candidate in the state's Senate primary, former football star <span class='selected-term'>Herschel Walker</span>, remains the overwhelming favorite.",
    "author": "Andrew Stanton",
    "title": "Trump Endorsement More 'Matchbox Car' Than 'Freight Train': Geoff Duncan",
    "sentiment": "0.0"
  },
  {
    "id": 7201,
    "mediaId": 136,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Trump has also endorsed former NFL star <span class='selected-term'>Herschel Walker</span> who is seeking to unseat Raphael Warnock in the U.S Senate.",
    "author": "Khaleda Rahman",
    "title": "Here's Who Donald Trump Has Endorsed in Next Week's Primary Elections",
    "sentiment": "0.0"
  },
  {
    "id": 7202,
    "mediaId": 151,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "His preferred Senate candidate in Georgia, <span class='selected-term'>Herschel Walker</span>, is favored to win.",
    "author": "",
    "title": "'No one's paying any attention': The week that Republicans ignored Trump's election lies",
    "sentiment": "0"
  },
  {
    "id": 7224,
    "mediaId": 129,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "A recent Atlanta Journal-Constitution poll of likely Republican voters shows the U.S. Senate candidate and former University of Georgia running back <span class='selected-term'>Herschel Walker</span> with a big lead in his primary race, likely aided by both Mr. Trumps endorsement and Mr. Walkers status as a football legend.",
    "author": "",
    "title": "What Donald Trump Didnt Count On in Georgia",
    "sentiment": "0"
  },
  {
    "id": 7228,
    "mediaId": 129,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "This fall, Mr. Warnock is expected to face <span class='selected-term'>Herschel Walker</span>, the Republican former football star with scant political experience.",
    "author": "",
    "title": "Democrats Fight Headwinds in Georgia and Beyond: The Problem Is Reality",
    "sentiment": "0.0"
  },
  {
    "id": 7238,
    "mediaId": 195,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Likewise, former NFL player <span class='selected-term'>Herschel Walker</span>, whom Trump has also endorsed, is the heavy favorite to win the Republican Senate nod.",
    "author": "Max Greenwood",
    "title": "Democrats look to defy political headwinds in Georgia",
    "sentiment": "0"
  },
  {
    "id": 7245,
    "mediaId": 21,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Brian Kemp and Trump-backed former Sen. David Perdue; the GOP Senate primary where former NFL player <span class='selected-term'>Herschel Walker</span> is set to glide to the nomination and face first-term Democratic Sen. Raphael Warnock; the Georgia secretary of state race which features Raffensperger and Trump-endorsed Rep. Jody Hice; and the Democratic gubernatorial primary, where former state House minority leader Stacey Abrams is running unopposed in her second bid for the Governor's Mansion.",
    "author": "John L. Dorman",
    "title": "Early voting turnout in Georgia soars in wake of restrictive election law",
    "sentiment": "-0.793"
  },
  {
    "id": 7260,
    "mediaId": 1576,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Their likely U.S. Senate candidate is <span class='selected-term'>Herschel Walker</span>, whos Black.",
    "author": "",
    "title": "Georgia voters showed us these 3 things about the fall election",
    "sentiment": "0.0"
  },
  {
    "id": 7266,
    "mediaId": 157,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Meanwhile, Trump's chosen candidate <span class='selected-term'>Herschel Walker</span> has proven to be just as big of a disaster.",
    "author": "Sarah K. Burris",
    "title": "How the Republican Party's deal with Trump is leading to chaos in Georgia GOP elections",
    "sentiment": "-0.617"
  },
  {
    "id": 7511,
    "mediaId": 21,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Following a campaign event on Wednesday, Georgia GOP candidate for Senate <span class='selected-term'>Herschel Walker</span> said he supports a total abortion ban with no exception for rape, incest, or the health of the mother.",
    "author": "Katherine Tangalakis-Lippert",
    "title": "Trump-endorsed Senate candidate Herschel Walker supports a total abortion ban: 'there's no exception in my mind'",
    "sentiment": "0.455"
  },
  {
    "id": 7520,
    "mediaId": 157,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "During an appearance on MSNBC's \"The Sunday Show,\" former Republican party campaign consultant Tara Setmayer trashed conservatives -- and Senate Minority Leader Mitch McConnell (R-KY) still backing former football player <span class='selected-term'>Herschel Walker</span>'s run for Georgia's open U.S. Senate seat by in light of new revelations that he is being scrutinized over his ties to a group accused of preying military vets.",
    "author": "Tom Boggioni",
    "title": "Mitch McConnell slammed for still backing 'absolute degenerate' Herschel Walker after new report",
    "sentiment": "-0.548"
  },
  {
    "id": 7525,
    "mediaId": 178,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "But there are many, many other reasons, I think, to be concerned about <span class='selected-term'>Herschel Walker</span> as a Senate candidate.''",
    "author": "",
    "title": "Herschel Walker: From football stardom to troubling Senate candidate",
    "sentiment": "0.185"
  },
  {
    "id": 7289,
    "mediaId": 129,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "This fall, Mr. Warnock is expected to face <span class='selected-term'>Herschel Walker</span>, the Republican former football star with scant political experience.",
    "author": "",
    "title": "Democrats are mindful of headwinds in Georgia, and everywhere else.",
    "sentiment": "0"
  },
  {
    "id": 7329,
    "mediaId": 33,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Democratic Sen. Raphael Warnock is facing election for a full six-year term and likely to face the Trump-backed former football star <span class='selected-term'>Herschel Walker</span>, who is favored to win Tuesday's Republican primary.",
    "author": "Eric Bradner",
    "title": "Republicans look to Georgia for a path beyond Trump's 2020 grievances",
    "sentiment": "0.0"
  },
  {
    "id": 7481,
    "mediaId": 147,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "But he also has <span class='selected-term'>Herschel Walker</span>, who is his chosen person for the Senate race, and there was really no ability of Republicans  other than Trump Republicans, there was no ability to pull anyone up with him.",
    "author": "PBS NewsHour",
    "title": "Tamara Keith and Amy Walter on whats at stake in Georgias primary election",
    "sentiment": "0.0"
  },
  {
    "id": 7482,
    "mediaId": 195,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Another Trump favorite, former football star <span class='selected-term'>Herschel Walker</span>, is all but certain to win the GOP Senate primary in Georgia on Tuesday.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump no longer holds MAGA movement in his palm",
    "sentiment": "0.663"
  },
  {
    "id": 7483,
    "mediaId": 147,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trumps candidate for U.S. Senate, football legend <span class='selected-term'>Herschel Walker</span>, appears to be cruising to the Republican nomination despite some GOP leaders warning that Walker will be unelectable in November against Democratic incumbent Raphael Warnock.",
    "author": "Jeff Amy",
    "title": "2022 Georgia Primary Election Results",
    "sentiment": "-0.949"
  },
  {
    "id": 7484,
    "mediaId": 195,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Warnock is set to battle former University of Georgia football star <span class='selected-term'>Herschel Walker</span>, who has Trumps backing, while Abrams looks likely to face Kemp in a rematch of the 2018 gubernatorial election.",
    "author": "Rachel Scully",
    "title": "What time do polls close in Georgia, Texas?",
    "sentiment": "0"
  },
  {
    "id": 7486,
    "mediaId": 136,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Less than two months ago, State Agricultural Commissioner Gary Black was trailing former football star <span class='selected-term'>Herschel Walker</span> in the Republican Senate primary when he told a rally in Putnam County that he didn't think there was any chance Walker could beat incumbent Democrat Raphael Warnock in the fall.",
    "author": "Bill Powell",
    "title": "Why Did It Take the GOP So Long to Panic About Herschel Walker?",
    "sentiment": "-0.465"
  },
  {
    "id": 7490,
    "mediaId": 376,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Here are the Senate and House races to watch:\nWalker in the home stretch\nWith an endorsement from Trump and an enduring celebrity from his days as a star running back for the University of Georgia Bulldogs then in the NFL, <span class='selected-term'>Herschel Walker</span> is widely expected to win the Georgia GOP nomination to challengeWarnock, who is running for a complete term after winning a runoff special election that helped give Democrats their narrow control of the Senate in January 021.",
    "author": "Stephanie Akin",
    "title": "What to watch in Tuesdays primaries in Georgia",
    "sentiment": "0"
  },
  {
    "id": 7491,
    "mediaId": 169,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trump is predicted to have at least one winner on the day: Former football star <span class='selected-term'>Herschel Walker</span> will be the GOP nominee for the U.S. Senate seat currently held by Democrat Raphael Warnock.",
    "author": "Heather Digby Parton",
    "title": "Trump's guys may lose in Georgia  but his Big Lie is going strong",
    "sentiment": "0"
  },
  {
    "id": 7497,
    "mediaId": 1576,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "In the high-profile race for U.S. Senate, former UGA football star <span class='selected-term'>Herschel Walker</span> is riding high with his Trump endorsement.",
    "author": "",
    "title": "7 things to watch on primary election night in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7498,
    "mediaId": 157,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trump is predicted to have at least one winner on the day: Former football star <span class='selected-term'>Herschel Walker</span> will be the GOP nominee for the U.S. Senate seat currently held by Democrat Raphael Warnock.",
    "author": "Heather Digby Parton",
    "title": "Trump is facing an embarrassing defeat  but here's why it might not matter",
    "sentiment": "-0.507"
  },
  {
    "id": 7501,
    "mediaId": 25,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Former star Georgia running back <span class='selected-term'>Herschel Walker</span> has led the Republican field since he entered the race with Trump's encouragement.",
    "author": "Adam Brewster, Aaron Navarro",
    "title": "Georgia primary pits Pence-endorsed Brian Kemp against Trump-backed David Perdue",
    "sentiment": "0.0"
  },
  {
    "id": 7502,
    "mediaId": 19,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "In Georgia, they are seeking redemption for races lost in 2020, they have a state celebrity on the ballot in <span class='selected-term'>Herschel Walker</span>, and many of the primaries are highly competitive and elevated by Trumps intervention.",
    "author": "Ashley Oliver",
    "title": "Primary Races Foreshadow Blockbuster November in Georgia",
    "sentiment": "0"
  },
  {
    "id": 7505,
    "mediaId": 1576,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "AGRICULTURE COMMISSIONER\nAgriculture Commissioner Gary Black isnt seeking reelection, opting instead to run for U.S. Senate in the Republican primary that includes former football great <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Incumbents in Georgia face primary opponents down the ballot",
    "sentiment": "0.0"
  },
  {
    "id": 7299,
    "mediaId": 238,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trumps political clout will also be tested in two other races: the Senate contest where ex-NFL star <span class='selected-term'>Herschel Walker</span> is expected to win the GOP nod to face Sen. Raphael G. Warnock (D); and the secretary of state race between Brad Raffensperger and Trumps pick, Rep. Jody Hice (R).",
    "author": "Mariana Alfaro",
    "title": "Trump and Pence take separate sides in Georgias gubernatorial primary",
    "sentiment": "0.0"
  },
  {
    "id": 7308,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Of course, theres one win that Trump can count on Tuesday: former NFL star <span class='selected-term'>Herschel Walker</span>, whos seen as the heavy favorite to clinch the GOP nod to take on Sen. Raphael Warnock (D-Ga.) this fall.",
    "author": "Max Greenwood",
    "title": "Five things to watch in the Georgia, Alabama primaries",
    "sentiment": "0.0"
  },
  {
    "id": 7309,
    "mediaId": 323,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span> has a huge lead in polling over opponents looking to take on Mr. Warnock in Georgia, while former White House press secretary Sarah Sanders is expected to easily win the GOP nomination for governor in Arkansas, a state her father, Mike Huckabee, previously led.",
    "author": "Cameron McWhirter",
    "title": "Georgia GOP Primary Elections for Governor and Secretary of State Are Top Contests Today",
    "sentiment": "0.0"
  },
  {
    "id": 7313,
    "mediaId": 129,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "This week, Georgia will also kick off one of the countrys most important Senate elections, between Senator Raphael Warnock, a Democrat running for re-election, and <span class='selected-term'>Herschel Walker</span>, a Republican backed by Mr. Trump who is widely expected to cruise to victory in his partys primary.",
    "author": "",
    "title": "What to Watch For in Todays Elections in Georgia and Beyond",
    "sentiment": "0.656"
  },
  {
    "id": 7315,
    "mediaId": 21,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump talked up Perdue and former football star <span class='selected-term'>Herschel Walker</span>, his pick to knock off Warnock in the general election, during a rally in Commerce, Georgia on March 26.",
    "author": "Warren Rojas",
    "title": "David Perdue caps his campaign for Georgia governor with a racist remark against Stacey Abrams and a Trump tele-rally",
    "sentiment": "0.0"
  },
  {
    "id": 7338,
    "mediaId": 25,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-f912f6e5</div>\n link copied\n5:40 PM\nGeorgia Senate Republican primary results\n<span class='selected-term'>Herschel Walker</span>, Gary Black, Kelvin King, Jonathan McColumn and Latham Saddler are running for the Republican nomination for U.S. Senate in Georgia.",
    "author": "",
    "title": "Primary results 2022: Georgia, Alabama, Arkansas, Texas runoff and Minnesota special election primary results",
    "sentiment": "0.0"
  },
  {
    "id": 7349,
    "mediaId": 32,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump has also thrown his weight behind <span class='selected-term'>Herschel Walker</span>, a former NFL running back who is expected to advance to the general election for Senate against Democratic Sen. Raphael Warnock.",
    "author": "Kevin Breuninger",
    "title": "Georgia's primary elections on Tuesday are pivotal. Here's what to watch",
    "sentiment": "0.0"
  },
  {
    "id": 7350,
    "mediaId": 129,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "And Josh Clark, a former Georgia state representative who is running a long-shot Senate campaign against <span class='selected-term'>Herschel Walker</span>, the Trump-endorsed former football star, touted his endorsement from Mike Lindell, the MyPillow chief executive who is a full-time amplifier of election conspiracy theories.",
    "author": "",
    "title": "Live Updates: What to Watch For in Today's Elections in Georgia and Beyond",
    "sentiment": "0.311"
  },
  {
    "id": 7410,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Former NFL star <span class='selected-term'>Herschel Walker</span> is projected to easily clinch the Republican Senate nomination in Georgia, securing his spot on the ballot to face off against Sen. Raphael Warnock (D-Ga.) in November.",
    "author": "Max Greenwood",
    "title": "Herschel Walker clinches GOP Senate nomination in Georgia",
    "sentiment": "0.95"
  },
  {
    "id": 7411,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Hes expected to face former NFL player <span class='selected-term'>Herschel Walker</span> in the general election.",
    "author": "Max Greenwood",
    "title": "Warnock easily secures Democratic Senate nomination in Georgia",
    "sentiment": "0.501"
  },
  {
    "id": 7412,
    "mediaId": 233,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Rep. Marjorie Taylor Greenes primary race is also underway, along with the Senate contest between incumbent Rep. Raphael Warnock and football star <span class='selected-term'>Herschel Walker</span>.",
    "author": "David Jackson",
    "title": "Stacey Abrams wins gov primary; GA polls close; primaries also in Alabama, Ark., Texas: live updates",
    "sentiment": "0.0"
  },
  {
    "id": 7413,
    "mediaId": 32,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Megan Varner | Getty Images News | Getty Images\n<span class='selected-term'>Herschel Walker</span>, the former pro football player and businessman endorsed by ex-President Donald Trump, will win Georgias Republican Senate primary race, NBC News projected Tuesday.",
    "author": "Kevin Breuninger",
    "title": "Trump-endorsed Senate hopeful Herschel Walker wins Georgia Republican primary, will face Democratic Sen. Warnock, NBC projects",
    "sentiment": "0"
  },
  {
    "id": 7414,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump has endorsed NFL legend <span class='selected-term'>Herschel Walker</span>, a Republican who is polling with a strong lead.",
    "author": "Kelsey Carolan",
    "title": "NotedDC  GOP prepares to take on Stacey Abrams",
    "sentiment": "0.0"
  },
  {
    "id": 7416,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Tal Axelrod\n<span class='selected-term'>Herschel Walker</span> clinches GOP Senate nomination in Georgia\n7:58 p.m.\nFormer NFL star Herschel Walker is projected to easily clinch the Republican Senate nomination in Georgia, securing his spot on the ballot to face off against Sen. Raphael Warnock (D-Ga.) in November.",
    "author": "",
    "title": "Live coverage: Polls close in Alabama, Texas",
    "sentiment": "0.891"
  },
  {
    "id": 7418,
    "mediaId": 18,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "OTHER DEVELOPMENTS:\nATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Arkansas Sanders mourns Texas victims",
    "sentiment": "-0.367"
  },
  {
    "id": 7420,
    "mediaId": 1546,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In a reminder of the issue's divisiveness, Biden's call for gun control on Tuesday was booed at a campaign event in Georgia hosted by <span class='selected-term'>Herschel Walker</span>, a Republican running for U.S. Senate.",
    "author": "Associated Press",
    "title": "Biden Says 'We Have to Act' After Texas School Shooting",
    "sentiment": "0"
  },
  {
    "id": 7421,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "1 hr ago 20:03 PM EDT\nTrump-backed Hershel Walker wins Senate Primary in Georgia\n<span class='selected-term'>Herschel Walker</span> will win the Georgia Republican primary for Senate.",
    "author": "Jake Thomas",
    "title": "Primary Live Updates: Sarah Huckabee Sanders Wins Arkansas Governor Primary",
    "sentiment": "0.936"
  },
  {
    "id": 7422,
    "mediaId": 409,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Early vote tallies have Kemp up by even larger margins than <span class='selected-term'>Herschel Walker</span>, who has already been called the winner of Georgias Senate primary against little-known opponents.",
    "author": "Dan McLaughlin",
    "title": "Brian Kemp Crushes David Perdue",
    "sentiment": "0"
  },
  {
    "id": 7423,
    "mediaId": 409,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Meanwhile, Trump-backed Senate candidate <span class='selected-term'>Herschel Walker</span> defeated several competitors to win the Republican primary, including state Agriculture Commissioner Gary Black and military veteran Latham Saddler, the AP projected.",
    "author": "Brittany Bernstein",
    "title": "Georgia Governor Kemp Defeats Perdue in GOP Primary, Setting Up Rematch against Stacey Abrams",
    "sentiment": "-0.35"
  },
  {
    "id": 7424,
    "mediaId": 223,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Source: AP Photo/Ben Gray\nLess than an hour after the polls closed in Georgia on Tuesday night, former NFL player <span class='selected-term'>Herschel Walker</span>, who was endorsed by former President Donald Trump, was declared the winner in the Republican primary by Decision Desk Headquarters.",
    "author": "Rebecca Downs",
    "title": "Trump-Endorsed Herschel Walker Wins Georgia Senate Primary",
    "sentiment": "0.822"
  },
  {
    "id": 7425,
    "mediaId": 558,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Also in Georgia, former football star <span class='selected-term'>Herschel Walker</span> for the Republican nomination for U.S. Senate.",
    "author": "Michael Isikoff",
    "title": "Georgia Gov. Kemp defeats Trump-backed challenger, former Senator Perdue in GOP primary",
    "sentiment": "0"
  },
  {
    "id": 7426,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> (R) declined to say on Tuesday if he voted for former Sen. David Perdue (R) or incumbent Gov.",
    "author": "Caroline Vakil",
    "title": "Walker declines to say if he backed Perdue or Kemp in Ga. gubernatorial primary",
    "sentiment": "-0.804"
  },
  {
    "id": 7427,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "GOP candidate <span class='selected-term'>Herschel Walker</span>, currently running to represent Georgia in the U.S. Senate, denied that former President Donald Trump has ever claimed the 2020 presidential election was stolen.",
    "author": "Andrew Stanton",
    "title": "Herschel Walker Denies Trump Ever Said Election Was 'Stolen'",
    "sentiment": "-0.845"
  },
  {
    "id": 7428,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In the race for Senate in Georgia, former football star <span class='selected-term'>Herschel Walker</span> is expected to win the Republican primary, despite allegations of past violent behavior with women.",
    "author": "Isabel Martins",
    "title": "Primary Election Results for Georgia, Texas, Alabama and Other States",
    "sentiment": "-0.278"
  },
  {
    "id": 7429,
    "mediaId": 21,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Appling\nAtkinson\nBacon\nBaker\nBaldwin\nBanks\nBarrow\nBartow\nBen Hill\nBerrien\nBibb\nBleckley\nBrantley\nBrooks\nBryan\nBulloch\nBurke\nButts\nCalhoun\nCamden\nGeorgia US Senate Republican Primary\nCounty Results\narrow_drop_down\nCandidate\nVotes\nPercent\n Gary Black\n 0\n 0%\n Josh Clark\n 0\n 0%\n Kelvin King\n 0\n 0%\n Latham Saddler\n 0\n 0%\n <span class='selected-term'>Herschel Walker</span>\n 0\n 0%\n Show More Candidates\n* = Incumbent\n 0 votes.",
    "author": "Grace Panetta",
    "title": "RESULTS: Trump-backed Herschel Walker vies for the GOP nomination for Senate in Georgia",
    "sentiment": "0.818"
  },
  {
    "id": 7430,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In Georgia, former football star <span class='selected-term'>Herschel Walker</span> is the overwhelming favorite to win the GOP Senate primarywhile Trump's former press secretary, Sarah Huckabee Sanders, is widely expected to win the Republican primary for Arkansas governor, as earlier indicated by a Remington Research Group poll from last year.",
    "author": "Ewan Palmer",
    "title": "Donald Trump Set for Slew of Primary Losses as Midterms Strategy Unravels",
    "sentiment": "0.0"
  },
  {
    "id": 7432,
    "mediaId": 305,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "The Georgia primary races have started today, and GOP Senate candidate <span class='selected-term'>Herschel Walker</span> couldnt help but give another priceless soundbite.",
    "author": "Murjani Rawls",
    "title": "Herschel Walker Claims Trump Never Said The Presidential Election Was 'Stolen'",
    "sentiment": "-0.809"
  },
  {
    "id": 7434,
    "mediaId": 409,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Less controversial yet, perhaps, more important to Republicans is the U.S. Senate primary, where former professional football player <span class='selected-term'>Herschel Walker</span> has dominated the field with an average of 65 percent support across all major polls.",
    "author": "Arjun Singh",
    "title": "Trumps Hold Over GOP Electorate to Be Tested in Closely Watched Primaries",
    "sentiment": "0.628"
  },
  {
    "id": 7435,
    "mediaId": 65,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "The most high-profile is former college and pro-football legend <span class='selected-term'>Herschel Walker</span>, who appears poised to easily capture the GOP nomination on his way to battling Democratic Sen. Raphael Warnock in a blockbuster general election showdown that could decide whether Republicans win back the Senate majority.",
    "author": "",
    "title": "Trump looms large over Tuesday primaries in Georgia, Alabama, Arkansas, and runoff in Texas",
    "sentiment": "0.481"
  },
  {
    "id": 7436,
    "mediaId": 441,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Former University of Georgia football legend <span class='selected-term'>Herschel Walker</span>, 60, is backed by Trump and is running far ahead of any other GOP primary contender despite participating in no debates and avoiding the news media.",
    "author": "Margaret Newkirk",
    "title": "Here Are the Key Races to Watch in Georgias Tuesday Primaries",
    "sentiment": "0.769"
  },
  {
    "id": 7437,
    "mediaId": 223,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Also in Georgia, we'll be keeping an eye on the crowded GOP Senate primary in which Trump-endorsed former NFL player <span class='selected-term'>Herschel Walker</span> is expected to win his primary against Georgia Agriculture Commissioner Gary Black, former state Representative Josh Clark, and a hat-trick of American heroes: former Navy Seal Latham Saddler, U.S. Air Force veteran Kelvin King, and former U.S. Army Special Forces brigadier general Jonathan McColumn.",
    "author": "Spencer Brown",
    "title": "Here's What to Expect in the Texas Runoffs and Races in Georgia, Alabama, and Arkansas",
    "sentiment": "0.0"
  },
  {
    "id": 7438,
    "mediaId": 238,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Return to menu\n<span class='selected-term'>Herschel Walker</span>, the former pro football player-turned-businessman, is the front-runner in the Senate Republican primary in Georgia.",
    "author": "Mariana Alfaro",
    "title": "Primary elections live updates Big races are on the ballot in Georgia, Alabama, Arkansas and Texas",
    "sentiment": "-0.905"
  },
  {
    "id": 7439,
    "mediaId": 238,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "This Republican primary is crowded, but former football star <span class='selected-term'>Herschel Walker</span> is expected to win easily.",
    "author": "Amber Phillips",
    "title": "Seven primaries to watch Tuesday, while all eyes are on Georgia",
    "sentiment": "-0.936"
  },
  {
    "id": 7444,
    "mediaId": 943,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump-backed former NFL star <span class='selected-term'>Herschel Walker</span> is poised to win Georgias GOP Senate nomination after fending off conservative opponents who raised questions about his history of domestic violence.",
    "author": "STEVE PEOPLES and JEFF AMY",
    "title": "What to watch in Tuesdays primaries: Trumps bid to reshape GOP faces biggest hurdles in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7445,
    "mediaId": 151,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "He helped recruit former football star <span class='selected-term'>Herschel Walker</span>, thus alienating another Georgia statewide official, Agriculture Commissioner Gary Black, who was already running.",
    "author": "",
    "title": "Trump sparked a GOP war in Georgia. Some arent ready to forgive and forget.",
    "sentiment": "-0.63"
  },
  {
    "id": 7446,
    "mediaId": 151,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Its one reason Trumps orbit and Senate Minority Leader Mitch McConnells political operation have united behind former football star <span class='selected-term'>Herschel Walker</span> in the Georgia Senate race: the likelihood of a close election in November against Democratic Sen. Raphael Warnock.",
    "author": "",
    "title": "Trump heads for big rebuke in Tuesdays elections",
    "sentiment": "-0.67"
  },
  {
    "id": 7451,
    "mediaId": 1576,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Democratic U.S. Sen. Raphael Warnock will face Republican football legend <span class='selected-term'>Herschel Walker</span> for a coveted Senate seat in Georgia after both handily defeated primary challengers on Tuesday to set up a historic, high-stakes showdown.",
    "author": "",
    "title": "Georgia US Senate race will pit Warnock against Walker",
    "sentiment": "-0.221"
  },
  {
    "id": 7461,
    "mediaId": 98,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Those contests, along with the likely rise of football legend <span class='selected-term'>Herschel Walker</span> and a pair of battles for the direction of the Democratic Party, make up a busy night of midterm primary action.",
    "author": "Melanie MasonStaff Writer",
    "title": "Georgia has its primary today. Heres what to watch",
    "sentiment": "0.622"
  },
  {
    "id": 7463,
    "mediaId": 25,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Former star Georgia running back <span class='selected-term'>Herschel Walker</span> has led the Republican field since he entered the race with Trump's encouragement.",
    "author": "Adam Brewster, Aaron Navarro",
    "title": "Georgia primary pits Pence-endorsed Brian Kemp against Trump-backed David Perdue",
    "sentiment": "0.0"
  },
  {
    "id": 7470,
    "mediaId": 178,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "His preferred Senate candidate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won the GOP nomination despite warnings from Walker's Republican competitors about his history of domestic violence and mental health struggles.",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Kemp wins Georgia GOP gov's race in stinging rebuke of Trump",
    "sentiment": "0.0"
  },
  {
    "id": 7471,
    "mediaId": 19,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump-backed Georgia Republican <span class='selected-term'>Herschel Walker</span>, a former NFL running back and Heisman Trophy winner, won his party primary for the U.S. Senate according to the Associated Press, which called the race at 7:56 p.m. E.T.",
    "author": "Jacob Bliss",
    "title": "Herschel Walker Clinches Georgias U.S. Senate Republican Primary",
    "sentiment": "0.548"
  },
  {
    "id": 7472,
    "mediaId": 19,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "ET\nThe first votes are showing up in Georgias results, according to the New York Times, in the Senate GOP primary where <span class='selected-term'>Herschel Walker</span> has as expected taken a commanding lead out the gate.",
    "author": "Matthew Boyle",
    "title": "*** Election Night Livewire *** Georgia, Alabama, Texas, Arkansas, Minnesota Vote in Key Primaries",
    "sentiment": "0.0"
  },
  {
    "id": 7474,
    "mediaId": 1164,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In the Georgia U.S. Senate race, former NFL star <span class='selected-term'>Herschel Walker</span>, who is backed by Trump, is expected to handily win, setting up a showdown with current Democratic Sen. Raphael Warnock.",
    "author": "Clyde Hughes",
    "title": "Georgia governor, Senate races highlight primaries in 5 states",
    "sentiment": "0.0"
  },
  {
    "id": 7476,
    "mediaId": 188,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Former NFL player <span class='selected-term'>Herschel Walker</span>, another Trump-backed candidate, secured victory in the Republican primary for U.S. Senate in Georgia, according to an AP race call, and will now go up against Democratic Sen. Raphael Warnock.",
    "author": "Alex Nitzberg",
    "title": "Georgia Gov. Brian Kemp defeats Trump-backed David Perdue in Peach State gubernatorial primary; Kemp will face off against Democrat Stacey Abrams during the general election",
    "sentiment": "0.0"
  },
  {
    "id": 7477,
    "mediaId": 234,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Republican Senate candidate <span class='selected-term'>Herschel Walker</span> waltzed through his Georgia primary on Tuesday.",
    "author": "Caleb Ecarma",
    "title": "The GOP Needs Trump-Loving Football Champ Herschel Walker to Be Teflon",
    "sentiment": "-0.817"
  },
  {
    "id": 7480,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Abrams is unopposed in her effort to unseat Kemp in November and Warnock is expected to sail through his primary before facing a challenge from Trump-backed former football star <span class='selected-term'>Herschel Walker</span>.",
    "author": "Agence France-Presse",
    "title": "Georgia set to test Trump's US voter fraud 'Big Lie'",
    "sentiment": "0.0"
  },
  {
    "id": 7331,
    "mediaId": 238,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Trump notched an expected win in Georgia's Republican primary for U.S. Senate, where former NFL star <span class='selected-term'>Herschel Walker</span> won.",
    "author": "David Weigel",
    "title": "Kemp, Raffensperger win in blow to Trump and his false election claims",
    "sentiment": "0.0"
  },
  {
    "id": 7345,
    "mediaId": 1576,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Former football great <span class='selected-term'>Herschel Walker</span>, Trump's pick for U.S. Senate in Georgia, dominated the Republican challengers in his primary.",
    "author": "",
    "title": "Takeaways: Trump's big primary defeat; scandals for the win",
    "sentiment": "0.395"
  },
  {
    "id": 7357,
    "mediaId": 151,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Trump was not without victories  most significantly <span class='selected-term'>Herschel Walker</span> in the U.S. Senate primary.",
    "author": "",
    "title": "Trump flops in Georgia: 5 takeaways from a big primary night",
    "sentiment": "0.0"
  },
  {
    "id": 7362,
    "mediaId": 195,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> sailed to victory in Georgia's GOP Senate primary, setting up a matchup with incumbent Democratic Sen. Raphael Warnock (D-Ga.).",
    "author": "Max Greenwood",
    "title": "Five takeaways from primaries in Georgia, Alabama and beyond",
    "sentiment": "0.0"
  },
  {
    "id": 7369,
    "mediaId": 65,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "To read more from Fox News' Kyle Morris, click here\nFormer football star <span class='selected-term'>Herschel Walker</span> won Georgia's Republican Senate primary Tuesday, as he seeks to unseat Sen. Raphael Warnock, D-Ga., in November.",
    "author": "Tyler Olson",
    "title": "Primary elections in Georgia, Alabama, runoff in Texas",
    "sentiment": "0.0"
  },
  {
    "id": 7370,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Nguyen in runoff in Democratic SoS primary",
    "sentiment": "0.0"
  },
  {
    "id": 7372,
    "mediaId": 151,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Republicans in two deep-red states are also voting in major Senate contests, while Trump-endorsed <span class='selected-term'>Herschel Walker</span> is looking to sew up the nomination for the battleground race in Georgia.",
    "author": "",
    "title": "Kemp notches huge primary win in Georgia",
    "sentiment": "0.844"
  },
  {
    "id": 7374,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Raffensperger beats Trump-endorsed Hice",
    "sentiment": "0.0"
  },
  {
    "id": 7377,
    "mediaId": 65,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "The most high-profile candidate Trump endorsed is former college and pro-football legend <span class='selected-term'>Herschel Walker</span>, who easily captured the GOP nomination on his way to battling Democratic Sen. Raphael Warnock in a blockbuster general election showdown that could decide whether Republicans win back the Senate majority.",
    "author": "Paul Steinhauser",
    "title": "Kemp beats Perdue in Georgia governor primary, striking most significant blow to Trump's endorsement power yet",
    "sentiment": "0.0"
  },
  {
    "id": 7379,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Jones, Collins in Georgia GOP House runoff",
    "sentiment": "0.0"
  },
  {
    "id": 7380,
    "mediaId": 178,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "His preferred Senate candidate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won the GOP nomination despite warnings from Walker's Republican competitors about his history of domestic violence and mental health struggles.",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Trump rebuked with stinging losses in Georgia GOP contests",
    "sentiment": "0.0"
  },
  {
    "id": 7406,
    "mediaId": 147,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA (AP)  Football great <span class='selected-term'>Herschel Walker</span>, endorsed by former President Donald Trump, won Georgias GOP Senate primary.",
    "author": "Associated Press",
    "title": "Trump pick Herschel Walker wins Georgias Republican Senate primary",
    "sentiment": "0.486"
  },
  {
    "id": 7407,
    "mediaId": 136,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span>, who earned Donald Trump's endorsement, won his Senate primary race in Georgia, beating out five other Republican candidates to face off against Democratic Senator Raphael Warnock in November.",
    "author": "Katherine Fung",
    "title": "Trump-Backed Herschel Walker, Who Questioned Evolution, Wins in Georgia",
    "sentiment": "-0.728"
  },
  {
    "id": 8357,
    "mediaId": 129,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "In Georgia's U.S. Senate race, <span class='selected-term'>Herschel Walker</span>, the former University of Georgia football star who was also recruited by Mr. Trump, won the Republican nomination and will face Senator Raphael Warnock, a Democrat, in November.",
    "author": "",
    "title": "Primary Elections Live Updates: Voters Reject Trump Endorsed Candidates in Georgia",
    "sentiment": "-0.952"
  },
  {
    "id": 8363,
    "mediaId": 65,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "Heisman Trophy winner and former Dallas Cowboys running back <span class='selected-term'>Herschel Walker</span>, however, handily defeated his opponents, earning a Trump-endorsed win in the U.S. Senate primary.",
    "author": "",
    "title": "Georgia Gov. Kemp responds to Trump critiques, says Stacey Abrams is main focus",
    "sentiment": "0.0"
  },
  {
    "id": 8365,
    "mediaId": 302,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "His early support helped football great <span class='selected-term'>Herschel Walker</span> and Rep. Ted Budd sail to their respective Senate primary nominations in Georgia and North Carolina.",
    "author": "Associated Press",
    "title": "Trump is in the past': Mounting losses show limits of power",
    "sentiment": "0.0"
  },
  {
    "id": 8404,
    "mediaId": 376,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "Shop talk: Stephen Lawson\nLawson, CEO of Battleground Strategies, served as deputy campaign manager for former GOP Sen. Kelly Loeffler of Georgia in 2020 and currently is spokesman for a SuperPAC supporting this years nominee, <span class='selected-term'>Herschel Walker</span>, who faces Democratic Sen. Raphael Warnock.",
    "author": "Kate Ackley\nMary Ellen McIntire\nStephanie Akin",
    "title": "At the Races: Divisions on display",
    "sentiment": "0.0"
  },
  {
    "id": 8426,
    "mediaId": 881,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "- Georgia GOP Senate nominee <span class='selected-term'>Herschel Walker</span>, asked about Donald Trump's assertions that the 2020 election was stolen\nTrainWEC  Wisconsin's bid to be the swing-state king of stolen-election destruction continues.",
    "author": "Todd Zwillich",
    "title": "Trump's Candidates Took a Beating in GeorgiaBut Don't Get Too Excited",
    "sentiment": "0.0"
  },
  {
    "id": 8584,
    "mediaId": 305,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "The upcoming Georgia senate race is set between Democratic incumbent Sen. Raphael Warnock and Republican challenger <span class='selected-term'>Herschel Walker</span>.",
    "author": "Murjani Rawls",
    "title": "Sen. Warnock Challenges Herschel Walker To Three Televised Debates",
    "sentiment": "0"
  },
  {
    "id": 8588,
    "mediaId": 238,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "The beneficiaries of the couples political contributions include at least one candidate who emerged victorious in Tuesdays primary contests, <span class='selected-term'>Herschel Walker</span>.",
    "author": "Isaac Stanley-Becker",
    "title": "Maker of rifle in Texas massacre is deep-pocketed GOP donor",
    "sentiment": "0"
  },
  {
    "id": 8590,
    "mediaId": 151,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "While <span class='selected-term'>Herschel Walker</span> easily won the Republican nomination in Georgia on Tuesday, GOP candidates in Arizona, Nevada and New Hampshire are still battling through contested primaries.",
    "author": "",
    "title": "The gun debate roadblock you might not expect: Swing states",
    "sentiment": "0"
  },
  {
    "id": 8418,
    "mediaId": 136,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "Still, several of his endorsed candidates have easily won their primaries including <span class='selected-term'>Herschel Walker</span>, who faced little opposition in the primary for Georgia's Senate race, and other candidates running in heavily-conservative districts.",
    "author": "Andrew Stanton",
    "title": "Lindell Claims Georgia Primaries 'Stolen' to Ding Trump Endorsement Cred",
    "sentiment": "0.0"
  },
  {
    "id": 8496,
    "mediaId": 19,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "The battleground state has attracted national attention as Trump has continued to be vocal about his ire toward Kemp, and in the Senate race, Georgians have somewhat of a celebrity on the ballot in <span class='selected-term'>Herschel Walker</span>, who is up against vulnerable Sen. Raphael Warnock (D-GA).",
    "author": "Ashley Oliver",
    "title": "Exclusive  Supercharged Brian Kemp Races into Governors Rematch: Stacey Abrams Will Be Great Unifier for Georgia Republicans",
    "sentiment": "0"
  },
  {
    "id": 8478,
    "mediaId": 195,
    "date": "5/29/2022 12:00:00 AM",
    "sentence": "Trumps pick for U.S. Senate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won his primary on Tuesday, as did other Trump allies including his former press secretary, Sarah Huckabee Sanders, in the Arkansas gubernatorial race.",
    "author": "",
    "title": "What 2022s primary results tell us about both parties",
    "sentiment": "0.772"
  },
  {
    "id": 8579,
    "mediaId": 151,
    "date": "5/29/2022 12:00:00 AM",
    "sentence": "Only in Georgia, it was incumbent Sen. Raphael Warnock who issued the call Thursday for three televised debates, as soon as his fall Senate election match-up with <span class='selected-term'>Herschel Walker</span> was set.",
    "author": "",
    "title": "He doesn't speak in beautiful syntax: GOP bets the Senate that Walker is ready for prime time",
    "sentiment": "-0.858"
  }
]