[
  {
    "id": 8173,
    "mediaId": 12,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "The former president has also backed former football star <span class='selected-term'>Herschel Walker</span> for the U.S. Senate, state Sen. Burt Jones for lieutenant governor and Perdue against Kemp.",
    "author": "Greg Bluestein",
    "title": "Self-proclaimed Black Donald Trump to test ex-presidents brand in rural Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 8168,
    "mediaId": 43,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Hice is challenging Secretary of State Brad Raffensperger, who also has Trumps support, as does another GOP-er with a long history of violence against women: <span class='selected-term'>Herschel Walker</span> for Senate.",
    "author": "Rebekah Sager",
    "title": "On Jan. 6 Vernon Jones switched parties. Trump's endorsing him for a Congressional seat in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 8106,
    "mediaId": 12,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "Former U.S. Sen. David Perdue said Russia wouldnt have invaded its neighbor if Trump was still president and Senate candidate <span class='selected-term'>Herschel Walker</span> faulted Bidens disastrous foreign policy  and Americans themselves.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Trump candidates in Georgia split from pro-Putin rhetoric",
    "sentiment": "0.0"
  },
  {
    "id": 7906,
    "mediaId": 558,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Saturdays rally in Commerce, 70 miles north-east of Atlanta and one of the most conservative parts of the state, is expected to feature <span class='selected-term'>Herschel Walker</span>, a former football player running for the US Senate; Perdue; and the congressional candidate Vernon Jones, a former Democratic state representative who began calling himself the Black Donald Trump after switching parties.",
    "author": "Edward Helmore",
    "title": "Trump heads to Georgia in high-stakes bid to shape Republican primaries",
    "sentiment": "0.277"
  },
  {
    "id": 7911,
    "mediaId": 19,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Multiple Trump-endorsed candidates are scheduled to speak at Saturdays rally, including former football star and current Republican primary Senate candidate <span class='selected-term'>Herschel Walker</span> and former Senator and current gubernatorial candidate David Perdue.",
    "author": "Ethan Letkeman",
    "title": "Watch Live: Donald Trump Holds Save America Rally in Commerce, Georgia",
    "sentiment": "0"
  },
  {
    "id": 7889,
    "mediaId": 237,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "The 45th president added that the stakes for <span class='selected-term'>Herschel Walker</span>, a GOP Senate candidate in the Peach State and former star running back, are also high.",
    "author": "Heather Hamilton",
    "title": "'It's a vote for this country': Trump touts David Perdue for Georgia's next governor",
    "sentiment": "0.814"
  },
  {
    "id": 6538,
    "mediaId": 195,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span> is all but guaranteed to win the GOP Senate primary, setting up a general election match-up with Sen. Raphael Warnock (D) in November.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump faces critical popularity test in Georgia",
    "sentiment": "0.693"
  },
  {
    "id": 7490,
    "mediaId": 376,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Here are the Senate and House races to watch:\nWalker in the home stretch\nWith an endorsement from Trump and an enduring celebrity from his days as a star running back for the University of Georgia Bulldogs then in the NFL, <span class='selected-term'>Herschel Walker</span> is widely expected to win the Georgia GOP nomination to challengeWarnock, who is running for a complete term after winning a runoff special election that helped give Democrats their narrow control of the Senate in January 021.",
    "author": "Stephanie Akin",
    "title": "What to watch in Tuesdays primaries in Georgia",
    "sentiment": "0"
  },
  {
    "id": 7491,
    "mediaId": 169,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trump is predicted to have at least one winner on the day: Former football star <span class='selected-term'>Herschel Walker</span> will be the GOP nominee for the U.S. Senate seat currently held by Democrat Raphael Warnock.",
    "author": "Heather Digby Parton",
    "title": "Trump's guys may lose in Georgia  but his Big Lie is going strong",
    "sentiment": "0"
  },
  {
    "id": 7498,
    "mediaId": 157,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trump is predicted to have at least one winner on the day: Former football star <span class='selected-term'>Herschel Walker</span> will be the GOP nominee for the U.S. Senate seat currently held by Democrat Raphael Warnock.",
    "author": "Heather Digby Parton",
    "title": "Trump is facing an embarrassing defeat  but here's why it might not matter",
    "sentiment": "-0.507"
  },
  {
    "id": 7434,
    "mediaId": 409,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Less controversial yet, perhaps, more important to Republicans is the U.S. Senate primary, where former professional football player <span class='selected-term'>Herschel Walker</span> has dominated the field with an average of 65 percent support across all major polls.",
    "author": "Arjun Singh",
    "title": "Trumps Hold Over GOP Electorate to Be Tested in Closely Watched Primaries",
    "sentiment": "0.628"
  },
  {
    "id": 7464,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Federal and state campaign records show the GOP candidates backed by the former president spent tens of thousands of dollars at the private club, and Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> spent nearly $200,000 there so far during the election cycle, including a payment of more than $135,000 in December and about $65,000 last month, reported CNBC.",
    "author": "Travis Gettys",
    "title": "GOP candidates spent $400K at Mar-A-Lago asking for Trumps endorsement",
    "sentiment": "0"
  },
  {
    "id": 7374,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Raffensperger beats Trump-endorsed Hice",
    "sentiment": "0.0"
  },
  {
    "id": 8363,
    "mediaId": 65,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "Heisman Trophy winner and former Dallas Cowboys running back <span class='selected-term'>Herschel Walker</span>, however, handily defeated his opponents, earning a Trump-endorsed win in the U.S. Senate primary.",
    "author": "",
    "title": "Georgia Gov. Kemp responds to Trump critiques, says Stacey Abrams is main focus",
    "sentiment": "0.0"
  },
  {
    "id": 8418,
    "mediaId": 136,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "Still, several of his endorsed candidates have easily won their primaries including <span class='selected-term'>Herschel Walker</span>, who faced little opposition in the primary for Georgia's Senate race, and other candidates running in heavily-conservative districts.",
    "author": "Andrew Stanton",
    "title": "Lindell Claims Georgia Primaries 'Stolen' to Ding Trump Endorsement Cred",
    "sentiment": "0.0"
  }
]