[
  {
    "id": 7696,
    "mediaId": 238,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "The same could be said about <span class='selected-term'>Herschel Walker</span> in Georgia.",
    "author": "",
    "title": "Opinion: What the parade of GOP sexual misconduct allegations really tells us",
    "sentiment": "0.0"
  },
  {
    "id": 6043,
    "mediaId": 238,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "They include <span class='selected-term'>Herschel Walker</span>, a U.S. Senate candidate in Georgia who has been accused of threatening the lives of two women, as well as Sean Parnell, who ended his U.S. Senate campaign in Pennsylvania last year amid domestic abuse allegations, and Roy Moore, a 2017 candidate for U.S. Senate in Alabama who was accused by two women of initiating unwanted sexual encounters when Moore was in his 30s and they were 16 and 14.",
    "author": "",
    "title": "Trump makes closing pitch for Nebraska candidate accused of groping",
    "sentiment": "0.0"
  },
  {
    "id": 7632,
    "mediaId": 43,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "And in addition to the Thomas-Trump-Kavanaugh list Herbster was so eager to associate himself with, Trumps endorsements include <span class='selected-term'>Herschel Walker</span>, a U.S. Senate candidate in Georgia who has been accused of threatening the lives of two women, as well as Sean Parnell, who ended his U.S. Senate campaign in Pennsylvania last year amid domestic abuse allegations, and Roy Moore, a 2017 candidate for U.S. Senate in Alabama who was accused by two women of initiating unwanted sexual encounters when Moore was in his 30s and they were 16 and 14, as The Washington Post summarizes.",
    "author": "Laura Clawson",
    "title": "Trump rallies support for Nebraska candidate, insisting he's 'innocent' of sexual assault",
    "sentiment": "0.0"
  },
  {
    "id": 5609,
    "mediaId": 129,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "Later this year in Georgia, another Trump-endorsed candidate who has faced allegations of domestic violence, <span class='selected-term'>Herschel Walker</span>, is running for Senate, though he does not face a competitive primary.",
    "author": "",
    "title": "What Were Watching For in the Nebraska and West Virginia Primaries",
    "sentiment": "-0.472"
  },
  {
    "id": 7577,
    "mediaId": 233,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Eric Greitens, a Republican seeking a U.S. Senate seat, and former football star <span class='selected-term'>Herschel Walker</span>, a GOP member running for the U.S. Senate from Georgia.",
    "author": "David Jackson",
    "title": "Trump candidate loses Nebraska GOP primary after allegations of sexual misconduct",
    "sentiment": "0.0"
  },
  {
    "id": 7087,
    "mediaId": 65,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Hes also backing former football star <span class='selected-term'>Herschel Walker</span> in the Senate primary, and has also taken sides in the GOP primaries for lieutenant governor, Secretary of State, and a couple of congressional contests.",
    "author": "Paul Steinhauser",
    "title": "Why Trump's full court press in Georgia hasn't helped Perdue's bid to oust Kemp",
    "sentiment": "0.0"
  },
  {
    "id": 7531,
    "mediaId": 1576,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "Brian Kemp and former football star <span class='selected-term'>Herschel Walker</span> hope to win GOP majorities and clinch nominations for governor and U.S. senator on Tuesday without runoffs, with polls showing both men backed by more than 50% of voters.",
    "author": "",
    "title": "Kemp and Walker look to victory in Georgia as primaries near",
    "sentiment": "-0.255"
  },
  {
    "id": 7329,
    "mediaId": 33,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Democratic Sen. Raphael Warnock is facing election for a full six-year term and likely to face the Trump-backed former football star <span class='selected-term'>Herschel Walker</span>, who is favored to win Tuesday's Republican primary.",
    "author": "Eric Bradner",
    "title": "Republicans look to Georgia for a path beyond Trump's 2020 grievances",
    "sentiment": "0.0"
  },
  {
    "id": 7357,
    "mediaId": 151,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Trump was not without victories  most significantly <span class='selected-term'>Herschel Walker</span> in the U.S. Senate primary.",
    "author": "",
    "title": "Trump flops in Georgia: 5 takeaways from a big primary night",
    "sentiment": "0.0"
  }
]