[
  {
    "id": 1321,
    "mediaId": 12,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "I can promise you <span class='selected-term'>Herschel Walker</span> is going to be in this race.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Herschel Walker hits weak' U.S. leadership in Russia crisis",
    "sentiment": "-0.689"
  },
  {
    "id": 1317,
    "mediaId": 12,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "We told you Tuesday that <span class='selected-term'>Herschel Walker</span> blasted the Biden administration's weak? response to the unfolding Russian invasion of the Ukraine during another stop in Dahlonega.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Herschel Walker: I don't support either' Brian Kemp or David Perdue",
    "sentiment": "-0.243"
  },
  {
    "id": 8108,
    "mediaId": 12,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "The fundraiser was for House and Senate candidates, including <span class='selected-term'>Herschel Walker</span>.",
    "author": "Patricia Murphy",
    "title": "OPINION: The good, the bad, and the un-American in the response to the Ukraine crisis",
    "sentiment": "0.0"
  },
  {
    "id": 8097,
    "mediaId": 12,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> pulled out of a weekend event organized by U.S. Rep. Marjorie Taylor Greene after she spoke at a white nationalist rally where attendees cheered Russias invasion of Ukraine and chanted Vladimir Putins name.",
    "author": "Greg Bluestein",
    "title": "Walker wont go to Marjorie Taylor Greene event after she spoke at pro-Putin rally",
    "sentiment": "-0.389"
  },
  {
    "id": 8061,
    "mediaId": 12,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Stephen Lawson, spokesperson for the 34N22 political action committee, which is supporting Republican senate candidate <span class='selected-term'>Herschel Walker</span>, said in February that Warnock's record is causing Georgias gas prices to spike and our country to lose its energy independence.",
    "author": "JEFF AMY",
    "title": "Kemp and Warnock push for halt to gas taxes as prices rise",
    "sentiment": "0.0"
  },
  {
    "id": 8038,
    "mediaId": 43,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "x\nx\nNew revelations about <span class='selected-term'>Herschel Walker</span> show how Democrats could hold the Senate\nHerschel Walkers candidacy for the U.S. Senate in Georgia is built on celebrity, but when hes out on the campaign trail, hes as likely to offer his success as a businessman as a qualification to serve in Washington as he is to reminisce about his days as a football star.",
    "author": "",
    "title": "Western Democracy is Stronger than We Thought: Saturday's Good News",
    "sentiment": "0.0"
  },
  {
    "id": 8028,
    "mediaId": 234,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Per HuffPost:\nRepublican Senate candidate <span class='selected-term'>Herschel Walker</span> cast doubt on the theory of evolution in recent remarks, saying the fact that apes and humans coexist disproves accepted science.",
    "author": "Bess Levin",
    "title": "Eric Trump: Putin Was Pants-Pissingly Terrified of My Dad, O.K.?",
    "sentiment": "-0.26"
  },
  {
    "id": 8030,
    "mediaId": 43,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Seems would-be Senator <span class='selected-term'>Herschel Walker</span> finally arrived, a few decades late, to the long-ago debunked if evolution is real why are there still apes CHECKMATE LIBTARD PRIMATES party, and Im looking forward to next week, when he blows the lid off Robert Byrds misspent youth.",
    "author": "",
    "title": "In Putins Russia, War Crimes Commit YOU!",
    "sentiment": "0.0"
  },
  {
    "id": 7997,
    "mediaId": 124,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "A brutal Senate primary is heating up in Georgia, where Republican Gary Blacks campaign dropped opposition research about primary opponent <span class='selected-term'>Herschel Walker</span> (former President Donald Trumps pick), highlighting a lengthy list of allegations of domestic assault, threats and violence.",
    "author": "",
    "title": "Day 22 into Russia's invasion of Ukraine: A glimmer of hope and a devastating reality",
    "sentiment": "-0.953"
  },
  {
    "id": 7930,
    "mediaId": 233,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Biden to Mehmet Oz, <span class='selected-term'>Herschel Walker</span>: Resign or be fired from presidential board.",
    "author": "Nicole Fallert",
    "title": "100,000 refugees",
    "sentiment": "0.0"
  },
  {
    "id": 7931,
    "mediaId": 233,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "The White House sent letters to Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span>, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, according to reports by several media outlets.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: Should Russia be kicked out of the G-20?",
    "sentiment": "0"
  },
  {
    "id": 7885,
    "mediaId": 151,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "POLITICO Playbook: Bidens 9-word ad-lib that set the world ablaze",
    "sentiment": "0.0"
  },
  {
    "id": 7897,
    "mediaId": 43,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "Kid Rock says that Trump asked him for advice on handling North Korea\n 18%\n88 votes\nRussian airstrike in Ukraine causes heavy damage to an oil refinery owned by a Russian company\n 13%\n65 votes\nQ-Anon group says the wat in Ukraine is all [art of a plan to expose Biden's criminality so that JFK, who is disguied as Donald Trump, can assume the presidency\n 32%\n158 votes\nAfter capturing 117 Russian tanks, Ukraine now has more tanks than it did at the beginning of the war\n 25%\n122 votes\n<span class='selected-term'>Herschel Walker</span> demands that schools stop teaching \"CTR\"\n 13%\n64 votes",
    "author": "",
    "title": "Tweets of the Week March",
    "sentiment": "0"
  },
  {
    "id": 7857,
    "mediaId": 124,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Georgia Senate: Two super PACs backing GOP Senate candidates Gary Black and Latham Saddler are planning seven-figure ad buys attacking Republican frontrunner <span class='selected-term'>Herschel Walker</span> ahead of the May 24 primary, in an attempt to force Walker into a primary runoff, Politico reports.",
    "author": "",
    "title": "For all of Bidens troubles, hes still more popular than Trump in the NBC News poll",
    "sentiment": "0.0"
  },
  {
    "id": 7847,
    "mediaId": 43,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "State Sen. Bruce Bostelman (R-NE), forced to apologize after he publicly cited a persistent but debunked rumor alleging schools are placing litter boxes in bathrooms to accommodate children who self-identify as cats\n Boris Johnson, as his government was among those cited by the London polices issuing some 20 fines in connection with breaches of covid-19 regulations at government buildings including 10 Downing Street\n Film star Ezra Miller (of Flash fame), arrested for disorderly conduct and harassment in a karaoke bar in Hawaii  and ha apparently been reported to police several times before\n Rep Madison Cawthorn (R-NC), upbraided by fellow conservatives not for all of his past behavior  but solely for suggesting in an interview that he has been invited to GOP orgies and cocaine sessions\n Infowars host Alex Jones, ordered by a judge to start paying $25k/day fines for failing to appear at a deposition in a civil lawsuit filed by families of Sandy Hook school shooting victims\n Will Smith, forced to resign from the Academy of Motion Picture Arts and Sciences (as a voting member) following last Sundays award ceremony\n University of Houston volleyball stars Isabel Theut and Abbie Jackson, under investigation after being in a video posted on Snapchat, laughing at a tree where two black teenagers were lynched by a mob of 700 white people in 1935\n Intel Corp, under fire after a filing revealed the stock options given to its new CEO Pat Gelsinger were $169.5m, much more than the company reported and more than the $98.7m Apple gave Tim Cook, which sparked a shareholder revolt\n Anti-abortion extremist Lauren Handy, already indicted for a blockade of abortion clinics ... found by the FBI to have kept 5 bags of fetuses at her home in D.C. that she rented from a former Trump counsel  who clerked for Clarence Thomas\n State assembly leader Robin Vos, held in contempt of court after he failed to obey an order to produce records from the investigation Vos himself launched (hiring Michael Gableman) relating to the 2020 election\n Karl Rove, after the attorney for the disgraced Senate candidate Eric Greitens claimed Rove may have committed a crime by persuading Greitens ex-wife to file an affidavit against him alleging domestic violence (that Greitens denies)\n Amazon, losing a warehouse union vote in State Island, New York despite an all-out effort to defeat the measure and without any assistance from an established union or professional organizer\n Greg Abbott, as a federal judge declared his state governments investigation into a Texas home (for sexually abused girls) possibly delving into child porn production has been slipshod and will refer the case to the US Attorney\n Ghislaine Maxwell, as her motion for a new trial based on a jurors potential bias (that he falsely stated before the trial that he had never been sexually abused) was denied\n US Senate candidate <span class='selected-term'>Herschel Walker</span> (R-GA), claiming he graduated in the top 1% from the University of Georgia  when he did not even graduate, and also lying about being a high school valedictorian\n Jamie Petrone-Codrington, an administrator at Yale School of Medicine, pleading guilty to stealing $40m in computer and electronic hardware purchased via school accounts then secretly reselling for her own profit (in $10k increments)\n Multiple names listed - or a write-in - either way, please elaborate in a comment\n 130 votes Vote Now!",
    "author": "",
    "title": "Odds & Ends: News/Humor (with a \"Who Lost the Week?\" poll)",
    "sentiment": "0.0"
  },
  {
    "id": 7827,
    "mediaId": 12,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "DAHLONEGA  Taking the stage of a packed gym in the foothills of North Georgia, <span class='selected-term'>Herschel Walker</span> gave the audience exactly what they wanted: a raft of conservative campaign promises, including a pledge to rid the state of Democratic U.S. Sen. Raphael Warnock.",
    "author": "Greg Bluestein",
    "title": "Cruise control? Walker ignores rivals, aims for Warnock ahead of May primary",
    "sentiment": "-0.729"
  },
  {
    "id": 7819,
    "mediaId": 195,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "Fox News Sunday  White House press secretary Jen Psaki; Sen. Mitch McConnell (R-Ky.)\nFox News Sunday Morning Futures  Ranking member of House Judiciary Committee Rep. Jim Jordan (R-Ohio); <span class='selected-term'>Herschel Walker</span>, Georgia Senate candidate; House Minority Leader Rep. Kevin Mccarthy (R-Calif.); U.S. Army combat veteran and Florida Congressional candidate Cory Mills.",
    "author": "Lexi Lonas",
    "title": "Sunday shows preview: Ukraine, West condemn Russian attacks on civilians",
    "sentiment": "0.0"
  },
  {
    "id": 7794,
    "mediaId": 209,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "Donald Trump has \"racked up quite a roster of endorsees: Dr. Oz, <span class='selected-term'>Herschel Walker</span>, Sarah Palin  his goal is to turn Congress into The Celebrity Apprentice,\" Kimmel said.",
    "author": "Peter Weber",
    "title": "Late night hosts explore Russia's sanctions pains, Don Jr.'s election texts, Trump's Dr. Oz nod",
    "sentiment": "0.253"
  },
  {
    "id": 7455,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "NOW WATCH: <span class='selected-term'>Herschel Walker</span> argues with reporter Trump 'never said' election was stolen",
    "author": "David Edwards",
    "title": "'I'm just a journalist!' Fox News host Harris Faulkner clashes with Dem for exposing her 'conservative' bias",
    "sentiment": "0.0"
  },
  {
    "id": 7462,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "NOW WATCH: <span class='selected-term'>Herschel Walker</span> argues with reporter Trump 'never said' election was stolen\nStories Chosen For You",
    "author": "Tom Boggioni",
    "title": "'He will not run the country': Putin's inner circle reportedly looking for his replacement",
    "sentiment": "0.0"
  }
]