[
  {
    "id": 8342,
    "mediaId": 12,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> has spent the opening months on the campaign trail speaking mostly to conservative media outlets that offered him friendly questions.",
    "author": "Tia Mitchell",
    "title": "The Jolt: The Cobb homage to treason planned for Jan. 6",
    "sentiment": "0"
  },
  {
    "id": 8165,
    "mediaId": 558,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Georgia Senate Walker\nFILE - Former Georgia running back and Republican Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> attends a college football game between UAB and Georgia, Sept. 11, 2021, in Atlanta.",
    "author": "BRIAN SLODYSKO",
    "title": "Police records complicate Herschel Walker's recovery story",
    "sentiment": "-0.85"
  },
  {
    "id": 8151,
    "mediaId": 12,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "It was updated on Feb. 11, 2022, to make clear that U.S. Senate candidate <span class='selected-term'>Herschel Walker</span>s therapist, Jerry Mungadze, holds a doctorate of philosophy in counselor education.",
    "author": "BRIAN SLODYSKO",
    "title": "Police records complicate Herschel Walker's recovery story",
    "sentiment": "-0.869"
  },
  {
    "id": 8159,
    "mediaId": 1576,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "We are very proud of the man <span class='selected-term'>Herschel Walker</span> has become, Diane McKnight, Deans mother, said in a statement provided by Walkers campaign.",
    "author": "",
    "title": "Police records complicate Herschel Walker's recovery story",
    "sentiment": "-0.867"
  },
  {
    "id": 8147,
    "mediaId": 112,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "Associated Press\nHeavily redacted records from 2001 incident at Walkers former home in a gated suburban Dallas subdivision adds another layer to an already turbulent personal history, which includes the former football stars acknowledged struggles with mental health, violent outbursts and accusations that he repeatedly threatened his ex-wife\nWASHINGTON (AP)  One warm fall evening in 2001, police in Irving, Texas, received an alarming call from <span class='selected-term'>Herschel Walker</span>s therapist.",
    "author": "Associated Press",
    "title": "Texas police report provided to the AP under legal compulsion complicates the Herschel Walker redemption tale",
    "sentiment": "-0.977"
  },
  {
    "id": 1279,
    "mediaId": 19,
    "date": "3/3/2022 12:00:00 AM",
    "sentence": "Usually, that signals a potential upset for the incumbent.?\nThe poll also weighed the primary field for the Senate race, which is poised to become an expensive battleground general election contest between incumbent Sen. Raphael Warnock (D-GA) and the leading Republican candidate, <span class='selected-term'>Herschel Walker</span>.",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Kemp Holds Lead over Perdue in Governor's Race; Herschel Walker Dominates Senate Primary",
    "sentiment": "0"
  },
  {
    "id": 7972,
    "mediaId": 237,
    "date": "3/22/2022 12:00:00 AM",
    "sentence": "He is supporting <span class='selected-term'>Herschel Walker</span> for Senate in Georgia and David McCormick for Senate in Pennsylvania.",
    "author": "Virginia Aabram",
    "title": "Pompeo endorses Rep. Ronny Jackson for reelection in Texas",
    "sentiment": "0.0"
  },
  {
    "id": 7974,
    "mediaId": 136,
    "date": "3/22/2022 12:00:00 AM",
    "sentence": "Football legend <span class='selected-term'>Herschel Walker</span> is currently challenging Sen. Raphael Warnock in Georgia.",
    "author": "",
    "title": "How the GOP Can Make Long-Term Gains with Black and Hispanic Voters | Opinion",
    "sentiment": "0"
  },
  {
    "id": 7966,
    "mediaId": 43,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "If the election were today, Senator Warnock could be destined for defeat against Football Star <span class='selected-term'>Herschel Walker</span>, the almost certain nominee for the GOP.",
    "author": "",
    "title": "Can Raphael Warnock win Georgia a Second Time?",
    "sentiment": "0.424"
  },
  {
    "id": 7898,
    "mediaId": 19,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "In other posts, Siskind has made similar remarks about Republicans and the Taliban:\nMeanwhile, Georgia U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> said the Biden administration was using its call for him to step down from the Sports & Fitness Council to bolster his challenger, the incumbent Sen. Warnock.",
    "author": "Amy Furr",
    "title": "Raphael Warnock Fundraises with Activist Who Compared Republicans to Terrorists",
    "sentiment": "-0.523"
  },
  {
    "id": 6313,
    "mediaId": 151,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Thats three times as much money as GOP primary frontrunner <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "5 numbers to know from the new FEC reports",
    "sentiment": "0.0"
  },
  {
    "id": 7721,
    "mediaId": 63,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "(Twitter/Matt Corley of Citizens for Responsibility and Ethics in Washington)\nBiden to hold first road fundraisers of presidency (Axios)\nEx-Rep. Pete King registers as lobbyist for facility accused of torturing children (LegiStorm)\nGyms, restaurants, music venues among those seeking billions in pandemic relief (The Hill)\nBank records shed light on dark-money group in Florida ghost candidate scandal (Tampa Bay Times)\n<span class='selected-term'>Herschel Walker</span> Claims to Own Companies That Dont Exist (The Daily Beast)\nAn 83-year-old California man was sentenced to 3.5 years in prison after stealing more than $250,000 by pretending to raise money for Bernie Sanders, Beto ORourke and others (Insider)\nIn Closing\nI own that so I pay myself (ha ha!)",
    "author": "Zach Everson",
    "title": "Checks And Imbalances: The Reporter's Notebook Edition",
    "sentiment": "0.0"
  },
  {
    "id": 7707,
    "mediaId": 129,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "It was a campaign stop for a Senate candidate, but for many Georgians who came to see <span class='selected-term'>Herschel Walker</span>, politics was hardly the only draw.",
    "author": "",
    "title": "Herschel Walkers Senate Bid in Georgia Is Powered by Fandom",
    "sentiment": "0"
  },
  {
    "id": 7671,
    "mediaId": 98,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Right now the leading candidate in Georgias Republican primary for the Senate is <span class='selected-term'>Herschel Walker</span>, a former Georgia Bulldog football star who lied about graduating from college, lied about being high school valedictorian, and earlier this year told college students in Texas that his upholstery company employs about 250 people when in fact theres no evidence of him even owning an upholstery company.",
    "author": "",
    "title": "Column: Georgia can do better than Marjorie Taylor Greene",
    "sentiment": "-0.413"
  },
  {
    "id": 7590,
    "mediaId": 65,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Last year, California Republican gubernatorial candidate Larry Elder was called the \"Black face of White supremacy\" in a Los Angeles Times column, and last month, far-left The Nation correspondent Elie Mystal wrote Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span> was \"an animated caricature of a Black person drawn by white conservatives The Walker campaign exists as a political minstrel show: a splashy rendition of what white Republicans think Black people look and sound like.\"",
    "author": "David Rutz",
    "title": "ABC's Sunny Hostin condemned by Black, Latino Republicans for disparaging remarks: 'That's racism right there'",
    "sentiment": "0.0"
  },
  {
    "id": 7484,
    "mediaId": 195,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Warnock is set to battle former University of Georgia football star <span class='selected-term'>Herschel Walker</span>, who has Trumps backing, while Abrams looks likely to face Kemp in a rematch of the 2018 gubernatorial election.",
    "author": "Rachel Scully",
    "title": "What time do polls close in Georgia, Texas?",
    "sentiment": "0"
  },
  {
    "id": 7308,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Of course, theres one win that Trump can count on Tuesday: former NFL star <span class='selected-term'>Herschel Walker</span>, whos seen as the heavy favorite to clinch the GOP nod to take on Sen. Raphael Warnock (D-Ga.) this fall.",
    "author": "Max Greenwood",
    "title": "Five things to watch in the Georgia, Alabama primaries",
    "sentiment": "0.0"
  },
  {
    "id": 7338,
    "mediaId": 25,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-f912f6e5</div>\n link copied\n5:40 PM\nGeorgia Senate Republican primary results\n<span class='selected-term'>Herschel Walker</span>, Gary Black, Kelvin King, Jonathan McColumn and Latham Saddler are running for the Republican nomination for U.S. Senate in Georgia.",
    "author": "",
    "title": "Primary results 2022: Georgia, Alabama, Arkansas, Texas runoff and Minnesota special election primary results",
    "sentiment": "0.0"
  },
  {
    "id": 7412,
    "mediaId": 233,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Rep. Marjorie Taylor Greenes primary race is also underway, along with the Senate contest between incumbent Rep. Raphael Warnock and football star <span class='selected-term'>Herschel Walker</span>.",
    "author": "David Jackson",
    "title": "Stacey Abrams wins gov primary; GA polls close; primaries also in Alabama, Ark., Texas: live updates",
    "sentiment": "0.0"
  },
  {
    "id": 7416,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Tal Axelrod\n<span class='selected-term'>Herschel Walker</span> clinches GOP Senate nomination in Georgia\n7:58 p.m.\nFormer NFL star Herschel Walker is projected to easily clinch the Republican Senate nomination in Georgia, securing his spot on the ballot to face off against Sen. Raphael Warnock (D-Ga.) in November.",
    "author": "",
    "title": "Live coverage: Polls close in Alabama, Texas",
    "sentiment": "0.891"
  },
  {
    "id": 7417,
    "mediaId": 18,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In a stark reminder of the issues divisiveness, Bidens call for gun measures was booed at a campaign event in Georgia hosted by <span class='selected-term'>Herschel Walker</span>, who won the Republican nomination for U.S. Senate.",
    "author": "Associated Press",
    "title": "Biden says we have to act after Texas school shooting",
    "sentiment": "0.0"
  },
  {
    "id": 7418,
    "mediaId": 18,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "OTHER DEVELOPMENTS:\nATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Arkansas Sanders mourns Texas victims",
    "sentiment": "-0.367"
  },
  {
    "id": 7420,
    "mediaId": 1546,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In a reminder of the issue's divisiveness, Biden's call for gun control on Tuesday was booed at a campaign event in Georgia hosted by <span class='selected-term'>Herschel Walker</span>, a Republican running for U.S. Senate.",
    "author": "Associated Press",
    "title": "Biden Says 'We Have to Act' After Texas School Shooting",
    "sentiment": "0"
  },
  {
    "id": 7421,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "1 hr ago 20:03 PM EDT\nTrump-backed Hershel Walker wins Senate Primary in Georgia\n<span class='selected-term'>Herschel Walker</span> will win the Georgia Republican primary for Senate.",
    "author": "Jake Thomas",
    "title": "Primary Live Updates: Sarah Huckabee Sanders Wins Arkansas Governor Primary",
    "sentiment": "0.936"
  },
  {
    "id": 7422,
    "mediaId": 409,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Early vote tallies have Kemp up by even larger margins than <span class='selected-term'>Herschel Walker</span>, who has already been called the winner of Georgias Senate primary against little-known opponents.",
    "author": "Dan McLaughlin",
    "title": "Brian Kemp Crushes David Perdue",
    "sentiment": "0"
  },
  {
    "id": 7428,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In the race for Senate in Georgia, former football star <span class='selected-term'>Herschel Walker</span> is expected to win the Republican primary, despite allegations of past violent behavior with women.",
    "author": "Isabel Martins",
    "title": "Primary Election Results for Georgia, Texas, Alabama and Other States",
    "sentiment": "-0.278"
  },
  {
    "id": 7435,
    "mediaId": 65,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "The most high-profile is former college and pro-football legend <span class='selected-term'>Herschel Walker</span>, who appears poised to easily capture the GOP nomination on his way to battling Democratic Sen. Raphael Warnock in a blockbuster general election showdown that could decide whether Republicans win back the Senate majority.",
    "author": "",
    "title": "Trump looms large over Tuesday primaries in Georgia, Alabama, Arkansas, and runoff in Texas",
    "sentiment": "0.481"
  },
  {
    "id": 7437,
    "mediaId": 223,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Also in Georgia, we'll be keeping an eye on the crowded GOP Senate primary in which Trump-endorsed former NFL player <span class='selected-term'>Herschel Walker</span> is expected to win his primary against Georgia Agriculture Commissioner Gary Black, former state Representative Josh Clark, and a hat-trick of American heroes: former Navy Seal Latham Saddler, U.S. Air Force veteran Kelvin King, and former U.S. Army Special Forces brigadier general Jonathan McColumn.",
    "author": "Spencer Brown",
    "title": "Here's What to Expect in the Texas Runoffs and Races in Georgia, Alabama, and Arkansas",
    "sentiment": "0.0"
  },
  {
    "id": 7438,
    "mediaId": 238,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Return to menu\n<span class='selected-term'>Herschel Walker</span>, the former pro football player-turned-businessman, is the front-runner in the Senate Republican primary in Georgia.",
    "author": "Mariana Alfaro",
    "title": "Primary elections live updates Big races are on the ballot in Georgia, Alabama, Arkansas and Texas",
    "sentiment": "-0.905"
  },
  {
    "id": 7459,
    "mediaId": 178,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In a stark reminder of the issue's divisiveness, Biden's call for gun measures was booed at a campaign event in Georgia hosted by <span class='selected-term'>Herschel Walker</span>, who won the Republican nomination for U.S. Senate.",
    "author": "ZEKE MILLER and CHRIS MEGERIAN Associated Press",
    "title": "Biden says 'we have to act' after Texas school shooting",
    "sentiment": "0.0"
  },
  {
    "id": 7472,
    "mediaId": 19,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "ET\nThe first votes are showing up in Georgias results, according to the New York Times, in the Senate GOP primary where <span class='selected-term'>Herschel Walker</span> has as expected taken a commanding lead out the gate.",
    "author": "Matthew Boyle",
    "title": "*** Election Night Livewire *** Georgia, Alabama, Texas, Arkansas, Minnesota Vote in Key Primaries",
    "sentiment": "0.0"
  },
  {
    "id": 7369,
    "mediaId": 65,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "To read more from Fox News' Kyle Morris, click here\nFormer football star <span class='selected-term'>Herschel Walker</span> won Georgia's Republican Senate primary Tuesday, as he seeks to unseat Sen. Raphael Warnock, D-Ga., in November.",
    "author": "Tyler Olson",
    "title": "Primary elections in Georgia, Alabama, runoff in Texas",
    "sentiment": "0.0"
  },
  {
    "id": 7380,
    "mediaId": 178,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "His preferred Senate candidate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won the GOP nomination despite warnings from Walker's Republican competitors about his history of domestic violence and mental health struggles.",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Trump rebuked with stinging losses in Georgia GOP contests",
    "sentiment": "0.0"
  },
  {
    "id": 7388,
    "mediaId": 943,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "In a stark reminder of the issues divisiveness, Bidens call for gun measures was booed at a campaign event in Georgia hosted by <span class='selected-term'>Herschel Walker</span>, who won the Republican nomination for U.S. Senate.",
    "author": "ZEKE MILLER and CHRIS MEGERIAN",
    "title": "President Biden delivers emotional plea for new gun restrictions after Texas school shooting",
    "sentiment": "0.0"
  },
  {
    "id": 7405,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "In a stark reminder of the issues divisiveness, Bidens call for gun measures was booed at a campaign event in Georgia hosted by <span class='selected-term'>Herschel Walker</span>, who won the Republican nomination for U.S. Senate.",
    "author": "Associated Press",
    "title": "Biden says we have to act after Texas school shooting",
    "sentiment": "0"
  },
  {
    "id": 8404,
    "mediaId": 376,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "Shop talk: Stephen Lawson\nLawson, CEO of Battleground Strategies, served as deputy campaign manager for former GOP Sen. Kelly Loeffler of Georgia in 2020 and currently is spokesman for a SuperPAC supporting this years nominee, <span class='selected-term'>Herschel Walker</span>, who faces Democratic Sen. Raphael Warnock.",
    "author": "Kate Ackley\nMary Ellen McIntire\nStephanie Akin",
    "title": "At the Races: Divisions on display",
    "sentiment": "0.0"
  },
  {
    "id": 8588,
    "mediaId": 238,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "The beneficiaries of the couples political contributions include at least one candidate who emerged victorious in Tuesdays primary contests, <span class='selected-term'>Herschel Walker</span>.",
    "author": "Isaac Stanley-Becker",
    "title": "Maker of rifle in Texas massacre is deep-pocketed GOP donor",
    "sentiment": "0"
  },
  {
    "id": 8478,
    "mediaId": 195,
    "date": "5/29/2022 12:00:00 AM",
    "sentence": "Trumps pick for U.S. Senate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won his primary on Tuesday, as did other Trump allies including his former press secretary, Sarah Huckabee Sanders, in the Arkansas gubernatorial race.",
    "author": "",
    "title": "What 2022s primary results tell us about both parties",
    "sentiment": "0.772"
  },
  {
    "id": 8575,
    "mediaId": 223,
    "date": "5/29/2022 12:00:00 AM",
    "sentence": "https://t.co/ekVgWmaEkM\n The Washington Post (@washingtonpost) May 27, 2022\nThe beneficiaries of the couples contributions include <span class='selected-term'>Herschel Walker</span>, who emerged victorious in Tuesdays primaries.",
    "author": "Rebecca Downs",
    "title": "Another Day, Another Bad Take From WaPo on Uvalde Shooting",
    "sentiment": "0.405"
  }
]