[
  {
    "id": 3550,
    "mediaId": 136,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Parkland father Fred Guttenberg said this week that he believed that Republican politicians, including Florida Governor <span class='selected-term'>Ron DeSantis</span>, bear some responsibility for Saturday's massacre at a Buffalo grocery store that is being investigated as a hate crime.",
    "author": "Khaleda Rahman",
    "title": "Parkland Father Blames Ron DeSantis, Other Republicans for Buffalo Shooting"
  },
  {
    "id": 3551,
    "mediaId": 169,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "Jon Skolnik",
    "title": "Doubling down on \"great replacement\" paranoia: How the right is reacting to the Buffalo shooting"
  },
  {
    "id": 3505,
    "mediaId": 305,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Through political figures like Congresswoman Elise Stefanik and Governor <span class='selected-term'>Ron DeSantis</span>.",
    "author": "",
    "title": "Fire Tucker Carlson, Ben Shapiro and All Other Racists Who Promote \"White Replacement Theory\""
  },
  {
    "id": 3466,
    "mediaId": 151,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Tech companies removed the Buffalo shooting manifesto. A Texas law could make that illegal."
  },
  {
    "id": 3472,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Taylor Penley",
    "title": "Nikole Hannah-Jones, others advocate for critical race theory in wake of Buffalo shooting"
  },
  {
    "id": 7280,
    "mediaId": 178,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "While <span class='selected-term'>Ron DeSantis</span> and Greg Abbott, the governors of Florida and Texas, say they want to protect conservative points of view from liberal tech executives, the laws' texts seem to prohibit tech companies from removing or down-ranking all kinds of content that has nothing to do with electoral politics.",
    "author": "Farhad Manjoo New York Times",
    "title": "Bad ideas for fixing the internet have gone viral"
  }
]