[
  {
    "id": 6199,
    "mediaId": 302,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "The political marriage of Donald Trump and <span class='selected-term'>Ron DeSantis</span>, never passionate but for a time mutually convenient, is all but over.",
    "author": "Jim Verhulst",
    "title": "Heres what to read from the left and the right | Column"
  },
  {
    "id": 4399,
    "mediaId": 238,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Perhaps the only person who triggers progressives as much as Elon Musk these days is <span class='selected-term'>Ron DeSantis</span>.",
    "author": "",
    "title": "Opinion DeSantis shows the way forward for Trumpism without Trump"
  },
  {
    "id": 4432,
    "mediaId": 124,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Elon Musks uneasy relationship with the left explodes over Twitter takeover"
  },
  {
    "id": 4333,
    "mediaId": 124,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Elon Musks no good, very bad meme shows how out of touch he is with political reality"
  },
  {
    "id": 4347,
    "mediaId": 19,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Ron DeSantis: Leftists Freaking Out over Elon Musk Purchase Because They Used Twitter to Enforce the Narrative"
  },
  {
    "id": 4351,
    "mediaId": 19,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "James P. Pinkerton",
    "title": "Pinkerton: Seeking the Right Strategy for Big Tech Beyond Elon Musk"
  },
  {
    "id": 4256,
    "mediaId": 19,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Hes not going to allow Chris Christie or <span class='selected-term'>Ron DeSantis</span> or anyone else define the future of the Republican Party.",
    "author": "Wendell Husebø",
    "title": "Report: Bidens Advisers Weigh Making Midterms About Trump Again"
  },
  {
    "id": 4264,
    "mediaId": 19,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Ron DeSantis on Chatter of Twitter Moving to Florida: Im Not Advocating for a San Fran Tech Company Moving Here"
  },
  {
    "id": 4036,
    "mediaId": 675,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "Larry Elder",
    "title": "The conservative surge in Twitter followers  the Elon Musk effect?"
  },
  {
    "id": 4078,
    "mediaId": 21,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Florida Governor <span class='selected-term'>Ron DeSantis</span> discouraged Twitter from bringing its headquarters to the state following Elon Musk's privatization of the platform, Jacksonville outlet News4JAX reported.",
    "author": "Taiyler Simone Mitchell",
    "title": "DeSantis takes a dig at Twitter as lawmakers encourage Elon Musk to move HQ to Florida: 'Importing some tech company from San Francisco has not been high on our list'"
  },
  {
    "id": 3976,
    "mediaId": 223,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Governor <span class='selected-term'>Ron DeSantis</span> recently gave a speech where he declared that \"the student debt that is out there, almost 60% of it is graduate school debt.\"",
    "author": "Brad Slager",
    "title": "Fact-Checker's Own Website Proves DeSantis Accurate in 'Mostly False' Entry"
  },
  {
    "id": 4000,
    "mediaId": 237,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Nihal Krishan",
    "title": "Conservatives eager to see return of political ads on Twitter under Musk"
  },
  {
    "id": 4005,
    "mediaId": 223,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Larry Elder",
    "title": "The Conservative Surge in Twitter Followers -- The Elon Musk Effect?"
  },
  {
    "id": 3882,
    "mediaId": 136,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "Colorado Governor Jared Polis has compared Florida Governor <span class='selected-term'>Ron DeSantis</span>' actions to Russian President Vladimir Putin as he pitches his state as a new home for the Walt Disney Company's Florida theme parks.",
    "author": "Darragh Roche",
    "title": "Colorado Governor Uses Putin Comparison in Pitch to Disney"
  },
  {
    "id": 3883,
    "mediaId": 237,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "",
    "author": "Washington Examiner Staff",
    "title": "'Ultra-MAGA agenda': Quotes of the Week"
  },
  {
    "id": 3632,
    "mediaId": 129,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "Even if you would never consider voting for him, its important to understand the sources of his appeal and the direction of his politics, because one way or the other  whether he ever runs for president or not  <span class='selected-term'>Ron DeSantis</span> is the new Republican Party.",
    "author": "",
    "title": "Republicans Need a New Leader. Theyre Looking to Florida."
  },
  {
    "id": 3558,
    "mediaId": 223,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "Scott Morefield",
    "title": "The Five Most Important Americans Alive Right Now, And The Missing Elephant In The Room"
  },
  {
    "id": 3466,
    "mediaId": 151,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Tech companies removed the Buffalo shooting manifesto. A Texas law could make that illegal."
  }
]