[
  {
    "id": 7045,
    "mediaId": 65,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Pennsylvania Republicans to draft bill to relocate migrants on Biden DHS flights to Delaware"
  },
  {
    "id": 7032,
    "mediaId": 675,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "WND News Services",
    "title": "The mystery of the migrant kids"
  },
  {
    "id": 7018,
    "mediaId": 124,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "In Ukraine, Biden faces a crisis with little political benefit back home"
  },
  {
    "id": 6296,
    "mediaId": 376,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "John T. Bennett",
    "title": "You always have to talk about health: Trump shows his first card in close-held 2024 hand"
  },
  {
    "id": 5061,
    "mediaId": 223,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The Strike Force includes Governors Kay Ivey (AL), Mike Dunleavy (AK), Asa Hutchinson (AR), <span class='selected-term'>Ron DeSantis</span> (FL), Brian Kemp (GA), Brad Little (ID), Eric Holcomb (IN), Kim Reynolds (IA), Larry Hogan (MD), Tate Reeves (MS), Mike Parson (MO), Greg Gianforte (MT), Pete Ricketts (NE), Chris Sununu (NH), Doug Burgum (ND), Mike DeWine (OH), Kevin Stitt (OK), Henry McMaster (SC), Kristi Noem (SD), Bill Lee (TN), Spencer Cox (UT), Glenn Youngkin (VA), Jim Justice (WV), and Mark Gordon (WY).",
    "author": "Spencer Brown",
    "title": "GOP Governors Launch 'Strike Force' to Combat Biden Border Crisis"
  },
  {
    "id": 5066,
    "mediaId": 19,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "The pact is signed by the following governors:\nGovernors Doug Ducey (AZ), Greg Abbott (TX), Kay Ivey (AL), Mike Dunleavy (AK), Asa Hutchinson (AR), <span class='selected-term'>Ron DeSantis</span> (FL), Brian Kemp (GA), Brad Little (ID), Eric Holcomb (IN), Kim Reynolds (IA), Larry Hogan (MD), Tate Reeves (MS), Mike Parson (MO), Greg Gianforte (MT), Pete Ricketts (NE), Chris Sununu (NH), Doug Burgum (ND), Mike DeWine (OH), Kevin Stitt (OK), Henry McMaster (SC), Kristi Noem (SD), Bill Lee (TN), Spencer Cox (UT), Glenn Youngkin (VA), Jim Justice (WV), and Mark Gordon (WY).",
    "author": "Bob Price",
    "title": "26 Governors Mobilize Against Migration Chaos at Border"
  },
  {
    "id": 6199,
    "mediaId": 302,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "The political marriage of Donald Trump and <span class='selected-term'>Ron DeSantis</span>, never passionate but for a time mutually convenient, is all but over.",
    "author": "Jim Verhulst",
    "title": "Heres what to read from the left and the right | Column"
  },
  {
    "id": 4948,
    "mediaId": 63,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "",
    "author": "Mason Bissada",
    "title": "Florida Gov. DeSantis Signs Bill To Form Election Police Force"
  },
  {
    "id": 6145,
    "mediaId": 124,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "'Mean,' 'circus': Some undecided Pa. GOP voters disappointed by Senate debate"
  },
  {
    "id": 4914,
    "mediaId": 43,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "\"Try to Think What We Are Going to Do Ourselves\""
  },
  {
    "id": 4356,
    "mediaId": 223,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/fSnU2gk97x\n <span class='selected-term'>Ron DeSantis</span> (@GovRonDeSantis) April 29, 2022\nDuring a Friday press conference, DeSantis pointed out that the board seemed more suited as an April Fool's joke.",
    "author": "Rebecca Downs",
    "title": "Gov. Ron DeSantis Leading the Way on Speaking Out on Another Issue: Disinformation"
  },
  {
    "id": 4363,
    "mediaId": 112,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Robert Schroeder",
    "title": "Trump-backed Senate hopeful Vance tied in polls ahead of Ohio primary seen as key test for ex-president"
  },
  {
    "id": 4369,
    "mediaId": 63,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Madeline Halpert",
    "title": "Biden May Cancel At Least $10,000 Of Student Loan Debt For Some Individuals, Report Says"
  },
  {
    "id": 4374,
    "mediaId": 21,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kimberly Leonard",
    "title": "Gov. Ron DeSantis ranted about Biden's potential plan to forgive student debt for degrees such as gender and 'zombie studies'"
  },
  {
    "id": 4375,
    "mediaId": 238,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "The Florida law was effective at ginning up attention for that states governor, <span class='selected-term'>Ron DeSantis</span> (R), and the discussion has been accompanied by a backlash against visibility for same-sex couples.",
    "author": "",
    "title": "American parents are generally fine with whats being taught in school"
  },
  {
    "id": 4378,
    "mediaId": 593,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "When Florida Governor <span class='selected-term'>Ron DeSantis</span> signed the Parental Rights in Education bill into law on March 28, Disney issued a statement saying it \"should never have passed\" and said that it should be repealed.",
    "author": "Dawn Chmielewski and Lisa Richwine",
    "title": "Disney's Corporate Affairs Head, Morrell, To Leave Company"
  },
  {
    "id": 4382,
    "mediaId": 675,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/fSnU2gk97x\n <span class='selected-term'>Ron DeSantis</span> (@GovRonDeSantis) April 29, 2022\nYou cannot have a Ministry of Truth in this country.",
    "author": "WND News Services",
    "title": "DeSantis declares war on Biden's 'Ministry of Truth'"
  },
  {
    "id": 4383,
    "mediaId": 65,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "INGRAHAM: <span class='selected-term'>RON DESANTIS</span> HAS TAKEN ON THE LEFT MORE AGGRESSIVELY THAN ANY GOVERNOR IN MODERN MEMORY\nDeSantis added that his administration believes parents have a \"fundamental role\" in their childrens upbringing and education while Biden and his administration believe parents should \"butt out\" so schools can indoctrinate \"what they think your kid should learn or believe.\"",
    "author": "Nikolas Lanum",
    "title": "DeSantis hits back at Biden's book burning comment: We want education, not indoctrination"
  },
  {
    "id": 4393,
    "mediaId": 65,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Lynne Jordal Martin",
    "title": "What Joe knew about Hunter, say 'no' to college and more Fox News Opinion"
  },
  {
    "id": 4394,
    "mediaId": 151,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "But after the driest-ever start to the year in California history, conditions today are far more critical than theyve ever been, officials said.?\nHE SAID, HE SAID  <span class='selected-term'>Ron DeSantis</span> feud with Gavin Newsom ramps up amid San Francisco dumpster fire insult,? by the SF Chronicles Sophia Bollag: DeSantis made the comments several days after Newsom criticized him on Twitter for punishing Disney over its opposition to Floridas new law banning discussion of sexual orientation in early grades.?\n Bias, far-right sympathies among California law enforcement going unchecked, audit finds,? by the LA Times Kevin Rector: In California, a recent Times investigation found that police agencies across the state upheld just 49 racial profiling complaints from 2016 to 2019, or less than 2% of the roughly 3,500 allegations filed.?\n Debate Heats Up Over Effort to Pilot Safe Injection Sites in California,? by KQEDs Lesley McClurg: The last time supervised injection facilities were on the table in California, in 2018, a bill progressed all the way to Governor Jerry Browns desk.",
    "author": "",
    "title": "What Californias massive budget surplus could mean"
  },
  {
    "id": 4395,
    "mediaId": 65,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Florida Governor <span class='selected-term'>Ron DeSantis</span> press secretary also weighed in on the video: \"I mean, she wrote a whole book based on the premise that you can be a CIA agent and also ~marginalized~ at the same time so shes the perfect censor kween for the Biden regime,\" Christina Pushaw wrote.",
    "author": "Nikolas Lanum",
    "title": "Twitter users shocked by ridiculous TikTok of new disinformation czar singing: God help us"
  },
  {
    "id": 4399,
    "mediaId": 238,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Perhaps the only person who triggers progressives as much as Elon Musk these days is <span class='selected-term'>Ron DeSantis</span>.",
    "author": "",
    "title": "Opinion DeSantis shows the way forward for Trumpism without Trump"
  },
  {
    "id": 4400,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Dennis Aftergut",
    "title": "Is Trump asking Putin for favors again?"
  },
  {
    "id": 4417,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Alexis Simendinger",
    "title": "The Hills Morning Report  Biden economic troubles mount"
  },
  {
    "id": 4431,
    "mediaId": 65,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Continue reading \nLAURA INGRAHAM  The Fox host showcased <span class='selected-term'>Ron DeSantis</span>' leadership when it comes to improving Florida in the face of a media onslaught.",
    "author": "",
    "title": "Biden student debt cancellation may worsen inflation; US Marine vet dies fighting alongside Ukrainians"
  },
  {
    "id": 4442,
    "mediaId": 65,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Fox News Staff",
    "title": "DeSantis warns Biden: If you caravan illegal migrants to Florida, we'll reroute them to Delaware"
  },
  {
    "id": 4444,
    "mediaId": 65,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Fox News Staff",
    "title": "Ingraham: DeSantis has embraced policies that once seemed unthinkable"
  },
  {
    "id": 6094,
    "mediaId": 43,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Another stupid stunt (actually rescues DeSantis)\nx\nBREAKING: Disney hits back HARD at <span class='selected-term'>Ron DeSantis</span> and the GOP  says that Florida can't legally dissolve its self-governing district unless the state pays off the district's $1 billion debts due to a pledge in the original 1967 law.",
    "author": "",
    "title": "Good News Roundup for Friday, April 29, 2022: Hope vs. Hopelessness"
  },
  {
    "id": 4327,
    "mediaId": 18,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "Joe Battenfeld",
    "title": "Battenfeld: Bidens Ministry of Truth sparks mockery, fears"
  },
  {
    "id": 4329,
    "mediaId": 223,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "Rebecca Downs",
    "title": "Buried in POLITICO Report is Mention of How Biography on Jill Biden Fared, and the Numbers Are Catastrophic"
  },
  {
    "id": 4331,
    "mediaId": 63,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "Anna Kaplan",
    "title": "White House Said To Eye Income Caps For Student Loan Forgiveness"
  },
  {
    "id": 4334,
    "mediaId": 65,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kelly Laco",
    "title": "Free speech concerns mount over DHS 'disinformation' board as lawmakers, critics weigh in"
  },
  {
    "id": 4335,
    "mediaId": 302,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The Lightning, Charlie Crist and a former surgeon general make the weeks highs and lows"
  },
  {
    "id": 4347,
    "mediaId": 19,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Ron DeSantis: Leftists Freaking Out over Elon Musk Purchase Because They Used Twitter to Enforce the Narrative"
  },
  {
    "id": 4348,
    "mediaId": 19,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "Charlie Spiering",
    "title": "Joe Biden Jokes About Disney, Some Guy Named Brandon, and Donald Trump at White House Correspondents Dinner"
  },
  {
    "id": 4351,
    "mediaId": 19,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "James P. Pinkerton",
    "title": "Pinkerton: Seeking the Right Strategy for Big Tech Beyond Elon Musk"
  },
  {
    "id": 4283,
    "mediaId": 136,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "GOP Florida Governor <span class='selected-term'>Ron DeSantis</span> is also a potential nominee for the 2024 race as his popularity continues to grow among his own party despite his recent law restricting LGBTQ rights and his ongoing feud with Disney.",
    "author": "Fatma Khaled",
    "title": "Trump 'Should Not Define Our Future': GOP's Asa Hutchinson Weighs 2024 Bid"
  },
  {
    "id": 4289,
    "mediaId": 593,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Thats why <span class='selected-term'>Ron DeSantis</span> is one step ahead.",
    "author": "Cortney Drakeford",
    "title": "VIDEO: Trevor Noah Goes Off At White House Correspondents Dinner, 5 Best Jokes From His Set"
  },
  {
    "id": 4292,
    "mediaId": 163,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Other potential Republican contenders in 2024 include Florida Governor <span class='selected-term'>Ron DeSantis</span>, former Vice President Mike Pence and former Secretary of State Mike Pompeo.",
    "author": "Doina Chiacu",
    "title": "Republican Hutchinson, at odds with Trump, eyes 2024 U.S. presidential run"
  },
  {
    "id": 4293,
    "mediaId": 195,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "Joe Concha",
    "title": "Joe Bidens Ministry of Truth"
  },
  {
    "id": 4298,
    "mediaId": 593,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Other potential Republican contenders in 2024 include Florida Governor <span class='selected-term'>Ron DeSantis</span>, former Vice President Mike Pence and former Secretary of State Mike Pompeo.",
    "author": "Doina Chiacu",
    "title": "Republican Hutchinson, At Odds With Trump, Eyes 2024 U.S. Presidential Run"
  },
  {
    "id": 4308,
    "mediaId": 136,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "He also ridiculed CNN, Chris Cuomo, MSNBC, Florida Governor <span class='selected-term'>Ron DeSantis</span>, Texas Governor Greg Abbott, Republicans in general, newsmaking Democrats in general and, well, pretty much everyone he could within an allotted time frame.",
    "author": "Scott McDonald",
    "title": "Trevor Noah Bashes Biden, Dems, Media and GOP: Here's Everything He Said"
  },
  {
    "id": 4309,
    "mediaId": 151,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Thats why <span class='selected-term'>Ron DeSantis</span> is one step ahead  first you ban the math textbooks, then nobody knows how to count the votes.",
    "author": "",
    "title": "Trevor Noah's best jokes at the WHCD"
  },
  {
    "id": 4310,
    "mediaId": 195,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Thats why <span class='selected-term'>Ron DeSantis</span> is one step ahead: First, you ban the math textbooks.",
    "author": "Judy Kurtz",
    "title": "Trevor Noah roasts lawmakers on both sides of aisle in correspondents dinner remarks"
  },
  {
    "id": 4315,
    "mediaId": 234,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "He went on to skewer FOX anchors; former CNN host Chris Cuomo; anything to do with CNN +, which shuttered within a month of its launch; and Floridas Governor <span class='selected-term'>Ron DeSantis</span>.",
    "author": "Terry Moseley",
    "title": "The Nations Most Distinguished Superspreader Event: The White House Correspondents Dinner Returns"
  },
  {
    "id": 4319,
    "mediaId": 33,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "Devan Cole",
    "title": "Arkansas GOP governor says he's considering 2024 bid and would run even if Trump does"
  },
  {
    "id": 4320,
    "mediaId": 129,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Jokes, Glamour and a Try for Normalcy as Correspondents Dinner Returns"
  },
  {
    "id": 4323,
    "mediaId": 43,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "What if I make a really mean joke about Kellyanne Conway and her husband rushes up on the stage and thanks me??\nWhat I like about <span class='selected-term'>Ron DeSantis</span> is if Trump was the original Terminator, DeSantis is like the T-1000.",
    "author": "",
    "title": "Trevor Noah is still trending day after White House correspondents' dinner, as he should be"
  },
  {
    "id": 4324,
    "mediaId": 43,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Excerpts From Trevor Noah's Speech:\n\"[<span class='selected-term'>Ron DeSantis</span> has] been so busy trying to outmaneuver Trump for 2024.",
    "author": "",
    "title": "The Condensed White House Correspondent's Dinner Remarks About Fox News and Crybaby Trump"
  },
  {
    "id": 4194,
    "mediaId": 65,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kelly Laco",
    "title": "DeSantis accuses Disney of cozying up to CCP, making 'a fortune' without mentioning atrocities"
  },
  {
    "id": 4195,
    "mediaId": 233,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Merdie Nzanga",
    "title": "Gov. Ron DeSantis says he hopes to flip Florida to a solid red state with his reelection"
  },
  {
    "id": 4199,
    "mediaId": 195,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Noah added, What I like about <span class='selected-term'>Ron DeSantis</span> is, if Trump was the original Terminator, DeSantis is the T-1000.",
    "author": "Sarakshi Rai",
    "title": "DeSantis trashes correspondents dinner after roasting from Trevor Noah"
  },
  {
    "id": 4210,
    "mediaId": 223,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Lifetime Subscriber to CNN+ (@MartiniShark) May 1, 2022\nArtisanally-Crafted Narrative  MIAMI HERALD\nOne of the not-surprising segments of the night was Trevor Noah using the event to scorch the media's new favorite target, Florida Governor <span class='selected-term'>Ron DeSantis</span>.",
    "author": "Brad Slager",
    "title": "Dispatches from the Journo Cotillion Show They Have Learned Little of Their Demise"
  },
  {
    "id": 4220,
    "mediaId": 195,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "And a <span class='selected-term'>Ron DeSantis</span>-Tim Scott ticket could be a combination Trump cant beat.",
    "author": "Keith Naughton",
    "title": "Ron DeSantis and Tim Scott are the ticket to beat Trump"
  },
  {
    "id": 4232,
    "mediaId": 238,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion All jokes aside: Biden grasps what the medias obligation should be"
  },
  {
    "id": 4248,
    "mediaId": 223,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Or do you have faith in the proven leadership of Donald Trump, Florida Governor <span class='selected-term'>Ron DeSantis</span>, Virginia Governor Glenn Youngkin and dozens of other Republicans who stand ready to swing the pendulum of America back to sanity in 2022.",
    "author": "Tom Tradup",
    "title": "Democrats Gleefully Bankrupting America"
  },
  {
    "id": 4256,
    "mediaId": 19,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Hes not going to allow Chris Christie or <span class='selected-term'>Ron DeSantis</span> or anyone else define the future of the Republican Party.",
    "author": "Wendell Husebø",
    "title": "Report: Bidens Advisers Weigh Making Midterms About Trump Again"
  },
  {
    "id": 4269,
    "mediaId": 195,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Rising: May 2, 2022"
  },
  {
    "id": 4124,
    "mediaId": 65,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "Joshua Q. Nelson",
    "title": "Somali-born Air Force veteran says Biden's Afghanistan withdrawal sparked her run for Congress"
  },
  {
    "id": 4143,
    "mediaId": 129,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "Tension between businesses and politicians may intensify\nDisneys recent battles with <span class='selected-term'>Ron DeSantis</span>, Floridas Republican governor, over a law prohibiting discussion of gender identity in some public schools cost the company its special tax privileges and good will from key Republicans.",
    "author": "",
    "title": "Supreme Court Live Updates: Supreme Court Confirms Leaked Opinion But Says the Draft Is Not a Final Decision"
  },
  {
    "id": 4146,
    "mediaId": 151,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "| Joe Raedle/Getty Images\nBy Matt Dixon\n 05/03/2022 04:31 AM EDT\nTALLAHASSEE, Fla.  Florida Democrats are increasingly worried that the candidates trying to unseat <span class='selected-term'>Ron DeSantis</span> cant stop the popular Republican governor from winning re-election as the GOP solidifies its hold on the states political infrastructure.",
    "author": "",
    "title": "DeSantis seems unstoppable: Florida Dems worry they cant beat the governor"
  },
  {
    "id": 4154,
    "mediaId": 718,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "Jesse Jackson",
    "title": "Gun violence rises as access to guns rises"
  },
  {
    "id": 4044,
    "mediaId": 65,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kelly Laco",
    "title": "FL judge says Biden border policies merely a speedbump for migrants as catch-and-release lawsuit advances"
  },
  {
    "id": 4045,
    "mediaId": 237,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "Haisten Willis",
    "title": "White House accuses 'MAGA' Republicans of waging war on Mickey Mouse"
  },
  {
    "id": 4046,
    "mediaId": 65,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "Fox News Staff",
    "title": "Mark Penn on 'Kilmeade Show': Ron DeSantis 'significantly ahead' for 2024 if Trump doesn't run"
  },
  {
    "id": 4050,
    "mediaId": 65,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "\"Spanish-speaking Hispanics in Florida and across the country are moving towards Governor <span class='selected-term'>Ron DeSantis</span> because of his emphasis on economic opportunity, education, public safety, and other family-focused policies,\" the campaign argued.",
    "author": "Paul Steinhauser",
    "title": "Florida's DeSantis announces massive initial ad reservation with focus on Hispanic voters, in re-election run"
  },
  {
    "id": 4053,
    "mediaId": 195,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kristin Tate",
    "title": "Trump is Democrats only hope in 2024"
  },
  {
    "id": 4084,
    "mediaId": 187,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Look at Governor <span class='selected-term'>Ron DeSantis</span> in Florida.",
    "author": "David Frum",
    "title": "Biden Just Walked Into a Student-Debt Trap"
  },
  {
    "id": 3975,
    "mediaId": 65,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kelly Laco",
    "title": "Lawsuit filed against Biden, top officials for 'colluding' with Big Tech to censor speech on Hunter, COVID"
  },
  {
    "id": 3979,
    "mediaId": 65,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hanna Panreck",
    "title": "Kamala Harris slammed over report she refused to appear in student debt video with Biden: Team player"
  },
  {
    "id": 3992,
    "mediaId": 237,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Paul Bedard",
    "title": "2024 Shock: Biden 36%, Trump 50%"
  },
  {
    "id": 4005,
    "mediaId": 223,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Larry Elder",
    "title": "The Conservative Surge in Twitter Followers -- The Elon Musk Effect?"
  },
  {
    "id": 4024,
    "mediaId": 19,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "John Nolte",
    "title": "Nolte: Rematch Poll Shows Trump Defeating Biden by 14 Points"
  },
  {
    "id": 3901,
    "mediaId": 21,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kimberly Leonard",
    "title": "Ron DeSantis signs $1.2 billion in tax breaks for Floridians to fight 'Bidenflation headwinds,' though Biden's stimulus will help pay for it"
  },
  {
    "id": 3906,
    "mediaId": 65,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ron DeSantis",
    "title": "DeSantis signs $1.2B tax-break package targeting gas, diapers, kids' clothing"
  },
  {
    "id": 3921,
    "mediaId": 302,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Jobless claims remain low amid DeSantis warnings"
  },
  {
    "id": 3931,
    "mediaId": 151,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "In Hialeah, Rebecca Brady, a mother of four and director of the Respect Life Ministry of the Archdiocese of Miami, said she has been trying to maintain a cautious optimism since she learned of the draft Supreme Court opinion overturning Roe v. Wade that Politico leaked Monday night.?\nBANNED  <span class='selected-term'>Ron DeSantis</span> is persona non grata at a Holocaust Memorial,? Wall Street Journals Elliott Abrams and Eric Cohen: A remarkable Jewish renaissance is under way in Florida.",
    "author": "",
    "title": "DeSantis scrutinizes health care costs for the undocumented"
  },
  {
    "id": 3942,
    "mediaId": 238,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "A pair of Four-Pinocchio abortion claims"
  },
  {
    "id": 3944,
    "mediaId": 223,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "View Cartoon\nMickey Mouse fell for the trap laid out by Governor <span class='selected-term'>Ron DeSantis</span> and Florida Republicans, as woke Disney had its special tax status removed after opposing popular legislation stopping the indoctrination of Americas children.",
    "author": "Townhall.com Staff",
    "title": "Leftist Abortion Cult Goes Nuclear"
  },
  {
    "id": 3955,
    "mediaId": 19,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Florida: Ron DeSantis Signs $1.2 Billion Tax Relief Package"
  },
  {
    "id": 3956,
    "mediaId": 19,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "DeSantis Administration Makes Baby Items Like Diapers Tax Free for a Year"
  },
  {
    "id": 3883,
    "mediaId": 237,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "",
    "author": "Washington Examiner Staff",
    "title": "'Ultra-MAGA agenda': Quotes of the Week"
  },
  {
    "id": 3891,
    "mediaId": 209,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "",
    "author": "Brigid Kennedy",
    "title": "Texas Gov. Greg Abbott has a controversial plan for the southern border. Is it working?"
  },
  {
    "id": 3831,
    "mediaId": 195,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "",
    "author": "Juan Williams",
    "title": "Juan Williams: Biden is right to call out GOP as extreme on abortion"
  },
  {
    "id": 3780,
    "mediaId": 238,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Emboldened by wins, GOP goes all in on the culture wars"
  },
  {
    "id": 3784,
    "mediaId": 136,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Democrats Want to Raise Your Kids. Republicans Fight for Parental Rights | Opinion"
  },
  {
    "id": 3796,
    "mediaId": 19,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "FL Gov. Ron DeSantis Designates Nov. 7 Victims of Communism Day, Slams Bidens Disinformation Board"
  },
  {
    "id": 3799,
    "mediaId": 19,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "",
    "author": "Jordan Dixon-Hamilton",
    "title": "Louisiana and Missouri Sue Biden for Colluding with Big Tech to Censor Conservatives"
  },
  {
    "id": 3689,
    "mediaId": 238,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "Henry Olsen",
    "title": "Opinion A Trump endorsement is powerful. But clearly not insurmountable."
  },
  {
    "id": 3723,
    "mediaId": 65,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Tucker: Karine Jean-Pierre is furious at America, despite her ample privilege"
  },
  {
    "id": 3747,
    "mediaId": 129,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "A good example is Floridas governor, <span class='selected-term'>Ron DeSantis</span>, a Republican who last week signed a $1.2 billion tax cut that he said was the largest in state history and would fight inflationary policies imposed on us by the Biden administration.? But a state tax cut, just like a federal spending increase, puts money into consumers pockets.",
    "author": "",
    "title": "Ron DeSantis Is Being Incoherent on Inflation"
  },
  {
    "id": 3753,
    "mediaId": 234,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Per The Guardian:\nDiscussions of gender identity and sexual preference are banned in many Florida classrooms because of governor <span class='selected-term'>Ron DeSantis</span>s dont say gay? law, alongside dozens of math textbooks blocked for prohibited topics.? Now the Republican who has loudly condemned what he sees as the indoctrination? of young people has made another subject compulsory: students must receive at least 45 minutes instruction every November about the victims of communism.?\nIn a ceremony Monday at Miamis iconic Freedom Tower, where tens of thousands of Cuban immigrants fleeing Fidel Castros revolution were admitted into the US between 1962 and 1974, DeSantis signed into law House Bill 395, designating 7 November as Victims of Communism Day.",
    "author": "Bess Levin",
    "title": "Senator Ron Johnson Tells Pregnant People to Suck It Up and Go Out of State for an Abortion If They Want One"
  },
  {
    "id": 3632,
    "mediaId": 129,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "Even if you would never consider voting for him, its important to understand the sources of his appeal and the direction of his politics, because one way or the other  whether he ever runs for president or not  <span class='selected-term'>Ron DeSantis</span> is the new Republican Party.",
    "author": "",
    "title": "Republicans Need a New Leader. Theyre Looking to Florida."
  },
  {
    "id": 3645,
    "mediaId": 136,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "The donations for the record-breaking month included nearly $2.3 million raised by the governor's election campaign team, and $8.2 million from his political committee, Friends of <span class='selected-term'>Ron DeSantis</span>.",
    "author": "Ewan Palmer",
    "title": "How Ron DeSantis' Fundraising Compares to Donald Trump"
  },
  {
    "id": 3658,
    "mediaId": 151,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "'The great MAGA king': Biden sharpens midterm attacks"
  },
  {
    "id": 3604,
    "mediaId": 147,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "You could be looking  there are any number of scenarios, but you could be looking at a match, say, between the Florida governor, <span class='selected-term'>Ron DeSantis</span>, and, say, Elizabeth Warren of Massachusetts.",
    "author": "PBS NewsHour",
    "title": "Former presidential adviser David Gergen discusses leadership and the next generation"
  },
  {
    "id": 3620,
    "mediaId": 19,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Poll: Donald Trump Maintains Majority Support as Partys Frontrunner"
  },
  {
    "id": 3629,
    "mediaId": 19,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": " <span class='selected-term'>Ron DeSantis</span> (@GovRonDeSantis) May 12, 2022\nHis remarks follow news of President Biden canceling oil and gas lease sales in both Alaska and the Gulf of Mexico as Americans continue to feel the pain in their pockets at the gas pump under Bidens leadership.",
    "author": "Hannah Bleau",
    "title": "Ron DeSantis: Joe Bidens Actions Show He Doesnt Care About Rising Gas Prices"
  },
  {
    "id": 3445,
    "mediaId": 238,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "Mariana Alfaro",
    "title": "Midterm primaries live updates Voters to pick key nominees in Pa., N.C., three other states"
  },
  {
    "id": 3586,
    "mediaId": 238,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Key issues"
  },
  {
    "id": 3431,
    "mediaId": 129,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "He said that he had been told before that he was the <span class='selected-term'>Ron DeSantis</span> before Ron DeSantis.",
    "author": "",
    "title": "Republican Chaos' in Pennsylvania Threatens to Upend the Midterms"
  },
  {
    "id": 3538,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "Michelle Boorstein",
    "title": "Christian nationalism is shaping a Pa. primary  and a GOP shift"
  },
  {
    "id": 3500,
    "mediaId": 21,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "\"It's something that you can beat,\" <span class='selected-term'>Ron DeSantis</span> said of a breast cancer diagnosis.",
    "author": "Kimberly Leonard",
    "title": "Casey DeSantis says her husband, Florida Gov. Ron DeSantis, 'picked me up literally and figuratively' and went to all her chemo treatments"
  },
  {
    "id": 3506,
    "mediaId": 238,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hugh Hewitt",
    "title": "Opinion Trump hovers, but the number of his likely rivals keeps growing"
  },
  {
    "id": 3468,
    "mediaId": 151,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Bidens Cuba and Venezuela policy shifts leave Florida Democrats dismayed"
  },
  {
    "id": 3470,
    "mediaId": 1546,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Not so, according to Florida Governor <span class='selected-term'>Ron DeSantis</span>, a potential 2024 Republican presidential candidate.",
    "author": "Chris Simkins",
    "title": "Looming Midterm Elections Put US Voting Rights in Spotlight"
  },
  {
    "id": 3474,
    "mediaId": 223,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": " <span class='selected-term'>Ron DeSantis</span> (@GovRonDeSantis) May 12, 2022",
    "author": "Sarah Arnold",
    "title": "DeSantis: Biden Will Plunge U.S. Into Recession as Gas Prices Soar"
  },
  {
    "id": 3479,
    "mediaId": 151,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": " Ken Burke files suit against Pinellas County over election bill lawsuit,? by Florida Politics Kelly Hayes\n Judge in ghost candidate case shields ex-lawmakers contacts,? by Orlando Sentinels Annie Martin\n State Attorney Brian Kramer announces new voter program to curb election crime offenses,? by The Gainesville Suns Javon L. Harris\n  Nikki Fried says media created <span class='selected-term'>Ron DeSantis</span> in explaining poll deficit,? by Florida Politics A.G. Gancarski\n... DATELINE TALLAHASSEE ...\nWHATS IN YOUR WALLET? DeSantis doles out millions but fails to mention it mostly comes from Uncle Sam,? by Orlando Sentinels Jeffrey Schweers: Gov.",
    "author": "",
    "title": "Biden's foreign policy rankles Florida Dems"
  },
  {
    "id": 3489,
    "mediaId": 19,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Ron DeSantis Knocks Gas Prices Under Biden: He Has Reduced Our Ability to Be Energy Independent"
  },
  {
    "id": 3490,
    "mediaId": 19,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Warning Shot: DeSantis Plans to Use Funds to Bus Illegal Immigrants Dumped in Florida to Bidens Delaware"
  },
  {
    "id": 3463,
    "mediaId": 136,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "In response to HHS's document, <span class='selected-term'>Ron DeSantis</span>' Florida Department of Health issued guidance of its own clarifying the \"evidence\" HHS/OPA cited.",
    "author": "",
    "title": "HHS Guidance on Trans Pharmacology Raises More Questions Than It Answers | Opinion"
  },
  {
    "id": 3464,
    "mediaId": 195,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Amie Parnes",
    "title": "Speculation over whether Biden will run again heats up"
  },
  {
    "id": 6522,
    "mediaId": 376,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "",
    "author": "Stephanie Akin\nKate Ackley\nMary Ellen McIntire",
    "title": "At the Races: NY state of turmoil"
  },
  {
    "id": 7119,
    "mediaId": 675,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "(SUMMIT NEWS)  During a speech Wednesday, Florida Governor <span class='selected-term'>Ron DeSantis</span> declared that Joe Biden should receive an honorary membership from Mexican drug cartels for facilitating their activities with open borders.",
    "author": "WND News Services",
    "title": "DeSantis says Biden should receive honorary cartel membership"
  },
  {
    "id": 7123,
    "mediaId": 238,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Emma Brown",
    "title": "Ginni Thomas, wife of Supreme Court justice, pressed Ariz. lawmakers to help reverse Trumps loss, emails show"
  },
  {
    "id": 7134,
    "mediaId": 223,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "https://t.co/cDyejM3vG0\n <span class='selected-term'>Ron DeSantis</span> (@GovRonDeSantis) May 19, 2022\nWithin the last year, more than 107,000 people overdosed from drugs, 71,000 of those were caused by fentanyl.",
    "author": "Sarah Arnold",
    "title": "DeSantis Signs Bill Increasing Fentanyl Punishments, Blames Biden For Surge"
  },
  {
    "id": 7137,
    "mediaId": 409,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Put simply, our constitution contemplates the need for Americans to be able to flee Gavin Newsoms oppression and seek asylum with <span class='selected-term'>Ron DeSantis</span> in the free State of Florida.",
    "author": "Steve Marshall",
    "title": "Why Are Red States Yielding to Bidens Blue Government?"
  },
  {
    "id": 7147,
    "mediaId": 19,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Ron DeSantis: Biden Administration Wants to Punish Americans for Using Carbon with Higher Gas Prices"
  },
  {
    "id": 7153,
    "mediaId": 19,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Ron DeSantis Enhances Drug Trafficking Laws: Bidens Open Border Threatens All Americans Safety"
  },
  {
    "id": 7108,
    "mediaId": 238,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "",
    "author": "Colby Itkowitz",
    "title": "House Democrats scramble after redistricting lessens competitive edge"
  },
  {
    "id": 7109,
    "mediaId": 302,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "",
    "author": "Associated Press",
    "title": "Ginni Thomas emails deepen her involvement in 2020 election"
  },
  {
    "id": 7110,
    "mediaId": 195,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "",
    "author": "Douglas MacKinnon",
    "title": "Trumps vice presidential running mate for 2024?"
  },
  {
    "id": 7190,
    "mediaId": 21,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "\"Georgia deserves a governor more like <span class='selected-term'>Ron DeSantis</span>,\" Cox said, praising the combative Florida Republican and potential 2024 presidential contender for relentlessly sticking it to the establishment.",
    "author": "Warren Rojas",
    "title": "David Perdue's closing argument to Georgians ahead of Tuesday's GOP primary: A vote for Brian Kemp is a vote for Stacey Abrams"
  },
  {
    "id": 7279,
    "mediaId": 21,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kimberly Leonard",
    "title": "Sen. Marco Rubio avoids saying which national abortion ban Republicans should run on in the midterm elections, predicting states would decide"
  },
  {
    "id": 7272,
    "mediaId": 223,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "If a Youngkin-type, or even a <span class='selected-term'>Ron DeSantis</span> runs and wins the presidency in 2024, these people will not stop.",
    "author": "Will Alexander",
    "title": "Squishy Republicans Want Trump to Go Away"
  }
]