[
  {
    "id": 4349,
    "mediaId": 188,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "\\n\\nFlorida rejects Biden\\u2019s attempt to enforce regime-approved narratives and to stifle dissent.pic.twitter.com/fSnU2gk97x\n <span class='selected-term'>Ron DeSantis</span> (@Ron DeSantis) 1651247498",
    "author": "Paul Sacca",
    "title": "Republicans vow to eradicate Biden's Disinformation Governance Board. Boebert says it is at a 'Stalin level,' DeSantis warns: 'You cannot have a ministry of truth in this country.'"
  },
  {
    "id": 3941,
    "mediaId": 943,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "Associated Press",
    "title": "This day in history, May 6: German airship Hindenburg catches fire and crashes while attempting to dock at Lakehurst"
  },
  {
    "id": 3757,
    "mediaId": 238,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "DeSantis mandates lessons on communism for high school students"
  },
  {
    "id": 3778,
    "mediaId": 675,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/Ojlao8f46t\n <span class='selected-term'>Ron DeSantis</span> (@GovRonDeSantis) May 9, 2022\nI appreciate this initiative and the fact that we are honoring the victims of communism by teaching young people about the evils of communism and the moral obligation we have to stop it,? Cuban human rights activist Rosa Mara Pay said in response to the legislation, according to the press release.",
    "author": "WND News Services",
    "title": "Now Florida to teach students 'evils of communism'"
  },
  {
    "id": 3786,
    "mediaId": 409,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "Governor <span class='selected-term'>Ron DeSantis</span> on Monday signed legislation to create a Victims of Communism Day? each year on November 7, at which time public school teachers will be required to spend at least 45 minutes teaching students about communist leaders and how people suffered under their regimes.",
    "author": "Brittany Bernstein",
    "title": "DeSantis Signs Bill Requiring Education on Communist Regimes in Public Schools"
  }
]