[
  {
    "id": 6251,
    "mediaId": 238,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion: Ron DeSantiss war on Disney points to an ominous GOP future"
  },
  {
    "id": 6267,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Florida Governor <span class='selected-term'>Ron DeSantis</span>\nOn Thursday the Florida legislature passed a bill cancelling Walt Disney Worlds special tax status in that state.",
    "author": "",
    "title": "Yes, Republicans really are moving us towards"
  },
  {
    "id": 4362,
    "mediaId": 1067,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ryan Faughnder",
    "title": "Disney PR chief out after 3 months amid DeSantis-Reedy Creek controversy"
  },
  {
    "id": 4372,
    "mediaId": 63,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Alison Durkee",
    "title": "Most AmericansEven RepublicansOppose Florida GOPs Attacks On Disney, Poll Suggests"
  },
  {
    "id": 4389,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kelsey Carolan",
    "title": "Disney says Florida cant dissolve special district without paying $1B debt"
  },
  {
    "id": 4411,
    "mediaId": 558,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "Colin Lodewick",
    "title": "The Disney fiasco could have ominous consequences for Floridas government, major credit agency warns"
  },
  {
    "id": 4438,
    "mediaId": 558,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Governor <span class='selected-term'>Ron DeSantis</span> (R-FL) appeared on Fox News The Ingraham Angle? to defend his bill dissolving the Reedy Creek Improvement District, Disneys special tax district.",
    "author": "",
    "title": "Gov. Ron DeSantis (R-FL) denies reports that the bill targeting Disney will raise taxes on Floridians."
  },
  {
    "id": 4449,
    "mediaId": 302,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Disney special district dispute could weaken other Florida government bonds, Fitch Ratings warns"
  },
  {
    "id": 4338,
    "mediaId": 169,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "Bill Maher referenced a Salon article on Friday's episode of \"Real Time With Bill Maher\" as part of a segment in which Maher discusses Ted Cruz and <span class='selected-term'>Ron DeSantis</span>' building concerns over a \"sexy Disney.\"",
    "author": "Kelly McClure",
    "title": "Bill Maher on DeSantis, Cruz and \"sexy Disney\""
  },
  {
    "id": 4350,
    "mediaId": 19,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/qH4VKUgmkO\n <span class='selected-term'>Ron DeSantis</span> (@GovRonDeSantis) March 28, 2022\nThe legislation sparked a war with woke Disney, which repeated the fake news catchphrase Dont Say Gay? and criticized the governor for signing the law.",
    "author": "Hannah Bleau",
    "title": "Survey: Majority Support Anti-Groomer Laws Like Floridas Parental Rights in Education Law"
  },
  {
    "id": 4283,
    "mediaId": 136,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "GOP Florida Governor <span class='selected-term'>Ron DeSantis</span> is also a potential nominee for the 2024 race as his popularity continues to grow among his own party despite his recent law restricting LGBTQ rights and his ongoing feud with Disney.",
    "author": "Fatma Khaled",
    "title": "Trump 'Should Not Define Our Future': GOP's Asa Hutchinson Weighs 2024 Bid"
  },
  {
    "id": 4294,
    "mediaId": 323,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "Heather Gillers",
    "title": "Floridas $1 Billion Disney Question"
  },
  {
    "id": 4306,
    "mediaId": 1067,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Gov.<span class='selected-term'>Ron DeSantis</span> has been on a rampage, ramming through a barrage of legislation on culture war issues that are nothing more than buzzwords.",
    "author": "",
    "title": "DeSantis shouldnt alienate GOP centrists | Letters"
  },
  {
    "id": 4314,
    "mediaId": 157,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "Tom Boggioni",
    "title": "Ron DeSantis' war on Disney has bondholders panicked over who's responsible for $1 billion in debt: report"
  },
  {
    "id": 4197,
    "mediaId": 136,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Calling Governor <span class='selected-term'>Ron DeSantis</span>' plan to dissolve Disney's self-governance district \"harebrained,\" a trio of Democratic Florida lawmakers spoke out against the move Monday, saying it could lead to higher taxes for the counties where Walt Disney World is located.",
    "author": "Thomas Kika",
    "title": "Dissolving Disney Government Creates 'Dire' Situation: Florida Lawmakers"
  },
  {
    "id": 4203,
    "mediaId": 1067,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Skyler Swisher",
    "title": "Lawmakers suspect DeSantis wants to take control of Disney Worlds government"
  },
  {
    "id": 4243,
    "mediaId": 18,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Editorial",
    "title": "Editorial: Disney, DeSantis must compromise"
  },
  {
    "id": 4119,
    "mediaId": 1067,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "Skyler Swisher",
    "title": "Top DeSantis megadonor doesnt appreciate him targeting Disney"
  },
  {
    "id": 4052,
    "mediaId": 98,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "A handful of Florida residents are suing the state and its Republican governor, <span class='selected-term'>Ron DeSantis</span>, over the decision to dissolve Walt Disney Co.'s special self-governing district near Orlando, saying the move will saddle them with the companys $1-billion debt burden.",
    "author": "Ryan Faughnder",
    "title": "Disney Florida fallout: Taxpayers sue DeSantis for axing companys special tax status"
  },
  {
    "id": 4058,
    "mediaId": 132,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "In March, Floridas Republican governor, <span class='selected-term'>Ron DeSantis</span>, signed the Parental Rights in Education Bill,? which reinforces parents rights to make decisions regarding the upbringing of their children.? The bill prohibits classroom instruction on sexual orientation or gender identity in kindergarten through third grade and prohibits instruction that is not age appropriate for students and requires school districts to adopt procedures for notifying parents if there is a change in services from the school regarding a childs mental, emotional or physical health or well-being.",
    "author": "Lynn Schmidt",
    "title": "Give peace a chance in America's culture wars"
  },
  {
    "id": 3982,
    "mediaId": 136,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "A Miami-based attorney has filed a lawsuit on behalf of several central Florida residents against Florida Governor <span class='selected-term'>Ron DeSantis</span> and others seeking to overturn the elimination of Disney's Reedy Creek Improvement District.",
    "author": "Fatma Khaled",
    "title": "Who is William Sanchez? Senate Candidate Sues DeSantis Over Disney District"
  },
  {
    "id": 3949,
    "mediaId": 157,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "Timothy Evans",
    "title": "Ron DeSantis' crusade against Disney is drawing fire from some Republicans"
  },
  {
    "id": 3694,
    "mediaId": 441,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "A federal judge threw out a lawsuit by three Florida residents who claim Governor <span class='selected-term'>Ron DeSantis</span> trampled on Walt Disney Co.s freedom of speech, finding numerous holes in their filing and ruling the company can fight its own battle.",
    "author": "Katia Porzecanski",
    "title": "DeSantis Culture War With Disney Sees Lawsuit by Florida Trio Thrown Out"
  },
  {
    "id": 3737,
    "mediaId": 1390,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "Tyler O'Neil",
    "title": "DeSantis notches legal win in battle over law revoking Disney's special tax district"
  },
  {
    "id": 3534,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "Lori Rozsa",
    "title": "DeSantis says Florida may take over Disneys special district"
  },
  {
    "id": 3546,
    "mediaId": 558,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Ban on protests in front of homes signed by Gov. DeSantis"
  },
  {
    "id": 3556,
    "mediaId": 558,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Governor <span class='selected-term'>Ron DeSantis</span> (R-FL) announced $125 million in funding for nursing and claimed the Florida government is going to take care of Disneys debt while speaking at Seminole State College, Sanford, Florida today.",
    "author": "",
    "title": "Gov. DeSantis (R-FL) tells FL to not worry about Disneys debt: I have the biggest budget surplus weve ever had.\""
  }
]