[
  {
    "id": 6199,
    "mediaId": 302,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "The political marriage of Donald Trump and <span class='selected-term'>Ron DeSantis</span>, never passionate but for a time mutually convenient, is all but over.",
    "author": "Jim Verhulst",
    "title": "Heres what to read from the left and the right | Column"
  },
  {
    "id": 4365,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Social media users are revisiting the controversial history of Bugs Bunny cartoons after Florida Governor <span class='selected-term'>Ron DeSantis</span> claimed that Disney is pushing for certain topics in its cartoons.",
    "author": "Fatma Khaled",
    "title": "Bugs Bunny's Controversial History Revisited After Ron DeSantis' Comments"
  },
  {
    "id": 4432,
    "mediaId": 124,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Elon Musks uneasy relationship with the left explodes over Twitter takeover"
  },
  {
    "id": 4329,
    "mediaId": 223,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "Rebecca Downs",
    "title": "Buried in POLITICO Report is Mention of How Biography on Jill Biden Fared, and the Numbers Are Catastrophic"
  },
  {
    "id": 4347,
    "mediaId": 19,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Ron DeSantis: Leftists Freaking Out over Elon Musk Purchase Because They Used Twitter to Enforce the Narrative"
  },
  {
    "id": 4351,
    "mediaId": 19,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "",
    "author": "James P. Pinkerton",
    "title": "Pinkerton: Seeking the Right Strategy for Big Tech Beyond Elon Musk"
  },
  {
    "id": 4185,
    "mediaId": 63,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "I know Elon is just deeply committed to the idea of freedom of expression.?\nFree speech doesnt necessarily mean good ideas, to be clear,? he added, but to have a robust debate around ideas is how we actually come to reasonable conclusions.?\nDeSantis vs. Disney\nThe top GOP donor this election cycle, with some $40 million in political contributions, Griffin has also been a big backer of Florida governor <span class='selected-term'>Ron DeSantis</span>.",
    "author": "Chase Peterson-Withorn",
    "title": "Billionaire GOP Megadonor Ken Griffin: I Dont Appreciate Governor DeSantis Going After Disneys Tax Status."
  },
  {
    "id": 4193,
    "mediaId": 136,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "In March, Florida Governor <span class='selected-term'>Ron DeSantis</span>' press secretary Christina Pushaw wrote on Twitter, \"The bill that liberals inaccurately call 'Don't Say Gay' would be more accurately described as an Anti-Grooming Bill.",
    "author": "Emma Mayer",
    "title": "Steven Crowder Tells Teachers Not to Be Groomers During Appreciation Week"
  },
  {
    "id": 4212,
    "mediaId": 675,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Florida Enacts Protections for Unborn Babies at 15 Weeks https://t.co/IeOANY8LxM\n <span class='selected-term'>Ron DeSantis</span> (@GovRonDeSantis) April 14, 2022\nThe move comes as GOP-led states are implementing abortion limits ranging from conception to 15 weeks.",
    "author": "WND News Services",
    "title": "Amazon to foot the bill for employees' abortion tourism"
  },
  {
    "id": 4216,
    "mediaId": 675,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "WND News Services",
    "title": "'Ban the sex change': Governor wants to outlaw child-gender switches"
  },
  {
    "id": 4226,
    "mediaId": 65,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Amy Nelson",
    "title": "Jack Brewer: Joy Reid must apologize for 'reckless' tweet or defamation lawsuit will be filed"
  },
  {
    "id": 4256,
    "mediaId": 19,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Hes not going to allow Chris Christie or <span class='selected-term'>Ron DeSantis</span> or anyone else define the future of the Republican Party.",
    "author": "Wendell Husebø",
    "title": "Report: Bidens Advisers Weigh Making Midterms About Trump Again"
  },
  {
    "id": 4264,
    "mediaId": 19,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Hannah Bleau",
    "title": "Ron DeSantis on Chatter of Twitter Moving to Florida: Im Not Advocating for a San Fran Tech Company Moving Here"
  },
  {
    "id": 4117,
    "mediaId": 65,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Hillary Clinton mocked for maskless Met Gala photos while being doted on by masked staff"
  },
  {
    "id": 4036,
    "mediaId": 675,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "Larry Elder",
    "title": "The conservative surge in Twitter followers  the Elon Musk effect?"
  },
  {
    "id": 4055,
    "mediaId": 675,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "WND News Services",
    "title": "Leaking Supreme Court draft called a 'judicial insurrection'"
  },
  {
    "id": 4056,
    "mediaId": 675,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "",
    "author": "WND News Services",
    "title": "Leaking Supreme Court draft called a 'judicial insurrection'"
  },
  {
    "id": 4078,
    "mediaId": 21,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Florida Governor <span class='selected-term'>Ron DeSantis</span> discouraged Twitter from bringing its headquarters to the state following Elon Musk's privatization of the platform, Jacksonville outlet News4JAX reported.",
    "author": "Taiyler Simone Mitchell",
    "title": "DeSantis takes a dig at Twitter as lawmakers encourage Elon Musk to move HQ to Florida: 'Importing some tech company from San Francisco has not been high on our list'"
  },
  {
    "id": 3994,
    "mediaId": 136,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "This comes after Florida Republican Governor <span class='selected-term'>Ron DeSantis</span> signed the so-called \"Don't Say Gay\" bill into law in March.",
    "author": "Gerrard Kaonga",
    "title": "Florida Teacher Fired for Discussing Sexual Orientation Sparks Debate"
  },
  {
    "id": 4000,
    "mediaId": 237,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Nihal Krishan",
    "title": "Conservatives eager to see return of political ads on Twitter under Musk"
  },
  {
    "id": 4005,
    "mediaId": 223,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Larry Elder",
    "title": "The Conservative Surge in Twitter Followers -- The Elon Musk Effect?"
  },
  {
    "id": 3944,
    "mediaId": 223,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "View Cartoon\nMickey Mouse fell for the trap laid out by Governor <span class='selected-term'>Ron DeSantis</span> and Florida Republicans, as woke Disney had its special tax status removed after opposing popular legislation stopping the indoctrination of Americas children.",
    "author": "Townhall.com Staff",
    "title": "Leftist Abortion Cult Goes Nuclear"
  },
  {
    "id": 3886,
    "mediaId": 136,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "The lawsuit attempted to use Florida's Stop Social Media Censorship Act, a bill signed by Florida Governor <span class='selected-term'>Ron DeSantis</span> last year that gives residents the right to sue social media companies that enforce their community standards unevenly.",
    "author": "Jake Thomas",
    "title": "Trump Lawsuit Against Twitter, Jack Dorsey Tossed by California Judge"
  },
  {
    "id": 3853,
    "mediaId": 675,
    "date": "5/8/2022 12:00:00 AM",
    "sentence": "",
    "author": "WND News Services",
    "title": "Will top companies follow Disney's disaster and take stance on politics?"
  },
  {
    "id": 3756,
    "mediaId": 238,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Youngkin gets backlash over stance on protests outside Alitos home"
  },
  {
    "id": 3762,
    "mediaId": 136,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "Aguilar went on to say Youngkin is becoming a \"RINO\" (Republican in name only) and that he asks himself daily what Florida Governor <span class='selected-term'>Ron DeSantis</span> would do.",
    "author": "Adam Staten",
    "title": "Ex-Trump Adviser Takes Aim at Glenn Youngkin for SCOTUS Protest Response"
  },
  {
    "id": 3766,
    "mediaId": 65,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "",
    "author": "Amy Nelson",
    "title": "Karol Markowicz on NYC Jewish museum canceling DeSantis speaking event: 'Political games'"
  },
  {
    "id": 3632,
    "mediaId": 129,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "Even if you would never consider voting for him, its important to understand the sources of his appeal and the direction of his politics, because one way or the other  whether he ever runs for president or not  <span class='selected-term'>Ron DeSantis</span> is the new Republican Party.",
    "author": "",
    "title": "Republicans Need a New Leader. Theyre Looking to Florida."
  },
  {
    "id": 3600,
    "mediaId": 21,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Florida Governor <span class='selected-term'>Ron DeSantis</span> tried to instate a similar bill in Florida, but a judge blocked it, saying it would violate social media companies' first amendment rights.",
    "author": "Hannah Getahun",
    "title": "A law allowing citizens to sue companies like Facebook, Twitter, and YouTube for censorship was reinstated in Texas"
  },
  {
    "id": 3497,
    "mediaId": 136,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Laura Loomer, a far-right political activist who is running in a GOP primary for a U.S. House seat representing the state's 11th Congressional District, took to social media to slam the new law signed by Governor <span class='selected-term'>Ron DeSantis</span> on Monday.",
    "author": "Adam Staten",
    "title": "Republican Who Put Tent on Nancy Pelosi's Lawn Slams DeSantis Protest Law"
  },
  {
    "id": 3466,
    "mediaId": 151,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Tech companies removed the Buffalo shooting manifesto. A Texas law could make that illegal."
  },
  {
    "id": 3472,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Taylor Penley",
    "title": "Nikole Hannah-Jones, others advocate for critical race theory in wake of Buffalo shooting"
  },
  {
    "id": 7149,
    "mediaId": 19,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Katherine Hamilton",
    "title": "Washington School Board Director to Host Queer Youth Open Mic in Not Creepy Sex Shop"
  },
  {
    "id": 7280,
    "mediaId": 178,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "While <span class='selected-term'>Ron DeSantis</span> and Greg Abbott, the governors of Florida and Texas, say they want to protect conservative points of view from liberal tech executives, the laws' texts seem to prohibit tech companies from removing or down-ranking all kinds of content that has nothing to do with electoral politics.",
    "author": "Farhad Manjoo New York Times",
    "title": "Bad ideas for fixing the internet have gone viral"
  }
]