{
  "id": 5404,
  "mediaId": 2668,
  "date": "2022-02-19",
  "headline": "Does the Rise of Black Conservatives Signal a Turning Point for the GOP?",
  "image": "https://media.townhall.com/townhall/reu/o/2021/302/f0ff934b-5cd9-4089-b797-959e10e799b8-1110x740.jpg",
  "link": "https://redstate.com/jeffc/2022/02/19/does-the-rise-of-black-conservatives-signal-a-turning-point-for-the-gop-n524849",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Charles",
  "authorUrl": "https://redstate.com/author/jeffc",
  "termIds": [
    0
  ],
  "sentences": [
    "Friess wrote:\nCases in point: A 2019 Pew poll found that 49 percent of Black Americans oppose same-sex marriage versus 32 percent of whites; a 2020 Gallup survey reported that 54 percent of Black respondents do not believe abortion is morally acceptable; a 2018 Harvard-Harris survey found 85 percent of Black Americans favor restricting legal immigration, more than any other demographic group; and 73 percent of Black voters support school choice, according to a 2021 RealClear survey.",
    "Professor Leah Wright Rigueur, who teaches political science at Johns Hopkins University, and is the author of “Loneliness of the Black Republican,” told Newsweek: “Some Republicans are savvy enough to understand that if they win 10 to 15 percent of Black voters in state and local elections, they can win—and there are ways to actually do this.”\nAs it stands currently, there are only three black Republicans in the legislature.",
    "Also running in GOP primaries: former Army helicopter pilot Wesley Hunt, the first Black Republican nominee for Congress in Texas in 2020, when he lost by 3 points in a Houston-area district; former Scott legislative aide Shay Hawkins of Akron, Ohio; businessman Quincy McKnight of Nashville; and ex-Trump aide Rod Dorilás, a 31-year-old Navy veteran in Palm Beach County, Florida.",
    "Republican National Committee spokesman Paris Dennard explained that the shift “started with President Trump and how vocal he was about the Black Voices for Trump movement being fully funded and staffed at the campaign.”\nIndeed, Trump was the first Republican president since Richard Nixon to actually make a concerted effort to reach black voters.",
    "The author noted that in several recent races, black Republican candidates “drew slightly larger, potentially decisive shares of Black votes compared to the white Republicans running alongside them for other offices in their states.” This could be an indicator that the GOP might finally realize they can win when running black candidates.",
    "Ten years after its “autopsy” of Mitt Romney’s 2012 loss to Barack Obama concluded that the Republican Party’s biggest problem was its failure to appeal to voters of color, 2022 is shaping up as a breakthrough year for the GOP on at least one diversity front: Black candidates.",
    "They may include John James, who joined the race for a new seat in the Detroit suburbs this month after his losing his last Senate bid by just 1.7 percentage points; if elected, he would be Michigan’s first Black Republican member of Congress.",
    "Friess wrote:\nThe three Black Republicans now in Congress—South Carolina Senator Tim Scott and Representatives Burgess Owens of Ohio and Byron Donalds of Florida—are the largest number to serve simultaneously since Reconstruction.",
    "I’ve been advocating for years for the GOP to start taking black voters seriously, and this could be the start of what could be a serious paradigm shift – as long as the party’s leadership is willing to take a long-term approach.",
    "Newsweek’s Steve Friess wrote an article titled “GOP Bets on Black Conservatives As Key to Victory: ‘We Change or We Die,’” in which he detailed the increasing prevalence of black conservatives running for office as Republicans.",
    "It has often been said that the Republican Party is the “party of old white men.” Indeed, when one looks at the party’s makeup, one can easily see why this moniker has persisted for so many decades.",
    "The failure of the GOP to engage with black voters has vexed many – including myself – because conservatives have important values in common with the black community.",
    "Even further, Republican leadership seems to be coming around to the idea that the party can increase its share of black votes, if they put forth a genuine effort.",
    "By contrast, 14 Black Democrats hold statewide elected office and 55 Black Democrats serve in Congress (excluding Washington, D.C. and the U.S. Virgin Islands).",
    "This is an important step in the right direction for the GOP and the conservative movement, and it appears at least some within the party understand this.",
    "“At least three—now called Black American Community Centers—have already opened, in Milwaukee, Cleveland and College Station, Georgia,” Friess explained.",
    "We change or we die.”\nSome credit former President Donald Trump with the Republican Party’s seeming change of heart in regards to courting black voters.",
    "During his re-election campaign, the RNC opened Black Voices 4 Trump offices in 15 major cities with high black populations in battleground states.",
    "Hopefully, this truly is a sign that the conservative movement and the former Party of Lincoln are ready to finally start building that big tent.",
    "The article also noted a significant number of prominent black Republican candidates seeking office in the November midterm elections.",
    "After the election, the offices were closed, but RNC Chairwoman Ronna McDaniel pledged $2 million last February to reopen them.",
    "However, there are signs that times are a-changing, and the conservative movement is beginning to look a little different.",
    "Governor Winsome Sears, sworn in last month, brings the number of Black Republicans in statewide elected offices to five.",
    "A high-ranking GOP official, who happens to be white, told Newsweek: “We can’t be the party of white men anymore.",
    "Indeed, Jalen Johnson’s victory in Albany, Georgia, is the template many of these candidates should follow.",
    "It took the GOP a long time to break trust with the black community after it stopped courting their votes.",
    "But this can’t be the type of situation in which the party gives up after not seeing immediate returns.",
    "Earning it back won’t happen overnight, and Republicans must be willing to persist for the long haul.",
    "He wrote:\nWhat’s more, the RNC expects a record-setting number of Black nominees for the House.",
    "I’m cautiously optimistic about some of the trends I’m seeing in the conservative movement.",
    "Winning over black voters is not impossible for the right.",
    "There won’t be enough of us in a decade.",
    "There aren’t enough of us.",
    "Virginia Lt."
  ]
}