{
  "id": 6274,
  "mediaId": 2643,
  "date": "2022-02-09",
  "headline": "GOP Bets on Black Conservatives As Key to Victory: 'We Change or We Die'",
  "image": "",
  "link": "https://www.newsweek.com/2022/02/18/gop-bets-black-conservatives-key-victory-we-change-we-die-1677030.html",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Friess",
  "authorUrl": "https://www.newsweek.com/authors/steve-friess",
  "termIds": [
    0
  ],
  "sentences": [
    "Black Republicans who defend Trump rarely mention the former president's insistence that there were \"very fine people on both sides\" in the deadly Unite the Right protest staged by white supremacists in Charlottesville, Virginia, in 2017; his insults of predominantly Black nations as \"sh*thole countries;\" his use of the military to clear Lafayette Square of a Black Lives Matter protest for his photo op at a church; the spike in anti-minority hate crimes that pocked his years in office; or his ongoing, unfounded claims of voter fraud in 2020, particularly from heavily Black cities like Atlanta, Detroit and Philadelphia.",
    "From Georgia, where high-profile Black Republicans seek nominations for both governor and senator, to Michigan, where former Detroit Police Chief James Craig is the odds-on favorite to go up against Democratic Governor Gretchen Whitmer, to a lineup of well-funded House and Senate candidates poised to break the record for the number of Black Republicans elected to Congress, a decade-long effort to broaden the appeal of the GOP is finally bearing fruit—and could play a pivotal role in determining the outcome of the upcoming midterm elections.",
    "Black Republicans point out that, despite his coarse rhetoric on racial issues, Trump's presidency brought policy changes and other developments that benefited people of color, including an economy that yielded record-low Black unemployment; the First Step Act, which eased stringent federal criminal sentencing guidelines and created mechanisms for earlier prison release; and a budget that included $255 million per year for 10 years for Historically Black Colleges and Universities.",
    "Cases in point: A 2019 Pew poll found that 49 percent of Black Americans oppose same-sex marriage versus 32 percent of whites; a 2020 Gallup survey reported that 54 percent of Black respondents do not believe abortion is morally acceptable; a 2018 Harvard-Harris survey found 85 percent of Black Americans favor restricting legal immigration, more than any other demographic group; and 73 percent of Black voters support school choice, according to a 2021 RealClear survey.",
    "Those seeking evidence that the Republican outreach to Black conservatives is working can look to Virginia as Exhibit A.\nWinsome Sears' barrier-busting victory in the 2021 lieutenant governor's race was noteworthy not just because it made her the first Black woman elected to statewide office in Virginia but also because she pulled in 17 percent of the Black vote, more than any GOP statewide candidate in memory.",
    "That allegiance began with the 1936 reelection of President Franklin Roosevelt on the heels of the New Deal with its social programs for the poor, was bolstered when President Harry Truman integrated the Armed Forces and banned racial discrimination in federal employment, and was cemented in the 1960s with President Lyndon Johnson pushing through the Civil Rights and Voting Rights Acts.",
    "Pearson, the 19-year-old Republican who served as the first campaign manager for Jones' short-lived gubernatorial campaign before he returned to college in fall 2021, believes Jones is a potent antidote to the expected attacks from likely Democratic gubernatorial nominee Stacey Abrams and others that Republicans seek to disenfranchise Black voters with recent changes to election laws.",
    "Also running in GOP primaries: former Army helicopter pilot Wesley Hunt, the first Black Republican nominee for Congress in Texas in 2020, when he lost by 3 points in a Houston-area district; former Scott legislative aide Shay Hawkins of Akron, Ohio; businessman Quincy McKnight of Nashville; and ex-Trump aide Rod Dorilás, a 31-year-old Navy veteran in Palm Beach County, Florida.",
    "A number of high-profile candidates are serious contenders if not outright favorites, including Craig in Michigan; former college football star Herschel Walker seeking to unseat Democratic incumbent Senator Raphael Warnock in Georgia; and ex-State Senator Vernon Jones of Georgia attempting to replace retiring GOP Representative Jody Hice in a sprawling district east of Atlanta.",
    "'Republicans Who Just Don't Know It Yet\"\nIndeed, some GOP positions, on subjects such as abortion, LGBTQ rights, education and immigration reform, have strong support within the Black community, and are seen by conservatives as issues that can win over Black voters who \"are Republicans who just don't know it yet,\" as Sears, Virginia's new lieutenant governor, likes to say.",
    "But the damage had already been done in countering a narrative from the McAuliffe camp that Youngkin was a closet white supremacist for making a signature issue out of opposition to teaching \"critical race theory\"—a legal concept that many on the right interpret as an effort to attack white Americans in the classroom by delving into the contemporary legacy of slavery.",
    "\"[If] we lose some big races to Black Republicans in 2022, when Republicans already have the wind at their backs, suddenly there's a narrative from the dum-dums at Politico and Meet The Press that Democrats are losing their grip on their most rock-solid constituency,\" says a Democratic strategist working on three Senate races in 2022.",
    "More recently, Trump's endorsements of a number of little-known Black politicians, despite their slim chances of wining, is encouraging some Black Republican candidates to ignore traditional GOP gatekeepers—local party bosses—who in the past have put the kibosh on their ambitions, says Rigueur, the Johns Hopkins political scientist.",
    "\"Some Republicans are savvy enough to understand that if they win 10 to 15 percent of Black voters in state and local elections, they can win—and there are ways to actually do this,\" says Johns Hopkins University political science professor Leah Wright Rigueur, author of the 2016 book, The Loneliness of the Black Republican.",
    "After all, Trump did increase his share of the Black vote in 2020 despite running against a ticket that included Democrat Kamala Harris, the first Black major-party vice presidential candidate, and just months after Black Lives Matter demonstrations related to George Floyd's death and other Black victims of police violence.",
    "Another indication that the GOP is chipping away at Black loyalty to the Democratic Party, according to Republican National Committee spokesman Paris Dennard: last year's elections in Virginia, where there were examples of Black Democrats losing to white Republicans in regions with sizable Black constituencies.",
    "But supporters say that was a prelude to a presidency in which Trump led an outreach and policy initiative that, by 2020, brought his share of the Black vote up to 12 percent, the highest percentage for a GOP presidential nominee since Ronald Reagan took 14 percent on his way to the White House in 1980.",
    "Longtime GOP strategist Ron Christie, author of Black in the White House about his work for President George W. Bush, recalls early in his career as a Congressional aide being harangued by Democratic Representative Maxine Waters of California who, he claims, told him he was \"a disgrace to your race.\"",
    "Given the tight races for both Republicans, Black voters arguably provided the margin of victory—or at least contributed to it: Youngkin topped former Democratic Governor Terry McAuliffe by 2 points; Sears beat former Virginia House Delegate Hala Ayala, who is Afro-Latina, by 1.5 points.",
    "One countervailing factor lately: the presence of high-profile Black conservative media figures like Candace Owens and government officials such as Supreme Court Justice Clarence Thomas and former Housing and Urban Development Secretary Ben Carson, who publicly endorse the GOP agenda.",
    "Eyes on Georgia, Michigan\n\"I am the face of the Republican Party,\" declares Vernon Jones, the former Georgia state senator who switched parties last year and this week, after talks with Trump, abandoned a campaign for governor in order to pursue the GOP nod in an open House seat.",
    "Ten years after its \"autopsy\" of Mitt Romney's 2012 loss to Barack Obama concluded that the Republican Party's biggest problem was its failure to appeal to voters of color, 2022 is shaping up as a breakthrough year for the GOP on at least one diversity front: Black candidates.",
    "Governor Mark Robinson, Kentucky Attorney General Daniel Cameron and unsuccessful U.S. Senate hopeful John James in Michigan were the top vote-getting Republicans in their states in their most recent races, indicating they both excited the GOP base and drew crossover votes.",
    "The program's online description is laden with the kind of progressive buzzwords that regularly receive mockery in the right-wing media—monthly classes cover \"inclusive language, authentic communications, diversity and civic engagement, multicultural messaging...and more!\"",
    "The effort also includes Dennard writing a weekly column in the Black newspaper The Carolinian, the RNC taking out advertisements in Black media to celebrate Black History Month and placing Black GOP surrogates as pundits on conservative and Black political talk shows.",
    "Michigan State University political science professor Matt Grossmann believes Craig has a good shot at pulling it off: \"The Black vote in southeast Michigan is a huge, important section of the electorate, and he has some name recognition and potential goodwill there.",
    "Says Jones, \"I would be an advocate not only for the America First agenda but also the fight for election integrity when they're try spinning a false narrative that Black people can't afford photo IDs or can't have water in line at the polls when they vote.\"",
    "Democratic affiliation is also as much a cultural and social construct among Black voters as an ideological one, says University of Maryland political scientist Chryl Laird, co-author of Steadfast Democrats: How Social Forces Shape Black Political Behavior.",
    "Nearly 90 percent of Black Americans agree, for instance, that \"White people benefit at least a fair amount from advantages that Black people do not have,\" versus 71 percent of Republicans who believe whites have \"few or no advantages,\" according to Pew.",
    "\"The GOP is an inclusive party making significant inroads and, with recent wins already, we are optimistic about our chances in having even more Black conservatives elected to serve in 2022,\" says Dennard, the first Black person to hold his RNC position.",
    "GOP Congressman Donalds of Florida was particularly incensed by Joe Biden's appearance on Charlamagne Tha God's radio show during the 2020 campaign, when he said, \"If you have a problem figuring out whether you're for me or Trump, then you ain't Black.\"",
    "Yet radio talk host Larry Elder, a Black conservative and the top vote-getting Republican in September's failed recall of Democratic California Governor Gavin Newsom, says Trump followed the autopsy's advice all the way to the White House and beyond.",
    "There are other signs that GOP efforts to promote Black candidates and court Black voters might be paying off in the state: In Hampton, cybersecurity expert A.C. Cordoza, a Black Republican, unseated a white incumbent in a House of Delegates race.",
    "In South Carolina, Scott, only the second Black Republican in the Senate since Reconstruction, has nominal opposition for his reelection and has amassed a huge campaign war chest, sparking chatter about a possible White House run in 2024 or 2028.",
    "They may include John James, who joined the race for a new seat in the Detroit suburbs this month after his losing his last Senate bid by just 1.7 percentage points; if elected, he would be Michigan's first Black Republican member of Congress.",
    "\"It started with President Trump and how vocal he was about the Black Voices for Trump movement being fully funded and staffed at the campaign, and then you have the chairwoman funding it and the donors embracing it after that,\" Dennard says.",
    "But judging by recent races featuring a Black GOP candidate—lieutenant governor races in Virginia and North Carolina, a Kentucky attorney general campaign and the last two U.S. Senate races in Michigan—the party has reason to be hopeful.",
    "And in a rural southern Virginia district that is 52 percent Black, pharmacist Otto Wachsmann Jr., a white Republican, defeated seven-term incumbent Democratic Delegate Roz Tyler, former chair of the Virginia Legislative Black Caucus.",
    "Also a possible factor: disappointment among Black voters that McAuliffe never renounced an endorsement from outgoing Democratic Governor Ralph Northam, given the 2019 scandal in which photos of Northam costumed in blackface emerged.",
    "In the early days of the 2016 Trump campaign, amid the candidate's harsh remarks about immigrants and some communities of color, a Politico headline blared, \"Trump kills GOP autopsy\" and New York Magazine called it \"dead and buried.\"",
    "The strategy fits neatly into the playbook recommended in the 2013 RNC report analyzing Romney's presidential-election loss—the one dubbed \"the autopsy\"—which urged the GOP to seek votes beyond its base of older white Americans.",
    "She told the group: \"Expanding coalitions and growing our party has been a passion of mine since I became chair of the RNC—not just to win votes but to build authentic relationships and share our message with all communities.\"",
    "Installed atop the RNC after Donald Trump became president, McDaniel has, in fact, made expanding outreach to Black voters a hallmark of her tenure—an extension of the Black Voices For Trump effort during the 2016 campaign.",
    "A Detroit News poll in early January had him 9.5 points behind Whitmer with 11.7 percent undecided in the general election; a Detroit Free Press poll weeks later had him trailing by just 5 points with 13 percent undecided.",
    "Youngkin also enjoyed a surprise endorsement in early October from the bipartisan Hampton Roads Black Caucus, a Norfolk-area group that had previously endorsed McAuliffe in his successful 2013 campaign and Northam in 2017.",
    "Klacik, the 2020 GOP nominee for a House seat in a firmly Democratic district, raised more than $8 million after posting a three-minute viral campaign ad scalding Democrats for failing to improve conditions in the city.",
    "Pearson, a Black Republican who chaired Teens for Trump in 2016, comes to condemning Trump is to tell Newsweek that Charlottesville was \"just one of those moments where the president could have been a bit more tactful.",
    "Trump formally endorsed Jones on February 9 in a video posted by the candidate on Twitter in which the former president praised him as someone \"who will never back down to either the establishment or the radical left.\"",
    "The RNC's Mission\nIllustrating the shift: a little-noticed event in Indiana last summer, when 15 people of color and LGBTQ people graduated from a political organizing and training program organized by the state GOP.",
    "The three Black Republicans now in Congress—South Carolina Senator Tim Scott and Representatives Burgess Owens of Ohio and Byron Donalds of Florida—are the largest number to serve simultaneously since Reconstruction.",
    "Craig echoes that, telling Newsweek his status as a native Detroiter and well-regarded tenure as the city's top cop grants him an authenticity with Black audiences that will \"open some minds to what I have to say.\"",
    "He's raised more than $30 million since 2017, second only to Democratic Senate Majority Leader Chuck Schumer of New York among senators seeking reelection in 2022, according to Federal Election Commission records.",
    "Exit polls showed these Black Republican candidates drew slightly larger, potentially decisive shares of Black votes compared to the white Republicans running alongside them for other offices in their states.",
    "\"The biggest thing to me was all the blowback from within the Republican Party that I was not aware of as I was coming in,\" says Klacik, who lost by more than 40 points to Democratic incumbent Kweisi Mfume.",
    "For more than 50 years, Black Americans have been the country's most loyal voting bloc for either party, with more than 95 percent of Black voters registering Democratic or voting in Democratic primaries.",
    "Wilder did not endorse anyone in the election, but he did voice approval of Youngkin's HBCU plans while blasting McAuliffe for not providing additional funds for the schools when he was in office.",
    "Recent poll numbers in Michigan show just how high the stakes are for Craig, who has a double-digit lead among Republican hopefuls for the party nod, in improving his standing among Black voters.",
    "Many progressives took umbrage with Trump's August 2016 blunt appeal to Black voters—\"You're living in poverty, your schools are no good, you have no jobs, 58 percent of your youth is unemployed.",
    "By 2020, when Trump ran for reelection, the RNC rented office space in 15 major cities with a large Black population in battleground states for regularly staffed \"Voices For Trump\" field offices.",
    "(Listen to a Twitter Spaces discussion of this story with Dennard, conservative commentator Candace Owens, California House candidate Tamika Hamilton and radio talk-show host Larry Elder here.)",
    "A phalanx of regional Black Democratic leaders castigated the group as a GOP front, noting that Virginia Beach Republican Party Chairman William Curtis, who is Black, is the group's secretary.",
    "The same study found 80 percent of Black Americans believe the nation has \"not gone far enough\" to provide equal rights to racial minorities; just 15 percent of Republicans agreed with that.",
    "That earned Youngkin unusual cross-party praise from former Virginia Governor Douglas Wilder, a Democrat and the first of only two Black governors elected to the office in U.S. history.",
    "\"But, in addition to that, it is good for our party, which is now a working class, blue-collar, middle class, lower class party, to represent the fullness of our party and the country.",
    "Jones is precisely the sort of candidate Laird, the University of Maryland political scientist, meant when she talked about Black hopefuls who attract Trump's eye and his endorsement.",
    "The Detroit News poll also showed Craig tied with Whitmer among white voters but backed by just 7.6 percent of the Black vote to Whitmer's 82.3 percent, with 10.1 percent undecided.",
    "It remains to be seen whether the coming wave of Black conservative candidates can spur legions of Black voters, the Democratic Party's most loyal constituency, to vote Republican.",
    "For the Republican Party, the wave of Black candidates represents a giant step forward into a more multicolored future as part of a grand strategic plan for the Grand Old Party.",
    "Indeed, Laird says that candidacies like that of Jones and Craig in Michigan may inspire other candidates and encourage some Black voters to rethink their political allegiances.",
    "\"Black conservatives who might wish to support the Republican Party may not do so openly because they are concerned about their standing within the Black community,\" she says.",
    "Three-quarters of Black respondents—the most support from any demographic—agreed \"government should do more to solve problems,\" a view held by just 28 percent of Republicans.",
    "But, like her, he dismisses the criticism that marketing itself to voters of specific races is a GOP capitulation to the \"identity politics\" the party bashes Democrats for.",
    "\"It's not just about Black conservatives rising and seeing their success,\" says Donalds, a first-term House member who doesn't mince words when it comes to the opposition.",
    "High-profile candidates winning statewide could plant a seed that could create a crack in that very rigid social identity that keeps Black people on the Democratic side.\"",
    "ET: This article was updated to state that former Virginia Governor Douglas Wilder is one of two Black governors elected to the office in U.S. history, not the only one.",
    "The group's president, Ron Taylor, told National Review that Youngkin responded directly to their requests for information about his platform, whereas McAuliffe did not.",
    "Every time the RNC posts to Facebook about an outreach effort—say, the opening of the Black GOP community centers—laments from rank-and-file white Republicans follow.",
    "\"There just haven't been that many African Americans who run in GOP primaries in Georgia, and if you don't have African American candidates, you can't nominate one.\"",
    "Still, Election Night 2022, already looking favorable to Republicans, could go down as the moment elected Black Republicans go from a rarity to a real contingent.",
    "Trump also touted Jones' decision to endorse Trump's pick for governor, former Senator David Perdue, over incumbent GOP Governor Brian Kemp, whom Trump despises.",
    "\"The return on investment is an increase in Black support, more Black Republicans wanting to run for office and voting for Republican candidates,\" Dennard says.",
    "By contrast, 14 Black Democrats hold statewide elected office and 55 Black Democrats serve in Congress (excluding Washington, D.C. and the U.S. Virgin Islands).",
    "\"Donald Trump, to a greater degree than any Republican presidential candidate that I've seen, went to the inner city and tried to get Black votes,\" Elder says.",
    "In other words, winning over most of those undecideds and peeling off just a small share of Whitmer's Black support could allow the Republican to pull ahead.",
    "\"President Trump and I have had great discussions and President Trump believes that Congress needs me, that this country needs me,\" Jones tells Newsweek.",
    "Craig's campaign to unseat Whitmer, Rigueur says, is \"not about winning 100 percent of the Black folks, it's not even about winning 50 percent.",
    "As one high-ranking GOP official, who is white and asked for anonymity to speak frankly, puts it: \"We can't be the party of white men anymore.",
    "ET: This story has been updated to reflect that Donald Trump officially endorsed Georgia's Vernon Jones for Congress today (February 9, 2022).",
    "\"There's a lot of Black people witnessing how diabolical the Democrats are when it comes to trying to maintain their monopoly on Black folks.",
    "Experts, for example, partly attribute the outcome in Virginia to traditionally lower voter turnout among minorities in off-year elections.",
    "Still, even a slight shift away from voting Democratic is enough that Democratic strategists are starting to worry about the implications.",
    "Rigueur, for example, points out that Democrats have historically supported civil rights and focused on the concerns of Black Americans.",
    "While the GOP may entice Black voters on some issues, most continue to regard Democrats as the party that represents their interests.",
    "At least three—now called Black American Community Centers—have already opened, in Milwaukee, Cleveland and College Station, Georgia.",
    "RNC spokesperson Dennard says Klacik received party support \"she doesn't even know about\" to ensure she was covered by the media.",
    "\"There are a lot of people even now that are upset we ran in a race that was almost impossible to win and raised a lot of money.",
    "\"The more you seek elective office not based on the color of your skin but based on your message, the more you're going to win.\"",
    "They closed after the campaign ended, but McDaniel last February committed $2 million to reopen them and expand to more cities.",
    "\"We need to campaign among Hispanic, black, Asian, and gay Americans and demonstrate we care about them, too,\" the report said.",
    "\"My dad wants to understand why I'm a Republican, and I say, 'Dad, you are conservative, you've always been a conservative.",
    "The Youngkin-Sears ticket also hit on a key issue for Black voters, in promising to increase funding for the state's HBCUs.",
    "Governor Winsome Sears, sworn in last month, brings the number of Black Republicans in statewide elected offices to five.",
    "\"These are some of the tenets [of the Republican party] and when you put all that together, my dad's a conservative.\"",
    "I can hold the line on conservative Republicans and get them even more enthused about coming out to the ballot box.\"",
    "\"The fundamentals will remain that the overwhelming majority of Blacks voted Democratic, but nobody will care.\"",
    "The outcome in Virginia in 2021, Black conservatives say, is proof that the right candidates can make inroads.",
    "\"A bump up to 15 percent of Black people voting for Republicans could make some differences in certain places.",
    "Trump praised the ad, endorsed her and gave her a prime-time speaking slot at the 2020 Republican Convention.",
    "\"You can't say that Vernon Jones isn't going to support Black people's prosperity in the state of Georgia.",
    "\"I'm able to do what most Republicans cannot do, or maybe will not do, or don't know how to do,\" he says.",
    "Meanwhile another Black candidate, Kim Klacik of Baltimore, doesn't think the party is going far enough.",
    "Still, Craig, Detroit's former top cop, knows voting Republican is a tough sell, even in his own family.",
    "\"They didn't run as Black people, they ran as politicians with a message and a platform,\" Christie says.",
    "Dems: Dubious but Nervous\nNo one is predicting a mass exodus of Black voters from the Democratic Party.",
    "\"They have written off Black people or they've assumed they're going to vote for the Democratic Party.\"",
    "\"The old Republican Party would say, 'This candidate has no shot, we won't touch them,'\" Rigueur says.",
    "\"Jones could be impactful and of long-term benefit to broadening the GOP base in Georgia,\" Crane says.",
    "Elder, for instance, was labeled \"the Black face of white supremacy\" during his run to unseat Newsom.",
    "\"I don't even think Republicans expect a big shift, but any shift would be interesting,\" she says.",
    "\"I know Mr. Youngkin, every opportunity that we afforded him, he took advantage of it,\" he says.",
    "He's honing his pitch to Black voters in Michigan by talking to his father, a lifelong Democrat.",
    "They're sick of it, they're deciding to make a change, and they're deciding to run for office.\"",
    "\"Do I think that the Republican Party has done a poor job of marketing itself to Black voters?",
    "Longtime Georgia political analyst Bill Crane also thinks Jones' candidacy can help his party.",
    "Instead, many Black conservatives say, they often face bafflement and anger from Democrats.",
    "One of the most important test cases this year may come in the Michigan governor's race.",
    "\"He's run a racist campaign from start to finish,\" McAuliffe said days before he lost.",
    "Her ticket-mate, now-Governor Glenn Youngkin, garnered an also-substantial 13 percent.",
    "\"You can't say that Vernon Jones doesn't want more Black people voting,\" Pearson says.",
    "That gets him at least a hearing that white candidates from elsewhere might not get.\"",
    "What's more, the RNC expects a record-setting number of Black nominees for the House.",
    "It is about winning just enough to push them over the edge and make the difference.\"",
    "And the effort seemed to fail when he garnered a paltry 8 percent of the Black vote.",
    "\"That is absolutely fabulous that we have Black people represented in both parties.\"",
    "Not everyone in the party is on board with courting candidates and voters of color.",
    "You don't even know me, dude, I don't know you, so how dare you,'\" Donalds says.",
    "You believe in an entrepreneurial spirit, in the merit principle,'\" Craig says.",
    "\"The Democrats can keep taking people for granted at their peril,\" Sears says.",
    "If you already think you know how I will vote, then I have no political power.",
    "Another poster followed with snark: \"I demand you pander to my race as well.\"",
    "And none other than RNC Chair Ronna McDaniel showed up to fete the graduates.",
    "\"Significant\" is relative; it won't take much to sharply raise the numbers.",
    "The Trump record is complicated too, despite his outreach to Black voters.",
    "\"The message is this: Don't act as if Black people cannot be convinced.",
    "He's got a specific vision of why his race makes him the right nominee.",
    "\"We must recruit more candidates who come from minority communities.\"",
    "I just don't want you to know how I will vote based on my skin color.",
    "The story previously said the endorsement was widely anticipated.",
    "Talk about the issues, talk about how these issues benefit you.\"",
    "Trump, in some cases, can be a surprisingly helpful factor, too.",
    "The parties are ridiculously divisive,\" said a typical comment.",
    "That both parties nominated people of color for the state's No.",
    "And, experts say, longstanding reasons for that loyalty remain.",
    "Jones isn't planning to settle for being inspirational, though.",
    "We are growing the party, not compromising on our principles.\"",
    "\"But I don't even want all Black people to become Republicans.",
    "He operates by saying, 'Does this candidate agree with me?",
    "\"But that's the rhetoric that comes from the Democrats.\"",
    "Wilder went on to serve on Youngkin's transition team.",
    "Now it is time for Blacks to destroy liberalism.\"",
    "The closest 19-year-old social media star C.J.",
    "You believe we shouldn't be excessively taxed.",
    "To be sure, there were other factors at play.",
    "\"Liberals have destroyed the Black community.",
    "I want you to come and ask us for our vote.\"",
    "\"I looked at [what Biden said] like 'What?",
    "\"Why can't it just be a community center?",
    "Elder and others shrug off the backlash.",
    "\"I'm the future of the Republican Party.",
    "There won't be enough of us in a decade.",
    "You can't call Vernon Jones a racist.\"",
    "What the hell do you have to lose?\"",
    "You believe in small government.",
    "\"That's not how Trump operates.",
    "2 slot is, to Sears, thrilling.",
    "Virginia: Vanguard of Success?",
    "But he wasn't endorsing hate.\"",
    "You believe in law and order.",
    "Correction 2/9/22, 8:33 a.m.",
    "Newsweek regrets the error.",
    "You just have to try hard.\"",
    "There aren't enough of us.",
    "Indeed, North Carolina Lt.",
    "(Biden later apologized.)",
    "I don't see it that way.",
    "Update 2/9/22, 4:57 p.m.",
    "Every seat is winnable.",
    "\"Isn't that wonderful?",
    "Sears tells Newsweek.",
    "We change or we die.\"",
    "Yeah, I like them.'\"",
    "Isn't that amazing?",
    "That's progress!\"",
    "Don't condescend.",
    "Tell the truth.",
    "I do,\" he says.",
    "They can be.",
    "Virginia Lt."
  ]
}