[
  {
    "id": 1439,
    "mediaId": 2540,
    "date": "2022-02-15",
    "sentence": "“I know <span class='selected-term'>Mike Gibbons</span> will join me in demanding that Fauci is immediately fired and removed from office.”\nGeorgia GOP Rep. Marjorie Taylor Greene and others have been pushing for Fauci to be fired for months.",
    "author": "Chris Cillizza",
    "title": "2021: The year scientists became a political football"
  },
  {
    "id": 8924,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "For example, on March 15, the New York Times quoted 2013 comments from <span class='selected-term'>Mike Gibbons</span>, an investment banker who is running for the GOP nomination in Ohio’s Senate race:\nGibbons, who earned a master’s degree from the Weatherhead School of Management at Case Western Reserve University, described being in a class with “mostly Asians” during graduate school.",
    "author": "Neil Munro",
    "title": "NBC: Joe Biden Will Import Favored Ukrainians"
  },
  {
    "id": 8972,
    "mediaId": 2636,
    "date": "2022-03-28",
    "sentence": "In Ohio, <span class='selected-term'>Mike Gibbons</span>, a businessman who is leading the Senate Republican primary in some polls, is fending off allegations that he once favored outsourcing jobs to China.",
    "author": "",
    "title": "Marco Rubio Leads G.O.P. Push for a More Combative Stance on China"
  },
  {
    "id": 7347,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "On Friday, The Washington Post reported that newly unearthed footage from a media event last fall shows <span class='selected-term'>Mike Gibbons</span>, a candidate for the Republican Senate nomination in Ohio, complained that the middle class does not pay enough in taxes.",
    "author": "Matthew Chapman",
    "title": "GOP banker spends $11 million on his campaign — and whines the middle class don’t pay enough taxes: report"
  },
  {
    "id": 7425,
    "mediaId": 2695,
    "date": "2022-04-09",
    "sentence": "A spokesperson for Gibbons's campaign told TheBlaze that \"<span class='selected-term'>Mike Gibbons</span> does not support tax increases on any Americans – and never has.\"",
    "author": "Samuel Mangold-Lenett",
    "title": "Ohio Senate candidate Mike Gibbons says middle-class Americans don't pay 'any kind of fair share' of income taxes"
  },
  {
    "id": 5639,
    "mediaId": 2627,
    "date": "2022-04-12",
    "sentence": "Senate hopeful <span class='selected-term'>Mike Gibbons</span> — by some measures, the frontrunner in Ohio’s GOP primary — pledged yesterday that he will not support new taxes if elected.",
    "author": "Steve Benen",
    "title": "Ohio Republican: Middle class doesn’t pay ‘fair share’ in taxes"
  },
  {
    "id": 5311,
    "mediaId": 2550,
    "date": "2022-04-12",
    "sentence": "x\nOhio GOP Senate candidate <span class='selected-term'>Mike Gibbons</span> on a Crain’s Cleveland Business podcast:\n“The top 20% of earners in the U.S. pay 82% of federal income tax — and, you do the math, and 45% to 50% don’t pay any income tax… The middle class is not really paying any kind of a fair share.” pic.twitter.com/VUYzPTlqmX\n— Heartland Signal (@HeartlandSignal) April 8, 2022\nThis is a short blurb about Daily Kos.",
    "author": "",
    "title": "Ohio GOP Senate hopeful: Middle class isn't paying its fair share"
  }
]