[
  {
    "id": 3825,
    "mediaId": 2605,
    "date": "2022-01-24",
    "sentence": "In Arizona, the leader of House Democrats, <span class='selected-term'>Reginald Bolding</span>, is one of several candidates running against Finchem for secretary of state in an open-seat contest.",
    "author": "",
    "title": "Column: If you think 2020 chaos was bad, imagine if Trump was put in charge of elections"
  },
  {
    "id": 3640,
    "mediaId": 8475,
    "date": "2022-01-27",
    "sentence": "“House Bill 2238, I think, is probably one of the most problematic pieces of legislation we've seen thus far,” state Representative <span class='selected-term'>Reginald Bolding</span>, D-Phoenix, said.",
    "author": "Michael McDaniel",
    "title": "Voting restrictions advance in Arizona statehouse"
  },
  {
    "id": 3400,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "\"This bill is probably one of the biggest threats that we have seen here to our democracy,\" Arizona House Minority Leader <span class='selected-term'>Reginald Bolding</span>, a Democrat, said in an interview with Salon.",
    "author": "",
    "title": "Arizona bills embrace Trump conspiracy theories — could allow GOP to reject election results"
  },
  {
    "id": 2859,
    "mediaId": 2888,
    "date": "2022-01-31",
    "sentence": "“This bill is probably one of the biggest threats that we have seen here to our democracy,” Arizona House Minority Leader <span class='selected-term'>Reginald Bolding</span>, a Democrat, said in an interview with Salon.",
    "author": "Igor Derysh",
    "title": "AZ Republicans Introduce Bill Allowing Legislature to “Reject” Election Results"
  },
  {
    "id": 15552,
    "mediaId": 8475,
    "date": "2022-03-08",
    "sentence": "Previously, House Minority Leader <span class='selected-term'>Reginald Bolding</span> brought up concerns with the bill during a hearing in a House Government and Elections Committee on Jan. 26.",
    "author": "Gloria Gomez",
    "title": "GOP bills to restrict some voter registrations clear Arizona Senate committee"
  },
  {
    "id": 15545,
    "mediaId": 8475,
    "date": "2022-03-11",
    "sentence": "House Minority Leader <span class='selected-term'>Reginald Bolding</span>, D-Phoenix, called the lawsuit against Prop.",
    "author": "Jeremy Duda",
    "title": "State judge rules Arizona's voter-approved Invest in Education Act is unconstitutional"
  }
]