[
  {
    "id": 1006,
    "mediaId": 261,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "In 1994, Johnson founded <span class='selected-term'>Perry Johnson</span> Registrars, a Troy-based company that audits and certifies other firms as meeting international standards for quality management systems.",
    "author": "Paul Egan",
    "title": "'Quality guru' Perry Johnson joins crowded Republican race for Michigan governor"
  },
  {
    "id": 924,
    "mediaId": 19,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Trailing Craig and Soldano were several other candidates in the packed primary race, including businessman <span class='selected-term'>Perry Johnson</span> at eight percent, real estate broker and activist Ryan Kelly at six percent, conservative commentator Tudor Dixon at three percent, and former car dealership owner Kevin Rinke at two percent, according to the poll.",
    "author": "Ashley Oliver",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Double-Digit Lead in Michigan Governor's Primary"
  },
  {
    "id": 899,
    "mediaId": 261,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Mike Brown, of Stevensville, who submitted 21,837 signatures last Tuesday;\nNorton Shores businesswoman Tudor Dixon, who submitted 29,735 signatures Tuesday;\nOakland County \"quality guru\" and businessman <span class='selected-term'>Perry Johnson</span>, who submitted close to 23,000 signatures Tuesday;\nOttawa County real estate agent Ryan Kelley, who filed 20,100 signatures last Wednesday;\nGrand Haven financial adviser Michael Markey, who submitted 21,862 signatures March 18;\nFarmington Hills pastor Ralph Rebandt, who turned in 16,342 signatures last Tuesday;\nBloomfield Hills businessman Kevin Rinke, who filed 21,000 signatures on Monday, and\nKalamazoo chiropractor Garrett Soldano, who was the first to turn in his petition, when he submitted 20,200 signatures Jan. 19.",
    "author": "Paul Egan",
    "title": "Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "The August primary also includes two wealthy businessmen, Kevin Rinke and <span class='selected-term'>Perry Johnson</span>.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid"
  },
  {
    "id": 884,
    "mediaId": 43,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Governors\n? MI-Gov: Republican Rep. Jack Bergman, whose 1st District covers the Upper Peninsula and northernmost portion of the Lower Peninsula, has switched his endorsement in the August GOP primary from former Detroit Police Chief James Craig to self-funding businessman <span class='selected-term'>Perry Johnson</span>.",
    "author": "",
    "title": "Morning Digest: Trump's man in Georgia keeps flogging election conspiracies as his campaign craters"
  },
  {
    "id": 861,
    "mediaId": 19,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Craig is the current frontrunner in the Republican primary, but the primary field is packed with other candidates, including chiropractor Garrett Soldano, businessman <span class='selected-term'>Perry Johnson</span>, real estate broker and activist Ryan Kelley, conservative commentator Tudor Dixon, and former car dealership owner Kevin Rinke.",
    "author": "Ashley Oliver",
    "title": "Poll: Michigan Democrat Gretchen Whitmer Trails Republican on Generic Ballot for Governor's Race"
  },
  {
    "id": 7300,
    "mediaId": 261,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "The reports also say that Oakland County businessman and \"quality guru\" <span class='selected-term'>Perry Johnson</span> did not file enough valid signatures, but they clear Norton Shores businesswoman Tudor Dixon, whose petitions were also the subject of a complaint.",
    "author": "Paul Egan",
    "title": "State elections report: James Craig and Perry Johnson filed too few signatures for ballot"
  }
]