[
  {
    "id": 8662,
    "mediaId": 195,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "The browser does not support the specified video codec\n<span class='selected-term'>Perry Johnson</span>, a Republican candidate for governor in Michigan, lost a bid on Wednesday to get placed on the primary ballot after a court ruled he used fraudulent signatures on a petition to qualify for the race.",
    "author": "Brad Dress",
    "title": "Republican candidate in Michigan governor race loses bid to get placed on primary ballot",
    "sentiment": "0"
  },
  {
    "id": 8663,
    "mediaId": 238,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "The Michigan Court of Appeals has unanimously rejected a legal challenge from <span class='selected-term'>Perry Johnson</span>, a former leading GOP candidate for Michigan governor, who was one of five Republicans disqualified from the ballot because of invalid signatures on their nominating petitions.",
    "author": "Amy B Wang",
    "title": "Mich. GOP candidate ruled ineligible for ballot after fraudulent petitions",
    "sentiment": "0"
  },
  {
    "id": 8664,
    "mediaId": 261,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "Oakland County businessman and GOP gubernatorial hopeful <span class='selected-term'>Perry Johnson</span> should not appear on the ballot for the upcoming August primary election, the Michigan Court of Appeals ruled Wednesday.",
    "author": "Arpan Lobo",
    "title": "Michigan Court of Appeals: Perry Johnson doesn't qualify for August primary ballot",
    "sentiment": "0"
  },
  {
    "id": 8668,
    "mediaId": 261,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "Here is where each remaining candidate's challenge currently stands:\n<span class='selected-term'>Perry Johnson</span>\nJohnson filed a lawsuit Friday in the Michigan Court of Appeals alleging that the review of the signatures he submitted to qualify for the primary ballot violated state election law because a signature-by-signature review comparing the one on the petition with the one on the voter's registration file was not carried out.",
    "author": "Arpan Lobo",
    "title": "Disqualified Republican governor hopefuls battle it out in court",
    "sentiment": "0"
  },
  {
    "id": 8670,
    "mediaId": 157,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "The Michigan Court of Appeals unanimously denied a request from businessman <span class='selected-term'>Perry Johnson</span> to provide him a path back onto the ballot.",
    "author": "Jon King",
    "title": "Michigan 'quality guru' Perry Johnson remains off August primary ballot after unanimous court ruling",
    "sentiment": "0"
  },
  {
    "id": 8660,
    "mediaId": 261,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "The Court of Claims decision mirrors Wednesday rulings from the Michigan Court of Appeals, which denied similar appeals from GOP gubernatorial hopefuls Oakland County businessman <span class='selected-term'>Perry Johnson</span> and Grand Haven financial adviser Michael Markey.",
    "author": "Arpan Lobo",
    "title": "James Craig loses bid to appear on primary ballot after Michigan court denies appeal",
    "sentiment": "-0.592"
  }
]