[
  {
    "id": 877,
    "mediaId": 124,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "In a trio of complaints filed this week, attorneys working with the state Democratic Party said they found problems with the nominating petitions filed by former Detroit police chief James Craig, businessman <span class='selected-term'>Perry Johnson</span> and conservative commentator Tudor Dixon  enough to disqualify all three from the Aug. 2 primary, they argue.",
    "author": "",
    "title": "Michigan Democrats accuse GOP candidates of using forged signatures to get on ballot",
    "sentiment": "0"
  },
  {
    "id": 3296,
    "mediaId": 261,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Challenges have also been filed to the nominating petitions of Dixon, of Norton Shores, and Oakland County businessman <span class='selected-term'>Perry Johnson</span>.",
    "author": "Paul Egan",
    "title": "James Craig acknowledges possible fraud in signature gathering for his petition",
    "sentiment": "0"
  },
  {
    "id": 7301,
    "mediaId": 98,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "The recommendations immediately transformed the race in the battleground state and dealt a major blow to former Detroit Police Chief James Craig, who has led in polling despite campaign problems, and businessman <span class='selected-term'>Perry Johnson</span>, who has spent millions of his own money to run.",
    "author": "DAVID EGGERT",
    "title": "Primary problem: Michigan GOP governor candidates short signatures",
    "sentiment": "0"
  },
  {
    "id": 7300,
    "mediaId": 261,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "The reports also say that Oakland County businessman and \"quality guru\" <span class='selected-term'>Perry Johnson</span> did not file enough valid signatures, but they clear Norton Shores businesswoman Tudor Dixon, whose petitions were also the subject of a complaint.",
    "author": "Paul Egan",
    "title": "State elections report: James Craig and Perry Johnson filed too few signatures for ballot",
    "sentiment": "0"
  },
  {
    "id": 7473,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Brown, as well as financial adviser Michael Markey, former Detroit Police Chief James Craig, businesswoman Donna Brandenburg and self-described quality guru <span class='selected-term'>Perry Johnson</span>, all had signatures that the bureau recommended to be deemed insufficient as many were fraudulent.",
    "author": "",
    "title": "GOP candidates deemed ineligible as massive signature fraud scandal upends Michigan gubernatorial race",
    "sentiment": "0"
  },
  {
    "id": 8433,
    "mediaId": 169,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "The Michigan Bureau of Elections released a report on Monday recommending that leading Republican gubernatorial candidates James Craig and <span class='selected-term'>Perry Johnson</span>, as well as three others, be disqualified from the ballot after submitting too many fake petition signatures.",
    "author": "Igor Derysh",
    "title": "Embarrassing: Even Republicans fume at Michigan GOP for defending candidates busted for fraud",
    "sentiment": "0"
  },
  {
    "id": 8435,
    "mediaId": 157,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "The Michigan Bureau of Elections released a report on Monday recommending that leading Republican gubernatorial candidates James Craig and <span class='selected-term'>Perry Johnson</span>, as well as three others, be disqualified from the ballot after submitting too many fake petition signatures.",
    "author": "Igor Derysh",
    "title": "GOP election lawyer accuses Michigan Republicans of 'despicable abuse'",
    "sentiment": "0"
  },
  {
    "id": 8670,
    "mediaId": 157,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "The Michigan Court of Appeals unanimously denied a request from businessman <span class='selected-term'>Perry Johnson</span> to provide him a path back onto the ballot.",
    "author": "Jon King",
    "title": "Michigan 'quality guru' Perry Johnson remains off August primary ballot after unanimous court ruling",
    "sentiment": "0"
  }
]