[
  {
    "id": 7103,
    "mediaId": 3986,
    "date": "2022-01-19",
    "sentence": "In a new campaign ad, the SEAL PAC said the SEAL veterans Ryan Zinke, Brady Duke, Derrick Van Orden, <span class='selected-term'>Eli Crane</span>, Morgan Luttrell and Ed Thelander “have one grave threat left to defeat” over an image of House Speaker Nancy Pelosi (D-CA).",
    "author": "Ryan Morgan",
    "title": "Video: 6 SEAL vets running for Congress vow to take on ‘grave threat’ Pelosi in new ad"
  },
  {
    "id": 6503,
    "mediaId": 2642,
    "date": "2022-01-19",
    "sentence": "MORE NEWS: Pelosi’s House of Cards Just Took Two More Brutal Hits… Her Kingdom is Collapsing\nThe ad features the following six SEAL veterans running in this year’s midterms: Morgan Luttrell (running in Texas’ eighth district), Brady Duke (running in Florida’s seventh district), <span class='selected-term'>Eli Crane</span> (running in Arizona’s second district), Derrick Van Orden (running in Wisconsin’s third district), Ed Thelander (running in Maine’s first district), and Ryan Zinke (running in Montana’s first district).",
    "author": "Missy Crane",
    "title": "Watch: Navy Seals Unite to Bring Down Nancy Pelosi in Powerful New Video"
  },
  {
    "id": 6589,
    "mediaId": 2748,
    "date": "2022-01-20",
    "sentence": "According to the SEAL PAC website, they are:\n<span class='selected-term'>Eli Crane</span> is running in Arizona’s 1st Congressional District; Brady Duke in Florida’s 7th Congressional District; Ed Thelander in Maine’s 1st Congressional District; Ryan Zinke in Montana’s 1st Congressional District; Morgan Luttrell, in Texas’ 8th Congressional District; and Derrick Van Orden in Wisconsin’s 3rd Congressional District.",
    "author": "STATION GOSSIP",
    "title": "Six Ex-Navy SEALs Running for Congress Unite to Take on 'Grave Threat' Nancy Pelosi"
  },
  {
    "id": 7228,
    "mediaId": 2896,
    "date": "2022-01-23",
    "sentence": "As SEAL PAC Chairmen, I take our mission very seriously and we are working to elect a conservative majority to Congress to get America headed in the right direction again.”\n\nAs Breitbart reported, “The ad features the following six SEAL veterans running in this year’s midterms: Morgan Luttrell (running in Texas’ eighth district), Brady Duke (running in Florida’s seventh district), <span class='selected-term'>Eli Crane</span> (running in Arizona’s second district), Derrick Van Orden (running in Wisconsin’s third district), Ed Thelander (running in Maine’s first district), and Ryan Zinke (running in Montana’s first district).”\n\nThe PAC, SEAL PAC, supports conservative military veterans running for Congress.",
    "author": "",
    "title": "WATCH: Navy SEALs Decimate Pelosi In Epic Video"
  },
  {
    "id": 7227,
    "mediaId": 2861,
    "date": "2022-01-24",
    "sentence": "The six SEALs, who include Morgan Luttrell of Texas’ 8th Congressional District, Brady Duke of Florida’s 7th District, <span class='selected-term'>Eli Crane</span> of Arizona’s 2nd District, Derrick Van Orden of Wisconsin’s 3rd District, Ed Thelander of Maine’s 1st District, and Ryan Zinke of Montana’s 1st District, said in a new ad that Pelosi is the “one grave threat” they still face.",
    "author": "A.M. Smith, You Are Going To Send Email To, Move Comment",
    "title": "Nasty Nancy Is On The Hot Seat After Six Retired Navy SEALs Launch Congressional Bids to End Her Reign"
  },
  {
    "id": 7154,
    "mediaId": 2929,
    "date": "2022-01-28",
    "sentence": "The six are, Morgan Luttrell (Texas’ eighth district), Brady Duke (Florida’s seventh district), <span class='selected-term'>Eli Crane</span> (Arizona’s second district), Derrick Van Orden (Wisconsin’s third district), Ed Thelander (Maine’s first district), and Ryan Zinke (Montana’s first district).",
    "author": "Joseph Ragonese",
    "title": "One final battle: Six former Navy SEALs identify America’s biggest threat"
  },
  {
    "id": 6045,
    "mediaId": 2528,
    "date": "2022-02-02",
    "sentence": "Meanwhile, <span class='selected-term'>Eli Crane</span>, a former Navy SEAL, leads the GOP field with just over $810,000 in funds raised.",
    "author": "Cheryl Teh",
    "title": "QAnon leader Ron Watkins claimed he would raise $1 million dollars while running for Congress. He's raised just over $30,000."
  },
  {
    "id": 5656,
    "mediaId": 2643,
    "date": "2022-02-02",
    "sentence": "Of the other Republicans running, <span class='selected-term'>Eli Crane</span> has raised $810,385 and Douglas Lowell $125,425.",
    "author": "Jake Thomas",
    "title": "Congressional Fundraising Falling Flat for Man Featured in HBO QAnon Doc"
  },
  {
    "id": 5988,
    "mediaId": 2594,
    "date": "2022-02-03",
    "sentence": "The front runner in the Arizona race is currently former Navy SEAL <span class='selected-term'>Eli Crane</span>, who has already raised over $800,000.",
    "author": "Graig Graziosi",
    "title": "Alleged QAnon mastermind’s fundraising filing shows he raised just $33,000"
  },
  {
    "id": 5684,
    "mediaId": 2662,
    "date": "2022-02-06",
    "sentence": "Watkins: In District Two, I’m mainly running against Blackman and <span class='selected-term'>Eli crane</span>.",
    "author": "Jordan Conradson",
    "title": "“Without Election Integrity We Have a Dictatorship” – Congressional Candidate Code Monkey Z Ron Watkins Speaks with TGP’s Jordan Conradson on His Campaign (VIDEO)"
  },
  {
    "id": 5572,
    "mediaId": 2614,
    "date": "2022-02-11",
    "sentence": "Republican congressional candidates like Derrick Van Orden and <span class='selected-term'>Eli Crane</span> know as well.",
    "author": "SteveGruber.com",
    "title": "Chicken Hawks Flapping On Ukraine"
  },
  {
    "id": 4793,
    "mediaId": 2578,
    "date": "2022-02-16",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nIn an op-ed on Warroom.org, Crane writes, “Any Republican who refuses to support this resolution cannot call themselves a fighter for the America First agenda or the MAGA movement.”\nThe Gateway Pundit correspondent Jordan Conradson spoke to <span class='selected-term'>Eli Crane</span> about his campaign and the decertification of Arizona.",
    "author": "Jordan Conradson",
    "title": "Exclusive Interview With U.S. Congressional Candidate Eli Crane on The RINOS In AZ: “You Guys Have Seen The Fraud. You Know, It’s There.”"
  },
  {
    "id": 4580,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "New Joint Fundraisers\nThe Emmer Hill Committee (Reps. Tom Emmer, French Hill)\nGT Farm Team 2022 (Reps. Don Bacon, Jim Baird, Mike Bost, Rodney Davis, Jim Hagedorn)\nVan Orden Crane Victory Fund (<span class='selected-term'>Eli Crane</span> for Congress, Van Orden for Congress)\nNew PACs\nSave Glendora Schools (PAC)\nTotal Community Options Inc. dba InnovAge PAC (PAC)\nNew Lobbying Registrations\nAlston & Bird LLP: Gaggle\nBracewell LLP: Match Group Holdings I, LLC\nBrownstein Hyatt Farber Schreck, LLP: Tapestryhealth\nCarmen Group Incorporated: Digital Gadgets\nCornerstone Government Affairs, Inc.: Atlanta University Consortium Center, Inc.",
    "author": "",
    "title": "Ballard to fundraise for potential Ways and Means chair"
  },
  {
    "id": 2180,
    "mediaId": 2658,
    "date": "2022-03-21",
    "sentence": "Cory Booker, Kirsten Gillibrand)\nCVD Victory Fund (Rep. Beth Van Duyne, <span class='selected-term'>Eli Crane</span> for Congress)\nPalazzo Victory Fund (Palazzo for Congress, Patriot Political Action Committee, NRCC)\nTake Back the House California 2022 (Reps. Kevin McCarthy, Mike Garcia, Young Kim, David Valadao, Ken Calvert, Michelle Steel, Scott Baugh for Congress, Matt Jacobs for Congress, Majority Committee PAC MC PAC, NRCC, TAKE BACK CA-03 REPUBLICAN NOMINEE FUND 2022, TAKE BACK CA-13 REPUBLICAN NOMINEE FUND 2022, TAKE BACK CA-09 REPUBLICAN NOMINEE FUND 2022, TAKE BACK CA-49 REPUBLICAN NOMINEE FUND 2022, CALIFORNIA REPUBLICAN PARTY FEDERAL ACCT. )",
    "author": "",
    "title": "Republicans hammer at dark money groups in opening statements"
  },
  {
    "id": 1996,
    "mediaId": 2658,
    "date": "2022-03-22",
    "sentence": "New Joint Fundraisers\nKistner Victory Committee (KISTNER FOR CONGRESS, Service Knowledge Oath Leadership PAC (SKOL PAC), NRCC)\nMary Miller Victory Committee (Rep. Mary Miller, House Freedom Fund, Faith in America PAC)\nValor Honor Country Fund (Van Orden for Congress, <span class='selected-term'>Eli Crane</span> for Congress, The Pat Harrigan Committee)\nNew PACs\nFinancial Freedom PAC (Hybrid PAC)\nHispanic Leadership Trust (PAC)\nLouisville for Public Safety (Super PAC)\nThe Reparations Pledge (Super PAC)\nThe Right Voice For New Jersey (Super PAC)\nStand for Freedom PAC (Super PAC)\nNew Lobbying Registrations\n90 West LLC: Woodwell Climate Research Center\nAlta Crest LLC: American Postal Infrastructure\nAlta Crest LLC: Specialist Telemed\nBlank Rome Government Relations: Chunker\nBradley Arant Boult Cummings LLP: The City Of Eufaula\nCornerstone Government Affairs, Inc.: Nurse-Family Partnership\nCypress Advocacy, LLC: Meta Platforms, Inc.\nDentons US LLP: Dc Water\nForis, Inc And Its Affiliated Entity, Foris Dax, Inc. D/B/A Crypto.Com: Foris, Inc And Its Affiliated Entity, Foris Dax, Inc. D/B/A Crypto.Com\nFranklin Square Group, LLC: Helion Energy, Inc.\nHolland & Knight LLP: Quicktrip Corporation\nLiberty Partners Group, LLC: Revenue Cycle Coding Strategies And Rc Billing\nPort Side Strategies, LLC: New Venture Fund\nRidge Policy Group: The Coalition For App Fairness\nSidley Austin LLP: Foris Dax, Inc. D/B/A Crypto.Com\nSquire Patton Boggs: Stellant Systems\nStarzyk & Associates, LLC: Santee Sioux Nation\nSubject Matter (Fka Elmendorf Ryan): Northrop Grumman Systems Corporation\nThe Livingston Group, LLC: Health Supply US, LLC\nValneva USa, Inc.: Valneva USa, Inc.\nNew Lobbying Terminations\nAlta Crest LLC: Oregon Institute Of Technology\nAlta Crest LLC: The Austin Center For Manufacturing & Innovation\nAlta Crest LLC: Ursa Major Technologies\nAmerican Public University System: American Public University System\nBrody Group L.L.C.",
    "author": "",
    "title": "Meta hires former Trump White House aide, Issue One hires Lott"
  },
  {
    "id": 1960,
    "mediaId": 2731,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Eli Crane",
    "title": "Fixing the 2020 Election"
  },
  {
    "id": 493,
    "mediaId": 2649,
    "date": "2022-04-20",
    "sentence": "Republican candidate and former Navy SEAL <span class='selected-term'>Eli Crane</span> raised $$647,000 in the quarter, and has $483,000 cash on hand.",
    "author": "William Gavin",
    "title": "QAnon figure Ron Watkins gave a $95,000 loan to his House campaign in Arizona"
  },
  {
    "id": 836,
    "mediaId": 5308,
    "date": "2022-04-22",
    "sentence": "Republican primary candidate and former Navy SEAL <span class='selected-term'>Eli Crane</span> raised $647,000 and has $483,000 cash on hand.",
    "author": "David Gilbert",
    "title": "He’s spent $21,000 on AirBNBs and over $3,000 hiring guns for photoshoots."
  }
]