[
  {
    "id": 4580,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "New Joint Fundraisers\nThe Emmer Hill Committee (Reps. Tom Emmer, French Hill)\nGT Farm Team 2022 (Reps. Don Bacon, Jim Baird, Mike Bost, Rodney Davis, Jim Hagedorn)\nVan Orden Crane Victory Fund (<span class='selected-term'>Eli Crane</span> for Congress, Van Orden for Congress)\nNew PACs\nSave Glendora Schools (PAC)\nTotal Community Options Inc. dba InnovAge PAC (PAC)\nNew Lobbying Registrations\nAlston & Bird LLP: Gaggle\nBracewell LLP: Match Group Holdings I, LLC\nBrownstein Hyatt Farber Schreck, LLP: Tapestryhealth\nCarmen Group Incorporated: Digital Gadgets\nCornerstone Government Affairs, Inc.: Atlanta University Consortium Center, Inc.",
    "author": "",
    "title": "Ballard to fundraise for potential Ways and Means chair"
  },
  {
    "id": 2180,
    "mediaId": 2658,
    "date": "2022-03-21",
    "sentence": "Cory Booker, Kirsten Gillibrand)\nCVD Victory Fund (Rep. Beth Van Duyne, <span class='selected-term'>Eli Crane</span> for Congress)\nPalazzo Victory Fund (Palazzo for Congress, Patriot Political Action Committee, NRCC)\nTake Back the House California 2022 (Reps. Kevin McCarthy, Mike Garcia, Young Kim, David Valadao, Ken Calvert, Michelle Steel, Scott Baugh for Congress, Matt Jacobs for Congress, Majority Committee PAC MC PAC, NRCC, TAKE BACK CA-03 REPUBLICAN NOMINEE FUND 2022, TAKE BACK CA-13 REPUBLICAN NOMINEE FUND 2022, TAKE BACK CA-09 REPUBLICAN NOMINEE FUND 2022, TAKE BACK CA-49 REPUBLICAN NOMINEE FUND 2022, CALIFORNIA REPUBLICAN PARTY FEDERAL ACCT. )",
    "author": "",
    "title": "Republicans hammer at dark money groups in opening statements"
  },
  {
    "id": 493,
    "mediaId": 2649,
    "date": "2022-04-20",
    "sentence": "Republican candidate and former Navy SEAL <span class='selected-term'>Eli Crane</span> raised $$647,000 in the quarter, and has $483,000 cash on hand.",
    "author": "William Gavin",
    "title": "QAnon figure Ron Watkins gave a $95,000 loan to his House campaign in Arizona"
  }
]