{
  "id": 10035,
  "mediaId": 2658,
  "date": "2022-04-01",
  "headline": "House passes marijuana legalization bill (again), but with no clear path forward",
  "image": "https://static.politico.com/56/19/918525dd40deb4a94dc75a1647fe/https-delivery.gettyimages.com/downloads/1326992861",
  "link": "https://www.politico.com/news/2022/04/01/house-passes-marijuana-legalization-bill-again-but-with-no-clear-path-forward-00022303",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    2662,
    4593,
    2976,
    2964,
    3246,
    3499,
    1489,
    1477
  ],
  "sentences": [
    "“Nonetheless, if I have to choose between nothing and something that, going forward, will not put our children, our neighbors or friends in jail — I’ll choose the latter.”\nWorking across the aisle\nConspicuously absent from the “ayes” on Friday were some of the most pro-cannabis Republican voices on Capitol Hill, including Mace and Rep. Dave Joyce of Ohio, a co-chair of the Congressional Cannabis Caucus.",
    "“This bill is a matter of justice and equal opportunity… so that Americans and America can become a better, stronger, more fair, and more just America.”\nMajority Leader Chuck Schumer plans to introduce his own cannabis bill soon, but does not currently have the Democrat votes to pass it, let alone the Republicans needed to overcome a filibuster.",
    "The MORE Act debate underlined a fundamental question that divides the parties: When changing the nation’s drug laws, should the federal government also take steps to provide financial incentives to individuals and communities who were most harshly impacted by the war on drugs?",
    "“You’re not going to be able to get Republicans on board… the way that the MORE Act is done,” said Rep. Nancy Mace (R-S.C.), who introduced a bill last year that decriminalizes cannabis and expunges some records but does not create federal grant programs.",
    "Mace says her cannabis reform bill — the States Reform Act — polls better among Republican primary voters in her district than broad federal legalization, but she is also facing a tough primary in May and was on her support for cannabis legalization.",
    "In her weekly news conference, she touted the criminal justice and economic provisions of the bill, and explained that the lack of similar provisions in the George Floyd Justice in Policing Act was one reason that it failed in the upper chamber.",
    "It marks the second time in less than two years that the House passed legislation to decriminalize cannabis, scrap some old marijuana-related convictions and allow states to make their own decisions about whether to establish marijuana markets.",
    "But Democrats’ pursuit of their perfect bill worries some pro-cannabis lawmakers and advocates, who do not see a clear path forward for sweeping drug policy changes under Republican leadership in either chamber — especially the Senate.",
    "Joyce’s office circulated a memo among Republicans earlier this week outlining his critiques of the MORE Act and why he intended to vote against it — and inviting discussion on Republican approaches to marijuana policy.",
    "Despite growing support among GOP lawmakers for legalization and polling that shows two-thirds of Americans back that stance, just three Republicans voted for the Marijuana Opportunity Reinvestment and Expungement Act.",
    "“So negotiating that away — to leave [affected communities] behind — that to me is just immoral.”\nIn fact, House Speaker Nancy Pelosi on Thursday went so far as to frame the MORE Act as a criminal justice reform bill.",
    "Booker and Schumer have drawn a line in the sand on marijuana policy, refusing to even hold a hearing on a cannabis banking bill the House has approved six times because it does not address criminal justice reform.",
    "His office told POLITICO that the chair asked many Republican lawmakers to cosponsor the MORE Act, but did not answer questions about the letter from Joyce or requests from Republicans to change the bill.",
    "“I was a supporter of the War on Drugs — I’ve been here a long time,” House Majority Leader Steny Hoyer said on the House floor on Friday, pointing out that to be arrested for low level cannabis crimes.",
    "He sent a letter to Judiciary Chair Jerry Nadler (D-N.Y.), the chief sponsor of the MORE Act, in February — offering to work with him to create a bill that was more palatable to Republicans.",
    "“I think it’s clear that Democrats understand that this is something that actually helps them politically,” said Rep. Earl Blumenauer (D-Ore.), the unofficial cannabis dean on Capitol Hill.",
    "It’s unclear how many additional Republican votes Mace and Joyce could bring to the legislation — between their two decriminalization bills they have four additional Republican cosponsors.",
    "“You’ve got to have Republicans on board if we’re going to have any chance of getting it done in the Senate.”\nFor many Democrats, however, the equity grant programs are nonnegotiable.",
    "But Joyce’s office said the bill, as it stands, is “too impractical and too flawed” to even start a conversation with GOP members who are interested in changing America’s drug laws.",
    "The House passed a far-reaching marijuana legalization bill on Friday by a 220-204 vote, largely along party lines and still with no real path to President Joe Biden’s desk.",
    "The Senate — where Schumer, Sen. Cory Booker (D-N.J.) and Sen. Ron Wyden (D-Ore.), are working on their own comprehensive cannabis bill — is even tougher ground for weed.",
    "Joyce’s office said they also had one meeting with Nadler’s staff to discuss their primary concerns with the bill, but were not invited back for any further discussion.",
    "But Democrats seem no closer to fulfilling , passing a party-line bill that has little chance of getting the necessary Republican support to pass the Senate.",
    "Given that Democrats may not control both houses of Congress come January, the window for federal cannabis policy change may not be open much longer.",
    "“We need those social equity programs,” one moderate Democrat lawmaker said, granted anonymity to speak candidly about his leadership’s strategy.",
    "“This is a major criminal justice reform bill,” said Rep. Barbara Lee (D-Calif.), one of the co-chairs of the Congressional Cannabis Caucus.",
    "Joyce’s office said he reached out to Democrats to try and forge consensus on the best approach to overhauling federal cannabis laws.",
    "When a vote on the bill was scheduled in September 2020, , worried that voting to legalize weed could hurt their reelection chances.",
    "Today’s vote highlighted the growing rift between the parties — and even among Democrats — on how to address cannabis policy.",
    "Dems come around\nDespite declining GOP support for the MORE Act, Democrats’ nerves on cannabis legislation have calmed.",
    "But the politics around cannabis have changed so rapidly nationwide that those concerns appear to have evaporated.",
    "One of the lawmakers who previously voted against the bill — Rep. Conor Lamb of Pennsylvania — with Lt. Gov.",
    "“And opposition hurts them politically, at least in Democratic primaries and with Republican swing voters.”",
    "In fact, six Democrats voted against the bill in 2020, but only two voted against the MORE Act on Friday.",
    "That was fewer than the five GOP lawmakers who backed the bill in 2020 — two are no longer in Congress.",
    "Fetterman has campaigned vocally on cannabis legalization, both for his state and federally.",
    "The federal social equity efforts were a major reason for her “nay” vote on Friday.",
    "John Fetterman for the Democratic nomination for Pennsylvania’s open Senate seat.",
    "Nadler’s office declined an interview request for this story.",
    "This time around, Lamb voted in favor of the bill.",
    "Republicans say no."
  ]
}