{
  "id": 10226,
  "mediaId": 2659,
  "date": "2022-04-01",
  "headline": "Conor Lamb Gets Ugly On John Fetterman In PA Democratic Senate Primary",
  "image": "https://www.politicususa.com/wp-content/uploads/2022/04/fetterman-lamb.jpg",
  "link": "https://www.politicususa.com/2022/04/01/conor-lamb-gets-ugly-on-john-fetterman-in-pa-democratic-senate-primary.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Easley",
  "authorUrl": "",
  "termIds": [
    4080,
    3989,
    1126,
    6001
  ],
  "sentences": [
    "Every day it gets harder and harder for Conor Lamb to keep screaming that he is a winner when he’s clearly losing this race.”\nThe latest Emerson College Poll found that Fetterman leads Lamb 33%-10%, but 37% of Democratic primary voters are undecided.",
    "Fetterman is already doing three other debates in the month of April, so it is strains credibility to believe that he is skipping this one debate because he is afraid to answer questions about the incident, but he is doing three others.",
    "— Conor Lamb (@ConorLambPA) March 31, 2022\nThe Fetterman campaign responded, “There are better ways to handle losing an election than what Conor Lamb is doing.",
    "Fetterman’s claim that he was protecting his family could play very well with voters in the state, especially Western and Central PA rural voters.",
    "Conor Lamb is currently losing the primary, and if he goes scorched earth on Fetterman, it could cost Democrats votes in the general election.",
    "Lamb is starting to look a little desperate, and it is difficult to see how his current tactics will win him more Democratic voters in May.",
    "John Fetterman of skipping an upcoming debate because he is avoiding questions about a 2013 incident in Braddock.",
    "If Rep. Lamb were winning, he wouldn’t care if Fetterman would be at the debate at Muhlenberg College on Sunday.",
    "Lamb tweeted:\nUnlike John, I've faced Republicans in tough races before — & beaten them three times in a row.",
    "The congressman thinks that he can peel off black primary voters by bringing up the 2013 incident.",
    "The high number of undecided primary voters is why Lamb is going on the attack.",
    "They've spent millions trying new ways to attack me, and failed.",
    "Rep. Conor Lamb accused Lt. Gov.",
    "You know what you get with me.",
    "I'm ready to win in November.",
    "You don’t with Fetterman.",
    "Fetterman isn't."
  ]
}