{
  "id": 10277,
  "mediaId": 2589,
  "date": "2022-03-30",
  "headline": "Progressive Dem candidates: Please don't call us \"progressive\"",
  "image": "https://media.townhall.com/townhall/reu/o/2021/41/acc309ea-648e-48e4-85ac-a30649cdb639-1110x740.jpg",
  "link": "https://hotair.com/allahpundit/2022/03/30/progressive-dem-candidates-please-dont-call-us-progressive-n459072",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allahpundit",
  "authorUrl": "https://hotair.com/author/allahpundit",
  "termIds": [
    0
  ],
  "sentences": [
    "Your must-read today (although it’s a week old) is Ruy Teixeira’s diagnosis of “The Democrats’ Common Sense Problem.” Teixeira is a liberal — his site is called “The Liberal Patriot” — but he’s spent the past year tearing his hair out at progressives’ insistence on taking esoteric positions on cultural issues that are destined to alienate huge majorities for seeming not just radical but lacking in all common sense.",
    "Left-wing candidates from Pennsylvania to North Carolina to Missouri are shying away from the P-word on the campaign trail, in messaging and online fundraising, and even in media blitzes, signaling an attempt to rebrand their wing of the party as Democrats debate how to win the midterm elections…\nWhile some high-profile contenders still use the moniker, others want to be thought of in different terms.",
    "Voters in these areas, this person said, aren’t consumed with the detailed policy proposals that excite many national progressives in Washington, D.C., and prefer an anti-establishment, against-the-system sentiment…\n“It is a reaction to progressivism somehow being attached to socialism or communism,” said [Dwight] Bullard.",
    "John Fetterman, who’s seeking the party’s nomination for a coveted Senate seat, prefers a different word: populist…\nA source close to another self-styled Midwestern populist described “two lanes of populism” taking hold as contenders look for more accurate ways to portray what’s unfolding in their regions.",
    "Check out the numbers here on whether voters are more or less likely to support a candidate who wants to fund/defund the police and drill for oil and you’ll see why progressive candidates aren’t eager to identify that way:\nAmericans are +52 on candidates who support drilling.",
    "Not only does it distance you from prominent progressives like the Squad and Bernie Sanders, it may even put some distance between you and a very unpopular president:\nQuinnipiac poll: Joe Biden's job approval drops four net points to 36-55 among all adults (was 38-53).",
    "This reminds me of polls you’d occasionally see back in the early days of ObamaCare when people would be asked if they support the provisions of the Affordable Care Act, foremost of which was eligibility for health insurance regardless of preexisting conditions.",
    "— The Wokest Numbersmuncher (@NumbersMuncher) March 30, 2022\nBiden isn’t really a progressive but his agenda last year certainly was, leading many to conclude that he’s been captured by the left even if he doesn’t share all of their political views.",
    "Especially the giant Shrek-looking dude running in Pennsylvania, who’s as intimidating as a pro wrestler and may well win the state’s Senate race provided that voters don’t find out that he’s about as far left as AOC and Ilhan Omar.",
    "That’s not to suggest that O-Care was good on the merits and would have been seen as such if only Democrats had a better “brand.” But it is to suggest that the a particular brand can be a huge liability with swing voters.",
    "Democrats are associated with a wave of progressive public prosecutors who seem quite hesitant about keeping criminals off the street, even as a spike in violent crimes like murders and carjacking sweeps the nation.",
    "Nor do they respond well to assurances that progressive approaches to law enforcement that include less law enforcement will—eventually—work even as crime surges and the quality of life deteriorates.",
    "I bet if we could separate Biden primary voters from Sanders/Warren primary voters in the Democratic group there we’d find a divide not unlike the divides NBC found on drilling and the police.",
    "And Fetterman and his fellow candidates know it, and fear the suspicion with which normie voters will come to view them if they become associated with progressivism in the public’s mind.",
    "They’re not particularly impressed by disembodied talk about the availability of guns that does not include enforcing the law against the criminals who actually use these guns.",
    "NBC has a fascinating poll today comparing where the Biden wing of the Democratic Party stands on certain important issues to where the progressive Bernie/Warren wing stands.",
    "On the opposite question, whether voters are more or less likely to support a candidate who wants to *defund* the police, Biden voters are -47 while progressives are +4.",
    "“You have a lot of apprehension, regression, people who just are scared.”\nOne Democratic candidate describes herself as a “New Deal” Dem rather than as a progressive.",
    "This is twinned to a climate of tolerance and non-prosecution for lesser crimes that is degrading the quality of life in many cities under Democratic control.",
    "If you follow social media commentary on Florida’s “don’t say gay” bill, you would think it was a 50/50 issue *at best* for Republicans.",
    "Nowhere is the departure of Democrats from the common sense of ordinary voters more evident than on the issue of crime and policing.",
    "Don’t think of them as “progressives” or “leftists” or “Democrats” or any of the other things swing voters have grown to hate.",
    "Police misconduct and brutality against people of any race is wrong and we need to reform police conduct and recruitment.",
    "Ordinary voters don’t want the crime issue racialized, they simply want it stopped and they know you need cops to do it.",
    "By the time we get to November, Fetterman and the rest might not even be advertising themselves as Democrats anymore.",
    "Inflation is the top concern for Americans at 30% with the invasion of Ukraine (14%) and immigration (9%) behind it.",
    "More and better policing is needed for public safety and that cannot be provided by “defunding the police”.",
    "This included 64-24 support among whites, but also 2:1 support among blacks, Hispanics and Asians.",
    "For Fetterman and the rest, “populist” may provide a degree of independence from the White House.",
    "Joe Biden’s base is in tune with the broader public’s concerns about crime and how to handle it.",
    "Reflecting these views, voters in the Massachusetts poll endorsed the statement above by 63-26.",
    "There’s a double benefit to switching out that label for something like “populist,” I think.",
    "Right now the progressive brand isn’t great in jurisdictions that are less than indigo blue.",
    "And so this fall’s progressive candidates are … transitioning, for lack of a better word.",
    "He lists several examples but his paradigm case is defunding the police, of course:\n6.",
    "On crime, the American public is +64 on candidates who want to fund the police.",
    "The fact is that ordinary voters hate crime and want something done about it.",
    "Then the pollster would ask, “Do you support ObamaCare?” Answer: Hell, no.",
    "Just think of them as … populists, of no particular partisan persuasion.",
    "They may have been born progressive but they identify as populist.",
    "Voters are +37 against defunding the police — in Massachusetts.",
    "Approval on the economy holds steady at a very low 34-58.",
    "Biden voters are even more lopsidedly in favor at +75.",
    "Sure, that sounds pretty good, many would say.",
    "Here’s another poll floating around today.",
    "Sanders/Warren voters are … -13.",
    "And savvy progressives know it.",
    "Americans overall are -56.",
    "It is not a 50/50 issue.",
    "Pennsylvania’s Lt. Gov.",
    "Biden’s voters are +36.",
    "Support would plummet.",
    "Progressive Democrats?",
    "The left is not.",
    "They’re at -5."
  ]
}