{
  "id": 1039,
  "mediaId": 2643,
  "date": "2022-02-17",
  "headline": "Halle Berry, Amy Schumer Among Stars Backing Dr. Oz's Opponent for Senate",
  "image": "",
  "link": "https://www.newsweek.com/halle-berry-amy-schumer-among-stars-backing-dr-ozs-opponent-senate-1680332",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Jackson",
  "authorUrl": "https://www.newsweek.com/authors/jon-jackson",
  "termIds": [
    5403,
    5498,
    2709,
    4080,
    3917,
    3585,
    3059,
    2802,
    2726,
    1489
  ],
  "sentences": [
    "Kenyatta, currently a Pennsylvania state representative who has made multiple appearances on MSNBC in recent years, is competing in a close race for the Democratic nomination against Pennsylvania Lieutenant Governor John Fetterman and U.S. Representative Conor Lamb.",
    "The Philadelphia Inquirer reported on Wednesday that Federal Election Commission filings show Halle Berry, Amy Schumer, Susan Sarandon and Robin Thicke are among the celebrities who have donated to Kenyatta's campaign.",
    "Dr. Mehmet Oz currently has the greatest name recognition in the race for an open Senate seat in Pennsylvania, but some of Hollywood's biggest stars are lining up behind Democratic candidate Malcolm Kenyatta.",
    "Other celebrities who have donated to Kenyatta are Debra Messing, Wanda Sykes, finance author Suze Orman and Stephanie Courtney, who plays the character \"Flo\" in Progressive Insurance commercials.",
    "Many of Kenyatta's famous supporters can also only help financially or by spreading word about his campaign, since more than 70 percent of his 2021 donations came from outside of Pennsylvania.",
    "Oz is looking to fill the Senate seat that will be vacated by the incumbent Senator Pat Toomey, a Republican who has said he will fulfill a campaign pledge of not serving four terms.",
    "Other candidates hoping to secure the GOP nod are former hedge fund CEO David McCormick, businesswoman Carla Sands, political commentator Kathy Barnette and businessman Jeff Bartos.",
    "A Trafalgar Group poll released this week found 27.4 percent of likely GOP primary voters said they would vote for Oz if the primary \"were held tomorrow.\"",
    "Though Lamb hasn't received as much A-list support as his Democratic rivals, he does have some well-known donors, including actress Amanda Seyfried.",
    "Meanwhile, Steinem's stepson, Academy Award–winning actor Christian Bale, has given money to Fetterman's campaign, as has musician Jackson Browne.",
    "A month later, he said opening schools during the pandemic would \"only cost us 2 to 3 percent in terms of total mortality\" of the population.",
    "He first came to public prominence as a regular health expert on The Oprah Winfrey Show before launching his own popular television program.",
    "The next closest in terms of voter support in the poll was McCormick, with 15.9 percent of the respondents saying they would vote for him.",
    "In March 2020, Oz endorsed using hydroxychloroquine to battle the coronavirus, which has been called ineffective by many experts.",
    "Filings show he had only $285,000 in funds going into 2022, while Fetterman had $5 million, and Lamb reported having $3 million.",
    "A recent poll found the celebrity physician with a solid lead in a crowded field of candidates vying for the GOP nomination.",
    "Even with the bold-faced names supporting him, Kenyatta lags behind Fetterman and Lamb in money raised.",
    "However, he has since become enveloped in some controversy regarding comments made during the pandemic.",
    "The 31-year-old Kenyatta has also received endorsements from director Lee Daniels and Gloria Steinem.",
    "Moneywise, however, he still trails his competitors for the Democratic nomination.",
    "Should he secure the Democratic nomination, Kenyatta might face the Republican Oz.",
    "Oz, on the other hand, is a celebrity in his own right.",
    "In other words, these donors can't vote for him.",
    "He later said he had \"misspoke.\""
  ]
}