{
  "id": 10392,
  "mediaId": 2601,
  "date": "2022-03-30",
  "headline": "PA: ‘Moderate’ Dem Conor Lamb Paid BLM-Linked Firm Hundreds of Thousands of Dollars",
  "image": "https://iotwreport.com/wp-content/uploads/2021/03/blm-burn-loot-murder-.jpg",
  "link": "https://iotwreport.com/moderate-conor-lamb-paid-blm-linked-firm-hundreds-of-thousands-of-dollars/?utm_source=rss&utm_medium=rss&utm_campaign=moderate-conor-lamb-paid-blm-linked-firm-hundreds-of-thousands-of-dollars",
  "mediaOutlet": "iotwreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MJA",
  "authorUrl": "https://iotwreport.com/author/mja/",
  "termIds": [
    4080,
    3989,
    164,
    6506
  ],
  "sentences": [
    "WFB: The self-described “moderate” in Pennsylvania’s Senate race, Conor Lamb, has paid hundreds of thousands of dollars to a consulting firm that also works for Black Lives Matter, which supports defunding police and abolishing prisons.",
    "Lamb has portrayed himself as the centrist alternative to liberal lieutenant governor John Fetterman in Pennsylvania’s Democratic Senate primary, and the congressman often attempts to distance himself from the movement to defund police.",
    "IRS rules, however, prohibit charitable groups from soliciting donations to a political entity, putting Fireside in “clear violation” of the federal agency’s laws, the Washington Examiner reported.",
    "Fireside, which describes itself as a “majority queer-owned progressive digital, data, and communications consulting firm,” also features the national Black Lives Matter group as a client.",
    "From August to December 2021, Lamb funneled more than $270,000 to Fireside Campaigns for “communications consulting” and other services, federal campaign finance disclosures show.",
    "The group—which was cofounded by self-described “trained Marxists”—works to “reimagine public safety” by defunding police and abolishing prisons.",
    "Lamb’s decision to employ a “progressive,” BLM-linked firm to craft his campaign messaging could jeopardize his “moderate” status.",
    "Last week, Fireside sent a fundraising email on behalf of BLM’s charity, Black Lives Matter Global Network Foundation.",
    "The email asked for contributions to BLM’s political group, Black Lives Matter PAC.",
    "Fireside’s work with BLM has landed the firm in hot water.",
    "But BLM is at the forefront of that movement.",
    "READ MORE"
  ]
}