{
  "id": 10424,
  "mediaId": 2650,
  "date": "2022-03-30",
  "headline": "Many Progressives No Longer Want to Be Known as 'Progressive'",
  "image": "https://media.townhall.com/townhall/reu/o/2018/188/b841adf6-fcdb-4e0c-894f-198993197823-1110x740.jpg",
  "link": "https://pjmedia.com/news-and-politics/rick-moran/2022/03/30/many-progressives-no-longer-want-to-be-known-as-progressive-n1585533",
  "mediaOutlet": "Pajamas Media ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rick Moran",
  "authorUrl": "https://pjmedia.com/columnist/rick-moran",
  "termIds": [
    5312,
    2623,
    3989,
    4325,
    2959,
    6401,
    6678
  ],
  "sentences": [
    "Veteran Lucas Kunce, who’s also angling for a Senate primary win in the race to replace retiring Republican Sen. Roy Blunt in Missouri, similarly identifies as a populist and says he’s part of a “people-powered movement.” His fundraising page offers a variety of credentials: Marine, antitrust advocate and Democrat — but not progressive.",
    "There is nothing “populist” about statist solutions that dictate what people can or should do — no matter how they disguise it as “people power.”\nA source close to another self-styled Midwestern populist described “two lanes of populism” taking hold as contenders look for more accurate ways to portray what’s unfolding in their regions.",
    "But they appropriated the name nonetheless, even though their label should have been closer to “fascist” than “progressive.”\nNow, the “progressive” label is wearing thin as voters have begun to identify “progressive” with “crazy.” So, many progressives believe a rebranding is in order.",
    "Even today, with efforts to smear the entire right because of the actions of a few knuckleheads on January 6, there has been no indication that any member of Congress or candidate is contemplating changing their label from “conservative” to anything else.",
    "In the 1980s, Ronald Reagan and other conservatives were so successful at muddying up the label “liberal” that leftists at the time were forced to self-identify as “progressives.”\nBut that wasn’t particularly satisfying.",
    "Voters in these areas, this person said, aren’t consumed with the detailed policy proposals that excite many national progressives in Washington, D.C., and prefer an anti-establishment, against-the-system sentiment.",
    "During the entire time that “liberals” were becoming “progressives” and now “populists,” there have always been only “conservatives” on the right.",
    "There’s more of a grassroots populism that’s felt as the base of society.”\nIf you think that strategy sounds like Trump in 2016, you’re correct.",
    "A progressive candidate in rural Georgia or South Carolina would have little chance against a conservative running in those regions.",
    "The problem for these liberal/progressive/populists is that the solutions they are offering the voters haven’t changed in 40 years.",
    "Robert La Follette, and President Teddy Roosevelt carried out a revolution that, for good or ill, changed America forever.",
    "The Hill:\nWhile some high-profile contenders still use the moniker, others want to be thought of in different terms.",
    "The ratty, scruffy-looking modern “progressives” bore no resemblance to the courageous reformers who preceded them.",
    "John Fetterman, who’s seeking the party’s nomination for a coveted Senate seat, prefers a different word: populist.",
    "That’s a lesson the radical left could learn before their next label change after their defeat in 2022.",
    "After all, there had already been a “progressive movement” in America at the turn of the 20th century.",
    "On the other hand, running as a “progressive” in many urban areas is less of a drag on getting votes.",
    "Trump’s ability to tap into that rural and Middle-Class discontent gave him the victory in 2016.",
    "And as these Democratic candidates are demonstrating, it’s still a potent strategy in 2022.",
    "“But then I think there are some states where there’s actually a populist hint in it.",
    "The toxicity of the “progressive” label depends a lot on where it’s being applied.",
    "That implies there’s something good and strong about the conservative label.",
    "Changing their label won’t change who they are or what they believe.",
    "And look, anything it takes,” the source said.",
    "“Some are just using it as a tactic.",
    "Hiram Johnson, Wisconsin Gov.",
    "Leaders like California Gov.",
    "Pennsylvania’s Lt. Gov.",
    "He’s not alone.",
    "Why would they?"
  ]
}