{
  "id": 10588,
  "mediaId": 6526,
  "date": "2022-04-03",
  "headline": "Conor Lamb, Malcolm Kenyatta will square off in debate at Muhlenberg College today. Here’s what you need to know",
  "image": "https://www.mcall.com/resizer/Iz6hx-m-Jog-q722oS3zMEI6bXM=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/GR34XB6XTBKEOVUFRDJTP4266I.aspx",
  "link": "https://www.mcall.com/news/elections/mc-nws-muhlenberg-college-senate-debate-advance-20220403-mdpgo32q55fuznju5ecapv7c2e-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morning Call Staff",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Fetterman’s campaign released the three debates he would participate in, one in Harrisburg on April 25, another at Dickinson College that is sponsored by Spotlight PA, The Philadelphia Inquirer, Trib Total Media, PennLive/The Patriot-News, and WITF and another at a TV station in Philadelphia, an area in which the former western Pennsylvania mayor may feel he needs to make a big splash.",
    "Chris Borick, professor of political science and director of the Muhlenberg College Institute of Public Opinion; Jenny DeHuff, editor-in-chief, City & State PA; and Ari Mittleman, founder and host, PA Political Podcast: Pennsylvania Kitchen Table Politics will be the moderators.",
    "Fetterman’s campaign announced Thursday that the lieutenant governor would not attend today, saying only that he had accepted invitations to participate in three televised debates ahead of the May 17 primary election and Muhlenberg was not included.",
    "The Pennsylvania Democratic candidates for U.S. Senate will appear for the first time in person on the same stage on Sunday at a Muhlenberg College debate, but only two of the invitees will be there.",
    "Today’s debate is hosted by City & State PA, Pennsylvania Kitchen Table Politics, the Muhlenberg College Institute of Public Opinion and the Muhlenberg College Democrats student organization.",
    "Lamb is the U.S. House representative for the 17th Congressional district, which includes parts of Allegheny and Butler counties and Beaver County in southwestern Pennsylvania.",
    "John Fetterman declined to attend the debate The other two candidates, state Rep. Malcolm Kenyatta and U.S. Rep. Conor Lamb, D-17, will be there.",
    "Each candidate will have 90 seconds for opening remarks and 60 seconds for closing remarks.",
    "That’s hard to figure since this region is the third-most populous in the state.",
    "Kenyatta is a state representative for the 181st district in Philadelphia.",
    "It will be from 3 to 4:30 p.m. in front of a live audience at the college.",
    "Fetterman did not and the college gave him a 5 p.m. deadline on Thursday.",
    "Lamb and Kenyatta confirmed early on that they would participate.",
    "Candidates will have 75 seconds to respond to each question.",
    "Lieutenant Gov."
  ]
}