{
  "id": 10596,
  "mediaId": 8493,
  "date": "2022-04-02",
  "headline": "PA Headlines 4/2/22: Flag Lowered For Officer Lebo",
  "image": "https://www.wkok.com/wp-content/uploads/2020/07/SBC-APP-KO-CAR-PLAY-New.jpg",
  "link": "https://www.wkok.com/596564-2/",
  "mediaOutlet": "wkok.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WKOK Staff",
  "authorUrl": "https://www.wkok.com/author/newsroom/",
  "termIds": [
    0
  ],
  "sentences": [
    "HARRISBURG, Pa. (AP) — Conor Lamb is accusing rival John Fetterman in Pennsylvania’s Democratic U.S. Senate primary of skipping candidate forums to avoid talking about a 2013 incident when, shotgun in hand, he confronted a Black man because he suspected the man was involved in gunfire nearby.",
    "Harrisburg, Pa. (WHTM) – Governor Tom Wolf ordered the commonwealth flag on all commonwealth facilities, public buildings and grounds to fly at half-staff to honor Lebanon City Police Lieutenant William Lebo, who was shot and killed in the line of duty on March 31, 2022.",
    "Fetterman, Pennsylvania’s lieutenant governor, has insisted he isn’t skipping forums for any such reason, and has repeatedly maintained that he was acting as a mayor concerned for public safety and confronted the man, not knowing his race.",
    "The man — Christopher Miyares, who is Black — was unarmed and said in a TV interview afterward that he had been jogging when Fetterman, who is white, pulled up in his pickup and pointed the shotgun at him.",
    "On Thursday night, Lamb, a third-term congressman, took to Twitter to raise the episode, which has bubbled just below the surface of a primary campaign that previously had been relatively cordial.",
    "The Commonwealth flag shall be lowered to half-staff until sunset on Wednesday, April 6, 2022, as well as on the day of Lieutenant Lebo’s funeral, which has not yet been announced.",
    "It might also damage Fetterman and his party with a key voting bloc whose support would be important should he become the Democratic candidate in the general election in November.",
    "He has said he pursued a mask- and goggle-wearing man he saw running nearby, covered head to toe in the cold January weather, pulling out a shotgun until police arrived.",
    "Two other Lebanon City Police Officers, Officer Ryan Adams and Officer Derek Underkoffler, were shot by 34-year-old Travis Shaud on Thursday and remain hospitalized.",
    "The contest to replace retiring Republican Sen. Pat Toomey represents perhaps the Democrats’ best opportunity to pick up a seat in the closely divided Senate.",
    "The accusation marks a sharp escalation in tone between candidates vying for the Democratic nomination in Pennsylvania’s May 17 Senate primary election.",
    "Fetterman has spoken before of how he believed he had heard gunfire while outside his home in the small town of Braddock when he was mayor in 2013.",
    "All of Pennsylvania joins the Lebanon community in mourning this tragedy.” The United States flag is to remain at full-staff through this tribute.",
    "In an interview Friday, Kenyatta said Fetterman “needs to leave the candidate protection program and actually publicly debate his record.”",
    "The accusation more directly inserts issues of race into a campaign that could hinge on which candidate appeals to Black voters.",
    "“My heart goes out to Lieutenant Lebo’s family, and to the families of the two officers injured in this shooting,” said Gov.",
    "“Our commonwealth’s law enforcement officers put themselves in harm’s way every day to serve and protect their communities.",
    "And we have to talk about it.” A third Democrat in the primary, Malcolm Kenyatta, who is Black, echoed Lamb.",
    "“He doesn’t want to talk about the fact that he chased down an unarmed Black man and held him at gunpoint.",
    "The Governor’s office says all Pennsylvanians are invited to participate in this tribute.",
    "“We all know why John Fetterman isn’t coming to the debate on Sunday,” Lamb wrote.",
    "Fetterman has denied pointing the shotgun at Miyares and said it wasn’t loaded.",
    "Lt. Lebo was one month away from retirement when he was killed on Thursday.",
    "That’s the elephant in the room.",
    "Wolf."
  ]
}