{
  "id": 10659,
  "mediaId": 2550,
  "date": "2022-04-04",
  "headline": "Republicans are about to kill cannabis legalization. Could that help Democrats in the midterms?",
  "image": "https://images.dailykos.com/images/939456/story_image/GettyImages-1174519569.jpg?1618946995",
  "link": "https://www.dailykos.com/stories/2022/4/2/2089683/-GOP-is-about-to-kill-cannabis-legalization-Could-that-help-Dems-in-the-midterms?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5442,
    4905,
    4591,
    3810,
    392,
    1126,
    6486,
    6729,
    6678
  ],
  "sentences": [
    "But in this case, it will be hard for Republicans to argue that they’re protecting citizens’ freedom and rights when they’re very publicly doing just the opposite:\nThe House passed a far-reaching marijuana legalization bill [the MORE Act] on Friday by a 220-204 vote, largely along party lines and still with no real path to President Joe Biden’s desk.",
    "This bill not only decriminalizes marijuana at the federal level by removing it from the Controlled Substances Act, but it also redresses the harms caused by criminalization, which are borne disproportionately by communities of color, by expunging federal marijuana convictions and implementing social justice reforms.”\nAmen.",
    "Since there’s very little call for stories about incrementally turning into Gollum as I shun natural light, social interaction, and the impudent inveigling of relatives trying to coax me out of my Reefer Madness redoubts and into the so-called “world,” I like to write about weed.",
    "More importantly, the percentage of Americans who favor legal pot keeps climbing, likely as people become more exposed to cannabis and are able to see for themselves how benign it generally is, especially in comparison to alcohol and harder drugs.",
    "It marks the second time in less than two years that the House passed legislation to decriminalize cannabis, scrap some old marijuana-related convictions and allow states to make their own decisions about whether to establish marijuana markets.",
    "Democrats have a smorgasbord of issues to draw on—including Republicans’ and Donald Trump’s suspiciously cozy relationship with murderous dictator Vladimir Putin—but people, and especially Americans, tend to vote for their own urgent interests.",
    "“I think it’s clear that Democrats understand that this is something that actually helps them politically,” said Rep. Earl Blumenauer, an Oregon Democrat whom Politico describes as the “unofficial cannabis dean” of Congress.",
    "“And opposition hurts them politically, at least in Democratic primaries and with Republican swing voters.”\nI’ll be the first to admit that cannabis legalization is not the most pressing issue for our republic going forward.",
    "Unlike the sprawling Build Back Better bill—which would have a far more positive impact on our country than weed legalization—lifting restrictions on cannabis is something everyone can easily understand and appreciate.",
    "We still need to save democracy (here and abroad), fight for racial equality, protect the rights of LGBTQ+ people, pass meaningful social spending programs, support workers’ rights, and much, much more.",
    "In fact, Democrats seem to be coming around to seeing this as a positive for their electoral prospects:\n[S]ix Democrats voted against the bill in 2020, but only two voted against the MORE Act on Friday.",
    "But Democrats seem no closer to fulfilling a major campaign promise, passing a party-line bill that has little chance of getting the necessary Republican support to pass the Senate.",
    "A November 2020 Gallup poll found that 68% of Americans now favor legalization, and pro-pot sentiment has doubled since the early 2000s, when that figure hovered in the mid-30s.",
    "As the ACLU noted just prior to the House vote on the bill, “The MORE Act would have a positive impact on millions whose lives have been upended by the failed war on drugs.",
    "Most of my pro-pot takes come down to wondering why in the hell, in the Year of Our Lord 2022, this shit is still illegal in so many places.",
    "One of the lawmakers who previously voted against the bill — Rep. Conor Lamb of Pennsylvania — is in a tough primary race with Lt. Gov.",
    "In 1969, the first year Gallup surveyed Americans on this question, just 12% of respondents indicated support for legalization.",
    "It made comedian Sarah Silverman say, “THIS IS FUCKING BRILLIANT,” and prompted author Stephen King to shout “Pulitzer Prize!!",
    "But let’s face it, people don’t always vote in favor of the common good, unless they see a direct benefit to themselves.",
    "I understand there are some downsides to pot use, of course, but for the life of me I can’t remember what they are.",
    "I didn’t move to Oregon from Wisconsin seven years ago explicitly for the legal weed, but it’s been a nice perk.",
    "Or, if you prefer a test drive, you can download the epilogue to Goodbye, Asshat for the low, low price of FREE.",
    "Enforcing marijuana laws costs about $3.6 billion a year, yet the availability of marijuana has not diminished.",
    "And if you prefer to see the MORE Act as primarily a social justice initiative, you can do that—because it is.",
    "Of course—as with most things Americans care about—the GOP is out of step with public sentiment on this issue.",
    "Get them all, including the finale, Goodbye, Asshat: 101 Farewell Letters to Donald Trump, at this link.",
    "Fetterman has campaigned vocally on cannabis legalization, both for his state and federally.",
    "In fact, Americans have quickly come around to a generally positive view of marijuana.",
    "Want to get an indica-besotted millennial off his couch and out to the ballot box?",
    "John Fetterman for the Democratic nomination for Pennsylvania’s open Senate seat.",
    "They want to forcibly take away part of the botanical bounty God gave us.",
    "The viral letter that launched four hilarious Trump-trolling books.",
    "Lately, in between tokes of Willamette Red (West Coast represent!",
    "), I’ve been fretting about our prospects for the midterms.",
    "We’ve also come a long way since the countercultural ‘60s.",
    "The pro-freedom party is trying to restrict your freedom!",
    "This time around, Lamb voted in favor of the bill.",
    "And lots of people have the urge to use cannabis.",
    "For me, at least, it’s been nothing but upside.",
    "A teacher once told me to write what you know.",
    "And 68% of the country disagrees with them.",
    "Bring this issue up once or twice.",
    "I have zero doubt about that.",
    "!” (on Twitter, that is).",
    "And pass the joint.",
    "What is it?",
    "Weird."
  ]
}