{
  "id": 11742,
  "mediaId": 8254,
  "date": "2022-03-28",
  "headline": "Pennsylvania Senate primaries get personal",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/AP22056538328626.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/pennsylvania-senate-primaries-get-personal/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "",
  "termIds": [
    4080,
    1724,
    3989,
    1489,
    1126,
    392,
    5933,
    6509,
    6506
  ],
  "sentences": [
    "But in a sign that the tone of the race could change, a pro-Lamb super PAC, Penn Progress, recently circulated a memo to donors warning that Lamb is trailing Fetterman because “primary voters don’t yet see Fetterman as the liberal he is” and asserting that “this dynamic needs to change.”\nWrapped into the memo, which was first reported by Politico on Monday, was a series of negative messages that could be used against Fetterman, including accusations that the Pennsylvania lieutenant governor is a “dangerous radical who proudly calls himself a socialist.”\nFetterman’s campaign swatted away the attacks, noting Fetterman has never called himself a socialist and doesn’t support policies like defunding the police, and calling the polling memo a “desperate move.”\nWhile those attacks haven’t been aired publicly yet, they strike at the heart of the dilemma facing Democrats in Pennsylvania and elsewhere.",
    "And these folks on all sides are using both methods to try to make their case.”\nThe top two front-runners in the GOP primary, former hedge fund manager Dave McCormick and celebrity cardiothoracic surgeon Mehmet Oz, have been at each other’s throats for weeks with accusations of insufficient conservatism or loyalty to former President Trump.",
    "In fact, it already has been the Republican message across Pennsylvania.”\nJ.J. Balaban, a Pennsylvania-based Democratic strategist who’s unaligned in the primary, said that there’s some clear risks to going negative in the nominating contest, especially if Lamb or his allies begin to aggressively attack Fetterman.",
    "State Senate Minority Leader Jay Costa (D), who has endorsed Lamb in the race, declined to say how vicious the primary between Fetterman and Lamb could get but said that Lamb needs to convince primary voters that he’s the more electable candidate in a general election match-up.",
    "When you go after him, there might be a backlash about going negative against a Democrat in these kind of polarized, partisan environment times.”\nStill, with Lamb lagging Fetterman in both polling and fundraising, there’s still a chance that the attacks could ramp up.",
    "Asked whether Fetterman would have to be a part of Lamb’s message, Costa replied: “It probably has to be part of that conversation.”\n“[Fetterman] could be perceived as being too liberal and as a consequence, folks may be reluctant to support that,” Costa said.",
    "A survey from Franklin & Marshall College conducted late last month showed Fetterman garnering 28 percent of the vote to Lamb’s 15 percent among registered Democrats, while another candidate, state Rep. Malcolm Kenyatta, notched 2 percent support.",
    "(The Hill) – Senate primaries in Pennsylvania are getting nastier by the day, with Republicans launching personal attacks in a race to the right and Democrats seemingly laying the groundwork for assaults over electability.",
    "The battles are only expected to get tougher ahead of the May 17 primaries, when Republicans and Democrats will choose their nominees for a race that will help determine who controls the Senate.",
    "Likewise, a poll conducted by Impact Research in early February and cited in the memo from Penn Progress found Fetterman with 46 percent support in the primary, with Lamb trailing at 17 percent.",
    "Polls show McCormick with a lead but as many as a third of voters remain undecided, and the contenders are anticipated to engage in a knife fight to gain any edge among those still up for grabs.",
    "McCormick and his allies have deflected the charge, claiming the business experience makes him better able to tackle issues surrounding Beijing, and ramped up his criticism of China.",
    "Oz has thrown barbs McCormick’s way over his former hedge fund’s ties to China, a top boogeyman in U.S. politics, and released ads highlighting past comments praising Beijing.",
    "Lamb, on the other hand, has sold himself as a moderate capable of reaching many of the same swing voters who helped drive President Biden‘s victory in Pennsylvania in 2020.",
    "John Fetterman and Rep. Conor Lamb (D-Pa.), have aired ads going after one another, and any public-facing attacks have so far been carried out by surrogates for the two men.",
    "“Going negative in a Democratic primary is kind of intrinsically riskier than in the general election, because Fetterman is a reasonably popular Democratic official.",
    "While both candidates have been able to throw elbows, operatives say Oz and McCormick need to do more to explain their foreign ties to GOP primary voters.",
    "“And so it’s beginning to be hard to see what Conor Lamb’s path is without significant outside help, just because he has a far way to go.",
    "But it’s a different issue.”\nGet the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "“We’re getting close, and that can engender more negative advertising,” said veteran Pennsylvania GOP strategist Christopher Nicholas.",
    "Oz, in turn, has sought to flip the issue back around on McCormick, highlighting his family and suggesting McCormick is xenophobic.",
    "He has pretty far to travel given where he is.”\n“One path could be to attack Fetterman, and that might happen,” Balaban added.",
    "“Unfortunately, negative campaigning works or people wouldn’t do it,” said Sam DeMarco, the chair of the Allegheny County GOP.",
    "“The Turkish citizenship is about Oz as a person and who is he and can you trust him and why does he have split loyalties?",
    "Fetterman has staked himself out as a progressive, backing proposals like “Medicare for All” and criminal justice reform.",
    "We won’t be fooled again,” McCormick tweeted in response, noting past stances Oz has taken that contradict GOP orthodoxy.",
    "On the flip side, McCormick has made hay of Oz’s dual citizenship with Turkey, suggesting he could have split loyalties.",
    "But the barbs only multiplied until the surgeon said he would renounce his Turkish citizenship if he were to be elected.",
    "Oz said he kept his dual citizenship to make it easier to care for his mother, who has Alzheimer’s and lives in Turkey.",
    "“But I wouldn’t leap to the conclusion that it will.”\nCopyright 2022 Nexstar Media Inc. All rights reserved.",
    "He has lied about his position on abortion, the 2nd Amendment, immigration, masks, and Fauci to name a few.",
    "But the recent back-and-forth over foreign entanglements has escalated the campaign to scorched earth.",
    "¡Recibe noticias locales y el pronóstico del tiempo directamente en tu buzón de email!",
    "You might say, ‘well, OK, McCormick did business in China.’ Well, a lot of people did.",
    "The attacks are expected to escalate in the final two-month sprint to the primary.",
    "That same poll still found some 44 percent of Democrats undecided in the primary.",
    "By comparison, the race for the Democratic nomination has been relatively tame.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "Still, early polling has shown Fetterman with a clear lead in the primary.",
    "We don’t like that,” said one GOP strategist who’s worked in Pennsylvania.",
    "Regístrate aquí para recibir los boletines diarias de AL DÍA CON ABC27.",
    "Neither of the two leading candidates, Pennsylvania Lt. Gov.",
    "And I think he’s at least muddied things at best.",
    "The other is to boost your opponent’s negatives.",
    "“He’s both behind and outgunned,” Balaban said.",
    "“So the question is, is he truly compromised?",
    "Well, he’s been attacking China and so forth.",
    "“That’ll certainly be the Republican message.",
    "So I think the China thing is a problem.",
    "Renounce your Turkish citizenship now.",
    "Kenyatta received 7 percent support.",
    "One is to boost your positives.",
    "Voters can’t trust Mehmet Oz.",
    "“There’s two ways to win.",
    "Sign up here.",
    "“Do it now."
  ]
}