{
  "id": 11983,
  "mediaId": 2702,
  "date": "2022-03-25",
  "headline": "The Hill’s Morning Report – Biden turns up heat on Russia",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/mr_bidenjoenato_032422_ap-evan-vucci.jpg?w=1280",
  "link": "https://thehill.com/homenews/morning-report/599708-the-hills-morning-report-biden-turns-up-heat-on-russia/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    0
  ],
  "sentences": [
    "[[{“fid”:”254580\",”view_mode”:”wysiwyg”,”fields”:{“format”:”wysiwyg”,”alignment”:””,”field_file_image_alt_text[und][0][value]”:”Will Smith poses in the press room with the award for best actor for “King Richard””,”field_file_image_title_text[und][0][value]”:false,”field_url[und][0][value]”:”Associated Press/Jordan Strauss, Invision”,”field_free_html[und][0][value]”:”%3Cp%3EWill%20Smith%20poses%20in%20the%20press%20room%20with%20the%20award%20for%20best%20actor%20for%20%22King%20Richard%22%20at%20the%2027th%20annual%20Critics%20Choice%20Awards%20on%20Sunday%2C%20March%2013%2C%202022%2C%20at%20the%20Fairmont%20Century%20Plaza%20Hotel%20in%20Los%20Angeles.%3C%2Fp%3E”,”field_free_html[und][0][format]”:”full_html”},”link_text”:null,”type”:”media”,”field_deltas”:{“4”:{“format”:”wysiwyg”,”alignment”:””,”field_file_image_alt_text[und][0][value]”:”Will Smith poses in the press room with the award for best actor for “King Richard””,”field_file_image_title_text[und][0][value]”:false,”field_url[und][0][value]”:”Associated Press/Jordan Strauss, Invision”,”field_free_html[und][0][value]”:”%3Cp%3EWill%20Smith%20poses%20in%20the%20press%20room%20with%20the%20award%20for%20best%20actor%20for%20%22King%20Richard%22%20at%20the%2027th%20annual%20Critics%20Choice%20Awards%20on%20Sunday%2C%20March%2013%2C%202022%2C%20at%20the%20Fairmont%20Century%20Plaza%20Hotel%20in%20Los%20Angeles.%3C%2Fp%3E”,”field_free_html[und][0][format]”:”full_html”}},”attributes”:{“alt”:”Will Smith poses in the press room with the award for best actor for “King Richard””,”height”:363,”width”:645,”class”:”media-element file-wysiwyg”,”data-delta”:”4\"}}]]\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "White House national security adviser Jake Sullivan on Feb. 11 said that “the president believes that sanctions are intended to deter.” Six days later, Secretary of State Antony Blinken told the United Nations the administration supported sanctions “not to start a war, but to prevent one.”\n[[{“fid”:”254581\",”view_mode”:”wysiwyg”,”fields”:{“format”:”wysiwyg”,”alignment”:””,”field_file_image_alt_text[und][0][value]”:”Ukrainian President Volodymyr Zelenskyy speaks from Kyiv, Ukraine”,”field_file_image_title_text[und][0][value]”:false,”field_url[und][0][value]”:”Ukrainian Presidential Press Office via AP”,”field_free_html[und][0][value]”:”%3Cp%3EIn%20this%20image%20from%20video%2C%20Ukrainian%20President%20Volodymyr%20Zelenskyy%20speaks%20from%20Kyiv%2C%20Ukraine%2C%20early%20Thursday%2C%20March%2024%2C%202022.%3C%2Fp%3E”,”field_free_html[und][0][format]”:”full_html”},”link_text”:null,”type”:”media”,”field_deltas”:{“1”:{“format”:”wysiwyg”,”alignment”:””,”field_file_image_alt_text[und][0][value]”:”Ukrainian President Volodymyr Zelenskyy speaks from Kyiv, Ukraine”,”field_file_image_title_text[und][0][value]”:false,”field_url[und][0][value]”:”Ukrainian Presidential Press Office via AP”,”field_free_html[und][0][value]”:”%3Cp%3EIn%20this%20image%20from%20video%2C%20Ukrainian%20President%20Volodymyr%20Zelenskyy%20speaks%20from%20Kyiv%2C%20Ukraine%2C%20early%20Thursday%2C%20March%2024%2C%202022.%3C%2Fp%3E”,”field_free_html[und][0][format]”:”full_html”}},”attributes”:{“alt”:”Ukrainian President Volodymyr Zelenskyy speaks from Kyiv, Ukraine”,”height”:363,”width”:645,”class”:”media-element file-wysiwyg”,”data-delta”:”1\"}}]]\nIntroducing NotedDC: The Hill’s curated commentary on the beat of the Beltway.",
    "[[{“fid”:”254579\",”view_mode”:”wysiwyg”,”fields”:{“format”:”wysiwyg”,”alignment”:””,”field_file_image_alt_text[und][0][value]”:”Brooklyn Nets guard Kyrie Irving handles the ball in the first half of an NBA basketball game”,”field_file_image_title_text[und][0][value]”:false,”field_url[und][0][value]”:”Associated Press/Brandon Dill”,”field_free_html[und][0][value]”:”%3Cp%3EBrooklyn%20Nets%20guard%20Kyrie%20Irving%20handles%20the%20ball%20in%20the%20first%20half%20of%20an%20NBA%20basketball%20game%20against%20the%20Memphis%20Grizzlies%20on%20Wednesday%2C%20March%2023%2C%202022%2C%20in%20Memphis%2C%20Tenn.%3C%2Fp%3E”,”field_free_html[und][0][format]”:”full_html”},”link_text”:null,”type”:”media”,”field_deltas”:{“2”:{“format”:”wysiwyg”,”alignment”:””,”field_file_image_alt_text[und][0][value]”:”Brooklyn Nets guard Kyrie Irving handles the ball in the first half of an NBA basketball game”,”field_file_image_title_text[und][0][value]”:false,”field_url[und][0][value]”:”Associated Press/Brandon Dill”,”field_free_html[und][0][value]”:”%3Cp%3EBrooklyn%20Nets%20guard%20Kyrie%20Irving%20handles%20the%20ball%20in%20the%20first%20half%20of%20an%20NBA%20basketball%20game%20against%20the%20Memphis%20Grizzlies%20on%20Wednesday%2C%20March%2023%2C%202022%2C%20in%20Memphis%2C%20Tenn.%3C%2Fp%3E”,”field_free_html[und][0][format]”:”full_html”}},”attributes”:{“alt”:”Brooklyn Nets guard Kyrie Irving handles the ball in the first half of an NBA basketball game”,”height”:363,”width”:645,”class”:”media-element file-wysiwyg”,”data-delta”:”2\"}}]]\nMorning Report is created by journalists Alexis Simendinger and Al Weaver.",
    "[[{“fid”:”254577\",”view_mode”:”wysiwyg”,”fields”:{“format”:”wysiwyg”,”alignment”:””,”field_file_image_alt_text[und][0][value]”:”First lady Jill Biden smiles after touring the Pennington Heath Science Center”,”field_file_image_title_text[und][0][value]”:false,”field_url[und][0][value]”:”Associated Press/Rich Pedroncelli”,”field_free_html[und][0][value]”:”%3Cp%3EFirst%20lady%20Jill%20Biden%20smiles%20after%20touring%20the%20Pennington%20Heath%20Science%20Center%20at%20The%20Truckee%20Meadows%20Community%20College%20in%20Reno%2C%20Nev.%2C%20on%20Wednesday%2C%20March%209%2C%202022.%3C%2Fp%3E”,”field_free_html[und][0][format]”:”full_html”},”link_text”:null,”type”:”media”,”field_deltas”:{“3”:{“format”:”wysiwyg”,”alignment”:””,”field_file_image_alt_text[und][0][value]”:”First lady Jill Biden smiles after touring the Pennington Heath Science Center”,”field_file_image_title_text[und][0][value]”:false,”field_url[und][0][value]”:”Associated Press/Rich Pedroncelli”,”field_free_html[und][0][value]”:”%3Cp%3EFirst%20lady%20Jill%20Biden%20smiles%20after%20touring%20the%20Pennington%20Heath%20Science%20Center%20at%20The%20Truckee%20Meadows%20Community%20College%20in%20Reno%2C%20Nev.%2C%20on%20Wednesday%2C%20March%209%2C%202022.%3C%2Fp%3E”,”field_free_html[und][0][format]”:”full_html”}},”attributes”:{“alt”:”First lady Jill Biden smiles after touring the Pennington Heath Science Center”,”height”:363,”width”:645,”class”:”media-element file-wysiwyg”,”data-delta”:”3\"}}]]\nELSEWHERE\n?",
    "“The thing you look at the most is you see these young children that are in those camps.”\nFollowing Thursday’s discussions about how the West is combating Russian President Vladimir Putin’s war, Biden will meet on Saturday in Warsaw with President Andrzej Duda, whose government is caring for 2.1 Ukrainians who have fled there, and also preparing militarily with the rest of NATO for potential chemical, biological or strategic nuclear escalation by Putin, which world leaders vowed would trigger immediate but unspecified responses from the alliance.",
    "A day after affirming continued solidarity against Russia with leaders from NATO, the European Union and Group of Seven countries gathered in Brussels, Biden is expected to meet with Ukrainian refugees sheltering in Poland, bringing with him U.S. pledges of $1 billion in humanitarian aid and invitations to accept a dramatically increased threshold of 100,000 Ukraine refugees to the United States.",
    "So when we finally have it, it will give us and you 100 percent security.”\nAdditional pressure on Russia described by summit leaders included tougher energy sanctions, more outreach to China to lean on Putin, and crackdowns on Russian gold to curb its borrowing options and hasten its default while cutting Moscow off from international institutions and the private sector.",
    "Ukrainian President Volodymyr Zelensky pleaded with global leaders in a Thursday morning video to help Ukrainians who want to defeat Russia but need what he called “unlimited military support.”\nWearing a khaki green shirt and pants, Zelensky stood in a Kyiv street in near darkness and asked the West once again to do more to help Ukraine’s military win the war.",
    "“This is about putting New York City-based performers on a level field.” The new rules are expected to restore full eligibility for unvaccinated Brooklyn Nets star Kyrie Irving and allow any unvaccinated members of the New York Yankees and Mets to appear in home games when Major League Baseball opens its season April 7 (The Washington Post).",
    "… The European Union this week is expected to finalize the Digital Markets Act, one of the world’s most far-reaching laws since 2018 to address the power of the biggest tech companies, putting in place rules that will affect app stores, online advertising, e-commerce, messaging services and other everyday digital tools (The New York Times).",
    "The 8-1 decision was written by Chief Justice John Roberts and joined by all but Justice Thomas, who said John Henry Ramirez, whose lethal injection was scheduled last year but postponed during his appeal, was attempting to “’manipulate the judicial process’ to win further delay” in carrying out the death sentence (Reuters and NBC News).",
    "The nominee presented herself as a judge who relies on method, not judicial philosophy, to remain neutral as she works to “stay in my lane.” But conservative senators and witnesses who testified in opposition to her nomination have painted Jackson’s judicial choices as outside the mainstream and too lenient on convicted criminals.",
    "LEADING THE DAY\nCONGRESS: The fourth and final day of Senate hearings to consider Ketanji Brown Jackson for confirmation to the Supreme Court ended on Thursday with outside testimony praising her qualifications against a backdrop hinting at a narrow political vote by the Senate next month (The Associated Press).",
    "President Biden this morning left the pomp and protocols of Brussels to fly to Poland, a NATO member shouldering the misery of more than 2 million Ukrainian refugees, many of them women and children, whose needs are straining the capacity of neighboring governments as a result of Russia’s war.",
    "She recaps some of recent disclosures by those who have tested positive for the coronavirus, including a former president, the husband of the vice president, a former secretary of State married to a former president, the White House press secretary (infected twice) and many lawmakers.",
    "INTERNATIONAL: North Korea said Friday it test-fired its biggest-yet intercontinental ballistic missile under the orders of leader Kim Jong Un, who vowed to expand the North’s “nuclear war deterrent” while preparing for a “long-standing confrontation” with the United States.",
    "Jackson is the first federal public defender to be nominated to the Supreme Court and her efforts representing those accused of crimes, alongside her work as a federal judge, have provided a lengthy record of difficult cases for senators to review, according to the AP.",
    "Time machine: It has been decades since Newt Gingrich, once a little-known firebrand from Georgia, helped craft what was called the Contract with America to tug Republicans out of the wilderness and into the majority during what became a historic midterm year in 1994.",
    "The Washington Post and CBS News: Conservative activist Virginia “Ginni” Thomas, wife of Justice Clarence Thomas, sent then-White House chief of staff Mark Meadows text messages urging efforts to overturn the 2020 election in the weeks following Biden’s victory.",
    "Director Steven Spielberg’s lone Best Picture win was for “Schindler’s List,” making the quiz answer “all of the above.”\n“Ben-Hur,” “Titanic” and “The Lord of the Rings: The Return of the King” each captured 11 Academy Awards, tying for the association’s record.",
    "******\nPOLITICS: Biden on Thursday was asked by a reporter about the potential for a rematch in 2024 against former President Trump, who has teased another presidential campaign and is working energetically to be treated as the leader of the Republican Party.",
    "COURTS: The Supreme Court, in a decision that bolsters the religious rights of inmates, on Thursday ruled that Texas must grant a convicted murderer on death row his request to have his Christian pastor lay hands on him and audibly pray during his execution.",
    "Senate Minority Leader Mitch McConnell (R-Ky.) said on Thursday he will vote against Jackson’s nomination to the Supreme Court, an announcement that was not a surprise considering his vote last year to oppose Jackson’s nomination as an appeals court judge.",
    "This week, the graybeard of choice is Gingrich, 78, one of Minority Leader Kevin McCarthy’s (R-Calif.) VIP guests and advisers for a loosely constructed new contract to help block Biden and Democrats and shift the reins of power to the right (The Hill).",
    "During a news conference, Biden said he believed Russia should be kicked out of the G20 group of industrialized and developing nations, but said if the member nations do not agree, then Ukraine should be allowed to participate in the G20 in the future.",
    "Romney said he received a proposal from Democrats and was working with the Senate Republican leadership on a possible compromise that includes budget offsets proposed by both parties to reprogram some previously appropriated but unspent funds.",
    "“I think we’re making progress,” Sen. Mitt Romney (R-Utah) told reporters on Thursday when asked about bipartisan horse-trading underway to resolve a congressional impasse over additional funds for federal COVID-19 responses and preparations.",
    "New York Mayor Eric Adams (D) on Thursday said he was creating a special exemption from the city’s COVID-19 health guidelines for unvaccinated performers and professional athletes because they represent big money for the Big Apple’s economy.",
    "The president wandered into a testy exchange with reporters Thursday when he claimed that he never said economic sanctions would deter Russia’s war invasion of Ukraine, which, in fact, the administration asserted in February (The Hill).",
    "The Associated Press: The U.S. and the European Union today announced a White House-EU task force focused on reducing Europe’s reliance on Russian liquified natural gas by 2030, and particularly through the next two winters.",
    "Senate Judiciary Committee Chairman Dick Durbin (D-Ill.) conceded to reporters that no Republican senator with whom he spoke by Thursday said that he or she planned to buck GOP leadership to vote for the judge.",
    "Exiting: Rep. Filemon Vela (D-Texas), who said last year he would not seek reelection, will resign from Congress early to begin work with law and lobbying firm Akin Gump (Punchbowl News and Texas Tribune).",
    "The United States also levied fresh sanctions against five entities and individuals in Russia and North Korea over alleged transfer of sensitive items to the North’s missile program (The Associated Press).",
    "The Senate Judiciary Committee is expected to vote on Jackson’s nomination on April 4 and Democrats would like to see the Senate confirm the nominee before members leave town for a two-week Easter break.",
    "State trends: The Republican-dominated Arizona Legislature voted on Thursday to back bills that would prohibit gender surgery for minors and ban transgender athletes from playing on girls sports teams.",
    "In Brussels, Biden worked to fortify the resolve Western partners to sustain economic punishments aimed at Russia, despite the pain experienced within Europe and the U.S., including rising oil prices.",
    "He said he is exempting special unvaccinated sports celebs from the strictures of the local private-sector vaccine mandate that by definition would not allow them to perform in New York stadiums.",
    "What you touch, what you breathe: The Hill’s Yi Hou reports that researchers continue to investigate coronavirus transmission on surfaces in addition to the pervasive spread of COVID-19 by air.",
    "They announced the creation of a joint White House-European Union task force focused on reducing Europe’s dependence on Russian fossil fuels, with specific goals for LNG supplies through 2030.",
    "John Fetterman, who is pulling ahead in the nominating contest with an outsized personality, a pile of cash and a playbook that mirrors past populist campaigns, reports The Hill’s Hanna Trudo.",
    "******\nADMINISTRATION: Pentagon: Biden is expected to ask Congress for $813.3 billion in defense and national security spending for fiscal year 2023, which begins in October (Bloomberg News).",
    "The collection of messages, which were turned over to the House select panel investigating the Jan. 6 attacks on the Capitol, do not directly reference Justice Thomas or the Supreme Court.",
    "McConnell’s announcement and the tough questioning this week by Senate Republicans underscored shrinking options for GOP “yes” votes for Biden’s nominee, reports The Hill’s Jordain Carney.",
    "The vice president will meet with the National Hispanic Caucus of State Legislators in her ceremonial office at 3 p.m.\nBlinken was in Belgium with the president and is with him in Poland.",
    "IN FOCUS/SHARP TAKES\nCORONAVIRUS: Total U.S. coronavirus deaths reported each morning this week: Monday, 971,162; Tuesday, 972,634; Wednesday, 973,437; Thursday, 974,830; Friday, 975,862.",
    "She has defended her rulings in criminal cases, encouraging Congress to legislatively change federal sentencing guidelines if lawmakers object to the parameters courts have been handed.",
    "The Associated Press: Germany today announced contracts with new suppliers to allow the country to significantly reduce its reliance on Russian coal, gas and oil in the coming weeks.",
    "Biden plans to participate in Saturday meetings and events related to NATO defense and the humanitarian impacts of the ongoing crisis in Ukraine before flying back to Washington.",
    "The U.S. requested an open Security Council meeting and anticipates such a session today, Linda Thomas-Greenfield, the U.S. ambassador to the United Nations, told reporters.",
    "She will then fly to Memphis, Tenn., to speak this afternoon at St. Jude Children’s Research Hospital about administration efforts to support cancer research to find cures.",
    "An extended Friday hurrah for all esteemed Morning Report Quiz winners who are on top of trivia about the 94th Academy Awards (happening Sunday), plus some Oscars history.",
    "Special U.S. Presidential Envoy John Kerry is in Doha, Qatar, to participate in the Doha Forum through Sunday to discuss international climate change mitigation efforts.",
    "Jackson, who has now been through Senate confirmation proceedings three times, avoided major missteps during her testimony but did not appear to win over Republicans.",
    "“I don’t criticize anybody for asking that question,” Biden said, “but the next election, I’d be very fortunate if I had that same man running against me” (The Hill).",
    "“Being healthy is not just about being physically healthy, but being economically healthy,” Adams said against the backdrop of Citi Field, home of the New York Mets.",
    "Candidates gathered there this week are looking for a unified approach to mission and message that could put the otherwise splintered party in control next year.",
    "?At least a dozen states have proposed sending several hundred dollars each directly to taxpayers to offset rising food and fuel costs (The Associated Press).",
    "The Hill’s Amie Parnes writes that COVID-19 and its variants manage to find the most security-conscious, vaccinated and boosted VIPs along with everyone else.",
    "The White House wants to enact a measure as soon as possible that addresses emerging COVID-19 response needs, including additional vaccine doses (The Hill).",
    "The president this morning met with European Commission President Ursula von der Leyen followed by a joint press conference at the U.S. Mission in Brussels.",
    "House Republicans are embracing a midterm campaign strategy that has little to do with Trump, The Hill’s Max Greenwood reports from sunny Ponte Vedra, Fla.",
    "Champions who delivered standout performances: Mary Anne McEnery, Patrick Kavanagh, Pam Manges, John Donato, Robert Bradley, Jack Barshay and Steve James.",
    "But the issue has become front-and-center in Republican-led statehouses since Idaho lawmakers passed the nation’s first sports participation law in 2020.",
    "The request would represent a $31 billion increase over the $782 billion in defense spending included in the government funding bill enacted this month.",
    "At the airport, Biden will receive a briefing about the humanitarian response inside Ukraine and help being provided to millions of Ukrainian refugees.",
    "Poll: A majority of Republicans predict their votes this fall will be “against Biden,” according to a Pew Research Center survey released Thursday.",
    "Finally, during their cinematic careers, this year’s five Best Director nominees collectively account for 16 Academy nominations in that category.",
    "However, the administration believes many will prefer to remain near Ukraine while envisioning they might eventually reunite in their own country.",
    "Biden said his decision to help Ukrainian families relocate after fleeing into Europe is aimed at “reuniting” families separated by the conflict.",
    "In two recent studies, teams of researchers found that omicron lasted longer on surfaces and on human skin compared with other COVID-19 variants.",
    "The deadly 2021 toll of COVID-19 in the U.S. combined with Americans’ physical relocations during the pandemic impacted new population counts.",
    "Jackson, if confirmed, would not join the court until after the retirement of Justice Stephen Breyer, expected this summer (The Hill).",
    "The president’s job approval is 41 percent overall and 38 percent on the economy, according to the latest RealClearPolitics average.",
    "The Associated Press: The U.S. will increase aid to Ukraine for food, medicine, water and other supplies, described in detail HERE.",
    "Hill.TV’s “Rising” program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    "Biden reiterated his view that China understands its economic future is hinged more closely to the West than to ally Russia.",
    "The State and Defense departments at the highest levels in Washington on Thursday and Friday conferred with allies in Asia.",
    "In offering to accept up to 100,000 Ukrainian refugees, the Biden administration faces considerable processing challenges.",
    "He points to the April 1 European Union-China summit as the next chance for the West to discuss Putin’s war with China.",
    "The U.S. and other nations are commiting to increasing LNG exports to Europe by 15 billion cubic meters this year.",
    "The two elections are seen as bellwethers for the future of labor organizing inside the tech behemoth (The Hill).",
    "TECH: Workers at a New York Amazon facility on Staten Island begin voting today to decide if they will unionize.",
    "… Inflation-mitigating rebate checks are an emerging idea, including in California, Kansas, Maine and Minnesota.",
    "After Russia’s annexation of Crimea in 2014, the G8, which had expanded to include Russia, reverted to the G7.",
    "Multiple rocket launch systems, anti-warship systems, air defense systems, can we fight this war without it?",
    "Two-thirds of American counties recorded population drops last year, according to census figures (The Hill).",
    "The U.S. admitted just 11,400 refugees from all nations in fiscal 2021 versus a target of 125,000 refugees.",
    "Bloomberg News: The U.S. and the European Union are closing in on a deal to cut demand for Russian energy.",
    "Reuters: Russia will not be swayed by Western sanctions, Dmitry Medvedev, former Russian president, says.",
    "After the event, she will fly to Denver to attend an evening Democratic National Committee finance event.",
    "… Thomas was hospitalized a week ago in Washington with an infection and has missed some oral arguments.",
    "OPINION\nThe U.S. starts to shoulder its Ukrainian refugee share, by The Washington Post editorial board.",
    "In Pennsylvania’s Senate Democratic primary, the gloves have yet to come off against contender Lt. Gov.",
    "We get you up to speed on the most important developments in politics and policy, plus trends to watch.",
    "On the one hand, there are tough COVID-19 vaccine restrictions — but also hometown money to consider.",
    "The Senate convenes at 3 p.m. Monday and resumes consideration of the America COMPETES Act of 2022.",
    "The court would not comment on Thursday on the health status of the 73-year-old justice (The Hill).",
    "Reuters: Poland sanctioned Russian bank accounts, expeled Russian diplomats while Moscow protested.",
    "The New York Times: The U.S. added new sanctions on Russian lawmakers, defense companies and gold.",
    "The Hill: White House has a team in place to respond to potential chemical weapons use by Russia.",
    "Democrats can confirm her without any GOP votes as long as all 50 Democratic senators are united.",
    "“You can give us 1 percent of all your planes, 1 percent of all your tanks, 1 percent,” he said.",
    "First lady Jill Biden will be in Philadelphia this morning to attend a private memorial service.",
    "He will also meet with U.S. service members from the 82nd Airborne Division stationed in Poland.",
    "We invite you to share The Hill’s reporting and newsletters, and encourage others to SUBSCRIBE!",
    "In the evening, the president will fly from Rzeszów to Warsaw, where he will remain overnight.",
    "McCarthy, who aspires to be Speaker, boasted that his party will capture the House decisively.",
    "Within two years, Germany believes it can become almost entirely independent of Russian gas.",
    "They are all, in essence, “living with the virus” during the latest stage in the pandemic.",
    "Until two years ago, no state had passed a law regulating gender-designated youth sports.",
    "They knew that “King Richard” actor Will Smith was nominated for his first Academy Award.",
    "At the same time, workers at Amazon’s warehouse in Bessemer, Ala., end voting on Monday.",
    "It’s now blocked in court, along with another in West Virginia (The Associated Press).",
    "Who was the last Supreme Court pick nominated by a Democrat whom McConnell supported?",
    "The first lady will remain overnight for weekend events in Colorado and California.",
    "They didn’t take it, by Sheryll Cashin, contributing editor, Politico Magazine.",
    "Please recommend the Morning Report to friends and let us know what you think.",
    "https://wapo.st/3wAxuMd\nThe Jackson hearings were an opportunity for the GOP.",
    "Biden, 79, has said he intends to seek reelection with Harris on the ticket.",
    "https://politi.co/3D9Q9zU\nWHERE AND WHEN\nThe House meets at 2 p.m. Monday.",
    "The Hill: Here are five of the most memorable moments from the hearings.",
    "The Associated Press: Poland is a complex ally on Ukraine’s doorstep.",
    "The Hill: Biden touts steps to bolster NATO’s collective defense.",
    "Biden flies to Rzeszów, Poland, where President Duda greets him.",
    "“It’s not going to be a five-seat majority,” he said (The Hill).",
    "At the time, conservatives had former President Reagan in mind.",
    "Of that number, $773 billion of that would be for the Pentagon.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Readers can find us on Twitter @asimendinger and @alweaver22.",
    "“I raised the possibility,” he said (The New York Times).",
    "Email: asimendinger@thehill.com and aweaver@thehill.com.",
    "“I’ve been in refugee camps,” Biden said on Thursday.",
    "Alexis Simendinger and Al Weaver are the co-creators.",
    "These supplies depend on NATO’s political decisions.",
    "THE CLOSER\nAnd finally … It’s that time of the week!",
    "History and current events could be on their side.",
    "Click here to subscribe to our latest newsletter.",
    "“I’ve been in war zones for the last 15 years.",
    "Breyer, confirmed by a vote of 87-9 in 1994.",
    "Also, check out the “Rising” podcast here.",
    "And it’s — it’s devastating,” he added.",
    "Vice President Harris can break a tie.",
    "Welcome to The Hill’s Morning Report.",
    "Live-link information HERE.",
    "We want to hear from you!",
    "CLICK HERE to subscribe!",
    "“We cannot buy it.",
    "See all Video",
    "Friday!",
    "ET.",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}