{
  "id": 12145,
  "mediaId": 8270,
  "date": "2022-03-26",
  "headline": "U.S. Senate candidate makes a campaign stop in Reading",
  "image": "https://www.readingeagle.com/wp-content/uploads/2022/03/IMG_6753.jpg?w=1024&h=768",
  "link": "https://www.readingeagle.com/2022/03/26/u-s-senate-candidate-makes-campaign-stop-reading/",
  "mediaOutlet": "berksmontnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Mekeel",
  "authorUrl": "https://www.readingeagle.com/author/david-mekeel/",
  "termIds": [
    0
  ],
  "sentences": [
    "If Fetterman does end up making his way through the Democratic primary and the general election, he said his time at the Capitol will be focused not on political fights but on making positive things happen for the people of Pennsylvania and the U.S.\n“I would like to get done as much as possible,” he said, adding that he hopes to steer clear of the vitriol that has recently dominated national politics.",
    "Fetterman said his love for Reading and Berks is genuine, that when he speaks of his found memories of Schell’s and V&S sandwich Shop and his time as an undergraduate at Albright College it isn’t about “political glad-handling.” He was born in Reading Hospital, he explained, and both of his sets of grandparents lived in Berks.",
    "Fetterman said he doesn’t see a need to differentiate himself from his competitors when it comes to issues — each have items on their platforms that he likewise supports — instead urging voters to consider who has the best change to beat a Republican nominee in the fall.",
    "As he walked into the Berks County Democratic headquarters on Saturday afternoon, ducking slightly to get his 6-foot-8-inch frame through the doorway, he quipped about his well-known love for hotdogs from Schell’s Miniature Golf & Restaurant in Muhlenberg Township.",
    "Fetterman pointed out that he’s the only candidate to win a statewide election, and spoke with pride about the “true grassroots” fundraising effort that has resulted in an explosion of individual donors.",
    "Fetterman acknowledged the socioeconomic challenges cities like Reading are facing, saying he saw similar ones during his four terms as mayor of Braddock in the western part of the state.",
    "He then turned to acknowledge the woman standing beside him, telling the crowd he knew they were really there to meet “everyone’s favorite,” his wife, Gisele.",
    "The current lieutenant governor is in the midst of a campaign to earn the Democratic nomination for the race for the U.S. Senate.",
    "He said that bipartisanship is a wonderful idea, but it won’t keep him from standing up for the country’s democratic principals.",
    "“I work with the other side, but not when someone thinks that Jan. 6 is ‘legitimate political discourse,’ ” he said.",
    "“I have a keen understanding of and experience with communities that were once industrial powers,” he said.",
    "The field for the Democratic nomination is a bit crowded, with five candidates currently running campaigns.",
    "“This is not professional wrestling.”\nOf course, Fetterman added, there’s a limit to that.",
    "They could be places of opportunity, he said, if only they receive the support they need.",
    "Fetterman said that places like Reading have “great bones” and important histories.",
    "He’s on a mission, and he’s looking for Berks County’s help in accomplishing it.",
    "But Fetterman’s visit to Reading wasn’t just about scoring easy points.",
    "John Fetterman knew what the crowd wanted, and was happy to deliver.",
    "The move, of course, elicited a rousing round of applause.",
    "“They just need some attention and investment,” he said.",
    "And he knows how Washington can help them thrive.",
    "He knows the city, he said, he knows the county.",
    "In Fetterman’s mind, he’s that candidate.",
    "“I’m running on my record,” he said."
  ]
}