{
  "id": 1247,
  "mediaId": 2732,
  "date": "2022-02-11",
  "headline": "Starbucks workers at Pittsburgh’s Bloomfield store join nationwide unionization wave",
  "image": "",
  "link": "https://triblive.com/local/starbucks-workers-at-pittsburghs-bloomfield-store-join-nationwide-unionization-wave/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Deto",
  "authorUrl": "https://triblive.com/author/ryan-deto/",
  "termIds": [
    0
  ],
  "sentences": [
    "Starbucks officials also refuted some of the workers claims, saying the Bloomfield store does have covid-19 mitigation efforts like less chairs, and it has closed in the past when cases are high, with workers given catostrophe pay or shifts at other stores.",
    "They include low pay, being told to not to discuss pay among workers, working in 95 degree temperatures with no air conditioning, no catastrophe pay during power outages and waterline maintained, and having some covid-19 safety concerns ignored.",
    "“We’ve been clear in our belief that we are better together as partners, without a union between us, and that conviction has not changed.”\nWhen asked, workers at the Bloomfield Starbucks directed the Tribune-Review to union representatives.",
    "“In becoming the first store in Pittsburgh to file for an NLRB election, the Bloomfield workers bring the national campaign’s explosive momentum to the cradle of the early US labor rights movement,” the committee said in a statement.",
    "A union is the way to do that.”\nIn a statement, Starbucks officials said they are listening the employees, which they call partners, in stores across the country, but ultimately are against partners unionizing.",
    "The Pittsburgh workers are the first Starbucks employees in the region to file for union with the National Labor Relations Board, according to the Bloomfield Starbucks Organizing Committee.",
    "Workers United has more than 80,000 members in North America, working in the laundry, hospitality, manufacturing, apparel and textile, and food service industries including baristas.",
    "Workers sent a letter to Starbucks’ CEO Kevin Johnson, reiterating their solidarity with the fired employees in Memphis and outlining other grievances they have with the company.",
    "“Starbucks success—past, present, and future—is built on how we partner together, always with Our Mission and Values at our core,” said a statement from Starbucks spokesperson.",
    "Workers there join the unionization movement that has taken hold since Starbucks employees at two locations in Buffalo successfully unionized last December.",
    "Workers at the local chain Coffee Tree Roasters are currently in a battle for unionization at the company’s five stores located throughout Allegheny County.",
    "Workers at the Starbucks location in Bloomfield on Friday became the first of the coffee chain’s employees in the Pittsburgh region to file to unionize.",
    "Officials also acknowledged the power did go out in summer 2021 when temperatures were high, but said workers were sent home and given catastrophe pay.",
    "“In the Starbucks boardroom there is an empty chair, symbolizing us: the baristas and play-callers who cannot be at the table,” the committe said.",
    "The Bloomfield workers not only join other Starbucks unionization across the country, but also other barista efforts to unionize in Pittsburgh.",
    "Bloomfield workers are organizing with Workers United Pennsylvania Joint Board, an affiliate of the Service Employees International Union.",
    "This comes as a wave of unionization has hit the international coffee giant, including efforts at more than 60 stores across 14 states.",
    "Pittsburgh’s push came just after Starbucks fired seven workers in Memphis who were involved in union organizing efforts.",
    "“Pittsburgh is a union town - it is our turn to join that history.”\nThe store is located on Liberty Avenue in Bloomfield.",
    "and Senate candidate John Fetterman, D-Braddock, who also supported workers effort at Coffee Tree Roasters.",
    "Bloomfield Starbucks workers asked that the company not interfere with their request for a union election.",
    "They are also requesting the ability to receive monetary tips digitally and more consistent scheduling.",
    "“It’s time for all Starbucks workers, from Pittsburgh to Buffalo, to have a union.",
    "Nothing goes better with a cup of coffee than a strong union,” said Fetterman.",
    "You can contact Ryan by email at rdeto@triblive.com or via Twitter .",
    "Categories: Bloomfield | Business | Local | Pittsburgh | Top Stories",
    "We want our seat at the table to be tangible, physical, real.",
    "The effort has garnered support of Pennsylvania Lt. Gov.",
    "Ryan Deto is a Tribune-Review staff writer.",
    "We are done with symbolism."
  ]
}