{
  "id": 13456,
  "mediaId": 2745,
  "date": "2022-03-15",
  "headline": "The Trailer: Decertify the 2020 election? In Wisconsin, it may be on the ballot",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HIM4MRVERII6ZBRIHWSPVD4HCQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/15/trailer-decertify-2020-election-wisconsin-it-may-be-ballot/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "It's almost a litmus test.”\nIn just the last four weeks, a state legislator who believes the election can be decertified has jumped into the race for governor; former lieutenant governor Rebecca Kleefisch (R), who has led in polls of that primary, would not say if she would have certified the 2020 election; and a Vos-appointed special counsel told the legislature that it “ought to take a very hard look” at decertifying President Biden’s 10 electoral votes in the state.",
    "“They may have done other things, I believe, that caused the Democrats — who have been sitting there for the last decade looking at what areas of our election law can they exploit — to take advantage.”\nOn Friday, at a meeting of the conservative Rock River Patriots in Fort Atkinson, activists and candidates, including Steen, asked why their leaders in Madison had not acted in 2020 to prevent the election changes that Gableman was now calling illegal.",
    "This spot runs through the greatest hits of an energetic campaign rally, with Britt calling herself a “mama on a mission,” her voice almost cracking when she says that children “should be taught to love this country, not that they're good or bad based on the color of their skin.” The candidate comes off less like an ex-Senate staffer — which she is — than a conservative mother trying to get critical race theory out of her kids' school.",
    "He's more involved when Trump demands findings from special counsel John Durham's investigation of the so-called “Russiagate” probe, because he thinks the president wants an ad hoc team to “rifle through Durham's materials and publish right away whatever documents helped Trump.” But he doesn't speak out between leaving his office and reacting to the Jan. 6 insurrection by issuing a public condemnation.",
    "The rigging of Dominion voting machines, the idea that a video of ballots being moved from under a table in Georgia was evidence of fraud, that the heavily pro-Biden absentee votes in Detroit and Milwaukee were fraudulent, that “thousands of votes in Nevada had been cast by nonresidents,” and that a truck driver had driven ballots from Long Island to Pennsylvania, already filled out for Biden.",
    "“COVID may not ever fully go away, but can be managed and we should find ways to get on with life without major restrictions”: 66%\n“COVID is still a serious threat that should continue to be treated as a public health emergency that includes restrictions”: 19%\n“COVID was never a serious threat, and we should just move on from it”: 13%\nThey're called “political extremes” for a reason.",
    "Instead of an attorney general who fought conservatives, Labrador said he'd be one who “actually helps the legislature and legislators pass their legislation, and not becomes a hindrance.”\nConservatives filed to challenge Superintendent of Public Instruction Sherri Ybarra, too: former State Board of Education President Debbie Critchfield and ex-state Sen. Branden Durst.",
    "Sarah for Wisconsin, “Common Sense.” The first U.S. Senate campaign ad from Wisconsin State Treasurer Sarah Godlewski (D) mentions her job halfway in, saying that she runs the office on “common sense, not conspiracies.” But she also describes a state forging its way through a crisis, with no mention that the governor and the president are in the same party as her.",
    "The memoir begins with a re-creation of the days before Barr offered his resignation to Trump, who accepted it with a fist-slam that sounded “almost like a gunshot.” The gist has been reported, but in Barr's own words, the Department of Justice dug into numerous allegations that have lived on in Trump's own speeches and conspiracy theories about the election.",
    "His report on the election, issued last month and presented to legislators at a March 1 hearing, suggested that the election had been compromised, by everything from the election commission lifting a rule that required monitors to witness votes cast by nursing home residents, to election management grants from the Center for Tech and Civic Life.",
    "But at the time I took the graphs and told the president I would look into it.”\nThe picture Barr paints in the election portions of the book is, again, familiar: Republican appointees who know that the election fraud claims are frivolous say so to each other, but can't really stop Trump from talking about them.",
    "“I am committed to continuing my husband’s legacy of fighting to secure the border, defending conservative values, safeguarding the integrity of our elections, and serving the people of Minnesota’s First Congressional District.”\nHagedorn had kidney cancer and died on Feb. 17, just a year into his second term.",
    "Before that, he describes Trump handing him a document of what Trump calls “statistically impossible” gains for Biden when absentee votes are counted in Wisconsin and Michigan,\n“I thought the late ‘drops’ of predominantly Democratic votes probably reflected those urban and absentee ballots,” Barr writes.",
    "The demands have grown louder and more numerous since last June, when Vos appeared at the state GOP’s convention and announced that he would answer concerns about the election by appointing Michael J. Gableman, a former state Supreme Court justice, as a special counsel with the power to investigate it.",
    "Evers has made “democracy” one of the pillars of his reelection campaign, running as a bulwark against Republican election reform plans that would ban drop boxes, restrict absentee voting and abolish the bipartisan Wisconsin Elections Commission — created by Republicans seven years ago.",
    "Former attorney general William P. Barr's memoir “One Damn Thing After Another” dropped last week, and he's been on a busy media tour since then, with a now familiar pattern: Ex-Trump official criticizes the ex-president, then confirms that he would support him over a Democrat in 2024.",
    "The Gableman investigation, demanded by conservative activists, had kept pressure on election officials and generated explosive headlines — and were interpreted, in some conservative media, as breakthroughs on the way to a full-scale election audit leading to decertification.",
    "But we won't let them forget about that.”\nIn other states, especially after the filibuster-assisted death of federal voting rights legislation, Democrats have been wary about focusing on election issues at the expense of inflation, gas prices or Russia’s invasion of Ukraine.",
    "Republicans are more focused on two down-ballot offices where their preferred candidates did file — the open race for state controller, where former Mitt Romney policy adviser Lanhee J. Chen is running, and the first election for appointed Attorney General Rob Bonta.",
    "“They didn't bring in buckets full of ballots and shove them through in the middle of the night,” said Wanggaard, pointing to a debunked story from Georgia — that a box of ballots in one counting room was actually a suitcase of fraudulent ballots added to the count.",
    "The audience of more than a hundred activists, meeting at a church, booed at mentions of the Republican “establishment,” and cheered when Ramthun said that he'd raised the $100,000 necessary to compete for the party's endorsement at this summer's convention.",
    "A number of other right-lane candidates filed, too, including activist Ed Humphreys (who calls Idaho the “last foxhole for freedom” in America), and Steve Bradshaw, who accused Little of inflicting “unconstitutional” covid restrictions on the state in 2020.",
    "Lamb's new ad focuses on “democracy” and the Jan. 6 insurrection, not the state's economic picture, and its recap of his biography boils it down to military service, work as a prosecutor and a three-time winner against the “Trump machine” in Pennsylvania.",
    "At a forum last week, Wasden defended his decision not to join the Texas case, saying it “wasn’t about the integrity of the election” and relied on an unconstitutional theory that states could sue each other; Labrador said that he would have pursued it.",
    "In Racine, before Vos spoke, state Sen. Van H. Wanggaard (R) told the audience that “my personal feeling is that our previous president should have won the election,” though he didn't “believe that there was widespread fraud that occurred” in Wisconsin.",
    "None of the ambitious Republicans who challenged him in last year's recall election put their names forward — not Larry Elder, not former San Diego Mayor Kevin Faulconer, and not Assemblyman Kevin Kiley, who's running for a new seat in Congress.",
    "Every time they come up with a plan to jail mayors or dismantle the elections commission, it says this is a five-alarm fire.”\nAt Republican events this week, there was brimming enthusiasm for wins in 2022, and plenty of discussion about 2020.",
    "RACINE, Wis. — When Wisconsin State Assembly Speaker Robin Vos (R) arrived at Saturday’s Republican caucus, he drove past a half-dozen protesters with “Toss Vos” signs, playing Buffalo Springfield's “For What It’s Worth” on a karaoke speaker.",
    "Their special guest, rallying after losing his voice, was state Rep. Timothy S. Ramthun (R), who had entered the race for governor after Vos had undermined his report — which preceded Gableman's — urging for the election to be decertified.",
    "Carnahan was forced to resign as party leader last summer, after a party donor was indicted on sex trafficking charges, a final straw for Republicans who accused her of consolidating power without putting the party in a position to win.",
    "Barr has “no problem,” for example, with Trump calling state legislators to Washington to urge them to investigate election claims; he worries, a little, that this will be used to stoke a constitutional crisis, but doesn't say anything.",
    "And as Politico's Olivia Beavers reported last week, a potential Carnahan candidacy made Republicans nervous, with some speculating that she could lose to a Democrat in the Aug. 9 election for a seat that went for Trump by 10 points.",
    "“The Republican strategy of having highly public fights about the most extreme ideas that would be the most dangerous to democracy has been a menace to Constitution, but a gift to the Democratic Party,” Wikler said in an interview.",
    "John Fetterman has led in polls of the Democratic U.S. Senate primary, and begun running ads where his story of moving to a shrinking city and becoming its mayor weaves into his promise to bring back other struggling towns.",
    "Friends of Andrew Cuomo, “The Record.” The ex-governor's campaign fund has bankrolled its second ad, which makes the same angry case as the first: That New York was robbed of a great leader when Cuomo was forced to resign.",
    "“I think that the excuse makers are running out of excuses.”\nRamthun's decision to run for governor, which he announced at a rally with MyPillow founder Mike Lindell, didn't dramatically alter the GOP's view of that race.",
    "“Within one month of a Republican governor being sworn into office in January of 2023, we are going to have election integrity, where we don't have unsecured drop boxes at all in the state of Wisconsin,” Vos promised.",
    "Britt for Alabama, “Rally for Faith and Freedom.” Katie Britt is 30 years younger than Rep. Mo Brooks (R-Ala.), the Trump-endorsed candidate in the race for the seat held by retiring Sen. Richard C. Shelby (R-Ala.).",
    "Former Minnesota GOP chair Jennifer Carnahan declared her candidacy in the 1st Congressional District on Monday, weeks after the death of Rep. Jim Hagedorn (R-Minn.), her husband, created a summer special election.",
    "But two current Republicans, former U.S. Attorney Nathan J. Hochman and 2020 congressional candidate Eric Early — who gained some notoriety by challenging Rep. Adam B. Schiff (D-Calif.) — joined the race, too.",
    "Democrats held their nominating convention in Santa Fe last weekend, setting up a June primary for their attorney general nod and, most likely, picking a candidate in the redrawn 2nd Congressional District.",
    "But Ramthun had, and spoke plainly about how voting to pull back Biden's electors, even if it did not restore the presidency to Trump, would put Wisconsin on record that the president did not win the state.",
    "His deficit-hawk votes against defense bills become votes to “cut off funding to destroy ISIS terrorists,” and his skepticism that Trump was a real conservative — Brooks had endorsed Sen. Ted Cruz (R-Tex.)",
    "The bills didn't pass, but Wasden's repeated warnings that the legislators were passing unconstitutional bills — the state has paid millions of dollars to settle fines — angered critics like Labrador.",
    "Kleefisch — who won two statewide races as the running mate of former governor Scott Walker (R) — was by far the best-known GOP gubernatorial candidate in this month's Marquette Law poll of the race.",
    "“I would like for the Wisconsin Legislature to take a roll-call vote and determine whether the assemblymen and women stand with the people,” said Adam Steen, a conservative challenger to Vos.",
    "“You could pick almost any member out of the congressional register and come up with similar attacks.”\nDemocrats and Republicans will pick their nominees in a May 24 primary, with no runoff.",
    "After he declined to join the Texas-led 2020 lawsuit to challenge the presidential election in Pennsylvania, legislators threatened to reallocate some of Wasden's powers and budget to them.",
    "That left state Sen. Brian Dahle (R), who represents the state's northeast counties and briefly led his party in the state assembly as the only Newsom challenger who's held elected office.",
    "The race for the House ballot was more lopsided: Las Cruces city councilor Gabe Vasquez ran away with it, grabbing nearly 81 percent of the vote, and boxing out physician Darshan Patel.",
    "McGeachin has repeatedly undermined the governor, issuing an executive order banning masks last year while Little was out of state; the governor reversed it when he got back to Boise.",
    "“I'm not the only one getting the scrutiny and criticism anymore,” said Ramthun, who was greeted with news stories calling him a “conspiracy theorist” when he launched the campaign.",
    "One of Little's challengers that year was ex-Rep. Raúl R. Labrador, who filed to challenge Attorney Gen. Lawrence Wasden, a fellow Republican seeking an unprecedented sixth term.",
    "Fifteen months after the 2020 election, conservative anger at Donald Trump's loss, and the idea Republicans could still wipe it off the books, has dominated local GOP politics.",
    "But in the states where the presidential election was closest, where the Trump campaign and conservative groups went to court to stop Biden’s victory, the topic is inescapable.",
    "In this edition: Why it's still 2020 for Wisconsin Republicans, what the last-minute candidate filings mean in Idaho and California, and what to know about Bill Barr's book.",
    "It seemed unthinkable that mayors who presided over high turnout that Republicans called suspicious would be held accountable, until Gableman threatened them with jail time.",
    "Ron DeSantis (R) view, is that the pandemic was at best an overhyped excuse for virtue-signaling and “theater,” and at worst a “plandemic” created to suppress human freedom.",
    "Eight Republicans have entered the race since then, including former state Rep. Brad Finstad and two current members of the state House, Nels Pierson and Jeremy Munson.",
    "The first race was destined to go to a primary, with two candidates coming into the weekend with enough support to crack the 20 percent threshold for a ballot position.",
    "“As a nation, we have to stop saying it's unconstitutional to reclaim the electors, because constitutional experts are saying it is,” Ramthun, 65, said in an interview.",
    "Republican-turned-independent Anne Marie Schubert filed there, running a tough-on-crime campaign but ditching a party that hasn't won a statewide race here since 2006.",
    "The people who considered decertification to be impossible now had to confront a special investigator, whose term had just been extended, telling them that it wasn't.",
    "A fairly common left-wing view is that it's irresponsible to lift restrictions or demand people return to indoor work so long as coronavirus variants are circulating.",
    "But this poll, which finds the electorate ready to vote Republican in November, also finds just one-third of all voters holding a zero-covid or over-covid position.",
    "That, say Democrats, has made it easier for them to motivate their base and open donor wallets, in a midterm cycle when that's traditionally hard to pull off.",
    "In 2021, said Wisconsin Democratic Party chair Ben Wikler, the state party raised more than $10 million, obliterating the fundraising record in an off-year.",
    "“It's an election year so Sherri is back to pretending to be conservative,” Durst said after the incumbent rolled back some Common Core education standards.",
    "But Trump is pictured, several times, absorbing false information, and only that day does Barr clearly call it an unprintable word that refers to excrement.",
    "“In the final weeks before his passing, Jim told me to keep forging ahead, to keep reaching my dreams, and to win this seat,” Carnahan said in a statement.",
    "Alabama's Future, “Cut Off.” While Britt's own spots focus on her, and stay positive, this pro-Britt PAC has moved on to negative attacks on Brooks.",
    "Candidate filing ended on Friday, setting up a number of Republican primaries with the party's far right challenging its conservative establishment.",
    "Dahle jumped into the fray last month, saying that the state had declined under the rule of “elitist liberals” like the “dictator” in Sacramento.",
    "Just 15 percent of Republican voters could identify Ramthun, and just 5 percent started out with a favorable view of the two-term legislator.",
    "Two-thirds expect the virus to “not ever fully go away” and want policymakers to avoid “major” (not defined here) impediments on normal life.",
    "“I feel confident that Robin will exercise his moral duty to follow up on Justice Gableman’s findings,” Trump said in a statement last week.",
    "“Our country would descend into chaos if an incumbent administration could ignore election results based solely on bad assertions of fraud.”",
    "It's the other guys!”\nAfter that, the anti-Vos resolution was crushed — but it wasn’t the first, and it didn’t end the primary challenge.",
    "State auditor Brian Colón won 61 percent of the delegates' votes for attorney general, while county attorney Raúl Torrez got 39 percent.",
    "This one, like the ads that hit Brooks in his 2017 special election campaign, recast his conservative votes and views as liberal ones.",
    "And while Trump had praised the Gableman report, his statements urging Republicans to decertify the election didn't mention Ramthun.",
    "It had been impossible to imagine a special counsel being appointed to study the election, until conservatives pushed Vos to do it.",
    "But this spot is narrated by Cuomo himself, sounding like a candidate for his old job, who “never will” stop fighting for New York.",
    "“I had asked all the DOJ office heads around the country, working with the FBI, to look into these and a number of similar claims.",
    "Nine months later, Gableman is still investigating the election, on a contract that was just extended through the end of April.",
    "for president — becomes proof that he was “too weak” to clearly say that Trump deserved the presidency over Hillary Clinton.",
    "Both are running to ban critical race theory in schools, and both have accused Ybarra of slow-walking conservative coals.",
    "“I would imagine that there can only be a Decertification of Electors.” Other Republicans would not go as far as that.",
    "The day he offered to resign, Trump was watching One America News and its mostly fake coverage of election questions.",
    "Vasquez had raised a bit less than $250,000 for his race by the end of last year; Patel had not filed an FEC report.",
    "“He goes from 306 electors to 296, right?” Ramthun said in an interview, shortly before Gableman issued the report.",
    "And when he stood up to address fellow Republicans, Vos was standing a few feet away from his primary challenger.",
    "But Patel has stayed in the race, arguing that his 19.6 percent of the vote should be rounded up to 20 percent.",
    "Some turned out to be patently frivolous; others just were not supported by the available evidence,” Barr says.",
    "Little benefited from a conservative split in 2018, winning that year's primary with 37 percent of the vote.",
    "They're the ones who cheated, not me.”\nAfter the report came out, Ramthun said that he had been vindicated.",
    "Not a whole lot, when it comes to the 2020 election, which is what this newsletter's mostly interested in.",
    "It's not enough to question whether the election was fair, or whether Biden should be in the White House.",
    "But the GOP is publicly debating whether they have the legal authority to decertify the 2020 election.",
    "“Trump, through his self-indulgence and lack of self-control, had blown the election,” Barr concludes.",
    "Wasden's fifth term has put him, again and again, into conflict with the party's right-wing base.",
    "“We need to make sure that our candidates running in 2022 focus on who our real adversaries are.",
    "When he walked inside, a four-page resolution condemning him was being passed around the room.",
    "“The really dangerous foes are the ones who keep their plans secret until they execute them.",
    "The filing deadline for June 7 primaries came and went on Friday, with good news for Gov.",
    "If elected, Carnahan would be the first Asian American member of Congress from Minnesota.",
    "“Strong leaders frequently end up with enemies,” Carnahan said in a statement to Beavers.",
    "The dominant conservative view of the coronavirus, which you could call the Florida Gov.",
    "“They may want to forget about that, when whoever wins the primary runs against me.",
    "“They are leapfrogging over each other to get the far, far right,” Wisconsin's Gov.",
    "“The actions legislators are taking right now are Band-Aid approaches at best.",
    "Trump has already taken a side in the race for governor, endorsing Lt. Gov.",
    "It's layering bureaucracy on top of existing bureaucracy,” said Ramthun.",
    "Barr's description of what happened when he told Trump is, largely, new.",
    "“This is not a partisan effort,” Gableman told the Republican audience.",
    "“We work as if our democracy is on the line, because it is,” he says.",
    "“If it becomes a constitutional crisis, that's what they deserve.",
    "“Now there's two ‘conspiracy theorists’ in the same foxhole.",
    "What's in Barr's book that hasn't been reported previously?",
    "Conor Lamb for Senate, “Must Win.” Pennsylvania Lt. Gov.",
    "“The decertification is not to pull back the presidency.",
    "You've seen it before, and you'll see it again.",
    "And covid's still not gone,” Godlewski says.",
    "But I've also made a difference,” he says.",
    "It's nice to not be alone.”\nCalifornia.",
    "Tony Evers (D) said in an interview.",
    "“Dairy farms still disappearing.",
    "“Give me a break.”\nNew Mexico.",
    "Janice McGeachin (R) over Gov.",
    "“I haven't been perfect.",
    "I've made mistakes.",
    "Which allegations?",
    "And that's not us.",
    "Gavin Newsom (D).",
    "Brad Little (R).",
    "“I was right.",
    "Prices up.",
    "Idaho."
  ]
}