{
  "id": 13926,
  "mediaId": 8489,
  "date": "2022-03-15",
  "headline": "Yes, prices at the pump are high. Republican primary candidates in Pa. have noticed too",
  "image": "https://whyy.org/wp-content/uploads/2022/03/2022-03-07-gas-prices-gasoline-pennsylvania-ap-1.jpg",
  "link": "https://whyy.org/articles/yes-prices-at-the-pump-are-high-republican-primary-candidates-in-pa-have-noticed-too/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Meyer",
  "authorUrl": "https://whyy.org/person/katie-meyer/",
  "termIds": [
    0
  ],
  "sentences": [
    "He thinks they boil down to the fossil fuel industry “exploiting this moment in time for their own financial interest,” and noted that European countries — where especially high energy prices have been a problem for months — have met the latest Ukraine-related hikes by “redoubling and committing to accelerate the transition to clean energy.”\n“We are relying on a 19th-century source of energy in the 21st century,” he said, adding that fossil fuels are “really a boom-bust economy from cradle to grave.”\n“It’s a volatile and reactive market,” he said.",
    "John Fetterman, a Western Pennsylvania progressive who has spent his U.S. Senate campaign saying he doesn’t think the commonwealth should transition too quickly away from fracking, recently put out a self-filmed video from a Sheetz gas station noting the high prices, and praising Biden’s decision to release 30 million barrels of oil from government reserves.",
    "Sean White, 40, who was filling up his motorcycle at a Wawa down the street from Tyndale at the Sunoco, described himself as an independent voter who won’t make any decisions based on gasoline, adding that it’s “the people above the politicians who control the gas prices.”\nBut GOP candidates are betting that others will get on board with their narrative.",
    "Mehmet Oz, the TV doctor running for the GOP U.S. Senate nomination, said at a recent Johnstown event that “Pennsylvania should be leading the nation in natural gas production, but Biden and the Democrats think they know better.” A primary opponent, former hedge fund CEO Dave McCormick, claimed “anti-American” policies were to blame for price hikes.",
    "But that hasn’t stopped Republicans from increasing their focus on gasoline prices and rising overall fossil fuel prices, and blaming President Joe Biden’s administration for both, even though crude oil prices aren’t always closely related to natural gas prices.",
    "“The decisions they make, and the way they affect prices, they would have made a better decision if they were really for the people.”\nExperts tend to agree that presidents and other politicians have relatively little to do with prices at the gas pump.",
    "If Biden and other western politicians have any blame to share, Rajendran added, it’s that their emphasis on pivoting away from fossil fuels and toward renewables may have inspired some of Wall Street’s reluctance to invest in oil and gas projects.",
    "“That started to kind of show itself even before the war, that supply was struggling to come back … compounded by the fact that demand was effectively almost back to pre-COVID levels.”\nThis political blame game over gasoline prices isn’t new.",
    "“It’s another part of the headwind that seems to be pushing in the faces of Democrats right now.”\nSome Democrats running in Pennsylvania’s big races have already tried to anticipate and counter the incoming GOP energy critiques.",
    "“I would say a lot of blame falls at the feet of Wall Street for kind of over-pivoting on this energy transition theme while ignoring the short-term needs of consumption domestically and globally,” he said.",
    "Julian Zelizer, a Princeton University political historian, and CNN analyst, said the energy crises of the 1970s provide an obvious blueprint for the damage high prices can wreak on an administration.",
    "“It’s not necessarily true … but my guess is it could be pretty potent.”\nMuhlenberg College pollster Chris Borick noted it will probably be a potent argument all the way down the ballot.",
    "“If we made more stuff here in America, not only would we create more good American jobs, but prices wouldn’t spike every time there’s a problem overseas,” Fetterman said in the video.",
    "Recent spikes in gasoline prices are closely tied with Russia’s invasion of Ukraine and the sanctions and American bans on importing Russian gas, oil, and coal that followed.",
    "In Biden’s case, “this just becomes part of a mix that the Republicans are going to talk about, in terms of things that are getting worse under the president,” Zelizer said.",
    "And as prices hit record — non-inflation adjusted — highs months before an enormously consequential primary election, Pennsylvania voters and candidates are taking notice.",
    "“I think it’s their fault.” he said of politicians at all levels of government, noting he thinks they tend not to be as affected by high prices as regular people are.",
    "David Masur, who heads the environmentalist group PennEnvironment, finds the conversations that Americans tend to have about rising gasoline prices to be frustrating.",
    "“I’m building a bicycle to start riding to work… I’m just waiting on my parts to come in,” he said, noting that he hasn’t ridden a bicycle in years.",
    "In the Republican gubernatorial primary, Sen. Jake Corman referred to “Biden’s disastrous war on domestic energy” in his call for a 50% gas tax cut.",
    "On Monday afternoon at a Sunoco station in Bensalem, Bucks County, Ricardo Tyndale, 31, filled up his tank while looking ruefully at the gas pump.",
    "“This issue, if it contributes to general dissatisfaction with the Biden administration, will have an impact on the midterm elections,” he said.",
    "Tyndale, who drives a BMW X5 SUV and uses premium gasoline to avoid engine problems, said he hasn’t thought a ton about midterm elections yet.",
    "Places like Bucks County, the purplest Philadelphia collar county and a perennial political battleground, are high on their lists of targets.",
    "“Because of the COVID downturn and the price crash that you had in 2020, you had two years of underinvestment on the supply side,” he said.",
    "Tom Wolf’s opposition to drilling on Pa. state lands constitutes a “radical agenda” that helps keep the U.S. dependent on foreign oil.",
    "Abhi Rajendran, who leads North American oil market research at energy information company Energy Intelligence, said that’s true.",
    "But mostly, he said, these gasoline price increases are driven by economic factors that are difficult for anyone to navigate.",
    "And Ricardo Tyndale, the frustrated Sunoco customer, said he’s already planning a lifestyle change to deal with that reality.",
    "Former congressman Lou Barletta has dubbed price increases “Bidenflation,” and former U.S. Attorney Bill McSwain said Gov.",
    "“And it’s always the consumers who pay the price.”\nPrices have begun to show signs of ticking downward in recent days.",
    "And even though he lives in a sprawling suburban area where most people drive everywhere, he wants to opt out.",
    "Republicans have often noted, though, that prices were already rising before the war in Ukraine began.",
    "Richard Nixon and Jimmy Carter, he said, were both “definitely hurt” by Americans’ gas pump problems.",
    "As gas prices hit record highs, visitors are testing electric vehicles at the Philly Auto Show.",
    "By extension, they’re also blaming the down-ballot Democrats they hope to face in November.",
    "There’s a long history of gasoline prices having outsized effects on political fortunes.",
    "By his analysis, prices were bound to hit $4 a gallon with or without a war.",
    "2 months ago\nNot all voters have been immediately susceptible to the pitch.",
    "But worries persist over where drivers will be able to charge them up.",
    "His daily commute to his job at Home Depot is pretty short, he said.",
    "But Rajendran emphasized that Biden isn’t a big part of that rise.",
    "But he does know who he thinks is to blame for these prices.",
    "The other day, he ordered a bunch of bike parts off Amazon.",
    "That hasn’t translated to lower prices at the pump yet.",
    "On Monday, costs per barrel fell below $100.",
    "“That’s how serious it’s about to get.”",
    "The numbers were getting close to $100.",
    "Lt. Gov."
  ]
}