{
  "id": 14126,
  "mediaId": 8380,
  "date": "2022-03-15",
  "headline": "Who Filed to Run for Office in Pa.'s May 17 Primary? The Full List",
  "image": "https://media.nbcphiladelphia.com/2019/09/GettyImages-1216006088.jpg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.nbcphiladelphia.com/decision-2022/who-filed-to-run-for-office-in-pa-s-may-17-primary-the-full-list/3178076/",
  "mediaOutlet": "nbcphiladelphia.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian X. McCrone",
  "authorUrl": "https://www.nbcphiladelphia.com?s=Author%3A%20%22Brian%20X.%20McCrone%22",
  "termIds": [
    0
  ],
  "sentences": [
    "They are: John Brown, a former elected executive of Northampton County and the party's 2016 nominee for lieutenant governor; Jeff Coleman, a former state lawmaker and political and marketing consultant; Teddy Daniels, a former police officer and Army combat veteran who is aligned with Trump and says he was outside the U.S. Capitol on the afternoon of the Jan. 6 insurrection; Carrie DelRosso, a freshman state lawmaker from suburban Pittsburgh; Russ Diamond, a state lawmaker from Lebanon County who was prominent in resistance to pandemic-era government measures; Christopher Frye, the mayor of New Castle; James Jones, who runs an oil and petroleum products trading business; Rick Saccone, a former state lawmaker from the Pittsburgh area who also was outside the U.S. Capitol on Jan. 6; and Clarice Schillinger, a Bucks County resident who got politically involved in school board races last year in a push against pandemic-era measures.",
    "They are: Lou Barletta, the GOP's nominee for U.S. Senate in 2018 and a former congressman known for his crusade against illegal immigration; Jake Corman, the top-ranking state senator; Joe Gale, a Montgomery County commissioner; Charlie Gerow, a marketing consultant and longtime conservative activist; Melissa Hart, a lawyer and former congresswoman; state Sen. Doug Mastriano, a force in Pennsylvania's right-wing politics who aligned himself with Trump and pushed to overturn 2020's presidential election; Bill McSwain, a lawyer who was the Trump-appointed U.S. attorney in Philadelphia; Jason Richey, a Pittsburgh-based lawyer who specializes in commercial and contract litigation; Dave White, who runs a large plumbing and HVAC firm and is a former Delaware County councilman; and Nche Zama, a heart surgeon who has directed units at various hospitals in Pennsylvania.",
    "They are: conservative activist Kathy Barnette, who has aligned herself with leading figures in the Trump-led push to overturn 2020's presidential election; real estate investor Jeff Bartos, who was the party's nominee for lieutenant governor in 2018; lawyer George Bochetto; lawyer Sean Gale; former hedge fund CEO David McCormick; Mehmet Oz, the self-styled health and wellness guru and author best-known as host of daytime TV's “The Dr. Oz Show;\" and Carla Sands, Trump's former ambassador to Denmark who ran her late husband's commercial real estate empire in California.",
    "Here's a look at the candidates who filed petitions in the state's top-of-the-ballot races:\nPennsylvania Governor\nThe Democratic Party's presumed nominee, Josh Shapiro, filed to run for governor in the midst of serving his second term as Pennsylvania's elected attorney general.",
    "1st District: Republican incumbent Brian Fitzpatrick is seeking a fourth term, and faces four challengers for the Republican nomination: Caroline Kay Avery, Alex Entin, Bradley James Lanning and Dasha Y. Pruett.",
    "Dozens of candidates filed to run for state offices and congressional seats in Pennsylvania before the 5 p.m. deadline on March 15, with especially large fields in the open races for governor and U.S. Senate.",
    "3rd District: Democratic incumbent Dwight Evans is seeking a third term and faces a challenge in the primary from three candidates: Michael Cogbill, Alexandra Marguerite Hunt and Melvin Prince Johnakin.",
    "They are second-term Pittsburgh-area Rep. Austin Davis, five-term Rep. Brian Sims of Philadelphia and Raymond Sosa, a financial planner who ran unsuccessfully for lieutenant governor in 2018.",
    "The candidates who filed petitions by the 5 p.m. deadline on Tuesday will be on ballots in the May 17 primary, unless their petitions are challenged and a court throws them out.",
    "John Fetterman; second-term state Rep. Malcolm Kenyatta of Philadelphia; liberal activist Alex Khalil; and third-term U.S. Rep. Conor Lamb of suburban Pittsburgh.",
    "Congress: Pennsylvania's 17 U.S. House Districts\nFifteen incumbents are running for reelection for Pennsylvania’s 17 congressional seats in newly drawn districts.",
    "The state allows one week to file court challenges to a candidate's paperwork, and courts have one more week after that — until March 29 — to render a decision.",
    "The only candidate already expected to win the primary and be on the general election ballot in November is state Attorney General Josh Shapiro.",
    "Many more are seeking election to Pennsylvania's 17 congressional seats, where the winners will represent the Keystone State in Congress.",
    "2nd District: Democratic incumbent Brendan Boyle is running for a third term and faces a challenge in the primary from Gilberto Gonzalez.",
    "Decision 2022\n5th District: Democratic incumbent Mary Gay Scanlon, seeking a third term, faces Louis D. Lanni Jr. in the May primary.",
    "Tom Wolf is not allowed to run for a third term, and Republican U.S. Sen. Pat Toomey is resigning after serving the last 12 years.",
    "Four Republicans are running in the primary: Guy Louis Ciarrocchi, Stephen A. Fanelli, Regina Mauro and Ronald Christopher Vogel.",
    "More than a dozen candidates are running for both of those offices, while another dozen filed petitions for lieutenant governor.",
    "It's the first election year in more than four decades that includes open races for both of those two highly coveted offices.",
    "The Democrat running for governor has been endorsed by every major party leader, and face no challenge in the May primary.",
    "Lieutenant Governor for Pennsylvania\nBoth parties have contests for the open seat with Fetterman seeking higher office.",
    "4th District: Democratic incumbent Madeleine Dean Cunnane, seeking a third term, is running unopposed in the primary.",
    "6th District: Democratic incumbent Christina Jampoler Houlahan is running unopposed in the primary for a third term.",
    "All 253 state General Assembly seats are also on ballots this year, along with half of the state senate seats.",
    "7th District: Democratic incumbent Susan Ellis Wild is running unopposed in the primary for a third term.",
    "Six filed to run in the Pittsburgh-based district, while five filed in the district just to the west.",
    "At least 56 candidates filed and most incumbents will have a primary or general election challenge.",
    "Two Republicans are running in the primary: Daniel L. Burton Jr. and Sergio Christian Nascimento.",
    "Two Pittsburgh-area districts lack an incumbent and will provide an opportunity for newcomers.",
    "Two Republicans are running in the primary: Kevin Willard Dellicker and Lisa Jane Scheller.",
    "In southeastern Pennsylvania, all seven incumbents are running for re-election.",
    "The current lieutenant governor, John Fetterman, is running for U.S. Senate.",
    "U.S. Senate in Pennsylvania\nBoth parties will have contested primaries.",
    "On the Democratic side, three filed, including two state lawmakers.",
    "He has a clear lane to the party's nomination with no opposition.",
    "Haroon Bashir is the lone Republican running in the primary.",
    "They are: emergency room physician Kevin Baumlin; Lt. Gov.",
    "Ashley Ehasz is the lone Democrat running in the primary.",
    "The Associated Press contributed reporting to this story.",
    "David Lewczyk Galluch is the lone Republican running.",
    "Ten candidates filed to run on the Republican side.",
    "Five filed for the Democratic Party's nomination.",
    "On the Republican side, nine candidates filed.",
    "That doesn't happen often, but it is possible.",
    "On the Republican side are seven candidates.",
    "Davis is running on a ticket with Shapiro.",
    "No Republicans are running.",
    "Gov."
  ]
}