{
  "id": 14143,
  "mediaId": 2636,
  "date": "2022-03-18",
  "headline": "Dr. Oz’s Heritage Is Targeted as Rivals Vie for Trump Backing",
  "image": "https://static01.nyt.com/images/2022/03/17/us/politics/00pol-mccormick-oz/00pol-mccormick-oz-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/03/18/us/politics/dr-oz-trump-mccormick-senators-race.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Oz” but as “Mehmet Oz.” Standing in front of an oversize American flag, Mr. McCormick opens the ad by saying, “When Mehmet Oz questions my patriotism, he’s crossed the line.”\nThe McCormick campaign has hired influential Trump alumni to guide its effort, including the former White House aides Stephen Miller and Hope Hicks, and the McCormicks’ private lobbying has included a separate dinner with Donald Trump Jr., according to people told of the meal.",
    "His career arc from West Point graduate to the financial world more neatly fits the traditional Republican establishment mold, and he said last year that the riot on Jan. 6 at the Capitol was “a dark chapter in American history.”\nFor his part, Dr. Oz first found fame as a regular guest on “The Oprah Winfrey Show,” and clips showing him dancing with Michelle Obama have made their way into ads attacking him.",
    "At Goldman Sachs, she oversees the firm’s global business with foreign governments and their investments, and this month, she was appointed by the top Republican in the House to serve on the advisory board of the Middle East Partnership for Peace, which is guiding investments of $250 million to promote Israeli-Palestinian coexistence.",
    "Sean Hannity of Fox News, who endorsed Dr. Oz this week, has been whispering in Mr. Trump’s ear on Dr. Oz’s behalf, according to people familiar with those conversations, and Dr. Oz has made a dozen appearances on Mr. Hannity’s prime-time show since he entered the race, according to Media Matters, the liberal media watchdog group.",
    "Late last year, before he had formally entered the Pennsylvania Senate race, David McCormick flew to Florida for a private meeting with Donald J. Trump, angling to get in the former president’s good graces ahead of a Republican primary that would soon pit him against Dr. Mehmet Oz, the celebrity surgeon and television personality.",
    "Calling the issue a “distraction,” he accused Mr. McCormick of making “bigoted attacks” that were “reminiscent of slurs made in the past about Catholics and Jews.”\nDr. Oz would be the first Muslim senator in the United States, but he has not emphasized that history-making aspect of his candidacy.",
    "Dr. Oz has narrated some of his campaign’s ads counterattacking at Mr. McCormick, saying in one, “He’s part of the swamp that labeled President Trump as Hollywood — just like they say about me.”\nIn one commercial referring to his rival by name, Mr. McCormick did so not with the familiar “Dr.",
    "At one point, Ms. Powell McCormick, an Egyptian-born Coptic Christian who is fluent in Arabic, pulled out a picture that showed Dr. Oz alongside others wearing Muslim head coverings, according to four people briefed in detail on the exchange, which has not previously been reported.",
    "She said that it was “designed to distract from the legitimate national security concerns” about Dr. Oz that “could pose significant security risks,” including his dual citizenship, his Turkish military service, connections to the Turkish government and financial links abroad.",
    "Mr. McCormick, then the chief executive of the world’s largest hedge fund, had an edge in pitching Mr. Trump: His wife, Dina Powell McCormick, had been a senior national security official in the Trump White House, and she accompanied him to the meeting at Mar-a-Lago.",
    "In a sign of the perceived power of the former president’s endorsement, Ms. Powell McCormick has called Mr. Trump so often in recent months that he has complained to people about the frequency of her calls, according to two people who have heard from him about it.",
    "“This is an anonymous, false smear on a candidate’s wife who is an Arab American immigrant woman who fled the Middle East to escape religious persecution,” Ms. Szymanski said of the account of the McCormicks’ meeting with Mr. Trump.",
    "As Mr. McCormick and his wife, now a top Goldman Sachs executive, made their case, the topic soon turned to electability and Dr. Oz’s Turkish American heritage, which has since become a central point of contention in the campaign.",
    "Born in Ohio to Turkish immigrants, Dr. Oz did serve in the Turkish army and has said that he maintained dual citizenship in recent years to make it easier to visit his mother, who has Alzheimer’s disease and lives in Turkey.",
    "The four people who described the exchange between the McCormicks and Mr. Trump did not know the setting or the source of the photograph they said Ms. Powell McCormick showed the former president.",
    "But Dr. Oz’s ties to Turkey have lingered as an issue, as there is no known precedent of a sitting senator holding dual citizenship with a nation that can be at odds with American foreign policy.",
    "The McCormick campaign has publicly made Dr. Oz’s heritage an issue from Mr. McCormick’s first day as a candidate in January, when he called on Dr. Oz to renounce his Turkish citizenship.",
    "A third Senate candidate, Carla Sands, whom Mr. Trump named ambassador to Denmark, is also running in Pennsylvania and had her own private audience with the former president last year.",
    "He previously supported key elements of the Affordable Care Act and, while he calls himself “pro-life,” he struggled in a Fox News interview to articulate when he believes life begins.",
    "Mr. Bartos has not had a formal sit-down with Mr. Trump, though the two spoke at an impromptu meeting at Mar-a-Lago a few months ago, according to a person told of the interaction.",
    "The former president’s initial choice in the race, Sean Parnell, withdrew in November after losing custody of his children following allegations of abuse in a divorce proceeding.",
    "The Pennsylvania Republican primary has already seen millions of dollars in television ads, as both rivals sell themselves as the most conservative and most pro-Trump candidate.",
    "The people briefed on the conversation said Ms. Powell McCormick told Mr. Trump that the fact that Dr. Oz was Muslim would be a political liability in parts of Pennsylvania.",
    "Among the few images readily accessible online in which Dr. Oz can be seen with people wearing Muslim head coverings are scenes from his father’s 2019 funeral in Istanbul.",
    "The former president has told people who have spoken to him about the race that he deeply appreciates the political power of such a celebrity given his own experience.",
    "And with polls showing a competitive Republican contest, the race is already awash in negative ads and on pace to be one of the most expensive primaries in the nation.",
    "Ms. Powell McCormick was a key member of the White House’s Middle East team in the early days of the Trump administration and maintains extensive ties to the region.",
    "Mr. McCormick himself was considered for various posts in the Trump administration, and met with the president-elect in 2016, though he never joined the government.",
    "He was the 2018 Republican nominee for lieutenant governor and entered the Senate race in March 2021 — more than six months ahead of either Mr. McCormick or Dr. Oz.",
    "Rob Gleason, a former chairman of the Pennsylvania Republican Party, said a Trump endorsement in the state’s race “could be the tipping point in a close election.",
    "A video shows Dr. Oz behind two imams wearing turbans and clerical robes; later, he helps carry the coffin, draped in a green pall decorated with Quranic verses.",
    "In an opinion essay in the Washington Examiner in January, he wrote that he had been “raised as a secular Muslim” and that his four children are all Christian.",
    "A Modern-Day Party Boss: Hoarding cash, doling out favors and seeking to crush rivals, Mr. Trump is behaving like the head of a 19th-century political machine.",
    "Facing the possible defeat of candidates he is backing in other states, Mr. Trump has turned at least temporarily more cautious in some key Senate races.",
    "Also running is Kathy Barnette, a political commentator who has written a book about being Black and conservative and has raised more than $1 million.",
    "Just as he is doing in two other crowded Republican primaries, in Ohio and Missouri, Mr. Trump is not picking sides while the field remains muddled.",
    "Mr. McCormick is the former chief executive of the Bridgewater hedge fund and served in the Treasury Department of the second Bush administration.",
    "An anti-Oz super PAC has slammed the surgeon as a “RINO,” or Republican in name only, with vivid images of him kissing his Hollywood star.",
    "Just the Beginning: For many Trump supporters who marched on Jan. 6, the day was not a disgraced insurrection but the start of a movement.",
    "Dr. Oz spoke with Mr. Trump by phone before entering the Senate race in late November, and in person at Mar-a-Lago just before Christmas.",
    "A Fox News survey in early March showed Mr. McCormick leading, with 24 percent, and Dr. Oz at 15 percent, but many voters were undecided.",
    "The early meeting with Mr. Trump was just one sign of the intensity of the race to succeed the retiring Senator Pat Toomey, a Republican.",
    "The McCormick campaign denied that account and insisted that the McCormicks have focused only on Dr. Oz’s ties to Turkey as a liability.",
    "His campaign has since accused Dr. Oz of harboring “dual loyalties.” Dr. Oz’s Muslim faith has not been part of the public debate.",
    "A spokesman for Mr. Trump confirmed the private meeting with the McCormicks took place but declined to comment on anything said.",
    "Power Struggle: Led by Senator Mitch McConnell, a band of anti-Trump Republicans is maneuvering to thwart the ex-president.",
    "Mr. Trump, according to advisers, has tracked the race closely but appears content — for now — to sit on the sidelines.",
    "The Senate candidate’s Turkish background has emerged as a focus of David McCormick’s attacks in Pennsylvania’s G.O.P.",
    "“The assertion that any points beyond those have ever been raised is categorically false,” Ms. Szymanski said.",
    "For now, Mr. Trump remains uncommitted even as both camps have aggressively sought his stamp of approval.",
    "He jealously guards his endorsement record and was already burned by his early backing of Mr. Parnell.",
    "Post-Presidency Profits: Mr. Trump is melding business with politics, capitalizing for personal gain.",
    "And in 2016, Dr. Oz interviewed Mr. Trump on his show at the height of the presidential campaign.",
    "(After Senator Ted Cruz of Texas learned he had Canadian citizenship, he renounced it in 2014.)",
    "Mr. McCormick’s spokeswoman, Jess Szymanski, echoed the concerns he has been raising publicly.",
    "The Pennsylvania seat is a linchpin in both parties’ pursuit of the Senate majority in 2022.",
    "A fourth candidate, Jeff Bartos, has contributed more than $1 million to his own campaign.",
    "John Fetterman, Representative Conor Lamb and Malcolm Kenyatta, a state representative.",
    "In both those states, he has also met with multiple candidates vying for his backing.",
    "On Wednesday, he and his wife, Lisa Oz, had dinner with Mr. Trump and Melania Trump.",
    "On Wednesday, Dr. Oz said that he would renounce his Turkish citizenship if elected.",
    "Like Mr. Trump himself, Dr. Oz built a national following as a television star.",
    "The pro-Trump label can be an awkward fit for both Mr. McCormick and Dr. Oz.",
    ": Mr. Trump remains the most powerful figure in the Republican Party.",
    "Mr. Trump’s blessing is widely seen as potentially decisive.",
    "But a Trump endorsement of Dr. Oz would have its own logic.",
    "“He’s just very important in Republican circles,” he said.",
    "However, there are signs his control is loosening.",
    "Limited public polling shows a wide-open contest.",
    "How Donald J. Trump Still Looms\nGrip on G.O.P.",
    "The Democratic field includes Lt. Gov.",
    "“He still is.”",
    "primary."
  ]
}