{
  "id": 15225,
  "mediaId": 8254,
  "date": "2022-03-06",
  "headline": "Pa. Senate Race: Fetterman leads Democrats, Republicans knotted in latest poll",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/AP22029787145496.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/pa-senate-race-fetterman-leads-democrats-republicans-knotted-in-latest-poll/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    5862,
    4080,
    4243,
    2709,
    3989,
    1023,
    1126,
    392,
    6506
  ],
  "sentences": [
    "Forty-four percent of Democrats remain undecided in the race and did not have a single issue that was “driving their preference in the primary.”\nThe poll also found that the Republican primary field has no clear front-runner with David McCormick (13%), Carla Sands (11%), and Mehmet Oz (10%) “each garnering similar shares of Republican support.”\nKathy Barnette received six percent, followed by Jeff Bartos at four percent.",
    "(WHTM) – A new poll conducted by Franklin & Marshall College shows Lieutenant Governor John Fetterman ahead in the Democratic race for Pennsylvania’s U.S. Senate seat, while Republicans are widely undecided with a large number of candidates still in the race.",
    "Franklin & Marshall College’s poll found that more of the state’s registered voters say they will support a Republican candidate for Congress, 42% Republican versus 38% Democrat.",
    "The economy and concerns regarding the government drove voters’ top issues while the COVID-19 pandemic continued to fade as a major concern to Pennsylvania voters.",
    "Only 30 percent of Pennsylvanians surveyed approved of President Biden’s job performance with immigration and inflation leading the concerns of his detractors.",
    "The data included in this release represent the responses\nof 490 registered Pennsylvania voters, including 223 Democrats, 200 Republicans, and 67\nindependents.",
    "More than two dozen Republican candidates registered with the Federal Election Commission remain in the race compared to just five Democrats.",
    "Two percent of respondents said they supported State Representative Malcolm Kenyatta, while seven percent supported another candidate.",
    "The poll found Fetterman with support from 28 percent of Pennsylvania Democrats, followed by Congressman Connor Lamb at 15 percent.",
    "The survey findings presented in this release are based on the results of interviews\nconducted February 21 – 27, 2022.",
    "The sample error for this survey is +/- 6.1 percentage points when the design effects from\nweighting are considered.",
    "Fifty-eight percent of Democrats and seven percent of Republicans approve of the President’s job performance.",
    "Fifty-three percent of Republicans remain undecided in the race and three percent support another candidate.",
    "The poll and a summary of its findings can be found on the Franklin & Marshall College website.",
    "The interviews were conducted at the Center for Opinion\nResearch at Franklin & Marshall.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "Sign up for the abc27 newsletters here."
  ]
}