{
  "id": 15532,
  "mediaId": 8481,
  "date": "2022-03-04",
  "headline": "Democratic candidates visit Clearfield County",
  "image": "https://www.wearecentralpa.com/wp-content/uploads/sites/69/2022/03/WEBIMG-4.png?w=1280",
  "link": "https://www.wearecentralpa.com/your-local-election-hq/democratic-candidates-visit-clearfield-county/",
  "mediaOutlet": "wearecentralpa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yanni Tragellis",
  "authorUrl": "https://www.wearecentralpa.com/author/yanni-tragellis/",
  "termIds": [
    3270,
    3989,
    2609,
    1126,
    1477,
    6506,
    6066
  ],
  "sentences": [
    "“There’s a lot of issues that are critical for rural Pennsylvanians, and the Democratic party can’t ever turn their back on places like Clearfield, and it certainly would never happen if I’m lucky enough to be your next United States senator,” Fetterman said.",
    "Also in attendance was representative of the 35th district of the House of Representatives Austin Davis, and representative of the 182nd district of the House of Representatives Brian Sims, who are both campaigning for the Democratic nomination for Lt.",
    "One thing all three candidates made clear during their visit was rural Pennsylvania is a priority for the Democratic party, as they aim to win back a region that has been dominated by Republicans in recent elections.",
    "“I want to be an advocate for working-class families across Pennsylvania to make sure we’re creating family-sustaining jobs to ensure that every child has access to quality education,” Davis said.",
    "CLEARFIELD COUNTY, Pa. (WTAJ) – Democratic candidates were in Clearfield County Friday afternoon for a petition signing event at the Clearfield County Democratic Committee headquarters.",
    "Among those in attendance were current Lieutenant Governor and United States Senate candidate John Fetterman, as well as House Representatives Austin Davis, and Brian Sims.",
    "How we make sure we’re creating more manufacturing jobs, to make sure that folks are making livable wages here in Clearfield County,” said Representative Austin Davis.",
    "We’re not just bringing our values here, we’re here and we’re listening to the values of democratic voters in Clearfield County,” said Representative Brian Sims.",
    "“The residents here understand that there are specific issues that are important to Clearfield County that we believe our campaign speaks to,” said Lt. Gov.",
    "For Fetterman, the keys to his campaign in rural Pennsylvania include infrastructure, basic access to broadband, and rural healthcare.",
    "“I believe that I’ve got the most experience fighting back against radical Republicans, and that’s what we need right now,” Sims said.",
    "For Sims, he says the leadership he’s displayed over a decade in the House of Representatives makes him the best choice for Lt.",
    "A common theme among all three candidates’ campaigns includes building infrastructure, and creating, and sustaining jobs.",
    "As for Davis, he says growing up in a working-class family makes him the right choice.",
    "Both candidates say central Pennsylvania is a top priority.",
    "“How we tap areas like this into new emerging economies.",
    "“The answer is that we’re here, we’re showing up.",
    "John Fetterman, (D) U.S. Senate candidate.",
    "Governor.",
    "Governor."
  ]
}