{
  "id": 15852,
  "mediaId": 8399,
  "date": "2022-03-08",
  "headline": "John Fetterman in Failure to Launch",
  "image": "https://media2.fdncms.com/pittsburgh/imager/u/slideshow/21249870/fetterman-launch-teaser.jpg",
  "link": "https://www.pghcitypaper.com/pittsburgh/john-fetterman-in-failure-to-launch/Content?oid=21249868",
  "mediaOutlet": "pghcitypaper.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Kinney-Kobre",
  "authorUrl": "https://www.pghcitypaper.com/author/hannah-kobre",
  "termIds": [
    0
  ],
  "sentences": [
    "Fetterman, who's running for U.S. Senate, apes the aesthetic of documentary realism, starting with a montage of bleak images of Braddock set to music that was probably found by searching the term “moving.” Shot at night for the most part, we see, at first, ugly fluorescent lights coming on in the very early morning.",
    "The music gets more propulsive, and shots of Fetterman (clearly unstyled in a puffer jacket and basketball shorts) walking through Braddock are interspersed with images of “normal” people who live and work in Braddock, and who we see pretending to go about their business with no awareness of the camera.",
    "Everything clicks into place where you’d expect it: the swelling music, the appropriately diverse line-up of “regular people” whose faces are zoomed in on at the end, the audio of news clips indicating Fetterman’s great works, etc.",
    "None of this is particularly interesting, but it’s well shot in the way where there is a kind of boring beauty to it; I suppose this is the best you can hope for in terms of cinematography for a political ad.",
    "Colbert lists off facts that are all meant to make Braddock sound like a real shithole, but is also clearly meant as a set-up for Fetterman to launch into his heroic defense of the town — which he does.",
    "But if you’re calling your campaign ad (or, as we like to call it, a politician-produced short film) “Launch,” it’s hard not to take the bait by calling it Failure to Launch until proven successful.",
    "As light begins to come through the sky, we see trucks rolling by and garages opening up, all indicators of hard working Americans up at the crack of dawn to make a decent living.",
    "The strained realism of the ad is working overtime to achieve a sense of humanist populism and make Fetterman a figure of immense dignity and relatability.",
    "During the rest of the ad, we hear a mixture of clips from Fetterman interviews combined with clips of him being discussed on the news.",
    "All the while, we hear Fetterman’s voice speaking to Stephen Colbert from his 2009 appearance on The Colbert Report.",
    "But at the same time, it’s haunted by what it’s not and desperately wants to be: a Bernie Sanders ad.",
    "(I couldn’t help but imagine the director off screen, telling them to be “more American!",
    "In that sense, it’s one of the most successful political ads I’ve seen in a while.",
    "But in the ideal world, you wouldn’t have to work at those things at all.",
    "more admirably stoic in the face of economic difficulties!\")",
    "Listen, I don’t think the ad is actually that bad.",
    "It’s a slick and well-produced ad.",
    "more hard-working!",
    "There’s the rub."
  ]
}