{
  "id": 1860,
  "mediaId": 2658,
  "date": "2022-02-09",
  "headline": "Carville promotes new super PAC for Conor Lamb",
  "image": "https://static.politico.com/6a/3a/d0733b8a47d5912b60558a153e7a/https-delivery.gettyimages.com/downloads/1234514335",
  "link": "https://www.politico.com/news/2022/02/09/carville-promotes-new-super-pac-for-conor-lamb-00007218",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Conor has a tough primary, and I was hoping you could help him by supporting Penn Progress, the independent effort set up to help ensure Conor is our nominee.”\nHe added that on the calls on Monday and Tuesday, “Conor will be talking about the state of the race and then Erik Smith, who runs Penn Progress, will get on to answer questions about that effort.”\nThe fact that a super PAC is backing Lamb is a major development in one of the nation’s most closely watched Senate races.",
    "Reached by phone, Carville said that he is promoting Lamb because “I know him, I knew his granddad … and I helped him in his congressional race, and I think, if he won the primary, he would almost be a cinch to win the general.”\nThough Penn Progress is hoping to collect millions, it reported only bringing in $35,000 in 2021.",
    "A separate document by Penn Progress circulated to potential donors listed “sample campaign costs,” including $8 million for statewide paid media, $200,000 for polling, $30,000 for research and an additional $30,000 for a website and social media.",
    "It is perfectly legal for candidates to talk to donors of super PACs backing them and appear at their fundraisers, as long as they do not personally solicit contributions in excess of finance limits for their campaigns.",
    "| Jeff Swensen/Getty Images\nBy Holly Otterbein\n 02/09/2022 10:16 AM EST\nA new super PAC supporting Democrat Conor Lamb’s Senate campaign aims to raise more than $8 million, according to documents obtained by POLITICO.",
    "“There is no way that Democrats can expand our majority in the Senate if we do not pick up the Pennsylvania Senate seat and the best person to win that race is my good friend Conor Lamb,” Carville wrote in the email.",
    "Carville’s email states that “Conor Lamb is appearing at these events only as a featured speaker; he is not asking for funds or donation.”\nThe Lamb campaign did not immediately respond to a request for comment.",
    "Fetterman reported raising nearly $12 million last year and had $5 million on hand at the end of 2021, while Lamb brought in about $4 million and had $3 million on hand during that time.",
    "In the message, he wrote that he is holding calls with the western Pennsylvania congressman next week, after which a leader at the super PAC will join the conversation.",
    "James Carville, the veteran Democratic strategist, is promoting the group called “Penn Progress” in an email to potential donors.",
    "The fact that a super PAC is backing Conor Lamb is a major development in one of the nation’s most closely watched Senate races.",
    "Former President Barack Obama appeared at a fundraising event for a super PAC supporting him in 2012.",
    "John Fetterman, the progressive frontrunner in the Democratic contest for the open Senate seat.",
    "During her 2016 presidential campaign, Hillary Clinton also met with super PAC donors.",
    "An independent expenditure could help Lamb cut into Fetterman’s financial advantage.",
    "Still, many Democratic activists are troubled by the practice.",
    "Lamb, a moderate, has so far been outraised by Lt. Gov."
  ]
}