{
  "id": 2184,
  "mediaId": 8254,
  "date": "2022-02-04",
  "headline": "Val Arkoosh drops out of US Senate race for Pennsylvania",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/AP22029788489811.jpg?w=1280",
  "link": "https://www.abc27.com/election/val-arkoosh-drops-out-of-us-senate-race-for-pennsylvania/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    0
  ],
  "sentences": [
    "And it’s become clear to me that the best way I can ensure that happens is to suspend my campaign today and commit to doing whatever I can to help ensure we flip this Senate seat in November.”\nThe 61-year-old former chair of anesthesiology at Drexel University College of Medicine previously ran unsuccessfully for Congress in 2014.",
    "Arkoosh, a Democrat who joined the race for the open Senate seat in April 2021, announced her decision in a campaign letter on Friday\n“For each of those Pennsylvanians, we cannot let anything stand in the way of a Democrat being elected to the U.S. Senate.",
    "HARRISBURG, Pa. (WHTM) – Val Arkoosh, Chair of the Montgomery County Board of Commissioners, has dropped out of the race to represent Pennsylvania in the United States Senate.",
    "Arkoosh also publicly campaigned for the passage of then-President Barack Obama’s health care law, the Affordable Care Act.",
    "The Republican field includes more than a dozen candidates who have filed paperwork with the Federal Election Commission.",
    "Governor John Fetterman, State Representative Malcolm Kenyatta, Dr. Kevin Baumlin, and business owner Alexandra Khalil.",
    "Visit Pennsylvania Politics or Your Local Election HQ on abc27.com for more information on upcoming elections.",
    "The Democratic primary race in Pennsylvania now includes Congressman Conor Lamb, Lt.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "Sign up for the abc27 newsletters here.",
    "The stakes are just too high."
  ]
}