{
  "id": 2407,
  "mediaId": 8503,
  "date": "2022-02-07",
  "headline": "Pa. police chiefs: Don't legalize marijuana, consider the health and safety risks first",
  "image": "https://www.gannett-cdn.com/presto/2021/05/27/NETN/cdd9c0e2-3348-4619-bad1-5d61a1a74a34-Bohn_2.jpg?crop=700,394,x0,y153&width=700&height=394&format=pjpg&auto=webp",
  "link": "https://www.goerie.com/story/opinion/2022/02/08/pa-chiefs-police-legalized-marijuana-poses-health-and-safety-risks/6692920001/",
  "mediaOutlet": "ydr.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Bohn",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Given the statistics that are available today, it is clear and indisputable that the use of recreational marijuana negatively impacts the motoring, pedestrian and special needs community, and that innocent people in states where recreational use of marijuana has been legalized are at a greater risk of harm, injury and death due to the increased number of drug- impaired drivers.",
    "Your Turn\nAs executive director of the Pennsylvania Chiefs of Police Association and as a former member of the Pennsylvania Department of Health Medical Marijuana Advisory Board, I would like to express my concerns and those of many of our membership about the legalization of marijuana and the relative effects on public safety in or communities.",
    "In a recent news publication, “Regan admits convincing statewide organizations representing law enforcement to alter their position on marijuana legalization will be a tough sell, but the former law enforcement officer himself is hoping to barter with them when they come to asking for his support on other issues.",
    "Our efforts to curb drunk driving have met with a great deal of success over the last decade, but drug-impaired driving is not the same as alcohol-impaired driving and our understanding of the impairments due to drug impairment is limited.",
    "However, studies in Colorado show:\n• High-potency THC from marijuana hash oil extractions, which are used in making legalized laced edibles and beverages, has led to overdoses, potential psychotic breaks, and suicide attempts.",
    "Law enforcement executives in the commonwealth need answers that are supported by valid data and scientific research rather than being promised consideration on other issues that impact the public’s safety.",
    "In populous areas of our commonwealth, this is particularly concerning where the risk of catastrophic consequences related to a drug-impaired driving incident is exponentially more probable.",
    "I believe that marijuana legalization in Pennsylvania will pose significant challenges for law enforcement as a result of the unanticipated consequences it has on crime and public safety.",
    "Pennsylvania Sen. Mike Regan, the chair of the Senate Law and Justice Committee, held a hearing on Monday, Feb. 7th to explore and advocate for the legalization of marijuana in our state.",
    "• Difficulties in establishing what is a legal marijuana operation have created problems in conducting investigations, determining probable cause and search and seizure procedures.",
    "• Youth use and addiction rates have increased due to ease of accessibility, and there is great concern about the significant health impacts of chronic marijuana use by youths.",
    "Current information validates our concerns and strengthens our collective resolve that the Commonwealth of Pennsylvania should not legalize the use of recreational marijuana.",
    "This is simply a state revenue issue, and the 2018 projections of what taxing marijuana would generate for Pennsylvania by taxing the legalized sale of marijuana.",
    "The percentages of traffic deaths related to the use of recreational marijuana doubled in Washington state in the year retail marijuana sales were allowed.",
    "It is not possible to currently identify a valid impairment standard for marijuana or any other drug equivalent to the .08 percent BAC limit for alcohol.",
    "In our last and only contact with Sen Regan in September 2020, we expressed the same view and provided considerable data and evidence-based information.",
    "These statistics highlight why it is necessary to wait until we have a better understanding of the impacts and management of marijuana intoxication.",
    "• Banking systems are unavailable to the marijuana industry because of federal laws, creating a dangerous level of cash that can lead to crime.",
    "Alcohol is unique among impairing drugs in that there is a documented correlation between blood alcohol levels and levels of impairment.",
    "We have strongly suggested that there is insufficient data to determine the true impact of legalized marijuana on crime and safety.",
    "Marijuana would then be available to the general adult population for purchase and use at will, similar to tobacco and alcohol.",
    "• Many states have had difficulties caused by conflicting state legislation and local ordinances, policies, and procedures.",
    "We have all witnessed our share of crashes and traffic congestion as well as vehicular, pedestrian and cyclist fatalities.",
    "Exacerbating the problem is the matter of how to best create, implement and enforce the laws prohibiting impaired driving.",
    "The situation is even more complex because marijuana remains a Schedule I controlled substance under federal law.",
    "Law enforcement officials are uniquely qualified to discuss the issues and concerns related to impaired driving.",
    "Scott L. Bohn is a retired police chief and executive director of the Pennsylvania Chiefs of Police Association.",
    "'”\nProfessional law enforcement executives do not barter the public’s health, safety, and or welfare concerns.",
    "Professional law enforcement leaders are committed to public service and ensuring our communities are safe.",
    "No professional law enforcement association was invited nor were written briefs to the committee permitted.",
    "Diversion across state boundaries has created issues for states that do not have legalized marijuana laws.",
    "The public’s safety and welfare are the first priority for our elected officials and law enforcement.",
    "• Detecting driving under the influence of marijuana is a significant challenge for law enforcement.",
    "The Pennsylvania Auditor General’s estimate at that time was $580 million annually if taxed at 35%.",
    "This does not exist for other drugs, and it has been shown to be nonexistent for THC in marijuana.",
    "Decriminalization is the act of removing criminal sanctions against an act, article, or behavior.",
    "Commercialized sale of what science proves to be a harmful and addictive drug should be opposed.",
    "One of the most salient concerns we have relates to the consequences of drug-impaired driving.",
    "John Fetterman, we supported decriminalization for possession of small amounts of marijuana.",
    "In Colorado, marijuana is now involved in more than one of every five deaths on the road.",
    "Legalization of marijuana is the process of removing all legal prohibitions against it.",
    "There is an important distinction to be made here for the commonwealth’s residents.",
    "• Marijuana illegal trading through the black and other markets has not decreased.",
    "Ask yourself, who are the real benefactors and at what cost to the public safety?",
    "They take an oath or affirmation to obey and enforce the law.",
    "There is no roadside test for marijuana intoxication.",
    "'I think we can make progress there,' Regan said.",
    "We value the public we jointly serve.",
    "'I’d like to get them to neutral.",
    "In our meeting with Lt. Gov."
  ]
}