{
  "id": 2430,
  "mediaId": 6526,
  "date": "2022-02-09",
  "headline": "What was missing from Gov. Wolf’s final state budget address",
  "image": "https://www.mcall.com/resizer/6YsmWK4ucW5CnzeTNRlvu7-9jsw=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/3UKZSD255NIBY5E2QYPGTAGO64.jpg",
  "link": "https://www.mcall.com/opinion/mc-opi-gov-wolf-pennsylvania-budget-muschick-20220209-yle3j4cicjer7ex2vcfedrcgnq-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Muschick",
  "authorUrl": "https://www.mcall.com/mc-bio-paul-muschick-staff.html#nt=byline",
  "termIds": [
    0
  ],
  "sentences": [
    "“The governor has been steadfast on his position on this issue and he still believes the commonwealth could realize billions in new revenue like all the other gas producing states,” spokeswoman Beth Rementer told me.",
    "“Pennsylvania’s citizens deserve their fair share of revenues from the natural gas industry.”\n“In our political system, the future belongs to the coalition-builders and the consensus-seekers.",
    "He rightfully also gave credit to those around him in state government, including the Republican-controlled Legislature, for putting politics aside and working together to right the ship.",
    "Savings would come from changing special education funding so it’s based on actual costs instead of projections, and by setting a statewide tuition rate for cyber charters.",
    "Those who understand our true impact can only be measured by the work we actually get done for the people whose lives we actually improve,” Wolf said.",
    "“Unfortunately, the Republican Legislature refuses to engage in this, even when many in the Legislature and general public support this,” she said.",
    "To encourage more investment in education, Wolf outlined the challenges facing overwhelmed Allentown schools Superintendent Thomas Parker.",
    "Given a training opportunity, the mother of two rose from machine operator to supervisor and moved her family into an apartment.",
    "The recovery was aided, of course, by a big handout of federal COVID-19 aid that makes the state’s finances look even rosier.",
    "To call for more investment in workforce and career development, Wolf shared the story of Bucks County’s Neishmairy Ruiz.",
    "A significant number of our political leaders are turning against the very idea of democracy itself.",
    "“What’s happening now, what we’re seeing now in this country, that’s something different.",
    "This was the easiest budget address Wolf had to deliver in his eight years in office.",
    "He was drowning in charter school debt and stuck with schools built generations ago.",
    "It denies the whole idea that we can eventually find common ground without force.",
    "It denies that democracy can ultimately bring us to a better place.”",
    "Budget documents say the state could save $373 million annually.",
    "It denies the whole idea of civil disagreement.",
    "And that kind of nihilism is poisonous.",
    "The state has a vault of cash.",
    "That’s understandable."
  ]
}