{
  "id": 2541,
  "mediaId": 2510,
  "date": "2022-02-09",
  "headline": "Newlyweds Rep. Malcolm Kenyatta and Husband Tell Their Own Love Story",
  "image": "https://www.advocate.com/sites/default/files/kenyattas.jpg",
  "link": "https://www.advocate.com/politics/2022/2/09/newlyweds-rep-malcolm-kenyatta-and-husband-tell-their-own-love-story",
  "mediaOutlet": "Advocate",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "About being the first Black Ph.D. from USC’s urban planning program, he says, “It’s not enough for me to be the only one.”\nThe future of cities, the future of the nation, their future as a couple — that’s a whole lot of futures to plan, but they’re looking forward to it all.",
    "He was elected to the Pennsylvania House of Representatives in 2018 from a Philadelphia district, becoming the first out gay Black person in the state legislature and the second out member overall — Brian Sims, from another Philadelphia district, was the first.",
    "He teaches city planning at the University of Pennsylvania, and he’s director of the Justice and Belonging Initiatives at Penn’s Stuart Weitzman School of Design, aimed at creating an environment in which all students, faculty, and staff are valued.",
    "The Northern California native decided it would work out for him to live there, and he moved to the city after finishing graduate school — he’s the first Black person to receive a doctorate in urban planning from USC.",
    "It’s a love story inextricably bound up with politics, as Malcolm is currently a history-making Pennsylvania state representative and is now seeking the Democratic nomination for U.S. senator from his state.",
    "Matthew was in a doctoral program in urban planning at the University of Southern California in Los Angeles, while Malcolm was a political activist and consultant in his native city of Philadelphia.",
    "Also, the ongoing global pandemic means both have been working from home a good deal, and that togetherness has helped them understand the intricacies of each other’s career.",
    "They know that 2022 will hold unknown challenges, but right now they’re jubilant, as indicated by Malcolm’s tweet after their wedding: “Forever sounds pretty good.”",
    "They appeared together at the virtual Democratic National Convention — Malcolm was one of three out politicians featured as part of the keynote address.",
    "He was reelected in 2020 and now has set his sights on the U.S. Senate seat being vacated by Republican Pat Toomey, who’s not seeking reelection.",
    "He sent Malcolm a direct message, and that led to several months of FaceTiming, phone calls, and other communications before they met in person.",
    "That’s the tale of Malcolm Kenyatta and Matthew Jordan-Miller, the latter now Matthew Jordan-Miller Kenyatta after the two married Saturday.",
    "His experiences gave him “a determination to make life better for people who know what happens when government doesn’t work,” he says.",
    "“There was a lot just about our conversations [that showed] how caring he was, that he was a kind person,” Malcolm says of Matthew.",
    "Their love survived a heartbreaking presidential election — and now it’s thriving during a groundbreaking U.S. Senate campaign.",
    "The men share a commitment not only to each other but to racial and social justice, and both were shaped by their early lives.",
    "Malcolm grew up as the son of a single mother who sometimes struggled to afford the insulin she needed to manage her diabetes.",
    "But their relationship warmed up again, and they finally met in person in February 2017, with Matthew visiting Philadelphia.",
    "Matthew was led into urban planning partly by his love of science fiction, which led him to imagine cities of the future.",
    "It helps, they note, that they honed their communication skills during the long-distance phase of their relationship.",
    "Communication is a key factor in keepting their relationship strong amid the challenges of their careers, they say.",
    "Malcolm was closer to the process than most — he’d been a delegate to the Democratic National Convention.",
    "Malcolm proposed to Matthew in July of that year, and social media posts about the proposal went viral.",
    "After Hillary Clinton’s loss, he wanted to visit Matthew in California, but Matthew turned him down.",
    "Malcolm would stay up late for their communications because of the three-hour time difference.",
    "In the spring of 2016, Matthew saw Malcolm on an Instagram list of LGBTQ+ leaders to watch.",
    "They’d have to plan to see each other, and now they try to set aside regular date time.",
    "Then came the 2016 presidential election, something that was traumatic for many.",
    "Matthew, though, had some doubts about having a long-distance relationship.",
    "John Fetterman and U.S. Rep. Conor Lamb, in the May 17 Democratic primary.",
    "“He broke my heart, and we didn’t talk for about a month,” Malcolm says.",
    "He will face several other candidates, including Pennsylvania Lt. Gov.",
    "It has freed Matthew to attend campaign events with Malcolm as well.",
    "“That is a big one, probably a foundational one,” Matthew says.",
    "They spoke with The Advocate a few days before their wedding.",
    "Despite the pandemic, 2020 was a busy year for the couple.",
    "That’s because they were separated by nearly 3,000 miles.",
    "Like many modern relationships, theirs began online.",
    "Malcolm, meanwhile, was breaking ground of his own.",
    "Now he wants to help make the field more inclusive.",
    "The Republican primary field is likewise crowded.",
    "Matthew counterproposed in March of last year.",
    "But their mutual attraction was undeniable.",
    "“He was a cute one,” Matthew recalls.",
    "Matthew has his own demanding career."
  ]
}