{
  "id": 2701,
  "mediaId": 2658,
  "date": "2022-01-29",
  "headline": "POLITICO Playbook: Pundits to Biden: Here’s how to fix your presidency",
  "image": "https://static.politico.com/3f/eb/653c528e492da38a45edf3397425/gettyimages-1238046103.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/01/29/pundits-to-biden-heres-how-to-fix-your-presidency-00003440",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    5916,
    5879,
    3662,
    4267,
    4152,
    1063,
    1394
  ],
  "sentences": [
    "But I still believe that 2018 and 2020 showed that if you engage in the fundamentals of politics, you can win elections in the United States.”\nCarville also wants the left to back off of its criticism of Sen. JOE MANCHIN (D-W.Va.), “a Roman Catholic Democrat in a state in which not a single county has voted Democrat [for president] since 2008.” But he’s all in on a primary challenge to Sen. KYRSTEN SINEMA (D-Ariz.): “I will personally volunteer to help [Rep. RUBEN GALLEGO] fundraise, because I think we can keep that seat if he runs.”\nMARSHALL: COUNTRY OVER PARTY — Marshall, in The Hill, surveys the damage done to Biden, who he notes is “only marginally less unpopular than former President DONALD TRUMP.” His big takeaway is similar to Carville’s in that he believes Biden needs to recover his bipartisan brand to reverse “the defection of moderate and independent voters.” He has four pieces of advice to help Biden escape his current predicament of being seen as leader of the Democratic Party rather leader of the country:\n1.",
    "Schools: “[T]he White House should acknowledge deep parental frustration with public schools and pick up the discarded mantle of K-12 reform.”\nOne obstacle that Marshall points to is that Biden seems to be “taking refuge in denial” about his “fall from political grace.” When Biden was asked last week about winning back voters who polls show have abandoned him, he replied, “I don’t believe in the polls.”\nCUTTER: SPEED DOESN’T KILL — STEPHANIE CUTTER, a longtime Democratic media adviser, takes to the NYT to remind Biden how Senate Minority Leader MITCH MCCONNELL, in her view, changed the politics of the Senate process for Supreme Court nominees — and why Biden should adopt the McConnell model:\n“In 2009, when President BARACK OBAMA nominated Judge SONIA SOTOMAYOR to the court, our team shepherded the nominee through the halls of the Senate for courtesy calls with 89 senators, most of whom waited to announce their intended vote until the Judiciary Committee did its work in vetting and questioning her.",
    "What Doocy did: After Biden called him a “stupid son of a bitch,” Doocy defied “the entreaties of network colleagues like SEAN HANNITY to indulge in a Biden-bashing victory lap.” What Biden did: For his part, Biden “did something that his predecessor … never seemed to contemplate after one of his tirades against the press: He called up Mr. Doocy and cleared the air.” Says Doocy: “It’s important — whatever people think of me and Biden — to see that we can have a quick phone call and resolve things, that he and I could just chat.”\n— “Talks to restore the Iran nuclear deal are entering their ‘final stage,’” report Stephanie Liechtenstein and Nahal Toosi.",
    "CLICKER — “The nation’s cartoonists on the week in politics,” edited by Matt Wuerker — 16 keepers\nGREAT WEEKEND READS, curated by Ryan Lizza:\n— “The Battle for the World’s Most Powerful Cyberweapon,” by NYT Magazine’s Ronen Bergman and Mark Mazzetti: “A Times investigation reveals how Israel reaped diplomatic gains around the world from NSO’s Pegasus spyware — a tool America itself purchased but is now trying to ban.”\n— “Searching for Susy Thunder,” by The Verge’s Claire L. Evans: “In the ’80s, Susan Headley ran with the best of them—phone phreakers, social engineers, and the most notorious computer hackers of the era.",
    "(34), celebrating by having funfetti cake with his family while preparing for the blizzard … Robyn Bash of the American Hospital Association … Bethany Hudson … Bloomberg’s Lauren Dezenski and Eric Roston … Jocelyn Frye … Kristy Schantz … Steve Hagenbuch … Google’s Stephanie Gunter … CMS’ Gavin Proffitt … Seth Appleton … Amazon’s Mary Kate McCarthy … Thomas DiFonzo of Endeavor Strategies … Kristine Grow of America’s Health Insurance Plans … Jesús Rodríguez … Laura Rosenberger … former Speaker Paul Ryan … former Rep. Lee Terry (R-Neb.)",
    "“While final decisions haven’t been made, the officials said, the potential targets include several of Russia’s largest government-owned banks, such as VTB Bank, the banning of all trade in new issues of Russian sovereign debt and the application of export controls across key sectors such as advanced microelectronics.”\n— Reps. GREGORY MEEKS (D-N.Y.) and MARK GREEN (R-Tenn.) talked to NPR’s Mary Louise Kelly in Kyiv about the “very specific list” of needs they got from Ukraine that they’re taking back to Washington.",
    "“It takes a catastrophe, like 9/11, or an attempted coup like Jan. 6, or a heartbreaking funeral with a sea of blue, like Friday’s ceremony at St. Patrick’s Cathedral for the murdered 22-year-old New York City police officer JASON RIVERA, to remind us that we should be proud of good cops even as we root out bad ones.”\nPUNDITS HEED BIDEN’S CALL — President JOE BIDEN recently said that one big change he’s making in his second year is that he will listen to more outside advice.",
    "Rather than deny them, we can lift ourselves up by seeing them in a new light.”\n— “The Nonconformist,” by Laura Marsh in The New York Review of Books: “The mood of John le Carré’s posthumously published novel, Silverview, is brisk and knowing compared with the melancholic, regretful tone of the earlier books.”\nPLAYBOOKERS\nJohn Fetterman, fashion icon, donned a hoodie and gym shorts while meeting with Joe Biden at the site of the collapsed bridge in Pittsburgh.",
    "CARVILLE: DON’T LET LEFT ACTIVISTS DEFINE YOU — Carville has a typically colorful interview with Vox’s Sean Illing, a fellow LSU alum, and pounds away at one idea for Democrats: “Just win some goddamn elections.”\nThe way to restore Biden’s popularity in time to escape a midterm wipeout, in Carville’s view, begins with remembering the big Biden lesson of the 2020 primaries that Twitter isn’t real life:\n“[O]nly 11 percent of the Democratic Party is progressive.",
    "Even before Mr. Trump announced his nominee to succeed Justice RUTH BADER GINSBURG, the chairman of the Senate Judiciary Committee, LINDSEY GRAHAM, declared that he had enough votes to confirm any nominee in both the Judiciary Committee and on the Senate floor.”\nMCKINNON: DON’T RUN — Finally, in Vanity Fair, MARK MCKINNON studies the latest POLITICO-Morning Consult poll about 2024 matchups, and concludes Biden’s reelection prospects aren’t so bleak.",
    "“Western diplomats are facing a self-imposed mid-February deadline to try and revive the 2015 agreement,” meaning that the next few weeks “are critical in determining whether the deal is restored — or talks fall apart altogether.”\n— On Friday, the House Jan. 6 committee subpoenaed 14 “central players in the GOP effort to submit illegitimate presidential electors in 2020,” report Nicholas Wu, Betsy Woodruff Swan and Kyle Cheney.",
    "Jared Polis’ office … former Holyoke, Mass., Mayor Alex Morse … Emily Tara Weberman … Sam Conchuratt … Kim Ghattas … Slate’s Jonathan Fischer … Edelman’s Aaron Guiterman … Michael Duga … Denielle Sachs\nTHE SHOWS (Full Sunday show listings here):\nCBS “Face the Nation”: Sen. Lindsey Graham (R-S.C.) … House Majority Whip Jim Clyburn (D-S.C.) … Victoria Nuland … Ukrainian Ambassador Oksana Markarova … Scott Gottlieb.",
    "“I’d bet even money,” McKinnon writes, that first lady JILL BIDEN will persuade her husband to “pass the baton” to someone else, which “may give the Democrats new headaches — and opportunities.”\nOn McKinnon’s list to replace Biden: VP KAMALA HARRIS, Transportation Secretary PETE BUTTIGIEG, Sen. AMY KLOBUCHAR (D-Minn.), former New Orleans Mayor MITCH LANDRIEU, Sen. CORY BOOKER (D-N.J.), California Gov.",
    "‘They want to defund the police.’ ‘They want open borders.’ ‘They want to empty the jails.’ It’s defining the party.”\nCarville acknowledges that polarization has changed the nature of politics, but not as much as many Democrats think, and that the key for his party remains capturing the persuadable center: “It’s not like it used to be, where you can move massive numbers of people with good messaging.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "office … Maureen “Mo” Elinzano of Rep. Doris Matsui’s (D-Calif.) office … John Newton of the Senate Agriculture GOP (4-0), celebrating his birthday and first wedding anniversary with a trip to Vegas in March … Tom Collamore of the George and Barbara Bush Foundation … Brian Donahue of CRAFT | Media/Digital … Geoff Smith of Oklahoma Gov.",
    "): “Inside the studio of America’s most controversial artist.”\n— “Let’s Be Real: The Supreme Court Is Political and Always Has Been,” by Jack Shafer: “And the public is just fine with that.”\n— “’No Regrets’ Is No Way to Live,” by Daniel Pink in the WSJ: “It’s tempting never to look back, but we’re hard-wired to focus on our mistakes.",
    "“The events of recent weeks have already turned crime — and the question of what to do about it — into the single biggest issue facing [Mayor ERIC ADAMS’] administration and has drawn in President Joe Biden, who will visit New York next week to discuss gun violence with Adams,” writes Erin Durkin.",
    "— Inside Biden’s hands-off approach to Justice STEPHEN BREYER’s retirement: Biden took a relatively laissez-faire strategy as Breyer mulled retirement, “lest overt pressure from the White House provoke irritation and make them less likely to leave,” write NYT’s Katie Rogers and Charlie Savage.",
    "RUSSIA-UKRAINE LATEST:\n— Defense Secretary LLOYD AUSTIN delivered “the military’s starkest public warning to date” Friday that Russia now has the capability to invade all of Ukraine, taking significant portions of territory and cities, per WSJ’s Vivian Salama, Drew Hinshaw and Gordon Lubold.",
    "… On the Ukrainian side of the [northern] border, preparations to repel a potential military incursion are largely nonexistent.”\n— The likely sanctions targets if Russia invades Ukraine: “major Russian banks, state companies and key imports,” report WSJ’s Ian Talley and Brett Forrest.",
    "Though the Pentagon said they don’t believe Russian President VLADIMIR PUTIN has yet decided whether to invade, they went into detail about what an invasion could entail, including a “significant amount of casualties,” said Joint Chiefs of Staff Chair Gen. MARK MILLEY.",
    "RUY TEIXEIRA, a liberal political analyst, says, ‘the left has managed to associate the Democratic Party with a series of views on crime, immigration, policing, schooling, free speech and of course race and gender that are quite far from those of the median voter.’”\n4.",
    "Yet even as his public approach differed wildly from the left’s “Retire, Breyer” campaign, behind the scenes, “Biden and his advisers spent the first year of his presidency quietly laying the groundwork” to nominate a Black woman to succeed the justice Supreme Court.",
    "POLITICO Playbook: Pundits to Biden: Here’s how to fix your presidency\nBy RYAN LIZZA\n01/29/2022 11:14 AM EST\nPresented by\nDRIVING THE DAY\nJUST POSTED — Maureen Dowd’s “Rhapsody for a Boy in Blue,” today’s must-read:\n“We don’t hear much about good cops these days.",
    "Jim Justice held up his pet dog, Babydog, during West Virginia’s State of the State address, and invited the state’s critics, including Bette Midler, to “kiss her hiney.”\nWill Saletan reflected on 25 years at Slate as he leaves for The Bulwark.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\n8 THINGS WE READ THAT STUCK WITH US …\n— The hot-mic gaffe between Biden and Fox News’ PETER DOOCY “turned out to be one of the most unlikely feel-good moments of his time in office,” writes NYT’s ?",
    "“While 58 percent of vaccinated-but-unboosted Democrats say they will get a booster as soon as they’re able, 18 percent of vaccinated-but-unboosted Republicans say the same.”\n— A “military conflict” between the U.S. and China?",
    "“With much of Ukraine’s military might concentrated in the country’s east … military analysts and Ukraine’s own generals say it will be difficult for the country to muster the forces necessary to defend its northern border.",
    "“If the Taiwanese authorities, emboldened by the United States, keep going down the road for independence, it most likely will involve China and the United States, the two big countries, in a military conflict,” he said.",
    "Panel: Doug Heye, Jacqui Heinrich and Harold Ford Jr.\nMSNBC “The Sunday Show”: Rep. Ami Bera (D-Calif.) … Nina Turner … Gloria Avent-Kindred … Karol Mason … Chasten Buttigieg … Ruth Marcus … Chicago Mayor Lori Lightfoot.",
    "But in a Kremlin readout of a call between Putin and French President EMMANUEL MACRON, Putin said “he would study the responses provided by Washington and NATO this week before deciding on further action,” per Reuters.",
    "While Zelenskyy said he was grateful for the U.S. support, per Bloomberg, he criticized the advice for U.S. embassy staffers’ families to leave the country as “a mistake, wrong overreacting steps that do not help us.",
    "Let’s begin with JAMES CARVILLE and WILL MARSHALL, two of the sharpest political and policy strategists of the 1990s who helped steer the Democratic Party to victory after the wilderness of the REAGAN-BUSH years.",
    "You might’ve missed it amid all the focus on Russia and Ukraine, but QIN GANG, China’s ambassador to the U.S., warned of that possibility in an interview with NPR published Friday.",
    "A group of more than 50 of the most prominent Black women in politics wrote a letter to Biden on Friday thanking him for promising to nominate a Black woman to the Supreme Court.",
    "But when it comes to those who are vaccinated and boosted, Democrats are about twice as likely to be in that group — 62 percent to 32 percent,” writes WaPo’s Aaron Blake.",
    "— Republicans are (naturally) relishing Biden’s troubles, using them to fuel their push to retake congressional majorities in the midterms, as NYT’s Annie Karni explores.",
    "Instead of spending weeks scrutinizing a nominee’s rulings and parsing legal intricacies for potential hearing questions, they simply rubber-stamped Mr. Trump’s picks.",
    "— The dire U.S. warnings stood in contrast to the messaging from Ukrainian leaders, who said the U.S. was hurting the country’s economy by creating unnecessary panic.",
    "— The buildup of Russian forces in Belarus “could presage an attack from a new vector, one in proximity to Ukraine’s capital, Kyiv,” reports NYT’s Michael Schwirtz.",
    "— “I think you’d have to go back quite a while to the Cold War days to see something of this magnitude,” Milley said, per NYT’s Helene Cooper and Eric Schmitt.",
    "Law & Crime’s Adam Klasfield live-tweeted the proceedings, including the revelation that Daniels believes she is a “medium” who can speak to the dead.",
    "Among those subpoenaed: Georgia state GOP Chair DAVID SHAFER, Nevada state GOP Chair MICHAEL MCDONALD and Michigan RNC Committeewoman KATHY BERDEN.",
    "The economy: “Democrats should cultivate economic optimism rather than lecturing the public incessantly on the moral failings of capitalism.”\n3.",
    "Then she disappeared.”\n— “Is Jon McNaughton trolling the left — or the right?” by the Deseret News’ Samuel Benson (now interning at POLITICO!",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "The good ones get tarred with the same brush, even though the last person who wants to get in a squad car with a bad cop is a good cop.",
    "But two questions hover above this dynamic, and are spurring debate in the party: (1) Does the GOP need a positive agenda of its own?",
    "She most recently was senior executive and director of digital engagement, marketing and comms at the National League of Cities.",
    "PHIL MURPHY, Commerce Secretary GINA RAIMONDO, Rep. ALEXANDRIA OCASIO-CORTEZ (D-N.Y.) and … DWAYNE “THE ROCK” JOHNSON.",
    "Michele Bachmann said Sarah Palin should be commended for dining at a restaurant while positive for the coronavirus.",
    "Michael Avenatti cross-examined his former client Stormy Daniels on Friday, and the results were … quite something.",
    "The most expensive item: her annotated copy of the 1957-58 Harvard Law Review, which sold for more than $100,000.",
    "CNN “Inside Politics”:Panel: Zolan Kanno-Youngs, Hans Nichols, Jackie Kucinich, Manu Raju and Joan Biskupic.",
    "President VOLODYMYR ZELENSKYY said that despite Russia’s troop buildup, the situation hasn’t escalated yet.",
    "…\n… Megan Corey is now head of marketing and comms at the Milken Center for Advancing the American Dream.",
    "As Biden visits, the city will still be reeling from the killing of two NYPD officers, notes Fox News.",
    "But we’re going to make it cost.”\nBIDEN’S SATURDAY — The president has nothing on his public schedule.",
    "Culture wars: “Biden and leading Democrats should push back more forcefully against cultural leftism.",
    "Inflation: “[T]ackle inflation with the same determination he showed in the vaccination campaign.”\n2.",
    "Not until that process was complete could they take the measure of her fitness to serve on the court.",
    "“Over Mr. Trump’s term, Republicans distilled the Supreme Court nomination process to pure politics.",
    "It is not the Titanic here.”\n— Putin said Friday that the West hasn’t addressed Russian demands.",
    "Their stories get lost amid the scalding episodes with trigger-happy, racist and sadistic cops.",
    "A new survey suggests “about 9 in 10 Democrats and 6 in 10 Republicans have gotten vaccinated.",
    "He most recently was director of digital assets at Tiedemann Advisors and is a Treasury alum.",
    "Mike Pence hasn’t spoken to Donald Trump since summer 2021, he told Fox News’ Jesse Watters.",
    "Read the letter\nTRANSITIONS — Matt Lahr is now comms director for Sen. Todd Young (R-Ind.).",
    "The outside advice givers, never a shy group, are stepping forward in force this morning.",
    "— Crime in NYC is shaking up the city’s politics — with potential national implications.",
    "Instead, he should look to the nomination and confirmation of Justice AMY CONEY BARRETT.",
    "… David Vennett is joining Pagaya Technologies as chief of staff to the CEO/co-founder.",
    "— The partisan gap on Covid-19 booster shots is worse than on initial vaccinations.",
    "Mr. Biden shouldn’t look to the process we followed in the Sotomayor nomination.",
    "ABC “This Week”: Sen. Dick Durbin (D-Ill.) … Sen. Susan Collins (R-Maine) … U.S.",
    "Heidi Heitkamp announced Friday that she’s leaving the new lobbying firm Actum.",
    "Sending more military aid is “going to ultimately not stop Putin,” Green said.",
    "GAVIN NEWSOM, Georgia gubernatorial hopeful STACEY ABRAMS, North Carolina Gov.",
    "[On Twitter,] but also in newsrooms and academia and all over the foundations.",
    "He previously was deputy director of strategic comms in the Office of the DNI.",
    "… Michael Greenwald is joining Amazon Web Services in a senior executive role.",
    "FOX “Fox News Sunday,” guest-anchored by Dana Perino: Sen. Tom Cotton (R-Ark.)",
    "Panel: David Urban, Alyssa Farah Griffin, Rep. Lisa Blunt Rochester (D-Del.)",
    "That comes just one day after the creation of the new shop was announced.",
    "Ruth Bader Ginsburg’s personal library fetched $2.3 million in auction.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza, Tara Palmeri.",
    "Panel: Chris Christie, Donna Brazile, Donna Shalala and Reihan Salam.",
    "Bob Menendez (D-N.J.) and Jim Risch (R-Idaho) … New Hampshire Gov.",
    "But he also thinks Biden won’t run — and hints that he shouldn’t.",
    "He currently is principal adviser to the U.N. secretary-general.",
    "She previously was digital director for the House Budget Dems.",
    "Kevin Stitt’s D.C. office … Kara Van Stralen of Colorado Gov.",
    "France reported that Putin said he didn’t want an escalation.",
    "HARRIS’ SATURDAY — The VP has nothing on her public schedule.",
    "… Samantha Carter is joining Sen. Chris Van Hollen’s (D-Md.)",
    "And what it’s done is weaken our political immune system.",
    "He is fully vaccinated and boosted, and is asymptomatic.",
    "NBC “Meet the Press”: Sen. Dick Durbin (D-Ill.) … Sen.",
    "Gray TV “Full Court Press”: Leon Panetta … John Kirby.",
    "Panel: Stephen Hayes, Carol Lee and Claire McCaskill.",
    "But the problem is they make 70 percent of the noise.",
    "All I can tell you is that this is what people hear.",
    "Mitt Romney has tested positive for the coronavirus.",
    "(6-0) … Gaby Hurt of Sen. John Barrasso’s (R-Wyo.)",
    "?Michael Grynbaum (“OK, hear me out,” he pleads).",
    "People believe this is what the party represents.",
    "HAPPY BIRTHDAY: Rep. Jake Auchincloss (D-Mass.)",
    "Ambassador to the U.N. Linda Thomas-Greenfield.",
    "Send Playbookers tips to playbook@politico.com.",
    "ROY COOPER, Sen. ELIZABETH WARREN (D-Mass.",
    "Did someone forward this email to you?",
    "“And he knows that, and we know that.",
    "(2) Are Republicans peaking too soon?",
    "It’s the smallest part of the party.",
    "Rob Portman (R-Ohio) … Arkansas Gov.",
    "Asa Hutchinson and New Jersey Gov.",
    "CNN “State of the Union”: Sens.",
    "Thanks for reading Playbook.",
    "office as digital director.",
    "Good Saturday morning.",
    "“Those days are gone.",
    "and Stephanie Cutter.",
    "), New Jersey Gov.",
    "Chris Sununu.",
    "Sign up here.",
    "… John Kirby.",
    "Phil Murphy."
  ]
}