{
  "id": 2760,
  "mediaId": 2540,
  "date": "2022-01-28",
  "headline": "Pittsburgh bridge collapses ahead of Biden city visit to talk infrastructure",
  "image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/8f44c88a-38b8-47d6-886d-c20fa8088a6b.jpg",
  "link": "https://www.cnn.com/us/live-news/bridge-collapse-pittsburgh-01-28-21/h_c867c98f712d400fd05c58e5884d22ff",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aditi Sangal",
  "authorUrl": "https://www.cnn.com/profiles/aditi-sandal",
  "termIds": [
    0
  ],
  "sentences": [
    "“It literally just collapsed and now we have a situation here… from a transportation standpoint, it's going to be incredibly difficult to imagine getting around the way this was given the bridge that is collapsed.”\nFire crews rappelled at least 100 feet to rescue victims\nFirst responders used rescue equipment to rappel down about 100 to 150 feet to reach victims of today's bridge collapse in Pittsburgh, Fire Chief Darryl Jones said at a news conference this morning.",
    "The President will proceed with trip planned for today and will stay in touch with officials on the ground about additional assistance we can provide.”\nWhy Biden's visit to Pittsburgh today is significant, according to the city's mayor\nThe Pittsburgh bridge collapse occurred ahead of President Biden's scheduled visit to the city this afternoon, where he was expected to deliver remarks on his recently passed infrastructure law.",
    "According to the state's Department of Transportation, the “Bridge condition is determined by the lowest condition rating of the primary components of a bridge or culvert.”\n“If the lowest rating is greater than or equal to 7, the bridge is classified as Good; if it is less than or equal to 4, the classification is Poor.",
    "Collapsed bridge had been given overall \"poor\" rating by Pennsylvania's transportation department\nThe bridge that collapsed today in Pittsburgh had an “overall condition” rating of “poor,\" according to the Pennsylvania Department of Transportation website that tracks bridges across the state.",
    "The department's website says the deck condition was rated “4 - Poor,” the superstructure condition was also “4 - Poor,” and the substructure condition was rated “6 - Satisfactory.”\nDuring a news conference earlier today, Pittsburgh Mayor Ed Gainey said it was last inspected September 2021.",
    "Biden will proceed with Pittsburgh trip after nearby bridge collapse\nPresident Biden is aware of the bridge collapse in Pittsburgh, which happened earlier this morning about six miles away from where he is set to deliver remarks on infrastructure and other topics later Friday.",
    "It’s time to rebuild this nation.”\nNational Transportation Safety Board sends team to Pittsburgh bridge collapse\nThe National Transportation Safety Board says its sending a “go-team” to the bridge collapse, with chair Jennifer Homendy as the board member on scene.",
    "Here are the latest details on the Pittsburgh bridge collapse\nThe Allegheny County Police Department was notified about a partial bridge collapse after 6 a.m. Friday, Amie Downs, the county's communications director, said in a statement.",
    "Four ?vehicles were on the bridge at the time of the collapse and only minor injuries have been reported, Downs said, adding that a driver of an articulated bus and two passengers were among those rescued with minor injuries.",
    "“This collapse is just the latest in a long line of preventable, man-made disasters that prove what so many of us in Pennsylvania and around the country have been saying for years: Our infrastructure is failing our people.",
    "John Fetterman, who was at the site of a bridge collapse in Pittsburgh this morning, called the disaster a “tragedy\" and added that infrastructure can no longer be neglected ahead of President Biden's visit to the city.",
    "“It crosses Frick Park, which is one of Pittsburgh's largest parks, and it's just a vital artery here in the city of Pittsburgh.”\nPresident Biden is expected to be in Pittsburgh later today to discuss infrastructure.",
    "Our team is in touch with state and local officials on the ground as they continue to gather information about the cause of the collapse,” the White House said in a statement.",
    "“This is a horrible way to underscore just how critical our infrastructure needs are in this country because this is a vital artery in the Pittsburgh area,” Fetterman said.",
    "Jane Dudley was shoveling snow at her house, two blocks from the entrance of Pittsburgh's Frick Park, when she heard a crash just after 6:30 a.m.",
    "The statement continued, “The President is grateful to the first responders who rushed to assist the drivers who were on the bridge at the time.",
    "But with him coming today, to talk about this infrastructure bill, to discuss why this funding is so important, today is significant,\" he said.",
    "A snow-covered bridge in Pittsburgh collapsed this morning and left several injured hours before President Biden's scheduled visit to the city.",
    "“This bridge is a vital part of the infrastructure that gets the Eastern community in Squirrel Hill and into the city of Pittsburgh,” he said.",
    "There was a massive gas leak caused by the collapse, which is now under control, according to Pittsburgh Fire Department Chief Darryl Jones.",
    "County Executive Rich Fitzgerald said he had received a call from the White House earlier among others, who are all \"reaching out to help.\"",
    "We need to make use of the legislation President Biden ushered in, rebuild our roads and bridges, and fix our faulty infrastructure.",
    "Biden visited the site of the collapsed bridge and in a speech underscored the importance of rebuilding the nation's infrastructure.",
    "After the crash, Dudley heard a loud roaring noise echoing out from the ravine in Frick Park, so she and her husband walked over.",
    "Biden is scheduled to deliver remarks today not far from where the bridge collapsed on strengthening the nation's infrastructure.",
    "Our roads and bridges, which are supposed to connect us and bring us together, are increasingly putting us in danger,” he said.",
    "“As a result of Biden’s infrastructure bill, the state is now getting $1.6 billion to repair bridges like this one,” he said.",
    "Pittsburgh Mayor Ed Gainey said in a news conference today that no fatalities have been reported in the bridge collapse.",
    "Here's what Dudley saw when she got to the scene:\n\"Our infrastructure is failing our people,\" Pennsylvania Lt. Gov.",
    "The bridge had an \"overall condition\" rating of \"poor,\" according to the Pennsylvania Department of Transportation.",
    "The mayor shared an aerial image of the collapse on Twitter, thanking rescue teams for their \"quick response.\"",
    "At least 10 people suffered minor injuries in the bridge collapse, three of whom were taken to a hospital.",
    "\"This bipartisan infrastructure law, it is critical to southwest Pennsylvania and the city of Pittsburgh.",
    "Once there, Dudley saw the remains of the collapsed Forbes Avenue bridge that stretched across the park.",
    "The bridge was built in 1970, was 447 feet long, and made of a steel rigid frame, the website says.",
    "It's also when she said she realized the roar was the sound of a broken natural gas pipeline.",
    "See the photo:\nCNN's Paul P. Murphy and Paradise Afshar contributed reporting to this post.",
    "There are some reports of people feeling ill in the area from the natural gas, Downs said.",
    "We are told by the gas company that all their gas service has been restored,\" Jones said.",
    "In Pittsburgh, in Pennsylvania, and across America, we cannot afford neglect any longer.",
    "“It was handled as best as it could be handled,” Jones said of the rescue effort.",
    "John Fetterman called the bridge a “vital artery” for the city on CNN’s New Day.",
    "Fetterman also expressed support for the President’s infrastructure plan.",
    "She was shoveling snow 2 blocks from the bridge when she heard a crash.",
    "Bridges rated 5 or 6 are classified as Fair,” the website explains.",
    "“The President has been told of the bridge collapse in Pittsburgh.",
    "We're finding out now when the last inspection was and everything.",
    "He will proceed with that trip, according to the White House.",
    "Jones said the cause of the collapse is under investigation.",
    "Officials are still investigating what caused the collapse.",
    "Four vehicles were on the bridge when it fell, Jones said.",
    "\"It’s a major artery to our neighborhood,\" Dudley said.",
    "The team will arrive this afternoon, the board tweeted.",
    "The cause of the collapse is still under investigation.",
    "Read more about the bridge collapse in the posts below.",
    "She took the following photos of the collapsed bridge.",
    "Mayor Ed Gainey said the law is critical for the city.",
    "We know we have bridges that we need to take care of.",
    "\"Several families were evacuated from their homes.",
    "\"It’s the only road that goes over the park.\"",
    "“Now more than ever, we need to get to work.",
    "John Fetterman says\nPennsylvania Lt. Gov.",
    "They are being treated on scene.",
    "They have been allowed back.",
    "Our live coverage has ended.",
    "Here's what she saw.",
    "Lt. Gov.",
    "ET."
  ]
}