{
  "id": 3017,
  "mediaId": 8469,
  "date": "2022-01-29",
  "headline": "Pennsylvania Democrats consider endorsing in Senate primary",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2017/11/cropped-web1_22-TL-Logo.jpg.webp",
  "link": "https://www.timesleader.com/wire/state-wire/1536845/pennsylvania-democrats-consider-endorsing-in-senate-primary",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MARC LEVY",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Lamb has called each committee member multiple times, his campaign said, and sent them mail pieces, including one that crowed that he “beat the Trump machine three times.”\nThe wide-open race for the battleground-state seat being vacated by two-term Republican Sen. Pat Toomey of Pennsylvania is expected to be one of the nation’s premier Senate contests this year.",
    "HARRISBURG, Pa. (AP) — Pennsylvania’s Democratic Party committee members will meet Saturday in suburban Harrisburg to vote on whether to endorse in the party’s hotly contested primary race for U.S. Senate.",
    "The Democratic field features John Fetterman, the state’s lieutenant governor, plus Montgomery County Commissioner Val Arkoosh and state Rep. Malcolm Kenyatta of Philadelphia.",
    "Lamb, he said, has been calling caucus members since last summer, while the other candidates only began reaching out in the past couple weeks.",
    "The Republican field is notable for three wealthy and well-connected candidates moving from blue states to run in Pennsylvania.",
    "Conor Lamb, a third-term congressman from suburban Pittsburgh, is considered the favorite to clear that bar, if anybody does.",
    "Its chair, David Rodriguez, said caucus members concluded that Lamb is the best candidate to win November’s election.",
    "Winning an endorsement is a high hurdle to clear, two-thirds of the party’s roughly 350 committee members.",
    "Lamb already has the unanimous endorsement of the party’s 56-member Latino Caucus.",
    "Lamb’s campaign has worked for months to win over committee members.",
    "Follow Marc Levy on Twitter at www.twitter.com/timelywriter",
    "The primary election is May 17."
  ]
}