{
  "id": 3056,
  "mediaId": 8401,
  "date": "2022-02-02",
  "headline": "Millions Follow Rich Candidates In Pennsylvania Senate Race",
  "image": "https://philadelphia.cbslocal.com/wp-content/uploads/sites/15116066/2021/03/GettyImages-1211404993.jpg?w=1500",
  "link": "https://philadelphia.cbslocal.com/2022/02/02/pennsylvania-senate-race-politics-millions-rich-candidates/",
  "mediaOutlet": "philadelphia.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "One of the super PAC’s ads said McCormick “even criticized Trump’s China policy,” a reference to comments McCormick made while with Bridgewater, saying that trade dealings with China under former President Donald Trump had veered into the “weaponization of exports.”\nMcCormick, in his TV ads, has adopted the slogan “battle-tested, Pennsylvania true” and focused on burnishing his Pennsylvania ties.",
    "In another, he says, “I was born here, and I’ll die here.”\nPerhaps as a nod to Oz’s attacks, McCormick in that same ad says “Like Trump, I’ve dealt with China and will never back down,” a reference to McCormick’s service as a high-level Treasury Department official in the administration of former President George W. Bush.",
    "But Oz and a super PAC aligned with him have steadily attacked McCormick in a series of TV ads that attempt to paint McCormick as a creature of Wall Street, an outsourcer and soft on China because of his former hedge fund’s portfolio that catered to Chinese investors investing in China.",
    "McCormick, who grew up in Pennsylvania and spent a decade of his adult life in Pittsburgh, has nevertheless lived in Connecticut the past 12 years, where he helped run one of the world’s largest hedge funds, Bridgewater Associates.",
    "HARRISBURG, Pa. (AP) — Cash is pouring into Pennsylvania’s hotly contested race for U.S. Senate as wealthy and well-connected candidates move in from out of state, followed by millions of dollars going into TV ads and super PACs.",
    "That included $5 million from conservative billionaire donor Ken Griffin, CEO and founder of Chicago-based Citadel LLC, a multinational hedge fund, and founder of financial services giant Citadel Securities.",
    "Oz, a heart surgeon, has traded on his status as perhaps TV’s best-known doctor to portray himself as being better prepared to deal with questions about the COVID-19 pandemic than federal officials.",
    "The wide-open race for the battleground-state seat being vacated by two-term Republican Sen. Pat Toomey of Pennsylvania is expected to be one of the nation’s premier Senate contests this year.",
    "Filings posted online by the Federal Election Commission before Monday night’s deadline showed Mehmet Oz — best known as daytime TV’s host of “The Dr. Oz Show” — loaned himself $5.2 million.",
    "Fetterman raised $2.7 million in the last three months of 2021 but spent more than half of it, while Lamb raised $1.3 million and spent a little less than half, according to the filings.",
    "A couple of ads focus on McCormick’s growing up in Bloomsburg, his service in the Gulf War and fighting for “American capitalism, not socialism,” as he puts it in one ad.",
    "READ MORE:\nWhile carpetbaggery has become a major theme in the Republican primary, Oz apparently views McCormick as his primary rival for the Republican nomination.",
    "John Fetterman kept a strong cash advantage — $5.3 million to $3 million — over his nearest rival, Conor Lamb, a third-term congressman from suburban Pittsburgh.",
    "READ MORE:\nMeanwhile, a super PAC supporting a Republican rival of Oz’s, former hedge fund CEO David McCormick, is tapping into the world of finance for cash.",
    "Because McCormick entered the race in January, he did not have to file a year-end campaign finance report.",
    "Three other rivals in each party’s primary each raised in the six figures in the last quarter of 2021.",
    "“I’m running for Senate because Washington got COVID wrong,” he said in an introductory TV ad.",
    "Oz has lived in New Jersey the past two decades after going to medical school in Philadelphia.",
    "He already spent nearly all of it in his quest for the Republican nomination.",
    "MORE NEWS:\nAll contents © copyright 2022 Associated Press.",
    "In the Democratic primary race, Lt. Gov.",
    "The primary election is May 17.",
    "All rights reserved"
  ]
}