{
  "id": 3083,
  "mediaId": 2551,
  "date": "2022-01-28",
  "headline": "Motorist describes moment he survived the Pittsburgh bridge collapse",
  "image": "https://i.dailymail.co.uk/1s/2022/01/28/23/53504927-0-image-a-79_1643414149548.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10453767/Motorist-describes-moment-survived-Pittsburgh-bridge-collapse.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "$110 billion for roads and bridges\n$39 billion for public transit\n$66 billion for railways\n$65 billion for expanding broadband internet\n$25 billion to repair major airports\n$7.5 billion for the first-ever network of charging stations for electric vehicles\n$21 billion to respond to environmental concerns like pollution\n$73 billion to modernize America's energy grid\nFUNDING\n$650 billion in funding for the bill comes from existing, planned investments in the country’s roads, highways and bridges\nThe remaining $550 billion over the next five years requires new spending\nDemocrats wanted to fund the rest through tax revenues like a new gas tax\nRepublicans wanted to raise money through fees issues on those who use the new infrastructure\nThe bipartisan compromise, sure to raise heated debate, proposed using $205 billion in untapped COVID-19 relief aid and unemployment assistance that was turned away by some states\nAdvertisement",
    "+36\nView gallery\nA Port Authority bus that had three passengers and a driver inside was on the bridge when it collapsed, miraculously no one was injured\n+36\nView gallery\nA red pick up truck with an overturned vehicle is visible following the collapse of a bridge in Pittsburgh early Friday morning\n+36\nView gallery\nEmergency personnel arrived at the scene of the collapse and had to form a human chain to help rescue multiple people from a dangling bus\n+36\nView gallery\nBiden toured the damaged bridge accompanied by local leaders and visited one end of the collapsed bridge where he spoke with first responders and local and state officials for an impromptu briefing (pictured with Mayor Ed Gainey)\n+36\nView gallery\nPresident Joe Biden's first stop in Pittsburgh was to the collapsed bridge site.",
    "The red Port Authority bus could still be seen from the edge, which hours after the collapse was roped off with yellow police tape, as well as a damaged pickup truck, a black sedan and two other overturned cars\n+36\nView gallery\nPresident Joe Biden addressed the bridge collapse at the top of his remarks at Mill 19 Friday afternoon\n+36\nView gallery\nAn overhead shot of the two-lane span, on Forbes Avenue over Fern Hollow Creek in Frick Park- one of Pittsburgh's largest parks- came down around 7 a.m, taking multiple vehicles with it\n+36\nView gallery\nDramatic photos show the Port Authority bus- which had three passengers and a driver on board - perched upright on the edge of the bridge.",
    "Authorities confirmed 10 injuries\n+36\nView gallery\nCrews say two people who were on the bus were taken to the hospital with minor injuries and the other injuries are obtained by safety crew members who slipped or fell during the rescue\n+36\nView gallery\nA law enforcement official told Biden, seen near the scene with Mayor Ed Gainey, that officials were still not sure if the collapse was caused by a gas leak or if the smell of gas was a result of the collapse\n+36\nView gallery\nThe collapse came hours before President Joe Biden was due to visit Pittsburgh to tout his $1.2 billion infrastructure bill.",
    "+36\nView gallery\nThe two-lane span, on Forbes Avenue over Fern Hollow Creek in Frick Park - one of Pittsburgh's largest parks - was called a was vital to connecting the Eastern community in Squirrel Hill into the city of Pittsburgh\n+36\nView gallery\nA September 2019 inspection of the city-owned bridge revealed the deck and superstructure to be in poor condition, according to the U.S. Department of Transportation´s National Bridge Inventory\n+36\nView gallery\nFirst responders load an empty stretcher into an ambulance at the scene where a bridge collapsed.",
    "+36\nView gallery\nA passerby takes pictures of the aftermath of the bridge collapse which resulted in 10 injuries and no fatalities, according to officials\n+36\nView gallery\nThe Fern Hollow bridge was vital to connecting the Eastern community in Squirrel Hill into the city of Pittsburgh\n+36\nView gallery\nThe deck' condition was rated '4 - Poor,' the superstructure condition was also '4 - Poor,' and the substructure condition was rated '6 - Satisfactory,' by the Department of Transportation´s National Bridge Inventory.",
    "+36\nView gallery\nThe bridge, located about a quarter-mile from the Reynolds Street entrance to Frick Park, goes over a wooded ravine and a creek that are part of the park\n+36\nView gallery\nAt the time of the collapse, there were just four vehicles on the bridge, Pittsburgh Fire Chief Darryl Jones said\n+36\nView gallery\nA commuter bus with three people and the driver on board is perched upright on the wreckage of the collapsed bridge in Pittsburgh's Frick Park neighborhood.",
    "+36\nView gallery\nA photo from the scene shows the commuter bus upright on a section of the collapsed bridge while another vehicle is shown dangling near the edge\n+36\nView gallery\nThe steel span, built in 1970, carried about 14,500 vehicles a day and is posted with a 26-ton weight limit, collapsed Friday morning\n+36\nView gallery\nThe bus and several cars went down with the bridge when it collapsed around 6am.",
    "+36\nView gallery\nBuilt in 1970, the 447-foot-long span is rated in poor condition and is posted with a 26-ton weight limit\n+36\nView gallery\nCity officials said the bridge had just been inspected a few months back in September, but did not say if there were any issues discovered during that inspection\n+36\nView gallery\nThe bridge is about a quarter-mile from the Reynolds Street entrance to Frick Park.",
    "+36\nView gallery\nVehicles are visible on the remains of the collapsed bridge that affected four vehicles and injured 10 people on the scene\n'I've been coming to Pittsburgh a long time, and as a former Pennsylvanian, but I didn't realize they're literally more bridges in Pittsburgh than any other city in the world.",
    "Authorities said the cause of the collapse of the 'vital' bridge in the Frick Park are is still unknown\n+36\nView gallery\nCouncilman Corey O'Connor said that the collapse of the vital bridge could effect traffic in the area for years: 'This is a vital road, artery, in our area,' he said.",
    "+36\nView gallery\nPennsylvania driver Jeremy Habowski said he is lucky to be alive after he was one of the motorists who was on the Pittsburgh bridge this morning when it collapsed\n+36\nView gallery\nHabowski and other motorists were unable to stop in time before the bridge collapsed.",
    "The unfinished bridge collapsed onto Southwest Eighth Street, crushing cars that had been waiting at a red light and was one of the deadliest structural failures in South Florida history before the June 2021 Surfside condo collapse, the Miami Herald reported.",
    "Photographs from the scene showed the bus - which had three passengers and a driver on board - perched upright on the edge of the bridge, which was was determined to be in poor overall condition by the Pennsylvania Department of Transportation in 2019.",
    "The feds also criticized FIU, the Florida Department of Transportation and the project's design team for lacking judgment and common sense when failing to close the busy road underneath the bridge while a construction crew performed emergency work.",
    "'This collapse is just the latest in a long line of preventable, man-made disasters that prove what so many of us in Pennsylvania and around the country have been saying for years: Our infrastructure is failing our people.",
    "It is not yet known what caused the span - built in 1970 - to give out, but it is one of 123 bridges rated 'poor' in Allegheny County, according to the U.S. Department of Transportation´s National Bridge Inventory.",
    "Biden's new infrastructure law includes $27 billion in funding to help states and cities fix aging bridges, with Pennsylvania set to receive $1.6 billion of that money in the next five years, the Post reported.",
    "BREAK DOWN OF THE $1.2T BIPARTISAN INFRASTRUCTURE BILL\nPresident Joe Biden signed the bipartisan infrastructure package into law in mid-November and is now traveling around the country touting its benefits.",
    "Pennsylvania's bridges were ranked the fifth-worst in the nation in 2020, by the American Road and Transportation Builders Association in its most recent annual survey, the Washington Post reported.",
    "It is not yet known what caused the span to give out, but it is one of 123 bridges rated 'poor' in Allegheny County, according to the U.S. Department of Transportation´s National Bridge Inventory.",
    "The department's website says the deck condition was rated '4 - Poor,' the superstructure condition was also '4 - Poor,' and the substructure condition was rated '6 - Satisfactory,' CNN reported.",
    "A September 2019 inspection of the city-owned bridge revealed the deck and superstructure to be in poor condition, according to the U.S. Department of Transportation´s National Bridge Inventory.",
    "A September 2019 inspection of the city-owned bridge revealed the deck and superstructure to be in poor condition, according to the U.S. Department of Transportation´s National Bridge Inventory.",
    "A law enforcement official told Biden during a tour of the damage that officials were still not sure if the collapse was caused by a gas leak or if the smell of gas was a result of the collapse.",
    "As part of his trip, the president will visit the research and development hub of Mill 19, which was part of the infrastructure deal passed by Congress last year, the Washington Post reported.",
    "Several safety crew members who slipped or fell during the rescue were treated for injuries\n+36\nView gallery\nAn overturned car remains on a Pittsburgh bridge that overturned on Friday morning.",
    "During his visit Biden inquired if it was too early for there to be joggers on the trail and an officer said there were a few and that one of them actually helped get people out of the cars.",
    "President Joe Biden visited the site of the collapse on Friday morning; he had already planned to spend Friday afternoon in Western Pennsylvania to the city to discuss infrastructure plans.",
    "Biden had hoped to also get his 'Build Back Better' bill through Congress, which complimented the infrastructure bill, but with spending for social programs and climate change initiatives.",
    "Crews say two people who were on the bus were taken to the hospital with minor injuries and the other injuries are obtained by safety crew members who slipped or fell during the rescue.",
    "Speaking in Kansas City, Buttigieg said safety problems with bridges and roads across the nation was a result of disinvestment in public infrastructure, Kansasreflector.com reported.",
    "The bridge, owned by the city of Pittsburgh, was about 470 feet long and carried about 14,500 vehicles a day and had a posted a 26-ton weight limit because of its poor condition.",
    "The two-lane span, on Forbes Avenue over Fern Hollow Creek in Frick Park - one of Pittsburgh's largest parks - caved in around 7 a.m, taking multiple vehicles with it.",
    "During the collapse, four vehicles were on the bridge at the time with only 10 minor injuries reported at the scene, according to Pittsburgh Fire Chief Darryl Jones.",
    "A Pennsylvania motorist spoke out about the moment he warned other drivers about the Pittsburgh bridge collapse before one of the cars rolled down into the debris.",
    "It goes over a wooded ravine and a creek that are part of the park\nHoward Seltman, 67, who lives nearby on Briarcliff Road, called 911 after he heard the collapse.",
    "Sam Wasserman, a spokesperson for Pittsburgh Mayor Ed Gainey, said the most recent inspection occurred in September but the report was not immediately available.",
    "'Our team is in touch with state and local officials on the ground as they continue to gather information about the cause of the collapse,' the statement said.",
    "Driver Jeremy Habowski considers himself lucky to be a survivor after he and other motorists were unable to stop their vehicles in time during the collapse.",
    "The bridge, located about a quarter-mile from the Reynolds Street entrance to Frick Park, goes over a wooded ravine and a creek that are part of the park.",
    "Fern Hollow Bride collapse\nThe two-lane span, on Forbes Avenue over Fern Hollow Creek in Frick Park - one of Pittsburgh's largest parks opened in 1973.",
    "Neighbor Wendy Stroh, who lives nearby, told CBS Pittsburgh that the collapse sounded like 'a huge snow plow … pushing along the surface with no snow'.",
    "John Fetterman, Pittsburgh Mayor Ed Gainey and others, where he spoke with first responders and local and state officials for an impromptu briefing,.",
    "On Friday transportation secretary Pete Buttigieg said the collapse illustrated the necessity of federal investment in the nation's infrastructure.",
    "The cause of the collapse remains under investigation and emergency crews are continuing to check if anyone was beneath the bridge at the time.",
    "The National Transportation and Safety Board later concluded the 'catastrophic failure' stemmed from a flawed design with 'significant errors.'",
    "After reports of a strong smell of gas in the air a natural gas line was cut and nearby homes were evacuated, Pittsburgh Public Safety said.",
    "John Fetterman (right)\n+36\nView gallery\nPittsburgh Police blocks access at the opposite side of the Fern Hollow Bridge bridge collapse.",
    "He added that everyone who had been trapped was rescued by crew who had to rappel 100 to 150 feet down the ravine to rescue motorists.",
    "The president asked how long it took for the gas company to shut the gas and he was told it was turned off after about a half an hour.",
    "People were in the park around the time of the collapse, but authorities have not reported any injuries from those on the trail.",
    "Councilman Corey O'Connor told CBS Pittsburgh that the collapse of the vital bridge could effect traffic in the area for years.",
    "Our roads and bridges, which are supposed to connect us and bring us together, are increasingly putting us in danger,' he said.",
    "Putting his hand on the shoulder of a police officer the president said, 'these guys deserve an incredible amount of credit.'",
    "'The scariest part was definitely going over the edge because there was a gap and my car left the ground,' Habowski told CNN.",
    "He then checked on another driver following the collapse and attempted to stop other vehicles from driving into the debris.",
    "However, at the time of the collapse, there were just four vehicles on the bridge, Pittsburgh Fire Chief Darryl Jones said.",
    "'It is a very blunt reminder, among many reminders, of just how urgent the need is to invest in American infrastructure.'",
    "The steel span carried about 14,500 vehicles a day and had a posted a 26-ton weight limit because of its poor condition.",
    "'The President is grateful to the first responders who rushed to assist the drivers who were on the bridge at the time.'",
    "Fetterman said the bridge was vital to connecting the Eastern community in Squirrel Hill into the city of Pittsburgh.",
    "'I hope it's a wake-up call to the nation that we need to make these infrastructure investments,' Fetterman added.",
    "On the scene he was joined by Sen. Bob Casey (left), as well as Rep. Conor Lamb (second from right) and Lt. Gov.",
    "The state had almost 12,000 bridges in need of repair, according to the group's analysis of federal data.",
    "The collapse comes three years after an unfinished 950-ton bridge collapsed in Miami, killing six people.",
    "Fetterman stopped by the site shortly after the collapse and called it 'just an awful, surreal scene.'",
    "Advertisement\nCity officials said the collapse caused a gas leak but the gas has since been shut off.",
    "'They also did like a daisy chain with just hands, grabbing people and pulling them up,' Jones said.",
    "'Next time we don't need headlines saying that someone was killed when the next bridge collapses.'",
    "Other vehicles, however, managed to stop in time after the silver car went drove over the edge.",
    "After the collapse, he then warned other drivers to prevent them from driving into the debris.",
    "'I got off the bridge and started crawling up the hill to warn other drivers,' he continued.",
    "Earlier in the day the White House confirmed that Biden would proceed with his planned trip.",
    "Biden toured the damaged bridge accompanied by Senator Bob Casey, Rep. Conor Lamb, Lt. Gov.",
    "'And, by the way, we’re going to give you guys more money too - cops,' the president said.",
    "Later, he opened his planned speech by talking about what he had just witnessed.",
    "'Bottom line is this shouldn't happen in the United States of America,' he said.",
    "'This is a road that a lot use in the east end, going around the tunnel.",
    "'That bridge carries a lot of traffic every day,' he told triblive.com.",
    "His car is now resting on top of the remains of the collapsed bridge.",
    "She added: 'I didn't know what it was … It was very frightening.'",
    "Not a joke, this is going to be a gigantic change,' he promised.",
    "'But the silver car ended up going over when I neared the top.'",
    "Other rescuers rappelled nearly 150ft to help with the rescue.",
    "'We've got to get it on with it, we've gotta move,' he urged.",
    "Authorities reported 10 minor injuries but no fatalities.",
    "Another officer remarked: 'It’s a miracle, Mr. President.",
    "'It literally can threaten lives,' the president added.",
    "We're looking at a couple-year closure here possibly.'",
    "'This is a vital road, artery, in our area,' he said.",
    "Authorities have warned motorists to avoid the area.",
    "More than in Venice,' Biden remarked at the site.",
    "'Well, I’ll be damned,' Biden said amazed.",
    "'It was a lot to take in,' Habowski added.",
    "Three people were taken to hospital.",
    "It’s astounding,' Biden said.",
    "'We're going to fix them all.",
    "And we're sending the money.'",
    "'There's 43,000 nationwide.",
    "The scene smelled of gas.",
    "'How does this happen?'",
    "It’s a miracle.'",
    "'It really is.",
    "It really is.",
    "Did you know?"
  ]
}