{
  "id": 3100,
  "mediaId": 5118,
  "date": "2022-01-28",
  "headline": "10 injured in Pittsburgh bridge collapse; Human chain formed to help rescue people from bus",
  "image": "https://cdn.abcotvs.com/dip/images/11517404_012822-cc-ap-pittsburgh-bridge-collapse-img.jpeg?w=1600",
  "link": "https://abc7chicago.com/pittsburgh-bridge-collapse-pa-frick-park-biden-infrastructure/11517107/",
  "mediaOutlet": "abc7chicago.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Meier",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "— Jen Psaki (@PressSec) January 28, 2022\nThe president is slated to tout his Bipartisan Infrastructure Law, which is set to provide $1.63 billion to Pennsylvania in federal funding for bridges alone, the third highest figure for any state.",
    "PITTSBURGH -- Several commuters and first responders were injured when a snow-covered bridge collapsed in Pittsburgh, prompting people to form a human chain to help rescue people from a dangling bus.",
    "Biden is aware of the collapse and \"is grateful to the first responders who rushed to assist the drivers who were on the bridge at the time,\" according to a White House statement.",
    "Three or four vehicles were on the two-lane commuter bridge, which spans over a creek in Frick Park, when it collapsed Friday morning, Pittsburgh Fire Chief Darryl Jones said.",
    "The President will proceed with trip planned for today and will stay in touch with officials on the ground about additional assistance we can provide.",
    "John Fetterman called the bridge \"a vital infrastructure artery\" for the city, adding, \"It's surreal this morning to see it completely collapsed.\"",
    "(@ACE_Fitzgerald) January 28, 2022\nA strong natural gas odor was detected after the collapse, and a gas line has since been cut, authorities said.",
    "Responders rappelled down about 150 feet to reach the collapse site, as others formed the human chain, the Associated Press reported.",
    "The collapse happened hours before President Joe Biden's scheduled visit to the Pennsylvania city to promote his infrastructure plan.",
    "We are extremely fortunate there there were only non-life threatening injuries in this morning’s partial bridge collapse.",
    "Pennsylvania has 3,353 bridges in poor condition, the second most after Iowa, according to data from the administration.",
    "Images from the scene show a bus atop a section of the bridge that fell and sloped upward at a near 45-degree angle.",
    "@POTUS is grateful to the first responders who rushed to assist the drivers who were on the bridge at the time.",
    "Ten people suffered non-life-threatening injuries, and three were transported to nearby hospitals.",
    "\"Thank God that school buses were delayed due to weather, so there was less traffic than normal.",
    "First responders trying to help in the icy conditions were among the injured, Jones said.",
    "I wish all of those who were injured a safe and swift recovery,\" Fetterman said.",
    "Local officials, however, will be authorized to allocate funding to bridges.",
    "Officials said only a driver and passenger were aboard the bus at the time.",
    "The National Transportation Safety Board is sending a team to the scene.",
    "He will continue Friday's trip as planned, White House officials said.",
    "The bridge was last inspected in September 2021, officials said.",
    "Thank you to all of our first responders for their quick action.",
    "Thank God there have been no casualties reported at this point.",
    "This is a major artery and we have a lot of work ahead of us.",
    "There was also a car upside down in front of the bus.",
    "The cause of the collapse is under investigation.",
    "pic.twitter.com/3YfKgGCKBf\n— Allegheny Co. Exec.",
    "Some residents were evacuated from their homes.",
    "Residents are advised to avoid the area.",
    "ABC News contributed to this report.",
    "Pennsylvania Lt. Gov."
  ]
}