{
  "id": 3112,
  "mediaId": 8436,
  "date": "2022-02-01",
  "headline": "Millions follows rich candidates in Pennsylvania Senate race",
  "image": "https://www.thereporteronline.com/wp-content/uploads/2022/02/1ac32d3ebe19e156ee096195bf53f4f3.jpg?w=1024&h=731",
  "link": "https://www.thereporteronline.com/2022/02/01/millions-follows-rich-candidates-in-pennsylvania-senate-race/",
  "mediaOutlet": "Souderton Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.thereporteronline.com/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "By MARC LEVY\nHARRISBURG, Pa. (AP) — Cash is pouring in to Pennsylvania’s hotly contested race for U.S. Senate, as wealthy and well-connected candidates moved in from out of state, followed by millions of dollars going into TV ads and super PACs.",
    "That included $5 million from conservative billionaire donor Ken Griffin of Chicago-based Citadel LLC, a multinational hedge fund and financial services company that handles an estimated 25% of all U.S. stock trading.",
    "Filings posted online by the Federal Election Commission before Monday night’s deadline showed Mehmet Oz — best-known as daytime TV’s host of “the Dr. Oz Show” — loaned himself $5.2 million.",
    "Fetterman raised $2.7 million in the last three months of 2021, but spent more than half of it, while Lamb raised $1.3 million and spent a little less than half, according to the filings.",
    "John Fetterman kept a strong cash advantage — $5.3 million to $3 million — over his nearest rival, Conor Lamb, a third-term congressman from suburban Pittsburgh.",
    "Meanwhile, a super PAC supporting a Republican rival of Oz’s, former hedge fund CEO David McCormick, raised more than $5 million from the world of finance.",
    "Three other rivals in each party’s primary each raised in the six-figures in the last quarter of 2021.",
    "Follow Marc Levy on Twitter at https://www.twitter.com/timelywriter",
    "In the Democratic primary race, Lt. Gov.",
    "The primary election is May 17.",
    "He spent nearly all of it."
  ]
}