{
  "id": 3320,
  "mediaId": 8403,
  "date": "2022-01-27",
  "headline": "OPINION: How Progressives Should Rate Senate Hopefuls",
  "image": "http://www.phillyrecord.com/wp-content/themes/TranscriptEdited1/inc/admin//images/favicon.ico",
  "link": "http://www.phillyrecord.com/2022/01/opinion-how-progressives-should-rate-senate-hopefuls/",
  "mediaOutlet": "phillyrecord.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "editor @pr",
  "authorUrl": "http://www.phillyrecord.com/author/jim/",
  "termIds": [
    0
  ],
  "sentences": [
    "We need to be campaigning on our ideals and values — and in ways I’m going to explain soon, our identity — not on arcane policy disputes that 5% of electorate pays attention to and 2% of the electorate truly understands (and most of the people who take single-payer as a litmus test don’t understand health-care economics).",
    "And I’m also not going to make fine distinctions based on their stands on the “issues.” I have come around to supporting single-payer but taking, that or most other issues, that as a litmus test for a candidate seems ridiculous to me.",
    "I’m not eager to see our candidate talk incessantly in public about the details of their “plans.” (If they must, they should put them on their website and let the few folks who really care debate them where no one can see.).",
    "Doing the slogging work of legislating by introducing new ideas, building support in a legislature, working with advocacy groups (see 4) and creating the compromises without which nothing gets done is really hard.",
    "A lot of politicians have, sadly, no clue how important advocacy groups are to legislating or how to work with them and help them build power to do the necessary work by, for example, doing events with them.",
    "I want a candidate who has shown he can understand how to adjust to and take advantage of the times we live in to deal with the critical problems in front of us while pushing our progressive agenda.",
    "Malcolm Kenyatta has been a great progressive representative and a strong supporter of We The People – PA. Val Arkoosh is a progressive friend who I worked closely with on the HCAN campaign.",
    "Focusing on recipes like single-payer or arcane details of tax policy is a guarantee that you will not connect with voters and that some voters will be scared by your position.",
    "John Fetterman has supported our work in Harrisburg — although I wish he would show he understood why his episode of vigilante justice is so troubling to many of us.",
    "These are my criteria for deciding who I’m going to vote for, not where they stand on detailed policy issues that may not even come up during their term in office.",
    "There is actually little electoral incentive for most politicians to lead on anything except doing constituent service or bringing money to their district.",
    "The key to figuring that out is to see how their campaigns develop over the next month or so and which one finds their way to connecting to the electorate.",
    "I don’t care if a candidate worked with an organization that is not generally progressive if he did progressive work with them.",
    "In addition, where candidates stand on the issues has very little to do with what issues they push forward in office.",
    "One thing I’m not going to encourage is making fine distinctions between candidates based on irrelevant information.",
    "There are not that many legislators in any legislative body who really want to do that work or know how to do it.",
    "Half of what legislators vote on is issues that no one knew would be important during the election.",
    "Whether our politicians know how to work with advocacy groups to build support for new initiatives.",
    "But he’s been voting down the line on Biden’s agenda and has been working with our 99% campaign.",
    "I’m utterly and totally uninterested in who go there first in embracing some policy proposal.",
    "Part of the art of being a politician is knowing how far you can go and still win elections.",
    "I don’t care if a candidate’s views evolved as the district he seeks to represent changes.",
    "BY MARC STIER\nI have professional reasons for not endorsing anyone in the Senate primary.",
    "The only one I haven’t met is Conor Lamb and I know some people think he too moderate.",
    "The most important thing is to choose a candidate who can win the general election.",
    "Here is what does determine what issues are advanced when candidates are in office.",
    "So I want to know whether our candidate is generally supportive of our ideals.",
    "For one thing, what counts in campaigns is the brownie, not the recipe.",
    "Whether our politicians care about something enough to actually lead.",
    "Marc Stier is director of the Pennsylvania Budget & Policy Center.",
    "Whether we have a majority and if so how big our majority is.",
    "(I’m tempted to stop here because this is 50% of politics.)",
    "Whether we have a majority of progressives.",
    "But I’d have a hard time doing so anyway.",
    "So I want a candidate who can win.",
    "(First one to single-payer wins?",
    "And they could all fail, too.",
    "I think they call can.",
    "He is a Philadelphian.",
    "Comment <div></div>",
    "No thanks.)",
    "The times.",
    "3.",
    "4.",
    "5.",
    "2.",
    "1."
  ]
}