{
  "id": 3397,
  "mediaId": 8399,
  "date": "2022-01-28",
  "headline": "Frick Park Bridge collapse results in calls for action to prevent future \"disasters\"",
  "image": "https://media2.fdncms.com/pittsburgh/imager/u/slideshow/21010841/pittsburgh-bridge-collapse-bus-teaser.jpg",
  "link": "https://www.pghcitypaper.com/pittsburgh/frick-park-bridge-collapse-results-in-calls-for-action-to-prevent-future-disasters/Content?oid=21010092",
  "mediaOutlet": "pghcitypaper.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Waltz",
  "authorUrl": "https://www.pghcitypaper.com/author/amanda-waltz",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s time to rebuild this nation.”\nHowever, Doyle points out that the “backlog in infrastructure maintenance in our country is so immense that the Infrastructure Investment and Jobs Act, while a historic increase in infrastructure spending, was really just a first step,” adding that he will “continue to support increased federal investment in our nation’s infrastructure.”\nThe cause of the collapse is under investigation and Frick Park is closed to pedestrians and vehicles as crews continue their work.UPDATE: This story has been updated at 8 p.m. on Fri., Jan. 28 with Gov.",
    "“This declaration allows us to support the county in getting to work quickly, making funding available, and reducing red tape or other barriers to completion.”\nWolf's proclamation \"authorizes state agencies to use all available resources and personnel, as necessary\" for the situation, and includes a total of $3,000,000 in unused appropriated funds, \"to be increased or decreased as conditions required,\" for expenses related to the emergency.",
    "In an official statement, U.S. Representative Mike Doyle (D-PA-18) said it was “a miracle” that no one was killed in the bridge collapse before calling the incident “a major challenge for our community.”\n“It will disrupt transportation in Pittsburgh for months to come, if not longer,” says Doyle, adding, “This is a tragic example of why the Infrastructure Investment and Jobs Act that Congress just enacted is so desperately needed.",
    "“The idea that we’ve been so far behind on infrastructure for so many years, it’s mindboggling,\" the president said.https://t.co/8axjobrJhU pic.twitter.com/ekODCsFwQS\n— AP Politics (@AP_Politics) January 28, 2022\n“The idea that we’ve been so far behind on infrastructure for so many years, it’s mindboggling,\" said Biden at the scene, according to the Associated Press.",
    "We should be consistently investing more in our infrastructure so our bridges and other public works don’t reach this point of disrepair.”\nPittsburgh City Controller Michael Lamb said in a statement that Allegheny County \"has more structurally deficient bridges than any other county in the nation.\"",
    "I wish all of those who were injured a safe and swift recovery.”\nHe also called the collapse “just the latest in a long line of preventable, man-made disasters that prove what so many of us in Pennsylvania and around the country have been saying for years: Our infrastructure is failing our people.",
    "In November 2021, Biden signed into law a $1 trillion bipartisan infrastructure bill, described in a White House press release as being meant to “rebuild America’s roads, bridges, and rails, “along with expanding internet access, addressing climate change, and other issues.\"",
    "“I am thankful for the quick response and dedication of the Pittsburgh Public Safety Department, and for the cooperation and assistance of the county, state, and federal governments,” said Pittsburgh Mayor Ed Gainey, who visited the scene earlier today.",
    "\"The collapse of the Frick Park Bridge this morning is a reminder that investments in infrastructure are investments in public safety,\" says Lamb, adding, \"If we do not act, events like this will, unfortunately, continue to happen.\"",
    "pic.twitter.com/0VEE0osGJd\n— John Fetterman (@JohnFetterman) January 28, 2022\nFetterman says the new infrastructure bill will give Pennsylvania $1.6 billion to repair bridges like the one at Forbes and South Braddock.",
    "In the immediate aftermath of the collapse, various representatives have pointed to the incident as an example of Pittsburgh’s crumbling infrastructure and the failure of state and local government to maintain it.",
    "“With the Fern Hollow Bridge seeing more than 14,000 cars daily, it’s critical that we act quickly to reconstruct it so that commerce can continue and life is not interrupted,” says Wolf in the statement.",
    "In an ironic twist, the collapse happened on the day U.S. President Joe Biden was scheduled to arrive at the research and development hub, Mill 19, in Hazelwood to give a talk on infrastructure.",
    "Later, while at Mill 19, Biden began his speech by telling onlookers there are 45,000 bridges in the country that are in poor condition, and Pittsburgh's collapsed bridge was one of them.",
    "Our roads and bridges, which are supposed to connect us and bring us together, are increasingly putting us in danger.”\nBeen at the scene of the bridge collapse since earlier this morning.",
    "According to a statement from the city, the bridge, located near Forbes Avenue and South Braddock Avenue, collapsed around 6 a.m., taking with it five vehicles and one Port Authority bus.",
    "On Friday evening, Pennsylvania Governor Tom Wolf officially declared it a disaster, signing a proclamation of disaster emergency for Allegheny County in response to the bridge collapse.",
    "“This bridge—one I’ve driven across thousands of times—is a vital infrastructure artery connecting the East End to Downtown Pittsburgh,” says Fetterman in a statement.",
    "Allegheny County Executive Rich Fitzgerald has been told it will be at least a year before the bridge will be replaced, according to the Pittsburgh Post-Gazette.",
    "The stuff of Pittsburgh nightmares came true this morning when the City of Bridges saw the collapse of the Frick Park Bridge, aka the Fern Hollow Bridge.",
    "We need to make use of the legislation President Biden ushered in, rebuild our roads and bridges, and fix our faulty infrastructure.",
    "President Joe Biden stopped at the scene of the bridge collapse in Pittsburgh and peered over a barrier to examine the damage.",
    "The statement goes on to say that 10 people were evaluated and treated for minor injuries, including some first responders.",
    "Additionally, the collapse ruptured gas lines that ran along the bridge, causing a large gas leak.",
    "Crews quickly shut the gas off and several families near the site were evacuated as a precaution.",
    "Thank God that school buses were delayed due to weather, so there was less traffic than normal.",
    "So thankful to the first responders + to hear from them that there are no reported fatalities.",
    "Governor John Fetterman visited the scene of the collapse and spoke to it on a personal level.",
    "In Pittsburgh, in Pennsylvania, and across America, we cannot afford neglect any longer.",
    "Three people were taken to local hospitals with non-life-threatening injuries.",
    "Biden visited the site of the bridge collapse before his stop in Hazelwood.",
    "Wolf's disaster of emergency order and a comment from Rich Fitzgerald.",
    "Thank God there have been no casualties reported at this point.",
    "“It’s surreal this morning to see it completely collapsed.",
    "“Now more than ever, we need to get to work.",
    "The area has since been cleared.",
    "Pennsylvania Lt."
  ]
}