{
  "id": 3416,
  "mediaId": 8481,
  "date": "2022-01-29",
  "headline": "Pennsylvania Democrats deadlock on endorsing in Senate race",
  "image": "https://www.wearecentralpa.com/wp-content/uploads/sites/69/2022/01/AP22027714906165.jpg?w=1280",
  "link": "https://www.wearecentralpa.com/news/regional-news/pennsylvania-democrats-deadlock-on-endorsing-in-senate-race/",
  "mediaOutlet": "wearecentralpa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "https://www.wearecentralpa.com/author/the-associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "Lamb had called each committee member multiple times, his campaign said, and sent them mail pieces, including one that crowed that he “beat the Trump machine three times.”\nThe wide-open race for the battleground-state seat being vacated by two-term Republican Sen. Pat Toomey of Pennsylvania is expected to be one of the nation’s premier Senate contests this year.",
    "HARRISBURG, Pa. (AP) — Pennsylvania’s Democratic Party committee members deadlocked Saturday in suburban Harrisburg on a vote to endorse in the party’s hotly contested primary race for U.S. Senate, giving Conor Lamb by far the most votes, but not enough for the party’s backing.",
    "In his speech to the hotel ballroom of mask-wearing committee members, Lamb told them that his endorsement would “put fear into the hearts” of Republicans because of his experience winning three congressional races on politically dicey turf for Democrats.",
    "The Democratic field features John Fetterman, the state’s lieutenant governor, plus Montgomery County Commissioner Val Arkoosh and state Rep. Malcolm Kenyatta of Philadelphia.",
    "Lamb, a third-term congressman from suburban Pittsburgh, came closest, with 60%, after working for months to win over committee members.",
    "The Republican field is notable for three wealthy and well-connected candidates moving from blue states to run in Pennsylvania.",
    "Winning an endorsement was a high hurdle to clear, two-thirds of the party’s roughly 350 committee members.",
    "The primary election is May 17."
  ]
}