{
  "id": 3430,
  "mediaId": 2735,
  "date": "2022-01-28",
  "headline": "Pittsburgh Bridge Collapses the Same Day as Biden Infrastructure Talk in City",
  "image": "https://truthout.org/wp-content/uploads/2022/01/2022_0128-pennsylvania-bridge-collapse-1200x675.jpg",
  "link": "https://truthout.org/articles/pittsburgh-bridge-collapses-the-same-day-as-biden-infrastructure-talk-in-city/",
  "mediaOutlet": "Truthout",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Walker",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“The President will proceed with [the] trip planned for today and will stay in touch with officials on the ground about additional assistance we can provide.”\nGiven the incident’s direct relation to infrastructure issues that Biden had already planned to discuss during his visit to the city, there’s a high likelihood that he will mention the bridge’s collapse during his speech on Friday.",
    "On Friday, the same day that President Joe Biden planned to deliver a speech in Pittsburgh, Pennsylvania, on improving the nation’s infrastructure, a two-lane bridge in the city collapsed, resulting in at least ten injuries.",
    "According to 2021 data from the National Bridge Inventory, 43,000 bridges in the country are in the similar condition to the Forbes Avenue bridge in Pittsburgh prior to its collapse.",
    "A statement from White House Press Secretary Jen Psaki said that Biden would still be delivering remarks at Carnegie Mellon University in Pittsburgh later on Friday.",
    "No fatalities have been reported so far, though first responders are now searching below the bridge to see if anyone was underneath the structure when it fell.",
    "The collapse, which occurred just before 7:00 am local time, happened on Forbes Avenue, which officials describe as an important thoroughway for the city.",
    "Funding for the program will come from the $1.2 trillion infrastructure bill that Congress passed last year, which Biden signed into law in November.",
    "State officials said that the bridge’s collapse should serve as a reminder that infrastructure across the country urgently needs upgrading.",
    "“[Biden] is grateful to the first responders who rushed to assist the drivers who were on the bridge at the time,” Psaki said in a tweet.",
    "Around 14,500 vehicles drive across the bridge per day, though traffic was somewhat lessened on Friday due to school weather delays.",
    "Just two weeks ago, Biden announced a new program aimed at repairing and replacing U.S. bridges that are in poor condition.",
    "The bridge, which was built in 1970, was last inspected in September, though that report has not yet been made available.",
    "Ten individuals suffered minor injuries, with three others requiring hospitalization for non-life-threatening injuries.",
    "“I hope it’s a wake-up call to the nation that we need to make these infrastructure investments,” Lt. Gov.",
    "A 2019 report on the bridge noted that its deck and superstructure were in poor condition.",
    "No major updates to the bridge were made between that inspection and when it collapsed.",
    "Don’t miss a beat\nGet the latest news and thought-provoking analysis from Truthout.",
    "The White House has been in touch with local authorities regarding the incident.",
    "The bus had one passenger and the driver on board when the incident occurred.",
    "A two-part, elongated bus was on the bridge when it collapsed.",
    "John Fetterman (D-Pennsylvania) said."
  ]
}