{
  "id": 3445,
  "mediaId": 2732,
  "date": "2022-01-28",
  "headline": "Biden touts infrastructure importance in Pittsburgh visit after bridge collapse",
  "image": "",
  "link": "https://triblive.com/local/biden-touts-infrastructure-importance-in-pittsburgh-visit-after-bridge-collapse/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Deto",
  "authorUrl": "https://triblive.com/author/ryan-deto/",
  "termIds": [
    4905,
    5510,
    1433,
    5933,
    6506,
    5975,
    6520
  ],
  "sentences": [
    "… That’s how we are going to build another America.”\nIn front of a crowd consisting of a few dozen invited guests, including several local Democratic politicians and labor union representatives, Biden touted the $857 million that will be used to rebuild the Montgomery Locks and Dam on the Ohio River in Beaver County, and how that fix will help maintain the flow of supplies to and from Pittsburgh and the region.",
    "In front of a crowd of invited guests and media at Carnegie Mellon University’s Mill 19 research and development center in Hazelwood, Biden praised the $1.2 trillion infrastructure bill passed late last year and the work being done in Pittsburgh in advanced manufacturing and robotics.",
    "• Biden visits site of Pittsburgh bridge collapse\n• 10 injured in bridge collapse in Pittsburgh’s Frick Park\nSeveral local politicians attended the speech, and Pittsburgh Mayor Ed Gainey and Allegheny County Rich Fitzgerald provided opening comments for the president.",
    "After speaking of the infrastructure bill and efforts to fix the supply chain, he advocated for the Build Back Better bill, a trillion-dollar plan to address issues like climate change, child care, paid leave and universal Pre-K schooling.",
    "In addition to addressing infrastructure needs, Biden also toured Mill 19 facilities that include robotics and advanced manufacturing equipment, including a 3-D printer that creates aerospace parts on its own in about one day.",
    "With foundations literally crumbling in Pittsburgh on Friday after a bridge in Frick Park collapsed, President Biden visited the city to tout the importance of infrastructure funding recently allocated by Congress.",
    "He also touted the recent announcements of a semiconductor plant in Ohio that he said is emblematic of his economic agenda of bringing back manufacturing employment to American soil.",
    "He also addressed the bridge later during his speech and said there were thousands of more bridges across Pennsylvania that are “just as old and decrepit” as the bridge that fell.",
    "Kyrsten Sinema of Arizona and Joe Manchin of West Virginia raising objections to its price tag and showing a reluctance to bypass the filibuster in attempting to pass it.",
    "“Can you imagine looking at your child, and knowing what they need, and not being able to do it?” said Biden in a reference to money in Build Back Better for child care.",
    "He said that the United States actually saw an increase in manufacturing jobs over the past year, and the largest increase in manufacturing employment in 30 years.",
    "“We move about half a trillion (dollars worth) of goods through those locks, and when they are not working, it creates choke points,” said Biden.",
    "Pennsylvania is home to thousands of these abandoned wells, which are known to leak methane, a powerful greenhouse gas, into the atmosphere.",
    "Biden even became emphatic and raised his voice during the speech when talking about the necessity of this bill to help working families.",
    "It was reported earlier that Fetterman wasn’t going to attend, but he was on site at the bridge collapse and showed up at the event.",
    "In an attempt to rebuke those polls, Biden spoke of the most recent economic figures, claiming that his presidency is working well.",
    "“And they are stamped ‘made in America.’”\nBiden wrapped up his speech with another plea for his Build Back Better plan.",
    "According to PennDOT, the bridge was rated in poor condition — one of dozens in Allegheny County with that distinction.",
    "Biden’s visit to Pittsburgh came just hours after a bridge carrying Forbes Avenue in Pittsburgh’s Frick Park collapsed.",
    "John Fetterman — Democratic opponents in the primary race for U.S. Senate — sat next to each other in the front row.",
    "“Right here in Pittsburgh, the future is being built on the foundation of this city’s storied past,” said Biden.",
    "According to a recent Pew poll, 41% of Americans approve of the job Biden has done, down from 44% in September.",
    "“It’s about time to stop fighting and it’s about time we start working together again,” Biden said.",
    "He said the infrastructure bill allocates at least $1.6 billion for bridges in Pennsylvania alone.",
    "He spoke about how during his one year in office, there have been 6.1 million jobs created.",
    "Pittsburgh officials said 10 people were injured, but no one suffered serious injuries.",
    "The Pittsburgh visit comes as Biden’s approval rating is at a low point for his term.",
    "Biden also spoke about his plan to plug abandoned gas wells throughout the country.",
    "A Port Authority bus and multiple private vehicles were on it during the collapse.",
    "“Now it is time to create good-paying union jobs, capping those wells,” he said.",
    "Biden visited the bridge for about 10 minutes before traveling to Hazelwood.",
    "“We are going to fix them all,” he said while at the collapsed bridge site.",
    "Pittsburgh officials said they are investigating the cause of the collapse.",
    "“The key is these jobs are manufacturing essential products,” said Biden.",
    "Negotiations have stalled again for the plan, with Democratic U.S. Sens.",
    "Biden’s speech was a repeat of many of his plans and campaign promises.",
    "He said he never realized just how many bridges existed in the city.",
    "“We don’t need headlines that someone was killed,” Biden said.",
    "Both thanked Biden for visiting the collapsed bridge site.",
    "“We are gonna rebuild that bridge and every other bridge.",
    "Biden hinted he is ready to start negotiating again.",
    "U.S. Rep. Conor Lamb and Lt. Gov."
  ]
}