{
  "id": 3512,
  "mediaId": 6571,
  "date": "2022-01-28",
  "headline": "At Site Of Pittsburgh Bridge Collapse, President Joe Biden Promises To 'Fix Them All'",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/01/28/0e95dcc1-fc5a-46a5-ae5a-66f21db827a1/thumbnail/1200x630/f424cc112073fcf626d2a87afc63096e/biden-gainey-bridge-1238042993-1.png",
  "link": "https://www.cbsnews.com/pittsburgh/news/president-joe-biden-visit-pittsburgh-bridge-collapse-frick-park/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"All of these investments in American research, development and infrastructure are really about one thing: empowering more cities and more towns to do what you're doing right here in Pittsburgh, transforming yourself from being told you're a city without a future to becoming a city of the future,\" he said.",
    "\"What you all know, if you don't you should know, there are another 3,300 bridges here in Pennsylvania, some of which are just as old and just as decrepit condition as that bridge was, including here in Pittsburgh, the city of bridges,\" President Biden said.",
    "By: KDKA-TV News Staff\nPITTSBURGH (KDKA) - Looking across the snow-covered chasm where the Fern Hollow Bridge once stood in Pittsburgh's Hazelwood neighborhood, President Joe Biden touted the $1.2 trillion bipartisan infrastructure law.",
    "The speakers began shortly after 3 p.m. Wolf, Gainey, Fitzgerald and Casey spoke before the president, highlighting the infrastructure bill needed not just to repair bridges like the Fern Hollow bridge, but to also create jobs.",
    "Biden highlighted the infrastructure law's $1.6 billion for Pennsylvania's bridges over the next five years, saying the money will fund repairs on the collapsed bridge, which affects a major thoroughfare for residents.",
    "Photographer: Justin Merriman/Bloomberg via Getty Images\nHe pivoted to other infrastructure like the $857 million investment in the Montgomery Lock and Dam, which he says moves tons of goods up and down our rivers.",
    "Hours before the president left for Pittsburgh, the Fern Hollow Bridge on Forbes Avenue over Frick Park collapsed into a ravine, stranding vehicles and injuring 10 people, sending four to the hospital.",
    "A major bridge in Pittsburgh has collapsed this morning, hours before President Joe Biden is scheduled to visit the city to tout his signature bipartisan infrastructure law.",
    "Air Force One touched down shortly before 1 p.m. for Biden's previously scheduled visit, which was thrown off course after the bridge in Frick Park collapsed hours earlier.",
    "But I didn't realize there were more bridges in Pittsburgh than any other city in the world,\" Biden said as he stood at the edge, promising to \"fix them all.\"",
    "(Photo Credit: Saul Loeb/AFP via Getty Images)\nThe president was previously scheduled to visit Mill 19 in Hazelwood to promote the infrastructure law.",
    "John Fetterman, Allegheny County Executive Rich Fitzgerald, Congressman Conor Lamb and Mayor Ed Gainey -- as he walked to the edge of the chasm.",
    "Biden also talked about revitalizing manufacturing, creating union jobs and strengthening the nation's supply chains, lauding job growth.",
    "Many residents say they travel on it every day and say they've heard clanks but never thought a situation of this magnitude could happen.",
    "He said there's been a rise in manufacturing jobs, some of which include investments by companies to start building more electric cards.",
    "It's a fact,\" he said, pointing to how Pittsburgh has transformed itself from a city of steel manufacturing to a technology hub.",
    "(Photo Credit: KDKA)\nBiden arrived at the site of the collapse around 1:15, led by a Pittsburgh and state police motorcade.",
    "\"Next time, we don't need headlines saying someone was killed in a bridge collapse,\" Biden said when he took the podium.",
    "WATCH: President Joe Biden's full speech\nBiden didn't say what resources would be available for this bridge replacement.",
    "A collapsed bridge along Forbes Avenue near Frick Park in Pittsburgh, Pennsylvania, U.S., on Friday, Jan. 28, 2022.",
    "The deck and superstructure were also given a poor rating while the substructure condition was satisfactory.",
    "Fitzgerald told Biden it was Gainey's first month on the job, and Biden called the collapse a \"christening.\"",
    "Information from PennDOT's site on bridge conditions listed the bridge as in an overall poor condition.",
    "He also praised Pittsburgh leaders, saying in 15 years, Pittsburgh is \"going to lead the world again.\"",
    "Despite $1.6 billion for Pennsylvania's bridges, that comes down to only about $500k per bridge.",
    "PennDOT said while the city owns the bridge, it is still \"actively engaged\" in the response.",
    "He also talked to first responders about what they saw when they got to the scene.",
    "\"I've been coming to Pittsburgh a long time, and as a former Pennsylvanian.",
    "He vowed to rebuild the bridge and thousands of others across the country.",
    "He said we must maintain our infrastructure in order to move these goods.",
    "He also pushed for his Build Back Better plan during his remarks.",
    "The cause of the bridge collapse is still under investigation.",
    "In:\nPittsburgh Bridge Collapse\nBridge Collapse\ninfrastructure",
    "He was joined by leaders -- including Sen. Bob Casey, Gov.",
    "We will have to see what comes out in the upcoming days.",
    "Fitzgerald called the bridge a \"major artery.\"",
    "\"It's not hyperbole.",
    "Tom Wolf, Lt. Gov."
  ]
}