{
  "id": 405,
  "mediaId": 6526,
  "date": "2022-02-21",
  "headline": "Your View by state Rep. Mike Schlossberg: Our fates are bound together. Let’s govern like it",
  "image": "https://www.mcall.com/resizer/akPIStCvy8Wsw2e-1pjFTLjYuPg=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/YSLUCRREK7ZMOXVYINSQRR4BAA.jpg",
  "link": "https://www.mcall.com/opinion/mc-opi-pennsyvania-budget-health-care-education-schlossberg-20220221-dbkpu7dyofcpringgqimel4hau-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Schlossberg",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Again, let’s put aside the idea that we have a moral obligation to care for those who need help at the darkest moments of their life — even if they don’t have the resources that many of us have been blessed with.",
    "It would provide for a massive investment in our schools, a huge funding boost to special education and additional dollars from the Level Up program that could be used to fund our poorest school districts.",
    "I wish we operated with more of that perspective in government, and I think this budget is an important step in investing in all of us: Those who have the least, and those who have the most.",
    "I’ve spoken to constituents of mine who have no shortage of resources, who have the most effective health care insurance money can buy … and they still can’t get the care they need.",
    "From our investments in health care, job creation centers, early childhood education and more — this budget recognizes a fundamental truth: We all have an obligation to each other.",
    "Our hospitals have been begging us to do whatever we can to take care of ourselves and avoid getting sick: We must try to maintain our limited health care resources.",
    "We’re lucky in the Lehigh Valley: We have two world-class health care systems that take care of our families and will answer the call if we get sick.",
    "I can never get over the sheer number who gleefully spread misinformation that resulted in people sickened or dead from this disease.",
    "This includes medical staff, first responders and retail workers who kept our society moving and ensured we were fed and cared for.",
    "If we invest in our mental health system, it’s not just good for those who don’t have the same resources that you or I may have.",
    "Hospitals crowded with COVID patients — patients who are mostly unvaccinated — means fewer medical resources available for you.",
    "It gives more money to the counties, allowing them to better treat behavioral health and substance abuse disorders.",
    "On the other hand, you have countless people who were negatively impacted by the irresponsibility of others.",
    "What we do to the least fortunate in our Lehigh Valley community can easily impact the luckiest among us.",
    "On one hand, you have the heroes of this pandemic, who never thought they would be in this position.",
    "This enables them to hire more staff and better pay those who are already working for them.",
    "We all need each other to be successful because your success will positively impact mine.",
    "Unfortunately, even if you are boosted, your health is at risk by the actions of others.",
    "It increases funding for mental health practitioners and gives more money to hospitals.",
    "If you don’t have kids in the school system, you’re in luck: This budget will help you.",
    "If the budget is approved as is, property tax growth will slow or stop for the year.",
    "The behavior and actions of one person can affect the lives of countless others.",
    "Our moral obligation to educate every Pennsylvania child is even more apparent.",
    "More state funding for education means less pressure on property taxes.",
    "I mention this to make a broader point: All of us are bound together.",
    "The governor’s budget makes massive investments in behavioral health.",
    "If COVID-19 taught us anything, it’s that none of us is an island.",
    "The financial benefits of providing for our schools are clear.",
    "Crowded emergency rooms means more exhausted medical staff.",
    "Want paramedics who are well trained to answer your call?",
    "This will unquestionably hurt your ability to get help.",
    "First, from a purely financial perspective, good news.",
    "Every one of us has a stake in the educational system.",
    "Want good doctors to care for you in your old age?",
    "My actions affect you, and your actions affect me.",
    "And this frees up more help for those who need it.",
    "Want teachers to educate your kids or grandkids?",
    "That brings us to this year’s proposed budget.",
    "But even those systems have limits.",
    "And it’s time we govern like it.",
    "We create more capacity.",
    "It’s good for us all.",
    "What does that mean?",
    "More staff.",
    "More beds."
  ]
}