{
  "id": 4624,
  "mediaId": 8254,
  "date": "2022-04-21",
  "headline": "Who do you think won the Pennsylvania Democratic U.S. Senate primary debate?",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/04/debateheader.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/who-do-you-think-won-the-pennsylvania-democratic-u-s-senate-primary-debate/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    0
  ],
  "sentences": [
    "The one hour debates will air on eight television stations serving the state: WHTM-TV (ABC) in Harrisburg/Lancaster, Lebanon, York, WPXI-TV (NBC) in Pittsburgh, WPHL-TV (MyNetworkTV) in Philadelphia, WTAJ-TV (CBS) in Johnstown/Altoona/State College, WBRE-TV (NBC) and WYOU-TV (CBS) in Scranton/Wilkes-Barre/Hazleton, WJET-TV (ABC) and WFXP-TV (FOX) in Erie, and WYTV-TV (ABC) in Youngstown, OH.",
    "In addition, the debates will be live-streamed on WETM-TV (NBC) in Elmira, NY, WPIX-TV (CW) in New York, NY, WIVB-TV (CBS) in Buffalo, NY, and WDVM-TV (IND) in Washington, D.C.\nAdditionally, all radio stations throughout the commonwealth will be provided free access regardless of their market.",
    "Five Republican candidates for Senate will debate for one hour on Monday, April 25 at 8 p.m. and will both air and live-stream in 10 markets across Pennsylvania, New York, Ohio, and Maryland\nAll candidates on the ballot who meet eligibility criteria will be invited to participate.",
    "An exclusive debate has also been announced between the Republican Party candidates for Governor of Pennsylvania on Wednesday, April 27 at 8 p.m.\nAll candidates on the ballot who meet eligibility criteria will be invited to participate.",
    "Let us know who you thought won the hourlong U.S. Senate Democratic debate that was broadcast and live-streamed by Nexstar stations across the Commonwealth of Pennsylvania.",
    "Candidates who have committed to attend include Kathy Barnette, Jeff Bartos, Dave McCormick, Mehmet Oz, and Carla Sands.",
    "Candidates who have committed to attend include: Lou Barletta, Doug Mastriano, Bill McSwain, and Dave White.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "Governor John Fetterman, State Representative Malcolm Kenyatta, and Congressman Conor Lamb.",
    "Senator from Pennsylvania just debated in Harrisburg, and now we want to hear from you.",
    "The Pennsylvania primary election is scheduled to take place on May 17.",
    "(WHTM) – Three Democrat hopefuls to be the next U.S.",
    "John Fetterman, Malcolm Kenyatta, or Conor Lamb?",
    "The candidates who participated were Lt.",
    "Voters must register to vote by May 2.",
    "Who do you think won?",
    "Sign up here."
  ]
}