{
  "id": 4894,
  "mediaId": 2547,
  "date": "2022-04-22",
  "headline": "Is Donating To Candidates You Like 'Emotional Giving'?",
  "image": "https://crooksandliars.com/files/embeds/2022/04/50139.jpg",
  "link": "https://crooksandliars.com/2022/04/donating-candidates-you-emotional-giving",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve M.",
  "authorUrl": "https://crooksandliars.com/team/steve-m",
  "termIds": [
    1634,
    2668,
    2441,
    3049,
    3115,
    4152,
    4355,
    6026,
    6396
  ],
  "sentences": [
    "Other Republican challengers raised large sums as well: John Cummings raised $11.2 million against New York Rep. Alexandria Ocasio-Cortez, Joe Collins raised $10.6 million against California Rep. Maxine Waters, Kim Klacik raised $8.3 million against Maryland Rep. Kweisi Mfume, Eric Early raised $4.1 million against California Rep. Adam Schiff and Laura Loomer raised $2.3 million against Florida Rep. Lois Frankel.",
    "But actually, they are: In the Georgia Senate race, Raphael Warnock has raised more than twice as much as his near-certain GOP challenger, Herschel Walker; in Arizona's Senate race, Mark Kelly has raised more than all his potential Republican challengers combined; and in Pennsylvania, John Fetterman has raised more than twice as much as any of the Republicans he's likely to face if he wins the Democratic primary.",
    "Last year, FiveThirtyEight's Geoffrey Skelley wrote:\n... despite never having held elected office or run in a high-profile campaign, six Republican challengers raised at least $2 million in [2020] House races they then lost by anywhere from 20 to 45 points.",
    "I'm not seeing any sure GOP losers putting up numbers like this for 2022, although every dime of the $368,490 donated to Republican Tina Forte's inevitably futile campaign against Alexandria Ocasio-Cortez is money wasted, because AOC will win easily.",
    "Every election year in recent cycles, celebrity Democratic candidates have emerged — either on the strength of their personalities, the notoriety of their Republican opponents or both — to rake in campaign cash, then lose impossible elections.",
    "pic.twitter.com/8rpcM2erfz\n— Opal Katz (@DianthaSol) August 25, 2021\nWhen Democrats are accused of emotional giving to sure losers, the implication is that they're not giving to candidates who need the money and can win.",
    "And for Marcus Flowers, a cowboy-hat-wearing veteran in Georgia who raised $2.4 million just in the first three months of the year to try to dislodge Marjorie Taylor Greene from a heavily Republican district.",
    "Trump -- allegedly a billionaire -- has raised $124 million since November 2020, even though he's not running for anything this year and he gives very little money to candidates who are running.",
    "Now, he has captured the hearts and wallets of young liberals with a video for his improbable Senate campaign that shows him smoking a large joint and calling for the legalization of marijuana.",
    "If Democratic donations were lagging in these key races the way Republican donations are, that would be seen as further evidence that the party's donors aren't thinking straight.",
    "I think there are some shortfalls in fundraising by GOP candidates because all the emotional giving by Republicans is going to two people: Donald Trump and Ron DeSantis.",
    "In the run-up to 2022, GOP donors are allowing Senate challengers to be out-fundraised while giving massive amounts of money to two guys who want the same job in 2024.",
    "Jasmine Beach-Ferrara, a gay minister who has raised $1.4 million to oust Representative Madison Cawthorn, the far-right Republican, from his North Carolina seat.",
    "But as I noted in January when James Carville raised this complaint in a Vox interview, Republicans have done quite a bit of emotional giving in recent years.",
    "Raising mostly from individual donors, Republican challenger Lacy Johnson brought in the most, $12.2 million, running against Minnesota Rep. Ilhan Omar.",
    "In The New York Times, Jonathan Weisman gives us a familiar narrative: those silly emotional Democrats are doing their silly emotional giving again.",
    "Gary Chambers Jr. burst onto the national scene in 2020 with a viral video of him castigating the racism of the East Baton Rouge school district.",
    "DeSantis has raised more than $100 million, purportedly for his gubernatorial race, though he's obviously much more interested in the presidency.",
    "But Forte was part of the Stop the Steal rally on January 6, 2021, and is a trash-talking loudmouth, so the money rolls in.",
    "But Weisman doesn't acknowledge that maybe Democrats are making some smart decisions about their money.",
    "Some Democrats say such races are draining money from more winnable campaigns....\nWeisman's examples?",
    "He has almost no paths to victory over a sitting Republican senator in a red state like Louisiana.",
    "7\n[Above: Dan Pfeiffer and Paul Begala talk about Democratic campaign ads that work.",
    "17/#IamTinaForte Jan 6 on restricted ground as Capitol is attacked.",
    "None of these candidates are mentioned in Weisman's story.",
    "Republished with permission from No More Mister Nice Blog.",
    "):\"This is what happens when you storm the Capitol!\".",
    "TF:\"We came with Scott's flag and shit happened!\"",
    "Filmer:\"They break down the fuckn barriers.\"",
    "I agree that this isn't money well spent.",
    "The same most likely goes for the Rev.",
    "But he has raised $1.2 million.",
    "Commentary is not-work-safe.]",
    "Filmer (#IamJenRemauro?",
    "This is what happens!\"",
    "Maybe that's a story?",
    "TF:\"That's right!"
  ]
}