{
  "id": 4934,
  "mediaId": 2822,
  "date": "2022-04-22",
  "headline": "Election 2022: Biden blasts GOP over fight with Disney; Republicans gain momentum with anti-LGBTQ legislation",
  "image": "https://bloximages.chicago2.vip.townnews.com/tucson.com/content/tncms/assets/v3/editorial/5/b3/5b31f44a-636a-5b03-987f-43c4738febf9/6262d65912f2b.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize",
  "link": "https://tucson.com/news/national/election-2022-biden-blasts-gop-over-fight-with-disney-republicans-gain-momentum-with-anti-lgbtq/article_f86455d9-fc8f-5967-a66e-6b9fdfede15c.html",
  "mediaOutlet": "tucson.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "A roundup of today's Election 2022 headlines and analysis:\nTOP STORIES\nBiden takes swipe at GOP's assault on Disney: 'They're going after Mickey Mouse'\nPresident Joe Biden on Thursday criticized the Republican Party over its confrontation with Disney and suggested the \"far right has taken over the party.\"",
    "Asa Hutchinson\nChris Christie\nNikki Haley\nSen. Josh Hawley\nSen. Ted Cruz\nSen. Tom Cotton\nSen. Ben Sasse\nSen. Marco Rubio\nSen. Rick Scott\nSen. Tim Scott\nRep. Liz Cheney\nRep. Adam Kinzinger\nRep. Dan Crenshaw\nRep. Marjorie Taylor Greene\nRep. Elise Stefanik\nMike Pompeo\nDonald Trump Jr.",
    "The party, in an effort to galvanize its base, has seized on Disney over the corporation's opposition to legislation that prohibits schools from teaching young children about sexual orientation or gender identity.",
    "Full story here:\nRepublicans build momentum as they drive anti-LGBTQ legislation nationwide\nFormer President Donald Trump recently likened teaching kids about gender and pronouns to \"child abuse.\"",
    "They have passed measures banning school instruction about queer people, outlawing gender-affirming care for those under age 18 and barring transgender children from participating in youth sports.",
    "As they gear up for midterm elections, Republicans nationwide are intently focused on passing new restrictions on the LGBTQ community and, in particular, transgender kids.",
    "\"This is not your father's Republican Party,\" Biden said at one point on Thursday, later adding: \"It's not even conservative in a traditional sense of conservatism.",
    "Full story here:\nMore stories on 2022:\nBATTLE FOR THE SENATE\n2024 LOOKAHEAD\n24 possible Republican presidential candidates in 2024\nDonald Trump\nMike Pence\nGov.",
    "It's the first time that Biden, who was speaking at a fundraiser in Oregon, has commented on the feud between Disney and Republicans.",
    "I mean, look at what's happening now in Florida: Christ, they're going after Mickey Mouse.\"",
    "Ron DeSantis has led an effort to curtail special privileges Disney enjoys in the state.",
    "Kristi Noem debuted an ad that brags, \"In South Dakota, only girls play girls' sports.\"",
    "Ron DeSantis accused his critics of supporting \"sexualizing kids in kindergarten.\"",
    "In retaliation, Florida Gov.",
    "It's mean, it's ugly.",
    "And South Dakota Gov.",
    "Ron DeSantis\nGov.",
    "Chris Sununu\nGov.",
    "Larry Hogan\nGov.",
    "Greg Abbott\nGov.",
    "Kristi Noem\nGov.",
    "Florida Gov."
  ]
}