{
  "id": 4978,
  "mediaId": 2630,
  "date": "2022-04-21",
  "headline": "Blowback against ending Covid border ban grows among Democrats in tight races",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220421-joe-biden-jm-1415-c08d29.jpg",
  "link": "https://www.nbcnews.com/politics/elections/blowback-biden-ending-covid-border-ban-grows-democrats-competitive-rac-rcna25437",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The Biden administration said this month it would end the restriction starting May 23, meaning those who had been turned away at the border since March 2020 will soon have their chance to enter the U.S.\nAt least a dozen Democrats in pivotal races have come out against the policy change since it was announced, saying that doing so would boost migration to the U.S., strain the system and pose national security risks.",
    "We always know right around summer there’s a surge.”\nWith her remarks, Masto joined a growing list of Senate Democrats, including Joe Manchin of West Virginia, Kyrsten Sinema of Arizona, Jon Tester of Montana, Maggie Hassan of New Hampshire, Raphael Warnock of Georgia and Mark Kelly of Arizona, who have broken with Biden over ending the immigration restriction.",
    "Beto O’Rourke, a former Democratic presidential candidate who will face off against Texas Republican Greg Abbott for governor this fall, also recently said he thinks the Biden administration should hold off until it has a more detailed plan in place to handle the expected increase in migrants that would be triggered by lifting Title 42.",
    "Kelly called the decision to end Title 42 without a mitigation plan \"wrong\" and \"unacceptable\" in a statement this month, warning that the “lack of a plan to deal with this crisis will further strain our border communities.”\nGet the Morning Rundown\nGet a head start on the morning's top stories.",
    "to ask Congress for more border funding\nApril 20, 202201:50\nThe Biden administration and its allies have said terminating the rule would simply mean a return to pre-pandemic law, and migrants would continue to be removed unless they are able to “establish a legal basis to remain” in the U.S.",
    "John Fetterman, a Democrat who is running for the Senate seat being vacated by Republican Pat Toomey, who is retiring, echoed the sentiment, saying, “We should not end title 42 until we have a detailed plan in place.”\nFetterman’s comments were first reported by Politico.",
    "A growing number of Democratic governors, senators and candidates facing tough races in the midterm elections are opposing the Biden administration's decision to end a public health rule that has blocked more than 1.7 million attempts to cross the U.S.-Mexico border.",
    "Title 42, a measure put in place at the start of the pandemic by the Trump administration, has let the U.S. turn away asylum-seekers under a decades-old public health law designed to stop the spread of a contagious disease.",
    "Still, the administration has faced internal fears that ending certain Trump-era rules, such as Title 42, could spur a record surge of migrants and asylum-seekers that Congress hasn’t allocated enough resources to handle.",
    "Sen. Catherine Cortez Masto, D-Nev., who also faces a tough battle this fall in her re-election effort, according to polls, recently told a local news station, \"I think it’s just wrong to do it without a detailed plan.",
    "Most Americans disapprove of Biden’s handling of immigration issues, according to recent polls, including one conducted by a firm affiliated with the president, commissioned by an immigrant rights group.",
    "Our country cannot undergo another humanitarian crisis at the U.S.-Mexico border,” wrote Sisolak, who would face a tight race from any of his Republican challengers, according to polling last week.",
    "A Morning Consult poll released last week showed that ending Title 42 is particularly unpopular, with 56 percent of registered voters and 52 percent of independent voters opposing the move.",
    "Steve Sisolak, a Democrat who is up for re-election this fall, wrote a letter to the White House asking Biden to “reconsider” his decision to terminate the rule.",
    "“Lifting Title 42 without a measured, comprehensive plan would create chaos at our border and make it more onerous for families attempting to immigrate legally.",
    "“We need to have a plan in place to make sure we’re keeping asylum-seekers and people in the U.S. safe before we lift Title 42,” Wisconsin Democratic Lt. Gov.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nSome Democratic challengers have also opposed the policy change.",
    "Mandela Barnes, who is running to unseat Republican Sen. Ron Johnson, told NBC News in a statement Thursday.",
    "“People at the border are telling us they don’t have the resources to do that right now.",
    "I want to see President Biden solve that before lifting Title 42.”\nPennsylvania Lt. Gov.",
    "Of those lawmakers, Hassan, Warnock and Kelly are also up for re-election this year.",
    "His remarks were a reversal of his previous calls to end the measure.",
    "On Wednesday, Nevada Gov.",
    "Biden admin."
  ]
}