{
  "id": 5056,
  "mediaId": 8393,
  "date": "2022-04-21",
  "headline": "Breaking down PA Democratic Senatorial debate",
  "image": "https://www.pahomepage.com/wp-content/uploads/sites/91/2022/04/democratic-senate-debate.png?w=1280",
  "link": "https://www.pahomepage.com/news/breaking-down-pa-democratic-senatorial-debate/",
  "mediaOutlet": "pahomepage.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Foreback",
  "authorUrl": "https://www.pahomepage.com/author/caroline-foreback/",
  "termIds": [
    0
  ],
  "sentences": [
    "Two things are true at the same time, why we continue to produce natural gas, we need to make a common-sense transition an honest transition to a green clean new economy and we can’t just turn our back on the workers and those communities and say ‘just learn how to code,” Fetterman explained.",
    "Both Lamb and Kenyatta put Fetterman on the defensive about an incident in 2013 when Fetterman, shotgun in hand, confronted a black man because he suspected the man was involved in gunfire nearby.",
    "Thursday night we learned a lot more about the disparities between democratic candidates when it comes to Pennsylvania’s most pressing issues such as gas prices, and natural gas drilling.",
    "“The bigger problem is, if we don’t actually increase production of oil itself, the price won’t go down whether you cut the taxes or not,” said U.S. Rep. Conor Lamb (d)/Pennsylvania.",
    "Representative Malcolm Kenyatta wants to do away with it entirely and said natural gas industries are not concerned with the health or well-being of workers.",
    "Pennsylvania’s U.S. Senate Democratic Debate began with one of the more pressing issues facing Pennsylvanians, gas prices and inflation.",
    "When it came to fracking, candidates differed on the industry’s job creation and low energy prices versus environmental concerns.",
    "“The congressman must have got a contact high down there in Washington because he used to be against this and now he’s for it.",
    "The reality is we do not need to do this slowly, we should have done it a long time ago,” Representative Kenyatta said.",
    "The main topics of the debate were economy, healthcare, crime, immigration, environment, and marijuana legalization.",
    "Fetterman says Pennsylvania should have an ‘extraction tax’ and supports a gradual transition to green energy.",
    "Lamb says he voted for a bill to decriminalize it but thinks that should be done in a slow, controlled way.",
    "Fetterman has made it clear that he supports the Federal Government in legalizing recreational marijuana.",
    "“Fracking is an important industry in pa because it allows us to be independent and also a lot of jobs.",
    "Three democratic candidates for the U.S Senate seat in Pennsylvania faced off in a statewide debate.",
    "Governor John Fetterman and Congressman Conor Lamb said we need to increase production in America.",
    "Fetterman previously supported a moratorium on fracking but has since changed his tune.",
    "HARRISBURG, DAUPHIN COUNTY (WBRE/WYOU) — It was a night of debate here in Pennsylvania.",
    "Pennsylvania is number 2 in the nation for natural gas production.",
    "Kenyatta disagrees with Lamb’s approach.",
    "Lieutenant."
  ]
}