{
  "id": 5114,
  "mediaId": 8469,
  "date": "2022-04-21",
  "headline": "Democrats meet for 1st live, prime-time Senate race debate",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2017/11/cropped-web1_22-TL-Logo.jpg.optimal.jpg",
  "link": "https://www.timesleader.com/wire/state-wire/1551911/democrats-meet-for-1st-live-prime-time-senate-race-debate",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3989,
    4080,
    2709,
    1489,
    515,
    6208,
    6512,
    6506,
    6744,
    6520
  ],
  "sentences": [
    "HARRISBURG, Pa. (AP) — Leading candidates for the Democratic nomination for Pennsylvania’s open U.S. Senate seat met Thursday night for their first live-televised prime-time debate in a race that is perhaps the party’s best opportunity to pick up a seat in the closely divided chamber.",
    "The debate began at 8 p.m., to be streamed online and televised by stations in Pennsylvania’s six media markets, as well as stations in Youngstown, Ohio, and Elmira and Buffalo, New York, New York City and Washington.",
    "John Fetterman, Pennsylvania’s lieutenant governor, state Rep. Malcolm Kenyatta of Philadelphia and U.S. Rep. Conor Lamb of suburban Pittsburgh appeared at the studio of WHTM-TV in Harrisburg for the one-hour debate.",
    "The primary race took a sharp turn three weeks ago as Lamb and Kenyatta began attacking Fetterman in earnest, and a super PAC supporting Lamb began running a TV ad statewide accusing Fetterman of being extreme.",
    "The three are jockeying for the nomination to try to succeed retiring two-term Republican Sen. Pat Toomey in the premier presidential battleground state.",
    "A Franklin & Marshall College poll in February found that Fetterman appeared to have an early lead in the primary, but many voters were undecided.",
    "Fetterman has told crowds he would only run a “positive” campaign.",
    "The May 17 primary election is less than four weeks away.",
    "Fetterman says the ad’s claims are false."
  ]
}