{
  "id": 5132,
  "mediaId": 2548,
  "date": "2022-04-22",
  "headline": "Mayorkas Reportedly Very Concerned About Lifting Title 42, Worries About Migrant Surge",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/04/2022-04-08T142658Z_1217090851_RC21JT9Z5ZII_RTRMADP_3_USA-RACE-CONFERENCE-scaled-e1650637132618.jpg",
  "link": "https://dailycaller.com/2022/04/22/department-homeland-security-alejandro-mayorkas-worried-lifting-title-42/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brianna Lyman",
  "authorUrl": "https://dailycaller.com/author/brianna@dailycaller.com",
  "termIds": [
    4873,
    2243,
    3989,
    1441,
    1433,
    6383
  ],
  "sentences": [
    "We are going to proceed with our execution, carefully, methodically, in anticipating different scenarios.”\nA record two million migrants were encountered at the U.S.-Mexico border in 2021, and authorities confiscated $3.31 billion in counterfeit goods, more than 319,000 pounds of marijuana, over 190,000 pounds of methamphetamine and more than 97,000 pounds of cocaine in fiscal year 2021.",
    "“As he has also repeatedly said, we anticipate an increase in migrant encounters after the lifting of Title 42, and he is leading a whole-of-government response to apprehend, process and remove from the country those who are not eligible for relief,” Espinosa said, according to the outlet.",
    "“And look, we don’t only need a long-term and detailed plan here for ending Title 42, but we still need to fix our broken immigration system as a whole.”\nFive Senate Democrats joined Senate Republicans recently in an attempt to block the ending of the policy.",
    "Mayorkas told members of Congress recently that he is frustrated with the handling of the CDC’s decision to lift the mandate and expects a large influx of migrants following the repeal, according to sources familiar with the matter, Axios reported.",
    "Congressional members who spoke with Mayorkas told Axios they do not feel the administration is prepared to handle the potential surge of migrants once the policy is rescinded after Mayorkas walked them through DHS’ current plans.",
    "DHS spokeswoman Marsha Espinosa said, “Title 42 is a public health authority — not an immigration authority — and [Mayorkas] defers to the public health experts at the CDC for any decisions related to it,” according to Axios.",
    "Department of Homeland Security (DHS) Secretary Alejandro Mayorkas reportedly told Congress he’s worried about plans to lift Title 42 in May, noting a possible spike in border crossings.",
    "(RELATED: Republican Abs Throw Possible Wrench Into Lawsuit Over Biden’s Title 42 Decision)\n“We should not end Title 42 until we have a detailed plan in place,” Pennsylvania Lt. Gov.",
    "“I think we have to be very mindful of the fact that we are addressing enemies, and those enemies are the cartels and the smugglers, and I will not provide our plans to them.",
    "Title 42 is a Trump-era public health measure issued in response to the COVID-19 pandemic that allows the DHS to rapidly expel migrants on public health grounds.",
    "Mayorkas told CNN on Tuesday that the department does have “plans.”\n“We are executing on those plans,” Mayorkas said, according to CNN.",
    "In March alone agents arrested 209,906 people, the highest number of monthly arrests at the southern border since March of 2000.",
    "Mayorkas reportedly also told members of Congress there are numerous challenges that come along with lifting Title 42.",
    "John Fetterman, who is running for the state’s open Senate seat as a Democrat, told Politico.",
    "The Biden administration has received bipartisan pushback over the ending of the Title 42."
  ]
}