{
  "id": 523,
  "mediaId": 8271,
  "date": "2022-02-23",
  "headline": "Wawa vs. Sheetz: Results from my ultimate Pa. convenience store taste-test",
  "image": "https://billypenn.com/wp-content/uploads/2022/02/wawasheetz-maccheese-2-1200x630.jpg",
  "link": "https://billypenn.com/2022/02/23/sheetz-wawa-taste-test-convenience-store-food/",
  "mediaOutlet": "billypenn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Asha Prihar",
  "authorUrl": "https://billypenn.com/about/asha-prihar/",
  "termIds": [
    0
  ],
  "sentences": [
    "Now solidly on the latter side of the debate, she sees the Philly-area affinity as “more rooted in pride than product.”\n“The Philadelphia area has a very strong sense of place I’d never felt living in Central Pennsylvania,” Farr said, “and people here take pride in everything, from their weird mascots to their beloved convenience store.”\n30 recommendations, and nothing that matched\nIndeed, my old sense of place must not have been strong enough, because a few weeks into my Philly residency, I decided to test my loyalties and open my mind to the other side.",
    "Brubaker emailed me again last week, with refined thoughts on the two chains after a bit of meditation: “I would say that Wawa fulfills my needs while Sheetz fulfills my fantasies.”\nI’ll always remember Sheetz as the place where I hung out with my friends until 1 or 2 a.m. in high school and during college breaks, where I drove with my brother to pick up fried food at unreasonable hours during lockdown, where I once enjoyed a delicacy that was a quesadilla AND a burrito (a quesarito, if you will).",
    "Throughout the trial period, my mind kept going back to an email I received from LJ Brubaker, a Billy Penn reader who described themselves as having feet in both Philly and Central Pa.\nTheir message opened my mind to the possibility that maybe the rivalry between the two stores is “more apples and oranges than anyone wants to concede”:\nCan Wawa make you a burrito the size of a human infant loaded with tater tots?",
    "“Both companies take great pride in our roots as Pennsylvania-based companies that employ thousands of people across the Keystone State and have a strong desire to support our communities.”\nSheetz’s response, from public relations manager Nick Ruffner: “Sheetz has tremendous respect and admiration for Wawa and the company that they have built.",
    "Let’s just say that when the Sheetz near my family’s house shut down for renovations early in the pandemic, my older brother and I would regularly drive to the location three towns over (about a 40-minute round trip) in pursuit of popcorn chicken, mac n’ cheese bites, mint hot chocolate, and a host of other stomach-ravaging foods.",
    "Wawa’s something more simple in my mind: it’s the place a few blocks down from the office, where I can wander for a simple sandwich and cup of glorious mashed potatoes when I forget to pack my lunch or run out of time to eat breakfast before heading to the office on a weekday.",
    "Some colleagues gave high praise to more unorthodox things like mashed potato bowls with mixed-in meatballs or chicken fingers, but with the caveat that they’re only good when you’re drunk (which is apparently one of the best reasons to patronize city Wawas).",
    "That meant growing up with a disproportionate affinity for Hershey’s chocolate, learning how to perfectly slice Seltzer’s Lebanon bologna back when I worked in a deli, and — of course — frequenting Sheetz for all my gas and shnack needz.",
    "The Shorti hoagies are satisfying (I tried the meatball variety, as well as turkey and cheese), and the delicious mashed potatoes (without mix-ins, this time) were basically earth-shattering.",
    "We will continue to work together to make a positive and significant impact in our communities.”\nBut friendliness between brands doesn’t necessarily translate into friendliness between fans.",
    "The Wawa/Sheetz rivalry is age-old — the quintessential divide between the Philly area and most of the rest of Pa. Someone’s even decided the conflict is worth an entire documentary.",
    "Unity through cheesy macaroni\nOn the way home to visit family the other weekend, I stopped in Lancaster County, one of the few in Pennsylvania home to both Wawa and Sheetz outposts.",
    "So I took a forkful of macaroni from the Wawa cup, cheese securely stuck on, and dipped it in the liquidy Sheetz cheese sauce, grabbing a supplementary noodle or two along the way.",
    "When Sheetz asked Twitter followers to tweet life-changing foods, people responded with things like mac n’ cheese bites (my fave), Boom Boom sauce, fryz, 2-for-$1 hot dogs.",
    "Stephanie Farr, a journalist at The Philadelphia Inquirer, moved from Sheetz country to Wawa territory 15 years ago and now covers all things Wawa as part of her job.",
    "We’re not quite Wisconsin, but if anything could bring the good people of Pennsylvania together under one big tent, I wouldn’t be surprised if it was cheese.",
    "I enjoy Wawa for all my breakfast sammy or soggy hoagie needs, and I relish the curly fries, blue soda, and other monstrosities that Sheetz provides.",
    "That combo bite was by far the best I’d had that morning, and I took several more despite literally being on the way to a restaurant to have lunch.",
    "John Fetterman has made loving Sheetz part of his image, and he’s debated the topic with Rep. Brendan Boyle on Twitter, in writing, and over Zoom.",
    "I slurped up a mint milkshake so quickly it left me feeling kind of sick in the middle of the workday (which means it was absolutely top-tier).",
    "Those stuck in a narrow Wawa or Sheetz mindset might not know this yet, but a balanced life (and commonwealth) benefits from both.",
    "“All of us at Wawa have a tremendous amount of respect for our friends at Sheetz,” said Wawa communications director Lori Bruce.",
    "Sheetz and Wawa have collaborated before, as their spokespeople reminded me… but never on food items, according to Ruffner.",
    "And everything I tried that focused on cheese — mac n’ cheese, a quesadilla, toasted ravioli — simply made me miss Sheetz.",
    "Does Sheetz have comprehensible interior design that doesn’t make you feel like you’re in a Chuck-E-Cheese for truckers?",
    "Delco-set “Mare of Easttown” on HBO featured Wawa coffee cups so often people wondered whether it was product placement.",
    "The list I ended up with left me a little surprised by how different it was to what I would typically order at Sheetz.",
    "To set this up: I already knew I didn’t love Wawa’s mac n’ cheese and that I did love Sheetz mac n’ cheese bites.",
    "Wawa’s take put more emphasis on the gooey cheese texture, but I couldn’t help but wish for a stronger flavor.",
    "Sheetz uses a different recipe for its cup mac than it does for the mac bites, PR manager Ruffner confirmed.",
    "(Unfortunately, I don’t drink coffee, so an absolute Wawa essential was automatically off the table for me.)",
    "Sign up for the free Billy Penn newsletter to get everything you need to know about Philadelphia, every day.",
    "Both mentioned they’ve teamed up to benefit charitable causes, like hunger relief and the Special Olympics.",
    "At each, I bought the same item to subject to a true side-by-side comparison: a cup of macaroni and cheese.",
    "After I declared the two quite simply different, my brother made a suggestion: why not try both together?",
    "If you ask Sheetz and Wawa about the battle between their fans, meanwhile, they’re nothing but friendly.",
    "I started by gathering suggestions from friends, colleagues, people on Twitter, and Billy Penn readers.",
    "I felt a little jealous of the people of Lancaster County for having this melange within their reach.",
    "Sheetz’s version was almost like a soup: quite liquidy, but with a flavor that packed a cheesy punch.",
    "I was skeptical, but as I was already eating this at 10:30 a.m., I didn’t have much more to lose.",
    "To achieve my quest, I set a goal: Try something new from Wawa every day for two weeks straight.",
    "As I made my way through the recommendations, I decided the Wawa menu has both good and bad.",
    "Of the 30-plus recommendations I got, Shortis, pretzels, Sizzlis, and coffee were popular.",
    "Though I now live in Philadelphia, I spent most of my life in Central Pennsylvania.",
    "But the Sizzli I tried was probably not something I’d ever find myself craving.",
    "Few mentioned subz (aka hoagies, in Wawa-speak), or pretzels, or coffee.",
    "On Route 72, they’re conveniently located about 9 minutes apart.",
    "The closest Sheetz is 50 miles away, and I don’t have a car.",
    "But I wanted to do one last thing to top off the challenge.",
    "At first, the taste test left me wanting better from both.",
    "At first, I didn’t think I could bring myself to do it.",
    "What’s a dedicated convenience store patron to do?",
    "By the end of my two weeks, I pretty much agreed.",
    "U.S. Senate candidate and Lieutenant Gov.",
    "Find another convenience store, I guess.",
    "I wish we could all just get along.",
    "But beyond that, I saw potential.",
    "Embrace the ways of my new home.",
    "The brand identity runs deep.",
    "Then I moved to Philly.",
    "Go to a… *gasp* Wawa.",
    "How frequent?",
    "Love Philly?",
    "(It wasn’t.)",
    "Again, no.",
    "Valhalla.",
    "However!",
    "A lot.",
    "No."
  ]
}