{
  "id": 5323,
  "mediaId": 2641,
  "date": "2022-04-19",
  "headline": "Trafalgar Poll: Pennsylvania GOP Senate Primary Wide Open",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=6184c556-2f42-4cc7-8f43-2ee1340f4f89&SiteName=Newsmax",
  "link": "https://www.newsmax.com/john-gizzi/pennsylvania-senate-gop-primary/2022/04/19/id/1066361/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Gizzi",
  "authorUrl": "https://www.newsmax.com/insiders/john-gizzi/id-212",
  "termIds": [
    5862,
    2540,
    2765,
    4243,
    1489,
    1131,
    1126,
    1379,
    6506
  ],
  "sentences": [
    "Much press attention was paid to the showing of Barnette, a Black woman who lost a race in 2020 against Rep. Madeleine Dean, D-Pa.\nRounding out the primary pack in Trafalgar's survey were Carla Sands (11.2%), who served as President Donald Trump's ambassador to Denmark, and 2018 Lt. Gov.-nominee Jeff Bartos (7.7%).",
    "\"And what's amazing is that the two candidates running ahead of me have each spent about $18 million — most of it their own money — and I have raised $2 million in small donations,” Barnette told Newsmax.",
    "One week after Donald Trump endorsed celebrity Dr. Mehmet Oz for the Senate in Pennsylvania, and one month before the primary, a just-completed poll shows a wide open Republican primary.",
    "According to the respected Trafalgar Poll, Oz now leads among likely GOP voters with 22.7% to 19.7% for hedge fund billionaire David McCormick.",
    "\"The base is so ready for an 'America First' candidate who can fight the takeover of our culture by socialists,\" Sands told us.",
    "While conceding Trump's endorsement \"makes [winning the primary] more challenging,\" Sands insisted she can win.",
    "Among Democrats, the favorite for the seat of retiring Sen. Pat Toomey, R-Pa., is far-left Lt. Gov.",
    "Polls almost universally show him winning the May 17 primary over moderate Rep. Conor Lamb, D-Pa.",
    "Coming in a surprisingly strong third with 18.4% is Fox News commentator Kathy Barnette.",
    "The Trafalgar Group polled 1,074 likely Pennsylvania GOP primary voters April 11-13.",
    "John Gizzi is chief political columnist and White House correspondent for Newsmax.",
    "The results have a margin of error of plus or minus 2.99 percentage points.",
    "\"You have to hold the Trump base and then win over suburban voters.\"",
    "All five major GOP hopefuls are strong Trump supporters.",
    "For more of his reports, Go Here Now.",
    "Posts by John Gizzi\n© 2022 Newsmax.",
    "All rights reserved.",
    "John Fetterman."
  ]
}