{
  "id": 5604,
  "mediaId": 2551,
  "date": "2022-04-09",
  "headline": "Trump calls for an end to ‘woke war on women’ at North Carolina rally: Former president says 'far-left gender theories' are 'child abuse' and that public schools have replaced 'reading and math with pronouns and gender studies'",
  "image": "https://i.dailymail.co.uk/1s/2022/04/10/03/56426163-0-image-a-13_1649557829525.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10704031/Trump-calls-end-woke-war-women-rally-calls-gender-theories-form-child-abuse.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    2765,
    6456
  ],
  "sentences": [
    "+10\nView gallery\nFormer President Donald Trump on Saturday evening backed Republicans to end a so-called 'woke war on women' and likened the teaching of 'far-left gender theories' to child abuse\n+10\nView gallery\nTrump was speaking about how he wanted Republicans to take back both houses of Congress in 2022 and ban the discussion of 'far-left gender theories'\n+10\nView gallery\nFormer President Donald Trump smiles as he speaks at a rally, Saturday, April 9, 2022, in Selma, North Carolina\n'Our government-run education system has forfeited the trust of American parents, they really, really have.'",
    "Ron DeSantis last week\n+10\nView gallery\nThe law bans classroom lessons on sexuality, gender identity and sexual orientation 'in a manner that is not age appropriate'\nLater in the speech, Trump took on another issue involving the trans community, specifically their participation in collegiate and youth sports, which he called 'unfair to women.'",
    "Now Trump’s endorsement will only intensify this intra-party fight, just like it has in GOP Senate primaries across the country – leaving their ultimate nominee badly damaged and out of step with the voters who will decide the general election,' said Democratic Senatorial Campaign Committee spokesperson Patrick Burgwinkle.",
    "'We will not have men participating in women's sports,' Trump said, referencing unspecified swimming and weightlifting records and going so far as to hint that if he were a coach of a women's sports team, he would have a team of all transgender women.",
    "Trump was speaking in Selma on Saturday about how he wanted Republicans to take back both houses of Congress in 2022 and ban the discussion of 'far-left gender theories,' in addition to the teaching of Critical Race Theory.",
    "The ex-president then demanded justice for the January 6 prisoners and for full protection of their civil rights, which he said was received by Antifa and Black Lives Matter 'who murdered people throughout our country.'",
    "'Last week, the Biden administration sent Congress a budget crammed with billions and billions of dollars of transgenderism and so-called equity provisions that are nothing more than government-sponsored racism.'",
    "Dr. Oz brings broad name recognition to a contest that could decide overall control of the Senate in November's midterms - a fact not lost on Trump, who said his 18 years in TV were like winning an opinion poll.",
    "Oz is on the far right, seen here with the Trumps and Piers Morgan on the left\nBut insiders said it had been Oz's endorsement to lose – particularly as former first lady Melania Trump was known to be a big fan.",
    "+10\nView gallery\nPresident Donald Trump greets the crowd during a rally he hosted in North Carolina on Saturday\nTrump did not specifically reference Florida's 'Parental Rights in Education' law signed by Gov.",
    "Critics say the Florida law's open-ended language, which also prevents 'classroom discussion' of LGBTQ issues, would prevent children from confiding in teachers if they feel unsafe because of their identity.",
    "Oz has been neck and neck with David McCormick, a former hedge fund chief executive, and both had visited Trump in Mar-a-Lago as they vied for the backing of the most powerful voice in the Republican Party.",
    "On the Democratic side, Pennsylvania's progressive lieutenant governor, John Fetterman, is locked in a race against Congressman Conor Lamb, a moderate representing the northwestern suburbs of Pittsburgh.",
    "The legislation has ignited tensions between state Republicans and Disney, which came out against it after employees at the company's theme parks and studios staged walkouts over its lack of response.",
    "+10\nView gallery\nTrump announced his endorsement at a rally in Selma, North Carolina on Saturday night\n+10\nView gallery\nInsiders said the endorsement was Oz's to lose as Melania Trump is a big fan.",
    "The 'Don't Say Gay' law has escalated tensions between Florida's Republican legislature and Disney, a company that has enjoyed decades of support, and independence, from the state's government.",
    "Oz is Pro-Life, very strong on crime, the border, election fraud, our great military, and our vets, tax cuts, and will always fight for and support our under-siege Second Amendment,' he said.",
    "'Perhaps most importantly, I believe that Mehmet Oz will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.'",
    "Trump made headlines at the rally, announcing he was endorsing TV surgeon Dr. Mehmet Oz in the bitter contest to become the Republican nominee for a U.S. Senate seat in Pennsylvania.",
    "Former President Donald Trump called for an end of the 'woke war on women' and likened the teaching of 'far-left gender theories' to child abuse at his North Carolina rally.",
    "The former president then pivoted to the Biden administration's budget, which he says contains aspects of both racial and gender theories that Republicans must end.",
    "The entertainment giant has come out against the bill after its employees staged walkouts and protests in opposition to the bill and Disney's perceived silence.",
    "Democrats believe a bad-tempered Republican contest could give them victory in November in an election to replace retiring Republican Senator Pat Toomey.",
    "Trump appeared on the Dr Oz show to discuss his health before the 2016 election, revealing that he weight 236lb, in a segment that clearly still rankles.",
    "Biden narrowly won Pennsylvania in the 2020 election but Republicans made gains in the state legislature leaving November's election as a tight race.",
    "'He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!).'",
    "Trump argued a Republican Congress should allow parents to send their children to any public, private or charter school of their choice.",
    "He then honed in on the public education system, which he believes has 'traded reading and math for pronouns and gender studies.'",
    "'He has lived with us through the screen and has always been popular, respected, and smart,’ said Trump in an emailed statement.",
    "The law bans classroom lessons on sexuality, gender identity and sexual orientation 'in a manner that is not age appropriate.'",
    "He argued for the GOP to 'end the woke war on women and children' and end what he called 'illegal government discrimination.'",
    "Dr. Oz also passionately believes in high-quality education and protecting parent involvement throughout the process.",
    "+10\nView gallery\nTrump did not specifically reference Florida's 'Parental Rights in Education' law signed by Gov.",
    "No teacher should ever be allowed to teach far-left gender theories to our children without parental consent.",
    "'A Republican Congress must stand up for parental rights and parental choice, I think that's a good idea.",
    "Republicans say it's necessary to keep discussion of sensitive matters relegated to the home.",
    "'The Republican Senate primary in Pennsylvania was already nasty, expensive and brutal.",
    "The Trump endorsement could break a deadlock in the Pennsylvania race.",
    "Trump said Oz was a winner with strong conservative credentials.",
    "'He will ensure America will become energy independent again.",
    "'Harvard educated, tremendous, tremendous career.'",
    "I'm gonna have a great team, but you know why?",
    "'Great guy, good man,' he told a rally crowd.",
    "It's truly child abuse, plain and simple.'",
    "'If I'm a basketball coach I guarantee...",
    "Ron DeSantis last week.",
    "I'm not gonna say it.'",
    "'Dr."
  ]
}