{
  "id": 5645,
  "mediaId": 2584,
  "date": "2022-04-10",
  "headline": "‘TV is like a poll’: Trump endorses Dr Oz for Pennsylvania Senate nomination",
  "image": "https://i.guim.co.uk/img/media/6fe10aa108f5963a0ac30707f672283f6cd87fd6/0_193_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0cd7aaece59acb417e221a0c24caeb22",
  "link": "https://www.theguardian.com/us-news/2022/apr/10/tv-is-like-a-poll-trump-endorses-dr-oz-for-pennsylvania-senate-nomination",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Martin Pengelly",
  "authorUrl": "https://www.theguardian.com/profile/martin-pengelly",
  "termIds": [
    0
  ],
  "sentences": [
    "The former White House adviser Steve Bannon said: “How does Dr Oz, probably the most anti-Maga guy, and you got Fox non-stop pimping this guy out and Newsmax pimping this guy out, and that’s what it is – how does Dr Oz, from New Jersey, [Turkish president Recep Tayyip] Erdogan’s buddy, floating in from Jersey, how does he become a factor in a Senate race in the commonwealth of Pennsylvania?”\nThe Senate minority leader, Mitch McConnell, has clashed with Trump, who has sought to oust him.",
    "“Now Trump’s endorsement will only intensify this intra-party fight, just like it has in GOP Senate primaries across the country – leaving their ultimate nominee badly damaged and out of step with the voters who will decide the general election.”\nOz has been accused of being out of step with Pennsylvania voters not least because he entered the race after living two decades in New Jersey.",
    "“The great commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr Mehmet Oz for the United States Senate.”\nAt his rally, Trump called Oz a “great guy, good man … Harvard-educated, tremendous, tremendous career and they liked him for a long time.",
    "You know, when you’re in television for 18 years, that’s like a poll, that means people like you.”\nTrump previously endorsed Sean Parnell, who withdrew after being accused by his wife of abusive behaviour, which he denied.",
    ")”\nTrump, who appointed Oz to a White House advisory role, also presented him as anti-abortion, “very strong on crime, the border, election fraud, our great military and our vets, tax cuts” and gun rights.",
    "Donald Trump has endorsed Dr Mehmet Oz for the Republican nomination for Senate in Pennsylvania, an expression of support for a fellow TV star which could test the former president’s grip on his party.",
    "In a statement before a rally in Selma, North Carolina on Saturday night, Trump said: “This is all about winning elections in order to stop the radical left maniacs from destroying our country.",
    "Speaking to Politico, a “person close to Trump … noted a phrase that Trump has often repeated when talking about Oz: ‘He’s been on TV in people’s bedrooms and living rooms for years.’”",
    "In his statement, Trump said Oz was especially popular with women because of his work in daytime TV and could do well in Philadelphia and Pittsburgh, Democratic-leaning cities.",
    "Oz said: “President Trump wisely endorsed me because I’m a conservative who will stand up to Joe Biden and the woke left.”\nPolling shows Oz and McCormick evenly matched.",
    "Being on TV was “like a poll, that means people like you,” the former president and Celebrity Apprentice star said of Oz, a heart surgeon turned daytime host.",
    "The former president also mentioned his own controversial appearance on Oz’s show in the 2016 campaign, when Trump showed partial results of a physical.",
    "Trump said: “He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!",
    "“We’ve got a good choice of candidates and I think we’ve been a good position to win that race regardless of who the nominee is,” McConnell said.",
    "The following year, a group of prominent doctors accused Oz of displaying “an egregious lack of integrity” and promoting “quack treatments”.",
    "“The Republican Senate primary in Pennsylvania was already nasty, expensive and brutal,” said a spokesperson, Patrick Burgwinkle.",
    "In 2014, Oz told senators some products he promoted, including a “miracle” green coffee bean extract, lacked “scientific muster”.",
    "The winner is likely to face the Democrat John Fetterman, currently lieutenant governor, in the November election.",
    "His entry to politics also brought renewed attention on his TV career, which began on Oprah Winfrey’s show.",
    "Many on the pro-Trump hard right of the Republican party, however, question if Oz is a true conservative.",
    "The Democratic Senatorial Campaign Committee sought to portray Trump’s endorsement of Oz as divisive.",
    "Republicans have indicated they could use the Senate to deny Joe Biden another supreme court pick.",
    "Appearing on Fox News Sunday, the Kentucky senator was asked about Trump’s Oz endorsement.",
    "“I guess we’ll find in the next few weeks how much this endorsement made a difference”.",
    "The Senate is split 50-50, controlled by the vote of the vice-president, Kamala Harris.",
    "Politically speaking, prominent pro-Trump figures have said Oz is not a conservative.",
    "David McCormick, a hedge fund executive, also sought Trump’s backing.",
    "Control will be at stake in November.",
    "That’s like a poll."
  ]
}