{
  "id": 6203,
  "mediaId": 8254,
  "date": "2022-04-12",
  "headline": "Bill would change plans for Pennsylvania lieutenant governor’s residence",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/AP22040714783493-1.jpg?w=1280",
  "link": "https://www.abc27.com/news/local/harrisburg/bill-would-change-plans-for-pennsylvania-lieutenant-governors-residence/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AP",
  "authorUrl": "",
  "termIds": [
    3989,
    3355,
    6208,
    6506
  ],
  "sentences": [
    "Diamond, who is running for lieutenant governor in the May 17 GOP primary, said the department expects to establish a veterans’ outreach center in a more accessible location and find a use for the State House that “will not ruin the historic nature of that fine building.”\nThe bill was sent to the state Senate for its consideration.",
    "HARRISBURG, Pa. (AP) — A Pennsylvania government agency would get more flexibility about what to do with the former official residence of the lieutenant governor, located on a military facility, under a bill passed unanimously Tuesday by the state House.",
    "But the bill’s sponsor, Rep. Russ Diamond, R-Lebanon, said that use isn’t practical because it would take about $3 million to renovate it to make it accessible to people with disabilities, and because it’s located within a National Guard base.",
    "The current lieutenant governor, Democrat John Fetterman, declined to move into the 1940s-era limestone State House when he took office about three years ago, instead proposing it be used for some public good.",
    "Lawmakers previously voted to transfer the home at Fort Indiantown Gap to the Department of Military and Veterans Affairs for use as a veterans’ outreach center.",
    "Staff and maintenance costs had been running about $400,000 a year when it was the lieutenant governor’s residence.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "¡Recibe noticias locales y el pronóstico del tiempo directamente en tu buzón de email!",
    "The property about 25 miles (40 kilometers) northeast of Harrisburg includes a pool.",
    "Regístrate aquí para recibir los boletines diarias de AL DÍA CON ABC27.",
    "Sign up here."
  ]
}