{
  "id": 6512,
  "mediaId": 8489,
  "date": "2022-04-11",
  "headline": "The top 10 Senate races that are most likely to flip to the other party",
  "image": "https://whyy.org/wp-content/uploads/2022/04/senator-triptych-16x9_custom-48d29bbac5eb740697b786a8cfdc00a7f96c6f64-s1600-c85.jpeg",
  "link": "https://whyy.org/npr_story_post/the-top-10-senate-races-most-likely-flip-other-party/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Domenico Montanaro",
  "authorUrl": "https://www.npr.org/people/392602474/domenico-montanaro?ft=nprml&f=1091483542",
  "termIds": [
    2137,
    3026,
    5862,
    4905,
    3989,
    1489,
    1126,
    392
  ],
  "sentences": [
    "Lots of candidates are in or eyeing the race, including Chuck Morse, the state Senate president; Bruce Fenton, a wealthy Bitcoin enthusiast with a libertarian streak; retired Army Gen. Don Bolduc, who finished second in the GOP Senate primary in 2020 and recently hired a high-profile GOP consultant; and Kevin Smith, former town manager of Londonderry.",
    "They say Colorado is a difficult state for them largely because of the state’s highly educated population, which has made Trump unpopular, even among many Republicans\nDemocratic incumbent Michael Bennet is favored to win reelection, but even Democrats acknowledge Colorado — and Washington state — is a state they are not taking their eyes off.",
    "Though there are a number of candidates, it’s largely a three-way race between Jim O’Dea, a construction company executive who is the only candidate on the airwaves so far and is spending some of his own money; former Olympian Eli Bremer; and Gino Campana, a former Fort Collins city councilman and owner of a development company.",
    "Former state Treasurer Josh Mandel and investment banker Mike Gibbons got in each other’s face and had to be separated at a debate last month over Gibbons’ investment record and Mandel’s inexperience in the private sector, which led to Mandel bringing up his military service in Iraq.",
    "With Biden’s struggling approval ratings in states across the country and high inflation a top concern for voters, Republicans have significantly improved their likelihood to take control of the Senate, based on conversations with operatives and strategists in both parties.",
    "There are millions of dollars in ads coming from the candidates (Gibbons had spent almost $6 million already by the end of 2021), super PACs and dark money groups in this race, and with the polls as close as they are, it’s not entirely clear where this primary is headed.",
    "Former President Donald Trump stepped into the Republican primary fight over the weekend between David McCormick, a former hedge fund manager, and TV’s Dr. Mehmet Oz, who faced controversy over his residency because he had been seen often at his home in New Jersey.",
    "Republicans see Beasley as a weak candidate and point out this is a state Biden lost in 2020 and his approval rating has nosedived here to below 40% and is underwater on his handling of issues, ranging from COVID and education to the economy and Ukraine.",
    "Mandela Barnes, who starts out with a name ID and polling advantage, and Milwaukee Bucks executive Alex Lasry, 34, who worked in the Obama White House, is the son of Bucks owner Marc Lasry and appears willing to spend some of his own money on this race.",
    "Their top candidates are state Attorney General Mark Brnovich and two others who are far wealthier and whose campaigns have more money — Blake Masters, a former venture capital executive, and Jim Lamon, a former owner of a solar energy company.",
    "It’s also another state where Biden’s approval rating is underwater, and if Democratic base groups aren’t fired up — particularly Latino and Asian American voters in a state where they are key — that could make it difficult for Cortez-Masto.",
    "If the environment were more positive for Democrats, they might be making a stronger push, but Senate Majority PAC, the outside group with the goal of electing Democratic senators, is not currently spending on ad buys in the state.",
    "Lamon calls himself an “America First conservative” and Masters released a video with him saying right at the beginning “I think Trump won in 2020.”\nLook for immigration to become a big issue, as it always is in this border state.",
    "Cheri Beasley, the first Black woman to serve as chief justice on the state Supreme Court, is expected to prevail in the May 17 primary, while Republicans are still undecided between Trump-backed Rep. Ted Budd, former Gov.",
    "Nevada is one of those states that always seems to be close — Biden won it by just over 2 percentage points in 2020 and Cortez-Masto won it by a similar margin in 2016 when she had the benefit of presidential-year turnout.",
    "As it is, Republicans have an advantage this year because traditionally midterm elections are lower-turnout affairs and the party out of power is able to more easily turn out its base, angry with the president.",
    "The Senate is less subjected to dramatic shifts, as compared to the House, but the party out of power in a president’s first midterm has still won a net gain of two seats on average in the Senate since 1950.",
    "North Carolina (R-Open)\nThe state has seemed to get less attention than at the outset of the cycle when Democrats were hopeful about potentially winning this open seat held by retiring Sen. Richard Burr.",
    "Rubio leads in the polls, but isn’t above 50% in many, and Democrats see this as a defensive liability for Republicans, where they may have to spend some money to defend Rubio if the race gets closer.",
    "Walker has written about his battle with dissociative identity disorder and is facing allegations of domestic abuse from past relationships and that he exaggerated his post-football business success.",
    "When President Biden took office, it was widely believed that Republicans had a strong chance of taking back the House but, thanks to a friendly map for Democrats, the Senate was more competitive.",
    "The analysis is based on reporting in the field, conversations with Democratic and Republican operatives and strategists, as well as publicly available data, such as ad spending and polling.",
    "There are question marks about the strength of Laxalt as a candidate, considering he lost his bid for governor in 2018, though that was in a Democratic wave year and was by just 4 points.",
    "Ohio (R-Open)\nThis has been a state that has trended away considerably from Democrats in the last few presidential elections as the party has struggled with white, working-class voters.",
    "Biden won Wisconsin in 2020, but only by about 20,000 votes out of more than 3 million, and, reflecting the trend nationally, his approval rating in the state is upside down.",
    "But in a difficult environment for Democrats and in a state that was decided by only about 10,000 votes in the 2020 presidential election, this one is shaping up to be close.",
    "Walker, a former Heisman-winning University of Georgia Bulldog who has Trump’s endorsement, may have high name identification in the state, but he’s untested as a candidate.",
    "Wisconsin (R-Johnson)\nIncumbent Republican Ron Johnson, a close Trump ally and antagonist of the left, is the most vulnerable GOP senator up for reelection this cycle.",
    "Officials are digging deeper into the role that fake slates of electors played in Trump's effort to cling to power after his defeat in the 2020 presidential election.",
    "Pennsylvania (R-Open)\nThe top of this top 10 is difficult, but an open seat in a state Biden won, where Republicans are facing a messy primary, is a place to start.",
    "It was possible, if not likely, that Democrats — who control the Senate, which is split 50-50 — would retain the upper chamber and maybe even pick up a seat or two.",
    "And Democrats traditionally have a strong turnout operation in a state where most of the Democratic vote is concentrated in one place — Clark County (Las Vegas).",
    "Arizona (D-Kelly)\nDemocratic incumbent Mark Kelly cuts a good profile as a candidate — he’s a former astronaut and has raised a substantial amount of money.",
    "Democrats hope the Republican primary gets messier, no one gets above 30%, and it is forced to a runoff, which would mean two more months of GOP infighting.",
    "Mandel has had national ambitions for a while but he’s a controversial figure who failed in a Senate bid in 2012 and dropped out during the 2018 primary.",
    "They have already spent tens of millions of dollars, as have outside groups, and this is expected to be one of the most expensive races in the country.",
    "Rep. Tim Ryan, who has spoken to this problem and unsuccessfully challenged Nancy Pelosi for the House speakership, has the state party’s endorsement.",
    "Biden’s approval has declined dramatically in Arizona, something Democrats think Kelly can weather because of his brand and he’s seen more favorably.",
    "Hassan has some advantages, however — notably money and an uncertain Republican primary field, which won’t be decided until a September primary.",
    "Republicans are looking to use the Biden administration’s reversal of Title 42, which turned away migrants due to COVID concerns, against Kelly.",
    "The good news for Republicans is all that will be over with in about three weeks with the May 3 primary, and early voting is already underway.",
    "Trump picked Oz, despite McCormick traveling to Mar-a-Lago recently in search of Trump’s support and being married to a former top Trump aide.",
    "John Fetterman has a big lead in the Democratic primary and is raising lots of money while Republicans have spent millions against each other.",
    "But overall, several of the states up for grabs were very close in 2020, and the slightest push in the GOP’s direction could tip the balance.",
    "With the passing of former Sen. Harry Reid, who is credited with building the ground game, there is an open question of how it will perform.",
    "Notably, Warnock, the former pastor at Ebenezer Baptist Church, won his special election over former Sen. Kelly Loeffler by a wider margin.",
    "Incumbent Sen. Marco Rubio starts out with the clear advantage, but Democrats are pleased with the fight that Rep. Val Demings is waging.",
    "She was on pace in fundraising with Rubio, as of the end of the year, in this very expensive state because of its multiple media markets.",
    "Florida (R-Rubio)\nDemocrats have lost Florida in presidential elections by increasingly wider margins since Barack Obama won it in 2008.",
    "The Republican side, on the other hand, is crowded and bitter with candidates angling against each other — and for Trump’s endorsement.",
    "Georgia (D-Warnock)\nDemocratic incumbent Raphael Warnock is running for his first full term after winning a special election last year.",
    "Privately, Republicans say they would be happy with either candidate, but that McCormick is viewed as the more mainstream conservative.",
    "Georgia has seen lots of close and heated political fights in the last few years as the Sun Belt continues to change demographically.",
    "But they are facing stiff headwinds, however, as only about a third of Pennsylvania voters say they approve of the job Biden’s doing.",
    "So far, Warnock has the money advantage, raising $30 million to Walker’s $9 million, as of their last filings at the end of the year.",
    "After saying there was no evidence of election fraud in the state, Brnovich now says there are “questions” about the 2020 election.",
    "2 months ago\nWith the resignation, McCormick moves closer to declaring his candidacy for U.S. Senate in his native Pennsylvania.",
    "Trump endorsed Laxalt, who has backed Trump’s election lies, including in Nevada, which Trump lost by more than 33,000 votes.",
    "But his favorability ratings in the state are poor and Democrats are ready to spend tens of millions on trying to oust him.",
    "But Biden’s approval has taken a nosedive in the state, with only about a third saying they approve of the job he’s doing.",
    "Given the late primary (Aug. 9), it won’t help Democrats that they will be fighting each other over the next four months.",
    "Cortez-Masto has the money advantage over likely Republican nominee Adam Laxalt, the state’s former attorney general.",
    "New Hampshire (D-Hassan)\nIncumbent Democrat Maggie Hassan is seen as vulnerable because New Hampshire is often close.",
    "Doug Ducey to run against Kelly and instead, they are engaged in a messy primary that won’t be decided until August.",
    "And it’s likely why Kelly has broken with the administration and criticizes it for not having a “sufficient” plan.",
    "Polls have shown Gibbons and Mandel locked in a dead heat, but not very far ahead of Hillbilly Elegy author J.D.",
    "In contrast, 21 Republican-held seats are up and Biden won in two of those states – Pennsylvania and Wisconsin.",
    "Unlike in the House, when all 435 seats come up for election every two years, only a third of Senate seats do.",
    "With that background in mind, here is the first NPR Top 10 Senate seats most likely to change hands in 2022.",
    "Republicans believe it’s winnable if there are swings like the ones seen in Virginia and New Jersey in 2021.",
    "Rob Portman’s announced retirement has opened up quite a fight — almost literally — among Republicans here.",
    "Trump certainly wants to avoid that and held a rally in the state Saturday, in part to try and boost Budd.",
    "Of the 14 Democratic seats up this cycle, Biden won all of those states in the 2020 presidential election.",
    "This seat opened up when Republican Sen. Pat Toomey announced he would not run for reelection.",
    "In a surprise, Biden won Georgia, but only by fewer than 12,000 votes out of almost 5 million.",
    "Freshman incumbent Catherine Cortez-Masto has largely maintained a low profile in Washington.",
    "Colorado (D-Bennet)\nIf the wave is big enough, this could be one that becomes competitive.",
    "Nevada (D-Cortez-Masto)\nThis race doesn’t get as much attention as some of the others.",
    "With Wisconsin, they are two critical places for Democrats to try and hold the Senate.",
    "The filing deadline here isn’t until June, so a lot can happen between now and then.",
    "But Republicans are more bullish about their chances here than in any other race.",
    "The leading Republican in the race is former NFL running back Herschel Walker.",
    "Johnson has survived in worse climates for Republicans, like in 2016.",
    "When she first won election in 2016, it was by about 1,000 votes.",
    "And Biden’s approval in the state, like elsewhere, is down.",
    "The primary is in late June, and it has been sleepy so far.",
    "Republicans, though, aren’t off to a quick and easy start.",
    "Pat McCrory and to a lesser extent, ex-Rep. Mark Walker.",
    "That makes this a longshot for Democrats to start with.",
    "We will update this periodically through Election Day.",
    "Republicans lost a key recruit when moderate Gov.",
    "Vance and former state GOP Chair Jane Timken.",
    "Republicans don’t have an obvious candidate.",
    "Part of that is a sleepy Democratic primary.",
    "The leading Democrats are Lt. Gov.",
    "This is the Democrats’ top target.",
    "Polls have had them neck and neck.",
    "Both candidates are very wealthy.",
    "They were unable to persuade Gov.",
    "(Senators serve six-year terms.)",
    "Trump is a factor in this race.",
    "Chris Sununu declined to run.",
    "That is not the thinking now.",
    "The landscape has shifted.",
    "4 months ago",
    "Lt. Gov.",
    "Sen.",
    "10.",
    "9.",
    "8.",
    "7.",
    "6.",
    "5.",
    "4.",
    "1.",
    "3.",
    "2."
  ]
}