{
  "id": 6561,
  "mediaId": 2732,
  "date": "2022-04-10",
  "headline": "U.S. Rep. Conor Lamb brings his Pennsylvania Senate campaign to the midstate",
  "image": "",
  "link": "https://triblive.com/news/politics-election/u-s-rep-conor-lamb-brings-his-pennsylvania-senate-campaign-to-the-midstate/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "They come out of every single paycheck that you have.”\nBut the key to it all, Lamb noted, is winning the Pennsylvania seat as part of a national effort to try to first retain and then grow the Democrat’s majority in the Senate next year to the point where he and his colleagues can eliminate the Senate’s filibuster rule and actually get up-or-down votes on the policy.",
    "But he also argued that the Democrats do need to have a frank “family discussion about each of our strengths and weaknesses.”\nAs for Fetterman, he said, “I think that his choice to associate himself with Democratic Socialists, to support Bernie (Sanders) as much as he did, to apply to the Democratic Socialists for their endorsement… You might like that.",
    "But Lamb spent some time promising Harrisburg area Democrats on Saturday that, if he wins this tough open-seat U.S. Senate election, he’ll be exactly the kind of senator they want him to be on issues like safeguarding voting rights, protecting a women’s right to have an abortion, gun control, and getting the federal minimum wage up to $15 an hour.",
    "For all his talk about winning the general election by trying to calm the political waters, Lamb was challenged by voter Maggie Kooistra for a recent broadcast advertisement produced by an independent political committee that tagged Fetterman as being a “self-described Democratic Socialist,” a label that Fetterman pointed out he has never worn.",
    "But in real life, where these decisions are being made, this is our ticket to the dance.”\nLamb popped onto the state and nation’s political radar in the winter of 2018, as the Democrat’s candidate in a special election in southwestern Pennsylvania that voted heavily for former President Donald Trump less than two years earlier.",
    "In that vein, he touted his support for a series of practical solutions that he said would help all Pennsylvanians in an era of high inflation and rising interest rates, including:\nGranting the federal government the right to negotiate on prescription drug prices for Medicare, the medical assistance program for seniors.",
    "Speaking at the Bumblebee Hollow community room in Upper Allen Township before about 75 voters - some Lamb supporters, some undecided, but all certain Democratic voters in the fall - Lamb said he isn’t the candidate with the fieriest rhetoric.",
    "Sanders is a Democrat, who identifies as a democratic socialist, and in that vein represents a wing of the party who would support a generous welfare state — which today includes policies like universal health care and free college education.",
    "Lamb said he would work to roll the accumulated savings right back into the program, to help pay for lowering the age-eligibility threshold from the current 65 to 62 or 60, and adding coverage for vision, dental and hearing needs.",
    "“You’re an appealing candidate, and that can be very counter-productive,” Kooistra said, voicing a common fear that many Democrats have that the candidates in this field will weaken themselves for the fall by going negative.",
    "“If we’re talking drugs, medicine, child care, school, student loans, maybe add to that something like housing, all of a sudden we’re taking on six of the key costs that almost every single family in our state experiences.",
    "For parents, reviving a plank in the Build Back Better plan that would cap most working families’ costs for child care at 7 percent of their household income, something that now often ranges into the double digits.",
    "He won that race, and then won two full terms under Pennsylvania’s redrawn maps, beating GOP incumbent Keith Rothfus in the fall of 2018, and then defeating Trump-backed Republican hopeful Sean Parnell in 2020.",
    "“But we’re in for a very tough year, and the Republicans are going to talk about it with whoever our nominee is so the question that our party needs to ask is who does that attack stick to and who does it not.",
    "I’m not doing my job if I don’t tell you that that’s not how we’re going to win at the state level in Pennsylvania.”\nFetterman endorsed U.S. Sen. Bernie Sanders in the Democratic Party’s 2020 nomination cycle.",
    "We turn the Senate back into a working institution again.”\nGetting the Pennsylvania seat, Lamb continued, means letting voters know that politics doesn’t have to be a knock-down drag-out fight about ideology.",
    "By applying the tax to the full income of the nation’s highest-income earners, Lamb said, the fund’s long-term fiscal stability should be guaranteed, and benefits may be able to increased.",
    "Lebanon, may have made his political reputation as being a centrist Democrat who could deliver his party election wins in Trump-leaning districts they weren’t expected to get.",
    "Lamb is seeking the Democratic Party’s nomination for the seat currently held by Republican incumbent Pat Toomey, who opted against seeking a third term this year.",
    "Prior to running for Congress, Lamb, 37, had served for five years in the U.S. Marine Corps and four years as an assistant U.S. attorney in western Pennsylvania.",
    "But the first job is getting elected, Lamb said, and he continued to hammer home his campaign’s theme Saturday that he is the most electable of the Democrats.",
    "John Fetterman, the frontrunner in the early polling, state Rep. Malcolm Kenyatta of Philadelphia and Jenkintown borough councilwoman Alexandra Khalil.",
    "Removing the cap on income exposed to the payroll tax for Social Security, which currently allows people to pay nothing for income above $140,000.",
    "Lamb noted that the ad was produced by a committee that, by federal law, his own campaign is not permitted to coordinate with on messaging.",
    "The Pennsylvania seat is seen as one of a handful nationwide that is likely to define who has majority control of the Senate come 2023.",
    "But he said he believes he is the candidate who can break through to the most Pennsylvania voters in a general election.",
    "“So those are the issues that I’m going to talk about in a general election campaign if I’m your nominee,” Lamb said.",
    "It’s about letting voters know “that all we’re trying to do at the end of the day is represent them.",
    "The open seat contest has also generated a hotly-contested race for the GOP nomination.",
    "Not win some victory over them or take something away from them… That’s our ticket.",
    "Medicare and Social Security are programs that you earn over a lifetime of work.",
    "People need child care because they’re working so hard at two different jobs.",
    "“We get those two (extra votes) the filibuster’s gone and we get a lot done.",
    "“I know that people don’t want to talk about that all the time,” Lamb said.",
    "For college graduates, forgiveness of some level of student loan debt.",
    "“And at a time of rising other costs, people are going to get that.",
    "That we’re on the side of giving them just a little breathing room.",
    "The SuperPAC wound up taking the ad down almost immediately.",
    "This isn’t handing out things to people things for free.",
    "It’s not the most eye-popping thing on Twitter.",
    "I think it kind of sticks to John,” Lamb said.",
    "He’s running in a four-way field with Lt. Gov.",
    "That might be your politics and that’s fine.",
    "Categories: News | Politics Election",
    "Primary election day is May 17.",
    "“It’s not the most idealogical.",
    "U.S. Rep. Conor Lamb, D-Mt."
  ]
}