{
  "id": 6966,
  "mediaId": 2589,
  "date": "2022-04-11",
  "headline": "Mystified MAGA wonders: What was Trump thinking when he endorsed Dr. Oz?",
  "image": "https://media.townhall.com/townhall/reu/o/2016/258/a0152cc2-56f0-4bb1-b140-98b639e45ca7-1110x740.jpg",
  "link": "https://hotair.com/allahpundit/2022/04/11/mystified-maga-wonders-what-was-trump-thinking-when-he-endorsed-dr-oz-n461577",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allahpundit",
  "authorUrl": "https://hotair.com/author/allahpundit",
  "termIds": [
    0
  ],
  "sentences": [
    "They complained about the reasons Trump gave — noting his celebrity status, Harvard credentials, New York Times bestseller status, and that Oz praised the former presidents health, “People have been calling me all day and asking ‘What the hell was he thinking?’”\nNote again the insinuation that some influential confidant or staffer must have steered the impetuous and erratic Trump away from his supposedly keen instincts and diligent deliberative process.",
    "I think that President Trump very, very seldom does anything that’s not thought out and doesn’t have a very reasoned and logical basis, but, for whatever reason, in this particular instance, he chose to ignore all of that and endorse Oz.”\nBall says he fielded calls all day from conservatives unhappy with the former president’s decision.",
    "Poor Mo Brooks, who was unswervingly loyal to Trump before he was discarded by him like trash due to his poor polling, still can’t bring himself to blame Trump directly for anything:\nThis is happening because Trump’s surrounded himself by staff who are on McConnell’s payroll & hostile to the MAGA agenda.",
    "McCormick’s going down swinging, in any case:\nExit question: If Trump (supposedly) dumped Mo Brooks because Brooks once urged Republicans to look forward towards 2022 instead of backward at 2020, why hasn’t he also dumped the candidate he’s endorsed for Senate in North Carolina, Ted Budd?",
    "Not only is McCormick married to former Trump staffer Dina Powell and has other top Trumpers working for him, like Hope Hicks and Stephen Miller (Miller has now quit in tribute to his leader), he has a bit of Bush-era Republican authenticity to him that Oz lacks.",
    "McCormick even went to Mar-a-Lago last week to kiss Trump’s ass in person, something that must have been distasteful for a West Point grad turned Bronze Star recipient turned turned Ph.D turned ultra-mega-successful hedge-fund manager.",
    "Lesser-known pro-Trump media personalities also stepped into the fold, including Townhall columnist Kurt Schlichter, who wrote: “It’s pretty hard for me to fully express how disappointed in Trump I am for endorsing Oz.”\n“Wait.",
    "I was honored to have his endorsement in PA. Twice,” Sean Parnell, the former Trump-backed candidate, who dropped out of the race after an abuse allegation surfaced from his estranged ex-wife, wrote on Twitter.",
    "Budd has gone much further than Brooks has in disputing the Big Lie, calling Biden “the legitimate president” last September and agreeing with an interviewer that Biden got many more votes than Trump did.",
    "If Trump cared about what was best for the party, he wouldn’t be running a vendetta against Brian Kemp in Georgia that’s apt to divide Republicans and end with Stacey Abrams becoming the next governor.",
    "Oz is the antithesis of everything that made Trump the best president of my lifetime.”…\nLongtime Republican operative Roger Stone couldn’t help joining the pile-on either, writing on Telegram, “Wait?",
    "If Trump cared about what was best for his own MAGA movement, he wouldn’t have redefined it so that its core issue is believing he was cheated in an election he lost by seven million votes.",
    "And, to my bafflement, many of his fans are baffled that he didn’t:\n“President Trump was very out of sync in picking Oz,” says Dave Ball, chair of the Washington County Republican Party.",
    "President [Trump] endorsed this guy?” while attaching a photo of the doctor, who rose to infamy after years of hosting a daytime television show with guests like Michelle Obama.",
    "would be cooler and more memorable than having one named “McCormick.”\nI wonder how he feels about having a senator named “Fetterman” because that’s now what we’re looking at.",
    "(@RonFilipkowski) April 10, 2022\nMcCormick would also be a better match-up for the GOP against the likely winner of Pennsylvania’s Democratic primary, John Fetterman.",
    "So one has to laugh when Trumpers say how “disappointed” they are that he chose one fake MAGA guy in the Pennsylvania Senate race over a different fake MAGA guy.",
    "At the end of the day, if Trump says the blow-dried RINO is the choice for true patriots, most of the true patriots will mindlessly pull the lever for him.",
    "But for those who’ll accept no substitutes for 45 as their next GOP presidential nominee, there’s now no truly good outcome in the offing in Pennsylvania.",
    "If instead Oz ends up losing the primary, it’s a sign that Trump is losing his grip on the party and a serious 2024 primary challenge is likely.",
    "Fetterman is an in-your-face progressive populist, a former small-town mayor who’d draw a sharp contrast with an effete celebrity doctor.",
    "One recent Democratic internal poll found Oz trailing Fetterman by nine in a head-to-head race while McCormick led Fetterman by three.",
    "And this:\nMehmet Oz old show helping people understand transgender: “This extraordinary condition is not as rare as you might think.",
    "https://t.co/SoD656HT0V\n— Mo Brooks (@MoBrooks) April 10, 2022\nI’d bet good money that Trump’s staff favored McCormick on balance.",
    "If Oz ends up winning the primary, it’s a sign that there’s less policy and ideological content to Trumpism than they thought.",
    "Trans shakes up all of our ideas about what makes us male or female.” pic.twitter.com/4aN0Xsiuqt\n— Ron Filipkowski ????",
    "“I’d like to know who it is who lives in Pennsylvania that knows the voters well told Trump to pick Oz,” he says.",
    "He was thinking, “This guy’s a celebrity and my wife likes him.”\nWhat else would he be thinking?",
    "He probably chose Oz in the end because he thinks having a senator named “Oz” (like the book!)",
    "“Disappointed” implies that there was some expectation as to how Trump would conduct himself.",
    "At least those critics were willing to hold Trump himself responsible for the endorsement.",
    "Which, for populists who prefer DeSantis to Trump, would be a perfectly fine outcome.",
    "It’s estimated as many as 3 million Americans believe they were born the wrong sex.",
    "Is there anything conservative about Dr. Oz?” Blaze TV’s Allie Beth Stuckey added.",
    "Everybody telling Trump who to endorse in primaries works for The Swamp.",
    "You don’t think “Republican” when you think Oz, you think Oprah.",
    "But he did it anyway because he wanted that endorsement.",
    "All of this leaves MAGA true believers in a tough spot.",
    "And why should he care if anyone’s disappointed?",
    "“I have enormous respect for President Trump.",
    "He’ll pay no price for it among his fans.",
    "“But I’m disappointed by this.",
    "What was that expectation?",
    "Cut him loose, Donald!",
    "Trump didn’t care.",
    "They played him.",
    "Oh well.",
    "Again."
  ]
}