{
  "id": 7121,
  "mediaId": 2732,
  "date": "2022-04-04",
  "headline": "Lamb, Kenyatta face off — minus Fetterman — in debate of Democratic Senate hopefuls",
  "image": "",
  "link": "https://triblive.com/news/pennsylvania/lamb-kenyatta-face-off-minus-fetterman-in-debate-of-democratic-senate-hopefuls/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bloomberg News",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Fetterman told Pittsburgh public radio station WESA last year that he doesn’t support a ban on fracking but said he wants to work toward a “de facto moratorium because the transition is going to be toward green and renewable energy.”\nAn Emerson College Poll conducted for The Hill and released Sunday showed Fetterman leading with 33%, followed by Lamb with 10% and Kenyatta with 8%.",
    "“It gets a bad name because of some bad practices here in our state in the early years that we’ve not caught up to with enforcement quickly enough, but it is a very, very powerful tool and it is very, very widely supported by people all over the state because of the opportunities that it brings,” Lamb said Sunday at Muhlenberg College in Allentown.",
    "Representative Conor Lamb, who represents a Western Pennsylvania district with some of the largest natural gas deposits in the country, said fracking not only provides jobs in a region decimated by the decline of the coal and steel industries, but can also help achieve climate goals by replacing dirtier coal.",
    "“You have Democrats who want to try to have it both ways” — acknowledging a climate crisis while saying “let’s just keep doing what we’re doing.”\nIn the November general election, the Pennsylvania contest to replace retiring Republican Senator Pat Toomey will help decide party control of the U.S. Senate.",
    "Democratic Senate candidates from both ends of Pennsylvania accused the front-runner, Lieutenant Governor John Fetterman, of flip-flopping on energy issues in the first televised debate in one of the nation’s most-watched campaigns of the year.",
    "The Democrat will face the winner of a Republican primary that includes former Bridgewater Associates Chief Executive Officer David McCormick and celebrity television doctor Mehmet Oz.",
    "Kevin Baumlin, the former chair of emergency medicine at Pennsylvania Hospital, polled at 9% but withdrew from the race last week.",
    "State Representative Malcolm Kenyatta, whose district is in Philadelphia, responded that fracking “doesn’t just have a PR problem.",
    "Fetterman’s absence allowed the other leading candidates to focus their criticism on the lieutenant governor.",
    "Lamb accused Fetterman of changing his position on energy depending on which part of the state he’s in.",
    "Kenyatta said Fetterman used to be opposed to fracking but now agrees with Lamb.",
    "It is an actual problem.”\n“These big extractors haven’t done one bad thing.",
    "Fetterman, who is far ahead in the polls, didn’t participate in the debate.",
    "Categories: News | Pennsylvania | Politics Election | Top Stories",
    "They’ve done multiple bad things,” he said.",
    "The primary election is May 17."
  ]
}