{
  "id": 7949,
  "mediaId": 2540,
  "date": "2022-04-04",
  "headline": "Two Pennsylvania Senate candidates become top targets at events they didn't attend",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220403224048-pennsylvania-senate-primaries-split-super-tease.jpg",
  "link": "https://www.cnn.com/2022/04/04/politics/pennsylvania-senate-primaries-mccormick-fetterman/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Merica and Eric Bradner",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Lamb said Fetterman's decision not to attend showed he doesn't \"respect you enough to show up today,\" while Kenyatta added, \"If John can't show up to talk to other Democrats about the importance of this race ... who the hell really believes John is going to be able to show up and stand up and fight for our values in Washington?\"",
    "(CNN)Republican David McCormick and Democrat John Fetterman opted to skip separate events with their Senate primary opponents this weekend where they became the central targets of attacks, underscoring their statuses in their respective primary fields just six weeks before Election Day in Pennsylvania.",
    "Fetterman, who already holds statewide elected office and has been the fundraising leader, has been the dominant figure in the Democratic primary, using his appeal to Democrats in western Pennsylvania and his positioning as a progressive populist with a level of national prominence.",
    "\"While today's debate was seen by very few voters, John has agreed to 3 debates that will be televised in every major media market in the state, because he's proud of his record and more than ready to talk about it,\" Joe Calvello, a Fetterman spokesman, said after the contest.",
    "While Fetterman declined to attend Sunday's Democratic debate, organizers -- after inviting him repeatedly -- did not remove his lectern, allowing Lamb and Kenyatta to use the empty place on the stage to argue that the lieutenant governor can't answer tough questions.",
    "On Sunday, Fetterman skipped a Democratic primary debate in Allentown, leaving an empty lectern on the stage and allowing his two opponents, Rep. Conor Lamb and state Rep. Malcolm Kenyatta, to attack the lieutenant governor's fitness for the Senate.",
    "Lamb and Kenyatta focused much of their attention on a 2013 incident in which Fetterman left his home, shotgun in tow, to confront what turned out to be an unarmed Black jogger, after hearing the sound of gunshots in the area and calling 911.",
    "Lamb, a more moderate Democrat who has won a series of high-profile congressional races in GOP-leaning areas, has argued the lieutenant governor hasn't been tested and will give Republicans countless attack opportunities if he is the nominee.",
    "McCormick, the former hedge fund manager turned Senate candidate, skipped a Republican forum on Saturday outside Harrisburg, leading his opponents to attack his business dealings in China and the fact that he recently lived in Connecticut.",
    "McCormick's chief attacker at the Republican forum was Mehmet Oz, the celebrity heart surgeon, who claimed at the conservative Pennsylvania Leadership Conference that scrutiny of McCormick's ties to China are the reason he didn't attend.",
    "While McCormick has adopted his own tough-on-China rhetoric and attempted to use his experience as an advantage, comparing his business record to former President Donald Trump, his opponents have made it their central attack against him.",
    "Jess Szymanski, a McCormick spokesperson, said the candidate was \"unable to attend the Saturday forum for scheduling reasons,\" citing an event kicking off trout season in central Pennsylvania and additional events in the Scranton area.",
    "Polls show him alongside Oz at the front of the GOP primary field, and McCormick's personal wealth and the support of a super PAC largely funded by hedge fund billionaire Ken Griffin, have helped flood the airwaves.",
    "Pennsylvania's race to replace retiring Republican Sen. Pat Toomey is among the nation's marquee contests in November's midterm elections and could represent Democrats' best chance of picking up a GOP-held seat.",
    "\"Profiling and the history in minority communities is a real thing,\" Fetterman said in an interview with CNN last year, \"so I understand why people might be concerned, but this had nothing to do with race.\"",
    "While the events opened both McCormick and Fetterman up to unanswered and pointed attacks, they also cemented the candidates as front-runners in their respective races just weeks before the May 17 primary.",
    "Then Kenyatta used the lectern as a prop, telling the audience that a candidate who gets attacked gets 30 seconds to respond and he wanted to give Fetterman -- via his empty position -- the chance.",
    "Fetterman has addressed the incident, writing in a Medium post shortly after he announced his Senate bid that he didn't know the individual's race or gender and never pointed his gun at him.",
    "But the issue has loomed over his Senate bid and his Democratic opponents argued Sunday that the story will be a powerful attack used by Republicans if Fetterman is the party's nominee.",
    "\"It was wrong what he did, and he skipped the debate today because he doesn't think he has to answer for it,\" said Lamb, repeating a line of attack he began on Twitter last week.",
    "Calvello responded to the debate by saying the attacks are \"the kind of scrutiny that comes with being the frontrunner in the most high-profile Senate race in the country.\"",
    "He's noted that the Sandy Hook massacre had taken place a little more than a month before and said that the jogger was going in the direction of a local elementary school.",
    "\"I think it's because he knew that the subject of China was going to come up,\" said George Bochetto, a Philadelphia attorney also running for Senate.",
    "Businessman Jeff Bartos, another Republican running for the nomination, zeroed in on the fact that McCormick, until recently, lived in Connecticut.",
    "Fetterman's campaign announced on Friday that it would not attend on Sunday by pledging to attend three different debates later in April and May.",
    "\"Traffic to get from Connecticut to Harrisburg on a weekend is terrible, and I'm told that Grade A jet fuel is also expensive,\" Bartos quipped.",
    "\"He's faced the attacks and addressed them one by one, and he's not just still standing -- he's still winning,\" he added.",
    "\"You deserve to have us answer your questions and be put in situations of pressure and see what we really believe.",
    "Kenyatta, a few minutes later, piled on: \"It doesn't matter the color of the skin of the jogger.",
    "The campaign's main complaint was that Sunday's contest was not televised in primetime.",
    "\"Given everything that has gone on in this country, that is fatal to his campaign.\"",
    "That is what you did not get from John Fetterman here today,\" the congressman said.",
    "\"It is unacceptable and that is how you know he is not ready for this.",
    "This story has been updated with comment from the McCormick campaign.",
    "And now he refuses to come here, and he expects you to vote for him.",
    "To date, the attacks haven't knocked McCormick from his pedestal.",
    "John doesn't have to be racist to be wrong.",
    "That is a problem.\"",
    "He was dead wrong.",
    "And I am.\""
  ]
}