{
  "id": 8430,
  "mediaId": 2574,
  "date": "2022-04-08",
  "headline": "Union-Busting Firm Backs Labor Darling Conor Lamb",
  "image": "https://freebeacon.com/wp-content/uploads/2020/10/GettyImages-930596728_736x514.jpg",
  "link": "https://freebeacon.com/democrats/union-busting-firm-backs-labor-darling-conor-lamb/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chuck Ross",
  "authorUrl": "https://freebeacon.com/author/chuck-ross/",
  "termIds": [
    0
  ],
  "sentences": [
    "The biggest individual donor to a PAC supporting Rep. Conor Lamb's (D., Pa.) Senate bid is the head of a law firm accused of hostility toward labor unions, a connection that could hurt Lamb's standing in the union-friendly state.",
    "The PAC, which counts Democratic strategist James Carville as an adviser, plans to spend millions of dollars to elect Lamb over Pennsylvania lieutenant governor John Fetterman in the Democratic primary.",
    "Union Pacific said its employees would be required to take the vaccine in order to comply with President Biden's executive order requiring vaccination for federal contractors.",
    "The claim could be a tough sell for Lamb, whose campaign paid $270,000 last year to Fireside Campaigns, a public relations firm that counts Black Lives Matter as a client.",
    "Activists have pointed to Cozen O'Connor's website, which touts its expertise in helping companies in the face of unionization campaigns, pickets, and work stoppages.",
    "Cozen drew national attention during the 2020 presidential campaign over his support for then-candidate Joe Biden, who has also touted his pro-labor credentials.",
    "Lamb has portrayed himself as the pro-labor candidate of the Democratic field, but his reliance on Cozen's support could undermine that claim.",
    "Labor activists and liberal media outlets have in the past accused Cozen O'Connor of helping corporations kill unionization efforts.",
    "In October, Cozen O'Connor client Union Pacific sued the association to prevent workers from striking over federal vaccine mandates.",
    "The group also accused Fetterman of cozying up to anti-police activists and supporting measures to release criminals from jail.",
    "Penn Progress may be Lamb's best chance at winning the Democratic primary, as he lags far behind Fetterman in fundraising.",
    "Stephen Cozen, the chairman of Cozen O'Connor, gave $10,000 to Penn Progress, a political action committee backing Lamb.",
    "The International Association of Sheet Metal, Air, Rail, and Transportation Workers also gave $25,000 to Penn Progress.",
    "It is unclear if Lamb has had any interaction with Cozen, who contributed $5,800 to Lamb’s campaign in September 2021.",
    "It is also unclear whether Cozen has contributed more to Penn Progress since his initial donation on Dec. 31.",
    "Fetterman, the progressive frontrunner, led Lamb by 30 points in a poll released by Penn Progress last month.",
    "Federal candidates are allowed to interact with super PACs as long as they don’t directly solicit donors.",
    "The lawmaker reportedly spoke with donors to Penn Progress on conference calls hosted by the PAC.",
    "The PAC has since slammed Fetterman as too liberal to win the general election.",
    "Lamb's campaign and Penn Progress did not respond to a request for comment.",
    "The railroad asserted it was a federal contractor subject to the order.",
    "Lamb's Senate campaign website boasts endorsements from 21 unions.",
    "Cozen O'Connor also did not respond to a comment request.",
    "The PAC has not disclosed any of its donors for 2022."
  ]
}