{
  "id": 8531,
  "mediaId": 8400,
  "date": "2022-04-08",
  "headline": "Gay, Black, Electable: Malcolm Kenyatta Talks Pa. Senate Race And The Phone Call That Broke His Heart",
  "image": "https://philadelphiaweekly.com/wp-content/uploads/2022/04/Malcolm-Kenyatta.jpg",
  "link": "https://philadelphiaweekly.com/pennsylvania-senate-race-malcolm-kenyatta-john-fetterman-conor-lamb-poll/",
  "mediaOutlet": "Philadelphia Weekly",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Some recent headlines when you Google the senate race include, “Poll: Fetterman leads Lamb by double digits,” “Conor Lamb takes swipe at John Fetterman,” and, “Will Fetterman silence Lamb in Pennsylvania senate face-off?”\nWhen Montgomery County Supervisor Dr. Valerie Arkoosh was still in the race, it was impossible not to notice that the two people inexplicably iced out by many were a woman and a gay Black man and the two people who were deemed more credible, more serious looked like every U.S. president except for one.",
    "They didn’t think he had the money, and they don’t think he could win the primary or the general.”\nOther rumors swirl as to the rationale for spurning the hometown candidate, including a perennial claim that entrenched party bosses punished the young upstart who jumped ahead and took somebody else’s “turn.”\nKenyatta isn’t impressed even if he stays positive, refusing to address the rumors or even most of the on-record rationale.",
    "“We need somebody who actually understands our lives and understands what working people are worried about,” he goes right into the familiar cadence of a stump speech, “and what challenges are making it so difficult for working families to keep their heads above water and to ultimately thrive.”\nThe work in Philadelphia and in fact across the Commonwealth is daunting.",
    "“But one of the most effective talking points that Trump had was, ‘At least I’m not part of the problem, right?’ He couldn’t say that as effectively in his reelection, which is part of why he lost as well as due to disastrous policies that didn’t line up with any of the economic things he said he was going to accomplish.”\nAre voters really that substantive?",
    "The cost of their student loans, whether or not they can afford to buy that first house, whether or not they’re going to be able to put food on the table.”\nGiven the one thing Americans are totally united on is their disdain for politicians and politics in general, anecdotally at least Kenyatta’s observation seems on point.",
    "“If life doesn’t do anything else,” Malcolm Kenyatta says to me through the phone, “it happens.”\nThe recently married 31-year-old state representative hailing from North Philadelphia is taking time in between an interview he just gave and another engagement to speak to me about his current project: a run for U.S. Senate.",
    "Plus, the national media and even some local journalists too have seemingly decided that Kenyatta – who came out swinging for darling of establishment moderates Joe Biden before nearly any other elected official in Philadelphia in the race for president – is an insurgent candidate bucking the establishment.",
    "“How to make sure everybody can have one good job backed up by a union, that if folks get sick they can actually go to the damn doctor, fill the prescription when they leave the appointment, and then that they can retire with a level of real dignity – in a house they were able to afford in the first place.",
    "The cost of their student loans, whether or not they can afford to buy that first house, whether or not they’re going to be able to put food on the table.”\nGiven I noticed his constant refrain and core rationale is that he’s a working person running for office, I ask whether he pays his own electric bill.",
    "These electability arguments surrounding Kenyatta never address how Ed Rendell, a Jewish Philadelphian born in New York City, was twice elected governor, how Lynn Swann became the first Black GOP nominee for governor in 2006, how Barack Obama handily won in both 2008 and 2012 in the Keystone State.",
    "Kenney’s endorsement was particularly out of character: Known for eagerly elevating women, LGBTQ people, and Black Philadelphians to positions of power within City government, Kenney seemed to fold into something misshapen, off-base, and room temperature in order to justify the Lamb nod.",
    "“As much as I respect everybody else in the Democratic field,” Kenney told the Inquirer at the time, “he’s the person that can win.”\nLikewise, speaking to WHYY, longtime City Committee Chair Bob Brady, now retired from Congress, cited electability concerns.",
    "The National Low Income Housing Coalition adds that a full 44 percent of workers between the ages of 18 and 64 are in low wage positions and that for the nation’s extremely low income households, there’s a shortage of about 7 million affordable homes.",
    "And how could local political leaders say with a straight face that Lamb was more electable given he’s tied with Kenyatta and can’t get remotely near Fetterman’s poll numbers after months of high profile news coverage and all those endorsements?",
    "People are ready to have bold leadership more than the cynics would have you believe.”\nIf his Democratic colleagues wedded to this electability narrative give rural communities a severe lack of credit, what does Kenyatta instead see there?",
    "Elected in 2018 at the age of 28, Kenyatta is still even now at 31 one of the youngest members of Pennsylvania’s wheezing and weighty state legislature, a place where he says – angrily, it’s important to note – nothing gets accomplished.",
    "Even gigs that some found to be lifelines or excellent supplements to existing jobs, like driving for Uber, are starting to cost too much as gas prices rise amid a global oil industry claiming strain for a variety of reasons.",
    "“Even if you are somebody who is a conservative, I don’t even know what policies other than, you know, crazy culture war crap have they actually even done.”\nBy “they,” Kenyatta means the majority GOP controlled legislature.",
    "Whatever happens in May’s primary or November’s general election, the senator from Pennsylvania will indeed change given current Sen. Pat Toomey, a Republican, is retiring and leaving the field wide open for both parties.",
    "“Everybody brings to office a whole host of lived experiences,” Kenyatta adds, “and I’m certainly going to bring mine.”\nThe constant framing of the conversation back to those issues is a hallmark of our interaction.",
    "Those are the things we need to get done.”\nIt’s a vision of the United States that would recall Franklin Roosevelt, Eugene McCarthy, and, yes, Bernie Sanders but also Joe Biden and Hillary Clinton and Barack Obama.",
    "“What we’ve been talking about is America’s basic bargain,” Kenyatta responds to the bleak picture with a phrase used frequently by Robert Reich, former Clinton Treasury secretary and left-of-center economist.",
    "The same people who were talking about whether or not a Black gay man could win in Pennsylvania – because we have to acknowledge that a big part of this idea, that ‘Malcolm isn’t viable,’ is based on nothing.",
    "“In so many of the open wards where committee people get to be part of the process,” he cheerily glides over the implication of his statement, “I think all of them, so far, we’ve actually won that support.",
    "The elder Kenyatta led boycotts, attended Harvard where he led the Black Law Students Association, and worked at dismantling the nation’s white supremacist underpinnings until his passing at the age of 47.",
    "He’s being gracious, I had unexpectedly and regretfully canceled our previous interview and despite a grueling, packed schedule, Kenyatta managed to fit me in on a busy, sunny, and cold Friday afternoon.",
    "Coupled with a razor thin one vote spread thanks only to the Democratic vice president, the Senate is in desperate need of additional Democrats or Republicans to have anything substantive move forward.",
    "Mayor Jim Kenney, whose seeming lack of interest in his current job is only surpassed, perhaps, by the acute interest a handful of City Councilmembers have in taking that same job, went with Lamb, too.",
    "People love to cite the James Carville quote about Pennsylvania, which he called, “Philadelphia, Pittsburgh, and Alabama in the middle.”\nIt’s rarely mentioned that Carville said this three decades ago.",
    "Yet, based upon headlines and news coverage, the race has really only been between two white straight men from the beginning, Lamb and Fetterman, himself also a Democrat from the Pittsburgh area.",
    "People are ready to have bold leadership more than the cynics would have you believe.”\nFor whatever reason, the electability argument has become (inexplicably) conventional wisdom amongst many.",
    "“First of the month!”\nAnd while he paid his light bill online this month just like you or me, on Tuesday, May 17, Kenyatta learns whether his everyman persona gets a little harder to maintain.",
    "“I think what you hear from a lot of [Trump voters] is ‘I don’t like all the stuff he says, but he promises to bring back jobs.’ And of course, he was never going to,” Kenyatta observes.",
    "In the latest The Hill/Emerson College poll, Fetterman earned 33 percent, with Lamb and Kenyatta locked in a statistical tie within the margin of error at 10 and 7 percent, respectively.",
    "“It should be frustrating to every voter irrespective of where you place yourself on the ideological spectrum that in Harrisburg we are not seeing much of anything get done,” he laments.",
    "The campaign trail is so dizzying, Pennsylvania’s rural to suburban to urban and back again rolling hills and highways so numerous, he cannot recall, when asked, what he ate last.",
    "To be clear, Kenyatta does not run away from the lived experience he brings to the race even if it’s not his rationale for running – even if some critics think that’s all he is.",
    "And the exuberant gains in wages that happened toward the end of the quarantine and as the COVID-19 pandemic started to wane haven’t just been reversed by rising inflation.",
    "And while the elder might’ve been known more as the disruptive, direct action type, the younger is equally as disruptive – just, perhaps, within the system’s boundaries.",
    "To be clear, it’s difficult to imagine that progressive Fetterman or even the staunchly moderate Lamb courts or enjoys the effect this bias has on their own chances.",
    "Information on registering to vote, online registration, vote by mail, and voting in general can be found on the City Commissioners’ site at philadelphiavotes.com.",
    "Nonetheless, even if he wasn’t there to work alongside his grandfather as a colleague, Malcolm Kenyatta carries on the same dedication to what he sees is right.",
    "Kenyatta’s grandfather, Muhammad Kenyatta, was a force in and of himself who ran unsuccessfully against Rizzo for the Democratic nomination for mayor in 1975.",
    "And we can make sure that’s a conversation we don’t have to have, because when you get more working people in office, what you get is different priorities.",
    "She said, ‘Baby, I’m so sorry.” When he hits the word “sorry,” his Philadelphia accent comes out in full force with more of a “saw-ree” than anything else.",
    "Even if his general view of politics is standard liberal or in today’s parlance progressive, it’s still hard to view Kenyatta as an establishment figure.",
    "“It was good.”\nAnd while that banana bread was good, the current state of the U.S. Senate is more likely to give Kenyatta, or frankly anyone, heartburn.",
    "“You know, me and my now husband, Dr. Matt, just got married, and we are grappling with so many of the issues that people ask me about every single day.",
    "If Harrisburg’s marbled hallways are a little light these days on the doing anything front, his U.S. Senate candidacy is keeping Kenyatta on his toes.",
    "And perhaps not exactly the same but in the same general area, he himself has been known for a rhetorical flourish on camera or in the public record.",
    "We won the 1st Ward and the 2nd Ward…so we’ve consistently continued to earn support.” He argues he has support across the state in other counties.",
    "“Of course not,” he responds swiftly, “it absolutely isn’t.” At this point, he drops any talking points and speaks with laser focused exasperation.",
    "The idea goes that, for some unidentified reason in a statewide race a Philadelphian has an uphill battle–let alone a Black, gay Philadelphian.",
    "And here you are talking about the same things that me and your grandfather were organizing about’ – in the 50s, 60s, 70s, and 80s,” he pauses.",
    "Notwithstanding this bit of bipartisan and cross-demographic unity, the fact is that Pennsylvania is consistently contested in national races.",
    "Locally, the Democratic City Committee endorsed one of Kenyatta’s opponents from the PIttsburgh area, U.S. Rep. Conor Lamb, also a Millennial.",
    "“The Senate is broken, and the way we fix the Senate, it turns out, is that we gotta change the senators,” Kenyatta explains matter-of-factly.",
    "They also never acknowledge the kind of bigotry they’re implying is held across the state, a seeming stereotype of rural voters themselves.",
    "While about 400,000 Philadelphians live below the federal poverty line, the fact is another million live across the rest of the state.",
    "I ask Kenyatta if he sees the kind of prejudice that the electability narrative implies whenever he’s traveling from town to town.",
    "“I think back on a conversation I had with my grandmother in 2019,” Kenyatta reflects, “and she called me with tears in her eyes.",
    "For instance, he garnered international attention in 2020 for his impassioned criticism of voter legislation pushed by the GOP.",
    "Me and my husband…just got married and we are grappling with so many of the issues that people ask me about every single day.",
    "Fetterman by far has the momentum, but Lamb’s collection of endorsements doesn’t seem to be doing much of anything for him.",
    "“Only 36 affordable and available homes exist for every 100 extremely low income renter households,” the group explains.",
    "The problem there is that Democrats outnumber Republicans in Pennsylvania by about one million registered voters.",
    "His name might sound familiar but not quite right to you if you’re a Philadelphian who remembers Frank Rizzo.",
    "After all, he’s a Black, gay Millennial who’s frequently interacting with MSNBC’s more leftist commentariat.",
    "“That is not a conversation that any parent or grandparent should have to have with their kids or grandkids.",
    "If anything, it sounds like the personification of a very mainstream, very normal, very electable Democrat.",
    "What little free time he has when he’s not with his husband is spent watching the Great British Bake-off.",
    "“We have to acknowledge that a big part of this idea, that ‘Malcolm isn’t viable,’ is based on nothing.",
    "But the image of Kenyatta as too young, too unelectable, too something persists in the eyes of some.",
    "Shit,” he readily answers, his last word elongated and resonant to anyone who pays their own bills.",
    "Recently, time has been spent poring over nonsensical, fever dream-like fantasies (nightmares?)",
    "That is not what Pennsylvania is, not in our small rural communities, not in our major cities.",
    "That is not what Pennsylvania is, not in our small rural communities, not in our major cities.",
    "Extremely low income households represent about 8 percent of the nation’s households overall.",
    "Still, he seems earnest in his push to have legislators, you know, legislate and govern.",
    "People believing a false version of reality, that everybody was racist and homophobic.",
    "People believing a false version of reality, that everybody was racist and homophobic.",
    "And I mean that genuinely, a government that just fucking works,” he replies, flatly.",
    "So why the dour forecast by so many establishment types as to Kenyatta’s candidacy?",
    "He was the first openly gay person of color ever elected to the state legislature.",
    "Instead, they’ve been overtaken by rising prices so that now people aren’t ahead.",
    "Or, as he previously did, work for the Greater Philadelphia Chamber of Commerce?",
    "“She said, ‘I’m just so sorry because I thought we had fixed some of this stuff.",
    "Doesn’t that say something about Lamb’s inherent…well…weakness as a candidate?",
    "In January, the state committee was deadlocked and could offer no endorsement.",
    "Whether or not a dangerous radical would have endorsed Joe Biden is unclear.",
    "But it appears to be divorced from reality in terms of evidence and history.",
    "Is Pennsylvania really a swing state with that kind of registration edge?",
    "After all, it’s that noise that people seem to have such an aversion to.",
    "After all, not everyone is a party nominated candidate for U.S. Senate.",
    "In other words, it could be anyone’s race but it’s Fetterman’s to lose.",
    "That’s usually indicative of energized support for several candidates.",
    "Rather, they’re even worse off today than they were before the virus.",
    "“There are people who,” Brady said, “didn’t think Malcolm could win.",
    "“People who want to have a government that actually works for them.",
    "“You can boo if you want,” he says in the most memorable portion.",
    "Do they really care mostly about so-called kitchen table issues?",
    "It’s that noise that’s so corrosive, seemingly, on our system.",
    "Why on earth did it go for Trump in 2016 but then not in 2020?",
    "He’s still one of the only openly gay members in Harrisburg.",
    "How else could someone so young become an elected official?",
    "And, you know, Pennsylvania is so much better than that.",
    "And, you know, Pennsylvania is so much better than that.",
    "The primary election in Pennsylvania is Tuesday, May 17.",
    "A full 37 percent of the electorate is undecided still.",
    "He really does, generally speaking, ignore the noise.",
    "Kenyatta, the younger, wasn’t even two years old yet.",
    "We won the support of the 8th Ward just two days ago.",
    "It’s hardly the stuff of a radical or fringe figure.",
    "“I do not treat politics as a game,” Kenyatta ends.",
    "In other words, it’s a swing state, like it or not.",
    "He’s one of us in style and seemingly substance.",
    "We won a majority of the votes in the 5th Ward.",
    "“A little piece of banana bread,” he exclaims.",
    "Consistently, that’s what polling suggests.",
    "“I say this every day, ignore the noise.",
    "about the 2020 presidential election.",
    "“I do not treat politics as a game.",
    "Does anything make sense?",
    "Still, it has an effect.",
    "“Yeah, I did it today.",
    "But this was in 1992.",
    "He listens to Lizzo.",
    "He’s not wrong.",
    "He’s not wrong.",
    "Then, eureka."
  ]
}