{
  "id": 8709,
  "mediaId": 8374,
  "date": "2022-04-07",
  "headline": "Muhlenberg hosts first Democratic debate for PA’s U.S. Senate seat",
  "image": "https://muhlenbergweekly.com/wp-content/uploads/2022/04/Debate.jpg",
  "link": "https://muhlenbergweekly.com/news/muhlenberg-hosts-first-democratic-debate-for-pas-u-s-senate-seat/",
  "mediaOutlet": "muhlenbergweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Conlon",
  "authorUrl": "https://muhlenbergweekly.com/author/kconlon/",
  "termIds": [
    0
  ],
  "sentences": [
    "Your first term in Congress, actually, you voted with Trump 70% of the time.” Lamb rebutted stating, “It’s amazing, for such a passionate Democrat, you [Kenyatta] campaign just like the Republicans… that is not a true number.” Lamb explained his reasoning behind voting to fund the Mexican border wall declaring, “The fact is, the government was shut down over the border wall because we didn’t give Trump the money.”\nKenyatta was not the only one to bring up Lamb’s more right-leaning votes.",
    "Kenyatta had similar thoughts, saying, “If John can’t show up to talk to other Democrats about the importance of this race, about what he would do as our next United States Senator, who the hell really believes that John is going to be able to show up and stand up and fight for our values in Washington?”\nWhere the candidates disagreed with one another essentially boiled down to a divide between the values of eastern and western Pennsylvania.",
    "I just voted on Friday to legalize marijuana… I think if we can talk about the way that our party is best when we work together… that’s how we win and that’s how we actually make changes for the long term.”\nOther topics addressed during the debate included cybersecurity threats, Middle Eastern foreign policy, nuclear power, abolishing the debt ceiling, Washington D.C. and Puerto Rican statehood and Pennsylvania’s farmers.",
    "His absence was emphasized by the other candidates, with Lamb saying, “[Fetterman] didn’t respect you enough to show up today.” The debate was moderated by Professor of Political Science Christopher Borick, Ph.D., Editor-in-Chief of City & State PA Jenny DeHuff and the founder and host of political podcast “Pennsylvania Kitchen Table Politics” Ari Mittleman.",
    "Lamb believes that fracking provides for “more jobs, lower bills and less war.” He also stated that, “It gets a bad name because of some bad practices here in our state… but it is a very very powerful tool.”\nKenyatta rebutted Lamb’s sentiments, stating, “[Fracking] doesn’t have a ‘PR’ problem, it is an actual problem.",
    "Kenyatta pointed out Lamb’s more conservative leanings, saying, “As much as we talk about John [not] being here and being accountable, we should talk about the fact that you [Lamb] voted for things that are completely out of the mainstream of where Democrats are, and you’ve cut a very conservative record in Congress.",
    "When Kenyatta pressed Lamb on one specific time where he voted against party lines, Lamb was able to give a solid reason to back up his decision.”\nEitan Gitlin ‘25 gave his opinion on the overall event saying, “I think that the debate was an interesting opportunity that Muhlenberg was able to provide for us.",
    "I also enjoyed engaging with my fellow Muhlenberg students in discourse surrounding the debate and the candidates – it’s heartwarming to see that so many of my peers are enthusiastic and engaged about the civic process.” The primary election is coming up on May 17 and the midterms are on Nov. 8.",
    "When the Congressman came to take a photo with the group, they flipped their signs, revealing signs with the phrases, “This guy voted with Trump 70% of the time,” and “Republican in ‘lamb’s clothing.’”\nStudents that attended the debate expressed their opinions of the candidates.",
    "The Weekly had the opportunity to speak with Lamb who addressed his plans to get coveted student votes saying, “I’ve done a lot in my four years in Congress on student loans, on climate change, which in my experience are the top two issues I hear about from young people.",
    "Grace Oddo ‘22 expressed her admiration of the candidates’ civility saying, “I admired that although both candidates differed on plenty of topics, they were never disrespectful or nasty towards one another – I can’t say the same about our previous administration.",
    "We still do not know, right now, what chemicals are being put into our groundwater.” In Kenyatta’s opinion, large gas and oil companies are already investing in sustainable energy and Pennsylvania is able to make the transition into this sector of industry.",
    "The candidates in attendance included Pennsylvania State Representative for the 181st district— which includes parts of Philadelphia— Malcolm Kenyatta and U.S. Representative for Pennsylvania’s 17th district Conor Lamb.",
    "“John [Fetterman] made a choice, he made a choice to point a shotgun at the chest of an unarmed Black man and then say afterward that he would ‘do it again.’ John placed that man’s life in danger.",
    "The event was sponsored by City & State PA, Pennsylvania Kitchen Table Politics, the Muhlenberg College Institute of Public Opinion, Muhlenberg College Democrats and The Muhlenberg Weekly.",
    "Outside of Seegers Union, a group of individuals from Pennsylvania’s chapter of the Sunrise Movement, a political action group with a focus on climate change, came with Conor Lamb posters.",
    "3, students, faculty, local community members and politicians gathered in the Event Space of Seegers Union for the first debate in the U.S. Senate race for Pennsylvania’s empty seat.",
    "Malcolm Kenyatta was a great speaker but I really appreciated how Conor Lamb has and would be willing to work across the aisle to get things done.",
    "“We need to cancel student loan debt, and we need to start to do the hard work of making sure college is more affordable in the first place.",
    "Fetterman’s refusal to take part in the conversation was not the only critique Lamb and Kenyatta had against the Lieutenant Governor.",
    "I was also lucky enough to help out which gave me the cool opportunity to meet important people in government from around the area.",
    "While Kenyatta and Lamb generally directed their insults at the absent Fetterman, there was a bit of friction between them.",
    "As someone who is not from the area, I was able to learn more about PA politics and who was running to represent PA in DC.",
    "It was wrong, what he did, and he skipped the debate today because he doesn’t think he has to answer for it,” said Lamb.",
    "Western Pennsylvania has struggled with a changing industry landscape, specifically in regards to energy sources.",
    "If you will be leaving campus after the conclusion of final exams, make sure to request an absentee ballot.",
    "An incident in which Fetterman pulled a gun on an unarmed Black man was a major point of contention.",
    "Make sure to register to vote by May 2 in order to be able to vote in the primary election.",
    "Lamb is a supporter of fracking as many of his constituents hold jobs in the field.",
    "This was highlighted when the topic of fracking and natural gas was brought up.",
    "We need to make two years of community college, at least, free,” said Kenyatta.",
    "Both Kenyatta and Lamb attempted to appeal to the college student demographic.",
    "The student debt crisis was a relevant subject mentioned during the discourse.",
    "Both candidates agreed that loans for college students need to be forgiven.",
    "Contact @bergvotes on Instagram or bergvotes@gmail.com with any questions.",
    "Missing from the afternoon’s event was Lieutenant Governor John Fetterman.",
    "Isaac Shulman ‘25 stated, ?“I liked both Conor Lamb and Malcolm Kenyatta.",
    "Including voting for funding for Trump’s border wall.",
    "On Apr."
  ]
}