{
  "id": 8821,
  "mediaId": 6526,
  "date": "2022-04-06",
  "headline": "Pennsylvania takes a step toward criminal justice reform – and Lt. Gov. Fetterman sidesteps debate questions",
  "image": "https://www.mcall.com/resizer/YdrcmRnlE_8g8oTFQv7_ma1PPxk=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/GGL2RVESSZDJZOYOSJIRVKMIMM.jpg",
  "link": "https://www.mcall.com/opinion/mc-opi-pennsylvania-pardons-online-application-muschick-20220406-psxe5hvhi5b2jgpc4lhuxzoghm-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Muschick",
  "authorUrl": "https://www.mcall.com/mc-bio-paul-muschick-staff.html#nt=byline",
  "termIds": [
    3989,
    6506
  ],
  "sentences": [
    "will be limited to the Board of Pardons project and official Lieutenant Governor duties.”\nIn 2019, it reduced the paper application from 20 pages to 11, allowed it to be downloaded from the website and simplified it.",
    "“The Pennsylvania Board of Pardons is going to be able to be much more decisive and rapid because we’ll be getting the information much more timely and in a unified way,” the board’s chairman, Lt. Gov.",
    "State officials announced Monday that by the end of the year or early next year, inmates and ex-convicts seeking sentence commutations or pardons no longer will have to endure a paperwork nightmare.",
    "Republicans and Democrats also have worked together on other criminal justice reforms, including the Clean Slate Act, which automatically blocks some criminal records from public view.",
    "The goal of the criminal justice system should be to punish those who break the law with a sentence that is commensurate with the harm they caused, and that is sensible for taxpayers.",
    "The digital application should result in faster review times and allow applicants to monitor their request as it moves through the system.",
    "Small changes can make big differences, and an update to Pennsylvania’s justice system should help a lot of people — including taxpayers.",
    "On a side note, the timing of Monday’s news conference to announce the modernization of the clemency process was interesting, wasn’t it?",
    "There’s no reason for the prison system to be paying so much for health care for prisoners who are too old or feeble to be a threat.",
    "The Republican-controlled state Legislature budgeted money for the online application system; Fetterman acknowledged that Monday.",
    "Workers in the Board of Pardons office won’t have to answer as many phone calls, emails and letters asking for status updates.",
    "Board Secretary Celeste Trusty said the change will help reform the state’s “overly punitive” criminal legal system.",
    "Taxpayers still would pick up the tab for many released inmates because they likely would rely on Medicaid.",
    "Gathering records of expunged offenses was not always easy and could be a deterrent to applying.",
    "They also won’t have to keep piles of paperwork in order and track down missing documents.",
    "Modernizing the process and making it more accessible has been a bipartisan effort.",
    "Once their penalty has been paid, they should be able to move on with their lives.",
    "Sixty-three bucks may not be much to many people, but it is a hardship for some.",
    "The advisory announcing the news conference said: “Questions for the Lt. Gov.",
    "Penalties for technical violations of parole and probation need a fresh look.",
    "If they want to apply for a pardon, that process should be reasonable, too.",
    "The requirement to include a list of expunged offenses was eliminated.",
    "But the bill would be less, saving an estimated $22 million annually.",
    "The goal of the new system is to grant decisions in a year or less.",
    "Decriminalizing marijuana is the next step that should be taken.",
    "And there should be a significant expansion of medical parole.",
    "That unfairly shut some people out of the clemency process.",
    "Pennsylvania finally is on its way toward delivering that.",
    "John Fetterman, said at a news conference Monday.",
    "Not everyone deserves a commutation or a pardon.",
    "Requests have taken years, which is too long.",
    "But they deserve a speedy response."
  ]
}