[
  {
    "id": 6709,
    "mediaId": 6571,
    "date": "2022-01-25",
    "sentence": "Meanwhile, Wolf's map shifts the heavily Democratic city of Harrisburg out of a district with York now represented by Republican Rep. <span class='selected-term'>Scott Perry</span> and into a district with Lancaster now represented by Republican Rep. Lloyd Smucker.",
    "author": "",
    "title": "Lawmakers Stalemated On Pennsylvania Congressional Map, Top Senator Says"
  },
  {
    "id": 5830,
    "mediaId": 2636,
    "date": "2022-02-02",
    "sentence": "The bills enjoy broad support — the 42 co-sponsors of Ms. Spanberger’s TRUST in Congress Act include Representatives Matt Gaetz of Florida, <span class='selected-term'>Scott Perry</span> of Pennsylvania and Andy Harris of Maryland, all firmly in the Trump wing of their party — and if anything, they are putting Ms. Pelosi in the spotlight.",
    "author": "",
    "title": "Democrats Break With Leaders Over Congressional Stock Trading"
  },
  {
    "id": 6002,
    "mediaId": 2540,
    "date": "2022-02-04",
    "sentence": "“We are all on the same page,” said Rep. <span class='selected-term'>Scott Perry</span>, a Pennsylvania Republican who chairs the group.",
    "author": "Melanie Zanona",
    "title": "McCarthy in bind as conservatives push GOP to oust Cheney in her primary"
  },
  {
    "id": 4570,
    "mediaId": 2550,
    "date": "2022-02-24",
    "sentence": "The only other Republican who is likely to face trouble in the coming years is <span class='selected-term'>Scott Perry</span> in the Harrisburg-area 10th, though he too experienced little change in his district, which goes from 51-48 Trump to 51-47.",
    "author": "",
    "title": "Morning Digest: Pennsylvania's top court picks new House map, making one Republican walk the plank"
  },
  {
    "id": 1011,
    "mediaId": 2745,
    "date": "2022-04-06",
    "sentence": "), 56 “nay” votes\nRep. Lauren Boebert (Colo.), 56 “nay” votes\nRep. Matt Gaetz (Fla.), 51 “nay” votes\nRep. <span class='selected-term'>Scott Perry</span> (Pa.), 49 “nay” votes\nRep. Mary E. Miller (Ill.), 49 “nay” votes\nRep. Clay Higgins (La.",
    "author": "",
    "title": "The House Republican ‘no’ caucus is at it again"
  },
  {
    "id": 1800,
    "mediaId": 6669,
    "date": "2022-04-06",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-Penn.)",
    "author": "Basil John",
    "title": "House Democrats and Republicans concerned about new Iran Nuclear Deal"
  },
  {
    "id": 31,
    "mediaId": 2746,
    "date": "2022-04-20",
    "sentence": "The 13th Congressional District, however, shifted in Sabato’s Crystal Ball rating from “Likely Democratic” to “Leans Democratic.”\nThe remaining lawmakers whose reelections received rating changes from the Larry Sabato’s Crystal Ball are House Republican members whose districts went from “Likely Republican” to “Safe Republican.” These members are Reps. Bill Huizenga of Michigan, Rep. Richard Hudson of North Carolina, <span class='selected-term'>Scott Perry</span> of Pennsylvania and Tony Gonzales of Texas.",
    "author": "Kerry Picket",
    "title": "Election forecasters move more than a dozen House races in GOP direction"
  }
]