[
  {
    "id": 5631,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span>, the new chairman of the conservative House Freedom Caucus, is pushing Republican leaders to gut federal agencies of what he says are partisan hacks who dominate middle management throughout Washington.",
    "author": "Kerry Picket",
    "title": "Cleanup of Washington’s partisan bureaucracy emerges as top priority for House Freedom Caucus"
  },
  {
    "id": 1867,
    "mediaId": 2658,
    "date": "2022-03-29",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.), who chairs the ultra-conservative House Freedom Caucus to which Cawthorn belongs, said he plans to speak to the North Carolina Republican one-on-one about the incendiary comment.",
    "author": "",
    "title": "Cawthorn’s orgies-and-drugs comment stirs trouble within Freedom Caucus"
  },
  {
    "id": 2308,
    "mediaId": 2687,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Cawthorn’s Orgy Comment Stirs Trouble"
  },
  {
    "id": 2451,
    "mediaId": 2644,
    "date": "2022-03-29",
    "sentence": "Freedom Caucus Chairman <span class='selected-term'>Scott Perry</span> said he plans to speak to caucus member Cawthorn about comments he made in a podcast likening the Capitol Hill culture to the Netflix series “House of Cards.”\n“I think it is important, if you’re going to say something like that, to name names,” Perry, a Pennsylvania Republican, said of Cawthorn in an interview with Politico.",
    "author": "Mark Lungariello",
    "title": "Cawthorn needs to ‘name’ orgy and coke partiers: Freedom Caucus chair"
  },
  {
    "id": 2509,
    "mediaId": 2738,
    "date": "2022-03-30",
    "sentence": "Among them are House Minority Leader Kevin McCarthy and Rep. <span class='selected-term'>Scott Perry</span>, who said that “I think it is important, if you’re going to say something like that, to name some names.” While McCarthy may hold a higher position, Perry chairs the House Freedom Caucus, to which Cawthorn belongs—at least for now.",
    "author": "Jennifer Wood",
    "title": "Madison Cawthorn’s Fellow GOP Wingnuts In The House Are Pissed About Him Blabbering About Cocaine-Fueled Orgies"
  },
  {
    "id": 2394,
    "mediaId": 5308,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> of Pennsylvania, the caucus chair, told Politico he plans to talk to Cawthorn about his claims.",
    "author": "Paul Blest",
    "title": "The Freedom Caucus Has Been Triggered by Cawthorn’s Coke and Orgies Comments"
  },
  {
    "id": 2587,
    "mediaId": 2589,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.), who chairs the ultra-conservative House Freedom Caucus to which Cawthorn belongs, said he plans to speak to the North Carolina Republican one-on-one about the incendiary comment.",
    "author": "Allahpundit",
    "title": "McCarthy rips Cawthorn: He told me his story about orgies and coke was exaggerated"
  },
  {
    "id": 1923,
    "mediaId": 2512,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-PA) (photo), who has been asked by the January 6 Committee to testify but has refused, told Politico’s Olivia Beavers, “I think it is important, if you’re going to say something like that, to name some names.”\nTuesday Beavers also reported that House Republican Minority Leader Kevin McCarthy had wanted to speak with Cawthorn about the allegations – not to start any type of investigation, but because some Republicans said they were “upset” Cawthorn made the claim.",
    "author": "David Badash",
    "title": "'Name names': House Freedom Caucus chair demands Cawthorn reveal who invited him to coke-fueled orgy parties"
  },
  {
    "id": 2263,
    "mediaId": 2601,
    "date": "2022-03-31",
    "sentence": "Freedom Caucus Chairman <span class='selected-term'>Scott Perry</span> said he plans to speak to caucus member Cawthorn about comments he made in a podcast likening the Capitol Hill culture to the Netflix series “House of Cards.”\n“I think it is important, if you’re going to say something like that, to name names,” Perry, a Pennsylvania Republican, said of Cawthorn in an interview with Politico.",
    "author": "MJA",
    "title": "Names or it didn’t happen"
  },
  {
    "id": 1004,
    "mediaId": 2662,
    "date": "2022-03-31",
    "sentence": "Freedom Caucus Chairman Rep. <span class='selected-term'>Scott Perry</span> (R-PA) said he plans to speak to Cawthorn in the near future about his allegations, the lawmaker explained to Politico.",
    "author": "Julian Conradson",
    "title": "House Freedom Caucus Members Want Madison Cawthorn to “Name Names” After Explosive DC Swamp Coke, Orgy Claims"
  },
  {
    "id": 746,
    "mediaId": 2645,
    "date": "2022-04-19",
    "sentence": "OAN Newsroom\nHouse Freedom Caucus chairman <span class='selected-term'>Scott Perry</span> (R-Pa.) says the judge who ruled against the Biden travel mandate was following the “real science.” One America’s John Hines has more from Washington.",
    "author": "",
    "title": "Judge affirms Biden ‘overstepped bounds of authority’ with travel mandates"
  }
]