[
  {
    "id": 7002,
    "mediaId": 2591,
    "date": "2022-01-20",
    "sentence": "The 30 other signatories include Reps. Ted Budd, Glenn Grothman, Jody Hice, Andy Biggs, Elise Stefanik, Doug Lamborn, Diana Harshbarger, Madison Cawthorn, Mary Miller, Mike Carey, Lauren Boebert, Chip Roy, Rodney Davis, Ralph Norman, Bill Posey, Bill Huizenga, Tom Tiffany, Andrew Clyde, Stephanie Bice, Clay Higgins, Claudia Tenney, Beth Van Duyne, <span class='selected-term'>Scott Perry</span>, Mo Brooks, David McKinley, Matt Rosendale, Paul Gosar, Byron Donalds, Nancy Mace and Jeff Duncan.",
    "author": "Human Events Staff",
    "title": "House Republicans Demand FDA Withdraw Race-Based Guidance for Monoclonal Antibodies"
  },
  {
    "id": 7127,
    "mediaId": 2580,
    "date": "2022-01-21",
    "sentence": "The 30 other signatories include Reps. Ted Budd, Glenn Grothman, Jody Hice, Andy Biggs, Elise Stefanik, Doug Lamborn, Diana Harshbarger, Madison Cawthorn, Mary Miller, Mike Carey, Lauren Boebert, Chip Roy, Rodney Davis, Ralph Norman, Bill Posey, Bill Huizenga, Tom Tiffany, Andrew Clyde, Stephanie Bice, Clay Higgins, Claudia Tenney, Beth Van Duyne, <span class='selected-term'>Scott Perry</span>, Mo Brooks, David McKinley, Matt Rosendale, Paul Gosar, Byron Donalds, Nancy Mace and Jeff Duncan.",
    "author": "",
    "title": "House Republicans Demand FDA Withdraw Race-Based Guidance for Monoclonal Antibodies"
  },
  {
    "id": 6682,
    "mediaId": 4024,
    "date": "2022-01-25",
    "sentence": "“Therefore, we the undersigned refuse to consider supporting any federal government funding vehicle, be it a continuing resolution or an omnibus appropriations measure, that funds the enforcement of COVID-19 vaccine mandates at any level of government.”\nMore than a dozen Republicans have reportedly signed on so far, including Reps. Lauren Boebert of Colorado, Paul Gosar of Arizona, Clay Higgins of Louisiana, and <span class='selected-term'>Scott Perry</span> of Pennsylvania.",
    "author": "",
    "title": "House conservatives building support to block federal funding of Biden vaccine mandates"
  },
  {
    "id": 6485,
    "mediaId": 2572,
    "date": "2022-01-25",
    "sentence": "There are already over a dozen signers, including GOP Reps. <span class='selected-term'>Scott Perry</span> of Pennsylvania, Clay Higgins of Louisiana, Paul Gosar of Arizona, and Lauren Boebert of Colorado.",
    "author": "Kelly Laco",
    "title": "Republicans consider shutting down government over vax mandate"
  },
  {
    "id": 6908,
    "mediaId": 2746,
    "date": "2022-01-30",
    "sentence": "The bill stops short of Republican proposals to enact immediate sanctions on Nord Stream 2 and instead expresses a “sense of Congress that Nord Stream 2 is a tool of the malign influence of the Russian Federation.”\nIt directs the Biden administration to “consider all available and appropriate measures to prevent the Nord Stream 2 pipeline from becoming operational,” and “to review its prior waiver of Nord Stream 2 in light of the Kremlin’s military buildup and aggression of Ukraine.”\n“If that’s the conversation we have when Russia is marching across Ukraine, I think that Vladimir Putin and Russia are going to be thrilled that that’s our conversation,” said Rep. <span class='selected-term'>Scott Perry</span>, Pennsylvania Republican and chairman of the far-right House Freedom Caucus.",
    "author": "Joseph Clark",
    "title": "Congress in push for Russia sanctions bill as Ukraine crisis grinds on"
  },
  {
    "id": 6835,
    "mediaId": 2730,
    "date": "2022-01-31",
    "sentence": "The letter was signed by Reps. Chip Roy (TX), Brian Babin (TX), Andy Biggs (AZ), <span class='selected-term'>Scott Perry</span> (PA), Mary Miller (IL), Michael Cloud (TX), and Darrell Issa (CA).",
    "author": "Julio Rosas",
    "title": "House Republicans Demand DHS Release Long-Awaited Report on Agents Falsely Accused of 'Whipping' People"
  },
  {
    "id": 6940,
    "mediaId": 2641,
    "date": "2022-01-31",
    "sentence": "\"The widespread narrative of whipping based on a demonstratable lie — especially by members of this administration — demands that the public record be finalized by publicly disclosing the 'investigative work' conducted by Customs and Border Protections' (CBP) Office of Professional Responsibility (OPR),\" Reps. Chip Roy, R-Texas; Brian Babin, R-Texas; <span class='selected-term'>Scott Perry</span>, R-Pa.; Andy Biggs, R-Ariz.; Mary Miller, R-Ill.; Michael Cloud, R-Texas, and Darrell Issa, R-Calif., noted in their letter to Secretary Mayorkas.",
    "author": "Nick Koutsobinas",
    "title": "Republicans Demand Report on CBP Agents Biden Accused of Whipping Migrants"
  },
  {
    "id": 5895,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-PA), Chairman of the House Freedom Caucus, blasted Biden immigration policies during a recent appearance on Breitbart News Saturday, noting that bureaucrats are “flying unaccompanied aliens in the dead of night right into our cities” as the Biden administration essentially forces U.S. tax dollars to go toward human trafficking.",
    "author": "Hannah Bleau",
    "title": "Poll: Majority Say Biden’s Immigration Policy ‘Worse’ than Trump’s"
  },
  {
    "id": 5474,
    "mediaId": 2572,
    "date": "2022-02-07",
    "sentence": "Other backers of Boebert's legislation include GOP Reps. Mo Brooks of Alabama, Matt Gaetz of Florida, Louie Gohmert of Texas, Lance Gooden of Texas, Paul Gosar of Arizona, Tom McClintock of California, Bill Posey of Florida, <span class='selected-term'>Scott Perry</span> of Pennsylvania, Tom Tiffany of Wisconsin and Mary Miller of Illinois.",
    "author": "Marisa Schultz",
    "title": "Boebert seeks to ban federally funded legal aid to illegal immigrants"
  },
  {
    "id": 5753,
    "mediaId": 2522,
    "date": "2022-02-07",
    "sentence": "GOP Reps. Mo Brooks of Alabama, Matt Gaetz of Florida, Louie Gohmert of Texas, Lance Gooden of Texas, Paul Gosar of Arizona, Tom McClintock of California, Bill Posey of Florida, <span class='selected-term'>Scott Perry</span> of Pennsylvania, Tom Tiffany of Wisconsin, and Mary Miller of Illinois all back Boebert’s bill.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Boebert bill seeks to end taxpayer-funded ‘free, free, free’ legal support for migrants coming to US illegally"
  },
  {
    "id": 6089,
    "mediaId": 2745,
    "date": "2022-02-09",
    "sentence": "When it became clear Rosen would not go along, either, Trump told Jeffrey Clark — who was a mid-level Justice Department official introduced to Trump by Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.) and had indicated a willingness to assist — that he would elevate him to acting attorney general.",
    "author": "",
    "title": "All the ways Trump tried to overturn the election — and how it could happen again"
  },
  {
    "id": 4824,
    "mediaId": 2526,
    "date": "2022-02-22",
    "sentence": "https://t.co/sJfnDJXgCj\n— Chip Roy (@chiproytx) February 20, 2022\nThe Freedom Caucus chair, Rep. <span class='selected-term'>Scott Perry</span> (R-PA), also condemned the event’s coronavirus rules, saying in a statement to Breitbart News, “The arbitrary and capricious rules set forth are nothing short of farce and political theater meant to deeply divide and further distract from a president who just never fails to fail.” The Pennsylvania Republican has not publicly made a decision on if he will attend.",
    "author": "Ashley Oliver",
    "title": "Cotton, Rubio Among Those Planning to Boycott Joe Biden’s State of the Union"
  },
  {
    "id": 4616,
    "mediaId": 2658,
    "date": "2022-02-23",
    "sentence": "Two are held by GOP Reps. Brian Fitzpatrick and <span class='selected-term'>Scott Perry</span>, another two are held by Democratic Reps. Susan Wild and Matt Cartwright, and a fifth swing district is the open Pittsburgh-area seat that Democratic Rep. Conor Lamb is vacating to run for Senate.",
    "author": "",
    "title": "State courts shake up Pennsylvania, North Carolina with new House lines"
  },
  {
    "id": 4919,
    "mediaId": 6621,
    "date": "2022-02-23",
    "sentence": "Failure to comply with the measures comes with a warning: “failure to follow guidelines or removal of the mask in the House Chamber will result in the attendee’s removal from the event and/or fines.”\nFreedom Caucus chair, Rep. <span class='selected-term'>Scott Perry</span> (R-PA), condemned the event’s coronavirus rules, but has yet to confirm if he will be attending or not.",
    "author": "",
    "title": "BOYCOTTING BIDEN’S STATE OF THE UNION: Rubio, Cotton, More Skipping Due to ‘COVID Theater’"
  },
  {
    "id": 4854,
    "mediaId": 2564,
    "date": "2022-02-24",
    "sentence": "'As we pray for the Ukrainian people, make no mistake: THIS is what happens when America’s enemies see a weak and incompetent @POTUS,' tweeted U.S. Rep. <span class='selected-term'>Scott Perry</span>, adding the hashtag Bidenisafailure.",
    "author": "",
    "title": "Republican Senator Josh Hawley says Biden 'emboldened' Putin to do 'whatever he wants' by 'shutting down' American energy production and says he is 'unfit' to be in office"
  },
  {
    "id": 5024,
    "mediaId": 2564,
    "date": "2022-02-24",
    "sentence": "'America's incompetent right now,' said TV host Ben Ferguson as he warned that adversaries were taking advantage\n+19\nView gallery\nFormer President Trump called into Fox News on Wednesday to claim the attack would not have happened on his watch\nRep <span class='selected-term'>Scott Perry</span> was among the Republicans who took to Twitter to blast Biden for Putin's aggression in Ukraine\nOthers warned that America's allies were watching what was unfolding and see American weakness on the world stage\n+19\nView gallery\nA steady stream of Republicans tweeted their anger at Biden and warned that the country's enemies would be watching.",
    "author": "Morgan Phillips",
    "title": "Republicans criticize Biden for admitting he 'knew' about Russia's invasion of Ukraine for months but still 'did nothing' and not sanctioning Putin personally is a 'big mistake'"
  },
  {
    "id": 4638,
    "mediaId": 2551,
    "date": "2022-02-24",
    "sentence": "'America's incompetent right now,' said TV host Ben Ferguson as he warned that adversaries were taking advantage\n+20\nView gallery\nFormer President Trump called into Fox News on Wednesday to claim the attack would not have happened on his watch\n+20\nView gallery\nRep <span class='selected-term'>Scott Perry</span> was among the Republicans who took to Twitter to blast Biden for Putin's aggression in Ukraine\n+20\nView gallery\nOthers warned that America's allies were watching what was unfolding and see American weakness on the world stage\n+20\nView gallery\nA steady stream of Republicans tweeted their anger at Biden and warned that the country's enemies would be watching.",
    "author": "",
    "title": "'This is what happens when America’s enemies see a weak and incompetent President': Scores of Republicans join calls that Biden is 'unfit' and responsible for letting Putin invade Ukraine"
  },
  {
    "id": 4570,
    "mediaId": 2550,
    "date": "2022-02-24",
    "sentence": "The only other Republican who is likely to face trouble in the coming years is <span class='selected-term'>Scott Perry</span> in the Harrisburg-area 10th, though he too experienced little change in his district, which goes from 51-48 Trump to 51-47.",
    "author": "",
    "title": "Morning Digest: Pennsylvania's top court picks new House map, making one Republican walk the plank"
  },
  {
    "id": 4700,
    "mediaId": 2551,
    "date": "2022-02-24",
    "sentence": "'America's incompetent right now,' said TV host Ben Ferguson as he warned that adversaries were taking advantage\n+19\nView gallery\nFormer President Trump called into Fox News on Wednesday to claim the attack would not have happened on his watch\nRep <span class='selected-term'>Scott Perry</span> was among the Republicans who took to Twitter to blast Biden for Putin's aggression in Ukraine\nOthers warned that America's allies were watching what was unfolding and see American weakness on the world stage\n+19\nView gallery\nA steady stream of Republicans tweeted their anger at Biden and warned that the country's enemies would be watching.",
    "author": "Morgan Phillips",
    "title": "Republicans criticize Biden for admitting he 'knew' about Russia's invasion of Ukraine for months but still 'did nothing' and not sanctioning Putin personally is a 'big mistake'"
  },
  {
    "id": 3642,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "ORLANDO, Fla. – Republican Rep. <span class='selected-term'>Scott Perry</span> said it is \"not too late\" for the Biden administration to \"show some strength\" with regard to China's ambitions in Taiwan amid concerns that Beijing has been emboldened by Russian aggression in Ukraine.",
    "author": "Brooke Singman",
    "title": "GOP Rep. Perry says 'not too late' for Biden admin to prevent Chinese attack on Taiwan amid Russia-Ukraine"
  },
  {
    "id": 4134,
    "mediaId": 2641,
    "date": "2022-03-07",
    "sentence": "The United States must start putting its natural gas and oil onto the market not only to stop funding Russian President Vladimir Putin's war machine but also to help bring down prices and help Americans, Rep. <span class='selected-term'>Scott Perry</span>, R-Pa., told Newsmax on Monday.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Scott Perry to Newsmax: US Must Produce Oil to Stop Putin, Help Americans"
  },
  {
    "id": 2808,
    "mediaId": 2526,
    "date": "2022-03-10",
    "sentence": "[Emphasis added]\nReps. Ted Budd (R-NC), Paul Gosar (R-AZ), <span class='selected-term'>Scott Perry</span> (R-PA), Mary Miller (R-IL), Louie Gohmert (R-TX), Matt Gaetz (R-FL), Madison Cawthorn (R-NC), Brian Babin (R-TX), Randy Weber (R-TX), Jeff Duncan (R-SC), Rodney Davis (R-IL), Lauren Boebert (R-CO), Andrew Garbarino (R-NY), Dan Bishop (R-NC), and Ralph Norman (R-SC) are co-sponsoring the legislation.",
    "author": "John Binder",
    "title": "House Conservatives Challenge Joe Biden to Declare MS-13 Gang a ‘Foreign Terrorist Organization’"
  },
  {
    "id": 2999,
    "mediaId": 2748,
    "date": "2022-03-11",
    "sentence": "[Emphasis added]\nReps. Ted Budd (R-NC), Paul Gosar (R-AZ), <span class='selected-term'>Scott Perry</span> (R-PA), Mary Miller (R-IL), Louie Gohmert (R-TX), Matt Gaetz (R-FL), Madison Cawthorn (R-NC), Brian Babin (R-TX), Randy Weber (R-TX), Jeff Duncan (R-SC), Rodney Davis (R-IL), Lauren Boebert (R-CO), Andrew Garbarino (R-NY), Dan Bishop (R-NC), and Ralph Norman (R-SC) are co-sponsoring the legislation.",
    "author": "Blarp Blog",
    "title": "House Conservatives Challenge Joe Biden to Declare MS-13 Gang a ‘Foreign Terrorist Organization’"
  },
  {
    "id": 2369,
    "mediaId": 2574,
    "date": "2022-03-28",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R., Pa.), a member of the House Foreign Affairs Committee, and six of his congressional colleagues are requesting that VOA and its Persian News Network turn over all internal documents and communications related to its decision to rehire Setareh Derakhshesh Sieg to lead the agency's Iran coverage.",
    "author": "Adam Kredo",
    "title": "Republicans Investigate VOA for Biased Coverage of Iran, Advocacy for Biden"
  },
  {
    "id": 1983,
    "mediaId": 2641,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span>, R-Pa., is the U.S. congressman for Pennsylvania's 10th congressional district.",
    "author": "Rep. Scott Perry",
    "title": "Rep. Perry: Time for US to Rediscover 'Peace Through Strength' and 'Trust but Verify'"
  },
  {
    "id": 1277,
    "mediaId": 2574,
    "date": "2022-04-04",
    "sentence": "Reps. Brian Mast (R., Fla.) and <span class='selected-term'>Scott Perry</span> (R., Pa.) introduced on Monday the Preventing Terror Sympathizers from Appeasing Terrorists Act, a bill that would block the White House from delisting the IRGC from the Foreign Terrorist Organizations (FTO) list without congressional approval.",
    "author": "Adam Kredo",
    "title": "Republicans Want To Bar Biden Admin From Lifting Sanctions on Iran-Sponsored Terrorists"
  },
  {
    "id": 1008,
    "mediaId": 2641,
    "date": "2022-04-05",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span>, R-Pa., told Newsmax on Tuesday that President Biden is burning the economy down while “people are scrambling for their lives to try to afford the prices at the pump and across the supply chain spectrum.”\nDuring an appearance on “Stinchfield,” the Pennsylvania congressman compared Biden’s record on energy policy to a “pyromaniac that works at the fire company.”\n“The first thing he did on day one is set the fire by canceling the Keystone [XL] pipeline,” Perry said.",
    "author": "Luca Cacciatore",
    "title": "Rep. Scott Perry to Newsmax: Biden Is Burning the Economy Down"
  },
  {
    "id": 1516,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Voters can still save the country, but Democrats have to help them\nDaily Kos' The Brief\nFollowShare\n0:0058:38\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nA quick search for the legislation revealed those 10 lawmakers’ names: Rep. August Pfluger of Texas, Rep. Jake Ellzey of Texas, Rep. Brian Mast of Florida, Rep. Alexander Mooney of West Virginia, Rep. Adrian Smith of Nebraska, Rep. Tom McClintock of California, Rep. Yvette Herrell of New Mexico, Rep. Jefferson Van Drew of New Jersey, Rep. <span class='selected-term'>Scott Perry</span> of Pennsylvania, and Rep.",
    "author": "",
    "title": "GOP introduces bill forbidding Biden from potentially declaring climate change the threat that it is"
  },
  {
    "id": 739,
    "mediaId": 2522,
    "date": "2022-04-13",
    "sentence": "It was also signed by Reps. Andy Biggs of Arizona, Jeff Duncan and Ralph Norman of South Carolina, Mary Miller of Illinois, Chip Roy and Michael Cloud of Texas, Dan Bishop of North Carolina, <span class='selected-term'>Scott Perry</span> of Pennsylvania, Marjorie Taylor Greene and Jody Hice of Georgia, Tom Tiffany of Wisconsin, Ken Buck of Colorado, Matt Gaetz of Florida, and Vicky Hartzler of Missouri.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Joe Bidens’ sister bristles when Chris Wallace dares to ask about Hunter’s ‘troubled’ life"
  },
  {
    "id": 746,
    "mediaId": 2645,
    "date": "2022-04-19",
    "sentence": "OAN Newsroom\nHouse Freedom Caucus chairman <span class='selected-term'>Scott Perry</span> (R-Pa.) says the judge who ruled against the Biden travel mandate was following the “real science.” One America’s John Hines has more from Washington.",
    "author": "",
    "title": "Judge affirms Biden ‘overstepped bounds of authority’ with travel mandates"
  },
  {
    "id": 280,
    "mediaId": 2548,
    "date": "2022-04-21",
    "sentence": "Read the letter here:\nPennsylvania Rep. <span class='selected-term'>Scott Perry</span>, Florida Rep. Bill Posey, and Texas Rep. Randy Weber also signed the letter.",
    "author": "",
    "title": "EXCLUSIVE: House Republicans Call On Biden Admin To End Rule Causing Higher Gas, Corn Prices"
  }
]