[
  {
    "id": 3834,
    "mediaId": 2732,
    "date": "2022-02-28",
    "sentence": "U.S. Rep. <span class='selected-term'>Scott Perry</span> has just vanquished one major potential foe in his quest for a 6th term in Congress, as former Pennsylvania Auditor General Eugene DePasquale has decided not to seek a rematch of their 2020 race.",
    "author": "",
    "title": "Eugene DePasquale will not oppose U.S. Rep. Scott Perry in the 10th Congressional District race"
  },
  {
    "id": 4134,
    "mediaId": 2641,
    "date": "2022-03-07",
    "sentence": "The United States must start putting its natural gas and oil onto the market not only to stop funding Russian President Vladimir Putin's war machine but also to help bring down prices and help Americans, Rep. <span class='selected-term'>Scott Perry</span>, R-Pa., told Newsmax on Monday.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Scott Perry to Newsmax: US Must Produce Oil to Stop Putin, Help Americans"
  },
  {
    "id": 2587,
    "mediaId": 2589,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.), who chairs the ultra-conservative House Freedom Caucus to which Cawthorn belongs, said he plans to speak to the North Carolina Republican one-on-one about the incendiary comment.",
    "author": "Allahpundit",
    "title": "McCarthy rips Cawthorn: He told me his story about orgies and coke was exaggerated"
  },
  {
    "id": 1008,
    "mediaId": 2641,
    "date": "2022-04-05",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span>, R-Pa., told Newsmax on Tuesday that President Biden is burning the economy down while “people are scrambling for their lives to try to afford the prices at the pump and across the supply chain spectrum.”\nDuring an appearance on “Stinchfield,” the Pennsylvania congressman compared Biden’s record on energy policy to a “pyromaniac that works at the fire company.”\n“The first thing he did on day one is set the fire by canceling the Keystone [XL] pipeline,” Perry said.",
    "author": "Luca Cacciatore",
    "title": "Rep. Scott Perry to Newsmax: Biden Is Burning the Economy Down"
  }
]