[
  {
    "id": 2808,
    "mediaId": 2526,
    "date": "2022-03-10",
    "sentence": "[Emphasis added]\nReps. Ted Budd (R-NC), Paul Gosar (R-AZ), <span class='selected-term'>Scott Perry</span> (R-PA), Mary Miller (R-IL), Louie Gohmert (R-TX), Matt Gaetz (R-FL), Madison Cawthorn (R-NC), Brian Babin (R-TX), Randy Weber (R-TX), Jeff Duncan (R-SC), Rodney Davis (R-IL), Lauren Boebert (R-CO), Andrew Garbarino (R-NY), Dan Bishop (R-NC), and Ralph Norman (R-SC) are co-sponsoring the legislation.",
    "author": "John Binder",
    "title": "House Conservatives Challenge Joe Biden to Declare MS-13 Gang a ‘Foreign Terrorist Organization’"
  },
  {
    "id": 2999,
    "mediaId": 2748,
    "date": "2022-03-11",
    "sentence": "[Emphasis added]\nReps. Ted Budd (R-NC), Paul Gosar (R-AZ), <span class='selected-term'>Scott Perry</span> (R-PA), Mary Miller (R-IL), Louie Gohmert (R-TX), Matt Gaetz (R-FL), Madison Cawthorn (R-NC), Brian Babin (R-TX), Randy Weber (R-TX), Jeff Duncan (R-SC), Rodney Davis (R-IL), Lauren Boebert (R-CO), Andrew Garbarino (R-NY), Dan Bishop (R-NC), and Ralph Norman (R-SC) are co-sponsoring the legislation.",
    "author": "Blarp Blog",
    "title": "House Conservatives Challenge Joe Biden to Declare MS-13 Gang a ‘Foreign Terrorist Organization’"
  },
  {
    "id": 2419,
    "mediaId": 2748,
    "date": "2022-03-19",
    "sentence": "The letter is also signed by 17 other House Republicans, including Reps. Brian Mast, Thomas Massie, Matt Gaetz, Paul Gosar, Mary E. Miller, Randy Weber, John Moolenaar, Lauren Boebert, Matthew Rosendale, Bob Good, Ralph Norman, Andy Biggs, Barry Moore, <span class='selected-term'>Scott Perry</span>, Mo Brooks, Jody Hice, and Rodney Davis.",
    "author": "Blarp Blog",
    "title": "Exclusive — Chip Roy: Air Force Mandating Wounded Warriors to Be Vaccinated"
  },
  {
    "id": 739,
    "mediaId": 2522,
    "date": "2022-04-13",
    "sentence": "It was also signed by Reps. Andy Biggs of Arizona, Jeff Duncan and Ralph Norman of South Carolina, Mary Miller of Illinois, Chip Roy and Michael Cloud of Texas, Dan Bishop of North Carolina, <span class='selected-term'>Scott Perry</span> of Pennsylvania, Marjorie Taylor Greene and Jody Hice of Georgia, Tom Tiffany of Wisconsin, Ken Buck of Colorado, Matt Gaetz of Florida, and Vicky Hartzler of Missouri.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Joe Bidens’ sister bristles when Chris Wallace dares to ask about Hunter’s ‘troubled’ life"
  }
]