[
  {
    "id": 6481,
    "mediaId": 2590,
    "date": "2022-01-12",
    "sentence": "Both have received endorsements from Trump, who also backed Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a Republican who was present at the Jan. 6 insurrection and is now running for secretary of state.",
    "author": "Travis Waldron",
    "title": "GOP Election Deniers Are On Pace To Raise Record Sums For Secretary Of State Races"
  },
  {
    "id": 7007,
    "mediaId": 2540,
    "date": "2022-01-26",
    "sentence": "In Arizona, another Trump-endorsed candidate, <span class='selected-term'>Mark Finchem</span>, is also running for secretary of state.",
    "author": "Kyung Lah and Anna-Maja Rappard",
    "title": "2020 sore losers look to run the 2024 vote"
  },
  {
    "id": 6954,
    "mediaId": 2636,
    "date": "2022-01-30",
    "sentence": "The significance of the America First coalition’s parallel efforts can be seen clearly in Arizona, where the slate’s candidate is <span class='selected-term'>Mark Finchem</span>, a former firefighter and real estate agent who has served in the state House since 2015 and has become the leading Republican contender for secretary of state.",
    "author": "",
    "title": "Campaigning to Oversee Elections, While Denying the Last One"
  },
  {
    "id": 6720,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates -- gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> -- who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "Eric Bradner",
    "title": "Trump's PAC gave $1 million to Meadows' non-profit weeks after House formed January 6 committee"
  },
  {
    "id": 6621,
    "mediaId": 2707,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates — gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> — who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "Cnn Com",
    "title": "After Jan. 6 panel formed, Trump PAC gave to Meadows’ org."
  },
  {
    "id": 5686,
    "mediaId": 2512,
    "date": "2022-02-07",
    "sentence": "Trump is also backing state Rep. <span class='selected-term'>Mark Finchem</span> in his campaign against Hobbs as secretary of state in Arizona, which Trump lost to Biden by fewer than 11,000 votes.",
    "author": "",
    "title": "'Clear line for election subversion': More than 80 Trump-truther candidates are running for key state offices"
  },
  {
    "id": 5609,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Trump is also backing state Rep. <span class='selected-term'>Mark Finchem</span> in his campaign against Hobbs as secretary of state in Arizona, which Trump lost to Biden by fewer than 11,000 votes.",
    "author": "Igor Derysh",
    "title": "More than 80 Trump truthers are aiming for a power grab"
  },
  {
    "id": 3959,
    "mediaId": 2745,
    "date": "2022-02-28",
    "sentence": "And that’s a great way to lose the election and not ever make a difference.”\nRepublican <span class='selected-term'>Mark Finchem</span>, who was at the Jan. 6, 2021, protest in D.C., has raised nearly $700,000 in his campaign to be Arizona’s secretary of state.",
    "author": "David Montgomery",
    "title": "Who Wants to be a State Secretary of State? Everyone."
  },
  {
    "id": 2533,
    "mediaId": 2710,
    "date": "2022-03-25",
    "sentence": "",
    "author": "",
    "title": "Keith Mines: To protect democracy we must protect our institutions"
  },
  {
    "id": 1202,
    "mediaId": 2664,
    "date": "2022-04-01",
    "sentence": "In Arizona, Trump is backing state Rep. <span class='selected-term'>Mark Finchem</span> for Secretary of State.",
    "author": "Bob Brigham",
    "title": "Georgia GOP is ‘legislating based on conspiracy theories and lies’: Washington Post editorial board"
  },
  {
    "id": 273,
    "mediaId": 5308,
    "date": "2022-04-22",
    "sentence": "So Madison Cawthorn, Marjorie Taylor Greene, Paul Gosar, Andy Biggs, and [Arizona State Rep.] <span class='selected-term'>Mark Finchem</span> are all involved in more than just a vote inside the House chamber.",
    "author": "Todd Zwillich",
    "title": "‘Insurrectionist’ Marjorie Taylor Greene Goes Under Oath Today"
  }
]