[
  {
    "id": 5686,
    "mediaId": 2512,
    "date": "2022-02-07",
    "sentence": "Trump is also backing state Rep. <span class='selected-term'>Mark Finchem</span> in his campaign against Hobbs as secretary of state in Arizona, which Trump lost to Biden by fewer than 11,000 votes.",
    "author": "",
    "title": "'Clear line for election subversion': More than 80 Trump-truther candidates are running for key state offices"
  },
  {
    "id": 5609,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Trump is also backing state Rep. <span class='selected-term'>Mark Finchem</span> in his campaign against Hobbs as secretary of state in Arizona, which Trump lost to Biden by fewer than 11,000 votes.",
    "author": "Igor Derysh",
    "title": "More than 80 Trump truthers are aiming for a power grab"
  },
  {
    "id": 3959,
    "mediaId": 2745,
    "date": "2022-02-28",
    "sentence": "And that’s a great way to lose the election and not ever make a difference.”\nRepublican <span class='selected-term'>Mark Finchem</span>, who was at the Jan. 6, 2021, protest in D.C., has raised nearly $700,000 in his campaign to be Arizona’s secretary of state.",
    "author": "David Montgomery",
    "title": "Who Wants to be a State Secretary of State? Everyone."
  },
  {
    "id": 1202,
    "mediaId": 2664,
    "date": "2022-04-01",
    "sentence": "In Arizona, Trump is backing state Rep. <span class='selected-term'>Mark Finchem</span> for Secretary of State.",
    "author": "Bob Brigham",
    "title": "Georgia GOP is ‘legislating based on conspiracy theories and lies’: Washington Post editorial board"
  },
  {
    "id": 802,
    "mediaId": 2634,
    "date": "2022-04-15",
    "sentence": "To replace Hobbs, Donald Trump favors state Representative <span class='selected-term'>Mark Finchem</span>, whom Trump has praised for “his incredibly powerful stance on the massive Voter Fraud that took place in the 2020 Presidential Election Scam.”\nGeorgia\nGovernor: Brian Kemp, a Republican, is up for reelection in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: Controlled by a conservative majority\nElections administered by the secretary of state, with significant legislative influence\nOther key players: Stacey Abrams, a Democrat\nCan they steal it?",
    "author": "Matt Ford",
    "title": "The Six States That Could Determine Whether Republicans Steal the 2024 Election"
  }
]