[
  {
    "id": 6481,
    "mediaId": 2590,
    "date": "2022-01-12",
    "sentence": "Both have received endorsements from Trump, who also backed Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a Republican who was present at the Jan. 6 insurrection and is now running for secretary of state.",
    "author": "Travis Waldron",
    "title": "GOP Election Deniers Are On Pace To Raise Record Sums For Secretary Of State Races"
  },
  {
    "id": 6710,
    "mediaId": 6746,
    "date": "2022-01-17",
    "sentence": "The Saturday event had Arizona state Representative <span class='selected-term'>Mark Finchem</span> address the audience as a \"special guest speaker.\"",
    "author": "Renz Soliman",
    "title": "Trump Supporters Believe Deceased JFK Jr. Is 'Coming Back' To Be Former President's VP"
  },
  {
    "id": 6458,
    "mediaId": 2578,
    "date": "2022-01-19",
    "sentence": "— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) January 14, 2022 The gates opened at 8 am, and already there are thousands of patriots waiting for the rally to begin at 4:30 pm MST.",
    "author": "Jordan Conradson",
    "title": "AZ State Rep. Mark Finchem Speaks At Save America Rally: “The Arizona Election Should Be DECERTIFIED With Cause By The Legislature”"
  },
  {
    "id": 6557,
    "mediaId": 2605,
    "date": "2022-01-24",
    "sentence": "On Jan. 6, 2021, Arizona lawmaker <span class='selected-term'>Mark Finchem</span> — a practiced peddler of nutso conspiracy theories — stood outside the U.S. Capitol and tweeted his support for the mob seeking to overturn Joe Biden’s victory.",
    "author": "",
    "title": "Column: If you think 2020 chaos was bad, imagine if Trump was put in charge of elections"
  },
  {
    "id": 6719,
    "mediaId": 2550,
    "date": "2022-01-24",
    "sentence": "The emails show involvement by numerous MAGA crew, including <span class='selected-term'>Mark Finchem</span>, a candidate for secretary of State in Arizona, which is terrifying because should he win, he would oversee elections in Arizona.",
    "author": "Rebekah Sager",
    "title": "Newly uncovered MAGA emails show a sinister conspiracy to refute Biden's win and bestow it on Trump"
  },
  {
    "id": 6662,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "Fontes, a Democrat who is now running for secretary of state, issued a statement earlier this month supporting an identical proposal sponsored in the House by Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jeremy Duda",
    "title": "Lies about the 2020 election propel Arizona bills aimed at combating non-existent fraud"
  },
  {
    "id": 7060,
    "mediaId": 2627,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "In Trump’s honor, Arizona Republicans approve conspiracy-based election bills"
  },
  {
    "id": 7007,
    "mediaId": 2540,
    "date": "2022-01-26",
    "sentence": "In Arizona, another Trump-endorsed candidate, <span class='selected-term'>Mark Finchem</span>, is also running for secretary of state.",
    "author": "Kyung Lah and Anna-Maja Rappard",
    "title": "2020 sore losers look to run the 2024 vote"
  },
  {
    "id": 6456,
    "mediaId": 2590,
    "date": "2022-01-28",
    "sentence": "Other QAnon-supporting, pro-Trump personalties are also expected to attend, including <span class='selected-term'>Mark Finchem</span>, the Arizona state lawmaker running for Arizona secretary of state.",
    "author": "Josephine Harvey",
    "title": "Texas Butterfly Sanctuary Closes Due To 'Credible Threats' From Pro-Trump Event"
  },
  {
    "id": 6618,
    "mediaId": 2584,
    "date": "2022-01-29",
    "sentence": "One of the co-sponsors of the bill is <span class='selected-term'>Mark Finchem</span>, a state representative who believes the 2020 election was stolen, has ties to the Oath Keepers, and was at the Capitol on 6 January.",
    "author": "Sam Levine",
    "title": "Arizona Republicans introduce election subversion bill"
  },
  {
    "id": 6954,
    "mediaId": 2636,
    "date": "2022-01-30",
    "sentence": "The significance of the America First coalition’s parallel efforts can be seen clearly in Arizona, where the slate’s candidate is <span class='selected-term'>Mark Finchem</span>, a former firefighter and real estate agent who has served in the state House since 2015 and has become the leading Republican contender for secretary of state.",
    "author": "",
    "title": "Campaigning to Oversee Elections, While Denying the Last One"
  },
  {
    "id": 6975,
    "mediaId": 6435,
    "date": "2022-01-31",
    "sentence": "The significance of the America First coalition’s parallel efforts can be seen clearly in Arizona, where the slate’s candidate is <span class='selected-term'>Mark Finchem</span>, a former firefighter and real estate agent who has served in the state House since 2015 and has become the leading Republican contender for secretary of state.",
    "author": "Jennifer Medina",
    "title": "Campaigning to oversee elections, while denying the last one: Partisan candidates are transforming races for secretary of state"
  },
  {
    "id": 6546,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "Four days later, Lake and <span class='selected-term'>Mark Finchem</span> appeared with Trump and spoke to thousands of his supporters in Florence, Arizona.",
    "author": "",
    "title": "Now every day in Arizona is January 6"
  },
  {
    "id": 6480,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "The bill already has 15 Republican co-sponsors, including state Rep. <span class='selected-term'>Mark Finchem</span>, the Trump-endorsed secretary of state candidate seeking to take over the state's elections.",
    "author": "",
    "title": "Arizona bills embrace Trump conspiracy theories — could allow GOP to reject election results"
  },
  {
    "id": 6984,
    "mediaId": 2630,
    "date": "2022-02-01",
    "sentence": "For example, Trump gave $5,000 to Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a secretary of state candidate who has called for the decertification of the 2020 election, and a matching amount to Rep. Jody Hice, R-Ga., who voted against certifying the election and is now running for secretary of state in Georgia.",
    "author": "",
    "title": "Trump gave $1M to Meadows nonprofit weeks after Jan. 6 panel's creation"
  },
  {
    "id": 6720,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates -- gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> -- who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "Eric Bradner",
    "title": "Trump's PAC gave $1 million to Meadows' non-profit weeks after House formed January 6 committee"
  },
  {
    "id": 6621,
    "mediaId": 2707,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates — gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> — who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "Cnn Com",
    "title": "After Jan. 6 panel formed, Trump PAC gave to Meadows’ org."
  },
  {
    "id": 6705,
    "mediaId": 2664,
    "date": "2022-02-01",
    "sentence": "Dan Patrick, Senate candidate Herschel Walker and two candidates for secretary of state, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> and Rep. Jody Hice (R-GA) -- in the final half of 2021, according to a campaign finance report filed with the Federal Election Commission.",
    "author": "Travis Gettys",
    "title": "Trump super PAC gave $1 million to Mark Meadows nonprofit just after Jan. 6 panel created"
  },
  {
    "id": 5708,
    "mediaId": 2643,
    "date": "2022-02-04",
    "sentence": "Among the Republicans who attended John Sabal's Patriot Voice event, were Arizona State Senator Wendy Rogers and Arizona State Representative <span class='selected-term'>Mark Finchem</span>, both of whom continue to push the baseless claim that the 2020 election was stolen.",
    "author": "Anders Anglesey",
    "title": "QAnon in 2022: Conspiracy Followers Focus on Controlling Elections and School Boards"
  },
  {
    "id": 5686,
    "mediaId": 2512,
    "date": "2022-02-07",
    "sentence": "Trump is also backing state Rep. <span class='selected-term'>Mark Finchem</span> in his campaign against Hobbs as secretary of state in Arizona, which Trump lost to Biden by fewer than 11,000 votes.",
    "author": "",
    "title": "'Clear line for election subversion': More than 80 Trump-truther candidates are running for key state offices"
  },
  {
    "id": 5609,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Trump is also backing state Rep. <span class='selected-term'>Mark Finchem</span> in his campaign against Hobbs as secretary of state in Arizona, which Trump lost to Biden by fewer than 11,000 votes.",
    "author": "Igor Derysh",
    "title": "More than 80 Trump truthers are aiming for a power grab"
  },
  {
    "id": 5586,
    "mediaId": 2662,
    "date": "2022-02-08",
    "sentence": "— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 7, 2022\nAnd also on Monday video proof was released of Maricopa County election workers deleting “archived” files from servers before delivery to state auditors — a criminal offense.",
    "author": "Jordan Conradson",
    "title": "BREAKING – President Trump: “They Are So Desperate To Hide The Truth, They’ll Make It Criminal To Speak It!”"
  },
  {
    "id": 5945,
    "mediaId": 2605,
    "date": "2022-02-08",
    "sentence": "He has brought Georgia Rep. Jody Hice and Arizona state Rep. <span class='selected-term'>Mark Finchem</span> onstage to speak at recent rallies.",
    "author": "Arit John",
    "title": "State election officials survived Trump’s attacks. Will they survive the ballot box?"
  },
  {
    "id": 6058,
    "mediaId": 2664,
    "date": "2022-02-09",
    "sentence": "The bill was introduced Monday by right-wing Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a Trump-endorsed candidate for secretary of state.",
    "author": "John Wright",
    "title": "‘This is what we’ve been waiting for!’: Mike Lindell celebrates doomed Arizona decertification bill"
  },
  {
    "id": 5911,
    "mediaId": 2688,
    "date": "2022-02-09",
    "sentence": "Within hours of Arizona state Rep. <span class='selected-term'>Mark Finchem</span> (R) introducing his bill to “decertify” and “set aside” the 2020 election results in three of Arizona’s largest counties, two things happened.",
    "author": "Matt Shuham",
    "title": "Trump-Endorsed Arizona Secretary of State Candidate Has A Show Bill To ‘Decertify’ 2020"
  },
  {
    "id": 5944,
    "mediaId": 2594,
    "date": "2022-02-10",
    "sentence": "She also has pledged – if elected – to direct the state’s office of Attorney General to open a criminal investigation into the election, including seizing “all election material, all election equipment, and he should start questioning people immediately.”\nThe leading GOP candidate for Arizona’s secretary of state, state representative <span class='selected-term'>Mark Finchem</span>, filed legislation this week to decertify the state’s 2020 election results, baselessly asserting that “illegal acts occurred” and that the outcome is “irredeemably compromised, and it is impossible to name a clear winner of the contest.”\nHis fundraising has outpaced the two leading Democratic candidates combined.",
    "author": "Alex Woodward",
    "title": "They wanted to overturn 2020 election results. Now these candidates want to run the next elections"
  },
  {
    "id": 5661,
    "mediaId": 2660,
    "date": "2022-02-11",
    "sentence": "If Your Time is short\nArizona State Rep. <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state with Donald Trump’s backing, proposed a resolution that would decertify the 2020 election results from three counties.",
    "author": "Amy Sherman",
    "title": "GOP lawmaker’s proposal to decertify Arizona election won’t change anything about 2020"
  },
  {
    "id": 5777,
    "mediaId": 2636,
    "date": "2022-02-11",
    "sentence": "“Not since Hitler himself have we seen evil come across the country,” said <span class='selected-term'>Mark Finchem</span>, an Arizona lawmaker who is running for secretary of state there.",
    "author": "",
    "title": "The Traveling Trump Show"
  },
  {
    "id": 5241,
    "mediaId": 6509,
    "date": "2022-02-14",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 Panel Subpoenas 6 More in Fake GOP Electors Scheme"
  },
  {
    "id": 5175,
    "mediaId": 6511,
    "date": "2022-02-15",
    "sentence": "La nueva ola de objetivos de citaciones incluye a Kelli Ward, presidenta del Partido Republicano de Arizona, además de dos candidatos políticos republicanos en estados indecisos: el senador estatal Doug Mastriano es candidato a gobernador de Pennsylvania y el representante estatal <span class='selected-term'>Mark Finchem</span> se postula para ser el próximo secretario de estado en Arizona.",
    "author": "",
    "title": "Comité que investiga el asalto al Capitolio cita a supuestos “electores suplentes” de Trump"
  },
  {
    "id": 5122,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 16, 2022\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThis sham investigation is targeting Rep. Mark Finchem and Chairwoman Ward because the BIG LIE is finally unfolding in Arizona.",
    "author": "Jordan Conradson",
    "title": "Liz Cheney’s Jan 6 Committee Subpoenas Arizona State Rep. Mark Finchem and Arizona GOP Chairwoman Kelli Ward"
  },
  {
    "id": 5103,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "It also issued them to four officials in states carried by President Joe Biden as he defeated Republican Trump's bid for re-election: Douglas Mastriano, a state senator in Pennsylvania; Laura Cox, a former member of the Michigan House of Representatives and chair of the state Republican party; <span class='selected-term'>Mark Finchem</span>, an Arizona state senator; and Kelli Ward, a former Arizona state senator and chair of the state Republican party.",
    "author": "",
    "title": "Jan. 6 Panel Issues 6 Subpoenas in 'Alternate Elector' Probe"
  },
  {
    "id": 4922,
    "mediaId": 2728,
    "date": "2022-02-15",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 panel subpoenas 6 more in fake GOP electors scheme"
  },
  {
    "id": 4886,
    "mediaId": 2594,
    "date": "2022-02-15",
    "sentence": "Two Republican state lawmakers — Pennsylvania senator Doug Mastriano and Arizona senator <span class='selected-term'>Mark Finchem</span> — also received subpoenas from Mr Thompson on Monday.",
    "author": "Andrew Feinberg",
    "title": "Capitol riot committee subpoenas Trump campaign officials and state lawmakers involved in sham elector plot"
  },
  {
    "id": 4921,
    "mediaId": 2707,
    "date": "2022-02-15",
    "sentence": "The subpoena list also includes Republican state lawmakers from Pennsylvania and Arizona — Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively — as well as Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP.",
    "author": "Cnn Com",
    "title": "Jan. 6 panel issues more subpoenas in fake electors scheme"
  },
  {
    "id": 4744,
    "mediaId": 2523,
    "date": "2022-02-15",
    "sentence": "The subpoena list also includes Republican state lawmakers from Pennsylvania and Arizona — Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively — as well as Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP.",
    "author": "Cnn Com",
    "title": "Jan. 6 panel issues more subpoenas in fake electors scheme"
  },
  {
    "id": 4800,
    "mediaId": 2631,
    "date": "2022-02-15",
    "sentence": "The panel also issued a subpoena Tuesday to <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state in Arizona and has been endorsed by Trump.",
    "author": "",
    "title": "New subpoenas from Jan. 6 committee target 'alternate elector' organizers"
  },
  {
    "id": 4738,
    "mediaId": 2643,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Aaron McDade",
    "title": "Jan. 6 Committee Sends 6 New Subpoenas Focused on Fake Trump Electors"
  },
  {
    "id": 4685,
    "mediaId": 2745,
    "date": "2022-02-15",
    "sentence": "In addition two Arizonans were subpoenaed, <span class='selected-term'>Mark Finchem</span> (R), a state House member running for secretary of state who attended the Jan. 6 protest in Washington, and Kelli Ward, the state Republican chair who sued to block committee efforts to obtain her phone records.",
    "author": "",
    "title": "Jan 6 panel issues six new subpoenas"
  },
  {
    "id": 4853,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "The subpoenas went to Arizona Republican Party Chairwoman Kelli Ward, a longtime Trump supporter, as well as Pennsylvania state Sen. Doug Mastriano, now running for governor there, and Arizona State House Rep. <span class='selected-term'>Mark Finchem</span>, now running to be the next secretary of state in Arizona.",
    "author": "",
    "title": "State officials pushing Trump alternate elector scheme come into focus"
  },
  {
    "id": 4913,
    "mediaId": 2745,
    "date": "2022-02-16",
    "sentence": "Advertisement\nArizona Republican Party chairwoman Kelli Ward\nArizona state Rep. <span class='selected-term'>Mark Finchem</span> (R), who is running for Arizona secretary of state\nPennsylvania state senator and gubernatorial candidate Doug Mastriano (R)\nFormer Michigan Republican Party chair Laura Cox\nMichael Roman and Gary Brown, the director and deputy director of Election Day operations for Trump’s reelection campaign\n“The committee previously subpoenaed Trump electors from multiple states won by Biden that sent paperwork to Washington certifying their votes for Trump,” Tom and Jacqueline write.",
    "author": "Joseph Marks",
    "title": "The cyber fight in Ukraine is getting more serious"
  },
  {
    "id": 4943,
    "mediaId": 2592,
    "date": "2022-02-16",
    "sentence": "Trump endorsed his vocal supporter Rep. Finchem in Sept. 2021\nFinchem has repeatedly shared COVID-19 conspiracies\nFinchem was also spotted near the Capitol during the Jan. 6 insurrection\nFormer President Donald Trump has chosen Rep. <span class='selected-term'>Mark Finchem</span>, R-AZ, as his top pick for Arizona’s secretary of state position — a lawmaker known for repeatedly spreading misinformation about the COVID-19 pandemic and vaccines.",
    "author": "Danielle Ong",
    "title": "Trump Picks Anti-Vaxxer Who Claims COVID-19 Doesn't Exist For Arizona Sec. Of State"
  },
  {
    "id": 5140,
    "mediaId": 4418,
    "date": "2022-02-16",
    "sentence": "— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 16, 2022\nTRENDING: HILLARY HEALTH EXCLUSIVE: Witness Reveals in 2016 Presidential Campaign Hillary Used a Wheelchair, Couldn’t Walk a Block and Had a “Med Bag” with Her at All Times\nThis sham investigation is targeting Rep. Mark Finchem and Chairwoman Ward because the BIG LIE is finally unfolding in Arizona.",
    "author": "Jake Lambert",
    "title": "Liz Cheney’s Jan 6 Committee Subpoenas Arizona State Rep. Mark Finchem and Arizona GOP Chairwoman Kelli Ward"
  },
  {
    "id": 5223,
    "mediaId": 2748,
    "date": "2022-02-16",
    "sentence": "Trump campaign official Michael Roman, in charge of Election Day operations in 2020, and his deputy Gary Michael Brown, will receive a subpoena, as will Republican state lawmakers from Pennsylvania and Arizona – Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively.",
    "author": "",
    "title": "Biden rejects Trump's executive privilege claim and orders the release of ALL White House visitor logs to the January 6 committee"
  },
  {
    "id": 4577,
    "mediaId": 2745,
    "date": "2022-02-18",
    "sentence": "",
    "author": "",
    "title": "GOP lawmakers are pushing high-tech ‘fraud-proof’ ballots. A Texas company could be the only supplier."
  },
  {
    "id": 4759,
    "mediaId": 2662,
    "date": "2022-02-19",
    "sentence": "In Arizona Rep. <span class='selected-term'>Mark Finchem</span> was the leader in this effort.",
    "author": "Joe Hoft",
    "title": "Rep. Mark Finchem Receives Subpoena from Liz Cheney’s Jan 6 Gang – He Did Nothing Wrong But That Doesn’t Matter"
  },
  {
    "id": 4653,
    "mediaId": 2664,
    "date": "2022-02-21",
    "sentence": "Arizona Republican State Representative <span class='selected-term'>Mark Finchem</span> (District 11) is not a widely-known figure outside of the Grand Cayon State’s most intimate political cliques.",
    "author": "Brandon Gage",
    "title": "Donald Trump loyalist running for Arizona secretary of state is a right-wing plot to end democracy"
  },
  {
    "id": 4658,
    "mediaId": 2512,
    "date": "2022-02-21",
    "sentence": "Arizona Republican State Representative <span class='selected-term'>Mark Finchem</span> (District 11) is not a widely-known figure outside of the Grand Cayon State’s most intimate political cliques.",
    "author": "Brandon Gage",
    "title": "Donald Trump loyalist running for Arizona secretary of state is a right-wing plot to end democracy"
  },
  {
    "id": 5022,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nEXCLUSIVE: Arizona State Representative <span class='selected-term'>Mark Finchem</span> Talks About Resolution To Decertify AZ, Subpoena By Jan. 6 Committee: “This Is Classic Saul Alinsky.”\nIn the epic new ad, Mark Finchem mentions the law violations that caused hundreds of thousands of ballot discrepancies in the 2020 election.",
    "author": "Jordan Conradson",
    "title": "WATCH: Candidate for AZ Secretary of State Mark Finchem Releases New Ad: “DONALD TRUMP WON. IT IS TIME TO DECERTIFY”"
  },
  {
    "id": 4843,
    "mediaId": 2584,
    "date": "2022-02-21",
    "sentence": "He was endorsing <span class='selected-term'>Mark Finchem</span>, a Republican lawmaker from Tucson, in his bid to become Arizona’s secretary of state.",
    "author": "Ed Pilkington",
    "title": "‘This should terrify the nation’: the Trump ally seeking to run Arizona’s elections"
  },
  {
    "id": 5213,
    "mediaId": 2528,
    "date": "2022-02-21",
    "sentence": "He also shared the link to a donation page titled \"Rep <span class='selected-term'>Mark Finchem</span> Legal Defense Fund\" on the Christian crowdfunding site GiveSendGo.",
    "author": "Kelsey Vlamis",
    "title": "A Trump-backed candidate in Arizona is trying to raise $750,000 for a legal defense fund after he was subpoenaed by the January 6 committee"
  },
  {
    "id": 5121,
    "mediaId": 2748,
    "date": "2022-02-22",
    "sentence": "Ask Arizona Republican state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "STATION GOSSIP",
    "title": "AZ Rep Turns to Voters for Help as Pelosi's Goons Drag Him to DC for Interrogation Over Jan. 6"
  },
  {
    "id": 5051,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "\"In a Feb. 11 call, Boris Epshteyn, a lawyer and former special assistant to Trump, pointed again to baseless claims of widespread election fraud as he tried without success to rally support for a vote on a bill by state Republican Rep. <span class='selected-term'>Mark Finchem</span> to set aside the results in three Arizona counties, Bowers told The Arizona Republic’s political podcast The Gaggle during a wide-ranging interview this week,\" the newspaper reported.",
    "author": "Bob Brigham",
    "title": "Trump ally pressed Arizona Republican to pass bill to erase 2020 election results: report"
  },
  {
    "id": 4792,
    "mediaId": 2662,
    "date": "2022-02-24",
    "sentence": "WATCH: AZ State Representative <span class='selected-term'>Mark Finchem</span> On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”\nContact Arizona Senate President Karen Fann, Speaker Rusty Bowers, and Arizona legislators to strongly encourage their support for decertification.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Arizona Senate President Karen Fann Claims “We Really Don’t Have a Mechanism To Decertify” – Mark Finchem Gave Us The Mechanism"
  },
  {
    "id": 3959,
    "mediaId": 2745,
    "date": "2022-02-28",
    "sentence": "And that’s a great way to lose the election and not ever make a difference.”\nRepublican <span class='selected-term'>Mark Finchem</span>, who was at the Jan. 6, 2021, protest in D.C., has raised nearly $700,000 in his campaign to be Arizona’s secretary of state.",
    "author": "David Montgomery",
    "title": "Who Wants to be a State Secretary of State? Everyone."
  },
  {
    "id": 3941,
    "mediaId": 2584,
    "date": "2022-02-28",
    "sentence": "Some state legislators who had contacts with Giuliani as part of the scam have been subpoenaed by the panel, such as <span class='selected-term'>Mark Finchem</span> in Arizona and Doug Mastriano in Pennsylvania, who are, respectively, running in 2022 to be secretary of state and governor in moves that raise fears of future attempts to subvert American democracy.",
    "author": "Peter Stone",
    "title": "Giuliani’s legal problems deepen as ‘false electors’ scheme investigated"
  },
  {
    "id": 3816,
    "mediaId": 2662,
    "date": "2022-03-01",
    "sentence": "Last week, the court declared,\nInjunctions shall not be granted to “prevent enforcement of a public statute by officers of the law for the public benefit” or to “prevent the exercise of a public or private office in a lawful manner by the person in possession.”\n— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 25, 2022\nHobbs responded to this ruling, admitting her plans to subvert elections laws and interpret them how she sees fit.",
    "author": "Jordan Conradson",
    "title": "Judge Denies Arizona Secretary of State Katie Hobbs’ Request To Block Arizona AG Brnovich From Potentially Prosecuting Election Law Violations"
  },
  {
    "id": 3317,
    "mediaId": 2735,
    "date": "2022-03-07",
    "sentence": "Now, he’s trying to secure the election, this coming November, of <span class='selected-term'>Mark Finchem</span> as secretary of state.",
    "author": "Sasha Abramsky",
    "title": "Trump’s Pick for AZ Secretary of State Participated in January 6 Capitol Breach"
  },
  {
    "id": 2816,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "Republican state Rep. <span class='selected-term'>Mark Finchem</span>, who has promoted a host of QAnon conspiracies and introduced a resolution to decertify the 2020 presidential election in Arizona, attended the same protest.",
    "author": "",
    "title": "The Arizona Republican Caught in a Vise by Trump’s Big Lie"
  },
  {
    "id": 2952,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "Speakers scheduled to address the gathering include Roger Stone, Arizona Republican state Rep. <span class='selected-term'>Mark Finchem</span>, Pastor Greg Locke, and Pastor Mark Burns.",
    "author": "Bob Brigham",
    "title": "Eric Trump praises huge portrait of his dad at conspiracy theorist conference: ‘I love that’"
  },
  {
    "id": 2695,
    "mediaId": 2560,
    "date": "2022-03-26",
    "sentence": "Lansing — <span class='selected-term'>Mark Finchem</span>, whom former President Donald Trump endorsed to be Arizona's next secretary of state, told a crowd in Michigan Saturday to \"fire\" lawmakers who were unwilling to consider claims of wrongdoing in the 2020 election.",
    "author": "Craig Mauger",
    "title": "Trump-backed candidates see 'movement' in Michigan despite small rally crowd"
  },
  {
    "id": 2541,
    "mediaId": 2902,
    "date": "2022-03-29",
    "sentence": "A.C. THOMPSON: Yeah, and <span class='selected-term'>Mark Finchem</span> is a guy who has been a member of the Oath Keepers, the militia group.",
    "author": "",
    "title": "“Plot to Overturn the Election”: Frontline/ProPublica Report Shows How Trump’s Lies Became GOP Dogma"
  },
  {
    "id": 2478,
    "mediaId": 2875,
    "date": "2022-03-29",
    "sentence": "Another Arizona Republican lawmaker running for secretary of state, <span class='selected-term'>Mark Finchem</span>, has regularly invited other election conspiracy theorists to the state.",
    "author": "Steven Rosenfeld",
    "title": "More than 80 election-denying candidates running for governor, attorney general and secretary of state in 2022’s primaries"
  },
  {
    "id": 2151,
    "mediaId": 2512,
    "date": "2022-03-29",
    "sentence": "Another Arizona Republican lawmaker running for secretary of state, <span class='selected-term'>Mark Finchem</span>, has regularly invited other election conspiracy theorists to the state.",
    "author": "",
    "title": "More than 80 election-denying candidates running for governor, attorney general and secretary of state in 2022’s primaries"
  },
  {
    "id": 1297,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "\"Since the 2020 election, Rep. <span class='selected-term'>Mark Finchem</span> has alleged widespread voter fraud, arguing in part that too many mail-in ballots went to people not living at some Arizona addresses.",
    "author": "Bob Brigham",
    "title": "BUSTED: Trump-endorsed Secretary of State candidate does not live where he is registered to vote"
  },
  {
    "id": 1202,
    "mediaId": 2664,
    "date": "2022-04-01",
    "sentence": "In Arizona, Trump is backing state Rep. <span class='selected-term'>Mark Finchem</span> for Secretary of State.",
    "author": "Bob Brigham",
    "title": "Georgia GOP is ‘legislating based on conspiracy theories and lies’: Washington Post editorial board"
  },
  {
    "id": 1411,
    "mediaId": 2735,
    "date": "2022-04-02",
    "sentence": "Another Arizona Republican lawmaker running for secretary of state, <span class='selected-term'>Mark Finchem</span>, has regularly invited other election conspiracy theorists to the state.",
    "author": "Chris Walker",
    "title": "More Than 80 Candidates in 2022 Primaries Are Spreading Trump’s “Big Lie”"
  },
  {
    "id": 1471,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "\"In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives Paul Gosar and Andy Biggs and State Representative <span class='selected-term'>Mark Finchem</span>, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement,\" The New York Times reports.",
    "author": "Sky Palma",
    "title": "Six more Republicans sued over Constitution’s ban on insurrectionists running for office: report"
  },
  {
    "id": 1606,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "But this isn't a one-off — many other Republicans are running for election offices on similar platforms, like Michigan's Kristina Karamo, who has spoken at a QAnon conference, and Arizona's <span class='selected-term'>Mark Finchem</span>, who ironically does not presently live where he is registered to vote.",
    "author": "Matthew Chapman",
    "title": "Former RNC official warns 'crazypants' MAGA supporters are running to take over state election systems"
  },
  {
    "id": 806,
    "mediaId": 2590,
    "date": "2022-04-09",
    "sentence": "Court of Appeals for the Fourth Circuit\nCawthorn is one of five candidates — including Rep. Marjorie Taylor Greene (R-Ga.), Paul Gosar (R-Ariz.), Rep. Andy Biggs (R-Ariz.) and <span class='selected-term'>Mark Finchem</span>, a Republican running for Arizona secretary of state — whose reelections are being challenged in court on constitutional grounds linked to support for the insurrection.",
    "author": "Mary Papenfuss",
    "title": "Court Revives Challenge To Madison Cawthorn's Reelection Effort"
  },
  {
    "id": 181,
    "mediaId": 2664,
    "date": "2022-04-12",
    "sentence": "Arizona state Rep. <span class='selected-term'>Mark Finchem</span> asked the Department of Homeland Security to conduct “a full spectrum forensic examination” of voting machines\" in the final weeks of the Trump presidency, and he got the attention of the department's acting director of the Cybersecurity and Infrastructure Security Agency, reported Politico.",
    "author": "Travis Gettys",
    "title": "Trump allies secretly pushed DHS to help change the results of the 2020 election: report"
  },
  {
    "id": 899,
    "mediaId": 2676,
    "date": "2022-04-12",
    "sentence": "Arizona state Rep. <span class='selected-term'>Mark Finchem</span> asked the Department of Homeland Security to conduct \"a full spectrum forensic examination\" of voting machines\" in the final weeks of the Trump presidency, and he got the attention of the department's acting director of the Cybersecurity and Infrastructure Security Agency, reported Politico.",
    "author": "Travis Gettys",
    "title": "New emails reveal Trump allies’ effort to get DHS to conduct “forensic” probe of voting machines"
  },
  {
    "id": 561,
    "mediaId": 6746,
    "date": "2022-04-13",
    "sentence": "The Accused Politicians\nThose charged in the Superior Court of Arizona in Maricopa County are US Reps. Paul Gosar and Andy Biggs for reelection; while State Rep. <span class='selected-term'>Mark Finchem</span> for Arizona secretary of state announced this by the Austin, Texas-based Free Speech For People on April 7, cited Court House News Service.",
    "author": "Ed Forster",
    "title": "Democrats Attempt To Kick Out Two-Pro Trump Representatives, Arizona Lawmaker as Panic Sets in Before 2022 Midterm Elections"
  },
  {
    "id": 802,
    "mediaId": 2634,
    "date": "2022-04-15",
    "sentence": "To replace Hobbs, Donald Trump favors state Representative <span class='selected-term'>Mark Finchem</span>, whom Trump has praised for “his incredibly powerful stance on the massive Voter Fraud that took place in the 2020 Presidential Election Scam.”\nGeorgia\nGovernor: Brian Kemp, a Republican, is up for reelection in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: Controlled by a conservative majority\nElections administered by the secretary of state, with significant legislative influence\nOther key players: Stacey Abrams, a Democrat\nCan they steal it?",
    "author": "Matt Ford",
    "title": "The Six States That Could Determine Whether Republicans Steal the 2024 Election"
  },
  {
    "id": 784,
    "mediaId": 2594,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "Via AP news wire",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 193,
    "mediaId": 2746,
    "date": "2022-04-20",
    "sentence": "Free Speech for People filed similar lawsuits challenging the candidacies of Arizona U.S. Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span>, who is running for Arizona’s secretary of state and has been endorsed by Mr. Trump, on the same grounds.",
    "author": "Editorial Board",
    "title": "Democrats look to disqualify Republicans from ballot as ‘insurrectionists’"
  },
  {
    "id": 364,
    "mediaId": 2822,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 822,
    "mediaId": 2680,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "BOB CHRISTIE",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 528,
    "mediaId": 2580,
    "date": "2022-04-21",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "Associated Press",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 273,
    "mediaId": 5308,
    "date": "2022-04-22",
    "sentence": "So Madison Cawthorn, Marjorie Taylor Greene, Paul Gosar, Andy Biggs, and [Arizona State Rep.] <span class='selected-term'>Mark Finchem</span> are all involved in more than just a vote inside the House chamber.",
    "author": "Todd Zwillich",
    "title": "‘Insurrectionist’ Marjorie Taylor Greene Goes Under Oath Today"
  }
]