[
  {
    "id": 6483,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "JAN 28-30: Women Fighting For America Announce The TAKE ACTION TOUR With AZ State Rep. <span class='selected-term'>Mark Finchem</span> And General Flynn\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nAn event representative told TGP that the Payne Arena in Hidalgo, Texas holds 7,000 people, and jumbotrons will be set up for the overflow crowd.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Women Fighting For America’s Jan. 28-30 Border Event Comes Under Attack from Angry Leftists and Big Tech – Organizers Vow to Push Forward — REGISTER HERE"
  },
  {
    "id": 6436,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nWho will decertify first?",
    "author": "Jordan Conradson",
    "title": "AZ State Senator Wendy Rogers Drops 88 Bills: “We Are Going Back to In-Person One Day One Vote NO MACHINES And Paper Ballots With Watermarks”"
  },
  {
    "id": 6397,
    "mediaId": 2662,
    "date": "2022-01-28",
    "sentence": "These letters were good for election integrity and the Arizona audit, but since 2020 we haven’t seen Blackman on the frontlines like Rep. <span class='selected-term'>Mark Finchem</span>, Senator Wendy Rogers, Senator Sonny Borrelli and other election integrity heros.",
    "author": "Jordan Conradson",
    "title": "“I See You Are Wendy’s Puppet!” – AZ State Rep Walt Blackman and Triggered WIFE, Kristi Blackman Psycho Text TGP’s Conradson Following TGP Article on Decertification"
  },
  {
    "id": 5551,
    "mediaId": 2578,
    "date": "2022-02-03",
    "sentence": "Arizona Secretary of State candidate <span class='selected-term'>Mark Finchem</span> is calling for the state to end its participation with the ERIC voter registration system.",
    "author": "Joe Hoft",
    "title": "Representative Mark Finchem Calls for Arizona to End Participation in the Electronic Registration Information Center (ERIC) Like Louisiana Just Did"
  },
  {
    "id": 5556,
    "mediaId": 2578,
    "date": "2022-02-06",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nAZ Senate Republicans are pushing for serious election reform and decertification of the 2020 election.",
    "author": "Jordan Conradson",
    "title": "TOMORROW: AZ Senate Government Committee Considers 14 Election Integrity Bills – Drive-Up Voting; Prohibition, Voting; One Day Only; Holiday"
  },
  {
    "id": 5586,
    "mediaId": 2662,
    "date": "2022-02-08",
    "sentence": "— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 7, 2022\nAnd also on Monday video proof was released of Maricopa County election workers deleting “archived” files from servers before delivery to state auditors — a criminal offense.",
    "author": "Jordan Conradson",
    "title": "BREAKING – President Trump: “They Are So Desperate To Hide The Truth, They’ll Make It Criminal To Speak It!”"
  },
  {
    "id": 5532,
    "mediaId": 2662,
    "date": "2022-02-09",
    "sentence": "The Gateway Pundit reported that <span class='selected-term'>Mark Finchem</span> introduced HCR 2033, a resolution to set aside and decertify three 2020 county elections and reclaim Arizona’s 2020 Presidential electors using the State Legislature’s plenary powers, granted by the Constitution.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Arizona State Rep. Mark Finchem Challenges House Speaker to Public Debate On Decertification: “Here’s My Cards. I’m Waiting To See Yours.” (VIDEO)"
  },
  {
    "id": 5122,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 16, 2022\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThis sham investigation is targeting Rep. Mark Finchem and Chairwoman Ward because the BIG LIE is finally unfolding in Arizona.",
    "author": "Jordan Conradson",
    "title": "Liz Cheney’s Jan 6 Committee Subpoenas Arizona State Rep. Mark Finchem and Arizona GOP Chairwoman Kelli Ward"
  },
  {
    "id": 4759,
    "mediaId": 2662,
    "date": "2022-02-19",
    "sentence": "In Arizona Rep. <span class='selected-term'>Mark Finchem</span> was the leader in this effort.",
    "author": "Joe Hoft",
    "title": "Rep. Mark Finchem Receives Subpoena from Liz Cheney’s Jan 6 Gang – He Did Nothing Wrong But That Doesn’t Matter"
  },
  {
    "id": 5102,
    "mediaId": 2662,
    "date": "2022-02-23",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> appeared on Steve Bannon’s War Room today to give updates on his push to decertify Arizona’s fraudulent 2020 election.",
    "author": "Jordan Conradson",
    "title": "WATCH: AZ State Representative Mark Finchem On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”"
  },
  {
    "id": 3069,
    "mediaId": 2578,
    "date": "2022-03-07",
    "sentence": "Citing the massive evidence of fraud and doubt in elections, Arizona State Representative <span class='selected-term'>Mark Finchem</span> introduced a resolution to decertify the fraudulent 2020 election in Arizona last month.",
    "author": "Jordan Conradson",
    "title": "(VIDEO) Interview With Mike Lindell At Arizona Gubernatorial Candidate Kari Lake’s Rodeo Rally: “You Legislators Out there, You’re Going to Be a Traitor or a Hero”"
  }
]