[
  {
    "id": 7060,
    "mediaId": 2627,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "In Trump’s honor, Arizona Republicans approve conspiracy-based election bills"
  },
  {
    "id": 6621,
    "mediaId": 2707,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates — gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> — who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "Cnn Com",
    "title": "After Jan. 6 panel formed, Trump PAC gave to Meadows’ org."
  },
  {
    "id": 5944,
    "mediaId": 2594,
    "date": "2022-02-10",
    "sentence": "She also has pledged – if elected – to direct the state’s office of Attorney General to open a criminal investigation into the election, including seizing “all election material, all election equipment, and he should start questioning people immediately.”\nThe leading GOP candidate for Arizona’s secretary of state, state representative <span class='selected-term'>Mark Finchem</span>, filed legislation this week to decertify the state’s 2020 election results, baselessly asserting that “illegal acts occurred” and that the outcome is “irredeemably compromised, and it is impossible to name a clear winner of the contest.”\nHis fundraising has outpaced the two leading Democratic candidates combined.",
    "author": "Alex Woodward",
    "title": "They wanted to overturn 2020 election results. Now these candidates want to run the next elections"
  },
  {
    "id": 3069,
    "mediaId": 2578,
    "date": "2022-03-07",
    "sentence": "Citing the massive evidence of fraud and doubt in elections, Arizona State Representative <span class='selected-term'>Mark Finchem</span> introduced a resolution to decertify the fraudulent 2020 election in Arizona last month.",
    "author": "Jordan Conradson",
    "title": "(VIDEO) Interview With Mike Lindell At Arizona Gubernatorial Candidate Kari Lake’s Rodeo Rally: “You Legislators Out there, You’re Going to Be a Traitor or a Hero”"
  }
]