[
  {
    "id": 6436,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nWho will decertify first?",
    "author": "Jordan Conradson",
    "title": "AZ State Senator Wendy Rogers Drops 88 Bills: “We Are Going Back to In-Person One Day One Vote NO MACHINES And Paper Ballots With Watermarks”"
  },
  {
    "id": 6546,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "Four days later, Lake and <span class='selected-term'>Mark Finchem</span> appeared with Trump and spoke to thousands of his supporters in Florence, Arizona.",
    "author": "",
    "title": "Now every day in Arizona is January 6"
  },
  {
    "id": 5551,
    "mediaId": 2578,
    "date": "2022-02-03",
    "sentence": "Arizona Secretary of State candidate <span class='selected-term'>Mark Finchem</span> is calling for the state to end its participation with the ERIC voter registration system.",
    "author": "Joe Hoft",
    "title": "Representative Mark Finchem Calls for Arizona to End Participation in the Electronic Registration Information Center (ERIC) Like Louisiana Just Did"
  },
  {
    "id": 5620,
    "mediaId": 2748,
    "date": "2022-02-04",
    "sentence": "Arizona Secretary of State candidate <span class='selected-term'>Mark Finchem</span> is calling for the state to end its participation with the ERIC voter registration system.",
    "author": "STATION GOSSIP",
    "title": "Representative Mark Finchem Calls for Arizona to End Participation in the Electronic Registration Information Center (ERIC) Like Louisiana Just Did"
  },
  {
    "id": 3816,
    "mediaId": 2662,
    "date": "2022-03-01",
    "sentence": "Last week, the court declared,\nInjunctions shall not be granted to “prevent enforcement of a public statute by officers of the law for the public benefit” or to “prevent the exercise of a public or private office in a lawful manner by the person in possession.”\n— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 25, 2022\nHobbs responded to this ruling, admitting her plans to subvert elections laws and interpret them how she sees fit.",
    "author": "Jordan Conradson",
    "title": "Judge Denies Arizona Secretary of State Katie Hobbs’ Request To Block Arizona AG Brnovich From Potentially Prosecuting Election Law Violations"
  },
  {
    "id": 1370,
    "mediaId": 4418,
    "date": "2022-03-31",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> appeared on Steve Bannon’s War Room to tell us what this means for Katie Hobbs.",
    "author": "Jake Lambert",
    "title": "WATCH: Arizona State Rep. Mark Finchem on Katie Hobbs’ Potential Prosecution: “She Knowingly Did This. I Don’t See How This Doesn’t End Up In Some Kind of a Conviction”"
  },
  {
    "id": 1021,
    "mediaId": 2578,
    "date": "2022-03-31",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> appeared on Steve Bannon’s War Room to tell us what this means for Katie Hobbs.",
    "author": "Jordan Conradson",
    "title": "WATCH: Arizona State Rep. Mark Finchem on Katie Hobbs’ Potential Prosecution: “She Knowingly Did This. I Don’t See How This Doesn’t End Up In Some Kind of a Conviction”"
  },
  {
    "id": 802,
    "mediaId": 2634,
    "date": "2022-04-15",
    "sentence": "To replace Hobbs, Donald Trump favors state Representative <span class='selected-term'>Mark Finchem</span>, whom Trump has praised for “his incredibly powerful stance on the massive Voter Fraud that took place in the 2020 Presidential Election Scam.”\nGeorgia\nGovernor: Brian Kemp, a Republican, is up for reelection in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: Controlled by a conservative majority\nElections administered by the secretary of state, with significant legislative influence\nOther key players: Stacey Abrams, a Democrat\nCan they steal it?",
    "author": "Matt Ford",
    "title": "The Six States That Could Determine Whether Republicans Steal the 2024 Election"
  }
]