[
  {
    "id": 6710,
    "mediaId": 6746,
    "date": "2022-01-17",
    "sentence": "The Saturday event had Arizona state Representative <span class='selected-term'>Mark Finchem</span> address the audience as a \"special guest speaker.\"",
    "author": "Renz Soliman",
    "title": "Trump Supporters Believe Deceased JFK Jr. Is 'Coming Back' To Be Former President's VP"
  },
  {
    "id": 6807,
    "mediaId": 5308,
    "date": "2022-02-01",
    "sentence": "Watkins told VICE News that while at the rally he had tried to speak to Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, who has promoted QAnon conspiracies, and who is seeking election in November as secretary of state.",
    "author": "David Gilbert",
    "title": "QAnon Thought Leader Ron Watkins Is Running for Congress. It’s Going Terribly."
  },
  {
    "id": 5708,
    "mediaId": 2643,
    "date": "2022-02-04",
    "sentence": "Among the Republicans who attended John Sabal's Patriot Voice event, were Arizona State Senator Wendy Rogers and Arizona State Representative <span class='selected-term'>Mark Finchem</span>, both of whom continue to push the baseless claim that the 2020 election was stolen.",
    "author": "Anders Anglesey",
    "title": "QAnon in 2022: Conspiracy Followers Focus on Controlling Elections and School Boards"
  },
  {
    "id": 1671,
    "mediaId": 2664,
    "date": "2022-04-05",
    "sentence": "There are Republican candidates like <span class='selected-term'>Mark Finchem</span> in Arizona and Kristina Karamo in Michigan who are running on the QAnon brand.",
    "author": "Sarah K. Burris",
    "title": "Florida GOP candidate runs from QAnon after he got burned: 'You guys are stupid'"
  },
  {
    "id": 105,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "One of the incumbents, Arizona House member <span class='selected-term'>Mark Finchem</span>, participated in the 2021 Capitol insurrection—as did several other QAnon candidates—and has been subpoenaed by the House Jan. 6 committee.",
    "author": "David Neiwert\nDaily Kos Staff",
    "title": "QAnon’s takeover of GOP nearly complete with 72 candidates ready to make ‘pedophilia’ claims"
  },
  {
    "id": 417,
    "mediaId": 2629,
    "date": "2022-04-18",
    "sentence": "One of the incumbents, Arizona House member <span class='selected-term'>Mark Finchem</span>, participated in the 2021 Capitol insurrection—as did several other QAnon candidates—and has been subpoenaed by the House January 6 committee.",
    "author": "David Neiwert",
    "title": "QAnon’s Takeover Of GOP Surging With 72 Candidates Pushing 'Pedophilia' Lies"
  }
]