[
  {
    "id": 6481,
    "mediaId": 2590,
    "date": "2022-01-12",
    "sentence": "Both have received endorsements from Trump, who also backed Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a Republican who was present at the Jan. 6 insurrection and is now running for secretary of state.",
    "author": "Travis Waldron",
    "title": "GOP Election Deniers Are On Pace To Raise Record Sums For Secretary Of State Races"
  },
  {
    "id": 6471,
    "mediaId": 2578,
    "date": "2022-01-20",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> has been called a “fire breather” and “honey badger” by such notables as Stephen K. Bannon, of the War Room, and John Fredricks, of Outside the Beltway.",
    "author": "Joe Hoft",
    "title": "Please Help Arizona Rep. Mark Finchem Running for Secretary of State Cover Expenses from Pima County Ad Hoc Hearing on Election Integrity"
  },
  {
    "id": 6662,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "Fontes, a Democrat who is now running for secretary of state, issued a statement earlier this month supporting an identical proposal sponsored in the House by Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jeremy Duda",
    "title": "Lies about the 2020 election propel Arizona bills aimed at combating non-existent fraud"
  },
  {
    "id": 7060,
    "mediaId": 2627,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "In Trump’s honor, Arizona Republicans approve conspiracy-based election bills"
  },
  {
    "id": 6774,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "The Gateway Pundit reported on these election integrity measures unveiled by Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jordan Conradson",
    "title": "BREAKING: Arizona Senate Committee Passes SEVEN Election Integrity Bills – Including Ballot Fraud Countermeasures, Ballot Images Will Be Public Records"
  },
  {
    "id": 6765,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nBut RINO Arizona State Representative and U.S. Congressional Candidate Walter Blackman, says this is not a possibility.",
    "author": "Jordan Conradson",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 7089,
    "mediaId": 2748,
    "date": "2022-01-28",
    "sentence": "Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span> is currently drafting a resolution to decertify Arizona’s 2020 Presidential election.",
    "author": "",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 6537,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "Fifteen Republican legislators have signed on to Fillmore's bill, including Rep. <span class='selected-term'>Mark Finchem</span>, the Trump-endorsed candidate for Arizona secretary of state.",
    "author": "Chris Cillizza",
    "title": "An Arizona Republican just unveiled the most brazen election bill yet"
  },
  {
    "id": 6618,
    "mediaId": 2584,
    "date": "2022-01-29",
    "sentence": "One of the co-sponsors of the bill is <span class='selected-term'>Mark Finchem</span>, a state representative who believes the 2020 election was stolen, has ties to the Oath Keepers, and was at the Capitol on 6 January.",
    "author": "Sam Levine",
    "title": "Arizona Republicans introduce election subversion bill"
  },
  {
    "id": 7014,
    "mediaId": 2735,
    "date": "2022-01-31",
    "sentence": "The bill already has 15 Republican co-sponsors, including state Rep. <span class='selected-term'>Mark Finchem</span>, the Trump-endorsed secretary of state candidate seeking to take over the state’s elections.",
    "author": "Igor Derysh",
    "title": "AZ Republicans Introduce Bill Allowing Legislature to “Reject” Election Results"
  },
  {
    "id": 6546,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "Four days later, Lake and <span class='selected-term'>Mark Finchem</span> appeared with Trump and spoke to thousands of his supporters in Florence, Arizona.",
    "author": "",
    "title": "Now every day in Arizona is January 6"
  },
  {
    "id": 6480,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "The bill already has 15 Republican co-sponsors, including state Rep. <span class='selected-term'>Mark Finchem</span>, the Trump-endorsed secretary of state candidate seeking to take over the state's elections.",
    "author": "",
    "title": "Arizona bills embrace Trump conspiracy theories — could allow GOP to reject election results"
  },
  {
    "id": 5609,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Trump is also backing state Rep. <span class='selected-term'>Mark Finchem</span> in his campaign against Hobbs as secretary of state in Arizona, which Trump lost to Biden by fewer than 11,000 votes.",
    "author": "Igor Derysh",
    "title": "More than 80 Trump truthers are aiming for a power grab"
  },
  {
    "id": 5581,
    "mediaId": 2590,
    "date": "2022-02-07",
    "sentence": "On Monday, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> (Trump’s endorsed candidate for secretary of state) introduced a resolution seeking to decertify the results in Maricopa, Pima and Yuma counties — more than a year after the presidential election and following numerous fruitless attempts at digging up evidence that a massive voter fraud scheme cost Trump the presidency.",
    "author": "Liz Skalka",
    "title": "Arizona Republican Says His Daughter Got Text Calling Him 'N-Word' RINO"
  },
  {
    "id": 5661,
    "mediaId": 2660,
    "date": "2022-02-11",
    "sentence": "If Your Time is short\nArizona State Rep. <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state with Donald Trump’s backing, proposed a resolution that would decertify the 2020 election results from three counties.",
    "author": "Amy Sherman",
    "title": "GOP lawmaker’s proposal to decertify Arizona election won’t change anything about 2020"
  },
  {
    "id": 5122,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 16, 2022\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThis sham investigation is targeting Rep. Mark Finchem and Chairwoman Ward because the BIG LIE is finally unfolding in Arizona.",
    "author": "Jordan Conradson",
    "title": "Liz Cheney’s Jan 6 Committee Subpoenas Arizona State Rep. Mark Finchem and Arizona GOP Chairwoman Kelli Ward"
  },
  {
    "id": 5103,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "It also issued them to four officials in states carried by President Joe Biden as he defeated Republican Trump's bid for re-election: Douglas Mastriano, a state senator in Pennsylvania; Laura Cox, a former member of the Michigan House of Representatives and chair of the state Republican party; <span class='selected-term'>Mark Finchem</span>, an Arizona state senator; and Kelli Ward, a former Arizona state senator and chair of the state Republican party.",
    "author": "",
    "title": "Jan. 6 Panel Issues 6 Subpoenas in 'Alternate Elector' Probe"
  },
  {
    "id": 4685,
    "mediaId": 2745,
    "date": "2022-02-15",
    "sentence": "In addition two Arizonans were subpoenaed, <span class='selected-term'>Mark Finchem</span> (R), a state House member running for secretary of state who attended the Jan. 6 protest in Washington, and Kelli Ward, the state Republican chair who sued to block committee efforts to obtain her phone records.",
    "author": "",
    "title": "Jan 6 panel issues six new subpoenas"
  },
  {
    "id": 5140,
    "mediaId": 4418,
    "date": "2022-02-16",
    "sentence": "— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 16, 2022\nTRENDING: HILLARY HEALTH EXCLUSIVE: Witness Reveals in 2016 Presidential Campaign Hillary Used a Wheelchair, Couldn’t Walk a Block and Had a “Med Bag” with Her at All Times\nThis sham investigation is targeting Rep. Mark Finchem and Chairwoman Ward because the BIG LIE is finally unfolding in Arizona.",
    "author": "Jake Lambert",
    "title": "Liz Cheney’s Jan 6 Committee Subpoenas Arizona State Rep. Mark Finchem and Arizona GOP Chairwoman Kelli Ward"
  },
  {
    "id": 4577,
    "mediaId": 2745,
    "date": "2022-02-18",
    "sentence": "",
    "author": "",
    "title": "GOP lawmakers are pushing high-tech ‘fraud-proof’ ballots. A Texas company could be the only supplier."
  },
  {
    "id": 4759,
    "mediaId": 2662,
    "date": "2022-02-19",
    "sentence": "In Arizona Rep. <span class='selected-term'>Mark Finchem</span> was the leader in this effort.",
    "author": "Joe Hoft",
    "title": "Rep. Mark Finchem Receives Subpoena from Liz Cheney’s Jan 6 Gang – He Did Nothing Wrong But That Doesn’t Matter"
  },
  {
    "id": 5213,
    "mediaId": 2528,
    "date": "2022-02-21",
    "sentence": "He also shared the link to a donation page titled \"Rep <span class='selected-term'>Mark Finchem</span> Legal Defense Fund\" on the Christian crowdfunding site GiveSendGo.",
    "author": "Kelsey Vlamis",
    "title": "A Trump-backed candidate in Arizona is trying to raise $750,000 for a legal defense fund after he was subpoenaed by the January 6 committee"
  },
  {
    "id": 5121,
    "mediaId": 2748,
    "date": "2022-02-22",
    "sentence": "Ask Arizona Republican state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "STATION GOSSIP",
    "title": "AZ Rep Turns to Voters for Help as Pelosi's Goons Drag Him to DC for Interrogation Over Jan. 6"
  },
  {
    "id": 5051,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "\"In a Feb. 11 call, Boris Epshteyn, a lawyer and former special assistant to Trump, pointed again to baseless claims of widespread election fraud as he tried without success to rally support for a vote on a bill by state Republican Rep. <span class='selected-term'>Mark Finchem</span> to set aside the results in three Arizona counties, Bowers told The Arizona Republic’s political podcast The Gaggle during a wide-ranging interview this week,\" the newspaper reported.",
    "author": "Bob Brigham",
    "title": "Trump ally pressed Arizona Republican to pass bill to erase 2020 election results: report"
  },
  {
    "id": 3959,
    "mediaId": 2745,
    "date": "2022-02-28",
    "sentence": "And that’s a great way to lose the election and not ever make a difference.”\nRepublican <span class='selected-term'>Mark Finchem</span>, who was at the Jan. 6, 2021, protest in D.C., has raised nearly $700,000 in his campaign to be Arizona’s secretary of state.",
    "author": "David Montgomery",
    "title": "Who Wants to be a State Secretary of State? Everyone."
  },
  {
    "id": 2816,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "Republican state Rep. <span class='selected-term'>Mark Finchem</span>, who has promoted a host of QAnon conspiracies and introduced a resolution to decertify the 2020 presidential election in Arizona, attended the same protest.",
    "author": "",
    "title": "The Arizona Republican Caught in a Vise by Trump’s Big Lie"
  },
  {
    "id": 2541,
    "mediaId": 2902,
    "date": "2022-03-29",
    "sentence": "A.C. THOMPSON: Yeah, and <span class='selected-term'>Mark Finchem</span> is a guy who has been a member of the Oath Keepers, the militia group.",
    "author": "",
    "title": "“Plot to Overturn the Election”: Frontline/ProPublica Report Shows How Trump’s Lies Became GOP Dogma"
  },
  {
    "id": 2151,
    "mediaId": 2512,
    "date": "2022-03-29",
    "sentence": "Another Arizona Republican lawmaker running for secretary of state, <span class='selected-term'>Mark Finchem</span>, has regularly invited other election conspiracy theorists to the state.",
    "author": "",
    "title": "More than 80 election-denying candidates running for governor, attorney general and secretary of state in 2022’s primaries"
  },
  {
    "id": 1202,
    "mediaId": 2664,
    "date": "2022-04-01",
    "sentence": "In Arizona, Trump is backing state Rep. <span class='selected-term'>Mark Finchem</span> for Secretary of State.",
    "author": "Bob Brigham",
    "title": "Georgia GOP is ‘legislating based on conspiracy theories and lies’: Washington Post editorial board"
  },
  {
    "id": 1411,
    "mediaId": 2735,
    "date": "2022-04-02",
    "sentence": "Another Arizona Republican lawmaker running for secretary of state, <span class='selected-term'>Mark Finchem</span>, has regularly invited other election conspiracy theorists to the state.",
    "author": "Chris Walker",
    "title": "More Than 80 Candidates in 2022 Primaries Are Spreading Trump’s “Big Lie”"
  },
  {
    "id": 1671,
    "mediaId": 2664,
    "date": "2022-04-05",
    "sentence": "There are Republican candidates like <span class='selected-term'>Mark Finchem</span> in Arizona and Kristina Karamo in Michigan who are running on the QAnon brand.",
    "author": "Sarah K. Burris",
    "title": "Florida GOP candidate runs from QAnon after he got burned: 'You guys are stupid'"
  },
  {
    "id": 1471,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "\"In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives Paul Gosar and Andy Biggs and State Representative <span class='selected-term'>Mark Finchem</span>, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement,\" The New York Times reports.",
    "author": "Sky Palma",
    "title": "Six more Republicans sued over Constitution’s ban on insurrectionists running for office: report"
  },
  {
    "id": 1606,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "But this isn't a one-off — many other Republicans are running for election offices on similar platforms, like Michigan's Kristina Karamo, who has spoken at a QAnon conference, and Arizona's <span class='selected-term'>Mark Finchem</span>, who ironically does not presently live where he is registered to vote.",
    "author": "Matthew Chapman",
    "title": "Former RNC official warns 'crazypants' MAGA supporters are running to take over state election systems"
  },
  {
    "id": 806,
    "mediaId": 2590,
    "date": "2022-04-09",
    "sentence": "Court of Appeals for the Fourth Circuit\nCawthorn is one of five candidates — including Rep. Marjorie Taylor Greene (R-Ga.), Paul Gosar (R-Ariz.), Rep. Andy Biggs (R-Ariz.) and <span class='selected-term'>Mark Finchem</span>, a Republican running for Arizona secretary of state — whose reelections are being challenged in court on constitutional grounds linked to support for the insurrection.",
    "author": "Mary Papenfuss",
    "title": "Court Revives Challenge To Madison Cawthorn's Reelection Effort"
  },
  {
    "id": 561,
    "mediaId": 6746,
    "date": "2022-04-13",
    "sentence": "The Accused Politicians\nThose charged in the Superior Court of Arizona in Maricopa County are US Reps. Paul Gosar and Andy Biggs for reelection; while State Rep. <span class='selected-term'>Mark Finchem</span> for Arizona secretary of state announced this by the Austin, Texas-based Free Speech For People on April 7, cited Court House News Service.",
    "author": "Ed Forster",
    "title": "Democrats Attempt To Kick Out Two-Pro Trump Representatives, Arizona Lawmaker as Panic Sets in Before 2022 Midterm Elections"
  },
  {
    "id": 802,
    "mediaId": 2634,
    "date": "2022-04-15",
    "sentence": "To replace Hobbs, Donald Trump favors state Representative <span class='selected-term'>Mark Finchem</span>, whom Trump has praised for “his incredibly powerful stance on the massive Voter Fraud that took place in the 2020 Presidential Election Scam.”\nGeorgia\nGovernor: Brian Kemp, a Republican, is up for reelection in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: Controlled by a conservative majority\nElections administered by the secretary of state, with significant legislative influence\nOther key players: Stacey Abrams, a Democrat\nCan they steal it?",
    "author": "Matt Ford",
    "title": "The Six States That Could Determine Whether Republicans Steal the 2024 Election"
  },
  {
    "id": 417,
    "mediaId": 2629,
    "date": "2022-04-18",
    "sentence": "One of the incumbents, Arizona House member <span class='selected-term'>Mark Finchem</span>, participated in the 2021 Capitol insurrection—as did several other QAnon candidates—and has been subpoenaed by the House January 6 committee.",
    "author": "David Neiwert",
    "title": "QAnon’s Takeover Of GOP Surging With 72 Candidates Pushing 'Pedophilia' Lies"
  },
  {
    "id": 105,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "One of the incumbents, Arizona House member <span class='selected-term'>Mark Finchem</span>, participated in the 2021 Capitol insurrection—as did several other QAnon candidates—and has been subpoenaed by the House Jan. 6 committee.",
    "author": "David Neiwert\nDaily Kos Staff",
    "title": "QAnon’s takeover of GOP nearly complete with 72 candidates ready to make ‘pedophilia’ claims"
  },
  {
    "id": 364,
    "mediaId": 2822,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 193,
    "mediaId": 2746,
    "date": "2022-04-20",
    "sentence": "Free Speech for People filed similar lawsuits challenging the candidacies of Arizona U.S. Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span>, who is running for Arizona’s secretary of state and has been endorsed by Mr. Trump, on the same grounds.",
    "author": "Editorial Board",
    "title": "Democrats look to disqualify Republicans from ballot as ‘insurrectionists’"
  },
  {
    "id": 40,
    "mediaId": 2664,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "",
    "title": "Judge dismisses case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 28,
    "mediaId": 2641,
    "date": "2022-04-22",
    "sentence": "The suit, brought by a voting rights group, also named state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jeffrey Rodack",
    "title": "Judge Tosses out Lawsuit Aimed at Keeping Reps. Gosar, Biggs off Ballots"
  },
  {
    "id": 846,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "The plaintiffs in the case, the group Free Speech for the People (more irony), are trying to use Section 3 of the 14th Amendment to the Constitution, which prohibits elected officials from engaging in an insurrection or rebellion to knock Rep. Paul Gosar (R-AZ), Rep. Andy Biggs (R-AZ) and state Rep. <span class='selected-term'>Mark Finchem</span> (who’s running for Secretary of State) off the ballot in Arizona.",
    "author": "Nick Arama",
    "title": "Effort to Block GOP Reps From Running Because of Jan. 6 Goes Down to Withering Defeat"
  }
]