[
  {
    "id": 6662,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "Fontes, a Democrat who is now running for secretary of state, issued a statement earlier this month supporting an identical proposal sponsored in the House by Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jeremy Duda",
    "title": "Lies about the 2020 election propel Arizona bills aimed at combating non-existent fraud"
  },
  {
    "id": 7060,
    "mediaId": 2627,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "In Trump’s honor, Arizona Republicans approve conspiracy-based election bills"
  },
  {
    "id": 6774,
    "mediaId": 2662,
    "date": "2022-01-26",
    "sentence": "The Gateway Pundit reported on these election integrity measures unveiled by Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jordan Conradson",
    "title": "BREAKING: Arizona Senate Committee Passes SEVEN Election Integrity Bills – Including Ballot Fraud Countermeasures, Ballot Images Will Be Public Records"
  },
  {
    "id": 6448,
    "mediaId": 2578,
    "date": "2022-01-27",
    "sentence": "WATCH: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Expects Arrests in Arizona: “Maricopa County Isn’t The Only County – We Are Waiting for Indictments”\nThe Gateway Pundit correspondent Jordan Conradson spoke to Senator Rogers about Arizona Attorney General Mark Brnovich’s investigation and decertification in Arizona.",
    "author": "Jordan Conradson",
    "title": "Arizona State Senator Wendy Rogers on Recalling Electors: “If Wisconsin Can Do It, Arizona Should Have Been FIRST”"
  },
  {
    "id": 6436,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nWho will decertify first?",
    "author": "Jordan Conradson",
    "title": "AZ State Senator Wendy Rogers Drops 88 Bills: “We Are Going Back to In-Person One Day One Vote NO MACHINES And Paper Ballots With Watermarks”"
  },
  {
    "id": 5556,
    "mediaId": 2578,
    "date": "2022-02-06",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nAZ Senate Republicans are pushing for serious election reform and decertification of the 2020 election.",
    "author": "Jordan Conradson",
    "title": "TOMORROW: AZ Senate Government Committee Considers 14 Election Integrity Bills – Drive-Up Voting; Prohibition, Voting; One Day Only; Holiday"
  },
  {
    "id": 5075,
    "mediaId": 2580,
    "date": "2022-02-17",
    "sentence": "– I don’t think we should go backward in terms of voting even though we obviously recognize that voting is an incredibly crucial piece of the way our country functions.”\nAs previously reported by Human Events News, Arizona state Rep. <span class='selected-term'>Mark Finchem</span> took his Arizona Ballot Integrity Project (BIP) national in October when he and approximately 30 others from around the country gathered at the suburban Dallas offices of international authentication leader, Authentix, to create a process for introducing a highly counterfeit-resistant paper ballot.",
    "author": "GOPUSA",
    "title": "BACK TO THE BASICS: Arizona Lawmakers Seek to Return to Paper Ballots, Hand Counts"
  },
  {
    "id": 4728,
    "mediaId": 2578,
    "date": "2022-02-21",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> recently presented a resolution to decertify the fraudulent election results, but Rusty Bowers lacks the courage to fight for Arizona voters.",
    "author": "Jordan Conradson",
    "title": "RINO Arizona House Speaker Rusty Bowers Files to Run for Senate After Turning On Constituents and Allowing Election Fraud"
  },
  {
    "id": 2035,
    "mediaId": 2662,
    "date": "2022-03-21",
    "sentence": "Despite the ongoing processes, The Arizona audit discovered over 700,000 ballot discrepancies, and Arizona State Representative <span class='selected-term'>Mark Finchem</span> has introduced a resolution to decertify the 2002 Presidential Election.",
    "author": "Jordan Conradson",
    "title": "Maricopa County Receives Renewed Request For Records Or Information In 2020 Election Investigation – What Are They Hiding Now?"
  },
  {
    "id": 561,
    "mediaId": 6746,
    "date": "2022-04-13",
    "sentence": "The Accused Politicians\nThose charged in the Superior Court of Arizona in Maricopa County are US Reps. Paul Gosar and Andy Biggs for reelection; while State Rep. <span class='selected-term'>Mark Finchem</span> for Arizona secretary of state announced this by the Austin, Texas-based Free Speech For People on April 7, cited Court House News Service.",
    "author": "Ed Forster",
    "title": "Democrats Attempt To Kick Out Two-Pro Trump Representatives, Arizona Lawmaker as Panic Sets in Before 2022 Midterm Elections"
  }
]