[
  {
    "id": 6984,
    "mediaId": 2630,
    "date": "2022-02-01",
    "sentence": "For example, Trump gave $5,000 to Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a secretary of state candidate who has called for the decertification of the 2020 election, and a matching amount to Rep. Jody Hice, R-Ga., who voted against certifying the election and is now running for secretary of state in Georgia.",
    "author": "",
    "title": "Trump gave $1M to Meadows nonprofit weeks after Jan. 6 panel's creation"
  },
  {
    "id": 5945,
    "mediaId": 2605,
    "date": "2022-02-08",
    "sentence": "He has brought Georgia Rep. Jody Hice and Arizona state Rep. <span class='selected-term'>Mark Finchem</span> onstage to speak at recent rallies.",
    "author": "Arit John",
    "title": "State election officials survived Trump’s attacks. Will they survive the ballot box?"
  },
  {
    "id": 4922,
    "mediaId": 2728,
    "date": "2022-02-15",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 panel subpoenas 6 more in fake GOP electors scheme"
  },
  {
    "id": 5103,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "It also issued them to four officials in states carried by President Joe Biden as he defeated Republican Trump's bid for re-election: Douglas Mastriano, a state senator in Pennsylvania; Laura Cox, a former member of the Michigan House of Representatives and chair of the state Republican party; <span class='selected-term'>Mark Finchem</span>, an Arizona state senator; and Kelli Ward, a former Arizona state senator and chair of the state Republican party.",
    "author": "",
    "title": "Jan. 6 Panel Issues 6 Subpoenas in 'Alternate Elector' Probe"
  },
  {
    "id": 4738,
    "mediaId": 2643,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Aaron McDade",
    "title": "Jan. 6 Committee Sends 6 New Subpoenas Focused on Fake Trump Electors"
  },
  {
    "id": 4800,
    "mediaId": 2631,
    "date": "2022-02-15",
    "sentence": "The panel also issued a subpoena Tuesday to <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state in Arizona and has been endorsed by Trump.",
    "author": "",
    "title": "New subpoenas from Jan. 6 committee target 'alternate elector' organizers"
  },
  {
    "id": 5121,
    "mediaId": 2748,
    "date": "2022-02-22",
    "sentence": "Ask Arizona Republican state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "STATION GOSSIP",
    "title": "AZ Rep Turns to Voters for Help as Pelosi's Goons Drag Him to DC for Interrogation Over Jan. 6"
  }
]