{
  "id": 1007,
  "mediaId": 8380,
  "date": "2022-02-17",
  "headline": "Pa. Republican Candidates Hope to Win Back Some Voters in Philly Suburbs",
  "image": "https://media.nbcphiladelphia.com/2021/03/AP_18134645442998.jpg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.nbcphiladelphia.com/decision-2022/pa-republican-candidates-hope-to-win-back-some-voters-in-philly-suburbs/3150795/",
  "mediaOutlet": "nbcphiladelphia.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lauren Mayk",
  "authorUrl": "https://www.nbcphiladelphia.com?s=Author%3A%20%22Lauren%20Mayk%22",
  "termIds": [
    0
  ],
  "sentences": [
    "“They’re looking for a message that is calm, intelligent, articulate and deals with their every day issues.”\nThe field of candidates running for the Republican nomination includes Mehmet Oz, who became a household name through his Dr. Oz daytime TV show, Dave McCormick, a former hedge fund manager, Carla Sands, a former ambassador during the Trump administration, and conservative commentator Kathy Barnette from Montgomery County.",
    "The question is how it’s going to play out in the rest of the state.”\nIn an interview outside the Wayne restaurant where he was mingling with voters, Bartos said he can convince voters who voted for Biden that they should vote for him, and said his campaign is talking about issues that resonate in the suburbs as well as in other parts of the state.",
    "Bill Hicks, of Wayne, predicted that convincing people to vote Republican this year will be “an easier task as bad as things have gotten.”\n\"I think there’s a good possibility that people will look at it and say maybe we need some change,\" Hicks said.",
    "“Listen, I think President Trump lost Pennsylvania because of the Southeast, and we need to figure out a way to get some of our voters back.”\nGetting those voters back involves having a message that resonates, Havey said.",
    "When it comes to factors Republican voters should weigh this year in the primary, the chairwoman of Montgomery County’s Republican committee says they should consider who can win the suburbs around Philadelphia.",
    "Talking to independents, Democrats need to stress that “our candidate stands for the principles you hold and this is the person for whom you should be voting,” Foster said.",
    "The developer, who previously ran for lieutenant governor in 2018, is one of several Republicans in a very deep field strongly courting Philadelphia's suburbs this year.",
    "John Fetterman, U.S. Rep. Conor Lamb who represents the Pittsburgh area, and Pennsylvania state Rep. Malcolm Kenyatta (D-Philadelphia) who represents North Philadelphia.",
    "“We need to save Main Street, Pennsylvania,” said Bartos, a Republican from Montgomery County who is campaigning for Pennsylvania’s open U.S. Senate seat.",
    "Standing between the bar and the appetizers set out at a Wayne restaurant, Jeff Bartos hopped up on a bench to see the crowd gathered in front of him.",
    "Four years ago, the heavily populated southeastern Pennsylvania suburban counties turned a deeper blue in helping President Joe Biden win the state.",
    "While some voters held signs and cheered when he arrived, others said they were just there to meet him and check out their options.",
    "Everybody feels down about the pandemic, or at least everybody I talk to -- doesn’t to matter what party you’re in,” she said.",
    "“I’m looking for somebody who is going to do what they say they are going to do,” said Patricia Nastasiak from Radnor.",
    "Hillary Clinton won all four so-called “collar counties” -- Bucks, Montgomery, Delaware and Chester -- in 2016.",
    "“That’s our goal,” said Joe Foster, who serves as chair of the Montgomery County Democratic Committee.",
    "Democrats are looking to hold onto crossover and independent voters who chose Joe Biden in 2020.",
    "They want safe communities, parents want a say in their children’s education,” Bartos said.",
    "Montgomery County commission chair Val Arkoosh recently suspended her campaign.",
    "But it’s what happened in 2020 that helps explain how Joe Biden won the state.",
    "Biden received 23% more votes in 2020 than Clinton did four years earlier.",
    "“I think it needs to be at the top of the list,” said Liz Preate Havey.",
    "“I think we can do it in Montgomery County with some success.",
    "“I think people want to hear how do we deal with inflation.",
    "The Democratic field includes Pennsylvania Lt. Gov.",
    "“Everyone deserves and wants safe streets.",
    "How do we deal with this pandemic?",
    "His task is daunting."
  ]
}