{
  "id": 10117,
  "mediaId": 6526,
  "date": "2022-04-03",
  "headline": "U.S. Senate candidates Kenyatta, Lamb blast Fetterman’s absence at Pa. Democratic primary debate in Allentown",
  "image": "https://www.mcall.com/resizer/c3uiOBlcgUwvyjphIlwHv7bmCbY=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/MPDIRSSGYRDWRPW3YWTF2OE7PQ.JPG",
  "link": "https://www.mcall.com/news/elections/mc-nws-kenyatta-lamb-debate-20220403-75oe5id7g5ch7np2i2ikwlazxe-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ford Turner",
  "authorUrl": "https://www.mcall.com/ford-turner-staff.html#nt=byline",
  "termIds": [
    0
  ],
  "sentences": [
    "Kenyatta, who is Black, said Fetterman has had nine years to “not only apologize for that but to understand why that was so dangerous.”\nA debate moderator, Muhlenberg professor Chris Borick, said written invitations to the debate went out in mid-February, with multiple follow-ups.",
    "He said he heard gunfire while outside his home and — indicating he was concerned about public safety — pursued a mask- and goggle-wearing man he saw running nearby, covered head to toe in the cold January weather, pulling out a shotgun until police arrived.",
    "John Fetterman, the third Democratic candidate for the Senate seat, who did not attend the debate at Muhlenberg College in Allentown — and whose absence was one of the biggest topics for candidates U.S. Rep. Conor Lamb and Pennsylvania Rep. Malcolm Kenyatta.",
    "Lamb said Kenyatta’s statement showed he campaigned “just like the Republicans” by using incorrect figures and said 70% “is not a true number.”\nFederal lawmakers have repeatedly sparred with each other over proposals to increase the national debt limit.",
    "When a brief power failure hit in the middle of a Sunday debate between two candidates for U.S. Senate, someone in the pitch-black room blurted out a single word that drew lots of laughter: “Fetterman.”\nIt was a joking reference to Lt. Gov.",
    "Kenyatta and Lamb were in general agreement on a number of topics, including skyrocketing student debt, the debt ceiling rule in Washington and allowing residents of Puerto Rico to decide whether they want to become a state.",
    "The cost of student debt, Lamb said, is something “we can actually lower.” He cited moves by Congress during his tenure to give borrowers pandemic-related moratoriums on making loan payments.",
    "The two also had harsh words for Fetterman’s handling of a 2013 incident in which, while holding a shotgun, he confronted a Black man whom Fetterman suspected had been involved in gunfire.",
    "A petrochemicals plant being built in western Pennsylvania because of the state’s rich natural gas deposits has created 10,000 construction jobs, Lamb said.",
    "Lamb, he said, has “voted for things that are completely out of the mainstream of where Democrats are” and “cut a very conservative record” in Congress.",
    "Borick noted that the average debt load for postsecondary students was more than $35,000 and asked candidates what they would do about it.",
    "The winner in the May 17 primary will face the winner of the Republican race, which has more than a half dozen candidates.",
    "He said natural gas is far cleaner burning than coal and could serve as a bridge to a cleaner energy future.",
    "The three are competing to replace Republican Pat Toomey, who is not running for reelection.",
    "The incident occurred while Fetterman was mayor of Braddock, in western Pennsylvania.",
    "The contest could be crucial in determining which party controls the Senate.",
    "Both candidates spoke favorably of abolishing the limit."
  ]
}