{
  "id": 10256,
  "mediaId": 8271,
  "date": "2022-04-04",
  "headline": "‘Boner 4ever’ hotel work begins; New shoes for Mr. Julian; Fetterman skips Senate debate | Morning roundup",
  "image": "https://billypenn.com/wp-content/uploads/2022/04/277595803_511687637227104_4917623728476163020_n-1200x630.jpg",
  "link": "https://billypenn.com/2022/04/04/philly-news-monday-morning-roundup-3/",
  "mediaOutlet": "billypenn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Billy Penn Staff",
  "authorUrl": "https://billypenn.com/about/billy-penn-staff/",
  "termIds": [
    4080,
    3989,
    3798,
    2709,
    158,
    1489,
    6462
  ],
  "sentences": [
    "$ = paywalled\nPa.’s first Democratic U.S. Senate debate took place yesterday, with candidates Conor Lamb and Malcolm Kenyatta mostly throwing barbs at rival John Fetterman, who is leading in polls and skipped the whole thing.",
    "[Axios/WHYY’s PlanPhilly]\nFor helpful gun violence coverage, stop framing stories as “breaking news” every time someone gets shot, and instead report on context and community, said participants at a virtual panel last week.",
    "Hotel renovations begin on ‘Boner 4ever’ building\nWork has begun on transforming North Philly’s Beury Building into a Marriott with 138 guest rooms and a rooftop bar, Shift Capital posted on Instagram.",
    "[PhillyVoice/CBS Sports]\nMAYOR WATCH\nMayor Kenney kicks off National Volunteer Month with a ceremony honoring the recipients of this year’s Mayor’s Day of Service Award (6 to 7 p.m.).",
    "[Billy Penn]\nBen Simmons, who declined to play, practice, or even show up for the Sixers before he was traded, officially filed a complaint asking for $20 million in withheld salary.",
    "Launched on April Fools’ Day and intended as a joke, the fundraiser took off as readers were amused by the students’ no-holds-barred trashing of the teacher’s footwear.",
    "ON THE CALENDAR\nThe first Nerd Nite Philly of the year takes over The Bourse with talks on the power of breakfast sandwiches to the Art Museum’s Duchamp exhibit.",
    "(6 to 9 p.m. Wednesday, April 6)\nMural Arts hosts a fundraiser art show at the Ukraine League of Philadelphia, featuring drawings, music, and Ukrainian poetry.",
    "The industry is riding a wave of consolidation, with “every open pad site along major roads” in the Philly region being looked at as a potential new location.",
    "[The Deal/Biz Journal$]\nMeet the three talented students who just won at regionals and will represent Philly in the Scripps National Spelling Bee this year.",
    "Two years ago, a graffiti documentarian told Billy Penn the origin story of the tags — which aren’t loved by some neighbors, who think of them as blight.",
    "[Inquirer$/Bloomberg]\nA court decision put the planned sale of 3990 Market St. on pause, as the city tries to keep affordable housing at the complex.",
    "The building is best known for the “Boner 4ever” graffiti on its tower, which the developer originally said could be incorporated into the design.",
    "“Now,” a student told Billy Penn, “we are able to buy Mr. Julian at least three pairs of sneakers!”\nRECAP: What else happened?",
    "Students’ joke fundraiser about teacher’s shoes goes viral\nNorth Philly ninth graders decided their history teacher “Mr.",
    "Julian”‘s shoes were so ugly, they had to buy him new ones, so they started a GoFundMe.",
    "Sign up for the free Billy Penn newsletter and it’ll land in your inbox every morning.",
    "The property owner opted not to renew its federal housing contract after 40 years.",
    "Within a day, the page had raised 10x its original goal.",
    "It’s now unclear if that will happen, per The Inquirer.",
    "The 76ers, meanwhile, have clinched a playoff spot.",
    "A poster-making session will start the evening.",
    "[Billy Penn]\nLove your mom and pop car wash?",
    "The NBA Players Association is backing him.",
    "Register to attend the virtual event here.",
    "Want this daily digest emailed to you?",
    "(6:30 to 8:30 p.m. Friday, April 8)",
    "It might soon disappear.",
    "Admission is $10."
  ]
}