{
  "id": 10487,
  "mediaId": 6570,
  "date": "2022-04-03",
  "headline": "Conor Lamb, Malcolm Kenyatta split on fracking, electability at U.S. Senate Democratic debate without John Fetterman",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/Election-2022-Pennsylvania-Senate-2-1649024404.jpg",
  "link": "https://www.post-gazette.com/news/politics-nation/2022/04/03/conor-lamb-malcolm-kenyatta-debate-livestream-john-fetterman-pennsylvania-us-senate-race-2022-opinion-polling/stories/202204030187",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julian Routh",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“You deserve a senator you can trust to show up and not to act like a loose canon.”\nResponding to questions about the accusation last week, the Fetterman campaign insinuated that Mr. Lamb is scrambling for a winning tactic because he’s losing the race, with a spokeswoman saying, “There are better ways to handle losing an election than what Conor Lamb is doing.”\nMr. Fetterman has said he never pointed the shotgun at the man and, when he took off after him in a truck, didn’t know he was Black.",
    "“The single technology that has allowed us to reduce our carbon emission the most in the United States is fracking because it has taken so much market share from coal.”\nMr. Kenyatta countered that Democrats can’t have it both ways, and said that job losses have nothing to do with the energy transition the U.S. is fostering now, but by big oil and gas companies sitting on existing permits and deciding that there’s not enough money in drilling new wells.",
    "Mr. Lamb, remarking that his support of fracking separates him from the mainstream of his party, said that if he had a chance to tell a group of Democrats in 2005 that there was a policy idea that would bring utility bills down, create jobs in the same areas where steel and coal used to thrive and make it less likely for America to go to war again in the Middle East, no one would be against it.",
    "ALLENTOWN, Pa. — In their first real debate ahead of the May 17 primary for Senate, U.S. Rep. Conor Lamb and Pennsylvania Rep. Malcolm Kenyatta found unity on Sunday in poking fun at the empty lectern where front-runner John Fetterman would have stood — if he attended — but split on their views on fracking and what it’ll take to win one of the most important seats in the country.",
    "Nonetheless, the presence in the race of Mr. Fetterman, who has led the field in recent polling by a wide margin, loomed over the 90-minute affair, and — along with obvious splits between Mr. Lamb and Mr. Kenyatta — underscored the fault lines in the Democratic Party on what makes the ideal standard-bearer to run in a vast and ideologically diverse state like Pennsylvania.",
    "Mr. Lamb called it “wrong,” while Mr. Fetterman has defended his actions in recent years by saying he made a “split-second decision to intervene for the safety and protection of my community, and intercepted the person to stop them from going any further until the first responders could arrive.”\n“That is fatal to his campaign,” Mr. Lamb said of the incident.",
    "This topic was bound to arise, as Mr. Lamb posted on social media late last week that Democrats would be in danger of losing this seat if Republicans used the news report from the incident, from when Mr. Fetterman, then mayor of Braddock, pursued and pulled a shotgun on a man because he believed he may have been involved in a shooting.",
    "He was dead wrong,” Mr. Kenyatta said, “and now he refuses to come here but expects you to vote for him.”\nIn responses to numerous questions about domestic and foreign policy, Mr. Lamb and Mr. Kenyatta — between not-so-subtle digs at the absent candidate — related their answers back to the core messages of their campaigns.",
    "The two Democrats, going toe-to-toe for the first time in a traditional debate setting a little over a month before the May 17 primary, used the stage at Muhlenberg College to accuse Mr. Fetterman, the lieutenant governor, of being an unserious candidate, unwilling to have tough conversations.",
    "To this end, he touted a resolution he introduced and President Joe Biden signed into law last year, reinstating standards that directly regulate methane, a potent greenhouse gas released by leaks in natural gas infrastructure, abandoned gas wells and the flaring of excess gas at well pads.",
    "Mr. Kenyatta criticized Mr. Lamb for insinuating that fracking simply has a public relations problem, when really, people are worried about pipelines being built near schools and seniors are concerned of the effects of living within so many miles of a fracking well.",
    "Mr. Fetterman’s campaign did not provide an explanation for his absence to debate organizers, but told the Post-Gazette late last week — to combat claims he’s hiding — that he has committed to participate in three televised debates in the coming month-and-a-half.",
    "He has, he said, and Pennsylvania is more than ready “to have a new day and to have a government that’s focused on them.”\nTailor-made for Western Pennsylvania, the debate elicited a long conversation about the future of natural gas production and fracking.",
    "Mr. Lamb compared Mr. Kenyatta to Republican candidates who’ve named voting-percentage comparisons in his races against him in the past, referring to when the GOP’s Sean Parnell said he voted in lockstep with House Speaker Nancy Pelosi.",
    "The claim that Mr. Lamb voted with Mr. Trump 70% of the time appears to be based on an analysis by FiveThirtyEight, in which the Congressman was deemed to have voted “in line with Trump’s position” 68% of the time from 2017 to 2019.",
    "For Mr. Lamb, it was that he has what it takes to win tough races — he’s done it before — and that he can speak to rural Pennsylvanians in ways that other Democrats can’t because he has the record in Congress to back it up.",
    "Mr. Lamb warned Mr. Kenyatta that if he were to share that message of a “just transition” with people who have jobs in the industry and are the most impacted by these decisions, they’d vote for someone else.",
    "Mr. Lamb, in his opening statement, said Democrats deserve a real debate between candidates who are serious about what it takes to win in November — and that people are counting on them to deliver a victory.",
    "He said Mr. Lamb voted with former President Donald Trump 70% of the time in his first term, and cited — in particular — votes to fund Mr. Trump’s border wall and to uphold pieces of the Trump tax bill.",
    "In one moment in the debate, Mr. Kenyatta tried to label Mr. Lamb a political chameleon, alleging that he’s moved “toward the zeitgeist of the Democratic Party” as he’s sought higher offices.",
    "Those people went through it with coal and steel, Mr. Lamb said, and as many are living paycheck-to-paycheck, it’s incumbent upon lawmakers to maximize the benefits of natural gas for them.",
    "Mr. Fetterman “didn’t respect you enough to show up today,” said Mr. Lamb, who alleged that the lieutenant governor was hiding from questions about a 2013 incident in Braddock.",
    "He said he’s cast thousands of votes, and noted that — on the border wall — the government was shut down because the House didn’t give the former president the money he wanted.",
    "The two candidates found harmony again at the conclusion of the debate, with Mr. Lamb thanking Mr. Kenyatta for attending and hitting Mr. Fetterman again for the empty lectern.",
    "For Mr. Kenyatta, it was that the party needs to lift up candidates who intimately understand the lives of working-class Pennsylvanians because they’ve lived it themselves.",
    "That’s what fracking has done, said Mr. Lamb, insisting that the practice has garnered a bad reputation because enforcement hasn’t kept up with the times.",
    "In the debate, Mr. Kenyatta hit back at Mr. Fetterman’s defense, saying he has had nine years to grasp why what he did was dangerous, but hasn’t.",
    "Voters didn’t have to wait more than two minutes to get a sense that the Band-Aid has been ripped off this otherwise-tame intraparty primary.",
    "He said the U.S. must stop approving new fracking permits, and that he’ll fight for a “just transition” to a clean energy future.",
    "“We can move to a clean energy future, but we have to tell people how we are going to get there,” Mr. Kenyatta said.",
    "I am.”\nMr. Fetterman's campaign said he will participate in debates on April 21 and April 25 and one in early May.",
    "“We absolutely need to eliminate basically 58 billion tons of CO2 pollution around the world,” Mr. Lamb said.",
    "Whether Mr. Fetterman knew the man was Black or not is irrelevant, the state representative added.",
    "The man turned out to be an unarmed Black jogger and had not been involved in a shooting.",
    "“It’s unacceptable,” Mr. Lamb said, “and that’s how you know he’s not ready for this.",
    "In the next session of Congress, from 2019 to 2021, the percentage dropped to 10.1%.",
    "The man, Christopher Miyares, said Mr. Fetterman aimed the shotgun at his chest.",
    "It can help the U.S. meet its climate goals, too, Mr. Lamb said.",
    "This story was updated at 5:30 p.m. on Sunday, April 3, 2022.",
    "“John doesn’t have to be racist to be wrong.",
    "It has to be done responsibly, he said.",
    "First Published April 3, 2022, 11:34am"
  ]
}