{
  "id": 10927,
  "mediaId": 2658,
  "date": "2022-03-14",
  "headline": "POLITICO Playbook: Something unusual is happening between Biden and Congress",
  "image": "https://static.politico.com/70/e7/4643813a4ca8988e11c499ff1cc3/gettyimages-1384065308.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/03/14/something-unusual-is-happening-between-biden-and-congress-00016935",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5682,
    4905,
    2469,
    4591,
    2859,
    2814,
    1433,
    1063,
    6526,
    6569,
    6672
  ],
  "sentences": [
    "JOHN FETTERMAN and Rep. CONOR LAMB run ads arguing why they can win in one of the nation’s top battleground states, GOP candidates there have dropped a record-shattering $35 million on TV — the vast majority coming from MEHMET OZ and DAVE MCCORMICK, the leading Republicans, whose camps are framing the other as a ‘liberal RINO’ and ‘Wall Street insider,’ respectively.”\n“‘They’re doing what I want them to do, which is kick the crap out of each other,’ said J.B. POERSCH, president of the Senate Majority PAC, Senate Democrats’ flagship super PAC.”\n— ICYMI (for all you watching this crazy Missouri primary …): “Schmitt raises $1.6M at Mar-a-Lago event, lands visit from Trump,” by Fox News’ Brooke Singman\nCHENEY’S GAMBIT — In 2007, the leftist crowd in Wyoming's liberal bastion of Jackson Hole dragged an effigy of DICK CHENEY through downtown in protest of the Iraq War.",
    "Her social media feeds are filled with images of her riding a motorcycle at the Sturgis Motorcycle Rally, on horseback carrying an American flag, showing off a flamethrower and hunting pheasants.”\n2024 WATCH — “Anti-Trump Republicans lining up for 2024 shadow primary,” by AP’s Steve Peoples\nKEY UKRAINE READS\nOVERNIGHT — “Talks between Russia and Ukraine to resume after deadly attack on military base,” by The Guardian\nRUSSIA TURNS TO CHINA FOR HELP — “Russia has requested military and economic assistance from China, U.S. officials say,” per CNN\nBut, but, but … “China faces consequences if it helps Russia evade sanctions, U.S. says,” per Reuters\nMEANWHILE — “Zelensky presses Biden to increase economic pressure on Moscow, expand sanctions,” by WaPo’s Jeff Stein\nTHE STEP BACK — “How Does It End?",
    "“I think we’re living in a time when we’re not at the end of history and the question of whether the ultimate organization of societies that’s going to work best is one like ABRAHAM LINCOLN talked about at Gettysburg when he talked about ‘by the people, for the people,’ is still an issue,” Summers says, “because China has a very different model and they’ve had really very remarkable results.” Watch and read more from the conversation here\nIRAN SENDS A WARNING — Iranian officials on Sunday “claimed responsibility for a missile barrage that struck near a sprawling U.S. consulate complex in northern Iraq, saying it was retaliation for an Israeli strike in Syria that killed two members of its Revolutionary Guard earlier this week,” AP’s Qassim Abdul-Zahra reports.",
    "And yet, as our Marianne LeVine writes this morning, Senate Republicans have coalesced around one key principle for the looming confirmation process: “that they’ll keep it classy.”\n“‘The best message I can give you at this point, but I think you’ve heard me say it before: It’s going to be a fair, thorough hearing, and we’re not going to get in the gutter like the Democrats did,’ said Iowa Sen. CHUCK GRASSLEY, the top Republican on the Judiciary Committee.”\nThat’s where the agreement ends, however, Marianne writes.",
    "‘It is essential to use as much as possible fragments of broadcasts of the popular Fox News host Tucker Carlson, who sharply criticizes the actions of the United States [and] NATO, their negative role in unleashing the conflict in Ukraine, [and] the defiantly provocative behavior from the leadership of the Western countries and NATO towards the Russian Federation and toward Putin, personally,’ advises the 12-page document written in Russian,” which was obtained by Mother Jones’ David Corn.",
    "Indeed, Russia over the weekend warned that it would view any such delivery as an escalation, and signaled that any such convoys (even American-delivered ones) would be considered “legitimate targets.”\nAlex Ward, who anchors POLITICO’s National Security Daily newsletter, noted Sunday that the administration has gone out of its way to avoid any moves that could trigger further conflict with Russia.",
    "Meanwhile, Sen. AMY KLOBUCHAR (D-Minn.) — who doesn’t break often with President JOE BIDEN — said the U.S. shouldn’t rule out making the transfer: “I have made clear to them — I spoke to the president himself about 10 days ago about this — I’d like to see the planes over there,” she said on “State of the Union,” floating the idea of other types of air defense assistance that could also work.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Hawks of Monument Advocacy … Lily Adams … Fox News’ John L. Wallace III … Eric Reath of Rep. Lloyd Smucker’s (R-Pa.) office … Moderna’s John Lepore … Jimmy Loomis of Rep. Stephanie Murphy’s (D-Fla.) office (27) … Georgetown’s Lauren Mullins … Jason Johnson … Virginia Dem Chair Susan Swecker … POLITICO’s Campbell Rawlins … Alicia Pardo … former Rep. Bill Jefferson (D-La.)",
    "Our colleagues also scooped Sunday that a “Pentagon push to send more trainers to Ukraine was scrapped in December amid White House fears of provoking Russia.”\nThe supporters’ POV: Supporters of approving a transfer of fighter jets argue that Russia has drawn multiple lines that the West has already crossed — and that VLADIMIR PUTIN is the aggressor here.",
    "POLITICO Playbook: Something unusual is happening between Biden and Congress\nBy RACHAEL BADE\n03/14/2022 05:54 AM EDT\nPresented by\nDRIVING THE DAY\nHEARTBREAKING NEWS OVERNIGHT — AP: “A pregnant woman and her baby have died after Russia bombed the maternity hospital where she was meant to give birth, The Associated Press has learned.",
    "ALL POLITICS\nSENATE GOP PRIMARY FIGHTS GET NASTY — GOP political types in Washington all privately agree on one thing when it comes to flipping the Senate in 2022: If they fail to seize the majority, it’s largely going to be because they can’t get out of their own way in a series of contentious primaries across the nation.",
    "KRISTI NOEM’s “election-year fight with fellow Republicans in the Legislature has spurred criticism she is neglecting her job to angle for the White House, but the resistance could actually be helping her national brand rather than tarnishing it,” AP’s Stephen Groves and Thomas Beaumont write.",
    "Although a chunk of her agenda has been derailed by Republican lawmakers, “Noem has shown a knack for the political theatrics invaluable in [DONALD] TRUMP’s Republican Party and last month won the former president’s endorsement for her reelection campaign.",
    "Images of the woman being rushed to an ambulance on a stretcher had circled the world, epitomizing the horror of an attack on humanity’s most innocent.”\nPRESSURE POLITICS — Something quite striking has happened in Washington since Russia invaded Ukraine.",
    "ENGAGED — Amanda Golden, news comms manager at Google News and Google News Initiative and an NBC News alum, and Matthew Kincaid, a 3L at University of Virginia School of Law and an incoming associate at Sullivan & Cromwell, got engaged Saturday.",
    "Pic\nWELCOME TO THE WORLD — Jeffrey Cimmino, associate director of the Scowcroft Strategy Initiative at the Atlantic Council, and Anne Houtz Cimmino, assistant to the owner at Authentically You Weddings, welcomed Adeline Rose Cimmino on Friday.",
    "A Way Out of the Ukraine War Proves Elusive,” by NYT’s David Sanger and Eric Schmitt\nAMERICA AND THE WORLD\nFUTURE-CASTING — For POLITICO’s 15th anniversary, we’re hosting unfiltered one-on-one conversations about the next 15 years.",
    "… Amy Travieso … Rick Grafmeyer … Kathy Wright … Kelsey Cooper of Sen. Rand Paul’s (R-Ky.) office … Kei Helm … John Connolly of Mission: Readiness (26) … Margita Thompson … Ashley Simmons\nDid someone forward this email to you?",
    "ROB PORTMAN (R-Ohio), speaking from the Ukraine-Poland border, noted on CNN’s “State of the Union” on Sunday that Putin had also called sanctions an “act of war” and warned the U.S. against providing stringers and helicopters.",
    "Mark Gordon … White House’s Rory Brosius … Bill McGinley of the Vogel Group … Faith McPherson of National Public Affairs … WaPo’s Christine Emba … Andrea Bozek of Big Dog Strategies … AEI’s Kevin Kosar … Deb Jospin … T.A.",
    "— Thursday: Biden will have a bilateral meeting with Irish Taoiseach MICHEÁL MARTIN, and the Bidens, Harris and Emhoff will host the Martins for a St. Patrick’s Day tradition: a shamrock presentation at the White House.",
    "This morning, our Natalie Allison has a story about GOP candidates “thrashing” each other in about a dozen primaries in key swing states — all while Democrats have largely held their fire in a pair of key primaries.",
    "But they are still hoping to unify progressives and moderates like Sen. JOE MANCHIN (D-W.Va.) behind a package that addresses prescription drug costs, tax reforms and climate change — and perhaps an Obamacare fix.",
    "Ex-military Democratic Reps. JASON CROW (Colo.), JARED GOLDEN (Maine) and CHRISSY HOULAHAN (Pa.) and a couple of others signed a bipartisan letter backing the move, as we first reported in Playbook PM on Friday.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nCONGRESS\nHIDDEN AGENDA — Congressional Democrats left their Philadelphia retreat last week disappointed in the lack of a game plan to revive their stalled domestic agenda.",
    "Pandemic relief: In the House, a senior Democratic aide tells us conversations about finding an alternative pay-for to cover a new tranche of pandemic relief will pick up again likely this week.",
    "“With Russia’s alarming disregard for Ukrainian civilian casualties, the U.S. must … help supply more comprehensive air defense systems to defend Ukraine and its people,” the letter read.",
    "Congress — which typically takes a back seat on foreign policy matters — has repeatedly driven the White House beyond its comfort zone with bipartisan demands for more assertive policies.",
    "RUSSIA HEARTS TUCKER: A little over a week into Russia’s invasion of Ukraine, “the Kremlin sent out talking points to state-friendly media outlets with a request: Use more TUCKER CARLSON.",
    "And this week, lawmakers will be at it again — this time nudging the Biden administration to go further than it wants in facilitating the transfer of fighter jets from Poland to Ukraine.",
    "I don’t understand why we’re not doing it.”\nThe build-up: While Republicans led the charge calling for the transfer last week, over the weekend we saw some Hill Democrats join the fray.",
    "They downplayed suggestions that they saw the retreat as a place to iron out a timeline for pushing their policies through Congress and settling on a message for the midterms.",
    "It’s why Democrats started talking last week about Biden going it alone via executive actions as a way to move items that have stalled out but are being demanded by the base.",
    "While Democrats went into recent confirmation fights centered on a specific theme, Republicans appear to be all over the place in what they want to talk about and emphasize.",
    "We’re told that lawmakers will head to a conference on this bill, a win for frontliners who are eager to tout the legislation as a response to supply-chain bottlenecks.",
    "She has shunned town halls and other voter forums in Wyoming’s overwhelmingly red counties in favor of controlled events.”\nALL POLITICS IS NATIONAL — South Dakota Gov.",
    "PIN THIS: SENATE GOP VOWS ‘RESPECTFUL’ SCOTUS FIGHT — Compared to knock-down-drag-out SCOTUS fights of recent memory, it seems not only odd but virtually impossible.",
    "Many — particularly frontliners in vulnerable districts — had hoped that Biden would offer some clarity as they search for a winning strategy ahead of the midterms.",
    "The White House POV: The Biden White House — worried about ratcheting up tensions with the Kremlin — has rejected Poland’s offer to move their Soviet-style planes.",
    "Members of both parties then clamored for a U.S. ban on Russian oil, which the White House saw as politically risky given the effect on gas prices at home.",
    "“I still don’t rule out having planes at some point.”\nSo is it just a matter of time before the Biden White House flips and moves on the Poland transfer?",
    "Mitt Romney accused Tulsi Gabbard of “treasonous lies” that “may well cost lives.”\nAdam Kinzinger regrets not voting to impeach Trump the first go-round.",
    "Pic … Another pic\n— George Khalaf, managing partner of the Resolute Group, proposed to Briana Johnson, political fundraiser at Radiance Strategies.",
    "“Iraq’s Foreign Ministry on Sunday summoned Iran’s ambassador to protest the attack, calling it a flagrant violation of the country’s sovereignty.",
    "“Her campaign is loath to talk strategy publicly, but the math doesn’t lie — and neither do Cheney’s actions on the ground here in recent months.",
    "(They want unilateral action on everything from student loan forgiveness and voting rights to criminal justice reforms and immigration issues.)",
    "Leaders are eyeing the work period between the return from that break and Memorial Day as the sweet spot to finally pass a reconciliation bill.",
    "Confirmation hearings to seat KETANJI BROWN JACKSON on the high court will start next week and dominate Congress’ attention until a final vote.",
    "Instead, the president — with his attention focused on the war in Ukraine — talked more about wanting to tout what they passed last year.",
    "In the first installment of our series, former Treasury Secretary LARRY SUMMERS sits down with billionaire hedge fund manager RAY DALIO.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "BIDEN’S WEEK AHEAD:\n— Tuesday: The Bidens, VP KAMALA HARRIS and second gentleman DOUG EMHOFF will take part in an Equal Pay Day event.",
    "It started with calls for tougher sanctions, then escalated to an appeal for a larger military and humanitarian assistance package.",
    "The proposal, which took place in front of the same spot in D.C., was followed by a surprise celebration with family and friends.",
    "The China competition bill: The legislation has passed both chambers, but the provisions of each measure are quite different.",
    "The two discuss everything from inflation and redistribution to political polarization and global competition with China.",
    "ESPN: “What to know about every team in the men's NCAA tournament bracket”\nBarack Obama has Covid-19, but says he’s fine.",
    "MEDIA MOVES — Natalie Pahz is now director of comms for CBS’ “60 Minutes.” She previously was a senior PR manager at CNN.",
    "TRANSITIONS — Margarita Valdez is now the director of policy and advocacy at the American Society of Gene & Cell Therapy.",
    "It has even taken steps back to ease tensions, such as canceling special operations training and delaying missile tests.",
    "Hill Democrats have some unfinished business that they’re hoping to make headway on in the coming days, including:\n1.",
    "— 2:10 p.m.: Biden will address the National League of Cities Congressional City Conference at the Marriott Marquis.",
    "Senate Democrats are still hoping to get Jackson confirmed before the two-week Easter recess that begins April 12.",
    "… Glen Echo Group is adding Ashley Durkin-Rixey as a senior director and Kieran Henstenburg as a graphic designer.",
    "And Trumpist Republicans are doing everything in their power to stop her, Tara Palmeri reports from Jackson, Wyo.",
    "She previously was assistant director of congressional relations at the American Society for Radiation Oncology.",
    "That comes after Democratic infighting killed the White House’s request for billions in new funding last week.",
    "She previously was deputy foreign editor at WaPo, and is a WSJ, NYT, Businessweek and POLITICO Magazine alum.",
    "She previously was a principal at Rich Feuer Anderson, and is a Visa, Tom Carper and Ed Perlmutter alum.",
    "By Sunday, the 58-member-strong bipartisan Problem Solvers Caucus — half Democrats — had joined them.",
    "“They want the ability to have better control over the skies in order to give them a fighting chance.",
    "“What we’ve heard directly from the Ukrainians is they want them badly,” Portman said of the planes.",
    "No, it won’t look anything like Build Back Better — a phrase you don’t hear Democrats utter anymore.",
    "Now, his daughter LIZ CHENEY is turning to the same swath of voters to save her hide in November.",
    "No injuries were reported.”\nPLAYBOOKERS\nMARCH MADNESS STUDY GUIDE — Time to get your picks ready.",
    "What is clear is that Congress has had success with this type of vocal, bipartisan push before.",
    "— Amanda Slater is now SVP of public policy and head of U.S. federal affairs at Mastercard.",
    "… Adam Ozimek is joining the Economic Innovation Group as its first ever chief economist.",
    "THE SENATE will meet at 3 p.m. to take up SHALANDA YOUNG’s nomination as OMB director.",
    "BIDEN’S MONDAY:\n— 10:30 a.m.: The president will receive the President’s Daily Brief.",
    "The Plan B, the aide said, might be smaller than the original $15 billion proposed.",
    "FIRST IN PLAYBOOK — Eva Rodriguez is joining The Fuller Project as editor-in-chief.",
    "She previously was assistant director of media relations for the Atlantic Council.",
    "And they insisted that the U.S. end permanent normal trade relations with Russia.",
    "Durkin-Rixey most recently was a director of comms at ACT | The App Association.",
    "They first met on a blind date set up by a mutual friend in December 2018.",
    "WaPo’s Amy Wang has more on the bipartisan movement on the plane issue.",
    "Further off: A SCOTUS fight — then, maybe, a reconciliation bill.",
    "Pic\nHAPPY BIRTHDAY: Rep. Dan Crenshaw (R-Texas) … Wyoming Gov.",
    "… Nicole Meir has joined the AP as media relations manager.",
    "Take Pennsylvania: “As the Democratic frontrunners Lt. Gov.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "That doesn’t mean action in the Capitol is non-existent.",
    "— 7:45 p.m.: Biden will take part in a DNC fundraiser.",
    "It’s unclear whether Senate Republicans would back it.",
    "He most recently was chief economist at Upwork.",
    "Send Playbookers tips to playbook@politico.com.",
    "Press secretary JEN PSAKI will brief at 3 p.m.",
    "Senior Democrats weren’t surprised by this.",
    "(Read on for more on Ukraine below.)",
    "Thanks for reading Playbook.",
    "Ditto for Jeanne Shaheen.",
    "The tactics have worked.",
    "Good Monday morning.",
    "THE HOUSE is out.",
    "Sign up here.",
    "Perhaps.",
    "Sen.",
    "2.",
    "3."
  ]
}