{
  "id": 10930,
  "mediaId": 2728,
  "date": "2022-03-18",
  "headline": "Dr. Oz’s heritage is targeted as rivals vie for Trump backing",
  "image": "https://images.thestar.com/2Y9GpJmG9FwvmKyDqxp3I73pZi8=/1200x800/smart/filters:cb(1647653775527)/https://www.thestar.com/content/dam/thestar/news/world/us/2022/03/18/dr-ozs-heritage-is-targeted-as-rivals-vie-for-trump-backing/dr_oz.jpg",
  "link": "https://www.thestar.com/news/world/us/2022/03/18/dr-ozs-heritage-is-targeted-as-rivals-vie-for-trump-backing.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Shane Goldmacher",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Oz” but as “Mehmet Oz.” Standing in front of an oversize American flag, McCormick opens the ad by saying, “When Mehmet Oz questions — my — patriotism, he’s crossed the line.”\nThe McCormick campaign has hired influential Trump alumni to guide its effort, including former White House aides Stephen Miller and Hope Hicks, and the McCormicks’ private lobbying has included a separate dinner with Donald Trump Jr., according to people told of the meal.",
    "His career arc from West Point graduate to the financial world more neatly fits the traditional Republican establishment mould, and he said last year that the riot at the Capitol on Jan. 6, 2021, was “a dark chapter in American history.”\nFor his part, Oz first found fame as a regular guest on “The Oprah Winfrey Show,” and clips showing him dancing with Michelle Obama have made their way into ads attacking him.",
    "At Goldman Sachs, she oversees the firm’s global business with foreign governments and their investments, and this month, she was appointed by the top Republican in the House to serve on the advisory board of the Middle East Partnership for Peace, which is guiding investments of $250 million to promote Israeli-Palestinian coexistence.",
    "Late last year, before he had formally entered the Pennsylvania Senate race, David McCormick flew to Florida for a private meeting with Donald Trump, angling to get in the former president’s good graces before a Republican primary that would soon pit him against Dr. Mehmet Oz, a celebrity surgeon and television personality.",
    "Sean Hannity of Fox News, who endorsed Oz this week, has been whispering in Trump’s ear on Oz’s behalf, according to people familiar with those conversations, and Oz has made a dozen appearances on Hannity’s prime-time show since he entered the race, according to Media Matters, a liberal media watchdog group.",
    "Calling the issue a “distraction,” he accused McCormick of making “bigoted attacks” that were “reminiscent of slurs made in the past about Catholics and Jews.”\nOz would be the first Muslim senator in the United States, but he has not emphasized that history-making aspect of his candidacy.",
    "Oz has narrated some of his campaign’s ads counterattacking McCormick, saying in one, “He’s part of the swamp that labelled President Trump as Hollywood — just like they say about me.”\nIn one commercial referring to his rival by name, McCormick did so not with the familiar “Dr.",
    "At one point, Powell McCormick, an Egyptian-born Coptic Christian who is fluent in Arabic, pulled out a picture that showed Oz alongside others wearing Muslim head coverings, according to four people briefed in detail on the exchange, which has not previously been reported.",
    "She said it was “designed to distract from the legitimate national security concerns” about Oz that “could pose significant security risks,” including his dual citizenship, his Turkish military service, connections to the Turkish government and financial links abroad.",
    "In a sign of the perceived power of the former president’s endorsement, Powell McCormick has called Trump so often in recent months that he has complained to people about the frequency of her calls, according to two people who have heard from him about it.",
    "McCormick, then the CEO of the world’s largest hedge fund, had an edge in pitching Trump: His wife, Dina Powell McCormick, had been a senior national security official in the Trump White House, and she accompanied him to the meeting at Mar-a-Lago.",
    "“This is an anonymous, false smear on a candidate’s wife who is an Arab American immigrant woman who fled the Middle East to escape religious persecution,” Szymanski said of the account of the McCormicks’ meeting with Trump.",
    "As McCormick and his wife, now a top Goldman Sachs executive, made their case, the topic soon turned to electability and Oz’s Turkish American heritage, which has since become a central point of contention in the campaign.",
    "Born in Ohio to Turkish immigrants, Oz did serve in the Turkish army and has said that he maintained dual citizenship in recent years to make it easier to visit his mother, who has Alzheimer’s disease and lives in Turkey.",
    "Rob Gleason, a former chair of the Pennsylvania Republican Party, said a Trump endorsement in the state’s race “could be the tipping point in a close election.”\n“He’s just very important in Republican circles,” he said.",
    "But Oz’s ties to Turkey have lingered as an issue, for there is no known precedent of a sitting senator holding dual citizenship with a nation that can be at odds with U.S. foreign policy.",
    "The four people who described the exchange between the McCormicks and Trump did not know the setting or the source of the photograph they said Powell McCormick showed the former president.",
    "He previously supported key elements of the Affordable Care Act and, although he calls himself “pro-life,” he struggled in a Fox News interview to articulate when he believes life begins.",
    "A third Senate candidate, Carla Sands, whom Trump named ambassador to Denmark, is also running in Pennsylvania and had her own private audience with the former president last year.",
    "The former president’s initial choice in the race, Sean Parnell, withdrew in November after losing custody of his children following allegations of abuse in a divorce proceeding.",
    "The Pennsylvania Republican primary has already seen millions of dollars in television ads, as both rivals sell themselves as the most conservative and most pro-Trump candidate.",
    "The McCormick campaign has publicly made Oz’s heritage an issue from McCormick’s first day as a candidate in January, when he called on Oz to renounce his Turkish citizenship.",
    "Bartos has not had a formal sit-down with Trump, although the two spoke at an impromptu meeting at Mar-a-Lago a few months ago, according to a person told of the interaction.",
    "The former president has told people who have spoken to him about the race that he deeply appreciates the political power of such a celebrity given his own experience.",
    "And with polls showing a competitive Republican contest, the race is already awash in negative ads and on pace to be one of the most expensive primaries in the nation.",
    "Among the few images readily accessible online in which Oz can be seen with people wearing Muslim head coverings are scenes from his father’s 2019 funeral in Istanbul.",
    "The people briefed on the conversation said Powell McCormick told Trump that the fact that Oz was Muslim would be a political liability in parts of Pennsylvania.",
    "Powell McCormick was a key member of the White House’s Middle East team in the early days of the Trump administration and maintains extensive ties to the region.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "In an opinion essay in the Washington Examiner in January, he wrote that he had been “raised as a secular Muslim” and that his four children are all Christian.",
    "A video shows Oz behind two imams wearing turbans and clerical robes; later, he helps carry the coffin, draped in a green pall decorated with Quranic verses.",
    "McCormick was considered for various posts in the Trump administration and met with the president-elect in 2016, although he never joined the government.",
    "He was the 2018 Republican nominee for lieutenant governor and entered the Senate race last March — more than six months before either McCormick or Oz.",
    "Also running is Kathy Barnette, a political commentator who has written a book about being Black and conservative and has raised more than $1 million.",
    "Facing the possible defeat of candidates he is backing in other states, Trump has turned at least temporarily more cautious in some key Senate races.",
    "Just as he is doing in two other crowded Republican primaries, in Ohio and Missouri, Trump is not picking sides while the field remains muddled.",
    "A spokesperson for Trump confirmed that the private meeting with McCormick and his wife took place but declined to comment on anything said.",
    "An anti-Oz super PAC has slammed the surgeon as a “RINO,” for Republican in name only, with vivid images of him kissing his Hollywood star.",
    "Oz spoke with Trump both by phone before entering the Senate race in late November and in person at Mar-a-Lago just before Christmas.",
    "McCormick is the former CEO of the Bridgewater hedge fund and served in the Treasury Department of the second Bush administration.",
    "The McCormick campaign denied that account and insisted that the couple has focused only on Oz’s ties to Turkey as a liability.",
    "The early meeting with Trump was just one sign of the intensity of the race to succeed retiring Sen. Pat Toomey, a Republican.",
    "His campaign has since accused Oz of harbouring “dual loyalties.” Oz’s Muslim faith has not been part of the public debate.",
    "“He still is.”\nSHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "Trump, according to advisers, has tracked the race closely but appears content — for now — to sit on the sidelines.",
    "A Fox News survey in early March showed McCormick leading, with 24%, and Oz at 15%, but many voters were undecided.",
    "The Senate candidate’s Turkish background has emerged as a focus of one rival’s attacks in Pennsylvania’s G.O.P.",
    "“The assertion that any points beyond those have ever been raised is categorically false,” Szymanski said.",
    "For now, Trump remains uncommitted even as both camps have aggressively sought his stamp of approval.",
    "He jealously guards his endorsement record and was already burned by his early backing of Parnell.",
    "(After Sen. Ted Cruz, R-Texas, learned he had Canadian citizenship, he renounced it in 2014.)",
    "The Pennsylvania seat is a linchpin in both parties’ pursuit of the Senate majority in 2022.",
    "McCormick’s spokesperson, Jess Szymanski, echoed the concerns he has been raising publicly.",
    "A fourth candidate, Jeff Bartos, has contributed more than $1 million to his own campaign.",
    "And in 2016, Oz interviewed Trump on his show at the height of the presidential campaign.",
    "In both those states, he has also met with multiple candidates vying for his backing.",
    "On Wednesday, Oz and his wife, Lisa, had dinner with Trump and his wife, Melania.",
    "On Wednesday, Oz said he would renounce his Turkish citizenship if elected.",
    "Like Trump himself, Oz built a national following as a television star.",
    "John Fetterman, U.S. Rep. Conor Lamb and state Rep. Malcolm Kenyatta.",
    "The pro-Trump label can be an awkward fit for both McCormick and Oz.",
    "Trump’s blessing is widely seen as potentially decisive.",
    "But a Trump endorsement of Oz would have its own logic.",
    "Limited public polling shows a wide-open contest.",
    "The Star does not endorse these opinions.",
    "The Democratic field includes Lt.-Gov.",
    "primary."
  ]
}