{
  "id": 11632,
  "mediaId": 2745,
  "date": "2022-03-28",
  "headline": "Blinding snow squalls lead to deadly pileup on I-81 in Pennsylvania",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CRQ3ZOFOZUI6ZHN5BVDATVCMDQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/weather/2022/03/28/snow-squall-pileup-i81-pennsylvania/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3989,
    1359,
    881,
    1031,
    6591,
    6506,
    6208
  ],
  "sentences": [
    "A 2018 paper by several National Weather Service employees found that the statements did not “command the same level of urgency or breadth of dissemination as a warning.”\nThe 2018 paper also noted “snow squalls were the second leading cause of weather related fatalities across Pennsylvania over a ten year period ending in 2008, behind only flood related deaths.”\nIt's decidedly UN-springlike across the northeast today with widespread bursts of snow.",
    "John Fetterman, lieutenant governor of Pennsylvania, tweeted, “Gisele and I express our *deepest* condolences over this morning’s horrific crash on Interstate 81 in Schuylkill County and gratitude to the first responders on the scene.”\nOne video (caution: strong language) posted to social media depicts a man exiting his vehicle seconds before it is obliterated by an oncoming traveler.",
    "Learn more about them here:https://t.co/SrxK5oxrZZ pic.twitter.com/LYai3PV6ql\n— National Weather Service (@NWS) March 28, 2022\nThe warnings for snow squalls were introduced because they can generate “sudden whiteout conditions and slick roadways” that may “lead to high speed accidents with large pileups that result in injuries and fatalities,” the Weather Service wrote.",
    "In the past, “special weather statements,” similar to blanket bulletins, were disseminated to advise travelers about the hazard, but the alerts didn’t reach people as directly as a tailored warning.",
    "The National Weather Service in State College, Pa., did not appear to issue a snow squall warning ahead of the accident as that particular squall was difficult to detect on radar.",
    "More than 50 vehicles were involved in a pileup on Interstate 81 in Schuylkill County, Pa., on Monday, killing six people and closing a seven-mile stretch of the highway.",
    "Snow squalls are so dangerous that in 2017 the National Weather Service debuted a “snow squall warning” that would target drivers who might approach a snow squall.",
    "Six people died, according to a report that the Pennsylvania State Police sent to The Washington Post on Wednesday, and 24 people were taken to hospitals.",
    "Forty people were injured and three killed during a pileup caused by a snow squall on Interstate 75 in Detroit in 2013, mlive.com reported.",
    "As additional snow squalls swept across the state, the State College Weather Service office issued 15 warnings, mostly Monday afternoon.",
    "Studies show that it takes the average driver half to three-quarters of a second to recognize a threat and apply the brakes.",
    "The snow squalls formed as unseasonably cold air from the northwest spread over the interior Mid-Atlantic and Northeast.",
    "A similar chain-reaction crash occurred on Interstate 93 in New Hampshire in 2015, according to a Boston CBS affiliate.",
    "“This new warning aims to bring better situational awareness to drivers and mitigate impacts related to these squalls.”",
    "In February 2021, six people died in a 133-vehicle crash triggered by freezing drizzle near Dallas, CBS DFW reported.",
    "Schuylkill County is about 30 miles west of Allentown, Pa., and about 85 miles west of New York.",
    "These dangerous snow squalls can bring visibility to near-zero with little-to-no warning.",
    "Such squalls often feature sudden gusty winds, heavy snow and reduced visibility.",
    "A vehicle traveling at 60 mph would have moved 44 to 66 feet during that time.",
    "The crash was first reported near Minersville shortly after 10:30 a.m. Monday.",
    "Then comes the stopping distance, which can be several hundred feet.",
    "Blinding snow squalls were moving through the region at the time.",
    "It’s roughly midway between Harrisburg and Scranton.",
    "Snow squalls have triggered deadly pileups before.",
    "That’s exit 116 on I-81."
  ]
}