{
  "id": 1278,
  "mediaId": 2746,
  "date": "2022-02-17",
  "headline": "Lt. Gov. John Fetterman hulks over Pa.’s Dem race for Senate with no-nonsense style, far-left views",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/02/08/election_2020-senate-pennsylvania_41078_c0-0-3331-1943_s1200x700.jpg?80ea22a366728a411f09fd4e8c3377d4c92fb742",
  "link": "https://www.washingtontimes.com/news/2022/feb/17/lt-gov-john-fetterman-hulks-over-pas-dem-race-sena/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    0
  ],
  "sentences": [
    "He said Mr. Fetterman “realized early something that many elected officials are only just coming to understand: that ending our failed prohibition on marijuana isn’t just good policy; it is good politics.”\n“Fetterman has been able to articulate succinctly to the broader public why prohibition is a disastrous policy and what the benefits are of moving to a regulated market for marijuana,” he said.",
    "Standing 6 feet, 9 inches tall, weighing about 300 pounds and sporting a goatee and a bunch of tattoos, Mr. Fetterman has showcased an Andre the Giant-like gravitational pull that Democrats say helps him connect with voters that otherwise might pooh-pooh his far-left vision.",
    "“Conor has been really restrictive to his immediate universe.”\nMr. Fetterman scored a moral victory late last month after no one in the field of contenders reached the two-thirds threshold needed to win the endorsement from the Pennsylvania Democratic Party.",
    "Asked whether Mr. Fetterman’s physical appearance helps open people to his message, Erik Altieri, executive director of NORML PAC, said, “I have no comment on aesthetics.”\nMr. Altieri instead credited Mr. Fetterman’s success to his policy vision.",
    "He earned a lot of attention for the tattoos decorating his arms, which include the Braddock ZIP code and the dates of people who “we lost to senseless violence in Braddock since I took office.”\nMr. Fetterman is politically ambitious.",
    "Conventional wisdom says Mr. Lamb’s brand of politics is more aligned with the party establishment in Pennsylvania and more palatable to a statewide electorate that helped power Joseph R. Biden’s victory over President Trump in 2020.",
    "He is now running as an unabashed liberal, a behemoth messenger for the far-left vision of politics that has been most commonly associated with Rep. Alexandria Ocasio-Cortez’s far-left “Squad,” a frequent Republican target.",
    "“I could be wrong, but for a very long time Republicans have been saying, ‘The Democratic Party has been taken over by wild-eyed leftists, the world is coming to an end and you have to vote for us,’” Mr. O’Connell said.",
    "He would be more closely aligned with the far-left “Squad” on Capitol Hill than the state’s centrist Sen. Robert P. Casey Jr., but Pennsylvania political insiders say Mr. Fetterman’s persona clouds that distinction.",
    "“He has super trendy politics, flies the gay rights flag from his office and is all worked up about marijuana, but at some point, it is all the same shtick, and I don’t know if it flies in Pennsylvania,” he said.",
    "John F. Cordisco, chair of the Bucks County Democrats, said Mr. Fetterman’s image is part of his broader appeal, particularly with voters looking for someone plainspoken or just plain different.",
    "“I don’t think that is a shocker because John is serving as lieutenant governor, has been very outspoken and definitely has higher name recognition,” Mr. Cordisco said.",
    "The New York Times ran a profile on him in 2011 when he served as mayor of Braddock, a small town in the suburbs east of Pittsburgh where he was first elected in 2005.",
    "“I think people have a tendency to, at first glance, underestimate that.”\nRepublicans, meanwhile, see Mr. Fetterman’s big-guy appeal as a gimmick that won’t last.",
    "Mr. Kenyetta, 31, is the first openly gay person of color in the Pennsylvania legislature, and he is battling Mr. Fetterman for the hearts and minds of liberals.",
    "“In a year when traditional Democrats are going to struggle, John doesn’t have to convince people he’s not like other Democrats or even other politicians.",
    "“To win Pennsylvania in 2022, Democrats can’t run a typical campaign, and we can’t nominate a typical candidate,” said Fetterman spokesman Joe Calvello.",
    "“That is why he may have the ability to appeal to voters outside the progressive part of the party,” said Mr. Cordisco, who remains neutral in the race.",
    "“The last time I heard this was 2020, and unless you are writing a lot of stories about President Sanders, you’d have to ask: How has that worked out?”",
    "The race for Mr. Toomey’s open seat is seen as a prime pickup opportunity for Democrats as they try to defend their razor-thin majority in the Senate.",
    "Mr. O’Connell said he finds it hard to believe the Democrat establishment in Washington and Pennsylvania will support Mr. Fetterman in the primary.",
    "John Fetterman is heralded as the eighth wonder of the world in the Democratic race to replace retiring Sen. Patrick J. Toomey in Pennsylvania.",
    "“He speaks his mind, and by doing that he creates a very big image, and that is something the other candidates are going to have to deal with.",
    "“Carnival-like is not far off,” Michael O’Connell, a veteran Republican Party operative in western Pennsylvania, said of the Fetterman look.",
    "His appearances gave viewers a glimpse of an unconventional style that contrasts with the more traditional, often stuffy ways of Washington.",
    "He also supports abolishing the legislative filibuster in the Senate, which has become a far-left litmus test for Democratic candidates.",
    "Since Mr. Fetterman announced his bid a year ago, his campaign has been leaning into the idea that he is different from the others.",
    "Mr. Fetterman has defended hydraulic fracturing, distancing him from the liberal grassroots activists who want to ban the practice.",
    "The winner will represent the Democratic Party in what is expected to be one of the nation’s most-watched Senate races this year.",
    "He is the front-runner in the race for the Democratic Senate nomination against Rep. Conor Lamb and state Rep. Malcolm Kenyetta.",
    "He gained notoriety in 2018 after he flipped a House seat in a special election in Trump country just north of Pittsburgh.",
    "Mr. Fetterman became a familiar face on television talk shows opposing the former president’s claims of a stolen election.",
    "Mr. Trump defeated Hillary Clinton in Pennsylvania in 2016, the first time a Republican won the state since George H.W.",
    "His wife, Giselle, is a Brazilian-born activist who came to the U.S. with her mother as a young illegal immigrant.",
    "He parlayed a failed bid for the U.S. Senate in 2016 into a successful bid for lieutenant governor in 2020.",
    "Mr. Lamb pulled in 58% of the vote, followed by Mr. Fetterman with 23.5% and Mr. Kenyatta with 17.3%.",
    "He says the law is ruining the lives of people who have never taken a life and is costing taxpayers.",
    "Mr. Fetterman supports raising the federal minimum wage, Medicare for All and legalizing marijuana.",
    "They can see it for themselves.”\nMr. Fetterman has become a familiar face on the national stage.",
    "He has challenged mandatory sentences of life without parole for second-degree murder.",
    "The latest campaign finance reports show him with more than $5 million in the bank.",
    "Mike Stack the first incumbent lieutenant governor to lose in a primary election.",
    "Mr. Lamb, 37, is a former Marine and federal prosecutor with a centrist brand.",
    "Mr. Fetterman won a five-way Democratic primary race, making Lt. Gov.",
    "Mr. Lamb has $3 million, and Mr. Kenyatta has $285,000.",
    "The limited polling available shows him in the lead.",
    "During the Trump years, his public stature grew.",
    "Mr. Fetterman, 52, is a married father of three.",
    "He was cast as the face of a Rust Belt renewal.",
    "Mr. Fetterman has momentum in the Senate race.",
    "The outcome was billed as a blow to Mr. Lamb.",
    "“John is a very intelligent guy,” he said.",
    "She is now a naturalized citizen.",
    "Bush in 1988.",
    "Lt. Gov."
  ]
}