{
  "id": 13234,
  "mediaId": 2574,
  "date": "2022-03-04",
  "headline": "Free Beacon Poll: McCormick Overtakes Oz in PA Primary",
  "image": "https://freebeacon.com/wp-content/uploads/2022/03/dr-oz-honored-star-hollywood-walk-fame-e1646346582521.jpg",
  "link": "https://freebeacon.com/elections/free-beacon-poll-mccormick-overtakes-oz-in-pa-primary/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chuck Ross",
  "authorUrl": "https://freebeacon.com/author/chuck-ross/",
  "termIds": [
    0
  ],
  "sentences": [
    "Sam DeMarco, the chairman of the Allegheny County GOP, said ads against Oz have been effective because they’ve drawn heavily from footage from Oz’s TV show, which often touched on controversial issues such as immigration, guns, and abortion.",
    "\"After a solid introduction and spike in the polls, Dr. Oz now finds himself in the very difficult position of trying to make up lost ground among GOP primary voters who are now questioning his stance on a variety of issues,\" Meyers said.",
    "Sixty-nine percent of those surveyed said they were less likely to back Oz because of his support for so-called \"red flag\" gun laws, which make it easier for courts to seize legally owned firearms.",
    "Elections\nCelebrity doc’s poll numbers drop amid barrage of attack ads\nDavid McCormick has taken a commanding lead over celebrity doctor Mehmet Oz in Pennsylvania’s Republican Senate primary.",
    "McCormick’s military background was viewed favorably, with 75 percent of respondents saying they were more likely to vote for him because of his service as an Army paratrooper.",
    "The poll shows a meteoric rise for McCormick, a West Point grad, combat veteran, and former hedge fund executive who launched his campaign less than two months ago.",
    "A Washington Free Beacon poll shows McCormick leading a field of five candidates with 25 percent support in a survey of 600 likely Republican primary voters.",
    "Forty-six percent of voters had a favorable view of Oz because of his familiarity with the health care industry and his support for medical innovation.",
    "The race could still come down to a coveted endorsement from Trump, who is viewed favorably by 80 percent of primary voters, according to the poll.",
    "\"While the race remains fluid, David McCormick’s support is clearly on the upswing, while Dr. Oz has struggled to build support,\" Meyers said.",
    "Oz holds dual American and Turkish citizenship and has rubbed shoulders with groups linked to Turkish strongman Recep Tayyip Erdogan.",
    "Meyers said the poll shows \"voters are drawn to McCormick’s impressive background in the military and in the private sector.\"",
    "Both candidates have drawn support from close Trump allies, though the former president has yet to support either candidate.",
    "Parnell, who was endorsed by former president Donald Trump, has since endorsed McCormick, citing his military background.",
    "McCormick and Oz have both faced an onslaught of negative attack ads, but the poll suggests Oz has suffered more damage.",
    "\"With 40 percent of GOP primary voters now viewing him unfavorably, it may be difficult for him to make up that ground.\"",
    "His wife, Dina Powell McCormick, also worked in the Trump White House as deputy national security advisor for strategy.",
    "Pollster Michael Meyers of TargetPoint Consulting, which conducted the poll, said it shows McCormick \"on the upswing.\"",
    "Pennsylvania lieutenant governor John Fetterman and Rep. Conor Lamb are vying for the Democratic nomination.",
    "\"When you do a television show for 13 years, you’re going to talk about a lot of controversial subjects.\"",
    "), former White House press secretary Sarah Huckabee Sanders, and former secretary of state Mike Pompeo.",
    "Oz is a friend of Trump’s and has received the backing of donors close to the former president.",
    "Oz jumped into the race in November after early favorite Sean Parnell dropped out of the race.",
    "Oz polled second with 19 percent, while former ambassador Carla Sands followed at 11 percent.",
    "\"The fact that they’re using his own words in the advertising is very damning,\" said DeMarco.",
    "\"His campaign ads highlighting his accomplishments are clearly resonating,\" Meyers said.",
    "In addition to the Parnell endorsement, McCormick is backed by Sen. Ted Cruz (R., Tex.",
    "The Republicans are running to replace Sen. Pat Toomey (R.), who is retiring.",
    "Sixty-six percent of respondents were critical of Oz’s close ties to Turkey.",
    "McCormick dominated Oz in a head-to-head matchup, 56 percent to 26 percent.",
    "Only 18 percent of respondents viewed those qualifications negatively.",
    "The poll was conducted by TargetPoint Consulting from Feb. 25 to 28.",
    "Oz’s celebrity gave him a boost in early polling of the race.",
    "\"That’s what’s done the most damage,\" DeMarco said."
  ]
}