{
  "id": 1344,
  "mediaId": 8412,
  "date": "2022-02-11",
  "headline": "The $20M Pennsylvania Senate slugfest: Candidates, super PACs, shell out big bucks to run ads",
  "image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2022/02/0/0/dr-oz-david-mccormick.jpg?ve=1&tl=1",
  "link": "https://www.foxbusiness.com/politics/pennsylvania-senate-race-ad-spending",
  "mediaOutlet": "Pocono News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxbusiness.com/person/s/paul-steinhauser",
  "termIds": [
    0
  ],
  "sentences": [
    "NEW PUNCHES THROWN IN CHINA FISTFIGHT BETWEEN DR. OZ AND DAVID MCCORMICK IN PENNSYLVANIA\nThe two biggest spenders are celebrity doctor Mehmet Oz, the cardiac surgeon and author who until the launch of his Senate campaign late last year was host of TV’s popular \"Dr. Oz Show,\" and David McCormick, a West Point graduate, Gulf War combat veteran and former Treasury Department official who steered the hedge fund behemoth Bridgewater Associates from 2017 through the end of last year.",
    "GET FOX BUSINESS ON THE GO BY CLICKING HERE\nIn Ohio, a paltry $460,000 has been spent to date to run ads in the Democratic primary, where longtime Democratic Rep. Tim Ryan is the front-runner in a small field of contenders that also includes progressive Morgan Harper, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "TRUMP HELPS CLEAR THE FIELD IN OHIO'S CROWDED SENATE GOP PRIMARY\nMcCormick and Oz are two among many GOP candidates who would gladly welcome an endorsement by former President Trump – who remains very popular with Republican voters as he continues to play a kingmaker’s role in party politics and flirts with a 2024 White House run.",
    "Among the other leading GOP candidates are a real estate developer, philanthropist and 2018 Republican nominee for lieutenant governor, Jeff Bartos; real estate executive and major Republican donor Carla Sands, who served as ambassador to Denmark under Trump; and veteran and conservative political commentator Kathy Barnette.",
    "Roughly $20 million has been shelled out by the campaigns and outside groups through Thursday to run ads in the race to succeed retiring Republican Sen. Pat Toomey, with the vast majority being spent in the GOP primary, according to figures provided by the national ad tracking firm AdImpact.",
    "McCormick and Oz are two of the leading candidates in a crowded field of Republican contenders in Pennsylvania in a race that could decide whether the Republicans win back the Senate majority in November’s midterm elections.",
    "Take a GOP held open Senate seat race in a crucial battleground state with a crowded Republican primary field full of wealthy candidates backed by well-financed super PACs, and the ad spending quickly multiples.",
    "(AP Photo/Jeff Dean / AP Newsroom)\nBernie Moreno, a successful Cleveland-based businessman and luxury auto dealership giant who suspended his campaign a week ago, spent over $2.6 million before dropping out.",
    "AdImpact projected in September that $8.9 billion would be shelled out to run TV, digital and radio ads in the 2022 races across the country, which would be the highest ever for a midterm election cycle.",
    "\"With three months remaining until primary day, Ohio and Pennsylvania’s Senate races look to be two of the most expensive primaries of the year, and of all time,\" AdImpact’s Ben Taber told Fox News.",
    "It’s a similar story in neighboring Ohio, where there’s also a crowded and combustible Republican Senate primary in which nearly all the major candidates are trying to land Trump’s endorsement.",
    "According to AdImpact, nearly $16 million has already been spent by the campaigns and outside groups to run spots on TV or online in the race to succeed retiring GOP Sen.",
    "The biggest spender to date in Ohio is Mike Gibbons, a Cleveland entrepreneur, real estate developer, and investment banker and a 2018 Ohio Republican Senate candidate.",
    "Club for Growth Action, which is supporting former Ohio treasurer and former two-time Senate candidate Josh Mandel, has dished out nearly $2.8 million to run ads.",
    "Vance, has spent nearly $1.4 million; and Ohio state Sen. Matt Dolan, whose family owns Major League Baseball’s Cleveland Guardians, has spent nearly $1 million.",
    "Both campaigns and allied super PACs have launched ads attacking each over the combustible issue of China relations, which is top of mind with many GOP voters.",
    "The Oz campaign’s already dished out $5.5 million to run ads, with the McCormick campaign not far behind at $4.8 million, according to AdImpact.",
    "And they've spotlighted their support for the former president’s America First policies, which included a confrontational stance against China.",
    "Former Ohio GOP chair Jane Timken’s spent $2 million; Protect Ohio Values, a super PAC backing best-selling author and venture capitalist J.D.",
    "With the surge in spending, AdImpact will likely up its estimate after the once-in-a-decade congressional redistricting process is finalized.",
    "The pro-McCormick Honor Pennsylvania PAC has spent $2.6 million to date, with the pro-Oz American Leadership Action spending $1.2 million.",
    "That's what's happening right now in Pennsylvania, where ad spending has already skyrocketed ahead of the Keystone State's May 17 primary.",
    "Sands has shelled out over $2.2 million to date to run ads, with Bartos and a supportive super PAC combined spending nearly $450,000.",
    "In both states, ad spending by the Republican Senate contenders is dwarfing the amount dished out in the Democratic primaries.",
    "Of the $20 million in ad spending in Pennsylvania, less than $3 million comes from the Democratic race, where Lt. Gov.",
    "\"Large states with large, well-funded, fields have driven spending levels even higher than anticipated.\"",
    "\"When Mehmet Oz questions my patriotism, he’s crossed a line,\" McCormick fires back in an ad of his own.",
    "John Fetterman, Rep. Conor Lamb and state Rep. Malcolm Kenyatta are the major candidates.",
    "Not ours,\" charges the announcer in an Oz campaign commercial earlier this month.",
    "He’s shelled out nearly $5.3 million of his own money to run commercials.",
    "Ohio’s primary is May 3.",
    "China’s friend.",
    "Rob Portman.",
    "\"McCormick."
  ]
}