{
  "id": 15717,
  "mediaId": 6570,
  "date": "2022-03-06",
  "headline": "Conor Lamb's challenge: Build his name. Take down John Fetterman. And do it all with less money.",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/20220128awBiden29-1648826601.jpg",
  "link": "https://www.post-gazette.com/news/politics-state/2022/03/06/conor-lamb-s-challenge-john-fetterman-pennsylvania-s-democratic-senate-nomination/stories/202203060025",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Tamari",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We’re running a grassroots campaign, building a winning coalition and gaining support and momentum where it really counts — on the ground, from dozens of labor unions, elected officials and Democratic activists all over the state.”\n“We will have the money and the support we need to make sure Pennsylvania Democrats know that Conor Lamb is the candidate who can win this seat in November,” she added.",
    "“We haven’t issued endorsements in any challenger races — yet — but we are not taking anything off the table.”\nMr. Lamb’s campaign downplayed questions about national support, pointing instead to his busy campaign schedule and a string of major endorsements in Pennsylvania, including the Philadelphia laborers’ and building trades unions, and the Pittsburgh arm of the state’s teachers’ union.",
    "But political operatives and fund-raisers warn that raising money for a super PAC (often called an “independent expenditure” or IE group) can be a lot harder than it sounds — especially in a primary, when voters are picking between different flavors of Democrat.",
    "“But it will take money to displace him and I’m more skeptical now ... that Lamb has the resources to lift himself up and pull Fetterman down.”\nIf Mr. Lamb gets major support from outside groups, “there is plenty of time for him to prevail,” Mr. Balaban added.",
    "“Pennsylvania Democrats aren’t looking to a building in D.C. to find out what Conor is talking about every day: how he’s beaten Trump’s people three times in three Republican districts and will do it again,” said Lamb’s campaign manager Abby Nassif-Murphy.",
    "But it’s not clear if that cavalry will actually arrive — especially without support from national Democrats like Senate Majority Leader Chuck Schumer, D-N.Y., or the allied groups that factored so heavily into Pennsylvania’s 2016 Senate primary.",
    "While big-spending super PACs are common, it’s hard to get national donors to pony up five- and six-figure checks for individual candidates in primaries, said Aubrey Montgomery, a longtime Democratic fund-raiser.",
    "“But that’s a big if.”\nMoney and TV aren’t the only factors in elections, but they’re important elements in a state as large as Pennsylvania, where reaching a critical mass of voters requires mass communication.",
    "“It’s too early to make any early judgments.”\nLamb supporters predict big donors will come because of the stakes of the race and, they argue, because only he has the moderate profile that fits Pennsylvania.",
    "Nor have party officials in Washington been overwhelmed enough by Mr. Lamb to elevate him, even though he seemingly fits the national party profile, having won tough House races in competitive districts.",
    "Lebanon, with even more to do to accomplish an expensive two-pronged task: raising his own profile statewide, while pulling down Mr. Fetterman, for former Braddock mayor and now lieutenant governor.",
    "“All of the polling makes me think Fetterman’s lead is real, but that doesn’t mean it’s firm,” emailed J.J. Balaban, a Democratic strategist from Philadelphia who has worked on Senate races.",
    "A third major Democrat in the race, state Rep. Malcolm Kenyatta, has impressed many with the endorsements he has secured and working-class message, but has an even tougher hill to climb.",
    "“Far-left forces have not served us well,” added Steve Cozen, an attorney and major Philadelphia Democratic donor who wrote a $10,000 check to the super PAC, one of its first donations.",
    "It does have some major names supporting it, including the celebrity political strategist James Carville and Mary Pat Bonner, a prolific Democratic fund-raiser with Pennsylvania ties.",
    "“We need a moderate, centrist candidate if we’re going to replace Pat Toomey with a Democrat, and Conor’s the guy.”\nMr. Toomey, the incumbent Republican, isn’t seeking re-election.",
    "Allies of Mr. Lamb are hoping a new super PAC can help overcome both, by raising cash from big donors to close a $3 million gap with Mr. Fetterman, the Democratic front-runner.",
    "A New York banker or Silicon Valley executive is less likely to know the nuances separating Pennsylvania’s primary candidates, or have a strong allegiances to one of them.",
    "The scope of Mr. Lamb’s challenge became clearer early last week when Mr. Fetterman announced a TV ad buy, the first significant one of the Democratic contest.",
    "Pennsylvania’s Senate race is on track to be one of the most important and expensive in the country, one that could help decide control of the chamber.",
    "Mr. Lamb is pitching himself as the best, strongest candidate to win the high-stakes election, especially in a year that looks daunting for Democrats.",
    "“They ultimately care about flipping the Senate seat, but it’s not clear that they want to get involved in picking the nominee,” Ms. Montgomery said.",
    "“We’re keeping open lines of communications with all of the candidates,” said Patrick Burgwinkle, a spokesperson for Senate Democrats’ campaign arm.",
    "National Democrats saw that year’s unorthodox early front-runner, Joe Sestak, as unacceptable and put a gorilla-sized thumb on the scale.",
    "This time, there are questions about Mr. Fetterman’s durability, his ability to handle intense scrutiny, and potential weaknesses.",
    "That’s made for a vastly different dynamic from 2016, the last time Pennsylvania Democrats had a major Senate nomination fight.",
    "The Lamb group, Penn Progress, has touted an $8 million spending target, though many Democrats doubt its ability to reach that.",
    "“People realize he’s the only one that can win the race for the Democrats,” said Allegheny County Executive Rich Fitzgerald.",
    "So while Democrats watching the race say the contest has still hardly begun, they also say key factors favor Mr. Fetterman.",
    "The party had also weighed in heavily in 2010, when Mr. Sestak defeated Republican-turned-Democratic Sen. Arlen Specter.",
    "Mr. Fetterman also doesn’t have the openly antagonistic relationship with national Democrats that Mr. Sestak did.",
    "Mr. Fetterman has double-digit leads in early polling, and more than twice as much cash to spend on the primary.",
    "But his struggle to close ground with Mr. Fetterman so far has been noticed in Pennsylvania and Washington.",
    "Millions of dollars from national groups poured in to help Katie McGinty overcome Mr. Sestak’s early lead.",
    "Ultra-wealthy Republican candidates are already flooding TV, potentially raising advertising rates.",
    "His $285,000 in campaign cash has many writing off his chances in such a pricey race.",
    "To win Pennsylvania’s Democratic Senate nomination, he has to catch John Fetterman.",
    "But national Democrats see enough upside that they’re not trying to stop him.",
    "“We’re just getting started,” said Eric Smith, the PAC’s executive director.",
    "Mr. Lamb had $3 million — but only $2.3 million available for the primary.",
    "Mr. Fetterman had $5.3 million in his campaign fund to start the year.",
    "Super PAC can help\nA super PAC could help Mr. Lamb close the gap.",
    "Inquirer staff writer Julia Terruso contributed to this article.",
    "First Published March 6, 2022, 3:30am",
    "And he has to do it with less money.",
    "Conor Lamb has two big problems.",
    "That leaves Mr. Lamb, of Mt."
  ]
}