{
  "id": 15758,
  "mediaId": 6570,
  "date": "2022-03-07",
  "headline": "Muhlenberg College to host first Pennsylvania Senate Democratic debate; John Fetterman still 'under discussion' to attend",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/Vote-voter-voting-election-day-primary-booth-logo-american-patriotic-STOCK-GENERIC-1646675611.jpg",
  "link": "https://www.post-gazette.com/news/politics-state/2022/03/07/muhlenberg-college-to-host-first-pennsylvania-senate-democratic-debate-john-fetterman-still-under-discussion-to-attend/stories/202203070077",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Sheehan",
  "authorUrl": "",
  "termIds": [
    2709,
    3989,
    4080,
    1489,
    1477,
    839,
    392,
    1032,
    6506
  ],
  "sentences": [
    "Moderators for the debate will be:\nChristopher Borick, professor of Political Science director of the Muhlenberg College Institute of Public Opinion;Jenny DeHuff, Editor-in-Chief City & State PA; Ari Mittleman, founder and host, PA Political Podcast: Pennsylvania Kitchen Table Politics.",
    "Hosted by City & State PA, Pennsylvania Kitchen Table Politics, the Muhlenberg College Institute of Public Opinion and the Muhlenberg College Democrats student organization, the 75-minute debate will be held in front of a live audience and will be broadcast.",
    "Pundits believe Pennsylvania could be one of the Democrats’ best shots of picking up a seat after President Joe Biden narrowly carried the state in the ‘20 election.",
    "Muhlenberg College will host the first debate of Democratic candidates vying to run for U.S. Senate next month, the school announced on Monday.",
    "The event will take place from 3 to 4:15 p.m. on April 3 with an audience of 175 invitation-only guests.",
    "State Rep. Malcolm Kenyatta and U.S. Rep. Conor Lamb have been confirmed for the event April 3.",
    "More information will be available soon regarding the live broadcast of the debate.",
    "GOP candidates vying to run to replace him are Dr. Mehmet Oz and David McCormick.",
    "John Fetterman, is “under discussion,” according to a release from Muhlenberg.",
    "Republican Sen. Pat Toomey announced last year he would not seek another term.",
    "Attendance by the third Democratic candidate, Lt. Gov.",
    "First Published March 7, 2022, 9:53am"
  ]
}