{
  "id": 1710,
  "mediaId": 2658,
  "date": "2022-02-15",
  "headline": "The left neutralizes the Dem establishment in Pa. Senate primary",
  "image": "https://static.politico.com/81/85/1f470c01408694666e8a5833f127/20220214-conor-lamb-pa-ap-773.jpg",
  "link": "https://www.politico.com/news/2022/02/15/conor-lamb-senate-penn-00008919",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Elaine Giarrusso, a liberal activist in western Pennsylvania who has supported Lamb since his 2018 run, said he can win over progressives in the Senate primary “simply because he listens to them and does not rule anything out.”\nShe added, “A lot of progressives are realizing that we are something of a minority and that it’s better to not push for and expect to get everything you want, and lose a general election.”\nUltimately, Lamb is making a bet that voters will care more about the ability to win in a general election than pass any ideological litmus test.",
    "So in my opinion, the score is 0-0 and the entire game is left to be played,” he said, adding, “If online fundraising was what determined these elections, you’d have either Bernie Sanders or Donald Trump as the president.”\nIn sketching out his path to victory, Lamb said he can bring together both voters from western Pennsylvania, his home base, and the populous southeastern part of the state, where he has won endorsements from top elected officials and labor groups such as Philadelphia Mayor Jim Kenney and the city’s powerful building trades.",
    "“We haven’t issued endorsements in any challenger races — yet — but we are not taking anything off the table.”\nMikus, who served as McGinty’s campaign manager in 2016, said the DSCC weighing in could “get messy,” particularly a time when Democrats are gladly watching the candidates in the state’s GOP primary tear into each other.",
    "“We’re picking up steam out here because these people want a winner, and at the end of the day, what sets me apart from every other candidate in this race is that I have won very high-pressure, difficult campaigns against Republicans.”\nTo convince voters of that, Lamb will first need to introduce himself to them.",
    "Obviously, it would be better if they were opening those doors, but as long as they’re not closing them … we can work with that.”\nA recent development could help Lamb close the money gap with Fetterman: A pro-Lamb super PAC, which is looking to raise more than $8 million, has emerged.",
    "Mustafa Rashed, a Philadelphia-based Democratic consultant, said that Pennsylvania already has “the quintessential white male moderate” in the Senate, Democrat Bob Casey, which might make primary voters more willing to take a chance on a different kind of candidate.",
    "Lamb’s predicament offers a window into how much the Democratic Party has changed in recent years: Progressives have gained a major foothold, small-dollar fundraising has upended election dynamics, and moderate white men like Lamb are no longer shoo-ins.",
    "“I think it probably has to do with not wanting to wade in and anger the progressive base, because Democrats need a progressive base to turn out,” said Mike Mikus, a Democratic strategist who is a veteran of Senate and House campaigns in Pennsylvania.",
    "And number two, I believe the argument that Lamb may be the best candidate to win in the fall, but the polls haven’t shown anything like that yet.”\nOne of the major benefits of having the DSCC’s backing — whether explicit or implicit — is fundraising.",
    "“We’re keeping open lines of communications with all of the candidates, we’re assessing the campaigns, and we’re working to build the infrastructure for the general election,” said Patrick Burgwinkle, senior communications strategist for the DSCC.",
    "“I don’t think the lack of involvement on the part of the DSCC is very significant at all.”\nLamb’s campaign believes that Fetterman has not yet been properly vetted in the crucible of a tough campaign, and is coasting on name ID.",
    "Even more surprising: The party establishment hasn’t swooped in to help Lamb, despite the fact that Democratic leaders have aggressively recruited candidates with a profile like his to run for Senate in the past.",
    "They believe the Lamb’s voting record — the congressman voted in line with Trump’s position 68 percent of the time during his first eight months in office, according to the website FiveThirty Eight — is poison.",
    "“I still believe that our party is going to make a decision in this race, like they did in 2020, about who has the best chance of actually winning in November and getting to the Senate,” Lamb said.",
    "“Polling is nowhere near as reliable as people like him make it out to be, particularly this early in a race, so many months before so many people have learned much about us or made up their minds.",
    "“Pennsylvania has sent however many white men to the United States Senate since the start of the commonwealth’s founding,” said Rashed, who is not working for any campaign in the Senate primary.",
    "“Especially when you have a Republican primary [that is] so messy right now, you don’t want to throw mud on yourself when the other party’s doing it to themselves.”\nFormer Pennsylvania Gov.",
    "| Matt Rourke/AP Photo\nBy Holly Otterbein\n 02/15/2022 04:30 AM EST\nPHILADELPHIA — Conor Lamb is the kind of swing-state Senate candidate who used to make Democratic power-brokers swoon.",
    "Yet for all his pedigree as a battleground state candidate, Lamb remains mired in the Democratic primary for Pennsylvania’s open Senate seat, trailing progressive frontrunner Lt. Gov.",
    "As one weakness, they point to the fact that Fetterman once pulled a shotgun on a person he thought might be involved in a shooting, but who turned out to be an unarmed Black jogger.",
    "Kenyatta collected only $1.5 million in 2021, but has received endorsements from groups such as the American Federation of Teachers, Working Families Party and SEIU Pennsylvania.",
    "That’s a turnaround from previous election cycles, when Democrats in Washington often sought to avoid competitive, resource-depleting Senate primaries by hand-picking candidates.",
    "But Lamb’s efforts to prove that he is the best candidate to take on Fetterman in the primary — and the eventual Republican nominee in the fall — haven’t always been successful.",
    "A former Marine and prosecutor, Lamb catapulted onto the national scene in 2018 when he flipped a House seat that former President Donald Trump carried by nearly 20 points.",
    "It can cause a lot of headaches with various constituent groups as well.”\nThe primary is just getting started — no Democratic candidate has even aired a television ad yet.",
    "In some internal surveys, Lamb has been virtually tied with state Rep. Malcolm Kenyatta, who would be the first openly gay and Black senator in Pennsylvania if successful.",
    "Lamb’s campaign argues that he has a strong case to make to Democratic voters that he is the most electable candidate in one of the premier Senate races in the country.",
    "The fired-up part of the Democratic Party thinks we can get a different outcome if we sent a different kind of person there.”\nBoth Lamb and Fetterman are white men.",
    "And a Lamb campaign aide said, “As long as the DSCC is not closing doors to us for fundraising or for support or things like that, then that’s fine.",
    "Lamb’s opponents, in turn, think that his record as a moderate makes him unacceptable to many Democrats, particularly at a time when centrist Sens.",
    "Fully aware of the need to appeal to Black voters, Lamb has been aggressively courting African American elected officials and labor leaders.",
    "Lamb’s campaign argues that’s a cherry-picked statistic, since the same data shows he voted with Trump overall only 22 percent of the time.",
    "He said Democrats must win Pennsylvania’s Senate seat to keep control of the chamber, and Lamb is the surest bet in the general election.",
    "Last year, Fetterman also raised nearly $12 million from a massive network of small-dollar donors, compared to $4 million for Lamb.",
    "Despite receiving national attention for his 2018 congressional victory, Lamb is not widely known outside of western Pennsylvania.",
    "Conor Lamb remains mired in the Democratic primary for Pennsylvania’s open Senate seat, trailing progressive frontrunner Lt. Gov.",
    "A white woman who had been running in the primary, Montgomery County Commissioner Val Arkoosh, dropped out earlier this month.",
    "At a recent meeting, the Pennsylvania Democratic Party declined to endorse anyone in the Senate primary, a setback for Lamb.",
    "Fetterman, the only candidate in the Democratic field who has run and won statewide, is leading in public and private polls.",
    "James Carville, the longtime Democratic strategist, boosted the pro-Lamb super PAC in a recent email to potential donors.",
    "While he won a majority of votes from committee members, he failed to meet the threshold necessary to win the party nod.",
    "The Democratic Senatorial Campaign Committee has also stayed out of the contest so far, likely to the detriment of Lamb.",
    "“I knew I could appeal in both Philadelphia and Pittsburgh, and right now I’m the only candidate doing that,” he said.",
    "In the race for this same seat in Pennsylvania in 2016, the DSCC recruited Katie McGinty and officially endorsed her.",
    "Ed Rendell, who has not endorsed a candidate in the primary, said he does not expect DSCC to ultimately get involved.",
    "Joe Manchin (D-W.Va.) and Kyrsten Sinema (D-Ariz.) have drawn the ire of the party base for stymying Biden’s agenda.",
    "A document promoting the group listed the firm founded by Biden’s pollster, John Anzalone, as part of the team.",
    "His team remains convinced Fetterman has major liabilities that will sink him once they become widely known.",
    "“I don’t think Pennsylvania Democrats are looking to the DSCC particularly for guidance,” he told POLITICO.",
    "Lamb’s allies are confident that he will raise enough money to compete with Fetterman regardless, though.",
    "EMILY’s List, a powerful group that supports women who champion abortion rights, had been backing her.",
    "In Philadelphia, Ryan Boyer, the head of the city’s building trades, who is Black, is a top supporter.",
    "He attributed that to the fact that Fetterman and Lamb are “two fairly strong candidates, number one.",
    "Tom Wolf’s ticket in 2018 and is not a self-described socialist, as unelectable as Bernie Sanders.",
    "President Joe Biden said the young, centrist lawmaker reminds him of his late son, Beau.",
    "Lamb’s success will depend, in part, on whether he can paint Fetterman, who won on Gov.",
    "In essence, he wants to do what Biden did in the 2020 presidential primary.",
    "In an interview, Lamb downplayed Fetterman’s strengths in the primary.",
    "“Even when it looks like Twitter and other things are so important.”",
    "Fetterman has said he did not know the race of the man.",
    "Fetterman has got kind of the Bernie base,” he said.",
    "“And we’ve mostly gotten the same thing out of that.",
    "John Fetterman in both fundraising and the polls.",
    "John Fetterman in both fundraising and the polls.",
    "“Malcolm is the only African American candidate.",
    "“I understand why they’re staying out."
  ]
}