{
  "id": 17427,
  "mediaId": 8422,
  "date": "2022-03-03",
  "headline": "Biden approval hits new low as economic challenges rise, poll finds",
  "image": "https://www.readingeagle.com/wp-content/uploads/2021/12/Virus_Outbreak_Biden_52720.jpg?w=1024&h=682",
  "link": "https://www.readingeagle.com/2022/03/03/franklin-marshall-college-poll-economic-discontent/",
  "mediaOutlet": "readingeagle.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Shuey",
  "authorUrl": "https://www.readingeagle.com/author/karen-shuey/",
  "termIds": [
    0
  ],
  "sentences": [
    "Berwood Yost, director of the Center for Opinion Research at the Lancaster college, said that given the growing concern about personal finances it should not be surprising that Pennsylvania voters remain pessimistic about the condition of the state and nation.",
    "How the poll was conducted\nIncluded in the latest Franklin & Marshall College poll is a detailed explanation of how the survey was conducted:\nThe survey findings presented in this release are based on the results of interviews conducted Feb. 21-27.",
    "The top three choices for the spot are David McCormick, the former chief executive of the world’s largest hedge fund, with 13% support; Carla Sands, Trump’s ambassador to Denmark, garnering 11%; and Mehmet Oz, a celebrity physician, with 10%.",
    "The poll shows Biden performs the best when it comes to his handling of the COVID pandemic and his efforts to make infrastructure improvements, while his weakest ratings relate to his immigration policy and response to rising inflation.",
    "State stores and ballot questions\nThe poll also took a look at two state issues that have been at the center of recent debate in Harrisburg: privatizing state-owned liquor stores and increasing use of constitutional amendments.",
    "A Franklin & Marshall College poll released today finds that economic concerns are increasing among registered voters, which is leaving them deeply frustrated and mostly dissatisfied with the performance of President Joe Biden.",
    "F&MPoll_March2022\nThe 2022 election\nGrowing concern about the state of the economy and harsh judgment about the president’s performance could spell doom for Democrats about their prospects in the 2022 midterm contests.",
    "On the issue of using constitutional amendments to settle stalemates between the Legislature and governor, 55% of the state’s registered voters favor using the method when the two sides cannot come to an agreement.",
    "The poll finds that, if elections were held today, 42% of registered Pennsylvania voters overall would back the Republican candidate for Congress and 38% would support the Democratic candidate.",
    "Survey results were weighted (age, gender, education, geography and party registration) using an algorithm to reflect the known distribution of those characteristics among state voters.",
    "The poll found that only 1 in 3 registered voters believe the state is headed in the right direction, despite the fact that concerns about the COVID pandemic are receding.",
    "It found that 52% of the state’s registered voters support selling the state-owned liquor stores, with the bulk of that backing coming from Republicans and independents.",
    "And people across the Keystone State are becoming increasingly worried, both about their current situation and their prospects for the future, according to a new poll.",
    "The survey found that more than 1 in 3 respondents say they are worse off financially than a year ago — representing the largest proportion in the last five years.",
    "Yost said the negative view of the economy is also contributing to declining satisfaction with the performance of the president, which has dipped to a new low.",
    "The data included in this release represent the responses of 490 registered Pennsylvania voters, including 223 Democrats, 200 Republicans and 67 independents.",
    "The interviews were conducted at the Center for Opinion Research at Franklin & Marshall College on behalf of the Center for Politics and Public Affairs.",
    "Estimates for age, geography and party registration are based on active voters within the Pennsylvania Department of State’s voter registration data.",
    "While that rating is similar to former President Donald Trump’s at the same point in his term, it is a significant drop from where it was a year ago.",
    "Yost pointed out that support for privatizing the stores has been relatively consistent with the most recent finding for the past decade.",
    "Biden’s overall approval rating in March 2021 was about 40%, boosted largely by the overwhelming support of members of his own party.",
    "John Fetterman remains the first choice with support from 28% of registered voters followed by U.S. Rep. Connor Lamb at 15% backing.",
    "The poll found Republicans strongly support the method, although it has plurality backing from Democrats and independents as well.",
    "The poll shows that about 1 in 3 registered voters in Pennsylvania believes Biden is doing an excellent or good job as president.",
    "When it comes to the primary contests for the state’s open U.S. Senate seat, a frontrunner has emerged for the Democrats.",
    "The sample error for this survey is 6.1 percentage points when the design effects from weighting are considered.",
    "A majority of Republicans say they are worse off, as well as about a quarter of Democrats and independents.",
    "The COVID-19 pandemic may be easing, but that doesn’t mean Pennsylvanians don’t have things to worry about.",
    "The pandemic has left many across the state financially reeling, having led to shutdowns and layoffs.",
    "Two in 5 Democrats and 1 in 2 Republicans say they are undecided about their choice for the Senate.",
    "In addition to sampling error, this poll is also subject to other sources of nonsampling error.",
    "Interviews were completed over the phone and online depending on each respondent’s preference.",
    "The poll was designed and administered by the staff of the Center for Opinion Research.",
    "However, the crowded race for the Republican nomination remains tightly packed.",
    "The sample of registered voters was obtained from Marketing Systems Group.",
    "His positive job rating has declined from 78% to 58% among Democrats.",
    "But there is still a lot of uncertainty among voters on both sides.",
    "It has also fallen from 38% to 25% among registered independents.",
    "The Republican primary field has no clear leader at the moment.",
    "All sampled respondents were notified by mail about the survey.",
    "Those negative feelings cross the political spectrum.",
    "And now inflation has dug its claws into the state.",
    "On the Democratic side, Lt. Gov.",
    "But that appears to be changing.",
    "In particular, the economy."
  ]
}