{
  "id": 17469,
  "mediaId": 2779,
  "date": "2022-03-04",
  "headline": "Conor Lamb’s New Senate Strategy: I’m Not Joe Manchin",
  "image": "https://theintercept.imgix.net/wp-uploads/sites/1/2022/03/AP2202852603116-conor-lamb-manchin.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800",
  "link": "https://theintercept.com/2022/03/04/conor-lamb-senate-campaign-joe-manchin/",
  "mediaOutlet": "Intercept",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "And by electing Conor to the Senate — the only candidate in this race who’s ever beaten a Republican — we can help replace those votes and get closer to eliminating the filibuster and passing our priorities.”\nAfter Lamb won a 2018 special election in Trump country, in a district close in proximity and demographics to Manchin’s state of West Virginia, mainstream Democrats compared him to the senator and elevated both politicians as the kind the party needed to run if they wanted to survive.",
    "Lamb distanced himself from the West Virginia senator during a campaign event earlier this month and told Democratic voters in Jenkintown, Pennsylvania, that he voted for President Joe Biden’s Build Back Better bill and supports ending the filibuster but that the party is “two votes away on that long list of priorities.” He did not mention them by name, but the two votes he referenced are Manchin and Sen. Kyrsten Sinema, D-Ariz.",
    "“They’re making it harder to vote, and lying about our elections.”\nNassif-Murphy said Lamb’s comments in Jenkintown were “nothing new.” “Conor has been clear throughout this race about his disagreements with Senators Manchin and Sinema on several major issues, including Build Back Better, voting rights, and the filibuster, among others.",
    "“I would suggest to you that Conor campaigned like a conservative Democrat, like a [West Virginia Sen.] Joe Manchin or a [Indiana Sen.] Joe Donnelly or a [North Dakota Sen.] Heidi Heitkamp.”\nLamb has lauded Manchin’s style of “bipartisanship” and “not giving up” in the face of opposition from his Democratic colleagues.",
    "The group, Penn Progress, so far has two contributions: $25,000 from the International Association of Sheet Metal, Air, Rail, and Transportation Workers Political Action League; and $10,000 from Stephen Cozen, founder of the union-busting law firm Cozen O’Connor and a major supporter of Biden’s 2020 campaign.",
    "Members who voted against the party more than Lamb did included then-Reps. Sinema; Henry Cuellar, D-Texas; Josh Gottheimer, D-N.J.; Collin Peterson, D-Minn.; and Jim Costa, D-Calif. During his second session in Congress, Lamb voted against the party the ninth most of any other Democratic representative.",
    "And after he narrowly won reelection in 2020 and blamed a near loss on posturing by his progressive colleagues, Lamb praised Manchin’s work on an alternative Covid-19 relief bill that December, supported by the House Problem Solvers Caucus, that left out an additional round of stimulus checks.",
    "https://t.co/G2jd5b4QBE\n— Conor Lamb (@ConorLambPA) December 19, 2021\nIn a January fundraising email, Lamb made a similar comment, blaming “Senate Republicans and two Democrats” for using the filibuster to block voting rights legislation, which he said he would work to advance in the Senate.",
    "“I voted for it in the House & I’ll be one more vote in the Senate to make it law, guaranteeing the right to choose no matter what the court does.”\nLamb’s campaign said it has not sought Manchin’s endorsement this cycle and does not expect him to endorse.",
    "“Conor built a working relationship with Senator Manchin while representing a district that bordered West Virginia, driven by the need to protect the pensions and health care of coal miners in both states,” campaign spokesperson Abby Nassif-Murphy said.",
    "When he launched his campaign last summer, Lamb set himself apart from Trump and the votes he took in line with the former president during his first session in Congress, on issues from the border wall to the war in Iraq.",
    "Manchin voted against the 2017 tax cuts and has urged Democrats to prioritize rolling them back as part of any social spending package, but opposed Biden’s proposal to raise the corporate tax rate after Trump lowered it.",
    "“I am so very excited to lend my support to my good friend, Congressman Conor Lamb,” Sen. Joe Manchin, D-W.Va., said in a video endorsing the Pennsylvania Democrat four days before the 2020 midterm election.",
    "Their campaigns also use the same D.C.-based fundraising firm, Fulkerson Kennedy & Company, whose clients include the Democratic Senatorial Campaign Committee, Senate Majority PAC, and Sinema’s campaign.",
    "“Conor voted for every round of checks that went out, and supported [Manchin’s 2020 Covid-19 bill] because it was the most he could get for his constituents while Democrats did not control the Senate.",
    "We even got to have room for some conservative Democrats,” former Pennsylvania governor and former Democratic National Committee Chair Ed Rendell told ABC the day after the 2018 election.",
    "Earlier this month, James Carville, the pundit and Democratic strategist whose passion is battering the progressive wing of the party, promoted the launch of a new super PAC backing Lamb.",
    "“If you want to succeed in taking back the Congress, we have to understand that there’s got to be more than just outright, 100 percent, full-fledged progressives in the Democratic Party.",
    "Lamb and Manchin worked together in 2018 on benefits for coal miners with United Mine Workers of America, and each received endorsements from the group that year.",
    "John Fetterman and state Rep. Malcolm Kenyatta, are vying for support from more progressive voters in major cities and suburbs of Pittsburgh and Philadelphia.",
    "Lamb was one of only three Democrats in the House who voted in 2018 to make parts of Trump tax cuts, including cuts for wealthy individuals, permanent.",
    "During his last two sessions in Congress, Manchin voted against the party more than a quarter of the time, according to data compiled by ProPublica.",
    "As Lamb was openly mulling a bid for Senate, he held a virtual fundraiser with Manchin as a special guest, with top-tier tickets selling for $2,900.",
    "This is an honor.”\nNow, as a candidate in the Democratic primary for U.S. Senate in Pennsylvania, Lamb’s campaign is striking a different tone.",
    "Lamb’s campaign has raised just under $4 million so far; Fetterman has raised just under $12 million; and Kenyatta has raised $1.5 million.",
    "(Of the $4 million Lamb has raised, 17 percent is only available for the general election because it comes from maxed-out wealthy donors.",
    "Both are Democrats representing red areas; former President Donald Trump had won Lamb’s House district by 20 points in 2016.",
    "Lamb’s campaign told The Intercept his “working relationship” with Manchin was based on similarities in their districts.",
    "Less than 1 percent of Fetterman’s funds are reserved for the general election, as are 2 percent of Kenyatta’s funds.)",
    "On Tuesday, Lamb criticized Manchin for voting with Senate Republicans to block the Women’s Health Protection Act.",
    "“Thanks @Sen_JoeManchin & others for not giving up on a bipartisan breakthrough,” Lamb wrote in a tweet.",
    "Both members opposed the HEROES Act that addressed economic fallout from the Covid-19 pandemic in 2020.",
    "The two share corporate donors and a pattern of voting on legislation against the party’s interests.",
    "I voted for Build Back Better once in the House, & would absolutely vote for it again in the Senate.",
    "The only question in this #PASen primary is who you think can beat the Republicans to get there.",
    "“Yesterday the Senate GOP & Sen. Manchin blocked the Women’s Health Protection Act,” he tweeted.",
    "From 2017 to 2019, Manchin voted against Democrats more than any other senator in the party.",
    "Last session, only Sen. Mark Kelly, D-Ariz., voted against the party more than Manchin did.",
    "“The other side denies reality and worships Trump,” Lamb said in his campaign launch video.",
    "Lamb’s new approach follows a poor showing in fundraising compared to his top competitor.",
    "Pennsylvania’s Senate race is poised to be the most expensive in the country this year.",
    "After taking office, Lamb voted against the party the sixth most of any Democrat.",
    "That’s what a real legislator does.”\nLamb’s competitors, Lt. Gov.",
    "“I learned a lot working with you on the coal miners’ benefits.",
    "“Thank you,” Lamb wrote in replies on Twitter and Facebook.",
    "Manchin’s office did not respond to a request for comment.",
    "Last March, Lamb still considered Manchin a strong ally.",
    "Your commitment to bipartisanship is what got it done.",
    "We’ve got to have moderate Democrats.",
    "I’ve done that before, too."
  ]
}