{
  "id": 17523,
  "mediaId": 6570,
  "date": "2022-03-03",
  "headline": "Pennsylvania U.S. Senate race: John Fetterman leads Conor Lamb, GOP field remains tight, poll shows",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/LambFettermanCombo-1-1646323018.jpg",
  "link": "https://www.post-gazette.com/news/politics-nation/2022/03/03/pennsylvania-us-senate-race-polling-2022-fetterman-conor-lamb-dave-mccormick-carla-sands-dr-oz/stories/202203030139",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julian Routh",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Compared to Mr. Trump’s polling in Pennsylvania nearing the middle of his first and only term, Mr. Biden is faring better on how voters see his performance on combatting climate change and “improving the condition of the country’s roads, bridges and transit systems.” This comes in the midst of the Biden administration’s historically large investment into the nation’s infrastructure.",
    "The poll by Franklin & Marshall College, conducted in the last week of February, puts Mr. Fetterman at 28% and U.S. Rep. Conor Lamb in second at 15% among registered Democrats, though 44% say they are undecided about their choice with more than two months to go.",
    "On the Republican ballot, former hedge fund CEO Dave McCormick (13%), former ambassador to Denmark Carla Sands (11%) and Dr. Mehmet Oz (10%) lead a split field, with commentator Kathy Barnette (6%) and businessman Jeff Bartos (4%) trailing the pack.",
    "More of Pennsylvania’s registered voters (42%) say they plan to support a Republican for Congress than those who will support a Democrat (38%) — a flip from the lead-up to the 2018 midterms when Donald Trump was president.",
    "When the poll drills down to the current state of the country and President Joe Biden’s first term in office, it provides some warning signs for Democrats heading into November’s midterm elections.",
    "Mr. Biden’s approval rating in Pennsylvania is similar to Mr. Trump’s at a similar point in his term; 30% of registered voters say Mr. Biden is doing a “good” or “excellent” job as president.",
    "But Mr. Biden is lagging behind his predecessor, at this point, on how his handling of job creation, foreign policy and immigration is perceived.",
    "Interviews for the poll were conducted between Feb. 21-27, with a sample size of 223 registered Democrats, 200 Republicans and 67 independents.",
    "John Fetterman leading the Democratic primary field for U.S. Senate, no clear frontrunner in the GOP race and a massive number of undecideds.",
    "A similar number (32%) believe the state of Pennsylvania is “headed in the right direction” — at a time when the governor’s seat is open.",
    "In total, more than one in three (35%) registered voters feel they’re “worse off” financially than they were a year ago.",
    "Julian Routh: jrouth@post-gazette.com; Twitter: @julianrouth\nFirst Published March 3, 2022, 6:13am",
    "A new poll of registered voters in Pennsylvania — albeit with a small sample size — has Lt. Gov.",
    "At that time, Democrats held the advantage in congressional preference by 7 points.",
    "More than half of registered Republicans (53%) said they’re undecided on the race.",
    "Since August, his positive rating among Democrats has sunk from 78% to 58%.",
    "State Rep. Malcolm Kenyatta checks in at 2%.",
    "The margin of error is +/- 6.1 points."
  ]
}