{
  "id": 2005,
  "mediaId": 2732,
  "date": "2022-02-09",
  "headline": "Fetterman a no-show so far in U.S. Senate candidate forum series",
  "image": "",
  "link": "https://triblive.com/news/pennsylvania/fetterman-noncommittal-on-candidate-event-organized-by-western-pa-democratic-coalition/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Deto",
  "authorUrl": "https://triblive.com/author/ryan-deto/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Fetterman has skipped forums with African American leaders and grassroots activists, and while we don’t know why he’s hiding, we do know it’s disrespectful to our party’s base and it’s no way to win.”\nCategories: Allegheny | Local | Pennsylvania | Politics Election | Top Stories",
    "John Fetterman, a Democratic U.S. Senate candidate from Braddock, is facing criticism for failing to sign up for an online candidate event organized by a coalition of Democratic political groups in Southwestern Pennsylvania.",
    "The SWPA Grassroots Coalition is hosting a series this month where Democratic U.S. Senate candidates speak to and take questions from members of organizations involved in voter outreach efforts in the Pittsburgh region.",
    "When reached by the Tribune-Review, he declined to speak on behalf of his organization but said, as an individual, he felt it was important for candidates to attend such events and answer questions directly from voters.",
    "“Those making the time to get in front of voters asking the tough questions, that is the winning formula in my mind.”\nYap said efforts to organize the candidate series began in November.",
    "“The most common comment about the event series was, ‘Where’s Fetterman?’ We had every hope that he would make himself available but were unsuccessful in our efforts.",
    "Montgomery County Commissioner Val Arkoosh had been scheduled to speak in the series as well but canceled her event after dropping out of the race last week.",
    "Elaine Giarusso, co-leader of Partners for Progress SWPA, said she worked closely with other groups in the coalition to set up the Senate Candidate Series.",
    "Fetterman’s campaign has touted internal polling that he said shows him with a comfortable lead over Lamb in the Democratic primary race.",
    "Lebanon, participated in a Feb. 8 event, and state Rep. Malcolm Kenyatta, D-Philadelphia, is scheduled to speak Feb. 22.",
    "Fetterman’s campaign, first contacted for comment mid-Wednesday afternoon, did not respond to the Tribune-Review.",
    "“When a candidate’s never been in a tough race before, it shows,” Lamb campaign manager Abby Nassif-Murphy said.",
    "Nathaniel Yap, a member of the local grassroots group Order of the Phoenix, co-organized the candidate series.",
    "The coalition reached out to all major candidates, and Fetterman was the only one not to participate, he said.",
    "“I think it is important for candidates to be getting in front of voters as much as they can,” Yap said.",
    "Fetterman also did not participate in a candidate forum held by Black clergy in Philadelphia last month.",
    "His campaign said his responsibilities presiding over the state Senate made it impossible to attend.",
    "Lamb criticized Fetterman for his recent absences in Democratic Senate candidate events.",
    "It’s disappointing,” Giarusso said.",
    "U.S. Rep. Conor Lamb, D-Mt.",
    "Pennsylvania Lt. Gov."
  ]
}