{
  "id": 2443,
  "mediaId": 2637,
  "date": "2022-02-05",
  "headline": "With Trump silent, Pennsylvania Republicans decide against endorsing in Senate race",
  "image": "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.3.1/websites/images/np/favicon-np.ico",
  "link": "https://nationalpost.com/pmn/news-pmn/with-trump-silent-pennsylvania-republicans-decide-against-endorsing-in-senate-race",
  "mediaOutlet": "news.nationalpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jarrett Renshaw",
  "authorUrl": "",
  "termIds": [
    5862,
    4243,
    3989,
    2802,
    2765,
    1126,
    1489,
    6506,
    6110
  ],
  "sentences": [
    "“Now, everyone will be working for the Trump endorsement and the best way to get that endorsement is to show you can win.”\nIn the weeks leading up to Saturday’s vote, regional Republican caucuses held straw polls to gauge support, with real estate developer Jeff Bartos garnering the most party support despite trailing in public polls.",
    "Last month, the Democratic state committee could not agree on endorsing any single candidate, but U.S. Representative Conor Lamb received the overwhelming majority of the votes ahead of Democratic rivals Lieutenant Governor John Fetterman and state lawmaker Malcolm Kenyatta, according to results viewed by Reuters.",
    "Among the Republicans vying to replace Senator Pat Toomey, who is retiring, are several with ties to the former president: Carla Sands, his former ambassador to Denmark; his friend the celebrity doctor Mehmet Oz; and hedge fund CEO David McCormick, whose wife served in the Trump administration.",
    "Article content\nLANCASTER — Republicans in Pennsylvania chose on Saturday not to endorse a primary candidate in one of the most closely-watched U.S. Senate races in the country, amid concerns they could back a candidate in a crowded field who might put them at odds with Donald Trump.",
    "The state committee, comprised of more than 300 local and state officials, voted against endorsing any candidate in the Senate race, or in the equally-crowded governor’s race, according to two sources who attended the closed-door meeting.",
    "Article content\nTrump has not said whether he will back any of the current candidates in the contest that could decide control of Congress in November’s midterm elections.",
    "Article content\nIn interviews, 25 state party committee members and Republican Party officials in Pennsylvania said they were reluctant to back one Senate candidate.",
    "Committee members want the candidates to stand on their own and let the voters decide,” said one top Republican official who was present during the vote.",
    "The endorsement of the state committee is widely considered the early prize of primary season, catapulting its recipient to the general election.",
    "They cited both the large field of 12 hopefuls and the possibility that Trump might eventually endorse a different contender.",
    "Under Democratic rules, a candidate needs roughly two-thirds of votes to earn the state committee’s endorsement.",
    "This year, the party emerges from its winter meeting less unified ahead of a wide-open primary season.",
    "It was conducted by a voice vote and there was no need for a roll call, the sources said.",
    "(Reporting by Jarrett Renshaw; Editing by Daniel Wallis)",
    "Republicans require only a simple majority.",
    "“This was no surprise."
  ]
}