{
  "id": 2468,
  "mediaId": 2658,
  "date": "2022-02-04",
  "headline": "Arkoosh drops out of Pa. Dem Senate primary",
  "image": "https://static.politico.com/33/ff/e30d1f0145c3bb1d83d90783e329/220224-val-ap-773.jpg",
  "link": "https://www.politico.com/news/2022/02/04/arkoosh-pa-dem-senate-primary-00005734",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Now the suburbs are up for grabs and Conor, with his profile, fits the Philadelphia suburbs like a glove.”\nMalcolm Kenyatta, a progressive state representative in Philadelphia, could also make a claim for some of Arkoosh’s voters due to the two officials’ geographical proximity, though Lamb has also aggressively pursued endorsements by officials and labor leaders in the Philly region.",
    "The physician and Montgomery County commissioner said in a statement that she determined that the best way to ensure a Democrat wins in the general election is “to suspend my campaign today and commit to doing whatever I can to help ensure we flip this Senate seat.”\nArkoosh came in fourth place in a vote last weekend by members of the state’s Democratic Party.",
    "“I’ve always thought that to a certain degree Val and Conor Lamb were in competition for the same Democratic voter, and she obviously had an advantage in the southeast being a high-profile woman who was an elected official,” said Larry Ceisler, a longtime Philadelphia-based political analyst and Lamb supporter.",
    "John Fetterman supporters have been anxious that an Arkoosh departure would hurt him — because they believe it could help Lamb, and Fetterman benefits from a crowded field — a recent internal poll conducted on behalf of Fetterman’s campaign showed him leading in the Philadelphia suburbs by 31 points.",
    "| Matt Rourke/AP Photo\nBy Holly Otterbein\n 02/04/2022 12:17 PM EST\nDemocrat Val Arkoosh is dropping out of the primary for an open Senate seat in Pennsylvania, a major development in a critical battleground state race.",
    "Allies of Conor Lamb, a moderate lawmaker from western Pennsylvania, said the move would likely benefit him because they are somewhat similar ideologically.",
    "Val Arkoosh came in fourth place in a vote last weekend by members of the state’s Democratic Party.",
    "Arkoosh was the only high-profile Democratic woman running for the state’s Senate seat.",
    "She had also struggled with fundraising and in polling.",
    "Though some Lt. Gov."
  ]
}