{
  "id": 2615,
  "mediaId": 2746,
  "date": "2022-02-08",
  "headline": "Oz, McCormick trade pro-China barbs in Pa. Senate race, show Trump’s imprint on GOP",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/01/Election_2022_Senate_Pennsylvania_35569.jpg-19adc_c0-150-3600-2250_s1200x700.jpg?187bc123cc4510feb7f1966081317bdd024739c4",
  "link": "https://www.washingtontimes.com/news/2022/feb/8/oz-mccormick-trade-pro-china-barbs-pa-senate-race-/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Boyer",
  "authorUrl": "https://www.washingtontimes.com/staff/dave-boyer/",
  "termIds": [
    5862,
    4941,
    2802,
    2765,
    3325,
    1126,
    839,
    6509
  ],
  "sentences": [
    "“We got sick, China got investments and David McCormick got rich.”\nMr. McCormick’s campaign responded by saying that Dr. Oz profited from China while starring in his popular syndicated daytime TV show “The Dr. Oz Show.”\n“Mehmet Oz — citizen of Turkey, creature of Hollywood — has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,” said McCormick campaign spokeswoman Jess Szymanski.",
    "“If you think about the kind of people we need, we need people that actually understand and can put forward a tough-minded set of policies with China and that’s what I’ll do.”\nMs. Szymanski, the McCormick campaign spokeswoman, said Dr. Oz “has been silent on China until he needed to knock down Dave’s credentials.”\n“Dave McCormick fought for the United States of America in combat,” she said.",
    "McCormick knows this and the attack on a son standing with his mother has no place in public discourse.”\nThe anti-China campaign rhetoric echoes Mr. Trump’s confrontational approach to Beijing and demonstrates the former president’s enduring influence on GOP voters, said Christopher Borick, professor of political science at Muhlenberg College in Allentown, Pennsylvania.",
    "Late last year, while Mr. McCormick was still CEO of Bridgewater, the hedge fund raised the equivalent of $1.25 billion for a Chinese investment fund, “catapulting the hedge-fund firm into the ranks of the biggest foreign managers of private funds” in China, The Wall Street Journal reported in November.",
    "Mehmet Oz continues to spend millions in misinformation because he knows Dave’s background as a combat veteran, successful trade negotiator and businessman resonates with Republicans across the Commonwealth.”\nBoth candidates are fighting the accusation that they are outsiders.",
    "Dr. Oz and Mr. McCormick are spending millions of their own wealth on their campaigns, which are saturating the airwaves with attack ads over China and Mr. McCormick’s efforts to gain name recognition against a TV-star opponent who’s already familiar to many voters.",
    "Two leading contenders for the Republican nomination for Pennsylvania’s open Senate seat are accusing each other of profiting from China in their careers, a high-profile display of how former President Donald Trump’s “America First” agenda still dominates the GOP.",
    "She said Mr. McCormick “outsourced American jobs and raised major funds in China, enriching the CCP, just weeks before he jumped into the race.”\n“McCormick’s ties to the Chinese Communist Party aren’t just problematic, they are dangerous,” she said.",
    "“I had a reputation for being a very tough-minded negotiator to the point that the Chinese were pushing back to the president on the policies I was making under the Bush administration,” he said on “Mornings with Maria” on Fox Business Network.",
    "TV personality and cardiothoracic surgeon Mehmet Oz is slamming rival David McCormick, a former hedge-fund executive, for making millions from Beijing while he was at the helm of Bridgewater Associates, a fund with about $140 billion in assets.",
    "The campaign is one of the most closely watched in the nation, with Democrats viewing the seat as a rare pickup opportunity as they try to hold onto their precarious one-vote majority in the Senate.",
    "Dr. Oz was born in Cleveland, and went to school at the University of Pennsylvania, but lived in New Jersey until establishing a residence in Pennsylvania before announcing his Senate campaign.",
    "Mr. Trump endorsed former Army ranger, Sean Parnell, last year for the GOP primary, but Mr. Parnell suspended his campaign in November amid a child custody battle with his estranged wife.",
    "“His shadow is clearly apparent in the race overall, and in how candidates are trying to frame their pitch to voters,” Mr. Borick, who also conducts statewide polls, said in an interview.",
    "It’s certainly safe terrain to go after an opponent in a Republican primary, and it’s one that I think both McCormick and Oz are open to.”\nThe primary is on May 17.",
    "Mr. McCormick has connections to the Trump world, including his wife, Dina Powell McCormick, who was a deputy national security adviser in the Trump White House.",
    "Mr. McCormick, 56, a West Point graduate and combat veteran, has called on his opponent to “renounce” his Turkish citizenship, accusing him of dual loyalties.",
    "“The Dr. Oz Show” had a multimillion-dollar advertising agreement to promote Usana Health Sciences, an American company whose largest single market is China.",
    "As an official in the George W. Bush administration, Mr. McCormick gave a speech in Beijing in 2007 about rebalancing the U.S.-Chinese relationship.",
    "But Oz campaign spokeswoman Brittany Yanick said Dr. Oz “maintains his dual citizenship to oversee the care of [his] mother, who has Alzheimer’s.",
    "He’s also not afraid of lies spread by desperate political opponents [who] have done neither.”\nDr. Oz also has China connections in his past.",
    "Oz has built his career on empowering people around the world to take control of their own health and their lives,” Ms. Yanick said.",
    "“First China sent us COVID, then David McCormick‘s hedge fund gave Chinese companies billions,” said a recent Oz campaign ad.",
    "Ms. Szymanski countered, “Dave McCormick is the only candidate with the experience, principles, ideas and solutions to win.",
    "Mr. Borick called Mr. McCormick’s past ties to China “a soft spot” that the Oz campaign is trying to capitalize on.",
    "Mr. McCormick and Dr. Oz are among 13 Republicans seeking to replace Republican Sen. Pat Toomey, who is retiring.",
    "“The former president’s position on China resonates with wide swaths of the Republican electorate in the state.",
    "At a meeting last weekend, the state Republican Party decided not to endorse a Senate candidate in the primary.",
    "Mr. McCormick was born in Pennsylvania but was a longtime Connecticut resident until recently.",
    "The Oz campaign said his Emmy-award-winning TV show was broadcast in more than 100 nations.",
    "Former Trump adviser Hope Hicks is helping his campaign, as are other former officials.",
    "“He’s not afraid to take on America’s enemies in uniform or at the negotiating table.",
    "So far, Mr. Trump hasn’t indicated a preference for either Dr. Oz or Mr. McCormick.",
    "More recently, Mr. McCormick has promised to be tough on China if elected.",
    "“When China succeeds, the United States succeeds,” he said at the time.",
    "He also marketed his show in China and traveled there on business.",
    "Dr. Oz, 61, holds dual U.S.-Turkish citizenship.",
    "The Democratic field includes Lt. Gov.",
    "John Fetterman and Rep. Conor Lamb.",
    "“Dr."
  ]
}