{
  "id": 2702,
  "mediaId": 2658,
  "date": "2022-01-31",
  "headline": "Dems miscount votes in Pa. Senate endorsement meeting",
  "image": "https://static.politico.com/dc/28/40ef164246f0a69a8ac1c781e701/pennsylvania-democrats-18712.jpg",
  "link": "https://www.politico.com/news/2022/01/31/dems-miscount-votes-pa-senate-endorsement-meeting-00003830",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4080,
    3989,
    2709,
    1489
  ],
  "sentences": [
    "Lamb campaign manager Abby Nassif-Murphy said that the “party has assured us that they have a record of every vote cast and that every vote was counted.”\nState committee members were permitted to vote in person or virtually at Saturday’s meeting, the first hybrid meeting held by the party for an endorsement.",
    "I think our tech people will get better as we go forward.”\nWelch added that “this was the PA Democratic Party’s first time conducting a hybrid endorsement vote — credentialed members were all emailed a link to a Google form that would record their vote, and votes were tabulated in real-time.",
    "| Matt Rourke/AP Photo\nBy Holly Otterbein\n 01/31/2022 03:22 PM EST\nThe Pennsylvania Democratic Party incorrectly tabulated the votes during its endorsement process for the state’s open Senate seat, but it did not materially affect the results, a senior party official told POLITICO.",
    "“It may be Conor Lamb is at 62 percent … but he can’t get to 67 percent, which is the threshold.”\nA source on Lamb’s campaign said it noticed this weekend that one of his supporters’ votes had not been tabulated and contacted the state party about the irregularity.",
    "“What we can say for certain is that this error did not impact any of the endorsement decisions, nor did it change any of the candidates’ placements in the final vote tally for any round of balloting, and we do have a record of every credentialed member’s vote.",
    "The official said a handful of votes from the state party’s meeting on Saturday in Harrisburg were not tabulated due to a technical error, but that it maintains a record of all votes cast and that they effectively show the same outcome.",
    "The race for the Senate in Pennsylvania could determine which party controls the chamber, and the Democratic primary — which features a power struggle between the party’s progressive and centrist wings — is being closely watched.",
    "John Fetterman came in second place, and state Rep. Malcolm Kenyatta finished third, while Val Arkoosh, a Montgomery County commissioner, did not receive the 15 percent of votes necessary to make it onto the second ballot.",
    "The party endorsement requires two-thirds of the votes of committee members, and Rep. Conor Lamb just fell short of that, receiving 61 percent on a second ballot, according to the figures released Saturday.",
    "The state party official said that with all the votes properly tabulated, Lamb still did not receive the endorsement and the candidates finished in the same order.",
    "We will report full results as soon as the audit is complete.”\nThe state party official said they believed “more than five” votes had not been tabulated.",
    "This was done to accommodate our State Committee members who could not travel to Harrisburg for the in-person vote due to COVID-19 safety concerns.”",
    "The state committee declined to endorse a candidate in this year’s Senate primary, which rates as one of the most important contests in the country.",
    "The state party is conducting an audit of the endorsement vote, and the official said it will release the properly tabulated results shortly.",
    "We are conducting a full audit of the system,” Brendan Welch, communications director for the state party, said in a statement to POLITICO.",
    "“A minor glitch in our system meant that some votes were recorded, but did not make it into the final tally at the meeting.",
    "The party endorsement requires two-thirds of the votes of committee members, and Rep. Conor Lamb just fell short of that.",
    "Though they did not provide a specific number, they said it would not be enough for Lamb to win the endorsement.",
    "“We were able to do a hybrid meeting in the midst of the pandemic,” the state party official said.",
    "Arkoosh also did not receive the votes needed to advance beyond the first ballot, the person said.",
    "“And given that it was a high percentage of accuracy, I think we did pretty good.",
    "It was announced at the state party’s meeting Saturday that Lt. Gov.",
    "The person added that the campaign is not questioning the results.",
    "“The percentages are pretty identical,” the person said."
  ]
}