{
  "id": 2773,
  "mediaId": 8254,
  "date": "2022-02-01",
  "headline": "Millions follow rich candidates in Pennsylvania Senate race",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/AP22020111244076.jpg?w=1280",
  "link": "https://www.abc27.com/news/this-week-in-pennsylvania/pennsylvania-politics/millions-follow-rich-candidates-in-pennsylvania-senate-race/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Levy",
  "authorUrl": "",
  "termIds": [
    3989,
    2802,
    5862,
    4080,
    476,
    6506,
    6520,
    6208
  ],
  "sentences": [
    "HARRISBURG, Pa. (AP) — Cash is pouring in to Pennsylvania’s hotly contested race for U.S. Senate, as wealthy and well-connected candidates moved in from out of state, followed by millions of dollars going into TV ads and super PACs.",
    "That included $5 million from conservative billionaire donor Ken Griffin of Chicago-based Citadel LLC, a multinational hedge fund and financial services company that handles an estimated 25% of all U.S. stock trading.",
    "Filings posted online by the Federal Election Commission before Monday night’s deadline showed Mehmet Oz — best-known as daytime TV’s host of “the Dr. Oz Show” — loaned himself $5.2 million.",
    "Fetterman raised $2.7 million in the last three months of 2021, but spent more than half of it, while Lamb raised $1.3 million and spent a little less than half, according to the filings.",
    "John Fetterman kept a strong cash advantage — $5.3 million to $3 million — over his nearest rival, Conor Lamb, a third-term congressman from suburban Pittsburgh.",
    "Meanwhile, a super PAC supporting a Republican rival of Oz’s, former hedge fund CEO David McCormick, is tapping into the world of finance for cash.",
    "Three other rivals in each party’s primary each raised in the six-figures in the last quarter of 2021.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "He spent nearly all of it in his quest for the Republican nomination.",
    "In the Democratic primary race, Lt. Gov.",
    "Sign up for the abc27 newsletters here.",
    "The primary election is May 17."
  ]
}