{
  "id": 281,
  "mediaId": 8271,
  "date": "2022-02-21",
  "headline": "Returning to daily life after 28 years behind bars, the Horton brothers are grateful, relieved — and ready with a plan to reduce Philly violence",
  "image": "https://billypenn.com/wp-content/uploads/2022/02/hortonbrothers-18crop-1200x630.jpg",
  "link": "https://billypenn.com/2022/02/21/horton-brothers-philadelphia-wrongful-conviction-reentry-antiviolence-cure-plan/",
  "mediaOutlet": "billypenn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lisa Bryant",
  "authorUrl": "https://billypenn.com/about/lisa-bryant/",
  "termIds": [
    0
  ],
  "sentences": [
    "Mayor Jim Kenney’s administration did not confirm receiving the Hortons’ plan, but offered a statement saying “the city is always open to partnerships with individuals and organizations who are trusted by individuals and communities most at risk.” A spokesperson pointed to Kenney’s Roadmap to Safer Communities, which has a component that involves using “credible messengers who are from neighborhoods.”\nAsked if her office had received or reviewed the C.U.R.E.",
    "The anti-violence strategy argues for “utilizing the knowledge, and experience of life-sentenced inmates, who were once part of the problem, to create a long-term strategy to prevent, reduce and ultimately stop violence.”\nPhiladelphia, which is suffering from an unprecedented shooting epidemic that last year drove homicides to a record high, does not have a shortage of anti-violence initiatives.",
    "The Horton brothers wonder if the overwhelming lack of response is because it “may feel a little uncomfortable to defer to the ideas of prisoners for solutions.”\nFamily, love, and ‘the beauty of being free’\nAs they continue to work to change the system, the brothers are relishing their new existence.",
    "In addition to reengaging with their families and communities, the Hortons have been trying to get officials to listen to the anti-violence strategy they developed behind bars, which they believe can help calm the gun culture that’s become pervasive in their hometown.",
    "“I’m living my best life,” said Dennis, aka Freedom, explaining that what most take for granted are to him and Lee “daily celebrations.” Now in a new relationship, he’s enjoying simply being able to visit or call family whenever he wants.",
    "She’s my best friend.”\nBoth brothers are especially grateful for time with their 79-year-old father, Lee Sr. “He always jokes about making sure we give him his 15 minutes,” said Lee, a reference to the phone time allotted behind bars.",
    "“They need things to do.”\nThe brothers said they have submitted their recommendations to nearly every elected official in the region, going back to the administration of Mayor John Street and including current city leaders.",
    "Lee Horton sat in the waiting area at Jefferson Hospital last March, watching with fascination what he considered an unusual display: many of the people around him seemed to be having animated conversations with themselves.",
    "Specific suggestions include featuring reformed lifers in public service announcements that show “the stark reality of where violent crimes can lead,” or asking them to lead interactive anti-crime discussions in schools.",
    "In addition to pushing for review or adoption of their anti-violence plan, the Hortons work as full-time field organizers for the campaign of John Fetterman, the Pa. lieutenant governor running for U.S. Senate.",
    "“We recommend that the Philadelphia and Chester police and District Attorney’s Office create a CPS training in which specialists work with police to diffuse easily manageable situations,” the document reads.",
    "Despite more than a dozen motions, appeals, and, according to the brothers and their lawyers, deliberate negligence on behalf of police and prosecutors, the courts have yet to recognize their innocence.",
    "Their family was always supportive, the brothers said, but it was hard missing out on seeing their five siblings grow up and have children of their own, or the birth of Lee’s first grandchild, Lee IV.",
    "Pennsylvania is second only to Florida among states with the highest number of people serving life without parole, per a 2021 study by legal aid group Philadelphia Lawyers for Social Equity.",
    "The last time Lee, now 56, and his brother Dennis, 51, freely walked the streets of Philadelphia was 1993, when mobile phones were a rarity and there was no such thing as Bluetooth earbuds.",
    "“But we support Fetterman because he stands for issues that will help our communities,” Lee said, “like second chances, decriminalizing marijuana and raising the minimum wage.”\nC.U.R.E.",
    "“We talked about, what if I get out of here and we no longer fit together.”\nNow married 30 years, Lee said that although he has seen how Joanna has changed, their bond has deepened.",
    "Instead of a grocery store gift card for a surrendered weapon, they suggest offering jobs or job training in exchange for guns\n“It’s the young people doing the shooting,” Lee said.",
    "Long a critic of automatic life sentencing for the second-degree murder charge, he has been a staunch champion for the brothers, citing their exemplary behavior while in prison.",
    "They both say the program completely changed their lives; delivering them from years of underlying trauma, severe anxiety, and depression exacerbated by being falsely accused.",
    "The District Attorney’s Office recently announced the Emerging Adult Unit which aims to connect young adults charged with lower-level crimes to job training, and mentoring.",
    "The group of lifers who want to be a part of the anti-violence solution are “respected by those who commit crime and can use their influence,” the Hortons write.",
    "And upwards of 80% of people sentenced to life without parole in Philadelphia are Black, according to a 2018 report by the nonprofit Abolitionist Law Center.",
    "The Hortons say they have seen men transformed — and are convinced these men can play a crucial role in curbing violence in both Philadelphia and Chester.",
    "Tom Wolf commuted their prison sentences last February, and the brothers have spent the past year reacclimating to a society that evolved without them.",
    "During their incarceration, the Hortons became Certified Peer Specialists through a training offered by the Pennsylvania Department of Corrections.",
    "When they were arrested, Lee’s wife had just given birth to their fourth child, while Dennis, who now goes by Freedom, was engaged to be married.",
    "What most of these programs lack, the Hortons say, is the involvement of men and women who have suffered the same trauma as today’s youth.",
    "The city recently awarded $13.5 million in grants to 31 different community organizations working on different ways to curb the violence.",
    "The plan also calls for implementing comprehensive Certified Peer Specialist training like the one they participated in, across sectors.",
    "Both were charged with second degree murder, which in Pennsylvania carries an automatic life sentence without possibility of parole.",
    "A plan based on lived experience, but often dismissed\nIn the early 2000s, the brothers began forming a plan they call the C.U.R.E.",
    "Fetterman, also chair of the Pa. Board of Pardons, became emotional when he presided during the Hortons’ commutation hearing.",
    "Along with outlining ways for community groups, churches, educational institutions, and businesses to contribute, C.U.R.E.",
    "The nurse was amused, and politely informed him these people were not talking to themselves, but were on their phones.",
    "Lee and wife Joanna, who have been together since their teens, had frank conversations while he was incarcerated.",
    "Coupled with these policy changes, the brothers believe the city could see a dramatic change for the better.",
    "Sign up for the free Billy Penn newsletter to get everything you need to know about Philadelphia, every day.",
    "They gave a ride to childhood friend Robert Leaf, not knowing Leaf had just murdered a man during a robbery.",
    "“She definitely has become a much stronger woman, having to raise four children in Philadelphia by herself.",
    "Within government, Philly police recently formed a new nonfatal shooting unit, staffed with 40 detectives.",
    "The Hortons say they know firsthand that there are men and women who want to help stop the violence.",
    "Police had been following Leaf — and when the car was pulled over, the Hortons were arrested, too.",
    "They would serve the better part of 28 years at State Correctional Institution in Chester.",
    "State Rep. Danilo Burgos (D, North Philadelphia) has been the only one to ever respond.",
    "“Some of them were pacing, laughing, using all kinds of hand gestures,” Horton said.",
    "He commented to a nurse that Jefferson must have a large mental health unit.",
    "It was Memorial Day when the young brothers went for a fateful beer run.",
    "We always loved each other but now we really like each other,” he said.",
    "An alternative gun buy-back program is also part of the strategy.",
    "“She was the one that brought everybody to see us,” said Lee.",
    "plan, Police Commissioner Danielle Outlaw did not respond.",
    "Said Lee: “Not inviting them in is a missed opportunity.”",
    "It also empowered them to effectively help other inmates.",
    "Their mother Lorretta died before seeing them released.",
    "emphasizes the impact “reformed lifers” can have.",
    "“That’s the beauty of being free,” he said.",
    "“It’s like we fell right back into place.",
    ": City United to Respond Effectively.",
    "The Hortons’ situation is not unique.",
    "is only a starting point, they said.",
    "All of that was abruptly cut off.",
    "After decades of advocacy, Gov.",
    "Love Philly?"
  ]
}