{
  "id": 2822,
  "mediaId": 2540,
  "date": "2022-01-29",
  "headline": "NTSB investigators seek clues after Pittsburgh bridge collapse",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/220128091455-05-pittsburgh-bridge-collapse.jpg?c=16x9&q=w_800,c_fill",
  "link": "https://www.cnn.com/2022/01/29/us/pittsburgh-bridge-collapse-investigation/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ray Sanchez and Athena Jones",
  "authorUrl": "https://www.cnn.com/profiles/athena-jones-profile",
  "termIds": [
    4905,
    5857,
    2503,
    1802,
    3989,
    300,
    6520,
    6678
  ],
  "sentences": [
    "Investigators also flew a drone over the area in search of answers as to why the 52-year-old steel frame bridge collapsed in the predawn darkness Friday, leaving 10 people with what authorities said were non-life-threatening injuries.",
    "The Pittsburgh Transit Authority bus shown dangling precariously between two sections of the bridge Saturday had nine cameras mounted on it, Homendy said, but it is not clear whether footage from those cameras will be usable.",
    "On a scheduled visit to Kansas City Friday, Secretary of Transportation Pete Buttigieg called the collapse \"a very blunt reminder\" of the need to invest in American roads and bridges.",
    "The engineers will look for signs of stress in the materials that made up the bridge as well as fractures and deterioration, according to NTSB investigator-in-charge Dennis Collins.",
    "The bridge had received an \"overall condition\" rating of \"poor,\" according to the website for the Pennsylvania Department of Transportation, which tracks bridges across the state.",
    "During a speech at Carnegie Mellon University's Mill 19 Friday afternoon, the President said the collapsed bridge \"had been rated in poor condition for the past 10 years.\"",
    "(CNN)National Transportation Safety Board investigators descended into a wooded ravine in Pittsburgh Saturday where a snow-covered bridge collapsed one day earlier.",
    "The NTSB investigation will examine the full history of the bridge, including design, construction, and maintenance, NTSB chairwoman Jennifer Homendy said.",
    "A preliminary report from the NTSB is expected within the next two weeks, but it will not include a conclusion on the cause of the collapse, Homendy said.",
    "Some \"rehab\" work had been done to the bridge a couple of years ago, including repaving the surface, according to City Councilmember Corey O'Connor.",
    "\"The bottom line is this shouldn't happen in the United States of America,\" Buttigieg said of the collapse, CNN affiliate KMBC reported.",
    "The PennDOT website said the condition of the deck, or road surface, was rated \"4 - Poor,\" as was the superstructure condition.",
    "The collapsed occurred hours before a previously scheduled visit to the city by President Joe Biden to discuss infrastructure.",
    "Homendy said structural and material engineers would map out the area with a drone before removing debris and other evidence.",
    "\"Over the coming weeks, we are going to put this bridge under a microscope,\" Homendy said at a news conference Saturday.",
    "Crews also used what he called a \"daisy chain\" where they linked hands to reach the victims and pull them out.",
    "Four vehicles were on the bridge when it fell in the area of Forbes and Braddock avenues, authorities said.",
    "First responders used ropes to rappel down to get to the victims, Fire Chief Darryl Jones said.",
    "The bus could not be moved safely Saturday because there was diesel fuel still on board.",
    "John Fetterman on CNN Friday called the bridge a \"vital artery\" in the Pittsburgh area.",
    "The 447-foot bridge was built in 1970 on a steel rigid frame, according to the website.",
    "Pittsburgh Mayor Ed Gainey said the bridge had last been inspected in September 2021.",
    "CNN's Sharif Paget, Dakin Andone and Andy Rose contributed to this report.",
    "The bridge crosses Frick Park, one of the city's largest parks.",
    "The substructure condition was rated \"6 - Satisfactory.\"",
    "Pennsylvania Lt. Gov."
  ]
}