{
  "id": 2860,
  "mediaId": 6545,
  "date": "2022-01-28",
  "headline": "Frick Park Bridge Collapse: 10 People Injured, 4 Sent To Hospital",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/01/28/8bbd0bde-dadf-42e6-8106-45af24ba067a/thumbnail/1200x630/15f4e588cdf404c96b6e4cff395e93aa/GettyImages-1238039455.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/frick-park-bridge-collapse-injuries-reported-emergency-crews-at-the-scene/",
  "mediaOutlet": "newyork.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Avoid the area #pittsburghbridgecollapse pic.twitter.com/ykkE4YjiiX\n— Greg Barnhisel (@gbarnhisel) January 28, 2022\nJust hours before President Joe Biden's scheduled speech in Pittsburgh about his historic $1.2 trillion infrastructure plan, Gainey said the bridge over Hot Dog Dam Dog Park was inspected just last September.",
    "Follow our reporters who are covering this story:\nAmy Wadas | Meghan Schiller | Chris Hoffman | Bryant Reed | Ross Guidotti\n(Story continues below the tweet)\nThe Forbes Ave bridge over #frickpark in #pittsburgh collapsed at about 6am.",
    "WATCH: KDKA-TV Breaking News Coverage\n(Story continues below the video)\nEarlier in the day, KDKA-TV's Bryant Reed, who was among the first reporters to arrive at the scene, reported a strong smell of natural gas in the area.",
    "— Jen Psaki (@PressSec) January 28, 2022\nOn the way to his pre-scheduled speech at Mill 19 in Hazelwood, Biden visited the collapse site where he met with local and state officials, including Pennsylvania Lt. Gov.",
    "WATCH Bryant Reed's Live Report from Saturday Morning, a Day after the Collapse:\nCouncilman Corey O'Connor told KDKA in a telephone interview that the collapse could cause traffic headaches for a long time.",
    "WATCH: Mayor Ed Gainey, County Executive Rich Fitzgerald, and Chief Darryl Jones Provide Update\n(Story continues below the video)\n\"This bipartisan infrastructure law is critical,\" Gainey said.",
    "By: KDKA-TV News Staff\nPITTSBURGH (KDKA) - Ten people were injured -- four of them taken to hospitals -- after a bridge collapsed just before rush hour on Pittsburgh's east end Friday morning.",
    ">> PHOTOS: Bridge Collapses In Pittsburgh's Frick Park\nThree of those injured when the Fern Hollow Bridge collapsed near Frick Park before 7 a.m. were rushed to UPMC Presbyterian Hospital.",
    "Search dogs were brought in, as were about a dozen NTSB officials, as a chaotic scene began to unfold in the area of Forbes and Braddock avenues, near Point Breeze, just before daylight.",
    "(Story continues below the photo)\n The Fern Hollow Bridge collapsed early Friday morning, sending a Port Authority bus and several other vehicles tumbling into Hot Dog Dam Dog Park.",
    "Biden was made aware of the collapse and his team had gotten in touch with state and local officials, including Gainey, White House Press Secretary Jen Psaki said on Twitter.",
    "Added Fetterman, who said he drove over the bridge just Thursday: \"I hope it's a wake-up call to the nation that we need to make these critical investments.\"",
    "Thank you @PghPublicSafety for the quick response and thank you to the county, state, and federal governments for the cooperation and assistance.",
    "pic.twitter.com/tTld6t62rn\n— Ed Gainey (@gainey_ed) January 28, 2022\nSeveral cars as well as a Port Authority bus were involved in the collapse.",
    "At least three of the people rushed to hospitals were on the bus at the time of the collapse, Pittsburgh Bureau of Fire Chief Darryl Jones said.",
    "During the short visit, Biden said he hadn't known that Pittsburgh had more bridges than any city in the world, and vowed to \"fix them all.\"",
    "Our team is in touch with state and local officials on the ground as they continue to gather information about the cause of the collapse.",
    "Friday's collapse marked a strange coincidence in that Biden was scheduled to talk about his historic $1.2 trillion infrastructure plan.",
    "https://t.co/4eVtJOIdPw\n— Governor Tom Wolf (@GovernorTomWolf) January 28, 2022\nIt's not known what caused the bridge to collapse.",
    "That gas line was cut, and the several families who were evacuated from their homes were able to return a short time later.",
    "(Story continues below the tweet)\nWe are monitoring the situation in Pittsburgh and prepared to provide support as needed.",
    "The fourth victim was taken to UPMC Shadyside Hospital, but was released after receiving treatment.",
    "Pittsburgh Mayor Ed Gainey tweeted a dramatic aerial picture from above the scene of the collapse.",
    "(Photo: Justin Merriman/Bloomberg via Getty Images)\nNeighbor Wendy Stroh described what she heard.",
    "The collapse ruptured gas lines along the bridge, causing a large gas leak, Public Safety said.",
    "WATCH: Neighbors Recall What They Saw And Heard\nIn:\nPittsburgh Bridge Collapse\nBridge Collapse",
    "\"It sounded like a huge snow plow ... pushing along the surface with no snow,\" she said.",
    "(Story continues below the tweet)\nToday a bridge collapsed near Forbes and S Braddock.",
    "I am thankful there are no reported fatalities or critical injuries at this time.",
    "\"This is a road that a lot of use in the east end, going around the tunnel.",
    "Jones said the Salvation Army and Red Cross have been activated to assist.",
    "John Fetterman, who braved the below-freezing temperatures wearing shorts.",
    "Pittsburgh residents: Please stay safe and continue to avoid the area.",
    "\"At the end of the day it's critical that we get this funding.\"",
    "@POTUS has been told of the bridge collapse in Pittsburgh.",
    "The results of that inspection were not immediately known.",
    "We're looking at a couple-year closure here possibly.\"",
    "\"This is a vital road, artery, in our area,\" he said.",
    "At least one of the victims was a first responder.",
    "Several vehicles and a bus on the bridge.",
    "All were said to be in fair condition.",
    "Gas service was restored, Jones said.",
    "(Story continues below the tweet)\n.",
    "\"I didn't know what it was ...",
    "Strong smell of natural gas.",
    "No injuries reported yet.",
    "It was very frightening.\""
  ]
}