{
  "id": 3001,
  "mediaId": 6621,
  "date": "2022-01-28",
  "headline": "BRIDGE OVER TROUBLED WATER: Bridge Collapses in Pittsburgh, Biden in Town to Tout Infrastructure Win",
  "image": "https://hannity.com/wp-content/uploads/2022/01/pittsburg_bridge_collapse.png",
  "link": "https://hannity.com/media-room/bridge-over-troubled-water-bridge-collapses-in-pittsburgh-with-biden-in-town-to-tout-infrastructure-win/?utm_source=rss&utm_medium=rss&utm_campaign=bridge-over-troubled-water-bridge-collapses-in-pittsburgh-with-biden-in-town-to-tout-infrastructure-win",
  "mediaOutlet": "The Sean Hannity Show",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "According to the Pittsburgh Post-Gazette, a bridge collapsed in Pittsburgh’s Point Breeze neighborhood Friday morning, injuring ten commuters —three were taken to Presbyterian hospital to be treated for non life-threatening injuries.",
    "There will be a lot more in terms of dollars coming to southwestern Pennsylvania to help rebuild communities where the roads, or bridges, or broadband high-speed internet, or waterways investments,” Casey said.",
    "The White House said Biden will discuss “strengthening the nation’s supply chains, revitalizing American manufacturing, creating good-paying union jobs, and building a better America.”\n“He’ll be joined by Gov.",
    "BREAKING: A bridge collapsed in Pittsburgh early Friday morning near the intersection of Forbes and Braddock avenues, which split the Point Breeze, Regent Square and Squirrel Hill neighborhoods.",
    "Tom Wolf in highlighting how the infrastructure law will impact Southwestern Pennsylvania, as well as Democratic United States Sen. Bob Casey,” Pittsburgh’s Action News reports.",
    "Fitzgerald noted that the bridge is ‘a major artery’ that connects the East End, Squirrel Hill and Oakland with both Downtown Pittsburgh and the eastern suburbs,” PPG reports.",
    "“We’re just going to continue to hope for the best and make sure that we get this together,” he added.",
    "Coincidentally (and unfortunately), President Biden is in town to tout his big infrastructure plan.",
    "Allegheny County Executive Rich Fitzgerald, Pittsburgh Mayor Ed Gainey and Pennsylvania Lt. Gov.",
    "Four vehicles and a Port Authority bus fell in the chasm left by the collapse, PPG repots.",
    "“We were fortunate,” Mr. Gainey said, commenting on the fact that no one was killed.",
    "https://t.co/YfpUIcFbDC\n— Pittsburgh Post-Gazette (@PittsburghPG) January 28, 2022",
    "The timing of this couldn’t be much worse for the Biden administration.",
    "“A lot of work is going to need to be done,” Mr. Fitzgerald said.",
    "Start with those Bridges, Casey —you’re lucky no one was hurt.",
    "John Fetterman were on the scene with police and EMS vehicles.",
    "“It’s a preview of coming attractions.",
    "“Mr."
  ]
}