{
  "id": 3109,
  "mediaId": 5329,
  "date": "2022-01-28",
  "headline": "Bridge collapses, drops city bus into Pittsburgh ravine",
  "image": "https://www.twincities.com/wp-content/uploads/2022/01/AP22028508723545-1-1.jpg?w=1024&h=576",
  "link": "https://www.twincities.com/2022/01/28/human-chain-formed-to-help-after-pittsburgh-bridge-collapse/",
  "mediaOutlet": "St.Paul Pioneer-Press ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Scolforo",
  "authorUrl": "https://www.twincities.com/author/mark-scolforo/",
  "termIds": [
    0
  ],
  "sentences": [
    "A spreadsheet on the state Department of Transportation website listed the bridge’s overall condition as poor, which, according to the Pennsylvania Department of Transportation, means “deterioration of primary structural elements has advanced.”\nScolforo reported from Harrisburg, Pennsylvania.",
    "“The bus was bouncing and shaking and it seems long, but it was probably less than a minute that the bus finally came to a stop, and I was just thankful that nobody on the bus was hurt.”\nThe passengers appeared to be OK, he said, so he pulled the air brake and waited for help to arrive.",
    "“Apart from just this abiding noise, we could begin to smell gas and that was the truly frightening thing, then with that smell we both said, let’s get dressed and get out of here,” said Lyn Krynski, whose home is nearest the bridge.",
    "PITTSBURGH — A 50-year-old bridge collapsed in Pittsburgh early Friday, requiring rescuers to rappel down a ravine and form a human chain to reach a few occupants of a municipal bus that plummeted along with the span.",
    "“Judging by the time of day, had this bus been traveling inbound, toward downtown, there likely would have been more people on the bus and obviously could have been a much, much more dire situation,” Brandolph said.",
    "“It was all I had to compare it to — it was this odd, whooshing sound.”\nThe bridge is an important artery that leads to the Squirrel Hill and Oakland neighborhoods and is a popular route toward downtown Pittsburgh.",
    "But a September 2019 inspection of the city-owned bridge revealed the deck and superstructure to be in poor condition, according to the U.S. Department of Transportation’s National Bridge Inventory.",
    "The collapse came hours before President Joe Biden arrived in the city to promote his $1 trillion infrastructure law, which has earmarked about $1.6 billion for Pennsylvania bridge maintenance.",
    "“The first sound was much more intense, and kind of a rumbling, which I guess was the structure, the deck hitting the ground,” said Ken Doyno, a resident who lives four houses away.",
    "“I mean, the whole house rattled at that point.”\nRuptured gas lines along the bridge produced the leak, and the supply of gas was shut off within a half-hour, city officials said.",
    "John Fetterman called it “just an awful, surreal scene.”\n“I hope it’s a wake-up call to the nation that we need to make these infrastructure investments,” Fetterman said.",
    "The segmented bus operated by the Port Authority of Allegheny County had two passengers in addition to the driver, said Adam Brandolph, spokesperson for the agency.",
    "First responders reached them after descending with flashlights in the predawn darkness and used a rope to help him and other occupants get to safety, Luciani said.",
    "Most of the 10 people evaluated for injuries were first responders who were checked for exhaustion or because of the cold and snowy weather, Gainey said.",
    "About two hours after the collapse, Brandolph said, one of the passengers was on another bus, began complaining of injuries and was taken to a hospital.",
    "Neighbors said a gas company worker went door to door to get them to evacuate from the immediate vicinity before the gas was successfully shut off.",
    "A large crack showed on the end of the bridge where the segmented bus landed 150 feet (46 meters) down in the ravine, as if hit by an earthquake.",
    "“It sounded like a weather phenomenon more than anything,” said Douglas Gwilym, who was shoveling about an inch of snow when he heard the noise.",
    "The bus had seven or eight cameras, and any footage they captured of the collapse will be part of the investigation, Brandolph said.",
    "Associated Press writers Tom Krisher in Detroit and Michael Rubinkam in northeastern Pennsylvania contributed to this report.",
    "The National Transportation Safety Board was sending a team of about 10 people to investigate, an agency spokesperson said.",
    "As Biden toured the scene, an officer told him a person who was running by helped first responders get people out of cars.",
    "The bus driver, Daryl Luciani, told WPXI-TV that as soon as he reached the bridge, he believed it was collapsing.",
    "The bus had started its route in downtown Pittsburgh and had been heading to the suburban community of Braddock.",
    "By midafternoon, three adults were being treated, and all were in fair condition, the UPMC hospital system said.",
    "The loud noise from the collapse was followed by a hissing sound and the smell of natural gas, witnesses said.",
    "Several neighbors said a weather-prompted two-hour school delay may have prevented a far worse human tragedy.",
    "The steel bridge, which was built in 1970, carries about 14,500 vehicles a day, according to a 2005 estimate.",
    "Wasserman said the most recent inspection occurred in September but the report was not immediately available.",
    "A search-and-rescue team combed the area, said Sam Wasserman, a spokesperson for Pittsburgh Mayor Ed Gainey.",
    "The Forbes Avenue bridge over Fern Hollow Creek in Frick Park came down at 6:39 a.m., city officials said.",
    "A car landed upside down in front of the bus, which was operated by the Pittsburgh area’s transit agency.",
    "The cause was being investigated, and crews searched under the debris for additional victims.",
    "The driver and other passenger were not hurt, according to Brandolph.",
    "Five other vehicles were also on the bridge at the time.",
    "A fourth person had received treatment and was released.",
    "At the site of the collapse, Pennsylvania Lt. Gov.",
    "“I could just feel it,” Luciani told the station.",
    "At least four people required hospital treatment.",
    "Authorities told motorists to avoid the area.",
    "“It really is, it’s astounding,” Biden said.",
    "Drones were brought in to help.",
    "No deaths were reported.",
    "He called it a miracle."
  ]
}