{
  "id": 3168,
  "mediaId": 2730,
  "date": "2022-01-30",
  "headline": "Democrats Decline to Offer Endorsement for Key Open Senate Seat",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2018/73/626a1353-d23a-4d33-93cb-df94eddf5a4c.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/01/30/democrats-decline-to-offer-endorsement-for-key-open-senate-seat-n2602576",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Given that John Fetterman has a substantial lead in the polls and the most money in the bank, he benefits the most from no one being endorsed by the state Democratic Party.”\nThe lack of an endorsement is also a small victory for the other candidates in the primary, who were not expected to win the party’s backing.",
    "Conversely, the late Sen. Arlen Specter, who changed his party registration from Republican to Democrat after voting for then-President Barack Obama’s economic stimulus package, got the party nod in 2010, but then was defeated in the primary.",
    "Still, he said, “you’d rather have it than not have it.”\nOtterbein's report also covered how Fetterman has failed to endear himself to state committee members, as they claim to have not heard from him enough and not be too fond of his style.",
    "While Playbook pointed out that David McCormick \"won the latest round of southwestern PA straw polls this weekend with the support of 35 members of the Republican State Committee,\" it also referenced recent wins for Jeff Bartos.",
    "From Otterbein's report:\n“No endorsement means no change in the existing trajectory of this campaign,” said J.J. Balaban, a Pennsylvania-based Democratic strategist who is not working for a candidate in the Senate race.",
    "Lamb, as I previously covered earlier this month, used to be considered a moderate, but has moved to the left in an attempt to curry support, such as when he came out in favor of abolishing the filibuster.",
    "So I’m honored to have gotten 60 percent, and we’re walking out of here victorious because we showed them that we can outperform every other campaign.”\nHe added: “It wasn’t 60 percent to 40 percent.",
    "Pennsylvania Republicans will meet to give a possible endorsement next week, though with the Republican field also being a crowded one, there might not be an endorsement made in this case either.",
    "When it comes to the upcoming November midterm elections, Republicans are predicted to take back control of the U.S. of Representatives, and potentially the U.S. Senate as well.",
    "He ultimately stayed in Pittsburgh to hear President Joe Biden give a speech on infrastructure, which took place hours after a bridge had collapsed nearby early in the morning.",
    "“There isn’t much connection in Pennsylvania in a high-profile race between winning the endorsement of the state committee and actually winning the primary,” said Balaban.",
    "Though it was a letdown for Lamb, most Democratic insiders predicted before the vote that no endorsement would take place due to the high bar needed to receive it.",
    "It was a commanding victory over two other, really three other candidates.”\nNot only was an endorsement not necessarily expected, but it doesn't always mean much.",
    "In her reporting for POLITICO, Holly Otterbein indicated that this is particularly disappointing for Rep. Conor Lamb, who has lobbied hard for the endorsement.",
    "The field has been a crowded one, and while the Pennsylvania Democratic Party held a meeting on Saturday, they declined to endorse a candidate.",
    "It would not have come with money, and candidates who carry the state’s Democratic Party endorsement do not have a sterling record of success.",
    "Otterbein referred to it as \"one of the biggest Senate races in the country,\" while the Playbook noted \"All eyes [are] on Pennsylvania.\"",
    "In order for a candidate to earn an endorsement, he or she must receive at least two-thirds of the votes from state committee members.",
    "One of the seats that could determine control comes down to Sen. Pat Toomey's seat, a Republican from Pennsylvania who is retiring.",
    "The nod required winning at least two-thirds of the votes of state committee people, and Lamb fell just short of that threshold.",
    "As I reported on Friday, Fetterman had initially planned to meet with Pennsylvania Democrats in the capital city of Harrisburg.",
    "Every candidate had the chance to make their case to this pool of voters from around our state,” said Lamb in an interview.",
    "His campaign has also made it a point to stress that Bartos is the only lifelong Pennsylvania resident in the race.",
    "In 2016, for instance, Katie McGinty did not receive the endorsement, but went on to win the Senate primary.",
    "While Lamb finished first, with 61 percent of the vote on the second ballot, he nevertheless fell short.",
    "Both Otterbein in her reporting and Sunday's POLITICO Playbook emphasized how important this race is.\"",
    "And Lamb demonstrated that he has a significant amount of support in the state party regardless.",
    "As I covered last week, Bartos has had multiple successes in a row when it comes to straw polls.",
    "Democratic operatives said that the value of the endorsement shouldn’t be overestimated.",
    "He finished in first place with 61 percent of the vote on a second ballot.",
    "He has lagged behind current Lieutenant Governor John Fetterman.",
    "Fetterman took second place, garnering 23 percent of ballots.",
    "We could be talking about a serious blowout for Democrats.",
    "In other words, it would have been no guarantee.",
    "“We all started out at zero-zero.",
    "“We outworked everybody."
  ]
}