{
  "id": 3184,
  "mediaId": 2640,
  "date": "2022-01-28",
  "headline": "Biden: We'll Fix That Bridge, Others",
  "image": "https://img1-azrcdn.newser.com/image/1395922-12-20220225010958.jpeg",
  "link": "https://www.newser.com/story/316259/biden-talks-infrastructure-after-bridge-collapses.html",
  "mediaOutlet": "newser.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Cronin",
  "authorUrl": "https://www.newser.com/bio/83627676/bob-cronin.html",
  "termIds": [
    0
  ],
  "sentences": [
    "(Newser) – President Biden had planned to give a speech about infrastructure needs Friday at Mill 19, a research and development hub that once was a major metals producer in Pittsburgh, WTAE reports.",
    "Biden spoke with first responders and praised them after rescuers had created a human chain to get people out of a bus that's now at the bottom of a ravine.",
    "\"We're going to rebuild that bridge, along with thousands of other bridges in Pennsylvania and across the country because it's in our interest.\"",
    "\"We saw today when a bridge is in disrepair it literally can threaten lives,\" Biden said at the former mill, per the Wall Street Journal.",
    "He did that, but he made a stop first at a place that made his point for him: the remains of a bridge that collapsed earlier in the day.",
    "\"It's a snapshot of what is happening to our infrastructure,\" said Kent Harries, a structural engineer who teaches bridge design.",
    "\"It's surreal to see a major artery just collapse into a ravine,\" said Allegheny County Executive Rich Fitzgerald.",
    "Monica Layton, who said she's on the bridge twice a day for her commute., was dressing for work when it collapsed.",
    "The bridge that collapsed was graded \"poor\" after inspections in 2011 through at least 2017, data show.",
    "\"We have a very large proportion of our structures throughout the Northeast that would be rated poor.\"",
    "Biden said his legislation will send $1.6 billion to Pennsylvania for bridge work, per Politico.",
    "At least four people were treated at hospitals after the 50-year-old span fell, per the AP.",
    "The national allocation is $27 billion over the next five years.",
    "The state says that's true of 10% of the 25,000 bridges it owns.",
    "\"Our infrastructure is failing our people,\" said Lt. Gov.",
    "\"That was frightening and unnerving,\" she said.",
    "(Read more Biden infrastructure plan stories.)",
    "\"I could have been on that bridge.\"",
    "John Fetterman."
  ]
}