{
  "id": 3189,
  "mediaId": 2696,
  "date": "2022-01-28",
  "headline": "Pittsburgh bridge collapse injures 10 on day Biden to visit city to talk infrastructure",
  "image": "https://www.boston.com/wp-content/uploads/2022/01/Bridge_Collapse_Pittsburgh_75351-61f403efafaff-scaled.jpg",
  "link": "https://www.boston.com/news/national-news/2022/01/28/pittsburgh-bridge-collapse-injures-10-on-day-biden-to-visit-city-to-talk-infrastructure/",
  "mediaOutlet": "The Boston Globe",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Epstein",
  "authorUrl": "http://www.boston.com/author/david-epstein",
  "termIds": [
    0
  ],
  "sentences": [
    "Pittsburgh Public Safety acknowledged a “confirmed bridge collapse” at around 6:50 a.m. A photo from KDKA showed at least four vehicles, including a Port Authority bus, on the Fern Hollow Bridge near Forbes and Braddock avenues, which connects the Point Breeze, Regent Square and Squirrel Hill neighborhoods of Pittsburgh.",
    "A Pittsburgh bridge collapsed early Friday, according to authorities, injuring 10 people just hours before President Joe Biden was scheduled to visit the city to talk about infrastructure.",
    "Three people were hospitalized, but none of the injuries are life-threatening, said Darryl Jones, the chief of the Pittsburgh Bureau of Fire, at a news conference.",
    "As part of his trip, the president will visit the research and development hub of Mill 19, which was part of the infrastructure deal passed by Congress last year.",
    "“The good thing at this point is that there are no fatalities and we’re gonna pray there are no fatalities,” Pittsburgh Mayor Ed Gainey, D, told reporters.",
    "Port Authority spokesman Adam Brandolph confirmed to The Washington Post that a driver and two passengers were able to escape without injury.",
    "Public Safety said there was “a strong smell of natural gas in the area.” The agency confirmed that a gas line has been cut.",
    "Another vehicle was shown dangling near the edge of the collapsed bridge, located in Frick Park.",
    "The collapse comes the same day that Biden is visiting Pittsburgh to discuss infrastructure.",
    "The Red Cross has been contacted to assist with victims, according to Public Safety.",
    "The White House did not immediately respond to a request for comment early Friday.",
    "Nearby homes are being evacuated due to the gas smell, according to KDKA.",
    "A news conference is expected sometime Friday, authorities said.",
    "Police, fire and EMS personnel are responding to the collapse.",
    "“A lot of work is going to need to be done,” Fitzgerald said.",
    "Pittsburgh Mayor Ed Gainey, D, and Pennsylvania Lt. Gov.",
    "“Please avoid if at all possible,” the agency tweeted.",
    "John Fetterman, D, are on the scene."
  ]
}