{
  "id": 3194,
  "mediaId": 2509,
  "date": "2022-02-02",
  "headline": "Trump-endorsed challengers lag behind incumbent Republicans in fundraising",
  "image": "https://s.abcnews.com/images/Politics/Cheney-1-ap-er-220202_1643828881749_hpMain_16x9_992.jpg",
  "link": "https://abcnews.go.com/Politics/trump-endorsed-challengers-lag-incumbent-republicans-fundraising/story?id=82628482",
  "mediaOutlet": "ABC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Soo Rin Kim",
  "authorUrl": "https://abcnews.go.com/author/soo_rin_kim",
  "termIds": [
    0
  ],
  "sentences": [
    "The candidate who appears to have raised the most money of any GOP challenger is Georgia Senate candidate and former football star Herschel Walker, who raised $5.4 million in the fourth quarter to lift his fundraising total to $10 million since the start of his campaign -- signaling what could be an expensive general election race between him and Democratic incumbent Raphael Warnock, who has nearly $23 million in cash on hand.",
    "Cheney, one of two Republicans on the nine-member House committee investigating the Jan. 6 attack on the U.S. Capitol, has also received support from some major liberal donors who typically give only to Democrats, including investor and billionaire John Pritzker of the Pritzker family, who maxed out on his contribution to Cheney by giving $10,800 to her joint fundraising committee earlier last year.",
    "Three of the 10 House Republicans who voted to impeach former President Donald Trump have tapped out early to announce they are not seeking reelection in 2022 -- but the remaining seven appear to be running strong races, judging by fundraising numbers disclosed in the latest campaign finance filings.",
    "Rooney, who had previously given upwards of $1 million to various GOP candidates groups over the years, told ABC News that he's no longer giving to the RNC and Republicans except for Cheney and a handful of others, because he's tired of Trump-dominated narratives within the Republican Party.",
    "\"This massive fundraising haul, likely the largest in the country for a non-incumbent, shows that Georgia Republicans are clearly united behind Herschel Walker and are ready to take on Senator Warnock,\" Scott Paradise, campaign manager for Team Herschel, said in a press release last week.",
    "Rep. Marjorie Taylor Greene, who had boasted $3.5 million in donations in the first quarter of 2021, reported a relatively small $1.2 million haul in the final quarter, while Reps. Matt Gaetz and Lauren Boebert's fundraising both gradually slowed down throughout the year.",
    "Reps. Fred Upton and Peter Meijer, both representing Michigan, also boasted major fundraising advantages over their respective Trump-endorsed challengers, Steve Carra and John Gibbs, both bringing in five times the amount their challengers took in last quarter.",
    "As 2022 candidates were gearing up for the upcoming midterm election none of the Trump-endorsed challengers vying to unseat those seven House Republicans managed to outraise the sitting lawmakers in the last quarter of 2021, filings released this week show.",
    "Rep. Mo Brooks, who is running for a Senate seat, was significantly outraised in the fourth quarter by his GOP primary challenger Katie Britt, who raised $1.2 million compared to Brooks' $385,000 -- a huge drop from what he raised in the previous quarter.",
    "Although his fundraising showed signs of slowing down in the final quarter of 2021, with contributions of $181,000 compared to the nearly $700,000 he raised in the previous quarter, he nonetheless entered 2022 with nearly $1 million in cash on hand.",
    "Also among those rallying behind Cheney are Trump critics within the Republican Party, including former Rep. Francis Rooney, R-Fla., who is among several Republican lawmakers who announced their retirement after clashing with pro-Trump GOP forces.",
    "Bush also gave $2,800 to Sen. Lisa Murkowski, R-Alaska, who has been targeted by Trump for being one of seven Senate Republicans who voted to convict him in his impeachment trial last year, and the only one of them up for reelection this year.",
    "The Senate and House arms of the Republican Party also slightly outraised their Democratic counterparts, and entered the year with a slightly bigger war chest of $111 million compared to the Democratic committees' $106 million.",
    "Most notably, Rep. Liz Cheney -- with backing from both establishment Republicans and moderate Democrats -- has broken her own fundraising records, despite being the most high-profile Republican on Trump's 2022 hit list.",
    "It's not uncommon for incumbents to have a big cash advantage over their challengers, but the large fundraising gaps hint at the long way Trump-backed challengers have to go to -- despite the former president's support.",
    "John Fetterman held a strong lead in fundraising over the course of last year, but fellow Western Pennsylvanian Rep. Conor Lamb appears to be gaining traction, bringing in $1.35 million in the fourth quarter of 2021.",
    "Beasley's campaign manager, Travis Brimm, said in a press release that they are \"committed to building a strong, grassroots campaign that touches every corner of the state and helps lead to victory in November.\"",
    "Former Trump aide Max Miller, who's running to fill retiring GOP Rep. Anthony Gonzalez's seat in Ohio, continued to report the strongest fundraising figures among contenders vying for Gonzalez's open seat.",
    "In Senate races, Sen. Tim Scott, who is endorsed by Trump and is also considered a possible 2024 presidential election contender, continued to bring in large sums, raising $7 million in the fourth quarter.",
    "South Carolina Republican Russell Fry, who Trump endorsed just this week, managed to raise close to the amount raised by incumbent Rep. Tom Rice, but still faces Rice's big war chest of nearly $2 million.",
    "Similar to Cheney, Murkowski outraised her Trump-endorsed challenger, Kelly Tshibaka, by more than double in the final three months of 2021, and entered the 2022 election year with $4.3 million on hand.",
    "In Washington's 3rd District, Rep. Jaime Herrera Beutler held a narrower fundraising gap over Trump-backed challenger Joe Kent, but still entered 2022 with a much larger war chest than his rival.",
    "\"My wife and I maxed out for Liz and then we held a fundraiser for her because we wanted to speak up,\" Rooney, who gave Cheney's joint fundraising committee $10,800 back in May, told ABC News.",
    "TV doctor Mehmet Oz and former hedge fund CEO Dave McCormick are reportedly dropping millions in advertising, but it remains to be seen whether they're getting any return on their investment.",
    "In total, the RNC outraised the DNC by $8 million, but the DNC entered the election year with a bigger war chest, reporting $67 million in cash on hand compared to $56 million for the RNC.",
    "In North Carolina, leading Senate candidate Cheri Beasley took in $2.1 million in the final quarter of 2021, with 90% of her donations being $100 or less, according to her campaign.",
    "In Pennsylvania, the Senate primary field was upended when the Trump-endorsed candidate dropped out in November, leading two relative newcomers to emerge on the campaign trail.",
    "On the Democratic side, Arizona Sen. Mark Kelly joins Warnock as the party's top two fundraisers, with Kelly holding $19 million in cash on hand as both men seek reelection.",
    "Among Cheney's other donors in the final months of last year was former President George W. Bush, who maxed out on his donation to her campaign by giving $5,800 in October.",
    "Her Trump-endorsed primary challenger, Harriet Hageman, raised less than half of Cheney's fourth-quarter haul during the same period, reporting just over $745,000.",
    "The Wyoming Republican reported raising more than $2 million in just the final three months of last year, bringing her 2021 fundraising total to $7.2 million.",
    "Miller was one of several big-name Trump-aligned GOP candidates who failed to maintain their massive fundraising momentum from the earlier part of 2021.",
    "As the 2022 election year ramps up, Hageman's cash on hand is just $381,000 compared to Cheney's $4.7 million war chest, according to filings.",
    "And nationally, the Democratic Party and Republican Party fared about even with their national party committees' fundraising in 2021.",
    "The split among Republican donors could make Trump's endorsement all the more important for Budd, the current leading fundraiser.",
    "In North Carolina, no GOP Senate candidate raised more than a million dollars in the final quarter amid a competitive primary.",
    "Trump-endorsed Senate candidate Ted Budd brought in $968,360 while former North Carolina Republican Gov.",
    "Patrick McCory raised $748,072 and Rep. Mark Walker brought in only $146,053.",
    "In what could be a tight Senate primary race in Pennsylvania, Lt. Gov.",
    "Trump has yet to make an endorsement in the race."
  ]
}