{
  "id": 3197,
  "mediaId": 2525,
  "date": "2022-01-28",
  "headline": "‘A boom, then a monster sound’: 10 hurt after bridge in Pittsburgh collapses",
  "image": "https://www.bostonherald.com/wp-content/uploads/2022/01/AP22028686651338.jpg?w=1024&h=683",
  "link": "https://www.bostonherald.com/2022/01/28/a-boom-then-a-monster-sound-10-hurt-after-bridge-in-pittsburgh-collapses/",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pittsburgh Post-Gazette",
  "authorUrl": "https://www.bostonherald.com/author/pittsburgh-post-gazette/",
  "termIds": [
    0
  ],
  "sentences": [
    "Ten people were injured Friday morning when a bridge in Pittsburgh collapsed, officials said, with six vehicles including a Port Authority bus left stranded in the twisted mess of a span that had been listed in poor condition for the past decade.",
    "The roughly $1 trillion infrastructure law signed by Biden has earmarked about $1.6 billion for Pennsylvania bridge maintenance, with tens of billions more for public transit, highway maintenance and broadband internet expansion in the state.",
    "It’s very, very busy.”\nIn a statement, Port Authority said the bus that became trapped — the 61B Braddock-Swissvale — was headed outbound on the bridge at about 6:45 a.m. and had nearly reached the east side of the bridge when it collapsed.",
    "“We were fortunate” that no one was killed, Pittsburgh Mayor Ed Gainey said Friday morning from the scene of the collapse, where he was joined by Allegheny County Executive Rich Fitzgerald and Pennsylvania Lt. Gov.",
    "“Their diligence ensured everyone on the bridge was safe.”\nSearch and rescue crews are now focused on searching for possible victims underneath the rubble of the bridge, the city news release added.",
    "Melissa Bakth, who lives near Frick Park, said she was in bed just before 7 a.m. Friday when she heard the four-lane bridge collapse, followed by the rushing sound of the gas line breaking.",
    "Multiple local officials said the collapse illustrated how desperately the region and the nation need the significant and rapid infrastructure investment for which Biden has pressed.",
    "“First responders worked quickly and effectively together, sharing resources and information,” acting Pittsburgh Public Safety Director Lee Schmidt said in the release.",
    "A fourth person — one of the two passengers on the bus — was taken to a hospital about two hours after the crash, Port Authority spokesperson Adam Brandolph said.",
    "Chief Jones said several nearby families were initially evacuated from their homes due to the leak but were allowed to return to their homes by midmorning.",
    "The bridge collapsed as the city prepared for a visit from President Biden, who spoke about infrastructure Friday afternoon at Mill 19 in Hazelwood.",
    "Brandolph said the bus initially slid backward at about a 45-degree angle, but it stopped when its rear got caught on part of the rubble.",
    "The bridge is a major artery that connects Pittsburgh’s East End with Downtown in one direction and the eastern suburbs in the other.",
    "Three people were transported to a hospital with non-life-threatening injuries, Pittsburgh Fire Chief Darryl Jones said.",
    "Chief Jones said rescue crews rappelled 100 to 150 feet down the steep hillside in order to help injured people up.",
    "Biden stopped at the site of the collapse early Friday afternoon en route to Hazelwood.",
    "Rescue operations were finished by 8:30 a.m., the city said in a news release.",
    "Emergency crews were then able to rescue the driver and the two passengers.",
    "UPMC said in a statement that all four were in fair condition.",
    "“There was a boom, then a monster sound,” Bakth said.",
    "“It was so loud, and it didn’t stop.",
    "John Fetterman, among others.",
    "I’m on that bridge every day.",
    "It could’ve been me."
  ]
}