{
  "id": 3202,
  "mediaId": 2740,
  "date": "2022-01-28",
  "headline": "10 injured, 3 hospitalized after Pittsburgh bridge collapse; Bridge was in 'poor' condition, needed $1.5M in repairs",
  "image": "https://www.gannett-cdn.com/presto/2022/01/28/USAT/b094477b-d719-4c2c-926f-eaecc1a9ffd4-AP_APTOPIX_Bridge_Collapse_Pittsburgh.jpg?crop=1157,651,x669,y1054&width=1157&height=651&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/nation/2022/01/28/pittsburgh-bridge-collapse-injuries-gas-leak/9252117002/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatoday-newstopstories",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christine Fernando",
  "authorUrl": "https://www.usatoday.com/staff/5382959002/christine-fernando/",
  "termIds": [
    0
  ],
  "sentences": [
    "“The bus was bouncing and shaking and it seems long, but it was probably less than a minute that the bus finally came to a stop, and I was just thankful that nobody on the bus was hurt.”\nThe passengers appeared to be OK, he said, so he pulled the air brake and waited for help to arrive.",
    "The bridge's deck, the portion that carries traffic, and superstructure, which supports the deck and connects it to support columns, were both in \"poor\" condition, the agency said, adding it was in urgent need of about $1.5 million in repairs.",
    "`We're going to fix them all':At site of collapsed Pittsburgh bridge, Biden's infrastructure push gains new urgency\nAmong the vehicles on the bridge during the collapse was a 60-foot city bus, according to the Pittsburgh Port Authority.",
    "Ten people were injured and three were taken to a hospital after a snow-covered bridge in Pittsburgh collapsed Friday morning, sending the bridge - and the morning commuters on it - crashing into a ravine.",
    "“The first sound was much more intense, and kind of a rumbling, which I guess was the structure, the deck hitting the ground,” said Ken Doyno, a resident who lives four houses away.",
    "“I mean, the whole house rattled at that point.”\nRuptured gas lines along the bridge produced the leak, and the supply of gas was shut off within a half-hour, city officials said.",
    "Allegheny County, where Pittsburgh is based, is home to the most bridges in the state and also the most deficient bridges in the state with 142 that are structurally deficient.",
    "Corrections & Clarifications: This story has been updated to reflect that the U.S. Army Reserve was not deployed to search the area for victims of the bridge collapse.",
    "First responders reached them after descending with flashlights in the predawn darkness and used a rope to help him and other occupants get to safety, Luciani said.",
    "Officials urged residents to avoid the area, and several area families were evacuated but have since returned to their homes surrounding the bridge, Jones said.",
    "Police, firefighters and emergency medical service teams responded to the collapse, and the Red Cross has been contacted to help victims, safety officials said.",
    "\"Pennsylvania has thousands of structurally deficient bridges, and we need to use the infrastructure money to ensure this never happens again,” he added said.",
    "Photos from Pittsburgh Public Safety showed the collapsed bridge as police cars arrived and a Pittsburgh city bus sitting nearly upright on the fallen bridge.",
    "Rescuers used ropes to rappel at least 100 to 150 feet to the fallen bridge, and others formed a human chain to help rescue occupants of the bus, Jones said.",
    "Another image from local news station KDKA-TV showed at least four vehicles in the chasm left by the fallen bridge as another vehicle dangled near the edge.",
    "The collapse came hours before President Joe Biden was set to visit the city to discuss a $1 trillion infrastructure bill that includes bridge maintenance.",
    "The collapsed bridge was an important artery that leads to the Squirrel Hill and Oakland neighborhoods and was a popular route toward downtown Pittsburgh.",
    "With the smell of gas still in the air from the accident, Biden spoke with local officials about what happened and sent a wider message to the country.",
    "Sam Wasserman, a spokesperson for Pittsburgh Mayor Ed Gainey, told USA TODAY the most recent inspection of the bridge was completed in September 2021.",
    "The sudden collapse happened years after an inspection found the bridge was in poor condition and urgently needed repairs, which were never done.",
    "Mayor Ed Gainey tweeted he was thankful there were no fatalities or critical injuries and thanked safety departments for their \"quick response.\"",
    "The state has 3,352 bridges in poor condition, according to the Federal Highway Administration — the second-most bridges in poor condition.",
    "\"I'm at the site now and it's astonishing there weren't fatalities,” Fetterman said in an interview with USA TODAY Network in Pennsylvania.",
    "\"We're going to fix them all,\" Biden said of the bridges in Pittsburgh and the estimated 45,000 across the country rated in poor condition.",
    "The Federal Highway Administration's National Bridge Inventory lists the bridge's last inspection as occurring in September of 2019.",
    "Proposed work included \"bridge rehabilitation because of general structure deterioration or inadequate strength,\" the agency said.",
    "The two-lane bridge, called Fern Hollow Bridge, came down just before 7 a.m. over Fern Hollow Creek in Frick Park, police said.",
    "The three people taken to the hospital have non-life-threatening injuries, Pittsburgh Fire Chief Darryl Jones said Friday.",
    "Pennsylvania is set to receive nearly $2 billion from the infrastructure bill to fix its aging and deficient bridges.",
    "Contact News Now Reporter Christine Fernando at cfernando@usatoday.com or follow her on Twitter at @christinetfern.",
    "\"I hope it’s a wake-up call to the nation that we need to make these infrastructure investments,\" Fetterman said.",
    "A large crane sat on one side of the now-destroyed bridge, helping pull vehicles that fell into the snowy pass.",
    "The loud noise from the collapse was followed by a hissing sound and the smell of natural gas, witnesses said.",
    "The driver, Daryl Luciani, told WPXI-TV that as soon as he reached the bridge, he believed it was collapsing.",
    "Rescue teams continued Friday to search through the pancaked slabs of concrete for any potential victims.",
    "The lieutenant governor lives in the area and traveled across the bridge the day before it collapsed.",
    "The public safety department said five vehicles and one bus were on the bridge when it collapsed.",
    "Contributing: Candy Woodall, USA TODAY Network - Pennsylvania; The Associated Press.",
    "Meanwhile, the bridge could remain open, but was to be inspected annually.",
    "Those repairs had not been completed, according to the federal data.",
    "The driver and two passengers managed to escape without injuries.",
    "The bridge was built in 1970, making it more than 50 years old.",
    "He met with rescue crews and fellow Democrats Pennsylvania Gov.",
    "“I could just feel it,” Luciani told the station.",
    "Several people on their morning jogs also helped.",
    "Tom Wolf tweeted he is monitoring the situation.",
    "Frick Park closed Friday after the collapse.",
    "He diverted his plans to visit the site.",
    "John Fetterman and U.S. Sen. Bob Casey.",
    "\"We're sending the money.\"",
    "Tom Wolf, Lt. Gov.",
    "Pennsylvania Gov."
  ]
}