{
  "id": 3258,
  "mediaId": 2540,
  "date": "2022-01-28",
  "headline": "Bridge in Pittsburgh collapses hours before scheduled Biden visit to talk infrastructure",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220128091455-05-pittsburgh-bridge-collapse-super-tease.jpg",
  "link": "https://www.cnn.com/2022/01/28/us/pittsburgh-bridge-collapse/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dakin Andone",
  "authorUrl": "https://www.cnn.com/profiles/dakin-andone",
  "termIds": [
    0
  ],
  "sentences": [
    "In a statement, Fetterman, the lieutenant governor, called the collapse Friday \"just the latest in a long line of preventable, man-made disasters that prove what so many of us in Pennsylvania have been saying for years: Our infrastructure is failing our people.\"",
    "However, while the fire chief said the bridge had not been a concern for city officials, it had received an \"overall condition\" rating of \"poor,\" according to the website for the Pennsylvania Department of Transportation, which tracks bridges across the state.",
    "Bridge is a 'vital artery' for the area, official says\nAccording to CNN Meteorologist Brandon Miller, a light snow was falling Friday morning in Pittsburgh, though only one to two inches had accumulated since it started around 2 a.m.",
    "There are so many bridges in the city, in the county that we live in, and this infrastructure bill -- you talk about irony, the President's coming to talk about infrastructure -- we need it,\" the council member said.",
    "\"If this would have occurred an hour later, this is a road that gets probably about 15,000 cars on it a day, and if it was rush hour, we would be looking at a couple hundred cars down in that valley,\" he said.",
    "In an interview with CNN, Pittsburgh City Councilmember Corey O'Connor said it was fortunate the collapse didn't happen later in the morning, when there likely would have been far more traffic on the bridge.",
    "Asked about the collapse coming the same day of the President's visit, Fetterman, a Democrat, said, \"This is a horrible way to underscore just how critical our infrastructure needs are in this country.\"",
    "In the meantime, rebuilding the bridge could take \"at least a year,\" Allegheny County Executive Rich Fitzgerald told CNN, citing a best-case scenario estimate by state engineers from PennDOT.",
    "Allegheny County Executive Rich Fitzgerald said normally there are a lot of people walking or jogging on trails under the bridge, but no one was there because of the weather and time of day.",
    "The city's bridges are routinely inspected, he said, and \"if there was any warning or concern, we would have been notified and we would have made sure that we didn't use this route.\"",
    "\"Thankfully, schools were on a two-hour delay for weather,\" he said, \"so the traffic was less than it would have been normally on a normal day, but it's surreal to see this bridge.\"",
    "Another nearby resident, Wendy Stroh, told CNN affiliate KDKA she heard the collapse, but thought it sounded like \"a huge snowplow pushing along a raw tarmac surface with no snow.\"",
    "The Allegheny County Police Department was notified about a partial bridge collapse sometime after 6 a.m. on Friday, according to Amie Downs, a spokesperson for the county.",
    "I didn't realize that there are literally more bridges in Pittsburgh than in any other city in the world,\" Biden said, adding, \"We're going to fix them all.\"",
    "The weather is not directly related to a strengthening nor'easter off the US East Coast, Miller said, but a separate system dropping in from the north.",
    "\"If the lowest rating is greater than or equal to 7, the bridge is classified as Good; if it is less than or equal to 4, the classification is Poor.",
    "Peoples Gas crews are on the scene assessing the situation, Kukovich said, and nearby customers are experiencing \"minimal service interruptions.\"",
    "\"We got very, very lucky today, and hopefully those individuals at the hospital recover quickly and they're home safe in the next couple days.\"",
    "No fatalities have been reported, Pittsburgh Mayor Ed Gainey said in a news conference at the scene in the area of Forbes and Braddock avenues.",
    "The National Transportation Safety Board has a team on site and is bringing in a crash reconstructionist who will map the scene with a drone.",
    "There are some reports of people feeling ill in the area from natural gas, Downs said, and those individuals are being treated on the scene.",
    "According to PennDOT, a bridge's condition \"is determined by the lowest condition rating of the primary components of a bridge or culvert.\"",
    "CNN's Amanda Watts, Paul P. Murphy, Athena Jones, Nikki Carvajal, Sam Fossum, Sharif Paget and Alisha Ebrahimji contributed to this report.",
    "Greg Barnhisel lives about a quarter-mile from where the bridge collapse, so he and his wife went to see it on foot, he told CNN.",
    "The PennDOT website says the condition of the deck, or road surface, was rated \"4 - Poor,\" as was the superstructure condition.",
    "\"In Pittsburgh, in Pennsylvania, and across America,\" the lieutenant governor said, \"we cannot afford neglect any longer.",
    "Light snow is expected to continue on and off through Friday afternoon, though not much more accumulation is anticipated.",
    "\"The scariest part was definitely going over the edge because there was a gap and my car left the ground,\" he told CNN.",
    "Peoples Gas spokesperson Barry Kukovich confirmed the company had a gas distribution line on the bridge that collapsed.",
    "In an interview with CNN, Jones, the fire chief, said the bridge was not a concern to officials prior to the collapse.",
    "The collapse also caused a natural gas line in the area to break, Downs said, but the line has since been turned off.",
    "Fire Chief Darryl Jones characterized the injuries as \"minor,\" and said three people were transported from the scene.",
    "\"When we got to the site of the collapse, the roaring sound and the smell of the broken gas line were overwhelming.\"",
    "Only minor injuries have been reported, including the driver of an articulated bus and two passengers, Downs said.",
    "Crews also used what he called a \"daisy chain\" where they linked hands to reach the victims and pull them out.",
    "\"There's 43,000 nationwide,\" he said, referring to the number of bridges in poor condition across the country.",
    "\"It's incredible to think that nobody was more seriously injured and quite frankly killed,\" Fitzgerald said.",
    "In Friday morning's news conference, Mayor Gainey said the bridge had last been inspected in September 2021.",
    "Teams are still performing reconnaissance to ensure no one was under the bridge when it collapsed, he said.",
    "Tom Wolf and Mayor Gainey, White House principal deputy press secretary Karine Jean-Pierre told reporters.",
    "O'Connor said some \"rehab\" had been done to the bridge a couple years ago, including repaving the surface.",
    "The 447-foot bridge was built in 1970 and composed of a steel rigid frame, according to the website.",
    "There is no evidence at this time there was a gas explosion prior to the collapse, Kukovich said.",
    "President Biden visited the site of the collapse Friday afternoon as he proceeded with his trip.",
    "He described the gas line as a distribution line but said it was not a high pressure gas line.",
    "Then he climbed up the hill to try and stop other drivers from driving into the debris.",
    "Once the mapping is done, authorities will remove vehicles and debris from the scene.",
    "He and other drivers were unable to stop in time after the bridge gave way, he said.",
    "\"We got to fix these things because one of these days our luck is going to run out.\"",
    "He called it a \"major, major inconvenience\" for the people who rely on the bridge.",
    "Jeremy Habowski told CNN he feels lucky to be alive after surviving the collapse.",
    "\"I've been coming to Pittsburgh a long time, and as a former Pennsylvanian ...",
    "First responders used ropes to rappel down to get to the victims, Jones said.",
    "John Fetterman called the bridge a \"vital artery\" in the Pittsburgh area.",
    "His car and others are now sitting on top of what remains of the bridge.",
    "\"It goes under the roadway and then it goes under the bridge,\" he said.",
    "Bridges rated 5 or 6 are classified as Fair,\" the website explains.",
    "Just the thought of the bridge collapsing is a very scary prospect.",
    "Once things settled, Habowski checked on another driver, he said.",
    "\"My goodness, all these ambulances and fire trucks and what not.",
    "The bridge crosses Frick Park, one of the city's largest parks.",
    "Prior to his arrival, the President called Pennsylvania Gov.",
    "The cause of the collapse is under investigation, he said.",
    "Four vehicles were on the bridge when it fell, Jones said.",
    "In an interview on CNN's \"New Day,\" Pennsylvania Lt. Gov.",
    "The substructure condition was rated \"6 - Satisfactory.\"",
    "None of the injuries were life-threatening, he said.",
    "\"But again, we are the City of Bridges.",
    "\"We didn't hear it collapse,\" he said.",
    "I cross that bridge all the time.\"",
    "\"It's very frightening,\" she said.",
    "It's time to rebuild this nation.\"",
    "\"And we're sending the money.\"",
    "ET."
  ]
}