{
  "id": 3265,
  "mediaId": 2674,
  "date": "2022-01-28",
  "headline": "Bridge collapses ahead of Biden infrastructure visit, 10 hurt",
  "image": "https://cdni.russiatoday.com/files/2022.01/article/61f40870203027129c62f01d.jpg",
  "link": "https://www.rt.com/news/547665-bridge-collapses-ahead-visit-biden/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "mediaOutlet": "Russia Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "On Friday morning, a snow-covered bridge in Pittsburgh, Pennsylvania collapsed just hours before President Joe Biden was due in the city to discuss his infrastructure plan for the US.",
    "via Jeremy Habowski / @KDKApic.twitter.com/lOdRPq0XC6\n— Parker Branton (@ParkerBranton) January 28, 2022\nThe Forbes Ave bridge over #frickpark in #pittsburgh collapsed at about 6am.",
    "Avoid the area #pittsburghbridgecollapsepic.twitter.com/ykkE4YjiiX\n— Greg Barnhisel (@gbarnhisel) January 28, 2022\nThe cause of the collapse is under investigation.",
    "The bridge fell some 60 feet onto a walking trail below, providing emergency workers with an easy path to access those in need of rescue, Pennsylvania Lt. Gov.",
    "“The President is grateful to the first responders who rushed to assist the drivers who were on the bridge at the time,” the statement reads.",
    "Authorities noted that three or four vehicles, including a bus, were on the bridge, which spans a creek in Frick Park, when it caved in.",
    "Ten people suffered non-critical injuries when the bridge fell, with three being transferred to local hospitals.",
    "The president, who was due to visit Pittsburgh today, is aware of the collapse, the White House said.",
    "Images from the scene appear to show a bus teetering on the edge of the fallen bridge.",
    "No injuries reported, public safety crews reporting a strong gas smell in the area.",
    "Reports suggested that there was a strong smell of gas in the area.",
    "Officials said only two people were onboard the bus at the time.",
    "Police later confirmed that gas lines had been cut.",
    "#BREAKING — Bridge collapse near Pittsburgh.",
    "He intends to undertake his trip as planned.",
    "Several vehicles and a bus on the bridge.",
    "You can see several cars down below.",
    "Strong smell of natural gas.",
    "No injuries reported yet.",
    "John Fetterman told CNN."
  ]
}