{
  "id": 3468,
  "mediaId": 6571,
  "date": "2022-01-28",
  "headline": "President Biden Will Proceed With Infrastructure-Focused Trip To Pittsburgh Following Frick Park Bridge Collapse",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/01/28/e51c830f-9a3b-4a49-bd54-eaa8e5e39965/thumbnail/1200x630/6841fdc6be5f951ac65ad508ff7ec9ac/frick-park-bridge-collapse.png",
  "link": "https://www.cbsnews.com/pittsburgh/news/president-joe-biden-pittsburgh-visit-infrastructure-frick-park-bridge-collapse/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "His talking points for the trip are to include \"strengthening the nation's supply chains, revitalizing manufacturing and creating union jobs through the Bipartisan Infrastructure Law,\" according to a White House press release.",
    "\"This collapse is just the latest in a long line of preventable, man-made disasters that prove what so many of us in Pennsylvania and around the country have been saying for years: Our infrastructure is failing our people.",
    "White House Press Secretary Jen Psaki said in a tweet, \"The President will proceed with [the] trip planned for today and will stay in touch with officials on the ground about additional assistance we can provide.\"",
    "By: KDKA-TV News Staff\nPITTSBURGH (KDKA) -- President Joe Biden's planned visit to Pittsburgh is still on following the Forbes Avenue bridge collapse in Frick Park early this morning.",
    "The President will proceed with trip planned for today and will stay in touch with officials on the ground about additional assistance we can provide.",
    "— Jen Psaki (@PressSec) January 28, 2022\nSources say it is a \"possibility\" that President Biden will visit the collapse site during his visit to town.",
    "But, with him coming today, to talk about this infrastructure bill, to discuss why this funding is so important, today is significant to that.\"",
    "— Secretary Pete Buttigieg (@SecretaryPete) January 28, 2022\nThe Fern Hollow Bridge collapsed around 7 a.m. at Forbes and Braddock Avenues.",
    "U.S. Secretary of Transportation Pete Buttigieg is also monitoring the developments following the bridge collapse, he said on Twitter.",
    "We need to make use of the legislation President Biden ushered in, rebuild our roads and bridges, and fix our faulty infrastructure.",
    "Too often, DC politics can feel like insider baseball—and Pennsylvanians are left wondering how abstract legislation helps them.",
    "\"This Bipartisan Infrastructure Law is critically to Southwest Pennsylvania and the City of Pittsburgh,\" Mayor Gainey said.",
    "Our roads and bridges, which are supposed to connect us and bring us together, are increasingly putting us in danger.",
    "\"Closely monitoring the situation at Frick Park Bridge in Pittsburgh, and grateful for the first responders on scene.",
    "Closely monitoring the situation at Frick Park Bridge in Pittsburgh, and grateful for the first responders on scene.",
    "As a result of Biden's infrastructure bill, the state is now getting $1.6 billion to repair bridges like this one.",
    "@POTUS is grateful to the first responders who rushed to assist the drivers who were on the bridge at the time.",
    "\"That's why infrastructure bills like the one President Biden signed into law last year are so important.",
    "Pittsburgh Mayor Ed Gainey said the bridge over Hot Dog Dam Dog Park was inspected just last September.",
    "In Pittsburgh, in Pennsylvania, and across America, we cannot afford neglect any longer.",
    "Our Department is in touch with @PennDOTNews and local authorities to offer our support.",
    "Our Department is in touch with @PennDOTNews and local authorities to offer our support.",
    "The president signed the $1.2 trillion infrastructure bill into law in November.",
    "Thank you @POTUS for your support as we address the Fern Hollow Bridge collapse.",
    "John Fetterman has released this statement focusing on the Infrastructure Law.",
    "pic.twitter.com/NFBIJwEDl1\n— Ed Gainey (@gainey_ed) January 28, 2022\nLt. Gov.",
    "The Bipartisan Infrastructure Law was number one his agenda for the visit.",
    "We're finding out now when the last inspection was and everything.",
    "President Biden's visit to the city was announced on Monday.",
    "\"We know we have bridges that we need to take care of.",
    "Gainey has spoken with President Biden by phone call.",
    "I just got off the phone with President Biden.",
    "In:\nPittsburgh Bridge Collapse\nBridge Collapse",
    "\"Now more than ever, we need to get to work.",
    "It's time to rebuild this nation.\"",
    "I look forward to seeing you soon.",
    "@USDOT stands ready to assist.\"",
    "@USDOT stands ready to assist.",
    "But here, the answer is clear."
  ]
}