{
  "id": 3823,
  "mediaId": 2649,
  "date": "2022-01-18",
  "headline": "A look at the big money in some of the hottest Senate races of 2022",
  "image": "https://cdn1.opensecrets.org/news/wp-content/uploads/2021/10/21143612/warnock-e1634841392562.jpg",
  "link": "https://www.opensecrets.org/news/2022/01/a-look-at-the-big-money-in-some-of-the-hottest-senate-races-of-2022",
  "mediaOutlet": "opensecrets.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Huggins",
  "authorUrl": "https://www.opensecrets.org/news/author/khugginscrp-org/",
  "termIds": [
    0
  ],
  "sentences": [
    "Nevada\nNevada is another state labeled a toss-up, though incumbent Sen. Catherine Cortez Masto (D-Nev.) has a significant leg up over her Republican challengers in terms of fundraising with $14.1 million raised and $8.3 million cash on hand at the end of September.",
    "Vance, a venture capitalist and author of the popular book “Hillbilly Elegy,” has raised around $1 million and garnered significant outside support with billionaire tech investor Peter Thiel giving $10 million to pro-Vance super PAC Protect Ohio Values.",
    "Arizona\nAnother midterm race that will be key in determining whether the Senate flips back into Republican control is in Arizona, where Sen. Mark Kelly (D) is fighting to hold onto his job after flipping the seat blue during a special election in 2020.",
    "Pennsylvania\nAnother race deemed a toss-up by the Cook Political Report is in Pennsylvania, where the upcoming retirement of Sen. Pat Toomey (R-Pa.) has left a vacancy that both Democrats and Republicans are fiercely vying for.",
    "Walker’s opponents in the Republican primary include military veteran Latham Saddler, who has raised $2.5 million, as well as Gary Black and Kelvin King, who have raised about $1.3 million and $1 million respectively.",
    "All of these seats are rated by Cook Political Report as either “solid D” or “solid R.” Three of these incumbents do not have a primary challenger, while the other two do not have a well-funded primary challenger.",
    "Read more OpenSecrets News & Analysis: Congressional Elections · Election 2022\nSupport Accountability Journalism\nAt OpenSecrets.org we offer in-depth, money-in-politics stories in the public interest.",
    "The highest fundraiser, state senator Jeff Jackson (D), dropped out of the race, leaving former North Carolina Supreme Court Chief Justice Cheri Beasley as the top fundraiser with $2.8 million.",
    "Georgia\nGeorgia is the most expensive race of the 2022 election by far, with over $50 million raised among seven candidates and more outside spending than in any other 2022 Senate race to date.",
    "Her seat is rated as “lean D” by the Cook Political Report, but recent polls show her with a strong lead over her Republican challenger Don Bolduc, who has so far raised just over $130,000.",
    "The frontrunner among Republican contenders, former NFL player Herschel Walker, has raised more than $3.7 million and already earned the endorsement of former President Donald Trump.",
    "Ohio\nWhile neither Democratic candidate in Ohio has self-financed at all, nearly every Republican candidate who has raised more $10,000 has in part self-financed their campaign.",
    "Jim Lamon, the biggest Republican fundraiser and founder of a solar energy company, has raised $5.4 million — though $5 million of that figure comes from self-financing.",
    "However, Sands and Bartos’ fundraising and self-financing alike could be outdone by fellow Republican contender Mehmet Oz, widely known as television personality “Dr.",
    "Whether you’re reading about 2020 presidential fundraising, conflicts of interest or “dark money” influence, we produce this content with a small, but dedicated team.",
    "Republican Mike Gibbons self-financed the largest amount of any candidate in the race, giving $7.9 million of the roughly $8.6 million his campaign has brought in.",
    "While the race is considered to lean Republican, according to the Cook Political Report, Demings’ campaign has raised about $13.3 million to Rubio’s $19.1 million.",
    "Sen. Raphael Warnock (D-Ga.) was elected alongside Sen. Jon Ossoff (D-Ga.) in a pair of elections last January that were the most expensive in Senate history.",
    "Self-financing is otherwise rampant among the Republicans as they prepare to face off in what is likely to be an extraordinarily competitive primary race.",
    "?campaign manager, Casey Contres, told POLITICO that he will self-fund part of his campaign and is planning to “put significant resources” into the race.",
    "And Jane Timken, the former chair of the Ohio Republican Party, has put $2 million toward her campaign, bringing her total funds raised to $4.8 million.",
    "The one exception is Josh Mandel, the pro-Trump former Ohio treasurer and Marine Corps veteran, who has raised $1.7 million without any self-financing.",
    "Fundraising for the 2022 Senate races is ramping up, with more than a third of the 34 seats up for grabs clocking in over $10 million in contributions.",
    "Every donation we receive from users like you goes directly into promoting high-quality data analysis and investigative journalism that you can trust.",
    "Other cash-full Senate races\nOther races that have more than $10 million in them include South Carolina, New York, Louisiana, Illinois and Washington.",
    "North Carolina\nThe Senate race in North Carolina has brought in $10.7 million in total, comparably less than some of the other hotly contested races.",
    "Like Vance in Ohio, Masters has attracted significant outside support from Peter Thiel, who gave $10 million to pro-Masters super PAC Saving Arizona.",
    "The toss-up state has attracted a field of Democratic contenders, many of whom have brought in hundreds of thousands, and even millions, of dollars.",
    "Kentucky\nKentucky’s race is full of cash, in part because of the challenge Charles Booker (D) has brought against incumbent Sen. Rand Paul (R-Ky.).",
    "Pat McCrory and U.S. Rep. Ted Budd are neck and neck as the top Republican fundraisers, bringing in $2.3 million and $2.1 million respectively.",
    "Four Republican contenders have each raised seven figures in Georgia’s 2022 Senate race as they prepare for a competitive primary election.",
    "Florida\nThe second-most cash flush Senate campaigns can be found in Florida, where candidates have collectively raised about $34 million.",
    "Of all the Republicans who threw their hat in the ring, Timken has so far brought in the most small individual donations of $200 or less.",
    "Booker, a progressive, ran in 2020 to replace Senate Minority Leader Mitch McConnell, but was edged out by moderate Democrat Amy McGrath.",
    "The second seven-figure fundraiser is venture capitalist Blake Masters, who has raised $1.1 million, with about $94,000 self-financed.",
    "Worth mentioning in the Senate race is Arizona Attorney General Mark Brnovich, who will certainly crack $1 million in contributions.",
    "Warnock’s fundraising and spending are in the double digits this election cycle, raising about $42 million and spending $47 million.",
    "Rubio’s 2016 Democratic opponent, former Rep. Patrick Murphy (D-Fla.) raised around $19 million and took about 44.3% of the vote.",
    "However, it has seen the most spending by outside groups excluding party committees of any Senate race, with over $5.7 million.",
    "Collectively, $11.6 million has gone into the Wisconsin Senate race, $7.7 million of which has gone to Democratic candidates.",
    "Republicans Carla Sands and Jeff Bartos, the second and third highest overall fund raisers, both leaned into self-financing.",
    "Of Walker’s opponents, Saddler and King are the only ones to self-finance, contributing $2,900 and $300,000 respectively.",
    "While robust fundraising by no means guarantees a win, historical trends show that the strongest fundraiser usually wins.",
    "In 2021, Rep. Val Demings (D-Fla.) launched a well-funded challenge for the seat held by incumbent Sen. Marco Rubio (R).",
    "Let’s dive into which Senate races this year have attracted the most money — often an indication of a competitive race.",
    "Several Republicans have jumped into the race to challenge Kelly, two of whom have hit seven-figure fundraising totals.",
    "Just over $3 million of Sands’ $3.5 million is self-financed, while just under $1.3 million of Bartos’ $2.9 million is.",
    "Outside groups including super PACs are throwing their weight – and their cash – into the more hotly contested races.",
    "In the 2020 elections for Senate, 71.4% of those who won were the biggest fundraiser; in 2018, that figure was 82.9%.",
    "Rob Portman (R-Ohio) announced that he would not seek reelection, more than 10 Republicans declared their candidacy.",
    "Wisconsin\nWisconsin Sen. Ron Johnson (R) announced last week that he will seek reelection in the battleground state.",
    "Demings faces multiple opponents in the Democratic primary, though none have surpassed $1 million in fundraising.",
    "New Hampshire\nNew Hampshire Sen. Maggie Hassan (D) has raised a similar amount as Cortez Masto ($14.2 million).",
    "Labeled a toss-up by the Cook Political Report, the seat is open due to Sen. Richard Burr (R-N.C.) retiring.",
    "While not competitive, the cash going into these races mark the senators’ strong fundraising capabilities.",
    "Brnovich, who put $5,800 of his own money toward the campaign, raised $996,000 as of the end of September.",
    "Seven candidates — four Democrats and three Republicans — have surpassed $1 million in fundraising.",
    "Similarly, Bernie Moreno gave his campaign $3 million, bringing its total haul to $5.9 million.",
    "However, that figure pales in comparison to the $100 million he raised during the 2020 cycle.",
    "Ohio is one of the most anticipated races of 2022 due to the crowded field it has attracted.",
    "is the second highest Democratic fundraiser but fourth overall, bringing in $2.6 million.",
    "Including outside money, Warnock’s Senate race racked up about $370 million in spending.",
    "John Fetterman (D), who has raked in $9.1 million, mainly from small individual donors.",
    "Warnock won his runoff campaign after raising $125 million, and spending $103 million.",
    "Kelly has the fundraising advantage, having raised $17.5 million this election cycle.",
    "Republican challengers Adam Laxalt and Sam Brown each raised less than $1.5 million.",
    "The race is rated as a “toss-up” by the Cook Political Report.",
    "Oz,” who announced his candidacy at the end of November.",
    "He has raised $1.7 million to Paul’s $12 million.",
    "Budd has self-financed about $275,000.",
    "Leading the pack is Lieutenant Gov.",
    "Former North Carolina Gov.",
    "Rep. Conor Lamb (D-Penn.)",
    "After Sen.",
    "Oz’s ?",
    "J.D."
  ]
}