{
  "id": 4614,
  "mediaId": 8254,
  "date": "2022-04-22",
  "headline": "5 takeaways from Pennsylvania’s Democratic Senate primary debate",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/04/92D6FA981AEC541E10372B308F1D69C5.00_00_15_11.Still001.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/5-takeaways-from-pennsylvanias-democratic-senate-primary-debate/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Meanwhile, Kenyatta hit Fetterman for not attending the last debate, saying, “It’s very rare we get to see John at an event.”\nKenyatta also launched one of the more personal attacks of the evening when the lieutenant governor was asked about a 2013 incident in which Fetterman, while carrying a shotgun, confronted an unarmed Black jogger he suspected was involved in nearby gunfire and detained him until police arrived.",
    "Lamb and Fetterman said they would support extending Title 42, the Trump-era policy that allows for the rapid expulsion of migrants at the border without giving them an opportunity to seek asylum.",
    "“This has been the core of my campaign.”\nLamb called for more background checks on firearms and for funds to be shifted from drug law enforcement to efforts combatting illegal gun distribution.",
    "Candidates split over mask mandates as Philadelphia lifts its own\nThere was also a divide on stage when it came to the issue of whether to implement mask mandates at this stage in the pandemic.",
    "Harrisburg, Pa. (The Hill) — The candidates in Pennsylvania’s Democratic Senate primary race met face-to-face in a one-hour debate hosted by The Hill’s partners at ABC27 News and WPXI.",
    "Kenyatta and Fetterman argued that they would have given Biden a higher grade if it were not for Sen. Joe Manchin (D-W.Va.), who has proven to be a thorn in the administration’s side.",
    "I don’t enjoy it but they did the best they could.”\nNationally, the issue of mask mandates stands to be a big one for Democrats as Republicans seek to tie them to the restrictions.",
    "Candidates address crime as Democrats struggle over issue\nAll three Democrats were asked about rising crime and gun violence as national Democrats struggle to address the issue.",
    "Fetterman also used Manchin to attack Lamb, calling the senator Lamb’s “mentor.” Lamb, in turn, fired back, saying that he supports Biden’s agenda, including Build Back Better.",
    "A WTAJ/Emerson College Polling/The Hill poll released in late March found that 50.4% of Pennsylvania voters do not approve of the job Biden has done so far in his first term.",
    "A Franklin-Marshall poll released earlier this month showed Fetterman with 41 percent support, while Lamb and Kenyatta trailed at 17 percent and four percent, respectively.",
    "On Wednesday, the Justice Department announced it would appeal a federal judge’s ruling that struck down the Biden administration’s mask mandate on public transportation.",
    "Lamb, who has sought to mold himself in Biden’s centrist mold, cited a campaign story with the president in which he talked about getting to know voters on the trail.",
    "On the issue of the war in Ukraine, Fetterman and Kenyatta both said they did not see a situation in which it would be appropriate to send U.S. troops into Ukraine.",
    "The hour-long forum saw sparks fly over an array of issues including the economy, crime, the war in Ukraine, fracking and mask mandates ahead of the May 17 primary.",
    "When pressed by Kenyatta to apologize, Fetterman said “that never happened.”\nFetterman’s campaign brushed off the attacks in a post-debate interview with The Hill.",
    "The Real Clear Politics polling average shows Biden’s average approval rating at 41 percent in national polling, while his disapproval sits at 53 percent.",
    "“At this point, we have to live with this virus and I don’t believe that going backward with a mask mandate or closures is appropriate,” Fetterman said.",
    "Candidates split on hot button issues\nThe candidates were split on a number of contentious issues, including health care, crime and immigration.",
    "During the debate, Philadelphia announced that it was ending its indoor mask mandate only days after announcing the measure would be reinstated.",
    "Candidates embrace Biden despite dismal polls\nAll three candidates embraced President Biden despite his low approval and favorability ratings.",
    "“What’s heartbreaking for me is I can go home tonight to North Philly and have another person gunned down in my neighborhood,” Kenyatta said.",
    "The candidates’ embrace of the president challenges speculation that Democrats running in tough races will distance themselves from Biden.",
    "Lamb landed the first attack on Fetterman, criticizing him for not being specific enough about which income brackets should see tax hikes.",
    "The candidates homed in on gun control, in particular, a strategy national Democrats have touted as an effort to combat violent crime.",
    "Fetterman said he did not agree with Philadelphia reimposing its mask mandate, but said the city has a right to do so as a locality.",
    "John Fetterman (D), predictably faced a barrage of attacks from Rep. Conor Lamb (D-Pa.) and state Rep. Malcolm Kenyatta (D).",
    "“For somebody who has cut an image as such a tough guy, you’re so afraid of two little words: ‘I’m sorry,’” Kenyatta said.",
    "“I think his opponents were desperate to change the dynamics of the race,” said Fetterman’s senior adviser Rebecca Katz.",
    "But Lamb said an attack on a member of NATO would be the line for him when asked about sending troops to Ukraine.",
    "Kenyatta, who is arguably the most progressive of the candidates, said he also opposed the mandate.",
    "Kenyatta made the issue personal, explaining how crime impacted his own community in Philadelphia.",
    "When asked to give Biden a grade, Fetterman and Lamb gave him a B+, while Kenyatta gave him an A-.",
    "Meanwhile, Fetterman called for an end to the Senate filibuster in an effort to pass gun reform.",
    "The two both said the plan should remain in place until the coronavirus pandemic is over.",
    "“The answer that you know it when you see it is not acceptable for this job,” Lamb said.",
    "Here are five takeaways from Thursday’s Pennsylvania Democratic Senate primary debate.",
    "Another 37 percent said they were either undecided or favored someone else.",
    "Lamb, Kenyatta take aim at Fetterman\nThe frontrunner in the race, Lt. Gov.",
    "Kenyatta, on the other hand, argued that Title 42 should not be extended.",
    "Manchin’s opposition effectively sunk Biden’s Build Back Better agenda.",
    "Fetterman has led the intraparty contest in polling and fundraising.",
    "“I mean it’s their right to do it,” the congressman said.",
    "“Again, I think they’re doing it for the right reason.",
    "Fetterman has denied pointing the shotgun at the man.",
    "However, Lamb said he was in favor of the measure."
  ]
}