{
  "id": 4745,
  "mediaId": 8393,
  "date": "2022-04-21",
  "headline": "Debate night: PA 3 Democrat candidates vying for a U.S. Senate",
  "image": "https://www.pahomepage.com/wp-content/uploads/sites/91/2022/04/snapshot-2022-04-21T180348.784.jpg?w=1280",
  "link": "https://www.pahomepage.com/election/your-local-election-headquarters/debate-night-pa-as-the-three-democrat-candidates-vying-for-a-u-s-senate/",
  "mediaOutlet": "pahomepage.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Mehalshick",
  "authorUrl": "https://www.pahomepage.com/author/andy-mehalshick/",
  "termIds": [
    4080,
    3989,
    2709,
    2751,
    1489,
    1477,
    1126,
    6506
  ],
  "sentences": [
    "Current Pennsylvania Lieutenant Governor John Fetterman, Congressman Conor Lamb, and State Representative Malcolm Kenyatta will debate in Harrisburg with Dr. Dave Sosar a political scientist who says this debate is crucial to all three candidates.",
    "EYEWITNESS NEWS (WBRE/WYOU) — It’s debate night in Pennsylvania as the three democratic candidates for the U.S. Senate seat in Pennsylvania will face off in a statewide broadcast.",
    "I think to talk because it’s in the news and everything else a little bit about where does Pennsylvania stand with of the fracking ideas it’s natural gas holdings,” stated Sosar.",
    "You can watch the debate live tonight on WBRE and WYOU from 8 to 9 pm it will be broadcast live from our sister Nexstar station WHTM in Harrisburg.",
    "Then join us live on WBRE for an analysis of the debate at 9:00 when’ll be speaking with moderator Dennis Owens and local political analysts.",
    "Mr. Lamb is a very good candidate but he is known as a congressional candidate and Mr. Kenyatta is from state representative in Philadelphia.",
    "They are vying for their party’s nomination to win the seat currently held by Republican Pat Toomey who is not running for re-election.",
    "In a so-called flip seat, we spoke to a political scientist who says this debate could be a game-changer for these candidates.",
    "Three candidates will meet face to face tonight to state their positions on the issues facing Pennsylvania.",
    "Dr. Sosar says Fetterman who has a substantial lead in recent polls is for now in the driver’s seat.",
    "Many political analysts say this senate seat can shift the balance of power in Washington.",
    "The other two have to catch up by getting better known,” explained Sosar.",
    "What they will do to help the people of Pennsylvania they need to also.",
    "“Well most important they need to talk about the problem of inflation.",
    "So Mr. Fetterman had the advantage of being known statewide already.",
    "“He’s the one candidate who has won elections statewide.",
    "As for the issues they should focus on?"
  ]
}