{
  "id": 4763,
  "mediaId": 8316,
  "date": "2022-04-19",
  "headline": "Fetterman: 'Workers can always count on me'",
  "image": "https://www.gannett-cdn.com/presto/2022/04/14/NBCC/66da6289-618a-4079-b61d-dca3aa80f3f8-jkf_-_Bobby_Maggio.jpg?crop=2071,1165,x0,y40&width=2071&height=1165&format=pjpg&auto=webp",
  "link": "https://www.buckscountycouriertimes.com/story/opinion/columns/2022/04/19/fetterman-workers-can-always-count-on-me/65350147007/",
  "mediaOutlet": "eveningsun.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Fetterman",
  "authorUrl": "",
  "termIds": [
    3989,
    4905,
    6678
  ],
  "sentences": [
    "This includes making improvements in police training in the areas of de-escalation, implicit bias, and using evidence based police practices; demilitarizing the police force; using civilian review boards to give the community a say in police accountability; providing stronger federal oversight of police departments; and creating a police misconduct database to ensure police officers that have been fired for misconduct cannot simply move to another police department undetected.",
    "When taking on rising gas prices, President Biden was right to release barrels of oil from our Strategic Petroleum Reserve, and we should continue to do this and use American oil, which will help bring prices down at the pump.",
    "We weeded out officers who were not a good fit for our community-service vision, firing officers with a history of complaints against them and hiring officers who were committed to establishing community trust and rapport.",
    "It is important that we make it easier for people to vote, eliminate dark money in politics, increase donor and lobbyist transparency, and knock down the restrictions that marginalize voters, mostly voters of color.",
    "Commutation requests for life sentences have increased 1,200%, pardon requests recommended have increased 96%, and as of February 2022, Governor Wolf has pardoned 256 people with former cannabis convictions.",
    "To reduce our energy costs, we must continue to produce more American energy, invest in programs that assist low income individuals in paying their energy bills, and expand investments in clean energy.",
    "I get frustrated when people, management, or politicians say they support essential workers and union members, but do nothing to back it up in real life as far as benefits or material support.",
    "I have been vocally supportive of legislation in Congress, such as the John Lewis Voting Rights Act, the For the People Act, and the Freedom to Vote Act, which aim to expand voting rights.",
    "In the past few months, I have walked the picket line with over six different groups of striking workers, and I have attended countless rallies in support of workers trying to unionize.",
    "Workers can always count on me to support the PRO Act, a $15 minimum wage, and any policies that dramatically protect, expand, and encourage union membership across this country.",
    "Not only can these investments make renewable energy competitive and lower energy costs for consumers, it will help us fight climate change and create good paying union jobs.",
    "In addition, we need to regulate social media sites that have been the apps of choice for people who spread misinformation about our elections and other issues like COVID-19",
    "John Fetterman, candidate, U.S. Senate (D)\nWhat, if any, reforms to election law would you support to ensure voters have equal access to free, fair, secure elections?",
    "On multiple occasions, I have even asked my campaign email list to donate directly to striking unions’ strike funds, one of the only politicians ever to do so.",
    "Meanwhile, American billionaires have grown $2.1 trillion richer during the pandemic, their collective fortunes skyrocketing by 70%; this is absurd and wrong.",
    "Within two years of taking over as chair, we eliminated the pardon application fee and the number of pardon applications heard by the Board increased by 104%.",
    "When misinformation is paired with unregulated social media, it creates the type of atmosphere that makes events like the January 6th insurrection possible.",
    "As mayor of Braddock, a majority Black town, I implemented a community policing model that improved the relationship between the police and the community.",
    "Even today, our criminal justice system over-incarcerates and overcharges minorities and is largely outdated in its prescription of sentencing.",
    "We also must make proper investments in greener, cleaner technology in America, while making and manufacturing that technology here at home.",
    "I know what unions did for my family, and I will always fight to make sure that they are able to do the same for everyone else.",
    "The union way of life kept my family afloat while I was a kid and he worked nights as a union grocery worker at a ShopRite.",
    "I believe that in addition to familiarizing the police and the community they serve, we can take several actions.",
    "I worked with our chief of police to develop this community policing plan in a way that had community buy-in.",
    "We need to take swift action to back up workers, and I have fought to do so during my years in government.",
    "What duty do elected leaders have to speak truthfully and communicate fact-based information to voters?",
    "We need our elected officials, both Republicans and Democrats, to come together to stop misinformation.",
    "During the past two years alone, these workers have kept our country running amidst a global pandemic.",
    "After implementing this model, we went five and a half years with no homicides due to gun violence.",
    "Elected officials have a duty to the country and their constituents to speak the truth.",
    "I am always proud to stand with workers to protect and expand the union way of life.",
    "Give me an example of when your passion and government service worked hand in hand?",
    "Lying and misleading the public has real-life consequences for the American public.",
    "One of the glaring issues with our criminal justice system is that it lacks parity.",
    "Governor, I chair the Board of Pardons, and I set out to reform the position.",
    "It’s what built this nation, and it must not only be protected but expanded.",
    "What would you do to improve the nation’s criminal justice system?",
    "My passion for supporting organized labor dates back to my father.",
    "I am always proud to stand side-by-side with organized labor.",
    "Congress has the responsibility to be truthful with voters.",
    "Backing organized labor is always one of my top priorities.",
    "I will take my support for workers as far as possible.",
    "What are the bounds of political rhetoric?",
    "What will you do to address energy costs?",
    "Political rhetoric should be fact based.",
    "The union way of life is sacred.",
    "What makes you tick?",
    "As Lt."
  ]
}