{
  "id": 4829,
  "mediaId": 2699,
  "date": "2022-04-19",
  "headline": "Progressives Go From Left Wing to Center Stage in Critical Senate Races",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1650341205/220418-progressives-left-tease-01_buut8f",
  "link": "https://www.thedailybeast.com/progressives-go-from-left-wing-to-center-stage-in-critical-senate-races?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ursula Perano",
  "authorUrl": "https://www.thedailybeast.com/author/ursula-perano",
  "termIds": [
    4846,
    5365,
    4453,
    4080,
    392,
    249,
    1489,
    1477,
    6729
  ],
  "sentences": [
    "Though the Senate hopeful says he’s “never been intimidated by that.”\nPolling aside, if Booker and Barnes are successful in their primary contests, they will face incumbents with vast war chests: Paul added more than $3 million to his in the first quarter and Johnson more than $7 million.",
    "“No matter where they fall on the political spectrum, working and middle class people across this state are all feeling the effects of the decline in manufacturing, attacks on unions, and an economy that’s only working for the wealthy.”\nAnd off to the east, Pennsylvania Lieutenant Gov.",
    "While the primary isn’t until Aug. 9, Barnes is the “clear frontrunner for the nomination,” Wisconsin Democratic strategist Joe Zepecki told The Daily Beast, adding that Barnes’ time in state office has firmly boosted voters’ familiarity with him as a candidate adds to his appeal.",
    "Booker’s facing an uphill battle in his likely contest against Sen. Rand Paul (R), who’s well-funded and has shown a steady lead among voters, with one January poll showing 55 percent of Kentucky voters in support of Paul and 39 percent supporting Booker.",
    "Groups like the Progressive Change Campaign Committee and the Working Families Party endorsed him quickly after his 2021 launch—but even some moderates have joined on, like House Majority Whip Jim Clyburn (SC), a well-known Democratic kingmaker.",
    "While the left-most wing of the Democratic Party has seen most of their wins in localized races like those for the House, multiple progressive candidates this year are increasingly likely to win their party nominations in key Senate races.",
    "Wisconsin is one of Democrats’ top targets this year, with the nominee virtually guaranteed to face off against incumbent Sen. Ron Johnson (R), whose wild COVID antics and far-right takes have left him vulnerable in the swing state.",
    "Two years ago, former state Rep. Charles Booker’s progressive bid for Senate came to an end as voters in Kentucky’s Democratic primary narrowly opted to nominate moderate Amy McGrath instead, who later lost the general election.",
    "Just weeks ahead of the May 17 primary election, he’s poised to secure the nomination with little in-party opposition among the small field of contenders, even as his support for policies like Medicare for All remains intact.",
    "While the November elections could still be an uphill battle for some, the momentum in primaries alone could be a sign of voters seeing progressive politicians as less on the fringe of their party bases than in years past.",
    "But Zepecki, who’s not affiliated with any candidate in the primary, argued the “playbook exists for progressives to run and win statewide” in Wisconsin, pointing to Democratic Sen. Tammy Baldwin’s previous wins.",
    "But having a progressive brand or policies as a statewide candidate still comes with liabilities, as some moderate Democratic candidates vying for the nomination are more than willing to point out.",
    "And from the start of Barnes’ candidacy, some suggested his progressive brand was bound for trouble with suburban and rural voters, which he’d certainly need in a swing-state like Wisconsin.",
    "They’re focused on kitchen-table issues—and avoiding bashing the existing Democratic Party or Democratic lawmakers, which progressives running for House seats haven’t always shied away from.",
    "Fetterman has faced attacks from Lamb’s super PAC which incorrectly called Fetterman a “self-proclaimed socialist” in an ad that was later retracted from at least one station.",
    "“We’re building a broad-based campaign that meets people where they are, and focuses on what we share rather than what divides us,” Barnes told The Daily Beast in a statement.",
    "Pennsylvania is another high-priority state for Democrats in 2022, with an open primary on both sides of the aisle as Republican Sen. Pat Toomey is opting to retire.",
    "“They couldn’t care less when it comes down to it that she’s a liberal from Madison, because she’s delivering on things that matter to this state,” Zepecki added.",
    "John Fetterman, who describes himself as a populist but boasts progressives policies, is also leading his primary matchup against moderate Rep. Conor Lamb.",
    "Fetterman has been in a commanding lead in the primary for months—though the Lamb campaign continues to insist the race is wide open.",
    "Democrats worry that the attacks will come back to haunt them in the general and Republicans are already sharpening the knives.",
    "By the end of March, Fetterman had $3.9 million cash-on-hand to be used in the primary, while Lamb had $1.2 million.",
    "Whether that rings true in November—or whether or not candidates can manage to emulate that idea—is yet to be seen.",
    "Baldwin has identified as a progressive in the past and was the first openly gay person elected to the Senate.",
    "In Wisconsin, Lieutenant Governor Mandela Barnes is among those candidates heading toward a primary win.",
    "“Getting 55 percent here is sort of the equivalent of getting 70 percent somewhere else,” Zepecki said.",
    "From public behaviors alone, the trio seems to have a common trend of progressive pragmatism.",
    "Booker raised about $844,000 in the first quarter of 2022 and Barnes raised $1.7 million.",
    "But this year, Booker’s prospects in the primary are different.",
    "It will be a pricey contest and isn’t likely to be pretty.",
    "“I’m proud to prove the doubters wrong,” he said.",
    "Booker, for one, said he’s up for the challenge.",
    "His dominance has been locked-in for months.",
    "And he’s not alone in that sort of triumph.",
    "The primary is also slated for May 17."
  ]
}