{
  "id": 4871,
  "mediaId": 8404,
  "date": "2022-04-21",
  "headline": "Fetterman fends off attacks in Pennsylvania Democratic U.S. Senate Debate",
  "image": "https://phl17.com/wp-content/uploads/sites/7/2022/04/Kenyatta-Fetterman-Braddock-e1650594925803-1.jpg?w=1280",
  "link": "https://phl17.com/2022-united-states-senate-election-in-pennsylvania/pennsylvania-senate-race-debate-democratic-candidates-spar-for-first-time/",
  "mediaOutlet": "phl17.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lauren Rude",
  "authorUrl": "https://www.abc27.com/?post_type=profile&p=846928",
  "termIds": [
    0
  ],
  "sentences": [
    "After Lamb says he recently voted for a bill to decriminalize it, but to take on the legalization in a slow and controlled way, Kenyatta responded with, “The congressman must have gotten a contact high down there in Washington because he used to be against this.” Watch more from the conversation below:\nThe U.S. Senate Debate streamed on the following websites:\nYou can catch up on all that went down on Twitter by searching the #PASen and watch our post-debate coverage immediately after both on-air and online.",
    "“You confronted an unarmed Black man that you believed may have been involved in a shooting and detained him with a gun until police arrived, if presented with the same situation, would you do anything differently today?” Watch his response and the debate that followed below:\n8:34 p.m.: When asked to raise their hand if they are in favor of extending Title 42, Lamb and Fettermand raised their hands but Kenyatta did not.",
    "He is being supported by a super PAC, which “laid the groundwork for attacks over electability, effectively presenting Fetterman as just as tied to the left as Sanders or the Squad and painting Lamb as a more palatable alternative.”\nDemocrats who support Lamb see such attacks as their best shot of beating Fetterman as he changes the tone of the race.",
    "Fetterman responded by saying to a crowd of party voters in State College last week that he would only run a “positive campaign.”\nAnother highly discussed criticism of Fetterman is over a 2013 incident when, shotgun in hand, he confronted someone who he thought was involved with gunfire in Braddock.",
    "On his campaign website, Kenyatta says he supports implementing reform in the criminal justice system, funding schools equally and expanding programs within school systems, reducing our dependence on fossil fuels, and legalizing the recreational use of marijuana in order to curb mass incarceration.",
    "Plus, catch up on the latest with each candidate who attended:\nJohn Fetterman, Pennsylvania Lieutenant Governor\nWhile many of the polls recently conducted did not reveal a clear leader in the Republican primary, there has been a consistent frontrunner for the Democratic party — Pennsylvania’s Lt.",
    "While Kenyatta has received the least among the three candidates debating Thursday night, he has received both donations and verbal support from multiple celebrities including Halle Berry, Amy Schumer, Robin Thicke Tasha Smith, and Wanda Skyes, during his campaign run.",
    "In an even more recent poll conducted by Franklin & Marshall, while nearly half the 785 registered voters surveyed between March 30 and April 10 said they will vote for a Republican congressional candidate, Fetterman still led the Democratic party.",
    "On his campaign website, Fetterman says that the criminal justice system needs a significant overhaul, plus, he supports legalizing the recreational use of marijuana, a $15 minimum wage in the state, and that health care is a fundamental right.",
    "On his campaign website, Lamb says he supports raising the minimum wage to $15, protecting and strengthening the Affordable Care Act, recommitting to public education, and reinventing clemency and the pardon process in Pennsylvania.",
    "Conor Lamb, Western Pennsylvania Congressman (D-17)\nThe only other candidate to receive a double-digit percentage of voters in the Nexstar/Emerson College Polling/The Hill poll is Western Pennsylvania Congressman Lamb (D-17).",
    "The U.S. Senate debate aired and live-streamed in 10 markets across Pennsylvania, New York, Ohio, and Maryland, reaching 9.8 million TV and streaming households in every county of the Keystone State.",
    "As reported by the Associated Press last week, Fetterman has been on the defensive in recent weeks after Lamb, Kenyatta, and a super PAC supporting Lamb accused Fetterman of being extreme.",
    "A Nexstar/Emerson College Polling/The Hill poll conducted from March 26 to 28, interviewing 508 Democrats, showed Fetterman receiving 33.4%, a significant lead over the other candidates.",
    "Watch the full debate below:\nWHTM abc27 News anchor and Capitol Bureau Reporter Dennis Owens and WPXI Anchor Lisa Sylvester co-moderated the debate from the abc27 studio in Harrisburg.",
    "Another high point in Kenyatta’s campaign: he was the first to receive the required number of signatures just three days after the petitioning window opened for the Senate candidates.",
    "Watch their individual statements on the topic below:\n8:44 p.m.: Owens asked the candidates about the legalization of recreational marijuana and whether or not they support it.",
    "Malcolm Kenyatta, Philadelphia State Representative (D-181)\nComing in third in both of the previously mentioned polls is State Representative Malcolm Kenyatta (D-181).",
    "(WHTM) – Democratic Party candidates for Pennsylvania’s United States Senate seat participated in a one-hour multi-market debate on Thursday, April 21 at 8 p.m.",
    "As previously reported by The Hill, analysts believed Fetterman was pulling ahead in the nominating contest before either poll was conducted.",
    "According to Q1 financial filings with the Federal Election Commission, Fetterman raised $3,1000,176.86 in the first three months of 2022.",
    "The State Representative from Philadelphia received the third-highest Q1 contributions in the first three months of 2022 with $301,173.62.",
    "In a breakdown by age, Fetterman led in all age ranges and a significant number of white voters supported him over any other candidate.",
    "Governor John Fetterman, PA 17 US House Representative Conor Lamb, and State Representative for the 181st District Malcolm Kenyatta.",
    "A debate between the Republican Senate candidates will be held on April 25 and the candidates for Governor will debate on April 27.",
    "A month ago, and prior to either poll, an Associated Press article noted that Lamb is a rising star among moderates in the House.",
    "Live Updates:\n8:20 p.m.: On the topic of electability, abc27’s Owens asked Fetterman about an incident in Braddock back in 2013.",
    "The gap between Fetterman and Kenyatta did shrink, however, in African-American voters with Fetterman leading only by 1.2% more.",
    "In the Democratic party, Lamb also has the second most Q1 contributions in the first three months of 2022, with $1,759,096.46.",
    "He collected signatures from seven different counties to be the first official candidate added to the May 17 primary ballot.",
    "Additionally, all radio stations throughout the commonwealth have been provided free access regardless of their market.",
    "The percentage of voters committed to voting for Lamb in the primary increased in the Franklin & Marshall poll.",
    "In the Nexstar/Emerson College Polling/The Hill poll Kenyatta received 7.6% of the 508 Democratic voters.",
    "Plus, he leads all Senate candidates in either party with $15,098,281.49 raised since his campaign began.",
    "To learn more about the candidates running for Pennsylvania’s open United States Senate seat, click here.",
    "Financially, Fetterman also leads the Democratic field when it comes to total campaign fundraising.",
    "He received the second-highest number of voters, behind Fetterman, with 10% of the 508 Democrats.",
    "Among all candidates in either party, he has raised the fourth-highest amount with $5,740,022.26.",
    "The percentage of voters committed to Kenyatta dropped, however, in the Franklin & Marshall poll.",
    "He also has the seventh-highest total raised among candidates in both parties with $1,844,861.88.",
    "Senator from Pennsylvania is scheduled to take place on May 17.",
    "Again coming in behind Fetterman, Lamb received 17% of voters.",
    "To watch the full debate, click on the video player above.",
    "Lamb and Kenyatta have raised the issue more than once.",
    "Candidates who attended include Pennsylvania Lt.",
    "Catch up on key moments from the debate below.",
    "His advantage increased to 41% of voters.",
    "Voters must register to vote by May 2.",
    "He received 4% of the voters.",
    "The primary election for U.S.",
    "Governor Fetterman."
  ]
}