{
  "id": 4888,
  "mediaId": 2607,
  "date": "2022-04-21",
  "headline": "At GOP forum, opponents lament absence of ‘no-show Joe’",
  "image": "",
  "link": "https://lasvegassun.com//news/2022/apr/21/at-gop-gubernatorial-forum-opponents-lament-absenc/",
  "mediaOutlet": "Las Vegas Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessica Hill",
  "authorUrl": "https://lasvegassun.com/staff/jessica-hill/",
  "termIds": [
    2138,
    3896,
    3920,
    3486,
    1126,
    6553,
    6460,
    6431,
    6300
  ],
  "sentences": [
    "Damore said that since Donald Trump’s emergence in the political arena prior to his winning the 2016 presidential election, there had been a concerted effort among some Republicans to “undermine political norms and delegitimize bipartisan institutions and processes that for decades helped to hold the political system together.”\nIn one of North Carolina’s congressional races, for instance, Republican frontrunner Rep. Ted Budd has avoided the debate stage altogether.",
    "Gilbert called him “No-Show Joe.”\nOn a conservative radio show on April 11, Heller said, “We can’t get Lombardo to come to these events and to talk about the issues, and what he’s trying to do is avoid us asking him questions about abortion, asking him questions about guns, asking him questions about crime statistics.”\nThe Democratic Victory Press, an organization aiming to put Democrats in office, also criticized the sheriff.",
    "The Lombardo campaign did not return multiple calls and emails requesting a comment, although his campaign did send a statement to other media outlets saying Lombardo has always been “one of the most accessible elected officials in Nevada.”\n“Our campaign has always said that we’d evaluate every debate invitation after filing,” Lombardo campaign spokesperson Elizabeth Ray said in the statement.",
    "“Instead of giving Nevadans clear stances on the topics that matter most, he’s planning to buy this race with TV ads paid for by dark money interests, leaving voters with far too many questions about his plans for our state.”\nSimon said at the forum that voters needed to know who was funding candidates’ campaigns.",
    "By being selective about which events he attends, Lombardo is trusting that his campaign ads and website — which detail his priorities of election integrity, relaxing gun laws and tougher stance on illegal immigration, including banning so-called sanctuary cities in Nevada — will do most of the talking for him.",
    "In a statement, RNC Chairwoman Ronna McDaniel called the Commission on Presidential Debates biased, saying the organization had not enacted reforms to ensure fair debates, like hosting debates before voting begins and selecting moderators who have never worked for the candidates on the debate stage.",
    "He is also scheduled to attend a town hall organized by the Southern Hills Republican Women with other GOP candidates on Tuesday, but so far there is no word of his plans to attend a debate in which opponents will have the opportunity to engage with him.",
    "“Debates are an important part of the democratic process,” McDaniel said in the statement, “and the RNC is committed to free and fair debates.”\nVoters who attend the forums and listen to debates can be swayed by the candidates who show.",
    "After a GOP gubernatorial debate in February at the DragonRidge Country Club hosted by the Clark County Republican Party, Gilbert and Nohra gained support from the attendees while Lombardo, who was a no-show, lost support.",
    "Clark County Sheriff Joe Lombardo, who is believed to be the primary favorite and has out-fundraised more than a dozen candidates in the race, did not go to the forum that drew an audience of about 100 or so attendees.",
    "The downsides of participating in primary debates and forums include being boxed in by ideological or issue-oriented candidates and taking a position that may be difficult to walk back down the road, he said.",
    "Forums and debates give voters the opportunity to learn about where the candidate stands on issues, how they handle pressure from opponents and how they answer questions for which they are not prepared.",
    "Lombardo’s campaign previously said he would not attend forums or debates until after the March 18 candidate filing deadline, and he did attend a forum last month held by the Keystone Corporation.",
    "At a GOP gubernatorial forum Wednesday at the Republican Women of Las Vegas luncheon, candidates discussed how they’d fix education, their plans to improve the economy and run the state.",
    "Other challengers — former U.S. Sen. Dean Heller, North Las Vegas Mayor John Lee, Reno attorney Joey Gilbert, venture capitalist Guy Nohra and surgeon Fred Simon — participated.",
    "The Republican National Committee last week withdrew its participation in the Commission on Presidential Debates, which organizes general-election presidential debates.",
    "Lombardo raised $825,469 and has $2.9 million on hand in the first quarter of 2022, according to the latest Federal Election Commission campaign finance reports.",
    "“Lombardo has taken both sides on just about every issue and he knows he’ll be held accountable if he takes the debate stage,” said spokesperson Mallory Payne.",
    "Former football star Herschel Walker, who’s running for U.S. Senate in Georgia, has also said that he would not debate any of his Republican primary opponents.",
    "Lombardo is following a “tried and true frontrunner strategy,” said David Damore, professor and chair of the department of political science at UNLV.",
    "His donors, along with some of his opponents, include construction companies, casino owners, car dealers and medical care facilities.",
    "Brad Little announced last week that he would not debate his fellow Republican candidates going into the primary election.",
    "Lombardo has been criticized by both Republicans and Democrats for his stances and for not showing up at the debates.",
    "A post-event poll of attendees had Lombardo lose 3% of the support and had Gilbert gain 3% of those attending.",
    "But there aren’t nearly as many Democrats as there are Republicans who are skipping the debate stage.",
    "Not even the presidential debates, apparently, will be immune to no-shows from the Grand Old Party.",
    "John Fetterman in Pennsylvania skipped the first Democratic Senate debate this month, for instance.",
    "At the forum Wednesday, Lee pulled up an empty chair and said that’s where Lombardo should be.",
    "“As long as he is ahead he will keep the rest of the field at arm’s distance,” Damore said.",
    "Damore added that those downsides outweighed any perceived benefits.",
    "“You need to know where they get their money from,” Simon said.",
    "Except one of the major candidates was missing — again.",
    "Democrats are not entirely blameless.",
    "“Who does their allegiance go to?”",
    "In Idaho, Gov.",
    "Lt. Gov."
  ]
}