{
  "id": 5080,
  "mediaId": 6526,
  "date": "2022-04-22",
  "headline": "Fetterman defends platform, 2013 Braddock incident in fiery Democratic U.S. Senate debate",
  "image": "https://www.mcall.com/resizer/cRrtuG6eYyvcM-aO3pZTM9XiJG0=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/MHAWI6YPPVEDNBMCPV53PIR34E.jpg",
  "link": "https://www.mcall.com/news/elections/mc-nws-democrat-senate-debate-20220422-wb2yjvpmurhtjiuckh4v7lzwua-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julian Routh",
  "authorUrl": "",
  "termIds": [
    3989,
    4080,
    4081,
    1489,
    1126,
    392,
    6678,
    6208,
    6001,
    6506
  ],
  "sentences": [
    "Lamb, on if he’s too moderate, said he’s beaten Trump-backed Republicans in three districts in high-stakes political atmospheres and has the record to back it up in Washington, where he’s voted to raise the minimum wage to $15 an hour and lower\nAnd Kenyatta, asked why his hometown party endorsed Lamb and said he may not have the money to win a general election, said if this race was about money, Republican Dave McCormick would already have it locked up.",
    "Kenyatta said the U.S. needs to get to Medicare for All eventually, but that it won’t be like the “flick of a light switch.” He said he supports a public option as a way to “get us a lot closer to getting more people covered who aren’t covered right now.” Like his two opponents, he also called for allowing Medicare to negotiate drug prices.",
    "In the televised, multimarket debate, Fetterman, the front-runner in recent polling, was mostly on the defense throughout the hourlong affair, defending his economic platform, his progressive bona fides and the actions he took in a 2013 incident in Braddock that has emerged as one of the biggest criticisms of his character.",
    "Fetterman said he believes health care is a human right and that it should be accessible to all, and that he would “support whatever path” to get to that place, whether it’s expanding the Affordable Care Act, lowering the Medicare enrollment age or making sure the government is able to negotiate pharmaceutical drug prices.",
    "Lamb countered that oil and gas companies would have no obligation to pass on the savings to consumers, and that the bigger problem would be fixed by increasing the production of oil itself and lowering the cost of health insurance, prescription drugs and housing for American families.",
    "Fetterman’s opponents have warned that Democrats would be in danger of losing this seat if Republicans used the news report of the incident, from when Fetterman, then mayor of Braddock, pursued and pulled a shotgun on a man because he believed he may have been involved in a shooting.",
    "Fetterman said 2022 will be a tough cycle for Democrats and that the party needs a candidate who’s running a 67-county strategy and who has already built an “unparalleled grassroots movement.” He can put up the margins to win in the smaller, more conservative counties, he said.",
    "Saying that his family felt many of the problems that others are feeling today, Kenyatta said the government needs to deal with the root causes of inflation while also holding accountable big oil and gas companies that are making record profits while hiking up gas prices.",
    "He said Braddock had a significant problem with gun violence — a problem that he overcame as mayor, going over five and a half years with no killings — and that he heard a “burst” of gunfire and intercepted the only individual out running from where the gunfire came.",
    "Fetterman, fielding a question about whether he’s too progressive to win statewide, insisted that he can win across all 67 counties and has done so before, becoming the first in Pennsylvanian in history to unseat an incumbent lieutenant governor in a primary.",
    "John Fetterman, U.S. Rep. Conor Lamb and state Rep. Malcolm Kenyatta went toe-to-toe on a debate stage Thursday night in Harrisburg, clashing on who has the best chance to win statewide in one of the most important Democratic races in the country.",
    "When he was asked to name an income level in which he’d start taxing the wealthy, Fetterman said, “You know it when you see it,” and indicated that Americans who are able to afford a super yacht and have stock options in the billions fit the bill.",
    "Deeming inflation a tax on working families that Democrats must aggressively attack, Fetterman said he’d insist that multibillion dollar corporations and the “hyper rich” pay their fair share to offset the suspension to the federal gas tax.",
    "Kenyatta remarked that for someone who has cut an image of being a tough guy, “you’re so afraid of two little words: ‘I’m sorry.’” The American people want their leaders to be self-reflective, he added, looking directly at Fetterman.",
    "And Kenyatta said that “if we want to change the Senate, we have to change the senators,” calling on Democrats to lift up a candidate who understands what it means when government works —- and when it doesn’t work.",
    "Pressed on whether the fact that the man in question appeared to endorse Fetterman in a letter to The Philadelphia Inquirer matters, Lamb and Kenyatta continued to criticize the lieutenant governor for his actions.",
    "Lamb, asked if he supports universal health care, said that while he believes health care is a right, leaders have a responsibility to be specific with people and offer something that’s actually deliverable.",
    "With less than a month to go before the May 17 primary, it marked the first of three times — at least according to the candidates’ schedules — that the trio will get to debate in a traditional setting.",
    "That comment — “You know it when you see it” — was immediately criticized by Fetterman’s two opponents, with Lamb saying that it’s “just not acceptable” for a U.S. senator writing legislation.",
    "One of the most compelling discussions centered around inflation, with Fetterman reiterating that he supports suspending the federal gas tax and Lamb and Kenyatta saying they oppose the idea.",
    "Lamb and Kenyatta used a big chunk of the debate to poke fun at the empty lectern where Fetterman would have stood, labeling him an unserious candidate unwilling to have tough conversations.",
    "Lamb said losing the seat would “effectively mean we cannot govern,” and won’t be able to pass the Voting Rights Act or any of the other critical legislation that Democrats are calling for.",
    "And according to a Philadelphia Inquirer analysis, Fetterman has more than twice as much to spend in the final weeks as Lamb: $3.9 million to about $1.2 million.",
    "Asked if he would do anything differently if faced with the situation again, Fetterman opted instead to describe the circumstances surrounding the incident.",
    "In a poll last week by Franklin and Marshall College, Fetterman led the pack with 41% of registered Democrats saying they’d support him in the primary.",
    "He said the election will come down to who can best define a vision of what it will mean for Pennsylvanians if Democrats get a bigger, bolder majority.",
    "The debate nearly spun out of control when the topic of Fetterman’s actions during a 2013 incident in Braddock was brought up by the moderators.",
    "The Build Back Better bill in Congress, Lamb noted, vows to raise the income tax rate on those who earn $400,000 to $500,000 a year and above.",
    "Lamb said the man in question also said Fetterman is lying about whether he pointed a shotgun at his chest; Fetterman has denied doing this.",
    "He said the Affordable Care Act has done that, insuring many Americans who previously didn’t have insurance and capping out-of-pocket costs.",
    "He has won in situations like this, he said, and he can uniquely talk to swing voters — the ones who are “not big liberals” — to win.",
    "More than a quarter of the Democratic voters that Franklin and Marshall polled said they were so far undecided.",
    "Fetterman missed the first opportunity earlier this month at Muhlenberg College, and it didn’t go unnoticed.",
    "He also called for manufacturing more things here in the U.S. in a reimagining of the supply chain.",
    "Medicare for All is “impractical,” he said, and would cost $30 trillion over the next decade.",
    "HARRISBURG — For the first official time in their run for U.S. Senate, Pennsylvania Lt. Gov.",
    "It also defined a split in the primary over how much to tax the wealthiest Americans.",
    "Tom Wolf’s ticket in 2018 than the governor garnered four years earlier, he noted.",
    "Lamb registered at 17% in that poll, with Kenyatta trailing at 4%.",
    "Much can change in the final stretch of the race, though.",
    "The man turned out to be an unarmed Black jogger.",
    "He added a million more votes to Gov."
  ]
}