{
  "id": 5095,
  "mediaId": 8368,
  "date": "2022-04-22",
  "headline": "Philadelphia to end mask mandate, days after reinstating it",
  "image": "https://metrophiladelphia.com/wp-content/uploads/2022/04/AP22101714612018-1200x800.jpg",
  "link": "https://metrophiladelphia.com/philadelphia-to-end-mask-mandate-days-after-reinstating-it/",
  "mediaOutlet": "Metro - United States - Pennsylvania",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://metrophiladelphia.com/author/associated-press/",
  "termIds": [
    5027,
    6512
  ],
  "sentences": [
    "“We have to move past COVID,” said Fetterman, adding that “we have to live with this virus, and I don’t believe going backwards with a mask mandate or with closures is appropriate.”\nU.S. Rep. Conor Lamb of suburban Pittsburgh said he hated wearing masks, but thought Philadelphia officials were “trying to do what’s best for everybody.”\nMost states and cities dropped their masking requirements in February and early March following new guidelines from the U.S. Centers for Disease Control and Prevention that put less focus on case counts and more on hospital capacity and said most Americans could safely take off their masks.",
    "“So I’m really very happy … to say it appears that we no longer need to mandate masks in Philadelphia and that we can actually move to simply a strong recommendation.”\nPhiladelphia had become the first major U.S. city to reinstate its indoor mask mandate, but faced fierce blowback as well as a legal effort to get the mandate thrown out.",
    "By MICHAEL RUBINKAM Associated Press\nPhiladelphia is ending its indoor mask mandate, city health officials said Thursday night, abruptly reversing course just days after people in the city had to start wearing masks again amid a sharp increase in infections.",
    "“We were very pleased to see Philadelphia make the correct decision to rescind the mask mandate,” said the plaintiffs’ lawyer, Thomas W King III, who was among those involved in last year’s successful legal challenge to the statewide mask mandate in schools.",
    "Cases and hospitalizations continued to rise at least through Monday, when the health department reported 82 patients in the hospital with COVID-19 — up nearly 80% from a week earlier — with confirmed cases up 58% over that same span to 224 per day.",
    "The Board of Health voted Thursday to rescind the mandate, according to the Philadelphia health department, which released a statement that cited “decreasing hospitalizations and a leveling of case counts.”\nThe mandate went into effect Monday.",
    "Shortly before news broke that the mandate was ending, the issue came up during Thursday night’s debate between the three leading Democratic candidates seeking the party’s nomination for Pennsylvania’s open U.S. Senate seat.",
    "“If we fail to act now, knowing that every previous wave of infections has been followed by a wave of hospitalizations, and then a wave of deaths, it will be too late for many of our residents,” Bettigole said at the time.",
    "But the acting health commissioner, Dr. Cheryl Bettigole, told the Board of Health at a public meeting Thursday night that hospitalizations had unexpectedly gone down 25% in a matter of days.",
    "When the city announced April 11 that mandatory masking was coming back, Bettigole said it was necessary to forestall a potential new wave driven by an omicron subvariant.",
    "The restaurant industry had pushed back against the city’s reimposed mask mandate, saying workers would bear the brunt of customer anger over the new rules.",
    "The Justice Department, meanwhile, said it is appealing a judge’s order that voided the federal mask mandate on planes and trains and in travel hubs.",
    "“We’re in a situation that we really had not anticipated being in this soon but it is good news,” she said, according to a transcript of the meeting.",
    "She said Philadelphia had crossed the threshold of rising cases at which the city’s guidelines call for people to wear masks indoors.",
    "The health department did not release data to back up its reversal on masking, saying more information would be provided Friday.",
    "Few masks were worn at the Philadelphia 76ers’ home playoff game on Monday, even though they were required under city rules.",
    "The CDC asked the Justice Department to appeal the decision handed down by a federal judge in Florida earlier this week.",
    "Several businesses and residents filed suit in state court in Pennsylvania seeking to overturn the renewed mandate.",
    "The Board of Health’s vote to rescind the mandate came after board members met in private to discuss the lawsuit.",
    "Sign up for our Daily Email newsletter to stay up-to-date on the latest local news throughout Philadelphia.",
    "Bettigole told the Board of Health on Thursday night that hospitalizations had since drifted down to 65.",
    "Those numbers were still a fraction of what the city endured during the wintertime omicron surge.",
    "John Fetterman and state Rep. Malcolm Kenyatta of Philadelphia, came out against the mandate.",
    "City officials said the mandate would be lifted Friday morning.",
    "Philadelphia had ended its earlier indoor mask mandate March 2.",
    "Notably, two of them, Lt. Gov."
  ]
}