{
  "id": 5183,
  "mediaId": 2522,
  "date": "2022-04-22",
  "headline": "Philly scraps mask mandate days after reinstating, critics believe they know why: ‘Power of the people’",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2021/09/GettyImages-1249361098.jpg",
  "link": "https://www.bizpacreview.com/2022/04/22/philly-scraps-mask-mandate-days-after-reinstating-critics-believe-they-know-why-power-of-the-people-1228704/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Todd Jaquith",
  "authorUrl": "https://www.bizpacreview.com/author/todd-jaquith/",
  "termIds": [
    0
  ],
  "sentences": [
    "“If we fail to act now,” she explained at the time, “knowing that every previous wave of infections has been followed by a wave of hospitalizations, and then a wave of deaths, it will be too late for many of our residents.”\nVarious Philadelphia residents and businesses, including the city’s restaurant industry, had filed lawsuits seeking to overturn the indoor mask mandate.",
    "“So I’m really very happy…to say it appears that we no longer need to mandate masks in Philadelphia and that we can actually move to simply a strong recommendation.”\nShe further explained that statistics indicated hospitalizations had unexpectedly declined by 25% in the city.",
    "— TheBSDetector (@burn_loot) April 22, 2022\nIt’s quite a change from just last week, and it seems to hint that health officials and city personnel are beginning to understand that the public’s tolerance of COVID-era mask mandates and other measures is wearing thin.",
    "“We’re in a situation that we really had not anticipated being in this soon but it is good news,” Dr. Cheryl Bettigole, the city’s acting health commissioner, told the Board of Health in a public meeting on Thursday, according to the Associated Press.",
    "We have to get—and keep—our kids back in school.”\nHe added: “[w]e have to live with this virus, and I don’t believe going backwards with a mask mandate or with closures is appropriate.”\n“I don’t agree with imposition of the Philadelphia mask mandate.",
    "— Ian Smith – Candidate NJ CD-3 (@iansmithfitness) April 22, 2022\nThe city’s Health Department was not immediately forthcoming with the data it used to justify the decision, but said that information would be coming Friday.",
    "“The City will move to strongly recommending masks in indoor public spaces as opposed to a mask mandate.”\nAs a result, the city’s Board of Health voted on Thursday to rescind the mandate, which had a pretty short lifespan.",
    "When the city announced its mandatory masking policy on April 11, Bettigole had stressed that it was a necessary precaution to protect against a possible wave of infections from a new omicron subvariant.",
    "It was only on April 11 that the Health Department had announced its requirement that face masks would be mandatory indoors throughout the city, and the mandate went into effect on Monday of this week.",
    "“Given the latest data, the Board of Health voted tonight to rescind the mandate,” Sarah Peterson, a spokeswoman for Philadelphia Mayor Jim Kenney, explained in a statement to CNN.",
    "And the matter even came up in Thursday night’s debate between the Democratic candidates vying for the state’s open U.S. Senate seat.",
    "Legal challenges were immediately mounted to reverse the mandate, and there weren’t many who bothered to comply with it anyhow.",
    "As of Thursday night, Philadelphia has decided to end its indoor mask mandate—and this only a few days after reinstating it.",
    "Regardless of what they will tell you about “the science “these mask mandates were dropped because of mass noncompliance.?",
    "Philadelphia made headlines as the first major US city to reinstate an indoor mask mandate—but few seemed pleased with it.",
    "In any case, it seems likely that the dramatic decrease in COVID-19 cases and hospitalizations drove the reversal.",
    "And it was only last month, on March 2, that Philadelphia had brought its previous indoor mask mandate to an end.",
    "pic.twitter.com/M0tTaw3NTx\n— Sahil Kapur (@sahilkapur) April 22, 2022\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "Witness Monday’s home playoff game for the Philadelphia 76ers where few of the attendees wore masks.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "(@ElectionWiz) April 22, 2022\n?Philadelphia drops mask mandate 4 days after it was reinstated.",
    "That’s certainly welcome news, and it’s likely to be celebrated by Philly’s unruly citizens.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "The reversal comes amid a massive public backlash against the city’s re-instituted mandate.",
    "BREAKING: Philadelphia health officials say they're ending the city's indoor mask mandate.",
    "I don’t,” says Pennsylvania Democratic Senate frontrunner @JohnFetterman.",
    "Two of the candidates, state Representative Malcolm Kenyatta and Lt. Gov.",
    "We have to get — and keep — our kids back in school,” he says.",
    "John Fetterman, declared that they were against the mandate.",
    "“We have to move past COVID,” he said, according to the AP.",
    "The public will not see it and we do not share it.",
    "This was before news of the mandate’s revocation.",
    "Philadelphia's new mask mandate lasted 4 days.??",
    "“We have to rebuild our business community.",
    "We have to rebuild our business community.",
    "This is the power of the people.?",
    "“We have to move past covid.",
    "Don't be too hard on CNN+.",
    "It truly is that simple.",
    "— Election Wizard ????",
    "?",
    "?",
    "?",
    "?"
  ]
}