{
  "id": 5200,
  "mediaId": 6461,
  "date": "2022-04-21",
  "headline": "Why are Republicans boycotting political debates?",
  "image": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20220423_BLP501.jpg",
  "link": "https://www.economist.com/the-economist-explains/2022/04/21/why-are-republicans-boycotting-political-debates",
  "mediaOutlet": "Economist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2143,
    2137,
    2802,
    3578,
    3860,
    3989,
    1125,
    1126,
    6678
  ],
  "sentences": [
    "On April 14th the Republican National Committee (RNC) quit the Commission on Presidential Debates (CPD), a non-partisan group that sponsors general-election debates between candidates for America’s highest office.",
    "In 1988 the leader of the League of Women Voters, which organised debates at the time, complained that “stringent, unyielding and self-serving demands” were making the events “charades devoid of substance”.",
    "Think of Lloyd Bentsen’s dismissal of Dan Quayle in a vice-presidential debate of 1988: “Senator, you’re no Jack Kennedy.” They offer a rare chance to get candidates off script.",
    "If Mr Walker and his ilk can duck out of debates unscathed, says Mr Schroeder, “you can bet that other candidates will heed that lesson and try to evade them as well”.",
    "He performed abysmally in debates as a candidate and detests the exercise, which by its nature involves being well-informed and having your views challenged.",
    "That they make hopefuls “scared as hell” proves their worth, says Alan Schroeder of Northeastern University, author of a book on the subject.",
    "It was the first time a scheduled presidential debate had been cancelled outright since televised general-election debates began in 1960.",
    "The RNC says it wants to keep Republicans from participating in “biased” contests and claims it will develop “newer, better” formats.",
    "Not all no-shows are Republican: John Fetterman, a Democratic candidate for the Senate in Pennsylvania, failed to appear too.",
    "Why Amazon staff on Staten Island voted to unionise\nWhy Florida is banning lessons on sexual orientation and gender identity",
    "Little surprise, then, that Republican candidates in America are ducking out of their political equivalent: the debate.",
    "In 2020 Donald Trump quit a virtual town hall with Joe Biden, complaining the setup was a ploy to cut his microphone.",
    "Ted Budd and Mehmet Oz, Senate contenders in North Carolina and Pennsylvania, have been similarly reticent.",
    "More from The Economist explains:\nWhat is the Jones Act, the century-old law pushing up prices in America?",
    "(Steve Scully, a journalist and presidential-debate moderator in 2020, interned for Mr Biden in 1978.)",
    "Politicians have long tussled over moderators, topics, dates, venues, format and even stage setup.",
    "Jimmy Carter skipped one in 1980 because he objected to the inclusion of an independent candidate.",
    "So have Jim Pillen and Mike DeWine, candidates for governor in Nebraska and Ohio respectively.",
    "Debates tend not to change voters’ minds, though they can energise people and drive turnout.",
    "But presidential hopefuls have almost always shown up for general-election match-ups.",
    "Herschel Walker, the front-runner in Georgia’s Senate primary, has avoided them.",
    "But absenteeism may have fewer electoral consequences in down-ballot races.",
    "Presidential debates will probably survive the RNC’s gambit.",
    "The RNC wants debates to be held before early voting starts.",
    "Why are Republicans against debating as it currently exists?",
    "Their disappearance would serve politicians, not voters.",
    "But its stance is really a mark of fealty to Mr Trump.",
    "WHO DOESN’T squirm at the prospect of a job interview?",
    "The cost to candidates of boycotting them is high.",
    "Plenty of people would skip them if they could.",
    "They can define careers, in ways good or ill.",
    "Only the Super Bowl gets more viewers.",
    "It also gripes about biased hosts."
  ]
}