{
  "id": 5700,
  "mediaId": 2713,
  "date": "2022-04-09",
  "headline": "Trump endorses celebrity surgeon Dr Oz for US Senate seat",
  "image": "https://static.ffx.io/images/$zoom_0.6409291587291893%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_135%2C$y_152/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/9c7a32bb0ec28e784c8e16e2302b12b7114e6a0d",
  "link": "https://www.smh.com.au/world/north-america/trump-endorses-celebrity-surgeon-dr-oz-for-us-senate-seat-20220410-p5accg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Moira Warburton",
  "authorUrl": "",
  "termIds": [
    4905,
    5862,
    2802,
    2765,
    2751,
    3989,
    1489
  ],
  "sentences": [
    "Share\nNormal text sizeLarger text sizeVery large text size\nWashington: Former US President Donald Trump has endorsed celebrity surgeon Dr Mehmet Oz, who is running as a Republican in a closely watched US Senate contest in Pennsylvania.",
    "No payment required\nRead more\nContinue with GoogleContinue with Apple\nor\nEmail addressContinue\nBy continuing, you agree to your personal information being collected under our privacy policy and accept our terms of use.",
    "Mehmet Oz at the Conservative Political Action Conference in Orlando, Florida, in February.Credit:Bloomberg\nOz, known for the syndicated The Dr. Oz Show, brings substantial name recognition to the November 8 contest.",
    "On the Democratic side, Pennsylvania’s progressive lieutenant governor, John Fetterman, is locked in a race against Congressman Conor Lamb, a moderate representing the north-western suburbs of Pittsburgh.",
    "Toomey was one of seven Republican senators who voted to convict Trump in February 2021 following Trump’s impeachment on a charge that he incited last year’s attack on the Capitol by Trump supporters.",
    "His public image took a blow in 2014, however, when he told legislators probing bogus diet product ads that some of the products promoted on his show lacked “scientific muster”.",
    "Dr Mehmet Oz with Donald Trump.Credit:AP\nThe Senate race in Pennsylvania could determine control of the Senate and the fate of Democratic President Joe Biden’s agenda.",
    "“Dr Oz is smart, tough, and will never let you down; therefore he has my complete and total endorsement,” Trump said in a statement on Saturday (Washington time).",
    "But Parnell suspended his campaign in November 2021 after his estranged wife alleged physical abuse and he lost a battle over the custody of his three children.",
    "Oz rose to fame shocking audiences with show-and-tell displays of decaying lungs and rotting livers, telling viewers they should take care of themselves.",
    "By Moira Warburton and Jan Wolfe\n April 10, 2022 — 10.54am\n Save\nLog in, register or subscribe to save articles for later.",
    "Senators at the hearing focused on green coffee bean extract, a dietary supplement Oz touted in 2012 as a “miracle”.",
    "Reuters\nGet a note directly from our foreign correspondents on what’s making headlines around the world.",
    "Recent polls had Oz and McCormick neck and neck in the Republican primary contest to be held on May 17.",
    "The top Republicans in the race are Oz and David McCormick, a former hedge fund chief executive.",
    "In September 2021, Trump endorsed Sean Parnell for the open Pennsylvania seat Oz is vying for.",
    "A crowded field of candidates is vying to replace the retiring Republican senator Pat Toomey.",
    "The Senate vote of 57-43 fell short of the two-thirds majority needed to convict Trump.",
    "Register or log in now to read more articles and unlock extra benefits.",
    "Sign up for the weekly What in the World newsletter here.",
    "Thank you for reading the Herald.",
    "This article is complimentary.",
    "Hide content"
  ]
}