{
  "id": 5762,
  "mediaId": 2580,
  "date": "2022-04-19",
  "headline": "Trump accused of living in Oz after endorsing liberal TV doctor",
  "image": "https://www.gopusa.com/wp-content/uploads/2021/11/dr_oz.jpg",
  "link": "https://www.gopusa.com/trump-accused-of-living-in-oz-after-endorsing-liberal-tv-doctor/",
  "mediaOutlet": "GOPUSA ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4931,
    5862,
    2765,
    3029,
    4243
  ],
  "sentences": [
    "So I know President Trump made a big error in endorsing Dr. Oz.”\nTrump’s surprise endorsement of the TV doctor came after conservatives had already exposed Oz on numerous hot-button issues: Suggesting there is “systemic racism” in medical treatment for minorities, which is a tenet of Critical Race Theory; defending surgery for transgender children; and praising China’s brutal lockdown of its own people during the COVID-19 pandemic.",
    "“Millions and millions of Americas are going to say, Wendy Williams didn’t get a vaccine so I don’t want to get a vaccine.”\nAccording to Gramley, voters should avoid supporting GOP frontrunner McCormick because of his millions of dollars in hedge fund investments that she says are closely tied to China and its communist government.",
    "The retirement of Sen. Pat Toomey has set up a GOP primary that includes daytime TV personality Dr. Mehmet Oz as well as wealthy hedge fund CEO David McCormick; real estate developer Jeff Bartos; George Bochetto; military veteran Kathy Barnette; Sean Gale; and former California resident Carla Sands.",
    "“Take their blueprint and repeat it here in this country.”\nBack in May of 2021, almost a year ago, Oz lectured talk show host Wendy Williams about getting the COVID-19 vaccine when he asked her in a live TV interview.",
    "According to a compilation of polls at RealClearPolitics, McCormick is the choice of Pennsylvania voters with a single-digit lead, but he and Oz are spending millions of dollars in the neck-and-neck race.",
    "“Barnette is, to me, the only true proven conservative,” Gramley insists, “and she’s travelling the commonwealth to meet the people, shake hands.”\nAmong the Democrats, Lt. Gov.",
    "Diane Gramley, president of the American Family Association of Pennsylvania, tells AFN that Trump made a “big error” by endorsing the well-known “Dr.",
    "Among the candidates left on the ballot, Gramley says she will vote for Kathy Barnette, a Fox News commentator, author, and former U.S. Army veteran.",
    "Oz” in his U.S. Senate run, and a conservative activist from the state says she is among those concluding the former president made a huge mistake.",
    "Donald Trump surprised and frustrated his right-wing base when he endorsed liberal TV celebrity “Dr.",
    "“What you say and believe is so important to a lot of people,” he pressed.",
    "“We have to copy what they did,” Oz said in an NBC News interview.",
    "John Fetterman has a double-digit lead in the Democratic primary.",
    "“He’s not pro-everything that we are as true conservatives.",
    "He is not pro-Second Amendment,” she complains.",
    "She said flatly she didn’t trust it.",
    "Oz” over several other Republicans.",
    "Copyright American Family News.",
    "Reprinted with permission.",
    "The primary is May 17.",
    "Oz is not pro-life.",
    "“Dr."
  ]
}