{
  "id": 6189,
  "mediaId": 8254,
  "date": "2022-04-15",
  "headline": "Oz, Mastriano lead latest Pennsylvania Senate, Governor polls",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/04/AP22092669446649.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/oz-mastriano-lead-latest-pennsylvania-senate-governor-polls/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    4243,
    4539,
    2802,
    3029,
    1659,
    2650,
    2765,
    1584,
    1489,
    6208
  ],
  "sentences": [
    "In the race for Governor, Mastriano received 21.9% support, followed by Lou Barletta with 18.8%, Bill McSwain with 17.4%, and Dave White with 11.4%,\nMelissa Hart finished fifth with 3.5% and Jake Corman, who briefly exited and re-entered the race this week, is at 3%.",
    "In the Senate race, Oz received 22.7%, followed by Dave McCormick at 19.7% and Kathy Barnette with 18.4%\nCarla Sands received 11.2%, Jeff Bartos received 7.7%, George Bochetto received 2.5%, and Sean Gale had 0.8%.",
    "Nexstar Media Inc. will also host an exclusive multi-market prime time debate between the Republican Party candidates for Governor of Pennsylvania on April 25 at 8 p.m. from the abc27 studio in Harrisburg.",
    "Nexstar Media Inc. will host an exclusive multi-market prime time debate between the Republican Party candidates for Governor of Pennsylvania on April 27 at 8 p.m. from the abc27 studio in Harrisburg.",
    "abc27 will also host a debate with the Democratic Party candidates for Senate on April 21 at 8 p.m. John Fetterman, Conor Lamb, and Malcolm Kenyatta have each committed to attend.",
    "(WHTM) – New polls from The Tragalgar Group show Dr. Mehmet Oz leading Pennsylvania Senate candidates and Doug Mastriano the leader among Gubernatorial candidates.",
    "The poll, which was conducted after Oz was endorsed by former President Donald Trump, interviewed 1,074 likely Republican Primary voters.",
    "Candidates who have committed to attend include: Kathy Barnette, Jeff Bartos, Dave McCormick, Mehmet Oz, and Carla Sands.",
    "Candidates who have committed to attend include: Lou Barletta, Doug Mastriano, Bill McSwain, and Dave White.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "A majority of the poll respondents were in the 45-64 age range, followed by the 65 and older group.",
    "Nche Zama, Joe Gale, and Charlie Gerow each received less than 2% and 19.4% were undecided.",
    "All candidates on the ballot who meet eligibility criteria will be invited to participate.",
    "All candidates on the ballot who meet eligibility criteria will be invited to participate.",
    "The poll had a 1.43% response rate, a 2.99% margin of error, and a 95% confidence rate.",
    "Seventeen percent of likely Republican voters are undecided in the Senate race.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "Sign up for the abc27 newsletters here.",
    "Sign up here."
  ]
}