{
  "id": 6205,
  "mediaId": 8254,
  "date": "2022-04-13",
  "headline": "2022 United States Senate election in Pennsylvania: Where Democratic candidates stand on the issues",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/01/GettyImages-1134183142.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/2022-united-states-senate-election-in-pennsylvania-where-democratic-candidates-stand-on-the-issues/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lauren Rude",
  "authorUrl": "https://www.abc27.com/author/lauren-rude/",
  "termIds": [
    3989,
    2709,
    1489,
    392,
    6506,
    6208,
    6366,
    6678
  ],
  "sentences": [
    "Khalil — Not only does she want to end the privatization of the entire criminal justice system, but Khalil says she wants to also “end solitary confinement for people in prison but not convicted of a crime and provide mental health care.” She also wants to work with leaders of both political parties to study the excessive use of solitary confinement by correctional facilities in the U.S.\nImmigration\nKenyatta — After seeing children separated from their families and put in detention centers, he plans to support: “A path to citizenship for Dreamers, farmworkers, TPS holders, and many more immigrant workers who have been critical to our nation’s recovery.",
    "“I believe that all Americans should have the right to see a doctor when they’re sick, which means all Americans need access to health insurance they can afford.”\nKhalil — “Healthcare as a human right includes affordable prescription drugs and ending the price gouging of Americans on drug prices by banning drug companies from charging more for a drug than they charge in Canada, Europe, and Japan, mental health care, wheelchairs, hearing aids, dental care, and glasses.” Khalil also notes that she would like to establish a COVID-19 Vaccine Distribution Emergency tax force.",
    "Plus, she notes on her campaign website, “We need a Marshall Plan for the United States and part of the plan must include rebuilding Public Schools.”\nCrime\nKenyatta — As someone who grew up “surrounded by a justice system that prioritized punishment over safety” Kenyatta wants to make Pennsylvania safer by implementing reform in the criminal justice system, prioritizing wellbeing and safety by bolstering the social safety net, focusing on police officers on identifying and prosecuting real bad actors, and empowering mental healthcare workers.",
    "Khalil — Khalil briefly notes on her website that she “supports a pathway to citizenship for all undocumented immigrants and the immediate ending of immigrant detention.”\nClimate Change/Environment\nKenyatta — Not only does he believe in reducing our dependence on fossil fuels, but pushes for a moratorium on new fracking and to end tax breaks to oil and gas giants, which would shift our resources to fund a just transition and investments in green energy technology to make Pennsylvania an energy leader.",
    "Learn more about where each candidate stands on the different issues based on their campaign websites and past interviews/debate appearances, below:\nEconomy\nMalcolm Kenyatta — “As we emerge from the worst throes of the pandemic, we must prioritize the communities worst hit by the virus and ensure we address the inequities that led to the devastation.” Kenyatta emphasizes on his campaign website communities of color, women, low-wage workers, as well as, small businesses as priorities.",
    "Lamb — “We can have both justice and safety if we address the root causes of crime, as well as issues of over-incarceration, sentencing reform, decriminalization of marijuana, and disparity in bail systems.” On his website, Lamb highlights no prosecutions for marijuana possession, passing the George Floyd Justice in Policing Act, ending driver’s license suspensions, and expanding treatment courts and social diversion programs.",
    "We need a compassionate response to immigration reform that actually treats immigrants like human beings.”\nLamb — While Lamb does not highlight his views on immigration on his campaign website, as District 17 House representative, he sponsored or cosponsored the Keep Families Together Act in 2019, which limited the separation of families at or near U.S. borders or ports of entry.",
    "Khalil — She supports the Green New Deal and will fight for the consent of Native American Tribes on all mining and energy projects, the support of regenerative farming to prevent runoff that can harm waterways, high-speed rail funding for Pennsylvania, and converting old coal mines to geothermal systems currently utilized by the Netherlands.",
    "We need to transition to clean energy as quickly as possible, and we can create millions of good union jobs in the process.” In a video on his campaign website, he notes that environmental justice is critical for all Pennsylvanians and will use his 14 years as mayor of a community that has faced injustices to make his decisions as Senator.",
    "Kenyatta — While he did not have an entire section dedicated to the legalization on his website, he did note that one way to curb mass incarceration and begin to address Pennsylvania’s opioid crisis is to treat drug abuse as a public health issue, which means fully legalizing marijuana and allowing its use as pain medication.",
    "Lamb — “As we move toward decriminalizing marijuana possession and use at the federal level, declining to prosecute people for possession is an immediate step we can take to reduce the high number of nonviolent drug offenders into our criminal justice system.” He calls is both an issue of racial justice and common sense.",
    "Khalil — Not only does she support the legalization, but she is also requiring that gross profits be used for economic development in communities most impacted by the “war on drugs,” mental health and addiction counseling, and pain management research/non-drug related treatment in physical therapy and acupuncture.",
    "Senator, he will support canceling student debt, free public higher education, and physical investment in upgrading and modernizing public schools.”\nFetterman — At a 2019 forum hosted by Penn State University’s Lion Caucus, Fetterman addressed the high cost of attending a public university in Pennsylvania.",
    "Lamb — The biggest points Lamb focuses on with healthcare include protecting and strengthening the Affordable Care Act, cutting prescription drug prices, lowering the Medicare eligibility age from 65 to 60, and finding ways to better spend funds in the healthcare system.",
    "She also supports that $15/hour minimum wage, mobile pension plans, supporting public banks and allowing banking at post offices, increasing support for Pennsylvania’s arts, crafts and artisans, and the rebirth of Philadelphia’s textile industry.",
    "He says families and students in the state need relief and that the issue needs “a realistic, workable solution.” When asked about a debt-free or tuition-free public higher education, he said it is ideal but not sure how it can be achieved.",
    "Lamb — Noting that education is the foundation of the American Dream, Lamb says he believes Pennsylvania needs to recommit to public education, pay teachers fairly and defend them against unfair attacks by anti-union special interests.",
    "So we need to act now.” If elected, he will work to build new power plants, manufacture technologies for solar and wind energy, modernize nuclear power and push for more research and development of hydrogen creation.",
    "That just shouldn’t be the case in the United States of America in 2021.” If elected, he plans to be a part of the Senators who will vote “to put a decent floor under our hardest working and most vulnerable people.",
    "Marijuana Legalization\nThe United States House has recently passed legislation to legalize marijuana nationwide and eliminate the longstanding criminal penalties for anyone who distributes or possesses the drug.",
    "Fetterman –“Health care is a fundamental human right – just like housing, food, and education.” Fetterman in the past has said if Medicare For All needed his vote to pass in the Senate, he would vote for it.",
    "Other issues not highlighted below but featured on at least one or all of the candidates’ websites include reproductive rights, filibuster reform, retirement security, veterans, unions, and voting rights.",
    "Fetterman — While he says there are many reasons that he called for the legalization of marijuana five years ago, and now again during his run for Senate, he emphasizes the criminal justice aspect of it.",
    "HARRISBURG, Pa. (WHTM) — The primary election for Pennsylvania’s open seat in the United States Senate is just around the corner, and as of now, there are four Democratic candidates still in the race.",
    "Alexandra Khalil — Hoping to create an economy that “works for all Pennsylvanians” Khalil supports the Federal Reserve policy of raising the standard of living for the working and middle class.",
    "He believes Pennsylvania must also invest in infrastructure to create good jobs for Pennsylvanians and notes that he helped and will continue to help in the fight for a minimum wage increase.",
    "abc27 has compiled a list of the important issues discussed in the United States based on a recent WHTM/Emerson College Polling/The Hill poll and where each candidate stands on them.",
    "Education\nKenyatta — Kenyatta says he believes in fair and equal funding for schools, plus, the expansion of programs such as HeadState, PreK, and afterschool programs.",
    "We also need to stop separating families and shut down detention centers that are locking up kids in cages.”\nFetterman –“Immigration is what makes America, America.",
    "Healthcare\nKenyatta — If elected, Kenyatta plans to support legislation that would lower prescription drug costs and move Pennsylvania closer to coverage for all.",
    "Before you head into the booth and vote on May 17, it is important to know where each candidate stands on the important issues that impact Pennsylvanians.",
    "His campaign website notes that, if elected, he will support the THRIVE Act, which would limit methane emissions and invests in solar and window power.",
    "The legalization has been largely supported by Democrats, and the bill is now waiting to clear the necessary 60 votes to advance in the Senate.",
    "Lamb — “In the 21st century, someone will sell the entire world the technology that we need to go from 51 billion tons of greenhouses to zero.",
    "It doesn’t make anyone more sage.” If elected he plans to continue his reinvention of clemency and the pardon process in Pennsylvania.",
    "Fetterman — In a video on his campaign website, Fetterman says “I believe our criminal justice system needs a significant overhaul.",
    "He is also a strong supporter of President Biden’s efforts to guarantee universal preschool and two years of community college.",
    "“The idea that we have allowed a plant to be illegal and criminalized in this country is absurd.” After taking office as Lt.",
    "abc27 will host an exclusive multi-market prime time debate between the party candidates on April 21 at 8 p.m.",
    "She plans to work across party lines to ensure mental health services are available for children in school.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "Khalil — Similar to the other candidates, she has pushed for quality and inclusive education for all.",
    "It will be both on-air and streaming in 10 markets across Pennsylvania, New York, Ohio, and Maryland.",
    "Governor, he transformed the positon and made a bully pulpit office, adovcating for economic justice.",
    "To learn more about the candidates’ views on the additional issues, click on their names below.",
    "He will also support Universal Childcare/Child Tax Credit, Paid Sick Leave, and Medical Leave.",
    "Governor, he went around to all 67 counties asking Pennsylvanians about legalizing marijuana.",
    "All work has dignity, and all paychecks must too.” He notes on his website that, as Lt.",
    "John Fetterman — “The minimum wage should be a living wage of at least $15 an hour.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "If you are a full-time minimum wage worker, you are living in poverty.",
    "I want it to be us — American companies, employing American workers.",
    "There are individuals who quite frankly don’t need to be in prison.",
    "I saw firsthand just how arbitrary and punitive it actually was.",
    "He also started a GED program in Braddock, Pennsylvania.",
    "Fetterman –“Climate change is an existential threat.",
    "You probably have a second job just to survive.",
    "Sign up for the abc27 newsletters here.",
    "Conor Lamb — “This is really simple.",
    "China wants it to be them.",
    "“And as a U.S.",
    "Sign up here.",
    "Sign up here."
  ]
}