{
  "id": 6767,
  "mediaId": 8481,
  "date": "2022-04-10",
  "headline": "Democratic candidates make stop in Centre County",
  "image": "https://www.wearecentralpa.com/wp-content/uploads/sites/69/2022/04/lamb-centre.jpg?w=1280",
  "link": "https://www.wearecentralpa.com/your-local-election-hq/democratic-candidates-make-stop-in-centre-county/",
  "mediaOutlet": "wearecentralpa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Tracy",
  "authorUrl": "https://www.wearecentralpa.com/author/jordan-tracy/",
  "termIds": [
    0
  ],
  "sentences": [
    "And I know the squeeze that whether it’s inflation or gas prices, rising costs at the grocery store, what that means to a family who’s on a fixed income.”\nIn our recent poll done in conjunction with Emerson College and The Hill, it was John Fetterman who had a substantial lead over these other candidates.",
    "And so that shows you I can keep all the Democrats, but also get the swing voters you need to win.”\nKenyatta says it’s relatability and a strong message that he believes will help him turn out the right coalition of voters to win in November.",
    "He said, “Being able to win in a fall is just as important as every issue that they believe in.”\nFetterman points to his 67 county campaign journey as to why he’s the best candidate to win in in November.",
    "State Rep. Scott Conklin of the 77th District said voters in his district understand how important it is to flip this senate seat in Pennsylvania blue.",
    "by writing large checks.”\nFor Lamb, he’s previously won elections in his district against republicans Sean Parnell and Keith Rothfus before that.",
    "And we have a true grassroots infrastructure throughout Pennsylvania, as opposed to the Republicans, which are just buying name I.D.",
    "In that race, voters at the breakfast told WTAJ that the key issue for them was which candidate is more electable in November.",
    "CENTRE COUNTY, Pa. (WTAJ) — The Centre County Democrats hosted multiple candidates at their Spring Breakfast on Saturday.",
    "He explained, “Our campaign is built from the grassroots up to be scalable in a way that the Republicans can’t match.",
    "I’ve gone out three elections in a row and beaten Trump backed candidates in republican districts.",
    "Whereas the other candidates have to say sort of ,hypothetically, here’s what they would do.",
    "In attendance were U.S. Senate candidates John Fetterman, Conor Lamb, and Malcolm Kenyatta.",
    "He said, “I’m the only candidate in this race who’s actually a working person.",
    "He said those victories show his ability to win in a general election.",
    "You know, I came from a working class family in North Philadelphia.",
    "However, a lot of those voters said they were still undecided.",
    "He detailed, “I can point people to how I’ve already done it.",
    "But they’ve only ever been in Democratic primaries.",
    "My mom was a home health aide.",
    "My dad was a social worker."
  ]
}