{
  "id": 6919,
  "mediaId": 6570,
  "date": "2022-04-14",
  "headline": "New Pa. U.S. Senate poll: John Fetterman pulling ahead as Democratic favorite; GOP race still wide open",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/20220320awSenForum06-3-1649930053.jpg",
  "link": "https://www.post-gazette.com/news/politics-state/2022/04/14/fetterman-pulls-ahead-as-democratic-favorite-gop-pa-senate-race-still-wide-open-in-april-f-m-poll/stories/202204130138",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "It doesn’t seem like Lamb is making any inroads in his name recognition.”\nMr. Fetterman jumped by 13 percentage points since last month’s Franklin & Marshall College Poll, in which only 28% of Democratic voters said they’d support him and 44% said they were undecided.",
    "John Fetterman has pulled ahead as the Democratic U.S. Senate frontrunner over U.S. Rep. Conor Lamb, while the GOP primary for the country’s most-watched Senate race remains wide open, according to a Franklin & Marshall College Poll released Thursday.",
    "Former daytime TV host and medical surgeon Mehmet Oz and former hedge fund CEO Dave McCormick only attained 16% and 15% support, respectively, in the poll, despite hammering millions in TV ads over the last three months.",
    "In Pennsylvania’s race for governor, state Sen. Doug Mastriano held the biggest lead in the April poll among the 10 remaining GOP candidates, with 15% of voters saying they’d support the uber-conservative candidate.",
    "Former U.S. Attorney Bill McSwain and former U.S. Rep. Lou Barletta followed closely behind Mr. Mastriano, with 12% and 10%, respectively, and the rest of the candidates following in the single digits.",
    "Mr. Fetterman now leads the Democratic primary with 41% of registered Democrats saying they’d support him in the upcoming May 17 election and 26% who are still undecided, according to the poll.",
    "Attorney General Josh Shapiro, the lone Democratic candidate for Pennsylvania governor, showed high favorability among Democrats, with 61% of voters holding a favorable opinion of him.",
    "“If you are a candidate, you want to be in Fetterman’s position,” said Berwood Yost, the director of Franklin & Marshall College’s Center for Opinion Research, based in Lancaster.",
    "Mr. Oz also received the highest unfavorable rating among Republican voters, with 39% of voters saying they have a somewhat unfavorable or strongly unfavorable opinion of him.",
    "Mr. Fetterman maintains a strong lead in support among progressives and a slight lead among moderate voters, with Mr. Lamb within 10 percentage points among moderates.",
    "The Republican U.S. Senate primary, meanwhile, is still anyone’s race, with 43% of voters still undecided on which candidate they’ll support, according to the poll.",
    "This is a representative sample of Pennsylvania’s nearly 8.73 million registered voters, in which Democrats have a slight registration edge over Republicans.",
    "Franklin & Marshall researchers polled 785 registered Pennsylvania voters by phone or online, including 356 Democrats, 317 Republicans and 112 independents.",
    "Mr. Oz received a higher unfavorability rating than Mr. Trump — only 18% of GOP voters said they had unfavorable feelings toward the former president.",
    "Mr. Lamb, however, jumped by only 2 percentage points between the March and April F&M polls, from 15% in March to 17% in April’s poll.",
    "“It’s really clear right now that no one in the Republican gubernatorial or Senate races is really catching fire,” Mr. Yost said.",
    "Mr. Yost said the poll may help Mr. McCormick’s campaign make the case that Mr. Oz is not well liked among Republican voters.",
    "Approximately 17% of voters said they’d support Mr. Lamb, while only 4% said they’d support state Rep. Malcolm Kenyatta.",
    "Gillian McGoldrick: gmcgoldrick@post-gazette.com or on Twitter @gill_mcgoldrick\nFirst Published April 14, 2022, 2:00am",
    "Still, 66% of Republican voters said they were still making up their minds on who they’d vote for in May.",
    "Most of the poll was conducted before former President Donald Trump endorsed Mr. Oz on Saturday.",
    "It’s still unclear whether Mr. Oz will pick up support from the endorsement, Mr. Yost said.",
    "On the flip side, Mr. McCormick is still unknown by 50% of voters, according to the poll.",
    "“With the kind of money the McCormick campaign has spent … that’s, like, wow.",
    "“The poll shows he’s got some things to overcome there,” Mr. Yost added.",
    "Republican voters still can’t recall who he is,” Mr. Yost added.",
    "Pollsters spoke with participants from March 30 through Sunday.",
    "The poll has a sample error of 4.2 percentage points.",
    "“[Fetterman] seemed to solidify his advantage.",
    "Pennsylvania Lt. Gov."
  ]
}