{
  "id": 6947,
  "mediaId": 2803,
  "date": "2022-04-12",
  "headline": "The Senate Race That Could Decide Democrats’ Future",
  "image": "https://compote.slate.com/images/127b6c6d-6d23-441f-b537-3f550d7af12f.jpeg?width=780&height=520&rect=4331x2887&offset=0x0",
  "link": "https://slate.com/news-and-politics/2022/04/pennsylvania-senate-primary-fetterman-lamb-democrats.html?via=rss",
  "mediaOutlet": "Slate.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Harris",
  "authorUrl": "https://slate.com/author/mary-harris",
  "termIds": [
    2709,
    2164,
    3989,
    4080,
    1489,
    392,
    6520,
    6001,
    6506,
    6512
  ],
  "sentences": [
    "He endorsed Bernie Sanders in 2016, and he’s going on this progressive path for Democrats—the idea that you rally your liberal base by being firm on issues like the $15 minimum wage—while arguing that he can go out and win back some of these white working-class voters who left the Democratic Party and went to Trump.",
    "“If you win Pennsylvania, there’s a good chance you’re going to be winning a lot of other swing states as well.” On Tuesday’s episode of What Next, I spoke with Tamari about the Senate race that will help decide whether Pennsylvania is a new predictor for where national politics currently stands.",
    "It was notable to me that Lamb released an attack ad that Fetterman was a self-proclaimed “socialist,” since Lamb himself has been so vocal about how Republicans have harmed Democrats by attacking them as socialists and the people behind defund the police.",
    "If you admit that Florida seems to be solidly GOP country now, “then Pennsylvania is the swing state with the most electoral votes right now,” explains Jonathan Tamari, who covers politics for the Philadelphia Inquirer.",
    "He’s gone and worked the rooms of party leaders, and he’s worked activists like Black clergy members in Philadelphia, and is counting on that to help him overcome Fetterman’s big financial and name-ID advantages.",
    "It’s considered a bellwether for a lot of communities: an East Coast urban core in Philadelphia, a Midwestern Rust Belt vibe in Pittsburgh, and other regions that feel like Appalachia.",
    "It’s notable to me that Fetterman has so much more money than Conor Lamb, and he’s raising money from within Pennsylvania, versus another candidate who has some PACs going for him.",
    "He’s got tattoos, one of which is Braddock’s ZIP code, another of which represents the death dates of people who were killed in Braddock when he was mayor.",
    "That’s what’s going to overcome the headwinds that they face: that he’s a hardcore Democrat liberals will be excited to come out for even in a down year.",
    "He seems to be this interesting mix of a couple of different kinds of Democrat: He’s from Philadelphia, he’s black, he’s gay, and he’s quite progressive.",
    "That’s when his campaign talks like, Hey, we’ve got ordinary voters who don’t just like Fetterman but are opening up their checkbooks to give him money.",
    "And will he become less popular once someone puts millions of dollars of attack ads going through his record on TV, because he’s never faced that yet?",
    "He had a bunch of union workers with him, and he won three congressional races in districts that are either very Republican or slightly Republican.",
    "Jonathan Tamari: Let’s start with John Fetterman, who the lieutenant governor and, by all accounts, the significant front-runner at this point.",
    "He probably knows there’s not much upside to socialist label in Pennsylvania, at least when you’re running statewide in such a swing state.",
    "He’s got this persona of being a no-nonsense guy who doesn’t look like a regular politician, who’s not scripted like a normal politician.",
    "The zany nature of the crowded Senate race in Pennsylvania, which has no incumbent, has a lot to do with the Keystone State’s importance.",
    "He’s been an elected official for a little while, so it’s not like he’s a random doctor who’s carpetbagging in from New Jersey, right?",
    "It takes a lot of enthusiasm for somebody to take all those steps to send them your money when you can just click a link on something.",
    "In fact my colleague has written a story about how Fetterman’s getting a lot of money from people physically mailing him checks.",
    "If we’re the party that’s worried about gun violence, I live in a community where gun violence is a real present risk.",
    "Lamb is racking up endorsements from big union and party officials and hoping they will influence voters to help him.",
    "He ran as this moderate Democrat, and the only national figure he brought in to help him win that race was Joe Biden.",
    "He’s also got this message of saying: If we’re the party of working class, I grew up in a working class family.",
    "Fetterman, by all accounts, has a pretty significant lead of 20 percentage points or more, per some polls.",
    "He elevated his platform by serving as the mayor of Braddock, a really small city outside of Pittsburgh.",
    "And now the caveat is that a lot of the polling also shows there’s a fair number of undecided voters.",
    "But Fetterman’s got more money to communicate, so right now, he’s definitely in the driver’s seat.",
    "So he’s this image of a blue-collar guy, even though he grew up in a fairly well-off family.",
    "He has not been able to raise a lot of money for his campaign, which is the big challenge.",
    "In 2018, he won a special election in a district that had gone almost 20 points for Trump.",
    "If we’re the party that cares about student debt, I actually have student debt.",
    "So that is clearly a sign that he is resonating with a certain group of voters.",
    "His opponents keep saying, he can’t win, he’s too risky, but he’s in the lead.",
    "He wears gym shorts all the time, including when the president comes to visit.",
    "There’s one more Democratic candidate I want to talk about: Malcolm Kenyatta.",
    "In some ways, he and Fetterman share some things, but they’re also different.",
    "The question is, is Fetterman popular just because he has a particular image?",
    "The Fetterman response is he’s the guy who’s going to excite Democrats.",
    "When he launched his campaign, he went to a Pittsburgh union hall.",
    "But I don’t know that Pennsylvania voters see Fetterman as risky.",
    "That is kind of his rebuttal to the argument that he can’t win.",
    "Lamb is really gunning to paint Fetterman as somehow risky.",
    "Our conversation has been edited and condensed for clarity.",
    "Fetterman also does seem to have a broad range of support.",
    "Which brings us to Conor Lamb, Fetterman’s main opponent.",
    "But people have been impressed by how hard he’s worked.",
    "How would you sort the candidates out there right now?",
    "Does Fetterman call himself a socialist, though?",
    "Lamb is much more in the historic Biden mold.",
    "Get more news from Mary Harris every weekday.",
    "Mary Harris: Let’s start with the Democrats.",
    "Is that usual, to have someone so far out?",
    "Kenyatta would represent the AOC strain.",
    "I know the primaries are not until May.",
    "Where do you place him in the contest?",
    "Does that ever happen these days?",
    "What’s the difference to him?",
    "He calls himself a populist.",
    "Is this contest close?",
    "I mean, very rarely.",
    "He’s got a goatee.",
    "Not in a primary.",
    "View Transcript",
    "He does not."
  ]
}