{
  "id": 8328,
  "mediaId": 6570,
  "date": "2022-04-07",
  "headline": "An ad supporting Conor Lamb sparked a backlash for wrongly calling John Fetterman a 'self-described democratic socialist'",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/Election-2022-Senate-Pennsylvania-Democrats-1649383448.jpg",
  "link": "https://www.post-gazette.com/news/politics-state/2022/04/07/An-ad-supporting-Conor-Lamb-sparked-a-backlash-for-wrongly-calling-John-Fetterman-a-self-described-democratic-socialist-1/stories/202204070174",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Terruso",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We expect stations across the commonwealth to follow suit and pull this ad, which is full of lies.”\nThe ad cites an NPR article in calling Mr. Fetterman a “self-described democratic socialist,” but the article was corrected to make clear Mr. Fetterman has never actually described himself that way.",
    "“It’s not often that an attack ad starts airing AND gets pulled from TV for being false in the very same day, but ... this ad from Conor Lamb’s super PAC is not only demonstrably false, it’s desperate, and frankly sad,” Fetterman campaign spokesperson Joe Calvello said in a statement.",
    "Perhaps most alarming for Mr. Lamb, the campaign arm for Senate Democrats, which was already seen as likely to stay on the sidelines in the primary, signaled it won’t get involved in a race where Mr. Lamb badly needs to change the dynamic.",
    "“And if Conor Lamb wants to stand up as a Democrat, then he needs to disavow that ad today.”\nSen. Gary Peters, D-Mich., who chairs the Democratic Senatorial Campaign Committee, said there are no plans to get involved in the primary.",
    "Throughout the race, Mr. Lamb has campaigned as the kind of moderate Democrat who can win a big, politically divided state like Pennsylvania — a profile similar to Democrats like President Joe Biden and Sen. Bob Casey.",
    "“The hope is that the ad sparks positive publicity ... but by being sloppy in how they made the ad, Lamb’s super PAC shot itself in the foot,” said J.J. Balaban, a Philadelphia-based Democratic strategist.",
    "At a debate Sunday, Mr. Lamb said the socialist label would “stick” to Mr. Fetterman more so than other Democrats because of his past support for Bernie Sanders’ presidential campaign and Medicare for All.",
    "And certainly that’s what we have in Pennsylvania, particularly with the top two candidates.”\nMr. Fetterman’s campaign blasted the ad, and WPVI, the ABC affiliate in Philadelphia, took it off the air.",
    "Within a day of the ad airing, PolitiFact and Factcheck.org called it false, a Philadelphia TV station took it off the air, and Sen. Elizabeth Warren, D-Mass., called on Mr. Lamb to disavow it.",
    "The PAC behind it, led by veteran Democratic strategists including James Carville, is trying to raise big money to help Mr. Lamb bridge yawning deficits in fund-raising and campaign surveys.",
    "The group has put $800,000 behind airing the ad so far in the Philadelphia, Wilkes-Barre, and Pittsburgh media markets, according to AdImpact, which tracks political advertising.",
    "Super PACs, which can accept unlimited donations but cannot coordinate with campaigns they support, often take signals from those candidates about what messaging to use.",
    "A super PAC backing U.S. Rep. Conor Lamb’s Democratic campaign for Senate in Pennsylvania made its first real foray into the race this week — and it didn’t go well.",
    "John Fetterman, the Democratic front-runner, a “self-described democratic socialist,” drawing ire from national Democrats and rebukes from fact-checkers.",
    "The 30-second spot aims to paint Mr. Fetterman as a socialist who would be a risky candidate for Democrats in the general election.",
    "And Mr. Lamb has argued Mr. Fetterman is too progressive to win the seat being vacated by retiring Republican Sen. Pat Toomey.",
    "“If I have candidates that can win the general election, we’re not going to put our thumb on the scale,” he told Politico.",
    "The ad also calls him “a silver-spoon socialist,” a quote from former Pennsylvania GOP chair Val DiGiorgio.",
    "In November, Mr. Lamb tweeted: “If you want a Senator who runs as a Socialist ... I’M NOT YOUR GUY.",
    "That’s not how you beat Republicans.” He later acknowledged he was referring to Mr. Fetterman.",
    "(At least eight other news outlets published articles describing Mr. Fetterman that way.)",
    "Mr. Lamb’s campaign didn’t immediately respond to requests for comment Thursday.",
    "And the ad made a big splash — just likely not in the way the group intended.",
    "The group, Penn Progress, launched an attack ad that wrongly called Lt. Gov.",
    "And the ad does mirror some of Mr. Lamb’s own criticisms of Mr. Fetterman.",
    "It is wrong and it is disgusting,” Ms. Warren told Politico on Wednesday.",
    "Erik Smith, who heads the PAC, did not comment on the backlash.",
    "“I saw the PAC ad that is currently running in Pennsylvania.",
    "First Published April 8, 2022, 2:01am",
    "“Bottom line: We just have to win."
  ]
}