{
  "id": 8373,
  "mediaId": 2680,
  "date": "2022-04-09",
  "headline": "Fetterman, Democrats confront a newly hostile Senate primary",
  "image": "https://s.hdnux.com/photos/01/25/10/75/22318947/3/rawImage.jpg",
  "link": "https://www.sfgate.com/news/article/Fetterman-Democrats-confront-a-newly-hostile-17069449.php",
  "mediaOutlet": "sfchronicle",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MARC LEVY",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "But, he said, it's probably better to deal with it now, instead of in the general election campaign, to give people “a chance to come to grips with it.”\nA Franklin & Marshall College poll in February found that Fetterman appeared to have an early lead in the Democratic primary, but many voters were undecided.",
    "BOALSBURG, Pa. (AP) — Voters are digesting a newly hostile Democratic primary race for Pennsylvania's open U.S. Senate seat as the top candidates came together Saturday, face to face, for the first time since Conor Lamb first attacked rival John Fetterman in earnest.",
    "Fetterman, Pennsylvania's lieutenant governor, has been on the defensive, after a week of attacks by Lamb and a third candidate, Malcolm Kenyatta, as well as by a super PAC supporting Lamb that is running a TV ad statewide accusing Fetterman of being extreme.",
    "Fetterman, however, told the crowd he would only run a “positive campaign.”\n“My commitment to you is that if you’ve entrusted any of your resources to our campaign, not one dollar of that will ever be weaponized against a fellow Democrat,\" Fetterman said.",
    "On Friday, Kenyatta confronted Fetterman at an online forum hosted by a progressive group over the 2013 incident, calling it “a type of vigilante justice.” Fetterman countered that he made a “split second” decision in the interest of public safety.",
    "Saturday's crowd of Democrats — a blue dot around Penn State's main campus in a sea of Republican-dominated central Pennsylvania — was a blend of voters who have settled on either Fetterman, Lamb or Kenyatta, and some who are undecided or leaning.",
    "With just over five weeks until the May 17 primary, Democrats are jockeying for the nomination to try to succeed retiring Republican Sen. Pat Toomey in perhaps the party's best chance nationally to pick up a seat in the closely divided Senate.",
    "Peter Buck, a Kenyatta supporter who works at Penn State's Sustainability Institute, said he expects Democrats will move on after the primary, “because we have a Democracy to save and a climate to save, and we as Democrats know that.”",
    "Many have seen the TV ad or read about criticism of Fetterman over a 2013 incident when, shotgun in hand, he confronted someone who he believed to be involved with gunfire on a street nearby Fetterman’s home in Braddock.",
    "Patty Stephens, who serves on her municipal board, has long supported Kenyatta, but worried that should Fetterman win the primary, he “is carrying a lot of baggage that will be weaponized against him” by Republicans.",
    "Smith said he viewed Lamb and Fetterman as having basically the same positions, and is leaning toward Fetterman as the best candidate to win back blue-collar voters that Democrats have lost.",
    "Lydia Vanderbergh, who works for Penn State's Sustainability Institute, said she is deciding between Lamb and Fetterman, seeing them as the most electable Democrats in November’s election.",
    "Saturday was the first time that Fetterman and Lamb have crossed paths after Lamb changed the tone of the race barely a week ago by attacking Fetterman on Twitter over the 2013 incident.",
    "Neither Lamb nor Kenyatta made any reference to Fetterman in their remarks to a crowd of about 200 Penn State-area Democrats in a hotel ballroom just outside State College.",
    "Lamb criticized Fetterman in other ways, including calling him a “flip-flopper” because Fetterman changed his position on natural gas drilling in recent years.",
    "The national party has not gotten involved in Pennsylvania's primary race this year after doing so twice before — in 2010 and 2016 — in a bid to beat Toomey.",
    "At Saturday's event, nobody who decided to support Fetterman or is thinking about supporting him said the attacks were affecting their decision making.",
    "Her questions for them are about moving on from planet-warming fossil fuels in the age of climate change — Pennsylvania is the nation’s No.",
    "Steven Smith, a retired professor of piano at Penn State, is leaning toward supporting Fetterman, and worries about the attacks.",
    "Lamb and Kenyatta raised the issue again at a Muhlenberg College forum last Sunday that Fetterman didn’t attend.",
    "2 natural gas producer — and what they are doing to reach out to voters in rural Pennsylvania.",
    "Some are concerned about what the attacks will mean for Fetterman's prospects in November.",
    "Attendees on Saturday didn't view Fetterman as extreme, or even as liberal as Kenyatta.",
    "“If you wanted to harm a Democrat, you can write a check to the RNC.",
    "They’re much better at it and they’re much more efficient at it.\""
  ]
}