{
  "id": 8434,
  "mediaId": 8489,
  "date": "2022-04-09",
  "headline": "Fetterman, Democrats confront a newly hostile Pa. Senate primary",
  "image": "https://whyy.org/wp-content/uploads/2021/02/AP_john_fetterman_PA_020721.jpg",
  "link": "https://whyy.org/articles/fetterman-democrats-confront-newly-hostile-senate-primary/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Levy",
  "authorUrl": "",
  "termIds": [
    4080,
    3989,
    2709,
    392,
    1033,
    1489,
    6630,
    6506
  ],
  "sentences": [
    "But Fetterman did, telling the crowd that he would only run a “positive campaign.”\n“My commitment to you is that if you’ve entrusted any of your resources to our campaign, not one dollar of that will ever be weaponized against a fellow Democrat,” Fetterman told the crowd.",
    "Voters are digesting a newly hostile Democratic primary race in Pennsylvania’s premier contest for U.S. Senate, as the leading candidates came together in a room Saturday, face to face, for the first time since Conor Lamb first attacked rival John Fetterman.",
    "Fetterman, Pennsylvania’s lieutenant governor, has been on the defensive, after a week of attacks by Lamb and a third candidate, Malcolm Kenyatta, as well as a super PAC supporting Lamb that is running a TV ad statewide accusing Fetterman of being extreme.",
    "Neither Lamb nor Kenyatta made any reference to Fetterman in their remarks to a crowd of about 200 Penn State-area Democrats in a hotel ballroom just outside State College.",
    "The accusation marks a sharp escalation in tone between candidates vying for the Democratic nomination for a critical Senate seat in the May 17 primary.",
    "Steven Smith, a retired professor of piano at Penn State, is leaning toward supporting Fetterman and said he worries about the attacks.",
    "But, he said, “it’s probably good for Conor to bring it up now instead of waiting for the general (election) for it to get out.”",
    "4 weeks ago\nSome in the crowd said they don’t take kindly to a Democrat who attacks another Democrat.",
    "Others said they understand it is part of politics."
  ]
}