{
  "id": 8501,
  "mediaId": 8254,
  "date": "2022-04-09",
  "headline": "Donald Trump endorses Mehmet Oz for Pennsylvania’s US Senate seat",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/04/AP22092665449618.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/donald-trump-endorses-mehmet-oz-for-us-senate/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    0
  ],
  "sentences": [
    "In his endorsement on Saturday Trump called the former television personality “brilliant and well-known” and that Oz has his “complete and total endorsement.”\n“I believe that Mehmet Oz will be the one most able to win the General Election against a Radical Left Democrat,” said Trump.",
    "Pennsylvania Democratic Party spokesperson Jack Doyle issued the following statement:\n“Trump’s endorsement in the Pennsylvania GOP primary, which is already one of the nastiest and most expensive in the country, is only going to escalate this chaotic Republican-on-Republican brawl.",
    "Sands responded to the endorsement on Saturday night, tweeting in part, “Pennsylvania can’t risk sending another weak-kneed RINO to Washington DC to represent us.”\nGet the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "I’m ready to bring an America First agenda to the Senate for Pennsylvania.”\nIn a recent WHTM/Emerson College Polling/The Hill poll of 1,000 likely Republican Pennsylvania voters, McCormick finished first in the Senate race with 17.8%, followed by Oz with 16.6%.",
    "The 61-year-old former cardiothoracic surgeon highlighted how he went to medical school at the University of Pennsylvania School of Medicine and earned a business degree from the Wharton School of the University of Pennsylvania.",
    "“They care much more for what I stand for than where I’m from.”\nOz recently submitted a public financial disclosure report that includes over $100 million worth of assets and properties in at least four states.",
    "The New York Times reports that Fox News host Sean Hannity pushed Trump to endorse Oz despite several of the former President’s advisors now working for Senate candidate Dave McCormick.",
    "In short, tonight Trump poured gasoline on the garbage fire that is this Republican intra-party fight.”\nFour candidates remain in the Democratic Party’s Senate primary with Lt.",
    "Dr. Kevin Baumlin dropped out of the race shortly after the poll was released (despite receiving 9%), Alexandria Khalil finished with 2.8% support, and 37.3% were undecided.",
    "Seven candidates are currently in the Republican primary race, including Trump’s former Danish ambassador Carla Sands, Fox News contributor Kathy Barnette, and former Lt.",
    "McCormick interviewed with Trump in 2016 for a possible position in his administration and has been endorsed by Parnell and former Trump Secretary of State Mike Pompeo.",
    "Oz previously served as a member of the President’s Council on Sports, Nutrition and Fitness and has run campaign ads featuring Trump’s appearance on The Dr. Oz Show.",
    "In a WHTM/Emerson College Polling/The Hill poll released in March, 61% of Pennsylvania Republican voters said they would vote for a Trump-endorsed candidate.",
    "(WHTM) – Former President Donald Trump has endorsed Dr. Mehmet Oz in the hotly-contested race to represent Pennsylvania in the United States Senate.",
    "“If that’s the biggest criticism against me, I’m in good shape,” Oz told abc27’s Dennis Owens during a March campaign visit to a Harrisburg diner.",
    "A criticism brought against Oz by campaign opponents has been his residency, with people questioning whether he’s from Pennsylvania.",
    "More than 25% said an endorsement would make no difference and 13.2% said it would make them less likely to support a candidate.",
    "The 61-year-old also holds dual citizenship with Turkey but has vowed to renounce it should he be elected to the Senate.",
    "“I am honored to receive President Trump’s full support and endorsement, and I thank him for that,” said Oz.",
    "The Pennsylvania Democratic Party released a statement Saturday evening reacting to Trump’s endorsement.",
    "Congressman Conor Lamb received 10% support and State Representative Malcolm Kenyatta received 7.6%.",
    "Stay up to date on the latest from abc27 News on-air and on the go with the free abc27 Mobile app.",
    "“President Trump knows how critical it is to change the kinds of people we send to Washington.",
    "Trump has not yet endorsed a candidate in the race for Governor in Pennsylvania.",
    "Nearly 33% of voters said they were undecided in the Republican Senate race.",
    "Governor John Fetterman receiving 33.4% in the March WHTM poll.",
    "Pennsylvania’s primary election will be held on May 17.",
    "“I’m very proud that I’m a Pennsylvanian,” said Oz.",
    "If elected, Oz would be the first Muslim U.S.",
    "Senator and likely the wealthiest.",
    "Governor candidate Jef Bartos.",
    "Sign up here."
  ]
}