{
  "id": 857,
  "mediaId": 8437,
  "date": "2022-02-19",
  "headline": "Christine Flowers: Why I’m pro-choice (when it comes to masks)",
  "image": "https://www.dailylocal.com/wp-content/uploads/2022/02/flowers-1.jpg?w=1024&h=1365",
  "link": "https://www.dailylocal.com/2022/02/19/christine-flowers-why-im-pro-choice-when-it-comes-to-masks/",
  "mediaOutlet": "southernchestercountyweeklies.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christine Flowers",
  "authorUrl": "https://www.dailylocal.com/author/christine-flowers/",
  "termIds": [
    0
  ],
  "sentences": [
    "Two years after the fact, they are continuing to demand that we all fall in line to serve their particular idea of “safety,” and they are essentially using the courts to say “if you don’t wear a mask, you want to kill my child.”\nNever mind the fact that their children are perfectly free to attend school bubble wrapped with a straw sticking out for a breathing apparatus.",
    "I was on Amtrak this week, heading to an asylum hearing in Newark, and because Mayor Pete and the Department of Transportation have decided that all federal facilities and organizations must require masking, I had to have an ineffective piece of cloth on my nose, over my mouth and around my chin.",
    "I can promise you that during my almost two=hour train ride, that mask did as much traveling as I did:It shifted around, it sank below my lips, it got tangled in my eyeglasses and my earphones, and generally showed just how useless it really is in preventing the next plague.",
    "Alas, the triggered parents, aided and abetted by their totalitarian cohorts on local school boards in Pennsylvania, have decided to take a different tack in trying to keep us masked forever, until the lambs are separated from the lions, or the rapture, or whatever.",
    "These anonymous parent-plaintiffs with their hypothetical and medically vulnerable children are using those kids (and really, we have no idea who they are and how they live) to shame the rest of the commonwealth into hiding behind useless cloth paraphernalia.",
    "Most Popular\nAt Pennsylvania Cannabis Festival, thoughts turn to legal recreational marijuana use and all its possibilities\nMorning Briefing: 12-year old child dead in murder-suicide; Another community hospital may be closing; Bad signs for 76ers after loss",
    "Recently, after two years of complying with a lot of questionable governmental regulations that changed with the “science” or as I like to call it, Tony Fauci’s bowel movements, we have decided to allow adults to make some decisions for themselves.",
    "So two years after the fact, some school districts are beginning to issue “Mask-Optional” policies, which allow adults to make their own decisions about whether to mummify their children, or keep them in a perpetual cocoon of anxiety.",
    "However, I will follow whatever mandates have been put in place, because unlike the great civil “disobedients” of history like Rosa Parks and John Lewis, I am not willing to put my body on the line because of governmental stupidity.",
    "There is so little evidence that cloth masks work, the only way that you can justify an overall mask mandate is if you fit every child with a surgical mask glued to their tiny faces from 8 a.m. until dismissal time.",
    "Apparently, that is a huge problem for some parents in Pennsylvania school districts, who are faced with the horrific prospect that their fragile, tender, susceptible children will be exposed to folks like me.",
    "And so the places that have been the petri dishes for this horrific experiment in social engineering by the “Believe the Science Except When We Tell You Not To” crowd, the schools, have started to react.",
    "This reminds me of when the abortion rights lobbyists decided to use RICO, the anti-racketeering statute developed to stop organized crime, to prevent pro-life protestors from picketing clinics.",
    "And while no one is suggesting that there be a ban on masking, which would take the “choice” away from Americans, a lot of us want to end the ban on breathing, which mask mandates facilitate.",
    "This is especially true when I see people who pull down a governmental paycheck like Lieutenant Governor and erstwhile Senate candidate John Fetterman hanging out in public without a mask.",
    "Some anonymous parents (because having the courage of your convictions is out of style these days,) have filed suit against the districts who have issued mask-optional policies.",
    "You do not get to misuse legislation meant to protect people who truly do have life-threatening conditions and dangerous illnesses to make some kind of social statement.",
    "Wolf and reminded him that he works for all of us, not just for the most timid and freaked out of our citizens, severely limited his executive emergency authority.",
    "Let’s allow the kids who want to wear masks to wear them, and those who really like looking at the bottom halves of their classmates’ faces, to do that too.",
    "This has outraged the type of person most invested in the mask industry, people like public school teachers, virtue signaling baristas and employees at CNN.",
    "Most schools have already done that, with filtering systems, hand-washing stations, social distancing and even plastic shields between seats.",
    "Here is where they start messing around with legislation meant to protect disabled Americans: The Americans With Disabilities Act (ADA.)",
    "The CDC has admitted that cloth masks, the ones most widely used, are ineffective against the virus, particularly the Omicron variant.",
    "They don’t like losing the control they had, to make their neighbors “behave.”\nUsing the ADA is really a despicable way to do it.",
    "By that I mean I wear them when I’m forced to do so by some misguided governmental fiat, but when I do, I don’t wear them well.",
    "I remember a 1970s commercial for Pierre Cardin with a jingle that became an earworm: “You wear it well.” I don’t wear it well.",
    "I remember how many liberals wanted the schools to remain shut forever, and have the computer teach their little ones.",
    "They want to force these schools to mandate masks, even on children whose parents have made a different choice.",
    "The ADA requires that you make “reasonable accommodations” to protect those who have illness or disability.",
    "It is the most elegant of middle fingers wagged in the collective faces of Pennsylvania taxpayers.",
    "They treated grandmothers with rosaries as if they were John Gotti and his blood-splattered crew.",
    "No one is telling them that they have to send their children into the plague-filled environment.",
    "And here is the truly disgusting part, the dishonest, unethical, immoral part.",
    "I’ll wear a mask in stores that require it, or just choose not to shop there.",
    "These stupid, insulting and outrageous lawsuits need to be dismissed, now.",
    "Now they want the schools opened, but only according to their diktats.",
    "The amendment to the Pennsylvania Constitution that slapped down Gov.",
    "That being said, when there is no mask mandate, I am not wearing one.",
    "They are dependent on the good will and common sense of adults.",
    "I’m really sorry, but that’s not the way this country works.",
    "I’m going to out myself here, in print: I am a Bad Masker.",
    "So, I’ll wear a mask on the train, and grumble about it.",
    "They’ve made water drinking into a synchronized sport.",
    "They’ve reduced the number of children in classrooms.",
    "So again, I do not wear it well, I am a Bad Masker.",
    "It’s dangerous when you start misusing the law.",
    "I’ll wear a mask on a plane, and do the same.",
    "These lawsuits, on the other hand, are not.",
    "It’s time they started seeing some of it.",
    "Her column appears Sunday and Thursday.",
    "Email her at cflowers1961@gmail.com.",
    "Virtual schooling is an option too.",
    "Yay, choice for thee, and for me.",
    "Christine Flowers is an attorney.",
    "My respiratory system, my choice.",
    "Kids don’t have these choices.",
    "That’s reasonable enough.",
    "Anything less is useless.",
    "They’ve canceled recess.",
    "What happened to that?"
  ]
}