{
  "id": 869,
  "mediaId": 2790,
  "date": "2022-02-22",
  "headline": "Pennsylvania Democrats are angling to distinguish themselves in a key Senate contest",
  "image": "https://media.npr.org/assets/img/2022/02/21/ap_22043717838019_wide-48991383177343b32c220093b9eabb53dd6232f5.jpg?s=1400",
  "link": "https://www.npr.org/2022/02/22/1082158009/pennsylvania-democrats-are-angling-to-distinguish-themselves-in-a-key-senate-con",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Don Gonyea",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "But call Lamb the centrist candidate in the race and he replies like this: \"I'm not really big on the term centrist because when I hear centrist, what I think of is someone who just looks at where the two extremes are and jumps in the halfway point regardless of what they actually believe,\" Lamb said.",
    "He describes himself as a strong supporter of President Biden's agenda, especially the infrastructure plan that passed with bipartisan support and the Build Back Better proposal, which has not passed and includes funding for home health care and for the transition to jobs in clean energy industries.",
    "\"And my experience is that I've beaten Republicans three times in a row in tough districts and under a big spotlight, and so, you know, I've been making the case that that qualifies me to be the one to carry our banner this year.",
    "Kenyatta says that he'll campaign all across the state and that he'll rally Democrats wherever they are, but he also stresses that he's the one who can drive turnout in the state's urban areas, especially with the Black vote.",
    "But Congressman Lamb is another contender, a moderate Democrat who represents a western Pennsylvania district where he has shown he can win in a place that's closely divided between Democrats and Republicans.",
    "Fetterman, who was elected to his statewide post in 2018, describes himself as a progressive but says things he supported years ago, like a $15 minimum wage, are now the mainstream of the Democratic Party.",
    "\"It's about your life experiences and what it means to have to look your kids in the eyes, as my parents had to look me in the eyes, and say, 'Baby, I don't know what we're going to do this week.'",
    "And I also think my work in Congress and especially my votes in Congress on many of the most important issues give people a little bit of certainty about how I would perform as a senator.\"",
    "Fetterman, a former small-town mayor from western Pennsylvania, is the early front-runner in a competitive Democratic primary that includes Rep. Conor Lamb and state Rep. Malcolm Kenyatta.",
    "Uncertainty and anxiety\nThe Republican side of the Senate race is just as unsettled as the Democrats', especially after Trump's pick dropped out and celebrity Dr. Mehmet Oz jumped in.",
    "When it comes to driving out the impurity in the party in terms of, like, the Liz Cheneys and the Adam Kinzingers, they are ruthless and united because they do not tolerate dissent.",
    "In an NPR interview, Lamb stressed how he differs from centrist Sen. Joe Manchin of West Virginia; for example, the congressman supports getting rid of the legislative filibuster.",
    "There was also a sense of anxiety among Democrats at the start of a midterm election year when historic trends show that the party that holds the White House takes a beating.",
    "And I'm like, 'because you have rooms like this, and you have people that have the same core values and same issues as you do,' \" Fetterman told NPR in an interview.",
    "The Senate seat, left open by the retiring Republican Pat Toomey, is a prime pickup opportunity for Democrats and could determine control of the chamber next year.",
    "John Fetterman was at a brewpub in Pennsylvania's Trump Country that was serving coffee to about 60 local Democrats who showed up on a Saturday morning.",
    "But Republicans can't vote in a Democratic primary, and Pennsylvania Democrats aren't banking on many votes from the other side in the general election.",
    "His stump speech is also informal and short and hits topics important to working-class voters: broadband, a living wage, access to health care.",
    "Later in the day, more than 100 people showed up for a Fetterman event at a fire hall in Smethport in the northern part of the state.",
    "Kenyatta points to his roots\nThe third leading Democrat is Kenyatta, who represents North Philadelphia in the Pennsylvania House.",
    "Former President Donald Trump lost Pennsylvania in the 2020 election but carried the rural parts of the state by wide margins.",
    "And ultimately, Lamb says, his résumé and his record make him the one who can beat a Republican in the fall in Pennsylvania.",
    "Another thing Fetterman promises is that he'll be tough on Republicans and that he can play hardball as well as they can.",
    "\"Because I inhabit so many different communities,\" he said, \"we're going to be well-positioned to bring people together.",
    "And ... when you know what it's like to be treated differently because of who you are, you think about that in policy.\"",
    "\"I think the overriding issue in the primary is simply who can stand a chance to win the general election,\" he said.",
    "\"You know, I have things I really believe in, and I've been campaigning on them and voting for them for four years.\"",
    "The drive there rolled past countless signs and banners reading \"Trump-Pence,\" \"Trump 2024\" and \"Impeach Biden.\"",
    "\"When it came to blocking Merrick Garland's appointment to the Supreme Court, they were united and ruthless.",
    "\"It is going to be critical that we have massive, massive turnout in southeastern Pennsylvania,\" he said.",
    "He's 6-foot-8, with tattoos, a shaved head and a chin beard, and he listens to heavy metal in his truck.",
    "Despite the cold, his campaign wardrobe on the Saturday was shorts and an oversized Carhartt sweatshirt.",
    "The Democrats were thrilled the lieutenant governor and U.S. Senate candidate was in the rural area.",
    "Francis Auriemmo voted for Trump but says he's open to supporting Fetterman in the general election.",
    "And if he had that much energy for his own town, he just might have that much energy for the state.\"",
    "This story was produced by Samantha Balaban and Gabriel Dunatov and edited by Ed McNulty for radio.",
    "\"When it comes to achieving a goal that they want, [Republicans] are united and ruthless,\" he said.",
    "For us, we understand that our story is grounded in a reality that so many other people share.\"",
    "Kenyatta would also be the first statewide officeholder who's a member of the LGBTQ community.",
    "Lamb's Facebook profile describes him as \"Marine, prosecutor, patriot, Catholic, Democrat.\"",
    "\"And if you don't show up and you don't engage, then who else are they going to listen to?\"",
    "The brewpub stop was in Clarion, Pa., about an hour and a half northeast of Pittsburgh.",
    "\"No, not enemy territory,\" Fetterman replied, \"just friends we haven't met yet.\"",
    "The Fetterman events mostly drew supporters of him or people leaning that way.",
    "\"Being a working person is not about dressing a certain way,\" he told NPR.",
    "And why can't Democrats embrace that philosophy but for working families?\"",
    "\"We need to continually make more and more stuff in our country,\" he said.",
    "And being in the middle of Trump Country up here, it's a little bit scary.",
    "\"Just his thoughts on revitalization, that shows promise,\" Auriemmo said.",
    "Lamb stresses electability\nFetterman has raised the most money so far.",
    "But many said they don't yet know which Democrat they'll vote for.",
    "He has also made legalizing marijuana a key part of his platform.",
    "Speaking to him, one local jokingly called it \"enemy territory.\"",
    "\"Now it's my understanding, when he was mayor, he did do a lot.",
    "\"And some folks would say, 'Why would you waste your time?'",
    "He's also running in hopes of seeing two barriers crumble.",
    "In appearance and style, Lamb and Fetterman are opposites.",
    "Take Marty Wilder, chair of the McKean County Democrats.",
    "He wants to be Pennsylvania's first Black U.S. senator.",
    "Fetterman's image is that of the anti-politician.",
    "There was at least one Republican present, too.",
    "He, too, has his eye on working-class voters.",
    "He says that's the community he grew up in.",
    "\"I'm terrified, in all honesty,\" she said.",
    "I don't know where the country's going.\"",
    "The Pennsylvania primaries are in May.",
    "\"I just fundamentally believe that.\"",
    "I don't know what's going to happen.",
    "\"I can just see what's going on.",
    "I'm honest."
  ]
}