{
  "id": 8726,
  "mediaId": 2732,
  "date": "2022-04-09",
  "headline": "Pittsburgh artist Tom Mosser announces art exhibit showcasing large portraits",
  "image": "",
  "link": "https://triblive.com/local/pittsburgh-artist-tom-mosser-announces-art-exhibit-showcasing-large-portraits/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JoAnne Klimovich Harrop",
  "authorUrl": "https://triblive.com/author/joanne-harrop/",
  "termIds": [
    0
  ],
  "sentences": [
    "I see them as faces unmasked.”\nSubjects include Mosser’s fiancée Mara Lorusso, a physical therapist assistant and now a rehab liaison; former Mayor Bill Peduto (with his beard); concert promoter Rich Engler and wife Cindy; “Pittsburgh Dad” Curt Wooten and his baby; Manchester Craftsmen’s Guild founder William Strickland Jr.; dancer and choreographer Maria Caruso; and Pennsylvania second lady Gisele Barreto Fetterman (wife of Lt. Gov.",
    "“This is a long meditative process as I must allow the paintings to dry overnight.”\nMosser describes his work as “the drawing style of Bernie Fuchs, the drip painting method of Jackson Pollock and the color palette and design elements of Pittsburgh icon Andy Warhol.”\nMosser includes symbolisms related to the subjects such as the patterns of Marine Corps camouflage uniforms and the design of a Ukrainian flag.",
    "“Tom’s art is incredible,” said Cory Bonnet, director of arts corridor for Pittsburgh Gateways Corporation, an organization that works with start-ups, private ventures, and community-based initiatives that connect economic development to underserved neighborhoods, located in the Energy Innovation Center.",
    "Another one is planned for May of steel foundry patterns – just in time to welcome the Association for Iron & Steel Technology conference being held at the David L. Lawrence Convention Center, Downtown.",
    "There are broadcasters, a filmmaker, a tennis coach, dentists, a singer, dancer, cancer survivors, a Ukraine native, individuals with disabilities, single parents, and health care workers.",
    "Mosser, who lives in Pittsburgh’s East End and has a studio in Etna, uses a circular “loop” technique and a flow technique with bold colors of acrylic and house paint.",
    "It’s perfect for what I want to be a celebration of Pittsburghers and Pittsburgh itself … and our rise from a challenging two years.”\nMosser began the project in 2019.",
    "The 70 larger-than-life portraits created by Pittsburgh artist Tom Mosser will be showcased on June 18 at Energy Innovation Center in the Hill District.",
    "Mosser discovered the venue when David Motley, a Pittsburgh businessman and Gateways Corporation board member and one of the subjects, suggested it.",
    "A hallway and adjacent room with 40-foot ceilings encompassing more than 15,000 square feet will be filled with faces of Pittsburghers.",
    "“When I take a photo very often you can see me in the reflection of their eyes, which I love,” Mosser said.",
    "He took photographs of friends and began painting their faces on 5’ 8” x 4’ 8” pieces of canvas.",
    "“When you collaborate with others it makes what you are doing even bigger.”\nYes, really big.",
    "It’s incredible.”\nMosser chose people of various ages, nationalities and walks of life.",
    "“It is so important to collaborate,” said Bonnet, an oil painter and preservationist.",
    "People may also recognize his work from various national sports arenas and events.",
    "Categories: AandE | East End | Hill District | Local | Art & Museums | Pittsburgh",
    "Every person has a story to be celebrated.”\nNone of the work will be for sale.",
    "“I hover over the canvas as the paint spills from a rod or a funnel,” he said.",
    "Originally scheduled for March 2020, it was postponed because of the pandemic.",
    "You can contact JoAnne at 724-853-5062, jharrop@triblive.com or via Twitter .",
    "“The building was a revelation to me,” said Mosser, of Tom Mosser Design.",
    "His beloved golden retriever Lucas will be memorialized in the show.",
    "“Seeing all of these friendly faces will be a positive experience.",
    "He utilizes wood portions of brushes and incorporates funnels.",
    "The faces will be displayed in the center for three weeks.",
    "JoAnne Klimovich Harrop is a Tribune-Review staff writer.",
    "Hours will be from noon to 3 p.m. and 6 p.m. to 10 p.m.",
    "“Really Big Faces” will be the first guest exhibit.",
    "Each look is created from a hand-sketched drawing.",
    "Subjects have what he calls “the Mona Lisa” smile.",
    "The location has spectacular views of Downtown.",
    "I want each and every portrait to convey that.",
    "“Tom is so talented,” Barreto Fetterman said.",
    "He has done more than 1,600 self-portraits.",
    "It looks just like the photo he took of me.",
    "“We are all visualizing a brighter future.",
    "“Really Big Faces” has a really big space.",
    "An in-house art show was held in October.",
    "“His paintings are so accurate.",
    "“It’s an absolute dream space.",
    "The event is free.",
    "John Fetterman)."
  ]
}