{
  "id": 9175,
  "mediaId": 2644,
  "date": "2022-03-19",
  "headline": "Why ex-hedge funder Dave McCormick is beating Dr. Oz in US Senate run",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/dave-mccormick-dr-oz-senate-race.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/19/why-dave-mccormick-is-beating-dr-oz-in-us-senate-run-for-pa/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Salena Zito",
  "authorUrl": "",
  "termIds": [
    4905,
    5049,
    2440,
    1724,
    2765,
    2802,
    4540,
    1489,
    6506,
    6520
  ],
  "sentences": [
    "The world’s complicated and we need people who understand business, understand the world, understand the military and I am not going to back away from my experiences in any of them.”\nLike the race for Virginia governor last November, in which GOP candidate Glenn Youngkin won by focusing on current issues like the economy, education and crime, this Senate race is all about Biden’s record and the future and nothing to do with Trump or the past.",
    "His approach is wildly different to Dr. Oz, who is known for breezy tour de forces that often leave voters feeling like they had visited the set of “The Ellen DeGeneres Show.”\n“There was a lot of show and music with Dr. Oz,” said Eric Lasure, a supervisor at Guy Chemical and a Mennonite pastor, after both men came to events in his hometown of Somerset Township.",
    "When he returned to the US, he earned a doctorate from Princeton, ran an online auction service in Pittsburgh, served as President George W. Bush’s undersecretary of the Treasury for international affairs, and then finally became CEO of hedge fund Bridgewater Associates in Connecticut from 2020 to 2021.",
    "“They want to trust what you are saying is a value you hold and not something you say just to win.”\nBorn in Washington, Penn., 30 miles outside of Pittsburgh, McCormick’s family moved when he was seven to Bloomsburg, Penn., where his father took a job as the president of the local university.",
    "Once a “reluctant bystander,” McCormick said he finally threw his hat in the ring as the economy plummeted, the politics of the pandemic became untenable, the border crisis deepened, and he felt the military had gone astray, especially after the country’s exit from Afghanistan.",
    "Today, as he faces a group of 100 grassroots Republicans at Mac’s Route 8 Café, he launches straight into his life story — from West Point grad to undersecretary in the George W. Bush administration to hedge-fund CEO — and why all that has led him to run for Senate.",
    "I want you to ask me the questions you tell your spouse after you leave that you wished you would have asked.”\nIn the crowd were Deborah Young and her husband, Ed Nesbel, who have gone to events hosted by the other candidates, including Dr. Oz.",
    "To underscore this point, McCormick ran a 30-second Super Bowl commercial last month, blasting rising inflation and the disastrous pullout from Afghanistan, amid the sound of crowds chanting “Let’s go Brandon” (code for “F–k Joe Biden”).",
    "McCormick, who entered the race for Pennsylvania’s open Senate seat in mid-January, has shot from mere unknown to the top of the polls by traveling across the state in his charcoal pickup truck, meeting voters in every single county.",
    "Expect this to be not just one of the most expensive races in the country this year, but also one the most important,” said G. Terry Madonna, political science professor at Millersville University.",
    "A father of four from his first marriage, in 2019 he married Dina Powell, who previously had served as the deputy national security adviser for strategy under former President Donald Trump.",
    "“Look, I know you all have some tough questions to ask me about who I am, why I am running and how I came to my belief systems, and might feel embarrassed to do so,” he said to the group.",
    "“The border doesn’t stay at the border, it comes to our hometowns, cities and schools in the form of opioids and meth and crime and we can’t just stand here and do nothing,” he said.",
    "“That is a tall task in a 67-county state, but we have already gone to 38 since mid-January and we are not stopping until we visit several communities in each county,” he told me.",
    "“That is nice and all, but I need to know if a candidate shares my values before I give them my vote,” Lasure said, adding that he is leaning McCormick’s way.",
    "But, despite Dr. Oz’s fame and name recognition, McCormick is the frontrunner, besting Oz by 9 points (24% to 15%), according to a recent Fox News poll.",
    "When he came home, he talked to local law enforcement and rehabilitation specialists about how drug trafficking has impacted people in the state.",
    "A gifted student athlete, the young McCormick excelled at football, wrestling and academics, all of which helped him win a place at West Point.",
    "Gifted with a broad smile, vigorous handshake and sharp wit, people rarely turn him away when he tells them he is running for US Senate.",
    "“First, they are becoming a force that has a sustainability focus and a social engineering focus, as opposed to a war fighting focus.",
    "The second thing is that we’re not innovating quickly enough.”\nTwo weeks ago, he toured the border between Yuma, Ariz., and Mexico.",
    "Oz has been hitting him nonstop with ads, accusing McCormick of being in bed with China — a notion the former CEO finds ridiculous.",
    "“I ran a global business that invested in 20 countries, China was one of them, about 2% of all of revenue was in China,” he said.",
    "While Biden narrowly beat Trump for the state’s electoral votes in 2020, voters overwhelmingly chose Republicans down ballot.",
    "Young admits she was impressed by Oz’s stage presence, but she found herself drawn to McCormick’s down-to-earth charm.",
    "Which is why McCormick feels strongly he can beat one of the three Democrats in the general election this November.",
    "Opponents have criticized McCormick for being a recent Connecticut resident as well as for his hedge-fund past.",
    "Also vying for the Senate’s GOP nomination this May is TV personality Dr. Mehmet Oz along with three others.",
    "(McCormick still owns the family Christmas-tree farm in Bloomsburg, which also now grows soy and corn).",
    "“Nothing he said was a laundry list of talking points that he had memorized,” said Young of McCormick.",
    "I’ve negotiated at the highest levels of our government against China and gone toe to toe with them.",
    "Both parties desperately need this Pennsylvania seat to control the balance of power in the Senate.",
    "“He is a warrior, a happy warrior, despite everything that is going on in the world,” Nesbel said.",
    "— David McCormick starts most days talking to strangers before the sun is barely up.",
    "After meeting with McCormick, the couple left with a sign supporting him for Senate.",
    "That kind of concern for both country and state resonates with Young and Nesbel.",
    "“I like his dedication to service to country and his optimism about the country.",
    "“There are two things going on in the military that I’m worried about,” he said.",
    "“After I left West Point I went to the 82nd Ranger School, Gulf War,” he said.",
    "And the number of registered Democrats in Pennsylvania is dwindling, too.",
    "Earning voters’ support “is something sacred,” McCormick, 56, told me.",
    "Just two years ago, Democrats had an extra 813,885 registered voters.",
    "In 2022, the couple moved from Connecticut back to Pittsburgh.",
    "“Republicans need to hold it and Democrats need them not to.",
    "That experience dealing with China is a point of strength.",
    "In Pennsylvania, voters are gradually leaning right.",
    "We need strong leaders who understand the economy.",
    "(The Current Democratic front-runner is Lt. Gov.",
    "It’s something we rarely hear in politics.”",
    "McCormick has done it through plain talk.",
    "Now, that lead has dwindled to 580,320.",
    "“Listen, I was a global businessman.",
    "I did business all around the world.",
    "John Fetterman.)",
    "“Well, don’t.",
    "BUTLER, PENN."
  ]
}