{
  "id": 947,
  "mediaId": 2592,
  "date": "2022-02-16",
  "headline": "Pennsylvania's Moderate Democrat Lamb Distances Himself From Manchin",
  "image": "https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2022/02/16/pa-senate-candidate-lamb-campaigns-in-montgomery-county.jpg",
  "link": "https://www.ibtimes.com/pennsylvanias-moderate-democrat-lamb-distances-himself-manchin-3402866?utm_source=Public&utm_medium=Feed&utm_campaign=Distribution",
  "mediaOutlet": "IBTimes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jarrett Renshaw",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The Senate seat that Fetterman, Lamb and state Representative Malcolm Kenyatta are seeking the nomination for is seen by nonpartisan election analysts as the most competitive Senate contest ahead of the Nov. 8 midterm elections, since its current occupant, Republican Pat Toomey, 60, plans to retire at the end of his term.",
    "Locked in a tight nominating race with the Northeastern state's progressive lieutenant governor, John Fetterman, the moderate Lamb has drawn comparisons to Manchin, a conservative Democratic Senator from neighboring West Virginia who has routinely acted as a roadblock to Democratic priorities in Congress.",
    "History and Biden's sliding approval rating favor Republicans' chances of winning back control of at least the Senate or the House of Representatives, which would give them the power to block the Democratic president's legislative agenda for the last two years of his four-year term.",
    "The senator -- whose state voted overwhelmingly for Republican Donald Trump for president in 2016 and 2020 -- has also offered some advice:\n\"All they need to do is, we have to elect more liberals,\" he told reporters in September.",
    "During a weekend chat with Democratic voters at a coffee shop in Philadelphia suburb Jenkintown, Lamb noted that he voted for President Joe Biden's sweeping $1.75 trillion Build Back Better spending bill, which Manchin blocked.",
    "Manchin and fellow conservative Democratic Senator Kyrsten Sinema of Arizona both lined up against those policies, blocking Democrats who control the 50-50 Senate due to Vice President Kamala Harris' tiebreaking vote.",
    "He is trailing Fetterman, 52, in the few public opinion polls on the race and is significantly behind in fundraising ahead of the May 17 primary election, when Democrats will pick their nominee.",
    "Manchin, whose office did not respond to a request for comment, has defended himself from liberal criticism, saying he has never been a progressive Democrat and doesn't plan on becoming one.",
    "\"We're basically two votes away on that long list of priorities, and that's what the Senate campaign is really about,\" Lamb said, without explicitly identifying the two senators.",
    "\"Some Democrats, like Manchin, who are refusing to reform the filibuster, are telling us that allegiance to a flawed Senate rule is more important to them than democracy itself.",
    "Congressman Conor Lamb has a message to Pennsylvania Democrats who wonder whether he is liberal enough to represent them in the U.S. Senate: He is no Joe Manchin.",
    "Chris Borick, a political science professor at Pennsylvania's Muhlenberg College, said Lamb's pitch to voters is that he would be electable in November.",
    "He also said he supported ending a Senate practice called the filibuster that Republicans have used to block votes on voting rights and other issues.",
    "They're wrong,\" Fetterman wrote in an opinion article on CNN.com last year, one of many times he has directly chided the West Virginia senator.",
    "I am a Pennsylvania Democrat, which means focusing on labor and working-class issues, which has been a good recipe for winning statewide.\"",
    "\"And the sweet spot is, look, you know there is a place for Joe Manchin in the Democratic Party, but I am not Joe Manchin.",
    "Asked in a recent interview whether he thought Manchin was a Democrat, the state representative responded, \"Occasionally.\"",
    "Lamb, 37, served in the U.S. Marines and as a federal prosecutor before he was first elected to Congress in 2018.",
    "Manchin endorsed Lamb for his 2020 congressional bid and has helped him raise money.",
    "Kenyatta, 31, has criticized Manchin in speeches and social media posts.",
    "\"He's trying to find the sweet spot,\" Borick said.",
    "His rivals have more directly criticized Manchin."
  ]
}