{
  "id": 9724,
  "mediaId": 2872,
  "date": "2022-03-30",
  "headline": "Pennsylvania is ground zero for 2022’s ugliest Senate races",
  "image": "https://imgix.bustle.com/uploads/image/2022/3/29/b0ec3b9f-a5e1-40db-a81b-a73b9b94289f-pa-senate-lead.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg",
  "link": "https://www.mic.com/impact/pennsylvania-senate-dr-mehmet-oz-conor-lamb",
  "mediaOutlet": "Mic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    4958,
    4080,
    4412,
    3989,
    392,
    542,
    1433,
    6506
  ],
  "sentences": [
    "Beyond the significant pall the former president already casts on most Republican races across the country, his presence — or, so far, lack thereof — is felt all the more acutely in Pennsylvania, where hedge fund manager McCormick’s deep ties with the Trump administration (his wife, Goldman Sachs partner Dina Powell, is a former Trump official) has come head to head with Melania Trump’s personal preference for Oz, as each candidate vies for the political blessing of their party’s de facto leader.",
    "Clockwise from top left: Jeff Swensen/Getty Images; Bill Clark/CQ Roll Call; Alexi Rosenfeld/Getty Images; Tom Williams/CQ-Roll Call, Inc via Getty Images; Dewey Saunders\nHard as it may be to believe, we’re coming up on two years since Joe Biden soundly defeated Donald Trump for the White House, ushering in an impossibly narrow Democratic Senate majority in the process.",
    "“For Conor Lamb to have a path in the primary, this dynamic needs to change.”\nIt’s a somewhat baffling charge given how regularly and unapologetically Fetterman trumpets many of his progressive bona fides, including backing Medicare-for-All, federal cannabis legalization, and a $15 minimum wage — something Lamb also supports.",
    "And while it would be folly to say that as go the Pennsylvania primaries, so too will go the rest of the country without exception, it’s nevertheless worth keeping an eye on these four campaigns, each with their own peculiarities and picadillos, as bellwethers for where things are headed in 2022 — and possibly beyond.",
    "Compared to Lamb, the sort of ur-centrist Dem perfectly suited to sit comfortably in the middle of the road until he’s flattened by a semi, John Fetterman has stomped unapologetically onto the political scene as a legal weed-loving, union-boosting everyman who eschews suits and ties for shorts and hoodies.",
    "That Trump’s endorsement is still forthcoming is likely both the product of that tension within the MAGA-verse, as well the fact that the former president already gave a Pennsylvania Senate endorsement to Sean Parnell — only for Parnell to drop out of the race after allegations of domestic violence.",
    "For Democrats, that schism is embodied by Rep. Conor Lamb, a moderate and middling congressman who went from federal prosecutor to congressman on a platform of being against new gun laws and decriminalized pot, but for more risky bank investments with their customers’ money.",
    "Oz, for his part, has also dabbled in a slightly more acceptable form of GOP nativism, attacking McCormick for his business ties to China in an echo of the xenophobic anti-Asian sentiment whipped up by the Trump administration during the height of the coronavirus pandemic.",
    "McCormick’s wife, herself an Egyptian-born Coptic Christian, also reportedly helped her husband pitch his candidacy to Trump by showing the former president pictures of Oz wearing traditional Muslim headdresses and claiming that Oz’s faith was a political liability.",
    "And with Trump notoriously gun-shy about lending his name to candidates who could lose their races, it seems as if any new endorsement might still be a ways out — at least until it becomes clear whether McCormick or Oz actually stands a chance in the general.",
    "Adding another depressing layer to this already fraught dynamic is the Republican Party’s penchant for nativist xenophobia, which has fed the McCormick camp’s criticisms of Oz — who holds both American and Turkish citizenship — for having dual loyalties.",
    "In that time, Biden has enjoyed a decidedly mixed bag of results from his slim control of Congress, with a handful of self-absorbed, grandstanding members of his own party preventing him from fully leveraging the Democrats’ congressional majority.",
    "In terms of first impressions, the two could not be more different, and in terms of polling, the same holds true: According to the Lamb-backing super-PAC Penn Progress, Fetterman currently enjoys an astonishing 30-point lead in the polls.",
    "And it doesn’t mean that it’s going to work.”\nThe Pennsylvania GOP race is just as indicative of the Republican Party’s current split, with half their ranks still in the throughs of Trumpian addiction to celebrity and extremism.",
    "“[Fetterman] is not adopting a lot of the litmus tests that you have seen progressives try to urge upon candidates,” Adam Jentleson, the executive director of the leftist Battle Born Collective consultancy group told WBKN.",
    "And perhaps nowhere are the stakes for the midterm races felt more acutely than in Pennsylvania, a frustratingly purple state that could well end up the fulcrum for which party will control the upper chamber come 2023.",
    "That’s why I think the label doesn’t quite fit.”\nNevertheless, real or constructed, Fetterman’s persona is — at least for now — propelling him into a commanding lead that could very well turn the Democratic race ugly.",
    "Both Democrats and Republicans are gearing up for a messy set of primary races to determine who will replace retiring GOP Sen. Pat Toomey — and in each case, the race is a distillation of broader intra-party schisms.",
    "Democrats are largely — but not exclusively — expected to lose control of one if not both chambers of Congress, thanks to an ugly nexus of bad election year circumstances and a suite of tough races for Democrats.",
    "“Lamb,” Balaban explained, “looks certainly more like a traditional politician,” while Fetterman “presents as someone who is different.”\nStill, that difference is not quite as clear cut as it may seem at first.",
    "Ultimately, both primary races — centrist insider vs. leftist “outsider,” and celebrity agitator vs. ultra-wealthy businessman — will be decided by voters in the coming months.",
    "There, disgraced TV physician Dr. Mehmet Oz is gunning hard to close a 9-point gap between himself and former George W. Bush administration official Dave McCormick.",
    "The differences, Pennsylvania Democratic strategist J.J. Balaban told The Daily Beast recently, seems more about posturing than politics.",
    "It’s even more confusing when, aside from a few specific exceptions, he and Fetterman are more alike in terms of policies than not.",
    "“He’s managing to cross over into normie world in a way that I don’t think you’ve seen from other so-called progressives.",
    "“If you’re Conor Lamb, it’s hard to see how he makes up the [polling] gap without going negative,” Balaban predicted.",
    "“[P]rimary voters don’t yet see Fetterman as the liberal he is,” a memo by the PAC, obtained by Politico, reasoned.",
    "Biden’s circumstances are set to become considerably more difficult after November.",
    "The purple state is a perfect encapsulation of national politics right now.",
    "He might hope someone else does it for him.",
    "Still, he added, “he might not do it."
  ]
}