{
  "id": 9885,
  "mediaId": 6571,
  "date": "2022-04-02",
  "headline": "Senate Candidate John Fetterman To Miss Primary Election Debate This Weekend",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/03/12/8e8d7786-81e1-4dfa-ac4c-cac3a78ce025/thumbnail/1200x630/90707e4dc1cde9f8caf21059bff12685/C2405198ADFC40D789445677C0D2D273.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/john-fetterman-missing-senate-debate/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Conor Lamb is accusing rival John Fetterman in Pennsylvania's Democratic U.S. Senate primary of skipping candidate forums to avoid talking about a 2013 incident when, shotgun in hand, he confronted a Black man because he suspected the man was involved in gunfire nearby.",
    "Fetterman, Pennsylvania's lieutenant governor, has insisted he isn't skipping forums for any such reason, and has repeatedly maintained that he was acting as a mayor concerned for public safety and confronted the man, not knowing his race.",
    "In a letter to The Philadelphia Inquirer last year, Miyares — writing from state prison, where he is serving time in an unrelated case — insisted that Fetterman knew he was Black and not only pointed the shotgun at him, but also loaded it.",
    "\"The people of Braddock understand that, as the town's mayor and chief law enforcement officer, John was acting to keep his community safe,\" Rebecca Katz, an adviser to Fetterman's campaign, said in an email.",
    "The man — Christopher Miyares, who is Black — was unarmed and said in a TV interview afterward that he had been jogging when Fetterman, who is white, pulled up in his pickup and pointed the shotgun at him.",
    "pic.twitter.com/eiGx1Yoqz8\n— Conor Lamb (@ConorLambPA) March 31, 2022\nThe accusation more directly inserts issues of race into a campaign that could hinge on which candidate appeals to Black voters.",
    "Kenyatta, a state lawmaker, said the situation could have ended badly for Miyares as a Black man and that an apology from Fetterman would show people that he understands he may have made a mistake.",
    "On Thursday night, Lamb, a third-term congressman, took to Twitter to raise the episode, which has bubbled just below the surface of a primary campaign that previously had been relatively cordial.",
    "A political action committee that supports Black candidates, including Kenyatta, raised it early last year and used it in advertisements on radio stations popular with Black listeners.",
    "Kenyatta also criticized Fetterman's plans not to attend, retweeting a related article from The Morning Call newspaper with a screenshot of the word \"cowardice\" and its definition.",
    "It might also damage Fetterman and his party with a key voting bloc whose support would be important should he become the Democratic candidate in the general election in November.",
    "https://t.co/UFAoFaGUd2 pic.twitter.com/iqHPGnTPIl\n— Rep. Malcolm Kenyatta (@malcolmkenyatta) April 1, 2022\n(TM and © Copyright 2022 CBS Broadcasting Inc. All Rights Reserved.",
    "He has said he pursued a mask- and goggle-wearing man he saw running nearby, covered head to toe in the cold January weather, pulling out a shotgun until police arrived.",
    "\"For years now, John has failed to apologize for his vigilante behavior and he doesn't even own the fact that what he did was dangerous and wrong,\" Kenyatta said.",
    "The contest to replace retiring Republican Sen. Pat Toomey represents perhaps the Democrats' best opportunity to pick up a seat in the closely divided Senate.",
    "A Franklin & Marshall College poll in February found that Fetterman appeared to have an early lead in the Democratic primary, but many voters are undecided.",
    "Braddock — a town that is about 70% Black — reelected Fetterman 10 months later \"because they know this incident had nothing to do with race,\" Katz said.",
    "The accusation marks a sharp escalation in tone between candidates vying for the Democratic nomination in Pennsylvania's May 17 Senate primary election.",
    "His campaign pointed out Friday that it has agreed to join three televised debates in coming weeks and that Fetterman has joined numerous other forums.",
    "Fetterman has spoken before of how he believed he had heard gunfire while outside his home in the small town of Braddock when he was mayor in 2013.",
    "In an interview Friday, Kenyatta said Fetterman \"needs to leave the candidate protection program and actually publicly debate his record.\"",
    "Fetterman is running for retiring Pennsylvania Senator Pat Toomey's seat -- a seat Democrats hope to flip in this congressional race.",
    "He has previously denied avoiding forums for anything other than legitimate scheduling conflicts or unforeseen family circumstances.",
    "Fetterman's campaign suggested that Lamb, who is white, is raising the encounter now because he isn't breaking through with voters.",
    "\"That's a huge problem when we're picking our nominee for the biggest race in the country,\" Lamb wrote on Twitter.",
    "Kenyatta and Lamb warn that the episode remains a liability for Fetterman, especially if he wins the primary.",
    "Fetterman has missed several forums, including one hosted by a predominantly Black church in Philadelphia.",
    "\"He doesn't want to talk about the fact that he chased down an unarmed Black man and held him at gunpoint.",
    "John Fetterman will reportedly not be attending a primary election debate at Muhlenberg College on Sunday.",
    "He doesn't want to talk about the fact that he chased down an unarmed Black man and held him at gunpoint.",
    "But until Thursday night, a Democratic rival had not used it in such a public way to go after Fetterman.",
    "He also has suggested that Miyares was involved in something untoward that he was running away from.",
    "Fetterman said he didn't know Miyares' race when he got into his pickup truck to pursue him.",
    "However, he also reportedly wrote that the incident should not stop Fetterman's campaign.",
    "\"We all know why John Fetterman isn't coming to the debate on Sunday,\" Lamb wrote.",
    "Fetterman has denied pointing the shotgun at Miyares and said it wasn't loaded.",
    "A third Democrat in the primary, Malcolm Kenyatta, who is Black, echoed Lamb.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "Meanwhile, Fetterman and Miyares have each accused the other of lying.",
    "We all know why John Fetterman isn't coming to the debate on Sunday.",
    "Police never charged Fetterman or Miyares in the matter.",
    "Republicans also have used it to attack Fetterman.",
    "The Associated Press contributed to this report.)",
    "The subject has shadowed the campaign trail.",
    "(AP/KDKA) -- Pennsylvania Lt. Gov.",
    "That's the elephant in the room.",
    "That's the elephant in the room.",
    "And we have to talk about it.\"",
    "And we have to talk about it.",
    "In:\nConor Lamb"
  ]
}