{
  "id": 9934,
  "mediaId": 8254,
  "date": "2022-03-31",
  "headline": "Pa. Senate Primary: Fetterman leads in latest poll, majority undecided",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/AP22064525407815.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/pa-senate-primary-fetterman-leads-in-latest-poll-majority-undecided/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lauren Rude",
  "authorUrl": "https://www.abc27.com/author/lauren-rude/",
  "termIds": [
    4080,
    3989,
    2802,
    2958,
    2709,
    1489,
    1584,
    392,
    1126,
    6506
  ],
  "sentences": [
    "Candidates are eligible to participate in the debate by meeting a set of criteria agreed upon by each of the campaigns, including receiving a minimum of 5% support in an established, professionally conducted nonpartisan poll conducted by a company determined by Nexstar Media Inc. approximately one month before the primary election.",
    "In a statement released on Twitter, Baumlin called his campaign “an amazing and unforgettable journey.”\nIn the breakdown by age, Fetterman leads in all age ranges, with Baumlin not too far behind in the younger groups.",
    "The general election sample consisted of registered voters in Pennsylvania, n=1,069 with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/- 3 percentage points.",
    "While the latest polling has Fetterman in the lead across multiple demographics, as the primary gets closer, it is important to ask: how many Democrats are planning to vote?",
    "It is important to remember that subsets based on gender, age, party breakdown, ethnicity, and region carry with them higher margins of error, as the sample size is reduced.",
    "HARRISBURG, Pa. (WHTM) — A new WHTM/Emerson College Polling/The Hill poll shows John Fetterman leading Democrats ahead of the May 17 primary, but a majority still undecided.",
    "The Republican primary sample consisted of likely voters, n=372, with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/-5.0 percentage points.",
    "The Democratic primary sample consisted of likely voters, n=471, with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/-4.5 percentage points.",
    "Data was collected using a cellphone sample of SMS-to-web, an online panel provided by Amazon MTurk, and an Interactive Voice Response (IVR) system of landlines.",
    "As previously reported by The Hill, analysts believe that Fetterman is pulling ahead in the party’s nominating contest and the latest poll is evidence of such.",
    "The majority of both Republicans and Democrats say that in deciding how to vote, the amount of time a candidate has lived in Pennsylvania is very important.",
    "There are no Democratic candidates living outside the commonwealth, more Democrats (253) said it is very important compared to Republicans (166).",
    "More than half of the Democratic voters believe Pennsylvania runs fair elections (364), which is over 200 more than Republican voters (114).",
    "The poll was conducted from March 26-28, 2022, interviewing 1,069 Pennsylvanians with a margin of error (MOE) of +/- 3 percentage points.",
    "The poll was conducted from March 26-28, 2022, interviewing 1,069 Pennsylvanians with a margin of error (MOE) of +/- 3 percentage points.",
    "In 2022, that’s an especially good thing.”\nPennsylvania’s lieutenant governor received 33.4%, a significant lead over Conor Lamb at 10%.",
    "Among urban/city voters, Fetterman had a double-digit lead over Baumlin and leads by a significant gap among suburban and rural voters.",
    "380 said they are very likely to vote, 91 are somewhat likely, 23 are not very likely and 14 say they are not at all likely to vote.",
    "“Voters don’t have to be convinced that John’s not like other politicians,” said Joe Calvello, Fetterman’s communications director.",
    "Two Republican candidates, Mehmet Oz and Dave McCormick, are in the hot seat for not currently residing in Pennsylvania.",
    "Fetterman’s more significant support, however, is in the older age groups including 50-64 years and 65 years and older.",
    "Baumlin received the second most votes among men (12.9%) and Lamb received the second most votes among females (12.4%).",
    "The Pennsylvania primary is on May 17, 2022.\nabc27 will host the Pennsylvania Democratic Primary Senate Debate.",
    "Caller ID\nThe WHTM/Emerson College Polling/The Hill Pennsylvania poll was conducted from March 26-28, 2022.",
    "The candidates will debate for one hour on Thursday, April 21 at 8 p.m. and will both air and live-stream.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "The data sets were weighted by gender, age, education, race, and region based on 2020 turnout modeling.",
    "However, following the pattern, nearly half of both men and women voters are undecided at this point.",
    "African American voters are largely undecided (55%) and support Fetterman 1.2% more than Kenyatta.",
    "The poll of 508 Democrats shows 37.3% were undecided in who they would vote for this May.",
    "Kevin Baumlin came in third with 9% and Malcolm Kenyatta came in fourth with 7.6%.",
    "White voters support Fetterman significantly more than any other candidate.",
    "Fetterman leads among both male (34.9%) and female (32.6%) voters.",
    "They are the only two candidates to receive double digits.",
    "“They know as soon as they see him step out of his truck.",
    "Baumlin has since dropped out of the race on March 31.",
    "Alexandria Khalil rounded out the top five with 2.8%.",
    "To learn more about the upcoming debate, click here.",
    "Sign up here."
  ]
}