{
  "id": 10985,
  "mediaId": 2520,
  "date": "2022-03-15",
  "headline": "Rep. Debbie Lesko gets Trump's endorsement in bid for another term",
  "image": "https://www.gannett-cdn.com/presto/2018/10/20/PPHX/b92f2e45-3c60-4d12-84ee-b5ff376ca4e1-Trump_Luke_AFB_27.jpg?crop=3399,1923,x0,y218&width=3200&height=1811&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/03/15/rep-debbie-lesko-wins-trumps-endorsement-bid-another-term/7056528001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald J. Hansen",
  "authorUrl": "https://www.azcentral.com/staff/2647673001/ronald-j-hansen/",
  "termIds": [
    4905,
    3083,
    2765,
    3858,
    3702,
    1126,
    339,
    5949
  ],
  "sentences": [
    "\"A strong supporter of our MAGA Agenda, Debbie is working tirelessly to Secure our Border, Uphold the Rule of Law, Defend our Second Amendment, Support our Military and Vets, and Hold the Biden Administration accountable for their absolute incompetence.",
    "Lesko helped offer the White House's view of the case that involved Trump's efforts to pressure Ukrainian President Volodymyr Zelensky into saying that country had opened an investigation into Hunter Biden, the son of now-President Joe Biden.",
    "Trump praised Lesko, R-Ariz., as a \"Conservative Warrior\" and noted her support for the agenda he favors for what seems an all-but-declared third bid for the White House.",
    "Lesko is midway through her second full term in office and is running for another term in a newly drawn, Republican friendly district that covers the Northwest Valley.",
    "\"Congresswoman Debbie Lesko is a Conservative Warrior for the people of Arizona,\" Trump said in a written statement from his Save America political action committee.",
    "Lesko responded in a tweet, saying she was proud to have his endorsement and, \"I'm looking forward to continuing my work to Save America!\"",
    "Former President Donald Trump formally endorsed Rep. Debbie Lesko on Tuesday, giving her campaign a welcome and perhaps unneeded boost.",
    "Lesko's new district is considered safe Republican by the nonpartisan organizations that handicap House races.",
    "Trump's backing is nothing new for Lesko, whom he tapped as an adviser during his first impeachment trial.",
    "She had more than $1 million in cash available at the end of December with no high-profile challengers.",
    "Reach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493.",
    "Subscribe to our free political podcast, The Gaggle.",
    "Debbie Lesko has my Complete and Total Endorsement!\"",
    "Follow him on Twitter @ronaldjhansen.",
    "Subscribe to azcentral.com today.",
    "Support local journalism."
  ]
}