{
  "id": 5261,
  "mediaId": 2621,
  "date": "2022-04-20",
  "headline": "GOP Rep. Mocked for Claiming a Billion Migrants Were Apprehended on Southern Border: This is What Happens When You ‘Ban Math’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-20-at-10.44.56-AM.jpg",
  "link": "https://www.mediaite.com/politics/gop-rep-mocked-for-claiming-a-billion-migrants-were-apprehended-on-southern-border-this-is-what-happens-when-you-ban-math/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Meyer",
  "authorUrl": "https://www.mediaite.com/author/ken-meyer/",
  "termIds": [
    3255,
    3083,
    4905,
    1126,
    1356,
    1394,
    1477
  ],
  "sentences": [
    "https://t.co/qkPzAuWjW2\n— Beau of The Fifth Column (@BeauTFC) April 20, 2022\nThey’re not sending their brightest… https://t.co/COcHkCdCHy\n— Bradley P. Moss (@BradMossEsq) April 20, 2022\nWow, a BILLION people are trying to sneak into the U.S.\nHopefully a few of them are math and geography teachers who could help Congressional reps get to a 4th-Grade-level understanding of the world!",
    "heck, North and South America combined don’t even have 1B humans living here… https://t.co/xhRfpQ6hBI\n— Aki Peritz (@AkiPeritz) April 20, 2022\nThe ridiculous figure cited is larger than the populations of Mexico, all countries in Central and South America, and every Caribbean island put together.",
    "ET: Lesko’s tweet has been deleted, so here’s a screenshot:\nLesko’s errant tweet quickly drew notice and mockery from political observers:\nToday I learned that roughly 15% of the world’s population has been nabbed by border agents while crossing over from Mexico in just the past half-year.",
    "From the report:\nOf the 1.01 million crossings so far this year, roughly 51 percent resulted in the migrant being expelled under Title 42, while the rest were processed under normal immigration procedures, meaning they were either rapidly deported, detained or released to seek asylum.",
    "More than 200,000 of those arrests happened in March, so between these border crossings and a recent influx of immigrants seeking asylum, the U.S. is facing a major migration surge as the Biden administration prepares to roll back Title 42.",
    "https://t.co/BExM9upOSA\n— Justin Baragona (@justinbaragona) April 20, 2022\nIf you think you’re too stupid to do something, just remember that you can fail shapes, colors, and numbers and still get elected to Congress.",
    "Administration officials have acknowledged that revoking the policy is likely to result in a further rise in illegal border crossings, as migrants who want to seek asylum will no longer be blocked from doing so.",
    "The only problem: Lesko went a little too far to the left of the decimal point and said a billion migrants were apprehended at the border, rather than just a million:\nUPDATE – 11:27 a.m.",
    "Title 42 can elevate the total number of border crossings each month, as it encourages some migrants to cross the border repeatedly, who are attempting to enter the country undetected.",
    "1395 comments\nCongresswoman Debbie Lesko (R-AZ) faced social media ridicule after she added a few too many zeroes to her warning about the size and scale of illegal immigration.",
    "The Wall Street Journal published a report this week on how the U.S. has arrested approximately 1 million illegal border-crossers in the last 6 months.",
    "https://t.co/H1wSz7j6FQ\n— Eric Garland (@ericgarland) April 20, 2022\nWhere are we gonna put a billion detainees in our country of 320million?",
    "Even with Title 42 in place, the Biden administration presided over the highest number of arrests made at the border on record last year.",
    "(@grantstern) April 20, 2022\nOver 12% of the earth’s population has tried to cross the US-Mexico border in the past 6 months?",
    "Also if we really had an “open border” (we do not) it’s hard to understand how so many people could be “apprehended” there.",
    "https://t.co/Ow3duUVF5Q\n— Hemant Mehta (@hemantmehta) April 20, 2022\nA billion people at the border apprehended, you say.",
    "https://t.co/muQ1Mk51i1\n— Ari Cohn (@AriCohn) April 20, 2022\nThis is what happens when you ban the math books.",
    "The report caught Lesko’s attention, and the slammed the #BidenBorderCrisis as she posted it on Twitter.",
    "https://t.co/p4fLrCDRfH\n— Aaron Mahnke (@amahnke) April 20, 2022\n4 hours and this is still up.",
    "It almost feels like you just made that number up to incite false fear and drama.",
    "https://t.co/JmQxokRwWa\n— Rep. Don Beyer (@RepDonBeyer) April 20, 2022",
    "Or did they book a transatlantic cruise to Cancun?",
    "https://t.co/g75hzjFRTF\n— Grant Stern is boosted!",
    "Did they fly to Mexico City and walk north?",
    "That means the border is open, you say.",
    "A million, a billion, whatever.",
    "Definitely seems legit."
  ]
}