{
  "id": 626,
  "mediaId": 2658,
  "date": "2022-02-25",
  "headline": "China could be Russia’s key to surviving tech sanctions",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/morning-tech/2022/02/25/china-could-be-russias-key-to-surviving-tech-sanctions-00011702",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "— Commerce talks tough on advanced chips: A senior official at the Commerce Department who briefed reporters Thursday on the condition of anonymity said China “can't compensate Russia for everything that we’re restricting … especially as it relates to production of semiconductors.” The official noted China produces very few high-end microchips — particularly when compared with U.S. allies like Taiwan, South Korea and Japan — and is itself reliant on advanced chips produced or designed elsewhere.",
    "The Commerce official told reporters Thursday that over the coming months, the new technology sanctions mean Russia’s military “will be significantly degraded in its ability to continue to operate.”\n— Putting on a brave face: Several people representing the chip industry, who requested anonymity in order to discuss export controls that had not yet been enacted, told MT in the past week they worry applying the FDPR to entire countries will wreak havoc on the high-tech supply chain.",
    "The Commerce official said Thursday that the U.S. would “impose controls on any countries that facilitate Russia's aggression.”\nA CLOSER LOOK AT NEW TECH SANCTIONS TARGETING RUSSIA: The technology sanctions announced by the Biden administration in response to Russia’s invasion of Ukraine are a massive expansion of the U.S. government’s powers to control high-tech exports, including those coming from other countries.",
    "“I think the House would like to have a formal conference,” said Altenburg, who added that the Senate — which faces a tough fight over a Supreme Court nominee — is “much more nervous about that prospect.” When asked on Tuesday, staffers for Democratic leadership in both the House and Senate would not say whether they preferred a formal or informal USICA conference.",
    "China could be Russia’s key to surviving tech sanctions\nBy BRENDAN BORDELON\n02/25/2022 10:00 AM EST\n Updated 02/25/2022 11:55 AM EST\n 2022-02-25T11:55-0500\nPresented by FTX\nWith help from Steven Overly\nEditor’s Note: Morning Tech is a free version of POLITICO Pro Technology's morning newsletter, which is delivered to our subscribers each morning at 6 a.m.",
    "The rule — which allows Washington to impose export controls on products made outside of the U.S., so long as they contain some U.S.-based components or technologies or were created in part through the use of U.S. software or other tools — had previously been deployed most aggressively against Chinese telecom firm Huawei.",
    "Though both chambers have had their respective bills ready to go since early February, a conference committee was first stalled by a clerical hold-up and now remains delayed by complications related to presidential politics, the escalating Russian invasion of Ukraine and an imminent fight over a Supreme Court nominee.",
    "Send them along via email to our team: Heidi Vogt (hvogt@politico.com), Konstantin Kakaes (kkakaes@politico.com), Emily Birnbaum (ebirnbaum@politico.com), Brendan Bordelon (bbordelon@politico.com), John Hendel (jhendel@politico.com), Rebecca Kern (rkern@politico.com) and Leah Nylen (lnylen@politico.com).",
    "Neuffer said Russia accounts for less than a tenth of a percent of global chip purchases, and that in 2021 its high-tech market only totalled around $50.3 billion in a $4.47 trillion global market (Neuffer said he was citing data from the International Data Corporation, a market research company).",
    "— About that ‘brutal’ conference: The two chambers remain at odds over provisions in USICA about how secure research from foreign espionage, the amount of money needed to fund research in rural regions and the structure of a new applied tech directorate at the National Science Foundation.",
    "Two separate chip executives told MT over the past week that they are concerned the high-tech sanctions targeting Russia could eventually be applied to the Chinese companies with which they do business, upending those connections and causing chaos across the global tech industry.",
    "“If Chinese companies start to just ignore the provisions [and] keep shipping, then they are likely candidates for additional sanctions,” said Kevin Wolf, a former export control official at Commerce who’s now a partner at law firm Akin Gump.",
    "She said those talks included discussions about whether the bills can be passed in time for Biden’s State of the Union address on Tuesday (an all-but-impossible timeline to achieve at this point, especially given the expanding Russia crisis).",
    "Silicon Valley Must-Reads\nICYMI: Rebecca teamed up with our Europe-based colleagues to examine what America’s top tech platforms are doing to halt a flood of Russian disinformation — and highlight where they’re still falling short.",
    "The close cooperation between the U.S. and Russian space agencies thrived long after the 2014 attack on Ukraine — but if a tweet thread from Russia's space chief Dmitry Rogozin is any indication, it’s now on extremely thin ice.",
    "But industry experts say there’s a real risk Russia could replace some of the advanced technologies the Biden administration promises to choke off through new high-tech export controls imposed against the country on Thursday.",
    "Altenburg told reporters there was a “battle” underway between the chambers over whether the conference should be a formal one — which could drag out for weeks — or an informal process worked out quickly between leadership.",
    "— Oh yeah, USICA: The House and Senate have made little progress on reconciling their rival competitiveness bills — and both the Russia crisis and an impending Supreme Court nomination will likely slow things further.",
    "Here’s a few key points:\n— A supercharged Foreign Direct Product Rule: As expected, the Commerce Department reacted to the invasion by issuing controls Thursday on a limited set of high-tech exports to all of Russia.",
    "The measure will restrict a bevy of high-tech components — ranging from chips to telecommunications equipment to sensors — produced in the U.S. or abroad from flowing to entities tied to the Russian armed forces.",
    "“I’ve heard some people say a conference would be brutal,” said Deborah Altenberg, the head of governmental relations at the Association of Public and Land-Grant Universities, in a call with reporters last week.",
    "QUICK FIX\n— Beijing bailout: The tough new tech sanctions Russia faces over its invasion of Ukraine could be dampened by Chinese technology imports — if China is willing to risk U.S. sanctions of its own.",
    "But it took nearly two weeks for the House clerk to send the bill to the Senate — staffers for Democratic leadership in both chambers say America COMPETES was only received on the Senate side on Feb. 17.",
    "“We are in unprecedented territory here,” said Triolo, adding that it’s not clear “how the overall system of integrated global supply chains will react to all of these new pressures.”\n— Warning to China?",
    "... Sarah Morris, director of New America’s Open Technology Institute, will join the National Telecommunications and Information Administration as senior adviser to Assistant Secretary Alan Davidson.",
    "Quick Downloads\nFirst in MT: A new poll from progressive think tank Data for Progress examines Californians’ views on tech regulation, finding most favor tougher rules for the largest tech platforms.",
    "Triolo said Chinese companies could still provide less-advanced chips to Russia, along with “finished items” — think personal computers or smartphones — that will also be cut off by U.S. sanctions.",
    "Cloud cover: With Russian cyberattacks potentially inbound, the Wall Street Journal reports that new Microsoft security chief Charlie Bell is urging companies to adopt cloud computing services.",
    "She most recently was a legislative policy staffer for Rep. Debbie Lesko (R-Ariz.) … YouTube posted a job opening Thursday for a trust and safety policy lead focused on suicide and self-harm.",
    "— But China has more to offer: Paul Triolo, the technology policy lead at consulting firm Albright Stonebridge Group, agreed that China can’t backfill most of Russia’s advanced chip needs.",
    "“The U.S. semiconductor industry is fully committed to complying with the new export control rules,” John Neuffer, the CEO of the Semiconductor Industry Association, said in a statement.",
    "Blockchain for bad: The New York Times explains how the Russian government may utilize cryptocurrencies to skirt new financial sanctions imposed by the U.S. government and its allies.",
    "Tech of the Town\nHOW CHINA COULD HELP RUSSIA CIRCUMVENT NEW SANCTIONS: No one yet knows how far Beijing is prepared to go in support of its burgeoning allies in Moscow.",
    "But, he said, Chinese firms are well-positioned to provide cloud services and enterprise software to replace the U.S. or Europe-based options now in use.",
    "USICA CONFERENCE SET TO BE ‘BRUTAL’ —WHENEVER IT STARTS: Capitol Hill’s big-ticket science and technology legislation is unlikely to go anywhere soon.",
    "— Tightening the screws on Putin’s military: A separate, much tougher application of the FDPR zeroes in on “military end users” residing in Russia.",
    "— Brave new world: We break down those new tech sanctions against Russia and their potential to further undermine global high-tech supply chains.",
    "Follow us on Twitter\nBen Schreckinger @SchreckReports\nDerek Robertson @afternoondelete\nKonstantin Kakaes @kkakaes\nHeidi Vogt @HeidiVogt\nFollow Us",
    "Transitions\nHeather Johnson, formerly acting deputy director in the FTC’s Bureau of Competition, has joined T-Mobile as director for antitrust.",
    "He said approving those transactions would be a “tough decision” for Chinese officials, since they would likely draw sanctions from Washington.",
    "The Senate still needs to craft a “new” bill the House can formally reject before Congress officially kicks off the conference process.",
    "... Jeannine Bender is now legislative director for Rep. David McKinley (R-W.Va.), focusing primarily on health care and telecom.",
    "And those are only the first hurdles to passage, given expectations that a formal conference will require weeks of negotiation.",
    "The POLITICO Pro platform combines the news you need with tools you can use to take action on the day’s biggest stories.",
    "Folks, it’s time to introduce you to Rudy Bordelon — our beagle mix and the widely acknowledged King of the Universe.",
    "— Nightmare scenario: The U.S. tech industry is highly dependent on global supply chains that flow through China.",
    "4521) — a sprawling competitiveness package designed as the lower chamber’s answer to the Senate’s U.S.",
    "It’s a major expansion of the FDPR, which has never been applied to an entire country before.",
    "Send any and all by email to bbordelon@politico.com, or via Twitter DM to @BrendanBordelon.",
    "But on Thursday, some industry lobbyists publicly suggested the sanctions won’t be so bad.",
    "Expect more of him in your inbox going forward, particularly as this craziness continues.",
    "(The executives spoke anonymously to discuss sanctions that had not yet been enacted.)",
    "The world feels like it’s falling apart, and I firmly believe only dogs can save us.",
    "And there are other major sticking points, too, around trade and foreign policy.",
    "Chhaya Kapadia, OTI’s chief of staff, will serve as interim director of OTI.",
    "— Clerical delay: The House passed the America COMPETES Act (H.R.",
    "And don’t forget: Add @MorningTech and @PoliticoPro on Twitter.",
    "And don't forget: Add @MorningTech and @PoliticoPro on Twitter.",
    "Innovation and Competition Act (S. 1260) — on Feb. 4.",
    "Send details to techcalendar@politicopro.com.",
    "Send details to techcalendar@politicopro.com.",
    "Act on the news with POLITICO Pro.",
    "Got an event for our calendar?",
    "Got an event for our calendar?",
    "Tips, comments, suggestions?",
    "Welcome to Morning Tech!",
    "IT’S FRIDAY, FEB. 25.",
    "— A formal occasion?",
    "Team info below.",
    "Anything else?",
    "End of an era?",
    "Thoughts?",
    "Dog pics?",
    "Scoops?",
    "Tips?",
    "TTYL!"
  ]
}