{
  "id": 7302,
  "mediaId": 2572,
  "date": "2022-04-07",
  "headline": "GOP targets Disney's Mickey Mouse copyright, says company 'influencing small children' with 'sexual agenda'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Disney-World.jpg",
  "link": "https://www.foxnews.com/politics/republicans-disney-ceo-oppose-copyright-renewal-political-sexual-agenda",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2479,
    2880,
    4992,
    1126,
    1152,
    1357
  ],
  "sentences": [
    "A senior Disney employee was recently caught on camera saying she wants ‘many, many, many LGBTQIA characters in our stories.’ And according to a Disney employee, Disney’s Diversity Equity and Inclusion department, ‘expanded by an astonishing 633 percent in 2019–21, at the same time that nearly every other department was contracting by 25–75 percent,'\" the lawmakers wrote.",
    "Nearly two dozen lawmakers on the Republican Study Commission (RSC) sent a letter Thursday to Walt Disney Company CEO Bob Chapek, declaring their opposition to renewing the company's copyright on Mickey Mouse, which is set to expire in 2024.",
    "Disney even filmed a movie in Xinjiang province, where officials are currently waging genocide against Uyghur Muslims, then thanked local Communist Party authorities in the movie credits,\" the Republican members wrote.",
    "\"In recent years, Disney has sought to expand business in China by kowtowing to its Communist regime, which is actively engaged in human rights abuses and the theft of U.S. intellectual property.",
    "Joining Reps. Banks on the letter are nearly two dozen Republicans, including Ronny Jackson of Texas, Debbie Lesko of Arizona, Vicky Hartzler of Missouri and Burgess Owens of Utah, among others.",
    "RSC Chair Rep. Jim Banks of Indiana spearheaded the letter, which cites Disney's ties to China and the company's \"political and sexual agenda\" as their reason for opposing a copyright extension.",
    "The Republican lawmakers argue Disney \"has capitulated to far-left activists through hypocritical, woke corporate actions,\" citing the company's opposition to the Florida parental rights bill.",
    "The most recent copyright extension was in 1998 through the Sonny Bono Copyright Extension Act, also known as the \"Mickey Mouse Protection Act\" because of Disney’s intensive lobbying efforts.",
    "The letter concludes that it's \"unfortunate that Disney, once an American success story, has allied with a hostile foreign regime and domestic ideologues who seek to tear our country apart.\"",
    "\"Our Constitution explicitly states copyrights were not intended to last forever, yet Disney’s relentless lobbying indicates they intend to subvert this clause.",
    "Ron DeSantis and Florida legislators floated the idea of revoking the 1967 Reedy Creek Improvement Act, which allows Disney to act as its own government.",
    "This action is part of a recent trend of Republicans taking action against corporations for opposition to Florida’s \"Parental Rights in Education\" Bill.",
    "\"Thank you to the nearly two dozen members of the Republican Study Committee who joined me in pledging to oppose special treatment for Disney.\"",
    "If Disney wants to attack American values and young families, Congress should not reward them,\" Banks said in a statement to Fox News Digital.",
    "The lawmakers noted that \"the Constitution gives Congress the authority to determine the length of time to protect copyrights.",
    "\"Disney has said it wants this law repealed even though it has broad support among Florida residents, especially parents.",
    "\"This suggests Disney is purposefully influencing small children with its political and sexual agenda.\"",
    "Disney has come under increasing political fire for attacking Florida's parental rights bill.",
    "While the bill applies to all copyrights equally, it was passed at the behest of Disney.",
    "Yet Disney’s long history of lobbying on this issue suggests that is its goal.\"",
    "Story tips can be sent to Houston.Keene@Fox.com and on Twitter: @HoustonKeene",
    "Further, it explicitly states that copyrights may not be permanent.",
    "Houston Keene is a politics reporter for Fox News Digital.",
    "Congress also extended copyright protections in 1976.",
    "Disney did not immediately respond for comment.",
    "Last week Florida Gov."
  ]
}