{
  "id": 10702,
  "mediaId": 2573,
  "date": "2022-03-08",
  "headline": "Fox News Poll: McCormick tops Dr. Oz in Pennsylvania GOP senate primary poll",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/dr-oz-david-mccormick.png",
  "link": "https://www.foxnews.com/politics/mccormick-tops-dr-oz-pennsylvania-gop-senate-primary",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5862,
    2540,
    2802,
    1489,
    1131,
    392,
    1126,
    514,
    6506
  ],
  "sentences": [
    "Conducted March 2-6, 2022 under the joint direction of Beacon Research (D) and Shaw & Company Research (R), this Fox News Poll includes telephone interviews (landline and cellphone) with live interviewers among 960 Pennsylvania Republican primary voters and has an overall margin of sampling error of plus or minus three percentage points.",
    "DR. OZ SAYS COVID-19 ‘STEELED’ HIM TO RUN FOR OFFICE, CALLS ON FAUCI TO RESIGN\nWhen choosing their senate candidate, more of these primary voters say economic (59%) and immigration issues (53%) will be \"extremely\" important to their decision than say the same about social issues (38%) or COVID-19 policies (29%).",
    "Former hedge fund CEO David McCormick has a clear advantage in Pennsylvania’s Republican primary for U.S. Senate, including besting television celebrity doctor Mehmet Oz -- although many primary voters remain undecided.",
    "PENNSYLVANIA SENATE CANDIDATE: I'M RUNNING TO CONTINUE TO SERVE VOTERS'\nFormer President Trump is much more popular, with 82% having a favorable view of him -- including 65% feeling \"strongly\" positive.",
    "Randomly selected from a statewide voter file of registered Pennsylvania voters, respondents were screened to identify potential participants in the Republican primary elections.",
    "Primary voters who view Trump favorably are 28 points more likely to be interested in the upcoming election than those with a negative opinion of him (82% vs. 54%).",
    "\"McCormick has a lead and he’s running well across the state,\" says Daron Shaw, a Republican who conducts the Fox News survey with Democrat Chris Anderson.",
    "However, McCormick’s lead is not rock solid: only 22% of his backers are certain they will support him at the ballot box, while 77% may change their mind.",
    "CLICK HERE FOR TOPLINE AND CROSSTABS RESULTS\nMcCormick received endorsements from Texas Sen. Ted Cruz and Trump’s former Secretary of State Mike Pompeo.",
    "Trump hasn’t made another endorsement in the senate primary since his preferred candidate, Sean Parnell, dropped out last November.",
    "Four candidates receive double-digit support: Lou Barletta (19%), Doug Mastriano (18%), Dave White (14%), and Bill McSwain (11%).",
    "Others receive support in the single digits, including Kathy Barnette and Jeff Bartos (9% each), and Carla Sands (6%).",
    "\"But the main feature of the contest right now is that Republican voters have not yet honed in on the candidates.\"",
    "Republican primary voters in the Keystone State have mixed feelings about him: 45% favorable vs. 41% unfavorable.",
    "A Fox News survey of Pennsylvania GOP primary voters finds McCormick tops Oz by 9 points (24%-15%).",
    "In the gubernatorial contest, there’s no clear front-runner to replace term-limited Democratic Gov.",
    "Nearly one-third (31%) are unsure which candidate they will support in the May 17 primary.",
    "It’s notable that 15% of GOP primary voters are unable to rate the two-term senator.",
    "GOP Sen. Pat Toomey announced his retirement in Oct. 2020, creating the open seat.",
    "Nearly twice as many Oz supporters, 40%, feel sure to back him (59% could change).",
    "Oz picked up the backing of Pennsylvania State Sen. Mike Regan in early March.",
    "One-quarter (25%) are undecided.",
    "Tom Wolf."
  ]
}