{
  "id": 15486,
  "mediaId": 8254,
  "date": "2022-03-09",
  "headline": "Petition deadline looms for Pennsylvania candidates",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/062305923D954746679DF81A670A311E-e1646866292271.jpg?w=1280",
  "link": "https://www.abc27.com/pennsylvania-governor-election-2022/petition-deadline-looming-for-pennsylvania-candidates/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dennis Owens",
  "authorUrl": "https://www.abc27.com/author/dennis-owens/",
  "termIds": [
    4215,
    4946,
    1126,
    1489,
    1584,
    1477,
    6506
  ],
  "sentences": [
    "“You’re always gonna get bad signatures so if you don’t have significantly more than the legal requirement you’ll get challenged,” said Charlie Gerow, one of about a dozen Republicans running for Governor.",
    "Governor candidates need to collect 2,000 signatures and at least 100 in 10 different counties and candidates for Lieutenant Governor need at least 1,000 signatures and at least 100 in five counties.",
    "Residents can only sign the petition of one candidate and they must be registered to the candidate’s party, so the potential for a thrown-out signature looms over the candidates.",
    "State Senate candidates must get 500 signatures and State House candidates only need 300, but they can’t start collecting them until a court rules on the districts.",
    "Malcolm Kenyatta, a Democrat running for U.S. Senate, announced last week that he received the necessary signatures to reach the May ballot.",
    "Election law attorney Larry Otter says it’s possible not all of the Republican candidates hit their signature goal, thinning the busy race.",
    "“I expect, quite frankly, that some of the Republican governor candidates are not gonna meet the minimum requirement,” said Otter.",
    "(WHTM) – Candidates across Pennsylvania are approaching their deadline to receive enough signatures to make the ballot on May 17.",
    "Four candidates received between 11-19% with the top two, Lou Barletta and Doug Mastriano, separated by one percentage point.",
    "Candidates have only 19 days to collect the signatures, meaning they need to average 50-100 signatures a day to hit the goal.",
    "Candidates for the U.S. House of Representatives need just 1,000 signatures from within their district.",
    "U.S. Senate candidates also need 2,000 signatures with no restriction on where they can collect them.",
    "The governor race on the Republican side is a toss-up, according to the latest Fox News poll.",
    "Candidates often seek to surpass the goal in case there are challenges in the courts.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "They have until March 15 to hit their goals, less than a week away.",
    "Sign up for the abc27 newsletters here."
  ]
}