{
  "id": 15541,
  "mediaId": 8489,
  "date": "2022-03-09",
  "headline": "Dems formally launch early, aggressive national campaign effort in Pennsylvania",
  "image": "https://whyy.org/wp-content/uploads/2021/05/election-2020-pa-4-1920x1280.jpeg",
  "link": "https://whyy.org/articles/dems-formally-launch-early-aggressive-national-campaign-effort-in-pennsylvania/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Meyer",
  "authorUrl": "https://whyy.org/person/katie-meyer/",
  "termIds": [
    2802,
    3926,
    4081,
    3989,
    392,
    839,
    925,
    6506,
    5949,
    6175
  ],
  "sentences": [
    "Because of that still-open race, party officials said the messaging on the Senate will, for now, remain general: flip a Senate seat and, as Henry said in a statement, “maintain the majority we need to continue to deliver for Pennsylvanians.”\nIn the gubernatorial race, the pitch is more pointed: Shapiro will be a bulwark against the kinds of bills Pennsylvania’s GOP-controlled legislature has been trying to pass for years, like abortion restrictions, narrower voting laws, and measures that would weaken unions.",
    "According to Sheridan, all those people will be “on the doors talking to people face to face…making phone calls, sending texts … There’ll be people tasked with the political side, making sure that the candidates and campaigns have a presence at events in local communities.”\nThe effort is being funded from the national level by the Democratic National Committee, Governors’ Association, and the Senatorial Campaign Committee.",
    "It’s a field, Borick noted, that could produce a nominee who only appeals to one part of the party — for instance, someone like Mastriano, who has championed baseless election fraud theories more vociferously than most other candidates, and was at the Jan. 6 insurrection in Washington, D.C.\n“[Democrats] absolutely would love that,” Borick said.",
    "“There is a sense that the RNC could look at this and say, if Mehmet Oz or Dave McCormick — even someone like Jeff Bartos to some extent — is the nominee, we can significantly scale back our spend in Pennsylvania.”\nHe added that like Democrats, Republicans are waiting to see which candidate emerges from the Senate primary.",
    "“But if they’re out talking to voters … about their positions, and what they’re going to do on their behalf, that is when you can buck the national trend.”\nGenerally, coordinated campaigns kick off closer to the general election — in large part because parties tend to wait until they have a single endorsed candidate.",
    "“I think Democrats are increasingly hoping that that’s the case, that Republican primaries that are pretty crowded produce candidates that might not be the best fit for a general election.”\nLike the Democrats, Pennsylvania Republicans didn’t make an endorsement in the Senate primary.",
    "But Sheridan said he’s confident the Senate and governor’s races are “probably going to be the most expensive races on the Senate and governor’s side in Pennsylvania history.”\nPolitical analysts say it remains to be seen whether these concerted efforts will be effective.",
    "3 months ago\n‘Democrats could be in trouble’\nIt’s political gospel that the first midterm of a new president’s tenure tends to see a lot of tough races for that president’s party, even more so when that party also controls both the House and Senate, as Democrats do now.",
    "Even Democratic party consultants like Jeff Sheridan — a former communications staffer for Wolf who managed the governor’s reelection bid in 2018 — acknowledge that things like low presidential approval ratings affect how candidates do down-ballot.",
    "Democrats in Pennsylvania are trying to make up for an election year filled with political headwinds with a nationally-backed campaign effort, which strategists and political experts say will likely be unprecedented in size, expense, and length.",
    "They include state Senate President Pro Tempore Jake Corman, former congressman Lou Barletta, former U.S. Attorney Bill McSwain, far-right state senator Doug Mastriano, and former Delaware County Councilmember Dave White.",
    "Party insiders on both sides of the aisle, he said, tend to think Lamb — the Pittsburgh-area moderate who came closest to getting the party’s endorsement — might be the most formidable statewide candidate for Democrats.",
    "On Wednesday, after weeks of buildup, the party plans to formally launch its coordinated campaign for Pennsylvania’s wide-open races for governor and U.S. Senate, as well as congressional and other down-ballot races.",
    "Pennsylvania Republican Party officials declined to comment on their own plans to coordinate with national party members on fundraising and messaging, and haven’t publicized much of their thinking to date.",
    "“They’re trying to figure out how much they need to spend.”\nHe noted, there is at least one factor that could lead national Republicans to put less money into the Senate race than Democrats are.",
    "They’re calling the effort “All in Pennsylvania.” It will entail the commonwealth’s Democratic Party working closely with national Democrats on messaging, fundraising, and voter outreach.",
    "“Whether or not people in Pennsylvania who are running for office like it, Joe Biden matters in terms of how voters feel about the direction of the state and the country,” he said.",
    "For one thing, in a year full of high-profile battles to protect vulnerable incumbents, the commonwealth has something unique: two statewide races for seats that have no incumbent.",
    "These coordinated efforts are a routine part of big election years, and similar initiatives are also happening in other states with competitive races, like Georgia and Arizona.",
    "But with rising inflation and President Joe Biden’s generally low — though recently, rising — approval ratings, Sheridan said Democrats just have to work harder than usual.",
    "“This is the first time we’ve seen that in this state in a long time,” said Samuel Chen, a GOP strategist and political science professor at Northampton Community College.",
    "Chris Borick, a pollster and political science professor at Muhlenberg College, said in both the gubernatorial and Senate races, much will depend on the final candidates.",
    "Oz and McCormick both have the ability to put many millions of dollars into their own campaigns, and Bartos also gave himself a couple of million.",
    "Already, Pennsylvania’s coordinated campaign has around 40 volunteers stationed across key regions, including 16 on various college campuses.",
    "The state party declined to say exactly how much money it expects to flow into the coordinated campaign from the state and national level.",
    "The major contenders for the GOP nod are TV doctor Mehmet Oz, former hedge fund CEO Dave McCormick, and real estate developer Jeff Bartos.",
    "“Pennsylvania is going to be the epicenter of the political world in 2022,” said Jason Henry, who heads the Pa. Democratic Party.",
    "John Fetterman are all competing for the nomination, and none of the three had enough support to claim the party’s endorsement.",
    "“Sometimes you get a little lucky to get a candidate on the other side that’s not, you know, ready for prime time,” he said.",
    "“The 2016 race between Toomey and McGinty at the time was the most expensive Senate race in the country,” he said.",
    "Where Democrats have coalesced behind Shapiro, Republicans have a primary field of a dozen or so candidates.",
    "“That’s just a simple reality inside their offices in D.C.,” he said.”\nThat could change before the primary.",
    "“That information, if it’s allowed to exist in a vacuum, then Democrats could be in trouble,” he said.",
    "U.S. Rep. Conor Lamb, fell short, with 159 votes; He would have needed 176 for the endorsement.",
    "Second, and perhaps more important, are 2022’s inherent political disadvantages for Democrats.",
    "But in the Senate race, State Rep. Malcolm Kenyatta, Congressman Conor Lamb, and Lt. Gov.",
    "Philly election officials can only do so much to make elections work without state help.",
    "None of those candidates have had much success distinguishing themselves from the pack.",
    "Chen, the GOP strategist, said he’s expecting a robust effort from the national party.",
    "He used to work for Pat Toomey, and knows how expensive these big races can be.",
    "But it’s very possible that no state will get more money than Pennsylvania.",
    "Attorney General Josh Shapiro is the only serious contender in the field.",
    "But Chen said he knows of at least one factor in this race that won’t.",
    "Two of those things: ballot drop boxes and better poll worker pay.",
    "“They’re getting all their ducks in a row right now,” he said.",
    "“The self-funders are all on the Republican side,” Chen said.",
    "There are two big reasons for that promised investment.",
    "Democrats do have an endorsed candidate for governor.",
    "Things are more chaotic in the gubernatorial race.",
    "“We’re going to see those numbers get blown out.”",
    "But he thinks these challenges are surmountable.",
    "AG Josh Shapiro got the nod for governor.",
    "GOP Sen. Pat Toomey is retiring, and Gov.",
    "Strategists and analysts tend to agree.",
    "2 months ago\nReady for prime time?",
    "Their candidates are rich.",
    "Tom Wolf is term-limited.",
    "It’s going to be pricey.",
    "But not this year.",
    "But not yet."
  ]
}