{
  "id": 1777,
  "mediaId": 8438,
  "date": "2022-02-16",
  "headline": "Letter to the Editor: Dog whistle politics",
  "image": "https://cdn.centraljersey.com/wp-content/uploads/sites/25/2021/10/Letter2Editor.jpg",
  "link": "https://southphillyreview.com/2022/02/16/letter-to-the-editor-dog-whistle-politics/",
  "mediaOutlet": "southphillyreview.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Submitted Content",
  "authorUrl": "https://southphillyreview.com/author/submittedcontent/",
  "termIds": [
    0
  ],
  "sentences": [
    "I am writing to voice my concern over two items you ran in the “Briefs” section of last week’s paper, the first being “Barletta signs education pledge” and the second being “Barletta wants refugee screenings, investigations.”\nI understand the need for opposing views in a local paper, not everyone agrees on politics, especially in South Philadelphia.",
    "My concern is that you do a severe disservice to your readers if you don’t point out to them that this “politician” who is running to be the governor of their state has no qualms about destroying the very foundations this country is built upon.",
    "Also, as far as his first brief, about his bogus “education pledge,” a simple fact check could have been easily added to let your readers know that “Critical Race Theory” is not even actually taught in K-12 classrooms.",
    "This is a dangerous politician who does not believe in democracy, he believes in an autocracy, where you and I have no right to decide who leads our state, or our country.",
    "This is not democracy, this is not good for our state, this is not someone who should be given any space for these thoughts or propaganda in any newspaper.",
    "(https://www.penncapital-star.com/government-politics/trumps-fake-electors-heres-the-full-list/) He has no issues taking away our voice, and our vote.",
    "So having comments from a Republican running for governor, no matter how far from reality those comments are, are of course understandable.",
    "Lou Barletta was one of 20 Republican Party leaders to send in a fake list of alternate electors for this past election (Biden vs. Trump).",
    "This was an attempt by Barletta to subvert the will of the people, and our sacred vote.",
    "But I guess the dog whistle has to be blown, even in the South Philly Review.",
    "This is a country founded in the right for everyone’s voice to be heard.",
    "And this man wants to be the governor of our great state?",
    "– Manuel Dominguez Jr."
  ]
}