{
  "id": 8317,
  "mediaId": 8493,
  "date": "2022-04-08",
  "headline": "PA Headlines: New Senator and Governor Polls, “I Did That” Arrest",
  "image": "https://www.wkok.com/wp-content/uploads/2020/07/SBC-APP-KO-CAR-PLAY-New.jpg",
  "link": "https://www.wkok.com/596764-2/",
  "mediaOutlet": "wkok.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WKOK Staff",
  "authorUrl": "https://www.wkok.com/author/newsroom/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Governor’s Office released an outline of each of the five proposed programs:\nThe PA Opportunity Program, $500 million\n“The PA Opportunity Program would provide much-needed relief to workers and families from the high cost of childcare and household expenses and opportunities to complete a degree, credential, or license that will strengthen their skills and increase income—all leading to a better quality of life.”\nSmall Business Support, $225 million\n“The COVID Relief Statewide Small Business Assistance Program ?would provide grants ranging from $5,000 to $50,000 to small businesses that have been economically impacted by the pandemic.",
    "Wolf visits expERIEnce Children’s Museum to highlight $5 million state investment to help expand the museum\n(WHTM) – WHTM is reporting… A new WHTM/Emerson College Polling/The Hill Pennsylvania primary poll shows Lou Barletta with a razor-thin lead over Doug Mastriano in the race for Governor and a majority of voters still undecided.",
    "Spencer Kimball, Executive Director of Emerson College Polling noted, “McCormick has a strong base of support across most demographics, whereas Oz seems to lack a clear base.”\nRepublicans are still waiting for former President Trump to weigh in on the race and a majority of voters say they would support a Trump-endorsed candidate.",
    "The $1.7 billion PA Opportunity Plan would assist families with child care, job training, broadband, transportation, and afterschool programs The proposal would use $500 million in rescue plan funds to send $2,000 direct payments to Pennsylvania households with an income of $80,000 or less.",
    "Wolf’s $1.7 billion proposal also includes $225 million in support for small businesses, $204 million for direct property tax relief, $325 million for Pennsylvania’s healthcare system, and $450 million to invest in conservation, preservation, and revitalization of Pennsylvania communities.",
    "Wolf announces $1.7B plan for pandemic recovery with direct payments to some Pennsylvanians\n“The cost of everything from gas to groceries is rising, and for Pennsylvanians living paycheck to paycheck that can mean painful decisions,” said Gov.",
    "With undecided voters allocated, Barletta increases his lead to hold 26% support, followed by Mastriano with 22%, White with 14%, McSwain with 12%, Corman with 8%, Hart with 7%, Gale with 4%, Gerow with 4% and Zama with 3%.",
    "PHILADELPHIA, Pa. (WHTM) – WHTM is reporting… Pennsylvania Governor Tom Wolf is pushing his proposed PA Opportunity Plan that would use American Rescue Plan dollars to send direct payments to Pennsylvania residents.",
    "(WHTM) – A new WHTM/Emerson College Polling/The Hill Pennsylvania primary poll shows David McCormick and Mehmet Oz continuing to lead in the Republican race for one of Pennsylvania’s U.S. Senate seats.",
    "Among other things, businesses can use these grants to cover operating expenses and access technical assistance, including training and guidance to stabilize and relaunch their businesses.",
    "Spencer Kimball, Executive Director of Emerson College Polling, says Barletta holds the “plurality of support” among suburban and urban voters, while Mastriano leads among rural voters.",
    "A gas station employee told authorities that Glazewski had sprayed the stickers with a substance to make the stickers harder to remove, charging documents obtained by Lancaster Online.",
    "In a poll of 1,000 likely Republican Pennsylvania voters, former hedge fund CEO McCormick finished first with 17.8%, followed by the former television personality Oz with 16.6%.",
    "Yet my Republican colleagues are sitting on more than $2 billion of support that will need returned to the federal government if they don’t pass a plan.” Gov.",
    "(WTRF, West Virginia) – In West Virginia, WTRF TV is reporting… A Lancaster man is facing charges after he allegedly posted anti-Biden stickers on a gas pump.",
    "Republicans are still waiting for former President Trump to weigh in on the race and a majority of voters say they would support a Trump-endorsed candidate.",
    "Candidates who receive at least 5% in either poll can qualify for a debate hosted by Nexstar Media Inc. and our media partners, WPXI-TV in Pittsburgh.",
    "The two were the only candidates to receive double digit support with McSwain, White, and Gale rounding out the top five receiving between 3-7% each.",
    "When undecided voters were asked they are leaning towards at this time, McCormick’s lead increased to 27.2%, followed by Mehmet Oz with almost 20.6%.",
    "Candidates who receive at least 5% in the poll can qualify for a debate hosted by Nexstar Media Inc. and our media partners, WPXI-TV in Pittsburgh.",
    "Thomas Richard Glazewski, 54, of Manor Township has been charged with resisting arrest, disorderly conduct, harassment, and criminal mischief.",
    "Former U.S. Attorney William McSwain finished fourth with 7.9% and President Pro Tempore of Pennsylvania’s Senate Jake Corman received 4%.",
    "Among white voters in the latest Emerson College poll, Oz and McCormick were virtually tied, while McCormick led among African Americans.",
    "“Barletta also leads all age groups except those aged 50-64, where Mastriano holds 29% of this age blocks’ support,” noted Kimball.",
    "Sixty-one percent of voters 18-29 were undecided, but when asked who they’re leaning towards a majority supported McCormick.",
    "In a March 31 WHTM/Emerson College Polling/The Hill poll Mastriano received 16.2%, nearly four points higher than Barletta.",
    "Wolf proposes to recapitalize this program at $225 million to help approximately 11,000 additional businesses.” Gov.",
    "Barletta, a former congressman and Mayor of Hazelton, received 19.8% support among 1,000 likely Republican voters.",
    "Last week’s poll found that 61% of Pennsylvania Republican voters would support Trump’s endorsed candidate.",
    "The March poll found that 61% of Pennsylvania Republican voters would support Trump’s endorsed candidate.",
    "State Senator Mastriano finished a close second with 19.4%, followed by businessman Dave White at 11.6%.",
    "McCormick held a slim lead among voters 50-64 and 65 or older, while Oz led the 30-49 age range by 3.5%.",
    "Nearly 27% of voters responded that they were undecided and were asked who they were leaning towards.",
    "Corman, Gerow, and Hart each received less than 3% and Zama received less than 1% in the March poll.",
    "Kathy Barnette finished third with 10.2%, followed by Jeff Bartos at 8.9% and Carla Sands at 7.7%.",
    "Melissa Hart and Charles Gerow each received 3.1%, Joseph Gale had 2.9%, and Nche Zama had 1.7%.",
    "Bartos picked up undecided support in the 30-49 age group and tied McCormick among 65 and older.",
    "The program ?would prioritize women- and minority-owned businesses and rural communities.",
    "Carla Sands (11.4%), George Bochetto (4.6%), and Sean Gale (4.3%) rounded out the poll.",
    "Among the undecided voters, Oz finished fourth behind McCormick, Bartos, and Barnette.",
    "Jeff Bartos jumped to third with 17.1% and Kathy Barnette finished fourth with 14.8%.",
    "Barnette picked up significant support among the 50-64 and 65-older undecided voters.",
    "A police complaint said Glazewski had to be placed in the police vehicle by force.",
    "Glazewski was reportedly upset about the price of gas and President Joe Biden.",
    "“Pennsylvanians deserve to be supported and the opportunity to thrive.",
    "That’s what I did,” pointing to anti-Biden stickers at the pump.",
    "George Bochetto received 3.8% and Sean Gale finished with 2.5%.",
    "Glazewski can be heard yelling expletives and “I did that.",
    "Oz received no support among the youngest age group.",
    "Nearly 33% of voters reported they were undecided.",
    "The incident was captured on video.",
    "Wolf on Thursday.",
    "I did that.",
    "Gov.",
    "Gov."
  ]
}