{
  "id": 9850,
  "mediaId": 8254,
  "date": "2022-03-31",
  "headline": "Pennsylvania Governor Primary Poll: Mastriano leads, majority undecided",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2021/06/WHTM_MASTRIANO_RALLY_6PM_PKG.00_00_23_35.Still003.jpg?w=1280",
  "link": "https://www.abc27.com/election/pennsylvania-governor-primary-poll-mastriano-leads-majority-undecided/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    4811,
    4539,
    4946,
    1659,
    2650,
    2911,
    1126,
    6506
  ],
  "sentences": [
    "According to the poll, Democrats and Republicans disagree on whether Pennsylvania runs fair elections: 75% of Democrats think the state runs fair elections compared to 42% of Independents and just 28% of Republicans.",
    "The general election sample consisted of registered voters in Pennsylvania, n=1,069 with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/- 3 percentage points.",
    "It is important to remember that subsets based on gender, age, party breakdown, ethnicity, and region carry with them higher margins of error, as the sample size is reduced.",
    "The Republican primary sample consisted of likely voters, n=372, with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/-5.0 percentage points.",
    "The Democratic primary sample consisted of likely voters, n=471, with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/-4.5 percentage points.",
    "Nearly 91% of Republican voters 65 and older say they are very likely to vote in the race, compared to 84% 50-64, 64% of residents 30-49, and 75% of residents 18-29.",
    "Data was collected using a cellphone sample of SMS-to-web, an online panel provided by Amazon MTurk, and an Interactive Voice Response (IVR) system of landlines.",
    "Candidates who receive at least 5% in either poll can qualify for a debate hosted by Nexstar Media Inc. and our media partners, WPXI-TV in Pittsburgh.",
    "The poll finds 61% of Pennsylvanian Republicans are more likely to support a Trump-endorsed candidate, while 13.2 say they are less likely.",
    "In a breakdown of voters by education, Mastriano leads among those with a high school education or less and those with a college degree.",
    "(WHTM) – A new WHTM/Emerson College Polling/The Hill poll shows Doug Mastriano leading the Republican field of candidates for Governor.",
    "Barletta, formerly the mayor of Hazelton and a Republican nominee for Senate, leads voters in suburban and urban/city areas at 20%.",
    "Mastriano and Barletta were the only candidates to receive double-digit support with 48.8% of the 371 Republican voters undecided.",
    "The elephant in the room is former President Donald Trump, who, at the time of polling, has not endorsed a candidate in the race.",
    "Votes were largely split among the 65 and older voters with Barletta, Mastriano, and McSwain virtually tied with about 11% each.",
    "Former U.S. Attorney McSwain’s support was evenly divided among men and women and men held a slight lead in White’s favor.",
    "Polling methodology\nThe WHTM/Emerson College Polling/The Hill Pennsylvania poll was conducted from March 26-28, 2022.",
    "Barletta holds a slim lead among those with some college education and a 2% lead among post-graduate degree voters.",
    "Mastriano, a State Senator representing Pennsylvania’s 33rd District, leads with 16.2% over Lou Barletta at 12.4%.",
    "Jake Corman, Charlie Gerow, and Melissa Hart each received less than 3% and Dr. Nche Zama received less than 1%.",
    "Mastriano has been a strong supporter of former President Trump and was subpoenaed by the January 6 committee.",
    "Forty-three percent of male voters are undecided compared to 53.5% of polled female voters in Pennsylvania.",
    "Mastriano’s largest group of support comes among rural voters with 27.3% support, a 16% lead over Barletta.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "The data sets were weighted by gender, age, education, race, and region based on 2020 turnout modeling.",
    "William McSwain, Dave White, and Joe Gale rounded out the top five receiving between 3-7% each.",
    "Emerson College will be releasing a second poll of Republican voters in early April.",
    "Barletta leads among men with 17.4% and Maastriano is first among women with 19.8%.",
    "Nearly 26% say an endorsement from Trump will not make a difference in their vote.",
    "Fifty percent of Republican voters 18-29 are undecided in the gubernatorial race.",
    "Mastriano received 17.5% support from white voters, followed by Barletta at 13%.",
    "White and Gale are closely behind among the urban/city residents with 14.5%.",
    "Fifty-one percent of voters 65 and older are also undecided in the race.",
    "In a small field of African Americans polled, Hart led with 25% support.",
    "Mastriano leads among voters 30-49 years old and 50-64-years-old.",
    "White finished closely behind with just under 8%.",
    "Barletta led in the age category by one vote.",
    "Sign up here.",
    "Sign up here."
  ]
}