{
  "id": 10005,
  "mediaId": 2526,
  "date": "2022-03-31",
  "headline": "Multiple Democrats Show Concern over Eric Garcetti’s Nomination as Ambassador to India",
  "image": "https://media.breitbart.com/media/2020/03/Garcetti-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/31/multiple-democrats-show-concern-over-eric-garcettis-nomination-as-ambassador-to-india/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    5422,
    2982,
    2459,
    2820,
    2888,
    392,
    128,
    1126
  ],
  "sentences": [
    "On Wednesday, Kelly’s spokesperson Jacob Peters told the Arizona Republic that the senator “has concerns about this nomination based on the serious allegations raised by whistleblowers and is continuing to evaluate it.”\nBlumenthal, a former state attorney general, told Axios on Wednesday, “I have concerns because I’ve seen and heard about the allegations… I want to put them to rest, if that’s possible, before I vote.” He explained that he would be speaking to some of his colleagues but has not made “any final conclusion.”\nThe two leading Republican oppositions that Garcetti is facing opposition from are both Iowa senators — Sen. Chuck Grassley (R-IA) and Sen. Joni Ernst (R-IA).",
    "A top Garcetti aide Rick Jacobs has faced numerous allegations of sexual harassment, including claims made by an officer from the Los Angeles Police Department that was assigned to the mayor’s detail, Matthew Garza, who has sued the city over the claim, and his one-time spokesperson, Naomi Seligman.",
    "This comes after reports that multiple Senate Democrats have privately said the nomination is “dead.”\nGarcetti’s nomination, which has also seen Republican opposition, is said to be “withering on the vine,” and now, Kelly and Blumenthal are the two latest members to come out against the nomination.",
    "Earlier this month, the Los Angeles Times reported that the mayor’s office turned over a “nonpublic, city-ordered report into allegations of sexual harassment in his office to the Senate Foreign Relations Committee” before the committee voted on Garcetti’s nomination in January.",
    "But, Grassley has also stated that the city’s probe “was incomplete at best.”\nSen. Krysten Sinema (D-AZ) and Sen. Kirsten Gillibrand (D-NY) have also indicated that they would like to review Garcetti’s qualifications before making a vote.",
    "Sen. Mark Kelly (D-AZ) and Sen. Richard Blumenthal (D-CT) join the growing list of Democrats to show concern over Los Angeles Mayor Eric Garcetti’s nomination to serve as U.S. ambassador to India.",
    "Grassley recently said that the nomination would have to wait until he can review the 310 pages report on the incident, which supposedly clears him.",
    "This is all due to the allegations that he tolerated sexual harassment in his office, although the Biden nominee has denied the allegation.",
    "Garcetti would need to receive the vote of at least 50 senators in the evenly split upper chamber to be confirmed as ambassador.",
    "Jacob Bliss is a reporter for Breitbart News.",
    "You can follow him on Twitter."
  ]
}