{
  "id": 10000,
  "mediaId": 8322,
  "date": "2022-03-31",
  "headline": "Dem senators sound alarm over reports Biden administration will end Title 42 border policy",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/AP21292636154658.jpg",
  "link": "https://www.foxnews.com/politics/dem-senators-sound-alarm-biden-administration-title-42-border-policy",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    2459,
    2765,
    5510,
    5879,
    4905,
    2976,
    6678
  ],
  "sentences": [
    "DHS PUTS OUT CALL FOR EMPLOYEES TO VOLUNTEER AT SOUTHERN BORDER AMID ‘LARGE NUMBERS' OF MIGRANTS\nThat ending Title 42 would supercharge the ongoing border crisis -- where authorities are already mass releasing migrants due to overcrowding and continued high migrant traffic -- has been tacitly acknowledged by the Biden administration.",
    "\"We’ll keep working with Arizona local leaders, DHS agents and officers, and community organizations serving on the front lines of the migrant crisis to hold the Administration accountable to ensure we secure the border, keep Arizona communities safe, and ensure the fair and humane treatment of migrants.\"",
    "While advocates and left-wing lawmakers have focused on the rights of foreign nationals -- many of whom have traveled through multiple countries to claim asylum in the U.S. -- more moderate senators have expressed concern about the chaos that could result.",
    "Moderate Democratic senators are expressing concern over reports that the Biden administration will lift the Title 42 public health order which has been used at the border to rapidly expel migrants -- raising fears of a colossal migrant wave this summer.",
    "ARIZONA DEM SENATORS WARN BIDEN AGAINST ‘SHARP END’ TO TITLE 42 BORDER RESTRICTIONS WITHOUT PLA\n\"Ending Title 42 without a comprehensive plan in place puts at risk the health and safety of migrants and Arizona communities,\" Sinema said in a statement.",
    "Multiple outlets reported Wednesday that the Biden administration is planning to announce that it will end Title 42 on May 23, giving the Department of Homeland Security time to prepare for an expected increase in migrants at the border.",
    "Kelly said there is \"still not an adequate plan or sufficient coordination to end Title 42 without further straining our law enforcement, border communities, and nonprofits providing humanitarian assistance to migrants.\"",
    "The order was implemented by the Trump administration in March 2020 due to the outbreak of COVID-19 and has since been used by both the Trump and Biden administrations to expel a majority of migrants at the border.",
    "\"I would be very worried about this notion that the border will be overwhelmed, and I really want to hear a specific plan with adequate personnel, and frankly I would like to see the State Dept.",
    "On Wednesday, they spoke to DHS Secretary Alejandro Mayorkas about Title 42, with their offices saying they underscored how the border state could suffer if the policy is ended without a plan.",
    "Manchin had sent a letter to Centers for Disease Control (CDC) Director Rochelle Walensky warning that, with the rise of the BA2 subvariant, it was not time \"to throw caution to the wind.\"",
    "But Republicans and border officials have warned that ending the policy will encourage more migrants to make the journey north -- and also result in more migrants being allowed in.",
    "Activists and top Democrats, including Senate Majority Leader Chuck Schumer have called for the end to the policy, arguing that it is preventing migrants from claiming asylum.",
    "Biden administration officials have been reportedly planning for numbers of up to 18,000 migrants a day, and have put out calls for volunteers and help from the Pentagon.",
    "The White House on Wednesday acknowledged that \"there will be an influx of people to the border\" when the Centers for Disease Control lifts the order.",
    "\"Maybe that would spur us to get a good immigration policy that works for Americans and secure our borders -- the borders have to be secure,\" he said.",
    "His office said he also asked for details about how increased funding approved in the recent omnibus for border management and security could be used.",
    "do more pressure on some of these countries, particularly Northern Triangle countries, to try and stop the flow of some of these economic refugees.\"",
    "\"We’ll continue to push the Biden administration for the resources and support Arizona needs amid this crisis at our southern border,\" Kelly said.",
    "Mark Kelly and Kyrsten Sinema wrote to President Biden last week, warning him against ending the policy without a comprehensive plan in place.",
    "Sinema, who is Chair of the Senate Subcommittee on Border Management, said she told Mayorkas she intends to hold a hearing on the matter.",
    "Meanwhile, Sen. Mark Warner, D-Va., told CNN he was \"very reluctant\" for the administration to end without a real plan in place.",
    "\"I think they should reconsider,\" Sen. Joe Manchin, D-W.Va., told reporters on Thursday.",
    "Meanwhile, DHS put out a fact sheet for its plans to deal with an increase in numbers.",
    "In February, approximately 55% of migrants were returned due to the order.",
    "\"If anything we should be looking at permanency on Title 42,\" he said.",
    "\"I sent a letter, I’m against removing Title 42.\"",
    "Meanwhile, Arizona Sens."
  ]
}