{
  "id": 10064,
  "mediaId": 2730,
  "date": "2022-04-03",
  "headline": "Ron Klain Continues to Gaslight the American People in Deep Dive Sunday Show Interview",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/83/9b94a755-a962-4665-93e7-1e01a0c44085.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/04/03/ron-klain-continues-to-gaslight-the-american-people-in-deep-dive-sunday-show-interview-n2605438",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/hNZAMQ85Kg\n— RNC Research (@RNCResearch) April 3, 2022\nRNC Research, in addition to tweeting the clip of Klain's appearance on the show discussing Hunter Biden, also had a thread going with reports from various outlets, including The New York Post, The Daily Mail, and Fox News about how now President Joe Biden was involved.",
    "Stephanopoulos, however, also put him on the spot by asking him \"is the president confident Hunter Biden didn't break the law,\" to which Klain, not entirely surprisingly, responded \"of course the president's confident that his son didn't break the law.\"",
    "Stephanopoulos also asked about the border, with Title 42 being lifted by the Centers for Disease Control (CDC) on Friday, as Julio covered, warning how the already record-high rates of illegal immigrants coming over the southern border will worsen.",
    "As Axios' Hans Nichols pointed out earlier on Sunday on CNN, the recently released jobs numbers that the administration is touting are \"largely irrelevant\" when people are rightfully concerned about high inflation and high gas prices.",
    "\"So, I think when people compare our agenda to the Republican agenda, that's going to be a clear choice for folks,\" he claimed, which may very well likely turn out to be the case, just not as the White House hopes for it to play out.",
    "Klain, in addition to dismissing how \"Title 42 isn't an immigration law, it's a public health law,\" acknowledged that \"we need to do more work at the border\" and \"we also have to be honest about what's happening at the border.\"",
    "\"How did Democrats get on the wrong side of the crime issue that's coming up right now,\" Stephanopoulos went on to aptly charge, but Klain wouldn't even accept that much, and thus wouldn't provide a sufficient response.",
    "Source: AP Photo/Evan Vucci\nWhite House Chief of Staff Ron Klain had a memorably busy week last week touting the Biden administration's narrative that tapping into the strategic oil reserves is actually a good thing.",
    "We got America back to work,\" Klain said at one point, going on to add that \"I think there are a lot of encouraging signs in terms of this economy coming back to being a robust jobs and business-creating economy.\"",
    "Once Stephanopoulos brought up how mainstream media outlets that once dismissed the story about Hunter Biden's laptop, such as The Washington Post, Klain doubled down.",
    "Klain emphasized to Stephanopoulos that an investigation into the president's son is for the Justice Department to figure out, and not for anyone at the White House.",
    "According to polling data from RealClearPolitics (RCP) from March 1-March 29, Biden is at 37.1 percent approval rating on the issue, while 58.4 percent disapprove.",
    "There are claims from Hunter Biden's business partner, Tony Bobulinski, that Joe Biden is \"the Big Guy\" referred to when it comes to \"10 percent for the Big Guy.\"",
    "An ABC poll from last month, as I highlighted, has Biden at a 40 percent approval rating on crime, while 58 percent disapprove on his handling of the issue.",
    "As the White House Chief of Staff, Klain appears to be the top messenger when it comes to gaslighting the public on this administration's failures.",
    "\"I think the goal for everyone should be to make sure those asylum claims, those claims of people fleeing persecution, are heard in a prompt way.",
    "It's not just one poll, but several polls, where Biden fares poorly on the economy, as he does most, if not every issue, depending on the poll.",
    "He's now started this week off with an appearance on ABC's \"This Week\" where he and host George Stephanopoulos covered a wide range of topics.",
    "Anyone who was looking for Klain--or anyone from this administration--being forthcoming about the issue, though, would be sorely mistaken.",
    "According to RCP data from March 11-March 29, Biden's approval rating on immigration is at 35.8 percent, while 58.5 percent disapprove.",
    "RCP's average for him, according to polling data from March 18-March 31, is at 40.8 percent approval, while 54.0 percent disapprove.",
    "Congress passed one of them just last week, two weeks ago, in the omnibus bill and raised our funding for police,\" Klain claimed.",
    "FiveThirtyEight, which was last updated on April 1, has Biden at a 41.1 percent approval rating, while 53.1 percent disapprove.",
    "A common theme, throughout, though, was that whatever the issue, Klain managed to spin it as a positive for the administration.",
    "Nothing was said about the soft-on-crime district attorneys in bright blue, Democrat-run cities, where crime has skyrocketed.",
    "The Amerian people aren't buying such messaging from Klain, and it's not just about how Republicans may be \"exploit[ing] it.",
    "We also want to make sure we have in place police reform and community violent intervention to help reduce crime.",
    "Q: \"A Chinese energy company paid $4.8 million to entities controlled by Hunter and the president's brother.",
    "Stephanopoulos then factored in the mid-terms, which Republicans are expected to do particularly well in.",
    "\"As you know, inflation comes with that, and that’s what -- appears to be on people's minds right now.",
    "BIDEN CHIEF OF STAFF: \"Ah, George, the president's confident that his family did the right thing.\"",
    "His response also entailed once more touting tapping into the strategic reserves as a good thing.",
    "Biden has been faring poorly on the crime issue for months now, as we've highlighted at Townhall.",
    "And they certainly are something that no one at the White House is involved in,\" Klain insisted.",
    "\"And we also are seeing that Republicans are poised to exploit that in the midterms,\" he said.",
    "But, again, I want to just be really clear, these are actions by Hunter and his brother.",
    "So, let's start with the facts about spending and nonsense like that,\" Klain responded.",
    "A part of the segment gaining a particular amount of attention was about Hunter Biden.",
    "Mark Kelly and Kyrsten Sinema, both from the border state of Arizona, were not happy.",
    "Klain, as the entire administration has done, touted Biden's handling of the economy.",
    "Those who don't are promptly sent back to where they came from,\" Klain had to offer.",
    "He went on to address Biden lowering the deficit from former President Donald Trump.",
    "\"Well, George, I don't think Democrats are on the wrong side of the crime issue.",
    "\"We're going to cut Trump's deficit in half in Biden’s first three years.",
    "\"George, the president is confident that his family did the right thing.",
    "We want to make sure we have strong law enforcement to respond to crime.",
    "Is the president confident his family didn't cross any ethical lines?\"",
    "The president has sent to Congress plans for robust funding of police.",
    "\"A lot of signs of a powerful economy,\" he said in response to Klain.",
    "Klain didn't once directly say the word \"inflation\" in his response.",
    "Those who deserve protection from prosecution get that protection.",
    "You saw that poll about the president's approval on the economy.",
    "Stephanopoulos, to his credit, did bring up inflation.",
    "But that isn't the only memorable part of the segment.",
    "We know gas prices are climbing higher and higher.\"",
    "For Klain's focus went to focus on asylum seekers.",
    "Klain should have quit while he was ahead, though.",
    "Overall, Biden is performing quite poorly, though.",
    "Even Democratic senators, such as Sens.",
    "Congress is making progress on that.\"",
    "\"So, we've solved the jobs crisis.",
    "They don't involve the president.",
    "We have a plan to fight crime.",
    "They're private matters."
  ]
}