{
  "id": 10072,
  "mediaId": 2730,
  "date": "2022-04-01",
  "headline": "Democrat Senators Blast Biden Over Title 42",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/155/6813b3e6-327a-4d52-84a1-2513f7283853.jpg",
  "link": "https://townhall.com/tipsheet/katiepavlich/2022/04/01/democrat-senators-blast-biden-over-title-42-n2605389",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Pavlich",
  "authorUrl": "https://townhall.com/tipsheet/katiepavlich/",
  "termIds": [
    0
  ],
  "sentences": [
    "@FoxNews pic.twitter.com/EnsOsaHSEv\n— Bill Melugin (@BillFOXLA) March 31, 2022\nLive in Eagle Pass, TX w/ @johnrobertsFox & @SandraSmithFox discussing the jaw dropping numbers we’ve just gotten from several CBP sources:\n300,000 known gotaways at the border in the last 6 months, including over 62,000 just last month in March alone.",
    "We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy.”\nMeanwhile, 18,000 illegal immigrants per day are expected to start crossing the southern border when Title 42 is officially repealed in May.",
    "Source: (AP Photo/Manuel Balce Ceneta)\nArizona's Democratic Senators Mark Kelly and Kyrsten Sinema are blasting the Biden administration after it was announced Friday afternoon the Centers for Disease Control will end Title 42 in May.",
    "Sinema and Kelly not happy w/ Biden on Title 42\nSinema: \"Today’s decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border.\"",
    "“Title 42 has been an essential tool in combatting the spread of COVID-19 and controlling the influx of migrants at our southern border.",
    "It’s unacceptable\"\n— Burgess Everett (@burgessev) April 1, 2022\nWest Virginia Democrat Joe Manchin is calling the move \"frightening.\"",
    "“Today’s announcement by the CDC and the Biden Administration is a frightening decision,” Manchin released in a statement Friday.",
    "DHS projects if Title 42 is dropped, there may be upwards of 18,000 illegal crossings *per day*.",
    "One of the epicenters of the current border crisis, which may soon get a whole lot worse.",
    "pic.twitter.com/bRj1WK4InD\n— Bill Melugin (@BillFOXLA) April 1, 2022",
    "Current numbers are already out of control and raging.",
    "That number is roughly 7,000 per day right now.",
    "Live in Eagle Pass, TX this morning.",
    "Kelly: \"This is the wrong decision.",
    "Busiest months are ahead."
  ]
}