{
  "id": 10126,
  "mediaId": 8350,
  "date": "2022-04-01",
  "headline": "Sinema, Kelly criticize Biden administration over ending asylum limits at US-Mexico border",
  "image": "https://ktar.com/wp-content/uploads/2022/04/Kelly-and-Sinema-April-1.jpg",
  "link": "https://ktar.com/story/4981833/sinema-kelly-criticize-biden-administration-over-ending-asylum-limits-at-us-mexico-border/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "TORRENCE DUNHAM",
  "authorUrl": "https://ktar.com/story/author/tdunham/",
  "termIds": [
    0
  ],
  "sentences": [
    "“From my numerous visits to the southern border and conversations with Arizona’s law enforcement, community leaders, mayors, and non-profits, it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities.”\nBoth senators vowed to continue pushing the Biden administration to get additional resources to the border.",
    "“Today’s decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border.”\nKelly echoed in the joint statement, calling ending the policy at this time the wrong decision.",
    "Sinema after meeting with stakeholders managing the migrant crisis last month said the administration has yet to take active steps to stem the flow of migrants and that Washington D.C. has continued to show little regard to the crisis occurring in Arizona.",
    "Mayorkas agreed to move forward with a strategy called for by Sinema of DHS launching an intergovernmental coordination effort to ensure communication between federal, state, local and non-governmental partners, according to the statement.",
    "“Prematurely ending Title 42 without a comprehensive, workable plan would put at risk the health and safety of Arizona communities and migrants,” Sinema, who also serves as Chair of the Border Management Subcommittee, said in a statement.",
    "PHOENIX — Arizona’s two Democratic senators criticized the Biden administration on Friday for ending a public health policy limiting asylum at the southern border without a comprehensive plan in place.",
    "The policy, named for a 1944 public health law to prevent communicable disease, was established in March 2020 under then-President Donald Trump as a way to prevent the spread of COVID-19.",
    "In a letter sent to Biden last week, Kelly and Sinema said they have not seen evidence that the Department of Homeland Security has developed and implemented a sufficient plan.",
    "Homeland Security Secretary Alejandro Mayorkas in June 2021 to create a comprehensive plan in advance of the end of Title 42 and for them to be briefed on it.",
    "“It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly, and humane process at the border,” Kelly said.",
    "DHS said this week about 7,100 migrants were coming daily and border officials are now preparing for as many as 18,000 arrivals a day.",
    "Since the policy went into effect, migrants trying to enter the U.S. have been expelled more than 1.7 million times.",
    "Sinema and Kelly met with Mayorkas on Wednesday to discuss the administration’s Title 42 contingency plans.",
    "The policy will not end until May 23 in order to give border officials enough time to prepare.",
    "This isn’t the first time Arizona’s senators have criticized the fellow Democratic president.",
    "Kyrsten Sinema and Mark Kelly said in a statement that they asked U.S.",
    "The Associated Press contributed to this report.",
    "Share\nComments",
    "Sens."
  ]
}