{
  "id": 10148,
  "mediaId": 2553,
  "date": "2022-03-31",
  "headline": "‘The Borders Have To Be Secure’: Manchin Pans Plans To End Title 42",
  "image": "https://dw-wp-production.imgix.net/2022/03/8D2D463E-0295-4D1C-8E9F-1F150B7FB3AF_1_201_a.jpeg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/the-borders-have-to-be-secure-manchin-pans-plans-to-end-title-42",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charlotte Pence Bond",
  "authorUrl": "https://www.dailywire.com/author/charlotte-pence-bond",
  "termIds": [
    5879,
    5510,
    4905,
    2065,
    2459,
    1572,
    1489,
    1331,
    253,
    6593
  ],
  "sentences": [
    "“We’ll keep working with Arizona local leaders, DHS agents and officers, and community organizations serving on the front lines of the migrant crisis to hold the Administration accountable to ensure we secure the border, keep Arizona communities safe, and ensure the fair and humane treatment of migrants.”\nKelly said there is “still not an adequate plan or sufficient coordination to end Title 42 without further straining our law enforcement, border communities, and nonprofits providing humanitarian assistance to migrants.”\nThe Daily Wire is one of America’s fastest growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "Fox reported, “On Wednesday, they spoke to DHS Secretary Alejandro Mayorkas about Title 42, with their offices saying they underscored how the border state could suffer if the policy is ended without a plan.”\nSinema is Chair of the Senate Subcommittee on Border Management and said she informed Mayorkas she plans to hold a hearing on the issue.",
    "As The Daily Wire reported on Wednesday, “Biden is gearing up to end the policy, according to a pending draft of an order from the CDC reviewed by The Wall Street Journal.”\n“This is a decision that we have long deferred to CDC, Title 42 is a public health directive, it is not an immigration or migration enforcement measure.",
    "Unfortunately, due to annual migration patterns, those numbers are only expected to increase during the upcoming spring and summer months.”\n“The current Order under Title 42 suspending the right to introduce certain persons into the United States has been an important tool in combatting the spread of the COVID-19 pandemic.",
    "With encounters along our southern border surging and the highly-transmissible Omicron BA.2 subvariant emerging as the dominate strain in the United States, now is not the time to throw caution to the wind.",
    "Through the first five months of FY22, the Department of Homeland Security (DHS) reports that Customs and Border Patrol (CBP) has experienced more than 838,000 migrant encounters.",
    "I urge you to again renew this commonsense policy that has been in effect—under both Republican and Democratic Administrations—since March 2020,” Manchin continued.",
    "On Thursday, Senator Joe Manchin (D-WV) reiterated his opposition to the Biden administration’s potential action to do away with Title 42 immigration restrictions.",
    "Bedingfield said the administration is “planning for multiple contingencies” and that “there will be an influx of people to the border” when Title 42 is rescinded.",
    "Senators Kyrsten Sinema (D-AZ) and Mark Kelly (D-AZ) wrote to Biden last week with their concerns on ending the directive, telling him to continue the order.",
    "Manchin also called for Title 42 to be extended in a letter to Centers for Disease Control and Prevention (CDC) Director Rochelle Walensky earlier this week.",
    "“Ending Title 42 without a comprehensive plan in place puts at risk the health and safety of migrants and Arizona communities,” Sinema said in a statement.",
    "“Maybe that would spur us to get a good immigration policy that works for Americans and secure our borders — the borders have to be secure,” he noted.",
    "So, the decision on when to lift Title 42, we defer to the CDC,” White House Communications Director Kate Bedingfield said Wednesday in a briefing.",
    "The Hill noted that multiple news outlets reported that the Biden Administration would be taking down the directive in some way by May 23rd.",
    "That is four times higher than the 400,000 encounters reported the previous year, and we are on pace to set a new record again this year.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "Manchin said in the letter, “In Fiscal Year (FY) 2021, encounters with migrants reached an all-time high of 1.7 million people.",
    "Other Democratic Senators have also pushed back against getting rid of the policy, specifically those from border states.",
    "“I sent a letter, I’m against removing Title 42.”\n“If anything we should be looking at permanency on Title 42,” he said.",
    "The White House is setting up to potentially end the public health order, which was put forth in March 2020.",
    "The order obtained by The Wall Street Journal reportedly noted that Title 42 would be revoked in late May.",
    "Just watch the news y’all put out every day, what’s coming across,” Manchin said, per The Hill.",
    "“I think they should reconsider,” Manchin told the press, per Fox News.",
    "It has been prolonged during the Biden Administration.",
    "Create a free account to join the conversation!",
    "Become a member now and join our mission.",
    "Believe the same?",
    "“Oh my goodness."
  ]
}