{
  "id": 10183,
  "mediaId": 2526,
  "date": "2022-03-30",
  "headline": "Border State Democrats Beg Biden: ‘Consider Dangerous Impact’ Illegal Immigration Has on Our Communities",
  "image": "https://media.breitbart.com/media/2022/02/GettyImages-1334162567-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/30/border-state-democrats-beg-biden-consider-dangerous-impact-illegal-immigration-has-on-our-communities/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    0
  ],
  "sentences": [
    "DHS’s practice of releasing migrants with a so-called “Notice to Report” or otherwise releasing them on parole may have reduced the time they are held in detention at Border Patrol facilities, but likely acts as a pull factor for even more migration, imposes substantial costs on local communities, and is an inappropriate substitute for taking measures to construct adequate facilities and reduce the overall number of migrants crossing the border.",
    "[Emphasis added]\nThe letter comes as Sen. Mark Warner (D-VA) has warned Biden not to end Title 42, telling CNN, “I would be very reluctant for the administration to end this Trump policy until they had a real plan in place.”\n“I think we are a generous country but we have to be a country of rule of law … I would be very worried about this notion that the border would be overwhelmed,” Warner said.",
    "On Wednesday, Biden officials spoke anonymously to the Associated Press, revealing that the administration has plans to end the Center for Disease Control and Prevention’s (CDC) Title 42 order that gives federal immigration agents broad authority to quickly return border crossers and illegal aliens to their native countries.",
    "“We urge you to consider the dangerous impact rescission of the Title 42 order would have on our communities at this time,” the lawmakers write:\nSince January 2021 DHS has eliminated measures designed to deter migrants from undertaking the dangerous journey to the southwest border.",
    "South Texas mayors inform us that the local non-governmental organizations are completely at capacity in terms of lodging and other services, and that local transportation hubs have been overwhelmed with migrants, many of whom lack the financial means to purchase tickets.",
    "A report published by the DHS Office of Inspector General (OIG) in January of this year found that Border Patrol stations in the Rio Grande Valley were overcrowded and that the high volume of apprehensions limited the effectiveness of COVID-19 mitigation measures.",
    "We strongly urge that DHS retain Title 42 authority until appropriate deterrent measures are put in place to ensure that Federal government facilities and local communities will not be overwhelmed by a sudden increase in migrant apprehensions.",
    "[Emphasis added]\n…\nFinally, at the current levels of cross-border migration, DHS currently lacks adequate capacity to process and detain all migrants apprehended along the southwest border under its Title 8 authorities.",
    "Kyrsten Sinema (D-AZ) and Mark Kelly (D-AZ) are asking Biden to continue enforcing Title 42 as they have yet to see any plans from the administration as to how they would deal with a massive wave of illegal immigration.",
    "More elected Democrats, representing America’s border communities, are pleading with President Joe Biden to enforce Trump-era border controls to protect their constituents from a massive wave of illegal immigration.",
    "If the CDC were to rescind its Title 42 order at this time, Border Patrol facilities and local communities would be forced to absorb at least double the current number of migrants, likely with catastrophic results.",
    "Hundreds of thousands are likely to be released into the U.S. interior as part of Biden’s expansive Catch and Release operation that buses and flies border crossers and illegal aliens to various American cities.",
    "[Emphasis added]\nFurthermore, small border communities lack the appropriate housing, transportation, and healthcare infrastructure to manage the ongoing release of migrant populations into their jurisdictions.",
    "In a letter to Biden’s top agency officials, Reps. Henry Cuellar (D-TX) and Vicente Gonzalez (D-TX) joined House and Senate Republicans representing Texas to urge the administration not to end Title 42.",
    "“To date, we have not yet seen evidence that DHS has developed and implemented a sufficient plan to maintain a humane and orderly process in the event of an end to Title 42,” Sinema and Kelly wrote.",
    "In 2021, more than two million border crossers and illegal aliens arrived at the porous southern border — a foreign population larger than the resident population of Philadelphia, Pennsylvania.",
    "As a result, Biden officials are readily admitting that about half a million border crossers and illegal aliens are expected to show up at the United States-Mexico border every month.",
    "“I would really want to hear a specific plan with adequate personnel … to try to stop the flow of some of these economic refugees.”\nLikewise, Sens.",
    "This is the equivalent of a population the size of Atlanta, Georgia, arriving at the border over the course of just 28 to 30 days.",
    "From January 2021 to August 2021, for example, more than half a million were released into the U.S. interior.",
    "This year, experts predict more than 2.1 million will arrive.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here."
  ]
}