{
  "id": 10280,
  "mediaId": 2894,
  "date": "2022-04-03",
  "headline": "BINYAMIN APPELBAUM: The people, united, are not going to get very far",
  "image": "https://wwwcache.wral.com/asset/business/2022/04/01/20216002/65370eec-31e6-4de5-86e8-ee19c10f2e6f-DMID1-5uf7krvbr-640x480.jpg",
  "link": "https://www.wral.com/the-people-united-are-not-going-to-get-very-far/20216233/",
  "mediaOutlet": "wral.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1785,
    2459,
    5594,
    43,
    1339,
    1243,
    6520,
    6678,
    6632
  ],
  "sentences": [
    "After Smalls was fired for raising concerns about workers’ safety during the early months of the COVID pandemic, a top Amazon executive described him as “not smart or articulate.” Some of his former colleagues figured that was roughly how the company felt about them, too.",
    "President Joe Biden has been more outspoken in his support for organized labor than any of his predecessors in the White House, but that is actually a sign of the weakness of the union movement, which no longer has the power to make a Democratic president uncomfortable.",
    "Another standard talking point is that the government supplanted unions as the primary protector of workers’ interests during the mid-20th century, writing into law many of the movement’s original goals, like putting a floor on wages and a ceiling on hours worked.",
    "The government has gradually granted employers wide-ranging powers to frustrate unionization campaigns through propaganda, via threatened and actual mistreatment of workers and by closing operations if workers vote to unionize.",
    "The new Amazon Labor Union — the first union for U.S. workers at Amazon, one of the nation’s largest employers — is remarkable, and worthy of celebration, precisely because it is so very difficult to unionize.",
    "Bolder reforms, such as allowing workers in a given industry to negotiate wages and salaries collectively, rather than requiring individual contracts in each workplace, remain the stuff of campaign speeches.",
    "An analysis of union votes in 2007 found that among the roughly 900 groups of workers who voted to engage in collective bargaining, fewer than half obtained a first contract within the following year.",
    "Weil held the same job under President Barack Obama and earned a reputation for trying to do it — for example, by seeking to prevent companies from improperly treating workers as contractors.",
    "On Friday, after a campaign the company bitterly opposed, the government announced that those workers had voted to unionize, and Smalls, their leader, popped open a bottle of Champagne.",
    "Almost as soon as it had legalized collective bargaining in the 1930s, Congress began to backtrack, constraining American unions more tightly than unions in other democracies.",
    "Just this week, three Senate Democrats blocked the confirmation of David Weil to lead the Labor Department’s wage and hour division, which is supposed to protect workers.",
    "It was a heady moment for the union movement in the United States, a high-profile victory that follows recent votes to organize workers at several Starbucks.",
    "“I heard from a lot of business owners,” Sen. Mark Kelly of Arizona, one of the three Democrats, told Politico by way of justification for his opposition.",
    "A parallel organizing campaign at an Amazon warehouse in Alabama mounted by the Retail, Wholesale and Department Store Union appears headed for defeat.",
    "Two years ago, Amazon fired Christian Smalls after he organized fellow workers at a warehouse on Staten Island to protest pandemic working conditions.",
    "“Do you see what’s happening out there?” the AFL-CIO’s president, Elizabeth Shuler, asked the crowd this week at a labor convention in Pittsburgh.",
    "During the unionization campaign, Amazon insisted that the police arrest Smalls and two current workers who brought food to the warehouse.",
    "As in the early 20th century, the union movement may well have no option but to win on a tilted field in order to have a fair chance.",
    "The campaign was fueled by anger about working conditions and a sense that they were not reaping a fair share of Amazon’s success.",
    "But federal oversight is an imperfect substitute for ensuring that workers can define and defend their own collective interests.",
    "The House passed legislation last year, backed by Biden, that would address some of these abuses, but it died in the Senate.",
    "EDITOR'S NOTE: Binyamin Appelbaum is the lead writer on economics and business for The New York Times editorial board.",
    "Tellingly, the share of workers who would like to be in unions is much higher than the share of unionized workers.",
    "The decline of unions is often narrated as a straightforward consequence of the decline of industrial employment.",
    "Union leaders have responded to the victory by announcing plans to press for votes at other Amazon warehouses.",
    "To the extent that some tactics remain illegal, companies rarely suffer anything more than token penalties.",
    "Before the vote, the union projected the words “They arrested your co-workers” on one of the outside walls.",
    "Capitol Broadcasting Company's Opinion Section seeks a broad range of comments and letters to the editor.",
    "Our Comments beside each opinion column offer the opportunity to engage in a dialogue about this article.",
    "In addition, we invite you to write a letter to the editor about this or any other opinion articles.",
    "Its employees have reached a different conclusion, and not out of ignorance of the company’s case.",
    "The number of American workers who are represented by unions drops with almost every passing year.",
    "And it will not recover unless and until the federal government changes the rules of the game.",
    "“We believe having a direct relationship with the company is best for our employees,” it said.",
    "The circumstances were extraordinary, which is what it takes to win under the current rules.",
    "Smalls’ union has already secured a vote at another warehouse on Staten Island this month.",
    "Both federal protections and the enforcement of those protections are grossly inadequate.",
    "They were required to sit through meetings where they were told what was good for them.",
    "The workers at JFK8, that Amazon warehouse on Staten Island, overcame the obstacles.",
    "The vote establishes the union as the official representative of the JFK8 workers.",
    "Three years later, almost a third still had not obtained that first contract.",
    "The government has cooperated with employers to frustrate that desire.",
    "Amazon said Friday that it might seek to have the vote thrown out.",
    "Here are some tips on submissions >> SUBMIT A LETTER TO THE EDITOR",
    "This article originally appeared in The New York Times.",
    "“Working people are rising up.”\nBut it is a false dawn.",
    "Fewer steelworkers, fewer United Steelworkers.",
    "But companies often refuse to negotiate.",
    "Employers did not want an encore.",
    "The victory is still incomplete.",
    "It reached a new low last year.",
    "He is based in Washington.",
    "It also was personal."
  ]
}