{
  "id": 1029,
  "mediaId": 2724,
  "date": "2022-02-17",
  "headline": "Democrats Dominate Top 10 List Of Members Of Congress Spending Huge Amounts On Private Security",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/02/2022.02.17-11.32-thepoliticalinsider-620e324517130.jpg",
  "link": "https://thepoliticalinsider.com/members-of-congress-are-spending-huge-amounts-on-private-security/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rusty Weiss",
  "authorUrl": "https://thepoliticalinsider.com/author/rusty-weiss/",
  "termIds": [
    0
  ],
  "sentences": [
    "New York Democratic Rep. Alexandria Ocasio-Cortez (@AOC), who has expressed support for defunding the police, was ushered out of a news event with Capitol police protection.#JustTheNews pic.twitter.com/dXtEtP6eVf\n— Just the News (@JustTheNews) September 21, 2021\nOcasio-Cortez complained not too long ago when then-New York City mayor Bill de Blasio announced he had cut $1 billion from the NYPD budget.",
    "Pretty amazing analysis from from @axios\nHow much members of Congress are spending on personal security\nFreshman Georgia @SenatorWarnock spent $600,000 https://t.co/AvmYhMaaMc\n— Sean Spicer (@seanspicer) February 16, 2022\nDemocrats Splurge On Personal Security\nSign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "Bush, in an interview with CBS News this past August, argued that it’s not hypocritical for her to spend money on private security while trying to defund the police, telling critics to “suck it up” and suggesting any judgment of her actions means people ‘want her to die.’\n“They would rather I die?” she said.",
    "Democrats in the top 10 include Warnock, fellow freshman Georgia Senator Jon Ossoff (GA), Senator Mark Kelly (AZ), Rep. Cori Bush (MO), Rep. Eric Swalwell (CA), Rep. Alexandria Ocasio-Cortez (NY), Senator Joe Manchin (WV), and Rep. Mike Levin (CA).",
    "“So suck it up,” Bush told viewers adding, “and defunding the police has to happen … We need to defund the police and put that money into social safety nets.”\nShe spent $233,700 this past year on personal security according to the Axios report.",
    "“You’ve got politicians who go to church every Sunday morning and then walk into that capitol, stand under that gold dome, and come up with the dumbest legislation you can ever imagine,” Warnock said.",
    "… Imagine all them people with guns.”\nBOMBSHELL: Newly found video shows Georgia Senate candidate @ReverendWarnock LAUGHING at church-goers who defend themselves with guns.",
    "— NRA (@NRA) November 30, 2020\nOther Democrats on the personal security spending list that stand out include staunch ‘defund the police’ advocates Bush and Ocasio-Cortez.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "Democrats dominate the list of top ten lawmakers in the amount of campaign money they spend on private security, data provided by OpenSecrets indicates.",
    "Leading the list compiled by Axios – by far – is Senator Raphael Warnock (D-GA) who spent a whopping $605,900 for personal security in the past year.",
    "In fact, eight of the first ten congress members on the list are Democrats, including a few names associated with strict gun control platforms.",
    "It’s difficult to avoid the obvious hypocrisy involving a list of spending for personal security that is dominated by Democrat lawmakers.",
    "Shoot first, ask questions later.”\nThat same year he shredded pro-gun lawmakers supporting the Safe Carry Protection Act.",
    "During a sermon in 2014, the Georgia Senator mocked “Stand Your Ground” laws designed to protect law-abiding Americans.",
    "Is that what you want to see?”\nNo, we’d rather you not be a raging hypocrite fueled by weapons-grade ignorance.",
    "Especially when some of them are fierce advocates of stricter gun control laws or “defunding” the police.",
    "Leading the list is Warnock, who nearly doubles his nearest competitor in spending for security details.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "Fellow Squad member, AOC, spent $83,200 for her own security during the same timeframe.",
    "“Think about all the crazy people you bump into just on the routine, every week.",
    "Senator Ted Cruz (R-TX) is second, doling out $364,000 for security last year.",
    "The only other Republican in the top 10 is Pat Toomey (PA), landing at 6th.",
    "First Warnock goes after our veterans, now our Second Amendment.",
    "“Defunding the police means defunding police,” she said.",
    "“No, it’s not a ‘Stand Your Ground’ law,” Warnock said.",
    "On your job, on the street, some of them in church.",
    "“It does not mean budget tricks or funny math.”",
    "“You would rather me die?",
    "“It’s a shoot-first law.",
    "Can we start there?"
  ]
}