{
  "id": 10306,
  "mediaId": 2574,
  "date": "2022-04-02",
  "headline": "Dems in Actual Disarray: How Senate Democrats Fumbled Confirmation of a Top Biden Nominee",
  "image": "https://freebeacon.com/wp-content/uploads/2022/04/dick-durbin_736x514.jpg",
  "link": "https://freebeacon.com/democrats/how-senate-democrats-fumbled-a-key-biden-nominee/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patrick Hauf",
  "authorUrl": "https://freebeacon.com/author/patrick-hauf/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Biden administration's fraying relationship with members of the president's own party has led to a number of high-profile defeats in recent months—the White House in March withdrew its nomination of Sarah Bloom Raskin for a powerful regulatory position at the Federal Reserve after Manchin came out against the pick.",
    "Business groups such as the Taxpayers Protection Alliance raised concerns over Weil's support for stringent worker regulations, including a California law that would no longer classify Uber and Lyft drivers as independent contractors and entitle them to the same benefits and protections as full-time employees.",
    "Democrats\nPresident Joe Biden's first nominee to fail on the Senate floor is the result of Democratic leadership's disorganization and inability to manage the legislative calendar, according to multiple interviews with senior Senate staffers.",
    "One Senate office charged that Manchin, Sinema, and Kelly decided to vote against Weil at the last minute after it became clear that Vice President Kamala Harris was not going to make it to the Senate in time to break a potential 50-50 tie.",
    "Biden's Labor Secretary Marty Walsh made Weil's confirmation a priority for his agency, attempting to rally support behind Weil and score a win for a president who regularly touts himself as the most pro-union president in modern history.",
    "The failure to secure Harris for the vote, the source told the Free Beacon, came because so many staffers on the Democratic side of the aisle are still working remotely, making both whipping votes and timing them increasingly difficult.",
    "Sinema and Kelly were targeted with an aggressive campaign back home in Arizona to vote against Weil, but even business groups urging them to vote against the nomination were shocked by his defeat.",
    "Senate offices say Schumer has been trying a new strategy of stacking votes, and there is speculation that he just threw the vote on the floor without knowing whether Weil would be confirmed.",
    "The bill, which passed in the House last year and would end so-called right-to-work laws in 28 states and increase penalties on companies for labor violations, remains stalled in the Senate.",
    "The stunning defeat was due to a combination of Democratic work-from-home-policies and incompetent whipping by party leadership, according to numerous Senate sources involved in the vote.",
    "The Taxpayers Protection Alliance, which ran ads in Arizona declaring that Weil wanted \"to turn Arizona into California,\" said Weil's failed confirmation vote caught them by surprise.",
    "Weil's vote, one senior staffer said, was scheduled at the last minute—an indication that Durbin had not ensured every Democrat in the 50-50 split chamber would vote to confirm Weil.",
    "Biden nominated Weil in June to serve as administrator of the Wage and Hour Division in the Labor Department, a position he previously held during the Obama administration.",
    "Republican Senate offices laid the blame for the fallen nomination at the feet of Democratic senator Dick Durbin (Ill.), who has served as majority whip since last year.",
    "The Senate voted down David Weil's nomination for a top Department of Labor post on Wednesday evening, a significant blow to labor interests and Biden's domestic agenda.",
    "Weil's defeat casts further doubt on whether the centerpiece of Biden's labor agenda, the PRO Act, can pass, even with Democratic control of both chambers of Congress.",
    "Moreover, it was an embarrassment for Democratic Party leadership, who tend not to bring nominations to the Senate floor unless they know the party can win the vote.",
    "Weil faced opposition from business groups over concerns that he would implement harsh regulations on independent contractors and franchises.",
    "\"This was not something I expected, honestly,\" the group's president David Williams told the Free Beacon.",
    "Weil's nomination was brought to the floor and voted down by all 50 Republicans and three Democrats—Sens.",
    "Typically, the outlet wrote, party leadership pulls nominees in order to save face before a doomed vote.",
    "The vote was described in Politico as a \"fiasco\" and a \"kind of thing [that] just doesn't happen.\"",
    "\"I think Schumer got bullied into doing this and now he has egg on his face.\"",
    "Schumer's and Durbin's offices did not respond to a request for comment.",
    "Joe Manchin (W.Va.), Kyrsten Sinema (Ariz.), and Mark Kelly (Ariz.).",
    "\"They couldn't get to Harris in time,\" the individual said.",
    "\"Democrats are just really bad at this,\" the staffer said.",
    "\"I'm not surprised their whip operation f-cked up.\"",
    "\"It's not like anyone was working in their office.\""
  ]
}