{
  "id": 10303,
  "mediaId": 2741,
  "date": "2022-03-31",
  "headline": "A Biden Labor Pick Was Vocal About Protecting Gig Workers. Three Democrats Helped Tank His Nomination.",
  "image": "https://media.vanityfair.com/photos/6245c61d5c979a86c628fbb4/16:9/w_1280,c_limit/1239235060",
  "link": "https://www.vanityfair.com/news/2022/03/manchin-sinema-kelly-sink-david-weil-labor-nomination",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Lutz",
  "authorUrl": "https://www.vanityfair.com/contributor/eric-lutz",
  "termIds": [
    0
  ],
  "sentences": [
    "Weil will, if confirmed again, once more use the power of the DOL beyond Congressional intent to enact policies that will harm workers and small businesses during the economic recovery,” a coalition of 14 industry organizations wrote in a 2021 letter, adding that he is “unfit” for the post because of a “bias against employers.”\n“Most workers are employees,” Weil said in a guidance he issued in 2015, acknowledging that though independent contracting can be “advantageous” for workers and businesses alike, “improperly” identifying workers as such can deprive them of “important workplace protections.” Misclassification can also mean “lower tax revenues for government and an uneven playing field for employers who properly classify their workers,” Weil added in that advisory.",
    "Originally confirmed 51-42 to serve in the wage enforcement role in 2014, with Manchin voting “yea,” Weil emerged as a key critic of exploitation of workers in the gig economy, taking aim at businesses that “intentionally misclassified” their workers to help them “cut costs and avoid compliance with labor laws.” As Politico reports, business groups — including Americans for Tax Reform, which called Weil a “radical academic” in message aimed at Sinema and Manchin — have been directly appealing to conservative and moderate Democrats to tank his nomination.",
    "“It’s afraid that Weil will apply existing standards we’ve had for decades but have not, in recent years, enforced with much vigor.” For his opponents, though, that made him an “out-of-touch academic,\" as GOP Senator Mike Braun referred to him on Tuesday, claiming that his positions were actually “anti-worker.”\n“Businesses are willing to pay more if they can hire the right people,” the Wall Street Journal argued in a January editorial opposing Weil’s confirmation.",
    "— Grimes on Music, Mars, and Her Secret New Baby With Elon Musk\n— Trump Is Blowing a Gasket Over His Joke of a Social Media Network\n— How the Atlanta Spa Shootings Tell a Story of America\n— Inside the Succession Drama at Scholastic\n— Trump Is Now Spitballing Ways to Launch More Russian War, Then “Sit Back and Watch”\n— The Psychology Behind Putin’s War\n— From the Archive: How a Once Faceless Putin Took Control of the World’s Largest Country\n— Not a subscriber?",
    "“I’m incredibly disappointed to see Dr. Weil, an exceptionally qualified nominee with a long track record fighting to ensure workers get the wages they have earned, did not get the votes tonight to be confirmed,” Democratic Senator Patty Murray, who chairs the committee on Health, Education, Labor and Pensions, said in a statement following the 47-53 vote.",
    "Conservative Democrats Joe Manchin, Kyrsten Sinema, and Mark Kelly joined with their Republican colleagues on Wednesday to sink David Weil’s bid to lead the Department of Labor’s Wage and Hour Division, the post he held under Barack Obama, following a significant lobbying effort against him by business groups.",
    "It was the latest blow to Biden and Democratic leaders to be dealt from Manchin and Sinema, who have held up major pieces of their own party’s agenda, and represented a victory for the corporate interests that had pressed the conservative Democrats to oppose Weil.",
    "It was too much of a risk to take.”\nIt also apparently resonated with Arizona Democrats Kelly and Sinema, the latter of whom has been a regular holdout with Manchin on big ticket Biden agenda items that stand no chance of overcoming Mitch McConnell’s filibuster.",
    "“Despite this outcome, I will never stop fighting for working families and for a fully staffed DOL with leaders committed to protecting workers.”\nIt was Weil’s “long track record” of fighting for workers that appeared to derail his nomination.",
    "“The business lobby isn’t afraid that Weil will apply some exotic new standard for determining whether somebody working off the books is a legitimate gig worker,” the New Republic’s Timothy Noah wrote in February.",
    "After dooming his confirmation, Sinema said through a spokesperson that she harbored “concerns with his ability to faithfully execute and uphold the law.” It appears corporate America's campaign worked.",
    "This claim, that Weil’s enforcement would be bad for business and thus bad for workers, has been most prominent among Republicans, who cheered as Donald Trump reversed Obama-era labor policies.",
    "But it also found favor in conservative Democrats like Manchin, who has been expressing concerns about Weil’s nomination since last year, when Biden’s pick had stalled in the Senate.",
    "“Everything I have is franchisees and small businesses and he’s been very, very outspoken about their role and how he opposes what they’ve been doing.",
    "For his supporters, that view was emblematic of an administrator who championed workers and sought to properly enforce the Fair Labor Standards Act.",
    "“But they don’t need a regulator whose main goal is to use coercion to raise costs for employers trying to emerge whole from the pandemic.” ??",
    "He has continued to call for reform, including by taking direct aim at prominent gig economy companies like Uber and Lyft in an op-ed in 2019.",
    "“I thought David Weil just is against small businesses in West Virginia,” Manchin said of his decision to vote against his confirmation.",
    "No one Joe Biden nominated for a post in his administration had failed on the Senate floor — until now.",
    "Numerous lobbying groups, including the Chamber of Commerce, have also railed against Weil.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "— Can Ukrainian Freedom Fighters Stand Up to the Russian Military?",
    "It looks like we're experiencing playback issues.",
    "Our bad!",
    "“Dr."
  ]
}