{
  "id": 10398,
  "mediaId": 2720,
  "date": "2022-03-31",
  "headline": "Key Biden Nominee Blocked by Senate After 3 Democrats Side with Republicans",
  "image": "https://thefederalistpapers.org/wp-content/uploads/2022/03/Manchin-Sinema-Kelly.jpg",
  "link": "https://thefederalistpapers.org/us/key-biden-nominee-blocked-senate-3-democrats-side-republicans",
  "mediaOutlet": "thefederalistpapers.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Davis",
  "authorUrl": "https://thefederalistpapers.org/author/wj",
  "termIds": [
    0
  ],
  "sentences": [
    "“Chief among the concerns with his record: promulgation of a job-killing overtime rule in 2016 that overstepped and was therefore struck down by the U.S. District Court; an arbitrarily strict standard for classification of independent contractors in 2015; and a destructive expansion of ‘joint employer’ definition in 2016 that led to a 93 percent increase in litigation,” the letter said.",
    "Motion to advance David Weil’s nomination just failed, with three Dems – Manchin, Sinema, Kelly – voting against him https://t.co/NTBmNVdRwh @PaigeSmithNews https://t.co/BmFhGeZ7kf\n— Josh Eidelson (@josheidelson) March 31, 2022\nThe International Franchise Association also called for Weil not to be confirmed.",
    "“IFA strongly urges all senators to oppose the nomination of David Weil to the Wage and Hour Division of the Department of Labor,” Michael Layman, the group’s senior vice president for government relations and public affairs, said in a statement on Tuesday.",
    "Weil’s track record previously serving in this role and his ideological agenda leaves no doubt that his policies would harm the hundreds of thousands of local franchise businesses around the country and the 8.2 million workers they employ,” Layman said.",
    "https://t.co/K24ckOuuwl\n— IFA (@Franchising411) March 31, 2022\n“At a time when we are counting on small businesses to rebuild our economy, we ask all senators to reject this flawed nomination and protect local businesses and their workers,” he said.",
    "Weil’s stalled nomination was revived in January when Senate Democrats used the absence of Republican Sen. Rand Paul of Kentucky on the Senate Health, Education, Labor, and Pensions Committee to advance the nomination to the floor.",
    "IFA thanks @SenatorSinema @Sen_JoeManchin @SenMarkKelly and all 50 Republicans who stood up for local franchise businesses and workers across the country by voting against the nomination of David Weil to @WHD_DOL.",
    "“The lack of sufficient support for Dr. Weil’s [nomination] is not surprising given actions he took during the Obama Administration as Wage and Hour Administrator,” read the letter from Republican Sens.",
    "— Senator Mike Braun (@SenatorBraun) March 29, 2022\nATR had been urging Sinema and Kelly to oppose Weil, highlighting what the group said would be the negative impacts on Arizona if he were confirmed.",
    "In January, a group of Republican senators called on Biden to scrap the nomination, which was facing headwinds at the time, according to a letter posted on the Americans for Tax Reform website.",
    "Kyrsten Sinema and Mark Kelly of Arizona and Sen. Joe Manchin of West Virginia joined the Senate’s 50 Republicans to defeat a motion that would have advanced Weil’s nomination.",
    "The future of entrepreneurs and the gig economy in America will be in danger if David Weil is confirmed as the Administrator of the Department of Labor Wage and Hour Division.",
    "Mike Braun of Indiana, Richard Burr of North Carolina, Tim Scott of South Carolina, Bill Cassidy of Louisiana, Roger Marshall of Kansas and Jerry Moran of Kansas.",
    "“Weil would impose a California-style test to force independent contractors to reclassify as W-2 employees, a death blow to freelancers across Arizona.",
    "Three Senate Democrats on Wednesday torpedoed President Joe Biden’s controversial pick to head the Labor Department’s Wage and Hour Division.",
    "“Weil wants to end Right to Work laws, forcing every Arizonan to choose between paying a union boss or putting food on the table,” ATR said.",
    "“Weil has also attacked franchising, a business model that supports over 153,000 jobs and $5.5 billion in payroll in Arizona,” it said.",
    "This policy has destroyed the livelihood of independent contractors throughout California,” the group said on its website.",
    "David Weil, first nominated in July, became the first Biden nominee to fail a Senate floor vote, according to Politico.",
    "Biden has once again nominated an out-of-touch academic that promotes anti-worker policies.",
    "This article appeared originally on The Western Journal.",
    "Democratic Sens.",
    "“Dr."
  ]
}