{
  "id": 1042,
  "mediaId": 2643,
  "date": "2022-02-10",
  "headline": "Gunshot Victim Gabby Giffords' Husband Target of 'Shooting' Ad by Opponent",
  "image": "",
  "link": "https://www.newsweek.com/gunshot-victim-gabby-giffords-husband-target-shooting-ad-opponent-1678238",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Thomas",
  "authorUrl": "https://www.newsweek.com/authors/jake-thomas",
  "termIds": [
    0
  ],
  "sentences": [
    "Shannon Watts, the founder of gun control group Moms Demand Action, responded with a tweet calling the ad \"DISGUSTING,\" and referenced how Kelly's wife, former U.S. Representative Gabby Giffords, was shot in the head during a 2011 assassination attempt at a grocery store in Tucson.",
    "A Republican Senate candidate is being criticized for airing an ad depicting himself in an Old West-style shootout with opponent Mark Kelly, whose wife was shot and nearly killed 10 years ago.",
    "The trio of masked outlaws are thinly veiled references to Kelly, presented as \"Shifty Kelly\"; Biden, presented as \"Old Joe\"; and House Speaker Nancy, presented as \"Crazyface Pelosi.\"",
    "Gang against the backdrop of an Old West town, a crowd of townspeople shout out grievances of \"being pushed around,\" not wanting \"open borders\" and suffering high \"gas prices.\"",
    "\"I think I might single handedly solve the Arizona drought with all the snow flakes that are melting over my Super Bowl ad,\" Lamon said in a tweet responding to Swalwell.",
    "So they've gone all in on using violence as a path to power,\" California Democratic Representative Eric Swalwell said in a tweet responding to the ad.",
    "In 2019, Giffords led chants of \"vote them out\" at a rally she held outside the National Rifle Association's (NRA) Fairfax, Virginia, headquarters.",
    "The ad posted online Thursday targets Kelly, a Democrat seeking to keep his Senate seat in a state President Joe Biden narrowly carried in 2020.",
    "Kelly, a Navy captain and NASA astronaut, won the Senate seat in a 2020 special election with 51 percent of the vote.",
    "Lamon has been unrepentant about the ad, which he said on Twitter would run during the Super Bowl.",
    "The gunman killed six others, while Giffords continues her recovery from a serious brain injury.",
    "It features Republican candidate Jim Lamon as a frontier-era lawman squaring off with the \"D.C.",
    "It's time for a showdown,\" Lamon says, before shooting pistols out of the gangs' hands.",
    "Lamon will face off with other Republicans for the party's Senate nomination in August.",
    "She's since retired from elected office and formed a gun law reform organization.",
    "\"Well, if it isn't Big Jim Lamon,\" the man resembling Biden says.",
    "\"The good people of Arizona have had enough of you.",
    "\"Republicans don't have any ideas to help you.",
    "Newsweek has reached out to Lamon's campaign.",
    "He'll go before the voters again in 2022.",
    "The ad ends with the gang running away.",
    "Kelly's campaign declined to comment.",
    "And they can't win elections.",
    "As Lamon confronts the D.C.",
    "Gang.\""
  ]
}