{
  "id": 10428,
  "mediaId": 2752,
  "date": "2022-04-01",
  "headline": "Chris Pine Is A Ringer For His Icon Grandma! Tabs, Fri., April 1, 2022",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTYyMTgyMC9vcmlnaW4uZ2lmIiwiZXhwaXJlc19hdCI6MTY4ODU1OTk3N30.p2fnllij44md8fqWPFeM098Ejrwb1dBovvsGP7wB8vE/img.gif?width=1200&coordinates=0%2C50%2C0%2C50&height=600",
  "link": "https://www.wonkette.com/tabs-fri-april-1-2022",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Schoenkopf",
  "authorUrl": "https://www.wonkette.com/u/rebecca_schoenkopf",
  "termIds": [
    0
  ],
  "sentences": [
    "They knew Hurd would offer a set of solutions—the mass streamlining of legal immigration for both high-skilled workers and low-skilled laborers; the construction of a cutting-edge “virtual wall” utilizing cameras and fiber-optic cables to monitor illegal crossings; the granting of citizenship to millions of “Dreamers”; the surge of funding to local agencies dealing with a mass influx of asylum seekers—that would antagonize the loudest voices in both party bases.",
    "(Ruling)\nWill Hurd's an interesting fellow, and this is an interesting profile, but this is stupid or else writer Tim Alberta's pulling a fast one:\nWhy wouldn’t the [Democratic and Republican House leaders] want Hurd’s input?",
    "Tanking a Biden Labor nomination — a man who served in the position under Obama, where he made decisions that said salaried employees had to meet a minimum wage too, waaaah — with Sinema and Manchin is not going to help him.",
    "Obviously rents and house prices are insane and getting insaner, but I just can't imagine that \"social housing\" will ever catch on here anymore than you could pass rent control anywhere in this dumb country right now.",
    "(Politico)\nLAPD and LASD just absolutely wilding on young journalists, who are often minorities, because are they even reporters really, and like sometimes protesters wear press passes to confuse cops.",
    "This is clearly not based on her identity as a trans woman, because she is mostly known for being a very cogent talk lady people really like listening to (just kidding), so YOU shut up!",
    "And maybe you'd even believe it until you get to the part where they lie about the KPCC reporter not identifying herself and then say nobody's even heard of KPCC anyway.",
    "This is a fascinating profile of San Francisco's progressive prosecutor Chesa Boudin, who is, of course, facing a recall and has been since the moment he was elected.",
    "I don't understand this voting rights ruling in Florida except that it is PRETTY MAD and also the Supreme Court is PRESUMABLY GONNA OVERRULE IT.",
    "(Order)\nNow nobody can ever say again that Fox News is spreading shocking anti-trans hate, because it hired Caitlyn Jenner as a commentator.",
    "(LA Times)\nIf we all just reclassify all Stand Your Ground killings as justifiable homicides, maybe we can have a murder rate of \"none\"!",
    "That guy's a Democrat now, like all the other conservative Democrats who maybe would have been Republican before but shit got too dumb.",
    "— Rent Cafe\nBruce Willis has aphasia, a devastating brain impairment that destroys our ability to communicate, and will quit acting.",
    "(AP)\nThis is extra stupid, Chuck Todd does an okay job pushing back, and there's ever so much more to it than just the quoted part.",
    "He was adopted by GOP betes noirs Bill Ayers and Bernadine Dohrn after his parents went to prison for \"Weather Underground.\"",
    "(Amazon Wonkette cut link)\nChris Pine's grandma may have been a knockout (and she was), but no he doesn't look like her.",
    "— ProPublica\nBenjamin Wittes on Judge David Carter's order ruling that the former president is a big old crook.",
    "Go get your credit card, click the widget below, choose an amount and then \"monthly\" and then VOILA!",
    "(National Aphasia Association) You have of course all read The Man Who Mistook His Wife for a Hat.",
    "(Google Chris Pine's grandma)\nPlease keep Wonkette going forever, if you are able!",
    "I bet if you were a Republican lunatic, you would have already known that!",
    "Because they knew he wasn’t going to tell them what they wanted to hear.",
    "(The American Prospect)\nHow much apartment space can you get for $1500?",
    "— The Atlantic\nSen. Mark Kelly needs to choose his friends better.",
    "(Also robbing banks and a shootout with the cops and shit.)",
    "As per usual, LA Sheriff Alex Villanueva can get fucked.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "That is the Democratic immigration platform.",
    "— David Folkenflik at NPR\nOr listen below!",
    "He looks like Team America: World Police.",
    "It just seems like a long goddamn shot.",
    "How often would you like to donate?",
    "(ABC 10) Aphasia therapy guide.",
    "I don't want to shit on it!",
    "(Lawfare) And the order.",
    "You have made our day!",
    "The answer is LOL!",
    "I'm not a NIMBY!",
    "Nah man.",
    "Simple."
  ]
}