{
  "id": 10473,
  "mediaId": 2520,
  "date": "2022-04-01",
  "headline": "Controversial border health restriction Title 42 to end in May, the CDC says",
  "image": "https://www.gannett-cdn.com/presto/2022/03/22/PPHX/50dae07a-cdea-4e1e-8f3f-82d362fc19f5-Rally_for_asylum_seekers_1.jpg?crop=3399,1912,x0,y210&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/border-issues/2022/04/01/agents-stop-expelling-migrants-under-title-42-may-23/7246727001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clara Migoya",
  "authorUrl": "https://www.azcentral.com/staff/5394304001/clara-migoya/",
  "termIds": [
    0
  ],
  "sentences": [
    "Opinion:Biden just dug a border-sized pothole in Sen. Mark Kelly's path to re-election\nThe Kino Border Initiative, a binational organization in Nogales, Sonora, and Nogales, Arizona, that provides humanitarian aid, said officers should start using \"their discretionary power to immediately begin exempting the most vulnerable individuals and families\" even during this termination period.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\n\"We are increasing our capacity to process new arrivals, evaluate asylum requests, and quickly remove those who do not qualify for protection.\"",
    "Terminating the order in two months will \"enable the Department of Homeland Security to implement appropriate COVID-19 protocols, such as scaling up a program to offer COVID-19 vaccinations to migrants, and prepare for full resumption of regular migration under Title 8 authorities,\" the CDC said in its public health assessment.",
    "As the chair of the Senate Homeland Security and Governmental Affairs border management subcommittee, Sinema wants a public hearing next month with Mayorkas and leaders of the Southwest Border Coordination Center to \"question them about the feasibility and workability of such a plan,\" Sinema told The Republic.",
    "\"From my numerous visits to the southern border and conversations with Arizona’s law enforcement, community leaders, mayors, and nonprofits, it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities,\" Kelly said in a written statement.",
    "The policy banning asylum-seeking individuals stayed in place even as COVID-19 vaccination rates grew, sporting events, concerts and international flights resumed, states lifted mask mandates and the border reopened for vaccinated visitors in November 2021.",
    "In the months to come, the administration will face the challenges of both addressing security concerns at the border and increasing agencies' capacity to process asylum-seeking migrants in a \"fair, orderly and humane\" manner.",
    "In February 2022, the department created the Southwest Border Coordination Center to respond to a variety of migration scenarios, including one that projects 18,000 encounters a day with migrants across the southwest border.",
    "Jeremy Robbins, executive director of the American Immigration Council, said in a statement that Title 42 represented “the greatest restriction on access to the asylum process since Congress passed the Refugee Act in 1980.\"",
    "Officials with the Kino Border Initiative and the Florence Project said they \"remain ready, willing, and able to embrace this opportunity to collaborate with the administration\" and expects it will hold up to its promise.",
    "Republicans blamed Biden for creating a crisis through \"open border policies\" even while the administration kept Title 42 in place and expelled hundreds of thousands of migrants without due immigration procedures.",
    "Kyrsten Sinema, D-Ariz., and Mark Kelly, D-Ariz., had urged President Joe Biden's administration against lifting Title 42 before a plan was in place to protect Arizona border communities from becoming overwhelmed.",
    "Katko, ranking GOP member on the House Homeland Security Committee, said in a statement the end of the Title 42 policy was \"irresponsible\" as agents are seeing a record-breaking number of arrests at the border.",
    "For two years, people fleeing violent threats or political persecution were largely denied the right to seek protection in the U.S. and were sent back to Mexican border towns or the country they were fleeing.",
    "\"Today's news does not change the horror that this policy has needlessly inflicted on tens of thousands of people for the last two years,\" the Florence Project and Kino Border Initiative said in a statement.",
    "“Today’s decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border,\" Sinema said Friday in a written statement.",
    "\"This reckless move further lines the pockets of the cartels and human traffickers who have profited exorbitantly from President Biden’s rollback of commonsense border security policies,\" Katko said.",
    "The public health authority used to immediately expel migrants crossing through the U.S. land borders will effectively end on May 23, the Centers for Disease Control and Prevention announced Friday.",
    "The Southern Poverty Law Center said the administration should have ended Title 42 immediately: “The continued use of this policy — even for the next two months— is indefensible and unjustified.\"",
    "\"With today’s irresponsible rollback of the Title 42 public health authority, the Biden administration is throwing gasoline on a raging fire,\" Rep. John Katko, R-N.Y., said in a statement.",
    "\"That inherently includes working openly and collaboratively with partner organizations on the ground, like ours, to welcome all people seeking protection with dignity,\" they said.",
    "The CDC determined that the public health order is no longer necessary after considering the wide range of mitigation measures and the low community levels of COVID-19 nationwide.",
    "Kelly, who is up for re-election this year, called the decision to end Title 42 without a plan for \"a secure, orderly, and humane process at the border\" wrong and unacceptable.",
    "“We have put in place a comprehensive, whole-of-government strategy to manage any potential increase in the number of migrants encountered at our border,\" Mayorkas said.",
    "That beacon was diminished, if not nearly extinguished, during the Trump years,” said Patrick Gaspard, CEO of the Center for American Progress, a liberal think tank.",
    "Organizations called on the Biden administration to work swiftly and build up the resources necessary to resume humane and safe asylum processing at the U.S. border.",
    "Human smugglers will take advantage of the situation, Homeland Security Secretary Alejandro Mayorkas said in a statement announcing the termination of the policy.",
    "'Whole-of-government' response\nHomeland Security is expecting the end of Title 42 will significantly increase irregular migration to the U.S. southern border.",
    "Human rights and immigration advocacy organizations applauded the end of the \"obscure public health law\" as a step forward in upholding asylum-seeking rights.",
    "In the next two months, the department will put additional COVID-19 protocols in place, including expanding vaccination campaigns, the press release said.",
    "Customs and Border Protection will resume processing all noncitizens crossing the border unlawfully through its Title 8 statutory immigration authority.",
    "The plans will include an increase of law enforcement and medical personnel and an extension of existing contracts with detention facilities.",
    "Since its enactment, Title 42 was criticized by public health experts and human rights advocates who repeatedly called for its removal.",
    "Two weeks ago, Sinema and Kelly advised Biden to keep Title 42 in place until the administration has a \"comprehensive response plan.\"",
    "At the current rate, agents and officers likely will meet or exceed 2 million arrests at the border this fiscal year.",
    "Organizations working at the Arizona-Sonora border welcomed the decision but underscored the damage had been done.",
    "Let me be clear: those unable to establish a legal basis to remain in the United States will be removed,\" he said.",
    "“For centuries, the United States has been a beacon of hope to those seeking safety from persecution and violence.",
    "The 1944 law lacked a science-based rationale, ignored refugee law and was used for political purposes, they said.",
    "Reach the reporter at cmigoya@arizonarepublic.com or send a direct message in Twitter to @ClaraMigoya.",
    "The record-breaking number of encounters of the past years compare only to those seen two decades ago.",
    "The end of the controversial policy generated a flurry of reactions on both sides of the aisle.",
    "\"We know that smugglers will spread misinformation to take advantage of vulnerable migrants.",
    "Until the May date, border agents will continue to use the health rule known as Title 42.",
    "The Homeland Security Department is expecting greater increases once Title 42 ends.",
    "\"Our border security and immigration system cannot handle any more pull factors.\"",
    "Some deemed the policy necessary, even if it didn't comply with asylum law.",
    "The southern U.S. border is seeing unprecedented irregular migration.",
    "Have news tips or story ideas about the Arizona-Sonora borderlands?",
    "Advocates underscored the decision was long overdue.",
    "The use of Title 42 was unprecedented.",
    "'Long-overdue' or 'reckless move'?",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "Few exceptions were made.",
    "Sens."
  ]
}