{
  "id": 10532,
  "mediaId": 2644,
  "date": "2022-03-31",
  "headline": "Joe Manchin leads Democrats’ calls for CDC to keep Title 42 in place",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/joe-manchin-migrants-children-mexico-border.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/31/manchin-leads-democrats-calls-for-cdc-to-keep-title-42-in-place/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Callie Patteson",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Texas Democratic Reps. Henry Cuellar and Vincente Gonzalez — along with more than a dozen Lone Star State Republicans — signed on to a Tuesday letter to Homeland Security Secretary Alejandro Mayorkas and Health and Human Services Secretary Xavier Becerra, warning that ending Title 42 would produce “catastrophic results.”\n“We understand that this legal authority is temporary and tied to the COVID-19 public health emergency, but DHS appears unprepared to handle a likely unprecedented increase in apprehensions along the southwest border,” the lawmakers wrote.",
    "Until the administration does that type of consultation with local government leaders and nonprofits along the border, it is premature to consider changes to Title 42 authorities.”\nFar from the southern border, Sen. Maggie Hassan (D-NH) — who, like Kelly, is up for reelection in November — tweeted Wednesday: “I am concerned that there is not a sufficient plan in place to address the steep increase in border crossings that could result from this reported decision.",
    "“That is four times higher than the 400,000 encounters reported the previous year, and we are on pace to set a new record again this year.”\nOn Wednesday, reports indicated that the Biden administration would scrap Title 42 by May 23, ending the pandemic-induced order allowing border officials to immediately expel migrants who attempt to enter the US without allowing them a chance to claim asylum.",
    "“Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your Administration not to make any changes to Title 42 implementation until you are completely ready to implement and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border,” they said.",
    "“I urge you to again renew this commonsense policy that has been in effect — under both Republican and Democratic Administrations — since March 2020.”\nManchin pointed to recent increases in COVID-19 cases in the United Kingdom, Germany, Finland, and Switzerland as well as Asian nations as a result of BA.2.",
    "“With encounters along our southern border surging and the highly-transmissible Omicron BA.2 subvariant emerging as the dominate [sic] strain in the United States, now is not the time to throw caution to the wind,” Manchin (D-WV) wrote in a letter to CDC Director Dr. Rochelle Walensky on Tuesday.",
    "Moderate Sen. Joe Manchin has joined a growing chorus of Democrats calling on the Centers for Disease Control and Prevention to keep the Trump-era immigration policy known as Title 42 in place, citing rising cases of COVID-19 and an anticipated migration surge this spring.",
    "While liberals and immigration activists have criticized Title 42 as inhumane, Manchin is one of several Democrats urging the administration to keep it in place — with border state lawmakers citing a potential influx of up to 170,000 people if it is lifted.",
    "“Shanghai, for example, was recently forced to implement its most expansive lockdown policy in nearly two years,” Manchin wrote before citing a recent UK study that estimated the new variant transmits COVID-19 approximately 80 percent faster than Omicron.",
    "“Different sectors and border communities will require different resources, so the plan must be developed in consultation with local government leaders and community organizations, including those providing services to migrants,” Sinema and Kelly added.",
    "“It is not an immigration or migration enforcement measure.”\n“We have every expectation that when the CDC ultimately decides it’s appropriate to lift Title 42, there will be an influx of people to the border,” she added.",
    "This preemptive repeal threatens border security at a time when the administration should be focused on strengthening it.”\nThe White House has not released any timeline for lifting Title 42.",
    "And some U.S. intelligence estimates reportedly indicate that an influx of more than 170,000 migrants could materialize if the public health authority is lifted,” the letter continues.",
    "Kyrsten Sinema and Mark Kelly, both Arizona Democrats, issued a similar warning last week, citing the projected impacts on local communities and border security.",
    "On Wednesday, communications director Kate Bedingfield emphasized that a decision will be made following a CDC review that was due for completion Wednesday.",
    "“In fact, Axios reports that DHS estimates that 25,000 migrants reside in Mexican shelters just south of the U.S. border, waiting for Title 42 to end.",
    "In Fiscal Year (FY) 2021, encounters with migrants reached an all-time high of 1.7 million people,” the senator said.",
    "The policy has been used to expel migrants more than 1.7 million times, according to official estimates.",
    "“These challenges are compounded by the recent surge in migration occurring along our southern border.",
    "“Such groups in Arizona have not been consulted about Title 42 changes.",
    "“And so we are doing a lot of work to plan for that contingency.”",
    "“Title 42 is a public health directive,” Bedingfield said.",
    "Sens."
  ]
}