{
  "id": 10585,
  "mediaId": 8295,
  "date": "2022-04-04",
  "headline": "El fiscal general de Arizona pide a la corte que bloquee el plan de Biden de reabrir la frontera",
  "image": "https://cronkitenews.azpbs.org/wp-content/uploads/2022/04/brnovich-file-photo-800x500-1.jpg",
  "link": "https://cronkitenews.azpbs.org/2022/04/04/los-fiscales-generales-del-estado-piden-a-la-corte-que-bloquee-el-plan-de-biden-de-reabrir-la-frontera-a-los-solicitantes-de-asilo-en-mayo/",
  "mediaOutlet": "cronkitenewsonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Por Brenda Muñoz Murguia/Cronkite Noticias",
  "authorUrl": "https://cronkitenews.azpbs.org/people/brenda-munoz-murguia/",
  "termIds": [
    0
  ],
  "sentences": [
    "La demanda, que también tiene al fiscal general de Luisiana, Jeff Landry, y al fiscal general de Missouri, Eric Schmitt, como demandantes, dice que el presidente Biden violó los procedimientos federales que requieren la publicación de avisos de la reglamentación propuesta en el Registro Federal, y requiere que la mayoría de las políticas tengan un retraso de 30 días a la fecha de vigencia.",
    "La demanda dice que los demandantes están desafiando “una calamidad inminente, provocada por el hombre y autoinfligida: la eliminación abrupta la única válvula de seguridad que evita que las desastrosas políticas fronterizas de esta Administración se conviertan en un caos y en un absoluto catástrofe”.",
    "“Me parece muy desafortunado que los republicanos de todo el estado sigan ese camino en lugar de comunicarse con la administración de Biden o el secretario Mayorkas y tener una conversación adicional sobre qué es lo que debemos hacer para mitigar los problemas que tenemos en la frontera”, dijo.",
    "En un comunicado de prensa, el general Brnovich afirmó que la revocación del Título 42 crearía un aumento en la frontera sur y abrumaría a las agencias de aplicaciones de la ley, y que la frontera de Arizona correría un gran riesgo por el tráfico de drogas y la actividad de los cárteles.",
    "PHOENIX – El fiscal general de Arizona, Mark Brnovich, está demandando a la administración de Biden por decidir la semana pasada levantar el Título 42, la medida que cerró la frontera a los migrantes y solicitantes de asilo durante la pandemia.",
    "“Si termina el Título 42, resultará en una crisis aún mayor en la frontera que tendrá un impacto devastador, no solo en los estados fronterizos, sino en todo el país”, dijo Brnovich en un tweet el lunes.",
    "El representante del estado de Arizona, César Chávez, quien también quiere un mejor plan, dijo el lunes que demandar a la administración de Biden no brinda ninguna solución al problema actual.",
    "Es inaceptable poner fin al Título 42 sin un plan y coordinación para garantizar un proceso seguro, ordenado y humano en la frontera”, dijo el viernes el senador Mark Kelly en un comunicado.",
    "La demanda, presentada por los fiscales generales republicanos, señala que muchos demócratas también están en contra de levantar la prohibición, incluidos los dos senadores de Arizona.",
    "El plan incluye agregar agentes y voluntarios para manejar el embotellamiento, expandir los Centros Centrales de Procesamiento y gastar más dinero en atención médica y transporte.",
    "El Department of Homeland Security dice que tiene un plan para el procesamiento de migrantes que abordará el salto esperado en los casos que se procesan en la frontera.",
    "Desde que se invocó el Título 42 en marzo de 2020, más de 1,7 millones de migrantes han sido rechazados, más de 300.000 de ellos en la frontera de Arizona.",
    "Pero la demanda señala que incluso el DHS, la agencia que hizo el plan, dijo que el sistema está “fundamentalmente quebrada”.",
    "La administración de Biden dijo que comenzaría a recibir inmigrantes y casos de asilo a partir del 23 de mayo.",
    "La demanda, presentada el domingo en el Western District Court de Luisiana de EE.",
    "UU., busca anular la orden de los CDC y mantener el Título 42 en su lugar.",
    "“Esta es la decisión equivocada."
  ]
}