{
  "id": 10648,
  "mediaId": 6512,
  "date": "2022-03-30",
  "headline": "Joe Biden's Administration to End Title 42 Expulsion by May; Republicans Push Back",
  "image": "https://1622179098.rsc.cdn77.org/data/images/full/142636/joe-bidens-administration-to-end-title-42-expulsion-by-may-republicans-push-back.jpg",
  "link": "https://www.latinpost.com/articles/154687/20220330/joe-biden-admin-to-end-title-42-expulsion-by-may.htm",
  "mediaOutlet": "Latin Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joshua Summers",
  "authorUrl": "",
  "termIds": [
    2765,
    5695,
    4873,
    4905,
    252,
    1126,
    1441,
    6383,
    6678
  ],
  "sentences": [
    "\"Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your Administration not to make any changes to Title 42 implementation until you are completely ready to implement and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border,\" the Democrats noted.",
    "In a press conference on Wednesday, U.S. Republican Senator John Cornyn said that the Border Patrol told him that if Title 42 expires without a plan on how to handle the volume of migrants, they will lose control of the border, per Texas Tribune.",
    "The outlet noted that an ICE officer told Washington Post that agency employees handling the enforcement within the country could be deployed to the southern border to give aid to the Customs and Border Protection (CBP).",
    "Joe Biden's Administration to Extend Title 42\nRepublicans have expressed their opposition in the ending of title 42, by writing a letter to the Biden administration and expressing their plea to extend the said policy.",
    "Meanwhile, there were reportedly 170,000 migrants waiting at the Mexico side of the border who will travel back to the United States and seek asylum, once the Title 42 expulsion was rescinded by Pres.",
    "Meanwhile, White House Director of Communications Kate Bedingfield directed the confirmation of Title 42's ending to the Centers for Disease Control and Prevention (CDC), according to New York Post.",
    "Sources familiar with the matter confirmed to Associated Press on Wednesday that the Trump-era policy may be absolved by May 23, but the decision of Biden's administration is not yet final.",
    "On Tuesday, Cornyn and other Republicans in Texas sent a letter addressed to Department of Homeland Security Secretary Alejandro Mayorkas and Human Services Secretary Xavier Becerra.",
    "\"We have every expectation that when the CDC ultimately decides it's appropriate to lift Title 42, there will be an influx of people to the border,\" Bedingfield noted.",
    "Biden Admin on the Influx of Migrants\nAccording to The Daily Mail, Immigration and Customs Enforcement (ICE) were warned to prepare for illegal border crossings.",
    "\"DHS appears unprepared to handle a likely unprecedented increase in apprehensions along the southwest border,\" the letter sent by the Republican reads.",
    "In the letter, the lawmakers asked them to extend Title 42, contending that the policy prevents Texas cities from becoming more overwhelmed by migrants.",
    "READ NEXT: 20 Mexican Drug Cartel Hitmen Storm Police Station in Mexico to Free Men of Los Zetas Boss 'Chuy 7'\nThis article is owned by Latin Post.",
    "The White House director of communication then mentioned that the Biden administration is doing a lot of work to plan for contingency.",
    "DHS confirmed on Tuesday that they are prepared for migrant flows to reach a \"very high\" contingency of around 18,000 people per day.",
    "President Joe Biden's administration is reportedly weighing to end the Title 42 expulsion along the U.S.-Mexico borders by May.",
    "According to AP, the president told reporters on Wednesday that they will have a decision on the matter soon.",
    "Arizona Democrats - Senators Kirsten Sinema and Mark Kelly - also made the same plea to the administration.",
    "The sources also shared that ending the policy by May will give ample time to prepare for the border.",
    "However, President Joe Biden did not blatantly confirm the date when Title 42 expulsion would end.",
    "They also cited the state of the DHS when it comes to responding to the influx of migrants.",
    "Written By: Joshua Summers\nWATCH: Biden Administration To Lift Title 42 In May - From MSNBC",
    "2022; Groups Say More Immigrants to Come If Title 42 Expulsion Ends\nRepublicans Urge Pres.",
    "Other Democrats have also been vocal about the possible effects of Title 42's suspension.",
    "READ NEXT: Border Patrol Chief Claims U.S. Will Encounter 1M Migrants in F.Y.",
    "Joe Biden's administration."
  ]
}