{
  "id": 10677,
  "mediaId": 2668,
  "date": "2022-04-01",
  "headline": "Manchin, Other Dems Blast 'Frightening' Biden Decision",
  "image": "https://media.townhall.com/townhall/reu/o/2019/232/2e36a60a-98d3-480a-b7ad-9f5e6d9a8a3c-1110x740.png",
  "link": "https://redstate.com/nick-arama/2022/04/01/manchin-other-dems-blast-frightening-biden-decision-thats-about-to-make-things-worse-n544093",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Arama",
  "authorUrl": "https://redstate.com/author/nick-arama",
  "termIds": [
    0
  ],
  "sentences": [
    "“After considering current public health conditions and an increased availability of tools to fight COVID-19 (such as highly effective vaccines and therapeutics), the CDC Director has determined that an Order suspending the right to introduce migrants into the United States is no longer necessary,” the Centers for Disease Control said in a statement earlier on Friday.",
    "But one of the few things that was preventing the situation from getting worse was something Biden wasn’t responsible for — Title 42, the public health policy that the government employed to expel illegal aliens saying it was essential to combat COVID.",
    "It’s unacceptable\"\n— Burgess Everett (@burgessev) April 1, 2022\nSen. Maggie Hassan (D-NH) also said that this would lead to a surge that the “administration does not appear to be ready for.” That’s a kind of way of putting how bad it’s going to be.",
    "Sinema and Kelly not happy w/ Biden on Title 42\nSinema: \"Today’s decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border.\"",
    "If Biden is going to end the Title 42 policy, he must have declared the pandemic over because he’s saying that we have nothing to be concerned about from the massive influx of thousands of illegal aliens a day.",
    "If Biden believes the pandemic is over, then he should also end all other COVID mandates and dictates, and take back all the members of the military that they have booted because they wouldn’t get vaccinated.",
    "Sen. Kyrsten Sinema (D-AZ) and Sen. Mark Kelly (D-AZ) — both from Arizona, one of the states likely to get inundated without the policy in place — blasted the decision.",
    "“We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy,” Manchin declared.",
    "This CBP source tells me that could mean skipping critical paperwork and vetting that would confirm they have the right name and date of birth for the person entering.",
    "Sen. Joe Manchin (D-WV), one of the voices of moderation in the Democratic Party, called Biden’s action a “frightening decision” that will only make everything worse.",
    "?One idea being floated: pulling medical personnel from Veterans Affairs to assist “We’re going to take medical services away from people that really deserve that.",
    "Perhaps one of the worst things that he has done is destroying the border policy that President Donald Trump had worked so hard to put in place.",
    "— Hillary Vaughn (@hillary__vaughn) March 31, 2022\nSo will these Democrats be working with Republicans to stop this from happening in May?",
    "But the Biden Administration has now caved to leftist activists and announced that they will be ending the Title 42 policy as of May 23.",
    "“We are nowhere near prepared to deal with that influx.” Manchin even said that he thought Title 42 should probably be permanent.",
    "But unfortunately, this is the consequence of Democrats putting a guy in power who is beholden to the radical agenda.",
    "According to Fox’s Hillary Vaughn, the Biden team’s response to the situation is going to make everything worse.",
    "So if you thought it was bad already, just wait, it’s about to get much worse when that tool goes away.",
    "The pandemic then doesn’t apply to illegal aliens but it does apply to Americans, according to Biden.",
    "We have seen Manchin and Sinema are willing to shoot Biden down and stand up for principle.",
    "Who went to combat…to give free medical attention to illegal migrants” CBP source tell me.",
    "They’re thinking about taking away care from veterans to deal with the illegal aliens.",
    "— Hillary Vaughn (@hillary__vaughn) March 31, 2022\nAnd checking who anyone is?",
    "Title 42 was put in place under the Trump Administration after COVID started.",
    "He doesn’t care if this hurts Arizona, any other state, or any Americans.",
    "Illegal entry across the border has hit historic highs under Joe Biden.",
    "Joe Biden has done so much harm to our country in such a short period.",
    "Even Democrats are excoriating Joe Biden over this decision.",
    "He doesn’t care if this sinks the Democrats in Arizona.",
    "This is always and only about that agenda.",
    "He wasn’t the only Democrat speaking out.",
    "Kelly: \"This is the wrong decision.",
    "Forget about that.",
    "?"
  ]
}