{
  "id": 10770,
  "mediaId": 2512,
  "date": "2022-03-17",
  "headline": "Earmarks in federal spending bill are floating the president's climate agenda",
  "image": "https://www.alternet.org/media-library/image.jpg?id=26628479&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.alternet.org/2022/03/spending-bill-earmarks-climate-agenda/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“But what we do see is that this gives an opportunity for members, not all of whom would normally be tapping into climate issues or concerns, to do that, whether it’s through land management or agricultural practices, weatherization of homes, and innovation investments.”\nNot all the earmarks in the bill are good for the planet.",
    "In addition to expanding the military’s budget and sending aid to Ukraine, the appropriations bill as a whole ultimately directed increases in funding to federal agencies that are seeking to limit the effects of climate change as part of the Biden administration’s larger climate agenda.",
    "Earmarks like these are advocated for by members of Congress who are often trying to meet a need their constituents have been vocal about, so the climate-related earmarks in the bill are a reflection of what some communities in the U.S. are saying is important to them.",
    "Last week, as Russian soldiers and tanks pushed deeper into Ukraine, members of Congress came together in a rare show of bipartisan cooperation to rapidly approve and pass a $1.5 trillion government spending bill that will fund the federal government through September.",
    "Mike Levin, Democratic representative from California, got $9.3 million for shoring up coastal bluffs in San Clemente, another $5 million for pedestrian infrastructure, and $2.4 million for a water desalination project in his district.",
    "“The fact that so many members are requesting climate adaptation measures indicates the measure to which climate change is affecting daily lives,” Jared Leopold, cofounder of the climate policy nonprofit Evergreen Action, told Grist.",
    "A senator or representative is more likely to vote for something if they can go home to their constituents and show them that the bill they voted for contains funds specifically earmarked for a popular community project or proposal.",
    "But Democratic leadership succeeded in bringing earmarks back for yearly budget appropriation bills this year, thanks to waning distaste for the practice and an appetite among Democrats and even a few Republicans to renew them.",
    "“I don’t see earmarks being any kind of replacement for a broader climate strategy,” Ryan Fitzpatrick, director of the climate and energy program at the climate and energy nonprofit Thirdway, told Grist.",
    "The 2,700-page bill, which President Joe Biden signed on Tuesday, averts a government shutdown, amply funds domestic programs and the military, and channels $13.6 billion in emergency aid to Ukraine.",
    "All of the earmarks in the omnibus bill, not just the climate ones, comprise only 1 percent of total discretionary spending, or spending that lawmakers control through annual appropriations bills.",
    "Biden’s Build Back Better Act, which has passed the House but not the Senate, contains upward of half a trillion dollars for clean energy tax credits, electric vehicles, and more.",
    "“I think you saw a lot of adaptation money through a lot of the various projects,” said Casten, who used to work in the clean energy industry (and also used to write for Grist).",
    "The Centers for Disease Control and Prevention’s Climate and Health program is getting $10 million more to prepare for the public health consequences of rising temperatures.",
    "There’s also funding in the bill for infrastructure that will result in new emissions, such as a 44,035-square-foot indoor fitness center at an Air Force base in Nevada.",
    "In 2006, Randy “Duke” Cunningham, a Republican representative from California, went to prison for taking millions of dollars from a lobbyist for earmark-related favors.",
    "But Fitzpatrick said that all the earmarks, even the not-so-green ones, helped indirectly support climate action by galvanizing bipartisan support for the legislation.",
    "“If congressionally directed spending helps to bring people on board to continue to ramp up spending on things like clean energy and innovation, that’s a good thing.”",
    "Sean Casten, a Democratic representative from Illinois, secured $750,000 for an urban forestry project and another $785,000 for stormwater management improvements.",
    "For the first time in more than a decade, this omnibus funding bill included earmarks — provisions that direct funds to be spent on specific projects.",
    "That’s a step in the right direction, but Casten and other climate experts say that earmarks are no substitute for a top-down, federal climate plan.",
    "Senator Catherine Cortez Masto, a Democrat from Nevada who faces a stiff Senate race this fall, got $2 million for a fleet of zero-emission buses.",
    "The appropriations bill contains funding for climate science, flood resilience, beach restoration work, and clean transportation projects.",
    "They were meant to be used as a way to get members of Congress on board with big pieces of legislation by giving them skin in the game.",
    "Democratic senators and representatives used the opportunity to funnel federal funding to climate change projects across the nation.",
    "The United States Department of Agriculture is getting $78.3 million to address the climate crisis in farming and rural communities.",
    "Lobbying and gift rules were looser then, too, and some members of Congress appeared to be trading earmarks for money or favors.",
    "The Environmental Protection Agency is getting close to $10 billion to expand environmental enforcement and reduce pollution.",
    "The earmarked funding pales in comparison to the amount of funding Biden wanted for climate action at the federal level.",
    "“Again, it’s not everything we need it to be, but we have been seeing steady increases in funding,” Fitzpatrick said.",
    "With most of the president’s climate agenda stalled in Congress currently, every ounce of climate spending counts.",
    "Senator Mark Kelly, a Democrat from Arizona, took home funding for a light rail project in Phoenix.",
    "Prior to the mid-2000s, earmarks were a common accouterment of appropriations bills.",
    "In 2007, Democrats instituted stricter transparency laws around earmarks.",
    "But by the 1990s and early 2000s, the earmark system was being abused.",
    "So far, that may be a good thing from a climate perspective.",
    "In 2011, Republicans banned the practice completely.",
    "You can subscribe to its weekly newsletter here.",
    "This story was originally published by Grist.",
    "But the earmarks aren’t insignificant.",
    "But that’s not all the bill does.",
    "The list goes on."
  ]
}