{
  "id": 1085,
  "mediaId": 2528,
  "date": "2022-02-15",
  "headline": "Democrats weigh suspending federal gas tax to cut prices at the pump while Biden's economic agenda is on ice",
  "image": "https://i.insider.com/6205868ae2fe3c0019ea1104?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/democrats-gas-tax-holiday-cut-prices-biden-agenda-stalled-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Zeballos-Roig",
  "authorUrl": "https://www.businessinsider.com/author/joseph-zeballos-roig",
  "termIds": [
    0
  ],
  "sentences": [
    "Inflation has hit a four-decade high in recent months, the product of supply-chain bottlenecks and ongoing labor shortages helping push up the cost of groceries, housing, and most other goods and services.",
    "There's been few sign of organized discussions in recent weeks to revive a skinnier version of the package while the Senate deals with an elections overhaul and government funding among other priorities.",
    "A recent federal report showed prices rose 7.5% year-over-year in January\nSome economists are skeptical that a gas tax holiday will be effective at curbing rising prices at the pump.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "President Joe Biden, center, along with Senate Majority Leader Chuck Schumer, left, and House Speaker Nancy Pelosi at the Capitol on January 6, 2022 in Washington, DC.",
    "Kelly told Insider that he was pitching it to Senate Democrats at their weekly caucus lunch as \"something that directly helps people right now when they need it.\"",
    "\"The President already announced an historic release of 50 million barrels from the strategic petroleum reserve, and all options are on the table looking ahead.\"",
    "The Washington Post first reported on Tuesday that Senate Democrats and the White House were eyeing a measure to briefly shelve the gas tax through 2022.",
    "The proposed federal gas tax holiday ran into early opposition and skepticism from Senate Republicans, which may further complicate its path to passage.",
    "Sen. Mitt Romney of Utah told Insider that he was opposed because it could jeopardize highway funding, which is partially funded by the federal gas tax.",
    "The flurry of activity around the federal gas tax comes after a group of Senate Democrats unveiled legislation last week to suspend it for the year.",
    "Photo by Stefani Reynolds-Pool/Getty Images\nDemocrats and the Biden administration opened the door to a gas tax holiday to provide inflation relief.",
    "Jason Furman, a former top Obama administration, wrote on Twitter that the step could lead to higher profits for oil and gas companies.",
    "Democrats once had a $2 trillion legislative package aimed at expanding childcare, education, and combating the climate emergency.",
    "Democrats are starting to float an idea to try and combat rising prices eating into Americans' savings: a federal gas tax holiday.",
    "The pair face competitive re-election campaigns in the fall with the party trying to defend narrow Senate and House majorities.",
    "The bill would likely need 10 Republican votes so it clears the 60-vote threshold and avoid a filibuster in the upper chamber.",
    "Mark Kelly of Arizona and Maggie Hassan of New Hampshire would shelve the 18.4 cents per gallon tax until Jan. 1, 2023.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "But the House bill is dead on arrival in the Senate due to opposition from Sen. Joe Manchin of West Virginia.",
    "It's not anything that works to address the bigger problem,\" Sen. Lisa Murkowski of Alaska told reporters.",
    "\"Every tool is on the table to reduce prices,\" White House spokesperson Emilie Simons said in a statement.",
    "Senate Majority Leader Chuck Schumer said that Senate Democrats weren't coalescing behind the plan yet.",
    "One senior House Democratic aide also told Insider there was interest among House members as well.",
    "Some economists are also skeptical the idea will be effective at curbing prices at the pump.",
    "\"We're having a caucus discussion on it,\" he said at his weekly press conference.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "But its encountering early resistance from Republicans and even some Democrats.",
    "Manchin told reporters, \"I don't think that makes any sense right now.\"",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "The measure also encountered resistance among some Senate Democrats.",
    "The aide was granted anonymity to share internal dynamics.",
    "\"We haven't yet taken a caucus position on it.\"",
    "Other Republicans also struck a skeptical tone.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "\"It may give you momentary relief.",
    "Loading Something is loading.",
    "The measure from Sens."
  ]
}