{
  "id": 10873,
  "mediaId": 2520,
  "date": "2022-03-16",
  "headline": "After Zelenskyy speech, Arizona delegation calls for more aid to Ukraine without combat",
  "image": "https://www.gannett-cdn.com/presto/2022/02/28/USAT/a04fdbc0-4758-4b5a-b84a-2fbc4df97524-ZELENSKY_UKRAINE_PRES_OFFICE_AP.jpg?crop=1911,1075,x0,y0&width=1911&height=1075&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/03/16/arizona-delegation-calls-more-aid-ukraine-after-zelensky-speech/7060294001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald J. Hansen",
  "authorUrl": "https://www.azcentral.com/staff/2647673001/ronald-j-hansen/",
  "termIds": [
    2753,
    2459,
    3702,
    4591,
    1491,
    6672,
    6569,
    6286,
    5949
  ],
  "sentences": [
    "Putin must return to the negotiating table, stop the human suffering and end this conflict immediately.”\nSupreme Court won't let Arizona voters weigh in on tax cut Brnovich takes election manual fight with Hobbs to court Karrin Taylor Robson drops fundraising tactic after questions AZ House Speaker Rusty Bowers wins award for courage\nRep. Ann Kirkpatrick, D-Ariz., called Zelenskyy's words, which invoked Martin Luther King Jr. and the Sept. 11 terrorist attacks, \"a remarkable speech\" and called for the U.S. to be \"aggressively strategic.\"",
    "“America and our allies must arm Ukraine with offensive and defensive weapons that, in the judgment of our military professionals and diplomats, will enable Ukraine to impose steep costs on Russia and protect the Ukrainian people, while minimizing the chances that an unpredictable Putin will escalate his war in a deeply dangerous and destructive way.”\nReach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493.",
    "“The United States should continue providing military equipment and humanitarian support to Ukrainians, increase financial punishments on (Russian President Vladimir) Putin and his regime, and boost our cyber defense against Russian threats.”\nRep. Ruben Gallego, D-Ariz., a member of the House Armed Services Committee, told The Arizona Republic that more can still be done short of moving troops or planes into Ukraine.",
    "The (European Union) and the (United Nations) are well equipped to initiate a peaceful resolution of the Ukrainian border and Congress needs to focus on our border.”\nRep. Raúl Grijalva, D-Ariz., said Zelenskyy asked \"President Biden and Congress to put ourselves in the shoes of his citizens.\"",
    "I hope to hear from our Defense leaders on what the next appropriate steps are in providing additional military aid to Ukraine.”\nRep. Tom O'Halleran, D-Ariz., issued a joint statement with three other Democrats who are members of the centrist Blue Dog Coalition.",
    "The Pentagon last week rejected an offer from Poland to send its Russian fighter jets to Ukraine through the U.S., saying it wouldn't significantly change Ukraine's military prospects, but could pull NATO countries into the fight.",
    "\"I support the assistance that we continue to deliver and will support additional aid, short of U.S. intervention, to provide the Ukrainian people the means to protect themselves and mitigate the unfolding humanitarian disaster.",
    "But after weeks of shelling and the uncounted deaths of civilians, members of both parties are stepping cautiously around what more to do after already imposing far-reaching sanctions and commitments of further aid.",
    "\"Our country is in a bit of a hot spot because if we do get engaged in a no-fly zone and we see anything like U.S. fighters shooting down Russian fighters or vice versa, you have the potential of escalation.",
    "After Ukrainian President Volodymyr Zelenskyy's emotionally charged speech to Congress on Wednesday, Arizona's delegation largely agreed more needs to be done, but split on how far to go.",
    "Rep. Andy Biggs, R-Ariz., is often quick to criticize President Joe Biden, but acknowledged in an interview with Newsmax the danger of widening the war if the U.S. responds too directly.",
    "Sen. Mark Kelly, D-Ariz., a member of the Senate Armed Services Committee, said in an interview that enforcing a no-fly zone would require a level of involvement that he can't support.",
    "Rep. Paul Gosar, R-Ariz., called for prayer and peace between Russia and Ukraine, but sought to shift the conversation back to domestic concerns, especially on the Mexican border.",
    "During his 18-minute speech from Kyiv, Zelenskyy called on the U.S. to impose a no-fly zone over his country, send more military hardware and widen the sanctions against Russia.",
    "\"Sending any conventional weaponry that they know how to use and can use effectively should be on the table, including the surface-to-air missiles they requested,\" he said.",
    "\"Last week, I voted to approve $13.6 billion in aid to Ukraine, including military equipment to strengthen the country's air defense capabilities,\" he said in a statement.",
    "\"It's very unfortunate that a good part of the world has to react to the actions of a single individual who is now committing war crimes in Ukraine,\" Kelly said.",
    "The invasion of Ukraine has created fragile, bipartisan unity on Capitol Hill against Russia, even among most members of the state's usually polarized lawmakers.",
    "The fear by the Biden White House that this is an escalatory move is just not true,\" he said, noting that didn't happen when the Soviets armed North Korea.",
    "Kelly said the U.S. can still send Stinger anti-aircraft and Javelin anti-tank missiles, arms and ammunition, and night-vision gear among other hardware.",
    "\"In response, America must continue to work with our allies and partners to crush the Russian economy, degrading Putin’s ability to fund his war machine.",
    "Based on where this conflict is right now, we want to avoid being in direct combat operations with the Russian military and the Russian government.\"",
    "I stand with the people of Ukraine.”\nRep. Debbie Lesko, R-Ariz., also praised Zelenskyy for his words, but didn't sketch out what more to do.",
    "But I believe the U.S. can — and must — do more to counter Russia’s unprovoked aggression and indiscriminate attacks on Ukrainian civilians.",
    "We should ratchet up efforts across every domain to make Russia a pariah state, cutting it off from the community of responsible nations.",
    "“I had the honor of listening to President Zelensky this morning as he addressed Congress virtually from Kyiv,\" he said in a statement.",
    "In a written statement, Sen. Kyrsten Sinema, D-Ariz., called to continue the type of aid and sanctions the U.S. has used to this point.",
    "\"The world continues to witness Russia’s unprovoked and illegal attacks on a free, democratic, and sovereign Ukraine,” she said.",
    "\"President Zelensky’s virtual address to Congress was incredibly powerful, moving, and inspirational,\" she said in a statement.",
    "We should provide the resources necessary to care for the millions of Ukrainians who have been forced to flee their homeland.",
    "Last month nearly 165,000 lawbreakers crossed into our country, the twelfth straight month that 150,000 or more have done so.",
    "The U.S. can help facilitate Ukraine receiving Russian-made surface-to-air missiles that Zelenskyy requested in his remarks.",
    "\"We must continue to be aggressively strategic in how we use our power to help the Ukrainian people stand up for Democracy.",
    "Rep. David Schweikert, R-Ariz., called it an honor to listen to the speech, but offered no specific policy response to it.",
    "This could really trigger a much broader, general war than the Ukraine war if this administration's not very careful.\"",
    "“President Zelenskyy is right to ask for any and all assistance to help Ukraine defend herself,\" the statement said.",
    "\"This administration is falsely, actually suggesting sanctions against India for buying Russian military equipment.",
    "\"The images we saw of the devastation, despair and death were impossible to ignore,\" Grijalva said in a statement.",
    "Kelly also said adding sanctions to members of the Russian Duma is a \"reasonable\" possibility worth considering.",
    "\"During this dark time, my colleagues and I are committed to doing all we can to support the Ukrainian people.\"",
    "\"His bravery and courage, and that of all Ukrainians, in the face of Russian brutality is remarkable.",
    "We must be incredibly aggressive and unified in our sanctions against Russia, here and across Europe.",
    "Stanton also called for stepped-up sanctions on Russian President Vladimir Putin's political allies.",
    "Congress has acted on delivering humanitarian aid and we must continue to swiftly answer that call.",
    "\"I think there's some drone capability that they could be using that we could transfer to them.",
    "\"As we all know, Putin is a war criminal, and he cannot be trusted,\" she said in a statement.",
    "“I reject all efforts to get the United States involved in this war,\" he said in a statement.",
    "By contrast, Rep. Greg Stanton, D-Ariz., called the speech \"a sobering call to action.\"",
    "It’s time to provide Ukraine with military jets and additional anti-aircraft weapons.\"",
    "\"I don't really care how we skin the cat as long as we get the MiGs over to them.",
    "\"Our southern border is wide open and we are under a sustained invasion.",
    "\"Last year 105,000 Americans died from fentanyl smuggled in from Mexico.",
    "\"We would have to shoot down Russian airplanes,\" Kelly said.",
    "They pledged support, but not direct American involvement.",
    "\"These funds are critical to helping Ukrainian forces.",
    "\"We need you right now,\" Zelenskyy said at one point.",
    "I think we should transfer MiGs from Poland to them.\"",
    "Subscribe to our free political podcast, The Gaggle.",
    "Gallego doesn't think that's a realistic risk.",
    "Russia's already making overtures to China.",
    "Follow him on Twitter @ronaldjhansen.",
    "\"So now you're in a war with Russia.",
    "Subscribe to azcentral.com today.",
    "American lives are the priority.",
    "Support local journalism.",
    "\"It's just devastating.\""
  ]
}