{
  "id": 11,
  "mediaId": 2658,
  "date": "2022-02-24",
  "headline": "POLITICO Playbook: War in Europe",
  "image": "https://static.politico.com/48/1a/468879e6447bbc1402b47b1f4fdb/ap22055338556602.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/02/24/war-in-europe-00011319",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1750,
    3361,
    3702,
    4591,
    4905,
    810,
    1063,
    6569,
    6672
  ],
  "sentences": [
    "The prosecutors, CAREY R. DUNNE and MARK F. POMERANTZ, submitted their resignations because the new Manhattan district attorney, ALVIN BRAGG, indicated to them that he had doubts about moving forward with a case against Mr. Trump.”\nMEDIAWATCH\nTALK OF THIS TOWN — “Is Jen Psaki the next RACHEL MADDOW?” Puck’s Dylan Byers dives into that question, reporting that “Psaki intends to leave the White House at some point this year and, according to sources familiar with her thinking, intends to go into television news — not as a contributor, but as a host.”\nToward that end, the White House press secretary and her agent, JAY SURES, have taken lunch meetings with CNN execs AMY ENTELIS and REBECCA KUTLER, and MSNBC president RASHIDA JONES and NBC News chair CESAR CONDE — “the opening salvo in what is likely to be a long effort by several networks to court the woman who could potentially become the next big star in television news.” Also interested, per Byers: ABC News and CBS News.",
    "‘This is a grave breach of international law, and a serious threat to Euro-Atlantic security,’ he said, adding that “NATO will do all it takes to protect and defend all allies.”\nThe coverage — WSJ: “Ukraine Crisis Kicks Off New Superpower Struggle Among U.S., Russia and China” … NYT: “Putin Announces Start to ‘Military Operation’ Against Ukraine” … WaPo: “Russia unleashes military assault on Ukraine that Biden calls ‘premeditated war’” … AP: “Russia attacks Ukraine as defiant Putin warns U.S., NATO”\nFurther reading — “How Germany helped blaze Putin’s path into Ukraine,” by Matthew Karnitschnig in Berlin … “Putin puts China in a bind,” by Stuart Lau … “Voices from Ukraine: ‘It’s panic.’” by NYT’s Michael Schwirtz in Slaviansk … “The line Biden won’t cross on Ukraine,” by Nahal Toosi … “Opinion: Tucker Carlson Goes It Alone on Putin,” by Jack Shafer\nGood Thursday morning, and thanks for reading Playbook.",
    "“All servicemen of the Ukrainian army who fulfill this demand will be able to freely leave the combat zone and return to their families.”\nHe had a more bracing warning for the West: “Anyone who tries to interfere with us, or even more so, to create threats for our country and our people, must know that Russia’s response will be immediate and will lead you to such consequences as you have never before experienced in your history.”\nIn case it was unclear what he meant, Putin also said the following, per a translation by Zoya Sheftalovich: “As for the military sphere, modern Russia, even after the collapse of the USSR and the loss of a significant part of its nuclear potential, is today one of the most powerful nuclear powers.",
    "A TEST FOR NATO — KRIŠJANIS KARINŠ, the PM of Latvia, the former Soviet republic that became a member of NATO in 2004, called for consultations under Article 4 of the NATO charter, which says, “The Parties will consult together whenever, in the opinion of any of them, the territorial integrity, political independence or security of any of the Parties is threatened.”\nBiden has promised that no American troops will be involved in the fight for Ukraine, but if the war spills into Latvia or another NATO country, America is obligated to come to their defense.",
    "“The new map, drawn by a nonpartisan panel of four redistricting experts, appeared to split North Carolina’s congressional districts roughly equally between Republicans and Democrats.”\nJAN. 6 AND ITS AFTERMATH\nIVANKA ENGAGING WITH JAN. 6 COMMITTEE — IVANKA TRUMP is in discussions to possibly cooperate with the House Jan. 6 committee, and appears to have “at least some degree of openness regarding its probe — despite the unstinting vitriol that Trump has leveled at it,” our Betsy Woodruff Swan and Heather Caygle report for Congress Minutes.",
    "Pic … Another pic\nHAPPY BIRTHDAY: Jacqueline Alemany … Bruce Andrews … SKDK’s Karen Olick … Sabrina Tavernise … Cliff May … Interior’s Kate Kelly … Mark Salter … Juliet K. Choi … Julie Adams of the Senate Sergeant-at-Arms office … Josh Gardner … McLaurine (Klingler) Pinover … POLITICO’s Connor O’Brien and Andy Blatchford … Christina Cameron … EPA’s Lindsay Hamilton … E&E News’ Mark Matthews … Abram Olmstead … Emily Feldman … Kevin Dando … Jacqueline Hackett … Jennifer Kerns … Andrew Giacini … former U.S.",
    "President JOE BIDEN, in a statement, called it “an unprovoked and unjustified attack by Russian military forces.”\nUkrainian Foreign Minister DMYTRO KULEBA said on Twitter that “Putin has just launched a full-scale invasion of Ukraine.” Later he added a to-do list for outside nations that included “devastating sanctions,” “fully isolate Russia by all means, in all formats,” and weapons, equipment, and financial and humanitarian assistance for Ukraine.",
    "PALIN SEEKS NEW JUDGE — “Former Alaska Governor SARAH PALIN is seeking a new trial and a new judge in her defamation suit against the New York Times in the wake of a Bloomberg News story reporting that several jurors deliberating in the case learned from smart-phone push notifications that the judge presiding over the trial had already said he would rule in favor of the newspaper,” reports Bloomberg’s Bob Van Voris.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "In this regard, no one should have any doubt that a direct attack on Russia will lead to defeat and dire consequences for a potential aggressor.”\nPutin described the West as an “empire of lies,” and cast Russia as the victim of decades of U.S.-led actions that weakened his country, including NATO’s eastward expansion, its military campaign in Kosovo and the U.S. invasion of Iraq.",
    "If Putin’s army suffers heavy losses, his war could backfire and Russians and government members could turn against their president.”\nWhat happens today:\n— Biden will meet virtually with other members of the G-7, and then announce “severe sanctions on Russia.”\n— At noon, Biden will speak to the American people from the White House, per CNN’s Kaitlan Collins.",
    "— The ranking GOP members of the House Foreign Affairs, Armed Services and Intelligence committees released a statement that was free of casting any blame on Biden:\n“The last few hours have laid bare for the world to witness the true evil that is Vladimir Putin,” said Reps. MICHAEL MCCAUL (R-Texas), MIKE ROGERS (R-Ala.) and MIKE TURNER (R-Ohio).",
    "Putin’s invasion began shortly after Zelenskyy, speaking in Russian, made a last-minute appeal directly to the Russian people, explaining that Ukraine posed no threat to their country and that war would be a “disaster.”\n“I know that they [the Russian state] won’t show my address on Russian TV,” he said.",
    "[Russia] has embarked on a path of evil, but [Ukraine] is defending itself & won’t give up its freedom no matter what Moscow thinks.”\nWHAT HAPPENED WEDNESDAY NIGHT — Just before 6 a.m. Moscow time, Russian President VLADIMIR PUTIN announced in a televised speech that his forces were entering Ukraine.",
    "“It is not a stretch to envision rural towns and cities in western Ukraine and Poland suddenly needing to cope with hundreds of thousands or more people, with attendant health, food, housing, education, security, and other immediate needs.”\n— What are the domestic political implications for Biden?",
    "— Per the NYT, “NATO will hold an emergency session Thursday morning to discuss the Russian invasion of Ukraine, which was condemned as a ‘reckless and unprovoked attack on Ukraine, which puts at risk countless civilian lives,’ JENS STOLTENBERG, NATO’s secretary-general, said in a statement.",
    "REDISTRICTING WATCH — A North Carolina court rejected a GOP-drawn congressional map Wednesday and substituted its own version, “the second time in less than two weeks that a court in the state has invalidated a Republican House map as unconstitutionally partisan,” NYT’s Michael Wines writes.",
    "Similarly, Monday’s publicly aired National Security Council session revealed tensions between Putin and some of his top security officials, with the head of the intelligence services seeming to argue in favor of giving negotiations another chance, before being brow-beaten by Putin.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nCONGRESS\nENDING THE BLOCKADE — Sen. TED CRUZ (R-Texas) said Wednesday he will “lift his blanket holds on State Department nominees now that Biden is imposing sanctions on the Nord Stream 2 pipeline,” our Andrew Desiderio reports for Congress Minutes.",
    "POLITICO Playbook: War in Europe\nBy RYAN LIZZA\n02/24/2022 06:31 AM EST\n Updated 02/24/2022 10:05 AM EST\n 2022-02-24T10:05-0500\nPresented by\nDRIVING THE DAY\nTHE LATEST FROM UKRAINIAN PRESIDENT VOLODYMYR ZELENSKYY:\n— “We will give weapons to anyone who wants to defend the country.",
    "WELCOME TO THE WORLD — Josh Nanberg, president of Democratic political consulting firm Ampersand Strategies, and Aubrey Montgomery, president of Democratic fundraising firm Rittenhouse Political Partners, on Feb. 13 welcomed Noah DeWitt Nanberg, who came in at 7 lbs, 3 oz.",
    "Register here to watch live\nVP KAMALA HARRIS’ THURSDAY:\n— 11:30 a.m.: The VP will ceremonially swear in JOE DONNELLY as ambassador to the Vatican\n— 11:55 a.m.: Harris will ceremonially swear in SCOTT NATHAN as CEO of the U.S. International Development Finance Corporation.",
    "Every drop of Ukrainian and Russian blood spilled in this conflict is on Putin’s hands, and his alone.” Related: “Congress backs Biden on Russia sanctions, clamors for more,” by AP’s Lisa Mascaro\nSOME BIG THINGS WE DON’T YET KNOW:\n— What is the scale of the occupation?",
    "According to a statement from Biden, Zelenskyy “asked me to call on the leaders of the world to speak out clearly against President Putin’s flagrant aggression, and to stand with the people of Ukraine.”\nAfter the call, Zelenskyy declared martial law across Ukraine.",
    "SHAKEUP IN TRUMP CASE — “The two prosecutors leading the Manhattan district attorney’s investigation into Trump and his business practices abruptly resigned on Wednesday amid a monthlong pause in their presentation of evidence to a grand jury,” reports the NYT.",
    "The prospects for widespread GOP voter support are slim, but it’s conceivable Biden could recover some of the goodwill he’s lost, especially among Democrats and independents, as his approval rating has sunk from the low 50s to the low 40s over the last year.",
    "Per the AP, “the Russian military claimed to have wiped out Ukraine’s entire air defenses in a matter of hours.”\nPutin’s speech on Russian state TV, which appears to have been pre-recorded Monday, had a chilling message for Ukrainians.",
    "“Such a massive movement of people, unseen in Europe since World War II, could pose a humanitarian catastrophe and impact European politics as much as or more than the migration crisis of 2015,” notes a recent analysis from RAND.",
    "For all those who have not yet lost their conscience in Russia, it is time to go out and protest against the war with Ukraine.”\n— “Russia treacherously attacked our state in the morning, as Nazi Germany did in [World War II].",
    "ALL POLITICS\nFIRST IN PLAYBOOK — On Friday, NRSC Chair RICK SCOTT’s (R-Fla.) personal campaign committee will begin a seven-figure national cable ad buy promoting the much-discussed GOP policy platform he released this week.",
    "He retreated into talking points about the “special military operation.”\n“There is no purgatory for war criminals,” Ukraine’s U.N. ambassador, SERGIY KYSLYTSYA, told him during a tense confrontation that ended the meeting.",
    "There hasn’t been a significant cross-party “rally around the flag” effect for a president since the surges experienced by GEORGE W. BUSH after 9/11, the first days of the war in Iraq and the capture of SADDAM HUSSEIN.",
    "Pic … Another pic\n— Madeline Fry Schultz, assistant contributors editor at the Washington Examiner, and Michael Schultz, an economist at the Bureau of Labor Statistics, on Tuesday welcomed Theodore Michael Schultz.",
    "They need to know the truth, and the truth is that it is time to stop now, before it is too late.”\nOn Twitter, Ukraine responded with its own Nazi reference: a cartoon of HITLER gazing at Putin like a proud father.",
    "Russian forces entered Ukraine from multiple points far from Donbas, but it’s still unclear if the worst-case scenario — decapitating the government in Kyiv and occupying all of Ukraine — is Putin’s ultimate plan.",
    "The world will hold Russia accountable.”\nJust after midnight in Washington — early morning in Kyiv — Zelenskyy announced, in what appeared to be a video recorded on a cellphone, that he had just spoken to Biden.",
    "Watch the ad … ICYMI: The agenda\nSpeaking of … Senate Minority Leader MITCH MCCONNELL “has taken pains not to answer what the GOP agenda would be,” attempting to keep the midterms a referendum on Biden.",
    "While Putin’s goal is to weaken NATO and sow division between member countries, the crisis has united NATO and reminded the organization, which has suffered from mission drift, of its core purpose.",
    "The conversation will cover Biden’s economic agenda as he prepares to deliver his first State of the Union and what it will take to elevate more women to leadership ranks in the U.S. economy.",
    "CASH DASH — Former VP Mike Pence was on Long Island on Wednesday to fundraise for New York GOP gubernatorial candidate Rep. Lee Zeldin at the Centre Island home of Matt and Kerri Bruderman.",
    "Then, LEONID IVASHOV, a retired colonel general widely known as a saber-rattling nationalist with anti-Western views, published another anti-war letter shortly after (more on that here).",
    "Just after 11 p.m. Eastern time, reports emerged that amphibious Russian troops had landed in the southern Ukrainian cities of Mariupol, on the Black Sea, and Odessa, on the Sea of Azov.",
    "Ambassador to the U.N. Kelly Craft (6-0) … Paula Stannard … former Sen. Joe Lieberman (I-Conn.) (8-0) … JPMorgan Chase’s Allison Branca … Paula Zahn … former Rep. Chris Chocola (R-Ind.)",
    "— The European Council will hold an emergency meeting to adopt “the harshest package of sanctions we have ever implemented,” per JOSEP BORRELL, the E.U.’s top foreign affairs official.",
    "“What the public thinks: A poll out Wednesday found 50 percent of Russians believe it’s right to use military force to prevent Ukraine from joining NATO, with only 25 percent opposed.",
    "“They go straight to hell, ambassador.”\nGradually overnight, the outlines of an assault across Ukraine — not just in the Donbas region — from the air, land and sea became clear.",
    "Russia alone is responsible for the death and destruction this attack will bring, and the United States and its Allies and partners will respond in a united and decisive way.",
    "Now, Senate Dems see Scott’s proposal as “an offensive opening to criticize what Republicans would pursue if voted into power,” Anthony Adragna writes for Congress Minutes.",
    "— E.SK Strategies and People First are merging to form Village Square, a comms consultancy integrating paid political advertising with large-scale influencer campaigns.",
    "PLAYBOOKERS\nAspen Strategy Group, part of the Aspen Institute, has named its 32 members of the class of 2022 for its Rising Leaders Program, among them Daniel Lippman.",
    "At an emergency meeting of the U.N. Security Council, Russian Ambassador VASILY NEBENZYA was pressed by representatives of other member states about the onset of war.",
    "Lieberman got on the call thinking it was a last-minute emergency gathering, when in fact it was some of his longtime friends and colleagues gathered to celebrate.",
    "“Today, we stand resolute with the Ukrainian people and resolve to provide them with the tools they need to withstand and repel this unprovoked attack.",
    "“The unexpected development came not long after the high-stakes inquiry appeared to be gaining momentum and now throws its future into serious doubt.",
    "U.S. officials have been warning that a major Russia-Ukraine war could displace millions of people, sending waves of refugees into Central Europe.",
    "Related: “Russian Invasion of Ukraine Forges New Unity for NATO,” by WSJ’s Drew Hinshaw and Daniel Michaels\nA RARE MOMENT OF POLITICAL UNITY?",
    "In his statement, Biden said, “President Putin has chosen a premeditated war that will bring a catastrophic loss of life and human suffering.",
    "BIRTHDAY SURPRISE — Former Sen. Joe Lieberman (I-Conn.) was surprised with a celebratory Zoom on Wednesday at noon for his 80th birthday.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "In Congress, the debate over sanctions may now be less partisan as the difference in severity between Biden and GOP proposals narrows.",
    "Jon Decker, White House correspondent and senior national editor for Gray Television, is now a member of the U.S. Supreme Court Bar.",
    "PROGRAMMING ALERT — CEA Chair CECILIA ROUSE will join Morning Money author Kate Davidson at noon Monday for a Women Rule interview.",
    "FIRST IN PLAYBOOK — Alan Yu is joining the Center for American Progress as SVP for national security and international policy.",
    "Putin described the incursion as “a special military operation” aimed at the “demilitarization and denazification” of Ukraine.",
    "She previously was comms director for Rep. Teresa Leger Fernandez (D-N.M.), and is a Mark Kelly and Kirsten Gillibrand alum.",
    "In recent days, Biden has warned inflation-weary Americans to expect the added sacrifice of even higher gasoline prices.",
    "More than 150 signatories — activists, artists and intellectuals — signed an anti-war open letter to Putin in January.",
    "The Ukrainian government said that the explosions heard in Kyiv were their fighter jets being bombed at the airport.",
    "Putin could weaponize his oil and gas supplies by holding back exports and artificially driving up prices further.",
    "Joe Manchin (D-W.Va.) and Susan Collins (R-Maine), Rep. Brian Fitzpatrick (R-Pa.), John Breaux and Jon Huntsman.",
    "Within moments, distant explosions were heard by reporters stationed in Kyiv and cities throughout the country.",
    "Be ready to support Ukraine in the squares of our cities.”\n— “We have severed diplomatic relations with Russia.",
    "He most recently was a senior adviser to climate envoy John Kerry, and is a State Department and DOE alum.",
    "“I urge you to immediately lay down your weapons and go home,” Putin said, addressing Ukrainian soldiers.",
    "Prior to the fundraiser, Pence taped a segment for Sean Hannity’s show (who has a home on Long Island).",
    "Talking Biz News\nTRANSITIONS — Saule Omarova is joining the Roosevelt Institute as a senior fellow.",
    "Kathy Hochul’s office … Yuval Noah Harari … Aidan Lizza\nDid someone forward this email to you?",
    "… Katy von Rosenberg is now government relations specialist at Samsung Austin Semiconductor.",
    "MEDIA MOVE — Edwin Rios is joining The Guardian as a senior reporter covering racial equity.",
    "Their view: “Already, before the war, there were signs of opposition among Russia’s elite.",
    "… Alexandra McPhee is now director of government relations at Concerned Women for America.",
    "Oil and gas prices have been spiking to near record highs as the crisis has worsened.",
    "A U.S. official said “full-scale” sanctions against Russia would be announced today.",
    "And moreover, it has certain advantages in a number of the latest types of weapons.",
    "No Labels, of which Lieberman is national co-chair, put the virtual party together.",
    "…\n… Jalelah Ahmed is now comms director for Rep. Lucille Roybal-Allard (D-Calif.).",
    "That’s a question our colleagues at Brussels Playbook wrestled with this morning.",
    "Moments later, as the sun came up in Kyiv, air raid sirens rang out in the city.",
    "She most recently was deputy comms director for Rep. Michelle Steel (R-Calif.).",
    "She is the former deputy regional director for Sen. John Cornyn (R-Texas).",
    "She is the Beth and Marc Goldberg Professor of Law at Cornell University.",
    "Today, oil is trading above $100 a barrel for the first time since 2014.",
    "She previously was comms director for Rep. Sheila Jackson Lee (D-Texas).",
    "… Lexi Byler is now state comms director for Sen. Tina Smith (D-Minn.).",
    "… Faith Mabry is now comms director for Rep. David Valadao (R-Calif.).",
    "CNN broadcast video of Russian troops and tanks crossing into Ukraine.",
    "As of today, our countries are on different sides of world history.",
    "But it’s not clear if Russians are willing to accept a lengthy war.",
    "She previously was legislative counsel for Sen. Roy Blunt (R-Mo.).",
    "But the debate over how to aid Ukraine militarily may widen.",
    "— Julia Barnes is joining the Movement Cooperative as CEO.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "She most recently was comms director for Students United.",
    "(6-0) … Blake Waggoner … former acting Massachusetts Gov.",
    "Jane Swift … Karen Persichilli Keogh of New York Gov.",
    "He responded with a series of jokes and one-liners.",
    "She previously was a senior adviser at Be A Hero.",
    "— Maria Hurtado is now a VP at Declaration Media.",
    "— Amos Snead has been named president of Adfero.",
    "Send Playbookers tips to playbook@politico.com.",
    "Press secretary JEN PSAKI will brief at 2 p.m.",
    "He currently is a reporter at Mother Jones.",
    "Energy politics will also be more fraught.",
    "The event was expected to raise $500,000.",
    "— What happens to world energy markets?",
    "— Will Europe face a refugee crisis?",
    "— How long will Russians back Putin?",
    "“But Russian people have to see it.",
    "(Financial markets are plunging.)",
    "THE HOUSE and THE SENATE are out.",
    "He currently is an EVP.",
    "TRUMP CARDS\nD.A.",
    "SPOTTED: Sens.",
    "Sign up here."
  ]
}