{
  "id": 1107,
  "mediaId": 3993,
  "date": "2022-02-15",
  "headline": "DC Democrats wary of pushing gun control ahead of elections",
  "image": "https://bearingarms.com/wp-content/uploads/media/2022/02/CAMCO_Youtube_Thumbnail_596-1110x740.png",
  "link": "https://bearingarms.com/camedwards/2022/02/15/dc-democrats-wary-of-pushing-gun-control-ahead-of-elections-n55495",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cam Edwards",
  "authorUrl": "https://bearingarms.com/author/camedwards",
  "termIds": [
    0
  ],
  "sentences": [
    "Democrats in Congress may hope to stave off a red wave election by shying away from Joe Biden’s gun ban agenda, but gun owners know the score and we’ll be turning out to cast our votes in favor of candidates who won’t try to turn our Second Amendment rights into a privilege to be doled out by the state, no matter how hard the Democrats try to hide their true intentions between now and November.",
    "According to The Hill, gun control activists are growing increasingly frustrated with the unwillingness of Democrats to push for new gun control measures, though it should be noted that, like other outlets reporting the same claim, The Hill couldn’t find anyone from the big groups like Everytown for Gun Safety, Brady, or Giffords to go on the record with their complaints.",
    "As The Hill acknowledges, there are some blue-state Democrats in safe seats or not up for re-election this year who are demanding that Chuck Schumer bring gun control bills to the floor of the Senate for a vote, but it doesn’t sound like Schumer’s eager to comply, despite the supposed popularity of the gun control measures that passed the House last year.",
    "Democratic lawmakers are showing little appetite for tackling the controversial issue ahead of the 2022 midterm elections, exasperating activists frustrated over the lack of action at a time when Democrats control the White House and both branches of Congress after 10 years of Republican or split control of Congress.",
    "Could it be that politicians like Arizona’s Mark Kelly and New Hampshires Maggie Hassan understand that when voters are actually given the chance to impose universal background checks the results are much closer to 50-50 in swing states than a lopsided majority in favor of more gun control laws?",
    "While such a vote would put Republicans on the record as opposing a reform that more than 80 percent of voters support, it could turn into a future political liability for vulnerable Democrats running in swing states such as Arizona, Georgia, New Hampshire and Nevada.",
    "Igor Volsky, the co-founder of Guns Down America, said that Senate Majority Leader Charles Schumer (D-N.Y.) promised anti-gun violence groups the Senate would vote on background checks legislation in the summer of 2021, but the bills didn’t make it to the floor.",
    "Negotiations between Sen. Chris Murphy (D-Conn.) and Sen. John Cornyn (R-Texas) stalled out over the summer, and there’s been little to no talk in the Senate Democratic Caucus about picking up two gun control bills that passed the House in March.",
    "Joe Biden once again demanded the Democratic-controlled Congress take up his push for new gun control laws on Monday, but as The Hill reports, many Democrats on Capitol Hill would prefer to talk about almost anything else during an election year.",
    "Instead, Democrats decided to waste months of time, effort, and political capital on Biden’s multi-trillion dollar spending bill, followed by more time-wasting on an elections bill that didn’t have enough support in the Senate for passage.",
    "Last November, Republicans swept all statewide offices and took back control of the House of Delegates, because gun owners have a pretty good memory when it comes to the politicians who’d vote to strip their rights away.",
    "The co-founder of the gun control group Giffords should be the biggest champion of new restrictions on the right to keep and bear arms in the Senate, but he’s barely uttered a peep about gun control since he took office.",
    "Here’s a question: if 80% of voters really did support universal background checks, then why would voting for a universal background check bill be a political liability for any Democrat (or Republican for that matter)?",
    "Volsky’s been a squeaky wheel for more gun control since shortly after Biden took office, when he took issue with the president’s pivot to infrastructure last spring instead of making gun control his next priority.",
    "In 2020, after Democrats took control of the state legislature, the first thing they did was push for an “assault weapons” ban and a ban on “high capacity”magazines along with nearly a dozen other gun control laws.",
    "“I’m disappointed he has the nerve and audacity to say he’s going to do things in sequential order,” said Maisha Fields, the vice president of organizing for Brady: United Against Gun Violence, a nonprofit group.",
    "It’s out of order to be shopping for eggs and to have your life disrupted.”\nBiden was able to successfully get an infrastructure bill to his desk, but gun control wasn’t next on his to-do list.",
    "Now the question Schumer faces is whether to force a vote on background checks legislation that is likely to fail because there aren’t 10 Republicans in the 50-50 Senate willing to vote for it.",
    "“We’ve been promised by Senate Majority Leader Schumer as far back as March, April that there would be a vote during the summer, then it got pushed back even further.",
    "They’re using this familiar playbook of making all kinds of promises during the campaign and then fail to deliver anything when they’re in power,” Volsky said.",
    "Running away from their “defund the police rhetoric” and hoping Americans don’t notice that gas, clothing, food, and rent is getting more expensive by the day?",
    "Instead, Virginia Democrats decided to lay low on gun control in hopes that voters would forget about their anti-gun ideology, which was never going to happen.",
    "In fact, if you want to gauge just how popular gun control is among the electorate these days, just look at how little Mark Kelly is talking about it.",
    "The gun ban failed to pass, but oddly enough in 2021 those very same Democrats decided not to re-introduce the gun ban, despite Gov.",
    "Back then, though, even groups like Brady were willing to publicly chastise Biden for not putting their issue front and center.",
    "Voting for something that four out of five Americans support seems like a good way to make a politician less vulnerable.",
    "And now here we are in 2022 and the Democrats new top priority is… what exactly?",
    "I think we’re going to see that same dynamic at work nationwide this November.",
    "Ralph Northam vowing to bring it back for another go-round.",
    "We saw this same dynamic at work in Virginia last year.",
    "“It’s out of order to have to bury your child.",
    "Recommended Bearing Arms Video:",
    "I’d argue yes."
  ]
}