{
  "id": 11145,
  "mediaId": 8340,
  "date": "2022-03-17",
  "headline": "Gas Prices to Get a Tax Holiday (Maybe)",
  "image": "https://www.investopedia.com/thmb/lHGWfJkxOl5bE78HFvdeoCr31EY=/2121x1414/filters:fill(auto,1)/GettyImages-1159974987-ca8cdae8041b4b13a9c9ed8df43cb5d7.jpg",
  "link": "https://www.investopedia.com/gas-tax-holiday-5222572?utm_campaign=rss_headlines&utm_source=rss&utm_medium=referral",
  "mediaOutlet": "investopedia.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Daugherty",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The nonpartisan Committee for a Responsible Federal Budget, for example, estimates that a federal gas tax holiday would cost the government about $20 billion, drive the Highway Trust Fund (which gas tax revenues largely support) closer to insolvency, and worsen inflation once it was lifted.6\nThe Biden administration hasn't taken a definitive stand on the matter, although Treasury Secretary Janet Yellen said on March 11 that, \"We're looking at a range of things that we might do to relieve consumers of the gas tax.",
    "Even if she signs it, the tax holiday wouldn't go into effect until March 2023.13 Earlier in the month, Whitmer joined five other Democratic governors in signing a letter to Congress urging that the federal government suspend its own gas tax.14\nNew York.",
    "As it's currently written, the act would the eliminate the federal tax on\ngasoline until Jan. 1, 2023.3\nIn introducing the plan, Kelly noted that high gas prices were putting a \"strain on families who need to fill up the tank to get to work and school.",
    "The federal government and many states are weighing the pros and cons\nWith gasoline prices at near-record highs ($4.305 on average on March 16),1 many politicians, business leaders, and consumers are calling for a tax holiday at the pump.",
    "\"4\nA major obstacle to the Senate bill is skepticism in Congress that the oil companies would actually lower their pump prices as a result of the tax holiday—and not just keep prices where they are and pocket the extra profit.",
    "In early March 2022, crude oil futures dropped by 30% in a one-week period.17 While retail gasoline prices may be slow to follow, a gradual decline could take some of the momentum out of calls for gas tax holidays.",
    "Brian P. Kemp, a Republican, announced on March 9 that he was supporting legislation in the Georgia General Assembly that, if passed, would suspend the state's gasoline tax through May 31, 2022.11\nMaryland.",
    "That may be especially true where officials are already doubtful that a tax cut would be of much benefit and are wary of losing revenue that is vital to maintaining their state's infrastructure.",
    "State taxes average 31.02 cents (32.66 cents for diesel).2\nIf both the federal government and the states declared gas tax holidays, consumers on average could save close to 40 cents a gallon.",
    "Lawmakers in New York's state Senate added a provision to their budget plan that would cut gas taxes by 16 cents a gallon starting on May 1 and extending through the end of the year.",
    "Some officials back a gas tax holiday, while others maintain that the reduction in tax revenues will make it difficult to fund road repairs and other vital projects.",
    "DeWine, who opposes the measure, argues that it would deprive state and local governments of money they need for road repairs.16\nWhat Will Happen if Gas Prices Fall?",
    "Near-record gasoline prices in early 2022 have led to calls for the federal government and the states to reduce or eliminate their gas taxes on a temporary basis.",
    "House Speaker Nancy Pelosi said at a March 3 press conference that while a federal gas tax holiday \"sounds good\" on the surface, the situation was more complex.",
    "One legislative initiative is S.3609 – Gas Prices Relief Act of 2022, sponsored by Sen. Mark Kelly (D-Ariz.) and introduced in the Senate on Feb. 9, 2022.",
    "On March 16, lawmakers in Maryland were expected to pass a measure to create a 30-day gas tax holiday, saving residents 36 cents a gallon.12\nMichigan.",
    "If we can have a holiday that guarantees the consumer benefits rather than more profits for the oil companies, that would be a path that we can take.",
    "Gavin Newsom has proposed a measure that wouldn't reduce current taxes, but would postpone a planned increase to the state’s gas tax.8\nConnecticut.",
    "State Republicans have proposed a bill that would suspend California's gas tax for six months, but they have thus far been unable to pass it.",
    "Governors or legislators in about 20 states have proposed gas-tax holidays that would temporarily reduce or eliminate their state's gas tax.",
    "Ned Lamont, a Democrat, proposed cutting the state's gas tax by 25 cents a gallon, but leaving the tax on diesel fuel in place.9\nFlorida.",
    "Mike DeWine are at odds over a proposal to roll back gas taxes to pre-2019 levels, saving consumers 10.5 cents at the pump.",
    "The state Assembly (New York's other legislative chamber) will need to follow suit if that is to happen.15\nOhio.",
    "Republican legislators in Michigan passed a bill on March 15 calling for a six-month gas tax holiday, but Gov.",
    "How Gas Taxes Add Up\nThe U.S. government taxes gasoline at 18.4 cents a gallon (24.4 cents for diesel).",
    "The Miami Herald reports that the tax holiday will save Floridians about 27 cents a gallon.10\nGeorgia.",
    "Federal gas taxes are about 18 cents a gallon, while state gas taxes average about 40 cents a gallon.",
    "Among the states that appear closest to enacting (or rejecting) gas tax holidays are:\nCalifornia.",
    "\"There is no guarantee that the oil companies pass that reduction on to the consumer,\" she noted.",
    "Consumers hoping for a tax break at the gas pump may need to find other holidays to celebrate",
    "Florida lawmakers voted on March 9 to suspend their state's gas tax, but not until October.",
    "\"And it's very hard to write a bill that requires them to pass it on to the consumer….",
    "The federal government has not taken action on a gas tax holiday to this point.",
    "That would represent a roughly 10% discount on today’s average gas price.",
    "The bill was referred to the Senate Finance Committee, where it remains.",
    "\"5\nOther opponents suggest a tax holiday would do more harm than good.",
    "Other governors and legislators have gone on record as opposing one.",
    "Gretchen Whitmer, a Democrat, was expected to veto it.",
    "In Ohio, Republican lawmakers and Republican Gov.",
    "\"7\nWill Your State Declare a Gas Tax Holiday?",
    "Whether that will happen remains to be seen.",
    "Will There Be a Federal Gas Tax Holiday?",
    "Here is what that could mean for you.",
    "On March 14, Connecticut Gov.",
    "California Gov.",
    "Gov."
  ]
}