{
  "id": 11585,
  "mediaId": 2572,
  "date": "2022-03-29",
  "headline": "Border Patrol chief says US on track to hit 1M migrant encounters in 6 months as crisis accelerates",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/Biden-Migrant-Southern-Border-2.jpg",
  "link": "https://www.foxnews.com/politics/border-patrol-chief-us-1m-migrant-encounters-southern-border-crisis",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    5879,
    4905,
    1428,
    5949,
    6678
  ],
  "sentences": [
    "With numbers lowering from the summer highs, but still remaining high compared to prior winter months, lawmakers and officials have warned that a surge that could outpace last year’s could be on the way -- particularly if the Biden administration ends the Title 42 public health order this week which has been used to expel about half of those migrants encountered.",
    "\"Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border,\" Arizona Sens.",
    "ARIZONA DEM SENATORS WARN BIDEN AGAINST ‘SHARP END’ TO TITLE 42 BORDER RESTRICTIONS WITHOUT PLAN\nOrtiz described a situation on the ground in which Border Patrol is short on staff, is facing additional challenges due to the ongoing COVID-19 pandemic and where \"every sector is busier than they were back in ‘21.\"",
    "DHS REQUESTING ADDITIONAL PENTAGON SUPPORT AT BORDER AMID FEARS OF MASSIVE MIGRANT SURGE\nIn the entirety of FY 2021, there were over 1.7 million migrant encounters, with the majority coming in the second half of the fiscal year as encounters hit a monthly high of 213,000 in July.",
    "Border Patrol Chief Raul Ortiz on Tuesday said that the U.S. is currently on track to hit one million migrant encounters so far in Fiscal Year 2022 – a number that shows that continued migrant traffic is already outpacing last year's staggering numbers.",
    "Republicans have blamed the Biden administration's rolling back of Trump-era border security measures, but the Biden administration has instead favored an approach that targets \"root causes\" like poverty and violence in Central America.",
    "March's numbers have not yet been released but are expected to outpace February's, which would take the number of encounters for the fiscal year to over one million, with six months still to go in the fiscal year.",
    "\"Probably in the next two or three days we’ll get over a million encounters or apprehensions along the southwest border,\" Ortiz said at a border security conference in San Antonio, Texas.",
    "There were 164,973 migrant encounters in February, up dramatically from 101,099 in Feb. 21 -- a month that preceded a massive surge in the spring and summer months.",
    "While many top Democrats have been urging the Biden administration to end Title 42, Democratic lawmakers at the border have been urging against such a move.",
    "On Wednesday, a top Pentagon official confirmed that DHS had asked the Department of Defense for additional support due to a potential increase in numbers.",
    "He also said that agents have encountered migrants from 157 different countries – an indication of the global character of the U.S. border crisis.",
    "The numbers overwhelmed agents and saw the introduction of methods to allow quicker release of migrants into the interior.",
    "Fox News reported earlier this month that DHS has put out a call for employees to volunteer at the border.",
    "The February numbers mean that there were 838, 685 encounters since the fiscal year began in October.",
    "Mark Kelly and Kyrsten Sinema said in a letter to President Biden last week.",
    "The current fiscal year began in October."
  ]
}