{
  "id": 11596,
  "mediaId": 2572,
  "date": "2022-03-22",
  "headline": "CatholicVote launches campaign capitalizing on Hispanic community's growing support for conservative values",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/Boston-Border-Mass-16.jpg",
  "link": "https://www.foxnews.com/politics/catholic-vote-launches-ad-campaign-capitalizing-on-latino-communitys-growing-gop-support",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2346,
    2459,
    392,
    238,
    237
  ],
  "sentences": [
    "POPE TO CONSECRATE RUSSIA TO VIRGIN MARY INSPIRED BY CENTURY-OLD FATIMA PROPHECY\n\"Our campaign is the beginning of a focused effort to educate and persuade Hispanic voters, many of whom are Catholic and pro-life, to push back against the growing extremism inside the Democratic Party,\" Burch continued.",
    "As these voters ask their elected officials to address skyrocketing gas prices, soaring crime and inflation, and the lingering consequences of excessive COVID mandates, senators in both Nevada and Arizona are instead pushing extreme abortion laws.",
    "This includes Senators Kelly and Cortez Masto, both of whom recently worked to pass the most extreme abortion law ever voted on in the U.S. Senate,\" CatholicVote President Brian Burch told Fox News in an exclusive statement, referencing Sens.",
    "Abortion, LGBT issues and religious liberties are topics that are increasingly important to Hispanic voters, half of whom claim religious affiliation with the Catholic Church.",
    "Polls show a significant swing toward the right for Hispanic voters – up to a 9% advantage over Democrats in some states, according to a report from the Wall Street Journal.",
    "Dhillon Law Group, the firm representing the student, is specifically claiming that the teenager was mocked by his science teacher in front of other students for his faith.",
    "Earlier this month, a conservative law group announced a lawsuit against a Christian child's school for failing to take an incident of alleged harassment seriously.",
    "He was also falsely accused of planning a school shooting by other students, which law enforcement took seriously until determining the report to be a prank.",
    "\"The votes in favor of extreme abortion by both Kelly and Masto Cortez are especially disturbing given that both publicly describe themselves as Catholic.",
    "The political advocacy group CatholicVote has announced a new campaign targeting Hispanic and Latino voters in the upcoming midterm elections.",
    "\"Our campaign is designed to educate and mobilize Hispanic voters to hold key senators accountable for their radically misplaced priorities.",
    "The growing difference between Catholic social teaching and progressive activism has stretched many Catholic voters to the breaking point.",
    "The student, 14, is alleging that he was mocked by both teachers and students at Mater Academy for his open practice of Christianity.",
    "The Church is clear that support for lethal violence against unborn children is incompatible with Church teaching,\" he added.",
    "The organization has explicitly targeted Democrats in their campaign, calling the party platform \"radical\" and \"extreme.\"",
    "However, CatholicVote has rolled into its new campaign appeals on issues such as gas prices and COVID restrictions.",
    "CatholicVote hopes to push Hispanic voter participation rates higher than even last election's historic turnout.",
    "\"Far too many Democrats in Washington are out of step with the priorities of Hispanic voters.",
    "You can follow him on Twitter @timothynerozzi and can email him at timothy.nerozzi@fox.com",
    "The real priorities of Hispanic voters are being ignored,\" said Burch.",
    "Mark Kelly of Arizona and Catherine Cortez Masto of Nevada.",
    "Timothy Nerozzi is a writer for Fox News Digital."
  ]
}