{
  "id": 1176,
  "mediaId": 6598,
  "date": "2022-02-17",
  "headline": "Senate passes stopgap bill to avert shutdown ahead of Friday deadline",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220217120731-senate-majority-leader-chuck-schumer-washington-021622-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/17/politics/senate-government-funding-vote/index.html",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clare Foran, Ted Barrett and Ali Zaslav",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "A similar scenario -- where Republicans pushed for votes to counter vaccine mandates -- played out back in December, but the standoff ended with an agreement to hold votes on an earlier stopgap bill as well as a GOP amendment to prohibit the use of federal funding for Covid-19 vaccine mandates, which ultimately failed.",
    "On Wednesday, when negotiators were trying to lock in the timing for a final vote, Democrats were already contending with several absences among their members, making the math tricky in the narrowly divided 50-50 Senate.",
    "Lawmakers are also working to lock in a broader full-year spending package, but have said they need more time to finish and, as a result, needed a short-term funding extension to avert a shutdown at the end of the week.",
    "In the Senate, Republican demands and Democratic absences threatened to complicate the effort to lock in a final vote and brought action down to the wire as the February 18 funding deadline neared.",
    "Pressed on whether the White House had received any assurances that a shutdown would be avoided, she said it was \"clearly a priority for us to make sure that there is not a government shutdown.\"",
    "(CNN)The Senate voted on Thursday to pass a stopgap bill to avert a shutdown at the end of the week ahead of a looming Friday deadline when government funding has been set to expire.",
    "The House of Representatives voted last week on a bipartisan basis to approve the measure, known as a continuing resolution or CR for short, to extend funding through March 11.",
    "But leaders from both parties projected confidence there would not be a shutdown and ultimately a final vote to pass the measure went forward Thursday evening.",
    "Two of the amendments would have prohibited funding for vaccine mandates, while the other amendment would have imposed a balanced budget requirement.",
    "Prior to holding a final vote on the stopgap bill, the Senate took three votes on amendments put forward by Republicans, but all three failed.",
    "Luján tweeted on Thursday that he is now completing his recovery in DC and said, \"I'm back at work and will return to the Senate floor soon.\"",
    "If any amendment votes had passed, it could have jeopardized efforts to get a bill to Biden's desk before the funding expiration deadline.",
    "And that's our path -- is to avert a government shutdown,\" principal deputy press secretary Karine Jean-Pierre said Thursday.",
    "Sen. Mark Kelly of Arizona was out on Wednesday because his wife, former congresswoman Gabby Giffords, is sick.",
    "Now that the Senate has passed the measure it can be sent to President Joe Biden's desk to be signed into law.",
    "Feinstein's husband is ill, which is why she missed votes, according to a source familiar with the situation.",
    "The White House on Thursday said it is in \"constant communication\" with Capitol Hill on government funding.",
    "One Republican senator, Lindsey Graham of South Carolina, is away also, traveling abroad.",
    "Sen. Ben Ray Luján of New Mexico is still away after he had a stroke and is recovering.",
    "CNN's Manu Raju, Lauren Fox, Betsy Klein and Morgan Rimmer contributed to this report.",
    "This story and headline have been updated with additional developments Thursday.",
    "\"We work closely with the Senate and with Congress, in general.",
    "And 88-year-old Sen. Dianne Feinstein missed votes Wednesday.",
    "Feinstein is not expected to return to the Senate this week.",
    "The bill passed in the Senate by a tally of 65 to 27."
  ]
}