{
  "id": 11797,
  "mediaId": 2526,
  "date": "2022-03-27",
  "headline": "Report: Biden Officials Prepare for ‘Mass Migration Event’ at Southern Border",
  "image": "https://media.breitbart.com/media/2021/11/AP19110657073153-2-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/27/report-biden-officials-prepare-for-mass-migration-event-at-southern-border/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    2765,
    2459,
    1664,
    2964,
    4905,
    5879,
    1398,
    6383,
    6678
  ],
  "sentences": [
    "“Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border,” they wrote.",
    "Reports have circulated in recent weeks that Biden is considering ending the Center for Disease Control and Prevention (CDC) order known as Title 42, first imposed by Trump, which gives federal immigration officials broad authority to quickly return border crossers to their native countries.",
    "In January of this year, more than 62,500 border crossers and illegal aliens were released into the U.S. interior — a foreign population more than twice the size of Princeton, New Jersey; nearly twice the size of Lexington, Massachusetts; and more than six times the size of Jackson, Wyoming.",
    "Top officials at the Immigration and Customs Enforcement (ICE) agency are reportedly preparing for a “mass migration event” at the United States-Mexico border if President Joe Biden ends the last set of Trump-era border controls.",
    "The email also suggested that officials coordinate with non-governmental organizations (NGOs) that would help them quickly release tens of thousands of border crossers and illegal aliens into the U.S. interior.",
    "An internal ICE email, reviewed by the Washington Post, warned top agency officials that they should prepare for a “mass migration event” if Biden ends Title 42.",
    "Similarly, Axios reports that Biden’s top-level officials are bracing for “a massive influx of more than 170,000” illegal aliens if Title 42 is ended.",
    "Currently, the officials estimate that about 25,000 foreign nationals are waiting on the Mexican side to rush the border when Biden ends Title 42.",
    "Likewise, associates of former President George W. Bush have called the policy “arbitrary and harmful” while advocating for its elimination.",
    "At the same time, hundreds of thousands of border crossers and illegal aliens are being released into the U.S. interior every few months.",
    "Bob Menendez (D-NJ), Chuck Schumer (D-NY), Cory Booker (D-NJ), and Alex Padilla (D-CA) have lobbied Biden to end Title 42, Sens.",
    "Meanwhile, the Mark Zuckerberg-funded National Immigration Forum has been lobbying Biden to end Title 42 for months.",
    "Such a move, Rep. Tony Gonzalez (R-TX) says, would double monthly illegal immigration levels at the southern border.",
    "Last week, Breitbart News exclusively reported that Biden’s DHS is considering ending Title 42 on April 1, 2022.",
    "Kyrsten Sinema (D-AZ) and Mark Kelly (D-AZ) have urged the administration to continue enforcing the authority.",
    "From January 2021 to August 2021, for example, more than half a million were released into the U.S. interior.",
    "In 2021, more than two million border crossers and illegal aliens arrived at the southern border.",
    "This year, experts predict more than 2.1 million will arrive.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here.",
    "While Sens."
  ]
}