{
  "id": 11858,
  "mediaId": 2830,
  "date": "2022-03-23",
  "headline": "How Cryptocurrency Is Helping Ukraine",
  "image": "",
  "link": "https://www.wsj.com/articles/how-crypto-is-helping-ukraine-russia-currency-donations-transfer-infrastructure-11648065166",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Illia Polosukhin",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Deputy Minister Alex Bornyakov said last week that 40% of the vendors Kyiv is working with have accepted payment in cryptocurrency, and crypto donations have been “essential.” He noted that since “the national bank is not really operating, crypto is helping to perform fast transfers, to make it very quick and get results almost immediately.”\nCrypto donations are also making a difference for Ukrainians, both in and out of the country.",
    "WSJ Opinion: Vladimir Putin, Civilian Targets and War CrimesPlay video: WSJ Opinion: Vladimir Putin, Civilian Targets and War Crimes\n Joe Biden labels Vladimir Putin a 'war criminal' as allegations of Russia targeting civilians increase across cities including Kyiv, Mariupol, Irpin and Melitopol.",
    "I’m one of several organizers of Unchain Fund, a crypto fundraising project dedicated to relief in Ukraine that has raised more than $6.9 million so far, as well as Away from Ukraine, an information network for displaced Ukrainians.",
    "Photo: Angel Navarrete/Bloomberg News\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (3 minutes)\nAD\nLoading advertisement...\n00:00 / 03:24\n1x\nThis article is in your queue.",
    "Groups like Away from Ukraine connect displaced Ukrainians to share support, news, work opportunities, resources on navigating immigration, medical care, and other challenges of living in a new country.",
    "Empowering individuals and lowering barriers to access is a major part of why I co-founded NEAR Protocol and why I believe in crypto and Web3, the catchall term for the blockchain-based open internet.",
    "This war crystallizes why that vision is so important: The current global systems of power do not offer this opportunity to everyone, and they can collapse quickly under stress.",
    "Crypto-based collaborations like Unchain Fund and UkraineDAO (an abbreviation for decentralized autonomous organization) took shape in the first few days of the crisis.",
    "Blockchain networks are global and settle transactions in minutes, while the legacy banking system takes three days to settle a cross-border transaction.",
    "Crypto has proved useful for displaced people, who need access to stable funds and the ability to convert crypto into fiat currency in a flexible way.",
    "Images: Mariupol City Council/Azov Battalion/AP/Sputnik/Reuters Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Unchain has raised more than $6.9 million in 10 cryptocurrencies since Feb. 25 for relocation support, transportation, food and medicine.",
    "We’re also distributing the Unchain Help Card, a crypto-to-consumer debit card, to help mothers with young children purchase supplies.",
    "Open Queue\nCritics have claimed that cryptocurrency will help Russia evade sanctions, or at best that it’s of no use to Ukrainians.",
    "I grew up and attended university in Kharkiv, the second-largest city in Ukraine and one of the hardest-hit by Russian bombs.",
    "Three million Ukrainians in other countries need money for housing, living costs, and psychological and professional support.",
    "WSJ Opinion: Vladimir Putin, Civilian Targets and War Crimes\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Many crypto donations went directly to wallets held by the Ukrainian government via the Ministry of Digital Transformation.",
    "Ukraine’s banking system is hardly operating, but the major crypto exchanges are available 24/7 from a phone or computer.",
    "Our vision is to make it possible for all people to own their data, assets and power of governance.",
    "0:00 / 5:19\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "We have the tools to build fairer, more resilient systems that work for everyone.",
    "I’ve worked in the blockchain industry for four years, and I’m Ukrainian.",
    "Crypto donations to Ukraine since the invasion total almost $100 million.",
    "Cryptocurrency logos are displayed on an ATM in Madrid, March 17.",
    "Mr. Polosukhin is a co-founder of NEAR Protocol and Unchain Fund.",
    "In fact, it’s proving to be a powerful tool to help them.",
    "Now we’re turning to longer-term solutions.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8"
  ]
}