{
  "id": 11853,
  "mediaId": 2520,
  "date": "2022-03-24",
  "headline": "Gas prices are out of control. We need real relief, not just political pandering",
  "image": "https://www.gannett-cdn.com/presto/2022/03/09/PPHX/d8d2b470-ca53-4a12-a6ac-0aa1232e92d2-pb210127_11265.JPG?crop=5008,2817,x0,y150&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/elviadiaz/2022/03/24/gas-prices-tax-california-political-pandering-need-real-help/7156787001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elvia Díaz",
  "authorUrl": "https://www.azcentral.com/staff/2647952001/elvia-daz/",
  "termIds": [
    0
  ],
  "sentences": [
    "California's $800 handout idea is absurd\nA growing list of states are proposing to temporarily suspend their respective taxes on fuel sales, which are usually a few cents per gallon and collectively amounts to millions of dollars a year.",
    "Taxpayers would be paying for that help\nThis tells us that politicians aren’t serious on helping the poor, the ones who really need the relief, but are simply looking to placate all consumers and score political points in doing so.",
    "Again, I want the savings for myself but not necessarily at taxpayers’ expense or at the expense of fixing roads, since money collected from the gas tax is generally used for that and other transit purpose.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "I mean, $800 per two vehicles is nothing to sneeze over, considering that on Thursday California’s average price for regular gasoline was $5.88 a gallon and $6.83 for mid-grade.",
    "Consumers are the biggest losers and are lashing out at President Joe Biden and everyone else holding local power for the exorbitant gas prices.",
    "The Arizona Democratic senator, who’s facing reelection, is proposing to suspend the federal 18.4 cent gallon tax through the end of the year.",
    "Why should California billionaires, including Silicon Valley darlings like Mark Zuckerberg, get any relief on gas at taxpayers’ expense?",
    "There are too many, however, who face the tough decision of choosing between filling up a gas tank or using that money for food.",
    "That would have saved the average Arizona driver a few bucks per month or just over $100 per year, according to various reports.",
    "The absurdity of Newsom’s idea isn’t just the $11 billion price tag but the fact that there’s no income cap for the relief.",
    "Enter the politicians fighting each other to appease angry consumers before they head to the polls later this year.",
    "The only winners under Newsom’s giveaway idea or suspended state taxes are the oil overlords spiking prices.",
    "They are inflating prices, not because there’s actually a shortage of crude oil, but just because they can.",
    "In other words, taxes collected from California residents would be used to subsidize the gasoline relief.",
    "There’s plenty of blame to go around for the uptick beginning with Russia’s invasion of Ukraine.",
    "Doug Ducey already nixed the idea of suspending the state’s 18-cents-per-gallon gasoline tax.",
    "Gavin Newsom is proposing to give residents $400 per each vehicle they own – capped at two.",
    "Arizonans, however, don’t need to worry about even talking about any type of relief.",
    "Instead of suspending the state’s 51.1 cents per gallon on gasoline, Gov.",
    "Elvia Díaz is an editorial columnist for The Republic and azcentral.",
    "Everyone who owns a car, rich or poor, would get the same amount.",
    "I wouldn’t mind getting $800 – in California or here in Arizona.",
    "That’s never good, but is even worse during an election year.",
    "But, ultimately, this is about greed from the oil overlords.",
    "Reach her at 602-444-8606 or elvia.diaz@arizonarepublic.com.",
    "But that kind of relief would come from taxpayers’ pockets.",
    "It would be better to rein in the oil overlords’ greed.",
    "Count me among those gasping when I go to gas pump.",
    "That would fill up my gas tank a few times over.",
    "Those are the ones that truly need relief now.",
    "But California wants to do more – much more.",
    "Ah, and let’s not forget Sen. Mark Kelly.",
    "How do we rein in oil overlords' greed?",
    "Georgia and Maryland already did it.",
    "Follow her on Twitter, @elviadiaz1.",
    "Prices are simply out of control.",
    "What’s not to like about that?",
    "Connecticut could be next.",
    "Just buckle up and pay up.",
    "Arizona Republican Gov.",
    "But how do we do that?",
    "That’s beyond stupid.",
    "Don’t get me wrong.",
    "Seriously."
  ]
}