{
  "id": 11873,
  "mediaId": 2883,
  "date": "2022-03-29",
  "headline": "Government prepares for possible spike in migration",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/03/MG_2136.jpg",
  "link": "https://rollcall.com/2022/03/29/government-prepares-for-possible-spike-in-migration/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Simon",
  "authorUrl": "https://www.rollcall.com/author/caroline-simon/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I think it's unclear what the impact of Title 42 potentially lifting in the coming days, weeks or months would be on migratory flows, but we need to be prepared.”\nDepartment-wide preparations involve technical assistance from the Federal Emergency Management Agency, interagency coordination with the Justice and Defense departments, and contracts with air and ground transportation companies to transport migrants.",
    "On Tuesday, DHS said it was preparing for three scenarios: a continuation of current migration levels of about 7,100 per day, which reflect a historic high; a “higher” situation in which border agents record roughly 12,000 encounters with migrants per day; and a “very high” situation where daily encounters top 18,000.",
    "“We urge your Administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border,” they said in a letter.",
    "The Department of Homeland Security said it is constructing temporary shelters and working with other government departments to prepare for potential migration increases at the U.S.-Mexico border in the coming months.",
    "Menendez and other top Democrats, including Senate Majority Leader Charles E. Schumer, D-N.Y., have spent months urging Biden to do away with Title 42, particularly as other pandemic restrictions have lifted.",
    "The preparations come as the Biden administration considers lifting Title 42, a public health directive used for more than two years to “expel” migrants from the border in an effort to stem pandemic spread.",
    "Since the start of fiscal 2022 on Oct. 1, government data shows border officials have recorded more than 900,000 encounters with migrants, a 99 percent increase from the same time frame in fiscal 2021.",
    "Officials said DHS additionally is “actively working on plans” to expand processing at ports of entry, including the creation of a preregistration system for migrants presenting themselves.",
    "“There has been time to figure out how one appropriately processes those who are seeking asylum under our law, to do the lawful thing,” Sen Bob Menendez, D-N.J., said earlier this month.",
    "“They've got to have something to take its place to be able to actually do border enforcement,” said Sen. James Lankford, R-Okla. “And I don't see that in place at this point.",
    "“We obviously can't speak on behalf of the CDC and have no real visibility into their processes,” said one DHS official, who spoke to reporters on the condition of anonymity.",
    "However, congressional Republicans and even some Democrats have warned that chaos could ensue if the health directive is lifted without adequate preparation.",
    "The government then scrambled to rapidly erect more than a dozen emergency intake sites to care for the thousands of children who entered the country.",
    "Mark Kelly, D-Ariz., and Kyrsten Sinema, D-Ariz., urged Biden against lifting the public health directive without a solid plan in place.",
    "More than a year later, his allies have urged the administration to be fully prepared for a wider rollback of the policy.",
    "Shortly after taking office in 2021, President Joe Biden stopped using Title 42 to expel unaccompanied migrant children.",
    "A rollback of Title 42, named for the section of federal health law that permits it, could quickly escalate crossings.",
    "The health directive can be renewed every 60 days based on a Centers for Disease Control and Prevention assessment.",
    "They also include the construction of temporary facilities to accommodate a possible influx of migrants.",
    "The spring and early summer months are historically a busy time at the border.",
    "It doesn’t seem like they're ready.”\nLast week, Sens.",
    "They've had a full year to prepare for this.",
    "The next review period ends March 30."
  ]
}