{
  "id": 1193,
  "mediaId": 8475,
  "date": "2022-02-10",
  "headline": "GOP Senate candidate shoots pistol at Biden, Pelosi & Mark Kelly in campaign ad",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/021022_jim_lamon_ad_screencap.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/021022_lamon_ad/gop-senate-candidate-shoots-pistol-biden-pelosi-mark-kelly-campaign-ad/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Ingram",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/6436",
  "termIds": [
    0
  ],
  "sentences": [
    "In the video, released Thursday in multiple versions on Youtube and Twitter and which the campaign claims is slated to be shown during the Super Bowl, former solar industry CEO Lamon wears leather chaps, boots and spurs, a white cowboy hat and a vest with a six-pointed star pinned to it, and stands in a dusty street to oppose the black-hatted \"D.C. gang\" including \"Old Joe,\" \"Shifty Kelly,\" and \"Crazyface Pelosi.\"",
    "As the Arizona Republic reported, as Ducey certified the results, Lamon and the others met at the Arizona Republican headquarters, and signed the document sending it to the U.S. Senate despite the lack of a procedure that even allows Arizona's election results to be decertified based on lies that Democrats somehow tampered with the election results to give Biden the margin of victory to become the President.",
    "Local\nCritics of ad linked Western-style shootout to violent Tucson attack that wounded Gabby Giffords, Kelly's wife, and killed 6 others\nBehind in the polls in the Republican Senate primary in Arizona, candidate Jim Lamon is seeking attention with a Western-themed campaign ad in which he is depicted aiming and firing a gun at U.S. Sen. Mark Kelly, House Speaker Nancy Pelosi and President Joe Biden.",
    "The Democratic figures, their faces mostly blocked by handkerchiefs, draw their weapons — the actor playing Kelly pulling a pistol, \"Pelosi\" raising a large knife over her head, and the stand-in for the president wielding a shotgun — and Lamon fires at them, disarming each by shooting the weapons out of their hands, sending them awkwardly running away.",
    "The 30-second ad was immediately criticized, as people compared the cowboy \"showdown\" acted out in the video to the real-life shooting of Kelly's wife, former U.S. Rep. Gabrielle Giffords, who was gravely injured during an attempted assassination 11 years ago that left 18 people wounded, and killed six, including a 9-year-old girl and a federal judge.",
    "While Lamon's campaign founders, the former CEO also faces an investigation by the U.S. House Select Committee, which is investigating the Jan. 6, 2021 insurrection at the U.S. Capitol, when thousands smashed their way into the building to stop the Senate from counting Arizona's votes.",
    "Polling from OH Predictive Insights show that Lamon is in the middle of the pack among the five Republican candidates for senator, polling far behind Arizona Attorney General Mark Brnovich and the former head of the Arizona National Guard Maj. Gen. Michael McGuire.",
    "Along with Lamon, the ad also includes Pinal County Sheriff Mark Lamb, and Brandon Judd — head of the union for Border Patrol agents who has routinely lent himself out as a campaign surrogate, including an appearance in an ad for Texas Gov.",
    "Lamon has claimed his company, a Scottsdale-based solar company, was worth around $1 billion, but it's unclear how much of that sale landed in the former CEO's pockets, giving him funds to dump into his campaign for new ads.",
    "In mid-January, he released an ad called \"Let's go,\" that included the phrase \"Let's go, Brandon,\" a shibboleth among Republicans that stands in for \"Fuck Joe Biden\" among those reluctant to directly voice that sentiment.",
    "According to a poll conducted among Republicans last month by OHPI, Lamon would receive just 7 percent of the vote, far behind Brnovich who could pick up 25 percent of the vote, and McGuire who polls around 11 percent.",
    "And, while most Republican and Democratic voters say they will support their party's nominee, Noble said that 35 percent of non-party \"independent\" voters are unsure of how they plan to vote in November's election.",
    "\"At the same time, Kelly has to navigate a reelection campaign in a political environment where voters are turning their frustrations with President Biden to other Democratic leaders and candidates,\" Noble said.",
    "Meanwhile, a former executive director of the Arizona Republican Party, Brian Murray—who is now championing one of Lamon's rivals as a political consultant—called Lamon's ad \"the most pathetic yet.\"",
    "While the ex-president lost Arizona by over 10,000 votes, Lamon and 10 others signed the document and sent it by certified mail to the U.S. Senate claiming they were the established electors.",
    "\"The Republican electors put forth a valid document that said, in the event that the election was overturned, there would be no excuse not to recognized those electors,\" Lamon claimed.",
    "Meanwhile, Brnovich has raised about $1.7 million in individual contributions, while McGuire has received about $662,000 in individual contributions and lent his campaign $249,500.",
    "Lamon was also one of 11 Arizona Republicans who signed a document falsely claiming they were electors and could cast a ballot for President Donald Trump in the 2020 election.",
    "He responded to Arizona Daily Star journalist Tim Steller's noting the bungle by calling it \"Mickey Mouse crap,\" and apparently blocking others who tweeted about the mistake.",
    "However, at this time, the freshman senator has a \"narrow lead\" against a generic Republican, running at 42 percent while the Republican polls at 38 percent.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "Last month, Lamon's knowledge of Arizona was questioned when he incorrectly spelled the name of a major Southern Arizona city as \"Tuscon\" in a tweet.",
    "However, the document does not include such language, and instead calls Lamon and the others the \"duly elected and qualified electors\" for the state.",
    "Kelly's campaign refused to respond to questions about the ad, writing in an email to TucsonSentinel.com simply \"We're going to pass on commenting.",
    "The ad prompted a backlash online, as people linked Lamon's commercial with the violent attack on Giffords, and demanded the candidate apologize.",
    "\"It makes a lot of sense now why Republican leadership has been actively pursuing Ducey to run in the Arizona Senate contest,\" Noble said.",
    "Lamon has defended the document as a contingency plan, and that he was one of Arizona's official electors if the election was decertified.",
    "Meanwhile, Kelly has a war chest of nearly $27 million for his campaign already, including over $25 million in individual contributions.",
    "This puts Lamon just barely ahead of Peter Thiel-darling Blake Masters and Justin Olson, a member of the Arizona Corporation Commission.",
    "A crowd of actors, also in Western wear, runs down a litany of stock Republican lines, voicing them with exaggerated cartoonish drawls.",
    "Lamon's campaign has also struggled to much headway with funding, having raised just over $556,000 in individual contributions.",
    "That Lamon ad was rejected by Yahoo, who told his campaign that it would only accept the digital ad if they removed the phrase.",
    "Meanwhile, Lamon has benefited from the sale of his company DEPCOM Power to Koch Industries for an undisclosed sum.",
    "Thursday's video isn't the first time Lamon has released a provocative ad as he attempts to bolster his campaign.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "Overall, Lamon has around $5.9 million in cash, far more than his competitors because of his personal loans.",
    "Lamon has said his campaign would refuse funding from political action campaigns, and \"special interests.\"",
    "Doug Ducey steps into the fray, or former President Donald Trump decides to endorse a candidate.",
    "It's time for a showdown,\" Lamon says in his best Western drawl, with a closeup showing a smirk.",
    "Among the Republicans, Brnovich remains the frontrunner, said Mike Noble, OHPI's head pollster.",
    "Shannon Watts, founder of gun control group Moms Demand Action, called the ad \"disgusting.\"",
    "However, Lamon lent his campaign $8 million, according to campaign finance reports.",
    "Both Lamb and Judd were also kitted out in stereotypical Western sheriff duds.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "One actor, sitting on a horse-drawn stagecoach, hollers about gas prices.",
    "\"I think when he loses he should start producing used car commercials.",
    "He's perfect for that, and that ain't no bull,\" Murray wrote.",
    "\"The good people of Arizona have had enough of you.",
    "Donate to TucsonSentinel.com today!",
    "However, that could change if Gov.",
    "Greg Abbott.",
    "Thanks.\"",
    "- 30 -"
  ]
}