{
  "id": 12150,
  "mediaId": 6746,
  "date": "2022-03-22",
  "headline": "Outdated E-3 Sentry AWACS Is Compromised in Modern Air Combat With 5th Generation Chinese J-20",
  "image": "https://1075914428.rsc.cdn77.org/data/images/full/269655/outdated-e-3-sentry-awacs-is-compromised-in-modern-air-combat-with-5th-generation-chinese-j-20.jpg",
  "link": "https://www.hngn.com/articles/241192/20220322/outdated-e-3-e-7-sentry-awacs-compromised-modern-air-combat-5th-generation-china-j-20.htm",
  "mediaOutlet": "hngn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Forster",
  "authorUrl": "https://www.hngn.com/reporters/ed-forster",
  "termIds": [
    0
  ],
  "sentences": [
    "Last year, Boeing anticipated that the US Air Force would publicly declare plans to buy its E-7 Wedgetail airborne early warning and control jet in 2022, stirring up rumors that the plane would be included with the military's subsequent expenditure, noted Breaking Defense.",
    "E-3 Sentry AWACS Outdated Capabilities\nPacific Air Force Chief Kenneth Wilsbach is concerned that more interactions are expected from stealth fighters, especially, reported the Eurasian Times.",
    "At the optimal altitude, its radar is a look-down type with 360-degrees of the surrounding horizon of fewer than 320 kilometers, seen seaborn and aerial threats in its monitors.",
    "He said the AWACS fleet is not doing too good and suffering from unreliability, with four in the PACAF, adding they are not flight-ready due to maintenance issues.",
    "When the E-3 is in flight, the sensors are not reassuring, lagging in a 21-1st century fight with the rise of the Chengdu J-20 or the same combat system it fails.",
    "E-7 To Replace the E-3\nTo date, the E-7 is flowed by several US allies, are Australia and South Korea, has better reliability and performance than the older E-3.",
    "The E-3 Sentry AWACS had already been in service with the US Air Force for thirty years, and one plane can monitor 120,000 square miles.",
    "Age has caught up with the E-3 Sentry AWACS, which shows its declining abilities when matched against newer combat planes and weapons.",
    "But the USAF asked for information about the E-7A mentioned Airforce Magazine, expressing interest but not committing to any expense.",
    "Much Needed E-3 Upgrades\nOne of the problems is the scarcity of the parts for the Pratt & Whitney TF-33 engines used for the AWACS.",
    "Plans to buy the E-7 are considered, the US is not ready to abandon its E-3s yet, but the need exists, and it is getting urgent.",
    "The E-3 Sentry AWACS is grounded too often despite the good equipment, though it can survive, a modern fight is yet to be seen.",
    "As the Indo-Pacific theatre gets more involved, the E-3 will need the upgrades or be diminished by the Chinese or Russians.",
    "According to Air Combat Command Head Gen. Mark Kelly, they were affected by the lack of spare parts in October last year.",
    "Having the J-20 or the J-11 prowling around will have one of the E-3 Sentry AWACS in the Pacific is not a good thought.",
    "The range is too short for the platform to work effectively, and the interceptor can shoot it down without a fight.",
    "Chief Wilsbach said the Boeing E-3 should be replaced when he spoke at the Mitchell Institute of Aerospace Studies.",
    "Furthermore, the Boeing 737-based E-7 airborne early warning and control aircraft has long been supported by him.",
    "In a strategic role, it can identify and monitor hostile aircraft flying at lower elevations over any terrain.",
    "These problems are not serious, but they are the plane's electronics, hydraulic system, and engines.",
    "Of concern is how it can survive against the J-20 and its PL-15 air missile, which is long-ranged.",
    "But maintenance problems have made it hard to operate them and get the E7 AWACS as a replacement.",
    "Read Also: Joe Biden Net Worth 2022: How Wealthy Is the 46th President of the United States?",
    "They were grounded and weren't up to flying sorties in the Indo-Pacific.",
    "They can also clearly identify friendly aircraft in the same area.",
    "It led to where it could keep up with a modern combat arena.",
    "Two planes if the USAF will commit to it.",
    "Plans to buy it are in the works."
  ]
}