{
  "id": 12168,
  "mediaId": 2574,
  "date": "2022-03-25",
  "headline": "Over Dem Objections, Biden Admin on Track To End Pandemic Policy That Allows Swift Deportation of Migrants",
  "image": "https://freebeacon.com/wp-content/uploads/2022/02/GettyImages-1358086312-scaled-e1645041884959.jpg",
  "link": "https://freebeacon.com/biden-administration/over-dem-objections-biden-admin-on-track-to-end-pandemic-policy-that-allows-swift-deportation-of-migrants/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Simonson",
  "authorUrl": "https://freebeacon.com/author/joseph-simonson/",
  "termIds": [
    0
  ],
  "sentences": [
    "Sinema and Kelly, who represent a swing state hit hardest by the millions of migrants attempting to enter the country in the last year and a half, wrote a letter to Biden on Thursday urging the White House \"not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border.\"",
    "Documents obtained by the Washington Free Beacon show leadership within DHS preparing meetings in the last week of March about the termination of Title 42, a Centers for Disease Control and Prevention measure that allows immigration enforcement agencies to immediately expel any migrant who arrives on the border.",
    "A sharp end to Title 42 without a comprehensive plan in motion would significantly increase the strain on DHS, border communities, and local nonprofits that are already near or at capacity.\"",
    "Officials within CBP regularly receive orders to prepare new migrant processing centers and methods in anticipation of an even higher number of border crossings through the end of the year.",
    "Preliminary data obtained by the Washington Post show that law enforcement officials are on track to record more than 200,000 migrant detentions in March, the highest amount since August.",
    "DHS secretary Alejandro Mayorkas called for the termination of the program in October, saying it is \"not an immigration policy that we in this administration would embrace.\"",
    "The Department of Homeland Security is moving forward with plans to end a pandemic-era policy that allows for the swift deportation of migrants just one day after Sens.",
    "Republicans have relentlessly criticized the Biden administration for considering an end to the policy, and Democrats such as Kelly and Sinema are joining the chorus.",
    "\"One of the first actions the admin is taking after the end of the pandemic is to let more single males into the country,\" a senior CBP official told the Free Beacon.",
    "Title 42 has been responsible for the expulsion of roughly 1.7 million migrants as the Biden administration faces an unprecedented surge at the southern border.",
    "Kelly is up for reelection in November and the Republican National Committee believes he is particularly vulnerable given Biden’s handling of immigration.",
    "A February poll by Arizona State University found immigration the number-two issue among the state’s voters, with the economy just narrowly winning out.",
    "The policy, first implemented under former president Donald Trump in March 2020, has been sharply criticized by left-wing activists as inhumane.",
    "The Free Beacon reported in February on a memo instructing senior DHS officials to prepare for the possibility of Title 42’s repeal on April 1.",
    "Customs and Border Protection officials disagree, with many predicting an end to Title 42 will worsen the current immigration crisis.",
    "\"Spring and summer is the busiest time at the southern border and we’re encouraging even more to illegally enter the country.\"",
    "The January figures are comparable, showing only a slight trend upward on the number of expulsions,\" the letter reads.",
    "Advocates say it is an effective deterrent for those seeking to enter the country without humanitarian justification.",
    "\"Last month alone, CBP expelled 91,513 migrants under Title 42, and processed 73,460 individuals under Title 8.",
    "Kyrsten Sinema (D., Ariz.) and Mark Kelly (D., Ariz.) warned President Joe Biden against ending the policy.",
    "At roughly 1.6 million, the 2021 fiscal year saw more migrant arrests than any other year on record.",
    "Subsequent reporting by other outlets corroborated that date.",
    "\"Of those encounters, nearly 30 percent occurred in Arizona.",
    "Total migrant encounters exceeded two million."
  ]
}