{
  "id": 12207,
  "mediaId": 2636,
  "date": "2022-03-28",
  "headline": "Ted Cruz Knows Which Side He’s On",
  "image": "https://static01.nyt.com/images/2022/03/29/multimedia/28conversation_1/28conversation_1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/03/28/opinion/biden-ukraine-jackson-cruz.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "And she wrote Mark Meadows, Trump’s chief of staff, some texts right after the election was called for Biden, telling him to “stand firm” against “the greatest Heist in our History.”\nAll of which says to me that I’m glad I’m not the one who gets to hang with Ginni Thomas, but de gustibus non est disputandum, as they used to say.",
    "I’m also in favor of the proposal from Maggie Hassan and Mark Kelly — both Democratic senators — to suspend the federal tax on gasoline for the rest of the year, though I would only reinstate it once the price of gasoline falls below $3.50 a gallon, no matter whether that happens before November or after.",
    "His speech in Poland, in which he said, “For God’s sake, this man cannot remain in power,” may have been provocative, and it might have his advisers scrambling to soften it, but it was right, and the right message to send about what should become of Vladimir Putin’s foul regime.",
    "Bret: Probably won’t get past the Senate, may be ruled an unconstitutional wealth tax by the Supreme Court and is reminiscent of the alternative minimum tax, which was supposed to hit only a handful of highfliers in the 1970s but wound up taxing far less wealthy people.",
    "I don’t think her confirmation is in any doubt, especially now that Joe Manchin has come out in her favor, but I enjoyed watching her politely making mincemeat of Ted Cruz, who is a one-man reminder of why sentient people hate politicians.",
    "A stalemated truce in which Russia steals more of Ukraine’s coastline, ports and energy riches will only entice Putin to create further crises so that he can “solve” them in exchange for Western concessions.",
    "And both men were sailing into calmer seas, economically speaking, as they prepared their re-election campaigns, whereas I don’t see inflation being tamed except at the price of a very steep recession.",
    "Yeah, given the fact that the richest Americans are now paying an effective tax rate around 8 percent, I would say a minimum of 20 percent on households worth more than $100 million is not a burden.",
    "Gail: I’d also be happy to see him lead a quest to control prescription drug prices: Let Medicare negotiate with the pharmaceutical industry and cap the cost of certain medications, like insulin.",
    "If Republicans were wiser, they’d register their disagreements with some of her positions but vote to confirm her on the principle that she’s fully qualified to serve on the high court.",
    "That said, if every public official were on the hook for nutty things done or said by spouses or family members, it would probably have unintended consequences nobody would like.",
    "But the government can still ease all kinds of regulatory burdens that constrict supply chains, like employing members of the National Guards to make up for the trucker shortage.",
    "Gail: I will refrain from dipping back into our Hunter Biden argument except to point out that some experts think he’s getting a reasonable price for his artwork these days.",
    "I also don’t think Trump’s going to run — he’s damaged himself more deeply than he probably realizes with his imbecile praise of Putin and his continued election denialism.",
    "Gail: Short-term gas price relief would be great, as long as it’s combined with long-term plans to fight climate change with energy-efficient cars and more mass transit.",
    "Bret: Bush had the advantage of not having to face down a nuclear-armed adversary — thanks to an Israeli strike on Saddam Hussein’s nuclear reactor a decade earlier.",
    "Gail Collins: Hey, isn’t it interesting to recall that when Bush was fighting to get Saddam Hussein out of Kuwait in 1991, the big American ally was Russia?",
    "Both men were in touch with the center of American politics in a way Biden should be, but isn’t, because he steered too far to the left in his first year.",
    "Gas taxes are really regressive once you stop to think of the bite they take out of the pockets of working-class people who drive back and forth to work.",
    "Gail: If they get an overturn-the-election case, or even anything relating to the Jan. 6 riots, I would say he’d either have to recuse or be impeached.",
    "Gail: Not going to argue, but right now back to domestic matters …\nBret: Biden’s other big task is doing what he can to ease the burden of inflation.",
    "But I am appalled that Congress didn’t approve the $15.6 billion Biden wanted for tests, treatments and research on vaccines for new variants.",
    "Bret: If we’re going to start thinking of Covid as a relatively normal illness, maybe we need to stop treating it like a national emergency.",
    "Do you really think Biden would be walloped if people actually had to compare him to Trump, one on one, presuming the two of them ran again?",
    "His problem is that he doesn’t — never did have — that political genius for selling the country, or even his supporters, on a big message.",
    "Gail: We should talk more about the refugees long term, but of course the immediate challenge is to support them in every way possible.",
    "I also think we should accept more than 100,000 Ukrainian refugees; we should welcome as many who want to come here with open arms.",
    "Bret: He’d have to recuse himself in those kinds of cases, because the appearance of a conflict of interest is now overwhelming.",
    "Bret: Depends on whether you think that being a fever-swamp conservative is dangerous, weird or just the depressing new normal.",
    "Wife of a Supreme Court justice and now revealed as a very aggressive, deeply crazy activist in the Trump-really-won sideshow.",
    "Assuming your hypothetical turns out to be right, I’d probably place a small bet on Trump winning a rematch, awful as that is.",
    "We could discuss the possibility of Biden suffering a similar fate — perceptions of a bad economy trump strong foreign policy.",
    "Gail: Also watching the dreaded Marsha Blackburn asking Jackson to define “woman.” Glad we agree that Republicans aren’t wise.",
    "Lips sealed …\nBret: But speaking of the Supreme Court, did you watch the Senate hearings for Judge Ketanji Brown Jackson?",
    "Bret: In the meantime, Gail, it looks like we have a new superinfectious subvariant of Covid to keep us awake at night.",
    "Unless, of course, you haven’t been vaccinated, in which case there’s probably not any point in having a conversation.",
    "I think many Americans would give President Biden reasonably high marks for his handling of the war in Ukraine so far.",
    "If I’m going to side with the throw-away-masks crowd, I’m also going to side with the fund-the-support-system gang.",
    "Except that Clinton’s genius was in portraying himself as a Democrat who normal Republicans didn’t have to fear.",
    "Although he’d be crazy to formally announce this soon and turn the bulk of his presidency into a lame-duck limp.",
    "She urged the Trump team to feature Sidney Powell, the lawyer with bizarro theories about voting machine fraud.",
    "I know Ronald Reagan and Bill Clinton were able to turn their presidencies around after difficult starts.",
    "Just noticed that a Gallup poll found that right after the war, Bush had an 89 percent approval rating.",
    "Very, very doubtful the next Republican presidential nominee is going to be able to turn that trick.",
    "Bush, who handled the big foreign policy crises of his day with aplomb but wound up as a one-termer.",
    "Bret: If Romania can take in more than half a million refugees, we can take in at least as many.",
    "Gail: I’m going with Dr. Anthony Fauci’s theory that it’s not something to get frazzled about.",
    "Bret: I continue to have a hard time believing that Biden intends to run again, when he’s 81.",
    "Bret: Don’t agree that he should wait to announce, but that’s an argument for another time.",
    "Do you think her behavior should require Clarence Thomas to recuse himself in some cases?",
    "Although I know the latter tends to cause many conservative conservatives to shudder.",
    "But both men were naturally gifted political figures in a way Biden just isn’t.",
    "1 for Biden is to make sure Putin experiences unmistakable defeat in Ukraine.",
    "The Times is committed to publishing a diversity of letters to the editor.",
    "On a completely different but totally fascinating topic: Ginni Thomas.",
    "Gail: And I don’t think his problem is steering too far to the left.",
    "We’d like to hear what you think about this or any of our articles.",
    "But it looks like he’s trying with his plan to tax the very rich.",
    "Gail: And yet he got defeated for a second term by Bill Clinton.",
    "Gail: Ah, Bret, our most reliable, perpetual disagreement.",
    "Otherwise it’s hard to imagine enough pressure building.",
    "Ms. Thomas attended the Stop the Steal rally on Jan. 6.",
    "Gail: Yeah, but I don’t think Biden is going to run.",
    "Gail: This scenario presumes Trump bows to reality.",
    "What do you say we argue about this another day?",
    "It’d be a debate people could really get into.",
    "We both know that’s mainly a job for the Fed.",
    "Is she dangerous or just astonishingly weird?",
    "But the proposal could still be … popular.",
    "And here’s our email: letters@nytimes.com.",
    "Yet Biden still reminds me of George H.W.",
    "“All of the above” is also a possibility.",
    "Anything else you’d like to see him do?",
    "Which … well, what do you think of it?",
    "Bret: Give ’em hell, Harry, he is not.",
    "Forget Omicron, now we’ve got Omigod.",
    "Would you bet on Biden in a rematch?",
    "What do you think of the comparison?",
    "But I’d be happy to hear I’m wrong.",
    "Those were the days, I guess.",
    "For instance: Hunter Biden.",
    "Should we worry about her?",
    "How do you think she did?",
    "Gail: Better than great.",
    "Bret Stephens: Hi, Gail.",
    "Bret: I think job No.",
    "Here are some tips.",
    "What do you think?",
    "Bret: Fair point.",
    "But … they won’t.",
    "Sorry, continue.",
    "Bret: Agree.",
    "Hehehehehe."
  ]
}