{
  "id": 12232,
  "mediaId": 2526,
  "date": "2022-03-27",
  "headline": "Senate GOP Moderates Silent on Ketanji Brown Jackson’s Trustee Role at Woke, Pro-Critical Race Theory School",
  "image": "https://media.breitbart.com/media/2022/03/SCMRLM-640x335.png",
  "link": "https://www.breitbart.com/politics/2022/03/27/senate-gop-moderates-silent-on-ketanji-brown-jacksons-trustee-role-at-woke-pro-critical-race-theory-school/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    5699,
    5583,
    3099,
    4597,
    2383,
    1489,
    1126
  ],
  "sentences": [
    "In a July 17 letter from Board chair Lisa Fairfax, who introduced Jackson to the Senate, she indicated that “the Board can play its critical role in ensuring that we fulfill the GDS mission and for ways in which the Board can serve as a source of oversight and accountability for the important work to be done.”\nOne such area of focus was addressing “concerns about the GDS curriculum” with regard to race and “equity,” “to better ensure that our entire community commits to making GDS an antiracist institution.”\nIn the same letter, the board also came to “a recognition that the entire GDS community—including members of the white community, students and parents, faculty and staff—must commit to engaging in the intentional work of fostering an antiracist environment.”\nIn a subsequent letter, Georgetown Day School said to its “white community” that incidents like the deaths of Ahmaud Arbery, Breonna Taylor, and George Floyd are “what occurs when we do not view the work of diversity, equity, and inclusion as all of our work.”\nIt also lists the following “work” white persons can do to make race central to their lives:\nEngaging in White anti-racist work and educating ourselves and our children on the societal conditioning of anti-Black racism;\nEnsuring that the race conversation is not one that is only had by people of color and members of our Black community; and\nEngaging in educational opportunities and programming that seeks to heighten our awareness of White racial identity development.",
    "In an interview, the sex offender seemingly thanked Jackson for the lenient sentence, saying, “I feel that she chose to take into consideration the fact that I was just getting started [in life] and she knew this was going to hold me back for years to come regardless … so she didn’t really want to add on to that.”\nRepublicans on the Senate Judiciary Committee are now demanding Jackson turn over all relevant information regarding the case — including details where the sex offender was later forced into a halfway house because of his likelihood to continue browsing child pornography.",
    "The school also boasts a lengthy “Family and Educator Anti-Racist Resources” list, on which eight and nine-year-olds are recommended Stamped: Racism, Antiracism, and You, by Jason Reynolds and Ibram X. Kendi, a book that asks, “Can we send white people back to Europe?”\nOther “Books for Kids” include a list of 40 “picture books for young activists,” “31 Children’s books to support conversations on race, racism, and resistance,” and 75 Things White People Can Do for Racial Justice by Corinne Shutack.",
    "“She said, ‘You do not have to be me in order for us to fight alongside each other.’”\nYet another fourth-grader said, “Being an ally is all about showing up pushing back and taking action.”\nIn addition to concerns about her ties to Georgetown Day School, Senators are increasingly alarmed by Jackson’s record of sentencing child pornography offenders to lenient sentences that were below recommendations by the Sentencing Commission.",
    "Romney has previously shrugged off GOP concerns about Jackson while Collins has called Jackson’s record as a defense attorney and federal judge “impressive.”\nKelly Tshibaka, the Trump-backed conservative running against Murkowski in her Senate re-election bid, told Breitbart News that the moderate GOP Senator is “forcing Alaskans to play the age-old guessing game ‘How will Murkowski vote?",
    "The left is able to deny the existence of critical race theory in schools and maintain that it is merely a legal theory taught in law schools — as Jackson did in front of the Senate — because phrases like “anti-racist,” “social emotional learning,” and “equity” have been used to surreptitiously refer to it as the ideology started to become a political issue for the Democrats.",
    "As Breitbart News reported, the school “had children perform a play with adult sexual content and encouraged fourth-graders to participate in left-wing activism.”\nThe school’s drama department put on a musical rendition of the sexually explicit 1906 German play Spring Awakening, which explores adolescent sexual experimentation.",
    "Susan Collins (R-ME), Lisa Murkowski (R-AK), and Mitt Romney (R-UT) have remained silent on Judge Ketanji Brown Jackson’s role on the Board of Trustees of Georgetown Day School — the private Pre K–12 school that promotes critical race theory, left-wing activism, and adult sexual content for students.",
    "Watch: Ted Cruz Questions Judge Ketanji Jackson Brown on Critical Race Theory\nCollins, Murkowski, and Romney — considered the Senate’s most moderate Republicans — did not respond to requests for comment from Breitbart News relating to Jackson’s role as a trustee at Georgetown Day School.",
    "“I believe it’s an academic theory that’s at the law school level.”\n“The board is not, the board does not control the curriculum, the board does not focus on that, that’s not what we do as board members so I’m actually not sure,” Jackson claimed.",
    "The school’s fourth-graders were also forced into performative, left-wing activism in “Free to Be Me,” an assembly aimed at celebrating “LGBTQ+ voices,” which also compared the Black Lives Matter movement to the 1960s Civil Rights Movement.",
    "Similarly, resources such as books written by prominent critical race theory purveyor Ibram X. Kendi or other works that instruct readers on how to “deal with their whiteness” are key indicators of a school’s employ of the ideology.",
    "The musical “is not only about sexual awakening, but perhaps more so about self-discovery,” Georgetown Day School High School Performing Arts Department Chair Laura Rosberg said in a disclaimer to potential audience members.",
    "As Sen. Ted Cruz (R-TX) noted in his statements at Jackson’s confirmation hearings, the school steers students toward social justice causes and critical race theory, among other components of left-wing activism.",
    "As Breitbart News reported, despite Jackson’s testimony to the opposite, the Board of Trustees does, in fact, deal with curriculum and the broader push for the radical racial doctrine on a school-wide basis.",
    "Teaching impressionable children that they cannot succeed or cannot be friends with each other because of the color of their skin is exactly the opposite of what we want kids to learn,” Tshibaka said.",
    "Jackson, in one particular case, handed down a three-month prison sentence to a sex offender caught with 17 videos and 16 images of child pornography depicting boys 8 to 12 years old in sex acts.",
    "“I’ve enjoyed the irony of a story about intimacy at a time when kids can’t be intimate.”\nAccording to the student paper, some students and staff had “reservations” about doing the play.",
    "Senate Minority Leader Mitch McConnell (R-KY) has said he would oppose Jackson for the lifetime position while Sen. Joe Manchin (D-WV), considered a swing vote, has vowed to back her.",
    "After explaining what the acronym “LGBTQ+” means, one fourth-grader said, “there are many, many more identities in the LGBTQ+ community that we haven’t learned enough about yet.",
    "“As a senator who will have to vote on Judge Ketanji Brown Jackson’s nomination to the Supreme Court, Lisa Murkowski should express a clear opinion about this, too,” she said.",
    "But critical race theory is not the only red flag Senators are considering when reviewing Jackson’s fitness for office as it relates to her role at Georgetown Day School.",
    "Jackson, who is currently being considered to fill retiring Supreme Court Justice Stephen Breyer’s seat, sits on the board of the Washington, D.C., private school.",
    "“Now let’s look at a quote from Audrey Lorde, a famous poet and activist who described herself as black, lesbian mother, warrior poet,” one fourth-grader said.",
    "They are important and we will learn more.”\nOne of the central themes of the presentation was that being an “ally” was not enough, favoring activism.",
    "I don’t think so,” Jackson said when asked by Cruz if critical race theory was taught and practiced in classrooms at Georgetown Day School.",
    "“Being more exposed and immersed in what we were doing, I got a little bit desensitized,” one of the actresses, a junior, said.",
    "Jackson needs 50 votes in the Senate, as Vice President Kamala Harris can break a tie, to be confirmed to the Supreme Court.",
    "Murkowski voted against Brett Kavanaugh’s nomination to the Supreme Court, while Collins voted in favor of the now-Justice.",
    "'”\n“Whenever the left gets called out on indoctrinating our children through Critical Race Theory, they usually deny it.",
    "Other Democrat swing votes, who could vote with Senate Republicans to block Jackson’s confirmation, are Sens.",
    "“But the subject matter is still very heavy.” Technical Director Christal Boyd also voiced concerns.",
    "Jackson’s Georgetown Day School displays all key indicators with pride.",
    "Breccan F. Thies is a reporter for Breitbart News.",
    "Kelly is facing a tough re-election this year.",
    "We must eliminate the ‘woke’ from our schools.",
    "You can follow him on Twitter @BreccanFThies.",
    "John Binder is a reporter for Breitbart News.",
    "Kyrsten Sinema (D-AZ) and Mark Kelly (D-AZ).",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here.",
    "“I don’t know.",
    "Sens."
  ]
}