{
  "id": 12251,
  "mediaId": 2830,
  "date": "2022-03-23",
  "headline": "A Supreme Court Redistricting Clean Up",
  "image": "",
  "link": "https://www.wsj.com/articles/supreme-redistricting-mop-up-wisconsin-gerrymander-tony-evers-supreme-court-11648075358",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    0
  ],
  "sentences": [
    "Mr. Evers embraced “just the sort of uncritical majority-minority district maximization that we have expressly rejected.”\nIn a dissent, Justices Sonia Sotomayor and Elena Kagan called the majority’s ruling in response to a petition for a stay “unprecedented.” But Mr. Evers’s racial gerrymander was egregious, and lower-court judges keep misapplying Court precedents.",
    "Mr. Evers argued that seven majority-minority districts were necessary to comply with Section 2 of the VRA, which requires that minorities have equal opportunity “to participate in the political process and to elect representatives of their choice.” The Court’s confusing Gingles precedent interpreted this as a prohibition on minority vote dilution.",
    "Its order remands the map to the state high court, underscoring that a new one “must comply with our equal protection jurisprudence.”\nThe liberal dissenters are right that the Court’s redistricting precedents are “hazy,” a point Chief Justice John Roberts made last month in a VRA challenge to Alabama’s House map.",
    "Wisconsin’s high court “focused exclusively on proportionality” and failed to consider “whether a race-neutral alternative that did not add a seventh majority-black district would deny black voters equal political opportunity,” the Supreme Court majority writes.",
    "WSJ Opinion: The Postmodern Art of Democratic GerrymandersPlay video: WSJ Opinion: The Postmodern Art of Democratic Gerrymanders\n Journal Editorial Report: Democrats contort Congressional districts to protect themselves.",
    "Photo: Andy Manis/Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (3 minutes)\nAD\nLoading advertisement...\n00:00 / 03:07\n1x\nThis article is in your queue.",
    "The map intentionally created seven majority-black state Assembly districts—one more than under its current map—which would have likely assured at least one more safe Democratic seat.",
    "The Court’s opinion in the Wisconsin case is a step toward clearing up this haze for lower courts, which are increasingly being asked to wade into this political thicket.",
    "Gingles and “its progeny have engendered considerable disagreement and uncertainty regarding the nature and contours of a vote dilution claim,” the Chief noted.",
    "Tony Evers addresses a joint session of the Legislature during the governor's State of the State speech at the state Capitol in Madison, Wis., Feb. 15.",
    "“Under the Equal Protection Clause, districting maps that sort voters on the basis of race ‘are by their very nature odious,’” the majority writes.",
    "The Court’s unsigned order in Wisconsin Legislature v. Wisconsin Elections Commission skewers the Governor and the Wisconsin Supreme Court.",
    "But Gingles also laid out numerous pre-conditions for creating these districts to ensure states aren’t invidiously sorting voters by race.",
    "Images: AFP/Getty Images/Redistricting & You Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "WSJ Opinion: The Postmodern Art of Democratic Gerrymanders\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Mr. Evers didn’t adhere to these pre-conditions, and the Wisconsin Supreme Court gave them only cursory consideration.",
    "Open Queue\nStates and lower court judges are using the Voting Rights Act (VRA) as cover for race-based gerrymanders.",
    "The majority is doing a service to legislatures and courts by moving to clarify its redistricting jurisprudence.",
    "On Wednesday the Supreme Court called foul by blocking Wisconsin Governor Tony Evers’s state legislative map.",
    "Wisconsin’s high court adopted Mr. Evers’s proposed map after a deadlock with the GOP Legislature.",
    "0:00 / 5:34\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "States can demonstrate compliance with Section 2 by drawing majority-minority districts.",
    "But the Justices will eventually have to address their larger Gingles muddle.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Wisconsin Gov."
  ]
}