{
  "id": 1233,
  "mediaId": 2520,
  "date": "2022-02-16",
  "headline": "Gabrielle Giffords in hospital for appendicitis; husband Sen. Mark Kelly returns to Tucson",
  "image": "https://www.gannett-cdn.com/-mm-/9eb29a93d1e6e7356118c21c04523003a951cb60/c=0-248-3709-2343/local/-/media/2018/01/23/Phoenix/Phoenix/636523329183929553-DW1-0551.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/02/16/sen-kelly-returns-tucson-where-wife-giffords-hospitalized/6813646001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yvonne Wingett Sanchez",
  "authorUrl": "https://www.azcentral.com/staff/2646083001/yvonne-wingett-sanchez/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Senate also is trying to pass a short-term government funding extension, which Senate Majority Leader Chuck Schumer, D-N.Y., said he wanted done “before the end of the week.”\nGiffords, who served in Congress from 2007 to 2012, founded with Kelly a national gun control organization after the 2011 mass shooting near Tucson that left her gravely injured, left six dead and a dozen others wounded.",
    "Giffords, D-Ariz., checked into the hospital Tuesday, according to a spokesperson for Kelly, D-Ariz.\n“Senator Kelly has headed home to Tucson to be with her,” Kelly spokesperson Jacob Peters said.",
    "Kelly’s absence from the Senate comes as the 50-50 split Senate considers two Defense Department nominations that have advanced through the Senate Armed Services Committee with his support.",
    "Sen. Mark Kelly left Capitol Hill on Wednesday to return to Tucson where his wife, former Rep. Gabrielle Giffords, is hospitalized for appendicitis.",
    "Subscribe for free to The Gaggle political podcast on Apple Podcasts, Overcast, or wherever you listen to audio content.",
    "Contact her at yvonne.wingett@arizonarepublic.com and 602-444-4712.",
    "She resigned from the House of Representatives after the shooting.",
    "Reach the reporter on Twitter @yvonnewingett and on Facebook.",
    "“We’re all wishing her a speedy and thorough recovery.\"",
    "Have news to share about Arizona politics?",
    "Subscribe to azcentral.com today.",
    "Support local journalism."
  ]
}