{
  "id": 12433,
  "mediaId": 8378,
  "date": "2022-03-23",
  "headline": "Colorado River, stolen by law: Indigenous nations have been an afterthought in U.S. water policy for over a century. That was all part of the plan",
  "image": "https://navajotimes.com/wp-content/uploads/2016/10/KA-Confluence-2.jpg",
  "link": "https://navajotimes.com/reznews/colorado-river-stolen-by-law-indigenous-nations-have-been-an-afterthought-in-u-s-water-policy-for-over-a-century-that-was-all-part-of-the-plan/?utm_source=rss&utm_medium=rss&utm_campaign=colorado-river-stolen-by-law-indigenous-nations-have-been-an-afterthought-in-u-s-water-policy-for-over-a-century-that-was-all-part-of-the-plan",
  "mediaOutlet": "Navajo Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pauly Denetclaw",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In 1922, seven states — Arizona, California, Colorado, Nevada, New Mexico, Utah and Wyoming — negotiated the Colorado River Compact without any input from Indigenous nations, even declaring, “Nothing in this compact shall be construed as affecting the obligations of the United States of America to Indian tribes.”\nState officials claimed that the Compact was designed for the “equitable division and apportionment of the use of waters of the Colorado River System.”\nAs the federal government slowly realized over the coming decades that it was bound by trust responsibilities to advocate on the tribes’ behalf, state and local governments, as well as private entities, repeatedly fought tribes over water rights.",
    "Along with other leaders from the Ten Tribes Partnership, Flores attended the annual Colorado River Water Users Association conference in Las Vegas last December, where, according to the Arizona Republic, the nations’ flags were flown alongside those of the other federal and state association members, and Indigenous officials were incorporated into the conference’s full schedule, rather than siloed as they had been before.",
    "At the same time, the Partnership is looking ahead to 2025, when the 2007 interim drought guidelines — the ones created without Indigenous input — expire, and, as Vigil said, “a new management framework will need to be created.”\nThe tribes will have to work individually to ensure their specific needs are addressed, while continuing to employ the strength found in collaboration.",
    "“It took almost 20 years to finalize.”\nDespite the Partnership’s formation, the Colorado River Water Users Association, an organization representing the states along the river whose membership wields a huge political influence over basin water policy and management, sought to discourage settlement tribes from joining.",
    "“So it’s not really subject to a legal challenge in the same way that a settlement may be, but it’s also not flexible.”\nArizona v. California also did not require the state or federal governments to provide funding for maintenance, either — a problem, since many Western irrigation canals were built over a century ago.",
    "But we can come together and support one another when it comes to our water rights.”\nThe path forward requires working with three federal governmental entities to secure water rights, while continuing to strengthen relationships between the state and local governments that will be crafting the new drought guidelines.",
    "But changing laws and guidelines requires time, money and political strength: Time, to navigate drawn-out court proceedings and settlement processes; money, to help tribes access, transport, sell and save their water; and the political strength to convince policymakers that Indigenous water rights are not optional.",
    "In the Mohave language, Aha Makhav means “the Water People.”\nThe Mohave, Chemehuevi, Hopi and Navajo — the four tribes that comprise the Colorado River Indian Tribes, a federally recognized tribe that is also known as CRIT — have relied on floodplain and irrigated agriculture along the Colorado for 4,000 years.",
    "This story was first published March 1 by High Country News (hcnorg)\nThe turbulent, choppy waters of the Colorado River pull from tributaries as far north as Wyoming before they race south for hundreds of miles, crashing together as they churn through the Grand Canyon, then smoothing out as they roll south.",
    "Whereas water rights settlements — in which Indigenous governments willingly enter into legal negotiations with state and local shareholders to more quickly establish and access their claims — can be appealed and challenged even after they’re signed, the precedent in Arizona v. California is locked.",
    "Echoing the original 1922 agreement’s hollow promise of equity, the authors claimed they had “conducted government-to-government activities” with the Indigenous nations along the river and that the tribes “were notified of the action.”\nAccording to Vigil, proper consultation sessions never happened.",
    "In 1992, 10 nations — the Colorado River Indian Tribes, as well as the Ute Tribe, Southern Ute, Ute Mountain Ute, Jicarilla Apache, Navajo Nation, Fort Mojave, Chemehuevi, Quechan and Cocopah — created the Colorado River Basin Tribes Partnership, later renamed the Ten Tribes Partnership.",
    "“Even under the most favorable of circumstances for rapid tribal water development, the amount of water that will be used by the tribes is dramatically overshadowed by the effect of climatic conditions on the overall supply of water in the Basin,” the Partnership wrote in the foreword.",
    "As reservations confined tribes to one location, forcing them to transition to agrarian lifestyles, the federal government, as their trustee, failed to build or provide funds for up-to-date water infrastructure, allowing the U.S. to effectively control Indigenous water access.",
    "The 362-page report, published in 2018 with the assistance of the Bureau of Reclamation, details the specific needs and plans of Indigenous nations in the Colorado River Basin and how those plans have been affected, first by existing U.S. policy and now by climate change.",
    "These policies simultaneously ensured and hindered the tribes’ sovereign authorities — giving them, in theory, legal rights to water without the means to access the water or even advocate for utilizing those rights, typically for farming, personal and cultural use.",
    "As a result, the CRIT has been unable to update any of its roughly 250 canals — this, in a nation that uses most of its water for agriculture and every year pulls nearly 640,000 acre-feet for farmland that is both leased to non-Natives and used by its own citizens.",
    "Meanwhile, the Indian Intercourse Act, passed and updated throughout the 18th and 19th centuries, held that while Indigenous nations were guaranteed land and water rights when reservations were created, they lacked the right to sell that water.",
    "“There was no infrastructure attached to (Arizona v. California) so that the tribe could make beneficial use of that water — it was just a number,” Devin Rhinerson, a federal representative for the Colorado River Indian Tribes, said.",
    "Indigenous leaders realized that no single state agency or federal department needed overhauling; instead, as Daryl Vigil, the water administrator for the Jicarilla Apache Nation, explained, the law of the river itself must change.",
    "The CRIT Reservation was established in 1865 for the “Indians of the Colorado River and its tributaries.” (That vague language made it easier for the tribe to welcome people from the Hopi and Navajo nations in the ’40s.)",
    "“My tribe started its settlement process in the ’70s,” Vigil said, referencing a bill passed by Congress in 1992 that secured 45,682 acre-feet per year for the Jicarilla, along with a small amount of funding.",
    "Two years later, Reclamation, the seven Upper and Lower Basin states and other stakeholders embarked on a basin-wide supply-and-demand study of the Colorado River Basin that would later guide water policy.",
    "But for the past century, the United States has repeatedly ignored the river’s original managers, despite the fact that 10 tribes within the Colorado River Basin hold 20% of the river’s total water rights.",
    "Mark Kelly and Kyrsten Sinema to pass the Colorado River Indian Tribes Water Resiliency Act of 2021, which would allow the nation to tap into a potential source of revenue by leasing its water rights.",
    "Then, in 2007, the Bureau of Reclamation issued its 56-page interim guidelines for Lower Basin water shortages, laying out an 18-year plan for how to manage reservoirs during sustained drought.",
    "“If it wasn’t for the federal government stepping in, Arizona and California might have taken all the water,” Dwight Lomayesva Jr., the vice chair of the Colorado River Indian Tribes, said.",
    "But while the court’s decision defined the amount of acre-feet of water per year that each nation could use, it also saddled tribes with the subsequent management and infrastructure costs.",
    "This landmark case established today’s legal footing for Indigenous water rights, while leaving many practical questions unanswered, and it was immediately ignored by American legislators.",
    "An ad hoc partnership\nVigil ascribed this to the partnership’s ad hoc nature and the fact that Indigenous leaders were already stretched thin by their commitments as government officials.",
    "Winters v. United States was a Supreme Court case that focused on Montana settlers who built a dam on the Milk River, which interfered with agriculture on the Fort Belknap Reservation.",
    "(Crystal Thompson, the association’s public affairs committee chair, said she hadn’t heard about the confrontation and added that the group is working to better document its history.)",
    "Vigil said the Partnership idea gained steam as the nations realized that the time-consuming legal process was not the only way to leverage their power as senior water-rights holders.",
    "In 1867, two years after CRIT’s modern reservation was established, the Bureau of Indian Affairs authorized $50,000 for building the Colorado River Indian Irrigation Project.",
    "The future will, in many ways, resemble the past, with sovereign nations still forced to prove their senior rights every time they want to move closer to water independence.",
    "No input from tribes\nThe knot of principles and policies enacted by Congress and the Supreme Court were designed without input from the nations they were supposed to serve.",
    "“We need to, in turn, do our part, so the water can continue to flow along (its) banks.”\nPauly Denetclaw is a citizen of the Navajo Nation and from Manuelito, New Mexico.",
    "“The roots provide, for the babies, the cradle boards that they are cradled in, and when a person dies, we use the wood for the funeral, for the cremation,” Flores said.",
    "“It is evident in our clan songs that follow along the river.”\nThe water from the Colorado helps the mesquite tree — a tree of life for the Mohave people — flourish.",
    "He called the group’s exclusion a “turning point.” Indigenous leaders recognized that they needed a way to leverage their combined strength and support one another.",
    "With a drought stretching into its second decade and the impacts of climate change now undeniable, the tribes are working together to ensure a future of inclusion.",
    "“That’s the bottom line.”\nA legal knot\nBut by establishing tribes as the senior-most water right users in the basin, the U.S. tied itself into a legal knot.",
    "“We have hundreds of miles of canals, and we’re losing a lot of water to the dirt canals and water going back into the river,” Vice Chair Lomayesva said.",
    "The tribes hoped that being a part of the association would encourage state and federal officials to include them in conversations around water rights.",
    "But both Flores and Vigil pointed out that their strength in the ongoing fight is grounded in seeing the Colorado River as more than a plumbing system.",
    "“It goes from birth to life.”\nSustainer of life\nThe Colorado River sustains the culture, economy and future of 30 Southwestern Indigenous nations.",
    "According to Vigil, Indigenous leaders from the Partnership confronted the association in Las Vegas, where members gather for an annual meeting.",
    "It established that the reservation’s creation reserved water rights, and that those rights were exempt from appropriation under state law.",
    "One of those cases was Arizona v. California, in which the Supreme Court decreed water rights for the CRIT and five other nations in 1964.",
    "The modern reservation system, which is the foundation of Indigenous water rights, was formed in 1851 under the Indian Appropriation Act.",
    "And in a just world, these nations — the river’s most senior users — would be central to its management in a postcolonial society.",
    "Water access and lack of infrastructure is a direct result of federal Indian water laws being written and then ignored ad nauseam.",
    "“With a quarter ownership of the Colorado River, it was just unconscionable,” Vigil, a former chairman of the Partnership, said.",
    "According to the U.S. Department of Health and Human Services, 9,500 homes on the Navajo Nation lack access to running water.",
    "In southwestern Arizona, where the Sonoran and Mojave deserts meet, the river gently makes its way through Aha Makhav lands.",
    "But, by the late 2000s, the Ten Tribes Partnership was mostly limited to sharing information internally between the tribes.",
    "The association offered each basin state three seats on its board of trustees, but gave tribes just a single one.",
    "Modern water policy sits on a 200-year-old foundation of laws written and executed by non-Indigenous politicians.",
    "The project was ultimately never finished, a recurrent theme when it comes to Indigenous water infrastructure.",
    "In effect, it meant that tribes were not subject to the “use or lose it” policy that defined state water law.",
    "U.S. water policy, like the reservation system, was crafted to eradicate Indigenous ways of life and people.",
    "“These valleys have always been traditional lands to us,” Amelia Flores, CRIT’s chairwoman, said in January.",
    "“Our whole infrastructure has been put together haphazardly.”\nThis story is echoed up and down the river.",
    "The Winters doctrine, which became law in 1908, confirmed the seniority of Indigenous water rights.",
    "Today, the reservation’s green, lush farmland stands out against the dry desert that surrounds it.",
    "So the Partnership undertook its own water study to ensure that the tribes’ perspective was heard.",
    "Partnership ‘a plus’\nFlores, CRIT’s chairwoman, called the Partnership “a plus” for the nation.",
    "This led Indigenous nations, including the Colorado River Indian Tribes, to take them to court.",
    "The confrontation paid off in the short term, earning them membership and three board seats.",
    "(Unsurprisingly, the federal government also got to determine what qualified as necessary.)",
    "Instead, they had to save it for what the federal government considered a necessary use.",
    "She is Haltsooí (Meadow People), born for Kinyaa’áanii (Towering House People).",
    "Securing water rights is about the future — of both the tribes and the river.",
    "“It is very secure, in that the Supreme Court has already acted,” he said.",
    "Our needs, our water needs, or our water situations — we’re all different.",
    "The Colorado River Indian Tribes are currently working with Arizona Sens.",
    "“As a collaboration, a partnership, our voice is stronger,” Flores said.",
    "“That was a really, really big deal back in that time,” Vigil said.",
    "“The river has taken care of us for many, many years,” Flores said.",
    "A limited victory\nThe Supreme Court’s action was a limited victory.",
    "It is the giver of life, flowing from one generation to the next.",
    "We don’t have the full rights to our water,” Flores said.",
    "In 1996, the Partnership applied for membership.",
    "Once again, Indigenous nations were left out.",
    "“We all come from different reservations.",
    "Its usefulness lies in its permanence.",
    "Related"
  ]
}