{
  "id": 12459,
  "mediaId": 2646,
  "date": "2022-03-26",
  "headline": "WAR PROFITEER: Marjorie Taylor Greene invests in weapons manufacturers days before Russia’s invasion",
  "image": "https://occupydemocrats.com/wp-content/uploads/XX-MG-FREEZE-MARJORIE-TAYLOR-GREENE.jpeg",
  "link": "https://occupydemocrats.com/2022/03/26/war-profiteer-marjorie-taylor-greene-invests-in-weapons-manufacturers-days-before-russias-invasion/",
  "mediaOutlet": "occupydemocrats.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thomas Kennedy",
  "authorUrl": "https://occupydemocrats.com/author/thomaskennedy/",
  "termIds": [
    0
  ],
  "sentences": [
    "The corrupt influence of money in our politics is already too high, and — while it’s illegal for members of Congress to trade stock based on information that isn’t available to the public, as that would constitute insider trading — the information that federal lawmakers can access makes the practice all too common.",
    "From the defense manufacturers to buy/sell decisions on how war and rumors of war affect the market to the foreign countries that our corporations send our American jobs based on allies & enemies, it’s all business.”\nWeapons manufacturers are not the only industry that Greene invested in.",
    "“Tragically, America’s foreign policy strategy over the past 20 years has been more for corporate profit and not for America’s security and our own national interest,” she wrote without seeming to reflect on her own profiting of the military-industrial complex.",
    "Advertisement Above\nRepublican Representative Marjorie Taylor Greene of Georgia and at least eighteen other members of Congress are making a pretty penny off of the war in Ukraine after investing in defense contractors Raytheon and Lockheed.",
    "Sponsored Links\nRepublican John Rutherford of Florida sits on the House Appropriations Committee that’s in charge of federal government spending and in that role he serves on the subcommittee for Homeland Security.",
    "Oil companies have been using Russia’s invasion of Ukraine as an excuse to expand oil and gas exploration in the U.S. and are also using the conflict to price gouge and jack up prices at the pump for consumers.",
    "Sponsored Links\nThere is growing pressure to ban members of Congress from trading stocks and Democrats Jon Ossoff of Georgia and Mark Kelly of Arizona have introduced a bill in the Senate to ban the practice.",
    "Javelin and Stinger missiles, among other military aid sent by the U.S. and NATO members to Ukraine, are made by both of those companies and their stock has risen since the outset of the conflict.",
    "Despite this seeming conflict of interest, Rutherford thought it was appropriate to purchase $1,001 and $15,000 of Raytheon stock on February 24th, the day Russia invaded Ukraine.",
    "Two high-profile Democrats, John Hickenlooper of Colorado and Sheldon Whitehouse of Rhode Island, held thousands of dollars worth of Raytheon and Lockheed Martin stock.",
    "Marjorie Taylor Greene is an easy and righteous target due to her in-your-face hypocrisy, but her example is just scratching the surface.",
    "Representative Ilhan Omar of Minnesota was quick to highlight Greene’s hypocritical grandstanding about war profiteering.",
    "On February 22nd, two days before Russia’s invasion, Greene bought between $1,001 and $15,000 in Lockheed Martin shares.",
    "She also bought between $1,000 and $15,000 worth of stock in Chevron and NextEra Energy, a utility and energy company.",
    "The profiteering by the same energy companies that Green invested in seems to either be lost or ignored by her.",
    "Congressional stock trading is a systemic issue fostering corruption at the highest levels of government.",
    "“Add this to the list of why members of Congress should never be allowed to trade stocks,” Omar said.",
    "Add this to the list of why members of Congress should never be allowed to trade stocks.",
    "Thomas Kennedy is an elected Democratic National Committee member representing Florida.",
    "Greene’s display of either evil cynicism or idiotic lack of self-awareness continued.",
    "Sponsored Links\nIt wasn’t just Republicans that decided to profiteer off of this war.",
    "https://t.co/EIvACohYeE\n— Ilhan Omar (@IlhanMN) March 7, 2022\nOmar is right.",
    "Add your name to call on prosecutors to ARREST DONALD TRUMP for his crimes!",
    "Two days later, she tweeted, “war is big business to our leaders.",
    "It needs to be banned immediately.",
    "He tweets from @tomaskenn.",
    "Advertisements"
  ]
}