{
  "id": 1290,
  "mediaId": 6511,
  "date": "2022-02-16",
  "headline": "Bernie Sanders afirma que los altos costos de la gasolina tienen que ver con “la especulación y codicia corporativa”",
  "image": "https://laopinion.com/wp-content/uploads/sites/3/2020/11/GettyImages-1281689664.jpg?quality=80&strip=all&w=1200",
  "link": "https://laopinion.com/2022/02/16/bernie-sanders-afirma-que-los-altos-cosos-de-la-gasolina-tienen-que-ver-con-la-especulacion-y-codicia-corporativa/",
  "mediaOutlet": "LA OPINIÓN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "https://t.co/3gVfPMrMzW\n— ABC7 Eyewitness News (@ABC7) February 13, 2022\nLa disparidad de los precios y su clara tendencia al alza en todo Estados Unidos, ha llevado a que algunos senadores demócratas a proponer eliminar temporalmente el impuesto federal a la gasolina para tratar de nivelar los incrementos que se están dando.",
    "Foto: Jemal Countess / Getty Images\nEl senador Bernie Sanders afirmó que el aumento de los precios de la gasolina no es consecuencia de la inflación, sino de la especulación corporativa y la codicia de las empresas para que los costos de los combustibles estén demasiado altos.",
    "Mark Kelly y Maggie Hassan son los legisladores que impulsan la medida, la cual de aprobarse se aplicaría para el resto del año, con validez hasta hasta el 1 de enero del 2023.El impuesto representa 18.4 centavos de dólar por galón desde 1993.",
    "De acuerdo con la American Automobile Association (AAA), a lo largo de la semana pasada, los precios de los combustibles subieron cuatro centavos de dólar, representando un precio promedio de casi $3.50 dóalres por galón en todo el país.",
    "“La gente está sintiendo una verdadera presión sobre los bienes cotidianos, y debemos hacer más para ayudar a abordar los costos crecientes, particularmente el precio de la gasolina”, dijo Hassan en un comunicado.",
    "— Bernie Sanders (@SenSanders) February 16, 2022\nLos dichos del senador independiente cobran sentido, ya que los precios de la gasolina ya han subido casi un 40% en comparación con el mísmo lapso del año pasado.",
    "La AAA indicó que en algunos estados se han enfrentado a aumentos aún mayores, con algunos conductores en Nuevo México pagando hasta 18 centavos más en el surtidor durante la semana pasada.",
    "El legislador independiente no dudó en decir que compañías energéticas como Exxon Mobil, Chevron, Shell & BP obtuvieron casi $25 mil millones de dólares en ganancias el último trimestre.",
    "The average price of a gallon of self-serve regular gasoline in L.A. County rose four-tenths of a cent Saturday to $4.75, a record high for the eighth time in the last nine days.",
    "Gas prices are at the highest level in 7 years while Exxon Mobil, Chevron, Shell & BP made nearly $25 billion in profits last quarter – the highest level in over 7 years.",
    "Apenas el pasado sábado, en el Condado de Los Ángeles, el precio subió 4 décimas de centavo y se situó en $4.754 dólares por galón.",
    "Sanders expresó por medio de su cuenta de Twitter que los precios de la gasolina están en el nivel más alto en 7 años.",
    "Quizá, uno de los estados del país que ha tenido que batallar con las continuas alzas de las gasolinas es California.",
    "También te puede interesar: Precio de la gasolina alcanzó niveles récord en los condados de Los Ángeles y Orange",
    "La propuesta ya fue firmada por otros cuatro demócratas y se espera que tenga eco en toda la bancada.",
    "Indicó que gracias a ello las grandes compañías obtuvieron generosas ganancias por las alzas.",
    "The problem is corporate greed, collusion & profiteering.",
    "Preció que está por encima del promedio nacional.",
    "The problem is not inflation.",
    "Shock.",
    "Shock.",
    "Shock."
  ]
}