{
  "id": 1323,
  "mediaId": 6746,
  "date": "2022-02-14",
  "headline": "McConnell, Trump Butt Heads as Minority Leader Plans To Block Former President's Primaries",
  "image": "https://1075914428.rsc.cdn77.org/data/images/full/269011/mcconnell-trump-butt-heads-as-minority-leader-plans-to-block-former-presidents-primaries.jpg",
  "link": "https://www.hngn.com/articles/240578/20220214/mitch-mcconnell-donald-trump-minority-leader-block-former-president-primaries.htm",
  "mediaOutlet": "hngn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Renz Soliman",
  "authorUrl": "https://www.hngn.com/reporters/renz-soliman",
  "termIds": [
    0
  ],
  "sentences": [
    "One instance seen last year was when Sen. Lindsey Graham said that he wanted to leverage Trump's influence to ensure that the right takes back the majority of the House and Senate in 2022.\nBusiness Insider reported that Graham suggested in December that the former president will continue to shape the political sphere and noted that party leaders will find a way to work with the Republican businessman to avoid being ostracized.",
    "Read Also: Donald Trump-Stormy Daniels Issue: Secret Service Agent \"Not Pleased\" After Ex-POTUS Used Phone To Call Melania Trump\nDespite Trump vacating the presidential office last January, he has still maintained a tight grip on the GOP and several of its members.",
    "Divide Within the GOP\nThe divide within the GOP has grown largely due after the Republican National Committee (RNC) voted to censure two House Republicans who are members of the House Select Committee: Liz Cheney of Wyoming and Adam Kinzinger of Illinois.",
    "Danielle Alvarez released a statement saying that, outside of the D.C. bubble, there was much support for the decision to hold Cheney and Kinzinger accountable for their actions, the Washington Post reported.",
    "Trump also repeatedly made statements about election fraud a day after an RNC spokeswoman appeared to suggest that the party's own elected officials were out of touch with Republican voters.",
    "Senate Minority Leader Mitch McConnell is butting heads with former United States President Donald Trump with his plans to retake the Senate and block the Republican businessman's primaries.",
    "Bush encouraged Ducey to run against Sen. Mark Kelly, a Democrat, and suggested that the Republican Party needed to have more people like the Arizona governor to step forward.",
    "The Republican businessman argued that the Senate Minority Leader did nothing to fight for his constituents and prevent the country's most fraudulent election in history.",
    "The South Carolina lawmaker said that any Republican leader in the House or Senate will not be effective unless they had a close relationship with Trump.",
    "In a statement issued through Trump's Save America PAC, the former president said that McConnell's views were not representative of the whole GOP.",
    "Doug Ducey has also been the recipient of criticism from Trump for more than a year after he refused to overturn his state's presidential results.",
    "But the Senate Minority Leader and his allies have been quietly and desperately maneuvering to oppose the former president and his closest allies.",
    "The former president has been elevating a slate of friendly candidates in the 2022 midterm elections, as per the New York Times.",
    "For months, McConnell and his allies have been trying to recruit potential Senate candidates to run against Trump's primaries.",
    "The Senate Minority Leader and his group have made phone calls, meetings, and polling memos to get more allies on their side.",
    "McConnell vs Trump\nMcConnell is joined by a band of anti-Trump Republicans and former United States President George W. Bush.",
    "Related Article: Larry Hogan Criticizes GOP For Being 'Focused on the Wrong Things' After Declining To Run For Senate",
    "The opposition of GOP members comes as Trump is working on maintaining his hold on the Republican Party.",
    "Trump also criticized McConnell, arguing that the Minority Leader did not speak for other GOP members.",
    "The situation comes after McConnell pushed Trump's agenda for years and rarely opposed him in public.",
    "This month, Ducey said that he felt humility, talking about Bush's appeal.",
    "Arizona Gov."
  ]
}