{
  "id": 13389,
  "mediaId": 2658,
  "date": "2022-03-16",
  "headline": "Zelenskyy’s powers of persuasion",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/03/16/zelenskyys-powers-of-persuasion-00017675",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    4739,
    4156,
    4379,
    3480,
    3702,
    1398,
    6672,
    6678
  ],
  "sentences": [
    "Think About It', from HuffPost\nInside Chernobyl, 200 Exhausted Staff Toil Round the Clock at Russian Gunpoint, from The Wall Street Journal\nHouse Democrats Ask Pentagon for Details on Plan to Reduce Civilian Casualties, from The New York Times\nTRANSITIONS\nSusan Allen is returning to the U.S. Patent and Trademark Office after being detailed to work in the office of Sen. Thom Tillis (R-N.C.), the ranking Republican on the Senate Judiciary Subcommittee on Intellectual Property.",
    "“I think it has sometimes gotten him into some political hot water, but the upside of his style is ten-fold more advantageous than the occasional downsides.”\nZelenskyy will both update lawmakers on the Russian invasion of his country and is likely to ask -- once again -- for more assistance from the U.S. Last week Congress approved nearly $14 billion in military and humanitarian aid to Ukraine, but as Russian attacks escalate, Zelenskyy says he needs more.",
    "Covid on Capitol Hill\nSixteen days after lifting the mask mandate in the Capitol, nine Democratic lawmakers have tested positive for Covid: Reps. Jared Golden (Maine), Madeleine Dean (Pa.), Kimberly Schrier (Wash.), Zoe Lofgren (Calif.), Rosa DeLauro (Conn.), Gerry Connolly (Va.), Andy Kim (N.J.), Joe Neguse (Colo.) and Peter Welch (Vt.).",
    "The White House would prefer to not add Gonzalez to the growing pile of troubled nominations, after Federal Reserve board pick Sarah Bloom Raskin withdrew this week in the face of bipartisan opposition and amid Sen. Chuck Grassley’s (R-Iowa) ongoing hold on Los Angeles Mayor Eric Garcetti’s nomination to be U.S. ambassador to India.",
    "QUICK LINKS\nArizona group tightens squeeze on Sinema donors, from Holly Otterbein\nJury selection to begin in Fortenberry trial, from Chris Marquette at CQ Roll Call\nJan. 6 panel obtains riot footage from film crew that trailed Proud Boys, from Kyle\nHerschel Walker Skeptical Of Evolution: 'Why Are There Still Apes?",
    "Zelenskyy’s powers of persuasion\nBy KATHERINE TULLY-MCMANUS\n03/16/2022 07:46 AM EDT\nPresented by\nWith an assist from Andrew Desiderio\nRECOGNIZING THE GENTLEMAN FROM UKRAINE — The United States would like to associate itself with the remarks from the gentleman from Ukraine.",
    "He most recently was special operations coordinator for Rep. Matt Gaetz (R-Fla.), for whom he created and directed the video podcast “Firebrand.” Burra also previously produced Steve Bannon’s “War Room.”\nTODAY IN CONGRESS\nThe House convenes at 10 a.m.",
    "RELATED: Zelenskyy’s pitch to Congress puts more pressure on Biden to expand U.S. role, from Jonathan Lemire, Biden to Announce $1 Billion in New Military Aid to Ukraine, from The Wall Street Journal\nGOOD MORNING!",
    "House and Senate lawmakers will pack into the CVC auditorium this morning for an address from Ukrainian President Volodymyr Zelenskyy, an engagement that the besieged leader personally requested, Andrew reports.",
    "ICE PICK PROVES SLIPPERY — There is a scramble underway to save President Joe Biden’s pick to lead Immigration and Customs Enforcement from another high-profile defeat for the administration.",
    "11 a.m. Speaker Nancy Pelosi (D-Calif.) and the Congressional Asian Pacific American Caucus will hold an event to mark the one-year anniversary since the Atlanta spa shooting.",
    "At least three Senate Democrats are undecided on Ed Gonzalez, who was accused of domestic abuse against his wife in a 2021 police affidavit, though both deny the allegations.",
    "Joe Manchin (D-W.Va.) and Mark Kelly (D-Ariz.) said Tuesday they are undecided on Gonzalez and planned to spend more time reviewing the allegations against him.",
    "HUDDLE HOTDISH\nGimme those greens… The salad bar is back at the House side’s Capitol Carryout after a two year hiatus that began at the start of the pandemic.",
    "TRIVIA\nTUESDAY’S WINNER:Mike Dunn correctly answered that during the State of the Union, President Biden mentioned a goal to cap the price for insulin at $35.",
    "But Zelenskyy’s pleas for Western allies to “please close the sky” above Ukraine have gone unanswered as the U.S. and others fear an escalation with Russia.",
    "10:15 a.m. House Democratic Caucus Chair Hakeem Jeffries (D-N.Y.) and Vice Chair Pete Aguilar (D-Calif.) will hold their weekly news conference (Studio A).",
    "A floor vote slated for last week was delayed at the request of Senate Democrats who asked their party leaders for more time to examine the allegations.",
    "“You all need to do more to stop Russia, to protect Ukraine, and by doing that, to protect Europe from Russian threats,” Zelenskyy said in that address.",
    "Frozen Yogurt is set to return to Inside Scoop in Dirksen on March 21 with five classic flavors: chocolate, vanilla, strawberry, tart and coconut.",
    "The comedian-turned-wartime-president has wooed American politicians (and much of the public) with his bravery, charisma and straight talk.",
    "He has used his considerable powers of persuasion to influence U.S. lawmakers to approve both armaments and humanitarian aid for Ukraine.",
    "WARNING: LOW CLEARANCE— Because there’s some confusion floating around… reminder that members of Congress don’t have security clearances.",
    "Before placing the blame on the caucus retreat in Philadelphia last week, Sarah and Nancy point out that not all of them were even there.",
    "The chamber passed, by unanimous consent, a bill to lock American’s clocks on daylight saving time and ditch standard time entirely.",
    "Photo of the day… From unofficial Senate photographer Sen. Patrick Leahy (D-Vt.), with a unique angle at the White House on Tuesday.",
    "The Senate convenes at 10:30 a.m.\nAROUND THE HILL\n9 a.m. Ukrainian President Volodymyr Zelenskyy will speak to members of Congress.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Wednesday, March 16, where all eyes are on Zelenskyy.",
    "But don’t get ahead of yourself: the House hasn’t acted yet and the Senate’s bill wouldn’t implement the shift until Nov. 2023.",
    "Andrew will be in the room with members as they hear the latest from Ukraine and weigh what more they are willing to provide.",
    "A spokesperson for Sen. Catherine Cortez Masto (D-Nev.) said she supports the Homeland Security Committee taking more time.",
    "Of course opposition already toppled Neera Tanden as Biden’s budget director and ATF director hopeful David Chipman.",
    "They have access to classified and sensitive information simply because they are elected to the House and Senate.",
    "On Tuesday he reiterated calls for NATO to enforce a no-fly zone over Ukraine in a speech to Canada’s parliament.",
    "“He shoots from the hip, and that’s part of his charm,” said Sen. Chris Murphy (D-Conn.), who, along with Sen.",
    "Vish Burra is joining Logan Circle Group as executive producer as it expands its podcasting portfolio.",
    "Noon Portman and other Senate Republicans will hold a news conference on Ukraine (Senate TV Studio).",
    "Rob Portman (R-Ohio), has had more direct face time with Zelenskyy than any American official.",
    "TODAY’S QUESTION: On May 28, 1954, this foreign leader addressed a joint Meeting of Congress.",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "“They are destroying everything.”\nStay tuned for more on Zelenskyy’s address.",
    "There’s a whole CRS report on this, read up before getting in front of a mic.",
    "Peter-Anthony Pappas will be the USPTO’s new detailee in Tillis’ office.",
    "H/T Suzanne Youngblood Lane, who gave everyone the scoop on Twitter.",
    "Marianne and Burgess have more on the confirmation calculation.",
    "Anthony, Burgess and Sarah have the House prospects and more.",
    "Walking on sunshine (woah, oh): Sen. Ed Markey (D-Mass.)",
    "For “a limited time” the price will be $0.57 per ounce.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "His speech this morning is expected to be emotional.",
    "But it doesn’t mean it’ll give him what he wants.",
    "GET HUDDLE emailed to your phone each morning.",
    "But like everything else, expect price hikes.",
    "SUNNY SIDE UP— It was a Senate surprise.",
    "The Capitol testing site is still open.",
    "Send your answers to ktm@politico.com.",
    "The breakfast bar has also returned.",
    "Scoops on scoops… at Inside Scoop.",
    "posted a celebratory video.",
    "(House East Front Steps).",
    "Better safe than sorry.",
    "(CVC Auditorium).",
    "Sens."
  ]
}