{
  "id": 13443,
  "mediaId": 2540,
  "date": "2022-03-15",
  "headline": "Senate votes to repeal travel mask mandates in bipartisan rebuke of Biden administration policy",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/180715110631-rand-paul-file.jpg?q=x_4,y_184,h_2027,w_3603,c_crop/w_800",
  "link": "https://www.cnn.com/2022/03/15/politics/senate-mask-mandate-vote/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ali Zaslav",
  "authorUrl": "https://www.cnn.com/profiles/ali-zaslav",
  "termIds": [
    1973,
    2020,
    5583,
    5168,
    4905,
    1489,
    1126,
    1477
  ],
  "sentences": [
    "The Democrats who voted to rid of the mask mandate are: the senators from Nevada, Jacky Rosen and Catherine Cortez Masto; the senators from Arizona, Mark Kelly and Kyrsten Sinema; Michael Bennet of Colorado, Joe Manchin of West Virginia, Maggie Hassan of New Hampshire and Jon Tester of Montana.",
    "Ahead of the vote, Democratic Sen. Tim Kaine of Virginia urged his colleagues not to back Paul's resolution, arguing the federal travel mask mandate is set to expire next month and Congress should allow the Centers for Disease Control and Prevention time to come up with new guidance.",
    "But the same bureaucrats continue to defy science by imposing an ineffective and restrictive mask mandate for individuals traveling on public transit and airplanes,\" said Paul, who is also an ophthalmologist, in a recent statement on his plans to force a vote on the resolution.",
    "\"As the entire world is learning to live with COVID, the federal government still uses fear mongering to stubbornly perpetuate its mandates, rather than giving clear-eyed, rational advice on how to best protect yourself from illness.\"",
    "\"When the rules of government do not comply with common sense, it offends free Americans to have to abide by some silly rule and you can expect the objections we're hearing from the public,\" he said at a news conference.",
    "Sen. Roger Wicker of Mississippi, the ranking GOP member of the Senate Commerce Committee, added on Tuesday that Republicans are making this \"common-sense request of the administration on behalf of the American people.\"",
    "(CNN)The Senate on Tuesday passed a resolution from Republican Sen. Rand Paul of Kentucky to repeal the federal travel mask mandates on public transportation, in a bipartisan rebuke to the Biden administration's policy.",
    "The act allows senators to overturn federal agencies' regulations within a certain time frame and can do it by a majority threshold without having to clear the typical 60 votes to overcome a legislative filibuster.",
    "Paul, who sits on the Senate Health Committee, has been one of the loudest and strongest GOP opponents of mask-wearing and has not often been seen by CNN wearing a mask throughout the pandemic.",
    "The extension comes while many mask mandates have been rescinded in states and schools across the nation as coronavirus cases have plummeted since the Omicron surge earlier this year.",
    "The move also comes as Republicans have kept pressure on the White House and congressional Democrats to ease various federal requirements designed to combat Covid-19.",
    "Facial coverings, however, have been one of the most effective public health measures to prevent transmission of the coronavirus, according to experts.",
    "Despite the resolution succeeding in the Senate, it is unlikely to move in the Democratic-led House and would likely be opposed by President Joe Biden.",
    "Earlier this month, the Biden administration announced it would extend the federal public transportation mask mandate through April 18.",
    "That would be much better for public health and much better for our economy,\" Kaine said in remarks on the Senate floor.",
    "\"Since March 2020, unelected bureaucrats have incessantly declared that we should 'follow the science.'",
    "\"Instead, let's work with the CDC and see what guidance they come up with for this April 18 deadline.",
    "Last year, the Senate approved a resolution to block Biden's vaccine mandate on private employers.",
    "This is not the first Congressional Review Act resolution the Senate has taken up this Congress.",
    "The final vote was 57-40, with eight Democrats joining Republicans in favor of the resolution.",
    "The White House had issued a veto threat against the proposal earlier Tuesday.",
    "Paul forced a vote on his resolution using the Congressional Review Act.",
    "One GOP senator voted against the measure: Mitt Romney of Utah.",
    "CNN's Gregory Wallace contributed to this report."
  ]
}