{
  "id": 13586,
  "mediaId": 2606,
  "date": "2022-03-18",
  "headline": "PARTY LINES: No ‘re-election,’ no convention and no to travel mask mandates!",
  "image": "https://www.reviewjournal.com/wp-content/uploads/2022/03/16271686_web1_DSCF8300-1.jpg",
  "link": "https://www.reviewjournal.com/news/politics-and-government/nevada/party-lines-no-re-election-no-convention-and-no-to-travel-mask-mandates-2547730/",
  "mediaOutlet": "Las Vegas Review-Journal ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Quote of the week: “I think we are at a time in U.S. history and world history of losing any ability as a civilization to distinguish between truth and falsity.” — Rodney Smolla, a lawyer for Dominion Voting Systems, suing Fox News and others for promoting conspiracy theories about a stolen election, quoted in The New York Times.",
    "Given the bipartisan support in the Senate — and the twice-annual complaining that comes from pretty much everybody at this time of year about needing to switch every clock, watch or other timepiece not connected to an automatic server — the chances are good that public sentiment is with passage.",
    "Back in January, Las Vegas Convention and Visitors Authority spokeswoman Lori Kraft said, “We had discussions with venues of scale and scope that would be in the position to host the convention and the commitment needed to host the convention does not work for Las Vegas.”\nBoo.",
    "And he’s right: NRS 294A.330 clearly says candidates can’t say “re-elect” in any material, statement or publication unless they’ve previously been elected to that office and have served continuously in that office since the start of the term.",
    "Las Vegas Councilwoman Michele Fiore surprised everybody by abandoning the race for governor (15 Republican candidates, at last count) and switching to the much cozier race for state treasurer (two Republican candidates, including Fiore).",
    "So, technically, she’s running for “election,” not “re-election.” And while some might quibble that it’s a technical point, eagle-eyed former Legislative Counsel Bureau Director Lorne Malkiewich pointed out it’s also the law.",
    "The problem, as Kraft indicated, is that whichever venue is selected — and its environs — would have to be secured for at least a couple of weeks before the event, which means those spots would be dark.",
    "We have more hotel rooms on a single intersection than most cities have in total, and delegations would not have to travel from far-distant suburbs just to get to the convention site.",
    "Republican Kentucky U.S. Sen. Rand Paul is not the kind of guy you’d expect to be on the same side as Nevada’s Democratic Senate dynamic duo, Catherine Cortez Masto and Jacky Rosen.",
    "No word about how we’ll remind people to change the batteries in their smoke detectors, but don’t worry, they’ll alert you themselves and almost always at 4 a.m.",
    "They were joined by Democrats including Michael Bennet, D-Colo.; Maggie Hassan, D-N.H.; Mark Kelly, D-Ariz.; Joe Manchin, D-W.Va.; and Jon Tester, D-Mont.",
    "And there’s nothing modern Las Vegas hates more than usable, moneymaking space going dark, as all of us who now pay for casino parking know full well.",
    ": The Republican National Committee has eliminated Salt Lake City from its potential 2024 convention sites, and narrowed the field down to two.",
    "The bill now goes to the House, where there’s some debate about whether to keep standard time or daylight saving time as the nation’s default.",
    "Lisa Cano Burkhead stumbled a bit out of the gate, issuing a news release that announced her intention to file for “re-election” on Tuesday.",
    "But what about that wonderful ad showing Fiore driving her pickup into the desert to shoot beer bottles labeled with liberal slogans?",
    "We worked together on the (immigration related) 287(g) program, where he advised me when it came to common sense background checks.",
    "Even though Las Vegas Mayor Carolyn Goodman invited the party to take a look, the RNC never got an application from our fair city.",
    "But with a general election just more than seven months away, it’s never too early to start taking attack lines off the table.",
    "Under a bill quickly approved by the Senate, we’d simply use daylight saving time year-round, and leave the clocks alone.",
    "Or maybe they could use a little CGI to re-label those bottles with “high interest rates” and “unclaimed property”?",
    "On the GOP side, every senator voting said “aye” with the exception of Mitt Romney of Utah, according to Politico.",
    "Yet there they were, voting aye (by voice vote) to end the biannual clock switching that is daylight saving time.",
    "Meanwhile, those lazy folks who never bother to change their clocks at all are thinking, “What’s the big deal?",
    "We now have multiple venues, too: Allegiant Stadium, T-Mobile Arena and the newly expanded convention center.",
    "Steve Sisolak, responding to Lombardo’s criticism that the governor lacks leadership, vision or direction.",
    ": When is the last time the U.S. Senate agreed unanimously about anything (except maybe adjournment)?",
    "But Politico caught on to a largely symbolic vote that has outsize importance in this election year.",
    "The vote was symbolic, inasmuch as the mask mandate was already ending in the middle of next month.",
    "Las Vegas has never hosted a political convention, and this city could do it better than any other.",
    "Cortez Masto and Rosen voted for a Paul-sponsored bill that repeals federal travel mask mandates.",
    "He’s cooperated and helped me along my political campaigns, and I’ve appreciated that.” — Gov.",
    "It’s been a busy week in Nevada politics, as the second week of filing winds to a close.",
    "Even better quote of the week: “I’ve known (Sheriff) Joe (Lombardo) for a long time.",
    "Clearly, Burkhead has not, so “re-elect” is both technically and legally incorrect.",
    "Perhaps we can’t really blame them, since Las Vegas was not really in the running.",
    "I’ve known (former U.S. Sen.) Dean (Heller) and (North Las Vegas Mayor) John Lee.",
    "But there’s only one problem: She was never “elected” in the first place.",
    "(The bill will be debated in the House Energy and Commerce Committee.)",
    "Certainly better than — no offense — Nashville or Milwaukee!",
    "So he was on my transition committee to become governor.",
    "It would be a shame to let that footage go to waste.",
    "Steve Sisolak appointed her to the post on Dec. 16.",
    "Las Vegas is the perfect city for the conventions.",
    "The lucky two: Nashville or Milwaukee.",
    "I did this years ago!”\nWe wuz robbed!",
    "I’ve known a lot of these candidates.",
    "Joe was a contributor in my campaign.",
    ": At least not in an election year.",
    "Is that destined for the scrapheap?",
    "Who says bipartisanship is dead?",
    "He was an early supporter.",
    "What even is time anyway?",
    "Seriously, Republicans?",
    "So Joe knows me well.",
    "Raised money for me.",
    ": Appointed Lt. Gov.",
    "It’s too bad, too.",
    "Breaking the law?",
    "Already?",
    "Gov."
  ]
}