{
  "id": 13635,
  "mediaId": 2745,
  "date": "2022-03-18",
  "headline": "Biden’s chance to tackle climate change is fading amid global energy upheaval",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NV7GJSFGMEI6ZBRIHWSPVD4HCQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/climate-environment/2022/03/18/russian-energy-ukraine-climate-change/?utm_source=rss&utm_medium=referral&utm_campaign=wp_climate-environment",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5510,
    3200,
    4145,
    4659,
    4905
  ],
  "sentences": [
    "At a House Republican forum on Friday titled “Pain at the Pump: Biden’s War on American Energy,” Kathleen Sgamma, the president of the Western Energy Alliance, accused the administration of unleashing “numerous anti-American energy policies that have contributed significantly to high energy prices.”\nExperts say there’s little evidence that the Biden administration’s policies have directly affected oil production, which mostly takes place on private and state-owned land.",
    "Peter Davidson, who ran the Energy Department’s loan programs office during the Obama administration and now serves as CEO of Aligned Climate Capital, a clean energy investment firm, said the war in Ukraine and global energy shortages have boosted the attractiveness of domestic power generation from solar, wind and other clean sources that can’t be brought down by a hostile foreign country.",
    "The government shouldn’t be choosing winners and losers by giving tax breaks to the oil industry that it doesn’t extend to renewables.”\nThe consequences of delayed legislative action are already being felt by clean energy companies, which have to decide whether to launch new solar and wind projects without knowing if Congress will extend the tax credits.",
    "But that’s not going to be a real solution if we don’t come up with long-term solutions.”\nSustained opposition by Sen. Joe Manchin III (D-W.Va.) has bogged down a bill that includes about $300 billion of tax credits for wind, solar and nuclear energy producers and other incentives to boost the clean hydrogen and battery storage industries.",
    "But while 2021 was the second-biggest growth year for combined wind, solar and energy storage installations in the United States, the nearly 28 gigawatts of new clean energy amounted to only 45 percent of what the trade group said is needed to stay on track to reach Biden’s goal of achieving a carbon-free power sector by 2035.",
    "The list included ending subsidies for fossil fuels and declaring a “national climate emergency.”\n“It is a myth you could drill and suddenly lower oil prices,” said Rep. Pramila Jayapal (D-Wash.), the caucus’s leader, adding that climate investments would instead “show the world that is the direction we need to move.”",
    "“That’s going to be very hard to make happen if you don’t have an agreement among the American people that addressing climate change is an urgent priority.”\nInstead, politicians are working to make gasoline cheaper, even as the transportation sector now accounts for the largest share of U.S. greenhouse gas emissions.",
    "But congressional Democrats are struggling to revive the climate provisions of their roughly $2 trillion package formerly known as the Build Back Better Act, as their focus has shifted in recent days to bills that narrowly aim to respond to the rising cost of gasoline and diesel fuel.",
    "Rising gasoline prices have created a dilemma for the Biden administration, which is being pushed by climate advocates to embrace a rapid transition to clean energy as the answer to the country’s energy crunch, and by oil and gas trade groups to open more federal land to drilling.",
    "Sheldon Kimber, a founder and the chief executive of Intersect Power, a San Francisco-based clean energy company, said he has four projects in development in Oklahoma and Texas that would use electricity generated from solar panels and wind turbines to produce hydrogen.",
    "Rising natural gas prices, which the Energy Information Administration has estimated could reach an eight-year high in the United States this year, could help wind and solar energy expand because they rank as the cheapest sources of electricity in most markets.",
    "After losing money over the past decade of boom-and-bust cycles in the oil and gas industry and, more recently, watching American and German leaders halt the Keystone XL and Nord Stream 2 pipelines, banks and investors’ enthusiasm for fossil fuels has dipped.",
    "— who oversee key tax, education, and health and environment committees — each tried to engage Manchin in formal, detailed negotiations, according to two people familiar with the matter who spoke on the condition of anonymity to describe the private outreach.",
    "“That really is the difference between whether we pass these credits now or wait.”\nThe Rhodium Group projects that if the clean energy tax incentives are passed, 31 to 65 gigawatts of renewable energy will be built per year between now and 2030.",
    "The Interior Department announced Friday that it is restarting new federal oil and gas leasing, after a federal appellate court stayed a ruling that blocked the government from factoring the cost of climate change into its decisions.",
    "Bordoff cited political divisions in Washington and across the nation that he said have made it impossible for all 50 members of the Senate Democratic caucus and even a single Senate Republican to support major climate legislation.",
    "Some have said there may be an opportunity this spring, after a confirmation vote on Biden’s Supreme Court nominee, to press for a single piece of legislation that could pass the 50-50 Senate by way of the reconciliation process.",
    "As the war in Ukraine has raised oil prices and launched Western leaders on a global hunt for new sources of energy, environmentalists have tried to leverage the chaos in energy markets to move the United States off fossil fuels.",
    "Experts say that for the United States to supercharge renewable power, lawmakers have to lower the upfront costs of building wind turbines, solar arrays and energy battery storage through federal tax breaks and other incentives.",
    "But there’s a problem: Despite major advancements in wind and solar power — and renewed investor enthusiasm — Democrats, who narrowly control Congress, have yet to devise a legislative strategy that could accelerate this shift.",
    "Without changes in federal policy, oil and gas will still be the leading sources of U.S. energy in 2050 — the same year by which scientists have said humans must reach net zero emissions and stop fueling climate change.",
    "He has indicated that he could support a scaled-back measure that includes several clean energy provisions, as well as ones to lower prescription drug prices, make changes to the tax code and reduce the deficit.",
    "Without a strategy to pass climate legislation, Democrats have embarked on a new messaging campaign to rebrand their economic agenda as an effort to save Americans’ money, lower the deficit and fight inflation.",
    "According to the National Conference of State Legislatures, lawmakers in at least 18 states have introduced or discussed legislation to temporarily suspend state gas taxes, or reduce or freeze them.",
    "The legislative push, which coincides with a separate, nascent effort to penalize oil giants that gouge customers with high prices, could mark a new wave of scrutiny targeting the energy sector.",
    "“There’s just a massive gap now from where we need to be and the trajectory we’re heading down,” said Jason Bordoff, the founder and director of Columbia University’s global energy institute.",
    "On Thursday, the left-leaning Congressional Progressive Caucus issued a litany of recommendations for Biden to act unilaterally, stressing that the country no longer can wait on Congress.",
    "According to the American Clean Power Association, a trade group for renewable energy companies, there is now enough clean energy capacity in the United States to power 56 million homes.",
    "But Clark Williams-Derry, an analyst with the Institute for Energy Economics and Financial Analysis, warned that costlier natural gas also could threaten renewables’ growth.",
    "But at an energy conference last week, he attacked a key piece of the administration’s climate strategy, saying he was “very reluctant” to see the growth in electric cars.",
    "Clean sources of electricity have made significant strides even during the coronavirus pandemic, when energy demand shrank and U.S. oil and gas companies cut production.",
    "Without them, Kimber said, he could be limited to a smaller pool of customers willing to pay a green premium for hydrogen that is produced without fossil fuels.",
    "Instead, many utilities have continued to rely on natural gas to provide power when demand surges, or when the sun isn’t shining and the wind isn’t blowing.",
    "Without government subsidies, electric utility companies have been reluctant to invest in battery storage technology, arguing that the costs are too high.",
    "And without major climate legislation soon, President Biden is likely to lose his opportunity to transform the nation’s energy mix during his first term.",
    "Aware that they are running short of time to bring a climate bill to a vote before the 2022 midterm elections, Democrats say they have not lost hope.",
    "Another 11 gigawatts’ worth of clean energy projects that were supposed to come online last year ran into regulatory, financial and supply delays.",
    "“I worry all the time we’re going to miss this moment to take bold action on climate,” Sen. Tina Smith (D-Minn.) said in an interview Thursday.",
    "Smith said she still thinks the clean energy tax credits and other climate provisions in the act remain broadly popular among Democrats.",
    "A report published last month by the U.S. Energy Information Association offered a sobering look at the country’s energy transition.",
    "Mark Kelly (D-Ariz.) and Maggie Hassan (D-N.H.), proposed a bill last month that would suspend the federal gas tax until January.",
    "Those climate-conscious buyers exist, Kimber said, but not at the scale that would speed the adoption of renewable energy.",
    "Supporters of the zero-emission fuel argue that it could hold the key to powering airplanes, ships, trains and trucks.",
    "Without the incentives, current estimates suggest the industry will grow at a rate of only 9 to 20 gigawatts a year.",
    "But Manchin wouldn’t engage, they said: His focus remained fixed on other fiscal matters and on curbing inflation.",
    "But she said there have only been “casual conversations” between lawmakers and Manchin on the sticking points.",
    "The United States is poised to see “massive investment in batteries and storage technology,” Davidson said.",
    "“Do we want to create a clean energy economy that insulates us from global energy price shocks in 15 years?",
    "“Fundamentally, we need investments in technology to lower the costs of clean energy solutions,” he said.",
    "Last year, natural gas accounted for about 40 percent of electricity generation in the United States.",
    "If utilities spend more of their money on natural gas, their investments in clean energy could sag.",
    "Oil and gas industry groups now openly complain that Wall Street is wary of backing their projects.",
    "“Taking steps right now to lower energy prices for Americans … I think is a good thing.",
    "The company launched its hydrogen projects expecting to receive federal tax credits.",
    "Some governors have called on Congress to suspend the federal gas tax.",
    "Ron Wyden (Ore.), Patty Murray (Wash.) and Thomas R. Carper (Del.)",
    "Environmentalists say they do have reason for optimism.",
    "Two lawmakers facing tough reelection fights, Sens.",
    "“There isn’t any organized negotiation,” she said.",
    "Manchin remains a holdout on a broader bill.",
    "“What we just need is a level playing field.",
    "Renewable energy supplied about 20 percent.",
    "Last month, Democratic Sens.",
    "Or in 30 years?” he said."
  ]
}