{
  "id": 13630,
  "mediaId": 2658,
  "date": "2022-03-21",
  "headline": "Dems begin building a Latino vote firewall in the West",
  "image": "https://static.politico.com/85/49/6d1a41ff416db26e0e8a1e8be097/ap22073709632474.jpg",
  "link": "https://www.politico.com/news/2022/03/21/latino-vote-could-decide-senate-control-00018733",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2459,
    2346,
    6300,
    6667,
    6431
  ],
  "sentences": [
    "Mayra Macias, chief strategy officer of Building Back Together, explained that one of the reasons the group is targeting Arizona and Nevada, as well as other battleground states with large Latino populations, is because “those are states where it’s going to be important for [Biden] to have folks that will back up his agenda.”\nAt the same time, there is a keen awareness of frustrations among some Latino leaders and organizers who argue that the Biden administration hasn’t followed through on all its campaign promises and needs to push harder to get more done this year.",
    "“Both the administration and the party are falling short of delivering on the promises our communities were expecting and that they showed up for [by voting] in the middle of a pandemic,” said Alejandra Gomez, co-executive director of LUCHA, a grassroots organization in Arizona that plans to knock on hundreds of thousands of doors this year.",
    "“These are states where it’s going to be so close — so, losing 2 or 3 percentage points of the Latino vote compared to the last [midterm] election would be devastating for Kelly or Cortez Masto,” said Chuck Rocha, a Democratic strategist and former senior adviser to Sen. Bernie Sanders’ (I-Vt.) presidential campaign.",
    "| Tom R. Smedes/Reno Gazette-Journal via AP\nBy Sabrina Rodriguez\n 03/21/2022 04:30 AM EDT\nUpdated: 03/21/2022 11:28 AM EDT\nThe midterm election is eight months away, yet more than $650,000 has already been spent on Spanish-language TV and radio ads designed to reelect Nevada Sen. Catherine Cortez Masto.",
    "“They’re running Latino-focused events in Nevada right now… They know we’re there and they’re there, too.”\nMorales noted that Somos has gotten funding from donors earlier than ever before, signaling to her that there is a recognition within the party of the importance of courting Latino voters.",
    "In Arizona, Majority Forward, the nonprofit arm of Senate Democrats’ super PAC, has spent more than $1.5 million on Spanish-language television and radios in March alone, according to a spreadsheet created by a leading media buying company and shared with POLITICO by a Democratic consultant.",
    "Rep. Ruben Gallego (D-Ariz.), chair of BOLD PAC, the Congressional Hispanic Caucus’s campaign arm, said the amount spent on Spanish-language ads in Arizona so far is huge, considering that there have been elections when $1.5 million was spent on such ads over the course of an entire year.",
    "Arizona and Nevada stand out as two of only three battleground states — the other is Colorado — that are expected to see significantly increased Hispanic turnout this year, according to projections from the National Association of Latino Elected and Appointed Officials Educational Fund.",
    "They also placed Spanish-language billboards in Arizona touting how Biden, in his first year in office, had invested $2.7 billion in loans for Latino-owned small businesses, child tax credit checks for 17 million Latino children and heath care for 730,000 Latinos.",
    "While Republicans may not be making big buys in Spanish radio or TV, we’re certainly seeing them on the ground,” said Melissa Morales, president of Somos PAC, a Latino voter mobilization organization that targets battleground states.",
    "Still, Latino organizers and leaders in both states emphasize that Republicans are executing their own effort on the ground — and it’s going to take much more than Spanish-language ads to ensure Democratic victories in November.",
    "But the early Democratic spending on Spanish-language ads in the two races represents a marked shift after years of complaints from Latino operatives that the party waits until the last minute to spend on Latino outreach.",
    "A nonprofit founded by Biden allies, Building Back Together, has bolstered Democratic efforts by touting the president’s wins — and the senators who helped make them possible — to Latinos in Arizona and Nevada.",
    "In Nevada, Majority Forward has spent more than $640,000 on Spanish-language TV and radio ads in the Las Vegas and Reno areas this month, in addition to the more than $14,000 spent by Cortez Masto’s campaign.",
    "Rocha called Arizona and Nevada the top two states with sizable Latino populations that will be “crucial for Democrats to keep their majority,” followed by Florida, Georgia, Pennsylvania and Wisconsin.",
    "The National Republican Senatorial Committee has been running Spanish-language TV, radio and digital ads in both states since last year, though Republicans have not spent on those ads this month.",
    "“Not only do Democrats need to get Latinos to perform — they need to overperform if they’re going to win.”\nLatinos have long been regarded as a key constituency for Democrats in both states.",
    "“I want to remind that… this is going to take one-on-one conversations, it’s going to take organizing and it’s going to take reaching people personally where they’re at,” Morales said.",
    "Arizona, where Kelly won his 2020 special election by fewer than 79,000 votes, is home to about 1.2 million eligible Latino voters, who represent one-in-four eligible voters.",
    "The large — and unusually early — expenditures are a sign that Democrats are beginning to take seriously the gains Republicans are making among Latino voters.",
    "Recently, the group ran Spanish-language TV ads exclusively in both states promoting Biden’s role in helping small businesses with loans amid the pandemic.",
    "Yet they’re also a reflection of something else: the key role the two battleground states will play in determining control of the Senate in November.",
    "While she welcomed the ad spending so far, she cautioned that TV and radio ads are not nearly enough to ensure a strong performance in the fall.",
    "Sen. Catherine Cortez Masto speaks during her reelection campaign kick-off event at the IBEW Local 401 office in Reno, Nev., on March 14.",
    "In Nevada, Cortez Masto — the first and only Latina ever elected to the Senate — won her seat in 2016 by fewer than 27,000 votes.",
    "Arizona is expected to see a 9.6 percent increase in Latino voters, while Nevada will see a 5.8 percent jump, compared to 2018.",
    "“I haven’t seen spending from Democrats on Spanish-language ads this early in a Senate race in my entire career,” Rocha said.",
    "In neighboring Arizona, more than twice that amount has been plowed so far into Spanish-language ads backing Sen. Mark Kelly.",
    "The group is spending nearly $1 million in bilingual ads across TV, radio and digital platforms in battleground states.",
    "And the two first-term senators probably can’t win unless Latino voters turn out in strong numbers for them.",
    "Democrats will have a hard time preserving their slim majority if Cortez Masto and Kelly are defeated.",
    "More than 400,000 Latinos are eligible to vote there, making up 20 percent of the state’s total.",
    "Kelly’s campaign also spent almost $28,000 on Spanish-language radio ads in the Tucson market.",
    "“They’re turning out… but we need to give people something to be excited for.”",
    "The ads have largely run across the Phoenix, Tucson and Yuma areas.",
    "“Clearly, lessons have been learned by Democrats,” Gallego said.",
    "“It’s going to be harder than we think it is.",
    "“So, I ask: How bad do Democrats want to win?",
    "Because Latinos are ready,” she added."
  ]
}