{
  "id": 1364,
  "mediaId": 2636,
  "date": "2022-02-15",
  "headline": "Democrats Weigh Gas Tax Holiday and Deficit Cuts as Inflation Mounts",
  "image": "https://static01.nyt.com/images/2022/02/15/multimedia/15dc-cong-schumer/15dc-cong-schumer-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/15/us/politics/democrats-inflation-gas-tax-deficit.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Senator Debbie Stabenow of Michigan, a member of Democratic leadership and a co-sponsor of the gas tax legislation, said, “There’s more to do, and that’s what we’re focused on for the coming year, as it relates to the costs that families are feeling every single day.”\nWhite House officials have also sought to focus attention on a series of actions aimed at reining in prices, including efforts to increase competition in the meatpacking industry, eliminate bottlenecks at ports and address the global shortage of semiconductors, which is driving up the cost of cars.",
    "“I think they realize that they’re on the wrong side of the energy issue and the wrong side of the inflation issue, and that, you know, the American people are going to want answers.”\nIn remarks on Tuesday to the National Association of Counties, Mr. Biden made the case for his broader social spending measure, arguing that providing money for child care, prescription drugs and home health care workers could help bring down costs for millions of Americans.",
    "“We’re sitting down and discussing things with Senator Manchin, and we want to hear what he has to say.”\nWhile they initially aimed for a multitrillion-dollar domestic policy initiative, some Democrats said they would be willing to include deficit-reduction provisions if it meant seeing some of their spending priorities signed into law.",
    "WASHINGTON — The White House and congressional Democrats, concerned about rapidly rising prices across the nation that could sour voters ahead of looming midterm elections, are discussing temporarily suspending the federal gas tax and revamping their marquee domestic policy package to include an effort to reduce the budget deficit.",
    "“We’re going to propose legislation and we’re going to move forward, and we’re going to go back to our states and start talking about these things.”\nMany of the Democratic senators facing tough re-election fights this year have rallied behind the idea of a gas tax holiday, billing it as an easy way to provide economic relief.",
    "They have floated ways to narrow the measure’s scope, prioritizing $500 billion to address climate change, expanded Affordable Care Act subsidies and a measure to lower the cost of prescription drugs, according to officials involved in preliminary discussions who spoke on the condition of anonymity to discuss them.",
    "During a private party lunch on Tuesday, Democrats batted around an array of legislation to help reduce costs on food and other essentials, according to senators and aides briefed on the private discussion, including a plan, proposed last week, to suspend the gas tax of 18.4 cents per gallon through Jan. 1.",
    "“It’s more than trying — I think it’s important we do something about it,” said Senator Jon Tester, Democrat of Montana, who spoke during Tuesday’s lunch about his bipartisan proposal to address anti-competitiveness in the meatpacking industry as a way to lower prices, according to an aide.",
    "But it appeared unlikely to secure enough support to pass the Senate, where a supermajority of 60 votes is needed to advance most legislation, and lawmakers in both parties raised concerns about how effective it would be in lowering prices for consumers and how it would be reinstated.",
    "Senator Mark Kelly, Democrat of Arizona and a leading proponent of the legislation, described it on Tuesday as “something that directly helps people right now when they need it.”\nWhite House officials have not rejected the idea as a way to temporarily lessen high gas prices.",
    "Democrats are also quietly floating ways to revive Mr. Biden’s domestic policy plan, including scaling it back extensively from the $2.2 trillion version that passed the House last fall, which Mr. Manchin has called unacceptable, particularly in light of rising inflation.",
    "The discussions are aimed at addressing widespread economic anxiety and salvaging whatever they can of President Biden’s sprawling social safety net, climate and tax increase bill, known as the Build Back Better Act, before members of Congress face voters in November.",
    "And on Capitol Hill, senators and aides cautioned that conversations remained preliminary, as they focus on confirming a replacement for Justice Stephen G. Breyer on the Supreme Court and negotiating an omnibus spending package to keep the government fully funded.",
    "“We’re going to focus like a laser on reducing costs — the new proposals and new ideas keep coming,” said Senator Chuck Schumer of New York, the majority leader, who pointedly prioritized questions about “cutting costs” at his weekly news conference.",
    "Republicans, who have gleefully hammered Democrats for their failure to address inflation, scoffed at a gas tax holiday, arguing that it would do little to address the country’s economic problems and instead was a gambit to provide political cover.",
    "Mr. Biden’s economic advisers are also keenly aware of the need for him to aggressively confront rising prices, which are contributing to the feeling among many Americans that the economy is getting worse, despite record growth in jobs.",
    "Senator Joe Manchin III of West Virginia, a key Democratic centrist, bluntly declared on Tuesday that the plan “doesn’t make sense.”\nUnderstand Inflation in the U.S.\nInflation 101: What is inflation, why is it up and whom does it hurt?",
    "But he added, “I don’t think there’s any doubt that people are irritated and struggling with the increased cost of living, and we have to show a collective determination to focus on that.”",
    "Privately, his top aides say they recognize the importance of confronting the economic pain that many Americans feel, and are hopeful that Congress may pass some legislation to help.",
    "Privately, Mr. Biden’s economic team has talked for weeks about including a deficit reduction measure in the package, to address Mr. Manchin’s concerns about the national debt.",
    "“Look, families are getting clobbered by the cost of everyday things.”\nBut senior aides to Mr. Biden are eager to keep him away from a public back-and-forth with lawmakers.",
    "They have said they believe the endless negotiations with members of his own party last year made him look weak and helped drag down his approval ratings.",
    "Senator Brian Schatz, Democrat of Hawaii, said he would consider doing so “begrudgingly,” if it was the only way of passing any part of Mr. Biden’s plan.",
    "The Consumer Price Index data for January exceeded forecasts, showing prices jumped 7.5 percent over the year and 0.6 percent over the past month.",
    "Interest Rates: As it seeks to curb inflation, the Federal Reserve announced that it was raising interest rates for the first time since 2018.",
    "“We’re having lots of discussions with individual senators to get Build Back Better moving again,” Mr. Schumer said on Tuesday.",
    "Supply Chain’s Role: A key factor in rising inflation is the continuing turmoil in the global supply chain.",
    "“I think it’s a desperate cry for help,” said Senator John Thune of South Dakota, the No.",
    "Your Questions, Answered: Times readers sent us their questions about rising prices.",
    "“There is real inflation, and if you’re in a working-class family, it hurts.",
    "How Americans Feel: We asked 2,200 people where they’ve noticed inflation.",
    "2 Republican and among the senators running for re-election this year.",
    "On Capitol Hill, lawmakers have stepped up efforts to find a solution.",
    "That’s why my Build Back Better plan — what’s it all about,” he said.",
    "Many mentioned basic necessities, like food and gas.",
    "Top experts and economists weighed in.",
    "Here’s how the crisis unfolded.",
    "Our guide explains it all.",
    "Inflation F.A.Q."
  ]
}