{
  "id": 1368,
  "mediaId": 2601,
  "date": "2022-02-16",
  "headline": "Arizona Sen. Mark Kelly(D) swore off corporate PAC contributions, but money from corporations is still finding a way into his campaign coffers",
  "image": "https://iotwreport.com/wp-content/uploads/2022/03/41b8YokEkWL._SX331_BO1204203200_.jpg",
  "link": "https://iotwreport.com/arizona-sen-mark-kellyd-swore-off-corporate-pac-contributions-but-money-from-corporations-is-still-finding-a-way-into-his-campaign-coffers/?utm_source=rss&utm_medium=rss&utm_campaign=arizona-sen-mark-kellyd-swore-off-corporate-pac-contributions-but-money-from-corporations-is-still-finding-a-way-into-his-campaign-coffers",
  "mediaOutlet": "iotwreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MJA",
  "authorUrl": "https://iotwreport.com/author/mja/",
  "termIds": [
    5311,
    2459,
    2753,
    1489,
    1003,
    466,
    279,
    5949
  ],
  "sentences": [
    "Kelly, who has called corporate money “one of the biggest problems in our politics today,” received $55,500 in contributions last quarter from the PACs of corporate trade groups and the Senate leadership committees of many of his fellow Democrats.",
    "Rep. Ruben Gallego (D., Ariz.) criticized Kelly for raking in hundreds of thousands of dollars on the corporate speaking circuit, saying it conflicted with Kelly’s self-imposed ban on corporate PAC contributions for his campaign.",
    "The senator, who faces a tough reelection bid in November, introduced a bill with Sen. Jon Ossoff (D., Ga.) last month to ban companies from forming PACs or soliciting money to fund them.",
    "Trade associations like the National Football League and Internet & Television Association also contributed to Kelly’s campaign, according to his latest FEC disclosures.",
    "In 2019, Kelly attended a fundraiser hosted by the firm lobbying for Citigroup, Chevron, and ExxonMobil even after he came out against corporate PAC money.",
    "WFB: Sen. Mark Kelly (D., Ariz.) swore off corporate PAC contributions, but money from corporations is still finding a way into his campaign coffers.",
    "Kelly taking corporate donations through a loophole is the latest example of his inconsistent position on corporate influence in politics.",
    "“Our legislation would put an end to the corrupt influence of corporate PACs in our political system,” Kelly said of the bill.",
    "But while Kelly has not taken cash directly from corporate PACs, he has still benefited from their political contributions.",
    "The leadership committees have received tens of thousands of dollars from the sort of corporate PACs that Kelly decries.",
    "A review of FEC records shows all of the committees took thousands of dollars in corporate PAC money.",
    "Eleven Democratic senators have given $40,000 to Kelly’s campaign through their leadership PACs.",
    "A clever loophole could hurt the senator in his tough reelection bid.",
    "more"
  ]
}