{
  "id": 13720,
  "mediaId": 2630,
  "date": "2022-03-16",
  "headline": "Zelenskyy's plea spurs U.S. lawmakers to consider more help for Ukraine",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220316-volodymyr-zelenskyy-congress-jm-1133-e5dfaf.jpg",
  "link": "https://www.nbcnews.com/politics/congress/zelenskyys-plea-spurs-us-lawmakers-consider-help-ukraine-rcna20269",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Members of Congress give Ukraine President Volodymyr Zelenskyy a standing ovation before he speaks in a virtual address to Congress in the U.S. Capitol Visitors Center Congressional Auditorium on March 16, 2022.Sarahbeth Maney / The New York Times via AP\nSen. Joni Ernst, R-Iowa, who previously served in the U.S. Army Reserve and Army National Guard, said the Zelenskyy speech \"makes me want to throw on my uniform and go help.\"",
    "Obviously a video that was — I don’t know that there was a dry eye in the House, Democrat or Republican.”\n\"All of us are just trying to figure out how we do more,\" Slotkin told NBC News as she walked out of the room in the Capitol where Zelenskyy spoke virtually.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nCleaver said it's a \"massive challenge\" to strike the right balance between providing military assistance to Ukrainians without provoking a conflict with nuclear-armed Russia.",
    "WASHINGTON — U.S. lawmakers said they were deeply affected by Ukrainian President Volodymyr Zelenskyy's plea for help on Wednesday as they agonized about how to do more for his country without triggering a full-scale war between the U.S. and Russia.",
    "Rep. Michael McCaul, R-Texas, the top Republican on the House Foreign Affairs Committee, said he favors sending Ukraine MiG-29 fighter jets, which the U.S. has struggled to find a way to transfer.",
    "\"If they’re supporting Vladimir Putin, who is a war criminal, we should look for opportunities to bring as much financial hardship and as much sanctions as we can on the Russian government.\"",
    "It’s kind of sad because he made a request that I don’t think we can honor, which is the no-fly zone,\" said Rep. Emanuel Cleaver, D-Mo., who sits on the House Homeland Security Committee.",
    "“Everyone was really moved by the whole thing,\" said Rep. Elissa Slotkin, D-Mich., a former CIA and Pentagon official who chairs the House intelligence and counterterrorism subcommittee.",
    "\"Everything I hear from our military is that what's much more effective are other air defense systems, including the transfer of the S-300, which would be far more effective and quick.",
    "Slotkin said there was some talk after Zelenskyy's address about a limited no-fly zone negotiated between Russia and Ukraine, though she cautioned that was not fully fleshed out.",
    "Sen. Mitt Romney, R-Utah, said it makes more sense for the West to help Ukraine close its own skies than to be the enforcers by shooting down Russian aircraft.",
    "So a negotiation between Russians and Ukrainians on a humanitarian corridor that’s enforced by more than just the goodwill of the Russians,\" she said.",
    "She said the Ukrainian president's call could prompt the U.S. to provide more fighter jets and air defense to fend off the Russian onslaught.",
    "\"I think it’s pretty clear that it’s not a good idea for NATO to be in a combat in the skies with the Russians and shooting at each other.",
    "But one move that remained off the table for many lawmakers was Zelenskyy's call for closing the skies over Ukraine — or a no-fly zone.",
    "Key House and Senate leaders were expected to receive briefings on the situation in Russia and Ukraine later on Wednesday, aides said.",
    "Slotkin said she planned to visit the White House later on Wednesday and offer her advice directly to President Joe Biden.",
    "President Zelenskyy suggested sanctioning each member of the elected officials in Russia — probably a good idea,\" he said.",
    "\"But we can create safe skies by getting MiGs that are available in Poland to the folks in Ukraine to fly themselves.\"",
    "\"We're talking about a megalomaniac on the other side who could very easily decide the nukes are a way out,\" he said.",
    "“There’s a lot of discussion now, even just in the hallways walking out, of what a humanitarian no-fly zone would be.",
    "Slotkin said she supports Zelenskyy's call for \"a steady drumbeat of economic sanctions\" targeting Russia.",
    "Sen. Chris Van Hollen, D-Md., said transfers of the S-300 missile defense systems could take place soon.",
    "Romney expressed interest in Zelenskyy's call for sanctioning members of the Russian assembly.",
    "“His connection between what’s going on in his country and events in American history.",
    "That has the potential really becoming a World War III type scenario,\" he said.",
    "\"He asked us to sanction the Duma — I’m willing to look into that,\" he said.",
    "Sen. Mark Kelly, D-Ariz., also kept the door open for additional sanctions.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "\"I'm sure we'll keep studying more things, sanctioning more people.",
    "\"S-300s are in, but we need a lot more,\" McCaul said.",
    "And I think we're moving forward on that,\" he said.",
    "We should just call it World War III.\"",
    "\"It’s hard not to be moved his words.",
    "\"We shouldn't call it a no-fly zone.",
    "\"There's more we can do.\""
  ]
}