{
  "id": 13765,
  "mediaId": 2830,
  "date": "2022-03-15",
  "headline": "China, Russia and the Stakes in Ukraine",
  "image": "",
  "link": "https://www.wsj.com/articles/china-and-the-ukraine-stakes-putin-regime-power-oil-escrow-flow-biden-xi-settlement-11647377650",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Holman W. Jenkins",
  "authorUrl": "https://www.wsj.com/news/author/holman-w-jenkinsjr",
  "termIds": [
    0
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Free Expression\nStephen Kotkin\nOn this episode of Free Expression, Wall Street Journal Editor-at-Large Gerry Baker speaks with one of the world’s pre-eminent historians of Russia, Stephen Kotkin, about the autocratic ambitions behind Vladimir Putin’s invasion of Ukraine, how the west can do more to resist his aggression and how he has placed China at an inflection point in its rise to global superpower status.",
    "A superpower summit in Geneva, played to voters back home as Mr. Putin and the U.S. getting together to divide the world as in the days of yore, may well be the Russian dictator’s plan B, now that any hope of subjugating Ukraine without having to fight a permanent war is receding.",
    "AD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nSpotify\nGoogle Podcasts\niHeartRadio\nStitcher\nTuneIn\nRSS\nEuropeans continue to pay cash for Vladimir Putin’s natural gas though, as I and others have argued, they could easily escrow the money until the fighting ends.",
    "If the permafrost is really less permanent, the tenuous rail and road links that hold Russia together will be sinking in the muck at the very moment the country is being pushed apart by Western sanctions and Mr. Putin’s mismanagement.",
    "Photo: alexei druzhinin/kremlin/sputnik/Shutterstock\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (5 minutes)\nAD\nLoading advertisement...\n00:00 / 04:50\n1x\nThis article is in your queue.",
    "I’ve cited in the past a paper by economists Shaun Larcom, Tim Willems and Mare Sarr on how authoritarians can become trapped in a cycle of growing repression because of the means that brought them to power.",
    "Yuriy Vitrenko, head of Ukraine’s national pipeline company Naftogaz, which continues to deliver Russian gas supplies to Europe despite the war raging around it, lent his voice to the proposal on Monday.",
    "A meeting Monday between the White House’s national security team and senior Chinese diplomats in Rome does not seem to have breathed any certainty that the Chinese have made up their minds.",
    "As long as President Volodymyr Zelensky is alive and urging his people to fight on, Presidents Putin, Biden and Xi Jinping may be frustrated in their preferred exits from this crisis.",
    "WSJ Opinion: Hits for the Heroes of UkrainePlay video: WSJ Opinion: Hits for the Heroes of Ukraine\n Journal Editorial Report: The week's best and worst out of the battle for Ukraine.",
    "His regime inevitably was devolving into one driven by one man’s need for survival rather than by any genuine strategic, economic or national interest of the Russian people.",
    "Listen closely and the debate in China is quickly becoming how to manage this risk—by doubling down on support of Mr. Putin or by pressuring him to trim his aims in Ukraine.",
    "Open Queue\nMore important than surplus MiGs is the economic pressure being applied to Russia in conjunction with the military pressure applied by Ukraine’s brave resistance.",
    "Any Ukraine that emerges now, far from being neutralized or disarmed, will have to be bristling with weapons or allies or today’s war will be a down payment on the next.",
    "Western governments, through a series of provocations, were always reluctant to destabilize the Putin regime for the reasons that now worry the Chinese—what comes next.",
    "Barely discernible at this point, however, may be an emerging U.S.-China—I won’t call it an entente, but a shared reluctance to push the Putin regime to the wall.",
    "A sterile conversation about foreign-policy “realism” has popped up in the media, concerning whether the West took Russia’s security concerns seriously enough.",
    "His regime may well seek escalation for a different reason, however, and that’s to bring the U.S. to the table and displace Ukraine as its main interlocutor.",
    "Some say it was a mistake to open the door to Ukraine NATO membership while simultaneously saying “not yet.” But this is the hindsight fallacy.",
    "Possibly the only way to imagine a peaceful Russia is with NATO or something like it on every border closing the door to regional conflict.",
    "Something like this is already happening in effect as Russian suppliers have begun offering hydrocarbons on extended credit terms.",
    "He points out how technically unattractive the alternative of shutting down flowing gas wells would be to the Kremlin.",
    "Beijing’s radar screen suddenly is filled with visions of instability and risk from the north (good news for Taiwan).",
    "Images: AFP/Getty Images/Reuters Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Just as arguably, this half-measure deterrent worked until President Obama failed to enforce a red line in Syria.",
    "The possibilities are open-ended thanks to the central role of the U.S. dollar in global trade and finance.",
    "WSJ Opinion: Hits for the Heroes of Ukraine\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Joe Biden certainly pulled out nearly every stop to warn Mr. Putin off his catastrophic blunder.",
    "Its regions have too much to gain from their resources and from trade with the outside world.",
    "The attempt, if it persists, will only endanger the future of the Russian Federation itself.",
    "This column argued for years that Mr. Putin was on the path to some colossal miscalculation.",
    "Russian President Vladimir Putin and Chinese President Xi Jinping meet in Beijing, Feb. 4.",
    "0:00 / 2:03\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Read More Business World\nAs we go down this road, let’s be realistic about a few things.",
    "Nuclear war between the U.S. and Russia is not a good outcome for the Putin clique.",
    "It worked while the unpredictable Donald Trump was president.",
    "Ukraine is not digestible by Russia, militarily or otherwise.",
    "Palpably, though, the lack of realism was on the other side.",
    "The Russian state cannot survive as a giant North Korea.",
    "His aim in this respect, alas, might not be unrealistic.",
    "Finally we need some realism on the escalation risks.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "Unfortunately the West is faltering.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "But realism speaks here too.",
    "The idea is not a reach.",
    "Moscow is too far away."
  ]
}