{
  "id": 13996,
  "mediaId": 2830,
  "date": "2022-03-15",
  "headline": "Don’t Count on China to Mediate the War in Ukraine",
  "image": "",
  "link": "https://www.wsj.com/articles/dont-count-on-china-mediate-ukraine-war-russia-putin-talks-negotiation-xi-jinping-taiwan-nato-11647376630",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Rudd",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Free Expression\nStephen Kotkin\nOn this episode of Free Expression, Wall Street Journal Editor-at-Large Gerry Baker speaks with one of the world’s pre-eminent historians of Russia, Stephen Kotkin, about the autocratic ambitions behind Vladimir Putin’s invasion of Ukraine, how the west can do more to resist his aggression and how he has placed China at an inflection point in its rise to global superpower status.",
    "Beijing defended the principles of national sovereignty and territorial integrity and said that while it “did not want to see the current situation in Ukraine,” the international community needed to “identify the real causes and issues from the history of the Ukraine.” This is code for recognizing that Russia has legitimate security concerns arising from the expansion of the North Atlantic Treaty Organization.",
    "Open Queue\nBefore White House national security adviser Jake Sullivan and top Chinese diplomat Yang Jiechi met in Rome on Monday, many in the West hoped that Beijing might limit its support for Russia following its invasion of Ukraine or even help end the conflict, having recently talked up its wish to see a cease-fire and its potential interest in a mediating role.",
    "Rising grain prices are also a political issue for Mr. Xi, who on March 6 devoted an entire speech to berating China’s legislature not to “slacken our efforts on food security.” The war between Russia and Ukraine—two of the world’s top wheat exporters—could not come at a worse time for China.",
    "Still others are watching and waiting for an explosion in Covid cases across the mainland emanating from Hong Kong, which would undermine Mr. Xi’s domestic political claim over the past two years that China got the pandemic right and the U.S. and the West got it radically wrong.",
    "Torrential rains have the country facing a wheat harvest that China’s agriculture minister said “could be the worst in history.”\nChina’s biggest economic concern arising from Ukraine, however, is the risk of secondary sanctions to its financial institutions.",
    "Finally, even if Mr. Xi decided to intervene to end the war, it isn’t clear what China could bring to the negotiating table that wouldn’t permanently alienate the man he has called his “best friend.” What could China propose that Mr. Putin might accept?",
    "“China would not tolerate any misinformation and efforts to smear China,” the report continued, presumably referring to U.S. intelligence briefings to the international media warning of Russian requests to China for military equipment.",
    "AD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nSpotify\nGoogle Podcasts\niHeartRadio\nStitcher\nTuneIn\nRSS\nMeanwhile, the official Chinese media report on the meeting rehearsed China’s standard position on Ukraine.",
    "Premier Li Keqiang acknowledged that achieving such growth is “not easy.” China’s economy was already on shaky ground because of Mr. Xi’s post-2017 “pivot to the state” and his crackdown on the private sector.",
    "Despite the war’s increasing economic and diplomatic costs for China, there is still no evidence that Beijing will change its strategy toward Moscow or seek to mediate a cease-fire between Russia and Ukraine.",
    "Illustration: Martin Kozlowski\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (7 minutes)\nAD\nLoading advertisement...\n00:00 / 06:59\n1x\nThis article is in your queue.",
    "The most significant benefit China derives from a benign relationship with its vast northern neighbor is that it enables Mr. Xi to focus almost solely on his principal strategic rival, the U.S.",
    "Mr. Rudd is global president of the Asia Society and author of “The Avoidable War: The Dangers of a Catastrophic Conflict between the U.S. and Xi Jinping’s China,” forthcoming March 22.",
    "First, the Joint Strategic Framework that China and Russia signed on Feb. 4, which foreshadows “no limits” on strategic collaboration between Moscow and Beijing, remains in full force.",
    "Second, while Beijing worries about negative European perceptions of Chinese support for Russia, it believes it can manage any damage to its interests in Brussels and elsewhere.",
    "Third, Mr. Xi likely was surprised by the Ukrainian military’s resistance, the slowness of the Russian advance, and the degree of European unity that the invasion generated.",
    "The problem for those advocating a substantive change of course on Ukraine within the system is that China’s position on Russia and Ukraine is driven from the top.",
    "The war’s duration, destruction, and civilian casualties have stunned Beijing, as have the intensity and near-unanimity of the international and European reaction.",
    "If any are judged in violation of U.S. and allied sanctions against Russia, China is exposed because it depends on the Swift global financial messaging system.",
    "Chinese leaders are concerned about its effect on the global economy and their country’s 2022 growth prospects, which were under pressure before the invasion.",
    "After the seven-hour meeting, the U.S. issued a three-sentence summary noting that the talks were intense and covered a range of concerns including Ukraine.",
    "This caused hard-liners in Beijing to conclude that although relations will be rocky for a while with the Europeans, these problems likely are temporary.",
    "Last week, France’s President Emmanuel Macron and Germany’s Chancellor Olaf Scholz participated in a virtual summit with Mr. Xi on potential mediation.",
    "Some in the Communist Party are questioning his strategic judgment by departing from Deng Xiaoping’s foreign-policy wisdom of keeping a low profile.",
    "Others have challenged his economic judgment because of his moves against the Chinese private sector, which has powered Chinese growth for 35 years.",
    "WSJ Opinion: Has NATO Drawn a Line in the Sand Over Helping Ukraine?Play video: WSJ Opinion: Has NATO Drawn a Line in the Sand Over Helping Ukraine?",
    "And how does China view strategic and economic reality as the siege of Kyiv begins, three weeks into Mr. Putin’s failed blitzkrieg against Ukraine?",
    "Mr. Xi likely is wary of taking any action that could disturb the Russia-China relationship, from which Beijing benefits strategically.",
    "On the surface, nothing seems to have changed in Xi Jinping’s position, which remains deeply supportive of Vladimir Putin’s interests.",
    "Together these would make a powerful political cocktail by the 20th Party Congress this fall, where Mr. Xi seeks to ratify his rule.",
    "But in the absence of direct NATO intervention, he likely expects Russia to achieve an acceptable military outcome in the conflict.",
    "And were Mr. Putin himself to fall as a result of Ukraine, the political pressures on Mr. Xi would be formidable indeed.",
    "The document reflects the deep personal relationship Messrs. Putin and Xi have developed over the past seven years.",
    "Chinese diplomats worry about the foreign-policy blowback for being so close to Russia during the war.",
    "Images: Reuters Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "This is despite Foreign Minister Wang Yi’s statement last week that China was willing to mediate.",
    "Surging energy prices in particular spell trouble for the world’s largest oil and gas importer.",
    "The two countries share an interest in challenging the U.S.-led liberal international order.",
    "0:00 / 6:23\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "China only last week set its official growth target for the year at an ambitious 5.5%.",
    "This doesn’t rule out the possibility of China’s changing its position on Ukraine.",
    "But thus far Beijing has talked about a mediating role without pursuing one.",
    "Journal Editorial Report: Putin sees that NATO's aid has significant limits.",
    "Skyrocketing commodity prices are now even more of a problem for Beijing.",
    "WSJ Opinion: Has NATO Drawn a Line in the Sand Over Helping Ukraine?",
    "Skip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "In the Chinese political system, Mr. Xi can never be wrong.",
    "But a protracted war in Ukraine poses a danger for Mr. Xi.",
    "He served as Australia’s prime minister, 2007-10 and 2013.",
    "Mr. Xi’s nature has never been to back down.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "So where does Beijing stand?",
    "Here are four reasons why."
  ]
}