{
  "id": 14002,
  "mediaId": 2641,
  "date": "2022-03-16",
  "headline": "Stop War Profiteering With Stock Trading Ban by Congress",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=2c517331-ed1a-46c0-93c7-30563d11f9f5&SiteName=Newsmax",
  "link": "https://www.newsmax.com/robertzapesochny/lockheed-martin-raytheon-technologies/2022/03/16/id/1061433/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Zapesochny",
  "authorUrl": "https://www.newsmax.com/insiders/robertzapesochny/id-671",
  "termIds": [
    0
  ],
  "sentences": [
    "As Ukrainians and Russians are fighting a brutal war, and the American people are seeing their food and gas bills go up, we need a committee to investigate congressional war profiteering.",
    "In December 2019, it was reported that 134 members of Congress, and their spouses, owned as much as $92.7 million in fossil fuel companies and mutual funds invested in the energy sector.",
    "In campaign contributions, the oil and gas industry gave almost $29.8 million in total contributions to all candidates for the House and Senate in 2018 and $40.1 million in 2020.",
    "Jon Ossoff of Georgia and Mark Kelly of Arizona have proposed legislation that would limit all members of Congress, as well as spouses and dependent children, to a blind trust.",
    "Republican Congressman Kelly Armstrong of North Dakota alone owns his family's oil and gas business that was worth somewhere between $3 million and $10.6 million in 2020.",
    "Arkansas-born Sen. Josh Hawley, R-Mo., introduced a similar piece of legislation that would \"return their profits\" earned from insider trading to the Treasury.",
    "Russia's Deputy Foreign Minister Sergei Ryabkov said that any convoy of arms shipments from the West would be considered \"legitimate targets.\"",
    "The amount of spending in federal contracts to our nation's capital region increased from $4.2 billion in 1980 to $80 billion by 2011.",
    "He has been published in numerous outlets, including The American Spectator, the Washington Times, and The American Conservative.",
    "Robert Zapesochny is a researcher and writer whose work focuses on foreign affairs, national security and presidential history.",
    "The biggest campaign contributors in the defense industry in 2020 and 2022 were Lockheed Martin and Raytheon Technologies.",
    "In a previous column, I said that I hoped that Ossoff, Kelly, and Hawley could work together and combine their proposals.",
    "The Javelin antitank missiles used in this conflict are jointly developed by Lockheed Martin and Raytheon Technologies.",
    "I believe it is in America's national interest to get Russia and Ukraine to settle this conflict as soon as possible.",
    "While millions of people are suffering, members of Congress are already reaping the rewards from their benefactors.",
    "Coincidentally or not, in FY 2020, Lockheed Martin was awarded $75.2 billion and Raytheon received $21.7 billion.",
    "In March 1941, Harry Truman chaired the Senate Special Committee to Investigate the National Defense Program.",
    "The energy sector was in second place as members of Congress bought over $31 million of stock the last year.",
    "At least 18 members of Congress, or their spouses, hold stock in Lockheed Martin and Raytheon Technologies.",
    "On March 8, 2022, the House overwhelmingly voted to ban Russian oil from the United States by 414 to 17.",
    "Long before this invasion, members of Congress, and their spouses, owned a lot of stock in fossil fuels.",
    "The D.C. area has some of the richest suburban counties in the country as a result of federal contracts.",
    "From June 2020 to June 2021, Russia exported 39.1 million metric tons of wheat in that market year.",
    "Although Vladimir Putin started this war, members of Congress are benefiting from this corruption.",
    "The defense industry gave $25.8 million in the 2018 elections and $35.3 million in 2020 elections.",
    "Beyond campaign contributions, many members of Congress make their real money from stock trading.",
    "The Ukrainians also need a peace deal before the Russian military destroys this country further.",
    "I think we need a Truman-style committee to reveal the scale of the war profiteering since 9/11.",
    "I now believe that nothing short of a total ban on congressional stock trading is appropriate.",
    "Even the smallest chance of nuclear war between the United States and Russia is unacceptable.",
    "Beyond energy prices, and defense contractors, the price of wheat has gone up tremendously.",
    "Many innocent Ukrainians were killed while members of Congress profited from this conflict.",
    "The defense industry spent $117 million on lobbying in 2021, according to OpenSecrets.",
    "As long as lawmakers benefit from this corruption, they will never \"drain the Swamp.\"",
    "In 2021, members of Congress bought and sold at least $355 million in stock trades.",
    "The top destination for these congressional investors was the technology sector.",
    "In 2021, the oil and gas industry spent $115 million on lobbying in Washington.",
    "When he's not writing, Robert works for a medical research company in New York.",
    "The committee investigated waste, mismanagement, and war profiteering.",
    "Sending these weapons into Ukraine would likely extend this conflict.",
    "This helped investors in American oil companies and hurt consumers.",
    "When the war hit, the stock in these two contractors went up.",
    "This could start a war between the United States and Russia.",
    "It saved the U.S. taxpayers $15 billion during World War II.",
    "Russia and Ukraine export 29 percent of the world's wheat.",
    "Today that would be the equivalent of over $200 billion.",
    "Read Robert Zapesochny's Reports — More Here.",
    "Not surprisingly, oil prices went up.",
    "In January 2022, Democratic Sens.",
    "This is a conflict of interest.",
    "All rights reserved.",
    "© 2022 Newsmax.",
    "Special Links:"
  ]
}