{
  "id": 14034,
  "mediaId": 2539,
  "date": "2022-03-16",
  "headline": "Biden says Russian leader Putin ‘is a war criminal’ for Ukraine attacks",
  "image": "https://image.cnbcfm.com/api/v1/image/107031516-1647453878312-gettyimages-1239238970-AFP_326A9TU.jpeg?v=1647453915&w=1920&h=1080",
  "link": "https://www.cnbc.com/2022/03/16/biden-says-russian-leader-putin-is-a-war-criminal-for-ukraine-attacks.html",
  "mediaOutlet": "CNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Mangan",
  "authorUrl": "",
  "termIds": [
    4591,
    4905,
    2459,
    2859,
    557,
    649,
    6569,
    6526,
    6672
  ],
  "sentences": [
    "White House press secretary Jen Psaki later said Biden was speaking from his heart about what he has seen on the news about the “barbaric actions by a brutal dictator.”\nPsaki noted that there is a separate legal process to determine whether Putin has violated international law and committed war crimes.",
    "Kremlin spokesman Dmitry Peskov, in response to Biden, said, “We consider unacceptable and unforgivable such rhetoric of the head of the state, whose bombs killed hundreds of thousands of people around the world,” according to the Russian news agency Tass.",
    "Kelly cited Russia’s attacks on “hospitals, maternity wards, apartment buildings” in Ukraine and its military’s “direct fire on civilians.”\nIn an exchange with a reporter in a loud, crowded room in the White House following an event, Biden was asked, “Mr.",
    "Biden’s comment came hours Ukraine President Volodymyr Zelenskyy and other top officials met virtually with the International Criminal Court’s top prosecutor, who two weeks ago opened an investigation into possible war crimes by Russia.",
    "The United Nations on Tuesday said that since Feb. 24, when Russia launched its invasion of Ukraine, nearly 700 civilians have been killed, with more than 1,140 civilians injured.",
    "President, after everything we’ve seen, are you ready to call Putin a war criminal.”\nBiden initially replied, “No,” as he walked by the journalist.",
    "watch now\nPresident Joe Biden said Wednesday that he believes Russian leader Vladimir Putin “is a war criminal” for his attacks on Ukraine.",
    "Biden then returned to the journalist asking, “Did you ask me whether I should call?”\n“Oh, I think he is a war criminal,” Biden said.",
    "And it came after Sen. Mark Kelly, D-Ariz., earlier Wednesday said Biden “absolutely” should call Putin a war criminal.",
    "The reporter then asked if Biden will “go to Poland,” where many Ukraine refugees have fled the Russian invasion.",
    "It was the first time Biden has publicly branded Putin with that phrase.",
    "That process currently is underway at the State Department, she said."
  ]
}