{
  "id": 14042,
  "mediaId": 2745,
  "date": "2022-03-21",
  "headline": "Five questions about Biden’s trip to Europe",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5UTZ7AFJFEI6ZCUOTRXJ7R5A3Y.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/21/five-questions-about-bidens-trip-europe/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“The caution that [Glynda Carr, president and chief executive of Higher Heights,] and other Black women are feeling ahead of this week’s hearings has multiple causes, they say, including how some Republicans have sought to undermine Jackson’s qualifications in the weeks since President Biden announced her nomination; the biases other women nominees — and women of color nominees in particular — have faced in seeking some of the most elite jobs in government; and Black women’s own lived experiences facing discrimination in hiring processes and feeling like they’re held to higher standards than White and male candidates,” Julianne McShane reports.",
    "So could his visit to Poland on Friday, since it focuses on what Psaki called the “humanitarian and human rights crisis.”\nLast Thursday, Blinken said the United States and European Union were looking at “how we can effectively channel our resources to support countries, particularly the neighboring countries that are bearing such a burden — Poland, little Moldova, Romania, others” and promised “more on that in the days to come.”\nBiden spoke for nearly two hours Friday with Chinese President Xi Jinping, warning him against providing Moscow with military or economic aid as Russian President Vladimir Putin’s war drags on.",
    "Costs, time both up: “The price to transport a container from China to the West Coast of the United States costs 12 times as much as it did two years ago, while the time it takes a container to make that journey has nearly doubled.”\n“Biden’s role as chief Ukraine envoy during Russia’s brazen seizure of Crimea and fomenting of conflict in eastern Ukraine — for which it faced few significant consequences — deeply informs his handling of the current crisis in Ukraine, according to current Biden and former Obama officials,” Ashley Parker and Ellen Nakashima report.",
    "“Should Mr. Putin’s demands for territory and neutrality be rebuffed, he is expected to try to hold all of the ground his forces have taken, and fight on, U.S. officials said.”\n“The U.S. has transferred a significant number of Patriot antimissile interceptors to Saudi Arabia in recent weeks as the Biden administration looks to ease what has been a point of tension in the increasingly complicated U.S.-Saudi relationship,” the AP’s Aamer Madhani reports.",
    "Speaking on the condition of anonymity, a senior administration said the decision is in line with Biden’s promise that “America will have the backs of our friends in the region.”\n“The European Union looks set to reinforce the U.S. warning to China that Beijing would face serious consequences if it tried to cushion the blow of sanctions against Russia or provide Moscow with military support,” Bloomberg’s Jenny Leonard and Alberto Nardelli report.",
    "In a roundtable with journalists on Thursday, Secretary of State Antony Blinken described the situation in Ukraine’s neighbors as a “refugee crisis.” When Vice President Harris recently visited Poland, that country’s President Andrzej Duda warned it could turn into a “refugee disaster.”\nNearly 3.5 million Ukrainians have fled their war-torn homeland, more than 2 million of them seeking shelter in Poland.",
    "“Trump has amassed a bigger war chest than any of the GOP party committees that are focused on the midterms, but for a second straight month didn’t donate any of it to other Republicans.”\n“Today, Gen Xers, who grew up worried that a nuclear war between the two superpowers would destroy the planet are experiencing a combination of deja vu and PTSD,” Frederic J. Frommer writes.",
    "“After Russian forces failed to secure a quick victory over Ukraine, senior U.S. officials see signs the Kremlin is shifting to a new strategy to secure key territorial objectives while seeking leverage to compel the Ukrainian government to accept neutrality between Russia and the West,” the Wall Street Journal’s Michael R. Gordon and Alex Leary report.",
    "And the two first-term senators probably can’t win unless Latino voters turn out in strong numbers for them.”\nDonald Trump endorsed two dozen more candidates in February, but the Federal Election Commission says the former president’s political action committee hasn’t given them (or anyone else he’s endorsed) any cash, Bloomberg's Bill Allison reports.",
    "“Russia is bent on seizing Mariupol — which would be its first strategic victory in a war that appears to be approaching a stalemate in many other parts of the country — and has threatened the city with more assaults and a ‘military tribunal,’” Miriam Berger, Rachel Pannett, Jonathan Edwards, Annabelle Timsit and Ellen Francis report.",
    "“With inflation surging at its fastest pace in 40 years, President Biden has identified a new culprit that he says is helping fuel America’s skyrocketing prices: The ocean vessels that ferry containers stuffed with foreign products to America’s shores each year,” the New York Times’s Ana Swanson reports.",
    "Jackson is the first Black woman to be nominated to the nation’s highest court in its 233-year history and in other ways she would bring less-common experiences, namely having served as a district court judge and public defender.” our colleagues Adrian Blanco and Shelly Tan report.",
    "“Despite her years on the federal bench and as a lawyer in private practice and public service, Judge Ketanji Brown Jackson has had little engagement with many of the hot-button issues dominating the Supreme Court’s attention,” Robert Barnes and Ann E. Marimow report.",
    "“Chairman Richard J. Dubin (D-Ill.) said it was ‘a proud day for America’ as the Senate Judiciary Committee began four days of hearings on the nomination of Judge Ketanji Brown Jackson” on Monday, John Wagner, Felicia Sonmez, Eugene Scott and Mariana Alfaro report.",
    "Instead, he waived trial by jury and bet his freedom on a bench trial before U.S. District Judge Trevor N. McFadden, a former Fairfax County police officer and Justice Department official in the George W. Bush and Trump administrations,” Spencer S. Hsu reports.",
    "On Thursday, Biden will attend an emergency meeting of NATO, then a previously scheduled European Council meeting, followed by a gathering of the Group of Seven rich countries — Canada, France, Germany, Italy, Japan, the United Kingdom and the United States.",
    "“Why don't — very good friend of mine, very good friend of Ukraine, Joe Biden, the leader of the global world, who demonstrate now the leadership — why don't he come visit here next week as a symbol of our solidarity?” Poroshenko asked Saturday on CNN.",
    "President Biden heads to Europe this week on what could be one of his most consequential overseas trips, showcasing unity with NATO and European Union partners and setting the stage for the next phase of the West’s response to Russia’s war in Ukraine.",
    "“The proposed rule from the Wall Street regulator mandates that hundreds of businesses report their planet-warming emissions in a standardized way for the first time,” Maxine Joselow and Douglas MacMillan report.",
    "Large and unusually early expenditures in Nevada and Arizona are “a sign that Democrats are beginning to take seriously the gains Republicans are making among Latino voters,” Politico's Sabrina Rodriguez reports.",
    "Beyond restating an “ironclad commitment” to defend “every inch” of NATO territory, and a likely new push to give Ukrainian anti-armor and air-defense systems, it’s not clear what the alliance could announce.",
    "“Judge Ketanji Brown Jackson, President Biden’s nominee to fill the upcoming Supreme Court vacancy, faces four days of Senate hearings starting today that are sure to include questions about her career.",
    "The trip will be focused on continuing to rally the world in support of the Ukrainian people and against President Putin’s invasion of Ukraine,\nbut there are no plans to travel into Ukraine.",
    "On Twitter, White House press secretary Jen Psaki poured cold water on the possibility without completely ruling it out, saying there were “no plans” for Biden to visit Ukraine this week.",
    "Their presence means a whole network of U.S. logistical and security support (that doesn’t necessarily exist elsewhere) can facilitate a president’s in-and-out, and safety on the ground.",
    "While many of her positions are difficult to nail down, Barnes and Marimow walk you through what we know about Jackson's stances on everything from abortion rights to immigration.",
    "As I mentioned on Julie Mason’s SiriusXM show on Friday, NATO member Turkey recently acquired Russian-made S-400 missile defense systems over strenuous U.S. objections.",
    "What’s at stake: “Democrats will have a hard time preserving their slim majority if [Nevada Sen. Catherine Cortez Masto] and [Arizona Sen. Mark Kelly] are defeated.",
    "“We had been documenting the siege of the Ukrainian city by Russian troops for more than two weeks and were the only international journalists left in the city.",
    "Putin has warned convoys delivering weapons to Ukraine are fair game, then followed up with an airstrike near the Polish border, some 10 miles inside Ukraine.",
    "The United States and the alliance have ruled out setting up a “no-fly zone” over Ukraine, despite entreaties from Ukrainian President Volodymyr Zelensky.",
    "On Friday, he’ll travel to Warsaw, to discuss efforts to help countries that have taken in the lion’s share of nearly 3.5 million Ukrainian refugees.",
    "Rather than revisit whether today is Twitter's actual birthday, which sounds like a chore, please do this: Follow a bunch of National Parks accounts.",
    "Some experts think the war could soon reach a stalemate of sorts, with Putin’s forces unable to take over and secure areas they’d hoped to capture.",
    "At the same time, Russian forces have delivered bloody destruction to civilian areas, in particular the besieged and battered city of Mariupol.",
    "In an accompanying post, he said he has rarely sung ‘Russians’ since it came out, because he never thought it would be relevant again.”",
    "“That would be extremely right step for demonstration, the whole world is together with us against Russia,” Poroshenko said.",
    "After ad hominem attacks, chronic whataboutism and other nonsense, there’s nothing like videos of bears or buffalo.",
    "Former Ukrainian president Petro Poroshenko, who’s known Biden for years, pushed this weekend for Biden to do it.",
    "Think of President Donald Trump visiting the Demilitarized Zone between North and South Korea in June 2019.",
    "Surgeons gave us white scrubs to wear as camouflage.”\nMstyslav Chernov is a video journalist for the AP.",
    "They had a list of names, including ours, and they were closing in,” the AP’s Mstyslav Chernov writes.",
    "It’s not clear whether he’ll seek a similar statement from NATO or the European Council this week.",
    "It’s just that their destinations tend to be places where the United States has combat troops.",
    "Or President George W. Bush ducking two thrown shoes during a stop in Iraq in December 2008.",
    "“[Couy] Griffin rejected prosecutors’ offer to plead to a lesser charge and serve probation.",
    "Prospects also seem dim for facilitating the transfer of Soviet-era warplanes to Ukraine.",
    "It could now transfer them to Ukraine, where troops have operated the older S-300 system.",
    "Lurking in the backdrop of Biden’s trip is how the man running the Kremlin will respond.",
    "This is his account of the siege of Mariupol, as relayed to AP reporter Lori Hinnant.",
    "Biden’s stop at the European Council could be a venue for announcing expanded aid.",
    "Or President Barack Obama’s December 2010 stop at Bagram Air Base in Afghanistan.",
    "We will have additional details of @potus trip to Europe to announce later today.",
    "We were reporting inside the hospital when gunmen began stalking the corridors.",
    "One long-shot possibility would also be an astonishing act of poetic justice.",
    "“In an Instagram post last week, Sting performed the song again.",
    "turned his cyberweapons on America, or breached NATO territory.",
    "That’s about 500,000 more people than live in Philadelphia.",
    "2 seed Kentucky in “March Madness,” except with worse odds.",
    "Mostly for security reasons, this is a very long shot.",
    "Kind of like Saint Peter’s upsetting No.",
    "“The Russians were hunting us down.",
    "Tell your friends to sign up here.",
    "Welcome to The Daily 202!",
    "What if that fails, too?",
    "But he has not (yet?)"
  ]
}