{
  "id": 14062,
  "mediaId": 2574,
  "date": "2022-03-17",
  "headline": "Biden White House Says Vulnerable Senate Dems Are Playing ‘Politics’ on Pandemic Safety",
  "image": "https://freebeacon.com/wp-content/uploads/2022/03/president-biden-delivers-his-first-state-union-address-joint.jpg",
  "link": "https://freebeacon.com/coronavirus/biden-accused-these-senate-dems-of-playing-politics-on-vote-to-lift-airline-mask-mandates/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Christenson",
  "authorUrl": "https://freebeacon.com/author/josh-christenson/",
  "termIds": [
    0
  ],
  "sentences": [
    "In 2020, the Journal of Travel Medicine found over the course of five flights between Dubai and Hong Kong no COVID transmission occurred, though there were at least seven infected passengers on each flight.",
    "\"The determination of the timeline and circumstances under which masks should be required in these settings should be guided by science, not politics,\" the White House informed the senators.",
    "said the bill merely complements the agency's February guidelines, which suggested that most Americans could stop wearing masks due to low levels of COVID-related hospitalizations.",
    "In December, top airline CEOs testified in congressional hearings that the air filtration technology used on planes makes air travel safer than almost any other indoor setting.",
    "Coronavirus\nThe White House took aim at senators who voted to lift mask requirements for public transportation, saying they were putting \"politics\" above science.",
    "Biden not only threatened to veto the legislation if it reached his desk, but said everyone who voted for it was ignoring science for their political advantage.",
    "Following his inauguration, Biden introduced the mandate via executive order, and his CDC went on to extend it three times without congressional involvement.",
    "Michael Bennet (Colo.), Catherine Cortez Masto (Nev.), Maggie Hassan (N.H.), and Mark Kelly (Ariz.), all of whom face competitive elections this November.",
    "The legislation to lift mask requirements passed in the Senate with the support of 49 Republican senators and the 8 Democrats, which include Sens.",
    "Biden's Centers for Disease Control and Prevention recently chose to prolong its mask mandate on airplanes and other public transit.",
    "Polling data show Democrats behind Republicans in generic polls, an ominous sign for the president's party entering the midterms.",
    "\"They can go to shopping centers, they can go to malls—everywhere but an airport, which looks a lot like a shopping mall to me.\"",
    "Biden's shot at the senators in his own party comes as many accuse the White House of basing pandemic measures on politics.",
    "The group includes eight Democratic senators, many of whom are fighting for survival in the upcoming midterm elections.",
    "\"People can sit shoulder to shoulder in restaurants across the land now, without a mask,\" Wicker said before the vote.",
    "His administration began to wind down mask recommendations in the days preceding his State of the Union address.",
    "all voted for the bill, which was supported by every Republican other than Utah senator Mitt Romney.",
    "Joe Manchin (W.Va.), Jacky Rosen (Nev.), Kyrsten Sinema (Ariz.), and Jon Tester (Mont.)",
    "Though expected to end in March, the restrictions were extended until April 18.",
    "Studies have also confirmed the risk of spreading COVID-19 onboard is low.",
    "\"If Congress were to pass this resolution, the President would veto it.\"",
    "In addition to the four senators up for reelection, Democratic Sens.",
    "The change came as polling data showed restrictions were unpopular.",
    "The need for masks on planes has long been in doubt.",
    "Sen. Roger Wicker (R., Miss.)"
  ]
}