{
  "id": 14071,
  "mediaId": 2557,
  "date": "2022-03-15",
  "headline": "REPORT: White House threatens veto of Rand Paul legislation which just passed in Senate with bipartisan support",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/03/GettyImages-1005311630.jpg",
  "link": "https://dennismichaellynch.com/report-white-house-threatens-veto-of-rand-paul-legislation-which-just-passed-in-senate-with-bipartisan-support/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    2459,
    2346,
    1973,
    5168,
    5510,
    5879,
    3016,
    1489
  ],
  "sentences": [
    "That is why, I forced this vote, and I applaud the Senate for rejecting this nonsense.”\n“Today, the Senate said enough is enough and sent a message to unelected government bureaucrats to stop the anti-science, nanny state requirement of travel mask mandates,” said @RandPaul\nSenate passes resolution to scrap mask mandate for public travel\n— Washington Examiner (@dcexaminer) March 16, 2022\nTo get more information about this article, please visit WashingtonExaminer.",
    "Since March 2020, unelected bureaucrats have incessantly declared that we should ‘follow the science.’ But the same bureaucrats continue to defy science by imposing an ineffective and restrictive mask mandate for individuals traveling on public transit and airplanes.",
    "As the entire world is learning to live with COVID, the federal government still uses fear mongering to stubbornly perpetuate its mandates, rather than giving clear-eyed, rational advice on how to best protect yourself from illness.",
    "In a press release, Sen. Paul said, ““Today, the Senate said enough is enough, and sent a message to unelected government bureaucrats to stop the anti-science, nanny state requirement of travel mask mandates.",
    "Sen. Rand Paul (R-Ky.) introduced the bill to repeal travel mask mandates on public transportation, and forced a vote on it in the Senate Tuesday night.",
    "However, the Washington Examiner has noted that it is unlikely House Speaker Nancy Pelosi would even allow a vote on the bill in the House.",
    "Michael Bennet, Catherine Cortez Masto, Maggie Hassan, Mark Kelly, Joe Manchin, Jacky Rosen, Kyrsten Sinema, and Jon Tester.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "It passed 57-40, with only one Republican, Sen. Mitt Romney of Utah, voting against it.",
    "Eight Democrats also supported the measure: Sens.",
    "Listen to the latest daily DML podcasts below!",
    "Listen to the latest daily DML podcasts below!",
    "Then please share.",
    "Then please share."
  ]
}