{
  "id": 1407,
  "mediaId": 2550,
  "date": "2022-02-16",
  "headline": "There can be no bipartisanship in the face of the latest from Senate Republicans",
  "image": "https://images.dailykos.com/images/926642/story_image/GettyImages-1231672448.jpg?1615658851",
  "link": "https://www.dailykos.com/stories/2022/2/16/2080712/-Democrats-Biden-will-have-to-bring-the-fight-to-Republicans-to-end-their-nominee-blockade?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    5408,
    2751,
    2564,
    2413,
    1783,
    1489,
    1120,
    1126
  ],
  "sentences": [
    "This week, it’s the Republicans on the Senate Banking Committee and the five nominees to the Federal Reserve Board of Governors: Jerome Powell for his second term as chair (he’s serving now in a temporary basis); Lael Brainerd, who sits on the board already but is getting promoted to vice chair; Philip Jefferson, an economist and administrator at Davidson College, who would be just the fourth Black man to serve on the board; Lisa Cook, a Michigan State University economics professor who, if confirmed, would become the first Black woman to serve on the Federal Reserve’s Board of Governors; and Sarah Bloom Raskin, a former deputy secretary of the U.S. Department of the Treasury who has done work on the economic impacts of climate change and has urged financial regulators to use their tools to respond to risks posed by climate change.",
    "That would take Vice President Kamala Harris and every Democrat to accomplish, setting the precedent that under the current rules, as Binder describes it, “A majority does not have to be physically present to make a committee quorum when the panel is evenly split.”\nThere are two glaring problems with that potential action: Sens.",
    "But [Republicans are] not showing up to do the constitutional duty that they were elected to do.”\nx\nAt a pivotal moment for our economic recovery, Mitch McConnell and his followers are blocking Powell’s confirmation and kneecapping the Fed’s ability to combat inflation and lower costs.",
    "There aren’t going to be 10 Republicans willing to break these boycotted votes, and with a 50/50 Senate and under the organizing agreement Majority Leader Chuck Schumer made with Minority Leader Mitch McConnell, nominees can’t move out of committee without a quorum to advance them.",
    "Nobody does, but she answered the questions in good faith.”\n“I think she’s done everything that she has been asked to do.” Toomey has said that Republicans would allow votes on the other four nominees, but Brown is holding firm against that.",
    "Both have been pretty consistent in supporting Biden on nominees, and more philosophically, behind the principle that the president has the right to have his appointees and that it’s the Senate’s job to advise and consent, or not, on them.",
    "That would involve a Democrat to move to vote for one or all of these nominees approved by Democrats on the floor, and a Republican raising a point of order against that on the grounds that the committee didn’t have a majority present.",
    "“[President] Biden and Schumer might very well need to work together to change the rules or use recess appointments to push through these critical nominees,” David Segal, executive director of Demand Progress, told Dayen.",
    "They could do it in the Homeland Security Committee where Biden’s last two nominees for the Postal Service Board of Governors are waiting, and thus secure Postmaster General Louis DeJoy’s job at least in the short-term.",
    "He would have been the highest-ranking Muslim official in the Biden administration, which is probably why Republicans blockaded him, five times—they boycotted five different committee mark-ups to keep him out.",
    "Biden pulled the nomination, opting instead to appoint him to be special representative for commercial and business affairs at the State Department, a position that doesn’t require Senate confirmation.",
    "pic.twitter.com/poREXivvKy\n— Senator Jon Tester (@SenatorTester) February 15, 2022\nHe and Sen. Elizabeth Warren (D-MA) pushed Brown to hold the vote anyway on all five, even without Republicans.",
    "To that end, they’ve deployed a tactic that worked for them last fall: boycotting confirmation votes in committee to deny a quorum, disallowing the nominees to be discharged to the full Senate.",
    "“In today’s 50-50 Senate, Democrats are boxed in by the GOP boycott,” Sarah Binder, a professor at George Washington University and an expert on Senate rules, told The American Prospect.",
    "They’ve threatened in the Senate Commerce Committee to block Gigi Sohn, a nominee to the Federal Communications Commission, and Alvaro Bedoya, a nominee for the Federal Trade Commission.",
    "“Important questions about Ms. Raskin’s use of the ‘revolving door’ remain unanswered largely because of her repeated disingenuousness with the Committee,” Toomey said in a statement.",
    "Senate Republicans are digging in on their obvious plan to shut the Senate down as much as possible from now until November, when they hope to regain the Senate in the 2022 midterms.",
    "Democrats have advanced some nominees who have had tied votes in committee to the floor with discharge petitions, but that requires 60 votes in the full Senate under current rules.",
    "Every part of it is egregious, from flirting with shutting down the government to slow-walking noncontroversial legislation to denying President Joe Biden his appointments.",
    "Sen. Pat Toomey (R-PA) has cooked up a vague charge of potential corruption stemming from her time on the board of Reserve Trust, a Colorado-based fintech company.",
    "The other option is for Speaker Nancy Pelosi and Schumer to decide on a schedule for adjourning both chambers so that Biden could make recess appointments.",
    "Because they’re all out there screaming about inflation every day, and as Sen. Jon Tester (D-MT) points out, who is responsible for dealing with that?",
    "They had that vote, but can’t move the nominees to the floor because there were no Republicans present, and thus no quorum, when the vote was taken.",
    "It was granted a Federal Reserve master account while she was on the company’s board of directors after she had served at the Treasury Department.",
    "Because there’s nothing Republicans are more concerned about than the appearance of impropriety and influence peddling in president appointments.",
    "“Allowing quorum denial to block or delay will lead to ongoing dysfunction and stymie popular initiatives to push back against corporate power.",
    "On Tuesday, Sen. Mark Kelly (D-AZ) had to leave town because his wife, former Rep. Gabby Gifford, had to be hospitalized with appendicitis.",
    "How Democrats proceed with this is going critical beyond the Fed because Republicans are threatening to deploy the tactic further.",
    "Democrats voted yes en bloc for all five nominees, though Warren asked that she have a recorded “no” vote for Powell individually.",
    "In November, they successful tanked the nomination of Biden’s pick for Deputy Small Business Administration chief, Dilawar Syed.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "That’s not ideal, but neither is having so many vacancies and giving Republicans free rein to stymie Biden and the Democrats.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "“If Toomey gets his way on this, it’s the way they will stop nominee after nominee after nominee,” he told reporters.",
    "She is also married to Rep. Jamie Raskin, the Maryland Democrat who served as manager for Trump’s second impeachment.",
    "Those terms for any recess appointee would last until the end of the next legislative session, so through 2023.",
    "She would be the Fed’s next vice chair for supervision, one of the most powerful bank regulators in the world.",
    "Obviously, all 50 Democrats not only have to be on board with making that change, they have to be present.",
    "Sinema is on the Banking Committee and did stick with the rest of the Democrats in their symbolic vote.",
    "Sen. Ben Ray Luján (D-NM) remains out for at least a couple of weeks while he recovers from a stroke.",
    "But there’s no guarantee that they wouldn’t abet Republicans on this in the name of bipartisanship.",
    "Then the presiding officer would rule that yes, under the current rules, the Republican was right.",
    "Make no mistake: hardworking American families will pay the price for these political games.",
    "“I hear Republicans every day talk about inflation,” Tester said at the boycotted markup.",
    "Then the Democrats would appeal the ruling of the chair and have a vote on doing so.",
    "It's probably going to take all four of them to fight the latest Republican tactic.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Abiding these tactics cannot be an option.”\nThis is a short blurb about Daily Kos.",
    "This whole fiasco completely exposes Republicans’ ever-present hypocrisy as well.",
    "Committee Chair Sherrod Brown (D-OH) shot that talking point down Wednesday.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "“They think they’re calling the shots here, with a Democratic majority?",
    "“What group is out there to deal with market forces better than anyone?",
    "It’s going to take a rule change on the floor for Democrats to stop it.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "“She responded,” to Republican questions already, Brown said.",
    "One way to do so would be the “nuclear option” on the floor.",
    "She doesn’t remember everything from five and 10 years ago.",
    "He’s demanded she answers more questions from Republicans.",
    "Right now, leadership isn’t in a position to try it.",
    "The duration of his absence is unclear right now.",
    "Raskin is the ostensible reason for this boycott.",
    "[Toomey] doesn’t like the answers.",
    "Joe Manchin and Kyrsten Sinema.",
    "That rule will have to change.",
    "“189 questions she answered.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Sorry,” he added.",
    "Please read it.",
    "The Fed."
  ]
}