{
  "id": 14082,
  "mediaId": 2695,
  "date": "2022-03-16",
  "headline": "Senate votes to end TSA mask requirements, White House promises veto",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTU0Nzg5My9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwMDU3MDk5N30.6CBm-w3DA6Q1VFXDhgKmxy9_I4iWQFDzEOm8RpOKL24/img.jpg?width=1200&coordinates=0%2C118%2C0%2C83&height=600",
  "link": "https://www.theblaze.com/news/senate-votes-to-end-tsa-mask-requirements-white-house-promises-veto",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Pandolfo",
  "authorUrl": "https://www.theblaze.com/u/christopherpandolfo",
  "termIds": [
    0
  ],
  "sentences": [
    "), the ranking Republican on the Senate Committee on Commerce, Science, and Transportation, said the Biden administration's decision to extend the mask mandate doesn't make sense given that COVID-19 restrictions almost everywhere in the country are coming down.",
    "“People can sit shoulder to shoulder in restaurants across the land now, without a mask, they can go to shopping centers, they can go to malls — everywhere but an airport, which looks a lot like a shopping mall to me,” Wicker said, according to Roll Call.",
    "Last week, the Transportation Security Administration said that in accordance with recommendations from the U.S. Centers for Disease Control and Prevention, masking requirements for public transportation would be extended through April 18.",
    "White House issues expected veto notice for GOP vote to repeal transit mask mandate: \"The determination of the timeline and circumstances under which masks should be required in these settings should be guided by science, not politics.\"",
    "White House issues expected veto notice for GOP vote to repeal transit mask mandate: \"The determination of the timeline and circumstances under which masks should be required in these settings should be guided by science, not politics.\"",
    "A measure introduced by Sen. Rand Paul (R-Ky.) to use the Congressional Review Act to revoke the Biden administration's public health requirements received bipartisan support, but provoked a veto threat from President Joe Biden.",
    "According to CNN reporter Ali Zaslav, an aide in Romney's office said he voted against the repeal because he believes its the responsibility of public health officials to make these kinds of decisions, not politicians.",
    "— Nathaniel Weixel (@Nathaniel Weixel) 1647380758\nAfter the vote, Paul said the Senate had \"sent a message to unelected government bureaucrats to stop the anti-science, nanny state requirement of travel mask mandates.\"",
    "According to the Federal Aviation Administration, since January 2021 there have been a record 6,800 unruly passenger incidents reported, the vast majority of which involve are related to face masks.",
    "\"The determination of the timeline and circumstances under which masks should be required in these settings should be guided by science, not politics,\" the White House said in a statement.",
    "), Jacky Rosen (D-Nev.), Catherine Cortez Masto (D-Nev.), Michael Bennet (D-Colo.), Kyrsten Sinema (D-Ariz.), Mark Kelly (D-Ariz.), Joe Manchin (D-W.Va.), and Maggie Hassan (D-N.H.).",
    "Despite this strong bipartisan showing, it remains to be seen whether House Speaker Nancy Pelosi (D-Calif.) will take up the measure in the House of Representatives.",
    "Critics have questioned the need for the requirements given that CDC guidance says 98% of Americans live in places where it is safe to take off masks indoors.",
    "Mask requirements on airplanes are unpopular and have led to incidents where passengers refuse to wear face coverings and, at times, are ejected from flights.",
    "— Nathaniel Weixel (@Nathaniel Weixel) 1647380758\nThe repeal vote did not have enough support to overturn a hypothetical presidential veto.",
    "The U.S. Senate on Tuesday voted 57-40 to overturn federal mask requirements on airplanes and other forms of public transportation.",
    "Even if the repeal were to pass the House, the White House put Congress on notice that the president would veto it.",
    "At a news conference before the vote, Republican senators led by Sen. Roger Wicker (R-Miss.",
    "Eight Senate Democrats joined Republicans to repeal the masking requirements — Sens.",
    "Sen. Mitt Romney (R-Utah) was the lone Republican vote against the measure.",
    "The mandate would have expired on Friday.",
    "Jon Tester (D-Mont."
  ]
}