{
  "id": 14245,
  "mediaId": 2518,
  "date": "2022-03-17",
  "headline": "Do more, Zelenskyy implores",
  "image": "https://wehco.media.clients.ellingtoncms.com/img/photos/2022/03/16/1AZelenskyy_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676",
  "link": "https://www.arkansasonline.com/news/2022/mar/17/do-more-ukrainian-implores/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Beyond the military demands, Zelenskyy called for new economic actions against Russia, including closing American ports to all Russian goods, pressuring U.S. companies still doing business in Russia to withdraw, and imposing sanctions on \"all politicians in the Russian Federation who remain in their offices and do not cut ties with those who are responsible for the aggression against Ukraine.\"",
    "The Biden administration worked with allies to implement a wide-ranging sanctions package in the immediate aftermath of the Russian invasion on Feb. 24, including effectively ending a major gas pipeline into Central Europe, freezing much of Russia's foreign currency reserves, and imposing sanctions specifically on Putin, his inner circle and dozens of oligarchs.",
    "WASHINGTON -- Ukrainian President Volodymyr Zelenskyy, addressing Congress on Wednesday from a capital being attacked by Russian artillery fire and missiles, delivered a stark new plea for American military aid, making a moral case to hundreds of gathered lawmakers that the world's preeminent superpower must do more to prevent his nation's destruction.",
    "Since then, Biden has moved under congressional pressure to ban Russian oil and gas imports to the United States and to strip Russia of trade preferences it has enjoyed for a decade, which would impose new tariffs on its imports to the U.S.\nCongress is negotiating legislation that would enshrine those trade actions into law.",
    "In a 16-minute presentation before Congress from Ukraine's capital, Kyiv, Zelenskyy likened Russia's three-week onslaught to Japan's World War II air assault on Pearl Harbor, when \"your sky was black from the planes attacking you,\" and to Sept. 11, 2001, when \"innocent people were attacked from the air.\"",
    "Three-quarters of Americans said the United States should do whatever it can to help Ukraine without risking a direct war between the United States and Russia, while 17% said the country should do whatever it takes, even if it means war, according to a Quinnipiac University poll released Wednesday.",
    "They included transferring surface-to-air missile systems and aircraft to Ukraine, further cracking down on Russian trade, and imposing sanctions on a much wider range of Russian political leaders, including all members of the State Duma, the lower house of the national legislature.",
    "He called on them to layer potent air-defense systems and new Russian financial sanctions on top of the military transfers, humanitarian aid and economic salvos that the United States has already delivered since Russia began bombarding Ukrainian cities last month.",
    "\"I understand the need from the Ukrainian perspective,\" said Sen. Lindsey Graham, R-S.C. \"But when the president and his team indicate that that would be an escalation that would involve the potential conflict between NATO members and Russia, he's right.\"",
    "\"I want to give them what they need,\" he said, but \"you're advocating taking airplanes from another country who is bordering a country that's at war, taking one-third of their fighter air force and giving them to a country that might not be using them.\"",
    "Information for this article was contributed by Seung Min Kim, Ashley Parker, Emily Guskin, Eugene Scott and Mike DeBonis of The Washington Post; Catie Edmondson and Michael D. Shear of The New York Times; and staff members of The Associated Press.",
    "\"This is a struggle that pits the appetites of an autocrat against humankind's desire to be free, and let there be no doubt, no uncertainty, no question: America stands with the forces of freedom,\" he said, naming Russian President Vladimir Putin.",
    "In his final words, Zelenskyy addressed President Joe Biden, who was not present with the hundreds of lawmakers who crowded into a movie-theater-style auditorium in the bowels of the Capitol Visitor Center to hear Zelenskyy speak by video link.",
    "Rob Portman, R-Ohio, said that the additional military assistance Biden announced Wednesday is welcome but that he wanted to hear more details on how the military aid would be delivered in time to make a difference on the ground in Ukraine.",
    "Republicans who have spent weeks calling on the Biden administration to do more amplified those calls Wednesday, saying the United States should act posthaste to get jets and other weapons systems to Ukraine, and many Democrats joined them.",
    "Many lawmakers are continuing to push for transfer of the Polish MiGs to Ukraine, including Graham, who introduced a resolution Wednesday backing the move and said it would represent \"a shot in the arm\" for Ukraine and \"a blow to Putin.\"",
    "On Wednesday, however, Zelenskyy first mentioned surface-to-air missile systems -- the \"S-300 and other similar systems,\" referring to a Soviet-era system that is operated by a handful of NATO countries -- before asking for more planes.",
    "A White House official said the administration is \"continuing to work with our allies and key partners to surge new assistance, including Soviet- or Russian-origin antiaircraft systems and the necessary ammunition to employ them.\"",
    "After the speech, he signed an order providing for the transfer of an additional $800 million in materiel from U.S. arsenals to Ukraine, bringing the total American military commitment to roughly $2 billion over the past year.",
    "But emotional appeals from Zelenskyy did not persuade Congress on a no-fly zone, which lawmakers and administration officials have broadly warned could spiral into a broader conflict directly involving U.S. forces.",
    "He called for new sanctions to be imposed \"constantly, every week, until the Russian military machine stops,\" demanding a complete Western withdrawal from the Russian economy \"because it is flooded with our blood.\"",
    "Zelenskyy's presentation was punctuated by a graphic two-minute video that opened with tranquil scenes of Ukrainian life before the invasion, then graphic scenes of the Russian bombardments and its consequences.",
    "But when asked about whether the U.S. military should shoot down Russian military planes flying over Ukraine or not, the definition of a no-fly zone, opposition rose to 49% and support was 20%.",
    "Some attendees were moved to tears by the video, according to those leaving the auditorium after the speech, and many said the images made a powerful case for further American intervention.",
    "\"I do think we need to provide them with much more robust air defense, drones, planes, antiaircraft batteries -- all of the technology that we have available that is defensive,\" he added.",
    "\"Not a muscle moved, not a voice -- just absolutely riveting,\" said Sen. Richard Blumenthal, D-Conn., who was among a delegation of senators who traveled to Ukraine's border with Poland.",
    "\"At the request of President Zelenskyy,\" he said, \"we have identified and are helping Ukraine acquire additional longer-range antiaircraft systems and the munitions for those systems.\"",
    "Poland last week publicly offered to deliver Soviet-era MiG fighters to an American air base in Germany, putting the burden on the United States to transfer them into Ukrainian hands.",
    "\"We don't need them just to lose more slowly, we need them to win, and to win, they need to kill Russians, and to kill Russians, they need more weapons,\" said Sen. Ben Sasse, R-Neb.",
    "Set to string music, the video depicted parents crying as they kiss their children, wounded Ukrainians in hospital beds, children in tears, and bloodstained sheets over corpses.",
    "\"You are the leader of the nation, of your great nation -- I wish you to be the leader of the world,\" he said, speaking in English after giving most of his address in Ukrainian.",
    "Martin Luther King Jr. -- \"I have a dream\" -- as he urged the United States to help him fight Russia's aircraft, saying, \"I have a need\" to protect the sky from Russian attacks.",
    "Some Republicans have criticized Biden for insisting on acting in concert with European allies, and several said after Zelenskyy's speech that Biden simply needed to do more.",
    "The new order, Biden said, would allow for the transfer of 800 antiaircraft missiles, 9,000 antitank rounds, 7,000 small arms and roughly 20 million rounds of ammunition.",
    "According to an Economist/YouGov poll from this week, 38% of U.S. citizens said enforcing a no-fly zone over Ukraine was a \"good idea\" and 27% said it was a \"bad idea.\"",
    "Speaking Wednesday afternoon, Biden called Zelenskyy's address \"convincing\" and \"significant\" but gave no indication that he has changed his views on those matters.",
    "Citing the risk of sparking \"World War III,\" Biden has ruled out a U.S.-enforced no-fly zone and has paused plans to transfer Soviet-era fighter jets to Ukraine.",
    "Zelenskyy reiterated a call for a Western-enforced no-fly zone, but he quickly moved on to other specific requests that have gained wider support in Washington.",
    "\"We have a responsibility to ensure that this conflict, this war, doesn't escalate beyond Ukraine,\" he said after a meeting of NATO member defense ministers.",
    "The Pentagon declined the offer after concluding that the risk of provoking a further escalation with Russia outweighed the planes' potential benefit.",
    "Biden declared, however, that the U.S. and allies would \"stay the course\" and \"do everything we can to push for an end this tragic, unnecessary war.\"",
    "Sen. Mark Kelly, D-Ariz., a former Navy pilot, said he was concerned by reports that Ukraine was not using the jets it already has in its inventory.",
    "That did not stop Zelenskyy from repeating his request after initially calling for the planes in a private March 5 call with members of Congress.",
    "While other world leaders have used those words, the White House had been hesitant to do so, saying it was a legal term that required research.",
    "\"You know how much depends on the battlefield on the ability to use aircraft ... to protect our people, our freedom, our land,\" he said.",
    "NATO Secretary General Jens Stoltenberg reiterated Wednesday that the alliance would play no role in establishing a no-fly zone.",
    "Zelenskyy, he said, made the case that \"we have an opportunity and obligation to take much more forceful action.\"",
    "Both Biden and Zelenskyy denounced Russia's apparent widespread attacks on civilian and humanitarian targets.",
    "Zelenskyy played a video of the carnage inside Ukraine as he sought to push lawmakers to further action.",
    "\"Russia has turned the Ukrainian sky into a source of death for thousands of people,\" Zelenskyy said.",
    "\"I see no sense in life if it cannot stop the deaths,\" Zelenskyy said during the end of his speech.",
    "\"You know that they exist and you have them, but they are on earth, not in the Ukrainian sky.\"",
    "Key Capitol Hill negotiators said Wednesday that a deal could be struck as soon as this week.",
    "\"The burden of proof should be on us about why we wouldn't supply everything they need.\"",
    "Biden did not mince words Wednesday: \"He's a war criminal,\" the president said of Putin.",
    "Biden appeared to heed the call for new, more potent missiles in his remarks Wednesday.",
    "\"Russian troops have already fired nearly 1,000 missiles at Ukraine, countless bombs.",
    "But Biden noted that Russian troops had bombed hospitals and held doctors hostage.",
    "Right now, they have encountered a reign of terror in the skies.\"",
    "\"Being the leader of the world means to be the leader of peace.\"",
    "\"It's about doing things more quickly and being more creative.\"",
    "The video ended with the words: \"Close the sky over Ukraine.\"",
    "\"Ukrainians can win a fair fight on the ground.",
    "\"Peace is more important than income,\" he said.",
    "They use drones to kill us with precision.\"",
    "\"It's not just about money,\" he said.",
    "\"This is a murder,\" a caption read.",
    "He borrowed a phrase from the Rev.",
    "\"We always have.",
    "We always will.\"",
    "Sponsor Content",
    "Sen."
  ]
}