{
  "id": 1514,
  "mediaId": 8355,
  "date": "2022-02-11",
  "headline": "'Finally': Tuskegee Airmen honored 73 years after competition win was 'swept under the rug'",
  "image": "https://www.gannett-cdn.com/presto/2022/02/10/USAT/23beb4f5-15de-42b4-8e5e-75602a4ac31c-1949_Meet_Winners_with_Trophy_CREDIT_U.S._Air_Force.png?crop=2001,1126,x0,y0&width=2001&height=1126&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/nation/2022/02/11/tuskegee-airmen-honored-73-years-after-winning-air-force-contest/6718483001/",
  "mediaOutlet": "lavozarizona.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christine Fernando",
  "authorUrl": "https://www.usatoday.com/staff/5382959002/christine-fernando/",
  "termIds": [
    0
  ],
  "sentences": [
    "Wagenlander said he hopes people will see the plaque and remember the racism the Tuskegee Airmen faced and the obstacles they overcame “while proving they were the best.”\n“This was an important moment for our collective history as a country, for the Air Force's history and for the legacy of the Tuskegee Airmen,” he said.",
    "During the war, the Tuskegee Airmen, nicknamed the “Red Tails” for painting the tails of their aircrafts bright red, shot down 112 enemy aircrafts and destroyed 150 aircrafts on the ground, as well as 600 railroad cars and 40 boats, according to the National Museum of the U.S. Air Force.",
    "“Plus, we had plenty of incentive.”\nBefore they left for Las Vegas, their commander, Gen. Benjamin O. Davis Jr., who Harvey said was known for being strict, told them: “If you don’t win, don’t come back.”\nBut the 332nd Fighter Group’s competitors didn’t expect much.",
    "Almost 18 years later, AARP’s Wish of a Lifetime program, which grants the lifelong wishes of older adults, reached out to ask living Tuskegee Airmen what they wished for, said Tom Wagenlander, the program’s executive director.",
    "Meanwhile, his teammates were flying the “obsolete” P-47 Thunderbolt, though Harvey says “it’s the skill of the pilot, not the aircraft that matters most.”\n“We weren't supposed to win it, according to them,” Harvey said.",
    "The 332nd Fighter Group, better known as the Tuskegee Airmen, made history in 1949 as winners of the first Top Gun contest, a gunnery competition that drew top pilots from across the Air Force.",
    "You go out and do what you have to do.”\nHarvey’s competitors also flew more advanced aircrafts: the P-51 Mustang and P-82 Twin Mustang, according to an AARP documentary released Friday.",
    "Alva Temple, 1st Lt. Harry Stewart, 1st Lt. Halbert Alexander and Harvey — competed in aerial gunnery, panel strafing, dive bombing, skip bombing and rocket firing events, Harvey said.",
    "There's nothing like it.”\nAfter completing combat training in April 1945, Harvey joined the Tuskegee Airmen, the now-legendary group of Black pilots who served during World War II.",
    "“People will look at it and know who won.”\nGen. Mark Kelly, commander of Air Combat Command, presided over the unveiling of the plaque, according to an Air Force statement.",
    "“We immediately saw it as an opportunity to right this wrong after so many years.”\nOn Jan. 11, a plaque was mounted at Nellis Air Force Base to honor the group’s win.",
    "And in 2004, a historian discovered the trophy in storage and pushed for it to be put on display at the National Museum of the U.S. Air Force, the documentary said.",
    "The hotel the pilots were staying in was segregated, and its owners had only begrudgingly allowed them to stay because they were part of an Air Force competition.",
    "Set your sights high, always.”\nContact News Now Reporter Christine Fernando at cfernando@usatoday.com or follow her on Twitter at @christinetfern.",
    "After the competition, Harvey flew 126 combat missions in the Korean War and retired from the Air Force in 1965, according to the documentary.",
    "“Our victory was swept under the rug,” retired Lt. Col. James Harvey III, former fighter pilot with the 332nd Fighter Group, told USA TODAY.",
    "“We realized quickly that we needed to tell people about this, and we needed to find a way to commemorate this win officially,” he said.",
    "Harvey had one wish: for the 332nd Fighter Group to be officially recognized for winning the 1949 USAF First Aerial Gunnery Competition.",
    "The plaque \"is 73 years late,\" the statement said, but it will be \"displayed prominently at the U.S. Air Force Weapons School forever.\"",
    "“We stand on the shoulders of giants in this profession, and Lt. Col. Harvey is one of those giants,” Kelly said in the statement.",
    "He practiced a maneuver until it was perfect, dead set on “being the best at what I did.” Most of all, he simply loved flying.",
    "A team of four highly-skilled Tuskegee pilots was sent to Las Vegas for the first USAF Aerial Gunnery Competition in 1949.",
    "Soon after, he was in Tuskegee, Alabama, at a flying school built for Black pilots in the then-segregated U.S. Air Force.",
    "A photographer snapped a photo, and the Tuskegee Airmen’s trophy was hidden from public view for 55 years, Harvey said.",
    "A photographer snapped a single photo of the team with its trophy, which was left in storage for 55 years afterward.",
    "“If you believe in something and set out on a mission to correct something that was wrong, don't give up,” he said.",
    "As a high schooler, Harvey watched from his front yard as four P-40 fighter planes flew in formation above him.",
    "“It's been 73 years, and we finally got that recognition.”\n“The plaque will finally tell our story,” he added.",
    "Harvey was drafted into the army and sent to Fort Belvoir in Virginia to help build airfields, he said.",
    "Harvey said he hopes his story encourages others to aim for their goals, despite what others may say.",
    "So the Wish of A Lifetime team started making calls to Air Force officials, Wagenlander said.",
    "“By any measure, the Tuskegee project proved a resounding success,” according to the museum.",
    "But he quickly realized the work wasn’t for him and decided to apply for cadet training.",
    "“We as a race weren't supposed to be able to do anything, except maybe sing and dance.",
    "The AARP produced a 10-minute documentary on the journey toward that recognition.",
    "We came here to win, and we won.”\nBut they did nothing to celebrate the victory.",
    "“It's great to see it finally on display now, where it should be,” Harvey said.",
    "Harvey said there was not much to do besides head back to their hotel rooms.",
    "In that moment, he decided he wanted to be an Air Force pilot.",
    "But when their names were announced, the room remained quiet.",
    "“They didn't see us as legitimate competitors,” Harvey said.",
    "We waited for this 73 years, and it finally paid off.",
    "“Flying is something you can't explain,” he said.",
    "“You have to experience it to really understand.",
    "“And the rest is history,” said Harvey, now 98.",
    "Harvey describes himself as a perfectionist.",
    "“We knew we were gonna win,” Harvey said.",
    "But you don't pay any attention to that.",
    "“Finally,” Harvey said.",
    "There was no applause.",
    "The pilots — Capt.",
    "That's about it.",
    "“But we won it.",
    "“Stay with it."
  ]
}