{
  "id": 15306,
  "mediaId": 8475,
  "date": "2022-03-07",
  "headline": "White House allows Ukrainian nationals to stay in the U.S. without fear of deportation",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/030722_Alejandro_Mayorkas.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/nationworld/report/030722_ukrainian_nationals_deportation/white-house-allows-ukrainian-nationals-stay-us-without-fear-deportation/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ariana Figueroa",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/82081",
  "termIds": [
    0
  ],
  "sentences": [
    "“As a nation, we must do our part to protect the safety of Ukrainians in the United States by designating Ukraine for TPS.”\nOther senators who signed the letter include Democrats Tim Kaine and Mark Warner of Virginia, Ron Wyden of Oregon, Ben Cardin and Chris Van Hollen of Maryland, Sherrod Brown of Ohio, Amy Klobuchar and Tina Smith of Minnesota, Jeanne Shaheen and Maggie Hassan of New Hampshire, Michael Bennett and John Hickenlooper of Colorado, Tammy Baldwin of Wisconsin, Cory Booker of New Jersey, Gary Peters and Debbie Stabenow of Michigan, Catherine Cortez Masto and Jacky Rosen of Nevada, Mark Kelly and Kyrsten Sinema of Arizona, Raphael Warnock of Georgia and Martin Heinrich of New Mexico.",
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nIn a letter to the White House, a bipartisan group of 42 senators advocated for the TPS designation, arguing that “it is obviously too dangerous for Ukrainian nationals to return to Ukraine due to the ongoing armed conflict.”\nSenators who led the letter include Illinois Democrat Dick Durbin, chair of the Senate Judiciary Committee; Menendez; and Ohio Republican Rob Portman, top GOP member of the Senate Homeland Security and Governmental Affairs Committee.",
    "Sen. Bob Menendez, a New Jersey Democrat and chair of the Senate Foreign Relations Committee, said in a statement that the TPS designation was the right thing to do “after a week of Vladimir Putin’s illegal and ruthless war against the people of Ukraine.”\n“Temporary Protected Status was created by Congress for exactly this purpose — to protect people whose home countries have experienced armed conflict, an environmental disaster, or extraordinary conditions that prevent people from safely returning home,” he said.",
    "Lisa Parisio, the Director of Advocacy at the Catholic Legal Immigration Network, said in a statement that the Biden administration should also use TPS for “Ethiopia, Cameroon, Mauritania and other countries whose nationals face grave danger if they are forced to return.”\n“The backlog of TPS designations for Black-majority countries here in the U.S. mirrors the anti-Blackness we’re seeing as African students and others in Ukraine are denied access to escape the conflict,” she said.",
    "A letter, led by Rep. Jimmy Gomez, a California Democrat, and signed by 98 members urged the president to extend both TPS and the student program for 18 months because “given the already unmet humanitarian need in the country and the effects of the armed conflict with Russia, the Ukrainian government is in no state to receive TPS and SSR eligible Ukrainians.”\nThanks for reading TucsonSentinel.com.",
    "SSR would allow for the temporary suspension of certain requirements put in place by DHS for a foreign student studying in the U.S. “from parts of the world that are experiencing emergent circumstances.” Some of those requirements include “duration of status, full course of study and off-campus employment eligibility.”\nRussia began its invasion into Ukraine on Feb. 24.",
    "“In these extraordinary times, we will continue to offer our support and protection to Ukrainian nationals in the United States.”\nUkrainians living in the U.S. as of March 1 of this year will be eligible for TPS designation of up to 18 months; it will not apply to Ukrainians arriving after March 1.",
    "“Russia’s premeditated and unprovoked attack on Ukraine has resulted in an ongoing war, senseless violence, and Ukrainians forced to seek refuge in other countries,” DHS Secretary Alejandro Mayorkas said in a statement.",
    "The U.S. Department of Homeland Security is granting Temporary Protected Status that will shield Ukrainian nationals living in the United States from deportation, following pressure from members of Congress.",
    "The White House is also asking Congress to approve $10 billion in aid for Ukraine to help bolster soldiers in neighboring countries around Ukraine and to send military equipment to the country.",
    "“Forcing Ukrainian nationals to return to Ukraine in the midst of a war would be inconsistent with America’s values and our national security interests,” they wrote.",
    "Some states with the highest populations of Ukrainians without permanent status include Illinois, Michigan, Pennsylvania, Florida and New Jersey.",
    "The Center for Migration Studies in New York estimates that there are about 28,000 Ukrainians in the U.S. that would benefit from the program.",
    "Some legal groups agreed with the TPS designation, but criticized DHS for its backlog of TPS designation for Black-majority countries.",
    "CLINIC, along with nearly 200 organizations, petitioned for the Biden administration to allow Ukrainians in the U.S. to use TPS.",
    "U.S. House lawmakers are also pushing the Biden administration to immediately designate Student Special Relief for Ukrainians.",
    "The Biden administration has announced it would place sanctions on Russia’s President Vladimir Putin and the country as well.",
    "TPS does not grant permanent U.S. status and only applies to those already in the country, not those who are fleeing.",
    "The designation will allow those in the program to be protected from deportation, as well as apply for work permits.",
    "Ukraine’s health ministry reported that at least 250 civilians have been killed in the attack.",
    "Members of Congress praised the Biden administration for the TPS designation for Ukrainians.",
    "One million people have left Ukraine, according to the United Nations Refugee Agency.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "- 30 -"
  ]
}