{
  "id": 15519,
  "mediaId": 2553,
  "date": "2022-03-10",
  "headline": "Abortion Is The Crux Of 2022 Elections, Major Pro-Life Group Predicts — And They’re Marshaling All Forces To Win That Battle",
  "image": "https://dw-wp-production.imgix.net/2022/03/Screen-Shot-2022-03-10-at-4.36.42-PM.png?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/abortion-is-the-crux-of-2022-elections-major-pro-life-group-predicts-and-theyre-marshaling-all-forces-to-win-that-battle",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Margaret Olohan",
  "authorUrl": "https://www.dailywire.com/author/mary-margaret-olohan",
  "termIds": [
    2459,
    3453,
    3295,
    4905,
    1489,
    1271,
    1126,
    5949
  ],
  "sentences": [
    "“And it’s possible that it’s culminating this summer right before midterms, at a moment where the Republican Party has come very far in terms of its embrace of the issue.”\n‘Vulnerable Pro-Abortion Senators’\nThis will be the first time in 50 years where the consequences of voting for a pro-abortion politician are real rather than theoretical, Dannenfelser said, noting that the results of the 2022 midterm elections will predict which states pass aggressive pro-life laws, and which don’t.",
    "The memo is backed by Republican Glenn Youngkin’s victory in Virginia: Youngkin, who leaned hard on education issues, notably tore into opponent Terry McAuliffe for saying that parents shouldn’t “be telling schools what they should teach.”\nThough McAuliffe spent millions accusing his Republican opponent of harboring a “far right” abortion agenda, Youngkin still won the vote of Virginians who prioritized abortion.",
    "To that end, from now until November, the SBA List is launching campaigns across the country to “expose the extremism of vulnerable pro-abortion Senators.”\nThe pro-life organization boasts of a massive $72 million 2022 election cycle budget — and it is zeroing in on Sen. Mark Kelly, targeting the Arizona Democrat with a $1 million ad campaign highlighting Kelly’s abortion stances.",
    "The Women’s Health Protection Act would also prohibit the government from mandating that abortion providers provide “unnecessary medical procedures” or “medically inaccurate information” — such as requiring a doctor to show a woman an ultrasound or her unborn baby or tell a woman that she can use “abortion pill reversal” drugs if she changes her mind after the abortion.",
    "“Chemical abortion and transportation of people to get abortions in other states is the future for them.”\nInternal messaging released in February from the Democratic Congressional Campaign Committee warned that Democrats will severely suffer if they do not learn to better combat “alarmingly potent” culture war attacks from Republicans.",
    "Legal abortion is gone.”\nBut if Roe is overturned, “it just means that people get a say,” she added, “finally, they get their say after 50 years of debate and growing this incredible movement over time.”\nDemocrats Struggle To Message On Abortion\nAbortion advocates will not go down without a fight, the SBA List president warned.",
    "Arizonans Oppose Abortion Legislation — When They Understand It\nSBA List’s campaign against Kelly is accompanied by polling conducted by CRC Research showing that more than half of registered Arizona voters oppose the Women’s Health Protection Act after learning that the legislation entails.",
    "The midterm elections fall in the shadow of Dobbs v. Jackson Women’s Health Organization, the Supreme Court case involving a 2018 Mississippi law banning abortions after 15 weeks, addressing whether bans on abortion before fetal viability are constitutional.",
    "SBA List calls it the “Abortion on Demand Until Birth Act,” as the legislation prohibits governmental restrictions on abortion, specifically banning the government from limiting an abortion provider’s ability to prescribe abortion drugs and offer abortions.",
    "Only 27% of Arizona voters believe the state should allow abortion up until birth, according to the poll, conducted both online and over the phone between February 22 and February 25 on behalf of the Susan B. Anthony List with a margin of error of ± 3.7%.",
    "One of the most powerful pro-life organizations in the country is marshaling all its resources to combat abortion extremism heading into the 2022 midterm elections — and its leaders predict that the life issue will be a much bigger deal than expected.",
    "In light of this win, Democratic strategists have warned that abortion may not be a winning issue for Democrats heading into 2022, Politico reported in December — and some strategists are advising their clients not to discuss abortion at all.",
    "“And if I were a political consultant, I would want to be going for consensus, not extremism.”\nThe Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "But the education on so many like Mark Kelly is buried.”\nThough polling shows that Americans are on board with Roe v. Wade, the vast majority of Americans don’t understand what the Supreme Court decision actually means, Dannenfelser said.",
    "“I think what we’re seeing is an uncharacteristic discipline to not say a lot right now, because I think that they see that they’re on the ropes, that the so-called abortion right is in jeopardy,” she said.",
    "And more than half (59%) of Arizona voters believe that the state should limit abortions after 15 weeks of pregnancy (a measure which the Arizona legislature is currently debating), according to the poll.",
    "That polling also found that 56% of independent voters and 27% of Democratic voters were less likely to vote for Kelly after being told that he believes taxpayers should fund abortions up until birth.",
    "SBA List’s campaign centers around Kelly’s vote for the radically expansive Women’s Health Protection Act, legislation bolstered by President Joe Biden’s administration.",
    "“I don’t generally agree with Democratic consultants, but you know, I think sometimes the Democratic consultants are smarter than the Republican consultants like that.",
    "The pro-life organization boasts of a massive $72 million 2022 election cycle budget — and it is starting by zeroing in on Democratic Arizona Sen. Mark Kelly.",
    "'”\nThe difference, she said, is that Democrats are set in cement on abortion extremism, while Republicans are hoping for consensus in every state.",
    "And that’s what they think Roe is.”\nProgressive messaging on Roe v. Wade is the “best run PR campaign” ever conducted, Dannenfelser joked grimly.",
    "The Republican consultants that are smart are saying, ‘This is a moment to not be afraid, to not go back on your heels, to lean into this thing.",
    "“We’re looking at a decision that’s been in the making for almost 50 years that has only grown, not diminished over time,” Dannenfelser said.",
    "“The context is historic,” Susan B. Anthony List President Marjorie Dannenfelser said in a phone interview with The Daily Wire.",
    "“Every time we polled this throughout the years, they like Roe, but they are for laws that Roe doesn’t allow,” she said.",
    "“The abortion lobby wants everybody to think that overturning Roe takes legal abortion away,” she said.",
    "Should Roe v. Wade be overturned, the power to decide abortion laws would be returned to the states.",
    "“We could have gone after Warnock,” Dannenfelser said of Democratic Georgia Sen. Raphael Warnock.",
    "“And they’re smart.”\n“There is no chance they’re rolling over,” Dannenfelser added.",
    "It directly challenges the Supreme Court’s monumental Roe v. Wade decision.",
    "Kelly did not immediately respond to The Daily Wire’s request for comment.",
    "“Generally, Americans are for protecting abortion in the first trimester.",
    "We understand, and a lot of people understand [his abortion record].",
    "It does not specify any point at which abortion may be restricted.",
    "“So you’ve got consensus versus abortion extremism,” she said.",
    "We obviously don’t agree with that, but that’s where they are.",
    "Get inside access to The Daily Wire by becoming a member.",
    "“I think with him, we’re already several strides ahead.",
    "Create a free account to join the conversation!",
    "“I do agree with that,” laughed Dannenfelser.",
    "“That’s very targeted,” Dannenfelser said.",
    "“That’s what they’re going to say."
  ]
}