{
  "id": 15511,
  "mediaId": 2718,
  "date": "2022-03-12",
  "headline": "‘Gabby Giffords Won’t Back Down’ Directors Talk Congresswoman’s ‘Inspiring’ Rehab From Brain Trauma (Video)",
  "image": "https://www.thewrap.com/wp-content/uploads/2022/03/2_GGWBD_Gabby-Biking.jpeg",
  "link": "https://www.thewrap.com/gabby-giffords-wont-back-down-directors-interview/",
  "mediaOutlet": "The Wrap",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Welk",
  "authorUrl": "https://www.thewrap.com/author/brian-welk/",
  "termIds": [
    2459,
    2056,
    5309,
    392
  ],
  "sentences": [
    "Who knew?”\nAll that remarkable footage was available to Cohen and West because Giffords’ husband, Mark Kelly, a former astronaut, was trained in how to operate a video camera while in space and thought to document his wife’s recovery far before they ever imagined a documentary would be in their future.",
    "Julie Cohen and Betsy West knew they had to make their movie “Gabby Giffords Won’t Back Down” about former U.S. congresswoman Gabrielle Giffords when, in their first video call with her, they saw that she and her husband, Sen. Mark Kelly, had kept a piece of her skull in a tupperware in their freezer.",
    "While many suffer from aphasia as a result of a stroke, Giffords’ condition was a result of the brain damage she suffered from her gun shot wound that very few ever survive, and “Won’t Back Down” features striking footage of Giffords’ early rehab work while still in the hospital.",
    "But it centers heavily on Giffords’ struggle with a speech condition known as aphasia, which is a language disorder in which a person is unable to understand or express speech, despite being able to think the words in your brain.",
    "“We were just dazzled really by Gabby in particular from that very first wonderful meeting.”\n“From the very moment we met Gabby, it was obvious she would make an incredible subject for a documentary,” West added.",
    "“You see in those early scenes when she’s first being able to speak and the therapist is singing the song, and how are you feeling, and her answer is, ‘Bad,’ and she smiles and everybody laughs.",
    "She also would find herself repeatedly using the word “chicken” in one therapy session, something that Giffords’ speech pathologists to this day don’t understand the root of.",
    "“They showed that to us early on and we immediately were like, that’s a scene in our film,” Cohen told TheWrap, even though in the moment, their documentary didn’t yet exist.",
    "“Gabby Giffords Won’t Back Down,” which premieres at SXSW on Saturday, discusses her early career, her fight for sensible gun control and her unique romance with Mark Kelly.",
    "The film demonstrates the constant effort she exerts to complete simple thoughts or recite speeches, even as she’s been determined to get back out on the campaign trail.",
    "She not only survived but has rehabilitated to be able to lead activist work on sensible gun control and help her husband win a senate seat.",
    "But Cohen and West’s (“RBG,” “Julia,” “My Name is Pauli Murray”) new documentary film shows Giffords is far more than just her accident.",
    "Among some of the more shocking details on her road to recovery were how Giffords was able to sing, yet still not speak clearly.",
    "Giffords was a rising star in the Democratic Party when in 2011 she was shot in the head during a mass shooting in Arizona.",
    "And in watching it, they were warmed at just how spirited and funny Giffords remains to this day.",
    "“Gabby Giffords Won’t Back Down” premieres at SXSW on Saturday before debuting on CNN+.",
    "She worked really hard and kept a sense of humor in some really difficult times.",
    "“We learned a ton about aphasia in the process of making this film,” Cohen said.",
    "See more from TheWrap’s interview with Julie Cohen and Betsy West above.",
    "It is pretty inspiring and fascinating to watch,” West said.",
    "But it just shows her whole approach to recovery.",
    "Many news outlets even declared her dead.",
    "Because of course, this is so tough.",
    "Right next to the empanadas.",
    "“As Gabby says, ‘The brain!"
  ]
}