{
  "id": 15611,
  "mediaId": 6497,
  "date": "2022-03-12",
  "headline": "‘Gabby Giffords Won’t Back Down’: Film Review | SXSW 2022",
  "image": "https://www.hollywoodreporter.com/wp-content/uploads/2022/03/Gabby-Giffords-FIENBERG-Still-SXSW-Publicity-H-2022.jpg?w=1024",
  "link": "https://www.hollywoodreporter.com/movies/movie-reviews/gabby-giffords-wont-back-down-review-1235109626/",
  "mediaOutlet": "Hollywood Reporter",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Fienberg",
  "authorUrl": "https://www.hollywoodreporter.com/author/daniel-fienberg/",
  "termIds": [
    0
  ],
  "sentences": [
    "You can hear it in President Obama’s voice, in Giffords’ fatigue, in how ideologically one-sided the talking heads are (as if it would be unfathomable for anybody with an “R” next to their name to say anything nice about Gabby Giffords at all), in how Kelly’s rival for the Senate seat still felt emboldened to smear Giffords’ foundation and Kelly’s involvement with it in their debates.",
    "I found it perplexing, for example, that one of Giffords’ stepdaughters appears at the beginning to recall their strained relationship before the shooting and then appears at the end to say that everything is better now, but is essentially absent for the rest of the documentary, leaving dots unconnected.",
    "And I don’t know if it’s the storyteller in me or the Jewish story watcher in me, but I found it perplexing that Giffords’ preparation for her bat mitzvah in late 2021 is treated as an afterthought rather than the sort of potent metaphor that very few documentarians get handed on such a silver platter.",
    "The new film, premiering at SXSW, focuses on a woman whose life and legacy are inherently more in-progress, which is triumphant in its own way, even if it results in a documentary that’s more structurally uneven than RBG — though perhaps more emotionally immediate.",
    "There are shades of Oliver Sacks in watching how, for example, music has been central to restoring her language skills, the connections she’s constantly trying to make between what’s happening in her head and what she can express with speech or writing.",
    "And then there’s the documentary’s advocacy, tied to Giffords, a gun owner and former registered Republican, and her too-often-thwarted attempts to push for gun reform after her shooting and after the distressing number of subsequent mass shootings.",
    "Kelly was literally in space during at least one of Giffords’ key brain surgeries and it’s impossible to watch Gabby Giffords Won’t Back Down without pondering the unique independence that they each had before and their newer co-dependence.",
    "That Oscar-nominated documentary had the advantage of depicting an iconic story about a woman whose legacy was pretty well settled — while at the same time helping to spawn a cottage industry of badass Ruth Bader Ginsburg memorabilia.",
    "Harrowing, sad and inspiring in equal measures, the documentary Gabby Giffords Won’t Back Down represents another solid piece of progressive [Jewish] feminist hagiography from directors Julie Cohen and Betsy West, the duo behind RBG.",
    "There’s also intriguing specificity to watching Giffords prepare for interviews or seeing how she was able to film campaign ads for Kelly, moments of behind-the-scenes intrigue that would be at home in something like The War Room.",
    "The bat mitzvah feels like it could have been a climactic moment that the documentary otherwise lacks, a substitute for the comprehensive gun reform Giffords is still seeking, the full recovery that is still a work-in-progress.",
    "The human brain is a confounding thing, and Giffords’ ongoing battle with aphasia and different impairments are fascinating; Cohen and West benefit from Kelly’s decision, early on, to film every part of her recovery.",
    "It’s hard for the segment recalling the shooting in detail not to become draining — and even if it only lasts a couple of minutes, the time dedicated to the shooter becomes a detour that feels out of place.",
    "Her recovery, rehabilitation and return to politics — as an advocate for gun safety and as part of Kelly’s Senate campaign — make for a documentary that wants to tell a number of stories at once.",
    "The Arizona representative’s death was relayed to her husband Mark Kelly and even became part of the most sanctimonious scene in the multi-year run of Aaron Sorkin’s The Newsroom.",
    "But despite those initial missives, despite being shot in the head and sustaining wounds that could have resulted in death 90 percent of the time, Giffords survived.",
    "Then there’s the story that relates to the marriage between Giffords and Kelly, which has at times been the longest of long-distance relationships.",
    "There are also gaps in the personal portrait, which may be due to COVID limitations or to Kelly’s limited availability as a sitting senator.",
    "It’s here that the directors are able to lean on talking heads including Barack Obama, Jim Clyburn, Kirsten Gillibrand and other Democrats.",
    "The greater surprise is how Kelly, who never imagined himself as a candidate for elected office, has needed to rely on Giffords.",
    "Or maybe the directors avoided it for that reason, to keep this raw, unfinished story from becoming as polished and tidy as RBG.",
    "The blending of inspiration and frustration in Giffords’ story produces challenges that the documentary can’t always overcome.",
    "Certain moments will ring true for anybody with loved ones who have experienced brain injuries or alterations of capacity.",
    "You can see the leaps and bounds of her advancement, the ways she still struggles and the sources of her joy.",
    "One can easily imagine how Giffords would rely on Kelly now more than ever before.",
    "This leads to some odd choices, especially in the more current parts of the story.",
    "The simmering anger of the political side of the documentary boils over at times.",
    "That’s what the news reported after a 2011 mass shooting in Tucson.",
    "The medical story is, all on its own, remarkable and relatable.",
    "It’s not like any marriage you’ve ever seen before.",
    "I can admire its messiness on those terms.",
    "Gabby Giffords was, of course, dead."
  ]
}