{
  "id": 15802,
  "mediaId": 8309,
  "date": "2022-03-07",
  "headline": "Desert Lightning News Digital Edition – March 2022",
  "image": "https://www.aerotechnews.com/davis-monthanafb/wp-content/uploads/sites/6/2022/03/030422DLNFPjpg.jpg",
  "link": "https://www.aerotechnews.com/davis-monthanafb/2022/03/07/desert-lightning-news-digital-edition-march-2022/",
  "mediaOutlet": "Desert Lightning News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aerotech News",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "http://online.flipbuilder.com/vzwd/xblj/\nHere are some more highlights from our March issue:\nAgile Battle Lab accelerates austere communication capabilities: page 3\nFire Station 2 reopens in style: page 4\nAward-winning basketball player brings love of the game to AF career: page 5\nFeature: 355th Wing 2021 Annual Award winners: pages 6 & 7\nAll this and much more, in this edition of Desert Lightning News!",
    "Be ready for combat before combat begins.” Fitting words at any time, and even more so in the light of current world events — especially considering the identity of the speaker: Gen. Mark Kelly, commander of Air Combat Command.",
    "General Kelly was discussing the current evolution of Air Combat Command operations, preparing our Airmen for a battlespace that is vastly different than what they have experienced over the past two decades.",
    "“Like” our page for daily news updates – we now regularly cross-post news and features from the military bases we serve throughout the desert Southwest, as an extension of our military and defense community.",
    "Hard copies of the paper will be available at various distribution points on base and in surrounding communities starting March 4th.",
    "Pick one up when you’re out and about, or visit our website, www.aerotechnews.com, for much more military and defense industry news.",
    "“We must ‘accelerate change’ because the status quo won’t work.” What exactly does a standardized wing structure consist of?",
    "Click on the link below to read the full story, along with much more news, in this month’s issue of Desert Lightning News.",
    "Desert Lightning News – Digital and print publication serving Davis-Monthan AFB, Tucson AZ and surrounding communities.",
    "“A standardized wing structure and warfighting units are required to meet the challenges we’re facing,” said Kelly.",
    "– March 2022\nHello everyone, and welcome to the March 2022 edition of Davis Monthan AFB Desert Lightning News.",
    "Click on the link below for the latest digital edition of DLN, viewable on your computer or mobile device.",
    "As always, THANK YOU for your support – it’s our privilege to serve you!",
    "#aerotechnews #dmafbnews #desertlightningnews",
    "“Be ready for crisis before crisis emerges.",
    "An AerotechNews.com Publication.",
    "Be safe and be well."
  ]
}