{
  "id": 1589,
  "mediaId": 2557,
  "date": "2022-02-15",
  "headline": "REPORT: The List: 17 Senate GOPs Demand Biden Import More Foreign Workers",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/02/920x920-1-e1533762626546.jpg",
  "link": "https://dennismichaellynch.com/report-the-list-17-senate-gops-demand-biden-import-more-foreign-workers/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    0
  ],
  "sentences": [
    "In Breitbart’s report, and according to the letter, the senators signing the letter are listed as follows:\nThe 17 Republicans who signed the letter are:\nKevin Cramer (R-ND)\nMike Rounds (R-SD)\nLindsey Graham (R-SC)\nJames Risch (R-ID)\nLisa Murkowski (R-AK)\nRoy Blunt (R-MO)\nCynthia Lummis (R-WY)\nJohn Cornyn (R-TX)\nMike Crapo (R-ID)\nJohn Thune (R-SD)\nSusan Collins (R-ME)\nPat Toomey (R-PA)\nRoger Wicker (R-MS)\nJerry Moran (R-KS)\nRand Paul (R-KY)\nJohn Barrasso (R-WY)\nTim Scott (R-SC)\nThe 17 Democrats who signed the letter are:\nAngus King (I-ME)\nChris Coons (D-DE)\nMichael Bennet (D-CO)\nRobert Menendez (D-NJ)\nJeanne Shaheen (D-NH)\nRaphael Warnock (D-GA)\nThomas Carper (D-DE)\nJoe Manchin (D-WV)\nMark Warner (D-VA)\nJohn Hickenlooper (D-CO)\nTim Kaine (D-VA)\nTina Smith (D-MN)\nAmy Klobuchar (D-MN)\nKyrsten Sinema (D-AZ)\nRon Wyden (D-OR)\nMark Kelly (D-AZ)\nDianne Feinstein (D-CA)\nTraitors: STEALING JOBS FROM US!",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nA group of Senate Republicans has joined Senate Democrats to demand President Joe Biden import more H-2B foreign visa workers to take working-class, blue-collar American jobs.",
    "On Monday, 17 Senate Republicans signed a letter with 17 Senate Democrats that urges Biden to “release the maximum allowable number of additional” H-2B foreign visa workers to inflate the labor market despite more than 12 million Americans remaining jobless, though all want full-time employment.",
    "The article goes on to state the following:\nThe senators also asked Biden to speed up the process so U.S. employers could get foreign visa workers quicker into blue-collar American jobs, often in construction, landscaping, the tourism industry, and other occupations.",
    "The List: 17 Senate GOPs Demand Biden Import More Foreign Workers https://t.co/BKzwv4JZpZ via @BreitbartNews\n— TheLeoTerrell (@TheLeoTerrell) February 16, 2022\nTo get more information about this article, please visit Breitbart.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "CLICK HERE to read the letter, dated Feb. 9, 2022.",
    "Listen to the latest daily DML podcasts below!",
    "Then please share."
  ]
}