{
  "id": 15934,
  "mediaId": 2731,
  "date": "2022-03-14",
  "headline": "City of Phoenix Gave Employees Lead Poisoning, Democratic Leaders Won’t do Anything About it",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/images/2022/72/3ce183a6-f946-4a89-b327-ed9aede374a8.png",
  "link": "https://townhall.com/columnists/rachelalexander/2022/03/14/city-of-phoenix-gave-employees-lead-poisoning-democratic-leaders-wont-do-anything-about-it-n2604506",
  "mediaOutlet": "townhall.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Alexander",
  "authorUrl": "https://townhall.com/columnists/rachelalexander/",
  "termIds": [
    0
  ],
  "sentences": [
    "These included the late Sen. John McCain, Rep. Ruben Gallego, Rep. Raul Grijalva, Sen. Kyrsten Sinema, Sen. Mark Kelly, former Arizona Attorney General Terry Goddard, the Department of Justice, the FBI, the Federal Trade Commission, the Department of Labor, Chicanos por la Causa, and Friendly House.",
    "The former employees went to a meeting of the Phoenix City Council to ask for help, but Democrat Greg Stanton, who was the mayor at the time and is now in Congress representing much of South Phoenix, asked an assistant to throw them all out of the meeting instead of listening to their story.",
    "The FTC wrote back, “While the FTC is not able to intervene in individual disputes, the information you have provided has been recorded in our secure online database.” The U.S. Consumer Products Safety commission merely told him they sent his report to the manufacturer.",
    "They refuse to help former city employees who contracted health problems — and some died — working around buildings with high levels of lead in the paint, in part because the statute of limitations to bring claims has ended.",
    "Lara went to the Industrial Commission of Arizona next, hoping to bring it to the attention of the Occupational Health and Safety Administration, but found his repeated attempts stonewalled, he believes due to corruption.",
    "If they have money for massive graft, with Ponzi schemes funneling money to favorite employees and relatives, they surely can afford to improve the health-impaired lives of a few of their own who they wronged.",
    "Well, these employees didn’t realize all their health problems were caused by it until years later, when they’d spoken with each other and realized how many of them had developed similar serious health issues.",
    "He and 13 employees, including one named Leonard Parker, were responsible for painting the buildings using an industrial oil-based paint known as Enduragloss that contained lead called wickersham.",
    "During a meeting in 1992, the main painter at the facility warned Lara’s supervisor that using the paint was going to get Lara and others sick — including the public — and possibly lead to death.",
    "Another former city employee named Nettie Nelson worked in a tiny front office at the South Mountain gatehouse entrance, which people drive by in order to access South Mountain Park.",
    "View Cartoon\nOn Jan. 25, 1996, Lara was rushed to the hospital because he couldn’t breathe, and put in the ICU on a ventilator for five days in critical condition.",
    "Now both mother and daughter have various ailments including nerve problems, heart problems and respiratory illnesses, and Nettie is in a wheelchair.",
    "The paint was also used in several parks in South Phoenix, on playground equipment like merry-go-rounds, monkey bars, as well as picnic tables.",
    "Democrats are famous for spending money, so why don’t they care about spending money on something both Republicans and Democrats can agree on?",
    "When he asked for help from his Democratic State Senator Rebecca Rios, she accused him of merely complaining about COVID-19 symptoms.",
    "There were supposed to be hazard signs placed near the painting operations, in order to keep the public away, which wasn’t done.",
    "The City of Phoenix is run by Democrats; the mayor has been a Democrat for years and the city council is dominated by them.",
    "Lara just wants compensation for the misery he and others have experienced, including the families of those who have died.",
    "California settled lawsuits against paint manufacturers for $305 million in 2019 over lead poisoning caused to children.",
    "Between 1992 and 2003, he worked at a senior citizens’ community center called South Mountain Community Center.",
    "One day when Lara was at that site, he noticed the restrooms were covered in plastic, closed due to asbestos.",
    "He’s been unable to find an attorney willing to represent them since no one dares to sue the City of Phoenix.",
    "When Lara and Leonard painted that office, she complained about the bad smell making her sick and vomit.",
    "He asked for help from a long list of agencies and Arizona officials, mostly Democrats, and got nowhere.",
    "While working at Phoenix’s Nueve Park in 2001, Lara was again rushed to the hospital unable to breathe.",
    "Never a smoker, he now has lung problems including COPD, and must take steroids, which cause bone loss.",
    "A material safety data sheet from 1999 for Enduragloss lists many of their physical ailments as a risk.",
    "Nelson was later transferred to the South Mountain Community Center — around more lead paint.",
    "When lead paint becomes old, it chips and peels, creating a chalky dust that can be inhaled.",
    "But not until at least 13 or more people that he knows developed severe health problems.",
    "Lara is now appealing, but it’s an immense amount of work in a very complex area of law.",
    "Others developed various ailments including tumors and nerve damage which causes pain.",
    "Lara filed a pro se lawsuit against Phoenix on June 22, 2020, which the city ignored.",
    "The EPA said they assist in situations involving residences or children only.",
    "Ruben Lara was employed by the City of Phoenix Parks Department for 33 years.",
    "He also collected copies of City of Phoenix invoices listing the wickersham.",
    "Lead paint is known for causing damage to vital organs such as the kidneys.",
    "They used it on metal, including metal doors, door jams, and window frames.",
    "The supervisor wasn’t certified to use the paint, nor were the employees.",
    "The paint was never reported to the EPA’s office in San Francisco.",
    "According to Lara, the paint remains in the buildings to this day.",
    "The City of Phoenix could do the right thing and make them whole.",
    "Nelson’s daughter Kelly participated in a city program there.",
    "Doctors told him that he almost died from the fumes.",
    "Parker developed kidney problems and is on dialysis.",
    "The judge threw out the case with no reason.",
    "The supervisor disregarded the warning.",
    "He was forced to stop working in 2003.",
    "Finally, Phoenix banned the paint.",
    "He’s collected their responses.",
    "Three died from cancer."
  ]
}