{
  "id": 16006,
  "mediaId": 6461,
  "date": "2022-03-04",
  "headline": "The debate over suspending America’s petrol tax",
  "image": "https://www.economist.com/img/b/1280/720/90/sites/default/files/images/2022/03/articles/main/20220305_usp503.jpg",
  "link": "https://www.economist.com/united-states/2022/03/05/the-debate-over-suspending-americas-petrol-tax",
  "mediaOutlet": "Economist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Justin Wolfers, an economist at the University of Michigan, wryly proposed a reframing of the tax-holiday proposal: “Would it be a good idea for the government to give cheques to people in proportion to how much they drive and how fuel-inefficient their car is?”\nNevertheless, during the past fortnight two notable economists have offered partial defences of a petrol-tax holiday: both view it as short-term relief for inflation-weary consumers.",
    "Olivier Blanchard, a former chief economist at the International Monetary Fund, said that governments could offer tax breaks or subsidies based on past fuel consumption, thereby providing a discount but constraining demand—a clever, if perhaps impractical, idea.",
    "A study of a petrol-tax moratorium in Indiana and Illinois in 2000 concluded that consumers saw prices decline by only about 60% of the tax cut, because a resulting increase in demand increased the pre-tax price of petrol.",
    "Yet prices at the pump stare down at drivers in big bold numbers on the petrol-station signs that they pass just about every day, making them one of the most concrete manifestations of inflationary pressures.",
    "On February 9th Mark Kelly and Maggie Hassan, two Democratic senators, introduced a bill, the “Gas Prices Relief Act”, which would suspend the federal tax at the pumps for the remainder of the year.",
    "The trust fund is already running low, and the tax holiday would deprive it of about $20bn, a big blow, according to the Committee for a Responsible Federal Budget, a watchdog group.",
    "Paul Krugman, a New York Times columnist, argued that, with refineries well shy of full capacity, American producers could meet additional demand without increasing prices.",
    "It is no coincidence that many of the Democratic politicians pushing for a tax holiday, including Mr Kelly and Ms Hassan, are in tight election races this year.",
    "For exclusive insight and reading recommendations from our correspondents in America, sign up to Checks and Balance, our weekly newsletter.",
    "Another part may be a proposal that has sparked debate among economists in America: a reprieve from petrol taxes for the rest of this year.",
    "The revenues raised from the petrol tax go to the Highway Trust Fund, which helps pay for road construction and mass transit.",
    "Drivers now pay, on average, $3.50 per gallon, the highest since 2014, a reflection of constrained supply and strong demand.",
    "This is critical to me.” So declared Joe Biden when announcing the first round of sanctions against Russia on February 24th.",
    "Yet it would merely return petrol prices to their level in late January, when consumers were already grumbling about them.",
    "With the tax set at 18.4 cents per gallon, the temporary halt would amount to a price cut for drivers of roughly 5%.",
    "This article appeared in the United States section of the print edition under the headline \"Pumping up the votes\"",
    "The structure of the sanctions, ensuring that Russian oil can still reach global markets, is part of the answer.",
    "This idea was already circulating in Washington in the weeks before Russian troops flooded into Ukraine.",
    "First, just because the government cuts taxes does not mean that drivers would reap all the benefits.",
    "“I WILL DO everything in my power to limit the pain the American people are feeling at the gas pump.",
    "With little interruption over the past year and a half, petrol prices have climbed and climbed.",
    "They want to show voters that they are doing something—anything—to rein in inflation.",
    "Lastly, the incentives would be perverse for anyone concerned about climate change.",
    "Soaring oil prices, a consequence of the sanctions, will only add to the pressures.",
    "The average American household spends about 3% of their annual income on petrol.",
    "And many economists fret that these meagre savings would come at a high cost.",
    "Soaring global crude prices would, however, still swamp any discount.",
    "That petrol prices are critical to President Biden is beyond doubt.",
    "Never let a questionable policy get in the way of good politics.",
    "A small tax saving would barely move the needle on inflation.",
    "High inflation is already weighing on his popularity.",
    "In any case the economics debate may miss the point.",
    "Second, it would lead to a fiscal drain.",
    "That may sound like a decent discount.",
    "There are three main concerns.",
    "How can he limit the pain?"
  ]
}