{
  "id": 1617,
  "mediaId": 2740,
  "date": "2022-02-17",
  "headline": "Sen. Elizabeth Warren calls for members of Congress to sell all individual stocks",
  "image": "https://www.gannett-cdn.com/presto/2021/12/19/USAT/de89bcd1-9232-4cda-9eec-a070f49d2fd5-AP_Senate_Banking.jpg?crop=5999,3374,x0,y305&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/money/2022/02/17/elizabeth-warren-congress-trading-stock/6820868001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatodaycommoney-topstories",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michelle Shen",
  "authorUrl": "https://www.usatoday.com/staff/4252292001/michelle-shen/",
  "termIds": [
    0
  ],
  "sentences": [
    "For example, in May 2019, Oregon’s Sen. Jeff Merkley, D-Ore., and Sen. Sherrod Brown, D-Ohio, introduced the Ban Conflicted Trading Act, which would bar members of Congress and senior congressional staff from buying or selling individual stocks and other investments, and from serving on any corporate boards, while in office.",
    "Ossoff-Kelly stock ban bill: A potential new bill could bar members of Congress and their families from trading individual stocks\nIn February, Rep. Katie Porter, D-Calif., and Sen. Kirsten Gillibrand, D-N.Y., also introduced legislation related to stock trading to strengthen transparency around potential insider trading.",
    "In an interview with CNN, she said, \"Now is the time to say to the American people, you can be confident that when a representative or senator is voting on something, they're doing it because they believe it is best for the country, not just for themselves.\"",
    "It would require members of Congress, senior congressional staff and senior members of the executive branch to report any time that they, a spouse or a dependent applies for or receives a benefit from the government like a loan, contract, or a grant.",
    "An investigation by Business Insider released in December found that 57 members of Congress and 182 senior-level congressional staffers have violated a federal conflicts-of-interest law, which sparked public interest in the debate.",
    "The results of the investigation revealed that lawmakers and congressional staffers in both parties are constantly investing and trading in stocks they could affect with their votes or have insider knowledge about.",
    "What's everyone talking about?Sign up for our trending newsletter to get the latest news of the day\nEven before the investigation, many lawmakers were aware of the issue and introduced bills to combat it.",
    "Insider found that nearly 75 lawmakers held stocks in the top three vaccine manufacturers, Pfizer, Moderna and Johnson & Johnson, well before the vaccines were distributed to the public.",
    "Jon Ossoff, D-Ga., and Mark Kelly, D-Ariz., introduced a bill in January that prevents not only members of Congress but also their families from owning and trading individual stocks.",
    "The investigation pointed out the hypocrisy of many lawmakers, such as Democrats who invested in fossil fuel companies and anti-smoking regulators invested in tobacco companies.",
    "Sen. Elizabeth Warren, D-Mass., is campaigning for a bill she introduced that bans members of Congress and their spouses from owning, buying or trading individual stocks.",
    "The bill was more flexible, allowing members of Congress to hold existing investments while in office but preventing them from trading it until they're out of office.",
    "Unlike other bills introduced, it would require that members of Congress and their spouses sell off their individual stocks and invest in mutual funds instead.",
    "However, similar to the Merkley-Brown bill and unlike the Warren bill, the members of Congress would have the option to place their stocks in a blind trust.",
    "Warren said in the interview that the bill is simple, direct and bipartisan and that it is the only one that exists in the Senate.",
    "Other members of Congress have recently introduced bills similar to Warren's that prevent members of Congress from trading stock.",
    "Other versions of the bill have allowed members of Congress the option to place their individual stocks in a blind trust.",
    "The idea has been popular with voters but has not yet reached enough momentum to make it onto the floor for a vote.",
    "Gillibrand said the expanded ban would also cover Supreme Court justices and Federal Reserve governors.",
    "It also allowed for the possibility of placing their stocks in a blind trust.",
    "Michelle Shen is a Money & Tech Digital Reporter for USA TODAY.",
    "Steve Daines, R-Mont., is a co-sponsor of the bill.",
    "You can reach her @michelle_shen10 on Twitter.",
    "More recently, Sens."
  ]
}