{
  "id": 1692,
  "mediaId": 3993,
  "date": "2022-02-11",
  "headline": "AZ Senate candidate says lefties \"feigning outrage\" over new gunslinging ad",
  "image": "https://bearingarms.com/wp-content/uploads/media/2022/02/Screen-Shot-2022-02-11-at-10.37.55-AM-1110x740.png",
  "link": "https://bearingarms.com/camedwards/2022/02/11/az-senate-candidate-says-lefties-feigning-outrage-over-new-gunslinging-ad-n55386",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cam Edwards",
  "authorUrl": "https://bearingarms.com/author/camedwards",
  "termIds": [
    0
  ],
  "sentences": [
    "gang” by using Western movie tropes, Lamon’s campaign ad has to be portrayed as a shockingly insensitive portrayal of “real violence.”\nThe attempted assassination of Gabrielle Giffords was and is no laughing matter, but it also has nothing to do with Lamon’s ad, which, contrary to the claims of outlets like the Arizona Republic does not “focus on guns and the Second Amendment.” In fact, the words “Second Amendment” aren’t ever said in the campaign commercial.",
    "https://t.co/PpxzN6eqpf\n— Jim Lamon (@jim_lamon) February 11, 2022\nI don’t know if this ad will end up helping or hurting Lamon’s campaign, but the attention paid to it by the left and some of his primary opponents is certainly going to give him a media boost, and may very well end up drawing support (or at least sympathy) from who are tired of the never-ending attempts to cancel anything and everything that someone, somewhere, finds offensive.",
    "This ad will do more to boost Mark Kelly’s fundraising than help Republicans.”\nOthers agreed, saying it was particularly egregious because Kelly’s wife, former Rep. Gabrielle Giffords (D-Ariz.), was seriously wounded in 2011 during a mass shooting.",
    "https://t.co/8G0Dc2e1Qf\n— Rep. Eric Swalwell (@RepSwalwell) February 10, 2022\nNow, if you actually watched this video you know that you can see more violence in one minute of a Looney Tunes cartoon than what can be found in Lamon’s campaign ad.",
    "I confess, when I saw a headline about an Arizona Republican senate candidate “shooting [a] gun at actor portraying Mark Kelly, whose wife was shot,” my first thought was “Oh no, really?”\nAfter watching the ad, however, my reaction was “Really?",
    "Lawman Lamon has some backup of his own in the ad; Pinal County Sheriff Mark Lamb and National Border Patrol Council President Brandon Judd, along with a cast of angry townspeople who declare they’re tired of the D.C.",
    "“The good people of Arizona have had enough of you,” Lamon solemnly intones, adding “It’s time for a showdown.”\nAt that, Crazyface Pelosi draws a knife from its scabbard and prepares to throw it at Lamon.",
    "A 30-second version of the ad is slated to run on local broadcasts of the Super Bowl in Arizona this Sunday, and so far Lamon’s standing his ground.",
    "Even the angry townspeople are upset over things like high gas prices and inflation and not Mark Kelly’s support for new gun control measures.",
    "I thought it was a fairly amusing ad, but both Lamon’s Republican primary opponents and anti-gun Democrats were quick to call it disgraceful.",
    "Left wing snowflakes can’t stand the fact that, for once, AZ will have a Senator who will shoot straight with them & stop cowering to Biden.",
    "Her husband’s Republican US Senate opponent, @jim_lamon, just put out an ad in which he shoots Mark Kelly and other Democrat leaders.",
    "#AzSen pic.twitter.com/eoBIJH8ap0\n— Shannon Watts (@shannonrwatts) February 10, 2022\nRepublicans don’t have any ideas to help you.",
    "Old Joe raises his gun as Shifty Kelly draws his pistol, only to have “Big Jim” Lamon shoot the weapons from their hands.",
    "It’s much more important to craft a narrative, and one that paints pro-2A candidates in the worst light possible.",
    "Blake Masters and Michael McGuire, two of Lamon’s GOP rivals in the race, led the chorus of criticism.",
    "The left is going to try to start a controversy over this?” Watch for yourself and see what you think.",
    "Gang”, led by “Old Joe” with his buddies “Shifty Kelly” and “Crazyface Pelosi” tagging along behind.",
    "“Fits his campaign.”\n“Real violence and use of deadly force is no laughing matter,” said McGuire.",
    "The ad features Lamon as the white-hat wearing lawman of a frontier town who faces down the “D.C.",
    "Their feigned outrage over our new Super Bowl ad came right on cue—but I won’t be backing down.",
    "This ad shows poor judgment and isn’t reflective of the values of the Second Amendment.",
    "DISGUSTING: Former Rep. Gabby Giffords was shot and and seriously wounded 10 years ago.",
    "Gang skedaddle, and Lamon rides off into the sunset on the back of his trusty steed.",
    "Gang pushing them around, along with inflation, open borders, and gas prices.",
    "And contrary to Shannon Watts’ lie, no one gets shot in Lamon’s ad.",
    "So they’ve gone all in on using violence as a path to power.",
    "“Absurd and desperate,” Masters told The Arizona Republic.",
    "So, instead of a silly ad that pokes fun at the “D.C.",
    "RT if you’re choosing #VotesOverViolence this Fall.",
    "“Violence in America is real and it isn’t funny.",
    "But the facts don’t matter to folks like Watts.",
    "As the townsfolk cheer, the D.C.",
    "And they can’t win elections.",
    "No one."
  ]
}