{
  "id": 17129,
  "mediaId": 2520,
  "date": "2022-03-03",
  "headline": "'I have the job I want': Arizona Gov. Doug Ducey will not run for the US Senate in 2022",
  "image": "https://www.gannett-cdn.com/presto/2022/01/11/PPHX/0cf48916-bbfe-4fc5-a0b3-117ad59d94d9-_RS28154.JPG?crop=2999,1687,x0,y177&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/03/03/arizona-gov-doug-ducey-not-run-u-s-senate-2022/9353249002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stacey Barchenger",
  "authorUrl": "https://www.azcentral.com/staff/2646476001/stacey-barchenger/",
  "termIds": [
    5876,
    2915,
    2459,
    2765,
    1489,
    1312,
    1126,
    1122,
    5949
  ],
  "sentences": [
    "“Right now I have the job I want, and my intention is to close my years of service to Arizona with a very productive final legislative session AND to help elect Republican governors across the country in my role as chairman of the Republican Governors Association.”\n'By nature and by training I’m an executive'\nThe governor’s decision comes as no surprise to those who have closely followed his rise within traditional GOP ranks from an Ohio transplant to an Arizona college student, ice cream CEO, state treasurer and, finally, two-term governor.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nThat speculation has lingered, even after he declared in January 2021: “I’m not running for the United States Senate.",
    "It was a great question and the answer is as true today as it was more than a decade ago.”\nHis decision is a blow for McConnell and national Republicans who saw Ducey as an electable candidate, well positioned to quickly raise money and snap the GOP’s recent losses to Democrats in Arizona Senate contests.",
    "Ducey’s announcement to some of his closest financial allies ends the long-running effort by national and local Republican leaders and deep-pocketed donors to recruit him for the race against Sen. Mark Kelly, D-Ariz., whose reelection could decide which party controls the evenly divided chamber.",
    "\"While I’m disappointed he decided not to run, Arizona will be an important part of our plan to win the majority back.”\nKatherine Cooksey, a spokesperson for the National Republican Senatorial Committee, the Senate's GOP campaign arm, expressed confidence in the current GOP candidate field.",
    "Instead of waging a multipronged political fight in 2022, Ducey hopes to cement a persona as a competent conservative who delivered on tax and regulatory breaks while pursuing a massive school-choice expansion measure and avoiding the cultural clashes that sometimes divide his party.",
    "“Ducey was widely reported to be Mitch McConnell and the NRSC’s best hope to win this Senate seat, and now Washington Republicans are left with what they have admitted is a clown car of C-list candidates who care more about fighting each other than actually representing Arizonans.\"",
    "Arizona’s utilities, law firms, and business groups saw in him a stable force who heralded traditional Republican principles without the distraction of the cultural warfare that had sidetracked his predecessors and cast the state in an unfavorable light.",
    "But Ducey’s decision to certify Arizona’s 2020 presidential election victory for Democratic President Joe Biden put Ducey in the crosshairs with former President Donald Trump, complicating any notion of a clear path to the GOP nomination if he sought it.",
    "The Ducey legacy in Arizona\nDucey, the former Cold Stone Creamery CEO, is a prolific fundraiser who won over Arizona’s powerful business community and attracted wealthy donors from around the nation in both his bids for the governorship.",
    "Despite those attacks, recent polling has shown Ducey’s standing among Arizona voters has improved since he was dubbed the least-favored governor in the country for his handling of the COVID-19 pandemic in early 2020.",
    "Last week, Ducey told a group of real estate professionals and developers gathered for an annual Valley Partnership breakfast at Phoenix Country Club that he planned to live in Arizona, no matter what his future held.",
    "Polling in December and January by Morning Consult said 48% of voters approved of Ducey’s job performance, a six-point increase over early 2021 — the months immediately after the governor certified the election.",
    "Ducey’s donors and supporters from Arizona to Washington hoped he would bring that more-traditional Republican influence to national politics, too, tempering the increasingly divided factions of the GOP.",
    "\"Arizona voters have excellent candidates to choose from in the Republican primary, and the NRSC is confident any of these outstanding candidates can beat Mark Kelly in November,\" she told The Republic.",
    "His announcement effectively serves as permission for those donors to flood money to the other candidates in a race where Kelly is expected to again raise the estimated $100 million he raised in 2020.",
    "Doug Ducey will not run for the U.S. Senate this year, he told donors in a letter obtained by The Arizona Republic, finally putting to rest whether he held aspirations for elected office this cycle.",
    "\"No one looms larger in this GOP Senate primary than Donald Trump, whose lies around the 2020 election have become this race’s litmus test even as Arizonans are ready to move on,” Goss said.",
    "It’s a no.”\nDucey’s next step has been frequent fodder for the national press, which has revived the uncertainty in recent months by citing the pressure campaign from Washington, D.C.",
    "The resulting claims of widespread fraud made by Trump and his campaign allies ruptured the governor’s relationship with the man who still casts the longest shadow in GOP politics.",
    "Twist, political director of the RGA and an alum from Ducey's administration and campaigns, said Ducey's prominence in national GOP circles will leave him with plenty of options.",
    "His powerful position as chairman of the RGA, which amplified his connections to donors and decision makers, only added to speculation he had his eyes on future elected office.",
    "The extended recruitment by Senate Minority Leader Mitch McConnell, R-Ky., reflected, in part, the perceived weakness of the existing GOP field of senatorial candidates.",
    "In a maneuver that will shape Arizona law and policies for generations, he expanded the state’s Supreme Court and loaded it with justices believed to share his outlook.",
    "“We have a strong field of candidates in Arizona and I will be actively supporting our nominee — and perhaps weighing in before the primary,” Ducey told his donors.",
    "In the earliest days of his first gubernatorial run, supporters pointed to him as a viable contender for federal office or as a member of a presidential Cabinet.",
    "The prospect of a Ducey candidacy has hung over the Senate race for months, possibly bottling up donations and endorsements from key Republican stakeholders.",
    "“I’m going to dedicate 100% of my energy to fulfilling the commitments I’ve made, both to the citizens of Arizona and to my colleagues at the RGA,” he said.",
    "None of the current candidates has stood apart in fundraising or cut a prominent political profile, two factors that intensified efforts to draft Ducey.",
    "Among Republican voters, Ducey’s approval climbed from 62% in early 2021 to 73% earlier this year, and he gained 5 percentage points among independents.",
    "When Ducey was weighing a bid for public office, former Sen. Jon Kyl, R-Ariz., asked if he was an executive or a legislator, Ducey’s letter recounts.",
    "She portrayed Kelly, who has overwhelmingly voted in line with the president's positions while in the Senate, as a \"rubber stamp\" for Biden's agenda.",
    "“If you’re going to run for public office, you have to really want the job,” Ducey wrote in his single-page letter sent to donors early Thursday.",
    "Ducey’s long-standing connections to well-heeled donors and his status as head of the Republican Governors Association made clear he had both.",
    "\"The respect and admiration he has garnered as a national leader in both policy and politics will open a lot of doors for him,\" Twist said.",
    "Political observers parsed Ducey’s responses to the Senate question in a way that suggested he left open the possibility of a future run.",
    "In the letter to donors, Ducey didn’t offer any clues about his next job but said it would come after discussions with his wife, Angela.",
    "Though the governor won’t add his name to the slate seeking the GOP nomination, he teased he might weigh in on who is best for the job.",
    "Perhaps the most obvious sign he would not enter: His most-trusted campaign hands remained close to him but scattered to other roles.",
    "He is poised to become the first Arizona governor to finish two terms in office since Bruce Babbitt left the governorship in 1987.",
    "In a statement, the former president pointed to this week’s primary successes in Texas, where his endorsements proved influential.",
    "Throughout his tenure as governor, Ducey and his closest aides sought to tamp down speculation about his political aspirations.",
    "Not surprisingly, that continued Thursday, when Trump tried to take credit for Ducey’s decision not to seek the Senate seat.",
    "Ducey acknowledged in his letter he has the temperament of a boss, not someone negotiating as one voice among 100 senators.",
    "A Trump endorsement would bring a necessary boost, and criticism from the former president threatened to hurt Ducey’s odds.",
    "In 2020, he campaigned onstage with Trump, offering political advice on how to win in a state where Ducey has never lost.",
    "Subscribe for free to The Gaggle political podcast on Apple Podcasts, Overcast, or wherever you listen to audio content.",
    "Ducey notified McConnell of his decision on Wednesday, a person familiar with the conversation told The Republic.",
    "A campaign spokesperson for Kelly declined to comment and referred inquiries to the Arizona Democratic Party.",
    "On Election Day, he’ll be asking voters to back GOP gubernatorial candidates across the country — not him.",
    "That fractured relationship cast doubt on Ducey’s chances of prevailing in a packed Senate GOP primary.",
    "Party spokesperson Hannah Goss tied Ducey's decision in part to Trump's grip on the Republican Party.",
    "He pledged to cut the multiple layers of red tape he said made it hard to do business in the state.",
    "\"Add that to his extremely successful business career and he’ll have countless options before him.",
    "Voters first elected him to a four-year term in 2014; he won reelection by a wide margin in 2018.",
    "Ducey assured financial supporters he would get government out of the way of the private sector.",
    "“And that led me to run for Treasurer and ultimately Governor instead of seeking federal office.",
    "\"He said, knowing I would never endorse him, ‘No thanks, I am not going to run for Senate!",
    "“The answer was obvious — by nature and by training I’m an executive,” the letter reads.",
    "Trump has made Ducey a regular target since the governor certified the election results.",
    "\"Governor Ducey is a good man and a great leader,\" McConnell said in a statement.",
    "Contact her at yvonne.wingett@arizonarepublic.com and 602-444-4712.",
    "Even so, Trump failed to capture Arizona’s 11 electoral votes.",
    "“Angela and I will decide what comes next after that.”\nJ.P.",
    "He’s in a great spot whatever he chooses to do.\"",
    "“Smart move, Doug — there’s no room for RINOs.\"",
    "Reach the reporter on Twitter and Facebook.",
    "Have news to share about Arizona politics?",
    "Will he seek elected office again?",
    "He lost by less than 11,000 votes.",
    "Subscribe to azcentral.com today.",
    "(Republicans in name only.)",
    "Support local journalism.",
    "Arizona Republican Gov.",
    "'” Trump said."
  ]
}