{
  "id": 17126,
  "mediaId": 8475,
  "date": "2022-03-01",
  "headline": "Pima County spending $1.3 million per month to shelter migrants released by DHS",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/110821_asylum_seekers-3102_1.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/030122_casa_alitas_budget/pima-county-spending-13-million-per-month-shelter-migrants-released-by-dhs/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Ingram",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/6436",
  "termIds": [
    0
  ],
  "sentences": [
    "Krysten Sinema and Mark Kelly signed onto a letter asking for the Senate to continue funding the Emergency Food and Shelter Program, \"specifically, the humanitarian assistance funding through this program must be funded so that localities, non- governmental organizations, and shelters who provide critical services for migrants arriving at the border do not face financial difficulties and may be forced to stop their operations.\"",
    "\"These partnerships in tandem with robust, ongoing internal communication and logistics management across several county departments – spearheaded by Pima County Office of Emergency Management – have resulted in safe respite and passage for asylum seekers through Pima County,\" she said, adding that the county \"will leverage\" this experience to protect recently evicted individuals and families.",
    "From March 1 to Dec. 15, 2021, the county spent around $5.5 million helping asylum seekers, including $3.4 million on hotels, around $425,000 on food at the hotels and the Casa Alitas Welcome Center, another $175,000 at Casa Alitas, as well as $516,0000 on medical costs, $628,000 on staffing, and over $332,000 on transportation costs—including $200,405 on cab rides and bus trips.",
    "Local\nFEMA has funded $5.4 million here, but local officials warn Congress has not authorized new support\nOver the last few months, Pima County spent around $1.3 million per month to shelter migrants released by Homeland Security officials, and the county faces a coming funding crunch as federal grants that helped cover theses expenses are held up in Congress.",
    "Meanwhile, the COVID-19 pandemic arrived in the U.S., and by March 2020, the Trump administration largely abandoned MPP, preferring to use Title 42—a public health order, ostensibly supported by the CDC, that allowed U.S. Customs and Border Protection officials to immediately expel people if they've traveled through a country with significant COVID-19 case.",
    "This includes not only costs shelter people at the Casa Alitas Welcome Center, based in a renovated wing of the Pima County Juvenile Justice Complex, but also transporting people around the county, as well as sheltering COVID-19-positive migrants in a hotel as part of a wide effort known as the Southwest Border Operation Partnership.",
    "\"Unfortunately, the humanitarian assistance provision was not renewed in the Continuing Resolution that was passed in December of 2021,\" they wrote, adding that \"as a result, every day that passes grantees of the program are grappling with how to operate and continue to provide critical support and serve this vulnerable population.\"",
    "\"EFSP, through supplemental funding, also provides reimbursements to local nonprofit and governmental social service organizations, as well as states, and localities, providing shelter, food, transportation and support services to migrants arriving at our southern border, who are waiting for their asylum cases to be adjudicated.\"",
    "However, in 2020 the number of releases collapsed as the Trump administration clamped down on border crossers, and implemented the controversial Migrant Protection Protocols — a program better known as \"Remain in Mexico\" — that forced asylum seekers to stay in Mexico while their immigration cases ground through the courts.",
    "In a series of memos to the Pima County Board of Supervisors, including one sent Friday, Acting County Administrator Jan Lesher wrote that in December, the county faced a deficit of around $938,000 after costs for sheltering migrants in Pima County grew as the number of people \"surged and COVID-19 positivity increased.\"",
    "In a great irony, hundreds people who cross the border in the deserts of Arizona are allowed to seek asylum in the U.S., but those who turn themselves over to officials at U.S. ports in Nogales, Douglas, and Yuma are rebuffed because CBP has tried to minimize how many people are in custody at U.S. border crossings.",
    "He noted that releases \"overwhelmed our humanitarian partners,\" during 2021, but the county built up the system to transport people to the Casa Alitas center, and then moved to expand COVID-19 testing, medical care and isolation for those sick with COVID-19, as well as vaccinations, and shelter people.",
    "CBP said that Title 42 contributed to this, noting that \"since CBP began expelling non-citizens under the CDC’s Title 42 public health order to limit the spread of COVID-19, the repeat encounter rate jumped to more than one in three encounters, including almost half of single adult encounters.\"",
    "However, not everyone who arrives as a family was allowed to stay in the U.S.\nCBP said that in January, around 111,000 people were picked up in January, and CBP officials accepted 23,462 people traveling as families, while another 8,333 people were expelled under Title 42.",
    "The county also set up a contract for transportation services to help drive people longer distances agreeing to spend up to $550,000 from April 2021 until Oct. 2022, as well as contract with AAA Cab to transport people from Aug. 2021 until Aug. 2022 at a cost of $250,000.",
    "\"It became very challenging over the last couple of months as Border Patrol Yuma Sector has become a hot-spot of border crossers and the Border Patrol Tucson Sector has coordinated to receive, process and release large numbers to CAWC,\" Clark wrote in January.",
    "\"Through Pima County partnerships with city of Tucson, CCS, and federal program leadership at FEMA EFSP, over 24,000 asylum seekers have been safely processed through Pima County since the beginning of the current surge crisis in early 2021,\" Lesher wrote.",
    "Unlike facilities operated by federal agencies like Border Patrol or U.S. Immigration and Customs Enforcement, the migrants at the Casa Alitas shelter are not being detained—rather they've already been reviewed, and released by the feds under U.S. law.",
    "COVID-19 complicates efforts\nIn January, Shane Clark, with the county's Office of Emergency Management, told the board that since April 22, 2021 the Casa Alitas Welcome Center has done \"an incredible job managing releases in conjunction with COVID.\"",
    "The hotels, and the long-distance travel will be covered by the American Rescue Plan's funding, while the short drives will be covered by the county's general fund, wrote Shane Clark, the director of the county's Office of Emergency Management.",
    "She noted that in February roughly half of the 80 rooms at one hotel were reserved for migrants, while the rest were held for people who needed shelter and were identified by the Pima County Department of Community and Workforce Development.",
    "Clark warned in January that new pressures could place new strains on the ability to manage \"non-congregate shelters,\" and said that Border Patrol has \"indicated\" that releases could remain at \"this rate for the unforeseeable future.\"",
    "After people were released by Border Patrol, the county drove people from the agency's \"soft-sided facility\" in Tucson to shelters, as well as to airport and bus station, completing around 1,685 trips during that time, Clark wrote.",
    "Since the New Year, the shelter effort—managed by the county, along with the city of Tucson and Catholic Community Services—has provided refuge to about 6,800 people, including 4,453 people January and 2,377 people in February.",
    "By February, the federal government said it would give the county around $5.4 million in two separate chunks from the Emergency Food and Shelter Program managed by FEMA, and backed by funding through the American Rescue Plan.",
    "While the county has been \"made whole\" by the most recent federal outlay, she said FEMA officials said \"there is no new federal funding authorized to address the needs of the asylum seeker population after March 31, 2022.\"",
    "Beyond the funding the county will receive soon, local officials and FEMA will have to \"wait on Congress to authorize new funding for FEMA EFSP that can be used for asylum seeker humanitarian needs as soon as possible.\"",
    "In 2019, Pima County and Catholic Community Services established the Casa Alitas Welcome Center, a shelter for asylum-seekers operating in three renovated sections of the Pima County Juvenile Justice Complex.",
    "Overall, agents encountered people around 170,000 times in December, and agents in the Yuma Sector—which straddles the Colorado River and runs east toward the Yuma County line—encountered people 29,756 times.",
    "\"Thus, while total enforcement encounters increased 82 percent between 2019 (the last pre-pandemic year) and 2021, the number of unique individuals encountered at the border increased 30 percent,\" CBP said.",
    "\"Communities and organizations are on the front-lines of assisting migrants coming to our border and resources are being stretched thin as they take on the role of performing a federal government function.",
    "Complicating these efforts, the county in managing two populations who need shelter, including not just migrants, but also Pima County residents who were recently evicted, Lesher told the board.",
    "The people who stay at the shelters are mostly families who crossed the U.S.-Mexico border seeking asylum, and will be traveling to live with sponsors in cities across the United States.",
    "He also noted that the county often tested people coming into the shelter, and that out of 14,035 people who were tested, around 477 percent tested positive, a rate of around 3 percent.",
    "Notably, during the height of the COVID-19 outbreak this winter, testing positivity soared to around 19 percent on Feb. 8 county-wide before declining to about 15 percent on Feb. 15.",
    "Furthermore, Congress must ensure that border communities have the tools necessary to humanely and adequately support migrants as they flee violence, and economic instability.\"",
    "In some cases, the city used Sun Tran to help transport people, and Clark wrote that Pima County officials required masks and cleaning to reduce the potential spread of COVID.",
    "In 2019, immigration officials under the Trump administration dropped off 18,131 people to shelters, including Casa Alitas, according to data from Pima County officials.",
    "However, it's unclear if future funding will be available because new humanitarian assistance funds were not part of the temporary budget passed by Congress in December.",
    "He noted that during the winter, from Dec. 6 to Jan. 2, 2022 the number of people released weekly increased from 472 people to 1,252, or around 179 per day on average.",
    "\"This has truly been a community wide partnership to ensure those released by the federal agencies have a safe environment until they relocate to other destinations.\"",
    "In December, Yuma's mayor declared an emergency due to a \"humanitarian and border crisis,\" after Border Patrol agents encountered 6,000 migrants in just five days.",
    "\"This has had a direct ripple effect on transportation, testing, medical support for those testing positive to COVID, vaccination and non-congregate sheltering.\"",
    "\"Additionally, these partnerships have been integral in the mitigation of COVID-19 spread, thus assuring public health and safety recommendations are met.\"",
    "Sinema and Kelly wrote that Congress appropriated $510 million as part of the American Rescue Plan, and around $110 million was earmarked to help migrants.",
    "In January, the number of people encountered in Yuma dropped about 21 percent, while the number intercepted in the Tucson Sector rose around 12 percent.",
    "This funding crunch comes even as there are signs that the \"surge\" in the number of immigrants released by federal officials may continue through 2022.",
    "The Welcome Center replaced the ad hoc shelter that Catholic Community Services set up at the former Benedictine Monastery on North Country Club Road.",
    "Most of the asylum-seekers stay for just a day or two, and then travel to stay with relatives or other sponsors as their asylum cases are processed.",
    "\"Congress has an opportunity to reaffirm its commitment to protecting migrants and the right to seek refugee by extending funding for EFSP.",
    "And, many of these encounters included families traveling with children who often flagged down Border Patrol agents, and requested asylum.",
    "Lesher told the board that this funding will cover the deficit from December, and allow the county to cover costs through March 31, 2022.",
    "In the Tucson Sector—which covers Arizona from Yuma County to the New Mexico border—agents encountered around 15,758 people in December.",
    "This included a contract worth up to $4.8 million for 117 rooms at one hotel, and 80 rooms at another from Aug. 2021 through Dec. 2022.",
    "By March, that situation began to change, as the Biden administration faced increasing numbers of migrants coming to the U.S. border.",
    "In fact, Nicholls made a similar declaration in April 2019, a move that he rescinded in a largely symbolic move that winter.",
    "These local communities and organizations are showing the best of our country but they need help and relief,\" they wrote.",
    "\"During that span the daily releases were as few as 3 to as many as 344 on New Year's Day,\" Clark wrote.",
    "They noted that around 14,000 human service agencies in more than 2,500 communities rely on EFSP funds.",
    "However, by the end of the fiscal year of 2021, CBP reported encountering people 1.72 million times.",
    "Throughout 2020, the Casa Alitas Welcome Center accepted just 1,209 people, Pima County data shows.",
    "During 2021, the shelter program aided 21,774 people, and most people stayed three days on average.",
    "While the Biden administration terminated MPP almost immediately, they left Title 42 in place.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "\"These efforts were needed as a result of the COVID public health emergency,\" Clark wrote.",
    "As part of this effort last year, the county set up three contracts to support migrants.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "\"In summary, the situation is dynamic and ever changing,\" Clark wrote.",
    "In previous years, the repeat encounter rate was around 1 in 8.",
    "Clark said that 2,908 asylum seekers were vaccinated, as well.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "By the end of 2021, the county sheltered 23,795 people.",
    "Thanks for reading TucsonSentinel.com.",
    "Earlier this month, U.S. Sens.",
    "Like what you're reading?",
    "- 30 -"
  ]
}