{
  "id": 1726,
  "mediaId": 2528,
  "date": "2022-02-16",
  "headline": "3 reasons why Democrats' gas tax cut proposal won't do much to curb rising prices or cool inflation",
  "image": "https://i.insider.com/61d4ba3357bd6c00185890ce?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/democrats-gas-tax-holiday-proposal-biden-inflation-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Winck",
  "authorUrl": "https://www.businessinsider.com/author/ben-winck",
  "termIds": [
    0
  ],
  "sentences": [
    "Marc Goldwein, policy director at the Committee for a Responsible Federal Budget, argued that some of the benefits may flow to oil and gas producers since they'd be incentivized to raise pre-tax gas prices to net additional profits.",
    "Lowering gas prices won't make too much of a dent in otherwise skyrocketing inflation\nEven if Democrats pass the tax holiday and gas prices temporarily edge lower, headline inflation will probably still hold strong.",
    "Senators from both parties are skeptical and see it as a political gimmick\nPassing the tax holiday could also ease intense pressures on Democrats defending razor-thin majorities in the House and Senate.",
    "A gas tax holiday might not move prices at the pump all that much\nSuspending the federal gas tax could modestly lower prices at the pump, but the move would do little to solve the underlying problem.",
    "\"If what you want to do is defund infrastructure, worsen the climate crisis, add to the deficit, and increase inflationary pressures, then this is a great policy,\" Goldwein said in an interview.",
    "Several Senate Republicans raised the issue during a Wednesday press conference and frequently pointed to high gas prices as one of the biggest threats to the still-recovering economy.",
    "Sen. Mike Crapo of Idaho criticized it as a \"gimmick,\" while Sen. Dan Sullivan of Alaska slammed the policy as \"political window dressing from some vulnerable US senators.\"",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Some in the party like Sen. Joe Manchin of West Virginia pushed back on its potential benefits, and Republicans derided it as a political gimmick ahead of the midterms.",
    "The Committee for a Responsible Federal Budget's Goldwein said that consumers with more money in their pockets could worsen inflation in other parts of the economy.",
    "Democrats are weighing a new option to fight soaring prices that could provide some relief at the gas pump, but would likely do little to cool inflation otherwise.",
    "While monthly CPI prints can mean little to the average American, it's easier to grasp that gas is roughly $1 more expensive per gallon than it was one year ago.",
    "But there are some big reasons to be skeptical about whether or not the proposed holiday would do much to curb inflation, or even be passed into law.",
    "Without new oil supply from US drilling rigs or the Organization of the Petroleum Exporting Countries, gas prices would likely keep climbing.",
    "But what you would create is a greater amount of debt in the US and a greater inability for us to finance our infrastructure,\" Crapo said.",
    "Even if the holiday lowers prices, it also cuts into government tax revenue and could worsen the country's debt situation, Crapo added.",
    "Nationwide demand rose to 9.1 million barrels in the week that ended February 4, according to the US Energy Information Administration.",
    "Elevated inflation has been Republicans' favored political cudgel for hammering Democrats and fighting against their spending plans.",
    "Senate Majority Leader Chuck Schumer of N.Y., speaks during a news conference on Capitol Hill in Washington, Tuesday, Jan. 4, 2022.",
    "While inflation has affected practically every good and service in the US, the price of gasoline is among the fastest growing.",
    "Mark Kelly and Maggie Hassan — would suspend the federal government's 18.4-cent tax on every gallon of gas until Jan. 1, 2023.",
    "If the holiday passes and works as intended, that would essentially lower the average price per gallon to $3.303 from $3.487.",
    "Like the rest of the economy, gas stations are struggling to match Americans' voracious demand with their strained supply.",
    "Gas prices are only one component of the Consumer Price Index, which serves as one of the country's top inflation gauges.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "The year-over-year inflation rate also accelerated to 7.5%, marking the fastest price growth since February 1982.",
    "Gas prices may still rise due to supply crunches and some of the benefits may flow to oil and gas companies.",
    "The White House and Senate Democrats are considering a federal gas tax holiday as prices hit 8-year highs.",
    "Prices sat 40% higher year-over-year in January, according to government data published Thursday.",
    "That's up 900,000 barrels from just one week prior and about 1.3 million barrels from a year ago.",
    "But it appears that the idea is sputtering out just as Democrats put the keys into the ignition.",
    "Susan Walsh/AP\nDemocrats are pitching a temporary gas tax cut to curb rising prices at the pump.",
    "Even a major drop in the price-per-gallon would only place a small drag on the overall measure.",
    "The gap between the two has driven gas prices sharply higher through the first weeks of 2022.",
    "Pricey gas gave the GOP an even more pointed weapon for skewering the Biden administration.",
    "But it's not likely to be all that effective at stopping inflation in its tracks.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Only used cars and fuel oil have seen faster inflation over the past 12 months.",
    "Surging gas prices have been one of the biggest ills of the economic recovery.",
    "Gasoline prices fell 0.8% through January, yet the overall index rose 0.6%.",
    "EIA\nA tax would lower prices slightly, but the imbalance would remain.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "\"You would reduce 18 cents of that $1, so there would be a step there.",
    "It's no help that demand is also running hotter than usual.",
    "The most recent CPI report offers a timely example.",
    "The measure — rolled out last week by Sens.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}