{
  "id": 17323,
  "mediaId": 2745,
  "date": "2022-03-03",
  "headline": "Of Russian vodka and cheese-eating surrender monkeys",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/574MMJP5CVBG5MMXHWTAVEJTVI.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/03/russian-vodka-cheese-eating-surrender-monkeys/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5601,
    4591,
    3968,
    3678,
    3360,
    2859,
    6163,
    6672,
    6569
  ],
  "sentences": [
    "$10 billion to address the emerging humanitarian crisis in Ukraine\n“The proposal also includes assistance to bolster Ukraine’s defenses, protect its electrical grid from disruption, and further equip other European allies, according to two people familiar with the matter who spoke on the condition of anonymity to describe the plans.”\n“The proposal also includes assistance to bolster Ukraine’s defenses, protect its electrical grid from disruption, and further equip other European allies, according to two people familiar with the matter who spoke on the condition of anonymity to describe the plans.”\n$22.5 billion from to safeguard against future variants of the coronavirus\n“Top White House officials have maintained in recent days that they have enough funding to combat the waning omicron surge.",
    "Bush’s Air Force One served “Freedom toast.” (During a long evening at a hotel bar while traveling with Bush, a few of us agreed “French kissing” should be renamed “The Patriot Act.”)\nNew York Times foreign-policy eminence Tom Friedman daydreamed of removing “silly” France from the U.N. Security Council, to be replaced by India because “India is just so much more serious than France these days.” A few months later, he diagnosed: “France is becoming our enemy.”\nThreats of a boycott compelled French’s mustard to clarify: “The only thing French about French's Mustard is the name.”\nAmericans bought French wine to pour it down sewers (ostensibly putting money in the pockets of French wine-makers).",
    "But they have stressed that significant pots of money have been spent or committed to specific purposes, warranting new investment in testing, therapeutics and vaccines to protect against the possibility of a new wave.”\nThe countdown: “Lawmakers have eight days to finalize the emergency spending measures and broker a broader government funding deal, though they can still buy themselves additional time with another stopgap.”\n“Democrats could come one step closer to gaining control Thursday morning, when the Senate Commerce Committee is scheduled to vote on FCC nominee Gigi Sohn and FTC nominee Alvaro Bedoya,” Cat Zakrzewski reports.",
    "Status quo: “Both agencies with broad oversight over Silicon Valley companies, the FCC and FTC have lacked a Democratic majority for months, preventing them from moving forward with widely anticipated initiatives, like restoring open Internet regulations and crafting new competition rules.”\nThe big sticking points: In his first State of the Union address Biden:\nConservatives have a new weapon in the fight against what they see as offensive lessons in the classroom: Transparency bills that would require schools to post all instructional materials online.",
    "The pros: “Proponents argue that more disclosures would help parents to better support their children’s learning, because they would know more about what is happening in school.”\nThe cons: “[Teachers and other advocates] argue these new requirements would be a burden for already overworked teachers … In some states, too, tip lines allow parents to report instructors who have discussed politically sensitive topics or aired views parents dislike, putting more stress on educators.”\nAt 5 p.m., he will sign H.R.",
    ": “At least five other superyachts owned by Russian billionaires are anchored or cruising in the Maldives, an Indian Ocean island nation, ship tracking data showed.”\n“French President Emmanuel Macron told Russia’s Vladimir Putin he was making a ‘major mistake’ in Ukraine, that he was deluding himself about the government in Kyiv and that the war would cost Russia dearly over the long term, a French official said,” Reuters's Michel Rose reports.",
    "The answer to that question indisputably should be yes.”\nSome notable signatories: Donald B. Ayer, John B. Bellinger III, Michael Chertoff, Charles Fried, Constance Morella, Nicholas Rostow, Christie Todd Whitman\n“In ordinary times, or under less sweeping sanctions, the Russian central bank could cut that cycle short by trading rubles for dollars at a guaranteed rate: say, 80 rubles per dollar.",
    "What they are: “Each Bayraktar TB2 system consists of six aerial vehicles (or drones), two ground control stations, and related support equipment.”\nHow they’ve been used: “The first reports of Ukraine using the Bayraktar TB2s against Russian forces since the invasion came on February 27, 2022 … Ukraine’s air force has since confirmed two drone strikes on Russian targets.",
    "Russia stockpiled those assets, but it can no longer reach most of them.”\n“On Telegram, Twitter and YouTube, Ukraine’s Ministry of Internal Affairs since Sunday has posted a constant stream of extremely graphic images showcasing the horrors of war and inviting Russians to examine them to determine whether the images feature a missing loved one,” Drew Harwell reports.",
    "Maria Petrenko, who runs a web development company “said she has already lost one client and likely several others to follow because of her connection to Russia, and she has lost the ability to pay her employees in Russia due to trade sanctions.”\nThe Iraq and Ukraine crises look vastly different, of course, especially with the benefit of hindsight.",
    "But they have stressed that significant pots of money have been spent or committed to specific purposes, warranting new investment in testing, therapeutics and vaccines to protect against the possibility of a new wave.”\n“Top White House officials have maintained in recent days that they have enough funding to combat the waning omicron surge.",
    "“The International Criminal Court prosecutor has launched an investigation that could target senior officials believed responsible for war crimes, crimes against humanity or genocide amid a rising civilian death toll and widespread destruction of property during Russia’s invasion of Ukraine,” the Associated Press’s Mike Corder reports.",
    "In a letter released this morning, 24 Republicans urged the party to come together and confirm Jackson to the Supreme Court, writing that, “the question for the Senators is not whether this is a nomination that they would make, but whether the President has put forward a nominee well qualified to serve on the Supreme Court.",
    "Why we’re paying attention: “Such violations might seem minor compared with evidence suggesting Russian military forces have killed civilians and indiscriminately bombed residential neighborhoods, said Rachel E. VanLandingham, a professor at Southwestern Law School who has studied war crimes.",
    "Pundits recycled the monkeys line in late 2002, early 2003, when France’s opposition to President George W. Bush’s drive to invade Iraq stirred up a lot of anti-French sentiment — and led a lot of Americans to take out their frustrations in some of the same ways they’re doing now with Russia.",
    "Amid fears of a 9-11 backlash against American Muslims, Bush hurried to the Islamic Center of Washington, D.C. six days after the attacks to declare “Islam is peace.”\n“Muslims are doctors, lawyers, law professors, members of the military, entrepreneurs, shopkeepers, moms and dads,” he said.",
    "“The blame and the focus should be on the actions of President Putin, not on people of Russian descent and letting anger be directed at them is feeding into exactly the type of destructive and divisive behavior we should be fighting against,” said White House Press Secretary Jen Psaki.",
    "“The Biden administration will share U.S. government-devised coronavirus technologies with the World Health Organization, a policy shift intended to allow other countries to replicate some American scientific breakthroughs and better fight the pandemic abroad,” Dan Diamond reports.",
    "Many more have been shared on social media, but they have not been verified.”\nMoscow faces mounting allegations that it has used cluster and vacuum weapons, which can put civilians at increased risk, particularly when used in urban areas, our colleague Claire Parker reports.",
    "“Ducey had been heavily courted by Senate Minority Leader Mitch McConnell (R-Ky.), the National Republican Senatorial Committee and others in Washington who saw him as the strongest GOP candidate to take on Sen. Mark Kelly (D-Ariz.) this fall,” Felicia Sonmez reports.",
    "“France and Germany have seized two superyachts owned by Russian oligarchs, French authorities and Forbes magazine said, hitting Russia's super-rich under sanctions imposed on Moscow over its invasion of Ukraine,” Reuters’s Tassilo Hummel and Alasdair Pal report.",
    "“Cluster munitions apparently fired by Russia appeared to have hit a preschool in northeastern Ukraine and an area near a hospital in the Kyiv-controlled part of the eastern Donetsk region last week, killing several civilians,” she writes.",
    "The D.C. bar and restaurant “Russia House” had three windows broken and has been getting hate phone calls, according to owner Aaron McGovern, who told The Washington Post he suspects anti-Russian sentiment linked to Ukraine.",
    "In the most famous incident, the Republican-held House of Representatives renamed the French fries in its cafeteria “Freedom fries,” a move that led to some head-scratching in France, where they’re thought of as Belgian.",
    "As the United States leads allies and partners in imposing economic sanctions on the Russian state, Russian oligarchs, Russian enterprises, there are early signs of concern linked to the latest wave of “anti” sentiment.",
    "A lot of what’s going on now seems symbolic and harmless, and even if pouring pricey vodka down the drain seems like a sub-optimal use of $300 that might go to humanitarian groups helping Ukrainian refugees.",
    ": “Ukraine possesses at least twelve Turkish Bayraktar TB2 drones, and reports suggest that it might have as many as thirty-six additional units,” the Council on Foreign Relations’s Lauren A. Kahn explains.",
    "A bar near my home has replaced the “Moscow Mule” with the “Kyiv Mule.” Rep. Eric Swalwell (D-Calif.) has called for retaliating against Moscow by expelling every single Russian student on U.S. soil.",
    "This morning the White House preemptively warned Americans eagerly showing their support of Ukraine and anger at Russia not to vent their passion on people of Russian descent in the United States.",
    "For the latter group, the expression is from the episode of The Simpsons in which budget cuts force Springfield Elementary to have Groundskeeper Willie teach French in his thick Scottish brogue.",
    "Because the bank is willing to exchange at that rate, 80 rubles are now worth a dollar — and will be for as long as the bank’s reserves hold out,” Alyssa Fowers and Kate Rabinowitz report.",
    "“At the start of the Russian invasion, [a] spokesperson for the Ukrainian Air Force, said Ukraine had approximately twenty Bayraktar drones,” but that’s unconfirmed.",
    "A plumber who lived nearby, the late George Holliday, recorded the events on his camcorder (look it up) and sent the video to a local television station.",
    "Over at Crain’s Detroit Business, Nic Antaya chronicled on Wednesday how anti-Russian sentiment and American sanctions were hurting local businesses.",
    "But they could chip away at Ukraine’s ability to hold Russia accountable for violating international law.”\nWhat kind of drones does Ukraine have?",
    "France opposed a war of choice on dubious pretexts — disarming Iraq of supposed weapons of mass destruction — that turned out to be false.",
    "Turn on your TV 20 years later, and you can see Americans pouring Russian vodka — or vodka they wrongly think is Russian — down the drain.",
    "Russia is waging a war of choice in Ukraine on a pretext — “de-Nazification” by removing a Jewish president — known to be false today.",
    "The targeted removal of Russian products from American shelves worries Nerik Gadaev, owner of a deli and grocery store in Phoenix.",
    "In our anger and emotion, our fellow Americans must treat each other with respect.” But anti-Muslim hate crimes surged.",
    "(Disclosure: I have French citizenship and was covering the White House for Agence France-Presse in that earlier era.",
    "In 2020, as the pandemic surged, hate crimes against people of Asian descent in the United States rose by 76 percent.",
    "We hear him greet schoolchildren with “Bonjourrrrr, ya cheese-eatin’ surrender monkeys.”\nWhy are we recalling this?",
    "The French consulate in Atlanta had its flag stolen so frequently it turned to buying replacements in bulk.",
    "And Russians, like the French, are somewhat protected by the lack of obvious external characteristics.",
    "4445, the “Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act of 2021” into law.",
    "“Lawmakers in at least 17 state capitols and Congress are pushing for them,” Laura Meckler reports.",
    "There hasn’t been a surge in hate crimes against the estimated three million Russian-Americans.",
    "On this day in 1991, motorist Rodney King was severely beaten by Los Angeles police officers.",
    "But there are reasons not to see everything anti-Russian as harmlessly letting off steam.",
    "“But that strategy requires huge reserves of cash in stable currencies.",
    "\"We’re just a small business trying to live our lives,\" he told Fox 10.",
    "Just look at how anti-French sentiment played out in 2002-2003.",
    "I never had to call upon my ability to fake a Canadian accent.",
    "The president and vice president will deliver remarks.",
    "Sometimes, they pay $300 for the privilege.",
    "“And they need to be treated with respect.",
    "Tell your friends to sign up here.",
    "It was…an interesting time.)",
    "Welcome to The Daily 202!",
    "Eh, it’s their money.",
    "Are there more?"
  ]
}