{
  "id": 17386,
  "mediaId": 8484,
  "date": "2022-03-04",
  "headline": "Biden threatens to VETO Senate vote to end the COVID national emergency because it would be a 'reckless and costly' mistake - despite saying the US was heading back to normal at the State of the Union",
  "image": "https://i.dailymail.co.uk/1s/2022/03/04/15/54951915-0-image-a-4_1646406160665.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10577965/Biden-threatens-VETO-Senate-vote-end-COVID-national-emergency.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "whatdoesitmean.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morgan Phillips",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "+6\nView gallery\nPresident Biden scoffed at a Senate-passed bill to end the coronavirus national emergency, calling the Republican attempt a 'reckless and costly mistake'\n+6\nView gallery\n'After nearly two years of living under this state of emergency, the American people are worn out and yearning to breathe free; they long for their God-given freedoms, and for leaders to take their side,' Sen. Roger Marshall said\nHis comments came as last week the Centers for Disease Control drastically eased masking recommendations to suggest that most of the country could safely enter public spaces without a mask.",
    "'By prematurely terminating the national emergency declaration on COVID, it will be harder to ensure we have enough supplies, enough support for health care workers, and it risks throwing tens of millions of student loan borrowers into needless uncertainty and anxiety.'",
    "Jeff Bezos accuses Elon Musk of being in pocket of CHINESE government and woke actress Jameela Jamil claims she'll never tweet again as showbiz stars whine about tycoon's $44bn purchase of Twitter, and other top stories from April 26, 2022.",
    "'I am proud my colleagues came together to repeal this emergency declaration and delivered a symbolic victory to our citizens that normalcy is around the corner and that limited government and our constitutional rights still reign supreme.",
    "'And with 75 percent of adult Americans fully vaccinated and hospitalizations down by 77 percent, most Americans can remove their masks, return to work, stay in the classroom and move forward safely,' he said.",
    "It was yet another recent win for Republicans, who passed two bills to repeal the vaccine mandate for healthcare workers at facilities that receive federal funding and the mandate for large corporations.",
    "'After nearly two years of living under this state of emergency, the American people are worn out and yearning to breathe free; they long for their God-given freedoms, and for leaders to take their side.",
    "Republican Sen. Roger Marshall, who introduced the bill, used a procedural tactic where a bill can be brought forth for a vote before the full Senate if it is not taken up in committee within two weeks.",
    "'The best way to ensure that we keep schools open and cases low is by staying at the ready, and that is what these emergency powers enable us to do,' the New York Democrat said in a floor speech.",
    "It said that the national emergency declaration is needed for 'ensuring that necessary supplies are promptly available to respond to the virus and facilitating the delivery of health care.'",
    "The bill to terminate the declaration under the National Emergencies Act passed the Senate 48-47, with three Democrats and two Republicans absent from the vote.",
    "President Biden scoffed at a Senate-passed bill to end the coronavirus national emergency, calling the Republican attempt a 'reckless and costly mistake.'",
    "There is no doubt, it's time for our nation to learn to live with COVID,' Marshall R-Kansas, said in a statement on the bill's passing.",
    "Dianne Feinstein, who is mourning the loss of her husband, Alex Padilla, who recently tested positive for Covid-19, and Mark Kelly.",
    "In Biden's State of the Union address this week, the president delivered a message of moving on from Covid-19.",
    "Republicans Jim Inhofe, who also recently contracted Covid-19, and Richard Burr were absent from voting.",
    "It’s time for Americans to get back to work and fill our great downtowns again,' said Biden.",
    "Pause\n0:00 / 0:00\nVoltax\nFull-screen\nAbsent on the Democrat side for the vote were Sens.",
    "We must chart a new course to victory today that respects the virus and our freedoms.'",
    "The national emergency was first enacted in March 2020 under President Trump.",
    "The White House said that if the bill were to reach the president's desk.",
    "'People working from home can feel safe to begin to return to the office.",
    "The bill is unlikely to pass the House, where Democrats maintain control.",
    "The vast majority of federal workers will once again work in person.",
    "It's high time to stop talking about restrictions and the unknown.",
    "+6\nView gallery\n+6\nView gallery\n+6\nView gallery\nSen.",
    "'We can end the shutdown of schools and businesses.",
    "We're doing that here in the federal government.",
    "Our kids need to be in school,' said Biden.",
    "Minority Leader Chuck Schumer pushed back.",
    "Neither made it through the House.",
    "We have the tools we need.",
    "Let's keep it that way.",
    "Our schools are open."
  ]
}