{
  "id": 1742,
  "mediaId": 2540,
  "date": "2022-02-10",
  "headline": "Vulnerable Democrats feel inflation squeeze and call for more White House action",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220210160819-kelly-warnock-hassan-split-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/10/politics/democratic-reaction-inflation-squeeze/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Manu Raju",
  "authorUrl": "https://www.cnn.com/profiles/manu-raju",
  "termIds": [
    0
  ],
  "sentences": [
    "The Senate's most vulnerable Democrats are all calling on the Biden administration to do more to address the pain consumers are feeling from the cost of rising goods -- and taking steps themselves to show they are in tune with voters' concerns, whether it's on the price of gasoline or groceries.",
    "Republicans, who have had to deal with their own political problems -- namely stemming from former President Donald Trump, his refusal to accept the 2020 election results and the fallout from the January 6 insurrection -- are banking that inflation will become the defining theme in November.",
    "\"It's fair to say that we should be focused on addressing all the issues that matter to people and certainly, the laundry list of concerns that people bring to me as a representative includes inflation,\" Rep. Abigail Spanberger, the vulnerable Virginia Democrat, told reporters at the event.",
    "The four Democratic incumbents who are in the toughest races this fall all indicated Thursday that far more needed to be done -- and none of these vulnerable members indicated they were pleased with the job the Biden administration is doing on the matter.",
    "\"I am doing everything I can to address rising costs for the people of Georgia, which is why I introduced my Gas Relief Act yesterday,\" Warnock said when asked if he were satisfied with the administration's handling of inflation.",
    "But Sen. Joe Manchin, a West Virginia Democrat, has rejected that plan, killing the $1.75 trillion measure in the 50-50 Senate and rejecting the argument from some economists who say it would help ease inflationary pressures.",
    "And while the Federal Reserve has the biggest say over inflation, with its ability to raise interest rates, the White House has argued Congress has a role too, demanding the Senate approve Biden's Build Back Better plan.",
    "The comments reflect the growing angst among Democrats that -- even though there are clear signs the economy is roaring back -- inflation could emerge as a central issue in the battle for control of the House and Senate.",
    "Colorado Sen. Michael Bennet, a Democrat who also faces voters in the fall, called on Congress to renew the expanded child tax credit, which expired at the end of last year due to Manchin's opposition to the proposal.",
    "\"I know the administration is doing everything they can to address the supply chain issues, which they should, and there's work we're doing in Congress to do just that as well,\" the first-term Nevada Democrat said.",
    "\"Also, I think we need to do everything we can to reduce the cost of prescription drugs, and we need to deal with the ways in which there are some corporate actors who seem to be exploiting this pandemic.\"",
    "Prices jumped 6% between January 2021 and January 2022, not including food and energy prices, which jumped 7% and 27% respectively over that same time period, according to data released Thursday.",
    "But she also said the \"anti-inflationary measures\" in the Build Back Better plan -- such as dealing with health care and prescription drug costs -- could \"absolutely\" drive down prices.",
    "And they point to actions they have taken to ease the supply chain crunch, such as expanding the hours that truckers can drive and lengthening the hours that major ports can operate.",
    "\"We need to push harder to increase the amount of oil, see if there's more we could do to add to the supply side there,\" adding more had to be done to bolster manufacturing as well.",
    "\"We need to push harder to see what we can do to resolve the supply chain issues,\" Sen. Maggie Hassan, a New Hampshire Democrat, said of the administration's handling of the issue.",
    "Just this week, Democrats introduced a bill that would temporarily suspend the 18 cents per gallon federal gas tax -- in a move they say would help with soaring costs at the pump.",
    "\"This is something real upfront, right now, we can do immediately, is to take care of the financial problems we have,\" Manchin told CNN, rejecting calls for more social spending.",
    "\"I think it's a reason why we should be making permanent the child tax credit because it would really help people that are struggling with inflation right now,\" Bennet said.",
    "A new CNN poll released Thursday showed that just 37% of voters approved of his handling of the economy, with a whopping 62% disapproving -- up 8 points since December.",
    "But Manchin's position -- which is in line with Republicans who argue Democrats' spending plans have driven up costs -- puts some vulnerable Democrats in a tough spot.",
    "The White House has defended its efforts in dealing with inflation, arguing that the Covid-19 pandemic and problems with the supply chain have made the problem worse.",
    "\"Inflation is up, it's up,\" he said, arguing his administration is working to bring down costs on food, child care, health care, gasoline, and other costs of living.",
    "Cortez Masto, who faces a tough reelection in Nevada, told CNN that she has discussed ways to control inflation with Federal Reserve Chairman Jerome Powell.",
    "\"But the fact is that if we are able to do the things I'm talking about here, it'll bring down the costs for average families,\" Biden said.",
    "\"No,\" Sen. Mark Kelly, the Arizona Democrat, told CNN when asked if he were satisfied with the administration's handling of the issue.",
    "\"It's not just the data shows, in polling what people are feeling, but you can feel that anecdotally -- just by talking to people.\"",
    "Speaking Thursday at a community college in a swing district in central Virginia, Biden acknowledged the toll inflation is taking.",
    "And in an ominous sign for Democrats, Biden has seen his own poll numbers slumping -- in no small over the impacts of inflation.",
    "\"Until it comes down to something that's more sustainable and that families across the country can actually deal with -- no.\"",
    "And very few of them say President Joe Biden is doing enough to deal with the fastest pace of inflation in four decades.",
    "(CNN)American consumers are feeling the squeeze from inflation -- as are Senate Democrats facing voters in nine months.",
    "\"This one everybody feels,\" said Senate Minority Whip John Thune, who faces voters in South Dakota in November.",
    "Catherine Cortez Masto of Nevada and Raphael Warnock of Georgia, who are also facing voters in November.",
    "\"So I think we have to continue to address this crisis because it is happening.\"",
    "This story has been updated with additional developments Thursday.",
    "Among the sponsors of the bill: Kelly and Hassan along with Sens.",
    "CNN's Morgan Rimmer and Kevin Liptak contributed to this report.",
    "\"I'm going keep pushing them to do more,\" Hassan added."
  ]
}