{
  "id": 17497,
  "mediaId": 2830,
  "date": "2022-03-02",
  "headline": "Will Germany’s Foreign Policy Turnabout Last?",
  "image": "",
  "link": "https://www.wsj.com/articles/germany-turnabout-scholz-russia-ukraine-invasion-berlin-gas-gazprom-nord-stream-exports-swift-sanctions-putin-xi-11646232325",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josef Joffe",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "WSJ Opinion: Putin’s Ukraine Invasion Exposes Europe's Energy DilemmaPlay video: WSJ Opinion: Putin’s Ukraine Invasion Exposes Europe's Energy Dilemma\n As Vladimir Putin's invasion of Ukraine intensifies, Western markets hold up, but Russia’s financial system takes a beating.",
    "Photo: Michael Kuenne/Zuma Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (6 minutes)\nAD\nLoading advertisement...\n00:00 / 06:09\n1x\nThis article is in your queue.",
    "Which raises a grating question: How long will the revulsion last—not only in Germany but in the U.S., Canada, Japan, Australia, even eternally neutral Switzerland, which has joined in?",
    "Even as Russian divisions encircled Ukraine, Chancellor Olaf Scholz went off on a mission to Moscow, competing for the broker’s fee with French President Emmanuel Macron.",
    "Suddenly, all Bundestag factions save the pro-Russian Left Party, descendant of the East German Communists, project a mood change that defies past pliancy.",
    "Pressed too hard, Mr. Putin will demonstrably move into Xi Jinping’s embrace to damage the U.S. Never mind that China and Russia are natural rivals.",
    "Suddenly, the country at the fulcrum of the European balance has stopped seesawing, plunked down in the West, and traded striped pants for fatigues.",
    "Mr. Joffe, a fellow at Stanford’s Hoover Institution, teaches international politics at the Johns Hopkins School of Advanced International Studies.",
    "Will Germans really shiver for Kyiv next winter, or face down Mr. Putin, who has raised the angst level by placing his nuclear forces on alert?",
    "A perfect welfare state like Germany is unlikely to max out defense spending overnight, especially while Covid is claiming billions of euros.",
    "Blame geography and Otto von Bismarck, who famously counseled: “Never cut the link to St. Petersburg.” Russia is so near, and America so far.",
    "Since 1970 the Federal Republic has financed a vast network that would feed the country’s industrial machine with plentiful Russian gas.",
    "For more than 50 years, Bonn and later Berlin had taken a pacific approach: Don’t rile the Russians; enmesh them in trade and diplomacy.",
    "Resentment reaches all the way to the soccer pitch where Schalke, a prominent club, has torn the Gazprom logo from its blue jerseys.",
    "WSJ Opinion: Putin’s Ukraine Invasion Exposes Europe's Energy Dilemma\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Defense spending is to be jacked up to 2% of gross domestic product, a longstanding NATO goal honored consistently in the breach.",
    "Images: Reuters/Sputnik/AFP via Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Three thousand main battle tanks dwindled to 260; the backbone of the Luftwaffe, the Tornados, are destined for the scrap heap.",
    "Nor will Germany cut itself off from Russian gas, given that the country wants to save the planet by ditching coal in 2038.",
    "Now it wants to send not only armor and antitank gear but also Stinger antiaircraft missiles that come with a sly message.",
    "Now, after the lunge into Ukraine, the biggest surprise is Russia’s loss of Germany, for decades a most reliable partner.",
    "All presidents since Richard Nixon correctly foresaw the strategic dependence trillions of cubic feet would impose.",
    "Who would have thought Mr. Scholz would call for the “strength” that must “impose limits on Putin, the warmonger”?",
    "Mr. Scholz, this peace-minded Social Democrat, unleashed a diplomatic revolution, turning Ostpolitik upside down.",
    "And in any case, Europe will still have to live with Russia and won’t want to anger this ruthless giant forever.",
    "If Mr. Putin does crush Ukraine, he will shift the balance of power against Europe, which breeds intimidation.",
    "Since 2008, when he set out to restore the Soviet empire, he has piled up territory at little risk and cost.",
    "Open Queue\n Vladimir Putin must feel like a lapdog who is suddenly banished from the couch to the basement.",
    "Mr. Scholz also wants to have two liquefied natural gas terminals to cut into Russia’s blackmail potential.",
    "If so, Germany in particular can say goodbye to billions in Russian credit as long as the lockout lasts.",
    "Thousands protest the Russian invasion of Ukraine in front of the Brandenburg Gate in Berlin, Feb. 24.",
    "Germany has been in and of the West but not always with it, balancing and mediating between the blocs.",
    "Germany, the world’s fourth-largest economy, shrugged off military power, though it could afford it.",
    "He subdued Georgia, grabbed Crimea, pushed into the Middle East, and sliced off Ukraine’s southeast.",
    "Nord Stream 2, which Ms. Merkel had defended to the last, won’t be completed, at least for now.",
    "Beijing shares with Moscow the ambition to topple the U.S. from its perch as the world’s No.",
    "Yet as late as 2021, when Chancellor Angela Merkel stepped down, Berlin clung to the deal.",
    "Nord Stream 2, the gas duct from Russia, was but the latest symbol of drushba—friendship.",
    "0:00 / 4:46\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Its last three nuclear power plants are still slated to be decommissioned by year’s end.",
    "As Gazprom’s best customer, Germany draws 55% of its gas and 45% of its oil from Russia.",
    "It has imposed nasty sanctions on Russia and is at last letting weapons get to Ukraine.",
    "In the 1980s these hand-held devices tilted the war in Afghanistan against the Soviets.",
    "Reluctant to provoke the bully in the Kremlin, Germany had always denied arms to Kyiv.",
    "So, don’t confront, don’t provoke, even while Mr. Putin shifted toward imperialism.",
    "Meanwhile, Europe's reliance on Russia for energy complicates the West's strategy.",
    "If China sidles up to Russia, the U.S. will pay the price of justice for Ukraine.",
    "It slapped him with mild penalties while preaching the virtues of diplomacy.",
    "Huddle under America’s nuclear umbrella, but stay on Moscow’s good side.",
    "Will the West fully expel Russia from Swift, the global payments system?",
    "With the end of the Cold War, the Bundeswehr turned into a waif.",
    "Presidents Obama and Trump actually pulled troops from Europe.",
    "It is joining the rest of the West with sanctions that bite.",
    "Germany will buy advanced F-35 fighters from the U.S.",
    "Propitiation was baked into Germany’s postwar soul.",
    "All the while, the West refused to raise the price.",
    "Right now, intensified collusion is a no-brainer.",
    "Baiting the bear isn’t a sustainable strategy.",
    "It is posed by the Chinese joker in the game.",
    "And not only the political class is fuming.",
    "Your browser does not support HTML5 video.",
    "The biggest question transcends Germany.",
    "Paused\nSound OnCreated with sketchtool.",
    "Never mind the carping from Washington.",
    "Thus the last week’s cosmic surprise.",
    "Up Next\nCloseCreated with sketchtool.",
    "The country is promising to rearm.",
    "The larger point is geostrategic.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Realism suggests caution.",
    "Geography is destiny.",
    "1."
  ]
}