{
  "id": 17588,
  "mediaId": 2830,
  "date": "2022-03-02",
  "headline": "The Invasion of Ukraine Brings Back Prague Spring Memories",
  "image": "",
  "link": "https://www.wsj.com/articles/kyiv-brings-back-memories-of-prague-invasion-ukraine-russia-soviet-union-authoritarian-seige-1968-11646257660",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elena Lappin",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "WSJ Opinion: Putin’s Ukraine Invasion Exposes Europe's Energy DilemmaPlay video: WSJ Opinion: Putin’s Ukraine Invasion Exposes Europe's Energy Dilemma\n As Vladimir Putin's invasion of Ukraine intensifies, Western markets hold up, but Russia’s financial system takes a beating.",
    "I remember watching the news with my parents and saying to my father, “I think they’re lying.” He replied, “You’re starting to understand politics.”\nThe Prague Spring was an audacious, possibly utopian experiment in transforming a communist regime into a democratic system.",
    "When Czechoslovakia defeated the unbeaten Soviets in the 1969 World Ice Hockey Championship, thousands of people poured into the streets in what was both a celebration and a political protest, unstoppable on the day but ultimately leading to political repercussions.",
    "Soviet leader Leonid Brezhnev assured Czechoslovakia’s Communist Party Secretary Alexander Dubcek and President Ludvík Svoboda that their “socialism with a human face” would be allowed to continue, sealing the agreement with a mafia-style kiss on the cheek.",
    "The Czechoslovak army was not allowed to mobilize (a painful echo of the lack of military resistance when Hitler invaded Czechoslovakia in 1939), but the unarmed civil population tried to resist by demonstrating and encircling the tanks.",
    "Ms. Lappin is a British novelist and journalist and author of the memoir “What Language Do I Dream In?”\nWSJ Opinion: Putin’s Ukraine Invasion Exposes Europe's Energy Dilemma\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "The most effective part of the early resistance turned out to be confronting the individual Soviet soldiers in Russian, explaining that their mission was based on a lie and Czechoslovakia didn’t ask to be liberated.",
    "Photo: Mondadori via Getty Images\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (5 minutes)\nAD\nLoading advertisement...\n00:00 / 05:27\n1x\nThis article is in your queue.",
    "I look at the horrific scenes on our television screens—peaceful Ukrainian cities turned into war zones overnight—and I think of the individual lives and stories, all changed by this bloody conflict.",
    "But my sense of reliving my own invasion disappeared as soon as it became apparent that Ukrainians were fiercely fighting back with their own army and their own armed civilian resistance.",
    "We made fun of the soldiers by pretending to photograph them until they confiscated our fake cameras: a matchbox with a pencil drawing inside saying “Ruskies go home.”\nBut they stayed.",
    "Less than a month before the invasion, Soviet and Czech delegations met for so-called friendly discussions in Cierna nad Tisou, a small Slovak town near the border with Soviet Ukraine.",
    "The Ukrainian woman confronting the Russian soldier with words, the man blocking the tank with his own body, the displacement of families—the trauma, individual and collective.",
    "With the Russian troops came “normalization,” to use the official term of the new regime, which meant the de facto rape of the country and silencing of free expression.",
    "Yet Mr. Putin’s demagogic justification of the attack on Ukraine as an act of liberation from nonexistent threats was taken straight out of Brezhnev’s 1968 playbook.",
    "The condemnations of Brezhnev’s act of aggression did nothing to prevent the Soviet Union from violating Czechoslovakia’s right to determine its own fate.",
    "Four armies of the Warsaw Pact invaded my small country under Soviet orders, putting a bloody end to the hopes and reforms of the Prague Spring.",
    "In a time when democracy has become a hollow word in many parts of the world, Ukrainian citizens are sacrificing their own lives to preserve it.",
    "The international reaction was an outpouring of sympathy for occupied Czechoslovakia and a warm welcome to its large wave of refugees.",
    "Unlike in 1968, many countries and international institutions are trying to stop the Russian aggression rather than appease Moscow.",
    "Images: Reuters/Sputnik/AFP via Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "It wasn’t really surprising that it made both Moscow and the hard-liners in the Czechoslovak Communist Party extremely nervous.",
    "Open Queue\nThe invasion of Ukraine brought back my raw memories of the Soviet occupation of Czechoslovakia in August 1968.",
    "The truly justified joy did not arrive until 1989, the year of the Velvet Revolution and the fall of the Iron Curtain.",
    "The official pretext for the invasion was to liberate Czechoslovakia from the dangers of Western corruption.",
    "Free press, open borders—these were freedoms no other country in the Soviet bloc could even hope to have.",
    "I had trouble explaining to my children what it was like to grow up in a world that was no longer there.",
    "I was 14 when I saw Russian tanks on the streets of Prague, Russian soldiers in the park near my home.",
    "It crushed the democratic freedoms and reforms gained during the hopeful months of the Prague Spring.",
    "When this new invasion began, I saw so many similarities I couldn’t imagine a different outcome.",
    "0:00 / 4:46\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Soviet tanks and armored cars during the early hours of the occupation in Prague, 1968.",
    "The crucial battle to defend the main radio station took place minutes from my house.",
    "Many became demoralized and were sent back, but the occupation proceeded as planned.",
    "Meanwhile, Europe's reliance on Russia for energy complicates the West's strategy.",
    "By the time we left, I had come to understand the meaning of a Soviet occupation.",
    "We are witnessing a heroic battle for freedom far beyond Ukraine’s own borders.",
    "In retrospect, I think there was a sense of helplessness in all that euphoria.",
    "Civilians tried to block the soldiers by burning tanks and throwing stones.",
    "It re-established Czechoslovakia as a key Soviet satellite state.",
    "I never imagined I would see my country liberated in my lifetime.",
    "My family emigrated to Germany two years after the invasion.",
    "I had to pass their stinking latrines on my way to school.",
    "The freedoms of the post-Soviet era became the norm.",
    "The Soviet soldiers were told we wanted them there.",
    "It remains to be seen whether we are doing enough.",
    "Your browser does not support HTML5 video.",
    "My father took me along to experience it.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "We received sympathy—not support.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "History is who we are today."
  ]
}