{
  "id": 17694,
  "mediaId": 2518,
  "date": "2022-02-27",
  "headline": "Invasion stirs food-price concern",
  "image": "https://wehco.media.clients.ellingtoncms.com/static-4/ao_redesign/graphics/adgog.jpg",
  "link": "https://www.arkansasonline.com/news/2022/feb/27/invasion-stirs-food-price-concern/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Grocery manufacturers are concerned that while the vast majority of ingredients and materials for American products are sourced domestically, the economic effects of the war in Ukraine will be seen around the world, said Katie Denis, vice president of communications and research at the Consumer Brands Association, an industry group.",
    "But Jason Furman, a Harvard professor who was chairman of the Council on Economic Advisers in the Obama administration, said in an email that \"a gas tax holiday suspension would be a bad idea: it would provide relatively little relief for consumers and would also provide a decent share of its benefits to oil producers.",
    "\"The faster Europe and other importing countries reduce their needs for oil and gas, the smaller the geopolitical power of Russia will be,\" David Hawkins, director of the climate center at the Natural Resources Defense Council, said in an email.",
    "\"As Russia continues its unprovoked attack on Ukraine, the average price of crude oil could remain above $100 per barrel and push the price of regular unleaded even higher than it is now,\" Kelly said Thursday in a letter to President Joe Biden.",
    "Together, Russia and Ukraine supply 29% of all wheat exports and 75% of global exports of sunflower oil, said Kelly Goughary, senior research analyst at Gro-Intelligence, an agriculture data platform.",
    "Robb MacKie, president of the American Bakers Association, said consumers will start seeing prices rise for anything that has grain in it, noting that the grain markets \"are all tied to each other.\"",
    "Russia's invasion of Ukraine has raised concerns about the potential for pushing U.S. food prices even higher, as the region is one of the world's largest producers of wheat and some vegetable oils.",
    "Even before Russia's invasion of Ukraine, the price of gasoline in the U.S. had jumped by 90 cents a gallon over the past year, according to the Energy Information Administration.",
    "\"In a situation where the whole supply chain is already stressed, if [the conflict] goes on more than a couple weeks, you will start to see an impact in food prices,\" he said.",
    "That's going to prompt concern when costs to make and ship goods continue to set records and consumer demand continues to be above levels not seen since March 2020,\" she said.",
    "Instead, energy experts say, Biden should focus on helping Europe cut the link to Russian fuel supplies as soon as possible and on strengthening renewable sources of energy.",
    "Mark Kelly, D-Ariz., and Maggie Hassan, D-N.H., introduced legislation this month that would suspend the federal gasoline tax until the beginning of 2023.",
    "\"This is headed for a supply crunch that will be hard to resolve,\" said Todd Hultman, lead grain market analyst for the agricultural data service DTN.",
    "\"Hardworking families cannot continue to bear the economic hardship of high gas prices while paying for more expensive groceries and medicine.\"",
    "Russia's attack has imperiled shipping in the Black Sea region, which is where much of the area's wheat shipments are exported.",
    "It would even be slightly helpful to Russia by putting some upward pressure on the global price of oil, albeit not a lot.\"",
    "It is also the world's largest exporter of sunflower seed oil, an important component of the world's vegetable oil supply.",
    "\"It's my assumption that Ukrainian crops won't get planted, or not anywhere near what they typically plant,\" he said.",
    "At the same time, Russia's influence on global oil and natural gas markets is upending U.S. domestic energy politics.",
    "The new inflation shock comes at a time when global markets remain strained because of pandemic-related disruptions.",
    "Michael Swanson, Wells Fargo's chief agricultural economist, predicted the attack will cause \"a multiyear issue.\"",
    "The Chicago Board of Trade's March wheat contract, the global benchmark, rose to its highest point since 2012.",
    "And the invasion could disrupt the ability of Ukrainian farmers to plant and harvest crops this year.",
    "\"There is no slack in the system, making weathering disruption significantly more difficult.\"",
    "\"We're already seeing energy prices rise and commodities futures for wheat and corn spike.",
    "Information for this article was contributed by Steven Mufson of The Washington Post.",
    "\"NATO should be looking at decarbonization as a key strategic planning requirement.\"",
    "Some food commodity prices hit their highest points in nearly a decade on Friday.",
    "\"And the Russian crops will be planted but will be embargoed in many markets.",
    "Meanwhile, Americans also face the threat of a further rise in energy prices.",
    "Ukraine is the world's fourth-largest exporter of corn and wheat.",
    "This is not something that will be resolved in weeks or months.\"",
    "There are a number of factors pushing the prices up so quickly.",
    "Corn and soybean prices also soared.",
    "Sponsor Content",
    "Sens."
  ]
}