{
  "id": 17827,
  "mediaId": 2859,
  "date": "2022-03-04",
  "headline": "How U.S. states in the West are sanctioning Russia",
  "image": "https://deseret.brightspotcdn.com/dims4/default/3d584d0/2147483647/strip/true/crop/1024x585+0+49/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FZmb1PDoDUjglO982TzxesIQC3kE%3D%2F0x0%3A1024x683%2F1024x683%2Ffilters%3Afocal%28417x211%3A418x212%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F22743274%2FAP21207764711502.jpg",
  "link": "https://www.deseret.com/2022/3/4/22961801/west-governors-react-russia-us-sanctions-ukraine-invasion",
  "mediaOutlet": "Deseret News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "D. Hunter Schwarz",
  "authorUrl": "https://www.deseret.com/authors/hunter-schwarz",
  "termIds": [
    0
  ],
  "sentences": [
    "Already, an approximately $300,000 bond in a Russian oil company was sold on Wednesday, but several million invested in Russian debt holdings and other assets cannot currently be sold off because of a freeze by the Russian government, according to The Associated Press.",
    "“My administration supports federal sanctions against the Russian government and Russian state-owned institutions for Russia’s acts of aggression and invasion of Ukraine,” Polis told U.S. Secretary of State Antony Blinken in a letter.",
    "Jared Polis notified the Ukrainian Embassy and Consulate last week that his state would welcome Ukrainian refugees, and he also called on the Colorado treasurer to ensure no taxpayer dollars are used to support the Russian government.",
    "“Colorado is also acting to condemn Russia’s actions on a state-level and to support Ukrainians home and abroad.”\nAt the federal level, several Western lawmakers have called on President Joe Biden to push U.S. sanctions even further.",
    "Sen. Lisa Murkowski, R-Alaska, co-sponsored a bill with Sen. Joe Manchin, D-W.Va., that would declare a national emergency and ban all Russian crude oil, petroleum, petroleum products, liquefied natural gas and coal.",
    "In a letter to the Russian Embassy and Consulate, Polis said Colorado was severing diplomatic ties with Russia, and Colorado would only reconsider recognizing Russia again if it withdrew from Ukraine.",
    "“California has a unique and powerful position of influence given the state’s substantial global investment portfolio,” Newsom said in letter to state agency chairs on Monday.",
    "Western senators including Sen. John Tester, D-Mont., Sen. Steve Daines, R-Mont., Sen. Mark Kelly, D-Ariz., and Sen. John Hickenlooper, D-Colo., support the bill.",
    "Gavin Newsom said no state money should go to Russia, and he’s called on state-run retirement funds to not purchase Russian debt and made other recommendations.",
    "“Utah stands in solidarity with Ukraine and will not support Russian enterprises, no matter how small the exchange,” Cox said in a statement.",
    "Newsom said the state’s public employee and teacher retirement systems have more than $1.5 billion linked to Russian financial markets.",
    "California’s $3 trillion gross domestic product is the largest of any U.S. state and more than Russia’s $1.4 trillion GDP.",
    "In U.S. states in the West, governors and lawmakers are taking their own steps to fight back against Russian aggression.",
    "Russia’s invasion of Ukraine has been met with sanctions from countries, and companies refusing to do business there.",
    "Spencer Cox admitted that while it isn’t much, his state will take even the smallest measures.",
    "State-run liquor stores in Idaho and Utah are pulling Russian products from their shelves.",
    "Idaho lawmakers want their state-run endowment fund to also pull its money from Russia.",
    "In the U.S. House, Speaker Nancy Pelosi said she backs the ban.",
    "California Gov.",
    "Colorado Gov.",
    "Utah Gov."
  ]
}