{
  "id": 17820,
  "mediaId": 2629,
  "date": "2022-03-04",
  "headline": "Mitch McConnell Finds More Rejection In Search For GOP Senate Candidate",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTQ3OTg2Ni9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY4NTUxMTA2MH0.nzLA72L3mtRyuneB18do9Ofr0AU02U1gB4AzBjLv0bY/img.jpg?width=1200&coordinates=0%2C75%2C0%2C76&height=600",
  "link": "https://www.nationalmemo.com/mitch-mcconnell-2656845085",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Israel",
  "authorUrl": "https://www.nationalmemo.com/u/josh-israel",
  "termIds": [
    4267,
    3179,
    2915,
    2459,
    1126,
    1312,
    1489,
    1122,
    872,
    629
  ],
  "sentences": [
    "While Senate Democrats are fighting to lower costs for American families, potential Republican candidates know they cannot defend their party's disastrous agenda of raising taxes, ending Medicare and Social Security, and pushing the interests of big corporations and the wealthiest few at the expense of working families.",
    "\"Right now I have the job I want, and my intention is to close my years of service to Arizona with a very productive final legislative session AND to help elect Republican governors across the country in my role as chairman of the Republican Governors Association.\"",
    "The Democratic Senatorial Campaign Committee released a statement Thursday noting the trend:\nOnce again, Senate Republicans' recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic Senators like Mark Kelly.",
    "Sen. Mitch McConnell\nDissatisfied with the current field of candidates running to challenge Mark Kelly (D-AZ) for his Senate seat this November, Republicans in charge of recruitment efforts sought to convince term-limited GOP Gov.",
    "Rick Scott released an 11-point \"Rescue America\" plan last Tuesday that called for a tax increase for more than 100 million retired, poor, and middle-income Americans and a five-year \"sunset\" on every single federal law.",
    "Ducey had previously expressed his lack of interest in joining the Senate race, but McConnell and Scott reportedly mounted a full-court press to convince him to change his mind before the April 4 filing deadline.",
    "In explaining his decision, Sununu openly acknowledged that he did not want to join a Republican caucus that is singularly focused on obstructing legislation and blocking President Joe Biden's agenda.",
    "Larry Hogan — the rare Republican who has repeatedly won statewide in the usually blue state — turned down McConnell and Scott and said he would not challenge Democratic Sen. Chris Van Hollen.",
    "Phil Scott also reportedly turned down national-level Republicans and opted to seek a fourth two-year term in his current job rather than run for retiring Sen. Patrick Leahy's (D) open seat.",
    "If it were enacted, even vital safety net programs like Social Security, Medicare, and Medicaid would expire every five years unless Congress could agree on a reauthorization.",
    "\"They were all, for the most part, content with the speed at which they weren't doing anything,\" he said of the Republican incumbents who encouraged him to run for Senate.",
    "With forecasters rating control of the chamber after the midterms a toss-up, these recruitment failures could be a big factor in determining who has a majority in 2023.",
    "\"If you're going to run for public office, you have to really want the job,\" Ducey explained in a letter to donors, excerpted by the Arizona Republic.",
    "On Thursday, Minority Leader Mitch McConnell and National Republican Senatorial Committee Chair Rick Scott got a flat rejection.",
    "Chris Sununu also spurned McConnell and Scott, opting to seek reelection rather than run against Democratic Sen. Maggie Hassan.",
    "Democrats currently are the majority party in the 50-50 Senate due to Vice President Kamala Harris' tie-breaking vote.",
    "\"Just because you can win a race doesn't mean that's the job you should do if your heart's not in it.",
    "\"I sincerely appreciate all the people who have been encouraging me to consider it,\" he explained.",
    "This is the latest in a series of high-profile 2022 recruitment failures for the two GOP leaders.",
    "\"It was very clear that we just have to hold the line for two years.",
    "OK, so I'm just going to be a roadblock for two years.",
    "And I just didn't see myself being a U.S.",
    "Last month, term-limited Maryland Gov.",
    "In November, New Hampshire Gov.",
    "He did not change his mind.",
    "Republican Vermont Gov.",
    "That's not what I do.\"",
    "Doug Ducey to run.",
    "Mitch McConnell",
    "senator.\""
  ]
}