{
  "id": 1804,
  "mediaId": 2658,
  "date": "2022-02-04",
  "headline": "The arguments a Russian bank is leaning on to evade potential sanctions",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/02/04/the-arguments-a-russian-bank-is-leaning-on-to-evade-potential-sanctions-00005910",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5797,
    5361,
    3315,
    1639,
    1841,
    2878,
    1223,
    6569,
    6672
  ],
  "sentences": [
    "— “Delta Chief Executive Ed Bastian, in a previously unreported letter to U.S. Attorney General Merrick Garland, said the action ‘will help prevent future incidents and serve as a strong symbol of the consequences of not complying with crew member instructions on commercial aircraft.’” Bastian “noted there is currently a no-fly list that is a subset of the terrorism watch list that allows the U.S. government to prohibit persons considered a threat to civil aviation from traveling on airlines,” and said the airline “has placed nearly 1,900 people on Delta’s ‘no-fly’ list for refusing to comply with masking requirements and submitted more than 900 banned names to the Transportation Security Administration to pursue civil penalties.”\nIF YOU MISSED IT THURSDAY: CNBC’s Brian Schwartz reports that “former aides to Sen. Joe Manchin lobbied his office and others in Congress on behalf of several corporate giants in the runup to the West Virginia lawmaker declaring he wouldn’t support President Joe Biden’s $1.75 trillion climate and social spending bill.”\n— “At least three former aides to Manchin represented nearly a dozen corporate clients in the October-December quarter that lobbied the House and Senate on the legislation, which is known as Build Back Better, according to a CNBC review of lobbying disclosure reports.”\n— “The former Manchin aides lobbied on behalf of companies such as T-Mobile, Best Buy, oil and gas driller Kinder Morgan, mining company Perpetua Resources and chemical and biofuel firm Gevo.",
    "Employee Political Action Committee (PAC)\nNew Lobbying Registrations\nBolton-St. Johns, LLC: Justleadershipusa\nDelta Dental Of California: Delta Dental Of California\nErvin Graves Strategy Group, LLC (F/K/A Ervin Hill Strategy): Triumph Enterprises, Inc.\nKeller Partners & Company: Kansas Christian College\nMonument Advocacy: Seafood Nutrition Partnership\nMs. Michelle Nawar: Bolton-St. Johns LLC On Behalf Of Justleadershipusa\nPaul Hastings LLP: Blockchains Inc.\nNew Lobbying Terminations\nErnst & Young LLP (Washington Council Ernst & Young): National Business Aviation Association\nMckechnie & Company: American Short Line And Regional Railroad Assoc\nMckechnie & Company: Kansas Board Of Regents\nMckechnie & Company: Watco Companies, LLC\nT Cap Solutions, LLC: West Realm Shires Services, Inc. D/B/A Ftx US\nFollow Us",
    "Each is deploying its own strategy to political spending and lobbying — a different approach than what some other embattled industries have taken, such as the consistent message that oil and gas or gun manufacturing companies often bring to legislation.”\nMEANWHILE, IN MASSACHUSETTS: Protocol’s Hirsh Chitkara and Anna Kramer have a good look behind the scenes of the fight by labor advocates to defeat gig economy giants Uber, Lyft, DoorDash and Instacart in a redo of 2020’s costly fight to continue classifying workers as independent contractors, which has now relocated from California to Massachusetts.",
    "… If the gig companies succeed in the deep blue, labor-friendly Massachusetts, they’ll have a political playbook ready to export around the U.S.”\nDELTA PUSHES FOR HARSHER PENALTIES FOR UNRULY FLIERS: “Delta Air Lines wants the U.S. government to place passengers convicted of on-board disruptions on a national ‘no-fly’ list that would bar them from future travel on any commercial airline,” Reuters’ David Shepardson reports.",
    "Mark Kelly, Michael Bennet)\nHouse Conservatives Trust (Rep. Jim Banks, House Conservatives Fund)\nTeam Pinion Inc (Joe Pinion for U.S. Senate Inc., Higher Ground PAC Inc.)\nNew PACs\nConservative Leadership for Colorado (Super PAC)\nDefending our Country PAC (DOC PAC) (Leadership PAC: Brooke Taylor)\nLeadership for America PAC (PAC)\nJersey Strong (Super PAC)\nPA United FedPAC (PAC)\nPIM Brands Inc.",
    "BREAKING DOWN SILICON VALLEY’S GIVING IN 2021: “Big tech companies’ PAC donations plunged last year after the Jan. 6 insurrection, according to the companies’ 2021 campaign finance filings — and as Google, Facebook and Amazon each pursued separate approaches to doling out money amid rising threats from Congress,” according to POLITICO’s Emily Birnbaum.",
    "But in a letter to an official on the National Security Council this week, Kucik argued the privately owned bank “should not be the subject of any impending U.S. sanctions actions, nor should it be named as a potential sanctions target in any legislative or executive authorities,” according to documents filed with the Justice Department.",
    "— Kucik pointed to a note from Sovcombank’s managing director that insists none of the bank’s major shareholders or individual or corporate account holders are senior foreign officials or sanctioned individuals, or special purpose vehicles without operational activities, which refers to entities formed for narrow or temporary objectives.",
    "Meanwhile, Facebook’s parent company Meta devoted its attention to leading senators, particularly those on committees charged with overseeing tech issues.”\n— “The initial breakdown, based on filings made public this week, show the companies far from presenting a united front amid the anti-tech backlash among lawmakers of both parties.",
    "International food and consumer goods conglomerate Unilever, which employs a former member of Manchin’s staff as a lobbyist, engaged with the West Virginia lawmaker’s team through a letter co-signed by other corporations, the company said.”\nCORRECTION: Thursday’s newsletter misstated the beneficiary of the BGR Group's fundraiser.",
    "— In his letter to the NSC, Kucik argued that Sovcombank’s inclusion in even Menendez’s draft bill “has already impugned Sovcombank’s good reputation.” Sovcombank, he continued, simply wants “to ensure that the bank is not further punished by any unwarranted imposition of sanctions.”\nHappy Friday and welcome to PI.",
    "— With the letter came a 28-slide PowerPoint presentation offering an overview of the company, which described Sovcombank as a “BANK FOR LOW- & MODERATE-INCOME CLIENTS” with “HIGH STANDARTS [sic] OF CORPORATE GOVERNANCE” that only accounts for 1.7 percent of total assets in the Russian banking sector.",
    "But Senate Foreign Relations Chair Bob Menendez (D-N.J.) told POLITICO this week that the bill he’s crafting with ranking member Jim Risch (R-Idaho) won’t be “far afield” from legislation he introduced last month that had the backing of the White House and most of the Senate Democratic caucus.",
    "In response, the Russian bank has hired a high-powered team of lobbyists from Mercury Public Affairs to plead its case for being left out of a bipartisan package coming together on the Hill, apparently tailoring its appeal in part on Democrats’ focus on social equity and climate issues.",
    "— Another slide calls Sovcombank “an undisputed leader in ESG” and describes its membership in global ESG initiatives while another slide details the bank’s commitment to diversity, equity and inclusion — all of which are issues the Biden administration has sought to promote generally.",
    "The arguments a Russian bank is leaning on to evade potential sanctions\nBy CAITLIN OPRYSKO\n02/04/2022 05:15 PM EST\nWith Daniel Lippman\nFARA FRIDAY: Sovcombank was named as one of a dozen potential targets in a Democratic bill last month for sanctions if Russia invades Ukraine.",
    "But its new leader, Wesley McEnany, thinks he has a novel strategy that could actually prevent the same type of bloodbath.”\n— That involves rebranding labor advocates’ campaign by tying gig companies to, and relying on, the public’s distrust of Big Tech companies.",
    "— “Google’s and Amazon’s campaign donations to congressional candidates and committees focused on rank-and-file House moderates of both parties, whose votes could determine the prospects of trust-busting legislation in the lower chamber.",
    "The slideshow boasts that over a third of management positions within the bank are filled by women; that there is no gender pay gap up to middle management levels and that even among top management there exists only a 3 percent pay gap.",
    "— Bipartisan negotiations on a sanctions package aimed at deterring Moscow from attacking Ukraine are still taking shape, so it’s not definite that Sovcombank is still in lawmakers’ crosshairs.",
    "— Mercury’s team on the account will include two former lawmakers, Sen. David Vitter and Rep. Toby Moffett, as well as Peter Kucik, a former sanctions official at the Treasury Department.",
    "It touts the bank’s investments from major Western financial institutions as well as from sovereign wealth funds in the Middle East and the Japan Bank for International Cooperation.",
    "— Gig companies “are expected to once again break records for campaign spending, quite possibly surpassing the state record of $60 million spent across all ballot measures in 2020.",
    "The bank enlisted Mercury late last week on a $90,000-per-month contract that will initially last six months, according to a copy filed with the Justice Department.",
    "— That bill called, among other things, for President Joe Biden to choose at least three from a list of 12 Russian financial institutions to sanction.",
    "— But Mercury also appears to appeal explicitly to an emphasis on social consciousness shared by the Biden administration and Democrats more broadly.",
    "— The National Retail Federation announced that Walmart U.S. President and CEO John Furner will be the new chair of the board of directors.",
    "Vans Stevenson, who has led the state government affairs department for 26 of his 32 years at the MPA, will become senior adviser.",
    "“The fight for votes has become less about substance and more about a glut of cash — a bit like the tech industry itself, in 2022.",
    "Lyft already broke [Massachusetts’] one-time political contribution record when it made a $14.4 million donation late last year.",
    "Jobs Report\n— Art Motta is now national director of policy and legislation at the League of United Latin American Citizens.",
    "Former Trump transition official Bryan Lanza, John Lonergan and Deirdre Stach will lobby for the bank as well.",
    "— Michael McGonagle is now vice president of the National Railroad Construction and Maintenance Association.",
    "— Kathy Bañuelos joined the Motion Picture Association as senior vice president of state government affairs.",
    "— Nate Adams will be campaign manager for Sen. Lisa Murkowski’s (R-Alaska) reelect, Playbook reports.",
    "— Mark Medish has joined Project Associates to lead its U.S. operations as vice chair of the board.",
    "(For large U.S. banks, the slideshow helpfully notes, that figure can be as much as 29 percent.)",
    "Despite the financial shenanigans, this fight has enormous implications for the future of work.",
    "He most recently was a director at National Victory Action Fund, and is a Dan Sullivan alum.",
    "The ‘No’ campaign — led by labor groups — admits its defeat in California was crushing.",
    "He previously was president of the Messina Group and is a Clinton administration alum.",
    "He takes over the role from former Qurate Retail, Inc. President and CEO Mike George.",
    "Bañuelos was most recently vice president of government affairs at NBCUniversal.",
    "He most recently was policy adviser for Rep. Eric Swalwell (D-Calif.).",
    "New Joint Fundraisers\nArizona Colorado 2022 Victory Fund (Sens.",
    "It is Democratic New Jersey House candidate Rob Menendez.",
    "He was previously NRC's senior director of operations.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "Tips, please: coprysko@politico.com.",
    "Sovcombank was one of the 12.",
    "PI regrets the error."
  ]
}