{
  "id": 1813,
  "mediaId": 2618,
  "date": "2022-02-09",
  "headline": "White House sends Kamala Harris to Europe to 'reassure' allies in Ukraine's standoff with Putin as Pentagon draws up early plan to evacuate Americans from Kiev to avoid another 'messy withdrawal' and Kabul catastrophe",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/09/white_house_sends_kamala_harris_to_europe_to_reassure_allies_in_ukraines_standoff_with_putin_as_pentagon_draws_up_early_plan_to_evacuate_americans_from_kiev_to_avoid_another_messy_withdrawal_and_kabul_catastrophe_78867.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rob Crilly &",
  "authorUrl": "",
  "termIds": [
    2469,
    4591,
    840,
    5925,
    6569,
    6672,
    6678
  ],
  "sentences": [
    "Hey, just doing what she does best in the name of world peace...\nFTA: Their mission would be to help coordinate an evacuation of some of the estimated 30,000 Americans in Ukraine in the event of an invasion, but would not involve flying them out of the country.",
    "The White House on Wednesday announced that Vice President Kamala Harris will travel to Europe next week as part of an effort to deter Russian aggression against Ukraine.She will meet allies and partners at the Munich Security Conference.",
    "At the same time it emerged that the White House has reportedly signed off on a Pentagon plan to use U.S. troops in Poland to help evacuate American citizens from Ukraine if Russia invaded.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Maybe John Kerry can join her at the conference nd make her trip an even more useless waste of time and money to further distract everyone from the Biden Regime's problems.",
    "We will release a story (fairy tale) that says I solved the war problem and have earned my foreign relations badge, so vote for me in 2024 or sooner!\"",
    "Oh yeah, she is really going to Europe for the fine dining experience and to shop at all the stores and boutiques that the rich people shop at.",
    "'This trip is about engaging our allies and partners and building upon the intensive engagement that is already under way,' an official said.",
    "Will she cackle like Hillary Clinton and bring back the foreign policy nightmares of her Sec of State days to our European allies?",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Let's face it folks, that new German leader took his measure of this so called prez and he gave Putin a call.",
    "Will she she find the root cause of why everyone says Russia will invade Ukraine (Biden's bad poll numbers)?",
    "I can hear here now: \"Who's a girl got to sleep with around this place to bring peace to Europe?!?!?!?",
    "I assure you that we will find the root cause of the problem of this Biden fabricated war scenario!",
    "Putin will remove all his troops immediately and be very impressed when this empty vessel arrives!",
    "C'mon Putin, I'll show you why Willie Brown always had a smile on his face when I was around!!!\"",
    "It has been reported the two could not stop laughing when they discussed the first vegetable!!",
    "By relieved I mean urinating in their pants, and by quaking I mean laughing uncontrollably.",
    "Will she sit there and stare like a loyal golden retriever with a clueless blank stare?",
    "So if Americans to need to be evacuated, the military's role will be what exactly?",
    "I bet the Ukrainians are just so relieved that she is there to save the day!",
    "She has been hidden more in the past year than Willie Brown's weenie.",
    "Your donation helps keep our discussions going and our voices heard.",
    "Hahahahaha yeah sure just like they did in Afghanistan.",
    "Will the Cackling Canadian visit her embassy in Paris?",
    "The Munich conference will also be speechless when Ms.",
    "She knows absolutely nothing about building anything.",
    "And the Russians are just quaking in their boots.",
    "Call it the Kamaltoe Appeasement Tour 2022.",
    "Will she also visit the Jamaican embassy?",
    "\"How To Insult Allies In One Easy Trip.\"",
    "It be the one with the maple leaf flag.",
    "What exactly will Kamala contribute?",
    "Evacuate Americans from Ukraine?",
    "Shallow than shallower appears.",
    "Kamala: \"Don't worry be happy!",
    "Cackle, cackle, cackle.",
    "Act as travel agents?",
    "The Indian Embassy?",
    "Oh my, oh my!!!",
    "Oh my God.",
    "Thank you.",
    "!"
  ]
}