{
  "id": 1815,
  "mediaId": 2520,
  "date": "2022-02-07",
  "headline": "Sinema, Kelly and Schweikert want extension of telehealth coverage",
  "image": "https://www.gannett-cdn.com/presto/2021/03/06/PPHX/1e0c25dd-6ed8-4214-a275-dd7432755934-pjimage_6.jpg?crop=1911,1075,x4,y0&width=1911&height=1075&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/local/arizona/2022/02/07/sinema-kelly-and-schweikert-push-extension-telehealth-coverage/9315771002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cami Parrish",
  "authorUrl": "https://www.azcentral.com/staff/6528856001/cami-parrish/",
  "termIds": [
    2459,
    4265,
    3788,
    5879,
    772,
    475,
    91,
    1433,
    5949
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nBoth Kelly and Sinema have been advocating for expanded coverage and funding of telehealth services for Arizona residents in rural communities, and helped to secure over $2 million in funding for Arizonans from the Federal Communications Commission’s COVID-19 Telehealth Program at the end of the 2020.",
    "In a written statement, Sinema said, “permanently expanding telehealth services expands access to affordable care for Arizona seniors and reduces federal spending as we recover from the pandemic and resulting economic downturn.”\n“Expanding telehealth for Arizonans in rural communities is critical to getting us through this ongoing health crisis,” Kelly said in a written statement.",
    "In a written statement to The Arizona Republic, Schweikert, a co-chair of the Congressional Telehealth Caucus, said that throughout the pandemic, telehealth has become a reliable source of care for many Arizonans that must be preserved.",
    "Now Sinema, Kelly and Schweikert, R-Ariz., along with more than 40 other senators and representatives from around the country, joined together to urge Congress to work to ensure telehealth coverage for Medicare recipients beyond 2023.",
    "In 2021, Sinema and Kelly, both Arizona Democrats, co-sponsored the CONNECT for Health Act, which expanded coverage of telehealth services under Medicare and expanded eligibility for access by removing geographical restrictions.",
    "Telehealth services that are covered by Medicare under the CONNECT for Health Act include all medical services that are conducted in a contactless manner, either using video or audio technology.",
    "The three Arizonans say they believe telehealth options are an important resource for patients because they provide necessary medical care while minimizing the transmission risk of COVID-19.",
    "\"These services are delivering high-quality results for people across our country, and it is critically important we work to expand them beyond the current limits,\" Schweikert said.",
    "However, as new variants of the virus that causes COVID-19 emerge, members of Congress have become increasingly concerned about Medicare coverage of telehealth services after 2023.",
    "Kyrsten Sinema and Mark Kelly and Rep. Dave Schweikert are pushing for an extension of telehealth coverage for people enrolled in Medicare beyond 2023.",
    "About 1.1 million Medicare beneficiaries live in Arizona, according to the most recent data available from The Kaiser Family Foundation.",
    "Medicare is generally for people over the age of 65, younger people with disabilities and people with end stage renal disease.",
    "“This funding will make sure health care providers can support more families across the state where they are.”",
    "The telehealth coverage was originally set to expire at the end of 2023.",
    "Sens."
  ]
}