{
  "id": 1867,
  "mediaId": 2618,
  "date": "2022-02-09",
  "headline": "Marjorie Taylor Greene's word soup: Republican Rep. compares Capitol cops to the 'Gazpacho' police after colleagues accused officers of illegal raiding their offices during January 6 probe",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/09/marjorie_taylor_greenes_word_soup_republican_rep_compares_capitol_cops_to_the_gazpacho_police_after_colleagues_accused_officers_of_illegal_raiding_their_offices_during_january_6_probe_78897.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katelyn Caralle",
  "authorUrl": "",
  "termIds": [
    1933,
    2187,
    4066,
    3246,
    3115,
    1126,
    1429,
    6175
  ],
  "sentences": [
    "Marjorie Taylor Greene accidentally used the word 'gazpacho' – which is a cold Spanish soup – when meaning to accuse House Speaker Nancy Pelosi of using Capitol Police as Nazi 'gestapos' to spy on GOP lawmakers.The Republican Georgia congresswoman insisted in an interview with One America News on Wednesday that United States Capitol Police (USCP) are being used as 'political pawns' and Pelosi is 'sending them into our offices' to take pictures and snoop around.She said Pelosi is also having them probe visitors who want to meet with members of Congress.",
    "The same people here and elsewhere that are harping on MTG for her word gaffe are the same people who probably think that Sandy Cortez, Cory Bush, Hank Johnson, Maxine Waters, Nancy Pelosi and Kevin McCarthy are geniuses.",
    "Spending four hours listening to her discuss the goings-on on the house floor and interact with Tim and the crew on other topics allowed me to understand that she's actually an intelligent and sincere human being.",
    "They seldom mention when Dementia Joe spews word salad in press conferences or speeches... greyseal\nGazpacho……a diverse mix of VEGETABLES, that do nothing more than sit around and stay mixed together.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "This boomer has been regularly watching Tim Pool’s Timcast IRL and became a fan when MTG appeared on his show last month and finally had a chance to hear her unfiltered.",
    "Frankly, referring to the cowardly, so/called “Capital Police”, defender and covers for the murdering of an innocent, unarmed woman, as “gazpacho” is right on target.",
    "Using this word instead of the one leftists hurl around like wet soup might not only gain more traction, but protect her from censure and even removal.",
    "#6, the reason MTG does not appear very bright is because she is a Republican and there are many very smart people in Congress on the Republican side.",
    "Let me tell you she gained a lot of fans that night explaining how our “representatives were not bothering to vote and allowing bad bills to pass.",
    "If MTG was a Democrat she would appear to be a genius because she would be getting compared to Occasional-Cortex and Hank \"Capsize\" Johnson.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Before this, all I had to base my opinion on was MSM reports which focused on making her look like a ninny.",
    "I for one would take one of her over a dozen each of them everyday of the week and twice on Sunday.",
    "I wonder if they had anything to do with Seth Rich's murder on a quiet street in the dark of night.",
    "I've had the pleasure of watching and listening to MTG on Tim Pool's IRL live streams on YouTube.",
    "They dropped the investigation and Donna Brazille said she always looks over her shoulder.",
    "Now whenever we hear or read the word, gazpacho, we will automatically think of Gestapo.",
    "MTG, you hit the nail on the head, sad that so many leftists can’t suss out an analogy.",
    "#6 is just another person who believes what the lying MSM broadcasts and publishes.",
    "I remember you posting that you were abandoning us Deplorables forever.",
    "Your donation helps keep our discussions going and our voices heard.",
    "Stoopid Daily Mail doesn't understand that Reps can be censured etc.",
    "So much so that “somebody” swatted the live show the next night.",
    "It also drives the left nuts which is just another bonus point.",
    "Life is good when you can ridicule the knee-jerk democrats.",
    "Makes the point without using an already overused word.",
    "Last night both MTG and Thomas Massie were on the show.",
    "You, sounds like the CCP(Capitol City Police) to me.",
    "And since when is making a verbal gaffe newsworthy?",
    "for leveling strong accusations toward another Rep.",
    "The Capital Police are acting like the KGB.",
    "Glad to see bygones can still be bygones.",
    "She is a welcome thorn in Pelosi’s side.",
    "Not even motivated enough to get warm.",
    "I highly recommend both episodes.",
    "BTW - AOC is the idiot, not MTG.",
    "Ever watch House of Cards?????",
    "FJB, Let's Go Brandon, MAGA.",
    "Pretty smart if you ask me.",
    "You never disappoint!",
    "Gazpacho they are.",
    "#6 - Welcome back!",
    "Thank you, #10.",
    "I like it!",
    "Thank you.",
    "Hmmmm.",
    "MAGA!"
  ]
}