{
  "id": 1886,
  "mediaId": 2618,
  "date": "2022-02-09",
  "headline": "What Are They Hiding? Democrats Argue Voting Machines Too Fragile to Inspect – If Investigators Touch Them They WIll Need to Be Replaced – Demand Rudy Giuliani Be Punished for Requesting Access to Dominion Machines",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/09/what_are_they_hiding_democrats_argue_voting_machines_too_fragile_to_inspect__if_investigators_touch_them_they_will_need_to_be_replaced__demand_rudy_giuliani_be_punished_for_requesting_access_to_dominion_machines_78894.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Hoft",
  "authorUrl": "",
  "termIds": [
    4794,
    4623,
    3037,
    3019,
    6360
  ],
  "sentences": [
    "That’s weird?Also in Arizona election workers were caught on video deleting “archived” files before the machines were turned over\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "When I was the Election Site Officer at a 2020 early voting location here in TN, an individual whom I did not know showed up with a badge and task to \"update\" the Hart InterCivic eSlate Judge's Booth Controller (JBC) while the early voting was active.",
    "That \"update\" was done via an internet connection (the eSlate booths themselves had no direct link to the internet - I had checked the router administrative log), which should have voided the entire eSlate system certification.",
    "Other issues I experienced with these machines over the 10 years I have served as an elections judge and site officer have convinced me that paper ballots submitted in person at controlled locations are the \"least bad\" option.",
    "If the Vegas casinos told the gambling commissioner that their slot machines would need to be replaced if the officials audited their fairness, they would be laughed off the premises and marched to the state pen.",
    "connect the computer voting machine to the internet and you can download software to modify what the voter enters any way you want, then switch it back at the end of each day to cover your tracks.",
    "FTA: \"In Arizona Democrat Secretary of State Katie Hobbs argued that Maricopa County would be forced to replace their Dominion voting machines if they were inspected by investigators.\"",
    "** In Arizona Democrat Secretary of State Katie Hobbs argued that Maricopa County would be forced to replace their Dominion voting machines if they were inspected by investigators.",
    "Q: If this were a casino or poker hall accused of money laundering, how long could they claim that their internal computers were too fragile to inspect...and get away with it?",
    "To obtain the ability to tamper with paper ballots is to allow ballot harvesting and drop boxes where there is no over-site of who actually filled out the ballots.",
    "And Dominion is suing Guliani, Powell and Lindell for libel and slander, I thought it was $1.3 billion each, but wait, the voting machines can't be evaluated?",
    "Despite my concern that the evidence has been destroyed this is conformation that there is indeed something substantive to be gathered from the machines.",
    "Anyone who still believes that these people are not hiding a massive crime that rigged the 2020 election is either a total sucker or is in on the steal.",
    "The rumor is Coomer was like the Colonel Jessup character in A Few Good Men, and did everything he could to almost say, \"you can't handle truth\".",
    "A manual paper ballot system is not perfect (nothing involving human or artificial intelligence is), but it is \"LEAST BAD\" among current options.",
    "This is not funny as powers that be bank up paper and cement walls to hold in this puppet regime and gulag ones who do not parrot the narrative.",
    "It really happened.Democrats and their media lackeys are so certain of this that they will not allow anyone to inspect the voting machines.",
    "Fragile described democrats who FEAR any inspection of these doctored computers because they know they know they were programmed to cheat.",
    "Frankly, I'm for the \"voting machines\" to be a plywood box with a couple of padlocks and a slot in the top and NO electronics whatsoever.",
    "Every one of these machines needs to be given a DETAILED physical and forensic digital examination of all the software and hardware.",
    "Anyone and everyone willfully involved in this monumental crime needs to pay the ultimate price and it needs to be swift and sure.",
    "A check with the county Director of Elections authorized the \"intervention\", of which I was skeptical but then allowed to proceed.",
    "NO ethernet, or wifi, or any other kind of an electronic wired or wireless connection that can be made under ANY circumstances.",
    "They just have to look at how they blatantly cheated and stole the 2020 election to know how stupid they think we are!!!!",
    "These hardy little computerized thingamabobs have to be melted down and smashed apart to even go into a garbage dump.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "If you can't make it on THE ONE DAY for voting, IN PERSON, then, too darned bad, you don't get to vote that time.",
    "And,the excuse that the machines are so delicate that they can never be audited is hot steaming B.S..\nTotal BULL.",
    "Controlled locations should not be susceptible to internet and/or VPN \" vulnerabilities and technical problems\".",
    "If there is ANY incriminating evidence on ANY of these machines, somebody just raised stupidity to an art form.",
    "It goes without saying that machines too fragile to be inspected would be of no value in the upcoming election.",
    "This is NOT about convenience or speed, this is about ACCURACY and immunity from hacking and external control.",
    "What bothers me so much is if it was a fair and free election then no one should be afraid of being audited.",
    "Don’t you know by questioning election integrity you are now part of the heightened domestic terror threat?",
    "I would ask if they honestly think that we are that stupid, but we already know they think we are stupid.",
    "Dip you finger in the indelible \"a week to wear off\" purple ink, drop your vote in the slot, and leave.",
    "Every adult citizen needs to see what happens to those who willfully attempt our nation's destruction.",
    "I continue to be insulted by the left’s opinion that we will actually believe anything they say.",
    "There should be NO POSSIBLE way to link to a voting machine electronically from the outside.",
    "And since they keep getting away with evil idiocy like this, they are probably right...",
    "First of all, I immediately assume it’s a lie because lying is their first language.",
    "The criminal attempt to overthrow our Nation is Treason and it is a capital offense!",
    "So easy to stand on the rock of truth than to protect a paper castle from rain.",
    "Knowing now the problem with these \"updates\", I should have objected stronger.",
    "Paper ballots are a lot harder to tamper with than computer voting machines.",
    "or Tank Abrams sort of votes, and Karen votes -like Karen Fann votes in AZ.",
    "So the judge hid his testimony from the attorneys defending their clients.",
    "Eliminating voter ID also eliminates over-site of who actually is voting.",
    "Are the inspection denials due to the machines no longer exist intact ??",
    "Any Az voters on the board that can tell us if these 2 are mcvain mafia?",
    "They're pushing a million bad votes already in AZ-in just 3 counties!!",
    "(BTW: I am a retired MSEE with 50+ years directly related experience.)",
    "This goes along with Eric Coomer's pre-trial deposition being sealed.",
    "Has Ms. Hobbs ordered replacements for the shoddy Dominion machines?",
    "Your donation helps keep our discussions going and our voices heard.",
    "Or are they just being kept to be used in the 2022 ( and 2024 !? )",
    "Who in their right mind would EVER believe such transparent LYING?",
    "NO ONE can be that stupid and ba able to remember to breathe.",
    "The machines were so delicate that they can never be audited.",
    "Yet, Ms Fann is dancing around that, w/ her crony -the AG.",
    "Their response alone is a prima-facie admission of guilt.",
    "Overseas military will vote the same way at their bases.",
    "If not, how can they possibly conduct the next election?",
    "If it is important to you, MAKE PLANS to be there.",
    "This must never, EVER be allowed to happen again!!",
    "Truly incredible— like not credible on any level.",
    "They're junk and will have to be replaced anyway.",
    "Then they have to be crushed with a car crusher.",
    "Secondly, this absurdity begs to be challenged.",
    "I'll have what they're drinking, bartender.",
    "The old flack over the target thing again.",
    "Poster #2 gets a major award for that!",
    "Fantastically, incredibly mendacious.",
    "A certified paper trail is essential.",
    "It used to be “Moe, Larry, cheese”.",
    "Joe Biden got 81 million votes.",
    "I will tell you about fragile.",
    "NO mail in ballots whatsoever.",
    "And now it’s “Mis, dis, mal”.",
    "Is that Legal votes #3 ??",
    "Fragile, my aunt Minnie!",
    "\"Convenience\" be damned.",
    "Interesting point #37.",
    "This is great news.",
    "O gimme a break.",
    "A: Mere seconds.",
    "election !!??",
    "Too fragile??",
    "Too fragile?",
    "Corruption?",
    "Thank you.",
    "CHEATING.",
    "Probably!",
    "CROOKS.",
    "LYING.",
    "LOL!"
  ]
}