{
  "id": 1932,
  "mediaId": 2618,
  "date": "2022-02-09",
  "headline": "38 Republican lawmakers write to Biden AGAIN to urge him to take a cognitive test: GOP says 'something isn't right' and Americans deserve to have 'absolute confidence' in the President",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/09/38_republican_lawmakers_write_to_biden_again_to_urge_him_to_take_a_cognitive_test_gop_says_something_isnt_right_and_americans_deserve_to_have_absolute_confidence_in_the_president_78873.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Elkind",
  "authorUrl": "",
  "termIds": [
    1656,
    2765,
    4905,
    4950,
    1126,
    467,
    6678
  ],
  "sentences": [
    "MAGA\nHere's an opinion from someone who really knows...an elderly 83 years old...who raised seven children...and did a fine job....BUT...I'm the first to recognize that I'm not that go getup gal I used to be...and my memory isn't as sharp as it was...so I'm pleading with biden's wife to have the courage to admit he's putting Americans in danger and he needs to step down for medical reasons....china has paid off tooooo many of the swamp and there must be someone in DC that sees the damage and act accordingly...the biden cabal that is running the country can manipulate commie/harris as well...but please put biden to bed...\nDemocrats: In the name of God, human decency, and the safety of the United States, please insist that Biden undergo a thorough medical examination of his cognitive status.",
    "What really irks me is Biden's name will be associated with the evil he has done to this nation, but Obama's fingerprints won't be seen, because he's who's really doing the planning behind the curtain.",
    "They worked together, with help from the Republicans, to oust Donald Trump from the presidency because he wanted to make the USA a strong, peaceful, and prosperous nation with functioning borders.",
    "Reading from a teleprompter and answering questions about his favorite ice cream only reenforce the growing public perception that it's time to take the car keys away from Grandpa.",
    "Rather, it’s his leftist chief of staff, Klain and the stunningly dishonest leftist Susan Rice who are selecting the freaks for cabinet, court and regulatory positions.",
    "Biden is a demented buffoon but he's only the person reading the prompter and cards handed to him some un-elected person is in charge doing all of this to the nation.",
    "If President Pepper-Head ever took the test, the public would not be privy to the results because they know and we know he would perform like the vegetable he is.",
    "Joe has done absolutely nothing good and his mental condition is the reason but the democrats and peppermint patty always have another reason for his failures.",
    "I'd say it's pretty obvious to everybody (even the MSM although they would vigorously deny it) what the results of such a test would be, should it be taken.",
    "Regardless of who might be pulling the strings, and we all know Biden is not the decision maker, he is still the face to the world representing the US.",
    "We are on autopilot right now and thank God President Trump put us on course before the Biden Communists stormed the cockpit and hijacked America.",
    "We don't have a government we are witnessing a Kakistocracy; a fraud government in control of a nation by the worst and least qualified to do so.",
    "But also in this case we also have a right to know who exactly is/are the person(s) who are actually performing the duties of this office.",
    "Anyone knowingly involved in perpetuating this charade should be prosecuted for treason as they are endangering every US citizen.",
    "Given his history of being bad-tempered along with dementia patients having anger issues, this must be making his head explode.",
    "The Republicans always think criminals are going to confess and be remorseful, although there is no case of it ever happening.",
    "He said republicans should stop mentioning Joe's mental condition and substitute hammering him on performance in office.",
    "Like a Mafia Don who does the ordering of \"hits\", Obama is the planner and executer, but is invisible and untouchable .",
    "It was like a mother leading her 5 year old to the bathroom before they had lunch at the food court in your local mall.",
    "Jill told him they were letters praising his outstanding presidential skills like eating ice cream and pooping pants.",
    "I'm betting one of the puppet masters will say something like ''We don't need no mental acuity over here.''",
    "I know that he will never be given any test and that even if he were, the WH would lie about the results.",
    "Camel Lala is still an effective insurance policy even though the degradation is steady and obvious.",
    "Then what's left of the Ashat media will just bug off and go back to their own self-involvement.",
    "#9, the agencies that installed the puppet know full well who he is, and who pulls his strings.",
    "If you believe getting rid of Joe will slow down this communist freight train, you are naive.",
    "The propagandists who run what we pretend are our independent media outlets know this too.",
    "Just sayin'...anyone with two brain cells to rub together knows it ain't Shufflin' Joe.",
    "Let’s honor the 911 Patriots and force this out of control government into the ground!",
    "My question: So, what's the \"end game,\" should he take the test and prove the obvious?",
    "It's important for all citizens to have confidence in any President's mental acuity.",
    "This is a very serious issue that puts our country in a very precarious position.",
    "China and Russia are well aware of the situation and are taking full advantage.",
    "But when he was done Mrs. FJB took him by the hand and lead him off the stage.",
    "I'm hopeful we can survive the Sniffy Joe years, and move on to better things.",
    "Not to mention that the people who are really running the country are insane.",
    "One day he will commit an act not even the media will be able to spin away.",
    "Communism will chug right along until someone stops it and removes them.",
    "It doesn’t matter if FJB is cognizant or not because he isn’t it charge.",
    "Biden received the letters, but was unable to read and comprehend them.",
    "The country is going down the tubes and Republicans spend time on this?",
    "I'm surprised that Russia and China have not made their moves already.",
    "And who are setting the anti economic growth and open border policies.",
    "But I still love that the Republicans keep poking him with this stick.",
    "Joe isn’t “right in the head” but it doesn’t matter, test or no test.",
    "How can anyone, including democrats support this ridiculous farce?",
    "You see Biden in a cognitive test every time you see or hear him.",
    "What a mockery of the greatest country the world has ever known.",
    "Surely there is another issue that requires your attention.",
    "And they are not about to let someone else take the wheel.",
    "Hannity made a comment last night that was truly stunning.",
    "The American people are going to have to take it back.",
    "Most thieves and narcissists have fairly high IQs.",
    "They aren’t going to give up the power they have.",
    "It’s his puppet masters we need to be aware of.",
    "I say continue to hit the target that counts.",
    "This isn't about FJB's intelligence quotient.",
    "Might I suggest the J6 political prisoners!",
    "To jump from the frying pan into the fire?",
    "I don't think the test can be any plainer.",
    "I don't know what it was or where it was.",
    "That picture was worth a thousand words.",
    "He look small, pathetic and out of it.",
    "He was shuffling his feet all the way.",
    "Everyone knows Joe is mentally unfit.",
    "A few days ago FJB made some speech.",
    "So this is an exercise in futility.",
    "In fact, I rather like that idea.",
    "38 Republicans, typical of you.",
    "And none of the words was good.",
    "Keep it up, House Republicans!",
    "That's how far gone we are.",
    "Anyway, I agree with #12.",
    "Let him destroy himself.",
    "Let him destroy himself.",
    "Potato Head is mashed.",
    "President Kamala?",
    "President Psaki?",
    "They got this.",
    "Unbelievable!",
    "To what end?",
    "Let’s Roll!",
    "He will.",
    "Come on!"
  ]
}