{
  "id": 2103,
  "mediaId": 2522,
  "date": "2022-02-08",
  "headline": "Biden advises Americans in Ukraine to leave the country",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/02/SG-Biden-and-Scholz.jpeg",
  "link": "https://www.bizpacreview.com/2022/02/08/biden-advises-americans-in-ukraine-to-leave-the-country-1198323/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Haggerty",
  "authorUrl": "https://www.bizpacreview.com/author/kevin-haggerty/",
  "termIds": [
    0
  ],
  "sentences": [
    "The coalition, he went on, is ready to “impose swift and severe consequences if Russia violates Ukraine’s sovereignty and territorial integrity.”\nSpeaking of any potential moves by Russian President Vladimir Putin, Biden remarked, “I don’t know that he knows what he’s going to do.”\n“And I think he has to realize that it would be a gigantic mistake for him to move on Ukraine,” he added.",
    "“The impact on Europe and the rest of the world would be devastating, and he would pay a heavy price.”\n“We cannot remain silent,” Scholz added after stressing the “military threat” in and “against Ukraine.”\nI welcomed Chancellor Olaf Scholz of Germany today for his first visit to the White House.",
    "pic.twitter.com/Uu1ex9J1B6\n— President Biden (@POTUS) February 8, 2022\nThough 3,000 U.S. troops have already been deployed to NATO allies across eastern Europe and another 8,500 have received standby orders from Defense Secretary Lloyd Austin, Biden attempted to emphasize diplomatic options.",
    "President Biden: I Think It’s Wise For Americans To Leave Ukraine pic.twitter.com/MRAViYfUVZ\n— Casey McCarney (@caseymack7777) February 7, 2022\nThe threat posed by Russia was also addressed at length during the joint press conference between the two world leaders.",
    "This bill stands as an alternative to a proposal by Sen. Ted Cruz (R-TX) that would place immediate sanctions on the pipeline and would have allowed Congress to overturn a waiver of sanction by the president.",
    "We will act together and will take all necessary steps.”\nThe current plan to sanction the pipeline and Russian officials comes from a bill proposed in early January introduced by Sen. Robert Menendez (D-NJ).",
    "We discussed our diplomatic and deterrence response to Russia’s military build-up on Ukraine’s borders, and our shared commitment to working closely together to address common challenges.",
    "We will be able to do that.”\nLast year, Biden removed sanctions on the Nord Stream 2 pipeline that had been imposed by the Trump administration allowing halted construction to resume.",
    "The remarks were part of German Chancellor Olaf Scholz’s first official visit to Washington Monday where he and Biden met at the White House for a discussion on values and leadership.",
    "Following the joint press conference between Biden and Scholz, Cruz highlighted what he calls Biden’s “weakness and incoherence” on a potential invasion of Ukraine.",
    "“I am talking about Americans who are there.”\n“I would hate for them to get caught in cross-fire, if in fact they did, and there’s no need for that,” Biden added.",
    "Cruz’s bill did have bipartisan support as Democrat Senators Tammy Baldwin (WI), Mark Kelly (AZ), and Raphael Warnock (GA) voted in favor of the sanctions.",
    "“If Russia invades, that means tanks and troops crossing the border of Ukraine again,” Biden qualified, “then there will be no longer a Nord Stream 2.",
    "Regarding cooperation with the United States, he added, “You can be sure that there won’t be any measures in which we have a different approach.",
    "“We have intensively prepared everything to be ready with necessary sanctions if there is military action against Ukraine,” Scholz declared.",
    "In spite of Biden’s warning on the pipeline, Scholz remains confident that Germany will not suffer should the pipeline shut down.",
    "Of course the truth is there are still very real steps we can take to halt Nord Stream 2 – but only if we act immediately.",
    "“If Russia makes a choice to further invade Ukraine, we are jointly ready, and all of NATO is ready,” Biden stated.",
    "I am not talking about our diplomatic corps,” Biden clarified citing the increased threat of a Russian invasion.",
    "We will bring an end to it”\nThe president did not say how he would bring “an end to it” only that, “We will.",
    "https://t.co/mmPRU3qGAd\n— Ted Cruz (@tedcruz) February 8, 2022\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "In particular, the leaders were asked about potential action on the Nord Stream 2 pipeline.",
    "Waiting until after an invasion, as Biden wants to do, reeks of weakness and incoherence.",
    "Germany relies heavily on the pipeline that was meant to act as leverage against Russia.",
    "It would only take effect after potential aggressive action taken against Ukraine.",
    "President Biden warned Americans in Ukraine to flee before it is too late.",
    "However, the bill failed to attain the 60 votes needed.",
    "The public will not see it and we do not share it.",
    "“I think it would be wise to leave the country.",
    "Not exactly confidence inspiring.",
    "I promise you."
  ]
}