{
  "id": 2198,
  "mediaId": 2745,
  "date": "2022-02-10",
  "headline": "Opinion Yes, gas prices are up. But cutting the gas tax is not the answer.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SD2HY4UJG4I6ZA4PBT67NHGOHQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/02/10/gas-prices-up-tax-holiday-not-the-answer/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Their share would likely be larger in a nationwide tax cut than that of an individual state, due to the larger effect on oil prices, says Severin Borenstein, a professor of energy, business and economics at the University of California at Berkeley.",
    "Additionally, producers’ share of the tax cut is likely to be bigger when supply is relatively constrained (as is the case right now), because prices are more likely to respond to increases in demand.",
    "But that ain’t gonna fix the fact that global energy demands are way up and energy supply chains remain severely constrained by covid — and, more recently, by the threat of conflict involving Ukraine.",
    "Also, that eye-popping 40 percent annual price growth owes partly to the unusually low prices in January 2021, when most everyone was still hunkering down from the pandemic and not driving very much.",
    "And it’s understandable why people might care more about gas prices than those of other goods: In the short term, they can’t alter their behavior all that much to avoid the pain of higher fuel costs.",
    "Year-over-year growth in the consumer price index hit another four-decade high in January, according to data released Thursday, and gasoline is among the categories with the sharpest increases.",
    "Finally, even if consumers did capture all the benefits of a gas-tax holiday, there’s the question of whether this is the most socially responsible way to provide relief to pinched households.",
    "Politicians could target rebate checks to lower-income households that are less able to absorb the cost of rising prices (not just of rising prices for gas but for everything).",
    "Mark Kelly (D-Ariz.) and Maggie Hassan (D-N.H.) have introduced a bill to suspend the federal gas tax until year’s end — just through the midterms, coincidentally!",
    "Retail gas prices are determined primarily by crude oil prices set by a global market, which is not controlled by the U.S. president or Congress or governors.",
    "President Biden can release oil from the Strategic Petroleum Reserve to show he’s Doing Something, such as the 50 million barrels announced in November.",
    "Since then, incomes have also risen, and cars have become more fuel-efficient, so a gallon of gas gets you farther today than it did in years past.",
    "Retail gas prices have risen 40 percent over the past year, with regular gas averaging $3.48 per gallon nationwide as of Thursday.",
    "In the long run, we want incentives that entice people to shift their behavior toward less greenhouse-gas-intensive technologies.",
    "Further subsidizing gasoline — with the biggest benefits going to people with the least fuel-efficient vehicles — isn’t helpful.",
    "Likewise, Biden can claim a recent antitrust probe will ferret out whether sneaky “illegal conduct” is keeping gas prices high.",
    "In previous state-level gas-tax holidays in Indiana and Illinois, oil producers captured as much as 30 percent of the savings.",
    "Already, the price of gasoline doesn’t reflect the fuel’s full cost to society from carbon emissions and other pollution.",
    "But the fix that Senate Democrats and some red and blue states are considering — a gas tax holiday — is not the answer.",
    "Adjusted for inflation, for example, gas in mid-2008 would work out to be well above $5 per gallon in today’s dollars.",
    "Despite these scary numbers, today’s gas prices look relatively moderate when you consider some additional context.",
    "The federal gas tax is just 18.4 cents per gallon, and state gas taxes and fees average about 30 cents per gallon.",
    "But that extra oil is a drop in the barrel — equivalent to less than three days’ worth of U.S. oil consumption.",
    "But your commute is your commute, so when gas prices rise you’re stuck paying more to fill up your tank.",
    "Even if those taxes are zeroed out, consumers don’t necessarily capture the full value of the savings.",
    "But somehow, particularly in an election year, that’s never an admission politicians want to make.",
    "Several states have proposed cutting their gas taxes as well or canceling planned increases.",
    "For one thing, the gas tax is a relatively small part of the price consumers pay.",
    "They get blamed for the resulting pain, so they want to swoop in with solutions.",
    "Americans are mad about high gas prices, and politicians want to show they care.",
    "If, say, beef prices go up, you can switch to chicken or some other substitute.",
    "In other words, gas prices are not terribly high, in historical terms.",
    "But consumers are sensitive to the sticker price they see at the pump.",
    "Not an implicit government guarantee that gas will always stay cheap.",
    "— with some Democratic colleagues co-sponsoring the legislation.",
    "All this doesn’t mean there’s no scope for immediate relief.",
    "They could also fess up to their impotence on this issue.",
    "The latest proposals involve cutting the gas tax.",
    "Thing is, they can’t do very much.",
    "Politicians keep trying anyway.",
    "It can’t change prices much.",
    "Politicians know this.",
    "Sens."
  ]
}