{
  "id": 2274,
  "mediaId": 2644,
  "date": "2022-02-08",
  "headline": "Arizona AG says state can cite ‘invasion’ to deport migrants without feds",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/arizona-immigrants-comp-1.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/08/arizona-ag-says-state-can-cite-invasion-to-deport-migrants/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steven Nelson",
  "authorUrl": "",
  "termIds": [
    5763,
    5703,
    3401,
    4905,
    2915,
    1126,
    5949
  ],
  "sentences": [
    "“Thankfully, the Founders foresaw that States might need to protect themselves from invasion and made clear in the Constitution that States retain the sovereign power to defend themselves within their own territory.”\nRepublican Arizona state Rep. Jake Hoffman requested the opinion, which was published Monday night, after former Trump administration officials Ken Cuccinelli and Russ Vought proposed last year that border states like Arizona dust off an obscure provision in the Constitution to address the border crisis.",
    "Brnovich, who is seeking the GOP nomination to challenge US Sen. Mark Kelly (D-Ariz.) later this year, wrote in the opinion that “only the Governor of the State of Arizona has the power to make a final determination” that the state is under invasion and then “establish the exact parameters for the exercise of the defensive use of force.”\nDucey issued a response to Brnovich that suggested he would not listen to the idea.",
    "“For Attorney General Brnovich to imply the Guard is not on our border does them a serious disservice and shows that he fails to appreciate the commitment these men and women have to protecting Arizona.”\nThe Department of Homeland Security and the American Civil Liberties Union, which challenged prior Arizona state policies to restrict immigration, did not immediately respond to The Post’s requests for comment.",
    "A Biden White House official last year told The Post they foresee a collision course if Arizona were to follow through with the plan, insisting that “enforcing immigration laws is under the purview of the federal government, so state authorities doing it or taking part in immigration enforcement would be illegal.”",
    "“The violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an ‘invasion’ under the U.S. Constitution, and Arizona therefore has the power to defend itself from this invasion under the Governor’s authority as Commander-in-Chief,” Brnovich wrote.",
    "Cuccinelli, a former acting deputy director of the Department of Homeland Security, and former White House budget director Vought — now the president of the conservative nonprofit Center for Renewing America — met with Brnovich and members of his staff last month.",
    "The approach would theoretically allow Arizona to break with the Biden administration and start turning away people at the US-Mexico border, where officials made approximately 1.9 million arrests last year.",
    "Ducey to in fact go ahead and do that and start turning people around at the border in between the ports of entry.”\n“Technically, it’s a war power, but we’re not talking about tanks and planes,” he went on.",
    "“An actual invasion permits the State to engage in defensive actions within its own territory at or near its border.”\nCuccinelli told The Post that “this obviously turns attention now not just to Gov.",
    "“We’re literally just talking about people meeting people crossing the border, probably thumb-printing them, taking their picture and turning them around back across the border from whence they came.",
    "“Arizona has and will continue to protect our communities with our National Guard, our Border Strike Force and in partnership with local law enforcement,” Ducey spokesman CJ Karamargin said.",
    "And that’s it.”\nA similar rapid deportation process began in 2020, when the Trump administration cited the COVID-19 pandemic to quickly deport most suspected illegal immigrants.",
    "Well, the attorney general of Arizona has given him the method to do that, to actually solve the problem, instead of just complain about the problem,” Cuccinelli added.",
    "Doug Ducey can declare the Grand Canyon State to be under “invasion” in order to begin deporting suspected illegal immigrants — but Ducey appears reluctant to do so.",
    "Ducey … was extremely aggressive in committing himself to protecting Arizona and Arizonans and at the border [in his recent state of the state speech].",
    "The Biden administration still uses that authority, called Title 42, to deport some migrants, but stresses it is a temporary public health measure.",
    "“The federal government’s failure to secure the border and protect Arizona from invasion is dangerous and unprecedented,” Brnovich wrote.",
    "Ducey in Arizona — though that’s the logical first place — but over to Texas and people asking, ‘Well, why don’t you do this?",
    "Arizona Attorney General Mark Brnovich claims in a new legal opinion that Republican Gov.",
    "“And we call on Gov.",
    "'”\n“Gov."
  ]
}