{
  "id": 2277,
  "mediaId": 2528,
  "date": "2022-02-08",
  "headline": "Chuck Schumer says he supports banning lawmakers from trading stocks: 'I would like to see it done'",
  "image": "https://i.insider.com/60d2fd1a45ef6f00183a60a6?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/chuck-schumer-stock-trading-ban-like-to-see-done-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryan Metzger",
  "authorUrl": "https://www.businessinsider.com/author/bryan-metzger",
  "termIds": [
    0
  ],
  "sentences": [
    "Senate Majority Leader Chuck Schumer gave public support on Tuesday to his colleagues' growing efforts to rein in their fellow lawmakers' trades of individual stocks after he previously dodged questions on whether he would support such a ban.",
    "Brown, for his part, told Insider at the Capitol that the senators and their staff have been meeting for a few weeks and that they're still working out the differences between proposals senators have put forward.",
    "Insider's Conflicted Congress investigation found that 55 members of Congress and nearly 200 senior staffers have violated the current law aimed at stopping insider trading and avoiding conflicts of interests.",
    "U.S. Senate Majority Leader Sen. Chuck Schumer Alex Wong/Getty Images\nSchumer made his support for banning lawmakers from trading stocks public, telling Insider \"I would like to see it done.\"",
    "Insider has also rated every member of Congress and their office's compliance with the current law, which multiple lawmakers have said does not go far enough in stopping bad practices.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Schumer's comments come after Insider revealed on Friday that Schumer had asked a group of six Democratic senators to come together on a proposal to ban stock trading.",
    "Sen. Kelly, who introduced the Ban Congressional Stock Trading Act with Ossoff last month, declined to set any kind of deadline on potential compromise legislation.",
    "Merkley's Ban Conflicted Trading Act, a separate proposal from Ossoff and Kelly's, would apply a ban to senior congressional staffers but not to lawmakers' spouses.",
    "Jon Ossoff of Georgia, Mark Kelly of Arizona, Elizabeth Warren of Massachusetts, Sherrod Brown of Ohio, Jeff Merkley of Oregon, and Gary Peters of Michigan.",
    "After initially voicing her opposition to a ban, House Speaker Nancy Pelosi reversed her position on the issue last month.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Kelly also wouldn't say which, if any of the competing bills was emerging as the framework for a unified effort.",
    "Some proposals would ban the spouses of congressional lawmakers and top staffers from trading individual stocks.",
    "\"I don't think is a horse race,\" Kelly told Insider at the Capitol, adding, \"You want to get it right.\"",
    "\"We're talking about it … and we'll eventually come to some conclusion,\" he said of the working group.",
    "Insider reported on Friday that Schumer convened a group of senators to hammer out an agreement.",
    "\"So yeah, all those questions are complicated, but it's clear that we should do something.\"",
    "\"I believe in it,\" Schumer told Insider in response to a question about his position.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "All but Peters have previously co-sponsored legislation to ban stock trading.",
    "\"I have asked our members to get together to try to come up with one bill.",
    "It remains to be seen how onerous of a ban either leader would support.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Ossoff and Kelly, who recently introduced their own stock trading ban.",
    "\"This is something that the American people want,\" he said.",
    "He held out hope, however, that change is coming.",
    "said Brown, noting the differences at stake.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Do you include the Federal Reserve ?",
    "The group includes Democratic Sens.",
    "The working group includes Sens.",
    "Loading Something is loading.",
    "I would like to see it done.\"",
    "\"Do you include dependents?",
    "Do you include agencies?\"",
    "Do you include spouses?",
    "Do you include staff?"
  ]
}