{
  "id": 2376,
  "mediaId": 2735,
  "date": "2022-02-10",
  "headline": "Warren, Jayapal Introduce Bill Banning Members of Congress From Trading Stock",
  "image": "https://truthout.org/wp-content/uploads/2022/02/2022_0210-elizabeth-warren-1200x675.jpg",
  "link": "https://truthout.org/articles/warren-jayapal-introduce-bill-banning-members-of-congress-from-trading-stock/",
  "mediaOutlet": "Truthout",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sharon Zhang",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "This legislation goes a step further than the bill introduced by Senators Jon Ossoff (D-Georgia) and Mark Kelly (D-Arizona) last month, which bans stock trading for lawmakers and their families but allows them to retain ownership of their stock portfolios as long as they are put in a blind trust while lawmakers are in office.",
    "Senate Minority Leader Mitch McConnell (R-Kentucky) has said that he hasn’t decided either way on the issue, though far right Republican firebrands like Josh Hawley (R-Missouri) have signaled their support for a ban.",
    "Before you go — please read the important update below\nFor the last two decades, millions of readers have relied on Truthout to provide accurate, transparent journalism through moments of political and social crisis.",
    "“Capitalizing on their privileged positions and their access to nonpublic information through inappropriate stock trading is one glaring example of this problem,” said Danielle Brian, POGO’s executive director.",
    "“It’s good policy, and it’s simply the right thing to do.”\nThe Project On Government Oversight (POGO), a government watchdog, praised the bill, noting that stock trading within Congress is an ethical concern.",
    "Warren has previously introduced legislation that would also bar top federal officials like judges from trading stocks, but currently, bans on stock trading for members of Congress have the most momentum.",
    "The proposal goes further than previous bills, forcing members of Congress and their spouses to divest from all stocks other than widely held, diversified investment funds like mutual funds.",
    "The bill was introduced by Senators Elizabeth Warren (D-Massachusetts) and Steve Daines (R-Montana) and Representatives Pramila Jayapal (D-Washington) and Matt Rosendale (R-Montana).",
    "Congress has had its fair share of stock trading scandals in the past few years, and reporting has found that members of Congress regularly violate existing stock transparency laws.",
    "With rare bipartisan support in the House and the Senate, and support from the leaders of both chambers, the bill or legislation like it may have a shot at being passed.",
    "On Wednesday, a bipartisan, bicameral group of legislators introduced a bill that would ban members of Congress and their spouses from owning and trading stocks.",
    "Over the last year, we’ve struggled to meet our basic operating costs, as Facebook and Google have reduced the visibility of non-corporate news stories.",
    "If a lawmaker is familiar with their portfolio, in other words, they could still influence their stocks even if they aren’t in direct control of them.",
    "“No one should ever have to wonder whether their Member of Congress is working for the public interest or their own financial interest,” Warren said.",
    "But as long as members and spouses are allowed to hold and trade stocks, we keep the door open to corruption – and that cannot stand,” she said.",
    "The idea appears to have the support of most Democrats and some Republicans in the House, but Senate Republicans are split on the matter.",
    "The bipartisan bill’s sponsors emphasized that the proposal is a critical measure to increase transparency and trust in Congress.",
    "The Bipartisan Ban on Congressional Stock Ownership Act is the first bipartisan stock trading ban to be introduced in the Senate.",
    "As a result, our stories are being seen by fewer people at a time when trustworthy journalism is so desperately needed.",
    "We’re working hard to mitigate these issues but we still have an immediate need for your help, especially right now.",
    "On Wednesday, Pelosi instructed members of Congress to draft a bill for the ban that she would bring to a vote soon.",
    "We’ve been proud to remain donor-supported — not once accepting money from advertisers or corporate funders.",
    "“Members of Congress were elected to serve the people, not their personal financial interests.",
    "If members are found violating the law, they would be fined up to $50,000 per infraction.",
    "Whether you’re able to make a $5 monthly donation, or give more — we need you, today.",
    "Such investments could still be traded as long as there are no conflicts of interest.",
    "Jayapal said that the bill could reduce corruption in the legislative branch.",
    "We have just 2 days left in our fundraiser and still need to raise $22,000.",
    "Any amount of support you can spare right now will go a very long way.",
    "The bill would need 60 votes to overcome a filibuster in the Senate.",
    "Please, do what you can to help us get through this trying time.",
    "Get the news you want, delivered to your inbox every day.",
    "But now, we face an existential threat to our survival.",
    "Two Senate Republicans have also cosponsored the bill.",
    "Still, the legislation could face a few hurdles.",
    "Donate Now"
  ]
}