{
  "id": 2379,
  "mediaId": 2525,
  "date": "2022-02-07",
  "headline": "Myers: Congress must help US break free from China’s rare-earth grip",
  "image": "https://www.bostonherald.com/wp-content/uploads/2022/02/GettyImages-175141358.jpg?w=1024&h=683",
  "link": "https://www.bostonherald.com/2022/02/07/myers-congress-must-help-us-break-free-from-chinas-rare-earth-grip/",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Myers",
  "authorUrl": "https://www.bostonherald.com/author/nick-myers/",
  "termIds": [
    0
  ],
  "sentences": [
    "Nick Myers is the co-founder and CEO of Phoenix Tailings, a Massachusetts-based startup that has received grant funding from major venture capitalists, the Department of Energy and the Department of Defense.",
    "MP Materials and Urban Mining Co. have already innovated in this important field, operating domestic rare-earth mines and producing the rare-earth-powered magnets used in manufacturing.",
    "In 2010, they halted rare-earth metal exports to Japan for two months after the Japanese navy arrested the crew of a Chinese fishing boat that strayed into territorial waters.",
    "If exports were restricted for any reason — whether simply to prioritize domestic Chinese companies or as a prelude to a military conflict — the results would be catastrophic.",
    "Supported by the right public policy, the U.S. can use this innovation advantage to build its own domestic rare-earth metal supply chain without compromising our values.",
    "Almost every aspect of modern manufacturing uses at least one of these 17 elements — and America’s biggest geopolitical rival can turn off our supply whenever it wants.",
    "Specifically, it would create a yearlong strategic reserve of these vital materials and prohibit the use of Chinese-connected rare earths in defense manufacturing.",
    "We can compete with China using the unique American capacity for innovation, creating new ways to mine and refine rare earths without exacting a brutal human toll.",
    "Their method uses extremely hazardous chemicals like hydrofluoric acid and phosphorus pentoxide, producing 2,000 tons of toxic waste for every ton of rare earth.",
    "When the pandemic reached the United States, governments and hospitals were scrambling to buy what few protective gowns, N95 masks and other PPE were available.",
    "These critical materials are a vital component of almost everything manufactured today, from smartphones and electric vehicles to satellites and fighter planes.",
    "We take mining waste known as tailings and use proprietary chemistry and metallurgy to extract rare earths and other metals such as iron and platinum.",
    "They assume there is no way to compete with China without subjecting people to similarly unacceptable levels of pollution and carcinogenic waste.",
    "China only produced 25% of the world’s face masks, but it currently makes more than 90% of the world’s refined rare-earth metals.",
    "Phoenix Tailings, a company I co-founded in 2019, developed a novel processing technology that refines metal without the hazards.",
    "In 2019, the U.S. was the world’s largest importer of medical goods, and nobody thought there would ever be a shortage of PPE.",
    "Anyone unlucky enough to live nearby is at high risk for cancer; this method also taints local water supplies and farmland.",
    "China only dominates the export market because their lax regulations and abusive labor practices allow for cheap refining.",
    "One of the many lessons the world learned from COVID-19 is that supply chains are only noticeable once they stop working.",
    "We are home to almost all of the largest technology companies, most of which were founded within the last two decades.",
    "Our research universities are a magnet for talent, bringing new scientists and entrepreneurs to the U.S. every year.",
    "China’s brutal rare-earth production methods have made many Western manufacturers and policymakers fatalistic.",
    "Congress should pass the REEShore Act to address this grave threat to our economy and national security.",
    "We know the processing can be done here in the United States because we are doing it every single day.",
    "More than a decade later, China still has a near-monopoly on the global supply of rare-earth metals.",
    "The REEShore Act would be an important step in decoupling our supply chain from this massive risk.",
    "Tom Cotton and Mark Kelly, would develop a secure domestic supply chain for rare-earth metals.",
    "Ominously, China has proven they will use these crucial elements for geopolitical leverage.",
    "The REEShore Act would ensure these domestic companies don’t rely on China for processing.",
    "Right now, the United States is completely dependent on China for rare-earth metals.",
    "The REEShore Act would be an important step in the right direction.",
    "Instead of producing toxic waste, our method eliminates it.",
    "Despite the name, rare-earth metals are quite common.",
    "In February 2020, China restricted medical exports.",
    "America has long been a global innovation leader.",
    "This bipartisan bill, introduced by Sens.",
    "Fortunately, this is not the case."
  ]
}