{
  "id": 2386,
  "mediaId": 2671,
  "date": "2022-02-10",
  "headline": "This is how DESPERATE Democrats are before this year’s election",
  "image": "",
  "link": "https://therightscoop.com/this-is-how-desperate-democrats-are-before-this-years-election/",
  "mediaOutlet": "Right Scoop",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Right Scoop",
  "authorUrl": "https://therightscoop.com/author/therightscoop/",
  "termIds": [
    4803,
    3069,
    3026,
    2561,
    2459,
    2346,
    1973,
    1448,
    392
  ],
  "sentences": [
    "We know that Democrats are running scared ahead of this year’s elections, but a new report shows just how desperate they are to try and somehow mitigate the damage they are going to receive in November:\nYAHOO NEWS – Against a background of surging gasoline prices at the beginning of an election year, a group of Democratic lawmakers are calling for a suspension of the federal gas tax for the rest of 2022.",
    "Maggie Hassan (D-HN) and Mark Kelly (D-AZ) – both of whom are up for reelection in the fall – would suspend the 18.4 cents per gallon federal gas tax until the beginning of 2023.",
    "“People are feeling a real pinch on everyday goods, and we must do more to help address rising costs, particularly the price of gas,” Hassan said in a statement.",
    "The legislation would also empower the Treasury Department to monitor retail prices of gas to ensure that producers are passing the tax savings on to consumers.",
    "And it would require the Treasury to maintain the integrity of the federal Highway Trust Fund by covering the lost gas tax revenues with general tax revenues.",
    "Debbie Stabenow (MI), Catherine Cortez Masto (NV), Jacky Rosen (NV) and Raphael Warnock (GA) – have signed on as cosponsors of the bill.",
    "A recovering economy and the threat of war in Ukraine are expected to keep upward pressure on gas prices, at least in the near term.",
    "The nationwide price of a gallon of gas is now $3.45, about a dollar more than it was a year ago, according to AAA.",
    "The fact that they only want to remove it this year tells us it has everything to do with the upcoming elections.",
    "You know it’s bad when Democrats want get rid of a tax, even if it is only temporary.",
    "In the House, Rep. Josh Harder (D-CA) expressed support for the legislation.",
    "The Gas Prices Relief Act proposed by Sens.",
    "Several Democrats – including Sens."
  ]
}