{
  "id": 2440,
  "mediaId": 2618,
  "date": "2022-02-09",
  "headline": "Democrats propose federal gas tax holiday ahead of midterm elections",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/09/democrats_propose_federal_gas_tax_holiday_ahead_of_midterm_elections_78856.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Benjamin Siegel",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In this instance there is no doubt that the Democrats, if it is still politically possible after the election for the Democrats to do that, would bring those taxes back after the November election, very possibly also “jacking up” those taxes higher when the taxes are reimposed.",
    "the answer is to open the Keystone XL pipeline and get us back in the business of making American Great, Again - it's getting to look like any one of the politicians in D.C. either owes Soviet Russia or the CCP in one form of another - they are truly disgusting people.",
    "But, but, but I thought the idea was to INCREASE federal taxes to pay for roads and such because so many are driving less and have smaller cars to don't use as much gas causing a drop in income from this source and we needed to get more $$$$ due to this situation.....",
    "Obviously, as the original poster said, its nothing more than a ploy to buy votes from consumers hit hard by Bidenflation because \"pocketbook issues\" are often the driving force of most people to vote AGAINST those who would raise taxes as a means to control people.",
    "Not a budget buster per se, though I'm sure it impacts others more severely, but multiply that by 1,000s of drivers and that's millions of $$ that can't be spent elsewhere in the economy...where prices will rise due to increased transportation and materials costs.",
    "The senators, who are both on the ballot in November, released the proposal at a time when gas is roughly $3.45 a gallon nationwide, about\nComments:\nSurprise - the tax cut ends as soon as the midterm elections are over.",
    "Two Senate Democrats up for reelection proposed a bill on Wednesday to temporarily suspend the federal gas tax through the end of 2022, as millions of Americans grapple with the economic impacts of surging oil prices.",
    "Maggie Hassan, D-N.H., and Mark Kelly, D-Ariz., would suspend the $18.4 cents per gallon federal gas tax through Jan. 1, 2023, according to a summary of the proposal shared with ABC News.",
    "This tax reduction is the opposite of what the Greenies want to do...they want to Raise it substantially, by as much as a $1 per gallon, to fund electric cars/mass transit/bicycles etc.",
    "Whenever you think the politicians have become totally detached from reality, they go a step further down and prove that they are completely incapable of representing real Americans.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Feds collected about $35Billion in fuel taxes last year....IF they waive it for a year, the loss will be made up for by the increased spending via the Infrastructure Bill.",
    "Conversely, how many are going to boycott gasoline retailers, or calculate how much they saved and send a check to the treasury on Jan 1, if this bill is passed?",
    "Anyone think that the Democrats are not getting ready to push all sorts of bait and switch scams before the November election on the American public?",
    "Elminate the gas tax for a few weeks, lose the election, and then blame the Republicans coming into leadership for the price/tax increase.",
    "Problem is, enough left-leaning lemmings buy this kind of treatment and they go to the polls and knee-jerk pull the lever for democrats.",
    "Lift the federal gas tax just long enough to ease inflation fears and squeak to victory in November's mid-terms then reinstate the tax.",
    "Whomever proposed this idea needs to be taken behind the woodshed and receive some real instruction on how things work.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "As others have stated, the fed tax moratorium is just theater, don't address the underlying supply/price issues.",
    "(PS they really do want to let the SALT tax limits lapse, so their friends in high-tax blue states are happy.)",
    "How about going back to what the energy policy was under Trump and make the country energy independent again.",
    "State fuel taxes are nearly double Fed taxes in most states, Penn is highest at $0.58, Calif next at $0.51.",
    "I think what they really want to do is get out of the set price fuel tax, change over to a Percentage tax.",
    "Any legislation to do this should have amendments to make permanent all the Trump-era tax reductions.",
    "Suspending the gas tax just makes our infrastructure further deteriorate because it won't be funded.",
    "Once again, the scum demosluts reveal what they really think of the ordinary people.",
    "or simply Nationalize all roads and have congress in charge of funding all of them.",
    "Just went up $0.20/gal 48 hours ago in Central NC from $3.19 to $3.39.",
    "Joe and his puppet masters who play weekend at Bernie's everyday are.",
    "Your donation helps keep our discussions going and our voices heard.",
    "Gotta love the democrats and their symbolism over substance ideas.",
    "So MASSIVE that the loss of the fuel taxes is only 1/35 of it.",
    "They think the ordinary peon won't see right through this BS.",
    "They won't do that of course because it makes too much sense.",
    "The demonrat socialist marxist solution is to LOWER TAXES??",
    "Of course it's an obvious attempt to indirectly buy votes.",
    "They NEVER vote for cutting taxes-- its NEVER an option.",
    "Something, something about the mouth of a gift horse.",
    "this is not a solution, you bunch of communists!!!",
    "Then let's see how many Democrats vote for it.",
    "No incremental rise...$0.20 at one pop.",
    "The federal gas tax isn't the problem.",
    "The Gas Prices Relief Act from Sens.",
    "Gas is well over $5 / gallon here.",
    "Isn't paying for votes illegal?",
    "Laws don't apply to dumbocrats.",
    "Pretty neat trick by the Dems.",
    "$2.859...what a 'bargain'.",
    "Wouldn't even notice.",
    "Let's go Brandon!",
    "Oh I forgot.",
    "Just saying.",
    "Thank you.",
    "18 cents?"
  ]
}