{
  "id": 2472,
  "mediaId": 2528,
  "date": "2022-02-10",
  "headline": "Will a stock trading ban for members of Congress include their spouses? 'It's complicated,' Nancy Pelosi says.",
  "image": "https://i.insider.com/6204875b3b86990018b2a9bd?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/nancy-pelosi-ossoff-kelly-spanberger-unsure-spouses-stock-trading-ban-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryan Metzger",
  "authorUrl": "https://www.businessinsider.com/author/bryan-metzger",
  "termIds": [
    0
  ],
  "sentences": [
    "Asked by Insider about the inclusion of spouses, Democratic Rep. Alexandria Ocasio Cortez of New York — a co-sponsor of Merkley's spouse-less stock trade ban — said on a press call on Thursday that she was \"deeply supportive of including spouses\" in the ban and that the bill's co-sponsors were in \"active conversations\" about allowing floor vote amendments to that effect on their bill, should it make it to the floor.",
    "Republican Sen. Mitt Romney of Utah, who met with Merkley on Tuesday about his legislation but has yet to formally back a proposal, also told reporters on Wednesday that he believes spouses should be included, and the idea of including spouses isn't particularly partisan — Republican Sen. Josh Hawley of Missouri included spouses in his proposed stock trading ban, while Republican Sen. Ben Sasse did not.",
    "\"Ideally, I'd like to see spouses covered, but we're trying to figure out if there's a way to do it that's kind of fair to the contract, if you will, between a married couple,\" Merkley told Insider on Wednesday, adding that perhaps the stock trading ban could go into effect for spouses \"when each [member] faces re-election.\"",
    "\"If spouses are not included in the ban, there's no point in having the ban,\" said Shaub, adding that a spouse-less stock trading ban would be \"worse than meaningless because it creates the false impression that Congress has done something when they've done nothing at all to stop their conflict of interest problems.\"",
    "While Senate Minority Leader Mitch McConnell told Insider he'll consider a stock trading ban and declared that he owns no individual stocks, he disclosed last year that his wife — former Transportation Secretary Elaine Chao — does own significant amounts of stock.",
    "House Speaker Nancy Pelosi, after initial resistance, has now come around to the idea of banning lawmakers from trading stocks but remains noncommittal on the details of what that may entail, beyond a desire to include the judiciary in any future reforms.",
    "All of this comes on the heels of Insider's \"Conflicted Congress\" project, which has found that 55 members of Congress and nearly 200 senior staffers have violated the STOCK Act, the currently insufficient legislation in place to combat insider trading.",
    "His and Sen. Ossoff''s \"Ban Congressional Stock Trading Act\" — essentially the Senate version of the TRUST in Congress Act put forth by Democratic Rep. Abigail Spanberger of Virginia and Republican Rep. Chip Roy of Texas in the House — includes spouses.",
    "Speaking with reporters outside the Capitol on Wednesday, Ossoff laid down something of an ultimatum: senators should submit their \"notes, concerns, questions, considerations and offer any other potential legislation this week.\"",
    "But Ocasio-Cortez also said spouses were left out so that \"we could get as much bipartisan support\" as possible, though Spanberger's bill — which does include spouses — has more Republican backers than Merkley's bill.",
    "Representatives for Chao reached out to Insider to clarify that though she disclosed purchasing stock in Wells Fargo in 2020, it was part of her compensation for her prior service on the company's corporate board.",
    "\"It's possible for us to get derailed and have no bill at all\"\n Democratic Sen. Jon Ossoff of Georgia speaks to reporters about the Ban Congressional Stock Trading Act outside the Capitol on February 9, 2022.",
    "\"Those who are objecting [to including spouses in a ban] only have to look at the Speaker of the House to see an example of the problems that can be caused when your spouse is doing trading,\" said Shaub.",
    "\"It's an open question that we have struggled with as senators because many spouses have very, very independent lives, separate finances, so on and so forth,\" Merkley told Insider at the Capitol.",
    "Senate Majority Leader Chuck Schumer took to the Senate floor on Wednesday morning, putting forth the most forceful declaration in support of the idea made by any congressional leader thus far.",
    "\"I don't think that this needs to consume weeks and weeks and weeks of our time, because it's not that complicated,\" he said, adding that his and Kelly's bill is only a few pages long.",
    "\"I'm not sure why there has to be this new effort\"\n Democratic Reps. Abigail Spanberger and Jennifer Wexton of Virginia at a press conference outside the Capitol on October 21, 2021.",
    "His comments came amid an ongoing torrent of proposals to ban lawmakers from trading stocks, with three more bills to ban lawmakers from trading stocks introduced just on Wednesday.",
    "\"I just want to make sure we don't lose sight of the core nature of every scandal we've had, which has been members trading on stocks while they're writing policy,\" he told Insider.",
    "\"Spouses and members are typically one household,\" she told Insider at the Capitol shortly after introducing her own stock trading ban with Republican Sen. Steve Daines of Montana.",
    "We've got a bill that, day by day, gets more and more co-sponsors, Democrats and Republicans,\" she told Insider at the Capitol on Wednesday, referencing her own legislation.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "But Walter Shaub, the former director of the Office of Government Ethics under Presidents Barack Obama and Donald Trump, told Insider that including spouses is essential.",
    "And Democratic Rep. Ro Khanna of California, who backs Merkley's bill, periodically submits nearly illegible disclosures of his wife's frequent stock transactions.",
    "Tom Williams/CQ-Roll Call, Inc via Getty Images\nWith negotiations heating up in the Senate, things continue to move more slowly on the other side of the Capitol.",
    "Jon Ossoff of Georgia, Mark Kelly of Arizona, Elizabeth Warren of Massachusetts, Sherrod Brown of Ohio, Jeff Merkley of Oregon, and Gary Peters of Michigan.",
    "Members of congress and their spouses, like most other Americans, may often discuss financial decision-making and privileged information amongst themselves.",
    "Tom Brenner/Reuters\nAdding to the frenzy is a sense among some stock ban advocates that the time to act is sooner rather than later, given recent momentum.",
    "Merkley suggested that widening the ban could put an unfair burden on spouses, putting him at odds with some of the other senators working on the bill.",
    "Kent Nishimura / Los Angeles Times via Getty Images\nPelosi is now on board with banning lawmakers from trading stocks, but the devil's in the details.",
    "\"I'm a big believer in our committees,\" she told Insider at her Wednesday press conference, indicating little rush to get anything to the floor soon.",
    "She said the Committee on House Administration would be compiling all of the different legislative proposals and seeing what makes the most sense.",
    "And Insider's Kimberly Leonard reports that Republicans are increasingly interested in running on the issue in the upcoming midterm elections.",
    "An earlier version of this article stated that former Transportation Secretary Elaine Chao, Sen. McConnell's wife, actively trades stocks.",
    "Merkley's \"Ban Conflicted Trading Act,\" one of several proposals that have been put forward, does not currently include spouses in a ban.",
    "Insider asked Pelosi about the spouse loophole at her press conference, citing Shaub as an ethics expert who's raised this as an issue.",
    "While she does not personally own a single individual stock, her husband Paul Pelosi owns millions in stock and is a frequent trader.",
    "\"Well, I don't know who he is,\" she quipped (though she called him an \"independent, honest public servant\" in a 2017 press release).",
    "What they haven't yet agreed on — among other potential details — is whether spouses should be banned from trading as well.",
    "Sen. Kelly, who's married to former Democratic congresswoman Gabrielle Giffords, told Insider at the Capitol on Wednesday.",
    "\"I'm more concerned about whether she knows why it's bad for the spouses of members of Congress to trade stocks,\" he said.",
    "All are in agreement on the basic idea of preventing lawmakers from actively trading individual stocks while serving.",
    "The New York Democrat recently convened a working group of six Democratic senators to hammer out an agreement: Sens.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "\"I think it's important that we have strong legislation that doesn't include a bunch of loopholes,\" said Kelly.",
    "\"I hope it's not so that we can spend a lot of time talking about this issue without actually doing something.\"",
    "\"Everyone running from the minority knows good government sells,\" a national GOP strategist told Insider.",
    "A key point of disagreement is whether to include spouses, whom ethics experts say must be included.",
    "Wexton was one of several lawmakers to join Spanberger's bill as a co-sponsor just this week.",
    "\"And, of course, we'd be changing the rules of the road in the middle of an elected term.\"",
    "\"We want to make sure that we do that without loopholes, without exceptions,\" she added.",
    "But Merkley added that he's determined to not let the perfect be the enemy of the good.",
    "Pelosi is noncommittal on the idea, and Democratic senators are still working it out.",
    "The movement to ban lawmakers from trading stocks appears to be meeting its moment.",
    "Hopefully we can act on it soon,\" Schumer said, echoing remarks he made on Tuesday.",
    "Asked about the Speaker's comments later on Wednesday, Shaub let out a loud laugh.",
    "\"The inclusion of spouses is absolutely essential,\" Rep. Spanberger told Insider.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "I've actively encouraged my colleagues to offer their own bills,\" said Ossoff.",
    "\"I'm not sure why there has to be this new effort to review what's possible.",
    "\"It's possible for us to get derailed and have no bill at all,\" he said.",
    "\"And that's why Sen. Daines and I proposed treating them the same way.\"",
    "\"They're listening to members about how it affects members,\" she said.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Adding to the drama over whether to include spouses is Pelosi herself.",
    "\"The reason to include spouses is, you know, what's the difference?\"",
    "But Pelosi's latest moves were met with skepticism from Spanberger.",
    "\"It's complicated, and members will figure it out,\" she added.",
    "\"And then we'll go forward with what the consensus is.\"",
    "\"This is something that the Senate should address.",
    "\"Hopefully it can be done in a bipartisan way.\"",
    "\"What matters to me is what my members think.\"",
    "\"That's an unacceptable conflict of interest.\"",
    "Stay up to date with what you want to know.",
    "But Merkley sounded a more cautious note.",
    "Sign up for notifications from Insider!",
    "\"We don't want to let that happen.\"",
    "Loading Something is loading.",
    "House Speaker Nancy Pelosi.",
    "But it's not just Pelosi.",
    "And Sen. Warren agrees.",
    "\"The more the merrier."
  ]
}