{
  "id": 2551,
  "mediaId": 8450,
  "date": "2022-02-08",
  "headline": "Brnovich asegura que el gobernador Ducey puede enviar tropas a la frontera para proteger a Arizona",
  "image": "https://media.telemundoarizona.com/2022/02/tlmd-arizona-border-frontera-seguridad-migrantes.jpg?quality=85&strip=all&fit=1200%2C675",
  "link": "https://www.telemundoarizona.com/noticias/local/brnovich-asegura-que-el-gobernador-ducey-puede-enviar-tropas-a-la-frontera-para-proteger-a-arizona/2201130/",
  "mediaOutlet": "telemundoarizona.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2459,
    2915,
    4905,
    1489,
    103,
    5949,
    6125,
    6170,
    6515
  ],
  "sentences": [
    "PHOENIX - El fiscal general Mark Brnovich enfrascado en unas duras elecciones primarias para el Senado en las que la seguridad fronteriza es un tema principal del Partido Republicano, dijo que el gobernador puede usar las tropas de la Guardia Nacional y las fuerzas del orden público estatales para enviar a los migrantes a la fuerza a través de la frontera con México, esto sin tener en cuenta las leyes federales de inmigración.",
    "“Creo que las invasiones que tenían en mente los redactores eran invasiones organizadas por los gobiernos de otros países, no por extranjeros indocumentados desorganizados”, declaró a través de correo electrónico Paul Bender, profesor de derecho constitucional en la Universidad Estatal de Arizona.",
    "Ducey ha desafiado agresivamente las políticas fronterizas del presidente Joe Biden, incluso en el discurso sobre el estado del estado del mes pasado, cuando dijo que “la Casa Blanca y el Congreso han decidido hacer la vista gorda” a lo que llamó “una crisis nacional”.",
    "Destacó su solicitud en una conferencia de prensa el mes pasado donde se le unieron dos exfuncionarios de la administración Trump que instaron al gobernador republicano Doug Ducey a usar poderes de guerra para repeler una oleada de inmigración ilegal.",
    "La declaración del fiscal general Mark Brnovich no tiene fuerza de ley, de acuerdo con experto constitucional que ha precisado que lo establecido por la ley está destinado a restringir a los estados, no a empoderarlos.",
    "Brnovich se encuentra entre los cinco republicanos que compiten en las elecciones primarias de agosto por el derecho a enfrentarse al senador demócrata Mark Kelly en noviembre.",
    "El portavoz de Ducey respondió diciendo que el gobernador ya ha tenido tropas de la Guardia Nacional en la frontera de Arizona durante casi un año.",
    "La opinión del fiscal general Mark Brnovich se produjo en respuesta a una solicitud de un legislador estatal republicano.",
    "¿Qué respondió Ducey?"
  ]
}