{
  "id": 2609,
  "mediaId": 2580,
  "date": "2022-02-09",
  "headline": "Spielberg, Jennifer Garner, Mark Ruffalo among Senate Dems’ big donors for 2022",
  "image": "https://www.gopusa.com/wp-content/uploads/2022/02/jennifer_garner.jpg",
  "link": "https://www.gopusa.com/spielberg-jennifer-garner-mark-ruffalo-among-senate-dems-big-donors-for-2022/",
  "mediaOutlet": "GOPUSA ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Warnock will face the winner of a crowded GOP primary that includes retired football star Herschel Walker, state Agriculture Commissioner Gary Black, former bank executive Latham Saddler and construction company owner Kelvin King.",
    "Several stars, including Jennifer Garner, Kerry Washington and director Rob Reiner, have coughed up thousands of dollars — $2,900 each — to Warnock’s reelection bid, according to Federal Election Commission data analyzed by ITK.",
    "Hollywood’s famous faces are pouring money into key 2022 Senate races, aiming to give a star-studded boost to Democrats fighting to hold on to their razor-thin majority in the midterm elections.",
    "“Better Call Saul” star Bob Odenkirk maxed out with his $2,900 donation to the Arizona Democrat in June, while his former “Breaking Bad” co-star Bryan Cranston also donated to Kelly in January.",
    "As both parties seek to tip the balance of power in the upper chamber from its current 50-50 split, Sen. Mark Kelly’s campaign also boasted a big haul from Hollywood.",
    "“West Side Story” director Steven Spielberg and wife Kate Capshaw, both prominent Democratic donors, each gave nearly $3,000 to Mark Kelly for Senate.",
    "The NASA astronaut and husband of former Rep. Gabrielle Giffords (D-Ariz.) is vying for a full six-year term following his 2020 special election win.",
    "In New Hampshire, Sen. Maggie Hassan is running for a second term and is seen as one of the more vulnerable Democrats facing reelection in November.",
    "Other Warnock donors include “Rent” star Rosario Dawson, “The Morning Show’s” Holland Taylor and former “Scandal” actor Tony Goldwyn.",
    "The federal contribution limit is $2,900 for a primary and $2,900 for a general election, for a total of $5,800 per person per cycle.",
    "Democratic activist and “Spotlight” actor Mark Ruffalo and Judy Collins also doled out dollars for Demings’s campaign.",
    "Some of the same names who helped with Kelly’s campaign cash also fueled a potentially competitive race in Florida.",
    "The Atlanta-based pastor became Georgia’s first Black senator when he won a runoff election early last year.",
    "“Venom’s” Michelle Williams gave $1,000, while Amanda Peet offered up $2,900 to Kelly’s reelection effort.",
    "The Democratic congresswoman launched her campaign in June to try to unseat Sen. Marco Rubio (R-Fla.).",
    "Emmy Award winner Garner, along with actor and painter Capshaw, both gave $2,900 to Hassan’s campaign.",
    "For many celebrity donors, the spotlight is on Sen. Raphael Warnock’s (D-Ga.) campaign.",
    "Danny DeVito and wife Rhea Perlman each donated $2,500 to Warnock in August.",
    "Cranston, Perlman and Taylor all donated to Rep. Val Demings’s Senate bid."
  ]
}