{
  "id": 2687,
  "mediaId": 2573,
  "date": "2022-01-31",
  "headline": "Runaway inflation leads to people 'voting with their wallets': Larry Glazer",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/GAS-PRICES-INFLATION-SAN-DIEGO.jpg",
  "link": "https://www.foxnews.com/media/inflation-voting-wallets-larry-glazer",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    3026,
    2459,
    6175,
    5949,
    6709
  ],
  "sentences": [
    "Glazer told \"Your World\" that inflation will indeed play a big role in the midterm elections, as individual Americans begin thinking more about the broader economy when it begins to affect them personally:\n\"There's no question as we look towards midterm elections, people do vote with their wallets and when they see negative wage growth because prices have grown at such an enormous level, it affects how they think about the economy,\" he said.",
    "Americans are more and more likely to \"vote with their wallets\" as President Biden oversees both inflation and shrinkflation, which essentially eliminates any benefit to the average wage hikes Americans had most recently seen, Mayflower Advisors co-founder Larry Glazer said Monday on \"Your World.\"",
    "Over the years, beverages have been one sector where this has been more apparent to the average consumer, where a drink that was once 20 ounces might be reduced slightly to \"500 mL\" size, which is about 17 ounces -- or 2-liter bottles being reduced to 1.75 liters.",
    "Host Sandra Smith noted how much of the Republican-leaning part of the country is feeling a higher percentage of inflation on a per-state basis than the Northeast and West Coast, but that many key 2022 states including Georgia and Arizona – where Democratic Sens.",
    "The Boston-based investor said grocery bills have increase on average 20% since the start of the pandemic, and that his own mother has called him to ask what day of the week is best to purchase certain goods, given the price volatility on a daily basis.",
    "Glazer said it is the federal government's job to help maintain the supply chain, given that the average consumer \"can't unload a container ship\" or do much to rein in prices on key commodities like milk.",
    "Glazer said small businesses that have survived pandemic-related strife such as lockdowns and decreased foot traffic are the ones who will hopefully continue to be \"resilient.\"",
    "But that's Washington's responsibility to navigate those concerns to help out the American people because people are suffering and they're frustrated,\" Glazer concluded.",
    "I think we got a lot of work to do in Washington, and I'm excited because the second half of the year, maybe we'll make some progress in midterm elections,\" he said.",
    "\"That's not the conversation we want to be having with our families right now… What's not clear to me is, which is worse, the empty shelves or the rising prices?",
    "\"At the end of the day, its inability to infuse confidence in American voters, consumer sentiment is plummeting decade lows, all the result of what's happening.",
    "But at the end of the day, it's small businesses that always find the solution - a little bit less Washington and a little bit more of the small businessmen.\"",
    "\"I will say Russia and China have not done us any favors, whether it's the geopolitical tensions or the COVID zero policy creating more supply chain.",
    "Glazer also said many companies are resorting to shrinkflation, the popular term for shrinking the size of a product to keep the price the same.",
    "But what is clear is that eight in 10 Americans in a recent Gallup poll see this continuing.",
    "At the end of the day, it's Washington spending that's contributing to this issue.\"",
    "They noticed that when they fill up at the gas tank and they say, Why is this?\"",
    "And you know, you're getting fewer chicken wings than your Domino's, right?",
    "Raphael G. Warnock and Mark Kelly, respectively, are up for reelection.",
    "And all those things really start to play out [and] people notice it.",
    "\"It affects how they think about their local representation.",
    "\"What's also clear: All roads lead back to Washington.",
    "\"We talk about things like inflation… Now it's real.",
    "Now it's … Oreos and it's Cheerios in smaller boxes.",
    "That is a problem for the country,\" he said.",
    "It affects how they think about Washington.",
    "Now it's the grocery aisle."
  ]
}