{
  "id": 2719,
  "mediaId": 2540,
  "date": "2022-01-28",
  "headline": "An Arizona bill would empower state legislators to reject election results",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/210811150331-arizona-voting-file.jpg?q=x_3,y_25,h_1684,w_2993,c_crop/w_800",
  "link": "https://www.cnn.com/2022/01/28/politics/arizona-bill-reject-election-results/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fredreka Schouten",
  "authorUrl": "https://www.cnn.com/profiles/fredreka-schouten",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Republicans have started saying the quiet part out loud: their restrictive voting laws have nothing to do with promoting safe and accessible elections — they just want to drag us back to before the Civil Rights Movement,\" Gabrielle Chew, the group's vice president of communications, said in a statement.",
    "\"The fact that (Arizona lawmakers) are willing to put their names on these democracy-ending bills is a sign of where we're going to go if we don't, as a country, start speaking out against this stuff,\" Gulotta said.",
    "Another bill would create a new \"bureau of elections\" in the governor's office with a $5 million budget and subpoena powers to \"investigate allegations of fraud in any state county or local government election.\"",
    "\"\nCurrently, in Arizona, the secretary of state certifies the statewide election results, which also are signed by the governor, state attorney general and chief justice of the state Supreme Court.",
    "Arizona -- a state President Joe Biden flipped by fewer than 11,000 votes -- has been at the forefront of brazen attempts by Trump loyalists to undermine the legitimacy of the 2020 election.",
    "(CNN)Republican lawmakers in Arizona are pushing a raft of major changes to the state's voting laws, including a controversial bill that would empower legislators to reject election results.",
    "\"We need to get back to 1958-style of voting,\" Fillmore said during a House committee meeting Wednesday -- as he argued that voters should cast paper ballots, in person, on Election Day.",
    "The bill would \"create a system where losers can set aside the will of the people,\" said Alex Gulotta, who runs the Arizona chapter of the voting rights group All Voting is Local.",
    "The review, undertaken by a Florida firm called Cyber Ninjas, affirmed Biden's win, but election officials widely discredited the company's methods and most of its conclusions.",
    "Last year, a GOP proposal that would have allowed the state legislature to revoke presidential electors chosen through the popular vote and appoint its own slate failed.",
    "Other proposals would mandate additional identification requirements to vote and require ballots to include special security features, such as watermarks and holograms.",
    "Kelly, one of the chamber's most vulnerable incumbents, won a special election in 2020 to fill the seat once held by late Arizona Sen. John McCain, a Republican.",
    "The bill also would eliminate the state's widely used early voting-by-mail program and prohibit officials from requiring voters to wear masks at polling places.",
    "If legislators reject the results, any qualified voter \"may file an action in the Superior Court to request that a new election be held,\" according to the bill.",
    "The proposal, sponsored by more than a dozen Republican lawmakers, also seeks to overhaul several established election procedures in the battleground state.",
    "The bill's lead sponsor, GOP Rep. John Fillmore, told CNN in a telephone interview that he's trying to \"ensure the integrity of the voting process.\"",
    "Fillmore's proposal -- along with his recent remarks suggesting the state return to what he described as 1950s voting practices -- sparked rebukes.",
    "The Republican-led Senate last year commissioned an error-plagued hand count of 2.1 million ballots cast in Maricopa County, home to Phoenix.",
    "Officials with the Democratic Leadership Campaign Committee, which works to elect Democrats to state legislatures, denounced the comments.",
    "Fifteen other lawmakers have cosponsored Fillmore's bill, including state Rep. Mark Finchem, a Republican running for secretary of state.",
    "It would mandate, for instance, that election workers hand-count ballots instead of using electronic equipment to tabulate results.",
    "The state will hold one of the marquee US Senate contests this year as Democratic Sen. Mark Kelly seeks reelection to a full term.",
    "In the interview with CNN, Fillmore said that by calling it a \"1958 bill\" he was describing the procedures he prefers, not an era.",
    "Under his proposal, lawmakers would meet to either \"accept or reject election results\" following primary and general elections.",
    "So far this year, Arizona Republicans have introduced dozens of bills they say are needed to restore voter trust in elections.",
    "\"In person, no electronics, on paper, count the ballots that day,\" he added, ticking off his preferred voting rules.",
    "The partisan review overseen by Cyber Ninjas last year included fruitless searches for evidence of fake ballots.",
    "Fillmore said lawmakers should possess authority as \"representatives of the people\" to review the vote count.",
    "Ron DeSantis first advanced last November to establish a new elections police force with 52 employees.)",
    "One, approved by a House committee this week, would ban the use of unmonitored ballot drop boxes.",
    "As a result, a handful of GOP defectors can sink legislation pushed by others in their party.",
    "Former President Donald Trump has endorsed his bid to become Arizona's election chief.",
    "We're just trying to put the skids on it and say, 'This has to be adjudicated.'",
    "It's not clear that Fillmore's measure will gain traction in the legislature.",
    "But, he said, \"if there's a problem, we're not overturning anything.",
    "Republicans control both chambers, but by narrow margins.",
    "(It follows a proposal that Florida's Republican Gov.",
    "\"This is an all-out assault on the freedom to vote.\"",
    "The firm recently shut down."
  ]
}