{
  "id": 2723,
  "mediaId": 8475,
  "date": "2022-01-28",
  "headline": "Biden vows to nominate first Black woman to Supreme Court by end of February",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/010621_biden_speech_082021_1.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/nationworld/report/012822_biden_scotus_nominee/biden-vows-nominate-first-black-woman-supreme-court-by-end-february/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Shutt",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110076",
  "termIds": [
    2459,
    2417,
    2964,
    4397,
    4905,
    4688,
    1489,
    1269,
    6678
  ],
  "sentences": [
    "‘Rigorous’ process\nBiden said his process to pick a nominee for the seat will be “rigorous” and that the woman he selects will be “worthy of Justice Breyer’s legacy of excellence and decency.”\nBreyer’s remarks about his retirement focused less on this career and more on the diversity of the country’s 330 million residents as well as the way many of the United States’ founders referred to democracy as an “experiment.”\nBreyer said that his wife had paid many of their grandchildren to memorize former President Abraham Lincoln’s Gettysburg Address, before repeating several lines of the speech himself.",
    "Manchin, in a Thursday interview with West Virginia MetroNews’ “Talkline” program, said he wouldn’t rule out a nominee who is more left-leaning than he is, noting “it’s not too hard to get more liberal than me.”\nManchin said that Biden’s nominee, regardless of philosophical beliefs, wouldn’t change the balance of the 6-3 conservative-leaning court and that he’s more interested in their disposition.",
    "“Such a candidate will preserve faith in the court, and reflect Americans’ will when they elected an evenly divided Senate.”\nSenate Majority Leader Mitch McConnell said in a statement that the evenly divided Senate means Biden has “a mandate… to govern from the middle, steward our institutions, and unite America.”\n“The President must not outsource this important decision to the radical left.",
    "He also pledged to consider Biden’s eventual nominee “based on their qualifications and commitment to fairly interpret and uphold the Constitution.”\nSenate GOP pushback\nBiden’s nominee is expected to face a tense confirmation process in the evenly divided Senate, where Republicans are already signaling they may not support his pick.",
    "If all GOP senators oppose the nominee, then all 50 Senate Democrats, including centrist Arizona Sen. Krysten Sinema and West Virginia’s Joe Manchin, will need to vote to confirm her and Vice President Kamala Harris would need to break the tie.",
    "“That’s what I’m looking for, so it will be the character of the person.”\nOne of Biden’s possible nominees, Judge Ketanji Brown Jackson — who grew up in Miami — already has experience with the Senate’s judicial confirmation process.",
    "“Justice Breyer’s successor should be an individual within the legal mainstream who can receive similar broad, bipartisan support,” Sen. Chuck Grassley of Iowa, the top Republican on the Judiciary Committee, said in a statement.",
    "At the White House, Biden said he will make his decision by the end of February and recommitted to nominating the court’s first Black female justice, fulfilling a promise he made repeatedly while campaigning for the Oval Office.",
    "“It’s long overdue in my opinion.”\nBreyer’s retirement, which will take effect in late June or July when the court recesses, follows nearly 28 years as an associate justice who often sided with the court’s more liberal members.",
    "Republicans also have a different leader on the panel than they did during the last Supreme Court confirmation process — Grassley, who has overseen the confirmation hearings of two justices during previous stints as chairman.",
    "Feinstein stepped down from that role in November 2020 after several left-leaning organizations called for her resignation over her approach to Supreme Court Justice Amy Coney Barrett’s confirmation hearing.",
    "“After serving as the lead Democrat on the Judiciary Committee for four years, I will not seek the chairmanship or ranking member position in the next Congress,” Feinstein said in a statement at the time.",
    "Appearing with Breyer on Thursday from the Roosevelt Room, Biden said that he has not yet made a decision about whom he will nominate, but said he has begun studying candidates’ backgrounds and writings.",
    "Supreme Court Justice Stephen Breyer formally announced his retirement Thursday, giving President Joe Biden his first, and possibly only, opportunity to make a nomination for the lifetime appointment.",
    "Many Democratic groups felt that Feinstein’s cordial tone with the chairman at the time, Lindsey Graham, a South Carolina Republican, and a hug at the end of the hearings didn’t strike the right tone.",
    "But if the panel deadlocks with all Democrats voting for her and all Republicans voting against her, the Senate will need to go through the extra step of discharging her nomination from the committee.",
    "The Judiciary Committee, divided between 11 Democrats and 11 Republicans, is expected to move “expeditiously” to confirm Biden’s pick, according to Chairman Dick Durbin, an Illinois Democrat.",
    "The 83-year-old was the eldest of the nine and had been facing public pressure from left-leaning groups for months to retire while Democrats hold control of the White House and the Senate.",
    "California Democratic Sen. Dianne Feinstein was the top Democrat on the panel and oversaw confirmation hearings for the three Supreme Court nominees former President Donald Trump named.",
    "While nominees typically meet with all or nearly all 100 lawmakers, there’s usually a special focus on those who sit on the Judiciary Committee, which holds the confirmation hearing.",
    "Arizona Sen. Mark Kelly, a Democrat elected in a special election in 2020, praised Breyer for protecting freedom of speech, reproductive rights and health care access as a justice.",
    "“Do they have the disposition to be able to work with their fellow justices, to make good judgment and be able to disperse and use the rule of law as your guide?” Manchin said.",
    "If confirmed, Biden’s nominee would be the sixth woman to join the court and the third Black American to be approved since the first justice took his oath of office in 1789.",
    "Possible deadlock\nIf Biden’s nominee gets the backing of at least one Republican on the Judiciary Committee, her nomination will go directly to the Senate floor for a vote.",
    "The Biden administration will likely dedicate several White House staffers to prepare the nominee for those meetings and shepherd her through the confirmation process.",
    "The American people deserve a nominee with demonstrated reverence for the written text of our laws and our Constitution,” McConnell, a Kentucky Republican, continued.",
    "Focus on Judiciary\nThe first step for Biden’s nominee, once formally announced, will be to schedule private meetings, or conversations, with senators.",
    "Circuit with Republicans Susan Collins of Maine, Lindsey Graham of South Carolina and Lisa Murkowski of Alaska voting with Democrats to approve her.",
    "“I’m ready for a Black woman to be on the Supreme Court,” tweeted New Jersey Democratic Sen. Cory Booker, one of three Black members of the Senate.",
    "If a simple majority of the Senate votes to do that, the Supreme Court nominee would move forward for procedural votes and a confirmation vote.",
    "The Senate would debate the motion to discharge for up to four hours, after which it would vote to bring the nomination to the Senate floor.",
    "This would be Durbin’s first Supreme Court nomination process as chairman, though he’s been on the panel for more than 16 years.",
    "“The person I will nominate will be someone of extraordinary qualifications, character, experience and integrity.",
    "And that person will be the first Black woman ever nominated to the United States Supreme Court,” Biden said.",
    "“My grandchildren and their children; they’ll determine whether the experiment still works,” Breyer said.",
    "The Senate voted 53-44 in June 2021 to confirm her to the U.S. Court of Appeals for the D.C.",
    "Does it surprise you that that’s the thought that comes into my mind today?”\n- 30 -",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "Join Marianne & Chuck Freitas, Lisa Bunker, and Mary Fimbres and contribute today!",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson!",
    "“And of course, I am an optimist, and I’m pretty sure it will."
  ]
}