{
  "id": 280,
  "mediaId": 2702,
  "date": "2022-02-23",
  "headline": "Mark Kelly in new ad talks about his family living paycheck to paycheck",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2020/11/kellymark_nmg2020_mobile.jpg?w=1280",
  "link": "https://thehill.com/homenews/campaign/595506-mark-kelly-in-new-ad-talks-about-his-family-living-paycheck-to-paycheck/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron Jenkins",
  "authorUrl": "https://thehill.com/author/cameron-jenkins/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I know Arizona families are working hard to get by right now, and that’s why I won’t give up on getting our economy back on track and lowering everyday costs — because too many politicians in Washington have no idea what it’s like to wait for that next paycheck.”\nThe Arizona senator is facing reelection this year.",
    "And that’s when you come to this realization that your family is living paycheck to paycheck.”\nKelly said that realizing his family was living paycheck to paycheck motivated him to start working and prepared him for various jobs he has held over the years.",
    "Admitting how bad things are for Arizonans under his leadership and lying about his support for inflation-inducing spending isn’t the winning message Kelly thinks it is,” NRSC spokesperson Katherine Cooksey wrote in a statement to The Hill.",
    "“If you didn’t grow up in a house where money was tight and the bills piled up, it’s hard to understand what Arizona families are going through right now,” Kelly said in the ad.",
    "A number of Republicans have joined the race, including Arizona Attorney General Mark Brnovich, businessman Jim Lamon and venture capitalist Blake Masters.",
    "The National Republican Senate Committee (NRSC) blasted Kelly’s ad, deeming his message as a move of “desperation.”\n“Mark Kelly’s ad reeks of desperation.",
    "Kelly pledged to continue to fight for working families while he serves in Washington, noting that many other politicians don’t understand their struggle.",
    "“I remember my mom sitting at our kitchen table, all these papers scattered around, and she was having to make decisions about what bill to pay.",
    "Sen. Mark Kelly (D-Ariz.) in a new campaign ad talked about what it was like for him growing up in a family that lived paycheck to paycheck.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "“So, yeah, we didn’t have much, but my parents taught us how to work hard, and that served me my entire life.",
    "From the Merchant Marine Academy to flying combat in the Navy and commanding the space shuttle,” he said.",
    "In the ad, released Wednesday, Kelly said that his life experience helps him relate to Arizona families.",
    "We were always making choices about what we could do, what we could purchase, what bills could be paid.",
    "As of last month, Kelly had raised roughly $27.5 million for his reelection bid.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Updated 3:44 p.m."
  ]
}