{
  "id": 2807,
  "mediaId": 2550,
  "date": "2022-01-29",
  "headline": "Connect! Unite! Act! What makes for vulnerability and courage?",
  "image": "https://images.dailykos.com/images/1031219/story_image/GettyImages-1235796432.jpg?1643336550",
  "link": "https://www.dailykos.com/stories/2077218",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5879,
    2459
  ],
  "sentences": [
    "COMING UP:\nThe Texas primary election is March 1 and the last day to register to vote for the primary is Jan. 31 (this coming Monday)\nThe DNC is doing virtual community organizing training\n How to Host a Friend Bank\n Our CUA team is here to provide support and guidance to new and existing volunteer leaders of each regional and state group, helping them with recruiting, organizing, and executing social and action events.",
    "x\nDo you want leaders who are cynical or who like @SenatorSinema are courageous?https://t.co/X9CCuitsVK pic.twitter.com/kNJpf5joAU\n— No Labels (@NoLabelsOrg) January 25, 2022\nI’ve read the fantastic diaries, tweet replies, and editorials about how out of place it is to slam a military member for lacking courage compared to Sen. Kyrsten Sinema.",
    "She was so afraid of being vulnerable that she hid away and took as a prime goal not giving Republicans potential future material against her in an election, assuming that her reelection is in a presidential year, and she’s afraid of Republican voters that year.",
    "There are portions of Brown’s talks that I think need more fleshing out, but there is one key component she addresses that I think is woefully misunderstood in the world of business and life in general: You are going to fail.",
    "When it comes to discussing loss as Brown articulates it, we often think of the loss of a loved one who passes away and how that provides us with a moment to show that we are vulnerable by pointing out our heartbreak.",
    "Groups meet regularly to socialize, get out the vote, support candidates, and engage in other local political actions that help our progressive movement grow and exert influence on the powers that be.",
    "What is interesting about this is that for so many, especially men in my generation (I was born so last century ago), the sheer idea of vulnerability and courage going together is like oil and water.",
    "Like the engineers I knew who were afraid to alter OS/2, she hung back and refused to acknowledge that people should be scared of what was going on, to be fair to her constituents and to take a risk.",
    "For those of us who grew up with Buck Rogers, John Wayne, and M*A*S*H, the idea of taking risks and being open to being wounded (emotionally) can come across as a concept that says: Wait, what?",
    "It is a guarantee, an absolute that you are going to suffer startling setbacks, find yourself heartbroken, shed tears, and be outraged at loss no matter what kind of loss you have experienced.",
    "While management was scared of patching or virtualizing OS/2, or even trying to move away from it, try to imagine the fear that many have around the future of our country right now.",
    "We can be the next generation!” This was followed up with a team meeting that said: “If anything you do results in any downtime, you are not going to be employed.”\nWell, okay.",
    "Every individual is unique, I think, so that no one singular academic idea starts and ends in a place where I say to myself: I agree wholeheartedly with this theory.",
    "So while I may discuss some theory today, it definitely isn’t something I’d expect everyone to agree with here on Daily Kos, and definitely not everyone at large.",
    "The core concept is simple, focusing on personal vulnerability and how—in her view—courage and self-discovery come only through the expression of vulnerability.",
    "Trying to keep the system running in place and time was a set of short-term fixes, constantly maintained with the knowledge that eventually, it would run out.",
    "The software was written in such an old format that it could not run on modern PCs, and the only real way to get at it was through an older version of OS/2.",
    "It is easy to just walk away and say: Well, it’s too scary to confront the radical Republicans, or even people in our own party.",
    "I have a love-hate relationship with, well, research aimed at determining what makes humans “tick” from an emotional viewpoint.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Many years ago, I worked with an IT department looking over a complex software installation that had to work globally.",
    "For those who haven’t seen Brene Brown’s talks, “Daring Greatly” or “Dare to Lead,” you can easily look them up.",
    "If we did it and we couldn’t figure out the conversion, then we could be stuck with two different systems.",
    "LINK TO DAILY KOS STORE\nWhat are you working on in your local area\n to move our progressive agenda along?",
    "Can you be courageous if you aren’t challenged to overcome something and really put yourself on the line?",
    "As much of a nightmare as it was, there was terror in the idea of even trying to upgrade the software.",
    "Now, I want you to look around at the nation, our elected officials, and the time in which we live.",
    "You have to put things at risk and take a chance, and you do it because it is the right thing.",
    "is a weekly series that seeks to create face-to-face networks in each congressional district.",
    "By definition, vulnerability means to expose oneself to harm, to risk being wounded or hurt.",
    "Again, I have to say: Failure is baked in to everything you do at some point in your life.",
    "For every person who takes a risk, there are several others who take risks and fail.",
    "What Sinema did wasn’t courageous, because at no point did she put herself at risk.",
    "This is vulnerability: opening yourself up to tough calls that can cause you harm.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Knowing that you will take risks that may not work out can be exceptionally scary.",
    "We do not get to choose the time we live in, the time we live in chooses us.",
    "If you try to resolve the problem and fail, you put the company at risk.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Her fellow member in the senate, Mark Kelly, was able to take that risk.",
    "Major successes and accomplishments often come to those who take risks.",
    "Well, news to the senator: Those voters will never vote for you.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "They will chose a real Republican over a fake one every time.",
    "We invite you to join in this effort to build our community.",
    "As leadership came in, the idea was made clear: “Take risks!",
    "If only a certain senator from Arizona realized that truth.",
    "If there isn’t a group to join near you, please start one.",
    "However, I think it highlights an interesting discussion.",
    "When we accept that, we can begin to change the outcome.",
    "Visit us every week to see how you can get involved!",
    "Can you find courage if there isn’t much at risk?",
    "This was the textbook idea of a vulnerability.",
    "On every continent, we had an installation.",
    "This is where we misunderstand courage.",
    "This is a short blurb about Daily Kos.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "There are many ways to pitch in.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Sinema couldn’t do it.",
    "This was a nightmare.",
    "Donate $5 monthly",
    "You can’t do it.",
    "Please read it.",
    "The problem?",
    "Be bold!",
    "Connect!",
    "Period.",
    "Great!",
    "Unite!",
    "Act!",
    "No."
  ]
}