{
  "id": 2849,
  "mediaId": 2619,
  "date": "2022-02-01",
  "headline": "Pfizer seeks FDA nod for vaccine for children as young as 6 months, and latest studies find omicron may not protect against future infection",
  "image": "https://images.mktw.net/im-317105/social",
  "link": "https://www.marketwatch.com/story/pfizer-to-seek-fda-nod-for-vaccine-for-children-as-young-as-six-months-and-latest-studies-find-omicron-may-not-protect-against-future-infection-11643730559?siteid=bulletrss",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ciara Linnane",
  "authorUrl": "https://www.marketwatch.com/topics/journalists/ciara-linnane",
  "termIds": [
    0
  ],
  "sentences": [
    "“They also highlight the continued importance of vaccine boosters in enhancing immunity, as breakthrough infection alone may not be reliable in eliciting protective titers against re-infection or future infection from different variants.”\nOther COVID-19 news you should know about:\n• The World Health Organization warned Tuesday that the pandemic has created tons of extra medical waste from personal protective equipment and other supplies, putting tremendous pressure on healthcare waste-management systems.",
    "• U.K. Prime Minister Boris Johnson apologized after an inquiry found that Downing Street parties while Britain was in lockdown represented a “serious failure” to observe the standards expected of government or to heed the sacrifices made by millions of people during the pandemic, the Associated Press reported.",
    "See also: CDC data confirm boosters offer high level of protection against severe COVID, bolster case for unvaccinated to get their shots\nA child-sized version of Pfizer’s vaccine is currently available for 5- to 11-year-olds, one-third of the dose given to everyone 12 and older.",
    "“Ultimately, we believe that three doses of the vaccine will be needed for children 6 months through 4 years of age to achieve high levels of protection against current and potential future variants,” Pfizer Chief Executive Albert Bourla said in a statement.",
    "“I get it, and I will fix it,” Johnson said in Parliament after senior civil servant Sue Gray published interim findings on several gatherings in 2020 and 2021 while the U.K. was under government-imposed restrictions to curb the spread of the coronavirus.",
    "The study looked at coronavirus infections in more than 8,500 Danish households between December and January, and found that people infected with BA.2 were about 33% more likely to infect others than those infected with BA.1.",
    "A three-dose regimen for children under 5 will likely eventually be recommended, but health officials are eager to get vaccinations started as soon as possible to protect from the highly infectious omicron variant.",
    "Here’s what the numbers say\nThe global tally of confirmed cases of COVID-19 rose above 379.8 million, and the death toll is now above 5.68 million, according to data aggregated by Johns Hopkins University.",
    "• Denmark became the first EU country to lift all of its domestic COVID restrictions on Tuesday, even as it continues to see record numbers of cases of the omicron variant, MSN reported.",
    "That study, which has also not been peer-reviewed, looked at neutralizing antibody responses in fully vaccinated people, some of whom had a booster but still developed a COVID infection.",
    "The study, which has not yet been peer-reviewed, was conducted by researchers at Statens Serum Institut, Copenhagen University, Statistics Denmark and Technical University of Denmark.",
    "“Our results suggest that Omicron-induced immunity may not be sufficient to prevent infection from another, more pathogenic variant, should it emerge in the future,” said the report.",
    "The Centers for Disease Control and Prevention’s vaccine tracker is showing that 211.8 million people living in the U.S. are fully vaccinated, equal to 63.8% of the total population.",
    "A Danish study found that the BA.2 subvariant of omicron is indeed more contagious than the BA.1 version of omicron and more able to infect vaccinated people, Reuters reported.",
    "Johnson brushed off calls to quit over the “partygate” scandal, promising to reform the way his office is run and insisting that he and his government can be trusted.",
    "In a new report, the agency said that most of the roughly 87,000 tons of PPE procured between March 2020 and November 2021 is expected to have ended up as waste.",
    "WHO Director-General Tedros Adhanom Ghebreyesus told reporters it is “premature for any country to either surrender or to declare victory” over the pandemic.",
    "The news comes as the case surge caused by omicron in December and January has peaked and daily numbers are falling, according to a New York Times tracker.",
    "For children younger than 5, Pfizer is testing an even smaller dose, just 3 micrograms, or one-tenth of the adult dose, the Associated Press has reported.",
    "Hospitalizations are down 11% at an average of 140,440 a day, but deaths, which lag cases and hospitalizations, are up 30% at an average of 2,558 a day.",
    "Russia is still struggling to persuade its people to get vaccinated with its vaccination rate at 48.4%, according to Johns Hopkins data.",
    "A separate study by the University of California found that mild cases of omicron may not offer much protection from future infections.",
    "While that’s below the peak seen last winter, it’s undesirably high and has the U.S. on track to reach 900,000 deaths by mid-February.",
    "Researchers found the protection from natural infection was about one-third of the protection granted by a booster shot.",
    "Denmark has scrapped the wearing of face masks, vaccine passes and limited opening hours for public venues and spaces.",
    "It called for an improvement in waste-management practices to protect human and environmental health.",
    "• Russia counted yet another record daily number of COVID-19 cases on Tuesday, Reuters reported.",
    "Some 88 million have received a booster, equal to 41.5% of the fully vaccinated.",
    "The country’s coronavirus task force reported 663 deaths in the last 24 hours.",
    "The U.S. is averaging 456,871 cases a day, down 42% from two weeks ago.",
    "The U.S. leads the world with 75 million cases and 888,433 fatalities.",
    "New cases rose to 125,836 from 124,080 a day earlier.",
    "Your browser does not support HTML5 video.",
    "Your browser does not support HTML5 video."
  ]
}