{
  "id": 2873,
  "mediaId": 2660,
  "date": "2022-02-02",
  "headline": "Republicans facing off in 2022 GOP primaries are running ads claiming the 2020 election was stolen",
  "image": "https://static.politifact.com/CACHE/images/politifact/photos/Donald_Trump_Billy_Long_020519_AP/344a218fcee9a3af69abe829a7b1a13c.jpg",
  "link": "https://www.politifact.com/article/2022/feb/02/republicans-facing-2022-gop-primaries-are-running-/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    0
  ],
  "sentences": [
    "The news media and social media, he said, were \"massive advocates for one ideology,\" underreporting stories favorable to Trump, such as historically low unemployment for minorities, and blunting stories that were unfavorable to Biden, such as those about his son Hunter, Moreno said.",
    "Moreno, the Ohio Senate candidate whose ad was bumped by YouTube, told PolitiFact in a telephone interview that he has his own concerns about whether illegal ballots were cast in swing states where voting rules were changed shortly before Election Day.",
    "A TV ad by U.S. Rep. Billy Long of Missouri, who is running for an open Senate seat, said Trump \"made America great, but the Democrats rigged the election,\" and that he’s running for the Senate \"to stop the Democrats from stealing another election.\"",
    "Asked to provide evidence for her stolen claim, Wirth replied with an email that cited unsubstantiated claims of election irregularities in states such as Arizona and Michigan and said: \"The Democrat Party is satanic, I don’t negotiate with evil.\"",
    "\"Large majorities of Republican voters believe Trump’s lies\" about the election having been stolen, said Alan Abramowitz, a political science professor at Emory University in Georgia, whose research includes elections and voting behavior.",
    "In Georgia, where Trump pressured state officials to find votes to overturn Biden’s win, Georgia Senate President Pro Tempore Butch Miller brought the claim into his campaign to be the state’s lieutenant governor.",
    "YahooNews and YouGov found that 57% of Republicans and Republican-leaning independents said they would not vote in upcoming elections for any candidate who admits that Biden won the presidency \"fair and square.\"",
    "In Arizona, where Republicans are competing in a primary to challenge Democratic Sen. Mark Kelly, businessman Jim Lamon said that politicians \"rig our elections,\" as an image of Biden appeared on the screen.",
    "Republicans running in contested U.S. Senate, House and other primaries in 2022 are running ads claiming that the 2020 election was stolen, or rigged, despite repeated findings that the claim is false.",
    "Donald Trump hasn’t stopped pushing the falsehood that the 2020 election was rigged or stolen from him, and now Republican candidates deploying ads for 2022 races are getting started with that message.",
    "Priorities USA, which supports Democrats, posted an ad to YouTube on Jan. 6, the anniversary of the attack by Trump supporters on the U.S. Capitol seeking to disrupt the certification of Biden’s win.",
    "In a Facebook ad attacking Georgia Democrat Stacey Abrams, who is making her second run for governor, Miller said he \"is banning dropboxes\" for use in voting \"to stop Democrats from CHEATING!",
    "Nearly two dozen Republicans have publicly questioned or disputed the results of the 2020 election and are running for secretary of state across the country, the New York Times reported.",
    "In Kentucky, 4th District House candidate Claire Wirth, who is challenging GOP Rep. Thomas Massie, claimed in a Facebook ad that started running Jan. 31: \"2020 election was stolen.",
    "Some ads explicitly accuse Democrats of stealing or rigging the election, playing off polls that found many Republican voters don’t believe Joe Biden’s 2020 win was legitimate.",
    "In the accompanying video, Collins referred to \"the federal hijacking\" of the election and claimed that \"if you count the legal votes that were cast,\" Trump won Georgia.",
    "State and federal officials, and dozens of judges, including GOP appointees, have roundly rejected claims from Trump and his allies that there was widespread fraud.",
    "The ad, which asks for donations, said Trump and his allies are working to put his supporters in key election offices, including several secretary of state posts.",
    "MoveOn.org was more blunt, declaring in an ad on Facebook and Instagram: \"ALERT: Trump’s preparations for being able to steal the presidency in 2024 have begun.\"",
    "Ads that specifically blamed Democrats include one on Facebook and Instagram by Mike Collins, a Republican running for the House District 10 seat in Georgia.",
    "\"Donald Trump is putting people in place now to dictate the outcome of the next presidential election, in Congress and in states all around the country… .",
    "But he said the basis of his claim that the election was \"stolen\" has nothing to do with questions about voter fraud or election administration.",
    "So, candidates endorsed by Trump or seeking his endorsement \"are making that argument to appeal to Republican voters and to appeal to Trump.\"",
    "Two-thirds of GOP respondents agreed with the statement that \"voter fraud helped\" Biden win the election, according to an NRP/Ipsos poll.",
    "Moreno started his ad saying, \"Tech giants censoring the Hunter Biden laptop story, the media and Democrats smearing President Trump.\"",
    "So GOP candidates are leaning into the rigged-election language to build credibility with voters, even if it’s based on a falsehood.",
    "They generally warn that Trump will attempt to run for office again and declare victory whether he gets the most votes or not.",
    "The ad ends with Collins using a long gun to obliterate a receptacle bearing a handwritten sign that reads \"voting machine.\"",
    "The secretary of state typically is the top voting official in each state and plays a role in carrying out election laws.",
    "Ohio businessman Bernie Moreno, who is running for an open Senate seat, also invoked Trump’s claim of a stolen election.",
    "\"The primary voters are probably even more likely to hold that opinion than the overall Republican electorate,\" he said.",
    "Yet the notion that the election wasn’t fairly decided remains potent with Republican voters, polls show.",
    "YouTube removed both the Long and Moreno ads from its platform for violating its misinformation policy.",
    "Moreno said that voters he encounters on the campaign trail raise the issue of election integrity.",
    "The strategy is appearing in primary battles for the U.S. Senate, House and on down the ballot.",
    "\"I think the story is treated as a right-wing hoax and Donald Trump is a sore loser,\" he said.",
    "On the left, groups are running their own ads warning of election theft in 2022.",
    "\"Last time was just a test run,\" the narrator says over footage from the attack.",
    "It declared: \"Newsflash: Joe Biden and the Democrats stole the 2020 election.\"",
    "The election was stolen from Donald Trump and now we’re paying the price.\"",
    "In Alabama, Republican Lindy Blanchard, who is trying to unseat GOP Gov.",
    "Questions about 2020 are also animating campaigns down the ballot.",
    "And it’s shaping up as a litmus test for Republican candidates.",
    "President Trump says the election was stolen, and he's right.\"",
    "NEVER again will we follow politicians who say otherwise.\"",
    "Every vote we take this November is a vote against Trump.\"",
    "There was nothing illegal about what they did,\" he said.",
    "Multiple recounts and audits have affirmed the result.",
    "Then: \"An entire system rigged against the people.",
    "Kay Ivey, vowed to \"fight for election security.",
    "Don’t let Stacey Abrams get away with it again.",
    "Stand with Butch today to stop voter fraud!\"",
    "\"It was stolen fairly and squarely.",
    "\"That is 100% not true.\"",
    "(That’s not true.)"
  ]
}