{
  "id": 2905,
  "mediaId": 2779,
  "date": "2022-02-02",
  "headline": "Sen. Bob Menendez Embraces GOP Proposal to Sanction Russia Immediately, Rankling White House",
  "image": "https://theintercept.imgix.net/wp-uploads/sites/1/2022/02/1357947292-mendez-theintercept-russia.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800",
  "link": "https://theintercept.com/2022/02/02/senator-bob-menendez-russia-ukraine-sanctions-white-house/",
  "mediaOutlet": "Intercept",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Klippenstein",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "National Security Council spokesperson Emily Horne indicated the council’s opposition to Cruz’s plan to impose sanctions immediately, stating last month that it would “undermine our efforts to deter Russia and remove leverage the United States and our allies and partners possess in this moment all to score political points at home.”\nAsked by CNN’s Manu Raju if the White House was resisting pre-invasion sanctions on Russia, Menendez said: “I would not classify it as resistance.",
    "Menendez, chair of the powerful Senate Foreign Relations Committee, introduced the Defending Ukraine Sovereignty Act with 41 Democratic co-sponsors last month; the bill would require a number of sanctions only if the president finds that Russia or its proxies engage in a “significant escalation in hostilities.” On its own, the measure is being favorably described by war hawks in Congress as the “mother of all sanctions,” topped in aggressiveness only by a military invasion.",
    "“It’s no wonder Texas Sen. Ted Cruz supports sanctioning Nord Stream 2, because limiting the market for Russian natural gas in Europe might open the door to American natural gas.”\nEarlier this year, Cruz sought a vote on his own measure to immediately sanction the pipeline project, which would allow gas to flow directly between Russia and Germany rather than using Ukraine as a conduit.",
    "There’s some concern, especially as they try to keep the unity of the international community together.”\nThat Menendez remains in a position to drive sanctions policy as Foreign Relations Committee chair comes only after the Democratic establishment rallied to his side after he was indicted for corruption, a case that ended in a hung jury in 2017.",
    "We appreciate Senator Menendez’s work to hold Russia accountable, and we continue to be in close touch with Congress on everything related to Ukraine and Russia, including sanctions.”\nMenendez is leading the bipartisan talks with Sen. Jim Risch, R-Idaho, the ranking member of the Senate Foreign Relations Committee.",
    "The sanctions, which would take effect regardless of whether Russia opts to invade Ukraine, are pitting the White House against the chief sponsor of Senate legislation to address the escalating tensions in the country and drawing the ire of the administration, two of the staffers said.",
    "However, he disputed the characterization of these sanctions as being pre-invasion, arguing that they would be narrowly tailored to address actions Russia has already undertaken, like the troop buildup on the border and its reported preparations for false flag operations.",
    "“This is a far cry from what the Republicans want, but we think we can live with it and are awaiting their response.”\nEven intelligence officials broadly supportive of sanctions say decoupling them from an invasion gives up leverage that Washington has over Moscow.",
    "“The White House prefers to maintain flexibility to punish or reward Russia and tailor sanctions so they don’t bite allies,” van Landingham added, warning of the unintended consequences that sanctions could have on European partners if not crafted properly.",
    "“We have been discussing a few very narrow sanctions that would be tailored to conduct related to the buildup or other sanctionable activity by the Russian government and would not just slap sanctions for the sake of imposing sanctions,” the staffer said.",
    "The National Security Council endorsed the Defending Ukraine Sovereignty Act when Menendez first introduced it, but a spokesperson told The Intercept in an email that the council has not taken a stance on the bill he’s now negotiating with Republicans.",
    "The spokesperson emphasized the White House’s intention to punish Russia only after an invasion: “The United States – with allies and partners – will impose a range of severe, unprecedented economic measures on Russia if it further invades Ukraine.",
    "That part remains nonnegotiable.”\nOne congressional source, who was not permitted to speak on the record, told The Intercept that national security adviser Jake Sullivan has briefed members on the administration’s preference for the original plan.",
    "Implementing sanctions immediately would be premature, said Michael van Landingham, a former senior CIA analyst and Russia expert who worked on the 2017 intelligence community assessment on Russian interference in the prior year’s elections.",
    "We are optimistic there is a productive path forward, and while the administration may not fully embrace it, we think that what we have proposed is limited enough in scope,” the senior Democratic aide close to Menendez said.",
    "“[T]he mere threat of sanctions will not stop [Russian President Vladimir] Putin from invading Ukraine,” said Sen. Pat Toomey, R-Pa.\n“The White House is fully aware of the status of negotiations.",
    "A senior Democratic aide close to Menendez confirmed that the senator is proposing sanctions that would take place immediately, explaining that it is necessary in order to win Republican support.",
    "It would require the White House to impose sanctions in the event of a “significant escalation in hostilities” — language that gives the president leeway over what might trigger the sanctions.",
    "The measure would also send Ukraine $500 million for weapons purchases, prioritize the country for military equipment transfers, and bolster defense ties with Baltic countries.",
    "“Democrats have made clear the bulk of the sanctions that would crush the Russian economy must remain as a post-invasion package to hopefully deter Putin from moving forward.",
    "But Menendez, who needs the support of at least 10 Republicans to avoid a filibuster, has gone a step further, discussing the possibility of imposing certain sanctions now.",
    "“Senators also can try to use sanctions to burnish their foreign policy credentials ahead of an election and to boost constituents’ needs,” Van Landingham warned.",
    "The Texas senator agreed to let go of his hold on numerous State Department nominees in exchange for a vote last month, but the plan failed to pass 55-44.",
    "Sen. Bob Menendez, D-N.J., has embraced Republican proposals to impose sanctions on Russia immediately, three congressional staffers told The Intercept.",
    "Even without acquiescing to Republican proposals for immediate sanctions, Menendez’s original bill could hasten a war-friendly posture for the U.S.",
    "“With legislative action, it’s harder to remove sanctions or give waivers in the event a friendly country runs afoul of the new law,” he said.",
    "Van Landingham warned that congressional action can often force the White House’s hand in ways that are not easy to reverse.",
    "Risch led a bill in December with 12 Republican co-sponsors to issue sanctions on the Nord Stream 2 pipeline immediately.",
    "Catherine Cortez Masto of Nevada, Maggie Hassan of New Hampshire, Mark Kelly of Arizona, and Raphael Warnock of Georgia.",
    "Several swing-state Democrats supported the bill, including Sens.",
    "He won reelection in 2018."
  ]
}