{
  "id": 319,
  "mediaId": 2830,
  "date": "2022-02-22",
  "headline": "Justin Trudeau’s Liberal Tyranny",
  "image": "",
  "link": "https://www.wsj.com/articles/justin-trudeaus-liberal-tyranny-canada-truckers-emergency-powers-11645561913",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    0
  ],
  "sentences": [
    "Plus, donors to the protests have found their names leaked to the public, leaving them open to harassment.Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nMr. Trudeau’s new powers rely on defining the disruptive but peaceful truckers as a security threat akin to violent terrorists.",
    "WSJ Opinion: San Francisco and the Liberal Revolt Against ProgressivismPlay video: WSJ Opinion: San Francisco and the Liberal Revolt Against Progressivism\n Review and Outlook: The woke get a wake-up call as voters recall three school board members for focusing on social justice issues over reopening classrooms.",
    "His emergency law, a broad prohibition on public assemblies and even indirect support for them, ensnares tens of thousands of Canadians as “designated persons” whose assets must, per another of his new laws, be found and frozen by any financial institution, without due process or court supervision.",
    "Mr. Lametti says, “We took measures that had been applied to terrorism and applied them to other illegal activity.” This is how a trucker who violated traffic laws or committed “mischief” becomes the target of financial tools designed to disable al Qaeda cells.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nCanada Declares a Trucker Emergency\nIn an attempt to bring Canada's trucker protests to an end, Prime Minister Justin Trudeau invokes the Emergencies Act.",
    "Pressed for details, Justice Minister David Lametti initially explained that “pro-Trump” big donors “ought to be worried.” Now the government says it is targeting only the truckers, but its power has no limiting principle.",
    "“Let me remind you,” he said, “Canada will always be there to defend the right of peaceful protest.” Mr. Trudeau prattles on about rights half a world away but won’t respect them half a block from Parliament.",
    "Photo: Justin Tang/Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (4 minutes)\nAD\nLoading advertisement...\n00:00 / 03:35\n1x\nThis article is in your queue.",
    "Every trucker blockade in Canada has been cleared, yet Mr. Trudeau’s Liberal government isn’t giving up the emergency powers it claimed to criminalize the protest movement against vaccine mandates.",
    "The courts could also rule against Mr. Trudeau, throwing into question convictions against truckers and leaving Canadians to wonder what the Prime Minister could have been thinking.",
    "Images: Bloomberg News/Constanza Hevia H. for The Wall Street Journal Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "He prevailed with the support of the socialist New Democratic Party, which once prided itself like others on the left as a defender of civil liberties.",
    "“That would be the worst thing to do in this crisis.”\nThe vote captured the left-liberal pas de deux that has led to abuse of emergency powers.",
    "That required police only to arrest those blocking traffic and to requisition tow trucks (already authorized by Canada’s criminal code).",
    "WSJ Opinion: San Francisco and the Liberal Revolt Against Progressivism\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "The Liberals blamed foreign interference and lambasted the truckers along trendy American lines as racists and insurrectionists.",
    "“We understood absolutely that we do not want to trigger an election,” said leader Jagmeet Singh, cowed by Mr. Trudeau’s threat.",
    "Ottawa’s police chief was a progressive and, as progressives do, he let protesters violate the law with impunity—for weeks.",
    "The asset freezes serve not to end an emergency but to incapacitate and intimidate protesters after the fact.",
    "Open Queue\nModern liberals can hurtle from extravagant tolerance to suppression without batting an eye.",
    "But is such a dramatic move necessary, or do police already have the power to clear blockaded streets?",
    "In December 2020 Mr. Trudeau chided India for its police response to farmers’ blockades of Delhi.",
    "“This state of emergency is not over,” Mr. Trudeau said, citing the risk of future blockades.",
    "Canada’s government is obliged by law to hold a public inquiry on the state of emergency.",
    "0:00 / 4:10\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Mr. Trudeau may then find there is a real emergency—to the survival of his government.",
    "There isn’t an appeals process in case of error, and so far 200 accounts are frozen.",
    "Then Mr. Trudeau stepped in to curtail the rights of political enemies.",
    "Parliament declined Monday night to revoke Mr. Trudeau’s emergency.",
    "This exasperated Canadians who wanted order and commerce restored.",
    "Canadian Prime Minister Justin Trudeau speaks in Ottawa, Feb. 22.",
    "Canadian Prime Minister Justin Trudeau dramatizes the tendency.",
    "Bank-account freezes weren’t necessary to clear the blockades.",
    "This isn’t how a nation of laws is supposed to function.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8"
  ]
}