{
  "id": 343,
  "mediaId": 2540,
  "date": "2022-02-23",
  "headline": "Joe Biden vows to shield Americans from gas price spike. That won't be easy",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220223123502-biden-address-0222-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/23/energy/joe-biden-gas-prices/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Egan",
  "authorUrl": "https://www.cnn.com/profiles/matt-egan",
  "termIds": [
    0
  ],
  "sentences": [
    "Earlier this month, Democratic Senators Mark Kelly and Maggie Hassan introduced legislation that would seek to eliminate 18 cents per gallon of federal gas taxes until January 1.",
    "New York (CNN Business)President Joe Biden, facing the risk of a destabilizing energy price shock, is promising to blunt the impact of rising energy prices on American families.",
    "Markets are on high-alert for signs that Russia's supplies are threatened, either through US sanctions, damage from a potential war or Moscow deciding to weaponize energy.",
    "That experience -- and the fact another SPR release is being talked about now -- underscores how this isn't a meaningful solution to the supply-demand imbalance.",
    "Analysts estimate that within months a new deal -- which both sides have signaled is close -- would add approximately 1 million barrels per day in oil supply.",
    "The Biden administration's efforts to persuade OPEC to open the taps have not been helped by the strained relationship between Washington and Saudi Arabia.",
    "\"Biden's options mostly come in two categories: Nothing-burgers and mistakes,\" said Bob McNally, president of energy consulting firm Rapidan Energy Group.",
    "The Committee for a Responsible Federal Budget slammed the proposal as a \"wrong turn,\" warning a gas tax holiday would slash tax revenue by $20 billion.",
    "Saudi Arabia-led OPEC has repeatedly refused to heed US calls to significantly ramp up oil production that was sidelined during the onset of Covid.",
    "We cannot afford to lose any barrels, let alone 5 million barrels,\" said Robert Yawger, vice president of energy futures at Mizuho Securities.",
    "Biden said US officials are \"executive a plan in coordination\" with both oil producers and consumers to shield the public from price spikes.",
    "That's the only lever he has,\" said McNally, the energy consultant who previously served as an adviser to former President George W. Bush.",
    "Russia is the world's second-largest oil producer and exporter of crude oil, with 5 million barrels per day getting sent overseas.",
    "Iran, once one of OPEC's leading oil producers, has been sidelined since 2018 when the nuclear agreement with the West collapsed.",
    "And that was before US intelligence found that MBS approved the operation to capture or kill journalist Jamal Khashoggi in 2018.",
    "That suggests the United States could release more oil from emergency reserves in tandem with other countries doing the same.",
    "One option that has frequently been discussed is banning US oil exports to insulate American drivers from global volatility.",
    "Yet presidents have limited power to drive down energy prices, as Biden himself has learned painfully in recent months.",
    "Any disruption to Russia's oil flows would \"easily\" drive up crude prices to $120 a barrel, JPMorgan recently warned.",
    "And the national average today stands at $3.54 a gallon -- 12 cents higher than before SPR rumors emerged last fall.",
    "Besides, banning oil exports would only make US allies in Europe and elsewhere more reliant on barrels from Russia.",
    "Biden's best bet to boost supply, from a purely financial perspective, might be reaching a nuclear deal with Iran.",
    "Although that might feel good, industry experts have warned such a move would likely backfire on US consumers.",
    "Just before Thanksgiving, Biden announced the biggest-ever release from the Strategic Petroleum Reserve (SPR).",
    "Biden is bracing the public for just that, acknowledging on Tuesday that \"defending freedom will have costs.\"",
    "The Russia-Ukraine crisis has already helped lift oil and gasoline prices to levels unseen since 2014.",
    "Of course, there are potential national security and diplomatic tradeoffs to making nice with Iran.",
    "\"I don't think Biden is going to say he's going to give the Iranians what they want,\" Yawger said.",
    "While this plan would save consumers money, it's hardly a solution to the underlying problem.",
    "Patching up relations with Saudi Crown Prince Mohammed bin Salman, known as MBS, could help.",
    "That's roughly 12% of the global crude trade, according to the International Energy Agency.",
    "There's a long history of voters blaming presidents for high gas prices -- fair or not.",
    "On the campaign trail, Biden previously promised to treat Saudi Arabia as a \"pariah.\"",
    "In fact, it would seemingly artificially boost support at a time when supply is low.",
    "Brent, the world benchmark, surged to $99.50 a barrel on Tuesday before backing off.",
    "The 50-million-barrel release amounted to just 12 hours of global oil consumption.",
    "Even before the Russia-Ukraine crisis, supply was failing to keep up with demand.",
    "Yet gas prices took just a modest dip -- before returning to where they started.",
    "\"You can't help but wonder though if we're going to loosen up on the terms.\"",
    "Further sanctions on Moscow could drive pump prices closer to $4 a gallon.",
    "\"I want to limit the pain the American people are feeling at the gas pump.",
    "But these negotiations with Tehran are not taking place in a vacuum.",
    "Taking US barrels off the world market would drive up world prices.",
    "\"Biden's only good option is to sign a nuclear deal with Iran.",
    "And each release leaves fewer barrels for the next emergency.",
    "This is critical to me,\" Biden said during prepared remarks.",
    "There are a finite number of barrels in emergency reserves.",
    "But it's not clear what it would take to make that happen.",
    "And prices at the pump take their cues from world prices.",
    "And the market could really use those barrels right now.",
    "Oil prices dropped in the lead-up to that announcement.",
    "That's because oil is a globally traded commodity.",
    "And then they tumbled when Omicron emerged.",
    "Budget watchdogs are already crying foul.",
    "\"That's true of almost all presidents.\"",
    "\"Global supply is already tight.",
    "But that won't be easy."
  ]
}