{
  "id": 3448,
  "mediaId": 2859,
  "date": "2022-02-03",
  "headline": "Opinion: That drone up above may not be your friend",
  "image": "https://deseret.brightspotcdn.com/dims4/default/c74fb77/2147483647/strip/true/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FIdhv0cqmhUidfBDpwKzduWcmElE%3D%2F0x0%3A9600x6376%2F9600x6376%2Ffilters%3Afocal%284800x3188%3A4801x3189%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F23215588%2FAP22023533905922.jpg",
  "link": "https://www.deseret.com/opinion/2022/2/3/22916114/utah-washington-drones-attacks-terrorism-criminal-gangs-drug-smuggling-congress-laws",
  "mediaOutlet": "Deseret News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jay Evensen",
  "authorUrl": "https://www.deseret.com/authors/jay-evensen",
  "termIds": [
    0
  ],
  "sentences": [
    "CNN quotedan intelligence bulletin that said the operator may have wanted a “short circuit to cause damage to transformers or distribution lines, based on the design and recovery location.”\nIn Foreign Affairs, Donilon said it “could have caused a short circuit and taken down the electric grid.”\nHe also said at least 57 drones were seen over domestic nuclear sites between 2014 and 2019.",
    "Right now, a trio of senators in Washington — Mark Kelly, D-Ariz., Bill Cassidy, R-La., and Chuck Grassley, R-Iowa, is working on a bipartisan billthat would tighten the criminal language around misuse of the aerial devices that are becoming more common.",
    "He would take drone regulation away from the FAA and give it to Homeland Security, and he would establish federal laws to govern their use, rather than a patchwork of state laws — perhaps not a popular suggestion in today’s anti-Washington climate.",
    "You may not worry much now because that seems a long way from here, but Tom Donilon, a Distinguished Fellow at the Council on Foreign Relations and a former national security adviser, wrote recently for Foreign Affairs that things can change fast.",
    "Three years ago, Gatwick Airport in London was forced to close for 36 hours because of drones nearby, and the FAA in this country regularly has to deal with the pesky things around airports.",
    "Next, the law should require that drones be equipped with geofencing — a concept that sets perimeters around areas (power stations, for example) in which drones will not be operable.",
    "In the town of Aguililla, located in the state of Michoacan, people “have been reporting bomb-strapped drones flying over their homes since early this year …” the magazine reported.",
    "They can help farmers tend crops, help rescuers find someone who is lost, and they hold out the promise of someday soon making regular package deliveries to your door.",
    "Finally, he said the government should build a counter-drone network, with systems in place at strategic points to quickly shoot aggressive drones out of the sky.",
    "The mayor at the time, Frank Fields, told Colorado’s KDVR it might be a good idea because, at $25 a pop, the licenses could bring in some much-needed money.",
    "“Now that unmanned aerial vehicles are widely available, and easily adaptable,” he said, “the drone threat is about to come home.”\nIt already almost has.",
    "Also, the U.S. military uses them to spy on and attack enemies, as do more than 100 nations and nonstate belligerents, including terrorists.",
    "A report last summer inBusiness Insidertold of Mexican drug cartels using drones to attack enemies and smuggle drugs across the U.S. border.",
    "First, he said, private business and government should collaborate on rules for the construction of drones, including security measures.",
    "A triathlon runner in Australia was hit in the head by one, for example; painful, but hardly cause for calling out the military.",
    "He’s the one, according to Time Magazine, who came up with the idea of the town selling hunting licenses to shoot drones.",
    "But 73% of the 181 people who cast ballots that year rejected the idea, and they also threw Fields out of office.",
    "If all they do is write a bill that identifies more crimes and attaches more penalties, it won’t help much.",
    "It’s a necessity, but it might not be enough to keep us from the type of disaster that could lie ahead.",
    "People in town told reporters they weren’t sure a drone had ever actually flown over the place.",
    "It’s not far-fetched to believe the nation’s enemies would want to use them on our cities, too.",
    "The FAA already requires them to send out information that identifies them and their location.",
    "Two years ago, someone rigged a modified drone with a copper wire that trailed behind it.",
    "Back in 2014, the biggest drone problem involved either privacy violations or accidents.",
    "If only we had listened to the good folks of Deer Trail, Colorado, eight years ago.",
    "We probably wouldn’t want bullets flying through the air and drones raining down.",
    "It’s hard to tell, just as it’s hard to trace where the things come from.",
    "The idea likely was to land on a power substation in Pennsylvania.",
    "And if they are, we probably won’t know until it’s too late.",
    "These may be the result of people just trying to be cute.",
    "Which brings me back to Washington and those senators.",
    "Those buzzing skies overhead could be full of trouble.",
    "You could call it the Deer Trail defense system.",
    "Donilon wrote a list of suggestions about that.",
    "Actually, make that one good folk, Phil Steel.",
    "But Steel’s heart was way ahead of his time.",
    "Deer Trail’s methods might have been crude.",
    "Today, the problems are much more serious.",
    "Pity, that; about the drones, I mean.",
    "They have their beneficial side, too.",
    "These are the dark side of drones.",
    "It crashed nearby, instead.",
    "Or maybe not.",
    "I like that."
  ]
}