{
  "id": 3501,
  "mediaId": 2514,
  "date": "2022-02-02",
  "headline": "AOC: 'No mystery' why it's hard to ban lawmaker stock trading",
  "image": "https://s.yimg.com/ny/api/res/1.2/89rJ.6SYJCkikzYn721Xig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTA-/https://s.yimg.com/uu/api/res/1.2/Xj.AWZtPcTKthXq0bSV8DA--~B/aD0zMDc4O3c9NDY3NzthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/aol_yahoo_finance_433/15c99ab936b359828efdc91be6a966d7",
  "link": "https://www.aol.com/finance/aoc-no-mystery-why-hard-153940147.html",
  "mediaOutlet": "AOL",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "And in 2020, 75 federal lawmakers held stock in Moderna (MRNA), Pfizer (PFE), or Johnson & Johnson (JNJ) as Congress authorized billions to develop and distribute COVID-19 vaccines made by these very companies, Insider also reported.",
    "While House members can trade stock freely, a 2012 law called the Stop Trading on Congressional Knowledge (STOCK) Act bans them from trading on \"material, nonpublic information\" and requires them to disclose trades within 45 days.",
    "Last week, 27 lawmakers wrote a letter urging leaders of the U.S. House of Representatives to act quickly to bring \"commonsense, bipartisan\" legislation to the floor banning members of Congress from owning or trading stocks.",
    "Perhaps most notoriously, the Justice Department investigated four senators who sold significant amounts of stock in January and February 2020 as they were being briefed on the looming threat of COVID-19.",
    "In a new interview with Yahoo Finance taped on Jan. 27, progressive Congresswoman Alexandria Ocasio-Cortez (D-NY) alluded to the difficulty of persuading members of Congress to police their own behavior.",
    "Meanwhile, a bill introduced last month by Democratic Senators Mark Kelly of Arizona and Jon Ossoff of Georgia would prohibit lawmakers and their immediate family members from owning or trading stocks.",
    "While those senators didn't face criminal charges, the investigation highlighted the reality that Congress often has access to inside information that could have a material effect on public companies.",
    "While federal lawmakers have unveiled a range of bills aiming to stop lawmakers' from trading stocks, the legislation may face opposition from lawmakers engaged in the behavior it's trying to rein in.",
    "More than a few lawmakers have violated the STOCK Act, though: A recent investigation by Insider identified 54 lawmakers who failed to comply with the law's reporting requirements.",
    "\"It's not really a mystery to me why it's difficult to pass,\" Ocasio-Cortez, widely known as AOC, told Yahoo Finance's editor-in-chief, Andy Serwer, in a wide-ranging interview.",
    "\"The key here, is that it's not to say that you can't have a retirement account or a college savings account ... a blind trust ... a mutual fund, an index fund,\" she said.",
    "For her part, Ocasio-Cortez favors banning trading altogether, though she stresses that wouldn't prevent Congress members from having a broader stake in the stock market.",
    "The practice of so-called insider trading in Congress has faced widespread criticism in recent years because lawmakers have access to non-public information.",
    "\"I am a member of Congress: Members of Congress have access to very sensitive security clearances,\" Ocasio-Cortez told Yahoo Finance.",
    "One bill recently introduced to further curb insider trading in Congress would aim to strengthen the STOCK Act's disclosure rules.",
    "And we should not have the ability to both have access to that information and be able to hold and trade individual stock.\"",
    "\"These are vehicles of investments that are broad, that individual members of Congress don't have direct control over.\"",
    "That letter called lawmakers' stock trading a \"glaring problem\" that won't go away until Congress fixes it.",
    "\"I wouldn't be surprised if it was a majority of members of Congress who hold and trade individual stock.\"",
    "We, our job is to try to anticipate and legislate for what we see is coming.",
    "Read the latest financial and business news from Yahoo Finance",
    "Erin Fuchs is deputy managing editor at Yahoo Finance.",
    "\"We have access to very detailed, tailored briefs."
  ]
}