{
  "id": 3540,
  "mediaId": 8350,
  "date": "2022-02-03",
  "headline": "Sen. Mark Kelly says bill would bolster Arizona’s growing semiconductor industry",
  "image": "https://ktar.com/wp-content/uploads/2022/02/microchips-semiconductors-pixabay.jpg",
  "link": "https://ktar.com/story/4869206/sen-mark-kelly-says-bill-would-bolster-arizonas-growing-semiconductor-industry/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KEVIN STONE",
  "authorUrl": "https://ktar.com/story/author/kstone/",
  "termIds": [
    0
  ],
  "sentences": [
    "“But the biggest part of this is it brings back semiconductor manufacturing to the United States.”\nKelly was referring to the Taiwan Semiconductor Manufacturing Company, the world’s largest chipmaker, which in May 2020 chose Phoenix as the site for a new $12 billion production facility.",
    "“This is key to getting TSMC to complete the plant in Phoenix, and these are high-paying jobs for Arizonans, thousands of them, starting at really high salaries,” the Democrat told KTAR News 92.3 FM’s Arizona’s Morning News on Wednesday.",
    "PHOENIX – U.S. Sen. Mark Kelly said a bipartisan bill he co-sponsored and helped craft would be a boon to Arizona’s burgeoning semiconductor industry and help restore the nation as a leader in producing the small but vital components.",
    "“They’re complicated places, but there’s so much positive things about this.”\nThe first-term Senator, who is facing reelection this year, said the U.S. used to make 40% of the world’s microchips, but that’s down to 12%.",
    "“It’s important because we have to bring this manufacturing back,” he said “These chips are in everything from the most sophisticated fighter jets to vacuum cleaners and your cellphone.”",
    "Kelly said the United States Innovation and Competition Act, which passed the Senate in June by a 68-32 vote, contains $52 billion for microchip manufacturing.",
    "“There’s billions of dollars that will go to TSMC, Intel, other companies to build these fabrication facilities,” Kelly said of the bill.",
    "The TSMC and Intel projects have drawn multiple other companies involved in the production of semiconductors to the Phoenix area.",
    "Last March, Intel announced it would build a $20 billion project that includes two microchip factories in Chandler.",
    "“The best chips we can only get from other countries, and that is not in our interest as a country,” he said.",
    "“It’s a national security problem.”\nThe House released its version of the legislation last month.",
    "Kelly was confident the two chambers can work out the differences in their bills.",
    "“It’s going to take a while to build these fabrication facilities,” Kelly said."
  ]
}