{
  "id": 3572,
  "mediaId": 2658,
  "date": "2022-01-17",
  "headline": "POLITICO Playbook: MLK’s family hopes Biden is working today",
  "image": "https://static.politico.com/f6/c9/8d66d4844b71bc9f5f53501c3353/mlk-house.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/01/17/mlks-family-hopes-biden-is-working-today-495744",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1640,
    1679,
    5879,
    5510,
    2943,
    3796,
    4905,
    4326,
    1063
  ],
  "sentences": [
    "Pic ... Another pic\nHAPPY BIRTHDAY: Former first lady Michelle Obama … Rep. Carlos Gimenez (R-Fla.) … WaPo’s John Wagner … former FCC Chair Newton Minow (96) … Robert F. Kennedy Jr. … POLITICO’s Steve Shepard … Joanne Kenen … Tommy Joyce … Steve Rabinowitz of Bluelight Strategies … Precision Strategies’ Mike Spahn … Scott Goodstein … John Hoyt … Kelly Byrne-Martin … Al Shofe … Rachel Bovard of the Conservative Partnership Institute … NBC’s Gabe Gutierrez and Alex Moe … Daily Mail’s Nikki Schwab … Alyssa Franke … Hannah Ledford of the Fairness Project … Brookings’ Bill Galston … Kousha Navidar … The Van Aucker Group Robert Lewis Jr. … David Avella … Haris Alic … CapitolWorks’ Chris Jones … Jeremy Pelofsky of Finsbury … Julie Alderman … Keisha Parker … Amit Jani … CNN’s Kwegyirba Croffie … Elizabeth Hays Bradley ... Julie Barko Germany ... John Seabrook ... Edelman’s Katherine Wiet and Kurt Hauptman ... Karlygash Faillace … Alyssa Roberts ... John M. Gillespie ... Noelani Bonifacio ... Tegan Millspaw Gelfand ... Mark Pieschel … Joseph Berger … Rebecca Buck … Andrea Klaric … Jenner & Block’s Sam Feder … Maury Povich … Patrick Butler of Kirkland & Ellis … North American Millers’ Association’s Kim Z Cooper … Stephen Gilmore … Becca Sobel … Mary Clare Rigali …\nDid someone forward this email to you?",
    "“I have to constantly challenge people and say, ‘No, that's not what dad meant; this is what Dad meant.’ I have to push back because every politician, every elected official is going to be out making statements about how ‘I loved Dr. King,’ ‘I support Dr. King,’ and then … they’re voting against voting rights.”\nThat’s why today, as Americans mark Martin Luther King Jr. Day, the family of the late civil rights leader is cutting through the usual lofty invocations to make a specific ask: “No celebration without legislation.”\n“[CORETTA SCOTT KING], when she was working so many years to make sure that there was a King holiday, her vision of it always was a day of action — a day on, not a day off,” ARNDREA WATERS KING, MLK III’s wife, told me.",
    "HOLDS FOURTH MISSILE LAUNCH OF 2022 — Via AP’s Kim Tong-Hyung: “North Korea on Monday fired two suspected ballistic missiles into the sea in its fourth weapons launch this month, with the apparent goal of demonstrating its military might amid paused diplomacy with the United States and pandemic border closures.”\nPLAYBOOKERS\nWEEKEND WEDDING — Emma Posey, the coalitions manager of conservative staffing nonprofit American Moment, on Friday married Jackson Waters, the incoming campaigns director of American Reformer and a postulant for the Anglican priesthood.",
    "SIMMONS’ MEA CULPA — JAMAL SIMMONS, VP KAMALA HARRIS’ new communications director, has already apologized for decade-old tweets in which he described seeing “undocumented folks talking on MSNBC” and wondered “why ICE is not picking them up.” Now, Simmons is slated to meet with members of the Congressional Hispanic Caucus this week “to explain past tweets about immigrants as he continues to face pressure from Latino leaders and organizations,” CBS News’ Ed O’Keefe reports.",
    "While most Republicans oppose yet another round of pandemic relief payments, “lobbyists for those seeking aid, which … includes restaurants and Broadway stage productions, contend that their clients were left out of previous relief efforts or didn’t get nearly enough to cover losses.”\n— Even so, some of the money allocated for businesses in last March’s $1.9 trillion relief package has not yet been used, Boston Globe’s Jim Puzzanghera writes.",
    "Now his defense of the vaccines — even if often subdued and almost always with the caveat in the same breath that he opposes mandates — has put him uncharacteristically out of step with the hard-line elements of his party’s base and provided an opening for a rival.”\n— The wide-angle view of Trump vs. DeSantis: “At its core, the dispute amounts to a stand-in for the broader challenge confronting Republicans at the outset of midterm elections.",
    "… But there is also a sense in Trumpworld, after watching Noem’s first term as governor, that she may not be seasoned enough for a national campaign, another person close to Trump’s operation said.”\nSpeaking of Trump, our own Meridith McGraw and photographer Mark Peterson are out with a vivid photo essay capturing the surreal, crass, conspiracy theory riddled, carnival atmosphere at the former president’s campaign rally over the weekend.",
    "Major new disruptions could depress consumer confidence and exacerbate inflation, which is already at a 40-year high, posing challenges for the Biden administration and the Federal Reserve.”\nBEYOND THE BELTWAY\nFALLOUT FROM COLLEYVILLE — The man who held four people hostage inside a Colleyville, Texas, synagogue on Saturday was a British national armed with a gun “purchased on the street,” President Biden announced.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "“The country’s zero-tolerance policy has manufacturers — already on edge from spending the past two years dealing with crippling supply chain woes — worried about another round of shutdowns at Chinese factories and ports.”\nWhat that means for the U.S.: “If extensive lockdowns become more widespread in China, their effects on supply chains could be felt across the United States.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nALL POLITICS\nTHE NEW SOUTHWEST CENTRISM — Sen. MARK KELLY is the subject of a lengthy new profile from the Arizona Republic’s Yvonne Wingett Sanchez that offers as good a glimpse as any into how the freshman Democrat aims to position himself as he heads into what is likely to be a highly competitive reelection campaign this fall.",
    "Andrew Cain and Eric Kolenick have the details for the Richmond Times-Dispatch\n— JEN VS. GLENN: In a sign of how quickly Democrats have rallied around the issue, White House press secretary JEN PSAKI took a shot at Youngkin on Twitter after he criticized Arlington Public Schools’ decision to continue mandating masks: “Hi there.",
    "POLITICO Playbook: MLK’s family hopes Biden is working today\nBy EUGENE DANIELS\n01/17/2022 09:36 AM EST\nPresented by\nDRIVING THE DAY\nFor decades, MARTIN LUTHER KING III has heard his father’s words invoked by politicians across the ideological spectrum on behalf of all sorts of positions — even ones antithetical to his beliefs.",
    "That refusal has set up a generational clash and a test of loyalty in the de facto capital of today’s G.O.P., one watched by Republicans elsewhere who’ve ridden to power on Mr. Trump’s coattails.”\nThe collision of Trumpism and the pandemic is also front and center in David Siders’ new profile of KRISTI NOEM.",
    "… [O]ne Trump ally told me that there is a widely held appreciation for Noem’s ‘star quality.’ If Trump runs and decides to select a woman as a running mate, Noem may benefit from critical comments NIKKI HALEY, the former U.N. ambassador, made about Trump following the Jan. 6 riot at the Capitol last year.",
    "Peace Walk” across Washington’s Frederick Douglass Bridge and hold a press conference with House Speaker NANCY PELOSI and Congressional Black Caucus Chair JOYCE BEATTY (D-Ohio) aimed at ramping up pressure on Democrats to move voting rights legislation forward ahead of a planned Senate vote on Tuesday.",
    "At a food bank in Philadelphia, he and first lady JILL BIDEN “stood at a U-shaped conveyor belt along with others, helping to pack 27-pound boxes of food” for people experiencing hunger and food insecurity, report the Philly Inquirer’s Alfred Lubrano and David Gambacorta.",
    "Thank you to @APSVirginia for standing up for our kids, teachers and administrators and their safety in the midst of a transmissible variant.”\nCONGRESS\nOFF TO UKRAINE — With Ukraine under threat of a Russian invasion, a bipartisan delegation of U.S. senators led by Sens.",
    "RON DESANTIS, which “burst into public view recently in a dispute over a seemingly unrelated topic: Covid policies.”\n— The big question: Has the GOP base shifted so far to the right on pandemic politics that they no longer see Trump as sufficiently conservative?",
    "“There was no way that we, in good conscience, could celebrate Martin Luther King Jr. this year without [progress on] the legislation that was the cornerstone of his legacy.”\nToday, Arndrea, MLK III and their 13-year-old daughter will take part in the “D.C.",
    "In short: Kelly aims to run as a pragmatic centrist, even as the NRSC blasts him for being too liberal and “hiding behind KYRSTEN SINEMA.”\nInterestingly, there’s at least one GOP senator who disagrees with the NRSC’s depiction of Kelly: Utah’s MITT ROMNEY.",
    "— From Texas Tribune’s Alexa Ura: “While what occurred Saturday … appears to have been an isolated incident, it was not a standalone occurrence, as Jewish Americans have been publicly targeted and terrorized with increased frequency in recent years.",
    "Anywhere they are in danger, we are,’ [Rabbi SCOTT] HAUSMAN-WEISS, the founding rabbi of the Congregation Shma Koleinu, said Sunday morning in an interview, describing the reverberations of attacks on Jewish communities.”\nAMERICA AND THE WORLD\nN.K.",
    "— Amid an increase in Covid cases, “China, home to about a third of global manufacturing, [is] impos[ing] sweeping lockdowns in an attempt to keep the Omicron variant at bay,” NYT’s Ana Swanson and Keith Bradsher report.",
    "And many states still haven’t spent all the money that they’ve received.”\nTHE WHITE HOUSE\nA DAY OF SERVICE — In honor of Martin Luther King Jr. Day, President Biden devoted a few hours on Sunday to community service.",
    "GLENN YOUNGKIN endured a wave of pushback among education leaders and Democratic pols over his executive order aimed at allowing parents to opt their children out of any and all mask requirements at K-12 schools.",
    "“We don't always agree, but he’s a person who is reliable and you can trust him to follow through with this word.” (You can probably expect to see that quote in pro-Kelly ads this fall.)",
    "Dallas Morning News’ Kelli Smith and Todd Gillman have the latest, including news that on Sunday, police in England detained the man’s two teenage sons in connection with the attack.",
    "They are led by a defeated former president who demands total fealty, brooks no criticism and is determined to sniff out, and then snuff out, any threat to his control of the party.",
    "“Everyone believes or says they believe in the words and values of Dad, but they try to extract various portions to make it fit their narrative,” MLK III told me on Sunday.",
    "The couple, who wed in Columbus, Georgia, met at the Tennessee Intercollegiate State Legislature in 2019 and began dating the week prior to the start of the pandemic.",
    "In 2020 and 2021, the South Dakota governor became “an unexpected Republican sensation” and Fox News staple for her theatrical defiance of mask and vaccine mandates.",
    "That’s an uphill effort: Neither the Freedom to Vote Act nor the John Lewis Voting Rights Advancement Act have anywhere close to 60 votes in the Senate, and Sens.",
    "“Much of that money comes from $350 billion set aside for state and local governments, which recently have been given more flexibility in how they can spend it.",
    "“[I]n the time of Trump, with a celebrity kingmaker still firmly in charge of the GOP, she’s also running to stay on his radar as a potential asset.",
    "— NYT’s Jonathan Martin and Maggie Haberman have a must-read piece on the long-brewing feud between former President DONALD TRUMP and Florida Gov.",
    "“Mark recognizes, like I do, that for something to become the law, it requires Republicans and Democrats to agree,” Romney told the Republic.",
    "ROB PORTMAN (R-Ohio) and JEANNE SHAHEEN (D-N.H.) has traveled to the country in an effort to “reaffirm the U.S.’ commitment,” per a release.",
    "That includes the 43-year-old DeSantis, who has told friends he believes Mr. Trump’s expectation that he bend the knee is asking too much.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "“What we’ve seen with President [JOE] BIDEN is what happens when he puts his full force and power behind an issue like infrastructure.",
    "But they see keeping the faith — and pushing it forward, no matter the odds — as central to maintaining the late Dr. King’s legacy.",
    "— The latest coronavirus surge has businesses in some industries looking to Congress for more money, WSJ’s Brody Mullins reports.",
    "RICHARD BLUMENTHAL (D-Conn.), KEVIN CRAMER (R-N.D.), AMY KLOBUCHAR (D-Minn.), CHRIS MURPHY (D-Conn.) and ROGER WICKER (R-Miss.).",
    "“We hope that [Monday] is a working day for President Biden.”\nThe Kings know that the short-term outlook doesn’t look good.",
    "Be that as it may, the Kings don’t hold moderates on the Hill solely responsible for the lack of forward movement.",
    "We're not going to give in, we're not going to give out.”\nGood Monday morning, and thanks for reading Playbook.",
    "“[But] if he just arrived today as a 93-year-old man, he would certainly be very frustrated, but not deterred.",
    "What we want to see is that same power and passion being put behind voting rights,” said Arndrea Waters King.",
    "“But sustaining the GOP’s interest has proved more difficult as the pandemic lingers on,” Siders writes.",
    "“The doubts Mr. Trump amplified about public health expertise have only spiraled since he left office.",
    "Economically hard-hit states … received all of their funding last year, but 30 states only got half.",
    "YOUNGKIN STIRS MASK CONTROVERSY — On Sunday, his first full day in office, Virginia Republican Gov.",
    "Arlington county parent here (don’t believe you are @GlennYoungkin but correct me if I am wrong).",
    "KYRSTEN SINEMA and JOE MANCHIN aren’t budging in their opposition to reforming the filibuster.",
    "… Not only have we been down this road so many times, we are people who will not give up.",
    "“Had he lived, we would be a fundamentally different place,” MLK III said of his father.",
    "The senators plan to meet with Ukranian President VOLODYMYR ZELENSKYY later today.",
    "He’d certainly be disappointed that we seem to be going around in a circle.",
    "There’s one person in particular whose interest Noem is fighting to hold.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza, Tara Palmeri.",
    "The rest — a total of $105 billion — will be sent this spring.",
    "THE PANDEMIC\nARE SUPPLY-CHAIN PROBLEMS ABOUT TO GET WORSE?",
    "It’s worth clicking through to check out the whole thing.",
    "He understood that you had to look at the long game.",
    "Send Playbookers tips to playbook@politico.com.",
    "IS TRUMP’S VACCINE SUPPORT A LIABILITY?",
    "Also taking part: Sens.",
    "There’s no distinction.",
    "MORE RELIEF PAYMENTS?",
    "‘They are us.",
    "Sign up here."
  ]
}