{
  "id": 3590,
  "mediaId": 2664,
  "date": "2022-01-25",
  "headline": "Arizona's attorney general just got blasted for becoming a 'Trump toady' who 'ignores traitors'",
  "image": "https://www.rawstory.com/media-library/arizona-attorney-general-mark-brnovich.png?id=27995087&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/arizona-s-attorney-general-just-got-blasted-for-becoming-a-trump-toady-who-ignores-traitors/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.rawstory.com/u/alex_henderson_alternet",
  "termIds": [
    3012,
    3401,
    4905,
    2765,
    2459,
    1489,
    1126,
    5949
  ],
  "sentences": [
    "The fact that Brnovich is hoping to be a U.S. senator, according to Montini, explains why he has become a “Trump toady.”\n“The last attorney general-like thing Brnovich did came days after the 2020 presidential election when he defended the integrity of the process, saying, ‘There is no evidence, there are no facts that would lead anyone to believe that the election results will change,’” Brnovich writes.",
    "And since Brnovich needs those people to win the Republican nomination for the Senate, he stopped being attorney general and started being a Trump toady.”\nArizona is among the states where, after the 2020 election, pro-Trump Republicans circulated fake Electoral College documents falsely claiming that Trump won the state’s electoral votes.",
    "“(Brnovich) is choosing not to investigate the fake presidential electors from Arizona who fraudulently claimed they were valid electors, hoping to subvert the constitutional work of the Electoral College and overturn the outcome of a duly certified election,” Montini explains.",
    "After now-President Joe Biden defeated then-President Donald Trump in Arizona in the 2020 election, State Attorney General Mark Brnovich was among the Arizona Republicans who refused to promote Trump’s false claims of election fraud.",
    "And while Brnovich ignores traitors, he indulges the whims of Republicans in the (Arizona) State Legislature by having his office investigate what we know to be completely debunked election fraud.",
    "There is no doubt — none — that if the phony electors had been Democrats, Brnovich would be sprinting to the nearest courthouse in order to honor his oath and perform his prosecutorial duties.",
    "“Actual attorneys general, like the one in Michigan, are turning over evidence of fraud from their fake Republican electors to the Department of Justice,” Montini explains.",
    "Brnovich is running for the U.S. Senate seat presently held by Democratic Sen. Mark Kelly and once held by the late Sen. John McCain and, before that, Sen. Barry Goldwater.",
    "This is not a small thing.”\nMontini continues, “The fake certificates, in which the signatories claimed to be valid electors, were sent to the National Archives.",
    "While Kelly is seeking reelection in 2022, Arizona’s other Democratic U.S. senator, Kyrsten Sinema, isn’t up for reelection until 2024.",
    "But in Arizona, according to Montini, Brnovich is refusing to hold MAGA Republicans responsible for their egregious actions.",
    "“Brnovich and some others who have relinquished their sworn elected obligations in order to become Trump sycophants are not.",
    "“Donald Trump did not like that, and neither did the people in Arizona who support Donald Trump.",
    "Gretchen Whitmer’s administration, believes that such conduct merits a criminal investigation.",
    "But in a scathing op-ed published by the Arizona Republic on January 24, journalist E.J.",
    "Because he is running for U.S. Senate.”\nMontini applauds Nessel while slamming Brnovich.",
    "The idea was to replace valid presidential electors with a pro-Trump group….",
    "Michigan Attorney General Dana Nessel, a Democrat who is part of Gov.",
    "Montini slams Brnovich for his recent pandering to the MAGA crowd.",
    "Doug Ducey, acknowledged that Biden won the state fairly.",
    "Because he is running for the U.S. Senate.",
    "Brnovich, like GOP Gov.",
    "But he is not.”",
    "“Why?",
    "Why?"
  ]
}