{
  "id": 3602,
  "mediaId": 2590,
  "date": "2022-01-23",
  "headline": "Joe Biden Still Believes In Washington. He Might Be The Only One.",
  "image": "https://img.huffingtonpost.com/asset/61ec875123000033008b8a22.jpeg?cache=4Gr7jsTeuA&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/joe-biden-still-believes-in-washington-congress_n_61ec8704e4b04db85c83cfa0",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Robillard",
  "authorUrl": "",
  "termIds": [
    4905,
    5802,
    4267,
    2859,
    2765,
    1126,
    1433,
    6709
  ],
  "sentences": [
    "While the effectiveness of race-based vs. class-based messaging is an ongoing debate among Democratic thinkers and strategists, one Black Democratic strategist — who did not want to go on record criticizing the White House — said he would regularly cringe when Biden would mention his high levels of support from Black voters when discussing voting rights, believing it made the effort sound more like a political thank you than a democratic necessity.",
    "“The objective in the speech, for him, was to really spend the majority of time talking about what the impact was, why this was such a dire issue, and what was at stake, and why it was important to potentially make changes to Senate rules in order to get this legislation passed.”\nBiden has a history of understanding the political potency of these issues.",
    "Chip Somodevilla via Getty Images\nFor a long time, Democratic strategists have known the provisions directly dealing with voting rights were among the least popular parts of what began as the For The People Act and became known as the Freedom To Vote Act after negotiations with West Virginia Sen. Joe Manchin.",
    "It also worked in 2006, when Democrats ran against the GOP’s “culture of corruption.” And Ossoff and Sen. Raphael Warnock won their dual Senate special elections, giving control of the Senate to Democrats, in no small part due to a barrage of ads slamming their GOP opponents for stock scandals.",
    "Advertisement\nWhere Biden sees (or at least saw) a group of honorable men and women working to craft the nation’s public policy, the public largely sees a group of squabbling ne’er-do-wells, funded by the wealthy and interest groups and protected from accountability by gerrymandered districts.",
    "But placing more of a focus on issues of campaign finance and corporate influence — where most Republican members of Congress, including McConnell, hold deeply unpopular positions — would have at the very least forced the GOP to pay a larger political price for blocking the bill.",
    "In a speech in Atlanta last week, Biden framed the debate as a repeat of the Senate’s 20th-century high point: the passage of the Voting Rights Act and Civil Rights Act in the 1960s, when both parties teamed up to provide new levels of freedom for African Americans.",
    "The most cynical progressive strategists in Washington will tell you the White House is afraid of drawing attention to Steve Ricchetti, a top Biden aide and former corporate lobbyist whose brother has seen his own lobbying business grow since Biden’s inauguration.",
    "They also gave the GOP an easy way to downplay the problem: The obscure ways they are working to limit Black voting power — capping the number of drop boxes in urban areas, making early voting optional on Sundays — are not direct equivalents to Jim Crow.",
    "Biden’s decision to cast voting rights legislation as a replay of the civil rights battles of the 1960s also meant he staked one of the major achievements of his presidency on a wholly racial frame rather than one based around economic class.",
    "But Biden’s ongoing belief in Congress’ better nature is deeply out of sync with the public’s and is leading his administration astray, contributing to both Biden’s low approval rating and the legislative muck dragging down his agenda.",
    "“?Restore the bipartisan tradition of voting rights,” Biden pleaded with Republicans, trying to turn back the political clock to the 40-year stretch where the issue was nonpartisan, before Supreme Court decisions gutted the law.",
    "“We shorthand and we talk about legislation, or the status, or the meeting with this person or that person, and the American people - their eyes glaze over because they don’t - that doesn’t mean anything to them,” Psaki said.",
    "After National Economic Council Director Brian Deese joined growing calls to ban the trading of individual stocks by members of Congress, the White House quickly backed away and said the decision should be left to Congress.",
    "It’s far from clear that adopting an antagonistic position toward Washington’s institutions, corruption and institutional corruption would have been enough to push any of Biden’s legislative priorities over the finish line.",
    "While it’s clear GOP legislatures are working to limit opportunities for Black people to vote, Biden’s invocation of Bull Connor gave Republicans an opening to preen and bristle at a comparison to a violent segregationist.",
    "However, there were parts of the legislation that have been extremely popular with swing voters and even Republicans — the parts designed to limit gerrymandering and the influence of money and lobbyists on politics.",
    "Georgia Sen. Jon Ossoff, a mainstream liberal, has teamed up with the more moderate Democratic Arizona Sen. Mark Kelly to write legislation banning corporate PACs and barring members from selling individual stocks.",
    "Democrats’ first advertising salvos against Wisconsin GOP Sen. Ron Johnson focus not on COVID-19 or his embrace of Trump’s lies about the election, but on how he and his donors benefited from tax breaks he pushed.",
    "When Biden came into office a year ago this week, he made it clear he was going to rely on Congress to enact his agenda — he did not want to use extensive executive actions; he wanted to work with the GOP.",
    "When HuffPost asked White House press secretary Jen Psaki why Biden had downplayed those issues, she said Biden was focused on getting Americans to understand the importance of the voting rights fight.",
    "Biden has an utterly unique relationship with Congress: His fellow senators helped build him back up during his first term, after the death of his wife and infant daughter in a car crash.",
    "Pundits and operatives seeking to explain Biden’s ideological shifts over his decades-long career have often relied on the idea that the president is a creature of the Democratic Party.",
    "(For what it’s worth, the gerrymandering provisions also would have done far more to improve Democratic electoral fortunes than the package’s moves to expand voting rights.)",
    "A focus on these issues helped Democrats win control of the House in 2018, when dozens of candidates who swore off corporate PAC donations defeated Republicans.",
    "They had heard Senate Minority Leader Mitch McConnell (R-Ky.) promise, well before Biden was ever elected, to be the “grim reaper” for Democratic policy goals.",
    "But Biden rarely mentioned those provisions during the year he spent selling the legislation, dedicating just a single sentence to them in his Atlanta speech.",
    "If Biden wants to restart his legislative agenda, improve his approval rating and limit his party’s midterm losses, he should take his party’s lead yet again.",
    "Biden had predicted over and over again during his campaign that Republicans would experience an “epiphany” once Donald Trump was out of the White House.",
    "Moderates often say a focus on stamping out corporate influence would only alienate centrists in both parties whom Biden needs to pass his agenda.",
    "The consequences of Biden’s worldview were clear this week, as he tried and failed to sell the Democratic Party’s sweeping voting rights package.",
    "On Wednesday, President Joe Biden had a question for the 30 reporters who had gathered for the second press conference of his administration.",
    "When he wasn’t predicting divine interventions, he was reminiscing about the senators who taught him Washington’s ropes in the 1970s.",
    "They, like Biden, had watched the GOP mount a wall of opposition to President Barack Obama’s agenda over his two terms in office.",
    "He has been an outspoken advocate for campaign finance reform, making it a major issue in his unsuccessful 2008 presidential bid.",
    "He won his initial election to the Senate in 1972, in part by pledging not to own individual stocks while serving in Congress.",
    "It’s not surprising he’s reluctant to broadly condemn the institution where he spent virtually his entire professional life.",
    "Advertisement\nPresident Joe Biden answers questions during a news conference in the East Room of the White House last week.",
    "Advertisement\nIt’s clear other members of the Democratic Party still understand the potency of anti-corruption issues.",
    "Just 23% of voters approve of the job Congress is doing, according to the most recent Gallup survey on the topic.",
    "For years, roughly two-thirds of Americans have suggested most members of Congress don’t deserve reelection.",
    "?Did any of you think that we’d get to a point where not a single Republican would diverge on a major issue?",
    "(The pledge, which he followed, meant he was consistently one of the poorest members of the upper chamber.)",
    "Independent voters viewed the battles between Republicans and Democrats as partisan squabbles to tune out.",
    "A majority of Americans think the typical member of Congress is corrupt, according to some polling.",
    "Biden’s ongoing belief in Congress’ better nature is deeply out of sync with the public's.",
    "Why Biden has not made these significant issues in his presidency remains unclear.",
    "But the answer from the gathered reporters was not difficult to imagine.",
    "“Restore the institution of the Senate the way it was designed to be.”?",
    "The comparison proved unpersuasive, to say the least.",
    "But that understanding has all but disappeared.",
    "Advertisement\nBiden’s question was rhetorical.",
    "Not one?” he asked.",
    "“?"
  ]
}