{
  "id": 3604,
  "mediaId": 2590,
  "date": "2022-01-20",
  "headline": "Arizona Sen. Mark Kelly Throws Shade At Kyrsten Sinema's Filibuster Reform Vote",
  "image": "https://img.huffingtonpost.com/asset/61e9dcfb260000e900fbe231.jpeg?cache=hcrF4bfNLw&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/kyrsten-sinema-mark-kelly-filibuster-reform_n_61e9dc89e4b0c24d4dd370f4",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Terkel",
  "authorUrl": "",
  "termIds": [
    2459,
    4905,
    5879,
    1489,
    392,
    5949,
    6667
  ],
  "sentences": [
    "“With this legislation blocked in the Senate, I supported changing Senate filibuster rules to allow these bills to pass by a simple majority vote.”\nKelly was one of the last Democratic senators to back changes to the Senate filibuster, the 60-vote threshold that both parties have used to block legislation from passing — and that has, throughout history, served as an especially powerful tool to prevent major civil rights legislation from becoming law.",
    "Arizona Republicans have been among the most aggressive in cracking down on voting rights: They conducted a conspiratorial “audit” of the 2020 election results in an attempt to prove that fraud occurred, passed three laws that placed new restrictions on mail-in voting, made it harder to remain on absentee voting lists, and made it easier to purge voters from registration lists.",
    "Advertisement\nThe bill, a combination of two pieces of legislation that Senate Republicans had previously filibustered on multiple occasions, would have enshrined vital civil rights protections, especially for Black people, Latinos, Native Americans and other minority communities whose right to vote has come under assault from Republican state legislatures like Arizona’s.",
    "“It was a tough one — but it’s the right one for Arizona and our country.”\nAdvertisement\nKelly never explicitly mentioned Sinema, but it’s notable that he has chosen to highlight the difference between himself and his colleague — and believes it’s advantageous to do so.",
    "“I am a cosponsor of critical legislation to protect voting rights,” Kelly continued, referencing the Freedom To Vote–John Lewis Voting Rights Advancement Act, the package of voting rights and election reforms that failed in the Senate on Wednesday night.",
    "Over the last year, Republican lawmakers approved more than 30 new laws restricting the right to vote in at least 19 states, a push driven by former President Donald Trump’s 2020 election loss and his false claims that the contest was stolen.",
    "A day after Sen. Kyrsten Sinema (D-Ariz.) joined Republicans to block Democrats from reforming the filibuster and passing major voting rights legislation, the state’s other senator sought to raise funds off of his support for the rule change.",
    "Sinema’s opposition to filibuster reform may have significant political consequences: Major liberal groups, including EMILY’s List, said this week that they will not endorse or back candidates who opposed the rule change in future elections.",
    "Advertisement\nSinema was also at the center of negotiations over the Build Back Better legislation, insisting on a lower price tag than what President Joe Biden had initially suggested and blocking an increase in the corporate tax rate.",
    "Sinema, by contrast, maintained her opposition to filibuster reform until the very end, joining all 50 Republicans and Sen. Joe Manchin (D-W.Va.) to thwart the rule change and ensure the failure of the voting rights legislation.",
    "Like other members of his party who were more hesitant to alter the filibuster last year, he held the line Wednesday night even when it was clear Democrats did not have the votes to actually approve the rule change.",
    "And her dooming of the voting legislation — a key priority for her party and Biden — will only increase the likelihood that she faces a tough primary challenge in 2024.",
    "Nearly every Democrat who is running for a Senate seat in 2022, when Kelly will face his first reelection challenge, has also come out for filibuster reform.",
    "?exaggerated thumbs down struck people as especially insensitive, considering that an increase would have helped 800,000 people in her own state alone.",
    "And for many Democrats in Arizona, Kelly’s positions show that Sinema is leaning further to the right than is necessary to remain in office.",
    "Aside from the filibuster, Sinema took significant heat from Democrats for voting against an increase in the federal minimum wage last year.",
    "Whether he would join the vast majority of Democrats in supporting the rule change wasn’t ultimately clear until Wednesday night’s vote.",
    "Courtney Pedroza via Getty Images\nThere’s no other state where the differences between the two Democratic senators are so stark.",
    "“I wanted to talk to you about a decision I’ve made,” Sen. Mark Kelly (D) wrote in an email to supporters on Thursday afternoon.",
    "Arizona Republicans have already introduced more than 20 bills to limit voting rights this year.",
    "“Protecting these rights is too important to fall victim to Washington’s dysfunction.”",
    "Then-U.S. Senate candidate Mark Kelly speaks to supporters on Nov. 3, 2020, in Tucson.",
    "Kelly, by contrast, was not considered an impediment to passing the legislation.",
    "Kelly’s vote places him squarely in the Democratic mainstream on the issue.",
    "That, in the end, drove Kelly’s decision: “Arizona does elections well.",
    "But our right to vote is under attack,” he said in the email.",
    "The fact that she did so while giving an ?",
    "Kelly, notably, voted for the increase."
  ]
}