{
  "id": 3606,
  "mediaId": 2690,
  "date": "2022-01-24",
  "headline": "IT’S OFFICIAL: Nancy Pelosi Is Finished",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/its-official-nancy-pelosi-is-finished-473028/",
  "mediaOutlet": "teapartyorg.ning.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Wall Street and Big Tech work hand-in-hand with elected officials to enrich each other at the expense of the country.”\nIndividuals who are supportive of the measure have argued that it would help to prevent members of Congress from using classified information as a means of making money in the stock market.",
    "However, since it has been uncovered that so many members of Congress have been found in violation of the act, there’s now a bipartisan effort being launched to ban both senators and representatives from being able to trade individual stocks available in the stock market.",
    "Trump singled out Democratic House Speaker Nancy Pelosi in his comments, stating that she should not be allowed to keep trading individual stocks, a sentiment many, many Americans and regular, every-day types share with the 45th president of our great nation.",
    "Promoted Content\n(TeaParty.org Exclusive) – According to a report from WND, President Donald Trump has waded into the conversation concerning whether or not Congress members should be prohibited from being able to trade in the stock market.",
    "While the STOCK Act was a step in the right direction to try to stop insider trading and regulate Congress members, it clearly didn’t work since so many were found to regularly flout the rules and not disclose their profits,” WND says.",
    "Despite Speaker Pelosi’s current position on the issues, polls have revealed major support for the efforts to end individual trading, according to Kedric Payne, who is the general counsel for the Campaign Legal Center.",
    "Jon Ossoff of Georgia and Mark Kelly of Arizona, along with Missouri Republican Sen. Josh Hawley, have reintroduced the legislation to ban congressional stock trading, Newsweek reported,” the WND piece stated.",
    "Combine that with the public’s aforementioned grim view of politicians, and you can see where Ms. Pelosi’s remark might be considered a wee bit out of touch,” Michelle Cottle said in piece for the Times.",
    "pic.twitter.com/2SNqSCwFEU\n— Townhall.com (@townhallcom) December 15, 2021\nNot long after Pelosi made the comments, Trump shot back at her by accusing her of insider trading and being untrustworthy.",
    "“Members of Congress are finally seeing that the public wants to know that they are not acting in their own personal interests when they make official decisions,” Payne said during a chat with NPR.",
    "“I cannot imagine being a speaker of the House with the power of what can come before committee, you name them and what can come to the floor and trading millions of dollars worth of options.",
    "“Year after year, politicians somehow manage to outperform the market, buying and selling millions in stocks of companies they’re supposed to be regulating,” Hawley revealed in a statement.",
    "House Minority Leader Kevin McCarthy stated that he doesn’t trade individual stocks and sees how the American people would be skeptical about a congressperson taking that course of action.",
    "“The STOCK Act was passed to limit potential conflicts of interest and to encourage congressional members to be transparent about their personal finances,” the report continued.",
    "“Recently, it was discovered that dozens of members of Congress had violated the Stop Trading on Congressional Knowledge Act of 2012 by not disclosing their financial trades.",
    "With the current public’s massive distrust of political figures, perhaps getting rid of the ability to do individual trades for congress folk is a good idea forward?",
    "Heck, Pelosi even got slammed by her buddies in the The New York Times in a piece with the headline, “Congress Can Trade Stocks or Keep the Public Trust.",
    "“With an already-strong mistrust in politicians, it makes sense that the public would now be doubtful of how congressmen are trading.",
    "REPORTER: \"Should members of congress and their spouses be banned from trading individual stocks while serving in congress?\"",
    "“I happen to watch her and see her and dealt with her a lot and I think she’s clever in one way and stone cold crazy.",
    "I just don’t think the American people think that’s right,” McCarthy went on to say to NPR earlier in January.",
    "However, Pelosi herself quickly pushed back against the efforts by stating, , “We are a free market economy.",
    "Several big name GOP lawmakers have come out and voiced their support for this new measure as well.",
    "There were 54 members who failed to properly report their trades, Insider reported,” WND stated.",
    "It is also one that a growing number of Americans feel is not working for them.",
    "It shouldn’t be,” Trump went on to say to Breitbart News during an interview.",
    "It’s not fair to the rest of this country,” the president added.",
    "They should be able to participate in that,” NPR reported.",
    "She should not be allowed to do that with the stocks.",
    "Not both.”\n“This is indeed a free-market economy.",
    "They should be able to participate in that.\"",
    "PELOSI: \"No…We are a free market economy.",
    "She should not be allowed to do that.",
    "“She has inside information.",
    "It’s not appropriate.",
    "“Democratic Sens.",
    "It’s not right.",
    "Copyright 2022.",
    "TeaParty.org"
  ]
}