{
  "id": 3615,
  "mediaId": 8367,
  "date": "2022-01-18",
  "headline": "Biden administration announces 10-year, $3 billion push to tackle growing wildfire threat",
  "image": "https://www.gannett-cdn.com/presto/2021/08/24/PPHX/1d35d548-502a-4f76-b048-3435c78a0530-Delgado_Thinning_8732.jpg?crop=6097,3430,x0,y260&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/local/arizona-environment/2022/01/19/biden-administration-announces-plan-boost-fight-against-megafires/6531946001/",
  "mediaOutlet": "Mesa Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandon Loomis",
  "authorUrl": "https://www.azcentral.com/staff/5791391001/brandon-loomis/",
  "termIds": [
    0
  ],
  "sentences": [
    "But Grand Canyon Trust Executive Director Ethan Aumack, who has long worked to shape the 4FRI program, said the federal investment is “a good start, and we’re optimistic about the work that will be done over the next five years.”\nDecades from now, people will look back on this commitment as the time when the United States embraced the challenge of runaway fires and said “no more,” said Martin, the regional forester.",
    "The new strategy immediately targets what he called the highest-priority threats in Arizona’s pine expanses above the Mogollon Rim, including Bill Williams Mountain near Williams, Flagstaff’s watershed and the Cragin Reservoir area, which supplies water to Payson and to the Phoenix area.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nEnvironmental organizations had mixed reactions to the announcement.",
    "The federal government is committing billions of dollars toward a 10-year wildfire mitigation strategy that will include a boost to struggling forest thinning and watershed restoration programs in Arizona, U.S. Agriculture Secretary Tom Vilsack announced in Phoenix on Tuesday.",
    "Vilsack, who is reprising the role he served under then-President Barack Obama, said he was irritated — “hot,” in his words — to return to office and find that 4FRI was still struggling to ramp up and protect Arizona’s forests and watersheds.",
    "In the case of 4FRI, a Forest Service-led partnership that has struggled to make progress toward a yearly goal of 50,000 acres of thinning in northern Arizona, the strategy will earmark $54 million a year starting this year.",
    "Drought, forest pests, climate change and past fire suppression have all conspired to create a landscape of megafires in the West, Vilsack and others said during the announcement at the Desert Botanical Garden.",
    "Initially, the Forest Service will direct funds this year toward projects that its scientists have deemed critical, including the Four Forest Restoration Initiative (4FRI) in Arizona’s ponderosa pine expanse.",
    "The money, nearly $3 billion set aside in the bipartisan federal infrastructure bill last year, will fund provisions of a new National Cohesive Wildland Fire Management Strategy for the first five years.",
    "Now, Pyne said, “We’re looking at an effort probably 10 times larger than what we thought was adequate in 2000, and I’m not sure it’s adequate in 2022 because things are changing at a much larger scale.",
    "That will include $10 million for road construction and maintenance, which is a cost that has slowed industry partners who might otherwise have logged more land, Regional Forester Michiko Martin said.",
    "WildEarth Guardians released a statement saying the government “keeps barking up the wrong tree” by seeking to log more lands when it should focus on clearing areas of 100 to 200 feet around homes.",
    "As climate change and continued wildland construction kept stoking fires that burned communities, though, the Office of Management and Budget determined it was unsuccessful, and the funding ended.",
    "Federal spending on forest roads could aid companies trying to build the industry that can finish the 4FRI jobs, said Ted Dergousoff, CEO of the 4FRI contractor NewLife Forest Restoration.",
    "Bill Williams Mountain, for instance, poses a flood threat to Williams if a monsoon storm follows a fire that scrapes it clean, but it’s too steep to log without the aid of helicopters.",
    "Yet, enforcing smarter construction and nonflammable landscapes has proven politically difficult, even in parts of California that have experienced catastrophic losses, he said.",
    "The agency then plans to engage local communities to help prioritize other zones for treatment, beginning at National Forest Foundation-led roundtable discussions in February.",
    "Sen. Mark Kelly, D-Ariz., said protecting the forests that provide so much of the state’s water is critical infrastructure spending that will become more important over time.",
    "Building and fire codes must create defensible space, he said, or more towns will burn and a repeat evaluation could again determine that the government is wasting its money.",
    "Asked about opportunities to generate industry in Arizona, Vilsack singled out the need for a biomass-based aviation fuel that can aid the fight against climate change.",
    "Last week, the water and power provider signed an agreement with the Forest Service and the state to share the cost of thinning some 3,000 acres a year for 10 years.",
    "'I'm not sure we're scaling up fast enough'\nThe strategy approaches wildfire from a landscape or “fireshed” perspective, U.S. Forest Service Chief Randy Moore said.",
    "U.S. Rep. Tom O’Halleran, D-Ariz., told The Arizona Republic that the new strategy provides a lift to 4FRI in areas too expensive for industry to log economically.",
    "He noted that since the turn of the 21st century, two fires alone — Rodeo-Chediski and Wallow — have burned a previously unimaginable 1 million acres in Arizona.",
    "Like SRP, he said, the state is eager to partner with the Forest Service to protect water from sedimentation or supply problems associated with massive fires.",
    "Low-value, small trees are targeted\nOn that count, Salt River Project is eager to put the new funds to work protecting the Cragin Reservoir’s watershed.",
    "It all sounds eerily familiar to wildfire expert and author Stephen Pyne, an emeritus professor at Arizona State University’s School of Life Sciences.",
    "It will enable the agency to massively expand its current treatment of about 2 million acres a year to roughly 5 million acres a year, Vilsack said.",
    "Hardening those communities against wildfire within their boundaries is at least as important as reducing the forest fuels around them, he said.",
    "Thinning is expected to cost $2,000 more per acre than industry could recoup through the timber, said SRP forest management chief Elvy Barton.",
    "Environmental coverage on azcentral.com and in The Arizona Republic is supported by a grant from the Nina Mason Pulliam Charitable Trust.",
    "It’s getting worse.”\nBeyond community protection, Pyne agreed that watershed protection and other ecological restoration are necessary.",
    "Follow The Republic environmental reporting team at environment.azcentral.com and @azcenvironment on Facebook, Twitter and Instagram.",
    "“It’s predominantly low-value, small trees,” said David Tenney, director of the Arizona Department of Forestry and Fire Management.",
    "The agency has prioritized firesheds within the Southwest, Pacific Northwest, Sierra Nevadas and the Colorado Front Range.",
    "In 2000, the Clinton administration adopted a national fire plan meant to overwhelm the growing wildfire risk with money.",
    "That means analyzing threats within broad zones of 100,000 acres to 250,000 acres in which individual fires may burn.",
    "Both Moore and Vilsack emphasized that partnerships with state and local organizations should stretch the dollars.",
    "The reservoir is an important water source for Payson, but water on the landscape also flows toward metro Phoenix.",
    "“Are people going to be willing to adapt their communities to the fact that fire is going to be there?” Pyne said.",
    "The strategy also calls for creating a plan to maintain the treated areas at the end of the 10-year program.",
    "It’s an idea that a former 4FRI contractor explored years ago, though that industry has not yet emerged.",
    "“I’m not sure we’re scaling up fast enough.”\nMoney and forest thinning aren’t his only prescriptions.",
    "Brandon Loomis covers environmental and climate issues for The Arizona Republic and azcentral.com.",
    "Reach him at brandon.loomis@arizonarepublic.com or follow him on Twitter @brandonloomis.",
    "“The truth is that drought and climate change will only deepen this crisis,” Kelly said.",
    "The communities that burn now are increasingly gentrified urban and exurban enclaves.",
    "“We’ll be constantly evaluating additional projects,” he said.",
    "“I feel good about what’s coming with 4FRI,” O’Halleran said.",
    "“This is really a big moment for the country,” she said.",
    "The new funds should help subsidize that work.",
    "“We needed a jump-start,” he said.",
    "“We’re quite encouraged,” he said.",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "“It’s not going away."
  ]
}