{
  "id": 3628,
  "mediaId": 2621,
  "date": "2022-01-26",
  "headline": "Poll: Kyrsten Sinema More Popular With Arizona Republicans Than Democrats",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/01/GettyImages-1236169205-scaled-e1643231177293.jpg",
  "link": "https://www.mediaite.com/news/poll-kyrsten-sinema-more-popular-with-arizona-republicans-than-democrats/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kipp Jones",
  "authorUrl": "https://www.mediaite.com/author/kipp-jones/",
  "termIds": [
    0
  ],
  "sentences": [
    "Reid Wilson, writing for The Hill, reported:\nNew polling from OH Predictive Insights, a Phoenix-based nonpartisan pollster, finds 44 percent of Arizona Republican voters surveyed said they see Sinema favorably, compared with just 42 percent of Arizona’s Democratic voters.",
    "But where many Democrats often enjoyed the sometimes unpredictable late maverick Sen. John McCain (R-AZ), Sinema’s unreliability in a split Senate apparently has many Democrats in Arizona peeved, according to a new poll.",
    "The Hill reported it had reached out to a representative for Sinema about the poll, and that the person had declined to offer comment about the senator’s slipping favorability with Arizona Democrats.",
    "“Now, they have a situation, I don’t know if it’s unification or not, but they have two people that are doing the right thing for the country, and they’ve become very popular in their states.",
    "Both senators opposed abolishing the filibuster last week that would have allowed President Joe Biden’s voting rights legislation to advance across the goal line.",
    "At the same time, only 21 percent of Republican voters view Kelly, who is up for reelection later this year, in a favorable light.",
    "Sen. Kyrsten Sinema (D-AZ) is viewed more favorably by Arizona Republicans than she is the state’s Democrats, a new poll finds.",
    "While Sinema is reportedly struggling with her own voters, she can at least brag the tepid support of one big name Republican.",
    "By contrast, nearly 3 in 4 Democrats polled — 74 percent — said they view Sen. Mark Kelly (D) favorably, the poll found.",
    "Former President Donald Trump praised both Sinema and Manchin this week during a podcast interview with Lou Dobbs.",
    "Sinema has joined Sen. Joe Manchin (D-WV) as one-half of a duo of Democratic Party mavericks in the Senate.",
    "Sinema, like Manchin, also opposed the price tag of Biden’s initial $3.5 trillion infrastructure plan.",
    "But they’re doing the right thing for the country.”\nHave a tip we should know?",
    "“I think the Democrats have always been unified,” Trump said.",
    "tips@mediaite.com"
  ]
}