{
  "id": 3655,
  "mediaId": 2724,
  "date": "2022-01-24",
  "headline": "Report: Multiple Senate Democrats Seeking To Push ‘Illegitimate’ Election Narrative",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/01/2022.01.24-11.26-thepoliticalinsider-61ee8ce096b89.jpg",
  "link": "https://thepoliticalinsider.com/report-multiple-senate-democrats-seeking-to-push-illegitimate-election-narrative/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rusty Weiss",
  "authorUrl": "https://thepoliticalinsider.com/author/rusty-weiss/",
  "termIds": [
    0
  ],
  "sentences": [
    "The column also notes that Senators Raphael Warnock (D-GA) and Mark Kelly (D-AZ) have made similar assertions about the legitimacy of their future “tough races.”\nOn the contrary, according to Joe Snead, executive director of the Honest Elections Project, the Georgia election law “is not regressive or restrictive” and in fact, “is a lot more progressive than what’s in the blue states.”\nAnd in Arizona, the conservative-leaning Heritage Foundation insists election laws there will “strengthen the integrity of the electoral process and safeguard the votes of Arizonans.”\nDuring his press conference today, Biden declined to say if the upcoming election would be fair and legitimate without voting rights reform.https://t.co/lqLWmji2Ni\n— Axios (@axios) January 19, 2022\nDon’t Want to Sound Like Trump\nIronically, some Democrats according to the report don’t want to sound like former President Trump, who has cast doubt – without evidence – on the legitimacy of the 2020 presidential election since day one.",
    "They add, “The senators are torn over how hard to push a stolen-election narrative ahead of the November election in which Republicans are expected to make big gains in Congress.”\nAll those assertions that the very fabric of our democracy is in peril due to Trump’s unfounded complaints and Democrats have decided … ‘Let’s do the same damn thing.’\nIt’s definitely a coordinated effort with the aforementioned lead of the media and President Biden’s own comments last week that midterm election results could be “illegitimate.”\nThis second attempt from Biden on whether the election will be legit is even worse.",
    "“Oh, yeah, I think it could easily be illegitimate … The increase in the prospect of being illegitimate is in proportion to not being able to get these reforms passed.” pic.twitter.com/nCyuAWSMXm\n— Justin Baragona (@justinbaragona) January 19, 2022\nBiden, when questioned by a reporter as to whether or not the President felt we would have free and fair elections in 2022, planted the conspiracy seeds.",
    "Democrats torn over pushing stolen-election narrative https://t.co/hzZz2IXkfv pic.twitter.com/CtcdCBlGtg\n— The Hill (@thehill) January 23, 2022\nDemocrats Pushing Illegitimate or Stolen Election Narrative\nSign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "“I think it easily could be illegitimate.”\nWhite House Press Secretary Jen Psaki tried to clarify those remarks saying, “He absolutely is not predicting that the 2022 elections will be illegitimate.”\nRead this Next on ThePoliticalInsider.com\nReport: State Contracts Boost Dem-Linked Lawyers, Not Consumers",
    "The majority party has, for some time, tried to portray GOP efforts to preserve election integrity in red states as an affront to future elections, though critics insist the state efforts would improve election security and reverse temporary changes enacted during the pandemic.",
    "Senator Chris Murphy (D-CT) is quoted as saying state-level election laws enacted recently “are intended to seat people who lost the election.”\n“I’m very worried the changes in these laws will ultimately result in a loser being declared a winner,” he continued.",
    "“Democrats believe there’s plenty of evidence that Republicans are trying to steal future elections and feel bolstered by extensive reporting by CNN, NBC and other media outlets on the state-level machinations of Trump allies,” according to The Hill.",
    "The latest report indicates Democrats are a bit leery of pushing an illegitimate or stolen election narrative due to the fact they’ve been persecuting former President Donald Trump for similar unproven claims for over a year.",
    "A report by The Hill indicates several Senate Democrats are contemplating pushing a narrative that the 2022 midterm elections are illegitimate due to Republican opposition to passing their national voting bill.",
    "“Some are leery of sounding like Trump, who made predictions of widespread election fraud before the 2020 presidential election and continues to do so on a regular basis,” according to The Hill.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "Democrat legislation being pushed would expand mail-in voting, grant federal control to elections, and require less restrictive voter ID laws.",
    "Despite having pilloried Trump for such talk, several lawmakers are cited as willing to pursue the new ‘illegitimate election’ strategy.",
    "— Ben Shapiro (@benshapiro) January 20, 2022\n“If you start having local or state certification agents start overruling actual votes.",
    "They saw what worked during the pandemic, leading to 81 million votes for President Biden, and want to expand on that.",
    "The latest report indicates that lawmakers are working in tandem with the media to help portray the narrative.",
    "That makes it the Bigger Lie that every election hereafter will be deemed stolen thanks to voter suppression.",
    "That’s when things quickly move into the illegitimacy area,” Senator Martin Heinrich (D-NM) told the outlet.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "It was supposedly the Big Lie that the 2020 election was stolen via electoral fraud.",
    "Democrats have not only lost any moral high ground, they’ve salted the earth.",
    "“Oh, yeah,” he replied."
  ]
}