{
  "id": 3669,
  "mediaId": 8475,
  "date": "2022-01-26",
  "headline": "Indigenous voters betrayed by Sinema’s actions in Congress, officials and advocates say",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/Navajo_Nation_photo_1_2.jpeg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/012622_native_am_voters_sinema/indigenous-voters-betrayed-by-sinemas-actions-congress-officials-and-advocates-say/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arlyssa Becenti",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/107656",
  "termIds": [
    0
  ],
  "sentences": [
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nClara Pratte, who was the tribal engagement director for the Biden campaign, said Sinema's decision on the filibuster felt like a betrayal to Arizona voters.",
    "During a Navajo Council Naabikiyati meeting Jan. 20, Santee Lewis, director of the Nation's Washington office, called the Freedom to Vote Act and The John Lewis Voting Rights Advancement Act \"the most important\" pieces of legislation to come out of the Biden-Harris administration.",
    "\"Today, we see a breaking with the party, not to compromise and strengthen democracy, but to instead hold up an arcane rule that has been ignored no less than 160 times to benefit corporate interests and rush through judicial appointments,\" Pratt said.",
    "But Benally said those long hours of labor are threatened by U.S. Sen. Kyrsten Sinema's recent vote to maintain the Senate filibuster, blocking other Democrats from passing the Freedom to Vote Act and The John Lewis Voting Rights Advancement Act.",
    "\"I also maintained my longstanding opposition to separate actions that would deepen our divisions and risk repeated radical reversals in federal policy, cementing uncertainty and further eroding confidence in our government.",
    "\"After the defeat of President Trump and the 2020 election, we saw that many Republican legislators and states around the country started passing new rules that Democrats believed targeted minorities,\" Lewis explained.",
    "Pratt noted that Arizona politics have always been built on moderate leaders like the Udalls and even the late Sen. John McCain, \"who didn't hesitate to break with the party for the good of the country.",
    "Since Council failed to send a letter to Sinema before her important vote, it can't be known whether their letter would've made the impact where Newton believes Nez and Lizer's letter failed.",
    "During the 2020 elections, Tara Benally and other folks with Rural Utah Project put in hundreds of hours talking to people one by one about how and why it's important to register to vote.",
    "\"When you look at the statistics, the Navajo Nation is the reason why Sen. Sinema, Sen. Mark Kelly, President Biden and Vice President Kamala Harris were put into their positions.\"",
    "Newton suggested it was time for delegates to send their own message to Sinema asking why she voted the way she did and to let her know they are keeping an eye on how she votes.",
    "– Navajo Nation President Jonathan Nez\nShiprock Council Delegate Eugenia Charles-Newton said Nez's letter to Sinema was ignored — or was considered but didn't have an effect.",
    "I say that because Sen. Sinema might pull something out of her sleeve that will wow the Native American community, and we are going to forget she voted the way that she did.\"",
    "\"She's been indicative of what someone thinks it means to be a moderate at the expense of damaging the most necessary changes needed in the democratic process,\" said Pratt.",
    "\"We all ask that you vote in support of this critical legislation to create and protect a democracy where all voters can participate in elections,\" they said in the letter.",
    "\"Tonight, I voted again to support legislation safeguarding and expanding Americans' access to the ballot box and strengthening faith in our elections,\" stated Sinema.",
    "Nez and Vice President Myron Lizer had sent a letter to Sinema earlier in the month, urging her to push for the bills, even if it meant voting against the filibuster.",
    "Navajo Nation President Jonathan Nez was listening in on the Arizona Democratic Party's Jan. 23 meeting when he heard that the party was going to censure Sinema.",
    "A Council message asking Sinema why she voted to keep the filibuster in place might be met with the same justification she posted on her website on Jan. 20.",
    "This article was first published by Source NM, a sister publication of the Arizona Mirror and a member of the States Newsroom network of local news sites.",
    "\"Now we seek cooler heads to prevail to protect voting rights for Black and Brown voters, who have had to fight every step of the way for representation.",
    "As of October 2021, it was reported by the Navajo Election Administration that there are more than 118,400 registered voters within the Navajo Nation.",
    "However, the tactics taken by the senator are beyond the pale when it comes to moving the Nation and the state forward as a democracy.\"",
    "The Native American Voting Rights Act was part of the legislation, and many Navajo Nation entities worked on it, Lewis said.",
    "She said senators and representatives have made it clear to her that they know Navajo Nation Council is the governing body.",
    "\"The Indigenous Nation has been left behind for so long that by voting to not end the filibuster is undermining them.\"",
    "During the 2020 election, Indigenous turnout within Arizona impacted the outcome — and Nez is quick to remind people.",
    "\"We were all hoping to see the passage to both of these laws because of how many Navajo voters are disenfranchised.\"",
    "Senator Sinema's continued obstruction on this front is telling and should not be forgotten come election time..",
    "And Arizona turned blue in the U.S. presidential election for the first time since 1996.",
    "\"It is no secret that the Navajo people set records in voting participation,\" Nez said.",
    "Through her work, she was able to get more than 4,000 voters to register, she said.",
    "If they take positions contrary to our interests, then we are going to push back.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson!",
    "Registering people to vote in rural areas and in tribal nations takes work.",
    "\"What Senator Sinema has done has undermined all efforts,\" Benally said.",
    "\"Council speaks louder than the president's office,\" emphasized Newton.",
    "During a pandemic, the effort was monumental.",
    "\"Moderates and compromise are important.",
    "We focus on what's happening right now.",
    "\"Voters, we tend to forget.",
    "- 30 -"
  ]
}