{
  "id": 3676,
  "mediaId": 2618,
  "date": "2022-01-22",
  "headline": "Packers’ Aaron Rodgers Calls Out Biden For Saying ‘It’s A Pandemic Of The Unvaccinated’",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/01/22/packers_aaron_rodgers_calls_out_biden_for_saying_its_a_pandemic_of_the_unvaccinated_77580.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Jerkovich",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Packers’ QB Aaron Rodgers called out President Joe Biden’s claims that it’s a “pandemic of the unvaccinated.” “When the president of the United States says, ‘This is a pandemic of the unvaccinated,’ it’s because him and his constituents, which, I don’t know how there are any if you watch any of his attempts at public speaking, but I guess he got 81 million votes,” the Green Bay star shared during his interview with ESPN in a piece published Friday.",
    "\"Secondly, we’re in a situation where we have put together — and you’d [sic] guys, did it for our, the president Obama’s administration, before this — we have put together, I think, the most extensive and and inclusive voter fraud organization in the history of American politics.\"",
    "“But when you say stuff like that, and then you have the CDC, which, how do you even trust them, but then they come out\nComments:\nIt's worth noting, Aaron Rogers isn't exactly a MAGA, right-winger.",
    "I'd gladly vote for someone who would have the shot pushers arrested for fraud and the international cabal members who developed the enhanced virus tried and executed for crimes against humanity.",
    "October 2020, before the election; speaking to former Barack Obama staffers on Pod Save America, host Dan Pfeiffer asked Biden what his message was to people who have not yet voted.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Joe Biden: \"Well, first of all, you know, uh, what really rankles, uh, my opponent is I say that, uh, the thing that bothers him most is he’s not a patch on Barack’s jeans.\"",
    "Presumptive 2024 nominee Donald Trump also says it's a pandemic of the unvaccinated, and praises the shots that do not work (while the rally crowd boo loudly).",
    "Biden himself with a slip of his tongue, for once told the truth of the Marxist Communist democrats and they are all guilty of treason.",
    "Biden does not correct himself after saying “voter fraud organization,” nor did the hosts attempt to correct or clarify his statement.",
    "The voice of reason from a “mouthpiece.” Funny how it takes a high profile athlete to call out this Rona hysteria with common sense.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "The Marxist Communist democrats, republicrats GOPe, etc., are the real danger to America from within.",
    "Dementia Jo's handlers have to feed him simple slogan Otherwise, he gets even more confused.",
    "October, 2020 Video; Biden tells how democrats stole the 2020 election and twice for Obama.",
    "https://youtu.be/C6u1uKznCYw Biden's confession starts at time 17:40 on video interview.",
    "The guy went to University of California, Berkeley and wears a man-bun for Pete's sake.",
    "Your donation helps keep our discussions going and our voices heard.",
    "It may not be easy to return our allegiance & clean up the swamp.",
    "We used to be home of the free & land of the brave.",
    "I’m very disappointed in the American people.",
    "Pandemic of the unvaccinated.",
    "The Dems are in a freefall.",
    "No joke, I'm not kidding.",
    "We have nowhere to turn.",
    "Build back better.",
    "I’ll do my part.",
    "Thank you.",
    "Dr. Jill."
  ]
}