{
  "id": 3704,
  "mediaId": 2625,
  "date": "2022-01-20",
  "headline": "“History Is Watching Us”: Democratic Senators Go All In for Voting Rights",
  "image": "https://www.motherjones.com/wp-content/uploads/2022/01/hed.00_00_07_22.Still002.jpg?w=1200&h=630&crop=1",
  "link": "https://www.motherjones.com/politics/2022/01/history-is-watching-us/",
  "mediaOutlet": "Mother Jones",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Noah Y. Kim",
  "authorUrl": "https://www.motherjones.com/author/noah-y-kim/",
  "termIds": [
    0
  ],
  "sentences": [
    "— @ReverendWarnock pic.twitter.com/x06Z3CmPJE\n— Mother Jones (@MotherJones) January 20, 2022\nThe defeat of the two bills had been all but inevitable since at least last week, when Sinema announced that she wouldn’t vote to curtail the filibuster to protect voting rights.",
    "Republican politicians quickly deployed the procedure to squash the John Lewis Voting Rights Advancement Act and the Freedom to Vote Act, the paired bills that aimed, among other things, to stem gerrymandering and voter suppression across the nation.",
    "However, the Democrats did manage to make an urgent case for the legislation, which they cast as crucial to counter efforts by Republicans to suppress minority votes, gerrymander congressional maps, and even seize control of election boards.",
    "In addition, progressives and moderates alike, from Bernie Sanders (I-Vt.) to Amy Klobuchar (D-Minn.), emphasized that the filibuster is an arcane rule, applied selectively to block broadly popular legislation.",
    "“It’s about expanding politicians’ power.”\nThe topic of racism loomed over the proceedings: Some of the GOP’s most blatant attempts at gerrymandering have centered on majority-minority districts.",
    "Scott claimed that the characterization was overblown and offensive, while Booker responded that it was all the more shocking that voter-suppression efforts continue in the present day.",
    "The Democrats’ voting rights push may have ended in bitter failure, but the final vote on the filibuster also showed how far Democratic thinking on the procedure has shifted.",
    "Republicans, on the other hand, argued that the Democrats were inventing a crisis and claimed that expanding the right to vote was tantamount to a Democratic power grab.",
    "This week, Democrats managed to unite progressives and most of their moderates around a new consensus: For the health of democracy, the filibuster must go.",
    "Cory Booker (D-N.J.) and Tim Scott (R-S.C.), who argued vehemently over whether the GOP’s efforts at voter suppression should be compared to Jim Crow.",
    "“This party-line push has never been about securing citizens’ rights,” said Senate Minority Leader Mitch McConnell (R-Ky.).",
    "After two days of debate on the Senate floor, the Democrats’ Hail Mary push for voting rights came up short, as Sens.",
    "Forty-eight out of 50 Democratic senators opted for reform, including moderates like Jon Tester (D-Mont.)",
    "One of the most impassioned disagreements occurred between two of the Senate’s Black members: Sens.",
    "Kyrsten Sinema and Joe Manchin joined with the GOP to block a rules change to the filibuster.",
    "and Mark Kelly (D-Ariz.), a number that would’ve been unthinkable just a few years ago.",
    "\"What we would have done back then, we are doing right now.\""
  ]
}