{
  "id": 3707,
  "mediaId": 8432,
  "date": "2022-01-21",
  "headline": "Arizona water authority to get $18.5M under infrastructure law",
  "image": "https://www.gannett-cdn.com/presto/2022/01/17/PPHX/1bd8f52e-2eb5-43ed-ad7c-4940ec7f73e3-MLK_Day_March002.JPG?crop=5999,3375,x0,y305&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/local/arizona-water/2022/01/21/arizona-water-authority-get-18-5-m-under-infrastructure-law/6609919001/",
  "mediaOutlet": "Scottsdale Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cami Parrish",
  "authorUrl": "https://www.azcentral.com/staff/6528856001/cami-parrish/",
  "termIds": [
    0
  ],
  "sentences": [
    "Navajo Nation President Jonathan Nez said in a written statement that the Navajo Nation has advocated for the reconstruction of the Winslow levee for many years, and he is appreciative of the support from local leaders, the Arizona congressional delegation and the Biden administration for funding the project.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nRep. Tom O’Halleran, D-Ariz., played a key role in the authorization of that funding.",
    "The projects are expected to benefit Maricopa, Buckeye, the Pascua Yaqui Tribe, the Yavapai-Apache Nation, the Queen Creek Restoration Project, Quartzite, Pima County, and a few northern Arizona neighborhoods in need of flood mitigation structures.",
    "A water authority created in 2020 by legislation sponsored by Rep. Greg Stanton to bolster water accessibility and cleanliness for rural and Indigenous communities will get $18.5 million via the recently passed bipartisan infrastructure law.",
    "The infrastructure law signed Nov. 15 by President Joe Biden also authorizes $65.7 million for the reconstruction of the Little Colorado River levee, which could put residents of Winslow and the Navajo Nation at risk if it fails.",
    "The authority eventually will provide $150 million for Arizona water infrastructure projects, per Stanton's office, and about 75% of the total cost of increasing clean water access in the communities is now secured.",
    "According to the spending plan, the $18.5 million will go toward the creation of water pipelines, wastewater treatment plans, flood detention and filtration treatments for rural and Native American communities.",
    "\"For far too long, small, rural and tribal communities in Arizona haven't gotten their fair share of federal infrastructure dollars,\" Stanton, D-Ariz., said in a written statement announcing the funding.",
    "Pascua Yavapai Chair Peter Yucupicio said that the funding secured by Stanton will help the tribe complete a project they started last year to build a crucial water pipeline for their community.",
    "“It’s only right that the largest infrastructure investment in a generation includes funds for these communities to protect and conserve the Southwest’s most precious resource.\"",
    "Jon Huey, the Yavapai-Apache Nation chair, said Stanton's advocacy was \"critical for the tribe\" and the $3 million will be spent developing a new wastewater treatment system.",
    "In a written statement, O'Halleran said he was “pleased to see these funds awarded to complete this urgently-needed project that will protect Arizona families.”\nSens.",
    "Kyrsten Sinema, D-Ariz., and Mark Kelly, D-Ariz., and Stanton joined O’Halleran in urging in an open letter for the authorization of the federal funds.",
    "Stanton got the Arizona water authority included in the 2020 Water Resources Development Act signed by former President Donald Trump.",
    "Stanton, who sits on the House Transportation and Infrastructure Committee, has made water infrastructure a priority.",
    "Sinema was a leading negotiator last year in the discussions that led to the bipartisan infrastructure legislation.",
    "Subscribe to azcentral.com today.",
    "Support local journalism."
  ]
}