{
  "id": 3714,
  "mediaId": 8439,
  "date": "2022-01-19",
  "headline": "Sen. Mark Kelly supports change to Senate's filibuster rule for voting-rights legislation",
  "image": "https://www.gannett-cdn.com/presto/2022/01/19/PPHX/24bc9a38-acaf-41d5-9a46-49831e786a52-uscp-7jc8fudq2fpb9ascyge_original.jpg?crop=3599,2025,x0,y183&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/elections/2022/01/19/sen-mark-kelly-arizona-supports-change-filibuster-rule/6576500001/",
  "mediaOutlet": "Southwest Valley Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yvonne Wingett Sanchez",
  "authorUrl": "https://www.azcentral.com/staff/2646083001/yvonne-wingett-sanchez/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Whether the Senate fails or succeeds in passing this legislation, I will continue doing this job just as I promised Arizonans: delivering results by working with Republicans and Democrats to find common ground as we have on infrastructure, standing up to party politics, and staying focused on doing what is best for Arizona.”\nKelly said the Senate's long-standing traditions have become dysfunctional in a time of intense partisanship, creating a paralysis that prevents work on issues that matter to Americans — like the fundamental right to vote.",
    "I’ve considered what rules changes would mean not just today, but years down the road, for both parties and all Arizonans.”\nThe Freedom to Vote Act would establish Election Day as a federal holiday, protect early- and mail-voting options, ban partisan gerrymandering and bolster election security, among other things.",
    "GOP candidate Blake Masters, a venture capitalist backed by billionaire Peter Thiel, a Trump ally, called Kelly \"dishonest\" in his explanation for an exception to the filibuster, saying it could be used to further some liberal congressional lawmakers' agenda to expand the U.S. Supreme Court, among other things.",
    "He is a far-left senator who will do whatever Joe Biden and Washington Democrat leadership tell him to in order to pass a radically liberal agenda,\" Katharine Cooksey, a spokesperson for the Senate Republicans' campaign arm, the National Republican Senatorial Committee, said in a written statement.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nKelly, a retired astronaut and combat veteran, took office in December 2020.",
    "He echoed sentiments he expressed earlier this month during a stop in Mesa about the Senate's operations: “If NASA or the Navy functioned like the United States Senate, we would never get the rocket off the launchpad and in combat we’d never complete the mission,\" his statement said.",
    "Kelly's decision, similar to a proposed boost to the federal minimum wage as part of a COVID-19 relief package last year, kept him in line with his Democratic colleagues on an issue where Sinema has cut a different approach that leaves those on the left fuming.",
    "Sen. Mark Kelly, D-Ariz., will support a change to the filibuster rule, The Arizona Republic has learned, showing for the first time a willingness to bend on an issue that has tied the Senate in knots for a year as the Democratic legislative agenda has stalled.",
    "At the same time, he has pushed back against political attacks on Arizona’s popular vote-by-mail system, which came under withering attacks led by former President Donald Trump and many of his supporters during the 2020 election and in its aftermath.",
    "“Arizonans deserve a Senate that is more responsive to the challenges facing our country, which is why I’ve spoken with Arizonans and my Republican and Democratic colleagues about their views on what can be done to make this place work better.",
    "A bill to impose federal regulations on voting that would effectively block Republican changes in states is expected to fail because two other Democrats have voiced opposition to changing rules to enact the bills on party lines.",
    "Democratic Majority Leader Chuck Schumer, of New York announced his intent to create an exception to the filibuster for the bills with a “talking filibuster” to hold the floor after Republicans block advancement of the bills.",
    "Protecting the vote-by-mail system used by a majority of Arizonans and getting dark money out of our elections is too important to let fall victim to Washington dysfunction,” Kelly said in a statement to The Republic.",
    "“We’re seeing that now, as voting rights legislation remains blocked while partisan politicians work to undermine Arizona’s successful vote-by-mail system and create more barriers to vote,” his statement said.",
    "Kelly began signaling support in recent weeks for changing the status quo in the evenly divided chamber only as it relates to the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act.",
    "But until Wednesday, the senator has avoided answering specifically where he stood on proposed changes to the filibuster, where 60 votes are necessary to get most bills through the 50-50 chamber.",
    "One is his seatmate, Sen. Kyrsten Sinema, D-Ariz., who has drawn vitriol from the left and outside groups that have previously backed her and praise from the right for her position.",
    "“Senator Mark Kelly would rather federalize Arizona’s elections than stand up to Chuck Schumer and Nancy Pelosi,\" Brnovich campaign spokesperson Joanna Duka said.",
    "Kelly’s position earned him sharp condemnation from Republicans, who will use it as a way to cast him as an extreme partisan as he runs for reelection.",
    "The campaign's statement cast him as a \"puppet of the progressive left,\" a departure from the more independent-minded lawmaker he portrays himself as.",
    "Kelly, who is up for reelection this year, will back a “talking filibuster” rule only for the proposed voting rights legislation that he co-sponsors.",
    "“If campaign finance and voting rights reforms are blocked again this week, I will support the proposed changes to pass them with a majority vote.",
    "Kelly, he said, pledged to \"represent the people of Arizona in the Senate; instead he’s voted in lockstep with the far left Biden/Schumer agenda.\"",
    "The legislation was barreling toward defeat Wednesday; both Sinema and Kelly were in the Senate at times listening to debate on the bills.",
    "Kelly has voted in line with Biden’s position 97.5% of the time during the 117th Congress as tracked by the website FiveThirtyEight.",
    "Businessman Jim Lamon, another GOP Senate hopeful, accused Kelly of putting Democrats' agenda ahead of the interests of the state.",
    "Arizona Attorney General Mark Brnovich's campaign said in a statement that Kelly's decision demonstrates liberal tendencies.",
    "Subscribe for free to The Gaggle political podcast on Apple Podcasts, Overcast, or wherever you listen to audio content.",
    "Republican candidates who hope to face Kelly in the November general election blistered Kelly's decision.",
    "The John Lewis Voting Rights Advancement Act would re-establish protections under the Voting Rights Act.",
    "The move would effectively allow for a simple majority vote instead of the current 60-vote threshold.",
    "Contact her at yvonne.wingett@arizonarepublic.com and 602-444-4712.",
    "Kelly will face the winner of a crowded Republican primary.",
    "\"That'd be the end of America as we know it,\" he wrote.",
    "The race is rated a “toss-up” by election analysts.",
    "The winner will serve a full six-year term.",
    "Reach the reporter on Twitter and Facebook.",
    "Have news to share about Arizona politics?",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "“Kelly is no moderate."
  ]
}