{
  "id": 3722,
  "mediaId": 2512,
  "date": "2022-01-25",
  "headline": "Arizona journalist explains why Ruben Gallego could become Kyrsten Sinema’s biggest 'headache'",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29107927&width=1200&coordinates=0%2C0%2C0%2C213&height=600",
  "link": "https://www.alternet.org/2022/01/sinema-2656474962/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    0
  ],
  "sentences": [
    "If, however, Republicans continue their bizarre obsession with Donald Trump and nominate, as Arizona Mirror’s Jim Small put it, ‘a Big Lie-spouting, pandemic-downplaying, misinformation-peddling Republican?’”\nRoberts continues, “If state GOP Chairwoman Kelli Ward is the nominee, hoping the third time’s the charm, or someone like her?",
    "\\n\\n\"I have gotten a lot of encouragement,\" saying the last few weeks have amounted to a \"tipping point\"http://www.cnn.com/2022/01/20/politics/ruben-gallego-kyrsten-sinema-arizona-democrats-senate/index.html\\u00a0\\u2026\n— Manu Raju (@Manu Raju) 1642715113\nBut here’s the thing: Sinema, Biden and Kelly are all centrists.",
    "Sen. Kyrsten Sinema of Arizona once again infuriated the liberal/progressive wing of the Democratic Party when she not only restated her opposition to ending the filibuster, but also, made it abundantly clear that she even opposes creating a filibuster exception for voting rights bills.",
    "Gallego’s been grumbling all week about Sinema’s disloyalty, telling CNN that ‘more than one’ Senate Democrat has approached him about challenging her in a primary.”\nRoberts believes that if Gallego challenged Sinema in a Democratic primary in 2024, he would win.",
    "Once deeply Republican, Arizona was closely identified with conservative Sen. Barry Goldwater and later, Sen. John McCain — who considered himself a “Goldwater conservative” or “Goldwater Republican.” But Arizona has evolved into a swing state.",
    "Doug Ducey is a conservative Republican, Arizona now has two Democratic U.S. senators (Sinema and Sen. Mark Kelly) and favored Democrat Joe Biden over Republican Donald Trump in 2020’s presidential election.",
    "Ruben Gallego was all set to run for the Senate in 2020 until old-school party leaders waved him off, calculating wisely that the more moderate Mark Kelly stood a better chance of winning,” Roberts explains.",
    "And since, at this point, there appear to be precious few Republicans outside of Team MAGA who could win a Republican primary — well, you can see why Sinema might be feeling a headache coming on.”",
    "That’s the calculation Democrats need to make.”\nHow well Gallego would perform against a Republican in 2024’s general election, according to Roberts, would depend on how crazy that GOP nominee is.",
    "A Republican is.”\nRoberts observes, “Liberals are furious with (Sinema’s) refusal to vote to suspend the filibuster so the voting rights bill she supports could pass on a party-line vote.",
    "“If Republicans regain their sanity in the next two years and put up a candidate with broad appeal,” Roberts argues, “Gallego would have a hard time pulling out a win.",
    "Ruben Gallego told me he's been fielding a lot of calls -- including from multiple Democratic senators -- urging him to take on Kyrsten Sinema in 2024.",
    "GOP activist and Trump critic Meghan McCain, who is Sen. McCain’s daughter and a former co-host of ABC’s “The View,” is an ardent Sinema cheerleader.",
    "And the Wall Street Journal’s conservative editorial board vigorously defended Sinema as “principled” in an editorial published on January 23.",
    "And while Sinema is wildly unpopular with progressives, independents and Never Trump conservatives have a much more favorable opinion of her.",
    "Some progressive Democrats are calling for a primary challenge to Sinema in 2024, and the liberal they have in mind is Rep. Ruben Gallego.",
    "Journalist Laurie Roberts grapples with that question in an op-ed published by the Arizona Republic on January 21.",
    "There is no example of a true liberal or progressive winning a statewide race in Arizona in recent years.",
    "But the general election, Roberts stresses, could be a much heavier lift for the liberal congressman.",
    "But if Gallego defeats Sinema in a Democratic primary, could he win a statewide race in Arizona?",
    "Arizona’s political landscape has changed considerably from what it was 30 or 40 years ago.",
    "Democrats would have no choice but to stick with Sinema or risk losing the seat altogether.",
    "“Probably, at this point, Krusty the Clown could beat Sinema in a Democratic primary.",
    "In 2021, McCain warned, “If (Manchin and Sinema) are out, a Democrat’s not coming in.",
    "But like Sinema, he didn’t beat McSally, in her second run for the Senate, by much.",
    "Until now, perhaps.”\nThe “Plan B” that Roberts is referring to is Gallego.",
    "“Gallego could beat Sinema in a primary,” Robert says with confidence.",
    "Gallego has a great story, and he’s a rising star on the left.",
    "It was either Sinema’s way or the Republican highway.",
    "The question is: Could he win the general election?",
    "Gallego’s fortunes would dramatically improve.",
    "In the past, their fury hasn’t mattered.",
    "Democrats didn’t have a viable Plan B.",
    "So is Democratic ex- Arizona Gov.",
    "But two years from now?",
    "Two years ago, no way.",
    "Janet Napolitano.",
    "While Gov.",
    "“He did.",
    "“Rep."
  ]
}