{
  "id": 3822,
  "mediaId": 2589,
  "date": "2022-01-23",
  "headline": "Bernie Sanders: Damn right Sinema should have been censured by the Arizona Democratic Party",
  "image": "https://hotair.com/wp-content/uploads/2022/01/9-1110x740.jpg",
  "link": "https://hotair.com/allahpundit/2022/01/23/bernie-sanders-damn-right-sinema-should-have-been-censured-by-the-arizona-democratic-party-n443522",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allahpundit",
  "authorUrl": "https://hotair.com/author/allahpundit",
  "termIds": [
    0
  ],
  "sentences": [
    "They cannot understand why he would force 47 of his members to join him on record in support of curbing the filibuster in a losing cause, a vote that Republicans will now try to exploit by accusing Democrats of a power grab in pursuit of progressive initiatives such as granting statehood to the District of Columbia and expanding the Supreme Court.",
    "https://t.co/XQb5h2qrv3 #CNNSOTU pic.twitter.com/HVZPh6U638\n— State of the Union (@CNNSotu) January 23, 2022\nA series of votes aimed at testing their commitment to left-wing priorities is the last thing swing-state incumbents like Mark Kelly, Maggie Hassan, and Catherine Cortez Masto want.",
    "They cannot fathom why he would want to highlight the divisions between most of his caucus and Senators Manchin and Sinema, provoking grass-roots outrage at two senators he is going to need on other issues as Democrats try to resurrect President Biden’s stalled agenda.",
    "If Kelly and the rest end up losing because they were pressured into voting further left than they would have preferred, progressives like Sanders are willing to pay that price in the name of showing the party that their priorities can’t be taken for granted.",
    "Threatening to campaign against Sinema is part of the pressure tactics: Bernie’s warning Kelly, Hassan, and Cortez Masto that the left is watching them and won’t show up for them in November if they tack towards the middle.",
    "He couldn’t stop Manchin from killing that bill but he can make all the other squishes in the caucus who’ve been keeping their heads down, content to let Manchin serve as a lightning rod for the left, to show their cards.",
    "Republicans still can’t believe that it was his own caucus leader who painted him into that corner — on a vote that was destined to fail, no less:\nRepublicans remain mystified by Mr. Schumer’s strategy.",
    "Watch:\nSen. Bernie Sanders says the Arizona Democratic Party's move to censure Sen. Kyrsten Sinema for not voting in favor of federal voting rights legislation was \"absolutely\" an appropriate decision.",
    "It took Kelly a full year to declare his position on the filibuster, so reluctant was he to alienate the left or the center-right by siding with one over the other on the issue.",
    "Bernie’s playing the long game, in other words, and maybe exacting a bit of revenge for the failure of Build Back Better at the hands of the centrist Manchin.",
    "This clip is newsy, but not for what Sanders says about censuring Sinema and possibly campaigning against her and Joe Manchin during their next primaries.",
    "Which is truer to the spirit of a guy who couldn’t be bothered to call himself a Democrat until he ran for the Democratic nomination for president.",
    "The House is already gone, which means nothing’s going to happen legislatively for the next two years even if Democrats hold their Senate majority.",
    "Sanders wants to use their electoral vulnerability to steer them to the left by forcing them to go on record in support of progressive priorities.",
    "“But to watch the party label Sinema an enemy of democracy for her consistency is quite something.”\nIsn’t Bernie an independent, by the way?",
    "“It’s one thing for a majority of the Democratic Party to flip-flop on the filibuster in a couple years,” John McCormack tweeted yesterday.",
    "What’s newsy is his proposal of a change of approach in the Senate, a message he was eager to promote in his TV appearances this morning.",
    "(Sinema might not relish that but Manchin would be delighted for West Virginians to see up close how much the American left hates him.)",
    "Are Biden and Schumer dumb enough to follow his approach and force a series of no-win votes for their moderate incumbents?",
    "If they’re left to their own devices, they’ll bite their tongues and steer towards the center for electability reasons.",
    "That makes their odds of reelection longer, especially in a national environment that should heavily favor Republicans.",
    "Progressives want Senate Dems to start voting, a tactic that’s good for their movement but not good for their party.",
    "Doesn’t Bernie understand that a series of tough votes in the Senate will make it harder for Kelly et al.",
    "When did he become a ruthless enforcer of party orthodoxy, replete with official reprimands for heretics?",
    "Some of his campaign staffers are already organizing against Sinema in Arizona.",
    "to position themselves as centrists before they face voters this fall?",
    "We already knew he felt that way, after all.",
    "That’s the whole point.",
    "Bernie doesn’t care.",
    "Of course he does.",
    "Stay tuned!"
  ]
}