{
  "id": 3881,
  "mediaId": 2702,
  "date": "2022-01-20",
  "headline": "The Hill’s Morning Report – Presented by Facebook – Biden talks, Senate balks",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/01/bidenjoe_ap_0.jpg?w=1280",
  "link": "https://thehill.com/homenews/morning-report/590540-the-hills-morning-report/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The U.S. Conference of Mayors, meeting in person this week, will hear today from Cabinet leaders, including secretaries Pete Buttigieg (Transportation), Marty Walsh (Labor), Marcia Fudge (Housing and Urban Development), Gina Raimondo (Commerce), Cardona, Administrator Isabella Casillas Guzman (Small Business Administration) and Acting Administrator Stephanie Pollack (Federal Highway Administration).",
    "“I’m not going to negotiate against myself as to what should and shouldn’t be in it, but I think we can break the package up, get as much as we can now, come back and fight for the rest later.”\nBiden said provisions unlikely to become law in the near future are permanent expansion of the child tax credit and free community college — both included in the Democrats’ sweeping agenda (The Hill).",
    "As Democrats steeled themselves for Wednesday’s defeat of the party’s voting rights plank in the Senate, President Biden told reporters he accomplished more than any other president in his first year and vowed to take his legislative wish list, including bits of his moribund Build Back Better agenda, out on the campaign trail this year.",
    "Asked if he overestimated his ability to unify the country, Biden said the U.S. is “not as unified as it should be.”\nBiden said the United States and NATO allies are prepared to deliver “severe costs and significant harm” in the form of economic sanctions if Russia invades Ukraine, where it has 100,000 troops massed at the border.",
    "Biden said he hopes to persuade more of the 30 million Americans still unvaccinated to get shots to protect against infection, to support a promising antiviral pill and other treatments that prevent severe illness from the coronavirus, and to urge developed countries to donate more COVID-19 vaccine doses to poorer nations in need.",
    "The White House moved swiftly as the news conference concluded to clarify Biden’s confusing suggestion that a “minor incursion” by Russia, by which his advisers said he meant a possible cyberattack, would prompt a different allied response than if Putin orders a military “invasion” of Ukraine (The Hill and The Washington Post).",
    "called the court’s decision “a victory for the rule of law and American democracy.”\nThe decision came in an unsigned, one-paragraph order and clears the way for the probe to receive a batch of schedules, call logs, emails and other requested documents to help shed light on the Trump White House’s handling of the riot.",
    "The committee is seeking roughly 800 pages of documents that also includes speech drafts, handwritten notes and other files held by former senior aides, including chief of staff Mark Meadows, adviser Stephen Miller, press secretary Kayleigh McEnany and White House associate counsel Patrick Philbin (Politico).",
    "“He has to do something.”\nSecretary of State Antony Blinken will meet Friday with Russian Foreign Minister Sergey Lavrov in Geneva to continue diplomatic talks (Reuters), but Biden suggested Moscow’s representatives may not know exactly what Putin is preparing to do to try to block NATO expansion westward.",
    "During a nearly two-hour news conference, the president defended his leadership, said he plans to seek reelection with Vice President Harris on the ticket and assailed Republicans for what he said is their politically motivated fear of compromises that would otherwise benefit the American people.",
    "He will meet with his science and technology advisory council at 4:15 p.m. Biden and the vice president will speak during a Democratic National Committee grassroots event in the executive residence at 7 p.m.\nSecretary Blinken will speak about the crisis in Ukraine at 9:45 a.m. EST from Berlin.",
    "> Starbucks Corp. told employees on Tuesday the company will no longer require U.S. workers to be vaccinated against COVID-19 or undergo weekly testing by next month, after the Supreme Court recently blocked the administration’s mandate for large private employers (The Wall Street Journal).",
    "The president said changes in recommendations about a “brand new virus” result when “scientists are learning more.” He called the pandemic “an unfolding story” while commending the swift development of effective COVID-19 vaccines, which began under his predecessor.",
    "First lady Jill Biden will travel to New Jersey to visit Bergen Community College at 11:30 a.m. with Education Secretary Miguel Cardona to highlight federal funding made available through the American Rescue Plan and to announce additional support from Washington.",
    "“We’ve never been consulted on them, about how to frame them, about what impact we’ve had,” said one DNC member in touch with leadership about how to message around the possibility that the Build Back Better plan and voting rights legislation could both be doomed.",
    "> International: British Prime Minister Boris Johnson on Wednesday announced that the United Kingdom is set this month to end all COVID-19 restrictions that were aimed at stemming the spread of the omicron variant as it appears the strain has peaked nationally.",
    "“For the last year, my Democratic colleagues have taken to the Senate floor, cable news airwaves, pages of newspapers across the country, and to argue that repealing the filibuster is restoring the vision the founding fathers intended for this deliberate body.",
    "IN FOCUS/SHARP TAKES\nPOLITICS: The Supreme Court on Wednesday rejected former President Trump’s effort to deny the House select committee investigating the Jan. 6 attack on the Capitol from gaining access to documents and records from his administration.",
    "> Meanwhile, Japan is moving in the other direction as Prime Minister Fumio Kishida announced that numerous municipalities across his country will be placed under expanded COVID-19 restrictions starting at the end of this week due to an omicron surge.",
    "“You’ve got people on the DNC — from state chairs to elected national committee people, to union leaders — who ought to be consulted about these things, who aren’t.”\nThe Morning Report is created by journalists Alexis Simendinger and Al Weaver.",
    "SEXUAL ASSAULT SETTLEMENT: The University of Michigan agreed to a $490 million settlement with more than 1,000 people who say they were sexually assaulted by Robert Anderson, a former athletics doctor, during his 37-year tenure at the school.",
    "GM parts-direct store\nGM electric vehicle financing and purchase\nGM upgrades and subscriptions purchases\nAll of the above\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Biden defended his White House coronavirus response team, including Centers for Disease Control and Prevention Director Rochelle Walensky, who has been criticized for issuing shifting guidance many Americans and businesses found confusing.",
    "LEADING THE DAY\nCORONAVIRUS: During the president’s marathon East Room session, in which he fielded questions from 24 reporters all garbed in masks and tested beforehand for COVID-19, Biden conceded Americans’ exhaustion with the pandemic.",
    "Let us choose in favor of our democracy,” Schumer said in a floor speech before the vote, with Senate Minority Leader Mitch McConnell (R-Ky.) accusing the Democratic leader of attempting to “break the Senate” with the rule change.",
    "“Because the Court of Appeals concluded that President Trump’s claims would have failed even if he were the incumbent, his status as a former President necessarily made no difference to the court’s decision,” the court wrote.",
    "He supports the Department of Justice’s efforts to enforce voting rights at the state level and said he would publicly champion voting rights and try again to enact portions of the John Lewis bill during his presidency.",
    "I have long admired and been influenced by the work of Mark Twain, or, as he was known by his given name, Samuel Leibowitz,” the activist and comedian said in a reference to his given last name (The Washington Post).",
    "https://on.wsj.com/3tQ25E6\nA MESSAGE FROM FACEBOOK\nWhy Facebook supports updated internet regulations\nRochelle is one of many experts working on privacy at Facebook—to give you more control over your information.",
    "Speaking from the Senate chamber during Biden’s appearance at the White House, Manchin parted company with the president, saying a change in the Senate rules would be “a perilous course” for the country.",
    "With added challenges come increased opportunities to reshape our existing structures and build more sustainable cityscapes, enhancing economic stability and improving the lives of all residents.",
    "A MESSAGE FROM FACEBOOK\nWhy Facebook supports updated internet regulations\nRochelle is one of many experts working on privacy at Facebook—to give you more control over your information.",
    "As The Hill’s Hanna Trudo reports, Democratic National Committee insiders are debating how to handle the number of party disappointments, helping to create a mounting sense of despair.",
    "IRS Free File Online\nFree File: Do Your Federal Taxes for Free\nFree Fillable Forms\nAll of the above\nOn Tuesday, General Motors announced plans for which digital option for car buyers?",
    "Biden said he wants to travel out of Washington to better communicate the specifics of legislation he’s advocating, meet with voters and confer with outside experts and thinkers.",
    "It’s a tall task, but it’s one Democratic insiders are attempting to figure out in the midst of legislative troubles and a struggle to implement Biden’s agenda on Capitol Hill.",
    "The upper chamber voted to end debate, 49-51, on the package, which would have combined the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act (The Hill).",
    "Hours later and after a lengthy floor debate, the chamber also voted down an attempt to invoke the “nuclear option” to try to alter the filibuster rules, 52-48 (The Hill).",
    "The White House press briefing is scheduled at 1:30 p.m.\nHill.TV’s “Rising” program features news and interviews at http://thehill.com/hilltv or on YouTube at 10:30 a.m.",
    "Fudge Crisps\nChoco Gluten Free\nAdventurefuls\nTijuana Flats\nAs of this week, where can Americans find free COVID-19 test kits for online ordering with postal delivery?",
    "The legislative failure was anticipated because Sinema and Manchin for months explained their embrace of the current 60-vote threshold needed to take up legislation.",
    "Reminder: Senate Minority Leader Mitch McConnell (R-Ky.) told colleagues there would be no GOP agenda ahead of the November contests, according to Axios last month.",
    "In televised remarks, Raisi told Putin it was time to take on “the power of the Americans with an increased synergy between our two countries” (The New York Times).",
    "Now there’s an underground movement to save pets from a zero-COVID policy that Hong Kong residents say is based on fear rather than science (The Washington Post).",
    "The homage created under the banner of author Samuel Langhorne Clemens, made famous under a pen name, has not been given out since 2019 because of the pandemic.",
    "The Senate convenes at 11 a.m. and will resume consideration of the nomination of Holly Thomas to be a U.S. circuit judge for the 9th Circuit Court of Appeals.",
    "The Hill: Supreme Court Associate Justices Sonia Sotomayor and Neil Gorsuch issued a statement on Wednesday denying tensions over mask-wearing on the bench.",
    "While officials agree on the larger point — keeping Democrats in office — sources indicate there’s a lack of knowledge and consensus around how to do that.",
    "The president will receive the President’s Daily Brief at 9:30 a.m. Biden and Harris will meet with members of his infrastructure task force at 11:15 a.m.",
    "Hear more from Rochelle on why Facebook supports updating regulations on the internet’s most pressing challenges, including federal privacy legislation.",
    "Hear more from Rochelle on why Facebook supports updating regulations on the internet’s most pressing challenges, including federal privacy legislation.",
    "The Upshot: With less than 10 months until the midterm elections, Democrats’ barbs about the agenda-less Republicans will be heard again and again.",
    "MARK TWAIN PRIZE: Jon Stewart will be feted in the Kennedy Center Concert Hall on April 24 as the 23rd recipient of the Mark Twain Prize for humor.",
    "According to the university, 1,050 people will share in the settlement, with individuals and their attorneys figuring out how to divide the money.",
    "When the planet goes cold in millions or billions of years, it would lose its magnetic field, which shields Earth from harmful cosmic radiation.",
    "The Hill: States are investing billions of dollars in grants drawn from federal funds to help child care companies during pandemic pressures.",
    "INTERNATIONAL: Meeting in Moscow on Wednesday, Putin and Iranian President Ebrahim Raisi presented a united front against the United States.",
    "Johnson cited the success of getting the nation boosted and keeping individuals out of the intensive care unit as their roadmap (The Hill).",
    "It also leaves in place a lower federal appeals court ruling that found the ex-president’s assertion of executive privilege unpersuasive.",
    "“It’s just going to take a little bit of time.”\nBiden cited surveys and public opinion at the same time he said he doesn’t believe polls.",
    "Inspired by new digital services announced this week, we’re eager for some smart guesses about traditional practices with online twists.",
    "https://wapo.st/3IkvPgG\nIt might be time to consider mandatory voting in America, by Jonah Goldberg, columnist, The Los Angeles Times.",
    "Biden also readily conceded that his multi-trillion-dollar social spending and climate proposal would likely have to be scaled back.",
    "Total U.S. coronavirus deaths reported each day this week: Monday, 850,605; Tuesday, 851,730; Wednesday, 854,074; Thursday, 857,778.",
    "Senate Majority Leader Charles Schumer (D-N.Y.), voted no for procedural reasons to allow Democrats to revisit the legislation.",
    "On Capitol Hill, the defeat Wednesday of a bill championed by Democrats to protect ballots and elections proved anticlimactic.",
    "He faulted Republicans, arguing they are more obstructionist now than during former President Obama’s eight years in office.",
    "WHERE AND WHEN\nThe House meets at 9 a.m. Speaker Nancy Pelosi (D-Calif.) will hold her weekly press conference at 10:45 a.m.",
    "Among the other troubles is how to conduct the party’s ground game and how to message on the administration’s work thus far.",
    "Tokyo headlines dozens of areas will be placed under a three-week set of restrictions, which are due to expire on Feb. 13.",
    "Amazon.com\nCOVIDtests.gov\nCVS.com\nCOVIDsafe.usa\nThe Internal Revenue Service has unveiled which online tax filing help?",
    "On Wednesday, a new survey found that 56 percent of Americans disapprove of the job he’s doing (The Associated Press).",
    "Email your responses to asimendinger@thehill.com and/or aweaver@thehill.com, and please add “Quiz” to subject lines.",
    "“I’ve not been out in the community nearly enough,” he added, faulting himself and blaming a pileup of priorities.",
    "https://lat.ms/33L04OJ\n2022 midterms are a no-win for Democrats, by Karl Rove, columnist, The Wall Street Journal.",
    "His speech will be live streamed on www.state.gov, www.YouTube.com/statedept and contentflow.de/atlantik-bruecke/.",
    "Mark Kelly (D-Ariz.), who is up for reelection this year, backed the proposed filibuster rule change that failed.",
    "“The only choice to move forward on these vital issues is to change the rules in the modest way we have proposed.",
    "… Johnson’s baby, Romy, contracted COVID-19 at five weeks old and is recovering, according to The Independent.",
    "SCIENCE: Researchers said this week that the Earth’s core is cooling at a faster rate than previously thought.",
    "Girl Scouts announced a DoorDash (contactless) purchase option for cookie sales, plus a new sweet treat.",
    "Carl Hulse, The New York Times: After a day of debate, the voting rights bill is blocked in the Senate.",
    "He challenged his “friends” across the aisle to outline their agenda and propose alternative solutions.",
    "The Hill: Biden confers with senators on Ukraine-Russia tensions; Defense Department briefed lawmakers.",
    "We get you up to speed on the most important developments in politics and policy, plus trends to watch.",
    "Join The Hill for a conversation with mayors from across the country at The Future of Cities Summit.",
    "Scott Wong and Mike Lillis, The Hill: Fury over voting rights fight turns personal on Capitol Hill.",
    "THE CLOSER\nAnd finally … It’s Thursday, which means it’s time for this week’s Morning Report Quiz!",
    "Biden told reporters he is weighing possible executive action, but declined to lay out specifics.",
    "Alexander Bolton, The Hill: Schumer opted for modest rules reform after pushback from moderates.",
    "The Hill: CDC study shows prior COVID-19 infection and vaccines protected against delta variant.",
    "We invite you to share The Hill’s reporting and newsletters, and encourage others to SUBSCRIBE!",
    "The president is waiting until March to deliver his first official State of the Union address.",
    "NBC News: Biden ends first year as president with “bleak, discouraging” marks from the public.",
    "The Hill: Biden says elections might not be legitimate if election reforms do not become law.",
    "Winners who submit correct answers will enjoy some richly deserved newsletter fame on Friday.",
    "Kyrsten Sinema (Ariz.) and Joe Manchin (W.Va.) — voted to uphold the legislative filibuster.",
    "?“Some people may call what’s happening now ‘the new normal,’\" he said in opening remarks.",
    "> In Hong Kong, when the government came to massacre pet hamsters, it was the last straw.",
    "INVITATION from The Hill: Join Virtually Live’s “Future of Cities Summit” today at 1 p.m.",
    "Russian President Vladimir Putin wants to test the United States and NATO, Biden added.",
    "An additional $30 million was also set aside for future claims (The Associated Press).",
    "> 2022 watch: Can Democrats make a political comeback ahead of the midterm elections?",
    "OPINION\nHow Biden can fix his presidency, by The Washington Post editorial board.",
    "“It’s clear to me that we’re going to have to probably break it up,” Biden said.",
    "Please recommend the Morning Report to friends and let us know what you think.",
    "Morning Report\nPresented by Facebook\nWelcome to The Hill’s Morning Report.",
    "He did not mention that Democrats have blocked his legislative ambitions.",
    "At that point, it would become a sterile, uninhabitable rock (NBC News).",
    "“What would be the Republican platform now?” Biden asked rhetorically.",
    "The Associated Press: What are U.S. military options to help Ukraine?",
    "Biden meets virtually with the prime minister on Friday (The Hill).",
    "Chief Justice John Roberts denies asking colleagues to wear masks.",
    "Politico: Why Schumer picked a filibuster fight he couldn’t win.",
    "He said he is open to a third summit with the Russian president.",
    "The New York Times: Biden predicts Russia will invade Ukraine.",
    "Readers can find us on Twitter @asimendinger and @alweaver22.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "“I call it a job not yet finished” (The Associated Press).",
    "U.S. cities are diverse, dynamic and constantly evolving.",
    "Email: asimendinger@thehill.com and aweaver@thehill.com.",
    "“Eliminating the filibuster would be the easy way out.",
    "The Hill: Five takeaways from Biden’s news conference.",
    "Alexis Simendinger and Al Weaver are the co-creators.",
    "The Hill: Biden said he didn’t overpromise voters.",
    "… My guess is he will move in,” he told reporters.",
    "Where Democrats go on voting rights is unclear.",
    "Committee Chairman Bennie Thompson (D-Miss.)",
    "“I am truly honored to receive this award.",
    "Pelosi speaks to the mayors at 4:25 p.m.",
    "“I think he will regret having done it.",
    "It wasn’t meant to be easy” (The Hill).",
    "My colleagues, history is watching us.",
    "My friends, that is simply not true.",
    "and Vice Chair Liz Cheney (R-Wyo.)",
    "White House transcript is HERE.",
    "The conference agenda is HERE.",
    "The new cookie is called ____?",
    "It’s not true,” Manchin said.",
    "The Arizona Republic: ??Sen.",
    "We want to hear from you!",
    "Two party members — Sens.",
    "CLICK HERE to subscribe!",
    "ET at Rising on YouTube.",
    "It is Thursday!",
    "ELSEWHERE\n?",
    "RSVP now.",
    "ET.",
    "?",
    "?",
    "?",
    "?"
  ]
}