{
  "id": 3911,
  "mediaId": 2619,
  "date": "2022-01-20",
  "headline": "Pelosi now says she’s open to banning stock trades by members of Congress",
  "image": "https://images.mktw.net/im-428782/social",
  "link": "https://www.marketwatch.com/story/pelosi-now-says-shes-open-to-banning-stock-trades-by-members-of-congress-11642736926?rss=1&siteid=rss",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Murphy",
  "authorUrl": "https://www.marketwatch.com/author/mike-murphy",
  "termIds": [
    0
  ],
  "sentences": [
    "Last month, it was revealed that her husband, Paul Pelosi, stood to substantially gain from the purchase of call options on a number of major companies, including Google parent Alphabet Inc. GOOGL, -2.67% GOOG, -2.58% and the Walt Disney Co. DIS, -2.84%, if their share prices continue to rise.",
    "Mark Kelly of Arizona and Jon Ossoff of Georgia introduced legislation that would ban members of Congress, their spouses and dependent children from trading individual stocks while in office, and would require putting their holdings into blind trusts.",
    "While critics have decried potential conflicts of interest if lawmakers use inside knowledge to profit from stock trades, Pelosi argued in December that “We are a free-market economy.",
    "So when people talk about well, somebody might do this and somebody, I trust our members,” Pelosi told reporters at her weekly press conference on Capitol Hill.",
    "In a reversal from previous comments, House Speaker Nancy Pelosi said Thursday she was open to banning stock trades by members of Congress.",
    "But if members want to do that, I’m OK with that.”\nThe California Democrat has defended the ability of lawmakers to freely trade stocks.",
    "“To give a blanket attitude of we can’t do this and we can’t do that because we can’t be trusted, I just don’t buy into that.",
    "They should be able to participate in that.”\nLast week, Democratic Sens.",
    "“I have great confidence in the integrity of my members.",
    "Her change of heart appeared grudging, though.",
    "They are remarkable."
  ]
}