{
  "id": 3931,
  "mediaId": 2660,
  "date": "2022-01-26",
  "headline": "The Biden-Harris administration \"wants to hand out $450,000 to illegal immigrants.\"",
  "image": "https://static.politifact.com/politifact/rulings/meter-false.jpg",
  "link": "https://www.politifact.com/factchecks/2022/jan/26/jim-lamon/gop-ariz-senate-hopeful-lamon-falsely-claims-biden/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    0
  ],
  "sentences": [
    "GOP Ariz. Senate hopeful Lamon falsely claims that Biden wants to give ‘illegal immigrants’ $450,000\nIt was reported in October that the Biden administration was in talks to potentially offer settlements of up to $450,000 to resolve lawsuits filed on behalf of parents and children who were separated at the border during the Trump administration.",
    "It was reported in October that the Biden administration was in talks to potentially offer settlements of up to $450,000 a person to resolve lawsuits filed on behalf of parents and children who were separated at the border under the Trump administration’s immigration enforcement policy.",
    "\"Many of the lawsuits describe lasting mental-health problems for the children from the trauma of the months without their parents in harsh conditions, including anxiety, a fear of strangers and nightmares,\" the Wall Street Journal reported.",
    "Asked about the potential $450,000 payments a few days later, Biden said: “That’s not going to happen.”\nThe following day, a White House spokesperson said Biden was reacting to the dollar amount reported, but supported settlement talks.",
    "The next day, White House principal deputy press secretary Karine Jean-Pierre told reporters that Biden had reacted to \"the dollar figure,\" but that he was \"perfectly comfortable\" with the Justice Department trying to settle the cases.",
    "Federal authorities have since struggled to reunite all the families who were separated because of poor recordkeeping when the policy was in place, and trouble locating parents who had been deported.",
    "The claim relates to the aftermath of a Trump administration policy that led to thousands of children, including infants, being separated from their parents upon their arrival at the southern border.",
    "Businessman Jim Lamon is seeking to win a GOP Senate primary in Arizona, defeat Democratic incumbent Sen. Mark Kelly and possibly help Republicans retake control of the Senate.",
    "The political newcomer is running one ad that says Kelly \"supports an open border\" and another that says Kelly \"admits there is no plan to address (the) border crisis.\"",
    "The policy was a key component of the Trump administration’s crackdown on illegal immigration, aimed at deterring people from coming to the U.S. without permission.",
    "A reply referred to a fact-check we did on a claim about Biden and the talks that was made in October — before Biden’s remark and before the settlement talks ended.",
    "In late October, news reports said the Biden administration was in talks to settle lawsuits filed on behalf of parents and children who were separated.",
    "Featured Fact-check\nBiden denounced the policy as a \"moral and national shame\" and set up a task force to coordinate reunification of families.",
    "Lamon gained attention earlier this month with another ad that attacked Biden with a phrase that has become a proxy for an anti-Biden epithet.",
    "A Lamon ad that’s running on Facebook and Instagram shows an image that resembles a bank check and bears the Biden-Harris 2020 campaign logo.",
    "The ad, which started running Jan. 11 and was still active as of Jan. 26, links to a page that solicits donations to Lamon’s campaign.",
    "She said the department \"made clear to the plaintiffs that the reported figures are higher than anywhere that a settlement can land.\"",
    "We found no evidence to support the claim that the Biden administration wants to hand out $450,000 to any group of immigrants.",
    "Yahoo said it refused to run the ad because the phrase is \"overly inflammatory and offensive,\" according to news reports.",
    "Amid a public outcry, Trump in June 2018 issued an executive order to keep children and parents together in detention.",
    "On Nov. 3, a few days after the news reports, Biden was asked by a reporter about the prospect of $450,000 payments.",
    "But it also affected families who were seeking asylum due to persecution or security fears in their home countries.",
    "Perhaps the most explosive claim, however, attacks President Joe Biden and Vice President Kamala Harris.",
    "When asked a few days later about the $450,000 figure, Biden said, \"That’s not going to happen.\"",
    "Lamon said the Biden-Harris administration \"wants to hand out $450,000 to illegal immigrants.\"",
    "On Dec. 16, news reports said the Justice Department had pulled out of the settlement talks.",
    "Text around the check says: \"Do you support giving illegal immigrants $450,000 checks?\"",
    "We emailed Lamon’s campaign asking for information to back up the statement in his ad.",
    "The settlement offers being discussed were up to $450,000 a person, the reports said.",
    "But the claim is inaccurate, and the basis for it is several weeks out of date.",
    "Together, they give the impression that this was something Biden wants to do.",
    "The families included people who were legally seeking asylum in the U.S.",
    "In those cases, they were following the protocols for seeking asylum.",
    "The purported check is written to \"Illegal Immigrants\" for $450,000.",
    "?seemingly expressed disagreement with the $450,000 figure.\"",
    "But even that fact-check cited reporting that Biden had \"?",
    "One path he sees is through immigration rhetoric.",
    "\"That’s not going to happen,\" Biden replied.",
    "By Dec. 16, settlement talks ended.",
    "We rate the statement False.",
    "Those broke down Dec. 16."
  ]
}