{
  "id": 3948,
  "mediaId": 8347,
  "date": "2022-01-25",
  "headline": "Senator Kelly responds to House version of semiconductor bill",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/1c8b2b1/2147483647/strip/true/crop/1749x918+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F17%2F7e%2Fda3c194a468ea112f0e0e0e96a57%2Fmark-kelly-ad.JPG",
  "link": "https://www.kgun9.com/news/state/senator-kelly-responds-to-house-version-of-semiconductor-bill",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Corey Salmon",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Arizona is already a leader in microchip manufacturing and I’ll keep working to get this over the finish line to bring more manufacturing and high-paying jobs to our state.”\nSen. Kelly helped author this bill before it passed in the Senate last June.",
    "Sen. Kelly’s plan includes the following investments which are key to boosting Arizona’s position as a leader in semiconductor manufacturing:\n$39 billion in grant incentives for construction or expansion of microchip fabrication plants.",
    "Sen. Kelly released a statement Tuesday, it read:\n“This is a critical step forward for our bipartisan plan to boost microchip manufacturing and address the supply chain challenges raising costs for Arizonans.\"",
    "Arizona is home to one of the largest microchip industries in the country, with nearly 30,000 jobs, and is poised to grow with investment plans from Intel and the Taiwan Semiconductor Manufacturing Company.",
    "\"In the seven months since the Senate passed this plan, the microchip shortage has only gotten worse, which is why I’ve been working to get this through the House.",
    "$2 billion to support the needs of the Department of Defense through research, testing, and workforce development in coordination with industry and universities.",
    "The house's legislation includes a $52 billion plan, which will increase domestic investments in microchip production and research.",
    "TUCSON, Ariz. (KGUN) — Arizona Senator Mark Kelly talked about a possible infrastructure boom for the state of Arizona Tuesday.",
    "Senator Kelly is addressing legislation that passed the U.S. Senate last June to boost and fund semiconductor production.",
    "Now, it is one step closer to becoming law if the House passes its version and Senators approve.",
    "The House of Representatives has now released its version of the bill.",
    "----\nSTAY IN TOUCH WITH US ANYTIME, ANYWHERE",
    "$10.5 billion for research and development."
  ]
}