{
  "id": 3993,
  "mediaId": 2752,
  "date": "2022-01-20",
  "headline": "12 Amazingly Self-Aware Clickbait Headlines That Always Work! Tabs, Thurs., Jan. 20, 2022",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yODg2NTk4OC9vcmlnaW4uZ2lmIiwiZXhwaXJlc19hdCI6MTcxMzQzNzUyNH0.cKj8uG-owTywKx3hGjerG5ZC0-HTtDca2vd85-Cr5Fk/img.gif?width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.wonkette.com/tabs-thurs-jan-20-2022",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Doktor Zoom",
  "authorUrl": "https://www.wonkette.com/u/doktor_zoom",
  "termIds": [
    0
  ],
  "sentences": [
    "[Texas Tribune]\nAfter some complaints that she was too dang radical to be delivering a speech in Chicago on Martin Luther King Day, journalist and \"1619 Project\" founder Nikole Hannah-Jones went ahead and delivered a very radical-sounding speech that included lines like\nIt was in the year 1619 that the first Black slave was brought to the shores of this nation.",
    "[...]\nWhite Americans must recognize that justice for black people cannot be achieved without radical changes in the structure of our society...The evils of capitalism are as real as the evils of militarism and racism\nThe problems of racial injustice and economic injustice cannot be solved without a radical redistribution of political and economic power.",
    "[Book Club Chicago]\nThe CIA has issued an interim report concluding that \"Havana Syndrome\" — a collection of weird symptoms that has affected US officials at embassies and other US offices around the world — probably does not represent \"a sustained worldwide campaign\" by Russia or any other foreign enemy.",
    "[Stars and Stripes]\nSince Sen. Mark Kelly was in the news yesterday for announcing he would vote to modify the filibuster (for all the good it did), here's essential video of that time he somehow smuggled a gorilla suit onto the International Space Station, and high jinks ensued.",
    "[CNBC]\nThe Supreme Court didn't buy Donald Trump's attempt to prevent the Select Committee on January 6 from getting his White House records related to the insurrection, and documents from the National Archives have already started to be delivered to the committee.",
    "Then halfway through the speech, she revealed, to those not already smiling in recognition, that everything in the first part of the speech had been the words of King himself, albeit with \"Black\" substituted for \"Negro\" to not give away the game too early.",
    "[Texas Tribune]\nThe US Navy is generously offering a fast track to a discharge for sailors who refuse to get vaccinated against the coronavirus, saying the service's goal is to \"maximize speed and equity in achieving a fully vaccinated force.\"",
    "The FBI won't say what it was up to, other than \"conducting court-authorized law enforcement activity,\" and Cuellar's office says he will cooperate with any investigation, whatever it turns out to be.",
    "As expected, all 50 Republicans in the Senate, plus Democrats Joe Manchin and Kyrsten Sinema, voted against modifying the filibuster to pass the Freedom to Vote/John Lewis Voting Rights bill.",
    "[AP]\nFBI agents showed up to do FBI things at the Laredo, Texas, home of Rep. Henry Cuellar, a conservative Democrat who has often differed with the Biden administration on border policy.",
    "They were brought here from the soils of Africa and unlike the Pilgrim fathers who landed here at Plymouth a year later, they were brought here against their will.",
    "Get ready for some antivaxxer to proclaim it was all side effects of the COVID vaccines, even though the problems were first noticed some five years ago.",
    "Maybe that's why he's so fascinated by the bathroom sink; if the water's running, he'll get his forepaws down in there and drink from it.",
    "A pipeline company is threatening to cut off natural gas supplies to five power plants run by Texas's largest electric power generator?",
    "[AP]\nUS and European diplomats are doing diplomacy things to figure out how to respond to the threat of Russia invading Ukraine.",
    "If you can, please give $5 or $10 a month to support the finest in hastily tossed-together news!",
    "Hey kids, what has two thumbs and forgot he was on Tabs duty until the very last minute?",
    "So let's get right to this abbreviated but still very informative news roundup!",
    "Nearly a year since last year's deadly winter storm and power outages?",
    "Have they tried pointing out to Putin that Friendship is Magic?",
    "Guess that means vaccine refusers won't be in their bunks.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "Probably some two-thumbed Tabs forgetter, that's who!",
    "Yr Wonkette is funded entirely by reader donations.",
    "He appears to have morphed into a sea otter.",
    "[CNN]\nOK, now here is your Thornton photo!",
    "(Yes, his water bowl is always full.)",
    "More excerpts in this Twitter thread.",
    "How often would you like to donate?",
    "Possibly the highest jinks ever.",
    "Thank heaven for capitalism.",
    "Sounds not good!",
    "Little weirdo.",
    "What's this?",
    "Mysterious!",
    "Bravo!",
    "Huh!"
  ]
}