{
  "id": 4109,
  "mediaId": 2830,
  "date": "2022-01-26",
  "headline": "Biden’s Berlin Gas Airlift",
  "image": "",
  "link": "https://www.wsj.com/articles/bidens-berlin-gas-airlift-russia-ukraine-vladimir-putin-europe-green-energy-11643237127",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    0
  ],
  "sentences": [
    "WSJ Opinion: America’s Epidemic of Mindless Criminal and Political BehaviorPlay video: WSJ Opinion: America’s Epidemic of Mindless Criminal and Political Behavior\n Wonder Land: With political protests, crime and personal choices hovering at the edge of madness, perhaps it's time to revisit the 'Broken Windows' policing approach pioneered in the 1990s.",
    "As former NATO Secretary General Anders Fogh Rasmussen said in 2014, Russia “engages actively” with green groups “working against shale gas, obviously to maintain European dependence on imported Russian gas.”\nGermany has made itself even more dependent on Russian gas by shutting down nuclear plants, which provide low-cost baseload power.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nThe World Braces For Putin's Next Move\nAs world leaders try to devise a strategy to counter a possible invasion of Ukraine by Russia, Secretary of State Antony Blinken promises \"massive consequences\" for any acts of aggression by Vladimir Putin.",
    "Plus, how much is the military buildup on the Ukraine border contributing to falling stock prices?Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nMr. Putin has helped fuel the green opposition.",
    "Europe’s climate obsessions have made it vulnerable to Russia, and so the Biden Administration is riding to the rescue by begging the Arabs and other energy producers to boost natural gas deliveries.",
    "Photo: MAXIM SHEMETOV/REUTERS\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (5 minutes)\nAD\nLoading advertisement...\n00:00 / 04:56\n1x\nThis article is in your queue.",
    "Europe’s gas reserves are smaller than Russia’s, though it has about as much technically recoverable shale gas as the U.S., according to the Energy Information Administration.",
    "The Trump Administration pressed Germany to build liquefied natural gas (LNG) import terminals to diversify its gas supply, as Poland, the Netherlands and Lithuania have done.",
    "While rising gas prices send a market signal for power retailers to use more coal, Europe’s cap-and-trade program discourages this switch even when gas prices are surging.",
    "Doesn’t President Biden understand that inflation and high energy prices empower the very dictators he claims we are fighting in a long, twilight struggle?",
    "Open Queue\nEnergy is Russia’s most potent nonnuclear weapon, so it’s no surprise that Vladimir Putin is leveraging it as he threatens Ukraine.",
    "WSJ Opinion: America’s Epidemic of Mindless Criminal and Political Behavior\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "All of this explains why the Biden Administration is now scrambling to locate spare gas to rescue Europe from Mr. Putin’s tender mercies.",
    "Even as President Biden races to rescue Europe, his Build Back Better plan would send the U.S. down the same road of energy disarmament.",
    "At the same time, the White House is making the U.S. more dependent on China for the minerals needed to advance its green energy agenda.",
    "Even as Russia reduced gas deliveries, Germany in December shut down three nuclear plants, and three more will be mothballed this year.",
    "On Wednesday, the Administration canceled Twin Metals Minnesota’s rights to mine copper, nickel and cobalt in northeast Minnesota.",
    "White House officials say Russia and Europe are interdependent since the Kremlin relies on oil and gas revenue to fund its budget.",
    "More U.S. LNG export capacity is expected to come online later this year, which will make America the world’s top LNG exporter.",
    "A Russian gas embargo could starve households of heating fuel this winter and potentially next if there’s a hot war in Ukraine.",
    "Images: AP/Reuters/Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Even as Europe becomes more dependent on Russia for gas, Russia is becoming less dependent on Europe for revenue.",
    "Other major LNG producers such as Qatar and Australia may be able to boost supply to Europe at the margins.",
    "It’s hard not to wonder how European leaders didn’t see this coming in 2014 when Mr. Putin invaded Crimea.",
    "Kremlin officials are threatening to cut off supply if the U.S. and Europe impose sanctions in response.",
    "Gas wells at Bovanenkovo gas field owned by Gazprom on the Arctic Yamal peninsula, Russia, May 21, 2019.",
    "Germany is especially dependent on Russian gas, which is why it has been reluctant to help arm Ukraine.",
    "Russia typically supplies about 40% of Europe’s gas imports, but it has sharply truncated deliveries.",
    "You have to go back to the disarmament of the 1920s to recall a time of such willful self-delusion.",
    "But will strong sanctions be enough, or will they just provoke the Russian president even more?",
    "The self-created energy vulnerability of the West is one of the horrifying marvels of the age.",
    "But Europe could still be staring into a long, dark winter if Russia imposes a gas blockade.",
    "Manufacturers could be forced to shut down, further damaging the economy and supply chains.",
    "At this perilous moment, it’s worth recounting how Europe got itself into this cold mess.",
    "U.S. LNG exports are nearly maxed out, and many cargo ships are already headed to Europe.",
    "0:00 / 4:00\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Across most of Europe, coal plant shutdowns have also left Europe more dependent on gas.",
    "One company last year decided to turn an LNG project into a green hydrogen hub.",
    "As wind production lagged last summer and fall, gas demand and prices soared.",
    "So have heavily subsidized solar and wind, which must be backed up by gas.",
    "Yet European governments won’t let this strategic asset be developed.",
    "As a result, Europe entered the winter with little gas in storage.",
    "***\nStart with government bans on hydraulic shale fracturing.",
    "Green groups are pushing to scotch lithium mining in Nevada.",
    "One predictable result will be shortages and higher prices.",
    "But German LNG terminals are snarled in permitting delays.",
    "But Russia has other energy clients, including China.",
    "Russia exploited this by slowing gas deliveries.",
    "Gazprom is building gas pipelines to China.",
    "Your browser does not support HTML5 video.",
    "This is the definition of self-sabotage.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Gas might have to be rationed.",
    "This won’t heat homes."
  ]
}