{
  "id": 416,
  "mediaId": 8475,
  "date": "2022-02-23",
  "headline": "Members of Congress from both parties urge tough sanctions on Russia",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/022322_capitol_sanctions.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/nationworld/report/022322_congress_russia_sanctions/members-congress-from-both-parties-urge-tough-sanctions-russia/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Shutt",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110076",
  "termIds": [
    0
  ],
  "sentences": [
    "“We must hold Putin accountable for his aggression and stand with the Ukrainian people’s desire for an independent and democratic nation.”\nArizona Democratic Sen. Mark Kelly called for “significant sanctions against Putin, his backers, and the Russian government for this incursion.”\nKelly, a member of the Armed Services Committee, said he “will continue to support providing Ukraine with weapons and equipment to defend themselves against further Russian invasion, and will continue working with my colleagues and this administration to defend Ukrainian sovereignty.”\nGOP criticizes Biden\nBut some Republicans attacked Biden for showing “weakness.”\nWisconsin Republican Sen. Ron Johnson, the ranking Republican on the Senate Foreign Relations subcommittee on Europe, said in a news release that Biden’s moves to cancel the Keystone XL pipeline, withdraw from Afghanistan and to increase government spending showed weakness to the rest of the world.",
    "New Jersey Democratic Sen. Bob Menendez, chairman of the Senate Foreign Relations Committee, said Russian President Vladimir Putin declaring Donetsk and Luhansk People’s Republics independent was “an act of unprovoked aggression and a brazen violation of international law.”\n“Despite repeated efforts to open the door to diplomacy, Vladimir Putin has chosen the path of conflict,” Menendez said, while calling for the U.S. and European countries to impose “crushing sanctions.”\nThe panel’s ranking Republican, Jim Risch of Idaho, said in a statement Russia’s actions “are tantamount to an invasion.”\n“The U.S. and our allies must immediately implement harsh sanctions that Putin cannot ignore,” he said.",
    "The chair of the House Foreign Affairs subcommittee on Europe, Energy, the Environment, and Cyber, Democrat Bill Keating of Massachusetts, and the ranking member, Fitzpatrick, issued a joint statement condemning Putin for invading Ukraine and calling on Congress to “work to punish these actions and make any further escalation extremely painful to the Kremlin.”\n“At this moment, we stand in support of swift, severe, and damaging sanctions on all those involved in (the) destructive decision to further invade Ukraine in an attempt to solidify Russia’s illegal occupation of the Donbass,” they wrote.",
    "South Carolina Sen. Lindsey Graham, the top Republican on the State-Foreign Operations Appropriations subcommittee, said he’s working with Democratic senators to put together an emergency spending bill that would allow the Defense, Justice, State and Treasury departments to “go after the oligarchs who enrich themselves from Putin’s misadventures.”\n“It’s now time for that crowd to lose their yachts, lose their luxury apartments, and to pay a price for being part of a thuggish group — a nation-state that really is a mafia-state,” Graham said.",
    "U.S. Sen. Jeanne Shaheen, a New Hampshire Democrat who leads the Senate Foreign Relations subcommittee on Europe, said Putin’s incursion into the separatist regions was an “illegal annexation.”\nThe move “must be met with fierce condemnation from the global community and a response that sends the message, without equivocation, that NATO, the West and democracies around the world will not sit by while Putin wages war on Ukraine,” Shaheen said.",
    "“It’s time to freeze their assets.”\nCo-chairs of the Congressional Ukraine Caucus — Pennsylvania Republican Brian Fitzpatrick, Maryland Republican Andy Harris, Ohio Democrat Marcy Kaptur and Illinois Democrat Mike Quigley — called for increasing military and economic support for Ukraine as well as imposing “robust” sanctions against Russian oligarchs.",
    "Sen. Mark Kelly called for ‘significant sanctions against Putin, his backers, and the Russian government’\nBoth Democrats and Republicans in Congress on Tuesday called on President Joe Biden to impose severe sanctions on Russia after the country declared a broad section of eastern Ukraine independent before sending troops into the region.",
    "“Sadly, President Biden consistently chose appeasement, and his tough talk on Russia was never followed by strong action.”\n“This is just another failed line in the sand on President Biden’s part,” tweeted Rep. Mark Green, a Tennessee Republican who is the ranking member of the House Foreign Affairs panel on Europe.",
    "“The administration should utilize the tools at its disposal and levy severe sanctions today.”\nShaheen issued her statement from Poland, where she traveled following an international security conference in Germany, to discuss the role NATO members should play in the conflict.",
    "“By strengthening Ukraine’s position, demonstrating a unified global coalition, and forcing Putin to grasp the consequences Russia will suffer — the world may avert the breakout of war the likes of which it has not seen in nearly a century.”\nSen.",
    "Speaking from the East Room of the White House, Biden said he believes “Russia is poised to go much further and launch a massive military attack against Ukraine.” If that happens, the administration will impose more sanctions on Russia, he said.",
    "In other tweets, Green said Biden should use sanctions to “cripple the heart of Russia’s economy.”\n“Joe Biden sure knows how to project weakness at a time that demands strength,” North Carolina Republican Virginia Foxx tweeted.",
    "Colorado Democratic Sen. Michael Bennet, who sits on the Senate Select Committee on Intelligence, said that the president should coordinate with allied countries immediately, as well as continue to place sanctions on Russia.",
    "Biden on Monday issued sanctions on new investment, trade and finance in the Donetsk People’s Republic and the Luhansk People’s Republic — the two separatist regions Putin declared independent earlier in the day.",
    "Rep. Brendan Boyle, a Pennsylvania Democrat who represents a large population of Ukrainian-Americans in his district, is leading an emergency meeting of the NATO Parliamentary Assembly in Brussels.",
    "Members of Congress appear unified, for the moment, that the most the United States should do is restrict Russia’s economy, not send U.S. soldiers to face Russian troops in the streets of Ukraine.",
    "Rob Portman, an Ohio Republican who co-chairs the Senate Ukraine Caucus, said the U.S. did not go far enough when Russia invaded Crimea eight years ago, and urged Biden to take stronger action.",
    "Biden also said that he had authorized moving U.S. forces and equipment already in Europe to Estonia, Latvia and Lithuania — all of which are members of the North Atlantic Treaty Organization.",
    "“They are taking advantage of the Biden administration’s weakness.”\nA handful of House Republicans — led by Leader Kevin McCarthy — criticized Biden for not doing more to punish Putin.",
    "“I encourage the Biden administration to impose devastating sanctions now as a means to deter further Russian military operations against our ally Ukraine,” he said.",
    "“Ukraine’s security and its ability to exercise self-determination cannot be contingent upon Russian assent — they must be guaranteed,” they said in a statement.",
    "Biden announced additional sanctions against Russia on Tuesday after that country’s legislature gave Putin authority to send military forces outside the country.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "Emergency meeting\nWith Congress on recess, some lawmakers who are leaders on foreign affairs are in Europe and issued statements from there.",
    "“Vladimir Putin’s decision to launch a renewed invasion of Ukraine is reprehensible,” McCarthy tweeted shortly after Biden’s remarks.",
    "“The West must enact severe sanctions on the Russian regime, including on Putin and the oligarchs personally,” he wrote on Twitter.",
    "Leaders also began discussing emergency supplemental funding that would allow the U.S. to financially penalize Russian oligarchs.",
    "Risch’s statement also included an appeal to pass a bill imposing sanctions on Russia and providing more assistance to Ukraine.",
    "Those sanctions will hit two Russian financial institutions, Russian sovereign debt and Russian elites and their families.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "“Putin’s egregious rejection of Ukrainian sovereignty violates international law,” he said in a statement.",
    "“All these actions have weakened America, and our enemies have noticed,” he said.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson!",
    "Donate to TucsonSentinel.com today!",
    "- 30 -"
  ]
}