{
  "id": 4169,
  "mediaId": 2658,
  "date": "2022-01-18",
  "headline": "Manchin: Primary me if you want, I won't go 'nuclear'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1155968404/1b616016-08bc-4e56-8269-2d3e4beb1a70/c61d08ea-e510-49bc-9690-ef2653489b90/1280x720/match/image.jpg",
  "link": "https://www.politico.com/news/2022/01/18/senate-dems-filibuster-showdown-election-reform-527308",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "By Burgess Everett and Marianne LeVine\n 01/18/2022 03:11 PM EST\nUpdated: 01/18/2022 07:26 PM EST\nJoe Manchin made clear that his party’s push to isolate him and fellow centrist Kyrsten Sinema won’t force his hand on rules changes, once again rejecting Democrats’ proposed reforms to the Senate’s filibuster rules.",
    "Though all 50 Senate Democrats support the voting and elections bill before the Senate, the Democratic caucus is pressing forward with laying blame on Manchin and Sinema (D-Ariz.) for the party’s failure to advance sweeping elections reform, thanks to their resistance to weakening the filibuster.",
    "Schumer made clear again on Tuesday that the election reform vote and the associated vote to change Senate rules along party lines with a simple majority vote — a maneuver known as the “nuclear option” — would go forward, regardless of its nearly guaranteed failure in the evenly divided Senate.",
    "Schumer confirmed to reporters after the meeting that he would propose a talking filibuster only covering the package of bills currently in front of the Senate and dismissed Manchin and Sinema’s positions as out of step with the rest of the caucus.",
    "Sen. Tim Kaine (D-Va.), who has been speaking to Manchin on rules changes, said Democrats have tried to come up with a proposal that’s consistent with his and Sinema’s positions and that they aren’t worried the vote will alienate the two centrists.",
    "They can only answer that themselves.”\nSeveral other Democrats haven’t made a final decision on rules changes; one of them, Sen. Mark Kelly (D-Ariz.), participated virtually in Tuesday’s caucus discussion due to business in his home state.",
    "He told reporters ahead of a Democratic Caucus meeting he would not go along with instituting a talking filibuster, which could be used to evade the Senate’s 60-vote threshold, nor would he entertain a rules change by a simple majority.",
    "This week’s debate comes after Schumer vowed last year that “failure is not an option.” The voting legislation that will fall short was crafted in response to a flurry of GOP-backed state-level bills designed to restrict ballot access.",
    "The move carries considerable risk, given that Sinema and Manchin will be essential to any further success the party can muster this year — particularly on any resuscitation of President Joe Biden’s economic agenda.",
    "The Senate Democratic caucus huddled on Tuesday evening to discuss the coming confrontation over changing chamber rules to help shore up the Voting Rights Act and enact federal election standards.",
    "Under the talking filibuster proposed by Schumer, the voting and elections package would only require a simple majority to advance toward final passage, preceded by a lengthy debate.",
    "The time is nigh for a decision.”\nLast week both Manchin and Sinema emphatically rejected weakening the filibuster, even as Biden came to the Senate to try and marshal their support.",
    "The lost opportunity with Manchin is acute: He negotiated the voting reform package currently on the Senate floor after rejecting Democrats’ initial elections reform bill last year.",
    "Proponents of the bill bet that Manchin and Sinema would relent on the filibuster if it were proven that the election and voting legislation could garner no GOP support.",
    "“I was not a negotiator of the infrastructure bill — I was so happy they were, and I praised them for it, and I voted for it, and it’s going to be great,” Kaine said.",
    "The overwhelming majority of our caucus knows that if you’re going to try to rely on Republican votes, you will get zero progress on voting rights,” Schumer said.",
    "No further bills would get the same treatment; the Senate took up the election reform bill Tuesday and is expected to begin the rules debate on Wednesday.",
    "As a result, rank-and-file Democrats are grinding into the breach for what will potentially be their most high-profile failure of this Congress so far.",
    "That’s it.”\nThe damage that does to the rest of the party’s priorities, chiefly the moribund $1.7 trillion party-line social spending bill, is unclear.",
    "Asked later if Sinema and Manchin had a duty as Democrats to support the rules change, he replied: “I don’t know where their loyalties start and end.",
    "Sinema publicly upended the president’s push ahead of his meeting with Democrats, while Manchin reiterated his opposition shortly after the meeting.",
    "Manchin said he doesn’t “take anything personally” as Senate Majority Leader Chuck Schumer presses forward with a vote on weakening the filibuster.",
    "During the meeting, Manchin “expressed disagreement” with the justification his party is using to change Senate rules, according to one attendee.",
    "He added that he’d welcome a primary challenge over his filibuster position if he runs again for reelection: “I’ve been primaried my entire life.",
    "Majority Leader Chuck Schumer made clear again on Tuesday that the election reform vote and the associated filibuster reform would go forward.",
    "Schumer also would not say if he would support Manchin and Sinema in future Democratic primaries: “I’m not getting into the politics.",
    "He disagreed with Manchin’s criticism of Democrats’ priorities: “We’re not abandoning it; we will do other things as well.”",
    "That would not be anything new for me.”\n“The majority of my colleagues in the Democratic caucus have changed their minds.",
    "Asked about his party’s priorities, Manchin said people are most worried about inflation and coronavirus right now.",
    "This is a substantive, serious issue.” Sinema in particular could face a tough intra-party challenge in 2024.",
    "Manchin torpedoed the spending measure; while Sinema sounded supportive, she never explicitly endorsed it.",
    "Schumer said Democrats can handle multiple issues at once, but that voting rights is the party’s top goal.",
    "And even if you fail, that doesn’t mean you’re just going to give up,” said Sen. Mazie Hirono (D-Hawaii).",
    "Most in the caucus insist every Democrat must go on record at what they see as a historic moment.",
    "Kelly is up for reelection this year and has not publicly endorsed changing the filibuster.",
    "“There are battles worth fighting, and protecting freedom to vote is one of those battles.",
    "I think we’ve shown them proper respect,” Senate Majority Whip Dick Durbin (D-Ill.) said.",
    "But the two centrists have remained consistent in their position for more than a year.",
    "“This voting bill is as important or more to many of us than the infrastructure bill.",
    "“We need to take this vote to let the American people know where each of us stands.",
    "The West Virginia Democrat actually seems to welcome the isolation.",
    "Schumer has also vowed he will get the votes to pass that bill.",
    "“The vast majority of our caucus strongly disagree with Sens.",
    "I’ve never changed my mind on the filibuster,” Manchin said.",
    "Sinema also called in, while Manchin attended in person.",
    "“We’ve bowed in their direction for months.",
    "They have a right to change their minds.",
    "Manchin and Sinema on rules changes.",
    "I hope they respect that too.",
    "I respect that.",
    "I haven’t."
  ]
}