{
  "id": 4173,
  "mediaId": 2643,
  "date": "2022-01-25",
  "headline": "Arizona Senator Kelly's Future Is on the Line, Yet He's Against Censuring Kyrsten Sinema",
  "image": "",
  "link": "https://www.newsweek.com/arizona-senator-kellys-future-line-yet-hes-against-censuring-kyrsten-sinema-1672968",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aila Slisco",
  "authorUrl": "https://www.newsweek.com/authors/aila-slisco",
  "termIds": [
    0
  ],
  "sentences": [
    "The Republican nominee that will challenge Kelly's seat has yet to be determined but leading candidates include Arizona Attorney General Mark Brnovich and venture capitalist Blake Masters, who has painted himself as a loyalist to former President Donald Trump and has been endorsed by figures such as Fox News host Tucker Carlson.",
    "Arizona Democratic Party Chair Raquel Terán said in a statement that the party's executive board took \"no pleasure\" in voting to censure Sinema, while adding that the move was necessary because \"the ramifications of failing to pass federal legislation\" on voting rights were \"too large and far-reaching.\"",
    "\"While they came to different decisions on this vote, he looks forward to continuing to work with Senator Sinema on Arizona priorities, as they have done during his first year in the Senate to pass critical infrastructure investments that will create good-paying jobs.\"",
    "Kelly, a former astronaut and the husband of former Congresswoman Gabby Giffords, is facing what could be a difficult Republican challenge to retain the seat formerly held by the late John McCain in November's election.",
    "Senator Mark Kelly (D-Ariz.) has announced that he does not support the Arizona Democratic Party's censure of his colleague Senator Krysten Sinema despite facing a potentially challenging road to reelection this year.",
    "With Democrats holding a razor-thin advantage in an evenly divided Senate, retaining seats in battleground states like Arizona will be critical for the party's chances of not ceding the upper chamber to Republicans.",
    "Members of the party's executive board voted to censure Sinema on Saturday over her vote against altering Senate filibuster rules to allow for the passage of federal voting rights legislation last week.",
    "Potential challengers include Representative Ruben Gallego (D-Ariz.), who has been highly critical of Sinema in recent media appearances while refusing to rule out mounting a 2024 challenge.",
    "On Tuesday, Sarah Guggenheimer of the Kelly campaign told The Arizona Republic that Kelly does not support his party's censure and was looking forward to \"continuing to work\" with Sinema.",
    "\"The ADP Executive Board has decided to formally censure Senator Sinema as a result of her failure to do whatever it takes to ensure the health of our democracy,\" said Terán.",
    "Alongside Senator Joe Manchin (D-W.Va.), she has become increasingly viewed as a Democratic obstruction to passing the agenda of President Joe Biden.",
    "He defeated Republican Martha McSally in a 2020 special election for the right to serve out the final two years of a six-year term.",
    "Sinema, who is not up for reelection until 2024, was heavily criticized for her refusal to budge on the filibuster.",
    "Kelly has had an edge in early hypothetical polling, although no new polls have been released since September.",
    "It is not clear what effect, if any, his rebuke of Sinema's censure might have on his reelection chances.",
    "Sinema will likely face a Democratic primary challenge if she decides to seek a second term.",
    "Newsweek reached out to the Kelly campaign and the Arizona Democratic Party for comment.",
    "Kelly is so far not being challenged by any other Democrats in the primary.",
    "\"Senator Kelly does not support the censure,\" Guggenheimer said."
  ]
}