{
  "id": 4214,
  "mediaId": 8474,
  "date": "2022-01-20",
  "headline": "Pelosi makes about-face on insider trading in Congress",
  "image": "",
  "link": "https://www.tucsonpost.com/news/272216954/pelosi-makes-about-face-on-insider-trading-in-congress",
  "mediaOutlet": "tucsonpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Jon Osoff of Georgia and Mark Kelly of Arizona want to ban sitting members of Congress and their family members from stock trading, and would require them to either divest from the stock assets or put them in a blind trust while in office.",
    "She is the top Democrat on the list presented last week by the watchdog Unusual Whales, showing that the stock portfolios of many US lawmakers enjoy returns on investment well above those of the Standard & Poor's exchange-traded fund.",
    "Her words were widely reported as an about-face on the contentious issue of stock trading by members of Congress, which has recently come under intense scrutiny in no small part due to Pelosi's own financial success.",
    "A Twitter account named \"Nancy Pelosi's Portfolio Tracker\" put a spotlight onto the speaker's investments last fall and attracted over 200,000 followers before it was banned without explanation in early December.",
    "to do the right thing, on one condition\nPreviously openly opposed to banning stock trading by members of Congress, Speaker of the House Nancy Pelosi (D-California) appeared on Thursday to change her mind.",
    "A week later, asked about the ethics of lawmakers trading stocks their laws could affect, Pelosi argued the US is a \"free-market economy\" and members of Congress \"should be able to participate\" in it.",
    "Members of Congress are already required to disclose any financial transactions within 45 days by the 2012 Stop Trading on Congressional Knowledge (STOCK) Act.",
    "Pelosi's apparent change of heart on the subject came with a caveat, as she told reporters the Supreme Court should be included in any new restrictions.",
    "However, House Majority Leader Steny Hoyer (D-Maryland) said on Wednesday that lawmakers should have the same financial privileges as everyone else.",
    "Her apparent openness to a proposal floated by two Senate Democrats, however, was conditioned on demanding the same of US Supreme Court justices.",
    "It also bans them from using information they have as part of their job that is not available to the general public to turn a personal profit.",
    "So when people talk about well, somebody might do this and somebody, I trust our members,\" Pelosi, 81, told reporters on Capitol Hill.",
    "\"To give a blanket attitude of we can't do this and we can't do that because we can't be trusted, I just don't buy into that.",
    "Two recent polls show anywhere between anywhere between 67% and 76% of Americans would support such a ban.",
    "\"So, I say when we go forward with anything, let's take the Supreme Court with us to have disclosure.\"",
    "Financial disclosures show Pelosi does not own or trade stocks herself, but her husband Paul does.",
    "A recent Business Insider report alleged 54 lawmakers failed to comply with the disclosure rules.",
    "Pelosi's portfolio would be affected by the bill proposed by two Senate Democrats last week.",
    "\"If we're saying everybody should be living by the same standard then let - so be it.",
    "But I don't think that the court should be let off the hook,\" she said.",
    "But if members want to do that, I'm OK with that,\" she added.",
    "\"I have great confidence in the integrity of my members.",
    "House Speaker Nancy Pelosi says she ?trust her members?",
    "They are remarkable.",
    "That's OK with me.",
    "(RT.com)"
  ]
}