{
  "id": 4232,
  "mediaId": 2593,
  "date": "2022-01-24",
  "headline": "Following Biden's Lead, More Democrats Begin Spreading Fears 2022 Midterms Could Be 'Illegitimate'",
  "image": "https://ijr.com/wp-content/uploads/2022/01/GettyImages-1365684649.jpg",
  "link": "https://ijr.com/following-bidens-lead-democrats-spreading-fears-2022-midterms-could-be-illegitimate/",
  "mediaOutlet": "IJR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Warnock and Arizona Sen. Mark Kelly didn’t directly play into the stolen election narrative, although Warnock said “[o]ur democracy is in a 911 state of emergency” and Kelly griped about Arizona legislation that didn’t send voters mail-in ballots if they hadn’t voted in two consecutive elections, saying they were being “purged without giving any rationale.”\nMeanwhile, he could only find one Democratic senator who would go on record absolutely disavowing the president’s “illegitimate” election narrative: “I would not have used those terms,” said Maryland Sen. Ben Cardin.",
    "The floodgates were opened during Wednesday’s media briefing when a reporter asked Biden about the failure of the voting overhaul legislation: “If this isn’t passed, do you still believe the upcoming election will be fairly conducted and its results will be legitimate?”\n“Well, it all depends on whether or not we’re able to make the case to the American people that some of this is being set up to try to alter the outcome of the election,” Biden responded.",
    "They seem no longer to want to be the party of Lincoln, Eisenhower, Reagan, the Bushes.”\nThe only thing missing from this fatuous unpaid political advertisement was the clip at the beginning saying, “I’m Joe Biden, and I approve this message.”\nBut never mind, because he didn’t really approve that message — at least when it comes to the 2022 midterms, where his party is set to be shellacked and his administration’s performance isn’t helping.",
    "“But the senators are torn over how hard to push a stolen-election narrative ahead of the November election in which Republicans are expected to make big gains in Congress.”\nThe stolen-election rhetoric is based around what Bolton described as “the state-level machinations of Trump allies” and election integrity laws, something Connecticut Democratic Sen. Chris Murphy thinks could cost Georgia Democratic Sen. Raphael Warnock his seat.",
    "Psaki today: I talked to the Prez and he is not predicting that 2022 elections would be illegitimate\nBiden yesterday: “I think it could easily be illegitimate” pic.twitter.com/5NngT2iQAT\n— Daily Wire (@realDailyWire) January 20, 2022\nThe White House backtracked quickly, with press secretary Jen Psaki answering “yes” when asked whether Biden thought the 2022 elections would be legitimate, according to CBS News.",
    "In his speech commemorating the occasion, Biden called it an “armed insurrection … looking to deny the will of the people” while the “former president who had just rallied the mob to attack [was] sitting in the private dining room off the Oval Office in the White House, watching it all on television and doing nothing for hours as police were assaulted.”\nAnd what was the root cause of all of this?",
    "“What I worry about is when you have scenario like what happened in Michigan but the certification agent chooses to overrule the voters, that’s when you would move into a problematic area.”\nThe Michigan reference regards Biden’s win in the state being delayed because the Republican members of the Wayne County Board of Canvassers didn’t initially certify the results.",
    "According to a Saturday report by Alexander Bolton in The Hill, “Senate Democrats say they share President Biden’s concern that the results of the 2022 midterm elections may not be legitimate because of restrictive voting laws passed by GOP-controlled state legislatures and the empowerment of state-level officials allied with former President Trump.",
    "“Some of the most frightening aspects of some of the voter suppression laws are not only blocking access to the ballot box but then actually discounting the recording [of] the count of the vote.”\nIn addition to the two senators who were willing to go on record openly raising questions about the midterms’ legitimacy, Bolton found two who implied it.",
    "“But I do think voting rights is very important in regards to the integrity of our election process, and it’s an urgent issue.”\nAnother seemed to hedge on the probability of the election being “stolen,” although he added Biden’s language was unhelpful — without directly calling the president out.",
    "I think you’re going to see the people who they’re trying to keep from being able to show up, showing up and making the sacrifice that needs to make in order to change the law back to what it should be.”\nThat sounded a lot like a yes, so another reporter pressed him on it later on.",
    "And keep in mind, all this talk is in addition to House Majority Whip Rep. James Clyburn of South Carolina, who came out in an appearance on CNN last week and said he was “absolutely concerned about” the election results being illegitimate if the voting bills weren’t passed.",
    "One year after the Capitol incursion, we were reminded that the merest question about the legitimacy of the outcome of an election could set us down the primrose path to a violent coup carried out by shirtless men wearing face-paint and horns.",
    "In the days since the president’s remarks, several high-profile congressmen have cast doubt upon this November’s elections, throwing around shadowy theories about “Donald Trump and his allies” conspiring to rig the vote in the GOP’s favor.",
    "“I’m very worried the changes in these laws will ultimately result in a loser being declared a winner.”\nConnecticut’s other Democratic senator, Richard Blumenthal, cast doubt upon the certification process in close elections.",
    "“I mean, imagine if those attempts to say that the count was not legit — ‘You have to recount it, and we’re not going to count — we’re going to discard the following votes.’”\n“I’m not going to say it’s going to be legit.",
    "And while the White House scrambled to spin what the president said into something it wasn’t — insisting his words were taken out of context and the midterms would be legitimate — other Democrats didn’t get the message.",
    "“Well, I think if, in fact — no matter how hard they make it for minorities to vote, I think you’re going to see them willing to stand in line and — and defy the attempt to keep them from being able to vote.",
    "“While some courageous men and women in the Republican party are standing against it, trying to uphold the principle of that party, too many others are transforming that party into something else.",
    "What Heinrich leaves out is that this nightmare “scenario” couldn’t have changed anything because of state law — but it’s a scary what-if to throw in front of voters, so why not see if it sticks?",
    "During President Joe Biden’s disastrous media briefing marking one year in office last Wednesday, he said the 2022 midterm elections “easily could be illegitimate” if the bills weren’t passed.",
    "They don’t believe that Democrats can ever win legitimately, and they’re prepared to go to extraordinary measures to throw out a Democratic win,” Murphy continued.",
    "Joe Manchin of West Virginia and Kyrsten Sinema of Arizona refused to do away with the filibuster to pass the Democrats’ sweeping voting overhaul legislation.",
    "“If officials were to disregard the vote count, a legitimate vote count, I can see the argument that the result would be illegitimate,” Blumenthal said.",
    "It’s — the increase and the prospect of being illegitimate is in direct proportion to us not being able to get these reforms passed,” he added.",
    "However, some Democrats took this as license to go forth and say 2022 could easily be rigged if the voting rights legislation wasn’t passed.",
    "“I think many of these laws, especially those that end the bipartisan counting of votes, are intended to seat people who lost the election.",
    "If Herschel Walker wins in Georgia because all the Fulton County votes got thrown out, that’s not a legitimate election,” Murphy said.",
    "(Walker, a University of Georgia football legend endorsed by Trump, is the leading Republican candidate for the Georgia Senate seat.)",
    "His party, sensing they’re on a sinking ship, is apparently more than willing to follow the president onto this rhetorical lifeboat.",
    "Because of Donald Trump and the Republicans, Jan. 6, 2021, was the closest we had come to seeing the overthrow of our republic.",
    "“It’s all circumstantial, but I think at some point you got to listen to what Donald Trump and his allies are saying.",
    "That’s when things quickly move into the illegitimacy area,” Democratic Sen. Martin Heinrich of New Mexico said.",
    "(All poppycock, of course — something we’ve been pointing out whenever we can here at The Western Journal.",
    "“Remember how we thought not that many people were going to show up to vote in the middle of a pandemic?",
    "Trump had “done what no president in American history, the history of this country, has ever, ever done.",
    "“I don’t want to start calling into question elections ahead of time, that’s not productive whatsoever.",
    "Remember when politicians implying elections were “illegitimate” was an attack on our democracy?",
    "You know what that means: questioning elections, even if they haven’t happened yet — again!",
    "We saw that with the whole, ‘It’s all rigged,’ thing with President Trump,” he continued.",
    "“If you start having local or state certification agents start overruling actual votes.",
    "“I think it easily could be illegitimate,” the president said, circling back to 2020.",
    "He refused to accept the results of an election and the will of the American people.",
    "Submit a Correction\nWe are committed to truth and accuracy in all of our journalism.",
    "“And it’s one thing — look, maybe I’m just being too much of an optimist,” he added.",
    "We had the highest voter turnout in the history of the United States of America.",
    "Again, this was the kind of talk that was verboten as recently as Jan. 6.",
    "You can help us bring readers the truth about Jan. 6 by subscribing.)",
    "This article appeared originally on The Western Journal.",
    "Then, the following week, Democratic Sens.",
    "“We need to see what actually plays out.",
    "I remember it like it was yesterday.",
    "Or earlier this month, rather.",
    "Read our editorial standards."
  ]
}