{
  "id": 4243,
  "mediaId": 2632,
  "date": "2022-01-24",
  "headline": "Kevin McCarthy, Other GOP Leaders Discuss Plans to Campaign on Limiting Congress Members' Stock Trading",
  "image": "https://media.nbcbayarea.com/2022/01/107004021-16427011472022-01-20t171516z_1042999066_rc233s9hbffm_rtrmadp_0_usa-congress.jpeg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.nbcbayarea.com/news/business/money-report/kevin-mccarthy-other-gop-leaders-discuss-plans-to-campaign-on-limiting-stock-ownership-in-congress/2787862/",
  "mediaOutlet": "nbcbayarea.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Schwartz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Former Sen. Kelly Loeffler, R-Ga., and her husband, Jeff Sprecher, who heads the New York Stock Exchange, liquidated their individual stock share positions and related options after weeks of criticism of the couple for selling millions of dollars in stock amid the coronavirus pandemic.",
    "The push for more regulation on lawmakers' stock trades has become a bipartisan issue in Congress as critics point out that senators and representatives often have access to potentially market-moving information before the public does.",
    "House Speaker Nancy Pelosi, D-Calif., after first defending lawmakers' stock ownership and dismissing limits on trades, later said she would be open to supporting such legislation if her Democratic caucus members were in favor of it.",
    "House Republican leaders have privately discussed ways they can campaign during midterm congressional elections on the issue of limiting lawmakers' stock trading, an attempt to seize on one of the hot-button issues in Washington.",
    "If, as expected, they win back the House in the midterm elections this fall, Republicans would bring such legislation to the House floor at the start of the new Congress, said a person familiar with the matter.",
    "Recent polling by the conservative advocacy group the Convention of States Action found that nearly 75% of those polled believe that lawmakers and their spouses have an unfair advantage in the stock market.",
    "Jon Ossoff, of Georgia, and Mark Kelly, of Arizona, introduced the \"Ban Congressional Stock Trading Act,\" which would ban members of Congress from buying and selling stocks while they are in office.",
    "At a separate round of meetings that started Monday in Miami, GOP party leaders were aiming to discuss campaigning on the issue and potential legislation, people familiar with the matter said.",
    "House Minority Leader Kevin McCarthy, R-Calif., and other top GOP members of the House discussed the matter with donors last weekend in Miami, according to people briefed on the matter.",
    "The NRCC has already campaigned against Democratic lawmakers about their stock trades after reports alleged they did not properly disclose asset dealings and violated the STOCK Act.",
    "McCarthy recently told Punchbowl News that he's considering pushing ahead with new limits or an outright ban on lawmakers dealing assets if the GOP retakes the majority this year.",
    "Dianne Feinstein, D-Calif., and Jim Inhofe, R-Okla. Sen. Richard Burr, R-N.C., was under investigation by the Federal Bureau of Investigation, but authorities did not charge him.",
    "House Republican leaders have privately discussed ways they can campaign during the midterm congressional elections on the issue of limiting lawmakers' stock trading.",
    "The retreat with donors was meant for some of the top financiers of the National Republican Congressional Committee, which is the campaign arm for House Republicans.",
    "Paul Pelosi, the speaker's husband, purchased up to $3.5 million worth of call options in mega-cap stocks late last year, according to a financial disclosure report.",
    "Minority Leader Kevin McCarthy and other top GOP members discussed the matter with donors last weekend in Miami, according to people briefed on the matter.",
    "McCarthy and other leaders told donors that they would aim to pass legislation that would curtail lawmakers' ability to trade stocks, the people said.",
    "McCarthy and other leaders told donors that they would aim to pass legislation that would limit lawmakers' ability to trade stocks, the people said.",
    "That law requires Congress members and other federal officials to disclose trades in stocks, bonds and other securities within a 45-day period.",
    "Correction: The headline on this story has been updated to indicate that GOP leaders discussed limits on stock trading, not stock ownership.",
    "A person familiar with McCarthy's thinking said that he's considering new limits on stock trades but did not provide further details.",
    "Lawmakers from both parties came under scrutiny for transactions during the early stages of the coronavirus pandemic, including Sens.",
    "Business Insider recently reported that more than 50 members of Congress have failed to properly disclose their stock transactions.",
    "If passed it would require members of Congress and their families to put their stock portfolios into a blind trust.",
    "McCarthy is all but certain to became speaker of the House if Republicans win the chamber in the midterms.",
    "Reps. Abigail Spanberger, D-Va., and Chip Roy, R-Texas, are also working together on potential limits.",
    "Representatives for McCarthy and the NRCC did not respond to requests for comment.",
    "All House members from both parties are up for reelection in 2022.",
    "Sen. Josh Hawley, R-Mo., introduced a similar bill.",
    "Rep. Tom Emmer, R-Minn., is the chair of the NRCC.",
    "Democrats narrowly control the House.",
    "Democratic Sens."
  ]
}