{
  "id": 4293,
  "mediaId": 2605,
  "date": "2022-01-20",
  "headline": "Support grows for limiting Congress members’ ability to own stocks",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/82289b8/2147483647/strip/true/crop/1620x851+0+115/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2Ffb%2F3b7a2e694653a2400684e86cf368%2F120821-speaker-64-pelosi-la-thmb.jpg",
  "link": "https://www.latimes.com/politics/story/2022-01-20/ban-congress-from-owning-stock",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer HaberkornStaff Writer",
  "authorUrl": "https://www.latimes.com/people/jennifer-haberkorn",
  "termIds": [
    0
  ],
  "sentences": [
    "Having worked in investor relations before coming to Congress, Craig said, “I’m thinking to myself, my God, the information I just received, someone could — not that I’m accusing members of Congress of doing it — go out and short Boeing stock today and make a fortune.”\nThe issue has caught fire with members in office for less than five years.",
    "Lofgren said “the issue of some members’ noncompliance with these important reporting requirements merits a fresh review of the law, including its enforcement requirements and penalties for noncompliance.”\nMost of the proposals would prohibit lawmakers from trading individual stocks while in office.",
    "Pelosi does not personally own or trade stocks, but her husband, Paul Pelosi, is a frequent trader and, according to recent disclosures required under existing law, owns millions of dollars in individual stocks, including in high-profile companies such as Alphabet, Apple, Microsoft and Amazon.",
    "“Voters have a right to know that their elected officials are acting in the public interest and not their own personal financial interests,” said Kedric Payne, senior director of ethics at the Campaign Legal Center and former deputy chief counsel at the Office of Congressional Ethics.",
    "She said in a statement to The Times, “I believe this is an appropriate way for members of Congress to hold investments while serving.”\nFeinstein’s husband, Richard Blum, has substantial financial assets and is a frequent stock trader, according to her financial disclosures.",
    "“What is just stunning to me — with the access to information that we receive — is that we can trade individual stocks,” said Rep. Angie Craig (D-Minn.), whose plan would implement a House rule that would require lawmakers to sell their stocks before coming to Congress.",
    "The swell of interest comes in the wake of several high-profile instances in 2020 of lawmakers making profitable trades in the early days of the pandemic, suggesting they were profiting off information they gleaned through their elected office.",
    "“Just the appearance that members of Congress benefit financially from their positions really isn’t sustainable.”\nAlthough insider trading is already illegal, proponents of the bans say lawmakers have access to information the public does not.",
    "“What we aren’t going to do is to be lectured on this issue by someone who coddled the twice-impeached president … who had his own ethical issues related to disclosures,” Aguilar said, referring to McCarthy’s relationship with President Trump.",
    "Dozens of lawmakers have come out in support of competing but similar bills that would limit their ability to hold or trade stocks while in office, perhaps requiring them to put any stocks into a blind trust before being sworn in.",
    "Chief Justice John G. Roberts Jr. said last month that the courts need to do a better job enforcing conflict-of-interest laws that are supposed to prevent judges from deciding cases affecting companies in which they hold stock.",
    "At that time, House Minority Leader Kevin McCarthy (R-Bakersfield) told Punchbowl News that he is considering new limitations or an outright ban on members owning or trading stocks if Republicans take the majority next year.",
    "“No trading is done through joint accounts.”\nSen. Alex Padilla (D-Calif.) has mutual funds but no individual stock holdings and is supportive of efforts to restrict individual stock ownership, according to his spokesperson.",
    "In addition, last year, 54 lawmakers violated the existing disclosure requirements on stock transactions, according to Insider and other media reports, underscoring what critics call already lax regulations and penalties.",
    "The potential for conflict confronted Craig in 2019 when, as a member of a House aviation subcommittee, she was frequently briefed on when Boeing’s 737 Max airliner may be reapproved for flights after two deadly crashes.",
    "WASHINGTON —\nRecent allegations of lawmakers potentially benefiting from personal stock market trades has propelled new interest in reining in their ability to trade or own individual stocks while in office.",
    "Bills have also been introduced by Rep. Raja Krishnamoorthi (D-Ill.), who was first elected in 2016; Reps. Abigail Spanberger (D-Va.) and Chip Roy (R-Texas), both elected in 2018; Sen. Josh Hawley (R-Mo.",
    "Rep. Ro Khanna (D-Fremont) is a co-sponsor of Krishnamoorthi’s bill and, according to his spokesperson, would be in compliance with the legislation because he does not own any individual stocks himself.",
    "“Some type of reform has to take place because the current laws are not giving voters that right.”\nIt was nearly a decade ago when the issue of congressional stock trading last bubbled to the surface.",
    "Most of the support has been driven by lawmakers, Democratic and Republican, who were elected in the past five years, with longer-tenured lawmakers generally noncommittal or less supportive.",
    "Craig attributes the interest from newer lawmakers, particularly in her 2018 class, to the fact that many of them are political newcomers who reflect how their constituents see Washington.",
    "“There is such an erosion of trust in Congress, in Washington itself, that many of us feel like the only way to repair that is to reform the institutions themselves,” she said.",
    "In separate comments this week, Democratic Caucus Chairman Hakeem Jeffries (D-N.Y.), Vice Chairman Pete Aguilar (D-Redlands) and House Majority Leader Steny H. Hoyer (D-Md.)",
    "But the law provided only an X-ray image of the problem by showing how frequently many members traded, but didn’t cure the problem of conflicts of interest, Payne said.",
    "Pelosi on Thursday decried the lack of disclosure requirements at the Supreme Court and indicated that any new legislation covering lawmakers would include justices.",
    "Of the resistance, she added, “A lot of people have been around for a long time in Washington, and they prefer the institutions as they are.”\nThere are outliers.",
    "Given the political popularity of banning lawmakers from trading stocks, Jeffries and Aguilar refused to cede the ethical high ground to McCarthy’s proposal.",
    "After previously pushing back on the proposals, House Speaker Nancy Pelosi (D-San Francisco) opened the door to the idea of new prohibitions on Thursday.",
    "Although there are many members of Congress who do not own private stocks, there are several lawmakers — or spouses — who are prolific traders.",
    "There is some debate about whether ownership or trading prohibitions should extend to spouses and dependent children.",
    "“These are his wife’s assets prior to marriage and managed by an outside financial advisor,” the spokesperson said.",
    "In 2020, the Justice Department briefly investigated her for stock trades conducted in the pandemic’s early days.",
    "In response, the 2012 STOCK Act was passed to reinforce that insider trading is illegal for members of Congress.",
    "Pelosi tasked Rep. Zoe Lofgren (D-San Jose) with reviewing the existing law governing lawmakers’ stock holdings.",
    "Others would prohibit any ownership of stocks, with one plan allowing stocks to be placed in a blind trust.",
    "Sen. Dianne Feinstein (D-Calif.) placed her assets in a blind trust when she entered the Senate in 1992.",
    "But she rejected the idea that a ban is needed because lawmakers cannot be trusted to act ethically.",
    "The issue has drawn a range of support and opposition, but not along the usual party divide.",
    "“When we go forward with anything, let’s take the Supreme Court with us to have disclosure.”",
    "“Disclosure alone is not enough.”\nThe legislative branch is not the only one under scrutiny.",
    "Last month, she said lawmakers should be allowed to participate in the free market economy.",
    "Pelosi’s comments signaled how quickly the tide might be changing on the issue.",
    "took no position on the proposals, but indicated they’re open to discussions.",
    "It also required lawmakers to frequently disclose their stock trades.",
    "Jon Ossoff (D-Ga.) and Mark Kelly (D-Ariz.), both elected in 2020.",
    "Members would be allowed to keep mutual funds or Treasury bonds.",
    "Other Democratic leaders have been hesitant to take a position.",
    "Still, his wife’s accounts reported hundreds of trades in 2021.",
    "“I don’t think the court should be let off the hook,” she said.",
    "Now, he said, the cure is obvious: prohibitions on trading.",
    "“If members want to do that, I’m OK with that,” she said.",
    "“I just don’t buy into that,” she said.",
    "“We did a 10-year experiment,” he said.",
    "), elected in 2018; and Sens.",
    "She was cleared."
  ]
}