{
  "id": 4319,
  "mediaId": 2520,
  "date": "2022-01-21",
  "headline": "Sen. Kyrsten Sinema has a headache and it has a name: Rep. Ruben Gallego",
  "image": "https://www.gannett-cdn.com/presto/2022/01/13/PPHX/a8ba0c2a-883a-42a2-adfd-35cabf654f18-7c43875e-58b3-49ac-952e-2fc6af6ed788_thumbnail.png?crop=849,478,x1,y0&width=849&height=478&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/01/21/sen-kyrsten-sinema-has-headache-and-has-name-ruben-gallego/6609892001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    0
  ],
  "sentences": [
    "Or is it for the pharmaceutical companies or whatever other interests that she is more likely to have meetings with than it is with the actual constituents?”\n(Sinema’s spokesman told CNN she’s met with various leaders and held tele-town halls.)",
    "If, however, Republicans continue their bizarre obsession with Donald Trump and nominate, as Arizona Mirror’s Jim Small put it, “a Big Lie-spouting, pandemic-downplaying, misinformation-peddling Republican”?",
    "And since, at this point, there appear to be precious few Republicans outside of Team MAGA who could win a Republican primary ...\nWell, you can see why Sinema might be feeling a headache coming on.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Rep. Ruben Gallego was all set to run for the Senate in 2020 until old-school party leaders waved him off, calculating (wisely) that the more moderate Mark Kelly stood a better chance of winning.",
    "Before, liberals just had to deal with Sinema\nLiberals are furious with her refusal to vote to suspend the filibuster so the voting rights bill she supports could pass on a partyline vote.",
    "Depends on the GOP\nIf Republicans regain their sanity in the next two years and put up a candidate with broad appeal, Gallego would have a hard time pulling out a win.",
    "Gallego’s been grumbling all week about Sinema’s disloyalty, telling CNN that “more than one” Senate Democrat has approached him about challenging her in a primary.",
    "She was once a Green Party activist, considered “too extreme” even for the Democratic Party when she first ran for the state Legislature in central Phoenix in 2002.",
    "But she didn’t win by much in 2018 and that victory over then-Rep. Martha McSally, R-Trump, came with the support of moderate Republicans and independent voters.",
    "Thus came the decision by Sinema to put on a purple dress and take to the Senate floor last week to announce (yet again) her support for the filibuster.",
    "Her move to the middle was a savvy calculation, one she made in order to climb the political food chain in what was then a deep red state.",
    "Opinion: Sen. Kyrsten Sinema's vote this week on the filibuster, like all of her votes, was calculated with an eye on winning re-election.",
    "1 within her own party this week when she forced President Joe Biden into a ditch in her headlong pursuit of reelection in 2024.",
    "The sort who aren’t all that excited about ending the filibuster and allowing progressive bills to flow forth.",
    "If state GOP Chairwoman Kelli Ward is the nominee, hoping the third time’s the charm, or someone like her?",
    "“Nobody in the state has seen hide nor hair of her for the last three years … ,” he told CNN’s Manu Raju.",
    "She says she refuses to negotiate in public, but we want to know who is she negotiating for?",
    "Democrats would have no choice but to stick with Sinema or risk losing the seat altogether.",
    "But like Sinema, he didn’t beat McSally (in her second run for the Senate) by much.",
    "Probably, at this point, Krusty the Clown could beat Sinema in Democratic primary.",
    "Sinema’s the first Democrat Arizona has sent to the Senate in three decades.",
    "The sort who were having buyer’s remorse over their 2016 vote for Trump.",
    "Sinema won because of moderate voters\nSure, the state is changing.",
    "On Thursday, he absolutely unloaded on his Democratic colleague.",
    "“She hasn’t had one town hall; everything she does is scripted.",
    "I envision Sen. Kyrsten Sinema reaching for the Excedrin today.",
    "Gallego has a great story and he's a rising star on the left.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "It was either Sinema’s way or the Republican highway.",
    "The question is, could he win the general election?",
    "Arizona’s senior senator became public enemy No.",
    "Sinema has long clung to the middle of the road.",
    "This time, however, she may have miscalculated.",
    "Gallego’s fortunes would dramatically improve.",
    "That’s the calculation Democrats need to make.",
    "Oh, not because it’s her natural inclination.",
    "In the past, their fury hasn’t mattered.",
    "Gallego could beat Sinema in a primary.",
    "Democrats didn’t have a viable Plan B.",
    "Keep your eyes on Rep. Ruben Gallego.",
    "What if Ruben Gallego were to run?",
    "But did she miscalculate?",
    "But two years from now?",
    "Two years ago, no way.",
    "Is it for Arizonans?",
    "Until now, perhaps.",
    "Could he win?",
    "He did."
  ]
}