{
  "id": 4339,
  "mediaId": 2746,
  "date": "2022-01-27",
  "headline": "Nearly 1 in 5 lawmakers own tech stocks targeted by antitrust bill, analysis shows",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/01/27/AP21271617627489_c0-181-5778-3551_s1200x700.jpg?906d8874974452ec58fd27130ec56af236ceee47",
  "link": "https://www.washingtontimes.com/news/2022/jan/27/nearly-1-5-lawmakers-own-tech-stocks-targeted-anti/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Lovelace",
  "authorUrl": "https://www.washingtontimes.com/staff/ryan-lovelace/",
  "termIds": [
    0
  ],
  "sentences": [
    "Those four tech behemoths are in the crosshairs of the American Innovation and Choice Online Act, which aims to stop big tech companies from promoting their own products to the detriment of competitors’ on the companies’ platforms.",
    "While potential conflicts of interest between personal finances and legislation could inhibit the antitrust proposal’s momentum, some lawmakers who own stocks have voted in committee to support the antitrust legislation.",
    "The bill advanced 16-6 through the Senate Judiciary Committee last week, though several senators who helped push the legislation onward expressed reservations about its readiness for passage into law by the full Senate.",
    "A similar proposal to Mr. Ossoff and Mr. Hawley’s bills was introduced with bipartisan support in the House last year by Reps. Abigail Spanberger, Virginia Democrat, and Chip Roy, Texas Republican, among others.",
    "Amy Klobuchar, Minnesota Democrat, and Tom Cotton, Arkansas Republican, introduced the “Platform Competition and Opportunity Act” last year to thwart mergers and acquisitions by the four large tech companies.",
    "The proposal has Democratic support in the Senate, but Sen. Josh Hawley, Missouri Republican, has introduced a similar bill that would bar members and their spouses from holding or trading of stocks.",
    "An antitrust crackdown on tech faces hurdles before becoming law, including overcoming potential conflicts of interest pitting lawmakers’ personal finances at odds with the legislative proposals.",
    "Earlier this month, Mr. Ossoff and Sen. Mark Kelly, Arizona Democrat, proposed a bill that would ban members of Congress and their families from buying and selling stocks while in office.",
    "Opponents of Ms. Klobuchar and Mr. Cotton’s legislation, such as Reason senior editor Robby Soave, noted that Target and Walmart were exempted under the legislation’s parameters.",
    "Nearly 1 in 5 lawmakers own stock in tech companies targeted by antitrust legislation advancing through the Senate, according to an analysis by Bloomberg published Thursday.",
    "A tech company’s workers and its corporate PAC may contribute to lawmakers’ reelection efforts, although the corporate and workers’ interests are not always aligned.",
    "Jon Ossoff of Georgia and Sheldon Whitehouse of Rhode Island — voted in support of the legislation and own stock in the tech titans, according to Bloomberg.",
    "At least 18 senators and 77 House members hold stock in Amazon, Apple, Alphabet, which owns Google, and Facebook, which has reorganized as Meta.",
    "Some lawmakers’ approach to antitrust and tech has been criticized as being shaped by the business interests of their home states.",
    "Mrs. Pelosi’s home district in San Francisco features voters working in the tech industry in Silicon Valley.",
    "Target’s headquarters are in Ms. Klobuchar’s Minnesota, and Walmart is based in Mr. Cotton’s Arkansas.",
    "Ms. Spanberger has touted Mr. Ossoff and Mr. Kelly’s legislation as being based on her earlier bill.",
    "The lawmakers identified by Bloomberg as holding the tech stocks represent nearly 18% of Congress.",
    "House Speaker Nancy Pelosi disclosed that her husband has as much as $25.5 million in Apple stock.",
    "Some lawmakers have pushed new legislation to change how lawmakers trade stocks while in office.",
    "Stock investments are not the only way business interests’ influence is felt by lawmakers.",
    "The companies spend large sums to lobby lawmakers and employ lawmakers’ constituents.",
    "Two Democrats — Sens.",
    "Sens."
  ]
}