{
  "id": 4352,
  "mediaId": 2716,
  "date": "2022-01-26",
  "headline": "Arizona Sen. Mark Kelly 'does not support' censure of fellow Democrat Kyrsten Sinema",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1643210231/GettyImages-1229448927.jpg",
  "link": "https://theweek.com/politics/1009427/arizona-sen-mark-kelly-does-not-support-censure-of-fellow-democrat-kyrsten-sinema",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    0
  ],
  "sentences": [
    "\"I want to be clear, the Arizona Democratic Party is a diverse coalition with plenty of room for policy disagreements, however on the matter of the filibuster and the urgency to protect voting rights, we have been crystal clear,\" ADP Chair Raquel Terán said in a statement released after the vote to censure Sinema.",
    "the other arizona senator\nArizona Sen. Mark Kelly has spoken out in defense of his fellow Democratic congressional colleague Sen. Kyrsten Sinema, who, following her opposition to filibuster reform, was censured at the hands of the Arizona Democratic Party (ADP), the Arizona Republic reports.",
    "\"While they came to different decisions on this vote, he looks forward to continuing to work with Sen. Sinema on Arizona priorities, as they have done during his first year in the Senate to pass critical infrastructure investments that will create good-paying jobs.\"",
    "Last week, much to the ire of the party, both Sinema as well as Sen. Joe Manchin (D-W.Va.) voted against the implementation of a \"talking filibuster\" rule in an attempt to pass voting rights legislation.",
    "Kelly's remarks could provide a crucial bit of warm sentiment for Sinema, \"who is now facing open talk of a primary challenge from Arizona Democrats and fellow senators,\" the Republic notes.",
    "\"Sen. Kelly does not support the censure,\" a Kelly campaign spokesperson told the Republic on Tuesday.",
    "The senator, Terán added, has failed \"to do whatever it takes to ensure the health of our democracy.\"",
    "Kelly, for his part, voted alongside most other Senate Democrats."
  ]
}