{
  "id": 4354,
  "mediaId": 2790,
  "date": "2022-01-21",
  "headline": "Sinema's filibuster stance only adds to the frustrations of Arizona progressives",
  "image": "https://media.npr.org/assets/img/2022/01/20/gettyimages-1365682310_wide-9de919794326839157c4f9e0f7a33132142ae922.jpg?s=1400",
  "link": "https://www.npr.org/2022/01/21/1074621572/sinemas-filibuster-stance-only-adds-to-the-frustrations-of-arizona-progressives",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Giles",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "On Tuesday, the abortion-rights group NARAL Pro-Choice America issued its own statement that, without mentioning Sinema by name, made its target clear: \"We will not endorse or support any senator who refuses to find a path forward on this critical legislation,\" the organization said of the two voting rights bills stuck in the Senate.",
    "Sinema's defense\nIn her own statement ahead of Wednesday night's vote — when she and West Virginia Democrat Joe Manchin joined all 50 Senate Republicans in blocking a proposed change to the filibuster — Sinema brushed aside the criticism, as she had a week earlier, chalking it up to honest disagreements over policy and strategy.",
    "Amid mounting calls in Arizona for a primary challenger to Sinema in 2024, when she's next up for reelection, the statement marked a turning point — from speculation to concrete action, not just locally, but by an organization that's steadfastly supported Sinema over the years and holds broad, national influence.",
    "EMILY's List steps in\nUnable to change Sinema's mind on their own, Kirkland and dozens of other Democratic women in Arizona sent a letter to an organization they hoped would have more influence: EMILY's List, a decades-old national campaign group focused on electing female Democrats who support abortion rights.",
    "\"Right now, Sen. Sinema's decision to reject the voices of allies, partners and constituents who believe the importance of voting rights outweighs that of an arcane process means she will find herself standing alone in the next election,\" Butler added.",
    "When Arizona Democrat Kyrsten Sinema last week reiterated her opposition to changing Senate filibuster rules, helping to doom her party's efforts to pass voting rights legislation, it only added to the frustrations of progressives in her home state.",
    "In a statement, President Laphonza Butler said if Sinema \"can not support a path forward for the passage of this legislation, we believe she undermines the foundations of our democracy, her own path to victory and also the mission of Emily's List.",
    "\"I also maintained my long standing opposition to separate actions that would deepen our divisions and risk repeated radical reversals in federal policy, cementing uncertainty and further eroding confidence in our government,\" she said.",
    "\"And the problem right now is ... she's becoming someone who is a symbol for the type of obstruction that exists in Washington, D.C., in the Senate that is preventing reasonable laws from getting passed that the American people want.\"",
    "Republicans have used it for the length of President Biden's time in office to block voting bills that Democrats — including Sinema — argue are needed to combat voting restrictions passed at the state level by Republicans.",
    "\"EMILY's List is a very powerful, trusted messenger to Democrats, and to pro-choice women,\" said Tony Cani, a political strategist who served as deputy director of the Biden campaign in Arizona.",
    "And organizers with Stand Up America and Living United for Change in Arizona, also known as LUCHA, released a statement vowing to challenge Sinema in 2024 if she won't change her mind.",
    "Sinema later issued a statement touting her vote for voting rights legislation, but also explained why she blocked the only path forward at the time to actually pass the bills.",
    "\"We're in a moment where, given the threats to our democracy, we can't afford for people and organizations to be staying in their lane and focused only on one issue,\" she said.",
    "From 2015 to 2020, while Sinema was running for the Senate, no one contributed more to her campaign than EMILY's List — over $400,000, according to OpenSecrets.",
    "For some Arizona progressives, Sinema's speech a week ago in defense of the filibuster had already confirmed she's a part of the problem, not the solution.",
    "\"I think she is showing the American public and Arizonans very clearly who she is standing with,\" said Alejandra Gomez, co-executive director of LUCHA.",
    "Arizona progressives had spent months trying to convince Sinema that voting rights are important enough to alter the Senate's legislative filibuster.",
    "On Thursday, after the bid to change Senate rules officially failed, Butler made clear that EMILY's List won't endorse Sinema in the future.",
    "It's been used in the past to defend women's access to health care, a point frequently noted by Sinema in her defense of the Senate rule.",
    "\"We really are in a situation where our freedom to vote is at stake,\" said Emily Kirkland, executive director of Progress Arizona.",
    "Sinema did help craft the bipartisan infrastructure law, and has made her mark in the Senate working across the aisle.",
    "Historically, abortion advocates like EMILY's List have resisted calls to change or eliminate the filibuster.",
    "Arizona strategist Cani said Sinema may believe she's doing the right thing by preserving the filibuster.",
    "Arizona is a tightly contested state where centrist candidates have found success in general elections.",
    "\"I think that what she's missing here is that her brand is somebody who gets things done,\" Cani said.",
    "Kirkland said the stakes are too high for groups like EMILY's List to stay on the sidelines.",
    "The rule requires a 60-vote majority to move most legislation forward through the chamber.",
    "But if the senator is making a political calculation, Cani said she's mistaken.",
    "But to win reelection in 2024, she'll first have to survive a primary.",
    "EMILY's List seemed to set a tone for other organizations as well.",
    "On Tuesday, EMILY's List heeded the call.",
    "\"And she is not standing with voters.\"",
    "And it's no hollow threat."
  ]
}