{
  "id": 4370,
  "mediaId": 2643,
  "date": "2022-01-27",
  "headline": "Kyrsten Sinema Would Lose 2024 Arizona Primary in a Landslide: Poll",
  "image": "",
  "link": "https://www.newsweek.com/kyrsten-sinema-filibuster-senate-gallego-arizona-1673493",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brendan Cole",
  "authorUrl": "https://www.newsweek.com/authors/brendan-cole",
  "termIds": [
    0
  ],
  "sentences": [
    "Data for Progress said that its initial polling found Gallego \"to be in the best position to beat Sinema in 2024,\" and that its latest data has shown that in the last three months, \"Sinema's favorability has dipped even further—and that Gallego's potential to secure a primary victory has increased.\"",
    "Already under fire for her obstruction of her party's Build Back Better agenda, Sinema was censured by Arizona Democrats last week for backing the GOP in keeping the Senate's filibuster rules, effectively scuppering chances of passing landmark voting rights legislation.",
    "A poll conducted between January 21 and January 24 of 673 likely Democratic primary voters found her well behind progressive Representative Ruben Gallego, who is rumored to be considering a Senate run in two years' time when Sinema's term is up.",
    "Support for Senator Kyrsten Sinema in her home state of Arizona is at rock bottom according to a survey by one polling firm, whose findings suggest she faces an uphill battle to retain her Senate seat should she seek re-election in 2024.",
    "While around 80 percent of likely Democratic primary voters in Arizona have favorable views of President Joe Biden and the state's other Democratic Senator Mark Kelly, less than a fifth (19 percent) had a favorable opinion of Sinema.",
    "Meanwhile, in a statement to The Hill last week, Sinema's spokesperson Hannah Hurley said that the senator had \"always promised Arizonans she would be an independent voice for the state—not for either political party.\"",
    "Only 16 percent of respondents would back Sinema, in a primary contest compared with 74 percent who would vote for the former U.S. Marine, who is currently the representative for Arizona's 7th congressional district.",
    "This is a slump of seven percentage points from the 23-percent support she had in the same firm's poll in October, in which 62 percent of respondents said they would vote for Gallego in a head-to-head.",
    "However, as previously reported by Newsweek, David A. Bateman, an associate professor of government at Cornell University, said it was too soon to write Sinema off just yet.",
    "He said last week that Sinema could \"read the electoral landscape of Arizona better than we can\" and that she knew which donors \"she can spare and which she can't.\"",
    "While Gallego has not committed to running against Sinema, he has been in the frame as a potential challenger to the current senator since last year.",
    "The poll, with a four-percent margin of error, found that she trailed by 58 percentage points behind Gallego in a hypothetical head-to-head.",
    "A survey by the liberal pollsters Data For Progress found these stances are hurting her standing among voters in the Grand Canyon State.",
    "He has batted off speculation regarding a challenge, telling MSNBC on Tuesday, \"I'm not going to make that determination right now.\"",
    "The poll's respondents were also asked who they would vote for in a Democratic primary match off with Tucson Mayor Regina Romero.",
    "\"She's delivered for Arizonans and has always been honest about where she stands,\" the statement said.",
    "Only 17 percent said they would back Sinema—49 percentage points less than Romero's 66 percent.",
    "Her disapproval rating of 76 percent gave her minus 57 points net favorability overall.",
    "Newsweek has contacted Sinema's office for comment."
  ]
}