{
  "id": 4391,
  "mediaId": 2630,
  "date": "2022-01-26",
  "headline": "A Supreme Court vacancy upends politics for fourth election in a row",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_04/3531647/220126-stephen-breyer-jm-1444.jpg",
  "link": "https://www.nbcnews.com/politics/elections/supreme-court-vacancy-upends-politics-fourth-election-row-n1288057",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I suspect over the next few months that the political attacks Sen. Cortez Masto levied against President Trump’s nominees will be replaced by a rubber stamp of approval.”\nIn her own statement, Cortez Masto said she “will carefully consider the record of any nominee to the Supreme Court, just as I have for all judicial nominees during my time in the U.S. Senate.”\nA polarizing Biden nominee could also put pressure on Democrats running for re-election in swing states, like Arizona Sen. Mark Kelly and Georgia Sen. Raphael Warnock, who will likely have to vote on the nominee just as their elections heat up.",
    "“We were talking about the economy, we were talking about inflation — now we're going to be talking about the Supreme Court.”\nThis year's elections will now be the fourth in a row colored by a fight over a Supreme Court vacancy, from Obama's pick of Merrick Garland in 2016 to then-President Donald Trump's selections of Brett Kavanaugh in 2018 and Amy Coney Barrett in 2020, all of which produced some of the ugliest moments of partisan rancor in recent memory.",
    "“Perhaps left-wing activists should have thought twice about chasing Kyrsten Sinema into bathroom stalls and attempting to board Joe Manchin’s yacht if they wanted to replace Justice Breyer with a liberal,” said Chris Pack, a veteran of the Senate Leadership Fund, which is aligned with GOP leader Mitch McConnell, and the National Republican Congressional Committee, referring to the two centrist Democrats who have proven to be obstacles on key votes.",
    "Rory Cooper, a former top Republican congressional aide, suggested on Twitter that if it is indeed Jackson, Republicans might be better off letting the confirmation go ahead without much opposition, since Biden would be replacing a liberal with a liberal, and keeping their focus on other issues that Biden has been struggling with, such as inflation and the pandemic.",
    "“The full Democratic coalition worked together to make this happen, and the confirmation process is a chance to further unify and energize all Democrats.”\nWinning the political fight over the judicial nominee will depend on Democrats sticking together since they cannot afford to lose even a single vote in the Senate unless some Republicans break ranks.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nEven if Breyer’s replacement is already on the bench by the time voters head to the polls, the vacancy guarantees months of intense political focus on the court and the hot-button issues before it, especially abortion.",
    "The liberal Justice Ruth Bader Ginsburg resisted calls to retire before the 2014 election, when Democrats under Obama lost control of the Senate, then died six weeks before the 2020 election and was replaced by Barrett, giving conservatives their expanded 6-3 majority on the court.",
    "Adam Laxalt, a Republican Senate candidate in Nevada, home to one of this year’s key battles for control of the chamber, quickly turned the news into an opportunity to paint his Democratic opponent, incumbent Sen. Catherine Cortez Masto, as hypocritical and overly partisan.",
    "“This is exactly what Biden needs,” said Adam Jentleson, who was a top aide to the longtime Senate Democratic leader Harry Reid and one of the many progressive activists pushing for Breyer to retire before the midterms in case Democrats lose control of the Senate.",
    "“It has been extremely disappointing to see how Sen. Cortez Masto and her liberal colleagues have politicized and denigrated this important confirmation process,” Laxalt said in a statement his campaign emailed soon after the announcement.",
    "Current signs point to a dire political season for Democrats, but many on the left say the potential for President Joe Biden to select a history-making Black woman nominee could be a critical jolt for the party’s dispirited base.",
    "WASHINGTON — Supreme Court Justice Stephen Breyer’s impending retirement upended the country’s political landscape Wednesday, once again entangling the supposedly nonpolitical judiciary in the partisan fervor of an election year.",
    "“We are going to go straight to the politics of the Supreme Court in a way that has the potential to fundamentally change the midterms,” Jim Messina, who managed President Barack Obama’s re-election campaign, said on MSNBC.",
    "“But it can carry some danger as well.”\nThe surprising news set off a flurry of conference calls, text messages and strategy sessions among operatives in both parties throughout Washington and across the country.",
    "Republican voters have traditionally cared more about the judiciary than Democrats, though that may be changing with Roe v. Wade hanging in the balance, and the vacant seat became a campaign issue immediately.",
    "But Irene Lin, a Democratic operative who is managing the campaign of Tom Nelson, a Democratic Senate candidate in Wisconsin, said Biden needs to select someone interesting enough to get voters’ attention.",
    "Hopefully Biden will pick someone that excites the base.”\nBiden and Senate Democratic leaders plan to move quickly to replace Breyer after he steps down at the end of the court’s term this summer.",
    "Pack, recalling Kavanaugh’s divisive confirmation fight in the run-up to Trump's first midterm, said a nominee that excites the liberal base is likely to do the same for the conservative one.",
    "“Justice Breyer’s retirement is coming not a moment too soon,” said Brian Fallon, a former aide to Senate Majority Leader Chuck Schumer who now runs the progressive group Demand Justice.",
    "“This will be something that will consume the political world over the summer, maybe even into early fall,\" Alex Conant, a Republican strategist who has worked on Senate races, said.",
    "“The White House needs a win — here's a place where they could get one that would excite activists,” Jessica Taylor, an analyst with the nonpartisan Cook Political Report, said.",
    "Biden has promised to appoint a Black woman to the high court, and party insiders see the front-runner as Judge Ketanji Brown Jackson of the U.S. Court of Appeals for the D.C.",
    "And they’ll need whomever Biden nominates to be able to withstand the heat of the confirmation process, which has led more than one president to withdraw their nominee.",
    "They only need a simple majority, following the precedent Republicans set in 2017 to confirm Justice Neil Gorsuch, the first of Trump’s three Supreme Court nominees.",
    "Liberals, who have been living in fear of a repeat with the 83-year-old Breyer, are breathing a sigh of relief now — no matter what happens in November.",
    "If Democrats follow a similarly aggressive timeline, they would have plenty of time to replace Breyer before November, when they could lose the Senate.",
    "“If Democrats were smart, they would choose a noncontroversial pick because this is an issue that fires up the Republican base,” he said.",
    "Coney Barrett’s lightning quick confirmation took only about a month, culminating in her swearing-in days before the 2020 election.",
    "“Republicans want this election to be a referendum on Joe Biden, assuming his poll numbers are still under water in November.",
    "Lindsey Graham of South Carolina, Susan Collins of Maine and Lisa Murkowski of Alaska joining all 50 Democrats.",
    "“Now we must make sure our party remains united in support of confirming his successor.”",
    "Anything that changes that narrative for Democrats has the potential to be helpful.\"",
    "“I think the Supreme Court definitely juices activists on both sides,” said Lin.",
    "The Senate confirmed Jackson in a 53-44 vote last June, with Republican Sens.",
    "Circuit, generally considered the country’s second-most powerful court.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "“Your average voter can’t even name a single justice."
  ]
}