{
  "id": 441,
  "mediaId": 2810,
  "date": "2022-02-23",
  "headline": "Russia, Ukraine, and the New Bipartisanship in Washington",
  "image": "https://www.thenation.com/wp-content/uploads/2022/02/ukraine-tank-russia.jpg",
  "link": "https://www.thenation.com/article/politics/russia-ukraine-bipartisanship/",
  "mediaOutlet": "The Beat",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael T. Klare",
  "authorUrl": "https://www.thenation.com/authors/michael-t-klare/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We pledge to work toward whatever emergency supplemental legislation will best support our NATO allies and the people of Ukraine, and support freedom and safety around the world.”\nAnd so now we have a reasonably clear picture of what to expect when Congress reconvenes on February 28: a marathon of passionate speeches about Putin’s perfidious behavior and the need to bolster American defenses against both Russia and China, at whatever cost.",
    "“It addresses a broad range of pressing issues, from strategic competition with China and Russia, to disruptive technologies like hypersonics, AI, and quantum computing, to modernizing our ships, aircraft, and vehicles.”\nNow comes the rollout of the FY 2022 budget, and all key actors are gearing up for a contest to see who can add the most to whatever figure Biden submits.",
    "For the arms dealers and military hawks in Washington, however, it is a time to celebrate: Not only is the White House about to submit a record-breaking defense budget for 2023, but Democrats and Republicans in Congress—united as never before—are determined to add tens of billions of dollars for additional weapons on top of whatever astronomical figure Biden sends them.",
    "To finance these, and other major military priorities, the Biden administration proposed spending $715 billion on the Department of Defense in FY 2022; another $38 billion was requested for the nuclear weapons work of the Department of Energy and for defense-related activities by other agencies, bringing total proposed military spending to $753 billion.",
    "At root, the bipartisan drive to funnel more money to the military reflects a Washington consensus that the “forever wars” in the Middle East had become a massive drain on US combat capabilities and that China and Russia exploited America’s overseas entanglements to beef up their own capabilities, thereby eroding this country’s military advantage.",
    "The White House has yet to release its formal budget request, but Washington sources report that the Office of Management and Budget has approved a Pentagon budget of $773 billion in FY 2023—$58 billion more than it requested in FY 2022—with nuclear weapons and related expenses bringing the full national security request to well over $800 billion.",
    "“It’s important to me that we can regain the ground we’ve lost and make sure the Defense Department is well manned and well equipped.”\nConvinced that a concerted effort is required to restore US military superiority vis-à-vis its great-power competitors, members of both parties have vowed to spend whatever it takes to accomplish this objective.",
    "Aside from any deaths and injuries that will occur—especially if Putin extends its invasion beyond the borders of the self-declared Donetsk and Luhansk republics—the move will result in severe hardship for most ordinary Russians as harsh Western sanctions take effect and considerable suffering throughout the region as energy prices mount.",
    "“We’ve lost a lot of ground to the Chinese while we’ve been focused over the last 20 years on counterterrorism and counterinsurgency, and they’ve caught up in AI [artificial intelligence], machine learning, hypersonics and a lot of other things,” said Senator Mark Kelly (D-Ariz.), in a characteristic expression of this outlook.",
    "You can be sure, however, that in the wake of Russian intervention in Ukraine, Democrats and Republicans in Congress will be falling over each other in efforts to increase the Biden request by tens of billions of dollars, thereby allowing the purchase of still more of those advanced weapons systems.",
    "“The bipartisan adoption of my amendment sends a clear signal: the President’s budget submission was wholly inadequate to keep pace with a rising China and a reemerging Russia,” said Representative Mike Rogers (R-Ala.), the author of the amendment and a senior member of the House committee.",
    "In a prelude of what is to come, a bipartisan group of senators and representatives attending the Munich Security Conference on February 21, led by Senators Lindsey Graham (R-S.C.) and Sheldon Whitehouse (D-R.I.), issued a joint statement pledging congressional unity in opposing Moscow.",
    "As submitted to Congress, the proposal included funding for 85 F-15 stealth fighter planes (at a total cost of $12.0 billion), two Los Angeles–class attack submarines (for $6.9 billion), and one Arleigh Burke–class missile destroyers ($2.4 billion), among other costly items.",
    "One such proposal, adopted by the House Armed Services Committee with the support of 14 Democrats, added $24 billion for additional naval systems, including another Arleigh Burke–class destroyer and preliminary work on a third Los Angeles–class submarine.",
    "Contending that “China poses the greatest long-term challenge to the United States,” the FY 2022 budget proposal emphasized research on advanced technologies like AI and hypersonics along with the acquisition of numerous ships, planes, and missiles.",
    "But a majority in Congress, led by Democrats and Republicans on the House and Senate Armed Services Committees, sought to increase the budget, claiming the Biden request was too meager to overcome the mounting Chinese and Russian threat.",
    "In what might be called the “new bipartisanship,” leaders of both parties have abandoned the mutual hostility so evident in recent years to cooperate in passing measures to punish Russia, contain China, and enrich the defense industry.",
    "In the end, Congress awarded the Pentagon $740 billion in the National Defense Authorization Act for FY 2022, incorporating many of the additional items sought by Representative Rogers and other congressional hawks from both parties.",
    "What remains of Biden’s domestic agenda will be swept aside as leading Democrats seek to outpace their Republican colleagues in proposing additions to the military budget and other measures to boost American military power.",
    "Most of the additional Pentagon funding is expected to go towards research on advanced weapons technology and the accelerated procurement of F-35s, destroyers, submarines, and other high-end weaponry.",
    "“I am pleased that the Senate has voted in an overwhelming, bipartisan fashion to pass this year’s defense bill,” said Senator Jack Reed (D-R.I.), chair of the Senate Armed Services Committee.",
    "Some Democrats, primarily members of the Congressional Progressive Caucus, attempted to reduce the Pentagon request, saying it was excessive at a time when the forever wars were winding down.",
    "For the people of Ukraine and Russia, Vladimir Putin’s decision to send troops into two breakaway republics in Ukraine’s far-eastern Donbas region will bring nothing but pain and suffering.",
    "This bipartisan consensus was forged in early 2021, as Congress deliberated the Pentagon’s proposed budget for fiscal year (FY) 2022, the first to be submitted by the Biden administration.",
    "Once initiated, this militaristic impulse will prove almost impossible to halt, suggesting that, whatever happens in Europe, the new bipartisanship will dictate US spending priorities.",
    "“We as a bipartisan delegation will bring home the same unity and resolve we have seen among our Atlantic allies against Russian aggression,” the statement reads.",
    "This trend has been underway since the final years of the Trump administration, but has gained enormous momentum as a result of the current crisis over Ukraine.",
    "Only through a massive infusion of additional funds, it is argued, can the United States overcome this setback and restore its competitive edge.",
    "But no sooner had the Pentagon budget request been submitted to Congress than a fight broke out over its size.",
    "Subscribe to The Nation\nSubscribe now for as little as $2 a month!"
  ]
}