{
  "id": 4432,
  "mediaId": 8474,
  "date": "2022-01-19",
  "headline": "Bills Target Insider Trading by Members of US Congress",
  "image": "",
  "link": "https://www.tucsonpost.com/news/272206326/bills-target-insider-trading-by-members-of-us-congress",
  "mediaOutlet": "tucsonpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Failure to disclose\nDozens of other lawmakers came under scrutiny early this year after a report by the publication Insider revealed that in 2021, 54 members of the House and Senate had failed to live up to reporting requirements set out in the Stop Trading on Congressional Knowledge (STOCK) Act, which became law in 2012 after a similar series of revelations about members of Congress trading on privileged information.",
    "Last week, Georgia Senator John Ossoff and Arizona Senator Mark Kelly, both Democrats, introduced the Ban Congressional Stock Trading Act, a proposal that would require members of Congress and their immediate families to place any stock they own into a blind trust, making it impossible for them to trade on knowledge gained through their work on Capitol Hill.",
    "WASHINGTON - An effort to bar members of Congress from buying and selling stock in public companies is gaining momentum in Washington after a series of revelations that dozens of lawmakers violated financial disclosure requirements, often in ways that suggested they were profiting from advance knowledge of issues related to the coronavirus pandemic.",
    "A number of senators from both parties, including California Democrat Dianne Feinstein and Oklahoma Republican James Inhofe, also were criticized for stock sales as the coronavirus was first taking hold in the United States, although the Justice Department closed brief investigations into both cases and chose to take no legal action.",
    "Pandemic clarified differences\nSome groups calling for reform argue that the universal impact of the pandemic may have helped underscore the impropriety of members of Congress trading on insider knowledge for everyday Americans who might not normally pay much attention to such things.",
    "'It is totally reasonable for any constituent to question whether their member is making choices based on their stock portfolio as opposed to their constituents' interests when they see that members of the Energy and Commerce Committee, for example, are invested in energy companies.",
    "Last week, a spokesperson for Pelosi told The Washington Post that the speaker had requested that the Committee on House Administration, which oversees House members' compliance with the stock trading rules, consider whether stricter enforcement and higher penalties are needed.",
    "In a statement this week, Spanberger said that she had been moved to act, in part, because Americans seemed to treat the news that members of Congress might be enriching themselves by trading on nonpublic information with resignation rather than outrage.",
    "Questionable trades\nSince the beginning of the coronavirus pandemic, news reports have surfaced about members of Congress buying or selling shares of public companies before information, of which they had advance knowledge, was released to the public.",
    "'The pandemic has clarified the way that this problem can really manifest itself in an especially glaring and corrupt-looking kind of way,' said Dylan Hedtler-Gaudette, government affairs manager for the Project on Government Oversight.",
    "'Most members of Congress go into government service for the right reasons and don't look to line their pockets,' said Donald Sherman, vice president and chief legal counsel for Citizens For Responsibility and Ethics in Washington.",
    "One of the most striking examples is that of Senator Richard Burr, a North Carolina Republican, who served as chairman of the Senate Intelligence Committee in early 2020, just as the seriousness of the pandemic was becoming clear.",
    "Appearance of impropriety\nGood governance organizations argue that even the appearance of impropriety in lawmakers' personal investments is corrosive to the already low level of trust that many Americans say they have in Congress.",
    "Sponsored by Virginia Democrat Abigail Spanberger and Texas Republican Chip Roy - two members who agree on little else in politics - it is called the Transparent Representation Upholding Service and Trust (TRUST) in Congress Act.",
    "Burr has claimed that he was acting on publicly available information, but his trades remain under investigation by the U.S. Securities and Exchange Commission, which seeks to root out manipulation of financial markets.",
    "Burr, who had access to sensitive intelligence briefings, sold stocks worth hundreds of thousands of dollars in mid-February 2020, before the seriousness of the pandemic was widely understood in the United States.",
    "The Insider account found that members of both parties had violated the law, some to a greater degree than others, by failing to report stock transactions or by reporting them far later than they were supposed to.",
    "'And it looked like there were some members of Congress who had advance knowledge of how bad it was going to be, and tried to use that knowledge to make sure that they didn't feel as much pain as the rest of us.'",
    "Also last week, House Minority Leader Kevin McCarthy, a California Republican, said that if Republicans take over the House following the 2022 elections, he will consider banning members from owning stocks.",
    "She said that rules were already in place to restrict conflicts of interest among lawmakers, and that she believes lawmakers ought to be allowed to 'participate' in the United States' free-market economy.",
    "In addition to the bipartisan team of Spanberger and Roy in the House, conservative Republican Senator Josh Hawley of Missouri has introduced legislation similar in intent to the Ossoff-Kelly bill.",
    "'In the early days of the COVID-19 pandemic, we saw the public react to accusations of insider trading by lawmakers - not with shock, but with a shrug,' Spanberger said.",
    "Millions of Americans' net worth eroded severely, although the stock market has since recovered, and the Dow currently sits well above its pre-pandemic high.",
    "From mid-February through mid-March of 2020, the Dow Jones Industrial Average, a key indicator of U.S. market performance, plummeted by roughly one-third.",
    "Get a daily dose of Tucson Post news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.",
    "Publish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Tucson Post.",
    "Progress unclear\nFILE - Speaker of the House Nancy Pelosi, D-Calif., speaks to reporters at the Capitol in Washington, Jan. 13, 2022.",
    "'The perception of insider trading itself, let alone the practice of it, by members of Congress is damaging to our democracy.'",
    "As minority leader, McCarthy is seen as the most likely person to become House Speaker in the event of a Republican takeover.",
    "The Senate proposal largely mirrors a House bill that has been working its way through the legislative process for a year.",
    "Speaker of the House Nancy Pelosi, a California Democrat, appeared to be dismissive of the effort in remarks last month.",
    "Burr was far from the only lawmaker whose trades attracted attention in the early days of the pandemic.",
    "'This is a huge event that is causing pain and disruption in everyone's lives,' he told VOA.",
    "FILE - Sen. Richard Burr, R-N.C., speaks on Capitol Hill in Washington, Jan. 11, 2022.",
    "Whether the bills before Congress will become law is far from clear at this point.",
    "Current practices on Capitol Hill, however, raise obvious concerns, he told VOA.",
    "FILE - Rep. Abigail Spanberger, D-Va., speaks on Capitol Hill, March 10, 2021.",
    "Both Democrats and Republicans appear to agree on the need for reform.",
    "He stepped down as Intelligence Committee chairman in May 2020.",
    "You don't have to be a cynic to raise questions about that.'",
    "Such sales by lawmakers were well timed.",
    "More Information"
  ]
}