{
  "id": 4478,
  "mediaId": 8475,
  "date": "2022-01-11",
  "headline": "Ducey touts border security, water & tax plans in final State of the State speech",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/0101121_ducey-sots-azm-2022.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/011122_ducey_state_of_state/ducey-touts-border-security-water-tax-plans-final-state-state-speech/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    5078,
    2915,
    304,
    5949
  ],
  "sentences": [
    "The overwhelming majority of Arizona’s border with Mexico is land controlled by the federal government, and Ducey said the entire border must be secure, so his fifth point was to urge Arizona’s congressional delegation to withhold its votes for any federal legislation until Biden commits to building a wall along the length of the border, adding virtual surveillance and increasing funding for border communities.",
    "“So, naturally, after we signed the budget, I told my staff: ‘In 2022, we’re going to top all of this.’ And so we’ve been hard at work to make this a banner year.”\nLast year, Ducey signed a billion-dollar tax cut, fulfilling a pledge from his first gubernatorial campaign in 2014 to reduce the state’s income tax rate to as close to zero as possible.",
    "Cobb said legislative budget analysts expect a $1.7 billion surplus of one-time money — she presumed the billion-dollar water plan would be a one-time expenditure for this next fiscal year — and $700 million in ongoing revenue, though she noted it could be less if the implementation of last year’s tax cuts accelerates this year.",
    "Other proposals from Ducey’s State of the State included increasing funding for people who take in family members as foster children, paying off state debt, increasing the size of the state’s Rainy Day Fund, and waiving in-state tuition for the spouses of veterans, as the state previously did for veterans themselves.",
    "Ducey’s five-point plan called for increased funding to the border strike force he created in 2015, his first year in office, including for drones and other equipment; increasing criminal penalties for human smuggling, with increased funding for border counties to prosecute such crimes; partnering with Texas Gov.",
    "And with the state sitting on a multi-billion-dollar surplus, Ducey said the state will cut taxes once again rather than appease the “spending lobby.”\nStill, the governor outlined some big-ticket budget items he wants to pursue this year, and none as big as his plans for water.",
    "Doug Ducey vowed to use state resources to increase border security, spend a billion dollars to treat and transport water from the Sea of Cortez, expand school choice and continue lowering taxes as he laid out a wide-ranging agenda for his last year in office.",
    "He didn’t pitch any specific policies in that area, but suggested more open enrollment, new transportation models, more charter schools and “more educational freedom for families” as possible avenues, and indicated that the ball is in the legislature’s court.",
    "In his eighth and final State of the State address on Monday, Ducey took a victory lap, highlighting his accomplishments from the past seven years, including 2021, which he called “one for the record books.” But his last year won’t be a quiet one, he said.",
    "A ban on the teaching of critical race theory in Arizona public schools was thrown out by the state Supreme Court, which found that it was among the many non-budget-related provisions of last year’s budget that violated the Arizona Constitution.",
    "The governor committed to keeping schools open amid the ongoing COVID-19 surge, though no school districts are currently proposing a return to the remote learning the state switched in to in the early days of the pandemic in 2020.",
    "Fann also said she backed Ducey’s plan to increase pay for state troopers, saying DPS has been having trouble filling those positions, while Bowers said the governor’s plans for border security will be important for the state.",
    "The speech was well-received by Republican lawmakers, who gave Ducey a series of standing ovations for his comments on school choice, border security, critical race theory, law enforcement and water, among other things.",
    "Greg Abbott to create the American Governor’s Border Strike Force, which he said will patrol the border; and erect walls or other physical barriers in areas where the state can do so along the U.S.-Mexico border.",
    "Ducey took a swipe at the progressive left’s “defund the police” movement that emerged in 2020 amid nationwide protests following a Minneapolis police officer’s killing of George Floyd, an unarmed Black man.",
    "He vowed to ban schools from teaching critical race theory, a hot-button issue for Republicans across the country, though it’s not clear if any public schools in Arizona are actually teaching it.",
    "There are people who are coming who just want to make their lives better, and they’re being taken advantage of by those that are coming to try to cause problems,” John told the Arizona Mirror.",
    "For parents and others who are concerned about what students are learning in K-12 schools, Ducey proposed putting all curriculum and other academic materials online in a searchable form.",
    "House Speaker Rusty Bowers, R-Mesa, and Senate President Karen Fann, R-Prescott, pointed to water as among the biggest issues from Ducey’s agenda that they want to tackle this session.",
    "“With resources available in our budget, a relationship with Mexico that we’ve built and strengthened over the last seven years, and the need clear, what better place to invest more?",
    "“Our goal: Secure Arizona’s water future for the next 100 years.”\nMany of Ducey’s proposals were vague, with details to come on Friday, when he releases his executive budget plan.",
    "And to help students make up for “learning loss” during that time, Ducey proposed a summer camp for this year that will help them catch up on math, reading and American civics.",
    "Instead of just talking about desalination – the technology that made Israel the world’s water superpower – how about we pave the way to make it actually happen?” Ducey said.",
    "Rep. Joel John, R-Buckeye, liked what he heard from the governor on border security, a major issue for his district, which includes a long swath of the U.S.-Mexico border.",
    "Specifically, the governor proposed increasing salaries for Department of Public Safety troopers to make them the highest paid law enforcement officers in the state.",
    "In 2019, Ducey signed a landmark drought contingency plan, and in his speech he said Arizona needs to go further, proposing a “historic investment” of $1 billion.",
    "Rep. Regina Cobb, a Kingman Republican who chairs the House Appropriations Committee, said she liked a lot of what she heard in the speech, as well.",
    "However, he went into a great deal of detail on his plans for border security, an area where he’s been fiercely critical of President Joe Biden.",
    "Kyrsten Sinema and Mark Kelly, who faces a tough re-election in November, to back such legislation, saying he has draft language on his website.",
    "It was true at Cold Stone, and it’s been true in the public square,” Ducey said, referencing his time as the head of Cold Stone Creamery.",
    "The governor was sparse with the details, but specifically cited desalination as one of the policies he wanted to pursue.",
    "But she wants to know how much Ducey’s plans will cost and how much of a budget surplus he believes the state will have.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "“One of the problems in my district is (that) the amount of people that are coming is overwhelming Border Patrol.",
    "So, that is a top priority to make sure that we get that done,” Fann told reporters after the speech.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "“Let’s think big and find more ways to get kids into the school of their parents’ choice.",
    "And she wants to see exactly what the billion dollars will go toward in the water plan.",
    "I want to see how his numbers are going to shake out in comparison to mine.”\n- 30 -",
    "We know that we are now hitting those markers much sooner than we expected.",
    "We will fight this fight until Washington D.C. finally acts,” Ducey said.",
    "Ducey also called on the legislature to expand school choice in general.",
    "He said he wants to instead increase funding for law enforcement.",
    "Concerned about keeping quality reporting alive in Tucson?",
    "“There was a lot of funding in there today,” Cobb said.",
    "Support TucsonSentinel.com with a contribution today!",
    "“The takeaway: In Arizona, we will secure our border.",
    "“I think it’s a very ambitious agenda,” Bowers said.",
    "Ducey had other plans for K-12 education, as well.",
    "“I have a hard time stopping to celebrate victory.",
    "Send me the bills, and I’ll sign them,” he said.",
    "He specifically implored Democratic U.S. Sens.",
    "“We did the drought contingency plan.",
    "We will protect public safety.",
    "I agree with a lot of that.",
    "Like what you're reading?",
    "We will not back down.",
    "“Fantastic things.",
    "Local\nGov."
  ]
}