{
  "id": 4538,
  "mediaId": 2658,
  "date": "2022-01-14",
  "headline": "U.S. has intel about possible Russian false-flag op",
  "image": "https://static.politico.com/7f/9f/b2b739fd4f1893408b44e3fdceab/ap601192167125.jpg",
  "link": "https://www.politico.com/newsletters/national-security-daily/2022/01/14/us-has-intel-about-possible-russian-false-flag-op-495739",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1640,
    1846,
    3351,
    3180,
    4905,
    6175,
    6678,
    6672,
    6569
  ],
  "sentences": [
    "The Office of Special Counsel concluded in a report last November Pompeo violated the Hatch Act “by changing [State Department] policy to allow himself to speak at the convention and then, when engaging in political activity by delivering that speech, using his official authority by repeatedly referencing the work of the State Department.”\nIn a letter to Blinken, CREW President NOAH BOOKBINDER wrote that if Pompeo’s policy change “remains in effect, it leaves a clear impression that the State Department endorses an incumbent Secretary of State’s use of his official authority to further the partisan political interests of the incumbent president, and provides a dangerous precedent for future administrations seeking to manipulate the business of the government, including U.S. foreign policy interests, in pursuit of partisan ends.”\nTransitions\n— MICAH SPANGLER is now deputy director of the United Nations Information Center Washington, the official outpost of the U.N. Secretariat in Washington, D.C.",
    "ANDRIY YERMAK, head of the office of Ukrainian President VOLODYMYR ZELENSKYY, said during a Friday Atlantic Council event that a new Russian invasion “will be [a] big tragedy, and it will be [a] big war,” because most Ukrainians “will fight against aggressors.”\nThe Inbox\nCYBERATTACK TARGETS UKRAINIAN GOVERNMENT WEBSITES: Ukrainian officials are investigating who’s responsible for a cyberattack that left several government websites temporarily unavailable Friday, per the AP’s YURAS KARMANAU, FRANK BAJAK and DASHA LITVINOVA — although Ukraine’s Information Ministry said “the first data suggests that the attack was carried out by the Russian Federation.”\nUkraine’s Foreign Ministry spokesman OLEG NIKOLENKO noted there’s “a long record of Russian cyber assaults against Ukraine in the past.” According to the AP, the hacked websites “contained a message in Ukrainian, Russian and Polish, saying that Ukrainians’ personal data has been leaked into the public domain.",
    "Democratic leaders want to use legislation from Foreign Relations Chair BOB MENENDEZ (D-N.J.) as the vehicle, and Majority Leader CHUCK SCHUMER (D-N.Y.) said late Thursday night he’s open to “reasonable additions and modifications.”\nEnter Sen. MARCO RUBIO (R-Fla.), who laid down his own plan Friday morning that would require the Director of National Intelligence to report to Congress every 20 days on whether Russia has violated Ukraine’s “territorial integrity” — and, if so, trigger a cascade of crushing sanctions targeting top Russian officials and industries, including on Putin himself.",
    "— with RAHMATULLAH AMIRI, PALWASHA KAKAR, ASFANDYAR MIR, ANDREW WATKINS and SCOTT WORDEN”\n— The Government Executive Media Group, 1 p.m.: “Power Mission Success with Secure Collaboration — with WYN ELDER, AARON LEVIE and KORIE SEVILLE”\n— The United States Navy Memorial, 2 p.m.: “SITREP Speaker Series featuring the Honorable CARLOS DEL TORO, 78th Secretary of the Navy”\n— The George Washington University Elliott School of International Affairs, 3 p.m.: “Catastrophic Success: Why Foreign-Imposed Regime Change Goes Wrong — with ALEXANDER DOWNES”\nHave a natsec-centric event coming up?",
    "It’s worth noting that CHOI JONG-KUN, South Korea’s vice minister of foreign affairs, tweeted a Jan. 12 Los Angeles Times op-ed titled, “What failed U.S.-North Korea nuclear talks can teach us about negotiating with Iran.” The authors, former Defense Secretary WILLIAM PERRY and PHILIP YUN, argue that their experience negotiating with North Koreans leads them to believe that “now is the best — and likely only — opportunity” to strike a deal with Iran before it acquires a nuclear weapon.",
    "Not everyone agrees the equipment will imminently be used in battle: “Some other officials and analysts suspect, however, that Russian President VLADIMIR PUTIN is using the new military movements to pursue a strategy of keeping the West guessing about what he will do next, while simultaneously building negotiating leverage.”\nTo date, U.S. officials continue to say they don’t know if Putin truly plans to invade or not.",
    "“Russia is laying the groundwork to have the option of fabricating a pretext for an invasion, including through sabotage activities and information operations, by accusing Ukraine of preparing an imminent attack against Russian forces in Eastern Ukraine,” Sullivan told reporters at the White House on Thursday, promising the administration would share more details within the next 24 hours.",
    "“Witnesses said they heard the embassy’s C-RAM defense system — supposed to detect and destroy incoming rockets, artillery and mortar shells — during the attack.”\nThe rocket launches are the latest ina spate of attacks on American positions in Iraq converging around the two-year anniversary of the assassination of Iranian Revolutionary Guard Corps leader QASSEM SOLEIMANI.",
    "Keystrokes\nRUSSIA ARRESTS RANSOMWARE HACKERS: The Federal Security Service, Russia’s domestic security agency, has arrested 14 alleged members of the REvil ransomware gang, “seizing more than a million dollars in U.S. currency, euros, bitcoin and rubles, as well computer equipment and 20 luxury cars,” per The Washington Post’s ROBYN DIXON and ELLEN NAKASHIMA.",
    "“If our proposals are rejected … we will make a decision on how to ensure our security in a reliable way,” adding that Russian officials “have run out of patience.”\nThe Ukrainian government also released a statement Friday indicating it has intelligence that Russian troops are preparing \"provocations\" against other Russian armed forces to inculpate Ukraine.",
    "In a filing posted by the Federal Aviation Administration, reported on by our own ORIANA PAWLYK, the agency dryly observed that its design standards for commercial cargo planes \"did not envisage that a design feature could project infrared laser energy outside the airplane\" and therefore it sought special approval for this \"novel design feature.\"",
    "Broadsides\nWATCHDOG GROUP WANTS POMPEO POLICY CHANGE REVERSED: Citizens for Responsibility and Ethics in Washington (CREW) is demanding that SecState Blinken restore a long-standing department policy altered in August 2020 by his predecessor, MIKE POMPEO, that restricted the political activity of the department’s political appointees.",
    "“We share your view that Iran must never be allowed to develop or acquire nuclear weapons, but we do not believe that any sanctions on Iran should be lifted or suspended that result in the release of frozen funds until all outstanding judgments and pending claims against Iran and the IRGC have been fully satisfied,” the letter reads.",
    "SHERMAN COMMENT EXPLAINED: During a Monday news conference, Deputy Secretary of State WENDY SHERMAN made a comment that perked up NatSec Daily’s collective ears: “The Russians addressed the concerns that we had that led to the ultimate demise of the INF treaty,” she said, in reference to the Intermediate Nuclear Forces Treaty.",
    ": “CIA-trained Ukrainian paramilitaries may take central role if Russia invades”\nTuesday Today\n— The Atlantic Council, 10 a.m.: “SOS Ukraine: A conversation with BERNARD-HENRI LÉVY — with BENJAMIN HADDAD and MELINDA HARING”\n— The United States Institute of Peace, 10 a.m.: “Is Governance the Taliban’s Achilles Heel?",
    "The hacking group and its former associates are believed to have perpetrated several high-profile cyberattacks over the past year — including the attacks on the Colonial Pipeline and meat processor JBS last May, and on software provider Kaseya last July — that elevated the issue of ransomware in the United States.",
    "This is for your past, present and future,’ the message read, in part.”\nUkraine’s State Service of Special Communication and Information Protection reported that no personal data had been leaked, and the State Service of Special Communication assessed that no critical infrastructure was affected.",
    "“The FedEx missile-defense system directs infrared laser energy toward an incoming missile, in an effort to interrupt the missile’s tracking of the aircraft’s heat.”\n“FedEx applied to acquire the capability in 2019; Friday's notice lays out the proposed technology and seeks comments about it.",
    "MICHAEL McFAUL, the former U.S. ambassador to Russia, simply said the statement was “interesting.”\nSo your friendly neighborhood newsletter team asked State Department spokesperson NED PRICE about it, specifically asking if Russia had done anything materially to assuage America’s worries.",
    "U.S. has intel about possible Russian false-flag op\nBy ALEXANDER WARD and QUINT FORGEY\n01/14/2022 03:57 PM EST\nSend tips | Subscribe here | Email Alex | Email Quint\nProgramming Note: We’ll be off this Monday for Martin Luther King Jr. Day, but back in your inboxes on Tuesday, Jan. 18.",
    "Flashpoints\nNORTH KOREA FIRES MORE MISSILES: North Korea launched its third and fourth ballistic missiles less than two weeks after the United States imposed sanctions on Pyongyang’s weapons programs for its tests earlier this month, per Reuters’ JOSH SMITH and HYONHEE SHIN.",
    "Biden memorably asked Putin to crack down on cybercriminals when the two leaders met for their summit in Geneva last June, “but Friday’s arrests are Russia’s first major operation to halt Russia-based ransomware attacks around the globe,” Dixon and Nakashima write.",
    "In the end, six Democrats — many of them vulnerable to GOP challengers in November — and all Republicans but one backed the legislation, falling short of the requisite 60 votes,” wrote our own ANDREW DESIDERIO, who was on the scene to witness the vote last night.",
    "“In our view, Iran’s frozen funds should go first to the regime’s American victims before a single dollar goes to the regime itself.”\nIn recent weeks the U.S., Iran and European nations have signaled that there’s been some small progress in nuclear-deal talks.",
    "“Russia began moving tanks, infantry fighting vehicles, rocket launchers and other military equipment westward from their bases in its Far East,” they wrote, citing U.S. officials and experts who say the equipment is almost certainly headed for Ukraine.",
    "On the Hill\nSENATE STRUCK DOWN CRUZ’S NS2 BILL: It finally happened: After months of bluster, nominee blocks and negotiations, Sen. TED CRUZ (R-Texas) finally got his vote on reimposing sanctions on the Nord Stream 2 gas pipeline — and he lost.",
    "The European Union called for its Political and Security Committee to gather for an emergency meeting, and the bloc’s chief diplomat said member states involved in a joint military project on cyber defense would be asked to provide assistance.",
    "VETS, FAMILIES DON’T WANT MONEY SENT TO IRAN: U.S. military veterans and their families pleaded with the Biden administration not to unfreeze Iranian funds until victims of Iranian attacks receive compensation, NBC News’ DAN DE LUCE reported.",
    "The intel suggests that this group might “carry out acts of sabotage against Russia’s own proxy-forces,” thereby providing the Kremlin a convenient excuse to send some or all of its 100,000 troops stationed outside of Ukraine over the border.",
    "“More than 1,000 veterans and family members of those killed or wounded in bombings and other attacks in Iraq and elsewhere asked President JOE BIDEN in a letter to meet with some of the families whose loved ones were killed,” De Luce wrote.",
    "RUSSIAN WEAPONRY MOVES TOWARD UKRAINE: While Russians were moving their mouths in Europe, the Kremlin was moving weaponry closer to Ukraine this past week, the Wall Street Journal’s WARREN STROBEL, MICHAEL GORDON and NANCY YOUSSEF reported.",
    "“The nearly party-line vote, 55-44, came after an aggressive effort by the Biden administration to limit Democratic defections on the legislation, which the White House viewed as a bid to undercut its strategy to deter a Russian invasion.",
    "The Biden administration responded Wednesday with sanctions targeting six North Koreans, along with one Russian and a Russian firm that it said were responsible for procuring goods for Pyongyang’s weapons programs from Russia and China.",
    "Top U.S. officials, including national security adviser JAKE SULLIVAN and Secretary of State ANTONY BLINKEN, in recent days previewed that the U.S. had information suggesting that Moscow was setting the stage for another incursion.",
    "What to Read\n— FRIDA GHITIS, CNN: “Opinion: Putin’s big miscalculation”\n— RYAN GRIM, The Intercept: “Former Ambassador on Haitian President in March: ‘Put Him Aside’ and Embrace ‘Prime Minister Option’”\n— ZACH DORFMAN, Yahoo!",
    "While you’re at it, follow the rest of POLITICO’s national security team: @nahaltoosi, @woodruffbets, @politicoryan, @PhelimKine, @BryanDBender, @laraseligman, @connorobrienNH, @paulmccleary, @leehudson and @AndrewDesiderio.",
    "She also told reporters that she briefed Defense Secretary LLOYD AUSTIN on a classified program on asymmetrical methods to counter China’s hypersonic weapons that should be funded in the upcoming budget.",
    "Amid the fallout from the hack, NATO Secretary-General JENS STOLTENBERG also announced that the military alliance is set to sign “an agreement on enhanced cyber cooperation” with Ukraine, Cerulus writes.",
    "Russian Foreign Minister SERGEY LAVROV added more fuel to the fire Friday, saying the Kremlin wants the U.S. and NATO to accept its demands, namely that Ukraine and Georgia will never join the alliance.",
    "Democrats have signaled an eagerness to pass Menendez’s bill as soon as next week, but that will require support from Republicans — some of whom have already indicated they’re open to Menendez’s plan.",
    "The Russian military plans to start these activities “several weeks” before a potential invasion, which is estimated to begin sometime between mid-January and mid-February, the official continued.",
    "On Friday, chief Pentagon spokesperson JOHN KIRBY said the intelligence was “very credible.”\nThe revelation comes after a week of talks in Europe between the United States, its allies and Russia.",
    "“Pro-Iran Shiite factions in Iraq have vowed revenge for Soleimani’s killing and have conditioned the end of the attacks on the full exit of American troops from the country,” Abdul-Zahra noted.",
    "“At the present time, we’re facing a crisis in European security,\" MICHAEL CARPENTER, America’s ambassador to the Organization for Security and Cooperation in Europe, told reporters Thursday.",
    "noted that Pentagon Chief Technology Officer HEIDI SHYU on Thursday said there will be a “significant increase” in funding in the fiscal 2023 budget request for hypersonic weapons testing.",
    "The Biden administration has information indicating Russia might soon launch a false-flag operation to provide a pretext for an invasion of Ukraine, a U.S. official told NatSec Daily.",
    "“The intelligence community has not made an assessment that the Russians have definitively decided to take a military course of action in Ukraine,” Sullivan told reporters Thursday.",
    "DRINKS WITH NATSEC DAILY: At the end of every long, hard week, we like to highlight how a prominent member of Washington’s national security scene prefers to unwind with a drink.",
    "But when he’s not toasting the big 6-0, you can find McCaul in Washington at the Capitol Hill Club sipping a glass of red wine, preferably delivered by his favorite server, Fifi.",
    "This space is reserved for the top U.S. and foreign officials, the lawmakers, the lobbyists, the experts and the people like you who care about how the natsec sausage gets made.",
    "U.S. EMBASSY IN IRAQ ATTACKED: Multiple rockets were fired Thursday at the Green Zone in Baghdad housing the U.S. Embassy to Iraq, the Associated Press’ QASSIM ABDUL-ZAHRA.",
    "Even though Cruz’s bill failed, the Senate is still trying to pass some sort of conditional sanctions bill that can garner bipartisan support, Desiderio told NatSec Daily.",
    "South Korea’s Joint Chiefs of Staff said it detected what it believed to be a pair of short-range ballistic missiles launched eastward, near the North Korea-China border.",
    "Pompeo changed the policy ahead of his pre-recorded speech at the 2020 Republican National Convention, which was delivered while he was on official travel to Israel.",
    "Stewart is global head of product security strategy at Google, and Zabierek is executive director of the Cyber Project at Harvard Kennedy School’s Belfer Center.",
    "Meanwhile, European leaders rushed to help shore up Ukraine’s cybersecurity services, per POLITICO’s LAURENS CERULUS, JACOPO BARIGAZZI and DAVID HERSZENHORN.",
    "Today, we’re featuring Rep. MICHAEL McCAUL (R-Texas), the House Foreign Affairs Committee’s top Republican, who tonight will celebrate his 60th birthday.",
    "“In recent years, in several incidents abroad, civilian aircraft were fired upon by man-portable air defense systems (MANPADS),” FAA said in its filing.",
    "Shyu also shared that she has asked U.S. industry to consider using other materials or propulsion systems to drive down the cost of hypersonic weapons.",
    "“NATO cyber experts in Brussels have been exchanging information with their Ukrainian counterparts on the current malicious cyber activities.",
    "When in Austin, he’ll take that wine to the patio — which overlooks Lake Austin and the downtown skyline — and savor it alongside his wife.",
    "“Nothing beats watching the sunset on a beautiful Austin night with my beautiful wife and a great glass of red wine,” he told NatSec Daily.",
    "The latest launch comes after North Korea fired what its state media claimed to be two hypersonic missiles in tests on Jan. 5 and Jan. 11.",
    "The plan is to meet up with family at the historic Headliners Club in Austin and enjoy some champagne — appropriate for such an occasion.",
    "Per the official, Russia has already placed a group of operatives “trained in urban warfare and in using explosives” in eastern Ukraine.",
    "— JOE KASPER, former staffer for former HASC Chair DUNCAN HUNTER, has been promoted to managing director at Ervin Graves Strategy Group.",
    "And thanks to our editor, Ben Pauker, who we suspect runs false-flag operations to seize more power over this newsletter for himself.",
    "Aim your tips and comments at award@politico.com and qforgey@politico.com, and follow us on Twitter at @alexbward and @QuintForgey.",
    "Another hit a school located in a nearby residential complex,” Abdul-Zahra wrote, noting a girl and woman were hurt in the attack.",
    "Evil didn’t get sharks with lasers on their heads, NatSec Daily suspects his next idea would be putting lasers on FedEx planes.",
    "Allied experts in [the] country are also supporting the Ukrainian authorities on the ground,” Stoltenberg said in a statement.",
    "Because the system is beyond the design scope of FAA certification, it requires a special condition approval, the notice said.",
    "He took a three-month leave of absence from the U.N. Foundation to assume the temporary post and is a MITT ROMNEY 2012 alum.",
    "Four rockets were launched: “Three of the missiles struck within the parameters of the American Embassy, the officials said.",
    "This bill obviously won’t pass as a standalone, but it could get roped into Menendez’s legislation in some shape or form.",
    "RAPHAEL WARNOCK of Georgia, MAGGIE HASSAN of New Hampshire, CATHERINE CORTEZ MASTO of Nevada and MARK KELLY of Arizona.",
    "Shoot us an email at award@politico.com or qforgey@politico.com to be featured in the next edition of the newsletter.",
    "Japanese media reported that the missiles appeared to have landed in the sea outside Japan’s exclusive economic zone.",
    "In an email, he simply said: “No, she meant they spoke to the concerns.”\nIn other words, both sides talked about it.",
    "Should America reenter the accord, the expectation is that it will once again lift sanctions reimposed in 2018.",
    "After Alex tweeted that remark earlier this week, experts started guessing what the top diplomat really meant.",
    "U.S. Indo-Pacific Command said the launch did not pose an immediate threat to the United States or its allies.",
    "CODEL TO UKRAINE: Desiderio also scooped that four Senators will head to Ukraine over the long weekend: Sens.",
    "Of the six Democrats who backed Cruz’s bill, four are facing difficult reelection fights in November: Sens.",
    "The Ministry of Digital Transformation also said “a large part” of the hacked websites had been restored.",
    "The deal will allow Ukrainian security services access to NATO’s capabilities to defend their networks.",
    "JEANNE SHAHEEN (D-N.H.), ROB PORTMAN (R-Ohio), CHRIS MURPHY (D-Conn.) and KEVIN CRAMER (R-N.D.).",
    "The Complex\n‘SIGNIFICANT INCREASE’ FOR HYPERSONICS: Our friends at Morning Defense (for Pros!)",
    "“We saw this playbook in 2014 with Crimea.”\nCNN first reported on the obtained intelligence.",
    "Little progress was made, leading officials to express their pessimism out in the open.",
    "The proposed infrared laser system is intended to fool missiles fired from the ground.",
    "She noted that reps have also pledged to further automate the manufacturing process.",
    "\"The drumbeat of war is sounding loud, and the rhetoric has gotten rather shrill.\"",
    "JACKY ROSEN of Nevada and TAMMY BALDWIN of Wisconsin also backed the legislation.",
    "The infrared system must meet the FAA’s airworthiness standards,” Pawlyk wrote.",
    "Follow us on Twitter\nAlex Ward @alexbward\nQuint Forgey @QuintForgey\nFollow Us",
    "— CAMILLE STEWART and LAUREN ZABIEREK have joined New America as fellows.",
    "Transitioning to a new defense-adjacent or foreign policy-focused gig?",
    "Specifically what was discussed, though, we still don’t know.",
    "WELCOME TO THE WEEKEND: Thanks for tuning in to NatSec Daily.",
    "He particularly likes to pair that vino with some prime rib.",
    "‘Be afraid and expect the worst.",
    "That may soon be a reality.",
    "LASERS FOR FEDEX PLANES?",
    "Cheers, Congressman!",
    "Democratic Sens.",
    "Your move, UPS.",
    "IT’S FRIDAY.",
    "What next?",
    ": If Dr."
  ]
}