{
  "id": 4548,
  "mediaId": 8475,
  "date": "2022-01-13",
  "headline": "Dear Sens. Sinema & Kelly: 8 reasons the filibuster must end & 1 way to fix it",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/011322_capitol.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/opinion/report/011322_kelly_sinema_filibuster_op/dear-sens-sinema-kelly-8-reasons-filibuster-must-end-1-way-fix-it/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Blake Morlock",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/28262",
  "termIds": [
    0
  ],
  "sentences": [
    "Sen. Sinema, you said in your speech today, \"Congress was designed to bring together Americans of diverse views, representing different interests and – as a collective – to find compromise and common ground to serve our country as a whole.\"",
    "So the House and Senate, therefore, are free to ignore crises and challenges and remain in office blaming inaction on the recalcitrant opposition you knew would be there as soon as you promised to get something done.",
    "No honeymoon\nYou talk about grand Senate traditions but one of them long dead was called “the presidential honeymoon.” You had to be around during the Ronald Reagan years to understand that this was an actual thing.",
    "You are training the electorate to say \"We are done waiting for the elaborate mechanisms of power to unscrew themselves, what we really need is a strong man or strong woman to act unilaterally and rule by fiat.",
    "\"These deepening divisions hurt our ability to work together to create new job opportunities, protect the health and safety of our communities and country, and to ensure everyday families get ahead,\" you said.",
    "I'm here, though, to light a candle rather than just curse the darkness, so I will offer a plan a bit outside the box to save the filibuster but allow elections of both parties to have consequences.",
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nDemocracy is bigger than my narcissism.",
    "Sen. Sinema, you have called the filibuster a “guard-rail against democracy.” I get what you mean: The majority should not govern us all with the passions of any particular moment.",
    "If you were truly being the new John McCain, you would do what he did with the Obamacare repeal and stand up for regular order (the School House Rock version of federal lawmaking).",
    "And let’s talk about what we are really truly talking about: The filibuster means federal elected officials can campaign on anything because they know it carries no cost.",
    "What neither of you could do in the absence of a filibuster is pretend to be for something like voting rights but hide behind the filibuster to defeat popular measures.",
    "When you sacrifice lawmaking on the alter of \"bipartisanship\" what you are doing is relegating law itself to second-class status behind rules made by a single person.",
    "Blake Morlock is an award-winning columnist who worked in daily journalism for nearly 20 years, and as a communications director for the Pima County Democratic Party.",
    "Whether you know it or not, senators, by assuming for yourself the ultimate power to decide what’s what, you are screwing the institution you claim to hold dear.",
    "The honeymoon was a social convention that granted a new president a certain amount of time and deference to enact the policy proposals that got them elected.",
    "Once per session (each calendar year), the vice president serving as presiding officer of the Senate is allowed to unilaterally move one bill to a full vote.",
    "The Articles created a unicameral legislature, and passing any law required 9 of 13 votes, as each state sent one representative to serve in the government.",
    "There's a way around it that doesn't involve all this weedy nuance involving carve-outs, talking filibusters, 41-to-stop or all these other arcane options.",
    "Republicans are free to cut taxes through reconciliation (as intended), appoint judges with simple majorities and loosen regulations with executive action.",
    "Hey, you support universal health care but protecting the filibuster means you will never have to vote for dirty details required to cover every American.",
    "But it's been used to justify drilling in the Alaska National Wildlife Reserve and been touted as a way to provide immigrants with a path to citizenship.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "It’s called reconciliation because it was intended to allow senators to move numbers around to reconcile them with an original budget measure.",
    "The rules would have to be worked out where it's not some all-encompassing law that lumps 30 things into a single bill, but that's doable.",
    "Sen. Sinema, you took the the floor Thursday and delivered a speech saying that our divisions are too deep to govern along party lines.",
    "I would tell them to tell the White House not so much as your secretary of state will be confirmed until the senate runs by majority.",
    "By dealing the U.S. Congress out of policy making, what you are telling voters is to only look to the presidency to make the rules.",
    "If I were advising progressives, I would tell them the next time they take power to insist on immediately killing the filibuster.",
    "That is completely antithetical to the whole notion of separation of powers that really undergird U.S. constitutional democracy.",
    "Sen. Sinema, you have implied that somehow the super-majority requirement to get anything done is foundational to the republic.",
    "Sen. Sinema, you have declared your opposition to a carve-out for the 60-vote filibuster requirement to pass this legislation.",
    "Reconciling reconciliation\nThe one end run around the filibuster is over-used and, frankly, a terrible way to pass new policy.",
    "Therefore, the office of the president has an imperative to over-interpret federal law to give the presidency maximum reach.",
    "The cure for democracy is not ending the divisions but giving the people the power to choose and to have that choice matter.",
    "Bipartisanship is still there\nNothing is stopping either of you from still insisting on bipartisanship to move legislation.",
    "Increasingly, it's building up presidential executive orders and the courts rulings as the sole arbiters of policy-making.",
    "The U.S. Constitution was written because the Articles of Confederation, established shortly after the Revolution, failed.",
    "They rather intentionally set the threshold for approving new laws at simple majorities in each of two legislative houses.",
    "How many decades have Republicans promised to shrink the size of government only to fail at it every time they got power?",
    "That should scare the hell out of conservatives and progressives because the power of the presidency is escaping the lab.",
    "Far from forcing bipartisanship, what the filibuster has become is a tool for the opposition to clean up during midterms.",
    "That's why they established a three-lock box for democracy (they had nothing to do with that insipid Sammy Hagar song).",
    "But that's the price we pay for living in a free society where I rub elbows with people who support policies I hate.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "The country can then see if the ideas work or don't and make their next decisions at the ballot box accordingly.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "The filibuster gives the losing party in a presidential election year a veto over the new majority's success.",
    "The Sinema-Kelly Plan\nI say dump the whole thing but that may be too much to ask and it may not be necessary.",
    "I'm willing to pay it to protect the whole system from collapsing the way the Articles of Confederation did.",
    "It was not meant to start an entire new federal child care program or to re-imagine the health care system.",
    "The Senate gives twice the power to the Dakotas as it does to California and members serve six-year terms.",
    "And one partisan exclamation point\nAt some point the Republicans are going to have to undo the filibuster.",
    "The presidency is also just a single lock to pick and it is often done with a minority of voters support.",
    "So I'm going to lay out 8 nonpartisan reasons the filibuster must go, that are not tied to any one issue.",
    "It’s an insurance policy both parties take out to make sure that no election has any real consequences.",
    "Reconciliation is just the only way to get anything done and it can only be done once per budget year.",
    "Executive orders are limited to governing executive departments and how they interact with the public.",
    "Liberals — the next generation — are learning to play the kind of hardball the Boomers and Xers avoid.",
    "Killing the filibuster will become a litmus test for any Democrat running in a primary for the Senate.",
    "As long as the prospect lacks 60 votes, you will never have to deal with the fallout of deregulation.",
    "Republicans must do it themselves to give themselves some runway for governing in ways they see fit.",
    "You, senators, are worried about a runaway legislative process of the minority getting steamrolled.",
    "However, Democrats have noticed that anything they want to see get done will fail the 60-vote test.",
    "However, President Joe Biden can say anyone who interacts with a federal agency must be vaccinated.",
    "How long can that go on before we are no longer a nation of laws but a nation ruled by one person?",
    "The divide in this country all but assures neither party will ever get to 60 votes in the Senate.",
    "This would allow a new president and majority to pass four priorities promised to constituents.",
    "I'm shocked people aren't talking more about the Articles of Confederation during this debate.",
    "In fact, the republic was started in part because the founders found that approach unworkable.",
    "Four legislative victories in a term would be a solid legislative record for any president.",
    "Republicans might actually support this plan because they might want to pass laws someday.",
    "With gerrymandering, though, even the House representation is skewed in undemocratic ways.",
    "It’s kind of like if your left knee goes hinky, you damage the right knee by overusing it.",
    "The people think the system serves itself, as opposed to serving the nation it represents.",
    "I feared whiplash, but mostly I feared what would happen when people I opposed took over.",
    "Hell, we still have the Tennessee Valley Authority, for the love of all that's Roosevelt.",
    "Hell, it's making the entire lawmaking regimen prescribed by the Constitution irrelevant.",
    "If I were a Republican strategist I would urge them to do it the moment they took power.",
    "All that careening you worry about is being done with the stroke of a presidential pen.",
    "You are more likely to get it, too, if Republicans think something is going to happen.",
    "You've trained the people to get used to the government failing over and over again.",
    "Worse, they’ve figured out they can use that 40-vote veto to make the majority fail.",
    "How many times have Democrats promised climate action to watch nothing get done?",
    "There were several reasons it fizzled but one was a super-majority requirement.",
    "So senators such as yourselves can fail over and over again and get re-elected.",
    "You can promise action to the base and then tell the swing voters “Don’t worry.",
    "The problem is that minorities have a veto over all regular order legislation.",
    "You can still do that on any issue you would like, including voting rights.",
    "Did the Senate Judiciary Committee ever give you a Blue Slip, Sen. Sinema?",
    "The filibuster is making the U.S. Senate irrelevant to the policy process.",
    "The Framers were smart enough to know half minus one could be pissed off.",
    "What's done by a super-majority can't be undone by a simple majority.",
    "When that happens, losing the filibuster is the least of our worries.",
    "That makes for a sweet gig but it also tends to get capitols stormed.",
    "On the flip side, the filibuster protects senators from tough votes.",
    "You can promise to eliminate entire agencies for smaller government.",
    "Checks on democracy are covered quite nicely without the filibuster.",
    "The U.S. economy has undergone a massive transformation since 1990.",
    "While bipartisanship is an option, it's never been the only option.",
    "So, Republicans can see clearly the filibuster is on borrowed time.",
    "The first two arguments against the filibuster are Government 101.",
    "People I disagree with get to win and get to govern accordingly.",
    "Dictatorship training\nTalk about favoring one limb over another.",
    "You are compromising one Senate institution to protect another.",
    "They are isolated from the passions of moment most of the time.",
    "Just one of those bodies is inherently democratic – the House.",
    "Nothing will really happen.”\nAnd boy, has nothing gotten done.",
    "Let’s talk about what we’re talking about with the filibuster.",
    "It's why the Framers didn't include it in the Constitution.",
    "Otherwise, they are just going to get stampeded by donkeys.",
    "The plan you are free to steal from me is far more elegant.",
    "When they don’t, democracy stops affecting people’s lives.",
    "Concerned about keeping quality reporting alive in Tucson?",
    "Concerned about keeping quality reporting alive in Tucson?",
    "Sinema and Kelly, you can protect the filibuster for now.",
    "I'm used to legislatures enacting horror shows into law.",
    "What minority wouldn’t use that every chance they could?",
    "Moderates like yourself can be all things to all people.",
    "Kyrsten Sinema and Mark Kelly:\nHistory is in your hands.",
    "Two voting rights bills are heading to the Senate floor.",
    "Congress can't pass a vaccine mandate without 60 votes.",
    "When that happens, people stop caring about democracy.",
    "That thing you promised will never come up for a vote.",
    "I'm pretty sure rural electrification is a done deal.",
    "Support TucsonSentinel.com with a contribution today!",
    "Support TucsonSentinel.com with a contribution today!",
    "Again, this is not what was intended by the framers.",
    "The market has blind spots Democrats can't address.",
    "I'm going to take a shot that you might read this.",
    "Now he’s telling you things that the Devil won’t.",
    "Congress has failed to respond to those changes.",
    "Many Senate traditions have gone by the wayside.",
    "Requiring 60 votes stabilized the system of law.",
    "Opinion\nWhat the Devil won't tell you\nDear Sens.",
    "That's the price of freedom we all have to pay.",
    "Congress was designed for simple majority rule.",
    "And government remains as big as it always has.",
    "But Sen. Kelly, you aren't a solid yes either.",
    "The people are pissed that nothing gets done.",
    "The Founders were way ahead of you, senator.",
    "So long as we have a choice we are divided.",
    "I thought killing the filibuster was nutty.",
    "Sincerely,\nA freaked-out citizen columnist.",
    "That's absolutely not how it was designed.",
    "You get that democracy itself is divisive.",
    "I didn't change my mind in spite of that.",
    "Presidential elections aren’t democratic.",
    "Absolutely, the GOP will do stuff I hate.",
    "Just ask Presidents Gore and H. Clinton.",
    "For years I was with you on this issue.",
    "You teach government and serve in one.",
    "Everything else is mealy-mouthed B.S.\"",
    "The filibuster only makes that worse.",
    "The Framers learned it the hard way.",
    "That's the American social contract.",
    "Democracy doesn't have guard rails.",
    "Donate to TucsonSentinel.com today!",
    "Elections should have consequences.",
    "It can't move when it needs to go.",
    "I changed my mind because of that.",
    "It has a boot on its front wheel.",
    "That's the real cost of freedom.",
    "I beseech thee to reconsider.",
    "Super-majorities don’t work.",
    "Insurance policy\nC'mon guys.",
    "Besides, I live in Arizona.",
    "They didn't have 60 votes.",
    "Articles of Confederation.",
    "They didn't have 60 votes.",
    "You need to rethink that.",
    "I’m not bagging on them.",
    "7.Dealing out Congress.",
    "Feel free to steal it.",
    "That's half plus one.",
    "It's not their fault.",
    "It's not their fault.",
    "That doesn't change.",
    "It’s the smart play.",
    "I have a platform.",
    "You represent me.",
    "Nothing got done.",
    "So promise away.",
    "Three-lock box.",
    "You know this.",
    "It’s not.",
    "- 30 -",
    "Sens.",
    "No.",
    "2.",
    "1.",
    "8.",
    "3.",
    "4.",
    "5.",
    "6."
  ]
}