{
  "id": 4597,
  "mediaId": 6404,
  "date": "2022-01-15",
  "headline": "Hypocritical Democrats Pause Fight To End Filibuster In Order To Filibuster Bill From Ted Cruz",
  "image": "https://americanlookout.com/wp-content/uploads/2019/02/Chuck-Schumer-GND.jpg",
  "link": "https://americanlookout.com/hypocritical-democrats-pause-fight-to-end-filibuster-in-order-to-filibuster-bill-from-ted-cruz/",
  "mediaOutlet": "americanlookout.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike LaChance",
  "authorUrl": "https://americanlookout.com/author/aleister/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Blaze reports:\nDemocrats filibuster Nord Stream 2 sanctions bill, invoking tool ‘overwhelmingly used by racists’\nSenate Democrats on Thursday defeated an attempted by Republicans to impose sanctions on businesses tied to the Nord Stream 2 pipeline, which will carry natural gas from Russia to the German coast.",
    "But a majority in the United States Senate is not enough to pass bills, thanks to what former President Barack Obama has called a “Jim Crow relic.”\nYes indeed, Senate Democrats invoked the legislative filibuster to block Cruz’s bill from passing.",
    "The Senate voted 55-44 on legislation introduced by Sen. Ted Cruz (R-Texas) that would have ended the pipeline project, which is supported by Russian President Vladimir Putin and opposed by American allies in Ukraine.",
    "The Ukrainian government has called the pipeline “an existential treat to our security,” as Russia has amassed tens of thousands of troops on its border with Ukraine and is believed to be preparing to invade.",
    "), Catherine Cortez Masto (Nev.), Maggie Hassan (N.H.), Mark Kelly (Ariz.), Jacky Rosen (Nev.), and Raphael Warnock (Ga.), along with almost every Republican — Sen. Rand Paul (R-K.y.)",
    "Their use of a filibuster created a 60-vote threshold to pass the Nord Stream 2 sanctions, and the bipartisan majority of senators came up five votes short of passing the bill.",
    "They need to get rid of the filibuster in order to pass their sham voter reform bill because they don’t have enough votes to do it the right way.",
    "The pipeline would allow Russia to directly export natural gas to Western Europe, allowing energy to flow uninterrupted in the event of war.",
    "Trending: Steve Hilton: The Idea Of A Second Term For Joe Biden Is Absurd And Offensive (VIDEO)\nTheir hypocrisy is astounding.",
    "They suddenly found the filibuster very useful when they wanted to stop a bill from Ted Cruz.",
    "For months now, Democrats have been waging a campaign to do away with the Senate filibuster.",
    "They invoked a tool “overwhelmingly used by racists” to do so, according to academics.",
    "That didn’t stop Democrats from using the filibuster this week, however.",
    "being the lone GOP “no” vote — voted in support of Cruz’s bill.",
    "Another classic case of do as I say, not as I do.",
    "His sanctions bill had majority support.",
    "Tammy Baldwin (Wisc.",
    "Democratic Sens."
  ]
}