{
  "id": 4620,
  "mediaId": 2830,
  "date": "2022-04-20",
  "headline": "The Tennessee GOP Empire Strikes Back",
  "image": "",
  "link": "https://www.wsj.com/articles/the-tennessee-gop-empire-strikes-back-morgan-ortagus-donald-trump-primary-ballot-11650491295",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    0
  ],
  "sentences": [
    "Plus, the runoff election in France between Emmanuel Macron and Marine Le Pen enters its final days.Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nWe’ve told readers about the shenanigans in Tennessee, where state legislators recently tried to disqualify some candidates for Congress by passing a three-year residency requirement in the middle of an election cycle.",
    "WSJ Opinion: Biden's Title 42 Border FiascoPlay video: WSJ Opinion: Biden's Title 42 Border Fiasco\n Review & Outlook: Two million migrants have been turned away under Title 42 authority, and President Biden has no backup plan to control immigration when the health measure ends May 23.",
    "Photo: mandel ngan/Agence France-Presse/Getty Images\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (3 minutes)\nAD\nLoading advertisement...\n00:00 / 02:31\n1x\nThis article is in your queue.",
    "So naturally the GOP is engaging in some self-destructive behavior: Witness the spectacle in Tennessee, where the state party has booted a congressional candidate endorsed by Donald Trump off the primary ballot.",
    "As Russian forces escalate their offensive in Ukraine's Donbas region, Volodymyr Zelensky says the war would have been over already if allies had sent Ukraine the necessary weapons to win.",
    "Ms. Ortagus’s campaign has said she meets the party’s qualification requirements, one of which is having voted in three of the last four primary elections, and not merely in Tennessee.",
    "A sponsor of the residency bill, state Senator Frank Niceley, waded in with a nasty remark to NBC that: “I don’t think Trump cares one way or the other,” about the party’s moves.",
    "Candidates such as Morgan Ortagus, who moved to the state last year and is running for an open House seat in the fifth district, would thus be free to take her case to voters.",
    "Ms. Ortagus’s campaign says it’s evaluating next steps, but the best outcome would be for the state GOP to reverse its decision and swear off self-embarrassment.",
    "Open Queue\nThe November elections are looking good for Republicans, who can pound Democrats on everything from inflation to foreign policy.",
    "A candidate can also qualify if a party leader vouches for a candidate as a “bona fide” Republican, which by any measure Ms. Ortagus is.",
    "The Republican National Committee has been thinking about a 2024 convention in Nashville, but Milwaukee is looking better all the time.",
    "The bill became law without the Governor’s signature earlier this month, but state officials ruled it doesn’t apply retroactively.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nDoes Ukraine Have the Weapons to Win?",
    "But on Tuesday the state GOP’s executive committee voted to keep Ms. Ortagus and other candidates off the ballot.",
    "Images: Reuters/Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "WSJ Opinion: Biden's Title 42 Border Fiasco\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "0:00 / 4:43\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "She’s been endorsed by President Trump, who at least for these purposes is a Republican.",
    "I don’t think Trump cares.” Ms. Ortagus is Jewish, and the innuendo here is not subtle.",
    "This is the express lane to shrinking the Republican Party and losing elections.",
    "“I think Jared Kushner —he’s Jewish, she’s Jewish—I think Jared will be upset.",
    "She was a spokesman in the Trump Administration’s State Department.",
    "This was a naked effort to hamstring the political competition.",
    "Joe Biden has pledged more military aid, but is it too late?",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Morgan Ortagus in June 2020.",
    "Remarkably, it gets worse.",
    "Ivanka will be upset."
  ]
}