{
  "id": 4625,
  "mediaId": 8350,
  "date": "2022-04-19",
  "headline": "SW Arizona border crossings nearly 6 times higher than last year",
  "image": "https://ktar.com/wp-content/uploads/2022/04/getty-border-yuma-from-dec-10-2021.jpg",
  "link": "https://ktar.com/story/5015251/sw-arizona-border-crossings-nearly-6-times-higher-than-last-year/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KTAR.COM",
  "authorUrl": "https://ktar.com/story/author/ktar-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Immigration authorities had 149,110 migrant encounters in the Yuma Sector during the first six months of fiscal year 2022 (October 2021-March 2022), a whopping 589% increase from the first half of the previous fiscal year, according to data released this week.",
    "CBP’s nine Southwest border sectors across California, Arizona, New Mexico and Texas had more than 1 million migrant encounters over the last sixth months, an 83.8% year-over-year increase.",
    "The surge is expected to grow if the Biden administration goes through with a plan to lift a pandemic-era order that has been used to turn away asylum seekers more than 1.7 million times.",
    "PHOENIX – Migrant crossing attempts are surging across the U.S.-Mexico border, but the largest increase by far is in southwestern Arizona, according to U.S. Customs and Border Protection.",
    "Human rights groups and other migrant advocates say the U.S. has a legal obligation to permit people to seek asylum and have called for the lifting of the public health order.",
    "Title 42 has been used to deny migrants a chance to seek asylum to mitigate the spread of COVID-19 since it went into effect under the Trump administration in March 2020.",
    "Mark Kelly and Kyrsten Sinema, are trying to convince Biden to keep Title 42 in place until there’s a plan in place to handle the predicted influx of asylum seekers.",
    "Tucson Sector authorities had 122,619 migrant encounters from October-March, up 52.9% from the same period a year earlier.",
    "With COVID-19 cases in decline, the Biden administration has said it intends to end the policy on May 23.",
    "Southern Arizona has two Customs and Border Protection sectors, Yuma to the west and Tucson to the east.",
    "Del Rio, Texas, was the only other sector with a triple-digit increase, at 184.5%.",
    "Some Democrats in Congress, however, including Sens.",
    "The Associated Press contributed to this report.",
    "Share\nComments"
  ]
}