{
  "id": 4631,
  "mediaId": 2830,
  "date": "2022-04-20",
  "headline": "Handing Putin the Nuclear Advantage",
  "image": "",
  "link": "https://www.wsj.com/articles/handing-vladimir-putin-the-nuclear-advantage-joe-biden-pentagon-sea-launched-nuclear-cruise-missile-russia-11650487990",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    0
  ],
  "sentences": [
    "Plus, Joe Biden announces another $800 million of military aid for Ukraine.Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nThis weapon is aimed at deterring a known risk: Russia’s up to 2,000 tactical nukes, including weapons “employable by ships, planes, and ground forces,” as the Pentagon’s 2018 Nuclear Posture Review noted.",
    "The Russian nuclear inventory includes “air-to-surface missiles, short range ballistic missiles, gravity bombs, and depth charges for medium-range bombers, tactical bombers, and naval aviation, as well as anti-ship, anti-submarine, and anti-aircraft missiles and torpedoes for surface ships and submarines,” and more.",
    "WSJ Opinion: The Goal in Ukraine Should Be VictoryPlay video: WSJ Opinion: The Goal in Ukraine Should Be Victory\n Wonder Land: If President Biden is willing to say the Russians are committing genocide in Ukraine, why won't he say his goal there is to defeat Russia or Vladimir Putin?",
    "The head of U.S. Strategic Commandhas warned of a “deterrence and assurance gap.” Chairman of the Joint Chiefs General Mark Milley said he thinks “this president or any president deserves to have multiple options to deal with national security situations.” Good advice.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nThe Crack in America's Nuclear Deterrence\nDon't discount the possibility that Vladimir Putin could drop a tactical nuclear weapon in Eastern Europe, the CIA director recently warned.",
    "The Trump Administration said the U.S. might reconsider the SLCM-N if “Russia returns to compliance with its arms control obligations, reduces its non-strategic nuclear arsenal, and corrects its other destabilizing behaviors.” How’s that working out?",
    "Which brings us to another point: If allies perceive the U.S. either can’t or won’t respond if they’re attacked by Russia or North Korea or someone else, they will develop their own nuclear deterrent.",
    "In this handout photo released by Roscosmos Space Agency Press Service on Wednesday, April 20, 2022, the Sarmat intercontinental ballistic missile is launched from Plesetsk in Russia's northwest.",
    "Photo: /Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (5 minutes)\nAD\nLoading advertisement...\n00:00 / 04:30\n1x\nThis article is in your queue.",
    "“The U.S. comes to the defense of its NATO ally, but as American troops flow forward, Russia uses a tactical nuclear weapon on a U.S. carrier group in the Baltic Sea, killing a few thousand.",
    "It would also be useful in dissuading China from using a nuke on Taiwan, without the longer and fraught debate of, say, putting American nuclear weapons on Japanese soil.",
    "Nuclear weapons are a grim reality of modern life, but they are more likely to be used if adversaries believe the U.S. and NATO lack an adequate nuclear deterrent.",
    "Enter the SLCM-N, which would be less of an escalation than reaching for the ballistic subs and could strike much faster than calling in strategic bombers.",
    "Images: AFP/Getty Images/Sputnik/Reuters/Roscosmos Space Agency Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "He sees his arsenal as an advantage he can exploit to bully the West into backing down, and he’s willing to accept risks Western leaders would not.",
    "So why does President Biden's budget propose to cancel a U.S. cruise missile that could launch a similar American nuclear weapon from a submarine?",
    "This missile is considered a “tactical” nuclear weapon that has a lower yield than “strategic” options and might be used on battlefield targets.",
    "Open Queue\n Vladimir Putin has made veiled threats about using nuclear weapons in Ukraine, and the Biden Administration says it is worried.",
    "The U.S. recently deployed a low-yield nuclear weapon on ballistic-missile submarines, but America has only about a dozen of these subs.",
    "Now Mr. Biden is surrendering this leverage—probably to placate progressives who are opposed to nuclear weapons as an article of faith.",
    "Several U.S. flag officers have told Congress they think the country needs the missile, and such candor from the brass is notable.",
    "If you were president, how would you respond?” The point is to force NATO into a choice between full nuclear war or surrender.",
    "This makes it all the more puzzling that President Biden is canceling a new weapon that would be a nuclear deterrent.",
    "The SLCM-N could serve as a deterrent without procuring large quantities or deploying it on every attack submarine.",
    "WSJ Opinion: The Goal in Ukraine Should Be Victory\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Message to Mr. Putin: If you drop a nuke on NATO soil, the alliance has the will and ability to respond in kind.",
    "The U.S. Navy had a nuclear-tipped Tomahawk missile during the Cold War that President Obama retired in 2010.",
    "But getting these tactical nukes to the target requires NATO pilots to penetrate sophisticated air defenses.",
    "NATO relies on gravity bombs stored across Europe to deter this behavior or respond if necessary.",
    "Many in Congress want to restore the SLCM-N in the military budget, and we hope they succeed.",
    "The latest Pentagon budget request nixes the sea-launched nuclear cruise missile, or SLCM-N.",
    "0:00 / 4:42\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Take the scenario our contributor Matthew Kroenig laid out in these pages in 2018.",
    "This is not some novel weapon, and it doesn’t abrogate U.S. treaty obligations.",
    "Mr. Putin is not afflicted by Western misgivings about nuclear weapons.",
    "The missile could be launched from submarines or destroyers.",
    "The SLCM-N could reduce proliferation at a volatile moment.",
    "The Trump Administration proposed the SLCM-N in 2018.",
    "This reduces the risk Mr. Putin will use a nuke.",
    "The risks of being shot down are significant.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Russia invades Estonia."
  ]
}