{
  "id": 4660,
  "mediaId": 8295,
  "date": "2022-04-22",
  "headline": "Los números fronterizos alcanzan el nivel más alto en 20 años, a medida que se avecina el fin del Título 42",
  "image": "https://cronkitenews.azpbs.org/wp-content/uploads/2022/04/rushvan-800.jpg",
  "link": "https://cronkitenews.azpbs.org/2022/04/22/los-numeros-fronterizos-alcanzan-el-nivel-mas-alto-en-20-anos-a-medida-que-se-avecina-el-fin-del-titulo-42/",
  "mediaOutlet": "cronkitenewsonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Por Reagan Priest/Cronkite Noticias",
  "authorUrl": "https://cronkitenews.azpbs.org/people/reagan-priest/",
  "termIds": [
    2459,
    1529,
    6171,
    5949
  ],
  "sentences": [
    "Al hacer el anuncio sobre el Título 42, el DHS dio a conocer un plan para encargarse del aumento esperado de nuevos casos de asilo que requiere nuevas instalaciones de detención, cambiando agentes según sea necesario para tratar a los migrantes, simplificando el sistema de procesamiento de asilo y trabajando con otros países para reducir cifras de migrantes.",
    "(Foto por Jerry Glaser/Aduanas y Protección Fronteriza)\nWASHINGTON – Los funcionarios fronterizos detuvieron a la mayor cantidad de migrantes en la frontera sur en al menos 22 años el mes pasado, lo que presenta un nuevo desafío para el plan de la administración Biden de poner fin a la ejecución del Título 42 dentro de unas semanas.",
    "Se produce cuando los legisladores de Arizona continúan rechazando el plan de la Casa Blanca para poner fin al Título 42, la regla de salud pandémica que permite a los funcionarios rechazar a los solicitantes de asilo en la frontera, en medio de temores de que la administración no podrá manejar el aumento posterior de migrantes.",
    "La senadora Kyrsten Sinema, demócrata por Arizona, es patrocinadora del proyecto de ley con Kelly para retrasar el levantamiento del Título 42, y los representantes demócratas de Arizona Tom O’Halleran de Sedona y Greg Stanton de Phoenix son patrocinadores de un proyecto de ley complementario en la Cámara de Representantes.",
    "Los agentes de la Patrulla Fronteriza usan equipo de protección personal mientras llevan a un grupo de migrantes encontrados cerca de Sasabe de regreso a México en esta foto de marzo de 2020, poco después de que la Oficina de Aduanas y Protección Fronteriza comenzará a hacer cumplir el Título 42.",
    "“Estos niveles casi sin precedentes de inmigración ilegal no son el resultado de circunstancias fuera del control del presidente Biden y su administración”, dijo Dan Stein, presidente de la Federación para la Reforma de la Inmigración Estadounidense, en un comunicado publicado el martes.",
    "Aaron Reichlin-Melnick, asesor principal de políticas del Consejo Estadounidense de Inmigración, dijo que ya no hay una razón legítima de política de salud para mantener el Título 42, que pone en peligro la salud y la seguridad de los solicitantes de asilo que son detenidos.",
    "“La administración de Biden se equivocó al establecer una fecha de finalización para el Título 42 sin un plan integral”, dijo el senador Mark Kelly, demócrata por Arizona, a principios de este mes, cuando presentó un proyecto de ley para retrasar esa medida.",
    "“Este es un fracaso bipartidista en el transcurso de muchos años para arreglar nuestro sistema de protección humanitaria, pero en lugar de eso, los políticos simplemente han tratado de redoblar esfuerzos para rechazar a la gente”, dijo Reichlin-Melnick.",
    "Los republicanos criticaron el plan de la administración, dijeron que abrumaría a las agencias fronterizas, y el fiscal general de Arizona, Mark Brnovich, se unió a dos estados que demandaron a la administración para mantener el Título 42 en vigor.",
    "Pero Reichlin-Melnick dijo que si bien las detenciones son más altas de lo que han sido en 22 años, la cantidad de cruces fronterizos exitosos es en realidad menor que en 2000 cuando CBP dijo que capturó aproximadamente al 35 % de los migrantes.",
    "Pero en una presentación judicial no relacionada la semana pasada, CBP dijo que la cantidad de migrantes detenidos en marzo superó con creces la capacidad de la agencia para retenerlos, que en este momento alcanza un máximo de 31,715 migrantes.",
    "Los defensores de la inmigración criticaron la regulación, que dijeron que hizo poco para proteger la salud pública mientras exponía a los migrantes a la violencia y las condiciones insalubres en campamentos improvisados ?",
    "El Título 42 fue invocado por la administración Trump en marzo de 2020 como respuesta a la entonces nueva pandemia de COVID-19, bajo la dirección de los Centros para el Control y la Prevención de Enfermedades.",
    "Pero los CDC anunciaron este mes que la regulación ya no era necesaria, y el Departamento de Seguridad Nacional (DHS, por su sigla en inglés) fijó el 23 de mayo como fecha para dejar de aplicar la regla.",
    "Los 221,303 migrantes detenidos en marzo elevaron el total de la primera mitad del año fiscal 2022 a más de 1 millón, según los datos más recientes de Aduanas y Protección Fronteriza, lo que pone a EE.",
    "(CBP, por su sigla en inglés) son engañosos, ya que el Título 42 a menudo conduce a encuentros repetidos con migrantes que intentan cruzar la frontera nuevamente después de que se les niega la entrada.",
    "El presidente Obama implementó la detención familiar, el presidente Trump implementó la separación familiar, permanecer en México y luego el Título 42, y el presidente Biden mantuvo el Título 42”.",
    "Sus proyectos de ley extenderían el Título 42 por 60 días, para dar a las agencias más tiempo para desarrollar planes para procesar a los inmigrantes que de otro modo habrían sido rechazados.",
    "Continuará haciendo cumplir el Título 8, que permite que el DHS inicie procedimientos de deportación contra inmigrantes que no tienen una base legal para permanecer en los EE.",
    "“Necesitamos una respuesta segura, ordenada y humana en nuestra frontera sur y nuestra legislación bipartidista responsabiliza a la administración de Biden, por ello”.",
    "Presionaron al presidente Joe Biden para que levantara la política cuando asumió el cargo en enero de 2021, pero no lo hizo y la cantidad de migrantes expulsados ?",
    "De los 1,8 millones de inmigrantes que han sido rechazados bajo el Título 42 en la frontera sur, más de 1,35 millones estaban bajo la administración de Biden.",
    "Permitió a los funcionarios en las fronteras terrestres rechazar a cualquier solicitante de asilo en un esfuerzo por reducir la propagación de la enfermedad.",
    "Algunos legisladores temen que GBP no esté preparado para manejar números crecientes de migrantes después de que el Título 42 finalice este mes.",
    "“El uso del Título 42 es un intento de mantenerse a flote en medio de un huracán, en lugar de refugiarse”, dijo Reichlin-Melnick.",
    "“Durante los últimos ocho años, hemos estado tratando de evitar arreglar nuestro sistema de protección humanitaria.",
    "Los críticos dijeron que el cambio solo acelerará los aumentos en la migración que se han producido bajo Biden.",
    "La administración defendió el uso del Título 42 como medida de salud, a pesar de la disminución de la pandemia.",
    "Acusó a la administración de adoptar políticas “para abrir nuestras fronteras y alentar la migración masiva”.",
    "Ha aumentado enormemente la cantidad de personas que cruzan la frontera una y otra vez”.",
    "Este reportaje fue escrito y redactado originalmente en inglés por Cronkite News.",
    "Pero un defensor dijo que los números de Aduanas y Protección de Fronteras de EE.",
    "en camino de romper el récord del año pasado de 1,66 millones de detenciones.",
    "“De alguna manera, el Título 42 fue un poco una distracción”, dijo.",
    "“Hemos visto cómo el Título 42 ha vuelto más caótica la frontera.",
    "Incluso algunos demócratas han expresado su preocupación.",
    "?bajo el Título 42 ha crecido desde entonces.",
    "Eso incluyó 109,549 en marzo, según CBP.",
    "Hoy, ese número es hasta el 83 %.",
    "?al otro lado de la frontera.",
    "UU.",
    "UU.",
    "UU."
  ]
}