{
  "id": 4742,
  "mediaId": 2557,
  "date": "2022-04-18",
  "headline": "REPORT: Biden faces deepening Democratic rift over Title 42",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-1325296859-e1625010015249-4.jpg",
  "link": "https://dennismichaellynch.com/report-biden-faces-deepening-democratic-rift-over-title-42/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    4905,
    4873,
    2799,
    2765,
    392
  ],
  "sentences": [
    "The administration’s decision to rescind Title 42 — the Trump-era policy that allows for the rapid expulsion of migrants at the border and blocks them from seeking asylum due to the coronavirus pandemic — is opening a rift not only between Biden and vulnerable Democratic incumbents but also with influential senators, who are seeking public distance from the decision.",
    "The article goes on to state the following:\nSen. Gary Peters (D-Mich.), who chairs both the Senate Homeland Security and Governmental Affairs Committee and Senate Democrats’ campaign arm, said in an interview in the Capitol on Monday that he had privately raised concerns with administration officials, including Homeland Security Secretary Alejandro Mayorkas.",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by TheHill.com:\nPresident Biden is facing growing pushback from Democrats, including from typical allies, over his decision to lift a Trump-era immigration policy.",
    "https://t.co/wID9xWMNcg\n— Greg Abbott (@GregAbbott_TX) April 18, 2022\nTo get more information about this article, please visit TheHill.com.",
    "A majority of the U.S. Senate disagrees with Biden's decision to eliminate the Title 42 policy that limits illegal immigration.",
    "I’m going to defer judgment on that until I give the administration the opportunity to fully articulate what that plan is.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "“Unless we have a well-thought-out plan, I think it is something that should be revisited and perhaps delayed.",
    "But I share … concerns of some of my colleagues,” Peters told reporters.",
    "Democratic Sen. Mark Kelly says Biden has 'no plan.'",
    "Listen to the latest daily DML podcasts below!",
    "Says it will pile crisis on top of crisis.",
    "Then please share."
  ]
}