{
  "id": 4784,
  "mediaId": 2553,
  "date": "2022-04-21",
  "headline": "Florida Congressman: Psaki Should ‘Save Her Tears’ Over Florida Education Law, Save Them For Kids Trafficked Over Biden’s Border Policies",
  "image": "https://dw-wp-production.imgix.net/2022/04/Untitled-design-24.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/florida-congressman-psaki-should-save-her-tears-over-florida-education-law-save-them-for-kids-trafficked-over-bidens-border-policies",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dillon Burroughs",
  "authorUrl": "https://www.dailywire.com/author/dillon-burroughs",
  "termIds": [
    2859,
    4905,
    3653,
    4266,
    1126,
    6159,
    6678
  ],
  "sentences": [
    "Donalds shared his strong remarks during a Newsmax interview on “Wake Up America.”\n“Jen Psaki needs to save her tears for the 13 men and women who died under Joe Biden’s stale leadership in Afghanistan, [and] to save her tears for the young girls who are being raped due to Joe Biden’s reckless immigration policies because, yes, young girls are being raped as they’re being trafficked into the United States,” the congressman said.",
    "“It says a lot about the DEM Party when you have the WH Press Sec crying over Florida’s ban on teaching sexual fluidity and gender identity to children under the age of 8 rather than showing outrage at schools indoctrinating CHILDREN with this curriculum in elementary education,” he wrote.",
    "pic.twitter.com/eXMqMl6vBe\n— Congressman Byron Donalds (@RepDonaldsPress) April 20, 2022\nTitle 42, a Trump-era policy that allows the Border Patrol to turn away migrants at the southern border to help stop the spread of COVID-19, has been set to end in May by the Biden administration.",
    "It says a lot about the DEM Party when you have the WH Press Sec crying over Florida's ban on teaching sexual fluidity and gender identity to children under the age of 8 rather than showing outrage at schools indoctrinating CHILDREN with this curriculum in elementary education.",
    "— Congressman Byron Donalds (@RepDonaldsPress) April 20, 2022\nThe congressman argued in another post that protection of the nation is the president’s top priority, arguing that an end to Title 42 will cause more illegal immigrants to cross the nation’s southern border.",
    "Mark Kelly and Kyrsten Sinema, along with Delaware Sen. Chris Coons, New Hampshire Sen. Maggie Hassan, Georgia Sen. Raphael Warnock, Nevada Sen. Catherine Cortez Masto, West Virginia Sen. Joe Manchin, Montana Sen. Jon Tester, and Texas Rep. Henry Cuellar.",
    "Florida Republican Rep. Byron Donalds said on Wednesday that White House Press Secretary Jen Psaki should save her tears over Florida’s new parental rights law for children he claims are victimized due to President Joe Biden’s reckless border policies.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "They would rather kids be indoctrinated on this stuff, but they would have no problem with young girls being raped as they’re being trafficked into the United States,” Donalds commented.",
    "Donalds also defended his state’s new Parental Rights in Education law that removes discussions regarding sexual orientation and gender identity from school classrooms for K-3rd grades.",
    "There is no way I would want any teacher talking to any one of my sons when they were in the third grade about their gender identity or their sexual orientation,” he added.",
    "The border crisis has led Republicans and at least 10 Democrats in Washington to call for the Biden administration to stop its plans to end Title 42 next month.",
    "“The first job of every POTUS is the security of the nation & its people & since day one, he has failed at this constitutional obligation.",
    "The first job of every POTUS is the security of the nation & its people & since day one, he has failed at this constitutional obligation.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "Donalds called the argument proof of the direction that the radical left is taking in America.",
    "“In what world is it OK to talk to an 8-year-old about their sexual identity?” Donalds asked.",
    "“It is incomprehensible, but this is proof positive of where the radical left has gone.",
    "Among Democrats to voice opposition to the end of Title 42 are Arizona Sens.",
    "Ending Title 42 will make this worse.”\nJoe Biden is the open border POTUS.",
    "Donalds also took to Twitter on Wednesday to blast Psaki’s response.",
    "Last month alone, CBP encountered 221,303 illegals at our border.",
    "Last month alone, CBP encountered 221,303 illegals at our border.",
    "“It’s crazy to me that we’re even having this conversation.",
    "“Joe Biden is the open border POTUS,” Donalds wrote.",
    "Become a member now and join our mission.",
    "Ending Title 42 will make this worse.",
    "I have three sons.",
    "Believe the same?"
  ]
}