{
  "id": 4867,
  "mediaId": 2603,
  "date": "2022-04-18",
  "headline": "Ope! Elizabeth Warren Just Took a Little Dig at Nancy Pelosi",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/64683e42d4fceef5fa92b57e1c3fa0cb.png",
  "link": "https://jezebel.com/ope-elizabeth-warren-just-took-a-little-dig-at-nancy-p-1848806182",
  "mediaOutlet": "Jezebel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Rinkunas",
  "authorUrl": "https://jezebel.com/author/susanrinkunas",
  "termIds": [
    5510,
    3246,
    1728,
    392,
    1339,
    1489,
    1433,
    1477
  ],
  "sentences": [
    "And “but the filibuster” is not going to resonate with people concerned about whether they’ll have enough money to pay for college without life crippling debit, with all of the women who will face a potentially fatal choice if they get pregnant, with LGBTQ+ people and their families who increasingly cannot even live in certain states anymore, for people continuing to be brutalized by out-of-control unaccountable law enforcement, and for people who can’t even fill up their tanks or go to the grocery store without completely draining their bank account.",
    "The likeliest perspective of the average voter is going to be something like “Democrats asked for power in 2020, Democrats made certain promises for what they would do with that power, Democrats got that power (WH, both houses of Congress), by and large Democrats haven’t kept the promises they made, the country is headed in the wrong direction, so I’m not going to vote for Democrats this time.” It’s hard to argue with a lot of that logic, except the very last point!",
    "In a New York Times op-ed, Warren correctly notes that the party hasn’t kept many of the promises it made to voters during the 2020 campaign and that, frankly, voters won’t care if arcane Senate procedures like the filibuster and two annoying as fuck “Democratic” senators are the reasons why Democrats have hardly passed anything beyond covid relief bills.",
    "I know this isn’t really the point of the article, but it is such an important thing to keep in mind, especially when Democrats do get washed out in the midterms and centrist Dems blame “defund the police” or trans people or whatever.",
    "There is no earthly reason why people SERVING THE PUBLIC, who are some of the most powerful people in the country, need to participate in the for-profit ownership of the companies their activities impact.",
    "That legislators can own individual stocks is an absolute travesty that tells you everything you need to know about the corruption endemic in our political and economic system.",
    "If you have power, and you don’t address people’s problems, especially the ones you promised to address if they put you in power, they are not going to put you back in power.",
    "Even less persuasive is going to be “MANCHIN/SINEMA” given Manchin and Sinema are Democrats, so it’s not clear how they could be an excuse for Democrats’ own failures.",
    "That is plenty of money, and of course many of these people already come into office with significant wealth.",
    "Senators and Representatives make $174,000 per year."
  ]
}