{
  "id": 4870,
  "mediaId": 2855,
  "date": "2022-04-18",
  "headline": "Polling Shows Trouble for Biden",
  "image": "",
  "link": "https://cis.org/Arthur/Polling-Shows-Trouble-Biden",
  "mediaOutlet": "CIS",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew R. Arthur",
  "authorUrl": "https://cis.org/Arthur",
  "termIds": [
    4905,
    450,
    253,
    6199,
    6678,
    6672,
    6653,
    6686
  ],
  "sentences": [
    "It is easy to understand why so many Hispanic respondents in the poll are proud of being Texans: 72 percent agreed with the statement: “Texas history, including but not limited to the Alamo, the Texas Revolution, and the ideal of the 'lone star state' is a major part of your heritage.” Just 22 percent disagreed, and then, just 10 percent “strongly disagreed”.",
    "As I explained in January: “’Tejanos’, native Texans of Hispanic heritage, have resided there since well before statehood, and in south Texas are increasingly voting like their ‘white’ neighbors (I hate such demographic descriptors, which are usually inapt, especially so in Texas).”\nI stick by that assessment, which is more than borne out by the poll.",
    "“Education” was third, at 10 percent, and the remaining 17 issues all polled in the single digits (“roads, bridges, highways and public transit”, “defunding the police”, “Social Security, Medicare, Medicaid”, ‘’climate change”, and human trafficking” were each the primary concern of just 1 percent of respondents).",
    "That is likely why Democratic Sen. Mark Kelly (Ariz.), who is facing reelection in a tight contest this year, is being so openly critical of DHS’s handling of illegal migration at the Southwest border, and its ability to deal with a post Title 42 migrant tsunami:\nRight now we have a crisis on our southern border.",
    "Raphael Warnock (Ga.) and Catherine Cortez Masto (Nev.), are also raising concerns about CDC’s plan to end Title 42 on May 23, while a fourth Democrat locked in a tight race, Sen. Maggie Hassan (N.H.), just made her third trip to the Southwest border — a long way from the Granite State.",
    "The respondents largely perceive property taxes to be a burden (71 percent), think that “parents should have access to materials taught to their children in schools either online or in some easily accessible way” (89 percent), and support school choice (78 percent).",
    "That immigration reform and border security ranked so high is not terribly surprising, given that most immigration to the United States in recent years has come from Latin America, and that Texas has borne the brunt of the most recent Southwest border surge.",
    "In a poll it conducted between April 7 and 11 of 1,412 adults, Quinnipiac found that Biden’s overall approval rate among Hispanic Americans was just 26 percent, compared to 54 percent who disapproved of the job that Biden is doing as president.",
    "Respondents were asked whether they approved or disapproved of the president’s performance in eight subject areas: Covid-19, immigration, the economic recovery, crime, the situation with Russia and Ukraine, climate, inflation, and gas prices.",
    "Just 27 percent of Independents — crucial swing voters in the upcoming 2022 midterm elections — approved of the president’s immigration performance, and then just 4 percent voiced strong approval for the president’s immigration performance.",
    "That is likely why some of Biden’s more vulnerable fellow partisans are bucking the White House on CDC’s plans to end border expulsion orders it has issued under Title 42 of the U.S. Code in response to the Covid-19 pandemic on May 23.",
    "That brings me to the final poll, prepared by the Midwest survey outfit WPA Intelligence (WPAI) for the Texas Public Policy Foundation (TPPF) of 608 Hispanic adults in the state of Texas conducted between February 14 and 23.",
    "All of this suggests that the president’s performance — and in particular the manner in which he is handling immigration and the Southwest border — will weigh on Democrats’ prospects in the November midterm elections.",
    "Del Rio revealed a stunning lack of coordination within the administration and between the White House and DHS in responding to the migrant surge at the Southwest border, sending Biden’s approval ratings plummeting.",
    "If my recent visit to the Rio Grande Valley (RGV) is any gauge, south Texas Hispanics are even more concerned about the situation at the border than those in Austin and the Dallas-Fort Worth Metroplex.",
    "In Texas, which will have 38 congressional districts in 2022 (up from 36 following the decennial apportionment), Biden’s immigration stance will likely cost his party some important votes in November.",
    "In that poll, 56 percent of respondents disapproved of Biden’s handling of immigration (with 42 percent “strongly” disapproving), compared to 35 percent approval (just 10 percent strongly approving).",
    "Topline, Biden received a 33 percent approval rating — a horrible grade for a first-term president heading into the midterms, but a whole lot better grade than he received from Hispanic respondents.",
    "That October polling was done in the wake of “Del Rio”, when tens of thousands of migrants (mostly Haitian nationals) poured illegally across the Rio Grande and descended on that small Texas town.",
    "Hispanic voters have long been a key constituency for the Democratic party, but as Democratic political advisor Ruy Teixeira has been warning for months, the party has a “Hispanic Voter Problem”.",
    "Unless Biden changes his focus at the border and with respect to immigration generally, the coming illegal migrant wave could carry many of his fellow Democrats out of Washington in November.",
    "The WPAI/TPPF poll reveals that 64 percent of respondents “definitely” plan to vote in November, with another 13 percent “probably plan to vote”, suggesting a heavy turnout in the midterms.",
    "In another point showing that Texas Hispanics think like Americans generally, the more local political power is, the more that the respondents in the poll are to trust those who hold it.",
    "As with the topline results, 56 percent of Independents disapproved of the job that Biden is doing on immigration, but almost four-in-nine (39 percent) of them strongly disapproved.",
    "The end of Title 42 will almost definitely spur numerous similar incidents across the border, as Border Patrol is expected to be facing as many as 18,000 illegal entrants per day.",
    "Most of the Texas congressional seats are rated safely Democratic or Republican by UVA election guru Larry Sabato, save four: The 15th, 23rd, 28th, and 34th Texas House Districts.",
    "Biden’s approval was higher among this demographic, but not by much: Just 38 percent approved (12 percent strongly), barely exceeding Biden’s topline immigration approval rating.",
    "The two top issues that they want to see the Texas legislature address (out of 20) are immigration-related: Immigration reform (11 percent) and border security (also 11 percent).",
    "That makes sense: According to U.S. Energy Information Administration estimates, the average U.S. family will spend $2,945 on gasoline in 2022 — $455 more than they paid in 2021.",
    "Biden’s disapproval among Hispanics matched his overall results (also 54 percent disapproval), but respondents as a whole were more approving of the president’s performance.",
    "That represents a decline from the same polling a month before, when Biden’s immigration approval was 39 percent, and disapproval was an almost equally dismal 59 percent.",
    "And strong support for border security among Texas Hispanics\nA fresh set of polls shows the president underwater on immigration and with some key demographic groups.",
    "All are along the Rio Grande and have large Hispanic populations, and other than the 23rd (Rep. Tony Gonzales), all are in the RGV and were won by Democrats in 2020.",
    "Some 73 percent of respondents agree that there is a crisis at the Southwest border, with more than half (53 percent) strongly believing that to be the case.",
    "An overwhelming percentage of the respondents (83 percent) agreed that the United States is “a land of freedom and opportunity” — 60 percent strongly agreed.",
    "They were also overwhelmingly proud of being Texans — 84 percent stated that they were proud Texans, 69 percent describing themselves as being “very proud”.",
    "That may sound better for the president than the later-performed ABC/Ipsos poll, but the internals are particularly bad for Biden and his fellow Democrats.",
    "Some 37 percent were leery of Washington, 33 percent distrusted state authorities in Austin, and a quarter were not so sure about their local governments.",
    "One-third of respondents — 33 percent — strongly disapprove of how Biden is handling the job, compared to one quarter (25 percent) who strongly approve.",
    "Seventy percent of those polled trusted their local and municipal governments and school boards, while 62 percent trusted the Texas state government.",
    "More than half (51 percent) of respondents believe that border security should be increased, with 36 percent desiring a strong increase in security.",
    "Global decision intelligence company Morning Consult polled 2,003 registered voters between April 1 and 4 for Capitol Hill tip sheet Politico.",
    "That so many Hispanic Texans are concerned about border security might come as a surprise to Americans who have never been to Texas, however.",
    "Sen. Kelly is right — there is a crisis at the Southwest border, and when Title 42 ends, there will “be a crisis on top of a crisis”.",
    "Still, 65 percent agreed that public schools and school boards currently respect the rights of parents and listen to their concerns.",
    "Note that the WPAI/TPPF poll was conducted statewide in Texas — from the panhandle to the Rio Grande and from Texarkana to El Paso.",
    "Arizona has not had to handle the levels of immigration that Texas has, but I was there two months ago, and things are pretty bad.",
    "Just 37 percent of respondents approved of the president’s handling of immigration, while a whopping 60 percent disapproved.",
    "Still, it was a significant improvement from late October, when Biden received 31 percent approval, 68 percent disapproval.",
    "Prices across the board were up 8.5 percent in March from a year before, “the sharpest year-over-year increase since 1981”.",
    "Interestingly, 50 percent of Hispanic respondents disapproved of Biden’s immigration performance — 31 percent strongly so.",
    "I warned them about this months ago ... and they do not have a plan in place on how to deal with the increased numbers.",
    "Just 13 percent want border security to be decreased, just under half (6 percent) who want to see a “strong decrease”.",
    "By contrast, just 23 percent disagree that there is a border crisis, with 13 percent in strong disagreement.",
    "Eighty-seven percent were “proud of being American”, with 68 percent asserting that they were “very proud”.",
    "Kelly’s not saying anything that I have not been saying, but the fact that Kelly is saying it is notable.",
    "Speaking of Hispanic voters, Quinnipiac’s latest poll shows Biden way underwater with this demographic.",
    "The president should expect to see further declines in his already poor immigration approval rating.",
    "On the bright side, 47 percent of those polled approve of the job he is doing as president.",
    "On the flip side, an almost equal number — 46 percent — disapprove of Biden’s performance.",
    "Research outfit Ipsos conducted a poll for ABC News of 530 adults between April 8 and 9.",
    "A measly 3 percent contended that they were “not proud” of being American “at all”.",
    "And it’s going to be, to be honest, it’s going to be a crisis on top of a crisis.",
    "The president’s immigration approval numbers generally are low and getting worse.",
    "Biden received his worst grades on two related issues — inflation and gas prices.",
    "Certain prices have risen more than others, but gas prices are up 48 percent.",
    "Just 15 percent disagreed with that assessment (7 percent “strongly”).",
    "Gas prices are a key driver behind the current U.S. inflation rate.",
    "By comparison, just 58 percent trusted the federal government.",
    "I have written at length about Texas Hispanics in the past.",
    "Thirty-two percent want border security to remain the same.",
    "That’s more than the rent payment for my first apartment.",
    "Gas prices: Approve 31 percent, disapprove 68 percent.",
    "Inflation: Approve 29 percent, disapprove 69 percent.",
    "Political enthusiasm is high among Texas Hispanics.",
    "Right now this administration does not have a plan.",
    "Immigration was Biden’s third-biggest weak spot.",
    "Distrust, logically, flowed from the top down.",
    "That presents a mixed bag for President Biden.",
    "Liability for Democrats Heading into November.",
    "Two other endangered Senate Democrats, Sens.",
    "That all sounds like most Americans I know.",
    "Morning Consult/Politico.",
    "Quinnipiac.",
    "WPAI/TPPF.",
    "ABC/Ipsos.",
    "..."
  ]
}