{
  "id": 4904,
  "mediaId": 8295,
  "date": "2022-04-18",
  "headline": "Arizona Senate race nets $61.5 million; Kelly one of top U.S. fundraisers",
  "image": "https://cronkitenews.azpbs.org/wp-content/uploads/2022/02/kellyflag-1024.jpg",
  "link": "https://cronkitenews.azpbs.org/2022/04/18/arizona-senate-race-nets-61-5-million-kelly-one-of-top-u-s-fundraisers/",
  "mediaOutlet": "cronkitenewsonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camila Pedrosa",
  "authorUrl": "https://cronkitenews.azpbs.org/people/camila-pedrosa/",
  "termIds": [
    2459,
    5660,
    3005,
    3401,
    1489,
    100,
    98,
    476,
    1163,
    5949
  ],
  "sentences": [
    "Rubashkin called Kelly a strong fundraiser in the Democratic Party who is “setting the pace for incumbent fundraising this particular cycle” and is “showing no signs of slowing down.” But he said the current political climate favors Republicans, with President Joe Biden’s struggles during his first year in office creating “a hole for Democratic senator incumbents that is too deep to get out of, even with tens of millions of dollars in donor money.”\nBiden had a 41.8% approval rate nationally, according to the latest compilation of polls by FiveThirtyEight, and an even lower 40% approval rate in Arizona, where 55% disapproved, according to a March 30 poll by OH Predictive Insights.",
    "He said the firm’s latest polling shows a generic Republican beating a generic Democrat in three races it is tracking, but that “Kelly is leading against a generic Republican.”\n“Whether you agree with Mark Kelly or not politically, he has proven to be out-of-this-world in his fundraising prowess, and it’ll be key to his reelection,” Noble said in an email Monday.",
    "WASHINGTON – Arizona Senate hopefuls had raised more than $61.5 million by March 31, led by Democratic Sen. Mark Kelly, D-Ariz., whose almost $39 million in campaign contributions was the second-highest in the nation among Senate candidates this cycle.",
    "With more than seven months to Election Day, Arizona Senate candidates had already raised almost $61.5 million and spent more than $27 million, with Democratic Sen. Mark Kelly outraising and outspending all his challengers combined as of March 31.",
    "But experts are still calling the Arizona race a toss-up, with Kelly grappling with a Democratic president whose sinking poll numbers could hurt his campaign and attract millions from outside Republican groups that see Arizona as winnable.",
    "That sort of spending will help offset what is currently a sizable fundraising lead for Kelly, who one analyst said is “showing no signs of slowing down.”\nAccording to the FEC, Kelly’s campaign donations as of March 31 trailed only Sens.",
    "Trump said Monday that he will be making an Arizona Senate endorsement “in the not-too-distant future,” but he dedicated the majority of his statement to repeating complaints about Brnovich’s handling of the 2020 election investigations.",
    "“Kelly obviously will have no shortage of money, and he should have a huge edge on whoever his eventual opponent is,” said Kyle Kondik, the managing editor for Sabato’s Crystal Ball, at the University of Virginia Center for Politics.",
    "Kondik pointed to groups like the Senate Leadership Fund, a Republican political action committee that said Monday it has reserved $14.4 million in advertising in Arizona to start running in September, after the primary election.",
    "Brnovich cannot expect to get a boost from former President Donald Trump, whose backing will likely separate a candidate from the crowded GOP pack and has been eagerly sought by most of the Republicans.",
    "But that help will not come until after a party nominee is chosen, while Kelly’s campaign said in a statement Monday that it started advertising in February and has released two ads so far.",
    "But Masters has the support of his former boss, billionaire entrepreneur Peter Thiel, who put up $10 million for the Saving Arizona PAC, which was created to support Masters’ candidacy.",
    "Attorney General Mark Brnovich was the only challenger who had spent the bulk of what he raised, spending more than $2 million of the $2.5 million raised so far.",
    "Jacob Rubashkin, a political analyst with Inside Elections, said that outside funding, like the Senate Leadership Fund, will help Kelly’s eventual challenger.",
    "Republican Jim Lamon leads the challengers with $13.8 million raised – but $13 million of that amount was a loan that the candidate made to his own campaign.",
    "“However, money is far from everything in modern elections, and Kelly should be facing a difficult political environment,” Kondik said in an email Monday.",
    "But Mike Noble, the managing partner at OH Predictive Insights, said that while the environment is bad for most Democrats, Kelly is an exception.",
    "The latest reports from the Federal Election Commission show that Kelly had raised and spent more than his six challengers combined.",
    "Former Arizona National Guard Adjutant Gen. Mick McGuire reported raising just over $2 million with half of that still in the bank.",
    "Millions more are likely to flood the state in what is expected to be one of the most the hotly contested races in the country.",
    "“At the end of the day, if you ask most people in this business, ‘Would you rather have the money or the national environment?",
    "The campaign offices of Lamon, Masters, Brnovich and McGuire did not immediately respond to requests for comment Monday.",
    "The Arizona buy is part of $141 million the PAC said it will spend this fall on Senate races in seven states.",
    "Kelly had spent just under $17 million and had about $23.2 million in the bank, according to his FEC filing.",
    "His challengers, by comparison, reported raising $22.6 million and spending $11.5 million as of March 31.",
    "Blake Masters was next among the GOP hopefuls, with $3.8 million raised and $2.3 million in the bank.",
    "'” he said, “these days, most people would tell you they’d rather have the national environment.”",
    "Raphael Warnock, D-Ga., who raised a stunning $67.6 million so far in the 2021-22 election cycle.",
    "But Rubashkin said Kelly will need to keep pressing if he hopes to win reelection."
  ]
}