{
  "id": 4910,
  "mediaId": 2562,
  "date": "2022-04-18",
  "headline": "Some Senate Dems Pushing Back on Biden Lifting Title 42 Border Restrictions",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid37CD1DAD-1422-40EE-B35B-A266B6A3507D.jpg",
  "link": "https://donaldjtrumppolls.com/some-senate-dems-pushing-back-on-biden-lifting-title-42-border-restrictions/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    2174,
    2459,
    2765,
    2799,
    4905,
    1489,
    392,
    6657,
    6383,
    6580
  ],
  "sentences": [
    "(Patrick T. Fallon / AFP via Getty)\nBy Charles Kim | Monday, 18 April 2022 04:29 PM\nDemocratic Senators are pushing back on President Joe Biden ending Title 42 restrictions at the southern border next month without having a mitigation plan in place, saying it will allow a larger flow of illegal migrants to enter the country.",
    "Meanwhile, several other Democratic Senators, including Sen. Joe Manchin, W.Va., Sen. Krysten Sinema, D-Ariz., and Sen. Jon Tester, D-Mont., have joined Sen. James Lankford, R-Okla., in bipartisan legislation that would keep Title 42 in place for a while due to the continued impacts of the pandemic, The Hill reported.",
    "Some Senate Dems Pushing Back on Biden Lifting Title 42 Border Restrictions An incomplete section of the new steel bollard-style border wall is seen on a hillside along the US-Mexico border between San Diego and Tijuana during a tour with US Customs and Border Protection.",
    "Sen. Raphael Warnock, D-Ga., Sen. Catherine Cortez, D-Nev., and Sen. Maggie Hassan, D-N.H., have also come out against lifting the restrictions, while others in the party pushed the Biden administration to end the practice, calling it \"inhumane.\"",
    "Peters said those senators have to take that position because it is in the interest of their states, but that he wants to see a plan from the administration about how things will be handled if the restrictions end.",
    "\"Unless we have a well-thought-out plan, I think it is something that should be revisited and perhaps delayed,\" Sen. Gary Peters, D-Mich., told a small group of reporters at the Capitol Monday, The Hill reports.",
    "\"I want to give the administration the opportunity to fully articulate how they are going to handle the situation because it really is something that’s going to be incredibly challenging.\"",
    "According to a recent Morning Consult poll, 55% of voters oppose Biden lifting the restrictions, with 42% saying they \"strongly disapprove\" of ending the practice.",
    "Biden on April 1 announced the restrictions would be lifted by May 23, which officials estimate could increase the flow of illegal migrants by 18,000 per day.",
    "It allows for border patrol officials to turn back illegal migrants in an effort to help prevent the spread of COVID-19, CBS News reported April 5.",
    "\"The senators have to take a position that they think is best for their state and so that’s what they are doing,\" Peters said in The Hill’s report.",
    "Since Title 42 restrictions began, more than 1.6 million illegal migrants have been expelled from the country, according to the report.",
    "Former President Donald Trump put the public health policy in place at the border during the beginning of the COVID-19 pandemic.",
    "\"Right now, this administration does not have a plan,\" Sen. Mark Kelly, D-Ariz., said while visiting the border in his state.",
    "\"I’m going to defer judgment on that until I give the administration the opportunity to fully articulate what that plan is.",
    "The poll was conducted April 1-4 with 2,003 registered U.S. voters, and has a margin of error of +/- 2 percentage points.",
    "Republicans oppose lifting the restrictions and are planning to use it as a talking point in the 2022 midterm elections.",
    "Only 16% of the 34% who support lifting Title 42, say they \"strongly support\" ending the removals.",
    "\"And it’s going to be, to be honest, it’s going to be a crisis on top of a crisis.\"",
    "Now, Democratic Senators are also saying the restrictions should be kept in place.",
    "But I share … concerns of some of my colleagues.\"",
    "Original Article"
  ]
}