{
  "id": 4989,
  "mediaId": 2694,
  "date": "2022-04-21",
  "headline": "The Punt Presidency",
  "image": "https://cdn.theatlantic.com/thumbor/Ht-U6OnogYHXh1mi4jyThrywJ6A=/0x43:2000x1085/1200x625/media/img/mt/2022/04/Atl_Biden_punt_v1/original.png",
  "link": "https://www.theatlantic.com/ideas/archive/2022/04/biden-mask-mandates-student-loans/629616/?utm_source=feed",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David A. Graham",
  "authorUrl": "https://www.theatlantic.com/author/david-a-graham/",
  "termIds": [
    4950,
    4905,
    2938,
    2819,
    2765,
    253,
    6678,
    6709
  ],
  "sentences": [
    "In March, Chief of Staff Ron Klain boasted on Pod Save America, “Joe Biden, right now, is the only president in history where no one’s paid on their student loans for the entirety of his presidency.” The “right now” was doing a lot of work: On April 10, speaking on Fox News, Press Secretary Jen Psaki said that borrowers would at some point have to start paying again.",
    "The politics of the mandate are a bit murky: Biden is eager to project a post-pandemic return to normalcy, and airlines were campaigning for the mandate to end; public-health experts generally wanted the mandate to remain, and, despite noisy opposition, polling suggests at least some public support for it.",
    "One path is exemplified by the “Sister Souljah” episode, when then-candidate Bill Clinton attacked the rapper for comments on race, knowing that it would infuriate some Democratic voters—especially Black ones—but calculating that it would gain him support from moderates and centrists.",
    "In March 2020, early in the pandemic, the Trump-era CDC issued an order mandating that people be turned away or expelled upon entering the U.S. via the southern border, in order to control the spread of the coronavirus.",
    "Senator Mark Kelly of Arizona visited the U.S.-Mexico border, and in a sign of the issue’s political salience, so did Senator Maggie Hassan of New Hampshire, despite the fact that New Hampshire is nowhere near Mexico.",
    "Republicans were less interested in the COVID-control angle than in how the policy blocked people from entering the country, and, sensing a political advantage, they accused Biden of being soft on the border.",
    "In many parts of the Democratic coalition, the decision was greeted with hoots of derision, but the White House characteristically punted on whether to appeal the ruling, issuing a noncommittal response.",
    "On border control, student debt, and masking on airplanes, the White House has opted to punt rather than making final decisions—either delaying the choice or leaving it to another part of the government.",
    "On April 1, the CDC announced that “the CDC Director has determined that an Order suspending the right to introduce migrants into the United States is no longer necessary,” effective May 23.",
    "Repayment has become Schrödinger’s policy: As long as Biden doesn’t open the box, the cat is neither dead nor alive, and Biden doesn’t have to alienate anyone, at least not too much.",
    "The policy is known as Title 42, after the law that authorizes the order, and it sidesteps the standard intake procedure at the border, including accepting asylum applications.",
    "At the start of his career, Joe Biden was a young man in a hurry: the sixth-youngest senator, an ambitious force in Washington, and a repeat presidential candidate.",
    "Since early in the pandemic, the federal government has required masks on mass transit such as airplanes and trains, but the policy was set to expire this Monday.",
    "But moderate Democrats are wary, saying that a jubilee would be costly, that it would help only a small number of Americans, and that it would fuel inflation.",
    "Forgiving debt would probably be popular among young voters, among whom Biden’s approval is cratering, and some polls suggest that it is broadly popular.",
    "Biden is currently juggling the end of several COVID-inspired policies, and either extending them or ending them could create political difficulties.",
    "The government has continued to expel some migrants under Title 42, though the U.S. has also begun processing others under standard immigration law.",
    "The White House argues that it doesn’t have such an authority, and that only Congress can do so, though it’s clear Congress doesn’t have the votes.",
    "Finally, on Wednesday, the CDC said it would ask the Justice Department to appeal, even as travelers across the nation had abandoned their masks.",
    "Biden has now done it four times, most recently in early April, including twice since the Education Department announced a “final” extension.",
    "He’s promised to “follow the science” and follow the lead of health officials, which makes it hard for him to reject their conclusion.",
    "Although every leader comes to a decision he or she would rather not make, delay has become a signature tactic of this presidency.",
    "Another path is the one chosen by Donald Trump, who repeatedly played to his base at the expense of winning over swing voters.",
    "Besides, many Democrats on the party’s left flank object to Title 42 because it prevents migrants from applying for asylum.",
    "Even Biden’s close ally and protégé Chris Coons, the senator from Delaware, wondered whether it was wise to end Title 42.",
    "Biden has preferred not to take any of these paths, an approach exemplified by his handling of student-loan repayments.",
    "That got him the biggest overhaul of the health-insurance system in generations, but also a flawed and fragile law.",
    "The Democratic Party’s left wing wants Biden to simply forgive as much as $50,000 per person via executive action.",
    "This has obvious advantages—alienating people is bad—but also drawbacks: You don’t get much credit, either.",
    "A president facing a divisive dilemma can take a few different paths, as exemplified by recent presidents.",
    "The following weekend, Psaki herself told Pod Save America that executive action was still a possibility.",
    "This same approach has also characterized much of the Biden administration’s handling of the pandemic.",
    "A day later, the Justice Department announced that it would appeal if the CDC deemed it necessary.",
    "(Career CDC officials expressed some skepticism about the need for the order at the time.)",
    "But on Tuesday Axios reported that Biden is now considering delaying the end of Title 42.",
    "Last week, rather than choose, the administration extended it another 15 days, to May 3.",
    "Punting can be a useful tool, but at some point, you’ve got to put points on the board.",
    "The administration has tried to appeal to all sides, resulting in confusing messaging.",
    "(Note the juxtaposition between Klain’s boast and Biden’s polling with young voters.)",
    "Now, at the pinnacle and close of his career, the president prefers to procrastinate.",
    "On Monday, however, a federal judge ruled that the mandate was unconstitutional.",
    "Barack Obama tended to seek compromise, even when it was a bitter pill.",
    "But if Biden simply overruled the CDC, that would cause problems too.",
    "Why sail between Scylla and Charybdis when you can just drop anchor?",
    "In March 2020, Congress suspended payments on federal student loans.",
    "(It’s worth noting that Clinton won reelection, and Trump did not.)",
    "Vulnerable Democrats facing reelection in 2022 objected too.",
    "Naturally, lenders are also lobbying for the freeze to end.",
    "Meanwhile, Biden faces a conundrum on the border.",
    "The current expiration date is August 31.",
    "Trump extended the freeze twice.",
    "It was a punt within a punt.",
    "Predictable chaos ensued.",
    "But wait!"
  ]
}