{
  "id": 4999,
  "mediaId": 2830,
  "date": "2022-04-20",
  "headline": "California’s Medical ‘Misinformation’ Crusade Could Cost Lives",
  "image": "",
  "link": "https://www.wsj.com/articles/california-medical-misinformation-disinformation-bill-cost-lives-deaths-covid-19-ivermectin-oxygen-ventilator-hospitalization-vaccine-side-effect-pandemic-first-amendment-censorship-11650462870",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allysia Finley",
  "authorUrl": "https://www.wsj.com/news/author/allysia-finley",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s not clearly defined, but the bill would instruct the board to consider whether a doctor’s order or opinion deviates from the “standard of care” (i.e., recommendations by government bodies or treatments that are widely used by healthcare practitioners) and is “contradicted by contemporary scientific consensus.”\nSo doctors who prescribe or recommend treatments that haven’t been approved by the Food and Drug Administration for Covid-19—for example, the antidepressant fluvoxamine, which has shown strong results in trials—could be disciplined and even lose their medical licenses no matter if they have scientific evidence to support them.",
    "Plus, the Republican National Committee decides not to participate in debates hosted by the Commission on Presidential Debates, but this doesn't mean the end of candidates sparring on TV.Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nBut it would have been illegal under a new bill that Democratic lawmakers have proposed in California.",
    "“The bill would put physicians’ licenses at risk if they say the vaccines are anything other than safe and effective,” says Teryn Clarke, a neurologist in Newport Beach, Calif. “But all medicines and medical procedures carry a risk of adverse events, and patients deserve to know what those potential risks are.”\nMuch of what was learned early in the pandemic was from doctors sharing their clinical experiences and knowledge.",
    "It also encouraged doctors to report their peers for “misinformation.”\nThe Federation of State Medical Boards last summer warned that physicians who spread misinformation about the Covid-19 vaccine risk “disciplinary action by state medical boards, including the suspension or revocation of their medical license.” So doctors in other states could also be disciplined for, say, suggesting children don’t need to be vaccinated.",
    "Mainstream science is often wrong, as vaccine expert Paul Offit explains in his book “Overkill: When Modern Medicine Goes Too Far.” Dr. Offit details how many conventional medical recommendations, like finishing a course of antibiotics or giving Tylenol to reduce a child’s fever, aren’t supported by science and can do more harm than good.",
    "The legislation would require the state Medical Board to take action against doctors found to be spreading “misinformation” related to the “nature and risks of the virus, its prevention and treatment; and the development, safety, and effectiveness of COVID-19 vaccines.”\nWhat is “misinformation”?",
    "“Vaccine misinformation during the COVID-19 pandemic underscores how reverence for freedom of speech in the US intensifies our vulnerability to public health threats,” Stanford’s Michelle Mello recently wrote in the Journal of the American Medical Association.",
    "Emails obtained by the American Institute for Economic Research showed how the National Institutes of Health’s Francis Collins and Anthony Fauci tried to discredit the authors of the Great Barrington Declaration, which opposed the lockdown consensus.",
    "WSJ Opinion: The Decline of 'Science'—From Climate to OmicronPlay video: WSJ Opinion: The Decline of 'Science'—From Climate to Omicron\n Wonder Land (01/12/22): The weaponization of 'science' began with climate policy and accelerated with Covid-19.",
    "They say it may be constitutional merely to “threaten disciplinary action by licensing boards against health professionals whose speech to patients conveys incorrect science or substandard medicine.”\nThat’s essentially what Illinois is doing.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nJoe Biden's Airplane Mask Mandate Doesn't Fly\nA federal judge rules against the Centers for Disease Control's mask rule for airlines, trains and even Ubers.",
    "The state’s Department of Financial and Professional Regulation warned in November that doctors could face disciplinary action for failing to “conform with evidence-based medicine and standards of care” when treating Covid patients.",
    "Photo: Jae C. Hong/Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (6 minutes)\nAD\nLoading advertisement...\n00:00 / 05:32\n1x\nThis article is in your queue.",
    "She suggests that state medical boards can “suspend the licenses of physicians whose statements constitute unprofessional conduct,” which could include “misinformation” as they define it.",
    "Patients receiving oxygen did better when placed in a prone position, for instance, and the steroid dexamethasone could tamp down the “cytokine storm” in severely ill patients.",
    "Ms. Mello laments “the Supreme Court’s attachment to a particular conception of free speech rights,” which limits the government’s ability to impose speech restrictions.",
    "Early in the pandemic some doctors hypothesized that the virus could spread through aerosols, and therefore 6 feet of distance wouldn’t necessarily prevent infection.",
    "Open Queue\nEarly in the pandemic, Covid patients with very low oxygen levels were put on ventilators, the standard of care for severe respiratory diseases.",
    "To limit that will certainly hamper our progress in understanding and combating this virus.”\nMs. Finley is a member of the Journal’s editorial board.",
    "But some doctors noticed that severely ill patients responded better to noninvasive ventilation such as high-flow nasal tubes.",
    "WSJ Opinion: The Decline of 'Science'—From Climate to Omicron\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "A medical transporter moves a patient into a Covid-19 unit at Mission Hospital in Mission Viejo, Calif., February 2021.",
    "The intolerance of different viewpoints that is infecting the medical profession may itself be a public-health threat.",
    "California’s bill would punish doctors for discussing disfavored ideas, making it almost certainly unconstitutional.",
    "As Dr. Clarke says: “Dissent and discussion are intrinsic to the evolution of scientific and medical knowledge.",
    "Images: AFP/Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "It’s dangerous.”\nWhat’s actually dangerous is silencing debate on critical public-health issues.",
    "They shared their findings with other physicians, and gentler oxygen support became the norm.",
    "Will the Biden Administration appeal, or is it quietly relieved to have the policy ended?",
    "Many recommendations have changed over time as scientists learn more and do more studies.",
    "0:00 / 4:52\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "A couple of doctors in a recent JAMA commentary float some First Amendment workarounds.",
    "“This is a fringe component of epidemiology,” Dr. Collins told the Washington Post.",
    "Some liberal public-health experts say that makes the Constitution the problem.",
    "This outlier view could have been deemed misinformation under California’s law.",
    "Same for doctors who disagree with masking and vaccines for children.",
    "That change in treatment has saved tens of thousands of lives.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Now many think it's all misinformation.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "“This is not mainstream science.",
    "It is now conventional wisdom."
  ]
}