{
  "id": 5075,
  "mediaId": 8475,
  "date": "2022-04-21",
  "headline": "Federal attempts to legalize marijuana flail, even as public support grows",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/042122_marijuana_legalization.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/042122_feds_legal_mj/federal-attempts-legalize-marijuana-flail-even-as-public-support-grows/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Abbott",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/105636",
  "termIds": [
    1433,
    1477,
    1114,
    430,
    6706
  ],
  "sentences": [
    "“Kelly continues to closely evaluate any legislative proposals to nationally de-schedule or decriminalize marijuana and will make decisions based on what’s in the best interest of Arizonans.”\nThe Veterans Medical Marijuana Safe Harbor Act would allow veterans to “use, possess, or transport medical marijuana and to discuss the use of medical marijuana with a physician of the Department of Veterans Affairs as authorized by a state or Indian tribe, and for other purposes.”\nVeterans who qualify for medical marijuana on a state level are currently caught between federal and state law, and are often stigmatized with a “cannabis use disorder” diagnosis that can put them at odds with the VA health care system.",
    "One month later, Warren appealed directly to President Joe Biden, this time with Sen. Jeff Merkley (D-Ore.), to encourage Biden to “pardon all individuals convicted of nonviolent cannabis offenses, whether formerly or currently incarcerated.”\n“Our country’s cannabis policies must be completely overhauled, but you have the power to act now: you can and should issue a blanket pardon for all non-violent federal cannabis offenses, fulfilling your promises to the American people and transforming the lives of tens of thousands Americans,” Warren and Merkley said in a written statement.",
    "Doing so would be an important first step in the broader tasks of remedying the harmful racial impact of our nation’s enforcement of cannabis laws and ensuring that states can effectively regulate the growing cannabis industry, including by assisting small business owners and those most harmed by our historical enforcement of cannabis laws,” the letter concluded.",
    "The MORE Act, thankfully, prohibits discrimination to an eligible small business just because it’s related to cannabis.”\nOther legislative attempts\nIn recent years, a number of federal bills to deschedule and decriminalize cannabis have been proposed, passed the House and then run into Mitch McConnell’s (R-Ky.) wall of obstruction in the Senate.",
    "“Especially now that there’s a competing Republican proposal, that’s probably going to make it even less likely that the CAOA or the MORE Act attracts Republicans, because they’re going to want the Nancy Mace version instead of the Democratic version.”\nMaybe an easier way\nOn Oct. 6, 2021, Sen. Elizabeth Warren (D-Mass.)",
    "Local\nA majority of voters in all 50 states support the idea, but the U.S. Senate doesn’t\nAcross the country, attitudes toward cannabis are becoming more permissive and accepting, but partisan gridlock in Congress virtually ensures that legislation to decriminalize marijuana will languish and die in the U.S. Senate.",
    "and Booker, sent a letter to the Department of Justice asking the agency to use its authority to deschedule and decriminalize cannabis under the Controlled Substances Act of 1970 “in consultation with the Secretary of Health and Human Services.”\nConcerned about keeping quality reporting alive in Tucson?",
    "They are tired of the prohibition of cannabis and how that affects our world.”\nMajority of Americans want legalization\nNational NORML was founded in 1970, the year before President Richard M. Nixon began the modern era of the “War on Drugs” and three years before he created the Drug Enforcement Agency.",
    "The American Civil Liberties Union estimates the U.S. spends upwards of $3.6 billion a year enforcing cannabis prohibition, with the majority of more than 600,000 annual arrests largely affecting people of color, who are nearly four times as likely to be arrested as their white counterparts.",
    "Hoisted by their own petard\nThere may be a point where political triangulation and maneuvering hurt federal attempts, as competing bills receive varying levels of support and those proposing bills seek credit to burnish their electoral possibilities or support members of their own party.",
    "“Decriminalizing cannabis at the federal level via this descheduling process would allow states to regulate cannabis as they see fit, begin to remedy the harm caused by decades of racial disparities in enforcement of cannabis laws, and facilitate valuable medical research,” they wrote.",
    "“We see overwhelming majorities of voters saying they want to repeal federal prohibition, yet we fear we won’t be able to get to a threshold of 60 votes in the Senate,” said Mike Robinette, director of the Arizona National Organization for the Reform of Marijuana Laws (AZNORML).",
    "“The MORE Act would protect veteran-owned cannabis businesses from discrimination under different types of programs like the Small Business Act, and establishes Veterans Business Outreach Centers that provide support and advice and in some cases, financing to veterans,” he said.",
    "“As a candidate for President, you argued that ‘we should decriminalize marijuana’ and ‘everyone [with a marijuana record] should be let out of jail, their records expunged, be completely zeroed out.’ The first and simplest step in the process is a blanket pardon.”\n- 30 -",
    "“A 2015 analysis found that, in the absence of being banked, one in every two cannabis dispensaries were robbed or burglarized—with the average thief walking away with anywhere from $20,000 to $50,000 in a single theft,” wrote CUNA President and CEO Jim Nussle.",
    "Prohibition hit a bipartisan zenith with the “Just Say No” campaign and the enactment in 1986 of the Anti-Drug Abuse Act, which dedicated $1.7 billion to fight the s0-called War on Drugs, establishing mandatory minimum prison sentences for many drug offenses.",
    "The legislation would allow licensed cannabis businesses to operate like any other legal business, with access to banking services, including the use of ATMs, credit cards, access to loans and the ability to make deposits and write payroll checks.",
    "“Senator Kelly has supported the Veterans Medical Marijuana Safe Harbor Act and the SAFE Banking Act, both commonsense efforts that would improve lives and livelihoods,” Kelly spokesperson Arielle Devorah wrote in an email to the Arizona Mirror.",
    "The piecemeal approach to legalization has created many conflicts with federal laws, but now that a majority of states have some type of marijuana legalization, the plant has become a major source of legitimate economic activity nationwide.",
    "The legislation has gained broad support, including Arizona Sen. Mark Kelly, who also supports the SAFE Banking Act, which would allow cannabis businesses access to banking services that are now illegal due to federal prohibitions.",
    "“But there doesn’t actually seem to be much in the way of doing cannabis reform.”\nDebus, a Marine veteran who specializes in Veterans Administration benefits, helps many veterans with issues surrounding medical marijuana use.",
    "And a 2021 Harris Poll found 66% of adults in favor, with younger generations more inclined to favor legalization: Nearly 80% of both Gen X and Millennials backed legalizing marijuana, compared to 48% of Baby Boomers.",
    "Still, cannabis retains its federal status as a Schedule I drug with “no currently accepted medical use and a high potential for abuse.”\nOther drugs on the Schedule I list include heroin, LSD, methaqualone and peyote.",
    "On April 11, the Credit Union National Association (CUNA) sent a letter of support to House leaders Nancy Pelosi (D-CA) and Kevin McCarthy (R-CA), asking that the bill remain attached to the America COMPETES Act.",
    "For instance, it would establish a Cannabis Justice Office to manage an “opportunity trust fund,” that would provide grants and resources for programs, from expungement to community investment to drug treatment.",
    "He believes the MORE Act would not only help the general population, but would also be a boon to veterans who turn to cannabis to treat a variety of ailments from PTSD, to opioid dependency to chronic pain.",
    "Federal attempts to legalize cannabis are not taking place in a vacuum, as many polls show a majority of Americans are in favor of legalization in some form across generational and political lines.",
    "In addition to MORE, other measures to legalize and deschedule marijuana have been proposed, as have bills addressing different aspects of legalization from banking to veterans access to research.",
    "Despite the actions of the Senate, the SAFE Act enjoys broad support from business groups, cannabis activists and large swaths of the banking industry, including the American Bankers Association.",
    "In addition to descheduling, the MORE Act would require federal courts to purge convictions for cannabis-related offenses and allow re-sentencing for individuals with federal convictions.",
    "A recent Gallup Poll shows support at an all-time high, with 68% in support, including 83% of Democrats, 50% of Republicans and 71% of independents in favor of nationwide legalization.",
    "Chuck Schumer (D-N.Y.), Cory Booker (D-N.J.) and Ron Wyden (D-Ore.) are crafting a long-awaited Senate bill similar to the MORE Act, the Cannabis Administration and Opportunity Act.",
    "Mace’s bill relegates much of the control to states, proposes a 3% excise tax, regulates cannabis “like alcohol,” and offers protections to veterans and cannabis business owners.",
    "In an attempt to move it forward again this year, the SAFE Act has been attached to the America COMPETES Act, an unrelated bill that addresses technology and trade in the U.S.",
    "There would also be a community reinvestment grant program to fund job training, reentry services, legal aid, literacy, youth recreation and health education programs.",
    "Black men receive sentences that are 13.1% longer than white men and Latinos are nearly 6.5 times more likely to receive a federal sentence than non-Hispanic whites.",
    "“There seems to be a lot of political will to talk about cannabis reform,” Derek Debus, director of military and veterans law at Stone Rose Law in Scottsdale said.",
    "In a change of tactics last year, Democrats attached the bill to the National Defense Authorization Act for FY 2022, but it was stripped out before final passage.",
    "Earlier this month, the U.S. House of Representatives passed the Marijuana Opportunity Reinvestment and Expungement Act (MORE) by a narrow 220-204 margin.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "In Arizona, the Arizona Medical Marijuana Act passed in 2010, and voters in 2020 approved Proposition 207 to legalize recreational cannabis for adults.",
    "The MORE Act, proposed originally in September 2019 by Rep. Jerrold Nadler (D-N.Y.), was the first cannabis law to find success on a federal level.",
    "A 2021 Rasmussen Poll shows 62% of American adults favor legalization, up from 54% three years ago, while 23% are opposed and 14% are unsure.",
    "And people with marijuana-related convictions would be eligible to hold dispensary licenses as part of an equitable licensing grant program.",
    "Complicating matters further, Rep. Nancy Mace (R-S.C.) has proposed her own version of cannabis legalization, the States Reform Act.",
    "The bill was supposed to be introduced earlier this month, but Schumer last week said it likely wouldn’t be finalized until August.",
    "But starting with Ronald Reagan’s presidency in the 1980s and into the 1990s, the national policy pendulum swung the other way.",
    "It sought not only to legalize and deschedule cannabis, but also legislate remedies for the damage done by the War on Drugs.",
    "And it includes funding for social equity programs in communities that have been hurt most by enforcement of old drug laws.",
    "The American electorate, most elected Democrats and a handful of Republicans are largely in favor of legalizing cannabis.",
    "Over the course of the next 25 years, California’s action sparked a trend that spread to a majority of states by 2016.",
    "Polling data released Wednesday by Civiqs found a majority of voters in all 50 states support legalizing marijuana.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "The Veterans Medical Marijuana Safe Harbor Act has not had a hearing or a vote since it was introduced last year.",
    "At that time, 11 states were in the process of decriminalizing cannabis and support for legalization was growing.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "One, the Veterans Medical Marijuana Safe Harbor Act, was introduced in April 2021 by Hawaii Sen. Brian Schatz.",
    "In 2020, legal sales across the U.S. totaled $20 billion and are projected to reach $40.5 billion by 2025.",
    "It also seeks to right some of the wrongs inflicted on American citizens by the decades-long War on Drugs.",
    "The Secure and Fair Enforcement (SAFE) Banking Act has been around in one form or another since 2013.",
    "As a result, nonviolent drug offenses increased from 50,000 in 1980 to more than 400,000 by 1997.",
    "“Before, veteran-owned cannabis businesses were not eligible for any help under those programs.",
    "“In the Senate, they’re not going to get 60 votes.,” AZNORML Political Director Jon Udell said.",
    "In 2012, Colorado and Washington voters both legalized recreational cannabis use for adults.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "And this is hardly the latest polling to show widespread public support for legal cannabis.",
    "But the tide began to turn when California voters legalized medical cannabis in 1996.",
    "Support levels range from 52% in North Dakota to 81% in both Vermont and Washington.",
    "The poll also found that overall support of medical marijuana legalization was 84%.",
    "It passed in December 2020 by a 228-164 margin before dying quietly in the Senate.",
    "But an evenly split Senate continues to stand in the way of legislative efforts.",
    "As of 2022, adult use is legal in 18 states, the District of Columbia and Guam.",
    "“We urge the DOJ to initiate the process to decriminalize cannabis.",
    "But it won’t pass the Senate, where previous attempts have failed.",
    "The competing bills may see a split in Democratic support.",
    "Support TucsonSentinel.com with a contribution today!",
    "“That’s going against what Americans truly want.",
    "Donate to TucsonSentinel.com today!",
    "Like what you're reading?",
    "Like what you're reading?",
    "Sens."
  ]
}