{
  "id": 5108,
  "mediaId": 2664,
  "date": "2022-04-20",
  "headline": "GOP candidate released a dramatic 'savior' ad – and it might be blowing up in his face: report",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29704678&width=1200&coordinates=0%2C29%2C0%2C21&height=600",
  "link": "https://www.rawstory.com/even-christian-conservatives-don-t-like-az-gop-candidate-s-easter-themed-ad-where-he-refers-to-himself-as-a-savior/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sky Palma",
  "authorUrl": "https://www.rawstory.com/u/sky_palma",
  "termIds": [
    2459,
    2765,
    392,
    1126,
    6360,
    6050,
    5949,
    6427,
    6536
  ],
  "sentences": [
    "By hitching their wagon to Christianity, they retain power, like in Nazi Germany.”\nLamon is among a group of prominent Republicans who falsely claimed to be an elector for Donald Trump in the 2020 presidential election and funded security efforts in the election audit in Maricopa County.",
    "A Republican candidate looking to replace Arizona Democratic Sen. Mark Kelly is getting some blowback for a campaign ad, making it the third time this year his public messaging struck a sour note, according to the Phoenix New Times' Elias Weiss.",
    "Watch the ad below:\nNOW WATCH: GOP Mike Lee won't respond to questions about his involvement in attempts to overturn 2020 election\nGOP Mike Lee won't respond to questions about his involvement in attempts to overturn 2020 election",
    "Darlene Packard, a straight-ticket Republican voter and devout Christian from Prescott, told the New Times that Lamon's rhetoric is the kind of thing that will potentially be the GOP's \"downfall.\"",
    "Speaking to the New Times, Chandler-based trial attorney Tom Ryan, who is a Christian and former GOP voter, said that the ad's offensiveness was due to the \"whole notion that he is the Savior.\"",
    "\"It's a close marriage of church and state that doesn't sit right with everyone in his target audience, a departure from previous attempts,\" Weiss writes.",
    "Self-funded political newcomer Jim Lamon ran an ad that has even some Christian Republicans raising their eyebrows.",
    "“There is a real rise of Christian dominionism, which is not true Christianity at all,” Ryan continued.",
    "Times of plague and turmoil,\" Lamon says in the ad, suggesting he knows God's plan to save America.",
    "“When you go too far to the right, you piss people off and they go the other way.",
    "I get offended at that ‘holier than thou’ attitude,\" Packard said.",
    "In the Easter-themed ad, Lamon hints that he's Arizona's savior.",
    "It made me sick to my stomach when I saw that,\" Ryan said.",
    "“It’s wholly inappropriate and offensive.",
    "“It should be concerning to everybody.",
    "“These are dark times."
  ]
}