{
  "id": 5275,
  "mediaId": 2664,
  "date": "2022-04-10",
  "headline": "Pro-Trump Senate candidate using his campaign to promote billionaire backer's businesses: report",
  "image": "https://www.rawstory.com/media-library/blake-masters.jpg?id=28331767&width=1200&coordinates=0%2C39%2C0%2C40&height=600",
  "link": "https://www.rawstory.com/blake-masters-2657130090/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    3401,
    3627,
    3005,
    5660,
    2459,
    1489,
    1126
  ],
  "sentences": [
    "Thiel helped launch Masters’ career, dumped $10 million into a super PAC backing Masters, appeared with Masters at a Club for Growth donor summit, and is deeply and personally involved with raising money for Masters’ campaign.”\nAdd to that, the report states, is how Masters has plugged Thiel's businesses during interviews.",
    "But a Daily Beast review of business, campaign, and tax records reveals that Masters appears still far from severing his shared interests with his mentor,\" Sollenberger wrote, adding, \"Masters, 34, has never sought political office and hails from the West Coast world of tech capital investment.",
    "According to a report from the Daily Beast, a pro-Donald Trump conservative seeking the GOP nomination for a seat representing Arizona in the U.S. Senate is using interviews about his policy prescriptions to plug businesses owned by his billionaire financial benefactor.",
    "According to the report from the Beast's Roger Sollenberger, Peter Thiel -- one of Facebook's early investors -- is putting a substantial amount of money behind fellow tech executive Blake Masters who is seeking the seat currently being held by Sen. Mark Kelly (D).",
    "\"Masters repeatedly used the platform of his candidacy to shill for his own financial interests, as well as those of his then-boss—a pattern that has extended to campaign fundraising,\" the Beast reports.",
    "\"Masters has also proselytized the online alternative video platform Rumble, saying in a February interview, 'We invested in Rumble, which I think is a really good company,'\" the report continued.",
    "\"On March 11, days before announcing his exit from the Thiel groups, Masters went on Fox News’ most viewed show and pumped another Thiel investment, an alternative search engine called 'Brave.'",
    "It was, in fact, the first question that the show’s host, late-night entertainer Tucker Carlson, brought up, addressing so-called privacy concerns surrounding other search engines.\"",
    "According to Brendan Fischer, deputy executive director at Documented, the records \"further underscores how Masters’ candidacy is almost inseparable from its billionaire backer.",
    "\"Masters announced last month that he had left his top positions at two organizations named after Thiel, who has poured more than $10 million of support into the Senate bid.",
    "Almost all of his adult life has been tied in some way to Thiel, a billionaire Facebook investor and former board member Masters met while studying at Stanford Law School.\"",
    "Masters is currently fighting an uphill battle against Arizona Attorney General Mark Brnovich for the GOP nod, with his candidacy being championed by Thiel.",
    "According to Sollenberger, Masters' connections to Thiel's business interests are currently being scrutinized.",
    "The two largest, Palantir and Anduril, do billions of dollars of business with the federal government.",
    "Masters plugged both of them in a New York Post interview kicking off his candidacy last July.\"",
    "\"Those interests have included major Thiel-backed corporations."
  ]
}