{
  "id": 551,
  "mediaId": 2745,
  "date": "2022-02-25",
  "headline": "U.S. economy appeared ready to surge, but Russia’s invasion of Ukraine could send shockwaves",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4ZI5YKFUCII6XPEW7X2V3ZB354.jpg&w=1440",
  "link": "https://www.washingtonpost.com/business/2022/02/25/economy-us-russia-ukraine-gas/?utm_source=rss&utm_medium=referral&utm_campaign=wp_business",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The president also fired a warning shot at oil and gas giants themselves, adding they “should not exploit this moment to hike their prices.”\n“This is critical to me,” Biden added as he made the case for economic sanctions, before emphasizing of Russia: “This aggression cannot go unanswered.”\nSome Democrats have explored another way to try to ease the pain of higher gas prices, floating the idea of a temporary pause on the federal gasoline tax.",
    "“There is a ton of uncertainty out there — that’s been true for a couple of years now because of the virus — but this is a very distinctive geopolitical event that could cause businesses to hesitate and to put off plans to hire and expand.”\nU.S. markets tumbled Thursday morning, with the three major indexes falling 2 percent or more, before recovering ground in the afternoon following Biden’s announcement of new sanctions.",
    "“We’re already facing higher energy prices — both at the pump and for natural gas, which is raising home heating costs this winter — and both will get worse in the coming months.”\nAlthough it’s too early to assess the conflict’s full impact on the world economy, economists predict a number of cascading effects, starting with things such as fuel prices.",
    "In a speech delivered at the White House, Biden on Thursday sketched out a broad range of sanctions and other penalties targeting vast swaths of the Russian economy — including frozen assets at top banks, sanctions on Kremlin-aligned oligarchs, and limits on exports that might benefit the country’s technology sector.",
    "“The indirect effects are potentially very big and hard to quantify.”\nThose head winds — including higher fuel prices, and new hurdles for making and transporting goods — could lead to even higher prices in coming weeks, and further weigh on Americans’ willingness to keep spending.",
    "There have also been other logistical disruptions: Companies that fly materials and products from Asia to Europe, for example, are scrambling to reroute their paths away from Ukrainian and Russian airspace, said Phil Levy, chief economist for logistics company Flexport.",
    "Despite a low unemployment rate, consumer sentiment is already at its lowest level in a decade, largely because of inflation and dwindling confidence in the government’s economic policies, according to a closely watched index by the University of Michigan.",
    "On Thursday, Federal Reserve Bank of Cleveland President Loretta Mester said the implications from the conflict would be “a consideration” as Fed officials weigh how quickly to pull back on their support for the economy in the medium-term.",
    "The Federal Reserve is still expected to move next month to begin raising interest rates in an effort to slow inflation, but it could face new questions about how best to steer an economy during a rare military conflict involving Russia.",
    "To bring prices under control, the Federal Reserve is slated to raise interest rates when policymakers gather in mid-March, and officials have increasingly signaled that next month’s hike will be only the first in a series this year.",
    "The price of Brent crude oil, the global benchmark, jumped about 8 percent to more than $101 a barrel on Thursday — the first time it’s been in the triple digits since 2014 — while U.S. oil spiked 8.3 percent to $99.70.",
    "Jeremy Schneider, founder of Personal Finance Club, which offers advisory services, said most investors are holding off on large financial decisions until they have a better sense of where things will settle.",
    "Average prices at the pump reached $3.54 per gallon on Thursday, almost a dollar more than they were at the same time last year, according to AAA (and up from their $3.33 per-gallon price one month ago).",
    "A years-long shortage of computer chips has already hobbled the production of everything from cars to washing machines, and economists say further complications could make those shortfalls even worse.",
    "“The broader worries are about how all of this affects consumer and business confidence,” said Karen Dynan, an economics professor at Harvard University and former Treasury Department chief economist.",
    "“The primary impact is going to be on energy prices, but we’re likely going to see a slower recovery this year than we otherwise would have,” said Bill Adams, chief economist for Comerica Bank.",
    "He said his administration would work to “minimize” the potential blowback for the United States and “protect American families and businesses,” particularly in the face of rising gas prices.",
    "President Biden, meanwhile, has said he would consider measures to blunt the impact of rising oil prices on Americans, including the sale of more oil from the Strategic Petroleum Reserve.",
    "“There’s no doubt that when a major nuclear power attacks and invades another country that the world is going to respond and markets are going to respond all over the world,” Biden said.",
    "He added that the government is “closely monitoring energy supplies for any disruption” and raised the potential the U.S. could further tap its petroleum reserves if conditions warrant.",
    "A few weeks ago, the coronavirus’s fading omicron variant, falling gas prices, and a newly buoyant stock market set the table for what many felt could be a surging U.S. economy in 2022.",
    "He warned energy companies not to opportunistically jack up prices, while acknowledging that the economic consequences of Russia’s invasion of Ukraine would be felt by Americans.",
    "These changes could give many consumers and businesses pause and put more pressure on Washington leaders to respond, even though it is unclear how exactly they will intervene.",
    "But those rosy scenarios are suddenly in doubt, as rampant geopolitical uncertainty has helped drive up energy prices and send global markets on a roller-coaster ride.",
    "“Russia and Ukraine are not as tightly integrated into the global supply chain as a lot of other major powers are, but they still supply certain commodities,” he said.",
    "It is also a large source of neon gas, and it supplies the United States with about 40 percent of its semiconductor-grade neon, according to research firm Techcet.",
    "The national unemployment rate remains low, at 4 percent, and most Americans have considerably more money in their bank accounts than they did before the pandemic.",
    "Russia is one of the world’s largest exporters of oil and natural gas, particularly to Europe, with some of its supply flowing through pipelines across Ukraine.",
    "Economists say the crisis could exacerbate supply chain disruptions and create new headaches for farmers, manufacturers and others across the economy.",
    "There are early signs that Russia’s economy is shuddering under the global pressure, with its stock market falling precipitously on Thursday.",
    "Inflation has proved to be a key litmus test for how Americans perceive the economy, with energy and gas prices as a major factor.",
    "GDP grew at a whopping 6.9 percent annualized rate in the last three months of 2021, according to the Bureau of Economic Analysis.",
    "Consumers have continued to spend briskly — with overall spending up 2.1 percent in January, new Commerce Department data show.",
    "The White House has expressed early interest in the idea to halt the roughly 18-cent per-gallon levy until the end of the year.",
    "Mark Kelly (Ariz.) and Maggie Hassan (N.H.) — has faced early resistance from some Democrats and Republicans alike.",
    "For many Americans, those price increases are piling onto inflation that has already skyrocketed to 40-year highs.",
    "But some worry that new turmoil could cause American families and businesses to pull back, at least temporarily.",
    "Benchmark prices of other exports from Russia and Ukraine, such as wheat and corn, climbed to multiyear highs.",
    "Inflation data from January showed that the energy index rose 27 percent compared with the year before.",
    "Fed experts so far say they don’t expect Russia’s attack to alter the central bank’s actions in March.",
    "There would be spillover effects of all the turmoil that impact American consumers, as well, he said.",
    "Ukraine is a major exporter of fertilizer, as well as wheat, corn, and sunflower and grapeseed oils.",
    "Disruptions like this, Biden said, were some of the goals of the global economic pressure campaign.",
    "Even so, the economy has notched blockbuster growth in recent months.",
    "But the pain won’t be contained to just Russia.",
    "But the proposal — chiefly championed by Sens."
  ]
}