{
  "id": 576,
  "mediaId": 2830,
  "date": "2022-02-22",
  "headline": "The ’80s Got Their Foreign Policy Back",
  "image": "",
  "link": "https://www.wsj.com/articles/the-80s-got-their-foreign-policy-back-mitt-romney-barack-obama-2012-presidential-debate-russia-putin-biden-11645565887",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    0
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nRussian Tanks Roll into Ukraine\nValidimir Putin sends his military forces over the border into Eastern Ukraine, after delivering a bellicose speech denying Ukraine's legitimacy and claiming that NATO might use it as a springboard to attack Russia.",
    "“Look, I think it’s fair to say when it comes to Russia, based on only what we know he’s said so far, Governor Romney is mired in a Cold War mindset.”\nIn 2012 Mr. Putin had already invaded Georgia and was walking away from the Nunn-Lugar nuclear arms-control process.",
    "WSJ Opinion: What John Durham Wants to KnowPlay video: WSJ Opinion: What John Durham Wants to Know\n Journal Editorial Report: Paul Gigot interviews Kim Strassel and Holman W. Jenkins on what we've learned from John Durham's latest filings.",
    "Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nPresident Obama used the stage of a presidential debate to mock Mr. Romney.",
    "Open Queue\nAs Vladimir Putin considers how much of Ukraine to conquer, it’s worth recalling a moment when a U.S. presidential candidate was ridiculed by his opponent for being right about the Russian autocrat.",
    "Photo: Scott Keeler/Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (2 minutes)\nAD\nLoading advertisement...\n00:00 / 02:15\n1x\nThis article is in your queue.",
    "“Governor Romney, I’m glad that you recognize that al Qaeda’s a threat because a few months ago when you were asked, what’s the biggest geopolitical threat facing America, you said Russia,” Mr. Obama said.",
    "“And the 1980s are now calling to ask for their foreign policy back because, you know, the Cold War’s been over for 20 years.”\nThe media mostly chortled and said how right Mr. Obama was.",
    "Every recent U.S. President has misjudged Mr. Putin, hoping for a better relationship even as the Russian schemed against the U.S. Mr. Biden is the latest to have learned the hard way.",
    "Two years later, in 2014, Mr. Putin invaded Crimea, his proxies grabbed eastern Ukraine, and in 2015 he intervened in Syria to rescue dictator Bashar Assad.",
    "Republican presidential candidate Mitt Romney gives a speech to supporters at the Sanford International Airport in Sanford, Fla., Nov. 5, 2012.",
    "But just a month ago, Governor Romney called and here again I quote, ‘without question our number one geopolitical foe’ is Russia.",
    "The ’80s did get their foreign policy back, and Mr. Biden could do worse than to invite Mr. Romney to help fight the new Cold War.",
    "We’re referring to Mitt Romney, the GOP nominee in 2012, who said at the time that Russia was America’s main geopolitical foe.",
    "Images: AP/Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "WSJ Opinion: What John Durham Wants to Know\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Can the U.S. and its allies hang together on a sanctions regime strong enough to deter further invasion?",
    "0:00 / 6:32\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "“When we came to office, President Obama reset our relationship with Russia.",
    "As my brother would say, go figure,” the then Vice President said.",
    "In April 2012 Joe Biden used a similar attack line in a speech.",
    "Russia was also opposing U.S. interests around the world.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    ".",
    ".",
    "."
  ]
}