{
  "id": 5941,
  "mediaId": 2822,
  "date": "2022-04-20",
  "headline": "Maricopa County board names new top prosecutor",
  "image": "https://bloximages.chicago2.vip.townnews.com/tucson.com/content/tncms/assets/v3/editorial/a/ec/aecdeefd-793f-5405-b6b4-8b82f9f2450e/626086691e58e.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize",
  "link": "https://tucson.com/ap/state/maricopa-county-board-names-new-top-prosecutor/article_6b3e2b29-3ec5-51cd-9dfe-53b8c3677615.html",
  "mediaOutlet": "tucson.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "BOB CHRISTIE - Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Foster said on Twitter that she appreciated being interviewed by the board and “will make an announcement about my future plans in the coming days.” Godbehere also reacted on Twitter, saying she was disappointed the board chose a “status quo” candidate and is retiring from her Goodyear job to focus on her county attorney campaign.",
    "PHOENIX (AP) — The Maricopa County Board of Supervisors on Wednesday chose one of the three Republicans running to replace former County Attorney Allister Adel to temporarily fill her post, a move that gives longtime prosecutor Rachel Mitchell incumbent status and a leg up in August's GOP primary.",
    "The board interviewed all three Republican candidates on Monday and had them answer three questions in writing about how they would do the job, including whether they believe the Republican-dominated board made a mistake when the board certified the 2020 election results.",
    "The five-member board dominated by Republicans unanimously chose Mitchell, who gained national attention in 2018 when she was named by U.S. Senate Republicans to question a woman during the confirmation hearing for now-U.S. Supreme Court Justice Brett Kavanaugh.",
    "In the various ballot reviews, recounts, and completed and interim reports concerning the election, every outcome shows that Maricopa County administered a fair election with no evidence of tampering or fraud,” Mitchell wrote in her response.",
    "Gates noted that Republican Attorney General Mark Brnovich last week released an interim report that outlined his concerns with county election procedures but did not provide proof of any major issues despite six months of investigation.",
    "“And then particularly with Rachel and her experience and the fact that she will she did run the office back in 2019.”\nGates said there's no guarantee Mitchell will win the election, but the board felt she was highly qualified.",
    "Mitchell said she will work to boost staffing and restore trust in the office beset by criticism, including over a now-discredited gang case brought against demonstrators at an October 2020 protest over police brutality.",
    "\"I really appreciate that these three candidates spoke out publicly and said the board did not err in certifying the 2020 election,” board Chairman Bill Gates told reporters after introducing Mitchell.",
    "“And when we looked at that universe, we made a determination that there just wasn’t any one that kind of jumped out for us, that would fill the bill any better than these guys,” Gates said.",
    "Adel resigned last month amid criticism of her performance, including the dismissal of 180 misdemeanor cases because charges were not filed before the statute of limitations expired.",
    "The board has been heavily criticized by Republicans who support former President Donald Trump's unsupported contention that he lost in Maricopa County and Arizona because of fraud.",
    "Trump issued a statement Monday criticizing Brnovich for “kicking the can down the road” in his report and hinting that he would endorse another Republican in the race.",
    "“Voters must be allowed to decide who the next Maricopa County Attorney will be — without the huge advantage that incumbency provides,” the ACLU’s K.M.",
    "“We want to know that the people who are interested in being county attorney can effectively work with this board, defend this board,” Gates said.",
    "Whoever gets Trump's nod will see a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. Mark Kelly.",
    "The board was required under state law to name a Republican as the interim top prosecutor in the fourth most populous county in the nation.",
    "She also was facing scrutiny over whether an admitted alcohol abuse problem was affecting her ability to do the job.",
    "Brnovich is in a tight race for his party's nomination for U.S. Senate and has been courting Trump’s endorsement.",
    "And, he said, if she wasn't seeking the office they would not be any criticism because of her qualifications.",
    "Doug Ducey’s top lawyer, and Goodyear city prosecutor Gina Godbehere, said the board did the right thing.",
    "She also repeatedly said she would devote her full attention to the job despite running her campaign.",
    "He said the board will soon release a detailed response to the “vague allegations” Brnovich made.",
    "Gates said the board did consider whether to pick a Republican who was not seeking the office.",
    "This material may not be published, broadcast, rewritten or redistributed without permission.",
    "The sole Democratic candidate is Julie Gunnigle, who also sought the office in 2020.",
    "She did not criticize Adel, who was often absent or working remotely.",
    "“As a career prosecutor, I deal in evidence, truth, and facts.",
    "The ACLU of Arizona criticized the board for the appointment.",
    "Mitchell and the other two GOP candidates, Anni Foster, Gov.",
    "Mitchell briefly served as acting county attorney in 2019.",
    "But it was not required to name one of the candidates.",
    "The woman accused Kavanaugh of sexual assault.",
    "Copyright 2022 The Associated Press.",
    "Bell said in a statement.",
    "All rights reserved."
  ]
}