{
  "id": 595,
  "mediaId": 2526,
  "date": "2022-02-19",
  "headline": "Pinkerton: Joke of the Day: ‘Vulnerable’ Senate Dems Propose Cutting Gas Tax",
  "image": "https://media.breitbart.com/media/2022/02/gas-prices-dems-getty-640x335.jpg",
  "link": "https://www.breitbart.com/economy/2022/02/19/pinkerton-joke-of-the-day-vulnerable-senate-dems-propose-cutting-gas-tax/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James P. Pinkerton",
  "authorUrl": "https://www.breitbart.com/author/james-p-pinkerton/",
  "termIds": [
    0
  ],
  "sentences": [
    "Sen. Mark Warner of Virginia told Politico that he’s “reluctant.” And Sen. Joe Manchin of West Virginia, noting that a cut in the gas tax would drain money from the Highway Trust Fund, added, “People want their bridges and their roads,” saying of the new tax-cut plan,”it just doesn’t make sense.”\nStill another prominent Democrat, former Treasury Secretary Larry Summers–who has been steadily critical of Biden policies, calling them inflationary— told the Washington Post that a gas-tax holiday was “short-sighted, ineffective, goofy and gimmicky.”\nFor their part, Republicans were even more mocking: “It’s blatantly transparent,” snapped Sen. John Thune of South Dakota.",
    "Politico added slyly, “It’s no coincidence that the Democrats most involved in the new push hail from the toughest battlegrounds.” And the article further added that in light of the failure of big-ticket legislative items such as Build Back Better, Democrats are “racing to cobble together an agenda that convinces voters that the party is responding to their biggest concern: rising costs.”\nWe can pause to observe that rising costs, aka inflation, have always been a Democratic weakness because the party’s basic bent is toward high spending that has the predictable effect of overheating the economy and thus driving up prices.",
    "“This isn’t something they’d be rolling out unless they were looking at polling that suggests they are taking on a lot of water as result of a huge spike in gas.”\nYet revealingly, even now, as Democrats scramble to do something about the high energy prices they have caused, their own appointees keep working to drive them still higher.",
    "As the publication explained, four Democratic senators all up for re-election in 2022— Mark Kelly of Arizona, Maggie Hassan of New Hampshire, Catherine Cortez Masto of Nevada, and Raphael Warnock of Georgia—are now in favor of suspending the federal gasoline tax, which is 18.4 cents a gallon.",
    "We should note that this is exactly what hardcore Democratic voters want: Polls show that climate change is the most important issue for blue voters, heavily tilted as they are toward affluent post-industrial, anti-auto cities such as San Francisco and Seattle.",
    "(Here at Breitbart News, this author has written much about one of those green zealots, Sarah Bloom Raskin, whom Biden appointed to the Federal Reserve after she wrote in favor of using Fed regulatory power to choke off financing for the fossil-fuel industry.",
    "(@SenBillCassidy) February 18, 2022\nIn fact, oil is up above $90 a barrel, and some pundits suggest that if war erupts between Russia and Ukraine, the price of oil could hit $150 a barrel, which would in turn mean U.S. gas prices of $7 a gallon or more.",
    "Cassidy highlighted the geopolitical threat, as well as the inflationary threat:\nThis FERC policy announcement all but guarantees no new natural gas construction permits will be issued this year and amounts to a de facto natural gas export ban.",
    "The deep green reality of the Bidenites was further driven home on February 18 by Sen. Bill Cassidy, (R-LA), who ripped the Biden appointees at the Federal Energy Regulatory Commission (FERC) for blocking new permits for natural gas.",
    "For instance, the Biden administration is happy sending climate envoy John Kerry–using a government jet, instead of his own private jet–all around the world, preaching scarcity for everyone but him and his fellow billionaires.",
    "As we remember, on its first day in office, back on January 20, 2021, the Biden administration cancelled the Keystone XL Pipeline, and it has carried on a determined bureaucratic war against carbon energy ever since.",
    "Regarding high energy prices—high prices engineered, once again, by this administration—the White House is now saying, “All options are on the table.”\nSuch whipsawing on energy policy is too much for some Democrats.",
    "By contrast, the Jimmy Carter-esque polices of Biden have left America weak on energy (albeit strong on wokeness), even Biden’s Department of Energy projects that the U.S. will once again be an energy importer.",
    "It has to be replaced by renewable energy.” And when it came into office the following year, the Biden administration put a date next to that pledge, committing to reach zero CO2 emissions by 2050.",
    "The nationalist and deregulatory energy policies of Donald Trump made America back into a great energy superpower, fully able to provide for itself and export energy to allies and other customers.",
    "Sample headline from last June: “Biden may hinder oil and gas drilling even after court loss.”\nIn other words, true to their campaign pledge, the Bidenites were dogged in their green zeal.",
    "And that same campaign year, candidate Joe Biden declared, “I would transition from the oil industry, yes.” He added, “It’s a big statement because the oil industry pollutes significantly.",
    "And yet it wasn’t so long ago that Democrats were mostly in favor of steps to reduce drilling for oil and natural gas, knowing full well that clamping down on supply would raise prices.",
    "Yet now, with the midterm elections barely more than eight months away, endangered Democrats are doing a 180, offering not more production, but instead, a tax-abatement gimmick.",
    "This FERC policy announcement all but guarantees no new natural gas construction permits will be issued this year and amounts to a defacto natural gas export ban.",
    "Here’s an actual headline good for some laughs: “Vulnerable Senate Dems try to run as tax-cutters.” That howler of a header appeared this week in Politico.",
    "And yet now, as Biden’s national approval rating skids into the mid-30s, the administration is thinking about joining those embattled Democratic senators.",
    "The Biden Deep State is still following through on the original green plan, not realizing–or not caring–that there’s a new plan in the offing.",
    "Given that overall commitment, no righteous green was going to be sorry to see carbon-energy prices rise as a way of pricing out consumption.",
    "All the while, Europe is dependent on Russian natural gas and we are in the midst of a global energy crisis hurting Americans’ pocketbooks.",
    "Fortunately, for some 10 million American energy jobs, Republicans in the U.S. Senate have blocked Raskin from reaching that post.)",
    "And the last thing the greens would want is a cut in costs, as that would encourage more consumption of the dreaded carbon fuels.",
    "Yet now, having ballooned federal spending and the money supply, the Democrats shouldn’t be surprised that inflation is raging.",
    "Which is to say, we are dependent on other countries for the fundament of our economic prosperity and our national security.",
    "Notably, national gasoline prices have surged by 40 percent in the last year, from around $2.40 a gallon to $3.40.",
    "Indeed, it was just in 2020 that House Democrats unveiled a plan for eliminating CO2 from cars by 2035.",
    "And yet because it’s only a gimmick, if it happens in 2022, it can easily enough be undone in 2023.",
    "The greens are counting on that, as they continue their hoped-for forced march to a green utopia.",
    "So it’s obvious what Democrats as a whole really think: We shouldn’t have a fossil-fuel industry.",
    "To their way of thinking, higher prices for carbon fuels were a feature not a bug.",
    "So sure, an 18-cent cut the gas tax might help consumer pocketbooks.",
    "“[It’s] obviously very politically motivated,” he said.",
    "Senator Bill Cassidy, M.D.",
    "And that’s no joke.",
    "(4/7)\n— U.S.",
    ".",
    ".",
    "."
  ]
}