{
  "id": 624,
  "mediaId": 2883,
  "date": "2022-02-22",
  "headline": "Ukraine supplemental money bill could be in the offing",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/02/graham528_062421.jpg",
  "link": "https://rollcall.com/2022/02/22/ukraine-supplemental-money-bill-could-be-in-the-offing/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John M. Donnelly",
  "authorUrl": "https://www.rollcall.com/author/john-m-donnelly/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We must also shore up NATO’s defenses along its eastern flank and make clear that aggression against NATO countries will be met with an overwhelming collective response.”\nMcConnell also leveraged the crisis to make the case for increasing overall defense and intelligence spending to better deal with military challenges from Russia and China\nSen. Mark Kelly of Arizona, a Democrat and member of the Armed Services Committee, on Tuesday advocated the immediate imposition of \"significant\" sanctions on Russia and also endorsed more weaponry for Ukraine.",
    "“No matter what happens in the coming days, we must assure that the dictator Putin and his corrupt oligarchs pay a devastating price for their decisions.”\nThe delegation was led by Graham and Sen. Sheldon Whitehouse, D-R.I., and included Armed Services and Defense Appropriations members from both parties in both chambers.",
    "He also proposed requiring the creation of an executive branch interagency task force to devise and implement sanctions against Russian oligarchs aligned with Putin in what Graham called “a mafia state.”\n“As Putin tries to dismember NATO, we need to try to make it stronger,” Graham said.",
    "The White House over the weekend implemented limited sanctions against doing business with regions in eastern Ukraine that Russia has begun to invade, and President Joe Biden is expected to put in place on Tuesday the more \"severe\" sanctions they have promised for weeks.",
    "And while the U.S. government has stepped up in recent weeks weapons deliveries to Ukraine and to NATO allies on the Russian front — including bolstering them with thousands of new U.S. troops and weapon — Congress appears poised to accelerate this trend, too.",
    "The senators in the delegation were Democrats Richard J. Durbin of Illinois, Amy Klobuchar of Minnesota, Jeanne Shaheen of New Hampshire, Mark Warner of Virginia, Chris Coons of Delaware, Christopher S. Murphy of Connecticut and Chris Van Hollen of Maryland.",
    "I think one of the things he's going to test is whether or not America has the will to push back.”\nHe was particularly pointed about the need for the United States and NATO to treat Russian cyberattacks as equivalent to so-called kinetic military strikes.",
    "We need to create a mechanism for Putin and his cronies to pay a heavy price to deter further aggression.”\nMcConnell urges more aid\nAlso on Tuesday, Senate Minority Leader Mitch McConnell, R-Ky., issued a statement backing the same policy thrusts.",
    "Until now, Republicans have pushed for enacting tougher sanctions against Russia sooner than the Biden administration has preferred, but many Democrats and the White House have wanted instead to hold fire on the sanctions to see how Russia acted.",
    "“What I am saying is that cyberattacks coming from Russia need to be considered in terms of Article 5 responsibilities,” Graham said, a reference to NATO members mutual commitment that an attack on one is an attack on all.",
    "‘Mafia state’\nSen. Lindsey Graham of South Carolina, a senior Republican appropriator and longtime critic of Russian President Vladimir Putin, said he wants Congress to act on a supplemental spending bill next week.",
    "“I want to put money on the table to help NATO allies living in the shadow of Russia regarding cyberattacks, and I would expect — in the coming days, if not hours — cyberattacks against Ukraine,” Graham said.",
    "\"We pledge to work toward whatever emergency supplemental legislation will best support our NATO allies and the people of Ukraine, and support freedom and safety around the world,\" the lawmakers said.",
    "Munich communique\nThe Senate GOP proposals come one day after a similar message from a bipartisan group of 21 members of Congress who attended the 2022 Munich Security Conference this past weekend.",
    "He told reporters funds should be allocated to help Ukraine and America’s NATO allies in Eastern Europe defend themselves against kinetic military attacks and cyber onslaughts from Russia.",
    "And lawmaker-crafted sanctions beyond those the Biden administration is implementing via presidential powers may have become more likely as a wider war in Ukraine may already be underway.",
    "Article 5 cyber defense\nGraham also said Tuesday that as the Ukraine crisis deepens, cyber defenses must be bolstered inside Ukraine, among NATO allies — and in the United States itself.",
    "Democratic House members who backed the statement were Jim Langevin of Rhode Island, Jason Crow of Colorado, Tom Malinowski of New Jersey and Elissa Slotkin of Michigan.",
    "“The United States and all friends of Ukraine must ensure a pipeline of support, including arms, flows to Ukrainians resisting Russian aggression,” McConnell said.",
    "Republican House members in the delegation were Michael R. Turner of Ohio, Jim Banks of Indiana, Earl L. \"Buddy\" Carter of Georgia and Darrell Issa of California.",
    "Lawmakers say they are discussing legislative responses to the Ukraine crisis, including a new funding bill, and some want to see Congress act on them next week.",
    "But recent congressional statements and the news from Ukraine of the start of a Russian invasion suggest bipartisan support for additional sanctions could grow.",
    "Republican senators included Ben Sasse of Nebraska, Dan Sullivan of Alaska, Joni Ernst of Iowa and Tommy Tuberville of Alabama.",
    "Members of both parties have signaled support in the last two days for such a supplemental spending measure.",
    "“Cyberattacks are going to be a method that Putin uses to intimidate the region and maybe come after us.",
    "Graham did not offer a specific amount to be spent and did not advocate sending U.S. troops to Ukraine.",
    "“The emergency supplemental needs to help our allies and provide more assistance to Ukraine."
  ]
}