{
  "id": 6257,
  "mediaId": 2557,
  "date": "2022-04-10",
  "headline": "REPORT: Now 11 DEMOCRATS oppose Biden ending migrant expulsion policy Title 42",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-1236160591.jpg",
  "link": "https://dennismichaellynch.com/report-now-11-democrats-oppose-biden-ending-migrant-expulsion-policy-title-42/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    0
  ],
  "sentences": [
    "We want law and order at the border.”\nThe Daily Mail lists the following Democrats as being in support of keeping the program in place:\nSenators:\nKrysten Sinema of Arizona\nJoe Manchin of West Virginia\nMark Kelly of Arizona\nMaggie Hassan of New Hampshire\nJon Tester of Montana\nRepresentatives:\nHenry Cuellar, Texas\nTom O’Halleran of Arizona\nJared Golden of Maine\nStephanie Murphy of Florida\nChris Pappas of New Hampshire\nGreg Stanton of Arizona\nMeanwhile, large groups of illegal aliens are continue to pour across the border:\nHappening Now:\nRio Grande City agents are currently in La Grulla, TX with a large group of 100+ migrants.",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DailyMail:\nRepresentative Henry Cuellar became the latest Democrat to join bipartisan legislation against President Joe Biden ending Title 42, which allowed for immediate expulsion of illegal immigrants during the coronavirus health emergency.",
    "THERE IS NO WAY THAT THIS NATION CAN SURVIVE THIS INVASION FROM THESE FILTHY CRIMINAL ILLEGALS, THEY ARE ALREADY FLYING HUNDREDS IN THE MIDDLE OF THE NIGHT ACROSS THIS NATION AND LETTING THESE SCUMBAGS GO INTO COMMUNITIES, NO VETTING, MANY HAVE COVID, MANY ARE THE WORST OF THE WORST AND THIS IS WHAT THE ROGUE GOVERNMENT IS DOING TO WE THE CITIZENS OF THIS COUNTRY.",
    "The article goes on to state the following:\n‘Title 42 should not be lifted,’ Cuellar told Fox News when announcing he signed onto the legislation, claiming if his party doesn’t ‘stand up and do the right thing, they’re going to be hit hard by the Republicans’ in the 2022 midterm elections.",
    "pic.twitter.com/OlkDgSaxsT\n— Chief Patrol Agent Brian Hastings (@USBPChiefRGV) April 8, 2022\nAnd the Biden administration is continuing to fly illegal aliens into New York in the middle of the night:\nSecret Biden flights from southern border are back at Westchester County Airport.",
    "pic.twitter.com/AXUPz0tubo\n— Rob Astorino (@RobAstorino) April 10, 2022\nNow 11 DEMOCRATS oppose Biden ending Title 42 https://t.co/Bv8nn0G7t9\n— Daily Mail US (@DailyMail) April 10, 2022\nTo get more information about this article, please visit DailyMail.",
    "OUR CHILDREN AND FAMILIES ARE AT RISK, WE CANNOT LET THIS CONTINUE, THIS NATION IS BEING INVADED BY CRIMINAL ILLEGALS FROM OVER 140 COUNTRIES AND THEY ARE BAD NEWS.",
    "Arguing for why Biden should keep Title 42 in place, Cuellar said, “But some of us are standing up and saying this is the right thing to do for the border.",
    "BIDEN HAS DECLARED WAR AGAINST THE CITIZENS OF THIS COUNTRY AND IF PEOPLE CANT SEE WHAT HE IS DOING THEY ARE STUPID.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "Cuellar’s move now makes six House and five Senate Democrats who oppose lifting the pandemic-era rule.",
    "Last night, RGC agents apprehended an additional 126 migrants in the same location.",
    "We all believe in immigration reform, but we don’t want chaos at the border.",
    "2 buses went south and one went to Somers in northern Westchester.",
    "WE ALL HAD BETTER ARM UP AND FIGHT BACK AGAINST THIS INVASION.",
    "iAero 737 from El Paso landed Saturday at 9:43pm.",
    "IS THIS WHAT WE ARE GOING TO LET HAPPEN AMERICA?",
    "Listen to the latest daily DML podcasts below!",
    "When will US govt answer my Feb 1 letter?",
    "Public has a right to know.",
    "Then please share."
  ]
}