{
  "id": 6474,
  "mediaId": 2695,
  "date": "2022-04-15",
  "headline": "With elections in view, vulnerable Democrats defect from Biden on Title 42 immigration order",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY4NTU2OS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwNjA4NjgyM30.4hW6-6XHV_P6zajWEm5e_CnUME2oxOnjIawPMUwV6x8/img.jpg?width=1200&coordinates=0%2C0%2C0%2C166&height=600",
  "link": "https://www.theblaze.com/news/vulnerable-democrats-defect-from-biden-on-title-42-immigration-order",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Pandolfo",
  "authorUrl": "https://www.theblaze.com/u/christopherpandolfo",
  "termIds": [
    0
  ],
  "sentences": [
    "Democratic senators from Arizona and Nevada, and even states far from the border like Georgia and New Hampshire, are sounding the alarm and demanding a better plan from the president as the Department of Homeland Security predicts there will be anywhere from 6,000 to 18,000 additional border encounters per day once the Title 42 order is rescinded.",
    "Conservatives and border hawks have argued that rescinding the order will lead to chaos at the southern border, with tens of thousands of illegal immigrants entering the country and criminal elements taking advantage of the situation for human and drug trafficking as well as violent crime.",
    "Vulnerable Senate Democrats up for re-election this year are openly criticizing the Biden administration's plan to end the COVID-19 pandemic health order restricting the ability of illegal immigrants to seek asylum at the U.S.-Mexico border.",
    "When the Biden administration announced the order will be rescinded on April 1, Nevada Sen. Catherine Cortez Masto, a Democrat from a swing state near the southern border, accused the administration of \"acting without a detailed plan.\"",
    "On Thursday, GOP lawmakers on the Senate Judiciary Committee called for a hearing on the BIden administration's decision to end Title 42 and cited statements from their Democratic colleagues, including Sinema, Hassan, and others.",
    "In a statement, she said she \"heard from border agents about the urgent need for additional resources – including personnel, technology, and physical barriers – to help ensure that we have safe, secure, and humane borders.\"",
    "Sen. Maggie Hassan, a Democrat from New Hampshire and a member of the Senate Homeland Security Committee, visited the southern border in Arizona this week and spoke with law enforcement about the needs of border agents.",
    "“We share the concerns raised by our Democratic colleagues and are troubled by the potential consequences of rescinding Title 42 without a detailed plan in place to effectively deal with the aftermath,” they wrote.",
    "Kyrsten Sinema and Mark Kelly have each opposed rescinding the order, with Sinema saying that the health order should be extended just like the CDC extended the federal mask mandate on public transportation.",
    "“The situation at the border today is the culmination of the policies that they’ve supported,” Jack Pandol, a spokesman for the GOP's Senate Leadership Fund, said in a statement to the Washington Post.",
    "The Trump administration issued the Title 42 order during the pandemic to require migrants seeking asylum in the U.S. to wait outside the country for their applications to be processed.",
    "\"I warned them about this months ago, talking to CBP about it and the Department of Homeland Security, and they do not have a plan in place on how to deal with the increased numbers.",
    "But as the November election draws nearer and polls show border security is a top priority for voters, some Democrats are speaking out against what the majority of their party wants.",
    "“This is the wrong way to do this and it will leave the administration unprepared for a surge at the border,” she said in a statement, calling for comprehensive immigration reform.",
    "They can highlight the failures of the Biden administration and force moderate Democrats to take positions unpopular with their progressive activist base at the same time.",
    "The order gave immigration enforcement the authority to expel tens of thousands of migrants who were in the country, some of whom had not yet filed asylum claims.",
    "Sinema and James Lankford (R-Okla.) that would require all COVID-19-related national states of emergency to be lifted before Title 42 is officially terminated.",
    "“You are seeing them changing course and trying to sidestep political blame for the situation they helped create, and voters aren’t going to buy that.”",
    "Republicans have uniformly opposed rescinding the Title 42 order, while a majority of Democrats have called on President Joe Biden to end the policy.",
    "Kelly has criticized the Biden administration for lacking a plan to deal with the expected surge in illegal immigration if the order is rescinded.",
    "And it's going to be ... to be honest, it's going to be a crisis on top of a crisis,\" Kelly told local news station KGUN-TV earlier this week.",
    "Progressives and immigration activists have opposed the order, calling it a violation of U.S. and international laws and an immoral policy.",
    "Michael Bennet (Colo.) and Raphael Warnock (Ga.) have criticized the end of Title 42 as well.",
    "Hassan's office pointed out that she's signed on to bipartisan legislation from Sens.",
    "Republicans know Democrats are divided on this issue and are pressing the attack.",
    "But it's not just border Democrats opposed to Biden's plan.",
    "Talking about the border is a win-win for Republicans.",
    "Other border-state Democrats have spoken out as well.",
    "Other Democrats including Sens.",
    "Arizona Sens."
  ]
}