{
  "id": 6700,
  "mediaId": 8347,
  "date": "2022-04-14",
  "headline": "Rep. Grijalva splits with Senators on Title 42",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/ae2923a/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fx-default-stgec.uplynk.com%2Fausw%2Fslices%2F6dd%2Ff0fe4276ab8344079f404f1ac9c377b7%2F6dd3d4af39da44adabd3ad7e917586f1%2Fposter_abb17c2af53146f18a9672e5fe599581.jpg",
  "link": "https://www.kgun9.com/news/local-news/rep-grijalva-splits-with-senators-on-title-42",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Craig Smith",
  "authorUrl": "https://www.kgun9.com/craig-smith",
  "termIds": [
    2459,
    5057,
    4905,
    2765,
    1489,
    1477,
    6226,
    5949,
    6667
  ],
  "sentences": [
    "I’ll keep pushing for transparency and accountability from the Administration to help secure the border, keep Arizona communities safe, and ensure migrants are treated fairly and humanely.”\nGrijalva says there will be stress on the border with or without Title 42.",
    "Congressman Raul Grijalva says there is a plan the House sent to the Senate that calls for more border resources, processing and humanitarian support but any plan has to cope with a system that was already short of what it needs to function.",
    "With more than 30 years of reporting in cities like Tampa, Houston and Austin, Craig has covered more than 40 Space Shuttle launches and covered historic hurricanes like Katrina, Ivan, Andrew and Hugo.",
    "And to be honest, it's going to be a crisis on top of a crisis.”\nIn a statement, Senator Sinema noted the administration extended COVID precautions like masks on public transportation and said.",
    "“The Administration’s extension of public health emergency authorities proves the need to delay lifting Title 42 to protect the health and safety of Arizona communities and migrants.",
    "\"I warned them about this months ago, talking to CBP about it and the Department of Homeland Security, and they do not have a plan in place on how to deal with the increased numbers.",
    "TUCSON, Ariz. (KGUN) — The people Arizonans elected to represent us in the House and Senate are split over the best way to handle a major change in immigration policy.",
    "Mark Kelly and Kyrsten Sinema both say there is no plan and say Title 42 should stay in place until there is one to deal with the surge of immigrants they expect.",
    "In Douglas on Wednesday, Senator Mark Kelly said the immigration system was stressed before Title 42 and lifting the restriction should make things worse.",
    "He says the government can quickly increase processing ability and assistance for humanitarian groups who provide much of the help to incoming immigrants.",
    "Craig enjoys using innovative writing and visuals to make difficult stories easier to understand and his work has been recognized with numerous awards.",
    "Title 42 made it harder for asylum seekers to enter the US and stay temporarily while immigration officials decide if they can stay permanently.",
    "It’s talking about the borderlands and the economic issues that are needed there.”\nGrijalva knows he’s at odds with both of Arizona’s Senators.",
    "Now the Biden Administration is looking to lift Title 42 next month and there’s a lot of debate over whether the country is ready for that.",
    "Share your story ideas and important issues with Craig by emailing craig.smith@kgun9.com or by connecting on Facebook and Twitter.",
    "The Trump Administration invoked a portion of Title 42 in the name of keeping COVID from coming across the border from Mexico.",
    "That’s leading to fears pent up demand to enter the U.S. will lead to an overwhelming surge of immigrants.",
    "“That whole process was starved of hearing officers, of review, of vetting procedures and a process.",
    "Then he hopes for a more comprehensive plan for the border and the forces that drive immigration.",
    "President Biden’s plan to lift a rule called Title 42 is raising fears of an immigration surge.",
    "A Federal health regulation has become one of the hottest topics in the world of immigration.",
    "The other part of the plan is much more comprehensive than talking about the Border.",
    "Craig enjoys the way reporting can be a passport to interesting experiences.",
    "Now the Biden Administration says it will lift Title 42 on May 23.",
    "It restricts immigration and allows quicker deportation.",
    "And so part of the plan is there and its resources.",
    "——-\nCraig Smith is a reporter for KGUN 9.",
    "STAY IN TOUCH WITH US ANYTIME, ANYWHERE",
    "It also led to quicker deportations."
  ]
}