{
  "id": 6703,
  "mediaId": 2716,
  "date": "2022-04-11",
  "headline": "Countdown to the Democrats' doomsday",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1649258493/elephant donkey crush.jpg",
  "link": "https://theweek.com/2022-election/1012223/countdown-to-the-democrats-doomsday",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Faris",
  "authorUrl": "https://theweek.com/authors/david-faris",
  "termIds": [
    0
  ],
  "sentences": [
    "Young parents whose universal daycare and paid family leave aspirations were crushed under the foot of Joe Manchin's deficit paranoia, climate voters who were hoping for more than just rejoining the Paris Accords, racial justice activists who have been delivered precisely nothing in the form of police and criminal justice reform — there has never been a greater risk of mass indifference from a crucial component of the party's coalition.",
    "Earlier this month, young Democratic strategist David Shor issued an apocalyptic warning to his followers, arguing that the \"modal outcome\" of his modeling for the Senate showed Republicans picking up a filibuster-proof, 60-vote majority over the next two election cycles, even if Democrats win a slim majority of the two-party vote.",
    "When President Biden is up for re-election, Democrats will have to defend incumbents in deep-red Montana (Jon Tester), Ohio (Sherrod Brown) and West Virginia (Joe Manchin), a task that will be made more challenging during a presidential election year when partisan identity is more important than ever.",
    "The swing-seat House Democrats who asked their colleagues to avoid alienating suburban voters have gotten almost everything they wanted — a big, bipartisan infrastructure bill and little else that wasn't painstakingly watered down for the sake of enlisting a handful of Republicans.",
    "Well, there are two more Democratic incumbents up in Arizona (Kyrsten Sinema) and Nevada (Jacky Rosen), as well as in the competitive states of Wisconsin (Tammy Baldwin), Maine (Angus King), Minnesota (Amy Klobuchar), Pennsylvania (Bob Casey) and Michigan (Debbie Stabenow).",
    "Shor thinks that they need \"big structural changes in the Democratic party's coalition,\" presumably by adopting issue positions that fall under his \"popularism\" rubric of avoiding policies that aren't backed by significant majorities of the public.",
    "The fact that the blame for this inaction lies mostly with senators Manchin and Sinema is not going to do much for the rest of the party on election day because most people do not pay close enough attention to politics to make that distinction.",
    "To his credit, he is a proponent of the democracy and institutional reforms that would make a Republican Senate supermajority more or less impossible — statehood for D.C. and Puerto Rico, and aggressive voting rights legislation, for starters.",
    "The Fox News propagandists who just turned \"grooming\" into a national buzzword don't care if national Democrats shovel more money at the police or overreact to a modest increase in some crimes with some draconian show of carceral force.",
    "A cops-and-austerity agenda as the course corrective for what ails the party is especially puzzling since this presidency has been a bonanza for moderate centrists who want incremental or possibly even just hypothetical change.",
    "Since there's no sign of that changing, the biggest, easiest boosts to the party's electoral fortunes are all off the table, leaving Democrats to fight these internecine strategy battles instead of delivering on their agenda.",
    "It sounds like a heavy lift until you remember that Republicans picked up nine seats in 2014 alone, and the increasing rural-urban divide between the parties gives the GOP an increasing advantage in the Senate.",
    "He almost certainly has the ear of the president, whose recent embrace of increasing police funding and bringing down the deficit seem designed explicitly to address voter concerns about crime and inflation.",
    "The problem is that these are moves that will alienate the party's young, racially diverse supporters, and this is a voting bloc that has already been comprehensively alienated by this Democratic government.",
    "Remember that Shor's model sees Republicans with a governing trifecta and 55+ Senate seats even if Democrats win slim majorities of the two-party vote for Congress and the presidency in 2022 and 2024.",
    "Baldwin and Klobuchar are both popular and won landslide victories in 2018, but Sinema is toxic even in her own party and is unlikely to successfully win the Democratic nomination if she seeks it.",
    "All six of these states are either ranked even on the Cook Political Report's Partisan Voting Index (PVI) or lean Republican, meaning Democrats need a favorable environment to win or hold a race.",
    "Yes, there were other shifts, but a collapse in turnout from the most lopsidedly Democratic age bracket is going to be difficult to overcome in race after race if the problem is not addressed.",
    "The fact that no amount of 'popularism' is going to fix that doesn't make Shor's ominous predictions any less plausible, and Democrats have no choice but to get to work and hope for the best.",
    "The only remotely plausible Democratic flips in 2024 are in Texas and Florida, and in a world where President Biden is fighting a close race for re-election, they are probably out of reach.",
    "If I'm a Democratic strategist, I might be wondering how exactly the dream presidency of the moderates has put the party on the verge of decisive repudiations in both chambers of Congress.",
    "There are limits, to be clear, to any strategy in a world in which the GOP has the ability to win electoral majorities in American governing institutions without majority support.",
    "Democrats cannot simply offer unfulfilled promises to a large and growing bloc that delivers the party double-digit margins in most elections and expect them to stay in line.",
    "There are four vulnerable Democrats up for re-election, in Georgia (Raphael Warnock), Arizona (Mark Kelly), Nevada (Catherine Cortez-Masto) and New Hampshire (Maggie Hassan).",
    "Take the GOP's big upset win in the Virginia gubernatorial race last year — widely interpreted as a parents' revolt against school closures and \"Critical Race Theory.\"",
    "If they run the table in these races, and hold their own toss-up seats in Pennsylvania and Wisconsin, Republicans could walk away with a 54-seat majority in November.",
    "What Shor and his allies are really asking is for Democrats to tack to the center away from the tone and content of the 2020 primaries, which they have already done.",
    "While everything would have to bounce right for Republicans for this to happen, it is not an implausible scenario — and that should absolutely terrify Democrats.",
    "The scary thing is that this year's Senate map is pretty decent for Democrats, comparatively, and two years from now that will not be the case.",
    "The Senate is currently split 50-50, and to get to 60, Republicans would have to net 10 pickups in the upper chamber over the next two cycles.",
    "All of this is to say that moving right on issues where the GOP already has established a clear advantage is unlikely to pay dividends.",
    "In 2020, when Biden carried the state by 10 points, 18-29 year-olds were 20 percent of the electorate according to exit polls.",
    "But most of those ideas are dead on arrival as long as one or more Senate Democrats remains committed to the filibuster rule.",
    "These voters may have unrealistic expectations of what the political system can deliver, but they are owed more than this.",
    "Let's say Republicans take two of those three, leaving them four net pickups short of a 60-seat filibuster-proof majority.",
    "If Manchin retires or switches parties in the interim, the West Virginia race in particular will be a layup for the GOP.",
    "Casey, King, Stabenow, and Rosen could all probably be had if Biden is still as unpopular as he is today.",
    "These are mostly strong Democratic incumbents, but that might not matter much in a wave election year.",
    "They will hammer them as soft-on-crime police abolitionists either way.",
    "What can Democrats do to avoid this catastrophe?",
    "What happens when this group doesn't turn out?",
    "A year later, they were just 10 percent.",
    "Where do the rest come from?",
    "Here's how it could happen.",
    "Start with this year."
  ]
}