{
  "id": 677,
  "mediaId": 2830,
  "date": "2022-02-22",
  "headline": "A Ruse to Block New York’s New Charter Schools",
  "image": "",
  "link": "https://www.wsj.com/articles/a-ruse-to-block-new-yorks-new-charter-schools-teachers-union-suny-authorizer-john-liu-eric-adams-11644961144",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    0
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Free Expression\nLawrence H. Summers\nIn this episode of \"Free Expression,\" former U.S. Treasury Secretary Lawrence H. Summers tells Gerry Baker why he would have rather been wrong in predicting the high rate of inflation, why the risk of a recession is high, and why the idea of a federal gas tax holiday is \"the ultimate policy gimmick.",
    "The headquarters building of the State University of New York (SUNY) system in Albany, N.Y.\n Photo: David Boe/Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (3 minutes)\nAD\nLoading advertisement...\n00:00 / 02:45\n1x\nThis article is in your queue.",
    "The National Association of Charter School Authorizers calls SUNY “one of the top charter school authorizers in the country,\" noting it has “some of the best-developed charter oversight architecture.”\nNew York City’s cap on the number of charter schools was reached in 2019.",
    "\"Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nSpotify\nGoogle Podcasts\niHeartRadio\nStitcher\nTuneIn\nRSS\nThe New York State Charter Schools Act of 1998 gave SUNY and the Board of Regents authority to approve charter applications.",
    "A bill from Democratic state Sen. John Liu would give the state Board of Regents veto power over all charter applications—including those approved by the state’s biggest authorizer, the State University of New York.",
    "Consider a recent case: SUNY approved two charters for struggling school districts in Long Island, but the Regents sought to block them under pressure from the Education Department and teachers union.",
    "With trustees appointed by the Governor, SUNY is freer from teachers union influence than the Regents, whose members are appointed by the state Legislature and oversee the state Education Department.",
    "Once authorized, charters are held to strict financial and academic standards by the city and state and must apply to renew their authorization every five years.",
    "The Board of Regents can oppose charter applications approved by SUNY, but Mr. Liu gripes that a “loophole” allows SUNY to let these charters open anyway.",
    "Wonder Land: Joe Biden may have become more progressive, but Joe Manchin and Eric Adams appear to believe the Democratic party’s future lies elsewhere.",
    "Some 60% of 358 charter schools across the state have been authorized by SUNY, including most belonging to high-performing Success Academy and KIPP.",
    "WSJ Opinion: Is Manchin-Adams the Future of The Democratic Party?Play video: WSJ Opinion: Is Manchin-Adams the Future of The Democratic Party?",
    "Open Queue\nThe union war on charter schools never ends, and the latest ruse in New York is to limit who can authorize a charter.",
    "Mayor Eric Adams should call out the Legislature’s ruse to limit the charters that have been so effective in his city.",
    "They have their hands full running their colleges and universities,” Mr. Liu said, according to the New York Post.",
    "SUNY reports that 88% of its charters outperform their district’s schools in reading and writing, and 91% in math.",
    "Images: Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "If the Liu legislation—currently making its way through both the Assembly and Senate—crosses Gov.",
    "The city’s charters have expanded during the pandemic while district schools lose students.",
    "0:00 / 4:28\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Mr. Liu’s bill would give the Regents final say to nix the charters.",
    "WSJ Opinion: Is Manchin-Adams the Future of The Democratic Party?",
    "Skip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "“What does SUNY know about primary and secondary education?",
    "The student waiting list for charters is nearly 50,000.",
    "SUNY says it approves only 38% of new applications.",
    "Kathy Hochul’s desk, it is ripe for a veto.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Last month SUNY authorized them anyway.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "The evidence shows otherwise.",
    "Thank heaven for that."
  ]
}