{
  "id": 690,
  "mediaId": 2618,
  "date": "2022-02-26",
  "headline": "The Ruling Class Is A Far Greater Threat To Americans Than Russia Is",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/26/the_ruling_class_is_a_far_greater_threat_to_americans_than_russia_is_80023.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Redford",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "As Mayer Rothschild said in 1773, \"Let me issue and control a nation's money and I care not who writes the laws.” Everybody today who claims to be part of the ruling class are no more than disciples of the R family.",
    "Since 2007, fifteen years, Putin has been trying to use diplomatic protocols to address the issue of hostile forces along his border harassing ethnic Russians in traditional Russian territory.",
    "They are cynically appealing to our sense of fair play and patriotism, desperately hoping their jingoism will displace the coming wrath as more people wake up to the Covid con.",
    "The same cabal of traitors that have sabotaged our government and our Constitutional rights, are the same people attempting to transfer our hatred of them onto Putin.",
    "Americans would not have been sanguine to the Warsaw Pact expanding to include Mexico and Canada, why should Putin not resist NATO nations ringing his country?",
    "This world war is not about the control of land and resources, it is about controlling the entire world's population through fear, intimidation and force.",
    "It is about the survival of governments recognizing God given rights to every person, or descending into the abyss of psychological and spiritual tyranny.",
    "Remember the same people who vilified President Trump with the \"impeachment\" phone call also smeared Zelensky, but now he is a heroic leader.",
    "There was a 4 year insurrection against the Trump presidency, and a final coup bought with Zuckerbucks money, Republicans willing to sell it.",
    "The Great Reset crowd has been expanding NATO to the point it is becoming the war department for the European Union.",
    "They have been purposely expanding the membership into eastern Europe and Russia's traditional sphere of influence.",
    "If they listen, a few might learn why so many are more interested in our enemies within than their enemies abroad.\"",
    "Putin is the only world leader that is defending the traditional Christian values that built Western Civilization.",
    "And more likely the useful idiots the R family needs in order to be at the top of the world order pyramid.",
    "He has refused the Woke philosophy of our modern Neo-fascists and fights to Make Russia Great Again.",
    "It is a great mistake to look at the Ukraine situation through the lens of the 20th century.",
    "Request to \"pollsters\" - change the word disapprove to hate, or better yet, loathe.",
    "The original act of aggression has been on the part of so-called Western \"leaders\".",
    "I believe that is why President Trump and Putin understand and respect each other.",
    "Trump listened to Dr Fauci, as he stabbed him in the back, as well as the country.",
    "The article correctly identifies the hatred for the left, and their illegitimacy.",
    "They have betrayed this country, and jackbooted every one of our bill of rights.",
    "They and their companies own the world's central banks and sovereign currencies.",
    "Every country's leader should be out to make their country great.",
    "At last this morning an article I can whole heartedly approve.",
    "The article understands by a huge amount my hatred for them.\n\"",
    "If they did, I might answer one of their many phone calls.",
    "No, I am never following Biden or the Democrats anywhere.",
    "why so many patriotic Americans aren’t following them.",
    "The R family knows a sock puppet when they see one.",
    "Christopher, you are giving me a headache.",
    "They could care less about nations' laws.",
    "Too far gone for lame \"disapprove\".",
    "The Rothschilds rule the world.",
    "He's tired of being played.",
    "Let me explain again.",
    ".",
    "."
  ]
}