{
  "id": 6941,
  "mediaId": 2630,
  "date": "2022-04-11",
  "headline": "Biden, Democrats face a growing political headache as immigration clash intensifies",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220315-ukraine-refugee-mexico-jm-1235-0602cf.jpg",
  "link": "https://www.nbcnews.com/politics/white-house/biden-democrats-face-growing-political-headache-immigration-clash-inte-rcna23505",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Asked how immigration affects his plans in the 2022 election, Sen. Rick Scott of Florida, the chair of the Senate GOP campaign arm that seeks to capture control of the chamber, said that “the border is going to be a bigger issue” because “the perception is this administration doesn’t care about having a secure border.”\nThe administration has also faced internal fears that ending certain Trump-era rules could spur a surge of newcomers and asylum-seekers that Congress hasn't provided enough resources to handle.",
    "It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly, and humane process at the border,” Kelly, who represents a border state, said in a statement, warning that the “lack of a plan to deal with this crisis will further strain our border communities.”\nThe issue is complicating Biden’s ability to counter Covid-19 amid fears of a new variant and recent infections among lawmakers, Cabinet officials and White House staff in Washington.",
    "In March, its poll of battleground districts found that 78 percent of voters were more likely to back a Republican candidate who works to “stop dangerous cartels from bringing drugs into America.” And 86 percent back “securing our border to stop drug smuggling and human trafficking,” according to a findings shared with NBC News by a source familiar with the poll.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nThe divisions burst into public view this month after the Biden administration made the decision to end the Title 42 public health rule, which lets officials turn away asylum-seekers at the border due to the pandemic.",
    "“I am concerned that absent a very thoughtful and effective policy to mitigate what could be just a massive rush to the border, we should be cautious.”\nHow new asylum rule could shorten immigration backlog\nMarch 28, 202203:15\nThe root of the challenge is the mismatch between law and resources.",
    "They argue Biden’s woes are a result of the White House and many Democrats being too cautious on the issue, which they say has disappointed supporters and left the field open for conservatives to weaponize the issue with misleading claims and anti-immigrant sentiments.",
    "The president faces a two-track challenge: The Democratic base is unhappy with the lack of progress on pro-immigration goals, and the Republican electorate is fired up over the issue as the party’s lawmakers and media figures stoke fears of migration.",
    "“One of the challenges for Democrats is that immigration has been a larger base-motivating issue for Republicans than for Democrats,” said Democratic consultant Tyler Law, who was the spokesman for the party’s House campaign arm in 2018.",
    "\"And we will continue to take additional steps to implement and make clear that this is not the time to come, that there will still be significant measures put in place for anyone who tries to irregularly migrate to the United States.\"",
    "Law said Democrats should stay true to their immigration values but focus on more salient economic issues, like inflation and rising costs, with a message that can energize progressives and attract independents.",
    "Meanwhile, progressives are disenchanted with the lack of progress on an issue with a large Democratic constituency, which was once thought to be a political boon for the party in a diversifying electorate.",
    "“We should have learned by now that working-class voters — white, Black or brown — have a ton in common: a deep interest in lowering their costs and making their economic circumstances better.",
    "It was always at the margins around enforcement and the border that you saw the splits even within the Democratic Party.”\nGet the Morning Rundown\nGet a head start on the morning's top stories.",
    "A Pew Research Center poll last month found that 68 percent of Republicans rated immigration as “very important” to their vote in the 2022 elections, compared to just 34 percent of Democrats.",
    "Surveys indicate most Americans disapprove of Biden’s handling of immigration, including one conducted by a firm affiliated with the president, commissioned by an immigrant rights group.",
    "Covid relief bill stalls amid dispute over immigration policy\nApril 6, 202202:57\nThe National Republican Campaign Committee has tested attacks and “contrast” messages about the border.",
    "But now the issue of immigration has devolved into a political headache for him that is undercutting a centerpiece of his agenda and causing vulnerable Democrats to split from him.",
    "It's a public health measure and one that Congress has given the CDC authority to make a decision about,\" White House press secretary Jen Psaki told reporters on Wednesday.",
    "Even the popular American Dream and Promise Act of 2021 to legalize young people who have lived in the U.S. for years faces no chance of breaking a GOP Senate filibuster.",
    "Even though the vetting process for asylum applicants is extensive, immigration opponents have advanced a narrative of a border overrun by criminals and drug smugglers.",
    "And the courts have blocked Biden from ending former President Donald Trump’s policy requiring asylum-seekers to “remain in Mexico” while awaiting their day in court.",
    "And we have had, honestly, over the years too few, even Democrats, who really understand the issue and are willing to lean into it — instead of running away from it.",
    "Biden’s comprehensive immigration bill, which includes provisions to overhaul asylum, is dead on arrival in Congress due to the wafer-thin Democratic majorities.",
    "WASHINGTON — President Joe Biden won the White House while chastising his predecessor’s border policies as inhumane and out of step with American values.",
    "And I think we really need to lean into it,” said Rep. Pramila Jayapal, D-Wash., the chair of the Congressional Progressive Caucus, in an interview.",
    "I think Democrats have done a disservice by treating some voters of color as if all they want to hear about is immigration,” he said.",
    "The four aren’t known for clashing with Biden but have one thing in common: All face re-election this fall in competitive states.",
    "And we should all be ashamed, frankly,” Rep. Dean Phillips, D-Minn., who represents a competitive district, said in an interview.",
    "Maggie Hassan of New Hampshire; Raphael Warnock of Georgia; Mark Kelly of Arizona; and Catherine Cortez Masto of Nevada.",
    "Democrats said they worry the government lacks the resources to humanely process a potential influx of asylum-seekers.",
    "He cited the Democrats’ bill to cap insulin prices at $35 per month, which all but 12 House Republicans voted against.",
    "Republicans demanded an amendment to a bipartisan $10 billion Covid relief deal that would reinstate Title 42.",
    "But are people familiar with underlying policies or are people familiar with asylum and refugee policy?",
    "A group of Democrats joined Republicans in demanding he reinstate it, including centrists like Sens.",
    "Psaki said the White House has \"surged resources\" for enforcement as it implements the policy.",
    "When Democratic leaders rejected that, calling the issues unrelated, they voted it down.",
    "“I’ve been to the southern border twice, so I’ve witnessed first-hand what’s occurring.",
    "Joe Manchin of West Virginia; Kyrsten Sinema of Arizona; and Jon Tester of Montana.",
    "\"That's why the president proposed an immigration bill in his first day in office.",
    "Federal law grants people the right to apply for asylum and make their case.",
    "And we would certainly welcome efforts of anybody to work with us on that.\"",
    "“We hear often what Fox News broadcasts relative to the border crisis.",
    "Congress left town last week for a two-week recess without passing it.",
    "Democrats know the issue doesn't tilt in their favor politically.",
    "But when applications rise, the system gets strained.",
    "Keeping track of the migrants becomes a challenge.",
    "Immigration advocates take a different view.",
    "\"Title 42 is not an immigration measure.",
    "“Immigration is a complicated issue.",
    "“So it doesn’t surprise me, really.",
    "“This is the wrong decision.",
    "Holding facilities fill up.",
    "And it’s heartbreaking.",
    "It also includes Sens.",
    "Courts are backlogged.",
    "No,” Phillips said.",
    "Wait times grow."
  ]
}