{
  "id": 7038,
  "mediaId": 2688,
  "date": "2022-04-12",
  "headline": "Where Things Stand: McConnell Warns ‘Unacceptable’ GOP Candidates Could Spoil The Fun For Everyone",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/04/GettyImages-1389745631-scaled.jpg",
  "link": "https://talkingpointsmemo.com/edblog/mcconnell-unacceptable-gop-candidates-spoil-midterms?utm_source=rss&utm_medium=rss&utm_campaign=mcconnell-unacceptable-gop-candidates-spoil-midterms",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Judis",
  "authorUrl": "https://talkingpointsmemo.com/profile/johnjudis",
  "termIds": [
    5418,
    5399,
    5592,
    4267,
    4026,
    1489,
    1126,
    392
  ],
  "sentences": [
    "During an event in Kentucky today, Senate Minority Leader Mitch McConnell (R-KY) voiced plenty of muted optimism about his party’s chances of taking back the Senate in the fall, nodding at an oft-cited, ironclad rule of American politics — the party in the White House will almost certainly lose ground in the Midterms.",
    "The Best Of TPM Today\nHere’s what you should read this evening:\nThe latest from Josh Kovensky: A Tipoff By The Secret Service Blew Up The Federal Probe Of Alleged Imposter Duo\nBreaking this morning: Oklahoma Governor Signs Near-Total Abortion Ban Into Law\nYesterday’s Most Read Story\nWhat We Are Reading\nNY Lt. Gov.",
    "While history is securely on his side, McConnell’s remarks Tuesday might illustrate a form of preemptive “I told you so.” McConnell has faced one disappointment after another in his attempts to recruit solid, traditional and popular candidates to run in a few key Senate races against Democrats.",
    "“From an atmospheric point of view, it’s a perfect storm of problems for the Democrats,” McConnell mused on Tuesday, according to The Hill, before acknowledging that Republicans haven’t always done as well as they could have, especially when a few “unacceptable” folks get in the way.",
    "There’s still plenty of room for error, especially when your hopes might have to hinge on someone who insists you call him by his TV character name (Dr. Oz) or someone who may not know what cocaine is (Rep. Madison Cawthorn (R-NC)).",
    "Chris Sununu of New Hampshire announced he wouldn’t be challenging Sen. Maggie Hassan (D-NH) in the Midterms, gifting Democrats some room to breathe after fears of Sununu’s possible candidacy forecasted a potential Republican flip.",
    "Trump, for his part, seems bent on making McConnell’s job harder — pissing off Trumpworld by endorsing folks like Dr. Oz in Pennsylvania and playing takesies-backsies with Rep. Mo Brooks (R-SC).",
    "A chorus of GOPers called on Missouri Senate GOP candidate Eric Greitens to end his campaign after domestic abuse allegations surfaced against the already problematic candidate last month.",
    "Ever since Cawthorn referred to Ukraine’s president as a “thug” and started all the cocaine and orgy drama in Congress, Republicans have raced to endorse his primary challengers.",
    "We had that experience in 2010 and 2012.”\nSenate Republicans would need to net just one extra seat in order to tip the Senate’s balance and take back the majority.",
    "“In the Senate, if you look at where we have to compete in order to get into a majority, there are places that are competitive in the general election.",
    "Brian Benjamin Resigns Following Arrest in Campaign Finance Fraud Case: Hochul — Jonathan Dienst, Melissa Russo and Jennifer Vazquez",
    "Doug Ducey (R) announced in a letter to donors that he wouldn’t launch a bid against incumbent Sen. Mark Kelly (D-AZ).",
    "Larry Hogan (R) put an end to speculation that he’d cave to McConnell’s pleas to vie for a spot in the upper chamber.",
    "This also comes as the party attempts to pressure certain, say, “unacceptable” candidates to drop out of the race.",
    "So you can’t nominate somebody who’s just sort of unacceptable to a broader group of people and win.",
    "That blow was personal for McConnell, who personally petitioned Sununu to run.",
    "McConnell was dealt his first big blow back in November when Republican Gov.",
    "Republicans are defending 21 seats, while Democrats are defending just 14.",
    "The same thing happened in Maryland in February — Maryland Gov.",
    "And we’ve had some experience with that in the past,” he said.",
    "And the pattern doesn’t end in the Senate.",
    "Then last month, Arizona Gov.",
    "“How could you screw this up?",
    "It’s actually possible.",
    "Three strikes."
  ]
}