{
  "id": 706,
  "mediaId": 2830,
  "date": "2022-02-22",
  "headline": "Lifting Mask Mandates: Yes or No?",
  "image": "",
  "link": "https://www.wsj.com/articles/lifting-mask-mandates-yes-or-no-campus-students-college-wear-restrictions-11645565838",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "WSJ Opinion: The Decline of 'Science'—From Climate to OmicronPlay video: WSJ Opinion: The Decline of 'Science'—From Climate to Omicron\n Wonder Land: The weaponization of 'science' began with climate policy and accelerated with Covid-19.",
    "Regardless what you think of masking early in the pandemic, with the advent of universally available and widely adopted vaccination, masks have become tokens of political identity rather than necessary protective devices.",
    "—Joon Lee, Georgetown, security studies\nHelp Children by Easing Mandates\nAt the beginning of the pandemic, as the coronavirus spread through the U.S., requiring masks was a reasonable public-health measure.",
    "More than 90 million Americans are considered at high risk for serious Covid infection because of their age and face an impossible choice: Be a part of society and risk their life, or wither away at home.",
    "Photo: Gina M Randazzo/Zuma Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (8 minutes)\nAD\nLoading advertisement...\n00:00 / 07:41\n1x\nThis article is in your queue.",
    "Surgeon General Jerome Adams and Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, insisted at various times both that masks should and should not be widely worn.",
    "Although politicians would certainly like the opportunity to reimpose restrictions in the future, it is not in any politician’s best interest to increase mandates before the 2022 midterms.",
    "As the U.S. approaches the second anniversary of the pandemic, the demand for Covid restrictions has fallen precipitously, while our understanding of the Omicron variant has improved.",
    "Putting young students in masks has been touted as a necessary step for protecting children, their families and teachers from the virus, but the negative effects exceed the positive.",
    "Children under 5, who are not yet eligible for the vaccine, lack protection against the virus, and their alternatives of virtual schooling and isolation are equally disturbing.",
    "If we can cease treating our fellow citizens first and foremost as unclean vectors of disease, we can revert to simple pleasures like seeing a stranger smile.",
    "—Adam Barsouk, Jefferson University, medicine\nUnmuzzle Us\nThe risks of Covid have fallen, while the negative effects of mask mandates are becoming clearer.",
    "By September 2020, a study from Duke University concluded that surgical masks and KN95 masks can effectively reduce transmission when used correctly.",
    "Those who wish to live in a jurisdiction with tougher restrictions have that option, but few are moving from lax Florida to strict New York.",
    "Until we get to a point where we have technology and medicines to handle new mutations, we should still take precautions and keep masking.",
    "Did the government not examine the science behind the rate at which droplets of virus penetrate cloth material before recommending masks?",
    "—Chris Coffey, University of Michigan, history and philosophy\nMasks Help\nWhile Covid cases are decreasing, the pandemic is far from over.",
    "How is restricting where people can smoke, for the health of those around them, any different from limiting where people can go maskless?",
    "Having lived with this reality for two years, we have enough data and personal experience for individuals to make their own decisions.",
    "Two years later, vaccination levels are continuing to rise, with around 76% of the population having received at least one dose.",
    "Such public figures as our politicians and athletes have clearly demonstrated that mask mandates are for thee, but not for me.",
    "Even in areas that have managed to bring the numbers down, complete abandonment of masks may cause the numbers to go up again.",
    "Inflation and supply-chain issues take precedence for most Americans, and the virus is akin in severity to the seasonal flu.",
    "WSJ Opinion: The Decline of 'Science'—From Climate to Omicron\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "In the interest of minimizing death, the government is forced to impose restrictions on businesses and shutter the economy.",
    "Next week we’ll ask, “College tuition has risen in the past few years, and inflation has made these changes more notable.",
    "—Sarah Montalbano, Montana State University, computer science\nClick here to submit a response to next week’s Future View.",
    "Recently, the effect of masking on elementary-school children has been at the center of debate about mask requirements.",
    "They are talismans of a new state religion of secular progressivism, intended to allow believers to identify heretics.",
    "We need to continue protecting the vulnerable populations of the elderly and those with compromised immune systems.",
    "Abiding by harsh restrictions was a response of a terrified people temporarily unable to weigh costs and benefits.",
    "It is far more difficult to demand masking now, when the costs of restrictions are clearly visible in daily life.",
    "They have disrupted children’s development and education while affecting social communication and mental health.",
    "Images: AFP/Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "—Hannah Larson, Biola University, journalism\nMask Up\nMasks are still necessary, and the need has not abated.",
    "The nation is slowly accepting that the coronavirus will continue to be part of the reality of daily life.",
    "—Judith Mwobobia, Duke University, global health\nPeople Are Tired\nAnniversaries are poignant for a reason.",
    "What led us here?” Students should click here to submit opinions of fewer than 250 words before March 1.",
    "As much as we may cherish our individualism, our actions sometimes have direct consequences on others.",
    "From England to Australia, countries that had enforced strong Covid policies are ending many of them.",
    "Masks, especially cloth masks, carry far more social weight than they do medical effectiveness.",
    "Children struggle with language acquisition and retention when they can’t see speakers’ faces.",
    "People have and are ready to move on with their lives, unmuzzled by the mandates of the past.",
    "The beauty of a federalist system is that localities may set their own laws regarding Covid.",
    "We are fortunate to have a vaccine widely available to go up against a less-deadly variant.",
    "We Never Needed to Mask\nFrom the beginning, the demand for masking has exceeded the need.",
    "0:00 / 4:52\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "What about a few weeks before, when they explicitly recommended against wearing masks?",
    "The constant mixed messaging from the medical establishment has only muddled matters.",
    "Every American state, county, city, township and school district should follow suit.",
    "If domestic migration is any indication, people are tired of punishing restrictions.",
    "Such hypocrisy will only cause greater resentment and strain our fragile democracy.",
    "The study demonstrated that cloth masks and other alternatives have little utility.",
    "A ‘face coverings required’ sign hangs in a Duane Reade store in New York, Feb. 10.",
    "Masks aren’t perfect, but they are proven to decrease the risk of transmission.",
    "Similarly, given the risks, we’ve all accepted widespread indoor smoking bans.",
    "Open Queue\nEditor’s note: In this Future View, students discuss mask mandates.",
    "The science has changed, they slyly declare as if with papal infallibility.",
    "Isn’t wearing a mask a much smaller sacrifice than closing down businesses?",
    "Easing mask restrictions is the proper step at this point in the pandemic.",
    "Masking indoors, especially in public gatherings, should not be abandoned.",
    "The transition to personal responsibility in Covid policy is long overdue.",
    "The spread of the virus inevitably puts the lives of millions at risk.",
    "This is especially true for states where the incidence is still high.",
    "Many have taken the opposite path, fleeing from New York to Florida.",
    "We can tolerate the blatant hypocrisy and vanity only for so long.",
    "The Omicron surge has largely abated after peaking in mid-January.",
    "Meanwhile, the problems of the mask mandates are substantial.",
    "The demand for masking is low, and it will remain low.",
    "The best responses will be published that night.",
    "How is inflation affecting college students?",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Now many think it's all misinformation.",
    "The need for masks has faded as well.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "The pandemic is still rife.",
    "Former U.S."
  ]
}