{
  "id": 7092,
  "mediaId": 2520,
  "date": "2022-04-05",
  "headline": "Gov. Doug Ducey and Sens. Kyrsten Sinema and Mark Kelly bolster a border security lie",
  "image": "https://www.gannett-cdn.com/presto/2021/09/22/USAT/115e55b0-9d54-49d8-8d8e-af24c0813832-XXX_US_Mexico_Border_Sept2021_024.JPG?crop=4890,2751,x9,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/ej-montini/2022/04/05/ducey-sinema-kelly-bolster-title-42-border-security-lie/9466623002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "EJ Montini",
  "authorUrl": "https://www.azcentral.com/staff/2646830001/ej-montini/",
  "termIds": [
    5879,
    3401,
    2765,
    2915,
    4905,
    2459,
    5949,
    6678
  ],
  "sentences": [
    "Doug Ducey, however, has clamored about the need to maintain the rule, saying in a statement, “Even as we emerge out of the pandemic, this is a no-brainer policy that protects the health and well-being of American citizens.”\nInteresting, since not to many days ago the governor killed his own emergency declaration concerning the pandemic, saying in part, “COVID-19 is no longer an emergency in Arizona,” and “the time is right to move forward.”\nLikewise, Arizona’s two Democratic senators are squawking about an end to Title 42, with Kelly (who has legitimate concerns about the November election) saying, “This is the wrong decision.” And Sinema chiming in about how the decision to rescind Title 42 \"shows a lack of understanding about the crisis at our border.”\nI have lived in Arizona since 1980.",
    "But rescinding Title 42 is not a comprehensive solution, and real progress means reforming our immigration system with one that treats immigrants and asylum seekers humanely, keeps families together, secures our border, and grows our economy.”\nArizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Arizona Attorney General Mark Brnovich, one of three Republican attorneys general suing the federal government to keep the rule in place, issued a statement saying in part, “While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there.”\nActually, the administration is trusting the science, honoring the truth and following the law.",
    "The CDC has determined that, owing to current public health conditions, along with the available treatment and prevention options concerning COVID-19, “an order suspending the right to introduce migrants into the United States is no longer necessary.”\nNow, in a strange twist, politicians who never took the pandemic seriously enough are howling about the disaster that would occur if Title 42 is rescinded.",
    "But the clock is ticking\nIn the meantime, the federal government is working to bolster the needs they see at the border when those who previously have been denied the opportunity to apply for entry to the United States return to our border.",
    "Retaining Title 42 is 'no longer necessary'\nIt has continued under President Joe Biden, with the need for continuing such a policy, or rescinding it, left to the Centers for Disease Control and Prevention.",
    "It was instituted by the Trump administration to prohibit asylum seekers from going through the legal process of entering the United States because, we reasoned, they might pose a public health risk.",
    "Arizona Democratic Rep. Ruben Gallego put it this way, “Asylum seekers deserve to have their cases heard in a way that protects the health and safety of those in the U.S. and those seeking asylum.",
    "It is a federal law that grants the government the ability to take emergency action to stop the “introduction of communicable diseases.”\nLike, for example, COVID-19.",
    "In case you didn’t know – because the politicians don’t talk about it this way – Title 42 is NOT – I repeat, NOT – an immigration or border security policy.",
    "The Republican governor and the two Democrats all lashed out at the Biden administration’s decision to end what is called Title 42.",
    "In all of that time there has never not been a crisis at our border, at least according to every politician trying to get elected.",
    "But we cannot solve the problems of our fractured border security and immigration policy with a fabricated health care policy.",
    "Kyrsten Sinema and Mark Kelly, would rather perpetuate a lie than structure an actual immigration and border security policy.",
    "And using a trumped-up scheme about public health concerns as the official United States of America border security policy.",
    "The Congress to which Sinema and Kelly belong have had years, decades, to come together and create a workable solution.",
    "To get together and actually do something, instead of whining about the end of Title 42.",
    "We need a real, workable immigration policy\nAnd to some degree they were all correct.",
    "Title 42 is not scheduled to be officially rescinded until late May.",
    "During the next two months Congress also has an opportunity to act.",
    "Not a solution to our border security or immigration problems.",
    "Title 42 was meant to be a temporary response to the pandemic.",
    "But Title 42 is not an immigration and border security policy.",
    "Reach Montini at ed.montini@arizonarepublic.com.",
    "Opinion: Yes, there is a crisis at the border.",
    "Pretending there is still a need for Title 42.",
    "For more opinions content, please subscribe.",
    "Based on the public health situation.",
    "Was there ever NOT a border crisis?",
    "Doug Ducey, along with U.S. Sens.",
    "Or, we could go on living a lie.",
    "It is a public health policy.",
    "A public health policy.",
    "There is a crisis.",
    "Well, guess what?",
    "They have failed.",
    "There is time.",
    "Arizona Gov.",
    "Gov."
  ]
}