{
  "id": 7126,
  "mediaId": 2520,
  "date": "2022-04-07",
  "headline": "Arizona congressional races slightly clearer after primary qualification deadline passes",
  "image": "https://www.gannett-cdn.com/presto/2022/02/23/PPHX/397727d7-09be-409b-bdce-8a8459a222e9-_JAJ5947.jpg?crop=3599,2025,x0,y360&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/04/05/congressional-candidate-field-narrows-signature-deadline-passes/9477024002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald J. Hansen",
  "authorUrl": "https://www.azcentral.com/staff/2647673001/ronald-j-hansen/",
  "termIds": [
    2459,
    2426,
    5376,
    5651,
    2833,
    3401,
    1489,
    1477,
    6667,
    5949
  ],
  "sentences": [
    "Supreme Court won't let Arizona voters weigh in on tax cut Brnovich takes election manual fight with Hobbs to court Karrin Taylor Robson drops fundraising tactic after questions AZ House Speaker Rusty Bowers wins award for courage\nRep. Raúl Grijalva, D-Ariz., the dean of the state's congressional delegation, has two Republican challengers in his bid for an 11th term representing southwestern Arizona.",
    "Rep. Tom O'Halleran, D-Ariz., is considered as the state's most endangered incumbent after the new congressional map put him in a district that still includes northeastern Arizona, but now includes the Prescott area, and voted for former President Donald Trump by about 7 percentage points in 2020.",
    "A Tucson-based district that has no incumbent running has eight contenders trying to replace the retiring Rep. Ann Kirkpatrick, D-Ariz.\nFor the Democrats, Avery Anderson, Kirsten Engel and Daniel Hernandez made the primary ballot.",
    "The anticlimactic showing stands in contrast to 2020, when Shay Stautz, a Tucson Republican expected to contend for the GOP nomination, dropped out of the race ahead of challenges to the signatures his campaign gathered.",
    "For now at least, there was no big surprise: The expected field of challengers produced enough signatures to potentially make the ballot, and most incumbents will face no challengers from their own party.",
    "Rep. Debbie Lesko, R-Ariz., was perhaps the biggest winner with no Democrats or Republicans qualifying to challenge her for another two years in Washington representing the northwest Valley.",
    "Reps. Andy Biggs, R-Ariz., and Ruben Gallego, D-Ariz., each have one challenger from the opposite party in their districts, neither of which are likely to produce electoral upsets.",
    "Rep. Greg Stanton, D-Ariz., has no Democratic challengers in his new, Tempe-based district, but there are plenty of Republicans hoping to block his path to a third term.",
    "In the House races, Rep. David Schweikert, R-Ariz., occupies what could be Arizona's most competitive district, which includes much of the northeast Valley.",
    "This time most of Arizona's incumbents, who are running new congressional districts across the state, have a path to at least their party's nomination.",
    "Arizona's field of congressional candidates became slightly clearer after Monday's deadline to submit signatures to qualify for the Aug. 2 primary.",
    "Arizona voters have until April 18 to formally challenge the signatures the campaigns gathered, which could erase at least some of their totals.",
    "Three Democrats — Jevin Hodge, Adam Metzendorf and Ginger Torres — will compete for the right to challenge whoever emerges from that primary.",
    "The winner is likely headed to Washington, with no Democrats qualifying in what is likely the state's most Republican-leaning district.",
    "The three-term Democrat is unopposed in the primary, but has seven GOP challengers contending for the chance to knock him off.",
    "They include: Walt Blackman; Eli Crane; Mark DeLuzio; Steven Krystofiak; John Moore; Ron Watkins; and Andy Yates.",
    "In 2018, Republican Seth Leibsohn failed to qualify for the ballot because of a surprise signature shortage.",
    "They include: Kelly Cooper, Jerone Davison, Dave Giles, Rene Lopez, Alex Stovall and Tanya Wheeless.",
    "The Republicans are Juan Ciscomani, Lucretia Free, Brandon Martin, Young Mayberry and Kathleen Winn.",
    "Norton pulled in more signatures than Schweikert, who is seeking a seventh term in Washington.",
    "Sen. Mark Kelly, D-Ariz., easily collected the most signatures in his bid for re-election.",
    "Likewise, Republican Jeff Zink has no challengers for the GOP nomination against Gallego.",
    "Reach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493.",
    "Rep. Paul Gosar, R-Ariz., has three GOP challengers in his new western Arizona district.",
    "Zink's status is more tenuous: He qualified with the exact number of signatures needed.",
    "He is slated to face two Republican challengers: Josh Barnett and Elijah Norton.",
    "They are Mark Brnovich, Jim Lamon, Blake Masters, Mick McGuire and Justin Olson.",
    "Democrat Javier Ramos has no competition for the right to face Biggs.",
    "Five Republican challengers also made the ballot with room to spare.",
    "Libertarian Marc Victor also qualified for his party's primary.",
    "They are Sandra Dowling, Randy Kutz and Adam Morgan.",
    "Subscribe to our free political podcast, The Gaggle.",
    "They are Nina Becker and Luis Pozzolo.",
    "Follow him on Twitter @ronaldjhansen.",
    "Subscribe to azcentral.com today.",
    "Support local journalism."
  ]
}