{
  "id": 7246,
  "mediaId": 2630,
  "date": "2022-04-06",
  "headline": "Arizona AG report finds no evidence of mass fraud in Maricopa County 2020 election results",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220406-ONE-TIME-USE-Mark-Brnovich-ac-743p-e25cbc.jpg",
  "link": "https://www.nbcnews.com/politics/elections/arizona-ag-report-finds-no-evidence-mass-fraud-maricopas-2020-election-rcna23336",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Arizona governor signs legislation requiring proof of citizenship to vote\nMarch 31, 202202:18\nTrump repeated his Arizona claims as recently as January, when he alleged mass fraud at a rally where he was joined by three of the state's House Republicans — Paul Gosar, Andy Biggs and Debbie Lesko — who voted against certifying Biden’s victory.",
    "Brnovich, a Republican, said his office “has left no stone unturned in the aftermath of the 2020 election.”\nFormer President Donald Trump is pursuing a persistent pressure campaign to uncover any illegal activity that would support his false claims that he defeated President Joe Biden in Arizona 17 months ago.",
    "Although Wednesday's report did not find mass fraud or conspiracy in the 2020 election, it outlined his office’s concerns with \"serious vulnerabilities\" involving certain procedures during the campaign, including the signature verification process and the transportation of ballots from drop box locations.",
    "A report issued Wednesday by Arizona Attorney General Mark Brnovich found no evidence of widespread voter fraud or irregularities associated with the 2020 presidential election in Maricopa County while raising concerns about some voting procedures.",
    "Stephen Richer, who was elected Maricopa County recorder in 2020, also rebuked the report on Twitter, accusing Brnovich of \"working overtime\" to undermine confidence in elections by ignoring many findings that could instill confidence.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nBrnovich initially defended the integrity of election results — much to the disappointment of GOP gubernatorial front-runner Kari Lake.",
    "Criminals don’t respect legal gobbly-gook that just fills pages when really we can use handcuffs, jail cells and jump suits.”\nFann did not immediately respond to a request for comment about Brnovich's letter.",
    "“There is no evidence, there are no facts that would lead anyone to believe that the election results will change,” Brnovich said days after the 2020 election was called for Biden.",
    "Trump lost Arizona by less than 10,500 votes, and a GOP-commissioned review in Maricopa County confirmed Biden’s victory.",
    "The interim report, six months into an investigation, was detailed in a 12-page letter to Senate President Karen Fann.",
    "Brnovich’s tenor toward the 2020 election began to shift under pressure from Trump and a host of Arizona Republicans.",
    "“It’s far more than necessary to win the state of Arizona,” Trump said at the rally, where he referred to Brnovich.",
    "Lake called this week for the decertification of Biden’s victories in Arizona and Wisconsin.",
    "He is running for the GOP nomination for the U.S. Senate seat held by Democrat Mark Kelly.",
    "\"I remember spending many, many hours working with investigators on our entire tech stack.",
    "GOP state Sen. Wendy Rogers blasted Brnovich minutes after the release of his letter.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "I guess the answers to those don’t fit the narrative,\" Richer wrote.",
    "Looking at questions like internet connectivity and data deletion.",
    "I think he’s going to do his job,” Trump said.",
    "In a tweet, she said: “I don’t like letters.",
    "I like arrests and prosecutions.",
    "“I think he’s a good man."
  ]
}