{
  "id": 734,
  "mediaId": 2509,
  "date": "2022-02-21",
  "headline": "Today in History",
  "image": "https://abcnews.go.com/US/wireStory/null",
  "link": "https://abcnews.go.com/US/wireStory/today-history-83021725",
  "mediaOutlet": "ABC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Five years ago: President Donald Trump condemned recent threats against Jewish community centers in the U.S. as “painful reminders” of lingering prejudice and evil; the president also denounced “bigotry, intolerance and hatred in all of its very ugly forms” during his first visit to the new Smithsonian Black history museum.",
    "Conservative writer Milo Yiannopoulos (MY’-loh yuh-NAH’-poh-lihs) resigned as an editor for Breitbart News, apologizing for comments he’d made in video clips in which he appeared to defend sexual relationships between men and boys as young as 13.",
    "In 1992, Kristi Yamaguchi (yah-mah-GOO’-chee) of the United States won the gold medal in ladies’ figure skating at the Albertville Olympics; Midori Ito (mee-doh-ree ee-toh) of Japan won the silver, Nancy Kerrigan of the U.S. the bronze.",
    "One year ago: Hospitals across the southern United States grappled with ruptured water pipes and patient transfers as the region carried on with efforts to recover from the winter weather that paralyzed parts of the nation.",
    "In 1911, composer Gustav Mahler, despite a fever, conducted the New York Philharmonic at Carnegie Hall in what turned out to be his final concert (he died the following May).",
    "In 2020, a temporary truce between the United States and the Taliban in Afghanistan took effect, setting the stage for the two sides to sign a peace deal the following week.",
    "In 2019, teachers in Oakland, California, went on strike in the latest in a wave of teacher activism that had included walkouts in Denver, Los Angeles and West Virginia.",
    "In 1995, Chicago adventurer Steve Fossett became the first person to fly solo across the Pacific Ocean by balloon, landing in Leader, Saskatchewan, Canada.",
    "Haldeman and John D. Ehrlichman were sentenced to 2 1/2 to 8 years in prison for their roles in the Watergate cover-up (each ended up serving 1 1/2 years).",
    "Ten years ago: The 17-nation eurozone approved a $170 billion bailout for Greece, which received the news with a mixture of relief and foreboding.",
    "In 1973, Israeli fighter planes shot down Libyan Arab Airlines Flight 114 over the Sinai Desert, killing all but five of the 113 people on board.",
    "Billy Graham, a confidant of presidents and the most widely heard Christian evangelist in history, died at his North Carolina home; he was 99.",
    "The convictions of two of the men were dismissed in November 2021; prosecutors said new evidence had undermined the case against them.)",
    "Police in Liberty, New York, said an expectant father was killed when a device he was building for a gender reveal party exploded.",
    "(Three men identified as members of the Nation of Islam were convicted of murder and imprisoned; all were eventually paroled.",
    "Today’s Highlight in History:\nOn Feb. 21, 1975, former Attorney General John N. Mitchell and former White House aides H.R.",
    "In 1965, minister and civil rights activist Malcolm X, 39, was shot to death inside Harlem’s Audubon Ballroom in New York.",
    "Novak Djokovic beat Daniil Medvedev in three sets to win his ninth Australian Open championship and 18th Grand Slam title.",
    "In 1972, President Richard M. Nixon began his historic visit to China as he and his wife, Pat, arrived in Beijing.",
    "On this date:\nIn 1437, James I, King of Scots, was assassinated; his 6-year-old son succeeded him as James II.",
    "In 1964, the first shipment of U.S. wheat purchased by the Soviet Union arrived in the port of Odessa.",
    "Today in History\nToday is Monday, Feb. 21, the 52nd day of 2022.",
    "Singer Rhiannon Giddens (Carolina Chocolate Drops) is 45.",
    "Today’s Birthdays: Movie director Bob Rafelson is 89.",
    "Rock musician Tad Kinchla (Blues Traveler) is 49.",
    "Film/music company executive David Geffen is 79.",
    "Rock musician Jerry Harrison (The Heads) is 73.",
    "In 1885, the Washington Monument was dedicated.",
    "Former Sen. Olympia J. Snowe, R-Maine, is 75.",
    "Country singer Mary Chapin Carpenter is 64.",
    "Singer/guitarist Larry Campbell is 67.",
    "Actor-director Richard Beymer is 83.",
    "Country singer Eric Heatherly is 52.",
    "There are 313 days left in the year.",
    "Blues musician Corey Harris is 53.",
    "Comedian-actor Jordan Peele is 43.",
    "Rock musician Michael Ward is 55.",
    "Actor Jennifer Love Hewitt is 43.",
    "Sen. Mark Kelly, D-Ariz., is 58.",
    "Rock musician Eric Wilson is 52.",
    "Actor Brendan Sexton III is 42.",
    "Actor Christine Ebersole is 69.",
    "Actor Christopher Atkins is 61.",
    "Singer Charlotte Church is 36.",
    "Actor William Petersen is 69.",
    "Actor William Baldwin is 59.",
    "Actor Anthony Daniels is 76.",
    "Actor Hayley Orrantia is 28.",
    "Actor Aunjanue Ellis is 53.",
    "Actor Tituss Burgess is 43.",
    "Actor Kelsey Grammer is 67.",
    "Actor Peter McEnery is 82.",
    "Actor Gary Lockwood is 85.",
    "Actor Sophie Turner is 26.",
    "Actor Ashley Greene is 35.",
    "Actor Jack Coleman is 64.",
    "Actor Elliot Page is 35.",
    "Actor Corbin Bleu is 33.",
    "Tricia Nixon Cox is 76.",
    "Actor Kim Coates is 64.",
    "This is Presidents Day.",
    "Actor Tyne Daly is 76.",
    "In 2018, the Rev."
  ]
}