{
  "id": 772,
  "mediaId": 2548,
  "date": "2022-02-22",
  "headline": "Sen. Rick Scott Lays Out 11-Point Plan To ‘Rescue America’",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/02/Photo-by-Drew-AngererGetty-Images-123213-e1645506442966.jpg",
  "link": "https://dailycaller.com/2022/02/22/rick-scott-11-point-plan-rescue-america/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here Are The 11-Points In The Plan:\nEducation\nColor Blind Equality\nSafety and Crime\nImmigration\nGrowth / Economy\nGovernment Reform and Debt\nFair Fraud-Free Elections\nFamily\nGender, Life, Science\nReligious Liberty and Big Tech\nAmerica First\nHere Are Scott’s Points Of Focus:\nEvery child in every school to say the pledge of allegiance, stand for the national anthem, and learn that America is the greatest country in this world.",
    "Like the Contract with America, it will help win the election and also, even more importantly, serve as a blue print for the new Republican majority to focus on solving problems and creating a dramatically better American future.”\n“It is a very important step toward getting America back on track toward a more prosperous, freer and safer future,” Gingrich added.",
    "Republican National Committee (RNC) Chairwoman Ronna McDaniel also endorsed Scott’s 11-point plan, telling the Daily Caller it is full of actual solutions to help the U.S.\n“Joe Biden and Democrats have made life more expensive and less safe for families across America.",
    "Scott said he believes the elections will mostly be focused on how bad President Joe Biden’s first term in office has been but added that, since he is running for Senate reelection in 2024, Scott wants people to know what he will be focusing on.",
    "(RELATED: ‘Republican Civil War Is Now Cancelled’ — Sen. Rick Scott Sends Out Memo On Unity Before 2022 Elections)\n“So, everybody that’s in office, use whatever authority you have to make sure these people are complying with the law.",
    "If I expect you to vote for me, then I’m going to have to give you a reason to vote for me.”\nIn November, Scott laid out key Senate races to watch for the 2022 midterms as the GOP tries to regain a majority in the upper chamber.",
    "As a businessman, Scott said he would need to explain his goals in order to receive funding or support and compared it to his job as a Senator, saying he could not raise money without a specific plan.",
    "READ THE FULL PlAN HERE:\nOn the point of ending “foolish soft-on-crime policies,” Scott explained the only way to get rid of liberal state and district attorneys is by getting involved in elections.",
    "From lowering costs and creating jobs, to supporting police and securing the border, Republicans are offering a clear plan to protect and reinvigorate the America we know and love,” McDaniel said.",
    "I think they’re part of killing 100,000 Americans last year with fentanyl, and I think it’s past time for us to say this idea that they were going to change and get better is just not realistic.",
    "Republican Florida Sen. Rick Scott has created an 11-point plan with 128 specific ideas to “rescue America,” which he believes should be the focus of the GOP’s agenda moving into the midterms.",
    "Gingrich endorsed his 11-point plan, telling the Daily Caller: “Rick Scott’s Rescue America Plan is a very important contribution toward a positive, problem solving Republican Party.",
    "According to Scott, House Minority Leader Kevin McCarthy has a similar plan and said he imagines former House Speaker Newt Gingrich would be putting out a plan at some point.",
    "And I think it’s going to happen this year with school board elections and all across this country, and I think it’s going to happen with state attorney elections,” he said.",
    "On Monday, Scott mentioned in his capacity as NRSC chairman, he will do everything he can to get Republicans re-elected, and said they have an opportunity to pick up seats.",
    "He also mentioned Senate Majority Leader Chuck Schumer is helping Nevada Sen. Catherine Cortez Masto who is running against former Nevada Attorney General Adam Laxalt.",
    "Regarding the border wall, Scott said: “In my lifetime, he’s done more for border security — to talk about trying to create border security — than anybody I know of.",
    "The Daily Caller obtained a copy of Scott’s plan and spoke with the current National Republican Senatorial Committee (NRSC) Chairman about his ideas for the party.",
    "I think that one would clearly be something that would make some sense.”\nOn ending an economic relationship with China, Scott said: “I don’t think it’s that hard.",
    "“We’ve got to go win those elections.” He also mentioned when he was governor of Florida he had the authority to take away the cases of a liberal state attorney.",
    "The 11-point plan will be available on RescueAmerica.com, and Scott said he believes his plan will help get the country out of the “deep trouble” it is in.",
    "(RELATED: EXCLUSIVE: Here Are The Key Senate Races NRSC Chairman Rick Scott Says To Watch In 2022)\n“I think we have an opportunity for a lot of seats.",
    "If they knew they had options and if they knew they could find products made in this country or with our allies, they would do it in a heartbeat.",
    "That’s good for us.”\nScott mentioned Democratic Georgia Sen. Raphael Warnock and Arizona Sen. Mark Kelly, saying they are raising a lot of money.",
    "Thirty trillion dollars worth of debt; crime out the wazoo; our kids being indoctrinated with critical race theory; our military becoming woke.",
    "The Daily Caller asked what Scott’s goal was with this plan, to which he said: “My goal is to create a conversation about who are Republicans?",
    "Common sense…such as…men are men, women are women, there are 2 genders…and science confirms that unborn babies are human beings.",
    "The Florida Republican also said that he knows a number of other Republicans who will put out plans with different ideas.",
    "And I tell people, if the law is such that we’re not going to have that crime, then that’s the legislature’s job.",
    "He mentioned that if he expects people to vote for him then he has to give people a reason to vote for him.",
    "Treating Socialism as a foreign adversary and we will use all force to stop it from destroying our country.",
    "An end to the foolish soft-on-crime policies that are destroying our cities and killing innocent Americans.",
    "He also mentioned how Democrats are hurting themselves, which is helping Republicans in the polls.",
    "So, I think that we need to have border security, and we name a lot of stuff after politicians.",
    "Securing our border, building the wall, and naming it after President Donald J. Trump.",
    "If polls won elections, I would not be here because every poll said that I would lose.",
    "“My goal is to get a conversation going about how we’re going to rescue this country.",
    "Republicans like Senator Rick Scott have real solutions to put us back on track.",
    "A complete end to voter fraud and for protecting the integrity of our elections.",
    "“I think the way you do it is you educate Americans on where things are made.",
    "Term limits not only for politicians but also for government bureaucrats.",
    "When I was in business and I didn’t have a plan, I couldn’t raise money.",
    "If they knew that some of their things are being made with slave labor.",
    "Schumer is already running ads against Laxalt and helping Cortez Masto.",
    "We’ve got to rescue this country, and this country is in deep trouble.",
    "We need to start showing up and say what we’re for,” Scott added.",
    "If they knew that China had people in prison for their religion.",
    "But, you’ve got to have an option and you’ve got to know it.",
    "“But on the other side, Warnock and Kelly are raising money.",
    "Hassan has money and she’s trying to improve her position.",
    "The end to our economic relationship with communist China.",
    "If you look right now, the Biden agenda is so unpopular.",
    "The polls are great, but the polls don’t win elections.",
    "I think Americans if they knew where things were made.",
    "I think their government just lies, cheats and steals.",
    "But ultimately, it’s up to campaigns to do their job.",
    "So, I think it’s important to decouple from China.",
    "We’re going to do everything we can to help them.",
    "We’re outraising the Democrats Senate committee.",
    "So, we’ve got to go run good races,” Scott said.",
    "It’s not a prosecutor making those decisions.",
    "So, let’s educate Americans,” he added.",
    "I’m sure you try to do things locally.",
    "A complete end to racial politics.",
    "I think it’s the same with this.",
    "Our military having to withdraw.",
    "I mean, you look at this stuff.",
    "So, we’ve got to get involved.",
    "“Elections matter,” he said.",
    "Our border completely open.",
    "That’s good for us, right?",
    "Why should you elect us?",
    "We all try to do it.",
    "That’s good for us.",
    "Biden’s unpopular."
  ]
}