{
  "id": 7967,
  "mediaId": 2573,
  "date": "2022-04-08",
  "headline": "Senate lawmakers eye hearing on Title 42 repeal amid bipartisan pushback, fears of migrant surge",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/GettyImages-1358276236.jpg",
  "link": "https://www.foxnews.com/politics/senate-lawmakers-hearing-title-42-repeal-bipartisan-pushback-surge",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    3639,
    4466,
    2799,
    4905,
    2736,
    2174,
    1489,
    1471
  ],
  "sentences": [
    "BIPARTISAN BILL TO EXTEND TITLE 42 LATEST SIGN OF MODERATE DEM OPPOSITION TO BIDEN BORDER MOVE\nIt has led to concerns from both Republicans and Democrats about an overwhelming migrant surge in the coming months – something the administration has acknowledged, as it has been preparing for up to 18,000 migrants a day and said publicly it is expecting an influx of migrants.",
    "The Republicans have requested that a number of top officials be invited to the hearing as witnesses, including Attorney General Merrick Garland, Homeland Security Secretary Alejandro Mayorkas and CDC Director Rochelle Walensky – as well as the heads of Customs and Border Protection, Immigration and Customs Enforcement, and U.S.",
    "FIRST ON FOX: Senate lawmakers in the chamber’s Homeland Security Committee are looking to hold a hearing on the Biden administration’s plan to lift Title 42 in May – as the decision faces bipartisan pushback and as Republicans on the committee warn of an \"unconscionable\" migrant surge.",
    "The bill includes not only Republicans such as Sen. James Lankford, R-Okla., and Sen. John Cornyn, R-Texas, but also a number of Democrats: Sens Mark Kelly, D-Ariz., Kyrsten Sinema, D-Ariz., Jon Tester, D-Mont., Joe Manchin, D-W.Va., and Maggie Hassan, D-N.H.",
    "It is unclear whether the Biden administration has plans to respond effectively to the expected surge of illegal immigration that will result from these policy decisions this spring and summer,\" the letter, obtained first by Fox News Digital, says.",
    "The Centers for Disease Control and Prevention (CDC) announced last week that the public health order, which has been used since March 2020 to quickly expel a majority of migrants at the border due to the COVID-19 pandemic, will end on May 23.",
    "In a letter to Homeland Security Committee Chairman Gary Peters, Republicans on the committee requested a hearing on Title 42, and other border security policies – including a recent asylum rule that would allow for quicker processing.",
    "\"With the Biden administration’s termination of Title 42 border restrictions, Border Patrol officials are reportedly predicting a flow of illegal immigration that will lead to as many as 18,000 apprehensions per day,\" they write.",
    "Meanwhile, on Thursday, lawmakers introduced a bipartisan bill to extend Title 42 by at least an extra 60 days, and would require the Department of Homeland Security to submit a plan to deal with a post-Title 42 migrant influx.",
    "In response to that letter, a Democratic committee aide told Fox News Digital that Chairman Peters is already planning to hold a hearing on border security issues in the coming weeks.",
    "\"This surge of illegal immigration is unconscionable, and it is unclear whether or how an already overrun CBP will be able to safely and effectively respond to this expected surge.\"",
    "\"Administration officials must explain to the American people the rationale for their decisions, and what their plans are to deal with the consequences of their actions.\"",
    "Ron Johnson, R-Wis., Rob Portman, R-Ohio, James Lankford, R-Okla., Rand Paul, R-Ky., Rick Scott, R-Fla., Josh Hawley, R-Mo., and Mitt Romney, R-Utah.",
    "The planning for a hearing on the matter comes amid significant pushback to the move, which has included both Democrats and Republicans.",
    "\"The Biden administration’s policies are directly contributing to the historic levels of illegal immigration,\" they say.",
    "\"The implications of both of these decisions will undoubtedly lead to a surge of migrants at our southern border.",
    "Republican states have sued to block the order from ending.",
    "Citizenship and Immigration Services.",
    "Signers on the letter are Sens."
  ]
}