{
  "id": 8189,
  "mediaId": 2644,
  "date": "2022-04-07",
  "headline": "GOP, Dem senators back bill to postpone ending Title 42 at border: report",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/04/senators-title-42-suspension-comp-1.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/04/07/gop-dem-senators-back-bill-to-postpone-ending-title-42/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Moore",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’ll continue pushing for transparency and accountability from the Administration to help secure the border, keep Arizona communities safe, and ensure migrants are treated fairly and humanely.”\n“The Biden Administration is declaring the pandemic over on our southern border but still active on our healthcare workers, military, and travelers,” added Lankford, the top Republican on the Senate Border Management Subcommittee, which Sinema chairs.",
    "“Arizona communities bear the brunt of the federal government’s failure at our border, so we’re stepping in and protecting border communities by ensuring the Administration works hand-in-hand with local leaders, law enforcement, and nonprofits to put a comprehensive, workable plan in place before lifting Title 42,” Sen. Kyrsten Sinema (D-Ariz.), who drafted the bill with Sen. James Lankford (R-Okla.), said in a statement.",
    "Manchin, who represents a state that former President Donald Trump won by nearly 40 percentage points in 2020, has called the CDC’s decision to rescind the policy “frightening.”\n“Title 42 has been an essential tool in combating the spread of COVID-19 and controlling the influx of migrants at our southern border.",
    "A bipartisan group of senators introduced a bill Thursday meant to force the Biden administration to delay ditching the Title 42 health policy next month, warning that suspending the order will unleash a humanitarian crisis as thousands of illegal immigrants flock to the southern border, according to a report.",
    "And we will continue to take additional steps to implement and make clear that this is not the time to come, that there are — there will still be significant measures put in place for anyone who tries to irregularly migrate to the United States,” she said.",
    "The proposal, backed by five Democrats and six Republicans, would postpone the scheduled May 23 rescission of Title 42 by the Centers for Disease Control and Prevention until the administration comes up with a plan to counter the expected influx.",
    "“But when we drop Title 42 at the border, DHS must also implement a workable solution to expel migrants.”\nThe CDC instituted Title 42 in March 2020, at the onset of the COVID-19 pandemic in the US.",
    "“We are nowhere near prepared to deal with that influx.”\nHassan, reacting after the CDC’s April 1 announcement that Title 42 would be scrapped, warned of the consequences of canceling the policy.",
    "At Wednesday’s White House briefing, press secretary Jen Psaki said Title 42 is not an immigration policy, “it’s a public health measure,” and insisted the administration has a plan in place.",
    "“On the president’s first day in office, he sent an immigration bill to Congress that invests in smart solutions, effectively manages the border and addresses the root causes of migration.",
    "I’ll keep pushing the administration to strengthen border security & look forward to hearing directly from border agents during my upcoming trip to the border,” she said on Twitter.",
    "“But as we’re implementing this over the course of the next five weeks, if I’m doing my math correctly, we’ve also surged resources from the Department of Homeland Security.",
    "We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy,” Manchin said last week.",
    "If they think it’s safe enough to lift Title 42 at the border, then it must be safe enough to lift the COVID-19 state of emergency on the whole country,” Lankford added.",
    "But instead of a workable replacement plan, the only plan the Biden Administration seems to have is moving people faster into the interior of the country.",
    "Those that are concerned about [the US] immigration system that [are] holding up COVID funding should pass it,” the White House said in a statement.",
    "The White House responded to Axios that lawmakers should approve the administration’s request for $10 billion in new coronavirus-related funding.",
    "The public health order has allowed border officials to expel nearly 2 million migrants attempting to enter the US without hearing asylum claims.",
    "John Thune of South Dakota, John Cornyn of Texas, Thom Tillis of North Carolina, Shelley Moore Capito of West Virginia and Rob Portman of Ohio.",
    "The number of illegal immigrants encountered at the southern border shot up 6.6% in February from January, Customs and Border Protection said.",
    "“Department of Homeland Security intel projections show that potentially a million people will illegally cross the moment Title 42 is lifted.",
    "Senate Republicans voted against the spending bill on Wednesday, demanding that it include an amendment keeping Title 42 in place.",
    "“Ending Title 42 prematurely will likely lead to a migrant surge that the administration does not appear to be ready for.",
    "Mark Kelly of Arizona and Maggie Hassan of New Hampshire, both of whom face tough re-election fights this November.",
    "Federal officials estimate that as many as 170,000 migrants will head to the border once the Title 42 policy ends.",
    "Joe Manchin of West Virginia and Jon Tester of Montana have also signed on.",
    "Republicans on board with the bill include Sens.",
    "Democratic co-sponsors of the bill include Sens.",
    "The bill was first reported by Axios.",
    "“They cannot have it both ways.",
    "Fellow Democratic Sens.",
    "?"
  ]
}