{
  "id": 8235,
  "mediaId": 8350,
  "date": "2022-04-08",
  "headline": "Here’s who is running in 2022 to represent Arizona in US House and Senate",
  "image": "https://ktar.com/wp-content/uploads/2022/04/getty-congress-exterior-trees.jpg",
  "link": "https://ktar.com/story/4994978/heres-who-is-running-in-2022-to-represent-arizona-in-us-house-and-senate/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KTAR.COM",
  "authorUrl": "https://ktar.com/story/author/ktar-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are the congressional candidates from Arizona who submitted enough signatures to get on the ballot, pending challenges, per the Arizona Secretary of State’s Office (*incumbent):\nSENATE\nRepublican: Mark Brnovich, Jim Lamon, Blake Masters, Mick McGuire, Justin Olson\nDemocrat: Mark Kelly*\nLibertarian: Marc Victor\nHOUSE\nDISTRICT 1\nRepublican: Josh Barnett, Elijah Norton, David Schweikert*\nDemocrat: Jevin Hodge, Adam Metzendorf, Ginger Torres\nDISTRICT 2\nRepublican: Walt Blackman, Eli Crane, Mark DeLuzio, Steven Krystofiak, John Moore, Ron Watkins, Andy Yates\nDemocrat: Tom O’Halleran*\nDISTRICT 3\nRepublican: Jeff Zink\nDemocrat: Ruben Gallego*\nDISTRICT 4\nRepublican: Kelly Cooper, Jerone Davison, Dave Giles, Rene Lopez, Alex Stovall, Tanya Contreras Wheeless\nDemocrat: Greg Stanton*\nDISTRICT 5\nRepublican: Andy Biggs*\nDemocrat: Javier Ramos\nDISTRICT 6\nRepublican: Juan Ciscomani, Lucretia Free, Brandon Martin, Young Mayberry, Kathleen Winn\nDemocrat: Avery Anderson, Kirsten Engel, Daniel Hernandez\nDISTRICT 7\nRepublican: Nina Becker, Luis Pozzolo\nDemocrat: Raúl Grijalva*\nDISTRICT 8\nRepublican: Debbie Lesko*\nDemocrat: None\nDISTRICT 9\nRepublican: Sandra Dowling, Paul Gosar*, Randy Kutz, Adam Morgan\nDemocrat: None\nShare\nComments",
    "Nearly 50 candidates are vying for the state’s 10 seats up for grabs in Congress, with 41 House and seven Senate hopefuls submitting the required number of signatures to qualify for the ballot by the April 4 deadline.",
    "On the Senate side, five Republicans are battling it out to face Democratic incumbent Mark Kelly in a high-profile race seen as a key piece to GOP hopes of gaining control of the upper chamber.",
    "Barring a successful write-in campaign or some other unexpected development, the general election matchup is already set in two other districts.",
    "Arizona’s 2022 election will be the first of a 10-year cycle using district maps that were drawn following the latest U.S. census.",
    "In the only race for a vacant seat, five Republicans and three Democrats are wrangling to represent CD6 in southeastern Arizona.",
    "And Democrat Javier Ramos is the sole challenger to Republican Rep. Andy Biggs in CD5 in the East Valley.",
    "That includes Rep. Debbie Lesko, who is unopposed in the 8th Congressional District in the West Valley.",
    "Republican Reps. Paul Gosar and David Schweikert are the only incumbents with primary challengers.",
    "In the Phoenix-based CD3, Democratic Rep. Ruben Gallego will face Republican Jeff Zink.",
    "(Search with your address here to confirm your new congressional district.)",
    "(Signatures are subject to challenges before the field is officially set.)",
    "Eight of Arizona’s nine House races have incumbents seeking reelection.",
    "The primary election will be held Aug. 2, and the general is Nov. 8."
  ]
}