{
  "id": 8270,
  "mediaId": 8475,
  "date": "2022-04-08",
  "headline": "Kelly, Sinema join Senate in historic vote confirming Ketanji Brown Jackson",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/040822_ketanji_brown_biden.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/040822_justice_jackson/kelly-sinema-join-senate-historic-vote-confirming-ketanji-brown-jackson/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Sacia",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110054",
  "termIds": [
    0
  ],
  "sentences": [
    "Sen. Ted Cruz, R-Texas, tweeted after the vote that Jackson “handed out dramatically lower sentences in some of the most heinous criminal cases.”\nBut Sen. Dick Durbin, D-Ill., asked those who call Jackson soft on crime, “how they explain that she was endorsed by the largest law enforcement … organization in America, the Fraternal Order of Police, as well as the International Chiefs of Police, as well as an army of federal prosecutors.”\nBesides being the first Black woman on the Supreme Court, Jackson will also be the first public defender to sit on the high court.",
    "Many were like Center for American Progress President Patrick Gaspard, who noted that the confirmation of Jackson will make the Supreme Court “more reflective of our nation and the breadth of our legal system.”\nArizona Democratic Chairman Raquel Terán called the nomination “long overdue.”\n“Judge Jackson is one of the most principled, poised, and brightest legal minds in the country, as demonstrated in her confirmation hearings and throughout her lifelong career,” Terán said in a statement.",
    "Sinema, who met with Jackson early last month, said she would be “proud to support her nomination.”\n“Judge Jackson brings to the bench a wealth of knowledge, more trial court experience than all other current Supreme Court Justices combined, a commitment to respect precedent, and a proven independent, pragmatic approach to judicial decisions,” Sinema said in a prepared statement.",
    "Jackson watched the vote at the White House with Biden, who tweeted after the vote that she “will be an incredible justice, and I was honored to share this moment with her.”\nThe vote came despite Republican attempts to portray Jackson, a former public defender and a current judge on the U.S. Court of Appeals for the D.C.",
    "Sen. Mark Kelly, D-Ariz., called it “a historic moment for our country.”\n“Judge Ketanji Brown Jackson is very well-qualified and has demonstrated a commitment to fairly interpreting and upholding the Constitution,” Kelly said in a statement released by his office after the vote.",
    "But Democrats pushed back against what they called “Republican myths” over Jackson’s record, saying her sentences were in the judicial mainstream and reflected her consideration of the defense, prosecution and probation officer’s presentencing report.",
    "Committee Democrats said only 30% of defendants in cases involving viewing or sharing child porn got sentences within the sentencing guidelines\nThat did not stop Republican lawmakers from raising the issue again Thursday, however.",
    "During a week of Senate Judiciary Committee hearings last month, GOP senators particularly focused on her sentencing in child pornography cases, where they said she routinely gave defendants less than the law allowed.",
    "Local\nArizona’s senators joined their fellow Democrats and a handful of Republicans Thursday to confirm the historic appointment of Ketanji Brown Jackson as the first Black woman on the Supreme Court.",
    "Sentencing Commission, time in private practice and clerkships at all levels of the federal judiciary, including time as clerk to Justice Stephen Breyer, whose seat she will fill.",
    "The White House has planned a news conference tomorrow with Jackson, Biden and Vice President Kamala Harris, but she will not be elevated to the Supreme Court immediately.",
    "The 53-47 vote came less than six weeks after Jackson was nominated by President Joe Biden, fulfilling his campaign pledge to nominate a Black woman to the high court.",
    "Along with Kelly and fellow Arizona Democratic Sen. Kyrsten Sinema, all 48 Democrats, both independents and three Republicans – Sens.",
    "Senators typically come and go during votes, but almost all were in the chamber Thursday, reflecting the landmark nature of the vote.",
    "Her advocates point to the breadth of her career, which includes nine years as a federal judge, service on the U.S.",
    "When he announced his retirement, Breyer said he would serve until the end of the court’s current term this summer.",
    "Susan Collins of Maine, Mitt Romney of Utah and Lisa Murkoswki of Alaska – voted to approve the nomination.",
    "Circuit, as a judicial “radical” who is sympathetic to criminals and inexperienced on the bench.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "Praise from liberal groups poured in after Thursday’s vote.",
    "Like what you're reading?",
    "Like what you're reading?",
    "- 30 -"
  ]
}