{
  "id": 8271,
  "mediaId": 2553,
  "date": "2022-04-06",
  "headline": "Senate GOP Blocks COVID Funding Over Fight To Keep Trump-Era Immigration Rules",
  "image": "https://dw-wp-production.imgix.net/2022/04/BB513677-5222-41EB-9DDA-31AEC2AF8FC4-scaled.jpeg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/senate-gop-blocks-covid-funding-over-fight-to-keep-trump-era-immigration-rules",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Rigolizzo",
  "authorUrl": "https://www.dailywire.com/author/john-rigolizzo",
  "termIds": [
    0
  ],
  "sentences": [
    "“There are several other amendments that we’re going to want to offer, and so we’ll need to enter into some kind of agreement to process these amendments in order to go forward with the bill.”\n“Before we’re going to move forward with the bill, we have to have an amendment process agreed to,” Republican Utah Senator Mitt Romney, one of the politicians who negotiated the package, added.",
    "“The U.S. Department of Homeland Security estimates getting rid of Title 42 will result in as many as 18,000 migrants per day – which could mean 540,000 migrants in a single month,” Missouri Attorney General Eric Schmitt warned in the lawsuit.",
    "“This is a potentially devastating vote for every single American who is worried about the possibility of a new variant rearing its nasty head within a few months.”\n“I hope my Republican colleagues change their tune quickly,” he added.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "Democrats need 60 votes to pass a procedural hurdle needed to advance the bill to debate and a vote, but Republicans threatened to kill the bill unless their demands for an amendment to keep Title 42 in place are met.",
    "Despite Schumer’s criticisms, Republicans’ push to maintain Title 42 has garnered bipartisan support after the CDC announced it was terminating the Title 42 provision effective May 23.",
    "“There’ll have to be an amendment on Title 42 to move the bill,” Senate Minority Leader Mitch McConnell (R-KY) told reporters at a press conference after the vote, via The Hill.",
    "The Daily Wire reported last week that moderate Senator Joe Manchin (D-WV) panned the decision, and called on the Biden administration to uphold Title 42 permanently.",
    "“Maybe that would spur us to get a good immigration policy that works for Americans and secure our borders — the borders have to be secure.” Fellow Democratic Sens.",
    "Republicans in the Senate successfully blocked a supplemental funding bill for COVID-19 relief amid growing calls to continue Title 42 immigration restrictions.",
    "According to the New York Post, Schumer changed his vote at the last minute, a procedural move so that he could bring the bill to the floor again.",
    "The Biden administration and Schumer were hoping to pass the bill by Friday before the Senate leaves for a two-week recess at the end of the week.",
    "Multiple Democratic senators, including several who are considered vulnerable in the 2022 midterms, have blasted the Biden administration’s move.",
    "All 50 Republicans in the Senate voted against advancing the bill Tuesday, along with Democratic Senators Ron Wyden (OR) and Chuck Schumer (NY).",
    "Kyrsten Sinema and Mark Kelly of Arizona, Catherine Cortez-Masto of Nevada, and Raphael Warnock of Georgia, have also criticized the decision.",
    "The Trump-era rule which allowed the U.S. to expel migrants coming into the country during the COVID-19 pandemic is set to end on May 23.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "A group of Republican attorneys general is also suing the Biden administration to keep the rule in place, as The Daily Wire reported.",
    "Republicans blocked a bipartisan bill that would provide vaccines, testing and therapeutics for the American people,” Schumer said.",
    "“I sent a letter, I’m against removing Title 42.”\n“If anything, we should be looking at permanency on Title 42,” he added.",
    "Once the amendments were agreed upon, Romney said, the package could pass with “well more than” 60 votes.",
    "“I want there to be no mistake about what just happened here on the Senate floor.",
    "Schumer lashed out at Republicans for blocking the bill from advancing.",
    "“I think they should reconsider,” Manchin said.",
    "Become a member now and join our mission.",
    "Believe the same?"
  ]
}