{
  "id": 8283,
  "mediaId": 2745,
  "date": "2022-04-07",
  "headline": "Opinion: The Amazon warehouse union victory holds a warning for Democrats",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BCANZIFSNUI6ZHN5BVDATVCMDQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/04/07/amazon-union-vote-holds-warning-for-democrats/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Meanwhile, another vote got significantly less attention: Three Democratic senators — Arizona’s Kyrsten Sinema and Mark Kelly, along with West Virginia’s Joe Manchin III (the perennial killjoy to the left’s wish list) — voted against the Biden administration’s nominee to head the Labor Department’s wage and hour division.",
    "They’re also organizing for those things: At Starbucks, the nation’s (and the world’s) largest coffee chain, more than 100 stores have filed with the National Labor Relations Board to hold union elections since last August.",
    "Meanwhile, Politico reported Tuesday on a focus group of committed Democrats angry about inflation, “cynical” about politics and expressing “deep frustration” that Biden couldn’t or wouldn’t keep his campaign promises.",
    "When Starbucks attempted to shift unionization votes from individual stores to multiple locations in a region — a tougher goal for organizers — the National Labor Relations Board said no.",
    "If the party wants to boost its midterm chances, it could start by doing concrete things for workers, such as making it easier for them to unionize and getting them raises.",
    "During the Obama administration, he spearheaded an aggressive upgrade of U.S. overtime laws, which would have boosted the wages of an estimated 4 million salaried workers.",
    "If more Americans think Washington isn’t going to help them and they need to change their working conditions themselves, that spells trouble for Democrats in November.",
    "First, the good news: The bootstrapped effort at Amazon’s Staten Island warehouse to join an upstart union at the mega-retailer was outspent by millions of dollars.",
    "The one-by-one job hopping of the Great Resignation won’t fix workers’ bigger problems, such as the lack of a living wage and uncomfortable working conditions.",
    "In other words, Weil was an effective advocate for workers — and he attempted to hold multinational corporations responsible for their employees’ low wages.",
    "And, in an election year, they’re unlikely to look favorably on the political party that doesn’t deliver on promises to improve pay and working conditions.",
    "But workers need more help, including in the way of permanent law and regulatory changes, so victories are less dependent on who is in the White House.",
    "He looked unfavorably on the franchise model in which major corporations slough off responsibility for employees to a smaller franchisee.",
    "Among other things, the legislation seeks to crack down on companies that punish and retaliate against workers attempting to unionize.",
    "David Weil headed the same department during the Obama administration, and his defense of workers made business interests unhappy.",
    "A number of Democratic senators have not signed on as co-sponsors, including both Arizona Democrats, Sinema and Kelly.",
    "Weil deemed both responsible for the welfare of those workers, a designation the Trump administration later reversed.",
    "Meanwhile, union organizing is a David vs. Goliath battle, with corporations possessing much more power than workers.",
    "There’s a warning for Democrats — the party long aligned with labor interests — in the unexpected success at Amazon.",
    "The numbers won’t budge significantly so long as federal law remains highly unfavorable to unions and organizing.",
    "Joe Biden campaigned for president as a strong supporter of the Protecting the Right to Organize Act, or PRO Act.",
    "Little wonder business interests such as the Chamber of Commerce came out in force against his nomination.",
    "Which is how we came to see Weil voted down, the first nomination vote defeat of Biden’s administration.",
    "The share is worse in the private sector, where organized labor represents a mere 6 percent of workers.",
    "More and more workers might be thinking they can help themselves more than Washington helps them.",
    "There were two developments in the labor sphere last week, one favorable to workers and one not.",
    "Biden is attempting to tackle the imbalance, but he can’t achieve more for workers on his own.",
    "The act would also make it much harder to classify gig workers as independent contractors.",
    "The labor-force changes that many call the Great Resignation are more of a Great Upgrade.",
    "(The effort was first stayed by courts and then dialed back by the Trump administration.)",
    "Good for the NLRB, which finally has a Democratic majority thanks to Biden appointees.",
    "But it is stuck in the Senate, where opponents are not limited to Republicans.",
    "He needs the support of his party to make regulatory and legislative changes.",
    "Many people are quitting jobs for better-paying positions and conditions.",
    "The bill passed the House of Representatives in 2020 and again in 2021.",
    "So what did Weil do to engender this internal party opposition?",
    "Some Democratic legislators are missing that bigger picture.",
    "Barely 10 percent of American workers are union members.",
    "Nine have voted to unionize in the past four months.",
    "(Amazon’s founder, Jeff Bezos, also owns The Post.)",
    "Yet workers won Friday’s vote by a large margin.",
    "That’s down from 20 percent of workers in 1983.",
    "Both workers and Democrats should take note.",
    "Workers are organizing without them.",
    "Voters want results, not excuses.",
    "So how does all this add up?",
    "The NLRB can’t do it alone."
  ]
}