{
  "id": 8289,
  "mediaId": 2717,
  "date": "2022-04-07",
  "headline": "Press Briefing by Press Secretary Jen Psaki, April 7, 2022",
  "image": "https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png",
  "link": "https://www.whitehouse.gov/briefing-room/press-briefings/2022/04/07/press-briefing-by-press-secretary-jen-psaki-april-7-2022/",
  "mediaOutlet": "The White House",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Well, I would say that we are still working through the policy process that, hopefully, we’ll have more to say on soon about what specific mechanisms Ukrainians can apply who wish to come to the United States, even though we know the vast majority have made clear they would like to stay in neighboring countries, which is why we’re providing the most humanitarian assistance of any country in the world to support those efforts that neighboring countries are — have undertaken to host refugees.",
    "And I would remind you and reiterate that we also put out a plan just a month ago that made clear that while COVID-19 will continue to be with us and we will see cases rise and fall, as we are seeing them rise now — to be expected, given the transmissibility of BA.2 — we can now — we now have steps to go back to many of our normal routines in alignment with what the CDC continues to recommend.",
    "Today in Alabama, instead of focusing on critical kitchen-table issues like the economy, COVID, or addressing the country’s mental health crisis, Republican lawmakers are currently debating legislation that, among many things, would target trans youth with tactics that threatens to put pediatricians in prison if they provide medically necessary, lifesaving healthcare for the kids they serve.",
    "But Alabama’s lawmakers and other legislators who are contemplating these discriminar- — discriminatory bills have been put on notice by the Department of Justice and the Department of Health and Human Services that laws and policies preventing care that healthcare professionals recommend for transgender minors may violate the Constitution and federal law.",
    "Q And given, sort of, the uptick in cases that we’ve seen here at the White House, on the Hill — there seems to be, you know, cases going around within the political world here in Washington — and the fact that sometimes you do go beyond the CDC-recommended guidelines, is there any plan just to test the President daily for the next few days or week or so?",
    "Certainly, we don’t anticipate or predict — I have no prediction of an additional opening, but we would certainly expect and call for all members of the Senate to operate as professionally as the President and our team did in this case, which is ensuring that there was advice and consent, that she met — that the — our nominee met with 97 senators.",
    "In addition, I would note the Department of Homeland Security also put together a preparedness plan to continue addressing irregular migration that involves surging personnel and resources to the border, improving border processing, implementing mitigation measures, and working with other countries in the hemisphere to manage migration.",
    "Jonathan Swan did an interview with Mitch McConnell this morning, in which he — Swan asked McConnell whether, if the Republicans should take the Senate in the midterm elections and another vacancy should occur while this President is still in office, whether a Republican-controlled Senate would hold a hearing on another Biden nominee.",
    "MS. PSAKI: Well, I think given it’s a day where, with bipartisan support, we have a new — we are about to have a new member of the Supreme Court — a historic and eminently qualified member of the Supreme Court — and she did get three Republicans supporting her — that is a good sign and something we should take a moment to celebrate.",
    "Q When the last President wanted to host a big event for a Supreme Court nominee here at the White House, some folks got COVID and then-former Vice President Biden called it a “super spreader event.” So is there any risk that this event tomorrow for a Biden Supreme Court, now, Justice is going to be a super spreader event?",
    "MS. PSAKI: Look, regardless of who’s standing against this, our larger point here is: If we do not have treatments, vaccines, or tests that the American people need, Americans will die from COVID and — whether they support or oppose the administration on immigration or childcare, environt- — environmental rules — anybody.",
    "Q Just to kind of follow up on that: The Secretary of State yesterday, in a Russian-language Telegram channel, said, quote, “[W]e’re looking at other systems — some of them larger, more sophisticated — that may be useful going forward…” Is he talking about the systems that allies might have that we’re trying to backfill?",
    "And even though the economy has — is very strong — look at the UI data from today; look at the jobs data from last Friday — we certainly know that costs are continuing to impact people across the country, including students who have — who have — or former students who have student loan payments they need to make.",
    "Q So, some of those people who may have been further back but ultimately had, I don’t know, five minutes — we watched for an hour, literally — in the room may not have been with him for 15 minutes, but could have been in his face having not been tested for an extended period of time.",
    "Just like the extreme government overreach we’ve seen in Texas, where politicians have sent state officials into the homes of loving parents to investigate them for abuse — just to harass and intimidate the LGBTQI+ community — today’s vote in Alabama will only serve to harm kids.",
    "Out of the gate, he proved he had chosen someone in the tradition by immediately getting endorsed by the Fraterni- — Fraternal Order of Police and Judge Thomas Griffith, followed by a procession of leading conservative legal minds and additional law enforcement organizations.",
    "Q But given how — given how intertwined our economies are, could we really do sanctions on China like we are on —\nMS. PSAKI: That is assessment that the Department of Treasury would have to make, but I don’t have a prediction beyond what the Secretary of Treasury said.",
    "What is most important right now, as we’re looking broadly to the country, is the fact that we are very concerned about the failure of Congress to continue to fund our COVID response — the fact that we have needed to, therefore, end our program for the uninsured.",
    "Last item for you before we get to your questions: Across the country, as we’ve talked about a bit in here, Republican elected officials are engaging in a disturbing, cynical trend of attacking vulnerable transgender kids for purely partisan, political reasons.",
    "But what I would tell you —\nQ Eighteen thousand — I’ve got it right here: “Earlier this week, the Department gave reporters an estimate that up to 18,000 migrants could be apprehended at the border each day if Title 42 were to be lifted.” That’s from ABC News.",
    "And the President is going to look for every way he can lower costs for the American people, whether that is the “family fix [glitch]” that he announced with former President Obama earlier this week or the announcement about the pause on student loan payments.",
    "His time on the Judiciary Committee was defining for him and gave him historically exceptional preparation for what we would consider a smooth process characterized by heavy engagement with both parties in the Senate during both the advice and consent phases.",
    "Q Jen, when — so when President Biden continued the pause on student loan payments — repayments, he said that that pause will provide a “continued lifeline as we recover and rebuild from the pandemic.” You said today you want to stop the spread of COVID.",
    "LGBTQI+ people can’t be erased or forced back into any closets, and kids across our nation should be allowed to be who they are without the threat that their parents or their doctor could be imprisoned simply for helping them and loving them.",
    "As we’ve talked about in here a bit, she began her prep work immediately, starting the day after she was announced, and promised to meet with anyone who wanted to and honored it, meeting with 97 senators over the course of her consultations.",
    "Q And the last one on this: Now that the Texas governor is saying that he’s going to start busing border crossers to Washington, D.C., when they get here, are you guys going to help them find a place to stay and something for them to do?",
    "And then, separately, they say, “Have they been in the presence of someone with confirmed or suspected COVID for a total of 15 minutes or more over a 24-hour period?”\nAs far as we know, Speaker Pelosi might’ve left right after the event.",
    "Q And on another topic: A Service agent from the First Lady’s detail was placed on administrative leave after they associated with and were provided gifts from two men who were pretending to be Homeland Security Investigations agents.",
    "And our focus as our — as Department of Defense officials have conveyed on the Hill when they’ve testified this week, has been providing — providing what they are trained on and what we know is effective in fighting this war.",
    "Individuals who come to the border — this is what would happen: CBP and ICE would work together to ensure that anyone who enters the country without authorization is put into immigration proceedings as quickly as possible.",
    "Are folks who are attending going to be required to take any additional steps — you know, other than it being outside and all that stuff — but testing by senators for example, or, you know, distance kept by the President?",
    "I would note we just announced, two days ago, $100 million in Javelins, which are a critical weapon that the Ukrainians have been using effectively to fight the Russians, push back the Russians, and defend their country.",
    "Q Jen, a follow-up on —\nQ Jen, can I ask whether it’s the view of the President’s position that if he gets COVID, he’ll have a mild case because he has the second booster, given his age and given his health profile?",
    "We’re also, though — I would point you to the 100-page plan we put out just a month ago, where it made clear that we will continue to see COVID — COVID will continue to be with us; we will see cases rise and fall.",
    "We’d be able to get ahead and plan ahead for purchases of testing — to ensure we had testing capacity; to make sure we could place some orders for treatment — preventative treatments for the immunocompromised.",
    "We know that, to date, nearly 80 percent of non-citizens waiting in the interior under prosecut- — prosecutorial discretion have either received a notice to appear or are still within their window to report.",
    "Q And given the fact that there has been this uptick among, you know, people who have been following CDC guidelines, are there plans to revisit those guidelines or edit them in some way, given the uptick?",
    "As of now, we have provided — committed to providing $1.7 billion of weapons, of security assistance to Ukraine since the beginning of this conflict; more than $2 billion since the President took office.",
    "There are very good questions, I’m sure you have, about family reunification, prioritization, and whether there will be prioritization for individuals who fear persecution and things along those lines.",
    "And there are a number of leaders around the world who have also had engagements with Russians and engagements with the Ukrainians, and we just ask that they all engage closely with Ukrainians as well.",
    "First, on the announcement about the extension of student loan pau- — the student loan pause: What I said yesterday is also that what we look at is the impact of the pandemic on the economic recovery.",
    "So, to go to your other questions: In September, the Attorney General issued a new policy imposing restrictions on the use of no-knock warrants, chokeholds, and carotid restraints by federal agents.",
    "That includes social distancing in meetings whenever possible — a step we take — an additional precautionary step we take in order to protect him and protect other senior members of the White House.",
    "Q And is it fair for us to conclude that the event tomorrow — was a factor in it being outside and being tomorrow, given outside it’s raining today —\nMS. PSAKI: It’s supposed to be a beautiful day.",
    "And there is also systems and — weapons systems that they may request that we may not talk about because, for operational reasons and their own process, it wouldn’t be to their benefit to do that.",
    "This historic job growth is a direct result of the American Rescue Plan, which funded our vaccination strategy, reopened schools, and helped grow the economy from the bottom up and the middle out.",
    "So, is it the White House position that President Biden — 14 minutes, seven feet away from Speaker Pelosi — is not a close contact, but 15 minutes, six feet away would have been a close contact?",
    "Q You just talked about how historic today was for Judge Jackson to be confirmed, but no reporters were allowed in the room, no TV cameras were allowed in the room to help record that history.",
    "And then, Germany’s foreign intelligence service briefed a parliamentary committee over there that it had intercepted radio communications of Russian soldiers talking about killing civilians.",
    "I would also note that as it relates to the type of systems and materiel we are providing: For every Russian tank in Ukraine, the United States will have or has provided 10 anti-tank systems.",
    "And with a transmissible — a variant that’s as transmissible as BA.2, that’s what we’re seeing at this point in time in the White House, in — among the press corps, among the general public.",
    "If he is a — if he were a close contact, the only difference — or I don’t even know that it would be a difference; it would be a five — a five-day te- — a test five days after your contact.",
    "But given the importance of his role and his age, is the White House considering any stricter measures to keep him safe: more mask wearing, fewer big venue events, more outdoor events?",
    "MS. PSAKI: There will be ongoing conversations with China, I would expect, including our expectation that they abide by sanctions and that they not provide material support to Russia.",
    "We are not going to be able to make purchases of a broad scope of boosters; of Evusheld, which is a treatment for immunocompromised — or preventative treatment for immunocompromised.",
    "CBP has been working with ICE to ensure individuals awaiting processing in the interior of the country monitor und- — would be monitored under the Alternatives to Detention program.",
    "MS. PSAKI: Well, let me give you — I mean, so, first, like so many across the nation — and obviously this news is a reminder of how we’ve all mourned the tragic death of Amir Locke.",
    "To help Europe develop energy independence from Russia, would the Biden administration drop its opposition to the EU EastMed pipeline being developed by Israel, Cyprus, and Greece?",
    "We know that we can’t buy any additional treatments beyond those that have already been paid for and contracted, of course, including preventative treatments for immunocompromised.",
    "And up to $8 billion in new money will go to defense purpose, which will be bring Canada’s defense contribution to approximately 1.5 percent of the GDP; not yet to the 2 percent.",
    "Does that apply just to Executive Office employees, or is that true also of any members of Congress or invited guests who are here at the White House meeting with the President?",
    "MS. PSAKI: Well, we applaud that increase, and we applaud Canada’s efforts and support for — in standing up against the invasion of Ukraine by President Putin and the Russians.",
    "Q And my second question, it goes back to the aid — the aid you detailed at the beginning of the briefing to the Russian military, all sorts of —\nMS. PSAKI: Ukrainian military.",
    "Yesterday, you said they decided to move the goalposts and that the White House is questioning whether Republicans are acting in good faith or if they’re just playing politics.",
    "I just want to verify again: You referred to, you know, that they — there are requests coming to you, and you go through the list, and sometimes you need old Soviet equipment.",
    "I know we’ve provided a broad range and a significant amount of financial assistance, but let me — let me check and see where that — what the status is at this point in time.",
    "The President was face to face with many individuals, right up in their mugs, for extended periods of time because he was enjoying this moment — a chance to visit with folks.",
    "He promised to choose a successor in the mold of Justice Breyer, as Republicans and Democrats called for, and after thorough consideration, as you know, chose Judge Jackson.",
    "MS. PSAKI: Well, I don’t think, Peter, we can assess where they — where they got COVID or where they — where they acquired COVID — or whatever the right way to say that is.",
    "But if somebody is going to be in close proximity, standing next to him, sitting next to him on a stage, that would be obviously different than a broad group of attendees.",
    "And this is a 100-page preparedness plan that we put out that — meant to protect against and treat COVID, prepare for new variants, prevent shutdowns, vaccinate the world.",
    "MS. PSAKI: He’s — he’s talking about — we’re not going to detail always every type of system or every type of weapon we’re going to work with allies to provide or provide.",
    "We have provi- — we have detailed it quite extensively from here, but we’re not going to detail everything — we haven’t — over the course of time for operational purposes.",
    "She further displayed her work ethic, extraordinary credentials, and character when she testified for over 20 hours and answered the most QFRs of any SCOTUS nominee ever.",
    "I also wanted to highlight that on UI data that was released today, as you can see in here, the comparison between January of 2021 and March, now that we are in, of 2022.",
    "He knows there are a number of steps and precautions that we put in place and we take to protect him and protect the Vice President and other senior members of the team.",
    "I don’t have an update on the timing of that, but that is something we are continuing to look at to build on, of course, the actions taken by the Department of Justice.",
    "The way this works — and it’s the last thing I’ll say and get to your next question — the way that it works is that the Ukrainian leaders request a range of assistance.",
    "I don’t have anything to predict in terms of which channel it will happen through next, but certainly I would expect there will be ongoing and continued conversations.",
    "Given you yourself saying, you know, how transmissible BA.2 is, are there any conversations happening here on campus, at the White House, to reinstate a mask mandate?",
    "And we made a decision late in the process that we would have some photographers — some of your colleagues in the news media — in the room to capture it for history.",
    "Those treatments, as you know, often take six months to manufacture, so we’d also be losing out on supply that we intended to purchase for September through January.",
    "MS. PSAKI: Our policy has not changed, but other countries, of course, could make that determination and decide to do it, and we certainly wouldn’t stand in the way.",
    "And where we are, as it relates to the war in Ukraine, is also making it much more difficult for President Putin to fund this war, and that is a huge priority to us.",
    "Since President Oba- — Biden took office, our economy has added 7.9 million jobs; that’s more jobs created on average per month than any other President in history.",
    "MS. PSAKI: Well, I would tell you that the biggest factors are actually that — and we would’ve had events outside earlier in the week too, had the weather allowed.",
    "But what he was conveying is that we’ll continue to work with our partners and allies in meeting the needs and the requests that the Ukrainians have put forward.",
    "For those employees who test positive, they are required to isolate, of course, in alignment with CDC guidance, and must test negative before returning to work.",
    "But, obviously, there would be these programs — and we’d have more details before then, for sure — that Ukrainians who are eligible would be able to apply for.",
    "Obviously, this is a tremendously historic day in the White House and in the country, and this is a fulfillment of a promise the President made to the country.",
    "Q There are reports that there has been an increased number of Ukrainian refugees heading to this — that are at the southern border — around 2,000 in Tijuana.",
    "MS. PSAKI: I haven’t seen — I obviously watched most parts of the vote, but I know that she was alone, up — kind of on the dais for the vast majority of that.",
    "MS. PSAKI: Look, I think there’s going to be decisions made by European leaders about how to reduce their — any level of dependence they have on Russian oil.",
    "MS. PSAKI: Well, listen, I don’t know, but I know that the governor of Texas or any state does not have the legal authority to compel anyone to get on a bus.",
    "So, I guess, is there any other preparations that are being made in addition to whatever expected rise of migrants coming to the border once Title 42 ends?",
    "It’s not immigration authority or policy, it’s a public health decision, and we respect the authority given to them by Congress to make that determination.",
    "And we’ve already seen, to date, that the use of this security assistance has been central and essential in effectively fighting the war as they have done.",
    "You know, the State Department hasn’t really outlined the specifics on how they want to, you know, address allowing 100,000 Ukrainian refugees to the U.S.",
    "Back on COVID, it’s pretty clear that vaccines and boosters are not going to prevent you from getting COVID, but we know from science that masking does.",
    "To be clear, every major medical association agrees that gender-affirming healthcare for transgender kids is a best practice and potentially lifesaving.",
    "And if there is 15 minutes that he spends with somebody in person within six feet and they test positive for COVID, then that would be a close contact.",
    "Is there a threat that this is going to be a national security problem if the Cabinet comes to the White House and starts getting infected with COVID?",
    "We are continuing to look at them on executive action to advance police reform, obviously something we put a pause on while that was being negotiated.",
    "I guess I was wondering, what are the administration’s plans to kind of address a rise of Ukrainian refugees that might come to the southern border?",
    "I just think that, to me, was interesting and compelling to better understand the significance and the broad scope of the assistance we’ve provided.",
    "But I just wanted to highlight Vedant and his amazing contributions and everything he does to help me, help all of us, help the President every day.",
    "If we don’t have access to it — sometimes it’s Russian-made military equipment — we work with our allies and partners to see what they can provide.",
    "We have to continue to work with allies and partners on what systems and equipment they have access to and they would have the capacity to provide.",
    "We also functioned seamlessly with the Judiciary Committee and leadership, and we were conscientious about being a good resource to Republicans.",
    "MS. PSAKI: No, he’s —\nQ He’s completely — he’s completely nonplussed by the fact that a growing number of people around him are getting COVID?",
    "Q Jen, is there pressure to avoid saying that President Biden has a — had a close contact given his position and the demands of his schedule?",
    "But again, I think when they put out these guidelines, they made clear that it was about looking at data on hospitalizations and even deaths.",
    "It just means we are defining, for all of you, whether the President and their interaction met the definition of the CDC of a close contact.",
    "And the CDC specifics on what a close contact and how it’s defined are in place for a reason: to give everybody clear, data-driven guidance.",
    "Q The CDC aside, and distance, et cetera — has the President expressed any surprise or amazement that there’s a number of cases around him?",
    "Q And then, on a different topic, when Title 42 expires next month, what is the plan for the 18,000 migrants a day that are going to cross?",
    "We can have a range of debates about a range of issues we have disagreements on; that’s fine — immigration, childcare, environmental rules.",
    "This week, you’ve been critical of Republicans trying to add amendment votes onto the COVID funding bill, specifically regarding Title 42.",
    "I think you addressed this in February a little bit, but I wonder if there’s been any action or movement or further conversation about it.",
    "President Biden has committed in both words and actions to fight for all Americans and will not hesitate to hold these states accountable.",
    "Or has the U.S. just concluded China is not going to budge on its position, which is to not really get involved and try to push them off?",
    "Because it doesn’t take 15 minutes to get COVID, and this is more transmissible — this latest variant — than other variants in the past.",
    "We have incredibly stringent protocols here at the White House that we keep in place to keep the President safe, to keep everybody safe.",
    "They are all — many of them are able to work from home, as many staff and even reporters are, who are — who are vaccinated and boosted.",
    "There are individuals who are masked because they are close contact, and that is part of our protocols — they have had a close contact.",
    "And as we’re looking broadly beyond the White House of how we’re planning, that is our greatest, biggest concern at this point in time.",
    "And I think working in the White House, just like being a reporter — people think you have glamorous se- — glamorous setups back there.",
    "I’m wondering if it’s time for the U.S. and other allies to not just provide defensive weaponry but actually provide offensive weapons.",
    "But Democratic senators Mark Kelly, Kyrsten Sinema, Joe Manchin, Maggie Hassan, and Jon Tester are joining Republicans in this effort.",
    "Yesterday, Treasury Secretary Janet Yellen is saying that the U.S. would use all its sanction tools should China move towards Taiwan.",
    "How can you guys say that President Biden was not a close contact with Speaker Pelosi when there is video of the Speaker kissing him?",
    "And the most important message we’re sending to the public is that we have steps in place that we can take to continue to address it.",
    "And what we have a plan to address, and I would note — I have it with me, because we really like COVID props this week — right here.",
    "And last month, the unemployment rate fell to 3.6 percent, down from 6.7 percent when the President took office about 15 months ago.",
    "MS. PSAKI: I will tell you, I’m not spending a lot of time, nor is the President, thinking about the dress code of Rand Paul today.",
    "Look, I think it is simply a reflection of my appreciation for the incredible people on my team that I get to work with every day.",
    "The congressional approval from the confirmation vote today tells us that Senator Rand Paul cast his vote from the GOP cloakroom.",
    "But since Republicans refuse to support the George Floyd Justice in Policing Act, we are looking at additional steps we can take.",
    "Those go over and above CDC guidelines, and that includes ensuring that anyone who is going to be around the President is tested.",
    "If you’re going to see him in person, whether you’re traveling with him or you’re meeting in the Oval Office, you will be tested.",
    "Q And given what you’ve said about the plan in place and about living with COVID, is the end goal not to stop the spread anymore?",
    "Our testing capacity will be at the risk of — risk of collapsing, at least from the federal government and what we can provide.",
    "Those goals go hand-in-hand, and we can achieve them, in part, by building trust between the police and communities they serve.",
    "But right now, this is a game of politics, and we need to get this funding, otherwise people in the country are going to die.",
    "But I can certainly check on the next purchase of monoclonals and if we — if we have any ability to purchase that as planned.",
    "MS. PSAKI: Well, again, if individuals are within six feet of him for 15 minutes or more, that’s considered a close contact.",
    "Over the last four weeks, fewer Americans filed initial claims for unemployment insurance than any time in recorded history.",
    "It is that time of year, and certainly we do know that it is better to have events outside when you can have them outside.",
    "Q Close call in the sense that they were in two events at the White House together; within two days, she tested positive.",
    "Q And that is: What is this administration’s response to Israel for their role as mediator in this Russia-Ukraine crisis?",
    "And typically, individuals who are going to be in close proximity, like on the stage or something, they would be tested.",
    "In terms of additional testing or anything along those lines, those assessments would be made by the President’s doctor.",
    "Tomorrow, as we’ve announced, we have an event — a moment in history — where, certainly, the President will be speaking.",
    "Senator Jones and the additional staff brought on during the process made invaluable contributions essential to success.",
    "Well, we certainly support the efforts of a range of leaders to — that — who are hoping to play a diplomatic role here.",
    "Tomorrow, during the event or if there’s any reception behind the scenes, will she be required to wear a mask indoors?",
    "Q So, just — do you have any further guidance on what these two men were after or who they may have been working with?",
    "Is the U.S. either aware of that intelligence, or does it have any intercepts of its own that show something similar?",
    "And we know, here in the White House, of course, 99 percent of people are vaccinated; many, many people are boosted.",
    "A lot of people criticizing that the federal government has not done enough to fix the grid there —\nMS. PSAKI: Sure.",
    "We’re thinking about the historic confirmation of an eminently qualified Black woman to serve on the Supreme Court.",
    "I would also note, since I’ve had a rotation of fabulous colleagues in here today: Today we have Vedant Patel here.",
    "For every Russian armored vehicle in Ukraine, the United States will have provided about three anti-armor systems.",
    "But the President is committed to ensuring fair, impartial, and effective policing, keeping our communities safe.",
    "If Republicans want to work on immigration, come on down to the White House; we’re happy to work with you on it.",
    "MS. PSAKI: Well, I think that is what we see statistically and through — as we look at health analysis and data.",
    "His own office admits that a migrant would need to voluntarily be transported and that he can’t compel them to.",
    "And they talked about, “Was this person less than six feet away from someone?” Yes, in President Biden’s case.",
    "MS. PSAKI: Well, we would be able to have the funding, hopefully, to reopen some of our uninsured programming.",
    "And they all have a talented and experienced team who is stepping into their shoes where needed in the office.",
    "Those photos have been used by networks — including, likely, your network — over the course of the last hour.",
    "There are certain systems, as you’ve noted — the S-300 is one of them, of course — where they have requested.",
    "MS. PSAKI: That would be a decision made by his doctor, but that is not deemed to be necessary at this point.",
    "Is there a risk that you can’t proceed with previously announced funding, namely of Pfizer’s pill, Paxlovid?",
    "So, my question is: If we’re still recovering from the pandemic, why then is Title 42 going to be re-lifted?",
    "Because again, enforcement of our country’s immigration laws lies with the federal government, not a state.",
    "And how they define it is being within six feet for a cumulative total of 15 minutes over a 24-hour period.",
    "Ukraine’s foreign minister at NATO made very clear that his country needs more weapons and needs them fast.",
    "The President’s outreach continued at this stage, calling senators in both parties early about his choice.",
    "We have a range of systems we have access to that we have been providing and we will continue to provide.",
    "MS. PSAKI: It’s being investigated, and I would point you to the proper agencies for any further comment.",
    "And I ask by way of saying: Was there a discussion of whether to treat him as a close contact to anybody?",
    "Q What’s the difference if a bill passes three weeks from now versus having — if it had passed this week?",
    "MS. PSAKI: I have seen the reports, but I don’t have anything more on those reports or the intelligence.",
    "Q So he’s potentially talking about U.S. systems that we just aren’t necessarily aware of at this point?",
    "Q Congress voted to remove most-favored-nation trade status for Russia and Belarus and ban oil imports.",
    "Those are all steps that they’re working to do in order to implement when we get to that point in time.",
    "Q And the CDC is actually a little less clear on the link between the two clauses that you’re linking.",
    "And even as we’re continuing to fight COVID, we can, for the most part, return to our normal routines.",
    "And also, we want to be able to invite a large number of people, and this would enable us to do that.",
    "So, is the White House position —\nMS. PSAKI: But she wasn’t —\nQ — but she was, like, seven feet away.",
    "And individuals who may decide to mask because they have health issues in their family, personally.",
    "President Biden also continues to call on Congress to pass comprehensive police reform legislation.",
    "You’ve seen a number of leaders this week announce their intention to ban oil imports from Russia.",
    "MS. PSAKI: Well, Peter, the way that it is defined is by the Center for Disease Control — the CDC.",
    "MS. PSAKI: I may have to check on that specific component for you, Josh, and I’m happy to do that.",
    "Q Is it fair to say COVID risk was part of the calculus in deciding how to mark this confirmation?",
    "The vast majority of people who are opposing this moving forward are Republicans; that is a fact.",
    "He was in casual clothes, without a suit jacket or tie, so he was unable to come onto the floor.",
    "But I would remind you that pipelines are a means of moving oil; it’s not a means of production.",
    "MS. PSAKI: No, no, I — I love the Britishness and the accent, not to put you on notice of sorts.",
    "And then they asked — they say to consider the time spent with someone starting two days before.",
    "Q Is there any ongoing or future — near-future conversations with China on the Russia situation?",
    "And their definition of it is 15 minutes of contact within a set period of time within six feet.",
    "MS. PSAKI: Well, today was meant to be a private moment between the President and Judge Jackson.",
    "It does not mean that no one will get COVID around the world who does not have a close contact.",
    "We now know how to protect ourselves from hospitalization and death, which is hugely important.",
    "Yes, this is something the President supports, had called for, and certainly plans to sign it.",
    "Q So, given, you said, it’s not — it doesn’t necessarily take 15 minutes to get COVID — right?",
    "And is the administration considering transferring those Polish planes to Ukraine (inaudible)?",
    "You know, we are still implementing Title 42 at the border for anyone who comes to the border.",
    "And I would point you to the Department of Justice for any specifics about next legal actions.",
    "Is it your sense that Judge Jackson will ascend to the bench sooner than the end of the term?",
    "Because our understanding was that Justice Breyer was going to retire at the end of the term.",
    "Well, for clarity purposes, what — the way a “close contact” is defined — it’s not arbitrary.",
    "MS. PSAKI: Of course, we’re trying to stop the spread, and we have the means to address that.",
    "There are other events obviously that have happened over the course of the last week as well.",
    "All of this begs an important question: What are these policies actually trying to solve for?",
    "Q Can I also ask you about the Amir Locke — the case involving Amir Locke —\nMS. PSAKI: Sure.",
    "MS. PSAKI: Well, we have sanctioned China in the past, as you know, for human rights abuses.",
    "Does the President maintain confidence in the Director of the Secret Service, James Murray?",
    "— the range and the significance and the totality of the type of assistance we’ve provided.",
    "I mean, what we do know is that, by the end of June, the testing capacity will be at risk.",
    "That’s not what they’re recommending, given we are in a yellow zone at this point in time.",
    "Q Speaker Pelosi was not considered a close contact, but it seems like a very close call.",
    "And, Jen, sorry — on the broader COVID question: It looks like that bill has stalled now.",
    "Does the administration wish Canada would do more, considering the actual war in Ukraine?",
    "MS. PSAKI: Well, I provided them because I think it’s interesting or compelling —\nQ Yeah.",
    "I would say sanctions have a range of purposes, including putting consequences in place.",
    "Today, she was presiding over the vote for Ketanji Brown Jackson and didn’t wear a mask.",
    "And if his doctor deems he should be tested more frequently, he certainly could do that.",
    "MS. PSAKI: Well, I’m not aware of what authority the governor would be doing that under.",
    "That when we get to the end of June, our testing capacity will be at risk of collapsing.",
    "MS. PSAKI: Well, when you say it’s a “close call,” I’m not sure what you mean by that.",
    "MS. PSAKI: Well, partly, yes, because there are systems, of course, we have access to.",
    "MS. PSAKI: I don’t have any more details on Ketanji Brown Jackson’s testing protocols.",
    "I’ve ma- — I’ve presented them with sashes to wear — all sorts of embarrassing things.",
    "The decision about Title 42 is a decision made by the CDC — a public health decision.",
    "Q And if I — if I may as well: We’ve enjoyed your shout-outs to members of your team.",
    "Q Are you saying that that’s sufficient, that you feel that you’ve given them enough?",
    "The President said that sanctions were not a deterrent on Russia going into Ukraine.",
    "Q But if just, for example —\nMS. PSAKI: But, again, the CDC guidelines are in place.",
    "Is there anything being done differently, given that circumstance for the President?",
    "But there’s no question, Josh, that that also is true statistically, or (inaudible).",
    "I know you said that he had a second booster and that he’s following CDC guidelines.",
    "At least two additional Cabinet members — Raimondo and Garland — already have COVID.",
    "Now, if you’re at an event, obviously there are assessments made on a case by case.",
    "Q But you’re saying there’ll be no letup in your efforts to provide them with more?",
    "By the way, the President put forward an immigration bill his first day in office.",
    "Q Back on COVID, you just said that anyone who is around the President is tested.",
    "That is how we would conduct ourselves, and we would expect the same in response.",
    "MS. PSAKI: We have anticipated that there would be rising numbers of COVID cases.",
    "We have not stopped nor are we stopping providing additional security assistance.",
    "There are reports, I think, two other Republican senators may have done similar.",
    "But there are protocols that are evaluated on a case by case as we have events.",
    "And, obviously, we’re taking steps to convey that this is not the time to come.",
    "So, for clarity, not everybody in that room was tested in advance of arriving.",
    "MS. PSAKI: I don’t have any updates on that, but — or any changes to that, no.",
    "And when do you think the shipments of the monoclonal antibodies will run out?",
    "And we’re working toward implementation of the lifting of Title 42 next month.",
    "MS. PSAKI: I think I’m — I — it’s — I don’t know that it’s an American phrase.",
    "And is there any — does he have any thoughts on, like, the no-knock warrants?",
    "They were supposed to run out in May, but you’ve been shipping fewer of them.",
    "And what do you think it says about the health of our constitutional system?",
    "MS. PSAKI: I don’t know where you’re basing your specific numbers on, Peter.",
    "That means one tank — Russian tank, 10 anti-tank systems to fight them back.",
    "We know how — how much getting vaccinated, getting boosted can protect you.",
    "Does the White House have the same criticism we’ve heard about Republicans?",
    "You noted that Vice President Kamala Harris is considered a close contact.",
    "And we have sanctioned a range of countries, certainly, around the world.",
    "MS. PSAKI: If they are individuals who have a meeting with the President.",
    "Any of you who work on immigration and climate issues know him very well.",
    "James S. Brady Press Briefing Room\n2:35 P.M. EDT\nMS. PSAKI: Hi, everyone.",
    "The President’s outreach — Justice Jackson, I guess we can now call her.",
    "All of their interactions were publicly available; I think you saw them.",
    "But we would always abide by CDC guidance and go beyond it if necessary.",
    "MS. PSAKI: Well, one, at that point in time, vaccines weren’t available.",
    "Q Ketanji Brown Jackson tested negative before her visit today, I trust.",
    "What are the short-term consequences of not having new funding in place?",
    "Or, I guess, what made it different that she didn’t have to wear a mask?",
    "Q But first I want to —\nMS. PSAKI: You can ask me a COVID question too.",
    "But, obviously, you know, we would — he would be treated by his doctor.",
    "What’s his — just his kind of human-level response to what’s going on?",
    "MS. PSAKI: Well, again —\nQ Or are you still trying to stop the spread?",
    "Is there something else that you want these 18,000 a day to be doing?",
    "And I’m not going to make a prediction of that at this point in time.",
    "How long will the cupboard last on the monoclonals without any money?",
    "Is that an appropriate way to vote on a historic occasion like this?",
    "MS. PSAKI: I have nothing to announce about —\nQ Final question, Jen.",
    "If you factor in contributions from allies, we’re almost at 90 to 1.",
    "I’m not a weatherperson, but that is what everything is telling us.",
    "So —\nQ (Inaudible) he’d have to wear a mask for 10 days in public.",
    "— whether you’re now working on notice, on your — on your way out.",
    "And have we just recovered from the border, then — does that mean?",
    "Is there going to be anything above and beyond just being outside?",
    "I think he has a very promising career in government ahead of him.",
    "MS. PSAKI: No, I don’t think I conveyed that in any — in any way.",
    "Are there any actions that the President is planning to do there?",
    "But beyond that, I haven’t — I haven’t done any further analysis.",
    "Q Let me ask you about the Secret Service very quickly, if I can.",
    "If you — we try to do socially distanced meetings when necessary.",
    "Does President Biden plan to sign —\nMS. PSAKI: A hundred to zero.",
    "What was, for clarity’s perspective, was he trying to say there?",
    "Do you expect it not to be a serious case if he were to get it?",
    "But our point here is that there is an urgency to move forward.",
    "If you factor in contributions from allies, it’s about 25 to 1.",
    "But it being outside is certainly an important component here.",
    "And if he is a close contact, that is what exactly he will do.",
    "We announced yesterday the Vice President had a close contact.",
    "And as we know, they’re going on a two-week recess right now.",
    "I’d point you to the Secret Service and others investigating.",
    "Q And a question on Puerto Rico — non-COVID — I swore, right?",
    "I would leave that at the comments of the Treasury Secretary.",
    "MS. PSAKI: She’ll follow CDC protocols in any of her events.",
    "And our thoughts and prayers continue to be with his family.",
    "The President is committed — and, of course, he is aware of.",
    "It is not the numbers, in here, where it was around Omicron.",
    "We provide a vast, vast majority of what they’re requesting.",
    "I often joke with him that we give him the easy assignments.",
    "Every member of the staff is on a regular testing protocol.",
    "I wonder what — you know, is the President read in on this?",
    "Those are all important questions that are being discussed.",
    "But I’d point you to the European leader to speak to that.",
    "So that includes both the ACA event and yesterday’s event.",
    "We go through that list; we determine what we can provide.",
    "MS. PSAKI: Well, let me give you a sense of where we are.",
    "It is meant to be — it is supposed to be a beautiful day.",
    "MS. PSAKI: He was tested last night and tested negative.",
    "Q You don’t think people want to visit Washington, D.C.?",
    "For example, yesterday we were in the State Dining Room.",
    "Is there a revis- — a revisit that you can look at that?",
    "Q — and the officers that are not charged in that case?",
    "And according to CDC guidelines —\nMS. PSAKI: Yesterday.",
    "There are transfers of systems nearly every single day.",
    "I don’t know if that means he could be a wire reporter.",
    "I guess the President obviously tested negative today.",
    "Obviously, he was around Nancy Pelosi and many others.",
    "That includes testing for anybody who goes to see him.",
    "And, of course, she has been wearing a mask otherwise.",
    "I guess, does the White House have a response to that?",
    "Q And then one more question, sort of on immigration.",
    "And they are an important partner and continue to be.",
    "Does that apply to these Democratic senators as well?",
    "And, of course, the uninsured fund is already closed.",
    "MS. PSAKI: Well, “up to.” And we’ll see what happens.",
    "That’s obviously a great number from the other party.",
    "But we are going to continue to follow the protocols.",
    "Vedant — I’ll say about him: He’s a beautiful writer.",
    "We expected there to be ups and downs and increases.",
    "MS. PSAKI: We would continue to follow CDC guidance.",
    "I think it’s pretty clear this is a publicity stunt.",
    "I wonder if this means you’re now working on notice.",
    "Q The Ukrainian — yeah, Ukraine military, of course.",
    "I don’t have any predictions about future sanctions.",
    "Q There’s a million-people-plus without power there.",
    "Q It is clear, but it’s not always accurate, right?",
    "Did you — is that part of the reason it’s outside?",
    "And so, we have policies that also go even beyond.",
    "That’s what I was referring to: our own protocols.",
    "Q Whether you’re now — is that an American phrase?",
    "We have announcements nearly every couple of days.",
    "And it’s just simply an effort to recognize that.",
    "Q And a quick follow-up on Vice President Harris.",
    "And I don’t know if it was among the press corps.",
    "We have copies for anyone who would like a copy.",
    "This event is also going to be outside tomorrow.",
    "And that’s something we also certainly support.",
    "He was tested last evening and tested negative.",
    "And they spent about 45 minutes the day before.",
    "He’s tested typically a couple of times a week.",
    "MS. PSAKI: Let me see if I can unpack —\nQ Yeah.",
    "The first one is: “Budget Day” in Ottawa today.",
    "It doesn’t necessarily require that much time.",
    "It’s not something made up by the White House.",
    "MS. PSAKI: I don’t have any comment from here.",
    "That is also a step that goes over and above.",
    "It certainly wasn’t among the general public.",
    "And we would apply the policy to everybody.",
    "I just want to be specific about tomorrow.",
    "It certainly puts us in a different space.",
    "But this was meant to be a private moment.",
    "I mean, what do you mean by those metrics?",
    "Can you help us understand that decision?",
    "And just one more on the news of the day.",
    "Sometimes that means backfilling systems.",
    "And has he asked for people to stay away?",
    "I’ve shouted them out in the past before.",
    "I’m here to confirm that is not the case.",
    "But obviously — coming from any country.",
    "MS. PSAKI: Well, he is tested regularly.",
    "Q Half the Cabinet was there on Tuesday.",
    "We have the best military in the world.",
    "MS. PSAKI: That would be up to the CDC.",
    "And that’s how that assessment is made.",
    "Q And just a second question, if I can.",
    "I want to give you a chance to respond.",
    "No one in there was, that I’m aware of.",
    "Are the MiG-29s in — still in the list?",
    "So, is that message a deterrent or not?",
    "And so, our point: It’s not political.",
    "It’s just because he’s super talented.",
    "A couple of items for you at the top.",
    "I have a non-COVID question, I swear.",
    "As you know, he was tested yesterday.",
    "That was about 14 minutes yesterday.",
    "And we’ll be marking it in that way.",
    "Not really worried about his khakis.",
    "MS. PSAKI: — a few things in there.",
    "But our team works their tails off.",
    "I — I have —\nQ Excuse my Briticism.",
    "He refused to answer that question.",
    "Are you doing anything differently?",
    "MS. PSAKI: — to understand — right?",
    "So, those are the biggest factors.",
    "Do you want them to get jobs here?",
    "I don’t know that it was Tuesday.",
    "And that’s part of our protocols.",
    "She was, you know, as far as you.",
    "MS. PSAKI: I’m — I’m sorry, what?",
    "MS. PSAKI: Not that I’m aware of.",
    "Is the President read in on that?",
    "CDC guidance says to wear a mask.",
    "I’ve got — I’ve got three things.",
    "And I have a follow-up question.",
    "So it could take less than that.",
    "Is the First Lady aware of this?",
    "Is it just to stop severe cases?",
    "Q And quickly, on another topic.",
    "Is the President aware of this?",
    "We will have a range of guests.",
    "Do you have a response to that?",
    "Q Let me just get some clarity.",
    "But our policy has not changed.",
    "Was that a breach of protocol?",
    "He will be tested again soon.",
    "Do those three weeks matter?",
    "It will be an outside event.",
    "Q — after recent hurricanes.",
    "They often provide us lists.",
    "People were not vaccinated.",
    "It just delays the process.",
    "That is what would happen.",
    "(Cross-talk by reporters.)",
    "Q She was a close contact.",
    "Thanks so much, everyone.",
    "It did not meet that bar.",
    "MS. PSAKI: Yep, go ahead.",
    "That’s our larger point.",
    "There’s a lot going on.",
    "Q I’m sorry, yesterday.",
    "How concerned are they?",
    "MS. PSAKI: Sure, sure.",
    "With that —\nQ Perfect.",
    "You may all know him.",
    "That — they were not.",
    "They are all boosted.",
    "That is a big factor.",
    "I have two questions.",
    "MS. PSAKI: Go ahead.",
    "Jen, final question.",
    "MS. PSAKI: Go ahead.",
    "It’s CDC guidelines.",
    "MS. PSAKI: Correct.",
    "He’s a fast writer.",
    "Q Thank you, Jen.",
    "MS. PSAKI: Sure.",
    "MS. PSAKI: Sure.",
    "I appreciate it.",
    "I appreciate it.",
    "MS. PSAKI: Sure.",
    "MS. PSAKI: Okay.",
    "MS. PSAKI: Sure.",
    "We welcome that.",
    "MS. PSAKI: Yeah.",
    "MS. PSAKI: Yeah.",
    "MS. PSAKI: Okay.",
    "MS. PSAKI: Yeah.",
    "MS. PSAKI: Okay.",
    "MS. PSAKI: Yeah.",
    "MS. PSAKI: Sure.",
    "MS. PSAKI: Yes.",
    "MS. PSAKI: Yes.",
    "MS. PSAKI: Yes.",
    "Is it underway?",
    "Thanks so much.",
    "Go ahead, Mara.",
    "Q Thanks, Jen.",
    "Q Thanks, Jen.",
    "MS. PSAKI: No.",
    "MS. PSAKI: No.",
    "Q Thanks, Jen.",
    "Q Thanks, Jen.",
    "Q Not at all?",
    "And one more.",
    "Let me check.",
    "3:19 P.M. EDT",
    "Q All right.",
    "That’s fine.",
    "We did not.",
    "(Laughter.)",
    "(Laughter.)",
    "(Laughter.)",
    "Q Hey, Jen.",
    "Q Exactly.",
    "Q Hi, Jen.",
    "Go ahead.",
    "Q Thanks.",
    "Q Thanks.",
    "Go ahead.",
    "Go ahead.",
    "Go ahead.",
    "Go ahead.",
    "Go ahead.",
    "Go ahead.",
    "Q Thanks.",
    "Go ahead.",
    "Go ahead.",
    "Correct?",
    "Q Okay.",
    "Q Okay.",
    "Thanks.",
    "Q Okay.",
    "Q Okay.",
    "Q Yeah.",
    "Q Yeah.",
    "Q Okay.",
    "Sorry.",
    "Q Yes.",
    "Right?",
    "Q Jen?",
    "Okay.",
    "Okay.",
    "Jen?",
    "Yes."
  ]
}