{
  "id": 8307,
  "mediaId": 2572,
  "date": "2022-04-07",
  "headline": "Bipartisan bill to extend Title 42 latest sign of moderate Dem opposition to Biden border move",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/04/GettyImages-1312682563.jpg",
  "link": "https://www.foxnews.com/politics/bipartisan-bill-title-42-dem-opposition-biden-border-move",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    0
  ],
  "sentences": [
    "OVERSIGHT REPUBLICANS PUSH FOR ANSWERS ON DHS PLANS TO HANDLE BORDER SURGE WHEN TITLE 42 LIFTS\nThe bill includes not only Republicans such as Sen. James Lankford, R-Okla., and Sen. John Cornyn, R-Texas, but also a number of Democrats: Sens Mark Kelly, D-Ariz., Kyrsten Sinema, D-Ariz., Jon Tester, D-Mont., Joe Manchin, D-W.Va., and Maggie Hassan, D-N.H.\nAll those Democrats have spoken out about the bill before.",
    "SEN TESTER BECOMES LATEST DEMOCRAT TO OPPOSE BIDEN MOVE TO END TITLE 42\nThe CDC announced last week that it will end the order on May 23, immediately sparking fears from both sides of the aisle, including within the Biden administration, that it will lead to a surge in migration at the border -- on top of the already massive numbers being encountered by Border Patrol each day.",
    "\"Arizona communities bear the brunt of the federal government’s failure at our border, so we’re stepping in and protecting border communities by ensuring the Administration works hand-in-hand with local leaders, law enforcement, and non-profits to put a comprehensive, workable plan in place before lifting Title 42, Sinema said.",
    "A bipartisan bill to extend Title 42, co-sponsored by five Senate Democrats, is the latest sign of opposition from moderate Democratic opposition to the Biden administration’s move to end the public health order amid fears it could lead to a surge in migrants at the border.",
    "Meanwhile, a $10 billion COVID-19 relief bill has stalled in the Senate after Republicans have united over a push for a vote on an amendment to bar the administration from ending Title 42 -- an amendment for which some Democrats would likely vote in favor.",
    "The order was implemented in March 2020 by the Centers for Disease Control (CDC) in response to the COVID-19 pandemic and has been used by both the Trump and Biden administration’s to quickly expel a majority of migrants at the border.",
    "(AP Photo/Eric Gay, File)\nThe legislation introduced on Thursday would extend Title 42 by an extra 60 days, and would require the Department of Homeland Security to submit a plan to deal with a post-Title 42 migrant influx.",
    "Tester this week said he is \"strongly opposed\" to the move, while Hassan said that ending the order \"will likely lead to a migrant surge that the administration does not appear to be ready for.\"",
    "Should all the Democrats who have spoken out against the move vote for the legislation, as well as all Republicans, it would get to 57 votes -- just shy of the 60 needed to break a filibuster.",
    "Apart from those sponsors, Sen. Raphael Warnock, D-Ga., reportedly said it is \"the wrong time\" to end the order, and Sen. Catherine Cortez Masto has also voiced her opposition to the move.",
    "\"The Biden administration was wrong to set an end date for Title 42 without a comprehensive plan in place,\" Kelly said in a statement accompanying Thursday’s legislation.",
    "But it marks the strongest instance of bipartisan opposition to the administration’s immigration policies to date, which has largely divided lawmakers down party lines.",
    "Manchin called the move to end Title 42 \"frightening.\"",
    "Both Democrats are in tight re-election races."
  ]
}