{
  "id": 8342,
  "mediaId": 8251,
  "date": "2022-04-07",
  "headline": "Kelly, Sinema, bipartisan senators introduce bill delaying end of pandemic border restrictions",
  "image": "https://media.12news.com/assets/KPNX/images/601274649/601274649_1140x641.jpg",
  "link": "https://www.12news.com/article/news/local/arizona/mark-kelly-kyrsten-sinema-and-bipartisan-senators-introduce-bill-delaying-end-of-title-42/75-70b9e141-2a8e-4308-b606-e69228984909",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "We introduced a bipartisan bill to force the Administration to work with border communities to put a comprehensive plan in place before they lift Title 42. https://t.co/mbjCqA3nMK\n— Kyrsten Sinema (@SenatorSinema) April 7, 2022\nThe senators’ bill prevents the Biden administration from ending Title 42 until at least 60 days after ending the COVID-19 national emergency declaration.",
    "Recently, Kelly and Sinema sent a letter to President Biden expressing concerns that an end to Title 42 enforcement without a plan in place could harm Arizona communities and migrants and put undue strain on the Department of Homeland Security, and nonprofits that are already near or at capacity due to the current border crisis.",
    "ARIZONA, USA — Arizona Senators Mark Kelly and Kyrsten Sinema along with a bipartisan group of senators introduced a bill Thursday that would push back the end of Title 42 by at least 60 days.",
    "After the end of the national emergency, the Department of Homeland Security would have thirty days to submit to Congress a plan to address the impacts of the post-Title 42 migrant influx.",
    "Read our statement: https://t.co/zf2btlqOq6\n— Senator Mark Kelly (@SenMarkKelly) April 1, 2022\nCatch up on the latest news and stories on the 12 News YouTube channel.",
    "Both senators emphasized how Arizona communities and migrants could be harmed if Title 42 end is not accompanied by proper planning, coordination, and resources.",
    "The order has resulted in the removal of more than 1.7 million undocumented immigrants at the Southwest border over the last two years.",
    "It’s unacceptable to end Title 42 without first implementing a plan to ensure a secure, orderly, and humane process at the border.",
    "In March, Kelly and Sinema secured federal funding to help Arizona manage the current migrant crisis and improve border security.",
    "Title 42 is a Trump-era rule that requires the expulsion of undocumented immigrants to prevent the spread of COVID-19.",
    "Ending Title 42 without a firm, workable plan to protect AZ communities and migrants is a mistake.",
    "Homeland Security to discuss the administration’s Title 42 contingency plans.",
    "Last week, Senators Kelly and Sinema met with U.S.",
    "Subscribe today."
  ]
}