{
  "id": 8396,
  "mediaId": 2874,
  "date": "2022-04-06",
  "headline": "Democratic U.S. Senate candidate Sarah Godlewski issues 'Cut Costs Plan,' calls for suspension of federal gas tax",
  "image": "https://www.gannett-cdn.com/presto/2022/02/02/PMJS/a5029251-e341-4259-9ae1-d772ad986a7c-godlewski_sarah.jpg?crop=5228,2941,x287,y618&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/2022/04/06/godlewski-calls-for-federal-gas-tax-suspension-in-cut-costs-plan/9463908002/",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Glauber",
  "authorUrl": "https://www.jsonline.com/staff/2646086001/bill-glauber/",
  "termIds": [
    4971,
    2043,
    1848,
    392,
    201,
    1489
  ],
  "sentences": [
    "Godlewski said her overall plan on cutting costs \"offers straightforward solutions that would help immediately lower costs for working families, address the widespread supply chain issues our country is facing, and crack down on corporate greed because working Wisconsinites deserve a fair shake from Washington, not business as usual.”\nShe laid out a broad program that included tough sanctions for alleged price gouging and a push to make housing more affordable.",
    "Asked about the potential of a suspension of the state gas tax, which is pegged at 32.9 cents a gallon, Godlewski said she believed: \"that the federal government needs to lead on this issue and do everything they can to lower the price at the pump from temporarily suspending the gas tax to reducing our dependency on foreign oil to investing in renewable energy for the future.\"",
    "In her policy paper, Godlewski called for making more products in America to untangle supply chain issues, an increase in tax incentives and other programs to make housing more affordable, and a continued push to make the child tax credit permanent.",
    "Godlewski's plan also called for requiring \"corporations that receive significant federal investments not engage in stock buybacks, in sending jobs offshore, or in paying executives more than 50 times what their median worker earns.\"",
    "\"In order to temporarily suspend the state gas tax, the GOP leaders would need to end their nine-month vacation and bring the Legislature back in to act and we know that’s never going to happen,\" she said.",
    "Tony Evers, facing re-election in the fall, joined five other Democratic governors in a joint letter to congressional leaders to call for suspending the federal gas tax through 2022.",
    "The paper said Godlewski \"will support criminal charges for corporate executives who engage in price-fixing and other forms of criminally anti-competitive conduct.\"",
    "The gas tax holiday idea has gained traction among Democrats, especially with midterm elections approaching and inflation reaching its highest level in 40 years.",
    "Lasry called for a six-month temporary suspension of the federal gas tax in December, claiming, “Wisconsinites need relief from high gas prices now.\"",
    "With inflation rising, two top Democratic contenders in the race for U.S. Senate are floating a way to modestly cut soaring prices at the gas pump.",
    "Wednesday, state Treasurer Sarah Godlewski made the push to suspend the 18.4 cents per gallon tax as part of what she called her \"Cut Costs Plan.\"",
    "In February, the consumer price index increased 7.9% over the past 12 months, according to the Labor Department's Bureau of Labor Statistics.",
    "He called the proposal \"a commonsense measure that can bring immediate relief to working families across Wisconsin.”\nLast month, Gov.",
    "Senators Mark Kelly of Arizona and Maggie Hassan of New Hampshire to suspend the federal gas tax for the remainder of the year.",
    "In a recent ad, Republican U.S. Sen. Ron Johnson pummeled Democrats over inflation, calling it their \"tax on the middle class.\"",
    "The gas tax is the key source of revenue for the Highway Trust Fund, which provides federal cash for transportation projects.",
    "The plan also said she was poised to attack price gouging and called for \"increasing federal antitrust enforcement.\"",
    "Milwaukee Bucks executive Alex Lasry called for suspending the gas tax back in December.",
    "\"I'm concerned with rising prices, just like you,\" Johnson said in the 30-second spot.",
    "There's a significant drawback to the proposals, however.",
    "Godlewski backed a bill pushed by Democratic U.S.",
    "They're calling for a federal gas tax holiday."
  ]
}