{
  "id": 8415,
  "mediaId": 8475,
  "date": "2022-04-05",
  "headline": "Arizona joins red states suing to stop Biden admin from ending Title 42 asylum policy",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/040522_mark_brnovich.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/040522_title_42_lawsuit/arizona-joins-red-states-suing-stop-biden-admin-from-ending-title-42-asylum-policy/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael McDaniel",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "From my numerous visits to the southern border and conversations with Arizona’s law enforcement, community leaders, mayors, and nonprofits, it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities.”\nAdditionally, the suit claims the administration illegally violated “notice and comment” processes in the Administrative Procedure Act requiring federal officials to allow at least 30 days for the public to submit written data, views or arguments regarding a proposed rule change.",
    "“After considering current public health conditions and an increased availability of tools to fight COVID-19 (such as highly effective vaccines and therapeutics), the CDC director has determined that an order suspending the right to introduce migrants into the United States is no longer necessary,” the CDC said in a press release Friday.",
    "Attorneys general of Arizona, Louisiana and Missouri sued the Biden administration Monday over the decision to rescind Title 42, a Trump-era COVID policy that allows federal officials to turn away asylum seekers under the enforcement of public health measures.",
    "“This suit challenges an imminent, man-made, self-inflicted calamity: the abrupt elimination of the only safety valve preventing this administration’s disastrous border policies from devolving into an unmitigated catastrophe,” the AGs say in their complaint.",
    "The three Republican attorneys general filed the suit Sunday in the Western District of Louisiana after the U.S. Centers for Disease Control and Prevention and the Biden administration announced Friday that they would lift the order starting May 23.",
    "“Arizona bears the substantial costs of incarcerating unauthorized migrants (amounting to tens of millions of dollars each year) as well as increased health care costs for migrants infected with COVID-19 and other communicable diseases.",
    "Suspension of the order issued under the Trump administration in 2020 could only occur when the CDC determined that “further introduction” of Covid-19 into the U.S. was no longer a “serious danger,” according to the lawsuit.",
    "“Their attempt to rescind Title 42 will lead to drastic consequences on our southern border, and right now it’s essentially on fire, and this will be like throwing gasoline on the fire,” Brnovich told Fox News.",
    "The federal lawsuit references bipartisan criticism of the Biden administration for not having a plan to deal with a projected influx of migrants amid economic instability, health concerns and rising crime.",
    "The number of fentanyl pills seized in Arizona has skyrocketed over the last year.”\nBrnovich, who is running this year for U.S. Senate to replace Kelly, appeared on Fox News to announce the action Monday.",
    "Additionally, the lawsuit references a drastic increase in crime costs and fentanyl seizures across the border states as motivation to keep Title 42 in place.",
    "Most notable is pushback by the Democratic U.S. senators from Arizona, Mark Kelly and Kyrsten Sinema, which is cited in the lawsuit although they go unnamed.",
    "“So, we want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration.",
    "“It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly, and humane process at the border.",
    "With various COVID-19 mitigation mandates still in place, like masks in schools and for travel, the states argue no valid pretext is met.",
    "“As a border state, Arizona is directly affected by rescinding Title 42 in several ways,” Brnovich said in a statement.",
    "Additionally, Arizona’s border is at major risk for increased drug trafficking and cartel activity.",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "Join Bruce hermes, Ronnie Maestas-Condos, and Barbara Tellman and contribute today!",
    "He claimed the federal government must protect the states and is not doing it.",
    "“This is the wrong decision,” Kelly said in a press release Friday.",
    "And they have done a lot of dumb things.”\n- 30 -"
  ]
}