{
  "id": 8447,
  "mediaId": 2589,
  "date": "2022-04-07",
  "headline": "Sinema, Lankford draft a bill to block Biden from lifting Title 42",
  "image": "https://media.townhall.com/townhall/reu/o/2021/155/c4ac1214-b49c-4d13-bf79-cf4185d79805-1110x740.jpg",
  "link": "https://hotair.com/karen-townsend/2022/04/07/sinema-lankford-draft-a-bill-to-block-biden-from-lifting-title-42-n460656",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Townsend",
  "authorUrl": "https://hotair.com/author/karen-townsend",
  "termIds": [
    0
  ],
  "sentences": [
    "The bill asks that the Biden administration “delay ending Title 42 until 60 days after the Surgeon General submits written notification to Congress formally rescinding the COVID-19 public health emergency and the national emergency.” The bill states “during that 60-day window, and no later than 30 days after the written notification is provided, the Biden administration must submit a plan to Congress addressing any possible influx of migrants.”\nBoth Sinema and Lankford point to the obvious – the Biden administration is not prepared.",
    "“Is it the open-borders part of the Biden administration … or is it the portion of the Biden administration that says, ‘This gives us a good excuse to say those crazy folks in Congress compelled us to do this … and this becomes an excuse for them to not cause this kind of chaos in the border.",
    "If we are required to continue to mask up on public transportation, including planes equipped with updated air filtration systems, and many school children are still required to wear masks, though they pose the lowest threat of spreading the virus, why end Title 42 in May?",
    "A bipartisan group of five Democrats and six Republicans came together as Republican Senator James Lankford (Oklahoma) and Democrat Senator Kyrsten Sinema (Arizona), drafted a proposal that stops the lifting of Title 42 without a detailed plan in place.",
    "“It just doesn’t seem at all workable that this, that whatever plan they’re working on right now can be ready to implement in a way that is both safe for our border communities and respects the humanitarian crisis that is coming,” Sinema told Axios.",
    "Once DHS started bussing and flying illegal migrants around the country, though, suddenly every state is a border state dealing with secret flights in the middle of the night and buses dropping off migrants into communities.",
    "However, the previous president succeeded in what Biden is now catastrophically failing at – protecting the southern border and the sovereignty of the United States, a top requirement for his job.",
    "“At the same time the administration is asking for $10 billion because COVID is a risk, they’re saying it’s not a risk on the border and we should open the border up,” Lankford told Axios.",
    "Of the Democrat co-sponsors, Kelly and Senator Maggie Hassan (New Hampshire) face tough re-elections, with Hassan often labeled as the most vulnerable Democrat running for re-election.",
    "She isn’t up for re-election in November but her fellow senator from Arizona, Mark Kelly is and Arizona is a border state experiencing first hand the Biden border crisis.",
    "Make no mistake about it, the reason this is a bipartisan effort is because Democrats see the writing on the wall and know they are about to get shellacked in November.",
    "The problem with Biden’s sweeping announcement about ending Title 42 is that he didn’t offer any proof that there is a plan in place to handle what will happen next.",
    "Biden signed executive actions to end the successful policies and agreements made by the previous administration as a way to prove he is not like the bad Orange Man.",
    "Joe Manchin gets most of the attention as a Democrat who uses common sense and is willing to work with Republicans but Sinema quietly goes about doing the same.",
    "Sinema said she met with Secretary Mayorkas last week and on Wednesday but has determined that there is not an adequate plan for what is about to happen.",
    "Senator Kyrsten Sinema is a somewhat moderate Democrat who has stepped forward more than once to bring both sides of the aisle together.",
    "When the Biden administration announced that Title 42 would end on May 23, Kelly joined in with other Democrats to voice opposition.",
    "“I do think it has a chance of passing, but it’s going to depend on which half of the Biden team wins out,” Lankford said.",
    "Illegal immigration and border security are rising to the top of the list of issues that voters are concerned about.",
    "Republican co-sponsors who joined Lankford include Senate Minority Whip John Thune (South Dakota), as well as Sens.",
    "John Cornyn (Texas), Thom Tillis (North Carolina), Shelley Moore Capito (West Virginia) and Rob Portman (Ohio).",
    "This should not be a surprise to anyone who has paid even a minimum of attention to the Biden border crisis.",
    "'”\nThe bill will be introduced so that senators can see the text but there is not a standalone vote planned.",
    "Sinema is the chairwoman of the Senate’s Border Management subcommittee and Lankford is the ranking member.",
    "“It is evident that the current preparations and plans for the end of Title 42 aren’t adequate,” she said.",
    "Lifting Title 42 now is a political decision, not one made in the best interests of public health policy.",
    "Title 42 is in place at the recommendation of the CDC and has been since the start of the pandemic.",
    "“It seems highly unlikely it will be adequate by May 23, because of poor logistics,” Sinema said.",
    "We’ll see if he backs that up by casting a vote in favor of demanding a real plan going forward.",
    "The Democrats in the bipartisan group are not necessarily moderates but vulnerable in November.",
    "The neglect shown by this administration at the southern border is deliberate and intentional.",
    "Manchin and Jon Tester (Montana) are the other Democrats who joined with Sinema on this bill.",
    "“It’s either a risk or it’s not a risk.”\nBiden can’t have it both ways, though he is trying.",
    "The plan is to include it as a part of a larger amendment to the $10B COVID-19 funding bill.",
    "The Public Health and Borders Security Act of 2022 will be introduced in the Senate today.",
    "For a long time, the Biden border crisis was seen as a Texas or an Arizona problem.",
    "The Biden border crisis is about to go from very bad to horrific in short order.",
    "Portman isn’t running for re-election, he already announced his retirement.",
    "I’ll be watching to see how Democrats like Senator Warnock (Georgia) vote.",
    "He points to the hypocrisy of Biden’s pandemic mandates still in place.",
    "He is one of the most progressive senators and up for re-election.",
    "It’s more political theatre coming from a failing administration.",
    "We’ll see what kind of support this bill receives in the Senate.",
    "He was savvy enough, though, to criticize lifting Title 42.",
    "Lankford points out that it is a part of “COVID policy”.",
    "There is no other explanation.",
    "Biden is not up to his job.",
    "He’s in a tough race."
  ]
}