{
  "id": 8476,
  "mediaId": 2741,
  "date": "2022-04-07",
  "headline": "Texas: We're Going to Bus Undocumented Migrants to D.C., Florida: Hold My Beer",
  "image": "https://media.vanityfair.com/photos/6080a3f2783ff7d44fa8a511/16:9/w_1280,c_limit/rondesantis.jpg",
  "link": "https://www.vanityfair.com/news/2022/04/ron-desantis-greg-abbott-title-42-immigration",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Lutz",
  "authorUrl": "https://www.vanityfair.com/contributor/eric-lutz",
  "termIds": [
    2765,
    2174,
    1679,
    4905,
    5078,
    6107,
    6159,
    6653
  ],
  "sentences": [
    "It’s unclear if either of those efforts will succeed in preventing the termination of Title 42, but they would seem to stand a better chance than the stunts Abbott and DeSantis advertised Wednesday; as Kate Huddleston, a staff attorney at the ACLU of Texas, said in a statement to the Texas Tribune, the “forcible busing of migrants across the country would be outrageous and blatantly unconstitutional.” Even some of Abbott’s fellow conservatives called the plan little more than a “gimmick.” Then again, gimmicks can get you pretty far in the party of Trump — and for Abbott, seeking to shore up support ahead of his reelection contest in November, and DeSantis, who fancies himself heir to the MAGA throne, there’s potential profit in these kinds of antics.",
    "“To help local officials whose communities are being overwhelmed by hordes of illegal immigrants who are being dropped off by the administration,” Abbott said in a press conference in Weslasco, near the U.S. border with Mexico, “Texas is providing charter buses to send these illegal immigrants who have been dropped off by the Biden administration to Washington, D.C.”\nThough he presented the plan as something “no state has done in American history to secure our border,” it doesn’t quite go as far as he claimed; as the Texas Tribune reported, the program as proposed would be voluntary for the migrants, and they could only get on the buses or planes to D.C. after they’d been processed by the Department of Homeland Security.",
    "“Yet a long-term solution can only come from comprehensive legislation that brings lasting reform to a fundamentally broken system.”\nThe announcement was immediately met with a suit from the GOP-led states of Louisiana, Arizona, and Missouri, and a group of senators led by Oklahoma Republican James Lankford and conservative Arizona Democrat Kyrsten Sinema are introducing legislation to stop the administration from terminating Title 42 without detailing a plan to address a possible border surge.",
    "Then Their Colleagues Were Killed in Ukraine\n— The Life and Confessions of Mob Chef David Ruggerio\n— Kremlin Keeps Blurring Its Red Line Around Nuclear War\n— Calls for Recusals, Resignations, and Even Impeachment: Democrats Escalate Ethics Campaign Around Clarence Thomas\n— Two Ukrainian AP Journalists Capture the Most Devastating Moments of War\n— Trump: If I Was President I’d Threaten to Drop a Nuclear Bomb on Russia\n— What Will Dems Do If Biden Doesn’t Run?",
    "“If Abbott focused on solutions instead of stunts,” Democrat Beto O’Rourke, who is challenging Abbott for the governor’s mansion this fall, said in a statement, “then Texas could have made some real progress on the issue over the last seven years.”\nNot to be outdone, though, DeSantis teased his own plan later Wednesday suggesting that he, too, could bus out undocumented immigrants — to Biden’s home state of Delaware.",
    "(Other Democrats joining Sinema in support of the bill are her fellow Arizonan Mark Kelly, a vulnerable Democrat facing reelection this year; Maggie Hassan of New Hampshire, also in a tough re-election fight; Montana’s Jon Tester; and Sinema’s fellow conservative, Joe Manchin of West Virginia.)",
    "Dating back to the World War II era, the code gives the federal government the “power to prohibit, in whole or in part, the introduction of persons and property” from certain countries during a public health crisis if there is “serious danger of the introduction of such disease” into the U.S.",
    "“If Biden is dumping people…we now have money where we can reroute them to sanctuary states like Delaware.”\n“We’re gonna do that,” DeSantis continued, “to make sure we’re keeping people safe here.”\nDonald Trump invoked Title 42 at the onset of the coronavirus pandemic.",
    "— Orgies, Beheadings, Jewish Space Lasers: Everything Kevin McCarthy Has Had to “Speak” to Republican Lawmakers About\n— The Truth Behind Republicans’ Vile Questioning of Ketanji Brown Jackson\n— From the Archive: Molly Bloom’s House of Cards\n— Not a subscriber?",
    "Texas: We're Going to Bus Undocumented Migrants to D.C., Florida: Hold My Beer\nTexas Governor Greg Abbott and Florida Governor Ron DeSantis appear locked in a competition: Who can best channel the latest free-floating right-wing grievance into state policy?",
    "The Department of Homeland Security acknowledged it is preparing for a potential increase in undocumented arrivals, but said that the issue would be best addressed through systemic reform rather than a temporary Title 42 order.",
    "“The Biden-Harris Administration is committed to pursuing every avenue within our authority to secure our borders, enforce our laws, and stay true to our values,” DHS head Alejandro Mayorkas said in a statement.",
    "On Wednesday, Abbott announced plans to bus undocumented immigrants to the steps of the United States Capitol as a kind of protest against the “Biden border disaster,” as he described it.",
    "Now, with Joe Biden announcing plans to lift his predecessor’s pandemic-era border restrictions, a policy known as Title 42, the GOP governors have turned to immigration.",
    "While Trump implemented it in March 2020, as COVID-19 upended life across the globe, it was widely criticized by both immigration groups and public health officials.",
    "The rules of this game are simple: Every time one of these governors releases a salvo into the nation’s culture wars, the other has to match it or exceed it.",
    "Voting rights, the pandemic, reproductive rights — on issue after issue, these two have raced to put forth the most reactionary policy possible.",
    "“What we’re doing in Florida is saying, ‘We’re not gonna let the recklessness of those policies impact our state,’” DeSantis said.",
    "“It is evident that the current preparations and plans for the end of Title 42 aren’t adequate,” Sinema told Axios Thursday.",
    "The Biden administration left the rule in place, but had been under increasing pressure from critics to revoke it.",
    "That will mean a return to normal border protocols, which, as CNN reported, could mean an influx at the border.",
    "The Centers for Disease Control and Prevention announced last week that the order would end May 23.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "Still, Abbott’s plot was immediately denounced by immigration advocates.",
    "?Fox News Hosts Entertained Putin-Friendly Talking Points.",
    "It looks like we're experiencing playback issues.",
    "Our bad!",
    "— ?"
  ]
}