{
  "id": 8506,
  "mediaId": 2532,
  "date": "2022-04-07",
  "headline": "Moderate Democrats join GOP senators to back bill to delay end of Title 42 border expulsions",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/04/07/30fed2ae-13c9-44dc-895e-0a842ec710bb/thumbnail/1200x630/5a435a8aae3f01f3d78148da1caee124/gettyimages-1234303379.jpg",
  "link": "https://www.cbsnews.com/news/immigration-title-42-senate-bill-border-expulsions/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camilo Montoya-Galvez",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Immigration\n More\n Supreme Court hears case over \"Remain in Mexico\" asylum rule\n Judge to block U.S. border officials from winding down Title 42 policy\n U.S. launches online portal for sponsoring Ukrainian refugees\n Transcript: CBS News interviews DHS Secretary Alejandro Mayorkas\n Mayorkas says U.S. is preparing for \"significant\" border challenges\n More\nIn:\nU.S. Customs and Border Protection\n Camilo Montoya-Galvez\nCamilo Montoya-Galvez is the immigration reporter at CBS News.",
    "In an interview with \"CBS News Evening News\" anchor and managing editor Norah O' Donnell on Wednesday, Homeland Security Secretary Alejandro Mayorkas said the U.S. could \"very well\" see a spike in border arrivals, but noted his department is preparing for different contingencies, including by surging resources and expanding transportation capabilities.",
    "SANDY HUFFAKER/AFP via Getty Images\nThe Democratic support for Thursday's bill illustrates the intra-party dispute among Democrats triggered by the CDC's decision to wind down the Title 42 expulsions, which is already being used by Republican campaigns to attack President Biden and vulnerable Democrats ahead of the November midterm elections.",
    "Since it was enacted in 2020 as a temporary pandemic response measure by the Trump administration, Title 42 has allowed U.S. border officials to summarily expel migrants to Mexico or their native countries, bypassing laws that require the government to interview asylum-seekers to ensure they won't face harm if deported.",
    "While some moderates have expressed skepticism about Title 42's end, many Democratic lawmakers, including Senate Majority Leader Chuck Schumer, have been calling for the policy's termination for months, saying the expulsions were part of a Trump administration effort to gut the U.S. asylum system.",
    "The proposal, co-sponsored by six Republican senators and five moderate Democratic senators, would prevent the Centers for Disease Control and Prevention (CDC) from following through with an order published last week that will stop authorizing the border rule, known as Title 42, in late May.",
    "DHS officials have said they are mobilizing additional personnel, including Border Patrol agents; securing more buses and aircraft to transport migrant families; and erecting new migrant processing facilities along the southern border in anticipation of the expected increase in migration.",
    "During that 60-day timeframe, the CDC would be required to consult with the Department of Homeland Security (DHS), which oversees border agents, to submit a plan to Congress about how the government would address a potential spike in migrant arrivals once Title 42 is lifted.",
    "CDC Director Rochelle Walensky said the expulsions were no longer necessary because of improving pandemic conditions, including the drop in coronavirus cases since the Omicron surge this winter and increased vaccination rates in the U.S. and migrants' native countries.",
    "A group of Democratic senators on Thursday joined Republican lawmakers in introducing a measure that would temporarily block the Biden administration's plan to end pandemic-related restrictions that allow border authorities to quickly expel migrants.",
    "\"If we do not have treatments, if we do not have the medicine people need, Americans will die from COVID whether they support or oppose the administration on immigration, or child care, or environmental rules,\" the White House official told CBS News.",
    "Like their Republican colleagues, Democratic critics of the Title 42 announcement have said DHS is not ready to respond to the expected sharp increase in border arrivals that officials are preparing for once the expulsions stop.",
    "Other Democrats facing reelection fights have criticized the planned Title 42 rescission, including Senators Catherine Cortez Masto of Nevada and Raphael Warnock of Georgia, although they did not co-sponsor Thursday's bill.",
    "But the measure introduced Thursday would require the administration to first end the national COVID-19 public health emergency declaration and then notify Congress about a planned termination of Title 42.",
    "A White House official said Congress should not delay passage of the coronavirus relief package by trying to add \"unrelated issues,\" noting the funding is \"needed right now to protect the American people.\"",
    "Kyrsten Sinema and Mark Kelly of Arizona; Maggie Hassan of New Hampshire; Jon Tester of Montana; and Joe Manchin of West Virginia co-sponsored the bill, alongside Republican Sens.",
    "If that plan is not submitted within 30 days of the original notification, any effort to end Title 42 would need to be delayed by 30 days after the plan is sent to Congress.",
    "James Lankford of Oklahoma; John Thune of South Dakota; John Cornyn of Texas; Thom Tillis of North Carolina; Shelley Moore Capito of West Virginia and Rob Portman of Ohio.",
    "On Wednesday, Sen. Bob Menendez, a Democrat from New Jersey who chairs the Senate Foreign Relations Committee, posted a \"reminder\" on Twitter regarding U.S. border policy.",
    "\"Responsible stewardship of our border, and honoring our moral and legal obligations to treat immigrants and refugees with dignity, are not mutually exclusive,\" he wrote.",
    "The measure is expected to be proposed as an amendment to the latest COVID-19 relief package that Congress is debating, according to a person familiar with the plan.",
    "But after judicial setbacks and political pressure from liberal Democrats, the CDC announced last week it would stop authorizing the migrant expulsions on May 23.",
    "\"We need a secure, orderly, and humane response at our southern border and our bipartisan legislation holds the Biden administration accountable to that.\"",
    "Customs and Border Patrol agents apprehend a group of Brazilian migrants who illegally crossed the border in Otay Mesa, California, on August 13, 2021.",
    "For over a year, the Biden administration said the expulsions were needed to contain the spread of COVID-19 inside border processing facilities.",
    "\"What distinguishes us from the past is the fact that we will not implement policies of cruelty that disregard our asylum laws,\" Mayorkas said.",
    "\"The Biden administration was wrong to set an end date for Title 42 without a comprehensive plan in place,\" Kelly said in a statement Thursday.",
    "After such a notification is made, the CDC would have to wait at least 60 days before rescinding Title 42.",
    "Two of the bill's co-sponsors, Kelly and Hassan, are up for reelection in swing states.",
    "Axios first reported the details of the bill Wednesday evening.",
    "Based in Washington, he covers immigration policy and politics.",
    "\"We are rebuilding a system that was entirely dismantled.\"",
    "\"We can, and MUST, do both.\"",
    "Democratic Sens.",
    "Twitter"
  ]
}