{
  "id": 8665,
  "mediaId": 6406,
  "date": "2022-04-06",
  "headline": "Biden Ends Title 42, Launching Dems Into Disarray",
  "image": "https://americarisingpac.org/wp-content/uploads/2022/04/shutterstock_1973414822.jpg",
  "link": "https://americarisingpac.org/biden-ends-title-42-launching-dems-into-disarray/",
  "mediaOutlet": "americarisingpac.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Most of the vulnerable Senate Democrats up for election this year, such as MAGGIE HASSAN (N.H.), RAPHAEL WARNOCK (Ga.) and MARK KELLY (Ariz.), have leveled stinging criticism at the Biden administration for rescinding the policy without a detailed plan to grapple with the increase in migrants.",
    "CNN: Republicans are confident that hammering Democrats over the border will not only energize their base, but also resonate with moderate and independent voters — especially since they have linked border security to the fentanyl crisis that has impacted communities all around the country.",
    "This is a national security issue that’s gonna further get worse as time goes on this summer,” said Rep. John Katko of New York, the top Republican on the House Homeland Security Committee.",
    "Republicans — who have internal polling that shows the border is “a salient issue in battleground districts” — plan to make the border crisis a major issue in the 2022 midterm elections.",
    "Progressives have just as forcefully pushed Biden from the opposite direction, and if the Covid bill is sent to the House with language reinstating Title 42, it is unlikely to pass.",
    "In the Senate, the GOP is tying Title 42 to Covid-related funds and House Republicans plan to repeatedly ask for unanimous consent to keep the border-enforcement measure in place.",
    "The Biden-Harris administration plans to revoke Title 42, a Trump-era policy that allowed the administration to deny entry to the country without legal proceedings, on May 23.",
    "Additionally, three Republican-led states — Arizona, Louisiana and Missouri — are suing the Biden-Harris administration over their plans to rescind the rule.",
    "Vulnerable Democrats, desperate to avoid the toxic politics of the border crisis, are seeking to distance themselves from Joe Biden’s immigration policies.",
    "Bottom Line: The Biden Border Crisis is likely to get much worse, and vulnerable Democrats could pay the price in November’s elections.",
    "Customs and Border Patrol officials say that this could lead to a massive surge in border crossings — up to 18,000 a day.",
    "However, the Biden-Harris administration and their progressive allies in Congress are refusing to back down.",
    "Politico: There is a good chance that if a vote on the Title 42 amendment were allowed, it would pass.",
    "“It’s far more than just aliens coming across, it’s far more than just the drugs coming across.",
    "Even if it somehow did, it’s hard to see Biden signing it into law.",
    "JOE MANCHIN (W.Va.), KYRSTEN SINEMA (Ariz.) and JON TESTER (Mont.",
    "Moderates who aren’t in tough races, such as Sens.",
    "), have joined them.",
    "Share this article:"
  ]
}