{
  "id": 8700,
  "mediaId": 2745,
  "date": "2022-04-05",
  "headline": "Immigration snag threatens to stall $10 billion coronavirus package",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/F2UUUNVVCMI6ZA2YECVBMNK7WQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/04/05/congress-covid-aid-immigration/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“It should remain independent of the urgently needed funding that we talked about today to sustain our covid response here domestically and our global response.”\nThune said it would be hard to foresee a scenario in which Senate Republicans agree to proceed with the bill without an understanding that there would be votes on amendments: “If we’re going to have this conversation [about coronavirus aid] then we ought to have a process that allows us to get some amendment votes, predominantly on Title 42,” he told reporters.",
    "Otherwise I don’t have a problem keeping it in place.”\nThe clash has put Senate Majority Leader Charles E. Schumer (D-N.Y.) in a bind as he moves to check off a long to-do list of legislative items this week, including passing the coronavirus aid package, confirming Judge Ketanji Brown Jackson as a Supreme Court justice and potentially passing new sanctions on Russia.",
    "But the agreement ran into a political buzz saw Tuesday, with Republicans and a handful of Democrats complaining about mixed messages from the Biden administration as it seeks to remove a pandemic mitigation measure at the border while simultaneously demanding billions of dollars to address the continuing spread of the virus.",
    "), the minority whip, said there was “pretty strong” desire in the GOP ranks to reverse the border decision, which would lift a public health order known as Title 42 that, for the past two years, has overridden asylum laws and allowed the federal government to summarily remove migrants amid the pandemic.",
    "The funding was initially meant to be included in a sweeping government-wide appropriations bill that passed on a bipartisan basis last month, but it was removed after some House Democrats balked at spending offsets that threatened to rescind some unrelated federal funding from some states.",
    "“That’s just not who we are as a United States, and we should be approaching people that are escaping the most dangerous parts of the world in a humane way.”\nThe $10 billion deal announced this week is a far cry from the $22.5 billion the White House had initially sought.",
    "Such an amendment could be adopted with votes from lawmakers of both parties, which could upend a carefully negotiated compromise to continue funding the country’s domestic pandemic response by, among other things, restocking supplies of vaccines and therapeutic drugs.",
    "If the amendment were adopted and the underlying coronavirus bill passed, it could be dead on arrival in the Democratic-led House, where Speaker Nancy Pelosi (D-Calif.) would be under sharp pressure from the left wing of her caucus not to bring it up for a vote.",
    "While many liberals are eager to undo the pandemic policy, first instituted under President Donald Trump, and return to the regular asylum system, senators who represent border states and some elsewhere who are facing reelection this year are much more wary.",
    "On the Hill, some House Democrats have threatened to withhold their support for a package that lacks global funding, and Schumer said he would pursue a separate package for the international response “later this spring.”",
    "Homeland security officials have warned that lifting the order, set to happen in late May, could badly exacerbate a surge of migrants to the southern border, where they would be able to seek asylum in the United States.",
    "Thune said Republicans believe an amendment to the coronavirus relief bill could be adopted with a 51-vote margin, because the Senate parliamentarian will most likely judge it to be germane to the underlying bill.",
    "“We need a clean covid relief package, and if we’re going to get into amendments, then I might have a few of my own,” said Sen. Robert Menendez (D-N.J.), a leader of the cadre pushing for the lifting of Title 42.",
    "At least half of the new dollars would be used to develop and purchase therapeutics, with roughly $750 million for research and clinical trials to fight future variants and build vaccine manufacturing capacity.",
    "But for the bill to clear the Senate that quickly, all 100 senators would have to agree to proceed, and multiple Republicans said Tuesday that they would seek a vote on the border restrictions as a condition.",
    "“We’ll have to have a discussion about a reasonable amendment process,” Senate Minority Leader Mitch McConnell (R-Ky.) told reporters Tuesday, specifically mentioning the border provision as a prerequisite.",
    "A bipartisan backlash to the Biden administration’s decision to relax pandemic restrictions at the U.S. border has thrown swift passage of a $10 billion coronavirus relief package in doubt on Capitol Hill.",
    "Jackson’s nomination is expected to tie up the Senate floor at least through Thursday, complicating any effort to muscle through the $10 billion coronavirus deal before the end of the week.",
    "“It should not be held hostage for an extraneous issue.”\nWhite House officials also stressed that the debate over Title 42 should be kept separate from the coronavirus funding package.",
    "… It’s always been a decision made by the scientists and public health experts at the CDC,” White House coronavirus coordinator Jeff Zients told reporters at a briefing Tuesday.",
    "The Biden administration had already started winding down a program to reimburse health-care providers for coronavirus tests, treatments and vaccinations to uninsured Americans.",
    "The move sparked warnings from health experts who argued that the dollars were needed to help stymie new variants from emerging overseas and spreading to the United States.",
    "Democrats who have pushed Biden for months to lift Title 42 reacted sharply to the possibility that the border issue could be commingled with the coronavirus relief money.",
    "“Basically, Title 42 should be in place until we have border security, period,” said Manchin, who also added that he was “not going to hold covid relief up” on the issue.",
    "Underscoring the impasse, a procedural vote to advance the $10 billion package failed Tuesday on a 52-to-47 vote, with GOP senators protesting the lack of amendments.",
    "In recent weeks, federal officials had ramped up their calls for more dollars, sending letters to Capitol Hill and dispatching top aides to lobby for the funds.",
    "Sen. Ben Ray Luján (D-N.M.) would not comment on whether he would vote for a coronavirus funding bill that had an amendment attached preserving Title 42.",
    "On Monday, Senate negotiators announced a $10 billion bipartisan deal that repurposes previously appropriated coronavirus relief funds.",
    "Democrats are pressing to approve the new funding by the end of the week, when the House and Senate are set to begin a two-week recess.",
    "“There are many policies that were put in place by President Trump that were abused, that treated people inhumanely,” he said.",
    "Tuesday’s ultimatum represents another bout of whiplash for coronavirus aid negotiations that have been underway for months.",
    "“The bottom line is, this is a bipartisan agreement that does important good for the American people,” Schumer said Tuesday.",
    "Lawmakers from both parties have publicly expressed concern that federal agencies are unprepared for the probable influx.",
    "The White House had sought roughly $5 billion in international aid, but lawmakers could not agree on a way to pay for it.",
    "Also raising hackles among Democrats is that the bipartisan deal cut funding to help vaccinate the rest of the world.",
    "(Non-germane amendments are typically considered at a 60-vote margin and are thus less likely to pass.)",
    "Holding a vote on keeping Title 42 in place promises to be politically treacherous for Democrats.",
    "The federal government also cut states’ allotments for a critical covid-19 treatment.",
    "Among the Democrats who have aired concerns about lifting Title 42 are Sens.",
    "“What I’m waiting for is a plan,” said Sen. Jon Tester (D-Mont.).",
    "“If they’ve got a plan then I would consider [lifting Title 42].",
    "But he said it was time for the border policy to be lifted.",
    "Mark Kelly and Kyrsten Sinema of Arizona, as well as Sens.",
    "Raphael G. Warnock (Ga.) and Joe Manchin III (W.Va.).",
    "“Title 42 is a public health authority.",
    "Sen. John Thune (R-S.D."
  ]
}