{
  "id": 8779,
  "mediaId": 2631,
  "date": "2022-04-06",
  "headline": "Clash over immigration stalls Covid relief funds in Congress, potentially for weeks",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220406-border-asylum-ew-1058p-32e5be.jpg",
  "link": "https://www.nbcnews.com/politics/congress/clash-immigration-stalls-covid-relief-funds-congress-potentially-weeks-rcna23212",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Asylum-seeking migrants are detained by a U.S. Border Patrol agent after crossing the Rio Bravo river to turn themselves in to request asylum in El Paso, Texas, as seen from Ciudad Juarez, Mexico on March 30, 2022.Jose Luis Gonzalez / Reuters\nDemocrats haven't given up on passing the bill before they adjourn for recess, but would need Republican consent to move it.",
    "Exacerbating President Joe Biden's headache is the fact that a group of centrist and politically vulnerable Democrats joined Republicans in calling on him to reinstate the Trump-era border policy (although they haven't insisted on attaching it to the Covid bill).",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nRomney, who helped negotiate the deal, voted with his GOP colleagues to block it from moving forward, in solidarity with their efforts to secure amendments on immigration provisions.",
    "It is unclear how many total amendments Republicans want votes on in order to move the Covid bill, but several under discussion include allowing insurance companies to purchase therapeutics and addressing the fentanyl drug smuggling crisis at the border.",
    "Republicans called the administration “hypocritical” for requesting billions to fight Covid while ending the practice, which gives the Centers for Disease Control and Prevention power to limit migrant crossings at the U.S.-Mexico during the pandemic.",
    "Full Panel: White House plans to lift covid restrictions on immigration\nApril 3, 202206:28\n\"Senate Republicans blocked a mere debate on Covid aid, knowing full well the consequences for the American people,\" Schumer said Wednesday on the floor.",
    "“The need to continue funding the fight against Covid is clear, but I cannot support siphoning off essential resources for rural communities, tribes and small businesses in Oregon and nationwide just to pad drug companies’ profits,” he said.",
    "“I’m not a procedural expert to tell you how long it will take, particularly with the Judge Jackson vote coming up, so we’ll see,” Romney said when asked Tuesday whether the Covid bill can pass before senators leave town.",
    "White House press secretary Jen Psaki said on Tuesday it's \"disappointing that Senate Republicans voted down consideration\" of the \"much-needed bill\" but vowed to \"continue to work\" with Congress to pass it.",
    "The administration and its allies say that terminating the rule simply returns to pre-pandemic law and that migrants will continue to be removed unless they \"establish a legal basis to remain\" in the U.S.",
    "Joe Manchin of West Virginia; Kyrsten Sinema of Arizona; Jon Tester of Montana; Maggie Hassan of New Hampshire; Raphael Warnock of Georgia; Mark Kelly of Arizona; and Catherine Cortez Masto of Nevada.",
    "WASHINGTON — A bipartisan deal to inject $10 billion into Covid relief operations has stalled over a political fight over immigration, potentially delaying the White House's requested money for weeks.",
    "The battle centers on the Biden administration's decision to end a pandemic rule known as Title 42, which lets U.S. officials quickly turn away asylum-seekers at the border, citing the pandemic.",
    "Senate Minority Leader Mitch McConnell, R-Ky., telegraphed the blockade Tuesday when he told reporters \"there will have to be an amendment on Title 42 in order to move\" the Covid relief bill.",
    "And one Democrat, Sen. Ron Wyden of Oregon, objected to the Schumer-Romney deal, accusing Republicans of forcing the inclusion of a pay-for that would harm rural parts of his state.",
    "The White House has pleaded with Congress to pass the funding as soon as possible, warning that money for vaccines and testing is running dry as a new variant threatens the country.",
    "Senate Republicans unanimously voted to block an effort to advance the $10 billion legislation, struck by Majority Leader Chuck Schumer, D-N.Y., and Sen. Mitt Romney, R-Utah.",
    "He said Covid funding is necessary and “should not be held hostage to extraneous, unrelated issues,\" urging Republicans to \"get serious\" about passing the legislation.",
    "The blockade could mean the Covid relief package will not be passed until after the Senate returns from a two-week recess, scheduled to begin at the end of the week.",
    "\"The program that reimbursed doctors, pharmacists and other providers for vaccinating the uninsured had to end today due to a lack of funds,\" she said.",
    "“If we’re going to have this conversation, that we ought to have a process that allows us to get some amendment votes, predominantly on Title 42.\"",
    "I support what the administration did,\" said Sen. Ben Ray Luján, D-N.M., who was part of a group of lawmakers advocating for ending that rule.",
    "The chamber is juggling the issue with an expected confirmation vote this week for Supreme Court nominee Judge Ketanji Brown Jackson.",
    "Critics of Biden's Title 42 move say it would boost migration to the U.S., strain the system and pose national security risks.",
    "(The first three are the most conservative members of the Democratic caucus; the other four face re-election this fall.)",
    "GOP senators demanded votes on amendments to the legislation that would revoke Biden's move and reinstate the policy.",
    "Because they want to cripple Covid funding legislation with poison pills that they knew would derail this bill.\"",
    "Sen. Roy Blunt, R-Mo., said he believed the legislation would be punted until after the recess.",
    "“I think it’s unlikely that we’ll get the Covid relief bill done before the break,\" he said.",
    "\"Our members are pretty dug in,” Senate Minority Whip John Thune, R-S.D., told reporters.",
    "\"Our test manufacturing capacity will begin ramping down at the end of June.\"",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "The seven Democrats breaking with Biden on Title 42 are Sens.",
    "... Now's the time for us to work together to get it done.\"",
    "\"I do not support the proposals to reinstate Title 42.",
    "His top deputy said Republicans wouldn't back down.",
    "\"We need Covid funding in America,\" he said.",
    "\"We should be working together on this.",
    "\"And why did Republicans say no?",
    "There's agreement."
  ]
}