{
  "id": 8787,
  "mediaId": 2634,
  "date": "2022-04-08",
  "headline": "Democrats Break With Biden on Title 42 Border Policy",
  "image": "https://images.newrepublic.com/50596d9318911786604302e929b427507065d92b.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/166066/democrats-break-biden-title-42-border-policy",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grace Segers",
  "authorUrl": "https://newrepublic.com/authors/grace-segers",
  "termIds": [
    0
  ],
  "sentences": [
    "This week’s bipartisan legislation directs the White House to delay lifting the order until 60 days after the surgeon general submits a written notification to Congress announcing an end to the Covid-19 public health emergency and requires the Biden administration to submit a plan for addressing the increased number of migrants at the border no later than 30 days after that declaration.",
    "“[DHS’s] practice of holding some asylum seekers in congregate settings for days or weeks and flying them to other parts of the border to expel them increases the risk of Covid-19 spread, further confirming that the policy is not intended to, nor does it, protect public health,” a group of epidemiologists and public health experts said in a January statement urging an end to the policy.",
    "When the Centers for Disease Control and Prevention announced last week that it would lift a Trump-era policy that used the coronavirus pandemic to limit border crossings, it drew plaudits from immigration rights advocates—but also put the Biden administration at loggerheads with Democratic senators, several of whom face tough reelections in November.",
    "The only place on the planet where Democrats say Covid is over is on our southern border.”\nWhen The New Republic asked Senator Thom Tillis, one of the Republican co-sponsors of the bipartisan bill, how long the ostensibly temporary Title 42 should stay in effect, he responded by asking whether Covid-19 had abated in Central America.",
    "While thousands of Haitian migrants were expelled under the policy last year, for example, exceptions have been made for Ukrainian and Russian refugees in recent weeks, raising questions about why those individuals should be treated differently, even though they are as susceptible to the coronavirus as anyone else.",
    "“They have the right to asylum, they have the right to ask, and the right to ask has been absolutely taken from them in every sense of the word under Title 42,” Karla Marisol Vargas, senior adviser at the Texas Civil Rights Project, told The New Republic last week.",
    "“By eliminating Title 42, we could actually be at a point where we’re going to bring in and have future threats, particularly if we have another variant from nations that do not currently have the modicum of control that we have over Covid,” Tillis said Thursday.",
    "And you know when something’s poorly thought out is when people from [Biden’s] party are saying it’s a bad idea.” (The $10 billion coronavirus bill did not include funding for global health efforts, due to opposition from Republicans.)",
    "The renewed interest in immigration reform could spur new bipartisan discussions—although Republicans’ plans to hammer Democrats on the issue ahead of the midterm elections could scuttle any momentum in that direction.",
    "GOP Senator James Lankford, who introduced the bill with Sinema, told reporters that it was hypocritical to leave other coronavirus restrictions, such as mask requirements on planes, in place but lift Title 42.",
    "An additional pair of senators locked in toss-up races, Raphael Warnock and Catherine Cortez Masto, are not co-sponsoring the bill but have also criticized the administration’s decision to lift Title 42.",
    "“We want to sit at a table and ask members who have immigration, bipartisan immigration bills, to come and propose those bills to us and see if we can build a 60-vote-plus margin for a group of bills.",
    "The five Democrats co-sponsoring the bill include a trio of moderates—Senators Kyrsten Sinema, Joe Manchin, and John Tester—and two others facing difficult reelections, Mark Kelly and Maggie Hassan.",
    "Democratic dissent over the plan to end Title 42 has already had repercussions, hindering efforts this week to pass legislation authorizing $10 billion in additional coronavirus relief funding.",
    "Now both ends of Pennsylvania Avenue must navigate a fraught issue that has already bogged down a $10 billion Covid relief package and could help determine control of the Senate in November.",
    "Even former CDC officials acknowledge that the order’s implementation was not supported by evidence, and top health officials say that recent surges have not been driven by migrants.",
    "Republicans argue that if the Biden administration believes more coronavirus funding is necessary, it should not rescind a policy ostensibly aimed at reducing the spread of virus.",
    "The conflict reached a new level Thursday when a bipartisan group of senators introduced legislation to block the CDC from lifting the public health order, known as Title 42.",
    "The likelihood that it would have garnered significant Democratic support prompted leadership to hold off on the legislation for at least two weeks as the lawmakers recess.",
    "Senator Dick Durbin told The Hill on Thursday that he wanted to bring a group of senators together to open conversations when the Senate returns to Washington in two weeks.",
    "And what they said was, ‘We’re going to use asylum officers instead of immigration judges.’ I said, ‘Well, that’s good,’” GOP Senator Rob Portman told reporters last week.",
    "“Obviously, you can’t have a $10 billion Covid bill and say, ‘We’ve got to deal with Covid, but we don’t have to deal with it on the border,’” Lankford said.",
    "If they come up with a no, then it goes to the process.” (Under current law, individuals denied an asylum claim do have the right to appeal that decision.)",
    "But Republicans have complained about one element of that plan, a new rule expediting processing of asylum claims by allowing asylum officers within U.S.",
    "The Department of Homeland Security issued a fact sheet last week in which it outlined a plan to deal with the expected increase in migrants.",
    "A federal judge struck down that policy last month, and the CDC days later announced the order would no longer apply to unaccompanied minors.",
    "The administration’s selective implementation of the order, making exceptions of unaccompanied children, only compounded these criticisms.",
    "“Democrats don’t act like they think Covid is finished,” Senate Minority Leader Mitch McConnell said on the Senate floor on Thursday.",
    "Several Democrats, some of whom face tough reelections, oppose the administration’s decision to lift the Trump-era immigration order.",
    "Title 42 grants border officials the authority to expel migrants quickly, regardless of whether they are seeking asylum.",
    "The administration has said that it needs more money for testing and treatments and to ward off another surge.",
    "If a claim is rejected, the individual will be referred for a removal proceeding before an immigration judge.",
    "In fact, experts say, Title 42 may, counterintuitively, do more to spread the virus than contain it.",
    "But Republicans demanded a vote on an amendment blocking the administration from lifting Title 42.",
    "A bipartisan group of House members introduced companion legislation in that chamber this week.",
    "“I was really happy to hear that they were going to do immediate adjudications at the border.",
    "Immigration advocates say Title 42 circumvents the legal right to seek asylum.",
    "But experts say that Title 42 should not be seen as a public health policy.",
    "Citizenship and Immigration Services to consider asylum applications.",
    "They say we should be sending health assistance around the world.",
    "“Then we found out that they don’t have the authority to say no.",
    "“They give speeches daily about the need for more funding.",
    "It may not be possible, but I think it is,” Durbin said.",
    "(Currently, they are considered by immigration judges.)",
    "The CDC plan would repeal the policy as of May 23.",
    "“I just think it’s poorly thought out.",
    "All they could do is say yes."
  ]
}