{
  "id": 905,
  "mediaId": 2658,
  "date": "2022-02-17",
  "headline": "CR stars in pre-recess rerun",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/02/17/cr-stars-in-pre-recess-rerun-00009726",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "CR stars",
  "authorUrl": "https://www.politico.com/staff/katherine-tully-mcmanus",
  "termIds": [
    2034,
    1662,
    2459,
    3925,
    3847,
    4969,
    5309,
    1489,
    1126
  ],
  "sentences": [
    "Among other provisions, the resolution “denounces the Russian military buildup of over 150,000 troops on Ukraine’s border, including in Belarus,” decrying President Vladimir Putin’s government as “threatening the security of bordering NATO allies ... contrary to established international norms.” More from Andrew: Senators unveil their attempt at a symbolic reprimand for Russia\nFIRST IN HUDDLE: A LETTER TO THE POST OFFICE— Rep. Raja Krishnamoorthi (D-Ill.) wrote to USPS Board of Governors Chair Roman Martinez about the new chairman’s vision for the Postal Service, implementation of the USPS’s role in the upcoming election cycle and Postmaster General Louis DeJoy.",
    "Krishnamoorthi might be disappointed by some of Martinez’ answers to his questions in the letter, including, “given Postmaster General DeJoy’s current FBI investigation, conflicts of interest, and substandard job performance, would you support Mr. DeJoy’s removal?” Martinez is on the record praising DeJoy, saying in January: “The best team needs a leader, and I believe that Postmaster General DeJoy is that person to carry out the restructure that is needed.”\nFIRST IN HUDDLE: NORTH CAROLINA SENATE— NARAL Pro Choice America will announce today their endorsement of North Carolina Democrat Cheri Beasley in her 2022 bid for the Senate.",
    "QUICK LINKS\n‘The brand is so toxic’: Dems fear extinction in rural US, from The AP\nA Virginia Man Reviewed \"Civics\" And \"American Government\" Online For His Jan. 6 Community Service, from BuzzFeed News\nHouse members are using proxy voting for reasons far beyond its original intent, Jennifer Haberkorn at the Los Angeles Times\nJudge Michelle Childs, whose early life was shaped by gun violence, is on SCOTUS list, from NPR’s Nina Totenberg\nTRANSITIONS\nAlexandra Caffrey starts today as DOT’s deputy press secretary.",
    "DISTRICT DILEMMAS — Rarely in the spotlight, district staffers had a moment on stage Wednesday when the Select Committee on the Modernization of Congress dove into district office operations, hearing testimony from district staff and lawmakers on challenges the far-flung teams face serving constituents and connecting with Washington.",
    "He raised a sentiment that many district teams might share: “Why do we get treated like second-class citizens out here in the hinterlands?”\nThe hearing also highlighted some eye-popping problems with casework transferring hands (or not) when a new member is elected to serve a district.",
    "Photo of the Day\nNON-BINDING ADMONITION— A bipartisan group of senators will attempt today to pass a symbolic, non-binding resolution that asks President Joe Biden to “impose significant costs” on Russia if it invades Ukraine and condemns the buildup of Russian troops.",
    "CR stars in pre-recess rerun\nBy KATHERINE TULLY-MCMANUS\n02/17/2022 07:40 AM EST\nPresented by\nMAGIC HAPPENS ON THURSDAYS — Senators are stuck on their favorite rerun episode: trying to finish critical legislation just before the deadline (and recess).",
    "Federal funding runs out Friday at midnight and there’s still squabbling in the Senate over expediting consideration of the latest stopgap spending bill — a Wednesday hotline didn’t yield the support necessary to speed up the floor vote.",
    "She has fought for the fundamental freedoms of the people of North Carolina for over two decades and we know she will bring that same commitment to the Senate,” NARAL Pro Choice America president Mini Timmaraju said in a statement.",
    "Cheri Beasley, a woman of many firsts, has already made history as the first Black woman to win a statewide election in North Carolina and the first Black woman to serve as Chief Justice on the state Supreme Court.",
    "Tricky math: Sen. Ben Ray Luján (D-N.M.) is still out following his stroke and Sen. Mark Kelly (D-Ariz.) rushed home this week as his wife, former Rep. Gabrielle Giffords, was hospitalized for appendicitis.",
    "Sen. Mike Lee (R-Utah) and a half-dozen other GOP senators want a vote on an amendment to prevent the Biden administration from enforcing vaccine mandates on federal workers and the military.",
    "HUDDLE HOTDISH\nOops, I Did It Again (invited Britney to testify)...Reps. Charlie Crist (D-Fla.) and Eric Swalwell (D-Calif.) wrote to Britney Spears, according to the star’s Instagram post.",
    "They are backing a proposal to suspend the federal gas tax through the end of the year and want Democrats to embrace the move as a signature economic pitch ahead of the midterms.",
    "But as inflation grips the economy and prices continue rising, those senators say they are merely responding to their constituents’ concerns,” write Burgess and Marianne.",
    "And just as important, it buys appropriators 21 more days to finalize an enormous 12-bill omnibus spending package for the fiscal year that started back in October 2021.",
    "Sen. Ted Cruz (R-Texas) is demanding that the chamber vote on cutting off federal cash to schools and child care centers that require kids to get Covid vaccines.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Thursday, February 17, where we’re looking for a little Senate bibbidi-bobbidi-boo.",
    "Possible objectors: To move fast on this measure before recess begins (or an invasion) Senate rules would require all 100 members to consent to speedy passage.",
    "TRIVIA\nWEDNESDAY’S WINNER: Bruce Mehlman correctly answered that Sen. William B. Allison (R-Iowa) chaired the Appropriations Committee for nearly 25 years.",
    "Other Democrats have also been out this week, which complicates Democrats' math -- Schumer wants to hold some GOP amendment votes at a 60-vote threshold.",
    "The Senate convenes at 10:30 a.m.\nAROUND THE HILL\n10 a.m. Senate Armed Services Committee hearing on four Defense Department nominations (Dirksen G50).",
    "Vulnerable 2022 Senate Democrats are trying their hand at a typical Republican mainstay: Running for re-election as the real tax-cutters in Congress.",
    "Sen. Marco Rubio (R-Fla.) wants a vote on his measure that would prohibit the federal government from buying any crack pipes or drug paraphernalia.",
    "3 p.m. House Committee on House Administration hearing on U.S. Capitol Police inspector general reports relating to January 6th (Longworth 1310).",
    "It is expected to ring up at more than $1.5 trillion and increase funding for both the military and non-defense agencies through September.",
    "She testified that she was told that when a member dies in office, constituent service case files aren’t transferred to the new member.",
    "TODAY’S QUESTION from Bruce: Who was the last person nominated for vice president (on a major-party ticket) to decline the nomination?",
    "She shared the letter, which congratulated her on the end of her conservatorship and invited her to share her story on Capitol Hill.",
    "Rand Paul (R-Ky.) or Bernie Sanders (I-Vt.), who have advocated for a more restrained approach to the crisis, could raise concerns.",
    "\"NARAL Pro-Choice America is proud to stand with Cheri Beasley in her historic bid to become North Carolina's first Black U.S.",
    "“We’re doing work for people here, not for my own benefit.” Chris Cioffi over at Roll Call had a good roundup of the hearing.",
    "Mark Kelly of Arizona, Maggie Hassan of New Hampshire, Catherine Cortez Masto of Nevada and [Raphael] Warnock of Georgia.",
    "“District offices sometimes are thought of as the frontier, and kind of forgotten,” Rep. Ed Perlmutter (D-Colo.) said.",
    "— On Feb. 23 at 8 p.m., the POLITICO Congress team behind Huddle is whipping up our first-ever virtual trivia night.",
    "“I started from scratch, zero, nothing, because staff were not allowed to transfer information over,” said Williams.",
    "“It’s no coincidence that the Democrats most involved in the new push hail from the toughest battlegrounds: Sens.",
    "Rep. Nikema Williams (D-Ga.) took over after Rep. John Lewis (D-Ga.) died, further complicating that transition.",
    "She was most recently Rep. Josh Gottheimer (D-N.J.)’s press secretary\nTODAY IN CONGRESS\nThe House is out.",
    "The CR, already cleared by the House last week, would cover government operations through March 11.",
    "They say magic can happen in the Senate on a Thursday, and it’s always stronger ahead of a recess.",
    "Prizes for the winners and for best team name (along with bragging rights) are on the table.",
    "“This information shouldn’t belong to a member, it should belong to the district,” she said.",
    "10 a.m. Senate Finance Committee hearing on IRS customer service challenges (Dirksen 215).",
    "“Because of the letter, I felt heard and like I mattered for the first time in my life!!",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "They are instead given to the member’s spouse to sign off on sharing the files.",
    "RSVP solo or with a team to Huddle (please include team name in the message).",
    "It’s not clear yet if there are any objections to the resolution’s language.",
    "Jet fumes: A Senate CODEL is expected to leave for Munich at 4 p.m. today.",
    "Possible holdups: crack pipes, vaccine mandates and balanced budgets.",
    "But the move also risks pitting them against caucus colleagues.",
    "More on the omnibus from Jennifer Scholtes and Connor O'Brien.",
    "Other folks just want to hit the road to their home states.",
    "DEMOCRATS PUSH TAX CUTS— (Yes, you read that correctly.)",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "GET HUDDLE emailed to your phone each morning.",
    "wants a vote on a balanced budget amendment.",
    "Send your answers to ktm@politico.com.",
    "He’s asking for a response by Feb. 28.",
    "But Lewis’ wife died before he did.",
    "But Republicans might take issue.",
    "We’ll send sign-up instructions.",
    "NEXT WEEK: HUDDLE TRIVIA LIVE!",
    "Sen. Mike Braun (R-Ind.)",
    "Registration is free.",
    "Read the full letter.",
    "!” said Spears.",
    "GOOD MORNING!",
    "Senator.",
    "Sens."
  ]
}