{
  "id": 937,
  "mediaId": 2746,
  "date": "2022-02-15",
  "headline": "Sen. Manchin balks at vulnerable Democrats’ push to suspend federal gasoline tax",
  "image": "https://twt-thumbs.washtimes.com/media/dupe--image/2021/12/19/congress_mancin_54034.jpg_2022.02.15-2022.i.1644973034.2_c0-391-4854-3222_s1200x700.jpg?11fe8f4f97c8edbcda6001404620c9a1cae7e428",
  "link": "https://www.washingtontimes.com/news/2022/feb/15/manchin-balks-vulnerable-dems-push-suspend-gas-tax/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haris Alic",
  "authorUrl": "https://www.washingtontimes.com/staff/haris-alic/",
  "termIds": [
    2459,
    1973,
    4905,
    5510,
    1493,
    1126,
    392
  ],
  "sentences": [
    "“The gas tax, which pays for all the infrastructure that we travel on in this country, and which would leave a huge hole obviously in the Highway Trust Fund, which is critically important to every state in the union that depends upon the federal government.”\nThe Committee for a Responsible Federal Budget estimates that pausing the tax would shrink federal revenues by roughly $20 billion between now and January 2023.",
    "“We need to continue to think creatively about how we can find new ways to bring down costs, and this bill would do exactly that, making a tangible difference for workers and families.”\nMr. Manchin and GOP lawmakers say the gas tax “holiday” is nothing more than a short-term solution to larger problems in America’s economy and energy infrastructure.",
    "“While a gas tax holiday might provide some temporary relief, much of the benefit may flow through to oil producers or lead to higher prices in other sectors of the economy,” said Maya MacGuineas, president of the Committee for a Responsible Federal Budget.",
    "“By boosting demand in an already over-stimulated economy, the holiday would likely boost inflation in 2023 once it ends.”\nMr. Biden has not officially endorsed the gas tax holiday, but aides are increasingly warming to the proposal.",
    "Mr. Manchin, a West Virginia moderate who chairs the Senate Energy and Natural Resources Committee, said the proposal amounted to little more than a “Band-Aid” when it came to fighting recent months of sharply higher prices.",
    "Last year in an effort to quell rising gasoline prices ahead of the holidays, Mr. Biden released 50 million barrels of oil from the Strategic Petroleum Reserve, an emergency supply of oil housed by the Department of Energy.",
    "“It’s short-term, obviously, to try and gain some political advantage at a time when people all of a sudden now on the other side are starting to worry,” said Senate Minority Whip John Thune, South Dakota Republican.",
    "Mr. Manchin said it amounted to little more than a “policy Band-Aid for rising gas prices” that did “not solve the self-inflicted wound that shortsighted energy policy is having on our nation.”",
    "GOP lawmakers further say that suspending the gasoline tax will wreak havoc on the Highway Trust Fund, a federal pool of money used to finance state and local transportation projects.",
    "Mark Kelly of Arizona and Maggie Hassan of New Hampshire, are facing tough reelection campaigns this year as voters increasingly say inflation and surging prices are a major concern.",
    "Democratic Sen. Joe Manchin III pushed back Tuesday on a proposal by vulnerable members of his party to suspend the federal gasoline tax until after the November elections.",
    "Most of the impact would be felt by the Highway Trust Fund, which is currently responsible for implementing part of the White House’s $1.2 trillion infrastructure bill.",
    "Mr. Manchin’s opposition comes as a cadre of vulnerable Democrats are backing legislation to suspend the 18.4-cents-per-gallon federal gas tax through Jan. 1.",
    "The average price of gas nationally has skyrocketed nearly $3.50 per gallon since President Biden took office, according to the automobile owners club AAA.",
    "That’s nearly a dollar per gallon more than this time last year, when the COVID-battered U.S. economy was just reviving and driving miles were still down.",
    "“People are feeling a real pinch on everyday goods, and we must do more to help address rising costs, particularly the price of gas,” said Ms. Hassan.",
    "“It doesn’t make any more sense than taking oil out of the Strategic Oil Reserve” — a move President Biden authorized late last year.",
    "“There are some Democrat senators now who are suggesting let’s just waive the gas tax temporarily,” said Mr. Thune.",
    "They say that a tax holiday will spur demand for more gasoline consumption, likely driving prices even higher.",
    "Budget deficit hawks also say that suspending the gasoline tax is unlikely to do much to combat inflation.",
    "Republicans, in particular, argue the legislation is a cynical ploy to appease voters.",
    "“I don’t think that makes any sense right now,” said Mr. Manchin.",
    "At the time, critics like Mr. Manchin deplored the decision.",
    "The lawmakers behind the bill, including Democratic Sens."
  ]
}