{
  "id": 974,
  "mediaId": 2550,
  "date": "2022-02-11",
  "headline": "Arizona GOP candidate revels in outrage after releasing vile ad depicting political violence",
  "image": "https://images.dailykos.com/images/1036703/story_image/ScreenShot2022-02-11at7.30.41AM.png?1644593471",
  "link": "https://www.dailykos.com/stories/2022/2/11/2079808/-Arizona-GOP-candidate-shoots-at-actors-playing-Biden-Pelosi-Mark-Kelly-in-vile-campaign-ad?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5309,
    4905,
    3246,
    1952,
    2459,
    1489,
    99,
    1126,
    5949
  ],
  "sentences": [
    "pic.twitter.com/mJTbFuS0du\n— Jim Lamon (@jim_lamon) February 10, 2022\n“And then there is Border Patrol union chief Brandon Judd,” Sharry continued, asking if the union president has “no shame.” That’s an affirmative “no.”\nRecall that Judd once complained that border agents were being “pointed at with this broad brush” after forcibly separating children from their families at the southern border.",
    "It should be denounced by one and all, especially by his fellow Republicans.”\nBut Lamon instead reveled in the outrage, tweeting he “might single handedly solve the Arizona drought with all the snow flakes that are melting over my Super Bowl ad.” Of course he wanted the attention, because when Republicans aren’t busy trying to overturn democracy, they live to troll liberals.",
    "A GOP Senate candidate who was among the 11 Arizona Republicans who signed a forged electors document has released a violent campaign ad where he shoots at actors representing President Joe Biden, Speaker of the House Nancy Pelosi, and Sen. Mark Kelly, whose wife—former Rep. Gabby Giffords—survived a brutal assassination attempt in 2011.",
    "x\nSecret Service and DOJ investigated @kathygriffin for posting that photo - and here we have a US Senate candidate, accompanied by a Sheriff and leader of a police union, shooting at the President, the Speaker, and Senator Kelly\nwhere's the fucking outrage now?",
    "https://t.co/kQafr9iTdT\n— Joe Sudbay (@JoeSudbay) February 11, 2022\n“Violence, insurrection and conspiracy might be the future of many in the Republican Party, but it cannot be the future of America,” Sharry continued in a statement.",
    "Frank Sharry, the organization’s executive director, called the ad “dangerous.”\n“Lamon’s ad has the Arizona Republican candidate for Senator firing a gun at characters depicting President Biden, Speaker Pelosi and Senator Mark Kelly.",
    "America’s Voice was among those issuing swift condemnations of the violent ad, which comes just weeks after the 10th anniversary of Giffords’ resignation from Congress after being shot in the head.",
    "https://t.co/HOb0OPStEc\n— Jenn Budd (@BuddJenn) February 11, 2022\nAs of Friday Lamon’s ad remains on Twitter, and will apparently run in Arizona during the Super Bowl, Phoenix New Times reported.",
    "The decision to run this violent ad is on NBC, the same network that in 2015 decided that allowing the insurrectionist former president to host its trademark show was a swell idea.",
    "It is expected to run on Tucson's NBC station on Sunday during the football game and then would be broadcast statewide on Sunday night.”\nGiffords was shot in a Tucson suburb.",
    "News reports have also indicated that both the Border Patrol and Immigration and Customs Enforcement unions have worked to sabotage the Biden administration agenda.",
    "“The good people of Arizona have had enough of you,” Jim Lamon says before aiming at the figure representing the president and shooting a gun out of his hands.",
    "As a nation, we should do all we can to keep from finding out where such outrageous behavior will lead.”\nThis is a short blurb about Daily Kos.",
    "Immigrant right advocacy group America’s Voice noted Border Patrol Union President Brandon Judd is among Lamon’s “deputies” in the background.",
    "President Brandon Judd appears in this political ad wearing his official union shirt w/badge on it & takes up arms against ?@POTUS.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "“The advertisement package cost the campaign ‘upwards of six figures,’ according to the campaign's manager Stephen Puetz.",
    "x\nArizona has had enough of the DC Gang’s open borders, high gas prices, and shifty politicians pushing us around.",
    "But that doesn’t mean we shouldn’t forcefully speak out when we see vile acts by sick fucks like Jim Lamon.",
    "The ad depicts violence against elected leaders and should be taken down immediately.",
    "@CaptMarkKelly @JoeBiden @TeamPelosi, it’s time for a good old-fashioned showdown.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "The Border Patrol union records its podcast out of racist rag Breitbart’s studio.",
    "It’s important to note that Judd is using his position as a LEO to politic.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "“Unless idiots like Lamon are held accountable, it will just get worse.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "More than 1,200 families remain separated to this day.",
    "Check out our new Super Bowl ad, The Showdown, here ??",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "It’s about money and ratings.",
    "Lamon is not alone in the ad.",
    "x\nBorder Patrol ?@BPUnion?",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "But at what cost?",
    "Donate $5 monthly",
    "Please read it."
  ]
}