{
  "id": 9802,
  "mediaId": 2572,
  "date": "2022-04-04",
  "headline": "Judiciary panel deadlocks on Jackson SCOTUS nomination, setting up Senate vote to move it out of committee",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/GettyImages-1239454592_1280x.jpg",
  "link": "https://www.foxnews.com/politics/senate-ketnji-brown-jackson-supreme-court-nomination-judiciary-committee-vote",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    5441,
    5699,
    2976,
    4597,
    2383,
    1498,
    1489,
    1477
  ],
  "sentences": [
    "If a simple majority agrees to discharge Jackson's nomination – which is expected – then it will be placed on the Senate's \"executive calendar\" where it can be taken up the next calendar day, according to the Congressional Research Service.",
    "The Senate Judiciary Committee Monday deadlocked 11-11 on Supreme Court Nominee Judge Ketanji Brown Jackson, setting up a Senate floor vote that’s likely to reveal just how much GOP support she will really get.",
    "The committee vote was delayed for several hours because the flight carrying Sen. Alex Padilla, D-Calif., from Los Angeles to Washington, D.C., returned to the airport due to a passenger medical emergency.",
    "This means the chamber would be able to advance through the cloture process throughout the week, setting up a likely Thursday or Friday final confirmation vote barring anything unforeseen.",
    "But the power-sharing agreement between Schumer and Senate Minority Leader Mitch McConnell, R-Ky., allows for a simple-majority vote on a discharge motion when committees are deadlocked.",
    "Lindsey Graham, R-S.C., and Thom Tillis, R-N.C., were initially considered to be potentially in play as GOP votes for a Biden Supreme Court nominee on the Judiciary Committee.",
    "Schumer will move to discharge the consideration of the Jackson nomination, which will lead to up to four hours of debate, evenly divided between the majority and minority.",
    "All Democrats are expected to support the nominee, although the nomination will likely be a major political issue for Democrats who are up for reelection, like Kelly.",
    "But Senate Majority Leader Chuck Schumer, D-N.Y., can call a floor vote, likely later Monday, on a motion to \"discharge\" Jackson from the Judiciary Committee.",
    "Lisa Murkowski, R-Alaska, and Mitt Romney, R-Utah, who haven't yet announced whether they will vote for Jackson, will be forced on the record in short order.",
    "Graham cited Jackson's history of allegedly light sentences for child pornography offenders and her \"lack of a steady judicial philosophy.\"",
    "Representatives for Romney and Murkowski did not immediately respond to requests for comment from Fox News Digital Monday morning.",
    "Committees are split evenly in the 50-50 Senate, meaning matters that don't get bipartisan support can't go straight to the floor.",
    "The party-line 11-11 tie in committee means Jackson won’t get a favorable recommendation for her nomination to go to the floor.",
    "This prevents the minority from being able to create complete gridlock by simply voting against matters in committee.",
    "Tillis said he was not satisfied with Jackson's judicial philosophy or her refusal to oppose court-packing.",
    "Both men, however, said they found her to be of strong character and respected within the legal community.",
    "NEW AD CAMPAIGN ACCUSES JUDGE KETANJI BROWN JACKSON OF BEING TOO LENIENT ON PEDOPHILES\nIt also means Sens.",
    "Their support would be a major win for the White House, which is seeking bipartisan backing for Jackson.",
    "Sen. Susan Collins, R-Maine, is the only Republican to announce she will vote for Jackson so far.",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "Sen. Mark Kelly, D-Ariz., Monday became the latest Democrat to officially back Jackson.",
    "But they each in recent days announced they will oppose her.",
    "Fox News' Chad Pergram contributed to this report.",
    "Tyler Olson covers politics for Fox News Digital.",
    "Sens."
  ]
}