{
  "id": 9812,
  "mediaId": 2584,
  "date": "2022-04-01",
  "headline": "Biden ends Trump-era asylum curbs amid border-region Democrat backlash",
  "image": "https://i.guim.co.uk/img/media/73f96da87a0bcc7815674e1595f2a2955f004764/0_190_5700_3420/master/5700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0881d163c63429157b202210747d57fc",
  "link": "https://www.theguardian.com/us-news/2022/apr/01/biden-ends-title-42-immigration-curbs-border-democrat-backlash",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Smith",
  "authorUrl": "https://www.theguardian.com/profile/davidsmith",
  "termIds": [
    4905,
    3475,
    4066,
    4873,
    2765,
    1900,
    253,
    392,
    6383
  ],
  "sentences": [
    "Eleanor Acer, senior director for refugee protection at Human Rights First, said: “The Biden administration and the CDC have rightly decided to terminate this Trump policy – a policy we have spent two years opposing due to the horrific human rights abuses it inflicts on people seeking asylum, and we urge a swift end to this humanitarian travesty.”\nNicole Melaku, executive director of the National Partnership for New Americans, a coalition of state-level advocacy organisations, said: “The Biden administration’s decision to stop using Title 42 is a victory for human rights and for recognising the dignity of asylum seekers and others seeking refuge.",
    "I’m thrilled to see the Biden administration do the right and moral thing by ending this extremely harmful, xenophobic and shortsighted policy that disproportionately impacted Black and brown migrants.”\nCongresswoman Cori Bush of Missouri, who has urged Biden to review the disparate treatment of Black migrants under Title 42, said: “This racist, inhumane relic from the Trump era has been devastating for migrants fleeing persecution, war, poverty, climate catastrophe and violence in their home countries and who have been forced to seek asylum in the United States.",
    "Our immigration system is not designed for persistent irregular mass migration that will result from this poorly thought out decision.”\nThe conservative Democrat Joe Manchin, of West Virginia, described “a frightening decision”, adding: “Title 42 has been an essential tool in combating the spread of Covid-19 and controlling the influx of migrants at our southern border.",
    "We are already facing an unprecedented increase in migrants this year.”\nMark Kelly, a Democratic senator from Arizona who faces a tough re-election fight, said: “This is a crisis and in my estimation, because of a lack of planning from the administration, it’s about to get worse.”\nThe Department of Homeland Security (DHS) insists it will be ready.",
    "Make no mistake, the president will own the calamity his policies have created.”\nShelley Moore Capito, the top Republican on the Senate homeland security appropriations subcommittee, said: “Through policy decision after policy decision, President Biden has created a crisis that is about to balloon into a full blown catastrophe.",
    "“However, every day this policy remains in effect endangers highly vulnerable individuals facing persecution or violence in their home countries.”\nAsked why Title 42 could not be revoked immediately, Jen Psaki, the White House press secretary, said doing so required an “interagency process” and attention to Covid protocols.",
    "“After considering current public health conditions and an increased availability of tools to fight Covid-19 (such as highly effective vaccines and therapeutics), the CDC director has determined that an order suspending the right to introduce migrants into the United States is no longer necessary,” the CDC said.",
    "Homeland security officials said earlier this week about 7,100 migrants were coming to the border daily after an average of about 5,900 a day in February – on pace to match or exceed highs from last year and other peak periods.",
    "They also said they were prepared for an increase once Title 42 was rescinded and were planning for as many as 18,000 arrivals daily – an increase likely to be weaponised by Republicans ahead of November’s midterm elections.",
    "Kevin McCarthy, the Republican minority leader in the House of Representatives, said: “Biden’s border crisis is worse than ever but the president has decided to eliminate yet another vital tool: Title 42.",
    "Many Democrats, medical experts and the UN have condemned Title 42, arguing it expels migrants to danger in Mexico and that scientific evidence does not support its goal of limiting virus spread.",
    "Joe Biden will next month end a controversial pandemic-related expulsion policy that effectively closed America’s asylum system at its border with Mexico, it was announced on Friday.",
    "Alejandro Mayorkas, the DHS secretary, said: “We will increase personnel and resources as needed and have already redeployed more than 600 law enforcement officers to the border.",
    "The decision to lift the Title 42 public health order, which will take effect on 23 May, is seen as long overdue by immigration advocates who regard the order as inhumane.",
    "“It is a legal right and our moral obligation to open our doors to asylum seekers.”\nCampaigners expressed frustration that Title 42 would not be rescinded until 23 May.",
    "Pramila Jayapal, chair of the Congressional Progressive Caucus, said: “This is a momentous day for immigrant rights activists and immigrants and refugees everywhere.",
    "The Centers for Disease Control and Prevention (CDC), which issued Title 42 in March 2020 in response to the coronavirus outbreak, said it was no longer needed.",
    "Title 42 was a cruel and discriminatory policy that circumvented US law, preventing people from accessing protections established by Congress.",
    "Over the next two months, we are putting in place additional, appropriate Covid-19 protocols, including ramping up our vaccination program.”",
    "This decision is wrong and will invite a lawless surge of illegal border crossings to enrich human traffickers and overwhelm border patrol.",
    "“Our facilities are already well over capacity, and without Title 42 authority, the crisis on our southern border will become even worse.",
    "Biden kept Title 42 after taking office in January 2021 despite campaign promises to reverse Trump’s immigration policies.",
    "Trump has used recent rallies to draw a comparison with Ukraine, suggesting the US is suffering a violent invasion.",
    "But it was seized on by Republicans and some electorally vulnerable Democrats, who warned of chaos at the border.",
    "“It was always going to be important to have an implementation period and the timeline reflects that,” she said.",
    "Since Title 42 went into effect under Donald Trump, migrants have been expelled more than 1.7m times.",
    "“Today is the product of years of advocacy from both inside and outside Congress.",
    "“We are referring smugglers and certain border crossers for criminal prosecution.",
    "“This will inflict suffering, pain and tragedy throughout our country.",
    "They welcomed Friday’s announcement."
  ]
}