{
  "id": 9823,
  "mediaId": 2572,
  "date": "2022-03-31",
  "headline": "Border Patrol agents bracing for new migrant wave if Title 42 lifts: 'We are expecting to get wrecked'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/GettyImages-1358276236.jpg",
  "link": "https://www.foxnews.com/politics/border-patrol-agents-migrant-wave-title-42",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2765,
    4905,
    1428
  ],
  "sentences": [
    "The ending of the order is something that has been demanded by left-wing activists and top Democrats for months, but also raises fears not just about a larger number of illegal migrants being released into the U.S., but also that it will encourage even larger numbers of migrants to try to get into the U.S.\nBorder Patrol agents, who have been dealing with over 150,000 migrant encounters each month for nearly a year, were appalled by the reported move.",
    "DEM SENATORS SOUND ALARM OVER REPORTS BIDEN ADMINISTRATION WILL END TITLE 42 BORDER POLICY\nThe order was implemented by the Trump administration in March 2020 due to the outbreak of COVID-19 and has since been used by both the Trump and Biden administrations to expel a majority of migrants at the border.",
    "That ending Title 42 would supercharge the ongoing border crisis has been tacitly acknowledged by the Biden administration, with officials telling reporters they are planning for numbers of up to 18,000 migrants a day, and have put out calls for volunteers and help from the Pentagon.",
    "Multiple outlets reported Wednesday that the Biden administration is planning to announce that it will end Title 42 on May 23, giving the Department of Homeland Security time to prepare for an expected increase in migrants at the border.",
    "Border Patrol agents are fearing that they are going to get hit by an enormous surge in migrants at the southern border if the Biden administration ends Title 42 in May – on top of the already massive numbers they are already facing.",
    "That includes deploying resources, delivering a more efficient immigration process, processing and removing those without valid claims, and working with other countries to \"manage migration and address root causes.\"",
    "\"If there's a strategy in place, we haven't seen it, it hasn't been disseminated to us and there's no way you can prepare in a month and a half for what is expected to be a mass illegal migration crisis,\" he said.",
    "The Border Patrol Union president warned that agents will have less than 50% of their resources in the field as agents will have to shift into administrative duties like processing and dealing with transports.",
    "Multiple Border Patrol officials have told Fox News that ending Title 42 would lead to what one agent described as a \"surge on top of a surge\" as word spreads among migrants that they will not be deported.",
    "There were more than 164,000 migrant encounters in February, and that number is expected to rise in March, putting considerable pressure on agents and facilities -- and that’s before the order is ended.",
    "The Department of Homeland Security put out a fact sheet on Wednesday outlining what it is doing to prepare for a \"potential increase in the number of border encounters.\"",
    "\"We can't even fly on airplanes without masks, but we’re going to end Title 42 which is going to cause the single largest flux of illegal immigration in our history?\"",
    "As for how his fellow agents are feeling about the situation at the border: \"They feel like we’re waving the white flag of surrender right now,\" he said.",
    "\"The only thing this administration is going to be able to do is just release people on a mass scale, that’s it, that’s all they can do.\"",
    "\"We feel abandoned, we feel frustrated, we’re devastated,\" National Border Patrol Council President Brandon Judd told Fox News Digital.",
    "Border Patrol Chief Raul Ortiz said this week that the U.S. will hit one million border encounters this fiscal year in the coming days.",
    "Judd told Fox that busy parts of the border like Del Rio and Yuma Sectors are already seeing overcrowding to four times their capacity.",
    "Judd’s concerns tapped into those shared by both Republican and Democratic lawmakers in Washington D.C. Arizona Democratic Sens.",
    "There are also believed to be a considerable number of migrants waiting in Mexican cities waiting for Title 42 to drop.",
    "\"We know this is going to cause chaos of epic proportions, especially when there is still a pandemic going on.\"",
    "Mark Kelly and Kyrsten Sinema have warned the administration against ending Title 42 without a plan in place.",
    "In February, approximately 55% of the more than 164,000 migrants encountered were returned due to the order.",
    "\"This administration has created the most dangerous situation we have ever seen on the border,\" he said.",
    "Sen. Joe Manchin, D-W.Va., has also called for the administration to keep the order in place.",
    "Judd said that he had seen no evidence of a sufficient plan to deal with the crisis.",
    "\"They feel like we are completely giving control of the border to the cartels.\"",
    "Lawmakers have noted mass releases of migrants already in parts of Texas.",
    "\"We are expecting to get wrecked,\" one Border Patrol agent told Fox News.",
    "The Biden administration has stressed that it is making preparations.",
    "Fox News Bill Melugin contributed to this report.",
    "\"Again, we’re beside ourselves.\"",
    "he said."
  ]
}