{
  "id": 9863,
  "mediaId": 8475,
  "date": "2022-04-01",
  "headline": "Biden administration to halt pandemic policy blocking migrants who claim asylum",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/040122_110821_migrants_nogales.jpeg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/nationworld/report/040122_title_42_ends/biden-administration-halt-pandemic-policy-blocking-migrants-who-claim-asylum/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ariana Figueroa",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/82081",
  "termIds": [
    5879,
    2459,
    2469,
    2765,
    4905,
    4617,
    2915,
    392,
    5949
  ],
  "sentences": [
    "“It is not lost on (us) that folks who seized on the Trump Administration’s Title 42 restrictions to stoke fear about migrants bringing COVID into communities were among the first to lift indoor mask mandates and other restrictions.”\nThey continued: “Our government has the tools to safely process and screen people at the border, as required by law, in order to determine whether they qualify for asylum or other humanitarian protections.”\nArizona’s Democratic senators, Mark Kelly and Kyrsten Sinema, both denounced Biden’s decision to end Title 42.",
    "The CDC added that vaccination rates in the United States and abroad “provide an additional layer of protection.”\nThe order, known as Title 42, was enacted by the Trump administration in March 2020 as a way to prevent migrants from seeking asylum in the United States amid a health crisis, and expelled migrants to their home countries.",
    "Democrats react\nDemocratic members of the U.S. House who lead a committee and subcommittee that manage border security, Reps. Bennie Thompson of Mississippi and Nanette Diaz Barragán of California, said in a joint statement that the Trump-era policy was never about public health and was inhumane.",
    "Once the order is terminated, families and single adults who enter the country without legal authorization must establish a legal basis for remaining in the U.S. or they will be removed, Department of Homeland Security and State Department officials said on a call with reporters Friday.",
    "“The only long-term solution to these periodic surges that we have seen over the last decade under presidents of both parties can only come from comprehensive legislation and lasting reform that can only happen with our friends in Congress,” a State Department official said.",
    "Expediting asylum cases\nIn preparation for the end of the order, the Biden administration announced in late March a new policy to expedite asylum cases at the U.S.-Mexico border in an attempt to resolve a years-long backlog.",
    "“There is no longer a serious danger that the entry of covered citizens, as defined by the August order, into the United States will result in the introduction, transmission, and spread of COVID-19,” according to the notice.",
    "Months in the works\nDHS officials said they had been planning the ending of Title 42 for months, and have sent hundreds of law enforcement officials to the border to assist in processing, and will continue to send agents.",
    "Citizenship and Immigration Services officials — rather than immigration judges — to make decisions on claims by migrants at the border that they cannot return to their home countries for fear of torture or persecution.",
    "The Centers for Disease Control and Prevention announced Friday the government will terminate a Trump-era policy that prevented migrants from claiming asylum during a health crisis, including the coronavirus pandemic.",
    "“I’ll continue pushing for transparency and accountability from the Administration to help secure the border, keep Arizona communities safe, and ensure migrants are treated fairly and humanely.”\nAnd Arizona Gov.",
    "“We are coordinating across the whole of the government to ensure that we are prepared for any potential increase in border encounters as a result of termination of the Title 42 order,” a DHS official said.",
    "DHS and State Department officials said the U.S. needs an overhaul of its immigration system, and reiterated the president’s call on Congress to work on bipartisan legislation to address immigration reform.",
    "Yet President Biden, Vice President Harris and Secretary Mayorkas have paid no mind to this crisis, and now they want to pour gasoline on the fire by lifting Title 42,” Ducey said in a written statement.",
    "“Today’s decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border,” Sinema said in a written statement.",
    "“From the earliest days of this pandemic, the Trump Administration sought to exploit it to advance his anti-immigrant agenda and used Title 42 to single out migrants as a health risk,” they said.",
    "“As we watch our European allies extend compassion to Ukrainian refugees abroad, we are reminded of our own values and history in welcoming those yearning to breathe free,” Gonzales said.",
    "In the days leading up to the CDC announcement, amid news reports Title 42 would be lifted, Republicans criticized the White House and called on the CDC to keep the policy in place.",
    "Sergio Gonzales, the executive director of the Immigration Hub, an immigration advocacy center, said in a statement that the Biden administration was correct to end the policy.",
    "Officials said they will begin to provide up to 2,000 vaccinations a day across 11 locations along the border and are working to expand to 27 locations in the coming weeks.",
    "But immigration advocates and attorneys expressed concern that the new policy could prevent asylum seekers from obtaining legal representation if their cases are denied.",
    "“This is how we live up to our promise to the American public and those who are fleeing persecution, torture or war and seeking protection within our borders.”\n- 30 -",
    "“It’s unacceptable to end Title 42 without first implementing a plan to ensure a secure, orderly, and humane process at the border,” Kelly wrote on Twitter.",
    "Doug Ducey blasted the move, and said Biden is ignoring “a national security crisis, a public safety crisis and a humanitarian crisis” on the border.",
    "DHS and State Department officials said that the CDC is putting in additional COVID-19 protocols, such as vaccination requirements for migrants.",
    "“Ending Title 42 without any real border security plan in place would spark a humanitarian and security crisis like we’ve never seen,” he said.",
    "The current backlog of immigration cases handled by judges is nearly 1.5 million, according to tracking by Syracuse University.",
    "Senate Minority Leader Mitch McConnell, a Kentucky Republican, said ending Title 42 would worsen immigration at the border.",
    "More than 1 million migrants have been expelled under Title 42, according to U.S. Customs and Border Protection data.",
    "The CDC had the authority to keep the policy in place, making a decision every 60 days whether to maintain it.",
    "Congressional Democrats and immigration advocates have pressured the White House to end the Title 42 policy.",
    "The White House has deferred to the CDC, arguing that it would not weigh in on a public health matter.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "The departments of Justice and Homeland Security issued a rule to allow U.S.",
    "The policy will end on May 23, the CDC wrote in its notice.",
    "“It’s the federal government’s job to secure our border.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "This rule would not apply to unaccompanied children.",
    "Thanks for reading TucsonSentinel.com.",
    "Like what you're reading?"
  ]
}