{
  "id": 9879,
  "mediaId": 2520,
  "date": "2022-03-31",
  "headline": "Here's why Sens. Kyrsten Sinema, Mark Kelly helped torpedo a top Biden Labor nominee",
  "image": "https://www.gannett-cdn.com/presto/2021/03/06/PPHX/1e0c25dd-6ed8-4214-a275-dd7432755934-pjimage_6.jpg?crop=1911,1075,x4,y0&width=1911&height=1075&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/washington/2022/03/31/sens-mark-kelly-and-kyrsten-sinema-help-launch-labor-department-nominee/7232346001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yvonne Wingett Sanchez",
  "authorUrl": "https://www.azcentral.com/staff/2646083001/yvonne-wingett-sanchez/",
  "termIds": [
    5879,
    2459,
    2426,
    4905,
    5802,
    1489,
    91,
    1120,
    1444,
    5949
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nWith all nominees, Sinema applies a three-part test where she examines whether they are qualified for the job, whether they believe in the mission of the agency and whether they can be trusted to uphold the law.",
    "“Senator Kelly heard concerns from many Arizona small businesses about this nominee’s record, and ultimately shared those concerns and could not support the nomination,” Kelly’s spokesperson Jacob Peters said in a written statement.",
    "The late-night vote came as Weil came under fire by conservatives and business groups for his work in the same role during the Obama administration, largely over his more restrictive standard for identifying independent contractors.",
    "Sinema and Kelly, both Arizona Democrats, joined Wednesday with centrist Sen. Joe Manchin, D-W.Va., and Senate Republicans to block a full Senate vote to confirm David Weil as the head of the department’s Wage and Hour Division.",
    "Sinema, who has supported other Biden Labor Department nominees and is viewed as business-friendly, had some concerns with Weil’s previous tenure, when a federal court found the department exceeded its rule-making authority.",
    "“Upon reviewing Mr. Weil’s nomination, she has concerns with his ability to faithfully execute and uphold the law,” Sinema’s spokesperson Hannah Hurley said in a statement to The Arizona Republic.",
    "Business-friendly groups blitzed Arizona's senators with appeals to shoot down the nomination, including digital and billboard campaigns as Weil’s nomination languished last fall.",
    "The 47-53 vote to advance Weil’s nomination in the evenly divided chamber marked the first time a Biden nomination failed on the Senate floor.",
    "Kyrsten Sinema and Mark Kelly helped torpedo President Joe Biden’s pick to lead an important division of the Labor Department.",
    "Subscribe for free to The Gaggle political podcast on Apple Podcasts, Overcast, or wherever you listen to audio content.",
    "Weil’s views on independent-contractor status ultimately settled Kelly’s decision.",
    "It is a view that would expand business responsibilities to more workers.",
    "Contact her at yvonne.wingett@arizonarepublic.com and 602-444-4712.",
    "Reach the reporter on Twitter and Facebook.",
    "Have news to share about Arizona politics?",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "Sens."
  ]
}