{
  "id": 9882,
  "mediaId": 2590,
  "date": "2022-03-31",
  "headline": "Senators Joe Manchin, Kyrsten Sinema And Mark Kelly Tank Pro-Worker Labor Nominee",
  "image": "https://img.huffingtonpost.com/asset/6245b8572300006198138b98.jpeg?cache=zZnpo0qZOC&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/joe-manchin-kyrsten-sinema-mark-kelly-david-weil_n_6245ab40e4b0e44de9bea03a",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Jamieson",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "She called Weil “an exceptionally qualified nominee with a long track record fighting to ensure workers get the wages they have earned.”\nDuring his time in the Obama administration, Weil infuriated the restaurant industry with legal guidance that corporate entities such as McDonald’s could be held accountable for labor violations at restaurants that are technically owned and operated by smaller companies known as franchisees.",
    "“Ultimately, I could not support Mr. Weil because I do not believe that the health and well-being of our small businesses and the employees who rely on their success would be his utmost priority.”\nSen. Patty Murray (D-Wash.), chair of the Senate Committee on Health, Education, Labor and Pensions, said in a statement that she was “incredibly disappointed” by the vote.",
    "In academia, Weil is known for his work on the “fissured workplace” - a term he popularized with a book of the same name - in which the traditional lines of employment have become blurred, through temporary staffing arrangements, franchise agreements and “gig” platforms.",
    "“Tonight’s vote sends a strong signal that Americans and small business owners are tired of overregulation and policies that make it harder to provide for their employees and grow their business,” IFA President and CEO Matthew Haller said in a statement.",
    "His reading of the “joint employer” doctrine - the idea that a firm could be held responsible for the actions of its sub-contractor or franchisee - could open up powerful companies to more liabilities under the Fair Labor Standards Act.",
    "Joe Manchin (D-W.Va.), Kyrsten Sinema (D-Ariz.) and Mark Kelly (D-Ariz.) voted against confirming David Weil to serve as administrator of the Wage and Hour Division, a position he previously held during Barack Obama’s administration.",
    "“David Weil and his work in the last administration were why a whole lot of people got raises.”\nWeil came to the Labor Department in 2014 to lead the Wage and Hour Division under then-Labor Secretary Tom Perez.",
    "In a 2016 interview with HuffPost, Weil explained that when the Labor Department cites a company for wage theft, the recovery of wages tends to be small, amounting to perhaps a few weeks of back pay.",
    "His office developed targeted enforcement programs in which they focused on particular industries, such as hotels and fast food, to investigate minimum wage and overtime violations to recoup wages.",
    "MANDEL NGAN via Getty Images\nWASHINGTON — A trio of conservative Democrats helped Senate Republicans vote down a Labor Department nominee who drew fierce opposition from employer groups.",
    "Weil’s research has shown that these systems have a way of degrading working conditions as corporations become less accountable to the people at the bottom of the chain doing the work.",
    "“I heard from a lot of Arizonans that [while] he had the job during the Obama administration ... there were a lot of concerns,” Kelly told HuffPost on Thursday.",
    "Weil’s track record and previous statements are problematic for many West Virginia employees and business owners,” Manchin said in a statement Thursday.",
    "With Weil’s nomination effectively dead, the Biden administration may try to find a new nominee that will satisfy the more conservative Democrats.",
    "Advertisement\nThe International Franchise Association, a trade group, hailed the three Democrats for tanking Weil’s nomination.",
    "The role enforces minimum wage and overtime law and crafts federal rules that can determine what workers are ultimately paid.",
    "Sen. Joe Manchin and two other conservative Democrats in the Senate helped Republicans vote down a Labor Department nominee.",
    "And it seemed to catch Democrats off guard, as Weil was President Joe Biden’s first nominee to fail in a Senate floor vote.",
    "The rejection of Weil’s nomination is a setback for worker advocates who like to see robust enforcement against employers.",
    "Administrators tend to be more aggressive under Democratic presidents and more hands-off under Republican presidents.",
    "I don’t know what happened, and I’m very, very unhappy with it,” Sen. Sherrod Brown (D-Ohio) said.",
    "The Wage and Hour Division is currently led by Jessica Looman, who serves as acting administrator.",
    "The head of the Wage and Hour Division is basically the top cop for wage theft in the U.S.",
    "Not surprisingly, Weil does not have many fans among the nation’s business lobbies.",
    "“It translates into groceries, a month of rent or the ability to keep up a car.",
    "“Beyond that, people are talking about the restoration of their dignity.",
    "Weil’s nomination failed in a 47-53 procedural vote Wednesday evening.",
    "There’s a notion of justice that comes with it.”",
    "They know they’re being underpaid unlawfully.",
    "But that money is crucial, he explained.",
    "Advertisement\n“It’s terrible.",
    "That’s huge,” Weil said.",
    "Advertisement\n“Mr.",
    "Sens."
  ]
}