{
  "id": 9959,
  "mediaId": 2553,
  "date": "2022-03-31",
  "headline": "Here’s How Members Of Congress Use Inside Information To Make Millions On The Stock Market",
  "image": "https://dw-wp-production.imgix.net/2022/03/v2_Congressional-inside-trading-ban-piece.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/heres-how-members-of-congress-use-inside-information-to-make-millions-on-the-stock-market",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cabot Phillips",
  "authorUrl": "https://www.dailywire.com/author/cabot-phillips",
  "termIds": [
    3246,
    3883,
    3639,
    2459,
    2749,
    1491,
    799,
    1433,
    6456,
    6678
  ],
  "sentences": [
    "High-profile investigations of Sen. Richard Burr (R-NC), then chair of the Senate Intelligence Committee, and former Sen. Kelly Loeffler (R-GA), whose husband is the chair of the New York Stock Exchange, and former Sen. David Perdue (R-GA) for trades timed a little too well during the advent of the pandemic have sparked new calls for legislation.",
    "Inhofe, who chairs the Senate Armed Services Committee, sold up to $750,000 worth of stocks, crediting it to a “continuing divestiture plan.” Feinstein, the ranking member on the Senate Judiciary Committee, reported stock sell-offs in the millions, which she said were done by her husband.",
    "Three in four voters agree that members of Congress should be banned from trading individual stocks while in office, and as a result, multiple bills have been introduced in the House and Senate, though they differ in levels of punishment and specifics on who should be restricted.",
    "But it would seem that many of our elected officials use their positions, and the information their offices afford them, to wield the power of the stock market in their favor — profiting heavily by beating the American people to the punch on the best stock market trades.",
    "When looking at the trading history of our elected officials, there seem to be two possibilities: either our politicians are brilliant traders with a prescient understanding of the stock market… or they’re trading on inside information unavailable to the public.",
    "Burr was also one of three senators who voted against the STOCK Act in 2012 when there was an abundance of evidence that members of Congress were profiting from insider trading through the early 2000s — something quite difficult to prove.",
    "All of those, shall we say unusual trades, have gotten the attention of the general public, and now as outrage is building, so too are the calls for new legislation to ban members from trading individual stocks.",
    "The American people are supposed to believe that her position on the House Committee On Foreign Affairs, which is often in the know on such deals, had nothing to do with the decision to make that trade.",
    "Representative Zoe Lofgren, a Democrat from California, bought up to $15,000 in Lucid electric vehicle stock, right before she co-sponsored a bill offering tax credits for… electric vehicles.",
    "In early 2020, while Americans were losing their jobs and businesses, some senators were raking in millions from the stock market, leaving a bad taste in the mouths of their constituents.",
    "One of the stricter bills was introduced in January by Senators Jon Ossoff (D-GA) and Mark Kelly (D-AZ) and includes the legislators’ spouses and dependent children in the restrictions.",
    "The Stop Trading on Congressional Knowledge Act (or STOCK Act), was passed overwhelmingly in 2012 to deter any member of congress from stock trading with insider knowledge.",
    "Loeffler’s sell-offs, worth up to $3.1 million, began January 24, the same day the Senate Health Committee, of which she was a member, gave an all-member briefing on COVID.",
    "Members have a 45-day grace period to report transactions involving stocks or other securities to the Secretary of the Senate or the Clerk of the House of Representatives.",
    "The lack of transparency surrounding who faces consequences for violations leaves the public almost completely in the dark and renders the STOCK Act a mere virtue signal.",
    "In fact, 57 members and 182 senior-level staffers on both sides of the aisle recently violated the law, offering excuses ranging from ignorance to clerical errors.",
    "Former staffers say there’s virtually no enforcement of the STOCK Act, and no public records currently track who is guilty of a violation and who paid the fines.",
    "Republican Senator Josh Hawley (R-MO) has introduced a similar bill called the Banning Insider Trading In Congress Act, which would have largely the same effect.",
    "One potential reason for the fresh fury is senators who were widely criticized for dumping millions in stocks before the COVID pandemic sunk the stock market.",
    "Nearly 75 lawmakers bought or sold stocks in COVID-19 vaccine manufacturers Moderna, Johnson & Johnson and Pfizer during the early weeks of the pandemic.",
    "An honor system is hardly the way to police a group of people in a profession known for corruption and self-enrichment at the expense of average people.",
    "Two weeks later, it was announced that Lockheed had secured a $10 billion deal with the military to modernize the F-22, and Lockheed’s stock soared.",
    "Burr’s sudden stock sell-off came February 13 in 33 separate transactions to the tune of up to $1.7 million, just days before the market tumbled.",
    "It just so happens that two weeks later, Microsoft’s $10 billion contract with the Department of Defense was canceled and their price plummeted.",
    "She tweeted on March 19 that she doesn’t make investment decisions for her portfolio and wasn’t aware of the sell-off until two weeks after.",
    "House Republican Pat Fallon also happened to sell up to $250,000 in Microsoft stock right before that billion dollar contract fell through.",
    "Either our politicians are brilliant economic minds with an uncanny ability to predict market outcomes and sell at just the right time.",
    "Those who are late to report are supposed to pay a late fee of $200 the first time, with fines increasing if their tardiness continues.",
    "On October 22, Representative Kathy Manning, a Democrat from North Carolina, bought up to $30,000 worth of Lockheed Martin Stock.",
    "Dianne Feinstein and Jim Inhofe also reported large trades around the same time, though they also deny it was related to COVID.",
    "The views expressed in this opinion piece are the author’s own and do not necessarily represent those of The Daily Wire.",
    "It just so happens that 12 days later, Microsoft announced they’d secured a $22 billion contract with the U.S. military.",
    "The punishment for those in violation of the act would be a fine equal to the amount of the member’s entire salary.",
    "Those elected to serve the American people are using inside information to beat the public on stock market trades.",
    "113 congress members, and their families, made an estimated $355 million worth of stock trades at home and abroad.",
    "In America today, some of the most successful and prodigious inside traders are walking the halls of Congress.",
    "Again, the American people are to simply believe that he got lucky and pulled out right before the stock fell.",
    "All must put their stocks and investment assets into a blind trust managed by a neutral party while in office.",
    "The STOCK Act technically requires members to file disclosures and detail financial transactions over $1,000.",
    "Now you might be saying, aren’t there already laws on the books to prevent members from inside trading?",
    "Fifteen lawmakers responsible for shaping U.S. defense policy actively invest in military contractors.",
    "Members of congress are elected to serve the American people — at least, that’s their job description.",
    "In June, Senator Tommy Tuberville, a Republican from Alabama, sold up to $15,000 in Microsoft stocks.",
    "He tweeted on March 20 that he relied solely on “public news reports” to guide his decision to sell.",
    "On March 19, 2021, Speaker Nancy Pelosi and her husband bought up to $3 million in Microsoft stock.",
    "Fallon, I might add, sits on the House subcommittee that oversees… Defense software contracts.",
    "Or, they’re profiting off of information that’s available to them, but not us ordinary people.",
    "More than a dozen Democrats concerned with climate change invest in fossil fuel companies.",
    "It’s time Congress puts the trust of the American people before lining their own pockets.",
    "(His spot on the Senate Armed Services Committee may have helped make him even luckier.)",
    "Sixteen members have stock in tobacco companies, some of whom publicly fight smoking.",
    "This followed Burr publicly expressing confidence in the U.S.’ pandemic response.",
    "Here are just a few examples of some trades that would seem to imply the latter.",
    "So why is this pressure building now, when the problem clearly goes back years?",
    "It’s an inherently unfair scheme, and amounts to no less than insider trading.",
    "So basically, it’s an honor system where members are expected to self-report.",
    "And wouldn’t you know it, that $3 million purchase reaped massive dividends?",
    "Just last year, Congress looked very much like a Wall Street trading desk.",
    "There’s been no confirmation of non-public records of the sort either.",
    "And what is the penalty for violating the STOCK Act, you might ask?",
    "And more often than not, their portfolios swelled with each trade.",
    "And wouldn’t you know it, since then that stock has gone up 71%?",
    "But that hasn’t exactly deterred members from the practice.",
    "According to Nasdaq, she’s now up 160% on that purchase.",
    "The evidence seems ample and apparent.",
    "Essentially, a whopping $200 fine.",
    "Yes, technically.",
    "Sens."
  ]
}