[
  {
    "id": 1022,
    "mediaId": 237,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "Maddock, a fan of Republican gubernatorial contender <span class='selected-term'>James Craig</span>, was in the room with the retired Detroit police chief when he met Trump to pitch an endorsement.",
    "author": "David M. Drucker",
    "title": "Top GOP official in Michigan aiding Trump's bid to install loyalists in Lansing",
    "sentiment": "-0.459"
  },
  {
    "id": 983,
    "mediaId": 43,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "Deshotel instead said, It may be that I end up using the money to support other candidates who I believe can help the state.?\n Friday, Feb 11, 2022  11:56:39 AM Pacific Standard Time  Jeff Singer\nMI-Gov: Blueprint Polling, which describes itself as a sister company? to the Democratic firm Chism Strategies, is out with a survey showing Democratic incumbent Gretchen Whitmer deadlocked 44-44 with former Detroit Police Chief <span class='selected-term'>James Craig</span>.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 2/11",
    "sentiment": "0.0"
  },
  {
    "id": 966,
    "mediaId": 163,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "James Oliphant",
    "title": "Governors' races in 'blue wall' states carry high stakes for voting rights",
    "sentiment": "0"
  },
  {
    "id": 929,
    "mediaId": 19,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Gretchen Whitmer (D) is looking to defend herself against many Republican challengers, including frontrunner <span class='selected-term'>James Craig</span>, who was a strong supporter of the trucker convoys.",
    "author": "Wendell Husebø",
    "title": "Poll: Joe Biden's Approval Rating Is 36 Percent, Impacting Battleground States",
    "sentiment": "0.0"
  },
  {
    "id": 32,
    "mediaId": 261,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "That includes former Detroit Police Chief <span class='selected-term'>James Craig</span>, Oakland County businessman Perry Johnson, Norton Shores businesswoman Tudor Dixon, Ottawa County real estate agent Ryan Kelley, Oakland County pastor Ralph Rebandt, Livingston County evangelist Bob Scott, and Grand Rapids businesswoman Donna Brandenburg.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know",
    "sentiment": "0.0"
  },
  {
    "id": 902,
    "mediaId": 19,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> believes rooting out woke prosecutors? and woke judges? is critical to overcoming nationwide crime waves, providing his view on the matter in an interview on SiriusXM's Breitbart News Saturday.",
    "author": "Ashley Oliver",
    "title": "Exclusive  Chief James Craig Rips Woke Prosecutors': Bad Guys Know There's No Consequences' for Crime",
    "sentiment": "0"
  },
  {
    "id": 884,
    "mediaId": 43,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Governors\n? MI-Gov: Republican Rep. Jack Bergman, whose 1st District covers the Upper Peninsula and northernmost portion of the Lower Peninsula, has switched his endorsement in the August GOP primary from former Detroit Police Chief <span class='selected-term'>James Craig</span> to self-funding businessman Perry Johnson.",
    "author": "",
    "title": "Morning Digest: Trump's man in Georgia keeps flogging election conspiracies as his campaign craters",
    "sentiment": "0.0"
  },
  {
    "id": 865,
    "mediaId": 187,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "It's impossible to predict whether Karamo will defeat the incumbent Democrat Jocelyn Benson, but Michigan is usually closely divided, and Democratic Governor Gretchen Whitmer, atop the ticket, holds only a small polling lead over the GOP challenger, <span class='selected-term'>James Craig</span>.",
    "author": "David A. Graham",
    "title": "The Wackadoodle Wave",
    "sentiment": "0.0"
  },
  {
    "id": 7473,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Brown, as well as financial adviser Michael Markey, former Detroit Police Chief <span class='selected-term'>James Craig</span>, businesswoman Donna Brandenburg and self-described quality guru Perry Johnson, all had signatures that the bureau recommended to be deemed insufficient as many were fraudulent.",
    "author": "",
    "title": "GOP candidates deemed ineligible as massive signature fraud scandal upends Michigan gubernatorial race",
    "sentiment": "-0.403"
  },
  {
    "id": 8357,
    "mediaId": 129,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "The Michigan Bureau of Elections recommended on Monday that <span class='selected-term'>James Craig</span>, a former Detroit police chief, and Perry Johnson, a wealthy businessman, be excluded from the Aug. 2 primary, finding that neither candidate met the requirement of submitting signatures from at least 15,000 registered voters.",
    "author": "",
    "title": "Primary Elections Live Updates: Voters Reject Trump Endorsed Candidates in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 8441,
    "mediaId": 129,
    "date": "5/27/2022 12:00:00 AM",
    "sentence": "The five candidates, half of the party's field, were denied a spot on the Aug. 2 primary ballot by the Board of State Canvassers, including <span class='selected-term'>James Craig</span>, a former Detroit police chief, and Perry Johnson, a wealthy businessman.",
    "author": "",
    "title": "Republican Governors Lose Their Dread of Trump",
    "sentiment": "0.0"
  },
  {
    "id": 8433,
    "mediaId": 169,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "The Michigan Bureau of Elections released a report on Monday recommending that leading Republican gubernatorial candidates <span class='selected-term'>James Craig</span> and Perry Johnson, as well as three others, be disqualified from the ballot after submitting too many fake petition signatures.",
    "author": "Igor Derysh",
    "title": "Embarrassing: Even Republicans fume at Michigan GOP for defending candidates busted for fraud",
    "sentiment": "0"
  }
]