[
  {
    "id": 902,
    "mediaId": 19,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Former Detroit Police Chief <span class='selected-term'>James Craig</span> believes rooting out woke prosecutors? and woke judges? is critical to overcoming nationwide crime waves, providing his view on the matter in an interview on SiriusXM's Breitbart News Saturday.",
    "author": "Ashley Oliver",
    "title": "Exclusive  Chief James Craig Rips Woke Prosecutors': Bad Guys Know There's No Consequences' for Crime",
    "sentiment": "0"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "The few polls that have been released show former Detroit Police Chief <span class='selected-term'>James Craig</span> as Team Red's frontrunner, but he's had to deal with several major campaign shakeups: Craig, most notably, parted ways with his first campaign manager in December, and his second left last month.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid",
    "sentiment": "0.0"
  },
  {
    "id": 865,
    "mediaId": 187,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "It's impossible to predict whether Karamo will defeat the incumbent Democrat Jocelyn Benson, but Michigan is usually closely divided, and Democratic Governor Gretchen Whitmer, atop the ticket, holds only a small polling lead over the GOP challenger, <span class='selected-term'>James Craig</span>.",
    "author": "David A. Graham",
    "title": "The Wackadoodle Wave",
    "sentiment": "0.0"
  },
  {
    "id": 8357,
    "mediaId": 129,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "The Michigan Bureau of Elections recommended on Monday that <span class='selected-term'>James Craig</span>, a former Detroit police chief, and Perry Johnson, a wealthy businessman, be excluded from the Aug. 2 primary, finding that neither candidate met the requirement of submitting signatures from at least 15,000 registered voters.",
    "author": "",
    "title": "Primary Elections Live Updates: Voters Reject Trump Endorsed Candidates in Georgia",
    "sentiment": "0.0"
  }
]