{
  "id": 1130,
  "mediaId": 2746,
  "date": "2022-04-08",
  "headline": "Far-left raising money, laying groundwork to oust Democrat Kyrsten Sinema from Senate",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/11/13/congress_campaign_donations_sinema_10349_c0-237-5265-3308_s1200x700.jpg?99495a3b263a0ec31d6710d0e711e93c3c31ccb9",
  "link": "https://www.washingtontimes.com/news/2022/apr/8/far-left-working-oust-democrat-kyrsten-sinema-sena/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mica Soellner",
  "authorUrl": "https://www.washingtontimes.com/staff/mica-soellner/",
  "termIds": [
    0
  ],
  "sentences": [
    "“It is unacceptable for activist organizations to instruct their members to jeopardize themselves by engaging in unlawful activities such as gaining entry to closed university buildings, disrupting learning environments, and filming students in a restroom,” Ms. Sinema said at the time.",
    "Several political action committees are raising money to build early momentum for a primary challenger against the Arizona Democrat, who has angered her party by helping derail spending plans, an election law overhaul and one of President Biden’s Labor Department nominees.",
    "The latest digital ads from the Primary Sinema showcase a report that she mocked Mr. Biden at a closed-door fundraiser and praised GOP Leader Kevin McCarthy and Rep. Andy Biggs, an Arizona Republican who previously chaired the far-right House Freedom Caucus.",
    "They spent a lot of money already trying to persuade her on Build Back Better and it didn’t work, so I’d be interested to see what they can do,” said Rep. Paul Gosar, Arizona Republican, considered one of the most conservative members of his conference.",
    "Rep. Raul Grijalva, an Arizona Democrat and member of the Congressional Progressive Caucus, said he hasn’t decided on backing a primary challenger to Ms. Sinema yet, but he said there’s frustration with the senator that will likely last until 2024.",
    "“Reports have come out that Kyrsten Sinema marketed herself as ‘anti-tax’ and ‘anti-government’ at a private fundraiser with mostly Republican lobbyists — all while mocking President Biden and praising pro-insurrectionist Republicans.",
    "“Tell Congressman Ruben Gallego to challenge Sinema in the 2024 Democratic primary for U.S. Senate.”\nMr. Gallego previously said he would rather focus on serving in the House before considering a move to the upper chamber.",
    "The Arizona Coalition to End the Filibuster, which helped prompt Emily’s List to pull its support from Ms. Sinema, is urging other donors, including the LGBTQ advocacy group, Human Rights Campaign, to follow suit.",
    "“There’s a while to go before she would have to consider running, but I would say that within the state and outside the state, there’s still going to be dissatisfaction two years from now,” Mr. Grijalva said.",
    "Emily’s List, an influential political action committee that backs pro-choice Democratic women running for office, pulled its support for Ms. Sinema earlier this year, despite having been her biggest donor.",
    "“If Kyrsten Sinema won’t vote to protect us from climate change, to stop the Republican assault on voting rights, and to support the Biden agenda, then we need a senator who will,” its website reads.",
    "Luis Avila, a spokesman for the Primary Sinema PAC, said these were just a few examples that have motivated liberals to seek out a replacement for the senator when she’s up for reelection in 2024.",
    "Run Ruben Run, launched by Nuestro PAC that aims to mobilize Hispanic voters for Democrats, is asking for donations to encourage Rep. Ruben Gallego, Arizona Democrat, to challenge Ms. Sinema.",
    "She recently ripped the administration’s move to end Title 42 — a Trump-era public health policy that allows the U.S. to rapidly expel migrants crossing the border who are seeking asylum.",
    "The group of young activists berated the senator from outside of a bathroom stall, requesting her commitment to a pathway to citizenship for immigrants who are in the country illegally.",
    "In just two years, Ms. Sinema’s favorability among Democrats shrank to the point where she’s become more popular among Republicans than those in her party, according to polls.",
    "The organization cited Ms. Sinema’s stance on keeping the filibuster and thereby preventing Democrats’ voting laws from passing, which it said puts abortion access at risk.",
    "The account was in the new book “This Will Not Pass: Trump, Biden, and the Battle for America’s Future” by The New York Times reporters Jonathan Martin and Alexander Burns.",
    "Since the start of last year, Ms. Sinema’s support among Republicans grew by 20%, when just 35% of Republicans and 67% of Democrats approved of her in early 2021.",
    "A Morning Consult poll from December found 55% of Arizona Republicans approved of the senator, compared to 43% of Democrats and 35% of independents.",
    "“I’m going to do everything in my power to make sure that we actually have somebody in office that listens to us and takes action on our behalf.",
    "“We live in a democracy where we have the power to elect people who best represent us, and she’s not representing us well,” Mr. Avila said.",
    "Ms. Sinema, 45, broke with her party by nixing the Senate filibuster to force through a Democratic overhaul of the nation’s election laws.",
    "This month, Ms. Sinema helped tank Mr. Biden’s nomination of David Weil to head up the Labor Department’s wage and hour division.",
    "Ms. Sinema, along with Sen. Mark Kelly of Arizona and Joe Manchin III of West Virginia, joined Republicans to block Mr. Weil.",
    "She also helped sink President Biden’s $1.75 trillion social welfare and climate bill known as the Build Back Better Act.",
    "A group of protesters last year followed her into a bathroom at Arizona State University where she teaches.",
    "The poll, conducted from Dec. 21, 2021, to Jan. 20, 2022, surveyed 3,787 registered Arizona voters.",
    "Since launching in September 2021, Primary Sinema has raised $415,000 from more than 14,000 donors.",
    "Ms. Sinema’s refusal to fall in line with her party threatens to hurt her campaign fundraising.",
    "Since 2018, Emily’s List was the senator’s largest donor, giving her $405,000 in contributions.",
    "Others in Ms. Sinema’s delegation are being floated as candidates to succeed the senator.",
    "Democratic activists are working to knock out one of their own: Sen. Kyrsten Sinema.",
    "“She’s pretty popular back home, so it’d be very interesting to see [what happens].",
    "I don’t think that’s her right now.”\nTheir effort is proving popular with donors.",
    "Ms. Sinema has been the target of demonstrators in her home state.",
    "Ms. Sinema did not respond to a request for comment.",
    "You just can’t make this stuff up,” one ad reads.",
    "It had an error margin of +/-2%.",
    "“There could be a primary.”"
  ]
}