{
  "id": 1160,
  "mediaId": 2547,
  "date": "2022-04-09",
  "headline": "Paul Gosar Is GOP's Designated White Nationalist",
  "image": "https://crooksandliars.com/files/primary_image/22/04/fptsiaux0aqb62g.jpg",
  "link": "https://crooksandliars.com/2022/04/rep-paul-gosar-headline-white-nationalist",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Scarce",
  "authorUrl": "https://crooksandliars.com/team/ed-scarce",
  "termIds": [
    1299,
    1926,
    2631,
    3242,
    692,
    878,
    1163,
    1192,
    5261
  ],
  "sentences": [
    "The American Populist Union is closely aligned with groypers, a group of white nationalists who strive for their ideas to become a part of the Republican mainstream and are largely followers of 23-year-old white nationalist Nick Fuentes.",
    "Prescott Republican Congressman Paul Gosar was listed as a “special guest” with the white nationalist American Populist Union at an event that will be on a date popular among white nationalists and Neo-Nazis: Hitler’s birthday.",
    "But Gosar’s campaign says he isn’t attending and it doesn’t know how he was listed as a guest of honor, even though Gosar promoted his scheduled appearance on social media.",
    "He distanced himself from Fuentes, telling Politico that the young Holocaust-denying racist “has a problem with his mouth.”\nSome stories from recent history.",
    "Earlier this month, Gosar said his March video message to attendees of AFPAC was the fault of a staffer who sent his video message to the wrong group.",
    "Gosar's campaign now says he's not attending the event with the white nationists American Populist Union, though he was listed as \"Featured Guest.\"",
    "Instead he said Gosar has a \"farm tour\" scheduled for that day and that APU never contacted Gosar, his staff or his campaign.",
    "In 2021, Gosar was the first elected official to speak at Fuentes’ America First Political Action Conference in 2021.",
    "The American Populist Social will be held in Tempe on April 20, a date revered by white supremacists and Neo-Nazis.",
    "Gosar's office previously did not respond to me b4 pub\n— Jerod MacDonald-Evoy (@JerodMacEvoy) April 7, 2022",
    "Oh...\nUPDATE: Gosar's campaign consultant reached out and said that he would not be attending this event.",
    "This year, the conference saw speeches by Gosar, Rogers and U.S. Rep. Marjorie Taylor Greene.",
    "They could also not explain how the event was promoted on Gosar's Instagram page.",
    "And on Hitler's birthday, no less.",
    "I mean, how could that happen?",
    "Funny, isn't it?",
    "Curious, right?"
  ]
}