{
  "id": 1175,
  "mediaId": 2636,
  "date": "2022-04-05",
  "headline": "Ivanka Trump Testifies to House Panel Investigating Jan. 6 Attack",
  "image": "https://static01.nyt.com/images/2022/04/05/us/politics/00dc-invanka/merlin_176288961_5f1d4ae0-80c4-4eca-884d-e660d8e7413b-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/05/us/politics/ivanka-trump-jan-6.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luke Broadwater",
  "authorUrl": "https://www.nytimes.com/by/luke-broadwater",
  "termIds": [
    1524,
    2117,
    2201,
    2737,
    2851,
    2906,
    3731,
    3975,
    4109,
    1163
  ],
  "sentences": [
    "The judge, David O. Carter of the Central District of California, wrote that Mr. Eastman’s memo might have been “the first time members of President Trump’s team transformed a legal interpretation of the Electoral Count Act into a day-by-day plan of action.”\n“The draft memo pushed a strategy that knowingly violated the Electoral Count Act, and Dr. Eastman’s later memos closely track its analysis and proposal,” the judge wrote.",
    "“There won’t be a subpoena,” Mr. Thompson said, adding, “We’ve been able to validate a lot of the statements attributed to President Trump and the vice president without his specific testimony.”\n“There’s no effort on the part of the committee to get him to come in,” he said of Mr. Pence, adding: “We initially thought it would be important, but at this point we know that people broke in here and wanted to hang him.",
    "It was not immediately clear how revelatory her testimony was for the committee, but those familiar with the interview said Ms. Trump did not seek to invoke any privilege — such as executive privilege or the Fifth Amendment, as other witnesses have done — and broadly, if not garrulously, answered the panel’s questions.",
    "Mr. Kellogg also testified that he and Ms. Trump had witnessed a telephone call in the Oval Office on the morning of Jan. 6 in which Mr. Trump pressured Mr. Pence to go along with a plan to throw out electoral votes for Joseph R. Biden Jr. when Congress met to certify the Electoral College results.",
    "WASHINGTON — Ivanka Trump, former President Donald J. Trump’s elder daughter, who served as one of his senior advisers, testified for about eight hours on Tuesday before the House committee investigating the Jan. 6 attack on the Capitol, according to people familiar with the matter.",
    "In an explosive court ruling that found Mr. Trump and Mr. Eastman “likely” committed federal crimes as they fought the 2020 election results, a federal judge in California ordered Mr. Eastman last week to turn over the documents — a decision Mr. Eastman said he would not fight.",
    "Ms. Trump was one of several aides who tried to persuade the president to call off the violence that ultimately injured more than 150 police officers and sent lawmakers and Vice President Mike Pence fleeing for safety, according to evidence gathered by the committee.",
    "“The memo is both intimately related to and clearly advanced the plan to obstruct the joint session of Congress on Jan. 6, 2021.”\nCapitol Riot’s Aftermath: Key Developments\nThe committee has interviewed more than 800 witnesses and plans to interview dozens more.",
    "Her testimony came days after her husband, Jared Kushner, who was also a top adviser to Mr. Trump, sat for an interview and provided what one member of the panel described as “valuable” and “helpful” information.",
    "Mr. Kellogg had described Mr. Trump’s refusal to condemn the violence as the mob engulfed the Capitol, despite White House officials — including Ms. Trump, at least twice — urging him to do so, the letter said.",
    "She is not known to have been associated with the more extreme supporters of the former president who spread lies about widespread fraud after the 2020 election and planned efforts to try to keep him in power.",
    "“There were some things revealed, but we’ll just share that a little later,” Representative Bennie Thompson, Democrat of Mississippi and the chairman of the committee, said of Mr. Kushner’s testimony.",
    "Also on Tuesday, the committee said it had received 101 documents that the conservative lawyer John Eastman had tried to withhold, arguing that they were covered by attorney-client privilege.",
    "Mr. Kellogg testified that the president had rejected entreaties from him as well as from Mark Meadows, his chief of staff, and Kayleigh McEnany, the White House press secretary.",
    "Among the documents is a draft memo written for Rudolph W. Giuliani, Mr. Trump’s personal lawyer, that recommended Mr. Pence reject electors from contested states on Jan. 6.",
    "Mr. Thompson said the committee had ruled out a subpoena for Mr. Pence, citing “significant information” it had received from two of his aides, Marc Short and Greg Jacob.",
    "In the letter, dated Jan. 20, the committee said it had heard from Keith Kellogg, a retired lieutenant general who was Mr. Pence’s national security adviser.",
    "Ms. Trump’s lawyers have been in talks with the committee since January, when it sent her a letter requesting voluntary testimony.",
    "Mr. Kellogg told the committee that the president had accused Mr. Pence of not being “tough enough” to overturn the election.",
    "The call to Mr. Pence was part of an effort to invalidate the 2020 election and give Mr. Trump a chance to stay in office.",
    "So what is it we need?”\nMr. Thompson also indicated that the panel would not be likely to call Mr. Trump as a witness.",
    "Ms. Trump and Mr. Kushner are among the highest-ranking Trump White House officials to testify before the committee.",
    "“I don’t know anything else we could ask Donald Trump that the public doesn’t already know,” Mr. Thompson said.",
    "Mr. Thompson told reporters on Monday that he had authorized five additional subpoenas that day.",
    "We know that his security detail had to protect him in an undisclosed location in the Capitol.",
    "We know the people who tried to get him to change his mind, about the count and all of that.",
    "The interviews have been closed to the public as the panel conducts its work in secret.",
    "Ms. Trump then said to Mr. Kellogg, “Mike Pence is a good man,” Mr. Kellogg testified.",
    "“She went back in, because Ivanka can be pretty tenacious,” Mr. Kellogg testified.",
    "Mr. Kellogg then appealed to Ms. Trump to intervene.",
    "“He ran his mouth for four years.”"
  ]
}