{
  "id": 1200,
  "mediaId": 2594,
  "date": "2022-04-02",
  "headline": "Paul Gosar blames video appearance at white nationalist conference on staff error",
  "image": "https://static.independent.co.uk/2021/06/17/19/GettyImages-1232844431.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/paul-gosar-white-nationalist-conference-b2049591.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gustaf Kilander",
  "authorUrl": "https://www.independent.co.uk/author/gustaf-kilander",
  "termIds": [
    1926,
    3242,
    3267,
    275,
    878,
    1163,
    4984,
    5371
  ],
  "sentences": [
    "House Minority Leader Kevin McCarthy has said that he would meet with both Ms Greene and Mr Gosar to discuss their part in the event, but Mr Gosar pushed back on the idea on Friday, asking “Why would I?”\nHe said he sent the video to Mr McCarthy and explained what happened.",
    "Arizona Republican Representative Paul Gosar has blamed his video appearance at a conference organised by a white nationalist last month on a staff error prompted by “miscommunication”.",
    "Georgia Republican Representative Marjorie Taylor Greene spoke in person at Mr Fuentes’ America First Political Action Conference, while Mr Gosar sent a video to the event.",
    "Mr Gosar said that he will no longer work with event organizer Nick Fuentes – a far-right white nationalist commentator who has used racist and antisemitic rhetoric.",
    "Mr Gosar said the American Principles and the Conservative Political Action Conference (CPAC), were “authorized” to receive the video, but not America First.",
    "“And there was miscommunication.”\nHe spoke in person at the event last year but rejected the notion that sending in a video meant any involvement this year.",
    "“The young people that were being misled by somebody – we should be trying to mentor, trying to change them,” he told Politico.",
    "Mr Gosar said he and Ms Greene “didn’t know anything about the group” before they attended the event in person a year apart.",
    "He said an employee “misconstrued” instructions from Mr Gosar’s chief of staff.",
    "He said the video was supposed to be sent to other groups as a “welcome video”.",
    "Both CPAC and America First took place in Orlando, not Miami, Politico noted.",
    "The video “wasn’t supposed to go to Nick’s group,” Mr Gosar told Politico.",
    "He said the video “just basically said ‘welcome to the Miami area.",
    "“So there is nothing there,” he told the outlet.",
    "The United States is at a crisis point’”.",
    "“We’re kind of short-handed,” he added.",
    "“I’ve given up … on dealing with Nick.",
    "Nick’s got a problem with his mouth.”",
    "Have a great conference."
  ]
}