{
  "id": 1213,
  "mediaId": 2547,
  "date": "2022-03-31",
  "headline": "GOP Insiders Want You To Think Ginni Thomas Is An Incompetent Hack",
  "image": "https://crooksandliars.com/files/primary_image/22/03/ginni_kitchen_pink_phone2.jpg",
  "link": "https://crooksandliars.com/2022/03/ginny-thomas-incompetent-hack",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve M.",
  "authorUrl": "https://crooksandliars.com/team/steve-m",
  "termIds": [
    2201,
    2442,
    3828,
    4462,
    874,
    878,
    5371,
    5390
  ],
  "sentences": [
    "And another:\nSubject: Please take time to listen to Joe diGenova about the weaponization of law enforcement and intelligence to protect HRC and destroy DJT\nBeyond the #SchumerShutdown....Please take time to listen and pass on this compelling Joe diGenova video, which is going pretty dang viral today (from my standards)!",
    "So if \"people in the various precincts of Conservatism Inc.\" have contempt for Ginni Thomas, that means they think their voters are gullible simpletons, too, because those voters eagerly swarm to suck up this chum just the way she does, and therefore the smart folks of Conservatism Inc. keep tossing it out.",
    "I wish I had a nickel for every time I’ve heard people in the various precincts of Conservatism Inc. laugh about the self-important preening, unserious dabbling, and incompetent hackery of Ginni Thomas over the years—in the wistful way a butler might indulge a wealthy child.",
    "Last tells us that \"the bizarre capitalization and punctuation,\" as well as Thomas's \"obsession with talk radio and her genuflection before grifters like [James] O’Keefe, Clarke, and diGenova,\" make it clear that she's nothing more than a gullible simpleton.",
    "Throw in some CRT, some gay- and trans-bashing, some COVID denialism, and some talk about Hunter Biden's laptop -- all of which Ginni is on board with, I'm sure -- and this is all Republican have to offer their base.",
    "Please consider helping more eyes and ears use this video interview to absorb what Milwaukee Sheriff David Clarke is saying about Trump, America, the media and what is needed right now....",
    "The only reason she was texting the president’s chief of staff instead of being the angry cat lady on Facebook is because she married a man who got himself appointed to the Supreme Court.",
    "... what we’re dealing with isn’t an intellectual, or even a smooth operator, but a Boomer with an internet connection, an important spouse, and too much time on her hands.",
    "The bad news is that they keep pumping it out regardless, because dividing America by making half of its voters angry and ignorant is good for Republican elitists' careers.",
    "Please listen to Rush Limbaugh's amazing call screener, James Golden, AKA \"Bo Snerdley\" on the NFL flap, white privilege and the Republican Congress!",
    "The sort-of-good news is that powerful Republicans are smart enough not to believe the bilge they pump out 24 hours a day, 365 days a year.",
    "Ginned-up culture-war claptrap of the kind that Ginni Thomas promotes in these emails is the entire Republican message to voters.",
    "I don't believe that all high-profile conservatives understand that this is just nonsense intended to gull the rubes.",
    "Jonathan Last of The Bulwark tells us that we're taking Ginni Thomas much more seriously than Republican insiders do.",
    "... Traffic today keeps the post up high where it gets natural traffic at Daily Caller, and THIS IS EDUCATIONAL!!",
    "Here's another:\nSubject: Rush Limbaugh’s Bo Snerdley Takes On NFL Protests And White Privilege\nWOW!",
    "Which tells you what the Republican insiders who mock Ginni Thomas think of their own voters.",
    "Here is a secret no one in Washington is willing to say out loud: Ginni Thomas is an idiot.",
    "Here's a famous name on the right who takes this kind of thing seriously: Donald Trump.",
    "As Exhibit A, Last reproduces emails Thomas sent to some right-wing listservs.",
    "... Would love your help on social media with getting it heard by others too!",
    "Literally everyone in conservative Washington knows this about her...",
    "One reads in part:\nSubject: WOW - Milwaukee Sheriff David Clarke!!!",
    "And in the next few years, the list will just grow and grow.",
    "Kari Lake, who might be the next governor of Arizona.",
    "Here's another: Donald Trump Jr. Also: Sarah Palin.",
    "Republished from No More Mister Nice Blog.",
    "Marjorie Taylor Greene.",
    "Paul Gosar.",
    "Well read.",
    "Inspiring.",
    "Topics:",
    "..."
  ]
}