{
  "id": 1253,
  "mediaId": 2590,
  "date": "2022-04-07",
  "headline": "Rep. Paul Gosar Was Scheduled To Attend Far-Right Event On Hitler's Birthday: Report",
  "image": "https://img.huffingtonpost.com/asset/624f02f5240000e59c96e9bf.jpeg?cache=cvVFzSm7ej&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/paul-gosar-scheduled-to-attend-far-right-event-hitler-birthday_n_624ef940e4b0d8266ab6a58d",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sebastian Murdock",
  "authorUrl": "",
  "termIds": [
    1768,
    1926,
    3242,
    878,
    1029
  ],
  "sentences": [
    "Advertisement\nHours after publishing its report, a representative for Gosar’s campaign told the Arizona Mirror that the congressman had a “farm tour” scheduled the day of the event, and that the American Populist Union never contacted Gosar or his campaign about being a featured guest at the event.",
    "Following Gosar’s apparent denial that he was set to attend the American Populist Union event, a white nationalist organizer for the group told The Washington Post in a statement that “there seems to be a misunderstanding and scheduling conflict” with the congressman’s office.",
    "The Arizona Republican was set to be a “featured guest” at an event hosted by the American Populist Union, a far-right group aligned with the white nationalist “groypers,” who are largely followers of Holocaust denier Nick Fuentes, the Arizona Mirror first reported Wednesday.",
    "https://t.co/ziN7PLGGHi pic.twitter.com/Vf1ztd4XxE\n— AZ Right Wing Watch (@az_rww) April 7, 2022\nGosar has routinely cozied up to white nationalists only to later feign ignorance when called out for it.",
    "Advertisement\nFollowing Gosar’s video and Greene’s attendance at the event, House Minority Leader Kevin McCarthy (R-Calif.) described their participation as “appalling,” then dropped the issue entirely.",
    "Fuentes later said on a livestream that he and his followers would continue to work with Gosar “behind the scenes.”\n“We’re staunch allies of him and he’s been a staunch ally of ours,” Fuentes said.",
    "In 2021, Gosar attended the America First Political Action Conference in Florida, a white nationalist gathering led by Fuentes, a white supremacist with a legion of racist followers.",
    "Rep. Paul Gosar was reportedly scheduled to attend a far-right conference with ties to white nationalists the day of Adolf Hitler’s birthday before his campaign appeared to back out.",
    "When confronted by reporters, Gosar gave the excuse that the video “wasn’t supposed to go to Nick’s group” and instead a staffer “misconstrued” directions from his chief of staff.",
    "At this year’s AFPAC conference, which was also attended by extremist Rep. Marjorie Taylor Greene (R-Ga.), Gosar sent a video message.",
    "The event was scheduled for April 20, a date that is celebrated among neo-Nazis and white supremacists as Hitler’s birthday.",
    "However, Gosar himself promoted the event on his Instagram story, according to a screenshot captured by AZ Right Wing Watch.",
    "Following Gosar’s keynote speech at the conference, members of the crowd chanted his name.",
    "The GOP didn’t care when Gosar attended in 2021.",
    "Then why’d he advertise it on his Instagram?",
    "Advertisement",
    "??"
  ]
}