{
  "id": 1289,
  "mediaId": 2514,
  "date": "2022-04-09",
  "headline": "CNN: Trump Jr. text shows ideas to overturn 2020 election",
  "image": "https://s.yimg.com/ny/api/res/1.2/DFfNdsdJTp2cp2JN7BcZOA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/i.ucaaqF0JMWE_ykTFfLbQ--~B/aD0yODk5O3c9NDM0ODthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/b564a42ed94831c513d3ed32ed5b4672",
  "link": "https://www.aol.com/news/cnn-trump-jr-text-shows-005959322-201630022.html",
  "mediaOutlet": "AOL",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The cable news network reported that Trump Jr.'s text made “specific reference to filing lawsuits and advocating recounts to prevent certain swing states from certifying their results.” It also suggested that if those measures didn't work, lawmakers in Congress could dismiss the electoral results and vote to keep President Trump in office.",
    "In a statement through his attorney, Alexander said the subpoena was seeking information about the “Save America Rally” that was held at the Ellipse — hosted by the pro-Trump nonprofit organization called Women for America First — which thousands had attended before a surge of Trump supporters stormed into the Capitol on Jan. 6.",
    "In court documents, Alexander’s lawyers have said he told congressional investigators that he remembers having “a few phone conversations” with Rep. Paul Gosar, R-Ariz., and had exchanged some text messages with Rep. Mo Brooks, R-Ala., in the run-up to the Jan. 6 rallies.",
    "Separately on Friday, Ali Alexander, a conservative activist who helped found the “Stop the Steal” movement, said he had received a subpoena to provide testimony to a federal grand jury as part of the Justice Department’s wide investigation into the insurrection.",
    "It reportedly laid out strategies that then-President Donald Trump's team pursued in the following months as they disseminated misinformation about election fraud and pressured state and federal officials to assist in that effort.",
    "Alexander voluntarily appeared for hours in December before the House panel investigating the insurrection, providing congressional investigators with a slew of documents and information about his communications with lawmakers.",
    "WASHINGTON (AP) — Donald Trump Jr. texted White House chief of staff Mark Meadows two days after the 2020 presidential election with strategies for overturning the result if Trump's father lost, CNN reported Friday.",
    "Given the date, this message likely originated from someone else and was forwarded.”\nCNN said the Trump Jr. text had been obtained by the House committee investigating the Jan. 6, 2021, assault on the U.S. Capitol.",
    "“I don’t believe I have information that will be useful to them but I’m cooperating as best I can further reiterating that I’m not a target because I did nothing wrong,” he said.",
    "\"I denounce anyone who planned to subvert my permitted event and the other permitted events of that day on Capitol grounds to stage any counterproductive activities.”",
    "Trump Jr.’s lawyer Alan S. Futerfas, in a statement Friday to CNN, said: “After the election, Don received numerous messages from supporters and others.",
    "“I did nothing wrong and I am not in possession of evidence that anyone else had plans to commit unlawful acts,” Alexander said.",
    "In the last week, the committee has interviewed former President Trump’s daughter Ivanka Trump and her husband, Jared Kushner.",
    "Their virtual testimonies are the closest lawmakers have gotten to the former president.",
    "The text was sent two days before Joe Biden was declared the winner, according to CNN."
  ]
}