{
  "id": 1339,
  "mediaId": 2679,
  "date": "2022-04-08",
  "headline": "Pro-Trump rally planner is cooperating in Justice Dept.’s Jan. 6 inquiry",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/pro-trump-rally-planner-is-cooperating-in-justice-dept-s-jan-6-inquiry/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ALAN FEUER",
  "authorUrl": "https://www.seattletimes.com/author/cap-alan-feuer/",
  "termIds": [
    0
  ],
  "sentences": [
    "In court papers released after the hearing, Donohoe admitted that several leaders and members of the Proud Boys had discussed using “force and violence” to disrupt the certification of the 2020 election “to show Congress that ‘we the people’ were in charge.”\nAdvertising\n Skip AdSkip AdSkip Ad\nThe papers also say that the Proud Boys were discussing storming the Capitol before going to Washington in January and that Donohoe believed the attack on the building “would achieve the group’s goal of stopping the government from carrying out the transfer of presidential power.”\nOne subject that Alexander might help prosecutors better understand is the bitter rivalries that often divided the small group of planners that put together pro-Trump events in Washington after the election.",
    "Advertising\n Skip Ad\n“We four schemed up of putting maximum pressure on Congress while they were voting,” Alexander said in a since-deleted video posted online, “so that who we couldn’t lobby, we could change the hearts and the minds of Republicans who were in that body, hearing our loud roar from outside.”\nAlexander declined to answer any questions about his ties to the White House or members of Congress.",
    "While it remains unclear what Alexander might tell the grand jury, he was intimately involved in the sprawling effort to mount political protests challenging the results of the election and had contacts with other organizers, extremist groups, members of Congress and, according to the House committee investigating Jan. 6, White House officials during the period after Election Day.",
    "Ali Alexander, a prominent organizer of pro-Trump events after the 2020 election, has agreed to cooperate with the Justice Department’s investigation of the attack on the Capitol last year, the first high-profile political figure known to have offered assistance to the government’s newly expanded criminal inquiry.",
    "Advertising\n Skip AdSkip AdSkip Ad\nThe grand jury subpoena Alexander received suggests that prosecutors have greatly widened the scope of their inquiry to include not only people who were at the Capitol but also those who organized and spoke at pro-Trump events in November and December 2020 and on Jan. 6, 2021.",
    "In an indication that the inquiry could reach into the Trump administration and its allies in Congress, the subpoena also seeks information about members of the executive and legislative branches who were involved in the events or who may have helped to obstruct the certification of the 2020 election.",
    "The grand jury empaneled by federal prosecutors is looking into a wide range of issues surrounding former President Donald Trump’s efforts to overturn the results of the election, after months in which the Justice Department focused on rioters directly involved in the storming of the Capitol.",
    "Alexander took part in two Stop the Steal rallies in Washington that preceded the former president’s event at the Ellipse, near the White House, on Jan. 6 — one on Nov. 14, 2020, and the other a few weeks later on Dec. 12 — as well as events in the key swing state of Georgia in December.",
    "When he testified to the committee, Alexander told congressional investigators that he faulted poor planning by organizers like Amy Kremer and her daughter Kylie Kremer, who ran a group called Women for America First that helped set up Trump’s event at the Ellipse.",
    "Speaking through a lawyer, Alexander said Friday that he had recently received a subpoena from a federal grand jury that is seeking information on several broad categories of people connected to pro-Trump rallies that took place in Washington after the election.",
    "Alexander said through his lawyer that in the run-up to Jan. 6, he spoke with Stone about “logistics” and the “warring factions” of organizers, and provided the House committee with all of his communications with Stone on the day of the Capitol attack.",
    "In the run-up to those gatherings, Alexander came into contact with a host of rally organizers and with right-wing groups like the Oath Keepers militia and the 1st Amendment Praetorian that provided both public and personal security at the events.",
    "He arrived, as he put it in his prepared remarks to the House committee, “in the early stages of the lawbreaking.”\nBut Friday, he insisted through his lawyer that he had not observed any crimes being committed during the planning of the rally.",
    "While Alexander is the first pro-Trump political organizer to acknowledge his cooperation with the government, several far-right militants, including members of the Oath Keepers, have also reached cooperation deals with prosecutors.",
    "Those Oath Keepers working with the government could help prosecutors with the sprawling seditious conspiracy case that was filed in January against the Oath Keepers’ founder, Stewart Rhodes, and 10 other members of the group.",
    "At a court hearing in Washington on Friday, a leader of a North Carolina chapter of the Proud Boys also announced that under a plea deal with the government, he would cooperate with the Justice Department’s investigation.",
    "“I do not denounce this.”\nIn his statement Friday, Alexander said the video did not include remarks he had made that day specifying that he was speaking only of the protesters approaching the Capitol grounds.",
    "Most Read Nation & World Stories\nAlexander might also be able to shed light on some of the activities on Jan. 6 of a man he considers to be something of a mentor: Roger Stone, a longtime adviser to Trump.",
    "In early December, Alexander voluntarily sat for a deposition with the House committee and gave it a trove of documents that helped shed light on the activities that preceded the Capitol attack.",
    "In a statement from the lawyer, Alexander said he was taking “a cooperative posture” with the Justice Department’s investigation but did not know what useful information he could give.",
    "He said, for example, that leaders of the Ellipse event removed instructions from their program telling attendees exactly where to go and what to do after the gathering concluded.",
    "Sponsored\n Skip Ad\n Skip Ad\n Skip Ad\n Skip Ad\n“I did nothing wrong, and I am not in possession of evidence that anyone else had plans to commit unlawful acts,” his statement said.",
    "In the days and weeks before that rally, he was in touch with people in the White House and members of Congress, according to the House committee’s letter seeking his deposition.",
    "Alexander has said that he, along with Reps. Mo Brooks of Alabama, Paul Gosar of Arizona and Andy Biggs of Arizona, all Republicans, helped set the events of Jan. 6 in motion.",
    "After the building had been breached, Alexander posted a video of himself on social media watching the crowd march on the Capitol from a terrace a few blocks away.",
    "That day, Alexander attended Trump’s speech at the Ellipse, then marched with the crowd toward the Capitol, along with conspiracy theorist Alex Jones of Infowars.",
    "“I disavow and denounce anyone who in any way planned to occupy buildings or engage in violence on Jan. 6.”\nThis story was originally published at nytimes.com.",
    "The Proud Boys leader, Charles Donohoe, was charged in a conspiracy case with five other Proud Boys, including the organization’s former chair, Enrique Tarrio.",
    "He also declined to discuss whether he came up with the idea of marching to the Capitol himself or the notion emerged from conversations with others.",
    "Alexander also had a permit for an event on the east side of the Capitol on Jan. 6 that never took place because of the violence that erupted.",
    "In the statement from his lawyer, he said he did not “coordinate any movements” with far-right extremist groups at his events.",
    "“I don’t disavow this,” he said in the video, which was preserved by the organization Right Wing Watch.",
    "He also disavowed anyone who took part in or planned violence on Jan. 6.",
    "And he reiterated that he did not support violence.",
    "“I want to be clear now,” he said in his statement.",
    "Read it here."
  ]
}