{
  "id": 140,
  "mediaId": 2547,
  "date": "2022-04-10",
  "headline": "Don't Hold Back When Interviewing Moscow Mitch, Axios",
  "image": "https://crooksandliars.com/files/embeds/2022/04/49963.jpg",
  "link": "https://crooksandliars.com/2022/04/good-interview-it-could-have-been-tougher",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve M.",
  "authorUrl": "https://crooksandliars.com/team/steve-m",
  "termIds": [
    0
  ],
  "sentences": [
    "I would have liked to hear McConnell respond to that question because I know that he and nearly all his fellow Republicans approach politics as if there's no greater evil on earth than being a Democrat -- but most members of the press corps and most voters (not to mention most D.C. Democrats) don't believe that's how Republicans think and operate.",
    "I appreciate this effort by Axios's Jonathan Swan:\nSwan didn't get McConnell to acknowledge his own moral bankruptcy, but he shone a bright spotlight on it:\nSwan pressed McConnell on one of the biggest incongruences between Republicans repudiating Trump and then turning around and supporting him.",
    "Swan persisted:\nSWAN: Liz Cheney, who has the same view [as] yours of January 6, she said she doesn't want Donald Trump anywhere near the White House, and she's going to work to not make that happen, because she thinks that there are some things more important than party loyalty.",
    "(At one point he said, testily, “Do you want to spend some more time on this?”) The interview was not as brutal as it could have been, but it wasn't the \"we're chums and this is just a game\" nonsense we get from many insiders who interview cutthroat Republican leaders.",
    "I wish he'd asked,\nSo what I think you're saying is that it doesn't matter whether the Republican nominee for president is morally repugnant because it's categorically impossible for a Republican to be more morally repugnant than literally any Democrat.",
    "Republished with permission from No More Mister Nice Blog\nTopics:\nFor 17 years we have been exposing Washington lies and untangling media deceit, but now Facebook is drowning us in an ocean of right wing lies.",
    "In February 2021, after Trump’s second impeachment trial, McConnell delivered a remarkable indictment of the former president (even while voting against his conviction, citing what he deemed a technicality).",
    "He called it a “disgraceful dereliction of duty.”\nBut less than two weeks later, McConnell was asked whether he would vote for Trump again if Trump were the 2024 GOP nominee.",
    "Swan began the exchange by asking the famously bare-knuckled Republican leader where he draws his “moral red lines.”\n... why did McConnell say he would vote for Trump anyway?",
    "I'm just actually trying to understand, like, is there any threshold for you of what --\nMcCONNELL: Well, you know, I say many things I'm sure people don't understand.",
    "“As a Republican leader of the Senate, it should not be a front-page headline that I will support the Republican nominee for president,” McConnell said.",
    "Because we really can't rule out the possibility that any one of these people might be the GOP's candidate for president in the foreeeable future.",
    "But I wish Swan had moved on from Trump to ask McConnell about the meaning of his statement that his support for the GOP nominee is automatic.",
    "He blasted Trump for not quelling the unrest — instead watching it unfold “happily” — and leaving Vice President Mike Pence in danger.",
    "I think it’s astonishing.”\n“I think I have an obligation to support the nominee of my party, and I will,” McConnell said.",
    "And Axios's readership is probably not ready to acknowledge the depths of the Republican Party's depravity.",
    "McConnell would probably say that there's no point in responding to a ridiculous series of hypotheticals.",
    "I also wish Swan had asked McConnell whether he'd support any future Republican presidential nominee.",
    "Please give a one-time or recurring donation, or buy a year's subscription for an ad-free experience.",
    "He said that Trump had, for all intents and purposes, incited an attack on the U.S. Capitol.",
    "If you don't mind the ads and would rather donate, please select one of the options below:",
    "SWAN: No, but I'm not trying to -- I really -- it's not a gotcha.",
    "The barrel has no bottom, and the party's voters just want rage.",
    "McCONNELL: Well, maybe you ought to be talking to Liz Cheney.",
    "Swan was genuinely exasperated, and McConnell seemed peeved.",
    "Swan interjected: “After you said that?",
    "But we need to confront this sometime.",
    "Is that what you're saying?",
    "Marjorie Taylor Greene?",
    "And he said yes.",
    "Steve Bannon?",
    "Mike Lindell?",
    "Nick Fuentes?",
    "Mike Flynn?",
    "Paul Gosar?",
    "Thank you."
  ]
}