{
  "id": 1413,
  "mediaId": 2627,
  "date": "2022-04-03",
  "headline": "Madison Cawthorn is running out of chances with the GOP",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_13/3545013/220331-madison-cawthorn-cpac-an.jpg",
  "link": "https://www.msnbc.com/opinion/msnbc-opinion/why-madison-cawthorn-s-orgies-claim-has-gop-edge-n1293884",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hayes Brown",
  "authorUrl": "https://www.msnbc.com/author/hayes-brown-ncpn1243020",
  "termIds": [
    0
  ],
  "sentences": [
    "Naval Academy (he had already been rejected by then); that a friend who was driving had left him to die (his friend actually pulled him from the wreckage); that he’d worked full time as a staffer for Rep. Mark Meadows, R-N.C., whose seat he won (he’d only worked part time, one of his few jobs before being elected); that he’d been accepted to Princeton and Harvard (he later admit that he hadn’t).",
    "House Minority Leader Kevin McCarthy, R-Calif., spoke with Cawthorn on Wednesday, later saying he’d told the 26-year-old that he had “lost my trust.”\nMcCarthy has been loath to rein in even his most incendiary members, like Reps. Marjorie Taylor Greene of Georgia or Paul Gosar of Arizona — so why did this tale, which Cawthorn recanted, actually draw a rebuke?",
    "And let’s not forget that just prior to the “coke-and-orgies” scandal, he drew fire from his fellow Republicans for call Ukrainian President Volodymyr Zelenskyy a “thug” who supports “woke ideologies.” He also in that same week was charged with driving with a revoked license.",
    "Even in an era in which Trump has shown that it’s possible to include a lie in basically every sentence with no consequences, Cawthorn’s habit of exaggeration, fabrication and outright damaging statements has become a headache.",
    "Cawthorn was given a speaking slot at the 2020 Republican National Convention and positioned to be a rising star in the party, one who could defuse the “generational time bomb” that Republicans potentially face.",
    "In multiple interviews as a candidate, he listed health care as one of the issues most important to him, citing the medical debt he accrued as a result of the car crash that necessitated his use of a wheelchair.",
    "“I think driving without a license is saying, ‘I can do what I want, the law doesn’t pertain to me.’ That’s not the kind of person I want representing me,’’ one former supporter told The New York Times.",
    "Cawthorn has also raised a prodigious amount of money, but spent it almost as fast as it’s come in, not on GOP candidates in tough races but on things like travel despite being in a safe district.",
    "He’s attempted to switch congressional districts to have an easier re-election run, snubbing the speaker of the state House in the process and the people who put him in office.",
    "And unlike Greene, whose endorsement is actively sought this primary season, and Gosar, who has allies among the hard-right Freedom Caucus, Cawthorn is left out on his own.",
    "Only three of the bills he’s submitted are related to health care — one, introduced last month, deals with telehealth services; the other two would limit vaccine mandates.",
    "Cawthorn is now on the outs with most of his colleagues in the House after suggesting that he’d been offered cocaine and invited to orgies since arriving in Washington.",
    "Unlike Greene and Gosar, Cawthorn hasn’t shown himself to be worth the aggravation that he’s caused the GOP’s leadership in his first — and possibly only — term.",
    "I doubt that there will be many tears shed among the GOP caucus at this point if Cawthorn this fall becomes one of the youngest ex-congressmen in history.",
    "Show horses are more focused on the external, giving speeches and appearing on TV to push the party’s message — or, more often, improve their own brand.",
    "It's that kind of behavior that has Sen. Thom Tillis, R-N.C., backing one of the seven primary opponents that Cawthorn has already drawn.",
    "(For example, H.R.2390, the \"Donument Act,\" which would make the completed portions of Trump’s border wall into a national monument.)",
    "Workhorses focus on the grind, keeping their heads down and working in the committee rooms and caucus meetings to shape legislation.",
    "He admitted on CNN last year that “the election was not fraudulent” but has still kept up the lie in front of cheering supporters.",
    "Among the falsehoods he told in just his first congressional race: that his accident prevented him from attending the U.S.",
    "Rep. Madison Cawthorn, R-N.C., became the youngest member of the House of Representatives when he was sworn in in 2021.",
    "Cawthorn still has an endorsement from Trump to lean on as he tries to maintain his position in next month's primary.",
    "He’s built no goodwill among colleagues who keep covering for him as he keeps adding to the mess that he’s created.",
    "After winning his race, he joined Trump in alleging that mass voter fraud had swung the election to Joe Biden.",
    "And then there’s the moves that have soured Cawthorn’s relationship with both the party and his constituents.",
    "But McCarthy has shown that he’s likely willing to cut the freshman loose if a better option comes along.",
    "Cawthorn definitely doesn’t qualify as a workhorse, despite offering himself up as one when campaigning.",
    "As a show horse, well, there’s a reason why his own party is considering putting him out to pasture.",
    "And as a show horse, well, there’s a reason his own party is considering putting him out to pasture.",
    "Cawthorn even spoke at the Jan. 6 rally that preceded Trump supporters’ attack on the U.S. Capitol.",
    "There’s a common adage that politicians can be divided into two camps: workhorses and show horses.",
    "He’d won his seat after toppling a primary opponent endorsed by then-President Donald Trump.",
    "Most of them are the legislative equivalent of trolling that lack any co-sponsors.",
    "Since joining Congress, Cawthorn has been the primary sponsor on 34 bills.",
    "A lot can change in 15 months."
  ]
}