{
  "id": 142,
  "mediaId": 2557,
  "date": "2022-04-17",
  "headline": "VIDEO: GOP Rep. who voted to impeach Trump warns party in ‘troubled waters’",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-182668763-2.jpg",
  "link": "https://dennismichaellynch.com/video-gop-rep-who-voted-to-impeach-trump-warns-party-in-troubled-waters/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    1926,
    2201,
    3071,
    3267,
    4255,
    4261,
    696,
    878,
    1124
  ],
  "sentences": [
    "Host Chuck Todd posed the question, “Lauren Boebert, and Marjorie Taylor Green, and Paul Gosar, is that a different element than you’ve ever seen before?”\nUpton replied, “I don’t think we’ve had as many folks in that sort of wing of the party elected as we have before, but I think they’re very popular back at home.”\nTodd then pressed Upton to explain his answer further.",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DailyMail:\nWarring factions within the Republican Party could push the GOP into ‘troubled waters’ with less than seven months until the November midterm elections, a retiring lawmaker said on Sunday.",
    "We’re focused on the country first, and the policies.”\nHe continued, “Our problems are too big to fight among ourselves and think so small, and that’s exactly what we’re doing — putting this country first to solve our problems.”\nWATCH the interview with Upton below:\nThere’s a reason you’re retiring, a-hole.",
    "The article goes on to state the following:\nSpeaking to NBC News’ Meet the Press on Sunday, the veteran lawmaker suggested the growing influence of far-right voices in Congress was the most significant he’s seen since taking office.",
    "GOP Rep. who voted to impeach Trump warns party in ‘troubled waters’ https://t.co/c67awuqkl3 via @MailOnline\n— PatriotForEver (@DonCamp29856335) April 17, 2022\nListen to the latest daily DML podcasts below!",
    "Upton continued, “Troubled waters I guess you could say.”\nOn Sunday, House Minority Leader Kevin McCarthy commented a more positive outcome for the GOP come November.",
    "Rep. Fred Upton (R-Mich.) was the fourth House GOP lawmaker to drop his re-election bid out of 10 who voted to impeach Donald Trump for the Capitol riot.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "McCarthy said on Fox News Sunday, “I’ve never seen our party more united.",
    "To get more information about this article, please visit DailyMail.",
    "Upton announced his retirement earlier this month.",
    "We’re not focused on individual.",
    "Then please share."
  ]
}