{
  "id": 1496,
  "mediaId": 2738,
  "date": "2022-04-07",
  "headline": "Rep. Paul Gosar Was Planning To Celebrate Hitler’s Birthday At A White Nationalist Bash, But Has Since Backed Out",
  "image": "https://uproxx.com/wp-content/uploads/2021/11/paul-gosar.jpg?w=1024",
  "link": "https://uproxx.com/viral/paul-gosar-hitler-birthday-white-nationalist-special-guest/",
  "mediaOutlet": "uproxx.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Wood",
  "authorUrl": "https://uproxx.com/author/jennifer-wood/",
  "termIds": [
    1768,
    1926,
    878
  ],
  "sentences": [
    "Rory McShane said that American Populist Union never contacted Gosar or his campaign.”\nThe American Populist Union similarly ignored the Mirror’s requests for comments ahead of publication, but had plenty to say afterwards:\nAmerican Populist Union did not respond to requests for comment before this article was published.",
    "On Wednesday, The Arizona Mirror reported that the Grand Canyon State congressman/all-around monster was set to be fêted as a special guest of the American Populist Union, a white nationalist organization, on a very special occasion (well, if you’re a white nationalist): Hitler’s birthday.",
    "In just the past year, some of his own nine siblings have called for his expulsion from Congress, endorsed his opponent, and/or branded him an outright “sociopath.” Which likely means none of Gosar’s brothers or sisters will be joining him in a chorus of “Happy Birthday der Führer.”",
    "While Gosar’s team pled ignorance when asked about the congressman’s plans for what would’ve been Adolf’s 133rd birthday, the 63-year-old Republican must have forgotten that there’s this little thing called Instagram.",
    "Several hours later, its chairman, Vince Dao, sent a statement denying any “ties or loyalties to white nationalism or Neo-Nazism,” and he said his team did not know it was planning an event on Hitler’s birthday.",
    "As Jerod Macdonald-Evoy wrote:\n“After this story was published, Gosar’s campaign consultant told the Arizona Mirror that the congressman would not be attending the white nationalist group’s event on April 20.",
    "While Gosar’s office did not respond to the Mirror’s several requests for comments about his attendance at the event before publishing the story, they did reach out once the story was live—to deny it.",
    "Our team was not even aware that April 20 was Hitler’s birthday, and we were not intending to honor or acknowledge Hitler or Nazism in any way,” Dao said.",
    "And that when Gosar promoted his upcoming appearance at the event via an Instagram story, people, you know, saw it.",
    "Today, in 2022, there are both subtle and not-so-subtle ways for people to signal that you stand with Nazism.",
    "It is, of course, worth noting that Gosar has reportedly had a complicated issue with the truth in the past.",
    "“We chose the date April 20 based on venue pricing, availability, and logistics — and nothing more.",
    "Venues tend to be easier to acquire on weekdays, which is why we ended up with the date.",
    "Instead, he said Gosar had a ‘farm tour’ scheduled for that day.",
    "Arizona Rep. Paul Gosar chose the latter.",
    "And took note."
  ]
}