{
  "id": 1533,
  "mediaId": 2629,
  "date": "2022-04-04",
  "headline": "Greene Praises Authoritarian Orban After Election Win In Hungary",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNjcxNzEyNy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY5NTU1MzEwNH0.ZQhjXzmQOLxQGrRR0pQoPVLbiLB0TgcTzLMILe6An3g/img.jpg?width=1200&coordinates=0%2C146%2C0%2C146&height=600",
  "link": "https://www.nationalmemo.com/marjorie-taylor-greene-anti-semetic",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Singer",
  "authorUrl": "https://www.nationalmemo.com/u/emily-singer",
  "termIds": [
    1726,
    2201,
    3426,
    3709,
    4293,
    5031
  ],
  "sentences": [
    "Rep. Marjorie Taylor Greene (R-GA) congratulated Hungarian Prime Minister Viktor Orban, an antisemitic and Islamophobic authoritarian who has crushed democracy in his country, controlling elections and the media, on securing another term as prime minister, becoming the latest GOP figure to cozy up to the authoritarian leader.",
    "Former President Donald Trump endorsed Orban in January, calling the authoritarian a \"strong leader\" who has \"done a powerful and wonderful job in protecting Hungary, stopping illegal immigration, creating jobs, trade, and should be allowed to continue to do so in the upcoming election.\"",
    "He's leading Hungary the right way and we need this in America,\" Greene tweeted Monday morning, the day after the election victory of Orban, one of Russian President Vladimir Putin's strongest allies, who accuses his opponents of trying to drag Hungary into war in Ukraine.",
    "Greene congratulated Orban after he made antisemitic comments and slammed Ukrainian President Volodymyr Zelenskyy in his victory speech and after reports had emerged that Russian troops have committed war crimes in Ukraine, including the rape and execution of civilians.",
    "\"The head of the Russian state expressed confidence that, despite the difficult international situation, the further development of bilateral ties of partnership fully meets the interests of the peoples of Russia and Hungary,\" the Kremlin said of Orban's victory.",
    "Orban said he had had to overcome \"The left at home, the international left all around, the Brussels bureaucrats, the [George] Soros empire with all its money, the international mainstream media, and in the end, even the Ukrainian president\" to win the election.",
    "Not open, but hiding; not straightforward but crafty; not honest but base; not national but international; does not believe in working but speculates with money; does not have its own homeland but feels it owns the whole world.\"",
    "He's demonized Soros, the Hungarian-born Jewish philanthropist and Holocaust survivor who is a target of antisemitic attacks from right-wing leaders in the United States and abroad, blaming Soros for his Hungary's ills.",
    "\"Trump wants to do here what Orban has done in Hungary: weaken democratic institutions, curb press freedom, and rewrite election laws to entrench his own party's power,\" Sen. Bernie Sanders (I-VT) tweeted in January.",
    "\"America should also ban sexually explicit media in sex-ed and all gender change information for minors under 18 intentionally confusing children,\" added Greene, who has made anti-LGBTQ comments before.",
    "And Fox News host Tucker Carlson, who defended Putin's invasion of Ukraine at its start, made an anti-Semitic and fawning documentary about Orban called \"Hungary vs. Soros: The Fight for Civilization.\"",
    "Greene also tried to launch a white supremacist caucus within Congress to preserve \"Anglo-Saxon political traditions\" and warned that immigration risked the United States' \"unique identity.\"",
    "Greene has echoed some of Orban's rhetoric, attacking immigrants, spreading antisemitic conspiracy theories, and parroting Putin's lies about Ukraine being filled with \"neo-Nazis.\"",
    "\"European Union institutions should be alarmed at this continued crackdown on independent media,\" Human Rights Watch wrote in 2021 of Orban's silencing of opposing voices.",
    "In 2019, Rep. Paul Gosar (R-AZ) called Orban a \"patriot\" who \"demonstrates the values of Western civilization and democracy, sovereignty, and self-determination.\"",
    "Observers have warned of the danger to American democracy of Republicans like Trump who say they want to adopt some of Orban's anti-democratic measures.",
    "The Georgia Republican representative congratulated Hungarian Prime Minister Viktor Orban, a key ally of Vladimir Putin, on winning another term.",
    "Putin, who endorsed Orban's run for reelection right before Russia invaded Ukraine on February 24, also congratulated Orban on his victory.",
    "She also praised Hungary's referendum on banning the teaching of children about gender identity and sexual orientation.",
    "In 2018, in a statement littered with antisemitic tropes, he said: \"We are fighting an enemy that is different from us.",
    "\"The threat to our democracy could not be clearer, and we must act boldly to protect it.\"",
    "And Orban has revoked broadcast licenses from stations that were critical of his tenure.",
    "And she's not the only voice on the American right that has supported or praised Orban.",
    "But member states have dragged their feet as the situation in Hungary deteriorates.\"",
    "\"Hungary is already under scrutiny for flouting the EU's democratic principles.",
    "He's called migrants fleeing Syria to Europe \"poison\" and \"Muslim invaders.\"",
    "\"Congratulations to Viktor Orban on winning a victory well deserved!",
    "Orban is known for making racist and anti-Semitic comments.",
    "Published with permission of The American Independent.",
    "She scrapped the idea after backlash.",
    "marjorie taylor greene"
  ]
}