{
  "id": 1578,
  "mediaId": 2629,
  "date": "2022-03-31",
  "headline": "Neo-Nazi Fuentes Praises GOP's ’Thinly Veiled Racism’ In Attacking Jackson",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yODAwMjQzMi9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY2OTI4MTgwMX0.w8NEyOZdE6gNNjO6nmjix8uYCVBXk7HHi7XFgrb6y9A/img.png?width=1200&coordinates=0%2C92%2C0%2C93&height=600",
  "link": "https://www.nationalmemo.com/neo-nazi-2657074256",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.nationalmemo.com/u/alexhenderson",
  "termIds": [
    2270,
    3242,
    3975,
    4628,
    4711,
    305,
    878,
    1171,
    5159
  ],
  "sentences": [
    "And now that Ketanji Brown Jackson is the nominee, you’re kind of getting a little taste of that again.”\nThe AFPAC founder cited Turning Point USA founder Charlie Kirk’s comments on Jackson as an example of “thinly veiled racism.”\nFuentes, a supporter of Russian President Vladimir Putin, tells viewers, “Charlie Kirk said: take a good, long look at Ketanji Brown Jackson — this is what your country looks like on CRT….",
    "Democrats as well as some Never Trump conservatives have been lambasting Sen. Ted Cruz of Texas, Sen. Josh Hawley of Missouri and other GOP senators for their treatment of Judge Ketanji Brown Jackson — President Joe Biden’s nominee to replace the retiring Justice Stephen Breyer on the U.S. Supreme Court — during her Senate confirmation hearings, which were held March 21-24.",
    "In the video, Fuentes says, “I can see the conservative movement is slowing coming back around to its implicit racism of the old days.”\nFuentes goes on to say that when Barack Obama was president, “there definitely was some thinly veiled racism there — a xenophobia: you Muslim socialist, you were born in Kenya….",
    "Nick Fuentes, the white nationalist and Holocaust denier who holds the America First Political Action Conference (AFPAC), agrees that some GOP senators displayed “thinly veiled racism” during the hearings.",
    "Other MAGA Republicans, however, have embraced Fuentes’ annual AFPAC event, which is often described as a white nationalist equivalent of the Conservative Political Action Conference (CPAC).",
    "Look at that Black face and her name — that’s what your country is going to look like.”\nFuentes has had an ongoing feud with Kirk, who ironically, he believes isn’t far enough to the right.",
    "Rep. Marjorie Taylor Greene of Georgia was a speaker at AFPAC 2022 in February, although she later said that she didn’t realize the event was organized by white nationalists.",
    "It means: she’s Black, and if you’re a white guy and you dream of becoming a Supreme Court justice, you’re going to have to clerk for someone named Ketanji Brown Jackson.",
    "But in an unhinged video flagged as racist by People for the American Way’s Right Wing Watch, Fuentes praises them for it instead of condemning it.",
    "During his speech at AFPAC 2022, Fuentes praised Putin’s invasion of Ukraine and led the crowd in a chant of “Pu-tin, Pu-tin.”",
    "AFPAC also featured prerecorded speeches from Rep. Paul Gosar of Arizona and Idaho Lt.",
    "And Charlie Kirk was like — he was like this close to saying: Look at that Black face.",
    "Gosar and far-right pundit Michelle Malkin were among the speakers at AFPAC 2021.",
    "And Gosar has defended his association with Fuentes.",
    "Governor Janice McGeachin at its 2022 gathering.",
    "What does that mean?"
  ]
}