{
  "id": 1719,
  "mediaId": 2634,
  "date": "2022-04-06",
  "headline": "Steve Bannon Said Trump Reminded Him of Hitler. He Meant It as a Compliment.",
  "image": "https://images.newrepublic.com/845053bbff994c40115cc8cdf3aa0e7b7dec170f.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/166017/steve-bannon-trump-hitler-republican-sociopaths",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Noah",
  "authorUrl": "https://newrepublic.com/authors/timothy-noah",
  "termIds": [
    1462,
    1726,
    1768,
    2201,
    2430,
    3500,
    3606,
    4170,
    4282
  ],
  "sentences": [
    "That Trump’s future campaign manager and White House chief strategist admired Trump because Trump reminded him of Adolf Hitler, and that Bannon apparently (“Bannon thought”) shared this repulsive sentiment with a reporter, and that neither the press nor the public was especially shocked when those two sentences got published—all that is an example of what the late sociologist and Democratic Senator Daniel Patrick Moynihan called, in an influential 1993 essay, “Defining Deviancy Down.”\nWe used to call people who think like Bannon sociopaths.",
    "In a podcast last month, Cawthorn said fellow Republicans had invited him to attend orgies (“Well hey, we’re going to have kind of a sexual get together at one of our homes, you should come”) and take drugs (“Some of the people that are leading on the movement to try and remove addiction in our country and then you watch them do, you know, a key bump of cocaine right in front of you”).",
    "Moynihan, a social conservative, called the second of these (the legitimization of deviant behavior) “defining deviancy down,” and the examples he cited (redefinition of the mentally ill as homeless; regarding out-of-wedlock birth as normal; and accepting horrifically high levels of violent crime) were conservative culture-war targets when he published his essay back in 1993.",
    "Peters is describing Steve Bannon watching Donald Trump on TV as Trump descends by the Trump Tower escalator to announce his presidential candidacy:\nThat’s Hitler, Bannon thought, as the opening scene of Leni Riefenstahl’s seminal work of Nazi propaganda, Triumph of the Will, flashed through his mind.",
    "Most recently, Boebert pledged to vote against any copyright extension for Mickey Mouse because Disney is a “woke” company because it opposes the state’s homophobic new “Don’t Say Gay” law, which bars classroom instruction on sexual orientation or gender identity in public schools.",
    "And we’ll get more in 2023 if the conspiracy theorist Ron Watkins wins in Arizona’s second congressional district or Noah Malgeri, who’s called for the execution of Joint Chiefs of Staff Chairman Mark Milley on live TV, wins in Nevada’s third congressional district.",
    "If you doubt we’ve grown too accustomed to aberrant behavior in the political class, consider this anecdote from the recently published Insurgency: How the Republicans Lost Their Party and Got Everything They Ever Wanted by Jeremy W. Peters of The New York Times.",
    "They have “a preoccupation with blaming others,” Eddy writes; they’re given to “all-or-nothing thinking”; they have “unmanaged or intense emotions”; and they’re incapable of emotional intimacy, self-awareness, or ever changing in any way.",
    "Peters’s publication of those two sentences drew not a peep of public protest from Bannon nor a single mention from a major American newspaper—not even Peters’s own, until a New York Times reviewer flagged them on February 22.",
    "Moynihan’s essay was based on the sociologist Kai Erikson’s observation that the proportion of people whom society deems deviant remains constant over time even as the supply of actual deviants ebbs and flows.",
    "To have four (Florida Republican Matt Gaetz’s pending application to become the fifth member of the Sociopath Caucus is, I’m told, receiving serious consideration) looks like an incipient political movement.",
    "Undaunted, Gosar later joined Taylor Greene at an event organized by someone the Anti-Defamation League called “a well-known white supremacist.”\nThen there’s Representative Lauren Boebert.",
    "It’s tempting to believe Cawthorn was being indiscreet, but given the long trail of outrageous lies he’s told in the past, more likely it was just a bizarre smear of his own party.",
    "Greene has already been stripped of her committee assignments for previous well-known episodes of derangement, so I think it only fair that she chair the House Sociopath Caucus.",
    "Bill Eddy, a therapist, lawyer, mediator, and author of the 2019 book Why We Elect Narcissists and Sociopaths, suggests that we all of us potentially live in such districts.",
    "Today’s screaming culture-war fights are more likely to be about LGBTQ rights, Covid-19 vaccinations, and (thanks to vile conspiracy-mongering by QAnon) pedophilia.",
    "The editors of the Times Book Review apparently agreed, because they didn’t commit Ratnesar’s review to newsprint until April 4, which is when I caught up with it.",
    "Except for violent crime, none remained hot-button topics in the culture wars, mainly because all three declined in subsequent years (especially violent crime).",
    "That’s the case with another charter member, Representative Paul Gosar, who posted an animated video of himself killing Representative Alexandria Ocasio-Cortez.",
    "(Repeated fact-checks demonstrated Jackson’s rulings in child pornography cases were well within the mainstream, even compared to some Trump-appointed judges.)",
    "But vaccinations aren’t new, just newly controversial, and pedophilia is neither more accepted nor (as best anyone can tell) any more common than it ever was.",
    "(Not that allowing Disney’s copyright to expire in 2024, 96 years after Mickey’s debut, will get any complaint from me: See “Defund the Dead,” December 2021.)",
    "#KBJ is Supreme Court nominee Ketanji Brown Jackson, whom Senate Republicans smeared hatefully during her confirmation hearings as soft on child pornography.",
    "Taylor Greene took them at their word and applied the same reasoning to fellow Republicans who voted to advance Jackson’s nomination to the Senate floor.",
    "But Boebert heckled Biden while he was talking about his son dying of cancer after being exposed to a toxic burn pit when he served in Afghanistan.",
    "I don’t mean to suggest that members of the House Sociopath Caucus are limited to Republicans who say awful things about fellow Republicans.",
    "Culture wars are being fought over them anyway because the deviancy that’s being defined down is that of the cultural warriors themselves.",
    "He calls political sociopaths “high-conflict personalities,” or HCPs, and he says they’re good at attracting attention in divisive times.",
    "Representative Marjorie Taylor Greene, Republican of Georgia, tweeted Monday: “Murkowski, Collins, and Romney are pro-pedophile.",
    "When actual deviants are in short supply, Moynihan argued, the quota gets filled by reclassifying normal behaviors as deviant.",
    "Granted, we’ve seen a House member heckle a State of the Union address before (Representative Joe Wilson in 2009: “You lie!”).",
    "Yes, society is being asked to revise its previous notions about gender, and it’s no surprise that conservatives hate that.",
    "Even that reviewer, Romesh Ratnesar of Bloomberg Opinion, concluded the book wouldn’t likely interest many readers.",
    "I’d say the members of the House Sociopath Caucus are representative of perhaps 1 percent of the population.",
    "Senate Republicans leveled this accusation because they’re crudely partisan, not because they believe it.",
    "Vice chair goes to Madison Cawthorn, at 26 the youngest and second-most-deranged Republican in Congress.",
    "Now Marjorie Taylor Greene calls three GOP senators “pro-pedophile.” These people are sociopaths.",
    "When actual deviants are in surplus, the overflow gets reclassified as perfectly normal.",
    "I refuse to live in a world where they’re representative of more than 2 or 3 percent.",
    "She’s best known for heckling President Joe Biden’s State of the Union address.",
    "Except for the first, these three targets don’t fit Moynihan’s template.",
    "That elevates Boebert’s behavior from extremely crude to sociopathic.",
    "Sometimes their pathologies express themselves through partisanship.",
    "Eddy estimates that HCPs constitute 10 percent of the population.",
    "The result is excessive tolerance, which conservatives deplore.",
    "They just voted for #KBJ.” That isn’t just false and extremist.",
    "They seem especially visible in the House of Representatives.",
    "For only one sociopath to hold a seat in Congress is notable.",
    "Certain districts just seem to prefer sociopathic candidates.",
    "Boebert never misses a meeting of the House Sociopath Caucus.",
    "The result is intolerance, which liberals deplore.",
    "Sociopaths have burrowed into the halls of power.",
    "That won him the first House censure since 2010.",
    "HCPs are bad at pretty much everything else.",
    "That’s something only a sociopath would do.",
    "But don’t get me started on the Senate.",
    "Now we just call them Republicans.",
    "I’m not willing to believe that.",
    "He meant it as a compliment.",
    "It’s depraved.",
    "And gasped."
  ]
}