{
  "id": 174,
  "mediaId": 2664,
  "date": "2022-04-11",
  "headline": "NY Times reporter asks why the Jan. 6 committee won't subpoena Mo Brooks and Paul Gosar",
  "image": "https://www.rawstory.com/media-library/rep-mo-brooks-r.jpg?id=25458956&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/january-6-brooks-gosar-biggs/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    1926,
    1934,
    3741,
    4223,
    4304,
    4319,
    4537,
    1054,
    1132
  ],
  "sentences": [
    "But it was New York Times reporter Mike Schmidt who cited claims of Republican lawmakers purportedly coordinating with Alexander ahead Jan. 6 -- which prompted him to ask why Congress hasn't talked to them if they intend to turn over every rock in their investigation.",
    "See the video below:\nWhy the hell isn't Jan. 6 talking to Gosar, Biggs and Brooks\nNOW WATCH: 'Copious' evidence of Trump's criminality still may not force Merrick Garland to act\n'Copious' evidence of Trump's criminality still may not force Merrick Garland to act",
    "Far-right activist Ali Alexander went into hiding after the Jan. 6 attack on the U.S. Capitol, but he did publish a video in which he claimed he met with GOP lawmakers such as Reps. Paul Gosar (R-AZ) and Mo Brooks (R-AL) ahead of the riots.",
    "Speaking to MSNBC's Nicolle Wallace on Monday, former federal prosecutor Harry Litman explained that Alexander is cooperating with the Justice Department because, if he refuses, he could get as much as 10 years in jail.",
    "\"The Jan. 6 committee gets a ton of positive publicity, especially on the left, for the fact that they have been willing to go as far as they have and that they cast the nets as far as they did,\" Schmidt said.",
    "\"But if the Select Committee is trying to have more the authoritative account of what happened, then why aren't they talking to those members of Congress?\"",
    "Alexander has just agreed to comply with the grand jury, so it may be that the investigators in the future will call those members to ask about their role.",
    "And he's got some real information to give that no one else has got, no one has received yet.\"",
    "And this investigation may end and the committee may never have interviewed them.\"",
    "\"Somebody like Dan Scavino might say, I'll do a year for the boss,\" said Litman.",
    "\"Alexander and anyone in the DOJ investigation has leverage of 10 to 15 years.",
    "\"Those three people seem incredibly important to understanding what happened.",
    "There's no evidence that the DOJ is speaking to them either, said Wallace.",
    "That's what makes them talk and give fuller information.",
    "he asked."
  ]
}