{
  "id": 196,
  "mediaId": 2550,
  "date": "2022-04-20",
  "headline": "Charlie Kirk’s TPUSA signals its surrender to white nationalist Groypers by embracing them",
  "image": "https://images.dailykos.com/images/1009113/story_image/GettyImages-1236545384.jpg?1637281334",
  "link": "https://www.dailykos.com/stories/2022/4/19/2092901/-Charlie-Kirk-s-TPUSA-signals-its-surrender-to-white-nationalist-Groypers-by-embracing-them?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Neiwert\nDaily Kos Staff",
  "authorUrl": "/users/david neiwert",
  "termIds": [
    0
  ],
  "sentences": [
    "Fuentes also has been an ardent supporter of Russia and Vladimir Putin in the Ukraine invasion, encouraging the audience to chant “Putin, Putin” at the convention, adding: “And now they’re going on about Russia and ‘Vladimir Putin is Hitler,’ you know, they say that’s not a good thing.” More recently, Russia Today—the Kremlin-financed media entity that has been mostly shut down in the U.S. and Europe—invited Fuentes on to discuss how “Western rhetoric can be described as Russophobia.”\nAs if to underscore what loathsome characters the Groypers are, Fuentes recently unleashed an anti-military rant on his podcast: “They’re creating this mercenary army of, uh, N-words, and homosexuals, that’s the story … they’re creating a mercenary army of Blacks, browns, Hispanics, as well as women, and homos and trans people as some kind of equity initiative ...",
    "The latter, in turn, were joined in the white nationalist trenches by onetime Fox News contributor Michelle Malkin, who burned her bridges with mainstream conservatives in order to become the “Groyper Mommy.”\nBut in more recent months, Kirk—who in fact has always flirted with extremist rhetoric and ideas, but has tried to keep one foot in the Republican establishment mainstream, which is much of the source of his funding—has shown signs of giving in to the wave of white nationalist and conspiracist extremism that is currently inundating the American right generally.",
    "Daily Kos' The Brief\nFollowShare\n0:001:02:00\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nA couple of years ago, this kind of embrace of Fuentes and his Groypers would have been unthinkable for Kirk, largely because of their unrelenting attempts to disrupt his events and humiliate both Kirk and his speakers, insisting that their positions failed the white nationalist acid test, especially when it came to “the J Question”—that is, their innate antisemitism—and not just LGBTQ rights, but any kind of tolerance for that community.",
    "Schwemmer appeared in a video promoting Fuentes’ “White Boy Summer” speaking tour in 2021, and lamented on Twitter that “the white population is globally declining and we are being treated terribly by the incoming populations, the acceleration of mass immigration is one major part of this.”\nListen Jennifer Fernandez Ancona from Way to Win explain what how Democrats must message to win on Daily Kos' The Brief podcast with Markos Moulitsas and Kerry Eleveld\nx\nx\nYou need to enable JavaScript to run this app.",
    "… How many elections are they gonna steal before we kill these people?” Kirk’s response amounted to chagrined agreement, saying that the query was just “overly blunt” and agreeing that “we are living under fascism.”\nIn December, a TPUSA event in Phoenix turned into a meeting ground for an array of far-right extremists, including several with ties to the Groypers.",
    "… So in terms of the legacy of Martin Luther King, being assassinated was, like, the best thing that could have happened to him.”\nHe will be joined onstage at Santa Barbara by Schwemmer, a 19-year-old Groyper influencer whose TikTok account, as Ben Lorber reports, launders stylized takes on white nationalist ideology for a Gen Z audience.",
    "They included Greyson Arnold, a prominent Groyper influencer who posts memes lamenting the American victory in World War II, calling Adolf Hitler a “complicated historical figure,” and lauding Nazis as the “pure race.” He has also posted the logo for the neo-Nazi site Stormfront on his Instagram account.",
    "This week in California, two unrepentant white nationalists affiliated with America First are scheduled to appear as invited speakers at a TPUSA event at University of California-Santa Barbara—one month after having appeared at a similar event at Fresno State hosted by the school’s College Republicans.",
    "While only a handful of elected Republicans—notably Congressman Paul Gosar of Arizona—came to his America First PAC convention in 2021, it was a different story this year, when an array of GOP candidates showed up to speak, headlined by Congresswoman Marjorie Taylor Greene of Georgia.",
    "The Groyper War—the internecine battle among far-right groups vying for the college-age audience, pitting Charlie Kirk’s slick Turning Point USA operation with Nick Fuentes’ America First and its white nationalist Groyper Army—seems to be over.",
    "Thursday’s UCSB event sponsored by TPUSA is two-person panel featuring John Doyle, the host of the popular YouTube channel “Heck Off, Commie!,” and another far-right TikTok influencer named Kai Schwemmer, whose account is called Kai Clips.",
    "Nick Fuentes, leader of America First and its white nationalist 'Groyper Army,' built his operation by attacking Charlie Kirk's Turning Point USA as too moderate; now TPUSA is holding events featuring Groypers.",
    "Kirk and some of his more mainstream but still Trumpist allies like Sebastian Gorka (who demanded Fuentes be removed from Twitter) and Congressman Dan Crenshaw pushed back hard on the Groypers.",
    "Fuentes, who was subpoenaed by the House Jan. 6 committee to discuss his active role in the 2021 Capitol insurrection, has been gaining ground among mainstream Republicans in the past year.",
    "Like, eventually the information about the scandals would have gone public—his infidelity, his Communist ties, his plagiarism—but now, because he was assassinated, nobody cares about that.",
    "I mean, they’re making a mercenary army of people that’s gonna obediently murder whites when the time comes, that’s what this is about.”\nCharlie Kirk’s fan in Idaho would probably agree.",
    "Although it’s been clear that Kirk has been nudging TPUSA in a white nationalist direction over the past year, in recent weeks he has removed the barriers between the groups altogether.",
    "It doesn’t matter if Nick Fuentes himself being there makes anyone look bad all his influencer acolytes just get the red carpet from TPUSA now.”\nThis is a short blurb about Daily Kos.",
    "Both are closely associated with Fuentes and America First, and both specialize in outrageously and unapologetically racist discourse promoting white-supremacist eugenics.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "“Without the assassination, he wouldn’t have a legacy, and I guarantee you he wouldn’t have a holiday,” Doyle said.",
    "Because the story goes that he died fighting for equality and he was killed by a racist white man.",
    "At an October event in Idaho, one audience member asked him: “When do we get to use the guns?",
    "Doyle, for instance, viciously smeared Martin Luther King Jr. on one of his recent shows.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "As Left Coast Right Watch observed: “The Groypers won the Groyper war.",
    "“He would have become someone like Al Sharpton, or Jesse Jackson.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n61.",
    "With barely a whimper, the Groypers are the victors.",
    "TPUSA’s ad for the Thursday event.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Democrats and “messaging.\"",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Donate $5 monthly",
    "Can it be solved?",
    "Please read it.",
    "Sigh."
  ]
}