{
  "id": 2054,
  "mediaId": 2643,
  "date": "2022-03-19",
  "headline": "Trump-Backed McGeachin Stands by Appearance at 'White Nationalist' Event",
  "image": "",
  "link": "https://www.newsweek.com/trump-backed-mcgeachin-stands-appearance-white-nationalist-event-1689751",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    2201,
    2386,
    2886,
    3242,
    878,
    5034
  ],
  "sentences": [
    "Fuentes has faced criticism for several remarks he made during the conference, including: \"Now they're going on about Russia and Vladimir Putin is Hitler—they say that's not a good thing\" as well as calling for a \"round of applause for Russia\" amid its invasion of Ukraine.",
    "Several high-profile Republicans faced criticism for appearing at the America First Political Action Conference, which was organized by right-wing activist Nick Fuentes, who has been labeled a \"white supremacist\" by the Anti-Defamation League.",
    "She dismissed the criticism of her attendance as coming from the \"illiberal left,\" and said, \"I'm not going to back off from the opportunity to talk to other conservatives across the country from America First policies.\"",
    "\"As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Wyoming Representative Liz Cheney tweeted.",
    "House Minority Leader Kevin McCarthy said he was \"appalled\" by their appearance and later insisted they would not attend in the future, but has declined to go further by punishing them, sparking criticism from Democrats.",
    "McGeachin, however, said she knew who she was \"talking to\" while defending her attendance while speaking on the right-wing show Valiant News, adding that she was invited by conservative commentator Michelle Malkin.",
    "Idaho Lieutenant Governor Janice McGeachin, who received the endorsement of former President Donald Trump in the upcoming gubernatorial race, defended her appearance at a \"white nationalist\" conference on Thursday.",
    "Other prominent Trump-aligned Republicans have also faced scrutiny for their attendance including GOP Representatives Marjorie Taylor Greene, of Georgia, and Paul Gosar, of Arizona.",
    "A December poll conducted by Zoldak Research 2022 and the Idaho Dispatch showed Little holding a strong lead against her and his other challengers.",
    "GOP leaders have condemned the rally and Fuentes, with some attendees saying they were not aware of some of his prior remarks and beliefs.",
    "[It] does not reflect on who I am or who the thousands of others that are participating in this movement,\" she told the news station.",
    "The lieutenant governor previously faced calls to resign over her appearance, but told KTVB-TV she did not know who Fuentes was.",
    "Newsweek reached out to McGeachin's campaign for comment Saturday morning, but did not hear back by publication.",
    "However, she defended her appearance, saying she wanted to address the large audience at the event.",
    "The race is unlikely to become competitive in November in a state easily carried by Trump in 2020.",
    "I don't know what his views are, so I'm not aligned with anything that may be controversial.\"",
    "\"All Americans should renounce this garbage and reject the Putin wing of the GOP now.\"",
    "\"Well, you know what, Nick Fuentes, as I said, I don't know him.",
    "Greene told a CBS News reporter: \"I do not know Nick Fuentes.",
    "McGeachin is challenging incumbent GOP Governor Brad Little.",
    "I don't know...everything that he says or doesn't say.",
    "This story will be updated with any response.",
    "I've never heard him speak.",
    "I've never seen a video.",
    "I've never met him."
  ]
}