{
  "id": 2070,
  "mediaId": 2594,
  "date": "2022-03-30",
  "headline": "Trump pours cold water on House speaker idea floated by Matt Gaetz",
  "image": "https://static.independent.co.uk/2022/03/28/20/EEUU_CAPITOLIO_INSURRECCI%C3%93N_29900.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/trump-matt-gaetz-speaker-congress-b2047408.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Bowden",
  "authorUrl": "https://www.independent.co.uk/author/john-bowden",
  "termIds": [
    1726,
    2030,
    2201,
    2599,
    2763,
    2817,
    3975,
    878,
    4977
  ],
  "sentences": [
    "The far right likely has little to worry about, however, given that House Minority Leader Kevin McCarthy has still gone relatively easy on his members who express extreme views or make racist statements, as is the case with Rep Lauren Boebert’s (and others’) frequent attacks targeting Rep Ilhan Omar, a Democrat, over her Muslim faith.",
    "A recent poll from Harvard CAPS/Harris polling showed that no other potential Republican candidate came close to the support that Mr Trump has in a hypothetical GOP primary matchup, and also revealed that he would lead President Joe Biden in overall support were the election to be held today.",
    "The suggestion, while a long shot from the get-go, could be seen as a minor blow to the far-right of the House GOP caucus who have chafed at the more centrist GOP leadership’s efforts to keep them in line amid a number of incidents that have proved embarrassing for the caucus as a whole.",
    "Mr Trump made his decision clear in an interview with John Solomon and Amanda Head, after Ms Head remarked that his reaction to the suggestion from Congressman Matt Gaetz at a Florida rally hosted by the ex-president did not make clear whether he supported the idea.",
    "Mr Gaetz has clung to the former president since the latter left office last year while the congressman faces a sex trafficking probe that sprung from a federal investigation of his former close confidante, Joel Greenberg, himself now a convicted sex trafficker.",
    "He has even indicated that Ms Greene will likely resume her committee assignments should the GOP retake the majority, despite Ms Greene’s assignments being revoked due to her statements in support of violence against Democrats including Speaker Nancy Pelosi.",
    "In recent weeks that has included public rebukes of Reps Marjorie Taylor Greene and Paul Gosar for their attendance at a white nationalist-led far right conference hosted during CPAC in Florida.",
    "Former President Donald Trump has officially rejected the idea of serving as Speaker of the House next year should Republicans win control of the House in this year’s midterm elections.",
    "The Florida lawmaker has refused to resign in the face of an investigation into whether he had a sexual relationship with a 17-year-old and paid for her travel across state lines.",
    "“I have a suspicion that someone is trying to recategorize my generosity to ex-girlfriends as something more untoward,” he said in a statement addressing the issue last year.",
    "Mr Trump remains a heavy favourite to win the GOP nomination for president in 2024, which would likely explain his reluctance to take a position in the House instead.",
    "No, it’s not something I want to do, I want to look at what’s happening, and then we’re going to be doing something else.",
    "“No I think that, it’s not something that I want to, a lot of people bring it up, it’s brought up all the time.",
    "The congressman has fiercely denied the allegation, and has not been officially charged with a crime.",
    "No, it’s not something that I would be interested in,” he said.",
    "He has denounced the investigation as politically motivated."
  ]
}