{
  "id": 2118,
  "mediaId": 2662,
  "date": "2022-03-29",
  "headline": "“Spook Who Cried Wolf”: Matt Gaetz Introduces Resolution to Strip Security Clearances From Dozens of Intelligence Officials Who Falsely Labeled Hunter’s ‘Laptop From Hell’ as “Russian Disinformation”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/175B351A-7127-4480-B22C-F4ED7046A30F.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/03/spook-cried-wolf-matt-gaetz-introduces-resolution-strip-security-clearances-dozens-intelligence-officials-falsely-labeled-hunters-laptop-russian-disinforma/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julian Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/julianc/",
  "termIds": [
    2817,
    3102,
    3267,
    3893,
    5287
  ],
  "sentences": [
    "In October of 2020 – just days before the presidential election – 51 former intelligence officials signed and published a letter that baselessly decried the contents of Hunter’s ‘laptop from hell’ had “all the classic earmarks of a Russian information operation.”\nThese clowns were profiled by the NY Post last week, fittingly labeled as “The Spies Who Lie.”\nNY Post Calls Out the 51 Former Senior Intelligence Officials including Former CIA Chiefs Who Openly Lied About Hunter Biden’s Laptop Being ‘Russian Disinformation’\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nGaetz’s new “Spook Who Cried Wolf Resolution” would target every single one of these former high-ranking officials, all of whom sold out their credibility in an effort to bury the contents of the laptop and prevent Biden from the fallout from his son’s illicit business dealings going public.",
    "From Gaetz’s proposal:\n“The 51 signatories of the letter who publicly and falsely decried Hunter Biden’s laptop to be Russian disinformation should be barred from holding any level of security clearances indefinitely.”\nAs Gaetz points out, the actions by these supposedly ‘trusted’ national security ‘experts’ were particularly egregious, especially considering the complete absence of evidence indicating the laptop wasn’t legitimate and the timing of the letter, which was published just 15 days before the November election.",
    "From the October 2020 letter:\n“We want to emphasize that we do not know if the emails, provided to the New York Post by President Trump’s personal attorney Rudy Giuliani, are genuine or not and that we do not have evidence of Russian involvement – just that our experience makes us deeply suspicious that the Russian government played a significant role in this case,”\nSome of these creeps have even doubled down on the letter and are still holding the line with the bogus ‘Russian misinformation’ narrative.",
    "On Tuesday, Rep. Matt Gaetz (R-FL) introduced a new House Resolution that would strip security clearances from dozens of federal intelligence officials who signed on to a letter declaring the infamous Hunter Biden laptop as “Russian disinformation” shortly after it emerged in the months leading up to the rigged 2020 election.",
    "From the “Spook Who Cried Wolf Resolution“:\n“4 of the 51 signatories have issued sustained support of the letter, since the New York Times March 17th article, which passively verified the data discovered on Hunter Biden’s ‘Russian Disinformation’ laptop.",
    "However, there is already a large amount of GOP support, with fellow Reps. Thomas Massie (KY), Dan Bishop (NC), Andy Biggs (AZ), Paul Gosar (AZ), Louie Gohmert (TX), and Marjorie Taylor Greene (GA) all having co-sponsored the bill so far.",
    "If the resolution passes, all 51 will all lose access to their current security clearance, in addition to becoming barred from holding one again.",
    "Getting the measure passed through will likely have to wait until after the 2022 Midterms.",
    "The letter itself even states that they had no evidence of Russian involvement whatsoever.",
    "As it sits now, Gaetz’s resolution is a longshot to pass through Congress.",
    "Apparently, they were working off plain instinct.",
    "These people are shameless."
  ]
}