{
  "id": 2200,
  "mediaId": 2664,
  "date": "2022-03-25",
  "headline": "MAGA purge: Jan. 6 organizer labels former ally Rep. Mo Brooks as 'LOSER' and 'piece of crap'",
  "image": "https://www.rawstory.com/media-library/mo-brooks-at-trump-rally-in-alabama.jpg?id=27277755&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/maga-purge-jan-6-organizer-labels-former-ally-rep-mo-brooks-as-loser-and-piece-of-crap/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kathryn Joyce",
  "authorUrl": "https://www.rawstory.com/u/kathrynjoyce-salon",
  "termIds": [
    1911,
    1926,
    2201,
    4537,
    878,
    1163,
    4814,
    5159
  ],
  "sentences": [
    "\"Today, Republican senators and congressmen will either vote to turn America into a godless, amoral, dictatorial, oppressed, and socialist nation on the decline,\" he said, \"or they will join us, and they will fight and vote against voter fraud and election theft and vote for keeping America great.\"",
    "In response, Brooks made the startling but entirely plausible claim that Trump had repeatedly asked him to \"rescind the 2020 election, immediately remove Joe Biden from the White House, immediately put President Trump back in the White House, and hold a new special election for the presidency.\"",
    "In what amounted to a MAGA excommunication, Ali Alexander, the self-proclaimed founder of the 2020 \"Stop the Steal\" movement and a key planner of the Jan. 6, 2021, protests, celebrated the \"de-endorsement\" on multiple conservative social media sites, writing on Telegram, \"MO BROOKS is a LOSER.\"",
    "Despite Brooks' stalwart support of Trump, his poor showing in polls — and the subsequent implication that Trump's endorsements are losing their potency, even in a deep red Southern state — seemingly led the ex-president to announce on Wednesday that he was withdrawing his endorsement.",
    "The statement read, \"The insinuation that this single text to Congressman Brooks from an unknown number by someone claiming to be 'Ali Alexander' somehow suggests Congressman Brooks in any way helped plan the Capitol attack is absurd, outrageous and defamatory.\"",
    "Last December, after facing subpoenas from the House Select Committee investigating the Jan. 6 attack on the Capitol, Alexander handed over some 1,500 text messages and other communications with Republican members of Congress and Trump White House aides.",
    "At the Dec. 12, 2020, \"Jericho March,\" a pro-Trump religious rally to protest the election results, Alexander appeared on stage to tell the crowd about Stop the Steal and to urge them to return to the capital in January to \"occupy D.C. full of patriots.\"",
    "On Wednesday, shortly after news broke that Donald Trump had rescinded his endorsement of Alabama Rep. Mo Brooks, a right-wing Republican currently running for Senate, one of Brooks' former allies denounced him forcefully across right-wing social media.",
    "In a now-deleted Periscope video posted in December 2020, Alexander also claimed that Brooks was one of three members of Congress — along with Reps. Paul Gosar and Andy Biggs, both of Arizona — who had helped plan the activities of Jan. 6.",
    "In the notorious video, Alexander said, \"We four schemed up putting maximum pressure on Congress while they were voting\" in order to \"change the hearts and minds of Republicans who were in that body, hearing our loud roar from outside.\"",
    "Brooks later protested that he was only trying to rouse the audience to keep track of Republicans who failed to support Trump's efforts to overturn the election, and had no intention of promoting literal \"ass-kicking.\"",
    "At the pro-Trump rally on the morning of Jan. 6, Brooks delivered a vitriolic call to action, telling the crowd on the Washington Ellipse, \"Today is the day American patriots start taking down names and kicking ass.\"",
    "An October story in Rolling Stone further reported that two unnamed sources involved in planning Jan. 6 claimed that they'd had \"dozens\" of conversations with the offices of six members of Congress, including Brooks.",
    "However, reports emerged of Alexander hugging Biggs' wife at a rally, at which Alexander played a video message from Biggs, announcing that he would join Brooks on Jan. 6 in questioning the election certification.",
    "In an April 2021 response to a House ethics complaint about his involvement with Jan. 6, Gosar defended Alexander as \"a devout Catholic motivate[d] by an earnest search for the truth and love of his country.\"",
    "In response, a spokesperson for Brooks released a statement claiming that Brooks' interaction with Alexander had been limited to receiving one text from the Stop the Steal organizer in December 2020.",
    "\"I haven't told the story to anyone except the President's team and my lawyers or how Mo Brooks and HIS STAFF betrayed our election integrity movement before he did so publicly,\" Alexander continued.",
    "Brooks said he'd told Trump that Jan. 6, 2021, had represented the final chance to contest the election, and that \"neither the U.S. Constitution nor the U.S. Code permit what President Trump asks.\"",
    "(Alexander, who was then in the process of converting to a right-wing version of Catholicism, promised the audience that they had \"God's favor,\" and rallied them to fight \"for God and country!\")",
    "At that event, Alexander praised Mo Brooks specifically as the first Republican member of Congress to vow he would object to the certification of electoral votes on Jan. 6.",
    "Alexander weighed in on Gettr as well, directing a message at Brooks: \"Change your profile, @MoBrooks\" (referring to Brooks' profile banner touting Trump's endorsement).",
    "On the competing right-wing social media site Gab, Alexander continued, writing, \"I'm proud to announce that @realdonaldtrump has WITHDRAWN his endorsement of Mo Brooks.",
    "A video also emerged that showed him leading Gosar — whom Alexander had described as \"the spirit animal of Stop the Steal\" — through a crowd at a pro-Trump rally.",
    "But that claim seemed dubious in light of Brooks' later statement that he had worn body armor on Jan. 6, after receiving warnings about potential violence.",
    "But according to a filing from Alexander's legal representatives, Alexander told the Jan. 6 committee that he'd had phone conversations with Brooks' staff.",
    "At that time, Brooks told Alabama journalists that while he hadn't helped plan the Jan. 6 rally, if his staff had, \"Quite frankly, I'd be proud of them.\"",
    "None of those three explicitly confirmed the claim at the time, and a spokesperson for Biggs later attempted to distance the congressman from Alexander.",
    "He continued, \"I want to tell the Republican Party that if one of these senators doesn't join Mo Brooks, we will burn the Republican Party down.",
    "\"With President Trump withdrawing his endorsement, I can finally be public about what a piece of crap Mo actually is.",
    "I can now go on the record about him and his office and their attempts to BETRAY the Election Integrity movement.\"",
    "In another message on the site, Alexander wrote, \"This is what Mo doesn't get... the voters already left him.",
    "As a February 2022 report noted, Brooks' speech that day also delved into Christian nationalist rhetoric.",
    "Trump accused Brooks of going \"woke\" by failing to campaign on Trump's stolen election narrative.",
    "But this represents a striking departure from the way Alexander used to talk about Brooks.",
    "Brooks certainly isn't the first Republican to be cast out of Trump World as an apostate.",
    "I hope they didn't lie under oath to the J6 Committee like they lied to Mo in private.",
    "Trump is following what many of us in private and public have said.",
    "Mo Brooks has the dumbest staff on the hill and everyone knows it.\"",
    "We expect them to join him — or we will throw them out of office.\"",
    "\"He's said he'll object to the House certification on Jan. 6.",
    "\"Thank God for Congressman Mo Brooks,\" Alexander said.",
    "Among them were communications with Gosar and Brooks.",
    "You've been rejected by #StopTheSteal and now Trump.",
    "\"You betrayed our Election Integrity movement.",
    "Tell your staff to never come for me again.\"",
    "We need some of his colleagues to join him.",
    "And his staff is worse and smells worse.",
    "We will make something new.\"",
    "He's no longer on the team.",
    "And keep leaving him.",
    "We're done here.",
    "Stay tuned!\""
  ]
}