{
  "id": 2212,
  "mediaId": 2664,
  "date": "2022-03-28",
  "headline": "Government re-starts prosecution of violent white supremacist group Rise Above Movement",
  "image": "https://www.rawstory.com/media-library/rise-above-movement-co-founder-robert-rundo-in-belgrade-last-year.jpg?id=29605856&width=1200&coordinates=0%2C4%2C0%2C209&height=600",
  "link": "https://www.rawstory.com/rise-above-movement/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Green",
  "authorUrl": "https://www.rawstory.com/u/jordan_green_special_to_raw_story",
  "termIds": [
    0
  ],
  "sentences": [
    "Around the time of the assistance ban, Khanna voiced opposition to providing “lethal weaponry” to Ukraine in 2018, while insisting that “we must also ensure that these weapons do not reach white supremacist elements within the Ukrainian Army, such as Azov Battalion.” In 2019, 40 members of Congress led by Rep. Max Rose (D-Calif.) unsuccessfully lobbied the State Department to designate Azov as a “foreign terrorist organization.”\nSince Russia’s invasion of Ukraine in February, which has resulted in more than 1,000 civilian deaths and massive displacement, Azov’s role has become more politically touchy.",
    "Scott Bierwirth, an FBI special agent assigned to the FBI’s counter-terrorism squad, described Azov Battalion in the 2018 affidavit supporting criminal charges against Rundo and his co-defendants as “a paramilitary unit of the Ukrainian National Guard which is known for its association with neo-Nazi ideology and use of Nazi symbolism, and which is believed to have participated in training and radicalizing United States-based white supremacy organizations.”\nIn May 2018, Congress outlawed the use of US funds to provide arms, training or other assistance to Azov.",
    "I will never apologize for being in this picture, or knowing these men.”\nVincent James Foxx has been described by ProPublica as Rise Above Movement’s “unofficial propagandist.” While the relationship between Foxx and Rundo has recently been strained, Foxx was seen standing at the side of Groyper leader Nicholas Fuentes outside the US Capitol on Jan. 6, 2021, and recently spoke at Fuentes’ America First Political Action Conference, alongside Reps. Marjorie Taylor Greene (R-Ga.) and Rep. Paul Gosar (R-Ariz.).",
    "The FBI described Rise Above Movement when the charges were initially filed in 2018 as “a combat-ready, militant group of a new nationalist white supremacy/identity movement.” The affidavit supporting charges against the four men details repeatedly cycles of martial arts trainings, followed by coordinated travel to rallies where they carried out assaults, then followed by social media postings celebrating their violence, from March through August 2017.",
    "“The BPD officer knocked Rundo to the ground to stop the ongoing assault, and Rundo punched the officer twice in the head before BPD officers subdued and arrested him.”\nFour other RAM members, including co-founder Benjamin Daley, previously pleaded guilty to conspiracy to riot in a separate case brought against them for their role in not only the Huntington Beach and Berkeley rallies, but also the August 2017 Unite the Right rally in Charlottesville.",
    "Founded in southern California in 2016, Rise Above Movement members quickly made an impression by showing up at pro-Trump gatherings from Huntington Beach to Berkeley while wearing skull masks and brutally assaulting antifascist counter-protesters, and later appearing at the Unite the Right rally in Charlottesville, Va. in August 2017.",
    "Rundo and fellow Rise Above Movement members Robert Boman, Aaron Eason and Tyler Laube were indicted on federal charges of conspiracy to violate the Anti-Riot Act in California in November 2018, but a federal judge dismissed the indictment finding that provisions of the law unconstitutionally violated the First Amendment.",
    "Azov has played a crucial role in defending the besieged city of Mariupol, a strategically located port, and criticism of the battalion among Ukraine’s supporters can be viewed as playing into Russian President Vladimir Putin’s false claim that the purpose of the invasion is to “de-Nazify” Ukraine.",
    "“According to Berkeley Police Department officers, a BPD officer saw Rundo punching the apparently defenseless person in the head, and ordered Rundo to stop, but Rundo did not respond,” the affidavit attached to the charging documents reads.",
    "In the spring of 2018, the government alleges, Rundo, Daley and fellow RAM member Michael Miselis traveled to Germany, Ukraine and Italy to celebrate Adolf Hitler’s birthday and network with European fascist groups, the government alleges.",
    "“Rundo then held the counter-protester down with his left hand and threw several punches at the counter-protester’s head while other RAM members looked on, cheered, and prevented others from intervening,” the government said.",
    "The FBI affidavit supporting charges also describes co-founder Robert Rundo running up behind a counter-protester, punching him in the back of the head, grabbing the back of his neck and throwing him to the ground.",
    "The government is resuming its prosecution of four members of the violent white supremacist group Rise Above Movement, although two of the defendants, including co-founder Robert Rundo, have apparently disappeared.",
    "During the rally, a galvanizing event for the white power movement that would come to be known as the “Battle of Berkeley,” RAM members broke through orange fencing set up to separate the opposing sides.",
    "A Ukraine-based neo-Nazi and Russian citizen named Denis Kapustin who occasionally co-hosted a podcast with Rundo, commented that Rundo was “on the run again” in October 2021, according to Bellingcat.",
    "The following spring, Rundo and other members traveled to three countries in Europe, including Ukraine, where they met with a spokesperson of the far-right National Corps party, according to the FBI.",
    "Following Unite the Right, RAM members avoided public rallies, but continued to train in hand-to-hand combat and post videos celebrating their assaults on social media, according to the government.",
    "The next month, the government alleges that co-defendant Aaron Eason rented a 12-15 passenger van to ferry RAM members from southern California to an April 15 right-wing rally in Berkeley.",
    "In one of many assaults detailed in charging documents, the government alleges that Rundo began throwing punches at different people, including one person who was falling to the ground.",
    "During a March 2017 “Make America Great Again” rally at Bolsa Chica State Beach in Huntington Beach, rally attendees pushed and punched two journalists, according to charging documents.",
    "The charging document cites a photo of RAM members meeting with Olena Semenyaka, a leader of the National Corps, a far-right political party in Ukraine aligned with Azov Battalion.",
    "The government, along with the attorneys for Eason and Laube, is proposing that the trial be scheduled to start on Dec. 13, according to a joint filing by the parties on March 17.",
    "Ryan Sanchez, a white supremacist who was kicked out of the trucker’s convoy, publicly proclaimed his association with Rise Above Movement shortly before embarking on the convoy.",
    "But by December, Rundo had apparently returned to Serbia, with a reporter from the outlet claiming to have seen him doing pushups on his balcony at his apartment in Belgrade.",
    "The government has turned over about 44,000 pages of discovery to the defendants, according to the filing, and the parties anticipate that the trial will take four weeks.",
    "During the same rally, the government alleges, co-defendant Robert Boman caught up with one of the counter-protesters, who had been fleeing, and kicked him in the back.",
    "A panel of appellate judges reversed the lower court decision in March 2021, and remanded the case back to the district court in the Central District of California.",
    "As one of the journalists stumbled backwards, according to the government RAM member Tyler Laube grabbed his shoulder and then punched him three times in the face.",
    "Three of the defendants were sentenced in July 2019 and have already served out their sentences, according to information on the federal Bureau of Prisons website.",
    "The two men’s lawyers have been unable to reach them since the Ninth Circuit’s reversal last spring, according to a recent government filing.",
    "Following an initial report that Rundo was located in Serbia in November 2020, he was reportedly expelled from the country.",
    "Despite falling into inactivity, Rise Above Movement continues to influence white power organizing in the United States.",
    "The government reopened the case on Feb. 10, and Laube and Eason appeared before Judge Cormac J. Carney on March 3.",
    "As recently as December 2021, the investigative collective Bellingcat has reported that Rundo is living in Serbia.",
    "Rep. Ro Khanna (D-Calif.) has been one of the most vocal proponents of cutting off funding to Azov in Congress.",
    "“I am proud to have known such men as Rob Rundo, Ben Daley, Tom and Michael,” Sanchez wrote on Telegram.",
    "“We must never forget our political prisoners of RAM, jailed for daring to stand against Antifa.",
    "Court documents indicate that Rundo and Boman were not present for the hearing.",
    "NOW WATCH: The neuroscience behind Will Smith's attack on Chris Rock",
    "This article was paid for by Raw Story subscribers.",
    "Prefer to give a one-time tip?",
    "Try us and go ad-free for $1.",
    "Not a subscriber?",
    "Click here."
  ]
}