{
  "id": 2288,
  "mediaId": 2716,
  "date": "2022-03-29",
  "headline": "JD Vance says Marjorie Taylor Greene did 'nothing wrong' in appearing at white nationalist conference",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1648562003/GettyImages-1238574595.jpg",
  "link": "https://theweek.com/marjorie-taylor-greene/1011893/jd-vance-says-marjorie-taylor-greene-did-nothing-wrong-in-appearing",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    0
  ],
  "sentences": [
    "At the OH Senate debate tonight, JD Vance is asked if he will condemn Marge Greene speaking at a Nazi rally: “She is my friend, and she did nothing wrong .. and I’m absolutely not going to throw her under the bus, or anybody else who is a friend of mine.” pic.twitter.com/fipwlONqc4\n— Ron Filipkowski ????",
    "Ohio Republican Senate candidate JD Vance on Monday night defended his \"friend\" (and supporter) Rep. Marjorie Taylor Greene (R-Ga.) by claiming \"she did nothing wrong\" in speaking at a white nationalist's conference last month, HuffPost reports.",
    "The congresswoman was later condemned for her participation by members of her own party, including Senate Minority Leader Mitch McConnell (R-Ky.), who said \"There's no place in the Republican Party for white supremacists or anti-Semitism.\"",
    "Greene spoke at the America First Political Action Conference, where participants \"hailed Russian President Vladimir Putin as a hero and chanted his name,\" HuffPost writes.",
    "The organizer of the conference — Nicholas Fuentes — is a prominent white nationalist activist, per The Washington Post.",
    "And Sen. Mitt Romney (R-Utah) called Greene — and fellow conference participant Rep. Paul Gosar (R-Ariz.) – \"morons.\"",
    "So it might seem all the more surprising that, at a GOP candidates' debate in Ohio, Vance stood by Greene's decision.",
    "Vance had also said it was unfair to hold only Republicans and not Democrats to \"guilt by association\" standards.",
    "Marjorie appeared at a conference \"where somebody said something bad,\" but \"did she say something bad?\"",
    "\"I'm absolutely not going to throw her under the bus, or anybody else who is a friend of mine.\"",
    "\"There's no business in the world that asks you to stab your friends in the back like politics.",
    "House Minority Leader Kevin McCarthy (R-Calif.) described Greene's attendance as \"appalling.\"",
    "\"I actually watched her remarks, I agreed with nearly every word that she said.\"",
    "\"She is my friend, and she did nothing wrong,\" Vance told the crowd.",
    "I absolutely refuse to do it to Marjorie Taylor Greene.\"",
    "\"I have morons on my team,\" Romney said, per the Post.",
    "In January, Greene endorsed Vance in his Senate bid.",
    "(@RonFilipkowski) March 29, 2022",
    "he continued."
  ]
}