{
  "id": 2363,
  "mediaId": 2526,
  "date": "2022-03-26",
  "headline": "Poll: Democrat Mark Kelly Trails Generic Republican in AZ Senate Race",
  "image": "https://media.breitbart.com/media/2020/07/mark-kelly-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/26/democrat-sen-mark-kelly-trails-generic-republican-arizona-senate-race/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    1941,
    2321,
    80,
    305,
    878,
    910,
    1072,
    1171,
    4830,
    5128
  ],
  "sentences": [
    "Kelly reportedly took in more than $55,000 in contributions during the last fundraising quarter of 2021 from “PACs of corporate trade groups and the Senate leadership committees of many of his fellow Democrats.”\nIn 2021, he also took heat from the Arizona Republican Party chair Kelli Ward, Rep. Paul Gosar (R-AZ), and the National Republican Senatorial Committee (NRSC) for being “missing in action” and for the lack of leadership the freshman member has in the Senate.",
    "The poll showed that 39 percent of the 753 Arizona registered voters who took the poll would rather have a generic Republican as their next senator instead of reelecting Kelly, which was determined by their answers to whom they would vote for if the election were “held today.”\nThirty-seven percent said they would vote to reelect Kelly.",
    "He wanted to replace it with a “talking filibuster.”\nThen, Kelly, who has banked $8.9 million, according to his last financial report, found a way to accept corporate campaign cash without going back on his word after swearing off accepting help from corporate PAC money.",
    "Early this year, he embraced the far-left side of his party by showing support to change the filibuster rule – the 60-vote threshold to advance legislation – in the Senate to help pass two voting rights reform bills.",
    "The main three sights that analyze elections and campaigns across the country — Cook Political Report, Sabato’s Crystal Ball, and Inside Elections — rated this race a “toss-up,” meaning it could go either way.",
    "However, Attorney General Mark Brnovich (R) has also taken some heat from Trump in the past for not doing more to look into possible fraud with the ballots in Maricopa County.",
    "Vulnerable Democrat Sen. Mark Kelly (D-AZ) trails a generic Republican in Arizona’s Senate race, according to a poll from OHPredictive Insights released this past week.",
    "Still, he has also taken flack from former President Donald Trump following the 2020 election as the Arizona election results came into question.",
    "The former astronaut has a list of Republicans trying to run against him after making it through the August 2 primary.",
    "Twenty-four percent indicated they were unsure of the person they wanted to represent them in the Senate next year.",
    "Another main Republican candidate is Blake Masters, a venture capitalist who has the backing of Peter Thiel.",
    "But as Breitbart News wrote last week, the election integrity issue would likely be a topic for candidates.",
    "They argued that he reneged on his promise to be “independent” from both political parties in the Senate.",
    "Doug Ducey (R), Sen. Mitch McConnell’s preferred candidate, recently ruled out running against Kelly.",
    "But he was a high-profile case with the U.S. Supreme Court, which upheld a ban on ballot harvesting.",
    "The OHPredictive Insights poll surveyed 753 Arizona registered voters between March 8 and 15.",
    "The survey was an online “opt-in” panel with a margin of error, plus or minus 3.6 percent.",
    "But since coming into office, Kelly has found himself in the middle of multiple problems.",
    "Kelly’s reelection battle will be a must-watch race on election night in November.",
    "Jacob Bliss is a reporter for Breitbart News.",
    "You can follow him on Twitter.",
    "Gov."
  ]
}