{
  "id": 2475,
  "mediaId": 5308,
  "date": "2022-03-29",
  "headline": "Congress Would Like to Know More About Madison Cawthorn’s ‘Cocaine’ ‘Orgies’ Claim",
  "image": "https://video-images.vice.com/articles/6243558912f2c5009b250282/lede/1648579994165-madison-cawthorn-coke-orgies.jpeg?image-resize-opts=Y3JvcD0xeHc6MC44NDI3eGg7MHh3LDAuMTU3M3hoJnJlc2l6ZT0xMjAwOiomcmVzaXplPTEyMDA6Kg",
  "link": "https://www.vice.com/en/article/xgdpp4/madison-cawthorn-cocaine-orgies-congress",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Blest",
  "authorUrl": "https://www.vice.com/en/contributor/paul-blest",
  "termIds": [
    1926,
    3205,
    4098,
    4384,
    872,
    4814,
    5199
  ],
  "sentences": [
    "House Republicans are pissed about Rep. Madison Cawthorn’s claim that he’s seen lawmakers do coke and been asked to partake in orgies since he came to D.C.\nCawthorn, a 26-year-old freshman Republican lawmaker from North Carolina who identifies with the far-right of the party and recently drew criticism from Republican leadership for calling Ukrainian President Volodymyr Zelenskyy a “thug,” said during a podcast interview last week that he’d seen “people that are leading on the movement to try and remove addiction in our country” do a “key bump” of cocaine in front of him.",
    "House Minority Leader Kevin McCarthy, who has come under scrutiny for refusing to criticize the far-right of his party—including former President Donald Trump and Reps. Marjorie Taylor Greene and Paul Gosar—reportedly said he would have a meeting with Cawthorn to talk about his comments.",
    "And then you realize they are asking you to come to an orgy.”\nCawthorn’s comment has reportedly frustrated House Republicans, and the issue came up during a House Republican Conference meeting Tuesday, according to Politico.",
    "Asked about Cawthorn’s performance so far, Burr told CNN: “That’s for his constituents to figure out but clearly he’s been an embarrassment at times.”\nCawthorn’s office did not immediately return a request for comment.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "Alabama Rep. Steve Womack said he’d been getting questions about participants in the orgies and told colleagues that many lawmakers go to bed early and still use outdated technology, Politico reported.",
    "After news of Cawthorn’s comments being discussed at the meeting broke, Cawthorn tweeted cryptically: “Signal, not noise.”\nWant the best of VICE News straight to your inbox?",
    "The podcast host had asked Cawthorn if the Netflix series House of Cards was anything like his experience in D.C., and Cawthorn said he’d also been invited to orgies.",
    "“I look at all these people, a lot of them that I’ve looked up to through my life, I've always paid attention to politics,\" Cawthorn replied.",
    "“Then all of a sudden you get invited to, ‘Well, hey, we’re going to have kind of a sexual get-together at one of our homes, you should come.",
    "Senator from North Carolina, criticized Cawthorn’s penchant for drama Tuesday.",
    "Sen. Richard Burr, the soon-to-retire senior U.S.",
    "Sign up here."
  ]
}