{
  "id": 2499,
  "mediaId": 2629,
  "date": "2022-03-29",
  "headline": "House Republicans Enraged By Cawthorn’s ‘Orgy’ And 'Cocaine Bump' Claims",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNzE4NzQyNy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY1NjcwNTI5MH0.yozCivKJ193VTBsChUp2GnGukxcKqRJJtzO0Nv9BbLM/img.jpg?width=1200&coordinates=0%2C133%2C0%2C134&height=600",
  "link": "https://www.nationalmemo.com/house-republicans-enraged-by-cawthorns-orgy-and-cocaine-claims",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Singer",
  "authorUrl": "https://www.nationalmemo.com/u/emily-singer",
  "termIds": [
    1926,
    2430,
    3267,
    4384,
    472,
    831,
    878
  ],
  "sentences": [
    "Cawthorn's fellow Republicans are angry about remarks he made during a \"Warrior Poet Society\" podcast on March 24, when he was asked how close the television series \"House of Cards\" came to the reality of Washington, D.C. Cawthorn accused lawmakers of having orgies and doing cocaine:\nThe sexual perversion that goes on in Washington, I mean, being kind of a young guy in Washington, where the average age is probably 60 or 70 — look at all these people, a lot of them that I've looked up to through my life, I've always paid attention to politics.",
    "Neither one was punished, however, and McCarthy said that he may give both Gosar and Greene, who was removed from her own committees over offensive remarks, their committee assignments back if Republicans win control of the House in the midterm elections.",
    "Or the fact that, you know, there's some of the people that are leading on the movement to try and remove addiction in our country, and then you watch them do a key bump of cocaine right in front of you.",
    "According to an investigative report published by the Washington Post on February 27, 2021, Cawthorn lied about the accident that left him paralyzed; about the fact that he was rejected by the U.S.",
    "House Minority Leader Kevin McCarthy will talk with North Carolina Republican Rep. Madison Cawthorn about his recent claim that lawmakers in Washington have orgies, according to Politico and CNN.",
    "Politico reported that House Republicans have demanded Cawthorn identify any people who were involved in the activities he alleged to prove that the claims are true.",
    "However, McCarthy's talk with Cawthorn looks to be coming faster than his conversations with other GOP lawmakers who have made offensive comments.",
    "McCarthy also slow-walked a condemnation of Gosar and Rep. Marjorie Taylor Greene (R-GA) for attending a conference held by a white supremacist.",
    "Then all of a sudden you get invited to, like, Hey, we're going to have kind of a sexual get-together at one of our homes, you should come.",
    "Cawthorn does have a documented history of lying about everything from his own personal origin story to voter fraud and rigged elections.",
    "It took him a week to speak to Rep. Paul Gosar (R-AZ), who had tweeted a violent video featuring Rep. Alexandria Ocasio-Cortez.",
    "Ultimately, it's unclear whether McCarthy will punish Cawthorn for the comments that have angered the Republican conference.",
    "McCarthy never punished Cawthorn after he was arrested earlier in March for driving with a revoked license.",
    "McCarthy said he had conversations with them, but never publicly condemned them while cameras were rolling.",
    "He didn't punish him last August after Cawthorn warned of \"bloodshed\" over \"rigged\" elections.",
    "Gosar eventually was censured and removed from his committee assignments over the video.",
    "And then you realize they're asking you to come to an orgy.",
    "Naval Academy; and about his work history.",
    "What did you just ask me to come to?",
    "And it's like, this is wild.",
    "madison cawthorn"
  ]
}