{
  "id": 2627,
  "mediaId": 2741,
  "date": "2022-03-29",
  "headline": "Orgies, Beheadings, Jewish Space Lasers: Everything Kevin McCarthy Has Had to “Speak” to Republican Lawmakers About",
  "image": "https://media.vanityfair.com/photos/60f6e5fc876bb9834a7fcf0f/16:9/w_1280,c_limit/McCarthy7.20.jpg",
  "link": "https://www.vanityfair.com/news/2022/03/madison-cawthorn-kevin-mccarthy-orgies-coke",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bess Levin",
  "authorUrl": "https://www.vanityfair.com/contributor/bess-levin",
  "termIds": [
    1768,
    1926,
    2599,
    3267,
    3975,
    4384,
    878
  ],
  "sentences": [
    "So we thought it was time to start a list of all the things McCarthy has had to pull a lawmaker aside for:\nThe time Representative Paul Gosar made and disseminated a video depicting him swinging a sword at Joe Biden’s head and decapitating Alexandria Ocasio-Cortez (McCarthy told CNN he spoke to Gosar, without condemning Gosar’s behavior)\nThe time Representative Marjorie Taylor Greene called for Nancy Pelosi to be executed for treason, harassed a school-shooting survivor on the street, blamed the California wildfires on Jewish laser beams, and espoused the ideas of QAnon (McCarthy refused to discipline the congresswoman and claimed that, during a private conversation, she “recognized” that she needed to hold herself to a higher standard)\nThe time Greene spoke at a white nationalist conference (McCarthy admitted this was bad but, following a conversation with Greene, declined to hold her accountable, saying, “my conversations with my members are exactly that.”)\nThe time Representative Lauren Boebert made Islamophobic comments about Representative Ilhan Omar (McCarthy obviously refused to condemn her but, rest assured, they had a chat!)",
    "No real surprise here: It’s Madison Cawthorn, the 26-year-old North Carolina Republican who once had Adolf Hitler’s Eagle’s Nest on his vacation bucket list, and recently called Volodymyr Zelenskyy a “thug.”\nThose things, though, apparently didn’t necessitate a chat with the GOP leader; in this case, the two will be having a conversation because Cawthorn claimed on a podcast last week that people he’s “looked up to” in Washington regularly invite him to orgies and use cocaine in his presence, which didn’t go over great with his colleagues.",
    "Earlier today, Politico reported that during a close-door Republican meeting on Tuesday, GOP members of the House “stood up to air their anger and frustration over Cawthorn portraying his own colleagues as bacchanalian and sexual deviants.” Arkansas representative Steve Womack, for one, reportedly said that though he rarely speaks out during these weekly sessions, he couldn’t in good conscience let this one slide, now that he’s personally received questions about these alleged cocaine-fueled orgies.",
    "— Grimes on Music, Mars, and Her Secret New Baby With Elon Musk\n— Trump Is Blowing a Gasket Over His Joke of a Social Media Network\n— How the Atlanta Spa Shootings Tell a Story of America\n— Inside the Succession Drama at Scholastic\n— Trump Is Now Spitballing Ways to Launch More Russian War, Then “Sit Back and Watch”\n— The Psychology Behind Putin’s War\n— From the Archive: How a Once Faceless Putin Took Control of the World’s Largest Country\n— Not a subscriber?",
    "Orgies, Beheadings, Jewish Space Lasers: Everything Kevin McCarthy Has Had to “Speak” to Republican Lawmakers About\nWhen he’s not blaming Joe Biden for the latest global crisis, it appears that most of House minority leader Kevin McCarthy’s job these days revolves around giving stern but meaningless talks to members of his own caucus for the ridiculous, crazy, racist, and/or violent things they do and say.",
    "(Cawthorn has denied such allegations and claimed during his campaign, “I have never done anything sexually inappropriate in my life.”)\nAnyway, McCarthy’s response was that he plans to speak with Cawthorn about the claims, which is what McCarthy says every time one of his members does something ridiculous, racist, or violent.",
    "(Womack added, per Politico, that “many lawmakers go to bed at 9 p.m. and still use fax machines and flip phones.”) Others “wondered if [Cawthorn] made the comments consciously in a bid to portray himself above such acts,” given that the North Carolina representative has previously been accused of sexual misconduct.",
    "Naturally, McCarthy does not appear to have had any of these performative talks with members of his party over their attempt to help Donald Trump overturn the last election, as that’s the kind of behavior he welcomes.",
    "If you would like to receive the Levin Report in your inbox daily, click here to subscribe.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "— Can Ukrainian Freedom Fighters Stand Up to the Russian Military?",
    "Who’s the latest to get pulled aside for one such chat?",
    "It looks like we're experiencing playback issues.",
    "Our bad!"
  ]
}