{
  "id": 2661,
  "mediaId": 2627,
  "date": "2022-03-21",
  "headline": "McCarthy readies plan to kick Schiff off House Intelligence panel",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220321-Adam-Schiff-al-0854-eb2346.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/mccarthy-readies-plan-kick-schiff-house-intelligence-panel-rcna20844",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    1726,
    1878,
    1924,
    1926,
    3267,
    171,
    878,
    1164,
    4984
  ],
  "sentences": [
    "Second, if McCarthy is concerned about the politicization of the House Intelligence panel, I’d love to introduce the minority leader to Devin Nunes — who, during his tenure as Schiff’s predecessor, literally held secret meetings at the Trump White House as part of a ham-fisted political scheme.",
    "The conservative Washington Times reported:\nAfter making some strange comments about Hunter Biden’s laptop — yes, this is apparently a popular topic again in Republican circles — the would-be House Speaker shared a little rant about Schiff during a Capitol Hill press conference.",
    "As far as McCarthy and other GOP leaders are concerned, this opened the flood gates: If Democrats can make such decisions about Greene and Gosar, then Republicans can make related decisions about Schiff — and presumably any other Democrat who annoys the right.",
    "Because as far as Republicans are concerned, Democrats effectively rewrote the rules when they stripped two far-right congressional extremists — Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona — of their committee assignments.",
    "It’s a little too soon to say with confidence what will happen in the fall’s midterm elections, but House Republicans aren’t making much of an effort to hide their optimism.",
    "The problem, to the extent that reality matters, is that Gosar and Greene were punished for a specific reason: They’re members who were accused of espousing violence.",
    "If Schiff wants to remain on the House Intelligence Committee in the next Congress, he’d need the support of Democratic leaders, not GOP leaders.",
    "What McCarthy described on Friday is something different: To reject conspiracy theories about Hunter Biden’s laptop is also to cross a line.",
    "And third, it ordinarily wouldn’t matter whether one party’s leadership doesn’t like another party leadership’s committee assignments.",
    "Democrats didn’t change the rules so much as they set a standard: To talk of political violence is to cross an important line.",
    "To hear the minority leader tell it, the California Democrat has both “lied” and “politicized” the intelligence committee.",
    "Evidently, kicking House Intelligence Committee Chairman Adam Schiff off the powerful panel is on the list.",
    "You cannot make this committee political.”\nLet’s unpack this a bit because it’s likely to be important.",
    "First, there’s little to suggest Schiff has done what McCarthy has accused him of doing.",
    "In fact, GOP leaders are already drawing up plans on what they’ll do with power.",
    "Recommended\nSo why is McCarthy vowing to remove Schiff from the key panel?",
    "There are three elements to the story that are worth keeping in mind.",
    "And why is he even on the committee?” McCarthy asked rhetorically.",
    "“In a new Congress, if it’s a new majority, he will not be.",
    "“Why is he still chair of the committee?",
    "He’s actually done neither."
  ]
}