{
  "id": 2843,
  "mediaId": 2664,
  "date": "2022-03-16",
  "headline": "White nationalist praises ‘Czar’ Putin and Russian troops invading Ukraine: ‘The pride of Moscow’",
  "image": "https://www.rawstory.com/media-library/white-nationalist-nick-fuentes.jpg?id=29548268&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/nick-fuentes-russia-ukraine-invasion/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1328,
    2201,
    3242,
    3709,
    437,
    5164,
    5287,
    5366
  ],
  "sentences": [
    "The Southern Poverty Law Center (SPLC) said following the Jan. 6 attack on the U.S. Capitol that Fuentes is a \"white nationalist who rose to prominence after attending the deadly 2017 'Unite the Right' rally in Charlottesville, has been encouraging his followers to attend 'Stop the Steal' events since the movement arose in November.\"",
    "Fuentes hosted a white nationalism conference in February that was attended by Rep. Marjorie Taylor Greene (R-GA), Rep. Paul Gosar (R-AZ), Arizona state Sen. Wendy Rogers, and Janice McGreachin, Idaho's GOP lieutenant governor.",
    "Former President Donald Trump praised the \"genius\" invasion as \"pretty savvy\" and Fox News personality Tucker Carlson has been harshly criticized for spreading Kremlin propaganda.",
    "Now Nick Fuentes, who is described by the Anti-Defamation League (ADL) as \"a prominent white supremacist pundit and organizer,\" is openly saluting Russian troops on his podcast.",
    "\"We continue to support Czar Putin and the war effort,\" Fuentes said, urging his supporters to keep Russian troops \"in our prayers and in our thoughts\" as he saluted the camera.",
    "He said Russian soldiers \"were continuing to liberate Ukraine from the Great Satan and from the evil empire in the world, which is the United States.\"",
    "Prominent far-right political voices in America are continuing to praise Vladimir Putin as Russian troops continue their invasion of Ukraine.",
    "\"Our hearts go out to you, the pride of the czar, the pride of Moscow — we continue to root for them as they liberate Ukraine,\" he said.",
    "In a new video, Fuentes praised the invading Russian troops, who have been widely accused of war crimes."
  ]
}