{
  "id": 2873,
  "mediaId": 2594,
  "date": "2022-03-16",
  "headline": "Biden sees both rare support and calls to do more from GOP after Zelensky speech to Congress",
  "image": "https://static.independent.co.uk/2022/03/16/20/SEI93810011.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/gop-biden-no-fly-zone-b2037565.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Bowden",
  "authorUrl": "https://www.independent.co.uk/author/john-bowden",
  "termIds": [
    0
  ],
  "sentences": [
    "“This new package, on its own, is going to provide unprecedented assistance to Ukraine,” Mr Biden said, while warning: \"I want to be honest with you: This could be a long and difficult battle.”\nPolls suggest that Mr Biden’s handling of the crisis is slowly gaining in popularity among Americans, who largely support the idea of aiding Ukraine with humanitarian and military shipments while a majority opposes drawing the US into a direct war with Russia.",
    "Congressman Tom Cole of Oklahoma, a Republican and deputy whip of the GOP House caucus, spoke to The Independent shortly after Mr Zelensky’s speech concluded and said he was struck by the bravery of the Ukrainian president and his top aides while describing the remarks as a “Churchillian” moment for a leader who had rapidly risen to global prominence in just a few weeks.",
    "Other Republicans within the leadership-aligned corner of their party have offered less supportive statements in recent days, with much of their criticism of the White House centered on calls for the Biden administration to embrace greater US production of fossil fuels to offset the impact of the ban on all Russian oil and gas imports.",
    "After Ukraine President Volodymyr Zelensky addressed the US Congress on Wednesday in a historic virtual speech from his secure location in Kyev, GOP lawmakers had little criticism for the embattled leader’s US counterpart – a rare respite from the hardline opposition Republican leaders have shown the White House for months.",
    "Not for us to be afraid of them,’ in terms of escalation.”\nHe also made one revealing remark that indicated the GOP will have little to say about the mounting cost of military and aid to Ukraine, telling The Independent, “money is not an object, no one’s debating that”.",
    "Roughly four in 10 Americans oppose the establishment of a no-fly-zone in Ukraine’s airspace when told that it would lead to a situation in which US forces could end up being drawn into the conflict, according to a poll released this week from Yahoo News and YouGov.",
    "Rep Elise Stefanik, who replaced Rep Liz Cheney as chair of the House GOP conference, reacted to Wednesday’s event by calling on the Biden administration to reverse its decision to oppose a transfer of MiG-29 fighter jets from Poland’s military to Ukraine.",
    "“You know, I think the administration is appropriately cautious about risking combat in the skies over Ukraine, but if the Russians were to use chemical weapons or a tactical nuclear weapon, then I think things change the calculus,” he said.",
    "Putin!” hosted by a white nationalist, Nick Fuentes, who this week doubled down on his support of the invasion with a post on Telegram of the letter “Z”, which has come to be known as a symbol of support for Russia’s military.",
    "The congressman did note that there should be a “red line” somewhere in the sand, however, potentially meaning that the US would engage directly if Russian forces were to use chemical weapons or “a tactical nuclear weapon”.",
    "They have not, however, gone as far as some far-right members of their party like Rep Madison Cawthorn and activists like Candace Owens and taken the opposite stance of Mr Biden’s vocal support for Ukraine’s government.",
    "Recommended\nAfter the address from Ukraine’s president, Mr Biden announced yet another round of military aid bound for Kyiv, including anti-aircraft and anti-armor weaponry, as well as smaller arms and drones.",
    "On that issue, he appeared to agree with Mr Biden, who has signaled that the US will not use troops to defend Ukrainian soil or enter a situation that could lead to direct combat with Russian forces.",
    "The Republican establishment in Washington is warming to President Joe Biden’s response to Russia’s invasion, while some on the far right question whether to support Ukraine at all.",
    "Recommended\nMr Cole, ranking member on the powerful House Rules Committee, went on to address the debate over how the US would continue to support Ukraine going forward.",
    "Two other members of Congress, Rep Paul Gosar and Rep Marjorie Taylor Greene, recently attended a far-right conference where attendees broke out in chants of “Putin!",
    "Her comments, interestingly, echoed those of some Democrats including Rep Tim Ryan, a centrist facing a tough battle for Ohio’s open Senate seat this year.",
    "In a longer statement released via her office, she went on to blame the White House for responding to the crisis with “weakness and delay”.",
    "For that reason, the discussion about a no-fly-zone was a “serious debate, and I think a legitimate debate”, according to Mr Cole.",
    "“The Ukrainian people need those MiGs, and they need them now they needed them yesterday,” she said at a press conference.",
    "Mr Cawthorn on Wednesday rushed past reporters as he arrived to the chamber for the tail end of Mr Zelensky’s speech.",
    "And whose garnered the stature that Zelensky garnered over the last two or three weeks,” said Mr Cole.",
    "A guy that the Russians have, we know, tried to assassinate multiple times in the last few weeks?",
    "“Anybody ever seen a foreign leader addressing the United States Congress from a combat zone?",
    "“I think Congress wants to do more, and it will figure out a way to do that,” he said.",
    "Senator Romney said it pretty good recently, ‘it’s time for them to be afraid of us.",
    "“It was a powerful speech and clearly well thought through,” he added.",
    "Quoting one of his Senate colleagues, he added: “I think ..."
  ]
}