{
  "id": 2958,
  "mediaId": 2594,
  "date": "2022-03-09",
  "headline": "Kevin McCarthy dodges question on repercussions for Marjorie Taylor Greene again",
  "image": "https://static.independent.co.uk/2022/03/02/06/2022-03-02T054029Z_570241108_RC2ZTS9DBPJA_RTRMADP_3_USA-BIDEN.JPG?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/mccarthy-greene-gosar-white-nationalists-b2032449.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Bowden",
  "authorUrl": "https://www.independent.co.uk/author/john-bowden",
  "termIds": [
    1726,
    1768,
    1926,
    2304,
    3242,
    3267,
    3709,
    275,
    1163
  ],
  "sentences": [
    "The two members of Congress who attended the white nationalist-led conference last month both have a history of their own questionable statements and views on the issue of race in America; Mr Gosar has ties to an extensive list of far-right and white nationalist figures, while Ms Greene has famously made bizarre comments about race including the assertion that white men are the most persecuted racial demographic in the US.",
    "Speaking at a news conference on Wednesday, Mr McCarthy confirmed to reporters that Reps Marjorie Taylor Greene and Paul Gosar still had avenues to returning to active roles on House panels even after they were both publicly chastised for attending an event billed as a far-right alternative to the Conservative Political Action Conference (CPAC) hosted by a semi-famous white nationalist, Nick Fuentes.",
    "The February event in question was a PR disaster for the GOP, which saw coverage of CPAC overshadowed by Ms Greene’s attendance and onstage presence alongside Mr Fuentes as she delivered remarks to the group; Mr Fuentes, in his own remarks, would quip that a comparison of Vladimir Putin to Adolf Hitler may be meant as a compliment to the Russian leader.",
    "The prospect of Ms Greene and Mr Gosar returning to their committees next year remains very relevant given the current likelihood that Republicans will retake the chamber in November’s midterms, and especially as Mr McCarthy seeks to hold on to his control of his caucus and potentially be elected Speaker.",
    "Former Congressman Steve King was stripped of his committee assignments for remarks in support of such beliefs before he was defeated in a GOP primary, but in recent months Mr McCarthy and the GOP establishment has shown less and less willingness to stand up to its own members on such issues.",
    "House Minority Leader Kevin McCarthy faced tough questions over whether he stood by statements indicating that two far-right members of his caucus could resume their roles on congressional committees if the GOP wins control of the chamber in the fall.",
    "His remarks come as he and other Republican leaders are facing withering criticism for their continued tolerance of the connections between far-right members of their party and white nationalist groups or figures.",
    "The crowd also dissolved into chants of “Putin!” at one point, a knife in the side of the GOP’s efforts to portray their party as strong opponents of Russia and its invasion of Ukraine.",
    "He also refused to indicate whether the two lawmakers would face any repercussions behind the scenes, telling reporters that his conversations with members would not be made public.",
    "“They have the ability to get committees based on the time when it comes,” Mr McCarthy cryptically told reporters on Wednesday of Mr Gosar and Ms Greene."
  ]
}