{
  "id": 2971,
  "mediaId": 2658,
  "date": "2022-03-12",
  "headline": "Can a British Documentarian Crack the Gen-Z Far Right?",
  "image": "https://static.politico.com/67/35/fb9b756941dc9ff89263116a772d/mag-gettyimages-492682728-1.jpg",
  "link": "https://www.politico.com/news/magazine/2022/03/12/louis-theroux-genz-far-right-00016750",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1726,
    2201,
    3037,
    3242,
    4984,
    5370,
    5371
  ],
  "sentences": [
    "Sweaty and red-faced, standing in the middle of the street during the dark early hours of the Florida morning, he heaps invective on Theroux, asking him, “Why don’t you apologize for your fucking ancestors from thousands of years ago, because you’re white, Louis, aren’t you?”\nAnother confrontation between Theroux and a particularly nasty follower bearing the pseudonym “Beardson Beardly” ends with the latter working himself into a spittle-flecked rage after Theroux questions him about his motivation for waving a Nazi salute on camera.",
    "Initially game for Theroux’s presence during one of his bizarre, roving livestreams, Alaska turns hostile when Theroux challenges him about his public flip-flopping in and out of the alt-right and the real-world consequences of his hateful life-as-performance-art, insomuch as they’ve stoked the anger around events like Charlottesville or Jan. 6.",
    "Some of his greatest hits include his vocal participation in the Charlottesville “Unite the Right” rally (and participation in a Freedom Plaza rally on Jan. 6), protesting the Republican candidates in the 2021 Georgia Senate runoff election and somehow being offensive enough to get booted from Jason Miller’s right-wing “Gettr” social media app.",
    "It’s also an unexpectedly newsworthy one, making its unavailability in the States even more tragic: In it, Theroux immerses himself in the world of the white nationalist internet troll Nick Fuentes, whose “America First Political Action Conference” was attended by Republican Reps. Marjorie Taylor Greene (R-Ga.) and Paul Gosar (R-Az.)",
    "The 51-year-old British documentarian broke out with a late-1990s BBC2 series titled “Louis Theroux’s Weird Weekends,” in which Theroux — with his Brit pop-chic mop of hair, round glasses and almost naively straightforward interviewing technique — chronicled some of the United States’ most outré subcultures for a U.K. audience.",
    "Now, thanks to the internet, his message reaches young people in homes around the world, his avowed aim to undermine democracy and advance the power of white men using irony to mask an ambition that is deadly serious.”\nAll of which rings true, but feels unsatisfying after spending an hour in such unpleasant company.",
    "Fuentes is, despite his widespread deplatforming, unquestionably the figurehead of what he refers to as his “Groyper Army,” the loosely-defined group of young trolls who hope to leverage the energy and resentment that surrounded Donald Trump’s election toward a resurgence of outright racist American politics.",
    "Having realized the pointlessness of attempting to penetrate Fuentes’ “ideology” insomuch as it exists beyond its function as “triggering” his opponents, Theroux simply muses, “[Fellow white supremacist troll] Baked Alaska thinks you’re going to be president one day.”\n“Eh, I don’t know about that.",
    "The humor of Theroux getting in a quick freestyle verse with a couple of rappers young enough to be his sons, or enduring a graphic line of questioning about his own sexual preferences, recalls the early “Weird Weekends” days, while serious subject matter is treated with appropriate gravity.",
    "His most recent BBC2 series, concluded just last weekend, should be no different: “Louis Theroux’s Forbidden America” is a three-part revisiting of some of his old favorite subjects, examining how various subcultures have undergone massive and fundamental changes in the social media era.",
    "Dealing with intense issues like gun violence, fatal drug abuse and sexual violence, the show is a difficult watch at times — but perfectly successful in its goal of providing context and emotional depth for various groups presumed far outside the viewers’ frame of reference.",
    "An owlish, six-foot-two Oxford graduate gently probes the edges of a Southern California swingers’ party, or steps into the booth for a rap battle live on Georgia radio: To a certain kind of culturally omnivorous viewer, these are not exactly a hard sell.",
    "Theroux questions Fuentes backstage at his own AFPAC, and together they examine some faulty merchandise that proclaims “America First Bitch.” “There should be a comma there, because it’s not like, you know, ‘I’m an America First Bitch,’” Fuentes stammers.",
    "Hate is as much a part of the human experience as sex, or status competition, or creativity, and as Theroux points out, its most concentrated and weaponized form is available at a far larger scale than it has been at any other point in history.",
    "Introducing viewers to subcultures like Florida trap, or the modern crop of self-made porn moguls, has a clearly edifying purpose in helping the viewer see more fully the spectrum of humanity across stark lines of race, class and gender.",
    "Fuentes works himself into an awkward lather, declaring that CPAC “sucks,” is “gay,” and is “not conservative” before mimicking the former President Trump’s trademark “bye-bye” and storming off after being refused tickets to the event.",
    "They also became more serious as the years passed, covering subjects like the limits of inner-city policing or even the inhumane trade in (ahem) exotic animals long before such topics were at the center of the American conversation.",
    "That’s the worst possible outcome.”\nTheroux’s most significant face-time with Fuentes comes during a visit to his studio — that is to say, his parents’ basement in the western Chicago suburbs — from which he broadcasts his program.",
    "Theroux looks even more exhausted than Fuentes by its end, spending the program’s duration rubbing his eyes and staring at his phone, alternately attempting to track his aimless logic and marveling at the program’s massive reach.",
    "Is it possible to puncture that irony and gain some genuine insight about what it means for the 22-year-old Fuentes and his young followers to alienate themselves so thoroughly from society in favor of their internet cloister?",
    "“Baked’s political self-labeling was, in the end, immaterial,” he declares in a closing voice-over, by way of deciding that rather than breaking through an imagined shell, it’s worth simply taking this cadre at their word.",
    "Of the three episodes, the final two are vintage Theroux: “Rap’s New Frontline” and “Porn’s MeToo” are humane looks at the world of Florida trap music and the shifting balance of power in the porn industry, respectively.",
    "Fuentes and his gaggle of attention-seekers occupy a similar space to the latter in our cultural imagination as a tiny yet vocal band of ideologues who live solely for the shock and horror that follows their stunts.",
    "And if it doesn’t work out, then I’ll abandon it… It worked out.’”\nThe taping is dull and interminable, with Fuentes delivering one of his trademark, performatively bigoted rants in front of a shabby green screen.",
    "The climax of this episode comes during a confrontation between Theroux and Baked Alaska, real name Anthime Gionet, a wayward former BuzzFeed journalist turned full-time far-right troll (and Jan. 6 defendant).",
    "The question of what’s gained from covering Fuentes, on the other hand, is a new and difficult one — especially in the internet era, where old frameworks about “platforming” have become woefully inadequate.",
    "The episode begins in Orlando last year, as Fuentes and his entourage made their perennial attempt to crash the Conservative Political Action Conference, hoping to advertise their own rival event.",
    "For years most weren’t available in the United States due to rights issues and were traded around the U.S. internet like samizdat — which, of course, only enhanced Theroux’s cult status stateside.",
    "As a journalist who has always relied on his plaintive questioning style and inherent British “otherness” to evoke sincerity from his subjects, Theroux faces a particularly difficult challenge.",
    "“His record of racist, homophobic and misogynistic views spoke for itself, a vast digital catalogue of the internet… Twenty years ago, Nick Fuentes would have been an almost invisible figure.",
    "Which is what ultimately casts an unintentional sadness over his attempt to break through the trolls’ façade: He’s unsuccessful because, yes, at the end of the day Fuentes et al.",
    "Before his ban from Twitter he enjoyed more than 120,000 followers, and despite his ban from YouTube in February 2020, his content is still widely available on the platform.",
    "For journalists seeking to understand this new generation of the far right, that takeaway alone is worth spending an otherwise unpleasant 59 minutes in their company.",
    "Theroux is no stranger to American hate, having embedded with the infamous neo-Nazi Tom Metzger and the virulently anti-gay Westboro Baptist Church, among others.",
    "Fuentes, the movement’s frontman, is far more composed under Theroux’s questioning than his various charges, who respond to it by throwing adolescent tantrums.",
    "Theroux’s documentaries manage to be funny without mocking their frequently odd subjects, and uncommonly sensitive while maintaining a journalistic rigor.",
    "Despite being banned from every major social media platform, Fuentes’ rants are still broadcast worldwide to anyone who cares to seek them out.",
    "Theroux’s career is part of the grand English tradition of using irony to better understand the world at large, not negate it or push it away.",
    "But to them, weaned from childhood on the most extreme content and language imaginable, it’s just how life is — and they like it that way.",
    "Yes, Fuentes and his followers are racists, and yes, it’s all a joke to them, and yes, they have a real and dangerous political project.",
    "What happens when his brand of arch, almost whimsical Gen-X irony meets the impenetrable nihilism of Fuentes’ 4chan-borne Zoomer irony?",
    "To see that irony break on the rocks of Fuentes’ smug visage is to see a failure of sorts, but it still enlightens the viewer.",
    "Yes, this is all a contradiction in terms, forcing them into preposterous rhetorical contortions that render them incoherent.",
    "They are incapable of leaving their mental playpen of transgression because the internet has made it so they never have to.",
    "Theroux is steely in both cases, having seen far more authentically intimidating ideologues than the likes of these kids.",
    "From a humanist perspective, that self-nullification is a tragedy, apparent in the trolls’ dead eyes and quivery smirks.",
    "Some question whether covering Fuentes at all simply amplifies his hateful message with no further inherent news value.",
    "“And I told them, ‘Why don’t you just give me one year to explore this, and if it works out, I’ll keep doing it.",
    "But he’s also unsuccessful because they simply don’t speak his language — that is, the language of humanity.",
    "The Discord server in their pockets provides them with a wan and ever-present simulation of real life.",
    "I would, not gonna lie,” Fuentes says, mimicking Trump’s mannerisms with an eerie, studied similarity.",
    "Of course, he’s done quite well gathering attention himself without journalists’ assistance.",
    "The new generation of alt-right trolls suffer from a terminal case of irony poisoning.",
    "You gotta get a job, you gotta go to school or have a plan,’” Fuentes responds.",
    "The first episode, “Extreme and Online,” is a different proposition entirely.",
    "He’s just in the basement, recording, like, homemade videos?’” Theroux asks.",
    "Were your parents pushing back at all, thinking like, ‘What’s Nick doing?",
    "It’s the exact opposite of how Fuentes deploys the same force.",
    "“But you’d like to be,” Theroux offers cautiously.",
    "And if not, what’s the point of talking to them?",
    "Louis Theroux is an extremely likely cult hero.",
    "They said, you know, ‘What are you gonna do?",
    "“That makes it sound like you’re the bitch.",
    "“They messed it up,” Theroux responds.",
    "last month to widespread outrage.",
    "“You dropped out of college.",
    "are simply racist weasels.",
    "Maybe,” Fuentes responds.",
    "Alaska short-circuits.",
    "“They pushed me.",
    "“I would."
  ]
}