{
  "id": 3060,
  "mediaId": 2641,
  "date": "2022-03-08",
  "headline": "Rep. Rosendale Leads Effort to Stop Ukraine Funding Without Border Wall Completion",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=3d743380-180d-4173-b617-3e9b0a429942&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/mattrosendale-southernborderwall-ukraine/2022/03/08/id/1060293/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Frankel",
  "authorUrl": "",
  "termIds": [
    1911,
    1926,
    2817,
    3141,
    3213,
    4197,
    4358,
    4373,
    1163,
    5366
  ],
  "sentences": [
    "Rosendale wrote on Twitter that “the American people are sick and tired of career politicians consistently putting the interests of foreign nations above our own, we must put America first.”\nLast month, Rosendale introduced the “Secure America’s Borders First Act.”\nAccording to Breitbart, Rosendale’s bill, which is co-sponsored by Reps. Andy Biggs, R-Ariz., Bob Good, R-Va., Matt Gaetz, R-Fla., Paul Gosar, R-Ariz., Jody Hice, R-Ga., Mary Miller, R-Ill., Ralph Norman, R-S.C., Bill Posey, R-Fla., and Randy Weber, R-Texas., would require the federal government to restart building the border wall and to continue building 30-foot steel bollard barriers along the border with Mexico.",
    "Before warmongers rush America into another foreign conflict over the border of an Eastern European nation thousands of miles from our shores, at the very least they should ensure our southern border is secure first.”\nThe Biden administration is currently seeking over $10B to protect Ukraine, even as it spends $6M daily to not build the border wall, according to Breitbart.",
    "While our nation has miserably failed to secure our own border and protect our own territorial integrity, we are now being told by ‘America Last’ politicians on both sides of the aisle, that it is our obligation to do so for Ukraine.",
    "A group of House Republicans, led by Rep. Matt Rosendale, R-Mont., is attempting to stop taxpayer money from being sent to Ukraine while the wall along the Southern border remains unfinished.",
    "When introducing his legislation, Rosendale stated that “[I]n Joe Biden’s first year in office, we have seen an invasion of over 2 million illegal aliens at our southern border."
  ]
}