{
  "id": 3068,
  "mediaId": 2699,
  "date": "2022-03-10",
  "headline": "Conservatives Try to Hold Up Ukraine Aid for Bullshit Reason",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_675,w_1200,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1646935146/220309-border-wall-ukraine-hero_v6l9r3",
  "link": "https://www.thedailybeast.com/conservatives-try-to-hold-up-ukraine-aid-for-bullshit-reason?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Shannon Vavra",
  "authorUrl": "https://www.thedailybeast.com/author/shannon-vavra",
  "termIds": [
    1926,
    3267,
    3434,
    3621,
    3975,
    4197,
    878,
    5287,
    5366
  ],
  "sentences": [
    "Fox News’ Tucker Carlson jumped on Russia’s aggression on the border last month, claiming that Russia’s buildup of troops on its border with Ukraine was a simple “border dispute.”\nBut comparing immigration flows into the United States to a military invasion of a sovereign nation is a false equivalence and should be ridiculed, according to Brett Bruen, a former U.S. diplomat and former director of global engagement at the White House.",
    "“As heartbreaking as it is, Ukrainian borders are not vital to our nation.”\nGosar continued that, even after Russia’s invasion into Ukraine, “our own border remains more important to our national security and it must be protected.”\nThese Republicans are so committed to their quixotic bill that they’re actually willing to railroad aid to Ukraine—and shut down the government—to make their point.",
    "“If we're gonna do it together,” said Good, a member of the House Freedom Caucus, ”it ought to have border security for us.”\nRepublicans have been raising questions about the status of the southern border for months now, seizing on Russia’s buildup on Ukraine’s border in 2021 and early this year as a way to criticize Biden’s handling of the southern border.",
    "No matter how much these Republicans want to clamor on about the southern border and suggest that it should take precedence over Ukraine, though, the U.S. Department of Defense has assessed that the “primary” threat to the homeland right now is not immigration flows at the southern border, but rather—you guessed it—Russia.",
    "Just days before Russia invaded Ukraine, a small group of Republican lawmakers seized on Russia’s buildup of troops on the Ukrainian border to make a tenuous point about a situation 6,600 miles away: President Joe Biden needs to do something about the southern border of the United States.",
    "“We should be doing everything we can as fast as we can to get that into their hands.”\nGood acknowledged there are differences between an attack in Ukraine and immigration issues at the southern border—though he insisted an “invasion” was happening at the southern border.",
    "Good acknowledged some of the heft behind the bill’s introduction is about messaging, noting the bill is a way to say, “‘Hey, should we not be as concerned or more concerned about our own border, as we are Ukraine's border?’”\nIt’s not just talk, Good told The Daily Beast.",
    "When asked if he still wants to push through the bill now that Russia’s invaded Ukraine, the bill’s sponsor, Rep. Matt Rosendale (R-MT), declined to answer questions in person, insisting that his communications director would set up an interview.",
    "“It’s really important that lawmakers understand the gravity of the situation and not try to score cheap political points at a time when the global stability and security are so endangered,” said Bruen, now president of the Global Situation Room.",
    "While aid packages to Ukraine have taken months to roll out in the past, the Biden administration has worked to speed up the process so aid can be provided not in months, but in a matter of hours and days, according to a senior defense official.",
    "You may think conservatives would abandon their politically performative legislation after Russian President Vladimir Putin actually mounted his attack: His forces have been killing civilians and attacking Ukrainian cities for two weeks now.",
    "“There are very serious implications of what will happen if we delay or deny Ukraine some of these weapons systems and support, so we shouldn’t be conditioning the provision of those on partisan political issues,” Bruen said.",
    "The Freedom Caucus also made demands that border security provisions be included in the omnibus bill, and it seems that conservatives intend to vote against the spending measure if it doesn’t address the southern border.",
    "The arch-conservative group even sent a letter to House Minority Leader Kevin McCarthy (R-CA) and Senate Minority Leader Mitch McConnell (R-KY) on Tuesday requesting that the omnibus not include Ukrainian aid at all.",
    "He confirmed he thinks the Biden administration should handle the southern border first before Ukraine, and said the greatest responsibility of the federal government is the safety and security of the United States.",
    "Because the answer is, we should secure our border.”\nNorman said part of his resistance to providing assistance to Ukraine is because he thinks “it’s too late” to help Ukraine now that Russia has invaded.",
    "“In a more routine situation, you might have those processes play out over the course of, in fact, weeks or maybe even months,” a senior defense official told reporters on a call last week.",
    "Rep. Bob Good (R-VA), one of the original cosponsors of the bill, said he “absolutely” still wants to move the proposal forward, even though aid to Ukraine is needed now more than ever.",
    "But instead of arguing against the idea that you can’t compare the two issues, he indicated he thinks lawmakers must, and that they have to make a choice between the two.",
    "There is, of course, little traction for shutting down the government and leaving Ukraine in the lurch to show how tough conservatives are on the border.",
    "“Russia is the primary military threat to the homeland,” Gen. Glen VanHerck, the Commander of U.S. Northern Command, told lawmakers in testimony Tuesday.",
    "Another cosponsor of the bill, Rep. Ralph Norman (R-SC), expressed similar sentiments: He still wants aid to Ukraine conditioned on the southern border.",
    "And Rep. Paul Gosar (R-AZ), who also backed the bill, told The Daily Beast he still thinks southern border security should take precedence over Ukraine.",
    "“Russia has fielded a new family of advanced air-, sea-, and ground-based cruise missiles to threaten critical civilian and military infrastructure.”",
    "“I remain firmly convinced that our open southern border… is the greatest threat to our prosperity and security,” Gosar told The Daily Beast.",
    "The conservative group of lawmakers introduced legislation tying military assistance to Ukraine with the status of the U.S.-Mexican border.",
    "“We still should today declare we're going to secure our own border, not just saying it during [a] speech, but actually do it,” Good said.",
    "Instead, there’s bipartisan support for passing a massive government spending bill that includes almost $14 billion for Ukraine.",
    "Matt Gaetz (R-FL)—he refused to make eye contact with this reporter and ignored repeated questions.",
    "Lawmakers behind the bills aren’t exactly clear on the future of their proposals.",
    "“We have just accelerated our process” into “hours and days,” the official said.",
    "Just this Wednesday Russian forces bombed a Ukrainian maternity hospital.",
    "But in spite of the carnage, many of these Republicans are doubling down.",
    "When The Daily Beast approached another cosponsor of the legislation—Rep.",
    "His communications director did not return requests for comment.",
    "However, I support this,” Good told The Daily Beast this week.",
    "“It’s still relevant because of what's going on,” Norman said.",
    "His office also did not return multiple requests for comment.",
    "“The answer is, we should secure our border,” Good said.",
    "“Clearly they are different,” Good told The Daily Beast.",
    "But the House Freedom Caucus isn’t having it.",
    "But that’s far from the reality In Ukraine.",
    "“But it's also a false choice.",
    "“I do support aid for Ukraine."
  ]
}