{
  "id": 3078,
  "mediaId": 2643,
  "date": "2022-03-10",
  "headline": "Full List of 17 Lawmakers Who Voted Against Russian Oil Ban",
  "image": "",
  "link": "https://www.newsweek.com/full-list-17-lawmakers-who-voted-against-russian-oil-ban-ukraine-1686630",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darragh Roche",
  "authorUrl": "https://www.newsweek.com/authors/darragh-roche",
  "termIds": [
    2763,
    3213,
    4392,
    1163,
    4830,
    4977,
    5159,
    5287
  ],
  "sentences": [
    "The Republicans voting against the energy ban were Andy Biggs of Arizona, Dan Bishop of North Carolina, Lauren Boebert of Colorado, Madison Cawthorn of North Carolina, Scott DesJarlais of Tennessee, Matt Gaetz of Florida, Louie Gohmert of Texas, Paul Gosar of Arizona, Marjorie Taylor Greene of Georgia, Glenn Grothman of Wisconsin, Clay Higgins of Louisiana, Bill Posey of Florida, Chip Roy of Texas and Tom Tiffany of Wisconsin.",
    "\"President Biden's outrageously calloused original decision on his first day to make America and Europe dependent on Russia, Iran and Venezuela for oil while he chases a green new nightmare has made the world dangerous for democracy while funding those who will end our freedom,\" Gohmert said.",
    "Representative Massie also made reference to energy independence in explaining his opposition to the bill, tweeting that Biden's plan \"is to buy oil from dictators in other countries, and to use high gas prices to bludgeon American consumers into adopting a leftist energy agenda.\"",
    "In a statement issued to Newsweek on Thursday, Omar said \"putting the specifics into statute with no sunset and no conditions for lifting the ban creates a dangerous scenario, one in which we are taking today's policy question and making it tomorrow's political question.\"",
    "Representative Omar said she would vote against the bill in an interview on Tuesday, saying that lawmakers needed to \"think about what this means a year from now, what this means two years, three years from now.\"",
    "President Biden announced a ban on Russian oil on Tuesday; The U.S. and its allies have imposed other sanctions on Russia since the country began its invasion of neighboring Ukraine on February 24.",
    "The legislation is separate from the Biden administration's ban on Russian energy imports and Speaker of the House Nancy Pelosi decided to proceed with a vote on the bill despite Biden's action.",
    "The legislation was introduced in response to Russian forces' attack on Ukraine and would impose a ban on the import of oil, coal and natural gas from Russia, which is a major energy exporter.",
    "\"I think ultimately, this is not going to end well for the the actual people of Russia, and it's not going to end well for the people of Europe as well,\" Omar said.",
    "\"That means Russian oil will no longer be acceptable at U.S. ports and the American people will deal another powerful blow to Putin's war machine,\" Biden said.",
    "Two Democrats and 15 Republican members of the House voted against the Suspending Energy Imports from Russia Act, but the bill passed by 414 votes to 17.",
    "The U.S. is far less reliant on Russian oil than the European Union (EU), which announced a plan this week to become energy independent before 2030.",
    "Representative Gaetz wrote in an op-ed that he would vote against the bill because it would \"make Americans poorer and less safe.",
    "Seventeen members of the U.S. House of Representatives voted against a ban on energy imports from Russia on Wednesday night.",
    "Representative Biggs said he supported the ban, but wanted a guarantee that the U.S. would work toward energy independence.",
    "Senate Majority Leader Chuck Schumer (D-NY) has said he would need to consult with the Biden administration on the matter.",
    "Ukrainian President Volodymyr Zelensky has been calling on western countries to end their use of Russian energy imports.",
    "However, the bill may not be taken up by the Senate and Biden's ban on Russian energy imports is separate from it.",
    "Democratic Representatives Cori Bush of Missouri and Ilhan Omar of Minnesota voted against the bill on Wednesday.",
    "The vote followed President Joe Biden announcing a ban on imports of the country's oil on Tuesday.",
    "This is a democratic process where people weigh the equities, express their views.\"",
    "The president said the U.S. was \"targeting the main artery of Russia's economy.",
    "However, it is not clear if the Senate will now take up the legislation.",
    "My compassion for Ukrainians won't force my hand to hurt my own people.\"",
    "She also said U.S. dependence on oil \"means a dependence on tyrants.\"",
    "Follow Newsweek's live blog for the latest on the Russia-Ukraine war.",
    "And we're so pleased that the president has done that,\" Pelosi said.",
    "Representative Cawthorn called the legislation \"virtue signaling.\"",
    "We're banning all imports of Russian oil and gas and energy.\"",
    "\"We've been talking about doing the Russian ban for a while.",
    ": This article was updated with additional information.",
    "They were joined by 15 of their Republican colleagues.",
    "Representative Gohmert expressed a similar concern.",
    "\"But you're here in a legislature.",
    "Update 03/10/22 09.45a.m.",
    "E.T."
  ]
}