{
  "id": 3100,
  "mediaId": 2564,
  "date": "2022-03-13",
  "headline": "American governor hopeful Kari Lake labels 60 Minutes journalist Liam Bartlett a JOKE",
  "image": "https://i.dailymail.co.uk/1s/2022/03/13/14/55297139-0-image-a-4_1647180099085.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10607815/American-governor-hopeful-Kari-Lake-labels-60-Minutes-journalist-Liam-Bartlett-JOKE.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Drudge Report",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2153,
    2201,
    3709,
    878,
    4843,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "+6\nView gallery\nTrump supporters meet police as they try to break through a police barrier (pictured) in front of the Capitol building, a symbol of U.S. democracy, on January 6 in Washington\n+6\nView gallery\nMore than 700 people have been charged over the Capitol Riots and most have been released\n'Maybe they get away with that in Australia because you've given your rights away.",
    "+6\nView gallery\nRepublican candidate for Arizona Governor Kari Lake (pictured) stormed out of an interview after taking an immediate dislike to an Australian reporter\n+6\nView gallery\nLiam Bartlett from 60 Minutes was called a 'nut' by Ms Lake at the end of the interview\n'Why did you say that, sir?'",
    "She also referenced Australia's hotel quaratine which was a system in place throughout 2020 and 2021 in which unused luxury city hotels were used to house travellers flying into the country for two weeks of quarantine due to the Covid pandemic.",
    "Infighting over Putin and Ukraine has exacerbated existing divisions within the party formed over Trump's false claims of widespread election fraud in 2020, and a House investigation into Capitol Riots by the former president's supporters.",
    "+6\nView gallery\nMs Lake (pictured) said Australians had 'no freedoms' and that hotel quarantine was 'one of the most horrifying things a government could do'\n'I think he's [Trump] is one of the best and I think he will be back.",
    "Even after the invasion, two Trump allies in the House - Marjorie Taylor Greene and Paul Gosar - participated in a white nationalist conference at which participants applauded Russia's move on Ukraine and chanted Putin's name.",
    "Since the riots 786 people have been arrested and charged with crimes, with analysis from The Guardian showing 70 per cent were released on bail, substantially more than the typical rate of 25 per cent of federal defendants.",
    "Before Russian forces attacked on Ukraine on February 24, some Republicans felt comfortable echoing former President Trump's praise for the Russian autocrat as a strong leader, while denouncing U.S. policy toward Moscow.",
    "Mr Bartlett said that her being a Republican candidate made it very relevant and pointed out 'your man Donald' had called the American election result a lie despite not being able to produce a single shred of evidence.",
    "Mr Bartlett asked Ms Lake her opinion on the January 6, 2021 Capital Building riots, called an insurrection by some, in which hoards of Trump supporters stormed the Washington DC landmark after he lost the election.",
    "'I feel sorry for the people of Australia right now, what we saw happening where you have internment camps for people with Covid... these quarantine camp are the most horrifying thing a government can do.'",
    "Ms Bartlett was referencing the tightening of Australia's gun, which were introduced in 1996 Australia after the Port Arthur massacre, where 35 people were killed and 23 others injured.",
    "The storming of the Capitol left at least five people dead and 140 police officers injured and followed a fiery speech by Trump to thousands of his supporters near the White House.",
    "Kari Lake, the Republican candidate for Governor of Arizona, agreed to sit down with 60 Minutes reporter Liam Bartlett but the conversation almost immediately went off the rails.",
    "But Russia's unprovoked invasion of Ukraine has brought new tensions into the Republican party and raised questions about Trump's seemingly favourable attitude towards Putin.",
    "There was also Howard Springs in the Northern Territory and similar facilities in use in which those in quarantine got their own cabin and were not confined indoors.",
    "Trump was impeached for a historic second time by the House after the Capitol riot and was charged with inciting an insurrection but was acquitted by the Senate.",
    "A Donald Trump endorsed American political candidate stormed out of an fiery interview with an Australian reporter, claiming Australia has 'no freedoms'.",
    "she challenged Mr Bartlett, who fired back saying she had been personally endorsed by him and he is still considered by some the leader of Republicans.",
    "Trump himself has been widely criticized for describing Putin's actions toward Ukraine as 'genius' and 'pretty savvy' in a February 22 interview.",
    "Ms Bartlett attempted to explain some of this but Ms Lake was having non of it and stormed out of the interview.",
    "'We do things differently here in America, we have something called The Constitution and and we have rights.'",
    "'You actually make some of the crazy reporters and people at CNN look almost respectable so thank you sir.'",
    "+6\nView gallery\nSome Republicans want to see Trump (pictured) take another run for the Presidency in 2024",
    "She then continued her spray at a colleague in the room with her as the video interview was terminated.",
    "I think he will win in 2024, with a vengeance,' she previously told an Arizona rally.",
    "'People are being held in prison without charge, that's un-American,' Ms Lake said.",
    "That's the craziest thing I've ever experienced,' she told one of her colleagues.",
    "'Donald Trump has said those charged [over the Capitol Riots] should be pardoned.",
    "Ms Lake is among the most vocal Trump supporters of new Republican candidates.",
    "'Well, that really doesn't have anything to do with being Governor of Arizona.",
    "It's just, it's obvious you're trying to twist this to make me look bad.'",
    "A person must have a firearm licence to possess or use a firearm.",
    "That guy's a complete nut, Seriously, a complete insane person.",
    "You guys have no freedom, you melted down all of your guns.'",
    "The phrasing seemed to infuriate the former Fox News host.",
    "'Liam, it was a pleasure I'm leaving.",
    "Do people in Australia listen to him?",
    "'I'm still amazed that you say that.",
    "It's just the flippant attitude.",
    "That's just so disrespectful...",
    "This has just become comical.'",
    "I wasn't there,' she replied.",
    "Do you agree with that?'",
    "Mr Bartlett asked.",
    "'We're done."
  ]
}