{
  "id": 3191,
  "mediaId": 2664,
  "date": "2022-03-09",
  "headline": "Hate group membership continues dropping as right-wing extremism goes mainstream",
  "image": "https://www.rawstory.com/media-library/rep-matt-gaetz.jpg?id=26576369&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/southern-poverty-law-center-annual-report/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    0
  ],
  "sentences": [
    "The antidemocratic right rejects equality and pluralism in favor of a hierarchical society where certain groups hold more power, and Fox News broadcaster Tucker Carlson and Republican lawmakers such as Reps. Matt Gaetz (R-FL) and Paul Gosar (R-AZ) openly promote the white nationalist \"great replacement\" myth to stoke violent anger against racial, religious and sexual minorities.",
    "The Southern Poverty Law Center documented 1,221 hate and anti-government extremist groups active last year in the U.S., but the civil rights organization's annual report found that decline demonstrates how the reactionary right has gained influence over the Republican Party since the election of Donald Trump.",
    "NOW WATCH: Pulitzer Prize-winning historian explains Putin's miscalculation of NATO: 'He was listening to Trump'\nPulitzer Prize-winning historian explains Putin's miscalculation NATO: 'He was listening to Trump'\nStories Chosen For You",
    "Throughout 2021, the hard right hit the streets across the U.S., blocked important policy, attacked democratic institutions, engaged in violence and energized their base of supporters.",
    "\"Hard-right organizations disrupted school board and city council meetings around the country and, in the process, created space for more extreme and bigoted voices.",
    "\"In the aftermath of Jan. 6, they shifted their efforts to local politics, focusing especially on COVID safety protocols and school curricula,\" the report states.",
    "\"Jan. 6 should be recognized for what it was: a full-on violent assault on democracy that showcased the strength of the hard right,\" the report states.",
    "As a result, public servants have experienced a wave of threats that will likely continue as the country heads toward the 2022 midterms.\"",
    "Hate group membership has dropped for the third year in a row, but that doesn't mean that right-wing extremism is losing influence.",
    "\"In the wake of that day, the hard right is reorganizing, re-strategizing and planning to emerge stronger.",
    "The 12 months that followed Jan. 6 showed beyond a doubt that they will not go quietly.\""
  ]
}