{
  "id": 3252,
  "mediaId": 5308,
  "date": "2022-03-10",
  "headline": "GOP Rep. Madison Cawthorn Called President Zelenskyy a ‘Thug’",
  "image": "https://video-images.vice.com/articles/622a31451b4fc1009bebf246/lede/1646932817162-madisoncawthornzelenskyythug.png?image-resize-opts=Y3JvcD0xeHc6MC44NDY0eGg7MHh3LDB4aCZyZXNpemU9MTIwMDoqJnJlc2l6ZT0xMjAwOio",
  "link": "https://www.vice.com/en/article/93b848/madison-cawthorn-zelenskyy-thug",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Blest",
  "authorUrl": "https://www.vice.com/en/contributor/paul-blest",
  "termIds": [
    1768,
    2201,
    2976,
    3709,
    4384,
    305,
    878,
    5287,
    5366
  ],
  "sentences": [
    "“Remember that the Ukrainian government is incredibly corrupt and it is incredibly evil and it has been pushing woke ideologies.”\nIt’s unclear where the video was taken—WRAL noted that Cawthorn held events in North Carolina last weekend—or when it was taken, though Cawthorn mentions that the U.S. should “send Stinger missiles over to [Ukraine] so they can defend themselves better.” (Two officials with the State Department and Pentagon said last week that the U.S. had sent Stinger surface-to-air missiles to Ukraine.)",
    "(Trump later called Zelenskyy a “brave man.”)\nAsked for comment, Cawthorn’s congressional office pointed to a Twitter thread where Cawthorn didn’t directly address the video but said that “propaganda is being used to entice America into another war.”\n“The actions of Putin and Russia are disgusting.",
    "Pray also we are not drawn into conflict based on foreign leaders pushing misinformation.”\nBy signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "While Republican congressional leaders condemned the invasion, Reps. Paul Gosar and Marjorie Taylor Greene both spoke at a white nationalist conference last month whose organizer favorably compared Russian President Vladimir Putin to Adolf Hitler.",
    "Former President Donald Trump—whose term in office was dominated by investigations into his campaign’s ties to Russia and an impeachment related to Ukraine—called Putin a “genius” after he invaded Ukraine two weeks ago.",
    "Though polls have shown that Republican voters view Zelenskyy favorably, like Democrats do, the reaction of GOP elected officials to Russia’s invasion of Ukraine has been split.",
    "A leaked video shows GOP Rep. Madison Cawthorn calling Ukrainian President Volodymyr Zelenskyy a “thug” while speaking to supporters about Russia’s invasion of Ukraine.",
    "“Remember that Zelenskyy is a thug,” the North Carolina congressman said in a 13-second clip published by Raleigh TV station WRAL.",
    "But leaders, including Zelenskyy, should NOT push misinformation on America,” Cawthorn said.",
    "“I am praying for Ukraine and the Ukrainian people."
  ]
}