{
  "id": 3288,
  "mediaId": 2911,
  "date": "2022-03-15",
  "headline": "How Republicans Are Thinking About Trumpism Without Trump",
  "image": "https://fivethirtyeight.com/wp-content/uploads/2022/03/GettyImages-1238075202-16x9-1.jpg?w=712",
  "link": "https://fivethirtyeight.com/features/how-republicans-are-thinking-about-trumpism-without-trump/",
  "mediaOutlet": "FiveThirtyEight",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Azari",
  "authorUrl": "https://fivethirtyeight.com/contributors/julia-azari/",
  "termIds": [
    0
  ],
  "sentences": [
    "This group includes governors like Ron DeSantis of Florida and Glenn Youngkin of Virginia; senators like Ted Cruz of Texas and Josh Hawley of Missouri; and even erstwhile members of the Trump administration like former Vice President Mike Pence and former U.S. ambassador to the United Nations Nikki Haley.",
    "Members of this group vary in their relationship to Trump’s legislative agenda — some actually backed core components of his policy goals — but they’re nonetheless distinct from others in the party in that they’re not trying to reinterpret Trumpism; rather, they’re aiming to distance themselves from it.",
    "In 2021, political scientist Hans Noel wrote that Republicans could “agree to disagree about democracy,” citing the need for parties to form broad coalitions in the U.S. political system and the many historical examples of such coalitions exiting despite deep differences within them.",
    "The fact, too, that it is so hard to imagine a post-Trump Republican Party speaks to just how successful Trump has been in seizing control of the party, whether it’s from election officials at the state and local level or from the RNC.",
    "To be sure, that doesn’t mean we should expect Republicans to break from Trump en masse, but nevertheless, there are signs that both Trump’s style and ideas are evolving as other politicians take them up and inevitably change them.",
    "and Trump transition leader Chris Christie, who has also criticized Trump’s general approach to politics, has said, for instance, that the Republican Party needs to move on from false beliefs about the last presidential election.",
    "The most prominent example of a GOP politician in this group is probably Youngkin, whose November 2021 victory in the Virginia gubernatorial race could serve as a model for Trump-style candidates running in purple states.",
    "Some Republicans have gone further than Youngkin, though, explicitly trying to separate loyalty to Trump and his policy positions from believing in the Big Lie, the false claim that the 2020 election was stolen from him.",
    "And it still remains to be seen whether Trumpism is open to reinterpretation by others, or whether, as is often the case in highly personal political movements, the ideology proves impossible to separate from the leader.",
    "In the last few years, a number of ambitious politicians have established a national name for themselves by claiming the Trumpist mantle — all while offering voters their own interpretations of Trump-style conservatism.",
    "Cheney also lost her leadership position for her comments about the 2020 election and support for Trump’s second impeachment, and Kinzinger, who also supported Trump’s second impeachment, isn’t seeking reelection.",
    "Though a few of these figures, like Cruz and Haley, had national ambitions prior to the Trump era, many became national figures starting in 2016 and thus created political profiles inextricably linked to Trump.",
    "A key distinction, though, between these figures and Republicans like Christie, Pence or Haley is that it’s even harder to imagine any of the former entering or gaining traction in a GOP presidential primary.",
    "Trying to out-Trump Trump has a lot of different expressions, but among this group of Republicans, it broadly refers to their attitudes toward COVID-19, the 2020 election and electoral democracy in general.",
    "It’s possible that the GOP is now completely dominated by one individual, as evidenced by the purge of those who pushed back on the 45th president’s fraudulent claims that the election was stolen from him.",
    "Youngkin’s administration so far has veered to the right and relied heavily on culture war tactics like going after critical race theory in schools, which hasn’t proved popular among voters in the state.",
    "The key question here is whether these Republicans can carve out their own political identities while still drawing on the past president, as Trump and Trumpism now define the the party’s factions.",
    "Pence has also publicly contradicted Trump, suggesting that Trump was wrong to claim that the vice president could “overturn” the results when Congress met to count the Electoral College votes.",
    "Finally, the polar opposite of the firmly anti-Trump group are those in the party who seem to be trying to out-Trump Trump, or leaning into the most bombastic reimagining of Trumpism possible.",
    "His endorsements have gotten bolder and more aggressive down ballot, and he’s often used them to root out those who oppose him or his false claims about the 2020 election results.",
    "In fact, if the largest group of Republicans prove to be that which seeks to reinterpret Trumpism in some way, it’s possible it’ll end up wielding a lot of influence in the party.",
    "And it’s perhaps the biggest reason why in 2024, as was the case in 2016, a well-known but divisive figure — including Trump himself — might once again step in and fill the void.",
    "Meanwhile, Haley has tried to strike more of a middle-of-the-road approach, criticizing Pence’s rebuke of Trump while maintaining publicly that Biden won the 2020 election.",
    "Let’s take a look, then, at how these aspiring GOP leaders are reinventing — or resisting — Trumpism and what this might mean for the future of the Republican Party.",
    "But as I’ve written before, there is evidence that the alliance between Republicans and Trump is uneasy, and it could test how much clout he carries in the party.",
    "That said, it’s not clear how broad the appeal is — Greene faces several primary challengers (though she is likely to keep her seat) and is unpopular nationally.",
    "The presence of a more outwardly anti-Trump faction is still significant, though, as it raises questions about the viability of the larger party coalition.",
    "The first category of note is politicians who have tried to distance themselves from Trump’s political style without really rejecting any of his views.",
    "In Congress, this group includes legislators like Sen. Ron Johnson and Reps. Marjorie Taylor Greene, Lauren Boebert, Madison Cawthorn and Paul Gosar.",
    "He has even criticized Trump from his right, saying in January that he regretted not speaking out in 2020 against Trump’s COVID-19 recommendations.",
    "But disagreeing over the basic tenets of democracy might prove too much of an intra-party fissure for Republicans to overcome to form a coalition.",
    "Instead, he has continued to try and be the party’s kingmaker, playing a far more active role in the 2022 primaries than he did in 2018 and 2020.",
    "As such, he has positioned himself as a leading figure in the GOP’s fight to curtail abortion rights and LGBTQ rights and voting rights.",
    "This group most prominently includes DeSantis, who has tried to establish himself as the 2024 front-runner of this wing of the party.",
    "Meanwhile, Johnson’s popularity in his home state of Wisconsin has declined since 2020, and he is up for reelection in November.",
    "Some prominent Republicans who fall into this group include Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois and Sens.",
    "In other words, there’s a not-so-insubstantial faction of Republicans trying to split the difference when it comes to Trumpism.",
    "They derive some of their national stature from their affiliation with Trump but disavow some of his more extreme positions.",
    "What remains to be seen is whether this type of Trumpian politician will be any more successful at governing than Trump was.",
    "That was apparent while Trump was president, but in many ways that’s even easier to understand now that he is out of office.",
    "It’s possible that this approach isn’t a political winner in a purple state, even when the Democratic brand is struggling.",
    "At this point, there is a lot of uncertainty about what the post-Trump Republican coalition will look like moving forward.",
    "This group’s rise to prominence illustrates the appeal of a constituency for an even more extreme version of Trumpism.",
    "But there are still other voices in the party, including some that have pushed back on some aspects of Trumpism.",
    "He also recently told conservative talk show host Hugh Hewitt that Trump incited the Jan. 6 riot.",
    "For instance, Cheney and Kinzinger have been censured by the Republican National Committee.",
    "Unlike previous presidents, Trump has refused to take a step back from the limelight.",
    "He also still commands considerable personal loyalty among voters within the party.",
    "This is a common dilemma for politicians after an influential presidency.",
    "He’s also repudiated Trump’s embrace of Russian President Vladimir Putin.",
    "Mitt Romney of Utah, Ben Sasse of Nebraska and Lisa Murkowski of Alaska.",
    "Some Republicans, though, have broken even more decisively with Trump.",
    "Like most presidents, Donald Trump changed the political party he led.",
    "Currently, it appears that members of this group will be ostracized.",
    "But Trump was hardly a normal president.",
    "Former New Jersey Gov."
  ]
}