{
  "id": 3342,
  "mediaId": 2666,
  "date": "2022-03-16",
  "headline": "Biden's Plans To Fix the Pay Gap Won't Actually Help Women",
  "image": "https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2022/03/covphotos214531-scaled.jpg",
  "link": "https://reason.com/2022/03/16/bidens-plans-to-fix-the-pay-gap-wont-actually-help-women/",
  "mediaOutlet": "Reason",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Boehm",
  "authorUrl": "https://reason.com/people/eric-boehm/",
  "termIds": [
    0
  ],
  "sentences": [
    "President Joe Biden released an executive order instructing the Federal Acquisition Regulatory Council to \"consider\" implementing rules that \"limit or prohibit Federal contractors and subcontractors from seeking and considering information about job applicants' and employees' existing or past compensation when making employment decisions.\"",
    "Today's rhetoric about wider disparities in male and female incomes tends to 1) rely on research looking at incomes across professions and positions and 2) ignore explanations other than discrimination that might explain pay disparities—things like gender differences in types of work, work schedules, and years in the workforce.",
    "The idea that salary history disclosures harm women has become commonplace—the thinking being that if women are financially disadvantaged at their first jobs then their salary history will suggest they can be paid lower wages at their next job and so on, creating a vicious cycle of lower pay from which women can never emerge.",
    "\"Simply because speech is unprotected does not grant a free license for the government to regulate that speech based on viewpoint,\" she wrote, finding that \"the law seeks to single out specific individuals for punishment based on their viewpoint regarding such facilities.\"",
    "By criminalizing deception to gain access to an agricultural facility \"with the intent to cause physical or economic harm,\" it impermissibly distinguishes between animal rights activists and others who might lie to gain access to facilities for other reasons, Rose ruled.",
    "Massie is joined in the lawsuit—filed in the U.S. District Court for the District of Kentucky—by 16 other GOP members of Congress, including Sen. Rand Paul (Ky.) and Reps. Marjorie Taylor Greene (Ga.), Lauren Boebert (Colo.), Paul Gosar (Ariz.), and Andy Biggs (Ariz.).",
    "Circuit Court of Appeals considered a challenge to an earlier version of the law,\" notes the Des Moines Register:\nIn partially upholding the first law, the 8th Circuit found that false speech is not protected by the First Amendment if it enables a trespass.",
    "But the issue is nowhere near the simplistic narrative that many modern progressives often make it out to be, in which sexist bosses and companies simply choose to pay women less than men for the same work and everything can be fixed with federal mandates.",
    "\"For example, employers who can't ask about prior salary might assume that a female candidate would accept less money than a man, because women make less on average,\" as The New York Times has previously noted.",
    "• Maryland moves to end college degree requirements for many state jobs:\nToday, the governor is announcing Maryland's plan to formally eliminate the four-year degree requirement for thousands of state jobs.",
    "But the amusingly toothless nature of these announcements is actually a good thing, since an actual ban on salary history disclosure (even just among federal workers and contractors) would be pretty silly.",
    "Politicians and media then use this distorted picture to spawn outrage and get kudos for addressing the issue, even if nothing they're doing can actually \"fix\" the complicated causes behind disparities.",
    "Vice President Kamala Harris announced that the Office of Personnel Management (OPM) would \"begin work to address the use of salary history in the hiring and pay-setting process for federal employees.\"",
    "Yesterday was \"Equal Pay Day,\" so named to mark the point in the year that a U.S. woman allegedly must work to make the same amount of money as her male counterparts made in the preceding single year.",
    "The Biden administration's enthusiasm for limiting prior salary disclosure jives with the general cluelessness (or deliberate misrepresentation) by politicians and activists on the issue of equal pay.",
    "• The Human Rights Defense Center is suing over the Nebraska Department of Correctional Services' policy of forbidding books to be mailed to inmates unless they come from one specific book wholesaler.",
    "In other cases, where an employer has a strong preference for a particular candidate, the company may be prepared to offer a higher salary than the baseline in order to recruit them.",
    "There may be a broader discussion to have about whether female-heavy industries are undervalued or how choosing to have children may harm women's salary prospects more than men's.",
    "\"The Centers for Disease Control and Prevention does not have the legal authority to force people traveling on commercial airlines to wear masks,\" said Massie in a statement.",
    "It's not hard to imagine an employer choosing to hire someone whose salary requirements seem slightly lower than an equally qualified candidate with higher requirements.",
    "Which is all to say that surely some women may actually benefit from past salary disclosure—especially now that young women are out-earning their male counterparts.",
    "This lawsuit targets the faceless bureaucrats who are behind the CDC's unscientific regulation so that this illegal mask mandate can be brought to a permanent end.\"",
    "In general, letting employers and prospective employees exchange more information, not less, seems likely to lead to the best matches and the most satisfaction.",
    "Careful observers may notice that nothing concrete is actually being done; the big announcements amounted to plans to \"consider\" or \"begin work to address.\"",
    "Congressional Republicans led by Kentucky Rep. Thomas Massie are suing the Centers for Disease Control and Prevention to end mask requirements on airplanes.",
    "• Idaho's bill banning abortion around six weeks and allowing family members of pregnant women who get abortions to sue is headed to the state's governor.",
    "The feminist campaign for \"equal pay for equal work\" was once quite justified; women frequently faced lower pay than men for performing the same jobs.",
    "But outright pay differentials based on sex have long been illegal, and the pay gap between women and men in the same positions is now quite small.",
    "A federal court has ruled against an Iowa law that makes it a crime to obtain \"access to an agricultural production facility by false pretenses.\"",
    "QUICK HITS\n• President Joe Biden has signed a massive $1.5 trillion government funding bill that includes $13.6 billion in assistance to Ukraine.",
    "They might offer lower than the candidate currently makes, leading the candidate to reject the job that could have otherwise been a good fit.",
    "A 2016 study of wage data in 33 countries including the U.S. found that men made 1.6 percent more on average than women doing the same work.",
    "• Pfizer is asking the U.S. Food and Drug Administration to approve a second COVID-19 vaccine booster for people ages 65 and up.",
    "• Russia's invasion of Ukraine complicates the democracies versus autocracies narrative, writes Daniel R. DePetris at Newsweek.",
    "• Former Los Angeles police officer Cheryl Dorsey on why the state should repeal its loitering for prostitution purposes law.",
    "The decision by U.S. District Judge Stephanie Rose blocks enforcement of the law on First Amendment grounds.",
    "In this scenario, a ban on salary history discussions could lead to women getting lowballed in job offers.",
    "Without knowing the candidate's salary history, however, the employer may be lost as to what to offer.",
    "Several states have already passed laws to ban salary history discussions during the hiring process.",
    "As has become tradition, Democratic leaders marked the occasion with big talk and little substance.",
    "Salary history bans could also cost people—particularly women and younger workers—some job offers.",
    "Under that standard, Rose ruled Monday, the second law still doesn't pass constitutional muster.",
    "In this case, prior salary disclosure could mean the difference between getting a job or not.",
    "• An interesting mice study looks at the effect of body temperature on longevity.",
    "• The U.S. Senate unanimously voted to make Daylight Savings Time permanent.",
    "• Idaho hair braiders are suing over occupational licensing requirements.",
    "• Ignoring the EARN IT's Fourth Amendment problem won't make it go away.",
    "https://t.co/VHFadj1Zoc\n— Kata Hall Burke (@katadhall) March 15, 2022",
    "\"Congress never passed a law requiring masks on commercial flights.",
    "Their big idea was restricting the use of salary history in hiring.",
    "Meanwhile, such restrictions would have unintended consequences.",
    "• New York may not make to-go cocktails permanent after all.",
    "But evidence that this actually helps women is mixed.",
    "• How an academic grudge turned into a #MeToo panic.",
    "\"The case had been on hold while the 8th U.S.",
    "FREE MINDS\n\"Ag gag\" law unconstitutional.",
    "You can find their full complaint here.",
    "FREE MARKETS\nMassie sues the CDC."
  ]
}