{
  "id": 3476,
  "mediaId": 2627,
  "date": "2022-03-07",
  "headline": "Greene, Gosar go unpunished after appearance at radical event",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220307-MB-Marjorie-Taylor-Greene-jg-703148.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/greene-gosar-go-unpunished-appearance-radical-event-rcna18991",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    0
  ],
  "sentences": [
    "The minority leader, who vowed in November to reward Greene and Gosar with new committee assignments in the next Congress, could even announce that he’s changed his mind about what he said four months ago, and he will no longer support giving Greene and Gosar committee assignments in the next Congress.",
    "The party could also announce that it will not support the members’ re-election campaigns — akin to what the party has already done to Reps. Liz Cheney and Adam Kinzinger, because of their efforts to help lead the investigation into the Jan. 6 attack.",
    "The pair were already recognized as two of Congress’ most radical members, but when they appeared at a white nationalist event nine days ago, it created a challenge for GOP leaders: Was the party prepared to do something?",
    "House Minority Leader Kevin McCarthy told CNN and Punchbowl News that it was “appalling and wrong” for Gosar and Greene to attend the America First Political Action Conference (AFPAC).",
    "In this Congress, after two sitting GOP members attended a white nationalist event, McCarthy described their actions as “unacceptable,” and then proceeded to do nothing.",
    "In the two years that followed, King could vote on bills once they reached the House floor, but his presence on Capitol Hill was otherwise rendered meaningless.",
    "Two years ago, following a lengthy list of racist incidents, House Republican leaders agreed to strip then-Rep. Steve King of his committee assignments.",
    "It remains a possibility that the would-be Speaker is simply taking his time, and he’ll eventually impose meaningful punishments on Gosar and Greene.",
    "But a week later, McCarthy and his party seem far more invested in the hopes that everyone will move on and simply forget what happened.",
    "A year and a half later, his constituents brought King’s toxic career to an end with a defeat in a Republican primary.",
    "A week later, there’s reason to believe Republican leaders are prepared to accept that which they saw as unacceptable.",
    "This is unacceptable.” McCarthy added that he planned to discuss the “appalling“ matter with the right-wing duo.",
    "None of this has happened, and by all appearances, it seems unlikely that GOP leaders will do much of anything.",
    "For a brief moment, it appeared Republican Reps. Marjorie Taylor Greene and Paul Gosar had pushed their luck.",
    "McCarthy said at the time that his conference simply could not “tolerate” the Iowan’s racism any longer.",
    "“The party should not be associated any time, any place with somebody who is anti-Semitic....",
    "Politico reported this morning:\nAs we discussed last week, the party has some options.",
    "McCarthy & Co. could, for example, kick Gosar and Greene out of the GOP conference.",
    "“There’s no place in our party for any of this,” the House GOP leader said.",
    "A week ago this morning, the possibility of action seemed almost plausible.",
    "Republicans could also agree to censure the duo.",
    "That was in the last Congress."
  ]
}