{
  "id": 3552,
  "mediaId": 2688,
  "date": "2022-03-09",
  "headline": "Reps’ Punishment For Addressing A White Nationalist Conference? Talking To Kevin McCarthy",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/03/GettyImages-1383525366-scaled.jpg",
  "link": "https://talkingpointsmemo.com/news/marjorie-taylor-green-paul-gosar-punishment-for-attending-a-white-nationalist-conference-talking-to-kevin-mccarthy?utm_source=rss&utm_medium=rss&utm_campaign=marjorie-taylor-green-paul-gosar-punishment-for-attending-a-white-nationalist-conference-talking-to-kevin-mccarthy",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Shuham",
  "authorUrl": "",
  "termIds": [
    1726,
    1926,
    3242,
    3267
  ],
  "sentences": [
    "The minority leader did say that Greene would not be attending the conference again — though one wonders how serious he is about enforcing that commitment, given that this was Rep. Paul Gosar’s (R-AZ) second year addressing the gathering.",
    "She then referred to AFPAC attendees — a group consisting of open racists and extremists — as “1,200 young conservatives who feel cast aside and marginalized by society” and “1,200 people gathered to declare that Christ is King.”",
    "In a press conference, McCarthy said he’d talked to Rep. Marjorie Taylor Greene (R), who last month attended the America First Political Action Conference, which is run by Nick Fuentes, a white nationalist.",
    "House Minority Leader Kevin McCarthy (R-CA) confirmed Wednesday that there would be no consequences for two sitting Republicans in the House who recently addressed a white nationalist conference.",
    "Greene — who unlike Gosar attended the event in person this year — has been essentially unapologetic about her appearance, saying at first that she didn’t know about Fuentes’ views.",
    "McCarthy also said he wouldn’t prevent either member from joining potentially powerful congressional committees if Republicans win the House majority in November.",
    "Fuentes has said of segregation, “It was better for them, it’s better for us, it’s better in general,” among other, similar comments.",
    "McCarthy said he hadn’t spoken yet to the other member of his conference who addressed the event, Rep. Paul Gosar (R-AZ).",
    "“They have the ability to be able to get committees, based upon that time when it comes,” McCarthy said.",
    "The only punishment for the two representatives, apparently, was a conversation with Kevin McCarthy.",
    "“My conversations with my members are exactly that,” McCarthy said.",
    "So, no repercussions for addressing white nationalist conference?",
    "“I’ve talked to her!” McCarthy told an inquiring reporter.",
    "And… that’s it."
  ]
}