{
  "id": 3554,
  "mediaId": 2688,
  "date": "2022-03-18",
  "headline": "Idaho Lt. Guv: Actually Yes, I Did Know I Was Speaking To White Nationalists. What About It?",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2021/10/GettyImages-1231559080-scaled.jpg",
  "link": "https://talkingpointsmemo.com/news/idaho-lt-guv-mcgeachin-white-nationalists-america-first-political-action-nick-fuentes?utm_source=rss&utm_medium=rss&utm_campaign=idaho-lt-guv-mcgeachin-white-nationalists-america-first-political-action-nick-fuentes",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Shuham",
  "authorUrl": "https://talkingpointsmemo.com/profile/matt-shuham",
  "termIds": [
    2386,
    2886,
    3242,
    3645,
    5034,
    5244,
    5371
  ],
  "sentences": [
    "“I don’t know, you know, what is everything that he says or doesn’t say, is not, does not reflect on who I am or who the thousands of others that are participating in this movement.”\nMcGeachin also claimed she didn’t know about Holocaust denier Vincent James Foxx’s beliefs when she took a picture with him at an event in February, only that she’d “heard of him.”\nYet Foxx not only gave McGeachin a full-throated endorsement of her gubernatorial bid during one of his livestreams last month, he also bragged that he and other white nationalists like him had “connections” to the lieutenant governor.",
    "“I was invited to present a video of my commitment to Idaho First policies and my vision for the state of Idaho and for America to these thousands of young conservatives,” McGeachin told the interviewer, adding that she had been invited by Michelle Malkin, a conservative commentator who has well-established ties to white nationalists.",
    "McGeachin’s frank admission came less than three weeks after her stunning interview with local KTVB reporter Brian Holmes, during which she tried to distance herself from Fuentes and other white nationalists as Holmes pressed her on her attendance at AFPAC.",
    "Governor Janice McGeachin (R), who spoke at the recent America First Political Action Conference (AFPAC), insisted several days after the conference that she didn’t know anything about Nick Fuentes, the prominent white nationalist who organized the event.",
    "McGeachin accused Holmes of painting her as someone “guilty by association.”\nThe Idaho lieutenant governor wasn’t the only elected Republican who appeared at this year’s AFPAC; others included Reps. Marjorie Taylor Greene (R-GA) and Paul Gosar (R-GA).",
    "The lieutenant governor went on to defend Malkin against critics of her well-established ties to white nationalists, arguing that the commentator is of Filipina descent and has a Jewish husband.",
    "McGeachin, who’s running for Idaho governor, described in an interview with Valiant News, a far-right media outlet, how she got involved in AFPAC.",
    "“I’m not going to back off from the opportunity to talk to other conservatives across the country about America First policies,” she said.",
    "McGeachin also made it clear that she didn’t have any regrets about speaking to the white nationalists, and would do so again if asked.",
    "“And so yes, I did know who I was talking to, who had invited me to speak at that conference,” McGeachin said.",
    "On Thursday, the GOP lieutenant governor threw that denial right out the window.",
    "I – he’s never – I’ve never met him,” McGeachin stuttered.",
    "“As I said, I don’t know him.",
    "Idaho Lt."
  ]
}