{
  "id": 3556,
  "mediaId": 2594,
  "date": "2022-03-08",
  "headline": "Trump attacks Biden with Ukraine abuse, claims Europe is using him",
  "image": "https://static.independent.co.uk/2022/03/08/06/GettyImages-1373041204.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/trump-biden-ukraine-russia-crisis-b2031334.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Bowden",
  "authorUrl": "https://www.independent.co.uk/author/john-bowden",
  "termIds": [
    0
  ],
  "sentences": [
    "While some members of the Republican Party like Sen Ted Cruz have claimed that “[t]he reason that Russia is invading Ukraine is because of enormous mistakes that the Biden administration has made”, other members like Rep Marjorie Taylor Greene and Rep Paul Gosar attended a conference billed as a far-right alternative to the Conservative Political Action Conference (CPAC) last month where the event’s host quipped that comparisons of Vladimir Putin to Adolf Hitler could be complimentary, and members of the crowd chanted Mr Putin’s name.",
    "Those remarks and others from far-right figures in the GOP and in the greater US conservative political sphere showering outright praise on Mr Putin and calling for the US to allow Russia’s invasion to occur unchallenged have been the target of scathing pushback from Democrats while simultaneously undermining the arguments from more centrist members of the party in Congress who have claimed that Mr Biden is not showing adequate strength on the world stage and bears some responsibility for renewed Russian aggression.",
    "The former president’s anger comes amid blistering news coverage and criticism from both Democrats and anti-Trump Republicans of his most recent statements about Vladimir Putin; in an interview that aired just before the invasion of Ukraine began, Mr Trump appeared to praise Mr Putin effusively and referred to the deployment of what the Russians were then claiming were “peacekeeping” troops to the separatist Donbas region of Ukraine.",
    "Altogether, the former president could hardly be said to have had a positive relationship with Mr Zelensky, whose predecessor was also falsely accused by the US president of interfering in the 2016 election as part of his long-running public rejection of the US intelligence community’s assessment of Russian interference in his race against Hillary Clinton.",
    "Mr Trump wrote on Tuesday that Mr Biden “was giving blankets, to great and open complaints” from Ukraine when he took office as opposed to direct military aid shipments, adding that the president “canceled the remaining military equipment that was packed, loaded, and ready to be shipped”.",
    "In 2020, he faced impeachment after it was revealed that he tried to pressure Mr Zelensky into ordering his deputies to begin a criminal investigation of Joe Biden’s activities in Ukraine for the purpose of ruining Mr Biden’s campaign chances.",
    "“I said, ‘How smart is that?’ And he’s gonna go in and be a peacekeeper,” the former president continued, quipping that the massive Russian military buildup amounted to “the strongest peace force I’ve ever seen”.",
    "The Georgia congresswoman claimed to reporters a day later that she did not know about Mr Fuentes’s white nationalist views before she appeared on stage with him, and offered a condemnation of the Russian leader.",
    "Former President Donald Trump lashed out at his successor, Joe Biden, on Tuesday in a furious statement that betrayed his own refusal to acknowledge the history of his relationship with Ukraine’s government.",
    "The president also was accused of firing the US ambassador to Ukraine, a career diplomat, in order to prevent obstruction of Rudy Giuliani’s efforts to dig up dirt on Mr Biden in the country.",
    "Mr Trump’s attacks against Mr Biden ring particularly hollow (except among his most loyal supporters) due to his own deeply-fraught relationship with Mr Zelensky and Ukraine’s government.",
    "Ms Greene (and by extension, Republican leaders in the House) have faced fierce criticism for her attendance at the event, which was thrown by outspoken white nationalist Nick Fuentes.",
    "“Now the Fake News Media is trying to say that Trump gave Ukraine nothing and it was Biden who is their great friend and gave them weaponry,” the statement continued.",
    "The former president went on to imply that the news media was creating a false narrative that depicted Mr Biden as a close ally of Ukraine while he was not.",
    "“I went in yesterday and there was a television screen, and I said, ‘This is genius.’ Putin declares a big portion of the Ukraine – of Ukraine.",
    "He was even claimed to have held up that same military aid to Kyiv he bragged about in his statement amid his efforts to pressure Mr Zelensky.",
    "“What he’s doing is completely wrong, and I stand with our NATO member allies, and I am completely against this war.",
    "“Putin is a murderer, and he should have never invaded Ukraine,” she told reporters later at CPAC.",
    "Oh, that’s wonderful,” said Mr Trump during an interview with two podcast hosts.",
    "Everything he’s doing is wrong, and he’s killing people.”",
    "Putin declares it as independent."
  ]
}