{
  "id": 3657,
  "mediaId": 2550,
  "date": "2022-03-01",
  "headline": "War in the GOP: Have Marjorie Taylor Greene and Paul Gosar made one too many mistakes?",
  "image": "https://images.dailykos.com/images/1043320/story_image/GettyImages-1357738668.jpg?1646092641",
  "link": "https://www.dailykos.com/stories/2022/2/28/2083009/-Republican-neocons-call-Paul-Gosar-and-Marjorie-Taylor-Greene-morons-for-their-antisemitism?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1726,
    1926,
    2298,
    2923,
    3151,
    3242,
    4087,
    4261,
    4384,
    878
  ],
  "sentences": [
    "“This is unacceptable.” pic.twitter.com/rw3U2MY50j\n— Jake Sherman (@JakeSherman) February 28, 2022\nAnd if you don’t think Kevin McCarthy does anything without having someone in leadership prod him with a hot poker, Senate Minority Leader Mitch McConnell busted out of his turtle shell to release a statement condemning the pair’s actions a short while before McCarthy, saying “there’s no place in the Republican Party for white supremacists or anti-Semitism.” Senate Minority Whip John Thune was able to peek out from under whatever fossil fuel donor money pile he was bathing in long enough to tell reporters that it was “unacceptable,” and he wanted to “disassociate myself from it.”\nThe Republican Party: We don’t believe in anything, but you know exactly what we believe in, amiright?",
    "- Sen. Mitt Romney reacts to pro-Putin sentiments from GOP members and some media outlets: https://t.co/S6ESuaj46b #CNNSOTU pic.twitter.com/ZPDC3bGMgI\n— State of the Union (@CNNSotu) February 27, 2022\nRomney, after making sure that America knows he doesn’t “know them,” said they reminded him of the line from the film Butch Cassidy and the Sundance Kid: “Morons, I’ve got morons on my team.” He followed that up with “I have to think that anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points.\"",
    "Maybe the neocon wing of the party, seeing that the far right isn’t polling particularly well thanks to their continued praise of Vladimir Putin at a time when the worst aspects of supporting Vladimir Putin are on display to the entire Earth, has suddenly decided to throw out some strongly worded admonishments at tweedledumb and tweedledumber.",
    "Even the truly spineless GOP House Minority Leader Kevin McCarthy, a man who could be blown over by the word “breeze,” told reporter Jake Sherman that Marjorie Taylor Greene’s decision to appear alongside a pretty blatant antisemite who is literally leading chants for Vladimir Putin in his introduction to her appearance, was not a good look.",
    "On Sunday, Sen. Mitt Romney, who like the rest of the Republican Party fell humiliatingly in line with Donald Trump after he won the Electoral College in 2016, went on television and called Reps. Gosar and Greene “morons” for their part in espousing (once again) openly white supremacist, anti-American positions.",
    "Greene was on brand during the antisemitic event, saying she wouldn’t leave the white men at the conference behind and criticizing the “Pharisees in the Republican Party.” You see, in this analogy, Greene and Gosar are a Jewish Jesus, and the neocons are the corrupt temple leadership.",
    "The one thing that the neocons have going for them is that the MAGA/tea party types are almost psychopathic in their blatant bigotries and open about their desire to turn our country into an oligarchy controlled by a minority of fossil-fuel billionaires.",
    "Earlier this weekend, Rep. Marjorie Taylor Greene decided to speak at the America First Political Action Conference organized by Nick Fuentes, a white nationalist who began his little hate conference back in 2020.",
    "Here’s a reminder of what people like Nick Fuentes (and former Trump adviser Stephen Miller before him) are actually fighting for:\nx\nShortly before bringing up MTG, the camera showed a sizeable and raucous crowd.",
    "On one side you have the Trump/MAGA/tea party wing of the GOP, filled with detestable folks like Reps. Lauren Boebert, Matt Gaetz, Madison Cawthorn, Paul Gosar, and Marjorie Taylor Greene.",
    "As a result, the hope for neocon types is that they, as Republicans, might be able make stories stick to the Gosars of the world in ways that less conservative messengers might not.",
    "As if just realizing it, neocons and the rest of the traditional media pointed out that Rep. Paul Gosar spoke at a similar event with the same collection of bigots last year.",
    "He even said she has to “personally” answer for it and that she should have “walked off stage.” He told Politico that he would have “a discussion” with both Gosar and Greene.",
    "But more likely, in this analogy, Greene is really saying the Republican establishment is in league with the amorphous globalist Jewish cabal running the world.",
    "pic.twitter.com/I8BGH1TYGm\n— Ben Lorber (@BenLorber8) February 26, 2022\nBut never fear: This has been the underlying motor of the Republican Party for decades.",
    "The two GOP representatives did this because they support white supremacist ideology and find a good deal of electoral and financial support from racists.",
    "Maybe the neocons are desperate, and do most of their best propaganda when they’re frothing in front of microphones talking about invading countries.",
    "They have senators under their sway like Josh Hawley, and to a lesser degree (because of how baseline craven his absence of morality is) Ted Cruz.",
    "Dan Crenshaw) leaning lightly to one side and then the other like the vapid stalks of dehydrated celery their backbones are made of.",
    "The other side is represented by neocons like Reps. Liz Cheney and Adam Kinzinger and, to a lesser degree, Sen. Mitch McConnell.",
    "Fuentes then solicited a round of applause for Russia in its invasion of Ukraine, and the groyper crowd chanted \"Putin, Putin.\"",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The chickens have come home to roost and, fingers crossed, they won’t bring a bunch of fascists to take over the farm.",
    "Whatever it is, neocons came out in droves in an attempt to cleave off these two barnacles.",
    "The battle is something to watch from the outside, with a variety of other characters (i.e.",
    "I just caught up with @GOPLeader on MTG, Gosar attending a white supremacist rally.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "The Republican Party is fighting an intra-organizational battle for control.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "See how easy it is to mangle analogies while vaguely making a point?",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "And it just makes me ill to see some of these people do that.\"",
    "Fuentes praised \"our secret sauce...young white men.\"",
    "He said he plans to meet with @RepMTG this week.",
    "When these two smile, a demon gets its talons.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "x\n\"It's unthinkable to me.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "It's almost treasonous.",
    "Please read it.",
    "x\nNEW."
  ]
}