{
  "id": 3680,
  "mediaId": 2550,
  "date": "2022-03-04",
  "headline": "Disgust abounds after three House Republicans vote no on resolution supporting Ukraine",
  "image": "https://images.dailykos.com/images/1043125/story_image/GettyImages-1238815929.jpg?1646067473",
  "link": "https://www.dailykos.com/stories/2022/3/2/2083505/-Three-Republicans-vote-no-on-resolution-supporting-Ukraine?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1926,
    2201,
    2903,
    3061,
    3709,
    4087,
    4373,
    878,
    5287,
    5366
  ],
  "sentences": [
    "— Adam Kinzinger (@AdamKinzinger) March 2, 2022\nx\nDear Gosar, Rosendale, and Massie, you are not anti-war: https://t.co/U0XK7Szp9N\n— Adam Kinzinger (@AdamKinzinger) March 2, 2022\nx\nPaul Gosar joins with two other Republicans to vote no on a resolution supporting the people of Ukraine pic.twitter.com/7WZM4CFyuz\n— Acyn (@Acyn) March 2, 2022\nx\nFascist pro-Putin MAGA traitors Paul Gosar, Thomas Massie, & Matt Rosendale just voted against a resolution to help the people of Ukraine.",
    "The non-binding resolution, among other things, says the House \"supports, unequivocally, Ukraine's sovereignty and territorial integrity\" and \"states unambiguously that it will never recognize or support any illegitimate Russian-controlled leader or government installed through the use of force.\"",
    "Insider:\nRep. Paul Gosar of Arizona, Rep. Thomas Massie of Kentucky, and Rep. Matt Rosendale of Montana were the only nay votes on House Resolution 956, titled \"Supporting the People of Ukraine.\"",
    "Three members of the Congressional Putin Caucus (fka the GOP) have somehow seen fit to vote against a resolution supporting Ukraine in the wake of Russia’s elective war of aggression.",
    "— The USA Singers (@TheUSASingers) March 2, 2022\nx\nThomas Massie, Paul Gosar and Matt Rosendale just voted against a resolution that was passed to support the people of Ukraine.",
    "I thought we unreservedly supported fellow democracies, but I guess the calculus shifted sometime after Donald Trump gave Putin that very public reach-around in Helsinki.",
    "It ends by stating the House \"stands steadfastly, staunchly, proudly, and fervently behind the Ukrainian people in their fight against the authoritarian Putin regime.\"",
    "I can see why that statement would be controversial, as it says nothing at all about Paul Gosar getting free Costco hot dogs for life.",
    "x\nPaul Gosar, Rosendale, and Thomas Massie just voted NO in the house of reps on a resolution supporting the people of Ukraine.",
    "It’s an odd choice for members of a party that’s already under heavy scrutiny for its past appeasement of the Russian dictator.",
    "Did they think Congress was taking orders for a delivery of Ukrainian food, and they simply aren’t fans of beet-based cuisine?",
    "It made comedian Sarah Silverman say, “THIS IS FUCKING BRILLIANT,” and prompted author Stephen King to shout “Pulitzer Prize!!",
    "Or, if you prefer a test drive, you can download the epilogue to Goodbye, Asshat for the low, low price of FREE.",
    "It also calls for the US and other nations \"to deliver additional and immediate defensive security assistance.\"",
    "Get them all, including the finale, Goodbye, Asshat: 101 Farewell Letters to Donald Trump, at this link.",
    "It’s pretty much baked into the cake at this point, along with sizable chunks of Gosar’s cerebellum.",
    "The resolution passed the House on Wednesday with 426 votes in favor.",
    "The viral letter that launched four hilarious Trump-trolling books.",
    "Have the larvae in Rep. Paul Gosar’s head finally hit pay dirt?",
    "Needless to say, mine wasn’t the only stomach churned by this.",
    "I should really stop being surprised at Republican perfidy.",
    "Just when you think they can’t go any lower, they do.",
    "(@antifaoperative) March 2, 2022\nShit stains?",
    "You give them far too much credit, Beks.",
    "Republicans are deplorable shit stains.",
    "Not sure what happened here.",
    "!” (on Twitter, that is).",
    "Did their fingers slip?",
    "Who the fuck knows?",
    "Try aiming lower.",
    "I sure don’t.",
    "What is it?",
    "— ????????",
    "????????",
    "Unreal."
  ]
}