{
  "id": 3688,
  "mediaId": 2594,
  "date": "2022-03-03",
  "headline": "Three Republicans under fire for voting against House resolution to ‘stand with Ukraine’ amid Russia invasion",
  "image": "https://static.independent.co.uk/2021/12/11/16/newFile-1.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/republicans-ukraine-gosar-rosendale-massie-b2027486.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sravasti Dasgupta",
  "authorUrl": "https://www.independent.co.uk/author/sravasti-dasgupta",
  "termIds": [
    1926,
    2430,
    2903,
    4373,
    472,
    878,
    5287,
    5366
  ],
  "sentences": [
    "Mr Gosar, who was called out last year for sharing an anime video that depicted fellow representative Alexandria Ocasio-Cortez as a monster, replied to Mr Kinzinger’s tweet and said: “Talk to me when our border is secure.”\nLater he issued a separate statement on Twitter and said: “Congress takes an exclusive oath to defend the Constitution of the US, not Ukraine, NATO, globalist initiatives, or anything else.”\n“AZ [Arizona], USA is the frontline of democracy.",
    "Three House Republicans have come under fire for voting against a bipartisan congressional resolution expressing support for Ukraine’s territorial sovereignty as the country continued to fight Russian troops that launched a full-scale military invasion last week.",
    "The resolution stated the US “supports, unequivocally, Ukraine’s sovereignty and territorial integrity” and “states unambiguously that it will never recognise or support any illegitimate Russian-controlled leader or government installed through the use of force”.",
    "He added that the resolution also called for economically isolating Russia which would affect low income US citizens who are reeling from inflation and could also make Russian president Vladimir Putin more “desperate” and incite him to take “drastic” measures.",
    "In a series of tweets, Mr Massie said that while he supports the people of Ukraine, he had chosen not to vote for the resolution as it “contains an open ended call for additional and immediate ‘defensive security assistance’.",
    "While Mr Rosendale did not issue a statement immediately, he said in a tweet on Monday that US citizens are tired of politicians putting the interests of foreign nations over theirs.",
    "The Republicans who voted against the resolution - Reps Paul Gosar of Arizona, Thomas Massie of Kentucky, and Matt Rosendale of Montana - were swiftly attacked on social media.",
    "In a tweet the Congressman from Illinois said: “Paul Gosar, Rosendale, and Thomas Massie just voted NO in the house of reps on a resolution supporting the people of Ukraine.",
    "“The American people are sick and tired of career politicians consistently putting the interests of foreign nations above our own, we must put America first,” he said.",
    "On Tuesday, in his first State of the Union address to the Congress, president Joe Biden condemned Mr Putin’s invasion of Ukraine as “premeditated and unprovoked”.",
    "The House Resolution 956, titled “Supporting the People of Ukraine,” was passed on Wednesday with an overwhelming 426 votes in favour and only three votes against.",
    "While Mr Gosar and Mr Massie released statements later explaining their decision to vote against the motion, no statement has yet been released by Mr Rosendale.",
    "Depending on the definition of ‘violate’, this could be a US commitment to forever be actively engaged in a conflict with another nuclear country,” he added.",
    "Rep Adam Kinzinger, who has emerged as one of the most vocal critics of his party, called out his Republican colleagues for their negative vote.",
    "Congress must prioritise the the strong national defence of our republic & exercise Constitutional restraint,” he added.",
    "“It calls for continuing support ‘as long as the Russian Federation continues to violate Ukraine’s sovereignty’.",
    "Unreal.”\nThe three Republicans were also called out by the Democratic Congressional Campaign Committee (DCCC).",
    "“Last night, the president spoke of America standing with the wall of strength that is the Ukrainian people.",
    "This term is so broad that it could include American boots on the ground,” he said.",
    "Just now, three House Republicans voted NO on a resolution in support of Ukraine.",
    "Truly despicable behavior,” it said in a tweet.",
    "Paul Gosar, Matt Rosendale, Thomas Massie.",
    "Their names?"
  ]
}