{
  "id": 3705,
  "mediaId": 2550,
  "date": "2022-03-01",
  "headline": "Idaho's lieutenant governor wants you to know she doesn’t agree with antisemites, just their ideas",
  "image": "https://images.dailykos.com/images/1043626/story_image/ScreenShot2022-03-01at2.42.25PM.png?1646174553",
  "link": "https://www.dailykos.com/stories/2022/3/1/2083239/-Idaho-s-lieutenant-governor-wants-you-to-know-she-doesn-t-agree-with-antisemites-just-their-ideas?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1768,
    1926,
    2386,
    3242,
    3570,
    4088,
    55,
    484,
    5034
  ],
  "sentences": [
    "But nothing she does surprises us anymore; it just puts us in an awkward position.”\nTo that end, McGeachin released a statement in response to critics of her appearance at the AFPAC bigotry bowl last Friday, saying she was invited to submit a video to the conference.",
    "Little is facing off against the fringy McGeachin and, if he’s able to get through his primary, an independent run by none other than Ammon Bundy—best known for trespassing on public lands in an attempt to make them private for the fossil fuel industry.",
    "McGeachin went back to bleating about “fighting for the soul of our nation,” and how just because she seems to endorse and be endorsed by all of these well-known antisemitic white supremacist assholes, it doesn’t mean she is one, too.",
    "To be clear, the chaos around the pandemic and its handling in Idaho has been facilitated by people like McGeachin, who has been purposefully oblique about whether or not there really is a pandemic happening in the first place.",
    "The Idaho Statesman reports that McGeachin’s statement included this piece of racist cowardice: “I do not and have never supported identity politics or other discriminatory views that only seek to divide us and not unite us.",
    "This is the same event that prompted GOP leadership to make some attempts at condemning how overtly antisemitic and racist some of its shiniest scam artists stars like Reps. Paul Gosar and Marjorie Taylor Greene are.",
    "Anyone who actually listens to what I say or who pays attention to what I’ve done in my many years of service knows this is true.”\nHere’s a reminder of who the organizer of AFPAC is:\n“You know what I want?",
    "But as an anonymous Idaho Republican state senator told the Daily Beast, McGeachin is far-right-wing out to lunch these days, and any attempts to get her to even act less racist aren’t likely to work.",
    "From there Holmes pressed McGeachin on whether or not, now that she claims she has read about some of the abhorrent stuff Fuentes has said and done, she maybe regrets appearing at his big event?",
    "I don't know, you know, what is everything that he says or doesn't say, is not, does not reflect on who I am or who the thousands of others that are participating in this movement.\"",
    "It seems that David Duke has gotten at least one of his dreams fulfilled, though his biggest dream was to be considered beautiful and powerful and the leader of it all.",
    "Janice McGeachin of Idaho decided to speak at the America First Political Action Conference (AFPAC) organized by white nationalist asshat Nick Fuentes.",
    "He also called himself a “misogynist,” compared himself to Adolf Hitler and “jokingly” denied the Holocaust, according to the Anti-Defamation League.",
    "The reason for this is that no matter what some neocons say, the GOP is now officially the political party of the white supremacist movement.",
    "So the good news is that he won’t really see this as a victory, and will probably continue to feel persecuted until the end of his days.",
    "That every time, any time there's any kind of affiliation with anybody at any time on any stage that we're all guilty by association.\"",
    "She is able to get out the accusation that Holmes is trying to “assassinate me or my character” before abruptly ending the interview.",
    "Here’s an excerpt of how that back-and-forth with reporter Brian Holmes went:\nBrian: \"Are you familiar with who puts this event on?",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "One person who hasn’t said much of anything about McGeachin’s decision to openly embrace white supremacy is Republican Gov.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Holmes, in his defense, tried to remind her that this “association” with people who are clearly antisemitic is not good.",
    "x\npic.twitter.com/1UZSEjbPd4\n— Brad Little (@GovernorLittle) March 1, 2022\nThe interview starts around the 3:40 mark.",
    "As a result he has opened himself up to the more pathologically fascistic McGeachin’s ambitions for power.",
    "I mean, the mainstream media, you do this to conservatives all the time, but you don't do it to yourself.",
    "McGeachin to ask her about how she can pretend she doesn’t support all of the things that she supports.",
    "Brad Little finally found a way to sort of not say McGeachin’s name while saying that racism is bad.",
    "McGeachin is running for governor against the already right-wing Republican Brad Little.",
    "She also attempted to issue an executive order banning vaccine mandates while Gov.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "McGeachin then retreated to the threadbare snowflake whining that “it's not fair.",
    "Brian: \"Did you look up who Nick Fuentes was and what he, what he's talked about?",
    "She is not in step with the Senate or the House—or the governor, for that matter.",
    "McGeachin: \"Well, you know what, Nick Fuentes, as I said, I don't know him.",
    "That’s all I want,” Fuentes said in a livestream video aired this month.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Little’s cowardly handling of the pandemic has been borderline criminal.",
    "Not unlike most GOP leadership in red states across the country, Gov.",
    "Brian: \"Did you not look into it before you decided to say, 'Okay'?",
    "McGeachin: \"You didn't, that's not the question that you asked me.\"",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Logic is like concentrated liquid kryptonite to these people.",
    "Brian: \"Okay, you didn't bother to look up his name.\"",
    "He also tweeted it out in a most convoluted fashion.",
    "“She takes her marching orders from the far right.",
    "x\nx\nx\nThis is a short blurb about Daily Kos.",
    "McGeachin: \"I don't, I don't know who he is.",
    "KTVB 7 caught up with the wild-eyed Lt. Gov.",
    "On Friday night, Republican Lt. Gov.",
    "Janice McGeachin is tripling down.",
    "I, he's never, I've never met him.",
    "Like what he, things he has said?\"",
    "McGeachin: \"I didn't say that.\"",
    "Well, I guess that solves that?",
    "Brian: \"You did look him up?\"",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Yes, there’s video of that.",
    "I mean, his name is on it.\"",
    "McGeachin: \"I have since.\"",
    "Want to keep it that way?",
    "Brian: \"Since last week.",
    "I don't know who he is.\"",
    "Daily Kos is different.",
    "Little was out of town.",
    "Total Aryan victory.",
    "Like Nick Fuentes?\"",
    "I've never met him.",
    "Like to find out?",
    "McGeachin: \"Yes.\"",
    "Please read it.",
    "Idaho Lt. Gov.",
    "Update: Gov.",
    "Brad Little.",
    "Not before.\"",
    "Holy moly.",
    "I don't."
  ]
}