{
  "id": 3758,
  "mediaId": 2639,
  "date": "2022-02-28",
  "headline": "The women in red",
  "image": "https://cdn.newsday.com/ace/c:NzMzMDJhMWQtNjJlNS00:OTgyNjQ1/preview/1280",
  "link": "https://www.newsday.com/opinion/newsday-opinion-point-newsletter-s68831",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1926,
    2201,
    2298,
    2338,
    4527,
    4531,
    4599,
    878,
    4886
  ],
  "sentences": [
    "Daily Point\nNassau’s GOP women paint the convention red\nShortly after the Republican State Committee began to convene at the Garden City Hotel early Monday, Nassau County GOP chairman Joe Cairo got a chance to show off last fall’s electoral successes to the rest of New York — an upbeat message for a state party that knows it is currently out-funded and outnumbered.",
    "— Mark Chiusano @mjchiusano\nPencil Point\nPraise for Putin\nFor more cartoons, visit www.newsday.com/nationalcartoons\nQuick Points\nIf you say so\nEuropean leaders who ratcheted up sanctions against Russia and support for Ukraine did so after an emotional video call from Ukraine President Volodymyr Zelenskyy, who told them it might be the last time they see him alive.",
    "It was all of a piece with festivities whose mood was decidedly \"anti-politics,\" according to the Daily News: \"Among the dozens of floats separated by marching bands and costumed knights on horseback were parodies mocking President Biden, former President Donald Trump, top U.S. infectious disease expert Dr. Anthony Fauci, plus former Gov.",
    "But Cairo reserved the biggest buildup for new District Attorney Anne Donnelly, talked about how they met last year as he sought out her candidacy — an occasion that even drew a holdover \"boo\" upon the mention of State Sen. Todd Kaminsky (D-Long Beach), who lost to her.",
    "In New York, the former governor is appearing on the airwaves in a new TV spot playing defense against the allegations of sexual harassment collected in the infamous August report commissioned by state Attorney General Tish James that presaged his downfall.",
    "Video of a float sent to The Point by another NY visitor to The Big Easy depicted Cuomo as a \"Me Too Prison\" inmate, with shout outs to Charlie Rose, Harvey Weinstein, Bill Clinton, and a busty blond figure saying, \"How about a backrub honey.\"",
    "Cairo, who hailed Donnelly for having gone from Democrat to Republican earlier in her career, said she was the first \"true Republican\" elected to the job since 1974, and that \"turned it all around\" last November for the GOP.",
    "That was a passing historical reference to the late former DA Denis Dillon, who initially won as a Democrat running against a disgraced Republican incumbent, then ran under the GOP banner as a multiparty candidate in 1981.",
    "\"The case against Andrew Cuomo appears to be crumbling,\" a voice says in the first line of the ad, which includes the tagline \"PAID FOR BY FRIENDS OF ANDREW CUOMO\" and ends with a shot of the words \"Political attacks won.",
    "Women elected on the Republican line in November wore red jackets and other red outerwear and gave brief greetings first as they were called up to the rostrum one at a time — a purposeful display of gender balance.",
    "North Hempstead Town Supervisor Jennifer DeSena, as a Democrat who ran on the GOP line, first thanked the party and its activists for enabling her to pull off a victory in a traditional Democratic stronghold.",
    "Recent raucous Mardi Gras street celebrations there have featured Cuomo-themed floats, like one highlighted by The City reporter Katie Honan with a diagram purported to chart gubernatorial groping.",
    "Sen. Mitt Romney (R-Utah) called GOP Reps. Marjorie Taylor Greene (Georgia) and Paul Gosar (Arizona) \"morons\" after they attended a white nationalist camp over the weekend.",
    "Former Attorney General Bill Barr says in a new book that he realized late in Donald Trump’s presidency that \"Trump cared only about one thing: himself.",
    "Denise Ford, an enrolled Democrat who caucuses with the GOP majority, whom Cairo called \"a Republican in spirit and philosophy,\" was cheered.",
    "Political insiders say Rep. Tom Suozzi has a narrow path to victory for the Democratic nomination for governor.",
    "Even with men and women students separated, no music classes, and Taliban standing guard, it was a good day.",
    "A score of other incumbents, longtime and new, from county, town and local offices, donned the bright red.",
    "It’s that little strip that runs between \"impossible\" and \"highly unlikely,\" but it’s been walked before.",
    "Kabul University has reopened for the first time since the Taliban took over Afghanistan six months ago.",
    "Leaving the restaurant where they’d discussed the nomination, he asked her if she’d seen \"Casablanca.\"",
    "Outside of his home state, however, down in New Orleans, Cuomo is taking some less-televised hits.",
    "Zelenskyy, a former actor, knows how to deliver a line — but he also has dire truth on his side.",
    "Cairo stepped over and handed down his red tie, which she draped around her neck to cheers.",
    "— Dan Janison @Danjanison\nTalking Point\nI spy Andrew\nWhere is Andrew M. Cuomo these days?",
    "She said that Cairo, in telling of their first meeting last year, left out the ending.",
    "Amid an extended standing ovation, Donnelly noted that she didn’t have the red on.",
    "Comptroller Elaine Phillips proclaimed a \"red wave\" that can extend to the state.",
    "Further proof that the conscience of the Republican Party isn’t only Liz Cheney.",
    "She said she loved the movie, and he asked whether she knew the final line.",
    "\"Bail reform\" supported by Kaminsky in Albany meant \"no bail,\" Cairo said.",
    "Starting March 1, The Point will be available to Newsday subscribers only.",
    "Kathy Hochul has ended the state mask mandate for schools come Wednesday.",
    "She said she answered, \"Yes, the beginning of a beautiful friendship.\"",
    "Last year we had more women running than ever before,\" Cairo said.",
    "— Michael Dobie @mwdobie\nDid you miss an issue of The Point?",
    "Andrew Cuomo and his ex-CNN host brother, Chris.\"",
    "Hope he’s not presenting that as a revelation.",
    "\"I apologize because nobody sent me the memo.\"",
    "Now we find out whether safe is safe enough.",
    "Click here to subscribe at a special rate.",
    "Country and principle took second place.\"",
    "And New Yorkers lost a proven leader.\"",
    "They did it up in red-state red.",
    "\"The party is open to everyone.",
    "Don’t want to miss The Point?",
    "Browse past newsletters here.",
    "Legis.",
    "Gov."
  ]
}