{
  "id": 3775,
  "mediaId": 2636,
  "date": "2022-02-26",
  "headline": "At CPAC, Ukraine and Policy Take a Back Seat to Cultural Grievances",
  "image": "https://static01.nyt.com/images/2022/02/26/multimedia/26pol-cpac-trump/26pol-cpac-trump-facebookJumbo-v2.jpg",
  "link": "https://www.nytimes.com/2022/02/26/us/politics/cpac-trump-republicans.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2270,
    3709,
    3975,
    265,
    305,
    878,
    5366
  ],
  "sentences": [
    "This week, as Russian President Vladimir V. Putin ordered the invasion of Ukraine to the near-universal condemnation of American allies, Mr. Trump on Saturday reiterated his assessment that Mr. Putin was “smart” to invade Ukraine for the price of economic sanctions, though he did call the war “a catastrophic disaster.” His former adviser Steve Bannon praised Mr. Putin for being “anti-woke” — the very theme of the CPAC gathering.",
    "He laughed and added: “They say it’s not a good thing.”\nMr. Fuentes, a white nationalist and Holocaust denier, runs what is known as the America First or “groyper” movement, which promotes a message that the nation is losing “its white demographic core.” Last month, Mr. Fuentes was subpoenaed by congressional investigators examining the attack on the U.S. Capitol on Jan. 6, 2021.",
    "Senator Rick Scott of Florida warned of “woke, government-run everything.”\nAnd former Representative Tulsi Gabbard of Hawaii, who in 2020 ran for the Democratic presidential nomination but has adopted right-wing positions and become a darling of conservative media, labeled the government a “secular theocracy” because of its efforts to fight misinformation.",
    "Polls show Republican voters have a more favorable view of Mr. Putin than of Mr. Biden, and one lesson of the backlash against the party holding the White House during the last four midterm elections is that an intense distaste for a president of the opposing party is more than enough to propel sweeping victories.",
    "It was only seven years ago that Jeb Bush, the former Florida governor, told the CPAC crowd that “it’s good to oppose the bad things, but we need to start being for things.”\nJust as Mr. Trump excised Bush-style conservative politics from the Republican Party, so has it been removed from the annual CPAC gathering.",
    "Representative Jim Banks of Indiana, after saying he would “never, ever apologize for objecting” to Mr. Biden’s victory on Jan. 6, said he and Representative Jim Jordan of Ohio were victimized when they were removed from the House committee investigating that day’s attack on the United States Capitol in 2021.",
    "As the incentives in conservative politics increasingly reward figures caught up in controversies that can allow them to be portrayed as victims, leading to more face time on conservative cable television, some veteran Republicans are lamenting that there is little to be gained by a focus on policy.",
    "“They’d go on to the next victim.”\nMr. Trump had broad support at the event: Of those who responded, 85 percent said they would back him for the Republican nomination for president again, and 97 percent said they approved of his performance as president, according to a straw poll of CPAC attendees.",
    "Eight miles from CPAC, an even angrier right-wing gathering, the America First Political Action Conference, took place at another Orlando hotel with Representative Marjorie Taylor Greene of Georgia as the main attraction and Representative Paul Gosar of Arizona appearing by video.",
    "John Schnatter, the pizza magnate who in 2018 resigned as chairman of the Papa John’s franchise after using a racial slur in a comment about Black people during a conference call, mingled among the crowd, saying he was among those unfairly canceled.",
    "Leila Centner, a founder of a Miami private school, who last year told her teachers and staff they would not be allowed to interact with students if they received a coronavirus vaccine, recounted the backlash once her anti-vaccine views made news.",
    "Charlie Kirk, the founder of Turning Point USA, a pro-Trump grass-roots group focusing on millennial conservatives, denounced “the Republican Party of old” in his speech to the conference, known as CPAC and held in Orlando, Fla., this year.",
    "“But when freedom is lost and it’s eroded, it is so hard to reclaim.”\nAt CPAC, there was no shortage of stories about the horrors of cultural and political cancellations — though the speakers offered scant evidence of actual suffering.",
    "Former Representative Mark Walker of North Carolina, who is running for the Senate against a Trump-endorsed candidate, can’t get much attention, he said, when he touts his record working for veterans during his three terms in Congress.",
    "Playing to feelings of resentment and alienation is a far safer bet for Republicans than advancing a policy agenda when the party remains split on taxes, foreign policy and how much to indulge Mr. Trump’s lies about the 2020 election.",
    "At CPAC, Republicans argued that they were the real victims of Mr. Biden’s America, citing rising inflation, undocumented immigration at the Mexican border and liberal institutions pushing racial diversity in hiring and education.",
    "Like so many of the Republican officials who have remade themselves in his image, Mr. Trump, in a speech to the conference on Saturday night, sought to portray himself as a victim of assaults from Democrats and the news media.",
    "Eight months before the midterm elections, familiar Republican themes like lower taxes and a muscular foreign policy took a back seat to the idea that America is backsliding into a woke dystopia unleashed by liberal elites.",
    "She has become a personality in demand from conservative news networks, and she said in an interview that she now had a homogeneous school community that shared her views on the pandemic and the country’s racial history.",
    "There were two separate kiosks marketing themselves as Trump malls, a shop selling Trump hammocks and, for $35 a book, a five-volume set of every tweet Mr. Trump published as president before Twitter banned him.",
    "The lack of urgency was encapsulated in a statement by Senator Mitch McConnell of Kentucky, the Republican leader, who dismissed a question about what Republicans would do if they took back Congress in 2022.",
    "“And I’ll let you know when we take it back.”\nIn lieu of a united policy, Republicans are hoping that a grab bag of grievances will motivate voters who are dissatisfied with Mr. Biden’s administration.",
    "Like others at CPAC who claimed to have experienced the wounds of cancel culture, Mr. Banks has seen his profile and political standing only increase since the moment he claimed to have been canceled.",
    "number.”\nPlacing cultural aggrievement at the centerpiece of their midterm campaigns comes as Republicans find themselves split on a host of issues that have typically united the party.",
    "Speakers largely brushed off the war in Ukraine, beyond blaming Mr. Biden, and on Friday few people mentioned Judge Ketanji Brown Jackson, Mr. Biden’s new choice for the Supreme Court.",
    "And Senator Josh Hawley of Missouri, a banker’s son who was educated at Stanford and Yale, sought to tie himself to alienated blue-collar workers he claimed were getting a raw deal.",
    "Instead, the focus was on cultural grievances, former President Donald J. Trump and the widespread sense of victimization that have replaced traditional conservative issues .",
    "Representative Madison Cawthorn of North Carolina praised what he called China’s effort to instill “great patriotic and masculine values” in its youth through social media.",
    "That put them at odds with Republican elected officials, particularly congressional leaders, who have denounced Mr. Putin’s actions, as have Democrats and Mr. Biden.",
    "But at the Conservative Political Action Conference, the annual gathering of the right wing of American politics, the news convulsing the world seemed oddly distant.",
    "A Modern-Day Party Boss: Hoarding cash, doling out favors and seeking to crush rivals, Mr. Trump is behaving like the head of a 19th-century political machine.",
    "Every speaker emphasized personal connections to Mr. Trump, no matter how spurious, while others adopted both his aggrieved tone and patented hand gestures.",
    "At a Mexican restaurant inside the conference hotel, Representative Billy Long of Missouri argued that he coined the phrase “Trump Train” on 2015.",
    "The annual gathering of American conservatives reflected the G.O.P’s shift away from policy issues that had traditionally animated the party.",
    "“Some of the new people entering the political world, they get 12 press secretaries and one policy person,” Mr. Walker said in an interview.",
    "“You can always cut taxes, you can always roll back regulations, you can always elect better people,” Senator Marco Rubio of Florida said.",
    "Just the Beginning: For many Trump supporters who marched on Jan. 6, the day was not a disgraced insurrection but the start of a movement.",
    "At the same time the hallways of the massive Orlando hotel hosting the event were filled with an array of Trump paraphernalia.",
    "On Capitol Hill, Republican senators are debating whether to release an official policy agenda at all ahead of the midterms.",
    "Power Struggle: Led by Senator Mitch McConnell, a band of anti-Trump Republicans is maneuvering to thwart the ex-president.",
    "The commentator Nick Fuentes, head of the group that hosted the conference, said Mr. Putin had been compared to Hilter.",
    "President Biden announced a new Supreme Court appointment who is unlikely to get any significant Republican support.",
    "“Conservative leaders can learn something from our wonderful 45th president of the United States,” Mr. Kirk said.",
    "“I want our leaders to care more about you and our fellow countrymen than some abstract idea or abstract G.D.P.",
    "Post-Presidency Profits: Mr. Trump is melding business with politics, capitalizing for personal gain.",
    "He said they would leave him alone if he were not a threat to seek the presidency again in 2024.",
    "She told the CPAC audience that her student enrollment went up and there was now a waiting list.",
    "“What this whole thing has done is it’s actually made our community more aligned,” she said.",
    "But Ms. Centner said the brouhaha turned out to be a positive thing for her and her school.",
    "“If I said ‘I’m not going to run,’ the persecution would stop immediately,” Mr. Trump said.",
    "ORLANDO, Fla. — Russia’s invasion of Ukraine has much of the world transfixed and on edge.",
    "“We both got canceled and kicked off the committee by Nancy Pelosi,” Mr. Banks said.",
    "At CPAC and beyond, focusing on the negative can be strategic as well as visceral.",
    "presidential nominee in 2024, 59 percent said Mr. Trump and 28 percent said Gov.",
    "“Rednecks and roughnecks get a lot of bad press these days,” Mr. Hawley said.",
    "“There’s a problem with that, right?”\nAlan Feuer contributed reporting.",
    ": Mr. Trump remains the most powerful figure in the Republican Party.",
    "of Florida — though Floridians made up 37 percent of CPAC attendees.",
    "He said he still used it as his wireless internet password.",
    "“The media was all over me, they went ballistic,” she said.",
    "“That is a very good question,” Mr. McConnell said.",
    "However, there are signs his control is loosening.",
    "How Donald J. Trump Still Looms\nGrip on G.O.P.",
    "Asked who should be the G.O.P.",
    "was more than a bit suspect.",
    "Even the G.O.P.",
    "Ron DeSantis."
  ]
}