{
  "id": 3785,
  "mediaId": 6656,
  "date": "2022-03-02",
  "headline": "U.S. House passes resolution declaring support for Ukraine",
  "image": "https://cdnph.upi.com/sv/ph/og/upi/1271646268725/2022/1/4071f9a35f5f1b78c075b4ca17ba7238/v1.5/US-House-passes-resolution-declaring-support-for-Ukraine.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/03/02/House-passes-resolution-supporting-Ukraine/1271646268725/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Calley Hair",
  "authorUrl": "",
  "termIds": [
    1926,
    2903,
    3709,
    4087,
    4582,
    305,
    1094,
    1163,
    4830,
    5366
  ],
  "sentences": [
    "Additionally, the document asserts that the legislative body \"will never recognize or support any illegitimate Russian-controlled leader or government installed through the use of force,\" and urges the United States and its allies to deliver defensive assistance to Ukraine.",
    "The non-binding resolution urges Russian President Vladimir Putin to adopt \"an immediate cease-fire\" and states that House members stand \"steadfastly, staunchly, proudly and fervently behind the Ukrainian people in their fight against the authoritarian Putin regime.\"",
    "\"I cannot abide another long and expensive war in a country 6,000 miles away to defend their borders while we are under invasion here with 2.5 million illegals last year alone through our undefended border.",
    "Out of 429 voting members, three lawmakers -- all Republicans -- voted against affirming the resolution on Wednesday: Reps. Paul Gosar of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana.",
    "March 2 (UPI) -- The U.S. House of Representatives passed a near-unanimous resolution Wednesday declaring its support for Ukraine as the country defends its territory amid an ongoing attack from Russia.",
    "\"The camera of history is rolling on all of us today,\" Rep. Gregory Meeks, D-N.Y., the chairman of the Foreign Affairs Committee, said in the debate on the House floor.",
    "After the vote, Gosar wrote on Twitter that he stands by his vote despite ardent criticism from Democrats and members of his own party.",
    "Rep. Adam Kinzinger, R-Ill., who often splits with the far right wing of his party, called the trio of no votes \"unreal.\"",
    "He said the resolution would grant Ukraine \"de facto NATO status,\" amounting to \"mandatory war authorization.\"",
    "We're going to stand against you and we're going to preserve democracy, because that's what's at stake here.\"",
    "\"With this resolution, it becomes crystal clear: Mr. Putin, you can't win this.",
    "The Senate passed a similar resolution in support of Ukraine two weeks ago.",
    "I'm a hard no our our money and military,\" Gossar tweeted.",
    "\"The bright side is over 400 voted yes,\" Kinzinger wrote."
  ]
}