{
  "id": 3828,
  "mediaId": 2594,
  "date": "2022-02-27",
  "headline": "Romney calls Marjorie Taylor Greene a ‘moron’ as moderates demand party ditch ‘Putin wing of GOP’",
  "image": "https://static.independent.co.uk/2021/11/08/22/AFP_9Q67FR.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/romney-greene-white-nationalist-conference-b2024570.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Bowden",
  "authorUrl": "https://www.independent.co.uk/author/john-bowden",
  "termIds": [
    1726,
    2298,
    3235,
    3242,
    3267,
    3709,
    4087,
    4527,
    878,
    5225
  ],
  "sentences": [
    "Its host was Nick Fuentes, a known white nationalist who last year declared that his speech at the 2021 iteration of the same convention would be \"the most racist, sexist, antisemitic, Holocaust-denying speech in all of Dallas this weekend.”\nThe freshman Republican congresswoman from Georgia has claimed to members of the media that she was not familiar with the event’s host or the views of his organisation, and was merely there to promote an “America First” policy.",
    "Another Republican who herself has faced censure by the national Republican Party for her participation in the January 6 investigation, Liz Cheney, also aimed fire at Ms Greene: “As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now.”\nRep Adam Kinzinger, her fellow Republican on the January 6 committee, questioned whether there would be any punishment for Ms Greene from Republican leadership that came close to the level that Ms Cheney, who was kicked out of House GOP leadership, has faced.",
    "He previously relented to having Ms Greene stripped of her committee memberships after it was revealed that the congresswoman had endorsed violence against Speaker Nancy Pelosi and other Democrats, but has promised that she will return to her committees should the GOP retake the House.",
    "But on Sunday the backlash continued as Republicans continued to be asked by journalists to comment on her attendance and what it meant that one of the House’s best GOP fundraisers is a right-wing conspiracy theory embracer who appeared onstage with Mr Fuentes.",
    "One reason the Georgia congresswoman has enjoyed some backing from Mr McCarthy and others is her continued support from ex-President Donald Trump, who gave her an onstage shout-out (to applause) during his own address at CPAC on Saturday.",
    "Ms Greene came under fire immediately after attending the self-styled CPAC-alternative conference in Orlando, Florida, hosted for those members of the right wing deemed too extremist for the main convention.",
    "Or does he just do that to people like @Liz_Cheney.”\nKevin McCarthy, the House GOP leader called out by Mr Kinzinger in his tweet, has yet to comment on the attendance of Ms Greene at Mr Fuentes’s event.",
    "\"Marjorie Taylor Greene and Paul Gosar, I don’t know them,” said Mitt Romney, a senator from Utah, referring to an Arizona Republican congressman who has also done events with Mr Fuentes in the past.",
    "“I’m reminded of the old line from the Butch Cassidy and Sundance Kid movie where one character says, 'Morons, I have morons on my team,’” he added on CNN’s State of the Union.",
    "Ms Greene is facing a Democratic challenger in her bid for re-election this year, but is favoured to win in the strongly-conservative 14th congressional district of Georgia.",
    "“Marjorie Taylor Greene spoke at a white nationalist event,” he tweeted, adding: “Wonder if Kevin McCarthy @GOPLeader will kick her out of the Republican Conference?",
    "Rep Marjorie Taylor Greene is now facing criticism from members of her own party for her attendance and speech at a white nationalist conference over the weekend.",
    "“Marjorie is strong on everything and never gives up - a real WINNER!” he tweeted of her in 2020.",
    "Will he endorse her opponent?"
  ]
}