{
  "id": 3836,
  "mediaId": 2664,
  "date": "2022-03-02",
  "headline": "'Unhealthy and unhinged': Marjorie Taylor Greene blasted for 'reprehensible' response to Biden's State of the Union",
  "image": "https://www.rawstory.com/media-library/marjorie-taylor-greene.jpg?id=28254821&width=1200&coordinates=0%2C32%2C0%2C33&height=600",
  "link": "https://www.rawstory.com/marjorie-taylor-greene-unhinged-address/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    1328,
    2201,
    2235,
    3975,
    4261,
    305,
    571,
    878,
    5268,
    5371
  ],
  "sentences": [
    "READ MORE: Kim Reynolds began GOP's SOTU response with iPhone going off — and it just got worse from there: reports\nThe congresswoman hurled insults, calling Biden \"a mentally incompetent, feckless, dementia-ridden piece of crap.\"",
    "Newsweek noted: \"Fox News' Tucker Carlson also promised to reveal 'authentic, real and damning' documents regarding Hunter Biden's business dealings in China and the Ukraine, which he later claimed were lost in the mail.\"",
    "Biden, she said, is working for \"anyone, anywhere that has blackmail evidence on his sexually deviant drug-addled deadbeat dad pathetic, sorry, embarrassing excuse of a son.\"",
    "While Biden addressed the international coalition he's worked to build to help Ukraine, Greene maintained, \"under President Trump, this [war] would have never happened.",
    "The international community has praised Biden, making it clear that there's no way Trump could have crafted the coalition that Biden worked months to build.",
    "Greene has been criticized this week after she spoke at a white supremacist conference where Vladimir Putin and Adolf Hitler were praised from the podium.",
    "Republicans have been criticized as the \"party of no,\" for the past two Democratic presidents, columnist Nicholas Goldberg noted in the Los Angeles Times.",
    "Sen. Mitch McConnell (R-KY) took the rare opportunity to rebuke her and Minority Leader Kevin McCarthy (R-CA) promised to give her another \"talking to.\"",
    "While many Republicans gave Biden standing ovations over bipartisan initiatives and cheers for America, Greene struggled to find anything she liked.",
    "Rep. Marjorie Taylor Greene (R-GA) wasn't part of the Republican response to President Joe Biden's State of the Union Address, but she tried to be.",
    "Greene was one of two Republicans, with Lauren Boebert, who attempted to heckle Biden during the speech, drawing boos from both sides.",
    "Instead, she sought to rant against Democrats in a 30-minute, conspiracy-laden, word-salad for the Right Side Broadcasting Network.",
    "She then claimed that Biden was \"compromised\" by foreign leaders due to the conspiracy theory about his son's laptop.",
    "But according to Rep. Adam Kinzinger (R-IL), it's Republicans like Greene who are actually running the caucus now.",
    "In her own SOTU response video, she ranted against everything President Joe Biden stands for, Newsweek reported.",
    "For four years, our country had a real leader that led America and the entire world to peace for strength.\"",
    "Greene went on to rant about Afghanistan, falsely claiming \"thousands of Americans\" were still stuck there.",
    "Greene didn't clarify how Trump would have prevented the war, however, or clarify how Trump is stronger.",
    "Her speech came after she was triggered into making a video on the right-wing site Gettr.",
    "On Feb. 1, Qatar reached a deal with the Taliban to restart the flights and evacuations.",
    "Greene brought that to a whole new level Tuesday night after the big speech.",
    "See the complaints from angry Americans below:",
    "As of Jan. 11, that number was closer to 80.",
    "\"Joe Biden, you are not a president.",
    "You are a piece of s*it,\" she said."
  ]
}