{
  "id": 3878,
  "mediaId": 2547,
  "date": "2022-03-02",
  "headline": "Neo-Nazi Nick Fuentes Is Gloating About Taking Over The GOP",
  "image": "https://crooksandliars.com/files/embeds/2022/03/49424.jpg",
  "link": "https://crooksandliars.com/2022/03/cpac-eat-your-heart-out",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Neiwert",
  "authorUrl": "https://crooksandliars.com/team/david-neiwert",
  "termIds": [
    1926,
    2674,
    3242,
    3709,
    305,
    878,
    1163,
    4830
  ],
  "sentences": [
    "But if we can drag the furthest part of the right further to the right, and we can drag the center further to the right, and we can drag the left further to the right … then we’re winning.”\nAmerica First’s mainstream traction reflects the disturbing trend over the past year in which rather than scattering for cover as their members and cohorts were placed under arrest, extremist-right factions have doubled down and hardened their responses, encouraged by Republicans’ insistence that the insurrection was simply “legitimate political discourse.”\n“These figures see the growth of the hard-right, anti-democratic faction of the Republican Party in the aftermath of January 6 as an opportunity to push their own reactionary agendas further into the mainstream,” Southern Poverty Law Center analyst Hannah Gais told Holt.",
    "“At this point,” he told attendees, “it’s less a battle about what happens in 2020 and a battle for what happens after Trump.” He continued that, “The only chance for America to be saved is if populism is able to move beyond Trumpism—is if someone comes along in 2024 that can carry the mantle of nationalism, strikes down globalism, and is able to get elected and actually make things happen once he gets in office.”\nCasey also made clear that for the foreseeable future, one prong of their effort would focus on the Republican Party—a target distinct from the initial thrust of the “alt-right” strategy of attempting to bring disparate reactionaries operating outside the party into the white nationalist fold.",
    "Putin!” Fuentes applauded and laughed, saying: “Absolutely, absolutely.”\nFuentes was clear that his objective is for the white nationalist movement to overtake the Republican Party, primarily by driving out old-style conservatives, reflected in his oft-repeated catchphrase “destroy the GOP.” He told the audience: “We needed to redefine the right wing by solidifying the political realignment that Donald Trump initiated in 2016, under the banner, and under the slogan, and under the principles of America First.”\nFuentes emphasized that what he called the “civil war” between the “conservative establishment and the America First pro-Trump base” is “now playing out” in national electoral politics.",
    "“Involvement in white supremacy should clearly be verboten by the GOP and any legitimate institution and the fact that it isn’t shows how much these heinous ideas have been mainstreamed into Republican circles in recent years, particularly in the Trump era.”\nAs Jared Holt of the Atlantic Council’s Digital Forensic Research Lab explained at Daily Beast:\nThere was a period in time where associating with Fuentes and his posse’s naked extremism and hate was a mark of death on conservative political figures’ mainstream careers, and rightfully so.",
    "On Monday, she continued the theme: “The European Union is New World Order tyranny and Germany’s attempt to rebuild the Third Reich.”\nHouse Minority Leader Kevin McCarthy added his own words of concern about the appearance of two of his members at AFPAC, describing Fuentes’ rhetoric as “appalling” and saying the “language that he uses about antisemitism and the chanting for Putin is unacceptable.”\nWhat was he planning to do about it?",
    "GOP National Committee Chair Ronna McDaniel—who recently led the censure of two Republican House members for criticizing Trump—would only offer a generic response that didn’t mention anyone by name: “White supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.”\nSimilarly, when confronted by a reporter about Rogers’ participation, Arizona’s Republican Gov.",
    "We are literally in a fight for our lives … Together, we will fight to make Idaho great again.”\nThe online audience of Groypers were less than impressed, many of them describing her appearance as “cringe.” One asked: “Only Idaho?”\nAfterwards, both Greene and McGeachin denied knowing anything about Fuentes or America First before accepting the invitation to appear at the convention or making their remarks.",
    "“What I need as a governor are governing majorities so that I can pass dollars into our social safety net so we can provide programs like this that will help children from all over our state … [and so] we can pass budgets that will put $8.6, $8.7 billion additional dollars into K-12 education,” Ducey said, adding: “So that’s what I’ve wanted to do, is move my agenda forward.",
    "“It has blossomed into what I think is actually the preeminent right-wing political movement in America today!”\nRogers, the Arizona state senator who has defended the Jan. 6 insurrection and promoted numerous right-wing conspiracy theories about the 2020 election and COVID-19 health measures, sounded the most ominous note in her prerecorded address to the convention.",
    "I’m proud of what we’ve been able to accomplish, and [Rogers] is still better than her opponent, Felicia French.”\nFor her part, Rogers went even farther over the cliff after the conference, particularly in voicing her support for Russia in its invasion of Ukraine: “Zelensky is a globalist puppet for Soros and the Clintons,” she tweeted on Sunday.",
    "Fuentes’ cohort at America First laid all this out at the first AFPAC convention in 2019, as the Institute for Research and Education on Human Rights describes in their in-depth report on the organization:\nPatrick Casey made clear in his own presentation that he envisioned extending this brand of activism beyond the upcoming 2020 election.",
    "This is part of how white nationalists—including openly fascist groups like Patriot Front—in general have proceeded to organize in what they see as a post-Trump political environment, preparing for the next phase in which they overwhelm the American right’s existing infrastructure with their own extremist belief systems.",
    "Already deeply enmeshed with the extremist far-right Patriot movement, the GOP is moving on to its next phase of being gradually overwhelmed by the seep of white nationalist ideas and organizing intent into their mainstream, as this weekend’s America First PAC convention in Orlando, Florida, demonstrated vividly.",
    "At last year’s AFPAC, Fuentes praised the deadly attack and told the crowd at his conference that “we need a little bit more of that energy in the future.”\nFuentes also made clear white nationalists’ ardent support for Russian president Vladimir Putin and his ongoing invasion of Ukraine.",
    "Fuentes also regularly proclaims antisemitic beliefs; he has engaged in Holocaust denialism and once denounced far-right commentator Matt Walsh as a “shabbos goy race traitor” because Walsh, who is white, works for an outlet run by conservative commentator Ben Shapiro, who is Jewish.",
    "“It’s shameful that Republican elected officials participated in the white nationalist AFPAC gathering and shocking that many of their fellow Republicans refuse to condemn participation in a racist event,” Heidi Beirich of the Global Project Against Hate and Extremism told Daily Kos.",
    "“The Pharisees in the Republican Party may attack me for being willing to break barriers and speak to a lost generation of young people who are desperate for love and leadership.”\nRepublicans, predictably, were slow to denounce the participation of party members in the gathering.",
    "As always, America First’s founder Nick Fuentes provided his audience of “Groypers” their usual white nationalist red meat: praising Vladimir Putin, joking about Hitler, applauding Russia’s invasion of Ukraine, claiming that white people built America.",
    "It’s gonna be someone like Donald Trump who comes along and acts contra the will of the GOP establishment.”\nThis is the significance of the presence of people like Greene and Gosar at these events: It means that their strategy is gaining traction.",
    "“My name is Marjorie Taylor Greene, I am the daughter of the King, the one true living God, the Alpha, the Omega, our Father in heaven, and I am a forgiven sinner washed in the blood of our savior, Jesus Christ,” she told the audience.",
    "“And now they’re going on about Russia and ‘Vladimir Putin is Hitler,’ you know, they say that’s not a good thing,” he ranted, then stopped himself: “I shouldn’t have said that,” he added ruefully and then laughed.",
    "Christ is king.”\nMcGeachin’s remarks were mostly generic: “I need freedom fighters all over this country that are willing to stand up and fight for the protection of our freedoms and our liberties,” she said.",
    "“What should be a widely condemned way of thinking linked to domestic terrorism and other forms of violence should never find a home among one of America’s major political parties,” Beirich told Daily Kos.",
    "But this year he was joined on stage by a number of elected Republicans who turned up as speakers—including Congresswoman Marjorie Taylor Greene and Arizona legislator Wendy Rogers—and eagerly joined in.",
    "“Even when that means fighting amongst our own ranks because there are too many Republicans who do not exhibit the courage that is needed today for us to fight to protect our freedoms and our liberties.",
    "He then compared his convention to the more mainstream conservative convention his organization shadows, the annual Conservative PAC gathering, which was occurring elsewhere in Orlando that weekend.",
    "\"It doesn't matter if I'm speaking to Democrat union members or 1,200 young conservatives who feel cast aside and marginalized by society,\" Greene likewise said in a prepared statement.",
    "Besides Rogers, other Republicans such as Congressman Paul Gosar of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "“White supremacy was the justification for so many shameful eras in our history and the fact that Republicans are unable to condemn this barbaric ideology is incomprehensible.",
    "Fuentes was a leading figure in 2020’s “Stop the Steal” election-denial movement and has been resultantly subpoenaed by the House committee investigating the Capitol riot.",
    "All this fits Fuentes’ strategy to a T: “We have got to be on the right, dragging these people kicking and screaming into the future … into a truly reactionary party.",
    "\"I was invited to submit a video to AFPAC, and I took the opportunity to share my views about these vital America First policies,” McGeachin said in a statement.",
    "Analysts who monitor the activities of the radical right warned that this kind of infusion of far-right politics into the conservative is extremely dangerous.",
    "If we try some of these high-level criminals, convict them, and use a newly built set of gallows, it will make an example of these traitors to our country.",
    "Though Fuentes often denies considering himself a white nationalist, he espouses the ideology verbatim in public settings often and specifically.",
    "And I look at China and I look at Russia, who—can we give a round of applause for Russia?”\nAt this, the crowd roared and began chanting: “Putin!",
    "Greene, moreover, eagerly pushed the Groypers’ increasing embrace of Christian nationalism by opening with an explicitly religious recitation.",
    "Anyone who actually listens to what I say or who pays attention to what I've done in my many years of service knows this is true.\"",
    "“I do not and have never supported identity politics or other discriminatory views that only seek to divide us and not unite us.",
    "Casey stressed that, “We’re not going to see any change on the national level from anyone outside of the Republican Party.",
    "Instead, he made it clear that extremists are welcome within his coalition as long as they back his immediate agenda.",
    "Fuentes reveled in their presence and marveled at the size of his audience: “A thousand people,” he said, grinning.",
    "The crowd began chanting Groypers’ new religious slogan: “Christ is king!” Greene smiled and said: “Praise God.",
    "They have yet to be justly punished for the crimes they’ve committed.” The audience loudly cheered.",
    "“When we do take back our God-given rights, we will bring these criminals to justice,” she said.",
    "This is a dangerous development for our democracy.”\nRepublished with permission from Daily Kos.",
    "To borrow a phrase from a friend of mine, our secret sauce here is young white males.",
    "“You know, they say about America, they say, ‘Diversity is our strength,’ you know.",
    "“It took CPAC 30 years to reach a thousand people, it took us only three,” he said.",
    "Others, such as Greene and former Arizona Sheriff Joe Arpaio, spoke in person.",
    "Rogers even called for a “newly built set of gallows” to hang Democrats with.",
    "The radicalization of the Republicans just keeps getting deeper and deeper.",
    "America and the world has forgotten about them, but not us,” he continued.",
    "“We are joined tonight by nine current or former government officials.",
    "Idaho’s lieutenant governor, Janice McGeachin, also spoke.",
    "He said he intended to “have a discussion” with them.",
    "“We’re not going to drag them all the way over.",
    "That’s what we call the secret ingredient.",
    "“I’ve said we need to build more gallows.",
    "Can you believe it?” The crowd cheered.",
    "It’s incremental,” he said in 2021.",
    "Doug Ducey refused to condemn her.",
    "“And you want to know a secret?",
    "Topics:",
    "Amen."
  ]
}