{
  "id": 3892,
  "mediaId": 2634,
  "date": "2022-02-28",
  "headline": "Sorry, Marjorie Taylor Greene Is Part of the Republican Establishment Now",
  "image": "https://images.newrepublic.com/539e7e6f8797a63fcfaf558ba59b5072890eae39.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/165527/marjorie-taylor-greene-cpac-gop",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Shephard",
  "authorUrl": "https://newrepublic.com/authors/alex-shephard",
  "termIds": [
    0
  ],
  "sentences": [
    "Founded in 2020 by white nationalist Nick Fuentes as an alternative to the more buttoned-up (but often still batshit) Conservative Political Action Committee, or CPAC, the conference featured a slew of controversial figures, from fellow Representatives Paul Gosar and Steve King to Gavin McInnes and Milo Yiannopoulos.",
    "Responding to criticism from, among others, RNC Chairwoman Ronna Romney McDaniel, Mitch McConnell, and Mitt Romney, Greene returned once more to the same tired defense she always uses, claiming that adherents of “identity politics” were trying to “cancel her” for her insane views.",
    "During this year’s conference, Fuentes asked attendees to applaud Vladimir Putin’s invasion of Ukraine and heaped praise on the January 6, 2021, insurrectionists—he was there and called the storming of the Capitol “awesome”—as well as Adolf Hitler.",
    "“If there’s anything worth fighting for, it’s our freedom of speech and all of our rights.”\nPressed at the conference the previous day by reporters, she merely deflected, claiming that she did not know Fuentes or the other organizers of AFPAC.",
    "Her presence at CPAC is also a telling reminder that, while the conference has long since ceased being a model of anything related to conservative ideology, it remains tied to the reactionary, often racist politics of that movement.",
    "“The Pharisees in the Republican Party may attack me for being willing to break barriers and speak to a lost generation of young people who are desperate for love and leadership.” Clearly this is a freedom fighter.",
    "Marjorie Taylor Greene, the lunatic Georgia MAGA congresswoman who only recently stopped loving QAnon and thinks that Jewish space lasers might be starting wildfires out West, is one of the right’s biggest stars.",
    "Stripped of her committee assignments and banned from Twitter for spreading Covid-19 misinformation, Greene is a completely ineffectual, downright useless—even by congressional standards—representative.",
    "“Big Tech has aligned with the government, they’ve aligned with the Democrat Communists, and what they want to do is, they want to silence Americans who are willing to speak the truth,” she continued.",
    "Instead, she is consistently welcomed into Republican circles because, while her views may be reactionary, stupid, and senseless, it’s understood that those are views shared by many Republican voters.",
    "Speaking on a panel at the country’s preeminent conservative conference about cancel culture—itself something of an oxymoron—Greene lashed out at social media companies for silencing her.",
    "Fourteen months after Trump supporters attempted to use violence to disrupt the peaceful transfer of power, figures like Greene are arguably more central to the party than ever before.",
    "“It doesn’t matter if I’m speaking to Democrat union members or 1,200 young conservatives who feel cast aside and marginalized by society,” Greene said in a statement.",
    "But that only adds to her wide appeal on the American right: Here is someone who only wants to own the libs—even if the whole Twitter ban has made that a bit harder.",
    "But she is extremely popular among the party’s far right, which has only grown in importance since Donald Trump was elected president six years ago.",
    "“And now they’re going on about Russia and ‘Vladimir Putin is Hitler’—they say that’s not a good thing,” Fuentes said with a grin.",
    "Terrified of attracting the wrath of those voters—let alone their fearless leader, Donald Trump—Republicans have embraced Greene.",
    "As such, she’s invited everywhere: both to Nick Fuentes’s white nationalist conference and to the Republican establishment one.",
    "What the Georgia congresswoman’s appearance at two conferences—one conservative, one far right—says about the state of the GOP.",
    "The one barrier she seems likely to break is the already gossamer-thin border between these two competing right-wing confabs.",
    "But despite the criticism from McDaniel, McConnell, and Romney, most Republicans have been largely muted in their criticism.",
    "Greene’s presence at both conferences tells you everything you need to know about her current place in GOP politics.",
    "On Friday, she appeared as a surprise speaker at the far-right America First Political Action Conference, or AFPAC.",
    "Greene is, perhaps more than any other member of Congress, someone with deep ties to Trump’s base.",
    "Who can say who might follow in her wake and what high offices they might soon attain?",
    "Sure, she’s hardly popular—her approval rating sits at 24 percent among Republicans.",
    "Greene’s views may have been fringe within the Republican Party not that long ago.",
    "Greene was introduced at the conference not long after Fuentes made these remarks.",
    "“As Americans, we can no longer stay silent, we can no longer shut up,” she said.",
    "Greene’s centrality to Republican politics was on full display last weekend.",
    "But she’s broken out of the fringes and is swimming with the mainstream now.",
    "She might say crazy things all the time, but she is no pariah.",
    "Greene’s mere presence at CPAC further legitimized her.",
    "The following day, Greene appeared at CPAC.",
    "That shouldn’t be surprising.",
    "Yes, Hitler."
  ]
}