{
  "id": 3899,
  "mediaId": 2621,
  "date": "2022-03-02",
  "headline": "Three House Republicans Oppose Resolution Supporting Ukraine in 426-3 Vote",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-02-at-4.32.51-PM.jpg",
  "link": "https://www.mediaite.com/politics/three-house-republicans-oppose-resolution-supporting-ukraine-in-426-3-vote/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Luciano",
  "authorUrl": "https://www.mediaite.com/author/michael-luciano/",
  "termIds": [
    1926,
    2300,
    2903,
    3709,
    4373,
    646,
    872,
    5366
  ],
  "sentences": [
    "It reads in part,\nResolved, That the House of Representatives—\n(1) demands an immediate cease-fire and the full withdrawal of Russian forces from Ukrainian territory;\n(2) supports, unequivocally, Ukraine’s sovereignty and territorial integrity;\n(3) backs the continued use of sanctions, in coordination with United States allies and partners, to fully isolate the Putin regime economically for its unprovoked aggression against Ukraine;\n(4) urges the United States and its allies and partners to deliver additional and immediate defensive security assistance to help Ukraine address the armored, airborne, and other threats Ukraine is currently facing from Russian forces;\n(5) commits to continuing to support resistance by the Ukrainian people as long as the Russian Federation continues to violate Ukraine’s sovereignty and territorial integrity;\n(6) promises to continue to provide significant additional aid and humanitarian relief to Ukrainian refugees fleeing Russia’s aggression, commends European partners for their efforts to relieve suffering on the ground, and urges the Russian Federation alongside United States allies and partners to guarantee safe passage out of the country;\n(7) reaffirms its strong support for the security of United States allies and ironclad commitment to Article 5 of the North Atlantic Treaty Organization (NATO);\n(8) emphasizes that NATO’s relationship with Ukraine is a matter only for Ukraine and the 30 NATO allies;\n(9) pledges to support working with Europe and international partners to bolster Europe’s energy security and reduce its dependence on Russian energy imports;\n(10) underscores the importance of maintaining United States energy independence for the benefit of the American people and United States allies;\n(11) reiterates that Crimea and the territories illegally controlled by the illegitimate Russian-controlled governments in Donetsk and Luhansk are sovereign Ukrainian territory;\n(12) declares that the war in Ukraine, a democratic country, is the frontline of democracy and freedom versus authoritarianism represented by Putin’s Russia;\n(13) supports the right of the Russian people to protest, including the current protests against Putin’s unprovoked war against Ukraine, and demands the immediate release of all those who have been unjustly detained in Russia for expressing their desire for peace;\n(14) comprehends that strongmen, dictators, and authoritarians are watching the world’s response to Putin’s war against Ukraine and learning lessons for their own aggressive actions domestically and abroad, thereby making a strong and united response important to deter the expansion of territory by the use of military force beyond this crisis;\n(15) states unambiguously that it will never recognize or support any illegitimate Russian-controlled leader or government installed through the use of force, and that only the people of Ukraine can choose their leadership through free and fair democratic elections without foreign interference, intervention, or coercion;\n(16) commits to ensuring the illegitimate dictator of Belarus, Alexander Lukashenko, is held accountable for permitting the use of Belarusian territory for, and committing Belarusian forces to, Putin’s unprovoked renewed full-scale invasion against Ukraine; and\n(17) stands steadfastly, staunchly, proudly, and fervently behind the Ukrainian people in their fight against the authoritarian Putin regime.",
    "“This term is so broad that it could include American boots on the ground or, as some of my colleagues have already requested, US enforcement of a no-fly zone.”\nMassie further stated that the resolution “expands the geographic scope of the US commitment to the conflict in Ukraine by condemning the country of Belarus.",
    "We should not be seeking to name new enemies or committing to overturning other governments.”\nBelarus is a Russian client state that is assisting the invasion of Ukraine by contributing troops and staging areas from which to launch attacks.",
    "Subscribe to\nA resolution calling on Russia to withdraw from Ukraine and expressing support for additional aid and humanitarian relief to the besieged country passed the House on Wednesday.",
    "The vote was 426 to three, as Reps. Paul Gosar (R-AZ), Thomas Massie (R-KY), and Matt Rosendale (R-MT) voted against the measure.",
    "Russian President Vladimir Putin order the invasion last week under the pretext of “denazifying” Ukraine’s government.",
    "“The resolution contains an open ended call for additional and immediate, ‘defensive security assistance,'” he said.",
    "On Tuesday, the Belarusian president appeared next to a battle map that suggested Russia may also invade Moldova.",
    "After the vote, Massie explained in a seven-tweet thread why he opposed the resolution.",
    "The seven-page resolution contains many expressions of support for Ukraine.",
    "Want to avoid video ads?",
    "Watch above via C-SPAN."
  ]
}