{
  "id": 3913,
  "mediaId": 2631,
  "date": "2022-03-01",
  "headline": "Ukraine-Russia war overshadows State of the Union. Whatever Biden says, it's not strong.",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_09/3538054/220301-joe-biden-cs.jpg",
  "link": "https://www.nbcnews.com/think/opinion/ukraine-russia-war-overshadows-state-union-whatever-biden-says-it-ncna1290314",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Burns",
  "authorUrl": "",
  "termIds": [
    1810,
    2201,
    3975,
    4466,
    4777,
    878,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "Related:\nOne tweet that perfectly sums up the GOP's laughable Ukraine hypocrisy\nPutin's timing on Ukraine is a gift to Trump that Biden can do little about\nBiden overshadowed by Obama as the former president engages in unseemly politicking\nSubscribe to the THINK newsletter\nReTHINK the news cycle with timely op-eds, in-depth analyses and personal essays delivered weekly to your inbox.",
    "Fifty-six percent of Americans describe Biden’s first year as a “failure.” Inflation, supply chain challenges and pandemic fatigue all weigh on independent voters, long considered a bellwether of Democrats’ midterm electoral hopes, even as job creation and economic recovery are proceeding at a historic pace.",
    "This shift has manifested in a strident public embrace of far-right authoritarianism, most recently when Trumpist Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona spoke at a pro-Vladimir Putin event hosted and funded by prominent white nationalist Nick Fuentes.",
    "Biden’s first year in office didn’t transcend the deep ideological divisions brought to the surface during the Trump administration, the pandemic is still raging, and international conflicts from Afghanistan to Ukraine have left the U.S. looking indecisive as chaos rages.",
    "But these aren’t stable times, and Biden will be speaking to a nation still reeling from the violent aftermath of the bitterly contested 2020 election and deep divisions over vaccination and masking — both conflicts that find their origin in Donald Trump’s long shadow.",
    "Fortunately, Biden can still use Tuesday’s address to rally Democrats and the nation behind causes that unify and energize the same coalition of Black voters, right-of-center suburbanites and independents that won him the presidency in 2020.",
    "A year into Biden’s tenure, the U.S. is still re-establishing its domestic and international footing after Trump’s four-year assault on the legitimacy of American institutions and withdrawal of the U.S. from a position of global leadership.",
    "For Republicans who have spent a generation arguing that the government is broken, Manchin and Sinema’s willingness to kill popular programs like a child tax credit that cut child poverty by nearly half was an early Christmas present.",
    "The GOP, for its part, has tried to unify by driving out voices like Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois who stand up for the integrity of elections and the concept of a GOP that isn’t merely a shill for Trump.",
    "Focusing heavily on jobs will be sure to please skittish moderate Democrats, who have been cautioning Biden to jettison the progressive left’s agenda in favor of the roads-and-bridges talk they think engages crossover voters.",
    "First, Democrats need to make an all-out push to highlight the dangers to abortion rights posed by the Supreme Court’s likely gutting of Roe v. Wade in its coming ruling in Dobbs v. Jackson Women's Health Organization.",
    "Meanwhile, activists and many rank-and-file Democratic voters are still smarting from a year defined more by missed opportunities than watershed victories even though the Democrats hold the White House and Congress.",
    "The Republican Party isn’t prepared for the broad wave of voter discontent that will erupt in a post-Roe America; even a third of self-identified Republicans believe abortion should be legal in at least some cases.",
    "With Americans suffering from a political hangover of historic proportions, optimistic talk about how well our tax-dodging megacorporations are recovering from the pandemic is the last thing on many minds.",
    "Only 1 in 5 Americans approves of what little work is getting done, and that limited progress will grind to a halt if Republicans recapture the Senate, as current midterm polling strongly suggests.",
    "Moreover, America’s most immediate problems are not economic but social and cultural — ones the Republican Party has knowingly exploited and worsened in a win-at-any-cost effort to oust Democrats.",
    "Jackson, in addition to being an exceptional jurist, is also a powerful reminder that Biden is delivering on campaign pledges like nominating a woman of color to the nation’s highest court.",
    "But Biden’s expected up-tempo economy and infrastructure message and discussion of the unified Western stand against Russia don’t capture the true state of our exhausted and bitter union.",
    "The president’s State of the Union address will be delivered to a public actively engaged in a consequential and necessary debate over how the American government should function.",
    "Joe Manchin of West Virginia and Kyrsten Sinema of Arizona to allow votes on popular legislation, including Biden’s Build Back Better package and voting rights protections.",
    "Biden is sure to trumpet the historic economic recovery occurring on his watch, as well as the bipartisan $1.2 trillion infrastructure deal he negotiated with Republicans.",
    "But the economy still has plenty of shortcomings, as the undeniable Biden Boom has brought with it stubborn inflation and a supply chain crisis beyond his control.",
    "Last week’s Conservative Political Action Conference aired a laundry list of imagined grievances from the “big lie” election fraud fantasy to critical race theory.",
    "Partly to blame is the widespread disillusionment in government itself, which is almost certainly worsened by the unwillingness of conservative Democratic Sens.",
    "Trump himself is clearly expecting he’ll again get the GOP presidential nomination, as he draws the loyalty of a commanding majority of Republican activists.",
    "That’s in large part because Democrats — especially Biden — promised a bold post-Trump legislative agenda that is now largely abandoned only a year later.",
    "In more stable times, America’s low unemployment and $1.2 trillion in long-overdue infrastructure spending would be easy victory laps for a new president.",
    "In more stable times, America’s low unemployment and $1.2 trillion in long-overdue infrastructure spending would be easy victory laps for a new president.",
    "Rep. Rashida Tlaib, D-Mich., is expected to shame Manchin and Sinema by name when she issues a progressive response to Biden’s speech Tuesday night.",
    "Democrats themselves are demoralized after a year of often sharp-elbowed infighting, and there’s no sign that tension is going away soon.",
    "On Tuesday, President Joe Biden will deliver his State of the Union address from a U.S. Capitol once again ringed in security fencing.",
    "Another top-tier agenda item: the confirmation of Judge Ketanji Brown Jackson to become the first Black woman on the Supreme Court.",
    "GOP fearmongering led to the violent Jan. 6 attack on the Capitol complex, and right-wing conspiracy rhetoric has only continued.",
    "And after the court’s swing right, Democratic stalwarts are hungry for a win that unites the party’s liberal and moderate wings.",
    "They aren’t wrong to be concerned: A majority of Republicans believe Biden’s presidency to be the product of election fraud.",
    "Whatever the technical limitations of politics in an evenly split Senate, voters certainly don’t feel like Congress works.",
    "Biden won’t be able to heal the nation’s deep, cross-sectional wounds with a single speech, nor should he be expected to.",
    "But part of maintaining credibility with voters is acknowledging the world as it is, not as he wishes it to be.",
    "Almost 60 percent of Americans worry that democracy itself is at risk of collapsing.",
    "On Tuesday, Biden will have an opportunity to do better for the American people.",
    "That thoughtfulness was nowhere to be found in Trump’s swaggering presidency.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "Even more troubling, America is in the midst of an identity crisis.",
    "Two issues in particular could help achieve this goal.",
    "It isn’t clear which side will ultimately prevail.",
    "That has already had violent consequences.",
    "The state of our economy may be strong.",
    "The state of our union is anything but.",
    "But these aren’t stable times.",
    "The result?"
  ]
}