{
  "id": 3925,
  "mediaId": 2593,
  "date": "2022-03-04",
  "headline": "Republicans and Democrats Proudly Pose on Steps of Capitol With American Flag Desecrated for Ukraine",
  "image": "https://ijr.com/wp-content/uploads/2022/03/Congress-flag.jpg",
  "link": "https://ijr.com/republicans-democrats-proudly-pose-american-flag-desecrated-ukraine/",
  "mediaOutlet": "IJR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grant Atkinson",
  "authorUrl": "https://ijr.com/author/wj/ ",
  "termIds": [
    0
  ],
  "sentences": [
    "The resolution urged an “immediate cease-fire” and called upon the U.S. and its allies “to deliver additional and immediate defensive security assistance to help Ukraine address the armored, airborne, and other threats Ukraine is currently facing from Russian forces.”\nThe final vote was 426-3, with only Republican Reps. Paul Gosar of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana voting “no.”\nMassie provided a perfectly reasonable explanation as to why he opposed the resolution.",
    "“We are committed to providing humanitarian and security assistance to Ukraine, as Russia wages its unprovoked and premeditated war.”\nThe Congress remains unwavering and resolute in our support for the people of Ukraine.",
    "“However there are many reasons I could not vote for the seven page Resolution that passed the House of Representatives today.”\n(1/7) I fully support the right of the people of Ukraine to self determination.",
    "It remains unclear to many why U.S. taxpayers should provide billions of dollars to a country in which we have no significant political interest, but anyone who raises this concern is immediately lambasted.",
    "pic.twitter.com/iaw5vtXs1O\n— Nancy Pelosi (@SpeakerPelosi) March 1, 2022\nSupporting Ukraine is one thing, but dishonoring the American flag by putting symbols on it from a foreign country is quite another.",
    "He said the call to assistance was “so broad that it could include American boots on the ground” and that innocent American citizens would unnecessarily bear the brunt of more sanctions against Russia.",
    "— Barba Tenus Sapientes (@barba_tenus) March 3, 2022\nSince Russia invaded Ukraine, the U.S. has seemingly taken a back seat in the minds of many politicians who are supposed to represent it.",
    "According to The Wall Street Journal, the Biden administration asked Congress to authorize $10 billion in aid to Ukraine on Thursday even as the U.S. deals with raging inflation.",
    "While the top half of the flag had the typical red and white stripes, the bottom of the flag featured royal blue and yellow stripes to pay homage to Ukraine.",
    "In addition, in the top left field of white stars against a blue background, the lower half of the stars had been changed to the Ukrainian coat of arms.",
    "Members of Congress can debate how much aid we should provide to Ukraine all they want, and for the most part, that represents a political disagreement.",
    "pic.twitter.com/9F0u3UrJo3\n— Benny (@bennyjohnson) March 3, 2022\n— Ricky Neal Humphreys (@rikhumfrez) March 3, 2022\nOthers were more polite.",
    "House Speaker Nancy Pelosi and many Congress members of both parties proudly stood behind a desecrated American flag for a photo op.",
    "As legitimate as those concerns are, Massie and his two colleagues were immediately painted as heartless scoundrels for their votes.",
    "In a picture posted to her official Twitter account on Tuesday, the California Democrat and other U.S. lawmakers posed with a flag.",
    "We are committed to providing humanitarian and security assistance to Ukraine, as Russia wages its unprovoked and premeditated war.",
    "However there are many reasons I could not vote for the seven page Resolution that passed the House of Representatives today.",
    "In this new political world, politicians are encouraged to desecrate the flag and criticized for putting America first.",
    "The Western Journal reached out to Rep. Pelosi and Rep. Crenshaw’s offices and did not immediately receive a response.",
    "— Thomas Massie (@RepThomasMassie) March 2, 2022\nThe subsequent tweets in the thread laid out his specific concerns.",
    "But when they go as far as to tarnish the American flag, it becomes an issue of blatant disrespect for our country.",
    "“I fully support the right of the people of Ukraine to self determination,” he wrote in a Twitter thread.",
    "Many Republicans can also be seen in the picture, the most notable of which is Texas Rep. Dan Crenshaw.",
    "“The Congress remains unwavering and resolute in our support for the people of Ukraine,” Pelosi wrote.",
    "— Elrond Bets (@elrondbets) March 4, 2022\nIn future put two flags side by side, don’t alter our flag.",
    "The establishment’s response to the Ukraine crisis represents a gross misunderstanding of priorities.",
    "Anti-Trump Republican Rep. Adam Kinzinger of Illinois called the vote “unreal,” The Hill reported.",
    "Sadly, it was not just Pelosi and her fellow Democrats who took part in this shameful photograph.",
    "Pelosi’s skin would burn if she held a real American flag so she has to hold up this monstrosity.",
    "Most people agree Russia’s invasion of Ukraine is wrong and lament the loss of innocent lives.",
    "On Wednesday, the House passed a resolution to signal support for Ukraine, The Hill reported.",
    "At the same time, Ukraine is not the United States, nor does it represent the same virtues.",
    "Many conservative commentators noted the desecration of the flag on Twitter.",
    "@SpeakerPelosi please read the Federal law for the American Flag.",
    "We are committed to truth and accuracy in all of our journalism.",
    "This article appeared originally on The Western Journal.",
    "Use 2 flags don’t do that to the American flag.",
    "This is a desecration of the American flag.",
    "Read our editorial standards.",
    "Thanks."
  ]
}