{
  "id": 4007,
  "mediaId": 2644,
  "date": "2022-02-26",
  "headline": "Marjorie Taylor Greene addresses white supremacist conference ahead of CPAC",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/Marjorie-Taylor-Greene-948.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/26/marjorie-taylor-greene-addresses-white-supremacist-conference-ahead-of-cpac/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Levine",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We are honored, we are humbled and excited to welcome to the stage right now for our first speech … the representative from Georgia, Marjorie Taylor Greene.”\nFuentes, who has been labeled as a white supremacist by the Anti-Defamation League, has long been banned from attending CPAC.",
    "Fuentes, 23, hosted the America First Political Action Conference at the Orlando Marriott as a form of counter-programming to the more mainstream Conservative Political Action Conference happening nearby.",
    "“I’m also not going to turn down the opportunity to speak to 1,200 young America First patriots because of a few off-color remarks by another speaker, even if I find those remarks unsavory.",
    "Georgia Rep. Marjorie Taylor Greene raised eyebrows after she delivered a keynote address at a conference hosted by noted white supremacist Nicholas J. Fuentes.",
    "I want to embrace the young, boisterous and energetic conservatives in our movement—not cancel them like the establishment does,” Greene told The Post.",
    "In a video statement posted to Twitter Saturday, Greene claimed she had not been aware of Fuentes’ views and said did not support white nationalism.",
    "“[They say] Vladimir Putin is Hitler and they say that’s not a good thing,” Fuentes said during the same event Greene attended Friday night.",
    "In the past he has denied the Holocaust, defended segregation, and urged his followers to kill state legislators.",
    "“I refuse to be silent and I refuse to shut up and I am so proud to be up here,” she told the CPAC audience.",
    "Last year, Arizona Rep. Paul Gosar stopped by the Fuentes gathering before later appearing on stage at CPAC.",
    "Less than 24 hours later, Greene took the stage at CPAC as part of a panel discussion about cancel culture.",
    "The guy Marjorie Taylor Green is with is a David Duke type anti-Semitic racist who defends Hitler.",
    "She is proudly America First,” said Fuentes, video circulating on social media shows.",
    "Her appearance with Fuentes drew immediate fire from her conservative stalwarts.",
    "It’s not the first time CPAC has found unintended crossover with Fuentes’ AFPAC.",
    "Nick Fuentes should be shunned, not embraced,” said GOP pundit Erick Erickson.",
    "“She is a standard-bearer of Trumpism in the US congress.",
    "Greene’s paling around with Fuentes did not come up.",
    "“I shouldn’t have said that,” he added, laughing.",
    "“This is appalling.",
    "She is pro-life."
  ]
}