{
  "id": 4010,
  "mediaId": 2643,
  "date": "2022-02-26",
  "headline": "Cheney Rips GOP Silence Over Greene, Gosar Joining 'White Supremacist' Event",
  "image": "",
  "link": "https://www.newsweek.com/cheney-rips-gop-silence-over-greene-gosar-joining-white-supremacist-event-1683002",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    1726,
    1768,
    1926,
    2298,
    3242,
    3709,
    878,
    1163,
    5408
  ],
  "sentences": [
    "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\n\"As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" the Wyoming congresswoman wrote in a Twitter post, including a video of Fuentes' remarks.",
    "\"It is appalling and outrageous that a member of Congress would share a platform with an individual who has actively spread antisemitic bile, mocked the Holocaust and promoted dangerous anti-Israel conspiracy theories,\" the Republican Jewish Coalition said in a statement.",
    "Representative Liz Cheney, a Wyoming Republican, condemned GOP Representatives Marjorie Taylor Greene and Paul Gosar for participating in a far-right \"white supremacist\" event, while also criticizing Republican leaders for failing to quickly \"renounce\" their actions.",
    "I will continue to ensure she is removed from the conference and look forward to her replacement in Congress,\" he said in a statement emailed to Newsweek on Sunday, after this article originally published.",
    "Nick Fuentes, who the anti-defamation league describes as a \"white supremacist,\" founded AFPAC in 2020 and has even trolled other right-wing events, such as those organized by Turning Points USA and CPAC.",
    "Ukrainian forces are currently fighting back against the Russian invasion as the U.S. and Western European allies implement significant financial sanctions against Moscow and Putin directly.",
    "The organization described the far-right activist as \"a white supremacist leader and organizer and podcaster who seeks to forge a white nationalist alternative to the mainstream GOP.\"",
    "As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "\"I am not going to play the guilt by association game in which you demand every conservative should justify anything ever said by anyone they've ever shared a room with.",
    "ADL wrote in a June 2021 blog post that Fuentes \"has made a number of racist and antisemitic comments under the guise of being provocative and ironic.\"",
    "Greene attended and spoke at the America First Political Action Conference (AFPAC) in Florida on Friday while Gosar appeared and spoke via video link.",
    "And white people are done being bullied,\" Fuentes said directly after Gosar spoke at that event, the Southern Poverty Law Center (SPLC) reported.",
    "He's killing people over and over so I'm staunchly against it and I'm staunchly against Vladimir Putin and his invasion of Ukraine,\" she said.",
    "During Friday's event, Fuentes remarked: \"Now they're going on about Russia and Vladimir Putin is Hitler—they say that's not a good thing.\"",
    "\"I went to talk to them about America First policies and I talked to them about what's important for our country going forward,\" she said.",
    "She took aim at Republican Party leaders for failing to immediately condemn the event and the GOP lawmakers decision to participate.",
    "Greene sought to distance herself from Fuentes when confronted by journalists with CBS News about the event on Saturday.",
    "Newsweek contacted a spokesperson for House Minority Leader Kevin McCarthy, a California Republican, for comment.",
    "And people will curse your name,\" Representative Adam Kinzinger, an Illinois Republican, tweeted about Greene.",
    "\"All Americans should renounce this garbage and reject the Putin wing of the GOP now,\" Cheney said.",
    "If this was not bizarro world, you would be the one censured and excommunicated from the GOP.",
    "I talked about God and Liberty,\" Greene said in a statement emailed to Newsweek on Saturday.",
    "Fuentes went on to lead the audience in chants in favor of Russian President Vladimir Putin.",
    "He and the audience then laughed loudly before he added, \"I shouldn't have said that!\"",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now.",
    "The Georgia Republican went on to condemn Putin and his ongoing invasion of Ukraine.",
    "\"In regards to Russia, Putin is a murderer and he should never have invaded Ukraine.",
    "This article was updated after publication with a comment from Representative Gosar.",
    "On Saturday, Cheney blasted the event as well as Green and Gosar for participating.",
    "NATO members are also providing humanitarian and lethal aide to Ukraine.",
    "I stand with our NATO member allies and I'm completely against this war.",
    "Russian forces launched a full-scale invasion of Ukraine on Thursday.",
    "The Arizona Republican previously attended an AFPAC event last year.",
    "he asked the attendees who cheered for Russia's leader.",
    "\"This has absolutely no place in the Republican Party.\"",
    "SPLC described AFPAC as a \"far-right extremist\" event.",
    "This country wouldn't exist without white people.",
    "I don't know what his views are,\" she insisted.",
    "\"Can we give a round of applause for Russia?\"",
    "Other Republicans expressed outrage as well.",
    "You will lose ultimately, just like Putin.",
    "You are defending your presence there.",
    "You spoke to a white supremacy group.",
    "What he is doing is completely wrong.",
    "\"Liz Cheney's opinion is irrelevant.",
    "Everything that he's doing is wrong.",
    "I'm not going to be drawn into that.",
    "I'm only responsible for what I say.",
    "\"White people founded this country.",
    "Gosar dismissed Cheney's criticism.",
    "\"I don't know Nick Fuentes.",
    "I've never seen him speak.",
    "So ask me about my speech.",
    "I've never seen a video.",
    "\"I am going to play it."
  ]
}