{
  "id": 4015,
  "mediaId": 2672,
  "date": "2022-03-02",
  "headline": "Thomas Massie, Long a Friend to Russia, Votes Against Resolution Supporting Ukraine",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/03/thomas-massie-russia.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/thomas-massie-votes-against-ukraine-resolution-1315534/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Bort",
  "authorUrl": "https://www.rollingstone.com/author/ryan-bort/",
  "termIds": [
    0
  ],
  "sentences": [
    "Massie posted a Twitter thread featuring several reasons he voted against the resolution on Wednesday, including that the move to offer Ukraine “defensive security assistance” is open-ended; that the U.S. should not also condemn Belarus, which is allied with Russia; and that “crippling sanctions could also drive Putin to become more desperate, inciting him to resort to drastic measures such as escalating the weapons employed or the people targeted.”\nMassie’s vote against supporting Ukraine comes two days after he was one of three House members to vote against a bill making lynching a hate crime.",
    "decided not to support the resolution affirming America’s belief in Ukraine’s sovereignty, and holding that the U.S. “will never recognize or support any illegitimate Russian-controlled leader or government installed through the use of force.”\nThe bill also called for the U.S. to “deliver additional and immediate defensive security assistance to help Ukraine address the armored, airborne, and other threats Ukraine is currently facing from Russian force.”\nGosar and Rosendale have both spoken about how the U.S. should not take any side in the conflict.",
    "Along with the unabashedly pro-Moscow then-Rep. Dana Rohrabacher, Massie was part of an infamous 2017 dinner meeting at the D.C. eatery Bistro Bis with Maria Butina (later imprisoned for being an unregistered influence agent of Moscow) and her handler, the Russian central banker Alexander Torshin (later subject to U.S. sanctions for “worldwide malign activity”).",
    "“In talking to folks across Montana, they are much more concerned with stopping the invasion taking place in our country by millions of illegal aliens.”\nMassie retweeted Rosendale’s statement last week and has criticized sending aid to Ukraine, but there may be more to his vote on Wednesday than a belief that America should focus on its own borders.",
    "In 2017 he was one of four nays in a congressional vote to reaffirm NATO’s mutual defense pact, calling the alliance’s expansion into Eastern Europe “unwise and unaffordable.” That same year he voted against a sanctions package targeting Russia.",
    "Gosar later wrote an op-ed arguing that the U.S. should instead be focusing on “the immigration crisis and the invasion taking place along our own southern border.” Rosendale said the same thing in a statement released last week.",
    "Massie has long been friendly with the Russians, tweeting in 2018 “dialogue is good.”\nBut that dialogue has brought Massie in contact with several unsavory Russian characters.",
    "But when Butina was first arrested, Massie wrote an op-ed in her defense claiming that America’s “Russophobic rhetoric seems to have turned into a witch hunt.",
    "Massie’s support of Russia has not just been rhetorical, and includes a long string of votes that align with Moscow’s interests.",
    "In 2019, Massie was the only member of Congress to vote against a measure refusing to recognize Russia’s annexation of Crimea.",
    "“The United States has no legal or moral obligation to come to the aid of either side in this foreign conflict,” he wrote.",
    "Now, he’s refusing to side with the democratic American ally Russia invaded last week and continues to bombard.",
    "Butina and Torshin are now notorious for their op to infiltrate the NRA as a means to influence in the GOP.",
    "The House of Representatives on Wednesday voted in favor of a resolution supporting Ukraine.",
    "Reps. Paul Gosar (R-Ariz.), Thomas Massie (R-Ky.), and Matt Rosendale (R-Mont.)",
    "Four-hundred and twenty five members voted in favor of the resolution.",
    "“We have no dog in the Ukraine fight,” the former tweeted last month.",
    "This post has been updated.",
    "Three voted against it."
  ]
}