{
  "id": 4037,
  "mediaId": 2590,
  "date": "2022-03-01",
  "headline": "Kevin McCarthy Dodges On Punishing Members Over White Nationalist Conference",
  "image": "https://img.huffingtonpost.com/asset/621e85982100003174502c77.jpeg?cache=SIdPicD6rv&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/kevin-mccarthy-marjorie-taylor-greene_n_621e8549e4b0783a8f078e33",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Bobic",
  "authorUrl": "",
  "termIds": [
    1926,
    2201,
    2298,
    2430,
    3267,
    3434,
    878,
    5371,
    5390
  ],
  "sentences": [
    "Senate Minority Leader Mitch McConnell (Ky.) offered a terse statement to Politico, saying, “There’s no place in the Republican Party for white supremacists or anti-Semitism.”\nSen. Mitt Romney (R-Utah), speaking in an interview on CNN over the weekend, called Gosar and Greene “morons.”\nAsked Tuesday if they should be kicked out of the Republican conference, Romney told HuffPost: “They should be laughed out.”\nThe House voted to strip Greene of her committee assignments in February 2021, citing her past support for conspiracy theories and “liking” Facebook posts about assassinating Democrats.",
    "McCarthy on Monday called the America First Political Action Conference “appalling” and said “there’s no place in our party for any of this,” but on Tuesday he declined to say whether House Republicans would sanction Rep. Marjorie Taylor Greene (R-Ga.) or Rep. Paul Gosar (R-Ariz.) for participating, though he said he would have a talk with them.",
    "Republicans generally opposed both measures against Greene and Gosar, but have pushed McCarthy to punish Cheney and Rep. Adam Kinzinger (R-Ill.) for sitting on a committee investigating the Jan. 6, 2021, attack on the Capitol.",
    "“That organization that Nick Fuentes runs, with antisemitic views, cheering Putin … it’s unacceptable.”\nMcCarthy told HuffPost he had not yet spoken to Greene or Gosar but that “hopefully” he would this week.",
    "WASHINGTON — House Republican leader Kevin McCarthy (R-Calif.) wouldn’t say Tuesday whether party members who participated in a white nationalist event over the weekend would face any repercussions.",
    "Advertisement\nAt the AFPAC event, organizer Nick Fuentes said that “young, white men” are America’s “secret sauce” and asked the crowd to give Russian President Vladimir Putin a round of applause.",
    "McCarthy has to maintain support from even the far-right members of the House GOP if he wants to become speaker of the House in the event that Republicans prevail in November’s midterm elections.",
    "from her internal leadership position last year because she kept telling the truth about former President Donald Trump’s election lies and his incitement of the Capitol riot.",
    "Asked later on Tuesday if he would endorse primary opponents for Greene and Gosar, as he had for Cheney, McCarthy again referred to his previous comment.",
    "The House later censured Gosar for producing a video of a cartoon version of himself killing a cartoon version of Rep. Alexandria Ocasio-Cortez (D-N.Y.).",
    "Advertisement\nAsked Tuesday if the pair could remain in the Republican conference, McCarthy referred to his previous statement.",
    "Advertisement\nOther Republicans have offered more forthright condemnations of Greene’s and Gosar’s participation in the event.",
    "House Republicans have shown the will to punish their own, as they did when they expelled Rep. Liz Cheney (R-Wyo.)",
    "The speaker is chosen by a majority of the House, meaning even a small Republican faction could cause problems.",
    "Kinzinger told HuffPost he appreciated that McCarthy condemned the AFPAC event but said he should do more.",
    "“I’m glad he said something but she [Greene] should be kicked out of the conference,” Kinzinger said.",
    "Greene then took the stage to lament cancel culture and call Democrats communists.",
    "This year, McCarthy endorsed Cheney’s opponent in an upcoming primary election.",
    "“I made my statement yesterday,” he said.",
    "(Gosar appeared via prerecorded video.)",
    "“I answered that yesterday,” he said."
  ]
}