{
  "id": 4040,
  "mediaId": 2699,
  "date": "2022-02-27",
  "headline": "Mitt Romney Knocks ‘Moron’ MTG for Speaking at White Nationalist Event: ‘Certainly Missing a Few IQ Points’",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_720,w_1280,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1645978044/state-union-jake-tapper-and-dana-bash_37_cvgopq",
  "link": "https://www.thedailybeast.com/mitt-romney-knocks-moron-marjorie-taylor-greene-for-speaking-at-white-nationalist-event?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Justin Baragona",
  "authorUrl": "https://www.thedailybeast.com/author/justin-baragona",
  "termIds": [
    0
  ],
  "sentences": [
    "“But I’m reminded of that old line from the Butch Cassidy and the Sundance Kid movie where one character says, ‘Morons, I have morons on my team!’”\nHe then added: “And I have to think anybody who would sit down with white nationalists and speak at their conference was certainly missing a few IQ points.”\nBash then circled back and asked Romney to broadly speak about the “pro-Putin sentiment” that’s run through his party of late, leading him to say that “a lot of those people are changing their stripes as they’re seeing the response of the world and the political response here in the U.S.”\nAt the same time, he said that “it’s unthinkable,” “disgusting” and “almost treasonous” to side with an American adversary who imprisons and kills his political opponents, prompting Bash to wonder if his accusations of treason also included former President Donald Trump.",
    "Sen. Mitt Romney (R-UT) called out members of his own party on Sunday for attending a white supremacist conference this weekend, likening MAGA-boosting GOP Reps. Marjorie Taylor Greene and Paul Gosar to “morons” who are “certainly missing a few IQ points.”\nRepublican leadership has been mostly silent in the wake of Greene’s surprise appearance at Friday’s America First Political Action Conference, which is a white nationalist rival of the Conservative Political Action Conference.",
    "“I also saw that Ronna McDaniel came out with a statement as well talking about how repugnant these white nationalists are.”\nMcDaniel, the Republican National Committee chair who also happens to be Romney’s niece, released a generalized statement on Saturday condemning “white supremacy, neo-Nazism, hate speech and bigotry” that did not explicitly mention Greene, Gosar, or AFPAC.",
    "While conservative leaders have tried to ignore the issue, and Greene herself has ridiculously asserted that she doesn’t know Fuentes or his racist views, Rep. Liz Cheney (R-WY) spoke out this weekend about the “deafening and enabling” silence of GOP leadership.",
    "“I’m reminded of that old line from the Butch Cassidy and the Sundance Kid movie where one character says, ‘Morons, I have morons on my team!’”\n“There’s no place in either political party for this white nationalism or racism,” he continued.",
    "As you’ve indicated, speaking of evil, it’s evil as well.”Romney then addressed Greene and Gosar’s actions directly by referencing a famous line from a classic Robert Redford-Paul Newman western.",
    "During a wide-ranging interview on CNN’s State of the Union on Sunday morning, anchor Dana Bash asked Romney about Cheney’s reaction and whether or not he agreed with her assessment.",
    "“Obviously, Liz Cheney was right with that statement and she has been right for a long time,” the former Republican presidential nominee responded.",
    "Gosar, meanwhile, also spoke at the event for the 2nd straight year as the Arizona congressman has become close allies with Fuentes.",
    "Prior to Greene taking the stage, AFPAC founder Nick Fuentes praised Russian President Vladimir Putin for invading Ukraine.",
    "“All Americans should renounce this garbage and reject the Putin wing of the GOP now,” she tweeted.",
    "Fuentes even went so far after Greene’s speech to sympathetically compare Putin with Adolf Hitler.",
    "(The ex-president has repeatedly lauded the “very savvy” Putin’s “genius” invasion of Ukraine.)",
    "“Marjorie Taylor Greene and Paul Gosar, I don’t know them,” the senator stated.",
    "Anything less than that, in my opinion, is unworthy of American support.”",
    "“Standing up for freedom is the right thing to do in America.",
    "“Well, I said it’s nearly treasonous,” Romney quickly noted.",
    "“It’s simply wrong."
  ]
}