{
  "id": 4057,
  "mediaId": 2644,
  "date": "2022-03-04",
  "headline": "Lindsey Graham doubles down on call for Vladimir Putin’s assassination",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/Sen-Lindsey-Graham-blasted-on-social-media-over-unhinged-suggestion-to-assassinate-putin-01-1-2.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/04/lindsey-graham-doubles-down-on-vladimir-putin-assassination-call/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Callie Patteson",
  "authorUrl": "",
  "termIds": [
    1768,
    1922,
    2416,
    2943,
    3709,
    4014,
    4738,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "Unless you want to live in darkness for the rest of your life, be isolated from the rest of the world in abject poverty, and live in darkness you need to step up to the plate.”\nGraham’s initial post was referring to Colonel Claus von Stauffenberg, who attempted to assassinate Adolf Hitler with a suitcase bomb during a Nazi council of war on July 21, 1944.",
    "Critics slammed Sen. Lindsey Graham on Thursday evening and Friday morning after he called for Russian President Vladimir Putin’s assassination — with even some of his fellow Republican lawmakers describing the message as “unhinged” and Russia’s ambassador to Washington calling it “unacceptable and outrageous.”\n“Is there a Brutus in Russia?",
    "You need to apologize to the world for how Putin has stolen your country blind, how they’re dismembering a neighboring democracy called the Ukraine, how they’re killing innocent men, women and children … You, my friend, are the one who needs to apologize and when it comes to Putin, he should go to jail.”",
    "“But we should not be calling for the assassination of heads of state.”\n“When has Sen. Graham encouraging regime change ever ended badly?” Rep. Matt Gaetz (R-Fla.) tweeted, referring to Graham’s vote while a House member to support the 2002 authorization of the use of military force in Iraq.",
    "Graham doubled down on his statement during an interview with “Fox & Friends” Friday, at one point calling for a “Russian Spring.”\n“If he continues to be their leader, then he’s going to make you complicit with war crimes,” the senator said, addressing the Russian people.",
    "Americans don’t want war.”\nGraham’s fellow Republican Sen. Ted Cruz of Texas called Graham’s suggestion “an exceptionally bad idea.”\n“Use massive economic sanctions; BOYCOTT Russian oil & gas; and provide military aid so the Ukrainians can defend themselves,” he said.",
    "Stauffenberg was part of a coterie of German officers who believed that the death of Hitler would enable them to seize power and negotiate a separate peace with the Western allies, ending the Second World War before Germany could be occupied by the Soviet Union.",
    "“We demand official explanations and a strong condemnation of the criminal statements of this American.”\nIt did not take long for critics on both sides of the aisle to slam the South Carolina Republican, including far-right Rep. Marjorie Taylor Greene (R-Ga.).",
    "Advocating for the assassination of the President of another county isn’t just highly inappropriate, it puts American lives in danger,” wrote GOP Senate candidate Tim Swain, who is primarying incumbent Republican Tim Scott of South Carolina.",
    "“Or is that only for Representatives who tweet cartoons or had a spicy Facebook post before they were an elected official?” added Kent, referring to House disciplinary actions taken against Greene and Rep. Paul Gosar (R-Ariz.).",
    "It is impossible to believe that a senator of a country that promotes its moral values as a ‘guiding star’ for all mankind could afford to call for terrorism as a way to achieve Washington’s goals in the international arena.",
    "He’s tweeting about assassinating heads of state & provoking WW3,” said Trump-endorsed Republican Joe Kent, who is challenging GOP incumbent Jaime Herrera Beutler in Washington state’s 3rd Congressional District.",
    "“So I’m hoping somebody in Russia will understand that he’s destroying Russia, and you need to take this guy out by any means possible.”\nWhen asked to respond to Antonov’s statement, Graham answered: “Mr.",
    "Russian envoy Anatoly Antonov responded to Graham in a statement early Friday, saying: “The degree of Russophobia and hatred in the United States towards Russia is off the scale.",
    "This war is causing some who know better to lose their minds.”\n“Won’t take long before Russia uses this tweet for propaganda…” wrote Stand for America’s Kassy Dillon.",
    "Far-left “Squad” member Rep. Ilhan Omar (D-Minn.) simply said, “Seriously, wtf?”\nCandidates in this year’s midterm elections also took the chance to hit Graham.",
    "“You would be doing your country – and the world – a great service.”\n“The only people who can fix this are the Russian people,” Graham added in a second post.",
    "“While we are all praying for peace & for the people of Ukraine, this is irresponsible, dangerous & unhinged,” she posted.",
    "“You’re a good people, you’ll never have a future, you’ll be isolated from the world, and you’ll live in abject poverty.",
    "“It becomes scary for the US’ fate, which is run by such irresponsible and unprofessional politicians,” Antonov added.",
    "“You are a deranged neocon buffoon and should be censured for this tweet,” said digital strategist Greg Price.",
    "Hitler survived the blast and more than 5,000 people, including Stauffenberg, were executed in retaliation.",
    "The only way this ends is for somebody in Russia to take this guy out,” tweeted Graham (R-SC).",
    "Not blood thirsty warmongering politicians trying to tweet tough by demanding assassinations.",
    "“Are you TRYING to cause escalation?” asked Brookings Institution senior fellow Norm Eisen.",
    "Get the latest updates in the Russia-Ukraine conflict with The Post’s live coverage.",
    "Senators has called for my assassination.’ Why would you want to help him?",
    "You have a record, your country does, of dropping barrel bombs in Syria.",
    "Is there a more successful Colonel Stauffenberg in the Russian military?",
    "Your country’s engaged in war crimes in front of the entire world.",
    "Hundreds of other Twitter users also joined in on the criticism.",
    "“Remove this man from office and call a special election!",
    "You’re bombing innocent civilians using banned munitions.",
    "Ambassador, you’re supporting a war criminal in Putin.",
    "“We need leaders with calm minds & steady wisdom.",
    "You’ve destroyed Chechnya by massive war crimes.",
    "“Now Putin can say ‘one of the most senior U.S.",
    "You’re committing war crimes in the Ukraine.",
    "“Strip Graham of his committees.",
    "“Easy to say, hard to do."
  ]
}