{
  "id": 4094,
  "mediaId": 2621,
  "date": "2022-03-01",
  "headline": "GOP-Controlled AZ Senate Censures Trump-Backed Republican Lawmaker Wendy Rogers",
  "image": "https://www.mediaite.com/wp-content/uploads/2021/07/wendy-rogers.jpg",
  "link": "https://www.mediaite.com/politics/gop-controlled-az-senate-censures-republican-trump-backed-lawmaker-wendy-rogers/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Griffing",
  "authorUrl": "https://www.mediaite.com/author/alex-griffing/",
  "termIds": [
    1926,
    2201,
    3242,
    55,
    305,
    878,
    1029,
    1171,
    4830
  ],
  "sentences": [
    "Rogers has become a national figure and as Arizona Mirror notes she has come to prominence by “calling for a return of McCarthyism, attending a convention promoting the QAnon movement and warning of the “great replacement,” a conspiracy theory popular among white supremacists that claims white Americans are being intentionally replaced with non-white immigrants.”\nHave a tip we should know?",
    "pic.twitter.com/UktojnWwWr\n— Brahm Resnik (@brahmresnik) March 1, 2022\nRogers, who represents the Flagstaff area, spoke on Feb. 25 at Nick Fuentes’ America First Political Action Conference in Florida, which was meant to be far-right counterprogramming to CPAC, which was also held in Florida over the weekend.",
    "If we try some of these high-level criminals, convict them and use a newly built set of gallows, it’ll make an example of these traitors who have betrayed our country.”\nRogers is a prominent supporter of former President Donald Trump’s allegations that the 2020 presidential election was stolen.",
    "Rogers, a retired air force pilot, broke the record for highest fundraising total in Arizona legislative history that she herself set in 2020 – when she was first elected to the state senate.",
    "Republican State Sen. Wendy Rogers was censured on Tuesday in the Arizona Senate by Democrats and her Republican colleagues for addressing a white nationalist conference over the weekend.",
    "“So today is the day where we find out if the Communists in the GOP throw the sweet grandma under the bus for being white,” she wrote on her Telegram channel.",
    "Fuentes, who the Anti-Defamation League has labeled a “prominent white supremacist pundit,” has a history of anti-Semitism and Holocaust denial.",
    "The Arizona Republican also shared an anti-Semitic image on her Gab account prior to her appearance, it was reported today.",
    "GOP Reps. Paul Gosar and Marjorie Taylor Greene also spoke at his controversial conference over the weekend.",
    "In January, Rogers announced that she raised nearly $2.5 million in 2021 – a record.",
    "The Arizona Senate has thirty members, currently 16 Republicans and 14 Democrats.",
    "NOW Sen. Wendy Rogers first to speak in roll call vote: “I do not apologize.",
    "Rogers told the white nationalist group that “we need to build more gallows.",
    "The censure resolution passed 24-3, with 3 state senators not voting.",
    "Rogers remained defiant on Tuesday morning ahead of the vote.",
    "Rogers herself was one of the three dissenting votes.",
    "I will not back down.” Votes no on censure.",
    "tips@mediaite.com"
  ]
}