{
  "id": 4111,
  "mediaId": 2625,
  "date": "2022-03-01",
  "headline": "How Marjorie Taylor Greene and Nick Fuentes Are Easing White Power into the GOP Mainstream",
  "image": "https://www.motherjones.com/wp-content/uploads/2022/02/AP21317664580623.jpg?w=1200&h=630&crop=1",
  "link": "https://www.motherjones.com/politics/2022/03/marjorie-taylor-greene-nick-fuentes-white-power-gop-mainstream/",
  "mediaOutlet": "Mother Jones",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ali Breland",
  "authorUrl": "https://www.motherjones.com/author/ali-breland/",
  "termIds": [
    1726,
    1926,
    2386,
    3242,
    3468,
    878,
    909,
    5371
  ],
  "sentences": [
    "“They want to replace you!” James yelled to the crowd, adding that “Western white culture is the majority culture.”\nIn his own addresss, Fuentes, the event’s organizer, made it clear that James and his views weren’t an aberration by praising Jared Taylor, head of the white supremacist organization American Renaissance, calling him his “personal hero.” He also compared Russian President Vladimir Putin to Hitler—and said that that was a “good thing.”\nFuentes just called Jared Taylor, head of the “race-realist, white advocacy organization” American Renaissance, his “personal hero” and said he wants to honor his legacy.",
    "The reason we have more people in prison and more gun crime than any other developed nation isn’t because of white supremacy, it’s because those other developed nations that don’t have the people who commit most of the crime here.”\nThe places he cites reveals, if there was any doubt, that James is not so subtly being racist.",
    "He didn’t stop there, going on to extol “white western culture” while championing a thinly disguised version of the great replacement conspiracy, which posits that people in power, often at the behest of Jewish people, are working to eradicate whiteness in favor of minority cultures.",
    "Amid Russia’s invasion of Ukraine, and with the event happening late on Friday night, Fuentes’s gathering flew somewhat under the radar, despite the potential and dark direction it augurs for right politics in the U.S.—one even more rife with racist thought and rhetoric.",
    "“Just because minorities are arrested and imprisoned at higher rates than white people doesn’t mean the criminal justice system is racist,” a grinning Vincent James, a white supremacist influencer who spoke just after Greene, told the crowd to applause.",
    "https://t.co/fQsZH7Vemx\n— Michael Edison Hayden (@MichaelEHayden) February 26, 2022\nWhile I’ve seen Fuentes call black people the n-word and admit to being racist, he has tried (albeit often half-heartedly) to hide his most bigoted tendencies in public.",
    "Late on Friday night, I watched a group of roughly 1,000 people, mostly young white American men, openly cheer for Black people to be jailed and for “radical solutions” to be deployed in the face of the great replacement white power conspiracy theory.",
    "“And throw away the key!”\nJames knew exactly what he was saying and so did the AFPAC crowd: Black people do more crime and should be arrested in even higher numbers than they already are.",
    "It wasn’t the first such gathering—AFPAC has a history of, like it did here, throwing its own events in conjunction with the longstanding Conservative Political Action Conference.",
    "— hannah gais (@hannahgais) February 26, 2022\nSo far, the biggest fallout from the event have been some sharp questions directed at Greene and other politicians who participated.",
    "“How do these feeble-minded people explain the fact that Baltimore, Detroit, and St. Louis are far more dangerous than Rio de Janeiro; Durban, South Africa; or Mazatlán, Mexico.",
    "But in my experience, the event featured unprecedentedly brazen and openly racist rhetoric given the size of the platform and its proximity to actual GOP officials.",
    "But Baltimore and Detroit are among the Blackest large cities in the U.S., with a long history of being name-dropped by conservatives in racist ways.",
    "Nine current and former elected officials spoke to his American First Political Action Conference over the weekend, including Lt. Gov.",
    "Janice McGeachin (R-Idaho) and serving members of Congress Marjorie Taylor Greene (R-Ga.) and Paul Gosar (R-Ariz.), among others.",
    "“If poverty is the main reason for violent crime, why isn’t there rampant looting of drug stores in Owsley County, Kentucky.",
    "If Friday is any indication, it seems he no longer cares—and many powerful figures on the right don’t seem to either.",
    "She knows who Fuentes is and she almost certainly knows the older white nationalists who were invited to AFPAC too.",
    "It’s harder for such a group to have a direct line to the powers that be who can help them enact their vision.",
    "But as the Southern Poverty Law Center’s Michael Edison Hayden pointed out, that’s very unlikely.",
    "For her part, the Georgia lawmaker says she had no idea about Fuentes’ ideology before speaking.",
    "America is large enough to where you can easily gather a crowd who will believe almost anything.",
    "“That minority population may just so happen to commit the majority of crime,” he continued.",
    "“We have an under incarceration problem,” he said to applause, and a “lock them up” chant.",
    "No one should believe Greene's bizarre comment that she did not know Nick Fuentes' views.",
    "Nor did it host the most extreme sentiments I’ve seen in my reporting on the far-right.",
    "This gathering, put together by white supremacist Nick Fuentes, did.",
    "Facts matter: Sign up for the free Mother Jones Daily newsletter.",
    "or drive-by shootings in Hancock, Tennessee,” James asked.",
    "“Lock them up, yes,” he responded with a smile.",
    "Owsley County is 98.7 percent white.",
    "Hancock County is 96 percent white.",
    "She started as a Qanon performer.",
    "Support our nonprofit reporting.",
    "Subscribe to our print magazine.",
    "She collaborates with Infowars."
  ]
}