{
  "id": 4113,
  "mediaId": 2572,
  "date": "2022-03-03",
  "headline": "Mixed messages from Congress at State of the Union address on Ukraine, COVID-19",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Sotu-13.jpg",
  "link": "https://www.foxnews.com/politics/mixed-messages-congress-state-union",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1726,
    1951,
    2371,
    2430,
    2599,
    3027,
    4045,
    1124
  ],
  "sentences": [
    "Fox News asked House Minority Leader Kevin McCarthy, R-Calif., if there was danger for the GOP to hypercriticize President Biden during an international crisis or if they could strike a balance.",
    "Senate Majority Leader Chuck Schumer, D-N.Y., sidestepped a question from yours truly when asked if Manchin’s energy ideas were problematic for the core of the Democratic Party.",
    "(Evelyn Hockstein/Pool via AP)\nWHITE HOUSE ASKS CONGRESS FOR $10B IN UKRAINE AID AS PUTIN'S BRUTAL WAR RATCHETS UP\nBut everyone was back to handshakes and up-close chats.",
    "Reps. Dwight Evans, D-Penn., Pete Aguilar, D-Calif., Jamie Raskin, D-Md., Suzan DelBene, D-Wash., Ted Deutch, D-Fla. and Sen. Alex Padilla, D-Calif., all tested positive.",
    "In a memo, House Sergeant at Arms William Walker declared that lawmakers who refused to don a mask or adhere to other protocols risked getting kicked out of the speech.",
    "NANCY PELOSI FAVOR BANNING ALL RUSSIAN OIL IMPORTS INTO THE UNITED STATES\nPresident Biden devoted 12 minutes of his 72-minute oratory to the war in Ukraine.",
    "They’re trying desperately to ease the nation into some degree of normalcy and demonstrate a path out of the pandemic – especially ahead of the midterms.",
    "One could only imagine how some GOP lawmakers would have relished the opportunity to make a scene getting bounced from the speech over COVID practices.",
    "The House Ethics Committee has already fined Rep. Marjorie Taylor Greene, R-Ga., more than $100,000 for failing to wear a mask in the House chamber.",
    "Sen. Ed Markey, D-Mass., \"because we all need to remember that the immunocompromised and those over 60 remain at higher risk of severe illness.\"",
    "But the Capitol Attending Physician along with many other jurisdictions, began to dial back masking mandates on March 1, the day of the speech.",
    "Republicans and Democrats may disagree vehemently on a great many subjects – ranging from the riot at the Capitol to executive branch nominees.",
    "Republicans would embrace casting blame on House Speaker Nancy Pelosi, D-Calif., who they criticize regularly for \"locking down the Capitol.\"",
    "President Biden lingered in the chamber for 17 minutes after his remarks concluded, signing copies of the speech and talking with lawmakers.",
    "Republicans are appropriating the Ukraine crisis to push the Biden Administration to approve pipeline construction and leases for drilling.",
    "The Ethics Committee just announced this week that the Sergeant at Arms Office fined Greene for three violations alone on January 20.",
    "Rep. Alexandria Ocasio-Cortez, D-N.Y., said she was disappointed President Biden didn’t address climate change in the speech.",
    "At the outset of the Cold War, late Sen. Arthur Vandenberg, R-Mich., said that foreign policy \"stopped at the water’s edge.\"",
    "Senate Minority Leader Mitch McConnell, R-Ky., said there was \"broad support\" for President Biden’s approach to Ukraine.",
    "Granted, there may have been so many positive tests because members sought out tests to gain admittance to the speech.",
    "HOUSE PASSES RESOLUTION IN SUPPORT OF UKRAINE AMID ‘FULL-SCALE’ RUSSIAN INVASION\n\"The U.S. is a major oil producer.",
    "Even Hamilton Beach couldn’t make enough mixers to keep up with the mixed messaging on Capitol Hill this week.",
    "Congress initially seemed divided about COVID protocols before President Biden’s State of the Union speech.",
    "All House and Senate members were invited this year – compared to the 200 last year due to the pandemic.",
    "They can typically pack in 1,600 for a completely bulging State of the Union in a non-pandemic period.",
    "But something else happened on State of the Union day which never unfolded before during the pandemic.",
    "Members festooned their suits and blouses with blue and yellow Ukrainian flag lapels for the speech.",
    "Then there is the internal squabbling on both sides of the aisle which also sends mixed messages.",
    "Congress has proven itself to be a reliable barometer as to where the country stands with COVID.",
    "Then the numbers dipped precipitously in Congress – matching the decline around the country.",
    "In today’s toxic political environment, the water’s edge qualifies as an EPA Superfund site.",
    "Reps. Thomas Massie, R-Ky., Matt Rosendale, R-Mont., and Paul Gosar, R-Ariz., all voted nay.",
    "Chad Pergram currently serves as a congressional correspondent for FOX News Channel (FNC).",
    "No more than two members ever tested positive on any one day during the entire pandemic.",
    "RUSSIA-UKRAINE: LIVE UPDATES\nWe now live in the age of performative politics and TikTok.",
    "Democrats find themselves at odds over addressing energy needs amid the war in Ukraine.",
    "The numbers shot up on Capitol Hill in January, mimicking national coronavirus stats.",
    "Manchin’s ideas run crossways with progressives and those pushing the Green New Deal.",
    "Or, the blood of many millions of Ukrainians will be on his hands, too,\" said Spartz.",
    "Either way, the outbreak of cases, pitted against an unmasked speech, doesn’t mesh.",
    "Lawmakers began contracting COVID just before Christmas as the omicron wave spread.",
    "A spike in cases among members usually mirrors a spike in cases around the country.",
    "Rep. Victoria Spartz, R-Ind., was born in Ukraine under the Soviet regime in 1978.",
    "Sen. Joe Manchin, D-W.V., is pushing for an increase in domestic oil production.",
    "But she says we never experienced something like (this war) ever,\" said Spartz.",
    "Reps. Al Green, D-Tex., and Jim Langevin, D-R.I., were also spotted with masks.",
    "The House this week approved a resolution to stand by the people of Ukraine.",
    "He joined the network in September 2007 and is based out of Washington, D.C.",
    "Initial guidelines dictated members had to sit spaced apart in the chamber.",
    "All members had to have a negative COVID test and wear a mask to take part.",
    "Even some members would sit in the gallery above rather than on the floor.",
    "Such dramatics would go viral and resonate in some conservative districts.",
    "Congressional officials only permitted about 600 persons in the chamber.",
    "He said it was important to wear a mask \"for those who are vulnerable.\"",
    "You’re going to hear a lot more from us on those issues in the future.\"",
    "She was near tears when speaking about the atrocities in her homeland.",
    "A fully-masked State of the Union speech would not present that optic.",
    "But after some initial grousing, Congress came together over Ukraine.",
    "So, the State of the Union speech seemed and looked kind of normal.",
    "We only get one percent of imports from Russia,\" said Schumer.",
    "\"The real problem with gas prices is gouging and monopolies.",
    "The price for a barrel of oil skyrocketed to $111 Wednesday.",
    "Unartfully, Democrats got the political optic they needed.",
    "The congresswoman characterized the war as a \"genocide.\"",
    "Spartz then lobbed serious criticism at President Biden.",
    "But six positives – just for members – is significant.",
    "And so, no masks were required for State of the Union.",
    "Democrats hold the majority in the House and Senate.",
    "\"We can get together as Republicans and Democrats.",
    "A record six lawmakers tested positive for COVID.",
    "But there was dissonance on the GOP side, too.",
    "In other words, Congress stands with Ukraine.",
    "Democrats are focused on those two issues.",
    "But (President Biden) must act decisively.",
    "\"Are we going to sit down and be quiet?",
    "\"We’re not going to sit quietly by.\"",
    "Especially for State of the Union.",
    "A good example came in December.",
    "A few wore masks on their own.",
    "President Biden is a Democrat.",
    "No handshakes or backslapping.",
    "We are focused very strongly.",
    "\"But what took him so long?\"",
    "Democrats faced a conundrum.",
    "It wasn’t completely full.",
    "She experienced Stalin.",
    "She experienced Hitler.",
    "Another mixed message.",
    "No,\" replied McCarthy.",
    "But there’s a schism.",
    "The vote was 426-3.",
    "\"My grandma is 95.",
    "Mostly.",
    "Fast.",
    "Sure."
  ]
}