{
  "id": 4121,
  "mediaId": 2528,
  "date": "2022-03-03",
  "headline": "Less Trump, more winning: Why the results of one Republican primary in Texas could give hope to new conservative candidates who don't endlessly venerate the former president",
  "image": "https://i.insider.com/621fcc2796929400196c5306?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/trump-election-congress-morgan-luttrell-texas-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camila DeChalus",
  "authorUrl": "https://www.businessinsider.com/author/camila-dechalus",
  "termIds": [
    2201,
    3151,
    4322,
    4786,
    878,
    5025,
    5351
  ],
  "sentences": [
    "Christian Collins, a former campaign aide for Republican Sen. Ted Cruz of Texas, was endorsed by a cast of politicos with close Trump ties: Cruz, House Freedom Caucus members Reps. Madison Cawthorn of North Carolina and Marjorie Taylor Greene of Georgia, and prominent 2020 presidential election denier and pillow peddler Mike Lindell.",
    "The outcome of this congressional race shows that even though Trump continues to dominate the Republican Party as he plots a potential 2024 presidential comeback, there are still ruby-red congressional districts that, when given a variety of choices in a Republican primary, will bypass a hardcore Trumper for someone else.",
    "Jonathan Hullihan said he was \"blessed and honored\" to have received the endorsement of Rep. Paul Gosar of Arizona, a top Trump supporter who the US House in November censured for tweeting an edited anime video depicting him killing Rep. Alexandria Ocasio-Cortez of New York with a sword.",
    "Luttrell, who served in the US Navy as a Navy SEAL, also served in the Trump administration as a senior advisor for the Department of Energy, where he was the director of \" translational research and applied analytics,\" according to his Linkedln profile.",
    "Last month, Collins channeled Trump in calling for a \"nationwide audit of the 2020 election\" at the \"America First Rally,\" an event in support of Collins' campaign featuring GOP firebrands like Greene, Cawthorne, and Arizona State Sen. Wendy Rogers.",
    "Republican candidates are embracing the use of hyperbolic language to replicate Trump's campaign-style in order to court more voters, a longtime GOP strategist, who did not want to provide their full name for fear of retribution, told Insider.",
    "\"Morgan Luttrell has been able to garner a lot of support from all wings of the party, and I think that that's what the district wants for that seat,\" Nathan McDaniel, a Republican political strategist based in Austin, Texas, told Insider.",
    "Morgan Luttrell, the Republican candidate for Texas' 8th Congressional District, throws out the ceremonial first pitch before a baseball game between the New York Yankees and Texas Rangers Monday July 27, 2015, in Arlington, Texas.",
    "In Texas' District 8, 11 Republicans competed to replace Brady, a powerful policy wonk who for several years has been the top Republican on the House Ways and Means Committee, which oversees taxation and tariffs.",
    "McDaniel pointed to other races where Republican incumbents have lost to more moderate Republican challengers such as the Texas congressional race for district one to replace the open seat for Rep. Louie Gohmert.",
    "Luttrell winning the Republican nomination indicates that voters in this particular district still want a moderate Republican — relatively speaking — representing them, one longtime Texas GOP strategist said.",
    "Luttrell has also touted issues close to his district, such as securing the southern border of the United States and thwarting people from crossing into the United States from Mexico unlawfully.",
    "Other GOP strategists argued that the main values and ideals of Republicans have stayed the same for years but the way these candidates are communicating their stances on issues has changed.",
    "Moran was seen as more moderate compared to his opponents like Aditya Atholi, a former staffer of Gohmert, who has sworn to stop \"fake news\" and go on the offense against Big government.",
    "He also called for National Institute of Allergy and Infectious Diseases Director Anthony Fauci to be jailed for his work during the COVID-19 pandemic, echoing Greene's stance.",
    "Luttrell, a Navy SEAL veteran and brother of fellow veteran Marcus Luttrell, received endorsements from former Texas governor and US energy secretary Rick Perry, Texas Lt. Gov.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "He solicited (and then returned, under pressure) a contribution from a political committee run by fellow military veteran and anti-Trump Rep. Adam Kinzinger of Illinois.",
    "And while Luttrell readily embraces many Trump administration policies and legislative sensibilities, he's not one to venerate Trump as many other Republicans do.",
    "CONROE, Texas — In Texas's 8th Congressional District north of Houston, Morgan Luttrell secured the Republican nomination to replace Rep. Kevin Brady on Tuesday.",
    "Smith County Judge Nathaniel Moran, a more moderate Republican than his predecessor, secured the nomination on Tuesday, handily defeating the competition.",
    "Jeff Reinhardt, a Texas voter, told Insider, that he voted for Luttrell because he figured he \"must be more independent-minded and thinks for himself.\"",
    "Madison Hall/Insider\nBrady's open seat race shows a trend with the district\nSince 1997, Brady has served as the representative for Texas' 8th District.",
    "Crenshaw has even gone as far to criticize Greene, one of Trump's most high-profile and loyal backers, for comments she has made on COVID-19 testing.",
    "Other voters told Insider they thought Collins was only using Republican talking points rather than actually believing in Republican values.",
    "For instance, he has pledged to bolster border security, put \"America first,\" trash\"critical race theory,\" and strengthen cybersecurity.",
    "\"Some of the people who endorsed him swung me over to his camp along with his military service,\" said Raymond Hill, a voter in Conroe.",
    "\"Candidates up and down the ballot want to continue to rally around those things that have defined the Republican Party for ages.",
    "\"Maybe if Hunter Biden got a job here in Texas his daddy would do something to fix our immigration crisis,\" Luttrell tweeted.",
    "Strategists say this race sends a message that some districts still want a more moderate, less Trumpy Republican in office.",
    "Campaign signs decorate the exterior of April Sound Church in Conroe, Texas in advance of the Republican primary election.",
    "Brady has supported Trump in the past but has shied away from getting involved in the political drama within his party.",
    "Voters there easily could have selected a candidate with demonstrated fealty to Trump, either directly or indirectly.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Ed Schroer, a voter in Conroe, called Collins a \"RINO,\" or a \"Republican in name only,\" who solely desires power.",
    "Moran is a county judge who has campaigned on defending the southern border and protecting the second amendment.",
    "Tony Gutierrez/AP\nMorgan Luttrell won the Republican nomination to represent Texas' 8th Congressional District.",
    "Some voters thought Luttrell stood out from his competition because of his career trajectory and experience.",
    "Luttrell often appeals to voters by sounding Trump-like on issues without focusing on Trump, the man.",
    "Republicans who aren't unabashed Donald Trump acolytes but still love their party should take notice.",
    "Luttrell will face Democratic challenger Laura Jones in the November 8 midterm election.",
    "But now, there is a difference in style about how we talk about these things,\" he said.",
    "Luttrell did not respond to Insider's multiple requests to comment for this story.",
    "While Perry and Patrick are close to Trump, the Crenshaw endorsement is telling.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "The Houston-area congressman has notably begun to distance himself from Trump.",
    "Luttrell didn't receive an endorsement from Trump, who stayed out of the race.",
    "On this issue, Luttrell has focused on the current, not the former president.",
    "\"All he wants to do is be a Republican name, that's it,\" Schroer said.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "In 2020, Brady beat his Democratic challenger by 47 percentage points.",
    "Luttrell didn't embrace Donald Trump as much as his top competitors.",
    "His campaign material makes scant mention of the former president.",
    "Greene is \"either a Democrat — or just an idiot,\" Crenshaw said.",
    "Dan Patrick, and Rep. Dan Crenshaw of Texas.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "He placed second.",
    "He placed third."
  ]
}