{
  "id": 4138,
  "mediaId": 2547,
  "date": "2022-02-27",
  "headline": "Mitt Romney: 'I Have Morons On My Team!'",
  "image": "https://crooksandliars.com/files/primary_image/22/02/cnn-bash-romney-022722.png",
  "link": "https://crooksandliars.com/2022/02/romney-greene-gosar-morons",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather",
  "authorUrl": "https://crooksandliars.com/team/heather",
  "termIds": [
    1726,
    1926,
    2298,
    3709,
    4401,
    4527,
    878,
    5371,
    5374
  ],
  "sentences": [
    "CNN host Dana Bash asked Romney about a tweet by Liz Cheney, where she slammed Republican leadership for their silence on the matter:\nAs Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\nRomney responded by stating the obvious about whether Republicans ought to be following the lead of these two idiots:\nROMNEY: Look, there's no place in either political party for this white nationalism or racism.",
    "Romney also slammed the pro-Putin sentiment we've been seeing from his party:\nROMNEY: Well, a lot of those people are changing their stripes as they're seeing the response of the world and the political response here in the U.S.",
    "And Marjorie Taylor Greene and Paul Gosar, I don't know them, but I'm reminded of that old line from the \"Butch Cassidy and the Sundance Kid\" movie, where one character says: \"Morons.",
    "Utah Republican Sen. Mitt Romney didn't mince words when asked about Representative Marjorie Taylor Greene and Paul Gosar speaking at a white nationalist convention this weekend.",
    "But, of course, they do it because they think it's shock value, and it's going to get them more eyeballs, and maybe make a little more money for them or their network.",
    "But how anybody, how anybody in this country, which loves freedom, can side with Vladimir Putin, which is an oppressor, a dictator -- he kills people.",
    "And I have to think anybody that would sit down with white nationalists and speak at their conference was certainly missing a few I.Q.",
    "Romney showed a little more backbone than his Arkansas counterpart in the Senate, Tom Cotton, but that's a pretty low bar to hurdle.",
    "And I'm hopeful that you're seeing some of those people recognize just how wrong they were.",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now.",
    "But, not surprisingly, he did some tap dancing when it came to criticizing Trump.",
    "And anything less than that, in my opinion, is unworthy of American support.",
    "It's -- it's -- as you have indicated, speaking of evil, it's evil as well.",
    "There's -- standing up for freedom is the right thing to do in America.",
    "BASH: Treasonous is a big word, so I just have to quickly follow up.",
    "And it just makes me ill to see some of these people do that.",
    "He has been an adversary of America at every chance he's had.",
    "ROMNEY: Well, I said it's nearly treasonous.",
    "Would that include the former president?",
    "He imprisons his political opponents.",
    "I have got morons on my team.\"",
    "It's unthinkable to me.",
    "It's almost treasonous.",
    "It's simply wrong.",
    "It's disgusting.",
    "points.",
    "Topics:"
  ]
}