{
  "id": 4163,
  "mediaId": 2627,
  "date": "2022-02-28",
  "headline": "Following radical event, GOP leaders have a decision to make",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220228-Marjorie-Taylor-Greene-al-0718-cfbdbd.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/radical-event-gop-leaders-decision-make-rcna17904",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    0
  ],
  "sentences": [
    "Indeed, at this year’s AFPAC gathering, Fuentes apparently thought it’d be amusing to complain about journalists equating Vladimir Putin and Adolf Hitler, adding, “They say that’s not a good thing.”\nCommon decency — and common sense — suggests Republican elected officials would want nothing to do with AFPAC and its organizers.",
    "Yesterday, Republican Sen. Mitt Romney of Utah not only condemned white nationalism as “evil,” he described Gosar and Greene as “morons.”\nThat said, Cheney and Romney are not party leaders — at least not anymore — and their rebukes are not a substitute for direct action from McCarthy and other House GOP leaders.",
    "The radical congresswoman told attendees they were “canceled Americans” who had a responsibility to “stop the Democrats who are the communist party of the United States of America.”\nThe question is not why Republicans like Gosar and Greene would choose to appear at a white nationalist event.",
    "The Atlanta Journal-Constitution reported:\nRepublican U.S. Rep. Marjorie Taylor Greene headlined a white nationalist conference in Florida where attendees cheered Russia’s invasion of Ukraine and chanted the name of President Vladimir Putin shortly before she was introduced.",
    "Maybe, sometime today, House Minority Leader Kevin McCarthy and his leadership team will not only condemn their members who spoke at the event, but they’ll also take meaningful action to make clear that today’s GOP will not tolerate associations with white nationalists.",
    "For her part, Greene took several steps over the weekend to defend her AFPAC appearance, though she referred to the extremist attendees as “patriots“ and members of the “conservative movement.”\nRemember, there is an existing blueprint for situations like these.",
    "For those keeping an eye on domestic politics, much of the focus over the weekend was on the Conservative Political Action Conference (CPAC) in Orlando, where many of the Republican Party’s most prominent voices tried to curry favor with the party’s base.",
    "He is, after all, a radical who’s called for “a homeland” for white people, who’s engaged in Holocaust denialism, who rallied rioters outside the U.S. Capitol on Jan. 6, and whose YouTube page was permanently suspended for promoting hate speech.",
    "After all, if the RNC can condemn Reps. Liz Cheney and Adam Kinzinger for daring to seek the truth about the Jan. 6 attack, the party can be equally emphatic in rebuking Republicans who associate with racist extremists.",
    "Perhaps today will be the day in which House Republicans say they’ve had enough; they no longer recognize Gosar and Greene as members of their conference; and the party will not support their re-election campaigns.",
    "And yet, Republican Rep. Paul Gosar of Arizona delivered the keynote address at last year’s AFPAC gathering, and this year, the Arizonan wasn’t the only GOP member of Congress who spoke at the extremists' event.",
    "The [Georgia] lawmaker was the surprise guest at the America First Political Action Conference in Orlando, a group organized by Nick Fuentes, who has been labeled a “white supremacist” by federal prosecutors.",
    "What’s more, a few years ago, McCarthy expressed disgust with then-Rep. Steve King, stripped him of his committee assignments, rendered him irrelevant, and watched the Iowan’s career evaporate soon after.",
    "As regular readers may recall, in 2018, the Trump White House fired a speechwriter after officials learned he spoke at a conference attended by well-known white nationalists.",
    "The gathering was called the America First Political Action Conference (AFPAC), which was organized by a white nationalist named Nick Fuentes.",
    "Soon after, a Department of Homeland Security policy analyst resigned after his connections to white nationalist activists was exposed.",
    "A year later, Gosar returned to the extremist gathering, and was joined by another one of his most radical congressional colleagues.",
    "“All Americans should renounce this garbage and reject the Putin wing of the GOP now,” the Wyoming congresswoman said via Twitter.",
    "After Gosar spoke at AFPAC last year, GOP leaders largely ignored the controversy, and the Arizonan faced no official sanctions.",
    "For much of the American mainstream, Fuentes’ name is probably unfamiliar, and as we’ve discussed, that’s a good thing.",
    "But just down the road, there was a separate event, catering to an even more radical audience.",
    "It is possible, of course, that Republican leaders will respond forcefully and responsibly.",
    "To be sure, it would be an overstatement to say the party has been completely silent.",
    "Cheney, for example, admonished her party for failing to condemn Greene and Gosar.",
    "Recommended\nBut if recent history is any guide, such a response appears unlikely.",
    "GOP officials could treat Gosar and Green the exact same way now.",
    "(King, incidentally, also spoke at a previous AFPAC gathering.)",
    "The question is what their party intends to do about it.",
    "It’s unclear if the party wants to."
  ]
}