{
  "id": 4165,
  "mediaId": 6598,
  "date": "2022-02-27",
  "headline": "'I've got morons on my team': Sen. Mitt Romney hits Reps. Paul Gosar, Marjorie Taylor Greene",
  "image": "https://www.gannett-cdn.com/presto/2021/11/17/PPHX/f13ea2fd-1eb9-4752-b99c-0fed49989764-AP21320844393065.jpg?crop=4457,2507,x0,y45&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/02/27/sen-mitt-romney-likens-reps-gosar-greene-morons-cnn/6964219001/",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald J. Hansen",
  "authorUrl": "https://www.azcentral.com/staff/2647673001/ronald-j-hansen/",
  "termIds": [
    0
  ],
  "sentences": [
    "Supreme Court won't let Arizona voters weigh in on tax cut Brnovich takes election manual fight with Hobbs to court Karrin Taylor Robson drops fundraising tactic after questions AZ House Speaker Rusty Bowers wins award for courage\nRep. Adam Kinzinger, R-Ill., added his voice to the pushback from the right against AFPAC and those who have not unconditionally condemned Putin.",
    "Appearing on CNN's \"State of the Union,\" Romney, R-Utah, unleashed on the pair for participating Friday in the America First Political Action Committee organized by Nick Fuentes, an anti-immigration activist who has been dubbed a white supremacist by federal prosecutors.",
    "Gosar and Greene last year briefly sparked a firestorm over reports they intended to launch an America First Caucus with a focus on keeping the nation loyal to an Anglo-Saxon past and ending immigration as we know it.",
    "Romney, who is finding newfound appreciation for his 2012 judgment that Russian President Vladimir Putin was the top geopolitical foe of the United States, was asked about \"good and evil\" that is \"closer to home.\"",
    "Sen. Mitt Romney on Sunday likened Reps. Paul Gosar and Marjorie Taylor Greene to \"morons\" and said they were \"missing a few IQ points\" after their participation in a political event led by a white nationalist.",
    "I’m also not going to turn down the opportunity to speak to 1,200 young America First patriots because of a few off-color remarks by another speaker, even if I find those remarks unsavory,\" she wrote.",
    "In a social media post Thursday, Gosar blamed President Joe Biden for the Russian invasion of Ukraine and took the same position on prospective Ukrainian membership in NATO as Putin.",
    "Romney defended a tweet by Rep. Liz Cheney, R-Wyo., in which she said the silence by Republican leaders after Gosar and Greene's words \"was deafening and enabling.",
    "In a written statement to The Republic, Gosar dismissed Romney's assessment as reflective of an irrelevant and shrinking political constituency.",
    "\"I have to think that anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points.\"",
    "Newsweek described it this way:\n\"Now they're going on about Russia and Vladimir Putin is Hitler — they say that's not a good thing.\"",
    "Greene defended her appearance at AFPAC in a series of tweets, saying her remarks there were primarily about her Christian faith.",
    "Having not even been in Orlando I don’t know what (Greene) said to trigger this fragile tulip but it must have been good.\"",
    "But I'm reminded of that old line from the 'Butch Cassidy and the Sundance Kid' movie where one character says, 'Morons.",
    "\"The Romney wing of globalists, interventionists and America Last is breathing its last fetid breath,\" he said.",
    "His appeal to censoring MTG or insulting her, or me, is typical for his level of pseudo-intellect.",
    "He attended the annual event last year, making him the first sitting member of Congress to do so.",
    "(Fuentes) and the audience then laughed loudly before he added, \"I shouldn't have said that!\"",
    "If this was not bizarro world, you would be the one censured and excommunicated from the GOP.",
    "\"Liz Cheney was right with that statement and she's been right for a long time,\" Romney said.",
    "Reach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493.",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now.\"",
    "\"There's no place in either political party for this white nationalism or racism.",
    "\"The war in Ukraine was caused by the incompetence of the Biden Administration.",
    "In a tweet to Greene, he wrote:\n\"You spoke to a white supremacy group.",
    "Fuentes reportedly downplayed the worldwide anger at Putin at AFPAC.",
    "Biden failed to recognize this geopolitical reality,\" he wrote.",
    "\"Marjorie Taylor Greene and Paul Gosar, I don't know them.",
    "NATO has no business inviting Ukraine into membership.",
    "Subscribe to our free political podcast, The Gaggle.",
    "You will lose ultimately, just like Putin.",
    "You are defending your presence there.",
    "Follow him on Twitter @ronaldjhansen.",
    "And people will curse your name.\"",
    "Subscribe to azcentral.com today.",
    "\"I talked about God and Liberty.",
    "I've got morons on my team.'",
    "Gosar participated by video.",
    "This is Russia's backyard.",
    "Support local journalism.",
    "It's evil as well.",
    "It's simply wrong.",
    "\"Good riddance.",
    "..."
  ]
}