{
  "id": 4170,
  "mediaId": 2663,
  "date": "2022-02-28",
  "headline": "Marjorie Taylor Greene likens herself to Jesus to explain speech at white nationalist event",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/02/marjorie_taylor_greene_afpac_twitter.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/marjorie-taylor-greene-likens-jesus-explain-speech-white-nationalist-event-20220228",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Hudson",
  "authorUrl": "https://www.queerty.com/author/david-hudson",
  "termIds": [
    0
  ],
  "sentences": [
    "“I want to embrace the young, boisterous and energetic conservatives in our movement—not cancel them like the establishment does.”\nRelated: Marjorie Taylor Greene is put in her place by phone-in caller\nShe went on to posts clips of her speech, in which she spoke out against people being “canceled” and abortion.",
    "Rep. Paul Gosar (R-AZ) also sent a 30-second video message, but it was Greene who showed up in person, telling the audience she was there to tell them, “about who I am, what I see as the future of our country, and the future for all of you.”\nAs criticism of her appearance grew, Greene attempted to backpedal.",
    "Greene continued to say she’d attended because she knew the event attracted a large, young audience, with whom she wished to engage: “It’s a generation I’m extremely concerned about it.”\nOn a Twitter thread, Greene said she refused to be denounced for speaking at the event.",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now.”\nAs Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "“I won’t cancel others in the conservative movement, even if I find some of their statements tasteless, misguided or even repulsive at times.”\nOther members of the Republican party have denounced Greene’s participation in the event.",
    "Fuentes has questioned interracial marriages and whether the Holocaust took place, praised Jim Crow-era segregation laws, and said that he would prefer it if women were not allowed to vote, among many other things.",
    "Or does he just do that to people like @Liz_Cheney”\nMike Pompeo called Greene “shameful.”\nAssociating with anti-Semitic neo-Nazis is not consistent with the conservative values I’ve defended for decades.",
    "Cheney said: “As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "I’m also not going to turn down the opportunity to speak to 1,200 young America First patriots because of a few off-color remarks by another speaker, even if I find those remarks unsavory.",
    "“The Pharisees in the Republican Party may attack me for being willing to break barriers and speak to a lost generation of young people who are desperate for love and leadership.",
    "“I am not going to play the guilt by association game in which you demand every conservative should justify anything ever said by anyone they’ve ever shared a room with.",
    "Georgia Rep. Marjorie Taylor Greene has faced a storm of criticism after giving a speech at the America First Political Action Conference (AFPAC) in Orlando on Friday.",
    "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\nRep. Adam Kinzinger (R-IL) tweeted, “Marjorie Taylor Greene spoke at a white nationalist event.",
    "I don’t know what his views are, so I’m not aligned with anything that may be controversial.”\nFuentes had introduced Greene to the stage on Friday night.",
    "And most importantly, on proudly proclaiming the greatness of our God.”\nShe went on to compare speaking at the AFPAC to Jesus speaking to sinners.",
    "“It means having the courage to stop agonizing over fake divisions and disingenuous allegations from our godless and gutless mainstream media.",
    "I’m reminded of the old line from the ‘Butch Cassidy and the Sundance Kid’ movie, where one character says, ‘Morons, I have morons on my team.",
    "That’s why I will continue to share my message of unity, family and faith in our great nation to every corner and every group within America.",
    "“It doesn’t matter if I’m speaking to Democrat union members or 1,200 young conservatives who feel cast aside and marginalized by society.",
    "Related: Here’s why everyone is laughing at Marjorie Taylor Greene today\nGreene (R-GE) was not the only GOP figure to participate.",
    "“Being truly America First means rejecting the Democrat obsession with skin color, sexuality, and gender,” Green tweeted.",
    "'”\nLiz Cheney (R-WY) tweeted a video clip of Fuentes praising Vladimir Putin and welcoming Greene to the stage.",
    "Representative Taylor-Greene playing footsie with Nick Fuentes and his splinter movement is shameful.",
    "But I won’t abandon these young men and women, because I believe we need to do better by them.",
    "We’re going to focus on protecting the nuclear family, our border, our jobs & our children.",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now.",
    "Wonder if Kevin McCarthy @GOPLeader will kick her out of the Republican Conference?",
    "The far-right event, a rival CPAC, is organized by white nationalist Nick Fuentes.",
    "He told CNN on Sunday, “Marjorie Taylor Greene and Paul Gosar, I don’t know them.",
    "She told Robert Costa of CBS News on Saturday, “I do not know Nick Fuentes.",
    "“Jesus was a friend to sinners; we are called to follow his example.",
    "On saving this great nation from the jaws of the Biden catastrophe.",
    "Mitt Romney (R-UT) called Greene and Gossar “morons”.",
    "— Mike Pompeo (@mikepompeo) February 27, 2022",
    "“We’re going to focus on people, not labels.",
    "Marjorie Taylor Greene endorsed @JDVance1.",
    "I’m not going to be drawn into that.",
    "I’m only responsible for what I say.",
    "“I talked about God and Liberty.",
    "Will he endorse her opponent?",
    "I’ve never heard him speak.",
    "So ask me about my speech.",
    "I’ve never seen a video."
  ]
}