{
  "id": 423,
  "mediaId": 2522,
  "date": "2022-04-13",
  "headline": "Emboldened migrants reportedly taking selfies after crossing US border",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/04/selfies.jpg",
  "link": "https://www.bizpacreview.com/2022/04/13/emboldened-migrants-reportedly-taking-selfies-after-crossing-us-border-1225257/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sierra Marlee",
  "authorUrl": "https://www.bizpacreview.com/author/sierra-marlee/",
  "termIds": [
    0
  ],
  "sentences": [
    "They have no shame ~ ~ Illegal aliens snap selfies at border after crossing into US https://t.co/fftbXCheTg pic.twitter.com/bZYG2pfNRL\n— SgtPepper1964 (@SPepper1964) April 13, 2022\nMigrants snap selfies at border after crossing into US – Newsworldpress @ https://t.co/Qm5FRStHP2 pic.twitter.com/4URgwY66B7\n— newsworldpress.com (@NewsWorldPress) April 13, 2022\n“They use them to show everybody, ‘See?",
    "“But yet they’re taking selfies on their Apple phones with their Louis Vuitton purses and Nike shoes, and they’re ready to be escorted to their next visit.”\n“There are no consequences with the Biden administration, and that’s only going to lead to more illegals coming into the United States, which leads to more drugs and more crime and more human trafficking,” Comer concluded.",
    "These people that are coming in are dependent on the government, and that’s what this administration, from COVID to illegal immigration to chaos to a lack of the rule of law — it’s all part of their plan.”\nRep. Pete Sessions, R -Texas suspected that most of the migrants appearing at the border had paid thousands, even tens of thousands, to a coyote to help them get there.",
    "And then we will teach you what you need to say in order to get released.”\n“And that’s all policy-driven.”\nRep. James Comer, R -Kentucky, a ranking member of the House Oversight Committee, pointed out that the fact that migrants feel comfortable enough to take selfies means that they have a “lack of fear” when committing these crimes.",
    "Pay me $1,000, and you can be happy, as well.”\nHe also wasted no time in decrying the free phone program for migrants as “one of the dumbest things I’ve ever heard.” The smartphones provided by the Biden administration are reportedly used to track the migrants after they are released into the United States.",
    "Noting that the flow of illegal immigration is an issue that has spanned multiple presidencies, Judd then explained that Biden’s policies are partly to blame for encouraging those looking to come over, as well as groups looking to take advantage of an easy payday.",
    "“Without question the people who were coming across by the hundreds, and during the day by the thousands, have all paid $5,000 to $8,000, and if they came from a different country outside of South America: $30,000.",
    "While traveling with some members of the House Oversight Committee earlier in the week, Fox News Digital reported that they saw fearless migrants snapping selfies as Border Patrol agents look on helplessly.",
    "Brandon Judd, president of the National Border Patrol Council, grimly predicted the selfies will be used as advertisements for cartels and coyotes, who are paid to smuggle people across the border.",
    "Rep. Paul Gosar, R -Arizona, accused the administration of allowing the unmanageable flood of humanity across the border as part of the “plan.”\n“This is intentional.",
    "“These are people with abilities, these are people with money, and they’re coming to overwhelm our great nation.”\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "“What the cartels are able to do… is they advertise their services based upon our policies,” he explained.",
    "“And the main thing they advertise is: cross the border illegally, you’re still going to get released.",
    "Look how easy it was,’” Judd told the Fox News Digital crew while observing the state of the border.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "They’re breaking the law, they’re here illegally,” he explained.",
    "This is simply a rush to come here,” he pointed out.",
    "Pay us thousands of dollars, we will get you there.",
    "The public will not see it and we do not share it.",
    "“That shows a lack of fear.",
    "“‘These people are happy.",
    "Look."
  ]
}