{
  "id": 4240,
  "mediaId": 6404,
  "date": "2022-02-25",
  "headline": "Biden Admin Reportedly Diverting U.S. Border Patrol Agents To Assist In Ukraine Conflict",
  "image": "https://americanlookout.com/wp-content/uploads/2017/11/Border-Patrol.jpg",
  "link": "https://americanlookout.com/biden-admin-reportedly-diverting-u-s-border-patrol-agents-to-assist-in-ukraine-conflict/",
  "mediaOutlet": "americanlookout.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike LaChance",
  "authorUrl": "https://americanlookout.com/author/aleister/",
  "termIds": [
    2201,
    3975,
    1097,
    1122,
    4811,
    5254,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "Trending: Democrats Terrified By Possibility Of Republicans Taking Back House And Senate Then Reelecting Trump\n“Eligible employees who volunteer for this situation may be selected to serve a temporary duty assignment in Poland to facilitate travelers for entry into the U.S., to include providing guidance and problems resolution to other government agencies.”\nThis is crazy, even for Biden.",
    "Just the News reports:\nEXCLUSIVE: Despite southern border crisis, CBP agents asked to deploy to Europe for Ukraine conflict\nFor the second time in a year, the Biden administration is seeking to divert Customs and Border Protection officers from the southern border crisis to an overseas conflict, this time to help process people fleeing the Russian assault on Ukraine.",
    "In a memo sent Thursday morning and obtained by Just the News, CBP’s office of field operations sought volunteers willing to deploy immediately to Poland for “Operation Ukraine Support.”\nThe request comes six months after a similar effort to process Afghan refugees after the bungled U.S. exit from that country.",
    "“The Office of Field Operations is seeking volunteers to assist with the possible evacuation of U.S. citizens, lawful permanent residents, and their immediate family members from Ukraine,” the memo sent to field operations executives said.",
    "That operation was sharply criticized Friday by the Pentagon inspector general for poor Defense Department vetting that allowed 50 Afghans posing serious security risks to enter the United States.",
    "The Biden administration is reportedly looking to divert U.S. Border Patrol agents to help with the conflict in Ukraine.",
    "Not to mention the fact that serving overseas is definitely not in their job description.",
    "Nothing this administration does makes any sense.",
    "We need our Border Patrol agents on the border.",
    "America’s southern border is under assault.",
    "This is beyond insane."
  ]
}