{
  "id": 4282,
  "mediaId": 6746,
  "date": "2022-02-28",
  "headline": "Rep. Marjorie Taylor Greene Attends White Nationalist Conference, Receives Criticism From Fellow Republicans",
  "image": "https://1075914428.rsc.cdn77.org/data/images/full/269275/rep-marjorie-taylor-greene-attends-white-nationalist-conference-receives-criticism-from-fellow-republicans.jpg",
  "link": "https://www.hngn.com/articles/240833/20220228/rep-marjorie-taylor-greene-attends-white-nationalist-conference-receives-criticism.htm",
  "mediaOutlet": "hngn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Renz Soliman",
  "authorUrl": "https://www.hngn.com/reporters/renz-soliman",
  "termIds": [
    0
  ],
  "sentences": [
    "White Nationalist Conference\nIn defense of her appearance at the conference, Greene, who is currently barred from sitting on congressional committees due to her previous extremist comments, said she was not aware of the views of the delegates but did not make an apology for being at the event.",
    "Read Also: President Joe Biden Sparks Fury For His Absence in DC; POTUS Spends Weekend in Delaware Despite War Wages in Ukraine\nThe GOP member referred to Greene and Rep. Paul Gosar when making his remarks and cited an old movie he watched with the line, \"Morons, I've got morons on my team.\"",
    "United States Rep. Marjorie Taylor Greene attended and spoke before a meeting of white nationalists who expressed their support for Russian President Vladimir Putin amid the Ukraine crisis, prompting criticism from fellow GOP members.",
    "In a Twitter post, the Republican said she refused to be led into the \"guilt by association game in which you demand every conservative should justify anything ever said by anyone they've ever shared a room with.\"",
    "Criticism From Other Republicans\nOther Republicans who attended the conference include former Congressman Steve King of Iowa, taken off the U.S. House committees for racist remarks, and Idaho Lieutenant Gov.",
    "Video footage of the event was released that showed the organizer, Nick Fuentes, attendees cheering for Putin and approving comparisons between the Russian president and German Dictator Adolf Hitler.",
    "Florida Sen. Rick Scott, who chairs the National Republican Senatorial Committee, while criticizing \"racial politics,\" also said he completely disagrees with Greene's attendance at the conference.",
    "Greene added that she was not going to turn down the opportunity to speak to roughly 1,200 young America First patriots because of a few off-color remarks by another speaker.",
    "Utah Republican Sen. Mitt Romney also shared his discontent with GOP members who attended the White nationalist event and those who openly supported Putin.",
    "In an interview, the official said there was no place in either political party for White nationalism or racism, calling them simply wrong and evil.",
    "In response to Greene's attendance at the conference, the Republican Jewish Coalition quickly denounced the official's attendance on Saturday.",
    "According to CNN, Romney's comments followed Wyoming Rep. Liz Cheney's criticism of Greene and Gosar for their appearance at the conference.",
    "She said that White supremacy, neo-Nazism, hate speech, and bigotry were disgusting things that did not have a home in the Republican party.",
    "The leader of the Republican National Committee, chairwoman Ronna McDaniel, was among those who expressed their disappointment in Greene.",
    "Furthermore, Illinois Rep. Adam Kinzinger, who is also a member of the House Select Committee along with Cheney, also had his say.",
    "The Georgia Republican appeared in Orlando at the America First Political Action Conference on Friday night, as per USA Today.",
    "Related Article: New York City Mayor Eric Adams Teases Removal of COVID-19 Vaccine Mandate; But Why Will It Happen Next Week?",
    "He argued that any person willing to sit down with White nationalists and speak at their events was missing a few IQ points.",
    "In an interview, he said that everyone should be given the same opportunities, Yahoo News reported.",
    "The official said that she talked about God and Liberty during the conference.",
    "They called her and Gosar's attendance \"appalling and outrageous.\"",
    "Janice McGeachin."
  ]
}