{
  "id": 4393,
  "mediaId": 4018,
  "date": "2022-03-01",
  "headline": "Mitch McConnell condemns antisemitism after Republicans Greene, Gosar and Rogers speak at white nationalist’s conference",
  "image": "https://www.jta.org/wp-content/uploads/2022/03/3-1-22-greene-gosar.jpg",
  "link": "https://www.jta.org/2022/03/01/politics/mitch-mcconnell-condemns-antisemitism-after-republicans-greene-gosar-and-rogers-speak-at-white-nationalists-conference",
  "mediaOutlet": "jta.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabe Friedman",
  "authorUrl": "https://www.jta.org/author/gabe-friedman",
  "termIds": [
    0
  ],
  "sentences": [
    "(JTA) — Senate Minority Leader Mitch McConnell chastised two fellow Republicans for attending a conference run by a well known white nationalist, saying, “There’s no place in the Republican Party for white supremacists or antisemitism.”\nHouse Reps. Marjorie Taylor Greene and Paul Gosar and Arizona State Sen. Wendy Rogers earned the ire of Republican leadership by speaking at the America First Political Action Conference in Orlando over the weekend.",
    "In one she called Volodymyr Zelensky, Ukraine’s Jewish president, a “globalist puppet for Soros and the Clintons.”\n“I stand with the Christians worldwide not the global bankers who are shoving godlessness and degeneracy in our face,” she tweeted Friday.",
    "Since Friday, Rogers has tweeted several times about “globalists,” often seen as a dog whistle for Jews, and George Soros, the Jewish billionaire who is often cited in right-wing, often antisemitic conspiracy theories.",
    "Greene and Gosar also co-founded an America First Caucus last year, which called for “common respect for uniquely Anglo-Saxon political traditions,” before abandoning the initiative.",
    "And there’s no place in our party for any of this.”\nGreene defended herself by calling her Republican detractors “Pharisees” — a term that some Jews find antisemitic.",
    "“When I come back, I see two colleagues who went and participated with a group that has a leader that many times gives antisemitic views and led a chant for Putin.",
    "Greene has been criticized by Jewish groups for most of her freshman term in Congress for comparing COVID-19 public health measures to the laws of Nazi Germany.",
    "The Pharisees were an ancient Jewish sect who have been described in Christian discourse as greedy hypocrites because of their criticism of Jesus.",
    "Its organizer Nick Fuentes has made a number of antisemitic and racist statements and is considered a white nationalist by the Justice Department.",
    "Gosar has ties to the Oath Keepers group, who were implicated in the Jan. 6 Capitol insurrection, and has previously fundraised with Fuentes.",
    "The Republican Jewish Coalition said the lawmakers’ participation was “appalling and outrageous” and called Fuentes a Nazi sympathizer.",
    "Fuentes led a chant in support of Russian President Vladimir Putin, who had just launched a war on Ukraine, at the conference.",
    "Greene, Gosar and Rogers both have long histories of controversial statements and associations with extremists.",
    "In his condemnation, House Minority Leader Kevin McCarthy cited a recent congressional Israel trip he joined.",
    "“Last week, I was just in Israel,” McCarthy told PunchBowl News.",
    "For me it was appalling and wrong."
  ]
}