{
  "id": 4395,
  "mediaId": 2748,
  "date": "2022-03-01",
  "headline": "Romney on Greene, Gosar: 'I have morons on my team'",
  "image": "https://www.cracknewz.com/favicon.ico",
  "link": "https://www.cracknewz.com/2022/03/romney-on-greene-gosar-i-have-morons-on.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Blarp Blog",
  "authorUrl": "",
  "termIds": [
    1926,
    2298,
    3242,
    4527,
    472,
    589,
    878,
    5408
  ],
  "sentences": [
    "\"As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Cheney said in a tweet.",
    "The senator added there is \"no place\" in either political party for white nationalism or racism, calling it \"simply wrong\" for elected leaders to associate themselves with white nationalists.",
    "Romney's statements came after Rep. Marjorie Taylor Greene (R-Ga.) attended a conference hosted by Nick Fuentes, a white nationalist leader, at the Orlando World Center Marriott.",
    "\"I went to his event last night to address his very large following because that is a young, very young, following and a generation I am extremely concerned about.\"",
    "Sen. Mitt Romney (R-Utah) on Sunday slammed a pair of House Republicans after they attended a conference hosted by a prominent white nationalist over the weekend.",
    "\"I would think that anybody that would sit down with a white nationalist and speak at their conference would certainly be missing a few IQ points,\" Romney said.",
    "\"I'm reminded of the old line from the 'Butch Cassidy and the Sundance Kid' movie, where one character says, 'Morons, I have morons on my team.'\"",
    "\"I don't know what his views are, so I'm not aligned with anything that may be controversial,\" Greene told CBS News.",
    "\"Marjorie Taylor Greene and Paul Gosar, I don't know them,\" Romney said during an appearance on CNN.",
    "Rep. Paul Gosar (R-Ariz) also appeared at the event via pre-recorded video, HuffPost reported.",
    "\"All Americans should renounce this garbage and reject the Putin wing of the GOP now.\"",
    "also slammed her fellow House Republicans for attending the conference.",
    "Rep. Liz Cheney (Wyo.)"
  ]
}