{
  "id": 4435,
  "mediaId": 2640,
  "date": "2022-03-02",
  "headline": "House Resolution Backing Ukraine Passes 426-3",
  "image": "https://img1-azrcdn.newser.com/image/1401348-12-20220330011656.jpeg",
  "link": "https://www.newser.com/story/317609/house-passes-measure-fervently-in-support-of-ukraine.html",
  "mediaOutlet": "newser.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The resolve comes after the blue and yellow colors of the Ukraine flag were on view in the House chamber for President Biden’s State of the Union speech Tuesday night, a display of bipartisan common ground for the often divided Congress.",
    "In the Senate, Republican Sen. Lindsey Graham was also introducing a resolution that would back Ukraine’s claim in international court that Putin and his \"cronies\" have committed war crimes.",
    "Lawmakers said Wednesday that history was watching the way the world responds as Ukrainians fight to save their Western-style democracy from invasion by Russia, the AP reports.",
    "\"The camera of history is rolling on all of us today,\" said Democratic Rep. Gregory Meeks, the chairman of the Foreign Affairs Committee during a House floor debate.",
    "Graham said Wednesday that he is introducing a new resolution to hold Putin and those around him accountable for the assault on Ukraine in international courts.",
    "All but three members of the House voted for the resolution: Republican Reps. Paul Gosar of Arizona, Thomas Massie of Kentucky, and Matt Rosendale of Montana.",
    "(Newser) – The House of Representatives has overwhelmingly approved a resolution “steadfastly, staunchly, proudly, and fervently\" in support of Ukraine.",
    "With intensifying urgency, many in Congress said more must be done to help Ukraine and cut off Russian President Vladimir Putin’s ability to wage war.",
    "He urged his colleagues to provide a unanimous vote to overwhelmingly show \"whether or not we stood up and stood out to protect freedom.\"",
    "Lawmakers of both parties also want to send Ukraine more ammunition, anti-aircraft weapons and other military and relief aid.",
    "\"Enough of the murder, enough of the destruction and carnage,\" Graham said Wednesday in a press conference at the Capitol.",
    "Congress largely backs Biden’s strategy of economic sanctions against Russia, even as lawmakers push for more.",
    "The Senate unanimously approved a similar measure in support of Ukraine last month.",
    "(Read more Russia-Ukraine conflict stories.)"
  ]
}