{
  "id": 4468,
  "mediaId": 2607,
  "date": "2022-03-04",
  "headline": "Romney speaks harshly but honestly about Putin and GOP’s crackpots",
  "image": "",
  "link": "https://lasvegassun.com//news/2022/mar/04/romney-speaks-harshly-but-honestly-about-putin-and/",
  "mediaOutlet": "Las Vegas Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Barabak",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "I’ve got morons on my team.’ And I have to think anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points.”\nKevin Madden, a Republican communications strategist who spent years at Romney’s side during two presidential campaigns, said the senator clearly decided it was time — to use a word once fashionable in U.S.-Russia relations — for a reset.",
    "Seated together during the third and final debate of their presidential contest, Obama turned to Romney and disdainfully told his rival that the 1980s were “calling to ask for their foreign policy back, because, you know, the Cold War’s been over for 20 years.”\nRomney’s analysis sounds different and more prescient following the Russian invasion of Ukraine.",
    "In a similar abdication, few GOP leaders have been as outspoken and categorical as Romney in castigating Republican Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona, who recently shared their madcap musings with an audience of white supremacists in Florida.",
    "And that’s not going to happen.”\nRomney was nearly as unstinting in condemning those — Fox News provocateur Tucker Carlson, former White House advisor Steve Bannon and, most incorrigibly, former President Donald Trump — who’ve tossed bouquets in Putin’s path.",
    "Speaking Sunday from Salt Lake City, the ever-courteous Utah senator allowed himself a small smile at the revisionist thinking and dryly noted on CNN, “Politics is an extraordinarily interesting game.”\nHe minced no words when it came to Russia’s leader.",
    "You’re seeing a little bit of Mitt unplugged.”\nIn Utah, Romney has a bare 51% overall approval rating among voters, though, strikingly in this age of stark partisan divisions, he draws equally approving marks from both Democrats and Republicans.",
    "Back in 2012, President Barack Obama and his political allies seized on Romney’s comment regarding Russia and used it to portray the Republican nominee as a naïf lacking the foreign policy heft and forward-looking world-view to be president.",
    "“In many ways, he had a very diplomatic approach” believing one of the best ways to address the extremism and outlandish behavior within the GOP was to “do it collectively with others inside the room,” Madden said.",
    "Now “he’s being much more forceful in having these debates publicly and calling people on the carpet publicly.”\nPerhaps, Madden suggested, Romney felt he was being “too diplomatic and too polite about it.",
    "Now — at age 74, his once jet-black hair streaked with gray, his still-square jaw softened with age — Romney has emerged as something else, a truth-teller and voice of conscience in the Republican Party.",
    "They basically poke us in the eye everywhere they can.”\nWhat’s more interesting and noteworthy, though, is Romney’s withering criticism of Russia’s Republican appeasers and the crackpots within the GOP.",
    "But over on ABC, Sen. Tom Cotton, R-Ark., couldn’t seem to find the words when he twice refused to comment on Trump’s long, strange history of fetishizing Russia’s dictatorial leader.",
    "“And it just makes me ill to see some of these people do that.”\nDenouncing fellow Americans giving aid and comfort to Putin doesn’t seem a particularly hard thing to do.",
    "He has a 54% approval rating among unaffiliated voters, according to the poll conducted by the University of Utah and published last month by the Deseret News.",
    "“If you want to talk to the former president about his views or his message, you can have him on your show,” Cotton blandly told host George Stephanopoulos.",
    "At the time, the global “war on terrorism” was much more top of mind, along with the challenges posed by an increasingly powerful and assertive China.",
    "He’s been on a vindication tour of late, owing to something he said a decade ago, when Romney described Russia as “without question” America’s “No.",
    "“It’s unthinkable to me,” said Romney, the lone Republican senator to vote for Trump’s removal in 2020 for holding up military aid to Ukraine.",
    "But whatever his electoral future holds, Romney has already staked himself a leadership position ahead of the momentous 2024 campaign.",
    "“I’m reminded of that old line from the ‘Butch Cassidy and the Sundance Kid’ movie,” he went on, “where one character says, ‘Morons.",
    "A small, feral-eyed man who is trying to shape the world in the image when once again Russia would be an empire.",
    "“Look, there is no place in either political party for this white nationalism or racism,” Romney said.",
    "1 geopolitical foe.”\n“Russia continues to fight us in every venue they have,” he said Sunday on CNN.",
    "Former Secretary of State Madelaine Albright apologized for her earlier mockery.",
    "“It’s almost treasonous,” he said of the regard shown Russia’s thuggish leader.",
    "Romney is delivering, as he did before, a warning some will choose to dismiss.",
    "(Trump was hoping to enlist the country’s help digging up dirt on Joe Biden.)",
    "“John McCain was right,” Romney said of the late unfiltered Arizona senator.",
    "Romney has yet to say whether he will seek reelection in two years.",
    "The adopted son of Utah, the state he represents in the Senate.",
    "“He said he looked into Vladimir Putin’s eyes and saw the KGB.",
    "Mitt Romney has been several things in his political career.",
    "The “severely conservative” 2012 GOP nominee for president.",
    "Mark Barabak is a columnist for the Los Angeles Times.",
    "Whether Republicans pay heed is another question.",
    "The socially moderate governor of Massachusetts.",
    "Some have recanted their criticism of him.",
    "“They support the world’s worst actors.",
    "And that’s what we’re seeing.",
    "... It’s evil as well.",
    "“It’s simply wrong.",
    "..."
  ]
}