{
  "id": 4479,
  "mediaId": 4040,
  "date": "2022-02-28",
  "headline": "Marjorie Taylor Greene Is White Nationalism’s Latest Vehicle Into the Mainstream GOP",
  "image": "https://files.rightwingwatch.org/uploads/Screen-Shot-2022-02-27-at-4.31.37-PM.png",
  "link": "https://www.rightwingwatch.org/post/marjorie-taylor-greene-bridges-white-nationalism-and-the-gop/",
  "mediaOutlet": "Right Wing Watch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristen Doerer",
  "authorUrl": "https://www.rightwingwatch.org/post_author/kristen-doerer/",
  "termIds": [
    0
  ],
  "sentences": [
    "“But you will not replace us.”\nOther attendees included Jared Taylor, a longtime author of white supremacist literature; Tim Gionet, a white supremacist streamer who goes by the moniker Baked Alaska and faces criminal charges for his role in the attack on the U.S. Capitol; media figure Patrick Howley, who regularly shares his antisemitic views online; Andrew Torba, the Christian nationalist founder of Gab; Gavin McInnes, the founder of the Proud Boys hate group; Milo Yiannopoulos, a far-right “ex-gay” provocateur who tried to launder white nationalism through Breitbart News; and Jaden McNeil, a Groyper and former leader of America First students; and Stew Peters, who has promoted white nationalists on his show.",
    "On Saturday, he waxed on about communism, complimented Putin’s intellect, and attacked the first Black woman to be nominated to the Supreme Court as a “radical left zealot.” His real success, however, was in demonstrating just how far he has brought the party on display at CPAC to the extreme right, making it easier for white nationalists and their ilk to spread their message among his followers.",
    "James called for instituting an immigration moratorium—a desire of many white nationalists to prevent nonwhite people from coming the U.S.—abolishing abortion, criminalizing homosexuality, and “bringing an end to the anti-white indoctrination in public schools.”\n“We must have a deep desire to dominate without mercy, and if you refuse to dominate, America First will dominate you,” he added.",
    "?”\nOf course, AFPAC was not attended by normal young conservatives but by followers of Fuentes’ white nationalist America First youth movement who dub themselves “Groypers.” Their radical agenda was laid out by the speaker who followed the representative from Georgia, Vincent James, a video blogger who blatantly promotes white nationalism.",
    "Ronna McDaniel, the chairwoman of the Republican National Committee, failed to address Greene or AFPAC head on, but issued a general statement stating that “white supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.”\nOn Saturday, Trump took to the stage.",
    "But if we can drag the furthest part of the right further to the right, and we can drag the center further to the right, and we can drag the left further to the right … then we’re winning,” he said during a May 2021 livestream of “America First.”\nHe’s not alone in his desire to do so.",
    "Joe Arpaio, the far-right former Arizona sheriff who was first known nationally for jailing people in tents in triple-digit summer heat and using them on chain gangs, spoke at the white nationalist conference and hawked his new book at CPAC the following day.",
    "Far-right “Groypers,” their old school white nationalist counterparts, and far-right personalities gathered in the ballroom of the Marriott hotel Friday night, bursting into applause as the face of their movement Nick Fuentes came out onto the stage.",
    "Greene’s appearance at AFPAC—while not all that surprising considering her history of racist, Islamophobic, and antisemitic comments—highlights the white nationalism creep into the Republican Party and CPAC’s willingness to participate.",
    "?We are anti-gay, anti-woman, anti-Black, antisemitic.”\nFuentes has compared himself to Hitler, said that women in the United States should be treated like women under the Taliban in Afghanistan, and gleefully used the N-word.",
    "Rep. Paul Gosar of Arizona, who last year stood in Greene’s place getting condemned for his speaking at both conferences, sent a video message to be played at AFPAC, as did Arizona state Sen. Wendy Rogers and Idaho Lt. Gov.",
    "The next morning, Greene walked out onto the carpeted red stage of CPAC—a once libertarian centric conference that has come to embody the MAGA movement and the Republican Party—and received a similarly raucous welcome.",
    "“She is a standard bearer of Trumpism in the U.S. Congress, she is pro-life, she is proudly America First, and I want say a very special thank you to Milo Yiannopoulos for making this happen,” Fuentes said.",
    "A mystery speaker had been floated for weeks ahead of AFPAC, the white nationalist conference held in Orlando, Florida, just 10 miles down the street from the Conservative Political Action Conference.",
    "In his opening remarks, Fuentes compared the growth of his event to that of CPAC’s, claiming that AFPAC had grown from just a handful of people to over 1,000 attendees in three short years.",
    "Wendy Rogers, the 67-year-old state senator from Arizona who spoke at the conference remotely, released a campaign ad on Feb. 15 explaining her embrace of conspiracy theories.",
    "“I think this is going to be the beginning of something great—the representative from Georgia, Marjorie Taylor Greene!”\nGreene walked out on the stage to a roar of applause.",
    "After calling for a round of applause for Russia the day after it invaded Ukraine, which was responded to with chants of “Putin,” he introduced the event’s mystery speaker.",
    "“She put herself out on a limb for us here tonight, and we here at AFPAC are grateful for her presence tonight.”\nLater in his speech, Fuentes considered Hitler again.",
    "“There is what’s called ‘the Overton Window of political acceptability,’ and we have to move it inch by inch, day by day.” She reiterated those remarks Friday night.",
    "Reporters reached out to CPAC and its organizer, American Conservative Union President Matt Schlapp, asking about whether they endorsed Greene’s appearance at AFPAC.",
    "“God bless Marjorie Taylor Greene, you have no idea what a big deal it was for her to come out and do that,” Fuentes said as “MTG” chants broke out in the ballroom.",
    "In a series of tweets Sunday, she defended her attendance and said she was there to talk to “young conservatives who feel cast aside and marginalized by society.?",
    "On Friday night, Peters declared that Dr. Anthony Fauci should be “hanging by the end of a noose somewhere.” Groypers responded by chanting “String him up!",
    "Fuentes regularly spouts his opinions on his “America First” show streamed on his own “censor proof” platform, a hub he described as such: “?",
    "Fuentes started AFPAC three years ago in Washington, D.C., to coincide with CPAC, held at that time in the National Harbor, Maryland.",
    "“And now they’re going on about Russia and [saying] ‘Vladimir Putin is Hitler.’ They say that’s not a good thing,” Fuentes said.",
    "Last year, they scored Rep. Paul Gosar as a speaker; this year, they had four sitting legislators and government officials.",
    "Fuentes has been explicit about his desire to move the “Overton Window” of acceptable discourse in the Republican Party.",
    "I don’t know what his views are, so I’m not aligned with anything that may be controversial,” she told a CBS reporter.",
    "“A person who is very shy, doesn’t like speaking her mind, but she does it anyway, Marjorie Taylor Greene,” he said.",
    "After attending the 2017 Unite the Right rally at which a counterprotester was murdered, Fuentes took to Facebook.",
    "String him up!”\nWhen it was time for Fuentes to speak, he again applauded Greene for attending the conference.",
    "Followers of Fuentes were spotted at CPAC, wearing America First hats as an ode to their ideology.",
    "It has “blossomed into the preeminent right-wing political moment in America today,” he declared.",
    "“We have got to be on the right, dragging these people kicking and screaming into the future.",
    "“You know what it’s like to be canceled, and that’s why I’m here to talk to you tonight.",
    "“I don’t want to be the world’s censor,” Schlapp told the Washington Examiner Saturday.",
    "By Monday morning, their answer appeared largely to be silence—and tacit endorsement.",
    "I shouldn’t have said that.”\n“I don’t think they can ignore us anymore,” he said.",
    "A quick Google search could have provided information on Fuentes’ extreme views.",
    "Seven years ago, in announcing his presidential bid, he called Mexican rapists.",
    "Former President Donald Trump would take to the same stage later that evening.",
    "“You can call us racists, white supremacists, Nazis, & bigots,” he wrote.",
    "Trump thanked Greene in his speech with a tongue-in-cheek comment.",
    "I don’t believe anyone should be canceled,” she told the ballroom.",
    "Backstage at CPAC, Greene tried to distance herself from Fuentes.",
    "Greene wasn’t the only one in attendance at both conferences.",
    "She shook Fuentes’ hand and blew a kiss to the crowd.",
    "I’ve never heard him speak, I’ve never seen a video.",
    "We’re not going to drag them all the way over.",
    "AFPAC has followed CPAC around ever since.",
    "… Into a truly reactionary party.",
    "“I shouldn’t have said that.",
    "The crowd stood in applause.",
    "“I do not know Nick Fuentes.",
    "Janice McGeachin.",
    "It’s incremental.",
    "He laughed."
  ]
}