{
  "id": 4573,
  "mediaId": 2658,
  "date": "2022-02-23",
  "headline": "POLITICO Playbook: GOP pans Biden’s first taste of sanctions",
  "image": "https://static.politico.com/58/2e/099d0b534a79a976db92029df79e/gettyimages-1232559140.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/02/23/gop-pans-bidens-first-taste-of-sanctions-00010906",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3375,
    3709,
    3841,
    3975,
    4276,
    831,
    878,
    5287,
    5366
  ],
  "sentences": [
    "This is exactly the rule that has to be followed.”\n— And nobody knows if this will work: NYT’s Edward Wong and Michael Crowley note that despite the administration’s overheated rhetoric, Biden has chosen a level of sanctions roughly commensurate with the nature of the Russian advance, betting that it might provide Putin an offramp to return to diplomacy:\n“EDWARD FISHMAN, a top State Department sanctions official in the Obama administration, called Mr. Biden’s action on Tuesday a modest first step intended as ‘a shot across the bow.’ Mr. Fishman said the administration’s move against one of the two targeted banks — VEB, the country’s main development bank — was the first time the United States had fully cut off a state-owned Russian financial institution.",
    "“‘This never would have happened with us had I been in office — not even thinkable,’ Trump said in a Tuesday radio interview, describing Putin’s recognition of Ukrainian separatist regions as ‘savvy.’”\n— One example of the strange new coalitions being forged on the fly: A bipartisan group of 43 lawmakers in Congress — ranging from Reps. PAUL GOSAR (R-Ariz.) to ALEXANDRIA OCASIO-CORTEZ (D-N.Y.) — is asking Biden to “seek congressional authorization before directly involving U.S. troops in the emerging Russia-Ukraine conflict,” our Anthony Adragna reports for Congress Minutes.",
    "President [JOE] BIDEN acknowledged that the crisis could lead to higher gasoline prices, while U.S. businesses have been warned to prepare for possible cyberattacks.”\nSANCTIONS REACTIONS — The Russia sanctions announced by Biden on Tuesday made clear the White House is still grappling with the same question he mused about at his Jan. 19 news conference: What is the appropriate Western response to “something significantly short of a significant invasion — or not even significant, just major military forces coming across”?",
    "… Several Iranian officials said some minor technical issues were being discussed in Vienna and that a deal was expected before the end of the week, though adding that ’nothing is agreed until everything is agreed.’”\nPLAYBOOK METRO SECTION\nCAPITAL CONVOY CHAOS — “The Pentagon has approved the deployment of 700 unarmed National Guard troops to the nation’s capital as it prepares for trucker convoys that are planning protests against pandemic restrictions beginning next week,” AP’s Ashraf Khalil And Lolita Baldor write.",
    "“He is described to me by his friends … as sarcastic, trollish, quirky and nerdy (By way of explanation, one told me he reminds them of the KIERAN CULKIN character [ROMAN ROY] on ‘Succession.’)”\nJAN. 6 AND ITS AFTERMATH\nDRIP, DRIP, DRIP — “Attorney JOHN EASTMAN, a key ally in Trump’s bid to subvert the 2020 election, says he began advising Trump two months before Election Day, when a prominent conservative attorney recruited him to ‘begin preparing for anticipated post-election litigation,’” our Kyle Cheney reports.",
    "Prior to that, Betsaida served as Assistant Secretary for Public Affairs at the U.S. Department of Housing and Urban Development and a press secretary and communications director at the Government Services Agency and the Environmental Protection Agency.”\nSPOTTED at a dinner with Vladimir Ashurkov, the head of Alexei Navalny’s foundation, at Bistrot du Coin on Tuesday night: Bill Kristol, Ramesh and April Ponnuru, Julian Barnes, Kevin Baron, Julian Borger, Kim Dozier, Paul Sonne, Michael Schaffer and Juleanna Glover.",
    "POLITICO Playbook: GOP pans Biden’s first taste of sanctions\nBy RYAN LIZZA and EUGENE DANIELS\n02/23/2022 06:18 AM EST\nPresented by\nDRIVING THE DAY\nOVERNIGHT — NYT: “Australia, Canada and Japan said they would impose sanctions over the Ukraine crisis as more American allies add to efforts to punish Russia and its president.”\n— WaPo: “Russia warned that Americans will fully feel the ‘consequences’ of U.S. sanctions on the Kremlin after it deployed troops into two pro-Moscow separatist regions of eastern Ukraine.",
    "Cupp … The Atlantic’s Tom McTague … Arjun Mody … Tom Pino … Real Chemistry’s Gary Karr (6-0) … Patrick Velliky … Gibson, Dunn & Crutcher’s Nikki McArthur … AT Johnston … Molly Hooper … Shannon Geison of Andrea Salinas’ Oregon congressional campaign … Elisha Krauss … Leah Clapman … Courtney Matson … Ziya Smallens of Senate Judiciary Chair Dick Durbin’s (D-Ill.) office … Dan Blair … Mike Nixon … Jill Hudson … Bernie Robinson … former Rep. Kenny Marchant (R-Texas)\nDid someone forward this email to you?",
    "…\n“[On Monday,] Mr. Putin then deepened their concerns, the French official said, with ‘a historical-political speech that was operational, accusatory, and mixed, let’s say, various considerations of a rigid and paranoid nature.’”\n— The view from Berlin: “The stringent Covid-19 precaution measures and the sense that Mr. Putin wasn’t allowing anyone near him left Mr. Scholz and his team concerned that the president had become isolated.”\nGood Wednesday morning, and thanks for reading Playbook.",
    "A similarly themed piece up this morning by POLITICO’s fearsome trio of Andrew Desiderio, Tara Palmeri and Meridith McGraw provides a glimpse of Biden’s predecessor’s view of the unfolding situation: “[DONALD] TRUMP told an adviser recently that he doesn’t think Putin should be able to take Ukraine — even just from a real estate standpoint — and that he sees the Russian leader’s current actions as an attempt to steamroll Biden, according to a person familiar with the conversation.",
    "“A half-dozen potential GOP candidates, most of whom won’t be on the ballot in 2022, still spent more than $1.4 million each on email list rentals, digital consulting and online fundraising in 2021, according to a POLITICO analysis of campaign finance disclosures.”\nTEXAS’ TRIAL RUN FOR PROGRESSIVES — The superficial read on JESSICA CISNEROS’ bid to unseat Texas Rep. HENRY CUELLAR in next week’s Democratic primary is that she’s the candidate of the left.",
    "MOOD MUSIC — “Biden’s full plate: Ukraine, inflation, low public approval,” by AP’s Josh Boak\nMOOD MUSIC II — WSJ editorial: “With Russia’s Invasion of Ukraine, a New Cold War Arrives”\nVOTERS’ MUDDLED MESSAGE ON MASKS — As we approach the two-year anniversary of the first Covid lockdowns in the U.S., voters seem ready to ditch mask mandates, according to the POLITICO/Morning Consult poll — but the results are more complicated than at first glance.",
    "“Abbott said the agency ‘is responsible for protecting children from abuse.’ He warned that educators, medical professionals and others who don’t report alleged abuse could face consequences.”\nAMERICA AND THE WORLD\nIRAN NUKE DEAL NEARS COMPLETION — Talks on the restoration of the Iran nuclear deal are almost done, Reuters’ Parisa Hafezi and Francois Murphy report, and “a prisoner swap between Iran and the U.S. is expected soon.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nCONGRESS\nRUSSIA-UKRAINE SCRAMBLES CAPITOL HILL — “Both Democratic and Republican leaders in Congress are hobbled by divisions in their ranks and seemingly content to let the White House take the lead, the credit or the blame,” writes NYT’s Jonathan Weisman, noting the sharp contrast to an earlier era when Congress flexed its foreign policy muscles.",
    "“Many believe Mr. Putin wants to recreate the Soviet Union,” he writes, “but it is much more likely that in threatening Kyiv, he wants to re-create the ‘Crimea effect,’ in which … Russians ‘forgot their worries and felt everything was allowed and anything was possible.’”\n— Meanwhile, in the U.S., many Republicans have settled on a simpler explanation: Biden’s weakness.",
    "Reaction to them varied …\n— Markets were underwhelmed, per this tough piece from Bloomberg’s Justin Sink: “Instead of a sweeping package that crippled top Russian banks, cut its financial transactions off from the global economy, or personally singled out VLADIMIR PUTIN — the U.S. and its allies settled on a modest ‘first tranche’ of penalties.",
    "HAPPY BIRTHDAY: Reps. Jeff Van Drew (R-N.J.) and John Rose (R-Tenn.) … Jim Manley … America Rising PAC’s Chris Martin … Lois Romano … Jennifer Epstein … POLITICO’s Katy Murphy and Andrew Briz … Patrick Svitek … Rebecca Chalif … One Campaign’s Gayle Smith … Marissa Mitrovich … Flynn Chapman … NewsNation’s Erenia Michell … Tommy Mattocks … S.E.",
    "Markets responded with a shrug, underwhelmed by the tit-for-tat approach … [T]he sanctions hardly amounted to the precedent-shattering, economy-crippling measures the U.S. and its partners long telegraphed if Russian troops rolled across the border.”\n— Republicans were unhappy: “Too little, too late,” said Sen. BEN SASSE (R-Neb.",
    "JUDICIARY SQUARE\nSCOTUS INTERVIEWS UNDERWAY — With anticipation running high that Biden will announce a Supreme Court nominee by the end of the week, reports broke Tuesday afternoon that the president has “completed interviews with at least three leading contenders,” per WaPo’s Sean Sullivan, Seung Min Kim and Tyler Pager.",
    "Abby Broyles, a Democratic House candidate in Oklahoma, apologized “after reports that she became intoxicated at a Valentine’s Day weekend sleepover for middle-school-aged girls, berated several of the children and vomited in a hamper.”\nIN MEMORIAM — Betsaida Alcantara died Saturday at 38 after a battle with cancer.",
    "“Trump said Putin has sized up Biden and decided that he isn’t strong enough to stop Russia from rolling into Kyiv, this person recalled, adding that the former president has also blamed Biden for poking the bear by tying his legacy too closely to expanding NATO and to Russia’s Nord Stream 2 natural gas pipeline.",
    "From a message sent to her former Anti-Defamation League colleagues: “She joined ADL in 2017 as she was just coming off of working as Deputy Communications Director for the Clinton-Kaine campaign, where she was responsible for Secretary Clinton’s and Vice Presidential Nominee Tim Kaine’s national media strategy.",
    "— BUT, BUT, BUT: Voters are still generally supportive of their local governments requiring masks in public areas when it comes to indoor dining (54% either “strongly” or “somewhat support”), accessing local gyms (55%), working in offices (56%) or attending entertainment venues (57%).",
    "Toplines … Crosstabs\nBIDEN’S WEDNESDAY — The president and VP KAMALA HARRIS will receive the President’s Daily Brief at 10:15 a.m.\nHARRIS’ WEDNESDAY — The VP will also meet with the National Black Caucus of State Legislators at 5 p.m.\nPress secretary JEN PSAKI will brief at 2:30 p.m.",
    "— Just 39% of voters said it is “too early for states to rescind mask mandates.” Twenty-four percent said it’s the “right time” to drop the mandates, Fifteen percent said “states should have already” done so, and 16% said states never should’ve had mask mandates in the first place.",
    "“That attorney, CLETA MITCHELL, was deputized directly by Trump in August 2020 to establish an ‘election integrity working group.’ … Eastman’s filing is the first-ever formal description of his legal work for Trump.”\nBEYOND THE BELTWAY\nCULTURE WAR WATCH — “Texas Gov.",
    "Pic … Another pic\nWEDDING — Angel Rich, founder/CEO of the Wealth Factory, a fintech company that designs educational technology games, and Karl Jones, director of corporate partnerships at Ansrsource and a BlackRock alum, got married Tuesday at the St. Regis in D.C.",
    "So far, he’s failing.”\n— But the Ukrainians were satisfied, according to Ukrainian Foreign Minister DMYTRO KULEBA, who made remarks alongside Secretary of State ANTONY BLINKEN on Tuesday:\n“First, there is no such thing as [a] ‘minor,’ ‘middle,’ or ‘major’ invasion.",
    "Theories abound:\n— Most Western analysts, pointing to Putin’s July treatise, which was updated in his Monday speech, note that Putin is driven by a desire to rebuild the greatness of the Soviet empire and his insistence that Ukraine is an integral part of Russia.",
    "In an op-ed in the WSJ today, David Satter says “weakness at home drives Putin to invade Ukraine.” He notes that the invasion of Crimea made Putin 20 points more popular, and took the Russian public’s focus off of corruption and economic woes.",
    "The WSJ’s Ann Simmons, Noemie Bisserbe and Bojan Pancevski extract some fascinating details about Putin from people close to two leaders who have spent time with him recently: French President EMMANUEL MACRON and German Chancellor OLAF SCHOLZ.",
    "“I don’t believe Vladimir Putin would have a couple hundred thousand troops on the border of Ukraine had we not precipitously withdrawn from Afghanistan last August, but that’s where we are,” said Senate Minority Leader MITCH MCCONNELL.",
    "… Guard members will not carry firearms or take part in law enforcement or domestic-surveillance activities, the Pentagon said.”\nPLAYBOOKERS\nJen Psaki revealed that binge-watching “The West Wing” got her back into politics.",
    "BIDEN’S UKRAINE NUMBERS — Fifty percent of American voters said they would consider Biden very or somewhat responsible if Russia invaded Ukraine, in our new POLITICO/Morning Consult polling (conducted Saturday to Monday).",
    "FIRST IN PLAYBOOK — The DSCC is launching a five-figure radio and podcast ad buy knocking the Sen. RICK SCOTT-created GOP agenda unveiled Tuesday, specifically his call for new income taxes on millions of Americans.",
    "But that misses something important: She’s “running a progressive campaign in a tough district that sounds starkly different from liberal icons like Alexandria Ocasio-Cortez or BERNIE SANDERS,” writes Sarah Ferris.",
    "But inside the news pages of the Journal, there’s a more provocative answer to the question of why Putin has made such an enormous strategic gamble that could easily turn into a catastrophe for Russia: Covid-19.",
    "— Realists emphasize that Putin has legitimate security concerns, and that NATO, starting in the 1990s, was foolish to believe it could push eastward without precipitating a backlash from Russia.",
    "But Puck’s Theodore Schleiffer reports that another dynastic name keeps coming up in conversations in the Bay Area: REED JOBS, the 30-year-old son of LAURENE POWELL JOBS and the late STEVE JOBS.",
    "Perhaps even more concerning for Democrats, given the proximity to Americans’ lives, is that 58% say they’d find Biden responsible if the conflict causes U.S. gas prices to rise further.",
    "Also notable:\n— On gas prices: Sixty-eight percent of voters said they support a temporary pause on the gas tax, including 75% of Democrats, 62% of independents and 65% of Republicans.",
    "— Sen. Ron Johnson (R-Wis.) has announced the senior campaign staff for his reelect: Dylan Lefler will be campaign manager and previously ran Sen. Martha McSally’s (R-Ariz.) 2020 race.",
    "), who neatly captured the view of most GOP foreign policy talkers, at least the ones who haven’t defected to the Tuckerian view that Ukraine doesn’t matter and Putin isn’t so bad.",
    "GREG ABBOTT has ordered state agencies to investigate reports of transgender kids receiving gender-affirming care as ‘child abuse,’” Dallas Morning News’ Lauren McGaughy reports.",
    "“If Senate Republicans win, we pay the price.”\nBUZZ FROM THE BAY AREA — Who will succeed Speaker NANCY PELOSI when she eventually retires from her San Francisco-based House seat?",
    "“But behind the scenes, they are on an expensive, unprecedented spending spree to build the foundations for potential national campaigns,” report Elena Schneider and Scott Bland.",
    "— There’s been a dearth of reporting in recent weeks that captures Putin’s thinking and state of mind to explain why he chose this moment to initiate a crisis over Ukraine.",
    "Here are the names confirmed by outlets including WaPo and CNN: Judge KETANJI BROWN JACKSON, Judge J. MICHELLE CHILDS and California Supreme Court Justice LEONDRA KRUGER.",
    "ENGAGED — Hunter Hall, a partner at the Picard Group, and Cecilia Lukes, VP of finance at a fintech startup in D.C., got engaged Saturday in Folger Park near their home.",
    "SPOTTED:Mignon Clyburn, Marcia Dyson, Naturi Naughton, Xavier “Two” Lewis, Kamau Marshall, Ri-Karlo Handy, Rashaad Lambert, Maya Rockeymoore Cummings and Adjoa Asamoah.",
    "— What they’ll be doing: “The troops would be used to assist with traffic control during demonstrations expected in the city in the coming days, the Pentagon said.",
    "‘I interpret that as a warning that the Biden administration is prepared to cut off other major Russian banks from the U.S. financial system,’ Mr. Fishman said.",
    "Macron found that Putin was more rigid, more isolated, and had basically gone into a sort of ideological and security-minded drift,’ a French official said.",
    "That impression hardened when Mr. Macron traveled to Moscow two weeks ago as part of a diplomatic push to avert an invasion, according to French officials.",
    "… [I]t was encouraging to hear from [the] secretary a very simple sentence: If Russia escalates, the United States and partners will escalate sanctions.",
    "— Biden’s overall approval rating on Ukraine/Russia is 40% approval to 45% disapproval, including three in 10 who say they strongly disapprove.",
    "… [T]his strategy of imposing sanctions by waves, if I may put it this way, is something that can work if it continues … in a sustainable way.",
    "(NYT’s Tom Friedman argued Monday that “America is not entirely innocent of fueling his fires.”)\n— Others point to Russian domestic politics.",
    "‘But he’s also signaling that, if Putin unleashes a full-scale war, the economic costs will be immense.’”\nPUTIN’S COVID-INDUCED PARANOIA?",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "“A political outsider with a $25 billion family fortune and a widely-admired surname shouldn’t be underestimated,” Schleiffer writes.",
    "The West is bracing for Russia to retaliate against the measures, which Moscow said would hurt global financial and energy markets.",
    "ALL POLITICS\n2024 WATCH — In public, the GOP’s potential 2024 candidates are playing coy about whether they’ll run for president.",
    "JOHN CARNEY will testify at an Environment and Public Works Committee field hearing in Bethany Beach, Del., at 10 a.m.",
    "She most recently was director of the Commercial Remote Sensing Regulatory Affairs office at the Commerce Department.",
    "Nathan Trueblood will be political director and is a Republican Party of Wisconsin and Trump Victory Wisconsin alum.",
    "He previously was comms director for Sen. Kyrsten Sinema (D-Ariz.), and is a Claire McCaskill and Jon Tester alum.",
    "Macron noticed a change in Mr. Putin’s demeanor when speaking to him on the phone over the course of the pandemic.",
    "She is co-founder and CEO of Rappler, a news organization in the Philippines, and a Nobel Peace Prize laureate.",
    "Jake Wilkins will be campaign comms director and previously was comms director for Sen. Kevin Cramer (R-N.D.).",
    "They picked up a to-go drink at Pearl Dive and talked for four hours (with a couple of refills at Pearl Dive).",
    "She most recently was associate director of the Office of Political Strategy and Outreach at the White House.",
    "Publicly and privately, he has described the current standoff as a problem for which he is the lone solution.",
    "Jennifer Strahan, who is challenging Marjorie Taylor Greene in a primary, served gazpacho at a fundraiser.",
    "Hunter showed up with a gin and tonic, and Cecilia showed up on that cloudy evening with an umbrella.",
    "Tuesday’s sanctions were more of an amuse-bouche than the full menu that’s been hinted at for weeks.",
    "Their first date was a “cocktail walk” when restaurants and bars weren’t open for regular business.",
    "FIRST IN PLAYBOOK — John LaBombard is joining ROKK Solutions as an SVP after 15 years on the Hill.",
    "She most recently was co-owner of Walters Music, and is a Census Bureau, Commerce and NOAA alum.",
    "…\n… Aleigha Cavalier is now VP for mobilization and campaign management at Precision Strategies.",
    "There are similar numbers for local governments requiring vaccinations in those same situations.",
    "Speculation has abounded that it could be daughter CHRISTINE PELOSI or state Sen. SCOTT WIENER.",
    "Announcement\nTRANSITIONS — Tahara Dawkins is now chief of staff at the National Space Council.",
    "… Andrea Woods is now program manager for media relations at the American Petroleum Institute.",
    "He previously was a staff director on the House Transportation and Infrastructure Committee.",
    "She previously was a director at Hamilton Place Strategies, and is a DOD and Treasury alum.",
    "… Sandi Walters is now acting chief financial officer at the Farm Credit Administration.",
    "Second, as I said earlier, we do appreciate … the sanctions which were announced today.",
    "‘He tended to talk in circles, rewriting history,’ a close aide to Mr. Macron said.",
    "The two met in the wine aisle at Trader Joe’s in the early months of the pandemic.",
    "She previously was manager of media relations at the Consumer Brands Association.",
    "… Rory Murphy is now VP of government affairs at the US-China Business Council.",
    "“‘Biden is giving Putin an opportunity to step away from the brink,’ he added.",
    "… Aaron Davis is now VP of federal affairs at the International Code Council.",
    "“President Biden promised a ‘swift and severe’ response,” said former U.S.",
    "MEDIA MOVE — Maria Ressa is joining The Atlantic as a contributing writer.",
    "“At least one of the interviews was in person,” per NYT’s Katie Rogers.",
    "He previously was a lobbyist and attorney at Squire Patton Boggs.",
    "The Chinese communists and Iranian jihadists are watching too.",
    "Eric Greitens visited Donald Trump at Mar-a-Lago on Tuesday.",
    "— Cailin Schmeer is now a spokesperson for Lockheed Martin.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "(Higher percentages say they’d blame Putin, though.)",
    "Send Playbookers tips to playbook@politico.com.",
    "It’s a major leadership moment for Biden.",
    "Ukraine is a test of Western resolve.",
    "— Biden’s overall job approval: 45%.",
    "Ambassador to the U.N. NIKKI HALEY.",
    "JOHN BEL EDWARDS and Delaware Gov.",
    "— The view from Paris: “Mr.",
    "It’s not just about Putin.",
    "— Who’s been interviewed?",
    "Invasion is an invasion.",
    "The ad’s last sentence?",
    "They’re very specific.",
    "His disapproval: 53%.",
    "“He did not deliver.",
    "They target Russia.",
    "THE SENATE is out.",
    "THE HOUSE is out.",
    "They are painful.",
    "Louisiana Gov.",
    "Sign up here.",
    "‘Mr."
  ]
}