{
  "id": 464,
  "mediaId": 2512,
  "date": "2022-04-15",
  "headline": "We now have undeniable proof of a coordinated Republican effort to subvert the 2020 election",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29539472&width=1200&coordinates=0%2C160%2C0%2C160&height=600",
  "link": "https://www.alternet.org/2022/04/proof-congressional-republicans-subvert-election/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lindsay Beyerstein",
  "authorUrl": "https://www.alternet.org/author/lindsay-beyerstein",
  "termIds": [
    0
  ],
  "sentences": [
    "He told them they needed to make them feel like the people were “breathing down their neck.”\n“If we make the people inside that building sweat and they understand that they may not be able to walk in the streets any longer if they do the wrong thing, then maybe they’ll do the right thing,” Sullivan said.",
    "In a video made before the insurrection, Ali Alexander claimed that he and US Reps. Mo Brooks, Andy Biggs and Paul Gosar “schemed up putting maximum pressure on Congress while they were voting.”\nThe video circulated on social media but was later deleted.",
    "A recording made by a disgruntled election conspiracist is the strongest evidence yet that operatives in Donald Trump’s orbit summoned supporters to Washington on January 6 for the express purpose of coercing lawmakers into overturning the 2020 election.",
    "The main characters aren’t household names, but this story is every bit as important as the earlier revelation that Donald Trump, Jr, was pushing a detailed plan for a coup to his father’s chief of staff before the election had even been decided.",
    "The inside game was the procedural coup devised by John Eastman that was unfolding inside the Capitol on J6 as GOP legislators raised spurious claims of election fraud to overturn a free and fair election.",
    "(By amazing coincidence, Stone was scheduled to speak at an anti-vax event on the afternoon of J6, an engagement he missed, for reasons that are surely of great interest to the J6 committee.)",
    "Whereupon heavily armed paramilitary operatives calling themselves the 1st Amendment Praetorian (1AP) moved into her home for several weeks, ostensibly to guard her.",
    "And it’s even more important than the late-breaking news that Sen. Mike Lee talked up Trump lawyer John Eastman’s plan for a procedural coup in late November.",
    "He said he schemed with members of the Congress to gather a crowd to pressure lawmakers into overturning the election during the certification ceremony.",
    "“We have to put that pressure there.”\nThis recording was made by a woman named Staci Burk, a former school board official turned election conspiracist.",
    "The plan was to “change the hearts and the minds of Republicans who were in that body, hearing our loud roar from outside,” Ali Alexander said.",
    "Sullivan told the Times he was invited to speak by a group of anti-vaccine activists, who were planning a permitted event in the capital on J6.",
    "The star of the secret recording is Jason Sullivan, one-time aide to dirty trickster and longtime Trump confidante Roger Stone.",
    "Burk told the Times a 1AP member joined the call, and she made the recording because the armed men were making her feel unsafe.",
    "Members of 1AP were in the capital during the insurrection and members of the group have been subpoenaed by the J6 committee.",
    "The outside game was the mob deliberately assembled in order to pressure legislators to go along with Trump’s illegal scheme.",
    "News broke late Tuesday afternoon, whereupon this bombshell of a story was promptly buried under an avalanche of other news.",
    "Burk filed an anonymous affidavit supporting one of Trump lawyer Sidney Powell’s many election conspiracy theories.",
    "Sullivan repeatedly urged the other callers to intimidate the lawmakers who were meeting to certify the election.",
    "This recording partially corroborates previous claims by Ali Alexander, another one of Roger Stone’s associates.",
    "The Sullivan call proves there was an inside-outside game on J6.",
    "This article was paid for by AlterNet subscribers.",
    "The call was made a week before the insurrection.",
    "Prefer to give a one-time tip?",
    "Try us and go ad-free for $1.",
    "Not a subscriber?",
    "Click here."
  ]
}