{
  "id": 4751,
  "mediaId": 2540,
  "date": "2022-02-24",
  "headline": "One sentence that sums up Kevin McCarthy's House speaker problem",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/210518132633-mccarthy-for-oped-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/24/politics/kevin-mccarthy-house-speaker-problem/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    1926,
    3267,
    409,
    878,
    1054,
    4887,
    4977,
    4984
  ],
  "sentences": [
    "She added: \"He doesn't have the votes that are there, because there's many of us that are very unhappy about the failure to hold Republicans accountable, while conservatives like me, Paul Gosar and many others just constantly take the abuse by the Democrats.\"",
    "Which means -- unless Republicans win a huge majority this fall -- he will likely need votes from members of the House Freedom Caucus, the ardently pro-Trump wing of the party, to get across the finish line.",
    "And McCarthy has gone out of his way to grovel to Trump, traveling to Mar-a-Lago to make amends in the wake of critical comments he had made about the former President's handling of January 6, 2021.",
    "The Point: A lack of loyal feelings from Trump spells big trouble for McCarthy as he tries to put together a coalition that would make him House speaker if Republicans retake the majority next fall.",
    "(CNN)There's a sentence in a New York Times profile of Kevin McCarthy -- and his pursuit of the House speakership -- that should send chills up the spine of any ally of the California Republican.",
    "But the Times' profile -- and, in particular, that one sentence cited above -- suggests that it's far from a sure thing Trump would throw his full endorsement behind McCarthy.",
    "And that group -- which includes the likes of Reps. Marjorie Taylor Greene of Georgia and Matt Gaetz of Florida -- already have made plain their concerns about McCarthy.",
    "If the GOP takes control of the House in the November midterm elections, he would need a simple majority (218) of the 435 members of the chamber to be elected speaker.",
    "It's this one: \"Current and former aides to [Donald] Trump describe Mr. McCarthy's relationship with the former president as cordial but lacking in any loyalty.\"",
    "way to get those renegade Republicans on board with McCarthy's speaker bid, it seems to me, is if Trump tells them to.",
    "\"We know that Kevin McCarthy has a problem in our conference,\" Greene said on Gaetz's podcast in November 2021.",
    "A single negative word from the former President could very well doom all of McCarthy's best-laid plans.",
    "Now, things can change -- especially Trump's whims and views about politicians within his party.",
    "He expects utter obeisance, but is loath to ever be too devoted to anyone outside of his family.",
    "Here's why that line is a big problem for McCarthy.",
    "\"He doesn't have the full support to be speaker.\"",
    "But loyalty is a one-way street with Trump.",
    "The best (only?)"
  ]
}