{
  "id": 4846,
  "mediaId": 2548,
  "date": "2022-02-17",
  "headline": "Las Vegas Sun Quietly ‘Updates’ Piece Blaming Republicans For BLM Activist’s Assassination Attempt",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/02/GettyImages-1237399143-scaled-e1645115069468.jpg",
  "link": "https://dailycaller.com/2022/02/17/las-vegas-sun-updates-piece-blaming-republicans-blm-activists-assassination-attempt/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Silverio",
  "authorUrl": "https://dailycaller.com/author/nicole.dcnf@gmail.com",
  "termIds": [
    0
  ],
  "sentences": [
    "The editorial then argued that violent rhetoric by Republicans — specifically former President Donald Trump and Arizona Rep. Paul Gosar — has led to an “ugly and dangerous environment.”\nThe piece argued that the “GOP has largely fueled this problem” and the party “holds the lion’s share of the responsibility for addressing it.” (RELATED: Former Biden Campaign Staffer Tried To Blame Attempted Assassination On ‘Right-Wing Rhetoric,’ But Suspect Is Left-Wing Activist)\nCauthorn then argued that the editorial “explicitly” condemned violent rhetoric from both sides of the political aisle.",
    "https://t.co/oZ2lEl71Lq pic.twitter.com/JG9Td1kQ5d\n— Tom Bevan (@TomBevanRCP) February 16, 2022\n“While it’s been reported that the activist was involved in the Black Lives Matter and gun-safety movements and there has been no indication yet that he had ties to any right-wing organizations, the shooting comes amid a rise in threats against politicians fueled by increasingly violent rhetoric coming from extremist Republicans,” the updated issue reads.",
    "And our point about the way the rhetoric being used by some right wing extremists and some Republicans contributes to an environment in America where acts of political violence become more likely still stands.”\nThe editorial cited The New York Times’ recent piece “One Menacing Call After Another: Threats Against Lawmakers Surge,” which found that 75 indictments related to threats against politicians had been issued since 2016.",
    "Bob Cauthorn, the outlet’s chief operating officer, told the Daily Caller Thursday that the outlet updated their editorial, “Escalating hateful rhetoric leads nation down a dark, chaotic path,” to include alleged 21-year-old shooter Quintez Brown’s involvement in Black Lives Matter (BLM) and gun-safety movements after receiving several calls and backlash on social media.",
    "The editorial originally read: “While there’s been no indication yet that the activist had ties to any right-wing organizations, the shooting comes amid a rise in threats against politicians fueled by increasingly violent rhetoric coming from extremist Republicans.”\nHoly f*ck, @LasVegasSun.",
    "“Regardless of where the violence is coming from — the left, the right and the middle — it’s all a symptom of the dangerous environment being created by this hateful speech.”\nBrown has been charged with attempted murder and four counts of wanton endangerment.",
    "The outlet does not intend to change the remarks made about Republicans’ rhetoric inciting political violence because they did not explicitly link Brown to any conservative movements, Cauthorn told the Daily Caller.",
    "A section of the editorial called on Republicans and Democrats to stop talking about “civil war and killing politicians,” but continued to pin Republicans for their alleged normalization of violent rhetoric.",
    "“That can’t come as a surprise given that so many members of the Republican Party are trying to normalize violent speech by routinely including it in their public discourse.”\n“This has to stop.",
    "Everyone — Republicans and Democrats — needs to quit talking about civil war and killing politicians, or else what happened in Louisville will go on and on, ” the editorial said.",
    "The Las Vegas Sun quietly “updated” their Wednesday editorial to include an alleged shooter’s left-wing activism after blaming Republicans for the assassination attempt.",
    "“We did not contend the shooter was associated with Republicans or right wing or was responding directly to right wing calls to violence,” Cauthorn said.",
    "Black Lives Matter Louisville posted the alleged shooter’s $100,000 bail after partnering with the Louisville Community Bail Fund Wednesday.",
    "Brown opened fire Tuesday targeting Democratic mayoral candidate Craig Greenberg at his campaign headquarters in Louisville, Kentucky.",
    "This editorial was written after the alleged shooter, Quintez Brown, was identified as a left-wing BLM activist.",
    "“Not all of these threats are coming from the right, but the Times found that most were,” the editorial read.",
    "“We made that clear in all versions of the editorial.",
    "The shooting caused no fatalities or injuries."
  ]
}