{
  "id": 4964,
  "mediaId": 2690,
  "date": "2022-02-17",
  "headline": "EXPOSED: Manhattan Judge Denies Emergency Order For Hospital To Give Ivermectin To Dying Covid Patient",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/exposed-manhattan-judge-denies-emergency-order-for-hospital-to-give-ivermectin-to-dying-covid-patient-473372/",
  "mediaOutlet": "teapartyorg.ning.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Kotler said she would not grant the emergency request to force the hospital to administer the “risky” drug based on Quintero-Sherry’s “paltry” evidence and noted that using ivermectin would go against her husband’s doctor’s recommendations as well as the “medical community.”\n“Plaintiff would have this court order defendants to administer an unapproved treatment to her husband against defendants’ medical opinion rendered in the independent exercise of their professional judgment,” Kotler’s Tuesday decision reads.",
    "Apparently they are and that’s why a Manhattan judge has made the decision to block the use of potentially life-saving ivermectin for a COVID patient who is “on death’s doorstep.”\nThe judge says she will not force Mount Sinai Hospital, where Benjamin Chernyavsky (pictured here) has been admitted, to administer the drug after his wife Erika Quintero-Sherry brought a civil suit against the hospital on Jan. 26 seeking an emergency order to force their hand.",
    "He says it’s about saving lives: https://t.co/VDd6dAwxE0 @WTKR3 pic.twitter.com/10wf1cbj8I\n— Erin Miller (@Emiller_reports) November 18, 2021\nFun fact: Between 100-200 United States Congress Members (plus many of their staffers & family members) with COVID.. were treated by a colleague over the past 15 months with ivermectin & the I-MASK+ protocol at https://t.co/OvU8SLfLJq.",
    "“We are pleased with the judge’s decision to sustain the decisions of our clinicians to refrain from using ivermectin for treatment of COVID-19.”\n“Ivermectin has not been shown to be safe nor effective for the treatment or prevention of COVID-19, and the FDA has not authorized or approved this treatment for this use,” the statement continued.",
    "“Indeed, the record reveals that if prescribed ivermectin, Mr. Chernyavsky’s condition may very well worsen.”\n“The prevailing view in the medical community… is that ivermectin should not be prescribed,” Kotler said, noting that that is the opinion of the FDA, the Centers for Disease Control and Prevention and many other medical associations.",
    "Just sayin'\n— Pierre Kory, MD MPA (@PierreKory) October 8, 2021\nTo all the comments asking for sources/names for the below:\n1) This came from a highly credible source inside Congress who has asked to remain anonymous\n2) I would never divulge the medical treatments of individual members, nor do I know them myself\nI fully stand by this tweet.",
    "https://t.co/be2kBXAjHj\n— Aaron Kheriaty, MD (@akheriaty) November 18, 2021\nIt will change, they know it will change, but they want to turn the tyranny temperature up slowly so the frogs don’t know they’re boiling until it’s too late\n— Buck Sexton (@BuckSexton) October 22, 2021\nJaw dropping report just dropped by Project Veritas.",
    "https://t.co/Vt6UJ2K7sT\n— Pierre Kory, MD MPA (@PierreKory) October 8, 2021\nI submitted this FOIA request to the FDA: they now claim it will take them 55 years to release the data on which Pfizer's vaccine approval was based, though it only took them 108 days to review this data for the approval process.",
    "Kotler also mentioned testimony from a Mount Sinai doctor that Chernyavsky was probably not infected with COVID-19 anymore but rather “now must recover from the effects the disease has had on his body and organs.”\nThe judge shot down the emergency motion but the case is not through yet.",
    "This is fantastic: pic.twitter.com/PEgJqIXhSD\n— Clay Travis (@ClayTravis) October 14, 2021\nI testified in the SC Committee on Medical Affairs and gave the evidence base for these medications in the early treatment of the illness.",
    "https://t.co/i6eLcqnciX pic.twitter.com/O2d1zgTjAB\n— Aaron Siri (@AaronSiriSG) December 13, 2021\nThis is even more impressive when you learn the IVM users were older on average, with 30% >50 yo versus 20% for non-IVM users.",
    "“Mount Sinai is committed to providing the highest quality care to all of our patients and uses evidence-based data in our clinical decision-making,” a hospital spokesperson said in a statement.",
    "“Plaintiff’s paltry showing is insufficient to overcome the mountain of evidence showing that ivermectin is not presently safe or effective in the treatment of COVID-19,” Kotler wrote.",
    "Ivermectin has been proven time and time again in scores of “peer-reviews” studies (screenshot here) to be incredibly safe and has even been proven to be effective against COVID-19.",
    "The FDA could better use its resources to, I don’t know, publicly release the docs submitted by Pfizer to license its mandated liability-free V earlier than 75 years from now!",
    "pic.twitter.com/OqsXVH71n0\n— Peter McCullough, MD MPH (@P_McCulloughMD) February 14, 2022\nThe FDA is working with the post office to hold packages containing ivermectin.",
    "The real misinformation being spread about is coming directly from the very establishments who claim to have our best interests at heart and it truly is dangerous.",
    "#ExposeFaucihttps://t.co/nSTDrAmNcI\n— Rep. Paul Gosar, DDS (@RepGosar) January 11, 2022\nThe Project Veritas video is nothing short of amazing.",
    "Never before seen military Documents obtained by #ProjectVeritas about Gain of Function directly contradict Dr. Fauci testimony under oath.",
    "pic.twitter.com/K6D5naybCS\n— Simon Vallée (@sival84) December 11, 2021\nDr. Paul Marik arrives at the courthouse with tears in his eyes.",
    "No judge should have the right to make medical decisions for any American and neither should the FDA or hospitals for that matter.",
    "Joe Rogan asks Sanjay Gupta if it bothers him that CNN outright lied about Rogan taking horse dewormer to recover from covid.",
    "There were two days of hearings in the case last week which included testimony from two Mount Sinai doctors.",
    "#ExposeFauci https://t.co/JmhvG4WQTv\n— Candace Owens (@RealCandaceO) January 11, 2022\nCopyright 2022.",
    "Take control of your own health and don’t rely on the federal government to tell you what’s best.",
    "Manhattan Supreme Court Justice Lynn Kotler was not moved in favor of the plaintiff, however.",
    "Glad to see the AG step up as there are supportive data for select use in hospital as well.",
    "(TeaParty.org Exclusive) – Who knew that judges were trained in making medical decisions?",
    "The mortality reduction is even higher looking at different age groups.",
    "Everyone please head over to youtube and watch it in its entirety.",
    "Not only do they know the truth, they’re lying about it.",
    "Will stop pharmacists blocking RX to patients.",
    "What’s going on in the US is absolutely sick.",
    "These people are evil and outright liars.",
    "85% for 31-49 yo and 59% for >50 yo.",
    "It still must go through the court.",
    "None have gone to hospital.",
    "Americans need to wake up.",
    "New heights of absurdity.",
    "TeaParty.org"
  ]
}