{
  "id": 5242,
  "mediaId": 2890,
  "date": "2022-02-24",
  "headline": "One thing Democrats and Republicans agree on: “crippling” sanctions on Russia",
  "image": "https://cdn.vox-cdn.com/thumbor/27NKUwCPbU27nmvVFJnxOW--kYg=/0x16:3600x1901/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268951/GettyImages_1372586851.jpg",
  "link": "https://www.vox.com/2022/2/24/22948900/russia-sanctions-democrats-republicans",
  "mediaOutlet": "Vox",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Li Zhou",
  "authorUrl": "https://www.vox.com/authors/li-zhou",
  "termIds": [
    0
  ],
  "sentences": [
    "McConnell, though he stressed the need for a united front on sanctions, also said that he felt the administration’s handling of the Afghanistan withdrawal likely sent other leaders a message that the US is in “retreat.”\nThese arguments echo more explicit comments made by former President Donald Trump, who has praised Putin’s willingness to invade Ukraine and repeatedly denigrated Biden’s approach to this conflict.",
    "“I am committed to ensuring that the United States upholds our responsibility to exact maximum costs on Putin, the Russian economy, and those who enabled and facilitated this trampling of Ukraine’s sovereignty,” Sen. Bob Menendez (D-NJ), the head of the Senate Foreign Relations Committee, said in a Thursday statement.",
    "“The last few hours have laid bare for the world to witness the true evil that is Vladimir Putin,” Reps. Mike Rogers (R-AL), Michael McCaul (R-TX), and Mike Turner (R-OH), the top House Republicans on the Armed Services, Foreign Affairs, and Intelligence Committees, respectively, said in a Wednesday statement.",
    "Certain lawmakers, like Senate Foreign Relations ranking member Jim Risch, have focused on the need to counter Russia in their initial responses, while others used this opportunity to criticize Biden’s “weakness” on the issue and a third group questioned the US’s involvement in Ukraine at all.",
    "Sanction Russia’s energy sector - the engine of its economy - to its knees and reopen American energy production full throttle https://t.co/TftZiAGb8L\n— Josh Hawley (@HawleyMO) February 24, 2022\nLawmakers like Rep. Elise Stefanik (R-NY) and Sen. Lindsey Graham (R-SC) made similar statements.",
    "Every single available tough sanction should be employed, and should be employed now.”\nTheir statements follow Russia’s decision to begin a “special military operation” in Ukraine, which included missile strikes in major cities like Kyiv early Thursday morning local time.",
    "As Russian aggression has intensified, a small wing of the Republican Party — including members of the Freedom Caucus — has also pushed for an “America First” stance, which is seemingly less interested in American involvement in Ukraine.",
    "Taken together, these comments indicate that although many Republican leaders may be willing to back sanctions, they’re less likely to offer that same full-throated support to the Biden administration.",
    "Support for sanctions isn’t translating to support for Biden\nWhile the support for sanctions has been bipartisan, Republicans have been split when it comes to Biden’s handling of the Ukraine conflict.",
    "There’s widespread condemnation of Putin and support for aggressive sanctions\nDemocrats and Republicans have aggressively denounced Russia’s invasion and fully supported more severe sanctions.",
    "These sanctions are in addition to another tranche of restrictions Biden announced earlier this week, which already hit two major banks and sought to curb Russia’s access to foreign financing.",
    "Later in the day, however, he retweeted a post from Rep. Beth Van Duyne criticizing Biden’s approach to the Nord Stream 2 pipeline, which the administration waived sanctions for last year.",
    "On Thursday, President Joe Biden announced that the US would impose more aggressive sanctions on Russia’s financial institutions in the wake of its recent military attack on Ukraine.",
    "Lawmakers have urged the administration to impose sanctions on more banks and Russia’s ability to use Swift, a system that allows the country to engage in business with the West.",
    "“[Putin] was going to be satisfied with a piece and now he sees the weakness, the incompetence, the stupidity of this administration,” Trump said in a recent Fox News appearance.",
    "“We must enact debilitating sanctions on Russia and cut them off from the global economy,” House Intelligence Committee Chair Adam Schiff (D-CA) said in a Wednesday statement.",
    "The general unity Democrats and Republicans have on Russian sanctions marks a change in tone from recent weeks, when the parties couldn’t agree on when to impose penalties.",
    "“Joe Biden has shown nothing but weakness and indecision,” Sen. Josh Hawley (R-MO) said in a statement seemingly implying that the invasion of Ukraine was Biden’s fault.",
    "Biden also made clear in his remarks that the US would not be sending troops into Ukraine as part of its response, a move some lawmakers have expressed concerns about.",
    "House Minority Leader Kevin McCarthy was among those who put the emphasis on Russia and condemned Putin’s invasion as “reckless and evil” in a statement on Wednesday.",
    "“We’re all together at this point and we need to be together about what should be done,” Senate Minority Leader Mitch McConnell said during a press event on Thursday.",
    "He noted that the sanctions will not address Swift because certain European countries — including Italy and Germany — did not want to take that route just yet.",
    "Some Republicans have also floated the idea of adding additional sanctions to Russia’s energy exports, which would be debilitating to the country’s economy.",
    "The administration has resisted doing this, however, because of the consequences it could have on energy costs and supply in the US and in allied countries.",
    "Now lawmakers broadly agree on the need for harsh sanctions, though that consensus doesn’t necessarily extend to Biden’s handling of the conflict overall.",
    "In addition to the sanctions on Russian banks, the administration has also sanctioned the Russian company behind the Nord Stream 2 natural gas pipeline.",
    "Financial contributions from our readers are a critical part of supporting our resource-intensive work and help us keep our journalism free for all.",
    "“After just one year of a weak, feckless, and unfit president of the United States and Commander-in-Chief, the world is less safe,” Stefanik said.",
    "On Thursday, Biden said the US would impose new sanctions on four major banks and cut off Russia’s access to many high-tech imports.",
    "They also come after Congress failed to reach a compromise on sanctions earlier this month, ceding such authority to Biden instead.",
    "Not one American soldier should die there,” Rep. Paul Gosar, a Trump ally and member of this isolationist faction, previously said.",
    "That approach has the backing of many congressional Democrats and Republicans who’ve expressed support for “crippling” sanctions.",
    "“The sanctions proposed on all their banks have equal consequence, if not more consequence, than Swift,” Biden said.",
    "Thus far, the Pentagon has stationed US troops in eastern Europe to help process refugees and support NATO allies.",
    "“We’re going to stunt the ability to finance and grow the Russian military,” Biden said in his speech.",
    "Our mission has never been more vital than it is in this moment: to empower through understanding.",
    "Biden’s speech addressed some of these calls with its focus on additional financial institutions.",
    "A number of Trump-friendly members went further in their critiques of Biden.",
    "Millions turn to Vox to understand what’s happening in the news.",
    "That’s a penalty Ukrainian leaders have called for as well.",
    "Joe Biden has shown nothing but weakness and indecision.",
    "Please consider making a contribution to Vox today.",
    "Will you support Vox’s explanatory journalism?",
    "Now is the time to show strong purpose.",
    "“Ratchet the sanctions all the way up.",
    "“We have no dog in the Ukraine fight.",
    "Don’t hold any back."
  ]
}