{
  "id": 5345,
  "mediaId": 4040,
  "date": "2022-02-14",
  "headline": "AFPAC to Feature Old School White Nationalists, New School ‘Groypers’",
  "image": "https://files.rightwingwatch.org/uploads/Nick-Fuentes-2-AFPAC-2021.jpg",
  "link": "https://www.rightwingwatch.org/post/afpac-to-feature-old-school-white-nationalists-new-school-groypers/",
  "mediaOutlet": "Right Wing Watch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristen Doerer",
  "authorUrl": "https://www.rightwingwatch.org/post_author/kristen-doerer/",
  "termIds": [
    0
  ],
  "sentences": [
    "A graphic for the event featured the names and headshots of Peter Brimelow and Jared Taylor, two authors who have been designated white nationalists by the Southern Poverty Law Center, as well as Andrew Torba, the Christian nationalist founder of Gab, white nationalist YouTuber Vincent James, and Proud Boys hate group founder Gavin McInnes.",
    "Other speakers included:\nStew Peters, conspiracy theorist and far-right host of “The Stew Peters Show.”\nTim Gionet, a far-right troll who goes by the moniker Baked Alaska and is currently facing legal problems for his actions at the U.S. Capitol on Jan. 6 and a separate 2020 assault case.",
    "Last year, the conference hosted the likes of former Rep. Steve King, who was censured in 2019 for his comments on white supremacism before losing his bid for reelection in 2020, and Rep. Paul Gosar, who went on to speak at CPAC the morning following his speech at the extremist event.",
    "AFPAC, which is holding its third annual conference later this month on Feb. 25, is a white nationalist alternative to the more mainstream Conservative Political Action Conference, which is also being held in Orlando, Florida, the same weekend.",
    "She is also a producer on “The Stew Peters Show.”\nMichelle Malkin, a former Fox News contributor who said she earned the nickname “Mommy Malkin” when she stood up for “the stars of the burgeoning America First movement” like Nick Fuentes.",
    "He has denied the Holocaust, launched into antisemitic tirades, suggested interracial marriages cause drug use, and said women in the U.S. should be treated the way women are in Saudi Arabia or Afghanistan under the Taliban.",
    "In 2017, Fuentes took part in the white supremacist Unite the Right gathering in Charlottesville, Virginia, that left one dead; two years later, he sympathized with the El Paso shooter’s white supremacist manifesto.",
    "White nationalist youth leader Nick Fuentes announced Friday the line-up of speakers for the America First Political Action Conference, featuring old school white nationalists alongside “Groyper” contemporaries.",
    "Earlier in the month, Fuentes had hinted that Rogers—a Trump loyalist who has made a name for herself peddling the Big Lie that the 2020 election was stolen—could potentially attend AFPAC.",
    "Jesse Lee Peterson, a radical right-wing pastor who has praised neo-Nazis, called educated women “Satan’s daughter,” and claimed Black people have brought racism upon themselves.",
    "Lauren Witzke, a far-right commentator, conspiracy theorist, and failed Senate candidate who has bragged that she’s “a strong ally” of Fuentes’ “Groyper” movement.",
    "Fuentes, who founded America First, a white nationalist youth movement of self-proclaimed “Groypers,” announced the conference’s speakers on Telegram Friday night.",
    "The line-up was promoted on Twitter by the social media platform Gab, far-right and anti-Muslim activist Laura Loomer, and Arizona state Rep. Wendy Rogers.",
    "Last month, he was subpoenaed by the House select committee investigating Jan. 6 for his role in potentially coordinating events that took place that day.",
    "Cassandra Fairbanks, a far-right commentator who once lavished praise on the “Unabomber” and now works for right-wing internet personality Tim Pool.",
    "Patrick Howley, a far-right commentator, who has accused the GOP of “genociding” white people by welcoming conservative activists of color.",
    "Jaden McNeil, a former Kansas State University student who led a student organization called America First Students.",
    "Gosar, who like Rogers, has cheered on Fuentes, has not yet said whether he would attend.",
    "McNeil was widely condemned for racist comments he made about George Floyd.",
    "Fuentes also advertised two mystery speakers.",
    "Fuentes has a long history of extremism."
  ]
}