{
  "id": 5437,
  "mediaId": 2752,
  "date": "2022-02-23",
  "headline": "Everything You Need To Know About Russia And Ukraine Right This Second, Better Click Fast!",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTQxMjM2OS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY4NjY0MDkxNH0.cgdP4NseZ3PFHI_ujJZLFXq7k2Jl90JpLoy2zZAWVR8/img.jpg?width=1200&coordinates=0%2C6%2C0%2C184&height=600",
  "link": "https://www.wonkette.com/biden-russia-ukraine-sanctions-update",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Evan Hurst",
  "authorUrl": "https://www.wonkette.com/u/evan_hurst",
  "termIds": [
    0
  ],
  "sentences": [
    "“He’s setting up a rationale to take more territory by force, in my view … This is the beginning of a Russian invasion of Ukraine, as he indicated, and asked permission to be able to do from his Duma.” [...]\n“Who in the Lord’s name does Putin think gives them the right to declare new so-called countries on territory that belong to his neighbors?” Biden said.",
    "The European Union dropped a whole shitload of sanctions, and it sounds like theirs are particularly targeted at Russian oligarchs and public officials who like to enjoy the spoils of Europe's free societies and get their dicks waxed on their yachts in St. Tropez, but want to keep their mouths firmly affixed to the Putin teat at the same time.",
    "“It can no longer raise money from the West and cannot trade in its new debt on our markets or European markets either.”\nBiden explained that the sanctions he imposed yesterday are far bigger than what the Obama administration did to Russia in 2014 when it invaded and stole Crimea, and that this is by no means the end of it.",
    "The New York Times quotes Edward Fishman, an Obama administration State Department official:\nMr. Fishman said the administration’s move against one of the two targeted banks — VEB, the country’s main development bank — was the first time the United States had fully cut off a state-owned Russian financial institution.",
    "“This is a flagrant violation of international law and demands a firm response from the international community.”\nAll this came as just about everybody allied with America and Ukraine is starting to do its part to sanction Russia and cancel business with the rogue nation.",
    "Our allies, our adversaries, and neutral countries will all judge the West by our response — and plan their futures accordingly.”\nThe House Republicans even said that \"The U.S. and our allies must now make the Putin regime pay for this aggression.\"",
    "As Politico Playbook puts it, most Republicans who haven't \"defected to the Tuckerian view that Ukraine doesn't matter and Putin isn't so bad\" are MADFUCKINGMAD that Joe Biden hasn't done every single sanction available to him yet.",
    "The humanitarian consequences could be catastrophic.”\nMcConnell added that the threat would not stop with Ukraine, and that “all the free nations of the world” would be affected if Putin’s aggressions stood unchallenged.",
    "The response from American politicians and the way they've gotten behind our president and our Ukrainian allies continues to be functional and awesome, like we're a real country that does stuff and believes in stuff.",
    "Finally, here's a weird collection of 43 congressmen demanding that if the Biden administration at any point wants to commit troops to the Russia/Ukraine conflict, they must come to Congress for permission.",
    "Biden spoke from the White House yesterday, saying Russia's ongoing invasion of Ukraine is \"a flagrant violation of international law and demands a firm response from the international community.\"",
    "In a now-deleted tweet, Josep Borrell, the foreign policy chief of the EU, said there'd be \"No more shopping in Milan, no more parties in Saint-Tropez and no more diamonds in Antwerp.\"",
    "He announced a package of sanctions that included a \"full blocking\" of two big Russian state-owned banks, including VEB or Vnesheconombank, the Russian government's development bank.",
    "He expressed incredulity over who the fuck Putin even thinks he is right now:\n“To put it simply, Russia just announced that it is carving out a big chunk of Ukraine,” Biden said.",
    "“Every indication suggests [Putin’s] actions will almost certainly be used as a prelude to even further aggression and an even larger invasion,” McConnell said in a statement.",
    "You know, just your typical congressional cocktail hour, with Alexandria Ocasio-Cortez and Louie Gohmert and Pramila Jayapal and Matt Gaetz and Ayanna Presley and Paul Gosar.",
    "“I interpret that as a warning that the Biden administration is prepared to cut off other major Russian banks from the U.S. financial system,” Mr. Fishman said.",
    "The sanctions Biden announced yesterday aren't the whole shebang, but they're meant to be incremental, to save things for later when/if they become necessary.",
    "Of course, Germany stopped the scheduled opening of the Nord Stream 2 pipeline, and the EU is now talking about strategies to get off Russian energy for good.",
    "Gotta save some sanctions for later, else-wise you'll end up in a situation where Vladimir Putin does something evil and you ain't got no sanctions left.",
    "And that's what's going on with Russia and Ukraine and like such as, at least until new things happen and this post is out of date five minutes from now.",
    "President Joe Biden is saying the word \"invasion\" now about what Vladimir Putin is doing to Ukraine, and he's dropping sanctions all over the place.",
    "Of course there was a bunch of horseshit in there about Joe Biden being too weak, but at least they aren't all infected by Tucker yet.",
    "How old-school Republican, to be mad at the Democratic president for not blowing his entire war load at the same time.",
    "We weren't aware anybody actually thought we were going to put troops on the ground in Ukraine, but hey, JUST IN CASE!",
    "Time for your huge Wednesday Wonkette Russia/Ukraine update that hopefully won't be too huge!",
    "This morning it was announced new sanctions were coming from Australia, Canada, and Japan.",
    "\"You can expect bad things to come your way,\" he said to ... the Russian people?",
    "If you're not already, would you pls consider being the few thousandth and one?",
    "“That means we’ve cut off Russia’s government from Western finance,” he said.",
    "At least that's what we think the foreign policy calculation is here.",
    "Wonkette is funded ENTIRELY by a few thousand people like you.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "The UK is sanctioning members of the Russian Duma.",
    "\"I want a sanctions regime from hell next week!\"",
    "Count Lindsey Graham among the MADFUCKINGMAD.",
    "“If that occurs, many Ukrainians could die.",
    "The fact the tweet was deleted is no fun.",
    "How often would you like to donate?",
    "Bein' kind of a dick, Lindsey.",
    "But not too many sanctions.",
    "“The world is watching.",
    "Which was LOL.",
    "And more!",
    "he said."
  ]
}