{
  "id": 5484,
  "mediaId": 2658,
  "date": "2022-02-06",
  "headline": "Ottawa mayor: ‘Situation is completely out of control’",
  "image": "https://static.politico.com/49/35/be929e0f4c7fa44a2519602fe315/https-delivery.gettyimages.com/downloads/1238211488",
  "link": "https://www.politico.com/news/2022/02/06/ottawa-declares-state-of-emergency-convoy-protests-00006053",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1301,
    1481,
    2201,
    2673,
    4137,
    4890,
    5229,
    5371
  ],
  "sentences": [
    "| Minas Panagiotakis/Getty Images\nBy Andy Blatchford\n 02/06/2022 05:35 PM EST\nOTTAWA, Ontario — The mayor of Ottawa declared a state of emergency Sunday over convoy protests blockading Canada’s capital city that he says are “completely out of control.” The chair of the city’s police services board is warning the siege is part of a “nationwide insurrection.”\nAnd so far, Prime Minister Justin Trudeau has not said much of anything at all.",
    "The platform said in a statement that the decision was made after authorities provided evidence that “the previously peaceful demonstration has become an occupation, with police reports of violence and other unlawful activity.”\nGoFundMe initially said it would give money back to donors who request refunds and donate the rest to charities, before later announcing it would provide automatic refunds.",
    "On Saturday, high-profile Conservative MP Pierre Poilievre — viewed as an early frontrunner to replace O’Toole — officially announced his intention to run in the leadership race with a message that repeatedly used the word “freedom.” Poilievre, in contrast with O’Toole, was among members of the Conservative caucus who quickly embraced the truckers.",
    "Trudeau has said he won’t be intimidated by a “fringe minority.” But he hasn’t publicly commented since Thursday about a movement that authorities say includes extremist, far-right elements, pulls in significant cash from U.S. donors, has been applauded by former President Donald Trump and is drawing comparisons to Jan. 6.",
    "The demonstrators have set up barbecues and fire pits, amassed stockpiles of food, toilet paper and fuel, and hung banners everywhere with messages like “Freedom over Fear,” “Media is the virus” and “Fuck Trudeau.” They have even inflated bouncy castles on the street in front of Parliament for the kids.",
    "They have far more people than we have police officers.”\nLater Sunday, Watson announced the state of emergency due to the “serious danger and threat to the safety and security of residents.”\nThe “Freedom Convoy” began as a rallying point for Canadians opposed to vaccine mandates.",
    "The group started rolling big rigs, pickup trucks and other vehicles into Ottawa’s downtown core late last month around the Hill, where their incessant horn blasts and nighttime fireworks have terrorized the 24,000 locals who live in the vicinity.",
    "Canada’s trucker convoy has caught the attention — and financing — of public figures in the U.S.\nOttawa Police Chief Peter Sloly has said “a significant element from the United States” is involved in the funding and organization of the protest.",
    "“And that the idea of American dollars funding a group that seeks to oust said government might raise some questions here.”\nSince the convoy’s arrival, Ottawa has experienced another major political event.",
    "Ottawa police said it counted 500 vehicles Sunday in the city’s “red zone.”\nOntario Premier Doug Ford is now calling it “an occupation,” and it’s clear protesters are digging in for the long run.",
    "Over the weekend, he released a statement marking the Queen’s Platinum Jubilee, tweeted happy birthday to his daughter and sent congratulatory messages to medal-winning Canadian Olympians.",
    "Ottawa City Councillor Diane Deans, chair of the Police Services Board, said Saturday that the protesters are emboldened by the lack of enforcement by every level of government.",
    "Trudeau, who tested positive for Covid a week ago, has kept up virtual meetings but has not been seen in person on Parliament Hill, where government work has continued.",
    "His announcement quickly caught the attention of U.S. Rep. Paul Gosar (R-Ariz.), who retweeted Poilievre’s video with his own message: “Trudeau just got a competitor.”",
    "“As a Senator and patriotic (polite) Canadian, I hope you won’t mind if I point out we are a sovereign nation with a democratically elected government,” she wrote.",
    "O’Toole was criticized for oscillating on whether or not to meet with the truckers before he later joined some convoy participants away from the main protest site.",
    "The truck horns and diesel fumes were unavoidable Sunday for families who, despite the protest, went for a skate on the ice of the nearby Rideau Canal.",
    "“It is not something that anyone should enter in lightly.”\nSome protesters insist they’re staying put until governments get rid of Covid restrictions.",
    "But Ottawa police released a statement Sunday saying the force is investigating more than 200 calls to its hotline for hate-motivated crimes.",
    "On Wednesday, a rebellion of Conservative lawmakers forced out the party leader Erin O’Toole, Trudeau’s main parliamentary rival.",
    "“The situation at this point is completely out of control,” Ottawa Mayor Jim Watson told the 580 CFRA radio station on Sunday.",
    "But it has snowballed into an increasingly organized fight against Covid-19 public health measures and Trudeau himself.",
    "Truckers refuel their trucks in the cold during the \"Freedom Convoy\" truck protest on Feb. 5, 2022 in Ottawa, Canada.",
    "It also warned Sunday that anyone caught bringing supplies to the demonstrators, like gas, could now face arrest.",
    "Watson said that he’s in constant contact with his counterparts about resources and that they’ve been responsive.",
    "Trudeau told reporters on Thursday that he’d not had any requests to send the military into Ottawa’s streets.",
    "“One has to be very, very cautious before deploying military in situations engaging Canadians,” Trudeau said.",
    "Police, who were not enforcing bylaws at the outset, have started putting more pressure on the protesters.",
    "Organizers raised more than C$10 million on GoFundMe before the tech company halted the fundraiser Friday.",
    "Texas donors will get Justice!”\nPaxton’s announcement drew a response from Canadian Sen. Paula Simons.",
    "“Patriotic Texans donated to Canadian truckers’ worthy cause using GoFundMe,” Paxton wrote on Twitter.",
    "“What we’re seeing is bigger than just a city of Ottawa problem — this is a nationwide insurrection.",
    "The department said between Saturday and Sunday morning, officers issued more than 450 tickets.",
    "The provincial and federal governments have helped increase the police presence in the city.",
    "Smaller trucker demonstrations also took place in other major Canadian cities on Saturday.",
    "“This BLM-backing company went woke, froze the funds, & failed to deliver Texans’ money.",
    "“This group is a threat to our democracy,” she told an emergency public meeting.",
    "Today I assembled a team to investigate their potential fraud & deception.",
    "The company’s decision has angered U.S. lawmakers, including Florida Gov.",
    "This is madness.”\nThe demonstrations have not led to physical violence.",
    "“The individuals with the protest are calling the shots.",
    "Ron DeSantis and Texas Attorney General Ken Paxton.",
    "He didn’t mention Ottawa.",
    "Ottawa is not alone."
  ]
}