{
  "id": 5490,
  "mediaId": 2550,
  "date": "2022-02-02",
  "headline": "Rep. Adam Kinzinger brings a bazooka to Josh Hawley's knife fight",
  "image": "https://images.dailykos.com/images/1033246/story_image/Kinzinger_Hawley.jpg?1643821753",
  "link": "https://www.dailykos.com/stories/2078202",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2298,
    2923,
    3975,
    4087,
    872,
    878,
    1163,
    1171,
    5035
  ],
  "sentences": [
    "On Wednesday, news reports came out that Sen. Josh Hawley of Missouri—best known for being a truly abhorrent coward of a man—was “urging the Biden administration to drop any U.S. support for Ukrainian membership in NATO.” To many, this statement shows a very mysterious and frightening bit of similarity with the openly corrupt moves and policies of former President Trump and the associates he was forced to pardon.",
    "Unfortunately, we are living in desperate times and the only way that Cheney and Kinzinger can survive is to do the right thing and bring criminal charges to light about the complicity and the possible conspiracy by Republicans like Ted Cruz, Josh Hawley, Louie Gohmert, Mo Brooks, Marjorie Taylor Greene, Lauren Boebert, Matt Gaetz, Paul Gosar, and others, to overturn our democratically elected 46th President.",
    "The state he represents has recently proposed a law that would in essence make murder legal, and more specifically the kind of murder our history books more correctly term “lynching.”\nRep. Kinzinger and Rep. Liz Cheney are fighting for their political lives at this point in time.",
    "Along with Republican Rep. Liz Cheney of Wyoming, Kinzinger has become the main public target for the MAGA-wing of the Republican Party in the battle for power being waged between the old guard and the monster love child they have created.",
    "L to R: Rep. Adam Kinzinger, Sen. Josh Hawley\nAfter being one of only 10 House Republicans to vote for Donald Trump’s impeachment, Republican Rep. Adam Kinzinger of Illinois announced that he would be retiring from the House in 2022.",
    "Rep. Kinzinger made the mistake of believing that Trump would leave and that the rest of the GOP would rally around moving forward with their big donor list and the billionaires that support them.",
    "When Trump goes down I certainly hope this evil will be layed [sic] in the open for all to see, and be ashamed of.” Those are the kinds of phone typos one makes when one is fuming angry.",
    "He has called Republican Jesus, Ronald Reagan, “ancient history,” and saluted the prospective insurrectionists with what seemed to be a white power sign, the morning of January 6, 2021.",
    "A reminder, Rep. Kinzinger is still a large part of the problem, but he is fighting to wrestle it away from politicians who are somehow even more detestable than him and Liz Cheney.",
    "With a link to an article about Hawley’s position, Kinzinger wrote, “I hate to be so personal, but Hawley is one of the worst human beings, and a self egrandizing [sic] con artist.",
    "Rep. Kinzinger has the conservative qualities we have come to expect from GOP officials: he is willing to say some heavy shit to attack the people he perceives as his enemies.",
    "He is also one of the main Republicans on the House select committee to investigate what happened leading up to and around Jan. 6, 2021, at the Capitol in Washington, D.C.",
    "After cultivating Tea Party support back in 2010, Rep. Kinzinger has fallen out of favor with the fascist base the Tea Party movement has morphed into.",
    "Since he was 15-years-old, he has defended the indefensible, people like disgraced racist Los Angeles cop Mark Fuhrman, and the Oklahoma City bombers.",
    "The fact that former dark lord of the underworld, Dick Cheney’s daughter isn’t evil enough for the current crop of GOP operatives is terrifying.",
    "pic.twitter.com/vgvSOrIvvn\n— Marc E. Elias (@marceelias) January 13, 2022\nSen. Hawley has already said all of the quiet things out loud.",
    "They represent the previous GOP establishment that had a little more generational wealth attached to their version of white supremacy.",
    "Hawley would like those military members back in our country, protecting a selection of whites from Americans he doesn’t want voting.",
    "Up until [checks watch] Donald Trump and Paul Manafort, it was his political party’s position that Ukraine should be a part of NATO.",
    "To be clear, Sen. Hawley’s position on Ukraine isn’t some peacenik, let us deescalate tensions with Russia foreign policy idea.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "This means the GOP’s loudest, most obnoxious, and likely criminal sector of the Party, have named Kinzinger as their enemy.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "x\nHistory will remember that when democracy was at stake Adam Kinzinger voted against voting rights, by proxy.",
    "Rep. Kinzinger made a statement on Twitter that, while lacking nuance, is pretty goddamn amazing.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "This is a short blurb about Daily Kos.",
    "And he has always been this way.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}