{
  "id": 5546,
  "mediaId": 2664,
  "date": "2022-02-04",
  "headline": "RNC has ‘gone all-in on the insurrection’ while excusing ‘bigoted rantings’: Charlie Sykes",
  "image": "https://www.rawstory.com/media-library/reps-marjorie-taylor-greene-and-lauren-boebert.jpg?id=26058485&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/rnc-censure-kinzinger-cheney/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1726,
    1926,
    2201,
    2298,
    2906,
    2920,
    4087,
    4261,
    265
  ],
  "sentences": [
    "Conservative columnist Charlie Sykes published a hard-hitting column on Friday after the Republican National Committee's resolutions committee unanimously voted to censure Reps. Liz Cheney (R-WY) and Adam Kinzinger (R-IL) for participating in the House Select Committee to Investigate the Jan. 6 Attack on the U.S. Capitol.",
    "\"The timing of the resolution is notable — coming just days after Donald Trump dangled pardons for the Insurrectionists who tried to help him overturn the election, and just days after he threatened mass unrest if prosecutors try to hold him accountable.",
    "\"Nor was there even the slightest suggestion that perhaps the party should distance itself from the bizarre bigoted rantings of [Marjorie Taylor Greene] (R-GA), or Paul Gosar (R-AZ), or Lauren Boebert (R-CO), or Madison Cawthorn (R-NC),\" he wrote.",
    "It comes the week we learned of Trump’s push to have the government seize voting machines, and got more details about his plan to use faked and forged electoral vote certificates to force Mike Pence to overturn the election,\" he wrote.",
    "\"So let’s not put too fine a point on this: The Republican National Committee is fully embracing the Trumpian retconning of January 6 as a peaceful protest, and, in the process, has gone all-in on the insurrection itself.\"",
    "The conservative writer was shocked that the language of the resolution described the Jan. 6 rioters as \"ordinary citizens\" who were engaged in \"legitimate political discourse.\"",
    "Because, of course, this Republican party now has one standard, and one standard only: loyalty to the exiled Orange God King and his ongoing obstruction of justice.\"",
    "Sykes described the symbolic resolution as \"a performative act of groveling to the defeated, disgraced, twice-impeached former president.\"",
    "Despite Trump's ongoing lies about democracy, Sykes said that there was no discussion about a censure of the former president.",
    "\"And it came as Trump continued to ratchet up his lies about his electoral defeat.\"",
    "\"The purge came only for Cheney and Kinzinger."
  ]
}