{
  "id": 5563,
  "mediaId": 2590,
  "date": "2022-02-09",
  "headline": "House Jan. 6 Committee Subpoenas Former Trump Aide Peter Navarro",
  "image": "https://img.huffingtonpost.com/asset/6204417b2c0000b839df69b1.jpeg?cache=UQAo0mK8MT&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/house-capitol-riot-committee-subpoena-peter-navarro_n_62043b74e4b083bd1cb9870f",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sanjana Karanth",
  "authorUrl": "https://www.huffpost.com/author/sanjana-karanth",
  "termIds": [
    1694,
    1926,
    2201,
    2906,
    3151,
    3500,
    4174,
    1124,
    1163
  ],
  "sentences": [
    "pic.twitter.com/cUXdvcl2hP\n— January 6th Committee (@January6thCmte) February 9, 2022\nNavarro reportedly described the plan in his recently published memoir, “In Trump Time,” as the “Green Bay Sweep,” saying it was designed as the “last, best chance to snatch a stolen election from the Democrats’ jaws of deceit.” Navarro named the plot after the famous football play designed by 1960s NFL coach Vince Lombardi, in which a Green Bay Packers running back would ram into the end zone behind a “phalanx of blockers.”\nAccording to Navarro, Bannon played the role of the coach, while then-Vice President Mike Pence played quarterback.",
    "In January, Navarro told MSNBC’s Ari Melber that he saw “nothing but peaceful people” on the day of the insurrection, and that “we only wanted peace that day.”\nAdvertisement\nOn Wednesday, Navarro said in a statement that the subpoena was “leaked to key members of the press well before I received it.”\n“I refer this tribunal to Chapter 21 of ‘In Trump Time’ for what is in the public record about the Green Bay Sweep plan to [ensure] election integrity – the last three people on God’s good earth who wanted chaos and violence on Capitol Hill were President Trump, Steve Bannon, and I,” he continued.",
    "Bannon, who has been charged with criminal contempt for defying a subpoena from the subcommittee, told his podcast listeners the day before the insurrection: “So many people said, ‘Man, if I was in a revolution, I would be in Washington.’ Well, this is your time in history … We’re on the point of attack tomorrow … It’s game day.”\nThe House committee also cited a Daily Beast interview in which Navarro said Trump was “on board with the strategy,” as were “more than 100” members of Congress, including Rep. Paul Gosar (R-Ariz.) and Sen. Ted Cruz (R-Texas).",
    "“And, because you have already discussed these and other relevant issues in your recently published book, in interviews with reporters, and, among other places, on a podcast, we look forward to discussing them with you, too.”\nThe podcast in question was Navarro’s appearance on Bannon’s “War Room” in December, in which Navarro praised Bannon as a “hero” for coming up with the “strategy to go up to Capitol Hill” on Jan. 6, 2021.",
    "“For example, you, then a White House trade advisor, reportedly worked with Steve Bannon and others to develop and implement a plan to delay Congress’s certification of, and ultimately change the outcome of, the November 2020 presidential election.”\nThe Select Committee subpoenas former White House trade advisor Peter Navarro.",
    "Advertisement\n“Based on publicly available information and information produced to the Select Committee, we believe that you have documents and information that are relevant to the Select Committee’s investigation,” the committee wrote in the subpoena.",
    "You also released on your website a three-part report, dubbed the ‘Navarro Report,’ repeating many claims of purported fraud in the election that have been discredited in public reporting, by state officials, and courts,” the committee said.",
    "The committee is seeking records and testimony from Navarro, who, according to reporting, interviews, and his own book, was involved in efforts to delay election certification and change the results.",
    "The House select committee investigating the 2021 Capitol riot has subpoenaed Peter Navarro, who worked as a White House trade adviser to former President Donald Trump.",
    "The Supreme Court has ruled against Trump’s attempt to use executive privilege to shield documents the committee is seeking.",
    "In the subpoena sent on Wednesday, the committee demanded Navarro produce relevant documents and information by Feb. 23.",
    "Advertisement\n“That, of course, was not the first time you publicly addressed purported fraud in the election.",
    "Navarro also said that because Trump has invoked “executive privilege,” he cannot comply with the subpoena.",
    "The subpoena also requires him to testify before the committee on March 2."
  ]
}