{
  "id": 5566,
  "mediaId": 2662,
  "date": "2022-02-04",
  "headline": "YES! Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “We Need To Sue The Federal Government For Failing To Protect Us” (VIDEO)",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/kari-lake-trump-.jpg",
  "link": "https://www.thegatewaypundit.com/2022/02/yes-trump-endorsed-arizona-gubernatorial-candidate-kari-lake-need-sue-federal-government-failing-protect-us-video/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1513,
    2153,
    2201,
    3975,
    1256,
    4830,
    4976,
    5143
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nRecent AZ Fentanyl Seizures:\n1/19 – DPS @ Marana – 5 lbs of pills\n1/20 – DEA Phoenix – 4,000 pills\n1/27 – Avondale PD – 35,000 pills\n2/2 – Pinal County – 227,000 pills\n42% of pills contain a potentially lethal dose.",
    "WATCH: Arizona Gubernatorial Candidate Kari Lake: “DAY ONE – We Will Issue A Declaration Of Invasion”, Plans An Interstate Compact To Secure Southern Border\nThere is a crisis at Arizona’s southern border with Mexico, and Trump-endorsed Gubernatorial Candidate Kari Lake has a bold solution.",
    "Arizona GOP Candidate Kari Lake on OAN: Biden “Couldn’t Even Attract the Number of People at the Port-o-Johns” at a Trump Rally (VIDEO) … Continue reading\nDangerous drugs and criminals are pouring into Arizona communities as we speak.",
    "We need to build the wall, and first of all, we need to sue the federal government for failing to protect us, and while that lawsuit is working its way through the system, let’s go down and start building the wall.",
    "The Gateway Pundit reported on Kari Lake’s border policy, which will hold the federal government accountable and allow the states to take control of the deadly invasion.",
    "Kari Lake: I was down at the border, and within five minutes of arriving and stepping out of the vehicle, people were walking over under Joe Biden’s policy.",
    "— Lacy Cooper (@lacy_cooper) February 4, 2022\nIn a recent interview with Tim Pool, Kari Lake said that it is time to sue the Biden regime for its failures.",
    "Arizona Gubernatorial Candidate Kari Lake has a courageous plan to secure the U.S.-Mexico as the federal government fails to protect Arizona from invasion.",
    "They’re coming through a funnel, where there’s a gap in the President’s wall, and it is on federal land, but let’s build the wall anyway.",
    "President Trump’s policy, remain in Mexico policy was the best border policy I’ve ever seen in my 27 years covering Arizona.",
    "The federal government is abusing our tax dollars and relocating these illegal immigrants and drugs across our country.",
    "After covering news in Arizona as a career TV news anchor, Kari Lake has seen it all at Arizona’s southern border.",
    "We have many, many miles of Arizona state land we could be building an on, and let’s finish these little gaps.",
    "Lake recently spoke at President Trump’s Save America rally in Florence, Arizona.",
    "And Joe Biden came in on day one and pulled that, and now we’re seeing a crisis.",
    "I would welcome that challenge because he’s failing at his duty.",
    "Fentanyl is the leading cause of death for young Americans.",
    "The federal government is failing us in Arizona.",
    "— Paul Gosar (@DrPaulGosar) February 4, 2022",
    "What’s Joe Biden going to do?",
    "Arrest a sitting governor?",
    "It worked."
  ]
}