{
  "id": 5707,
  "mediaId": 2658,
  "date": "2022-02-08",
  "headline": "The Nein Stream 2",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/morning-energy/2022/02/08/the-nein-stream-2-00006511",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1550,
    3375,
    3589,
    3975,
    343,
    1174,
    1239,
    5287,
    5366
  ],
  "sentences": [
    "Some of Daniel-Davis’ supporters were irritated that Chair Joe Manchin (D-W.Va.) granted a second hearing, which a spokesperson for Sen. Ron Wyden (D-Ore.) told The Hill was “nothing more than an opportunity for Republicans to badger, bully and harass a well-qualified nominee for a job that needs to be filled.”\nAlso up in today’s confirmation hearing are Maria Robinson to be an assistant Secretary of Energy for the Office of Electricity and Joseph DeCarolis to be administrator of the Energy Information Administration.",
    "The utility industry has been supportive of the tax credits, which would underpin technologies such as energy storage, carbon capture, and long-distance transmission lines that would make it easier for companies to meet their emission targets, but was less vocal about the Clean Electricity Performance Program that Democrats were forced to strip from the climate package that would have penalized utilities that failed to generate more zero-carbon power.",
    "The secretary also reiterated that the administration was working with global natural gas providers to diversify Europe’s energy sources in the event “Russia turns off the spigot or initiates a conflict that disrupts the flow of gas through Ukraine.”\nBut rerouting natural gas from elsewhere still won’t stave off an energy catastrophe for Europe should it lose access to Russia’s gas, according to an analysis by energy intelligence firm Wood Mackenzie.",
    "NASDA CEO Ted McKinney echoed the sentiment, writing: “When considering the intricacies required to issue a rulemaking, especially one as complex as WOTUS, it would be irresponsible to continue the current rulemaking until the court provides guidance.”\nLANDER LEAVES: Biden’s top science adviser Eric Lander resigned from his post after POLITICO’s Alex Thompson reported that he bullied and mistreated staff.",
    "“The President has made it clear that building modern, climate-resilient infrastructure is key to his economic plan and to a clean energy future, and EEI’s member companies understand that we have a key role to play — and the opportunity of a lifetime — to build this clean energy future and to create more union jobs,” Kuhn added.",
    "Republicans on the committee remain opposed to her nomination, citing her role in the administration’s handling of federal oil and gas leases, and won’t be passing up this opportunity to again zero in on the administration’s energy policy, according to Sarah Durdaller, a Republican spokesperson for the committee.",
    "WRDA ON THE STREET: The Water Resources Development Act is up for a renewal this year, and the House Transportation and Infrastructure Committee's water subpanel will be hearing from local and tribal stakeholders on how the legislation has been implemented in the past and future priorities for its 2022 iteration.",
    "Follow us on Twitter\nMatt Daily @dailym1\nGloria Gonzalez @ggonzalez2176\nMatthew Choi @matthewchoi2018\nZack Colman @zcolman\nAlex Guillen @alexcguillen\nBen Lefebvre @bjlefebvre\nAnnie Snider @annelizabeth18\nKelsey Tamborrino @kelseytam\nCatherine Morehouse @cmorehouse10\nJosh Siegel @SiegelScribe\nFollow Us",
    "The American Farm Bureau Federation, National Association of State Departments of Agriculture and the National Cattlemen’s Beef Association all submitted comments Monday raising issues with the administration’s proposals to expand definitions set by the Trump-era Navigable Waters Protection Rule.",
    "House Science Chair Eddie Bernice Johnson and ranking member Frank Lucas had written to the White House asking to review the disciplinary investigation and for a briefing on steps the White House would take to make sure the Office of Science and Technology Policy was a healthy work environment.",
    "Blinken signed sanctions waivers on Iran Friday to prod the Iranian negotiators back to the bargaining table, though the administration adamantly affirmed it was not going back on sanctions until Iran comes back into compliance with the original nuclear deal, The AP’s Matthew Lee reports.",
    "Still, Scholz told reporters “our strict response is saying it will have very high prices if [Russians] intervene and that we work very hard to get a way out of this situation.”\nThe Biden administration isn’t mincing its words accusing Russia of using its energy supplies to coerce Europe.",
    "The Nein Stream 2\nBy MATTHEW CHOI\n02/08/2022 10:00 AM EST\nPresented by the Edison Electric Institute\nWith help from Josh Siegel\nEditor’s Note: Morning Energy is a free version of POLITICO Pro Energy’s morning newsletter, which is delivered to our subscribers each morning at 6 a.m.",
    "But for Republicans, it’ll also be a chance to grill Bonnie over a $1 billion program aimed at scaling up USDA’s role in combating climate change, Pro’s Meredith Lee reports, which they argue the department doesn’t have the authority to kick off without Congressional approval.",
    "On the Hill\nDANIEL-DAVIS DOUBLE DOWN: Laura Daniel-Davis, nominee to be Interior’s assistant secretary of Land and Mineral Management, faces the Senate Energy Committee again today in an unusual second round of questioning at the behest of ranking member John Barrasso.",
    "The big name on the panel taking their place Tuesday is Michael Mann, renowned climatologist, Penn State University professor and author of \"The New Climate War,\" which talks about fossil fuel company efforts to deflect blame for their contributions to climate change.",
    "The Edison Electric Institute, a lobby group for investor-owned utilities, organized the meeting, representing the highest profile move yet for the sector to get behind the $300 billion in tax incentives as the fate of the clean energy measures hang in the balance.",
    "Around the Agencies\nUTILITY CEOS TO PUSH FOR BBB: Electric utility industry CEOs will meet with Biden on Wednesday to advocate for Democrats to pass the clean energy tax credit piece of the Build Back Better agenda, EEI President Tom Kuhn told Pro’s Josh Siegel.",
    "As you might imagine, Ranking Member James Comer still thinks the probe is a waste of time, and will urge more focus on the Biden administration’s response to rising fuel prices than the actions of private companies, according to talking points shared with ME.",
    "It’ll also be a chance to flex the bipartisan infrastructure package, which provided funding for Army Corps of Engineers projects authorized under the 2020 WRDA, as well as highlight the need for appropriations to finance the corps’ full agenda.",
    "Beyond the Beltway\nOIL PRICES RELAX AS IRAN TALKS PROGRESS: Though tensions with Russia are still hot, last week’s oil rally appeared to cool, with Brent crude settling at $92.69 on Monday evening after reaching a seven-year high of $94.",
    "IF THE BOARD WON’T COME: The House Oversight Committee will be hearing from climate activists and experts on oil majors’ net-zero pledges today as part of Democrats’ probe into the oil industry’s messaging on its role in climate change.",
    "“Were all gas flows to stop today, existing gas storage would run out in 6 weeks; demand destruction would be massive; and if disruption was prolonged, gas inventory couldn’t be rebuilt through the summer,” writes analyst Simon Flowers.",
    "Not only would the continent need considerable alternatives to meet this winter’s demand, but it will also have to replenish reserves ahead of next winter to prevent an even worse fuel pinch than seen late last year.",
    "AG HIT BACK ON WOTUS: EPA’s proposed expansion of waters protected under the Clean Water Act got some frosty responses from the agriculture sector, one the biggest consumers of the nation’s fresh water.",
    "The scope of EPA’s authority under the Clean Water Act is currently the subject of a Supreme Court case that examines lower courts’ implementation of a previous SCOTUS framework for determining WOTUS.",
    "The rule was \"a clear, defensible rule that appropriately balanced the objective, goals, and policies of the Clean Water Act\" and agencies should have kept it in place, AFBF wrote in its comments.",
    "Today’s hearing was initially meant for board members of some of the country’s biggest oil firms, but they declined to attend, prompting committee leaders to schedule a make-up hearing next month.",
    "The House Natural Resources Committee will also meet today to discuss social justice in environmental policy making, focusing on the role of environmental groups and grantmaking foundations.",
    "Germany is the largest European buyer of Russian natural gas, and its government is leaning heavily into the energy source as it takes a nuclear-resistant approach to lowering emissions.",
    "OTHER HEARINGS FOR YOUR RADAR: The House Agriculture Committee will hear from USDA’s Robert Bonnie, one of the department’s top climate chiefs, as it reviews current farm bill programs.",
    "Secretary of State Antony Blinken said Russia has \"attempted to increase its energy leverage\" just as the continent most needs a \"stable energy supply to get people through the winter.\"",
    "House Appropriations Chair Rosa DeLauro released a stopgap funding measure to keep the government running at funding levels determined under the Trump administration through March 11.",
    "The House will be taking an 18-day break from floor action starting this week, pretty much kneecapping any chance to reach a substantive funding bill before the February deadline.",
    "The role was previously held by Rep. Paul Gosar (R-Ariz.), who was ousted from the committee after tweeting a video depicting him killing Rep. Alexandria Ocasio-Cortez (D-N.Y.).",
    "We all know of the $100 billion backlog of projects due to underfunding of the Corps for decades,” Chair Peter DeFazio plans to say, according to talking points shared with ME.",
    "Scholz stressed to CNN’s Jake Tapper on Monday night that the country was working to wean off of fossil fuel, and that reliance on Russian energy wouldn’t last forever.",
    "The ultimatum highlighted Germany and the U.S.’ divergent approaches to the Ukraine crisis, with German Chancellor Olaf Scholz declining to make a similar commitment.",
    "— DOI’s Laura Daniel-Davis faces the Senate Energy Committee yet again today after encountering steadfast Republican opposition at a confirmation hearing last year.",
    "PUNTING THE FUNDING FIGHT… AGAIN: On the topic of appropriations, temper any expectations of an omnibus agreement any time before funding runs out on Feb. 18.",
    "Windsor previously served as director of the Global Arctic Programme at the World Wildlife Fund and as WWF’s official representative to the Arctic Council.",
    "Driving the day\nBIDEN TAKES A HARD LINE: The Nord Stream 2 pipeline is going down if Russia invades Ukraine, President Joe Biden made clear Monday.",
    "Check out the POLITICO Energy podcast — all the energy and environmental politics and policy news you need to start your day, in just five minutes.",
    "“As we authorize new projects, the other side of that coin, as always, is ensuring that the Corps has the funding necessary to complete the work.",
    "And in the meantime, Scholz said his country was willing to “take steps that will have costs for us, ourselves” against Russia should it invade.",
    "Not investigating the implementation of pledges made by private companies that don’t even go in effect for almost 30 years,” he plans to say.",
    "Daniel-Davis’ previous confirmation hearing last year ended in a tie, with all Republicans voting against and all Democrats voting for.",
    "The group was also unsatisfied with the administration’s community outreach and the length of the comment period, which closed Monday.",
    "Senate Republicans urged the administration to hold off on finalizing its new rule until after the court finishes hearing the case.",
    "— Electric utility CEOs are meeting with Biden this week, pressing for clean energy tax credits included in the stagnant BBB bill.",
    "announced Monday that Rep. Blake Moore (R-Utah) will be taking over as top Republican on the committee’s oversight subpanel.",
    "The POLITICO Pro platform combines the news you need with tools you can use to take action on the day’s biggest stories.",
    "The news came after the White House insisted Lander would stay in his post while it addressed his behavior internally.",
    "Congrats to Beth Viola of Holland & Knight for knowing Otto Thaning is the oldest person to swim the English Channel.",
    "QUICK FIX\n— The Nord Stream 2 pipeline will get nixed if Russia invades Ukraine, President Joe Biden vowed Monday.",
    "The calming could be a factor of the progressing discussions on reviving an Iran nuclear deal, Reuters reports.",
    "— “EU lawmakers plan last-ditch effort to reject Brussels’ green investment rules,” via The Financial Times.",
    "Blinken made the remarks at a press conference Monday with European Commission Vice President Josep Borrell.",
    "— “Projects to Capture Carbon Emissions Get New Boost Despite Dismal Record,” via The Wall Street Journal.",
    "Movers and Shakers\n— Peter Winsor is slated to become executive director of the Alaska Wilderness League.",
    "“The Oversight Committee should focus on rooting out waste, fraud, and abuse in the federal government.",
    "U.S. standard West Texas Intermediate settled at $91.32 coming down from last week’s high of $92.63.",
    "HNR OVERSIGHT’S NEW TOP REPUBLICAN: House Natural Resources ranking member Bruce Westerman (Ark.)",
    "For more on Blinken’s appearance Monday, Pro’s Josh Siegel and Ben Lefebvre have you covered.",
    "— “Wind Giant Orsted Eyes Offshore Sites from California to Carolinas,” via Bloomberg.",
    "weighs Chevron request to take Venezuela oil for debt payments,” via Reuters.",
    "For today’s trivia: What is the Colombian president’s official residence?",
    "POLITICO’s Myah Ward takes you into Biden’s joint presser with Scholz.",
    "But German Chancellor Olaf Scholz didn't make the same commitment.",
    "Listen and subscribe for free at politico.com/energy-podcast.",
    "On today's episode: Will EPA strengthen its soot standard?",
    "Send your tips and trivia answers to mchoi@politico.com.",
    "Find me on Twitter @matthewchoi2018.",
    "Act on the news with POLITICO Pro.",
    "Pro’s Jennifer Scholtes has more.",
    "I’m your host, Matthew Choi.",
    "Read more from Alex.",
    "THAT’S ALL FOR ME!",
    "The Grid\n— “U.S.",
    "HAPPY TUESDAY!"
  ]
}