{
  "id": 5814,
  "mediaId": 2689,
  "date": "2022-02-02",
  "headline": "ALERT: This State Moves To Make Ivermectin Available To Consumers",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/alert-this-state-moves-to-make-ivermectin-available-to-consumers-473172/",
  "mediaOutlet": "teaparty.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "(TeaParty.org Exclusive) – The United States Food and Drug Administration really, really doesn’t want you to take Ivermectin as a form of treatment for the COVID-19 virus, posting pages of very detailed information online in a section called “Why you should not use ivermectin to treat or prevent COVID-19.”\nAccording to WND, the federal agency continues to insist this medication is dangerous, despite the fact it’s been prescribed for many years now as a means of treating various parasitic ailments, and the FDA warns that overdosing on Ivermectin can cause “nausea, vomiting, diarrhea, hypotension (low blood pressure), allergic reactions (itching and hives), dizziness, ataxia (problems with balance), seizures, coma and even death.”\n“That’s even though Dr. Theresa Lawrie, a U.K. medical doctor and research analyst who founded the British Ivermectin Recommendation Development initiative (BIRD International) suggested it has significant benefits against contracting, or dying from, COVID-19,” the report says.",
    "The report went on to say, “The pharmacist would also be required to provide any patients who receive ivermectin with a ‘standardized information sheet written in plain language’ that provides health care referral information and notes the importance of follow-up care.”\nLawmakers are also proposing that, “Nothing on the information sheet shall discourage the recipient from using ivermectin for the treatment of COVID-19.”\nNewsweek pointed out, “Republican State Rep. Leah Cushman, a sponsor of the bill and registered nurse, told Newsweek that she wanted to make sure residents of the state ‘have options for treatment of COVID-19.’ She also said that the burden of the virus on hospitals needs to be curbed, ‘and right now there are no early treatments being offered by most doctors.",
    "The sponsor of the plan, GOP state Sen. Amanda Chase spoke with National File and stated that Democrats “will legalize marijuana but prohibit the use of ivermectin and hydroxychloroquine for the treatment of COVID in a right to try state like Virginia.”\n“If Virginians are going to be given the right to try marijuana, then give them the right to try life-saving ivermectin and hydroxychloroquine,” she went on to say.",
    "He says it’s about saving lives: https://t.co/VDd6dAwxE0 @WTKR3 pic.twitter.com/10wf1cbj8I\n— Erin Miller (@Emiller_reports) November 18, 2021\nI submitted this FOIA request to the FDA: they now claim it will take them 55 years to release the data on which Pfizer's vaccine approval was based, though it only took them 108 days to review this data for the approval process.",
    "Just sayin'\n— Pierre Kory, MD MPA (@PierreKory) October 8, 2021\nTo all the comments asking for sources/names for the below:\n1) This came from a highly credible source inside Congress who has asked to remain anonymous\n2) I would never divulge the medical treatments of individual members, nor do I know them myself\nI fully stand by this tweet.",
    "https://t.co/be2kBXAjHj\n— Aaron Kheriaty, MD (@akheriaty) November 18, 2021\nIt will change, they know it will change, but they want to turn the tyranny temperature up slowly so the frogs don’t know they’re boiling until it’s too late\n— Buck Sexton (@BuckSexton) October 22, 2021\nJaw dropping report just dropped by Project Veritas.",
    "“Eduardo Balbona, an independent internist in Jacksonville, Florida, has helped dozens of seriously ill patients recover from COVID using the controversial but affordable, safe and effective drug, ivermectin along with other drugs and supplements which are not approved for COVID treatment,” the report said.",
    "'”\n“A commentary at the Gateway Pundit noted under the law ivermectin sold to consumers to use against COVID-19 would be ‘regarded as being issued for a legitimate medical purpose in the usual course of professional practice,'” WND stated.",
    "Fun fact: Between 100-200 United States Congress Members (plus many of their staffers & family members) with COVID.. were treated by a colleague over the past 15 months with ivermectin & the I-MASK+ protocol at https://t.co/OvU8SLfLJq.",
    "pic.twitter.com/K6D5naybCS\n— Simon Vallée (@sival84) December 11, 2021\nSo families desperate to save the lives of their loved ones are sneaking in Ivermectin and in many cases, noticing a vast improvement in their condition.",
    "https://t.co/i6eLcqnciX pic.twitter.com/O2d1zgTjAB\n— Aaron Siri (@AaronSiriSG) December 13, 2021\nThis is even more impressive when you learn the IVM users were older on average, with 30% >50 yo versus 20% for non-IVM users.",
    "After the 9-6 party-line vote there, Sen. Louise Lucas banged her gavel and proceeded to order police officers to remove doctors, family members of COVID patients, and others who came out in support of the legislation.",
    "“The National File noted that after the vote, the committee chairman, Lucas, posted a video on Twitter in which she vowed to form a Democratic ‘brick wall’ that will throw Republican bills in the trash.",
    "https://t.co/Vt6UJ2K7sT\n— Pierre Kory, MD MPA (@PierreKory) October 8, 2021\nJoe Rogan asks Sanjay Gupta if it bothers him that CNN outright lied about Rogan taking horse dewormer to recover from covid.",
    "Now a new report confirms that officials in one state are now trying to make it much easier for consumers to obtain this medication, despite the fact the FDA continues to stand by its dire warnings.",
    "The report stated lawmakers from the state of New Hampshire are now crafting legislation that would help provide consumers with access to Ivermectin through regular procedures at a pharmacy.",
    "The government helps Big Pharma make billions upon billions of dollars through the sale of the vaccine, while they get to prolong the pandemic and continue to usurp power from the people.",
    "The FDA could better use its resources to, I don’t know, publicly release the docs submitted by Pfizer to license its mandated liability-free V earlier than 75 years from now!",
    "pic.twitter.com/w7gRzk1PCa\n— L. Louise Lucas (@SenLouiseLucas) January 20, 2022\nOf course the left doesn’t want you to have access to this potentially life saving medication.",
    "However, the payments are contingent upon the hospital’s compliance with the approved treatment options as prescribed by the benevolent government,” the report continued.",
    "As a thank you for getting us to *27,000* engaged followers I want to share with you my plan- If you agree with the plan I need you to RT so we can save Virginia.",
    "“Newsweek said the plan is to let pharmacists dispense the treatment under the ‘delegated prescriptive authority of the physician’ and more,” WND reported.",
    "This is fantastic: pic.twitter.com/PEgJqIXhSD\n— Clay Travis (@ClayTravis) October 14, 2021\nDr. Paul Marik arrives at the courthouse with tears in his eyes.",
    "According to this report, families have been sneaking Ivermectin into loved ones in hospitals with COVID and are seeing an improvement in their symptoms.",
    "“What many people might not realize is that the federal government has been paying hospitals quite nicely for their treatment of COVID patients.",
    "#ExposeFaucihttps://t.co/nSTDrAmNcI\n— Rep. Paul Gosar, DDS (@RepGosar) January 11, 2022\nThe Project Veritas video is nothing short of amazing.",
    "Never before seen military Documents obtained by #ProjectVeritas about Gain of Function directly contradict Dr. Fauci testimony under oath.",
    "House Bill 1022 would allow pharmacists to dispense the drug to consumers through the use of standing orders, according to the report.",
    "As President of the Virginia Senate I have a plan of what to do with any bills that would roll back our progress.",
    "She illustrated her declaration by crumpling up a piece of paper and tossing it aside,” the piece reported.",
    "It doesn’t help the Democratic Party fulfill their deal with Big Pharma companies producing the vaccine.",
    "#ExposeFauci https://t.co/JmhvG4WQTv\n— Candace Owens (@RealCandaceO) January 11, 2022\nCopyright 2022.",
    "The FDA is working with the post office to hold packages containing ivermectin.",
    "The mortality reduction is even higher looking at different age groups.",
    "But the government doesn’t want you to have access to this medication.",
    "Everyone please head over to youtube and watch it in its entirety.",
    "85% for 31-49 yo and 59% for >50 yo.",
    "Treatments undermine that plan.",
    "None have gone to hospital.",
    "New heights of absurdity.",
    "That says it all, folks.",
    "Can’t have that, right?",
    "See how that works?",
    "TeaParty.org"
  ]
}