{
  "id": 5820,
  "mediaId": 2676,
  "date": "2022-02-03",
  "headline": "We can stop the white-collar insurrectionists from doing it again: Here's how",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/02/hawley-cruz-gosar-0202221.jpg",
  "link": "https://www.salon.com/2022/02/03/we-can-stop-the-collar-insurrectionists-from-doing-it-again-heres-how/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Noah Bookbinder",
  "authorUrl": "https://www.salon.com/writer/noah_bookbinder",
  "termIds": [
    0
  ],
  "sentences": [
    "In fact, the chasm between these insurrectionists and those who violently attacked the Capitol on Jan. 6 is minimal.One analysis found that the \"demographic profile of the suspected Capitol rioters is different from that of past right-wing extremists,\" including a significant percentage of business owners and white-collar professionals.",
    "With the anniversary of the Jan. 6 attacks now behind us, perhaps the most important question facing our nation is whether our systems of accountability are capable of punishing those who sought to overthrow our constitutional democracy — and preventing them from doing it again.",
    "But a close look at the text, history and function of Section 3 of the 14th Amendment makes clear that these white-collar insurrectionists should be banned from holding future office just as much as anyone who attacked the U.S. Capitol on Jan. 6, 2021.",
    "The fact that elected representatives exploited weaknesses in our election-result confirmation process, rather than weaknesses in the physical security of the Capitol, does not make their betrayal of our Constitution any less serious.",
    "Some may argue that President Trump, Rep. Paul Gosar, Sen. Josh Hawley, Sen. Ted Cruz and others did not engage in insurrection or rebellion because they did not personally use violence to try to deny Joe Biden the presidency.",
    "I'm talking about the people who tried, using legal theories, public and private pressure and official powers, to overturn an election — the powerful people who inspired the violent insurrectionists at the Capitol that day.",
    "Their secession and creation of the Confederate States of America were just as much acts of insurrection or rebellion against the Constitution as the shots that were fired when the war came.",
    "Those efforts come on top of tactics that have long undermined American democracy, such as the gerrymandering of political districts and new restrictions on the freedom of Americans to vote.",
    "Section 3 disqualifies an oath taker who has \"engaged in insurrection or rebellion against the same\" — meaning the Constitution — or has given \"aid or comfort to the enemies thereof.\"",
    "It is noteworthy that the terms \"insurrection and rebellion\" are not used in the abstract; rather it is \"insurrection or rebellion against the Constitution\" that is disqualifying.",
    "Section 3 of the 14th Amendment can and should be used to bar from future office anyone who engaged in insurrection against the Constitution after having sworn to defend it.",
    "The Constitution is a set of rules establishing a democratic system of government that only endures because of our collective, mutual agreement to adhere to those rules.",
    "to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.\"",
    "This is one of the few avenues we have left for preserving our Constitution from Trump and his supporters as they redouble their efforts to overturn our democracy.",
    "It's time for us to get serious about protecting our democracy from the people who sought to overturn the votes of the American people in a presidential election.",
    "In both 1861 and 2021, the proto-legal attempts to undermine the Constitution served as the rallying cry and justification for subsequent acts of violence.",
    "Section 3 of the 14th Amendment is a valid constitutional mechanism by which we can hold Trump and his fellow white-collar insurrectionists accountable.",
    "Ratified in the immediate aftermath of the Civil War, Section 3 bars any official from holding elected office who, \"having previously taken an oath .",
    "Section 3 of the 14th Amendment offers us an opportunity to hold those who tried to steal the 2020 election and keep Trump in office accountable.",
    "While physical violence did not begin until April 1861 at Fort Sumter, the insurrection against the Constitution preceded it by several months.",
    "We need members of Congress to support resolutions finding their colleagues or other officials in violation of Section 3 of the 14th Amendment.",
    "We can call this group, which includes former President Donald Trump and his cadre of congressional enablers, \"white-collar insurrectionists.\"",
    "Jan. 6, 2021, could not have happened without Trump and his congressional allies' refusal to acknowledge that Biden was the president-elect.",
    "The former president is endorsing candidates for secretary of state and other positions who are promising to overturn election results.",
    "The Civil War could not have happened without the refusal by Confederate States to acknowledge that Lincoln was their president-elect.",
    "Over the next two months, six more states followed, and they collectively formed the Confederate States of America in February 1861.",
    "State legislatures controlled by Republicans have enacted laws making it easier to overturn the will of voters across America.",
    "We need secretaries of state to preclude Donald Trump and other white-collar insurrectionists from appearing on a ballot.",
    "In response to Abraham Lincoln's election in November 1860, South Carolina seceded from the Union on Dec. 20, 1860.",
    "Applying the 14th Amendment to white-collar insurrectionists makes sense from a functional standpoint too.",
    "We need to stop those who violated the most sacred principles of our Constitution from doing it again.",
    "I am not talking about the people who stormed the U.S. Capitol building or assaulted police officers.",
    "There is no reason to exalt physical threats to our government over existential legalistic ones.",
    "If we fail to do so, we risk losing forever our system of government of, by and for the people.",
    "Insurrection against the Constitution cannot possibly be limited only to acts of violence.",
    "It must include efforts to undermine or undo the process by which it assigns power.",
    "Many of them already have faced, or soon will face, the justice they deserve.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Fortunately, the Constitution gives us a good way to do this.",
    "A white-collar insurrectionist is still an insurrectionist.",
    "Subscribe to our morning newsletter, Crash Course.",
    "The history of the Civil War supports this view.",
    "More on the struggle for the Constitution:",
    "This provision will not enforce itself.",
    "That phrasing matters.",
    ".",
    "."
  ]
}