{
  "id": 5993,
  "mediaId": 2676,
  "date": "2022-02-11",
  "headline": "Arizona Republican’s “disgusting” ad shows him shooting at Gabby Giffords’ husband Mark Kelly",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/02/gabby-giffords-mark-kelly-0211221.jpg",
  "link": "https://www.salon.com/2022/02/11/arizona-republicans-disgusting-ad-shows-him-at-gabby-giffords-husband-mark-kelly/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    0
  ],
  "sentences": [
    "The House last year voted to censure Rep. Paul Gosar, R-Ariz., after he shared an altered anime video depicting him killing Rep. Alexandria Ocasio-Cortez, D-N.Y.\n\"When a member uses his or her national platform to encourage violence, tragically, people listen,\" House Speaker Nancy Pelosi said at the time, warning that \"depictions of violence can foment actual violence, as witnessed by this chamber on Jan. 6, 2021.\"",
    "Kelly, who is running for a full term after winning a 2020 special election to fill the seat of the late Sen. John McCain, R-Ariz., is married to Giffords, a Democratic congresswoman who suffered a severe brain injury when she was wounded in a 2011 mass shooting in Tucson that also killed six people and injured many others.",
    "Arizona Republican Senate candidate Jim Lamon's Super Bowl ad shows him in a shootout with President Joe Biden, House Speaker Nancy Pelosi and Sen. Mark Kelly, D-Ariz., whose wife, former Rep. Gabby Giffords, was shot in the head and critically injured in an assassination attempt more than a decade ago.",
    "The campaign has raised just $600,000 from individual donors while Lamon, the founder of a solar energy company he recently sold to Koch Industries, has spent $10 million of his own money on his bid and vowed to spend $50 million by Election Day.",
    "Yahoo last month rejected a different digital ad from Lamon that echoed Donald Trump's debunked \"election rigging\" conspiracy theories over its use of the \"Let's go Brandon\" meme, the right-wing's viral euphemism for \"fuck Joe Biden.\"",
    "\"Once again, the Big Tech Oligarchs are interfering in elections and censoring conservatives,\" Lamon tweeted in response to the decision, adding the hashtag \"#LetsGoBrandon.\"",
    "Lamon's campaign is spending \"multiples of six figures\" on the ad, which is expected to air on NBC in Tucson during the Super Bowl, according to the Washington Post.",
    "\"Left wing snowflakes can't stand the fact that, for once, AZ will have a Senator who will shoot straight with them & stop cowering to Biden,\" he tweeted.",
    "Lamon posted the ad on Twitter, showing him dressed as an Old West sheriff coming to rescue a town from \"Old Joe,\" \"Crazyface Pelosi\" and \"Shifty Kelly.\"",
    "Gun control advocate Fred Guttenberg, whose daughter was killed in the 2018 Parkland school shooting in Florida, demanded Lamon pull the ad.",
    "Lamon also recently came under fire for falsely claiming to be an Arizona elector during Trump's crusade to overturn his election loss.",
    "The House committee investigating the deadly Jan. 6 Capitol riot recently issued subpoenas to 14 fake electors involved in the scheme.",
    "Fellow candidate Mick McGuire, the former head of the state National Guard, told the outlet that the ad showed \"poor judgment.\"",
    "Lamon was one of 11 Arizona Republicans who signed a document falsely certifying the state's electoral votes for Trump.",
    "The signatories claimed that they were the state's \"duly elected and qualified electors,\" which was obviously untrue.",
    "\"Absurd and desperate,\" Republican Senate candidate Blake Masters said in a statement to The Arizona Republic.",
    "It's time for a showdown,\" Lamon says, before shooting weapons out of the Democratic characters' hands.",
    "Shannon Watts, the founder of Moms Demand Action for Gun Sense in America, called the ad \"disgusting.\"",
    "This isn't the first time a Republican's video has depicted fictional violence against Democrats.",
    "This ad shows poor judgment and isn't reflective of the values of the Second Amendment.",
    "This ad will do more to boost Mark Kelly's fundraising than help Republicans.\"",
    "Lamon dismissed the outrage over his ad, vowing, \"I won't be backing down.\"",
    "Lamon told Vice News last month that the committee has not contacted him.",
    "\"Real violence and use of deadly force is no laughing matter,\" he said.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "\"Their feigned outrage over our new Super Bowl ad came right on cue.\"",
    "but said he would be willing to cooperate with their investigation.",
    "\"You owe Gabby & @CaptMarkKelly an apology,\" he tweeted.",
    "\"The good people of Arizona have had enough of you.",
    "Subscribe to our morning newsletter, Crash Course.",
    "\"Violence in America is real and it isn't funny.",
    "Lamon's Republican rivals also panned the ad.",
    "\"Of course,\" he said.",
    "\"Fits his campaign.\"",
    "\"Why not?\"",
    "Read more:"
  ]
}