{
  "id": 6106,
  "mediaId": 2752,
  "date": "2022-02-10",
  "headline": "Trump Quack Peter Navarro BEGGING For Contempt Of Congress Referral Please Baby Please!",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yODc0NTc4NS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY1NjY1ODQ3Mn0.hNk0ukcemWG1NIEMPkdxDX90YI5bg88zgKsBKenPs_M/img.png?width=1200&coordinates=0%2C189%2C0%2C189&height=600",
  "link": "https://www.wonkette.com/trump-quack-peter-navarro-is-jonesing-for-a-contempt-of-congress-referral-like-his-pal-steve-bannon",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Dye",
  "authorUrl": "https://www.wonkette.com/u/five_dollar_feminist",
  "termIds": [
    0
  ],
  "sentences": [
    "And if all this sounds familiar, it's because that bloody fool is already dancing the same dance with the Coronavirus Subcommittee, which subpoenaed him last month to explain his role in the supply chain debacle that had federal government ordering 63 million of doses of hydroxybonermectin and forcing states to bid against each other for ventilators and PPE.",
    "\"Not only is this a direct, proper, and explicit invocation of the executive privilege provided by a President of the United States as it relates to an important policy matter during his tenure in office,\" he continued, \"It is a direct order that I should not comply with the Subpoena based on the aforementioned Subpoena.",
    "\"I refer this tribunal to Chapter 20 of In Trump Time for what is in the public record about the Green Bay Sweep plan to insure election integrity — the last three people on God's good earth who wanted chaos and violence on Capitol Hill were President Trump, Steve Bannon, and I.\"",
    "As Chairman Bennie Thompson noted in the letter accompanying the subpoena:\nIn your book, you reportedly described this plan as the \"Green Bay Sweep\" and stated that it was designed as the \"last, best chance to snatch a stolen election from the Democrats' jaws of deceit.\"",
    "\"At this time, I am unable to respond to the Subpoena, based on former President Trump's invocation of executive privilege with respect to the very topic covered by the Subpoena,\" he tapped out on his own letterhead when subpoenaed by the coronavirus subcommittee.",
    "That sets Bannon up for an \"advice of counsel defense,\" i.e., he'll say \"I didn't have the requisite intent to break the law because I had a reasonable belief based on my attorney's opinion that I was entitled to give Rep. Bennie Thompson two big middle fingers.\"",
    "(He could, in theory, still hire a lawyer to stand between him and the January 6 Committee, although his statement of intent not to testify before he consulted with counsel would presumably undercut any future claim that he was just heeding his lawyer's advice.)",
    "He's made no secret of it, even going so far as to insist in his recently released book In Trump Time that their scheming exonerates the former president and his allies because the violence disrupted their plan to pressure Mike Pence to reject electoral votes.",
    "And, because you have already discussed these and other relevant issues in your recently published book, in interviews with reporters, and, among other places, on a podcast, we look forward to discussing them with you, too.",
    "\"Specifically, in response to the Subpoena, on November 20, 2021, President Trump stated 'I'm telling Peter Navarro to protect executive privilege and not let these unhinged Democrats discredit our great accomplishments.'\"",
    "You also released on your website a three-part report, dubbed the \"Navarro Report”, repeating many claims of purported fraud in the election that have been discredited in public reporting, by state officials, and courts.",
    "\"As the domestic terrorists running the January 6 partisan witch hunt are well aware, President Trump has invoked Executive Privilege; and it is not my privilege to waive,\" he shrieked in a statement to CNN.",
    "In an interview, you reportedly added that former President Trump was \"on board with the strategy, as were \"more than 100\" members of Congress, including Representative Paul Gosar and Senator Ted Cruz.",
    "So it's not exactly a surprise that the House January 6 Select Committee has finally subpoenaed that weirdo to testify on a topic which he's already monetized by discussing it in a book.",
    "Here's a hint: His statement to CNN concluded by accusing Speaker Nancy Pelosi, the Pentagon, and the Capitol Police of conspiring to \"leav[e] the perimeter unguarded.\"",
    "Because Bannon was smart enough to get a lawyer to put in writing that it was his legal opinion that his moldering client had the right to blow off the committee.",
    "He and Steve Bannon cooked up a plan they called \"The Green Bay Sweep\" and rounded up MAGA members of Congress to contest Biden electors from six swing states.",
    "Nor has he gotten any smarter, since he immediately pivoted to pointing to one of the many, many places where he's already waived that privilege.",
    "Peter Navarro, Trump's former econ crank, has been flapping his yap to anyone who will listen about his role in the events of January 6, 2021.",
    "Guess what Peter Navarro doesn't have if and when either of these committees refer him to the Justice Department for contempt of Congress?",
    "This is a guy who fancies himself an expert lay statistician, immunologist, and pharmacist, so naturally he's LARPing as a lawyer, too.",
    "But in case you were wondering who is dumber, Bannon or Navarro, the answer is unequivocally the guy with a PhD from Harvard.",
    "A normal person in receipt of a congressional subpoena would run not walk to the best DC lawyer he or she could afford.",
    "\"They should negotiate any waiver of the privilege with the president and his attorneys directly, not through me.\"",
    "Navarro can't put information \"in the public record\" and then refuse to talk about it in a particular venue.",
    "And even if you have a legitimate privilege claim, you still have to show up and assert it when subpoenaed.",
    "That of course was not the first time you publicly addressed purported fraud in the election.",
    "Here's that jumpy little freak boasting about it to a substantially unimpressed Ari Melber.",
    "Trump can't invoke privilege by simply saying, \"I'm telling Peter to keep his mouth shut.\"",
    "Nothing Navarro did in concert with Bannon is covered by executive privilege.",
    "Cheney and Kinzinger are useful idiots for Nancy Pelosi and the woke Left.\"",
    "And then he went on to tell the New York Times that \"Pence betrayed Trump.",
    "Good to know the old goat hasn't mellowed since he left the White House.",
    "Correct answers include: judgment, a filter, and friends in this town.",
    "And if you're ordering from Amazon, use this link, because reasons.",
    "Nor is it surprising that Navarro flipped his shit in response.",
    "Here on \"God's good earth,\" that's not how any of this works.",
    "Click the widget to keep your Wonkette ad-free and feisty.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "[Pence aide] Marc Short is a Koch Network dog.",
    "But Peter Navarro is no one's idea of normal.",
    "How often would you like to donate?",
    "Guess what else he doesn't have?",
    "Meadows is a fool and a coward.",
    "[sic]\"\nWell, no."
  ]
}