{
  "id": 6323,
  "mediaId": 2646,
  "date": "2022-02-09",
  "headline": "CONSEQUENCES: NC Rep. says Trump “may never be president again” if he gets disqualified first",
  "image": "https://occupydemocrats.com/wp-content/uploads/Screen-Shot-2022-02-09-at-1.26.42-PM-1024x531.jpg",
  "link": "https://occupydemocrats.com/2022/02/09/consequences-nc-rep-says-trump-may-never-be-president-again-if-he-gets-disqualified-first/",
  "mediaOutlet": "occupydemocrats.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Vinnie Longobardo",
  "authorUrl": "https://occupydemocrats.com/author/vlongobardo/",
  "termIds": [
    0
  ],
  "sentences": [
    "Rep. Cawthorn is in the unique position of being the first — and hopefully not the last — congressional Republican who may be deemed ineligible to serve in Congress based on Section 3 of the 14th Amendment to the U.S. Constitution which reads as such:\n“No person shall be a Senator or Representative in Congress, or elector of President and Vice President, or hold any office, civil or military, under the United States, or under any state, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any state legislature, or as an executive or judicial officer of any state, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.",
    "“We’ll probably go to the North Carolina Supreme Court and if they shockingly rule against us and they are actually just these liberal activists like we suspect they are then we’re probably going to have to take this case all the way to the United States Supreme Court and it’s going to be one hell of a ride.”\nCongressman Cawthorn had better get ready to hitch up his wheelchair to a tow truck because once the January 6th committee begins releasing all its findings regarding the planning behind the events of that fateful day, that ride may turn out to be n=bumpier than he anticipated.",
    "“The State has the same authority to police which candidates should or should not be disqualified per Section 3 of the Fourteenth Amendment.”\nWhile a ruling is still pending in the case before a federal court that was filed by Cawthorn pre-emptively to prevent his disqualification by the Board of Elections, it highlights the real risk facing all the GOP apologists for the insurrection who have arguably provided “aid or comfort” to the seditionists attempting to nullify a legitimate electoral result.",
    "But Congress may by a vote of two-thirds of each House, remove such disability.”\nThe possibility of Cawthorn’s disqualification for office became much closer to reality earlier this week when the North Carolina State Board of Elections asserted in a court filing that it has the power to block Cawthorn’s candidacy for re-election, saying:\nSponsored Links\n“States have long enforced age and residency requirements, without question and with very few if any legal challenges,” the board wrote.",
    "Advertisement Above\nAs the House Select Committee on the January 6th insurrection continues its work investigating the origins of the violent attack on the U.S. Capitol, the consequences for any member of Congress who might be revealed as being involved in the planning phases of the incursion are becoming increasingly obvious and concerning for the political futures of those suspected of offering aid and comfort to the enemies of democracy.",
    "So far, the legislator who has been most threatened by the fallout from the January 6th insurrection is not Rep. Marjorie Taylor Greene (R-GA), Rep. Paul Gosar (R-AZ), or Rep. Lauren Boebert (R-CO) — all notable apologists for the MAGA crowd that trashed the Capitol and smeared feces on its walls, with proven contacts with right-wing extremist groups.",
    "“This is going down a very dangerous path.”\nThe North Carolina Republican went on to claim that “Donald Trump will never be able to be president again” if the state’s election board ruled him ineligible to run for office again as if that would actually be a bad thing.",
    "Apparently backing Trump’s phony claims of election fraud in a scheme to unlawfully overturn the legitimate election results is not considered giving “aid and comfort” to the insurrectionists in Rep. Cawthorn’s book.",
    "Sponsored Links\nIn an appearance on the podcast of pardoned felon Steve Bannon, Cawthorn raised the specter of violence in response to attempts to remove him from the ballot.",
    "And apparently that — even though it’s a constitutionally protected right for me to do that as a congressman from North Carolina — they’re saying that that disqualifies me.",
    "“This is only going to lead to one place if you want to try and take the right of the people away to be able to vote for their elected official,” Cawthorn warned Bannon.",
    "Sponsored Links\nIt should come as no surprise that Cawthorn’s reaction to the North Carolina State Board of Elections’ declaration has been ominous and threatening.",
    "Cawthorn was unapologetic for his actions on January 6th, something that makes his disqualification for office all the more important in many people’s view.",
    "“They are specifically arguing that I engaged in insurrection or incited some kind of violence here on Jan. 6,” Cawthorn told Bannon.",
    "You can watch a clip of Congressman Madison Cawthorn on Steve Bannon’s War room podcast in the video below.",
    "I was very proud to debate on behalf of Wisconsin and try and block the electors in that state.",
    "“But unfortunately, we’re going to have to fight it, which is ridiculous,” Cawthorn continued.",
    "No, it is another one of the GOP’s freshman lawmakers, Congressman Madison Cawthorn (R-NC).",
    "“Now as you know, I was very proud to go speak at the Stop the Steal rally.",
    "Add your name to call on prosecutors to ARREST DONALD TRUMP for his crimes!",
    "Scroll down and let us know in our comment section!",
    "We want to hear what YOU have to say.",
    "Advertisements"
  ]
}