{
  "id": 6415,
  "mediaId": 2578,
  "date": "2022-01-30",
  "headline": "Paul Gosar: ‘We Have No Dog in The Ukraine Fight’ (EXCLUSIVE)",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/1-816.jpg",
  "link": "https://www.thegatewaypundit.com/2022/01/paul-gosar-no-dog-ukraine-fight-exclusive/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Assistant Editor",
  "authorUrl": "https://www.thegatewaypundit.com/author/assistant-editor/",
  "termIds": [
    1872,
    1926,
    3267,
    3975,
    1094,
    4811,
    5042,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nAdditionally, the Pentagon has placed 8,500 American troops on “heightened preparedness to deploy” to eastern Europe as tensions grow on the Russian border of Ukraine.",
    "Let’s be honest, Joe Biden doesn’t have the acuity to navigate this conflict and the same clowns at the Pentagon urging American intervention in Ukraine are utilizing the same stupid Rules of Engagement that caused losses in Viet Nam, Iraq and Afghanistan.",
    "In response, the ever-wrong Biden State Department has instructed the families of American diplomats in Ukraine to leave the country and authorized some embassy staff members to also depart, warning that an invasion could come at any time.",
    "Military interventionists push for war, as if we don’t remember the 7,000 dead American military members in Afghanistan and Iraq, and over 30,000 military veterans of Iraq and Afghanistan that have committed suicide since returning home.",
    "During the question-and-answer-session, Joe Biden created a full-blown international incident when, paraphrasing, he openly said he would be okay with Russia making a “minor incursion” into Ukraine.",
    "Nearly two million illegal aliens have been caught attempting to cross the border since Joe Biden took office, many with criminal records and others who are potential terrorists.",
    "And now the Biden administration is threatening to get us involved in a lengthy, dangerous and expensive war 5,000 miles away where there is no reason to be there.",
    "Thanks to Joe Biden, our borders remain open and we have been under a sustained and successful attack from those illegally entering the country in record numbers.",
    "Guest Op-Ed By Rep. Paul Gosar\nDuring a rare press conference appearance last week, Joe Biden came out of hiding and green-lighted a Russian invasion of Ukraine.",
    "Russia continues to amass a military buildup along Ukraine’s eastern border, something it has done for years, but this time appears to be more provocative.",
    "CBS News reported in August 2021 that we spent $2.2 trillion on these wars plus another “$6.5 trillion for wars in Iraq and Afghanistan” in interest.",
    "Meanwhile, Biden’s political advisors are itching to change the conversation from his abysmal record here at home and a failed socialist agenda.",
    "Joe Biden should be more focused on domestic issues, such as the immigration crisis and the invasion taking place along our own southern border.",
    "It remains a humiliating defeat for America, and leaders around the world know that under Biden, our country has a failed military leadership.",
    "Let me also be perfectly clear: not one American soldier should be shipped across the world to fight to protect the Russian-Ukrainian border.",
    "It’s rich hearing Mr. Biden discuss border integrity for Ukraine while our own southern border is wide open.",
    "How many good American soldiers are we to sacrifice there only to retreat in another humiliating defeat?",
    "Additionally, 8,000 American military contractors, almost all veterans, died in Iraq and Afghanistan.",
    "Biden abandoned thousands of citizens and $84 billion worth of top military weapons to the Taliban.",
    "Getting involved in a military situation with no U.S. interest is America Last, not America First.",
    "Not one American soldier should die there and not one American bullet should be fired there.",
    "This was perceived by allies and enemies alike, as a great sign of weakness by Mr. Biden.",
    "The Afghanistan defeat and withdrawal is still fresh in the minds of Americans.",
    "We just lost the war in Afghanistan to sandal-wearing goat herders.",
    "But it is a problem for Russia, the Ukraine, and eastern Europe.",
    "To be clear, what is happening in Russia is concerning.",
    "I assure you the Russian military is no joke either.",
    "No other country evacuated staff or family.",
    "Our leadership is the worst.",
    "It is a bad combination.",
    "Our troops are the best."
  ]
}