{
  "id": 6423,
  "mediaId": 2658,
  "date": "2022-01-25",
  "headline": "Anatomy of an ethics case",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/01/25/anatomy-of-an-ethics-case-00001720",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1436,
    2936,
    3499,
    3617,
    4777,
    262,
    743,
    1156
  ],
  "sentences": [
    "Anatomy of an ethics case\nBy KATHERINE TULLY-MCMANUS\n01/25/2022 07:43 AM EST\nPresented by Connected Commerce Council\nWith contributions from Sarah Ferris and Andrew Desiderio\nETHICS ON THE HILL… EXPLAINED— There were two big document dumps Monday, with eyebrow-raising ethics allegations against Democratic Rep. Marie Newman (Ill.) and GOP Rep. Doug Lamborn (Colo.), plus their rebuttals.",
    "The latest: Cisneros lassos new momentum in battle with bruised Cuellar\nCOMMERCE ON TOUR— Senate Majority Leader Chuck Schumer (D-N.Y.), a big champion of the bipartisan legislation targeting China and U.S. competitiveness, visited a home-state semiconductor research facility Monday, along with Don Graves, the deputy secretary at the U.S. Commerce Department, and New York Gov.",
    "He was thinking of Albany, home to Albany Nanotech, the state-owned computer chip research facility located across the street from the University at Albany that is home to companies like IBM, Tokyo Electron, Applied Materials, Samsung and Intel, as well as SUNY Polytechnic Institute,” writes Larry Rulison in The Times Union.",
    "EVENLY DIVIDED— When the Office of Congressional Ethics refers a case to the House Ethics Committee, which they did in the Newman and Lamborn cases, their report usually includes if they recommend further review because there is “substantial reason to believe” that the violation or for the committee to dismiss the matter.",
    "The boldest action the panel has taken in recent years was a decade ago, when in 2011 the panel referred the case of Nevada Republican John Ensign to federal investigators and released findings that he broke federal laws while trying to cover up an extramarital affair with a political aide.",
    "The talks revolve around Senate Foreign Relations Committee Chair Bob Menendez’s (D-N.J.) package of sanctions that would kick in after a Russian invasion; Republicans have pushed for more immediate sanctions, and Menendez is open to amending his bill in order to overcome a GOP filibuster.",
    "Three people spoke on condition of anonymity to POLITICO’s Betsy Woodruff Swan and Daniel Lippman about this new approach to event assessments, including examination of social media accounts of all participants of a meeting with a lawmaker, including Congressional employees.",
    "— A bipartisan deal on Russia sanctions has thus far been elusive, but a group of eight senators convened over Zoom on Monday night to hammer out a path forward on legislation that could deter an invasion of Ukraine, Alex Ward and Andrew scooped.",
    "There are differing views among experts about whether the House Ethics panel could continue investigations if a member leaves office, but in practice they tend to close inquiries when members under investigation resign from the House.",
    "“It’s not typical for a Democrat to insist he’d feel quite comfortable if the GOP adopts what his party fell short of accomplishing this month: changing the current rules to allow a top party priority to pass by a simple majority.",
    "RELATED:On the Brink of War With Russia, Ukrainians Are Resigned and Prepared, from The Wall Street Journal, For Ukrainian Soldiers, a Nervous Guessing Game on the Front, from The New York Times (great photos in both of these).",
    "And under the radar, Cisneros’ campaign has worked to make sure voters are aware of the probe, spending on a Facebook ad to promote an MSNBC story about the FBI raid, according to the platform's ad disclosure portal.",
    "With zero details from the FBI or Cuellar himself, the raid had put a freeze on the tight primary race — at least until last weekend, when Cuellar released a defiant ad signaling he was very much still in the race.",
    "INDEPENDENT, NON-PARTISAN— The Newman and Lamborn documents are reports and exhibits compiled by the Office of Congressional Ethics during their respective inquiries into allegations against the two lawmakers.",
    "Possible changes to the bill that were discussed on the call include additional security assistance and anti-propaganda measures, plus some immediate sanctions authorities that Republicans wanted to see.",
    "The office has jurisdiction to investigate alleged violations of a “law, rule, regulation or other standard of conduct.” The OCE was set up in 2008 to do preliminary reviews of allegations.",
    "Other key things to know: House Ethics usually puts investigations on pause if federal law enforcement or prosecutors get involved and let indictments take precedence over their inquiries.",
    "But the third-term Merkley argues the GOP is unlikely to benefit much from such a change to a talking filibuster, given its prime goals of tax cuts and judicial confirmations.",
    "Generally, referrals include recommendations for the use of subpoenas (as in both the the Lamborn and Newman cases) and roundups of information that the OCE could not obtain.",
    "TRIVIA\nMONDAY’S WINNER:Bobby McMillin correctly answered that River Farm, one one of George Washington’s five farms, is now American Horticultural Society’s headquarters.",
    "Here at Huddle we’ve seen some confusion, even among those on the Hill, about how ethics cases like these progress and thought a recess-week refresher might be in order.",
    "“The next allotment is intended to be used by Members and essential staff during the next two-week period in which the House will expect votes,” reads a staff memo.",
    "— The Capitol Police’s intelligence unit started digging into the backgrounds of lawmakers’ close contacts following the Jan. 6 insurrection, including Hill staff.",
    "TODAY’S QUESTION from Bobby: Which former senator told MSNBC’s Chris Matthews: \"I wish we lived in the days where you could challenge a person to a duel,\" he said.",
    "The Ethics Committee is the only House standing committee with membership evenly divided between each political party, with five Democratic and five GOP members.",
    "Several Cisneros allies told Sarah and Ally that they’ve seen a spike in donations and volunteer interest since the feds showed up in Laredo, Texas, last week.",
    "WHAT LAREDO RAID MEANS FOR A HOT PRIMARY — The Rep. Henry Cuellar (D-Texas) vs. Jessica Cisneros primary on March 1 was already one to watch in South Texas.",
    "But the Committee on Ethics holds the exclusive jurisdiction to find violations and impose punishment and can start investigations without an OCE referral.",
    "The OCE is a non-partisan entity that reviews allegations of misconduct involving House staff and lawmakers and refers cases to the House Ethics Committee.",
    "HUDDLE HOTDISH\nGetcha covid tests, here!— When’s the last time you scurried with great anticipation to a government cafeteria …school lunch pizza friday?",
    "In 2020 the Senate Ethics Committee received 144 reports of violations of Senate rules, with just zero resulting in disciplinary sanction of any kind.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Tuesday, January 25. Review your Ethics rules and keep your nose clean.",
    "MERKLEY IS STILL LOSING SLEEP— Sen. Jeff Merkley (D-Ore.) was awake at 3 a.m. last week, running through his mind if there was any way to sway Sens.",
    "Several Capitol Police intelligence analysts have raised concerns about the practice to the department’s inspector general, report Betsy and Daniel.",
    "Cisneros is working to strike a careful balance on Cuellar amid the ongoing investigation, according to multiple Dems familiar with the strategy.",
    "There was a “public letter of admonition” to Sen. Robert Menendez (D-N.J.) in April 2018 and one for GOP Sen. Tom Coburn of Oklahoma in 2012.",
    "The Soviet Union tried to buy it in 1971 to make it a dacha for their diplomats before Congress and the State Department intervened.",
    "Joe Manchin (D-W.Va.) and Kyrsten Sinema (D-Ariz.) on the filibuster, according to Burgess’ profile of the passionate progressive.",
    "On Friday, Jan. 28 in the Rayburn Cafeteria, the House will again be distributing at-home, self-administered covid test kits.",
    "The annual report summing up its activities for 2021 is expected soon, but don’t hold your breath for any big surprises.",
    "The combination cafeteria-test-pickup-site will be open 9 a.m. to 4 p.m. Friday, plus Monday and Tuesday next week.",
    "There’s usually an initial inquiry, followed by either a dismissal or an investigative subcommittee is impaneled.",
    "Rather than go straight into attack mode, Cisneros is limiting her public appearances and declining interviews.",
    "It operates behind closed doors and with little transparency, but does follow a pretty formulaic process.",
    "He sees Democrats as the long-term beneficiary even if Republicans make the first move,” writes Burgess.",
    "Lauren Baldwin is now a policy analyst for America First Policy Institute’s Center for American Values.",
    "TRANSITIONS\nJohn Weber is now deputy director of speechwriting for Speaker Nancy Pelosi (D-Calif.).",
    "Over on the Senate side, the Ethics Committee is mostly known for just how little action it takes.",
    "A letter of admonition is just a warning and not classified as an official disciplinary sanction.",
    "Now, Cisneros is answering back with her first TV ad of the cycle, obtained first by POLITICO.",
    "He most recently was national press secretary and political media strategist at the AFL-CIO.",
    "The panel has rarely taken action in recent years, and punishments are even more scarce.",
    "And her allies say there’s much more spending to come, plus high-profile endorsements.",
    "Much more to come on this, as the warnings of an invasion become more dire by the day.",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "“When Schumer wrote the USICA earlier this year, he was not thinking of Austin.",
    "She previously was a legislative correspondent for Rep. Paul Gosar (R-Ariz.).",
    "(That’s the big guns, where decisions can levy fines and other punishments.)",
    "TODAY IN CONGRESS\nThe House convenes at 10 a.m. for a pro forma session.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "GET HUDDLE emailed to your phone each morning.",
    "The OCE has a great guide on their process.",
    "AROUND THE HILL\nLooks like a quiet one.",
    "Send your answers to ktm@politico.com.",
    "The Senate is not in session.",
    "\"That would be pretty good.\"",
    "Well, this is different.",
    "The full story is here.",
    "BIPARTISAN RUSSIA DEAL?",
    "Then came the FBI raid.",
    "WHAT ABOUT THE SENATE?",
    "STAFFERS, SURVEILLED?",
    "GOOD MORNING!",
    "Kathy Hochul."
  ]
}