{
  "id": 6524,
  "mediaId": 2528,
  "date": "2022-01-27",
  "headline": "Tucker Carlson says he 'could care less' if people say he's a 'pawn of Putin,' as he echoes Russian propaganda on Ukraine",
  "image": "https://i.insider.com/61f2f9d3792e7300116bef02?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/tucker-carlson-says-he-could-care-less-if-people-say-hes-a-pawn-of-putin-2022-1",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Haltiwanger",
  "authorUrl": "https://www.businessinsider.com/author/john-haltiwanger",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Russia does have some legitimate security concerns, and European security arrangements could certainly do with fresh thinking and refurbishment after 30 years,\" Fiona Hill, who served as the top Russia advisor on the National Security Council under the Trump administration, wrote in a recent New York Times op-ed.",
    "\"My office is now getting calls from folks who say they watch Tucker Carlson and are upset that we're not siding with Russia in its threats to invade Ukraine, and who want me to support Russia's 'reasonable' positions,\" Democratic Rep. Tom Malinowski of New Jersey said in a tweet on Monday.",
    "But Carlson's portrayal of the Ukraine crisis whitewashes Putin's record of threatening its next-door neighbor and the wider region with violence, as he attempts to reestablish Russian supremacy in Eastern Europe that was lost when the Soviet Union collapsed.",
    "Meanwhile, Carlson has reiterated Russia's claims that NATO is to blame for the situation, ignoring the fact that Putin's history of aggression in the region is what pushed Ukraine closer to the West and the alliance in the first place.",
    "Chris McGrath/Getty Images\nThough he's an authoritarian who has taken anti-democratic steps to remain president for life while working against US interests at almost every turn, Putin has a certain appeal among the American right.",
    "Carlson's defense of Putin is part of a broader trend on the American right\n President Donald Trump and Russian President Vladimir Putin arrive at a joint press conference after their summit on July 16, 2018 in Helsinki, Finland.",
    "There are those in the American foreign policy community and beyond who question whether the alliance is an outdated relic of the Cold War, contending that Europe needs to update its security apparatus and priorities.",
    "Senate Minority Leader Mitch McConnell earlier this week said that Biden was moving in the \"right direction\" as the administration put 8,500 troops on heightened alert for a potential deployment to Eastern Europe.",
    "Indeed, many top GOP lawmakers in Congress are urging Biden to pursue a tougher approach against Russia, and the party generally stands in line with Democrats when it comes to showing strong support for Ukraine.",
    "Putin, who has been condemned by human rights groups over Russia's anti-LGBTQ policies, has been applauded by evangelical leaders in the US, like Franklin Graham, for defending \"traditional Christianity.\"",
    "But it remains an open question as to whether Carlson's ongoing coverage of the Russia-Ukraine crisis could push more Republicans to abandon this position and echo the Kremlin's talking points.",
    "Former President Donald Trump has often expressed admiration for Putin, controversially showering the Russian president with flattery on numerous occasions and defending him against criticism.",
    "Tom Malinowski (@RepMalinowski) January 25, 2022\nCarlson has continued to take Russia's side even as it refuses to pull troops away from Ukraine's border to help lower the temperature.",
    "Fox News host Tucker Carlson in a new interview with Axios said he hopes Republicans vote out any lawmaker \"who believes Ukraine's borders are more important than our borders.\"",
    "\"But a further Russian invasion of Ukraine and Ukraine's dismemberment and neutralization cannot be an issue for US-Russian negotiation nor a line item in European security.\"",
    "Russia has effectively created a geopolitical hostage crisis by threatening Ukraine with invasion, as it pushes the West into negotiations while refusing to withdraw troops.",
    "But the US and the alliance have made clear that NATO's open-door policy is not up for discussion, underscoring that countries should be free to choose their own alliances.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "The Russian government has frequently railed against NATO's expanding influence in Eastern Europe, while complaining about the alliance's military drills in the region.",
    "As Russia has gathered tens of thousands of troops along Ukraine's border in recent months, Carlson has defended Moscow amid fears the Kremlin is planning an invasion.",
    "Among other things, Moscow has insisted that Ukraine and Georgia — another former Soviet republic that Russia invaded back in 2008 — be barred from ever joining NATO.",
    "Russia invaded Ukraine in 2014 and annexed Crimea, and in the years since has supported separatists in a war against Ukrainian forces in the eastern Donbass region.",
    "Biden is mulling over sending troops to NATO member countries in Eastern Europe as a deterrent, but has been clear that he's not pursuing a conflict with Russia.",
    "\"NATO exists primarily to torment Vladimir Putin,\" Carlson said in December, while baselessly accusing President Joe Biden of pursuing a \"hot war\" with Russia.",
    "The US and its allies are concerned that Putin is vying to implant a pro-Kremlin government in Kyiv — threatening to destabilize the region in the process.",
    "The Fox News host, for example, recently said the Russian military buildup on Ukraine's border is just Putin trying \"to keep his western borders secure.\"",
    "Wolfgang Schwan/Getty Images\nCarlson's commentary on Ukraine has been aired on Russian state TV, and critics have accused him of enabling the Kremlin.",
    "Despite amassing a force of roughly 100,000 troops on the border of the former Soviet republic, the Kremlin claims it has no plans to invade Ukraine.",
    "\"I just want to go on the record and say I could care less if they call me a pawn of Putin,\" Carlson said in comments published by Axios on Thursday.",
    "As the US moves to resolve the present hostilities diplomatically, the Kremlin has made demands for binding security guarantees from Western powers.",
    "MIKHAIL METZEL/SPUTNIK/AFP via Getty Images\nUkraine in recent years has emerged as a geopolitical dividing line between Russia and the West.",
    "His rhetoric on Ukraine has been parroted by far-right Republicans like Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona.",
    "Carlson is influencing the GOP's position on Ukraine\n Ukrainian soldiers patrol on the frontline in Zolote, Ukraine on January 20, 2022.",
    "NATO, created in the wake of World War II to protect Europe against the Soviet Union amid the Cold War, is not without its critics.",
    "Trump, like Carlson, has been accused by experts of emboldening Putin and opening the door for further aggression against Ukraine.",
    "And after 20 years of the war on terror, there are many Americans who don't want to see the US drawn into yet another conflict.",
    "Though Ukraine has had its problems with corruption, it's a democratic country with close ties to the US and its top allies.",
    "But Carlson told Axios he isn't bothered by allegations that he's acting as a \"pawn\" for Russian President Vladimir Putin.",
    "Despite Carlson's claims, Biden has been firm that no US troops would be sent into Ukraine to fight Russia if it invades.",
    "A recent YouGov poll, for example, found 33% of Americans say the US does not have a responsibility to protect Ukraine.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "US Secretary of State Antony Blinken has likened the present crisis to Russia pointing a gun at Ukraine's head.",
    "Carlson ignores how Putin fomented the Ukraine crisis\n Russian President Vladimir Putin at a ceremonial event.",
    "Ukraine would be outmatched in a war with Russia, which has one of the most powerful militaries in the world.",
    "In 2016, white supremacist leader Richard Spencer said that Russia is \"the sole white power in the world.\"",
    "\"@TuckerCarlson loves him some Putin,\" Republican Rep. Adam Kinzinger of Illinois, said in a recent tweet.",
    "The US has sent weapons to Ukraine and warned Russia of severe economic consequences if it invades.",
    "All I care about is the fortunes of the United States because I have four children who live here.\"",
    "He's widely viewed as an enemy to democracy, and has directed interference in recent US elections.",
    "White nationalists in the US, who widely admire Carlson's show, have also praised Putin.",
    "A recent poll found that 62% of Republicans view Putin as a stronger leader than Biden.",
    "But none of these factors have prevented Carlson from continuing to take Putin's side.",
    "Fox News\nTucker Carlson told Axios he doesn't care if critics call him Putin's \"pawn.\"",
    "\"They're both foreign countries that don't care anything about the United States.",
    "Carlson has echoed Kremlin talking points in covering the Ukraine-Russia crisis.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Some Republican lawmakers are now parroting Carlson's rhetoric on the issue.",
    "Meanwhile, Putin is a strongman who has ruled over Russia for two decades.",
    "\"Why is it disloyal to side with Russia but loyal to side with Ukraine?\"",
    "Ukraine is not a NATO member, and the US is not obligated to defend it.",
    "As the most-watched host on cable news, Carlson has immense influence.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "And the Russian leader's opponents often end up dead or in prison.",
    "Russia, for its part, blames NATO for the contentious dynamic.",
    "Putin has accused the West of not respecting his \"red lines.\"",
    "But not all Republicans have adopted a pro-Putin stance.",
    "This rhetoric is near-identical to Kremlin propaganda.",
    "The Fox News host Tucker Carlson on December 7, 2021.",
    "Insider has reached out to Fox News for comment.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "I'm not that interested in Russia.",
    "Loading Something is loading.",
    "Carlson said on Monday night.",
    "I've never been to Russia.",
    "I don't speak Russian.",
    "\"It's too stupid.",
    "Kind of strange.\"",
    "—Rep."
  ]
}