{
  "id": 6587,
  "mediaId": 2690,
  "date": "2022-01-22",
  "headline": "Steve Bannon Drops Bombshell: Trump’s AZ Rally Is The Beginning Of 2020 Election ‘Decertification Process’",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/steve-bannon-drops-bombshell-trumps-az-rally-is-the-beginning-of-2020-election-decertification-process-472991/",
  "mediaOutlet": "teapartyorg.ning.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1926,
    2201,
    2405,
    2599,
    2975,
    2979,
    3500,
    3975,
    4830
  ],
  "sentences": [
    "— Liz Harrington (@realLizUSA) November 16, 2021\nWisconsin Election Commission knew they were breaking the law, but did it anyway\nWEC admitted Special Voting Deputies have to visit nursing homes & be witnessed by Dem & GOP observers, & \"the law prevents absentee ballots from being mailed\" to nursing homes without SVD visits pic.twitter.com/LxryuIBSsy\n— Liz Harrington (@realLizUSA) November 16, 2021\nWEC suggested letting nursing home staff help residents with ballots, even though that is against \"the way the law stands\"\nAfter WEC ordered nursing homes to break the law and not to let Special Voting Deputies in that's exactly what happened – staff filled out ballots for them pic.twitter.com/DO6PhiULtx\n— Liz Harrington (@realLizUSA) November 16, 2021\nWisconsin Election Commission literally told the state to BREAK ELECTION LAWS\n\"The other thing we did was told municipalities they didn't have to follow the state law when they were going to propose closing a polling place…\n\"We need to go back to following the law but…\" pic.twitter.com/5SKHPHwlff\n— Liz Harrington (@realLizUSA) November 16, 2021\nThe elderly mother's right to register to vote were REVOKED 5 years before the 2020 election after developing a degenerative brain disorder\nYet the son discovered his mother had “cast ballots in the Aug 11, 2020, Partisan Primary and the Nov 2020 General Election.”\n— Liz Harrington (@realLizUSA) November 16, 2021\nCopyright 2022.",
    "The number is over 500K when you add in inactive voters\n— Liz Harrington (@realLizUSA) December 8, 2021\nPLUS\n9,700 active voters registered prior to 2016 and never voted in any election, appeared as voting in 2020\nAnother 1,500 registered prior to 2011 and never voted, but are listed as voting in 2020\n\"Very unusual red flag, may indicate that votes are being cast in their names\" pic.twitter.com/d4ubfALlKG\n— Liz Harrington (@realLizUSA) December 8, 2021\n\"The irregularities and red flags indicate a huge potential for nefarious actors to access the WI Voter Registration system and allow them to manipulate any voter's status.\"",
    "This is all noise, that’s signal.”\nBizPac Review reports, “Incredibly, as of December, media outlets including CNN, ABC, NBC, The New York Times, The Washington Post, and the parent company of The Wall Street Journal have come to the defense of Steven Bannon and his efforts to have all documents related to Jan. 6 unsealed during his contempt of Congress case.”\n“I’m telling you right now, this is going to be the misdemeanor from hell for Merrick Garland, Nancy Pelosi, and Joe Biden,” Bannon asserted from outside the courthouse at the time of his indictment.",
    "pic.twitter.com/9FVZtKXQqS\n— Liz Harrington (@realLizUSA) November 16, 2021\nThe Wisconsin Election Commission voted 5-1 to order nursing homes to break election laws during a Zoom meeting that was only posted to the public 1 hour before the vote pic.twitter.com/Eb0wU2yk2o\n— Liz Harrington (@realLizUSA) November 16, 2021\nOnly one commissioner was concerned about ordering nursing homes to BREAK THE LAW\n\"The thing I'm afraid of is possible fraud in nursing homes…where you have whomever filling out these ballots…I think that's a problem.\"",
    "pic.twitter.com/Bo1Gi9c5AX\n— Liz Harrington (@realLizUSA) December 8, 2021\nhttps://twitter.com/SlayerWolf11/status/1466126593546358784\nThe Wisconsin Election Commission admitted it told election officials to break the law before and after the 2020 election\n\"I have had discomfort…the day I had first suggested this that we will be essentially telling the clerks to break the law.\"",
    "“What they’re doing is incredible: They’ve taken away their dignity, they’ve taken away their liberties, and I say enough is enough, and we are not going to take it anymore.”\nhttps://twitter.com/RSBNetwork/status/1482544511536484353\nAmericans are ready to take action to stop the damage being done by the Biden regime and the midterm elections are the perfect way to do it.",
    "@brnoforaz @BarnettforAZhttps://t.co/6xXQRZi3CW\n— We the People AZ Alliance (@WethePeopleAZA1) January 5, 2022\nHey MCTEC, do we always disassemble \"certified\" election equipment and leave it sit around for days?",
    "@brnoforaz @ConradsonJordan @FannKfann pic.twitter.com/jizit5X8QG\n— We the People AZ Alliance (@WethePeopleAZA1) January 5, 2022\nDidn’t Maricopa County say it was everyone else’s fault for not notifying them?",
    "Former Trump chief political strategist Steve Bannon said that he believes Trump’s weekend rally in Arizona could be the beginning of the “decertification process” of the 2020 fraudulent election.",
    "https://t.co/5qXH2ja7Lt\n— Karen Fann (@FannKfann) October 12, 2021\nExplosive hearing happening now in Wisconsin, on how Facebook CEO Mark Zuckerberg's CTCL interfered in the 2020 Election.",
    "Among the many speakers at President Trump’s Florence, AZ, rally were MyPillow CEO and fervent Trump supporter Mike Lindell, Rep. Paul Gosar (R-AZ) and Arizona state lawmaker Wendy Rogers.",
    "If the Democrats don’t lose in a massive red tsunami come November, we will officially know that elections in the US are no longer elections at all and that our country is gone.",
    "These decisions they’re making, they’re wrecking and devastating people’s lives, firing Americans from their jobs, forcing innocent children to grow up in masks,” he said.",
    "In November he was indicted on charges of contempt of Congress for disregarding a subpoena to appear before the legislative body and its sham Jan. 6 commission.",
    "In his post, Bannon included a link to a recent article from Insider where he detailed the many allegations of voter fraud in the 2020 election.",
    "100 Seats, 100 Years,” Bannon told his 789,000 followers on Gettr, the newest social media platform launched by former Trump aide Jason Miller.",
    "“Joe Biden ordered Merrick Garland to prosecute me from the White House lawn when he got off Marine One, and we’re going to go on the offense.",
    "— Liz Harrington (@realLizUSA) December 8, 2021\nIn Wisconsin, there are 119,283 \"active voters\" who have been registered for over 100 years!",
    "In typical Trump fashion, the former president took shots at Joe Biden and his regime’s totally un-American agenda during his rally.",
    "A huge speech in front of a massive crowd by Donald J. Trump and, of course, they’re all melting down about who’s on stage with him.",
    "They’re all people that are going to get to the decertification of the 2020 Biden electors,” Bannon read from the article.",
    "“We’ve had more problems, we’ve had more destruction than five presidents put together in the last year.",
    "“Decertification process is really kicking up next week in Arizona in the [state] Assembly,” he added.",
    "There was massive fraud and Democratic chicanery and the Arizona audit all but proved this to be true.",
    "“We are not turning purple,” she added, leading the crowd in a chant of “decertify” during the rally.",
    "The Democrats are facing certain defeat, that is, of course, if our elections are fair and free.",
    "Bannon remains a target of the radical left for his unwavering commitment to the truth.",
    "https://twitter.com/RexChapman/status/1459314849524109318\nAzsos Elections Manual pg 97.",
    "Wisconsin officials gave this access to Mark Zuckerberg's Dem operatives!",
    "(TeaParty.org Exclusive) – The 2020 presidential election was stolen.",
    "@MaricopaVote Was this properly secured and permanently identified?",
    "“The Decertification Process now starts; Campaign 2022 now starts.",
    "“We’re taking down the Biden regime,” he declared at the time.",
    "“Arizona is a red state,” Rogers proclaimed during the rally.",
    "We’re going to go on the offense on this,” he promised.",
    "“I want you guys to stay focused, stay on message.",
    "Sadly, no action has been taken, yet.",
    "We’re tired of playing defense.",
    "Remember, signal, not noise.",
    "“It’s the kickoff of 2022.",
    "Tune in to @OANN!",
    "TeaParty.org"
  ]
}