{
  "id": 6653,
  "mediaId": 6687,
  "date": "2022-01-31",
  "headline": "Eagle Forum PAC endorses Mo Brooks for U.S. Senate",
  "image": "https://yellowhammernews.com/wp-content/uploads/2021/08/Screenshot-3.png",
  "link": "https://yellowhammernews.com/eagle-forum-of-alabama-endorses-mo-brooks-for-u-s-senate/?utm_source=rss&utm_medium=rss&utm_campaign=eagle-forum-of-alabama-endorses-mo-brooks-for-u-s-senate",
  "mediaOutlet": "yellowhammernews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dylan Smith",
  "authorUrl": "https://yellowhammernews.com/author/Dylan@yellowhammernews.com/",
  "termIds": [
    0
  ],
  "sentences": [
    "He is a principled fighter, and now more than ever, we need leaders like him in the U.S. Senate.”\nBrooks in a statement touted Eagle Forum’s support of his candidacy and declared himself to be the “only proven conservative” in Alabama’s 2022 race for the U.S. Senate.",
    "Organizational support Brooks’ candidacy holds includes entities such as the Senate Conservatives Fund, Freedom Works for America, Americans for Legal Immigration PAC, Club for Growth, and the National Association for Gun Rights.",
    "“I look forward to Eagle Forum’s help carrying America, and us, to victory on May 24.”\nEagle Forum’s endorsement of Brooks adds the list of support his candidacy has received from numerous prominent elected officials.",
    "Rand Paul (R-Ky.), Ted Cruz (R-Texas), as well as U.S. Reps. Barry Moore (R-Enterprise), Marjorie Taylor Greene (R-Ga.), Matt Gaetz (R-Fla.) and Paul Gosar (R-Ariz.) have lent their support to Brooks’ campaign.",
    "Eagle Forum president Colleen Holcomb in a release hailed Brooks for what the organization deemed to be his efforts to advance the conservative movement’s agenda as a member of Congress.",
    "EDITOR’S NOTE: This article has been corrected from a previous version to reflect that Eagle Forum’s endorsement of Brooks was issued from its national political action committee.",
    "“We need bold leaders like Mo Brooks, who listen to their constituents, do their own homework and work hard to champion legislation that fixes problems instead of creating them.",
    "Over the course of nearly five decades, Eagle Forum has acted as a grassroots mobilization network to promote a number of conservative causes across the nation.",
    "The Eagle Forum on Monday announced its political action committee’s endorsement of U.S. Rep. Mo Brooks’ (R-Huntsville) bid for the U.S. Senate.",
    "We have worked closely with Mo since 2010 when he was first elected to Congress, and he has always kept his campaign promises.",
    "“We desperately need not just a Republican, but a Conservative majority in the U.S. Senate in 2022,” proclaimed Holcomb.",
    "Their endorsement helps confirm that I am the ONLY proven conservative in this Senate race,” asserted Brooks.",
    "Mo is not a go along to get along in Washington, D.C.",
    "Dylan Smith is a staff writer for Yellowhammer News.",
    "“I am thrilled by Eagle Forum’s strong endorsement!",
    "You can follow him on Twitter @DylanSmithAL",
    "We know he will do the same in the Senate.",
    "Former President Donald Trump, U.S. Sens."
  ]
}