{
  "id": 6691,
  "mediaId": 2664,
  "date": "2022-01-25",
  "headline": "Madison Cawthorn case could spell trouble for other ‘insurrectionists’ — including Trump: report",
  "image": "https://www.rawstory.com/media-library/madison-cawthorn-and-donald-trump.png?id=27361412&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/madison-cawthorn-2656478148/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Wright",
  "authorUrl": "https://www.rawstory.com/u/johnwright",
  "termIds": [
    1926,
    2201,
    3059,
    4261,
    4384,
    4537,
    4814,
    4830,
    4915,
    4984
  ],
  "sentences": [
    "The case against Cawthorn — who cheered on the Jan. 6 rioters — seeks to force him to prove that he's not an insurrectionist based on a little-known section of the 14th Amendment that was adopted to punish members of the Confederacy after they reclaimed their elected offices in Washington.",
    "\"Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, Paul Gosar of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "If an effort to disqualify Rep. Madison Cawthorn (R-NC) from the ballot is successful, it could lead to similar challenges against other lawmakers accused of fueling the Capitol insurrection — including former president Donald Trump.",
    "“It just so happens that Madison Cawthorn is the tip of the spear.”\nBopp nevertheless dismissed the case as \"frivolous,\" but Michael J. Gerhardt, a constitutional law professor at the University of North Carolina, disagreed.",
    "Even Cawthorn's attorney, James Bopp Jr., acknowledged that the case \"could pose a real threat to Mr. Cawthorn — and by extension, to others labeled 'insurrectionists' by liberal lawyers,\" according to the NYT.",
    "“And I think (this case) pass(es) the straight-face test.”\nRon Fein, one of the attorneys involved in challenging Cawthorn's eligibility, confirmed that his group is \"definitely going to file other challenges.\"",
    "Ultimately, those involved in the case could use Mr. Cawthorn’s example to try to keep Mr. Trump off the ballot in North Carolina, a key swing state, should he try for a presidential comeback in 2024.\"",
    "If one of their colleagues is disqualified for his role in encouraging the rioters, those hurdles might become easier to clear.",
    "\"If Mr. Cawthorn is labeled an 'insurrectionist,' that could have broader ramifications,\" the New York Times reported Tuesday.",
    "“There’s an old saying in law school, ‘Does it pass the straight-face test?’” Gerhardt said.",
    "“We have no specific names or dates to divulge just yet,\" Fein said.",
    "“They have multiple targets,” Bopp said.",
    "..."
  ]
}