{
  "id": 6805,
  "mediaId": 2676,
  "date": "2022-01-28",
  "headline": "Republicans splinter over Russia",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/01/michael-mccaul-tom-cotton-paul-gosar-tucker-carlson-0125221.jpg",
  "link": "https://www.salon.com/2022/01/28/splinter-over/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.salon.com/writer/jon-skolnik",
  "termIds": [
    0
  ],
  "sentences": [
    "As Cotton told Fox News on Sunday, the U.S. needs to be \"clear about the kind of sanctions we would impose on Russia's oil and gas and mining and minerals industries, how we'd cut them off from the international banking system, and that we all continue to try to provide the weapons that Ukraine needs to defend itself.\"",
    "Back in 2014, amid Russia's annexation of Crimea, numerous Fox News pundits and guests gushed over Putin's \"macho\" persona as compared to then-President Obama – a distinction that stemmed in large part from Obama's insistence on addressing the conflict diplomatically rather than militarily.",
    "Since then, Putin has become increasingly married to the notion that Ukraine fundamentally belongs to Russia, even though Ukraine has openly expressed its desire to join the North Atlantic Treaty Organization (NATO) – a move that would solidify the country's independence from Russia.",
    "One House Democrat this week said that his office has been bombarded with calls from folks who \"say they watch Tucker Carlson and are upset that we're not siding with Russia in its threats to invade Ukraine\" and want him to \"support Russia's 'reasonable' positions.\"",
    "According to The Intercept, House Democrats are quietly planning to push through a massive defense spending bill, with House Speaker Nancy Pelosi, D-Calif., reportedly looking to \"skip marking up the bill and move it straight to the House floor.\"",
    "But now, as Biden wrestles with yet another crisis abroad – Russian brinkmanship over Ukraine – Republicans are displaying a much less united front, with intra-party disagreements about how, when, and why the U.S. should engage in the conflict.",
    "Back in August, when the Taliban overran Kabul, marking an end to a multitrillion-dollar war spanning nearly twenty years in Afghanistan, President Biden was universally condemned by Republicans in Congress for \"botching\" America's withdrawal.",
    "Cotton also stressed that the American people \"care about what happens in Eastern Europe\" because \"it emboldens and encourages our adversaries everywhere if we simply look the other way when Vladimir Putin might invade Ukraine.\"",
    "President Biden is currently weighing a number of options to prevent Russia from waging a military incursion against Ukraine, including a U.S. military buildup that would station thousands American troops along the border.",
    "The standoff comes on the heels of ongoing tension between Russia and Ukraine starting back in 2014, when Russia began annexing large swaths of Crimea, a Ukrainian peninsula along the northern coast of the Black Sea.",
    "Still, the right-wing pundits and politicians have promoted a uncharacteristically broad range of different foreign policy postures, including military deterrence, sanctions, and even absolute isolationism.",
    "Rep. Mike Gallagher, R-Wis. a member of the House Armed Services Committee, likewise told The Washington Post that he'd support deploying an entire battalion of troops to Ukraine.",
    "The host has also directly blamed the conflict on Biden, accusing the president of instigating \"a hot war with Russia,\" even though the U.S. has yet to deploy any armed forces.",
    "On Tuesday, the U.S. said that it's prepared to impose sanctions and export controls on key sectors of the Russian economy, including microelectronics, banking, and energy.",
    "The U.S. has also threatened to impose severe economic sanctions if Russia invades, which could have calamitous effects on both the Kremlin's and regular Russian citizens.",
    "Over the past two weeks, Russian President Vladimir Putin has coordinated a massive military buildup of about 100,000 troops and weaponry along Ukraine's eastern border.",
    "Back in December, Fox News host Tucker Carlson, a GOP lodestar, openly expressed sympathy for Putin, arguing that \"NATO exists primarily to torment\" the Russian leader.",
    "On Capitol Hill, some Republicans appear to share Carlson's isolationist attitudes, suggesting that the U.S. should do nothing in response to Russian brinkmanship.",
    "More recently, Carlson asked his viewers on Monday \"who benefits\" from a potential war with Russia, suggesting that even sanctions should be off the table.",
    "\"Putin sees himself as a macho man who's going to do pretty much what he wants,\" now disgraced former host Bill O'Reilly said at the time.",
    "However, other members of Congress have assumed a more bellicose stance, implying that Biden should be gearing up for military deterrence.",
    "\"I think [Russia President Vladimir] Putin again smells weakness here,\" said Rep. Michael McCaul in an CNN interview this week.",
    "\"And if nothing else Russia knows that it would be a massive escalation if they are going against U.S. forces on the ground.\"",
    "\"Rather than threatening after an invasion takes place, we ought to be providing deterrents before an invasion takes place.\"",
    "The Pentagon has meanwhile put 8,500 troops on \"high alert\" to assist NATO in defending Ukraine in the case of an invasion.",
    "Instead, McCaul said, Biden should merely \"put things on the table like sanctions … arms sales, weapons sales to Ukraine.\"",
    "\"The United States certainly doesn't benefit, that's obvious to anyone who thinks about it for a second,\" he said.",
    "\"THERE SHOULD BE NO AMERICAN INVOLVEMENT IN UKRAINE,\" echoed Rep. Anthony Sabatini, R-Fla., that same day.",
    "But Rep. Michael McCaul, R-Tex., the top Republican on the House Foreign Affairs Committee, doesn't agree.",
    "RELATED: The U.S. drops an average of 46 bombs a day: Why should the world see us as a force for peace?",
    "Not one American soldier should die there,\" tweeted Rep. Paul Gosar, R-Ariz., on Saturday.",
    "As expected, Republicans have been broadly critical of Biden's handling of the crisis.",
    "His work has appeared in Current Affairs, The Baffler, and The New York Daily News.",
    "\"The president sees himself as a renaissance man who wants to accommodate.\"",
    "Imposing 'tough new sanctions' every few months feeds their moral vanity.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "To be sure, conservative sympathy for Russia is not entirely new.",
    "\"I think it puts Russia on the defensive,\" Gallagher said.",
    "\"We just lost Afghanistan to sandal wearing goat herders.",
    "I assure you [the] Russian military is no joke either.\"",
    "Jon Skolnik\nJon Skolnik is a staff writer at Salon.",
    "Subscribe to our morning newsletter, Crash Course.",
    "have also backed McCaul's middle-ground approach.",
    "\"We would be impoverished immediately overnight!",
    "Lindsey Graham, R-S.C., and Tom Cotton, R-Ark.",
    "MORE FROM Jon Skolnik • FOLLOW jonsskolnik",
    "\"Has nobody in Washington thought of this?",
    "\"We have no dog in the Ukraine fight.",
    "It makes them feel like good people.",
    "What fools they are.\"",
    "Apparently not."
  ]
}