{
  "id": 6813,
  "mediaId": 2569,
  "date": "2022-01-20",
  "headline": "Sunburn — The morning read of what’s hot in Florida politics — 1.20.22",
  "image": "https://floridapolitics.com/wp-content/uploads/2021/05/fpfavicon.png",
  "link": "https://floridapolitics.com/archives/487828-sunburn-the-morning-read-of-whats-hot-in-florida-politics-1-20-22/",
  "mediaOutlet": "floridapolitics.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Schorsch",
  "authorUrl": "https://floridapolitics.com/archives/author/peterdschorsch/",
  "termIds": [
    2338,
    2541,
    2749,
    3406,
    4182,
    4369,
    4668,
    863,
    4977
  ],
  "sentences": [
    "I’ll be staying in a different town or city every couple weeks\n— DAYS UNTIL —\n‘Ozark’ final season begins — 1; ‘Billions’ begins — 3; Red Dog Blue Dog charity event — 5; James Madison Institute’s Stanley Marshall Day Celebration in Jacksonville — 8; XXIV Olympic Winter Games begins — 15; Super Bowl LVI — 24; Will Smith’s ‘Fresh Prince of Bel-Air’ reboot premieres — 24; Discover Boating Miami International Boat Show begins — 27; season four of “The Marvelous Mrs. Maisel’ begins — 27; Synapse Florida tech summit begins — 28; ‘The Walking Dead’ final season part two begins — 31; Daytona 500 — 31; Special Election for Jacksonville City Council At-Large Group 3 — 34; CPAC begins — 35; St. Pete Grand Prix — 36; Joe Biden to give State of the Union — 40; ‘The Batman’ premieres — 43; the third season of ‘Atlanta’ begins — 62; season two of ‘Bridgerton’ begins — 64; The Oscars — 66; Macbeth with Daniel Craig and Ruth Negga begin performances on Broadway — 68; Grammys rescheduled in Las Vegas — 73; federal student loan payments will resume — 101;’ Doctor Strange in the Multiverse of Madness’ premieres — 106;’ Top Gun: Maverick’ premieres — 127;’ Platinum Jubilee’ for Queen Elizabeth II — 133;’ Thor: Love and Thunder’ premieres — 170; San Diego Comic-Con 2022 — 181; Michael Mann and Meg Gardiner novel ‘Heat 2’ publishes — 201; ‘The Lord of the Rings’ premieres on Amazon Prime — 225;’ Spider-Man: Into the Spider-Verse’ sequel premieres — 260; ‘Black Panther 2’ premieres — 295; ‘The Flash’ premieres — 298; ‘Avatar 2' premieres — 330;’ Captain Marvel 2' premieres — 393;’ John Wick: Chapter 4' premieres — 428; ‘Ant-Man and the Wasp: Quantumania’ premieres — 554;’ Dune: Part Two’ premieres — 638; Opening Ceremony of the 2024 Olympic Games — 918.",
    "Before passing the bill, the Senate Health Policy Committee agreed to tag on an amendment that reworded the proposal to prevent what Bean called a “scope creep.”\n—“Senate Health Policy Committee passes three bills, defers action on three others” via Christine Jordan Sexton of Florida Politics\n“Out with COVID-19, Darryl Rouson’s peers move peer counseling bill through committee” via Christine Jordan Sexton of Florida Politics — Republican and Democratic senators said they are all behind an effort by Sen. Rouson to make it easier for former addicts to serve as counselors for those dealing with substance abuse problems.",
    "It wants to keep the details secret” via Ben Conarck and Ana Ceballos of the Miami Herald — Florida’s prison officials are asking legislators to enact more layers of secrecy around the state’s method of executing Death Row inmates, floating a bill that would make confidential any records that “could reasonably lead to the identification of any person or entity participating in an execution.” The measures would allow the Florida Department of Corrections to obscure the supply chain behind the unique cocktail of drugs used in its lethal injections.",
    "With the Trump administration, Barr faced an unrelenting barrage of issues, such as Russiagate, the opioid epidemic, Chinese espionage, big tech, the COVID-19 outbreak, civil unrest, the first impeachment, and the 2020 election fallout.”\n“Opera singer accepts insanity plea in Mar-a-Lago breach” via The Associated Press — The Connecticut opera singer who drew law enforcement fire when she sped through a checkpoint outside then-President Trump’s Mar-a-Lago home in Florida has been found not guilty by reason of insanity.",
    "After all, we know that the best way to actually promote economic growth is by ensuring that everyone is competing fairly.”\n“Bill to protect farmers’ tax benefits amid growing agritourism clears makes way in Senate, House” via Kelly Hayes of Florida Politics — The Senate Agriculture Committee unanimously approved legislation Wednesday morning that seeks to ensure the state’s growing agritourism industry doesn’t interfere with farmers’ preferential tax benefits.",
    "“Scott Carnahan refutes Georgia residency” via the Citrus County Chronicle — County Commissioner Carnahan and his spouse had filed and qualified for a homestead exemption in Georgia from March 19, 2021, until the pair requested the exemption be removed because they were moving to Florida, according to the records obtained from the Grady County, Georgia, Board of Tax Assessors Office, and verified through a spokeswoman with its office.",
    "— D.C. MATTERS —\n“Senators are sparring over Democrats’ legislation, and their own rules.” via Carl Hulse and Jonathan Weisman of The New York Times — Democratic Senators pleaded for passage of far-reaching federal voting rights protections, painting state measures imposed by Republican legislatures curtailing access to the ballot box as a threat to democracy so dire that long-standing filibuster rules should be changed to enact them.",
    "Then DeSantis jumped in with a threat” via the Miami Herald editorial board — DeSantis’ surprise move this week to submit his own aggressively partisan proposal for redrawing congressional district lines in Florida, one that goes farther to protect GOP interests than any map the Legislature was considering, is an indication of just how far he’ll go to tighten his grip on the state’s Republicans and secure a possible White House bid.",
    "Ever eager to protect his turf and with an eye on 2024, Trump has gossiped with certain confidants and advisers about DeSantis’ political vulnerabilities and “weaknesses.” On several occasions, the twice-impeached former President has lately told associates that if they’re asked about the DeSantis-Trump tensions on TV, they should decline to confirm or deny the existence of a simmering cold war between the two conservative icons.",
    "— TOP STORY —\n“Donald Trump spent weekend stewing that ‘wiseguy’ Ron DeSantis won’t kiss his ring“ via Asawin Suebsaeng and Adam Rawnsley of Yahoo News — In recent weeks, if you’ve run in the ex-President’s inner circle or floated in and out of his social or political orbits, chances are high that you’ve heard Trump casually insulting DeSantis, even in conversations that initially had absolutely nothing to do with DeSantis.",
    "“Florida Power & Light class action opens door to subrogation, future storm claims” via William Rabb of Insurance Journal — A Miami judge’s certification of a lawsuit against Florida’s largest utility company as a $10 billion class action, with damage claims from more than 4 million people who lost power in Hurricane Irma, could have significant repercussions for self-insurers and insurance companies in the years ahead.",
    "“Senate presidential search exemption proposal diverges from House version as it approaches final committee” via Kelly Hayes of Florida Politics — Legislation that would provide a public records exemption on information about applicants seeking a state university or college presidential position is headed to its final committee stop after clearing the Senate Governmental Oversight and Accountability Committee.",
    "“New York Attorney General alleges Trump’s business inflated property values, wealth statements” via Shayna Jacobs, Jonathan O’Connell and Josh Dawsey of The Washington Post — New York Attorney General Letitia James alleged Trump’s business inflated the value of his properties and misstated his personal worth in representations to lenders, insurance brokers and other players in his real estate empire.",
    "“Senate Health Policy Committee says yes to inpatient hospital care at home, hotel” via Christine Jordan Sexton of Florida Politics — The Senate Health Policy Committee on Wednesday approved legislation (SB 1222) which amends existing state health care laws to allow hospitals, physicians and emergency medical transportation providers to partner together to provide nonemergency services to patients.",
    "“State official gushes over influx of federal early childhood funding in House committee talk” via Kelly Hayes of Florida Politics — Matt Mears, the state’s Chancellor of Early Learning, was elated Wednesday afternoon when explaining that early childhood instructors received $166 million from Florida’s share of the federal Coronavirus Response and Relief Supplemental Appropriations Act (CRRSA).",
    "“COVID-19 update: Florida reports 43,179 new cases, steady hospitalizations as omicron surge continues to ease” via David Schutz of the South Florida Sun-Sentinel — Florida’s omicron surge continued to ease as the state’s seven-day average for new cases declined for the eighth consecutive day, and the number of patients in the hospital with COVID-19 remained stable, federal data shows.",
    "—“Looks like DeSantis could turn into Trump’s personal nightmare” via Charlotte Klein of Vanity Fair\n“Lincoln Project teases ‘divorce’ between Trump and DeSantis” via A.G. Gancarski of Florida Politics — The ex-Republican operatives at the Lincoln Project are gleefully exploiting the latest GOP crackup, with an ad buy promoting the so-called “divorce” between Trump and DeSantis.",
    "“With Legislature in Session, speak now, or forever hold your peace” via Omari Hardy for the South Florida Sun-Sentinel — Every year, it seems, another billionaire moves to our state, another Wall Street firm opens an office in Florida, another Fortune 500 company leaves its headquarters in New York, or California, and relocates to our state to do business here in the sunshine.",
    "Both initially praised Califf during his confirmation hearing in the Senate health committee and appeared inclined to support him before voting against advancing the nomination in committee over “pro-life issues.” Marshall’s office confirmed that he met with some of the anti-abortion groups working to scuttle Califf’s confirmation in the lead-up to the Senate committee vote.",
    "“Through his extensive experience bridging the public and private sectors, Marcus will further strengthen Crowley’s engagement with policymakers through leadership and outreach that builds trust, innovative policies and effective advocacy across our services for commercial and government customers,” said Parker Harrison, Crowley’s senior vice president and general counsel.",
    "“Sunrise police union demands chief step away from investigation of officer who grabbed another cop by the throat” via Eileen Kelley of the South Florida Sun-Sentinel — The union for Sunrise police officers has demanded the city’s police chief recuse himself from the internal affairs investigation of a sergeant who was videotaped grabbing another officer by the throat.",
    "—TALLY 2 —\n“Critics fear legislative proposal to fix nursing home staffing shortages may affect care” via Verónica Zaragovia of WLRN — A survey from the Florida Health Care Association published in August found 92% of long-term care facilities in the state faced significant staffing challenges, with more than half saying they have had to reduce admissions as a result.",
    "— CORONA FLORIDA —\n“Joe Biden says nation weary from COVID-19, but U.S. in a better place” via Zeke Miller and Josh Boak of The Associated Press — Biden acknowledged Wednesday that the pandemic has left Americans exhausted and demoralized but insisted at a news conference marking his first year in office that he has “outperformed” expectations in dealing with it.",
    "—ETCH-A-SKETCH—\n“Senate ignores DeSantis’ redistricting map, moves forward with plan less friendly to GOP” via Skyler Swisher and Steven Lemongello of the Orlando Sentinel — The Florida Senate moved forward with a congressional redistricting map that carves out fewer Republican-friendly districts than a surprise proposal put forth by DeSantis earlier this week.",
    "He launched his career covering local politics for the Beaches Leader Newspapers and the Cape Coral Daily Breeze before focusing jumping up to statehouse coverage, first for Sunshine State News and later at LobbyTools, where he anchored their coverage of property insurance, gambling, economy, labor, real estate, transportation, technology and budget issues.",
    "“Duval Schools reports more COVID-19 cases in first nine days of third quarter than the first two months of school combined” via Emily Bloch of The Florida Times-Union — In the nine days Duval Schools students have been back in school, the district has reported more cases of COVID-19 than it did in the first two months of the 2021-22 school year combined.",
    "“The long slide: Inside Biden’s declining popularity as he struggles with multiple crises” via Ashley Parker, Tyler Pager and Sean Sullivan of The Washington Post — Biden presented himself as an antidote to his predecessor, offering the promise of what his own campaign ads called “strong, steady, stable leadership” after four years of bedlam under Trump.",
    "“Following a natural disaster, scam artists work overtime to defraud individuals in their time of need, and that is why I have deployed my Disaster Fraud Action Strike Team to Southwest Florida to be on the lookout for bad actors trying to make a buck off the damage caused by the devastating tornadoes that took place over the weekend,” Patronis said.",
    "“Bill requiring Florida governments to use American-made iron and steel clears first hurdle” via Jesse Scheckner of Florida Politics — A bill that would require state and local governmental organizations in Florida to use American-made iron and steel products cleared its first hurdle Wednesday after facing some scrutiny and one argument against it.",
    "“DeSantis’ office disses Al Lawson district as ‘unconstitutional gerrymander’” via Jacob Ogles of Florida Politics — The Governor’s Office labeled Florida’s 5th Congressional District an “unconstitutional gerrymander.” The harsh assessment comes as draft congressional maps moving through the Florida Legislature all include a similar configuration.",
    "“AI tool is built to detect which COVID-19 patients will recover from the disease based of blood protein levels” via Mansur Shaheen of Daily Mail — Researchers may have developed a new tool that uses machine learning to better predict health outcomes for hospitalized COVID-19 patients, and help physicians make more informed treatment decisions.",
    "Will continue to test on a regular basis.” She added, “As always, we would also encourage all Floridians to sign up for the free tests now available through the USPS at https://special.usps.com/testkits, and to get vaccinated.” The Mayor is fully vaccinated and boosted and is experiencing mild symptoms, spokesperson Despina McLaughlin said.",
    "“Lara Trump says DeSantis needs ‘another opportunity’ to endorse Trump in 2024” via A.G. Gancarski of Florida Politics — On Wednesday, Lara Trump discounted rumors of “bad blood” between Trump and DeSantis while suggesting Florida’s Governor may just need “another opportunity” to demonstrate his support for Trump ahead of the 2024 election.",
    "“Orange County Mayor: ‘It is my fervent hope that Dr. Paul Pino returns to work … soon.’” via Stephen Hudak of the Orlando Sentinel — Demings, isolated at home because of a COVID-19 infection, offered his support Wednesday for Dr. Pino, who was placed on administrative leave from his post as the state’s chief health officer in the county.",
    "Yet they suggested that their bill not only offers a prospect for influencing future Olympic decisions but could add immediate pressure to the Olympic organizers, NBC and American corporate sponsors to address human rights issues in China, including China’s ongoing genocidal oppression of the Uyghur people, during The Games’ broadcasts.",
    "“Biden uses infrastructure bill to fulfill ask from hedge fund billionaire donor’s foundation” via Collin Anderson of The Washington Free Beacon — Biden used his $1 trillion infrastructure bill to boost an environmental foundation run by a hedge fund billionaire who contributed tens of thousands of dollars to the Democrat’s campaign.",
    "— CORONA LOCAL —\n“Orange County Mayor Jerry Demings tests positive for COVID -19, Val Demings negative” via Stephen Hudak of the Orlando Sentinel — Orange County Mayor Demings, who has led the county’s push for vaccination, testing and safety protocols, has tested positive for COVID-19, a spokesperson announced Wednesday in an email.",
    "“I did not get any direction on who to pick, by the way.” Of the remaining two members of the authority, Orange County Mayor Jerry Demings voted to hire the director of Seattle’s airport, and Orlando Mayor Buddy Dyer said the Seattle airport director was his top pick, but he would vote along with the majority as a show of unanimity.",
    "“Miami-Dade officially kills push for a private operator of the Rickenbacker Causeway” via Douglas Hanks of the Miami Herald — Declared unofficially dead weeks ago, the push for a private operator of the Rickenbacker Causeway was formally killed Wednesday by Miami-Dade Commissioners after leaders of Key Biscayne thwarted the effort.",
    "faces wave of omicron deaths in coming weeks, models say” via Carla K. Johnson of The Associated Press — The fast-moving omicron variant may cause less severe disease on average, but COVID-19 deaths in the U.S. are climbing, and modelers forecast 50,000 to 300,000 more Americans could die by the time the wave subsides in mid-March.",
    "“Biden leaves Democrats hanging as midterms burst into full swing” via Edward-Isaac Dovere of CNN — Biden spotted Rep. Sean Patrick Maloney on the White House campus last June and called out to the House Democratic campaign chair loudly enough for several others to hear: “I really want to talk to you about the races!” he shouted.",
    "To watch the ad, click on the image below:\n“Roger Stone slams DeSantis for ‘disloyalty’ to Trump” via Lisa J. Huriash of the South Florida Sun-Sentinel — Notorious provocateur Stone warned DeSantis to step aside for Trump in 2024, slamming DeSantis’s “disloyalty” to Trump and implying the former President could pull his support.",
    "— CRISIS —\n“House Jan. 6 Committee subpoenas White nationalist figures” via Luke Broadwater and Alan Feuer of The New York Times — The House committee investigating the Jan. 6 attack on the Capitol issued two subpoenas for the leaders of a white nationalist movement that helped bring a crowd to Washington ahead of the riot.",
    "“Biden administration plans to spend more than $1 billion on Everglades restoration” via Bryan Lowry and Alex Harris of the Miami Herald — The U.S. Army Corps of Engineers plans to spend $1.1 billion on restoring and preserving South Florida’s Everglades during the current fiscal year, the White House announced Wednesday.",
    "“Judge orders home of ex-Jacksonville City Council member seized for fraud restitution” via Steve Patterson of The Florida Times-Union — A federal judge ordered former Jacksonville City Council member Reggie Brown’s home seized and sold, apparently days after he was released from a prison where he served time for fraud.",
    "— LOCAL NOTES —\n“Who’s responsible after four years of deaths on Brightline’s tracks” via Rob Wile and Doug Hanks of the Miami Herald — Brightline has caused more fatalities per mile traveled than any other major rail operator in the country, according to a Miami Herald analysis of Federal Railroad Administration data.",
    "“Huge bottles, kegs, and 5-liter boxes: bill mulls repeal of wine container size limits” via Scott Powers of Florida Politics — Imagine your party guests’ faces when you cart out a $5,625, six-liter, Methuselah bottle of Château d’Yquem wine or when you lug out a $15.99, five-liter box of Franzia Cabernet Sauvignon.",
    "U.S. District Judge Marcia Morales Howard granted a request from prosecutors to seize the home to help settle a $411,000 forfeiture order she imposed in October 2020, when Brown was sentenced with fellow ex-Council member Katrina Brown on dozens of fraud counts involving billing for a failed barbecue sauce factory.",
    "“New bill to eliminate Florida’s prescribed burn program poses great harm to our state” via Alan Shelby and Jim Karels for the Tallahassee Democrat — A new bill from activists in the Florida Legislature would handicap Florida’s prescribed burning program, putting our state, our homes, and our people at great risk.",
    "“Florida education scandal reveals conflicts, money-grubbing for tax dollars” via Scott Maxwell of the Orlando Sentinel — Two top officials, including a former chair of the State Board of Education, tried to score a $1.8 million contract off the very division they were helping run, a blatant conflict of interest.",
    "“Mike Waltz joins bipartisan bill to strip Olympic Committee of tax-exempt status” via Scott Powers of Florida Politics — Rep. Waltz joined Rep. Jennifer Wexton in introducing a bill to strip the International Olympic Committee of tax-exempt status in the United States for violating its social welfare purpose.",
    "“Abortion pill fight could ensnare Biden’s FDA pick” via Alice Miranda Ollstein and Lauren Gardner of POLITICO — The FDA’s decision to ease access to abortion pills is fueling a new push by anti-abortion rights groups to derail Biden’s nominee to lead the agency, potentially endangering his confirmation.",
    "— MORE CORONA —\n“Study: Prior infection, vaccines provide best protection from COVID-19” via Mike Stobbe of The Associated Press — A new study in two states that compares coronavirus protection from prior infection and vaccination concludes getting the shots is still the safest way to prevent COVID-19.",
    "“Biden asks, ‘What are Republicans for?’ Republicans have already chosen not to answer.” via Philip Bump of The Washington Post — During a news conference held one day shy of his anniversary in office, Biden was asked whether he had made bigger promises to the electorate than he was able to fulfill.",
    "The department says doing so would prevent social activists from pressuring drug manufacturers into blacklisting the state from purchasing their products, but death penalty opponents say that it’s the manufacturers themselves that have sought to prevent their drugs from being used to kill people.",
    "“I consider that to be an incredible act of disloyalty and ingratitude.” Stone called DeSantis “an unknown congressman with a bad haircut, an ill-fitting suit and an undistinguished record in Congress until President Donald Trump’s endorsement lifted him to the Republican nomination” in 2018.",
    "“How ‘Encanto’ and its vibrant soundtrack became a viral phenomenon” via Bethonie Butler of The Washington Post — The animated film, about a Colombian family with magical gifts and an enchanted fortress that has protected them for generations, arrived in theaters in November to warm reviews.",
    "“When being unvaccinated means being locked out of public life” via Chico Harlan and Stefano Pitrelli of The Washington Post — At this complicated stage of the pandemic, the lives of unvaccinated people are in major flux, at the mercy of decisions made everywhere from courts to workplaces.",
    "“AFP-FL urges lawmakers to let the sun set on VISIT FLORIDA” via Drew Wilson of Florida Politics — VISIT FLORIDA will cease to exist on Oct. 1, 2023, under current law, but bills moving through the Legislature (SB 434/HB 489) would extend its authorization by five years to Oct. 1, 2028.",
    "“Senate passes health care liability protections as providers look to House to do the same” via Christine Jordan Sexton of Florida Politics — A must-pass bill for Florida’s nursing homes, doctors and hospitals cleared the Florida Senate Wednesday by a mostly partisan 22-13 vote.",
    "“Bill raising claims cap before state intervention to $1 million advances in the House” via Renzo Downey of Florida Politics — A proposal to raise the cap on claims against local governments before the Legislature must intervene passed its first committee hurdle on Wednesday.",
    "— 2022 —\n“Election supervisors cite fraudulent signatures on Las Vegas Sands’ casino petitions” via Lawrence Mower and Mary Ellen Klas of The Tampa Bay Times/Miami Herald — Florida could be in the midst of one of the largest cases of election-related fraud in recent history.",
    "He will be based in Washington, D.C.\n“I am pleased to join Crowley and look forward to advancing the company’s best-in-class solutions for the U.S. maritime industry and beyond, including the company’s burgeoning energy, transportation and technology services,” Jadotte said.",
    "“You can imagine if access were eliminated in Florida, what it would look like in the South.”\nSenate approves Governor’s emergency fund, but slashes price tag — The full Senate voted in favor of establishing a pot of money for the Governor to use during states of emergency.",
    "Its success, boosted by the film’s streaming debut and scores of “Encanto”-themed TikTok videos, has earned comparisons to “Frozen.”\n“The case for keeping up your Christmas tree until March” via Charlie Warzel of The Atlantic — Right now, there is a hole in my living room.",
    "— EPILOGUE TRUMP —\n“Supreme Court rejects Trump, clears release of Jan. 6 papers” via Greg Stohr of Bloomberg — The U.S. Supreme Court cleared the way for some of Trump’s White House papers to be turned over to a congressional panel investigating the Jan. 6 Capitol attack.",
    "— OPINIONS —\n“Why you can count on a Biden bounce” via Jack Shafer of POLITICO — We’ve already seen the weeks and weeks of coverage marking the end of his presidency, capstoned by his twin failures to navigate his multitrillion-dollar Build Back Better bill past Sens.",
    "The administration has also repeatedly underestimated the magnitude of the nation’s challenges, including failing to anticipate the delta and omicron coronavirus variants, and has struggled to unite the liberal base and the more moderate wing of the Democratic Party.",
    "—DATELINE TALLY —\n“15-week abortion ban passes first test in Legislature” via Skyler Swisher of the Orlando Sentinel — A House committee advanced a 15-week ban on most abortions on a 12-6 party-line vote in the first legislative debate on the controversial bill.",
    "As Florida’s rich have gotten richer, as our biggest corporations have booked massive profits, everyday Floridians — the essential workers and small-business owners who power our economy and create jobs in our communities — have been left to fend for themselves.",
    "This is about having all your available options at the ready for you for 15 weeks.” But Democrats said it would interfere with what should be a private medical decision and particularly hurt low-income women and people of color who lack access to health care.",
    "“Attorney Kevin Hayslett joins Republican race for Florida’s 13th District” via Romy Ellenbogen of the Tampa Bay Times — Hayslett, a Clearwater attorney and former prosecutor, announced his plan on Wednesday to run for Florida’s 13th Congressional District.",
    "— STATEWIDE —\n“Florida DOT Secretary Kevin Thibault picked to run Orlando airport” via Kevin Spear of the Orlando Sentinel — DeSantis’ five appointees to Orlando’s aviation authority voted Wednesday to hire Thibault to run Orlando International Airport.",
    "He also served as assistant secretary for industry and analysis for the International Trade Administration at the U.S. Department of Commerce during the Barack Obama administration and the U.S. Department of Labor during the Bill Clinton administration.",
    "— CORONA ECONOMICS —\n“Florida man gets five years for COVID-19 relief, tax fraud” via The Associated Press — A Florida man convicted of fraudulently collecting more than $1.3 million in COVID-19 relief funds has been sentenced to five years in prison.",
    "At Florida Politics, he will use his expertise to provide Florida Politics’ readers with timely, insightful coverage on economic development and budget issues in a Legislative Session where lawmakers are poised to OK another $100 billion-plus budget.",
    "The organization singled out Senate President Simpson and House Speaker Chris Sprowls, as well as Sen. Travis Hutson, Rep. Sam Garrison, Sen. Cord Byrd and Sen. Jennifer Bradley for backing a bill (HB 9049) that would fund the facility’s completion.",
    "It’s called “One Damn Thing After Another.” In a news release, the book, publisher William Morrow says, “takes readers behind the scenes during seminal moments of the Bush administration in the 1990s, from the LA riots to Pan Am 103 and Iran Contra.",
    "“School arts performance postponed by record-high COVID-19 positivity rate in Manatee County, athletics unaffected” via Allyson Henning of WFLA — The highly-contagious omicron variant of coronavirus is impacting the school system in Manatee County.",
    "“CDC data shows significant drop in new COVID-19 cases in Florida” via Brenda Argueta of Click Orlando — The CDC released several days of data after the holiday weekend that shows Florida may be turning the corner when it comes to the omicron wave.",
    "To listen, click on the image below:\n— ALOE —\n“Orlando to host U.S. final home World Cup qualifier in March” via The Associated Press — The United States will play its final home World Cup qualifier at Orlando, Florida, on March 27 against Panama.",
    "Yet, the pandemic isn’t the true power struggle going on between the men, caught up in a drama reminiscent of Gloucester and his bastard son Edmund in Shakespeare’s “King Lear.” Theirs is a struggle for the ultimate power: the U.S. presidency.",
    "“Senate debates legislative map that will shape its 2022 political environment” via Jacob Ogles of Florida Politics — A draft map (S 8058) reached the Senate floor six days after the Senate Reapportionment Committee cleared it for full debate.",
    "“We are extremely grateful to our state leaders and representatives for their support in our mission to continue saving veteran lives by building the world’s largest rescue-to-Service Dog facility,” said Rory Diamond, CEO of K9s For Warriors.",
    "— MORE TALLY —\n“Charter school bill unanimously passes second House committee” via Tristan Wood of Florida Politics — A House bill putting guardrails on how charter schools are renewed unanimously passed its second committee stop Wednesday.",
    "But their lives are changing most dramatically in a handful of countries in Western Europe, including Italy, where governments are systematically reducing their liberties while beginning to return the rest of society to a state of normalcy.",
    "— SITUATIONAL AWARENESS —\n—@PBump: [guy on Twitter] “i am certain about this thing that I am wrong about”\n—@SamStein: Some folks will be surprised that (Joe) Biden said he was surprised by how stalwart Republican opposition to him would be.",
    "Jimmy Patronis deploys anti-fraud strike team to Southwest Florida — CFO Patronis sent a squad of anti-fraud experts to Southwest Florida on Wednesday to ensure residents impacted by recent storms and tornadoes do not become fraud victims.",
    "“‘That’s a problem’: Florida state agencies challenged with lack of job applicants, struggle to retain low-wage workers” via Kelly Hayes of Florida Politics — State agencies are struggling to attract job applicants amid employee vacancies.",
    "In the wake of a bankruptcy filing and a slew of bad press over the last few years, the privately-held chain, the sixth-largest nursing home company in the nation, has quietly divided its Florida facilities into three separate companies.",
    "However, we do not support Chief Rosa’s bias, prejudicial and unprofessional behavior,” wrote Steven Negron, the President of the Fraternal Order of Police Lodge 80, in a Jan. 17 letter to the Sunrise city manager and elected officials.",
    "— HAPPY BIRTHDAY —\nBest wishes to the incredible Marva Johnson, our dear friend Jen Lux, as well as Jim Horne, Michael Johnston, now with Shumaker Advisors, Christine Knepper, Chris O’Donnell of the Tampa Bay Times, and Rick Oppenheim.",
    "— The Senate Appropriations Committee meets to consider SB 620, also from Hutson, to permit businesses to sue local governments if ordinances cause at least 15% losses of revenues or profits, 11:30 a.m., Room 412 of the Knott Building.",
    "The levels of 14 proteins found in a person’s blood can indicate whether a person who suffers a severe enough hospitalization will survive or die from the virus, and the tool developed by researchers can accurately assess their risk.",
    "K9s For Warriors says lawmakers deserve a treat — K9s For Warriors, the nation’s largest provider of trained Service Dogs to military veterans, on Wednesday praised the lawmakers working to help it secure funding for a new facility.",
    "— PRESIDENTIAL —\n“5 takeaways from Biden’s news conference” via Aaron Blake of The Washington Post — Biden reinforced Wednesday that he has largely given up on his high-minded but far-fetched vision for bipartisanship on his watch.",
    "#FlaPol pic.twitter.com/Uv0lhg1VVn\n— Jimmy Patronis (@JimmyPatronis) January 19, 2022\n—@JasmenRogers: Rep. Erin Grall (the bill sponsor) mentions that her sister had an abortion … says she’s pushing this bill to honor her sister.",
    "“Florida abortion bill will affect access across the South, advocates say” via Kirby Wilson of the Tampa Bay Times — The ban on abortion after 15 weeks proposed by Florida Republicans won’t just affect Florida if it becomes law.",
    "Fuentes, a White nationalist, online provocateur and activist, has allied with Rep. Paul Gosar, a far-right Republican from Arizona who helped lead objections in Congress to the certification of President Joe Biden’s victory.",
    "The Senate map is seen as the plan to keep much of the status quo in place, reinforcing the 16-11 Republican advantage over Democrats in congressional seats and even giving Democrats a good shot at a new seat being created.",
    "— SKED —\n— The Senate Rules Committee meets to consider SB 280, from Sen. Travis Hutson, to preempt new ordinances when challenges arise over the anticipated impacts to businesses, 9:30 a.m., Room 412 of the Knott Building.",
    "Biden said he believes important parts of his agenda will be passed before the 2022 midterm elections and voters will back Democrats if they are fully informed, an assignment he said he will pursue by traveling the country.",
    "Yet there’s a caveat: There have been nearly as many total hospitalizations in the past month as a year ago, largely a function of multiplying the reduced hospitalization rate times a far larger number of infected people.",
    "The plaintiffs allege that Florida Power & Light was negligent and breached its contract with customers by failing to fully prepare for the storm or to “harden the system” despite collecting a surcharge for that purpose.",
    "The group has been among a cohort of pro-gun rights organizations pushing for “constitutional carry.” However, Simpson said he would not get involved in constitutional carry legislation until it gets to the Senate floor.",
    "“Wilton Simpson says he’d vote for constitutional carry bill” via Renzo Downey of Florida Politics — Simpson says he would support removing laws requiring a concealed-weapons permit to carry a gun if it comes to a vote.",
    "Choose your news … “America’s second pandemic winter: More virus, less death” via Philip Bump of The Washington Post — Two critically important things changed with the coronavirus pandemic between one year ago and now.",
    "The funds for the Everglades restoration aim to increase the ecosystem’s resilience against climate change by storing surface water runoff and minimizing seepage losses during dry periods, according to the White House.",
    "In recent weeks, a crowdfunding webpage bearing his picture, and a message he apparently wrote from the Pinellas County Jail, has tallied more than $57,000 in contributions, ostensibly intended to pay for his defense.",
    "James, a Democrat leading a civil probe into Trump and his business, spelled out the claims in a court filing late Tuesday that was offered in support of her bid to see Trump and his adult children deposed under oath.",
    "On Wednesday, Mayor Daniella Levine Cava said her administration would now work on two tracks: coming up with a plan for modernizing Bear Cut, and preparing a new request for proposals for upgrading the Rickenbacker.",
    "Rep. Grall, the bill’s sponsor, said abortion needs to be limited because medicine and science have changed since the 1973 Roe v. Wade U.S. Supreme Court decision that established a constitutional right to abortion.",
    "“Not only are we seeing elevated turnover, we aren’t seeing the same degree of interest in people applying for these positions,” said Heather DiGiacomo, chief of staff at the Florida Department of Juvenile Justice.",
    "Mears spoke to the House Early Learning and Elementary Education Subcommittee, discussing how the Florida Division of Early Learning distributed the $635 million in CRRSA funding, which the Legislature allocated.",
    "“Shevrin Jones proposes change to the Senate’s draft congressional map” via Jacob Ogles of Florida Politics — Sen. Jones has offered changes to a proposed congressional map before the Florida Senate votes on it.",
    "In his new role, he will helm Crowley’s legislative and regulatory advocacy efforts and boost awareness of its growing defense and civilian government services offerings among federal, state and local officials.",
    "Rouson is sponsoring a bill designed to boost the number of “peer specialists” who can provide help to those being treated for drug and alcohol addiction as well as those who are struggling with mental illness.",
    "But the high court said in an unsigned, one-paragraph order that Trump’s appeal didn’t offer the opportunity to decide that issue, given the reasoning of the appeals court that backed the committee in the case.",
    "“Obamacare is proving popular in red states that didn’t expand Medicaid” via Tami Luhby of CNN — Millions of Americans have selected 2022 coverage on the Affordable Care Act exchanges, many for the first time.",
    "“The latest maps are a severe disservice to the voters of Miami Gardens, a predominantly African American city, with important local challenges that deserve focused representation in Congress,” Jones said.",
    "“I care about our community, and I have deep roots here, but like many others, I’m concerned with how Washington politicians are trying to dictate how we live our lives,” Hayslett said in his announcement.",
    "Flying Fish at Disney’s BoardWalk reopens Jan. 27, Turf Club Bar and Grill at Disney’s Saratoga Springs Resort reopens Feb. 3 and Jiko — The Cooking Place at Disney’s Animal Kingdom Lodge reopens Feb. 17.",
    "Well, at least in Florida” via Fabiola Santiago of the Miami Herald — You can tell the ex-President doesn’t get out of Mar-a-Lago and around Florida much because vaccine skeptics are a mean, scary bunch.",
    "Eustache submitted 13 different fraudulent Economic Injury Disaster Loan and Paycheck Protection Program applications to the Small Business Administration and other lenders from March 2020 to April 2021.",
    "Democratic politicians, campaign officials, and operatives say the White House political operation is heading into the midterms unprepared and unresponsive even to basic requests for help or information.",
    "One proposal, filed by Sen. Ben Albritton, would slash the hours licensed nurses have to spend with patients and allow time spent with therapists or activities directors to count toward the requirement.",
    "Company officials contend the rail service has been plagued by suspected pedestrian suicides on the tracks and risk-taking motorists undaunted by the large mechanical guard arms blocking rail crossings.",
    "The committee issued subpoenas to Nicholas J. Fuentes and Patrick Casey, whom the panel described as leaders of the “America First” or “Groyper” movement and who were on the Capitol grounds last Jan. 6.",
    "Lara Trump was on Varney & Company on the Fox Business Network, where she was asked to respond to a report that it was “too much to ask” for DeSantis to preemptively endorse another Trump term in 2024.",
    "In times of crisis, where resources are especially scarce, the device can help determine what patients require the most intensive care to survive, and who is more fit to fight off the virus themselves.",
    "Redistricting experts and Democrats were quick to say that the Governor’s map would surely run afoul of both the federal Voting Rights Act and the Fair Districts amendment of the Florida Constitution.",
    "— CORONA NATION —\n“Omicron is in retreat” via David Leonhardt of The New York Times — Since early last week, new cases in Connecticut, Maryland, New Jersey and New York have fallen by more than 30%.",
    "Proponents hope it would reduce the number of times Floridians would have to come to lawmakers to plead their case to receive reparations for transgressions committed against them by the government.",
    "The seven-day rolling average for daily new COVID-19 deaths in the U.S. has been trending upward since mid-November, reaching nearly 1,700 on Jan. 17, still below the peak of 3,300 in January 2021.",
    "Although the forms are supposed to reflect real Floridians voicing support for a change to the state’s Constitution, many include the names of dead people or the forged signatures of real voters.",
    "For years, as nearby states have passed laws to limit abortion access, Southerners have made their way to the Sunshine State to take advantage of Florida’s relatively strong abortion protections.",
    "“If you look at Texas, they haven’t had access to abortion care beyond six weeks for four months,” said Laura Goodhue, executive director of the Florida Alliance of Planned Parenthood Affiliates.",
    "They will be on the lookout for common post-storm scams such as contractors or restoration professionals who offer to waive insurance deductibles or fail to perform work after they’ve been paid.",
    "James cited examples of Trump allegedly lending his signature to financial statements that estimated the worth of properties in the Trump Organization portfolio and the value of his own fortune.",
    "Christopher Pullease’s behavior in the Nov. 19 incident “disgusting” and said the female subordinate acted appropriately when trying to intervene to de-escalate a confrontation at a crime scene.",
    "Waltz and Wexton, both longtime and leading critics of China’s human rights policies, all but conceded there is little chance of passing such a bill before the Olympics begin Feb. 4 in Beijing.",
    "The DFAST deployment consists of eight insurance fraud and workers’ compensation investigators who work for the Department of Financial Services Division of Investigative and Forensic Services.",
    "There were 11,839 patients with the virus in Florida hospitals on Tuesday and 1,613 adult COVID-19 patients in intensive care, data from the U.S. Department of Health and Human Services shows.",
    "“It serves no good policy basis to criminalize the sale of wine based on container size,” argued Rep. Chip LaMarca as he pushed a bill (HB 6031) through the House Commerce Committee Wednesday.",
    "Ron DeSantis refuses to put his own presidential ambitions on hold until President Donald Trump has decided to whether he wants to run again,” Stone said in a YouTube video posted Wednesday.",
    "The second is that the most common variant of the virus to spread in the United States in the past month was omicron, which is far more contagious but, the data suggest, also less dangerous.",
    "The move comes less than a year after billionaire investor and Everglades Foundation founder Paul Tudor Jones lobbied the Biden administration to commit $2.9 billion to the group’s cause.",
    "Jadotte’s Florida connections include stints as chief of staff to U.S. Reps. Peter Deutsch and Debbie Wasserman Schultz, as well as an economics degree earned at Florida State University.",
    "—@RepJoseOliva: @JoeGruters A government-enforced mandate requiring private business to engage in displays of allegiance for the purpose of advancing freedom is the antithesis of freedom.",
    "The trouble is, Brown already has a court-appointed lawyer, whose services come courtesy of a federal law intended to help the accused who are financially unable to retain legal counsel.",
    "The study examined infections in New York and California last summer and fall and found people who were both vaccinated and had survived a prior bout of COVID-19 had the most protection.",
    "According to the White House, the money comes through the infrastructure law Biden signed into law in November and represents the single largest investment in the Everglades in history.",
    "He’s always cared most about Senate races, Biden told the Michigan Democrat, and he wanted to have a meeting, an hour at least, to talk about helping his party hold the chamber in 2022.",
    "New data released Tuesday from the CDC shows there has been a large decline in new infections, and the state’s seven-day average of new cases has dropped nearly 25% in less than a week.",
    "Two weeks ago, my street was a Griswoldian wonderland with twinkling lights silhouetting the eaves of my neighbors’ houses and robust-looking conifers standing proudly in their windows.",
    "Needing only a draw in their finale to qualify, the U.S. lost 2-1 four days later at Trinidad and Tobago, and the Americans’ streak of seven straight World Cup appearances was stopped.",
    "This map holds significant political consequences for chamber members, and under its current configuration, places several incumbent Senators seeking re-election into shared districts.",
    "But the waivers will expire, and Sen. Aaron Bean said his bill establishes the necessary framework for facilities interested in providing inpatient care outside of a hospital setting.",
    "“Florida’s Environmental Regulation Commission hasn’t met in 5 years” via Scott Maxwell of the Orlando Sentinel — Florida is poised to spend $2.2 billion on the environment next year.",
    "But the movie and its soundtrack, featuring original songs by Lin-Manuel Miranda and a score by Germaine Franco, have gotten more popular since “Encanto” landed on Disney+ last month.",
    "A report from a consultant hired by state officials in 2018 recommended several key rail safety measures, yet the Florida Department of Transportation has not implemented any of them.",
    "Prosecutors said no payments had been made when they asked last month for permission to take the House on Ray Road, off Cleveland Road near Edgewood Avenue in Northwest Jacksonville.",
    "But the tumult surrounding the administration’s withdrawal from Afghanistan offered an early glimpse of the cascade of crises that have badly eroded Biden’s image of restoring calm.",
    "As Matt Dixon of POLITICO Florida reports, the chamber’s plan sets the account balance at $500 million, which is just half of $1 billion DeSantis requested in his budget proposal.",
    "At another point, Biden seemed to admit again that he misread the situation, pointing to the many sitting Republican senators who once voted to reauthorize the Voting Rights Act.",
    "Across the state, elections supervisors say they have been sent thousands of fraudulent petition forms supporting a constitutional amendment to expand casino gaming in the state.",
    "The U.S. Soccer Federation announced Wednesday that the match will be at Exploria Stadium, where the Americans beat Panama 4-0 on Oct. 6, 2017, also their next-to-last qualifier.",
    "Rohrer comes to Florida Politics from the Orlando Sentinel, where he has worked as the Tallahassee Bureau reporter covering a wide range of news beats, including the Legislature.",
    "The current law that shields businesses and health care providers from COVID-19-related lawsuits was one of the first measures passed by the Legislature during the 2021 Session.",
    "Sen. Ray Rodrigues, who is leading the Senate’s redistricting efforts, said he only learned of the Governor’s plan this week, and senators are following the legislative process.",
    "COVID-19 deaths among nursing home residents started rising slightly two weeks ago, although still at a rate 10 times less than last year before most residents were vaccinated.",
    "Florida’s congressional delegation split along party lines last year on the more than $1 trillion infrastructure package, with only the state’s Democrats voting in favor of it.",
    "Sen. Gary Farmer, a Fort Lauderdale Democrat, and Rep. Anna Eskamani, an Orlando Democrat, proposed SB 1102 and HB 6085 to strip protections from last year’s Right to Farm Act.",
    "“AFP-FL works hard to protect Floridians’ hard-earned dollars by opposing public funding for unwarranted purposes,” AFP-FL State Director Skylar Zander said in a news release.",
    "Biden insisted that his administration had made “enormous progress” on his agenda, denying that he’d overpromised on the campaign trail and during his early months in office.",
    "When the Parrish Community High School performance was supposed to be taking place Tuesday evening, the school’s basketball and soccer teams were playing games as scheduled.",
    "Mayo Clinic Jacksonville Hospital has been offering inpatient services to its patients for more than a year under a pair of waivers granted by federal and state governments.",
    "And while regular testing, until recently, was permitted as an alternative to vaccination, even that option has now been largely removed as countries harden their mandates.",
    "So, for once, we, his detractors, applauded the former President for backing the COVID-19-vaccine booster rollout where in counts, in a conservative forum full of skeptics.",
    "Trump was seeking to override Biden’s decision to waive executive privilege over the documents, arguing that a former President’s rights can outweigh the incumbent’s views.",
    "A week later, at the cherry festival in Traverse City, Michigan, Biden leaned into Sen. Gary Peters, who’s in charge of Democratic Senate campaigns, with the same promise.",
    "Among the Biden comments that will likely be chewed over extensively was one suggesting that a smaller incursion by Russia into Ukraine might not merit the same response.",
    "If passed and signed by DeSantis, the rule would also cover various other governmental entities, including school districts, taxing districts, colleges and universities.",
    "His warning came after reports that a rift was growing between Trump and DeSantis over COVID-19 vaccines and their shared aspirations for the 2024 Republican nomination.",
    "Jadotte most recently worked as vice president of federal government relations at Raytheon Technologies, one of the largest aerospace and defense contractors in the U.S.",
    "—@MDixon55: As I just heard it put: “Broward days, the one day of year the Capitol is full of Democrats”\nTweet, tweet:\nThe beatings will continue until morale improves.",
    "He said he would likely have to settle for “big chunks” of his signature economic package to break an impasse in Congress and further attack inflation and the pandemic.",
    "Hospitalizations dropped by more than 300 over the weekend, though about half these hospitalizations are people with COVID-19 who are being treated for something else.",
    "While the Florida House must also sign off on the map, the chambers traditionally have allowed one another to craft their own district boundaries for legislative maps.",
    "The Senate legislation approaches its third committee without a key amendment tacked on in a House meeting Tuesday, an alteration that changed guidelines in the bill.",
    "Sponsored by Sen. Danny Burgess, the bill (SB 7014) extends through June 1, 2023, the protections health care providers currently have from COVID-19 related lawsuits.",
    "He was happy to share that 26% of the funding went to instructor disaster relief payments, which came in two $1,000 checks written directly to child care instructors.",
    "Why does Florida law limit wine sales to containers no larger than 1 gallon, except for reusable kegs or shipping logistics between manufacturers and distributors?",
    "@alevine014 #Chargeon @UCF_Football @GasparillaBowl pic.twitter.com/adgqz7rPrQ\n— Chris Latvala (@ChrisLatvala) January 19, 2022\n—@MattNorlander: Simply incredible.",
    "“Bill Barr has a book deal” via Andrew Beaujon of the Washingtonian — Barr, the former U.S. Attorney General, will publish a memoir of his time in the George H.W.",
    "“More restaurants reopening at Disney World” via Dewayne Bevil of the Orlando Sentinel — Three more restaurants are scheduled to reopen soon at Walt Disney World.",
    "This game against Panama is between qualifiers on March 24 at Mexico and March 30 at Costa Rica, where the Americans have nine losses and one draw in qualifying.",
    "However, the Senate bill looks a little different from the House version, which is on to its second committee after garnering approval at its first stop Tuesday.",
    "Miami-Dade Circuit Judge David Miller issued the order last month, noting that the plaintiffs had shown that the case meets all requirements for a class action.",
    "The email revealed that fewer than 14% of the 568 employees in the County Health Department had been fully vaccinated with a complete series and booster shot.",
    "Their proposal could weaken or eliminate one of the state’s most successful land management programs when it comes to protecting our people and environment.",
    "Where should it go?” via Dan Sullivan of the Tampa Bay Times — Ever since Jeremy Michael Brown’s arrest in September, he has fought hard to get out of jail.",
    "The scandal involves the tiny, troubled Jefferson County School District in the Panhandle, which state officials turned over to a private company in 2017.",
    "Under terms of the agreement, she must undergo psychiatric treatment and counseling and take medications, with monthly blood tests to confirm compliance.",
    "“I stayed up late last night thinking and praying on this,” said Carson Good, chair of the Greater Orlando Aviation Authority and a Governor’s appointee.",
    "In fact, data shows that so far this month, the district has reported more COVID-19 cases than it did between all of September through December combined.",
    "The measure (SB 520), filed by Sen. Jeff Brandes, cleared its second committee with one amendment that provided the bill be effective upon becoming law.",
    "Filed by Rep. Josie Tomkow, the bill clarifies that farms can still be taxed at a lower rate even when parts of the land are being used for agritourism.",
    "The measure (HB 225), sponsored by Rep. Fred Hawkins, would require school boards to renew charter schools at least 90 days before the school year ends.",
    "The placements are deliberate and provocative, with ad buys in Palm Beach, where Trump could see it, and Tallahassee, where the Governor might view it.",
    "Jacksonville-based logistics juggernaut Crowley announced that it’s bringing Marcus Jadotte on board as senior vice president of Government Relations.",
    "Florida prosecutors accepted Hannah Roemhild’s plea during a brief hearing Tuesday with the 32-year-old singer appearing by Zoom from her home state.",
    "The National Archives can now turn over about 800 pages of material, including visitor and call logs, emails, draft speeches, and handwritten notes.",
    "The law clarifies that to successfully sue a health care provider for COVID-19, the plaintiff must prove gross negligence or intentional misconduct.",
    "Prosecutors said that Eustache included false statements in the applications regarding criminal history, the number of employees, and total payroll.",
    "The effort has already swung some previously undecided Republican senators on Robert Califf’s nomination, like Tommy Tuberville and Roger Marshall.",
    "Sen. Jeff Brandes, who chairs the committee, called for the presentation to learn about the current employment challenges faced by state agencies.",
    "The measure (HB 985), carried by Rep. Mike Beltran, would raise the value of claims from $200,000 to $1 million before sovereign immunity applies.",
    "“You need to be certified; you need to be properly trained,” said Runkle, who has worked as a CNA for 31 years and is also a member of 1199 SEIU.",
    "The bill passed its second committee stop, the House Secondary Education and Career Development Subcommittee, with unanimous bipartisan support.",
    "Despite the common description of the omicron variant as “mild,” the sheer scale of infections has pushed the number of hospitalizations higher.",
    "Carnahan, whose term expires in November, announced Tuesday, Jan. 18, during the county commission meeting he will not seek re-election in 2022.",
    "Raul Pino has been our trusted partner and friend throughout the pandemic,” the Mayor said in a statement emailed from his communications team.",
    "The Senator took issue with a draft map advanced by the Senate Reapportionment Committee (S 8040) set for floor discussion Wednesday afternoon.",
    "Hayslett, a Republican, said he’s already been endorsed by Pinellas County Sheriff Bob Gualtieri and former Pinellas County Sheriff Jim Coats.",
    "And in Texas, which has the highest uninsured rate in the nation, 1.7 million residents have selected policies, up roughly 33% from last year.",
    "Open enrollment ends Saturday, though consumers can sign up during the year if they meet specific criteria, such as losing job-based coverage.",
    "Simpson made the comment to reporters Wednesday after conservatives at the Republican Liberty Caucus said they met with the Senate President.",
    "A German research team developed an artificial intelligence tool to estimate how well an infected person will fare based on a blood sample.",
    "In 2015, after working as a freelancer covering the special redistricting Session for The Associated Press, he joined the Orlando Sentinel.",
    "Tweet, tweet:\nHonored to meet with stakeholders from all over the state today to hear about the issues important to you and your families.",
    "FL is special because of the engagement of our citizens and I’m so lucky to work with each and every one of you to move our state forward!",
    "The seven-day average of cases on Jan. 11, when the state recorded its fourth-highest set of numbers since the pandemic began, was 65,759.",
    "“Simpson told the group he ‘would support, vote yes, and challenge senators to bring a constitutional carry bill,’” according to an email.",
    "Americans for Prosperity-Florida urges lawmakers to pump the brakes, deriding the tourism marketing agency as a form of corporate welfare.",
    "The Senate legislation (SB 1186), filed by Albritton, follows the House version of the bill, with both heading to their second committee.",
    "The proposal was pitched last year but fell through after it was determined that the state could not seed the account with federal money.",
    "The first was that vaccines became widely available, and most American adults availed themselves of the protections the vaccines offered.",
    "She said the plan may be far less ambitious than the $500 million upgrades sought by Miami-Dade in the solicitation that was just killed.",
    "Local, state and federal elected officials and regulators appear to be playing catch-up to the deadly rail dilemma and how to address it.",
    "“It is evident that DeSantis is trying to restrict minority representation, specifically African American voters,” the Congressman said.",
    "In recent years, in particular, the Republican Party leadership has specifically declined to offer a detailed, proactive policy agenda.",
    "The final major piece of encouraging news involves booster shots: They are highly effective at preventing severe illness from omicron.",
    "Many of Consulate’s Florida nursing homes have begun to change their individual names as well, erasing any affiliation with the chain.",
    "Are they changing ownership?” via Hannah Critchfield of the Tampa Bay Times — The largest nursing home chain in Florida is rebranding.",
    "If a 15-week ban passes, access to abortion for people from out of state could be curtailed, advocates on both sides of the issue say.",
    "The Democrat wants to see Miami Gardens, a community he represents in the state Senate, kept wholly within one congressional district.",
    "“I think what you’re going to see is that Russia will be held accountable if it invades, and it depends on what it does,” Biden said.",
    "Biden seemed to lay blame on local authorities for not better using money from the pandemic relief bill to address ongoing problems.",
    "By early September, more Americans disapproved than approved of how Biden was handling his job for the first time in his presidency.",
    "He must also forfeit approximately $700,000 seized from several bank accounts, as well as real properties in Palm Bay and Poinciana.",
    "Just months before making the ask, Jones contributed $50,000 to the Biden Victory Fund and an additional $2,800 to Biden’s campaign.",
    "More than 13.8 million people have picked plans on the federal and state marketplaces, 2 million of them new to Obamacare for 2022.",
    "In total, four songs from the film are on the Hot 100, nestled between smashes from Adele, Lil Nas X, Taylor Swift, and The Weeknd.",
    "Performing arts students at Parrish Community High School found out their much-anticipated winter performance would not take place.",
    "But the context is fresher, with Trump and DeSantis seemingly engaged in a rhetorical Cold War that could heat up on little notice.",
    "DeSantis is threatening to veto it if he doesn’t think legislators have come up with maps that gain enough ground for Republicans.",
    "That’s an increase of 21% in sign-ups through the federal exchange, Healthcare.gov, as of Dec. 15, from the same time a year ago.",
    "The order gives a major legal and political victory to the House select committee and its Democratic chair, Rep. Bennie Thompson.",
    "Prosecutors earlier this month filed an emergency request for a judge to prohibit Brown or his supporters from getting the funds.",
    "What has emerged is a different sort of pandemic, one in which far more people are getting infected but, so far, fewer are dying.",
    "Sovereign immunity is a principle stating that the government, including a local government, cannot be sued without its consent.",
    "“We should not allow our legislators to pick and choose what they want to see succeed in our economy — it should be our choice.",
    "If the higher end of projections comes to pass, that would push total U.S. deaths from COVID-19 over 1 million by early spring.",
    "___\nSunburn is authored and assembled by Peter Schorsch, Phil Ammann, Daniel Dean, Renzo Downey, Jacob Ogles, and Drew Wilson.",
    "We talk to a veteran political reporter about county delegations pushing their big issues … like sewers and road improvements.",
    "The money was apparently too much to resist for state Board of Education member Andy Tuck and Vice-Chancellor Melissa Ramsey.",
    "Biden’s Interior Department hired the foundation’s former CEO, Shann Estenoz, to serve as its policy head for national parks.",
    "The House Local Administration and Veterans Affairs Subcommittee unanimously OK’d a bill (HB 619) by Rep. Anthony Rodriguez.",
    "—@NateMonroeTU: the capitolist is just fulfilling every journalist’s ideal: comfort the comforted and afflict the afflicted.",
    "A much better way — cheaper and more effective — is to stop people from damaging our natural resources in the first place.",
    "This Session, I called on the Legislature to promote adoption & foster care, so all Floridians have a fair chance in life.",
    "Ryan Newman, General Counsel for DeSantis’ office, surprised lawmakers by submitting a draft congressional map on Sunday.",
    "The ending of the bidding process for a developer leaves Miami-Dade looking for other options to repair Bear Cut Bridge.",
    "—TODAY’S SUNRISE —\nThe 15-week abortion ban had its first hearing, giving Democrats their first crack at challenging it.",
    "When you’ve fallen into the subbasement, as Biden truly has, then almost any vertical improvement looks like a comeback.",
    "Speakers from various public sectors made one thing clear: state agencies are struggling to attract and keep employees.",
    "Asked if the Florida Supreme Court five years ago put an unconstitutional district into play, Pushaw asserted it had.",
    "However, even more notable is the popularity Obamacare is enjoying in many of the states that didn’t expand Medicaid.",
    "If there is a problem with a charter school, districts should start addressing it with “plenty of time,” he argued.",
    "For now, the available evidence suggests that omicron is less threatening to a vaccinated person than ordinary flu.",
    "SB 282 cleared its second Senate committee Wednesday and has only one more stop before it reaches the full Senate.",
    "Amy Runkle, a CNA in Venice, says the idea of replacing licensed nursing assistants with other staff is dangerous.",
    "Florida has the highest number of people picking plans at nearly 2.6 million has seen interest soar by nearly 23%.",
    "The trio, located inside or near company resorts, have been shuttered since the pandemic took hold in March 2020.",
    "Senate Minority Leader Mitch McConnell has been direct about his lack of interest in outlining a policy platform.",
    "Hayslett is positioning himself as a “law and order” candidate who is a Trump Republican and political outsider.",
    "That includes the 2021 Legislative Session when a similar bill sailed through the chamber, passing unanimously.",
    "He has written for numerous publications throughout his 15-year career covering politics in the Sunshine State.",
    "“We support the sergeant receiving a fair investigative process and await an unbiased and objective conclusion.",
    "The White House announced $1.1 billion in funding from Biden’s infrastructure bill to preserve the Everglades.",
    "Never get involved in a land war in Asia, and never get involved in an overtime game against Leonard Hamilton.",
    "Diamond said that once completed, the facility will halve the wait time for veterans to receive a service dog.",
    "Tuesday evening, the district reported 529 new cases, an all-time high for new cases reported within 24 hours.",
    "Over the past three years, the state has seen a 34.7% decline in the number of applicants to state positions.",
    "The decision to take down our holiday decorations after New Year’s is an arbitrary act of seasonal austerity.",
    "Second, last week he hit the lowest of all his lows in the Quinnipiac Poll, scoring only 33% in job approval.",
    "Florida has 4,000 more licensed caregivers than in 2019 & I am proposing additional funds for foster parents.",
    "On Wednesday, the state added three deaths to its total count, bringing the seven-day rolling average to 91.",
    "He pleaded guilty in August to wire fraud and aiding and assisting in the preparation of false tax returns.",
    "The House must still vote on its version of the map, one draft that would radically reshape many districts.",
    "Also on today’s Sunrise:\n— Big Issues like abortion aren’t the only things being talked about this Session.",
    "The bill has garnered bipartisan support, clearing its first House and first Senate committee unanimously.",
    "But the seven-day average fell to 45,456 — its lowest level since Dec. 30, according to data from the CDC.",
    "On its website, Consulate Health Care Services no longer lists any long-term care facilities in the state.",
    "HB 6031 flew through the Commerce Committee Wednesday with no opposition or debate and little discussion.",
    "The state wanted to hire yet another company to help oversee the transfer for approximately $1.8 million.",
    "He owns property in Georgia, but was not sure whether it is homesteaded because his wife took care of it.",
    "Rohrer is a graduate of the University of Central Florida, where he earned a degree in political science.",
    "Democratic leaders then plan to move to change the Senate’s filibuster rules without Republican consent.",
    "HOW can you honor your sister’s autonomy and decision to do what’s best … by restricting that choice?!?",
    "The measure would require taxpayer-funded public works to domestically source iron and steel products.",
    "The drama of the day was not expected to change the results of the votes planned for Wednesday night.",
    "The problem is that, in Tallahassee, your connections matter much more than the merits of your cause.",
    "Facing two separate federal cases, Brown lost a lengthy legal battle last month for release on bond.",
    "The House Environment, Agriculture and Flooding Subcommittee unanimously approved HB 717 on Tuesday.",
    "Roemhild only spoke to acknowledge her presence during the three-minute hearing in West Palm Beach.",
    "— A Republican poll says there may be a reason behind the alleged rift between Trump and DeSantis.",
    "— House Finance & Facilities Subcommittee meets, 1 p.m., Morris Hall of the House Office Building.",
    "— House PreK-12 Appropriations Subcommittee meets, 1 p.m., Reed Hall of the House Office Building.",
    "Democratic Sen. Linda Stewart was the only member of her party in the chamber to support the bill.",
    "— House Education & Employment Committee meets, 9 a.m., Morris Hall of the House Office Building.",
    "And some outside experts were cautious of the findings and wary of how they might be interpreted.",
    "And in 2020, state legislation that would have bolstered public safety at rail crossings stalled.",
    "— House Government Operations Subcommittee meets, 1 p.m., Room 404 of the House Office Building.",
    "In the latest data reported one week later, the seven-day average was 49,690, a drop of 24.43%.",
    "—@HeatherGBarwick: She honors me because that was the biggest mistake I made in my entire life.",
    "Florida’s Environmental Regulation Commission hasn’t met a single time in the past five years.",
    "The Senate’s 2022 plan (SB 96/SB 98) would fill the pot of money with general revenue dollars.",
    "As the world turns in Tallahassee and at Mar-a-Lago, my bet is on Trump losing the big battle.",
    "Duval County Property Appraiser’s Office records estimate the home’s market value at $93,500.",
    "That differed from comments one gun rights organization said Simpson made during the meeting.",
    "But Christina Pushaw, DeSantis’ press secretary, said CD 5 as it exists now should not stand.",
    "Hawkins noted that public schools start working toward the next school year well in advance.",
    "Congresswoman Demings, the Mayor’s spouse, said by email that she is “Negative and grateful.",
    "They’re down by more than 10% in Colorado, Florida, Georgia, Massachusetts and Pennsylvania.",
    "By fall, that group had a lower case rate than vaccinated people who had no past infection.",
    "But some in the industry say there could be problems if licensed nurses provide less care.",
    "The district is implementing additional proactive mitigation measures to slow the spread.",
    "— And we’ll let you hear what Stone has to say about the Governor in a new YouTube video.",
    "Biden can return to the smaller-gauge policies that made him popular in the first place.",
    "It’s worth noting that a bump in reported cases after a holiday break is to be expected.",
    "Under his draft map (S 8060), it would sit within Florida’s 24th Congressional District.",
    "Before students were dismissed for winter break, the county’s positivity rate was 6.9%.",
    "That map splits Miami Gardens between CD 24 and Florida’s 25th Congressional District.",
    "The bill passed the House Civil Justice & Property Rights Subcommittee by a 16-1 vote.",
    "But has this corporate feeding frenzy benefited the working-class people of our state?",
    "___\nFlorida Politics’ roster is expanding next week, with the addition of Gray Rohrer.",
    "— House Regulatory Reform Subcommittee meets, 1 p.m., Room 212 of the Knott Building.",
    "The maps will ultimately become law without any involvement of the Governor’s Office.",
    "The House version of the bill, introduced Tuesday, would provide the full $1 billion.",
    "He instead cast his Republican opponents as principle-free, power-hungry legislators.",
    "Republicans were equally passionate in their denunciations of the Democratic effort.",
    "The CDC, which released the study Wednesday, noted several caveats to the research.",
    "In total, he sought more than $2.1 million in pandemic-related emergency benefits.",
    "This state and nation are already spending $23 billion cleaning up the Everglades.",
    "Kudos to Chairman @GovGoneWild for recognizing that UCF is superior to the Gators.",
    "— House Judiciary Committee meets, 9 a.m., Room 404 of the House Office Building.",
    "— The Florida Senate is scheduled for a floor session, 2:30 p.m., Senate chamber.",
    "Pino faces a state investigation related to a staff-wide email he sent on Jan. 4.",
    "The Governor is polling almost as high as Trump among Republican primary voters.",
    "The U.S. is 4-0 at Exploria, which has a capacity of 25,500 and opened in 2014.",
    "It was scheduled for less than 12 hours later and has not yet been rescheduled.",
    "If you could solve problems simply by throwing money at them, we would be fine.",
    "Rouson is a recovering addict and has pushed similar legislation in years past.",
    "He has also worked in the C-suite at aviation services provider AAR and NASCAR.",
    "— House State Affairs Committee meets, 9 a.m., Room 212 of the Knott Building.",
    "The final map must also be signed into law by DeSantis, or he could veto it.",
    "And the Governor’s office now suggests that should be the end of the story.",
    "Dennis Baxley and Keith Perry both live in the proposed Senate District 9.",
    "Still, an increase in new cases this high hasn’t occurred all school year.",
    "Florida can be very friendly, but often it’s lip service, a smoke screen.",
    "Abortion is presently legal up to the 24th week of pregnancy in Florida.",
    "Environmental enforcement is a fraction of what it was two decades ago.",
    "The state reported 43,179 new cases on Wednesday, an increase Tuesday.",
    "The news release said the Mayor will be working from home this week.",
    "But then he qualified that: Perhaps he did overpromise on one front.",
    "But he believes it is possible to have a homestead in another state.",
    "—@NikkiFried: As Governor, I’ll protect a woman’s freedom to decide.",
    "Federal prosecutors have fought just as hard to keep him locked up.",
    "— TOP OPINION —\n“Dear Trump, you’ve fallen to the mighty DeSantis.",
    "But unvaccinated people with a past infection were a close second.",
    "That’s despite a three-year, 7.2% increase in job advertisements.",
    "Johnson Eustache was sentenced Tuesday in Orlando federal court.",
    "The Senate discussed the maps without mentioning DeSantis’ plan.",
    "Neither to date has said how they will deal with that situation.",
    "In 2021, 76,005 Florida instructors received emergency payments.",
    "The Senate was set to vote to cut off debate on the legislation.",
    "The proposal would definitely be challenged in court, they said.",
    "DeSantis’s map would dilute Black and Hispanic voting strength.",
    "I’m not suggesting that we need to leave our trees up all year.",
    "—@GovRonDeSantis: Protecting life does not end with the unborn.",
    "Joe Manchin and Kyrsten Sinema and get his voting bill passed.",
    "Such reorganization leaves consumers in the dark, critics say.",
    "Seven months later, there are still no meetings on the books.",
    "A co-founder of the group contextualizes the most recent buy.",
    "He received confirmation of a positive test Tuesday evening.",
    "Her attorneys have said she has a history of mental illness.",
    "Federal prosecutors accepted a similar plea deal in August.",
    "“Crowdfunds top $50K for Tampa man charged in Jan. 6 riots.",
    "He’s fallen so far that everything has to be up from here.",
    "Reservations can be made at these locations as of Jan. 20.",
    "Sen. Jim Boyd has filed similar legislation in the Senate.",
    "The conflict of interest was as wrong as it was obvious.",
    "I am, of course, talking about my Christmas tree (RIP).",
    "All three appear to be still affiliated with Consulate.",
    "We’ve tried to cover it up, but nothing seems to work.",
    "“Florida has a unique potion for executing prisoners.",
    "Four senators have excused absences and did not vote.",
    "Look for his first Florida Politics byline next week.",
    "And more than honoring me, she honors my lost child.",
    "The choice is to get inoculated or face exclusion.",
    "“Florida’s redistricting process was moving along.",
    "1: Why 15 weeks — and how is that constitutional?",
    "Lawson condemned the Governor’s proposal Tuesday.",
    "Florida State wins a 13th straight overtime game.",
    "Otherwise, the charter would renew automatically.",
    "—@BChesky: Starting today, I’m living on Airbnb.",
    "Senate Democrats all voted against the measure.",
    "The principle dates back to British common law.",
    "Then imagine their faces when the cops arrive.",
    "And on that front, Florida is pretty pathetic.",
    "“Consulate nursing homes are changing names.",
    "He may be cratering at just the right time.",
    "Bush and Trump administrations in March.",
    "“This is not an abortion ban,” she said.",
    "“Sad!” was first launched in September.",
    "Unfortunately, that’s not how it works.",
    "Menus are available at disneyworld.com.",
    "Take your tree down when you’re ready.",
    "In California, cases may have peaked.",
    "Both want to be contenders in 2024.",
    "Normalize prolonged festivity!",
    "Chief Anthony Rosa called Sgt.",
    "Students felt it wasn’t fair.",
    "It was not there last week.",
    "“This is about 15 weeks.",
    "Never been done before.",
    "Let’s rethink that one.",
    "Good Thursday morning.",
    "Apologize for nothing.",
    "The spot is a rerun.",
    "FSU 79, Duke 78.",
    "Both resigned.",
    "Question No.",
    "Or … “U.S.",
    "Or don’t!",
    "Hardly.",
    "“Gov.",
    "Sens.",
    "“Dr."
  ]
}