{
  "id": 6924,
  "mediaId": 2664,
  "date": "2022-01-27",
  "headline": "GOP's Paul Gosar hijacks MLB team logos to promote a fundraiser – at a game that’s not scheduled",
  "image": "https://www.rawstory.com/media-library/paul-gosar-afp.jpg?id=28141063&width=1200&coordinates=0%2C68%2C0%2C69&height=600",
  "link": "https://www.rawstory.com/gops-paul-gosar-hijacks-mlb-team-logos-to-promote-a-fundraiser-at-a-game-thats-not-scheduled/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ray Hartmann",
  "authorUrl": "https://www.rawstory.com/u/ray_hartmann",
  "termIds": [
    1926,
    211,
    562,
    568,
    878,
    922
  ],
  "sentences": [
    "One, is that at least one of the teams -- the Angels -- is stating it has “no affiliation with this event & are working to have our marks removed from the advertisement,” Sam Blum, a sports reporter who covers the team for The Athletic tweeted last night.",
    "READ: An expert on police use of force is calling this incident one of the 'most abusive and unnecessary' he has ever seen\nThat detail aside, the ad features the insurrectionist Gosar grinning next to a baseball slightly largely than the size of his head.",
    "I’m looking forward to a great day at the ballpark and I’d love for you to join me.”\nGosar likes to refer to himself as “the most dangerous man in Congress.” But as his latest fundraiser suggests, he’s better just described as the strangest.",
    "The reelection campaign for Rep. Paul Gosar is advertising a $1,500-per-person event at a spring training game February 27 between the Los Angeles Angels and Dodgers, complete with team logos that make it look pretty official.",
    "The other problem might prove even more vexing for Gosar: The two teams are both scheduled to play Cactus League games on February 27 -- just not against each other.",
    "The Angels are scheduled to play the Chicago White Sox and the Dodgers square off with the San Diego Padres that day.",
    "But there are a couple of problems with the ad running on the conservative fundraising website Win Red.",
    "We’ve emailed the campaign contact for the event about tickets and will keep you posted.",
    "Below are the words:\n“Greetings fellow Patriots."
  ]
}