{
  "id": 6945,
  "mediaId": 2664,
  "date": "2022-02-01",
  "headline": "Republican Paul Gosar defends notorious white nationalist: report",
  "image": "https://www.rawstory.com/media-library/rep-paul-gosar.jpg?id=29213211&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/paul-gosar-nick-fuentes-2656525651/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1926,
    2430,
    3242,
    80,
    413,
    878,
    954,
    1163,
    4902
  ],
  "sentences": [
    "He was censured by the U.S. House of Representatives in November and was stripped of all committee assignments after posting an anime-style video in which he kills Rep. Alexandria Ocasio-Cortez (D-NY),\" the newspaper reported.",
    "\"Fuentes sparked national attention after attending the 2017 white nationalist rally in Charlottesville, the same year he started his live stream show 'America First with Nicholas J.",
    "\"Gosar was invited to join Gab last August and joined the site in November, after encouragement from Gab CEO Andrew Torba and months of a #getgosarongab social media campaign.\"",
    "\"In a Jan. 24 Gab post, Gosar defended extremist Nick Fuentes, whom the Southern Poverty Law Center describes as a white nationalist,\" the newspaper reported.",
    "\"Gosar skipped a February 2021 House vote on COVID-19 relief to attend a Fuentes-organized America First Political Action Committee conference in Florida.",
    "\"The phony January 6th Committee's partisan witch-hunt continues as they have now set their sights on young conservative Christians like Nick Fuentes.",
    "The two were supposed to hold a fundraiser last year, although Gosar denied his attendance despite being featured in the invitation with Fuentes.\"",
    "He also addressed the same crowd as former President Donald Trump in Washington on Jan. 6, 2021, before the Capitol riot,\" the newspaper reported.",
    "Gosar's Gab post came five days after Fuentes was subpoenaed by the House Select Committee to Investigate the Jan. 6 Attack on the U.S. Capitol.",
    "Controversial Rep. Paul Gosar (R-AZ) \"has found a new home\" on a far-right social media platform, The Arizona Republic reported Tuesday.",
    "Fuentes has reportedly been banned from Facebook, Youtube, TikTok, Instagram, Venmo, PayPal and Stripe.",
    "Gosar remains on Twitter even after his ominous tweet on the morning of the Jan. 6 insurrection.",
    "This is pure political persecution and it has to stop,\" Gosar demanded.",
    "\"Gosar is no stranger to social media controversy.",
    "\"Thank you Congressman!\"",
    "Fuentes wrote in reply.",
    "But he is on Gab.",
    "Fuentes.'"
  ]
}