{
  "id": 7033,
  "mediaId": 2915,
  "date": "2022-01-31",
  "headline": "With Love From Virginia: How You Can Help Let These Patriots Know They Are Not Alone",
  "image": "https://charismanews-secure-charismamedia.netdna-ssl.com/images/stories/2022/1/Election_Police_Capitol.jpg",
  "link": "https://www.charismanews.com/opinion/88233-with-love-from-virginia-how-you-can-help-let-these-patriots-know-they-are-not-alone",
  "mediaOutlet": "charismanews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amir George",
  "authorUrl": "https://www.charismanews.com/component/search/?searchword=Amir%20George&ordering=newest&searchphrase=exact&areas[0]=authors",
  "termIds": [
    0
  ],
  "sentences": [
    "Antifa organized 7,750 protests over the summer that resulted in 570 violent riots, which killed 25 people and caused nearly $2 billion in damages, according to Sen. Ron Johnson [ R-Wis.], but nearly a million of us turned up on Jan. 6 to support our beloved president after the election was stolen from him in the middle of the night, and over 700 are still being charged, along with the 39 here in the DC jail.",
    "\"We are believers in the Lord Jesus Christ and finding out the stories of these, just regular men and women who love their country who showed up in Washington out of love for country—no weapons, no violence—whereas the tens of thousands who burned America during the summer of 2020 have nearly not even been arrested, is absolutely shameful,\" his wife adds.",
    "Frustrated by the fact that with a few occasional exceptions, there is no daily rally outside the complex, Mr. and Mrs. Thomas drove in from Linden, Virginia, to visit, pray for and mobilize others to spend an hour or more to rally to encourage the J6 political prisoners, with signs, calls of encouragement and a daily presence in front of the facility.",
    "Those able to stop by for an hour a week to bring a sign of support and/or bring a loudspeaker to give a message of support for those inside to hear can send their day and time of visit to christianpersecutionwg@gmail.com to be put on the daily schedule to join with the Thomases and others in letting the patriots know they are not alone.",
    "While more than 700 people have been arrested in connection with the January 6, 2021 peaceful rally opposing the stolen 202 election, 39 remain behind bars, according to Congressmen Matt Gaetz, R-Fla.; Louie Gohmert, R-Texas; Paul Gosar, R-Ariz.; and Marjorie Taylor Greene, R-Georgia, they are being abused.",
    "\"We are asking anyone in the area to please come up, whether it's for an hour a week or a month or whatever you can manage, and join us in standing here in front of the DC jail to let the J6 political prisoners know they are not forgotten, know we are with them and hasten their freedom,\" the couple says.",
    "The Thomases are putting out a challenge to anyone living in the Washington, D.C., area to take an hour a week to stop in front of the jail as they are able to hold up a sign, perhaps even bring a speaker and shout out a message of encouragement to those being held as political prisoners inside.",
    "Stephen Strang, bestselling author of God and Cancel Culture, writes in God, Trump and the 2020 Election, \"The right of religious freedom is enshrined in the First Amendment before the other freedoms,\" echoing the words of Scripture, \"Live as people who are free\" (1 Pet.",
    "Originally built in 1910, the District of Columbia's jail, technically known as the Washington, D.C., Central Detention Facility, is a depressing complex, sprawled in the middle of a housing area in southern Washington, D.C.",
    "\"We are praying that many will see this and join us, just an hour a week to encourage, pray for and stand for our patriots and the over 700 who are suffering so terribly during this time,\" the Thomases say.",
    "Five people were killed on Jan. 6, including Benjamin Philips, Kevin Greeson, Rosanne Boyland, Ashli Babbitt and Brian Sicknick, all at the hand of the authorities and not by the crowd of patriots.",
    "For more information on how you can fight back against cancel culture, make sure to get a copy of what Charisma founder and CEO Stephen Strang says is his most important book yet.",
    "\"They have been beaten by the guards ... denied religious services, haircuts ... denied bail ... many have been never been charged for a crime before, many are veterans ... .",
    "Updated information on names of those in the Washington, D.C., facility and others nationwide can be found at lookaheadamerica.org.",
    "The closest metro is the Washington D.C., Metro station, Stadium-Armory on the Blue, Orange and Silver lines.",
    "\"Here, right behind us, they remain in solitary continent, abused and cut off from everyone.\"",
    "Call 202-442-7270 to arrange a visit with one of those being held inside.",
    "God and Cancel Culture is now available wherever fine books are sold.",
    "Follow breaking news like this on our new platform, CHARISMA PLUS.",
    "Get Charisma's best content delivered right to your inbox!",
    "Click here to subscribe to the Charisma News newsletter.",
    "Letters of encouragement can be sent to 1901 D St.",
    "The phone number to the facility is 202-698-4932.",
    "Make sure to get off at the DC Prison exit.",
    "\"We just don't understand it,\" Thomas says.",
    "\"Antifa and BLM seem to get away with it.",
    "Amir George directsThe World Helpline.",
    "Never miss a big news story again.",
    "Order it at stevestrangbooks.com.",
    "It is unbelievable,\" Greene said.",
    "SE, Washington, D.C., 20003.",
    "2:16a, ESV)."
  ]
}