{
  "id": 7104,
  "mediaId": 2565,
  "date": "2022-01-05",
  "headline": "Ari Melber destroys Trump’s main insurrectionist planner: Do you realize you were describing a COUP?",
  "image": "https://secureservercdn.net/166.62.108.196/n0t.519.myftpupload.com/wp-content/uploads/2022/01/Ari-Melber-destroys-Trumps-insurrectionist-planner-Do-you-realize-you-were-describing-a-COUP.jpg",
  "link": "https://egbertowillies.com/2022/01/05/ari-melber-destroys-trumps-main-insurrectionist-planner-do-you-realize-you-were-describing-a-coup/",
  "mediaOutlet": "egbertowillies.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Egberto Willies",
  "authorUrl": "https://egbertowillies.com/author/egberto/",
  "termIds": [
    0
  ],
  "sentences": [
    "“You just described this plan as a way to take an election where the outcome was established by independent secretaries of state, by the voters of those states, and legal remedies have been exhausted with the Supreme Court never even taking let alone siding with any of the claims that you just referred to,” Melber said.",
    "Don’t you think somebody would have thought of this if the incumbent administration through the President or the Vice President could just cancel the election outcome because he goes down to the Senate?” Melber said.",
    "We have an entire system designed to thwart people like you, to stop people like you who think that you can anoint yourself the reviewers of the voters of the American people of what they lawfully did.",
    "Since those states would not resolve the voting issue, they would disregard the electoral college and elect the president via a state-by-state vote in Congress.",
    "After a few more back and forths, Melber had another zinger after Navarro said Soros was helping steal the election by bringing Democrats into power.",
    "You will use the incumbent losing party’s power that was the Republican Party, that was losing power, to overtake and reverse that outcome.",
    "Peter Navarro likely thought he would get the soft treatment he usually gets from network TV on Ari Melber‘s program.",
    "He asked Navarro to explain the plan to get Trump into power after losing the election and for the participants.",
    "They needed Vice-President Mike Pence to send back the votes from those states unconstitutionally.",
    "Since there are more Republican state delegations and each state gets one vote, Trump would win.",
    "Do you realize you are describing a coup?”\nNavarro, of course, refused to accept that notion.",
    "The goal for Trump to steal the election was to challenge the vote in 6 battleground states.",
    "After Navarro went through the explanation of the fraudulent process, Melber slammed him.",
    "My Books support (1) communication techniques & (2) our Progressive message delivery.",
    "People like you are what the constitution is designed to stop and it worked.”\nOuch!",
    "Will you subscribe to our YouTube Channel to help us get to 100,000 subscribers?",
    "Interestingly he said over 100 Congresspersons and Senators were involved.",
    "The video has select clips that where Ari skillfully dissects the fascist.",
    "Ari Melber shows his skill\nThis extended interview was pleasant to watch.",
    "Navarro pointed out that Ted Cruz and Paul Gosar started the process.",
    "And at the end, he said, in different words, that Navarro was a liar.",
    "Melber continued to give him all the rope he needed to hang himself.",
    "Peter Navarro (@RealPNavarro) underestimated @AriMelber.",
    "“Well, then a lot of people would try to stay in power.",
    "It helps us deliver the progressive message widely?",
    "That you trump the Supreme Court, no pun intended.",
    "Melber skinned Navarro like a skillful fisherman.",
    "Would you mind joining our YouTube channel now?",
    "Very often, a calm demeanor is more effective.",
    "Should these politicians start seeking cover?",
    "Is someone singing like a bird?",
    "“So legally, they went nowhere.",
    "That would not be the case."
  ]
}