{
  "id": 7226,
  "mediaId": 2595,
  "date": "2022-01-24",
  "headline": "Biden’s Writing Up Military Orders for the Fools Who Ruined Afghanistan",
  "image": "https://www.independentsentinel.com/wp-content/uploads/2022/01/war-russia-us.jpg",
  "link": "https://www.independentsentinel.com/bidens-writing-up-military-orders-for-the-fools-who-ruined-afghanistan/",
  "mediaOutlet": "independentsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steiner Vs Sargent Rock, Enrico Falcone, Ben Colder",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "The same clowns urging US intervention have the same stupid ROE that caused losses in Viet Nam, Iraq, and Afghanistan.”\n\nGosar also suggested that the U.S. should be more focused on domestic issues, such as the immigration crisis, adding that our “own borders remain open and we have been under a sustained and successful attack” from those illegally entering the country in record numbers.",
    "The Biden administration is in the final stages of identifying specific military units it wants to send to Eastern Europe and writing up the military orders in an effort to deter Russia, which has massed tens of thousands of troops on the border with Ukraine, according to multiple US and defense officials.",
    "It is generously framed by a huge amount of false information, just lies, and fakes.”\n\nBiden Warns Russia That If They Invade Ukraine, America Will Evacuate Haphazardly And Leave $86 Billion In Weapons Behind https://t.co/BMmTPzG4pV — The Babylon Bee (@TheBabylonBee) January 24, 2022\n\nRelated",
    "NATO\n\nThe NATO countries are also sending additional ships and fighter jets to Eastern Europe and putting forces on standby, NATO Secretary-General Jens Stoltenberg said in a statement Monday.",
    "We are already engaged in a proxy war with Russia and could end up in a pointless physical war over the boundaries of a country that has no importance in our lives.",
    "“NATO will continue to take all necessary measures to protect and defend all Allies, including by reinforcing the eastern part of the Alliance,” Stoltenberg said.",
    "Not one American soldier should die there, and not one American bullet should be fired there,” Rep. Paul Gosar said in a January 22 statement.",
    "PUTIN DENIES\n\nMoscow denies it is planning to invade, accusing the US and NATO of escalating tensions over their support for Ukraine.",
    "Russian President Putin already discussed a “strategic partnership” with Cuba in a phone call with President Díaz-Canel (RIA).",
    "If he is successful in starting a war while we are nearly bankrupt and most Americans don’t want a war, all will end badly.",
    "SANDAL-WEARING GOAT HERDERS\n\nSome Republicans are speaking out against deploying troops and escalating the situation.",
    "“Tensions are escalating due to concrete actions taken by the US and NATO,” Kremlin spokesman Dmitry Peskov said.",
    "The Kremlin on Monday dismissed the reports about plans to install a pro-Russian leader in Ukraine as “hysteria.",
    "Biden administration is writing up military orders for units to be sent to Eastern Europe, according to CNN.",
    "The same fools that surrendered Afghanistan to terrorists and left Americans behind, will be in charge.",
    "He’s talking about sending 8,500 while Russia has 130,000 on Ukraine’s border.",
    "All this while our borders are wide open to anyone seeking to destroy us.",
    "Generals Austin, Milley, and MacKenzie are ready to do it all again!",
    "But, you can always count on Biden to do the exact wrong thing.",
    "“I mean, the informational hysteria that we are witnessing.",
    "“We just lost Afghanistan to sandal-wearing goat herders.",
    "I assure you, Russian military is no joke either.",
    "Other Republicans want sanctions immediately.",
    "He put 8500 troops on heightened alert.",
    "That should have been done months ago.",
    "“We have no dog in the Ukraine fight.",
    "That would be 90 miles off our shore.",
    "They can go up to 50,000."
  ]
}