{
  "id": 789,
  "mediaId": 2608,
  "date": "2022-04-22",
  "headline": "‘This Is a Solemn Occasion’: Georgia Voters Fight to Disqualify Marjorie Taylor Greene from Ballot, Citing 14th Amendment Bar on ‘Insurrection’",
  "image": "https://lawandcrime.com/wp-content/uploads/2022/04/MTG-Rally-GettyImages.jpg",
  "link": "https://lawandcrime.com/u-s-capitol-breach/this-is-a-solemn-occasion-georgia-voters-fight-to-disqualify-marjorie-taylor-greene-from-ballot-citing-14th-amendment-bar-on-insurrection/",
  "mediaOutlet": "lawnewz.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Klasfeld",
  "authorUrl": "https://lawandcrime.com/author/adam-klasfeld/",
  "termIds": [
    1726,
    1926,
    2201,
    3059,
    4384,
    4429,
    4840,
    4848,
    4918,
    4984
  ],
  "sentences": [
    "Parsing the relevant text, Bopp read the third section of the 14 Amendment in full:\n“No person shall be a Senator or Representative in Congress, or elector of President and Vice-President, or hold any office, civil or military, under the United States, or under any State, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.",
    "“Instead of violence against the foreign empire, as we saw it in 1776, she urged and encouraged and helped facilitate violent resistance to our own government, our democracy and our Constitution.”\nIn his opening statement, Greene’s attorney James Bopp characterized the challengers’ opening statement as long on rhetoric and short on the law.",
    "But Congress may by a vote of two-thirds of each House, remove such disability.”\nDespite calling the Jan. 6 attack “despicable,” Bopp argued that it was not an insurrection, noting that none of the hundreds of people indicted in connection with it has been charged with that federal crime.",
    "A longtime counsel for Republican causes, Bopp led the Citizens United lawsuit which prompted the Supreme Court to loosen campaign finance laws, and he was one of the figures behind a quickly withdrawn spate of lawsuits intended to overturn the 2020 election results.",
    "After the Jan. 6 attack on the U.S. Capitol, the non-profit group Free Speech for People has gone on a legal crusade across the United States seeking to ban certain candidates or elected officials from office under the 14th Amendment’s “insurrection” prohibition.",
    "This is not theater.”\nFein began his statement with a centuries-long overview of insurrections in the United States, citing not only the Civil War but also such earlier incidents as the Shays’ Rebellion and the Whiskey Rebellion.",
    "Though Cawthorn succeeded in blocking the challenge, Greene’s federal lawsuit seeking similar relief failed, and so the parties moved on to the next stage of proceedings: a hearing before an administrative law judge in Atlanta.",
    "Bopp argued that the challengers did not define their terms in accusing his client of engaging or aiding in an insurrection, and he accused them of failing to grapple with the First Amendment implications of their effort.",
    "“The most powerful witness against Marjorie Taylor Greene’s candidacy, the most powerful witness in establishing that she crossed the line into engagement of insurrection is Marjorie Taylor Greene herself,” Fein asserted.",
    "“This Is Not Theater”\nOn behalf of five registered voters in Georgia’s 14th Congressional District, the group’s legal director Ron Fein began opening statements by emphasizing the gravity of their charge.",
    "Georgia voters fought on Friday to disqualify Donald Trump loyalist Rep. Marjorie Taylor Greene (R-Ga.) from office, days after a federal judge refused to block such a challenge on constitutional grounds.",
    "“That’s not going to happen today.”\nNor, Fein added, would the evidence include a “turncoat witness” risking exposure by testifying about Greene’s alleged directives ordered in secret.",
    "“The evidence today does not include surveillance tapes, purporting to show that Marjorie Taylor Greene was directing the plotting of the attack,” Fein acknowledged.",
    "“She was scared and confused.”\nAfter opening statements, daylong hearings began with witness testimony, starting with Indiana University professor Gerard Magliocca.",
    "“It Turned Out to Be an 1861 Moment”\nQuoting Greene repeatedly calling Jan. 6 a “1776 moment,” Fein suggested that she got her analogy wrong.",
    "Their previous efforts have targeted Rep. Madison Cawthorn (R-N.C.) and Rep. Paul Gosar (R-Ariz.) on the same grounds.",
    "The attorney emphasized the limitations of the evidence the challengers intend to present.",
    "“The right to vote is at stake, right here, right now,” Bopp declared.",
    "(Photo by Megan Varner/Getty Images)\nHave a tip we should know?",
    "“In fact, it turned out to be an 1861 moment,” Fein charged.",
    "“Your honor, this is a solemn occasion,” Fein said.",
    "“Her life was in danger, she thought,” Bopp said.",
    "He also depicted Greene as a victim of it.",
    "This is a developing story.",
    "“This is not politics.",
    "tips@lawandcrime.com"
  ]
}