{
  "id": 851,
  "mediaId": 2629,
  "date": "2022-04-10",
  "headline": "Democrats Need To Get Better At Politics, And Fast",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjkwMjQxOC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2MjMwNzMzNn0.zdInJ-9mdH-dsYzNC4ptrY1y9Ql8Yt1umgrhbNBrMSI/img.jpg?width=1200&coordinates=0%2C100%2C0%2C100&height=600",
  "link": "https://www.nationalmemo.com/democrats-need-to-get-better-at-politics-and-fast",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1726,
    3574,
    3709,
    3975,
    4087,
    4466,
    4777,
    305,
    5371
  ],
  "sentences": [
    "As someone who was on the other side for decades, I well recall that when Paul Ryan supported a plan that would permit Americans to funnel up to 40 percent of their Social Security taxes into private retirement accounts, interest group ads depicted him as a ghoul who was willing to wheel Granny off a cliff.",
    "Where are the Democratic ads pointing out that the way you get in trouble in today's GOP is by standing up for the rule of law and the Constitution (see Cheney, Liz and Kinzinger, Adam), but not for attending a conference organized by a Holocaust-mocking white supremacist?",
    "Finally, at least one reason that Democrats are perceived to be out of the mainstream is that the right-wing information ecosystem relentlessly \"nut picks\" the most outlandish things any Democrat says or does and magnifies it out of all proportion.",
    "This may be bad news for the health of democracy, but it is understandable as a matter of electoral politics because Democrats have forgotten what they grasped in 2020 when they united behind Joe Biden: the overriding obligation to win.",
    "That's right — not to pass generational reforms, not to save the planet, but just to govern in a fashion that prevents the QAnon-indulging, Putin-friendly, truth-optional, insurrectionist party from returning to power.",
    "Nor have Democrats competently pushed back on \"defund the police\" and \"abolish ICE\" and other left-wing slogans that Republicans have employed to great effect to tar their whole party.",
    "But it should have been said 3,000 times, and not just by Biden but by Vice President Kamala Harris and his cabinet members and leaders in Congress and surrogates of every kind.",
    "By contrast, Democrats have utterly failed to elevate the profiles of sinister figures like Reps. Paul Gosar, Marjorie Taylor Greene, Madison Cawthorn or Lauren Boebert.",
    "Sen. Rick Scott, chairman of the National Republican Senatorial Committee, is out with a plan that explicitly calls for raising taxes on 57% of American households.",
    "Parents of 60 million of America's 73 million children began receiving a check from the IRS of $300 a month for young children and $250 a month for older ones.",
    "Mona Charen\nApril 10 | 2022\nWhen voters are dissatisfied with the state of things, they punish the party in power, and Democrats seem poised for a thumping.",
    "Joe Manchin and Kyrsten Sinema were traitors who stood in the way of a different bill that was never described in any way except as a price tag.",
    "The legislation will begin the important process of mitigating the effects of climate change by building dikes, dams and other infrastructure.",
    "I also recall the Obama campaign commercial that falsely pinned responsibility for a woman's cancer death on Mitt Romney's firm.",
    "They get blamed for things they aren't responsible for, so they might as well take credit for things they didn't really affect.",
    "To read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate webpage at www.creators.com.",
    "Ninety percent of the attention has gone to what Democrats were (unrealistically) shooting for rather than what they achieved.",
    "Included in the American Rescue Plan was one policy that really was life-changing for many Americans — the child allowance.",
    "Skeptics might attribute that mostly to the waning of COVID-19, but that shouldn't stop politicians from bragging.",
    "All of the lead pipes in America are going to be replaced, saving God knows how many kids from brain damage.",
    "All of that was scurrilous, and I would never — truly never — suggest that Democrats lie about Republicans.",
    "Hiring is robust, wages are rising, unemployment is low, and the Dow Jones Industrial Average is at 35,000.",
    "Biden mentions it from time to time, but it should have been shouted, broadcast, trumpeted and crowed over.",
    "Her most recent book is Sex Matters: How Modern Feminism Lost Touch with Science, Love, and Common Sense.",
    "The unemployment rate dropped from 6.2 percent when Biden took office to 3.9 percent today.",
    "We used to say \"the ads write themselves,\" yet the Democrats can't seem to manage it.",
    "Mona Charen is policy editor of The Bulwark and host of the \"Beg to Differ\" podcast.",
    "With the exception of the inflation rate, the economic story is remarkably good.",
    "Yet the dominating story of Biden's first year-and-a-half was that Sens.",
    "So they drowned their own accomplishments in a miasma of recriminations.",
    "Under Biden, child poverty reached its lowest rate in American history.",
    "Sadly, the program has now lapsed, a victim of Democratic infighting.",
    "Yes, Biden had a good one-liner in his State of the Union address.",
    "It will repair roads, bridges and airports, and do much more.",
    "A bunch of progressives wanted to spend another $2 trillion.",
    "Advertising\nStart your day with National Memo Newsletter",
    "Nor have Democrats talked up the good economic numbers.",
    "Have you heard about this dramatic accomplishment?",
    "It isn't that Democrats have done nothing popular.",
    "How about that bipartisan infrastructure bill?",
    "And if not, what are they doing in politics?",
    "Could Democrats make something of that?",
    "But why can they not tell the truth?",
    "They just haven't advertised it.",
    "They used to be better at this.",
    "The stakes couldn't be higher.",
    "In fact, they've buried it.",
    "\"Don't defund the police.",
    "Have you heard about it?",
    "Get better Democrats.",
    "Fund the police.\""
  ]
}