{
  "id": 972,
  "mediaId": 2636,
  "date": "2022-04-07",
  "headline": "Legal Effort Expands to Disqualify Republicans as ‘Insurrectionists’",
  "image": "https://static01.nyt.com/images/2022/04/07/us/politics/07dc-insurrection-1/merlin_200434071_9b5d702a-f67f-43ce-b4ea-1f96cab87ee5-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/07/us/politics/insurrectionists-congress.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1726,
    1771,
    1911,
    1926,
    2830,
    4384,
    4392,
    878,
    4830,
    5128
  ],
  "sentences": [
    "And during the storming of the Capitol, Mr. Gosar used the social media site Parler, which is favored by the far right, to post an image of rioters scaling the building’s walls, writing, “Americans are upset.” As the riot raged, Mr. Gosar and Mr. Biggs led the effort to contest their state’s electors for Joseph R. Biden Jr.\nMr. Gosar would later say that Ashli Babbitt, the rioter shot by the police just outside the House chamber, had been “executed” and that investigating Jan. 6 was “harassing peaceful patriots.”\nThe suits say that their actions, “taken in concert with others,” establish that they “engaged in the insurrection of Jan. 6” and are “therefore constitutionally disqualified from running for congressional office, under the disqualification clause.”\nMr. Fein said the legal action was working along with the House committee investigating the Jan. 6 attack and the Justice Department to at least get lawmakers to answer questions under oath about the events surrounding the riot.",
    "That section declares that “no person shall” hold “any office, civil or military, under the United States, or under any state, who, having previously taken an oath” to “support the Constitution,” had then “engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.”\nA separate action is being pursued by a Democratic-aligned super PAC against Senator Ron Johnson and Representatives Tom Tiffany and Scott Fitzgerald, all Wisconsin Republicans.",
    "We’re not going after people who have a tenuous connection to the insurrection.”\nJames Bopp Jr., a conservative election lawyer who is defending Ms. Greene and Mr. Cawthorn, said the groups ultimately could take action against as many as two dozen Republican lawmakers, hoping to establish some legal precedent for trying to bar Mr. Trump from the presidential ballot in 2024.",
    "In all three suits, the plaintiffs claim that the politicians are disqualified from seeking office because their support for rioters who attacked the Capitol made them “insurrectionists” under the Constitution and therefore barred them under the little-known third section of the 14th Amendment, adopted during Reconstruction to punish members of the Confederacy.",
    "In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives Paul Gosar and Andy Biggs and State Representative Mark Finchem, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement.",
    "A legal effort to disqualify from re-election lawmakers who participated in events surrounding the Jan. 6, 2021, attack on the Capitol expanded on Thursday, when a cluster of voters and a progressive group filed suit against three elected officials in Arizona to bar them under the 14th Amendment from running again.",
    "More than a year after they tried and failed to use Congress’s final count of electoral votes on Jan. 6 to overturn the election, some Trump allies are pushing bogus legal theories about “decertifying” the 2020 vote and continuing to fuel a false narrative that has resonated with Mr. Trump’s supporters.",
    "The legal fight in the cases has come down to two questions: What is an insurrectionist, and did Congress in 1872 not only grant amnesty to those who supported and fought for the Confederacy but also to those who would take part in future insurrections, effectively nullifying Section 3?",
    "They argue that the Amnesty Act nullified the insurrection disqualification; that under the Constitution, only Congress can set the criteria for candidacy; and that efforts to object to Mr. Biden’s election were done legally, in accordance with the Electoral Count Act of 1887.",
    "Ron Fein, the legal director of Free Speech for People, said the effort was putting pressure on the Justice Department and the House committee investigating the Jan. 6 attack to take action against individual members of Congress — and to find remedies in court.",
    "Unless the judge, Amy Totenberg of Federal District Court for the Northern District of Georgia, issues a temporary restraining order, an administrative law judge is set to hear arguments next Wednesday on whether Ms. Greene should be removed from the ballot.",
    "“All of these efforts and threats are a desperate attempt to gain political advantage through unconstitutional actions,” Hans von Spakovsky, a senior legal fellow at the Heritage Foundation, wrote in an opinion essay last month.",
    "In Mr. Cawthorn’s case, a federal judge appointed by Mr. Trump blocked an inquiry into the congressman’s role in the Jan. 6 attack by ruling that the Amnesty Act of 1872 did indeed confer amnesty on all future insurrectionists.",
    "“The waiver of disability is the functional equivalent of a pardon,” said Gerard N. Magliocca, a constitutional law professor at the Indiana University Robert H. McKinney School of Law who has studied the insurrection clause.",
    "“Our goal is to reach a ruling by a competent state tribunal, which of course can be appealed to the highest levels if need be, that these individuals are in fact disqualified under Section 3 of the 14th Amendment,” he said.",
    "The judge, Richard E. Myers II, focused on a caveat within Section 3 of the 14th Amendment that said “Congress may by a vote of two-thirds of each House remove” the disqualification — or “disability” — for insurrection.",
    "The Justice Department has brought in a well-regarded new prosecutor to help run the inquiry, while a high-profile witness — the far-right broadcaster Alex Jones — is seeking an immunity deal to provide information.",
    "The House panel has grown divided over whether to make a criminal referral of former President Donald J. Trump to the Justice Department, even though it has concluded that it has enough evidence to do so.",
    "It was unclear whether the challenges would go anywhere; an initial skirmish, also led by Free Speech for People, failed to block Representative Madison Cawthorn’s candidacy in North Carolina.",
    "Mr. Gosar organized some of the earliest rallies to “Stop the Steal,” the movement to keep Mr. Trump in office, coordinating with Ali Alexander, a far-right activist, and with Mr. Finchem.",
    "But conservative election lawyers are growing frustrated with efforts that they see as legally specious harassment motivated by Democrats’ failure to vote conservatives out of office.",
    "You cannot license future illegality.”\nThe lawyers bringing the new suits believe they have a stronger case to show that the elected officials in question are insurrectionists.",
    "And on Friday, a federal judge in Atlanta will hear Representative Marjorie Taylor Greene’s effort to dismiss a case filed against her to strike her from the ballot in Georgia.",
    "The law currently gives presidents the authority to deploy the military to respond to a rebellion, and some fear it could be abused by a president trying to stoke one.",
    "But they were the latest bids to find a way to punish members of Congress who have encouraged or made common cause with those who stormed the Capitol on Jan. 6.",
    "Some lawmakers on the Jan. 6 House committee have begun discussions about rewriting the Insurrection Act in response to the events that led to the Capitol riot.",
    "On Dec. 22, 2020, Mr. Gosar and Mr. Biggs met with Mr. Trump and announced they were working to prevent the “disenfranchisement” of Trump voters.",
    "Bogged down with efforts to question Trump aides and advisers, the panel has not come close to questioning members of the House.",
    "A grand jury convened by federal prosecutors must sift through dozens of low-level witnesses before moving on to bigger targets.",
    "Mr. Finchem then joined protesters who marched to the Capitol and eventually breached it, though he did not enter the building.",
    "He said he was in Washington to provide evidence to Vice President Mike Pence of what he called fraud in the Arizona election.",
    "In the run-up to Jan. 6, Mr. Gosar and Mr. Biggs repeatedly posted the falsehood that Mr. Trump had won the election.",
    "The debate centers on whether a referral would backfire by politically tainting the expanding federal investigation.",
    "Mr. Finchem attended the rally at the Ellipse on Jan. 6 that in many ways launched the attack on the Capitol.",
    "The House committee still faces defiant witnesses who have refused to comply with subpoenas.",
    "Mr. Gosar, Mr. Biggs and Mr. Finchem did not immediately respond to requests for comment.",
    "The federal investigation into the Jan. 6 attack appears to be gaining momentum.",
    "Capitol Riot’s Aftermath: Key Developments\nCard 1 of 5\nSigns of progress.",
    "“They are a waste of time and resources and should be dismissed as such.”",
    "“Pardons by presidents or governors cannot be for the future.",
    "“This sedition will be stopped,” Mr. Gosar wrote on Twitter.",
    "The Amnesty Act was passed by that wide of a margin.",
    "That ruling remains in dispute and is on appeal.",
    "And with enough test cases, one might succeed.",
    "Weighing changes to the Insurrection Act.",
    "“Judges do make a difference,” he said.",
    "“These are even stronger cases.",
    "Debating a criminal referral.",
    "Continuing election doubts."
  ]
}