{
  "id": 1044,
  "mediaId": 2621,
  "date": "2022-04-05",
  "headline": "J.D. Vance Asks Ohio’s Voters if They ‘Hate Mexicans’ in New Senate Ad About Fighting Drugs",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-05-at-5.06.59-PM-e1649197192826.png",
  "link": "https://www.mediaite.com/politics/j-d-vance-asks-ohios-voters-if-they-hate-mexicans-in-new-senate-ad-about-fighting-drugs/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kipp Jones",
  "authorUrl": "https://www.mediaite.com/author/kipp-jones/",
  "termIds": [
    3466,
    3975,
    878,
    1171,
    5143,
    5212
  ],
  "sentences": [
    "Vance (@JDVance1) April 5, 2022\nStanding before a suburban backdrop, Vance smiled as the ad transitioned to an image of an American flag flying proudly before a completed section of Trump’s border wall.",
    "He also asked them if they “hate Mexicans.”\nThe gist of his message was that people who are in favor of securing the southern border should ignore vague accusations they hold prejudices against others.",
    "But Vance’s overall message was drowned out by the absurdity and hilarity of the ad, which looked like a spoof produced by Saturday Night Live.",
    "Vance of Ohio dropped a peculiar political ad Tuesday in which he asked voters to ignore attacks from the left decrying them as racists.",
    "Vance, who embraces the “great replacement” theory, continued,\nThe media calls us racist for wanting to build Trump’s wall.",
    "His story, which Netflix made into a film, chronicled his difficult childhood and mother who suffered from drug addiction.",
    "Joe Biden’s opened border is killing Ohioans with more illegal drugs and more Democrat voters pouring into this country.",
    "It’s also clear that many of those drugs are coming across a border which is, as Vance stated, anything but secure.",
    "It is true that one’s opinion on securing a sovereign border in this country can be accompanied by name-calling.",
    "He is running among a crowded field of candidates who are loudly vying to replace retiring Sen.",
    "It’s impossible to deny that drugs such as fentanyl torment American families nationwide.",
    "Vance has reportedly been down in the polls in what has been a circus of a GOP primary.",
    "But the ad quickly went viral over the way the Hillbilly Elegy author framed the issue.",
    "Vance was obviously attempting to use his personal experience to connect with voters.",
    "The ad received just short of 1 million views in less than 24 hours.",
    "“Whatever they call us, we will put America first,” he concluded.",
    "I nearly lost my mother to the poison coming across our border.",
    "“Are you a racist?” Vance asked to begin the 30-second spot.",
    "They censor us, but it doesn’t change the truth.",
    "No child should grow up an orphan.",
    "Republican Senate Candidate J.D.",
    "“Do you hate Mexicans?”\n— J.D.",
    "Maybe that was intentional.",
    "Have a tip we should know?",
    "This issue is personal.",
    "Rob Portman (R-OH).",
    "tips@mediaite.com"
  ]
}