{
  "id": 1116,
  "mediaId": 2641,
  "date": "2022-04-03",
  "headline": "JD Vance: 'Ridiculous Notions of Gender' Threaten US World Leadership",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=85bd28f0-d2a1-425f-8bb4-8620ad2a5fa5&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/jd-vance-gender-ohio-senate/2022/04/03/id/1064079/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Mack",
  "authorUrl": "",
  "termIds": [
    3466,
    3709,
    4526,
    764,
    767,
    1171,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "\"I think a lot of countries look at the United States as the leader of the free world; they're not going to look at us like that if we keep on pushing ridiculous notions of gender with the children, not just here, but everywhere else too,\" Vance told The Epoch Times this week.",
    "\"Like a lot of people, I criticized Trump back in 2016, and I ask folks not to judge me based on what I said in 2016, because I've been very open that I did say those critical things and I regret them, and I regret being wrong about the guy,\" Vance said last summer.",
    "\"It’s not just Biden — the entire administration has created this super ridiculous posture with Russia and Ukraine,\" Vance said, the Times reported, of Biden saying Vladimir Putin cannot remain in power in Russia.",
    "\"Pushing the worst of American progressivism on the rest of the world — I don't want my tax dollars to go to that,\" Vance told a foreign policy conference \"Up from Chaos,\" according to the Times.",
    "Vance, who is in a competitive Ohio GOP Senate primary, added pushing gender ideology is \"something you do when you think about diplomacy in purely moralistic instead of strategic terms.\"",
    "Vance, a Marine Corps veteran who served in Iraq, has focused his ire on sitting President Joe Biden and his administration for foreign policy failures that were not seen under Trump.",
    "Vance also denounced the massive spending to aid Ukraine, including $13.6 billion in the government funding package and proposed 2023 budget adding another $682 million to Ukraine.",
    "The May 3 Ohio GOP Senate primary candidates are all jockeying for the endorsement of former President Donald Trump, but Vance was once critical of Trump before apologizing for it.",
    "Former Ohio Treasurer Josh Mandel, former Ohio Republican Party Chair Jane Timken, and entrepreneur Mike Gibbons are the other top contenders in the Ohio GOP Senate primary.",
    "\"I think if we're going to send money to Ukrainians, which I'm not opposed to doing, it should be conditional on spending resources to solve our problems here at home.",
    "\"I think it's excessive in light of the fact that we haven't spent nearly enough resources to solve our own problems, like the southern border crisis,\" Vance said.",
    "Vance denounced America's radical push of \"ridiculous notions of gender\" as harmful to its position in the world.",
    "If we give money to Ukrainians, it should be conditioned on something that serves our interests.\"",
    "I think he made a lot of good decisions for people, and I think he took a lot of flak.\"",
    "\"It’s simultaneously very antagonistic and also very weak.\"",
    "\"I think he was a good president.",
    "Ohio Senate candidate J.D.",
    "Special Links:"
  ]
}