{
  "id": 1488,
  "mediaId": 2742,
  "date": "2022-04-03",
  "headline": "Biden’s Border Crisis Forcing Republicans To Focus On Immigration—Even Alabama’s Katie Britt!",
  "image": "https://vdare.com/public_upload/publication/featured_image/57276/VDARE-primaries.jpg",
  "link": "https://vdare.com/articles/biden-s-border-crisis-forcing-republicans-to-focus-on-immigration-even-alabama-s-katie-britt",
  "mediaOutlet": "VDARE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I will be damned if I am going to prioritize Ukraine’s eastern border right now when our own southern border is engulfed by a human tsunami of illegal migrants,” he wrote in a recent column ['I will be damned' if Ukraine prioritized over 'Tsunami of illegal migrants', Columbus Dispatch, March 31, 2022].",
    "Last week, the Senate Republican Conference sent out a memo to its members with talking points the party should emphasize to illustrate the importance of immigration [Senate GOP To Crank Up The Heat On Biden Border Crossings, by Ryan Lizza, Rachael Bade, and Eugene Daniels, Politico, March 30, 2022].",
    "Britt is the Establishment candidate, vying for Trump’s support after the former president rescinded his endorsement of long-time immigration patriot Mo Brooks [Trump rescinds Brooks endorsement in Senate race in Alabama, by Kim Chandler and Jill Colvin, Associated Press, March 23, 2022].",
    "Washington congressional candidate Joe Kent, New York congressional candidate Andrew McCarthy, and Florida congressional candidate Anthony Sabatini also call for immigration moratoriums, as do celebrity candidates Laura Loomer in Florida and Neil Kumar in Arkansas.",
    "[BIDEN’S BORDER CRISIS IS THE WORST IN AMERICAN HISTORY, Senate Republican Conference, March 30, 2022]\nThe SRC memo also details Biden’s disastrous “Open Border” policies, which have essentially ended border security and internal immigration enforcement.",
    "Check out the main photo and some of his tweets:\n“Working on how to stop illicit drug trafficking” is pretty rich coming from an Open Borders guy https://t.co/nkxJmJPFK7\n— Blake Masters (@bgmasters) April 2, 2022\nSome candidates go even farther.",
    "Britt’s new platform calls for immigration reduction across the board, the curtailment of guest worker programs, mandating e-Verify, and reforming birthright citizenship so that it only applies to the children of parents lawfully in America.",
    "We'd love to take them back.”\n[Trump Doctrine 2.0: Former president lays out plan to reverse Biden agenda, by John Solomon, Just The News, March 29, 2022]\nOf course, immigration patriots must applaud Republicans for focusing on the issue.",
    "Her new immigration platform is one of the best offered by a Republican Senate candidate [Alabama Senate candidate Katie Britt releases immigration platform, pledging to put American workers first, by Adam Shaw, Fox News, March 29, 2022].",
    "— Andrew McCarthy (@AMcCarthyNY) January 2, 2022\nTOTAL IMMIGRATION MORATORIUM NOW\n— Rep. Anthony Sabatini (@AnthonySabatini) July 3, 2021\nAll this shows why Republican leaders must do more than denounce Biden’s border treason.",
    "Despite being a political newcomer with no history of elected office, Masters leads the packed Arizona race in some polls [Blake Masters leads in Arizona Senate poll, by David Drucker, Washington Examiner, May 21, 2022].",
    "He seemed to imply support for mass deportation of illegals and said America should threaten to cut off aid to countries that refused to take back their people:\nWe have to immediately seal up the border.",
    "The Border Patrol warned the country was about to get “wrecked” [Biden administration to lift Title 42 at end of May, despite fears of looming migrant wave, by Adam Shaw, Fox News, April 1, 2022].",
    "In contrast, Trump at least endorsed deportation and the ending foreign aid to Third World states that won’t take back “migrants.” That’s more than the current congressional Republican leadership.",
    "Currently, any woman who enters the U.S. illegally and has an anchor baby here has given birth to what is technically an American citizen, even if she has only been in the U.S. for minutes.",
    "A 10 year moratorium gives the American worker a leg up, enhances national security, checks big tech’s unfair labor practices, and provides data depicting the realities of open borders.",
    "This legislation removed common-sense numerical caps and created a chain-migration system, leading to more than one million immigrants entering America every single year.",
    "Discarding the use of this sensible immigration law to deport illegal aliens for health reasons—in this case, the Flu Manchu—will, of course, worsen the border crisis.",
    "In a wide-ranging interview last week, the former president outlined what his party’s focus should be in the midterms: immigration and the border crisis.",
    "Brooks also boasts a solid immigration platform, but it does not outline specific policies like Britt’s, although it does support immigration reduction.",
    "The SRC puts a law-and-order spin on immigration by warning that Biden’s policies empower drug cartels and allow their poisons into the United States.",
    "pic.twitter.com/bqDMrsLbIv\n— Joe Kent for WA-3 (@joekent16jan19) October 30, 2021\nEnding immigration in America will be a priority in my office.",
    "That’s a line you rarely hear from Republicans, so it is reassuring that at least one Republican wants to do it—and has the courage to say it.",
    "VDARE.com has detailed his many attempts at cucking, from favoring various forms of Amnesty to championing the anti-white Juneteenth holiday.",
    "Biden’s border treason and open refusal to enforce U.S. immigration law has compelled even Establishment Republicans to focus on immigration.",
    "Republicans must push for cuts to legal immigration, mandatory e-Verify, and ending birthright citizenship, an especially important issue.",
    "Granted, the SRC memo discussed strengthening border security, stronger detention policies, and support for Title 42 and Remain in Mexico.",
    "Biden’s border policies are creating a growing national security crisis, and threatening the safety of Americans across the country.",
    "While other Ohio candidates don’t touch legal immigration, Vance’s opponents talk tougher about illegals than current Republicans.",
    "As I reported here before, she was the lone Republican candidate in the Alabama primary to call for more immigration.",
    "President Biden has undermined America’s border security and the integrity of our immigration system at every turn.",
    "Beside ending Title 42, he’s trying to end Remain in Mexico, and eased the procedure for illegals to claim asylum.",
    "Her new plan specifically denounces mass immigration and sees the root of the problem in the 1965 Immigration Act.",
    "As a practical matter, she and her partner won’t be deported and the citizen child will grow up to vote Democrat.",
    "They hesitate to discuss deportation, ignore Birthright Citizenship, and don’t want to touch legal immigration.",
    "… And we have to get a lot of the people out because many of these people came from prisons in these countries.",
    "During a debate last week, former Ohio treasurer Josh Mandel said America should deport every single illegal.",
    "Arizona Senate primary candidate Blake Masters also focuses on immigration instead of foreign entanglements.",
    "They must discuss and promote policies and introduce legislation and force the Democrats to vote it down.",
    "Two signs of the GOP’s interest in immigration come from GOP congressional leadership and Donald Trump.",
    "Unlike most Republicans, he says America’s lawmakers should focus more on immigration than Ukraine.",
    "Republicans must exploit it, demand tougher immigration policies, and implement them when they win.",
    "Like Britt, he supports reducing legal immigration and reforming our system to put Americans first.",
    "The three basic points:\nUnder Joe Biden, America is facing the worst border crisis in our history.",
    "Britt’s reversal shows she knows that to win the MAGA base, she must be an immigration patriot.",
    "Reps. Paul Gosar and Marjorie Taylor Greene introduced immigration moratorium bills last year.",
    "Biden’s own people have predicted as many as 18,000 illegals per day will cross the border.",
    "And unlike Senate Republicans, he called for more than just reinstating his old policies.",
    "But even a cuck like Cornyn understands that immigration is now a winner for Republicans.",
    "He demands immigration reduction, seriously reduced guest workers, and mandated e-Verify.",
    "America’s immigration policies have been good for foreigners who want to come to America.",
    "Unhappily, though, Republican congressional leaders aren’t proposing proactive solutions.",
    "We're not going to pay you the hundreds of millions.” Then they said, “Yes, absolutely.",
    "This has driven down the wages of Alabamians, especially those without college degrees.",
    "Politico reports he met with his colleagues and emphasized the issue’s importance.",
    "Good news is, Republicans on the campaign trail are offering proactive solutions.",
    "She cannot hope to secure their support campaigning on a Business First agenda.",
    "We’re taking them out by the thousands, bringing them back to their countries.",
    "The Biden Regime will scrap the implementation of Title 42 at the end of May.",
    "Immigration will be one of the central issues of the 2022 campaign.",
    "And it is showing up, sometimes surprisingly, in GOP primaries.",
    "I said, “That’s OK. We're not going to pay the country anymore.",
    "Washington Watcher II [Email him] is an anonymous DC insider.",
    "One surprise came from Alabama Senate candidate Katie Britt.",
    "Masters’ Twitter feed, by the way, is a breath of fresh air.",
    "We need an immigration moratorium to put #AmericaFirst ????",
    "Republicans must insist on ending this suicidal policy.",
    "Vance made immigration a chief focus of his campaign.",
    "This effort appears to be led by Texas’ John Cornyn.",
    "However, Britt has seemingly come to her senses.",
    "But they have been bad for American workers.",
    "Cornyn is an odd figure to lead this fight.",
    "Other GOP hopefuls propose good policies.",
    "It’s an idea people can no longer ignore.",
    "His strategy appears to be working.",
    "But those won’t solve the problem.",
    "Trump, of course, knows this too.",
    "Ohio Senate candidate J.D.",
    "Their countries said no.",
    "That needs to change.",
    "Put Americans First.",
    "Talk is not enough."
  ]
}