{
  "id": 1518,
  "mediaId": 2727,
  "date": "2022-04-04",
  "headline": "Texas Sen. Cruz endorses fellow pro-Trump conservative Mandel in Ohio primary",
  "image": "https://static.timesofisrael.com/www/uploads/2022/04/AP22094416095201-e1649075194110-1024x640.jpg",
  "link": "https://www.timesofisrael.com/texas-sen-cruz-endorses-fellow-pro-trump-conservative-mandel-in-ohio-primary/",
  "mediaOutlet": "Time of Israel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JULIE CARR SMYTH",
  "authorUrl": "https://www.timesofisrael.com/writers/julie-carr-smyth/",
  "termIds": [
    1804,
    2201,
    3151,
    878,
    1171,
    4910,
    4916,
    5351
  ],
  "sentences": [
    "In a statement to The Associated Press, Cruz said he chose Mandel because he will stand up to “radical democrats” who want to exploit crises facing the nation “to deliver socialism to America.”\n“A United States Marine, Josh is a proven fighter for our American way of life, a champion for the unborn, and a stalwart advocate for our religious liberties,” Cruz said.",
    "Mandel has also been endorsed by North Carolina Rep. Madison Cawthorn, who has received criticism from a larger swath of Republicans for recent comments, including one in which he called Ukrainian President Volodymyr Zelensky a “thug.” Utah Sen. Mike Lee, a conservative ally of Cruz, is also supporting Mandel.",
    "In an interview, Mandel said that if he is elected, he looks forward to “being reinforcements for conservative fighters like Ted Cruz.”\nAdvertisement\n“As we’ve seen in his 10 years in the Senate, he takes on squishy establishment Republicans just as fast as he takes on leftist Democrats,” Mandel said.",
    "COLUMBUS, Ohio (AP) — Texas Sen. Ted Cruz endorsed former Ohio Treasurer Josh Mandel on Monday in the heated Republican primary for an open US Senate seat, a potentially critical campaign boost just as early voting is set to begin in the Midwestern battleground.",
    "This is about standing up for the Constitution, for traditional American values, and saving the country for our kids and grandkids.”\nCruz has made a series of endorsements in this year’s primaries as he looks to the future.",
    "Cruz’s decision could be particularly valuable among conservative voters in the absence of an endorsement in the race by Donald Trump, who has yet to weigh in despite candidates working hard to woo him — and he may not.",
    "“One of the things we’ve seen is, probably second to Trump, an endorsement from Ted Cruz signals the person he’s endorsing is a true believer and a fighter for the things they believe in,” he said.",
    "As The Times of Israel's Diplomatic Correspondent, I'm well aware that Israel's security, strategy and national interests are always scrutinized and have serious implications.",
    "Financial support from readers like you allows me to travel to witness both war (I just returned from reporting in Ukraine) and the signing of historic agreements.",
    "Cruz, who sought the GOP presidential nomination in 2016 that Trump won and may run again in 2024, is one of the highest-profile Republicans in the Senate.",
    "Polling shows Cleveland investment banker Mike Gibbons slightly edging Mandel at the top of the crowded GOP field vying to replace retiring Republican Sen.",
    "He and Mandel, a Jewish pro-Israel conservative from suburban Cleveland, share an affinity for trying to exploit cultural divisions for political gain.",
    "And it enables The Times of Israel to remain the place readers across the globe turn to for accurate news about Israel's relationship with the world.",
    "If it's important to you that independent, fact-based coverage of Israel's role in the world exists and thrives, I urge you to support our work.",
    "The conservative group Club for Growth helped elect Cruz in 2012 in a competitive race and it’s working this year to put Mandel in office.",
    "It takes balance, determination, and knowledge to accurately convey Israel's story, and I come to work every day aiming to do so fully.",
    "Vance has the backing of Missouri Sen. Josh Hawley and Reps. Jim Banks of Indiana and Marjorie Taylor Greene of Georgia.",
    "For the Senate, he is backing businessman David McCormick in Pennsylvania and Missouri Attorney General Eric Schmitt.",
    "Also running in the May 3 primary are former state Republican chair Jane Timken, author and venture capitalist J.D.",
    "“Because for Ted, and for me, this is not about (a) Republican vs. Democrat, shirts vs. skins type game.",
    "President David McIntosh said the group’s polling shows Gibbons and Mandel neck and neck.",
    "Shelley Moore Capito of West Virginia, Joni Ernst of Iowa and Deb Fischer of Nebraska.",
    "Israel is now a far more prominent player on the world stage than its size suggests.",
    "Portman endorsed Timken in February, as did former Trump adviser Kellyanne Conway.",
    "Vance, state Sen. Matt Dolan and entrepreneurs Mark Pukita and Neil Patel.",
    "Thank you,\nLazar Berman, Diplomatic Correspondent\nAdvertisement",
    "Gibbons has the support of Kentucky Sen. Rand Paul.",
    "Will you join The Times of Israel Community today?",
    "Timken also has the support of Sens.",
    "Early voting begins Tuesday.",
    "Rob Portman."
  ]
}