{
  "id": 1529,
  "mediaId": 4032,
  "date": "2022-04-04",
  "headline": "Anti-interventionist Republicans Turn Up Heat in War With Neocons",
  "image": "https://thenewamerican.com/assets/sites/2/Soldiers-helicopters.jpg",
  "link": "https://thenewamerican.com/anti-interventionist-republicans-turn-up-heat-in-war-with-neocons/?pk_campaign=feed&pk_kwd=anti-interventionist-republicans-turn-up-heat-in-war-with-neocons",
  "mediaOutlet": "New American",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luis Miguel",
  "authorUrl": "https://thenewamerican.com/contributor/luis-antonio-miguel/",
  "termIds": [
    1503,
    2201,
    2403,
    2903,
    3466,
    831,
    878,
    5371
  ],
  "sentences": [
    "The “mimetic tactics” that “you remember from the coronavirus,” Black Lives Matter and now Ukraine, he said, suggest that “somehow the interventionists have learned to adapt or modify their mind control strategies.”\nAll around, there were good words for the legacy of President Donald Trump and his efforts to keep the United States out of war and to bring troops home from entanglements abroad.",
    "“With Ukraine, they’re back.”\nWilliam Ruger, a Trump nominee to become ambassador to Afghanistan and the president of the American Institute for Economic Research (AIER), told Politico:\n“The neocons seem strangely buoyed by the current crisis, and love the Manichaean rhetoric coming out of the White House about this being a fight between democracy and authoritarianism.",
    "In the future, Vought said, “it will take a president that has the confidence to reject the experts and expose them.”\nRand Paul stated he has “no sympathy” for Russia’s invasion of Ukraine, but expressed concern for Republican recidivism — falling back into the interventionism that distinguished the GOP during the Bush years.",
    "It was organized by the American Conservative magazine and American Moment, whose self-described mission is to “identify, educate, and credential young Americans who will implement public policy that supports strong families, a sovereign nation, and prosperity for all,” and which features Vance on its board of advisers.",
    "As the war in Ukraine continues to dominate the news cycle and establishment Republican voices largely echo the mainstream media’s talking points on the conflict, the already-existent rift between that wing of the party and the Trumpian wing is now growing deeper in light of stark foreign-policy differences.",
    "Their explicit aim is to create a young counter-establishment to the hawkish national security network that has flourished in Washington over the past several decades, one that could funnel ideologically reliable appointees into a future Trump, DeSantis, Cruz or Hawley administration….",
    "Russ Vought, the president of the Center for Renewing America and the director of the Office of Management and Budget under Trump, for example, complained about the “bombardment of the neocon moment that we are in.” For Vought, Ukraine seemed to be a sideshow.",
    "This was punctuated strongly at a recent meeting of Trump-aligned Republicans at the Marriott Marquis hotel in downtown D.C., which featured notable attendees such as Sen. Rand Paul (R-Ky.), Rep. Thomas Massie (R-Ky.), and U.S. Senate candidate J.D.",
    "Unlike twenty years ago, the American public will not swallow neocon bromides.”\nThe outlet further noted:\nThe participants generally described themselves as “realists” and “restrainers,” and the meeting featured what amounted to realist royalty….",
    "I need you to be some of them.”\nThe “Up From Chaos” conference highlighted the Trump wing’s stance on foreign intervention, which contrasts with the trigger-happy attitude of the neoconservative war hawks in the GOP.",
    "These are the questions that leaders should be considering.” In 2019, Trump, he claimed, was concerned about how Ukraine would dispose of American military aid and sensibly ordered a temporary suspension.",
    "Rep. Dan Bishop (R-N.C.) praised Trump, saying the 45th president “deserves credit for breaking the neocon Republican orthodoxy” and that it is vital to glean lessons of “style and substance from Trump.",
    "But an “essentially imperialist” network of foreign policy elites that is oriented towards conformity “freaked out” and it “led to stark consequences for the president” — a polite term for impeachment.",
    "Michael Anton, a former Trump administration official and author of the controversial Flight 93 Election, said of the neocons:\n“What’s alarming is Ukraine,” and how quickly the media took its side.",
    "Speakers at the conference stressed that America must not let the neocons use Ukraine as a pretext for once more involving the country in overseas conflicts.",
    "“The neocons haven’t been able to put points on the board for years,” said Melinda Haring, deputy director of the Atlantic Council’s Eurasia Center.",
    "“Using American power to do the dirty work of Europe is a pretty bad idea,” Vance told the crowd of about 100 conservatives on Thursday.",
    "The real question, he said, is, “Why haven’t we brought our troops home from Europe?",
    "But the forces of realism and restraint are not going to back down from the fight.",
    "“We don’t have that many non-insane people in Washington.",
    "The divide within the GOP continues to grow.",
    "We must break away from groupthink.”",
    "Vance."
  ]
}