{
  "id": 160,
  "mediaId": 2557,
  "date": "2022-04-15",
  "headline": "BREAKING: Trump makes endorsement for GOP candidate in crowded Ohio U.S. Senate race",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/102401645_tv031779980-1.jpg",
  "link": "https://dennismichaellynch.com/breaking-trump-makes-endorsement-for-gop-candidate-in-crowded-ohio-u-s-senate-race/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    0
  ],
  "sentences": [
    "Trump’s full statement reads as follows:\nMAGA patriots from across the nation are set to deliver an election landslide for Republicans that will serve as a devastating rebuke of the failures of Joe Biden and the Radical Left Democrats.",
    "He’s strong on the Border, tough on Crime, understands how to use Taxes and Tariffs to hold China accountable, will fight to break up Big Tech, and has been a warrior on the Rigged and Stolen Presidential Election.",
    "This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race — they’ve said great things about “Trump” and, like me, they love Ohio and love our Country.",
    "It is time for the entire MAGA movement, the greatest in the history of our Country, to unite behind J.D.’s campaign because, unlike so many other pretenders and wannabes, he will put America First.",
    "https://t.co/mh1baSgFrU\n— Donald Trump Jr. (@DonaldJTrumpJr) April 15, 2022\nRyan, the presumed Democrat front-runner, fired back in response to Trump’s endorsement of Vance:\n“It’s official.",
    "The Democrats will be spending many millions of dollars, but the good news is that they they have a defective candidate who ran for President and garnered exactly zero percent in the polls.",
    "He’s the real deal folks, that’s why my dad & I are both supporting him!”\nI’ve gotten to know @JDVance1 personally over the past year & I’m convinced that he’s 100% America First.",
    "Former President Donald Trump released a statement on Friday evening, announcing who he has chosen to endorse for the heated U.S. Senate race in Ohio, to replace Republican Sen.",
    "is a Marine who served in the Iraq War, a graduate of The Ohio State University, and earned a Law Degree from Yale — a great student.",
    "Vance pic.twitter.com/KVLpipj1bg\n— Liz Harrington (@realLizUSA) April 15, 2022\nDonald Trump Jr. also confirmed his support for Vance.",
    "Vance is a Silicon Valley elitist and a phony, and we’ll beat him come November.”\n“We’re beating JD Vance in the polls by one point.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent — dangerous because they will have so much money to spend.",
    "Rush a donation now: https://t.co/qzkuU333fM\n— Tim Ryan (@TimRyan) April 15, 2022\nListen to the latest daily DML podcasts below!",
    "He tweeted:\n“I’ve gotten to know @JDVance1 personally over the past year & I’m convinced that he’s 100% America First.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "Donald Trump just called me “dangerous” to Republicans in a “tough race” and threw his support behind JD Vance.",
    "Without calling him out by name, Trump also made reference to the Democrat front-runner, Rep. Tim Ryan.",
    "The leftwing media, the Dems & the weak RINOs all HATE him because they know he stands with #MAGA.",
    "The leftwing media, the Dems & the weak RINOs all HATE him because they know he stands with #MAGA.",
    "Ohio has been good to me, I won it twice, really BIG, and I have likewise been GREAT for Ohio.",
    "Vance had been a critic of Trump in 2016, and Trump addressed that in his statement on Friday.",
    "In the Great State of Ohio, the candidate most qualified and ready to win in November is J.D.",
    "We can win this race and flip Ohio blue, but only if we have the resources to fight back.",
    "We can win this race and flip Ohio blue, but only if we have the resources to fight back.",
    "But we’re expecting this endorsement to bring a new wave of outside money and attacks.",
    "But we’re expecting this endorsement to bring a new wave of outside money and attacks.",
    "will destroy him in the debates and will fight for the MAGA Movement in the Senate.",
    "He’s the real deal folks, that’s why my dad & I are both supporting him!",
    "Rush a donation now.”\nWe’re beating JD Vance in the polls by one point.",
    "Vance, 37, a conservative commentator, venture capitalist, and author.",
    "He is our best chance for victory in what could be a very tough race.",
    "The bottom line is, we must have a Republican victory in Ohio.",
    "Several other Republicans are running for the seat as well.",
    "President Donald J. Trump announces his endorsement of J.D.",
    "The primary election in Ohio is scheduled for May 3.",
    "I’ve studied this race closely and I think J.D.",
    "Vance has my Complete and Total Endorsement.",
    "Vance, Ohio gets both brains and brawn.",
    "Trump said his endorsement goes to J.D.",
    "Rob Portman, who is retiring.",
    "He will not let you down.",
    "MAKE AMERICA GREAT AGAIN!",
    "It is all about winning!",
    "Like some others, J.D.",
    "We cannot play games.",
    "Let’s keep it going!",
    "In other words, J.D.",
    "Then please share.",
    "However, J.D.",
    "With J.D.",
    "Vance.",
    "J.D.",
    "NEW!"
  ]
}