{
  "id": 1631,
  "mediaId": 2660,
  "date": "2022-04-01",
  "headline": "In Ohio US Senate race, Mandel falsely claimed that Gibbons said military service isn’t ‘real work’",
  "image": "https://static.politifact.com/politifact/rulings/meter-false.jpg",
  "link": "https://www.politifact.com/factchecks/2022/apr/01/josh-mandel/ohio-us-senate-race-mandel-falsely-claimed-gibbons/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    1804,
    2323,
    878,
    1171,
    5212
  ],
  "sentences": [
    "The Dispatch reported that Mandel earned less than some of his opponents in the Senate race, but campaign disclosures showed \"the business dealings of a man accustomed to public life who suddenly — and quietly — started to make his way in the private sector.\"",
    "While Mandel’s employment has largely been in the public sector, he has earned large sums as a member of corporate boards and by joining startups, the Columbus Dispatch reported in August 2021.",
    "In searches of Google and Nexis, a database for news and other information sources, we found no instances of Gibbons saying that military service doesn’t count as real work.",
    "Besides Mandel and Gibbons, the Republican candidates include Ohio state Sen. Matt Dolan, former Ohio Republican Party chair Jane Timken and \"Hillbilly Elegy\" author J.D.",
    "Mandel, a former Marine, former state lawmaker and former state treasurer, capitalized on the testy exchange by producing an attack ad against Gibbons, a businessman.",
    "Seconds later, the two were standing toe to toe and this exchange occurred:\nGibbons: \"You may not understand this because you’ve never been in the private sector.\"",
    "Gibbons, whose son is a Navy pilot, then responded with an ad of his own, saying Mandel is \"lying\" in claiming that Gibbons doesn’t respect military service.",
    "Ohio race could help decide Senate control\nThe Ohio Senate seat is opening because the incumbent, Republican Rob Portman, is not seeking reelection.",
    "News video of the March 18 debate, which also included the other three major GOP candidates, shows that Mandel criticized Gibbons’ business deals.",
    "Josh Mandel and Mike Gibbons, two of the Republicans running for U.S. Senate in Ohio, nearly got physical at one point during a debate.",
    "Overall, the Ohio race is rated variously by campaign watchers as \"lean\" Republican, \"likely\" Republican and \"solid\" Republican.",
    "USA Freedom Fund, a super PAC formed to support Mandel’s campaign, followed up with a similar attack on Gibbons in its own ad.",
    "After Gibbons rose, Mandel continued his criticism, and Gibbons objected to Mandel’s characterizations of his business deals.",
    "Gibbons said in a debate that Mandel has never worked in the private sector; he didn’t say what this ad claims.",
    "RELATED: Fact-checking whether Biden’s Russia sanctions over Ukraine didn’t start for 30 days, had loopholes",
    "She opens the ad by saying:\n\"Mike Gibbons has the nerve to say military service doesn’t count as real work.\"",
    "The leading Democratic candidates are U.S. Rep. Tim Ryan and consumer protection attorney Morgan Harper.",
    "Our ruling\nMandel claimed in an ad that Gibbons said \"military service doesn't count as real work.\"",
    "The TV spot features Ohio resident Sheila Nowacki, the mother of a marine killed in Iraq in 2005.",
    "After some crosstalk, the exchange ends with:\nGibbons: \"You’re dealing with the wrong dude.\"",
    "Both the GOP and the Democratic Senate primaries, to be held May 3, are contested.",
    "If Your Time is short\nGibbons said Mandel has never worked in the private sector.",
    "Gibbons: \"Back off, buddy, or you’re going to end up —\nMandel: \"You back off.\"",
    "Mandel’s campaign told PolitiFact it did not want to comment on its ad.",
    "Gibbons: \"You’ve never been in the private sector in your entire life.\"",
    "He then sat down, and Gibbons was asked if he wanted to rebut.",
    "He didn’t say that military service doesn’t count as work.",
    "Featured Fact-check\nMandel: \"Two tours in Iraq.",
    "Mandel: \"No, you’re dealing with the wrong guy.",
    "That’s not what Gibbons said in the debate.",
    "Don’t tell me I haven’t worked.\"",
    "Don’t tell me I haven’t worked.\"",
    "Gibbons: \"You don’t know squat.\"",
    "Gibbons: \"You don’t know squat.",
    "Don’t tell me I haven’t worked.",
    "We rate Mandel’s claim False.",
    "Mandel: \"Two tours in Iraq.",
    "Mandel: \"I understand it.\"",
    "Gibbons: \"No, you don’t.",
    "Mandel: \"I worked, sir.\"",
    "You watch what happens.\"",
    "You watch what happens.",
    "You don’t know squat.\"",
    "Mandel: \"I do.\"",
    "Vance."
  ]
}