{
  "id": 1637,
  "mediaId": 2740,
  "date": "2022-04-01",
  "headline": "What to know about Jane Timken, the ex-Ohio GOP chair running for Senate",
  "image": "https://www.gannett-cdn.com/presto/2022/03/31/USAT/3f7e9788-69a7-4cdf-855a-161eb01cf701-USATSI_16857104.jpg?crop=3599,2025,x0,y408&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/04/01/who-is-jane-timken-ohio-gop/7222395001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatodaycomwashington-topstories",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Orlando Mayorquin",
  "authorUrl": "https://www.usatoday.com/staff/6610183001/orlando-mayorquin/",
  "termIds": [
    1418,
    1804,
    2201,
    3466,
    4526,
    305,
    767,
    878,
    975,
    1171
  ],
  "sentences": [
    "Like much of the rest of the field, Timken is billing herself as the “Trump” candidate,though he gave his much anticipated endorsement to venture capitalist and author JD Vance just weeks before the primary election.",
    "Timken has made the Republican-waged battle against school curriculums that teach the United States’ history of injustice a focal point of her campaign, decrying the “Left’s ‘woke’ education agenda.\"",
    "Timken will face off against a list of candidates that includes Vance, businessman Mike Gibbons, former Ohio treasurer Josh Mandel and others in the Republican primary election on May 3.",
    "Timken supports continuing construction on the wall at the U.S.-Mexico border that began under Trump, rejecting amnesty for undocumented immigrants and increasing deportations.",
    "Timken is the former chair of the Ohio Republican Party, a position she held from 2017 until she resigned in February 2021 ahead of launching her campaign for Senate.",
    "A former Ohio GOP chair who rose to power with the backing of former President Donald Trump now wants to represent the Buckeye State in the U.S. Senate.",
    "What to know about the congressman running for Senate in Ohio\nFight for the House:Here are ten House races to watch in 2022\nWho is Josh Mandel?",
    "Timken, like other Republican candidates in the race, is running on Trump’s “America First” platform that takes a tough stance on immigration.",
    "Tim was the chief executive officer of Timken Steel, formerly part of the Timken company, which was started by Tim’s great-great-grandfather.",
    "In 2010, Timken became vice chairman of the Stark County Republican Party, where she served until ascending to state chair in 2017.",
    "Timken earned her bachelor’s degree from Harvard University in 1989 before getting her law degree from American University in 1994.",
    "Timken told the Cincinnati Enquirer in 2017 the passing of the Affordable Care Act inspired her to get involved in party politics.",
    "She was raised by her father, a University of Cincinnati law professor, and her mother, a nurse, alongside two siblings.",
    "Rob Portman (whose seat she hopes to win), South Dakota Governor Kristi Noem and former Trump adviser Kellyanne Conway.",
    "Jane Timken rose to the top of the Ohio GOP in early 2017, replacing a party chair who had been critical of Trump.",
    "Her 11-point platform includes proposals addressing alleged voter fraud and the economic competition with China.",
    "Timken’s Senate financial disclosure report, filed last year, provides a picture of the candidate’s wealth.",
    "She was the magistrate in the county’s court system from 2002 to 2007, according to Timken’s LinkedIn.",
    "Prior to venturing into politics, Timken worked as a lawyer for 10 years at an Ohio law firm.",
    "Tim’s uncle served as an ambassador to Germany in President George W. Bush’s administration.",
    ":What to know about the ex-Ohio state treasurer in his third Senate run\nWho is Jane Timken?",
    "Now Timken is running to become the Republican nominee in a packed Ohio Senate race.",
    "Timken’s household assets range in value from $41 million to upwards of $85 million.",
    "Timken met her husband Tim Timken when they were both studying in Washington D.C.",
    "“It was a situation where it was rammed down the public’s throat,” Timken said.",
    "The candidate also reported a salary of $189,615 for her role as GOP chair.",
    "“It was a major overhaul to the economy.”\nHow old is Jane Timken?",
    "The Timken family name is well known and well connected in Ohio.",
    "Timken grew up in Clifton, a neighborhood in Cincinnati.",
    "Timken’s major endorsements include retiring Ohio Sen.",
    "She got her start in politics in Stark County, Ohio.",
    "Ohio Democratic frontrunner:Who is Tim Ryan?",
    "They married in 1994 and have two children.",
    "She is 55 years old as of March 2022.",
    "Where did Jane Timken go to school?",
    "What is Jane Timken's net worth?",
    "Timken was born on Nov. 5, 1966.",
    "What is Jane Timken’s platform?",
    "Who is Jane Timken’s husband?",
    "Who has endorsed Jane Timken?",
    "Where is Jane Timken from?"
  ]
}