{
  "id": 1802,
  "mediaId": 2643,
  "date": "2022-04-05",
  "headline": "J.D. Vance Asks Ohio Voters 'Do You Hate Mexicans?' in New Senate Ad",
  "image": "",
  "link": "https://www.newsweek.com/jd-vance-voters-do-you-hate-mexicans-new-senate-ad-ohio-1695254",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/vnSw7P5wFh\n— Ron Filipkowski ðŸ‡ºðŸ‡¦ (@RonFilipkowski) April 5, 2022\nOthers, however, defended the advertisement, including U.S. Representative Jim Banks, an Indiana Republican, who praised Vance as \"the most articulate America First candidate in the USA.\"",
    "During the 30-second advertisement, Vance—the author of the book Hillbilly Elegy who is running as a Republican to replace outgoing Senator Rob Portman—slammed the media for calling people who want to build a wall at the southern border \"racist.\"",
    "https://t.co/IMycp9DrdN\n— Peter Tinti (@petertinti) April 5, 2022\n\"In a campaign marked by one shameless act after another desperately seeking traction, JD Vance releases an ad that starts with, 'Are you a racist?",
    "Vance is running in the GOP primary against several other candidates including investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel and former Ohio GOP Chair Jane Timken.",
    "In the general election, whoever wins the general election is slightly favored, according to the Cook Political report, which classifies the race as \"Lean Republican.\"",
    "\"Looks like JD Vance is first out of the gate with one of the more racist and xenophobic campaign ads you will ever see,\" wrote author Peter Tinti.",
    "In a campaign marked by one shameless act after another desperately seeking traction, JD Vance releases an ad that starts with, \"Are you a racist?",
    "The advertisement, which has amassed more than 300,000 views on Twitter Tuesday afternoon, opens with Vance asking voters: \"Are you a racist?",
    "An Emerson College poll released in February showed that 62 percent of GOP voters would be more likely to vote for a candidate he endorses.",
    "A March poll from Fox News showed Vance in third place in the GOP primary, but the race could be shaken up by an endorsement from Trump.",
    "\"Joe Biden's open border is killing Ohioans, with more illegal drugs and more Democrat voters pouring into this country,\" he said.",
    "Although Trump endorsed several senate candidates across the country, he has not yet endorsed a candidate in the Ohio primary.",
    "A Redfield & Wilton Strategies poll from August showed Ryan narrowly winning by one percentage point among likely voters.",
    "Looks like JD Vance is first out of the gate with one of the more racist and xenophobic campaign ads you will ever see.",
    "Former Donald Trump campaign adviser Steve Cortes wrote: \"A fantastic message from America First warrior @JDVance1.",
    "And ends with blaming the border for his mother's long-term addictions,\" wrote attorney Ron Filipkowski.",
    "The topic of illegal drugs is a key issue in Ohio, one of the states hit hardest by the opioid epidemic.",
    "Vance asked Ohio voters if they \"hate Mexicans\" in a new political advertisement released Tuesday.",
    "He added that the issue is \"personal,\" referring to his mother's struggles with addiction.",
    "But some opponents accused the advertisement itself of provoking racism toward Mexicans.",
    "A poll from Public Policy Polling released in March 2021 showed Vance up by 2 points.",
    "before launching into his criticism of President Joe Biden's immigration policy.",
    "Some, however, took to social media to criticize the advertisement as \"racist.\"",
    "Pay no attention to the smears of the Left and their complicit media allies.",
    "And ends with blaming the border for his mother's long-term addictions.",
    "Head-to-head polls between Vance and Ryan show a close race.",
    "Newsweek reached out to Vance's campaign for comment.",
    "We have a country to save!\"",
    "Ohio Senate Candidate J.D.",
    "Do you hate Mexicans?\"",
    "Do you hate Mexicans?'",
    "Do you hate Mexicans?\""
  ]
}