{
  "id": 190,
  "mediaId": 2660,
  "date": "2022-04-22",
  "headline": "In Senate race, JD Vance’s call for higher taxes is only for certain corporations, corporate leaders",
  "image": "https://static.politifact.com/politifact/rulings/meter-half-true.jpg",
  "link": "https://www.politifact.com/factchecks/2022/apr/22/mike-gibbons/senate-race-jd-vances-call-higher-taxes-only-certa/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    2131,
    2177,
    2201,
    3466,
    737,
    878,
    1171,
    5371
  ],
  "sentences": [
    "Featured Fact-check\nVance spokesperson Taylor Van Kirk told PolitiFact that Vance \"has advocated for cutting taxes on companies who create jobs in America and wants to raise taxes on companies who are anti-American and who ship out jobs to China.\"",
    "\"By all means, let’s cut the taxes of the companies that invest in our country,\" Vance says on his campaign website: \"But we’re going to raise taxes on companies that ship jobs overseas and use their money to fund anti-American radical movements.",
    "Besides Gibbons, a businessman, and Vance, the Republican candidates include Ohio state Sen. Matt Dolan, former Ohio state treasurer Josh Mandel and former Ohio Republican Party chair Jane Timken.",
    "\"At this very moment there are companies (big and small) paying good wages to American workers, investing in their communities, and making it easier for American families.",
    "Ohio race could help decide Senate control\nThe Ohio Senate seat is opening because Republican Rob Portman, who was elected in 2010, is not seeking reelection.",
    "O’Keefe tweeted about a \"first-of-its-kind call between more than 100 top corporate leaders\" on \"how to respond to proposed changes in state voting laws.\"",
    "In a poll of likely GOP voters conducted April 13-14 by Trafalgar Group, Mandel led with 28%, followed by Vance at 22.6% and Gibbons at 14.3%.",
    "Early voting is under way in Ohio, and Republican-on-Republican attacks continue in the U.S. Senate race, with Mike Gibbons hitting J.D.",
    "As of April 19, the Real Clear Politics polling average put Mandel in the lead at 21%, followed by Gibbons at 19.3% and Vance at 14%.",
    "Vance, who is endorsed by former President Donald Trump, has also embraced tax increases for certain corporations.",
    "Overall, the race is rated by campaign watchers as \"leans\" Republican, \"likely\" Republican and \"solid\" Republican.",
    "The leading Democratic candidates are U.S. Rep. Tim Ryan and consumer protection attorney Morgan Harper.",
    "Gibbons’ campaign did not reply to our request for information, but Vance’s tweet is cited in the ad.",
    "The ad is based on a tweet that Vance posted in April 2021 in reply to CBS News reporter Ed O’Keefe.",
    "He has not called for tax increases broadly, only for certain corporate leaders and corporations.",
    "If these companies are going to wage war on America, it’s time America wages war on them.\"",
    "Vance replied:\n\"Raise their taxes and do whatever else is necessary to fight these goons.",
    "We can have an American Republic or a global oligarchy, and it’s time for choosing.",
    "On the call were top leaders of airlines, media, law and investment, O’Keefe said.",
    "Vance has called for tax hikes on certain corporate leaders and corporations.",
    "Vance supports raising taxes for some corporations and corporate leaders.",
    "Our ruling\nGibbons said in an ad that Vance \"called for higher taxes.\"",
    "We didn’t find any instances of Vance calling for other tax increases.",
    "Vance called for higher taxes,\" the narrator said in a Gibbons TV ad.",
    "If Your Time is short\nMike Gibbons is partly right that J.D.",
    "No more subsidies to the anti-American business class.\"",
    "But he has not called for tax increases broadly.",
    "But he has not called for tax increases broadly.",
    "Vance is an author and venture capitalist.",
    "We rate Gibbons’ statement Half True.",
    "Vance called for higher taxes.",
    "This is partly true.",
    "Vance over taxes.",
    "Cut their taxes.",
    "\"J.D."
  ]
}