{
  "id": 1906,
  "mediaId": 3993,
  "date": "2022-03-22",
  "headline": "Leftist site claims J.D. Vance red flag law hypocrite",
  "image": "https://media.townhall.com/townhall/reu/o/2021/183/fea40eb4-314b-40f9-be1a-6439c7760dd9-1110x740.jpeg",
  "link": "https://bearingarms.com/tomknighton/2022/03/22/vance-red-flag-laws-n56623",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Knighton",
  "authorUrl": "https://bearingarms.com/author/tomknighton",
  "termIds": [
    0
  ],
  "sentences": [
    "“We’ve got to have the right balance between protecting citizens, protecting our schools, and protecting the kids that go to them, but also protecting our really important and fundamental constitutional liberty.”\nBut since announcing his Senate campaign, Vance has abandoned his support for any new gun safety legislation.",
    "The genesis of this story comes from a leftwing website ran by former adviser to Harry Reid, whose sole purpose is to defame conservatives.”\nOf course, nothing in the statement clarifies what Vance meant by taking guns from people before they killed people, which sure does sound like a red flag law to me.",
    "Was there an explosion of firearm ownership over the last two years, or did maybe something else happen?”\nThe problem is that Vance supported them at one time, but now that such measures are unpopular with Republican voters, he’s calling such measures a distraction.",
    "While Vance offered support for red flag laws before he was a candidate, but now calls them a distraction, we’re left to wonder if his current position is a deeply held belief or merely a position of convenience because primary voters won’t back you without it?",
    "As noted at the top, there’s a statement from the Vance campaign:\n“JD has always been a staunch supporter of our 2nd Amendment rights and doesn’t believe in slippery slope restrictions like unconstitutional red flag laws.",
    "Now, obviously, this story comes from a progressive website that seeks to scuttle any advances Vance makes in the Republican primary, but his past support for such a gun-control measure raises questions.",
    "It’s worth noting that in his 2018 speech, referenced in this piece, not only does he not endorse red-flag laws, the term “red-flag laws” isn’t even uttered by him.",
    "The problem is when you have someone who said one set of things at one point and now is saying something different, but with no evolution discernable presented.",
    "“We should make it easier to take those guns out of the hands of people who are about to use them to murder large numbers of people,” he argued at the time.",
    "I want lawmakers to be open to new information and blasting them when new data shifts them in another direction isn’t exactly productive, by and large.",
    "In part, it’s because they actually are far more popular than most other bits of gun control and tend to have some degree of bipartisan support.",
    "According to a local newspaper report on the event, Vance appeared to endorse new laws to disarm those who are an imminent danger to others.",
    "See, there are all kinds of problems with such laws, problems that don’t show up in the marketing material pushed by the mainstream media.",
    "Red Flag laws strip citizens of their due process rights and nowhere in this speech does JD endorse that or anything remotely similar.",
    "Any ‘crime prevention’ effort that focuses on job training or gun seizures is a giant distraction,” Vance tweeted last June.",
    "The author and venture capitalist appeared at a March 2018 Darke County Republican Party dinner as the featured speaker.",
    "As such, it’s important that candidates who have supported red flag laws in the past be questioned about that support.",
    "The idea of taking guns away from people who mean to hurt others sure sounds like a good idea to a lot of people.",
    "Those are questions that Vance needs to answer going forward, and talk of “distractions” isn’t going to cut it.",
    "Yes, red flag laws are useless as they leave the more dangerous part of the equation still on the street.",
    "The headline of this story has been updated to better reflect the contents of the story as written.",
    "Did he really think red flag laws were a good idea or does he really think they’re a distraction?",
    "Vance has spent much of his campaign attacking “gun grabbers” and opposing firearm regulations.",
    "“We have a massive spike in violent crime because police officers are afraid to do their jobs.",
    "The truth of the matter is that the switch being unexplained is a big red flag unto itself.",
    "If his mind didn’t change, then why did he voice support for red flag laws in the past?",
    "What we want to know is just how and when did Vance change his thinking on the subject.",
    "See, I don’t automatically assume that a politician changing their mind is a flip-flop.",
    "But just four years ago, he urged his party to pass the very laws he now rails against.",
    "“The dumbest argument you hear is that the spike in crime is because of guns.",
    "Not a huge amount, mind you, but there are Republicans who support them.",
    "I’m also adding a statement from the Vance campaign at the end.",
    "One candidate now thinks such measures are a big distraction.",
    "If they’re the latter, how did he become so distracted?",
    "Vance needs to answer those questions.",
    "Red flag laws are a serious problem.",
    "Republican Ohio Senate hopeful J.D.",
    "No one here is debating that point.",
    "Recommended Bearing Arms Video:",
    "What changed his mind?",
    "I mean, why not?",
    "But it’s not.",
    "Oh really?"
  ]
}