{
  "id": 1953,
  "mediaId": 2643,
  "date": "2022-03-19",
  "headline": "Video of Mike Gibbons, Josh Mandel Clashing at GOP Debate Viewed 530K Times",
  "image": "",
  "link": "https://www.newsweek.com/ohio-republican-gop-debate-viral-twitter-gibbons-mandel-1689755",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brendan Cole",
  "authorUrl": "https://www.newsweek.com/authors/brendan-cole",
  "termIds": [
    1804,
    3466,
    3822,
    3920,
    865,
    878,
    1171,
    4982,
    5042
  ],
  "sentences": [
    "Polls show that Mandel, a former Ohio state treasurer and an early front-runner for the GOP nomination has recently been overtaken by Gibbons, an investment banker, who is 1.3 percentage points ahead, according to Real Clear Politics.",
    "\"While Ohioans are struggling to make ends meet in Joe Biden's America,\" the statement said, \"Mike Gibbons spent his entire career profiting by shipping jobs overseas and investing in places like China and Russia.\"",
    "As of Saturday morning, a clip of the confrontation had nearly 530,000 views with the incident highlighting the intensity of the Republican primary race to replace Senator Rob Portman who is retiring.",
    "She referred Newsweek to a prior media statement which said Mandel was \"flailing because he's losing,\" adding that \"he doesn't have the temperament, experience or fortitude to be a U.S.",
    "Scott Guthrie, Mandel's campaign manager, said in a statement to Fox News that Gibbons \"got upset tonight that he was called out for his investments in Chinese oil.\"",
    "Mike Gibbons and Josh Mandel got within inches of each others faces during Friday's debate organized by the conservative group FreedomWorks in Gahanna, Ohio.",
    "The altercation started while Gibbons was addressing the audience as he walked across the stage with a microphone in his hand, while Mandel sat listening.",
    "Samantha Cotten, a spokesperson for Gibbons' campaign, told Newsweek that Mandel tried to get the last word in and made a derogatory comment.",
    "Both candidates told each other to \"back off\" as they faced calls to sit down from those in the audience, some of whom were jeering.",
    "Gibbons then insinuated that Mandel knew nothing about how business worked because he had \"never been in the private sector.\"",
    "Mandel accused Gibbons of making \"millions\" from questionable investments in China, which Gibbons flatly rejected.",
    "\"I don't think I have made millions off of anything,\" Gibbons said, adding, \"I would love to have made millions.\"",
    "A heated confrontation between two Republican candidates fighting for a U.S. Senate seat has gone viral.",
    "Mandel briefly backed away before again approaching Gibbons and repeating how he had done tours in Iraq.",
    "Mandel stood up and faced him directly, jabbing a finger at his rival and saying: \"I've worked!",
    "ET: This article has been updated with a response to Newsweek by Mike Gibbons' spokesperson.",
    "The other candidates, former Ohio Republican chair Jane Timken, the author J.D.",
    "Vance and Ohio State Senator Matt Dolan sat and watched during the altercation.",
    "The primary election in the Buckeye State will take place on May 3.",
    "Newsweek has contacted Mandel's campaign for comment.",
    "as the debate moderator tried to separate the pair.",
    "Gibbons replied, \"You don't know squat!\"",
    "Don't tell me I haven't worked.\"",
    "I've done two tours in Iraq!",
    "Update 03/19/22, 6:25 p.m.",
    "Senator.\""
  ]
}