{
  "id": 2057,
  "mediaId": 2547,
  "date": "2022-03-22",
  "headline": "Bannon Scolds GOP Candidate Who Nearly 'Came To Blows' With 70 YO Opponent",
  "image": "https://crooksandliars.com/files/primary_image/22/03/screen_shot_2022-03-21_at_1.25.58_pm.png",
  "link": "https://crooksandliars.com/2022/03/steve-bannon-josh-mandel",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David",
  "authorUrl": "https://crooksandliars.com/team/david",
  "termIds": [
    1804,
    2131,
    3466,
    3500,
    878
  ],
  "sentences": [
    "Ohio Senate candidate Josh Mandel (R) insisted on Monday that he would not tone down his style after nearly getting in a fight with fellow Republican candidate Mike Gibbons.",
    "\"What was it that hit the tripwire that you had to stand up to a 70-year-old guy and basically throw down right there if it hadn't been for the moderator, maybe J.D.",
    "Say, you made this money but to tone down the personal animosity so that people can actually hear these debates and hear what people have to say.",
    "\"When you say there's no personal animosity, if you had not been separated, don't you believe that you two guys would have come to blows?\"",
    "During an interview on Real America's Voice, host Steve Bannon asked Mandel about his Friday night confrontation with Gibbons at a debate.",
    "Mandel insisted that he was \"standing up for military men and women\" because Gibbons allegedly insulted veterans.",
    "\"Being an Irishman and being in enough bars in my life, it looked like it was about to be -- it was a throwdown.",
    "For his part, Mandel argued that he had \"no animosity\" toward Gibbons but Bannon didn't buy the claim.",
    "The candidate suggested that there will be more fireworks at Monday night's debate with Gibbons.",
    "Would you commit to not having these things throw down to some type of physical confrontation?\"",
    "If you hadn't been broken up, would you guys have not gotten into a physical confrontation?",
    "\"Gibbons is an old Irishman and so there would have been a couple blows thrown.\"",
    "Vance, maybe you two guys would have gone at it,\" Bannon explained.",
    "Because you weren't backing down and he wasn't backing down.\"",
    "\"I'm not dialing anything down for tonight,\" Mandel remarked.",
    "\"I don't know where it's going,\" Mandel admitted.",
    "If you disagree with the guy, chop him up then.",
    "It looked like it was about to come to blows.",
    "\"I have no idea where it would have gone.\"",
    "\"If anything, we're going to dial it up.\"",
    "\"Would you commit to toning this down?\"",
    "\"You're known as a fighter,\" he noted.",
    "\"Keep the content as hot as you can.",
    "the conservative host complained.",
    "\"Why make a big display of it?\"",
    "Bannon asked."
  ]
}