{
  "id": 2129,
  "mediaId": 2621,
  "date": "2022-03-29",
  "headline": "J.D. Vance Defends ‘Friend’ Marjorie Taylor Greene Speaking to White Nationalists: ‘She Did Nothing Wrong’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-29-at-1.22.07-PM.jpg",
  "link": "https://www.mediaite.com/tv/j-d-vance-defends-friend-marjorie-taylor-greene-speaking-to-white-nationalists-she-did-nothing-wrong/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Meyer",
  "authorUrl": "https://www.mediaite.com/author/ken-meyer/",
  "termIds": [
    1804,
    2131,
    3242,
    3466,
    3709,
    305,
    878
  ],
  "sentences": [
    "Instead of addressing Fuentes’ cheering for Russia, his anti-semitism, or any of Fuentes’ disagreeable conduct alongside the “Groyper” movement, Vance said, “the accusation against Marjorie is pretty simple: that she appeared at a conference where somebody said something bad.”\n“Did she say something bad at the conference?” Vance went on.",
    "She said nothing wrong, and I’m absolutely not going to throw her under the bus, or anybody else who is a friend of mine.”\nFor the last two months, Vance has made a point of solidifying a political alliance with Greene while engaging in the same kinds of outrage-driven, inflammatory politics she is known for.",
    "At one point in the event, which featured a number of false claims about the 2020 election, Vance addressed Greene’s recent appearance at the America First Political Action Conference (AFPAC) hosted by Nick Fuentes last month.",
    "Vance was in Wilberforce, OH on Monday night for a U.S. Senate debate which also featured former state treasurer Josh Mandel, investment banker Mike Gibbons, and several other candidates running in the Republican primary.",
    "Greene claims she had no idea that AFPAC was a white nationalist event when she spoke before them, but she has faced a great deal of internal criticism within the Republican Party for her involvement with the event.",
    "“I actually watched her remarks, I agreed with nearly every word that she said.”\nVance kept going with this as he said “There’s no business in the world that asks you to stab your friends in the back like politics.",
    "Vance said his “friend” Marjorie Taylor Greene (R-GA) “did nothing wrong” by speaking at a White nationalist conference hosted by a Holocaust denier who praised Vladimir Putin.",
    "Vance began by complaining that the media holds “guilt by association” standards for Republicans and not for Democrats.",
    "I absolutely refuse to do it to Marjorie Taylor Greene.",
    "Subscribe to\nOhio Republican Senate candidate J.D.",
    "She is my friend, and she did nothing wrong.",
    "[H/T Ron Filipkowski]\nWatch above.",
    "Have a tip we should know?",
    "Want to avoid video ads?",
    "tips@mediaite.com"
  ]
}