{
  "id": 2206,
  "mediaId": 2658,
  "date": "2022-03-21",
  "headline": "Gibbons and Mandel go for round 2",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/03/21/gibbons-and-mandel-go-for-round-2-00018794",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1804,
    2201,
    3199,
    3920,
    4526,
    4754,
    4762,
    293,
    1094,
    4906
  ],
  "sentences": [
    "Yet they’re also a reflection of something else: the key role the two battleground states will play in determining control of the Senate in November.”\nPAC ATTACK — “Super PAC signals Pennsylvania primary could get rough,” by Holly Otterbein, POLITICO: “A super PAC backing Pennsylvania Senate candidate Conor Lamb is warning prospective donors that he is trailing frontrunner John Fetterman by 30 percentage points in the Democratic primary — and that the public’s perception of his opponent’s ideology must change for him to have a shot.”\nTHE MAP LINES — “Amid primary disarray, Ohio Redistricting Commission starts work on 4th legislative maps,” by Jessie Balmert, The Columbus Dispatch: “Amid legal challenges, talk of impeaching the Republican chief justice and primary chaos, the Ohio Redistricting Commission took the first steps toward drawing the fourth set of legislative maps.”\n— “Maryland congressional redistricting trial wraps up; judge to rule next week,” Maryland Matters: “Attorneys for challengers to Maryland’s new congressional districts asked a judge to find the new map unconstitutional on the final day of a trial Friday.",
    "— “Lincoln Project sponsors pro-democracy coalition,” by Alexi McCammond, Axios: “The founders of The Lincoln Project are helping unite over two dozen political groups as ‘The Union,’ aiming to mobilize tens of thousands of volunteers in legal, tech and communications capacities ahead of the midterms and 2024 election, Axios has learned.”\nPresidential Big Board\n— “Trump Campaign Owes $300,000 in Legal Fees After Another Failed NDA Case,” by Maria Cramer, The New York Times: “Donald J. Trump’s presidential campaign has been ordered to pay more than $300,000 in legal fees and expenses to a former employee who the campaign’s lawyers said had violated the terms of a nondisclosure agreement when she accused Mr. Trump of forcibly kissing her in 2016.”\nCODA — HEADLINE OF THE DAY — “Colorado Senate hopeful ‘argumentative’ with police at party” — The Associated Press\nFollow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "Circuit Court of Appeals ruled that plaintiffs in three suits including the Texas NAACP and the League of Women Voters of Texas should have sued local election officials instead of the Texas secretary of state.”\n— “Mail Ballot Rejections Surge in Texas, With Signs of a Race Gap,” by Nick Corasaniti, The New York Times: “More than 18,000 voters in Texas’ most populous counties had their mail-in ballots rejected in the state’s primary election this month, according to a review of election data by The New York Times, a surge in thrown-out votes that disproportionately affected Black people in the state’s largest county and revealed the impact of new voting regulations passed by Republicans last year.”\nAS SEEN ON TV\n— Georgia Action Fund is airing a 30-second ad boosting former Sen. David Perdue (R-Ga.), in his GOP primary challenge against Gov.",
    "Local governments are placing orders months in advance for the supplies they need to print and mail ballots and other materials to make sure they don’t get caught without voting materials.”\nENDORSEMENT ALERT — “In letter to members, AIPAC defends recent endorsements,” by Marc Rod, Jewish Insider: “In a lengthy letter sent to its membership on Friday morning, AIPAC defended its first round of more than 100 congressional endorsements issued by its new PAC, in particular three dozen Republican lawmakers who voted against certifying the 2020 presidential election.”\nPARTY PROBLEMS — “How the GOP's dirtiest slur got a new life,” by David Siders, POLITICO: “In speeches, ads and on social media, it is fast becoming the defining smear of the 2022 primary campaign season: RINO.",
    "But former President Donald Trump’s frequent use of the term has given it a new life, weaponizing a description once largely reserved for party moderates and turning it into a slur to be avoided at all costs.”\nHINDSIGHT IS 2020 — “How Brian Kemp Resisted Trump’s Pressure to Overturn the Georgia Election Results,” by Greg Bluestein, POLITICO Magazine: “In late 2020, as Donald Trump launched a last-ditch effort to pressure state legislatures and governors to stop the certification of the vote that had made Joe Biden the president-elect, Trump set his sights on Georgia.",
    "Gaetz confirmed that he will be fighting to keep his seat in the U.S. House as he met with a crowd of supporters during the grand opening of his campaign office at 24 Hollywood Boulevard in Fort Walton Beach.”\nPRIMARY SOURCES — “No primary challengers for Mills or LePage,” by Randy Billings, Portland Press Herald: “No primary elections will be needed this summer to determine who will run for governor for Maine’s two major political parties.",
    "Oz’s Heritage Is Targeted as Rivals Vie for Trump Backing,” by Shane Goldmacher, The New York Times: “Late last year, before he had formally entered the Pennsylvania Senate race, David McCormick flew to Florida for a private meeting with Donald J. Trump, angling to get in the former president’s good graces ahead of a Republican primary that would soon pit him against Dr. Mehmet Oz, the celebrity surgeon and television personality.”\n— “Dr.",
    "He’s not usually the subject of late-night skits or memes.”\nEVERYTHING’S BIGGER IN TEXAS — “Texas ban on straight-ticket voting stands after ruling from federal appeals court,” by Philip Jankowski, Dallas Morning News: “Texas’ ban on straight-ticket voting will remain on the books after a slate of rulings from a federal appeals court found that the plaintiffs in three challenges to Texas’ election laws sued the wrong people.",
    "(NRCC filing)\n— “Liberal billionaire’s nonprofit splashed $56M in 2020,” by Scott Bland, POLITICO: “The nonprofit organization founded by billionaire megadonor Hansjörg Wyss gave grants totaling $56 million to other groups on the left in its 2020 fiscal year, including eight figures in contributions to one of liberals’ biggest hubs of ‘dark money.’”\nSTAFFING UP\n— Matt Ashburn joins LangleyCyber as chief strategy officer.",
    "Paul LePage, a Republican seeking an unprecedented third nonconsecutive term, are now officially on a collision course for the Blaine House this fall after no other candidates qualified to run for their party’s nomination.”\n— “Securing the TikTok Vote,” by Anna Kambhampaty, The New York Times: “If all politics is theater, Rep. Tim Ryan (D-Ohio) is one of its subtler actors.",
    "Oz has a fan at Mar-a-Lago: Melania Trump,” by Marc Caputo and Henry Gomez, NBC News: “In Pennsylvania’s shadow Republican primary to score a Donald Trump endorsement, celebrity doctor Mehmet Oz has the support of the ultimate insider: former first lady Melania Trump, according to sources familiar with her views on the race.”\n— “Dr.",
    "CAMPAIGN INTEL\nMIDTERM MESSAGING — “How the Latino vote could decide control of the Senate,” by Sabrina Rodriguez, POLITICO: “The midterm election is eight months away, yet more than $650,000 has already been spent on Spanish-language TV and radio ads designed to reelect Nevada Sen. Catherine Cortez Masto.",
    "In neighboring Arizona, more than twice that amount has been plowed so far into Spanish-language ads backing Sen. Mark Kelly.”\n“The large — and unusually early — expenditures are a sign that Democrats are beginning to take seriously the gains Republicans are making among Latino voters.",
    "He also appeared to be a strong opponent of fracking, warning his readers in multiple articles about the potential health risks associated with one of the more controversial fossil fuel extracting technologies.”\nPAPER CHASERS — “A paper shortage is looming over the 2022 elections.",
    "Gibbons and Mandel go for round 2\nBy STEPHANIE MURRAY\n03/21/2022 10:00 AM EDT\nTop Line\nDEBATING CHEEK TO CHEEK — “Physically aggressive.” “Unhinged.” “Clowns.” Those were some of the words used to describe an Ohio Senate debate that got up close and personal on Friday.",
    "Brian Kemp.”\nGETTING IN — “'It's choose your fighter time': Rep. Matt Gaetz announces re-election campaign,” by Sierra Rains, Northwest Florida Daily News: \"Rep. Matt Gaetz (R-Fla.) announced Saturday that he will be running for re-election this year.",
    "Oz's First-Class Flip-Flop On Fracking,” by Chris D'Angelo, HuffPost: “Mehmet Oz, the celebrity TV surgeon better known as Dr. Oz, used to write and tweet about the health benefits of coconut oil, lavender oil, CBD oil, MCT oil, avocado and olive oil.",
    "Days until the CA-22 special election primary: 15\nDays until the Indiana and Ohio primaries: 43\nDays until the Texas runoff: 64\nDays until the general election: 232\nDays until the 2024 election: 960\nWant to receive this newsletter every weekday?",
    "Seriously.” by Zach Montellaro and Marissa Martinez, POLITICO: “Supply chain snags are making it harder for election officials to secure the raw materials they need to put on this year’s primaries: paper and envelopes.",
    "The commercial uses Trump’s voice to promote Perdue’s endorsement from the former president, and slams Kemp as a “RINO.”\n— Rep. Mo Brooks (R-Ala.) is touting his Trump endorsement in a new Senate primary ad.",
    "A moderate Democrat from Ohio’s 13th district who has represented the state for nearly two decades, his speeches and debate performances are often described as coming out of central casting.",
    "Former state Treasurer Josh Mandel and Mike Gibbons went nose-to-nose in Gahanna, with one man calling the other a “pussy,” according to footage that quickly went viral on social media.",
    "Dolan has spent the second most of any candidate on the air, while the pro-Vance super PAC Protect Ohio Values is the highest-spending outside group, dropping $7.4 million on TV.",
    "Mandel, Gibbons and the rest of the Senate GOP primary field will get another chance to debate tonight in Cleveland, with an hourlong event hosted by Fox 8 News.",
    "One example: Democrats’ key House committee has $99.2 million on hand heading into the tough election cycle, and broke its previous February fundraising record.",
    "The trial in Anne Arundel County Circuit Court included two lawsuits against the state’s redrawn congressional districts.”\nTHE KEYSTONE STATE — “Dr.",
    "And while many of the candidates have sought his endorsement, former President Donald Trump hasn’t backed a candidate in the contentious race.",
    "Gibbons, an investment banker, has spent $8.7 million on TV ads, according to AdImpact, and has reserved another $3 million in future airtime.",
    "Mandel has spent a fraction of that — $2.1 million — but the conservative Club for Growth has boosted his campaign with $4.1 million in ads.",
    "The nasty, meme-worthy exchange underscores how chaotic and unsettled Ohio’s primary race is, just weeks ahead of the May 3 primary.",
    "Of all the Georgia Republican officials on Trump’s wrong side, none was as much a target of the president’s fury as Republican Gov.",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "Without a signal from the former president, the candidates are duking it out on the debate stage and on the airwaves.",
    "The Republicans broke the ice at a pancake breakfast in Cincinnati on Saturday, but they certainly didn’t apologize.",
    "A quarter of Republican primary voters are still undecided about who to vote for, according to a Fox News poll.",
    "The 30-second ad promotes Brook’s appearance at the Jan. 6 rally that preceded the attack on the U.S. Capitol.",
    "(DSCC filing)\n— NRSC: The NRSC raised $11.7 million and spent $9.2 million with $41.6 million in cash on hand.",
    "(NRSC filing)\n— DCCC: The DCCC raised $19.3 million and spent $7.5 million with $99.2 million in cash on hand.",
    "Mandel said he’d go chest-to-chest with Gibbons again, while Gibbons memorialized their confrontation online.",
    "Vance and state Sen. Matt Dolan were also on the debate stage, hosted by FreedomWorks, a conservative group.",
    "“On Jan. 6, I proudly stood with President Trump in the fight against voter fraud,” Brooks says in the ad.",
    "You’ll also receive daily policy news and other intelligence you need to act on the day’s biggest stories.",
    "(DCCC filing)\n— NRCC: The NRCC raised $10 million and spent $7 million with $85 million in cash on hand.",
    "THE CASH DASH\nTHE CASH DASH — The major party committees are stashing cash ahead of the 2022 midterms.",
    "(DNC filing)\n— RNC: The RNC raised $16.3 million and spent $22.5 million with $45.5 million on hand.",
    "Neither would own up to inappropriate language, although HuffPost made the case that it was Gibbons.",
    "(RNC filing)\n— DSCC: The DSCC raised $15 million and spent $6.4 million with $37.9 million on hand.",
    "It’s not even clear the primary will go forward as scheduled, thanks to redistricting delays.",
    "Gibbons and Mandel are the two frontrunners in the wide-open race to replace retiring Sen.",
    "— DNC: The DNC raised $10.9 million and spent $21.1 million with $52.9 million on hand.",
    "The pair got up in one another’s faces during a tense exchange over a stock trade.",
    "Former state Republican Party chair Jane Timken, author and entrepreneur J.D.",
    "Email me at smurray@politico.com and follow me on Twitter at @stephanie_murr.",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "The acronym — short for ‘Republican-In-Name-Only’ — is hardly new.",
    "He paints his opponent, Katie Britt, as a Republican-in-name-only.",
    "Democratic incumbent Janet Mills and former two-term Gov.",
    "These reports cover the month of February.",
    "The committee reported $791,000 in debt.",
    "And they’re doing it all again tonight.",
    "His style choices are D.C. standard.",
    "Subscribe to POLITICO Pro.",
    "Spring is finally here.",
    "Rob Portman (R-Ohio).",
    "Good Monday morning!",
    "The 5th U.S.",
    "Brian Kemp."
  ]
}