{
  "id": 2213,
  "mediaId": 2746,
  "date": "2022-03-25",
  "headline": "GOP Senate candidate Josh Mandel tests the limits of tough-guy imagery in Ohio",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/21/Election_2022_Senate_Ohio_05269.jpg-d7a18_c0-147-3764-2342_s1200x700.jpg?f9ba2133e65a7f1632e34c0f0dbb786911aacdbd",
  "link": "https://www.washingtontimes.com/news/2022/mar/25/josh-mandel-ohio-republican-us-senate-candidate-te/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    1804,
    2131,
    2201,
    2869,
    3498,
    4526,
    878,
    1171,
    5212
  ],
  "sentences": [
    "When Mr. Gibbons said Mr. Mandel had “never having worked in the private sector,” Mr. Mandel jumped to his feet and yelled, “Two tours in Iraq, don’t tell me I haven’t worked!”\nThings spiraled from there into a WWF-ish faceoff where Mr. Gibbons told him “you don’t know squat” and Mr. Mandel said, “You’re dealing with the wrong guy” and “you watch what happens.”\nMr. Vance, also a former Marine, has criticized his rivals for the cringe-worthy moment and said he is sick of Mr. Mandel politicizing his military service.",
    "“Gibbons is like a 70-year-old guy, and Mandel stands up there like he’s gonna fight him,” Mr. Vance said on Steve Bannons’ “War Room.” “Next week he’s going to go to the nursing home and beat up on a bunch of 80-year-old ladies to show he’s tough.”\nMs. Timken said Mr. Mandel and Mr. Gibbons “acted like children, and if I were their mom, I would have grounded them.”\nHoward Stern mentioned the spectacle on his SiriusXM radio show, mocking the candidates.",
    "“In politics, boldness is rewarded and clumsiness is penalized, and this is the story of Josh Mandel and Donald Trump.”\nMr. Trump’s unconventional approach was rewarded in 2016 when he assumed the role of fighter, marching out women who accused Bill Clinton of sexual abuse, talking about his desire to punch a protestor in the race, welcoming the “lock her up chants!” at his boisterous rallies, and leveling “fake news” attacks against the media.",
    "In the North Carolina Senate race, Rep. Ted Budd is branding himself a “conservative fighter” and his campaign website features a comment from Mr. Trump saying “He’ll fight like nobody fights.” In Nevada, former state attorney general Adam Laxalt is vowing to “fight for what is right” and casting himself as a member of the rebel alliance from Star Wars in the fight against the evil Galactic Empire.",
    "I will fight like heck to defend you when I am in the U.S. Senate.”\nMatt Cox, another Ohio-based GOP strategist, said it is common for candidates to present themselves as fighters, but “when you actually look like you want to fight someone that is way too far.”\n“There is a line between being a fighter who is a fighter for voters and actually fighting other candidates on stage,” he said.",
    "Mark Weaver, an Ohio-based GOP strategist, said Mr. Mandel, a former state treasurer and now three-time Senate candidate, has tapped into a well-worn idea: “Subtly doesn’t work in politics — boldness works.”\n“What he has in common with Trump is being politically bold, while also being politically clumsy,” he said.",
    "“They’ve taken a knee for the Democrats, and they’ve taken a knee to the media, and when I go to Washington, I will be the worst nightmare of the radical left and the squishy RINO Republicans as well.”\n“We can’t afford to send weak and soft Republicans to Washington,” he said.",
    "“The type of well-rounded senator Josh is going to be is a fighter, but also someone who is going to be able to serve and tap into the frustrations of voters and be able to really understand what they are concerned and deliver for them,” she said.",
    "From the jump, Mr. Mandel has chucked aside political correctness and traditional civility in favor of a no apologies, Trump-inspired candidacy that channels the dissatisfaction and outright anger voters hold toward the federal government.",
    "Josh Mandel is leaning into the idea Republican voters in Ohio are itching to send a fighter in the U.S. Senate, so much so that he nearly ended up in a scrap on stage with fellow candidate Mike Gibbons, who is 25 years his senior.",
    "His supporters sold memorabilia with Mr. Trump’s face superimposed over the face of Sylvester Stallone in a Rocky III movie poster and other swag depicting him standing with a machine gun atop a tank toting an American flag.",
    "Mr. Mandel’s take-no-prisoners approach fed into a face-to-face confrontation with Mr. Gibbons at a recent candidate forum where two men traded rhetorical bombs and had to be physically separated by a moderator.",
    "“The Josh everyone met when he got into politics is someone we appreciated and had a ton of respect for because he was, yes, he was conservative, but he was respectful to people,” he said.",
    "“People that don’t understand what the base cares about or think about sees this as a show.”\n“I understand that because they are out of touch,” he said of Mandel’s critics.",
    "They are failing us miserably everywhere.’”\nKristin Davison, a strategist with the Mandel campaign, said Mr. Mandel has shown he is cut from the same cloth as Sens.",
    "It is working, according to polls that show Mr. Mandel and businessman Mike Gibbons fighting for the top spot in a competitive five-person field.",
    "Voters went in a different direction in 2020, tapping President Biden and his vow to bring a sense of normalcy back to the White House.",
    "“The problem in Washington is we have all these squishy RINO [Republican in Name Only] Republicans,” Mr. Mandel said.",
    "“All he has done is stand up for our conservative values,” said Shannon Burns, head of the Strongsville Ohio GOP.",
    "“I’m a fighter, I’m a Marine and I’ll never back down from a fight,” he said a day after the altercation.",
    "In Ohio, Mr. Mandel has been wrestling over the Trump “fighter” mantle against Mr. Gibbons, author J.D.",
    "Still, Republicans across the country have tried to mimic the Trump brand with a mixed bag of results.",
    "“The average American looks at the government right now and says, ‘What are they doing?",
    "Mr. Cox said Mr. Mandel did not act that way when he entered politics 20 years ago.",
    "“Sometimes that is going to take a senator who is willing to fight.”",
    "Mr. Mandel, though, has no regrets, saying fighters fight.",
    "Mr. Mandel’s backers say he has not crossed a line.",
    "Ted Cruz of Texas and Josh Hawley of Missouri.",
    "Vance, and former Ohio GOP chair Jane Timken.",
    "“Now is the time for fighters."
  ]
}