{
  "id": 2255,
  "mediaId": 2664,
  "date": "2022-03-29",
  "headline": "'She did nothing wrong': Ohio's JD Vance defends Marjorie Taylor Greene's speech to white nationalists",
  "image": "https://www.rawstory.com/media-library/j-d-vance.png?id=29607260&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/jd-vance-marjorie-taylor-greene/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    1726,
    1768,
    3242,
    3466,
    764,
    878,
    1171,
    5212
  ],
  "sentences": [
    "At the OH Senate debate tonight, JD Vance is asked if he will condemn Marge Greene speaking at a Nazi rally: \\u201cShe is my friend, and she did nothing wrong .. and I\\u2019m absolutely not going to throw her under the bus, or anybody else who is a friend of mine.\\u201dpic.twitter.com/fipwlONqc4\n— Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1648516079",
    "“She is my friend, and she did nothing wrong,\" Vance said, \"and I’m absolutely not going to throw her under the bus, or anybody else who is a friend of mine.”\nGreene, who has campaigned with Vance in Ohio, drew widespread criticism for her appearance at the event, where participants approvingly compared Russian president Vladimir Putin to Adolf Hitler.",
    "The \"Hillbilly Elegy\" author complained Monday night during an Ohio GOP Senate debate that the media had used \"guilt by association\" to smear Greene, who spoke in person at the America First Political Action Conference organized by white nationalist Nick Fuentes, reported HuffPo.",
    "She was joined at the Florida conference by Rep. Paul Gosar (R-AZ), who has maintained ties to white nationalist groups for years.",
    "Vance defended Rep. Marjorie Taylor Greene's appearance before a white nationalist conference.",
    "Republican Senate candidate J.D."
  ]
}