{
  "id": 2472,
  "mediaId": 2919,
  "date": "2022-03-21",
  "headline": "Ohio Republican Senate candidate forum devolves into near fight",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/415f347/2147483647/strip/true/crop/1024x538+0+72/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fcf%2F9f%2F8814df3f4e889f10af78fe28c9c5%2Fcandidateforum-1024x682.jpeg",
  "link": "https://www.news5cleveland.com/news/state/ohio-republican-senate-candidate-forum-devolves-into-near-fight",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Evans",
  "authorUrl": "https://www.news5cleveland.com/nick-evans",
  "termIds": [
    0
  ],
  "sentences": [
    "“That is not the path that we should be taking in this country.”\nMandel repeatedly steered his answers into Gibbons’ investment holdings criticizing him for shipping Ohio jobs overseas, selling companies “to China,” or simply holding stock in Chinese firms.",
    "He then turned to the former state treasurer and asked, “Josh, do you know anything about economics or finance at all?”\nGibbons also made a dig he uses regularly on the campaign trail — Mandel has “zero” experience in the private sector.",
    "“Down one path goes these squishy, RINO Republicans many of whom have been pro-China over the years.”\nHe rattled off the list of excommunicated Republicans — Liz Cheney, Adam Kinzinger, Mitt Romney — before turning to Gibbons.",
    "“You don’t know squat.”\n“Two tours in Iraq,” Mandel growled, “don’t tell me I haven’t worked.”\nThe other candidates traded uncomfortable laughs as the moderator broke up the incident while the crowd booed.",
    "Timken decried big tech as, “the weapon of the cancel culture and the woke left.”\nBut beneath the red meat rhetoric, their arguments weren’t that dissimilar from what many on the left have demanded.",
    "“The only thing that will salvage Joe Biden’s presidency is if a bunch of stupid, weak-willed Republicans let this guy bumble us into a war that we have no business fighting,” he told the crowd.",
    "Speaking after the event Vance called Mandel’s conduct “embarrassing,” but he didn’t want to belabor it, instead focusing on how the crowd had reacted to the points he made during the evening.",
    "The substance\nThe moderator took candidates through foreign policy, big tech “censorship” (twice), critical race theory, the opioid crisis and their feelings on Donald Trump’s presidency.",
    "“You can not just put, in the dark of night, all of these spending provisions into a bill, plop it on peoples’ desks and say you’ve got 12 hours to vote for this,” Dolan argued.",
    "“It’s not a political football for you to toss around.”\nAfter the event ended, Gibbons waded out into the crowd to shake hands with attendees, but refused to talk to reporters.",
    "He’s taken to ending campaign ads with the tag line “send in the marine.”\nA few minutes after the confrontation, Vance, who is also a marine corps veteran, chastised Mandel.",
    "Instead of emphasizing neglect, he uses the conflict to criticize establishment Republicans who couldn’t fund Trump’s border wall and to warn against American adventurism.",
    "It’s technically incorrect, after all Mandel has gladly cashed checks since leaving office for serving on corporate boards and advising payday lenders.",
    "In his opening statements Mandel argued the fight for the “soul of the Republican Party” was even more important than the fight against Democrats.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "Instead, his campaign sent out a press release after the fact calling Mandel “unhinged, unfit and flailing.”\nMandel handled things differently.",
    "Regardless, when Gibbons told Mandel, “You might not understand this,” about a stock trade, Mandel jumped out of his seat to confront Gibbons.",
    "It’s bears repeating the Biden has, from the outset and repeatedly since, insisted that American troops will not be sent to fight in Ukraine.",
    "“There is no reason that Facebook or Meta as it’s called should be as powerful as it is, and also, meddling in our elections,” Timken said.",
    "The candidates largely agreed on support for Ukraine, but complained about how Congress approved a nearly $14 billion support package.",
    "“You watch what happens, p—–, you watch what happens.”\nThe incident is in keeping with Mandel’s increasingly belligerent campaign.",
    "The other four candidates, state Senator Matt Dolan, investment banker Mike Gibbons, former GOP chair Jane Timken and author J.D.",
    "It’s also a bit disingenuous, as the no experience label usually implies a career that doesn’t include serving in the military.",
    "Vance has argued against engaging the Ukraine war — raising eyebrows by saying he didn’t really care what happened.",
    "Break them up, don’t let companies profit on your data, reform or eliminate section 230, the candidates argued.",
    "The candidate forum hosted by FreedomWorks became a schoolyard for Josh Mandel’s best impression of a bully.",
    "GAHANNA, Ohio—The leading candidates for the Ohio Republican U.S. Senate nomination met in Gahanna Friday.",
    "The confrontation\nAlmost immediately, it became clear that Mandel would use the forum to attack Gibbons.",
    "“(He) had all these companies here in America and made money selling them to China,” Mandel said.",
    "“Again Josh is showing his ignorance,” Gibbons said after one critique tied to Lordstown Motors.",
    "By the third time he tried it, Mandel’s tactic was met with sustained boos from the crowd.",
    "They didn’t make it through opening statements before Mandel began attacking Gibbons.",
    "“I think the way you use the U.S. Marine Corps, Josh, is disgraceful,” Vance said.",
    "When the forum concluded, he shook hands with his opponents and rushed off stage.",
    "“You’ve never been in the private sector in your entire life,” Gibbons insisted.",
    "In a straw poll, Mandel got just 4.6%, dead last among the candidates on stage.",
    "Vance did their best to avoid the mess, but it was easier said than done.",
    "He weaved through attendees and made a beeline for the service kitchen.",
    "“You’re dealing with the wrong guy,” Mandel said returning to his seat.",
    "“If I’d had his debate I may have run for the kitchen, too.”",
    "His position hasn’t really changed, but the framing has.",
    "But asked about Mandel’s exit, Vance smiled and paused.",
    "“Here’s the fork in the roads,” he argued.",
    "Two of them nearly came to blows.",
    "Vance with about 43% of votes.",
    "The winner was J.D.",
    "“Well,” he said."
  ]
}