{
  "id": 2492,
  "mediaId": 2537,
  "date": "2022-03-21",
  "headline": "Opinion: No reason for J.D. Vance to exit U.S. Senate race",
  "image": "https://www.gannett-cdn.com/presto/2021/10/16/PCIN/9c655087-8e27-4311-a8e3-3a03a6e01503-10162021_GOPPancakes_MV_015.JPG?crop=2742,1542,x693,y621&width=2742&height=1542&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/03/21/opinion-no-reason-j-d-vance-exit-u-s-senate-race/7039393001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Sewell",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "His initial, callous comments on the Russian invasion of Ukraine – such as, \"I don't really care what happens to Ukraine one way or another\" – brought a firestorm of criticism and a March 1 call from Enquirer political columnist Jason Williams to pull the plug on his \"disastrous campaign.\"",
    "I met Vance in 2016 at a Miami University luncheon ahead of his talk to students about his best-selling memoir \"Hillbilly Elegy,\" which depicted his rise from a sometimes- chaotic childhood with a drug-addicted mother in an economically declining town.",
    "While a Trump endorsement is anticipated to be potentially decisive in the race, Vance says he came away from their meeting with the sense the former president likes the field and is content to let the candidates battle it out on their own.",
    "He also says Americans \"need a little bit of humility\" about how much this nation can do while trying to help limit casualties and bring fighting to a quick close, and by ensuring \"that the Russians don't become China's biggest ally.\"",
    "The book fascinated me because of some parallels – we were born in the same Middletown hospital 30 years apart, our families' roots were in Jackson, Kentucky, and close family members worked at Middletown's Armco Steel mill.",
    "Dan Sewell retired from daily journalism last year after 44 years and is a member of The Enquirer Board of Contributors who didn't go to Yale like Vance but did attend \"the Harvard on the Hocking,\" also known as Ohio U.",
    "Entrepreneur Mike Gibbons, spending millions of his own money, has recently surged to the top while erstwhile front-runner Josh Mandel, former Ohio treasurer and 2012 Senate nominee, has slipped.",
    "To be sure, the Cincinnati venture capitalist and best-selling author hasn't been able to build much traction in the crowded Republican field to succeed two-term GOP incumbent Rob Portman.",
    "Cousin Jimmy Vance introduced him to a crowd receptive to his message about stopping the flows of manufacturing to China and drugs and illegal immigrants across the U.S. Southern border.",
    "It was a friendly crowd of more than 100 people in Hamilton, also called \"Hamil-tucky\" for its large number of Appalachian Kentuckians just as Middletown gets called \"Middle-tucky.\"",
    "He's getting support now from another political action committee, after months of being pounded by PAC and opponent ads over his many 2016 comments critical of Donald Trump.",
    "I've interviewed him several times since, and I sometimes think Vance is too influenced by Fox News host Tucker Carlson, whose affinity for authoritarians is unsettling.",
    "Vance should drop out of U.S. Senate race\n\"I think it's going to be a tight, tight race all the way down to the finish line,\" he said in an interview.",
    "Vance, at 37 the youngest of the Republican hopefuls, just criss-crossed the state with six stops in two days on his \"No BS Tour\" of town halls.",
    "\"I think it's going to come down to this: who works the hardest, who gets their message out the best, and who connects with people the best.\"",
    "Vance, former state GOP chairwoman Jane Timken and state Sen. Matt Dolan remain bunched double-digit percentage points behind.",
    "He says that's a better way to connect with voters than TV ads, but that his campaign has the resources for those, too.",
    "I also question his taking the endorsement of far-right, scatter-mouthed Georgia Rep. Marjorie Taylor Greene.",
    "I caught up with him March 9 in the Kaivac plant, a maker of cleaning equipment in our native Butler County.",
    "Vance estimates $5 million in negative ads have aimed at him in one of the nation's most expensive races.",
    "Vance says Trump turned out to be an effective president and has taken back derisive comments.",
    "We have to protect our vital interests, and try not to blunder ourselves into World War III.\"",
    "He's talked with Trump, most recently a few weeks ago at his Mar-a-Lago estate in Florida.",
    "\"If you want to be a real leader, you should be willing to say what you actually think.\"",
    "It was viewed as a guide to understanding Trump's appeal to people in such communities.",
    "\"On the good side, we know we can take a punch and still be in the race,\" Vance said.",
    "He also told them his mother just marked her seventh year of being clean and sober.",
    "However, polls have shown the largest number of voters are undecided.",
    "He has softened his comments on Ukraine a bit: \"It's so complicated.",
    "\"People are terrified to say anything controversial,\" Vance said.",
    "Republican sources agree that polling in the race remains fluid.",
    "Opinion contributor\nIt's premature to write an elegy for J.D.",
    "\"On the bad side, it's a message you've got to respond to.\"",
    "More:Jason Williams: 'Hillbilly Elegy' author J.D.",
    "He's got several weeks left to win more.",
    "He'll keep offering his views.",
    "Vance's U.S. Senate campaign.",
    "Vance scoffs at that.",
    "He won that audience.",
    "Many applause lines."
  ]
}