{
  "id": 2512,
  "mediaId": 2745,
  "date": "2022-03-29",
  "headline": "The Trailer: 'Diversity.' 'Affirmative action.' Why Democrats may bump the Iowa caucuses.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K2HP6GSZZII6VDX5B6IEXXMAK4.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/29/trailer-diversity-affirmative-action-why-democrats-may-bump-iowa-caucuses/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Cotton, who's quickly built a stronger relationship with conservatives than Boozman has, compares the senator to one of his “brothers” on the battlefield and dismisses any litmus tests by adding they agree “on nearly every vote.”\nKathy Hochul: 52%\nDon't know/no opinion: 19%\nJumaane Williams: 12%\nTom Suozzi: 11%\nSomeone else: 6%\nKathy Hochul: 38%\nAndrew Cuomo: 30%\nDon't know/no opinion: 14%\nTom Suozzi: 10%\nJumaane Williams: 7%\nSomeone else: 1%\nEven before his political PAC kicked back to life and started running ads, Cuomo had resilient support from about a third of New York's Democratic voters.",
    "The most active Democrats in Iowa were the least like the voters the party had been losing: In November, the same survey of general election voters in Iowa found just 20 percent identifying as liberal, and twice as many calling themselves “conservative.”\nBut in South Carolina, where President Biden's easy victory marked the beginning of the end of the presidential primary, just 49 percent of Democratic primary voters called themselves “liberal,” according to the 2020 exit poll, and just 23 percent were White college graduates.",
    "Cost of living: 21% (+8 since Jan. 2022)\nJobs and the economy: 16% (-7)\nWar between Russia and Ukraine: 14% (+14)\nVoting rights and election integrity: 13% (-3)\nClimate change: 10% (+4)\nTaxes and spending: 8% (no change)\nBorder security and immigration: 7% (-1)\nThe coronavirus: 3% (-11)\nAbortion: 3% (+3)\nA poll that includes the lowest NBC approval rating yet for President Biden — 40 percent — identifies the reasons.",
    "Asked what the president's “top priority” should be, 68 percent of voters give an answer about the economy or the cost of living, and 29 say “working to end the war between Russia and Ukraine.”\nAfter a series of legal setbacks in other states, Republicans in Florida and Ohio are trying to maximize the number of House seats they can win this year, running out the clock and saying the Supreme Court will back them up.",
    "It's ridiculous.” The least negative view of the plan came from Mike Gibbons, who said that while “there's some things I disagree with in there and I think those things can change,” Republicans needed to “determine what this party's all about.”\nThe wariness about parts of Scott's plan stood out on Monday, because most of the time, candidates rejected the way Kasler and the rest of the press framed their issues.",
    "Johnson, who entered the race two months ago, occasionally got lost in her answers, at one point stopping and apologizing because the cameras filming the debate made her “nervous.”\nThe commission's Republican debate had the same wide-open inclusion rules, adding perennial candidate Neil Patel and businessman Mark Pukita to the scrum of five candidates who'd debated last week.",
    "The party needed to review primaries “with an eye toward diversity,” added DNC member Maria Cardona, reflecting “all of the diverse communities that we say that we represent, and that actually reflect the country.”\nThey were not describing Iowa, where nearly seven out of every eight residents is White, and where turnout in the Democratic caucuses can be even Whiter.",
    "In what might be her only chance to face Rep. Tim Ryan (D-Ohio) before the May 3 primary, consumer protection attorney Morgan Harper took every chance she could to portray the congressman as a tool of special interests, starting with a round about Ukraine, when she asked why America had been goaded into so many overseas conflicts.",
    "“The liberals are trying to destroy our country.” The ad's setting isn't specified, but Ohio reporters recognized it as North Canton Hoover High School, where a new policy requires parental consent for students who don't want to be identified by their legal names, creating potential complications for transgender students.",
    "“I fully expect that the Republicans are going to lead off and I truly want the Democrats with me on that journey.”\nDemocrats are sensitive to the criticism that they're stiffing rural America; on Monday, Daughtry pointed out that New York — not really in discussion for the “pre-window” slots — had plenty of rural voters.",
    "In an interview with Iowa's KMA station last week, Iowa GOP chair Jeff Kaufmann pointed out that the Republican National Committee had put him in charge of the presidential nominating committee, a not-so-subtle hint that the party intended to prioritize a state that has moved dramatically toward the GOP since 2014.",
    "Both ads end the same way, with Ivey firing her own pistol; this time she deploys a catch phrase from her first ad, “no step too high for a high-stepper.”\nPerdue for Governor, “Turncoat.” Former Georgia Sen. David Perdue doesn't say a word in this digital ad for his GOP primary campaign for governor.",
    "Those people aren't living in the suburbs of Washington, D.C.”\nThe two Democrats eventually got on to their policy differences, with Harper supporting Supreme Court expansion and Medicare-for-all — and pointing out that Ryan, at the start of his career in northeast Ohio, had been backed by the NRA.",
    "His success argues against this point about ideology.”\nAs they mobilize to save the caucuses, Iowa Democrats have their own view of Buttigieg's win: Like President Barack Obama, he proved that Iowa voters celebrate diversity, and that the national party shouldn't get hung up on their demographics.",
    "“In their, I guess, understandable zeal to try to comply with what they believe the Florida constitution required,” DeSantis said, “they forgot to make sure what they were doing complied with the 14th amendment of the U.S. Constitution.” He plans a special session next month for drawing new maps.",
    "What's less discussed, and more relevant to current party angst, is that the ongoing migration of White working class voters out of their party, and into the GOP, has made White liberals more and more relevant in the Iowa caucuses — and moving it around on the calendar could reduce their clout.",
    "“Our country is very different than it was when we first set up the pre-window process,” said DNC member Leah D. Daughtry, referring to the first few weeks of primary voting, when only a few states are allowed to hold primaries or caucuses without party-imposed penalties on their delegates.",
    "Conyers, who has no political experience, was kept off the ballot after his cousin, then-state Sen. Ian Conyers, challenged his petition signatures; a subsequent attempt to run as an independent failed, and Conyers stayed out of a race eventually won by Rep. Rashida Tlaib (D-Mich.).",
    "There was far more dissent when the field was asked about Sen. Rick Scott's (R-Fla.) “Rescue America” plan, which has gotten widespread attention because of Scott's role leading the National Republican Senatorial Committee — and because Democrats see it as a soft target to attack.",
    "Citizens for Josh Mandel, “Sheila.” More than a week after the Ohio GOP candidate forum where Mandel literally squared off with Mike Gibbons, the ex-state treasurer is continuing the argument he made onstage: Gibbons insulted him by saying he'd never worked in the private sector.",
    "His decision set up a special election for the rest of Fortenberry's term, probably in June: State law requires an election within 90 days of the March 31 resignation, with the major parties submitting their candidates at least 65 days prior, after party meetings to select them.",
    "“I’m convinced that a candidate who can win an early state that looks like America will be well positioned to win in November.”\nRepublicans, who've repeatedly recommitted to having Iowa vote first, say that Democrats would hand them a political gift if they changed the calendar.",
    "After losing by a handful of delegates in 2016, Sanders and his political movement campaigned and won two changes: The raw vote would be added up and published, and “satellite caucuses” would be held for people who couldn't physically show up for the main event, in the evening.",
    "In the Hillary Clinton-Bernie Sanders primary that year, half of Sanders's victories came in caucus states; four years later, while Sanders won the Nevada caucuses handily, he lost four states that he'd carried when they'd picked delegates at activist-dominated caucuses.",
    "“There is no political system, I think, in the world, where anybody would consider Pete Buttigieg progressive,” argued Pete D'Alessandro, a strategist for Sanders's 2016 and 2020 Iowa campaigns, referring to the now-Transportation secretary's strong showing in 2020.",
    "But the Ohio Debate Commission's generous candidate inclusion rules added IT consultant Traci Johnson to the stage, diluting the time Harper had to go after Ryan and the time Ryan had to pivot with his answers — almost always back to jobs and the threat of China.",
    "The reasons were numerous, starting with the technical disaster that prevented the winner of the 2020 caucuses from being known for days, and continuing with a result that had two candidates, Pete Buttigieg and Sen. Bernie Sanders (I-Vt.) declaring victory.",
    "Ron DeSantis vetoed a new map approved by GOP legislators on Tuesday, singling out a majority-Black district that the party had drawn around Jacksonville and saying that his Tallahassee colleagues didn't make it robust enough to survive legal challenges.",
    "“I know she has what it takes to beat Eric Greitens,” Sifton said in a tweet, referring to the ex-governor who's led in early polling for the GOP nomination — and who in both internal and public polls fares the worst against any Democratic candidate.",
    "Late Monday, for the fourth time, the commission produced maps that would create 10 safe seats for the GOP, two safe seats for Democrats, and three competitive seats that will probably back their party in a good year, which 2022 is shaping up to be.",
    "“We will help retake the House and end Democrats' disastrous one-party rule.” The only other Republicans running by Tuesday were retired Air Force Col. John Glen Weaver and Thireena Yuki Connely, a fitness instructor and self-published author.",
    "Vance did so with aplomb, refusing to criticize Rep. Marjorie Taylor Greene (R-Ga.), who had endorsed him and campaigned with him, for speaking at the “America First\" conference in Orlando last month, sharing a stage with white nationalists.",
    "That's too long a time frame to cram the election onto the May 10 primary ballot, so Nebraska's 2nd Congressional District will pick nominees for the general election a few weeks before voters choose who'll immediately replace Fortenberry.",
    "Julián Castro, the former Housing and Urban Development secretary who folded his presidential campaign before the caucuses, spent the last few weeks of it saying that the state was simple not diverse enough to pick a Democratic nominee.",
    "Here he lets Sheila Nowacki, a Gold Star mother he's known for years, say that Gibbons believes “military service doesn't count as work.” Military service, she says, is more honorable than a businessman “making millions” for himself.",
    "Democrat John Conyers III declared his candidacy for the new 13th Congressional District, making his second attempt to represent parts of Detroit that his father represented, after his own 2018 candidacy was undone by incompetence.",
    "Biden's approach to the Ukraine crisis hasn't been particularly popular, but that's not his only problem: Most voters say they're simply more interested in the economy than in the Russian invasion, even as they follow that story.",
    "“It will incorporate the diverse perspectives that make our party strong,” DNC chair Jaime Harrison told members of the DNC’s rules and bylaws committee at a Monday night meeting on primary reform, speaking of the 2024 calendar.",
    "Monday's meeting, the latest step in a lengthy, public process of redrawing the calendar, was the clearest sign yet that Democrats want to move past Iowa, giving non-White voters a bigger, earlier role in presidential primaries.",
    "Neither had a breakout moment, though Pukita got laughs from the audience after moderator Karen Kasler, of Ohio Public Radio, corrected other candidates after they claimed the 2020 election had been stolen from Donald Trump.",
    "He couldn't keep that lead, as Cherfilus-McCormick self-funded an ad campaign focused on her support for a universal basic income — a non-starter in Congress, which Holness claimed was a fraudulent attempt to mislead voters.",
    "“Our communities deserve a champion with experience and follow through,” said Holness, not mentioning the incumbent, who beat him by 5 votes after a recount last year — a victory upheld after Holness sued to overturn it.",
    "“I've committed to not accept any money from any sector, including the defense contracting sector that my opponent here today has taken over four hundred thousand dollars from over the course of his career,” Harper said.",
    "My feeling is, of course you can, because he probably won by a higher margin than was even reported.”\nState Sen. Matt Dolan, once again, was the only Republican candidate who said that the election hadn't been stolen.",
    "It's a combination of economic angst and brand new worries about war, pushing everything else aside, at a time when Biden's handling of coronavirus is more popular and fewer voters are focused on illegal immigration.",
    "Fortenberry's resignation will create the fourth GOP vacancy in the House this year, after the resignation of ex-California Rep. Devin Nunes and the deaths of Reps. Don Young of Alaska and Jim Hagedorn of Minnesota.",
    "When Harper said again that Ryan's votes were enriching defense contractor donors, the congressman once again said he would “always go to bat” for Ohio jobs: “There's over a thousand workers at the Lima tank plant.",
    "“I look forward to making the case for Iowa alongside my fellow early state leaders in New Hampshire, South Carolina, and Nevada,” said Iowa Democratic Party chair Ross Wilburn said in a statement to The Trailer.",
    "She loses some support from Democrats who like her, as does Cuomo; 73 percent of Democrats say they approve of Hochul's job performance, but given every option, half of them are willing to consider somebody else.",
    "The state party told the Anchorage Daily News that it was still planning to field a Democrat against Sen. Lisa Murkowski (R-Alaska), with plenty of time before the June 1 filing deadline and the Aug. 16 primary.",
    "Vance mocked the corrections, which got increasingly loud boos from the crowd, saying that factors including the suppression of “the Hunter Biden laptop story” had cost Trump “millions upon millions” of votes.",
    "Republicans could give Flood, a former state legislative speaker, a chance at seniority by nominating him for the special, but they haven't ruled out nominating a placeholder candidate who'd fill out the term.",
    "While Republicans treated the caucuses as a typical election, run by the party instead of the state, Democrats kept in place a convoluted delegate system that gave slightly more representation to rural areas.",
    "It's about bringing everybody in the room, having every voice.”\nThat rhymes with what Iowa's biggest detractors have been saying about the primary process, and they started saying so before the 2020 debacle.",
    "Holness had entered the 2021 special election as the favorite, an ally of the late Rep. Alcee L. Hastings, and claimed, but could not prove, that Hastings endorsed him shortly before he died last spring.",
    "Right before the March 29 filing deadline, beer heiress Trudy Busch Valentine formed a campaign for U.S. Senate, entering the Democratic primary and convincing former state Sen. Scott Sifton to quit it.",
    "In the last couple weeks, Cuomo began speaking in public again, describing himself as a victim of “cancel culture,” and 50 percent of registered Democrats now say they have a favorable opinion of Cuomo.",
    "Without Fortenberry, the seat, which covers eastern Nebraska outside of Omaha, isn't a Democratic target — Donald Trump won inside the current district lines by 21 points in 2016 and 15 points in 2020.",
    "He derided former state treasurer Josh Mandel for saying that no other candidate called the election “stolen,” but Mandel pointed out that he was alone in calling for a 50-state audit of the 2020 vote.",
    "“I don't have to contend with California and New York and they do,” he said, explaining why he thought his own caucus advocacy could help Democrats realize the foolishness of taking Iowa's status away.",
    "“Can we just stipulate that what I'm going to say, it's not going to be fact-checked by you?” Pukita asked Kasler, adding that he had gone on Rumble days after the election to say that it was stolen.",
    "“Iowa has a strong grass-roots network and the necessary infrastructure needed to rebuild the Democratic Brand in rural America.”\nDemocrats still say they want all of that, and to compete everywhere.",
    "The two nameless Ivey fans reappear in this spot, at a brighter gun range, with a prominent Gadsden flag, now thankful that Ivey “banned critical race theory” and opposed the federal vaccine mandate.",
    "Pansing Brooks, who announced her candidacy in November, has just one declared rival: Jazari Kual, a 26-year old Sudanese immigrant who's built a following for video commentaries and live reporting.",
    "Former Broward County Commissioner Dale Holness, who never conceded his narrow loss to Rep. Sheila Cherfilus-McCormick, launched a new campaign for what's currently the 20th Congressional District.",
    "Sanders had wanted those changes to the caucus system, even though they hurt him, and some liberals are skeptical that kicking Iowa out of first place would hurt a future Sanders-style candidate.",
    "Democrats who fret about their college-educated left wing making them unelectable in most of America could, in the name of primary fairness, make that wing far less influential in the primary.",
    "That was what had happened after 2016, when most other caucus states, casting aside a system that benefited well-organized and typically more left-leaning candidates, switched to primaries.",
    "“Why would we increase the taxes on the middle class, especially when Apple, Google, Amazon and Facebook pay a lower tax rate than any middle class American in this room or in this country?",
    "Democratic state Sen. Elvi Gray-Jackson dropped out of the race for U.S. Senate, citing “the monumental expenses necessary to run a successful campaign” and hinting at weak fundraising.",
    "“I got fewer questions in Iowa or New Hampshire about mass transit, police reform, and affordable housing than I might have in a more diverse and densely populated state,” said Castro.",
    "Mike Flood for Congress, “Governors.” The Republican state senator in Nebraska had just started running this spot when the incumbent he wanted to defeat, Rep. Jeff Fortenberry (R-Neb.",
    "The deadline to file in the Democratic primary is April 7, and Cuomo polls far worse than Hochul, with a negative favorable rating in every region of the state except New York City.",
    "Most of the candidates distanced themselves from the part of the plan Democrats had attacked the most, the idea of making every American pay at least a nominal income tax.",
    "That left Democrats without a candidate in the state's first race under a new “top four” primary system, in which candidates from every party compete for runoff slots.",
    "And they would ignore the Republicans who argue that making Iowa less relevant would be a slap in the face — or some other, more colorful gesture — to rural America.",
    "“Over the last several cycles, we've seen the importance of diversity,” former DNC chair Donna Brazile said in a January RBC meeting that helped craft the proposal.",
    "In this edition: The Democratic debate about dumping Iowa, another special election in a safe GOP seat, and a pair of Ohio debates that said everything about 2022.",
    "In Ohio, Republicans appeared victorious in their standoff with a state Supreme Court that kept throwing out the work of the GOP-majority redistricting commission.",
    "It happened fast, with three guilty verdicts coming just a week after the trial began, and Fortenberry announcing his resignation, effective at the end of March.",
    "The composition of states, even the large states, are different.”\nThe momentum for demoting Iowa has built for years, and was supercharged by the 2020 election.",
    "Kay Ivey's (R) campaign introduced two men at a gun range who were ready to elect their governor, who “protected our monuments” and presided over a jobs boom.",
    "… 35 days until the next primaries\n… 56 days until Texas runoffs\n… 74 days until the special House primary in Alaska\n… 216 days until the midterm elections",
    "ran in Missouri, to warn that girls who want to play sports could be thwarted by transgender athletes like University of Pennsylvania swimmer Lia Thomas.",
    "“The Biden Democrats want to force our daughters to compete against men, in the pool and on the court,” says Timken, as girls play basketball behind her.",
    "Asked again on Monday, Castro said that the “wonderful” states of Iowa and New Hampshire still didn't “reflect the rich diversity” of America in 2022.",
    "Support for that idea is highest among independents, with roughly the same number of Democrats and Republicans favoring a Cuomo third party bid.",
    "The same candidates are the favorites for both nominations: Republican state Sen. Mike Flood and Democratic state Sen. Patty Pansing Brooks.",
    "Flood had been running against Fortenberry since January, saying that “because of his indictment,” the congressman had put the seat at risk.",
    "But Valentine didn't fully clear the field, with veteran Lucas Kunce and a half-dozen lesser-known candidates still filing for the primary.",
    "“I would not support Rick Scott's agenda, especially because it raises taxes on the middle class,” said former state GOP chair Jane Timken.",
    "The rules and bylaws committee, or RBC, could keep the “pre-window” in place, but allow every state party to apply for a place in it.",
    "That puts the next hearing well into the state's early voting period, meaning that the maps will probably remain in place all year.",
    "Nebraska Democratic Party chair Jane Kleeb said that Pansing Brooks was likely to get the party's support for the special election.",
    "Black Democrats, who held a positive view of the ex-governor when he was accused of sexual misconduct, broke two-to-one for Cuomo.",
    "It never says some other state deserves, after nearly five decades, the first chance to decide the party’s presidential nominee.",
    "In the 2020 entrance poll of caucus-goers, 67 percent called themselves “liberal,” and 50 percent were White college graduates.",
    "Sixty-seven percent of voters want Cuomo to stay out of politics, but 10 percent say they want him to run as an independent.",
    "As the conversation gets sillier, it's replaced by an outtake, then by Flood saying he “can't believe” he approved the ad.",
    "Iowa could fight to keep its position, but it would start off with some well-known disadvantages on the “diversity” piece.",
    "Pete Ricketts having a scripted diner conversation about how conservative Flood is, and how much he helped them in Omaha.",
    "“Ohio is a state that has a lot, tens of thousands of jobs that are directly connected to the defense industry,” he said.",
    "Chief Justice Maureen O'Connor gave the commission, and its opponents, 25 days to present evidence in favor of the maps.",
    "Jane Timken for Ohio, “Compete.” This is the second U.S. Senate campaign ad, after the one Rep. Vicky Hartzler (R-Mo.)",
    "“Listen, a lot of the squishy RINO Republicans, they say: Well, you can't audit the states where Trump obviously won.",
    "Ohio's GOP Senate hopefuls met for their second televised debate on Monday, and Democrats met for their first.",
    "“He was one of the most conservative, pro-business candidates, who in the 1970s would have been a Republican.",
    "But they're less convinced that the first-in-the-nation caucuses help them get it, and more ready to move on.",
    "After 2020, Iowa Democrats were embarrassed, and Democrats in other states started talking about a shake-up.",
    "That led to the proposal discussed on Monday, and first obtained by the Des Moines Register weeks earlier.",
    "The result: Two candidates claiming victory, and one of them quitting the race before the month was over.",
    "The text comes entirely from Donald Trump, speaking at a rally for Perdue last Saturday, condemning Gov.",
    "last week, after a federal jury in Los Angeles convicted the nine-term congressman of lying to the FBI.",
    "“I’m absolutely not going to throw her under the bus, or anybody else who is a friend of mine.”\nAlaska.",
    "“Working together, we will keep this seat in Republican hands,” Flood said after Fortenberry resigned.",
    "Brian Kemp (R-Ga.) as a “turncoat” and “disaster” who “allowed massive voter fraud to occur” in 2020.",
    "“You've got to sort of throw out the fact check wand and hope that it disappears,” Vance told Kasler.",
    "The party would consider “diversity,” from race to unionization levels, in deciding who went first.",
    "Kay Ivey for Governor, “I Like It.” Four years ago, in an ad titled “Tough As Nails,” Alabama Gov.",
    "The Democratic National Committee never comes out and says that it wants to move on from Iowa.",
    "He immediately got the endorsements of the state's Republican establishment, including Gov.",
    "The soonest any of those seats will be filled: mid-June, after the runoff in Nunes's seat.",
    "An illegal $30,200 campaign donation ended the career of Rep. Jeff Fortenberry (R-Neb.)",
    "is facing a primary challenger from his right: veteran and football star Jake Bequette.",
    "“I think that's a joke for the Republican Party,” Vance said of the plan's tax portion.",
    "But just 30 percent of them pick him in a potential primary challenge to Gov.",
    "Tom Cotton.” Elected in the 2010 tea party wave, Sen. John Boozman (R-Ark.)",
    "“Two tours in Iraq, don't tell me I haven't worked,” Mandel said then.",
    "Buttigieg and Sanders were both right, which was another problem.",
    "Ryan repeatedly tried to turn that accusation to his advantage.",
    "The coalition of the willing (to overturn the 2020 election).",
    "Perdue pops up only at the end, in a photograph with Trump.",
    "Flood's goal, until this week, was getting up his name ID.",
    "It doesn't even mention the congressman, and shows ex-Gov.",
    "“She is my friend, and she did nothing wrong,” said Vance.",
    "It's less clear what will happen to the GOP nomination.",
    "(Nevada will hold a primary, not a caucus, in 2024.)",
    "), announced that he'd resign at the end of March.",
    "Filing for the regular primary ended on March 1.",
    "Where people live has changed demographically.",
    "“Affirmative action is not about exclusion.",
    "Gibbons had not insulted Mandel's service.",
    "But the code isn’t very hard to crack.",
    "“Much has changed demographically.",
    "Dave Heineman and outgoing Gov.",
    "“Hillbilly Elegy” author J.D.",
    "It's about inclusion.",
    "John Boozman, “Sen.",
    "Pete Ricketts.",
    "Kathy Hochul.",
    "Florida Gov.",
    "Michigan.",
    "Missouri.",
    "Florida."
  ]
}