{
  "id": 2555,
  "mediaId": 2695,
  "date": "2022-03-19",
  "headline": "Ohio Senate candidates Mike Gibbons and Josh Mandel exchange blows in GOP debate, JD Vance earns massive lead in post-debate straw poll",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTU2MzQwMi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY5Mzc0NDYwN30.T4yno3zl113NM_Aczl8fdc81FmcFw2bK6SBjztVp0yo/img.jpg?width=1200&coordinates=0%2C0%2C0%2C171&height=600",
  "link": "https://www.theblaze.com/news/ohio-senate-candidates-mike-gibbons-and-josh-mandel-exchange-blows-in-gop-debate-jd-vance-wins-straw-poll",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Samuel Mangold-Lenett",
  "authorUrl": "https://www.theblaze.com/u/samuelmangold-lenett",
  "termIds": [
    3466,
    133,
    767,
    878,
    1171,
    5212
  ],
  "sentences": [
    "Mike Gibbons and Josh Mandel get in each other\\u2019s faces at tonight\\u2019s GOP #OHSen forum hosted by FreedomWorks.\\n\\n\\u201cYou watch what happens,\\u201d Mandel says.pic.twitter.com/fQuqfHxXHT\n— Heartland Signal (@Heartland Signal) 1647644328\nThe Gibbons campaign released a statement about the confrontation that said, \"Josh Mandel is unhinged, unfit and flailing – because he's losing.",
    "He said, \"While others made a mockery of themselves with their phony tough guy antics, I focused on engaging with the voters, honing in on the real problems that Ohioans face and providing true solutions that may make life better for working- and middle-class Americans.",
    "The event, sponsored by FreedomWorks, had more than 900 RSVPs, according to event staffers, and was intense from the outset as candidate Josh Mandel used his introductory remarks to attack Mike Gibbons's alleged business dealings with China.",
    "The evening's first question — regarding the U.S.'s relationship with Russia and China — brought tensions to a boiling point as Mandel once again used his permitted time to speak to criticize Gibbons for doing business with China.",
    "Whereas the other candidates worked to propose policy solutions to the questions they were posed, Mandel appeared more focused on reducing Gibbons's lead in the polls by attacking his business record.",
    "However, Mandel's strategy and Gibbons's subsequent rebuttals favored neither candidate as FreedomWorks's official post-debate straw poll overwhelmingly favored JD Vance's performance.",
    "A Friday debate between Republican Senate candidates in Ohio intensified primary rivalries as candidates exchanged jabs and confronted each other over their political bona fides.",
    "His attacks on Gibbons continued throughout the night as he appeared to be reading off a fact sheet containing information on Gibbons's financial dealings and FEC filings.",
    "Prior to the event, candidate Mike Gibbons, who is currently leading in the polls, implied that he was cautiously optimistic about his current lead over other candidates.",
    "Mandel responded by standing up and getting in Gibbons's face to tout his time in the military, saying: \"I understand fully, I've worked.",
    "After the brief kerfuffle, candidate JD Vance criticized Mandel for using his military service as a political credential.",
    "Vance believes that the poll's results are due to him focusing on issues that actually affect the average Ohio voter.",
    "\"You may not understand this,\" Gibbons said, \"Because you've never been in the private sector in your entire life.\"",
    "This clearly resonated with the crowd, and I am proud to have earned this kind of support from the attendees.\"",
    "We need an adult in the room, and Josh Mandel has proven that he is not capable of being that for Ohioans.\"",
    "Gibbons's responded to Mandel by criticizing him for never having worked in the private sector.",
    "Vance said, \"I think the way you use the U.S. Marine Corps, Josh, is disgraceful.\"",
    "He told TheBlaze, \"You never know until Election Day, but we feel confident.\"",
    "It continued, \"We can't leave this race to child-like candidates.",
    "He is only a professional at one thing: running for office.",
    "Two tours in Iraq, don't tell me I haven't worked.\"",
    "He is hellbent on lying because he is failing.\""
  ]
}