{
  "id": 2591,
  "mediaId": 2572,
  "date": "2022-03-23",
  "headline": "Ohio Senate race: Gibbons launches new ad blitz to give voters a behind the scenes look",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/Mike-Gibbons-16-9.jpg",
  "link": "https://www.foxnews.com/politics/ohio-senate-race-gibbons-ad-blitz-voters-behind-the-scenes-look",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "THREE TOP OHIO SENATE GOP RIVALS MAKE THEIR CASE TO TRUMP SUPPORTERS AT CPAC\nGibbons, who’s already invested more than $12 million of his own money in his Senate bid, is one of the leading contenders in a field that also includes former Ohio treasurer and former two-time Senate candidate Josh Mandel; best-selling author and venture capitalist J.D.",
    "Vance; former Ohio GOP chair Jane Timken, whose husband is the former chairman, CEO and president of his family’s steel manufacturing corporation; and Ohio state Sen. Matt Dolan, a former state and country prosecutor whose family owns Major League Baseball’s Cleveland Guardians.",
    "The spots, which Gibbons’ team says they’re spending six figures to run statewide, aim to give viewers who haven’t seen the candidate in person or in an interview or debate an idea of who Gibbons is as a person and where he stands on the issues.",
    "According to figures from the national ad tracking firm AdImpact, ad spending by the campaigns and super PACs in the Republican primary now stands at $38.5 million, with Gibbons the biggest spender, at $11.71 million.",
    "A Fox News poll conducted March 2-6 indicated Gibbons at 22% among like Republican primary voters, with Mandel at 20%, Vance at 11%, Timken at 9%, Dolan at 7%, and nearly a quarter of those surveyed undecided.",
    "Gibbons’ new ad buy is the latest sign that in a primary race where all nearly all the major contenders have plenty of personal wealth, or are backed by well financed outside groups, ad spending is soaring.",
    "Gibbons has been grabbing national attention since Friday, when he and Mandel almost came to blows during a heated face-to-face encounter in the first debate between the top five GOP candidates.",
    "THE LATEST FOX NEWS POLL IN OHIO'S CROWDED AND COMPETITIVE GOP SENATE PRIMARY\n\"We’re going to travel the state and today kicks off the next four months of our 88-county tour of Ohio.",
    "The digital spots, which the Gibbons campaign shared first with Fox News on Wednesday, spotlight the candidate’s ongoing statewide bus tour, which started in January.",
    "Gibbons, a Cleveland entrepreneur, real estate developer and investment banker who’s making his second bid for the Senate in the race to succeed retiring GOP Sen.",
    "\"We have too many politicians that just can’t bear to tell the truth because it might lose them a few votes or might change the way people view them.",
    "The Ohio primary is currently scheduled for May 3, but a dispute over redistricting may force state lawmakers to move back the date of the contest.",
    "The Ohio Senate race is the second most expensive in the country when it comes the ad spending, trailing neighboring Pennsylvania.",
    "Rob Portman, is launching a new digital ad blitz that takes viewers along for a ride as he tours the state on his campaign bus.",
    "FIRST ON FOX: Mike Gibbons wants to give Ohio voters a behind the scenes look at his Republican campaign for the Senate.",
    "We’re going to meet every single person that we possibly can,\" Gibbons says at the top of the initial ad.",
    "Video of nearly physical confrontation at a showdown outside of Columbus quickly went viral.",
    "I’m going to tell you the truth whether you want to hear it or not.\"",
    "I deal with facts and reason,\" Gibbons says in the first ad.",
    "I’m a Constitutional conservative without apology.",
    "We’re going to leave no stone unturned.",
    "I don’t deal with slogans.",
    "I’m not a politician.",
    "\"I am a businessman."
  ]
}