{
  "id": 2667,
  "mediaId": 2663,
  "date": "2022-03-22",
  "headline": "JD Vance blames his age for saying “stupid” things dissing Trump",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/03/jd_vance_gage_skidmore_2021.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/jd-vance-blames-early-30s-saying-stupid-things-dissing-trump-20220322",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Hudson",
  "authorUrl": "https://www.queerty.com/author/david-hudson",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’ve been very public about the fact that I voted for the president in 2020, that I was wrong about the president back in 2015 [and] 2016, and that he’s been the greatest president of my lifetime for the very simple reason, there are many, but one very important reason, that he revealed the corruption within Washington DC.”\nVance went on to say his age in 2016 had been a factor.",
    "Vance (@JDVance1) September 8, 2021\nEarlier this year, he criticized President Biden for contemplating conflict with Russia over Ukraine, telling Steve Bannon, “We did not serve in the Marine Corps to go and fight Vladimir Putin because he didn’t believe in transgender rights.",
    "Which is what the U.S. State Department is saying is a major problem with Russia.”\nRelated: JD Vance suddenly gives AF about Ukraine after saying he doesn’t care if Putin attacks trans people\nAlso on last night’s Ohio debate was former state treasurer Josh Mandel.",
    "Vance posts racist video but all anyone’s talking about are his erect nipples and bad eyeliner\nSince announcing his political ambitions, Vance has taken an increasingly far-right, America First standpoint on a range of issues.",
    "This included last year suggesting that childless people, such as Transportation Secretary Pete Buttigieg (childless at the time), should have fewer votes than people with children.",
    "According to a survey conducted by The Hill last week, Businessman Mike Gibbons is the current frontrunner, polling around 22%, followed by Mandel on 15%, and then Vance on 8%.",
    "“I’m doing everything I can to earn his support,” said Mandel before suggesting Trump critics like Sen. Mitt Romney (Utah) should be “eliminated” from the Republican party.",
    "He was a great President.”\nAfter calling Trump and “idiot,” “noxious,” and “reprehensible” in 2016, JD Vance now says he is the greatest president in his lifetime.",
    "When all five were asked to raise their hand if they believed the Republican party should move on from the 2020 election, Dolan was the only one to do so.",
    "This includes candidate JD Vance, the venture capitalist who also became a bestselling author with the publication of his memoir, Hillbilly Elegy.",
    "In the same speech, Vance praised Hungary’s far-right, anti-LGBT President Viktor Orbán, for encouraging married couples to have children.",
    "As his nod of approval will likely result in a boost at the polls, most of them are saying whatever they can to court his favor.",
    "He also mocked Democratic Rep. Alexandria Ocasio-Cortez for highlighting the existence of two-spirit individuals.",
    "Asked about his change of heart last night, Vance said Trump’s performance in the White House had impressed him.",
    "“One thing I’d point out is that I was just north of 30 years old when I said a lot of those things.",
    "In 2016, he said he would not be voting for Donald Trump and posted a string of anti-Trump tweets.",
    "The only candidate who didn’t fall over himself to praise Trump was local Senator Matt Dolan.",
    "“All of us say stupid things and I happened to say stupid things very publicly,” said Vance.",
    "Five GOP candidates hope to replace Republican Rob Portman, who is stepping down this year.",
    "And one of the things that’s different is that I did change my mind about Donald Trump.",
    "These tweets have now been deleted and Vance has completely reversed his position.",
    "None of them have yet been officially endorsed by former President Trump.",
    "Dolan and former Ohio GOP chair Jane Timken both polled around 6%.",
    "Vance, 37, has not always been a fan of the former President.",
    "Would love if progressives just stopped inventing words.",
    "A live TV debate was broadcast state-wide last night.",
    "The Republican US Senate race in Ohio is heating up.",
    "He also said he was hoping for Trump’s endorsement.",
    "pic.twitter.com/iGDBMZWMV9\n— Ron Filipkowski ????",
    "(@RonFilipkowski) March 21, 2022\nRelated: J.D.",
    "It included the Republican primary contenders.",
    "This included calling Trump “reprehensible”.",
    "I’m sorry but what the hell is two-spirit?",
    "The primary is due to take place on May 3.",
    "I got baptized three years ago.",
    "I’ve had three kids since then.",
    "https://t.co/QfxM0GRhQX\n— J.D.",
    "A lot has changed in my life.",
    "You know, a lot’s different.",
    "I re-engaged with my faith."
  ]
}