{
  "id": 2748,
  "mediaId": 2537,
  "date": "2022-03-28",
  "headline": "False claims about 2020 election dominate debate between Ohio GOP U.S. Senate candidates",
  "image": "https://www.gannett-cdn.com/presto/2022/03/29/NCOD/55d061ad-d108-49ff-a85a-2f8d6c45890c-eln_sen_rep_debates_JB_37.JPG?crop=7687,4324,x0,y385&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/congressional/2022/03/28/ohio-senate-race-gop-candidates-come-together-debate/7132071001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    1804,
    2201,
    3466,
    3920,
    764,
    878,
    1171,
    5212
  ],
  "sentences": [
    "You can watch the debate below:\nHaley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Timken, Vance and Gibbons denied having any investments from which they would need to divest, but a recent Associated Press report found multiple candidates are linked to companies at one point involved with Russia.",
    "Misinformation about the 2020 election dominated a debate between Ohio's Republican U.S. Senate candidates on Monday night as they angle for former President Donald Trump's seal of approval.",
    "War in Ukraine\nThe candidates were generally unified in their belief that the U.S. should support its allies without sending troops to fight against Russia or policing a no-fly zone.",
    "Timken, meanwhile, was asked about her decision to hire former Trump adviser Corey Lewandowski after he was accused of sexually harassing a prominent donor last year.",
    "Mandel said Russian President Vladimir Putin is \"not our friend\" but argued China's Communist Party is the true threat that seeks to dismantle American interests.",
    "Vance, investment banker Mike Gibbons, former Ohio Republican Party chair Jane Timken, state Sen. Matt Dolan, and businessmen Mark Pukita and Neil Patel.",
    "With nearly one month to go before the May 3 primary, many GOP voters are still undecided and no candidate has maintained a consistent lead in the polls.",
    "The debate's moderator, Karen Kasler, chief of the Ohio Statehouse News Bureau, repeatedly fact-checked the candidates, drawing heckles from the crowd.",
    "Most of the Republicans on stage repeated false claims about the 2020 election during the debate and cast doubt on President Joe Biden's victory.",
    "Dolan is the only one who's not aggressively courting Trump's endorsement, and the former president said he won't support the state senator.",
    "U.S. Rep. Marjorie Taylor Greene, who's backing Vance, came under fire last month for speaking at a white nationalist conference in Florida.",
    "They argued the U.S. should finish Trump's wall and said the Biden administration has allowed an influx of drugs to enter the country.",
    "Defending their supporters\nMany of the candidates have received endorsements from high-profile Republican leaders in recent months.",
    "Mandel jumped in and called the question unfair, adding that Lewandowski was a \"force for good\" in getting Trump elected.",
    "Timken avoided the question and said Lewandowski knows she's \"been in the trenches fighting for America First policies.\"",
    "Claims echoed by the candidates – such as more votes being cast than registered voters – have repeatedly been debunked.",
    "There are people up on this stage who are literally fighting for one vote, and that person doesn't even vote in Ohio.\"",
    "Only Dolan acknowledged Biden as the legitimate president and said his opponents need to move on from 2020.",
    "Rob Portman met at Central State University after a bruising week of fights and accusations of sexism.",
    "Immigration\nAnother issue the GOP candidates largely agree on: security at the U.S.-Mexico border.",
    "When asked about Greene, Vance accused media outlets of pitting Republicans against one another.",
    "Vance also argued that the U.S. should focus on domestic problems instead of the war in Ukraine.",
    "Monday's debate featured former state treasurer Josh Mandel, venture capitalist and author J.D.",
    "He said Greene was simply accused of appearing at an event \"where somebody said something bad.\"",
    "\"Corey Lewandowski chose to endorse Jane, but that doesn’t make him a bad person,\" Mandel said.",
    "An Associated Press review found fewer than 475 cases of fraud in battleground states in 2020.",
    "\"She said nothing wrong, and I'm absolutely not going to throw her under the bus.\"",
    "\"When you look to what this election's about, it's about you, Ohio,\" Dolan said.",
    "\"At the end of the day, it is not our job and it is not our business,\" he said.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "The Democratic candidates debated at Central State University earlier Monday.",
    "The candidates also found themselves answering for business ties to Russia.",
    "\"Ohio is a border state because of Biden's failed policies,\" Timken said.",
    "Seven contenders running for the chance to replace retiring Sen.",
    "\"She is my friend, and she did nothing wrong,\" Vance said.",
    "Here are other key moments from Monday's debate.",
    "\"I'm the only one that's fighting for you."
  ]
}