{
  "id": 2775,
  "mediaId": 2664,
  "date": "2022-03-14",
  "headline": "GOP voters finally buck Trump: Republicans unwilling to be Putin's puppets — for now",
  "image": "https://www.rawstory.com/media-library/donald-trump-afp.jpg?id=26975607&width=1200&coordinates=0%2C94%2C0%2C94&height=600",
  "link": "https://www.rawstory.com/gop-voters-finally-buck-trump-republicans-unwilling-to-be-putin-s-puppets-for-now/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Marcotte",
  "authorUrl": "https://www.rawstory.com/u/amanda_marcotte_salon",
  "termIds": [
    1328,
    2201,
    3426,
    3500,
    3709,
    305,
    878,
    5287
  ],
  "sentences": [
    "Vance, who, in his never-ending quest to be as Trumpy as possible, previously made comments minimizing the invasion of Ukraine, reporter Henry Gomez found Vance supporters who said \"I don't think we're doing enough\" to help Ukraine beat Russia back and that paying more for gas to sanction Russia is \"not going to cripple us.\"",
    "When Russian President Vladimir Putin started openly prepping his invasion of Ukraine a few weeks ago, it was clear that Donald Trump and his biggest stooges saw this as their big moment to get Republican voters on board with their pro-Putin agenda.",
    "While Democratic voters were more decisively anti-Putin, Republicans are right behind them, with 55% of Republicans saying that Putin is mentally unstable and 61% saying they had a positive opinion of Ukrainian President Volodymyr Zelenskyy.",
    "For years, Trump propagandists like former Trump advisor Steve Bannon and Fox News host Tucker Carlson had been seeding the idea of an authoritarian movement that would join Trump supporters in the U.S. with far-right leaders abroad.",
    "It's tempting, of course, to imagine that these folks are just so moved by the images of destruction and suffering in Ukraine that they've been pulled away from the obvious pro-Putin lean of Trump and his most popular propagandists.",
    "Carlson, Bannon, and Trump himself all likely see the strike against Ukraine in the same light as the January 6 insurrection: a blow against democracy and an attempt to expand the international footprint of their far-right ideology.",
    "But that sentimental view doesn't comport with the sadism Republicans show towards their fellow Americans, from their support for forced pregnancy to their approval of violent police crackdowns on Black Lives Matter protesters.",
    "Average Republicans may not understand why they are supposed to hate Ukraine, but if the nation and its president get demonized as \"woke\" long enough, there's a not-small chance they will get on board.",
    "Instead, they should be understood as indifferent to ideology, and happy to go along with any political system that serves their desire to keep their tribe in power over everyone else.",
    "As demonstrated by the exalting of European far-right parties, these leaders see themselves as part of a transnational movement aimed at ending democracy both here and abroad.",
    "If these leaders keep this propaganda up long enough, even their densest followers will start to realize that being pro-Putin and anti-Ukraine is what is expected of them.",
    "Instead of grokking the signals that backing Putin is what is expected of loyal Trumpers, the Republican base seems to believe that this war in Ukraine is bad business.",
    "For most Republican voters, backing Trump is less about an intricate philosophy about governance and more just identity politics and a desire to stick it to liberals.",
    "A Quinnipiac University poll released last week shows this gap between what Carlson and Bannon want, and what everyday Republicans believe about Putin and the war.",
    "But while these ideological yearnings aren't nearly as brainy as Bannon and Carlson like to imagine they are, they still are too cerebral for average GOP voters.",
    "No, instead what this all illustrates is the huge gap between what the leaders of Trumpism want and what the average GOP base voter gets out of following Trump.",
    "Carlson's pro-Putin bent was so obvious that the Kremlin instructed their own propagandists to use \"broadcasts of the popular Fox News host Tucker Carlson.\"",
    "They are more loyal to this ideology than they are to the U.S., which is why they barely bother to hide their enthusiasm for the January 6 insurrection.",
    "After briefly backing down from his pro-Putin stance, he's been circling around again to claims that Russia is being victimized by the U.S. and Ukraine.",
    "But given enough pressure and signals from leadership that being pro-Russia is part of the conservative identity, ordinary GOP voters may come around.",
    "For leaders like Carlson and Bannon, Trumpism is part of a larger ideology, which goes by many names but should be understood basically as fascism.",
    "They like Trump's racism and sexism, but most haven't really thought about what he stands for more deeply than that they share his bigotries.",
    "There is just one problem: Ordinary Republican voters don't seem to be picking up what the Trumpiest leaders in the GOP are putting down.",
    "Republican voters may not currently feel any compulsion to side with Russia over Ukraine, since both seem to be white Christian nations.",
    "This doesn't really compute with their political priorities, which are about the white Christian identity and sticking it to Democrats.",
    "When it looked like Putin was about to strike Ukraine and end their fledgling democracy, these men were beside themselves with joy.",
    "Or their eagerness to vote for Trump, for that matter, who has not a shred of human decency in him and glories in bullying others.",
    "They were fine with democracy when it was easier for conservative white Christians to maintain power through democratic means.",
    "None of which is to say that ordinary Trump supporters are morally superior to their more ideologically fascist leaders.",
    "Tucker Carlson clearly feels that he can bring his audience around to a more pro-Putin view through blunt repetition.",
    "They clearly envisioned a transnational push to end democracy and replace it with white nationalist autocracies.",
    "But some, especially Carlson, are already regrouping to find another way to push a pro-Putin/anti-Ukraine line.",
    "This is why Putin's invasion of Ukraine is received so differently by the Trumpist leaders and the hoi polloi.",
    "Another 66% of Republican voters support sanctions against Russian, even if it means higher gas prices.",
    "Bannon repeatedly made trips to Europe to make alliances with far-right parties across the continent.",
    "But ordinary Republicans only see a white Christian nation attacking another white Christian nation.",
    "Now that they're outnumbered by the Democratic coalition, however, they are happy to tank democracy.",
    "These Putin worshippers eventually backed off once the brutality of the invasion was on display.",
    "On the contrary, as Adam Serwer of the Atlantic famously wrote, cruelty is what attracts them.",
    "To this end, Trump made a big show during his presidency of aligning himself with Putin.",
    "But most couldn't articulate a coherent ideological argument for Trumpism beyond that.",
    "Carlson hosted segments romanticizing Hungary's nationalist leader Viktor Orbán.",
    "NBC News, in talking with Republican voters in Ohio, found much of the same.",
    "Speaking to Trump loyalists at an event for Republican Senate candidate J.D.",
    "Carlson argued that Putin was an innocent victim of Democratic propaganda.",
    "They don't see how killing a bunch of Ukrainians advances those interests.",
    "Above all other things, they really like that he \"triggers\" the liberals.",
    "Their only real concern is that people who look like them stay in charge.",
    "Trump, brimming with admiration, swooned at Putin's \"genius\" and \"savvy.\"",
    "Steve Bannon has started to bash Zelenskyy for fighting back.",
    "All that said, this is a situation very much in flux.",
    "Bannon gushed about how Putin was \"anti-woke.\"",
    "Cruelty is never a barrier for Republicans."
  ]
}