{
  "id": 287,
  "mediaId": 6555,
  "date": "2022-04-19",
  "headline": "Occidental Dissent Endorses J.D. Vance",
  "image": "https://i1.wp.com/occidentaldissent.com/wp-content/uploads/2022/04/Vance-campaign-ad-screenshot.jpg?fit=1200%2C619&ssl=1",
  "link": "https://occidentaldissent.com/2022/04/19/occidental-dissent-endorses-j-d-vance/",
  "mediaOutlet": "occidentaldissent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hunter Wallace",
  "authorUrl": "https://occidentaldissent.com/author/hwallace/",
  "termIds": [
    3466,
    4309,
    5366
  ],
  "sentences": [
    "Second, Vance has publicly said that he doesn’t care about the Ukraine, which is one of my top issues at the moment at a time when the Senate is voting 100-0 in favor of escalating the war in the Ukraine.",
    "Sickening.#OHSen #PutinWing\npic.twitter.com/dnSlcTVEOa\n— Republicans against Trumpism (@RpsAgainstTrump) April 19, 2022\nThere are a lot of reasons why I haven’t been that excited about J.D.",
    "First, I endorsed Warnock and Ossoff in the Georgia Senate races based on the $1,400 checks and my bet that Democrats would end up hanging themselves with such a narrow Senate majority.",
    "Vance: “I gotta be honest with you, I don’t really care what happens to Ukraine one way or the other.”\nDonald Trump just endorsed this guy for Senate.",
    "If Warnock and Ossoff had lost those races, the 2022 midterms would likely be a lot closer.",
    "It also helps that the alternative is Josh Mandel and the incumbent is Rob Portman.",
    "We desperately need more senators who are critical of American foreign policy.",
    "I will support people who are kinda sorta in line with my views.",
    "It goes without saying that Vance isn’t my ideal candidate.",
    "Third, I am not a purist and I am willing to be practical.",
    "I’m endorsing Vance for three reasons though:\n1.",
    "I have voted for Jeff Sessions in the past.",
    "Ohio could do a lot worse than J.D.",
    "Vance’s Senate campaign.",
    "Vance.",
    "J.D.",
    "3.",
    "2."
  ]
}