{
  "id": 2960,
  "mediaId": 2512,
  "date": "2022-03-14",
  "headline": "These Trump voters in Ohio are willing to pay higher gas prices to help Ukraine: report",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29534754&width=1200&coordinates=0%2C0%2C0%2C213&height=600",
  "link": "https://www.alternet.org/2022/03/trump-voters-gas-prices-ukraine/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    0
  ],
  "sentences": [
    "I pray every day to St. Nicholas to save the children in Ukraine who are in danger.”\n\\u201cI gotta be honest with you, I don\\u2019t really care what happens to Ukraine\\u2026I do care about the fact that in my community right now the leading cause of death among 18-45 year olds is Mexican fentanyl that\\u2019s coming across the southern border.\\u201d - @JDVance1 #OHSenpic.twitter.com/nf6MUzdWM5\n— JD Vance for U.S. Senate Press (@JD Vance for U.S. Senate Press) 1645290434\nBob Heinly, described by Gomez as a “retired cardiac technician” in Ohio, said he’s willing to pay higher gas prices if that’s what it takes to help Ukraine.",
    "“Here in the middle of former President Donald Trump’s Midwest base, in a state where a sense of economic malaise lands hard on rural and working-class voters,” Gomez reports, “many Republicans see higher gas prices as a small price to pay to help defend Ukraine.”\nPresident Joe Biden, working closely with the United States’ European NATO allies, has imposed tough economic sanctions against Russia in response to the Ukraine invasion.",
    "Vance, who is running for the U.S. Senate in Ohio, was obviously pandering to the “America First” crowd when he tweeted, “I don’t really care what happens to Ukraine” — and other MAGA Republicans, from Rep. Madison Cawthorn of North Carolina to Fox News’ Tucker Carlson to former President Donald Trump, have echoed Kremlin talking points about Ukraine.",
    "I think we need to be careful how it’s done, because I think Putin’s half nuts.”\nNonetheless, centrist Democrat Ed Rendell — who formerly served as governor of Pennsylvania, mayor of Philadelphia and chairman of the Democratic National Committee — believes that higher gas prices could be a major problem for members of his party in the 2022 midterms.",
    "On the right wing of the Republican Party, however, there remain influential voices pushing alternate views about the Russian invasion and the U.S. response.”\nGomez continues, “Fox News host Tucker Carlson has indulged in conspiracy theories sympathetic to Putin.",
    "I invest in things that are important to me.”\nGomez explains, “King and Heinly — among more than a dozen Ohio Republicans interviewed about the U.S. response to Russia’s war against Ukraine — described themselves as loyal Trump voters.",
    "Rep. Madison Cawthorn, R-N.C., recently called Zelensky a ‘thug.’”\nDave Johnson, who chairs the Columbiana County GOP in Ohio, told NBC News, “I’m not supportive of starting World War III over this.",
    "But NBC News’ Henry J. Gomez, reporting from Steubenville, Ohio, found a lot of concern for Ukraine in an area where Trump and the “America first” movement have enjoyed a lot of support.",
    "But Ohio voter Mary King, described by Gomez as an “unemployed caregiver,” wants to see the U.S. do even more to help Ukraine.",
    "Their comments represent a departure from the ‘America First’ mindset that helped Trump easily win the state twice….",
    "If gas prices are still this high, if inflation is still rising, in six months, it will be bad for all Democrats.”",
    "Rendell told NBC News, “It’s going to be far more important to see what these prices look like in six months.",
    "King told NBC News, “I don’t think we’re doing enough.",
    "Heinly told NBC News, “It’s not going to cripple us.",
    "Ask the public what they are willing to sacrifice.",
    "“Hillbilly Elegy” author J.D."
  ]
}