{
  "id": 2988,
  "mediaId": 2664,
  "date": "2022-03-18",
  "headline": "Ambassador McFaul worries GOP's Putin wing could alter the outcome of Russia’s invasion of Ukraine",
  "image": "https://www.rawstory.com/media-library/compositie-image-of-reps-madison-cawthorne-and-marjorie-taylor-greene.jpg?id=29560020&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/republicans-putin-ukraine-russia/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1328,
    3130,
    3466,
    3709,
    3741,
    652,
    878,
    5287,
    5366
  ],
  "sentences": [
    "Are you going to side with people who are actually becoming operational assets — whether they are witting or not — they are now on notice that they are on evening news in Russia during a time when an adversary is slaughtering innocent women and children?",
    "Watch:\nNOW WATCH: Ted Lieu hilariously shames GOP's failure to discipline members who attended white nationalist conference\nTed Lieu shames GOP's failure to discipline members who attended white nationalist conference\nStories Chosen For You",
    "So people are coming home from work in Moscow and tuning in to people like Madison Cawthorn, [Sen.] Josh Hawley (R-MO), Tucker Carlson,\" noted Frank Figliuzzi, the former assistant director for counterintelligence at the FBI.",
    "\"We have reporting earlier this week, I believe it was Mother Jones, that claims to have their hands on a leaked memo that tells the Russian news agencies, please feature Tucker Carlson prominently on the evening news.",
    "The panel on MSNBC's \"Deadline: White House\" on Friday had harsh words for political extremists in America who are pushing Vladimir Putin's disinformation about Russia's invasion of Ukraine.",
    "So, you have to ask yourself, when you are either choosing what to watch here in the United States or you're choosing who to vote for here in the United States, what team are you a part of?",
    "Putin can't crush them with the army that he has or the ideas he is trying to propagate, and in the long run the world wants us to be strong as a leader of the free world.",
    "And when I see these quotes — I didn't know two of the three that you just put out — those are phrases that Putin is using in his rally today.",
    "Host Nicolle Wallace, who was a top Republican strategist prior to her career in broadcast journalism, read a quote from GOP candidate J.D.",
    "\"We know from hard evidence that some of the people you mentioned are being featured nightly on the largest news networks within Russia.",
    "Michael McFaul, the former ambassador to Russia, worried that Republican support for Putin could influence the outcome of the war.",
    "\"We win in the long run against our autocratic adversaries unless we are divided here at home fighting over these things.",
    "And in the long run, I am incredibly confident and optimistic about it with one caveat,\" McFaul explained.",
    "She also read quotes from Reps. Madison Cawthorne (R-NC) and Marjorie Taylor Greene (R-GA).",
    "It's time to make that choice, it's time for the public to speak out loudly on that.\"",
    "Wallace agreed, saying the Republicans \"should be disqualified\" for their comments.",
    "Do you want to be with them or do you want to be on team America?",
    "\"Zelenskyy and the Ukrainians when they win, I don't know when.",
    "Vance, who said he did not care what happens to Ukraine.",
    "\"What does Putin do with that?\"",
    "That is really disturbing.\"",
    "Wallace asked."
  ]
}