{
  "id": 2991,
  "mediaId": 2745,
  "date": "2022-03-17",
  "headline": "The Trailer: How war in Ukraine is re-routing the campaign trail",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SFMC6EVGDUI6ZBRIHWSPVD4HCQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/17/trailer-how-war-ukraine-is-re-routing-campaign-trail/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Vance was one of the first speakers announced for an “emergency conference” organized by the American Conservative on March 31, a few weeks before Ohio's primary, and coming when other outlets for the nationalist right are publishing arguments for Putin to “be defeated now,” with weapons including “long-range, high-altitude anti-aircraft batteries.”\nWhile Greene and others argued that a Russian victory was assured, Victor Davis Hanson was arguing in American Greatness that “Putin may never fully absorb Ukraine as long as it can easily be supplied across its borders by four NATO countries,” and that doing so would be worth it.",
    "That changed last week, after the Club for Growth began airing ads attacking her over the connection; her Senate campaign called it a “nonsense line of attack” that distorted “Jane’s record of standing up for Ukraine.”\nIn North Carolina, where another Republican U.S. Senate primary is unfolding, former governor Pat McCrory began running ads last week that accused Rep. Ted Budd (R) of praising Russian President Vladimir Putin's intelligence “while Ukrainians bled and died” and attacked him for voting against a previous round of Russian sanctions.",
    "The court previously rejected arguments from both North Carolina and Pennsylvania legislators — that there is no role for anyone but state lawmakers to play here, when the Constitution says that “the times, places and manner” of holding federal elections “shall be prescribed in each state by the legislature thereof.” But three conservative justices wrote this month that they agreed with the argument, and Justice Brett M. Kavanaugh, in a separate dissent, wrote that it was simply too late in the process to throw out maps before May primaries.",
    "Vance in his campaign for Ohio's Senate seat rolled out two immigration-focused spots this month: one featuring a woman whose cousin was killed by an undocumented immigrant, and this one, which says Vance's “childhood [was] torn apart by addiction” and that he's now “a mission to stop death from streaming across our border.” (Vance frequently talks about fentanyl trafficking on the U.S.-Mexico border, but the ad does not mention the opiate by name.)",
    "In all seriousness, stop this now.” After Rep. Maria Elvira Salazar (R-Fla.) told a reporter that she favored a no-fly zone, Florida state Rep. Anthony Sabatini (R), who is considering a run for Congress if a new map makes it possible, tweeted that she needed to “face a primary challenge ASAP.”\nThat wing of the GOP had thrived under Trump's leadership of the party, and has worried that the party's hawks were using this moment to reassert control.",
    "For the first time, the PAC goes after Mike Gibbons, a wealthy businessman who's been moving up in polls, with a quick bit of file footage and a line about “elites” who have “failed us.”\nClub for Growth Action, “Hit Job.” Former North Carolina governor Pat McCrory (R) got a burst of earned media attention last week when he accused Rep. Ted Budd (R-N.C.), his chief rival in the May 17 U.S. Senate primary, of being soft on Putin.",
    "San Franciscans for Public Safety Supporting the Recall of Chesa Boudin, “Incompetent.” The first lines in this attack ad could have come from San Francisco District Attorney Chesa Boudin: “San Francisco can have criminal justice reform and public safety.” But it's a windup for interviews from San Franciscans who say Boudin's prosecutorial discretion — which focuses on violent crime over petty crime — has led to more violence.",
    "“I never in a million years thought that my son,” says Jason Young, one of the citizen voices, “let alone any 6-year-old, would be gunned down in the streets of San Francisco and not get any justice.” Boudin actually won convictions of the men who shot Young's son Jace, but one of them was not yet 18 when the shooting took place, and Boudin tried him as a minor, a detail left out of the ad.",
    "“I no longer live in the congressional district as it’s redrawn.” Trump, who'd endorsed challengers to all of the House Republicans who voted for his impeachment after the Jan. 6 insurrection, had never officially retracted the Carra endorsement, but Carra had raised a bit more than $350,000 for his race by the end of 2021 — a third of Huizenga's fundraising, and a quarter as much as Upton.",
    "Vance in a Wednesday interview with Breitbart News, discussing “the nonstop propaganda we’re seeing from the media.” Elites who did not care about drugs crossing the U.S.-Mexico border, he said, were “trying to get us to focus on this Ukraine situation to the exclusion of everything else.”\nIn campaigns, including the one in Ohio, the Ukraine issue has only just started to spill over.",
    "On Wednesday, Samuels talked with The Trailer about why he decided to run, the “surprising” support he was already getting and the attacks he has already gotten — including criticism over the 2020 death of a child who had joined him on a biking trip, and a tweet he'd written and deleted about the drowning: “Can't swim, but can govern.” The campaign, he predicted, would be nasty.",
    "At their policy retreat in Philadelphia last week, and at a meeting of the Democratic National Committee, Democrats echoed President Biden in blaming rising gas prices, which had been increasing before the war, on Putin's invasion, and attacking the Republicans who lead in congressional preference polls as “soft” — in DNC chair Jaime Harrison's words — on Russia overall.",
    "While a half-dozen members of the House have been elected with the support of Democratic Socialists of America, none of them — including Rep. Alexandria Ocasio-Cortez (D-N.Y.) — has endorsed a DSA statement calling “for the U.S. to withdraw from NATO and to end the imperialist expansionism that set the stage for this conflict.” None has commented on it, even when asked.",
    "The Club for Growth, which supports Budd, hit back with the full context of Budd's remarks, showing GOP voters clips of the congressman denouncing Putin as “evil” and a “thug.”\nThere's been less infighting among Democratic candidates, especially in swing seats, where there hadn't been much debate inside the party about Ukraine or who the aggressor really was in Europe.",
    "“Your words mean nothing to them,” snarked Rep. Conor Lamb (D-Pa.), a candidate for U.S. Senate in Pennsylvania, “but antitank missiles and bullets do.”\nThe Democrats who are talking about Ukraine describe it as a human rights crisis that demonstrates why the United States is committed to NATO, with less differences in candidate positions than in what they emphasize.",
    "“The decisions by the courts below to nullify the General Assembly’s chosen ‘regulations’ of the ‘manner of holding elections,’ and to replace them with new regulations of their own, discretionary design, simply cannot be squared with the text and original meaning of the Elections Clause, nor with this Court’s interpretation of it,” the plaintiffs argue.",
    "Later, he told the YouTube channel Exposure that Vos had told the other attendees that “he’s running for governor, too, and I don’t want this to be a campaign event.”\nAccording to Molly Beck of the Milwaukee Journal Sentinel, Vos didn’t give the “Toss Vos” voters what they’d wanted, but he did say that “widespread fraud” had distorted the 2020 election.",
    "“I promise to oppose sending our troops to Ukraine, or any conflict without a direct national interest.”\nNone of the conservative nationalists who share Kent's view have softened their positions since the invasion; like Vance, they've asked why so many Republicans have gone along with the official narrative, in which Zelensky should get what he wants.",
    "“On Jan. 6, I proudly stood with President Trump to fight against voter fraud.”\nDoctor Oz for Senate, “Fight the Establishment.” The money-burning ad wars between Mehmet Oz and David McCormick, two Republicans running for U.S. Senate in Pennsylvania, continue with this spot based on Oz's campaign rally condemnation of the McCormick ads.",
    "In a TV ad that began running last week, Washington state Republican candidate Joe Kent says that “the same establishment that kept us in Syria is inciting conflict with Russia” and that Rep. Jaime Herrera Beutler (R-Wash.), who he is running against, can't be “trusted” to oppose it, another reason for GOP voters to replace her.",
    "That's who this spot is aimed at, with a short clip of Brooks's speech, though it doesn't include him saying it was time for patriots to start “taking names and kicking ass.” It frames the speech as an attack on “weak” Republicans, implying that you can always count on Brooks to do that.",
    "She repeated that last point, that Russia would inevitably triumph, two other times in the video, calling it “a war they cannot win” and “a war whose outcome already seems certain,” and like-minded Republicans have warned that more money and resources for Ukraine would be wasted.",
    "Republicans whose agenda revolved around Donald Trump's preferences were voting en masse to punish Russia with trade penalties and sanctions; Democrats who'd resisted the Iraq War were ignoring segments of their party and electorate that wanted to de-escalate and roll back NATO.",
    "And the American people stand on the side of freedom and truth and democracy.”\nDemocrats like Jeffries want to take advantage of what's happening on the right: a real debate about whether the United States should care about the invasion, or whether it's taking the right side.",
    "“If we truly care about suffering and death on our television screens, we cannot fund more of it by sending money and weaponry to Ukraine to fight a war they cannot possibly win,” Greene said in a video released Wednesday, after Zelensky gave a virtual address to Congress.",
    "We don't want to repeat what we have heard about people doing in the past.”\nMo Brooks for Senate Committee, “January 6.” Until now, images of the Jan. 6 insurrection have appeared exclusively in Democratic ads, to shame Republicans for what happened that day.",
    "A Quinnipiac poll released Wednesday found that 75 percent of American adults wanted Washington to “do whatever it can to help Ukraine, without risking a direct war between the U.S. and Russia,” even while a majority of adults opposed creating a no-fly zone.",
    "When their leaders sitting at City Hall or the Fifth District leadership announce a hatred of the police, it sends a message to the criminal community that, oh, our taboos are coming down and the standard of behavior now has been changed to a lower level.",
    "7-13, 10,441 adults)\nA major threat: 50%\nA minor threat: 28%\nNot sure: 16%\nNot a threat: 6%\nWhether candidates like it or not, voters have been absorbing more news from the Ukraine war theater than news about domestic politics — for the past three weeks.",
    "Former Cincinnati mayor John Cranley, now running for governor, says his city already “defied the odds,” without getting into details, except for a description of the city's Innocence Project and images of prisoners celebrating after being exonerated.",
    "Voter opinion has been only loosely tied to partisan preference, too — a challenge for Democrats who have come to distrust their own hawks, and to Republicans who have embraced Trump's “America First” skepticism of NATO and Ukrainian sovereignty.",
    "The conservatives have filibustered, when in session, to block the approval of a map that would retain the GOP's 6-to-2 advantage, and support one that would split up the Kansas City area to create just one safe seat for Democrats, in St. Louis.",
    "McCrory's spot quoted Budd as saying Putin was a “very intelligent actor,” and this spot adds the next line — “although I'd say he's been quite erratic in his approach.” What else, a narrator asks, would you expect from a “lying liberal”?",
    "A Monmouth poll, also released Wednesday, found 81 percent of adults favoring the sanctions placed on Russia and individual Russians so far, even though 72 percent of adults believed they were paying higher prices as a result.",
    "On Tuesday, Republican state Rep. Steve Carra abandoned his campaign for the 4th Congressional District, after Donald Trump, who'd issued a statement supporting him last year, got behind Rep. Bill Huizenga (R-Mich.) instead.",
    "And a new Pew Research survey, on Tuesday, found 77 percent of adults in favor of “keeping large numbers of U.S. military forces in NATO countries near Ukraine.” In the Monmouth poll, support for that came in at 69 percent.",
    "In 2020, the 72-year old community organizer, a former member of the city council, supported a primary challenge to Omar from Antone Melton-Meaux, who raised nearly $4.5 million despite never having run for anything before.",
    "“The American people, across the ideological spectrum understand that this conflict between Ukraine and Russia is also a conflict between democracy and autocracy, between freedom and tyranny, between truth and propaganda.",
    "“It’s understandable that people will have an emotional response to what they’re seeing in Ukraine,” said Dan Caldwell, a senior adviser at Concerned Veterans for America, who'll also speak at the emergency conference.",
    "“The current Ohio Redistricting Commission — composed of statewide elected officials and partisan legislators — is seemingly unwilling to put aside partisan concerns as directed by the people’s vote,” O'Connor wrote.",
    "As Russia's invasion of Ukraine continues, candidates who had built their campaigns around domestic politics, from inflation to climate to culture wars, are meeting an electorate that's following the war closely.",
    "The state Supreme Court voted again on Wednesday to reject a map from the state's Republican-led redistricting commission, with Chief Justice Maureen O'Connor, a Republican, once again siding with the Democrats.",
    "In Washington, members of the House Energy Committee sent a letter to environmental groups, demanding proof that they were not taking money from Russia — a campaign-ready rumor that had been debunked years ago.",
    "The final one is the decline of our democracy\nNow, regarding public safety, you know our community is pretty much being overrun with crime since George Floyd's death, and the riots, and all of the carjackings.",
    "If you read the last edition of The Trailer, you got caught up on the ongoing campaign by one faction of the GOP to decertify the 2020 election, and the work Assembly Speaker Robin Vos was doing to mollify it.",
    "In Wisconsin, state Treasurer Sarah Godlewski called on the state to divest from all of its Russian investments, and criticized Sen. Ron Johnson (R-Wis.) for even visiting Russia during the Trump presidency.",
    "“We have the Republican Party, the former president of the United States, the last Republican President, who's talking about how this former KGB officer is a 'genius' and is 'savvy,'” Harrison told CBS News.",
    "According to new polls, the first conducted entirely since the war began, that electorate is overwhelmingly in favor of supplying aid to Ukraine, with some voters willing to go further than the White House.",
    "Chris Sununu, a Republican, said he would veto a map that replaced the state's two competitive seats with a district that would lean heavily Democratic and one that would have a slight Republican advantage.",
    "In this edition: The midterm campaigns get a Ukraine detour, Rep. Ilhan Omar's (D-Minn.) opponent talks about his race, and why a few red states are still not finished with redistricting — or suing over it.",
    "Janet Mills and Republican former governor Paul LePage drew no opponents whatsoever; neither did Rep. Jared Golden (D-Maine), the only House Democrat who opposed last year’s Build Back Better legislation.",
    "“Yes, I worked in TV, which taught me how to take on the woke media,” says Oz, who says that the “greatest presidents in modern history” — Donald Trump and Ronald Reagan — also came from show business.",
    "In January, when Russia built up its military presence around the Ukraine border, just 26 percent of adults called that a “major threat” to the country, and 33 percent were completely unaware of it.",
    "Democrats sued Secretary of State Jay Ashcroft this week, asking courts to end the stalemate between Republican state senate leaders and a group of conservatives and approve a new congressional map.",
    "Former Ohio GOP chair Jane Timken, whose husband sits on the board of the Timken Co. ball bearing manufacturing company, had never faced much criticism over the company's business ties to Russia.",
    "Brooks, one of the few elected Republicans who spoke at the Jan. 6 “Save America” rally before the riot, has faced questions about that for 14 months — but not with Republican primary voters.",
    "It’s also another situation where you have to separate the Beltway from the rest of the country.”\nBut there was emotion driving the Ukraine reaction, and campaigns have adjusted accordingly.",
    "Sixty-nine percent of adults now say they've read “a lot” about the invasion, and there's almost no partisan gap in either knowledge of the invasion or assessments of how big a threat it is.",
    "“He's singularly responsible for the dramatic increase that we've seen,” House Democratic Conference Chair Rep. Hakeem Jeffries (D-N.Y.) said of Putin at a Q&A organized by Punchbowl News.",
    "Ron DeSantis (R) to veto the congressional map they've proposed, in favor of one that would increase Republican representation, eliminating one majority-Black district held by Democrats.",
    "Standing in front of a section of border wall, Timken promises as a U.S. senator to finish it and fight fentanyl trafficking, as the “Trump conservative” with “Trump tough” priorities.",
    "Jane Timken for Ohio, “Crackdown.” The former chair of the Ohio GOP continues to use video of Trump thanking her at a rally, even though Trump hasn't endorsed a candidate in her race.",
    "“Zelensky gives a speech and we give them another $800,000,000?” wrote Andrew McCarthy, a conservative veteran running for Congress in Upstate New York, after the address to Congress.",
    "I think you've got to fight fire with fire, man.”\nBarnes listened, said he didn't want to precipitate World War III, and moved on to his next stop, where he'd be meeting with farmers.",
    "It was born in a kind of idealistic think tank kind of atmosphere, of people who were justly upset about the inequities of the criminal justice system and wanted to make a difference.",
    "The state's first-ever map drawn by a nonpartisan commission put Huizenga in the same seat as Rep. Fred Upton (R-Mich.), whom Carra had been running against when Trump endorsed him.",
    "Last week, Edwards rejected a map that maintained the state's 5-to-1 advantage for the GOP by putting most Black voters between Baton Rouge and New Orleans into a single district.",
    "Byron Matthews, the bar's owner, asked if Wisconsin's lieutenant governor and Senate candidate would support a no-fly zone over Ukraine — and was disappointed when Barnes said no.",
    "The electorate is more responsive to Ukrainian President Volodymyr Zelensky's demands for help, and to media coverage that echoes and often lionizes the actor-turned-politician.",
    "The Club for Growth, which has mashed out-of-context McCrory clips to accuse him of wanting Trump to lose the 2020 election, points out that McCrory chopped up comments by Budd.",
    "And in every poll, a majority of Americans said they were closely following the conflict, frustrating the conservative nationalists who initially called the war a distraction.",
    "The on-record reaction has come, almost entirely, from critics of the party's left who have used the statement to indict a group they wanted out of Democratic politics anyway.",
    "On Wednesday, Vos spent hours meeting with a group of Republican voters at the state capitol in Madison and, separately, with county GOP chairs in Plover, behind closed doors.",
    "“People have grandparents that immigrated to Wisconsin because of what happened in Europe, whether it was during World War I or World War II,” Godlewski said in an interview.",
    "Sondra and I, when we saw the nine council members onstage at Powderhorn Park, declaring a commitment to disband and defund the Minneapolis police — we literally freaked out.",
    "I still believe that the Constitution and my oath that I took as an elected official does not allow me to decertify any of the elections whether I want to or not.”\nMichigan.",
    "“I know what matters most to you and your family, because I am you.” A lifetime ago, in a state next door, Christine O'Donnell got negative mileage from a similar line.",
    "But she was trying to relate the media's scrutiny of her to everyday voters' lives, while Barnette is establishing herself as one of the race's non-multimillionaires.",
    "tweeted Thursday morning, reacting to a video from Rep. Marjorie Taylor Greene explaining why the Georgia Republican opposed further intervention on Ukraine's behalf.",
    "Some 35 percent would support military action “even if it risks a nuclear conflict with Russia,” which the president has ruled out, and no lawmaker phrases that way.",
    "Friends for Kathy Barnette, “Kathy Barnette for U.S. Senate.” Get used to this image in 2022: a candidate exiting a car at a gas station to talk about the prices.",
    "“But for policymakers, in times like these, it’s important that they keep a level head, and focus on the facts on the ground along with the risks of escalation.",
    "What that leads to is a deterioration of all of the collaborative work that's been done because it's been trivialized and minimized, and we make steps backward.",
    "For now, candidates who say they're more concerned with the U.S.-Mexico border than Russian troop movements 5,000 miles away are out of harmony with Americans.",
    "My team has been surprised, not just by the amount of money coming in, which has been substantial, but by the outpouring of support and volunteerism coming in.",
    "The city had become less safe, he argued, thanks to activists who called for the “defunding” of police — a slogan he saw as damaging to Democrats everywhere.",
    "In 2021, when Omar endorsed an effort to replace the Minneapolis Police Department, Samuels and his wife, Sondra, campaigned against it; their side won.",
    "And in North Carolina, where a Republican effort to throw out judge-drawn maps was rejected by the Supreme Court, Republicans filed a new petition.",
    "“Putin is targeting and slaughtering civilians in a brutal unprovoked war against Ukraine, a sovereign democratic nation,” Rep. Liz Cheney (R-Wyo.)",
    "And we knew that the category of humans that George Floyd most specifically belonged to, African American men in our community, were freaked out.",
    "The Russian people are experiencing low-grade trauma in defiance of the fate of the Ukrainian people, who are experiencing generational trauma.",
    "Other Democrats have begun to talk about fighting crime more than fixing the criminal justice system, or not mentioning one without the other.",
    "Once again, it asks the nine justices to strictly interpret the Constitution’s Elections Clause and allow the legislature to draw maps.",
    "A maternity ward was bombed and you're watching women who are nine months pregnant, covered in blood, being carried out on stretchers.",
    "DS: She tends to put herself in [the] center of the issues rather than issues [as the] center around which she works with her peers.",
    "The real progress is the infrastructure that is established, the collaboration, the unity and the mutuality that leads to progress.",
    "“Only the Kremlin and their useful idiots would call that 'a conflict in which peace agreements have been violated by both sides.",
    "Whoever lives in here in this district who sees that I'm a superior choice to the congresswoman, I encourage you to support me.",
    "DS: It went wrong because it was born and nurtured in absence of the voices and the input of the people who are most affected.",
    "In the five states where congressional redistricting isn’t over, factional and partisan fights are keeping new maps in limbo.",
    "“I wish we would take a harder stance on this,” said Matthews, 43, as images from Ukraine played on a nearby flat-screen TV.",
    "I will represent the issues of the 5th District, and if those issues are progressive, I will be progressive on those issues.",
    "Republicans had hoped that the court, citing the closeness of the May primary, would allow the latest map to stay in place.",
    "'”\nRepublicans like Cheney, increasingly marginalized in the party before the Ukraine crisis, have new math on their side.",
    "I’ve been so active in making sure that the George Floyd moment was not lost in lofty statements and unrealistic demands.",
    "“I'm always open to listening to people who have differences of opinion,” Vos told reporters after the Madison meeting.",
    "Any opening, when there are less cops, when society is more vulnerable, the criminal community adapts instantaneously.",
    "That discussion has engulfed only a section of left-wing media, and a few left-wing groups that work inside the party.",
    "I think people like Marjorie Taylor Greene and, unfortunately, our congresswoman are famous for saying what they say.",
    "DS: We knew the announcement of “defund” would embolden the criminal element who are exploitative in their thinking.",
    "Filing for the June 14 primaries ended Tuesday, with very little competition for the state’s most competitive races.",
    "Cranley-Fedor for Ohio, “Ohio Comeback.” Nearly every Ohio Democrat's messaging is about reviving struggling towns.",
    "“Everything is up,” says Barnette, who has trailed Oz and McCormick in polls as they've conquered the airwaves.",
    "So it was a very powerful financial organization, with the capacity to organize people, that was driving this.",
    "TT: So, on infrastructure, you'd have voted for the bill without conditioning it on passing Build Back Better?",
    "What would you say to someone who's heard about the death of Isaac Childress and doesn't want to vote for you?",
    "TT: So how do you navigate that issue if they if age is one of the lines used to say, let's keep who we have?",
    "See, that's what happens when you seek the perfect in compromising the good, is you make mistakes like that.",
    "So I'm going to throw my weight behind, you know, advocating for the most complete and effective solutions.",
    "And our congresswoman seems to be incapable of holding two sides of a debate that have merit on each side.",
    "Don Samuels is fed up with Democratic politics in Minneapolis, and fed up with Rep. Ilhan Omar (D-Minn.).",
    "It could be argued that I'm as active as a congressperson and while holding a full-time job, by the way.",
    "BELOIT, Wis. — Mandela Barnes did not come to BC's Sports Pub on Friday for a discussion about Ukraine.",
    "DS: We had little things like drug court and homelessness initiatives to decriminalize homelessness.",
    "“I personally knew the cost of war,” Kent, a former Green Beret endorsed by Trump, says in the ad.",
    "“This scares people from the Wall Street-Washington revolving door like Dave McCormick,” he says.",
    "I know that we're in trouble, we're in climate trouble, we’re in a historic generational trouble.",
    "“How much of a threat to U.S. interests is Russia’s invasion of Ukraine?” (Pew Research, Mar.",
    "We’ve got the infrastructure bill, where we will all benefit, and we can't thank her for it.",
    "DS: This was the most devastating day in my life and I was triggered by it being brought up.",
    "When state Rep. Timothy Ramthun (R) showed up for the first meeting, he was told to leave.",
    "It was a couple other groups that benefited from the drama around the George Floyd crisis.",
    "“It’s kind of amazing,” said “Hillbilly Elegy” author and Ohio U.S. Senate candidate J.D.",
    "And we are left unrepresented and unaccounted for in decisions made inside the Congress.",
    "The Republican-dominated state legislature is still considering whether to override Gov.",
    "I've been active in North Minneapolis before the congresswoman even thought of politics.",
    "And why did you tweet, “can't swim, but can govern” when someone attacked you for it?",
    "In 2020, Melton-Meaux's financial support became a big issue for Omar to run against.",
    "They think it’s, like, the bling of politics, glib statements, sweeping judgments.",
    "In Cranley's last two years as mayor, murders rose but violent crime fell overall.",
    "Unfortunately, younger people often have a different interpretation of progress.",
    "And so it was possible to paint him with whatever brush was the most effective.",
    "Every member has issues on which they are more progressive or less progressive.",
    "DS: As Reagan said in his famous debate, I wouldn't use her youth against her.",
    "You've seen police officers leave the force, but their budget wasn't defunded.",
    "You could point to who's supporting him and then cast aspersions on that.",
    "But when you live in a community like I do, you understand these things.",
    "It wasn't a volunteer group of committed citizens that was driving this.",
    "“I understand sanctions, and all that good stuff, but people are dying.",
    "The Black Lives Matter movement didn't really take off in Minneapolis.",
    "“It’s a redistricting year, so these things happen,” Carra told MLive.",
    "We held the landlords accountable for the conduct on their premises.",
    "Candidate filing doesn't end for the September primaries until June.",
    "There's a moral issue, and then there is then the raw math of it.",
    "Protect Ohio Values PAC, “Personal.” The super PAC backing J.D.",
    "“Complete and total” endorsements don't mean what they used to.",
    "DS: I'm running to be the congressperson for the 5th District.",
    "We have 300 less police officers than we did three years ago.",
    "The other one is bringing local issues to national attention.",
    "They were already online, and they raised about $35 million.",
    "“He’s got a better speaking fee than either of the Clintons.",
    "I'm not sure about all of the details of the Green New Deal.",
    "You know, this is sort of a nonviolent war we're in, right?",
    "He was a great candidate, but he was not a known candidate.",
    "I kind of made a glib statement and I apologize for that.",
    "TT: So before 2020, why was crime so low in Minneapolis?",
    "We got rid of blight that exacerbates negative behavior.",
    "Don Samuels: I'm running on basically three premises.",
    "We want nonviolent solutions to international crises.",
    "Let's get what we can and make incremental steps.",
    "TT: Would you have voted for Iron Dome funding?",
    "Any mistakes I make, I try to apologize for it.",
    "It has freed 34 innocent people,” says Cranley.",
    "And I think we have to have strong solutions.",
    "There's been no scientific analysis of this.",
    "DS: Yeah, I'm not an all-or-nothing person.",
    "DS: I would have voted with the president.",
    "Twitter is not a place for me to campaign.",
    "More obstruction,” Ramthun told reporters.",
    "I did not expect anything less or more.",
    "War is the ultimate imperfect solution.",
    "She's making points, gaining notoriety.",
    "TT: Would you take Republican support?",
    "TT: This campaign can get ugly, too.",
    "“We're seeing innocent people dying.",
    "DS: Yes, I would have voted for it.",
    "The Trailer: Why are you running?",
    "And I have been steeped in this.",
    "She is an incumbent politician.",
    "That's 72 years of experience.",
    "TT: Why is crime up now, then?",
    "It's also a national problem.",
    "Legislators still expect Gov.",
    "John Bel Edwards, a Democrat.",
    "“They said it was impossible.",
    "Sanctions are also imperfect.",
    "DS: I'm a centrist Democrat.",
    "DS: Yes on Medicare-for-all.",
    "DS: That's politics, right?",
    "That won't happen with me.",
    "Campaigns get ugly, right?",
    "“That's what we did today.",
    "“Guess what, everybody?",
    "I'm a perpetual leader.",
    "One is public safety.",
    "That's not what I do.",
    "He got one anyway.",
    "I’m 72 years old.",
    "I'm 72 years old.",
    "Democratic Gov.",
    "New Hampshire.",
    "Louisiana.",
    "Wisconsin.",
    "Missouri.",
    "Florida.",
    "Maine.",
    "Ohio.",
    "Gov."
  ]
}