{
  "id": 347,
  "mediaId": 2672,
  "date": "2022-04-15",
  "headline": "J.D. Vance Repeatedly Cited Racism as Reason Trump Drew So Much Support in 2016",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/AP22088062797091c.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/jd-vance-ohio-trump-support-racism-church-1338339/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "William Vaillancourt",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "He’s not going to do especially well on Election Day.”\nNEW: In past comments, OH Senate candidate JD Vance said Republicans used a 30 year strategy of antagonizing minorities to win elections and said white working class voters lack of church attendance was a cause of their Trump support in 2016.https://t.co/kap1dXaFMr pic.twitter.com/WIGI1BErj5\n— andrew kaczynski (@KFILE) April 15, 2022\nVance’s 2016 comments are ironic in retrospect not only because of how effusively he’s professed his love since launching his Senate campaign, but because he just released a campaign ad ridiculing the idea that conservatives who support Trump’s border wall are racist.",
    "“There is definitely an element of Donald Trump’s support that has its basis in racism,” he said during a PBS Newshour interview in September, adding in another interview that “race is definitely a part of the Trump phenomenon,” and, in another, that “some people who voted for Trump were racist and they voted for him for racist reasons.”\nVance also told WNYC that white, working-class Americans wouldn’t be lured by Trump if they attended church.",
    "“I think if folks went to church a little bit more they may not be as excited or as attracted to the sort of social experience that Trump provides.”\nCNN also pointed to an appearance on CNN during which Vance not only said that Trump attracted racists, but that Trump was openly hostile toward Black voters — and that this hostility is a strategy that’s governed Republican politics for decades.",
    "“We know there are many qualified candidates in this race who have stood up for the America First agenda over the years and have carried the Trump mantle over the years, again with the notable exception of JD Vance,” Ohio party leaders wrote in a draft letter obtained by the Associated Press.",
    "“The media calls us racist for wanting to build Trump’s wall.”\nVance also said recently that Rep. Marjorie Taylor Greene (R-Ga.), the conspiracy theorist endorsement he said he was “honored” to accept, “did nothing wrong” by speaking at a white nationalist rally a few months ago.",
    "“While we were working hard in Ohio to support you and Make America Great Again, JD Vance was actively working against your candidacy.”\nThe primary campaign, which has largely been a competition for who can suck up to Trump the most, will draw to an end on May 3.",
    "“It’s not just that Donald Trump doesn’t speak to issues of special concern of minority voters or Black voters, it’s that he seems to like actively antagonizing a lot of the Black voters,” Vance said on CNN in October 2016.",
    "Vance, who has been groveling for Trump’s endorsement for months, in 2016 said that racism and a lack of faith were the reasons why the soon-to-be president attracted so much support from white Americans.",
    "“I think Trump provides that sense of community that many in the white working class would have, if they actually went to church,” he said in June.",
    "Ohio Republicans have responded to the news of Trump’s potential endorsement of Vance by reminding the former president of his past comments.",
    "A week earlier he said he “happens to say stupid things very publicly” in reference to his past comments disparaging Trump.",
    "His past objections to Trump went beyond what many remembered, however, according to new clips unearthed by CNN on Friday.",
    "Vance, the Ohio Senate candidate Trump reportedly plans to endorse, wasn’t always a huge fan of the former president.",
    "I say that as a Republican who wants the party to get more Black voters.",
    "“Unfortunately, that’s been the Republican Party strategy for 30 years.",
    "And Trump seems to be taking that strategy just to the next level.",
    "Do you hate Mexicans?” Vance begins.",
    "It shows in the polls, right?",
    "It’s no secret that J.D.",
    "“Are you a racist?"
  ]
}