{
  "id": 3571,
  "mediaId": 2656,
  "date": "2022-03-13",
  "headline": "Now You're Talking: Trump Offers a Proposal to Destroy the Deep State",
  "image": "https://media.townhall.com/townhall/reu/o/2022/16/8b22b9c7-4c69-490a-be62-1016f4a14564-1110x740.jpg",
  "link": "https://pjmedia.com/news-and-politics/robert-spencer/2022/03/13/now-youre-talking-trump-offers-a-proposal-to-destroy-the-deep-state-n1566147",
  "mediaOutlet": "PJMedia",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Spencer",
  "authorUrl": "https://pjmedia.com/columnist/robert-spencer",
  "termIds": [
    1758,
    2201,
    2645,
    3466,
    3946,
    3975,
    4118,
    5371
  ],
  "sentences": [
    "Some worked actively against Trump, while the establishment media assured us that these self-appointed “deep state” saboteurs were the courageous guardians of “our democracy.” At his South Carolina rally Saturday night, Trump continued to tease a 2024 run and made a new promise about how he would break the power of the unelected “deep state.”\n“We will pass critical reforms,” Trump said, “making every executive branch employee fireable by the president of the United States.",
    "The proponents of civil service reform never envisioned a situation in which unelected and unaccountable opponents of a sitting president in the FBI, the Justice Department, and elsewhere would be determined to destroy the president — or at the very least make it impossible for him to carry out his policies — and could not be removed from their jobs because of civil service regulations.",
    "Historians take for granted that civil service reform was good for the country, and there has been no significant indication that it wasn’t until quite recently, when a president was thwarted in numerous endeavors by an army of unelected bureaucrats within the various departments and agencies of the government, who were determined to impede his agenda in every way possible.",
    "This came to be known as the spoils system, after the old adage “To the victor belong the spoils.”\nThe term “spoils system” is today practically synonymous with government corruption, but Jackson began it as a blow against corruption, preventing the establishment of an entrenched bureaucracy that would oppose the president.",
    "Garfield believed that the spoils system was an unending source of government corruption and pushed for measures that would end it, only to be shot by a man who publicly proclaimed that he was doing so because he belonged to the faction of the Republican party, the Stalwarts, that supported the spoils system.",
    "Wouldn’t government work more smoothly, and the executive branch be able to operate more effectively in the way the Founding Fathers envisioned it would, if the president were able to clear out the employees of these agencies who opposed him and replace them with people more in line with his vision?",
    "Certainly Old Joe Biden’s handlers have done so with a vengeance since they took over; but when Trump became president, he immediately began to encounter resistance from entrenched members of the government bureaucracy who refused to do as he ordered.",
    "And although the “deep state” only came to the attention of most Americans over the last few years, the controversy over the hiring and firing of civil service employees is one of the oldest controversies of the republic.",
    "As Rating America’s Presidents explains, Andrew Jackson was elected president in 1828 on promises to end the hegemony of a privileged aristocracy, and, to drain that swamp, he would need his own men in key positions.",
    "Garfield’s successor, Chester Arthur, was a Stalwart, but he demonstrated immense personal courage and honor in choosing to carry out the wishes of his slain predecessor rather than implement his own contrary agenda.",
    "The Trump administration made it clear that such a bureaucracy, determined to thwart the president at every turn, is a genuine concern; it is time for a reconsideration of the spoils system.",
    "— Trump proposes a drastic expansion of presidential power pic.twitter.com/u09FV910iA\n— Aaron Rupar (@atrupar) March 13, 2022\nIt’s a commonsensical solution, as Ohio Senate candidate J.D.",
    "Virtually all Americans believed, until the inauguration of Donald Trump as president on January 20, 2017, that when someone became president, he could begin to implement his agenda.",
    "The deep state must and will be brought to heel.”\n\"We will pass critical reforms making every executive branch employee fireable by the president of the United States.",
    "He removed a large number of civil service employees and replaced them with men of his own faction, which came to be known as the Democracy, or Democratic Party.",
    "His decision to do this effectively ended his political career, as he almost certainly knew it would, and yet he stood firm.",
    "If he doesn’t, we don’t live in a Republic, we live in a civil service driven oligarchy.”\nQuite so.",
    "The spoils system essentially died with the assassination of President James A. Garfield in 1881.",
    "“Everyone is losing their mind about this, but I’ve been calling for it at every town hall I do.",
    "Whether his stance was entirely wise in the long run, however, is a separate question.",
    "The spoils system has no defenders today, and has had none for over a century.",
    "Either the president controls the executive branch or he doesn’t.",
    "The deep state must and will be brought to heel.\"",
    "Trump is on the right track.",
    "It should have more.",
    "Vance pointed out."
  ]
}