{
  "id": 3763,
  "mediaId": 2730,
  "date": "2022-02-27",
  "headline": "Warhawk Liz Cheney on Ukraine: Isolationism 'Has Always Been Wrong'",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/209/583f618e-85a4-42dc-ad1b-cddf82124c46.jpg",
  "link": "https://townhall.com/tipsheet/landonmion/2022/02/27/warhawk-liz-cheney-on-ukraine-isolationism-has-always-been-wrong-n2603859",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Landon Mion",
  "authorUrl": "https://townhall.com/tipsheet/landonmion/",
  "termIds": [
    2298,
    2923,
    3466,
    3695,
    870,
    878,
    5240,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "GOP Rep. @Liz_Cheney calls the isolationist stance from some other Republicans toward Ukraine “wrong.” pic.twitter.com/zqD2s5Soqh\n— Face The Nation (@FaceTheNation) February 27, 2022\nVance, also the author of \"Hillbilly Elegy,\" said during an appearance on Stephen Bannon's show earlier this month that he does not care about Ukraine, arguing instead that the crisis at the U.S.-Mexico border is more important.",
    "\"And anyone who thinks that U.S. freedom and security is going to be maintained, if we take a step back and don't lead, you simply need to look at what's happening in Ukraine to recognize that those who fill the void when the U.S. steps away, are people like the Russians, like the Chinese, like the Iranians.\"",
    "Vance telling a podcast host he does not care what happens in Ukraine and Sen. Josh Hawley (R-MO) saying that the U.S. should not send troops to Ukraine to fight because it is \"not in our security interest,\" Cheney said isolationism has \"always been wrong.\"",
    "Source: Jim Bourg/Pool via AP\nRep. Liz Cheney (R-WY) claimed Sunday that isolationism has always been \"wrong\" and \"dangerous\" after some public figures called for a noninterventionist strategy for the Ukraine-Russia conflict.",
    "And Hawley told CBS News last week that the U.S. cannot afford to send more troops to Europe and explained that the U.S. should decrease military presence in Europe to focus on the threat of China.",
    "Pointing to Russian President Vladimir Putin's invasion of a \"democratic, sovereign nation\" in Ukraine, Cheney said the isolationist position is \"wrong morally\" and \"indefensible.\"",
    "\"I do care about the fact that in my community right now the leading cause of death among 18-45-year-olds is Mexican fentanyl that’s coming across the southern border.\"",
    "\"And so the idea that the world will be safe and that America will be able to be safe and free with an isolationist approach is wrong,\" she continued.",
    "And I think it's, it's indefensible for people to abandon those or suggest that we have no view as between Russia and Ukraine in this battle.\"",
    "America cannot defend and maintain our own freedom and security if we think that we're going to simply withdraw from the world and not lead.\"",
    "\"We are watching today the brutality of Vladimir Putin as he attempts to invade a democratic, sovereign nation,\" Cheney said.",
    "Vance has since indicated that he does care and attributed the blame for the situation in Ukraine to the elites.",
    "That is not in our security interest, we can take other actions, and should in Europe that are tough on Russia.",
    "\"We've seen isolationism in both parties, and it's always been wrong, and it's always been dangerous.",
    "Asked by host Margaret Brennan on CBS's \"Face the Nation\" about Republican Ohio Senate candidate J.D.",
    "We've got to keep focus on our number one security priority and that's East Asia.",
    "\"I don't really care what happens to Ukraine one way or the other,\" he said.",
    "\"I'm opposed to having them involved in the fighting,\" he said.",
    "America was founded on fundamental principles of freedom.",
    "\"We've been down that road before,\" Cheney said.",
    "You know, America stands for freedom.",
    "\"It's also wrong morally.",
    "That's China.\""
  ]
}