{
  "id": 3777,
  "mediaId": 2643,
  "date": "2022-03-04",
  "headline": "Trump Is 'Stray Orange Hair To Be Flicked Off Nation's Sleeve,' Says Writer",
  "image": "",
  "link": "https://www.newsweek.com/trump-stray-orange-hair-flicked-off-nations-sleeve-says-writer-1685125",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Justin Klawans",
  "authorUrl": "https://www.newsweek.com/authors/justin-klawans",
  "termIds": [
    2201,
    3103,
    3466,
    1068,
    4984
  ],
  "sentences": [
    "In 2012, Will wrote of former Speaker of the House Newt Gingrich, who at the time was one of the top contenders in the GOP presidential primaries: \"[Gingrich]... embodies almost everything disagreeable about modern Washington.\"",
    "Will argued in a Post op-ed published Friday, though, that Trump's influence over the party was waning, saying that he was \"faltering at the business of commanding outcomes that are...independent of his interventions.\"",
    "Notably, Will also wrote of his dislike for Trump several times throughout the 2016 presidential campaign, later saying in an interview that year that he was no longer a registered member of the Republican Party.",
    "\"Trump, harping on the cosmic injustice of his November loss in 2020, confused and demoralized Georgia Republicans enough to cause Perdue's defeat by 1.2 percentage points in the January 2021 runoff,\" Will said.",
    "\"Floundering in his attempts to wield political power while lacking a political office, Donald Trump looks increasingly like a stray orange hair to be flicked off the nation's sleeve,\" Will wrote.",
    "Political commentator George Will says in a scathing new opinion piece that Donald Trump is \"the suppurating wound on American life,\" predicting the end of the former president's political career.",
    "Will ended his piece by saying: \"For Trump, the suppurating wound on American life, and for those who share his curdled venom, war is a hellacious distraction from their self-absorption.",
    "While Will does identify as a libertarian-conservative, his lambasting of Trump is not the first time that he has criticized the former president, along with other Republicans.",
    "This includes the case of Idaho Lieutenant Governor Janice McGeachen, who, despite the former president's endorsement, trailed in the primary by 41 percent in a January poll.",
    "Another person pointed out by Will was Representative Ted Budd (R-N.C.), a Trump-backed candidate for a North Carolina Senate seat that is currently also behind in the polls.",
    "\"Nevertheless, Trump talked Perdue into running in this year's gubernatorial primary...in a February poll, [current Georgia Governor Brian Kemp] led Perdue by 10 points.\"",
    "Vance, groveling for Trump's benediction (Vance covets Ohio's Republican Senate nomination), two weeks ago said: \"I don't really care what happens to Ukraine.\"",
    "Will, a libertarian-conservative author, serves as a regular columnist for the Washington Post, providing an opposing view for the typically liberal newspaper.",
    "\"A European war is unhelpful for Trump because it reminds voters that [poet Henry Wadsworth] Longfellow was right: Life is real, life is earnest,\" Will said.",
    "\"Trump's strut through presidential politics was made possible by an American reverie; war in Europe has reminded people that politics is serious.\"",
    "A number of Trump's other political endorsements for the upcoming 2022 midterms are also trailing in their respective polls, Will noted.",
    "\"His residual power, which he must use or lose, is to influence his party's selection of candidates for state and federal offices.\"",
    "Will used the example of former Georgia Senator David Perdue as an example of what he said was Trump's detriment to Republicans.",
    "Will continued by analyzing the current situation in Ukraine, where Russian President Vladimir Putin's invasion remains ongoing.",
    "\"We are the sum of our choices, and Vladimir Putin has provoked some Trump poodles to make illuminating ones,\" Will wrote.",
    "That perception will dissipate if his interventions in Republican primaries continue to be unimpressive,\" Will said.",
    "Will additionally told USA Today in 2020 that he would vote for then-candidate Joe Biden in the upcoming election.",
    "He also heavily criticized Sarah Palin's vice-presidential candidacy in the lead up to her 2008 electoral loss.",
    "\"This is, however, perilous because he has the power of influence only if he is perceived to have it.",
    "Many Republicans continue to stand behind former President Trump.",
    "Fortunately, their ability to be major distractions is waning.\"",
    "Will was also a contributing editor for Newsweek until 2011.",
    "Newsweek has reached out to Trump's office for comment.",
    "\"J.D."
  ]
}