{
  "id": 3814,
  "mediaId": 2746,
  "date": "2022-03-03",
  "headline": "Trump’s America First, misunderstood",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/03/B3sadlerLGamericafi_c0-396-1600-1329_s1200x700.jpg?a1e6f85e8e65229beb0a2b939198e97dac1a62c0",
  "link": "https://www.washingtontimes.com/news/2022/mar/3/trumps-america-first-misunderstood/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelly Sadler",
  "authorUrl": "https://www.washingtontimes.com/staff/kelly-sadler/",
  "termIds": [
    1328,
    2201,
    3466,
    3975,
    878,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "But in his first days in office, he extended the existing New START treaty with Russia without any concessions, assaulted our domestic energy production by shutting down the Keystone XL pipeline, failed to respond to Russian cyberattacks on the Colonial Pipeline, dropped the Nord Stream 2 sanctions, and slow-walked lethal aid to Ukraine even as Mr. Putin was building up his forces along its border.",
    "It’s a fake narrative that needs to be knocked down — the populist wing of the Republican Party can simultaneously hold the view Mr. Putin is a war criminal, respect his abilities, root for Ukraine, question U.S. intelligence, be skeptical of sending our sons to war, be critical of Mr. Biden’s leadership, and yearn for better policies at home.",
    "Mr. Trump expelled Russian diplomats from the U.S., shut down the Russian consulate in Seattle, withdrew from the Intermediate-Range Nuclear Forces Treaty after Russia had violated it, tried to renegotiate the New START treaty with better terms for America, and imposed new sanctions against Russia on a near-monthly basis.",
    "Anyone who mentions the Biden family’s graft and Ukraine’s long history of corruption is quickly labeled “anti-Democratic.” Anyone who dares to say American politicians should be prioritizing “America First” policies is discredited, almost immediately, as an isolationist, ignorant of world affairs.",
    "There’s been much discussion in elite circles about a “moment of crisis within the Republican Party” for “praising Putin” and “refusing to condemn what seemed to be happening in Ukraine,” in the words of Democrat-operative-turned-“journalist” George Stephanopoulos on ABC’s “This Week” Sunday.",
    "Domestically, Mr. Biden has moved to cripple the U.S. oil and gas industry, spent trillions of dollars on welfare programs that helped spike inflation, and championed mandates that left Americans out of a job if they decided not to get a COVID-19 vaccination.",
    "Before the COVID-19 pandemic hit, tax breaks and deregulation led to record-low rates of unemployment and poverty for Black and Hispanic Americans, with middle-class workers saw their wages rising faster than the paychecks of their managers.",
    "Anyone who questions President Biden’s competence is deemed “unpatriotic.” Anyone who considers former KGB agent and now Russian President Vladimir Putin “smart” — as former President Trump said in his CPAC speech — is “praising” the tyrant.",
    "Mr. Trump signed into law sanctions to block Russia’s Nord Stream 2 pipeline with Germany and inked more than $25 billion in contracts with Poland to ship more U.S. liquefied natural gas to lessen Warsaw’s dependency on the Kremlin.",
    "OPINION:\nRussia’s invasion of Ukraine — and the horrors and atrocities that have accompanied it — have unified neoconservatives, globalist Democrats, the military-industrial complex and the mainstream media in pursuit of war.",
    "From the beginning, Hillary Clinton, our intelligence agencies and the mainstream media tried to paint Mr. Trump as a puppet of Mr. Putin — based solely on phony opposition research they shopped around and paraded as fact.",
    "Mr. Trump did himself no favors by publicly appearing chummy with Mr. Putin, but actions that speak louder than words — the Trump administration was one of the toughest in decades when it came to Russia.",
    "It’s easy and lazy for the Washington establishment to tie Mr. Trump and his America First supporters to Mr. Putin, for that’s the narrative they’ve sought to peddle for the last four years.",
    "Rebuilding our economy, achieving energy independence, controlling our borders, ensuring election integrity, enforcing our laws, rebuilding our military — all inspire confidence from within.",
    "It’s much tougher for them to admit that it was their own failed policies and globalist mentality that have driven us to the brink of World War III.",
    "Mr. Trump demanded NATO countries pay their fair share, and so they upped their defense spending by $40 billion, or 15%, during his time in office.",
    "His party prioritizes identity politics over unity and is attempting to make our elections less secure by having the federal government run them.",
    "In his four years at the helm, the U.S. never entered a war and advanced peace in the Middle East with the breakthrough Abraham Accords.",
    "There is a reason why Mr. Trump’s term was the first for a president in the 21st century in which Russia didn’t invade another country.",
    "Under Mr. Trump’s watch, our energy sector was unleashed, with the U.S. becoming a net oil exporter for the first time in 75 years.",
    "Laws are not being enforced at our borders nor within progressive Democratic-run cities, leading to a surge in crime rates.",
    "Elected Republican officials have been asked in cable news interviews to denounce Mr. Trump for his pro-Putin proclivities.",
    "International trade deals were renegotiated from Canada and Mexico to Japan and South Korea to benefit American workers.",
    "He increased military spending and armed Ukraine with Javelin anti-tank missiles and other lethal weaponry.",
    "On the campaign trail, Mr. Biden insisted he “knew how to deal” with leaders like Mr. Putin.",
    "When you have your house in order, you can leverage that strength globally and with dignity.",
    "It means building our resolve internally so we can exercise it on the international stage.",
    "A record 40-plus rounds of sanctions were slapped on Russia during Mr. Trump’s tenure.",
    "Mr. Biden has destroyed us from within and we as a nation have lost our confidence.",
    "NATO’s bean-counters are now, probably, thanking the Lord for Mr. Trump’s tenure.",
    "Vance, Mr. Trump and his supporters — all have faced this attack in recent weeks.",
    "Fox News host Tucker Carlson, Ohio Republican Senate candidate J.D.",
    "• Kelly Sadler is the commentary editor at The Washington Times.",
    "Is it any wonder that America First populists are concerned?",
    "America is not prepared to go to war, let alone win one.",
    "“America First” doesn’t mean America alone."
  ]
}