{
  "id": 3934,
  "mediaId": 2621,
  "date": "2022-02-28",
  "headline": "Liz Cheney’s Trump-Backed Challenger Skips Local Media For National Outlets Like OAN and Newsmax",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/02/harriet.jpg",
  "link": "https://www.mediaite.com/analysis/liz-cheneys-trump-backed-challenger-skips-local-media-for-national-outlets-like-oan-and-newsmax/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Griffing",
  "authorUrl": "https://www.mediaite.com/author/alex-griffing/",
  "termIds": [
    0
  ],
  "sentences": [
    "While the campaign to oust Cheney from the Republican Party over her vote to impeach former President Donald Trump and participation on the Jan. 6 committee is a national one, fueled by Trump himself, it will undoubtedly require beating Cheney at Wyoming politics — something she and her family have not only been working in and around for decades but largely helped to shape.",
    "Hageman responded by saying, “I don’t know if that’s what she’s doing.”\n“The reality is that I think Liz Cheney many years ago realized she could never get elected from Virginia, she looked around and thought you know I’ve got some ties to Wyoming I think I’ll go buy a house there and proclaim that I am a Wyomingite, which is what she did in 2012,” Hageman continued.",
    "I appreciated the chance to be in Casper to talk w/ @KCWY13 about how I’m fighting back against these policies in Congress: pic.twitter.com/7wabDKXQ44\n— Rep. Liz Cheney (@RepLizCheney) February 23, 2022\nHageman’s willingness to buck the long-held political axiom that “all politics is local” is undoubtedly a deliberate move.",
    "While local newsrooms have been closing across the country, accelerated by the loss of advertising and a variety of factors during the pandemic, online outlets, social media, podcasts, and opinion hosts have only continued to grow in influence — a change that will certainly be felt during the 2022 midterm elections.",
    "While candidates usually do everything they can to highlight their local media, Hageman has only tweeted out an op-ed she wrote in Cowboy State Daily and an interview she gave with Dave Iverson – who hosts a local radio show called Cowboy State Politics.",
    "Will Silverstein, a Wyoming political reporter and evening anchor for Cheyenne’s ABC/FOX affiliates, told Mediaite that a phone call with us is “more contact than he has had with the Hageman campaign” despite repeated efforts.",
    "“Once she pulled out of the Senate race, she went back to Virginia, and then when our House race, our House seat came up in 2016 she decided she’d come back to Wyoming and claim that that’s where she lived,” concluded Hageman.",
    "While on Bannon’s War Room podcast last week, the former Trump campaign manager asked Hageman if Cheney’s bid for reelection is just a precursor to challenging Trump for the Republican presidential nomination in 2024.",
    "Hageman officially announced her candidacy on September 9, immediately after Trump’s endorsement, and that night set the tone for her campaign as she appeared in an “exclusive” interview on Fox New’s Ingraham Angle.",
    "Instead, the interviews she shares on social media and her website are all from networks like Fox News, One America News Network, and Newsmax and with far-right flame throwers like Steve Bannon and Dinesh D’Souza.",
    "Hageman’s lack of engagement with local media is rare for a candidate in a state like Wyoming, where retail politics and local issues usually carry greater weight than national media and national issues.",
    "Hageman, who ran unsuccessfully for the GOP nomination for Wyoming governor in 2018 and advised Cheney on her short-lived Senate race in 2013, is breaking the mold by not engaging with local media.",
    "Cheney, whose father Dick Cheney served in her seat for a decade, out-raised Hageman by more than $1.5 million in the fourth quarter of 2021, bringing in $2 million to Hageman’s $443,000.",
    "While Hageman’s preference for national media may help drum up out-of-state donations, it’s also indicative of the nationalization of the news industry and the demise of local media.",
    "Rep. Liz Cheney’s (R-WY) primary opponent, Harriet Hageman, is campaigning by painting Cheney as out of step with Wyoming conservatives and calling her a carpetbagger from Virginia.",
    "Her embrace of pro-Trump, far-right figures like Bannon is also a hallmark of candidates who in the past were highly critical of Trump and are now working overtime to show loyalty.",
    "Cheney too is a fixture on national news, often giving interviews on cable news or to large publications, but she is quick to share her local media interviews on social media.",
    "Previously, Hageman was part of the so-called Never-Trump movement, calling Trump “somebody who is racist and xenophobic.” Since, much like Ohio Senate candidate J.D.",
    "Hageman, who received former President Trump’s highly coveted endorsement in September 2021, is now the leading Republican challenging Cheney in the August primary.",
    "Hageman — who spoke at CPAC last Friday — feeling the need to catch up in fundraising may explain her national media, MAGA-base focused campaign strategy.",
    "That large haul added to an already impressive war chest: Cheney brought in over $7 million in 2021 and ended the year with $4.7 million in the bank.",
    "Silverstein noted that Cheney’s GOP primary opponents were doing local press events and taking questions, up until Trump’s endorsement of Hageman.",
    "A quick search through Wyoming’s newspapers and Hageman’s campaign website and Twitter feed shows no interviews with Hageman in the local press.",
    "Meanwhile, Silverstein says he was not able to get into the event to speak with the candidate, despite showing up with his camera ready to go.",
    "On the flip-side, Silverstein notes that he has had seven one-on-one conversations with Cheney in the past year.",
    "The Hageman campaign did not respond to a request for comment about her media strategy or upcoming press events.",
    "Too often, one-size-fits-all policies from DC hurt our rural communities and our ag and energy industries.",
    "Vance, who made similar statements, she has sought to convince the MAGA-world those days are behind her.",
    "But she’s skipping local media and delivering that message primarily on national outlets instead.",
    "After Trump’s endorsement, the rest of the GOP field closed ranks behind Hageman."
  ]
}