{
  "id": 413,
  "mediaId": 2919,
  "date": "2022-04-19",
  "headline": "Dolan kicks off state tour ahead of GOP Senate primary",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/157229d/2147483647/strip/true/crop/1082x568+0+73/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Ffe%2Fcb%2F20d370054e5d864767e0c78f3801%2F2022-04-19-14-16-15.png",
  "link": "https://www.news5cleveland.com/news/election-2022/dolan-kicks-off-tour-ahead-of-ohio-gop-primary",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Kosich",
  "authorUrl": "https://www.news5cleveland.com/john-kosich",
  "termIds": [
    1804,
    2131,
    2201,
    3466,
    3920,
    4526,
    878,
    1171,
    5212
  ],
  "sentences": [
    "NORTH RIDGEVILLE, Ohio — Matt Dolan is looking to wrap up this primary campaign for the Republican nomination for U.S. Senate from Ohio the same way he started it nine months ago, touring the state meeting with voters.",
    "Among those five Dolan was the only one in a recent debate who said he wanted former President Trump to stop talking about the 2020 election and he was the only one not seeking the former president's endorsement.",
    "As I said most people are starting to decide now OK who is going to, whose the best prepared to go to Washington and take on the Biden Administration and who can set an agenda that we're for something.",
    "Dolan is one of seven hopefuls seeking the Republican nomination, a field that includes among others former state treasurer Josh Mandel, businessman Mike Gibbons, author and businessman J.D.",
    "Aside from the decision of former hopeful Bernie Moreno to drop out of the race earlier this year, the field hasn't changed from the beginning leaving Dolan in a lane uniquely his.",
    "“We're calling this the ‘no-nonsense tour’ because I can't say that everyone else has run on the issues, it's been theater for them,” he said.",
    "“They've been running a campaign to get his endorsement and now they're going to be fighting with each other to say no, they're more Trump.",
    "The reality is that I'm the one that's implemented Trump policies but I've stood for who I am and for what I have done,\" Dolan said.",
    "I mean I know who I'm fighting for and what I'm fighting for, my opponents are just causing fights,” Dolan said.",
    "\"I always knew that this race was going to break late for me and I'm very, very comfortable as to where we are.",
    "Now his goal, like his opponents, is to make that message strong enough to bring state GOP voters to his side.",
    "News 5 caught up with Dolan Tuesday as part of our effort to drop in on the hopefuls in these final two weeks.",
    "It was just after 8 a.m. Tuesday in North Ridgeville for the first of 20 stops over a six day period.",
    "\"My message is different from everyone else in this race,\" he said.",
    "Vance and former state GOP Chair Jane Timken.",
    "That nod going to J.D.",
    "Vance late last week."
  ]
}